{"paperId": "000f964393dafe113a8e66734d63b2a145844159", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models for Software Engineering: A Systematic Literature Review", "abstract": "Large Language Models (LLMs) have significantly impacted numerous domains, including Software Engineering (SE). Many recent publications have explored LLMs applied to various SE tasks. Nevertheless, a comprehensive understanding of the application, effects, and possible limitations of LLMs on SE is still in its early stages. To bridge this gap, we conducted a systematic literature review on LLM4SE, with a particular focus on understanding how LLMs can be exploited to optimize processes and outcomes. We collect and analyze 229 research papers from 2017 to 2023 to answer four key research questions (RQs). In RQ1, we categorize different LLMs that have been employed in SE tasks, characterizing their distinctive features and uses. In RQ2, we analyze the methods used in data collection, preprocessing, and application highlighting the role of well-curated datasets for successful LLM for SE implementation. RQ3 investigates the strategies employed to optimize and evaluate the performance of LLMs in SE. Finally, RQ4 examines the specific SE tasks where LLMs have shown success to date, illustrating their practical contributions to the field. From the answers to these RQs, we discuss the current state-of-the-art and trends, identifying gaps in existing research, and flagging promising areas for future study.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-21", "journal": {"name": "ArXiv", "volume": "abs/2308.10620"}, "authors": [{"authorId": "38542077", "name": "Xinying Hou"}, {"authorId": "2109712263", "name": "Yanjie Zhao"}, {"authorId": "100576986", "name": "Yue Liu"}, {"authorId": "2139059234", "name": "Zhou Yang"}, {"authorId": "3088630", "name": "Kailong Wang"}, {"authorId": "2156056522", "name": "Li Li"}, {"authorId": "2241568071", "name": "Xiapu Luo"}, {"authorId": "2150912791", "name": "David Lo"}, {"authorId": "2095462233", "name": "John C. Grundy"}, {"authorId": "51225422", "name": "Haoyu Wang"}], "citations": [{"paperId": "abd61863fc793d5fa0334b80dea2130ad543de70", "title": "The RealHumanEval: Evaluating Large Language Models' Abilities to Support Programmers"}, {"paperId": "3781a53a66a9de532b008b5152247689b0aaec5a", "title": "Large Language Model Evaluation Via Multi AI Agents: Preliminary results"}, {"paperId": "e8cbe2279dcfa4a76642090a935deec9abff7e6e", "title": "Enchanting Program Specification Synthesis by Large Language Models using Static Analysis and Program Verification"}, {"paperId": "006c4c7470566327e5b02b94936d0be0033fc9f5", "title": "MAGIS: LLM-Based Multi-Agent Framework for GitHub Issue Resolution"}, {"paperId": "7699dde48b197585c1c516a2de05fad0934582d7", "title": "Evaluating Large Language Models with Runtime Behavior of Program Execution"}, {"paperId": "cb744211cfc25c476167ee545883151266d9c223", "title": "Large Language Models for Blockchain Security: A Systematic Literature Review"}, {"paperId": "012f065d7623f391dad00b44f63b32112062344a", "title": "An Empirical Study on Developers Shared Conversations with ChatGPT in GitHub Pull Requests and Issues"}, {"paperId": "297d91c28bc64ce2b641859be251f2212af940f7", "title": "Reality Bites: Assessing the Realism of Driving Scenarios with Large Language Models"}, {"paperId": "7235c99f9c9bc3e56951a829ef30812ab39492b9", "title": "System for systematic literature review using multiple AI agents: Concept and an empirical evaluation"}, {"paperId": "8b7fee2d868132955d0eed1ef33d49b49c5f456e", "title": "Data-driven Discovery with Large Generative Models"}, {"paperId": "2b673c70adc61e349814f5a0fe76edae63d4557e", "title": "Enhancing Large Language Models for Text-to-Testcase Generation"}, {"paperId": "79ad06daf54472aec5d5ba496320b838059a629a", "title": "API Pack: A Massive Multilingual Dataset for API Call Generation"}, {"paperId": "e5f7d54842174a23bab117672a75f7535e4aacff", "title": "Utilizing Large LanguageModels to Detect Privacy Leaks in Mini-App Code"}, {"paperId": "f64e917b0b88eb8401c526c1e808a50db9cd0e26", "title": "Detecting Scams Using Large Language Models"}, {"paperId": "5bdd1f19d5a54988d8cbe74714f3d3749fff0109", "title": "Deep Learning Model Reuse in the HuggingFace Community: Challenges, Benefit and Trends"}, {"paperId": "65ef87567021c6c4befe1f3b7690f8bfcb337f82", "title": "Code Simulation Challenges for Large Language Models"}, {"paperId": "2b6fe3e433707b5521ed2a50274c27ea8750b40f", "title": "SpecGen: Automated Generation of Formal Program Specifications via Large Language Models"}, {"paperId": "2e3617718b7a73e091583b61f6ffdfeb719dcb66", "title": "Automated Test Case Repair Using Language Models"}, {"paperId": "a99e9e3146fbe37b98ff4ed2ad07c07212af9b9e", "title": "Using Large Language Models for Commit Message Generation: A Preliminary Study"}, {"paperId": "c9ce13801d5247d4ef98a6550f35080234dbf0ed", "title": "Exploring ChatGPT for Toxicity Detection in GitHub"}, {"paperId": "8596a700705502563f5549fa005014cfff2b675d", "title": "Domain-Specific Code Language Models: Unraveling the Potential for HPC Codes and Tasks"}, {"paperId": "8352ca18ab506ec1c8061db1b9399c553f2f9307", "title": "Resolving Crash Bugs via Large Language Models: An Empirical Study"}, {"paperId": "8a6a72afbcc1080212d105f8de02239c8718ef35", "title": "Chain-of-Thought in Neural Code Generation: From and For Lightweight Language Models"}, {"paperId": "9fe9b361e954554d38d209205db8ba83139c1e9e", "title": "Are We Testing or Being Tested? Exploring the Practical Applications of Large Language Models in Software Testing"}, {"paperId": "7122c0194a015ebe62deda2e348b726252e53354", "title": "LLM Interactive Optimization of Open Source Python Libraries - Case Studies and Generalization"}, {"paperId": "383c598625110e0a4c60da4db10a838ef822fbcf", "title": "A Survey on Large Language Model (LLM) Security and Privacy: The Good, the Bad, and the Ugly"}, {"paperId": "b02d37dd96f7fc8aaa9470059237893046a2cf86", "title": "Flexible and Secure Code Deployment in Federated Learning using Large Language Models: Prompt Engineering to Enhance Malicious Code Detection"}, {"paperId": "e1b7f13051bec4a713c6226c177b63599d49e3e9", "title": "LLM-Assisted Code Cleaning For Training Accurate Code Generators"}, {"paperId": "d80fa93d1d72c578ebf73444c3d249ed283d5aba", "title": "Automatic Smart Contract Comment Generation via Large Language Models and In-Context Learning"}, {"paperId": "8a5cb33f743cabef77c914e015cefc35453383f9", "title": "ChatGPT and Finetuned BERT: A Comparative Study for Developing Intelligent Design Support Systems"}, {"paperId": "08fc84afe6b5ca286f4fcf43b386b77fd9b67c58", "title": "SkipAnalyzer: A Tool for Static Code Analysis with Large Language Models"}, {"paperId": "a378e5e4cb035dd63268c0cb626577edec82f2a9", "title": "Enhancing Genetic Improvement Mutations Using Large Language Models"}, {"paperId": "5c707c95cf59d9de7f05914374e720b9f02f8ef0", "title": "Can GPT-4 Replicate Empirical Software Engineering Research?"}, {"paperId": "208a08e7df7ed5f951d1ffddf0e038bb1429aa9f", "title": "Large Language Model-Powered Smart Contract Vulnerability Detection: New Perspectives"}, {"paperId": "f22230876e57d4cbab64bf94109d1ca33831e8da", "title": "Gotcha! This Model Uses My Code! Evaluating Membership Leakage Risks in Code Models"}, {"paperId": "baabd793ea2e9b101eb26c7d0ea83b7d0b7bcd6e", "title": "Exploring the ChatGPT Approach for Bidirectional Traceability Problem between Design Models and Code"}, {"paperId": "8440ccee19e2c8291f167292f42d4e2f6b64458d", "title": "Model Review: A PROMISEing Opportunity"}, {"paperId": "6987c95f7054d2653178ac93df52aa3c0b99fcf5", "title": "MASTERKEY: Automated Jailbreaking of Large Language Model Chatbots"}, {"paperId": "30c4271ac929af5c5c3b4f5afba8e0beb215138e", "title": "Trustworthy and Synergistic Artificial Intelligence for Software Engineering: Vision and Roadmaps"}, {"paperId": "4fbd174e80502f8f3c4b9f48054872b028e2445a", "title": "Large Language Models for Software Engineering: Survey and Open Problems"}, {"paperId": "499dc9e4cea901dd42d79d96407b93459e308873", "title": "Evaluating Explanations for Software Patches Generated by Large Language Models"}, {"paperId": "24de1048791bac4972ecc16d1c3c1de23691407d", "title": "Large Language Models: A Comprehensive Survey of its Applications, Challenges, Limitations, and Future Prospects"}, {"paperId": "eaf52a96efd77675130196b32ca3ae25e03b0d35", "title": "Evaluating the Cybersecurity Robustness of Commercial LLMs against Adversarial Prompts: A PromptBench Analysis"}, {"paperId": "08aa472d5e5b8f98960f2204a75399d7caadebba", "title": "Is Attention All You Need? Toward a Conceptual Model for Social Awareness in Large Language Models"}]}
