{"paperId": "0026ea8a0fd31bdc959a4b9ed4d449f3015be8d1", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Big Data and Its Applications in Smart Real Estate and the Disaster Management Life Cycle: A Systematic Analysis", "abstract": "Big data is the concept of enormous amounts of data being generated daily in different fields due to the increased use of technology and internet sources. Despite the various advancements and the hopes of better understanding, big data management and analysis remain a challenge, calling for more rigorous and detailed research, as well as the identifications of methods and ways in which big data could be tackled and put to good use. The existing research lacks in discussing and evaluating the pertinent tools and technologies to analyze big data in an efficient manner which calls for a comprehensive and holistic analysis of the published articles to summarize the concept of big data and see field-specific applications. To address this gap and keep a recent focus, research articles published in last decade, belonging to top-tier and high-impact journals, were retrieved using the search engines of Google Scholar, Scopus, and Web of Science that were narrowed down to a set of 139 relevant research articles. Different analyses were conducted on the retrieved papers including bibliometric analysis, keywords analysis, big data search trends, and authors’ names, countries, and affiliated institutes contributing the most to the field of big data. The comparative analyses show that, conceptually, big data lies at the intersection of the storage, statistics, technology, and research fields and emerged as an amalgam of these four fields with interlinked aspects such as data hosting and computing, data management, data refining, data patterns, and machine learning. The results further show that major characteristics of big data can be summarized using the seven Vs, which include variety, volume, variability, value, visualization, veracity, and velocity. Furthermore, the existing methods for big data analysis, their shortcomings, and the possible directions were also explored that could be taken for harnessing technology to ensure data analysis tools could be upgraded to be fast and efficient. The major challenges in handling big data include efficient storage, retrieval, analysis, and visualization of the large heterogeneous data, which can be tackled through authentication such as Kerberos and encrypted files, logging of attacks, secure communication through Secure Sockets Layer (SSL) and Transport Layer Security (TLS), data imputation, building learning models, dividing computations into sub-tasks, checkpoint applications for recursive tasks, and using Solid State Drives (SDD) and Phase Change Material (PCM) for storage. In terms of frameworks for big data management, two frameworks exist including Hadoop and Apache Spark, which must be used simultaneously to capture the holistic essence of the data and make the analyses meaningful, swift, and speedy. Further field-specific applications of big data in two promising and integrated fields, i.e., smart real estate and disaster management, were investigated, and a framework for field-specific applications, as well as a merger of the two areas through big data, was highlighted. The proposed frameworks show that big data can tackle the ever-present issues of customer regrets related to poor quality of information or lack of information in smart real estate to increase the customer satisfaction using an intermediate organization that can process and keep a check on the data being provided to the customers by the sellers and real estate managers. Similarly, for disaster and its risk management, data from social media, drones, multimedia, and search engines can be used to tackle natural disasters such as floods, bushfires, and earthquakes, as well as plan emergency responses. In addition, a merger framework for smart real estate and disaster risk management show that big data generated from the smart real estate in the form of occupant data, facilities management, and building integration and maintenance can be shared with the disaster risk management and emergency response teams to help prevent, prepare, respond to, or recover from the disasters.", "venue": "Big Data and Cognitive Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-26", "journal": {"name": "Big Data Cogn. Comput.", "pages": "4", "volume": "4"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "1657644010", "name": "S. Qayyum"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "90426770", "name": "S. Sepasgozar"}], "citations": [{"paperId": "809fdcc7292aa9782d0de13642d23bf61f8de73a", "title": "Fusing talent horizons: the transformative role of data integration in modern talent management"}, {"paperId": "63bf40490b24877e9aaa8ccf866b00783d095734", "title": "An optimized topic modeling question answering system for web-based questions"}, {"paperId": "d2090a0ef01fe9fcf834267a8361b1feafefcb77", "title": "A valorization framework to strategically manage data for creating competitive value"}, {"paperId": "45eba28311f535daaee3fe1e64bf091eeb0435d2", "title": "TO ASSESS THE LEVEL OF SATISFACTION OF BUYERS IN THE REAL ESTATE SECTOR"}, {"paperId": "dde0557ce851567260b1442df21b5bd7a7254a8f", "title": "Digital real estate: a review of the technologies and tools transforming the industry and society"}, {"paperId": "27591e2210d67d4e57c3ad620865e359fd8f5fbd", "title": "Implementation of the Internet of Things for early Floods in Agricultural Land using Dimensionality Reduction Technique and Ensemble ML"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "6ef98203188c233071b86380a911b4edf6a50549", "title": "Intelligent Method for Classifying the Level of Anthropogenic Disasters"}, {"paperId": "916227d0ba290591c30d78b7c0f4a7f076289bc4", "title": "Bibliometric and content analyses of research on technology use in real estate facilities management"}, {"paperId": "20bd3d528fa8675262887b2d1977e40240676c93", "title": "Is a Smart City Framework the Key to Disaster Resilience? A Systematic Review"}, {"paperId": "bd011476cbd6612565d9dae4536eeb7102a9c155", "title": "Land Cover Mapping and Change Analysis Using Optimized Random Forest Classifier Incorporating Fusion of Texture and Gabor Features"}, {"paperId": "9fae76e9d08fe817b5237b9361cc88437096bdc9", "title": "A Systematic Bibliometric Analysis of the Real Estate Bubble Phenomenon: A Comprehensive Review of the Literature from 2007 to 2022"}, {"paperId": "9d30b63c62d9ee9d8b1ab86d6dacf59b9875c815", "title": "The Effect of Sustainable Brand Equity on Customer Satisfaction and Customer Loyalty Using Customer Trust as Mediation Variable"}, {"paperId": "87a90b8b454555e65c7951522c4babd17aac0e61", "title": "The present and future of the digital transformation of real estate: A systematic review of smart real estate"}, {"paperId": "78b4122d1c51638cdec9adee059493a976bcd831", "title": "Intelligence Information Intervention in Emergency Management of Emergencies: The Case of the “7.20 Zhengzhou Rainstorm”"}, {"paperId": "e9a7d63ace49b501fa0efbc1fe85c247202e23bd", "title": "Crisis Management in shopping malls using Different Regression Models"}, {"paperId": "6d26057f202f3346785eec76e85ecd44d9a67c80", "title": "Factors for the implementation of the circular economy in Big Data environments in service companies in post pandemic times of COVID-19: The case of Colombia"}, {"paperId": "90f81e901b18612d528aad6c891a435ce098e70c", "title": "Enhancing Digital Health Services with Big Data Analytics"}, {"paperId": "6a4ad32b4744461b37a0c763a481de31774260d7", "title": "How can big data and predictive analytics impact the performance and competitive advantage of the food waste and recycling industry?"}, {"paperId": "9a1069d32f0b42d50898d5b7e0c4cfaf19569335", "title": "Research on Safety and Integrated Disaster Prevention System Based on Big Data Technology"}, {"paperId": "f51eed586ed39142cfc1a5080635dea68177b47e", "title": "Template-driven Real-time Data Acquisition Technique with Big Data"}, {"paperId": "aac8c3a209f85338326460a92c7595367f12a9bb", "title": "Network Information Resource Allocation under Big Data Technology"}, {"paperId": "641b46fc44d6c7db82640ad6f15da260589513ef", "title": "State-of-the-Art of Artificial Intelligence and Big Data Analytics Reviews in Five Different Domains: A Bibliometric Summary"}, {"paperId": "91a6858aa5969fb55eb2a12f6b86556b0acc76d0", "title": "Drivers and impact of big data analytic adoption in the retail industry: A quantitative investigation applying structural equation modeling"}, {"paperId": "605b8ced549a2a08691ab2111572a7f58d0e11a0", "title": "Pre-disaster Management based Machine Learning, IoT and Big Data: Survey and future direction"}, {"paperId": "d34e1fa8d888bbccc8cce0ed25d96172cb186b0f", "title": "Impact of Digital Twins and Metaverse on Cities: History, Current Situation, and Application Perspectives"}, {"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect"}, {"paperId": "d104c6dd4b02da2aaf6b71957f65d63e75343629", "title": "The predicting public sentiment evolution on public emergencies under deep learning and internet of things"}, {"paperId": "3acaf0ef1181e5c61590f61b5bfb646164f967d6", "title": "Estate Surveyors and Valuers’ Perception of the Role of Big Data in Property Marketing in Lagos, Nigeria"}, {"paperId": "2b86ca2bb9cd254b52f06e913bb8034487c4c477", "title": "Octobot - Web Scarping towards retrieving Google Scholar Data"}, {"paperId": "cedd7e6ee2b790fc13d52b93815dc75742980a5d", "title": "Using Real-Time Dashboards to Monitor the Impact of Disruptive Events on Real Estate Market. Case of COVID-19 Pandemic in Australia"}, {"paperId": "43a490b0a04706e3c7fe409bd4a038442c3eec8f", "title": "Disaster-Resilient Communities on Flood Plains and Their Agricultural Regeneration: A Case Study in Meinong Plain, Taiwan"}, {"paperId": "4e7e3c2b4b997c639f8cc0684d9d81dc3b7f7543", "title": "Optimization of Network Furniture Management System Based on Big Data"}, {"paperId": "6a4929a788a05e489a0c59401a5a5060a5a96867", "title": "SIGNIFICANCE OF ANALYTICS"}, {"paperId": "b8d23c4f5157419218a2c50aaa446a06631eeaab", "title": "A new adaptive sampling algorithm for big data classification"}, {"paperId": "6f0c13db767455303c3571222dc9d25c9371ed7f", "title": "Internet of Things Data Visualization for Business Intelligence."}, {"paperId": "cb1c1fdb8464a409f05624d6247cfdf38e47de42", "title": "Factors Influencing the Adoption of Big Data Analytics in the Digital Transformation Era: Case Study of Jordanian SMEs"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "46ee405bd0af7e67f8fe990019f8715188f89df6", "title": "Factors Affecting Big Data Adoption: An Empirical Study in Small and Medium Enterprises in Vietnam"}, {"paperId": "6a4ee8469c67580db3423fee001fdcab862d2820", "title": "Modern Monitoring Instrument to Support Fishing Vessel Operation and Maintenance: A Review"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "14184fbd923c5c48fb55fa0978f75b515a9fa9d6", "title": "Reducing cooling load and lifecycle cost for residential buildings: a case of Lahore, Pakistan"}, {"paperId": "de32c29aa83312de76a5148ebd90536e24f78492", "title": "Disruptive technologies as a solution for disaster risk management: A review."}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "d900b40852708bb49310856a60248b399be96a34", "title": "Machine Learning and Artificial Intelligence Based Identification of Risk Factors and Incidence of Gastroesophageal Reflux Disease in Pakistan"}, {"paperId": "813106acd36ddb8ba26c0acb114f26ae906e2cf2", "title": "Big-Data Management: A Driver for Digital Transformation?"}, {"paperId": "67e50a02eafa7ef71d11399ecbcfa579899f5294", "title": "Modelling users' perception of the online real estate platforms in a digitally disruptive environment: An integrated KANO-SISQual approach"}, {"paperId": "cf39cc61ecbe45f70f1c1ace67bb2ff9d312f2ee", "title": "Infrastructure, mobility and safety 4.0: Modernization in road transportation"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}, {"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires"}, {"paperId": "c5a7552d525641b5698ed643e5493880dea13bfe", "title": "Managing smart cities through six sigma DMADICV method: A review-based conceptual framework"}, {"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment"}, {"paperId": "e63d9ea370d91c16e46be03dc833fcef4d6f6470", "title": "Intelligent free energy usage through radiant energy space phenomenon: An IoT-powered prototype for modified Bedini generator"}, {"paperId": "4deeaa2e43d6dfd526df58339412293fd7209d4c", "title": "Application of the Docking Protocol Optimization for Inhibitors of IGF-1R and IR and Understanding them through Artificial Intelligence and Bibliography"}, {"paperId": "17f1b2cbbaffd0f3511d1752a048cd88dd65dc71", "title": "UAV Assisted Spatiotemporal Analysis and Management of Bushfires: A Case Study of the 2020 Victorian Bushfires"}, {"paperId": "d57d21856bf6cb1a056cc01921d7f74e0ac13c87", "title": "A Gabor Filter-Based Protocol for Automated Image-Based Building Detection"}, {"paperId": "dc6c200711f7a0667d1dfd67cfa4199b9445ab03", "title": "UAVs in Disaster Management: Application of Integrated Aerial Imagery and Convolutional Neural Network for Flood Detection"}, {"paperId": "f497d84a0bcb2322bdec006fef4c9ae25c02c03c", "title": "Localization of Sound Sources: A Systematic Review"}, {"paperId": "0ded846831f881faa4632fb51de7811d4ffb45a5", "title": "Sound Localization for Ad-Hoc Microphone Arrays"}, {"paperId": "e03ecf5b9dc826824459a2eeef75b9063a125280", "title": "Data Driven Through Machine Learning on Electricity Production by Anode Respiring Bacteria Using the Microbial Fuel Cells"}, {"paperId": "03d12d332eb793d032bca60c5dc702281d41115f", "title": "Risk management in sustainable smart cities governance: A TOE framework"}, {"paperId": "0dff531d86f95b9edca7c96a7da678510ef84771", "title": "Post-Flood Risk Management and Resilience Building Practices: A Case Study"}, {"paperId": "2415de181c8c54b0ece76003729d3b7971005e05", "title": "Analysis of the State of Learning in University Students with the Use of a Hadoop Framework"}, {"paperId": "ec89022a103a14325faa264ffe6fe92f9779ced8", "title": "Investigating the flood damages in Lower Indus Basin since 2000: Spatiotemporal analyses of the major flood events"}, {"paperId": "0e49abb18a71eadecbb672fc6f3f6b931b7b5244", "title": "The Cell Cycle Model: A Comprehensive Review and Extension Based on Machine Learning"}, {"paperId": "cb9108d72ffd489339fb09ac4efda664ada98176", "title": "Barriers to the digitalisation and innovation of Australian Smart Real Estate: A managerial perspective on the technology non-adoption"}, {"paperId": "f0df59dcb11e297927e4ac0899559254e10880ae", "title": "Advertising through UAVs: Optimized path system for delivering smart real‐estate advertisement materials"}, {"paperId": "b045bed810823b2667c8325e015fb1bb6b1a459f", "title": "A conceptual framework for blockchain smart contract adoption to manage real estate deals in smart cities"}, {"paperId": "2abf2a90e68288480d14f6d18b629a541ab29814", "title": "Using cloud computing platform of 6G IoT in e-commerce personalized recommendation"}, {"paperId": "bfac7d29d184406bd282cffeb83b7ccaa09185dc", "title": "Insight into the Impact of COVID-19 on Australian Transportation Sector: An Economic and Community-Based Perspective"}, {"paperId": "d2e5b466d7a60ef0a91d1e732543ef8c793b5324", "title": "Predicting the energy output of hybrid PV–wind renewable energy system using feature selection technique for smart grids"}, {"paperId": "ec9a14a23c852ce069dcb62cba202a762b75dd99", "title": "Identification of efficient COVID-19 diagnostic test through artificial neural networks approach − substantiated by modeling and simulation"}, {"paperId": "bbb021426c859e88dc317ab4f9544cd5d0d64785", "title": "Competitiveness in the construction industry: A contractor’s perspective on barriers to improving the construction industry performance"}, {"paperId": "a19c6fbfb1ea9746224b2e9ca89da72829943b68", "title": "Examining the impact of students’ attendance, sketching, visualization, and tutors experience on students’ performance: a case of building structures course in construction management"}, {"paperId": "276a1b5129df2d5f6fbdd77782d4cd2ec49e3d50", "title": "Smart Digital Marketing Capabilities for Sustainable Property Development: A Case of Malaysia"}, {"paperId": "5cb748b0cd8331444555f8951964d07bbb62d479", "title": "Key Factors Influencing Purchase or Rent Decisions in Smart Real Estate Investments: A System Dynamics Approach Using Online Forum Thread Data"}, {"paperId": "484f682813fe6923a58dc16b9250d14f95706680", "title": "A Data-Driven Smart Evaluation Framework for Teaching Effect Based on Fuzzy Comprehensive Analysis"}, {"paperId": "014de1b3bbfdb02efaca280df87739104717a246", "title": "Information ethics enforcement challenges in the real estate industry: A study of the emerging economy"}, {"paperId": "11b021ee323610b25370983d8e6c4b428e5ff517", "title": "Modeling and evaluating economic and ecological operation efficiency of smart city pilots"}, {"paperId": "59a1719549feae79c13c00236e17df2a623ac5c9", "title": "Has Smart City Construction Reduced Corporate Pollution Emissions? New Evidence from Chinese Corporate Pollution Data"}, {"paperId": "09b17532657eeda785b0da1dbc5fded6ab31f859", "title": "Addressing disasters in smart cities through UAVs path planning and 5G communications: A systematic review"}, {"paperId": "955775f41560e07b3db008b4c5e137cdce3db01e", "title": "Digital Transformation to Build Smart Cities"}]}
