{"paperId": "00262aedf74fb4f65cedd79cd66fcdf0f8847f15", "publicationVenue": {"id": "a1b15bc8-157e-45a9-b4c8-8211f938775d", "name": "IEEE Communications Magazine", "type": "journal", "alternate_names": ["IEEE Commun Mag"], "issn": "0163-6804", "url": "http://www.comsoc.org/commag", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=35"]}, "title": "Intelligent Wireless Sensor Network Deployment for Smart Communities", "abstract": "Smart Communities demand a huge amount of data to monitor different human activities. Until now, wireless sensor networks (WSNs) have provided these data with a low cost and low intelligence networks. However, the constraints and the required baseline performance of WSNs have increased exponentially, and there is a lack of a global proposal to satisfy the demand of Smart Communities. There are several approaches regarding efficient WSN deployments to maximize network lifetime and performance. The vast majority of those proposals try to separately address several inherent constraints and limitations related to energy and node lifetime. In fact, they typically provide efficient management approaches based on existing solutions, but they do not propose new tools or algorithms to afford them. To tackle this problem in a global manner, we introduce the concept of intelligent WSNs. In order to outfit the WSN with a huge amount of possibilities to route and control the different nodes, our nodes incorporate the possibility of transmitting and receiving signals from/to several nodes jointly through beamforming. In our approach, this latter technique is intelligently applied to allow the deployment of new WSNs to be able to react and to adapt its features depending on the environmental conditions, maintaining QoS and enlarging network lifetime. This is the main goal of our proposal.", "venue": "IEEE Communications Magazine", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-01", "journal": {"name": "IEEE Communications Magazine", "pages": "176-182", "volume": "56"}, "authors": [{"authorId": "145058531", "name": "F. Luna"}, {"authorId": "1401000132", "name": "J. Valenzuela-Valdés"}, {"authorId": "1718316", "name": "S. Sendra"}, {"authorId": "145865487", "name": "P. Padilla"}], "citations": [{"paperId": "1a27e3ca7fea66d05998aa2fafed3f40adf409e4", "title": "Heterogeneous Cluster-Based Information-Centric Sensor Networks With User Security Satisfaction"}, {"paperId": "cfc27c0d631cda796dca73f239f80866b6c2d62a", "title": "A distributed self‐organising node deployment algorithm for mobile sensor networks"}, {"paperId": "d1e180a6b9b73889df94b347ed303dc54aa523be", "title": "Deployment Optimization Algorithms in Wireless Sensor Networks for Smart Cities: A Systematic Mapping Study"}, {"paperId": "eed07d0cb60397e042e86de0e93f897b607c4169", "title": "A new system to detect coronavirus social distance violation"}, {"paperId": "c810d62feb6bc601cea26e56aca2ed9fb6ee379b", "title": "Time-bandwidth product of noise-like pulses within the mode-locked regions of a figure-eight fiber laser: theoretical and experimental analysis"}, {"paperId": "3f890a60e60e48d20fd5ba71dbb5ce541c93a06f", "title": "Machine Learning and Deep Learning Techniques in Wireless and Mobile Networking Systems"}, {"paperId": "530ee2359eff03048fdbf7d807d3679d030fd2de", "title": "Experimental evolution of the temporal and spectral profiles of noise-like pulses within the mode-locked regions of a figure-eight fiber laser."}, {"paperId": "098e6b1770cb5223a34a42798c55a3c266033615", "title": "An integrated fire detection system using IoT and image processing technique for smart cities"}, {"paperId": "1148c794c8efb8fe94107b4a6820ddee16855b7e", "title": "A Low-Cost Information Monitoring System for Smart Farming Applications"}, {"paperId": "ce70aab95cbdd32e0cdd7f0f354fa03de9e6ec55", "title": "An Optimized Node Deployment Solution Based on a Virtual Spring Force Algorithm for Wireless Sensor Network Applications"}, {"paperId": "747a11d3c008fe4920ea4150c1a9e500965c33b5", "title": "Time Estimation of a Miniature Atomic Clock Using Instantaneous Frequency Information"}, {"paperId": "37bdaaa00767d32b7c9704e564ac2640fddb7563", "title": "IoT and Intelligent Wireless Sensor Network for Remote Monitoring Systems of Solar Power Stations"}]}
