{"paperId": "0035081fad29cd6fb05fef6ce9eded0281e25a53", "publicationVenue": {"id": "7bf51cb8-4a54-4bc9-919c-8f67d9f7d0ae", "name": "International Conference on Information Security and Cryptology", "type": "conference", "alternate_names": ["IEEE Int Conf Intell Syst Control", "ICISC", "IEEE International Conference on Intelligent Systems and Control", "Int Conf Inf Secur Cryptol"], "url": "http://www.wikicfp.com/cfp/program?id=1397"}, "title": "POXIEM: An ELK Integrated SDN Controller Proposal for Improved Control Plane Forensic Visibility and Incident Response", "abstract": "Software-Defined Networking (SDN) has revolutionized network management by decoupling the control plane from the data plane, enabling dynamic and flexible network configurations. This architectural shift introduces new challenges in maintaining control plane visibility and effectively detecting and mitigating potential threats. However, the security of the control plane and the server hosting the SDN controller has received limited attention compared to data plane security. In this study, we address this gap by presenting a comprehensive approach that combines custom log parsers, additional granular logging functions, and the integration of the POX SDN controller with the Elastic Stack (ELK) to monitor both the security of the server hosting controller and control plane operations against potential threats and provide forensically sound evidence for incident response. Our results confirm the efficacy of our proposed solution, with easy-to-parse structured logs and strong filtering and visualization capabilities providing comprehensive analytics. These capabilities contribute to improved control plane visibility and enhanced security for both the control plane and the hosting system in SDN environments.", "venue": "International Conference on Information Security and Cryptology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-18", "journal": {"name": "2023 16th International Conference on Information Security and Cryptology (ISCTürkiye)", "pages": "1-6"}, "authors": [{"authorId": "121119112", "name": "Mevlut Serkan Tok"}, {"authorId": "2274002960", "name": "Mehmet Demirci"}], "citations": []}
