{"paperId": "003c34e995ffab723b17eac86a1758703b7fb99b", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "A Cost Estimation Technique for Recursive Relational Algebra", "abstract": "With the increasing popularity of data structures such as graphs, recursion is becoming a key ingredient of query languages in analytic systems. Recursive query evaluation involves an iterative application of a function or operation until some condition is satisfied. It is particularly useful for retrieving nodes reachable along deep paths in a graph. The optimization of recursive queries has remained a challenge for decades. Recently, extensions of Codd's classical relational algebra to support recursive terms and their optimisation gained renewed interest [10]. Query optimization crucially relies on enumeration of query evaluation plans and on cost estimation techniques. Cost estimation for recursive terms is far from trivial, and received less attention. In this paper, we propose a new cost estimation technique for recursive terms of the extended relational algebra. This technique allows to select an estimated cheapest query plan, in terms of computing resources usage e.g. memory footprint, CPU and I/O and evaluation time. We evaluate the effectiveness of our cost estimation technique on a set of recursive graph queries on both generated and real datasets of significant size, including Yago: a graph with more than 62 millions edges and 42 million nodes. Experiments show that our cost estimation technique improves the performance of recursive query evaluation on popular relational database engines such as PostgreSQL.", "venue": "International Conference on Information and Knowledge Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-10-19", "journal": {"name": "Proceedings of the 29th ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": "2133999502", "name": "Muideen Lawal"}, {"authorId": "1768207", "name": "P. Genevès"}, {"authorId": "1685111", "name": "Nabil Layaïda"}], "citations": [{"paperId": "29d961378ce940bd92ffb009dff73bc4a1a64875", "title": "The µ-RA System for Recursive Path Queries over Graphs"}, {"paperId": "b531e779cedc0789bd5144a8860da35b5de85d77", "title": "Efficient Iterative Programs with Distributed Data Collections"}, {"paperId": "e9dcffb2fc37f783e9cd4ff3b31f1dc635253d4f", "title": "Recursive SQL for Data Mining"}, {"paperId": "4bda11d65fe60059810b09b4881fba6a71af66e5", "title": "Distributed Evaluation of Graph Queries using Recursive Relational Algebra"}, {"paperId": "0ff498f65950f3f21c0a7bbf637dd7c057f883f2", "title": "A Systematic Literature Review on Software Development Estimation Techniques"}, {"paperId": "eb1b4896e07ddc41e3fdc49b3ca38bf0f00a6441", "title": "On the Optimization of Iterative Programming with Distributed Data Collections"}, {"paperId": "64f6b09532b7f2ce82021fe8dc88e895c6608d34", "title": "Exploring Labeled Graphs with Recursive Path Patterns"}, {"paperId": "db66a6c6036f0b071cf59060a09b1f01c94ed823", "title": "Optimizing Enumeration of Recursive Plans in Transformation-based Query Optimizers"}]}
