{"paperId": "0042e7fb24a6622f7e00aa651f1bd13a0515a3d5", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Parameter Estimation of Solar PV Using Ali Baba and Forty Thieves Optimization Technique", "abstract": "The modeling of a solar PV system is challenging due to its nonlinear current vs. voltage characteristics. Although various optimization techniques have been applied for the parameter estimation of the solar PV system, there is still a scope to attain the best-optimized results. This paper uses a new meta-heuristic optimization algorithm and a classical technique named Ali Baba and the Forty Thieves (AFT) with Newton Rapson (NR) method to estimate solar PV system parameters. The well-known story of Ali Baba and the Forty Thieves has inspired the AFT. Besides, the inappropriate objective function used in earlier research to extract parameters from solar PV models is recognized. The experimental findings demonstrate that the suggested approach performs better when compared to state-of-the-art algorithms. Between the measured data and the computed data for AFT, the root mean square error values for the five PV models, such as single diode model (SDM), double diode model (DDM), Photowatt-PWP201, STM6-40/36, and STP6-120/36, are respectively 7.72 × 10−04 ± 6.121 × 10−16, 7.412 × 10−04 ± 9.52 × 10−06, 2.052 × 10−03 ± 3.05 × 10−17, 0.001721922 ± 2.19 × 10−17, and 0.014450817 ± 3.42 × 10−16. In terms of accuracy, the obtained results indicate that the proposed AFT algorithm is more efficient than the other optimization techniques available in the literature. The excellent correlation between the estimated parameters from characteristic curves and observed data for SDM, DDM, Photowatt-PWP201, STM6-40/36, and STP6-120/36 demonstrates that the proposed AFT is a potential option among the techniques available in the literature. The Friedman and Wilcoxon tests have been used to assess the statistical validity of the proposed algorithms.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-29", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "143656421", "name": "Pankaj Sharma"}, {"authorId": "144394143", "name": "Saravanakumar Thangavel"}, {"authorId": "1490894899", "name": "S. Raju"}, {"authorId": "34587425", "name": "B. Prusty"}], "citations": [{"paperId": "1bffe5266c41a48fa42cb7de1fb34e094d52f143", "title": "A multi-hybrid algorithm with shrinking population adaptation for constraint engineering design problems"}, {"paperId": "9593398c2546d725212b86c55fddadea8e508521", "title": "An evolutionary multi-algorithm based framework for the parametric estimation of proton exchange membrane fuel cell"}, {"paperId": "6999226553c2f3a87ba7793d9bef34811c6911a4", "title": "Design of 37-Level Inverter with Reduced Switch Count for Low Total Harmonic Distortion"}, {"paperId": "c990c1bc524912b8517f9d2517fdcc507231dd1e", "title": "Parametric estimation of photovoltaic systems using a new multi-hybrid evolutionary algorithm"}, {"paperId": "0804ece5b3b569dae74c3590e1a7c59cf1a8d07b", "title": "Metaheuristic optimization algorithms: a comprehensive overview and classification of benchmark test functions"}, {"paperId": "c6879eeeb8af54460452bcd4c7e2ce70e1599548", "title": "Efficient Estimation of PV Parameters for Existing Datasets by Using an Intelligent Algorithm"}, {"paperId": "2a87c8768699ae1bef29ba4e37409c3ee59d09e7", "title": "Investigation on reliability of classical industrial motor drives using GoldSim Monte Carlo reliability workbench"}, {"paperId": "74f4e4b2b04d0aa401a60ab6f9a551cbd06f2068", "title": "A Comprehensive Review on Electric Vehicle: Battery Management System, Charging Station, Traction Motors"}]}
