{"paperId": "00484d239713ec9daf91b89637342f86025c27c5", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "TSCache: An Efficient Flash-based Caching Scheme for Time-series Data Workloads", "abstract": "\n Time-series databases are becoming an indispensable component in today's data centers. In order to manage the rapidly growing time-series data, we need an effective and efficient system solution to handle the huge traffic of time-series data queries. A promising solution is to deploy a high-speed, large-capacity cache system to relieve the burden on the backend time-series databases and accelerate query processing. However, time-series data is drastically different from other traditional data workloads, bringing both challenges and opportunities. In this paper, we present a flash-based cache system design for time-series data, called\n TSCache\n . By exploiting the unique properties of time-series data, we have developed a set of optimization schemes, such as a slab-based data management, a two-layered data indexing structure, an adaptive time-aware caching policy, and a low-cost compaction process. We have implemented a prototype based on Twitter's Fatcache. Our experimental results show that TSCache can significantly improve client query performance, effectively increasing the bandwidth by a factor of up to 6.7 and reducing the latency by up to 84.2%.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "3253-3266", "volume": "14"}, "authors": [{"authorId": "2150168137", "name": "Jian Liu"}, {"authorId": "7200817", "name": "Kefei Wang"}, {"authorId": "144180429", "name": "F. Chen"}], "citations": [{"paperId": "68fdc992cf1b9e1b33110380a3f93e32027abd47", "title": "Khronos: A Real-Time Indexing Framework for Time Series Databases on Large-Scale Performance Monitoring Systems"}, {"paperId": "0d5abe32667ec6084d7c7b3a8afb342710fa040d", "title": "DecLog: Decentralized Logging in Non-Volatile Memory for Time Series Database Systems"}, {"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}, {"paperId": "2b8f775e8c8d66e35580ae0adf0cad4a89d4c51a", "title": "All-Flash Array Key-Value Cache for Large Objects"}, {"paperId": "8cc4dd210bb4650ada879d23146d2f5222e27b99", "title": "BSCache: A Brisk Semantic Caching Scheme for Cloud-based Performance Monitoring Timeseries Systems"}]}
