{"paperId": "005403764b440a7741d08ff7a2221660d7976743", "publicationVenue": null, "title": "Collapse susceptibility assessment using a support vector machine compared with back-propagation and radial basis function neural networks", "abstract": "Abstract Machine learning models are regarded as efficient and popular models for natural disaster susceptibility prediction. However, few studies have focussed on the applications of the latest popular machine learning models in collapse susceptibility assessment (CSA). This paper proposes a 3S (RS, GPS and GIS) technology-based support vector machine (SVM) to map collapse susceptibility in the Nantian area of China. The 3S technology-based back-propagation neural network (BPNN) and radial basis function neural network (RBFNN) models are also proposed for comparison. First, 44 recorded collapses are identified through field investigation, and fourteen collapse-related causal factors are acquired using 3S technology. Second, among these recorded collapses and randomly selected ‘non-collapses’, 70% of the collapse and non-collapse grid cells are used to train the three models, while the remaining 30% are used to test the models. Third, the collapse susceptibility maps of the Nantian area are produced using the three models. Finally, the prediction accuracies of these models are evaluated. The results indicate that the SVM model has the highest prediction accuracy, while the RBFNN model has the lowest prediction accuracy for CSA. In addition, the distribution characteristics of collapse susceptibility in the Nantian area are produced well by all three models.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-01-01", "journal": {"name": "Geomatics, Natural Hazards and Risk", "pages": "510 - 534", "volume": "11"}, "authors": [{"authorId": "30504085", "name": "Yuanyao Li"}, {"authorId": "2053802956", "name": "Yifan Sheng"}, {"authorId": "47407343", "name": "B. Chai"}, {"authorId": "8030529", "name": "Wei Zhang"}, {"authorId": "2146343144", "name": "Taili Zhang"}, {"authorId": "2115650198", "name": "Jiajia Wang"}], "citations": [{"paperId": "441f1169486da688f6a8ef2f0e0905d0f355b07f", "title": "An Integrated Model for Risk Assessment of Urban Road Collapse Based on China Accident Data"}, {"paperId": "fdb42947c9aaebab2051d67044979b501eb432a6", "title": "Collapse Susceptibility Assessment in Taihe Town Based on Convolutional Neural Network and Information Value Method"}, {"paperId": "c6f13abfbd07fe5fd4140907c592bd617d8a2036", "title": "Research on the influence of different sampling resolution and spatial resolution in sampling strategy on landslide susceptibility mapping results"}, {"paperId": "79f5f69126604f4e101d4670ba979bb76e2523f8", "title": "Risk Assessment of Landslide Collapse Disasters along National Highways Based on Information Quantity and Random Forest Coupling Methods: A Case Study of the G331 National Highway"}, {"paperId": "3c774fa5ffc74e8ffa76b3bdc897d0c95411254a", "title": "Susceptibility assessment of environmental geological disasters in Liulin County based on RF: from the perspective of positive and negative sample proportion"}, {"paperId": "2767542d45da5bb04a3a36d6958394b6629e1ccb", "title": "Geo-Environment Vulnerability Assessment of Multiple Geohazards Using VWT-AHP: A Case Study of the Pearl River Delta, China"}, {"paperId": "de7e73a0f2449f65fedf45804f2b473f061c935b", "title": "An Urban Road Risk Assessment Framework Based on Convolutional Neural Networks"}, {"paperId": "227a3e433595f474659d78d9863c5527785ae8d9", "title": "Hazard assessment of rainstorm-geohazard disaster chain based on multiple scenarios"}, {"paperId": "2255273c7e7f00581c5ae720d43ac6a8d6f53a32", "title": "Uncertainties of landslide susceptibility prediction considering different landslide types"}, {"paperId": "2f9dd9ac12515ac5dbda0cfab74f740769ef546e", "title": "Investigation on the phenomena and influence factors of urban ground collapse in China"}, {"paperId": "bf49a3058f5f803e2ef4fb9a11a8c032742e2ff6", "title": "Landslide Susceptibility Zoning Using C5.0 Decision Tree, Random Forest, Support Vector Machine and Comparison of Their Performance in a Coal Mine Area"}, {"paperId": "46687f59ffe5b6b35bebebf8416f142f33a5b406", "title": "Uncertainties of Collapse Susceptibility Prediction Based on Remote Sensing and GIS: Effects of Different Machine Learning Models"}, {"paperId": "40b68a1eaeeca843731690aa58827410bd37a783", "title": "Uncertainties Analysis of Collapse Susceptibility Prediction Based on Remote Sensing and GIS: Influences of Different Data-Based Models and Connections between Collapses and Environmental Factors"}, {"paperId": "4e8b519d24993b3f3b8b285b9ae89548510ed098", "title": "Evaluation of the Collapse Susceptibility of the Northern Foot of the Tianshan Mountains"}]}
