{"paperId": "00547fcffcd9dc46b863e3390d1ac6fd9e7f48fb", "publicationVenue": null, "title": "FedMLSecurity: A Benchmark for Attacks and Defenses in Federated Learning and Federated LLMs", "abstract": "This paper introduces FedSecurity, an end-to-end benchmark designed to simulate adversarial attacks and corresponding defense mechanisms in Federated Learning (FL). FedSecurity comprises two pivotal components: FedAttacker, which facilitates the simulation of a variety of attacks during FL training, and FedDefender, which implements defensive mechanisms to counteract these attacks. As an open-source library, FedSecurity enhances its usability compared to from-scratch implementations that focus on specific attack/defense scenarios based on the following features: i) It offers extensive customization options to accommodate a broad range of machine learning models (e.g., Logistic Regression, ResNet, and GAN) and FL optimizers (e.g., FedAVG, FedOPT, and FedNOVA); ii) it enables exploring the variability in the effectiveness of attacks and defenses across different datasets and models; and iii) it supports flexible configuration and customization through a configuration file and some provided APIs. We further demonstrate FedSecurity's utility and adaptability through federated training of Large Language Models (LLMs), showcasing its potential to impact a wide range of complex applications.", "venue": "", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2023-06-08", "journal": null, "authors": [{"authorId": "2159214992", "name": "Shanshan Han"}, {"authorId": "51884695", "name": "Baturalp Buyukates"}, {"authorId": "2257132515", "name": "Zijian Hu"}, {"authorId": "2219774222", "name": "Han Jin"}, {"authorId": "2256991611", "name": "Weizhao Jin"}, {"authorId": "2257131649", "name": "Lichao Sun"}, {"authorId": "2257084218", "name": "Xiaoyang Wang"}, {"authorId": "2257370819", "name": "Wenxuan Wu"}, {"authorId": "2256984001", "name": "Chulin Xie"}, {"authorId": "2257134953", "name": "Yuhang Yao"}, {"authorId": "2257012659", "name": "Kai Zhang"}, {"authorId": "2219708195", "name": "Qifan Zhang"}, {"authorId": "2189361403", "name": "Yuhui Zhang"}, {"authorId": "121011351", "name": "S. Avestimehr"}, {"authorId": "31927890", "name": "Chaoyang He"}], "citations": [{"paperId": "04fa3ebc4c0c0b4a2d2d1a3fc612134a05057696", "title": "Prompt Injection Attacks and Defenses in LLM-Integrated Applications"}, {"paperId": "6196c98dc63b667e4fae43829863cf7c7fbb4fef", "title": "Kick Bad Guys Out! Zero-Knowledge-Proof-Based Anomaly Detection in Federated Learning"}]}
