{"paperId": "0062f838754286bddf9bf882b439ba9b64091fb7", "publicationVenue": null, "title": "White-Box Adversarial Attacks on Deep Learning-Based Radio Frequency Fingerprint Identification", "abstract": "Radio frequency fingerprint identification (RFFI) is an emerging technique for the lightweight authentication of wireless Internet of things (IoT) devices. RFFI exploits unique hardware impairments as device identifiers, and deep learning is widely deployed as the feature extractor and classifier for RFFI. However, deep learning is vulnerable to adversarial attacks, where adversarial examples are generated by adding perturbation to clean data for causing the classifier to make wrong predictions. Deep learning-based RFFI has been shown to be vulnerable to such attacks, however, there is currently no exploration of effective adversarial attacks against a diversity of RFFI classifiers. In this paper, we report on investigations into white-box attacks (non-targeted and targeted) using two approaches, namely the fast gradient sign method (FGSM) and projected gradient descent (PGD). A LoRa testbed was built and real datasets were collected. These adversarial examples have been experimentally demonstrated to be effective against convolutional neural networks (CNNs), long short-term memory (LSTM) networks, and gated recurrent units (GRU).", "venue": "ICC 2023 - IEEE International Conference on Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-28", "journal": {"name": "ICC 2023 - IEEE International Conference on Communications", "pages": "3714-3719"}, "authors": [{"authorId": "49304622", "name": "Jie Ma"}, {"authorId": "2118076295", "name": "Junqing Zhang"}, {"authorId": "1978747337", "name": "Guanxiong Shen"}, {"authorId": "2054944172", "name": "A. Marshall"}, {"authorId": "70448116", "name": "Chip-Hong Chang"}], "citations": [{"paperId": "c1f778c4cc37e555430b002f9cd7b4d8a1b6842a", "title": "Deep Neural Network Quantization Framework for Effective Defense against Membership Inference Attacks"}]}
