{"paperId": "00758c751060698d3ad2e3878782fe26c133acbb", "publicationVenue": {"id": "ef00f0de-a7e5-443a-9a2d-c78502a4b598", "name": "Conference on Computer Science and Information Systems", "type": "conference", "alternate_names": ["Fed Conf Comput Sci Inf Syst", "Conf Comput Sci Inf Syst", "FedCSIS", "Federated Conference on Computer Science and Information Systems"], "url": "https://fedcsis.org/"}, "title": "Rough Sets Turn 40: From Information Systems to Intelligent Systems", "abstract": "The theory of rough sets was founded by Zdzisław Pawlak as a framework for data and knowledge exploration. His seminal paper titled \"Rough Sets\" was published in 1982, in International Journal of Computer and Information Sciences. One of the key aspects that lets us use rough sets in practical scenarios is the notion of information system, which comes from even earlier Professor Pawlak’s works. Information systems are the means for data and knowledge representation. They constitute the input to rough set mechanisms aimed at computing approximations of concepts and deriving compacted, interpretable decision models. In particular, the fundamental notion of the indiscernibility relation is defined on the basis of a given information system. Accordingly, we discuss to what extent information systems can serve as the basis for intelligent systems. We claim that in many cases it is not enough to treat a data set – represented as an information system – as a purely abstract object with no linkage to the data origins. Oppositely, we should give ourselves a technical possibility to construct information systems dynamically, taking into account interaction with physical environments where the data comes from. With this respect, we refer to the notions of interactive granular computing and we generally consider together the paradigms of rough sets, information systems, and information granulation.", "venue": "Conference on Computer Science and Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-04", "journal": {"name": "2022 17th Conference on Computer Science and Intelligence Systems (FedCSIS)", "pages": "23-34"}, "authors": [{"authorId": "1725797", "name": "A. Skowron"}, {"authorId": "145514740", "name": "D. Ślęzak"}], "citations": [{"paperId": "eb63d04fe8db5195d96d0c25da0f40fd9b573607", "title": "A practical study of methods for deriving insightful attribute importance rankings using decision bireducts"}, {"paperId": "99ff8f0f581339396f5b83dbcf19fc52138d64a6", "title": "Explainability in RIONA Algorithm Combining Rule Induction and Instance-Based Learning"}, {"paperId": "5a3c5db465690aef88f153bcf111bafd35605690", "title": "Clustering Corticosteroids Responsiveness in Sepsis Patients Using Game-Theoretic Rough Sets"}, {"paperId": "0cfffc8d23301cf8d2326b041115c9ff117f4516", "title": "Towards Automated Detection of Adversarial Attacks on Tabular Data"}, {"paperId": "89ac37bfc79d48c8db90b836177ecec650029a77", "title": "Detecting and Isolating Adversarial Attacks Using Characteristics of the Surrogate Model Framework"}, {"paperId": "ec16a25d9dffbe2b6a4f4bbe775a0dc544fe04ae", "title": "BrightBox - A rough set based technology for diagnosing mistakes of machine learning models"}, {"paperId": "81254b668d111d825441cc4c077c23525852efc1", "title": "KnowledgePit Meets BrightBox: A Step Toward Insightful Investigation of the Results of Data Science Competitions"}]}
