{"paperId": "0076bebb7fd1e037d3fa9687d2af45b1912d22da", "publicationVenue": {"id": "7daa16f8-90cb-40b8-ae76-26266fbdc556", "name": "International Conference on Artificial Intelligence in Engineering and Technology", "type": "conference", "alternate_names": ["IICAIET", "Int Conf Artif Intell Eng Technol"]}, "title": "Enhancing Multi-Stage Classification of Alzheimer's Disease with Attention Mechanism", "abstract": "Multi-stage classification of Alzheimer's disease (AD) refers to classifying the disease into its multiple stages. Aside from a binary classification task that classifies between the normal control (NC) and AD stages only, an additional prodromal stage known as Mild Cognitive Impairment (MCI) is also being classified. MCI is the stage between the healthy subjects known as the NC class, and the patients with heavy symptoms, in the AD class. In other words, MCI subjects only have slight or mild symptoms of Alzheimer's, thus leading it to be a challenge for detection. Classification models usually perform well in binary classification tasks, but not in multistage classification tasks, due to the faint difference in their features. Thus, this research proposes the incorporation of an attention mechanism into the classification model to increase its multi-stage classification performance. The attention mechanism facilitates the classification task by identifying the important features in MRI images so that the model can better differentiate the multiple classes. The MRI data used in this study is obtained from the Open Access Series of Imaging Studies (OASIS) database. The experimental results show that the attention-incorporated model has achieved an improved classification performance as compared to the normal model without attention. The generalizability of the enhanced model is also improved as observed from the training-classification gap results. Hence, the exceptional performance of the attention mechanism positions it as a solution to boost and enhance multi-stage AD classification.", "venue": "International Conference on Artificial Intelligence in Engineering and Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-12", "journal": {"name": "2023 IEEE International Conference on Artificial Intelligence in Engineering and Technology (IICAIET)", "pages": "230-235"}, "authors": [{"authorId": "2261958587", "name": "Wong Pui Ching"}, {"authorId": "2265968565", "name": "Shahrum Shah bin Abdullah"}, {"authorId": "114545197", "name": "M. I. Shapiai"}], "citations": []}
