{"paperId": "007911af6d7eccc41488c8833fdb922f3731df9d", "publicationVenue": {"id": "128f2a96-15ff-4a2f-8b9a-ae89d1107567", "name": "IEEE Nordic Circuits and Systems Conference", "type": "conference", "alternate_names": ["NORCAS", "IEEE Nord Circuit Syst Conf"]}, "title": "Tydi-Chisel: Collaborative and Interface-Driven Data-Streaming Accelerators", "abstract": "In spite of progress on hardware design languages, the design of high-performance hardware accelerators forces many design decisions specializing the interfaces of these accelerators in ways that complicate the understanding of the design and hinder modularity and collaboration. In response to this challenge, Tydi is presented as an open specification for streaming dataflow designs in digital circuits, allowing designers to express how composite and variable-length data structures are transferred over streams using clear, data-centric types. In contrast, Chisel, with its high level of abstraction and customizability offers a suitable platform to implement Tydi-based components. In this paper, Tydi-Chisel is presented along with an A-to-Z design-process description. Tydi-Chisel aims to simplify the design of data-streaming accelerators through the integration of the Tydi interface standard in Chisel, along with helper components and syntax sugar. In combination Chisel and Tydi help bridge the hardware-software divide, making solo-design and collaboration between designers easier.Project repository: https://github.com/ccromjongh/Tydi-Chisel", "venue": "IEEE Nordic Circuits and Systems Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-31", "journal": {"name": "2023 IEEE Nordic Circuits and Systems Conference (NorCAS)", "pages": "1-7"}, "authors": [{"authorId": "2265667724", "name": "Casper Cromjongh"}, {"authorId": "2195490447", "name": "Yongding Tian"}, {"authorId": "11983170", "name": "P. Hofstee"}, {"authorId": "2233480783", "name": "Zaid Al-Ars"}], "citations": []}
