{"paperId": "0081c0a8228a3a1efad8cfddf657f09f76d1546a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Data Generation Perspective to the Mechanism of In-Context Learning", "abstract": "In-Context Learning (ICL) empowers Large Language Models (LLMs) with the capacity to learn in context, achieving downstream generalization without gradient updates but with a few in-context examples. Despite the encouraging empirical success, the underlying mechanism of ICL remains unclear, and existing research offers various viewpoints of understanding. These studies propose intuition-driven and ad-hoc technical solutions for interpreting ICL, illustrating an ambiguous road map. In this paper, we leverage a data generation perspective to reinterpret recent efforts and demonstrate the potential broader usage of popular technical solutions, approaching a systematic angle. For a conceptual definition, we rigorously adopt the terms of skill learning and skill recognition. The difference between them is skill learning can learn new data generation functions from in-context data. We also provide a comprehensive study on the merits and weaknesses of different solutions, and highlight the uniformity among them given the perspective of data generation, establishing a technical foundation for future research to incorporate the strengths of different lines of research.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-03", "journal": {"name": "ArXiv", "volume": "abs/2402.02212"}, "authors": [{"authorId": "2125202063", "name": "Haitao Mao"}, {"authorId": "2152758698", "name": "Guang-Da Liu"}, {"authorId": "2254813628", "name": "Yao Ma"}, {"authorId": "2258699836", "name": "Rongrong Wang"}, {"authorId": "2283301882", "name": "Jiliang Tang"}], "citations": [{"paperId": "b00d1028291ae64e9d7485a34ec5f1b7b5a37909", "title": "Visual In-Context Learning for Large Vision-Language Models"}, {"paperId": "6b10825701d73925808744c863d2a3df2671701b", "title": "Universal Link Predictor By In-Context Learning on Graphs"}]}
