{"paperId": "0085607ab691730ce4aa6ebde1dbfc8bc8a1ae49", "publicationVenue": null, "title": "A NEW EFFICIENT HYBRID CRYPTOGRAPHIC IMPLEMENTATION FOR INFORMATION SECURITY IN HADOOP", "abstract": "An anticipated safe cloud computing system has been designed to address a significant challenge in creating a tailored Hadoop for the cloud. In this area, Hadoop was used to build and enhance the security of handling and collecting user data. Hadoop is one of the other Apache Big Data technologies, and it prepares massive volumes of data using the MapReduce architecture. One of the most important tools for addressing Big Data concerns is Hadoop. One of the most difficult challenges is securing data storage, and the Hadoop distributed file system (HDFS) lacks a clear security strategy. The suggested method uses public key cryptography to encrypt and protect each and every file stored in HDFS. Using the suggested data encryption technique, the collected data is encrypted in HDFS during the data collection process. In this paper, a hybrid encryption method for HDFS files is presented that combines two well-known asymmetric key cryptosystems (RSA and Paillier). Data is encrypted using the proposed cryptosystem before it is saved in HDFS. However, the RSA encryption algorithm usually requires a longer key to ensure data security. There are two methods for uploading files to the cloud: non-secure and safe. The hybrid system has a lower delay and higher computational complexity as compared to the RSA cryptosystem alone. Asymmetric encryption algorithms, such as RSA and Paillier, use public-key encryption and private key decryption, so it provides security in the cloud computing environment. The datasets required for the study is obtained from Amazon.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2238000422", "name": "Kaparthi Ravi Kishore"}, {"authorId": "2237999828", "name": "G. Shyama"}, {"authorId": "2238000082", "name": "Chandra Prasad"}], "citations": []}
