{"paperId": "009df217822c64fd83e0903b8f1fe5f7167c83dc", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Architecture for Service Integration to Fully Support Novel Personalized Smart Tourism Offerings", "abstract": "The continuous evolution of IT (information technology) technologies is radically transforming many technical areas and social aspects, also reshaping the way we behave and looking for entertainment and leisure services. In that context, tourism experiences request to enhance the level of user involvement and integration and to create an ever more personalized and connected experience, by leveraging on the differentiated tourist services and information locally present in the territory, by pushing active participation of customers, and by taking advantage of the ever-increasing presence of sensors and IoT (Internet of Things) devices deployed in many realities. However, the deep fragmentation of services and technologies adopted in tourism context characterizes the whole information provided also by customer sensing and IoTs (Internet of Things) heterogeneity and deep clashes with an effective organization of smart tourism. This article presents APERTO5.0 (an Architecture for Personalization and Elaboration of services and data to Reshape Tourism Offers 5.0), an innovative architecture aiming at a whole integration and deep facilitation of tourism service and information organization and blending, to enable the re-provisioning of novel services as advanced aggregates or re-elaborated ones. The proposed solution will demonstrate its effectiveness in the context of Smart Tourism by choosing the real use case of the “Francigena way” (a pilgrim historical path), the Italian part.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "26996818", "name": "Andrea Sabbioni"}, {"authorId": "2155687069", "name": "Thomas Villano"}, {"authorId": "144765161", "name": "Antonio Corradi"}], "citations": [{"paperId": "18ae40ceb72591cd2ca142144260676f38a062aa", "title": "Revolutionizing travel experiences: An in-depth analysis of intelligent booking systems and behavioral patterns"}, {"paperId": "5d649e3e70cfa22efbf94fcc247e49ea1af2148f", "title": "A Survey on Decentralized Identifiers and Verifiable Credentials"}, {"paperId": "f2633ac387306e66e5add49ee7e20a14bbae8887", "title": "Exploring the Landscape of Smart Tourism: A Systematic Bibliometric Review of the Literature of the Internet of Things"}, {"paperId": "e65cb8c3a6c070b1291cabfaa2a727db4012fdb7", "title": "A Systematic Literature Review on Service Composition for People with Disabilities: Taxonomies, Solutions, and Open Research Challenges"}, {"paperId": "f9d96107bb282923c6aa645d56894d680e4501c7", "title": "Sensor Networks: Physical and Social Sensing in the IoT"}, {"paperId": "29e0a20a8ef0a42df2842fe91d5f6f27d32d84d3", "title": "An Architectural Approach for Heterogeneous Data Access in Serverless Platforms"}, {"paperId": "f0f58df3663eb2c319cb4cf69a6014e01a10a090", "title": "Research on Smart Tourism Oriented Sensor Network Construction and Information Service Mode"}, {"paperId": "7c6e6a44951f599b36b970be02bdf14665bf215a", "title": "A Decentralized Architecture for Dynamic and Federated Access Control Facilitating Smart Tourism Services"}]}
