{"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions", "abstract": "This study examines the effects of quality of service, product awareness, and perceptions among customers of Islamic financial institutions (IFIs) on customer loyalty through technology integration using customer satisfaction as a mediator. A well-structured, comprehensive questionnaire was developed and data were collected from 203 respondents who were customers of six IFIs in Pakistan and had at least 2 years of experience in dealing confiorm this is correct with these IFIs. A total of 171 accurate responses were received from the respondents. Ten hypotheses were developed and statistically verified using regression and correlation analytical techniques. The results reveal that the quality of customer services and awareness of IFIs had a direct and positive relationship with customer loyalty, which in turn was mediated by customer satisfaction. Perceptions about IFIs had a direct positive relation with customer satisfaction. However, the relation of perceptions and quality of service with customer loyalty and satisfaction in financial institutions through technology integration was found to be insignificant, even in the presence of customer satisfaction as a mediator.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-23", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "48177129", "name": "K. Iqbal"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "26575472", "name": "H. Inam"}, {"authorId": "1657644010", "name": "S. Qayyum"}], "citations": [{"paperId": "411003e12ce920e9b533fff01c0d5ebc42608ca5", "title": "Evaluation of the Benefits Generated by Sustainability 4.0: A Study of the Perception of Banking Sector Customers"}, {"paperId": "c0e45040e6bffcce5b937d1b8b05fb369028a2f4", "title": "How to Enhance Corporate Customers’ Loyalty on Purchasing Service Products? Exploring from the Perspective of Information Search"}, {"paperId": "569da376f713970c8b557d598631a371df6825ea", "title": "Sharia Economy, Islamic Financial Performance and Factors That Influence It—Evidence from Indonesia"}, {"paperId": "cde1c1dcc601fe351c3f1dd745883e6e1c2a5234", "title": "Holding accounts in several banks - a conscious or reckless consumer?"}, {"paperId": "7764727b4ad930af2e8fa45a17c0819387ef848e", "title": "The Effect of Digitalization on the Quality of Service and Customer Loyalty"}, {"paperId": "9a97aa361c1d3d0f087ca02d45cbb839fa968727", "title": "Investigating the Impact of Resilience, Responsiveness, and Quality on Customer Loyalty of MSMEs: Empirical Evidence"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "f1c2547cb9346e61f4dd3b9cb5a663efc8d7ff50", "title": "PROMOTION STRATEGIES IN CONSUMER PARADOX TOWARDS WORD OF MOUTH BRAND EQUITY"}]}
