{"paperId": "00b51664f42d303814ede8d178d2057462218c13", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Design and Optimization of an Intelligent Monitoring System for Overhead Lines Based on Common Information Model", "abstract": "Overhead lines act as the basic media for electricity transmission, and their stable operation remains really important to the whole power systems. As a result, real-time monitoring towards the operation status and fast discovery towards the device fault are in urgent demand. To deal with such issue, this work presents design and optimization of an intelligent monitoring system for overhead lines based on common information model (CIM). Firstly, tree format data structure is established using CIM, and analysis of CIM-XML data files are completed based on CIM. Then, the necessary relational tables without affecting database performance are established, in order to ensure that the mapped relational database can fully express all kinds of relationships in CIM. Finally, the abnormal temperature rise at the connection of overhead lines in traction power supply systems is selected as the object. And some simulation is conducted to evaluate performance of the designed prototype system. The results show that the system can accurately detect the voltage value from normal working state to the limit state of human safety voltage, with relatively small errors (about 3%-6%). Compared with inductive high-voltage detection technology, this system has higher detection capability. The intelligent monitoring of overhead lines based on the Common Information Model (CIM) optimizes the combined contact force characteristic values of pantographs and dynamic schemes of overhead lines, reducing the average risk loss.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "31386-31398", "volume": "12"}, "authors": [{"authorId": "2287202805", "name": "Yamin Wang"}, {"authorId": "2287062070", "name": "Pengfei Sai"}], "citations": []}
