{"paperId": "00b94c63b73942873a2648de128ec554f53e36cf", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Using Decision Tree Classification Model to Predict Payment Type in NYC Yellow Taxi", "abstract": "—The taxi services are growing rapidly as reliable services. The demand and competition between service providers is so high. A billion trip records need to be analyzed to raise the spirit of competition, understand the service users, and improve the business. Although decision tree classification is a common algorithm which generates rules that are easy to understand, there is no implementation for classification on taxi dataset. This research applies the decision tree classification model on taxi dataset to classify instances correctly, build a decision tree, and calculate accuracy. This experiment collected decision tree algorithm with Spark framework to present the good performance and high accuracy when predicting payment type. Applied decision tree algorithm with different aspects on NYC taxi dataset results in high accuracy.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2160989016", "name": "Hadeer Ismaeil"}, {"authorId": "13637179", "name": "S. Kholeif"}, {"authorId": "1402913851", "name": "M. Abdel-Fattah"}], "citations": [{"paperId": "00002806e98da8a65ecd0c140eefdc69f3bdb2ce", "title": "Comparison of Iris dataset classification with Gaussian naïve Bayes and decision tree algorithms"}, {"paperId": "1af6cefb83c92b8bd99e86a0aaaddc70f31c2524", "title": "I Open at the Close: A Deep Reinforcement Learning Evaluation of Open Streets Initiatives"}]}
