{"paperId": "00be4e7aa8523998e8be4ccd22a0189d736bd0a9", "publicationVenue": null, "title": "BioLumin: An Immersive Mixed Reality Experience for Interactive Microscopic Visualization and Biomedical Research Annotation", "abstract": "Many recent breakthroughs in medical diagnostics and drug discovery arise from deploying machine learning algorithms to large-scale data sets. However, a significant obstacle to such approaches is that they depend on high-quality annotations generated by domain experts. This study develops and evaluates BioLumin, a novel immersive mixed reality environment that enables users to virtually shrink down to the microscopic level for navigation and annotation of 3D reconstructed images. We discuss how domain experts were consulted in the specification of a pipeline to enable automatic reconstruction of biological models for mixed reality environments, driving the design of a 3DUI system to explore whether such a system allows accurate annotation of complex medical data by non-experts. To examine the usability and feasibility of BioLumin, we evaluated our prototype through a multi-stage mixed-method approach. First, three domain experts offered expert reviews, and subsequently, nineteen non-expert users performed representative annotation tasks in a controlled setting. The results indicated that the mixed reality system was learnable and that non-experts could generate high-quality 3D annotations after a short training session. Lastly, we discuss design considerations for future tools like BioLumin in medical and more general scientific contexts.", "venue": "ACM Trans. Comput. Heal.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-18", "journal": {"name": "ACM Transactions on Computing for Healthcare", "pages": "1 - 28", "volume": "3"}, "authors": [{"authorId": "51144201", "name": "Aviv Elor"}, {"authorId": "2176770697", "name": "Steve Whittaker"}, {"authorId": "145169959", "name": "Sri Kurniawan"}, {"authorId": "2176771375", "name": "Sam Michael"}], "citations": []}
