{"paperId": "00c4e1abbc489cfeee9e3ec55fa23ad8e9fd06db", "publicationVenue": {"id": "79644985-a91b-42a7-ac72-bb961c283f5e", "name": "IEEE Transactions on Evolutionary Computation", "type": "journal", "alternate_names": ["IEEE Trans Evol Comput"], "issn": "1089-778X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4235", "alternate_urls": ["http://cis.ieee.org/ieee-transactions-on-evolutionary-computation.html", "http://ieee-cis.org/pubs/tec/"]}, "title": "A Survey on Learnable Evolutionary Algorithms for Scalable Multiobjective Optimization", "abstract": "Recent decades have witnessed great advancements in multiobjective evolutionary algorithms (MOEAs) for multiobjective optimization problems (MOPs). However, these progressively improved MOEAs have not necessarily been equipped with scalable and learnable problem-solving strategies for new and grand challenges brought by the scaling-up MOPs with continuously increasing complexity from diverse aspects, mainly, including expensive cost of function evaluations, many objectives, large-scale search space, time-varying environments, and multitask. Under different scenarios, divergent thinking is required in designing new powerful MOEAs for solving them effectively. In this context, research studies on learnable MOEAs with machine learning techniques have received extensive attention in the field of evolutionary computation. This article begins with a general taxonomy of scaling-up MOPs and learnable MOEAs, followed by an analysis of the challenges that these MOPs pose to traditional MOEAs. Then, we synthetically overview recent advances of learnable MOEAs in solving various scaling-up MOPs, focusing primarily on four attractive directions (i.e., learnable evolutionary discriminators for environmental selection, learnable evolutionary generators for reproduction, learnable evolutionary evaluators for function evaluations, and learnable evolutionary transfer modules for sharing or reusing optimization experience). The insight of learnable MOEAs is offered to readers as a reference to the general track of the efforts in this field.", "venue": "IEEE Transactions on Evolutionary Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-23", "journal": {"name": "IEEE Transactions on Evolutionary Computation", "pages": "1941-1961", "volume": "27"}, "authors": [{"authorId": "2144363291", "name": "Songbai Liu"}, {"authorId": "38345106", "name": "Qiuzhen Lin"}, {"authorId": "2108981276", "name": "Jianqiang Li"}, {"authorId": "2186649479", "name": "K. Tan"}], "citations": [{"paperId": "11f47e1e77b1cb111812002720d78c3813d2b80e", "title": "Mathematical model and adaptive multi-objective evolutionary algorithm for cellular manufacturing with mixed production mode"}, {"paperId": "72cf74f934edadb9f8c7cb21044896169cae2818", "title": "Adaptive operator selection with dueling deep Q-network for evolutionary multi-objective optimization"}, {"paperId": "a4c93226b55f2f7046937e3b1f0ff5ad915a54aa", "title": "Enhancing multi-objective evolutionary algorithms with machine learning for scheduling problems: recent advances and survey"}, {"paperId": "b892a0f72ccb873e0ffb23ed71e10bc267ea302d", "title": "Diffusion Model-Based Multiobjective Optimization for Gasoline Blending Scheduling"}, {"paperId": "52940bee137b6f9c103e7a3ed23520eef8da96e7", "title": "Benchmark for CEC 2024 Competition on Multiparty Multiobjective Optimization"}, {"paperId": "6242d1e97a59c7b8bd4882aaa857e3351e06aa5b", "title": "A Survey on Bias Mitigation in Federated Learning"}, {"paperId": "224cb83e3b6a640d95163398a579d61deaa2cca6", "title": "A benchmark test suite for evolutionary multi-objective multi-concept optimization"}, {"paperId": "49f302e9a76eb39c88fcd861bdd0d954bd3d76b0", "title": "Large Language Model for Multi-objective Evolutionary Optimization"}, {"paperId": "66c5fb64dc8a3a05b1829fc0b1d14b327e544820", "title": "Inverse model and adaptive neighborhood search based cooperative optimizer for energy-efficient distributed flexible job shop scheduling"}, {"paperId": "9c11f8c11308566e82cc4676b01bb042b3c64bf5", "title": "A large-scale multi-objective evolutionary algorithm based on importance rankings and information feedback"}, {"paperId": "157f4b4817f6d20bacb436e6be7791d4e75103ac", "title": "Rank-Based Learning and Local Model Based Evolutionary Algorithm for High-Dimensional Expensive Multi-Objective Problems"}, {"paperId": "401e43955af440bc2e8d1641f71aaf59249a524a", "title": "EvoX: A Distributed GPU-accelerated Framework for Scalable Evolutionary Computation"}, {"paperId": "54bdae31d0a56219abd351cf3aa4a222019f6bd8", "title": "A Comprehensive Overview of Artificial Intelligence"}]}
