{"paperId": "00cdb2f9d3a008da8bdf15f44d45733e92dd622e", "publicationVenue": {"id": "949c1b01-6a8c-4610-a5df-ba163cfa2242", "name": "Géosciences", "alternate_names": ["Geosciences", "Géosciences"], "issn": "1772-094X", "alternate_issns": ["2076-3263", "2163-1697", "2163-1719"], "url": "https://www.brgm.fr/decouverte/ouvrages-cartes-brgm-editions/geosciences-revue-brgm-terre-durable", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225432", "http://www.sapub.org/journal/archive.aspx?journalid=1016", "http://journal.sapub.org/geo", "http://www.sapub.org/journal/aimsandscope.aspx?journalid=1016", "https://www.mdpi.com/journal/geosciences", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225432", "https://www.mdpi.com/journal/geosciences/about", "http://editions.brgm.fr/publication/pubGeoscience.jsp?cook=1394185329771&pageActive=0"]}, "title": "A Survey of Uncertainty Quantification in Machine Learning for Space Weather Prediction", "abstract": "With the availability of data and computational technologies in the modern world, machine learning (ML) has emerged as a preferred methodology for data analysis and prediction. While ML holds great promise, the results from such models are not fully unreliable due to the challenges introduced by uncertainty. An ML model generates an optimal solution based on its training data. However, if the uncertainty in the data and the model parameters are not considered, such optimal solutions have a high risk of failure in actual world deployment. This paper surveys the different approaches used in ML to quantify uncertainty. The paper also exhibits the implications of quantifying uncertainty when using ML by performing two case studies with space physics in focus. The first case study consists of the classification of auroral images in predefined labels. In the second case study, the horizontal component of the perturbed magnetic field measured at the Earth’s surface was predicted for the study of Geomagnetically Induced Currents (GICs) by training the model using time series data. In both cases, a Bayesian Neural Network (BNN) was trained to generate predictions, along with epistemic and aleatoric uncertainties. Finally, the pros and cons of both Gaussian Process Regression (GPR) models and Bayesian Deep Learning (DL) are weighed. The paper also provides recommendations for the models that need exploration, focusing on space weather prediction.", "venue": "Géosciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-07", "journal": {"name": "Geosciences"}, "authors": [{"authorId": "121326521", "name": "Talha Siddique"}, {"authorId": "3432130", "name": "Md. Shaad Mahmud"}, {"authorId": "8612473", "name": "A. Keesee"}, {"authorId": "31390793", "name": "C. Ngwira"}, {"authorId": "93995893", "name": "H. Connor"}], "citations": [{"paperId": "f28b7467fe10a605ed5997f89704f321d864b66e", "title": "Review of Sources of Uncertainty and Techniques Used in Uncertainty Quantification and Sensitivity Analysis to Estimate Greenhouse Gas Emissions from Ruminants"}, {"paperId": "2d472d07d5ac287ef15540f0e086fb33cb5e733e", "title": "Uncertainty-aware image classification on 3D CT lung"}, {"paperId": "13b896eddcef2b45d1f9af337f2c62233146e5ab", "title": "Uncertainty Quantification of Machine Learning Model Performance via Anomaly-Based Dataset Dissimilarity Measures"}, {"paperId": "84a45b363483598a05cb0d52cf06ecc14ad2bb04", "title": "Transferability of predictive models to map susceptibility of ephemeral gullies at large scale"}, {"paperId": "30ade9c9138bf25e62428eccca96c740d2b0b4e9", "title": "Physics-Enhanced TinyML for Real- Time Detection of Ground Magnetic Anomalies"}, {"paperId": "f2cbcffd951fe9686d8410a4a9930af584ac5cf0", "title": "Forecasting Geomagnetic Storm Disturbances and Their Uncertainties Using Deep Learning"}, {"paperId": "2fc7fffbe4c9560ba6f501a475dfbc5ac8dd4736", "title": "Uncertainty Quantification for Machine Learning‐Based Ionosphere and Space Weather Forecasting: Ensemble, Bayesian Neural Network, and Quantile Gradient Boosting"}, {"paperId": "b3e264e1a5cdc39a3cf7f19d2c13784c702a3ff9", "title": "Assessing Uncertainty in Space Weather Forecasting Using Quantile Regression and Complex Nonlinear Systems Identification Techniques"}, {"paperId": "c0088ecbf6e53faf7c05875da8de0861a6042a4c", "title": "Uncertainty Quantification for Machine Learning Output Assurance using Anomaly-based Dataset Dissimilarity Measures"}, {"paperId": "6dd2d9fc3d3d35ed3716d4ebb287a88480b3548f", "title": "Relationship between Solar Flux and Sunspot Activity Using Several Regression Models"}, {"paperId": "df89a321b74c3dfbd2eb58779f613ca77bbf9636", "title": "The limits of explainability & human oversight in the EU Commission’s proposal for the Regulation on AI- a critical approach focusing on medical diagnostic systems"}, {"paperId": "2725c9ecc9e076d504ed8a0ba2424624dbc43a1d", "title": "NAO Seasonal Forecast Using a Multivariate Air–Sea Coupled Deep Learning Model Combined with Causal Discovery"}, {"paperId": "b7817828038288e1aa52181338bf5af164573c41", "title": "Distribution Based Upper Lower Bound Estimation In Deep Neural Nets"}, {"paperId": "c36a04be99d90c44a65f3a9a932a084745a75f42", "title": "Ensemble deep learning models for prediction and uncertainty quantification of ground magnetic perturbation"}, {"paperId": "27cf1cf914135ff7aa667bf6078057d3e342d59a", "title": "Bayesian Hierarchical Modelling for Uncertainty Quantification in Operational Thermal Resistance of LED Systems"}, {"paperId": "d2b44a89dcba0158dad4f00c9809eb7c9104782a", "title": "Towards Online Ageing Detection in Transformer Oil: A Review"}, {"paperId": "492e04e2d8b12b0ee1795a6601cf8870c654b810", "title": "Applying Bayesian inference in a hybrid CNN-LSTM model for time-series prediction"}, {"paperId": "e82d10cd5a1b4dd3f47d787ac7d8d8b858282d9a", "title": "A Robust Learning Methodology for Uncertainty-aware Scientific Machine Learning models"}, {"paperId": "c5390c0413b657c2ec886ecf61d65c2539a3cdf4", "title": "Classification and Analysis of Weather Images Using Machine Intelligent Based Approach"}, {"paperId": "17ded0efb238914f61594f60df358da8664114d4", "title": "Application of Machine Learning to Express Measurement Uncertainty"}, {"paperId": "300d2e05996b3ff03cad3998f4d9715bc4cfea58", "title": "Breaking CAPTCHA with Capsule Networks"}]}
