{"paperId": "00cfea9dcf6a6ebdcbc8ab2d3d6b02177e339bae", "publicationVenue": null, "title": "Machine Learning Based Crime Identification System using Data Analytics", "abstract": "Poverty is known to be the mother of all crimes, and a vast percentage of people in India live below the poverty line. In India, the crime rate is rapidly rising. The police officers must spend a significant amount of time and personnel to identify suspects and criminals using current crime investigation. In this research, the method presented for designing and implementing crime identification and criminal recognition systems for Indian metropolitans is utilizing techniques of data mining. These occurrences are represented by 35 predefined crime attributes. Access to the crime database is protected by safeguards. The pending four subjects are important for crime unmasking, identification and estimation of criminals, and crime authentication, in that order. The detection of crime is investigated with the help of K-Means clustering, which iteratively builds two crime batches based on congruent criminal features. Google Maps is to enhance the k-means visualization. K-Nearest Neighbor classification is used to examine criminal identification and forecasting. This is used for the authentication of the results. The technique benefits society by helping investigative authorities in crime solving and criminal recognition, resulting in lower crime rates. This research study describes a way for creating and deploying crime solving and criminal recognition systems for Indian metro's using data mining tools in this study. The method consists of data evulsion, data pre- processing, clustering, Google map delegation and classification. The first module, data evulsion, retrieves unformed or unrecorded crime datasets from several criminal sources online from 2000 to 2012. In the second module, Data pre-processing cleans, assimilates, and reduces the obtained criminal data into organized 5,038 crime occurrences. Several predefined criminal traits represent these instances. Safeguards are in place to prevent unauthorized access to the crime index. The remaining components are critical for detecting crimes, criminal identity and prediction, and crime verification, in that sequence. The investigation of crimes is investigated using k-means clustering, which gives results repeatedly.", "venue": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-15", "journal": {"name": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "pages": "951-956"}, "authors": [{"authorId": "2214967253", "name": "S. M. Rajesh"}, {"authorId": "2215041450", "name": "Itikela Chiranmai"}, {"authorId": "2271124543", "name": "N. Jayapandian"}], "citations": []}
