{"paperId": "00fa0ff1d47052581f4bb312d637c9933a799834", "publicationVenue": {"id": "eee60d95-9ec4-45ba-aa26-5370917b4238", "name": "Simpósio Brasileiro de Fatores Humanos em Sistemas Computacionais", "type": "conference", "alternate_names": ["IHC", "Simpósio Bras Fatores Humanos em Sist Comput"]}, "title": "Longitudinal user experience studies in the IoT domain: a brief panorama and challenges to overcome", "abstract": "User Experience (UX) is affected by users' emotions and motivations, among other subjective factors. Hence, changes in UX occur over time, according to the different contexts, and behavioral and internal user aspects. With the rising development of Internet of Things (IoT) systems to support daily activities and, at the same time, the increasing abandonment of these systems, the importance of ensuring good UX levels over time has become an even greater need. In this context, we conducted a snowballing procedure and systematic literature mapping to understand whether and how long-term UX evaluations have been conducted in IoT and the challenges and opportunities in conducting longitudinal studies in this field. We analyzed 55 papers that reported longitudinal evaluations in different IoT systems and 14 papers that reported UX evaluations in the IoT context. We also interviewed five software engineering professionals to learn about their IoT user-testing and evaluation perspectives. Our results provide a panorama of the conduction of longitudinal IoT studies and a glance at the directions the research on UX evaluation for IoT systems is taking. Hence, we indicate future research opportunities for evaluating long-term UX in IoT systems through the longitudinal approach, considering the complexity of these systems and their impact on users' everyday lives.", "venue": "Simpósio Brasileiro de Fatores Humanos em Sistemas Computacionais", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-10-17", "journal": {"name": "Proceedings of the 21st Brazilian Symposium on Human Factors in Computing Systems"}, "authors": [{"authorId": "2053761754", "name": "Bianca Melo"}, {"authorId": "2156298955", "name": "R. Andrade"}, {"authorId": "2334311", "name": "Ticianne G. R. Darin"}], "citations": [{"paperId": "df2b373545aba7d873798693ef639940b8ee905b", "title": "Da Curiosidade ao Conhecimento: Comunicabilidade e Experiência do Usuário Iniciante e Habitual da Amazon Alexa"}, {"paperId": "d2aeedf086c83806d1ed99ddc76d7d9db90978d1", "title": "Report from Dagstuhl Seminar 23031: Frontiers of Information Access Experimentation for Research and Education"}]}
