{"paperId": "010d1b055eae0ad3175ae379124a36d3c9c05e3c", "publicationVenue": {"id": "472fe64a-ea91-4506-8d2d-4c9a9374e1ea", "name": "Machine Learning and Knowledge Extraction", "alternate_names": ["Mach Learn Knowl Extr"], "issn": "2504-4990", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1327032", "alternate_urls": ["https://nbn-resolving.org/urn/resolver.pl?urn=urn:nbn:ch:bel-1327032", "https://www.mdpi.com/journal/make"]}, "title": "Machine Learning in Disaster Management: Recent Developments in Methods and Applications", "abstract": "Recent years include the world’s hottest year, while they have been marked mainly, besides the COVID-19 pandemic, by climate-related disasters, based on data collected by the Emergency Events Database (EM-DAT). Besides the human losses, disasters cause significant and often catastrophic socioeconomic impacts, including economic losses. Recent developments in artificial intelligence (AI) and especially in machine learning (ML) and deep learning (DL) have been used to better cope with the severe and often catastrophic impacts of disasters. This paper aims to provide an overview of the research studies, presented since 2017, focusing on ML and DL developed methods for disaster management. In particular, focus has been given on studies in the areas of disaster and hazard prediction, risk and vulnerability assessment, disaster detection, early warning systems, disaster monitoring, damage assessment and post-disaster response as well as cases studies. Furthermore, some recently developed ML and DL applications for disaster management have been analyzed. A discussion of the findings is provided as well as directions for further research.", "venue": "Machine Learning and Knowledge Extraction", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-07", "journal": {"name": "Mach. Learn. Knowl. Extr.", "pages": "446-473", "volume": "4"}, "authors": [{"authorId": "2114236194", "name": "Vasileios Linardos"}, {"authorId": "2054271", "name": "M. Drakaki"}, {"authorId": "2635470", "name": "P. Tzionas"}, {"authorId": "3433082", "name": "Y. L. Karnavas"}], "citations": [{"paperId": "5e273950c8f47865ec59cbecb1b6b835518c613b", "title": "Enhanced Arabic disaster data classification using domain adaptation"}, {"paperId": "76cddf97266ccf644d26bac91ae0f16bcfce4ea6", "title": "Data Science for Geographic Information Systems"}, {"paperId": "fcd0aba968e5ddfa940dfeeaaf68f823ce6e3ab0", "title": "Can Ensemble Techniques and Large-Scale Fire Datasets Improve Predictions of Forest Fire Probability Due to Climate Change?—A Case Study from the Republic of Korea"}, {"paperId": "0c96d357df149c683fe53b731ba0ace707607aa7", "title": "Predictive modeling of severe weather impact on individuals and populations using Machine Learning"}, {"paperId": "5c5de9ee8b15bcf1e2120a815a42c0d3f5397a5e", "title": "Optimizing Disaster Response: OptiDrone- Advanced Integration of Dijkstra's Algorithm and Cutting-Edge Software Solutions for UAV Path Planning and Obstacle Avoidance Efficiency"}, {"paperId": "e558b2eb4c6dd618c7d0364b65e8e89d8f50b69a", "title": "Machine learning methods in civil engineering: a systematic review"}, {"paperId": "a62d172536ebb046aaeebd1a6353ca6cb4ee1d24", "title": "Classification of Humanitarian Crisis Response Through Unimodal Multi-Class Textual Classification"}, {"paperId": "e7517bed4db05ed0211f6c9fe08cb90b15a66eb7", "title": "Laser Doppler Vibrometry for detecting survivors in hard-to-reach environments"}, {"paperId": "110f3c0394692ee393f8eb69cca6e0239549dee5", "title": "Artificial intelligence in groundwater management: Innovations, challenges, and future prospects"}, {"paperId": "44539c13cc9a5262ca45ef15e99130b78eca4bd9", "title": "Evaluation of Barriers to Deployment of Information and Communication Technologies to Sustain Information and Communication Flow in Floods"}, {"paperId": "3e9b9685ee8d9081d9fd38b6e2c4958ad384da31", "title": "Classification and detection of natural disasters using machine learning and deep learning techniques: A review"}, {"paperId": "b8d40f75a111f0b7823294e7f7353c51b4463a2f", "title": "Twitter Self-Organization to the Edge of a Phase Transition: Discrete-Time Model and Effective Early Warning Signals in Phase Space"}, {"paperId": "ada98219288898c41bbd1d43ff4366b8b7ea0920", "title": "Applied Deep Learning for Automated Information Capture and Retrieval"}, {"paperId": "70951858d02143606a1188f864aa2f04a315d1c5", "title": "Facilitating Experimental Reproducibility in Neural Network Research with a Unified Framework"}, {"paperId": "7062c436676e93b57c2bfb9f0e5c3c1d5d574fa1", "title": "Artificial Intelligence and Street Space Optimization in Green Cities: New Evidence from China"}, {"paperId": "be9b3d441ecfc414afebff2e381cd11b1536ba44", "title": "Because Life Matters- A Disaster Management Web Application"}, {"paperId": "fe9dfe7437c2218f33bb1e3018bc753881d04ec9", "title": "Disaster Related Tweets Analysis with Machine Learning Approaches"}, {"paperId": "cc96a3d5b1e87190a504d5722509290cc12cd52b", "title": "Use of neural network as a support tool in water level forecasting and issuing flash floods early warnings to three small Brazilian urban watersheds"}, {"paperId": "fc468f5e51f115ebf496291dfea083d1e072c9b7", "title": "A Highly Efficient and Effective Attribute Learning Framework for Road Graph from Aerial Imagery and GPS"}, {"paperId": "53b4647d6448eace9e7b78a8658e501e119bb0a1", "title": "Leveraging machine learning algorithms for improved disaster preparedness and response through accurate weather pattern and natural disaster prediction"}, {"paperId": "cf7b1f173c166e2ea4f49a616f527b6e0bc17403", "title": "Utilization of Deep Learning for Mapping Land Use Change Base on Geographic Information System: A Case Study of Liquefaction"}, {"paperId": "d826b8e3e692bcfe3fc9ce04caf5b4f94ec34e8c", "title": "Review of Disaster Defect Management in Machine Learning"}, {"paperId": "dd2d8ff6cd919841515516bea59276cfe8ccbcc9", "title": "Emotions-Based Disaster Tweets Classification: Real or Fake"}, {"paperId": "7b5ad1d3ab490e69de8f86fbfeff30e0cf7d0852", "title": "Predicting the occurrence of natural and technological disasters in Greece through Verhulst, multinomial and exponential models"}, {"paperId": "efdee222c217c27c342550b04af37bcdf847d660", "title": "On the emergence of geospatial cloud-based platforms for disaster risk management: A global scientometric review of google earth engine applications"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "86b0b0c13954f5126f22eb1e74dbdfea930fddbd", "title": "Predicting Unmet Healthcare Needs in Post-Disaster: A Machine Learning Approach"}, {"paperId": "6ef98203188c233071b86380a911b4edf6a50549", "title": "Intelligent Method for Classifying the Level of Anthropogenic Disasters"}, {"paperId": "a9dfc8c12332dc73418e04ccf329be80d43a02f3", "title": "Eliciting social themes of flood mitigation and community engagement studies through text mining"}, {"paperId": "59a289e3abc8450dc4176739a6409c2f7234eb03", "title": "Fusing VHR Post-disaster Aerial Imagery and LiDAR Data for Roof Classification in the Caribbean"}, {"paperId": "0354cf9b1899c811cbc9d8a63b0c9b09c528b0e6", "title": "AI-enabled strategies for climate change adaptation: protecting communities, infrastructure, and businesses from the impacts of climate change"}, {"paperId": "df02470305c7a482d8acd92204d1a480a5f3d185", "title": "Detection of Earthquake-Induced Building Damages Using Remote Sensing Data and Deep Learning: A Case Study of Mashiki Town, Japan"}, {"paperId": "69a0f47b552efcc9ba8703918feb8b07376d7852", "title": "Distribution Center Location Selection in Humanitarian Logistics Using Hybrid BWM–ARAS: A Case Study in Türkiye"}, {"paperId": "0fdf2c433178c987a34039c40b869203b36a77c8", "title": "Toward Interactive Visualizations for Explaining Machine Learning Models"}, {"paperId": "c2d78c7f3bac47dd7827de9e175ffc1cc6505727", "title": "Complementarity, Interoperability, and Level of Integration of Humanitarian Drones with Emerging Digital Technologies: A State-of-the-Art Systematic Literature Review of Mathematical Models"}, {"paperId": "3f9972398ba8dc3654d2cb6842be18d81977b27b", "title": "A machine learning approach to deal with ambiguity in the humanitarian decision making"}, {"paperId": "7a48f7269e59eeb3b56eb78c43cd9cd0cb4f9839", "title": "Domain Adaptable Self-supervised Representation Learning on Remote Sensing Satellite Imagery"}, {"paperId": "d3f8a4522fdb3eb924056c188aea4c8ba89f59dc", "title": "An integrated convolutional neural network and sorting algorithm for image classification and efficient flood disaster management"}, {"paperId": "d9447c80dca202cd2073b3773edeed5d80491a60", "title": "Press media impact of the Cumbre Vieja volcano activity in the island of La palma (Canary Islands): A machine learning and sentiment analysis of the news published during the volcanic eruption of 2021"}, {"paperId": "36727aadfd98153f46ec3d0b890d664ec8599022", "title": "AI and data science for smart emergency, crisis and disaster resilience"}, {"paperId": "e3a9f5d0b1cfdeca2f6ae8bae6e934303fc15624", "title": "The development of new remote technologies in disaster medicine education: A scoping review"}, {"paperId": "1f2119a8839f2c334b808b060aa311f48a445c0f", "title": "An Exploration to Blockchain-based Deep LearningFramework"}, {"paperId": "72136283040f66f652f59a04512a4d1f27b0bb50", "title": "Social media data extraction for disaster management aid using deep learning techniques"}, {"paperId": "7386c50d7342a9b6b6ac0913f09bc1fb4a5a0f1a", "title": "The prediction of disaster risk paths based on IECNN model"}, {"paperId": "7c39d8e9292687ca83b87781a72cea6aed699d39", "title": "Extraction of SIFT Features for Identifying Disaster Hit areas using Machine Learning Techniques"}, {"paperId": "605b8ced549a2a08691ab2111572a7f58d0e11a0", "title": "Pre-disaster Management based Machine Learning, IoT and Big Data: Survey and future direction"}, {"paperId": "75fdfd136af4f79959d071ca65c5a3c906365960", "title": "Analytical techniques for mapping multi-hazard with geo-environmental modeling approaches and UAV images"}, {"paperId": "87774481cf905c7cccc2f2dcab055ce1b2df222c", "title": "Artificial Neural Network approaches for disaster management: A literature review (2010–2021)"}, {"paperId": "056ec2857bca454c3e604d5bb9c81cdecac1aaed", "title": "Input/Output Variables Selection in Data Envelopment Analysis: A Shannon Entropy Approach"}, {"paperId": "a0e44227473c4788f6c1478428c9395ba0fe857d", "title": "No one stands alone: partnerships for community resilience"}, {"paperId": "af34f803b0c32e57720137863a9e37ea086fadd7", "title": "A decision-making tool for the determination of the distribution center location in a humanitarian logistics network"}, {"paperId": "88a21d1edd15f800a0be791d19d7ce229ded7591", "title": "The Warning Lexicon: A Multiphased Study to Identify, Design, and Develop Content for Warning Messages"}, {"paperId": "686942a81f1ae5920125375cc0cb847edae8fc98", "title": "A transformers-based approach on industrial disaster consequence identification from accident narratives"}, {"paperId": "a363310af6f7e808136927a305eacf53ae9f6c57", "title": "International Journal of Disaster Risk Reduction"}, {"paperId": "ad30f7932851d99e18ef80852c2bc755f116b495", "title": "Social Media Text Data Analysis Based On Unsupervised Machine Learning Algorithms"}, {"paperId": "3c6b046ce2412556258ca7bb10393a3e64d09491", "title": "The resilience of the Israeli population in the first week of the \"Iron Swords\" war"}, {"paperId": "0e00dbdcde54a52849d5f4bac82fad9077d9ea80", "title": "EXPLORING MACHINE LEARNING AND DEEP LEARNING APPROACHES FOR DISASTER PREDICTION AND MANAGEMENT: A SURVEY OF DIFFERENT APPROACHES"}]}
