{"paperId": "010e282e9a979f5c56428e7e9868823e9dabff53", "publicationVenue": null, "title": "Graph Constraints in Urban Computing: Dealing with Conditions in Processing Urban Data", "abstract": "Smart Cities is a world-wide initiative leading to better exploit the resources in a city in order to offer higher level services to people. In this context, urban computing is a process of acquisition, integration, and analysis of big and heterogeneous data generated by a diversity of sources in urban spaces, such as sensors, traffic devices, vehicles, buildings, and humans, to tackle the major issues that cities face, e.g. air pollution, increased energy consumption and traffic congestion. The majority of these information can be represented as graphs, such as the transportation network, in which places (nodes) are connected by some form of public transportation (edges). A vision of the \"city of the future\", or even the city of the present, rests on the integration of science and technology through information systems. This vision requires a re-thinking of the relationships between technology, government, city managers, business, academia and the research community. This position paper presents our views towards developing techniques for querying and evolving graph-modeled datasets based on user-defined constraints. Our focus is to show how these techniques can be applied to effectively retrieve urban data and have automated mechanisms that guarantee data consistency.", "venue": "2017 IEEE International Conference on Internet of Things (iThings) and IEEE Green Computing and Communications (GreenCom) and IEEE Cyber, Physical and Social Computing (CPSCom) and IEEE Smart Data (SmartData)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-21", "journal": {"name": "2017 IEEE International Conference on Internet of Things (iThings) and IEEE Green Computing and Communications (GreenCom) and IEEE Cyber, Physical and Social Computing (CPSCom) and IEEE Smart Data (SmartData)", "pages": "1118-1124"}, "authors": [{"authorId": "2065235785", "name": "Laurent DOrazio"}, {"authorId": "2114240", "name": "Mirian Halfeld-Ferrari"}, {"authorId": "1785445", "name": "Carmem S. Hara"}, {"authorId": "8090523", "name": "N. P. Kozievitch"}, {"authorId": "1977200", "name": "M. Musicante"}], "citations": [{"paperId": "4c5e266dc7640e57fb1d9444a10606db86dc1042", "title": "Green energy harvesting strategies on edge-based urban computing in sustainable internet of things"}, {"paperId": "d6b8eca99b3ea63bd5e057e447749032fbd1b141", "title": "Consistent updating of databases with marked nulls"}]}
