{"paperId": "0112d65d2ea11c065d7eb5f6fada9287002aa158", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "A Data Management Model for Intelligent Water Project Construction Based on Blockchain", "abstract": "The engineering construction-related data is essential for evaluating and tracing project quality in industry 4.0. Specifically, the preservation of the information is of great significance to the safety of intelligent water projects. This paper proposes a blockchain-based data management model for intelligent water projects to achieve standardization management and long-term preservation of archives. Based on studying the concrete production process in water conservancy project construction, we first build a behavioral model and the corresponding role assignment strategy to describe the standardized production process. Then, a distributed blockchain data structure for storing the production-related files is designed according to the model and strategy. In addition, to provide trust repository and transfer on the construction data, an intelligent keyless signature based on edge computing is employed to manage the data’s entry, modification, and approval. Finally, standardized and secure information is uploaded onto the blockchain to supervise intelligent water project construction quality and safety effectively. The experiments showed that the proposed model reduced the time and labor cost when generating the production data and ensured the security and traceability of the electronic archiving of the documents. Blockchain and intelligent keyless signatures jointly provide new data sharing and trading methods in intelligent water systems.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-09", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2005591", "name": "Zhoukai Wang"}, {"authorId": "2124633689", "name": "Kening Wang"}, {"authorId": "2143491502", "name": "Yichuan Wang"}, {"authorId": "2158400663", "name": "Zheng Wen"}], "citations": [{"paperId": "c36e08c750209595ac4b48f4cb7ddf7c5d5bc73a", "title": "Assessing the Digital Transformation Readiness of the Construction Industry Utilizing the Delphi Method"}, {"paperId": "4ed1af43034528b544ee01e69becb61f0e2bedb9", "title": "Application of blockchain to underground utilities"}]}
