{"paperId": "012ade7e82b64b3418a8dd8f7a95175f14494fad", "publicationVenue": null, "title": "An Intelligent Movies Recommendation System Based Facial Attributes Using Machine Learning", "abstract": "Movie theaters and platforms offer a wide selection of movies that require filtering to match the preferences of individual users. Recommender systems are an effective tool for this task. This study introduces a hybrid recommender system that combines collaborative filtering and content-based approaches to provide personalized movie recommendations. The proposed system considers age, gender, emotion, and genre attributes to ensure the suitability of the recommended movies. The proposed system targets the visitors of cinema theaters to try a new experience of choosing the next movie to watch by recognizing the visitor's face to determine his/her age, gender and emotion using camera. Therefore, our system is expected to achieve better results than traditional approaches. The system's performance is evaluated using standard metrics such as precision, recall, and F1-measure. The findings indicated that the proposed system outperforms the benchmark system in the most tested scenarios. However, the precision of the benchmark work is slightly higher in (8–14 and 15–24) age groups.", "venue": "2023 3rd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-10", "journal": {"name": "2023 3rd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "pages": "1-6"}, "authors": [{"authorId": "2244008429", "name": "Mohammed Balfaqih"}, {"authorId": "2264452892", "name": "Abdullah Altwaim"}, {"authorId": "35277831", "name": "Akram A. Almohammedi"}, {"authorId": "2257040708", "name": "Mohammad Hafiz Mohd Yusof"}], "citations": [{"paperId": "8c5ae8cf31e36be606421b2aa1cd3cf25e17b103", "title": "A Hybrid Movies Recommendation System Based on Demographics and Facial Expression Analysis using Machine Learning"}]}
