{"paperId": "012fbd3a947ff9786c8fdd3bbd9b156b032c35ea", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Layer-Aware Containerized Service Orchestration in Edge Networks", "abstract": "Edge computing provides computational resources in the vicinity of end-users to reduce delay compared to traditional remote clouds. However, the capacity of edge resources usually is not sufficient for the required computational demands. Therefore, it is necessary to design methods for employing these resources in an efficient manner. On the other hand, network function virtualization (NFV) is a promising solution to use the network resources in a more flexible way than traditional schemes. Although more focus has been on realization of NFV systems via virtual machines so far, recent studies show that container-based solutions can improve efficiency thanks to lightweight implementation and layered structure of containers. Nonetheless, to the best of our knowledge, there is no comprehensive study on the problem of orchestrating services composed of a chain of containerized network functions in edge networks. In this paper, we consider this scenario when service requests are submitted to the system and address important aspects of this problem such as downloading and sharing container layers and steering traffic among network functions. We present the formulation of the problem as an integer linear program (ILP) and prove its NP-hardness. Then, to handle this problem, we propose RCCO, a polynomial-time algorithm based on ideas from deterministic and randomized rounding framework. Our results from extensive evaluations show that the bandwidth consumption of the proposed algorithm compared to the optimal algorithm is higher by only about 4% while it can outperform baselines from literature by more than 37%.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "1830-1846", "volume": "20"}, "authors": [{"authorId": "52454145", "name": "Mahdi Dolati"}, {"authorId": "2574804", "name": "Seyed Hamed Rastegar"}, {"authorId": "1690176", "name": "A. Khonsari"}, {"authorId": "145742290", "name": "Majid Ghaderi"}], "citations": [{"paperId": "152549f76245e683c8fdddf02d0624519de6b92b", "title": "HyScaler: A Dynamic, Hybrid VNF Scaling System for Building Elastic Service Function Chains Across Multiple Servers"}, {"paperId": "fd56b6b5a9f75ace33a69d37007b3086bb1c4192", "title": "An optimal container update method for edge-cloud collaboration"}, {"paperId": "2f3c3bda538007cb064a1678231ba1b22122e971", "title": "Multi-User Layer-Aware Online Container Migration in Edge-Assisted Vehicular Networks"}]}
