{"paperId": "01367aa4453e3a2826b232f790086fda32c2fd0f", "publicationVenue": null, "title": "Urban Overheating Assessment through Prediction of Surface Temperatures: A Case Study of Karachi, Pakistan", "abstract": "Global climate has been radically affected by the urbanization process in recent years. Karachi, Pakistan’s economic hub, is also showing signs of swift urbanization. Owing to the construction of infrastructure projects under the China-Pakistan Economic Corridor (CPEC) and associated urbanization, Karachi’s climate has been significantly affected. The associated replacement of natural surfaces by anthropogenic materials results in urban overheating and increased local temperatures leading to serious health issues and higher air pollution. Thus, these temperature changes and urban overheating effects must be addressed to minimize their impact on the city’s population. For analyzing the urban overheating of Karachi city, LST (land surface temperature) is assessed in the current study, where data of the past 20 years (2000–2020) is used. For this purpose, remote sensing data from the Advanced Spaceborne Thermal Emission and Reflection Radiometer Global Digital Elevation Model (ASTER GDEM) and Moderate-Resolution Imaging Spectroradiometer (MODIS) sensors were utilized. The long short-term memory (LSTM) model was utilized where the road density (RD), elevation, and enhanced vegetation index (EVI) are used as input parameters. Upon comparing estimated and measured LST, the values of mean absolute error (MAE), mean square error (MSE), and mean absolute percentage error (MAPE) are 0.27 K, 0.237, and 0.15% for January, and 0.29 K, 0.261, and 0.13% for May, respectively. The low MAE, MSE, and MAPE values show a higher correlation between the predicted and observed LST values. Moreover, results show that more than 90% of the pixel data falls in the least possible error range of −1 K to +1 K. The MAE, MSE and MAPE values for Support Vector Regression (SVR) are 0.52 K, 0.453 and 0.18% and 0.76 K, 0.873, and 0.26%. The current model outperforms previous studies, shows a higher accuracy, and depicts greater reliability to predict the actual scenario. In the future, based on the accurate LST results from this model, city planners can propose mitigation strategies to reduce the harmful effects of urban overheating and associated Urban Heat Island effects (UHI).", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-11", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "539", "volume": "10"}, "authors": [{"authorId": "1855692", "name": "B. Aslam"}, {"authorId": "98736135", "name": "A. Maqsoom"}, {"authorId": "3002236", "name": "N. Khalid"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "90426770", "name": "S. Sepasgozar"}], "citations": [{"paperId": "1d01c3ae8335740f837ba2e265d370a383b4c5e0", "title": "Exploring the relationship between air temperature and urban morphology factors using machine learning under local climate zones"}, {"paperId": "19a4535069ced08ac0ab8d2f11ffce1289123267", "title": "Prediction of Daily Ambient Temperature and Its Hourly Estimation Using Artificial Neural Networks in Urban Allotment Gardens and an Urban Park in Valladolid, Castilla y León, Spain"}, {"paperId": "52b1eae417b23e5f924d81758966fd7fba3a877b", "title": "Impact of Surrounding Infrastructure on Urban Environment: A Case Study of Karachi Metropolitan"}, {"paperId": "7d0d6fc01ec6ca4382cfe1a12202df2663a7002f", "title": "Land use/land change detection and determination of land surface temperature variation in green belt (Nasirabad) district of Balochistan, Pakistan"}, {"paperId": "57468e3229a3eaf4fbc43cd694d18ca8d5a8f0f2", "title": "Urban cooling potential and cost comparison of heat mitigation techniques for their impact on the lower atmosphere"}, {"paperId": "4a93ae2f619aad98aa65f412572dfd8d003d8a6b", "title": "Relation of land surface temperature with different vegetation indices using multi-temporal remote sensing data in Sahiwal region, Pakistan"}, {"paperId": "af701b47d36b5882a9006ad5eb8ca34668e33a33", "title": "Research on Spatial and Temporal Patterns of Heat Island Variability and Influencing Factors in Urban Center Areas: A Case Study of Beijing’s Central Area"}, {"paperId": "df3b01049852298482773dcc72913d319ba7796d", "title": "Effects of road infrastructure development on residential property value and land development shifts in a peri-urban area of Karachi, Pakistan"}, {"paperId": "8b08a8113cc991865fd220e6cd06c0cd55bfd6b6", "title": "Mining and modeling the direct and indirect causalities among factors affecting the Urban Heat Island severity using structural machine learned Bayesian networks"}, {"paperId": "5cbf326c337ea7a6dc1e244115bfba07bd29483f", "title": "Time Series Analyses and Forecasting of Surface Urban Heat Island Intensity Using ARIMA Model in Punjab, Pakistan"}, {"paperId": "6618319e4ee6a6fd26c126e12ff1b6fa8d8c81e5", "title": "Assessing Spatial-Temporal Changes in Monetary Values of Urban Ecosystem Services through Remotely Sensed Data"}, {"paperId": "203b6285836dd92042064a412021050368e2003e", "title": "Ensuring Earthquake-Proof Development in a Swiftly Developing Region through Neural Network Modeling of Earthquakes Using Nonlinear Spatial Variables"}, {"paperId": "3e480ccbc58592da569bd6338cf2892ecc03bc29", "title": "Examining the relationship between land surface temperature and landscape features using spectral indices with Google Earth Engine"}, {"paperId": "425e0229e25dd2e3ffb7a0c3da9ddd061c4ea8f8", "title": "RSEDM: A New Rotational-Scan Exponential Decay Model for Extracting the Surface Urban Heat Island Footprint"}, {"paperId": "b1fb3a3bccc3bdec22a07792647ba8d934740873", "title": "Assessment of land use/land cover changes and its effect on land surface temperature using remote sensing techniques in Southern Punjab, Pakistan"}, {"paperId": "714f44669bf1ab98298e0d93b4f7645c48bb5225", "title": "Delineating Groundwater Recharge Potential through Remote Sensing and Geographical Information Systems"}, {"paperId": "24bd4692193f898196bdf0b8f81075741b4420f8", "title": "The Seasonality of Surface Urban Heat Islands across Climates"}, {"paperId": "0f6cf0f4a54b0f8878fbf2bf5bb57907cf26837f", "title": "Quantifying Urban Expansion from the Perspective of Geographic Data: A Case Study of Guangzhou, China"}, {"paperId": "dc396ae9563ceb55a9a0d2d5707215b323290ea4", "title": "Identifying and Ranking Landfill Sites for Municipal Solid Waste Management: An Integrated Remote Sensing and GIS Approach"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "9a541498e285a35443f08b5bdf165e95de394f19", "title": "Assessing Rainwater Harvesting Potential in Urban Areas: A Building Information Modelling (BIM) Approach"}, {"paperId": "d44e5058331a52052cfc9b83cb3d50ffd8e3e9d3", "title": "Awareness of Air Pollution and Ecosystem Services Provided by Trees: The Case Study of Warsaw City"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}, {"paperId": "56914dc7187899842cc101fad0ad299180efeabe", "title": "Using Multivariate Regression and ANN Models to Predict Properties of Concrete Cured under Hot Weather"}]}
