{"paperId": "014b7990cf07c97f86bea6261589eafd0d228aea", "publicationVenue": {"id": "bea6dbb8-4367-4c35-8e28-e749f3ad107c", "name": "International Conference on Database Theory", "type": "conference", "alternate_names": ["Int Conf Database Theory", "ICDT"], "url": "http://alpha.luc.ac.be/~lucp1080/icdt/"}, "title": "Locality-Aware Distribution Schemes", "abstract": "One of the bottlenecks in parallel query processing is the cost of shuffling data across nodes in a cluster. Ideally, given a distribution of the data across the nodes and a query, we want to execute the query by performing only local computation and no communication: in this case, the query is called parallel-correct with respect to the data distribution. Previous work studied this problem for Conjunctive Queries in the case where the distribution scheme is oblivious, i.e., the location of each tuple depends only on the tuple and is independent of the instance. In this work, we show that oblivious schemes have a fundamental theoretical limitation, and initiate the formal study of distribution schemes that are locality-aware. In particular, we focus on a class of distribution schemes called co-hash distribution schemes, which are widely used in parallel systems. In co-hash partitioning, some tables are initially hashed, and the remaining tables are co-located so that a join condition is always satisfied. Given a co-hash distribution scheme, we formally study the complexity of deciding various desirable properties, including obliviousness and redundancy. Then, for a given Conjunctive Query and co-hash scheme, we determine the computational complexity of deciding whether the query is parallel-correct. We also explore a stronger notion of correctness, called parallel disjoint correctness, which guarantees that the query result will be disjointly partitioned across nodes, i.e., there is no duplication of results.", "venue": "International Conference on Database Theory", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "22:1-22:25"}, "authors": [{"authorId": "2455978", "name": "Bruhathi Sundarmurthy"}, {"authorId": "1713920", "name": "Paraschos Koutris"}, {"authorId": "5151034", "name": "J. Naughton"}], "citations": [{"paperId": "92bc06ec0ce0c3032c1ad2a7bd149a8d63d6ee24", "title": "Optimizing Distributed Protocols with Query Rewrites"}, {"paperId": "db884bc01fdbcae3ee53fbfa17777e72c1b23615", "title": "Automatic Compartmentalization of Distributed Protocols"}]}
