{"paperId": "014de1b3bbfdb02efaca280df87739104717a246", "publicationVenue": {"id": "b8d611ee-0e0f-44d4-9ea3-04dcf161a643", "name": "Journal of Governance and Regulation", "type": "journal", "alternate_names": ["J Gov Regul"], "issn": "2220-9352", "url": "https://www.virtusinterpress.org/-Journal-of-Governance-and-.html"}, "title": "Information ethics enforcement challenges in the real estate industry: A study of the emerging economy", "abstract": "The South African real estate industry contributes to job creation, economic development and poverty eradication (Estate Agency Affairs Board [EAAB], 2020). However, it is challenged by unethical, unregistered, and non-complying property practitioners firms (EAAB, 2018). Moreover, some firms have inefficient systems that fail to combat hacking and cybercrime (Jardine, 2015). Although firms have strategies in place, there are still instances of unethical behaviour. The accuracy of information is also a problem in the sector. The sector also encounters illegal access including breaking password-protected websites (Johnson, 2015). Hence, this research aimed to examine the extent to which firms enforce information ethics (IE) and to explore the challenges experienced by the firms in the Gauteng province when enforcing IE. The research was both qualitative and quantitative in nature and web-based questionnaires and in-depth interviews were used to collect primary data. The research found that property practitioners firms enforce IE to a great extent. However, they do so with challenges, namely, lack of trust from clients, stricter legislative requirements of keeping records, cybercrime and hacking, lack of physical and electronic storage of information, and clients’ information easily accessible at the Deeds Office. Property practitioners firms should strive to enforce IE to a greater extent while reducing and eliminating these challenges", "venue": "Journal of Governance and Regulation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Journal of Governance and Regulation"}, "authors": [{"authorId": "2223223308", "name": "Itumeleng Vanessa Moropane"}, {"authorId": "70007955", "name": "T. Nenzhelele"}, {"authorId": "2223230845", "name": "Bonginkosi Daniel Tshabalala"}], "citations": []}
