{"paperId": "014fded0cc53c15e4bdf25a3810667ca9dc7a788", "publicationVenue": {"id": "8b7f5c08-5618-4701-889f-00236bc52080", "name": "International Journal of Managing Projects in Business", "type": "journal", "alternate_names": ["Int J Manag Proj Bus"], "issn": "1753-8378", "url": "https://www.emerald.com/insight/publication/issn/1753-8378", "alternate_urls": ["http://www.emeraldinsight.com/loi/ijmpb"]}, "title": "Data analytics for project delivery: unlocking the potential of an emerging field", "abstract": "PurposeIn recent years, there has been a growing interest in the potential of data analytics to enhance project delivery. Yet many argue that its application in projects is still lagging behind other disciplines. This paper aims to provide a review of the current use of data analytics in project delivery encompassing both academic research and practice to accelerate current understanding and use this to formulate questions and goals for future research.Design/methodology/approachWe propose to achieve the research aim through the creation of a systematic review of the status of data analytics in project delivery. Fusing the methodology of integrative literature review with a recently established practice to include both white and grey literature amounts to an approach tailored to the state of the domain. It serves to delineate a research agenda informed by current developments in both academic research and industrial practice.FindingsThe literature review reveals a dearth of work in both academic research and practice relating to data analytics in project delivery and characterises this situation as having “more gap than knowledge.” Some work does exist in the application of machine learning to predicting project delivery though this is restricted to disparate, single context studies that do not reach extendible findings on algorithm selection or key predictive characteristics. Grey literature addresses the potential benefits of data analytics in project delivery but in a manner reliant on “thought-experiments” and devoid of empirical examples.Originality/valueBased on the review we articulate a research agenda to create knowledge fundamental to the effective use of data analytics in project delivery. This is structured around the functional framework devised by this investigation and highlights both organisational and data analytic challenges. Specifically, we express this structure in the form of an “onion-skin” model for conceptual structuring of data analytics in projects. We conclude with a discussion about if and how today’s project studies research community can respond to the totality of these challenges. This paper provides a blueprint for a bridge connecting data analytics and project management.", "venue": "International Journal of Managing Projects in Business", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-04-02", "journal": {"name": "International Journal of Managing Projects in Business"}, "authors": [{"authorId": "2294554742", "name": "Yixue Shen"}, {"authorId": "2294250370", "name": "Naomi Brookes"}, {"authorId": "2294251029", "name": "Luis Lattuf Flores"}, {"authorId": "2294250389", "name": "Julia Brettschneider"}], "citations": []}
