{"paperId": "01617b567802e68242fd75c22626b99034922237", "publicationVenue": {"id": "7203aa4d-1092-4dc7-aace-5de588875b2f", "name": "Current Medical Research and Opinion", "type": "journal", "alternate_names": ["Curr Med Res Opin"], "issn": "0300-7995", "url": "http://www.tandfonline.com/icmo", "alternate_urls": ["http://www.tandfonline.com/openurl?genre=journal&stitle=icmo20"]}, "title": "Long-term persistence and other treatment patterns among bio-naïve patients with Crohn’s disease treated with ustekinumab or adalimumab", "abstract": "Abstract Objective To estimate long-term persistence among bio-naïve patients with CD initiated on ustekinumab or adalimumab. Methods Adults with CD initiating ustekinumab or adalimumab (index date, between September 23, 2016 and August 1, 2019) were sampled from the IBM MarketScan Commercial Database. Patients without CD-indicated biologics (bio-naïve) and with no diagnoses for other autoimmune diseases 12 months pre-index date (baseline) were included. Cohorts were balanced on baseline characteristics with inverse probability of treatment weighting. Persistence was defined as the absence of therapy exposure gaps >120 days (ustekinumab) or >60 (adalimumab) between days of supply. Composite endpoints were persistence and being corticosteroid-free (no corticosteroids >14 days of supply after day 90 post-index) and persistence while on monotherapy (no immunomodulators/non-index biologics). Persistence was analyzed using Kaplan-Meier and Cox’s models. Results Ustekinumab and adalimumab cohorts included 671 and 2,975 patients. At 12 months post-index, ustekinumab patients were significantly more persistent (hazard ratio [HR] = 1.60; 95% confidence interval [CI] = 1.33–1.93), persistent while on monotherapy (HR = 1.43; 95% CI = 1.24–1.65), and trended toward being more persistent and corticosteroid-free (HR = 1.14; 95% CI = 0.99–1.30) vs adalimumab. At 24 months post-index, ustekinumab patients were significantly more persistent (HR = 1.66; 95% CI = 1.40–1.97), persistent while on monotherapy (HR = 1.44; 95% CI = 1.26–1.64), and persistent and corticosteroid-free (HR = 1.15; 95% CI = 1.01–1.31) vs adalimumab. Conclusions Bio-naïve patients with CD initiated on ustekinumab demonstrated significantly more persistence than patients initiated on adalimumab at 12 and 24 months of treatment. Long-term persistence is a measure of a drug’s real-world performance and findings may aid clinical decision-making. PLAIN LANGUAGE SUMMARY Choosing a treatment on which a patient can stay over a long period of time is key for the successful management of chronic conditions such as Crohn’s disease. Information on whether and how long patients stay on treatment can help physicians make the right therapeutic choice. This study examined whether adults with Crohn’s disease, who have not previously taken biologics, stay on treatment longer when given the biologic ustekinumab or adalimumab. At 12 and 24 months after starting the treatment, a larger proportion of patients were still using ustekinumab compared with adalimumab. The proportion of patients using the biologic without immunomodulators or other biologics was also higher with ustekinumab. The results suggest that patients without previous biologic experience stay on treatment longer with ustekinumab than with adalimumab.", "venue": "Current Medical Research and Opinion", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-11", "journal": {"name": "Current Medical Research and Opinion", "pages": "1215 - 1225", "volume": "39"}, "authors": [{"authorId": "17894718", "name": "M. Zhdanava"}, {"authorId": "1515757663", "name": "Z. Ding"}, {"authorId": "2934706", "name": "A. Manceur"}, {"authorId": "153780545", "name": "R. Zhao"}, {"authorId": "2170915172", "name": "C. Holiday"}, {"authorId": "50741466", "name": "S. Kachroo"}, {"authorId": "82552613", "name": "J. Izanec"}, {"authorId": "50167979", "name": "D. Pilon"}], "citations": []}
