{"paperId": "01692821c85240e6a21b9a8b98fcea435d07b8c2", "publicationVenue": {"id": "5334d34c-deab-4ef6-8460-abd4cd569f74", "name": "International Journal of Advanced Trends in Computer Science and Engineering", "type": "journal", "alternate_names": ["Int J Adv Trends Comput Sci Eng"], "issn": "2278-3091", "url": "http://warse.org/ijatcse_current.html"}, "title": "FPGA Library Based Design of a Hardware Model for Convolutional Neural Network with Automated Weight Compression using K-Means Clustering", "abstract": "In this paper, a design of a synthesizable hardware model for a Convolutional Neural Network (CNN) is presented. The hardware model is capable of self-training i.e. without the use of any external processors. It is trained to recognize four numerical digit images. Another hardware model is also designed for the K-means clustering algorithm. This second hardware model is used to for compressing the weights of the CNN through quantization. Weight compression is carried out through weight sharing. With weight sharing, the system is able to save component usage. The two hardware models designed are then subsequently integrated to automate the compression of the CNN weights after the CNN completes its training. The entire design is based on fixed point arithmetic operation using VHDL as design entry tool and XILINX Virtex 5 FPGA as the target library for synthesis. After completing the design, it is evaluated in terms of hardware consumption with respect to rate of compression. When evaluating the recognition performance ability of the hardware model, digit images experimentation results have shown that the weight compression can reach as high as 60% without any negative effect on the performance of the CNN. Based on data gathered, the compression with the least hardware consumption occurs at 80 %. For the various digits trained, the CNN outputs after the training, range from 89% to 97%.", "venue": "International Journal of Advanced Trends in Computer Science and Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-08-25", "journal": {"name": "International Journal of Advanced Trends in Computer Science and Engineering"}, "authors": [{"authorId": "32360773", "name": "R. Yap"}], "citations": [{"paperId": "c16d3a058fb4afd8b7ec2ee1800791d1363cd366", "title": "Low power Multicarrier- Code Division Multiple Access Receiver on Field Programmable Gate Array"}, {"paperId": "ef7b13c1ac66c1024cc293c78f07aa52da5a32c9", "title": "An Image Denoising Framework based on Patch Grouping in Complex Wavelet Domain"}]}
