{"paperId": "0169d2091dfc4cc465070bacbe3a46aec507b857", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Multibranch Adaptive Fusion Graph Convolutional Network for Traffic Flow Prediction", "abstract": "Urban road networks have complex spatial and temporal correlations, driving a surge of research interest in spatial-temporal traffic flow prediction. However, prior approaches often overlook the temporal-scale differentiation of spatial-temporal features, limiting their ability to extract complex structural information. In this work, we design the multibranch adaptive fusion graph convolutional network (MBAF-GCN) that explicitly exploits the prior spatial-temporal characteristics at different temporal scales, and each branch is responsible for extracting spatial-temporal features at a specific scale. Besides, we design the spatial-temporal feature fusion (STFF) module to refine the prediction results. Based on the multibranch complementary features, the module adopts a coarse-to-fine fusion strategy, incorporating different spatial-temporal scale features to obtain recalibrated prediction results. Finally, we evaluate the MBAF-GCN using two real-world traffic datasets. Experimentally, the newly designed multibranch can efficaciously utilize the prior information of different temporal scales. Our MBAF-GCN achieved better performance in the comparative model, indicating its potential and validity.", "venue": "Journal of Advanced Transportation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-13", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "2189981670", "name": "Xin Zan"}, {"authorId": "2900533", "name": "J. Lam"}], "citations": [{"paperId": "d9f934331cd908eddef11e57a8b99ba10cc950c8", "title": "Attention Mechanism with Spatial-Temporal Joint Deep Learning Model for the Forecasting of Short-Term Passenger Flow Distribution at the Railway Station"}]}
