{"paperId": "0175643541b6ff30bd46b5bdc965cc114806899e", "publicationVenue": {"id": "0a8dcb18-57f7-497d-beb1-4c5745277542", "name": "SHS Web of Conferences", "alternate_names": ["SHS Web Conf"], "issn": "2261-2424", "url": "https://web.archive.org/web/*/https:/www.shs-conferences.org/", "alternate_urls": ["https://www.shs-conferences.org/"]}, "title": "Innovations in the System of Strategic Management of the Security of the National Economy", "abstract": "The article is devoted to the study of the significance of innovations in the system of strategic management of the security of the national economy in the context of globalization and uncertainty. The strategically important tasks of the modern state are the development of domestic science-intensive production, the development, implementation, development of innovative information technologies focused on the production of competitive products. It is concluded that innovations in the conditions of an innovative economy are not only the final commercialized result of innovative activity that has received demand among individual consumers, but also intermediate results of the innovation process in the form of an innovative idea being implemented in the field of marketing, management, and personnel management. The article systematizes the attributive properties of innovations in the conditions of an innovative economy. The degree of entrepreneurial risk is analyzed due to the need to constantly search for new ways of doing business in a changing external environment and in conditions of high competition. The concepts of “innovative activity” and “innovative process” in the system of innovative economy are distinguished. The system of innovativeness of entrepreneurship in an innovative economy is generalized, if an entrepreneur at any specific stages of the life cycle seeks to introduce innovations, new technologies, innovative forms of personnel management or non-standard forms of interaction with competitors.", "venue": "SHS Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "SHS Web of Conferences"}, "authors": [{"authorId": "2151549278", "name": "P. Isaeva"}], "citations": []}
