{"paperId": "018229c09372e90bef5264e103e8402dd42a83b0", "publicationVenue": {"id": "5bd34b7c-17b3-4080-96c2-50bd51fcab3a", "name": "Quantitative Science Studies", "type": "journal", "alternate_names": ["Quant Sci Stud"], "issn": "2641-3337", "url": "https://www.mitpressjournals.org/loi/qss", "alternate_urls": ["https://www.mitpressjournals.org/qss"]}, "title": "The data set knowledge graph: Creating a linked open data source for data sets", "abstract": "Abstract Several scholarly knowledge graphs have been proposed to model and analyze the academic landscape. However, although the number of data sets has increased remarkably in recent years, these knowledge graphs do not primarily focus on data sets but rather on associated entities such as publications. Moreover, publicly available data set knowledge graphs do not systematically contain links to the publications in which the data sets are mentioned. In this paper, we present an approach for constructing an RDF knowledge graph that fulfills these mentioned criteria. Our data set knowledge graph, DSKG, is publicly available at http://dskg.org and contains metadata of data sets for all scientific disciplines. To ensure high data quality of the DSKG, we first identify suitable raw data set collections for creating the DSKG. We then establish links between the data sets and publications modeled in the Microsoft Academic Knowledge Graph that mention these data sets. As the author names of data sets can be ambiguous, we develop and evaluate a method for author name disambiguation and enrich the knowledge graph with links to ORCID. Overall, our knowledge graph contains more than 2,000 data sets with associated properties, as well as 814,000 links to 635,000 scientific publications. It can be used for a variety of scenarios, facilitating advanced data set search systems and new ways of measuring and awarding the provisioning of data sets.", "venue": "Quantitative Science Studies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-05", "journal": {"name": "Quantitative Science Studies", "pages": "1324-1355", "volume": "2"}, "authors": [{"authorId": "151112226", "name": "Michael Färber"}, {"authorId": "2139879419", "name": "David Lamprecht"}], "citations": [{"paperId": "88a68e1a6a47d57a2f3a9a6cb8b6036ad0088275", "title": "SemOpenAlex: The Scientific Landscape in 26 Billion RDF Triples"}, {"paperId": "94359b65f9b571a4670f057b7273ff289a0ea988", "title": "A Novel Curated Scholarly Graph Connecting Textual and Data Publications"}, {"paperId": "8dafc7e73524d5971cd228a7ad1d019f8b5b20e5", "title": "MDverse: Shedding Light on the Dark Matter of Molecular Dynamics Simulations"}, {"paperId": "207e5ec25093919c5799f8cf9b672d380f677ac4", "title": "Knowledge graphs for enhancing transparency in health data ecosystems"}, {"paperId": "014b5f1941db7afb8582d6876aa5281b97979019", "title": "Impact, Attention, Influence: Early Assessment of Autonomous Driving Datasets"}, {"paperId": "383ee78afce788035434f4ffb90649bdb034d29a", "title": "Leveraging Knowledge Graph Embeddings to Disambiguate Author Names in Scientific Data"}, {"paperId": "e862356568287c09234229256c144e6019652b2b", "title": "Supporting data discovery: A meta-synthesis comparing perspectives of support specialists and researchers"}, {"paperId": "2be2fe0749b7be5cc25c3289f3b736d2655531ca", "title": "Nanopublication-based semantic publishing and reviewing: a field study with formalization papers"}, {"paperId": "d5708d3a475f69fd2f9c919a15106ba49040dc5f", "title": "The Microsoft Academic Knowledge Graph enhanced: Author name disambiguation, publication classification, and embeddings"}, {"paperId": "0905b384bc98e40c5a9ca20027f5fab3fbc455b4", "title": "New trends in scientific knowledge graphs and research impact assessment"}, {"paperId": "c0b06d4530feaa8b69258977219a91cc3279c564", "title": "Recommending Datasets for Scientific Problem Descriptions"}, {"paperId": "abb1b90217082d15c0d0afa9bf1689acb04549e2", "title": "Reimagining open data ecosystems: a practical approach using AI, CI, and knowledge graphs"}, {"paperId": "124bfd7ab38b5f4c8d1f9697a65dd92919182593", "title": "Which Publications' Metadata Are in Which Bibliographic Databases? A System for Exploration"}, {"paperId": "f57e576aac3b9518572c91b2b9fcbd7f1512ec05", "title": "Are we building the data discovery infrastructure researchers want? Comparing perspectives of support specialists and researchers"}, {"paperId": "7cd8e00379628a07b7f383a2e381ee0da8783657", "title": "in 26 Billion RDF Triples"}]}
