{"paperId": "018f96d8e9fe15111c8062ce3a70f8fb4aeeebdc", "publicationVenue": {"id": "405d3ff0-9965-44d1-8a3b-a0213cb7dc00", "name": "International Conference on Educational and Information Technology", "type": "conference", "alternate_names": ["International Conference on Electrical and Information Technologies", "ICEIT", "Int Conf Electr Inf Technol", "Int Conf Educ Inf Technol"]}, "title": "Hybrid big data warehouse for on-demand decision needs", "abstract": "Every day trillions of data are generated across the world and put the information systems facing the emergence of big data phenomenon. This vertiginous evolution makes the enterprise confronting the challenge to build its own big data. To achieve the challenge, the enterprise is supposed to embark on big investments in terms of resource and material to process petabytes of diverse data, this last are sometimes useful and sometimes useless. The problem here is how to optimize data relevancy to extract value from the big data sources. From this Reasons, we propose in this paper an ETL and MapReduce Hybrid Approach based on Data Filtering and Processing to build an effective on-demand Dimensional Big Data, enabling enterprises to process relevant data in efficient and effective way according to the stakeholder's needs.", "venue": "International Conference on Educational and Information Technology", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-11-01", "journal": {"name": "2017 International Conference on Electrical and Information Technologies (ICEIT)", "pages": "1-6"}, "authors": [{"authorId": "9275572", "name": "Meryeme El Houari"}, {"authorId": "1880091", "name": "Maryem Rhanoui"}, {"authorId": "2796978", "name": "B. E. Asri"}], "citations": [{"paperId": "f094782807b127fab81378677afa505403c8a506", "title": "A Solution to Query Processing Challenges Through Smart Query Processor for Big Data Analytics"}, {"paperId": "bb7866522234dec89fd7392f0859b2ae83d2758d", "title": "Energy Provider Data Warehouse Design and Implementation - Case Study"}, {"paperId": "9ca5e277fb9e763b5d95213f1d9b6bb8a431971b", "title": "MID-TIER MODELS FOR BIG DATA"}]}
