{"paperId": "019459d8a2ab679727aec566eff1c4b0125f37f9", "publicationVenue": {"id": "7f2819a2-126b-4ea8-96c1-55004927d3ac", "name": "International Symposium on VLSI Design, Automation and Test", "type": "conference", "alternate_names": ["VLSI-DAT", "Int Symp VLSI Des Autom Test"]}, "title": "A TinyMLaaS Ecosystem for Machine Learning in IoT: Overview and Research Challenges", "abstract": "Tiny Machine Learning (TinyML) is an emerging concept that concerns the execution of ML tasks on very constrained IoT devices. Although TinyML has generated a strong R&D interest around it, various challenges limit its effective execution in the constrained devices world, with the result of slowing down the development of a complete ecosystem around it. TinyML as-a-Service (TinyMLaaS) aims to fill the gap in this respect, with the definition of a set of guidelines that can enable an easier democratization of TinyML. In this paper, we describe how the \"as-a-Service\" model is bound to TinyML, by providing an overview of our concept and introducing the design requirements and building blocks that can make TinyMLaaS reality.", "venue": "International Symposium on VLSI Design, Automation and Test", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-19", "journal": {"name": "2021 International Symposium on VLSI Design, Automation and Test (VLSI-DAT)", "pages": "1-5"}, "authors": [{"authorId": "2091567495", "name": "Hiroshi Doyu"}, {"authorId": "143802931", "name": "Roberto Morabito"}, {"authorId": "2399485", "name": "Martina Brachmann"}], "citations": [{"paperId": "61ed5df9b2620150bdd54a04e7d8830cce6ccb35", "title": "Real Time Voice Recognition System using Tiny ML on Arduino Nano 33 BLE *"}, {"paperId": "7b7da4a90b34a35e895b9520f7a1cb84ade431e4", "title": "A review of on-device machine learning for IoT: An energy perspective"}, {"paperId": "b76b2bd50c901e8597d8b1cfdc1b7e3d1e177181", "title": "Implementation of Smart Security System in Agriculture fields Using Embedded Machine Learning"}, {"paperId": "b8473ef48319525ace9e3faec2224ca567ee0938", "title": "Enhancement in IoT through Custom Instruction Set Architectures and TinyML: Review"}, {"paperId": "bbec7377342d159c12b4f5872c3236910253b525", "title": "Data Aware Neural Architecture Search"}, {"paperId": "bb97ec50be795510a085cf4b6f70ecdb6aa5be3c", "title": "Towards secure private and trustworthy human-centric embedded machine learning: An emotion-aware facial recognition case study"}, {"paperId": "558fab3d6c877567382c12ec5b5f650fd19fa79e", "title": "Intelligence at the Extreme Edge: A Survey on Reformable TinyML"}, {"paperId": "3d2c439e0aef92f0e4f1d4ec080cec05cc784951", "title": "How to Manage Tiny Machine Learning at Scale: An Industrial Perspective"}, {"paperId": "bea923292fc2b317069bf0b1827b1b50e77baa7c", "title": "Evaluating the practical limitations of TinyML: an experimental approach"}, {"paperId": "3f20eff4ccc2af9b6fb36384f89d9542077349e0", "title": "LB-CNN: An Open Source Framework for Fast Training of Light Binary Convolutional Neural Networks using Chainer and Cupy"}, {"paperId": "adc27778bfc2a9dd855366130089d3a7ecdf4f23", "title": "Widening Access to Applied Machine Learning with TinyML"}, {"paperId": "bafb6955ceb999c2d0bebfc46e5aefbd6bb7ac8e", "title": "Security and Privacy of Blockchain-Based Single-Bit Cache Memory Architecture for IoT Systems"}, {"paperId": "7dd7c92f5ce34888403d7a3d9e4ade9ed8264037", "title": "Efficient People Counting in Thermal Images: The Benchmark of Resource-Constrained Hardware"}]}
