{"paperId": "01a2ef2bdf131dd8edc0820755c324d8fe73277b", "publicationVenue": {"id": "4b287a90-4cd2-44ad-8edb-c670c48a64b3", "name": "Geological Journal", "type": "journal", "alternate_names": ["Geol J"], "issn": "0072-1050", "alternate_issns": ["1025-6814"], "url": "http://eu.wiley.com/WileyCDA/WileyTitle/productCd-GJ.html", "alternate_urls": ["http://geojournal.igs-nas.org.ua/", "https://onlinelibrary.wiley.com/journal/10991034", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1034", "http://www3.interscience.wiley.com/cgi-bin/jhome/1903"]}, "title": "Landslide susceptibility prediction using machine learning and remote sensing: Case study in Thua Thien Hue province, Vietnam", "abstract": "Landslides lead to widespread devastation and significant loss of life in mountainous regions around the world. Susceptibility assessments can provide critical data to help decision‐makers, for example, local authorities and other organizations, mitigating the landslide risk, although the accuracy of existing studies needs to be improved. This study aims to assess landslide susceptibility in the Thua Thien Hue province of Vietnam using deep neural networks (DNNs) and swarm‐based optimization algorithms, namely Adam, stochastic gradient descent (SGD), Artificial Rabbits Optimization (ARO), Tuna Swarm Optimization (TSO), Sand Cat Swarm Optimization (SCSO), Honey Badger Algorithm (HBA), Marine Predators Algorithm (MPA) and Particle Swarm Optimization (PSO). The locations of 945 landslides occurring between 2012 and 2022, along with 14 conditioning factors, were used as input data to build the DNN and DNN‐hybrid models. The performance of the proposed models was evaluated using the statistical indices receiver operating characteristic curve, area under the curve (AUC), root mean square error, mean absolute error (MAE), R2 and accuracy. All proposed models had a high accuracy of prediction. The DNN‐MPA model had the highest AUC value (0.95), followed by DNN‐HBA (0.95), DNN‐ARO (0.95), DNN‐Adam (0.95), DNN‐SGD (0.95), DNN‐TSO (0.93), DNN‐PSO (0.9) and finally DNN‐SCSO (0.83). High‐precision models have identified that the majority of the western region of Thua Thien Hue province is very highly susceptible to landslides. Models like the aforementioned ones can support decision‐makers in updating large‐scale sustainable land‐use strategies.", "venue": "Geological Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-20", "journal": {"name": "Geological Journal"}, "authors": [{"authorId": "2149222446", "name": "H. Nguyen"}, {"authorId": "115987442", "name": "Q. Nguyen"}, {"authorId": "2072520783", "name": "Q. Du"}, {"authorId": "117460764", "name": "Viet Thanh Pham"}, {"authorId": "2244424043", "name": "Le Tuan Pham"}, {"authorId": "1680675234", "name": "Thanh Van Hoang"}, {"authorId": "2244393422", "name": "Quang‐Hai Truong"}, {"authorId": "69885178", "name": "Quang-Thanh Bui"}, {"authorId": "71931020", "name": "A. Petrisor"}], "citations": [{"paperId": "771df9d22973cc235eec4b6558ec5725562cfdb5", "title": "Application of hybrid model-based machine learning for groundwater potential prediction in the north central of Vietnam"}]}
