{"paperId": "01abd546c4369f893542f7bb5b29f763a975bd08", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A New Big Data Benchmark for OLAP Cube Design Using Data Pre-Aggregation Techniques", "abstract": "In recent years, several new technologies have enabled OLAP processing over Big Data sources. Among these technologies, we highlight those that allow data pre-aggregation because of their demonstrated performance in data querying. This is the case of Apache Kylin, a Hadoop based technology that supports sub-second queries over fact tables with billions of rows combined with ultra high cardinality dimensions. However, taking advantage of data pre-aggregation techniques to designing analytic models for Big Data OLAP is not a trivial task. It requires very advanced knowledge of the underlying technologies and user querying patterns. A wrong design of the OLAP cube alters significantly several key performance metrics, including: (i) the analytic capabilities of the cube (time and ability to provide an answer to a query), (ii) size of the OLAP cube, and (iii) time required to build the OLAP cube. Therefore, in this paper we (i) propose a benchmark to aid Big Data OLAP designers to choose the most suitable cube design for their goals, (ii) we identify and describe the main requirements and trade-offs for effectively designing a Big Data OLAP cube taking advantage of data pre-aggregation techniques, and (iii) we validate our benchmark in a case study.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-04", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1795390", "name": "Roberto Tardío"}, {"authorId": "145782886", "name": "A. Maté"}, {"authorId": "145340803", "name": "J. Trujillo"}], "citations": [{"paperId": "f204f9e9712f11c775e23c91f9bde8eda3687d54", "title": "MetaPortal: Business Intelligence and Machine Learning Approach for VR Data"}, {"paperId": "2ce69725cc5fe7549d0a87215d0065faff7e3e59", "title": "Multidimensional Data Analysis of Ambient Air Quality Based on Apache Kylin"}, {"paperId": "dd1c1e912ef3467944c330762a20d7b266918391", "title": "Research on Big Data Ad Hoc Query Technology Based on an Accident Insurance Campaign"}, {"paperId": "0c6066a15edc86794eb9526a6180caa6e6517201", "title": "Research on the Learning Performance and Communication Networking of Online Analytical Processing Courses"}, {"paperId": "cc14c18f70031065e4d9a950d661644e90480b08", "title": "The Project-Based Learning Study of Insurance Information Courses to Simulate the Application of Online Analytical Processing"}, {"paperId": "e020d4bbd0d51b31058dca7ce16365ea5a0279de", "title": "Beyond TPC-DS, a benchmark for Big Data OLAP systems (BDOLAP-Bench)"}, {"paperId": "b3355aaa7a0cb0ea26d5f0c6ac864f610ff50f0c", "title": "A Natural Language Interface to Relational Databases Using an Online Analytic Processing Hypercube"}, {"paperId": "c9db8ab6d7373ac5cd30a8eab63efe3ab4f409de", "title": "A Data Cube Metamodel for Geographic Analysis Involving Heterogeneous Dimensions"}, {"paperId": "784ff2f7c1a05b3a753837774a9ee6289fc4c2bf", "title": "Optimal data warehouse design with data marts and data cube aggregation"}, {"paperId": "cb5caedd286eb496f5e949d6fd64fcad7c35c9f1", "title": "Reduced Quotient Cube: Maximize Query Answering Capacity in OLAP"}, {"paperId": "d51a2006a859a9abd0677f4a6fdc5c6768cab18b", "title": "The development and implementation of a multidimensional relational database of fire danger metrological data"}, {"paperId": "3e94d5757e75bfab56f845ea48225e42169d318a", "title": "Faster Access Of Credit Cards Through Data Cube Technology"}]}
