{"paperId": "01ad011353964ab5b3d4458e665889939095a834", "publicationVenue": null, "title": "Smart RFID System for Locker Cabinet Security Using Android App", "abstract": "Crime rates have gone higher from year to year, especially crimes related to thievery. It is one of the issues that traditional security devices failed to handle, due to their weaknesses and inability to inform the owner about the status of the lock. Technology has advanced to another level, where it has enabled devices to communicate with one another with the use of the internet. This technology can be used to complement traditional security system weaknesses. The purpose of this research was to propose a prototype of a Smart RFID System for Locker Cabinet Security Using an Android App. The prototype utilizes WeMos D1 R2 with ESP8266 Wi-Fi module as the microprocessor. Blynk app is used to monitor and control the microcontroller. First, the WeMos D1 R2 will be connected to actuators and sensors, such as a servo motor, LCD, and RFID reader. Therefore, it can control the functionality of each component, followed by android application which can be used by the admin to identify the UID of the card being tapped by the user and give permissions to open the locker. When the admin chooses “Accept”, the cabinet will be unlocked and when”Deny”, the lock stays shut. The prototype is able to work as intended, while it also spark researcher to improve the prototype by implementing a database system, better application development, and applying artificial intelligence to the system.", "venue": "2022 4th International Conference on Cybernetics and Intelligent System (ICORIS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-08", "journal": {"name": "2022 4th International Conference on Cybernetics and Intelligent System (ICORIS)", "pages": "1-8"}, "authors": [{"authorId": "120378600", "name": "K. Wijaya"}, {"authorId": "2200184101", "name": "J. Heriyanto"}, {"authorId": "2204832139", "name": "Davis Inde Satya"}, {"authorId": "2204853916", "name": "Jovianto Godjali"}, {"authorId": "2068698401", "name": "Rissa Rahmania"}], "citations": [{"paperId": "fca88cbabf2ec55da59375c27cce2946867d23c8", "title": "Facilitating Fingerprint-Based Door Automation System Using RFID and Bluetooth"}, {"paperId": "a972ada6de030e794d13851f56004541a3fbd5a7", "title": "A Prototype of An Automatic Little Free Pantry Utilizing An Identification Card"}, {"paperId": "318e39d6c1b93a88133a6142bd2ca7768ca9a4bf", "title": "A survey on low-cost development boards for applying cryptography in IoT systems"}]}
