{"paperId": "01bb7c077f488b4f6465af823a738fff33fa3311", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Data Allocation Strategy for Geocomputation Based on Shape Complexity in A Cloud Environment Using Parallel Overlay Analysis of Polygons as an Example", "abstract": "Given the explosive growth of geospatial data, parallel computing technologies have become widely used in the spatial analysis of these massive types of data. The data used in geographic computing often exhibit a complex graphic structure, which is an important cause of data skew in parallel computing. The shape complexity is crucial to the task allocation strategy of parallel computing. The effect of polygon shape features on the performance of spatial analysis was investigated in this study. A quantitative polygon-shaped complexity evaluation model was established through regression analysis. The Hilbert data partition strategy weighted by shape complexity was used as a spatial data allocation method for parallel spatial analysis. This study established a shape complexity evaluation model for overlay analysis and used the Spark parallel computing paradigm to carry out a comparative experiment of a massive, complex polygon. Experimental results showed that the spatial data allocation strategy based on the complexity of polygon shape computing effectively solved the problem of data skew in the parallel spatial analysis of massive complex polygons.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "185981-185991", "volume": "8"}, "authors": [{"authorId": "2074107196", "name": "Kang Zhao"}, {"authorId": "4418991", "name": "Baoxuan Jin"}, {"authorId": "2072837798", "name": "Hong Fan"}, {"authorId": "1708211359", "name": "Mei Yang"}], "citations": [{"paperId": "1f890b3d5a386d841e5ccd93500f08c1a94c62fe", "title": "A method for measuring geometric information content of area cartographic objects based on discrepancy degree of shape points"}, {"paperId": "b110f320c84053fddb280d67b5664da48c4167e8", "title": "Improving NoSQL Spatial-Query Processing with Server-Side In-Memory R*-Tree Indexes for Spatial Vector Data"}, {"paperId": "e3c1c45935c04dee7d758120d108a13f8cf2565b", "title": "Decision support for hydraulic crane stabilization using combined loading and crane mat strength analysis"}, {"paperId": "7985106cd9508f98039467b530b3ee293fde7737", "title": "Comparative Study on the Effect of Shape Complexity on the Efficiency of Different Overlay Analysis Algorithms"}]}
