{"paperId": "01cd7f09765ef2d325dc95bf87119a78c2907577", "publicationVenue": {"id": "3007ca7d-dbd5-4f0b-a656-b65018773a61", "name": "International Symposium on High-capacity Optical Networks and Enabling Technologies", "type": "conference", "alternate_names": ["HONET", "Int Symp High-capacity Opt Netw Enabling Technol"]}, "title": "Accuracy-Aware Data Reduction for Internet of Things", "abstract": "The Internet of Things (IoT) generates an enormous amount of data. Usually, either in real-time or after their collection, these data are passed to already trained machine learning and deep learning models for making predictions. Sometimes these data are used for retraining models. While efforts for data reduction have been made, little attention has been given to the effects of data reduction on machine learning models in the IoT context. Furthermore, the works that have explored how accurately data is reduced have no mechanism to use the result as feedback for future data reduction. In this paper, we propose a new reduction technique that depends on feedback from machine learning and deep learning models. As a result, data is as much reduced as required to achieve the desired results for the models. When machine learning model feedback reports low performance, the reduction algorithm increases the amount of data sent. Similarly, when the feedback indicates that the data being sent is sufficient to achieve the desired level of performance, the proposed reduction algorithm attempts to reduce the amount of data further to explore the opportunity that a similar level of performance might be achieved with a comparatively smaller amount of data. Experiments on NASA's turbofan engine data revealed that the algorithm's reduction rate can be integrated with feedback from the machine learning model without significantly affecting the performance of the model.", "venue": "International Symposium on High-capacity Optical Networks and Enabling Technologies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-19", "journal": {"name": "2022 IEEE 19th International Conference on Smart Communities: Improving Quality of Life Using ICT, IoT and AI (HONET)", "pages": "057-062"}, "authors": [{"authorId": "3385369", "name": "Taimur Hafeez"}, {"authorId": "1797885", "name": "G. Mcardle"}], "citations": [{"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}]}
