{"paperId": "01e0485dfb60c75d962f70f8877e4bfc02dcd50c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Adaptive Switching Based Data-Communication Model for Internet of Healthcare Things Networks", "abstract": "The Internet of Things (IoT) is a network of smart sensory objects. These objects collect environmental data and communicate to exchange this gathered data without human intervention. IoT has evolved as a revolutionary technology for over a decade. It is currently, widely applied in a variety of applications like Internet of Vehicles (IoV), Internet of Healthcare Things (IoHT), and the Internet of Everything (IoE). IoHT is one of the most beneficial and significant IoT applications. The quality of the connection in an IoT network is governed by the application layer communication protocol. Application type has a significant impact on the preference of protocol selection. In this paper, the performance of CoAP and MQTT-SN is compared. Based on the performance analysis it was concluded that in case of high traffic conditions network congestion occurs on the medical broker of MQTT-SN, which lowers the network efficiency. A framework is proposed to achieve reliability and time optimization in larger sensor-based healthcare networks. An adaptive switching-based data communication model has been designed. In the proposed model, we have enabled IoHT network to run two application protocols in parallel. The adaptive switching algorithm allows to switch between the two available protocols based on the status of the network condition. Network simulation has been performed using NODE-RED. This tool is used to test the proposed framework in different scenarios. In the end it was concluded that during network congestion conditions at medical broker of MQTT-SN, the adaptive switching algorithm allows the network to switch to CoAP connection for the time efficient and reliable transmission in the IoHT network.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "11530-11548", "volume": "12"}, "authors": [{"authorId": "2220165842", "name": "Mehwash Weqar"}, {"authorId": "2734337", "name": "S. Mehfuz"}, {"authorId": "2279875428", "name": "Dhawal Gupta"}, {"authorId": "2762360", "name": "S. Urooj"}], "citations": []}
