{"paperId": "01efa896fd02c46a9e113b6ae89b7d33e0c1b6d1", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Robust CFAR Detection for Multiple Targets in K-Distributed Sea Clutter Based on Machine Learning", "abstract": "For K-distributed sea clutter, a constant false alarm rate (CFAR) is crucial as a desired property for automatic target detection in an unknown and non-stationary background. In multiple-target scenarios, the target masking effect reduces the detection performance of CFAR detectors evidently. A machine learning based processor, associating the artificial neural network (ANN) and a clustering algorithm of density-based spatial clustering of applications with noise (DBSCAN), namely, DBSCAN-CFAR, is proposed herein to address this issue. ANN is trained with a symmetrical structure to estimate the shape parameter of background clutter, whereas DBSCAN is devoted to excluding interference targets and sea spikes as outliers in the leading and lagging windows that are symmetrical about the cell under test (CUT). Simulation results verified that the ANN-based method provides the optimal parameter estimation results in the range of 0.1 to 30, which facilitates the control of actual false alarm probability. The effectiveness and robustness of DBSCAN-CFAR are also confirmed by the comparisons of conventional CFAR processors in different clutter conditions, comprised of varying target numbers, shape parameters, and false alarm probabilities. Although the proposed ANN-based DBSCAN-CFAR processor incurs more elapsed time, it achieves superior CFAR performance without a prior knowledge on the number and distribution of interference targets.", "venue": "Symmetry", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-05", "journal": {"name": "Symmetry", "pages": "1482", "volume": "11"}, "authors": [{"authorId": "46509424", "name": "Jiafei Zhao"}, {"authorId": "32509722", "name": "Rongkun Jiang"}, {"authorId": "2727809", "name": "Xuetian Wang"}, {"authorId": "50200884", "name": "Hongmin Gao"}], "citations": [{"paperId": "ec5a4169c054952f9dce6b21844eff5009086012", "title": "Radar Perception in Autonomous Driving: Exploring Different Data Representations"}, {"paperId": "ae6434ee5f71b2c47769abdff614d5e75b2fc2a5", "title": "An improved radar clutter suppression by simple neural network"}, {"paperId": "eeb52c1a4998c15641951ad3ab80cc90d5065692", "title": "Percentile-Based Estimator for Generalized Rayleigh CFAR Ship Detection in SAR Imagery"}, {"paperId": "1dde5d3481d63fd66af47fba8a2c5cdc600144a4", "title": "Piecewise-DRL: Joint Beamforming Optimization for RIS-Assisted MU-MISO Communication System"}, {"paperId": "dd81a1ecf04227a08083ea8a513005da2fe63afd", "title": "Multi-headed deep learning-based estimator for correlated-SIRV Pareto type II distributed clutter"}, {"paperId": "35a4f01fed1b6e2b1e9075fd96a16416e948a5cd", "title": "Radar-Camera Fusion for Object Detection and Semantic Segmentation in Autonomous Driving: A Comprehensive Review"}, {"paperId": "9e52e0842134ceb854169f2221821a3f4b4d7e3f", "title": "A CFAR‐like detector based on neural network for simulated high‐frequency surface wave radar data"}, {"paperId": "d63c232299ae4f200100cbb4445e1d97180e6dbc", "title": "Advanced Clutter Mitigation Method for Surveillance Radar using Machine Learning"}, {"paperId": "aaa2a295dd275ec68167e6f38102674193a3487e", "title": "Persistent Homology Approach for Human Presence Detection from 60 GHz OTFS Transmissions"}, {"paperId": "529450344282697980330da8e301d1ecaba0f371", "title": "Modeling of Non-homogeneous Sea Clutter with Texture Modulated Doppler Spectra"}, {"paperId": "19475766cd4b84179ac1e2aa31772f913eb4e74b", "title": "Heterogeneous Performance Assessment of New Approach for Partially-Correlated χ2-Targets Adaptive Detection"}, {"paperId": "d42844211ddc9d8610b35bb7abcf493063a4a95d", "title": "DNN-Based Peak Sequence Classification CFAR Detection Algorithm for High-Resolution FMCW Radar"}, {"paperId": "5fc979663a5253253735a576866603d1ce9f6cb7", "title": "A convolutional neural network based approach to sea clutter suppression for small boat detection"}, {"paperId": "c7f08b180ea364b753570e916e21cd395b04ec1d", "title": "Robust CFAR Detector With Ordered Statistic of Sub-Reference Cells in Multiple Target Situations"}, {"paperId": "766db91e917209d9b4fe475b6b3bcf715f4a2d5c", "title": "Robust Sliding Window CFAR Detection Based on Quantile Truncated Statistics"}, {"paperId": "add43a62ca9fa0a0ddb972a1e4d7da125d586229", "title": "Multi-Aircraft Formation Recognition Method of Over-the-Horizon Radar Based on Deep Transfer Learning"}, {"paperId": "381614653f58e36255e1882794e94b674ce85e8f", "title": "Robust Maritime Target Detector in Short Dwell Time"}]}
