{"paperId": "01f199b387bc8cc7475444151e784326ea457e12", "publicationVenue": {"id": "fc9ab238-e989-4729-9248-3cd35e18320f", "name": "International Journal of Applied Science and Engineering", "type": "journal", "alternate_names": ["Int j appl sci eng", "International journal of applied sciences and engineering", "Int J Appl Sci Eng"], "issn": "2321-0745", "alternate_issns": ["2308-5088", "1727-2394"], "url": "http://ndpublisher.in/ndpjournal.php?j=IJASE", "alternate_urls": ["http://www.ijapscengr.com/"]}, "title": "Performance analysis of hybrid model to detect driver drowsiness at early stage", "abstract": "Vehicle accidents result in numerous fatal and non-fatal injuries that place a heavy financial burden on individuals. The risk of disability for individuals has also increased, and it is difficult for their families to survive. Driver drowsiness is one of the major causes of accidents on the roads. Various researchers have proposed a wide range of approaches, including subjective, vehicle-based, physiological and behavioral measures that help to develop driver drowsiness detection system (DDDS). Most of the studies on DDDS have been developed by utilizing only single measure that haven’t yielded positive results. In this paper, a hybrid model-based DDDS is proposed that combines sensor-based physiological and behavioral measures to detect the drowsy state of the driver in an efficient way. Galvanic skin response (GSR) sensor and camera have been effectively used to detect the drowsy state of the driver. A study was carried out on ten individuals to implement and evaluate the performance of the system. The results indicate that the proposed DDDS can detect transitions from alert to a drowsy state of the driver effectively with an accuracy of 91%. The proposed system would enable drivers to use their vehicles more securely and effectively on the roads.", "venue": "International Journal of Applied Science and Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Applied Science and Engineering"}, "authors": [{"authorId": "115002197", "name": "J. Bajaj"}, {"authorId": "2116961741", "name": "Naveen Kumar"}, {"authorId": "47767350", "name": "R. Kaushal"}], "citations": []}
