{"paperId": "01f3db612acf054747848f1cdcc0a4cf3db974e5", "publicationVenue": {"id": "29b9c461-963e-4d11-b2ab-92c182243942", "name": "IEEE Symposium on Security and Privacy", "type": "conference", "alternate_names": ["S&P", "IEEE Symp Secur Priv"], "url": "http://www.ieee-security.org/"}, "title": "Beyond Phish: Toward Detecting Fraudulent e-Commerce Websites at Scale", "abstract": "Despite recent advancements in malicious website detection and phishing mitigation, the security ecosystem has paid little attention to Fraudulent e-Commerce Websites (FCWs), such as fraudulent shopping websites, fake charities, and cryptocurrency scam websites. Even worse, there are no active large-scale mitigation systems or publicly available datasets for FCWs.In this paper, we first propose an efficient and automated approach to gather FCWs through crowdsourcing. We identify eight different types of non-phishing FCWs and derive key defining characteristics. Then, we find that anti-phishing mitigation systems, such as Google Safe Browsing, have a detection rate of just 0.46% on our dataset. We create a classifier, BEYOND PHISH, to identify FCWs using manually defined features based on our analysis. Validating BEYOND PHISH on never-before-seen (untrained and untested data) through a user study indicates that our system has a high detection rate and a low false positive rate of 98.34% and 1.34%, respectively. Lastly, we collaborated with a major Internet security company, Palo Alto Networks, as well as a major financial services provider, to evaluate our classifier on manually labeled real-world data. The model achieves a false positive rate of 2.46% and a 94.88% detection rate, showing potential for real-world defense against FCWs.", "venue": "IEEE Symposium on Security and Privacy", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE Symposium on Security and Privacy (SP)", "pages": "2566-2583"}, "authors": [{"authorId": "51493620", "name": "Marzieh Bitaab"}, {"authorId": "2431295", "name": "Haehyun Cho"}, {"authorId": "34493724", "name": "Adam Oest"}, {"authorId": "2112547650", "name": "Zhuo Lyu"}, {"authorId": "40397893", "name": "Wei Wang"}, {"authorId": "144519578", "name": "Jorij Abraham"}, {"authorId": "2007575162", "name": "Ruoyu Wang"}, {"authorId": "144782822", "name": "Tiffany Bao"}, {"authorId": "3260361", "name": "Yan Shoshitaishvili"}, {"authorId": "2527531", "name": "Adam Doupé"}], "citations": [{"paperId": "1104d766527dead44a40532e8a89444d9cef5c65", "title": "\"Do Anything Now\": Characterizing and Evaluating In-The-Wild Jailbreak Prompts on Large Language Models"}, {"paperId": "838b2f66aa07dd97a473be59921e2cd7d39461e2", "title": "Detecting Phishing Sites Using ChatGPT"}]}
