{"paperId": "01fa5eb436db99529af2ab69722416afcb03d03e", "publicationVenue": {"id": "78203021-0ba2-4f4f-a38d-23038f5d9c9a", "name": "ACM SIGMM Conference on Multimedia Systems", "type": "conference", "alternate_names": ["ACM SIGMM Conf Multimedia Syst", "MMSys"], "url": "https://dl.acm.org/doi/proceedings/10.1145/3339825"}, "title": "Serving deep neural networks at the cloud edge for vision applications on mobile platforms", "abstract": "The proliferation of high resolution cameras on embedded devices along with the growing maturity of deep neural networks (DNNs) has spawned powerful mobile vision applications. To enable applications on mobile devices, the offloading approach processes live video streams using DNNs on server-class GPU accelerators. However, their use in latency constrained applications is particularly challenging because of the large and unpredictable round-trip latency from mobile devices to the cloud computing resources. As a consequence, system designers routinely look for ways to offload to local servers at the cloud edge, known as the cloudlet. This paper explores the potential of serving multiple DNNs using the cloudlet model to implement complex vision applications on mobile devices. We present DeepQuery, a new mobile offloading system that is capable to serve DNNs with different structures for a wide range of tasks including object detection and tracking, scene graph detection, and video description. DeepQuery provides application programming interfaces to offload applications programed as Directed Acyclic Graphs of DNN queries, and employs data parallelization and input batching techniques to reduce processing delays. To improve GPU utilization, it co-locates real-time and delay-tolerant tasks on shared GPUs, and exploits a predictive and plan-ahead approach to alleviate resource contention caused by co-locating. We evaluate DeepQuery and demonstrate its effectiveness using several real world applications.", "venue": "ACM SIGMM Conference on Multimedia Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-06-18", "journal": {"name": "Proceedings of the 10th ACM Multimedia Systems Conference"}, "authors": [{"authorId": "2072873543", "name": "Zhou Fang"}, {"authorId": "2505157", "name": "Dezhi Hong"}, {"authorId": "2118189262", "name": "Rajesh K. Gupta"}], "citations": [{"paperId": "9d0182278ed9ce7541b5d23a301027d01b12d266", "title": "AdaInf: Data Drift Adaptive Scheduling for Accurate and SLO-guaranteed Multiple-Model Inference Serving at Edge Servers"}, {"paperId": "9c196709ee1e628edee548afaa43822a365dff0b", "title": "Edge-Assisted Adaptive Configuration for Serverless-Based Video Analytics"}, {"paperId": "6167cee3d8a2373fcbd2a75050587627d8f4bb50", "title": "TapFinger: Task Placement and Fine-Grained Resource Allocation for Edge Machine Learning"}, {"paperId": "d83867a180716dfd995f0f7536cbc162f4ce9427", "title": "A Survey on Deep Neural Network Partition over Cloud, Edge and End Devices"}, {"paperId": "f8bce9b9aa7900dfddf8c1ce3f2a71211ad82f0f", "title": "Task Placement and Resource Allocation for Edge Machine Learning: A GNN-Based Multi-Agent Reinforcement Learning Paradigm"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "9e06288497529533b2d097f5a23458b1c5d2350b", "title": "CoRec: An Efficient Internet Behavior-based Recommendation Framework with Edge-cloud Collaboration on Deep Convolution Neural Networks"}, {"paperId": "d760d97cf818f59bca75dc52e74cec42e5caae4f", "title": "Toward Decentralized and Collaborative Deep Learning Inference for Intelligent IoT Devices"}, {"paperId": "1fd40ac5f868af92d43bc97fd2dd7f867718f748", "title": "Edge-cloud Collaborative Architecture for Scene Graph Application System"}, {"paperId": "e5ac8208cd08027eec4daf14cf026bb32bcba8be", "title": "Better Never Than Late: Timely Edge Video Analytics Over the Air"}, {"paperId": "d62e508d1c70f08114a13eb28bee81254eddc670", "title": "When in Doubt, Summon the Titans: Efficient Inference with Large Models"}, {"paperId": "5b373584bae1578497cd5f8fee48adb1f7683dd4", "title": "Towards cloud-edge collaborative online video analytics with fine-grained serverless pipelines"}, {"paperId": "05d9e5cb280013d7748e750f0b1462d9a98a3efe", "title": "CrossRoI"}, {"paperId": "b6e648d52aecad5479a71c0e12a1bf6c6e42b00f", "title": "CrossRoI: cross-camera region of interest optimization for efficient real time video analytics at scale"}, {"paperId": "79f3e59896ea691a4d1ff5d72d4452b7d51335af", "title": "DeepRT: A Soft Real Time Scheduler for Computer Vision Applications on the Edge"}, {"paperId": "037673874019dfb93f940da085bf4e6c8b7833b2", "title": "QoS Optimization of DNN Serving Systems Based on Per-Request Latency Characteristics"}, {"paperId": "3606dd01d7984e04fae29a0277f6cfb5047be865", "title": "Accelerating on-device DNN inference during service outage through scheduling early exit"}, {"paperId": "34ffe6e3285a8b5b1bd4bd24b402a90a84335bc2", "title": "Heimdall: mobile GPU coordination platform for augmented reality applications"}, {"paperId": "b00e89b4ede90904704dff6b64eed34384dfc083", "title": "Deep learning in electron microscopy"}, {"paperId": "8f7cad3d0eef8a8c6b4ad64f9cf23274504ef8a1", "title": "A Latency-Optimized Reconfigurable NoC for In-Memory Acceleration of DNNs"}, {"paperId": "d0ec330f259a79e21458da1e195cfbf9c1153092", "title": "Lightweight Online Profiling-Based Configuration Adaptation for Video Analytics System in Edge Computing"}, {"paperId": "d9c2026c20f4d8cb7fda464fe082a79236e90587", "title": "TrustServing: A Quality Inspection Sampling Approach for Remote DNN Services"}, {"paperId": "badfd21f89731dbc4e24c305cae1fc6f7978e8e6", "title": "FPGA HW/SW Codesign Approach for Real-time Image Processing Using HLS"}, {"paperId": "70d7fdbf765e0436d86b439852976397cf577584", "title": "SEE: Scheduling Early Exit for Mobile DNN Inference during Service Outage"}, {"paperId": "cb70d9f2decfbb61a28785045a14e1daf13aaf64", "title": "Global Exponential Stability of Memristive Complex-valued Neural Networks with Mixed Time Delays and Impulsive Effects"}, {"paperId": "8d0d78a6acc69c15af0d4b7e09487da59d27b3e7", "title": "New models and methods for programming cyber-physical systems (keynote)"}, {"paperId": "408c71fc1ec01011a989e0c369f5693fef57c2d2", "title": "Improving Edge Elasticity via Decode Ofﬂoad"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "659034f4fc2dad3bce28b6895e7d97edbb30798b", "title": "A Low-Cost Video Analytics System with Velocity Based Configuration Adaptation in Edge Computing"}]}
