{"paperId": "01fc7ab8b41a787a80f12df3d3fda9a169b6e43f", "publicationVenue": {"id": "7755a7fc-8f08-4e5d-96c1-f9603e8d744e", "name": "Global Internet of Things Summit", "type": "conference", "alternate_names": ["GIoTS", "Glob Internet Thing Summit"]}, "title": "Updating IoT devices: challenges and potential approaches", "abstract": "The deployment of IoT devices is fostering the realization of an increasingly digital society. However, the features of such devices make them attractive targets for potential attackers. Indeed, each device will have to deal with new vulnerabilities and attacks during its lifecycle. Therefore, defining a secure mechanism for software/firmware updates is essential to guarantee the security of IoT devices. Although different approaches have been proposed in recent years, currently there is a lack of comprehensive approaches to address different requirements, such as scalability, efficiency, or management of versions and dependencies. In this work, we describe a set of challenges and analyze the current landscape of solutions for software/firmware updates in IoT devices. In particular, we focus our analysis on the IETF SUIT working group, as well as blockchain-based solutions, which have attracted a significant interest recently.", "venue": "Global Internet of Things Summit", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "2020 Global Internet of Things Summit (GIoTS)", "pages": "1-5"}, "authors": [{"authorId": "144746857", "name": "José Luis Hernández Ramos"}, {"authorId": "3189946", "name": "G. Baldini"}, {"authorId": "122695500", "name": "S. N. Matheu"}, {"authorId": "1398022789", "name": "A. Gómez-Skarmeta"}], "citations": [{"paperId": "20180ce989688037ac17b2a8936c33d41afe189e", "title": "On the Design of Reconfigurable Edge Devices for RF Fingerprint Identification (RED-RFFI) for IoT Systems"}, {"paperId": "976001dc5b3361d8531448e1f6ca28e809945824", "title": "An Aspect-Oriented Approach to Time-Constrained Strategies in Smart City IoT Applications"}, {"paperId": "e10dc09b39c8dcecc2e4c70b9dedcab3ed97892f", "title": "Escaping Vendor Mortality: A New Paradigm for Extending IoT Device Longevity"}, {"paperId": "ec0882686314b76ffc0e704b8a1b5ab32bb7c1bf", "title": "IoT based real-time traffic monitoring system using images sensors by sparse deep learning algorithm"}, {"paperId": "85221304e831ee15989c9b108842fb2e693138d8", "title": "Growing Threats Of Cyber Security: Protecting Yourself In A Digital World"}, {"paperId": "3dde8ad7ca7d6be9fd04bf8c17b0e885cb189811", "title": "Why people replace their aging smart devices: A push-pull-mooring perspective"}, {"paperId": "a7a98be1e4a0af328a30ff584df5c179ad105a63", "title": "Establishment of a trusted environment for IoT service provisioning based on X3DH-Based brokering and Federated Blockchain"}, {"paperId": "d69c1d333493f17d3f3183655d8be058fb37488d", "title": "Security-Aware Node Replacements and Incremental Updates in Industrial IoT Platforms"}, {"paperId": "0d1c5894ae9d6aeec336df10b350778c6fe02f11", "title": "Sigstore: Software Signing for Everybody"}, {"paperId": "07ca5406341313c954313c634dcbe65b3e503143", "title": "Toward a Secure Firmware OTA Updates for constrained IoT devices"}, {"paperId": "5a72673bfb10466b1414ce3f36c0f599edcfd92b", "title": "Over-the-air firmware update for IoT devices on the wild"}, {"paperId": "2a137015dcc0a1c906b1a74e76d0312813ae492d", "title": "A Digital-Twin Based Architecture for Software Longevity in Smart Homes"}, {"paperId": "27f6f153e771d73403164f19bf260e4c21149c1e", "title": "Penerapan Mekanisme Continuous Deployment dalam Pengembangan dan Pembaruan Perangkat Lunak Sistem Benam Berbasis Internet of Things"}, {"paperId": "d36ba003f289928ced5c42c516ebf1948a55595f", "title": "Reliable IoT Firmware Updates: A Large-scale Mesh Network Performance Investigation"}, {"paperId": "217f023d9029a1478785de3e6cca87efea35af81", "title": "Secure firmware Over-The-Air updates for IoT: Survey, challenges, and discussions"}, {"paperId": "a42ecd8e3b837a21b1b0f58cdbbe098f03f0565c", "title": "Flash Programming Microcontrollers over the GSM Network"}, {"paperId": "3ed11ba9796bd63749532943c400e86ce0420d23", "title": "Hyperledger-Based Secure Firmware Update Delivery for IoT Devices"}, {"paperId": "b6550136304974682bde7ca9b2a8e21c2ea91982", "title": "Evaluating Federated Learning for Intrusion Detection in Internet of Things: Review and Challenges"}, {"paperId": "b7a3e538a189efe04ed5e8a5d5f49bfa453d1aab", "title": "A New Multi-Target Compiler Architecture for Edge-Devices and Cloud Management"}, {"paperId": "87c8a4d6787d8078acb61d9ca9070b49ffd94a85", "title": "Towards Decentralized IoT Updates Delivery Leveraging Blockchain and Zero-Knowledge Proofs"}, {"paperId": "67bc42ef1d0da5664560436c2109a7fcf4612b30", "title": "SHOID: A Secure Herd of IoT Devices Firmware Update Protocol"}, {"paperId": "ae7162ce254e70c0793557ff8e20eba3bec1f2ae", "title": "A Secure Chaos-Based Lightweight Cryptosystem for the Internet of Things"}, {"paperId": "7621014babec2acf4dde2a060f03ff771a826801", "title": "Role of Device Identification and Manufacturer Usage Description in IoT Security: A Survey"}, {"paperId": "764e8f5478d47a8e48b8b7edf39db315092f17a9", "title": "CrowdPatching : Decentralized Distribution of IoT Software Updates"}, {"paperId": "e17ab2b817bf3c8019088f43554751a6a74e7745", "title": "Work in Progress: Towards Usable Updates for Smart Home Devices"}]}
