{"paperId": "020ad58a46965e3394dedea005a25fec02393625", "publicationVenue": null, "title": "Towards an accountable Internet of Things: A call for 'reviewability'", "abstract": "As the IoT becomes increasingly ubiquitous, concerns are being raised about how IoT systems are being built and deployed. Connected devices will generate vast quantities of data, which drive algorithmic systems and result in real-world consequences. Things will go wrong, and when they do, how do we identify what happened, why they happened, and who is responsible? Given the complexity of such systems, where do we even begin? This chapter outlines aspects of accountability as they relate to IoT, in the context of the increasingly interconnected and data-driven nature of such systems. Specifically, we argue the urgent need for mechanisms - legal, technical, and organisational - that facilitate the review of IoT systems. Such mechanisms work to support accountability, by enabling the relevant stakeholders to better understand, assess, interrogate and challenge the connected environments that increasingly pervade our world.", "venue": "Privacy by Design for the Internet of Things: Building accountability and security", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-16", "journal": {"name": "ArXiv", "volume": "abs/2102.08132"}, "authors": [{"authorId": "2232082", "name": "Chris Norval"}, {"authorId": "40915668", "name": "Jennifer Cobbe"}, {"authorId": "144857568", "name": "Jatinder Singh"}], "citations": [{"paperId": "577ea0c8081f53eb3ec39c54952b295b081f4635", "title": "A Room With an Overview: Toward Meaningful Transparency for the Consumer Internet of Things"}, {"paperId": "39da069d1dd779382eb76c6b5980dac27fcd527e", "title": "A Conceptual Evaluation of the Data as Partner (DAP) Framework"}, {"paperId": "15cb5ba1389107461c0943752db633a552baf3e4", "title": "Navigating the Audit Landscape: A Framework for Developing Transparent and Auditable XR"}, {"paperId": "82fcd0499425b8c5d89b4fd69e68d15f90e737ae", "title": "Understanding accountability in algorithmic supply chains"}, {"paperId": "aa1f87dc81d4f015ea9b627bc6f37fce2bd630f8", "title": "Disclosure by Design: Designing information disclosures to support meaningful transparency and accountability"}, {"paperId": "f61687a85c11d6e7b91176e351b5a29d368910f1", "title": "Making Algorithmic Systems More Meaningfully Transparent for Users Through Visualisation"}, {"paperId": "abe6e5eecc2bde059e508153e6e66d975b5d5834", "title": "IoTracker: A probabilistic event tracking approach for data-intensive IoT Smart Applications"}, {"paperId": "e9ad1a5566c50a6fba4caecbcfa4e4f2574f31c1", "title": "From transparency to accountability of intelligent systems: Moving beyond aspirations"}, {"paperId": "af22279a5ffa7bb63a889061e90bdc9ef827c144", "title": "Auditable Augmented/Mixed/Virtual Reality"}, {"paperId": "3b9d70cb21e2d1e215e90661ffa9aa3435d061b4", "title": "Workshop on Reviewable and Auditable Pervasive Systems (WRAPS)"}, {"paperId": "1b94ddf67a6e0bef90ef83fad8301a3d71c41096", "title": "Reviewable Automated Decision-Making: A Framework for Accountable Algorithmic Systems"}, {"paperId": "11295fce38b33d4dce81a0733c3fc64c0ec3c233", "title": "A Call for Auditable Virtual, Augmented and Mixed Reality"}]}
