{"paperId": "0210ef93b9095b1113fecd8966c0ac25149b18e0", "publicationVenue": {"id": "7f99aef4-3884-410c-87f7-ddfb686835e9", "name": "International Workshop on Intelligent Networking and Collaborative Systems", "type": "conference", "alternate_names": ["INCoS", "Int Workshop Intell Netw Collab Syst", "Intell Netw Collab Syst", "Intelligent Networking and Collaborative Systems"], "url": "http://www.wikicfp.com/cfp/program?id=1600"}, "title": "Locality-Aware and Energy-Aware Job Pre-Assignment for Mapreduce", "abstract": "Cloud Map-Reduce (CMR) is an advantage Map-Reduce platform and has been aroused more and more attention. To further balance the performance of job secluding among job cost, execution time and energy consumption, a locality-aware and energy-aware job pre-assignment algorithm is proposed for Map-Reduce of CMR in this paper. Firstly, the importance of rack in data locality and energy saving is analyzed. Secondly, a capacity pre-judged method is developed to measure the idea capacity of one rack for different jobs where the energy-efficient is defined to measure the balance statues of rack usage among job cost, execution time and energy consumption in job scheduling. Finally, based on the pre-judged idea capacity of racks, job pre-assignment method is proposed to centrally assign one job to virtual machines of several booked racks for saving energy and reducing communication. By comparing with other three algorithms, the extensive experimental results show our algorithm has good performance on job execution time, cross rack traffic, and energy consumption.", "venue": "International Workshop on Intelligent Networking and Collaborative Systems", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-09-01", "journal": {"name": "2016 International Conference on Intelligent Networking and Collaborative Systems (INCoS)", "pages": "59-65"}, "authors": [{"authorId": "2146071882", "name": "Lei Chen"}, {"authorId": "2155700486", "name": "Jing Zhang"}, {"authorId": "48748018", "name": "Lijun Cai"}, {"authorId": "7458141", "name": "Ziyun Deng"}, {"authorId": "40075358", "name": "Tinqing He"}, {"authorId": "2108598766", "name": "Xu An Wang"}], "citations": [{"paperId": "f7959c2c6ae5212663b2f513a6bc9db516cd75a8", "title": "Energy- and locality-efficient multi-job scheduling based on MapReduce for heterogeneous datacenter"}, {"paperId": "95f7fb508d4592d64734148594af21acdfffa282", "title": "A learning-based mapreduce scheduler in heterogeneous environments"}, {"paperId": "52aaf62768a3894423cbe7dc26abfa8e947e99b9", "title": "Incremental-Parallel Data Stream Classification in Apache Spark Environment"}]}
