{"paperId": "0211cc161df93e10849099897d15d0b378d92387", "publicationVenue": {"id": "d525c049-640c-4bc2-a8d8-b16cc9be71b1", "name": "International Journal of Logistics Management", "type": "journal", "alternate_names": ["The International Journal of Logistics Management", "Int J Logist Manag"], "issn": "0957-4093", "url": "https://www.emerald.com/insight/publication/issn/0957-4093", "alternate_urls": ["https://www.logisticssupplychain.org/"]}, "title": "HumOSCM for pandemic response", "abstract": "Purpose Humanitarian organizations have faced the unprecedented consequences of the coronavirus disease 2019 (COVID-19) pandemic. In this article, the authors therefore discuss how epidemics and pandemics, specifically Ebola and COVID-19, have affected humanitarian operations and supply chain management (HumOSCM), and how HumOSCM has contributed to preparedness for and response to epidemics and pandemics. The authors present lessons learned from responses to Ebola and COVID-19.Design/methodology/approach For this study, the authors review the scholarly HumOSCM literature, use documentary evidence from practitioner literature and apply a theory synthesis approach to derive recommendations on how HumOSCM could strengthen future responses to epidemics and pandemics.Findings The conceptualizations highlight the importance of strengthening collaboration, capability and capacity for the response to epidemics and pandemics. Furthermore, the components that can enhance the degree of collaboration, and hence, response formation, are discussed.Research limitations/implications As a non-empirical article, it suffers from the limitations of conceptual research. Hence, empirical testing of the proposed framework is recommended. The framework and propositions can serve as a basis for future studies.Practical implications The conceptual framework can help humanitarian organizations and other actors in the humanitarian sector to better understand how to prepare for future responses to epidemics and pandemics, in particular by considering the components that enhance the degree of collaboration, as well as through capability development and capacity building.Originality/value This article begins a discussion of how HumOSCM should evolve to better respond to future epidemics and pandemics.", "venue": "International Journal of Logistics Management", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-04-25", "journal": {"name": "The International Journal of Logistics Management"}, "authors": [{"authorId": "34938070", "name": "Stephan M. Wagner"}, {"authorId": "98415886", "name": "Tunca Tabaklar"}, {"authorId": "120845871", "name": "Lysann Seifert"}], "citations": [{"paperId": "ddf68c1bf8dc81b4494ea70adbf238dcb2bf9055", "title": "Supporting disaster relief operations through RFID: enabling visibility and coordination"}, {"paperId": "3d93803c4ff7fcb287ae8cbfd8a42d6068d5ebdf", "title": "A cross-sectional study of the psychological impact of the COVID-19 pandemic on camped refugees in Ghana"}, {"paperId": "0c1ff6db18d26f369332e8252b2a3c2e8a487db9", "title": "Guest editorial: Bridging the research-practice gaps in supply chain management: lessons from COVID-19"}]}
