{"paperId": "0212490e89a24f98807f753fdd32c326ba3dee6b", "publicationVenue": null, "title": "A Reliable Approach to Secure IoT Systems Using Cryptosystems Based on SoC FPGA Platforms", "abstract": "The use of cryptography algorithms based on hardware to protect the security and privacy of the loT systems is in huge demand. However, hardware-based security systems are similar to software-based in that they can be attacked by a type of malicious code called malware. In this article, we used the self-applied cryptography algorithm on the hardware-based to protect the data security of loT systems, and that gives the trustee than using software-based of hardware-based inform of ASIC chip. Detailly, we have developed an SoC FPGA system including main factors are a built-in ARM processor core, a self-implemented IP core acting as 128-bit AES co-processors, and SDRAM memory. Furthermore, this system has been placed on the DE10-Standard board and ran with an application in Linux operations. Besides, we have applied the DMA technique to obtain high-speed data transfer. As a result, our cryptosystem is compact and can achieve high performance with low frequencies. Details, the DMA Controller and 128-bit AES IP core operate at a frequency of 150 MHz, and they can reach the speed of 1200 Mbps and above 700 Mbps, respectively.", "venue": "2021 International Symposium on Electrical and Electronics Engineering (ISEE)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-04-15", "journal": {"name": "2021 International Symposium on Electrical and Electronics Engineering (ISEE)", "pages": "53-58"}, "authors": [{"authorId": "1410291328", "name": "Tuan-Kiet Tran"}, {"authorId": "1959326652", "name": "Tan-Phat Dang"}, {"authorId": "7677915", "name": "Trong-Tu Bui"}, {"authorId": "1752231", "name": "Huu-Thuan Huynh"}], "citations": [{"paperId": "6a22a87aa8cd4ac40e538aa054bf5cec4e102de9", "title": "Small-Footprint Reconfigurable Heterogeneous Cryptographic Accelerator for Fog Computing"}, {"paperId": "149d0be4709307e891fe1b6a1d8ea82ee56bfcfb", "title": "A Review on Security Implementations in Soft-Processors for IoT Applications"}, {"paperId": "d9ad1cb49b68b6e0c34b3c30ba1543cfa0b9b32a", "title": "Efficient and High-Speed CGRA Accelerator for Cryptographic Applications"}]}
