{"paperId": "0218ec72e7104d7f9560035fc114346a228e1b3e", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Implementation and Design of a Zero-Day Intrusion Detection and Response System for Responding to Network Security Blind Spots", "abstract": "We propose a zero-day intrusion detection and response system (ZDRS) for responding to network security blind spots. An existing detection and response system for the analysis of zero-day attacks uses a full-packet storage method; thus, the longer the time required to recognize a zero-day attack, the higher is the packet storage capacity and inspection cost. To solve the storage capacity and inspection cost problems, we design an architecture for ZDRS for a retroactive security check (RSC) using a first-N packet storage method. For fast verification of the RSC result, we propose a drill-down session metadata searching algorithm using session and flow metadata. The ZDRS comprises a network processing unit and a security processing unit. The ZDRS network processing unit generates metadata for the RSC verification and efficiently stores packets using the first-N packet storage method. The ZDRS security processing unit performs the RSC and RSC verification using the drill-down session metadata searching algorithm. For ZDRS performance analysis, we implemented ZDRS and analyzed the storage efficiency, detection efficiency, and detection speed of ZDRS at the campus level. As a performance analysis result of implementation, the amount of data storage decreased from 3.4 terabyte to 62 gigabyte compared to the full-packet storage method by 1.82%, and storage efficiency increased by 54.84 times. Furthermore, the detection rate of 99.55% based on the first 5-kilobyte size compared to the full-packet storage method was confirmed.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-08", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "47559935", "name": "W. Choi"}, {"authorId": "2108338911", "name": "S. Lee"}, {"authorId": "2155629749", "name": "S. Choi"}], "citations": [{"paperId": "5f4a4fc0552ffd0b16ceadb4cda3e30b2a7b865d", "title": "Moving Target Defense for the cloud/edge Telco environments"}, {"paperId": "37536a1a74df90a93810133151a0acd34d0f2fc9", "title": "CESSO-HCRNN: A Hybrid CRNN With Chaotic Enriched SSO-based Improved Information Gain to Detect Zero-Day Attacks"}, {"paperId": "a8159e47242726e0a3bfda1fe7043bfe7f72d87a", "title": "A Novel Threat Intelligence Detection Model Using Neural Networks"}]}
