{"paperId": "021b3823ec5b48f244ce2aaf83e1e2395f89b31c", "publicationVenue": null, "title": "Estimation of Velocities in Ice Hockey Collisions", "abstract": "Concussions occur frequently as a result of tackles in ice hockey. Analysis of video material may provide an understanding of the relationship between the kinematics of collisions and the risk for injury. In this thesis, two video analysis methods were used to estimate the impact velocities of 22 ice hockey tackles that resulted in concussions. The Point tracking method uses tracking of user-defined object points on the players and ice to estimate the velocities. It was used in an earlier thesis. A deep learning-based method was implemented in this thesis. It uses a pre-trained deep learning model to detect the players in each frame of the video. Both methods were validated in this thesis using soccer videos containing accelerometer data from the players. The mean error was 25.6 % for the Point tracking method and 43.1 % for the Deep learning method. The difference was not significant. Both methods calculate the player velocity as a mean from a given number of video frames before impact. The choice of the number of frames did not significantly affect the difference in estimated velocities between the Point tracking method and the Deep learning method. The Point tracking method succeeded in estimating velocities in 17 cases. The mean velocities for the attacking and injured players were 10.5 m/s and 9.3 m/s, respectively. The Deep learning method succeeded in 9 cases, and the mean velocities were 9.7 m/s and 9.5 m/s. The velocities are higher than what has been found in earlier research, suggesting that both methods may be biased towards estimating too high velocities. More investigation needs to be done to evaluate the methods’ performance, possibly by comparing with accelerometer data from ice hockey.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2277220488", "name": "N. Mounaelborgimårtennorma"}, {"authorId": "2277219648", "name": "Tobias Nyberg"}, {"authorId": "2277221969", "name": "Mattias Mårtensson Examinator"}, {"authorId": "2277220038", "name": "Mats Nilsson"}], "citations": []}
