{"paperId": "022313ed6690f020cd117f27782e1977d264d578", "publicationVenue": {"id": "05479075-64ee-4b95-b9a7-023afff1b556", "name": "Minerals", "type": "journal", "issn": "2075-163X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225448", "alternate_urls": ["https://www.mdpi.com/2075-163X/7/7/121", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225448", "https://www.mdpi.com/journal/minerals"]}, "title": "Identification of Radioactive Mineralized Lithology and Mineral Prospectivity Mapping Based on Remote Sensing in High-Latitude Regions: A Case Study on the Narsaq Region of Greenland", "abstract": "The harsh environment of high-latitude areas with large amounts of snow and ice cover makes it difficult to carry out full geological field surveys. Uranium resources are abundant within the Ilimaussaq Complex in the Narsaq region of Greenland, where the uranium ore body is strictly controlled by the Lujavrite formation, which is the main ore-bearing rock in the complex rock mass. Further, large aggregations of radioactive minerals appear as thermal anomalies on remote sensing thermal infrared imagery, which is indicative of deposits of highly radioactive elements. Using a weight-of-evidence analysis method that combines machine-learned lithological classification information with information on surface temperature thermal anomalies, the prediction of radioactive element-bearing deposits at high latitudes was carried out. Through the use of Worldview-2 (WV-2) remote sensing images, support vector machine algorithms based on texture features and topographic features were used to identify Lujavrite. In addition, the distribution of thermal anomalies associated with radioactive elements was inverted using Landsat 8 TIRS thermal infrared data. From the results, it was found that the overall accuracy of the SVM algorithm-based lithology mapping was 89.57%. The surface temperature thermal anomaly had a Spearman correlation coefficient of 0.63 with the total airborne measured uranium gamma radiation. The lithological classification information was integrated with surface temperature thermal anomalies and other multi-source remote sensing mineralization elements to calculate mineralization-favorable areas through a weight-of-evidence model, with high-value mineralization probability areas being spatially consistent with known mineralization areas. In conclusion, a multifaceted remote sensing information finding method, focusing on surface temperature thermal anomalies in high-latitude areas, provides guidance and has reference value for the exploration of potential mineralization areas for deposits containing radioactive elements.", "venue": "Minerals", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-05-30", "journal": {"name": "Minerals"}, "authors": [{"authorId": "2109336368", "name": "Li He"}, {"authorId": "2146121221", "name": "Pengyi Lyu"}, {"authorId": "144001359", "name": "Zhengwei He"}, {"authorId": "49640004", "name": "Jia-yun Zhou"}, {"authorId": "2167423182", "name": "Bo Hui"}, {"authorId": "2167527179", "name": "Yakang Ye"}, {"authorId": "2216923477", "name": "Huilin Hu"}, {"authorId": "2167887581", "name": "Yanxi Zeng"}, {"authorId": "2167462166", "name": "Li Xu"}], "citations": [{"paperId": "ef47a8813eeb1880b7c71842940f64d38e0334ef", "title": "Application of a Multifractal Model for Identification of Lithology and Hydrothermal Alteration in the Dasuji Porphyry Mo Deposit in Inner Mongolia, China"}, {"paperId": "8317d2cd92670f50a729d33286e73f1ee37183d2", "title": "Editorial for the Special Issue: “Multispectral Remote Sensing Satellite Data for Mineral and Hydrocarbon Exploration: Big Data Processing and Deep Fusion Learning Techniques”"}, {"paperId": "4345e3e83305164b56a46e4c65fb105f5d0e74d6", "title": "Effective delineation of rare metal-bearing granites from remote sensing data using machine learning methods: A case study from the Umm Naggat Area, Central Eastern Desert, Egypt"}, {"paperId": "de8f4c8f96f51744cbb88c039e04dbdbf4b37aa2", "title": "Lithology classification in semi-arid areas based on vegetation suppression integrating microwave and optical remote sensing images: Duolun county, Inner Mongolia autonomous region, China"}]}
