{"paperId": "0226085221997bc69f94d7394b7e3bbe88a03c5d", "publicationVenue": null, "title": "ArticleUse of Food Services by Consumers in the SARS-CoV-", "abstract": "The SARS-CoV-2 pandemic in 2020–2021 changed the eating habits of people around the world. The aim of this study is to understand the effects of COVID-19 on changing consumers’ eating habits, including their concerns about food service nutrition in case of new disease risk factors. The survey conducted using the computer-assisted web-based interviewing method on a group of 1021 adult respondents in Poland. We collected information about consumer choices and habits related to use of food services during the pandemic. This research found that COVID-19 had an impact on consumers’ use of food services, both on-site and take-away. Using cluster analysis, we identified five main groups of food service consumers. It was found that almost half of the respondent group did not change their diet during the pandemic, 20% of respondents changed their diet to a positive one, and 20% to a diet that was negative. For respondents the most important forms of protection against COVID-19 in catering establishments were hand disinfection (70.3%), table disinfection (70.4%), wearing of masks and visors by staff (68.2%), and the possibility of cashless payments (64.6%). Based on cluster analysis (eight consumer clusters), we stated that majority of respondents did not see any threats to using catering service during the pandemic. Only a small group (8.1%) of respondents were afraid of the possibility of getting sick with COVID-19. This study presented the effects of COVID-19 on consumer eating behavior in catering and their concerns with food services uses. Discovering consumer concerns can reduce risk, increase food safety and improve eating habits.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2069188022", "name": "E. Czarniecka-Skubina"}, {"authorId": "92094676", "name": "Marlena Pielak"}, {"authorId": "2169669768", "name": "Piotr Sa"}, {"authorId": "1401972728", "name": "J. Kobus‐Cisowska"}, {"authorId": "46380662", "name": "T. Owczarek"}], "citations": []}
