{"paperId": "022c6df13a30203710f2514b51ac6df074515e63", "publicationVenue": null, "title": "Large Spatial Database Indexing with aX-tree", "abstract": "Spatial databases are optimized for the management of data stored based on their geometric space. Researchers through high degree scalability have proposed several spatial indexing structures towards this effect. Among these indexing structures is the X-tree. The existing X-trees and its variants are designed for dynamic environment, with the capability for handling insertions and deletions. Notwithstanding, the X-tree degrades on retrieval performance as dimensionality increases and brings about poor worst-case performance than sequential scan. We propose a new X-tree packing techniques for static spatial databases which performs better in space utilization through cautious packing. This new improved structure yields two basic advantage: It reduces the space overhead of the index and produces a better response time, because the aX-tree has a higher fan-out and so the tree always ends up shorter. New model for super-node construction and effective method for optimal packing using an improved str bulk-loading technique is proposed. The study reveals that proposed system performs better than many existing spatial indexing structures", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-03-25", "journal": {"name": "", "pages": "759-773", "volume": "3"}, "authors": [{"authorId": "1954750", "name": "Grace L. Samson"}, {"authorId": "67155681", "name": "L. Joan"}, {"authorId": "72857849", "name": "Mistura M. Usman"}, {"authorId": "2470640", "name": "Aminat A. Showole"}, {"authorId": "115196734", "name": "Hadeel Jazzaa Hadeel"}], "citations": [{"paperId": "dfe2b33bbdcc2d35865e7ee2442712f02d6e7a3f", "title": "Tree Data Structures and Efficient Indexing Techniques for Big Data Management: A Comprehensive Study"}, {"paperId": "265f78f2682e8cff424ee98d0b24579cb5918811", "title": "A Survey on Big IoT Data Indexing: Potential Solutions, Recent Advancements, and Open Issues"}, {"paperId": "207362ced66b187f49f605a60b6a9f889aa8aba7", "title": "PKT: fast color-based spatial model for human skin detection"}, {"paperId": "89f1c298b54d2a14d28ef9b6b7fea4de7f2a5da9", "title": "HD-Tree: An Efficient High-Dimensional Virtual Index Structure Using a Half Decomposition Strategy"}]}
