{"paperId": "023fbffad88fd923d33c1e3ac33262b396123065", "publicationVenue": null, "title": "A Step Toward Deep Online Aggregation", "abstract": "For exploratory data analysis, it is often desirable to know what answers you are likely to get before actually obtaining those answers. This can potentially be achieved by designing systems to offer the estimates of a data operation result-say op(data)-earlier in the process based on partial data processing. Those estimates continuously refine as more data is processed and finally converge to the exact answer. Unfortunately, the existing techniques-called Online Aggregation (OLA)-are limited to a single operation; that is, we cannot obtain the estimates for op(op(data)) or op(...(op(data))). If this Deep OLA becomes possible, data analysts will be able to explore data more interactively using complex cascade operations. In this work, we take a step toward Deep OLA with evolving data frames (edf), a novel data model to offer OLA for nested ops-op(...(op(data)))-by representing an evolving structured data (with converging estimates) that is closed under set operations. That is, op(edf) produces yet another edf; thus, we can freely apply successive operations to edf and obtain an OLA output for each op. We evaluate its viability with Wake, an edf-based OLA system, by examining against state-of-the-art OLA and non-OLA systems. In our experiments on TPC-H dataset, Wake produces its first estimates 4.93× faster (median)-with 1.3× median slowdown for exact answers-compared to conventional systems. Besides its generality, Wake is also 1.92× faster (median) than existing OLA systems in producing estimates of under 1% relative errors.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-07", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 28", "volume": "1"}, "authors": [{"authorId": "50829092", "name": "Nikhil Sheoran"}, {"authorId": "41022386", "name": "Supawit Chockchowwat"}, {"authorId": "2210859970", "name": "Arav Chheda"}, {"authorId": "2210939345", "name": "Suwen Wang"}, {"authorId": "2106420583", "name": "Riya Verma"}, {"authorId": "40155297", "name": "Yongjoo Park"}], "citations": [{"paperId": "35383850bc203178b43e6e0b43b57197488db506", "title": "Transactional Python for Durable Machine Learning: Vision, Challenges, and Feasibility"}, {"paperId": "d2c2f9f33d433cc77a9b753f44cc51fa459e3521", "title": "S/C: Speeding up Data Materialization with Bounded Memory"}]}
