{"paperId": "02426593807eace0c4dc173093f55f8cfe78946d", "publicationVenue": {"id": "640b2c9a-6fb2-4333-8780-d31aa3c411cf", "name": "International Database Engineering and Applications Symposium", "type": "conference", "alternate_names": ["Int Database Eng Appl Symp", "Ideas", "IDEAS"], "issn": "2338-4778", "alternate_issns": ["1860-6873", "2451-6910"], "url": "http://www.wikicfp.com/cfp/program?id=1525", "alternate_urls": ["https://www.ideas-heilbronn.org/", "http://revistaideas.com.ar/", "https://dialnet.unirioja.es/servlet/revista?codigo=7972", "http://ejournal.iainpalopo.ac.id/index.php/ideas", "http://revistaideas.com.ar/descargas/"]}, "title": "A fast solution for bi-objective traffic minimization in geo-distributed data flows", "abstract": "Geo-distributed analytics is becoming an increasingly common-place as IoT, fog computing and big data processing platforms are nowadays integrating with each other. In this work, we deal with a problem encountered when complex Spark workflows run on top of geographically dispersed nodes, either data centers or individual machines. There have been proposals that optimize the execution of such workflows in terms of the aggregate traffic generated or the latency (which is due to data transmission), or both metrics. However, the state-of-the-art solutions that target both objectives are either significantly sub-optimal or suffer from high optimization overhead. In this work, we address this limitation. The main solutions that we propose are both efficient and effective; based on either the extremal optimization or the greedy algorithm design paradigm, they can yield significant improvements having an optimization overhead of a few tens of seconds even for Spark workflows of 15 stages running on 15 distributed nodes. We also show the inadequacy of evolutionary optimization solutions, such as genetic algorithms, for our problem.", "venue": "International Database Engineering and Applications Symposium", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-06-10", "journal": {"name": "Proceedings of the 23rd International Database Applications & Engineering Symposium"}, "authors": [{"authorId": "40473987", "name": "A. Michailidou"}, {"authorId": "1698942", "name": "A. Gounaris"}], "citations": [{"paperId": "14497438a3d507abbd9fdd116ba249249b1e29a2", "title": "Fault-tolerant scheduling and data placement for scientific workflow processing in geo-distributed clouds"}, {"paperId": "23e9a41a1319217c6609c77ae636ce67dfdf89af", "title": "Multi-objective optimization of data deployment and scheduling based on the minimum cost in geo-distributed cloud"}, {"paperId": "6eb0f9395a53f460756fff01bc7a4934b40f33e1", "title": "EQUALITY: Quality-aware intensive analytics on the edge"}, {"paperId": "8ba3eafb4c693cc8f01d2c54af2c0bf2cfd442ec", "title": "Optimal data placement strategy considering capacity limitation and load balancing in geographically distributed cloud"}, {"paperId": "813785fee2e0d233f9d4adcaa763d5de9e31a1af", "title": "Quality attributes in edge computing for the Internet of Things: A systematic mapping study"}]}
