{"paperId": "0246b4cc0ed9c72fab40bab9579788f17c9d1486", "publicationVenue": {"id": "1db0d9d0-bfea-4211-bae9-989d5c48fc17", "name": "JURNAL MEDIA INFORMATIKA BUDIDARMA", "type": "journal", "alternate_names": ["J MEDIA INFORM BUDIDARMA"], "issn": "2548-8368", "url": "http://ejurnal.stmik-budidarma.ac.id/index.php/mib"}, "title": "Model Pengetahuan Berbasis Ontologi pada Domain Big Data di Perguruan Tinggi", "abstract": "The big data phenomenon is also having an impact on the higher education sector. The readiness of education sector is non-negotiable for the face of the big data era so that organizations are able to adapt. Thus, knowledge to utilize big data needs to be owned by higher education institutions in order to innovate. Basically, there are quite a lot of studies that produce models as knowledge to take advantage of big data. However, reviewing the research that has been done previously, it is also necessary to conduct research that discusses the development of models to represent knowledge about big data analytics in higher education institutions. Knowledge that has been represented as a knowledge model can then be interpreted and stored as a knowledge base in a knowledge management system so that knowledge can be managed and utilized better. Based on these problems, ontology can be used to model knowledge. This research will develop an ontology-based knowledge model related to the use of big data in the education sector, especially higher education based on the concepts of analytics, data sources, and platforms. The ontology modeling process in this study is divided into 3 (three) phases: 1) Conceptualization; 2) Implementation; and 3) Evaluation. Based on the evaluation results of ontology measurements using schema metrics, the RR (Relationship Richness) value is 0.62, meaning that the ontology model contains a variety of information; the IR (Inheritance Richness) value is 1.78, meaning that the ontology model belongs to a fairly specific category, and the AR (Attribute Richness) value is 0.06, meaning that the information contained can be improved further. Based on the results of the query test analysis, the ontology is considered capable of retrieving the knowledge stored in it accurately based on validation that adjusts the query results with the ontology.", "venue": "JURNAL MEDIA INFORMATIKA BUDIDARMA", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-25", "journal": {"name": "JURNAL MEDIA INFORMATIKA BUDIDARMA"}, "authors": [{"authorId": "2167167874", "name": "Yunizar Fahmi"}, {"authorId": "2081811351", "name": "Dhomas Hatta Fudholi"}], "citations": [{"paperId": "cf5bea1b463bbbe062c5c6a77e863b052679d84b", "title": "Ontology-Based Food Recommender System for Nutrition in School-Age"}]}
