{"paperId": "0260b1f15b94aeed43328fbe496f9518d05e4f44", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "A Fast Multiscale Clustering Approach Based on DBSCAN", "abstract": "Multiscale brings great benefits for people to observe objects or problems from different perspectives. It has practical significance for clustering on multiscale data. At present, there is a lack of research on the clustering of large-scale data under the premise that clustering results of small-scale datasets have been obtained. If one does cluster on large-scale datasets by using traditional methods, two disadvantages are as follows: (1) Clustering results of small-scale datasets are not utilized. (2) Traditional method will cause more running overhead. Aims at these shortcomings, this paper proposes a multiscale clustering framework based on DBSCAN. This framework uses DBSCAN for clustering small-scale datasets, then introduces algorithm Scaling-Up Cluster Centers (SUCC) generating cluster centers of large-scale datasets by merging clustering results of small-scale datasets, not mining raw large-scale datasets. We show experimentally that, compared to traditional algorithm DBACAN and leading algorithms DBSCAN++ and HDBSCAN, SUCC can provide not only competitive performance but reduce computational cost. In addition, under the guidance of experts, the performance of SUCC is more competitive in accuracy.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-28", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "4071177:1-4071177:11", "volume": "2021"}, "authors": [{"authorId": "1740556044", "name": "Runzi Chen"}, {"authorId": "1471905594", "name": "Shuliang Zhao"}, {"authorId": "67152508", "name": "Meishe Liang"}], "citations": [{"paperId": "b21112c616ffe71b41de98e3cde352baa00a5e83", "title": "Identification of The Survey Points from Network RTK Trajectory with Improved DBSCAN Clustering, Case Study on HNCORS"}, {"paperId": "9d15fd7e413d7ea692d971e4b47cbc476d9f2a8a", "title": "Multi-Scale Massive Points Fast Clustering Based on Hierarchical Density Spanning Tree"}, {"paperId": "a3eacf8d74a74f081c7dafe4e2155aeab82ffd69", "title": "Enhanced Mean Load Based Clustering Technique On Dented Image Segments In Reconstruction Of Buildings"}, {"paperId": "19e803fcde0c25ca06e64c639053c9486e42bc44", "title": "Two-step clustering-based pipeline for big dynamic functional network connectivity data"}, {"paperId": "c18c8664b154ae698fb4ae442b5a796f37c149c2", "title": "A Multiscale Clustering Approach for Non-IID Nominal Data"}]}
