{"paperId": "0261414ddc12cdd67e313efe38a17de2e2eb1693", "publicationVenue": null, "title": "Big Data Security Challenges and Solution of Distributed Computing in Hadoop Environment: A Security Framework", "abstract": "\n\n In current scenario of internet, large amounts of data are generated and\nprocessed. Hadoop framework is widely used to store and process big data in a highly distributed\nmanner. It is argued that Hadoop Framework is not mature enough to deal with the current cyberattacks\non the data.\n\n\n\nThe main objective of the proposed work is to provide a complete security approach\ncomprising of authorisation and authentication for the user and the Hadoop cluster nodes and to secure\nthe data at rest as well as in transit.\n\n\n\nThe proposed algorithm uses Kerberos network authentication protocol for authorisation\nand authentication and to validate the users and the cluster nodes. The Ciphertext-Policy Attribute-\nBased Encryption (CP-ABE) is used for data at rest and data in transit. User encrypts the file with\ntheir own set of attributes and stores on Hadoop Distributed File System. Only intended users can\ndecrypt that file with matching parameters.\n\n\n\nThe proposed algorithm was implemented with data sets of different sizes. The data was\nprocessed with and without encryption. The results show little difference in processing time. The\nperformance was affected in range of 0.8% to 3.1%, which includes impact of other factors also,\nlike system configuration, the number of parallel jobs running and virtual environment.\n\n\n\nThe solutions available for handling the big data security problems faced in Hadoop\nframework are inefficient or incomplete. A complete security framework is proposed for Hadoop\nEnvironment. The solution is experimentally proven to have little effect on the performance of the\nsystem for datasets of different sizes.\n", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-19", "journal": {"name": "", "pages": "791-797", "volume": "13"}, "authors": [{"authorId": "72603467", "name": "G. Bhathal"}, {"authorId": "37040274", "name": "A. Dhiman"}], "citations": []}
