{"paperId": "026546f94aaefae788f33cff0390c1f0eeac6d19", "publicationVenue": {"id": "b1994124-f1e8-4f96-a165-b6f19a04fe7e", "name": "Applied Soft Computing", "type": "journal", "alternate_names": ["Appl Soft Comput"], "issn": "1568-4946", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/621920/description#description", "alternate_urls": ["https://www.journals.elsevier.com/applied-soft-computing", "http://www.sciencedirect.com/science/journal/15684946"]}, "title": "A Surrogate-Assisted Highly Cooperative Coevolutionary Algorithm for Hyperparameter Optimization in Deep Convolutional Neural Network", "abstract": "Convolutional neural networks (CNNs) have gained remarkable success in recent years. However, their performance highly relies on the architecture hyperparameters, and finding proper hyperparameters for a deep CNN is a challenging optimization problem owing to its high-dimensional and computationally expensive characteristics. Given these difficulties, this study proposes a surrogate-assisted highly cooperative hyperparameter optimization (SHCHO) algorithm for chain-styled CNNs. To narrow the large search space, SHCHO first decomposes the whole CNN into several overlapping sub-CNNs in accordance with the overlapping hyperparameter interaction structure and then cooperatively optimizes these hyperparameter subsets. Two cooperation mechanisms are designed during this process. One coordinates all the sub-CNNs to reproduce the information flow in the whole CNN and achieve macro cooperation among them, and the other tackles the overlapping components by simultaneously considering the involved two sub-CNNs and facilitates micro cooperation between them. As a result, a proper hyperparameter configuration can be effectively located for the whole CNN. Besides, SHCHO also employs the well-performing surrogate technique to assist in the hyperparameter optimization of each sub-CNN, thereby greatly reducing the expensive computational cost. Extensive experimental results on two widely-used image classification datasets indicate that SHCHO can significantly improve the performance of CNNs.", "venue": "Applied Soft Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-25", "journal": {"name": "ArXiv", "volume": "abs/2302.12963"}, "authors": [{"authorId": "144736192", "name": "An Chen"}, {"authorId": "2113995725", "name": "Zhigang Ren"}, {"authorId": "29319364", "name": "Muyi Wang"}, {"authorId": "2155550208", "name": "Hui Chen"}, {"authorId": "2205399970", "name": "Haoxi Leng"}, {"authorId": null, "name": "Shuai Liu"}], "citations": [{"paperId": "6214a54dc9dcdc14ae70078d3c0f0bda2b3c8357", "title": "Evolutionary deep learning for computer vision and image processing"}]}
