{"paperId": "0273f94513e74f1e30b35b7ec8741d04f10006ef", "publicationVenue": {"id": "cce4d150-8211-4378-a9ef-a234ec19414c", "name": "ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing", "type": "conference", "alternate_names": ["PODC", "Princ Distrib Comput", "Principles of Distributed Computing", "ACM SIGACT-SIGOPS Symp Princ Distrib Comput"], "url": "http://www.podc.org/"}, "title": "Brief Announcement: A Randomness-efficient Massively Parallel Algorithm for Connectivity", "abstract": "We give a randomness-efficient Massively Parallel Computation (MPC) algorithm for deciding whether an undirected graph is connected. For Connectivity on n-vertex, m-edge graphs whose components have diameter at most D = 2o(log n/ log log n), our algorithm runs in R = O(log D + log logm/n,.n) rounds and uses a total of (log n)O(R) random bits, O(m) machines, and n1-Ω(1) space per machine with good probability.1 With good probability means with probability at least 1 - 1/poly ((m log n)/n), which is the same as in Liu, Tarjan, and Zhong (SPAA '20). Our algorithm achieves a super-polynomial saving in randomness complexity as compared to the breakthrough algorithm of Andoni et al. (FOCS '18) and the subsequent improvement by Behnezhad et al. (FOCS '19). Our algorithm has the same round complexity as that of Behnezhad et al., but uses more total space. Our Connectivity algorithm is an instantiation of a general method we develop for converting randomized algorithms in the PRAM model to highly randomness-efficient MPC algorithms. We show that for k = o(log n/log log n) and p = nO(1), any time-k p-processor randomized PRAM algorithm computing a function on n input bits can be converted to an equivalent strongly sublinear MPC algorithm with O(k) rounds and only a total of (log n)O(k) random bits. Our Connectivity algorithm follows from applying this method to the recent CRCW PRAM algorithm of Liu, Tarjan, and Zhong (SPAA '20). Our approach is based on the design of a pseudorandom generator for PRAM algorithms. The analysis of our generator is built on classic and influential results in circuit complexity (Hå stad '86; Nisan and Wigderson '88), which we generalize from the setting of small-depth circuits to the more powerful setting of PRAM algorithms. The parameters that we achieve are optimal given the current state of the art in complexity theory, in the sense that further improvements will imply ≠ NC1.", "venue": "ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-07-21", "journal": {"name": "Proceedings of the 2021 ACM Symposium on Principles of Distributed Computing"}, "authors": [{"authorId": "1745732", "name": "M. Charikar"}, {"authorId": "2859161", "name": "Weiyun Ma"}, {"authorId": "145175555", "name": "Li-Yang Tan"}], "citations": [{"paperId": "7017419ac2e12777476992e35cbe862eb2621288", "title": "Improved Deterministic Connectivity in Massively Parallel Computation"}, {"paperId": "257c68a981b195e59594f10c6210a4318e9499cc", "title": "Deterministic massively parallel connectivity"}]}
