{"paperId": "027d46e867d4429ff32c5b4eaa864b9f63443ccc", "publicationVenue": null, "title": "Classification of Alzheimer Disease using Machine Learning Algorithm", "abstract": "Alzheimer’s disease (AD) is a neurological brain state that impairs older people’s memory and cognitive function. The primary factor behind memory loss and cognitive decline is the death of neurons, which results in structural alterations in the brain. Imaging techniques like Positron Emission Tomography (PET) and Magnetic Resonance Imaging (MRI) etc. can be used to assess these structural alterations, which are most noticeable in the hippocampus, cortex, and grey matter. These neuroimaging methods provide the highest spatial resolution and the best soft tissue contrast, both of which are critical for the diagnosis of AD. Researchers are at present focusing on anticipate the progression of Mild Cognitive Impairment to AD. This study suggests classifying AD using the application of machine learning approach. MRI images are gathered from a public database during the first stage. Preprocessing steps like contrast enhancement using CLAHE are included in the next stage. The GLCM approach is utilized to take the images provided and extract their features. The acquired features are delivered into the categorization stage following feature extraction. To recognize Alzheimer’s disease, SVM+ KNN+ Decision Tree Techniques are employed in this study to accurately classify Alzheimer’s disease. The suggested work shows better results, with the best validation average accuracy of 95% on the AD test data. The accuracy score of this test is significantly higher than that of earlier research.", "venue": "2024 International Conference on Automation and Computation (AUTOCOM)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2024-03-14", "journal": {"name": "2024 International Conference on Automation and Computation (AUTOCOM)", "pages": "215-221"}, "authors": [{"authorId": "2294755163", "name": "M. V. Dasu"}, {"authorId": "2294753829", "name": "C. Priyanka"}, {"authorId": "2160733018", "name": "G. Tejaswini"}, {"authorId": "2294756756", "name": "J.Venkata Ramana"}, {"authorId": "2294758874", "name": "D. Suleman"}, {"authorId": "2286345973", "name": "Shanmukha Sai"}], "citations": []}
