{"paperId": "02838f3cd9c7bbb679968ba593699f920ef2f4fc", "publicationVenue": {"id": "78e24c5d-0127-4fbd-b131-bc9352eb4aae", "name": "Australasian Database Conference", "type": "conference", "alternate_names": ["ADC", "Australas Database Conf"], "url": "http://www.wikicfp.com/cfp/program?id=55"}, "title": "Balanced and Explainable Social Media Analysis for Public Health with Large Language Models", "abstract": "As social media becomes increasingly popular, more and more public health activities emerge, which is worth noting for pandemic monitoring and government decision-making. Current techniques for public health analysis involve popular models such as BERT and large language models (LLMs). Although recent progress in LLMs has shown a strong ability to comprehend knowledge by being fine-tuned on specific domain datasets, the costs of training an in-domain LLM for every specific public health task are especially expensive. Furthermore, such kinds of in-domain datasets from social media are generally highly imbalanced, which will hinder the efficiency of LLMs tuning. To tackle these challenges, the data imbalance issue can be overcome by sophisticated data augmentation methods for social media datasets. In addition, the ability of the LLMs can be effectively utilised by prompting the model properly. In light of the above discussion, in this paper, a novel ALEX framework is proposed for social media analysis on public health. Specifically, an augmentation pipeline is developed to resolve the data imbalance issue. Furthermore, an LLMs explanation mechanism is proposed by prompting an LLM with the predicted results from BERT models. Extensive experiments conducted on three tasks at the Social Media Mining for Health 2023 (SMM4H) competition with the first ranking in two tasks demonstrate the superior performance of the proposed ALEX method. Our code has been released in https://github.com/YanJiangJerry/ALEX.", "venue": "Australasian Database Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-12", "journal": {"pages": "73-86"}, "authors": [{"authorId": "2238993080", "name": "Yan Jiang"}, {"authorId": "1395454635", "name": "Ruihong Qiu"}, {"authorId": "39939149", "name": "Yi Zhang"}, {"authorId": "40075735", "name": "P. Zhang"}], "citations": [{"paperId": "d9403061e3a3392652d037138532fab111c845c1", "title": "Large language models in healthcare and medical domain: A review"}, {"paperId": "74b0976a3a7b7013fd468a043a940dcf401e66f1", "title": "User Modeling in the Era of Large Language Models: Current Research and Future Directions"}]}
