{"paperId": "0290e5cbadb45a24c30d9dbd661986d6badb029f", "publicationVenue": null, "title": "Spherical fuzzy extension of AHP‐ARAS methods integrated with modified k‐means clustering for logistics hub location problem", "abstract": "Like most other industries, logistics services are currently encountering enormous transformation. Many companies worldwide are applying big data analytics to implement operational strategies and facilitate location selection. Logistics companies need to focus on now and explore some futures of logistics hub location problems. Creating a profitable logistic network is a crucial task for airline and postal services. To establish a cost‐effective network, transportation expenses should be decreased, and networks should be simplified. Hub location problem is born out of these needs. The concept of hub cumulates the flows and makes networks more reliable. In this article, a novel hub location selection approach is introduced in a group decision making (GDM) environment with uncertainty by integrating a modified weighted k‐means clustering algorithm with multi‐criteria decision‐making (MCDM) tools. The combined MCDM method integrates analytic hierarchy process (AHP) to measure criteria weights and Additive Ratio Assessment technique to measure the performance of hub location alternatives in a spherical fuzzy set (SFS) environment. The SFS has shown definite advantages in handling vagueness and uncertainty over crisp, fuzzy, or intuitionistic fuzzy sets to depict experts' evaluations with a richer structure, allowing for more representative decision making. Using Turkish logistics data, big data algorithm facilitates 15 possible locations, and these sites are ranked in order by the integrated GDM methodology. The validation of the proposed evaluation model is illustrated in an application of the network structure in Turkey. Finally, sensitivity and comparison evaluations are introduced to demonstrate the feasibility and effectiveness of the proposed approach.", "venue": "Expert Syst. J. Knowl. Eng.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-18", "journal": {"name": "Expert Systems", "volume": "39"}, "authors": [{"authorId": "2835429", "name": "Fethullah Gocer"}, {"authorId": "2132586457", "name": "Nazmi Sener"}], "citations": [{"paperId": "b4cd17fb7ba01588e3f4a9e6e24f20a0df2e3b55", "title": "Design concept evaluation based on cloud rough model and modified AHP-VIKOR: An application to lithography tool manufacturing process"}, {"paperId": "48137880b1e6742ceade3d8250569b5497a016ac", "title": "Z-number extension of TODIM-CPT method combined with K-means clustering for electric vehicle battery swapping station site selection"}, {"paperId": "8d423c666590574d1cd8706edb34c996d5f9eba8", "title": "An ideal plastic waste management system based on an enhanced MCDM technique"}, {"paperId": "fc977ca30e530ab86531004fa2869cb1ecbca783", "title": "Spherical Fuzzy Sets based Integrated DEMATEL, ANP, VIKOR Approach and its application for Renewable Energy Selection in Turkey"}, {"paperId": "b94a0039117e1e5de22560253f6724092c7d88e6", "title": "Insurtech in Europe: identifying the top investment priorities for driving innovation"}, {"paperId": "a56763266bfda697a17505ac2e6f3cb2072b23bc", "title": "An augmented fuzzy decision support system to analyse compatible cosmetic face masks for various complexions"}, {"paperId": "967af94184fd3e23c93b1f815020bcbc5a81698a", "title": "Phase-wise injury integrated severity modeling of road accidents: a two-stage hybrid multi-criteria decision-making model"}, {"paperId": "ec05a83c7a46e282b1383b3a48f0feb1f254baf7", "title": "An extensible complex spherical fuzzy decision making model based selection framework for the food waste treatment method"}, {"paperId": "d19987211fe3f1602e9be0ae977f293d61d06197", "title": "A machine learning-integrated multi-criteria decision-making approach based on consensus for selection of energy storage locations"}, {"paperId": "6be7cb88435b8692609ebad726da3fe1c97a9305", "title": "Optimising Urban Freight Logistics Using Discrete-Event Simulation and Cluster Analysis: A Stochastic Two-Tier Hub-and-Spoke Architecture Approach"}, {"paperId": "b388d5a4a58de94a25ace4cc57ef95407a6a6730", "title": "Logistics Hub Location Optimization: A K-Means and P-Median Model Hybrid Approach Using Road Network Distances"}, {"paperId": "48f1f14609ec7fe60d5f9c61e740f94217d13eef", "title": "An Integrated Spherical Fuzzy Multi-criterion Group Decision-Making Approach and Its Application in Digital Marketing Technology Assessment"}, {"paperId": "e9a66303ea2d9283ce28c1cf0787f4d58293f530", "title": "Risk mitigation in service industries: A research agenda on container shipping"}, {"paperId": "31f70b7c83812fcec3dd33d8274a5b4e996fec6b", "title": "Penyeleksian Penerimaan Teleservice Representative dengan Penerapan Metode ARAS dan Pembobotan ROC"}, {"paperId": "916c1d6f4736487b559fc055907212820055fe8a", "title": "Breast cancer treatment planning using a novel spherical fuzzy CRITIC-REGIME"}, {"paperId": "7d3408d49090379f7a8608dc770502e6679324d9", "title": "ARASsort\n : A new sorting based multiple attribute decision‐making algorithm"}, {"paperId": "e7e69ff8650e3db0afd0483b03ac1d2554926bbb", "title": "Optimizing the ground intra-city express delivery network: An integrated multiple centrality assessment, multi-criteria decision-making, and multi-objective integer programming model"}, {"paperId": "d1a6f9332297b9aa2741fc23c8ba3676c9e42d94", "title": "Some novel operational laws and spherical fuzzy Choquet‐Frank operators and their application to MCDM"}, {"paperId": "cac6de6637ecbd85c9fe95bbce341603d98cd5a7", "title": "K-means clustering algorithms: A comprehensive review, variants analysis, and advances in the era of big data"}, {"paperId": "612ff54630aedcdcf1b42f147da718385b0a5b48", "title": "Limestone supplier selection for coal thermal power plant by applying integrated PF-SAW and PF-EDAS approach"}, {"paperId": "886d54de2b53b151d97c0e45f73fc3453343b1ca", "title": "Public transportation business model evaluation with Spherical and Intuitionistic Fuzzy AHP and sensitivity analysis"}, {"paperId": "0a28d600b70a23d6660a1a6638e4d6fef5f2b17e", "title": "Research on Fresh Pre-Positioning Warehouse Layout Based on Spatial Data Mining"}]}
