{"paperId": "029445b1e223debbf3384ea8521f80b1c590c373", "publicationVenue": null, "title": "Moldable scenario builder Master Thesis", "abstract": "Current behavior-driven development (BDD) practices promise to engage more stakeholders in an agile software development process through the use of behavior speciﬁcations of the software product. However, current capabilities for behavior speciﬁcation restrict possible feedback as they fail to reliably connect the speciﬁcation with the corresponding implementation. We analyzed 14 BDD tools to observe their limitations for facilitating feedback between multiple stake-holders. We observed that the existing BDD tools differ in characteristics regarding their support for a ubiquitous language and speciﬁcation format. Despite the recent attempts to write more natural language speciﬁcations, the existing tools are largely developer-oriented and limit the engagement of other participants. The analyzed tools focus mostly on asserting input values against desired business output for a BDD scenario and much less on manipulating the output itself. To tackle the aforementioned limitations, we present our prototype solution ‘Moldable scenario editor’ implemented in the Pharo environment. To achieve this, we allow BDD scenarios to return objects and adapt their representation to the perspective of non-technical stakeholders. We strive to engage more participants in the agile software development process by giving them different ways to experiment with behavior speciﬁcations within an IDE. For instance, we use an embedded rich text editor to illustrate how plain textual speciﬁcations can leverage the corresponding implementation. Similarly, with a combination of graphical elements, we allow users to experiment with domain objects i.e. , compose new BDD tests without having to code. We speculate that such an approach can bind behavior speciﬁcations more closely to the implementation, and facilitate effective collaboration among team members.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2061750714", "name": "Ivan Kravchenko"}, {"authorId": "2285137255", "name": "Prof. Dr. Oscar Nierstrasz"}, {"authorId": "2285139178", "name": "Andrei Chi¸s"}, {"authorId": "51126913", "name": "Nitish Patkar"}, {"authorId": "2285146622", "name": "Nataliia Stulova"}], "citations": []}
