{"paperId": "0298291dff79b6f6505c282566801993c71974be", "publicationVenue": null, "title": "Zero defect manufacturing: a self-adaptive defect prediction model based on assembly complexity", "abstract": "ABSTRACT The prediction of defects occurring during manufacturing processes is one of the strategies to be implemented by organizations to reach the goals of Zero-Defect Manufacturing (ZDM). In low-volume productions, characterized by a high level of complexity and customization, defects prediction may be challenging owing to the small amount of historical data typically available. This paper proposes a diagnostic tool that provides an in-line identification of critical steps of assembly processes. The method is based on a self-adaptive defect prediction model of the process, updated as new data are acquired. Assembly complexity of both the process and the design are used as predictors of the defect model. The methodology identifies critical assembly workstations where the respective average defectiveness deviates from the average defectiveness predicted by the model. Detecting critical workstations facilitates quality engineers in identifying the causes of non-conformities and undertaking appropriate corrective actions. The relevance of the method is emphasized by an application to a real case study related to the assembly of rotating ring wrapping machines used in end-of-line packaging.", "venue": "International journal of computer integrated manufacturing (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-26", "journal": {"name": "International Journal of Computer Integrated Manufacturing", "pages": "155 - 168", "volume": "36"}, "authors": [{"authorId": "66484842", "name": "E. Verna"}, {"authorId": "32155692", "name": "Gianfranco Genta"}, {"authorId": "2563795", "name": "M. Galetto"}, {"authorId": "20623522", "name": "F. Franceschini"}], "citations": [{"paperId": "181e83725122b5be3e8b46cbf78b2fe9a4ba6ead", "title": "Effects of product complexity on human learning in assembly and disassembly operations"}, {"paperId": "e524c26b7da631c6ff41d918c9139b1cff5ace5b", "title": "Application of Machine Learning for Anomaly Detection in Printed Circuit Boards Imbalance Date Set"}, {"paperId": "0d9baa7a8b0a6c24ef93154a3d38da1bc79f84c9", "title": "Direct calibration of indenter tip geometry by optical surface topography measuring instruments"}, {"paperId": "81e54076cd94a7d62a1cebfa678f7fe81a76ca7d", "title": "Prediction of Array Antenna Assembly Accuracy Based on Auto-Encoder and Boosting-OSKELM"}, {"paperId": "64c18ae7d4a616d7abec72eb532e00e4fc2d005f", "title": "A Novelty Procedure to Identify Critical Causes of Materials Incompatibility"}, {"paperId": "dc50deec562c30f1483fc9b1f592cee5fa57b597", "title": "A new approach for evaluating experienced assembly complexity based on Multi Expert-Multi Criteria Decision Making method"}, {"paperId": "f7b86af010052ec3db52f820b16db1e9df874d7d", "title": "Predictive models in digital manufacturing: research, applications, and future outlook"}, {"paperId": "ff6963b7af0a2ef34c4d3f1535187dbaf84dd362", "title": "Surface defect detection methods for industrial products with imbalanced samples: A review of progress in the 2020s"}]}
