{"paperId": "02a00195ecccfcc97295fe8be6eb61a37f268f80", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Data Analytics for Profiling Low-Voltage Customers with Smart Meter Readings", "abstract": "The energy transition for decarbonization requires consumers’ and producers’ active participation to give the power system the necessary flexibility to manage intermittency and non-programmability of renewable energy sources. The accurate knowledge of the energy demand of every single customer is crucial for accurately assessing their potential as flexibility providers. This topic gained terrific input from the widespread deployment of smart meters and the continuous development of data analytics and artificial intelligence. The paper proposes a new technique based on advanced data analytics to analyze the data registered by smart meters to associate to each customer a typical load profile (LP). Different LPs are assigned to low voltage (LV) customers belonging to nominal homogeneous category for overcoming the inaccuracy due to non-existent coincident peaks, arising by the common use of a unique LP per category. The proposed methodology, starting from two large databases, constituted by tens of thousands of customers of different categories, clusters their consumption profiles to define new representative LPs, without a priori preferring a specific clustering technique but using that one that provides better results. The paper also proposes a method for associating the proper LP to new or not monitored customers, considering only few features easily available for the distribution systems operator (DSO).", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-01-06", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1681459", "name": "F. Pilo"}, {"authorId": "49822870", "name": "G. Pisano"}, {"authorId": "145840557", "name": "S. Ruggeri"}, {"authorId": "30778342", "name": "M. Troncia"}], "citations": [{"paperId": "ad7fd39ed1bdc3d65da40434f5fa3583357ccc00", "title": "Ensemble learning approach for advanced metering infrastructure in future smart grids"}, {"paperId": "0a0e7b7ea0b9671c1f42503cf31eb09599888c25", "title": "Impact of Electrical Vehicle Residential Charging Stations on the Quality of the Low Voltage Network Supply"}, {"paperId": "5b8038a61598bad9198e25f7e84cf6bccad152bd", "title": "Reliability Analysis of Intelligent Electric Energy Meter under Fusion Model Illness Analysis Algorithm"}, {"paperId": "14ae823aa2d318b5cdd476b419b7090f436207e6", "title": "Privacy-preserving methods for smart-meter-based network simulations"}, {"paperId": "dda605b61e99ae7f3d8c2e06718cc079208e5fe9", "title": "Impact of Electrical Vehicle Private Charging Stations on the Quality of the Low Voltage Network Supply"}]}
