{"paperId": "02a95895f88ac496205476efc6b0196568c0e0da", "publicationVenue": null, "title": "Machine learning-driven task scheduling with dynamic K-means based clustering algorithm using fuzzy logic in FOG environment", "abstract": "Fog Computing has emerged as a pivotal technology for enabling low-latency, context-aware, and efficient computing at the edge of the network. Effective task scheduling plays a vital role in optimizing the performance of fog computing systems. Traditional task scheduling algorithms, primarily designed for centralized cloud environments, often fail to cater to the dynamic, heterogeneous, and resource-constrained nature of Fog nodes. To overcome these limitations, we introduce a sophisticated machine learning-driven methodology that adapts task allocation to the ever-changing Fog environment's conditions. Our approach amalgamates K-Means clustering algorithm enhanced with fuzzy logic, a robust unsupervised learning technique, to efficiently group Fog nodes based on their resource characteristics and workload patterns. The proposed method combines the clustering capabilities of K-means with the adaptability of fuzzy logic to dynamically allocate tasks to fog nodes. By leveraging machine learning techniques, we demonstrate how tasks can be intelligently allocated to fog nodes, resulting in reducing execution time, response time and network usage. Through extensive experiments, we showcase the effectiveness and adaptability of our proposed approach in dynamic fog environments. Clustering proves to be a time-effective method for identifying groups of jobs per virtual machine (VM) efficiently. To model and evaluate our proposed approach, we have utilized iFogSim. The simulation results affirm the effectiveness of our scheduling technique, showcasing significant enhancements in execution time reduction, minimized network utilization, and improved response time when compared to existing machine learning and non-machine learning based scheduling methods within the iFogSim framework.", "venue": "Frontiers Comput. Sci.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-14", "journal": {"name": "Frontiers Comput. Sci.", "volume": "5"}, "authors": [{"authorId": "2274918142", "name": "Muhammad Saad Sheikh"}, {"authorId": "2052319", "name": "Rabia Noor Enam"}, {"authorId": "2986594", "name": "Rehan Qureshi"}], "citations": [{"paperId": "6d003b2a0924b6d543b1dbef1bdedd95fd71f5e2", "title": "Optimizing multi-objective task scheduling in fog computing with GA-PSO algorithm for big data application"}]}
