{"paperId": "02b885848f33a7b1bfc9dc5822578ae23c10e663", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Quantitative Analysis and Prediction of Academic Performance of Students Using Machine Learning", "abstract": "Academic performance evaluation is essential to enhance educational affection and improve educational quality and level. However, evaluating academic performance is difficult due to the complexity and nonlinear education process and learning behavior. Recently, machine learning technology has been adopted in Educational Data Mining (EDM) to predict and evaluate students’ academic performance. This study developed a quantitative prediction model of academic performance and investigated the performance of various machine learning algorithms and the influencing factors based on the collected educational data. The results conclude that machine learning provided an excellent tool to characterize educational behavior and represent the nonlinear relationship between academic performance and its influencing factors. Although the performance of various methods has some differences, all could be used to capture the complex and implicit educational law and behavior. Furthermore, machine learning methods that fully consider various factors have better prediction and generalization performance. In order to characterize the educational law well and evaluate accurately the academic performance, it is necessary to consider as many influencing factors as possible in the machine learning model.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-18", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2232573223", "name": "Lihong Zhao"}, {"authorId": "30592007", "name": "Jiaolong Ren"}, {"authorId": "2232477420", "name": "Lin Zhang"}, {"authorId": "2107667760", "name": "Hongbo Zhao"}], "citations": [{"paperId": "77f6d04fd31fb5964052a32adc1f61bbe9353fa0", "title": "Analysis of influencing factors of carbon emissions from China’s marine fishery energy consumption under different development scenarios"}]}
