{"paperId": "02be389e0553228a7569ccce054bedb167d327cd", "publicationVenue": null, "title": "PERSONALIZACIJA USLUGA KROZ NOVE TEHNOLOGIJE", "abstract": "Svrha – Svrha rada je predstaviti sustav koji uči i unaprjeđuje sam sebe prateći odluke gosta i trendove na tržištu te upoznaje interese, želje i navike gostiju. Obrada teme – Snažan napredak digitalne tehnologije, u posljednjih 25 godina, doveo je do novih paradigmi u poslovanju. Hotelijerstvo je djelatnost u kojoj su disruptivne tehnologije poput umjetne inteligencije, strojnog učenja i virtualnih agenata (chatbotovi) počeli mijenjati poslovanje u obliku obavljanja jednostavnijih zadataka korisničke službe, pružanja jednostavnog iskustva prijave u hotel, upravljanja ‘pametnim’ hotelskim sobama koje se mogu prilagoditi, i predviđanja individualnih zahtjeva gostiju. Zahvaljujući sustavima automatizirane segmentacije hotelijerima je omogućeno bolje razumijevanje interesa i želja gostiju te pružanje visoko personalizirane hotelske usluge jačajući istovremeno prodaju smještajnih kapaciteta te podizanje novčane vrijednosti svakog gosta, ali i same sobe. Zaključci – Sustav automatizirane segmentacije gostiju i personalizacije usluga moguće je implementirati u sve faze putovanja gosta. Pri rezervaciji smještaja, sustavi nude gostima dodatne, primamljive, personalizirane te ne nametljive usluge za nadogradnju sobe u skladu s njihovim interesima. Tijekom boravka se gostima nude usluge kroz različite kanale (na IPTVu, kroz osoblje na recepciji, conciergu, u restoranu, kroz Wi-Fi landing page, kroz sustav SMS poruka, kroz mobilne aplikacije) ovisno o tome koji kanal donosi najveću dobit. Nakon odlaska gosta sustav šalje email zahvale kako bi se iskoristio dojam nedavnog boravka te šalje ponuda za iduću sezonu.", "venue": "Hotelska kuća", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Hotelska kuća"}, "authors": [{"authorId": "2006297083", "name": "Jelena Mušanović"}, {"authorId": "2052684700", "name": "Marko Šimić"}], "citations": []}
