{"paperId": "02bfacb2562c6766a21f6f990195fb35a3b999f7", "publicationVenue": {"id": "cb87b91e-7788-4e4f-bed1-6ca64f4102de", "name": "ACM Transactions on Reconfigurable Technology and Systems", "type": "journal", "alternate_names": ["ACM Trans Reconfigurable Technol Syst"], "issn": "1936-7406", "url": "https://trets.cse.sc.edu/index.html", "alternate_urls": ["http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1151&linked=1&part=transaction", "http://portal.acm.org/trets/"]}, "title": "Topgun: An ECC Accelerator for Private Set Intersection", "abstract": "Elliptic Curve Cryptography (ECC), one of the most widely used asymmetric cryptographic algorithms, has been deployed in Transport Layer Security (TLS) protocol, blockchain, secure multiparty computation, and so on. As one of the most secure ECC curves, Curve25519 is employed by some secure protocols, such as TLS 1.3 and Diffie-Hellman Private Set Intersection (DH-PSI) protocol. High-performance implementation of ECC is required, especially for the DH-PSI protocol used in privacy-preserving platform. Point multiplication, the chief cryptographic primitive in ECC, is computationally expensive. To improve the performance of DH-PSI protocol, we propose Topgun, a novel and high-performance hardware architecture for point multiplication over Curve25519. The proposed architecture features a pipelined Finite-field Arithmetic Unit and a simple and highly efficient instruction set architecture. Compared to the best existing work on Xilinx Zynq 7000 series FPGA, our implementation with one Processing Element can achieve 3.14× speedup on the same device. To the best of our knowledge, our implementation appears to be the fastest among the state-of-the-art works. We also have implemented our architecture consisting of 4 Compute Groups, each with 16 PEs, on an Intel Agilex AGF027 FPGA. The measured performance of 4.48 Mops/s is achieved at the cost of 86 Watts power, which is the record-setting performance for point multiplication over Curve25519 on FPGAs.", "venue": "ACM Transactions on Reconfigurable Technology and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-13", "journal": {"name": "ACM Transactions on Reconfigurable Technology and Systems", "pages": "1 - 30", "volume": "16"}, "authors": [{"authorId": "2458850", "name": "Guiming Wu"}, {"authorId": "2152880809", "name": "Qianwen He"}, {"authorId": "2167820110", "name": "Jiali Jiang"}, {"authorId": "2117995100", "name": "Zhenxiang Zhang"}, {"authorId": "2143753524", "name": "Yuan Zhao"}, {"authorId": "2167861042", "name": "Yinchao Zou"}, {"authorId": "2223150098", "name": "Jie Zhang"}, {"authorId": "2111632524", "name": "Changzheng Wei"}, {"authorId": "2117789037", "name": "Ying Yan"}, {"authorId": "2153729009", "name": "Hui Zhang"}], "citations": [{"paperId": "cc0a533e0cae51ef6af668fb1645bad227d7fe0d", "title": "A Novel JSF-Based Fast Implementation Method for Multiple-Point Multiplication"}]}
