{"paperId": "02ced6075b3412ef3e90d8be1485826715462cc2", "publicationVenue": null, "title": "Infrastructure and Security for Supporting Smart City: A Systematic Literature Review", "abstract": "Today's Smart City is increasingly encouraged to be built. The ease of public access to information makes smart cities a target for the development of many cities. Smart City itself cannot be separated from the term internet of things which connects various objects in the same network. The application of IoT in a city presents a new term called Smart City. With the ease of living in a city that carries IoT and a Smart City, it is hoped that the implementation of this IoT can be carried out throughout the city. However, many things need to be prepared and of course, in terms of the security of the existing devices. In addition to the readiness of human resources, supporting infrastructure must also be designed very carefully, especially if a city does not yet have adequate internet access for IoT implementation. Through this research, we found that building a Smart City IoT requires infrastructure, at least a good internet network, various sensors, data storage, and applications. Security and privacy in a smart city are also as important. Many common vulnerabilities by OWASP, such as Broken access control, Security misconfigurations, Identification and Authentication Failures, Insecure Design, Injection attacks, Cryptographic Failures, Vulnerable and Outdated Components, Software and Data Integrity Failures, Security Logging and Monitoring Failures, and Server-Side Request Forgery (SSRF) are still underestimated, people also need be aware of privacy since the apps collect your data constantly.", "venue": "2022 2nd International Conference on Electronic and Electrical Engineering and Intelligent System (ICE3IS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-11-04", "journal": {"name": "2022 2nd International Conference on Electronic and Electrical Engineering and Intelligent System (ICE3IS)", "pages": "242-245"}, "authors": [{"authorId": "2179220531", "name": "M. F. Hidayat"}, {"authorId": "2202015624", "name": "Alvian Daru Quthni"}, {"authorId": "2202015851", "name": "Juan Trilnardo Defrin"}, {"authorId": "2202015991", "name": "Gafiliano Gapili"}, {"authorId": "11053373", "name": "Jurike V. Moniaga"}, {"authorId": "2180723990", "name": "Bakti Amirul Jabar"}], "citations": []}
