{"paperId": "02d283235f61153262bfac886feb14c05a6d91e0", "publicationVenue": {"id": "435f8972-3ede-4a27-ba87-7bd33088e5df", "name": "Revue Française des Sciences de l'Information et de la Communication", "type": "journal", "alternate_names": ["Rev Fr Sci l’information Commun", "Revue Française des Sciences de l’Information et de la Communication", "Rev Fr Sci l'information Commun"], "issn": "2263-0856", "url": "https://journals.openedition.org/rfsic/", "alternate_urls": ["http://rfsic.revues.org/"]}, "title": "L’impact de l’influence sociale sur l’intention d’usage des objets connectés pour le sport", "abstract": "La technologie de l’internet des objets (IoT) vise a rendre les objets physiques qui nous entourent connectes afin de faciliter la vie des utilisateurs. L’intention d’usage de ces objets connectes pour le sport est influencee par plusieurs facteurs, nous avons pris les facteurs les plus determinants que les fournisseurs de cette technologie doivent prendre en consideration afin de reussir a attirer les utilisateurs, les convaincre de la valeur ajoutee de ces objets et moderer les craintes liees a la confidentialite des donnees personnelles. Cependant, la litterature actuelle manque encore des etudes specifiques a chaque type des objets connectes. Dans cet article, nous etudions les facteurs determinants de l’intention d’usage specifique aux objets connectes pour le sport. Les resultats de l’etude ont montre un impact fort de l’influence sociale sur l’utilite percue, le controle percu et la credibilite percue du fournisseur valide comme des facteurs determinants qui influence fortement l’intention d’usage des objets connectes pour le sport. De plus, le controle percu et l’utilite percue impactent aussi la credibilite percue du fournisseur. Ce modele integre fourni davantage d’explications sur l’intention comportementale de l’utilisateur vis-a-vis de l’utilisation de l’internet des objets pour le sport. influence sociale, utilite percue, controle percu, credibilite du fournisseur, objets connectes pour le sport, Intention d’usage", "venue": "Revue Française des Sciences de l'Information et de la Communication", "year": 2019, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2019-05-24", "journal": {"name": "Revue française des sciences de l’information et de la communication"}, "authors": [{"authorId": "147250267", "name": "Khalid Samhale"}, {"authorId": "3160645", "name": "Richard Ladwein"}], "citations": [{"paperId": "473ac1f60c511c7010bf0f59251405945a964849", "title": "UNDERSTANDING THE IMPACT OF SOCIAL INFLUENCE ON ENGAGEMENT IN IOT SPORTS TECHNOLOGY: A MEDIATION ANALYSIS"}, {"paperId": "cde9634242fb87ad7dd59c8a5113805612db32cc", "title": "Exploring determinants of engagement in the use of IoT for healthcare during the COVID-19 pandemic: A fear-driven perspective"}, {"paperId": "7c3b03e939f729871e48d61c610387578bb5bffd", "title": "Utilité perçue de la formalisation de l’entreprise selon le niveau d’études et l’auto efficacité entrepreneuriale des femmes entrepreneures à Abidjan (Côte d’Ivoire)"}]}
