{"paperId": "02df396f75490f9f30edf91283ca6bcad9edbe6a", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "News Feeds and User Engagement: Evidence from the Reddit News Tab", "abstract": "We study how the introduction of a new non-personalized news feed impacts user engagement quantity, quality, and diversity on Reddit. In June 2018, Reddit introduced the News tab on iOS devices that surfaces popular content from a curated list of news-related communities. We leverage this natural experiment to identify the causal effects of the News tab on iOS user engagement in a difference-in-differences design. We find that the News tab increases the share of iOS devices that engage with news-related content and there is a relatively larger increase in low-quality engagement, measured through voting on the platform. We also find that the diversity of engagement within news categories and within articles from publishers across the political spectrum increases as a result of the News tab. These results suggest that non-personalized feeds can be an important tool to mitigate algorithmic filter bubbles, and need not come at the expense of reduced user engagement.", "venue": "Social Science Research Network", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "119938771", "name": "A. Moehring"}], "citations": [{"paperId": "5a8c3e40d687dd55f8d32aa32e53d2c94f165bbd", "title": "Does Human-algorithm Feedback Loop Lead To Error Propagation? Evidence from Zillow’s Zestimate ∗"}]}
