{"paperId": "03084a3f5b38eb5024b1187f2da4a28d7f91d552", "publicationVenue": null, "title": "Use of telemedicine and e-health in disasters: a systematic review", "abstract": "Objective: Both natural and man-made disasters need near-term and long-term interventions to reduce morbidity and mortality among the affected population. Recently, telemedicine has been effectively used in both man-made and natural disasters and showed its effectiveness in eliminating the adverse consequences of disasters. Therefore, the purpose of this study was to identify the application of telehealth in different phases of disaster. Methods: We systematically searched all English papers regarding the use of telemedicine in different phases of disaster indexed in PubMed, Embase, and Web of Science databases until June 2020. A data collection form was designed to extract the required data such as types of systems, telecommunication technologies, and phases of disaster. Results: In this study, 16 out of 4490 retrieved articles were selected as relevant and reviewed by the authors. Findings indicated that the majority of studies highlighted the use of telemedicine in natural disasters (n=12), and only four discussed it in a man-made disaster like war and terrorist attacks. In 6 studies out of 16, telemedicine was used to treat and assess mental disorders among the affected population. And the internet was the most common technology for telemedicine development. Conclusion: Providing health care during a disaster is necessary, and telemedicine is important for such care. This systematic review helps define the components and application of telemedicine in disaster as a new technology in recent days, but we need to consider it and develop this technology in all phases of disaster management, especially during the response phase.", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2020-09-27", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2002834", "name": "S. S. Nejad"}, {"authorId": "82297310", "name": "Nazanin Jannati"}, {"authorId": "66386853", "name": "R. E. Sarabi"}, {"authorId": "3027285", "name": "K. Bahaadinbeigy"}], "citations": [{"paperId": "06a949e4d9a5232026265e132045a3a0a431df79", "title": "Applied distance learning methods in disaster preparedness: A systematic review"}, {"paperId": "d61c333c6716a112989918cf2d6b6573fd4e32b6", "title": "Virtual reality applications for rehabilitation of COVID‐19 patients: A systematic review"}, {"paperId": "a9a52ac7ab2ec347d9cd5baaa70249f00c22843b", "title": "Application of Telerehabilitation for Older Adults During the COVID-19 Pandemic: A Systematic Review"}, {"paperId": "199cccee77d53eb26086e6b0e038736ce11074cd", "title": "Providing telenursing care for victims: a simulated study for introducing of possibility nursing interventions in disasters"}, {"paperId": "b9f3fae35b8aa2171320490c8070e08c001a4faf", "title": "Technology and Disasters: The Evolution of the National Emergency Tele-Critical Care Network"}]}
