{"paperId": "0320b00698d5fd0268415b649ad3db9072483736", "publicationVenue": {"id": "b0fdd3fe-8aa6-456f-8929-cbce0148150b", "name": "European Conference on Cognitive Ergonomics", "type": "conference", "alternate_names": ["Eur Conf Cogn Ergon", "ECCE", "Energy Convers Congr Expo", "Int Conf Electr Comput Commun Eng", "International Conference on Electrical, Computer and Communication Engineering", "Energy Conversion Congress and Exposition"], "url": "http://www.wikicfp.com/cfp/program?id=798"}, "title": "Alzheimer's Disease Classification From 2D MRI Brain Scans Using Convolutional Neural Networks", "abstract": "Alzheimer's Disease (AD) is a neurological disorder which causes brain cells to die, resulting in memory loss associ-ated with cognitive impairment. Typical symptoms of Alzheimer's disease are- memory loss, language difficulties, and impulsive or erratic behaviour. AD varies from a mild disorder to moderate deterioration, until a severe cognitive impairment finally occurs. Currently, there is no cure to this disease. Only early diagnosis can help provide timely medical support and facilitate necessary healthcare. Magnetic Resonance Imaging (MRI) is widely used in the diagnosis of Alzheimer's Disease. Several image processing techniques are used to develop automated systems for detection and classification of AD from brain MRI. In this paper, we proposed three Convolutional Neural Network (CNN) models to detect and classify four stages of Alzheimer's disease from 2D MRI. We used the VGG16 and the Xception models with transfer learning approach, and a fully customised CNN model for the classification task. The customised model performed the best with accuracy of 0.9477, and F1-score of 0.9481. The proposed method performed better than the conventional Support Vector Machine (SVM) techniques. It is less complex, and less time consuming with better efficiencies than CNN techniques utilizing 3D MRI images.", "venue": "European Conference on Cognitive Ergonomics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-23", "journal": {"name": "2023 International Conference on Electrical, Computer and Communication Engineering (ECCE)", "pages": "1-6"}, "authors": [{"authorId": "2129562346", "name": "R. A. Hridhee"}, {"authorId": "2214775818", "name": "Biddut Bhowmik"}, {"authorId": "9069025", "name": "Q. D. Hossain"}], "citations": [{"paperId": "3bb22d116e60f70bff67c3b18c3c8e0d1eba2cb9", "title": "An Alzheimer’s disease classification model using transfer learning densenet with embedded healthcare decision support system"}]}
