{"paperId": "0321badf68adfaad4d21283b39dd28f4dd493289", "publicationVenue": {"id": "d4dc0085-e63a-493d-b2fd-56fb64bd113a", "name": "International Conference on Management of Data", "type": "conference", "alternate_names": ["Int Conf Manag Data", "COMAD", "Conference on Management of Data", "Conf Manag Data"], "url": "http://www.wikicfp.com/cfp/program?id=537"}, "title": "HaDeS: A Hadoop-based Framework for Detection of Peer-to-Peer Botnets", "abstract": "This paper presents Hades, a Hadoop-based framework for detection of P2P botnets in an enterprise-level network, which is distributed and scalable by design. The contributions of this work are two-fold: Firstly, our work uses the Hadoop-ecosystem to adopt a 'host-aggregation based' approach which aggregates behavioral metrics for each Peer-to-Peer (P2P) host seen in network communications, and uses them to distinguish between benign P2P hosts and hosts infected by P2P botnets. Secondly, we propose a distributed data-collection architecture which can monitor inside-to-inside LAN traffic, as opposed to relying solely on the NetFlow information available at a backbone router which cannot see the LAN communications happening in the network.", "venue": "International Conference on Management of Data", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2014-12-17", "journal": {"pages": "121-124"}, "authors": [{"authorId": "3120689", "name": "Pratik Narang"}, {"authorId": "2364638", "name": "A. Thakur"}, {"authorId": "10227151", "name": "C. Hota"}], "citations": [{"paperId": "b44ac7ea4e7c330fd7c4b37d8b2d919d8eb62797", "title": "Noise-resistant mechanisms for the detection of stealthy peer-to-peer botnets"}, {"paperId": "854a0a1c81c19029333aad822159c93103508fc1", "title": "A Cloud Computing Based Network Monitoring and Threat Detection System for Critical Infrastructures"}, {"paperId": "d8390b7cd9f6975590fdfcd661decac713998e5b", "title": "Survey of the P2P botnet detection methods"}]}
