{"paperId": "034381d5f34782ef22b15678cb2f9e8737f7b02d", "publicationVenue": {"id": "5c4aa4f1-8375-43a8-baca-65f24ba81e2b", "name": "Journal of Intelligence", "type": "journal", "alternate_names": ["J Intell"], "issn": "2079-3200", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-333835", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-333835", "https://www.mdpi.com/journal/jintelligence"]}, "title": "Intelligent Academic Specialties Selection in Higher Education for Ukrainian Entrants: A Recommendation System", "abstract": "In this article, we provide an approach to solve the problem of academic specialty selection in higher educational institutions with Ukrainian entrants as our target audience. This concern affects operations at universities or other academic institutions, the labor market, and the availability of in-demand professionals. We propose a decision-making architecture for a recommendation system to assist entrants with specialty selection as a solution. The modeled database is an integral part of the system to provide an in-depth university specialties description. We consider developing an API to consume the data and return predictions to users in our future studies. The exploratory data analysis of the 2021 university admission campaign in Ukraine confirmed our assumptions and revealed valuable insights into the specifics of specialty selection among entrants. We developed a comprehension that most entrants apply for popular but not necessarily in-demand specialties at universities. Our findings on association rules mining show that entrants are able to select alternative specialties adequately. However, it does not lead to successful admission to a desired tuition-free education form in all cases. So, we find it appropriate to deliver better decision-making on specialty selection, thus increasing the likelihood of university admission and professional development based on intelligent algorithms, user behavior analytics, and consultations with academic and career orientation experts. The results will be built into an intelligent virtual entrant’s assistant as a service.", "venue": "Journal of Intelligence", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-26", "journal": {"name": "Journal of Intelligence", "volume": "10"}, "authors": [{"authorId": "122078658", "name": "S. Fedushko"}, {"authorId": "98360486", "name": "Taras Ustyianovych"}, {"authorId": "1912903", "name": "Yuriy Syerov"}], "citations": [{"paperId": "7ee969269216b140abc1cecfce12edc5da4cbe33", "title": "SBS feature selection and AdaBoost classifier for specialization/major recommendation for undergraduate students"}, {"paperId": "99087a7653671e6ef546e0e7bdfb57ac011fbd35", "title": "Standardized Computer-aided Design Mechanism of Intelligent Employment Recommendation System for International Business Students"}, {"paperId": "b5277f1c8591ca8f71be3a02aa0732d954f3aea0", "title": "Evaluation on Innovation and Development of University Education Management Informatization Construction Under the Background of Big Data"}, {"paperId": "c9d55ed42ebb2c4ae5839c6bd8d97509b02bb85e", "title": "Students' Performance Prediction in Higher Education Using Multi-Agent Framework-Based Distributed Data Mining Approach: A Review"}, {"paperId": "596c93c3b803e4e7a66a3c893494814e49e8423b", "title": "Development of Learning Associative Rules in the Context of Solving the Problems of Society"}, {"paperId": "c4d56c769c9e0473a422aa43be054e2d29c35e80", "title": "Recommendation System for a Delivery Food Application Based on Number of Orders"}, {"paperId": "cbbec5cf4cfe9bc018a775143ce8b2b0d66963b9", "title": "Computational Model of Recommender System Intervention"}, {"paperId": "8225a721e34559e7c104cb770521175292d77ee9", "title": "THE IMPACT OF THE RUSSIAN-UKRAINIAN WAR ON THE SYSTEM OF HIGHER EDUCATION IN UKRAINE"}]}
