{"paperId": "034a0c9c6a1867f5132d38bbc829b1384b3f0e6f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Multi-Source Feature Fusion for Object Detection Association in Connected Vehicle Environments", "abstract": "Improvements in vehicular perception systems over the last decade have enabled new levels of safety and awareness in modern production vehicles. However, achievable performance of these perception systems is bounded by sensor limitations, such as range, and environmental factors, such as occlusion. Collaborative perception circumvents these limitations by incorporating sensor data from multiple sources to fill in perception gaps experienced by an individual sources’ sensors. This paper explores one important aspect of collaborative perception: simultaneously associating objects detected by multiple individual vehicles with each other. This task is crucial as the inability to perform such object association accurately results in duplicate or missed detections, which can lead to unsafe driving behavior. This work proposes a graph neural network model for this task that achieves an average precision (AP) of 0.882 in a challenging virtual environment consisting of 25 unique, simultaneous, and mobile viewpoints. A simpler real-world scenario with two static viewpoints is also evaluated where the model achieves an AP of 0.998, showing that this model can readily transfer to real-world scenarios as well.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "131841-131854", "volume": "10"}, "authors": [{"authorId": "2058186732", "name": "Samuel Thornton"}, {"authorId": "144937526", "name": "Bryse Flowers"}, {"authorId": "2055840172", "name": "S. Dey"}], "citations": [{"paperId": "ddac9a06b64e68ab815e04cb5edd2693a8571980", "title": "Multi-modal Data and Model Reduction for Enabling Edge Fusion in Connected Vehicle Environments"}]}
