{"paperId": "0351f22135e61de52250654b1f8b277cd8c7a173", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Is Singularity-based Container Technology Ready for Running MPI Applications on HPC Clouds?", "abstract": "The Message Passing Interface (MPI) standard has become the de facto programming model for parallel computing with the last 25-year continuous community effort. With the development of building efficient HPC clouds, more and more MPI-based HPC applications start running on cloud-based environments. Singularity is one of the most attractive container technologies to build HPC clouds due to the claimed reproducible environments across the HPC centers. However, our investigations in the literature show that there is a lack of a systematical study on evaluating the performance of Singularity with various benchmarks and applications on different types of HPC platforms. Without these studies, it remains difficult to tell the community whether Singularity-based container technology is ready or not for running MPI applications on HPC clouds to gain desired performance. To fill this gap in the literature, as a third-party, we first propose a four-dimension evaluation methodology to cover various aspects and based on that, we conduct extensive studies on evaluating the performance of Singularity on modern processors, and high-performance interconnects. Performance results prove that Singularity-based container technology can achieve near-native performance for both Intel Xeon and Intel Xeon Knights Landing (KNL) platforms with different memory access modes (i.e., cache, flat). Singularity also shows very little overhead for running MPI-based HPC applications on both Omni-Path and InfiniBand networks. With the verification of our results, we believe that Singularity can be used for building next-generation HPC clouds with near-native performance as well as desired cloud features such as easy management and deployment.", "venue": "International Conference on Utility and Cloud Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-12-05", "journal": {"name": "Proceedings of the10th International Conference on Utility and Cloud Computing"}, "authors": [{"authorId": "40964476", "name": "Jie Zhang"}, {"authorId": "1720335", "name": "Xiaoyi Lu"}, {"authorId": "1731654", "name": "D. Panda"}], "citations": [{"paperId": "a03252bab4d908d35a5f69e3611da28374454d13", "title": "Enabling the execution of HPC applications on public clouds with HPC@Cloud toolkit"}, {"paperId": "dca8578b58eace778c145d51f1cac28d9890af02", "title": "Optimizing the Analysis and Evaluation of Logic Simulation Workloads in HPC Systems"}, {"paperId": "7f1efe58e9dcba71b375237814441e3cf13c81c0", "title": "MPI Application Binary Interface Standardization"}, {"paperId": "e9d9632d41330c6ac7fc206dbcac175126531e17", "title": "Design and implementation of quickly building artificial intelligence training environment on high-performance server"}, {"paperId": "481d1432fbc3eff742bcab6c276ae81570a03102", "title": "Containerization for High Performance Computing Systems: Survey and Prospects"}, {"paperId": "85350cc7e70b1fed0290ca64dc25a1f8e50ebcbc", "title": "Containerized AI Framework on Secure Shared Multi-GPU Systems"}, {"paperId": "37d34314c58a29db54d6cbf2016c85b3b8c48cfa", "title": "Containers in HPC: a survey"}, {"paperId": "3878eec194cd0544ec570b29871408cff656264e", "title": "Serverless High-Performance Computing over Cloud"}, {"paperId": "39ea64bfdcc901e382775554d85c260e426b6fb8", "title": "SparkFlow: Towards High-Performance Data Analytics for Spark-based Genome Analysis"}, {"paperId": "0939dce70431eff066b4d22b690249f7542fd921", "title": "Performance characterization of containerization for HPC workloads on InfiniBand clusters: an empirical study"}, {"paperId": "1eb362920d0443d3fa769412ee28a1c528fae9ed", "title": "Containerization technologies: taxonomies, applications and challenges"}, {"paperId": "7e300af2dd3d92e9ef3fc726c64d0f21441fc83f", "title": "Shared-Memory Communication for Containerized Workflows"}, {"paperId": "0d5c5b7153495a88a8c5584f7171278aa166586b", "title": "Empirical Performance Evaluation of Communication Libraries for Multi-GPU based Distributed Deep Learning in a Container Environment"}, {"paperId": "1ba8bc294268d7f16b44d85aa9b9e49c9a69552d", "title": "Container orchestration on HPC systems through Kubernetes"}, {"paperId": "2afae867ac67a65878338940ffb55d90886341cb", "title": "Empirical Performance Analysis of Collective Communication for Distributed Deep Learning in a Many-Core CPU Environment"}, {"paperId": "da761ecd89ea5f16890bf0952e434bcdaad46810", "title": "Multiple HPC Environments-Aware Container Image Configuration Workflow for Large-Scale All-to-All Protein-Protein Docking Calculations"}, {"paperId": "652bfd2809b15a2598ea2b8b632bdf70952327d4", "title": "Enabling high-performance cloud computing for Earth science modeling on over a thousand cores: application to the GEOS-Chem atmospheric chemistry model"}, {"paperId": "3386addaaa0bc8b64c6778c4a707963eab149578", "title": "Enabling High‐Performance Cloud Computing for Earth Science Modeling on Over a Thousand Cores: Application to the GEOS‐Chem Atmospheric Chemistry Model"}, {"paperId": "184e1556d52c4cb016999c2c4c64eb3b33c5a7ed", "title": "Enabling Immediate Access to Earth Science Models through Cloud Computing: Application to the GEOS-Chem Model"}, {"paperId": "39ee86e89d82fe9b53a5c310f8e40a8602bacdc1", "title": "Using Container Migration for HPC Workloads Resilience"}, {"paperId": "cd832397e509d263a575a76cde573131c939e8e0", "title": "Approaches of enhancing interoperations among high performance computing and big data analytics via augmentation"}, {"paperId": "86e022d5f530a360c17f575e6dc6893cf8c82297", "title": "A Container-Based Framework to Facilitate Reproducibility in Employing Stochastic Process Algebra for Modeling Parallel Computing Systems"}, {"paperId": "1001541b7d0495b1899602bb0236badaaad670d8", "title": "Containerization and Orchestration on HPC Systems"}, {"paperId": "876906023634895f580829d5ae2fbf9f4d5fe8ef", "title": "Efficient high-performance computing on the Amazon Web Services cloud with over a thousand cores: application to global atmospheric chemistry simulations at 50-km resolution with GEOS-Chem 12.3.2"}]}
