{"paperId": "0364c560ef6df44b207e8afc39159e93c9844d0d", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Prospects and Challenges of the Machine Learning and Data-Driven Methods for the Predictive Analysis of Power Systems: A Review", "abstract": "The use of machine learning and data-driven methods for predictive analysis of power systems offers the potential to accurately predict and manage the behavior of these systems by utilizing large volumes of data generated from various sources. These methods have gained significant attention in recent years due to their ability to handle large amounts of data and to make accurate predictions. The importance of these methods gained particular momentum with the recent transformation that the traditional power system underwent as they are morphing into the smart power grids of the future. The transition towards the smart grids that embed the high-renewables electricity systems is challenging, as the generation of electricity from renewable sources is intermittent and fluctuates with weather conditions. This transition is facilitated by the Internet of Energy (IoE) that refers to the integration of advanced digital technologies such as the Internet of Things (IoT), blockchain, and artificial intelligence (AI) into the electricity systems. It has been further enhanced by the digitalization caused by the COVID-19 pandemic that also affected the energy and power sector. Our review paper explores the prospects and challenges of using machine learning and data-driven methods in power systems and provides an overview of the ways in which the predictive analysis for constructing these systems can be applied in order to make them more efficient. The paper begins with the description of the power system and the role of the predictive analysis in power system operations. Next, the paper discusses the use of machine learning and data-driven methods for predictive analysis in power systems, including their benefits and limitations. In addition, the paper reviews the existing literature on this topic and highlights the various methods that have been used for predictive analysis of power systems. Furthermore, it identifies the challenges and opportunities associated with using these methods in power systems. The challenges of using these methods, such as data quality and availability, are also discussed. Finally, the review concludes with a discussion of recommendations for further research on the application of machine learning and data-driven methods for the predictive analysis in the future smart grid-driven power systems powered by the IoE.", "venue": "Energies", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-11", "journal": {"name": "Energies"}, "authors": [{"authorId": "10739486", "name": "W. Strielkowski"}, {"authorId": "2069962880", "name": "Andrey Vlasov"}, {"authorId": "116720404", "name": "K. Selivanov"}, {"authorId": "52219767", "name": "K. Muraviev"}, {"authorId": "2217066461", "name": "Vadim Shakhnov"}], "citations": [{"paperId": "b488dd842eb19d79f11e48876a016f00a7047c2b", "title": "Energy‐saving technologies and energy efficiency in the post‐COVID era"}, {"paperId": "ff2307c2cff0185dc0fe67c44c3de454e3f1e7cd", "title": "Integration of Carbon Dioxide Removal (CDR) Technology and Artificial Intelligence (AI) in Energy System Optimization"}, {"paperId": "c6fbb70d0b43b8384ebcf843adbc635289479b27", "title": "Assessing natural resources, rebounding trends, digital economic structure and green recovery dynamics in China"}, {"paperId": "f2bf1796fe2c8028056d998b22fd6313aa6f915b", "title": "Energy-saving technologies and energy efficiency in the post-pandemic world"}, {"paperId": "254a340512aadcedb9c0ac505ae7e97a81319b1d", "title": "Exploring role of green financing in blockchain markets for climate change mitigation in China"}, {"paperId": "4548f818d144eb2d06dd339054c9eb2db0d67607", "title": "Sustainability metrics of environmental sustainability in Iranian manufacturing sector: achieving through human resources"}, {"paperId": "76f3d14c2d917a9005477f61b00afaaf52dcddea", "title": "A comprehensive review of artificial intelligence and machine learning applications in energy consumption and production"}, {"paperId": "49da3df7788cdd414a7c058bbedb96ca3f9c17d5", "title": "APPLICATION OF MACHINE LEARNING ALGORITHMS TO PREDICT HOTEL OCCUPANCY"}, {"paperId": "f977036182332da5d308a2b3b22d3e9478569567", "title": "A risk evaluation model of electric power cloud platform from the information perspective based on fuzzy type-2 VIKOR"}]}
