{"paperId": "036923eb8d75e64b127e44b154d301678accf4fa", "publicationVenue": {"id": "a966c5e8-76dc-45c0-942a-3c7e41ac9b1a", "name": "International Conference on Computer Supported Cooperative Work in Design", "type": "conference", "alternate_names": ["Computer Supported Cooperative Work in Design", "Int Conf Comput Support Cooperative Work Des", "CSCWD", "Comput Support Cooperative Work Des"], "url": "http://www.cscwd.org/"}, "title": "Crowd Intelligent Grouping Collaboration Evacuation via Multi-agent Reinforcement Learning", "abstract": "The crowd evacuation strategy seeks to arrange crowd evacuation in an orderly manner to protect people’s lives and reduce property damage in case of sudden emergencies in crowded and complex places. In recent years, there have been several works to apply deep learning to crowd evacuation to make evacuation strategies more intelligent. However, existing researches rarely consider the integration of scene perception and crowd evacuation, which leads to evacuation methods that are detached from the scene and also ignore the crowd collaboration in the evacuation process. To this end, we propose Intelligent Crowd Evacuation Architecture based on Visual features using Multi-Agent Reinforcement Learning (ICEA-VMARL). Subsequently, we present modeling analysis on the crowd grouping and group evacuation modules of the architecture. First, we propose the Population Grouping algorithm based on Continuous Spatiotemporal individual Similarity (PGCSS), which combines crowd features to group crowds. Then, we propose a Group Collaborative Evacuation algorithm based on Multi-Agent Reinforcement Learning (GCE-MARL), which considers group collaboration while evacuating to achieve global optimal evacuation. Finally, we build an experimental crowd simulation system, and the results demonstrate that the crowd grouping algorithm and group evacuation algorithm proposed have better performance compared with other methods.", "venue": "International Conference on Computer Supported Cooperative Work in Design", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-24", "journal": {"name": "2023 26th International Conference on Computer Supported Cooperative Work in Design (CSCWD)", "pages": "796-801"}, "authors": [{"authorId": "2119311011", "name": "Yuan Tang"}, {"authorId": "2213162326", "name": "Xu Zhang"}, {"authorId": "2151036789", "name": "Rui Wang"}, {"authorId": "2173440913", "name": "Jinfeng Xu"}, {"authorId": "2145043431", "name": "Long Hu"}, {"authorId": "3015307", "name": "Yixue Hao"}], "citations": []}
