{"paperId": "036ae911c1abdb9fc072a18be090f27fa1784806", "publicationVenue": {"id": "3f7605a7-7e53-4ff7-8895-42f09a5f4355", "name": "Frontiers in Immunology", "type": "journal", "alternate_names": ["Front Immunol"], "issn": "1664-3224", "url": "http://www.frontiersin.org/immunology", "alternate_urls": ["https://www.frontiersin.org/journals/immunology", "http://journal.frontiersin.org/journal/immunology"]}, "title": "Intratumor microbiota as a novel potential prognostic indicator in mesothelioma", "abstract": "Introduction Despite increased attention on immunotherapy, primarily immune checkpoint blockade, as a therapeutic approach for mesothelioma (MMe), its efficacy and tolerability remain questioned. One potential explanation for different responses to immunotherapy is the gut and intratumor microbiota; however, these remain an underexplored facet of MMe. This article highlights the cancer intratumor microbiota as a novel potential prognostic indicator in MMe. Methods TCGA data on 86 MMe patients from cBioPortal underwent bespoke analysis. Median overall survival was used to divide patients into “Low Survivors” and “High Survivors”. Comparison of these groups generated Kaplan-Meier survival analysis, differentially expressed genes (DEGs), and identification of differentially abundant microbiome signatures. Decontamination analysis refined the list of signatures, which were validated as an independent prognostic indicator through multiple linear regression modelling and Cox proportional hazards modelling. Finally, functional annotation analysis on the list of DEGs was performed to link the data together. Results 107 genera signatures were significantly associated with patient survival (positively or negatively), whilst clinical characteristic comparison between the two groups demonstrated that epithelioid histology was more common in “High Survivors” versus biphasic in “Low Survivors”. Of the 107 genera, 27 had published articles related to cancer, whilst only one (Klebsiella) had MMe-related published articles. Functional annotation analysis of the DEGs between the two groups highlighted fatty acid metabolism as the most enriched term in “High Survivors”, whilst for “Low Survivors” the enriched terms primarily related to cell cycle/division. Linking these ideas and findings together is that the microbiome influences, and is influenced by, lipid metabolism. Finally, to validate the independent prognostic value of the microbiome, multiple linear regression modelling as well as Cox proportional hazards modelling were employed, with both approaches demonstrating that the microbiome was a better prognostic indicator than patient age or stage of the cancer. Discussion The findings presented herein, alongside the very limited literature from scoping searches to validate the genera, highlight the microbiome and microbiota as a potentially rich source of fundamental analysis and prognostic value. Further in vitro studies are needed to elucidate the molecular mechanisms and functional links that may lead to altered survival.", "venue": "Frontiers in Immunology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-14", "journal": {"name": "Frontiers in Immunology", "volume": "14"}, "authors": [{"authorId": "5524657", "name": "F. Pentimalli"}, {"authorId": "101989836", "name": "M. Krstic-Demonacos"}, {"authorId": "49701930", "name": "Caterina Costa"}, {"authorId": "6378136", "name": "L. Mutti"}, {"authorId": "8306974", "name": "E. Bakker"}], "citations": [{"paperId": "45f3712b8285ee5c49967df83f6a1582e8288db7", "title": "Broadening oncological boundaries: the intratumoral microbiota."}]}
