{"paperId": "036be53a45fce6f19d4ddc9835ce45503a7ce414", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "An Automatic Hierarchical Clustering Method for the LiDAR Point Cloud Segmentation of Buildings via Shape Classification and Outliers Reassignment", "abstract": "Shape segmentation in urban environments forms the foundation for tasks such as classification and reconstruction. Most artificial buildings with complex structures are composed of multiple simple geometric primitives. Based on this assumption, this paper proposes a divisive hierarchical clustering algorithm that uses shape classification and outliers reassignment to segment LiDAR point clouds in order to effectively identify the various shapes of structures that make up buildings. The proposed method adopts a coarse-to-fine strategy. Firstly, based on the geometric properties of different primitives in a Gaussian sphere space, coarse extraction is performed using Gaussian mapping and the DBSCAN algorithm to identify the primary structure of various shapes. Then, the error functions are constructed after parameterizing the recognized shapes. Finally, a minimum energy loss function is built by combining the error functions and binary integer programming (BIP) to redistribute the outlier points. Thereby, the accurate extraction of geometric primitives is achieved. Experimental evaluations on real point cloud datasets show that the indicators of precision, accuracy, and F1 score of our method are 0.98, 0.95, and 0.96 (point assignment) and 0.97, 0.95, and 0.95 (shape recognition), respectively. Compared with other state-of-the-art methods, the proposed method can efficiently segment planar and non-planar structures with higher quality from building point clouds.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-05", "journal": {"name": "Remote. Sens.", "pages": "2432", "volume": "15"}, "authors": [{"authorId": "2145757672", "name": "Feng Wang"}, {"authorId": "2153104793", "name": "Guoqing Zhou"}, {"authorId": "2153624275", "name": "Jiali Xie"}, {"authorId": "32055380", "name": "B. Fu"}, {"authorId": "9735209", "name": "H. You"}, {"authorId": "2184419778", "name": "Jianjun Chen"}, {"authorId": "2216708806", "name": "Xue Shi"}, {"authorId": "2115370775", "name": "Bowen Zhou"}], "citations": [{"paperId": "8dafc15e808425b23d683744e52e1d2c402beee8", "title": "Vehicle Detection and Attribution from a Multi-Sensor Dataset Using a Rule-Based Approach Combined with Data Fusion"}, {"paperId": "6fb8efcadbca6acccb1acb7b89dc8f8ba67ff5e8", "title": "An Unsupervised, Open-Source Workflow for 2D and 3D Building Mapping From Airborne LiDAR Data"}]}
