{"paperId": "036d5a770c8b0751b9a0e3c4163540cf087f905a", "publicationVenue": null, "title": "Big-Parallel-ETL: New ETL for Multidimensional NoSQL Graph Oriented Data", "abstract": "The quantitative explosion of digital data derived from social networks, smart devices, IoT sensors, etc is eventuated by the Big Data concept considered as a very important aspect in the performance improvement of traditional decision-making systems since it reveals serious challenges to be addressed. Therefore, the main purpose of this research paper is the integration of NoSQL Graph-oriented Data into Data Warehouse to deal with Big Data challenges especially with the absence of similar approaches to the best of our knowledge. In this paper, we propose a new approach called Big-Parallel-ETL that aims to adapt the classical ETL process (Extract-Transform-Load) with Big Data technologies to accelerate data handling based on the famous MapReduce concept characterized by its efficient parallel processing feature. Our solution proposes a set of detailed Algorithms based on several rules able to conceive rapidly and efficiently the target multidimensional structure (dimensions and facts) from the NoSQL Graph oriented database.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-01-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1743"}, "authors": [{"authorId": "26981542", "name": "N. Soussi"}], "citations": [{"paperId": "84afcdcc0d42ff7b6cbf5e53a320cf0fce5f6612", "title": "A Model for Enhancing Unstructured Big Data Warehouse Execution Time"}, {"paperId": "863e534d812f040e78f7b75e0fa0b0b1d9f7156e", "title": "Investigation of Graph Modeling for Data Virtualization of SQL and NoSQL Databases"}, {"paperId": "711c0f54ea1d563e8693dacb039e4c2dc70acd94", "title": "Extending The Data Integration Model As The Foundation Of Business Intelligence: A Systematic Literature Review"}, {"paperId": "5a310852d3eb38d67c43dc2080cc7f72da8b3f48", "title": "Decision-Tree-Based Horizontal Fragmentation Method for Data Warehouses"}, {"paperId": "c0b6f19a4ea6d4223d5e3b1bb4518ef3a186c4ee", "title": "New Approach based on Association Rules for Building and Optimizing OLAP Cubes on Graphs"}]}
