{"paperId": "037e9b116725741c34dc56c8bad6ce20650635cb", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Fuzzy Deep Q-learning Task Offloading in Delay Constrained Vehicular Fog Computing", "abstract": "In the age of the ever-growing number of tasks being generated from IoT devices, one of the most crucial problems with enhancing the Quality of Service in multi-access computing is the system's limited resources. To this end, Vehicular Fog Computing (VFC) has emerged as a potential solution that utilizes the idle resources of vehicles to reduce the load imposed on the edge servers. In this paper, we leverage the advantages of both deep reinforcement learning and Fuzzy logic to propose Fuzzy Deep Q-learning base Offloading scheme (FDQO), a real-time offloading scheme in delay constrained VFC. Our objective is to maximize the Quality of Experiences (QoE), which indicates how the task meets its delay constraint. The experiment results show that our proposed approach significantly outperforms the existing algorithms. Specifically, FDQO improves the average QoE by 37.72% compared to using only Deep Q-learning, 7.47% compared to using only Fuzzy logic, and 19% compared to the ∊ -greedy strategy for multi-armed bandits.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-18", "journal": {"name": "2021 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-8"}, "authors": [{"authorId": "34048851", "name": "D. Son"}, {"authorId": "2127777100", "name": "Vu Tri An"}, {"authorId": "1989048043", "name": "Trinh Thu Hai"}, {"authorId": "1698513", "name": "B. Nguyen"}, {"authorId": "35239065", "name": "Phi-Le Nguyen"}, {"authorId": "3359343", "name": "Huynh Thi Thanh Binh"}], "citations": [{"paperId": "ec10ea170ebcfdbaf1384ca132ea7ff424f4a1f4", "title": "Reinforcement Learning for Optimizing Delay-Sensitive Task Offloading in Vehicular Edge–Cloud Computing"}, {"paperId": "30ee463a2fb2a1b1d3f5f616e8a35b7d9aeb7d9a", "title": "GAPRO: An Adaptive User-centric Resource Allocation and Task Offloading Strategy for Multi-access Edge Computing"}, {"paperId": "f224bd813cddfdcdd18388e07441bb0b0b9b0a92", "title": "A Collaborative Computation and Offloading for Compute-Intensive and Latency-Sensitive Dependency-Aware Tasks in Dew-Enabled Vehicular Fog Computing: A Federated Deep Q-Learning Approach"}, {"paperId": "edda423894509f02a9d756e36a53f0123227fb93", "title": "Reinforcement-Learning-Based Deadline Constrained Task Offloading Schema for Energy Saving in Vehicular Edge Computing System"}, {"paperId": "2ce6f45d2f504bbe73f194ce2c9a38a8d6051f97", "title": "EVOLUTIONARY ALGORITHM FOR TASK OFFLOADING IN VEHICULAR FOG COMPUTING"}, {"paperId": "0bd4c7ff9ad5337bc5efce8d925267809d89538c", "title": "Latency-Aware Task Scheduling for IoT Applications Based on Artificial Intelligence with Partitioning in Small-Scale Fog Computing Environments"}, {"paperId": "dac6e662c83cf5c9f5ba5559f2f27217241dee49", "title": "Fuzzy-Assisted Mobile Edge Orchestrator and SARSA Learning for Flexible Offloading in Heterogeneous IoT Environment"}, {"paperId": "e408af9c5f68beb9838532405cd0abba86681cb9", "title": "Offloading Mechanisms Based on Reinforcement Learning and Deep Learning Algorithms in the Fog Computing Environment"}, {"paperId": "17702c77df55b81c5f6719e7aa134b9210843089", "title": "Fuzzy Theory in Fog Computing: Review, Taxonomy, and Open Issues"}]}
