{"paperId": "037ea200fff605ddb1cfa8c1e7b9cce61a1d4c5c", "publicationVenue": {"id": "6649718c-87e9-410c-8aaf-2c67b51badc2", "name": "Journal of Business and Social Development", "type": "journal", "alternate_names": ["JOURNAL OF BUSINESS AND SOCIAL DEVELOPMENT", "J BUS SOC DEV", "J Bus Soc Dev"], "issn": "2600-9668", "alternate_issns": ["2289-2915"]}, "title": "KEPERLUAN PEMBINAAN MODEL PENGURUSAN DATA RAYA PEJABAT PENDIDIKAN DAERAH DI MALAYSIA", "abstract": ": The Industrial Revolution 4.0 which started in 2016 brought changes in various sectors and fields including education and big data is one of the elements of RI 4.0. Huge amounts of big data from the maximum use of digital systems demands a systematic and efficient management to improve the quality of education. The District Transformation Program (DTP 3.0) is one of the MoE’s programs that aims to improve the quality of education according to RI 4.0. Nevertheless, the results of the PKPPD report in DTP 3.0 showed that the management of big data in PPD does not reach the set standards. Therefore, a study was conducted to identify the need and importance of developing a PPD big data management model in Malaysia. A total of 10 big data personnel from 10 PPDs in different states were interviewed. The findings of the study showed that there are seven requirements and three importances of developing the PPD big data management model in Malaysia. Therefore, there is a need for the development of a big data management model in PPD as a guide and reference for all PPD’s big data personnnel in Malaysia.", "venue": "Journal of Business and Social Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-31", "journal": {"name": "JOURNAL OF BUSINESS AND SOCIAL DEVELOPMENT"}, "authors": [{"authorId": "120665028", "name": "Nordin Mohamad"}, {"authorId": "2264144438", "name": "Norfariza MOHD RAZI"}, {"authorId": "2060553461", "name": "Zuraidah Abdullah"}], "citations": []}
