{"paperId": "037f6cbd6a73578d08b19ca7c20befa3d7c8d16e", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Cost-Aware Partitioning for Efficient Large Graph Processing in Geo-Distributed Datacenters", "abstract": "Graph processing is an emerging computation model for a wide range of applications and graph partitioning is important for optimizing the cost and performance of graph processing jobs. Recently, many graph applications store their data on geo-distributed datacenters (DCs) to provide services worldwide with low latency. This raises new challenges to existing graph partitioning methods, due to the multi-level heterogeneities in network bandwidth and communication prices in geo-distributed DCs. In this article, we propose an efficient graph partitioning method named Geo-Cut, which takes both the cost and performance objectives into consideration for large graph processing in geo-distributed DCs. Geo-Cut adopts two optimization stages. First, we propose a cost-aware streaming heuristic and utilize the one-pass streaming graph partitioning method to quickly assign edges to different DCs while minimizing inter-DC data communication cost. Second, we propose two partition refinement heuristics which identify the performance bottlenecks of geo-distributed graph processing and refine the partitioning result obtained in the first stage to reduce the inter-DC data transfer time while satisfying the budget constraint. Geo-Cut can be also applied to partition dynamic graphs thanks to its lightweight runtime overhead. We evaluate the effectiveness and efficiency of Geo-Cut using real-world graphs with both real geo-distributed DCs and simulations. Evaluation results show that Geo-Cut can reduce the inter-DC data transfer time by up to 79 percent (42 percent as the median) and reduce the monetary cost by up to 75 percent (26 percent as the median) compared to state-of-the-art graph partitioning methods with a low overhead.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1707-1723", "volume": "31"}, "authors": [{"authorId": "2494447", "name": "Amelie Chi Zhou"}, {"authorId": "87275182", "name": "B. Shen"}, {"authorId": "2116642787", "name": "Yao Xiao"}, {"authorId": "2629067", "name": "Shadi Ibrahim"}, {"authorId": "143824511", "name": "Bingsheng He"}], "citations": [{"paperId": "919a58ea7ec73db460b0ba4c56a3c570487657cf", "title": "Bifrost: Extending RoCE for Long Distance Inter-DC Links"}, {"paperId": "7e18f02a7097b8a56182a44dbe243a10b11f95cf", "title": "DAG-Aware Optimization for Geo-Distributed Data Analytics"}, {"paperId": "c1928f42ad6293562df6078b83adef1e78bd224e", "title": "Tango: Rethinking Quantization for Graph Neural Network Training on GPUs"}, {"paperId": "8647292714bc2cd939291b5b1c8ab7fc71844ee8", "title": "Lightweight Streaming Graph Partitioning by Fully Utilizing Knowledge from Local View"}, {"paperId": "03555712697aea1fd572472d06116ea42db7156c", "title": "Algorithms for tree-shaped task partition and allocation on heterogeneous multiprocessors"}, {"paperId": "65f60c5e390bc5eaf639fa49c5b9e6ce55dd3af5", "title": "VSCT algorithm for graph partitioning based on volume, size, cuts and time"}, {"paperId": "393a02cd0d8cfb0f0a2ae26df71d0316d482beee", "title": "Geo-Distributed IoT Data Analytics With Deadline Constraints Across Network Edge"}, {"paperId": "eb4f4c96430b41a81bd6a8be1ee3ee7d436d11e0", "title": "SDN-enabled Resource Provisioning Framework for Geo-Distributed Streaming Analytics"}, {"paperId": "9cf78f7e256600e94e6a12a693f88e6514d769af", "title": "PGPregel: an end-to-end system for privacy-preserving graph processing in geo-distributed data centers"}, {"paperId": "e1e5a31cd1ad95688953a9dba9a9c63708e4f824", "title": "Adaptive Partitioning for Large-Scale Graph Analytics in Geo-Distributed Data Centers"}, {"paperId": "3190a8eaffb50a9672d5710c07f8dc07689da7aa", "title": "Privacy-preserving workflow scheduling in geo-distributed data centers"}, {"paperId": "f751e163dcef8e078e6ba60308d8690f69811e35", "title": "DMRO: A Deep Meta Reinforcement Learning-Based Task Offloading Framework for Edge-Cloud Computing"}, {"paperId": "7c033a4e4334d18474c3fbf4b7d277d576f15d91", "title": "A game-theoretic approach for cost-aware load balancing in distributed systems"}, {"paperId": "9129cf20d003beb16df97dbbd5f74c1d608fd1c9", "title": "Project-Team STACK Software Stack for Massively Geo-Distributed Infrastructures"}]}
