{"paperId": "0392b95f21a6d463b9498f3d7b52143584f07afe", "publicationVenue": null, "title": "Development approach for value-creating service process twins based on service design methods", "abstract": "Adopting the digital twin concept in the industry has revealed its potential for value-creation in production and operations. At the same time, the idea of a digital twin is also being discussed in many other business areas. One of these is after-sales service, where the digital twin is attractive from two aspects. On the one hand, as a source of knowledge to better understand the customers’ problems. On the other hand, digital twins may help manage service operations themselves. However, building such a service process twin with limited resources and capabilities is not trivial. Moreover, managing service operations transparently can be complex and demanding. Therefore, it is essential to focus on the solutions that generate the most value for customers and providers. Based on literature research and previous projects with similar problem settings, this paper presents a method to build such service process twins. Thereby, service blueprints and agent-based simulation play a significant role. The presented systematic approach has been tested and continuously improved in two projects with companies in different industries. However, current research showed room for improvement concerning the detail level of service blueprints and their interrelationship with the simulation models.", "venue": "2022 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-12", "journal": {"name": "2022 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "pages": "1-6"}, "authors": [{"authorId": "119454578", "name": "Lukas Schweiger"}, {"authorId": "2153881547", "name": "Rodolfo Benedech"}, {"authorId": "2382338", "name": "J. Meierhofer"}], "citations": [{"paperId": "00eff4f2ae6f0c6795317a696eb1b991001ff096", "title": "From data to value in smart waste management: Optimizing solid waste collection with a digital twin-based decision support system"}]}
