{"paperId": "03992f74d74c08b46b568306da64a2333086b1fb", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Large-Scale Landslide Susceptibility Mapping Using an Integrated Machine Learning Model: A Case Study in the Lvliang Mountains of China", "abstract": "Integration of different models may improve the performance of landslide susceptibility assessment, but few studies have tested it. The present study aims at exploring the way to integrating different models and comparing the results among integrated and individual models. Our objective is to answer this question: Will the integrated model have higher accuracy compared with individual model? The Lvliang mountains area, a landslide-prone area in China, was taken as the study area, and ten factors were considered in the influencing factors system. Three basic machine learning models (the back propagation (BP), support vector machine (SVM), and random forest (RF) models) were integrated by an objective function where the weight coefficients among different models were computed by the gray wolf optimization (GWO) algorithm. 80 and 20% of the landslide data were randomly selected as the training and testing samples, respectively, and different landslide susceptibility maps were generated based on the GIS platform. The results illustrated that the accuracy expressed by the area under the receiver operating characteristic curve (AUC) of the BP-SVM-RF integrated model was the highest (0.7898), which was better than that of the BP (0.6929), SVM (0.6582), RF (0.7258), BP-SVM (0.7360), BP-RF (0.7569), and SVM-RF models (0.7298). The experimental results authenticated the effectiveness of the BP-SVM-RF method, which can be a reliable model for the regional landslide susceptibility assessment of the study area. Moreover, the proposed procedure can be a good option to integrate different models to seek an “optimal” result.", "venue": "Frontiers in Earth Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-08-17", "journal": {"volume": "9"}, "authors": [{"authorId": "2072727626", "name": "Yin Xing"}, {"authorId": "144780923", "name": "J. Yue"}, {"authorId": "46673133", "name": "Zizheng Guo"}, {"authorId": "2144354321", "name": "Yang Chen"}, {"authorId": "2109422502", "name": "Jia Hu"}, {"authorId": "9850322", "name": "A. Travé"}], "citations": [{"paperId": "c94a2a5b4e32644f5cb159ad6ba93db1bdd49b17", "title": "Comparison of Statistical and Machine-Learning Model for Analyzing Landslide Susceptibility in Sumedang Area, Indonesia"}, {"paperId": "6ac06f21867a68d9c1c0f5c1f3388b1858d40402", "title": "Optimizing landslide susceptibility mapping using machine learning and geospatial techniques"}, {"paperId": "26caa8b077c363113503e66d9711805f5b7b4759", "title": "A comparative evaluation of landslide susceptibility mapping using machine learning-based methods in Bogor area of Indonesia"}, {"paperId": "a5328c5cfbe30bf56a1f4bb39794d6f3dc4b6b33", "title": "Landslide Hazard Assessment in the Heterogeneous Geomorphological and Environmental Context of the Rif Region, Morocco – A Machine Learning Approach"}, {"paperId": "de00666599502195e8076f4ef6aa2027292bf671", "title": "Development and assessment of a novel hybrid machine learning-based landslide susceptibility mapping model in the Darjeeling Himalayas"}, {"paperId": "4e5bebb33d9e8ea3048e14205028b6156b19fd2a", "title": "Mitigating Landslide Hazards in Qena Governorate of Egypt: A GIS-based Neutrosophic PAPRIKA Approach"}, {"paperId": "bcd50ce6a6232f94078d36812ab83eab1bb4e658", "title": "Analysis of Optimal Buffer Distance for Linear Hazard Factors in Landslide Susceptibility Prediction"}, {"paperId": "0b6e5b414b71f83681a5382240795586a73c975c", "title": "Research on the Uncertainty of Landslide Susceptibility Prediction Using Various Data-Driven Models and Attribute Interval Division"}, {"paperId": "a73eb08871120929708fc8e20a0a64899d3b15e7", "title": "SBAS-InSAR based validated landslide susceptibility mapping along the Karakoram Highway: a case study of Gilgit-Baltistan, Pakistan"}, {"paperId": "147c8093f953b844be10e499fc1deddff7300cc5", "title": "Application of convolutional neural networks based on Bayesian optimization to landslide susceptibility mapping of transmission tower foundation"}, {"paperId": "4ba1def0f5ada61d2f1b9eb5aed6e6c9c77695ac", "title": "Implementation of free and open-source semi-automatic feature engineering tool in landslide susceptibility mapping using the machine-learning algorithms RF, SVM, and XGBoost"}, {"paperId": "a0a569649539e410d1ee0b41178c09022184d630", "title": "The Use of High-Resolution Remote Sensing Data in Preparation of Input Data for Large-Scale Landslide Hazard Assessments"}, {"paperId": "1fdebf461e2fb12fb0ff5b1c15fe2932800cc293", "title": "Investigation of the effects of hybrid modeling approaches, factor standardization, and categorical mapping on the performance of landslide susceptibility mapping in Van, Turkey"}, {"paperId": "8820b11e0c127c2e57ca9e614fe4999ec6ad4766", "title": "The Role of Citrus Groves in Rainfall-Triggered Landslide Hazards in Uwajima, Japan"}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "5d52846a61235ca13549a751589087910bc64869", "title": "Large-scale landslide inventory and their mobility in Lvliang City, Shanxi Province, China"}, {"paperId": "2c4c9e1eaa2ddc25154ad2e8d9070846bcf3447a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Danish Case Study"}, {"paperId": "8159159b6ea4cbc02f30a57e1b68af820098d867", "title": "Landslide susceptibility mapping using weights of evidence model on the slopes of Mount Elgon, eastern Uganda"}, {"paperId": "bd9efe081cf2a345261511ec76952c12881e177a", "title": "Landslide susceptibility mapping using CNN-1D and 2D deep learning algorithms: comparison of their performance at Asir Region, KSA"}, {"paperId": "b4f43c15a074dc91f8e0cd4e25e31f724a4f43e7", "title": "A Comparative Assessment of Machine Learning Models for Landslide Susceptibility Mapping in the Rugged Terrain of Northern Pakistan"}, {"paperId": "468c373a25ce12346fb8d433532811bf6167a319", "title": "Influence of sampling design on landslide susceptibility modeling in lithologically heterogeneous areas"}, {"paperId": "ebf667d18421e2cba41c03950b64855c2880a2e7", "title": "Review of landslide susceptibility assessment based on knowledge mapping"}, {"paperId": "9425887e1006515bdb20775c64e136b234102fa9", "title": "Integrating Multivariate (GeoDetector) and Bivariate (IV) Statistics for Hybrid Landslide Susceptibility Modeling: A Case of the Vicinity of Pinios Artificial Lake, Ilia, Greece"}, {"paperId": "c4487a2b78540bc724b6cf83722e7c6619bc26a6", "title": "Development and Assessment of GIS- B ased Landslide Susceptibility Mapping Models Using ANN, Fuzzy-AHP, and MCDA in Darjeeling Himalayas, West Bengal, India"}]}
