{"paperId": "03a404f9a75f309901f57adf915b37939219993e", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "Storage and Rack Sensitive Replica Placement Algorithm for Distributed Platform with Data as Files", "abstract": "Distributed File System (DFS) is a key component in cloud and data center networking. Frequent hardware failure and network bottlenecks in the underlying infrastructure degrade the performance significantly. Replica technique provides enhanced fault tolerance by storing multiple replicas of a single data block. In the Hadoop platform, the Hadoop Distributed File System (HDFS) handles data storage and provides replica placement services. The Default HDFS replica engine adopts a simple rack aware policy and is designed to improve fault tolerance by storing data blocks in multiple racks. However, the HDFS replica engine does not consider key performance indicators of data center resources such as rack utilization and node storage utilization. Furthermore, in HDFS data is stored as uniformly divided small-sized blocks, which increases traffic flow during the entire file access, therefore degrading the response time. In this research, we propose a Storage and Rack Sensitive (SRS) replica placement algorithm that aims at improving the rack and storage utilization of data center resources. The proposed algorithm also attempts to optimize traffic flow during file access by storing data as original files instead of small uniform blocks. Experimental results of the proposed SRS algorithm are compared against the default HDFS replica distribution and significant improvement on rack-utilization and storage-utilization were observed. Furthermore, latest literature confirms that the “Data as a File” approach indeed decreases the amount of data flow caused by file access traffic.", "venue": "International Conference on Communication Systems and Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-01-01", "journal": {"name": "2020 International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "535-538"}, "authors": [{"authorId": "1557583173", "name": "Vinay Venkataramanachary"}, {"authorId": "1395043376", "name": "Enrique Reveron"}, {"authorId": "38414070", "name": "Wei Shi"}], "citations": [{"paperId": "a88e445818229761d300f481abdfac223d62ef7e", "title": "TADRP: Toward Thermal-Aware Data Replica Placement in Data-Intensive Data Centers"}, {"paperId": "2996f72c980b214335d2005336dc46c40f6e2917", "title": "TS-REPLICA: A novel replica placement algorithm based on the entropy weight TOPSIS method in spark for multimedia data analysis"}, {"paperId": "7054a2f39bd251ebdb72f21ffaf6cb4d772979c0", "title": "A Thermal-Aware Data Replica Placement Strategy for Data-Intensive Data Centers"}, {"paperId": "ecf46e819b9989b47155cdfa506da84294079db3", "title": "New Data Placement Strategy in the HADOOP Framework"}]}
