{"paperId": "03e96692521f89e374b1b74648cc6bd16aa48b36", "publicationVenue": null, "title": "IEEE BigData 2019 Cup: Suspicious Network Event Recognition", "abstract": "“IEEE BigData 2019 Cup: Suspicious Network Event Recognition” was a data mining competition organized jointly by companies Security On-Demand and QED Software at the KnowledgePit online platform, in association with the IEEE BigData 2019 conference. The scope of this challenge referred to the notions of cybersecurity analytics and network alert evaluation. In this paper, we summarize the results of our competition. We explain how data sets had been prepared before it was possible to make them available to competition participants. We describe the baseline scoring models that we designed as a reference for participants, and we demonstrate how critical for their performance was the aspect of appropriate feature engineering. We also discuss the results of experiments conducted to verify the (un)suitability of deep recurrent neural networks in this particular case. In some sense, we show that there are no “perfect” machine learning approaches that could be applied equally successfully to every data science undertaking.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "5881-5887"}, "authors": [{"authorId": "2434014", "name": "Andrzej Janusz"}, {"authorId": "1505832696", "name": "Daniel Kaluza"}, {"authorId": "1409256143", "name": "Agnieszka Chadzynska-Krasowska"}, {"authorId": "1505826462", "name": "Bartek Konarski"}, {"authorId": "49366058", "name": "Joel Holland"}, {"authorId": "145514740", "name": "D. Ślęzak"}], "citations": [{"paperId": "1ab60ee99e134c766fbddc51bb60b7e23aabbb4c", "title": "IEEE BigData Cup 2023 Report: Object Recognition with Muon Tomography Using Cosmic Rays"}, {"paperId": "be48c946c71e7604399e4050ac7e555c0b949cba", "title": "Spotting Cyber Breaches in IoT Devices"}, {"paperId": "cefa31e7b935f2cae9d039b1456515d36f8cf76c", "title": "Cybersecurity Threat Detection in the Behavior of IoT Devices: Analysis of Data Mining Competition Results"}, {"paperId": "1ce03e114d421523065ee92d9774085fe7653913", "title": "Robust Assignment of Labels for Active Learning with Sparse and Noisy Annotations"}, {"paperId": "8c317e974ca3a935e3d68e604d5f06355f25e2a8", "title": "Predicting Frags in Tactic Games at KnowledgePit.ai: ICME 2023 Grand Challenge Report"}, {"paperId": "ec16a25d9dffbe2b6a4f4bbe775a0dc544fe04ae", "title": "BrightBox - A rough set based technology for diagnosing mistakes of machine learning models"}, {"paperId": "d7c27681e432c32b960710ce9e24c6dcc3899e96", "title": "IEEE BigData Cup 2022 Report Privacy-preserving Matching of Encrypted Images"}, {"paperId": "00758c751060698d3ad2e3878782fe26c133acbb", "title": "Rough Sets Turn 40: From Information Systems to Intelligent Systems"}, {"paperId": "81254b668d111d825441cc4c077c23525852efc1", "title": "KnowledgePit Meets BrightBox: A Step Toward Insightful Investigation of the Results of Data Science Competitions"}, {"paperId": "f80c8d5e8f91bf160e00052f4d5dbc7e418b3ffc", "title": "Application of Diversified Ensemble Learning in Real-life Business Problems: The Case of Predicting Costs of Forwarding Contracts"}, {"paperId": "128eb49adf1c48f82bdb1870385acb899b822595", "title": "PriveTAB: Secure and Privacy-Preserving sharing of Tabular Data"}, {"paperId": "93e64e090c5d51ae70df240b918401c13642aeb0", "title": "Functionality-Preserving Adversarial Machine Learning for Robust Classification in Cybersecurity and Intrusion Detection Domains: A Survey"}, {"paperId": "1f69a3151c82c754aef232cde9cdfb2529657c68", "title": "FGMD: A robust detector against adversarial attacks in the IoT network"}, {"paperId": "d81941e536b2f2d190534da334c57396129f8b5c", "title": "Adversarial Machine Learning In Network Intrusion Detection Domain: A Systematic Review"}, {"paperId": "da9990bac914ff0f345f0f26d81de2c82536fdb6", "title": "Modeling Realistic Adversarial Attacks against Network Intrusion Detection Systems"}, {"paperId": "74f9884f47c8678e0e889c65ac28b87e1ab62c39", "title": "Predicting Escalations in Customer Support: Analysis of Data Mining Challenge Results"}, {"paperId": "e7a8766a21fea913308d440515185943babfb92c", "title": "Reinventing Infobright’s Concept of Rough Calculations on Granulated Tables for the Purpose of Accelerating Modern Data Processing Frameworks"}, {"paperId": "cecb47de66f63ebbed0c6e69ffddba5c200f37bf", "title": "Predicting escalations in customer support with gradient boosting at the IEEE BigData 2020 Cup"}, {"paperId": "1ec63b25e4075007d3fb38f12276a731cfbf366f", "title": "Using Knowledge Graphs and Reinforcement Learning for Malware Analysis"}, {"paperId": "e53c73a7f54a6fab7a22564cb3de97b14a50e51f", "title": "A Hybrid Machine Learning Framework of Gradient Boosting Decision Tree and Sequence Model for Predicting Escalation in Customer Support"}, {"paperId": "4598f08116a1da9839800a060fba0a4e25a765ff", "title": "Approximate Decision Tree Induction over Approximately Engineered Data Features"}, {"paperId": "e3518a27e35fa088aedb3d71705145d97637599f", "title": "NAttack! Adversarial Attacks to bypass a GAN based classifier trained to detect Network intrusion"}, {"paperId": "16e22348097a100e1059bc042925ce19e6302b38", "title": "IEEE BigData 2019 Cup: Binary Classification via Tensor Completion"}, {"paperId": "8b1bf36bfaa3cb184737803967a540155c8a6b4e", "title": "Gradient boosting decision trees for cyber security threats detection based on network events logs"}, {"paperId": "d97dd27e2edd473c3746b71a3d9d010910f5c18f", "title": "An Ensemble Approach for Suspicious Traffic Detection from High Recall Network Alerts"}, {"paperId": "e9da445cee0dffa517807755aaa02333c758e59a", "title": "Suspicious Network Event Recognition Leveraging on Machine Learning"}, {"paperId": "97ec585129aec6ca9069c2b9365e34e245d45797", "title": "An Approach for Scale Suspicious Network Events Detection"}, {"paperId": "ccf9b4288f59ea8539f7b8ad9a0f761f4f957f23", "title": "An Apriori-based Data Analysis on Suspicious Network Event Recognition"}, {"paperId": "ebe76cb458204bb54d076ea3bf24eed2bca70832", "title": "Application of XGBoost to the cyber-security problem of detecting suspicious network traffic events"}, {"paperId": "f36dfe914551d0357d4d4a0829c1e1201026f692", "title": "Identifying Truly Suspicious Events and False Alarms Based on Alert Graph"}, {"paperId": "f3f9f5af78c1483d4d13f96e026ac8fa2e97d1e9", "title": "Naive Transfer Learning Approaches for Suspicious Event Prediction"}, {"paperId": "909d848b9634f2dd335beeeaa9e61bf246255fe2", "title": "Anomaly-Based Intrusion on IoT Networks Using AIGAN-a Generative Adversarial Network"}, {"paperId": "427c808c63ea73ba52cec67c7c0a7e6be69cb2cc", "title": "Rough Sets: International Joint Conference, IJCRS 2020, Havana, Cuba, June 29 – July 3, 2020, Proceedings"}, {"paperId": "84398cc46dd00e9ad8b9b42d27b21627e3c1248d", "title": "AINTUITIONISTIC FUZZY C-MEANS CLUSTERING BASED FEATURE SELECTION AND ENSEMBLE SUPPORT VECTOR MACHINE FRAMEWORK FOR BIG DATA CYBER-SECURITY"}]}
