{"paperId": "03ebdb383d9cfafec50fb38247178fa66cd50b61", "publicationVenue": {"id": "d9658953-63d4-4ed9-a950-9f0c2745c5e2", "name": "International Symposium on Applied Computational Intelligence and Informatics", "type": "conference", "alternate_names": ["Symp Appl Comput Intell Informatics", "Int Symp Appl Comput Intell Informatics", "SACI", "Symposium on Applied Computational Intelligence and Informatics"]}, "title": "Implementing a Platform to Run Clustering Algorithms Using Distributed Computing", "abstract": "Most of the clustering algorithms are designed to work as a sequential algorithm that requires all data to be present, which limits the actual implementation to run on a single machine and does not support horizontal scalability. This is problematic in today’s context when volume of data gets larger each day and the need to process data quickly is essential. Hence, in this paper we propose a platform that allows running clustering algorithms in a distributed manner. This is achieved through splitting the data into smaller and equal partitions, and through redesigning the original clustering algorithms to allow working on a sub-set of the input data without having to interact with the processing of the rest of the input data. At the end the so-called reduce phase aggregates the partial results obtained from processing each partition and it produces the global result.", "venue": "International Symposium on Applied Computational Intelligence and Informatics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "2019 IEEE 13th International Symposium on Applied Computational Intelligence and Informatics (SACI)", "pages": "217-222"}, "authors": [{"authorId": "3081594", "name": "I. Borlea"}, {"authorId": "3233247", "name": "D. Iercan"}, {"authorId": "1694319", "name": "R. Precup"}, {"authorId": "39838729", "name": "Florin Dragan"}, {"authorId": "103035036", "name": "Alexandra-Bianca Borlea"}], "citations": [{"paperId": "e928f176525dc969ac95eca08b6caa08e9709d19", "title": "A Unified Form of Fuzzy C-Means and K-Means algorithms and its Partitional Implementation"}, {"paperId": "cc286c452bc893fbd3577dd56c35cf967388782b", "title": "Extending BigTim Distributed Clustering Platform to Support Mobile Devices"}]}
