{"paperId": "03f949e2a2c0cdc4eb72f47c8f3e7e5d1c3731c2", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Synopsis: A Distributed Sketch over Voluminous Spatiotemporal Observational Streams", "abstract": "Networked observational devices have proliferated in recent years, contributing to voluminous data streams from a variety of sources and problem domains. These streams often have a spatiotemporal component and include multidimensional features of interest. Processing such data in an offline fashion using batch systems or data warehouses is costly from both a storage and computational standpoint, and in many situations the insights derived from the data streams are useful only if they are timely. In this study, we propose Synopsis, an online, distributed sketch that is constructed from voluminous spatiotemporal data streams. The sketch summarizes feature values and inter-feature relationships in memory to facilitate real-time query evaluations and to serve as input to computations expressed using analytical engines. As the data streams evolve, Synopsis performs targeted dynamic scaling to ensure high accuracy and effective resource utilization. We evaluate our system in the context of two real-world spatiotemporal datasets and demonstrate its efficacy in both scalability and query evaluations.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-11-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "2552-2566", "volume": "29"}, "authors": [{"authorId": "3438590", "name": "Thilina Buddhika"}, {"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "a6c0f117aa2b6d79add428bd9d87e31eab07cda9", "title": "A Framework for Profiling Spatial Variability in the Performance of Classification Models"}, {"paperId": "f50b807f3b0bc2021c2c91c3b6e58f5a98ef84ec", "title": "Rubiks: Rapid Explorations and Summarization over High Dimensional Spatiotemporal Datasets"}, {"paperId": "9518d377479c1388af901783259ad696952ac0a1", "title": "Enabling Fast, Effective Visualization of Voluminous Gridded Spatial Datasets"}, {"paperId": "9dee03bf481d77bab9b4ec3e2d5d72df660786d7", "title": "Radix+: High‐throughput georeferencing and data ingestion over voluminous and fast‐evolving phenotyping sensor data"}, {"paperId": "7f88dcabfc3c695baa0b08c7f89c15a4e43b588a", "title": "CloudNet: A Deep Learning Approach for Mitigating Occlusions in Landsat-8 Imagery using Data Coalescence"}, {"paperId": "dcc2a1ffc5f47284392a6485eec253ee9731c5ac", "title": "Living on the Edge"}, {"paperId": "6ee2918019e3ac811c6326b82c9135b54cfc3771", "title": "Non-Mergeable Sketching for Cardinality Estimation"}, {"paperId": "f9b42e493c40094e3e2a7ac7cd4038f2e142c025", "title": "AGAMI: Scalable Visual Analytics over Multidimensional Data Streams"}, {"paperId": "1a798167b24473cb73c4c5e28c1af5d952c4c747", "title": "Iris: Amortized, Resource Efficient Visualizations of Voluminous Spatiotemporal Datasets"}, {"paperId": "2be0fb0957399aae1e91a8076fba21296bc29fc4", "title": "Simple and Efficient Cardinality Estimation in Data Streams"}, {"paperId": "c4bfe73653d7f49f8c2fb03ef4a74dc0a983e910", "title": "Aperture: Fast Visualizations Over Spatiotemporal Datasets"}, {"paperId": "f70dbed02bc4ee369bd6699ec392bc51d06638f7", "title": "Diamond Sketch: Accurate Per-flow Measurement for Big Streaming Data"}, {"paperId": "95e67ff5aec6ba9fe095fab04a285c01933696e3", "title": "Enabling Fast Exploratory Analyses Over Voluminous Spatiotemporal Data Using Analytical Engines"}, {"paperId": "2360903245d23b5cc667b6bf3790995b1c05fc6c", "title": "STRETCH: In-Memory Storage with Autoscaling for Cluster Computing"}, {"paperId": "8f741859ea320641471ae216d8c3e24fd765e661", "title": "Trident: Distributed Storage, Analysis, and Exploration of Multidimensional Phenomena"}, {"paperId": "1c3117f6b9a913896255edd089cb818cf3f3f018", "title": "Alleviating I/O Inefficiencies to Enable Effective Model Training Over Voluminous, High-Dimensional Datasets"}, {"paperId": "87774347413df332e80efaed262929efa26ee6ae", "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets"}, {"paperId": "2b9059b985b59eab36843d98a8d12115aba39479", "title": "Radix: Enabling High-Throughput Georeferencing for Phenotype Monitoring over Voluminous Observational Data"}, {"paperId": "b1e161c1c788014ed68970b4865c6c18d2b78ca5", "title": "Effective Integration of Geotagged, Ancilliary Longitudinal Survey Datasets to Improve Adulthood Obesity Predictive Models"}, {"paperId": "b192e48ffcee08913703a3903710758438295458", "title": "Living on the Edge: Data Transmission, Storage, and Analytics in Continuous Sensing Environments"}, {"paperId": "672c3db094ac5005a299ba8e9d63bd089165eeac", "title": "THESIS A QUESTIONNAIRE INTEGRATION SYSTEM BASED ON QUESTION CLASSIFICATION AND SHORT TEXT SEMANTIC TEXTUAL SIMILARITY Submitted by"}, {"paperId": "a6dd6b45e49792cbe3f43613228660baef2f71fd", "title": "LEVERAGING STREAM PROCESSING ENGINES IN SUPPORT OF PHYSIOLOGICAL DATA PROCESSING Submitted"}, {"paperId": "1e71d9591b2051c1b43b819fafc480fcd8436039", "title": "Implications of storage subsystem interactions on processing efficiency in data intensive computing"}]}
