{"paperId": "040a7465a9870a1cb54fdf3f2faef6eeb8e174c7", "publicationVenue": {"id": "9aa57e01-2dc2-4422-93b7-2b628326f78c", "name": "Information and Communication Technology Convergence", "type": "conference", "alternate_names": ["International Conference on Information and Communication Technology Convergence", "Inf Commun Technol Converg", "Int Conf Inf Commun Technol Converg", "ICTC"]}, "title": "A Survey on Vehicular Edge Computing Architectures", "abstract": "With the recent development of intelligent transportation system (ITS), vehicular applications are being actively studied including autonomous driving, vehicle platooning, that require real-time and high-performance processing resources. Accordingly, various system architectures are being studied to satisfy the high-performance computing requirements. Although the mobile cloud computing architecture provides large-scale computing resources, it is not suitable for vehicular environment that requires real-time processing due to the structure in which the edge node and the computing resources are geographically distant. The mobile edge computing (MEC) architecture places computing resources around edge devices. However, it does not consider edge devices moving at a high speed in a limited service area. Vehicular edge computing (VEC) and vehicular fog computing paradigm have emerged to address the latency requirement with the development of vehicular communications. In this paper, such a computation offloading architecture is presented and analyzed.", "venue": "Information and Communication Technology Convergence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-10-19", "journal": {"name": "2022 13th International Conference on Information and Communication Technology Convergence (ICTC)", "pages": "2198-2200"}, "authors": [{"authorId": "2108806018", "name": "Jaehwan Lee"}, {"authorId": "1795080", "name": "Woongsoo Na"}], "citations": [{"paperId": "6cbcffe89b2f2313135202f54a0057a1b72c312b", "title": "Enhancing Security in Automobile Edge Computing through Federated Learning and Blockchain"}, {"paperId": "7caadb492eecf0f1931efc4683f330e8eec940ec", "title": "Energy-SLA-aware genetic algorithm for edge-cloud integrated computation offloading in vehicular networks"}, {"paperId": "5d94b04dbff973a54f83c53266b3936f5ee3f6c0", "title": "QoS-SLA-aware adaptive genetic algorithm for multi-request offloading in integrated edge-cloud computing in Internet of vehicles"}, {"paperId": "9f90cd89794dea542fef115764cbc963197a434e", "title": "Edge computing: A systematic mapping study"}, {"paperId": "bb26033976515f0c1d1ebeb76c0a7ef87d01589b", "title": "Federated Double Deep Q-Learning-Based Computation Offloading in Mobility-Aware Vehicle Clusters"}]}
