{"paperId": "04223feebd4478da304aaa6c44eb54c10df47009", "publicationVenue": {"id": "c9fd8699-7e79-4ca9-afc9-a3008c2062a3", "name": "International Journal of Operations Research and Information Systems", "type": "journal", "alternate_names": ["Int J Oper Res Inf Syst"], "issn": "1947-9328", "url": "http://www.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=1141", "alternate_urls": ["http://www.igi-global.com/IJORIS"]}, "title": "Big Data and Cloud Computing: A Critical Review", "abstract": "With evolving technology, a huge data is being generated from everywhere in various forms. The driving factors for the evolution of data, such as retail, media, banking, healthcare, and education, leads to a very large and complex collection of data popularly coined as big data. Handling, management, and analysis of big data seem to be a complicated process. Utilising cloud environment for analysing big data is a recent research trend. Big data analytics can provide cost-effective ways to analyse information quickly and helps in decision making, improvement in services or products. This paper aims to critically review the literature to find current issues and research gaps. This study illustrates the existing solutions and methods provided for big data and its rise in cloud computing technology. Furthermore, this paper throws light on the open research challenges in this domain, stating the scope of future work.", "venue": "International Journal of Operations Research and Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-07-01", "journal": {"name": "Int. J. Oper. Res. Inf. Syst.", "pages": "19-38", "volume": "11"}, "authors": [{"authorId": "6096667", "name": "Akansha Gautam"}, {"authorId": "145049128", "name": "Indranath Chatterjee"}], "citations": [{"paperId": "4e994b8b4e100989346fcb28567783eb96aeef9a", "title": "Amalgamation of Cloud computing with big data"}, {"paperId": "2d67c01053ec5589ee84e1df0ba8bc74daf7a51e", "title": "Cloud-based big data analytics integration with ERP platforms"}, {"paperId": "b862d1f9883d84aaa875df8500857c6410f2f071", "title": "Role of neurotransmitters in schizophrenia: a comprehensive study"}, {"paperId": "154059a29d02c4232c4d2ac321309c55146bf20b", "title": "Knowledge Management for Sustainable Development in the Era of Continuously Accelerating Technological Revolutions: A Framework and Models"}, {"paperId": "113a20964b1a6a3db07e56cac5d48a20604bcc33", "title": "Research on Data Security in Big Data Cloud Computing Environment"}, {"paperId": "b3ce32e7f7ff477250c61a0c059d2e5340e30e3e", "title": "Call Graph and Model Checking for Fine-Grained Android Malicious Behaviour Detection"}, {"paperId": "a659630e4fc4fde45c8c88ed2981e237e811b66f", "title": "Analysis of Vulnerabilities in Hadoop Map Reduce Framework: A Review"}, {"paperId": "148b2f9ed9c67b9db0f35e22741d60fc20d5b415", "title": "A Concise Study of Schizophrenia and Resting-state fMRI data analysis"}]}
