{"paperId": "04245fa7a9f6cbfebf0072169c586ff46bce3aa9", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Best Practices for Training in Sustainable Greenhouse Horticulture", "abstract": "Consumer demands and current legislation require intensive greenhouse horticulture to be sustainable. This poses the challenge of how to teach the concept of sustainable horticulture to all professionals involved in farming. The province of Almeria, in the south-east of Spain, is one of the major horticulture greenhouse areas in Europe, and an expert panel of relevant stakeholders was invited to look into the best pedagogical practices and methods to transfer technology and knowledge, with the goal of improving the sustainability of greenhouse horticulture. A combination of an online questionnaire, a Delphi method, and desk research was, therefore, used as the strategy to collect the data and implement the research design during 2021. On-farm/business demonstrations, virtual education, and classroom education were common pedagogical methods used. On-farm/business demonstrations, participatory education, and co-learning were identified as the best pedagogical methods to use in sustainable agriculture/horticulture training. The expert panel also concluded that participatory education and co-learning should be further explored whereas virtual and classroom education should play a less dominant role in the training activities. This knowledge can help training organizations and designers to avoid common mistakes, tailor their training activities, and be mindful of common barriers and (mis)conceptions.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-03-27", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2212945216", "name": "Ralph De Witte"}, {"authorId": "2055506588", "name": "D. Janssen"}, {"authorId": "2212960136", "name": "Samir Sayadi Gmada"}, {"authorId": "2212953484", "name": "Carmen García-García"}], "citations": [{"paperId": "98cfe786cf7829c6177b00ec052eebe260d4df63", "title": "Farmers’ Transition to Climate-Smart Agriculture: A Systematic Review of the Decision-Making Factors Affecting Adoption"}]}
