{"paperId": "042c157d7d1ee00f74233b4486b93a522419b7f0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An extensive empirical comparison of k-means initialisation algorithms", "abstract": "The k-means clustering algorithm, whilst widely popular, is not without its drawbacks. In this paper, we focus on the sensitivity of k-means to its initial set of centroids. Since the cluster recovery performance of k-means can be improved by better initialisation, numerous algorithms have been proposed aiming at producing good initial centroids. However, it is still unclear which algorithm should be used in any particular clustering scenario. With this in mind, we compare 17 such algorithms on 6,000 synthetic and 28 real-world data sets. The synthetic data sets were produced under different configurations, allowing us to show which algorithm excels in each scenario. Hence, the results of our experiments can be particularly useful for those considering k-means for a non-trivial clustering scenario.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2167830966", "name": "Simon Harris"}, {"authorId": "2028807", "name": "Renato Cordeiro de Amorim"}], "citations": [{"paperId": "14c12f00f7d63028ada5465d1e19ae78f4e32ca7", "title": "A Review of Uncertainty-Based Multidisciplinary Design Optimization Methods Based on Intelligent Strategies"}, {"paperId": "f1a42fc5c5c25727e71f8cccd9d6916eb7ed1394", "title": "Optimal scheduling of regional integrated energy system considering multiple uncertainties and integrated demand response"}, {"paperId": "de1b7c39d881cf2d5a94da2a31a248f684d051bf", "title": "An Improved Trilateration Positioning Algorithm with Anchor Node Combination and K-Means Clustering"}]}
