{"paperId": "04402c95a29e59e6f6996670840314bf3f52f991", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "Students' experimentation strategies in design: Is process data enough?", "abstract": "Conducting experiments is an important practice for both engineering design and scientific inquiry. Engineers iteratively conduct experiments to evaluate ideas, make informed decisions, and optimize their designs. However, both engineering design and scientific experimentation are open‐ended tasks that are not easy to assess. Recent studies have demonstrated how technology‐based assessments can help to capture and characterize these open‐ended tasks using unobtrusive data logging. This study builds upon a model to characterize students' experimentation strategies in design (ESD). Ten undergraduate students worked on a design challenge using a computer‐aided design (CAD) tool that captured all their interactions with the software. This “process data” was compared to “think‐aloud data,” which included students' explanations of their rationale for the experiments. The results suggest that the process data and the think‐aloud data have both affordances and limitations toward the goal of assessing students' ESD. While the process data was an effective approach to identify relevant sequences of actions, this type of data failed to ensure that students carried them out with a specific purpose. On the other hand, the think‐aloud data captured students' rationale for conducting experiments, but it depended on students' ability to verbalize their actions. In addition, the implementation of think‐aloud procedures and their analysis are time consuming tasks, and can only be done individually.", "venue": "Computer Applications in Engineering Education", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-12", "journal": {"name": "Computer Applications in Engineering Education", "pages": "1903 - 1914", "volume": "26"}, "authors": [{"authorId": "3311811", "name": "Camilo Vieira"}, {"authorId": "8619808", "name": "Ying Ying Seah"}, {"authorId": "2221017", "name": "Alejandra J. Magana"}], "citations": [{"paperId": "c3ba124c68a97cd9820001d9335733a84ca0a61d", "title": "An online integrated programming platform to acquire students' behavior data for immediate feedback teaching"}, {"paperId": "0dc2d7d67fe405c5ff6b4b68da7eddcbb7e272a9", "title": "A systematic review of empirical studies using log data from open-ended learning environments to measure science and engineering practices"}, {"paperId": "cb476d914964ee6942dfcb750c949c7b1955072b", "title": "Data science knowledge integration: Affordances of a computational cognitive apprenticeship on student conceptual understanding"}, {"paperId": "a492d6b6df35158d5d696342b33f663417d21608", "title": "Pedagogical approaches for eliciting students’ design thinking strategies: tell-and-practice vs. contrasting cases"}, {"paperId": "816751f6db13984fc56e50c8b36ef3d21f569fef", "title": "Structural Relationships among High School Students’ Scientific Knowledge, Critical Thinking, Engineering Design Process, and Design Product"}, {"paperId": "1aa069054f508239f818213201ce9bff25e25279", "title": "Characterizing Students’ Design Strategies During Simulation-based Engineering of Sustainable Buildings"}, {"paperId": "702270629b64d833d28ac0c6989bcd02805d7cc8", "title": "Structural Relationships among High School Students’ Scientific Knowledge, Critical Thinking, Engineering Design Process, and Design Product"}, {"paperId": "28778548c2bcea85f39c638c1e017e56f7748047", "title": "The Role of Simulation-Enabled Design Learning Experiences on Middle School Students’ Self-generated Inherence Heuristics"}, {"paperId": "6e6149ff5b1ab7dbf15835902c2db28bdbb2e212", "title": "Investigating the affordances of a CAD enabled learning environment for promoting integrated STEM learning"}, {"paperId": "eb5d2c19e3329e3694ee738154f170ed2945dbb8", "title": "Current State of Learning Analytics"}, {"paperId": "77b6bd9d9f731f4c858c23711276008cce22b504", "title": "Reﬂection in Time: Using Data Visualization to Identify Student Reﬂection Modes in Design"}]}
