{"paperId": "047c56653a266f9770a724e0d54b353271509a0c", "publicationVenue": null, "title": "Disaggregated Database Systems", "abstract": "Disaggregated database systems achieve unprecedented excellence in elasticity and resource utilization at the cloud scale and have gained great momentum from both industry and academia recently. Such systems are developed in response to the emerging trend of disaggregated data centers where resources are physically separated and connected through fast data center networks. Database management systems have been traditionally built based on monolithic architectures, so disaggregation fundamentally challenges the designs. On the other hand, disaggregation offers benefits like independent scaling of compute, memory, and storage. Nonetheless, there is a lack of systematic investigation into new research challenges and opportunities in recent disaggregated database systems. To provide database researchers and practitioners with insights into different forms of resource disaggregation, we take a snapshot of state-of-the-art disaggregated database systems and related techniques and present an in-depth tutorial. The primary goal is to better understand the enabling techniques and characteristics of resource disaggregation and its implications for next-generation database systems. To that end, we survey recent work on storage disaggregation, which separates secondary storage devices (e.g., SSDs) from compute servers and is widely deployed in current cloud data centers, and memory disaggregation, which further splits compute and memory with Remote Direct Memory Access (RDMA) and is driving the transformation of clouds. In addition, we mention two techniques that bring novel perspectives to the above two paradigms: persistent memory and Compute Express Link (CXL). Finally, we identify several directions that shed light on the future development of disaggregated database systems.", "venue": "SIGMOD Conference Companion", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference", "Review"], "publicationDate": "2023-06-04", "journal": {"name": "Companion of the 2023 International Conference on Management of Data"}, "authors": [{"authorId": "2141735101", "name": "Jianguo Wang"}, {"authorId": "2112197162", "name": "Qizhen Zhang"}], "citations": [{"paperId": "899f86566b04e7a79d15cd2df62fbb2e66ec8b75", "title": "Survey of Vector Database Management Systems"}]}
