{"paperId": "047e873025972c6255883d72cd86dbfd10d8e37e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "LR-LRU: A PACS-Oriented Intelligent Cache Replacement Policy", "abstract": "An intelligent cache replacement policy suitable for picture archiving and communication systems (PACS) was proposed in this work. By combining the logistic regression (LR) algorithm with the classic least recently used (LRU) cache replacement policy, we have created a new intelligent cache replacement policy called LR-LRU. The LR-LRU policy is unlike conventional cache replacement policies, which are solely dependent on the intrinsic properties of the cached items. Our PACS-oriented LR-LRU algorithm identifies the variables that affect file access probabilities by mining medical data. The LR algorithm is then used to model the future access probabilities of the cached items, thus improving cache performance. In addition, <inline-formula> <tex-math notation=\"LaTeX\">$\\ell 1$ </tex-math></inline-formula>-regularization was used to reduce the absolute values of the variables’ coefficients. This screens some variables that have little influence on the model by causing their coefficients to approach zero, which achieves the effect of screening the variables. Finally, a simulation experiment was performed using the trace-driven simulation method. It was shown that the <inline-formula> <tex-math notation=\"LaTeX\">$\\ell 1$ </tex-math></inline-formula>-regularized LR model is superior to the LR and <inline-formula> <tex-math notation=\"LaTeX\">$\\ell 2$ </tex-math></inline-formula>-regularized LR models. The LR-LRU cache algorithm significantly improves PACS cache performance when compared to conventional cache replacement policies, such as LRU, LFU, SIZE, GDF, and GDSF.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-30", "journal": {"name": "IEEE Access", "pages": "58073-58084", "volume": "7"}, "authors": [{"authorId": "2108729520", "name": "Yinyin Wang"}, {"authorId": "3176977", "name": "Yuwang Yang"}, {"authorId": "2118642208", "name": "Chen Han"}, {"authorId": "2111919814", "name": "Lei Ye"}, {"authorId": "30667175", "name": "Yaqi Ke"}, {"authorId": "2117767203", "name": "Qingguang Wang"}], "citations": [{"paperId": "b8554f78e8bc1c24fc8dfaac54ee07f20e816e21", "title": "HotKey-Cache: A HotKey-Separate Cache to Improve Performance for Key-Value Store"}, {"paperId": "2320f5debf878a38c6ddf814b2bb299a8bc3b03e", "title": "Web Caching Hybrid Algorithm by Semantic Similarity"}, {"paperId": "485765f27c9fb9e215c7e78cb23d48abff7865dc", "title": "HRFP: Highly Relevant Frequent Patterns-Based Prefetching and Caching Algorithms for Distributed File Systems"}, {"paperId": "ef404bc47ed8d345260d2a2928a881f68c49e17c", "title": "Efficient Federated DRL-Based Cooperative Caching for Mobile Edge Networks"}, {"paperId": "c597e61251c1da9f6baeb5f3527148d1623a72c2", "title": "SS-LRU: a smart segmented LRU caching"}, {"paperId": "2cb5a8ac7d5fc6c148a86813e41abd72ab6327e7", "title": "Effective data management strategy and RDD weight cache replacement strategy in Spark"}, {"paperId": "040012aa3bdeeb268c4d885550c7eea0386412e8", "title": "Automation of HealthCare Modality's Storage System Monitoring Process"}, {"paperId": "2211026d367d783771400ffe77cadbfa8182cc21", "title": "Research on Multicore Key-Value Storage System for Domain Name Storage"}, {"paperId": "40347d180f5f80122afb83bbe6bb1446abe1b2ae", "title": "CCF-LRU: hybrid storage cache replacement strategy based on counting cuckoo filter hot-probe method"}, {"paperId": "ce725addd68363eec949915fc67457d954c9ad40", "title": "Self-adaptive trajectory prediction for improving traffic safety in cloud-edge based transportation systems"}, {"paperId": "9220e820974a1ba1388f3f58b85b1754b15624a7", "title": "Caching strategy for Web application - a systematic literature review"}, {"paperId": "3343178993fb6801a1cbec11721cc2e585cbb1cb", "title": "CLAM: Compiler Lease of Cache Memory"}, {"paperId": "9669f403f5a50975d5771aa40b3f6af2c95b9b2c", "title": "A page replacement algorithm based on a fuzzy approach to improve cache memory performance"}, {"paperId": "48227bf3283bc684418c534f35bd23a3ab0849d1", "title": "Evaluating Erasure Codes in Dicoogle PACS"}, {"paperId": "4187f62c2f19f82d626eb1d2baf12345fc3dca3a", "title": "Efficient Prefetching and Client-Side Caching Algorithms for Improving the Performance of Read Operations in Distributed File Systems"}, {"paperId": "3548ce4ee33ba700befe9325517a8ddda6440cb8", "title": "Estimating Video Popularity From Past Request Arrival Times in a VoD System"}, {"paperId": "c7f6694cfb1e12efbad3e8d42d37629c346dcca8", "title": "Improving of cache memory performance based on a fuzzy clustering based page replacement algorithm by using four features"}, {"paperId": "f2c8fa823d5607e3564c5ba242c5143fc6a58433", "title": "A Lightweight Caching Decision Strategy Based on Node Edge-Degree for Information Centric Networking"}]}
