{"paperId": "0483eb8cca8c67b988b02e369d1998891f481a91", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Complete Software Stack for IoT Time-Series Analysis that Combines Semantics and Machine Learning—Lessons Learned from the Dyversify Project", "abstract": "Companies are increasingly gathering and analyzing time-series data, driven by the rising number of IoT devices. Many works in literature describe analysis systems built using either data-driven or semantic (knowledge-driven) techniques. However, little to no works describe hybrid combinations of these two. Dyversify, a collaborative project between industry and academia, investigated how event and anomaly detection can be performed on time-series data in such a hybrid setting. We built a proof-of-concept analysis platform, using a microservice architecture to ensure scalability and fault-tolerance. The platform comprises time-series ingestion, long term storage, data semantification, event detection using data-driven and semantic techniques, dynamic visualization, and user feedback. In this work, we describe the system architecture of this hybrid analysis platform and give an overview of the different components and their interactions. As such, the main contribution of this work is an experience report with challenges faced and lessons learned.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-15", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1381251784", "name": "Dieter De Paepe"}, {"authorId": "2139606570", "name": "Sander Vanden Hautte"}, {"authorId": "51138839", "name": "Bram Steenwinckel"}, {"authorId": "1506980790", "name": "Pieter Moens"}, {"authorId": "2145814197", "name": "Jasper Vaneessen"}, {"authorId": "1981432", "name": "Steven Vandekerckhove"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1726557", "name": "F. Ongenae"}, {"authorId": "134767416", "name": "Sofie Van Hoecke"}], "citations": [{"paperId": "26d6be96370f2f8cc269d8b55756419bd4544b44", "title": "Innovations for Interpretability, Flexibility, and Sustainability in Intelligent Machinery and Industry 4.0"}, {"paperId": "323bbe0b3d44d55dc1358fff7d6e6db84237ca12", "title": "RMLStreamer-SISO: An RDF Stream Generator from Streaming Heterogeneous Data"}, {"paperId": "41f8bb0b067f1ad1e9a6f7dbbcd2f45e7a8d84be", "title": "Event-Driven Dashboarding and Feedback for Improved Event Detection in Predictive Maintenance Applications"}, {"paperId": "a40552eeb09b3b492d72a60e66e24f4330303f6b", "title": "The RML Ontology: A Community-Driven Modular Redesign After a Decade of Experience in Mapping Heterogeneous Data to RDF"}]}
