{"paperId": "0484e5f1483a0d3599bff272fcf8087565251fb2", "publicationVenue": null, "title": "A WEB-BASED FRAMEWORK FOR VISUALIZING INDUSTRIAL SPATIOTEMPORAL DISTRIBUTION USING STANDARD DEVIATIONAL ELLIPSE AND SHIFTING ROUTES OF GRAVITY CENTERS", "abstract": "Abstract. Analysing spatiotemporal distribution patterns and its dynamics of different industries can help us learn the macro-level developing trends of those industries, and in turn provides references for industrial spatial planning. However, the analysis process is challenging task which requires an easy-to-understand information presentation mechanism and a powerful computational technology to support the visual analytics of big data on the fly. Due to this reason, this research proposes a web-based framework to enable such a visual analytics requirement. The framework uses standard deviational ellipse (SDE) and shifting route of gravity centers to show the spatial distribution and yearly developing trends of different enterprise types according to their industry categories. The calculation of gravity centers and ellipses is paralleled using Apache Spark to accelerate the processing. In the experiments, we use the enterprise registration dataset in Mainland China from year 1960 to 2015 that contains fine-grain location information (i.e., coordinates of each individual enterprise) to demonstrate the feasibility of this framework. The experiment result shows that the developed visual analytics method is helpful to understand the multi-level patterns and developing trends of different industries in China. Moreover, the proposed framework can be used to analyse any nature and social spatiotemporal point process with large data volume, such as crime and disease.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-09-12", "journal": {"name": "ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "129-135", "volume": ""}, "authors": [{"authorId": "2256682032", "name": "Yunting Song"}, {"authorId": "2439686", "name": "Zhipeng Gui"}, {"authorId": "2243841600", "name": "Huayi Wu"}, {"authorId": "2249093140", "name": "Yangjiaxin Wei"}], "citations": [{"paperId": "baecaf06fedd4d3ada0dc7f37cc7e00d0d921309", "title": "Spatial-temporal evolution and influencing factors of ecological resilience in urban agglomerations: a case study of Shanxi section of the Yellow River Basin"}, {"paperId": "ddef7143cc54e37dca8f8163b2d0c1fb1e3ad43d", "title": "DEVELOPING APACHE SPARK BASED RIPLEY’S K FUNCTIONS FOR ACCELERATING SPATIOTEMPORAL POINT PATTERN ANALYSIS"}, {"paperId": "31606516f09837a137a44126fc20c2ffbde90e4d", "title": "High Performance Spatiotemporal Visual Analytics Technologies and Its Applications in Big Socioeconomic Data Analysis"}]}
