{"paperId": "0486bfdef400248c60e819be497756ebc9169903", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Service Characteristics-Oriented Joint Optimization of Radio and Computing Resource Allocation in Mobile-Edge Computing", "abstract": "Mobile-edge computing (MEC) is a promising technology, which allows reducing latency and energy consumption, thereby making the user experience better. Although MEC can support various types of services, differentiated Quality-of-Service (QoS) requirements bring difficulties and challenges to the allocation of radio resources and computing resources of the MEC system. In this article, we jointly optimize subchannel allocation, as well as the local central processing unit (CPU) speed scaling, user association, subcarrier assignment, power allocation, and video quality decision for MEC systems to study the total cost saving problem. Considering the traffic variations, we develop an online algorithm by using the Lyapunov optimization technique to solve this problem, referred to as dynamic subchannel allocation and resource allocation (DSARA). Particularly, the proposed DSARA algorithm only needs to track the state of the current network without requiring any prior knowledge. Besides, we prove that our proposed algorithm can asymptotically achieve the minimum total cost value (such as minimizing the power consumption and maximizing quality satisfaction). Simulation results show that the DSARA can achieve a good tradeoff between the total cost and delay, and outperforms the existing schemes in terms of the total cost expenditure.", "venue": "IEEE Internet of Things Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-10", "journal": {"name": "IEEE Internet of Things Journal", "pages": "9407-9421", "volume": "8"}, "authors": [{"authorId": "2109020134", "name": "Jie Feng"}, {"authorId": "2150801768", "name": "Lei Liu"}, {"authorId": "39718931", "name": "Qingqi Pei"}, {"authorId": "1699662", "name": "Fen Hou"}, {"authorId": "143832209", "name": "Tingting Yang"}, {"authorId": "1455051413", "name": "Jinsong Wu"}], "citations": [{"paperId": "46a97f61d02e3fc8fd46026873367de71e031260", "title": "Deep Reinforcement Learning for Optimization of RAN Slicing Relying on Control- and User-Plane Separation"}, {"paperId": "e8de5f23a9d6c68f7e49137abfc9b44dc7328e35", "title": "SIMA: Scalable IoT Microservice Architecture With Users and Things Joint Load Balancing"}, {"paperId": "07ed96901493dca9ab95a98fdb2cedc575d77c6d", "title": "Collaborative Edge Intelligence Service Provision in Blockchain Empowered Urban Rail Transit Systems"}, {"paperId": "ea7b84cb38bb347641e0ab8b554e44c70ebc02bb", "title": "Service Satisfaction-Oriented Task Offloading and UAV Scheduling in UAV-Enabled MEC Networks"}, {"paperId": "98c5ab7d2bd2da77d73fbd790b90d1ca4082ef23", "title": "Task offloading strategy and scheduling optimization for internet of vehicles based on deep reinforcement learning"}, {"paperId": "d5100d730cbe0e4b42fcfde68b74cd0cac4f8768", "title": "Privacy-preserving cloud-edge collaborative learning without trusted third-party coordinator"}, {"paperId": "4d7134766a95c3362a38413e98b9e99f2bc12042", "title": "Survey on Advanced Video Streaming with Multi-Access Edge Computing"}, {"paperId": "bcbda2daed87a07947b912eca8237da64f634ea1", "title": "Cost-Efficient and Quality-of-Experience-Aware Player Request Scheduling and Rendering Server Allocation for Edge-Computing-Assisted Multiplayer Cloud Gaming"}, {"paperId": "7a998da01c2349e0b09ab8a64e1195ddd4ed6745", "title": "Legal Regulation of Artificial Intelligence and Digital Twin Decision-Making Risks in Mobile Edge Computing"}, {"paperId": "b81b3d230069ebe39240d1115dd6f93f180a8c63", "title": "Resource management and switch migration in SDN-based multi-access edge computing environments"}, {"paperId": "4f823c19577554d8e6e0068cb1124c1a504ad999", "title": "Resource Optimization Technology Using Genetic Algorithm in UAV-Assisted Edge Computing Environment"}, {"paperId": "139a2f248e42861a13e12a59d88c9d03ff124ad6", "title": "Online Optimization of Animation Art Design User Virtual Perception in Mobile Edge Computing Environment"}, {"paperId": "877985b32e4d123520497114233962e35b4873ee", "title": "Classification of resource management approaches in fog/edge paradigm and future research prospects: a systematic review"}, {"paperId": "21005906dae150b74db0d5ea53785b0e84330ffa", "title": "Incorporating Distributed DRL Into Storage Resource Optimization of Space-Air-Ground Integrated Wireless Communication Network"}, {"paperId": "2d73c1417c7aa2e6cd8f10b03eeaf495c6095dd4", "title": "Computing resource allocation strategy considering privacy protection mechanism in edge computing environment"}, {"paperId": "b0830c0b142d0ca2157b1bdb261115338c59a0a9", "title": "A computing allocation strategy for Internet of things’ resources based on edge computing"}, {"paperId": "d149ffe7795464bef9414a1ca21c0da9d886fa0e", "title": "Online Resource Management of Heterogeneous Cellular Networks Powered by Grid-Connected Smart Micro Grids"}, {"paperId": "11e1d252ee54249e669d1c91fb7780e09e377664", "title": "Task Offloading and Resource Allocation Mechanism of Moving Edge Computing in Mining Environment"}]}
