{"paperId": "048791552d192f12063325ba5dc5de510ac095f4", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Application of the Structure Function in the Evaluation of the Human Factor in Healthcare", "abstract": "A structure function is one of the possible mathematical models of systems in reliability engineering. A structure function maps sets of component states into system performance levels. Methods of system reliability evaluation based on structure function representation are well established. A structure function can be formed based on completely specified data about system behavior. Such data for most real-world systems are incomplete and uncertain. The typical example is analysis and evaluation of the human factor. Therefore, the structure function is not used in human reliability analysis (HRA) typically. In this paper, a method for structure function construction is proposed based on incomplete and uncertain data in HRA. The proposed method application is considered for healthcare to evaluate medical error. This method is developed using a fuzzy decision tree (FDT), which allows all possible component states to be classified into classes of system performance levels. The structure function is constructed based on the decision table, which is formed according to the FDT. A case study for this method is considered by evaluating the human factor in healthcare: complications in the familiarization and exploitation of a new device in a hospital department are analyzed and evaluated. This evaluation shows the decreasing of medical errors in diagnosis after one year of device exploitation and a slight decrease in quality of diagnosis after two months of device exploitation. Numerical values of probabilities of medical error are calculated based on the proposed approach.", "venue": "Symmetry", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-03", "journal": {"name": "Symmetry", "pages": "93", "volume": "12"}, "authors": [{"authorId": "34736938", "name": "E. Zaitseva"}, {"authorId": "2331135", "name": "V. Levashenko"}, {"authorId": "9139631", "name": "J. Rabcan"}, {"authorId": "2495911", "name": "Emil Krsák"}], "citations": [{"paperId": "e0849daa94de2e76c796e56ed0ec6ca1f947e653", "title": "An intelligent human‐centric systems to diagnose breast cancer using machine learning and optimized feature selection techniques"}, {"paperId": "43ffda55a0c510e16156fd9f23d4f1a09ddd0472", "title": "Deep Learning Method Based for Breast Cancer Classification"}, {"paperId": "008235438755382309ceac2efcaa6391dfbefc7b", "title": "A New Fuzzy-Based Classification Method for Use in Smart/Precision Medicine"}, {"paperId": "eec22de393fcaaacd0c7665f81cf7682a29365a8", "title": "The Investments in Human Capital within the Human Capital Management and the Impact on the Enterprise’s Performance"}, {"paperId": "b755f1373c329ef2a1e65cbd92fa2c5bd2e049fd", "title": "Does Artificial Intelligence Promote or Inhibit On-the-Job Learning? Human Reactions to AI at Work"}, {"paperId": "e5e477903869e6dee6e0de5d10c7fb463bf4b471", "title": "When neuro-robots go wrong: A review"}, {"paperId": "da9c2170dccab9dd8e5a4c172ba399784ecff733", "title": "Importance analysis of decision making factors based on fuzzy decision trees"}, {"paperId": "471b8cb17c5032a8725d74e5e34f3adc9f1fb8a1", "title": "Impact of Stemming on Efficiency of Messages Likelihood Definition in Telegram Newsfeeds"}, {"paperId": "5c2c709e4eb7a4280c76f6967d3ffb54af8836f8", "title": "Explainable AI: A Neurally-Inspired Decision Stack Framework"}, {"paperId": "49f4b0aa36efc180a99a265cc208114009e6e28f", "title": "Methods of medical data management based on blockchain technologies"}, {"paperId": "8991ca04662bc5a93dc0b959dda4738ead279170", "title": "Belief reliability analysis of multi-state deteriorating systems under epistemic uncertainty"}, {"paperId": "c3549457edaed40143ea861b9d5ea71674afbe60", "title": "Evaluation of the Operation Process of Medical Equipment to Enhance Ergonomic Reliability Based on FRAM–Moran’s I and CREAM"}, {"paperId": "2aa1fba00bacdab17b9f46ce3e8c233a6389b800", "title": "Multiobjective Multistate System Preventive Maintenance Model with Human Reliability"}, {"paperId": "fa6e2da9fe57856fa8adf532f09f5ae5aba60081", "title": "Critical state of non-coherent multi-state system"}, {"paperId": "d753268fced2efbb630fbd2993ff10f15887cb2c", "title": "Logical differential calculus for calculation of Birnbaum importance of non-coherent system"}, {"paperId": "ee6a5ba83222c14c2fb384aa4ca7a74eb7b48e3b", "title": "Breast cancer disease classification using fuzzy-ID3 algorithm with FUZZYDBD method: automatic fuzzy database definition"}, {"paperId": "b480cef01f6d6570092fdd2fd13940b5e15ac450", "title": "Performance evaluation of a hybrid series–parallel system with two human operators using Gumbel–Hougaard family copula"}, {"paperId": "ae8ab100a1448607318415442284f1596d00e21e", "title": "Reliability engineering applications in electronic, software, nuclear and aerospace industries: A 20 year review (2000–2020)"}, {"paperId": "2f6fa977c82d1ea4e74266f515129e4e5d8eeb13", "title": "Reliability Evaluation of the Factors That Influenced COVID-19 Patients’ Condition"}, {"paperId": "2ae65106de98a4acde08ef4166f4971d82be262d", "title": "A Fuzzy-Based Multi-Dimensional Risk Assessment Model for the Healthcare System"}, {"paperId": "76e5ec40dc49db6d0bff446b6914a5d9f77ef0b7", "title": "Method for Determining the Structural Reliability of a Network Based on a Hyperconverged Architecture"}]}
