{"paperId": "04938169966dc0eb238d4ac17eec861b37fe3b31", "publicationVenue": {"id": "68f20e73-515e-4c73-9cd5-5684926b45f7", "name": "IEEE Journal on Selected Areas in Communications", "type": "journal", "alternate_names": ["IEEE J Sel Area Commun"], "issn": "0733-8716", "url": "http://www.comsoc.org/jsac/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=49", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=49"]}, "title": "Embedding Service Function Tree With Minimum Cost for NFV-Enabled Multicast", "abstract": "Usually, a data flow needs to traverse a series of network functions, which is called a service function chain (SFC), before reaching its destination. The emergence of network function virtualization (NFV) makes the embedding solution of the SFC flexible as far as the deployment location is concerned. When providers embed the SFC into a substrate network, they will hope to minimize the setup cost of the SFC and link connection cost toward clients. For unicast, since there is one path connecting the source node to the destination node, all functions of the SFC are just needed to be deployed along the path. However, when embedding the SFC for a multicast task, the topology of the SFC may change because the function deployment locations have impacts on the traffic delivery cost. Thus, a service function tree (SFT) may be a better choice. Given the huge space of SFT embedding solutions, however, it is extremely hard to find the optimal one such that the total traffic delivery cost is minimized. In this paper, we tackle the optimal SFT embedding problem in the NFV enabled multicast task. Specifically, we formally define the problem and formulate it with an integer linear programming (ILP), which turns out to be NP-hard. Then, a two-stage method is proposed to deal with the problem with an approximation ratio of  $1+\\rho $ , where  $\\rho $  is the best approximation ratio of Steiner tree and can be as small as 1.39. With extensive experimental evaluations, we demonstrate that by applying our SFT embedding solution, the delivery cost of multicast traffic can be reduced by 22.05% at most against three benchmarks.", "venue": "IEEE Journal on Selected Areas in Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "IEEE Journal on Selected Areas in Communications", "pages": "1085-1097", "volume": "37"}, "authors": [{"authorId": "39016718", "name": "Bangbang Ren"}, {"authorId": "144233921", "name": "Deke Guo"}, {"authorId": "1885653", "name": "Yulong Shen"}, {"authorId": "1968264", "name": "Guoming Tang"}, {"authorId": "2120980", "name": "Xu Lin"}], "citations": [{"paperId": "4913e428f8021741c97f03b86dd857e4453bff36", "title": "Multi-source multicast service chaining model guaranteeing reliability of network services"}, {"paperId": "8a2235e01d5ccf3a5bd9d9a30ed2212faa01f826", "title": "Multicast Service Function Chain Orchestration in SDN/NFV-Enabled Networks: Embedding, Readjustment, and Expanding"}, {"paperId": "5955cd1c0c77fb399226d5fe2af92179885197a6", "title": "Service-Aware Resource Orchestration in Ultra-Dense LEO Satellite-Terrestrial Integrated 6G: A Service Function Chain Approach"}, {"paperId": "6b2c8983caa7131be69575232da65ba6a7c3baf3", "title": "Slice-Based Service Function Chain Embedding for End-to-End Network Slice Deployment"}, {"paperId": "5f5d426651c35f5c445f8dc0adf18a2b9f314edc", "title": "A reinforcement learning method for scheduling service function chains with multi-resource constraints"}, {"paperId": "5378c8cdc3583ba05b4d13963e87d1c4eabcf19e", "title": "Placement and Allocation of Virtual Network Functions: Multi-Dimensional Case"}, {"paperId": "e31f5e43c3409a95e5390f8324c7af36cf51321e", "title": "Multicast Service Chaining Model Guaranteeing Reliability with Multiple Sources"}, {"paperId": "5c5e9adebcda8e9ee4c6d15f7336c62219bb2dc0", "title": "Collaborative Learning-Based Network Resource Scheduling and Route Management for Multi-Mode Green IoT"}, {"paperId": "f317b962dede2aa93a157a2e5fa13e6eb1929a7d", "title": "QoS-Aware Management Reconfiguration of vNF Service Trees With Heterogeneous NFV Platforms"}, {"paperId": "154d1462a87aec6edfe600d70de2251f23020766", "title": "SAP: Subchain-Aware NFV Service Placement in Mobile Edge Cloud"}, {"paperId": "bb23cfef61111338c01a2f5f8d4d07d488030e85", "title": "Multi-Resource Scheduling for Multiple Service Function Chains with Deep Reinforcement Learning"}, {"paperId": "769d61433144ca7b43b28ab90dc1b86fcc74e139", "title": "SFC Enabled Data Delivery for Ultra-Dense LEO Satellite-Terrestrial Integrated Network"}, {"paperId": "f8f40b9c14da83bccc1baeb903e6f8b5313391fa", "title": "On Efficient Delay-Aware Multisource Multicasting in NFV-Enabled Softwarized Networks"}, {"paperId": "1ccc4cce831dba85aabee14ebc47cd459ebe397a", "title": "Joint Optimization of VNF Placement and Flow Scheduling in Mobile Core Network"}, {"paperId": "6f4e1ffe894091369996351659136d80899d673b", "title": "A survey on the placement of virtual network functions"}, {"paperId": "d64a98600d15bbfa917c06dd56b7ccc775b673b7", "title": "Efficient solutions to the placement and chaining problem of User Plane Functions in 5G networks"}, {"paperId": "f1e5c84aa14ee321d7faad01c034db4990640307", "title": "Joint optimization of Service Chain Graph Design and Mapping in NFV-enabled networks"}, {"paperId": "b536591665ba462ab920b0ae0a33132e593743a5", "title": "A two-stage approach for multicast-oriented virtual network function placement"}, {"paperId": "ea670c48965bde1e70ca9eba55ddfca80878183b", "title": "Embedding Multicast Service Function Chains in NFV-Enabled Networks"}, {"paperId": "7c96b333e33a1fc905dcecf52f82e51ea0fc658d", "title": "Quality of service provisioning in network function virtualization: a survey"}, {"paperId": "db9116324068cc2218ee28c9e606a63272382ce4", "title": "Delay-Sensitive Multi-Source Multicast Resource Optimization in NFV-Enabled Networks: A Column Generation Approach"}, {"paperId": "e565f38c78cd7a76f3606ec4ea8b113f63fdc72a", "title": "NFV Resource Allocation: a Systematic Review and Taxonomy of VNF Forwarding Graph Embedding"}, {"paperId": "f6ae362b448367e528c94b53c99d14ce444da85a", "title": "Enabling Multicast Slices in Edge Networks"}, {"paperId": "c0a72d68f025c8b01bd970badc072f493e46e6e3", "title": "Prune and Plant: Efficient Placement and Parallelism of Virtual Network Functions"}, {"paperId": "9149fda8f52d230b8e7531731cfcceffb098ae37", "title": "Virtual network function placement and routing for multicast service chaining using merged paths"}, {"paperId": "6fe39dee49b9650bc0bcfa1625b0edc941020c94", "title": "Placement and Allocation of Virtual Network Functions: Multi-dimensional Case"}, {"paperId": "97a44e386ee96088479550cab91a84343107118c", "title": "A Topology Based Differential Privacy Scheme for Average Path Length Query"}, {"paperId": "be48111e2ec64ff80aabe2458824bd8da20fd661", "title": "Guaranteeing E2E QoS via Joint Radio and NFV Resource Allocation for 5G and Beyond"}, {"paperId": "13104ca6c52290b671fff6a5d6b1bb179a3d116c", "title": "Energy Cost Minimization by Joint Radio and NFV Resource Allocation: E2E QoS Framework"}, {"paperId": "96f1d2319f95e586215330d139fba6d04908bf00", "title": "Towards Efficient and Delay-Aware NFV-Enabled Unicasting With Adjustable Service Function Chains"}, {"paperId": "5efcfa947ca5189191e15beb435d2966eb029f78", "title": "A Differential Privacy Topology Scheme for Average Path Length Query"}]}
