{"paperId": "049af837db8c08860442fb9fe437788acee45028", "publicationVenue": null, "title": "ECI-Cache: A High-Endurance and Cost-Efficient I/O Caching Scheme for Virtualized Platforms", "abstract": "In recent years, high interest in using Virtual Machines (VMs) in data centers and cloud computing has significantly increased the demand for high-performance data storage systems. A straightforward approach to providing a high-performance storage system is using Solid-State Drives (SSDs). Inclusion of SSDs in storage systems, however, imposes significantly higher cost compared to Hard Disk Drives (HDDs). Recent studies suggest using SSDs as a caching layer for HDD-based storage subsystems in virtualized platforms. Such studies neglect to address the endurance and cost of SSDs, which can significantly affect the efficiency of I/O caching. Moreover, previous studies only configure the cache size to provide the required performance level for each VM, while neglecting other important parameters such as cache write policy and request type, which can adversely affect both performance-per-cost and endurance. In this paper, we propose a new high-Endurance and Cost-efficient I/O caching (ECI-Cache) scheme for virtualized platforms in large-scale data centers, which improves both performance-per-cost and endurance of the SSD cache. ECI-Cache dynamically assigns 1) an efficient cache size for each VM, to maximize the overall performance of the running VMs and 2) an effective write policy for each VM, to enhance the endurance and performance-per-cost of the storage subsystem.", "venue": "Abstracts of the 2018 ACM International Conference on Measurement and Modeling of Computer Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "Conference"], "publicationDate": "2018-06-12", "journal": {"name": "Abstracts of the 2018 ACM International Conference on Measurement and Modeling of Computer Systems"}, "authors": [{"authorId": "40914288", "name": "Saba Ahmadian"}, {"authorId": "145929920", "name": "O. Mutlu"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "7e5ba999baf58eb71cb021151db280d2d5470519", "title": "MLCache: A Space-Efficient Cache Scheme based on Reuse Distance and Machine Learning for NVMe SSDs"}, {"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays"}, {"paperId": "0bab05d4a887009b51267a0cd90e945d16bff83e", "title": "Fair Write Attribution and Allocation for Consolidated Flash Cache"}, {"paperId": "6b8b39aaf8297756fc755064437db212e6a7d467", "title": "Evaluating Reliability of SSD-Based I/O Caches in Enterprise Storage Systems"}, {"paperId": "4b206de446fd85120b034a8ea40a157ad568f2f3", "title": "An Analytical Model for Performance and Lifetime Estimation of Hybrid DRAM-NVM Main Memories"}, {"paperId": "9f35c25377f322d975527bfe070c535c1284e659", "title": "Modeling Impact of Human Errors on the Data Unavailability and Data Loss of Storage Systems"}]}
