{"paperId": "04a11c2a3c24a51147602585154ede5f0ab789a6", "publicationVenue": {"id": "d33be1bb-cc7a-479d-83ca-3e3e7c947d23", "name": "Journal of Machine and Computing", "type": "journal", "alternate_names": ["J Mach Comput"], "issn": "2788-7669"}, "title": "Multilayer Seasonal Autoregressive Integrated Moving Average Models for Complex Network Traffic Analysis", "abstract": "The ever-increasing amount of network traffic generated by various devices and applications has made it crucial to have efficient methods for analyzing and managing network traffic. Traditional approaches, such as statistical modeling, have yet to be proven enough due to network traffic's complex nature and dynamic characteristics. Recent research has shown the effectiveness of complex network analysis techniques for understanding network traffic patterns. This paper proposes multilayer seasonal autoregressive integrated moving average models for analyzing and predicting network traffic. This approach considers the seasonal patterns and interdependencies between different layers of network traffic, allowing for a more accurate and comprehensive representation of the data. The Multilayer Seasonal Autoregressive Integrated Moving Average (MSARIMA) model consists of multiple layers, each representing a different aspect of network traffic, such as time of day, day of week, or type of traffic. Each layer is modeled separately using SARIMA, a popular time series forecasting technique. The models for different layers are combined to capture the overall behavior of network traffic. The proposed approach has several benefits over traditional statistical approaches. It can capture network traffic's complex and dynamic nature, including short-term and long-term seasonal patterns. It also allows for the detection of anomalies and the prediction of future traffic patterns with high accuracy.", "venue": "Journal of Machine and Computing", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-05", "journal": {"name": "Journal of Machine and Computing"}, "authors": [{"authorId": "2278110054", "name": "Prathipa Ravanappan"}, {"authorId": "2209800160", "name": "Maragatharajan M"}, {"authorId": "2278112691", "name": "Rashika Tiwari"}, {"authorId": "2278116522", "name": "Srihari T"}, {"authorId": "2278049189", "name": "Lavanya K"}], "citations": []}
