{"paperId": "04aa0bed274dd3ebf9e14359a01db9e5643a10ab", "publicationVenue": null, "title": "Parallelizing Intra-Window Join on Multicores: An Experimental Study", "abstract": "The intra-window join (IaWJ), i.e., joining two input streams over a single window, is a core operation in modern stream processing applications. This paper presents the first comprehensive study on parallelizing the IaWJ on modern multicore architectures. In particular, we classify IaWJ algorithms into lazy and eager execution approaches. For each approach, there are further design aspects to consider, including different join methods and partitioning schemes, leading to a large design space. Our results show that none of the algorithms always performs the best, and the choice of the most performant algorithm depends on: (i) workload characteristics, (ii) application requirements, and (iii) hardware architectures. Based on the evaluation results, we propose a decision tree that can guide the selection of an appropriate algorithm.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2188004", "name": "Shuhao Zhang"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "2101530688", "name": "Nus"}, {"authorId": "144030168", "name": "Richard T. B. Ma"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "b6404e9d00f5ffe11fc04b7e0833b3ebb640c68f", "title": "PECJ: Stream Window Join on Disorder Data Streams with Proactive Error Compensation"}, {"paperId": "791920f41603a99c838a6d6102b45ef237432a94", "title": "SWIX: A Memory-efficient Sliding Window Learned Index"}, {"paperId": "96d13084102077d3c3d3798f854d5a43aea8fd86", "title": "A Hardware-Conscious Stateful Stream Compression Framework for IoT Applications (Vision)"}, {"paperId": "3f3d9fd92fc9be0ce6d5fea353341a91619e2ade", "title": "CStream: Parallel Data Stream Compression on Multicore Edge Devices"}, {"paperId": "96d5b81e956810b7420ae065c563803ebaf0762b", "title": "Cracking-Like Join for Trusted Execution Environments"}, {"paperId": "fe0885596ade5abf95ddeae6b64182fcc5b913c3", "title": "Parallelizing Stream Compression for IoT Applications on Asymmetric Multicores"}, {"paperId": "f950f69c3c30b62f6bf963bedbccd5c6fbc66002", "title": "Scalable Online Interval Join on Modern Multicore Processors in OpenMLDB"}, {"paperId": "4c0e91e6e8349f462d529d950a41c489427a22e2", "title": "CompressStreamDB: Fine-Grained Adaptive Stream Processing without Decompression"}, {"paperId": "d67554d357f49a244f5b51b44528b7f2a23884a7", "title": "Algorithms for Windowed Aggregations and Joins on Distributed Stream Processing Systems"}, {"paperId": "680d0ec84e746393a7cf1b25477d408fa3498b87", "title": "What Is the Price for Joining Securely? Benchmarking Equi-Joins in Trusted Execution Environments"}, {"paperId": "cfc14fba96834b03bb4d169240039f340b0d8935", "title": "An Energy-Efficient Stream Join for the Internet of Things"}, {"paperId": "ed8b176d882b6452c6ebc66b444868b560bd5793", "title": "Benchmarking Stream Join Algorithms on GPUs: A Framework and its Application to the State-of-the-art"}, {"paperId": "2018198f5ff52904e90c9a7a328fb893494ba620", "title": "FLIRT: A Fast Learned Index for Rolling Time frames"}, {"paperId": "7a75f2b02774343a36c618db8e2c72ce49ec0ff9", "title": "Reproducibility Report for ACM SIGMOD 2021 Paper: “Parallelizing Intra-Window Join on Multicores: An Experimental Study”"}]}
