{"paperId": "04ab695a739c835d6a85656a2dc764c6b874b373", "publicationVenue": {"id": "070a8b94-9234-4a39-bff0-23e0c6b74464", "name": "International Conference on Statistical and Scientific Database Management", "type": "conference", "alternate_names": ["Stat Sci Database Manag", "SSDBM", "Statistical and Scientific Database Management", "Int Conf Stat Sci Database Manag"], "url": "http://www.ssdbm.org/"}, "title": "What is special about spatial data science and Geo-AI?", "abstract": "The importance of spatial data science and Geo-AI is growing with the rise of spatial and spatiotemporal big data (e.g., trajectories, remote-sensing images, census and geo-social media) [1-2]. Societal use cases include Agriculture (global crop monitoring, precision agriculture), Location-based services (e.g., navigation, ride-sharing), Public Health (e.g., monitoring disease spread), Environment and Climate (change detection, land-cover classification), Smart Cities (e.g., mapping buildings), etc. [1-2] Classical data science and AI (e.g., machine learning) often perform poorly when applied to spatial data sets because of the many reasons [1-5]. First, spatial data is embedded in a continuous space and classical statistics (e.g., correlation) are not robust to the modifiable areal unit problem. Second, spatial data-items have extended footprints (e.g., line strings, polygons) and implicit relationships (e.g., distance, touch). Third, high cost of spurious patterns requires guardrails (e.g., statistical significance tests) to reduce false positives. Furthermore, spatial autocorrelation and variability violate the classical assumption of data samples being generated independently from identical distributions, which risk models that are either inaccurate or inconsistent with the data. Thus, new methods are needed to analyze spatial data [1-5]. This talk surveys common and emerging methods for spatial classification and prediction (e.g., spatial autoregression, spatial decision trees [6], spatial variability aware neural networks [7]), as well as techniques for discovering interesting, useful and non-trivial patterns such as hotspots (e.g., circular, linear, arbitrary shapes [8]), interactions (e.g., co-locations [9], tele-connections), spatial outliers [10], and their spatio-temporal counterparts [3].", "venue": "International Conference on Statistical and Scientific Database Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2021-07-06", "journal": {"name": "Proceedings of the 33rd International Conference on Scientific and Statistical Database Management"}, "authors": [{"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "8f07f72aca4604bc97765b591e634250fc01abd5", "title": "Spatio-Causal Patterns of Sample Growth"}]}
