{"paperId": "04b58240f67a6495c46b4874a9521806ab15003d", "publicationVenue": null, "title": "λ -FL : Serverless Aggregation For Federated Learning", "abstract": "Advances in federated learning (FL) algorithms, along with technologies like differential privacy and homomorphic encryption, have led to FL being increasingly adopted and used in many application domains. Traditional tree-based parallelization schemes can enable FL aggregation to scale to thousands of participants, but (i) waste a lot of resources due to the fact that training on participants, as opposed to aggregation, is the bottleneck in many FL jobs, (ii) require a lot of effort for fault tolerance and elastic scalability. In this paper, we present a new architecture for FL aggregation, based on serverless technology/cloud functions. We describe how our design enables FL aggregation to be dynamically deployed only when necessary, elastically scaled to handle participant joins/leaves and is fault tolerant with minimal effort required on aggregator side. We also demonstrate that our prototype based on Ray (Moritz et al. 2018) scales to thousands of participants, and is able to achieve a > 90% reduction in resource utilization with minimal impact on aggregation latency.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "143863352", "name": "K. R. Jayaram"}, {"authorId": "46761645", "name": "Vinod Muthusamy"}, {"authorId": "18730445", "name": "Gegi Thomas"}, {"authorId": "2152638957", "name": "Ashish Verma"}, {"authorId": "47296533", "name": "M. Purcell"}], "citations": [{"paperId": "70210227462b7b3df498b32a30fd75dc7bb61dbd", "title": "FedLesScan: Mitigating Stragglers in Serverless Federated Learning"}, {"paperId": "00309b5b1fa392c3eead280c4483ff9d7dda7616", "title": "FLoX: Federated Learning with FaaS at the Edge"}, {"paperId": "8d21ba8b8c1e7a4bb5ec08bd2d7f6d3b36eff4b9", "title": "Towards cost-effective and resource-aware aggregation at Edge for Federated Learning"}]}
