{"paperId": "04b8d9bc6a5dba708d997a6287d4e43cb72317e9", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "A Machine Learning Solution Framework for Combatting COVID-19 in Smart Cities from Multiple Dimensions", "abstract": "The spread of COVID-19 across the world continue as efforts are been made from multi-dimension to curtail it is spread and provide treatment. The COVID-19 triggered partial and full lockdown across the globe in an effort to prevent it is spread. The COVID-19 causes serious fatalities with United States of America recording over 3,000 deaths within 24 hours, the highest in the world for a single day. In this paper, we propose a framework integrated with machine learning to curtail the spread of COVID-19 in smart cities. A novel mathematical model is created to show the spread of the COVID-19 in smart cities. The propose solution framework can generate, capture, store and analyze data using machine learning algorithms to detect, prevent the spread of COVID-19, forecast next epidemic, effective contact tracing, diagnose cases, monitor COVID-19 patient, COVID-19 vaccine development, track potential COVID-19 patients, COVID-19 drug discovery and provide better understand of the virus in smart cities. The study outlined case studies on the application of machine learning to help in the fight against COVID-19 in hospitals in smart cities across the world. The framework can provide guide for real world execution in smart cities. The propose framework has the potential for helping national healthcare systems in curtailing the COVID-19 pandemic in smart cities.", "venue": "medRxiv", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": null, "publicationDate": "2020-05-21", "journal": {"name": "medRxiv", "volume": ""}, "authors": [{"authorId": "9304618", "name": "A. Ezugwu"}, {"authorId": "2265914325", "name": "Ibrahim A.T. Hashem"}, {"authorId": "144382748", "name": "O. N. Oyelade"}, {"authorId": "1721261", "name": "H. Chiroma"}, {"authorId": "1403206186", "name": "M. Al-garadi"}, {"authorId": "2265912811", "name": "Idris N. Abdullahi"}, {"authorId": "103300097", "name": "O. Otegbeye"}, {"authorId": "2265915862", "name": "Amit K. Shukla"}, {"authorId": "2126419435", "name": "Mubarak Almutari"}], "citations": [{"paperId": "42564f660d0ffbb295c1c31ad69c2e46963e396f", "title": "Methods of Machine Learning in Epidemic Risk Assessment: The Case of the Covid-19"}, {"paperId": "fa78b0a84447765a93171403e40f58ca331f3402", "title": "Machine Learning Research Trends in Africa: A 30 Years Overview with Bibliometric Analysis Review"}, {"paperId": "ac1f1d86575925c5775f7ae73796dc4e67266b6d", "title": "Predictive analysis of COVID 19 disease based on mathematical modelling and machine learning techniques"}, {"paperId": "684873d93394b7320d5583b8e135de212bd548b6", "title": "How Should the Structure of Smart Cities Change to Predict and Overcome a Pandemic?"}, {"paperId": "731707a099ced9fefb1b68b684a03a0716f77d49", "title": "Water and wastewater digital surveillance for monitoring and early detection of the COVID-19 hotspot: industry 4.0"}, {"paperId": "ac8ea6e88bc83afe648c449d2eab1e6ff91520d4", "title": "COVID‐19 and Machine Learning Approaches to Deal With the Pandemic"}, {"paperId": "17fe52adfa33a505da53919eebf5aa9da7634d56", "title": "Smart Cities Development During and Post COVID-19 Pandemic – A Predictive Analysis"}, {"paperId": "b2f9cf3717b3a04b1232ce78983b9c442b1a16cf", "title": "Ebola Optimization Search Algorithm (EOSA): A new metaheuristic algorithm based on the propagation model of Ebola virus disease"}, {"paperId": "b8b9d0d77c267d36061e4988f1b043a41917f454", "title": "CovFrameNet: An Enhanced Deep Learning Framework for COVID-19 Detection"}, {"paperId": "26d74e7657ce2a97fe797a6f34577940886da00b", "title": "Battling COVID-19 using machine learning: A review"}, {"paperId": "a04833f4cf162f57f894eb6771701ff8e2192892", "title": "A Pinnacle Technique for Detection of COVID-19 Fake News in Social Media"}, {"paperId": "75ff234a5f0908132c8e69172fe09d84ca62a8e1", "title": "Deep Learning Model for Improving the Characterization of Coronavirus on Chest X-ray Images Using CNN"}, {"paperId": "2f3aa8aad654ec7b4b5f7ce57b8f4ffdb61bda67", "title": "Applications of artificial intelligence in battling against covid-19: A literature review"}, {"paperId": "c4a6100db85b1d98738891fa5c3e4a5a11c9552d", "title": "COVID-19 Forecasting using Multivariate Linear Regression"}, {"paperId": "63136ead818a90fcb0aad06b235f3020f00da3f0", "title": "A case-based reasoning framework for early detection and diagnosis of novel coronavirus"}, {"paperId": "b47a79d1e6c731c1d468744580083607166ae323", "title": "Artificial Intelligence and Machine Learning for Health Risks Prediction"}, {"paperId": "d2089a02fe693ded75f38072095f7c238782cd8c", "title": "Detection of Covid-19 Fake News text data using Random Forest and Decision tree Classifiers"}, {"paperId": "93372ae944b01f3d23936b30c5ffa2b19d8d5d2a", "title": "Covid-19 Forecasting using Supervised Machine Learning Techniques – Survey"}, {"paperId": "6e2ee8e151895197291e0f44e61b5137de41c3c0", "title": "Chaos, Solitons and Fractals"}, {"paperId": "cce159279fd1b5447ea444b7c07fba942985b3c2", "title": "Currently Used Diagnostic Techniques for The Detection of SARS COV-2 Coronavirus"}]}
