{"paperId": "04c281b83045b9ad3d8380edac0aee81d9c782ca", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Securing Pathways with Orthogonal Robots", "abstract": "The protection of pathways holds immense significance across various domains, including urban planning, transportation, surveillance, and security. This article introduces a groundbreaking approach to safeguarding pathways by employing orthogonal robots. The study specifically addresses the challenge of efficiently guarding orthogonal areas with the minimum number of orthogonal robots. The primary focus is on orthogonal pathways, characterized by a path-like dual graph of vertical decomposition. It is demonstrated that determining the minimum number of orthogonal robots for pathways can be achieved in linear time. However, it is essential to note that the general problem of finding the minimum number of robots for simple polygons with general visibility, even in the orthogonal case, is known to be NP-hard. Emphasis is placed on the flexibility of placing robots anywhere within the polygon, whether on the boundary or in the interior.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-19", "journal": {"name": "ArXiv", "volume": "abs/2308.10093"}, "authors": [{"authorId": "1830416451", "name": "Hamid Hoorfar"}, {"authorId": "2005011426", "name": "Faraneh Fathi"}, {"authorId": "2232780223", "name": "Sara Moshtaghi Largani"}, {"authorId": "144605535", "name": "Alireza Bagheri"}], "citations": [{"paperId": "87c9dbe5a3c9b21258894a105d307d545d785459", "title": "Optimal Path Planning for Aerial Load Transportation in Complex Environments using PSO-Improved Artificial Potential Fields"}, {"paperId": "d593860e5bdcb4bf2adcc4768ec55c93ed52bd9b", "title": "Minimizing Turns in Watchman Robot Navigation: Strategies and Solutions"}, {"paperId": "3f1c068875dcb82def237e56ab6c14a1de3c8fcb", "title": "Advancing Robot Perception in Non-Spiral Environments through Camera-based Image Processing"}]}
