{"paperId": "04c57373c6111dc47810d5f01e8cbd1b2e47e86d", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Osmotic Cloud-Edge Intelligence for IoT-Based Cyber-Physical Systems", "abstract": "Artificial Intelligence (AI) in Cyber-Physical Systems allows machine learning inference on acquired data with ever greater accuracy, thanks to models trained with massive amounts of information generated by Internet of Things devices. Edge Intelligence is increasingly adopted to execute inference on data at the border of local networks, exploiting models trained in the Cloud. However, the training tasks on Edge nodes are not supported yet with flexible dynamic migration between Edge and Cloud. This paper proposes a Cloud-Edge AI microservice architecture, based on Osmotic Computing principles. Notable features include: (i) containerized architecture enabling training and inference on the Edge, Cloud, or both, exploiting computational resources opportunistically to reach the best prediction accuracy; and (ii) microservice encapsulation of each architectural module, allowing a direct mapping with Commercial-Off-The-Shelf (COTS) components. Grounding on the proposed architecture: (i) a prototype has been realized with commodity hardware leveraging open-source software technologies; and (ii) it has been then used in a small-scale intelligent manufacturing case study, carrying out experiments. The obtained results validate the feasibility and key benefits of the approach.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "3205335", "name": "G. Loseto"}, {"authorId": "1696528", "name": "Floriano Scioscia"}, {"authorId": "1686717", "name": "M. Ruta"}, {"authorId": "2984062", "name": "F. Gramegna"}, {"authorId": "3011421", "name": "S. Ieva"}, {"authorId": "1523809705", "name": "Corrado Fasciano"}, {"authorId": "9548168", "name": "Ivano Bilenchi"}, {"authorId": "2147159664", "name": "Davide Loconte"}], "citations": [{"paperId": "e4c617dab84949b8146be60403b6498542d6c1e9", "title": "Expanding the cloud-to-edge continuum to the IoT in serverless federated learning"}, {"paperId": "a488ec9d53d410945c9e63da120da5b6f3d095e6", "title": "A Survey of AI Techniques in IoT Applications with Use Case Investigations in the Smart Environmental Monitoring and Analytics in Real-Time IoT Platform"}, {"paperId": "c221ef5bde49c370bcce00f540e9cc130e2ee18f", "title": "Deep Reinforcement Learning for Containerized Edge Intelligence Inference Request Processing in IoT Edge Computing"}, {"paperId": "77af09e141dc1a3b17a437842c9ca99ec5a6acd3", "title": "Integration of Digital Twin, Machine-Learning and Industry 4.0 Tools for Anomaly Detection: An Application to a Food Plant"}]}
