{"paperId": "04cb161ebbea59edd6b87de3163960180a98b434", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Bi-objective Hyper-Heuristic Support Vector Machines for Big Data Cyber-Security", "abstract": "Cyber security in the context of big data is known to be a critical problem and presents a great challenge to the research community. Machine learning algorithms have been suggested as candidates for handling big data security problems. Among these algorithms, support vector machines (SVMs) have achieved remarkable success on various classification problems. However, to establish an effective SVM, the user needs to define the proper SVM configuration in advance, which is a challenging task that requires expert knowledge and a large amount of manual effort for trial and error. In this paper, we formulate the SVM configuration process as a bi-objective optimization problem in which accuracy and model complexity are considered as two conflicting objectives. We propose a novel hyper-heuristic framework for bi-objective optimization that is independent of the problem domain. This is the first time that a hyper-heuristic has been developed for this problem. The proposed hyper-heuristic framework consists of a high-level strategy and low-level heuristics. The high-level strategy uses the search performance to control the selection of which low-level heuristic should be used to generate a new SVM configuration. The low-level heuristics each use different rules to effectively explore the SVM configuration search space. To address bi-objective optimization, the proposed framework adaptively integrates the strengths of decomposition- and Pareto-based approaches to approximate the Pareto set of SVM configurations. The effectiveness of the proposed framework has been evaluated on two cyber security problems: Microsoft malware big data classification and anomaly intrusion detection. The obtained results demonstrate that the proposed framework is very effective, if not superior, compared with its counterparts and other algorithms.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-06", "journal": {"name": "IEEE Access", "pages": "10421-10431", "volume": "6"}, "authors": [{"authorId": "1779846", "name": "Nasser R. Sabar"}, {"authorId": "143824407", "name": "X. Yi"}, {"authorId": "39881203", "name": "A. Song"}], "citations": [{"paperId": "9869086b799cf07f7605e270e905c935a0d027d7", "title": "Comparison of Advanced Classification Algorithms Based Intrusion Detection from Real-Time Dataset"}, {"paperId": "14b47fd918a272109402970f4d60f75f24d6638c", "title": "A CNN Deep Learning Technique for Botnet Attack Detection for IoT Application"}, {"paperId": "2cca3a7486a88678eef0cca985459f1ce42d97ea", "title": "A Multi-Objective Hyper-Heuristic Improved Configuration of Svm Based on Particle Swarm Optimization for Big Data Cyber Security"}, {"paperId": "e87e6f758f765cdcbbc25766206f77de3e4ca4b1", "title": "Security Issues and Mitigation Mechanisms in Distributed Systems"}, {"paperId": "892929ce9cbdb77cc7d2275f6b066ee6c7635aea", "title": "Artificial Intelligence and Human Psychology in Online Transaction Fraud"}, {"paperId": "76106f9ca9df3758fcaa4e7f6d4c67692e8ab509", "title": "Detection and defending the XSS attack using novel hybrid stacking ensemble learning-based DNN approach"}, {"paperId": "8ca9956bbd26fa16b655d98cb7ab4c21f9739fe1", "title": "A hybrid heuristics artificial intelligence feature selection for intrusion detection classifiers in cloud of things"}, {"paperId": "4610bd4da006517f3c3ab3ca51c2fa05ba0483b3", "title": "Dimensionality reduction of the attributes using fuzzy optimized independent component analysis for a Big Data Intrusion Detection System"}, {"paperId": "2f024b7931d9139b00d486b9cd729face7346bbe", "title": "Hyper-Heuristic Firefly Algorithm Based Convolutional Neural Networks for Big Data Cyber Security"}, {"paperId": "6bfba6987654bcf4ca5647eac47ec149474890e3", "title": "Distributed denial of service attack detection in cloud computing using hybrid extreme learning machine"}, {"paperId": "1ff14b5e3c02dcd35598767ee2ab3de6db741b35", "title": "Modified ISR hyper-heuristic for tuning automatic genetic clustering chromosome size"}, {"paperId": "3bf31d85ae3989d62474a22655ee56b3ce84f00d", "title": "Machine Learning and Deep Learning Models for Big Data Issues"}, {"paperId": "d8694c9737a3b572a51ee9f80ceb3b6d34529ce8", "title": "Software Development and Design of Network Security System Under Big Data Analysis"}, {"paperId": "692fb7c661cb83356d803b5013b1890eb1b1c838", "title": "A Systematic Review of Defensive and Offensive Cybersecurity with Machine Learning"}, {"paperId": "b2e7ab401ad5be916d31da3fa9b1c8c0112d1248", "title": "CUSTOMHyS: Customising Optimisation Metaheuristics via Hyper-heuristic Search"}, {"paperId": "be008fc970368e97eea30587d045da3438127eeb", "title": "Computational Intelligence Enabled Cybersecurity for the Internet of Things"}, {"paperId": "f58f110a21fafc6dc4c7e8bbbe7c7951ed8578f6", "title": "Machine learning approach for detection of fileless cryptocurrency mining malware"}, {"paperId": "f63251df5e6c517ce1b6631356564d4fd65c80d0", "title": "A dynamic MLP-based DDoS attack detection method using feature selection and feedback"}, {"paperId": "0ad0def8d695a0b6ea51b17532e4f933ffa0da5d", "title": "A Survey on Representation Learning Efforts in Cybersecurity Domain"}, {"paperId": "c404659c8f84c075aa6d027bf652e26055eb0fd4", "title": "Cyber Security Affairs in Empowering Technologies"}, {"paperId": "86a5b27f15c4217cd8440f86c22de0815c715e6e", "title": "Big Data Issues in Smart Grids: A Survey"}, {"paperId": "7dc62f8ced7f3910ef879a05a8feabc3783d174f", "title": "An Emperical Study on Application of Big Data Analytics to Automate Service Desk Business Process"}, {"paperId": "d05d86db86a4ac0d95e6dcd951b42a9651939793", "title": "Deep Learning Approach for Intelligent Intrusion Detection System"}, {"paperId": "90b1c1097d83ff48592affac8425e89d26653bd4", "title": "Use of Apache Flume in the Big Data Environment for Processing and Evaluation of the Data Quality of the Twitter Social Network"}, {"paperId": "659ed61942b9a3cdb128276950e60730d8c5ba21", "title": "A machine learning technique for Android malicious attacks detection based on API calls"}, {"paperId": "bf32bd8c021dcc389023d620a14ccb6b93ce0e6b", "title": "Metaheuristic Techniques in Attack and Defense Strategies for Cybersecurity: A Systematic Review"}, {"paperId": "4ea558335af09702943a896190814e7e2125aa99", "title": "Machine learning methods for cyber security intrusion detection: Datasets and comparative study"}, {"paperId": "86c0fdc823e9a5db1b47190475a58a995ebab50a", "title": "Big data classification with optimization driven MapReduce framework"}, {"paperId": "36df3ab8fc28ef543ab4ae22308a51d67853f3ba", "title": "Automated Design of Classification Algorithms"}, {"paperId": "48b6e2865a28e9a8d3198a030eb27829d1553523", "title": "Searching for the Strong AI for Cybersecurity"}, {"paperId": "f6f2f15c48efab19d530c0696f64bed2134c44e6", "title": "Artificial Intelligence for Cybersecurity: A Systematic Mapping of Literature"}, {"paperId": "f6844815e582656fbd17e4eeaed511890f7fe810", "title": "Host-based Intrusion Detection Systems Approach Artificial Intelligence"}, {"paperId": "84398cc46dd00e9ad8b9b42d27b21627e3c1248d", "title": "AINTUITIONISTIC FUZZY C-MEANS CLUSTERING BASED FEATURE SELECTION AND ENSEMBLE SUPPORT VECTOR MACHINE FRAMEWORK FOR BIG DATA CYBER-SECURITY"}, {"paperId": "2037859a74a7e7d9a1358d553196cb7977439691", "title": "Multi-Objective Evolutionary Optimization Algorithms for Machine Learning: A Recent Survey"}, {"paperId": "0bf9baeadf1156df1f72d260311ba3ba31807313", "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)"}, {"paperId": "260ceb80fa046d1f9e62d0048adf8d1b40c3bf7e", "title": "Comparative study on Embedded Feature Selection Techniques for Internet Traffic Classification"}]}
