{"paperId": "04f04ce74cbc0d848f33488ac9e037404b068f29", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Towards Digitalization of Water Supply Systems for Sustainable Smart City Development—Water 4.0", "abstract": "Urban water supply systems are complex and dynamic in nature, and as a result, can be considered complex to manage owing to enhanced urbanization levels, climate change, growing and varying consumer demands, and limited water resources. The operation of such a system must be managed effectively for sustainable water supply to satisfy the growing consumer demand. This creates a need for intelligent systems for the purposes of operational management. In recent years, computing technologies have been applied to water systems to assist water utilities in addressing some of these problems. Unfortunately, previous ICT solutions have not been able to provide the necessary support for applications to deal with the dynamics of water supply system environments. With the increasing growth in technology, the water sector is moving to the full phase of digitalization to enhance the sustainability of systems. Thus, a new industrial revolution in the water context (Water 4.0) is being researched. This is referred to as Water 4.0, which offers better possibilities to enhance the sustainability of water supply system operations. This paper presents an overview of Water 4.0 and its applications in enhancing water supply system operations. Key features of Water 4.0 are discussed. Furthermore, challenges and future opportunities offered by technology for sustainable operation of municipal water services are discussed.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-09-13", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "29415922", "name": "K. Adedeji"}, {"authorId": "15571299", "name": "A. Ponnle"}, {"authorId": "1403308610", "name": "A. Abu-Mahfouz"}, {"authorId": "3425142", "name": "A. Kurien"}], "citations": [{"paperId": "155f21bc1d92762e847eae0419de361e4a32e7e3", "title": "A Formal Model for Reliable Data Acquisition and Control in Legacy Critical Infrastructures"}, {"paperId": "31894ebc585f01e56d323669ae196bacdae21316", "title": "Digital Twin Platform for Water Treatment Plants Using Microservices Architecture"}, {"paperId": "e6f3bb1c1643d346f3e26f912bcbcffd64ab1224", "title": "Application of a decision support system for monitoring and maintenance management of water valley tank facilities: A technological transformation toward sector sustainability"}, {"paperId": "47cad4f865f559fc53d179e6119f290e2753bd94", "title": "Delay and Energy Efficient Offloading Strategies for an IoT Integrated Water Distribution System in Smart Cities"}, {"paperId": "8f59fdad35c46ebb4d51216eb1a1f24ad230c884", "title": "The impact of the number of high temporal resolution water meters on the determinism of water consumption in a district metered area"}, {"paperId": "2b6196962d909706a74faf09fdd06c4510e7d3ae", "title": "Energy, exergy, economic and environmental evaluation of solar desalination system comprising different enhanced surface absorber plates"}, {"paperId": "0ee03a4de546f90a1bd95d14c349330f729464e3", "title": "Digitalization of Water Distribution Systems in Small Cities, a Tool for Verification and Hydraulic Analysis: A Case Study of Pamplona, Colombia"}, {"paperId": "8e841050103e5b97a08ab58cdbafc750943190d4", "title": "Industry 4.0 as a strategy to contribute to the water supply universalization in developing countries"}, {"paperId": "2fb34c6e9716200437df5efc31fe3247c53a82da", "title": "Drinking Water Quality Assessment Using a Fuzzy Inference System Method: A Case Study of Rome (Italy)"}, {"paperId": "fb83e873994bd6889483beb265ec10388ccc4fe5", "title": "IoT-Based Waste Management System in Formal and Informal Public Areas in Mecca"}, {"paperId": "d7d36c2ce99356505ae79125fcbc943cac14ce42", "title": "A formal model for reliable digital transformation of water distribution networks"}]}
