{"paperId": "04f0228863d56891ff96fe8c8b6b59c6a31b7a92", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "HyPDS: Enabling a Hybrid File Transfer Protocol and Peer to Peer Content Distribution System for Remote Sensing Data", "abstract": "With the rapid development of remote sensing technologies, high-resolution remote sensing data has been widely studied and applied in many fields, such as geography, agriculture, and earthquake detection. However, providing users with efficient remote sensing data distribution services is a huge challenge, which is due to the timeliness and the shorter update cycle of remote sensing data. In this paper, we propose HyPDS, a hybrid File Transfer Protocol-Peer to Peer (FTPP2P) content distribution system for remote sensing data. A main problem in the design of a HyPDS content distribution system is therefore how to efficiently utilize the bandwidth of downloading peer nodes so as to maximize utilization rate of the downstream bandwidth of the resource requesting nodes of the system. Using the real-world measurements, we identify the key factor that affects the utilization rate of the downstream bandwidth of the resource requesting nodes and thus construct a fine-grained performance model (i.e., P2P-FTP) to address the optimal bandwidth allocation problem. We also have deployed HyPDS on the real-world system platform, which has more than 100 Terabytes (TB) of remote sensing data resources in the key Laboratory of Aerospace Information Applications. Experimental results showed that HyPDS has significantly outperformed the state-of-the-art approaches in maximizing the bandwidth usage, with a maximum increase of 45%.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE 25th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "529-534"}, "authors": [{"authorId": "2111498035", "name": "Zhuang Chen"}, {"authorId": "2152879707", "name": "Qian He"}, {"authorId": "80766787", "name": "Bingcheng Jiang"}, {"authorId": "2119907044", "name": "Li Cao"}, {"authorId": "2146311517", "name": "Feng Li"}], "citations": [{"paperId": "82202aff84d6167204a30f36e29a98a8a219b3d4", "title": "QoS Control Method Based on SDN for Mobile Cloud Service"}, {"paperId": "2a1b29a36133f10225a1e5792efb2bc4c6f1a173", "title": "BTS-PD: A Blockchain Based Traceability System for P2P Distribution"}, {"paperId": "88c38f14a18f5baa4862c8f2a6d178ba2dc24254", "title": "Table of Contents"}, {"paperId": "e3d9bb4407b4b85ff5f9336828545c4039ae13c1", "title": "A Fine-Grained System Driven of Attacks Over Several New Representation Techniques Using Machine Learning"}, {"paperId": "f6ff1af38aa49196fb0e8edcda2627dd963a9784", "title": "BDSS: Blockchain-Based Data Synchronization System"}]}
