{"paperId": "04f1ef6b20db81d03e298ca57e0bafc294e5a4d5", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Survey on Deep Learning Based Forest Environment Sound Classification at the Edge", "abstract": "Forest ecosystems are of paramount importance to the sustainable existence of life on earth. Unique natural and artificial phenomena pose severe threats to the perseverance of such ecosystems. With the advancement of artificial intelligence technologies, the effectiveness of implementing forest monitoring systems based on acoustic surveillance has been established due to the practicality of the approach. It can be identified that with the support of transfer learning, deep learning algorithms outperform conventional machine learning algorithms for forest acoustic classification. Further, a clear requirement to move the conventional cloud-based sound classification to the edge is raised among the research community to ensure real-time identification of acoustic incidents. This article presents a comprehensive survey on the state-of-the-art forest sound classification approaches, publicly available datasets for forest acoustics, and the associated infrastructure. Further, we discuss the open challenges and future research aspects that govern forest acoustic classification.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-01", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 36", "volume": "56"}, "authors": [{"authorId": "49935593", "name": "D. Meedeniya"}, {"authorId": "2206253880", "name": "Isuru Ariyarathne"}, {"authorId": "2206253961", "name": "M. Bandara"}, {"authorId": "2206183492", "name": "Roshinie Jayasundara"}, {"authorId": "2121000333", "name": "Charith Perera"}], "citations": [{"paperId": "a76b1f98cb38a668514f6ca94111943240ed2833", "title": "A Comparative Study of Preprocessing and Model Compression Techniques in Deep Learning for Forest Sound Classification"}]}
