{"paperId": "04f4fb7448ce3bfad335a618a0b6fc84f695149c", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "User-Centric BIM-Based Framework for HVAC Root-Cause Detection", "abstract": "In the building operation phase, the Heating, Ventilation, and Air-Conditioning (HVAC) equipment are the main contributors to excessive energy consumption unless proper design and maintenance is carried out. Moreover, HVAC problems might have an impact on occupants’ discomfort in thermal comfort. Hence, the identification of the root cause of HVAC problems is imperative for facility managers to plan preventive and corrective maintenance actions. However, due to the complex interaction between various equipment and the lack of data integration among Facility Management (FM) systems, they fail to provide necessary information to identify the root cause of HVAC problems. Building Information Modelling (BIM) is a potential solution for maintenance activities to address the challenges of information reliability and interoperability. Therefore, this paper presents a novel conceptual model and user-centric framework to determine the causes of HVAC problems implemented in BIM for its visualization. CMMS and BMS data were integrated into BIM and utilized by the framework to analyze the root cause of HVAC problems. A case study in a university building was used to demonstrate the applicability of the approach. This framework assists the FM team to determine the most probable cause of an HVAC problem, reducing the time to detect equipment faults, and providing potential actions to solve them.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-17", "journal": {"name": "Energies"}, "authors": [{"authorId": "120350679", "name": "Hamid Alavi"}, {"authorId": "3002715", "name": "N. Forcada"}], "citations": [{"paperId": "e478540d2ac6e87fe032c61b6007e764d61ebe96", "title": "BIM-based automated fault detection and diagnostics of HVAC systems in commercial buildings"}, {"paperId": "ace870920f8a36d8dfcf0a5984bf4a92d720811c", "title": "Integrating Digital Twins with BIM for Enhanced Building Control Strategies: A Systematic Literature Review Focusing on Daylight and Artificial Lighting Systems"}, {"paperId": "818e92b9c96edab2574efdc1a66b5cbf56b06d63", "title": "HVAC maintainability risks in healthcare facilities: a design optimization perspective"}, {"paperId": "3c6595bfa7a0ddd154db0df66e9cd74b93117d8b", "title": "Building Information Modeling and Geographic Information System: Integrated Framework in Support of Facility Management (FM)"}, {"paperId": "c440625ebb56ab88f96211867a0b38a770a46dd8", "title": "The contextual information requirements for collection and use of occupant feedback in BIM-enabled FM"}, {"paperId": "86cd7aba7d67115962bae773f4e420957d5c9853", "title": "From Building Information Model to Digital Twin: A Framework for Building Thermal Comfort Monitoring, Visualizing, and Assessment"}, {"paperId": "ab3c876f4df3fc447bc8c6bf8c6b8e0370a098a0", "title": "Augmented reality-based facility maintenance management system"}, {"paperId": "f6d574004195b86936da0fcf819809b2ff335326", "title": "Applications of Building Information Modelling in the Operation and Maintenance Phase of Construction Projects: A Framework for the Malaysian Construction Industry"}, {"paperId": "6ae28dd52ec91ac0bb2a1f1d842c457a82864d47", "title": "Improving Building Occupant Comfort through a Digital Twin Approach: A Bayesian Network Model and Predictive Maintenance Method"}, {"paperId": "20033a9e646bc44d73793cb6ef31f6154587bbe3", "title": "Digital Twins’ Applications for Building Energy Efficiency: A Review"}, {"paperId": "679a58d10d23d85ccebe5ead5af2884611f412ef", "title": "Predictive Maintenance 4.0 for Chilled Water System at Commercial Buildings: A Systematic Literature Review"}, {"paperId": "ac731fc39b8132e06e77dce6f6d0ad441a7c7291", "title": "Feasibility study of the UXindoor framework in two public office buildings: A standardized approach to scoring indoor user experience with qualitative and quantitative techniques"}]}
