{"paperId": "04f81df82f7f6c1c18913ef626143498dbfcd508", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Research on Information Fusion for Machine Potential Fault Operation and Maintenance", "abstract": "In recent years, the development of sensor technology in industry has profoundly changed the way of operation and management in manufacturing enterprises. Due to the popularization and promotion of sensors, the maintenance of machines on the production line are also changing from the subjective experience-based machine maintenance to objective data-driven maintenance decision-making. Therefore, more and more data decision model has been developed through AI technology and intelligence algorithms. Equally important, the information fusion between decision results, which got by data decision model, has also received widespread attention. Information fusion is performed on symmetric data structures. The asymmetric data under the symmetric structure leads to the difference in information fusion results. Therefore, fully considering the potential differences of asymmetric data under a symmetric structure is an important content of information fusion. In view of the above, this paper studies how to make information fusion between different decision results through the framework of D-S evidence theory and discusses the deficiency of D-S evidence theory in detail. Based on D-S evidence theory, then a comprehensive evidence method for information fusion is proposed in this paper. We illustrate the rationality and effectiveness of our method through analysis of experiment case. And, this method is applied to a real case from industry. Finally, the irrationality of the traditional D-S method in the comprehensive decision-making results of machine operation and maintenance was solved by our novel method.", "venue": "Symmetry", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-03", "journal": {"name": "Symmetry", "pages": "375", "volume": "12"}, "authors": [{"authorId": "153039925", "name": "W. Xu"}, {"authorId": "2075390039", "name": "Yi Wan"}, {"authorId": "1491241347", "name": "Tian-Yu Zuo"}, {"authorId": "1656661504", "name": "Xin-Mei Sha"}], "citations": []}
