{"paperId": "0505992289a3f902ad628104f92f2af21da38a03", "publicationVenue": null, "title": "Too human and not human enough: A grounded theory analysis of mental health harms from emotional dependence on the social chatbot Replika", "abstract": "Social chatbot (SC) applications offering social companionship and basic therapy tools have grown in popularity for emotional, social, and psychological support. While use appears to offer mental health benefits, few studies unpack the potential for harms. Our grounded theory study analyzes mental health experiences with the popular SC application Replika. We identified mental health relevant posts made in the r/Replika Reddit community between 2017 and 2021 ( n = 582). We find evidence of harms, facilitated via emotional dependence on Replika that resembles patterns seen in human–human relationships. Unlike other forms of technology dependency, this dependency is marked by role-taking, whereby users felt that Replika had its own needs and emotions to which the user must attend. While prior research suggests human–chatbot and human–human interactions may not resemble each other, we identify social and technological factors that promote parallels and suggest ways to balance the benefits and risks of SCs.", "venue": "New Media &amp; Society", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-22", "journal": {"name": "New Media &amp; Society"}, "authors": [{"authorId": "6309435", "name": "L. Laestadius"}, {"authorId": "145974610", "name": "Andrea Bishop"}, {"authorId": "2110224228", "name": "Michael Gonzalez"}, {"authorId": "2198125035", "name": "Diana Illenčík"}, {"authorId": "1401193967", "name": "Celeste Campos-Castillo"}], "citations": [{"paperId": "0ba0da3e4e2780e4764483be8e60cc869da35dd3", "title": "The mechanisms of AI hype and its planetary and social costs"}, {"paperId": "039afd76e642e470fc2ba0b918bda9fbc469cca4", "title": "Which Artificial Intelligences Do People Care About Most? A Conjoint Experiment on Moral Consideration"}, {"paperId": "99d06b524d503477991f426683000641e87adb5b", "title": "When artificial intelligence substitutes humans in higher education: the cost of loneliness, student success, and retention"}, {"paperId": "963d3d23627053c2f36c58f99ed20a52e5d2e6e9", "title": "Development and validation of a scale for dependence on artificial intelligence in university students"}, {"paperId": "acc75f3c59db338617fe426d9b31553b060dad28", "title": "AI Technology panic—is AI Dependence Bad for Mental Health? A Cross-Lagged Panel Model and the Mediating Roles of Motivations for AI Use Among Adolescents"}, {"paperId": "a3b20605f88a611dc8e1f986e41b980ed9d0ab35", "title": "The Affective Scaffolding of Grief in the Digital Age: The Case of Deathbots"}, {"paperId": "71b185330f7ae80e6c3405195175ee59d808d22c", "title": "Explainable AI is Responsible AI: How Explainability Creates Trustworthy and Socially Responsible Artificial Intelligence"}, {"paperId": "451140247fdba1a86eeae8cda0e6e38f8feb5e51", "title": "Examining the Role of Genuine Emotions for Trustworthy AI"}, {"paperId": "6a5659e0c064aa1d2c6b899acf7fcc9fcf2c98a5", "title": "Chatbots as social companions: How people perceive consciousness, human likeness, and social health benefits in machines"}, {"paperId": "8088907f41c1d7d0e4e35da26d7b4df09d9021dd", "title": "The Experience of Conversation and Relation with a Well-Being Chabot: Between Proximity and Remoteness"}, {"paperId": "8056e90633634a4ff8bdca50335db46d0fdc47bb", "title": "Fifty Shades of ChatGPT : Aktueller Diskussions- und Forschungsstand zu Sex und künstlicher Intelligenz"}, {"paperId": "0c22b10bff0a838948e208e27fcb94b9fd2f3936", "title": "How intelligent automation, service robots, and AI will reshape service products and their delivery"}, {"paperId": "0b101f31f380add5ec6b9ec08bb1a32ded017d9b", "title": "Artificial Intelligence in Ecology: A Commentary on a Chatbot's Perspective"}, {"paperId": "51b411bc8a1252ab1329d615b5da9b5227a06bc6", "title": "Consumer–machine relationships in the age of artificial intelligence: Systematic literature review and research directions"}]}
