{"paperId": "050b64c2343ef3c7f0c60285e4429e9bb8175dff", "publicationVenue": null, "title": "Automotive big data: Applications, workloads and infrastructures", "abstract": "Data is increasingly affecting the automotive industry, from vehicle development, to manufacturing and service processes, to online services centered around the connected vehicle. Connected, mobile and Internet of Things devices and machines generate immense amounts of sensor data. The ability to process and analyze this data to extract insights and knowledge that enable intelligent services, new ways to understand business problems, improvements of processes and decisions, is a critical capability. Hadoop is a scalable platform for compute and storage and emerged as de-facto standard for Big Data processing at Internet companies and in the scientific community. However, there is a lack of understanding of how and for what use cases these new Hadoop capabilities can be efficiently used to augment automotive applications and systems. This paper surveys use cases and applications for deploying Hadoop in the automotive industry. Over the years a rich ecosystem emerged around Hadoop comprising tools for parallel, in-memory and stream processing (most notable MapReduce and Spark), SQL and NOSQL engines (Hive, HBase), and machine learning (Mahout, MLlib). It is critical to develop an understanding of automotive applications and their characteristics and requirements for data discovery, integration, exploration and analytics. We then map these requirements to a confined technical architecture consisting of core Hadoop services and libraries for data ingest, processing and analytics. The objective of this paper is to address questions, such as: What applications and datasets are suitable for Hadoop? How can a diverse set of frameworks and tools be managed on multi-tenant Hadoop cluster? How do these tools integrate with existing relational data management systems? How can enterprise security requirements be addressed? What are the performance characteristics of these tools for real-world automotive applications? To address the last question, we utilize a standard benchmark (TPCx-HS), and two application benchmarks (SQL and machine learning) that operate on a dataset of multiple Terabytes and billions of rows.", "venue": "2015 IEEE International Conference on Big Data (Big Data)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2015-10-29", "journal": {"name": "2015 IEEE International Conference on Big Data (Big Data)", "pages": "1201-1210"}, "authors": [{"authorId": "50631038", "name": "André Luckow"}, {"authorId": "2052631495", "name": "Ken E. Kennedy"}, {"authorId": "2243334642", "name": "Fabian Manhardt"}, {"authorId": "2320100", "name": "Emil Djerekarov"}, {"authorId": "30237179", "name": "Bennie Vorster"}, {"authorId": "1748096", "name": "A. Apon"}], "citations": [{"paperId": "dacba3106e3219bc548ec04ab9d357a28c4f419d", "title": "Role of IoT technologies in big data management systems: A review and Smart Grid case study"}, {"paperId": "2b92c0f4205661ea1ca4decab9229e3916696020", "title": "Unveiling Objects with SOLA: An Annotation-Free Image Search on the Object Level for Automotive Data Sets"}, {"paperId": "ba381adf571b2d716d3436474c9f41bca0fbfc62", "title": "Big data as an exploration trigger or problem-solving patch: Design and integration of AI-embedded systems in the automotive industry"}, {"paperId": "11741b14d5b712c11624c65c9f14d2bbf9f9966c", "title": "Technical Design Space Analysis for Unobtrusive Driver Emotion Assessment Using Multi-Domain Context"}, {"paperId": "f6f370c5c6a5f4861f95bfe9638d749e5eee6086", "title": "Analysis of the Influence of Modeling, Data Format and Processing Tool on the Performance of Hadoop-Hive Based Data Warehouse"}, {"paperId": "0a6d49377e422a749660622bb785ad9642503d6b", "title": "Exploring privacy-enhancing technologies in the automotive value chain"}, {"paperId": "2deae11d8990f8387e92575ebad00686bb1bc9b6", "title": "Eco-efficient driving pattern evaluation for sustainable road transport based on contextually enriched automotive data"}, {"paperId": "6dba6ec3d009fa163fdb5960f8b65ddd7594e682", "title": "Framework for implementing big data analytics in Indian manufacturing: ISM-MICMAC and Fuzzy-AHP approach"}, {"paperId": "fae3c3c1d7d4da1916e1464dac9815b2cbbeb10c", "title": "Data-driven cyber-physical system framework for connected resistance spot welding weldability certification"}, {"paperId": "5e1caaa3c52e900968d3f1cb53faff94c0a84bb6", "title": "Industrial Internet of Learning (IIoL): IIoT based pervasive knowledge network for LPWAN—concept, framework and case studies"}, {"paperId": "ce009a429503d6a8826a2e13f31e0c918560ca5d", "title": "Edge Computing Enabled by Unmanned Autonomous Vehicles"}, {"paperId": "950ebc1b054d92a094bac5f0e0d7f28b97ddb8e4", "title": "Automotive Big Data Pipeline: Disaggregated Hyper-Converged Infrastructure vs Hyper-Converged Infrastructure"}, {"paperId": "247167e6e1c051c8e479976580738e7ad6266800", "title": "BIG MOBILITY DATA ANALYTICS FOR TRAFFIC MONITORING AND CONTROL"}, {"paperId": "80a8009b3a967d079155f6de5878042d1b50ae16", "title": "2.5D dust & magnet visualization for large multivariate data"}, {"paperId": "c69538e149f1d981547abf7bff365c0b963130a2", "title": "An Educational Platform for Automotive Software Development and Test"}, {"paperId": "1a53013fdd66e61ed117ef1fc90dcfbed5a473a5", "title": "Use cases and success stories of a data analytics system in an automotive Paint Shop"}, {"paperId": "69bd1d11809f49b29e407a5ef50fe3cea4ca9cb4", "title": "Location-based analysis of car-following behavior during braking using naturalistic driving data"}, {"paperId": "821fde6dc36d1264c765d249d4247ea66daff55f", "title": "Edge Machine Learning for AI-Enabled IoT Devices: A Review"}, {"paperId": "971c35bcab25fbf4fd4bb6e128cf2586f0ab1d67", "title": "Manufacturing big data ecosystem: A systematic literature review"}, {"paperId": "de509811cf5dda0773be9690dc0ed1be400dc7e6", "title": "Deployment of a cloud pipeline for real‐time visual inspection using fast streaming high‐definition images"}, {"paperId": "98453116cb0f51dc5a06e6e482a78bb3ec5af096", "title": "Management of analytics-as-a-service - results from an action design research project"}, {"paperId": "c4ef273259d9e5bd7186fad2fd44649143e1b537", "title": "Machine Learning Use Cases for Smart Manufacturing KPIs"}, {"paperId": "be59e3d17d3a01424795747ab12c8e8499a64ebb", "title": "Harmonizing Heterogeneous Diagnostic Data of a Vehicle Fleet for Data-Driven Analytics"}, {"paperId": "dd85bde75abe6c0b03b71774b4fd3079a51bdcaf", "title": "Tensor Analysis with n-Mode Generalized Difference Subspace"}, {"paperId": "ba43bfa3e2165a9f97424738f4b3dc1e314f5f79", "title": "Distributed Data Platform for Automotive Industry: A Robust Solution for Tackling Big Challenges of Big Data in Transportation Science"}, {"paperId": "57718027a423758f2d223f2b414ae2e366356195", "title": "Pervasive Data Science on the Edge"}, {"paperId": "eb7a7561eb1dd9aebe6629d56907759c6f1ce9ce", "title": "Innovation Management Methods in the Automotive Industry"}, {"paperId": "bee004c421d33253a70bfc423132f258fda04c8e", "title": "A Cloud-Based AI Framework for Machine Learning Orchestration: A “Driving or Not-Driving” Case-Study for Self-Driving Cars"}, {"paperId": "c0e5973455ef1ef8cf28224b64b034bc5d209793", "title": "A distributed lightning fast maritime anomaly detection service"}, {"paperId": "027c882f940a898fc0ff8c52ec2b3297630de4ed", "title": "The magnitude of big data 5vs in business macroclimate"}, {"paperId": "b8880a62d365c113a8e3187a2b8bdec582294455", "title": "Scalable Data Analytics from Predevelopment to Large Scale Manufacturing"}, {"paperId": "9af5333fd7e2b96b6159c307ebacca1fa9c134c8", "title": "The IEEE 1918.1 “Tactile Internet” Standards Working Group and its Standards"}, {"paperId": "44dfee6c1d066c3f03397ccc7cbd5e7a0f8b79a3", "title": "Artificial Intelligence and Deep Learning Applications for Automotive Manufacturing"}, {"paperId": "d80e2707925076bbfd06a696b17ae41a314137f4", "title": "Exhaustive Data- and Problem-Driven use Case Identification and Implementation for Electric Drive Production"}, {"paperId": "4ccbf1ee876a25bc4eec5df38b6e7bd417181cd5", "title": "Machine Learning with PySpark - Review"}, {"paperId": "8105df2690704b656030d95605e39757afa00127", "title": "Libraries in Internet of Things (IoT) era"}, {"paperId": "f0585b104dc53c267c85e9d096f6a62c757d97b6", "title": "A review of data driven approaches for circular economy in manufacturing"}, {"paperId": "db0175df5df3deb48753545625ca003fe3dd2640", "title": "BIG data – BIG gains? Understanding the link between big data analytics and innovation"}, {"paperId": "9435bdb2cb67145ff4e45f24ad8d3c8164c58ba1", "title": "Real-Time Monitoring of Road Traffic Using Data Stream Mining"}, {"paperId": "454b7a0806de86a95a7b7df8ed3f196aff66532d", "title": "Machine Learning Techniques in ADAS: A Review"}, {"paperId": "fb5d6279f1967fc73e83b7466679b2fbb9ec71c1", "title": "Fog Based Intelligent Transportation Big Data Analytics in The Internet of Vehicles Environment: Motivations, Architecture, Challenges, and Critical Issues"}, {"paperId": "f764f30c9af896daaee57a37e275dc1619ba94e5", "title": "Barriers to the Adoption of Big Data Analytics in the Automotive Sector"}, {"paperId": "adcda3bfb7cf8b09ce06b93c7170801bf3d0bef6", "title": "A Comparison of HDFS Compact Data Formats: Avro Versus Parquet"}, {"paperId": "79277d98f02a92fcf60bbacf7b2e0f5b9e1e8e2b", "title": "User interface support for a big ETL data processing pipeline an application scenario on highway toll charging models"}, {"paperId": "17f890b92ad243d7dfb9367ee069a6caef5ca606", "title": "SPARK – A Big Data Processing Platform for Machine Learning"}, {"paperId": "23771e8f8d1ea2bce3a1df464acef9296520c928", "title": "Clickstream Analysis for Crowd-Based Object Segmentation with Confidence"}, {"paperId": "58e15a19fad60512c9f71a7edc6dfdea175bcbf4", "title": "Accelerating data queries on Hadoop framework by using compact data formats"}, {"paperId": "0520a1d453006cfe1f1f5fa83bb495c4d8694d02", "title": "Visualization and Adaptive Subsetting of Earth Science Data in HDFS: A Novel Data Analysis Strategy with Hadoop and Spark"}, {"paperId": "b0ffaf10b6533c310663753672ffa9beb9bcda2c", "title": "An architecture for big data processing on intelligent transportation systems. An application scenario on highway traffic flows"}, {"paperId": "d128531fad5f6b1daf6a131e60ce642816de5918", "title": "Hadoop on HPC: Integrating Hadoop and Pilot-Based Dynamic Resource Management"}, {"paperId": "0ad30c04fdfc4cf14dd30d63ee23e3f5e77db1fe", "title": "Intelligent Data Handling in Current and Next-Generation Automated Vehicle Development—A Review"}, {"paperId": "c872cf8ff5d686de15628d0ef3504542fc058a68", "title": "Research on Big Data Theory and Trend of Quality Management in Automobile Industry"}, {"paperId": "fa49699e09bf7ba571bab473305b8467cc6e2c9f", "title": "GEESE: Edge computing enabled by UAVs"}, {"paperId": "29343c813065b40bab4087f2e38fc8c623abc003", "title": "Data Integration and Analysis Approaches in the Context of Automotive Events: A Case Study with Active Driver Assistance Systems"}, {"paperId": "40bb341e176d85c085571abc603329aceb2ba7d8", "title": "Actualizing big data analytics affordances: A revelatory case study"}, {"paperId": "d007ace08d15857aacdceaa133b351e37d598e70", "title": "Data Lake Architecture: A New Repository for Data Engineer"}, {"paperId": "8d71e050588f4b48f4f1fe3da9f6283846aa51a8", "title": "A critical evaluation of potential outcomes of using modern artificial intelligence and big data analysis technology in maritime industry"}, {"paperId": "7e9cda14adcc743ec4a4c835cc7e3ffa47731252", "title": "Data Processing and Harmonization for Intelligent Transportation Systems: An Application Scenario on Highway Traffic Flows"}, {"paperId": "3dfc28442741e3ac329782b300de5d2737efaad0", "title": "USING NATURALISTIC DRIVING DATA TO QUANTIFY DRIVER FOLLOWING BEHAVIOR DURING BRAKING"}, {"paperId": "ea376abc85f5709b6c2617ecc3aeae73f8243c9c", "title": "Costing models for capacity optimization in Industry 4.0: Trade-off between used capacity and operational efficiency"}, {"paperId": "485acaca3124855ea3db896f344025c3b7a5d23c", "title": "A Systematic Review of SQL-on-Hadoop by Using Compact Data Formats"}, {"paperId": "404d7ad5f1396736fd0141ca727aac6f553870fd", "title": "Big Data and Product Lifecycle Management"}, {"paperId": "ee21054e274c7902b05f568efdb7707614cfeeee", "title": "Data Infrastructure for Intelligent Transportation Systems"}, {"paperId": "bff52fe74a616517bf26be9917d2ef98717c311b", "title": "Characteristics of Intelligent Transportation Systems and Its Relationship With Data Analytics"}, {"paperId": "80bb132ebcdb45aaadf9f5346cc52c63fdadb6f5", "title": "BIG Data – BIG Gains? Empirical Evidence on the Link Between Big Data Analytics and Innovation"}, {"paperId": "3549c1a38258efacb6b3373b044483cc53a74148", "title": "www.econstor.eu BIG Data-BIG Gains? Understanding the Link Between Big Data Analytics and Innovation"}, {"paperId": "7447108b399ee2dfc816add4180158ea98a38548", "title": "Erklärung zur Verfassung der Arbeit"}, {"paperId": "d9a8e6356dd70c1bd2673b82ecf73873e29707b6", "title": "2016 Ieee International Conference on Big Data (big Data) Deep Learning in the Automotive Industry: Applications and Tools"}]}
