{"paperId": "051a855480c8bcf9c93d462fa4a63ef1d4cee674", "publicationVenue": null, "title": "Enabling In-Vitro Serverless Systems Research", "abstract": "Serverless is an increasingly popular cloud computing paradigm that has stimulated new systems research opportunities. However, developing and evaluating serverless systems in a research setting (i.e., \"in-vitro\", without access to a large-scale production cluster and real workloads) is challenging yet vital for innovation. Recently, several serverless providers have released production traces consisting of large sets of functions with their invocation inter-arrival time, execution time, and memory footprint distributions. However, executing the workload synthesized from these traces requires a massive cluster, making experiments expensive and time-consuming. In this work, we show how to use the data available in production traces to construct workload summaries of configurable scales that remain highly representative of the original trace characteristics and can be used to evaluate serverless systems in-vitro. Compared to random sampling of functions from the original trace, our method can generate summaries of up to 10X higher representativity, measured as the average of the Wasserstein distances of the distributions of interest (e.g., function execution time and invocation inter-arrival time) from the respective distributions in the original trace. We release our toolchain that enables researchers to synthesize representative workload summaries and show how it can be used to evaluate the performance of serverless systems at diverse load scale factors.", "venue": "WORDS@SOSP", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-10-23", "journal": {"name": "Proceedings of the 4th Workshop on Resource Disaggregation and Serverless"}, "authors": [{"authorId": "8000917", "name": "Dmitrii Ustiugov"}, {"authorId": "2259897481", "name": "Dohyun Park"}, {"authorId": "2256788349", "name": "Lazar Cvetković"}, {"authorId": "2244451013", "name": "Mihajlo Djokic"}, {"authorId": "2258824783", "name": "Hongyu Hè"}, {"authorId": "2309941", "name": "Boris Grot"}, {"authorId": "2285439911", "name": "Ana Klimovic"}], "citations": []}
