{"paperId": "0520a1d453006cfe1f1f5fa83bb495c4d8694d02", "publicationVenue": null, "title": "Visualization and Adaptive Subsetting of Earth Science Data in HDFS: A Novel Data Analysis Strategy with Hadoop and Spark", "abstract": "Data analytics becomes increasingly important in big data applications. Adaptively subsetting large amounts of data to extract the interesting events such as the centers of hurricane or thunderstorm, statistically analyzing and visualizing the subset data, is an effective way to analyze ever-growing data. This is particularly crucial for analyzing Earth Science data, such as extreme weather. The Hadoop ecosystem (i.e., HDFS, MapReduce, Hive) provides a cost-efficient big data management environment and is being explored for analyzing big Earth Science data. Our study investigates the potential of a MapReduce-like paradigm to perform statistical calculations, and utilizes the calculated results to subset as well as visualize data in a scalable and efficient way. RHadoop and SparkR are deployed to enable R to access and process data in parallel with Hadoop and Spark, respectively. The regular R libraries and tools are utilized to create and manipulate images. Statistical calculations, such as maximum and average variable values, are carried with R or SQL. We have developed a strategy to conduct query and visualization within one phase, and thus significantly improve the overall performance in a scalable way. The technical challenges and limitations of both Hadoop and Spark platforms for R are also discussed.", "venue": "2016 IEEE International Conferences on Big Data and Cloud Computing (BDCloud), Social Computing and Networking (SocialCom), Sustainable Computing and Communications (SustainCom) (BDCloud-SocialCom-SustainCom)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-10-01", "journal": {"name": "2016 IEEE International Conferences on Big Data and Cloud Computing (BDCloud), Social Computing and Networking (SocialCom), Sustainable Computing and Communications (SustainCom) (BDCloud-SocialCom-SustainCom)", "pages": "89-96"}, "authors": [{"authorId": "2115309158", "name": "Xi Yang"}, {"authorId": "144977052", "name": "Si Liu"}, {"authorId": "40444105", "name": "Kun Feng"}, {"authorId": "145012878", "name": "Shujia Zhou"}, {"authorId": "1746991", "name": "Xian-He Sun"}], "citations": [{"paperId": "83a29c498c1ce7e2470e76d01ec0c1affd8d2473", "title": "A Data Management Scheme for Micro-Level Modular Computation-Intensive Programs in Big Data Platforms"}, {"paperId": "85aea81ff3255013a113a08819871e62708495d5", "title": "An Intermediate Data-driven Methodology for Scientific Workflow Management System to Support Reusability"}, {"paperId": "9c9fd17e405931556db8b2b2de2262bd4ed24de3", "title": "Statistical Analysis for Detection of Sensitive Data Using Hadoop Clusters"}, {"paperId": "1d9a3f798143bf0cb53a752a455a79698f1f8057", "title": "Applying intelligent data traffic adaptation to high-performance multiple big data analytics platforms"}, {"paperId": "786b9a5e988db5d553a6ed8f86ae8cebe8967941", "title": "Kaleido: Enabling Efficient Scientific Data Processing on Big-Data Systems"}, {"paperId": "7c8ba645fbed9ca9227e35128e7733cbae19ce3f", "title": "Development of Multiple Big Data Analytics Platforms with Rapid Response"}, {"paperId": "2b233a280e175bc9f6c706dce96a2171cfa351f8", "title": "Development of multiple big data analysis platforms for business intelligence"}, {"paperId": "c8e75f9980428b58952fb7aa9bacacc2d653af7e", "title": "Development of Multiple Big Data Processing Platforms for Business Intelligence"}, {"paperId": "a4a6cd0983537a2e50d0fd829b9be5e6ad2cd88e", "title": "2016 Ieee International Conference on Big Data (big Data) Visualization and Diagnosis of Earth Science Data through Hadoop and Spark"}]}
