{"paperId": "052fcaf4425771f9e0fdc7afc9fde284610b3564", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Climatic and seismic data-driven deep learning model for earthquake magnitude prediction", "abstract": "The effects of global warming are felt not only in the Earth’s climate but also in the geology of the planet. Modest variations in stress and pore-fluid pressure brought on by temperature variations, precipitation, air pressure, and snow coverage are hypothesized to influence seismicity on local and regional scales. Earthquakes can be anticipated by intelligently evaluating historical climatic datasets and earthquake catalogs that have been collected all over the world. This study attempts to predict the magnitude of the next probable earthquake by evaluating climate data along with eight mathematically calculated seismic parameters. Global temperature has been selected as the only climatic variable for this research, as it substantially affects the planet’s ecosystem and civilization. Three popular deep neural network models, namely, long short-term memory (LSTM), bidirectional long short-term memory (Bi-LSTM), and transformer models, were used to predict the magnitude of the next earthquakes in three seismic regions: Japan, Indonesia, and the Hindu-Kush Karakoram Himalayan (HKKH) region. Several well-known metrics, such as the mean absolute error (MAE), mean squared error (MSE), log-cosh loss, and mean squared logarithmic error (MSLE), have been used to analyse these models. All models eventually settle on a small value for these cost functions, demonstrating the accuracy of these models in predicting earthquake magnitudes. These approaches produce significant and encouraging results when used to predict earthquake magnitude at diverse places, opening the way for the ultimate robust prediction mechanism that has not yet been created.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-20", "journal": {"volume": "11"}, "authors": [{"authorId": "37853454", "name": "Bikash Sadhukhan"}, {"authorId": "123364800", "name": "Shayak Chakraborty"}, {"authorId": "25573858", "name": "S. Mukherjee"}, {"authorId": "2322260", "name": "R. Samanta"}], "citations": [{"paperId": "fd6d99ec90eaca6028994ef443ced96b6156a917", "title": "Intrusion Detection in IoT Systems Using Ensemble Machine Learning Techniques"}, {"paperId": "451fb42de9950310ce8fc1946d845bf4afad19b4", "title": "Data Mining Earthquake Prediction with Multivariate Adaptive Regression Splines and Peak Ground Acceleration"}, {"paperId": "5106b7f759e759c376d51380cc406e9320ababab", "title": "Investigating the Fractality and Stationarity Behavior of Global Temperature Anomaly Time Series"}, {"paperId": "c6a0debadd37e8a78c9dbe874006475e9da51180", "title": "Electromagnetic Umbrella Modeling of Mega Meteorological Anomaly Disasters and Large Earthquake Associations"}, {"paperId": "f1b7d36b68b7fb06afe39a96656ca555e0dc9337", "title": "Electromagnetic Umbrella Modeling of Mega Meteorological Anomaly Disasters and Large Earthquake Associations"}]}
