{"paperId": "053b8da72411c42859685fe9535f87b847091a83", "publicationVenue": {"id": "9181819e-530e-4408-9917-93c5f58d7fce", "name": "International Congress on Information and Communication Technology", "type": "conference", "alternate_names": ["Int Conf Inf Comput Technol", "International Conference on Inventive Computation Technologies", "ICICT", "Int Congr Inf Commun Technol", "Int Conf Inven Comput Technol", "International Conference on Issues and Challenges in Intelligent Computing Techniques", "International Conference on Information and Computer Technologies", "Int Conf Issue Chall Intell Comput Tech"]}, "title": "Business Service Management using Blockchain", "abstract": "Blockchain is one of emerging research area and gaining attention due to its wide range of applications. Smart contracts are one of the latest application areas of blockchain, which enables secure, transparent and tamperproof transactions. Smart contracts create and verify the data with the help of hash functions. Hash functions are mathematical algorithms that take input and produces hashed output of specified length. It is very difficult to regenerate the original input from the hashed output. Ethereum is one of the leading blockchain platforms to provide functionality of smart contracts. This paper carries out study of blockchain on Ethereum platform. We have developed authentication-based business application with the help of smart contract for marketing services on Ethereum platform. Solidity is used to generate and manage smart contract.", "venue": "International Congress on Information and Communication Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 International Conference on Issues and Challenges in Intelligent Computing Techniques (ICICT)", "pages": "1-6", "volume": "1"}, "authors": [{"authorId": "2421574", "name": "A. Tripathi"}, {"authorId": "2110508763", "name": "Apoorv Jain"}, {"authorId": "143612475", "name": "Naresh Chandra"}, {"authorId": "145485209", "name": "Akash Rajak"}, {"authorId": "2064245793", "name": "A. Shrivastava"}], "citations": []}
