{"paperId": "0544f5f7402b7cc625c8f9bc331152bca3b2be1d", "publicationVenue": {"id": "ebac41dc-daae-495b-b205-6f48b790974d", "name": "Big Earth Data", "issn": "2574-5417", "url": "https://tandfonline.com/loi/tbed20", "alternate_urls": ["http://www.tandfonline.com/TBED"]}, "title": "Area and shape distortions in open-source discrete global grid systems", "abstract": "ABSTRACT A Discrete Global Grid System (DGGS) is a type of spatial reference system that tessellates the globe into many individual, evenly spaced, and well-aligned cells to encode location and, thus, can serve as a basis for data cube construction. This facilitates integration and aggregation of multi-resolution data from various sources to rapidly calculate spatial statistics. We calculated normalized area and compactness for cell geometries from 5 open-source DGGS implementations - Uber H3, Google S2, RiskAware OpenEAGGR, rHEALPix by Landcare Research New Zealand, and DGGRID by Southern Oregon University - to evaluate their suitability for a global-level statistical data cube. We conclude that the rHEALPix and OpenEAGGR and DGGRID ISEA-based DGGS definitions are most suitable for global statistics because they have the strongest guarantee of equal area preservation - where each cell covers almost exactly the same area on the globe. Uber H3 has the smallest shape distortions, but Uber H3 and Google S2 have the largest variations in cell area. However, they provide more mature software library functionalities. DGGRID provides excellent functionality to construct grids with desired geometric properties but as the only implementation does not provide functions for traversal and navigation within a grid after its construction.", "venue": "Big Earth Data", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-03", "journal": {"name": "Big Earth Data", "pages": "256 - 275", "volume": "6"}, "authors": [{"authorId": "3441114", "name": "A. Kmoch"}, {"authorId": "152267415", "name": "I. Vasilyev"}, {"authorId": "1486053047", "name": "Holger Virro"}, {"authorId": "11974836", "name": "E. Uuemaa"}], "citations": [{"paperId": "d246f7b1aae85c3702b081da351fa1620cab7cbe", "title": "Estimating information volume change in hexagonal descrete global grid systems with aperture 7"}, {"paperId": "40cb63f2934abbd1782b70c767dc91c154aed990", "title": "Histogram cube: towards lightweight interactive spatiotemporal aggregation of big earth observation data"}, {"paperId": "d14a597864bc2b0a6b79fa88bac63894ec88c9fe", "title": "Construction of quality evaluation indicator system for diamond discrete global grid systems"}, {"paperId": "ec453c216c54fe7318fbc704ce9b5614be1b5e94", "title": "Current state and challenges in producing large-scale land cover maps: review based on recent land cover products"}, {"paperId": "95bee744f00ef89574c450fada9d9564348ca694", "title": "Big spatial data modeling using data cube based on discrete global grid system"}, {"paperId": "b990024bc47dfc3e2261a9a4046262c7727303c8", "title": "A Candidate DGGS (Discrete Global Grid System) for Sentinel-2: First Outcomes"}, {"paperId": "31cd020fc29531af1a55aab0d6c94b3162862995", "title": "Ocean surface currents estimated from satellite remote sensing data based on a global hexagonal grid"}, {"paperId": "f8a3d2b96df340c883160a54426459f7e2ec9585", "title": "Extraction of ocean tidal information based on global equal-area grid and satellite altimeter data"}, {"paperId": "13786c244f52d852e6ae26bff4e22aa4449b1ce8", "title": "D ata C ubes for E arth S ystem R esearch : C hallenges A head"}]}
