{"paperId": "05443b74282921a90249592bf32206029b78b4bf", "publicationVenue": {"id": "2f5b84b3-aa20-451e-9579-e25d1e750644", "name": "International Conference on Robotics and Artificial Intelligence", "type": "conference", "alternate_names": ["ICRAI", "Int Conf Robot Artif Intell", "International Conference Robotics and Artificial Intelligence"]}, "title": "Machine Vision Based Predictive Maintenance for Machine Health Monitoring: A Comparative Analysis", "abstract": "Smart manufacturing was given unparalleled chances by data-driven approaches, speeding up the shift to Industry 4.0 ways of production. Machine learning and deep learning are indispensable in the creation of smart systems that could perform descriptive, analytical, and predictive analytics for monitoring the health of manufacturing processes and equipment. This study discusses the advantages and disadvantages of applying deep learning (DL) to intelligent machining and tool maintenance. The building blocks of a smart monitoring system are unveiled. The primary benefits and drawbacks of ML models are described, and they are contrasted to those of deep learning models. Deep belief networks, Auto-Encoder, recurrent neural network (RNNs) and convolutional neural networks (CNNs), were some of the most prominent DL models covered, their applications in smart manufacturing and tool health monitoring were also examined. Intelligent machining could benefit from a data-driven smart manufacturing strategy in six ways: (1) by providing hybrid intelligent models; (2) by managing high-dimensional data; (3) by dealing with big data; (4) by achieving optimal sensor fusion; (5) by avoiding sensor redundancy; and (6) by automating feature engineering. Finally, the data-driven challenges and research needs in smart manufacturing were discussed. There were many obstacles, such as those related to process uncertainty, data nature, data size, and model selection.", "venue": "International Conference on Robotics and Artificial Intelligence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-03", "journal": {"name": "2023 International Conference on Robotics and Automation in Industry (ICRAI)", "pages": "1-8"}, "authors": [{"authorId": "2213872835", "name": "Ihtisham Ul Haq"}, {"authorId": "3138625", "name": "S. Anwar"}, {"authorId": "2073311829", "name": "Tahir Khan"}], "citations": [{"paperId": "be6d2234e3c76eeda2aba525cb09b162674d132d", "title": "Federated Learning for Predictive Maintenance and Anomaly Detection Using Time Series Data Distribution Shifts in Manufacturing Processes"}]}
