{"paperId": "054ba229bef1bfea243f648dbeec18ccce98bf81", "publicationVenue": {"id": "d406a3f4-dc05-43be-b1f6-812f29de9c0e", "name": "IEEE Transactions on Information Forensics and Security", "type": "journal", "alternate_names": ["IEEE Trans Inf Forensics Secur"], "issn": "1556-6013", "url": "http://www.ieee.org/organizations/society/sp/tifs.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=10206", "http://www.signalprocessingsociety.org/publications/periodicals/forensics/"]}, "title": "An SDN-Enabled Proactive Defense Framework for DDoS Mitigation in IoT Networks", "abstract": "The Internet of Things (IoT) is becoming truly ubiquitous in every domain of human lives, and a large number of objects can be connected and enabled to communicate with cloud servers at any time. However, complex connections and vulnerabilities of IoT devices introduce inevitable security threats, in which distributed denial-of-service (DDoS) attacks usually incur catastrophic results. Unfortunately, the existing DDoS mitigation methods cannot provide effective protection. Moreover, the amplifying complexity and increasing delay incurred by defense greatly affect the stability of IoT networks. To tackle these problems, we present a novel framework that can proactively adapt the attack surface of IoT networks, dynamically optimize defense strategies, and rapidly deploy the corresponding defense mechanisms. In particular, we establish hybrid proactive defense mechanisms combining Moving Target Defense (MTD) techniques with cyber deception to spread camouflage information to confuse attackers. Based on these mechanisms, we introduce a defender-led signaling game model to formalize defense scenarios and depict the interactions between the defender and the attacker. Besides, we present an optimal algorithm to solve decision problems and optimize defense implementation in a cost-effective manner. Our extensive experiments demonstrate that the proposed approach can effectively mitigate DDoS attacks and maintain a high level of performance in IoT networks with acceptable overhead.", "venue": "IEEE Transactions on Information Forensics and Security", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Information Forensics and Security", "pages": "5366-5380", "volume": "16"}, "authors": [{"authorId": "2140174425", "name": "Yuyang Zhou"}, {"authorId": "2064868275", "name": "Guang Cheng"}, {"authorId": "2116617855", "name": "Shui Yu"}], "citations": [{"paperId": "ae129b56b235c9dd5f82a58dad6fb6f6204f6a41", "title": "KFREAIN: Design of A Kernel-Level Forensic Layer for Improving Real-Time Evidence Analysis Performance in IoT Networks"}, {"paperId": "d4cb71b4ba2469a8f6e601b7afd2da49083213fc", "title": "Survey on the scheme evaluation, opportunities and challenges of software defined-information centric network"}, {"paperId": "8a28ea8e11caa19e351e22df1cc07067518e675e", "title": "Towards Attack-Resistant Service Function Chain Migration: A Model-Based Adaptive Proximal Policy Optimization Approach"}, {"paperId": "a60a3b1188adfe6476a7785ab03032679e5f0665", "title": "A Survey on Trustworthy Edge Intelligence: From Security and Reliability To Transparency and Sustainability"}, {"paperId": "ee86199a666dd8e87bb4f0d2c1400c03aa25ed71", "title": "FedChain-Hunter: A reliable and privacy-preserving aggregation for federated threat hunting framework in SDN-based IIoT"}, {"paperId": "72622347f2a959dca8993963e4f4eaa66a40be11", "title": "Software-Defined Networking approaches for intrusion response in Industrial Control Systems: A survey"}, {"paperId": "483bed07b51f1c4cf5aa900c7698ce297db0607e", "title": "A Comprehensive Survey on Knowledge-Defined Networking"}, {"paperId": "e6b6e741f35a6711123f365fbf5f8c5bff502801", "title": "SDN/NFV-based framework for autonomous defense against slow-rate DDoS attacks by using reinforcement learning"}, {"paperId": "15dce400283a9ff59f0dc25cb73de297bf4949c1", "title": "Deep learning for the security of software-defined networks: a review"}, {"paperId": "c0e8cde5d493e4be305ef34e822d23fac648eb29", "title": "ADAM: An Adaptive DDoS Attack Mitigation Scheme in Software-Defined Cyber-Physical System"}, {"paperId": "a2ee02484aa601c0601bafebcc18e25c3e99717c", "title": "Hybrid cyber defense strategies using Honey-X: A survey"}, {"paperId": "619f8aa8ac4759db545a9229e2b1374424560a5a", "title": "Comparative Evaluation on Various Machine Learning Strategies Based on Identification of DDoS Attacks in IoT Environment"}, {"paperId": "ceeb19c02b596bc8a3602cc50e1ead8130270666", "title": "Proactive Self-Healing Approaches in Mobile Edge Computing: A Systematic Literature Review"}, {"paperId": "ae8639a5b710fc0e9c04d2188ff6771e313f9662", "title": "Collaborative prediction and detection of DDoS attacks in edge computing: A deep learning-based approach with distributed SDN"}, {"paperId": "588fcf90a068bd955d2fcf1d9dd769540375c375", "title": "Low delay network attributes randomization to proactively mitigate reconnaissance attacks in industrial control systems"}, {"paperId": "c85e9f31c38a4a00cf98e2d807389e0a74d5cd08", "title": "WaterPurifier: A scalable system to prevent the DNS water torture attack in 5G-enabled SIoT network"}, {"paperId": "2ca002e8bb820c193deffe1753da47727bbe95a5", "title": "Cross-Plane DDoS Attack Defense Architecture Based on Flow Table Features in SDN"}, {"paperId": "96494e3ad7f02fe2864c634bde4a33d1ea4b8cce", "title": "DOCUS-DDoS detection in SDN using modified CUSUM with flash traffic discrimination and mitigation"}, {"paperId": "be47fbf68732d0d5aa033ab0d37eff14e081eb80", "title": "An Input-Aware Mimic Defense Theory and its Practice"}, {"paperId": "cb8064ab24d88bd28483460238e6d6c8399ab21c", "title": "A Hybrid Routing Mutation Mechanism based on Mutation Cost and Resource Trustworthiness in Network Moving Target Defense"}, {"paperId": "319d09bb7812d0d327a386a8a6b63acb9ca6ddaf", "title": "DDoS mitigation techniques in IoT: A Survey"}, {"paperId": "780715f4c228bf408d63249086d9f0712d08e9e7", "title": "SCEMA: An SDN-Oriented Cost-Effective Edge-Based MTD Approach"}, {"paperId": "f3f825190f6b0c357de9bbbf57afb4b435f3a710", "title": "Privacy-Preserving and Security in SDN-Based IoT: A Survey"}, {"paperId": "8c483936c92f30fbd4178f34044e25b50f88d8b8", "title": "Deep Reinforcement Learning Based Moving Target Defense Method in Computing Power Network"}, {"paperId": "68b4944b7e92a8705caa6cdc621dcae3b8a13cf4", "title": "A Systematic Literature Review of Offensive and Defensive Security Solutions With Software Defined Network"}, {"paperId": "c1420363d54fbe092c06794650b29384e60f079b", "title": "How to Disturb Network Reconnaissance: A Moving Target Defense Approach Based on Deep Reinforcement Learning"}, {"paperId": "a099972007c8ca393a6edd4a4489d80a5408dafd", "title": "Robust Control of Autonomous Underwater Vehicles Using Delta-Sigma-Based 1-bit Controllers"}]}
