{"paperId": "054b419d2c22cf6d4bb420b51e2181a7f228f9f2", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Does Big Data Require Complex Systems? A Performance Comparison Between Spark and Unicage Shell Scripts", "abstract": "The paradigm of big data is characterized by the need to collect and process data sets of great volume, arriving at the systems with great velocity, in a variety of formats. Spark is a widely used big data processing system that can be integrated with Hadoop to provide powerful abstractions to developers, such as distributed storage through HDFS and resource management through YARN. When all the required configurations are made, Spark can also provide quality attributes, such as scalability, fault tolerance, and security. However, all of these benefits come at the cost of complexity, with high memory requirements, and additional latency in processing. An alternative approach is to use a lean software stack, like Unicage, that delegates most control back to the developer. In this work we evaluated the performance of big data processing with Spark versus Unicage, in a cluster environment hosted in the IBM Cloud. Two sets of experiments were performed: batch processing of unstructured data sets, and query processing of structured data sets. The input data sets were of significant size, ranging from 64 GB to 8192 GB in volume. The results show that the performance of Unicage scripts is superior to Spark for search workloads like grep and select, but that the abstractions of distributed storage and resource management from the Hadoop stack enable Spark to execute workloads with inter-record dependencies, such as sort and join, with correct outputs.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-28", "journal": {"name": "ArXiv", "volume": "abs/2212.13647"}, "authors": [{"authorId": "2198488671", "name": "Duarte M. Nascimento"}, {"authorId": "115513269", "name": "Miguel Ferreira"}, {"authorId": "38279896", "name": "M. Pardal"}], "citations": [{"paperId": "3aab069adf185e8beefdce18c8546f0e100251cd", "title": "LASIGE and UNICAGE solution to the NASA LitCoin NLP Competition"}, {"paperId": "9be10bd46386757db09dbee64ce07908fcaeb105", "title": "Distributed storage optimization using multi-agent systems in Hadoop"}]}
