{"paperId": "055432fe274aa8de29a5006ecf6b33fdd2a79876", "publicationVenue": {"id": "eb83052e-28c9-4a33-a49b-05885d2e59cd", "name": "International Journal of Pervasive Computing and Communications", "type": "journal", "alternate_names": ["Int J Pervasive Comput Commun"], "issn": "1742-7371", "url": "https://www.emerald.com/insight/publication/issn/1742-7371"}, "title": "Context-aware behaviour prediction for autonomous driving: a deep learning approach", "abstract": "\nPurpose\nThis paper aims to predict the behaviour of the vehicles in a mixed driving scenario. This proposes a deep learning model to predict lane-changing scenarios in highways incorporating current and historical information and contextual features. The interactions among the vehicles are modelled using long-short-term memory (LSTM).\n\n\nDesign/methodology/approach\nPredicting the surrounding vehicles' behaviour is crucial in any Advanced Driver Assistance Systems (ADAS). To make a decision, any prediction models available in the literature consider the present and previous observations of the surrounding vehicles. These existing models failed to consider the contextual features such as traffic density that also affect the behaviour of the vehicles. To forecast the appropriate driving behaviour, a better context-aware learning method should be able to consider a distinct goal for each situation is more significant. Considering this, a deep learning-based model is proposed to predict the lane changing behaviours using past and current information of the vehicle and contextual features. The interactions among vehicles are modeled using an LSTM encoder-decoder. The different lane-changing behaviours of the vehicles are predicted and validated with the benchmarked data set NGSIM and the open data set Level 5.\n\n\nFindings\nThe lane change behaviour prediction in ADAS is gaining popularity as it is crucial for safe travel in a mixed driving environment. This paper shows the prediction of maneuvers with a prediction window of 5 s using NGSIM and Level 5 data sets. The proposed method gives a prediction accuracy of 97% on average for all lane-change maneuvers for both the data sets.\n\n\nOriginality/value\nThis research presents a strategy for predicting autonomous vehicle behaviour based on contextual features. The paper focuses on deep learning techniques to assist the ADAS.\n", "venue": "International Journal of Pervasive Computing and Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-14", "journal": {"name": "Int. J. Pervasive Comput. Commun.", "pages": "477-490", "volume": "19"}, "authors": [{"authorId": "2154134160", "name": "Syama R."}, {"authorId": "2127385877", "name": "M. C."}], "citations": []}
