{"paperId": "0557dfaa92f51f555e2926f3de40663cc975a233", "publicationVenue": {"id": "0b8373ea-5505-4c96-99ff-b8da87a2ce3e", "name": "Materials", "type": "journal", "issn": "1996-1944", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-164286", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-164286", "https://www.mdpi.com/journal/materials", "http://www.mdpi.com/journal/materials"]}, "title": "Fatigue Reliability Characterisation of Effective Strain Damage Model Using Extreme Value Distribution for Road Load Conditions", "abstract": "The aim of this paper is to characterise the fatigue reliability for various random strain loads under extreme value distribution while considering the cycle sequence effect condition in fatigue life prediction. The established strain–life models, i.e., Morrow and Smith–Watson–Topper, considered a mean stress effect and strain amplitude; nevertheless, it excluded the load sequence effect, which involves the fatigue crack closure that is subjected to overload or underload. A FESEM-EDX analysis is conducted to characterise the failure features that occurred on the leaf spring. A finite element is simulated to determine the critical region in order to obtain the strain load behaviour. In addition, the strain signal is captured experimentally at 500 Hz for 100 s under operating conditions for three different road loads based on the critical location obtained from the finite element analysis. The fatigue life correlation shows that the Pearson correlation coefficients are greater than 0.9, which indicates the effective strain damage model is linearly correlated with the strain–life models. The fatigue life data are modelled using extreme value distribution by considering the random strain loads as extreme data. The reliability rate for the fatigue life is reported to be more than 0.59 within the hazard rate range of 9.6 × 10−8 to 1.2 × 10−7 based on the mean cycle to the failure point. Hence, the effective strain damage model is proposed for a fatigue reliability assessment under extreme conditions with higher reliability and provides fatigue life prediction when subjected to cycle sequence effects.", "venue": "Materials", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Materials", "volume": "16"}, "authors": [{"authorId": "145144014", "name": "L. Abdullah"}, {"authorId": "2047974535", "name": "Salvinder Singh Karam Singh"}, {"authorId": "144332810", "name": "S. Abdullah"}, {"authorId": "144536895", "name": "A. Ariffin"}, {"authorId": "2199568477", "name": "Syifa Syuhaidah Meor Zainal"}], "citations": [{"paperId": "955add38ddff8b2a3550475c1074fd55de116841", "title": "Study on the factors affecting the self-healing performance of asphalt mixture and pavement based on fracture mechanics and calculation formula"}]}
