{"paperId": "05600a598ceeaa162bb77fda845f84568b5f6de2", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Deep Reinforcement Learning-based Methods for Resource Scheduling in Cloud Computing: A Review and Future Directions", "abstract": "As the quantity and complexity of information processed by software systems increase, large-scale software systems have an increasing requirement for high-performance distributed computing systems. With the acceleration of the Internet in Web 2.0, Cloud computing as a paradigm to provide dynamic, uncertain and elastic services has shown superiorities to meet the computing needs dynamically. Without an appropriate scheduling approach, extensive Cloud computing may cause high energy consumptions and high cost, in addition that high energy consumption will cause massive carbon dioxide emissions. Moreover, inappropriate scheduling will reduce the service life of physical devices as well as increase response time to users' request. Hence, efficient scheduling of resource or optimal allocation of request, that usually a NP-hard problem, is one of the prominent issues in emerging trends of Cloud computing. Focusing on improving quality of service (QoS), reducing cost and abating contamination, researchers have conducted extensive work on resource scheduling problems of Cloud computing over years. Nevertheless, growing complexity of Cloud computing, that the super-massive distributed system, is limiting the application of scheduling approaches. Machine learning, a utility method to tackle problems in complex scenes, is used to resolve the resource scheduling of Cloud computing as an innovative idea in recent years. Deep reinforcement learning (DRL), a combination of deep learning (DL) and reinforcement learning (RL), is one branch of the machine learning and has a considerable prospect in resource scheduling of Cloud computing. This paper surveys the methods of resource scheduling with focus on DRL-based scheduling approaches in Cloud computing, also reviews the application of DRL as well as discusses challenges and future directions of DRL in scheduling of Cloud computing.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-05-10", "journal": {"name": "ArXiv", "volume": "abs/2105.04086"}, "authors": [{"authorId": "2110809426", "name": "Guangyao Zhou"}, {"authorId": "39720104", "name": "Wenhong Tian"}, {"authorId": "1709598", "name": "R. Buyya"}], "citations": [{"paperId": "dba8f74a9e2e49311366603a7f6a4eec39efb280", "title": "ILBPS: An Integrated Optimization Approach Based on Adaptive Load-Balancing and Heuristic Path Selection in SDN"}, {"paperId": "30ce7babe8e41465fbf742ea0aa191cb8da4735c", "title": "A Review Study on Energy Consumption in Cloud Computing"}, {"paperId": "69b69598def6f68e48d4d52b991d99832e82cb72", "title": "A coherent salp swarm optimization based deep reinforced neuralnet work algorithm for securing the mobile cloud systems"}, {"paperId": "e470f6611792bd2deae88772076431b8120a98a7", "title": "A Dual-Agent Scheduler for Distributed Deep Learning Jobs on Public Cloud via Reinforcement Learning"}, {"paperId": "854f39854c2cc6de8234daa671033ed3692232cd", "title": "Generalizable Reinforcement Learning-Based Coarsening Model for Resource Allocation over Large and Diverse Stream Processing Graphs"}, {"paperId": "65cf21ff869ac5f2c806134a47586c78beab7e1d", "title": "A DRL-based online VM scheduler for cost optimization in cloud brokers"}, {"paperId": "1995aa999d5e320eeb49d542e883821a1471d2b5", "title": "Resource Management in Cloud and Cloud-influenced Technologies for Internet of Things Applications"}, {"paperId": "7594823c679d2cce0213a53552bed3b6d1bedd8d", "title": "AGV Dynamic Scheduling and Path Planning Algorithm Based on 5G Technology in Intelligent Factory"}, {"paperId": "5a5883399f3b48d5528da8b5530552fe95a9758e", "title": "A priority-aware scheduling framework for heterogeneous workloads in container-based cloud"}, {"paperId": "13a55f6659ef3ba5d9238125353b09158cb6bddf", "title": "Job Scheduling in Datacenters using Constraint Controlled RL"}, {"paperId": "d3f44c364cc92a5aa126cfe89e820666adbeb167", "title": "Optimizing scheduling in cloud using a meta-heuristic approach"}, {"paperId": "f5736ea1e1a202373b752aa468235f00d7fe5917", "title": "A Survey on Machine Learning for Geo-Distributed Cloud Data Center Managements"}, {"paperId": "89f5012e7e5753a838735506488a1a42887fa951", "title": "Research on the Dynamic Dispatching Algorithm of Cloud Data Center Resource"}, {"paperId": "630fc872e3144dae6ad90df5355292e0522b732b", "title": "Optimized intellectual resource scheduling using deep reinforcement Q‐learning in cloud computing"}, {"paperId": "897cf02a218071c15c936db760abe27052f3315a", "title": "Time Effective Cloud Resource Scheduling Method for Data-Intensive Smart Systems"}, {"paperId": "7955524156d003f941bafff966ab82c6f4b27f81", "title": "Task Clustering and Scheduling in Fault Tolerant Cloud Using Dense Neural Network"}, {"paperId": "0eb8dd7466ac1f94ad79e3d56bca3442e85acc37", "title": "Deep Q-Learning Network-Based Energy and Network-Aware Optimization Model for Resources in Mobile Cloud Computing"}, {"paperId": "eccb5456ac7ae13435e211649b6e45eb2d553a79", "title": "A Comprehensive Survey on Sustainable Resource Management in Cloud Computing Environments"}]}
