{"paperId": "056368339abb62cd57a284a08a0e366c96e903e2", "publicationVenue": {"id": "c714c0c6-6a1a-4eb3-a7a6-337b6303efac", "name": "Middle East and North Africa Communications Conference", "type": "conference", "alternate_names": ["MENACOMM", "Middle East North Afr Commun Conf"]}, "title": "Apache Spark: A Big Data Processing Engine", "abstract": "Big data analysis has influenced the industry market. It has a significant impact on large and varied datasets to exhibit the hidden patterns and other revelations. Apache Hadoop, Apache Flink and Apache Storm are some commonly used frameworks for big data analysis. Apache Spark is a consolidated big data analytics engine and provides absolute data parallelism. This paper scrutinizes a technical review on big data analytics using Apache Spark and how it uses in-memory computation that makes it remarkably faster as compared to other corresponding frameworks. Moreover, Spark also provides exceptional batch processing and stream processing capabilities. Furthermore, it also discuses over the multithreading and concurrency capabilities of Apache Spark. The point of convergence is architecture, hardware requirements, ecosystem, use cases, features of Apache Spark and the use of Spark in emerging technologies.", "venue": "Middle East and North Africa Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-11-01", "journal": {"name": "2019 2nd IEEE Middle East and North Africa COMMunications Conference (MENACOMM)", "pages": "1-6"}, "authors": [{"authorId": "150991792", "name": "Eman Shaikh"}, {"authorId": "151036677", "name": "Iman Mohiuddin"}, {"authorId": "2509571", "name": "Y. Alufaisan"}, {"authorId": "1492131061", "name": "Irum Nahvi"}], "citations": [{"paperId": "81d771fde1ac497d6a759b2b911cfb1373fb08cd", "title": "Cyber-physical power systems: A comprehensive review about technologies drivers, standards, and future perspectives"}, {"paperId": "fa3bf1c2a04e58e71279c30ae53b05d13b5e9719", "title": "Deep Reinforcement Learning (DRL)-based Methods for Serverless Stream Processing Engines: A Vision, Architectural Elements, and Future Directions"}, {"paperId": "fd545ca14adbb746a49f0ac530bef64c09f9a95d", "title": "A Scalable Hate Speech Detection System for Vietnamese Social Media using Real-time Big Data Processing and Distributed Deep Learning"}, {"paperId": "d3fda0e63794e30006cbe8b18e408235fd228d68", "title": "Predicting Probable Product Swaps in Customer Behaviour: An In-depth Analysis of Forecasting Techniques, Factors Influencing Decisions, and Implications for Business Strategies"}, {"paperId": "248b2d840538b509ddac9cee5e49330ddff91428", "title": "BIG DATA PROCESSING WITH APACHE SPARK"}, {"paperId": "c2baec5ab2fd094df86a7bd0722e909df771cd49", "title": "Examining Amazon Customer Reviews using PySpark and AWS: A Data Lake Approach"}, {"paperId": "761606f47dc634db8dd2416bc8dec79cbc0af44e", "title": "Ten quick tips for bioinformatics analyses using an Apache Spark distributed computing environment"}, {"paperId": "442cce72a508316afb174365d9ad7dc57fe30052", "title": "On Improving Streaming System Autoscaler Behaviour using Windowing and Weighting Methods"}, {"paperId": "6e67afbadf7a60d083aa32877a6364e6c8e043fc", "title": "Distributed Accelerated Projection-Based Consensus Decomposition"}, {"paperId": "2f4445f19564770e5aa8426248b9c13e58ea244c", "title": "Optimization for resource management in heterogeneous spark clusters"}, {"paperId": "f2116ae056718dc6bebe66f63231212193dbd48b", "title": "A survey of parallel clustering algorithms based on vertical scaling platforms for big data"}, {"paperId": "461d6367b80d5796a875857b7698a585f2830106", "title": "Improvement in Performance of Image Classification based on Apache Spark"}, {"paperId": "85328b4a8132bf4299f8cd7f8e79e850d561c8fc", "title": "Big Data Analytics: A Survey"}, {"paperId": "49764db08b665a0ce8e3e5e7a54c366865ebb8fc", "title": "Building a model to exploit association rules and analyze purchasing behavior based on rough set theory"}, {"paperId": "9912500c35c34c6aa553052144f693691b86bf8a", "title": "ENRICHED BIG DATA PRE-PROCESSING MODEL WITH MACHINE LEARNING APPROACH TO INVESTIGATE WEB USER USAGE BEHAVIOURY"}, {"paperId": "307be4c2e06480c4863d1e5ecf319ee0cfca9039", "title": "Building a Vietnamese question answering system based on knowledge graph and distributed CNN"}, {"paperId": "33fe5c968adfd51786a02c2831b4a7d631485abb", "title": "A smart method for spark using neural network for big data"}, {"paperId": "de424836a8c1e5935f6f087b8dd1674816bb7786", "title": "Recent Applications of Computing and Mobility Technologies to Modern Manufacturing"}, {"paperId": "b932ecaf6825fb5a8b838dab9a0e66e7cea3eabf", "title": "A Study of Big Data Analytics using Apache Spark with Python and Scala"}, {"paperId": "ca4b840ddd0d43d5395720b8a7939e49529c73c7", "title": "BIG DATA AND PREDICTIVE ANALYTICS IN MANUFACTURING ENTERPRISES FOR ENHANCED DECISION MAKING"}, {"paperId": "d79eadd6fbbe1072224a6157557f03961e01402a", "title": "Design and Implementation of HSQL: A SQL-like language for Data Analysis in Distributed Systems"}, {"paperId": "2860fe768f52ca27c714126a140700d1e282661d", "title": "A BIG DATA ANALYTICS FRAMEWORK FOR COMPETITIVE INTELLIGENCE SYSTEMS"}]}
