{"paperId": "057741c107a367cfa9494efdd770d56190128e70", "publicationVenue": null, "title": "An experimental study and evaluation of a new architecture for clinical decision support : integrating the openEHR specifications for the Electronic Health Record with Bayesian networks", "abstract": "Healthcare informatics still lacks wide-scale adoption of intelligent decision \nsupport methods, despite continuous increases in computing power and \nmethodological advances in scalable computation and machine learning, over \nrecent decades. The potential has long been recognised, as evidenced in the \nliterature of the domain, which is extensively reviewed. \nThe thesis identifies and explores key barriers to adoption of clinical decision \nsupport, through computational experiments encompassing a number of technical \nplatforms. Building on previous research, it implements and tests a novel platform \narchitecture capable of processing and reasoning with clinical data. The key \ncomponents of this platform are the now widely implemented openEHR electronic \nhealth record specifications and Bayesian Belief Networks. \nSubstantial software implementations are used to explore the integration of \nthese components, guided and supplemented by input from clinician experts and \nusing clinical data models derived in hospital settings at Moorfields Eye Hospital. \nData quality and quantity issues are highlighted. Insights thus gained are used to \ndesign and build a novel graph-based representation and processing model for the \nclinical data, based on the openEHR specifications. The approach can be \nimplemented using diverse modern database and platform technologies. \nComputational experiments with the platform, using data from two clinical \ndomains – a preliminary study with published thyroid metabolism data and a \nsubstantial study of cataract surgery – explore fundamental barriers that must be \novercome in intelligent healthcare systems developments for clinical settings. These \nhave often been neglected, or misunderstood as implementation procedures of \nsecondary importance. The results confirm that the methods developed have the \npotential to overcome a number of these barriers. \nThe findings lead to proposals for improvements to the openEHR \nspecifications, in the context of machine learning applications, and in particular for \nintegrating them with Bayesian Networks. The thesis concludes with a roadmap for \nfuture research, building on progress and findings to date.", "venue": "", "year": 2016, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": "2016-06-28", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "123505416", "name": "S. Arikan"}], "citations": [{"paperId": "64aff7c70a99602b4e0be79eec35bdc86a36f4d0", "title": "Data Modeling with Ontological Formalism for Semantic Interoperability between Health Information Systems, applied to Primary Health Care in Paraguay"}, {"paperId": "4f9623872fa7857ca616c3090c0a00d0a14332da", "title": "Leveraging Data Science for a Personalized Haemodialysis"}]}
