{"paperId": "058afdca67e6f6158ca4bc0bc539bc3611b8a2be", "publicationVenue": null, "title": "Spatial Prediction of Future Flood Risk: An Approach to the Effects of Climate Change", "abstract": "Preparation of a flood probability map serves as the first step in a flood management program. This research develops a probability flood map for floods resulting from climate change in the future. Two models of Flexible Discrimination Analysis (FDA) and Artificial Neural Network (ANN) were used. Two optimistic (RCP2.6) and pessimistic (RCP8.5) climate change scenarios were considered for mapping future rainfall. Moreover, to produce probability flood occurrence maps, 263 locations of past flood events were used as dependent variables. The number of 13 factors conditioning floods was taken as independent variables in modeling. Of the total 263 flood locations, 80% (210 locations) and 20% (53 locations) were considered model training and validation. The Receiver Operating Characteristic (ROC) curve and other statistical criteria were used to validate the models. Based on assessments of the validated models, FDA, with a ROC-AUC = 0.918, standard error (SE = 0.038), and an accuracy of 0.86% compared to the ANN model with a ROC-AUC = 0.897, has the highest accuracy in preparing the flood probability map in the study area. The modeling results also showed that the factors of distance from the River, altitude, slope, and rainfall have the greatest impact on floods in the study area. Both models’ future flood susceptibility maps showed that the highest area is related to the very low class. The lowest area is related to the high class.", "venue": "", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-01-05", "journal": {"name": "", "pages": "25", "volume": "11"}, "authors": [{"authorId": "1397319656", "name": "Mohammadtaghi Avand"}, {"authorId": "28966955", "name": "H. Moradi"}, {"authorId": "2124578946", "name": "Mehdi Ramazanzadeh lasboyee"}], "citations": [{"paperId": "91a8064acbfc85ba59e89e4a9b94b9829ce5aa10", "title": "Recently emerging trends in big data analytic methods for modeling and combating climate change effects"}, {"paperId": "11156fd0f56648b8de861e6e14478f34b019344c", "title": "Flood prediction with time series data mining: Systematic review"}, {"paperId": "a49c9defbaf8cf87caf98643b2979d8a6811270d", "title": "Towards Building a Global Robust Model for Heart Disease Detection"}, {"paperId": "1cd5e66b9abb737b4222b6d581900f1f6fac16b3", "title": "Mapping land degradation risk due to land susceptibility to dust emission and water erosion"}, {"paperId": "c00d5e59ef20e5f5314e5ede33dbddbd5ac23a6e", "title": "Geospatial modelling of floods: a literature review"}, {"paperId": "a773dc95b2561e17d2482962774299bb2bcf1ae5", "title": "The State of the Art in Deep Learning Applications, Challenges, and Future Prospects: A Comprehensive Review of Flood Forecasting and Management"}, {"paperId": "96aa4ee2ff9ece1f599d0571d30afb85dcca7d50", "title": "Comprehensive assessment of resilience of flood hazard villages using a modeling and field survey approach"}, {"paperId": "107e5f5e48684af5a114782e2decc2c2fcdcfbc1", "title": "Preparation of Flood Susceptibility Map using Multi-Criteria Spatial Analysis and Data Fusion (A Case Study: Maneh and Samalqan County)"}, {"paperId": "ef775c2d7096d58e32e32be88670d05e326d2081", "title": "Seeking Flood Risk-Minimization: How to Benefit from the Use/Availability of Heavy Rainfall-Risk Maps"}, {"paperId": "0339e512dc55a4719627c58de490185d204e41c9", "title": "A framework for assessing flood risk responses of a densely urbanized watershed, to support urban planning decisions"}, {"paperId": "2af2f256f506ea9bf21ca43382993aae651b5ebc", "title": "Flood susceptible prediction through the use of geospatial variables and machine learning methods"}, {"paperId": "103af81a4aca6276ca50d2c588985af46a51d772", "title": "An Assessment of the Integrated Multi-Criteria and New Models Efficiency in Watershed Flood Mapping"}, {"paperId": "54a733a5b8f98db4eef5ea49a14d2f0b06584226", "title": "Flood susceptibility mapping using qualitative and statistical methods in a semi-arid basin: case of the Manouba–Sijoumi watershed, Northeastern Tunisia"}, {"paperId": "5748673e871efdc26914da11375f8f01d27f284e", "title": "Computational Machine Learning Approach for Flood Susceptibility Assessment Integrated with Remote Sensing and GIS Techniques from Jeddah, Saudi Arabia"}, {"paperId": "418531730cb73394430b38d41d7b39778f21bb42", "title": "AReGeoDatHa: Apulian Regional GeoDatabase for geo-hydrological Hazards"}, {"paperId": "7e8a3f63929fc4d9e024dbb4c995b6fb97b1b103", "title": "Assessing economic growth-energy consumption-CO_2 nexus by climate zone: international evidence"}, {"paperId": "9f1d0e00895c60e1d679a800136a0c8c941f80a8", "title": "Flash Flood Susceptibility Assessment and Zonation by Integrating Analytic Hierarchy Process and Frequency Ratio Model with Diverse Spatial Data"}, {"paperId": "5643fca5b9b5d657eda1e95ba8e281c2f91685d0", "title": "Predicting temporal and spatial variability in flood vulnerability and risk of rural communities at the watershed scale."}, {"paperId": "76eb302fed6a41f133c09cedb0281bc3def38b2c", "title": "Modelling and evaluation of land use changes through satellite images in a multifunctional catchment: Social, economic and environmental implications"}, {"paperId": "43a490b0a04706e3c7fe409bd4a038442c3eec8f", "title": "Disaster-Resilient Communities on Flood Plains and Their Agricultural Regeneration: A Case Study in Meinong Plain, Taiwan"}, {"paperId": "89ab69f4d9da693c2a0de1f66f6ed63bb700dceb", "title": "Evaluating the effects of climate and land use change on the future flood susceptibility in the central region of Vietnam by integrating land change modeler, machine learning methods"}, {"paperId": "c779abb938a85902672517be75ffadd5161756f5", "title": "Rainfall-induced landslide susceptibility mapping using machine learning algorithms and comparison of their performance in Hilly area of Fujian Province, China"}, {"paperId": "2c0191663e84df4220abe9cc2652a492f24fcaef", "title": "Applicability of machine learning techniques for multi-time step ahead runoff forecasting"}, {"paperId": "aaa48e29c105cc0070b7c575a180b6afe107a1a5", "title": "DEM Resolution Effects on Machine Learning Performance for Flood Probability Mapping"}, {"paperId": "579794c6023c2cd52a65348dd6e311413e6182b0", "title": "Spatial modeling of flood susceptibility using machine learning algorithms"}, {"paperId": "dc0187de1b3246893fc463855a41bcec59418600", "title": "A New Approach for Smart Soil Erosion Modeling: Integration of Empirical and Machine-Learning Models"}, {"paperId": "096670d0a694fcabed6bdc2b91fb2608505e8a01", "title": "Assessment of Ensemble Models for Groundwater Potential Modeling and Prediction in a Karst Watershed"}, {"paperId": "ea93586fb31a0addacb1a1312826c456d755a9d9", "title": "Efficiency exploration of frequency ratio, entropy and weights of evidence-information value models in flood vulnerabilityassessment: a study of raiganj subdivision, Eastern India"}, {"paperId": "84100ae005924b7f274b0438370b90074423436e", "title": "Flood vulnerability assessment in the Accra Metropolis, southeastern Ghana"}, {"paperId": "110c7b61fcb063c49c07a4a396a1768a5cccdf3e", "title": "Evaluating the Hydrologic Risk of n-Year Floods According to RCP Scenarios"}, {"paperId": "385b4c0af391f6d0c445941a8694320a07ed205c", "title": "A Multi-Data Geospatial Approach for Understanding Flood Risk in the Coastal Plains of Tamil Nadu, India"}, {"paperId": "78cc4d17769c6cfbbf4aaf62751cecfa5231064c", "title": "The Applicability of Big Data in Climate Change Research: The Importance of System of Systems Thinking"}, {"paperId": "4232350322a0242d72de0a3e397f7eca1cd9a9a5", "title": "Spatial modeling of flood probability using geo-environmental variables and machine learning models, case study: Tajan watershed, Iran"}, {"paperId": "536ecc9e84ef3f5f6d59a10a44da16f7a6510b26", "title": "Mapping land degradation risk due to wind and water erosion"}, {"paperId": "065f100a931c7204d0c7309c7f33840d0bdcb026", "title": "Flood Susceptibility Mapping of the Famnat Watershed, Gilan Province"}]}
