{"paperId": "058f7abebc901c764ac629c91736ae1a039ee155", "publicationVenue": null, "title": "HYBRID RECOMMENDATION SYSTEM TO SOLVE COLD START PROBLEM", "abstract": "The recommendation system has been very vital in the field of research. The objective of the recommendation system is to recommend items to users, but it is difficult when the user’s purchase history, ratings, personal information are not available. Though many recommendation systems are available to recommend products, it is a big problem for new users because there is no available information that helps to recommend the appropriate products to the new users. To get better enactment of recommendation systems, solving the cold start problem is an important issue for researchers. Many recommendation techniques are available for the last couple of years. It has been overwhelming for the new researchers, merchants, web application developers and etc. to know each of them very quickly. Commonly used possible solutions of coldstart problem, frequently used datasets for the specific domain have not been found. So, various techniques are summarized in this article like hybridization methods, data collection approaches, most commonly used possible solutions of cold start, frequently used datasets, algorithms, evaluation methods etc. This study examines how the cold start problem can be solved by the existing hybrid approaches that may help researchers to get a direction for solving the cold start problem.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2261043863", "name": "Ismat Ara Shama"}, {"authorId": "2261043509", "name": "MD Rahmatullah Nabil"}], "citations": [{"paperId": "33210a439ddb74fcbbbe4e3ba65bde5b85855186", "title": "Alleviating cold start and sparsity problems in the micro, small, and medium enterprises marketplace using clustering and imputation techniques"}, {"paperId": "d50050cb9176e0849beac5bba7c7f223f5517899", "title": "A Novel Hybrid Machine Learning Framework to Recommend E-Commerce Products"}, {"paperId": "c3430ff69586ccb4cabaa30418a87679351b05ac", "title": "Course Recommendation System for Students Using K-Means and Association Rule Mining"}, {"paperId": "d8e3f4bbfa662d9dc8b6413767d86e0e4550f2b3", "title": "AN IMPROVED LOUVAIN ALGORITHM BASED ON NODE IMPORTANCE FOR COMMUNITY DETECTION"}]}
