{"paperId": "0590b834d3409031d2b729732c38b81012500612", "publicationVenue": {"id": "88074ded-7e19-4755-8097-fd1b71b6c8be", "name": "International Conference for Internet Technology and Secured Transactions", "type": "conference", "alternate_names": ["Int Conf Internet Technol Secur Trans", "ICITST"], "url": "http://www.icitst.org/"}, "title": "Docker vs. KVM: Apache spark application performance and ease of use", "abstract": "In this paper, we compare the performance and ease of use of an Apache Spark application deployed via Docker and alternatively via KVM. Docker containers have rapidly grown in popularity for dynamic cloud computing and for general-use application deployment and collaboration. Recent work comparing the performance of Docker versus VM deployments has found that Docker's reduced overhead results in better performance. We compare Docker versus VM deployments of an Apache Spark application in regard to ease of use in a collaborative development environment. We expect that developing the application in a containerized environment will result in fewer post-deployment tests that fail compared to application versions that are developed in non-virtual or VM environments. Future work will closely examine the performance of these two implementations and more generally investigate potential trade-offs between performance and ease of use.", "venue": "International Conference for Internet Technology and Secured Transactions", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 12th International Conference for Internet Technology and Secured Transactions (ICITST)", "pages": "199-201"}, "authors": [{"authorId": "40182348", "name": "W. Blair"}, {"authorId": "2971189", "name": "Aspen Olmsted"}, {"authorId": "35727272", "name": "Paul E. Anderson"}], "citations": [{"paperId": "e935a5537e4b5f6c0b2a21b7c2ec4db7a5891dd8", "title": "About the Performance of Full Virtualization and Containers on ARM-v 8 Platform"}, {"paperId": "7f2059a5bcc841452017af94a56b9ca7bea93519", "title": "Cloud Computing Architecture for High-volume ML-based Solutions"}]}
