{"paperId": "05908c31f150a3f696e8a3b11918952b7577d839", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Roads Infrastructure Digital Twin: A Step Toward Smarter Cities Realization", "abstract": "Digital Twin is a new concept that consists of creating an up-to-date virtual asset in cyberspace which mimics the original physical asset in most of its aspects, ultimately to monitor, analyze, test, and optimize the physical asset. In this article, we investigate and discuss the use of the digital twin concept of the roads as a step toward realizing the dream of smart cities. To this end, we propose the deployment of a Digital Twin Box to the roads that is composed of a 360° camera and a set of IoT devices connected to a Single Onboard Computer. The Digital Twin Box creates a digital twin of the physical road asset by constantly sending real-time data to the edge/cloud, including the 360° live stream, GPS location, and measurements of the temperature and humidity. This data will be used for realtime monitoring and other purposes by displaying the live stream via head-mounted devices or using a 360° web-based player. Additionally, we perform an object detection process to extract all possible objects from the captured stream. For some specific objects (person and vehicle), an identification module and a tracking module are employed to identify the corresponding objects and keep track of all video frames where these objects appeared. The outcome of the latter step would be of utmost importance to many other services and domains such as national security. To show the viability of the proposed solution, we have implemented and conducted real-world experiments where we focus more on the detection and recognition processes. The achieved results show the effectiveness of the proposed solution in creating a digital twin of the roads, a step forward to enable self-driving vehicles as a crucial component of smart mobility, using the Digital Twin Box.", "venue": "IEEE Network", "year": 2021, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "IEEE Network", "pages": "136-143", "volume": "35"}, "authors": [{"authorId": "31720605", "name": "Oussama El Marai"}, {"authorId": "1682312", "name": "T. Taleb"}, {"authorId": "145937249", "name": "Jaeseung Song"}], "citations": [{"paperId": "656c3b732cca0597d3bb9949795a1de0d86655ac", "title": "Medium-Level Architectures for Digital Twins: Bridging Conceptual Reference Architectures to Practical Implementation in Cloud, Edge and Cloud–Edge Deployments"}, {"paperId": "2a81a4de1c0f8865df7c0f8f6175089ce76f11f7", "title": "Digital Twin Model Selection for Feature Accuracy"}, {"paperId": "0a88fbebfc7d5591d6573252491554aaa808a91d", "title": "Image-based Deep Learning for Smart Digital Twins: a Review"}, {"paperId": "f1db99c89c4ea5468a506ab5a628096d1001b703", "title": "Energy efficiency in 5G systems: A systematic literature review"}, {"paperId": "066d7d4139518ce97c0108dd4c413d733524dab3", "title": "LLM-Twin: Mini-Giant Model-driven Beyond 5G Digital Twin Networking Framework with Semantic Secure Communication and Computation"}, {"paperId": "f3130d7a4d7d4cdefa10deb96813e7212dbd34bc", "title": "Artificial intelligence-driven rechargeable batteries in multiple fields of development and application towards energy storage"}, {"paperId": "e8420e48b9580a60618b61097cd242fb3154fa1d", "title": "Integrated Sensing and Communication in UAV Swarms for Cooperative Multiple Targets Tracking"}, {"paperId": "6fa77f6bfa58a1069ee7345d30fe76bb446d02dd", "title": "Toward Communication-Efficient Digital Twin via AI-Powered Transmission and Reconstruction"}, {"paperId": "22c19684b1bd456da4c4b3e22808dcb08d14729d", "title": "Digital Twin-Driven Network Architecture for Video Streaming"}, {"paperId": "8b3a2979d7db3ddca127dfefce0275aa99a3af99", "title": "Small and affordable platform for research and education in Connected, Cooperative and Automated Mobility"}, {"paperId": "ab6409fa12c371ccc69738b49acaa0e814914096", "title": "Relay protection mirror operation technology based on digital twin"}, {"paperId": "0855cfe5712ded24b8764a3f68553795c0da6d94", "title": "GNN-Based Power Allocation and User Association in Digital Twin Network for the Terahertz Band"}, {"paperId": "7174d83f43a237f3420510180fb203a28de38dd6", "title": "QoS-Aware Service Prediction and Orchestration in Cloud-Network Integrated Beyond 5G"}, {"paperId": "d8bc98758570198bef0512e625a38b6c5bfdd727", "title": "Implementing a Digital Twin of an Underground Utility Tunnel for Geospatial Feature Extraction Using a Multimodal Image Sensor"}, {"paperId": "d1eb9b9e498dd88783557daf1783ec5bda1fb435", "title": "A Systematic Mapping Study of Digital Twins for Diagnosis in Transportation"}, {"paperId": "e80f6a31a50a83bc64ab871959aa1bd15a66e8b6", "title": "Different Destinations: Digital Twins Enabled Ambulance Path Planning"}, {"paperId": "66781fee9fa77c61309d50093ec11aaed8d3efde", "title": "Harnessing Digital Twin Technology for Adaptive Traffic Signal Control: Improving Signalized Intersection Performance and User Satisfaction"}, {"paperId": "52709d287ebae0f3db0454bc4c39beb9d65117f4", "title": "Digital Twins for Maintaining QoS in Programmable Vehicular Networks"}, {"paperId": "ffaee776ff38eeb3ff74b176afea5be442e4177c", "title": "A dynamic holographic modelling method of digital twin scenes for bridge construction"}, {"paperId": "300fde7fe57be5d4353845b93807df9bb60a953e", "title": "Digital Twin of Shipbuilding Process in Shipyard 4.0"}, {"paperId": "876d8dea40d185860fd74d3e3184547a3ffa19f3", "title": "6G-Enabled DTaaS (Digital Twin as a Service) for Decarbonized Cities"}, {"paperId": "0f5ef36c4bb47b4a154c910e3d9b9342ea382345", "title": "Digital Twins in the Marine Industry"}, {"paperId": "0a3fe54ae99715a9fb0072af2b3774d821c4c808", "title": "VR-Based Immersive Service Management in B5G Mobile Systems: A UAV Command and Control Use Case"}, {"paperId": "063ea65dee5e3c579e057a277347b0036d4dedb5", "title": "Vehicle system dynamics in digital twin studies in rail and road domains"}, {"paperId": "de8a2c4206eb1ecc149f45ae1502870de5a6e471", "title": "A Survey of Blockchain and Intelligent Networking for the Metaverse"}, {"paperId": "74885bcc967b9e0f224f041565218c496929e055", "title": "Optimizing Federated Learning With Deep Reinforcement Learning for Digital Twin Empowered Industrial IoT"}, {"paperId": "bc0b2c5033fdf66b5f48adf715dd333f94f9064d", "title": "A Survey on Digital Twins: Architecture, Enabling Technologies, Security and Privacy, and Future Prospects"}, {"paperId": "66d55afdad236653ffde651ffe2e684a1da72f52", "title": "Steady-State Risk Prediction Analysis of Power System Based on Power Digital Twinning"}, {"paperId": "ca490496dcae1f6b6ee17824687105e9310b5854", "title": "City Digital Twins: their maturity level and differentiation from 3D city models"}, {"paperId": "2460c7093c5dd78653b7c19a836334090e989256", "title": "Holistic Network Virtualization and Pervasive Network Intelligence for 6G"}, {"paperId": "d8cca70598f85ef1dffd489c4d04a74a53cb9cd0", "title": "Digital twin-supported smart city: Status, challenges and future research directions"}, {"paperId": "eca0598c0bd9955cd63ab9eabe5c74d8ea16fb0e", "title": "Smart Mobility and its Implications for Road Infrastructure Provision: A Systematic Literature Review"}, {"paperId": "bcde3c6dd67fcd6f37ef1a6f6084dd2ced83ee60", "title": "Towards Transportation Digital Twin Systems for Traffic Safety and Mobility Applications: A Review"}, {"paperId": "bf993e4fdd4c000cef528bfa71ed7bfa97c7ded9", "title": "Research on Quadruped Robot Inspection System Based on Digital Twin Technology"}, {"paperId": "fad3315206589a05f4fa309e4561e00b5b6c31a8", "title": "The adoption of urban digital twins"}, {"paperId": "aa3b3e9b956ee06466d985c8cef9cbbc11c557be", "title": "Digital Twins From a Networking Perspective"}, {"paperId": "1ef5d20dd05b52a72bf95bad769cf5f4023fc219", "title": "A Perspective Review on Digital Twins for Roads, Bridges, and Civil Infrastructures"}, {"paperId": "71d28c6f04a1c8894415465e002e3f71395c8c1c", "title": "Digital Twin Consensus for Blockchain-Enabled Intelligent Transportation Systems in Smart Cities"}, {"paperId": "ad701932c25ed3fc878ee372ad70d6f0c0882d61", "title": "Digital Twin of Road and Bridge Construction Monitoring and Maintenance"}, {"paperId": "94fbecee4fd096794dd4ab90ab3d942b5f73c9d2", "title": "Digital twins and artificial intelligence in transportation infrastructure: Classification, application, and future research directions"}, {"paperId": "e4b53999b67aa90ce2a7c666d0f8507e4e3b4cc7", "title": "Digital Twin for Integration of Design-Manufacturing-Maintenance: An Overview"}, {"paperId": "06b6c1dbfcd6ec149ee2372385a9cef03a2f3893", "title": "Artificial intelligence enabled Digital Twins for training autonomous cars"}, {"paperId": "43e051e6075f60bd670fd4eb7dc1f8cb961dc4f9", "title": "Explainable Online Lane Change Predictions on a Digital Twin with a Layer Normalized LSTM and Layer-wise Relevance Propagation"}, {"paperId": "efda118f62b0e301f0b89753116ace708f4eae26", "title": "Artificial intelligence in the digital twins: State of the art, challenges, and future research topics"}, {"paperId": "cd4720cddcb34c959a9ba389be52e3a1d42b2ce6", "title": "Time or Reward: Digital-twin Enabled Personalized Vehicle Path Planning"}, {"paperId": "69a862fccad4c66017d252b36fa6a484bbd636f1", "title": "3D Digital Twin of Intelligent Transportation System based on Road-Side Sensing"}, {"paperId": "e12a7e3d8496f5986386d1e91a2dc8a4a520fab7", "title": "Immersive Services over 5G and Beyond Mobile Systems"}, {"paperId": "4dee682f1478eb9ade8626b19585b25f3ae26b69", "title": "Big data analysis of the Internet of Things in the digital twins of smart city based on deep learning"}, {"paperId": "0bfd3fdafce29cb12738dcaab9deadc5942855b4", "title": "A Transportation Digital-Twin Approach for Adaptive Traffic Control Systems"}, {"paperId": "6be58be28a2fd740f5aed328d34536d8a2043e1b", "title": "Devising Digital Twins DNA Paradigm for Modeling ISO-Based City Services"}, {"paperId": "b8f319fe3ae40aa5966ee5550d13c74b979f9b24", "title": "Exploring the revolution in healthcare systems through the applications of digital twin technology"}, {"paperId": "d70015cbfa98817dcc74f55cd88fc4b9dfc7e36e", "title": "Digital Twins for Smart Home Gadget Threat Prediction using Deep Convolution Neural Network"}, {"paperId": "039685150552f5f6c9b145568b7673c41eafdb38", "title": "A Transportation Digital-Twin Approach for Adaptive Traffic Signal Control Systems"}, {"paperId": "9af55eb18dd4961257a3e8bf8cdb6784f004cfa9", "title": "A Survey on Digital Twin for Industrial Internet of Things: Applications, Technologies and Tools"}, {"paperId": "f20b631de555a0b6d8032ad733cf1b2381d4ff37", "title": "Survey on Digital Twin Edge Networks (DITEN) Toward 6G"}, {"paperId": "531d65a583341045fa6940157e742450ade30ec6", "title": "Efficient Procedure of Building University Campus Models for Digital Twin Simulation"}, {"paperId": "9f739d9508353866f704383772f059d6770891d1", "title": "Artificial intelligence in the digital twins: State of the art, challenges, and future research topics [version 2; peer review: 1 approved, 1 approved with reservations]"}, {"paperId": "79f213c5a70b1d9c0b9382aa50acab83f8275fb2", "title": "Digital Twins from Smart Manufacturing to Smart Cities: A Survey"}, {"paperId": "31ee33a704596a837cd6f852a5e15f049ff41a32", "title": "5.0 Applications of AI in Transportation Industry"}, {"paperId": "de43687693ced0bb45876f55841c971dc8a7d435", "title": "Realistic Synthetic Health Condition Timelines: Generating the Patient History using Contextually Appropriate Disease Burden and Health Statistics"}]}
