{"paperId": "059efea63293b4a743ab12447c4b383f0ff8c649", "publicationVenue": {"id": "99026156-eedd-4e3c-9797-a7eca6658ad3", "name": "IEEE International Conference on Cognitive Infocommunications", "type": "conference", "alternate_names": ["CogInfoCom", "IEEE Int Conf Cogn Infocommunications"]}, "title": "Eye-tracking Technologies Supporting Vision Screening In Children", "abstract": "The aim of this paper is to contribute to a better understanding of children's vision care from the identification to treatment, with, in particular, a better understanding of the use of eye tracking (ET) technologies. While there are indications that these technologies can support vision care, a comprehensive understanding of the possibilities is lacking. Here, we review cross-disciplinary research on performing vision care, and identify current challenges for using and further developing ET technologies. To this end, we describe (1) the involved stakeholders, (2) screening possibilities at schools, and (3) how technology-supported vision screening is used today. Data come from a literature survey of peer-reviewed journal and conference articles, complemented by secondary sources from related projects and products. The focus is on literature after 2000, and in particular, on screening oculomotor dysfunctions (OMD), for school children. The results show that the contributions to state of the art from various research areas are fragmented, in particular regarding the communication between the necessary stakeholders influencing vision care, the handling of general and functional vision care, and between screening and treatment. Further development of ET technologies will likely depend on overcoming these fragmentations. A first step in this direction consists of providing a thorough description of stakeholders, their roles, and requirements enabling communication on children with vision problems.", "venue": "IEEE International Conference on Cognitive Infocommunications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-09-23", "journal": {"name": "2020 11th IEEE International Conference on Cognitive Infocommunications (CogInfoCom)", "pages": "000471-000478"}, "authors": [{"authorId": "2008210453", "name": "Qasim Ali"}, {"authorId": "2124792", "name": "I. Heldal"}, {"authorId": "1907647", "name": "C. Helgesen"}, {"authorId": "2515907", "name": "Cristina A. Costescu"}, {"authorId": "1694867", "name": "A. Kovari"}, {"authorId": "40323433", "name": "Jozsef Katona"}, {"authorId": "49820786", "name": "Serge Thill"}], "citations": [{"paperId": "2abba7e7ba0aed5a4d39d17892f855ca1f65c990", "title": "Eye Movement Monitoring for Multimedia Content Ranking"}, {"paperId": "26a8bc2b60968ddfba424ba2db0d19f27e179bae", "title": "Current Challenges Supporting School-Aged Children with Vision Problems: A Rapid Review"}, {"paperId": "918220db6df4c8f8bd3d3eef155dcba60b31be71", "title": "Technologies supporting vision screening: a protocol for a scoping review"}, {"paperId": "4d995dd620a23d898a2c47884b2d3c52ae3f9e14", "title": "Supporting School Aged Children to Train Their Vision by Using Serious Games"}, {"paperId": "bb685b97223777127fc16ab3a47eabfd803409de", "title": "Using Eye-tracking Technologies in Vision Teachers’ Work – a Norwegian Perspective"}]}
