{"paperId": "05a02d93acb2906745c18ffa4a92fea888dd3882", "publicationVenue": {"id": "57ef36b3-e71f-44ca-ab80-f893afce2ede", "name": "International Conference on Cloud and Big Data Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Big Data Comput", "International Conference Cloud and Big Data Computing", "ICCBDC"]}, "title": "Towards Elastic Data Warehousing by Decoupling Data Management and Computation", "abstract": "Moving data warehouses to the cloud is what today's companies consider a trend towards cost-effective data management. To fully achieve the economic goal, the cloud data warehouse system is supposed to be able to adjust its resource provisioning to adapt to changing workload requirements. However, traditional data warehousing architecture is not flexible enough to allow on demand resource control, which severely restrains the cloud provider as well as the users to optimize total cost and maintain desired quality of service. To build the data warehouses for the cloud, new architectures should be studied. In this paper we explore such an architecture that decouples data management and data computation to facilitate the on demand resource control. By separating the two parts, the resulting system gains more elasticity and more adaptivity. For the poof of concept, we build a prototype system, called DuoSQL, based on PostgreSQL and Spark. We validate the system using the TPC-H benchmark. The experiment results show the decoupling approach is not only flexible but also has great performance potentials.", "venue": "International Conference on Cloud and Big Data Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-08-26", "journal": {"name": "Proceedings of the 2020 4th International Conference on Cloud and Big Data Computing"}, "authors": [{"authorId": "2118357706", "name": "Zhi Liu"}, {"authorId": "2119798791", "name": "Hao Wu"}, {"authorId": "38902965", "name": "Tongxin Bai"}, {"authorId": "145160100", "name": "Yang Wang"}, {"authorId": "144486540", "name": "Chengzhong Xu"}], "citations": []}
