{"paperId": "05a79e7be56ff55ee2514206d486d04ddf87e37a", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Automatic Tuning of SQL-on-Hadoop Engines on Cloud Platforms", "abstract": "More and more companies are running Big Data workloads on cloud platforms. Configuration tuning of these data engines continues to be an essential but difficult undertaking. Cloud platforms further add to this complexity due to elasticity of compute resources and availability of different machine types. Data engineers have to choose the machine type and the cluster size in addition to the other configuration options. In this paper, we address the problem of automatically determining good configuration parameters for SQL workloads on SQL-On-Hadoop Engines like Hive and Spark, with the goal of optimizing resource usage and cost. We chose to focus on SQL workloads because SQL or SQL-like languages continue to be the most popular choice of ETL engineers and analysts. We propose a model based approach that relies on simple rules and insights into SQL Data Engine behavior and evaluate its effectiveness on both synthetic and real workloads. We show that very simple models can provide very good recommendations compared to the default configuration. In fact, we found that these were often better than those chosen by experts on real customer workloads. A somewhat surprising result is that more expensive machines with larger RAMs often do not lead to significant improvements in query execution times. The principles behind our model based approach are generic and can be adopted for any big data engine.", "venue": "IEEE International Conference on Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 IEEE 11th International Conference on Cloud Computing (CLOUD)", "pages": "508-515"}, "authors": [{"authorId": "2059644954", "name": "P. Deshpande"}, {"authorId": "2641773", "name": "Amogh Margoor"}, {"authorId": "2066169397", "name": "R. Venkatesh"}], "citations": [{"paperId": "a2e6b815217b9b793d6723db3699bc722ed93ba2", "title": "Investigating Automatic Parameter Tuning for SQL-on-Hadoop Systems"}]}
