{"paperId": "05acad3d8f60da8a0d151a1f6f61579681e7df9d", "publicationVenue": {"id": "2e5bd046-611b-48bd-9b5f-c5f066b6492e", "name": "International Conference on Smart Grids and Green IT Systems", "type": "conference", "alternate_names": ["SMARTGREENS", "SmartGreens", "International Conference on Smart Cities and Green ICT Systems", "Int Conf Smart City Green ICT Syst", "Int Conf Smart Grid Green IT Syst"]}, "title": "A Comparative Analysis of Smart Cities Frameworks based on Data Lifecycle Requirements", "abstract": ": Citizens migrate from rural areas to urban centres in search of better living conditions. The rural-urban migration combined with rapid population growth lead to overpopulation, which consequently creates challenges to cities in the use and reallocation of their resources. Smart cities have emerged as an opportunity to assist cities to overcome these difficulties with the usage of information and communication technology (ICT) to improve the lifestyle of their citizens. However, maintenance of a smart city is a difficult task. In this multi-stakeholder system, services from different domains are offered to citizens, which collect data from different sources with different formats that need to be in compliance with regulations, privacy, and security requirements. Therefore, a data lifecycle plays a vital role as a data management framework as a means of reducing the complexity of their ecosystems to assist align their objectives and services offered to the citizens. Prior researches have stated a need for improvement in this framework modelling. The aim of this paper is to address this gap and define data lifecycle requirements which will be used to analyse a selection of smart cities architecture frameworks.", "venue": "International Conference on Smart Grids and Green IT Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "212-219"}, "authors": [{"authorId": "2106216301", "name": "Claudia Roessing"}, {"authorId": "1762696", "name": "M. Helfert"}], "citations": []}
