{"paperId": "05ad5e6c697f33dea3f614606bc4cb6e5bcac14d", "publicationVenue": null, "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques (Technical Report)", "abstract": "Cluster managers play a crucial role in data centers by distributing workloads among infrastructure resources. Declarative Cluster Managers (DCM) is a new cluster management architecture that allows users to express placement policies declaratively using SQL-like queries. In this paper, we share our experiences scaling up this architecture from moderate-sized enterprise clusters (hundreds or thousands of nodes) to hyperscale clusters (tens of thousands of nodes) through the lens of query optimization. To do so, we first formally specify DCM’s declarative language, C-SQL, which introduces new semantics such as variable columns on top of standard SQL to express constraint optimization problems. Given cluster management logic specified as C-SQL programs, we explore and adapt techniques from classic query optimization, namely incremental view maintenance and predicate pushdown, to improve the execution efficiency of the relation and constraint components of C-SQL programs. We evaluate the effectiveness of our optimizations through a case study of building Kubernetes schedulers using C-SQL. Our optimizations demonstrated an almost 3000 × speed up in database latency and reduced the size of optimization problems by as much as 1/300 of the original without affecting feasibility", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "7804757", "name": "Kexin Rong"}, {"authorId": "1707533", "name": "M. Budiu"}, {"authorId": "1580175613", "name": "Athinagoras Skiadopoulos"}, {"authorId": "49060428", "name": "L. Suresh"}, {"authorId": "37531541", "name": "Amy Tai"}], "citations": [{"paperId": "3da9ab4c73021e3d9eee8f6a126037ec3eea957a", "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques"}]}
