{"paperId": "05af4b0f2ef724b7a42e68a4f00bc1ce6d0a93fb", "publicationVenue": {"id": "18be6e14-0ac5-454e-b78d-100e2dddd04e", "name": "International Journal of Advanced Research in Science, Communication and Technology", "type": "journal", "alternate_names": ["Int J Adv Res Sci Commun Technol"], "issn": "2581-9429"}, "title": "The Impact of Artificial Intelligence in Agriculture", "abstract": "Agriculture is playing vital role for the survival of mankind but due to lack of knowledge and decision support will leading us toward less production in our country. Data are analyzed and got clustered according to the requirement of the user which predict the better scenario for the production of the respective crop. Artificial Intelligence (AI) entered into Indian Agriculture and it is affecting our society at large. Even though machine learning (which is a subset of AI) has been used for classifications and prediction purposes for, to cite a few, food grading and crop yield forecasting, recently, the new set of deep learning and data science algorithms shows that the possibilities of taking the research and applications of AI to much higher levels and with much more accuracy. In the same way, other AI techniques are showing ways in all areas including agriculture. AI will help the common man and also transform his thoughts, attitude and mind set towards the benefits that it may bring, there are some disadvantages of such sophisticated technologies as well. In this paper, we will discuss about using modern day AI to solve traditional farming problems, life cycle agriculture, challenges faced by farmers by using AI and applications of AI in agriculture.", "venue": "International Journal of Advanced Research in Science, Communication and Technology", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-04-11", "journal": {"name": "International Journal of Advanced Research in Science, Communication and Technology"}, "authors": [{"authorId": "2267527728", "name": "Dr K. Ammulu"}], "citations": []}
