{"paperId": "05b0e339310f133b39e66a89aeb0876106818114", "publicationVenue": null, "title": "大数据背景下医疗信息共享平台构建研究 Research on the Construction of Medical Information Sharing Platform under the Background of Large Data", "abstract": "首先，本文基于相关研究，分析国内外“互联网+数据”背景下医疗信息共享平台发展的现状，归纳医疗信息共享平台的构成因素，从而构建出能够充分发挥医疗信息效益的生态系统共享平台模型。其次，基于公共服务视角，运用生态系统论的方法，构建以政府为主导、医疗机构为主体、科研机构为先导和个人积极参与的医疗信息生态系统共享平台。最终，根据医疗信息在生态系统共享平台中流转的位置，将共享平台模型分为数据原始层，数据生成层，数据加工处理层，数据效益层，由此构建出我国医疗信息生态系统共享平台的模型，对于提高医疗服务过程具有重要意义。 First of all, based on the related research, this paper analyzes the status quo of the development of medical information sharing platform under the background of “internet plus data” at home and abroad, summarizes the components of the medical information sharing platform, and builds an ecosystem sharing platform model that can give full play to the benefits of medical information. Secondly, based on the perspective of public service, we use the method of ecosystem theory to build a shared platform for medical information ecosystem that is led by the government. The main body is medical institutions, and the scientific research institutions are the leaders and individuals. Finally, according to the position of medical information flowing in the ecosystem sharing platform, the sharing platform model is divided into data primitive layer, data generation layer, data processing layer and data benefit layer, so as to construct the sharing platform of medical in-formation ecosystem in our country model, which has great significance for improving medical service process.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-01-12", "journal": {"name": "Modern Management", "pages": "68-76", "volume": "08"}, "authors": [{"authorId": "2070309938", "name": "Lipeng An"}, {"authorId": "144673334", "name": "Lijun Wan"}], "citations": [{"paperId": "6314e1483b48adca8bd8d5c5258f61ec99b51b27", "title": "Construction Technology Safety Management under the Background of BIM and Information System Modeling"}]}
