{"paperId": "05b5b9db47830ba21f73bbc17b071a9a7326fa50", "publicationVenue": {"id": "89d61e17-5d06-4d45-a0d0-c7b62b0a35b4", "name": "ACM Workshop on Hot Topics in Networks", "type": "conference", "alternate_names": ["HotNets", "ACM Workshop Hot Top Netw", "Hot Top Netw", "Hot Topics in Networks"], "url": "http://www.sigcomm.org/events/hotnets-workshop"}, "title": "Full-stack SDN", "abstract": "The conventional approach for building software-defined network systems requires separately developing the management, control, and data planes. Manually written code connects the management plane's configuration to the control plane, and the control plane generates the data planes' configurations as small program fragments that scatter across the codebase. Scalability and correctness become increasingly challenging as such a system develops and grows. In contrast, in our approach, called Nerpa, all three planes are programmed in a unified way. In Nerpa a transactional database stores management plane state. The control plane is implemented in a specialized query language which automatically executes in an incremental fashion, improving scalability. Finally, the data plane is programmed in P4. To aid correctness, all three parts are type-checked together, and tools generate code for data movement between planes. We have published a prototype implementation using an open-source license. We believe that full-stack SDN can build more robust and maintainable networked systems.", "venue": "ACM Workshop on Hot Topics in Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-11-14", "journal": {"name": "Proceedings of the 21st ACM Workshop on Hot Topics in Networks"}, "authors": [{"authorId": "39460558", "name": "Debnil Sur"}, {"authorId": "2597025", "name": "Ben Pfaff"}, {"authorId": "3150866", "name": "L. Ryzhyk"}, {"authorId": "1707533", "name": "M. Budiu"}], "citations": [{"paperId": "3da9ab4c73021e3d9eee8f6a126037ec3eea957a", "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques"}, {"paperId": "05ad5e6c697f33dea3f614606bc4cb6e5bcac14d", "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques (Technical Report)"}]}
