{"paperId": "05b80b27144caa616e49269ece045287c2f91c0c", "publicationVenue": {"id": "38acad02-d647-4d48-be25-55a418138f2a", "name": "Transportation Research Record", "type": "journal", "alternate_names": ["Transp Res Rec"], "issn": "0361-1981", "url": "http://trb.org/news/blurb_detail.asp?id=1676"}, "title": "Role of Urban Big Data in Travel Behavior Research", "abstract": "Understanding urban travel behavior (TB) is critical for advancing urban transportation planning practice and scholarship; however, traditional survey data is expensive (because of labor costs) and error-prone. With advances in data collection techniques and data analytic approaches, urban big data (UBD) is currently generated at an unprecedented scale in relation to volume, variety, and speed, producing new possibilities for applying UBD for TB research. A review of more than 50 scholarly articles confirms the remarkable and expanding role of UBD in TB research and its advantages over traditional survey data. Using this body of published work, a typology is developed of four key types of UBD—social media, GPS log, mobile phone/location-based service, and smart card—focusing on the features and applications of each type in the context of TB research. This paper discusses in significant detail the opportunities and challenges in the use of UBD from three perspectives: conceptual, methodological, and political. The paper concludes with recommendations for researchers to develop data science knowledge and programming skills for analysis of UBD, for public and private sector agencies to cooperate on the collection and sharing of UBD, and for legislators to enforce data security and confidentiality. UBD offers both researchers and practitioners opportunities to capture urban phenomena and deepen knowledge about the TB of individuals.", "venue": "Transportation Research Record", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-07", "journal": {"name": "Transportation Research Record", "pages": "222 - 233", "volume": "2675"}, "authors": [{"authorId": "2116633171", "name": "Chihuangji Wang"}, {"authorId": "11601980", "name": "D. B. Hess"}], "citations": [{"paperId": "b63618fa2d647b023ed56bae0d8ea38c3f5d56bb", "title": "Big Data Analysis for Travel Time Characterization in Public Transportation Systems"}, {"paperId": "a111e2810d181e02aebbe124e44d892ee32f7dff", "title": "Urban tourists’ spatial distribution and subgroup identification in a metropolis --the examination applying mobile signaling data and latent profile analysis"}, {"paperId": "a08878e7a5edbc75e865a8846af4900404a0d6d3", "title": "Beyond Residence: A Mobility-based Approach for Improved Evaluation of Human Exposure to Environmental Hazards"}]}
