{"paperId": "05bdebea16f0c93cc59db07bb3007b3c3b44de23", "publicationVenue": {"id": "505bd3de-b1ce-4c78-bbc5-b6f47dc42c4f", "name": "International Conference on Software Quality, Reliability and Security", "type": "conference", "alternate_names": ["QRS", "Int Conf Softw Qual Reliab Secur"]}, "title": "Automated Identification of Performance Changes at Code Level", "abstract": "To develop software with optimal performance, even small performance changes need to be identified. Identifying performance changes is challenging since the performance of software is influenced by non-deterministic factors. Therefore, not every performance change is measurable with reasonable effort. In this work, we discuss which performance changes are measurable at code level with reasonable measurement effort and how to identify them. We present (1) an analysis of the boundaries of measuring performance changes, (2) an approach for determining a configuration for reproducible performance change identification, and (3) an evaluation comparing of how well our approach is able to identify performance changes in the application server Jetty compared with the usage of Jetty’s own performance regression benchmarks.Thereby, we find (1) that small performance differences are only measurable by fine-grained measurement workloads, (2) that performance changes caused by the change of one operation can be identified using a unit-test-sized workload definition and a suitable configuration, and (3) that using our approach identifies small performance regressions more efficiently than using Jetty’s performance regression benchmarks.", "venue": "International Conference on Software Quality, Reliability and Security", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 22nd International Conference on Software Quality, Reliability and Security (QRS)", "pages": "916-925"}, "authors": [{"authorId": "2787910", "name": "D. Reichelt"}, {"authorId": "1486403194", "name": "Stefan Kühne"}, {"authorId": "1712950", "name": "W. Hasselbring"}], "citations": [{"paperId": "9493cc40594a69a9d91e6d2775c449c59c0a9759", "title": "Impact of Architectural Smells on Software Performance: an Exploratory Study"}]}
