{"paperId": "05c133c0b5863db8b8c36b4d37fcdb0d0f000715", "publicationVenue": null, "title": "Based on TPUGRAPHS Predicting Model Runtimes Using Graph Neural Networks", "abstract": "Deep learning frameworks are mainly divided into pytorch in academia and tensorflow in industry, where pytorch is a dynamic graph and tensor flow is a static graph, both of which are essentially directed and loopless computational graphs. In TensorFlow, data input into the model requires a good computational graph structure to be executed, and static graphs have more optimization methods and higher performance. The node of the graph is OP and the edge is tensor. The static diagram is fixed after the compilation is completed, so it is easier to deploy on the server. How to compile a static graph. It is found that in the compilation process of static graphs, the configuration of the compiler (config) affects the way the compiler compiles and optimizes the model, and ultimately affects the running time of the model. We propose a reliable model, which can predict the best compilation configuration of the model according to the compilation configuration and runtime of the machine learning model in the training dataset to minimize the running time.", "venue": "Frontiers in Computing and Intelligent Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-26", "journal": {"name": "Frontiers in Computing and Intelligent Systems"}, "authors": [{"authorId": "2268958571", "name": "Jingyu Xu"}, {"authorId": "2268854986", "name": "Linying Pan"}, {"authorId": "2268864180", "name": "Qiang Zeng"}, {"authorId": "2268798337", "name": "Wenjian Sun"}, {"authorId": "2268784655", "name": "Weixiang Wan"}], "citations": [{"paperId": "8ec45c9084aa172813443286a88429421280e1d5", "title": "Implementation of an AI-based MRD evaluation and prediction model for multiple myeloma"}, {"paperId": "ff99c2376224e6a2cbea883f8c938e42c4f2fce1", "title": "Deep Learning-Based Medical Image Registration Algorithm: Enhancing Accuracy with Dense Connections and Channel Attention Mechanisms"}, {"paperId": "7c81e4d21ff6911b9106ee28a91bae09c713f59e", "title": "AI-Driven Anonymization: Protecting Personal Data Privacy While Leveraging Machine Learning"}, {"paperId": "badc8899fe13484d75bd6c7ae4737c2837394b93", "title": "Machine Learning-Based Vehicle Intention Trajectory Recognition and Prediction for Autonomous Driving"}, {"paperId": "0b21a55dcd8e5d4679ea6515be5ae5bd5007e813", "title": "Optimizing Portfolio Management and Risk Assessment in Digital Assets Using Deep Learning for Predictive Analysis"}, {"paperId": "ac55b7824a012d4dae0791c7b4993fa4459a31f7", "title": "Construction and application of artificial intelligence crowdsourcing map based on multi-track GPS data"}, {"paperId": "17ea664b533bb804456aadab726c31047f7a36aa", "title": "Development of Machine Learning and Artificial Intelligence in Toxic Pathology"}, {"paperId": "d32e4a947433e1fb9803e0988bce865463e02a31", "title": "A deep learning-based algorithm for crop Disease identification positioning using computer vision"}, {"paperId": "b8a413c652b7caeb56a5188ea1b4ee486e3cd452", "title": "Enhancing Computer Digital Signal Processing through the Utilization of RNN Sequence Algorithms"}, {"paperId": "de0a1ab13b625e5e73b26caa450585f1d7b7667d", "title": "Implementation of computer vision technology based on artificial intelligence for medical image analysis"}, {"paperId": "274773854946a24cf506f33200259c2973d19ebb", "title": "Grasp and Inspection of Mechanical Parts based on Visual Image Recognition Technology"}, {"paperId": "d7e9c9ea1ceba7f3e375566af1b090ef57fb6eea", "title": "Research Progress of Diabetic Disease Prediction Model in Deep Learning"}, {"paperId": "37e0cccfc969fb61b7e1fe77289d9399daef247a", "title": "Application of HPV-16 in Liquid-Based thin Layer Cytology of Host Genetic Lesions Based on AI Diagnostic Technology Presentation of Liquid"}, {"paperId": "80fe901586c6aa2e7f6c29318aed325ce8a4b927", "title": "Improvements and Challenges in StarCraft II Macro-Management A Study on the MSC Dataset"}, {"paperId": "c59e1ef9b7ec21bf2e0404abf81be51913ae0b88", "title": "Detection of Esophageal Cancer Lesions Based on CBAM Faster R-CNN"}, {"paperId": "b0a47876403d63916f0ba9b7ecced66a336c4a9c", "title": "The Application of Artificial Intelligence to The Bayesian Model Algorithm for Combining Genome Data"}]}
