{"paperId": "05c8d51201b6cf995a1b2476311f221089868a34", "publicationVenue": {"id": "ea6f8e73-16d8-4fe3-84e3-d8e396737c19", "name": "Management Sciences", "type": "journal", "alternate_names": ["Manag sci", "Manag Sci", "Management Science", "Management science"], "issn": "2080-6000", "alternate_issns": ["0025-1909"], "url": "http://noz.ue.wroc.pl/", "alternate_urls": ["http://mansci.journal.informs.org/", "http://www.jstor.org/journals/00251909.html", "https://www.jstor.org/journal/manascie", "https://pubsonline.informs.org/journal/mnsc", "http://pubsonline.informs.org/journal/mnsc"]}, "title": "Online Learning and Optimization for Revenue Management Problems with Add-on Discounts", "abstract": "We study in this paper a revenue-management problem with add-on discounts. The problem is motivated by the practice in the video game industry by which a retailer offers discounts on selected supportive products (e.g., video games) to customers who have also purchased the core products (e.g., video game consoles). We formulate this problem as an optimization problem to determine the prices of different products and the selection of products for add-on discounts. In the base model, we focus on an independent demand structure. To overcome the computational challenge of this optimization problem, we propose an efficient fully polynomial-time approximation scheme (FPTAS) algorithm that solves the problem approximately to any desired accuracy. Moreover, we consider the problem in the setting in which the retailer has no prior knowledge of the demand functions of different products. To solve this joint learning and optimization problem, we propose an upper confidence bound–based learning algorithm that uses the FPTAS optimization algorithm as a subroutine. We show that our learning algorithm can converge to the optimal algorithm that has access to the true demand functions, and the convergence rate is tight up to a certain logarithmic term. We further show that these results for the independent demand model can be extended to multinomial logit choice models. In addition, we conduct numerical experiments with the real-world transaction data we collect from a popular video gaming brand’s online store on Tmall.com. The experiment results illustrate our learning algorithm’s robust performance and fast convergence in various scenarios. We also compare our algorithm with the optimal policy that does not use any add-on discount. The comparison results show the advantages of using the add-on discount strategy in practice. This paper was accepted by J. George Shanthikumar, big data analytics.", "venue": "Management Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-02", "journal": {"name": "Materials Performance eJournal"}, "authors": [{"authorId": "1397221034", "name": "D. Simchi-Levi"}, {"authorId": "2068170086", "name": "Rui Sun"}, {"authorId": "46701847", "name": "Huanan Zhang"}], "citations": [{"paperId": "bd9dce70da9c27b5153f795be14992b16282fb05", "title": "UCB-Type Learning Algorithms with Kaplan–Meier Estimator for Lost-Sales Inventory Models with Lead Times"}, {"paperId": "b0663bc79efe90e798feedcac345d835fc928592", "title": "Sales pricing models based on returns: Bundling vs. add-on"}, {"paperId": "07b28bca861fd7c802b3c475d417b7ec5bae73ba", "title": "Optimal contract design in mobile service industry considering network congestion"}, {"paperId": "8eb4ad9b2bc21e2ac169313cfc16da5e88654ab7", "title": "Data-Driven Revenue Management: The Interplay of Data, Model, and Decision"}, {"paperId": "661f6c756987da82fe3e08f13e000aefc22fe666", "title": "Dynamic pricing and inventory control for multiple products in a retail chain"}, {"paperId": "a8c4c88b985f9619f57e47055a3125037cda0ac1", "title": "Phase Transitions in Learning and Earning under Price Protection Guarantee"}, {"paperId": "9fdd903a98c2b075e819ef5b48033e1fbf2e105b", "title": "Developing operations management data analytics"}, {"paperId": "8ddac35ea8dd7b478ca0917ed2ca323c982fe5ef", "title": "Promotheus: An End-to-End Machine Learning Framework for Optimizing Markdown in Online Fashion E-commerce"}, {"paperId": "258a2a4fe5dd50aa78843e1dd27693533ec9b64d", "title": "PRINCIPRO: Data-Driven Algorithms for Joint Pricing and Inventory Control under Price Protection"}]}
