{"paperId": "05c9cc866408b03c9312f3e15b0a9f49ce21514b", "publicationVenue": {"id": "5101a3ba-d438-417c-8e7b-0d66475e0f19", "name": "International Workshop on Advances in Sensors and Interfaces", "type": "conference", "alternate_names": ["IWASI", "Int Workshop Adv Sens Interface", "IEEE Int Workshop Adv Sens Interface", "IEEE International Workshop on Advances in Sensors and Interfaces"]}, "title": "A Cloud-Edge Artificial Intelligence Framework for Sensor Networks", "abstract": "Internet of Things devices allow building increasingly large-scale sensor networks for gathering heterogeneous high-volume data streams. Artificial Intelligence (AI) applications typically collect them into centralized cloud infrastructures to run computationally intensive Machine Learning (ML) tasks. According to the emerging edge computing paradigm, instead, data preprocessing, model training and inference can be distributed among devices at the border of the local network, exploiting data locality to improve response latency, bandwidth usage and privacy, at the cost of suboptimal model accuracy due to smaller training sets. The paper proposes a cloud-edge framework for sensor-based AI applications, enabling a dynamic trade-off between edge and cloud layers by means of: (i) a novel containerized microservice architecture, allowing the execution of both model training and prediction either on edge or on cloud nodes; (ii) flexible automatic migration of tasks between the edge and the cloud, based on opportunistic management of resources and workloads. In order to facilitate implementations, a scouting of compatible device platforms for field sensing and edge computing nodes has been carried out, as well as a selection of suitable open-source off-the-shelf software tools. Early experiments validate the feasibility and core benefits of the proposal.", "venue": "International Workshop on Advances in Sensors and Interfaces", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-08", "journal": {"name": "2023 9th International Workshop on Advances in Sensors and Interfaces (IWASI)", "pages": "149-154"}, "authors": [{"authorId": "3205335", "name": "G. Loseto"}, {"authorId": "1696528", "name": "Floriano Scioscia"}, {"authorId": "1686717", "name": "M. Ruta"}, {"authorId": "2984062", "name": "F. Gramegna"}, {"authorId": "3011421", "name": "S. Ieva"}, {"authorId": "1523809705", "name": "Corrado Fasciano"}, {"authorId": "9548168", "name": "Ivano Bilenchi"}, {"authorId": "2147159664", "name": "Davide Loconte"}, {"authorId": "1738818", "name": "E. Sciascio"}], "citations": [{"paperId": "f62063512ba415f0f34c4f25599ebf4d908d0246", "title": "Impact Analysis of the Use of IoT Technology and Environmental Monitoring Systems on Waste Reduction in the Food and Beverage Industry in Indonesia"}]}
