{"paperId": "05ce787f3c91d29c65f1a5e89417b5ad028c7301", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Making Sense of Post-match Fan Behaviors in the Online Football Communities", "abstract": "Professional sports have large fan bases that congregate in online sports fan communities. The sports community is suitable to be a sandbox for studying offline context’s effects on online community behavior. By now, prior works did not present a detailed study on the offline-online connection by examining detailed community discussion content. To fill this gap, this work presents a comprehensive study of online communities’ comments about football (soccer) matches, grounded in the data from Premier League teams’ Reddit online communities during the 2020-2021 season. We propose a metric “gap score” to quantify offline events’ effects by measuring the gap between fans’ prematch expectations and actual match results. Using this metric, we investigated how team performance impacted comments’ sentiment, discussion topics, and the pattern of comments’ votes. The findings highlight the close connection that exists between offline events and online discussions and reveals both theoretical and practical implications for online communities.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-04-19", "journal": {"name": "Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "2193096815", "name": "Yucheng Wang"}, {"authorId": "2110326898", "name": "Zhicong Lu"}], "citations": [{"paperId": "d2f4fbc8bd3821b7357e8471a8f1e70b809296fd", "title": "‘Best run club in the world': Manchester City fans and the legitimation of sportswashing?"}]}
