{"paperId": "05d2ced6a4fb7efb8d527a228ad792526a202235", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "How Trustworthy are Open-Source LLMs? An Assessment under Malicious Demonstrations Shows their Vulnerabilities", "abstract": "The rapid progress in open-source Large Language Models (LLMs) is significantly driving AI development forward. However, there is still a limited understanding of their trustworthiness. Deploying these models at scale without sufficient trustworthiness can pose significant risks, highlighting the need to uncover these issues promptly. In this work, we conduct an adversarial assessment of open-source LLMs on trustworthiness, scrutinizing them across eight different aspects including toxicity, stereotypes, ethics, hallucination, fairness, sycophancy, privacy, and robustness against adversarial demonstrations. We propose advCoU, an extended Chain of Utterances-based (CoU) prompting strategy by incorporating carefully crafted malicious demonstrations for trustworthiness attack. Our extensive experiments encompass recent and representative series of open-source LLMs, including Vicuna, MPT, Falcon, Mistral, and Llama 2. The empirical outcomes underscore the efficacy of our attack strategy across diverse aspects. More interestingly, our result analysis reveals that models with superior performance in general NLP tasks do not always have greater trustworthiness; in fact, larger models can be more vulnerable to attacks. Additionally, models that have undergone instruction tuning, focusing on instruction following, tend to be more susceptible, although fine-tuning LLMs for safety alignment proves effective in mitigating adversarial trustworthiness attacks.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-15", "journal": {"name": "ArXiv", "volume": "abs/2311.09447"}, "authors": [{"authorId": "2135579717", "name": "Lingbo Mo"}, {"authorId": "7425689", "name": "Boshi Wang"}, {"authorId": "1998918", "name": "Muhao Chen"}, {"authorId": "2267020732", "name": "Huan Sun"}], "citations": [{"paperId": "b0a890c4726b98139e51669f39dafbad568c352f", "title": "Decoding Compressed Trust: Scrutinizing the Trustworthiness of Efficient LLMs Under Compression"}, {"paperId": "504f07874899ad12db96abb0121d9a86b00cbb63", "title": "AraTrust: An Evaluation of Trustworthiness for LLMs in Arabic"}, {"paperId": "b877f5076c617a948081e12e08809e6c6b84b468", "title": "ERBench: An Entity-Relationship based Automatically Verifiable Hallucination Benchmark for Large Language Models"}, {"paperId": "76132c4494ef9d4792b7aeb7a868ffe45ca850a8", "title": "A Trembling House of Cards? Mapping Adversarial Attacks against Language Agents"}, {"paperId": "49cd807031bb658e13df21fc05a79c77f0c6b6d3", "title": "Asymmetric Bias in Text-to-Image Generation with Adversarial Attacks"}, {"paperId": "23e5395b4c6249c2873666bff73e203821c14719", "title": "Instruction Tuning with Human Curriculum"}]}
