{"paperId": "05d6cc3347dd30612db959bd64ee5dbdc9e64a64", "publicationVenue": null, "title": "Big data: la puesta en crisis de la protección de datos personales", "abstract": "En la ultima decada, ocho de las principales economias globales entre las cuales se encuentra Estados Unidos, Reino Unido, Australia, Corea del Sur, la Union Europea, Francia, Japon y China han avanzado en una politica nacional de aprovechamiento de datos, por lo que resulta un avance muy significativo que en Colombia se este dando un paso al frente con esta tematica como lo informa la Revista Dinero (“Politica Publica de Big Data”, 2018). \nColombia es el primer pais de America Latina que desarrolla una politica publica de explotacion de datos por medio del Consejo Nacional de Politica Economica y Social (CONPES), promulgada el 17 de abril del ano 2018 gracias al trabajo conjunto del Departamento Nacional de Planeacion, el Ministerio de las Tecnologias de la Informacion y las Comunicaciones, y la SIC. Con esta politica se pretende invertir alrededor de 16.728 millones de pesos colombianos para ampliar el aprovechamiento de datos, de forma tal que puedan ser administrados como activos que sirvan para generar un valor social y economico (DNP, 2018). \nSegun el CONPES 3920 en Colombia las acciones que se ejecuten por medio de esta politica estaran regidas por una serie de principios como lo son: (i) el respeto de los derechos de los derechos humanos, (ii) la promocion de datos publicos como recursos de la infraestructura publica, y (iii) el respeto por la dignidad humana que orienta los usos socialmente permitidos de los mismos datos, con lo que finalmente se pretende conseguir una colaboracion entre el sector publico y privado. \nEn el documento mencionado queda claro que para la ejecucion eficiente de esta politica es necesario la implantacion, mantenimiento y explotacion de las infraestructuras de los datos. Por lo anterior, se establece que el Estado por medio de sus entidades publicas es el encargado de colaborar con la creacion de tal infraestructura. Para octubre del presente ano se espera que gracias al trabajo conjunto de las citadas instituciones se haya avanzado en el proceso de regulacion de la infraestructura de datos publicos y las condiciones necesarias para su implementacion. \nAhora bien, los beneficios esperados del analisis masivo de datos no solo se refieren a la esfera publica, sino que se extienden al sector privado, el diario The economist afirma la existencia de una “economia de los datos”, las personas intercambian sus datos a cambio del acceso gratuito a servicios digitales, por ejemplo ingresar a las plataformas de las redes sociales o motores de busqueda; estos datos son recolectados, almacenados y sujetos a procesos analiticos que permiten descubrir usos valiosos (“the world’s most valuable resource”, 2017; “Data is giving rise to a new economy”, 2017).", "venue": "", "year": 2018, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2018-12-04", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "122484447", "name": "Juan Fernando Vela Jiménez"}, {"authorId": "152360516", "name": "F. Serrano"}], "citations": []}
