{"paperId": "05d7630f93f8f7322a7f565e0aa45e87ec91ba14", "publicationVenue": {"id": "12b499eb-56c9-4d88-b792-6d90ceff3485", "name": "International Conference on Emerging Technologies", "type": "conference", "alternate_names": ["ICET", "Int Conf Emerg Technol"]}, "title": "A Novel Architecture to Integrate Multi-Source Data into Distributed Environment using Big Data Infrastructure", "abstract": "The amount of data has been increasing over the last few years due to the emergence of various end-user applications. These applications utilize cloud computing infrastructure in the data centers. Apart from the increasing volume of data, there are other factors such as variety, velocity, and veracity of the data which result in the problem of big data. Traditional database management systems are not efficient to handle big data. The use of big data platform is necessary to resolve the big data problem. Hadoop is one of the platforms which resolves the problem of big data. Hadoop uses distributed storage. HBase is one of the big data tools for storing big data in Hadoop. HBase is a column-oriented, distributed and high fault-tolerant database. It can store billions of rows at a time. However, there are some issues in HBase. When the data comes from multiple sources, it is stored in multiple tables in HBase. As a result, the performance of HBase degrades when there is a need to perform join operations. In this research, we propose a data model which stores data of multiple sources into a single HBase table. There is no issue of join performance of HBase in the proposed technique as there is no need to perform join because the data is integrated into a single HBase table. The proposed model has a unique row key and multiple column families to integrate data from multiple sources in single table. We evaluated the proposed technique using a real testbed by considering a dataset of two publishers. We compare the performance of the proposed technique by storing data in to multiple tables in Hive. Results show improved query performance of the proposed technique as compared to the traditional approach of using join operations in multiple tables in Hive.", "venue": "International Conference on Emerging Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 15th International Conference on Emerging Technologies (ICET)", "pages": "1-6"}, "authors": [{"authorId": "121243993", "name": "Sidra Zulfiqar"}, {"authorId": "1708246102", "name": "Amen Faridoon"}, {"authorId": "2113544608", "name": "Muhammad Imran"}], "citations": [{"paperId": "76bdc9dd875694307a8b6040e97ab96fa2de9fdc", "title": "Automatic SQL to HQL-NoSQL Querying using PostgreSQL and Integrated Hive-Hbase"}]}
