{"paperId": "05d866d5636954cd6a52c9e3cec5aefada6a0f3c", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Task Allocation Methods and Optimization Techniques in Edge Computing: A Systematic Review of the Literature", "abstract": "Task allocation in edge computing refers to the process of distributing tasks among the various nodes in an edge computing network. The main challenges in task allocation include determining the optimal location for each task based on the requirements such as processing power, storage, and network bandwidth, and adapting to the dynamic nature of the network. Different approaches for task allocation include centralized, decentralized, hybrid, and machine learning algorithms. Each approach has its strengths and weaknesses and the choice of approach will depend on the specific requirements of the application. In more detail, the selection of the most optimal task allocation methods depends on the edge computing architecture and configuration type, like mobile edge computing (MEC), cloud-edge, fog computing, peer-to-peer edge computing, etc. Thus, task allocation in edge computing is a complex, diverse, and challenging problem that requires a balance of trade-offs between multiple conflicting objectives such as energy efficiency, data privacy, security, latency, and quality of service (QoS). Recently, an increased number of research studies have emerged regarding the performance evaluation and optimization of task allocation on edge devices. While several survey articles have described the current state-of-the-art task allocation methods, this work focuses on comparing and contrasting different task allocation methods, optimization algorithms, as well as the network types that are most frequently used in edge computing systems.", "venue": "Future Internet", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-28", "journal": {"name": "Future Internet", "pages": "254", "volume": "15"}, "authors": [{"authorId": "2226547056", "name": "Vasilios Patsias"}, {"authorId": "2047301570", "name": "Petros Amanatidis"}, {"authorId": "40476731", "name": "D. Karampatzakis"}, {"authorId": "1949300", "name": "T. Lagkas"}, {"authorId": "100817153", "name": "Kalliopi Michalakopoulou"}, {"authorId": "12942975", "name": "A. Nikitas"}], "citations": [{"paperId": "9b7a2cf5d44ab4fa758bfbf5c5c42808771c2ef1", "title": "Intelligent Resource Orchestration for 5G Edge Infrastructures"}, {"paperId": "b67450b50a7ddaa038918de5c4cbfbe76157410f", "title": "MuHoW: Distributed protocol for resource sharing in collaborative edge-computing networks"}, {"paperId": "d06218dcc306b2fda13a91e8118f89f189c87f3e", "title": "A Learning Game-Based Approach to Task-Dependent Edge Resource Allocation"}, {"paperId": "44e529af8ea40a76df45b4e58bb8c9ffbebada19", "title": "A Comprehensive Survey Exploring the Multifaceted Interplay between Mobile Edge Computing and Vehicular Networks"}, {"paperId": "36929b050d800ba8d250533a9a62765346cdcff6", "title": "Edge AI for Internet of Energy: Challenges and Perspectives"}]}
