{"paperId": "05dd14657164d86edd9366b395da19489b4d7547", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Application and Performance Optimization of MapReduce Model in Image Segmentation", "abstract": "With the increase of glass detection speed, some defects of MapReduce distributed computing framework are exposed, and the processing speed and timeliness cannot meet the requirements of glass-defect detection in industrial technology. Based on the MapReduce distributed computing framework, this paper designs a threshold segmentation method to complete the segmentation of glass-defect images. By improving the replication placement strategy and pipeline scheduling mechanism, the computing and storage are localized, and the timeliness of data processing is accelerated. The experimental results show that the improved MapReduce computing framework has an average increase of 14.8% in processing speed. It can detect the glass ribbon running at 800m/h and also detect the number, position and type of defects on the glass ribbon.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "31835-31844", "volume": "8"}, "authors": [{"authorId": "1716059", "name": "Maozhen Li"}, {"authorId": "2113610317", "name": "Lu Meng"}, {"authorId": "2110272536", "name": "Jiaying Wang"}, {"authorId": "2110558224", "name": "Yong Jin"}, {"authorId": "2118095923", "name": "Binyu Hu"}, {"authorId": "2109212262", "name": "Youxing Chen"}], "citations": [{"paperId": "33855e2f3e8ba76004447fff9ff469ef6d4f6a6b", "title": "Hybrid metaheuristic model based performance-aware optimization for map reduce scheduling"}, {"paperId": "395e3624fd5165bb24add3dfcf0d7ff7e2966ccb", "title": "Comparative Study of Map Reduce Task Scheduling Optimization Techniques"}]}
