{"paperId": "05e1a700ea853a52b30331748d4ba7fc538d9d43", "publicationVenue": {"id": "d6283871-df25-4880-9c85-46e9830f0d22", "name": "International Euromicro Conference on Parallel, Distributed and Network-Based Processing", "type": "conference", "alternate_names": ["Int Euromicro Conf Parallel Distrib Network-based Process", "PDP", "Parallel Distrib Network-based Process", "Parallel, Distributed and Network-Based Processing"], "url": "http://www.euromicro.org/index.html"}, "title": "Pooling critical datasets with Federated Learning", "abstract": "Federated Learning (FL) is becoming popular in different industrial sectors where data access is critical for security, privacy and the economic value of data itself. Unlike traditional machine learning, where all the data must be globally gathered for analysis, FL makes it possible to extract knowledge from data distributed across different organizations that can be coupled with different Machine Learning paradigms. In this work, we replicate, using Federated Learning, the analysis of a pooled dataset (with AdaBoost) that has been used to define the PRAISE score, which is today among the most accurate scores to evaluate the risk of a second acute myocardial infarction. We show that thanks to the extended-OpenFL framework, which implements AdaBoost.F, we can train a federated PRAISE model that exhibits comparable accuracy and recall as the centralised model. We achieved F1 and F2 scores which are consistently comparable to the PRAISE score study of a 16-parties federation but within an order of magnitude less time.", "venue": "International Euromicro Conference on Parallel, Distributed and Network-Based Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-01", "journal": {"name": "2023 31st Euromicro International Conference on Parallel, Distributed and Network-Based Processing (PDP)", "pages": "329-337"}, "authors": [{"authorId": "50467424", "name": "Yasir Arfat"}, {"authorId": "2120640244", "name": "Gianluca Mittone"}, {"authorId": "88728621", "name": "Iacopo Colonnelli"}, {"authorId": "2218974930", "name": "Fabrizio D'Ascenzo"}, {"authorId": "2053593694", "name": "Roberto Esposito"}, {"authorId": "1690549", "name": "Marco Aldinucci"}], "citations": [{"paperId": "692a77139d97d9640efe354636a3c27b8293eb4e", "title": "Experimenting With Normalization Layers in Federated Learning on Non-IID Scenarios"}, {"paperId": "3cbd30688b0b1a297a1a26d143b9523a45cbea21", "title": "Model-Agnostic Federated Learning"}, {"paperId": "5f91b813add4e3c6d07a7c2dc5fcfb764177cd0c", "title": "Boosting Methods for Federated Learning"}]}
