{"paperId": "05e380e5975192cc686b1b12925027059f483444", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "Discovering co-location patterns in multivariate spatial flow data", "abstract": "ABSTRACT Spatial flow co-location patterns (FCLPs) are important for understanding the spatial dynamics and associations of movements. However, conventional point-based co-location pattern discovery methods ignore spatial movements between locations and thus may generate erroneous findings when applied to spatial flows. Despite recent advances, there is still a lack of methods for analyzing multivariate flows. To bridge the gap, this paper formulates a novel problem of FCLP discovery and presents an effective detection method based on frequent-pattern mining and spatial statistics. We first define a flow co-location index to quantify the co-location frequency of different features in flow neighborhoods, and then employ a bottom-up method to discover all frequent FCLPs. To further establish the statistical significance of the results, we develop a flow pattern reconstruction method to model the benchmark null hypothesis of independence conditioning on univariate flow characteristics (e.g. flow autocorrelation). Synthetic experiments with predefined FCLPs verify the advantages of our method in terms of correctness over available alternatives. A case study using individual home-work commuting flow data in the Chicago Metropolitan Area demonstrates that residence- or workplace-based co-location patterns tend to overestimate the co-location frequency of people with different occupations and could lead to inconsistent results.", "venue": "International Journal of Geographical Information Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-20", "journal": {"name": "International Journal of Geographical Information Science", "pages": "720 - 748", "volume": "36"}, "authors": [{"authorId": "15996861", "name": "Jiannan Cai"}, {"authorId": "1817124213", "name": "Mei‐Po Kwan"}], "citations": [{"paperId": "abb18746968f57936c65ea99487c05ad8f508acf", "title": "Mining co-location patterns of manufacturing firms using Q statistic and additive color mixing"}, {"paperId": "132c488b38c8a11e895cdf0333f777c06635eab8", "title": "Mining significant local spatial association rules for multi-category point data"}, {"paperId": "53752df9fdb378ad999f4cff111889dfc3ba1adb", "title": "Modelling and application of a spectral clustering method for shared bicycle trajectories"}, {"paperId": "3f6ae8f0f5446dac4de123987e334ec532a9ac66", "title": "Do Locations of Employment and Residence Influence whether People Use Virtual Social Networks? A Case Study of Residents in Wuhan, China"}, {"paperId": "db8c3490267f2f22921a5210c6b6e9f5d1275d95", "title": "Spatio-temporal flow patterns"}, {"paperId": "a0e6ebaaf7cc078fbd1fc8cd86b656d8b38c8037", "title": "Understanding Social Inequality in Individual Perceived Exposures to Air Pollution in Residential and Visited Neighborhoods: A Study Using Association Rule Mining"}, {"paperId": "7b578b5e86c37ea4bb5328eae60a2d7c322a2b7d", "title": "Pollution Level, Ecological Risk Assessment and Vertical Distribution Pattern Analysis of Heavy Metals in the Tailings Dam of an Abandon Lead–Zinc Mine"}, {"paperId": "8b99b9acad34b3218a6fed8d4cbc1a2a2dad80dc", "title": "Spatially adaptive machine learning models for predicting water quality in Hong Kong"}, {"paperId": "23908d26764476eceec6d1e5628e544a4c1149f9", "title": "A two-level random forest model for predicting the population distributions of urban functional zones: A case study in Changsha, China"}, {"paperId": "4534cf9293c1f085bc2e2d83f8d95081537d6362", "title": "Flow colocation quotient: Measuring bivariate spatial association for flow data"}, {"paperId": "bc02055dd6731c878240bf44c45f438446f41e4d", "title": "Spatial co-location pattern mining over extended objects based on cell-relation operations"}, {"paperId": "34e4c402470f54ec5b59196a92b33c5844264694", "title": "Detecting spatial flow outliers in the presence of spatial autocorrelation"}, {"paperId": "b4dbecb672bfce1bbe674030000c20d8cf12ac5e", "title": "Discovering Spatio-Temporal Co-Occurrence Patterns of Crimes with Uncertain Occurrence Time"}, {"paperId": "7492118661d6e5fc44d4637e92dd0e409116fcc9", "title": "Inferring nonwork travel semantics and revealing the nonlinear relationships with the community built environment"}]}
