{"paperId": "05e3ad22e92e84031e953b924c9cc76257e2e7c4", "publicationVenue": {"id": "94351e08-c32e-455c-ba6b-4df6cb877d20", "name": "International Mediterranean Conference on Communications and Networking", "type": "conference", "alternate_names": ["MeditCom", "Int Mediterr Conf Commun Netw"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1844324/all-proceedings"}, "title": "Deep Reinforcement Learning-based Task Offloading in MEC for energy and resource-constrained devices", "abstract": "The combination of Multi-access Edge Computing (MEC) and task offloading paradigms will enable next-generation IoT applications that are currently hampered due to the computational and battery limitations of IoT devices. Moreover, the requirements of such apps can be so variable that guaranteeing a certain Quality-of-Experience (QoE) level when performing offloading decisions means enhancing the user experience of IoT services. To address this problem, in this paper, a QoE-based offloading algorithm is proposed. Considering an unpredictable time-varying environment, a Deep Reinforcement Learning (DRL) algorithm is proposed, specifically, an Actor-Critic (AC) algorithm, which targets maximizing the QoE value. To that end, a novel QoE calculation method is proposed, encompassing both latency and energy performance, along with the success rate of the arriving tasks, i.e. the tasks that are correctly executed, having their time and energy requirements fulfilled. In addition, computational tasks are classified into three classes, being delay-sensitive, energy-aware, and non-constrained tasks. Some experiment results are presented to show the performance of the algorithm in terms of energy consumption, task success rate, and, finally, QoE values. Simulation results show that the proposed method maximizes success rate and QoE values, which may be conflicting to battery saving in the analyzed environment.", "venue": "International Mediterranean Conference on Communications and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-04", "journal": {"name": "2023 IEEE International Mediterranean Conference on Communications and Networking (MeditCom)", "pages": "127-132"}, "authors": [{"authorId": "2253764281", "name": "Gorka Nieto"}, {"authorId": "8805388", "name": "I. D. L. Iglesia"}, {"authorId": "1401662501", "name": "Unai López-Novoa"}, {"authorId": "2433633", "name": "Cristina Perfecto"}], "citations": []}
