{"paperId": "05e92d5d7557b7b43d4ab591fa561e38e051a579", "publicationVenue": null, "title": "Efficient Movement and Task Management in MapReduce for Fast Analytics of Big Data", "abstract": "MapReduce programming model has achieved great success over the past decade. With its recognized merits such as superior scalability and strong fault tolerance, MapReduce has thrived as a primary processing engine adopted by leading enterprises for analyzing gigantic datasets and driving cloud services. Recently, in order for companies to pursue high quality-of-service and fulfill requests from many customers, the demand for enhancing MapReduce frameworks so that they can leverage the best performance from underlying systems and support multi-tenancy is growing. However, many challenges exist in optimizing contemporary MapReduce frameworks to deliver fast job completion, fairness among many users, high cluster utilization, as well as platform-aware adaptability. This dissertation focuses on pushing forward the evolution of contemporary MapReduce frameworks. We have comprehensively analyzed several major MapReduce systems on different platforms, identified their limitations, and explored various optimization techniques to enhance their performance. In particular, this dissertation aims to address three major challenges that prevent MapReduce frameworks from achieving the optimal performance. These three challenges include (1) exploiting the design of a high-performance I/O services for accelerating the intermediate data movement for MapReduce frameworks; (2) enhancing task management to provision ideal quality-of-service in terms of efficiency and fairness in multi-tenant MapReduce clusters; (3) improving the adaptability of MapReduce frameworks for platforms featuring high performance characteristics. To address these challenges, in this dissertation, we have introduced a novel Network Levitated Merge algorithm, along with a Hadoop Acceleration framework for MapReduce to provide a high-performance I/O layer. Built on top of these techniques, MapReduce can efficiently move a deluge amount of intermediate data among a large number of nodes and yield effective", "venue": "", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2014-05-12", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2108738272", "name": "Yandong Wang"}], "citations": []}
