{"paperId": "05f6bc6a885d9e182be6bb22eb9a05b205dd8b0f", "publicationVenue": null, "title": "A survey of deep learning models in medical therapeutic areas", "abstract": null, "venue": "Artif. Intell. Medicine", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-02-01", "journal": {"name": "Artificial intelligence in medicine", "pages": "\n          102020\n        ", "volume": "112"}, "authors": [{"authorId": "25282305", "name": "Alberto Nogales"}, {"authorId": "1398700665", "name": "Á. García-Tejedor"}, {"authorId": "38796180", "name": "D. Monge"}, {"authorId": "2050182507", "name": "Juan Serrano Vara"}, {"authorId": "2069778926", "name": "C. Anton"}], "citations": [{"paperId": "684f6205f83f4cbf8985d2b0e6dbfd4391567f3d", "title": "How Flawed is ECE? An Analysis via Logit Smoothing"}, {"paperId": "46a4ee9cfa58ad687287169a77fdc54d3a8fbb1a", "title": "A Heuristic Sparsification Method to Improve the Performance of Neural Networks on Autism Spectrum Disorder Identification Tasks"}, {"paperId": "bf2a9a8f2c89404521cab93d52b7e17e81a3e92a", "title": "Use of artificial intelligence software in dental education: A study on assisted proximal caries assessment in bitewing radiographs."}, {"paperId": "4880f54e49df36fd7d045b61f0bddcff53a70000", "title": "Automated Sperm Assessment Framework and Neural Network Specialized for Sperm Video Recognition"}, {"paperId": "696654f3d75f64bd1009a78823b9a79e2e2ba6e3", "title": "Trends in using deep learning algorithms in biomedical prediction systems"}, {"paperId": "561cd47b9b5dcad7e5ea42dbede878e3dc03527f", "title": "Machine learning applied in patient-reported outcome research—exploring symptoms in adjuvant treatment of breast cancer"}, {"paperId": "87bd56c53c257d3f946da070c6fd07be33ad388c", "title": "Analysis of frontier digital technologies in continuing airworthiness management frameworks and applications"}, {"paperId": "844538f8173a9ff763bf89a8cc23ba69e40d6acb", "title": "Clinical predictions of COVID-19 patients using deep stacking neural networks"}, {"paperId": "1201f2f2263c45ba89481ea7019061288d95ac28", "title": "Learned Kernels for Sparse, Interpretable, and Efficient Medical Time Series Processing"}, {"paperId": "38e0b64adae5fe21f4d992446279df6a48d1f1b4", "title": "A Novel Machine Learning-based Diagnostic Algorithm for Detection of Onychomycosis through Nail Appearance"}, {"paperId": "01fb4a954cf21236f9738f7f9fabc336e1edeac3", "title": "Automated detection and classification of acute vertebral body fractures using a convolutional neural network on computed tomography"}, {"paperId": "fdd8356bfe474bb7300c2e5e054d4b70678b882b", "title": "Transformer‐optimized generation, detection, and tracking network for images with drainage pipeline defects"}, {"paperId": "c009b524e6f19c66c4403ece8f9cfab522e9b86f", "title": "Intelligent oncology: The convergence of artificial intelligence and oncology"}, {"paperId": "83c7c9208d045f6d61bf4bbe44c5e0c9773498e6", "title": "SegPC-2021: A challenge & dataset on segmentation of Multiple Myeloma plasma cells from microscopic images"}, {"paperId": "fc8f8a971ec9b159b14e60b5f6ed115292e30827", "title": "HFANet: hierarchical feature fusion attention network for classification of glomerular immunofluorescence images"}, {"paperId": "5fa10e290b98b2967da37bfb53d023dd7d0abf14", "title": "Weakly Supervised Learning using Attention gates for colon cancer histopathological image segmentation"}, {"paperId": "5475155511510ec9e5b7456ea47fc8e5dd07c667", "title": "Ensembled Deep Learning for the Classification of Human Sperm Head Morphology"}, {"paperId": "bcbcb96d9a06054918ef30317852c71f874bc2d9", "title": "Synthetic Generation of Cardiac MR Images Combining Convolutional Variational Autoencoders and Style Transfer"}, {"paperId": "326e27f6d5f9af81cbe8e62c70401d6a69dc5746", "title": "Decision-support systems for managing polypharmacy in the elderly: A scoping review"}, {"paperId": "8d3ec775fc52f10a7f7d8d5e411a62dda27a1f79", "title": "Deep 3D Neural Network for Brain Structures Segmentation Using Self-Attention Modules in MRI Images"}, {"paperId": "d8985ed42a34adb6aacfbdd05518893d5ba5422d", "title": "Diagnosis of ulcerative colitis from endoscopic images based on deep learning"}, {"paperId": "737939a9b9e41d37d45648e5639f0b49b3e982b3", "title": "Impact of quality, type and volume of data used by deep learning models in the analysis of medical images"}, {"paperId": "10f1c8071eae79a66eb8892694f676cc4e3cd8d3", "title": "Deep learning approach based on superpixel segmentation assisted labeling for automatic pressure ulcer diagnosis"}, {"paperId": "5c7c647fe58e00626e72b58fc528c4b5a77b002f", "title": "Practical Application and Challenges of Computer-aided Diagnosis System Using Deep Learning: A Case Study of Gastric Cancer in Japan"}, {"paperId": "d5534d25b8698cd0f37ab4ac18b710bc9884bd82", "title": "Automated tibiofemoral joint segmentation based on deeply supervised 2D-3D ensemble U-Net: Data from the Osteoarthritis Initiative"}, {"paperId": "822304da7fe02b6e5162fcc994aa8ef11bd724cf", "title": "Endoscopic image recognition method of gastric cancer based on deep learning model"}, {"paperId": "80bd89852cc9230562c63983c3bcb75619bb14e5", "title": "Deep Learning Application for Analyzing of Constituents and Their Correlations in the Interpretations of Medical Images"}, {"paperId": "35d837c1207fddbd93c360c0389e94888db440a0", "title": "Unified Analysis Specific to the Medical Field in the Interpretation of Medical Images through the Use of Deep Learning"}, {"paperId": "751bb5f15704dcc896993a304c922cad23bbb50b", "title": "Identifying Condition-action Statements in Medical Guidelines: Three Studies using Machine Learning and Domain Adaptation"}, {"paperId": "b4b9bc0d3367752a7e815a1ecd905c4d3e860e05", "title": "A slice selection guided deep integrated pipeline for Alzheimer’s prediction from Structural Brain MRI"}, {"paperId": "d76fc2fb53d8c1585c957df682711aeafb88eae1", "title": "Application of Image Classification Based on Improved LSTM in Internet Reading Therapy Platform"}, {"paperId": "2db3645f952bf989a4f8d627bf5777d7477210ef", "title": "AIM in Alternative Medicine"}]}
