{"paperId": "05f73df2b8b23afb16b472f8f72c52d80c02d1fe", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Trajectory-Aware Offloading Decision in UAV-Aided Edge Computing: A Comprehensive Survey", "abstract": "Recently, the integration of unmanned aerial vehicles (UAVs) with edge computing has emerged as a promising paradigm for providing computational support for Internet of Things (IoT) applications in remote, disaster-stricken, and maritime areas. In UAV-aided edge computing, the offloading decision plays a central role in optimizing the overall system performance. However, the trajectory directly affects the offloading decision. In general, IoT devices use ground offload computation-intensive tasks on UAV-aided edge servers. The UAVs plan their trajectories based on the task generation rate. Therefore, researchers are attempting to optimize the offloading decision along with the trajectory, and numerous studies are ongoing to determine the impact of the trajectory on offloading decisions. In this survey, we review existing trajectory-aware offloading decision techniques by focusing on design concepts, operational features, and outstanding characteristics. Moreover, they are compared in terms of design principles and operational characteristics. Open issues and research challenges are discussed, along with future directions.", "venue": "Italian National Conference on Sensors", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "24"}, "authors": [{"authorId": "2291592221", "name": "Tanmay Baidya"}, {"authorId": "2291594612", "name": "Ahmadun Nabi"}, {"authorId": "1690219", "name": "S. Moh"}], "citations": []}
