{"paperId": "0605152deb98b33bea7d787aa50490bb71d8ed58", "publicationVenue": {"id": "25207b2e-d51f-4ca5-a33c-5f2a44094732", "name": "Investigación e Innovación en Ingenierías", "alternate_names": ["Investig Innov Ing"], "issn": "2344-8652", "url": "http://revistas.unisimon.edu.co/index.php/innovacioning", "alternate_urls": ["http://publicaciones.unisimonbolivar.edu.co/rdigital/inovacioning/index.php/inovacioning/index"]}, "title": "Criterios de ubicación de algoritmos de inteligencia computacional en la web de las cosas: Revisión sistemática de la literatura", "abstract": "Objetivo: Determinar y caracterizar el estado actual del conocimiento acerca de los criterios de ubicación del procesamiento de datos, utilizando técnicas de inteligencia computacional en un Ecosistema de Objetos Inteligentes de la Web de las Cosas. Metodología: La revisión sistemática que se presenta a continuación se basa en los estudios realizados por Petersen y Kitchenham , se plantearon cuatro preguntas de investigación, se aplicó el método PICOC para identificar las palabras clave, se planteó una cadena de búsqueda y cuatro motores de búsqueda, se plantearon los criterios de inclusión y exclusión de estudios primarios, así como los criterios de evaluación de la calidad, la estrategia de extracción de datos y el método de síntesis. Resultados: Se lograron responder las cuatro preguntas de investigación planteadas, encontrando que la mayoría de los estudios carecen de una implementación en las tres ubicaciones analizadas y un único estudio que compara el desempeño obtenido por un algoritmo de inteligencia computacional al procesar información en distintas ubicaciones del ecosistema. Conclusiones: Se demostró la necesidad de continuar realizando estudios en el área de la localización del procesamiento en ecosistemas inteligentes utilizando técnicas de inteligencia computacional para el procesamiento en distintas ubicaciones. Además, se evidencia una necesidad en hacer un mayor énfasis en la comparativa del rendimiento obtenido al realizar implementaciones teniendo en cuenta distintas técnicas de inteligencia computacional.", "venue": "Investigación e Innovación en Ingenierías", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-13", "journal": {"name": "Investigación e Innovación en Ingenierías"}, "authors": [{"authorId": "2153996990", "name": "LeidyCamilo Enrique Romero Parra"}, {"authorId": "2153999219", "name": "Miguel Ángel Niño Zambrano"}, {"authorId": "2133630906", "name": "Carlos Alberto Cobos Lozada"}], "citations": []}
