{"paperId": "060dd1291e57e1c989c7b01abc68c4716714da28", "publicationVenue": null, "title": "Gerenciamento Térmico e Elétrico de um Centro de Dados utilizando Sensoriamento IoT", "abstract": "The advancement of the Internet of Things (IoT) has enabled greater efficiency in monitoring environments, allowing a better management and discovery of the conditions where the application is inserted. This feature is useful for monitoring High Performance Computing (CAD) environments that require tight control of local conditions. The environment management has become essential with the popularization of Cloud Computing, since an inoperative environment is a critical problem. This work presents a thermal and eletrical control system for CAD environments using IoT. The system monitors the temperature, humidity and electrical power supply of the data center room. Resumo. O avanço da Internet das Coisas (IoT) possibilitou uma maior eficiência no monitoramento de ambientes, permitindo um melhor gerenciamento e descoberta das condições onde a aplicação está inserida. Essa caracterı́stica é útil para monitorar ambientes de Computação de Alto Desempenho (CAD), que precisam de um controle rı́gido das condições do local. A gerência desses ambientes tornou-se algo essencial com a popularização da Computação em Nuvem, pois a inoperância desses ambientes é problema crı́tico. Neste trabalho, apresentamos o GREat Data Center (GDC), um sistema IoT de gerenciamento térmico e elétrico de ambientes de CAD. O sistema monitora temperatura, umidade e fornecimento de energia elétrica da sala de um data center.", "venue": "", "year": 2017, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2017-07-06", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2052484408", "name": "Antonio Rafael Braga"}, {"authorId": "52226137", "name": "Felipe Anderson O. Maciel"}, {"authorId": "147869059", "name": "R. A. D. Almeida"}, {"authorId": "2055861599", "name": "P. A. C. Aguilar"}, {"authorId": "2060298563", "name": "Danielo G. Gomes"}, {"authorId": "2048849", "name": "Rossana M. C. Andrade"}], "citations": [{"paperId": "4e0eae3fabfb21fe45efac70b6c6b5044f4be301", "title": "BeeNotified! A Notification System of Physical Quantities for Beehives Remote Monitoring"}, {"paperId": "b059d29f69f01a1299b17f71525b1a9ab5d770a9", "title": "Um Sistema de Gerenciamento e Automação de Climatização para Eficiência Energética"}]}
