{"paperId": "0612dd9efdda6c928615d73b0b26e21b037f5181", "publicationVenue": {"id": "5a293750-d4be-46f7-8b59-6c44f361ec57", "name": "Eye Tracking Research & Application", "type": "conference", "alternate_names": ["Eye Track Res  Appl", "ETRA"], "url": "http://etra.cs.uta.fi/"}, "title": "Quantifying and understanding the differences in visual activities with contrast subsequences", "abstract": "Understanding differences and similarities between scanpaths has been one of the primary goals for eye tracking research. Sequences of areas of interest mapped from fixations are a major focus for many analytic techniques since these sequences directly relate to the semantic meaning of the visual input. Many studies analyze complete sequences while overlooking the micro-transitions in subsequences. In this paper, we propose a method which extracts subsequences as features and finds contrasting patterns between different viewer groups. The contrast patterns help domain experts to quantify variations between visual activities and understand reasoning processes for complex visual tasks. Experiments were conducted with 39 expert and novice radiographers using nine radiology images corresponding to nine levels of task complexity. Identified contrast patterns, validated by an expert, prove that the method effectively reveals visual reasoning processes that are otherwise hidden.", "venue": "Eye Tracking Research & Application", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-06-25", "journal": {"name": "Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications"}, "authors": [{"authorId": "2116612718", "name": "Yu Li"}, {"authorId": "38518917", "name": "Carla M. Allen"}, {"authorId": "144154559", "name": "C. Shyu"}], "citations": [{"paperId": "1d165f524395b7b30ee9d5f6e73a076ca2c2f058", "title": "LSTMs can distinguish dental expert saccade behavior with high ”plaque-urracy”"}, {"paperId": "2c0c700c8983d11639b9d20bee34fef5a43e57d5", "title": "Effect of Adaptive Guidance and Visualization Literacy on Gaze Attentive Behaviors and Sequential Patterns on Magazine-Style Narrative Visualizations"}, {"paperId": "f1a451ec81147ea54cebeba89a8006f623e1a769", "title": "Effect of Adaptive Guidance and Visualization Literacy on Gaze Attentive Behaviors and Sequential Patterns on Magazine-Style Narrative Visualizations"}, {"paperId": "afe9881d340cccb9477c8411063a3248e897e476", "title": "Computational modeling of human reasoning processes for interpretable visual knowledge: a case study with radiographers"}]}
