{"paperId": "063ea65dee5e3c579e057a277347b0036d4dedb5", "publicationVenue": {"id": "067c4376-ef7c-402d-adff-70aa4b036a53", "name": "Vehicle System Dynamics", "type": "journal", "alternate_names": ["Veh Syst Dyn"], "issn": "0042-3114", "url": "http://www.tandfonline.com/doi/abs/10.1080/00423114.2014.889317", "alternate_urls": ["http://www.tandfonline.com/toc/nvsd20/current"]}, "title": "Vehicle system dynamics in digital twin studies in rail and road domains", "abstract": "A digital twin is aimed to be a virtual model designed to accurately replicate a physical system in the digital world. This is why digital twins have become quite popular in recent years in both rail and road domain applications, and some researchers and engineers have started considering the term as a buzz word that attracts increased interest in their research. In some cases, this leads to misunderstandings regarding the digital twin concept, especially if the discussion relates to digital twins built on physics-based models. This paper’s detailed review has been performed to address this issue considering the application of vehicle system dynamics theories as a basis for development of digital twins and the implementation process in digital twin studies. The results show that most works are focusing on digital twin developments at the ‘top level of the pyramid’ and more comprehensive research and investigation studies are needed in terms of the application of vehicle system dynamics in design and construction of digital twins. This paper adopts and summarises the possible directions for the development of a future framework in terms of disciplines relevant to vehicle system dynamics and presents a forecasting roadmap on future development strategies of digital twins.", "venue": "Vehicle System Dynamics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-13", "journal": {"name": "Vehicle System Dynamics", "pages": "1737 - 1786", "volume": "61"}, "authors": [{"authorId": "50810889", "name": "M. Spiryagin"}, {"authorId": "1963332", "name": "J. Edelmann"}, {"authorId": "66188406", "name": "Florian Klinger"}, {"authorId": "48470838", "name": "C. Cole"}], "citations": [{"paperId": "163f329175efd93bc649af118758db0a5ea719ff", "title": "Light Electric Vehicle Performance with Digital Twin Technology: A Comparison of Motor Types"}, {"paperId": "4b868d6190e711c46cc3fe216192bb43fb8127f6", "title": "A data-driven approach for railway in-train forces monitoring"}, {"paperId": "23ea303dd5d41494713bd3ea70faf06011ede808", "title": "Tridimensional vector path abstracting and trajectory tracking control on ramps of full self-driving vehicle"}, {"paperId": "adc6a3b24c5dc66942379a83cfec02178954894b", "title": "Challenges of Integrating Model-Based Digital Twins for Vehicle Diagnosis"}, {"paperId": "b3eb43f867bdab9b6d5579d35fd4d7139942c03f", "title": "A Systematic Literature Review of Recent Trends and Challenges in Digital Twin Implementation"}, {"paperId": "814f42ab4ce0da1c8bcc14840e6d8072bf1d76c7", "title": "Role of Digital Twin Technology in Automotive Sectors: An Overview"}]}
