{"paperId": "064fa25da483736716268ab56286e40d845d8036", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Spatiotemporal Approaches for Quality Control and Error Correction of Atmospheric Data through Machine Learning", "abstract": "We propose three quality control (QC) techniques using machine learning that depend on the type of input data used for training. These include QC based on time series of a single weather element, QC based on time series in conjunction with other weather elements, and QC using spatiotemporal characteristics. We performed machine learning-based QC on each weather element of atmospheric data, such as temperature, acquired from seven types of IoT sensors and applied machine learning algorithms, such as support vector regression, on data with errors to make meaningful estimates from them. By using the root mean squared error (RMSE), we evaluated the performance of the proposed techniques. As a result, the QC done in conjunction with other weather elements had 0.14% lower RMSE on average than QC conducted with only a single weather element. In the case of QC with spatiotemporal characteristic considerations, the QC done via training with AWS data showed performance with 17% lower RMSE than QC done with only raw data.", "venue": "Computational Intelligence and Neuroscience", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-11", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2020"}, "authors": [{"authorId": "2109612227", "name": "Hyejin Kim"}, {"authorId": "2115276711", "name": "S. Park"}, {"authorId": "2110584892", "name": "B. Choi"}, {"authorId": "2628597", "name": "Seung-Hyun Moon"}, {"authorId": "46254373", "name": "Yong-Hyuk Kim"}], "citations": [{"paperId": "804fca839955d922c469cc5899af44c5e4d6bfc7", "title": "Automatic quality control of weather data for timely decisions in agriculture"}, {"paperId": "94010c760c03a624743f8e3e97f07fea203a903e", "title": "Enhancing Rainfall Data Consistency and Completeness: A Spatiotemporal Quality Control Approach and Missing Data Reconstruction Using MICE on Large Precipitation Datasets"}, {"paperId": "d468e3d55237a9e15c656221a99272d6fded3be8", "title": "Meteonetwork: An Open Crowdsourced Weather Data System"}, {"paperId": "d07bcc70fd779be587e659868c3fda6938c898b3", "title": "An Improvement on Estimated Drifter Tracking through Machine Learning and Evolutionary Search"}, {"paperId": "517259f884a6e071c1401d0f62fabb01c2e6b5ab", "title": "Detection of Precipitation and Fog Using Machine Learning on Backscatter Data from Lidar Ceilometer"}]}
