{"paperId": "0663c53cca69d69b10f85e1d832b974eeee0ff47", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Performance Evaluation Analysis of Spark Streaming Backpressure for Data-Intensive Pipelines", "abstract": "A significant rise in the adoption of streaming applications has changed the decision-making processes in the last decade. This movement has led to the emergence of several Big Data technologies for in-memory processing, such as the systems Apache Storm, Spark, Heron, Samza, Flink, and others. Spark Streaming, a widespread open-source implementation, processes data-intensive applications that often require large amounts of memory. However, Spark Unified Memory Manager cannot properly manage sudden or intensive data surges and their related in-memory caching needs, resulting in performance and throughput degradation, high latency, a large number of garbage collection operations, out-of-memory issues, and data loss. This work presents a comprehensive performance evaluation of Spark Streaming backpressure to investigate the hypothesis that it could support data-intensive pipelines under specific pressure requirements. The results reveal that backpressure is suitable only for small and medium pipelines for stateless and stateful applications. Furthermore, it points out the Spark Streaming limitations that lead to in-memory-based issues for data-intensive pipelines and stateful applications. In addition, the work indicates potential solutions.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2296451", "name": "Kassiano J. Matteussi"}, {"authorId": "38274640", "name": "J. Anjos"}, {"authorId": "1693868", "name": "V. Leithardt"}, {"authorId": "145031701", "name": "C. Geyer"}], "citations": [{"paperId": "32bac68666652f2d6e6c9a2f9f006578bcd44340", "title": "Towards a Decentralized Blockchain-Based Resource Monitoring Solution For Distributed Environments"}, {"paperId": "84f34698aea7fba58f6a1b372b45f95cf61f9c21", "title": "Adaptive Scheduling Framework of Streaming Applications based on Resource Demand Prediction with Hybrid Algorithms"}, {"paperId": "b980e627d31ddd6c748ca4a576fd7f5c978dfb44", "title": "PAC: A monitoring framework for performance analysis of compression algorithms in Spark"}, {"paperId": "872329214c517516a8ebf20784b0ef71733004a2", "title": "A Survey on Collaborative Learning for Intelligent Autonomous Systems"}, {"paperId": "f903cc0fc8c6556e6db3743a7204417177886117", "title": "A brief survey on big data: technologies, terminologies and data-intensive applications"}]}
