{"paperId": "06896255bf8e04009d56c6c9829af17a22d8e6c0", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Edge-Enabled Blockchain-Based V2X Scheme for Secure Communication Within the Smart City Development", "abstract": "As the high-mobility nature of the vehicles results in frequent leaving and joining the transportation network, real-time data must be collected and shared in a timely manner. In such a transportation network, malicious vehicles can disrupt services and create serious issues, such as deadlocks and accidents. The blockchain is a technology that ensures traceability, consistency, and security in transportation networks. In this study, we integrated edge computing and blockchain technology to improve the optimal utilization of resources, especially in terms of computing, communication, security, and storage. We propose a novel, edge-integrated, blockchain-based vehicle platoon security scheme. For the vehicle platoon, we developed the security architecture, implemented smart contracts for practical network scenarios in network simulator version 3, and integrated them with the simulation urban mobility traffic control interface API. We exhaustively simulated all the scenarios and analyzed the communication performance metrics, such as throughput, delay, and jitter, and the security performance metrics, such as mean squared error, communication, and computational cost. The performance results demonstrate that the developed scheme can solve security-related issues more effectively and efficiently in smart cities.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "21282-21293", "volume": "10"}, "authors": [{"authorId": "2316824", "name": "Suresh Chavhan"}, {"authorId": "2181495585", "name": "Sachin Kumar"}, {"authorId": "2176417353", "name": "Prayag Tiwari"}, {"authorId": "2275286264", "name": "Xueqin Liang"}, {"authorId": "2274084744", "name": "Ik Hyun Lee"}, {"authorId": "134260245", "name": "K. Muhammad"}], "citations": [{"paperId": "84d5e00d5961b24d48051885fb6a40b937ba145c", "title": "V2X Cooperative Perception for Autonomous Driving: Recent Advances and Challenges"}]}
