{"paperId": "068f98eedf32304b947a2de0e4dcf45a17539e49", "publicationVenue": {"id": "af941ce7-e210-4891-93b2-3d5154cc37e9", "name": "IEEE International WIE Conference on Electrical and Computer Engineering", "type": "conference", "alternate_names": ["WIECON-ECE", "IEEE Int WIE Conf Electr Comput Eng"]}, "title": "Image Processing Based Intelligent Traffic Lighting System", "abstract": "Due to India’s rising automobile population, traffic congestion has become a severe problem. The flow of traffic at road intersections is frequently managed by traffic signal control systems. To govern traffic flow, the majority of traffic signal systems are using pre-time and countdown timers. Because of the system’s fixed-time configuration, traffic jams frequently result from the system’s inability to handle unforeseen significant traffic flows. As a result, adaptive traffic lights that can perform monitoring in the real-time are necessary for adjusting traffic-light signals depending on the density of traffic. The present study has accorded a reconciling traffic signal control system which takes pictures of every lane at a junction and controls the traffic in an efficient way using image processing and image matching techniques. At each junction, the traffic density in the photos is compared. As opposed to other less packed roads, the results demonstrate that the vehicles on the densest road are given more time to pass. The traffic level is decreased by utilizing a camera that is rotated by a servo motor to take pictures of the intersection’s whole length. These pictures are then transferred to the Geany software, where a programme counts the amount of pictures and displays traffic light signals.", "venue": "IEEE International WIE Conference on Electrical and Computer Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-30", "journal": {"name": "2022 IEEE International Women in Engineering (WIE) Conference on Electrical and Computer Engineering (WIECON-ECE)", "pages": "290-293"}, "authors": [{"authorId": "101525739", "name": "V. Biradar"}, {"authorId": "2220365504", "name": "Sarat Chandra Mohanty"}, {"authorId": "2220365293", "name": "Anup Kumar Jana"}, {"authorId": "2220366076", "name": "Bigit Krishna Goswami"}], "citations": []}
