{"paperId": "06bd02f05d64417e3ad60368924386d851375ccc", "publicationVenue": {"id": "76aa128c-91fd-48aa-94ae-89b6fdbc9a0d", "name": "Journal of Public Child Welfare", "type": "journal", "alternate_names": ["J Public Child Welf"], "issn": "1554-8732", "url": "http://www.haworthpress.com/web/JPCW/", "alternate_urls": ["http://www.tandfonline.com/action/journalInformation?journalCode=wpcw20&show=aimsScope", "http://www.tandfonline.com/loi/wpcw20#.Ut0mkeWIVlA"]}, "title": "Information needs of current and prospective foster caregivers: a content analysis of Reddit posts", "abstract": "ABSTRACT Foster caring, for both foster and kinship caregivers, can be a challenging and rewarding endeavor. Both prospective and current foster carers have information needs. This article explores the concerns expressed in an open forum social media site (Reddit) by current and prospective foster caregivers. The study examines posts over a three-month span in 2021 and identifies nine key themes of users. Chi-Square analysis is combined with content analysis to better understand the differing needs of active foster caregivers and those who are considering fostering in the future. Prospective foster caregivers want to know about requirements, guidelines, and basic information before making any commitment to an agency. Current foster care providers frequently seek information about how best to help the child in their care and parenting issues. Suggestions are made relative to potential foster parent training improvements and support that might address some of the themes identified.", "venue": "Journal of Public Child Welfare", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-26", "journal": {"name": "Journal of Public Child Welfare", "pages": "356 - 374", "volume": "17"}, "authors": [{"authorId": "2039818967", "name": "Ethan Engelhardt"}, {"authorId": "48249415", "name": "D. Royse"}], "citations": [{"paperId": "68b43566473b7cee0b96a85bff69f79451dcbe2b", "title": "‘I probably wouldn’t want to talk about anything too personal’: A qualitative exploration of how issues of privacy, confidentiality and surveillance in the home impact on access and engagement with online services and spaces for care-experienced young people"}, {"paperId": "e39cb50e02b929ec661fbb944880590cb2738b07", "title": "for the failure of the system’: A content and thematic analysis of viewer"}, {"paperId": "217ad4be9f933b2a516eafadc15f8ecdeaf56db5", "title": "The Wrongful Conviction Law Review ‘Angry and heartbroken for the failure of the system’ A content and thematic analysis of viewer reactions to When They See Us"}]}
