{"paperId": "06c7c95d52dfd32718161a01acc27d845613e23e", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Chaotic Search-and-Rescue-Optimization-Based Multi-Hop Data Transmission Protocol for Underwater Wireless Sensor Networks", "abstract": "Underwater wireless sensor networks (UWSNs) have applications in several fields, such as disaster management, underwater navigation, and environment monitoring. Since the nodes in UWSNs are restricted to inbuilt batteries, the effective utilization of available energy becomes essential. Clustering and routing approaches can be employed as energy-efficient solutions for UWSNs. However, the cluster-based routing techniques developed for conventional wireless networks cannot be employed for a UWSN because of the low bandwidth, spread stay, underwater current, and error probability. To resolve these issues, this article introduces a novel chaotic search-and-rescue-optimization-based multi-hop data transmission (CSRO-MHDT) protocol for UWSNs. When using the CSRO-MHDT technique, cluster headers (CHs) are selected and clusters are prearranged, rendering a range of features, including remaining energy, intracluster distance, and intercluster detachment. Additionally, the chaotic search and rescue optimization (CSRO) algorithm is discussed, which is created by incorporating chaotic notions into the classic search and rescue optimization (SRO) algorithm. In addition, the CSRO-MHDT approach calculates a fitness function that takes residual energy, distance, and node degree into account, among other factors. A distinctive aspect of the paper is demonstrated by the development of the CSRO algorithm for route optimization, which was developed in-house. To validate the success of the CSRO-MHDT method, a sequence of tests were carried out, and the results showed the CSRO-MHDT method to have a packet delivery ratio (PDR) of 88%, whereas the energy-efficient clustering routing protocol (EECRP), the fuzzy C-means and moth–flame optimization (FCMMFO), the fuzzy scheme and particle swarm optimization (FBCPSO), the energy-efficient grid routing based on 3D cubes (EGRC), and the low-energy adaptive clustering hierarchy based on expected residual energy (LEACH-ERE) methods have reached lesser PDRs of 83%, 81%, 78%, 77%, and 75%, respectively, for 1000 rounds. The CSRO-MHDT technique resulted in higher values of number of packets received (NPR) under all rounds. For instance, with 50 rounds, the CSRO-MHDT technique attained a higher NPR of 3792%.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "40022063", "name": "D. Anuradha"}, {"authorId": "2132721043", "name": "Neelakandan Subramani"}, {"authorId": "116223561", "name": "O. Khalaf"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}, {"authorId": "2098827898", "name": "S. Alghamdi"}, {"authorId": "2161989701", "name": "Manjula Rajagopal"}], "citations": [{"paperId": "dee6de0cb116d455f1ccc831c59a51ece12dbc3b", "title": "A comprehensive survey of localization schemes and routing protocols with fault tolerant mechanism in UWSN- Recent progress and future prospects"}, {"paperId": "50a76e4c19f7818946d06215dc885a8a41213cd6", "title": "Semi-Supervised Clustering-Based DANA Algorithm for Data Gathering and Disease Detection in Healthcare Wireless Sensor Networks (WSN)"}, {"paperId": "fbead2170ce049a9e7c282dbd28ff0245552762c", "title": "A muon high-resolution pseudorange measurement method: Application to muon navigation in confined spaces"}, {"paperId": "36a13d8e5bd21182a0baec06c7a2e8dcf987feb2", "title": "Developing Methodologies for Navigation using Multimedia to help the Visually Impared"}, {"paperId": "c216983abcc6e58a9a97c4ee09e5f8fac1f64c9c", "title": "A QoS-Aware Energy-Efficient Chimp Optimization Routing Protocol with Efficient Sensor Node Deployment Strategy in Underwater Acoustic Sensor Network"}, {"paperId": "3a45d445a6b540cb75bcb5562a3dadcb2328a844", "title": "Spectrum Aware Unequal Clustering with Route Selection Protocol for Energy Efficient Cognitive Radio Wireless Sensor Networks"}, {"paperId": "cee88079961287bd81678e1095ef0c322eb120d0", "title": "Advancements in Neighboring-Based Energy-Efficient Routing Protocol (NBEER) for Underwater Wireless Sensor Networks"}, {"paperId": "1f405d63683cd96fe42790df7e50b47d3223c4d5", "title": "Hybrid Muddy Soil Fish Optimization-Based Energy Aware Routing in IoT-Assisted Wireless Sensor Networks"}, {"paperId": "7f5f8209bcd97e9a832d0ecbcecaaa6fb15f44d9", "title": "Improved African Buffalo Optimization-Based Energy Efficient Clustering Wireless Sensor Networks using Metaheuristic Routing Technique"}, {"paperId": "91382e55e68beb535b55edc8d7e9e9a796b467a4", "title": "Artificial neural networks-based improved Levenberg–Marquardt neural network for energy efficiency and anomaly detection in WSN"}, {"paperId": "09d1281b8ba9d6045587419b36e1ffc570dc8db5", "title": "Design of a Telepresence Robot to Avoid Obstacles in IoT-Enabled Sustainable Healthcare Systems"}, {"paperId": "f2fdcf500a54075eece1ab9571e8ded68b65ebe3", "title": "Deep convolutional neural network with Kalman filter based objected tracking and detection in underwater communications"}, {"paperId": "9239279e7e702e356b2df3b47852b91199646b3a", "title": "Reliable Data Transmission in Underwater Wireless Sensor Networks Using a Cluster-Based Routing Protocol Endorsed by Member Nodes"}, {"paperId": "1895aa21f966f97d481cf235d57513392e06e12c", "title": "Telepresence Robot with DRL Assisted Delay Compensation in IoT-Enabled Sustainable Healthcare Environment"}, {"paperId": "5af862f66a02412ae57de212f24b3fed0c276ed1", "title": "Hybrid Optimization-Based Multi-Path Routing for Dynamic Cluster-Based MANET"}, {"paperId": "f33e4138c4ee6dd391d289e1849a98a456185f50", "title": "Mobility aware load balancing using Kho–Kho optimization algorithm for hybrid Li-Fi and Wi-Fi network"}, {"paperId": "4c197fc5355f6d5ec56acb0b223b30c4fcda16c4", "title": "Multiple Sensor based Human Detection Robots: A Review"}, {"paperId": "bf861fb8bbd5409a5478ff0b42be4dec55ba511e", "title": "Handcrafted Deep-Feature-Based Brain Tumor Detection and Classification Using MRI Images"}, {"paperId": "b3619ec99fbc2e6bbc449e0d6ba52285f7d3a713", "title": "Privacy Preserving Encryption with Optimal Key Generation Technique on Deduplication for Cloud Computing Environment"}, {"paperId": "b5ff5866c2bd76626999009ed4470cbe4e528444", "title": "A New Simple Chaotic System with One Nonlinear Term"}, {"paperId": "3b8be395109a38151da6292e6573ce4970fe10f6", "title": "Intelligent Adaptive Optimisation Method for Enhancement of Information Security in IoT-Enabled Environments"}, {"paperId": "44f3bf762ad214adb35ee694d39c4a10c913e8fa", "title": "An IOT Innovation of Smart Solar Energy Consumption Analysis and Control in Micro Grid"}, {"paperId": "17f3b1efbf73b740f1ef21e1fd63ce4b39ce5e25", "title": "Multicluster Analysis and Design of Hybrid Wireless Sensor Networks Using Solar Energy"}, {"paperId": "1e4b907de056db21a5ed300fced8edbe458d4fa3", "title": "Artificial ecosystem optimization with Deep Learning Enabled Water Quality Prediction and Classification model."}, {"paperId": "bce633cf3df65e064d79f2f94252dccc4fe53fd1", "title": "Artificial intelligence with attention based BiLSTM for energy storage system in hybrid renewable energy sources"}, {"paperId": "8377bebad657398903e6104bf5dbb238e97ac1ff", "title": "Islanding Power Quality Detection using Lighting Search Optimization with Deep Learning Model on Distributed Generation Systems"}, {"paperId": "9808a28b60e77bc60d1e74c9f37af3a2347d2a89", "title": "Capsule Network-Based Deep Transfer Learning Model for Face Recognition"}, {"paperId": "c483b94b282d3d791f95f1499016f2a5241a526e", "title": "Hybridization of long short-term memory with Sparrow Search Optimization model for water quality index prediction."}, {"paperId": "315e288d7fa00b88c49af07f5b48cae0b843ae99", "title": "Energy Efficient Evolutionary Algorithm based Clustering with Route Selection Protocol for IoT Assisted Wireless Sensor Networks"}, {"paperId": "593728eb51c466334b0c8bc0d9d96a6444682bc8", "title": "Improved Metaheuristic-Driven Energy-Aware Cluster-Based Routing Scheme for IoT-Assisted Wireless Sensor Networks"}, {"paperId": "a44c564874bf9e51a9b4aab1ebb31766b1142a87", "title": "Elite Oppositional Farmland Fertility Optimization Based Node Localization Technique for Wireless Networks"}, {"paperId": "86b479296db387c48e7589413b1d259af7eb53c4", "title": "A Novel Deep Learning-Based Cooperative Communication Channel Model for Wireless Underground Sensor Networks"}, {"paperId": "be6517c594903e0edca04379ca4cfae4b3f4c3ac", "title": "A Systematic Survey on Energy-Efficient Techniques in Sustainable Cloud Computing"}, {"paperId": "a750e1f480b4b0fca82ea08963dfbd4a49f140c7", "title": "A Novel Data Aggregation Method for Underwater Wireless Sensor Networks using Ant Colony Optimization Algorithm"}, {"paperId": "adebe39c8691f7cad3ee59d5ebb6da92a2ac670d", "title": "Multi-Tier Sentiment Analysis of Social Media Text Using Supervised Machine Learning"}, {"paperId": "8352ddce5d13f5e47dd83ec30e5471af555299ea", "title": "Fault Coverage-Based Test Case Prioritization and Selection Using African Buffalo Optimization"}]}
