{"paperId": "06c92de0d7fe50ce37835d72811ceb10cfc2c3ac", "publicationVenue": {"id": "d7086d2b-86b6-4371-a442-97da4b3396e3", "name": "International Conference on Security of Information and Networks", "type": "conference", "alternate_names": ["SIN", "Int Conf Secur Inf Netw", "Security of Information and Networks", "Secur Inf Netw"], "url": "http://www.sinconf.org/"}, "title": "Combining spark and snort technologies for detection of network attacks and anomalies: assessment of performance for the big data framework", "abstract": "The paper proposes an approach to security information processing in order to detect computer attacks and network anomalies based on big data technologies. The main contribution of the work is in the development, implementation and investigation of the proposed combined framework for processing security data using parallel computing environment and measuring the performance of the implemented system for detection of network attacks and anomalies. The research goal is to increase the performance of attack detection (under the given requirements for accuracy of solutions) compared to the traditional IDS application. The implemented approach is built using the open source systems Snort and Spark. The paper discusses the capabilities and performance assessment of parallel data processing in order to detect computer attacks and network anomalies, as well as key principles of working with big data. The presented main results of an experimental performance evaluation of the applied approach confirm its high efficiency for analyzing network traffic and security events.", "venue": "International Conference on Security of Information and Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-09-12", "journal": {"name": "Proceedings of the 12th International Conference on Security of Information and Networks"}, "authors": [{"authorId": "16777650", "name": "Igor Kotenko"}, {"authorId": "147680180", "name": "N. Komashinsky"}], "citations": []}
