{"paperId": "06ca4211af16e672981066dba006c8816c446413", "publicationVenue": null, "title": "Spar(k)ql: SPARQL Evaluation Method on Spark GraphX", "abstract": "RDF is a flexible data representation model. Due to its flexibility and simplicity it has become a popular framework, hence the amount of RDF data is increasing fast. Querying massive amount of data is a serious challenge in general and it is true for RDF data as well. In this paper we investigating how to evaluate SPARQL queries on a distributed system. We propose a novel method for evaluating SPARQL queries using the GraphX graph analytical tool. GraphX is built on the top of Spark that is an in-memory data processing system for distributive computation. With this tool we managed to utilize the graph-like structure of the RDF statements which are in form of subject-predicate-object.", "venue": "2016 IEEE 4th International Conference on Future Internet of Things and Cloud Workshops (FiCloudW)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-08-01", "journal": {"name": "2016 IEEE 4th International Conference on Future Internet of Things and Cloud Workshops (FiCloudW)", "pages": "188-193"}, "authors": [{"authorId": "47060188", "name": "G. Gombos"}, {"authorId": "48912110", "name": "G. Rácz"}, {"authorId": "144936562", "name": "A. Kiss"}], "citations": [{"paperId": "4eb966f43278e594be9359bdaf5ed89dd9969e49", "title": "Efficient query evaluation techniques over large amount of distributed linked data"}, {"paperId": "867999fc1aae6717158fad795a8746f621e868db", "title": "RDF Query Answering Using Apache Spark: Review and Assessment"}, {"paperId": "0d82eac05b0ce90b16f66842e315a570b9273113", "title": "Efficient processing of SPARQL queries over GraphFrames"}, {"paperId": "47feb78f053a18b3ced9288d459f92800a4196cf", "title": "P-Spar(k)ql: SPARQL Evaluation Method on Spark GraphX with Parallel Query Plan"}, {"paperId": "e78f1d63c4b98d858b9475a78013c9f031b0a28e", "title": "Szemantikus adatok lekérdezése federált és osztott rendszereken"}]}
