{"paperId": "06cc8f73b95c62ffaa6cc32be20df3a12309c85e", "publicationVenue": {"id": "2baad992-2268-4c38-9120-e453622f2eeb", "name": "Journal of Medical Internet Research", "type": "journal", "alternate_names": ["J Med Internet Res"], "issn": "1438-8871", "url": "http://www.symposion.com/jmir/index.htm", "alternate_urls": ["http://www.jmir.org/", "https://www.jmir.org/"]}, "title": "Data Provenance in Biomedical Research: Scoping Review", "abstract": "Background Data provenance refers to the origin, processing, and movement of data. Reliable and precise knowledge about data provenance has great potential to improve reproducibility as well as quality in biomedical research and, therefore, to foster good scientific practice. However, despite the increasing interest on data provenance technologies in the literature and their implementation in other disciplines, these technologies have not yet been widely adopted in biomedical research. Objective The aim of this scoping review was to provide a structured overview of the body of knowledge on provenance methods in biomedical research by systematizing articles covering data provenance technologies developed for or used in this application area; describing and comparing the functionalities as well as the design of the provenance technologies used; and identifying gaps in the literature, which could provide opportunities for future research on technologies that could receive more widespread adoption. Methods Following a methodological framework for scoping studies and the PRISMA-ScR (Preferred Reporting Items for Systematic Reviews and Meta-Analyses Extension for Scoping Reviews) guidelines, articles were identified by searching the PubMed, IEEE Xplore, and Web of Science databases and subsequently screened for eligibility. We included original articles covering software-based provenance management for scientific research published between 2010 and 2021. A set of data items was defined along the following five axes: publication metadata, application scope, provenance aspects covered, data representation, and functionalities. The data items were extracted from the articles, stored in a charting spreadsheet, and summarized in tables and figures. Results We identified 44 original articles published between 2010 and 2021. We found that the solutions described were heterogeneous along all axes. We also identified relationships among motivations for the use of provenance information, feature sets (capture, storage, retrieval, visualization, and analysis), and implementation details such as the data models and technologies used. The important gap that we identified is that only a few publications address the analysis of provenance data or use established provenance standards, such as PROV. Conclusions The heterogeneity of provenance methods, models, and implementations found in the literature points to the lack of a unified understanding of provenance concepts for biomedical data. Providing a common framework, a biomedical reference, and benchmarking data sets could foster the development of more comprehensive provenance solutions.", "venue": "Journal of Medical Internet Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-03-27", "journal": {"name": "Journal of Medical Internet Research", "volume": "25"}, "authors": [{"authorId": "2000765593", "name": "Marco Johns"}, {"authorId": "2003083798", "name": "Thierry Meurers"}, {"authorId": "2002539446", "name": "F. Wirth"}, {"authorId": "2187283060", "name": "A. C. Haber"}, {"authorId": "2113784977", "name": "Armin Müller"}, {"authorId": "2213067014", "name": "Mehmed Halilovic"}, {"authorId": "2179744", "name": "F. Balzer"}, {"authorId": "3351408", "name": "F. Prasser"}], "citations": [{"paperId": "f88aa5e268107b74eae065c4e8cc8787603b165c", "title": "Ethische Aspekte von Blockchain-Technologien in der biomedizinischen Forschung"}]}
