{"paperId": "06ccc07062f3ac22b85b81923df5dd4d3dc99692", "publicationVenue": {"id": "61b6d6d2-025c-4257-83a0-9a2f068c583d", "name": "Journal of Enterprise Information Management", "type": "journal", "alternate_names": ["J Enterp Inf Manag"], "issn": "1741-0398", "url": "https://www.emerald.com/insight/publication/issn/1741-0398"}, "title": "Consequential factors of Big Data's Analytics Capability: how firms use data in the competitive scenario", "abstract": "PurposeThe article's objective is to analyze the consequent factors of Big Data Analytics Capability for firms in the competitive scenario, using different analytical models.Design/methodology/approachThe research had a quantitative approach, using a survey of data from firms located in the state of São Paulo – Brazil. Structural Equation Modeling (SEM) was used to validate the model.FindingsThe results reveal that all hypotheses were accepted. Business value was the construct that had the most explanatory power in the model. It is necessary to invest more in analytical tools, as well as people trained in the analysis of these models, in addition to a change of mindset, which will dictate the bias of the firm's strategic decision-making. The Big Data analysis is evident from firms' growing investments, particularly those that operate in complex and fast-paced environments.Practical implicationsThe proposed theoretical model makes it possible to verify firms' analytical structure and whether they are better positioned to analyze customer data and information in real-time, generate insights and implement solutions to maintain and improve their market position.Originality/valueThe contribution of this article is to present a proposal to expand the research models in the literature that analyzed the direct and indirect relationship between “Big Data Analytics Capability” and “Product Innovation Performance”.", "venue": "Journal of Enterprise Information Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-08-03", "journal": {"name": "J. Enterp. Inf. Manag.", "pages": "1406-1428", "volume": "34"}, "authors": [{"authorId": "134561676", "name": "L. Pinochet"}, {"authorId": "2132609199", "name": "Guilherme de Camargo Belli Amorim"}, {"authorId": "23614896", "name": "Durval Lucas Júnior"}, {"authorId": "1953363348", "name": "C. Souza"}], "citations": [{"paperId": "e967b457818374c239466f6d1e0800ad136dbb95", "title": "Impact of information system flexibility and dynamic capabilities in building net zero supply chains"}, {"paperId": "8d3e31e7dfa324e7ccc53b3ec47e651a89003bff", "title": "THE NEXUS OF BIG DATA ANALYTICS, KNOWLEDGE SHARING, AND PRODUCT INNOVATION IN MANUFACTURING"}, {"paperId": "b779c555c82561d68f92b67056b4eb7e18c0e037", "title": "Digital Culture, Knowledge, and Commitment to Digital Transformation and Its Impact on the Competitiveness of Portuguese Organizations"}, {"paperId": "97b45640a7c007689af0ebfc68b0286be7f58344", "title": "Big data analytics capabilities: Patchwork or progress? A systematic review of the status quo and implications for future research"}, {"paperId": "22015da11539adbd178ed246089a0d98804f3d38", "title": "Strategische Planung in der Automobilindustrie in Zeiten von Produkt-Service-Systemen: Veränderungen, Planungsansätze und Herangehensweisen"}, {"paperId": "6ac6bcd4645a8b36b0c70d343cd61ee5a91ca4d3", "title": "The role of big data analytics and organizational agility in improving organizational performance of business processing organizations"}, {"paperId": "b45324907638dcb56c0a7dcc688f19fa8310ea5a", "title": "FAKTOR TEKNOLOGI TERHADAP ADOPSI BIG DATA PADA ERA TRANSFORMASI DIGITAL"}, {"paperId": "9dddc3fb60d048b42e76ed1e8ce711097688c515", "title": "One decade of big data for firms' competitiveness: insights and a conceptual model from bibliometrics"}, {"paperId": "fbc1f76fd23c466d827e04919cca6b69b0274fc4", "title": "Impact of big data technological and personal capabilities on sustainable performance on Jordanian manufacturing companies: the mediating role of innovation"}, {"paperId": "0ea51e611b89c22505a1f2dec5f522cf5140ba01", "title": "Unveiling the effects of big data analytics capability on innovation capability through absorptive capacity: why more and better insights matter"}, {"paperId": "c1ef97c48542c88244a897a517aa6cae3a09fa1d", "title": "The trickle-down effect of big data use to predict organization innovation: the roles of business strategy alignment and information sharing"}, {"paperId": "9bc0cd94f32ead96e1cb0978e8186708aba1be1e", "title": "Digital Transformation Strategies Enabled by Internet of Things and Big Data Analytics: The Use-Case of Telecommunication Companies in Greece"}, {"paperId": "1d9f2710caacd78184b6df7050c009d21eef6822", "title": "Guest Editorial"}, {"paperId": "92a6fe49db20198f0a1844304275ca2df4c1a579", "title": "DIGITAL TRANSFORMATION: CONSTRUCT DEFINITION CHALLENGES AND SCENARIOS FOR A RESEARCH AGENDA"}]}
