{"paperId": "06e552363851434aa343f6c581dafad6c9744a2d", "publicationVenue": {"id": "52bd1f2f-5bb2-4bae-8674-c503b506c30e", "name": "Molecular biology and evolution", "type": "journal", "alternate_names": ["Mol biology evol", "Mol Biology Evol", "Molecular Biology and Evolution"], "issn": "0737-4038", "url": "http://mbe.oxfordjournals.org/"}, "title": "Accurate Identification of Subclones in Tumor Genomes", "abstract": "Abstract Understanding intratumor heterogeneity is critical for studying tumorigenesis and designing personalized treatments. To decompose the mixed cell population in a tumor, subclones are inferred computationally based on variant allele frequency (VAF) from bulk sequencing data. In this study, we showed that sequencing depth, mean VAF, and variance of VAF of a subclone are confounded. Without considering this effect, current methods require deep-sequencing data (>300× depth) to reliably infer subclones. Here, we present a novel algorithm that incorporates depth-variance and mean-variance dependencies in a clustering error model and successfully identifies subclones in tumors sequenced at depths of as low as 30×. We implemented the algorithm as a model-based adaptive grouping of subclones (MAGOS) method. Analyses of computer simulated data and empirical sequencing data showed that MAGOS outperformed existing methods on minimum sequencing depth, decomposition accuracy, and computation efficiency. The most prominent improvements were observed in analyzing tumors sequenced at depths between 30× and 200×, whereas the performance was comparable between MAGOS and existing methods on deeply sequenced tumors. MAGOS supports analysis of single-nucleotide variants and copy number variants from a single sample or multiple samples of a tumor. We applied MAGOS to whole-exome data of late-stage liver cancers and discovered that high subclone count in a tumor was a significant risk factor of poor prognosis. Lastly, our analysis suggested that sequencing multiple samples of the same tumor at standard depth is more cost-effective and robust for subclone characterization than deep sequencing a single sample. MAGOS is available at github (https://github.com/liliulab/magos).", "venue": "Molecular biology and evolution", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-24", "journal": {"name": "Molecular Biology and Evolution", "volume": "39"}, "authors": [{"authorId": "1392527876", "name": "Navid Ahmadinejad"}, {"authorId": "1441969647", "name": "Shayna Troftgruben"}, {"authorId": "2145295482", "name": "Junwen Wang"}, {"authorId": "9546000", "name": "P. Chandrashekar"}, {"authorId": "2550407", "name": "Valentin Dinu"}, {"authorId": "14218625", "name": "C. Maley"}, {"authorId": "2150977936", "name": "Li Liu"}], "citations": [{"paperId": "bf6aa4f9d179e15dedd76534b688ef0515f5c9e6", "title": "Scientific figures interpreted by ChatGPT: strengths in plot recognition and limits in color perception"}, {"paperId": "5efcc802a5f611c6b901c5880553b0053d976604", "title": "Concordance between whole exome sequencing of circulating tumor DNA and tumor tissue"}, {"paperId": "4e44b1fde2f7ad83db9595a17e54810aaca0c8f4", "title": "Bioinformatics Illustrations Decoded by ChatGPT: The Good, The Bad, and The Ugly"}, {"paperId": "e689e72b7ead00fa9600393a342c2bfebc48b918", "title": "A Mouse-Specific Model to Detect Genes under Selection in Tumors"}, {"paperId": "0dc6abb8793fcc4cbd41c3111ec607ac91e7d6b2", "title": "A data-fusion approach to identifying developmental dyslexia from multi-omics datasets"}, {"paperId": "352e938ca58a3152ebcdf033ab97ae8d19e22e23", "title": "Reconstructing mutational lineages in breast cancer by multi-patient-targeted single-cell DNA sequencing"}]}
