{"paperId": "06e553d736eacd53c82580f5c12b4280e4c830c5", "publicationVenue": {"id": "d310aaaf-0799-4cd4-a4f5-b3105189192e", "name": "Journal of Global Operations and Strategic Sourcing", "type": "journal", "alternate_names": ["J Glob Oper Strateg Sourc"], "issn": "2398-5364", "url": "http://emeraldgrouppublishing.com/products/journals/journals.htm?id=jgoss"}, "title": "Digital transformation in ecosystems: integrated operations model and its application to fifth-party logistics operators", "abstract": "\nPurpose\nThe logistics industry has undergone a tremendous transformation. This transformation is necessary to cope with the fundamental changes in customer expectations and the need for digitalization imposed by the pandemic, changes in the socioeconomic world, and innovative technology solutions. This paper aims to present digital transformation as an integrated framework for transforming the operating model and applying advanced solutions to the ecosystem of a quintile logistics (5PL) company. 5PL operators are typically an ecosystem. Loosely coupled or self-organized entities that collaborate in a symbiotic relationship represent this ecosystem. They aim to jointly develop capabilities, create innovative services or solutions, share knowledge, facilitate transactions, and leverage network synergies in a logistics environment to provide optimized or novel customer- or partner-centric solutions (Lamberjohann and Otto, 2020).\n\n\nDesign/methodology/approach\nCurrently, there is no single definition of an integrated logistics operations model in 5PL practice, so the qualitative method used in this paper allows for investigation from an exploratory perspective. The paper follows a qualitative research methodology, collecting and analyzing data/facts through interviews and visits to subject matter experts, industry practitioners, and academic researchers, combined with an extensive review of academic publications, industry reports, and written and media content from established organizations in the marketplace. This paper follows a qualitative research methodology, as it is an inquiry rather than a statistical study. The qualitative method allows the study of the concepts of phenomena and definitions, their characteristics, and the defining features that serve as the basis (Berg, 2007). It emphasizes generalized interpretation and deeper understanding of concepts, which would be more difficult in quantitative, statistically based research. Fact-finding was conducted in two ways: in-depth interviews with experts from academia, information and communication technology organizations, and key players in the logistics industry; and academic publications, industry reports, and written and media content from established national and international organizations in the market.\n\n\nFindings\nThe operations model introduced considers six aspects: persons, processes, platforms, partners, protection and preservation. A virtual team approach can support the personal side of the 5PL ecosystem’s digital transformation. Managing a 5PL ecosystem should be based on collaborative planning, forecasting, and replenishment methods (Parsa et al., 2020). A digital platform can support trust among the stakeholders in the ecosystem. A blockchain solution can powerfully support the 5PL ecosystem from partner relationships’ points of view. The implementation of a cybersecurity reference model is important for protection (Bandari, 2023). Reverse logistics and an integrated approach support the preservation of the ecosystem.\n\n\nResearch limitations/implications\nWhile the author has experience applying the different components of the operations model presented, it would be interesting to find a 5PL that would use all the components presented in an integrated way. The operations model presented applies to any similar ecosystem with minor adaptations.\n\n\nPractical implications\nThis paper addresses operations models and digital transformation challenges for optimizing 5PL operators. It provides several opportunities and considerations for 5PL operators interested in improving their management and operations to cope with the growing challenges of today’s world.\n\n\nSocial implications\nThe competitiveness and long-term performance of 5PL operators depend on selecting and carefully implementing their operations models. This paper emphasizes the importance of using advanced operations models.\n\n\nOriginality/value\nThe operations model derives from the author’s personal experiences in research and the innovative application of these models to logistics operators (DHL, UPS, Poste Italiane and others). This paper brings together academic and industry perspectives and operations models in an integrated business digital transformation. This paper defines an original optimal operations model for a 5PL operator and can add sustainable value to organizations and society. In doing so, it outlines different solution requirements, the critical success factors and the challenges for solutions and brings logistical performance objectives when implementing a digital business transformation.\n", "venue": "Journal of Global Operations and Strategic Sourcing", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-26", "journal": {"name": "Journal of Global Operations and Strategic Sourcing"}, "authors": [{"authorId": "2267663641", "name": "Bernardo Nicoletti"}, {"authorId": "2267658524", "name": "Andrea Appolloni"}], "citations": []}
