{"paperId": "06f5002613c8e3fb8da8d0d15316a3323b1d1d30", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on Crowdsourcing Applications in Smart Cities", "abstract": "With the emergence of the Internet of things (IoT), human life is now progressing towards smartification faster than ever before. Thus, smart cities become automated in different aspects such as business, education, economy, medicine, and urban areas. Since smartification requires a variety of dynamic information in different urban dimensions, mobile crowdsourcing has gained importance in smart cities. This chapter systematically reviews the related applications of smart cities that use mobile crowdsourcing for data acquisition. For this purpose, the applications are classified as environmental, urban life, and transportation categories and then investigated in detail. This survey helps in understanding the current situation of smart cities from the viewpoint of crowdsourcing and discusses the future research directions in this field.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-07", "journal": {"name": "ArXiv", "volume": "abs/2204.05421"}, "authors": [{"authorId": "1404584581", "name": "H. Vahdat-Nejad"}, {"authorId": "2119299061", "name": "Tahereh Tamadon"}, {"authorId": "3364059", "name": "F. Salmani"}, {"authorId": "2119295780", "name": "Zeynab Kiani Zadegan"}, {"authorId": "2132299572", "name": "Sajedeh Abbasi"}, {"authorId": "8563599", "name": "Fatemeh Seyyedi"}], "citations": [{"paperId": "bd653800ccdfd39412a100f8576ed2c76b0f1ddd", "title": "Optimising postgraduate supervision using multilevel modeling techniques in a constrained higher education environment"}, {"paperId": "056ea5fad17101b82fd3b05239b49ce69d40d703", "title": "Influence before Hiring: A Two-tired Incentive Compatible Mechanism for IoT-based Crowdsourcing in Strategic Setting"}]}
