{"paperId": "06f8feb66aa0e7f6b17d5a167d089952280decfb", "publicationVenue": null, "title": "The Computational Thematic Analysis Toolkit", "abstract": "As online communities have grown, Computational Social Science has rapidly developed new techniques to study them. However, these techniques require researchers to become experts in a wide variety of tools in addition to qualitative and computational research methods. Studying online communities also requires researchers to constantly navigate highly contextual ethical and transparency considerations when engaging with data, such as respecting their members' privacy when discussing sensitive or stigmatized topics. To overcome these challenges, we developed the Computational Thematic Analysis Toolkit, a modular software package that supports analysis of online communities by combining aspects of reflexive thematic analysis with computational techniques. Our toolkit demonstrates how common analysis tasks like data collection, cleaning and filtering, modelling and sampling, and coding can be implemented within a single visual interface, and how that interface can encourage researchers to manage ethical and transparency considerations throughout their research process.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-14", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 15", "volume": "6"}, "authors": [{"authorId": "47199688", "name": "R. P. Gauthier"}, {"authorId": "144158717", "name": "James R. Wallace"}], "citations": [{"paperId": "d6e7ae833fcda793f8d280599ec606bd6bc032a3", "title": "Artificial intelligence in future nursing care: Exploring perspectives of nursing professionals - A descriptive qualitative study"}, {"paperId": "3a740d17dc662e70be0ca0e24758ee9802c1d34d", "title": "Performing an Inductive Thematic Analysis of Semi-Structured Interviews With a Large Language Model: An Exploration and Provocation on the Limits of the Approach"}, {"paperId": "35e9ad9b1abf187ba45101786200a5d6ac043661", "title": "QualiGPT: GPT as an easy-to-use tool for qualitative coding"}, {"paperId": "c9e6adec57d30e1cf666eec63feb1cd0c49003de", "title": "Can Large Language Models emulate an inductive Thematic Analysis of semi-structured interviews? An exploration and provocation on the limits of the approach and the model"}, {"paperId": "3611674ccd820efc0b59981038bc4161d46b3add", "title": "A Systematic Literature Review of the Use of Computational Text Analysis Methods in Intimate Partner Violence Research"}, {"paperId": "b2d2f3ffdc0fa89717b92685b33a691e2e875a36", "title": "A Tumblr thematic analysis of perinatal health: Where users go to seek support"}, {"paperId": "2f55368eb4d48c88c80397f0dc5f63c7ed4013eb", "title": "Agency and Amplification"}, {"paperId": "c8e546afe6f7724a66d1429de6831cab32b65c86", "title": "Scholastic: Graphical Human-AI Collaboration for Inductive and Interpretive Text Analysis"}, {"paperId": "191e3c2ce3da3277f51213b5137c974e46bd64b2", "title": "“I Will Not Drink With You Today”: A Topic-Guided Thematic Analysis of Addiction Recovery on Reddit"}]}
