{"paperId": "07009ba9de4080e268f262110afe22943410164c", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Skynet: Performance-driven Resource Management for Dynamic Workloads", "abstract": "A primary concern for cloud operators is to increase resource utilization while maintaining good performance for applications. This is particularly difficult to achieve for three reasons: users tend to overprovision applications, applications are diverse and dynamic, and their performance depends on multiple resources. In this paper, we present Skynet, an automated and adaptive cloud resource management approach that addresses all three concerns. Skynet uses performance level objectives (PLOs) to capture user intentions about required performance more accurately to remove the user from the resource allocation loop. Then, Skynet estimates the resources required to achieve the target PLO. For this purpose, we employ a Proportional Integral Derivative (PID) controller per application and adjust its parameters on the fly. Finally, to capture the dependence of applications on different or multiple resources, Skynet extends the traditional one-dimensional PID controller to estimate CPU, memory, I/O throughput, and network throughput. Essentially, Skynet builds a model on-the-fly to map target PLOs to resources for each application, taking into account multiple resources and changing input load. We implement Skynet as an end-to-end, custom scheduler in Kubernetes and evaluate it using real workloads on both a private cluster and AWS. Skynet decreases PLO violations by more than 7.4x and increases resource utilization by more than 2x, compared to Kubernetes. Essentially, Skynet builds a model on-the-fly to map target PLOs to resources for each application, taking into account multiple resources and changing input load. We implement Skynet as an end-to-end, custom scheduler in Kubernetes and evaluate it using real workloads on both a private cluster and AWS. Skynet decreases PLO violations by more than 7.4x and increases resource utilization by more than 2x, compared to Kubernetes.", "venue": "IEEE International Conference on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 IEEE 14th International Conference on Cloud Computing (CLOUD)", "pages": "527-539"}, "authors": [{"authorId": "2801573", "name": "Yannis Sfakianakis"}, {"authorId": "3135878", "name": "M. Marazakis"}, {"authorId": "1805177", "name": "A. Bilas"}], "citations": [{"paperId": "dd37714491c3b778f1cbe83dda2c88ca4b9b0104", "title": "vPALs: Towards Verified Performance-aware Learning System For Resource Management"}, {"paperId": "bed56faff000a8604130e45196b19c0facf26bee", "title": "Sonnet: A control-theoretic approach for resource allocation in cluster management"}, {"paperId": "754581f1394432e0bfd19fd2432bffaf47ff0d1a", "title": "Stratus: A Hardware/Software Infrastructure for Controlled Cloud Research"}, {"paperId": "382f1449f6ee69f5d33df7fbbc8de055656b62da", "title": "Adrias: Interference-Aware Memory Orchestration for Disaggregated Cloud Infrastructures"}, {"paperId": "22d24cf93681e769a5a6a6e9af536df5df1f812e", "title": "Automated Configuration for Agile Software Environments"}, {"paperId": "d11e5c5c08af88ee8abb9ebaa166b1d6fd198501", "title": "Kubernetes Scheduling: Taxonomy, Ongoing Issues and Challenges"}]}
