{"paperId": "070177f8b5128ad17676aa15be257220e8e6f716", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Characterizing IoT Data and its Quality for Use", "abstract": "The Internet of Things (IoT) is a cyber physical social system that encompasses science, enterprise and societal domains. Data is the most important commodity in IoT, enabling the \"smarts\" through analytics and decision making. IoT environments can generate and consume vast amounts of data. But managing this data effectively and gaining meaningful insights from it requires us to understand its characteristics. Traditional scientific, enterprise and big data management approaches may not be adequate, and have to evolve. Further, these characteristics and the physical deployment environments also impact the quality of the data for use. In this paper, we offer a taxonomy of IoT data characteristics, along with data quality considerations, that are constructed from the ground-up based on the diverse IoT domains and applications we review. We emphasize on the essential features, rather than a vast array of attributes. We also indicate factors that influence the data quality. Such a review is of value to IoT managers, data handlers and application composers in managing and making meaningful use of data, and for big data platform developers to offer meaningful solutions to address these considerations.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-06-23", "journal": {"name": "ArXiv", "volume": "abs/1906.10497"}, "authors": [{"authorId": "71793320", "name": "Nashez Zubair"}, {"authorId": "120877425", "name": "A. Niranjan"}, {"authorId": "145295954", "name": "K. Hebbar"}, {"authorId": "1761220", "name": "Yogesh L. Simmhan"}], "citations": [{"paperId": "f5d3cea83f56d156c0a27009ce4be8dd839e5fae", "title": "A systematic literature review on data quality assessment"}, {"paperId": "5087196157f8303e76392cff229e1b9edacc7b33", "title": "AVOC: history-aware data fusion for reliable IoT analytics"}, {"paperId": "78dcae7bf4763c9667b92649234e7b6d6367b5e6", "title": "Technological Barriers of (non)Blockchain Enabled IoT Data Marketplaces"}, {"paperId": "506e039b8eded4870732a516e2cbf9bcbd77d8fc", "title": "Demystifying MLOps and Presenting a Recipe for the Selection of Open-Source Tools"}, {"paperId": "15eb82e5b934667bbd763d756034e1ab451d41b0", "title": "AIOT-Arch: Furthering Artificial Intelligence in Big Data IoT Applications"}, {"paperId": "937c27c52f5b8bf9e9f4402130bcc7555c0b6741", "title": "IoT Data Quality Issues and Potential Solutions: A Literature Review"}, {"paperId": "5b14c8501b0e624539b074395b852a2f019c0099", "title": "Developing House of Information Quality framework for IoT systems"}]}
