{"paperId": "0711ddc8ee9cd33b54beabd398d1958a186ee2b4", "publicationVenue": null, "title": "Spectral Analysis of Lungs sounds for Classification of Asthma and Pneumonia Wheezing", "abstract": "World Health Organization Statistics declares the pulmonic illness as the class of deadly illness. Wheezing is a key indicator for the diagnosis of pulmonic illnesses like Asthma and pneumonia. In this research article, the identification of wheeze sound in asthma and pneumonia subjects is done from breathing sound. The analysis is performed through signal processing and machine learning practices. Overall, data is acquired from 300 subjects. It includes 100 Asthma, 100 Pneumonia, and 100 Normal subjects This research work proposes a complete design for accurate classification of wheezing signals. It includes pre-processing by normalization, denoising by filtration, segmentation to remove the non-breathing and silent parts, feature extraction from the spectral domain, and classification by support vector machine (SVM) using Matlab 2019b. The system evidenced an accuracy greater than 96%. Further investigation can be done by analyzing the wheezing sound originates in other pulmonic diseases and exploring its role to identify the pulmonary illness.", "venue": "2020 International Conference on Electrical, Communication, and Computer Engineering (ICECCE)", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2020-06-01", "journal": {"name": "2020 International Conference on Electrical, Communication, and Computer Engineering (ICECCE)", "pages": "1-6"}, "authors": [{"authorId": "31774318", "name": "Syed Zohaib Hassan Naqvi"}, {"authorId": "1921999661", "name": "Misha Arooj"}, {"authorId": "27005482", "name": "Sumair Aziz"}, {"authorId": "120685296", "name": "Muhammad Umar Khan"}, {"authorId": "1921999908", "name": "Mohammad Ahmad Choudhary"}, {"authorId": "1923693981", "name": "Muhammad Nafees. ul. Hassan"}], "citations": [{"paperId": "c3fcf3f0c59444e499a6adb7b9017ce2d83f8bdd", "title": "Lung disease recognition methods using audio-based analysis with machine learning"}, {"paperId": "1fa7894179fb4b3c6070909b3d33d8438bd4aadc", "title": "Classification of Asthma, COPD and Healthy Lung Sounds Using Fourier Bessel Series Expansion in Machine Learning and Deep Learning Paradigm"}, {"paperId": "dfa61987d712a55dd5ba1f9e8f2225403efbaab7", "title": "Explainable attention ResNet18-based model for asthma detection using stethoscope lung sounds"}, {"paperId": "1a56a0bd9204a3d9750a82b4f8ce950853227d0a", "title": "Respiratory Disease Classification Model Based on Feature Fusion"}, {"paperId": "d379787c1eaabfedcff6b229b140f61201ca3d2f", "title": "A review on lung disease recognition by acoustic signal analysis with deep learning networks"}, {"paperId": "b883fbb90c3f8a2dc9e4c028d02a8abb69c2a1d8", "title": "Acoustic-Based Deep Learning Architectures for Lung Disease Diagnosis: A Comprehensive Overview"}, {"paperId": "f3ddb40d693757347037ebeb3b2647c31d600dc9", "title": "Classification of Cardiovascular Disease Using 2D-Image Representations of Phonocardiogram Signals"}, {"paperId": "8c1fa909f2919de89a0ef0d7f7eb5cb370b8b1b6", "title": "Fall Detection, Wearable Sensors & Artificial Intelligence: A Short Review"}, {"paperId": "b9a2b5e62a92c0f4ee42e4c1451d3faf2f0f6f66", "title": "Deep Learning-based Decision Support System for classification of COVID-19 and Pneumonia patients"}, {"paperId": "7b5ff2554e2d57d39c12039248644877a66ae1d7", "title": "Comparative Performance Analysis of Kernel Functions in Support Vector Machines in the Diagnosis of Pneumonia using Lung Sounds"}, {"paperId": "4e5370697f97720d69f736748e35684f91aff309", "title": "Classification of Phonocardiography based Heart Auscultations while Listening to Tilawat-e-Quran and Music Using Vibrational Mode Decomposition"}, {"paperId": "8373e4fc6821573b351f851e81c58839aa3c43b8", "title": "Supervised Machine Learning based Fast Hand Gesture Recognition and Classification Using Electromyography (EMG) Signals"}]}
