{"paperId": "071abd57c997fa746de3fa3620f0d00d861ba3f5", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "Minimizing Intra-Interference in LoRaWAN for Seamless Connectivity in Ubiquitous Networking", "abstract": "Ubiquitous networking is rapidly gaining predominance in various domains from predictive maintenance to corrective updates, enabling seamless connectivity for a wide range of devices and applications. Long Range Wide Area Network (LoRaWAN) provides a low power and long range of connectivity, which accelerates the growth of ubiquitous networking. However, with this growth, the number of devices and deployments rises, consequently increasing the likelihood of communication channel interference. Prior studies have mostly emphasized the criticality of inter-interference, while intra-interference is less explored. Moreover, in the case of ubiquitous and sensor networks handling intra-interference is crucial, as it can degrade the quality of service and disrupt connectivity within the constrained infrastructure. This paper proposes a novel approach to minimize intra-interference in LoRaWANnetworks to enable seamless connectivity despite limited resources in ubiquitous networking. The approach leverages the concept of collision avoidance techniques in the hashing table to optimize the communication channel allocation for reducing collisions caused due to intra-interference. The approach employs the division-based method for generating hash codes and tackles collision using a chaining scheme. We present a detailed experimental evaluation with real-world prototype deployment to analyze the impact of intra-interference and demonstrate the effectiveness of our approach.", "venue": "International Conference on Communication Systems and Networks", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-03", "journal": {"name": "2024 16th International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "123-128"}, "authors": [{"authorId": "2284356387", "name": "Rahul Mishra"}, {"authorId": "2284385030", "name": "Sameer Godhaneeya"}, {"authorId": "2284386605", "name": "Aishwarya Soni"}], "citations": []}
