{"paperId": "072003a8a6c6044f3bc2f75bbc736b3a7fc22d0b", "publicationVenue": null, "title": "Am I Me or You? State-of-the-Art Dialogue Models Cannot Maintain an Identity", "abstract": "State-of-the-art dialogue models still often stumble with regards to factual accuracy and self-contradiction. Anecdotally, they have been observed to fail to maintain character identity throughout discourse; and more specifically, may take on the role of their interlocutor. In this work we formalize and quantify this deficiency, and show experimentally through human evaluations that this is indeed a problem. In contrast, we show that discriminative models trained specifically to recognize who is speaking can perform well; and further, these can be used as automated metrics. Finally, we evaluate a wide variety of mitigation methods, including changes to model architecture, training protocol, and decoding strategy. Our best models reduce mistaken identity issues by nearly 65% according to human annotators, while simultaneously improving engagingness. Despite these results, we find that maintaining character identity still remains a challenging problem.", "venue": "NAACL-HLT", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-10", "journal": {"pages": "2367-2387"}, "authors": [{"authorId": "35752280", "name": "Kurt Shuster"}, {"authorId": "39219656", "name": "Jack Urbanek"}, {"authorId": "3149531", "name": "Arthur Szlam"}, {"authorId": "145183709", "name": "J. Weston"}], "citations": [{"paperId": "bfc2aee63d20fb19c9a851da9e97fec40c454124", "title": "Is this the real life? Is this just fantasy? The Misleading Success of Simulating Social Interactions With LLMs"}, {"paperId": "1beaf69026af98e7ad7a028b4ed8aebb06302d6e", "title": "Instruct Once, Chat Consistently in Multiple Rounds: An Efficient Tuning Framework for Dialogue"}, {"paperId": "a802e429e026f1d5b3f17c8c4bb29be57e24add5", "title": "Inconsistent dialogue responses and how to recover from them"}, {"paperId": "acbb95b757c5cea33380a850e820b61ea2857f1d", "title": "Using Natural Language Inference to Improve Persona Extraction from Dialogue in a New Domain"}, {"paperId": "a76630ed22310b123183e32b7d56b69d5c449d58", "title": "RoleEval: A Bilingual Role Evaluation Benchmark for Large Language Models"}, {"paperId": "6cdc91a8a6eaf655e0a228f3fb075d91de3a703e", "title": "Leveraging Large Language Models for Automated Dialogue Analysis"}, {"paperId": "49ae59b1375cde60c1da89aee7bad569c4683e23", "title": "The HCI Aspects of Public Deployment of Research Chatbots: A User Study, Design Recommendations, and Open Challenges"}, {"paperId": "672491163a327f80e08ce3ef4751e94c78631822", "title": "Revisiting the Architectures like Pointer Networks to Efficiently Improve the Next Word Distribution, Summarization Factuality, and Beyond"}, {"paperId": "417df88083ece44fc6641478543a834063a75d13", "title": "Talking with Machines: A Comprehensive Survey of Emergent Dialogue Systems"}, {"paperId": "82beb8a86d438e85a134182128d47607b1b04004", "title": "Multi-Party Chat: Conversational Agents in Group Settings with Humans and Models"}, {"paperId": "22c872c4e2761089cbb7688f258e00c4e6c7a39a", "title": "When Crowd Meets Persona: Creating a Large-Scale Open-Domain Persona Dialogue Corpus"}, {"paperId": "795736777f08e92a80c95dab7f205d1d7c28a10b", "title": "The CRINGE Loss: Learning what language not to model"}, {"paperId": "10be7057efd37643a6aaf277ba4bfd8ab2a35775", "title": "Controllable Factuality in Document-Grounded Dialog Systems Using a Noisy Channel Model"}, {"paperId": "8345d757e9127eff382d5285fef99312eaf283cd", "title": "WikiWhy: Answering and Explaining Cause-and-Effect Questions"}, {"paperId": "577682d6df0da548dfb58d93dfd623b973bdf34a", "title": "CDConv: A Benchmark for Contradiction Detection in Chinese Conversations"}, {"paperId": "609fd0ffd05e6730287fcc603267c4cabcbe3e5a", "title": "Learning New Skills after Deployment: Improving open-domain internet-driven dialogue with human feedback"}, {"paperId": "017cfe49fce1cb77bda2e1791f7203f5ebac0ac7", "title": "Director: Generator-Classifiers For Supervised Language Modeling"}, {"paperId": "a8e510680ecbf5ad1fa32a486b3135f9886a6c2f", "title": "Building a Role Specified Open-Domain Dialogue System Leveraging Large-Scale Language Models"}, {"paperId": "7576ac724204ad9f11970044fe2d12657340476f", "title": "On the Compositional Generalization in Versatile Open-domain Dialogue"}, {"paperId": "5252ed78cc59700c905a13dafafeaf713d2e5af8", "title": "On the Underspecification of Situations in Open-domain Conversational Datasets"}, {"paperId": "5816531489f2692c564f9a9bb546abe9e2a469a7", "title": "Investigating person-specific errors in chat-oriented dialogue systems"}, {"paperId": "63583423eb12e37170fc9d87e36563fae076aabf", "title": "What Was Your Name Again? Interrogating Generative Conversational Models For Factual Consistency Evaluation"}]}
