{"paperId": "07213c8a42ea85be3b04766e37141478b8436dce", "publicationVenue": {"id": "0e6e8f0a-455b-4be7-9d4c-5d6f93bd25a8", "name": "IEEE International Conference on Engineering of Complex Computer Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Eng Complex Comput Syst", "International Conference on Engineering of Complex Computer Systems", "Int Conf Eng Complex Comput Syst", "ICECCS"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000271/all-proceedings"}, "title": "Design Concerns for Industrial Big Data System in the Smart Factory Domain: From Product Lifecycle View", "abstract": "The smart factory is characterized by the high value of industrial big data, the applications of IoT(Internet of Things) technologies and cloud computing technologies. Developing an industrial big data system is a comprehensive challenge job as it involves both software and hardware. Big data are pervasive in all the lifecycle of the industrial product. Thus, developing an industrial big data system is different from that of the traditional business process system. We noticed there is not much emphasis on the design concerns for industrial big data system from the product lifecycle view in the smart factory domain. In this paper, the challenges that industrial big data systems meet in the smart factory domain are discussed. The domain requirements are analyzed. The design concerns for industrial big data-based system are abstracted from the product lifecycle view. The design concerns are focused on the requirements from the acquirers, system builders, and other stakeholders of smart factory. Furthermore, we demonstrate the instantiation to define solutions about smart fault diagnosis for complex equipment based on big operation data including the architecture design, data management, data analysis, and services provider.", "venue": "IEEE International Conference on Engineering of Complex Computer Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 23rd International Conference on Engineering of Complex Computer Systems (ICECCS)", "pages": "217-220"}, "authors": [{"authorId": "145838238", "name": "H Zhao"}, {"authorId": "48798302", "name": "Jianrong Hou"}], "citations": [{"paperId": "d8e103a0c94d29e659bc8ef6fc3b6ff0e04d39d5", "title": "Modeling and verification of authentication threats mitigation in aspect-oriented mal sequence woven model"}, {"paperId": "07b9d3c2d70f0b78f5d9e8a7efd956084f83d97a", "title": "Design and Implementation of Intelligent Automated Production-Line Control System"}, {"paperId": "15879b0b4abf929ea3a27852be0a7f65eff39179", "title": "Feasibility Study of Software Engineering Aspects of Bigdata Analytics Applications for Academicians"}, {"paperId": "fa32166ad59d089bcc2197e93929c322bccf44cb", "title": "Big Data—Knowledge Discovery in Production Industry Data Storages—Implementation of Best Practices"}, {"paperId": "e3a2f108f60add02d2875e7ac7e4614f12673e5c", "title": "Proposal of data preparation model for Big Data analytics in painting process"}, {"paperId": "bf7a512d6097d98b19003ee227b510dc25d3443b", "title": "Preliminary Systematic Literature Review of Machine Learning System Development Process"}, {"paperId": "18ce62c359d4e34281bf9f6dca6296b81571e9a0", "title": "Development of Big Data Extraction and Learning Platform for Packet Analysis in Industrial Control Syste"}, {"paperId": "b99aee5cdefc6a7c947acf53c64a6ef437aba058", "title": "Blockchain-based Product Lifecycle Management using Supply Chain Management for Railcar Remanufacturing"}, {"paperId": "fd8dc26ea53144472bcd04faf1cc6f10a23ff699", "title": "Smart Factory: A Primer"}]}
