{"paperId": "072d2f9fc6ca24f69d51ae4d66ebadb72404d0b2", "publicationVenue": {"id": "cd98e18e-3ce9-431d-8031-9692dc50d6de", "name": "CASE", "type": "conference", "alternate_names": ["IEEE Conference on Automation Science and Engineering", "Conf Autom Sci Eng", "IEEE Conf Autom Sci Eng", "Conference on Automation Science and Engineering"], "issn": "2468-6441", "url": "https://www.cvcasejournal.com/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=366", "https://www.journals.elsevier.com/case"]}, "title": "Data analytics for energy consumption of digital manufacturing systems using Internet of Things method", "abstract": "The topic of ‘Industry 4.0’ has become increasingly popular in manufacturing and academia since it was first published. Under this trending topic, researchers and companies have pointed out many related capabilities required by current manufacturing systems, such as automation, interoperability, consciousness, and intelligence. To achieve these capabilities, data is considered the vitally important connecting media that integrates different manufacturing objects and activities. Additionally, sustainability is one of the most important research areas of Industry 4.0. Although modern digital manufacturing systems are becoming increasingly automated, the issue of sustainability still attracts attention, and is related to many processing factors that are present in a wide variety of systems. As a result, defining the energy consumption behaviour of digital manufacturing systems and discovering more efficient usage methods has been established as a crucial research target. In this paper, data analysis methods are proposed to facilitate better understanding and prediction of the energy consumption of digital production processes under an Internet of Things (IoT) framework. A Selective Laser Sintering (SLS) system is applied as a case study, in which a variety of real-time raw data is collected within machine logs from this ongoing Additive Manufacturing (AM) system. The machine data logs are combined with the product layout data and analysed using three data analysis techniques: linear regression, the decision tree method and the Back-propagation Neural Network method. The future work is introduced in order to complete this research.", "venue": "CASE", "year": 2017, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 13th IEEE Conference on Automation Science and Engineering (CASE)", "pages": "482-487"}, "authors": [{"authorId": "2114046349", "name": "Jian Qin"}, {"authorId": "49420283", "name": "Y. Liu"}, {"authorId": "2247170", "name": "R. Grosvenor"}], "citations": [{"paperId": "c61529f41817141b7fce6e6df6c75102359f945d", "title": "Comprehensive Analysis of IoT with Artificial Intelligence to Predictive Maintenance Optimization for Indian Shipbuilding"}, {"paperId": "5bf52405ce9ed4719181132a589ccdd707502efb", "title": "Can the Digital Economy Promote the Upgrading of Urban Environmental Quality?"}, {"paperId": "6fa6f6e3f04e55d868825d637f6198aab1286800", "title": "Moderating Role of Knowledge-Sharing on the Nexus of Digital Business and Natural Resources"}, {"paperId": "e84ff977f847c9062169db1e41541cbcb2d965b6", "title": "Digital transformation and electricity consumption: Evidence from the broadband China pilot policy"}, {"paperId": "c2d86c52aadeccf16650e1c623b4dc0fe08b8375", "title": "Trends, opportunities, and challenges in the integration of the additive manufacturing with Industry 4.0"}, {"paperId": "b6d1ec575d84fdc5e46f67fb81c385cc164195ce", "title": "Impacts of digitalization on energy security: evidence from European countries"}, {"paperId": "d7dbcd889356f6ecc64f89448af5ef87959f899d", "title": "Is Digital Adoption the way forward to Curb Energy Poverty?"}, {"paperId": "cb01f1145360258c02280b4c74fef323a42939da", "title": "The double-edged role of the digital economy in firm green innovation: micro-evidence from Chinese manufacturing industry"}, {"paperId": "edc29cf3456ee169229edc8db0ac4ba445360d91", "title": "Are digital business and digital public services a driver for better energy security? Evidence from a European sample"}, {"paperId": "8ea69067fe783363cdb0f48e75f9a182f7209c62", "title": "Impact of Internet of Things Paradigm Towards Energy Consumption Prediction: A Systematic Literature Review"}, {"paperId": "b2fe146ea2c54d9ef89ee3fa172b6ac2c427788a", "title": "Policy interactions with research trajectories: The case of cyber-physical convergence in manufacturing and industrials"}, {"paperId": "85c9e71e5bc2c8b65ebb26cf949ef50a2049b8cf", "title": "Data-driven method for predicting energy consumption of machine tool spindle acceleration"}, {"paperId": "7a90eb30a2f25da5d063ed365d2a9830bf303e79", "title": "Haze Pollution Levels, Spatial Spillover Influence, and Impacts of the Digital Economy: Empirical Evidence from China"}, {"paperId": "ee3a4ea50c2d0ac00cb25f3795b6a37e12129271", "title": "Digital Economy and Environmental Quality: Evidence from 217 Cities in China"}, {"paperId": "3373843183d86d5402ff23fee12ff336405a2ed9", "title": "Business analytics in Industry 4.0: A systematic review"}, {"paperId": "3c2cbe5aeab15a7c1d7437f9bfbc48cbb76e37e0", "title": "Digitalization and Energy: How Does Internet Development Affect China’s Energy Consumption?"}, {"paperId": "37c2afdd5f92f35dae664989c89514916661ca50", "title": "Predictive maintenance in the Industry 4.0: A systematic literature review"}, {"paperId": "a749af20bd0f2271eab3f7f6fd96373e638d174e", "title": "An overview of big data analysis"}, {"paperId": "ccd0f138c3deb4644cffed71dff36d9f4747aff7", "title": "Sustainability and Environmental Impact of Additive Manufacturing: A Literature Review"}, {"paperId": "7d1324c890be147a71285d7d78b8861d8fa3413a", "title": "Advanced data analytics for additive manufacturing energy consumption modelling, prediction, and management under Industry 4.0"}, {"paperId": "5710fc66b55f3ed1f9f603ccf518e5cd61cd3460", "title": "Multi-source data analytics for AM energy consumption prediction"}, {"paperId": "938f53521a6537908838d2fe387a8e00f1d81e85", "title": "Automated Process State Identification for Metal Additive Manufacturing based on Power Data"}, {"paperId": "9433d9db1612e4dac9eb4c5fec5fbc4d19a53f98", "title": "A Hybrid Machine Learning Approach for Energy Consumption Prediction in Additive Manufacturing"}, {"paperId": "b2016d49d58d355238070c37108656bce2fb4767", "title": "Exploiting data analytics for improved energy management decision-making"}, {"paperId": "77097ec4e10c23935d3461f60dca890896ffe417", "title": "Scalable Computing: Practice and Experience"}, {"paperId": "e216a5ebf342b5a3d13e205a22378fb6825b12df", "title": "Scalable Computing: Practice and Experience"}]}
