{"paperId": "07320552fd933358a8cfbb3406fa19592e079c80", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Low-Cost Sensors Technologies for Monitoring Sustainability and Safety Issues in Mining Activities: Advances, Gaps, and Future Directions in the Digitalization for Smart Mining", "abstract": "Nowadays, monitoring aspects related to sustainability and safety in mining activities worldwide are a priority, to mitigate socio-environmental impacts, promote efficient use of water, reduce carbon footprint, use renewable energies, reduce mine waste, and minimize the risks of accidents and fatalities. In this context, the implementation of sensor technologies is an attractive alternative for the mining industry in the current digitalization context. To have a digital mine, sensors are essential and form the basis of Industry 4.0, and to allow a more accelerated, reliable, and massive digital transformation, low-cost sensor technology solutions may help to achieve these goals. This article focuses on studying the state of the art of implementing low-cost sensor technologies to monitor sustainability and safety aspects in mining activities, through the review of scientific literature. The methodology applied in this article was carried out by means of the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines and generating science mapping. For this, a methodological procedure of three steps was implemented: (i) Bibliometric analysis as a quantitative method, (ii) Systematic review of literature as a qualitative method, and (iii) Mixed review as a method to integrate the findings found in (i) and (ii). Finally, according to the results obtained, the main advances, gaps, and future directions in the implementation of low-cost sensor technologies for use in smart mining are exposed. Digital transformation aspects for data measurement with low-cost sensors by real-time monitoring, use of wireless network systems, artificial intelligence, machine learning, digital twins, and the Internet of Things, among other technologies of the Industry 4.0 era are discussed.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "108779670", "name": "Carlos Cacciuttolo"}, {"authorId": "2226628328", "name": "Valentina Guzmán"}, {"authorId": "2226631812", "name": "Patricio Catriñir"}, {"authorId": "1580233994", "name": "E. Atencio"}, {"authorId": "2000589460", "name": "S. Komarizadehasl"}, {"authorId": "1402718973", "name": "J. Lozano-Galant"}], "citations": [{"paperId": "88847e229e901e217c0a1142c66389f5f44b58d5", "title": "Reviewing energy efficiency and environmental consciousness in the minerals industry Amidst digital transition: A comprehensive review"}, {"paperId": "c089d311fddcc2453d3aa78d25524381ef3f82f1", "title": "The Role of Low-Cost Digital Solutions in Supporting Industrial Sustainability"}, {"paperId": "fac6f96841c1e6bf15160fa2e50d115509035b3b", "title": "Integrated and intelligent remote operation centres (I2ROCs): Assessing the human–machine requirements for 21st century mining operations"}, {"paperId": "310c2499551418e136d349dc1c9176594c462aa5", "title": "Hazard Prediction of Water Inrush in Water-Rich Tunnels Based on Random Forest Algorithm"}, {"paperId": "0296fda187a8a31ed3021e2355cc67f5e137d6a9", "title": "Dry Stacking of Filtered Tailings for Large-Scale Production Rates over 100,000 Metric Tons per Day: Envisioning the Sustainable Future of Mine Tailings Storage Facilities"}, {"paperId": "7c840e5e2057d22e25e1259b6a2c301eb87837af", "title": "An Underground Mine Safety-Oriented Optimization Model for Mine Tailings Backfill Scheduling Considering Multi-Process and Multi-Cycle Issues"}, {"paperId": "e668f45b421df3aab3b20eaf8d184e013bea9c4f", "title": "Investigation of the Rock-Breaking Mechanism of Drilling under Different Conditions Using Numerical Simulation"}]}
