{"paperId": "0742eeb7b9fb577ffdb8a2c1bd6b4dd15ff0934a", "publicationVenue": {"id": "7a19b6e3-d595-4296-9d46-3c0f3ef98b20", "name": "International journal of pattern recognition and artificial intelligence", "type": "journal", "alternate_names": ["Int j pattern recognit artif intell", "Int J Pattern Recognit Artif Intell", "International Journal of Pattern Recognition and Artificial Intelligence"], "issn": "0218-0014", "url": "http://www.worldscinet.com/ijprai/ijprai.shtml"}, "title": "STiMR k-Means: An Efficient Clustering Method for Big Data", "abstract": "Big Data clustering has become an important challenge in data analysis since several applications require scalable clustering methods to organize such data into groups of similar objects. Given the computational cost of most of the existing clustering methods, we propose in this paper a new clustering method, referred to as STiMR [Formula: see text]-means, able to provide good tradeoff between scalability and clustering quality. The proposed method is based on the combination of three acceleration techniques: sampling, triangle inequality and MapReduce. Sampling is used to reduce the number of data points when building cluster prototypes, triangle inequality is used to reduce the number of comparisons when looking for nearest clusters and MapReduce is used to configure a parallel framework for running the proposed method. Experiments performed on simulated and real datasets have shown the effectiveness of the proposed method, with the existing ones, in terms of running time, scalability and internal validity measures.", "venue": "International journal of pattern recognition and artificial intelligence", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-25", "journal": {"name": "Int. J. Pattern Recognit. Artif. Intell.", "pages": "1950013:1-1950013:23", "volume": "33"}, "authors": [{"authorId": "2016569", "name": "Mohamed Aymen Ben HajKacem"}, {"authorId": "1403992311", "name": "Chiheb-Eddine Ben N'cir"}, {"authorId": "2286658", "name": "Nadia Essoussi"}], "citations": [{"paperId": "b767fd238ed42aaba317312f9766e242b93e8a24", "title": "Evolutionary multi-objective customer segmentation approach based on descriptive and predictive behaviour of customers: application to the banking sector"}, {"paperId": "76051512a92ca180468bfe88eee1ca6008f16ae4", "title": "NDPD: an improved initial centroid method of partitional clustering for big data mining"}, {"paperId": "2d81ff5cf29b93fb88203c3b371fdb33b7d03159", "title": "Stratified linear systematic sampling based clustering approach for detection of financial risk group by mining of big data"}, {"paperId": "263405ccbceac8cc9dfdece602730fc11f694697", "title": "Application of Artificial Intelligence Technology in International Trade Finance"}, {"paperId": "c83a812a101b67d248ac7d2e3782036e52655fea", "title": "Parallel K-Prototypes Clustering with High Efficiency and Accuracy"}, {"paperId": "97642abd1a72d532d7f6d306a9e0b7ad3252b87b", "title": "Multidimensional Clustering over Big Data: Models, Issues, Analysis, Emerging Trends"}, {"paperId": "ab8b37d21711f43ff2e604d54ec1fad4c25653f6", "title": "New Algorithms in RNA Structure Prediction Based on BHG"}, {"paperId": "5bbc02fa0c93fb80607a68454b30cb099b42af51", "title": "Retracted Article: Collaborative correlation space big data clustering algorithm for abnormal flow monitoring"}, {"paperId": "1fe3df80bf77a76e2ff2cdb929f873ac5b0b0cd2", "title": "Stratification to Improve Systematic Sampling for Big Data Mining Using Approximate Clustering"}, {"paperId": "53d03b68e618b1228df5f3f75db33f30c16252e3", "title": "Approximate Partitional Clustering Through Systematic Sampling in Big Data Mining"}, {"paperId": "8343bbe8184000cfda6c8cd490f83f50b04da989", "title": "Big Data Analytics and Knowledge Discovery: 22nd International Conference, DaWaK 2020, Bratislava, Slovakia, September 14–17, 2020, Proceedings"}]}
