{"paperId": "0751d1cf8fde96e802de00f0f6f518998e1d6e25", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Hierarchical Matching of Traffic Information Services Using Semantic Similarity", "abstract": "Service matching aims to find the information similar to a given query, which has numerous applications in web search. Although existing methods yield promising results, they are not applicable for transportation. In this paper, we propose a multilevel matching method based on semantic technology, towards efficiently searching the traffic information requested. Our approach is divided into two stages: service clustering, which prunes candidate services that are not promising, and functional matching. The similarity at function level between services is computed by grouping the connections between the services into inheritance and noninheritance relationships. We also developed a three-layer framework with a semantic similarity measure that requires less time and space cost than existing method since the scale of candidate services is significantly smaller than the whole transportation network. The OWL_TC4 based service set was used to verify the proposed approach. The accuracy of offline service clustering reached 93.80%, and it reduced the response time to 651 ms when the total number of candidate services was 1000. Moreover, given the different thresholds for the semantic similarity measure, the proposed mixed matching model did better in terms of recall and precision (i.e., up to 72.7% and 80%, respectively, for more than 1000 services) compared to the compared models based on information theory and taxonomic distance. These experimental results confirmed the effectiveness and validity of service matching for responding quickly and accurately to user queries.", "venue": "Journal of Advanced Transportation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-06-07", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "3007776", "name": "Zongtao Duan"}, {"authorId": "2110242064", "name": "Lei Tang"}, {"authorId": "8730922", "name": "Zhiliang Kou"}, {"authorId": "2369072", "name": "Yishui Zhu"}], "citations": [{"paperId": "0786ac98432fe9bf32585245497a30fabcbe52ad", "title": "Sustainable and Resilient Transport Infrastructure"}]}
