{"paperId": "075cc31c004940078dabe867e1703de4d7fcbfba", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Computing expected multiplicities for bag-TIDBs with bounded multiplicities", "abstract": "In this work, we study the problem of computing a tuple's expected multiplicity over probabilistic databases with bag semantics (where each tuple is associated with a multiplicity) exactly and approximately. We consider bag-TIDBs where we have a bound $c$ on the maximum multiplicity of each tuple and tuples are independent probabilistic events (we refer to such databases as c-TIDBs. We are specifically interested in the fine-grained complexity of computing expected multiplicities and how it compares to the complexity of deterministic query evaluation algorithms -- if these complexities are comparable, it opens the door to practical deployment of probabilistic databases. Unfortunately, our results imply that computing expected multiplicities for c-TIDBs based on the results produced by such query evaluation algorithms introduces super-linear overhead (under parameterized complexity hardness assumptions/conjectures). We proceed to study approximation of expected result tuple multiplicities for positive relational algebra queries ($RA^+$) over c-TIDBs and for a non-trivial subclass of block-independent databases (BIDBs). We develop a sampling algorithm that computes a 1$\\pm\\epsilon$ approximation of the expected multiplicity of an output tuple in time linear in the runtime of the corresponding deterministic query for any $RA^+$ query.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-06", "journal": {"name": "ArXiv", "volume": "abs/2204.02758"}, "authors": [{"authorId": "2087587228", "name": "Su Feng"}, {"authorId": "1798930", "name": "Boris Glavic"}, {"authorId": "5230505", "name": "Aaron R. Huber"}, {"authorId": "144018997", "name": "Oliver Kennedy"}, {"authorId": "1755572", "name": "A. Rudra"}], "citations": [{"paperId": "9e7f1165225a54dc45192acddf7f3f021c1e71ad", "title": "Probabilistic Query Evaluation with Bag Semantics"}]}
