{"paperId": "075c4fd606e430723cf65d59f2e2811f4b1ea7d2", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Internet of Things data management: A systematic literature review, vision, and future trends", "abstract": "The Internet of Things (IoT) is expected to connect devices with unique identifiers over a network to create an equilibrium system with high speeds and volumes of data while presenting an interoperability challenge. The IoT data management system is indispensable for attaining effective and efficient performance because IoT sensors generate and collect large amounts of data used to express large data sets. IoT data management has been analyzed from various perspectives in numerous studies. In this study, a Systematic Literature Review (SLR) method was used to investigate the various topics and key areas that have recently emerged in IoT data management. This study aims to classify and evaluate studies published between 2015 and 2021 in IoT data management. Therefore, the classification of studies includes five categories, data processing, data smartness application, data collection, data security, and data storage. Then, studies in each field are compared based on the proposed classification. Each study investigates novel findings, simulation/implementation, data set, application domain, experimental results, advantages, and disadvantages. In addition, the criteria for evaluating selected articles for each domain of IoT data management are examined. Big data accounts for the highest percentage of data processing fields in IoT data management, at 34%. In addition, fast data processing, distributed data, artificial intelligence data with 22%, and data uncertainty analysis account for 11% of the data processing field. Finally, studies highlight the challenges of IoT data management and its future directions.", "venue": "International Journal of Communication Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-21", "journal": {"name": "International Journal of Communication Systems", "volume": "35"}, "authors": [{"authorId": "2172682237", "name": "Naser Shirvanian"}, {"authorId": "2164776194", "name": "Maryam Shams"}, {"authorId": "2101287659", "name": "A. Rahmani"}], "citations": [{"paperId": "a5279061d7d65d90dbc6687a37dbe849c5a8bcac", "title": "Fog Computing in Healthcare: Systematic Review"}, {"paperId": "906a30786a301d1c28981860b90250602fe39b89", "title": "Data Lakes in Healthcare: Applications and Benefits from the Perspective of Data Sources and Players"}]}
