{"paperId": "075d29cd87ff9e9b4c436b518e259a7ff93ac155", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "FLEX-IoT: Secure and Resource-Efficient Network Boot System for Flexible-IoT Platform", "abstract": "In an internet of things (IoT) platform with a copious number of IoT devices and active variation of operational purpose, IoT devices should be able to dynamically change their system images to play various roles. However, the employment of such features in an IoT platform is hindered by several factors. Firstly, the trivial file transfer protocol (TFTP), which is generally used for network boot, has major security vulnerabilities. Secondly, there is an excessive demand for the server during the network boot, since there are numerous IoT devices requesting system images according to the variation of their roles, which exerts a heavy network overhead on the server. To tackle these challenges, we propose a system termed FLEX-IoT. The proposed system maintains a FLEX-IoT orchestrater which uses an IoT platform operation schedule to flexibly operate the IoT devices in the platform. The IoT platform operation schedule contains the schedules of all the IoT devices on the platform, and the FLEX-IoT orchestrater employs this schedule to flexibly change the mode of system image transfer at each moment. FLEX-IoT consists of a secure TFTP service, which is fully compatible with the conventional TFTP, and a resource-efficient file transfer method (adaptive transfer) to streamline the system performance of the server. The proposed secure TFTP service comprises of a file access control and attacker deception technique. The file access control verifies the identity of the legitimate IoT devices based on the hash chain shared between the IoT device and the server. FLEX-IoT provides security to the TFTP for a flexible IoT platform and minimizes the response time for network boot requests based on adaptive transfer. The proposed system was found to significantly increase the attack-resistance of TFTP with little additional overhead. In addition, the simulation results show that the volume of transferred system images on the server decreased by 27% on average, when using the proposed system.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2208581261", "name": "Keon-Ho Park"}, {"authorId": "2144241837", "name": "Seong-Jin Kim"}, {"authorId": "4198724", "name": "J. Yun"}, {"authorId": "144165628", "name": "Seungho Lim"}, {"authorId": "73758626", "name": "K. Park"}], "citations": [{"paperId": "f3a8f5c1f4ee7762c78edb4edf5acdd576bd46fa", "title": "Critical Success Factors for Internet of Things (IoT) Implementation in Automotive Companies, Indonesia"}, {"paperId": "f79617edfb4bcd85c7e12db51431adb8b301389a", "title": "Analysis of application development needs and discussion on the platform architecture of the Internet of Things"}]}
