{"paperId": "0760a0f1e90c9c607f86e55a0fb54a307a7cb6f0", "publicationVenue": null, "title": "Querying Semantic Knowledge Bases with SQL-on-Hadoop", "abstract": "The constant growth of semantically-annotated data and an increasing interest in cross-domain knowledge bases raises the need for expressive query languages for RDF and novel approaches that enable their evaluation for web-scale data sizes. However, SPARQL, the W3C standard query language for RDF, suffers from a rather limited capability to express navigational queries. More expressive languages have been theoretically studied, however not implemented. In this paper, we continue our work on TRIAL-QL, an expressive (SQL-like) RDF query language based on the Triple Algebra with Recursion [31]. We present a new version of our TRIAL-QL processor, which takes advantage of the current momentum in in-memory SQL-on-Hadoop solutions and is built on top of Impala and SPARK while using one unified data storage. We use our system to study the application of multiple evaluation algorithms, storage strategies and optimizations on Impala and SPARK while highlighting their properties. Comprehensive experiments examine the performance of our system in comparison to other competitive RDF management systems. The obtained results demonstrate its suitability for querying semantic knowledge bases by providing interactive query response times for selective queries on datasets with more than one billion triple. More data-intensive use-cases that produce, e.g. over 25 billion results finished in the order of minutes.", "venue": "BeyondMR@SIGMOD", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-05-14", "journal": {"name": "Proceedings of the 4th ACM SIGMOD Workshop on Algorithms and Systems for MapReduce and Beyond"}, "authors": [{"authorId": "1403683697", "name": "Martin Przyjaciel-Zablocki"}, {"authorId": "2131714", "name": "A. Schätzle"}, {"authorId": "1809410", "name": "G. Lausen"}], "citations": [{"paperId": "999953cfd738da763fb165cd3f29c5277e9ca200", "title": "Technological Prospects of Cloud Computing in Web Mining: Recent Trends and Opportunities"}, {"paperId": "3cc6b6b976aeaa47a8f62b2577c09c826dadd9eb", "title": "Storing and Querying Semantic Data in the Cloud"}, {"paperId": "6cfdac2d04d22a3afd40f0700c7a629a88404782", "title": "Report from the third workshop on Algorithms and Systems for MapReduce and Beyond (BeyondMR'16)"}, {"paperId": "86c333c0e5a406680862fd0ea8e835e483afcfe0", "title": "Reasoning Web. Learning, Uncertainty, Streaming, and Scalability"}, {"paperId": "051a97aea28cec11091744c90130abc004216641", "title": "Report from the Fourth Workshop on Algorithms andSystems for MapReduce and Beyond (BeyondMR '17)"}]}
