{"paperId": "0793f592932c60ccce1bab28cdae46cdb23cd8a1", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Energy Efficient Deployment of a Service Function Chain for Sustainable Cloud Applications", "abstract": "With the increasing popularity of the Internet, user requests for cloud applications have dramatically increased. The traditional model of relying on dedicated hardware to implement cloud applications has not kept pace with the rapid growth in demand. Network function virtualization (NFV) architecture emerged at a historic moment. By moving the implementation of functions to software, a separation of functions and hardware was achieved. Therefore, when user demand increases, cloud application providers only need to update the software; the underlying hardware does not change, which can improve network scalability. Although NFV solves the problem of network expansion, deploying service function chains into the underlying network to optimize indicators remains an important research problem that requires consideration of delay, reliability, and power consumption. In this paper, we consider the optimization of power consumption with the premise of guaranteeing a certain virtual function link yield. We propose an efficient algorithm that is based on first-fit and greedy algorithms to solve the problem. The simulation results show that the proposed algorithm substantially improves the path-finding efficiency, achieves a higher request acceptance ratio and reduces power consumption while provisioning the cloud applications. Compared with the baseline algorithm, the service function chain (SFC) acceptance ratio of our proposed algorithms improves by a maximum of approximately 15%, our proposed algorithm reduces the power consumption by a maximum of approximately 15%, the average link load ratio of our proposed algorithm reduces by a maximum of approximately 20%, and the average mapped path length of our proposed algorithm reduces by a maximum of approximately 1.5 hops.", "venue": "Sustainability", "year": 2018, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2018-09-29", "journal": {"name": "Sustainability"}, "authors": [{"authorId": null, "name": "Jian Sun"}, {"authorId": "36831267", "name": "Yue Chen"}, {"authorId": "143977282", "name": "Miao Dai"}, {"authorId": "2108277913", "name": "Wanting Zhang"}, {"authorId": "3097765", "name": "A. K. Sangaiah"}, {"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "2112454477", "name": "Han Han"}], "citations": [{"paperId": "4846f899101b380999a6f23467e18236c328612e", "title": "Energy-aware intelligent scheduling for deadline-constrained workflows in sustainable cloud computing"}, {"paperId": "6f4e1ffe894091369996351659136d80899d673b", "title": "A survey on the placement of virtual network functions"}, {"paperId": "fb05a613c8d24896ae82feb1c2135d8de0d42c86", "title": "Energy efficient network service deployment across multiple SDN domains"}, {"paperId": "db4c7e95de3bba37d4324e57f18a925e76c1e4cd", "title": "Task Allocation Based on Task Deployment in Autonomous Vehicular Cloud"}]}
