{"paperId": "079539d763b04fdf026c2344623bec92a217ad39", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Resource Management and Scheduling in Distributed Stream Processing Systems", "abstract": "Stream processing is an emerging paradigm to handle data streams upon arrival, powering latency-critical application such as fraud detection, algorithmic trading, and health surveillance. Though there are a variety of Distributed Stream Processing Systems (DSPSs) that facilitate the development of streaming applications, resource management and task scheduling is not automatically handled by the DSPS middleware and requires a laborious process to tune toward specific deployment targets. As the advent of cloud computing has supported renting resources on-demand, it is of great interest to review the research progress of hosting streaming systems in clouds under certain Service Level Agreements (SLA) and cost constraints. In this article, we introduce the hierarchical structure of streaming systems, define the scope of the resource management problem, and present a comprehensive taxonomy in this context covering critical research topics such as resource provisioning, operator parallelisation, and task scheduling. The literature is then reviewed following the taxonomy structure, facilitating a deeper understanding of the research landscape through classification and comparison of existing works. Finally, we discuss the open issues and future research directions toward realising an automatic, SLA-aware resource management framework.", "venue": "ACM Computing Surveys", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-28", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 41", "volume": "53"}, "authors": [{"authorId": "2109380838", "name": "Xunyun Liu"}, {"authorId": "1709598", "name": "R. Buyya"}], "citations": [{"paperId": "d881f693a1ca55af45912f95b14caa6a6652423d", "title": "Lc‐Stream: An elastic scheduling strategy with latency constraints in geo‐distributed stream computing environments"}, {"paperId": "84f34698aea7fba58f6a1b372b45f95cf61f9c21", "title": "Adaptive Scheduling Framework of Streaming Applications based on Resource Demand Prediction with Hybrid Algorithms"}, {"paperId": "6c9430f1d30f143ecaf17d12ecd948be7b342052", "title": "Cost-optimized cloud resource management for video streaming: ARIMA predictive approach"}, {"paperId": "6637b092a20b26a0376ca31a32742f6a0acf93af", "title": "Zero-Shot Cost Models for Parallel Stream Processing"}, {"paperId": "d61d50ea9d6e7827d539c014d72158b9716590bb", "title": "Time series big data: a survey on data stream frameworks, analysis and algorithms"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "84617f481cc1a3ebf5f4634fbce8922a52f83865", "title": "Hybrid Algorithm for Resource Aware Predictive Scheduling: A case-study to Human Activity Recognition"}, {"paperId": "f7ad80eed9c45caa5873c026d69fe616621ad366", "title": "MF-Storm: a maximum flow-based job scheduler for stream processing engines on computational clusters to increase throughput"}, {"paperId": "16716a8232bf9d685d5b178b52a34f08434b5015", "title": "Two-stage Scheduling of Stream Computing for Industrial Cloud-edge Collaboration"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "fea67988e9298c804c24054dab2ea708266f184e", "title": "Resource scheduling and provisioning for processing of dynamic stream workflows under latency constraints"}, {"paperId": "046fcc0c44333776a035f5a642c3315c9470c91e", "title": "Cost-effective and adaptive clustering algorithm for stream processing on cloud system"}, {"paperId": "0c50067e65b39b4a4237794bce97e0240c4471dc", "title": "Pre‐filtering based summarization for data partitioning in distributed stream processing"}, {"paperId": "f1f13528b276fd028345e230257f6c6b48dbae6b", "title": "Efficient autonomic and elastic resource management techniques in cloud environment: taxonomy and analysis"}, {"paperId": "5f626926e47c3eabc3c519c544910cb6a1c9a6b5", "title": "Elastic Pulsar Functions for Distributed Stream Processing"}, {"paperId": "ab0938b2025c320a94ef4f5965f9ab47dee5cccc", "title": "RDMA-Based Apache Storm for High-Performance Stream Data Processing"}, {"paperId": "05f8d6edfd20856d680d5bd8aaae6314d9647d08", "title": "Dynamic Auto Reconfiguration of Operator Placement in Wireless Distributed Stream Processing Systems"}, {"paperId": "3f67e77a2d985b66fe4be2e65bd7c32c41c24004", "title": "Elastic Scheduling for Microservice Applications in Clouds"}, {"paperId": "21da1ee785c91c832f68a9f18e4d7eda41c1cbd6", "title": "A Survey on the Evolution of Stream Processing Systems"}, {"paperId": "c7a0b97d3aaf001f21f331bb9d7d7eca2562b252", "title": "Classification of Various Scheduling Approaches for Resource Management System in Cloud Computing"}, {"paperId": "69de5531ebb45179b9d53359b042e8f50514a3ed", "title": "A Topology-Aware Scheduling Strategy for Distributed Stream Computing System"}, {"paperId": "a02cad3bceac0b9771e7069c275a5c94ff2825e3", "title": "A Data Stream Prediction Strategy for Elastic Stream Computing Systems"}, {"paperId": "a36821efdc491fb1c1b40a1c0169310d5f1f2bad", "title": "RDMA-Based Apache Storm for High-Performance Stream Data Processing"}]}
