{"paperId": "07a11d8d3ca3903974a3ca143cba5dba50322639", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "FLGo: A Fully Customizable Federated Learning Platform", "abstract": "Federated learning (FL) has found numerous applications in healthcare, finance, and IoT scenarios. Many existing FL frameworks offer a range of benchmarks to evaluate the performance of FL under realistic conditions. However, the process of customizing simulations to accommodate application-specific settings, data heterogeneity, and system heterogeneity typically remains unnecessarily complicated. This creates significant hurdles for traditional ML researchers in exploring the usage of FL, while also compromising the shareability of codes across FL frameworks. To address this issue, we propose a novel lightweight FL platform called FLGo, to facilitate cross-application FL studies with a high degree of shareability. Our platform offers 40+ benchmarks, 20+ algorithms, and 2 system simulators as out-of-the-box plugins. We also provide user-friendly APIs for quickly customizing new plugins that can be readily shared and reused for improved reproducibility. Finally, we develop a range of experimental tools, including parallel acceleration, experiment tracker and analyzer, and parameters auto-tuning. FLGo is maintained at \\url{flgo-xmu.github.io}.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-21", "journal": {"name": "ArXiv", "volume": "abs/2306.12079"}, "authors": [{"authorId": "11032852", "name": "Z. Wang"}, {"authorId": "34964296", "name": "Xiaoliang Fan"}, {"authorId": "2220792454", "name": "Zhaopeng Peng"}, {"authorId": "2220662783", "name": "Xueheng Li"}, {"authorId": "30348654", "name": "Ziqi Yang"}, {"authorId": "2220345475", "name": "Mingkuan Feng"}, {"authorId": "2220668326", "name": "Zhicheng Yang"}, {"authorId": "2111310042", "name": "Xiao Liu"}, {"authorId": "2155548037", "name": "Cheng Wang"}], "citations": []}
