{"paperId": "07a3118adab407ccd705f1e0118d729b1ac75ae8", "publicationVenue": {"id": "5446387c-37e0-4288-b469-779375a95962", "name": "Economics and Culture", "alternate_names": ["Econ Cult", "Economia della cultura", "Econ cult"], "issn": "2255-7563", "alternate_issns": ["1122-7885"], "url": "https://www.degruyter.com/view/j/jec", "alternate_urls": ["http://www.degruyter.com/view/j/jec.2016.13.issue-1/issue-files/jec.2016.13.issue-1.xml"]}, "title": "E-Commerce as a Revenue Generator for Small and Medium Companies in Developing Countries", "abstract": "Abstract Research purpose. The subject of this paper is the role of e-commerce for companies in increasing their competitive advantage in the market during and after the pandemic. The paper monitors the digital transformation and e-commerce implementations in a developing country (North Macedonia) and whether this can lead to a better position in the market. Design / Methodology / Approach. The design of the research contained both a literature review from relevant secondary sources, as well as primary research through empirical analysis. The empirical analysis was performed through a survey questionnaire containing 28 questions of open and closed nature, including a five-point Likert Scale. The data was subject to quantitative and qualitative analysis and presented in the paper. Findings. E-commerce has been seen as the future of shopping; however, due to the pandemic, the adoption rates increased significantly in the past two years. Primary data from the research shows that consumers in developing countries are open to online shopping, with satisfied trust and security parameters. The research implies that companies can safely implement e-commerce by following several important aspects to ensure customer interest in converting to their e-stores. Originality / Value / Practical implications. The paper contributes to the e-commerce research field by providing newer data after a global situation-changer, such as the pandemic. The research data can be utilized to compare statistics and generate trends for developing countries in further research, as well as broader usage for customer preferences from other academics and the business sector.", "venue": "Economics and Culture", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-01", "journal": {"name": "Economics and Culture", "pages": "47 - 56", "volume": "19"}, "authors": [{"authorId": "71069538", "name": "Martin Kiselicki"}, {"authorId": "72988591", "name": "Zanina Kirovska"}, {"authorId": "1902149", "name": "Saso Josimovski"}, {"authorId": "2197791069", "name": "Milan Anastasovski"}], "citations": []}
