{"paperId": "07a72aab285d80b438593ceecc48d091db592dd6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Unleashing the power of disruptive and emerging technologies amid COVID-19: A detailed review", "abstract": "The unprecedented outbreak of the novel coronavirus (COVID-19), during early December 2019 in Wuhan, China, has quickly evolved into a global pandemic, became a matter of grave concern, and placed government agencies worldwide in a precarious position. The scarcity of resources and lack of experiences to endure the COVID-19 pandemic, combined with the fear of future consequences has established the need for adoption of emerging and future technologies to address the upcoming challenges. Since the last five months, the amount of pandemic impact has reached its pinnacle that is altering everyone's life; and humans are now bound to adopt safe ways to survive under the risk of being affected. Technological advances are now accelerating faster than ever before to stay ahead of the consequences and acquire new capabilities to build a safer world. Thus, there is a rising need to unfold the power of emerging, future and disruptive technologies to explore all possible ways to fight against COVID-19. In this review article, we attempt to study all emerging, future, and disruptive technologies that can be utilized to mitigate the impact of COVID-19. Building on background insights, detailed technological specific use cases to fight against COVID-19 have been discussed in terms of their strengths, weaknesses, opportunities, and threats (SWOT). As concluding remarks, we highlight prioritized research areas and upcoming opportunities to blur the lines between the physical, digital, and biological domain-specific challenges and also illuminate collaborative research directions for moving towards a post-COVID-19 world.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-23", "journal": {"name": "ArXiv", "volume": "abs/2005.11507"}, "authors": [{"authorId": "145092061", "name": "Sonali Agarwal"}, {"authorId": "52186859", "name": "N. Punn"}, {"authorId": "52133313", "name": "S. K. Sonbhadra"}, {"authorId": "1750931", "name": "P. Nagabhushan"}, {"authorId": "2065721668", "name": "K. K. S. Pandian"}, {"authorId": "65726970", "name": "Praveer Saxena"}], "citations": [{"paperId": "9368b3281db1842f1c6e96daa77a6ec1df043bf2", "title": "Chapter 6 Using robotics, artificial intelligence, and deep learning to collect COVID-19 samples"}, {"paperId": "65fe1b0a5acbb433e098b63edd2b4475bd34cfe1", "title": "12 IoT based sensor operated automatic potion (SOAP) dispenser"}, {"paperId": "c28086a8ef07fec068d591529e9a4f42652c9de4", "title": "3D printing technology in drug delivery: Polymer properties and applications"}, {"paperId": "8be0b847026cc07bf7d016670d5cc00c3edd669d", "title": "Leveraging autonomous mobile robots for Industry 4.0 warehouses: a multiple case study analysis"}, {"paperId": "dafaac0bd6c83b5066e5fb56cd0f61580354a066", "title": "Social Distancing Detection AI System using YOLO"}, {"paperId": "2d6147eab55e4056d734b777f5f594ef177b55cc", "title": "Real Time Face Mask Detection to Prevent Viral Respiratory Infection"}, {"paperId": "e4b9506930a13d8a12d54d4f54ee8432c7b7c6a9", "title": "Multi-robot task assignment for serving people quarantined in multiple hotels during COVID-19 pandemic"}, {"paperId": "5e8a69e6dcc67911806f9f24ea903dce549d5529", "title": "Integration of cloud computing with the Internet of things for the treatment and management of the COVID-19 pandemic"}, {"paperId": "47c9c8091b98943a1ce772247f2d950951c2dd68", "title": "A digital business ecosystem maturity model for personal service firms"}, {"paperId": "a304898c9016aae1ca872fe8d3fa98bf5e9f85dc", "title": "Social Distance Measuring Based on Monocular Vision"}, {"paperId": "7d11f47ae203eb367c9f3610cc4e86a287e8a045", "title": "Analysis of Covid-19 Appropriate Mask Wearing Behaviour in Indian Cities Using Deep Learning"}, {"paperId": "28d0c1f199dd4e79f10fbb252195374701cddfc0", "title": "A systematic review on machine learning models for online learning and examination systems"}, {"paperId": "971e66349a78febddb4f43d71e5d6f93eba00422", "title": "The evolving roles and impacts of 5G enabled technologies in healthcare: The world epidemic COVID-19 issues"}, {"paperId": "33100db69a2958ea286070fac27bd31637d02c47", "title": "QoS Review: Smart Sensing in Wake of COVID-19, Current Trends and Specifications With Future Research Directions"}, {"paperId": "a135785d33ae806374d5c08b5dc07f8d4fbd6629", "title": "Real-Time Face Mask Detection to Ensure COVID-19 Precautionary Measures in the Developing Countries"}, {"paperId": "4e3c12b77cd2b97765b213a8c8c7c449035540eb", "title": "“New Normal” implications for global talent in the wake of economic nationalism and slowdown"}, {"paperId": "3a23654009a29457a0ceb954443e846559ac8197", "title": "How technology transform innovative educational solution during pandemic disruption"}, {"paperId": "e4f9535d06fd43da69726e60787547d4192afa15", "title": "Evaluation of Transfer Learning for Mask Detection"}, {"paperId": "a23da566c7c608b664dd47c975666e9073e22265", "title": "COVID-19 Face Mask Detection"}, {"paperId": "25280909bf7c03ea4bb23e541078c6a7340af874", "title": "Knowledge, attitude and practice towards facemask use amid the COVID-19 pandemic among public transport drivers in Debre-Tabor town, Ethiopia"}, {"paperId": "3f0b87cd97796c8f7de620147a90728289510ec3", "title": "Automated COVID-19 and Heart Failure Detection Using DNA Pattern Technique with Cough Sounds"}, {"paperId": "e7df4e08080a14c2407bc8693f2b3873a7d51960", "title": "People Might Be More Willing to Use Automated Vehicles in Pandemics like COVID-19"}, {"paperId": "a097a8a1e316a386489d6fb07406221217a0a533", "title": "An optimal feature enriched region of interest (ROI) extraction for periocular biometric system"}, {"paperId": "c3fc64cd9f1ccf23174230582976204f762f783f", "title": "Social Distancing Using AI and Deep Learning"}, {"paperId": "08f33363ce988cbc1398c94a251233b546a5a4d8", "title": "The Adoption of Robotic Process Automation Technology to Ensure Business Processes during the COVID-19 Pandemic"}, {"paperId": "ec75fb6435397da5666cb81d51a4f0e9a9ce4050", "title": "Recommending best course of treatment based on similarities of prognostic markers"}, {"paperId": "3c472eaa186aeebc8fd3fa9868df2e406d9eed3e", "title": "Modality specific U-Net variants for biomedical image segmentation: a survey"}, {"paperId": "94c691d3a3ee890f1d61852d6e9912f809b34c7f", "title": "Ergophthalmology around COVID-19"}, {"paperId": "2d0e3d3c77aa150d35c70f64cfa1a633597df9b8", "title": "Machine learning equipped web based disease prediction and recommender system"}, {"paperId": "eec2f30595dc5ac414191799b9a314a5734a076e", "title": "Indoor air quality improvement in COVID-19 pandemic: Review"}, {"paperId": "58d1b1f42cd32139dbeb546d5b0186d80e1d06ad", "title": "Social Distancing Detection Using Computer Vision"}, {"paperId": "7b43368c841804cf6bd6ef80ff5a720699dd1741", "title": "The nonpharmaceutical interventionist (NPI) signs of the coronavirus pandemic: a documentary typology and case study of COVID-19 signage"}, {"paperId": "3f3ecaeef10cc984cc7a50cbce05d492c9c350bd", "title": "Blockchain for decentralized multi‐drone to combat COVID‐19 and future pandemics: Framework and proposed solutions"}, {"paperId": "20dd182b210418be46ddcaa8952cb7ad1a61c29f", "title": "CHS-Net: A Deep Learning Approach for Hierarchical Segmentation of COVID-19 via CT Images"}, {"paperId": "7fc30915fb1aa8c4dedffd4b67347e0ddcb5d2dd", "title": "CHS-Net: A Deep learning approach for hierarchical segmentation of COVID-19 infected CT images"}, {"paperId": "c05b9522fcebc2634a1a2c91877e31b92d5ad2d1", "title": "Users’ Acceptance of Connected and Automated Shuttles for Tourism Purposes: A Survey Study"}, {"paperId": "97307aecdf84af2ba7b4ca360d0499fb1e74a0a4", "title": "Functional gaze prediction in egocentric video"}, {"paperId": "57f87efa0a1961c9d6c6adc0ab91711dfe07a993", "title": "Towards the sustainable development of smart cities through mass video surveillance: A response to the COVID-19 pandemic"}, {"paperId": "c5628597e04cd546a4ad376624663b7719fc068e", "title": "Blockchain-Empowered Multi-Robot Collaboration to Fight COVID-19 and Future Pandemics"}, {"paperId": "b72ced487983256bebbfe89055e1525f5cd4460b", "title": "Early-stage COVID-19 diagnosis in presence of limited posteroanterior chest X-ray images via novel Pinball-OCSVM"}, {"paperId": "1b782ac45557c158962f2be38ccd109ca5e7718b", "title": "Blockchain for Multi-Robot Collaboration to Combat COVID-19 and Future Pandemics"}, {"paperId": "418b49ca20ac847ee3cf702d7c354f38dafac330", "title": "Face Mask Detection using Transfer Learning of InceptionV3"}, {"paperId": "7813c7274ddb3fa90ff76c2ec4f8f1c327823aa1", "title": "Internet of Things for Current COVID-19 and Future Pandemics: an Exploratory Study"}, {"paperId": "4bb879922bc80dfe682cacf6ce3efa49a0982d2b", "title": "A Vision-Based Social Distancing and Critical Density Detection System for COVID-19"}, {"paperId": "5523f8432dd84054bfdef150a1486c904589d5d0", "title": "A Comprehensive Survey of Enabling and Emerging Technologies for Social Distancing—Part I: Fundamentals and Enabling Technologies"}, {"paperId": "3128c7b06e45b686ed0833ba3b2f766b08c76c20", "title": "Precision Face Mask Detection in Crowded Environment using Machine Vision"}, {"paperId": "8cd039f496f9713446359da4c800294e39331f88", "title": "Computer Vision-Based IoT Architecture for Post COVID-19 Preventive Measures"}, {"paperId": "8d081a15643f2ca204a90c4c12edc7aa5fc82bb9", "title": "Protective face covering: An application of MobileNetV2 detector"}, {"paperId": "4dbd2a6a456c4c361b0e5ecf7b2ec23d431e2c65", "title": "An Automated Real-Time Face Mask Detection System Using Transfer Learning with Faster-RCNN in the Era of the COVID-19 Pandemic"}, {"paperId": "a5834a339da561f5958f55107c6f1305d92e3123", "title": "A Systematic Review on the Identification and Diagnosis of Clinical Characteristics of COVID-19 Patients"}, {"paperId": "e29fe3573e8d22c0b0dcf243b0082305e4069dba", "title": "A Real-Time Deep Transfer Learning-Based Classification and Social Distance Alert Framework Based on Covid-19"}, {"paperId": "44e296f13dc9c6a8254592cc45bddcb6cf35d040", "title": "Ergophthalmology around COVID-19"}, {"paperId": "8a255f09cccb3d865126cb45df0b37a31d34f8c7", "title": "Master s Final Project Machine Learning applied to COVID-19"}, {"paperId": "58b09f621a69d7c586cf6147c470093522448a49", "title": "Higher Educational Systems and E-resilience"}]}
