{"paperId": "07b7c3f2294413cc90ff66af0430dc592dab6fb4", "publicationVenue": {"id": "187dde4a-2b59-491b-b6cf-1a8618878cdc", "name": "International Conference on Mobile Data Management", "type": "conference", "alternate_names": ["Int Conf Mob Data Manag", "MDM", "Mobile Data Management", "Mob Data Manag"]}, "title": "Decaying Telco Big Data with Data Postdiction", "abstract": "In this paper, we present a novel decaying operator for Telco Big Data (TBD), coined TBD-DP (Data Postdiction). Unlike data prediction, which aims to make a statement about the future value of some tuple, our formulated data postdiction term, aims to make a statement about the past value of some tuple, which does not exist anymore as it had to be deleted to free up disk space. TBD-DP relies on existing Machine Learning (ML) algorithms to abstract TBD into compact models that can be stored and queried when necessary. Our proposed TBD-DP operator has the following two conceptual phases: (i) in an offline phase, it utilizes a LSTM-based hierarchical ML algorithm to learn a tree of models (coined TBD-DP tree) over time and space; (ii) in an online phase, it uses the TBD-DP tree to recover data within a certain accuracy. In our experimental setup, we measure the efficiency of the proposed operator using a ~10GB anonymized real telco network trace and our experimental results in Tensorflow over HDFS are extremely encouraging as they show that TBD-DP saves an order of magnitude storage space while maintaining a high accuracy on the recovered data.", "venue": "International Conference on Mobile Data Management", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 19th IEEE International Conference on Mobile Data Management (MDM)", "pages": "106-115"}, "authors": [{"authorId": "35237407", "name": "Constantinos Costa"}, {"authorId": "51128498", "name": "Andreas Charalampous"}, {"authorId": "1746988", "name": "Andreas Konstantinidis"}, {"authorId": "1403214054", "name": "D. Zeinalipour-Yazti"}, {"authorId": "1756679", "name": "M. Mokbel"}], "citations": [{"paperId": "f987493edab760808917543dca104dca6f19b160", "title": "Towards a Signature Based Compression Technique for Big Data Storage"}, {"paperId": "53b5b70c68c57b930de73ce6f9756f46f81f1c35", "title": "Continuous decaying of telco big data with data postdiction"}, {"paperId": "56053d785071fe58ce2b835be5a7907880822a57", "title": "Telco Big Data Research and Open Problems"}, {"paperId": "2b901efd41fec7dcc58d070f82d743f83110d595", "title": "TBD-DP: Telco Big Data Visual Analytics with Data Postdiction"}, {"paperId": "d2d762e2596361163461e669df810667aa54e51d", "title": "Telco Big Data: Current State & Future Directions"}]}
