{"paperId": "07d85910e8c66da966ac0223f87634ec5bf00c30", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Credit-Based Payments for Fast Computing Resource Trading in Edge-Assisted Internet of Things", "abstract": "The introduction of edge computing into blockchain-enabled Internet of Things (IoT) for offloading computational tasks is attracting increasing attention. Computing resource trading unavoidably happens in edge-assisted IoT. However, efficient computing resource trading cannot be achieved because of the “cold start” and “long return” problems. To address these challenges, we propose to use a credit-based payment for fast computing resource trading in edge-assisted blockchain-enabled IoT; therefore, the IoT nodes can finish fast payment and frequent trading by borrowing resource coins from other IoT nodes based on their credit values. In our resource-coin loan problem, we propose an iterative double-auction-based algorithm, where a broker is introduced to solve the loan allocation problem and to determine the size of the loan each lender would provide to each borrower. Furthermore, the broker enforces specific loan pricing rules to induce the borrowers and lenders to bid truthfully. Then, the hidden privacy information could be extracted to achieve the optimal resource-coin allocation and loan pricing. The proposed algorithm can maximize the economic benefits while protecting privacy. Simulations showed that the proposed algorithm can maximize social welfare. In addition, we compared the proposed algorithm with the credit-bank-based method in terms of the satisfaction function and payments. The experimental results demonstrated that the proposed algorithm was individually rational, truthful, and budget-balanced.", "venue": "IEEE Internet of Things Journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-02", "journal": {"name": "IEEE Internet of Things Journal", "pages": "6606-6617", "volume": "6"}, "authors": [{"authorId": "1896187", "name": "Zhenni Li"}, {"authorId": "2611282", "name": "Zuyuan Yang"}, {"authorId": "145382103", "name": "Shengli Xie"}, {"authorId": "2111704521", "name": "Wuhui Chen"}, {"authorId": "2146385966", "name": "Kang Liu"}], "citations": [{"paperId": "a31af6740eb179eb99bf231b22e5c9cf6a87419f", "title": "A Secure Sidechain for Decentralized Trading in Internet of Things"}, {"paperId": "fbd83c38494c0ea0dbac4f847572d462a6e2a7f5", "title": "Multi-Session Budget Optimization for Forward Auction-based Federated Learning"}, {"paperId": "d6c7f479d2dfd5729bec66448b0f64760f64a81c", "title": "Consortium Blockchain-Based Security and Efficient Resource Trading in V2V-Assisted Intelligent Transport Systems"}, {"paperId": "12b29ba78d91ad8a1ab463130d4316a5429fac5f", "title": "Blockchain based resource allocation in cloud and distributed edge computing: A survey"}, {"paperId": "63fce9d0bb44ee8ee645b994d86769d85eecc8c4", "title": "A Survey of Blockchain and Artificial Intelligence for 6G Wireless Communications"}, {"paperId": "6e3eaaa7762dae124f98e1f7b06756968e5febab", "title": "A decentralized lightweight authentication protocol under blockchain"}, {"paperId": "d23769c8f77396c4b0b75f0762661a5bde94644a", "title": "Blockchain-based Data Trading in Edge-cloud Computing Environment"}, {"paperId": "795a44ae35dc569ed8455638f463d45dffb6168e", "title": "Blockchain-based solutions for cloud computing: A survey"}, {"paperId": "0452faa039d2709d0420949ca2a369b5e36abcf7", "title": "Computation offloading over multi-UAV MEC network: A distributed deep reinforcement learning approach"}, {"paperId": "55b72b1c72929eb1f6662e482f837d561f5639aa", "title": "Abnormal Detection of Cash-Out Groups in IoT Based Payment"}, {"paperId": "ab51735bdc917ba7e8b40c2c754550b5892e9fac", "title": "Long-term Auction for Inner-Dependent Task Offloading in Blockchain-Enabled Edge Computing"}, {"paperId": "624cde1fc7fe8b1f200aeceb190cfc97db0d75ef", "title": "A contract-based incentive mechanism for distributed meeting scheduling: Can agents who value privacy tell the truth?"}, {"paperId": "ce3dbfe801438c3e70d116b2f18ca1a055c1cabc", "title": "The convergence and interplay of edge, fog, and cloud in the AI-driven Internet of Things (IoT)"}, {"paperId": "fa8e56c0ff4da0f934ab1cf08e05cb9910ab460b", "title": "Teegraph: trusted execution environment and directed acyclic graph-based consensus algorithm for IoT blockchains"}, {"paperId": "c0393c740c7bb2e18957cf3905e5c10814195eb5", "title": "Applications of Auction and Mechanism Design in Edge Computing: A Survey"}, {"paperId": "237cbacd61b45a2614476a128b1817c369c5ff0d", "title": "Blockchain-enabled wireless communications: a new paradigm towards 6G"}, {"paperId": "51e2de8e7e5914d79ba6334f0c5b435760de24f1", "title": "Privacy-preserving incentive mechanism for multi-leader multi-follower IoT-edge computing market: A reinforcement learning approach"}, {"paperId": "1c1592e89e550ca25eebd7f861be74c879db50b4", "title": "Deep Reinforcement Learning-Based Task Scheduling in IoT Edge Computing"}, {"paperId": "3fdfcfd9fb08759ca8d030d017bcfbabb077f16b", "title": "Privacy-Preserving Dialogues Between Agents: A Contract-Based Incentive Mechanism for Distributed Meeting Scheduling"}, {"paperId": "7acae7d7462c4ee78e26e71553cd56897d012b6c", "title": "Convergence of Blockchain and Edge Computing for Secure and Scalable IIoT Critical Infrastructures in Industry 4.0"}, {"paperId": "f6d4d82357206a36ec3423314bae65913896bc1c", "title": "Hybrid Blockchain-Based Resource Trading System for Federated Learning in Edge Computing"}, {"paperId": "3ba9d429ad3128fff25419d7832477dec32fc658", "title": "NOMA-Enabled Cooperative Computation Offloading for Blockchain-Empowered Internet of Things: A Learning Approach"}, {"paperId": "21337ec307f5913c47b0990f132f94464815bb71", "title": "Secure and efficient mutual authentication protocol for smart grid under blockchain"}, {"paperId": "28009f3dafbe9256212e5b821261a60df49743d8", "title": "Loaning Decision for Electric Vehicles under Uncertain Electricity Price in the Blockchain Internet of Energy"}, {"paperId": "5abfe7926e5e19fb0b0ce322d064fb259ee359c2", "title": "COVID-19 Networking Demand: An Auction-Based Mechanism for Automated Selection of Edge Computing Services"}, {"paperId": "fc86c69fae0086556061e160217b823b102f4819", "title": "Transaction Throughput Provisioning Technique for Blockchain-Based Industrial IoT Networks"}, {"paperId": "08ce011a67a3c670bccd36c3ba8b331294198779", "title": "Smart Contract-based Hierarchical Auction Mechanism for Edge Computing in Blockchain-empowered IoT"}, {"paperId": "c7b4db7b061f8915f95faae9cdbb101d8b8031bd", "title": "A Survey of State-of-the-Art on Blockchains"}, {"paperId": "dea1615ace8847e0e5fc991d6d923c1f413cd2de", "title": "Real-Time Fault Detection for IIoT Facilities Using GBRBM-Based DNN"}, {"paperId": "5a425a65ff999fa3427ed3782ca43d328e2ceea7", "title": "Adaptive delay-constrained resource allocation in mobile edge computing for Internet of Things communications networks"}, {"paperId": "dd456294ba9ccaa34938cafa978fe60cbe530b06", "title": "A Multi-Dimensional Contract Approach for Data Rewarding in Mobile Networks"}, {"paperId": "ec19c0e09b45ff479fc4e4d9f022386cba13144e", "title": "Online Computation Offloading and Traffic Routing for UAV Swarms in Edge-Cloud Computing"}, {"paperId": "b33e51fc96ffb2b715a06c5565c770997e0accca", "title": "Toward Secure Data Sharing for the IoV: A Quality-Driven Incentive Mechanism With On-Chain and Off-Chain Guarantees"}, {"paperId": "fed5a58b61a272af94b6a7426e3a71d33db55ee8", "title": "Groupchain: Towards a Scalable Public Blockchain in Fog Computing of IoT Services Computing"}, {"paperId": "7e005db6af90f27eff5dedc5a973f666d19dc0af", "title": "Cloud/Edge Computing Service Management in Blockchain Networks: Multi-Leader Multi-Follower Game-Based ADMM for Pricing"}, {"paperId": "a782d592bf4b7c70faf2c833431611cfa85bc79a", "title": "Smart Contract-Based Long-Term Auction for Mobile Blockchain Computation Offloading"}, {"paperId": "e3e6b7caf2c861e9bea98fd3c7ed26b4dbc11512", "title": "Incentive Mechanism for Edge-Computing-Based Blockchain"}, {"paperId": "9afea6ab8d4bbe146ee8ecbb19ec090e2d01c7c5", "title": "Perishable Digital Goods Trading Mechanism for Blockchain- Based Vehicular Network"}, {"paperId": "b1df90df7b85c1e7ea8d85891c538371d9da2e8e", "title": "Device-Free Localization via Sparse Coding with Log-Regularizer"}, {"paperId": "f2b1279d0b9a5495427b0d1b22f8430c5f6673a9", "title": "Makespan-minimized computation offloading for smart toys in edge-cloud computing"}, {"paperId": "b815f782662787e121611e5a74b59047feca7efd", "title": "Integration of Blockchain and Cloud of Things: Architecture, Applications and Challenges"}, {"paperId": "4e9f643303064cea449c0ee2f9730698fd35aae6", "title": "Privacy-Preserved Task Offloading in Mobile Blockchain With Deep Reinforcement Learning"}, {"paperId": "6b02cc4b1f723192be61ff083de02ea2e8f9ad3f", "title": "Deep Reinforcement Learning for Offloading and Resource Allocation in Vehicle Edge Computing and Networks"}, {"paperId": "ac72fda6e12890c112cc1a4409c83543fdb2cb3a", "title": "Anonymous IoT Data Storage and Transaction Protocol Based on Blockchain and Edge Computing"}, {"paperId": "3a13326f6ac98dc4e4aec5812680624c30ad939b", "title": "Joint Computation Offloading and Coin Loaning for Blockchain-Empowered Mobile-Edge Computing"}, {"paperId": "bf932ba97b6e2645726f1302ede0056a230ccf0e", "title": "Optimal Pricing Mechanism for Data Market in Blockchain-Enhanced Internet of Things"}, {"paperId": "e72e1b3bd6d35fd666adf29ead5ce657481864a6", "title": "Online Deep Reinforcement Learning for Computation Offloading in Blockchain-Empowered Mobile Edge Computing"}, {"paperId": "832de807828d280e8d76a5b8470db7ef55c54288", "title": "Distributed Capacity Allocation of Shared Energy Storage Using Online Convex Optimization"}, {"paperId": "b5192b2c7b703d9af5b3bc3393bd75b7bcc00e62", "title": "A New Task Scheduling Framework for Internet of Things based on Agile VNFs On-demand Service Model and Deep Reinforcement Learning Method"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}, {"paperId": "c5c6c5392774aa752bd81c1f8199a0821a66c996", "title": "Deep reinforcement learning assisted edge-terminal collaborative offloading algorithm of blockchain computing tasks for energy Internet"}, {"paperId": "c1d5a6bccb9b82f28f302816358902d538f25612", "title": "A Blockchain-Assisted Trust Access Authentication System for Solid"}, {"paperId": "81ee420f49d2d342cb4b92f5fb9facfaabc571fd", "title": "A Permissioned Blockchain Based Feature Management System for Assembly Devices"}, {"paperId": "360251f471ad26fb45fb06cfd9fe5560c6d0fbeb", "title": "Blockchain-Based Participant Selection for Federated Learning"}, {"paperId": "43bcf53b90ec75b8ad1f62f4c4c3b2189e27e5b9", "title": "Path Planning and Control of Intelligent Delivery UAV Based on Internet of Things and Edge Computing"}]}
