{"paperId": "07e8ac289f0041e1d82741359bc1ec4149ceb030", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Community embeddings reveal large-scale cultural organization of online platforms", "abstract": "Optimism about the Internet's potential to bring the world together has been tempered by concerns about its role in inflaming the 'culture wars'. Via mass selection into like-minded groups, online society may be becoming more fragmented and polarized, particularly with respect to partisan differences. However, our ability to measure the cultural makeup of online communities, and in turn understand the cultural structure of online platforms, is limited by the pseudonymous, unstructured, and large-scale nature of digital discussion. Here we develop a neural embedding methodology to quantify the positioning of online communities along cultural dimensions by leveraging large-scale patterns of aggregate behaviour. Applying our methodology to 4.8B Reddit comments made in 10K communities over 14 years, we find that the macro-scale community structure is organized along cultural lines, and that relationships between online cultural concepts are more complex than simply reflecting their offline analogues. Examining political content, we show Reddit underwent a significant polarization event around the 2016 U.S. presidential election, and remained highly polarized for years afterward. Contrary to conventional wisdom, however, instances of individual users becoming more polarized over time are rare; the majority of platform-level polarization is driven by the arrival of new and newly political users. Our methodology is broadly applicable to the study of online culture, and our findings have implications for the design of online platforms, understanding the cultural contexts of online content, and quantifying cultural shifts in online behaviour.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "ArXiv", "volume": "abs/2010.00590"}, "authors": [{"authorId": "89922735", "name": "Isaac Waller"}, {"authorId": "32071555", "name": "Ashton Anderson"}], "citations": [{"paperId": "a3827e0691d7b8a371fb47aa6f686cc7f246bd47", "title": "Successive cohorts of Twitter users show increasing activity and shrinking content horizons"}, {"paperId": "ce881f9ce693917754211d09970fc2c755d908b7", "title": "Imagine All the People: Characterizing Social Music Sharing on Reddit"}, {"paperId": "4232d3afa9af02bf7aa6e77c23c6de1c20e45600", "title": "Divided We Rule: Influencer Polarization on Twitter During Political Crises in India"}, {"paperId": "106468b5de8ef18a4612962d5a3b3e19272900fa", "title": "Classification without (Proper) Representation: Political Heterogeneity in Social Media and Its Implications for Classification and Behavioral Analysis"}, {"paperId": "7524ec5184454f4ee3396747e43405d310fe2bc5", "title": "You are what you browse: A robust framework for uncovering political ideology"}]}
