{"paperId": "0804197198756df716dde3c4525da58ea7b0371a", "publicationVenue": {"id": "758df734-9f07-4673-955f-a9003ce1b998", "name": "Journal of Humanitarian Logistics and Supply Chain Management", "type": "journal", "alternate_names": ["J Humanit Logist Supply Chain Manag"], "issn": "2042-6747", "url": "https://www.emerald.com/insight/publication/issn/2042-6747", "alternate_urls": ["http://www.emeraldinsight.com/products/journals/journals.htm?id=jhlscm"]}, "title": "Performance management process integration in humanitarian supply chains: focusing on the natural disaster preparedness stage", "abstract": "\nPurpose\nThis study aims to explore how to apply and integrate the performance management (PM) process in humanitarian supply chains (HSCs) among and between humanitarian organizations (HOs) and donors so as to improve cost-efficiency (CE) and lead-time effectiveness (LTE) in the stage of natural disaster preparedness.\n\n\nDesign/methodology/approach\nThis study adapts and operationalizes a framework for the PM process used in commercial supply chains to assess HSCs. A multiple-case study with two types of actors – six HOs and three donors—is used to describe the applications of the PM process and analyze the level of integration between the actors.\n\n\nFindings\nThe activities in the PM process could sometimes be only vaguely described. Both actors emphasized improving CE, with less emphasis on LTE. Both actors have a low level of integration in each PM process activity, decreasing the CE and LTE. Therefore, guidelines for improving the level of PM process integration are provided.\n\n\nResearch limitations/implications\nTo the best of the authors’ knowledge, this study is one of the first to combine literature on HSCs and PM process integration, thereby contributing to both literature fields. The concrete contribution of this study is a framework for PM process application and integration among and between HOs and donors.\n\n\nPractical implications\nThe PM process framework can be used to assess PM process application, as well as current and increased level of integration, to improve CE and LTE. The current applications can also inspire other HOs and donors.\n\n\nOriginality/value\nPrevious studies indicate the lack of frameworks in the PM domain of HSCs, especially in the stage of natural disaster preparedness.\n", "venue": "Journal of Humanitarian Logistics and Supply Chain Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-11", "journal": {"name": "Journal of Humanitarian Logistics and Supply Chain Management"}, "authors": [{"authorId": "2006191293", "name": "Ester Lisnati Jayadi"}, {"authorId": "11755991", "name": "H. Forslund"}], "citations": []}
