{"paperId": "08080ae56ffb6b48b37c20285b0bd181f7255596", "publicationVenue": {"id": "647e2b25-1bff-4e4f-b507-e21dcb081788", "name": "IEEE International Requirements Engineering Conference", "type": "conference", "alternate_names": ["IEEE International Conference on Requirements Engineering", "RE", "IEEE Int Requir Eng Conf", "IEEE Int Conf Requir Eng"], "url": "http://requirements-engineering.org/"}, "title": "A Case Study of Building Shared Understanding of Non-Functional Requirements in a Remote Software Organization", "abstract": "Building a shared understanding of non-functional requirements (NFRs) is a known but understudied challenge in requirements engineering, especially in organizations that adopt continuous software engineering (CSE) practices. During the peak of the COVID-19 pandemic, many CSE organizations complied with working remotely due to the imposed health restrictions; some continued to work remotely while implementing business processes to facilitate team communication and productivity. In remote CSE organizations, managing NFRs becomes more challenging due to the limitations to team communication. While previous research has identified the factors that lead to a lack of shared understanding of NFRs in CSE, we still have a significant gap in understanding how CSE organizations, particularly in remote work, build a shared understanding of NFRs. We conduct a three-month ethnography-informed case study of a remote CSE organization. Through thematic analysis of our qualitative data from interviews and observations, we identify a number of practices for building a shared understanding of NFRs, such as validating NFRs through feedback. The collaborative workspace the organization uses for remote interaction is Gather, which simulates physical workspaces, and which our findings suggest allows for informal communications instrumental for building shared understanding. In addition, we describe the limitations to building a shared understanding of NFRs in the organization, such as gaps in communication and the limited understanding of customer context. As actionable insights, we discuss our findings in light of proactive practices that represent opportunities for software organizations to invest in building a shared understanding of NFRs in their development.", "venue": "IEEE International Requirements Engineering Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-18", "journal": {"name": "2022 IEEE 30th International Requirements Engineering Conference (RE)", "pages": "1-13"}, "authors": [{"authorId": "2165660239", "name": "Laura Okpara"}, {"authorId": "32400253", "name": "Colin M. Werner"}, {"authorId": "2056953347", "name": "Adam Murray"}, {"authorId": "1741744", "name": "D. Damian"}], "citations": [{"paperId": "75f73119ba86d24250d02a5050063d98108ae390", "title": "The role of informal communication in building shared understanding of non-functional requirements in remote continuous software engineering"}]}
