{"paperId": "081d117918d84a68d563c398d7d9a1843e09ae64", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An End-to-End Implementation of a Service-Oriented Architecture for Data-Driven Smart Buildings", "abstract": "Buildings connect with multiple information systems like Building Management Systems (BMS), Energy Management Systems (EMS), IoT devices, Building Information Models (BIM), the electricity grid, weather services, etc. Data-driven smart building software demands seamless integration of the above systems and their data. The lack of a system architecture with well-defined Application Programming Interfaces (APIs) poses a significant challenge for developing reusable, modular and scalable applications. This article presents a service-oriented system architecture designed with data-driven smart buildings in mind. The architecture relies on the Zachman framework and consists of seven service categories: 1) existing business applications, 2) new microservice-based applications, 3) databases, 4) integration software, 5) infrastructure services, 6) shared services, and 7) user interfaces. It closely resembles the MACH architectural principles: Microservices, API-first, Cloud-based components, and Headless principles. This architecture is implemented as a proof-of-concept, including three smart building applications. These include a Digital Twin application integrating sensor data with a BIM model, a web application merging real-time sensor data with semantic building graphs, and a data exploration tool using sensor data, the Brick ontology, and Grafana dashboards. Future implementations include real-time control applications such as Model Predictive Control (MPC). The proposed architecture and its implementations provide a blueprint for a reusable, modular, and scalable architecture in the smart building domain.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "117261-117281", "volume": "11"}, "authors": [{"authorId": "2222083695", "name": "Lasitha Chamari"}, {"authorId": "47596988", "name": "Ekaterina Petrova"}, {"authorId": "2260751859", "name": "Pieter Pauwels"}], "citations": [{"paperId": "b83293ce6bac4b54f2add9e6a0d836f7b5be7d77", "title": "Validation of technical requirements for a BIM model using semantic web technologies"}, {"paperId": "c6727e80b575966a850cd48c54a89e48ad1882a5", "title": "Exploiting microservices and serverless for Digital Twins in the cloud-to-edge continuum"}, {"paperId": "df6a97bf3149307bac8f81072e2516b538a81f5c", "title": "Designing End-to-End Web-Based Application Encryption with Asymmetric Encryption Using Waterfall Methodology"}, {"paperId": "3a5c3b0f890b80f3dd4505d731b4330db1638286", "title": "Smart Fire Safety Management System (SFSMS) Connected with Energy Management for Sustainable Service in Smart Building Infrastructures"}]}
