{"paperId": "0822f1f831832676967eb61c2fd8f54fddab1e59", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Dream Content Discovery from Reddit with an Unsupervised Mixed-Method Approach", "abstract": "Dreaming is a fundamental but not fully understood part of human experience that can shed light on our thought patterns. Traditional dream analysis practices, while popular and aided by over 130 unique scales and rating systems, have limitations. Mostly based on retrospective surveys or lab studies, they struggle to be applied on a large scale or to show the importance and connections between different dream themes. To overcome these issues, we developed a new, data-driven mixed-method approach for identifying topics in free-form dream reports through natural language processing. We tested this method on 44,213 dream reports from Reddit's r/Dreams subreddit, where we found 217 topics, grouped into 22 larger themes: the most extensive collection of dream topics to date. We validated our topics by comparing it to the widely-used Hall and van de Castle scale. Going beyond traditional scales, our method can find unique patterns in different dream types (like nightmares or recurring dreams), understand topic importance and connections, and observe changes in collective dream experiences over time and around major events, like the COVID-19 pandemic and the recent Russo-Ukrainian war. We envision that the applications of our method will provide valuable insights into the intricate nature of dreaming.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-09", "journal": {"name": "ArXiv", "volume": "abs/2307.04167"}, "authors": [{"authorId": "2181973810", "name": "Anubhab Das"}, {"authorId": "2164092496", "name": "Sanja vS'cepanovi'c"}, {"authorId": "2905635", "name": "L. Aiello"}, {"authorId": "40833883", "name": "Remington Mallett"}, {"authorId": "143697132", "name": "D. Barrett"}, {"authorId": "144041798", "name": "D. Quercia"}], "citations": []}
