{"paperId": "0825b7f9a72ea83298abb39c7b7d9a1613203f00", "publicationVenue": null, "title": "REAPS: Quasi-active Fault Tolerance for Big Data Publish-Subscribe Systems", "abstract": "In this paper, we address the challenges in supporting reliability and scalability in societal-scale notification systems that aim to reach large populations with customized alerts. We explore fault tolerance (FT) techniques in the context of Big Data Publish-Subscribe systems (BDPS), a scalable hierarchical architecture, that meshes big-data platforms (to store and operate on large volumes of data) with a distributed pub/sub broker network (to manage and communicate with a large number of end subscribers). The role of brokers in this architecture is critical since they serve to mediate interactions between subscribers and the backend big data system. We propose the REAPS (REliable Active Publish Subscribe) framework that can handle different classes of broker failures including randomized failures and geographically-correlated failures (as in a natural disaster). REAPS implements a low overhead fault tolerance service using a primary-backup approach; key features include the ability to exploit subscription similarity among brokers and techniques for quasi-active state replication to support fast recovery and delivery guarantees of notification services. We implement REAPS and conduct measurement studies on a prototype BDPS platform using real world usecases. We further evaluate REAPS under various failure scenarios to explore the scalability and performance of our proposed FT mechanisms via simulation studies.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "368-375"}, "authors": [{"authorId": "2110520945", "name": "Hang Nguyen"}, {"authorId": "2333370", "name": "Md Yusuf Sarwar Uddin"}, {"authorId": "1732742", "name": "N. Venkatasubramanian"}], "citations": []}
