{"paperId": "082cdd8235e2e7f358b8ce0a6ec581b0f6244eac", "publicationVenue": null, "title": "Automating Hadoop Cluster On Aws Cloud Using Terraform", "abstract": "Nowadays, companies need a lot of storage to store their data. Massive amounts of data can be stored with Hadoop. Studies show that by 2023, 90% of all Fortune 500 companies will have adopted Hadoop. However, it may take hours or even days to set up a Hadoop Cluster for storing data. When businesses manage their time well, they can consistently deliver their products and services on time. To make smart and calculated decisions, they need this data. Business forecasting is a practice that has been around for a long time, but in the past, it was often done with limited data. However, in today’s data-driven world, businesses must utilize data to make informed decisions and stay ahead of their competitors. By analyzing large amounts of data, businesses can make more accurate predictions and decisions about consumer preferences, market trends, and potential fraud activities. The insights gained from data analysis can benefit professionals across all industries, allowing them to make better decisions and improve their business outcomes.The main objective is to automate the formation of a Hadoop Cluster on AWS Cloud with the help of Terraform. The Hadoop Cluster will have the following nodes: Master Node, Slave Nodes, Client Nodes", "venue": "2023 International Conference on Networking and Communications (ICNWC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-05", "journal": {"name": "2023 International Conference on Networking and Communications (ICNWC)", "pages": "1-10"}, "authors": [{"authorId": "2218326884", "name": "Yadvi Bhalla"}, {"authorId": "2237916552", "name": "V. Hemamalini"}, {"authorId": "2112135099", "name": "Shashwat Mishra"}], "citations": [{"paperId": "629092a49374fb6b89e6f9e6f215a92c32195a5c", "title": "Terraform: Streamlining Infrastructure Deployment and Management Through Infrastructure as Code"}]}
