{"paperId": "084021b7d3e05411e6b6d5f7e3ac91722fb2121d", "publicationVenue": null, "title": "RIDIC: Real-Time Intelligent Transportation System With Dispersed Computing", "abstract": "Modern transportation big data features high Volume, Velocity, and Variety, making it more and more challenging to develop an intelligent transportation system for data analysis. Current transportation systems resort to cloud computing to deploy their applications but face two bottlenecks, lack of real-time processing and under-utilization of intelligent roadside devices. We observe that dispersed computing—an emerging paradigm of cloud computing—well fits the requirements of modern transportation systems. It provides real-time response by alleviating data transmission between data sources and cloud servers and fully utilizes smart devices by exploring their computing capacity. Therefore, we design RIDIC, an intelligent transportation system with dispersed computing to provide a real-time response when processing transportation big data. RIDIC abstracts all the heterogeneous smart roadside devices as actors, and its workflow consists of three stages, Actor Registration, Resource Application and Task Execution. We conduct experiments on two real-life traffic scenarios—road vehicle detection and traffic signal recognition—and the results show that RIDIC can utilize edge devices to process transportation big data faster while reducing the demand for device computing resources.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "1013-1022", "volume": "25"}, "authors": [{"authorId": "2152133015", "name": "Zinuo Cai"}, {"authorId": "49865500", "name": "Zebin Chen"}, {"authorId": "2205343156", "name": "Zihan Liu"}, {"authorId": "9326515", "name": "Quanmin Xie"}, {"authorId": "1840514", "name": "Ruhui Ma"}, {"authorId": "145676478", "name": "Haibing Guan"}], "citations": []}
