{"paperId": "08436b3ddafd2edc798753ebc87f6ceffed6e8df", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "KnowTuning: Knowledge-aware Fine-tuning for Large Language Models", "abstract": "Despite their success at many natural language processing (NLP) tasks, large language models (LLMs) still struggle to effectively leverage knowledge for knowledge-intensive tasks, manifesting limitations such as generating incomplete, non-factual, or illogical answers. These limitations stem from inadequate knowledge awareness of LLMs during vanilla fine-tuning. To address these problems, we propose a knowledge-aware fine-tuning (KnowTuning) method to explicitly and implicitly improve the knowledge awareness of LLMs. We devise an explicit knowledge-aware generation stage to train LLMs to explicitly identify knowledge triples in answers. We also propose an implicit knowledge-aware comparison stage to train LLMs to implicitly distinguish between reliable and unreliable knowledge, in three aspects: completeness, factuality, and logicality. Extensive experiments on both generic and medical question answering (QA) datasets confirm the effectiveness of KnowTuning, through automatic and human evaluations, across various sizes of LLMs. Finally, we demonstrate that the improvements of KnowTuning generalize to unseen QA datasets.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-17", "journal": {"name": "ArXiv", "volume": "abs/2402.11176"}, "authors": [{"authorId": "2141789994", "name": "Yougang Lyu"}, {"authorId": "1387839383", "name": "Lingyong Yan"}, {"authorId": "2237948548", "name": "Shuaiqiang Wang"}, {"authorId": "2185224690", "name": "Haibo Shi"}, {"authorId": "2243455567", "name": "Dawei Yin"}, {"authorId": "1749477", "name": "Pengjie Ren"}, {"authorId": "1721165", "name": "Zhumin Chen"}, {"authorId": "2265490493", "name": "M. D. Rijke"}, {"authorId": "2261862546", "name": "Zhaochun Ren"}], "citations": []}
