{"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System", "abstract": "Many modern workloads, such as neural networks, databases, and graph processing, are fundamentally memory-bound. For such workloads, the data movement between main memory and CPU cores imposes a significant overhead in terms of both latency and energy. A major reason is that this communication happens through a narrow bus with high latency and limited bandwidth, and the low data reuse in memory-bound workloads is insufficient to amortize the cost of main memory access. Fundamentally addressing this data movement bottleneck requires a paradigm where the memory system assumes an active role in computing by integrating processing capabilities. This paradigm is known as processing-in-memory (PIM). Recent research explores different forms of PIM architectures, motivated by the emergence of new 3D-stacked memory technologies that integrate memory with a logic layer where processing elements can be easily placed. Past works evaluate these architectures in simulation or, at best, with simplified hardware prototypes. In contrast, the UPMEM company has designed and manufactured the first publicly-available real-world PIM architecture. The UPMEM PIM architecture combines traditional DRAM memory arrays with general-purpose in-order cores, called DRAM Processing Units (DPUs), integrated in the same chip. This paper provides the first comprehensive analysis of the first publicly-available real-world PIM architecture. We make two key contributions. First, we conduct an experimental characterization of the UPMEM-based PIM system using microbenchmarks to assess various architecture limits such as compute throughput and memory bandwidth, yielding new insights. Second, we present PrIM (Processing-In-Memory benchmarks), a benchmark suite of 16 workloads from different application domains (e.g., dense/sparse linear algebra, databases, data analytics, graph processing, neural networks, bioinformatics, image processing), which we identify as memory-bound. We evaluate the performance and scaling characteristics of PrIM benchmarks on the UPMEM PIM architecture, and compare their performance and energy consumption to their modern CPU and GPU counterparts. Our extensive evaluation conducted on two real UPMEM-based PIM systems with 640 and 2,556 DPUs provides new insights about suitability of different workloads to the PIM system, programming recommendations for software designers, and suggestions and hints for hardware and architecture designers of future PIM systems.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "1388812849", "name": "Juan Gómez-Luna"}, {"authorId": "3077499", "name": "I. E. Hajj"}, {"authorId": "2061067079", "name": "Ivan Fernandez"}, {"authorId": "46175739", "name": "Christina Giannoula"}, {"authorId": "2173743", "name": "Geraldo F. Oliveira"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "c9ae624dfce78b72c4c01ff3941f06440f385ae3", "title": "Balanced Data Placement for GEMV Acceleration with Processing-In-Memory"}, {"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "505641490f56e0a0b67757a1f3a157bf5a62e97d", "title": "NeuPIMs: NPU-PIM Heterogeneous Acceleration for Batched LLM Inferencing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "9e98cd878653b68710d89248881433f95da35b4b", "title": "Accelerating Graph Neural Networks on Real Processing-In-Memory Systems"}, {"paperId": "4ab611b5d243af0a99c606af2760d0b1e3d64a68", "title": "GRONA : A Framework for Gather-and-Reduce On Near-Memory Accelerators"}, {"paperId": "087a11fd23bbbd9e1b90b493be7af6245837f391", "title": "PARAG: PIM Architecture for Real-Time Acceleration of GCNs"}, {"paperId": "9bb54e9d4a41ffe3110d45d1cfd974a7cfdf4da3", "title": "A Full-System Perspective on UPMEM Performance"}, {"paperId": "87c1cd5f11182a91b46e7cfd0f7ff9da6c4967a6", "title": "PIM-GPT: A Hybrid Process-in-Memory Accelerator for Autoregressive Transformers"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "f38ee0fca4be9d3eca3ee7fe0e50b92514c205d4", "title": "Special Session - Non-Volatile Memories: Challenges and Opportunities for Embedded System Architectures with Focus on Machine Learning Applications"}, {"paperId": "4e268759f57e64f59febafb0250071dee4a8cffe", "title": "Evaluating Homomorphic Operations on a Real-World Processing-In-Memory System"}, {"paperId": "3087096c98f918ce444101f44264f138d9cbf846", "title": "Overflow-free Compute Memories for Edge AI Acceleration"}, {"paperId": "dc582ed585c8e99f40089877e03dc9412a92d93a", "title": "GAPiM: Discovering Genetic Variations on a Real Processing-in-Memory System"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "5052dfc5f5ff83b4c88c2250c5e3f6f0ae1a9299", "title": "UpPipe: A Novel Pipeline Management on In-Memory Processors for RNA-seq Quantification"}, {"paperId": "9a7a09a1884b1b76aa606918d879253277a4d448", "title": "Retrospective: A Scalable Processing-in-Memory Accelerator for Parallel Graph Processing"}, {"paperId": "17fcde1229079fca6cb04fd48cc2ab5b4c75e7fa", "title": "Processing-in-Memory for Databases: Query Processing and Data Transfer"}, {"paperId": "ce4b7ec6c4a44de86a4dff80f7e396d921c541b3", "title": "pimDB: From Main-Memory DBMS to Processing-In-Memory DBMS-Engines on Intelligent Memories"}, {"paperId": "b89356d62d3fb25c453a111cb24353dd85225c55", "title": "Design and Analysis of a Processing-in-DIMM Join Algorithm: A Case Study with UPMEM DIMMs"}, {"paperId": "56b85672e02fb1800c2f7a529c756f8e4ce4e40a", "title": "Memory-Centric Computing"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "b1a63128955beced8dc22e47cd9aa843b2b26089", "title": "An Eight-Core RISC-V Processor With Compute Near Last Level Cache in Intel 4 CMOS"}, {"paperId": "40ca83439fd46cdcebc520351b8bb05c5a2f0be2", "title": "Adaptive Query Compilation with Processing-in-Memory"}, {"paperId": "9d41aa3b07d0c34dd94ac562ad143611fabd0f57", "title": "High-Performance and Scalable Agent-Based Simulation with BioDynaMo"}, {"paperId": "f6774d2f0b465e6624605d087bbc386c7b694712", "title": "CINM (Cinnamon): A Compilation Infrastructure for Heterogeneous Compute In-Memory and Compute Near-Memory Paradigms"}, {"paperId": "d6d4ca3a7af898732aee6ed32a26eef6f3dc04e3", "title": "ALP: Alleviating CPU-Memory Data Movement Overheads in Memory-Centric Systems"}, {"paperId": "e10c1f1636f814bf1c6dba94bbf2f4ca111b7fc3", "title": "Charge Transport inside TiO2 Memristors Prepared via FEBID"}, {"paperId": "7c44a09adfc412e2addfba16778b3a8b098bd7ae", "title": "Accelerating Irregular Applications via Efficient Synchronization and Data Access Techniques"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "126a59bef0700440808384b0bc7c0c4f4817f4de", "title": "High-performance and balanced parallel graph coloring on multicore platforms"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "18b490ae72be6ac08f13ce16c3c30b87acd9617c", "title": "IGZO CIM: Enabling In-Memory Computations Using Multilevel Capacitorless Indium–Gallium–Zinc–Oxide-Based Embedded DRAM Technology"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "db2c084e89d4740d84686d5859c2c9440b83cb1d", "title": "MATSA: An MRAM-Based Energy-Efficient Accelerator for Time Series Analysis"}, {"paperId": "0358743aa728c8913b08247731668cb201d9f8d8", "title": "SwiftRL: Towards Efficient Reinforcement Learning on Real Processing-In-Memory Systems"}]}
