{"paperId": "084b523847d526ce908f0799ded7cb6ce3842217", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "Characterizing Scheduling Delay for Low-Latency Data Analytics Workloads", "abstract": "Data analytics workloads are shifting to shorter task execution time, higher degree of parallelism, and execution on faster hardware. As a result, job scheduling is becoming a bottleneck, which needs to offer extreme low-latency, massive throughput, and high scalability. However, few efforts have been focused on systematically understanding the scheduling delay. In this paper, we propose a method and develop a tool, SD-checker, that decomposes the job scheduling delay into multiple components and characterizes each by extensive experiments. SDchecker extracts event messages through mining both cluster scheduler logs and application logs, and constructs a scheduling order graph for the ease of analysis. We use SDchecker to evaluate Spark-SQL on a popular cluster scheduler Yarn. Results show that the scheduling delay may account for 60% of the job runtime of small data analytics workloads. After decomposing the total scheduling delay, we find Spark itself contributes 70% of the delay. Through the evaluation and analysis, we conclude that (1) The causes of scheduling delay are determined by many factors, and (2) The job scheduling is not well optimized yet, and far from ideal for low-latency data analytics workloads.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-21", "journal": {"name": "2018 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "630-639"}, "authors": [{"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "40377061", "name": "Aidi Pi"}, {"authorId": "1891284", "name": "Shaoqi Wang"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}], "citations": [{"paperId": "d29e8643affd5d3ee99a8cdd1292bed7ffd38804", "title": "Memory at your service: fast memory allocation for latency-critical services"}, {"paperId": "cb520cf83b6b4fbbb896c4baea1831d1ac08222a", "title": "CERES: Container-Based Elastic Resource Management System for Mixed Workloads"}, {"paperId": "33aba3c5fff4e321b3e3ed14bd1c0c5f253af1d5", "title": "An Empirical Study of Inter-cluster Resource Orchestration within Federated Cloud Clusters"}, {"paperId": "1a725e6ebbcc4548c3f1ce16dc45157bb5034daa", "title": "OS-Augmented Oversubscription of Opportunistic Memory with a User-Assisted OOM Killer"}, {"paperId": "10bbf28d4ca11421ef61e64bfb2c3130a3987059", "title": "Pufferfish: Container-driven Elastic Memory Management for Data-intensive Applications"}, {"paperId": "6d7ae61c36b4a81bbd84d2fb9b7bb0c3645cd981", "title": "Bottleneck-Aware Task Scheduling Based on Per-Stage and Multi-ML Profiling"}, {"paperId": "127836fa57a52e649ebdef37a50fe0e36782d6e4", "title": "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems"}, {"paperId": "609902d394da0e57fe4def7b4911d2819df1266b", "title": "It Can Understand the Logs, Literally"}, {"paperId": "8c03332288c663ac80162dcccdd6ec4985ed44e2", "title": "Dependency-Aware Network Adaptive Scheduling of Data-Intensive Parallel Jobs"}, {"paperId": "77c5b87d12ffdc5e388a74f0b2f0113d310c1394", "title": "Adaptive Scheduling Parallel Jobs with Dynamic Batching in Spark Streaming"}, {"paperId": "5984417faa5310b24db1e446eecacd4d94b0eb0f", "title": "Profiling distributed systems in lightweight virtualized environments with logs and resource metrics"}, {"paperId": "131fa149215b0a8fc9e374ed9cf2c29ffa0fb20b", "title": "Draconis: Network-Accelerated Scheduling for Microsecond-Scale Workloads"}]}
