{"paperId": "08593bf9c1a57d0eef5960fd22f5ecdcd4906361", "publicationVenue": {"id": "5a68ad2a-9cc7-4970-b849-5c699810570d", "name": "Archives of Suicide Research", "type": "journal", "alternate_names": ["Arch Suicide Res"], "issn": "1381-1118", "url": "http://www.tandfonline.com/loi/usui20"}, "title": "What Do My (Online) Friends Think? A Topic Modeling Approach to Identifying Patterns of Response to Self-Injurious Behaviors on Reddit.", "abstract": "OBJECTIVE\nApproximately 17% of adolescents and young adults will engage in non-suicidal self-injury (NSSI) at least once in their lifetime, leading the World Health Organization to identify self-injury as one of the top five public health concerns for adolescents. Despite the widespread prevalence of this behavior, NSSI continues to be heavily stigmatized in both medical and community settings, deterring many engaged in NSSI from seeking informal support from friends and family as well as formal psychological or psychiatric treatment. In contrast to the low rates of in-person help-seeking for NSSI, online support groups are highly utilized by those engaged in NSSI. Thus, an empirical study of responses to frequent, voluntary disclosure of NSSI on social media is needed to better understand how these communities meet the needs of those who self-injure.\n\n\nMETHOD\nThe current project used latent Dirichlet allocation to identify frequent and favored themes in response to self-injury content in the largest self-injury group on Reddit (over 100,000 members). Reddit, the 9th most visited website in the world, is a chat-based social media platform that has 430+ million active users and billions of site visits, with current estimates suggesting that ∼63% of the U.S. population are Reddit users.\n\n\nRESULTS\nIdentified themes included: (1) recovery encouragement; (2) provision of social and instrumental support; and (3) daily realities of living with NSSI. Responses that encouraged recovery received more upvotes on Reddit than any other type of comment.\n\n\nCONCLUSION\nThese results can inform evidence-based, person-centered, dimensional treatments for NSSI.HIGHLIGHTSResponses to NSSI that encourage recovery resonated most with members of the group.Group members provided many social and instrumental NSSI supports to each other.Results provide insight into the real-time needs of those engaged in NSSI.", "venue": "Archives of Suicide Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-30", "journal": {"name": "Archives of suicide research : official journal of the International Academy for Suicide Research", "pages": "\n          1-17\n        "}, "authors": [{"authorId": "1471255623", "name": "Emma G. Preston"}, {"authorId": "152440967", "name": "A. West"}], "citations": [{"paperId": "bbb662afcd0d2e6293d653be3df5310ae32d60f6", "title": "Sharing is in fact about caring: Care concerns feature prominently in subreddits devoted to self-injurious thoughts and behaviors"}]}
