{"paperId": "087979a130fb1816fcc66958a33134556ef039cd", "publicationVenue": {"id": "b7696878-9521-4592-8205-198d53528bd2", "name": "Euromicro Symposium on Digital Systems Design", "type": "conference", "alternate_names": ["Digit Syst Des", "Euromicro Symp Digit Syst Des", "Digital Systems Design", "DSD"], "url": "http://www.wikicfp.com/cfp/program?id=762"}, "title": "Inference Time Reduction of Deep Neural Networks on Embedded Devices: A Case Study", "abstract": "From object detection to semantic segmentation, deep learning has achieved many groundbreaking results in recent years. However, due to the increasing complexity, the execution of neural networks on embedded platforms is greatly hindered. This has motivated the development of several neural network minimisation techniques, amongst which pruning has gained a lot of focus. In this work, we perform a case study on a series of methods with the goal of finding a small model that could run fast on embedded devices. First, we suggest a simple, but effective, ranking criterion for filter pruning called Mean Weight. Then, we combine this new criterion with a threshold-aware layer-sensitive filter pruning method, called T-sensitive pruning, to gain high accuracy. Further, the pruning algorithm follows a structured filter pruning approach that removes all selected filters and their dependencies from the DNN model, leading to less computations, and thus low inference time in lower-end CPUs. To validate the effectiveness of the proposed method, we perform experiments on three different datasets (with 3, 101, and 1000 classes) and two different deep neural networks (i.e., SICK-Net and MobileNet V1). We have obtained speedups of up to 13x on lower-end CPUs (Armv8) with less than 1% drop in accuracy. This satisfies the goal of transferring deep neural networks to embedded hardware while attaining a good trade-off between inference time and accuracy.", "venue": "Euromicro Symposium on Digital Systems Design", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-01", "journal": {"name": "2022 25th Euromicro Conference on Digital System Design (DSD)", "pages": "205-213"}, "authors": [{"authorId": "2199267326", "name": "Isma-Ilou Sadou"}, {"authorId": "1996108", "name": "Seyed Morteza Nabavinejad"}, {"authorId": "1713782", "name": "Zhonghai Lu"}, {"authorId": "2171762826", "name": "Masoumeh Ebrahimi"}], "citations": [{"paperId": "c51a2a0c3364b9ee0a4603614777f431365785ca", "title": "A Brief Review of the Performance of Energy-Based Models in Embedded Devices"}, {"paperId": "0687d4d5da9222d7d2ee84fdbe092585a1043e60", "title": "VeriCompress: A Tool to Streamline the Synthesis of Verified Robust Compressed Neural Networks from Scratch"}]}
