{"paperId": "0894814ae9f32ceca0a7dedebd0abcc4891789d2", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "UnFaaSener: Latency and Cost Aware Offloading of Functions from Serverless Platforms", "abstract": "We present UnFaaSener, a lightweight framework that enables serverless users to reduce their bills by harvesting non-serverless compute resources such as their VMs, on-premise servers, or personal computers. UnFaaSener is not a new serverless platform, nor does it require any support from today’s production serverless platforms. It uses existing pub/sub services as the glue between the serverless application and offloading hosts. UnFaaSener’s asynchronous scheduler takes into consideration the projected resource availability of the offloading hosts, various latency and cost components of server-less versus offloaded execution, the structure of the serverless application, and the developer’s QoS expectations to find the most optimal offloading decisions. These decisions are then stored to be retrieved and propagated through the execution flow of the serverless application. The system supports partial offloading at the resolution of each function and utilizes several design choices to establish confidence and adaptiveness. We evaluate the effectiveness of UnFaaSener for serverless applications with various structures. UnFaaSener was able to deliver cost savings of up to 89.8% based on the invocation pattern and the structure of the application, when we limited the offloading cap to 90% in our experiments.", "venue": "USENIX Annual Technical Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "879-896"}, "authors": [{"authorId": "2221243011", "name": "Ghazal Sadeghian"}, {"authorId": "1699596116", "name": "Mohamed Elsakhawy"}, {"authorId": "2221241545", "name": "Mohanna Shahrad"}, {"authorId": "2191730983", "name": "Joe Hattori"}, {"authorId": "2909388", "name": "Mohammad Shahrad"}], "citations": [{"paperId": "9f71c0968322585d41aa1523f896eb6f62d2860e", "title": "QoS-aware offloading policies for serverless functions in the Cloud-to-Edge continuum"}, {"paperId": "4aef67cc481b5ab9592b79db393ea019fbdd5ff7", "title": "Parrotfish: Parametric Regression for Optimizing Serverless Functions"}]}
