{"paperId": "0897a997966b3ee4c1a461d81e93a04f9120747c", "publicationVenue": {"id": "8f125553-3fd5-4370-a175-f7179db29048", "name": "IEEE International Performance, Computing, and Communications Conference", "type": "conference", "alternate_names": ["International Phoenix Conference on Computers and Communications", "IPCCC", "Int Phoenix Conf Comput Commun", "International Performance, Computing, and Communications Conference", "Int Perform Comput Commun Conf", "IEEE Int Perform Comput Commun Conf"], "url": "http://www.ipccc.org/"}, "title": "ATuMm: Auto-tuning Memory Manager in Apache Spark", "abstract": "Apache Spark is an in-memory analytic framework that has been adopted in the industry and research fields. Two memory managers, Static and Unified, are available in Spark to allocate memory for caching Resilient Distributed Datasets (RDDs) and executing tasks. However, we found that the static memory manager (SMM) lacks flexibility, while the unified memory manager (UMM) puts heavy pressure on the garbage collection of JVM on which Spark resides. To address these issues, we design an auto-tuning memory manager (ATuMm) to support dynamic memory allocation with the consideration of both memory demands and latency introduced by garbage collection. We implement our new memory manager in Spark 2.2.0 and evaluate it by conducting experiments in a real Spark cluster. Our experimental results show that our auto-tuning memory manager can reduce the total garbage collection time and thus further improve the performance (i.e., reduced latency) of Spark applications, compared to the existing Spark memory management solutions.", "venue": "IEEE International Performance, Computing, and Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 38th International Performance Computing and Communications Conference (IPCCC)", "pages": "1-8"}, "authors": [{"authorId": "1486100460", "name": "Danlin Jia"}, {"authorId": "143813178", "name": "J. Bhimani"}, {"authorId": "2056326979", "name": "Son Nam Nguyen"}, {"authorId": "143780159", "name": "B. Sheng"}, {"authorId": "145154819", "name": "N. Mi"}], "citations": [{"paperId": "4c92fe20907e90a166691948d8e9817c442eb461", "title": "Memory management optimization strategy in Spark framework based on less contention"}, {"paperId": "0663c53cca69d69b10f85e1d832b974eeee0ff47", "title": "Performance Evaluation Analysis of Spark Streaming Backpressure for Data-Intensive Pipelines"}, {"paperId": "269440df46d18993bbe05e8667139a7943400dfd", "title": "A Note on Distributed Quantile Regression by Pilot Sampling and One-Step Updating"}, {"paperId": "2108e27dce37168cbabcefd9e6616079038eed69", "title": "RITA: Efficient Memory Allocation Scheme for Containerized Parallel Systems to Improve Data Processing Latency"}, {"paperId": "03cf73dc6a02aa4baf15c5053f1e21e3fcfb6050", "title": "OneStopTuner: An End to End Architecture for JVM Tuning of Spark Applications"}]}
