{"paperId": "08a08ddbd9c3c4e8b178f496e141eb918971f495", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Machine Learning Empowered Intelligent Data Center Networking: A Survey", "abstract": "To support the needs of ever-growing cloud-based services, the number of servers and network devices in data centers is increasing exponentially, which in turn results in high complexities and difficulties in network optimization. To address these challenges, both academia and industry turn to artificial intelligence technology to realize network intelligence. To this end, a considerable number of novel and creative machine learning-based (ML-based) research works have been put forward in recent few years. Nevertheless, there are still enormous challenges faced by the intelligent optimization of data center networks (DCNs), especially in the scenario of online real-time dynamic processing of massive heterogeneous services and traffic data. To best of our knowledge, there is a lack of systematic and original comprehensively investigations with in-depth analysis on intelligent DCN. To this end, in this paper, we comprehensively investigate the application of machine learning to data center networking, and provide a general overview and in-depth analysis of the recent works, covering flow prediction, flow classification, load balancing, resource management, routing optimization, and congestion control. In order to provide a multi-dimensional and multi-perspective comparison of various solutions, we design a quality assessment criteria called REBEL-3S to impartially measure the strengths and weaknesses of these research works. Moreover, we also present unique insights into the technology evolution of the fusion of data center network and machine learning, together with some challenges and potential future research opportunities.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-28", "journal": {"name": "ArXiv", "volume": "abs/2202.13549"}, "authors": [{"authorId": "71788673", "name": "Bo Li"}, {"authorId": "2155389967", "name": "Ting Wang"}, {"authorId": "2156653926", "name": "Peng Yang"}, {"authorId": "2134563054", "name": "Mingsong Chen"}, {"authorId": "2116619185", "name": "Shui Yu"}, {"authorId": "153521546", "name": "Mounir Hamdi"}], "citations": [{"paperId": "305b2cc3bc2f2e00b26eca05a723c9f6cea4dc0a", "title": "Blocking Island Paradigm Enhanced Intelligent Coordinated Virtual Network Embedding Based on Deep Reinforcement Learning"}, {"paperId": "cc0988f0527d9c9d55b9bf1ba1a392a86718cbdf", "title": "Energy-Efficient Data Center Network Infrastructure With Network Switch Refresh Model"}]}
