{"paperId": "08b05bd51dd40112829405861787f8596d967ec7", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Generating accurate negative samples for landslide susceptibility mapping: A combined self-organizing-map and one-class SVM method", "abstract": "The accuracy of data-driven landslide susceptibility mapping (LSM) is closely affected by the quality of non-landslide samples. This research proposes a method combining a self-organizing-map (SOM) and a one-class SVM (SOM-OCSVM) to generate more reasonable non-landslide samples. We designed two steps: first, a random selection, a SOM network, a one class SVM model, and a SOM-OCSVM model were used to generate non-landslide sample datasets. Second, four machine learning models (MLs)—namely logistic regression (LRG), multilayer perceptron (MLP), support vector machine (SVM), and random forest (RF)—were used to verify the effects of four non-landslide sample datasets on LSM. From the region along the Sichuan-Tibet Highway, we selected 11 conditioning factors and 1186 investigated landslides to perform the aforementioned experiments. The results show that the SOM-OCSVM method achieves the highest AUC (>0.94) and minimum standard deviation (<0.081) compared with other methods. Moreover, RF achieves the best performance in different datasets compared with other ML models. The aforementioned results prove that the proposed method can enhance the performance of ML models to produce more reliable LSM.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-16", "journal": {"volume": "10"}, "authors": [{"authorId": "9197228", "name": "C. Ye"}, {"authorId": "2000201145", "name": "Rongchai Tang"}, {"authorId": "2135375399", "name": "Rui-long Wei"}, {"authorId": "2149261994", "name": "Zixuan Guo"}, {"authorId": "2108546854", "name": "Huajun Zhang"}], "citations": [{"paperId": "39f63afa187cbb388cd7155c71335466d862898a", "title": "Machine learning for high-resolution landslide susceptibility mapping: case study in Inje County, South Korea"}, {"paperId": "675835c6eb7dcff8f985a84142fb0c8f38747680", "title": "Refined landslide susceptibility mapping in township area using ensemble machine learning method under dataset replenishment strategy"}, {"paperId": "9c0f708e0801af16ce66f0277464fc149340d4e8", "title": "Self-Organizing Control Systems for Nonlinear Spacecraft in the Class of Structurally Stable Mappings"}]}
