{"paperId": "08b300602400c4af82251189254e9f568ab5ed97", "publicationVenue": {"id": "fd3e045b-a11e-468c-a1ba-1f222f6f50b8", "name": "Modern Network technologies", "type": "conference", "alternate_names": ["MoNeTec", "Mod Netw technol"]}, "title": "Towards Fast and Flexible Simulation of Cloud Resource Management", "abstract": "Resource management, including the allocation of resources of physical machines to virtual machines, is a critical part of operating the modern large-scale cloud infrastructures. This is an active area of research with many problem statements and remaining challenges. The research efficiency in this area is hampered by the lack of general, flexible and performant frameworks for realistic simulation of IaaS clouds. To address this issue we have developed DSLab IaaS - a simulation framework that implements a model of IaaS infrastructure, including all the main components needed to study the VM allocation problems and evaluate the proposed solutions. The unique feature of the framework is support for modeling of multiple concurrent VM schedulers operating on local, asynchronously updated copies of resource pool state. The framework is extensible by supporting the user-defined VM placement and migration algorithms and models for VM load and host energy consumption. The framework also facilitates the use of currently available cloud traces. The framework has been evaluated on several examples and has demonstrated simulation performance and scalability significantly surpassing the state-of-the-art solution thereby enabling the modeling of resource management in modern large-scale cloud infrastructures.", "venue": "Modern Network technologies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-27", "journal": {"name": "2022 International Conference on Modern Network Technologies (MoNeTec)", "pages": "1-8"}, "authors": [{"authorId": "3321055", "name": "O. Sukhoroslov"}, {"authorId": "2192867404", "name": "Andrey Vetrov"}], "citations": []}
