{"paperId": "08bf0e85538c7b0cc6b76e3245d7798124633cb4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Test Suite Reduction via Evolutionary Clustering", "abstract": "Test suite reduction is an effective way to reduce the cost of regression testing by identifying and removing redundant test cases from the original test suite. In this paper, we propose a novel cluster test suite reduction using an evolutionary multi-objective optimization algorithm. Specifically, we use a K-means algorithm to group similar test cases to the same cluster. Then the evolutionary algorithm is used to remove redundant test cases based on the clustering results, and optimization objects are represented as the coverage-related criteria, fault-related criteria and cost-related criteria. The experimental results involving eight subject programs show that the proposed method can outperform the other three state-of-the-arts with respect to both fault detection (4.61% −9.44%) and reduction ratio (4.10% −10.64%). Meanwhile, the experiments also prove that our method has a better performance of missing failure rate (0.049% −0.132%) and code coverage rate (3.34% −6.10%). Besides, the proposed method costs are found to be comparable to the other techniques.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "28111-28121", "volume": "9"}, "authors": [{"authorId": "50436406", "name": "Chunyan Xia"}, {"authorId": "2152821373", "name": "Yan Zhang"}, {"authorId": "2175781", "name": "Zhan-wei Hui"}], "citations": [{"paperId": "c1cd6f7863495f2d923aa3c67c3aaff2aa353148", "title": "ENHANCED REGRESSION TESTING EXECUTION PROCESS USING TEST SUITE REDUCTION TECHNIQUES AND PARALLEL EXECUTION"}, {"paperId": "4a4a3d1e3bb97680bd69295bd07d1bcddfb9462a", "title": "Generating Autonomous Driving Safety Violation Scenarios Based on Multi-Objective Optimization"}, {"paperId": "564cd336575e75c10391bbb7f567092900d864e3", "title": "Conceptual Mutation Testing for Student Programming Misconceptions"}, {"paperId": "5fadef4a4599156d40b4d70b93868f5fa4d3fe48", "title": "A lightweight adaptive random testing method for deep learning systems"}, {"paperId": "567e9f9696da1b2b62f0d2956a61392642c864b5", "title": "Achieving Agility in Projects Through Hierarchical Divisive Clustering Algorithm"}, {"paperId": "c7f968a51d159c34a8acafa26db59d3f966096b4", "title": "To test, or not to test: A proactive approach for deciding complete performance test initiation"}, {"paperId": "9704cff2633b35d71332ea72c68de1893cb570c8", "title": "Performance Evaluation of “Ga-Fc” Technique for Aspect-Oriented Software System"}, {"paperId": "8a08d503bc79f1dc70875b19bcd87594367200fb", "title": "BRTSRDM: Bi-Criteria Regression Test Suite Reduction based on Data Mining"}, {"paperId": "35eb3f9399cf8faf8be5f7177ccaa45dcb06454f", "title": "AN ENHANCED APPROACH FOR TEST SUITE REDUCTION USING CLUSTERING AND GENETIC ALGORITHMS"}]}
