{"paperId": "08c05f86b4528144c1d90f49ef16149fe88562e7", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Locality-Preserving Spatial Partitioning for Geo Big Data Analytics in Main Memory Frameworks", "abstract": "The easily reachable IoT edge devices have caused the accumulation of vast amounts of geo-referenced data traces that can help in performing deep insightful analytics. Geospatial data in real geometries are normally clumped into batches and has strong autocorrelation properties which can be exploited in discovering interesting insights. Current plain Cloud computing frameworks are not attuned to the shape of data. Most importantly, data splitting is an important precursor in data parallelization mechanisms. Current systems mostly focus on general data workloads, thus are giving attention mostly to load balancing while splitting the data to Cloud computing resources. However, many benefits can be reaped by being attuned to the spatial characteristics while distributing the data, thus striking a plausible balance between load balancing and spatial data locality preservation normally leads to achieving better time-based QoS goals, which then leads to an optimized provisioning of Cloud computing resources. In this paper, we have designed a spatial batch processing engine that comprises a custom spatial data locality aware partitioning method for disseminating spatial data loads in Cloud computing clusters. We have also extended a state-of-art benchmark density-based clustering method that is known as DBSCAN-MR and implemented a standard compliant prototype on top of a best-in-breed de facto Cloud-based main memory processing framework, Apache Spark. Our results show that our partitioning method with the associated spatial query optimizers can achieve gains that significantly outperform baselines", "venue": "Global Communications Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "GLOBECOM 2020 - 2020 IEEE Global Communications Conference", "pages": "1-6"}, "authors": [{"authorId": "51980690", "name": "I. M. A. Jawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": [{"paperId": "7424e30c0d6f508c30691d5864a5da9a8c667cd6", "title": "Cost-Effective Approximate Aggregation Queries on Geospatial Big Data"}, {"paperId": "4dc40e5bf500b8bc891d5876ff76ddde78ec9328", "title": "Efficient Generation of Approximate Region-based Geo-maps from Big Geotagged Data"}, {"paperId": "e352fb2100f198f38e24d00d2cce1db57f127c00", "title": "Driving Maneuver Anomaly Detection Based on Deep Auto-Encoder and Geographical Partitioning"}, {"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "title": "Efficient Geospatial Analytics on Time Series Big Data"}, {"paperId": "bb65087238adf9cbb0eb024b0cfcf88293f546f3", "title": "Efficiently Integrating Mobility and Environment Data for Climate Change Analytics"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams"}]}
