{"paperId": "08c4f47ee5d7b41dafa05426119b6c39bbf22d80", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Exploring the Path of Teacher Team Building for Innovation and Entrepreneurship in Colleges and Universities in the Information Age", "abstract": "\n With the in-depth promotion of education informatization, colleges and universities focus on developing innovation and entrepreneurship education and are committed to cultivating talents with innovative spirit and technology, which has become the key to the reform of higher education. This article profoundly analyzes the characteristics of the current innovation and entrepreneurship education teacher team, and proceeds to optimize and build a dual-creative teacher team with information literacy. Aiming at the construction effect of this path, the article constructs an evaluation index system of the construction effect of the dual-creation teacher team from multiple aspects. It combines the Kernel Partial Least Squares (KPLS) and Particle Swarm Optimization Algorithm (PSO) to empower the indexes to assess the effectiveness of the construction path. The research analysis shows that the proposed faculty building path effectively promotes the rejuvenation of the faculty team, and the percentage of teachers under 35 years old rises to 34%, significantly improving teachers’ acceptance of new things. Regarding teaching results, the weight of students’ participation in entrepreneurial practice reaches 0.146. The weight of filing innovation patents is 0.101. The results show that the construction path has a positive impact on improving the faculty team’s teaching quality and students’ innovation ability.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2289499216", "name": "Haizhu Gao"}], "citations": []}
