{"paperId": "08c83241e3a788c43eb01b5d1ce796fc3da323f5", "publicationVenue": {"id": "73585779-8f95-43d4-be17-c74ed16aebd9", "name": "Journal of Software", "type": "journal", "alternate_names": ["J Softw"], "issn": "1796-217X", "url": "http://www.academypublisher.com/jsw/", "alternate_urls": ["http://www.jsoftware.us/"]}, "title": "Framework of Intelligent System for Machine Learning Algorithm Selection in Social Sciences", "abstract": "The ability to generate data has never been as powerful as today when three quintile bytes of data are generated daily. In the field of machine learning, a large number of algorithms have been developed, which can be used for intelligent data analysis and to solve prediction and descriptive problems in different domains. Developed algorithms have different effects on different problems.If one algorithmworks better on one dataset,the same algorithm may work worse on another data set. The reason is that each dataset has different features in terms of local and global characteristics. It is therefore imperative to know intrinsic algorithms behavior on different types of datasets andchoose the right algorithm for the problem solving. To address this problem, this papergives scientific contribution in meta learning field by proposing framework for identifying the specific characteristics of datasets in two domains of social sciences:education and business and develops meta models based on: ranking algorithms, calculating correlation of ranks, developing a multi-criteria model, two-component index and prediction based on machine learning algorithms. Each of the meta models serve as the basis for the development of intelligent system version. Application of such framework should include a comparative analysis of a large number of machine learning algorithms on a large number of datasetsfromsocial sciences.", "venue": "Journal of Software", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "J. Softw.", "pages": "21-28", "volume": "17"}, "authors": [{"authorId": "1702910", "name": "D. Oreški"}], "citations": [{"paperId": "74ab68e882b0748ce10e53a6651117e5ac009c2b", "title": "Comparative Analysis of Machine Learning Algorithms on Data Sets of Different Characteristics for Digital Transformation"}, {"paperId": "ebf15f6af570293070615f2b3933936519fc81cb", "title": "Implementation of Comprehensive Ability Evaluation System for Business Comprehensive Ability Evaluation Based on Intelligent Algorithm"}]}
