{"paperId": "08d218946f0ecf523307b007db3c75faa02af9c0", "publicationVenue": {"id": "589ed020-784b-47ac-884d-9c6ae29fd509", "name": "International Conference Intelligent Computing and Control Systems", "type": "conference", "alternate_names": ["ICICCS", "Int Conf Intell Comput Control Syst"]}, "title": "Employing the SMOTE Technique, a Machine Learning Model for Predicting Student Grades", "abstract": "Predicting a student’s academic grade and performance prediction is a complex task in the educational sector especially in India because of the large volumes of datasets. To check and analyze a student’s performance and progress, a novel system should be developed to monitor the results based on the given data. No such technology currently exists in the Higher education system in India. Different institutions analyze the progress of a student based on different criteria and also follow their methods. The reason for this was that the people do not have much knowledge about the techniques that existed initially and they do not know how they are going to work effectively and even they cannot analyze the best way is also the main reason. Prediction mainly depends on some factors are the details of the students that related to their academic performance which includes the course details and proper investigation of the factors leading to better analysis of the results. For that reason, we proposed a prediction model for multiclass that helps to remove the problem of overfitting and misclassification of the factors, which gives outcomes developed by an unbalanced multi-classification technique based on oversampling which is SMOTE i.e., Synthetic Minority Oversampling. SMOTE includes feature nomination methods. This proposed model helps to get accurate results and reduces the chance of misleading and misclassification problems and enhances both performances of analyzing the student grades.", "venue": "International Conference Intelligent Computing and Control Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-17", "journal": {"name": "2023 7th International Conference on Intelligent Computing and Control Systems (ICICCS)", "pages": "349-354"}, "authors": [{"authorId": "1484219510", "name": "P. Vaishnavi"}, {"authorId": "73938638", "name": "C. Prathima"}, {"authorId": "2215021873", "name": "Vasa Rakesh"}, {"authorId": "2101100854", "name": "P. Sujala"}, {"authorId": "2219805166", "name": "P. A. Nitin"}, {"authorId": "2219806703", "name": "D. R. K. Yadav"}], "citations": []}
