{"paperId": "08d82903ac1872bc64da00735d14610bdd960e69", "publicationVenue": {"id": "f9c347c4-4367-4a5f-a2bf-942aba8f9a4c", "name": "AIMS Electronics and Electrical Engineering", "alternate_names": ["AIM Electron Electr Eng"], "issn": "2578-1588", "url": "http://www.aimspress.com/journal/ElectronEng"}, "title": "A systematic review of data pre-processing methods and unsupervised mining methods used in profiling smart meter data", "abstract": "\n The evolution of smart meters has led to the generation of high-resolution time-series data - a stream of data capable of unveiling valuable knowledge from consumption behaviours for different applications. The ability to extract hidden knowledge from such massive amounts of data requires that it be analysed intelligently. Hence, for a clear representation of the various consumption behaviours of consumers, a good number of data mining technologies are usually employed. This paper presents a systematic review of the various data mining techniques and methodologies employed while profiling energy data streams. The review identifies the strengths and shortcomings of existing data mining methods as applied in research, focusing more on data processing techniques and load clustering. Also discussed are data mining methods used to profile consumption data, their pros and cons. It was inferred during the research that the choice of data mining technique employed is highly dependent on the application it is intended for and the intrinsic nature of the dataset.\n", "venue": "AIMS Electronics and Electrical Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "AIMS Electronics and Electrical Engineering"}, "authors": [{"authorId": "1755012", "name": "F. Dahunsi"}, {"authorId": "2087767128", "name": "A. Olawumi"}, {"authorId": "51057092", "name": "D. T. Ale"}, {"authorId": "8766696", "name": "O. Sarumi"}], "citations": [{"paperId": "6d43d19497f382787955945e6e2c0a698f168d53", "title": "Intelligent deep learning techniques for energy consumption forecasting in smart buildings: a review"}, {"paperId": "569421a67ddf3e0bffd4959fcdb7e794344969ea", "title": "Quantifying Potential Power Savings from Household Appliance Consumption Data: A Methodological Approach and Estimated Results"}, {"paperId": "c50979e0d9cd2438e78808a8c44348171d1e34d9", "title": "A reduced-dimension feature extraction method to represent retail store electricity profiles"}, {"paperId": "a018fb8a8170d037dbdbd51cef2317361394af65", "title": "Artificial Load Profiles and PV Generation in Renewable Energy Communities Using Generative Adversarial Networks"}]}
