{"paperId": "08dac48d632b3d97a5b853c250f6a0274c00b2b3", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "All That's Happening behind the Scenes: Putting the Spotlight on Volunteer Moderator Labor in Reddit", "abstract": "Online volunteers are an uncompensated yet valuable labor force for many social platforms. For example, volunteer content moderators perform a vast amount of labor to maintain online communities. However, as social platforms like Reddit favor revenue generation and user engagement, moderators are under-supported to manage the expansion of online communities. To preserve these online communities, developers and researchers of social platforms must account for and support as much of this labor as possible. In this paper, we quantitatively characterize the publicly visible and invisible actions taken by moderators on Reddit, using a unique dataset of private moderator logs for 126 subreddits and over 900 moderators. Our analysis of this dataset reveals the heterogeneity of moderation work across both communities and moderators. Moreover, we find that analyzing only visible work – the dominant way that moderation work has been studied thus far – drastically underestimates the amount of human moderation labor on a subreddit. We discuss the implications of our results on content moderation research and social platforms.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-28", "journal": {"pages": "584-595"}, "authors": [{"authorId": "47892132", "name": "Hanlin Li"}, {"authorId": "32980371", "name": "Brent J. Hecht"}, {"authorId": "2510840", "name": "Stevie Chancellor"}], "citations": [{"paperId": "2c5a0c58a6242a9ea35bc431c92ee5dc8c076881", "title": "Designing Sousveillance Tools for Gig Workers"}, {"paperId": "2590e4fe6886b76d263124b744ac6d5f1a531677", "title": "TrustRate: A Decentralized Platform for Hijack-Resistant Anonymous Reviews"}, {"paperId": "0e53c89da6a244fcead452632cab5f5c7965db75", "title": "A Study of Partisan News Sharing in the Russian invasion of Ukraine"}, {"paperId": "f576fb7827a25e0e5deae045527f93b06b2e705d", "title": "Peer Produced Friction: How Page Protection on Wikipedia Affects Editor Engagement and Concentration"}, {"paperId": "fca13e368183669d9b07c743bd8b241a9ad7caac", "title": "Cura: Curation at Social Media Scale"}, {"paperId": "7d7d70cdc1c954157fefff35a1a38557167369bf", "title": "Time-Series Clustering for Determining Behavioral-Based Brand Loyalty of Users Across Social Media"}, {"paperId": "f5426ebd3f92fccba31774a440ac60fc748655fc", "title": "Motives for Using Reddit Social Media on Members of the r/Indonesia Community"}, {"paperId": "0b4637c42260a3b7e966dbb671f01b2789dc69fc", "title": "Towards Intersectional Moderation: An Alternative Model of Moderation Built on Care and Power"}, {"paperId": "412ac5d9b01b66bd865010be03d78b58fd2b4da5", "title": "Operationalizing content moderation \"accuracy\" in the Digital Services Act"}, {"paperId": "7ed739ce9628f793d87c82903feb2812d69b5c82", "title": "Ignoring As a Moderation Strategy for Volunteer Moderators on Twitch"}, {"paperId": "a72927297e0e50940b03231a2b46b493bf086239", "title": "AppealMod: Inducing Friction to Reduce Moderator Workload of Handling User Appeals"}, {"paperId": "3db4d1d7a42320d998beaaf53ecada614e6ee541", "title": "Measuring the Monetary Value of Online Volunteer Work"}, {"paperId": "20048bad93f8f9380b0f96dbaadef0b7b01d968f", "title": "AppealMod: Shifting Effort from Moderators to Users Making Appeals"}]}
