{"paperId": "08ddc35d9d5819f25f85d4615b89722332434950", "publicationVenue": null, "title": "Block Chain based Government Tender Allocation in Cloud", "abstract": "Government and public area substances all throughout the planet are effectively investigating better approaches to stay aware of innovative headways to accomplish keen administration, work effectiveness, and cost improvement. Square chain innovation is an illustration of such innovation that has been drawing in the consideration of Governments across the globe lately. Upgraded security, further developed discernibility and most reduced expense foundation enable the square chain to enter different spaces. By and large, legislatures discharge Tenders to some outsider associations for various activities. During this cycle, different competitors endeavor to tune in the fragile potential gains of others to win the sensitive. The corrupt government specialists furthermore charge significant compensation off to pass the fragile for some specific outsider. This paper implies protected and straightforward system using blockchain for government Tenders. Square chain is used as a secured and changeless information construction to store the public power records that are exceptionally helpless to altering. This work intends to make a straightforward and secure edge processing foundation for the process in tenders of government to execute plans and approaches by restricting oversight of the human to the insignificant.", "venue": "2022 8th International Conference on Advanced Computing and Communication Systems (ICACCS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-03-25", "journal": {"name": "2022 8th International Conference on Advanced Computing and Communication Systems (ICACCS)", "pages": "1376-1380", "volume": "1"}, "authors": [{"authorId": "9124377", "name": "K. M. Majidha Fathima"}, {"authorId": "2168962892", "name": "Bavin Kumar R"}, {"authorId": "2168674541", "name": "Hari Vishal J"}, {"authorId": "2291751739", "name": "R. Dhanush"}], "citations": []}
