{"paperId": "08e21de9e8a83ca182e763ff1bc4347b502ea7b3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Rate-Efficiency and Straggler-Robustness through Partition in Distributed Two-Sided Secure Matrix Computation", "abstract": "Computationally efficient matrix multiplication is a fundamental requirement in various fields, including and particularly in data analytics. To do so, the computation task of a large-scale matrix multiplication is typically outsourced to multiple servers. However, due to data misusage at the servers, security is typically of concern. In this paper, we study the two-sided secure matrix multiplication problem, where a user is interested in the matrix product $\\boldsymbol{AB}$ of two finite field private matrices $\\boldsymbol{A}$ and $\\boldsymbol{B}$ from an information-theoretic perspective. In this problem, the user exploits the computational resources of $N$ servers to compute the matrix product, but simultaneously tries to conceal the private matrices from the servers. Our goal is twofold: (i) to maximize the communication rate, and, (ii) to minimize the effective number of server observations needed to determine $\\boldsymbol{AB}$, while preserving security, where we allow for up to $\\ell\\leq N$ servers to collude. To this end, we propose a general aligned secret sharing scheme for which we optimize the matrix partition of matrices $\\boldsymbol{A}$ and $\\boldsymbol{B}$ in order to either optimize objective (i) or (ii) as a function of the system parameters (e.g., $N$ and $\\ell$). A proposed inductive approach gives us analytical, close-to-optimal solutions for both (i) and (ii). With respect to (i), our scheme significantly outperforms the existing scheme of Chang and Tandon in terms of (a) communication rate, (b) maximum tolerable number of colluding servers and (c) computational complexity.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-30", "journal": {"name": "ArXiv", "volume": "abs/1810.13006"}, "authors": [{"authorId": "145031304", "name": "Jaber Kakar"}, {"authorId": "81686981", "name": "Seyedhamed Ebadifar"}, {"authorId": "144401550", "name": "A. Sezgin"}], "citations": [{"paperId": "d0ccbc1b2a0f03cd90a94a902152eed8060e45cb", "title": "Sparsity and Privacy in Secret Sharing: A Fundamental Trade-Off"}, {"paperId": "f7d28c47fdd51594a59165ae2c6446e2b84711dd", "title": "Distributed Matrix-Vector Multiplication with Sparsity and Privacy Guarantees"}, {"paperId": "eb454e96b241a8a3997c93836f01c95043b7f9e0", "title": "Secure Private and Adaptive Matrix Multiplication Beyond the Singleton Bound"}, {"paperId": "8ccfcfaadb7afdb450ffb187aecbe03db2de809f", "title": "Private Retrieval, Computing, and Learning: Recent Progress and Future Challenges"}, {"paperId": "29b388505fdd739d20ae212b36919bf3673d4591", "title": "Bivariate Polynomial Codes for Secure Distributed Matrix Multiplication"}, {"paperId": "a5a08f9ea835bb91be04e0e9bfe9984fd8649627", "title": "Speeding Up Private Distributed Matrix Multiplication via Bivariate Polynomial Codes"}, {"paperId": "10deb795f1c25e492214339c87a32e31d1378012", "title": "Adaptive Private Distributed Matrix Multiplication"}, {"paperId": "da6793dc84c1fd215e7bad09857c5675715cb626", "title": "Coded Computing for Resilient, Secure, and Privacy-Preserving Distributed Matrix Multiplication"}, {"paperId": "bce3b6a59669facfa5a7bfc17781072160b9d15d", "title": "Fountain Codes for Private Distributed Matrix-Matrix Multiplication"}, {"paperId": "647c9b930c40fbc7cb7eac2ac12f6b002f38d36d", "title": "A Survey of Coded Distributed Computing"}, {"paperId": "1c33464b79a55f79c23ca5026b1d33a6afe0fe2c", "title": "Secure Distributed Matrix Computation With Discrete Fourier Transform"}, {"paperId": "0b6774dcc108a5464a177c856c168bf612972138", "title": "Uplink Cost Adjustable Schemes in Secure Distributed Matrix Multiplication"}, {"paperId": "19d305b932549e372f90783e344b3014fdccfc6d", "title": "Private Function Computation"}, {"paperId": "fbf2409ba905fbdd52054f5dfc53cc0b3b9e48ad", "title": "Rateless Codes for Private Distributed Matrix-Matrix Multiplication"}, {"paperId": "a27935007936c555151984c8b0b97f0a09d0f718", "title": "GASP Codes for Secure Distributed Matrix Multiplication"}, {"paperId": "62e58dc0551b51b8e0a9195f7408c96fd033a6f1", "title": "Entangled Polynomial Codes for Secure, Private, and Batch Distributed Matrix Multiplication: Breaking the \"Cubic\" Barrier"}, {"paperId": "81b4328273f3468c9fdf3ff24159a072efb6bc9a", "title": "Uplink-Downlink Tradeoff in Secure Distributed Matrix Multiplication"}, {"paperId": "c57c34b0feae2411569866cb4a1718367ad61e2c", "title": "Cross Subspace Alignment Codes for Coded Distributed Batch Computation"}, {"paperId": "887e9d2f338b13d657e409d20bdb838b1c2b7ba2", "title": "Cross Subspace Alignment Codes for Coded Distributed Batch Matrix Multiplication"}, {"paperId": "4a880c1982b9c6b73f88d61c7b90b9c3799a044c", "title": "Private and rateless adaptive coded matrix-vector multiplication"}, {"paperId": "cd88c819ce0c499cc33046a38fae9c22f4add23d", "title": "X-Secure T-Private Information Retrieval From MDS Coded Storage With Byzantine and Unresponsive Servers"}, {"paperId": "0eac5b96b73d9995866c3983f9ee09710322bffb", "title": "Degree Tables for Secure Distributed Matrix Multiplication"}, {"paperId": "2db91029a7dc1e40ba70b92a0e1a6f15a660e40c", "title": "Private Sequential Function Computation"}, {"paperId": "29c492118472441d595b6d322c0ab46e56388ace", "title": "On the Upload versus Download Cost for Secure and Private Matrix Multiplication"}, {"paperId": "d9720b3a04dda7276300065d7e1bba2ce23f4a08", "title": "The Need for Alignment in Rate-Efficient Distributed Two-Sided Secure Matrix Computation"}, {"paperId": "2d26766305612fa9dd63328083bdb2a0b7fb1812", "title": "Distributed and Private Coded Matrix Computation with Flexible Communication Load"}, {"paperId": "e044d2718acecb4b0085b66afebeb2ca0e54a6bc", "title": "GASP Codes for Secure Distributed Matrix Multiplication"}, {"paperId": "155205b8e288fd49bf203135871d66de879c8c04", "title": "Minimizing Latency for Secure Coded Computing Using Secret Sharing via Staircase Codes"}, {"paperId": "bc87eb48e33b457f1a5bec1a919f0a2ad4d41d18", "title": "Straggler Mitigation in Distributed Matrix Multiplication: Fundamental Limits and Optimal Coding"}, {"paperId": "c4fa2b7832e12abf46687869895ec48b9a63b433", "title": "A Comprehensive Survey on Coded Distributed Computing: Fundamentals, Challenges, and Networking Applications"}, {"paperId": "1ba7284feeaf15e37aa056bb5438e95141a81fb0", "title": "Review of Research on Coded Computing"}, {"paperId": "8e03ca9bfcfc628f6081b3bd15823bd9118bd55c", "title": "Private Coded Matrix Multiplication"}]}
