{"paperId": "08fcd36694c93b72e5334c28bbc206b0af493db7", "publicationVenue": null, "title": "Estimation of PV Cell Equivalent Circuit Parameters Based on Ali Baba and the Forty Thieves Algorithm", "abstract": "In evaluating solar photovoltaic (SPV) cell performance and monitoring operational deviations, parameters of the solar cell equivalent circuit models play an important role. Given that solar cells have nonlinear current-voltage characteristics, calculating their parameters is a significant challenge. Therefore, to effectively handle this engineering challenge, an accurate and efficient optimization technique is typically needed. In order to determine SPV cell parameters, this study revealed a new optimization technique called Ali Baba and the Forty Thieves (AFT) algorithm. The suggested optimization technique was used to estimate the parameters of the single-diode equivalent circuit model of the SPV. Study work has been done on various photovoltaic modules, including the Photowatt PWP-201 and the RTC France solar cell. In addition, a comparison study is used to demonstrate the proposed AFT algorithm's performance against a number of existing heuristic algorithms, including the Moth Flame Optimization (MFO), Dragonfly Algorithm (DA), Whale Optimization Algorithm (WOA), Grey Wolf Optimization (GWO), Ant Lion Optimization (ALO), Harris Hawk Optimization (HHO), Hybrid of Particle Swarm Optimization and Grey Wolf Optimization (PSOGWO), Marine Predator Algorithm (MPA), and African Vulture Optimization Algorithm (AVOA). The comparison has been made using the same datasets and the same computational workload for each optimization technique in order to evaluate performance fairly. The acquired comparative results demonstrated that the AFT algorithm provides higher performance than any of those techniques in terms of the root mean square error (RMSE), computation time, and the accuracy of the results for parameter estimation of SPV cells.", "venue": "2022 International Conference on Technology and Policy in Energy and Electric Power (ICT-PEP)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-18", "journal": {"name": "2022 International Conference on Technology and Policy in Energy and Electric Power (ICT-PEP)", "pages": "192-197"}, "authors": [{"authorId": "2176293982", "name": "Hussam Rushdi"}, {"authorId": "1401361844", "name": "F. Al-Naima"}], "citations": []}
