{"paperId": "08fea695f8e0ddbeba7d48cc47eebcadad9c7bb5", "publicationVenue": null, "title": "Improving construction materials management practices in construction sites", "abstract": "Construction Materials Management is a vital function for improving productivity in \nconstruction projects. Poor materials management can often affect the overall \nconstruction time, quality and budget. Currently, the construction material \nmanagement practice in Somalia is believed to be poorly performed. Lack of \nstandardized construction materials management system is one of the key issues \nfacing by the building industry in Mogadishu-Somalia. The aim of this study was to \ninvestigate the current practices of material management at construction sites in \nMogadishu-Somalia. A questionnaire survey study design was used to explore \nconstruction materials management practices. Fifty questionnaires were distributed to \nproject managers, project engineers, site engineers, engineer, and foreman, and they \nwere received and analysed. The following data analysis techniques were used: \ndescriptive statistics were conducted to report sample characteristics, reliability and \nvalidity analyses were performed to confirm robustness of the instrument, graphical \npresentation such as bar charts were developed, and finally Average Mean Index \nScale were constructed. The study results reveals that, 46.7% of respondent’s \norganization obtain materials for sites without site requisition by site engineer \nprovisions, while 28.9% of respondent’s organization procure materials for sites with \nsite requisition by project manager provisions and 13.3% of respondent’s \norganization procure materials for site by engineer. The results indicated that \ncurrently there is no standardized and computerized construction materials \nmanagement system applied in Somalia. The researcher concluded that all \ncontracting companies are interested in using some techniques of managing \nconstruction materials such as creating and updating database for materials \ncategories from local and international suppliers. Finally, researcher recommends to \nuse computerized construction materials management systems to reduce effort and \ntime, and to achieve more accurate results.", "venue": "", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "145952660", "name": "F. Ahmed"}], "citations": [{"paperId": "bbe0e097e6a2ca14246b62d3ba8b59a1351ade80", "title": "Materials Management on Construction Sites Using RFID Technique"}, {"paperId": "e74297ef20ca7f6eb39f1313935b9695325ee4ca", "title": "ASSESSMENT OF THE MAJOR CONTRACTORS’ SELECTION CRITERIA AND THEIR IMPACTS IN CIVIL ENGINEERING CONSTRUCTION PROJECTS"}, {"paperId": "f124adeba9ccfdc35d80d267cec78f938f980894", "title": "The State of the Art of Materials Management Research in the Construction Industry"}]}
