{"paperId": "08fe0f51c0ed0af2ebdef322178a45780b17029a", "publicationVenue": {"id": "28df6cf4-b335-41eb-acc6-50eb3c965e5a", "name": "IEEE Transactions on Computational Social Systems", "type": "journal", "alternate_names": ["IEEE Trans Comput Soc Syst"], "issn": "2329-924X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6570650", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6570650"]}, "title": "CovidTrak: A Vision on Social Intelligence-Empowered COVID-19 Contact Tracing", "abstract": "With the proliferation of smart devices and widespread Internet connectivity, social sensing is advancing as a pervasive sensing paradigm where experiences shared by individuals on social platforms (e.g., Twitter and Facebook) are analyzed to interpret the physical world. In this article, we introduce CovidTrak, a vision of social intelligence-empowered contact tracing that aims to scrutinize the knowledge derived using social sensing to track Coronavirus Disease 2019 (COVID-19) infections among the general public. Contact tracing is known to be an effective technique for detecting and monitoring persons who may have been exposed to individuals infected with any communicable disease. While a good number of contact tracing schemes are existent today (e.g., in-person and phone interviews, paper forms, email and web-based questionnaires, and smartphone apps), they often require active user participation and might miss certain cases of social interactions that go off-the-records but still lead to COVID-19 transmission. By contrast, social sensing provides an alternative avenue for spontaneously determining such contacts by harnessing the rich experiences and information conveyed by people on social data platforms (e.g., a group photograph tweeted from a house party with a potential contact). As such, CovidTrak can form a powerful basis to combat the COVID-19 pandemic. The vision of CovidTrak intends to answer the following questions: 1) how to bolster the privacy and security of the online users while determining their contacts? 2) how to collect relevant social signals that indicate in-person encounters among people? 3) how to reliably process the vast amount of noisy data from social platforms to identify chains of transmission? 4) how to handle the scarcity of location metadata in the incoming data? 5) how to effectively communicate crucial contact information to concerned individuals? and 6) how to model and handle the responses of the common people toward contact information? We envision unexplored opportunities to leverage multidisciplinary techniques to address the above questions and develop effective future CovidTrak schemes.", "venue": "IEEE Transactions on Computational Social Systems", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Computational Social Systems", "pages": "3385-3405", "volume": "10"}, "authors": [{"authorId": "34914861", "name": "Md. Tahmid Rashid"}, {"authorId": "144766725", "name": "Dong Wang"}], "citations": [{"paperId": "87b298c52cb81462149d13b65f5393dcb8277616", "title": "A Survey on Social-Physical Sensing"}]}
