{"paperId": "09029865b4d7abe1e1693d5fe533fd84c5e9107a", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Tensors: An abstraction for general data processing", "abstract": "Deep Learning (DL) has created a growing demand for simpler ways to develop complex models and efficient ways to execute them. Thus, a significant effort has gone into frameworks like PyTorch or TensorFlow to support a variety of DL models and run efficiently and seamlessly over heterogeneous and distributed hardware. Since these frameworks will continue improving given the predominance of DL workloads, it is natural to ask what else can be done with them. This is not a trivial question since these frameworks are based on the efficient implementation of tensors, which are well adapted to DL but, in principle, to nothing else. In this paper we explore to what extent Tensor Computation Runtimes (TCRs) can support non-ML data processing applications, so that other use cases can take advantage of the investments made on TCRs. In particular, we are interested in graph processing and relational operators, two use cases very different from ML, in high demand, and complement quite well what TCRs can do today. Build-ing on Hummingbird, a recent platform converting traditional machine learning algorithms to tensor computations, we explore how to map selected graph processing and relational operator algorithms into tensor computations. Our vision is supported by the results: our code often outperforms custom-built C++ and CUDA kernels, while massively reducing the development effort, taking advantage of the cross-platform compilation capabilities of TCRs.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Proc. VLDB Endow.", "pages": "1797-1804", "volume": "14"}, "authors": [{"authorId": "41174671", "name": "D. Koutsoukos"}, {"authorId": "2133958031", "name": "Supun Nakandala"}, {"authorId": "2687553", "name": "Konstantinos Karanasos"}, {"authorId": "35064289", "name": "Karla Saur"}, {"authorId": "144641551", "name": "G. Alonso"}, {"authorId": "2192580", "name": "Matteo Interlandi"}], "citations": [{"paperId": "10fae23582b55e50f83660765f3c053f0a4df4fe", "title": "Multi-cluster high performance computing method based on multimodal tensor in enterprise resource planning system"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "e3ddc70bbd87e7d98d6dbdabfff1f3e82ffc855b", "title": "DyCL: Dynamic Neural Network Compilation Via Program Rewriting and Graph Optimization"}, {"paperId": "6ae19fb6eae020951aeccbed884e04f3824bf518", "title": "Accelerating Machine Learning Queries with Linear Algebra Query Processing"}, {"paperId": "5a594238ddeea258b00fa5c4d85051d42f2554b9", "title": "Auto-Differentiation of Relational Computations for Very Large Scale Machine Learning"}, {"paperId": "c0a2500aa1517d8674a131b75359e7dce980a71c", "title": "Data Processing with FPGAs on Modern Architectures"}, {"paperId": "f1b371177b66aaa9a38c05f997084b9e2747116a", "title": "A Tensor Optimization Algorithm for Computing Lagrangians of Hypergraphs"}, {"paperId": "0ddbe0b22ce809628c2a942f668d15985567d346", "title": "Scalable Tensors for Big Data Analytics"}, {"paperId": "127b7ef160f82226cc1020cc0f2e34080bc33ed4", "title": "The Tensor Data Platform: Towards an AI-centric Database System"}, {"paperId": "f0c4c922fb7c7be75d8147de950a1ee00bf5286d", "title": "Share the Tensor Tea: How Databases can Leverage the Machine Learning Ecosystem"}, {"paperId": "7a0ec6499cace3ab3178645c2c63dcb34608f02e", "title": "A comprehensive empirical study on bug characteristics of deep learning frameworks"}, {"paperId": "29581a7c366620585b577f03b9680325cae410c5", "title": "Autoscheduling for sparse tensor algebra with an asymptotic cost model"}, {"paperId": "938ff51b43f95921c6071bf7f85ccb358da23951", "title": "End-to-end Optimization of Machine Learning Prediction Queries"}, {"paperId": "489f6c0e46fc72ee91a06e99cfb48d969acd654e", "title": "Amalur: Data Integration Meets Machine Learning"}, {"paperId": "300823792f3854a857c452259455fe4b162c3104", "title": "Query Processing on Tensor Computation Runtimes"}, {"paperId": "6d89c0134797ea27fedd3a3b1fd6da655cf56884", "title": "Serving Deep Learning Models with Deduplication from Relational Databases"}, {"paperId": "9d4b2da6e25326ceb89d372cf4e35fe8e0e82765", "title": "TOD: GPU-accelerated Outlier Detection via Tensor Operations"}, {"paperId": "76a57bec29a8e7cfa63cbc7e01efd5a97f5a378a", "title": "Array DBMS: Past, Present, and (Near) Future"}, {"paperId": "3c3f8344e58ff7a8ea9c924e428bda5b8c775df6", "title": "DAPHNE: An Open and Extensible System Infrastructure for Integrated Data Analysis Pipelines"}, {"paperId": "541bffe2be8b2fed3210755cfd468fcf9689d7de", "title": "Resnet18 Model With Sequential Layer For Computing Accuracy On Image Classification Dataset"}, {"paperId": "130449aea1dbe300555982feda140115cf80eade", "title": "WindTunnel: Towards Differentiable ML Pipelines Beyond a Single Modele"}]}
