{"paperId": "090ec8785660ed71516f9d9e5801b4e22e08af4f", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Using Voting-Based Ensemble Classifiers to Map Invasive Phragmites australis", "abstract": "Machine learning is frequently combined with imagery acquired from uncrewed aircraft systems (UASs) to detect invasive plants. Having prior knowledge of which machine learning algorithm will produce the most accurate results is difficult. This study examines the efficacy of a voting-based ensemble classifier to identify invasive Phragmites australis from three-band (red, green, blue; RGB) and five-band (red, green, blue, red edge, near-infrared; multispectral; MS) UAS imagery acquired over multiple Minnesota wetlands. A Random Forest, histogram-based gradient-boosting classification tree, and two artificial neural networks were used within the voting-based ensemble classifier. Classifications from the RGB and multispectral imagery were compared across validation sites both with and without post-processing from an object-based image analysis (OBIA) workflow (post-machine learning OBIA rule set; post-ML OBIA rule set). Results from this study suggest that a voting-based ensemble classifier can accurately identify invasive Phragmites australis from RGB and multispectral imagery. Accuracies greater than 80% were attained by the voting-based ensemble classifier for both the RGB and multispectral imagery. The highest accuracy, 91%, was achieved when using the multispectral imagery, a canopy height model, and a post-ML OBIA rule set. The study emphasizes the need for further research regarding the accurate identification of Phragmites australis at low stem densities.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-12", "journal": {"name": "Remote. Sens.", "pages": "3511", "volume": "15"}, "authors": [{"authorId": "2150937035", "name": "Connor J. Anderson"}, {"authorId": "2125076630", "name": "Daniel Heins"}, {"authorId": "32692759", "name": "Keith C. Pelletier"}, {"authorId": "2061862013", "name": "Joseph F. Knight"}], "citations": []}
