{"paperId": "09107f7c5ab2cf9072a93536283733b05e5d5f8e", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "METTLE: A METamorphic Testing Approach to Assessing and Validating Unsupervised Machine Learning Systems", "abstract": "Unsupervised machine learning is the training of an artificial intelligence system using information that is neither classified nor labeled, with a view to modeling the underlying structure or distribution in a dataset. Since unsupervised machine learning systems are widely used in many real-world applications, assessing the appropriateness of these systems and validating their implementations with respect to individual users’ requirements and specific application scenarios/contexts are indisputably two important tasks. Such assessments and validation tasks, however, are fairly challenging due to the absence of a priori knowledge of the data. In view of this challenge, in this article, we develop a METamorphic Testing approach to assessing and validating unsupervised machine LEarning systems, abbreviated as mettle. Our approach provides a new way to unveil the (possibly latent) characteristics of various machine learning systems, by explicitly considering the specific expectations and requirements of these systems from individual users’ perspectives. To support mettle, we have further formulated 11 generic metamorphic relations (MRs), covering users’ generally expected characteristics that should be possessed by machine learning systems. We have performed an experiment and a user evaluation study to evaluate the viability and effectiveness of mettle. Our experiment and user evaluation study have shown that, guided by user-defined MR-based adequacy criteria, end users are able to assess, validate, and select appropriate clustering systems in accordance with their own specific needs. Our investigation has also yielded insightful understanding and interpretation of the behavior of the machine learning systems from an end-user software engineering's perspective, rather than a designer's or implementor's perspective, who normally adopts a theoretical approach.", "venue": "IEEE Transactions on Reliability", "year": 2018, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-27", "journal": {"name": "IEEE Transactions on Reliability", "pages": "1293-1322", "volume": "69"}, "authors": [{"authorId": "145415788", "name": "Xiaoyuan Xie"}, {"authorId": "2117993556", "name": "Zhiyi Zhang"}, {"authorId": "144587401", "name": "T. Chen"}, {"authorId": "31505222", "name": "Yang Liu"}, {"authorId": "2485110", "name": "P. Poon"}, {"authorId": "144380518", "name": "Baowen Xu"}], "citations": [{"paperId": "30f8ae1a5958adf095afea34cb89c37aac2bd42c", "title": "Mutation testing of unsupervised learning systems"}, {"paperId": "655acf5ea5d9b3123d7f80611c7f928569046998", "title": "Statfier: Automated Testing of Static Analyzers via Semantic-Preserving Program Transformations"}, {"paperId": "0e202f27b54473abc4272b3883bc91a4f7242295", "title": "Test & Evaluation Best Practices for Machine Learning-Enabled Systems"}, {"paperId": "542d2c1471d79710a39e4c873b258c0ab03e4bcd", "title": "AutoConf: Automated Configuration of Unsupervised Learning Systems Using Metamorphic Testing and Bayesian Optimization"}, {"paperId": "41220970514daacb1093acf62b8deb65b25e7479", "title": "Metamorphic Testing For Machine Learning: Applicability, Challenges, and Research Opportunities"}, {"paperId": "313d4fdb69f3145535cff304a095f4487932a72c", "title": "A Metamorphic Testing Framework and Toolkit for Modular Automated Driving Systems"}, {"paperId": "754b8d3e257e6fee97c7bef97794beca9c824894", "title": "qaAskeR+\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$^+$$\\end{document}: a novel testing method for question answer"}, {"paperId": "986807cfcaea0876982421119c80f9bd2a7aef09", "title": "qaAskeR\n \n \n \n $$^+$$\n \n \n \n +\n \n \n : a novel testing method for question answering software via asking recursive questions"}, {"paperId": "26bd2f90387fe9669395bf2d253ec0384baa2237", "title": "Robustness Evaluation in Hand Pose Estimation Models using Metamorphic Testing"}, {"paperId": "deac2653c0f3e744243d59a269193afd6e98a051", "title": "Metamorphic Testing for Smart Contract Vulnerabilities Detection"}, {"paperId": "03e96291b648f2c9ca8c6945ffaebd93263952d4", "title": "An Approach For Verifying And Validating Clustering Based Anomaly Detection Systems Using Metamorphic Testing"}, {"paperId": "cafa015921d1c58c0c4a2a948eaea61253a19807", "title": "Metamorphic Testing of Classification Program for the COVID-19 Intelligent Diagnosis"}, {"paperId": "3182bee673948beff52ed66d5699f54f7745f4f5", "title": "Multi-objective metamorphic follow-up test case selection for deep learning systems"}, {"paperId": "e20a309a281ab4f92b3ab90fc980617bb05f66db", "title": "MT4UML: Metamorphic Testing for Unsupervised Machine Learning"}, {"paperId": "cf33f5402ac949243119f455a2c424eb7d09d0bd", "title": "On the effectiveness of testing sentiment analysis systems with metamorphic testing"}, {"paperId": "6ba60a6aa0662cb4577fa9628bc86b64b2c831d4", "title": "On the Cost-Effectiveness of Composite Metamorphic Relations for Testing Deep Learning Systems"}, {"paperId": "b2a2059105ded9dcd0be69f82d389c438a76e789", "title": "Muffin: Testing Deep Learning Libraries via Neural Architecture Fuzzing"}, {"paperId": "7e743509a9f97bf78a6df861f644e72937016ee3", "title": "Syntax‐based metamorphic relation prediction via the bagging framework"}, {"paperId": "2232227120063be5b99b9057515fcb247538c2ae", "title": "Property-based Test for Part-of-Speech Tagging Tool"}, {"paperId": "e30351fa6e99c93af0e54b58dbe3aca20f23283b", "title": "Testing Your Question Answering Software via Asking Recursively"}, {"paperId": "e907b387169e5062f889b68ad5694e4f190e1b21", "title": "AequeVox: Automated Fairness Testing of Speech Recognition Systems"}, {"paperId": "c17a107c56a7d3afe8966181844a8fad3267a51b", "title": "Towards effective metamorphic testing by algorithm stability for linear classification programs"}, {"paperId": "a41856aa69a9b06ab37f0ce5dc4cc861f7099292", "title": "Validation on machine reading comprehension software without annotated labels: a property-based method"}, {"paperId": "7c99e201d4efb31ed8fa5b72b2879cfa5355c45b", "title": "New visions on metamorphic testing after a quarter of a century of inception"}, {"paperId": "3b1a470efa25e6617f34a9ba776fcf7e2039748c", "title": "TimeGym: Debugging for Time Series Modeling in Python"}, {"paperId": "07228637aee7db0a78021c53ddf96b2aeed1c090", "title": "Use of Metamorphic Relations as Knowledge Carriers to Train Deep Neural Networks"}, {"paperId": "95103c61503168828a2ceb80fe92827067418266", "title": "An Experimental Study on Applying Metamorphic Testing in Machine Learning Applications"}, {"paperId": "3082caaa6355cc8173ee8e8c770002bd04b60cd6", "title": "Testing machine learning based systems: a systematic mapping"}, {"paperId": "ddcebd5ad203ba33af31bad06ece6c672aa805da", "title": "Not Your Grandfathers Test Set: Reducing Labeling Effort for Testing"}, {"paperId": "865949ddb80479b5201e0cd9d7c02e407e37953d", "title": "Preparing Software Quality Assurance Professionals: Metamorphic Exploration for Machine Learning"}, {"paperId": "f4e56d6bb93e6584522ef45e7ff98288859ca91c", "title": "Applicable Metamorphic Testing for Erasable-Itemset Mining"}, {"paperId": "36d1034a1555a5471e757d82af8c2304286be920", "title": "Falsify your Software: validating scientific code with property-based testing"}, {"paperId": "f451a3153c38a12c3a6e2c3258f3f24413697983", "title": "When debugging encounters artiﬁcial intelligence: state of the art and open challenges"}]}
