{"paperId": "091ca2a502cd242ec591867cf0b61c8acdc08408", "publicationVenue": {"id": "e37dd43d-80e9-4659-9799-3bee98bb4e81", "name": "IEEE International Conference on Cognitive Informatics and Cognitive Computing", "type": "conference", "alternate_names": ["ICCI*CC", "IEEE Int Conf Cogn Informatics Cogn Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1308"}, "title": "A RST-based stateful data analytics within spark", "abstract": "Stateful data analytics framework have emerged to provide fresh and low-latency results for big data processing. At present, it is desired to achieve the fine-grained data model in mainstream data processing framework, e.g. Spark. However, Spark adopts coarse-grained data model in order to facilitate parallization, it makes the fine-grained data access in stateful data analytics very challenging. In this paper, we introduce a stateful component, Resilient State Table (RST) to Spark framework. To fill the gap between the coarse-grained data model in Spark and the fine-grained state access requirements in stateful data analytics, we devise the programming model of RST which interacts with Spark's coarse-grained memory representation seamlessly, and enables users to query/update the state entries in fine granularity with Spark-like programming interfaces. Performance evaluation in various application fields demonstrate that our proposed solution achieves the improvements in latency, fault-tolerance, as well as scalability.", "venue": "IEEE International Conference on Cognitive Informatics and Cognitive Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 IEEE 16th International Conference on Cognitive Informatics & Cognitive Computing (ICCI*CC)", "pages": "394-399"}, "authors": [{"authorId": "1820837", "name": "Jike Ge"}, {"authorId": "2901846", "name": "Zuqin Chen"}, {"authorId": "2116905656", "name": "Can Liu"}, {"authorId": "47918427", "name": "Jun Peng"}, {"authorId": "2087100588", "name": "Wenbo He"}, {"authorId": "46573892", "name": "Nan Zhu"}], "citations": []}
