{"paperId": "0921a6a89fa44bf9005afa4c426931ecdb35534d", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "Competitive intelligence empirical validation and application: Foundations for knowledge advancement and relevance to practice", "abstract": "The competitive intelligence (CI) construct must be scientifically defined, characterised, empirically validated and accurately measured to grow in science and business. This study aims at elevating the accuracy of the empirical validation of the CI construct suggested and confirmed by Madureira, Popovic and Castelli to serve as the scientific foundation for CI praxis. This construct is selected due to its unmatched recency, thoroughness, universality identified limitations of its empirical validation. We relied on a multistrand design of fully sequential with equivalent status qualitative and quantitative mix-methods followed by the triangulation of the findings and the development of the meta-inferences. Validity, reliability and applicability were tested using computer-aided text analysis and artificial intelligence methods based on 61 in-depth interviews with CI subject matter experts. Contributions to knowledge advancement and relevance to practice derive from the scientific-grade empirical construct validation, providing undisputed levels of accuracy, consistency, applicability, and triangulation of results. This study highlights three critical implications. First, the delimitation of the body of knowledge and recognition of the CI domain serve as the baseline for theory development. Second, the validated construct guarantees reproducibility, replicability and generalisability, laying the foundations for establishing CI science, practice and education. Third, creating a common language and shared understanding will drive the much-claimed definitional consensus. This study thus stands as a foundational pillar in supporting CI praxis in improving decision-making quality and the performance of organisations.", "venue": "Journal of information science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-06", "journal": {"name": "Journal of Information Science"}, "authors": [{"authorId": "2238344539", "name": "Luís Madureira"}, {"authorId": "3193992", "name": "Aleš Popovič"}, {"authorId": "2163022759", "name": "Mauro Castelli"}], "citations": []}
