{"paperId": "092753766a459c0a4f1c72ac7b63b312438057a8", "publicationVenue": {"id": "a4a317c4-efab-4c0b-91d4-bb16df933253", "name": "Scandinavian Journal of Information Systems", "type": "journal", "alternate_names": ["Scand J Inf Syst"], "issn": "0905-0167", "alternate_issns": ["1901-0990"], "url": "https://aisel.aisnet.org/sjis/"}, "title": "Creating the Socio-technical Context Needed to Derive Benefits from Big Data Initiatives in Healthcare", "abstract": "The application of big data in healthcare typifies a complex socio-technical system. However, although research and practice have advanced the technical aspects of big data, comparable advancements in the social aspects (i.e., human and structural aspects) are lagging. Literature, especially on socio-technical theory, suggests that organizations may only derive benefits from big data initiatives when technical initiatives are adequately complemented by social interventions. Thus, seeing that big data is receiving considerable attention in healthcare, researchers have called for further research into the social aspects of the application of big data in healthcare. Adopting a socio-technical perspective, and drawing on a systematic review of 67 articles, this study responds to the calls by collating recommendations that are necessary to establish the socio-technical context required to derive benefits from big data initiatives in healthcare. It further synthesizes the recommendations into a set of heuristics and a model to guide managerial efforts 1 Lumor et al.: Creating the Socio-technical Context for Big Data Benefits in Healthcare Published by AIS Electronic Library (AISeL), 2021 © Scandinavian Journal of Information Systems, 2021 33(2), 3-58 Lumor et al.: Creating the Socio-Technical Context Needed to Derive Benefits from Big Data Initiatives in Healthcare 4 and research. The practical implications, areas for further research, and the limitation of this study are discussed. This study contributes to the discourse on establishing the socio-technical context needed to derive benefits from big data initiatives in healthcare.", "venue": "Scandinavian Journal of Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Scand. J. Inf. Syst.", "pages": "1", "volume": "33"}, "authors": [{"authorId": "3485014", "name": "Truth Lumor"}, {"authorId": "35136986", "name": "M. Pulkkinen"}, {"authorId": "47296505", "name": "A. Hirvonen"}, {"authorId": "2149772664", "name": "Pekka Neittaanmäki"}], "citations": [{"paperId": "8ba62f222ee8a42313e458d835a4b1a46fe14290", "title": "General data protection regulation: a study on attitude and emotional empowerment"}, {"paperId": "ebb9a7087cbaf33caf8bb2301fd85b6481d77c4f", "title": "Impact of AI Readiness and E-Participation Implementation of a Government on the Well-being of its Citizens"}]}
