{"paperId": "092fa6222868c13620af9cd527b30ecdff713a7d", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Analysis of the innovation path of university education management informatization in the era of big data", "abstract": "Abstract In order to have a qualitative improvement in the education management of universities in the background of the era of big data technology, it is necessary to integrate information technology and technological means in the process of education management. Based on this background, this paper constructs an informatization education management platform. In the process of platform architecture, the cloud storage module obtains the exact nearest neighbors by the time factor, optimizes the construction process by using the weighting function and hybrid coordination filtering algorithm, and simplifies the teaching management process. In the teaching management system, the fixed rules of the feature selection algorithm are used to achieve teaching resource selection prediction in the optimal feature subset and establish the best classification surface. Finally, the performance of the platform proposed in this paper is verified from two levels: resource recommendation and education management. The experimental results show that the MAE (Mean Absolute Error) value of this platform is always under 0.7, with a mean value of 0.523, and the experimental teaching resource recommendation effect is better than that of the IE virtual experiment teaching platform and data platform. And the maximum number of visits that the platform can bear is 884, and the maximum amount of government processing can reach 839, which is much larger than the number of 800 users of experimental teaching in the university and fully meets the needs of university education management.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-28", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2112442918", "name": "Zefeng Zhu"}], "citations": [{"paperId": "57eb3528e2988496c58c5ead1f3e37e9198183c6", "title": "Role of Entrepreneurship Education Management in Creating Entrepreneurship Competitive Advantage in Students: Case Study on F-Clean Products at MA Al-Rahman Sukabumi"}]}
