{"paperId": "093cfce7cb79cffe9c88873eff72003526679f39", "publicationVenue": null, "title": "Construction of Smart Library Based on the Big Data Mining and Knowledge Discovery", "abstract": "In order to discover underlying rules and extract useful knowledge from big data, and effectively solve the problems in the library personalized smart service, in this paper, the matters needing attention were studied for personalized smart service in library, and the smart library service system was constructed based on the big data mining and knowledge discovery, the functions of each service layer of smart library were described. The system could make its resources and services highly integrated, and significantly reduce the use of system resources, according to the requirements of readers to intelligently customize the service content, and provide personalized smart reading services for readers. The characteristics of readers and books are extracted and analyzed through data mining tools and methods. After the similarity between readers and books is calculated, the accurate push of books is realized, and the classification accuracy of readers is more than 90%.", "venue": "2021 Smart City Challenges & Outcomes for Urban Transformation (SCOUT)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "2021 Smart City Challenges & Outcomes for Urban Transformation (SCOUT)", "pages": "57-61"}, "authors": [{"authorId": "2190588954", "name": "Jianhua Yu"}], "citations": [{"paperId": "9f207e80d8d4524bbac448a07f733aeeb92ef06b", "title": "Research on the Development Status and Approaches of Smart Library"}, {"paperId": "984e8bf55ddb73a04ef31e71888b59db86fd6910", "title": "Construction of Library Personalized Intelligent Service System Based on Data Mining"}, {"paperId": "6439030831c89eb30e2542576d05a201356204a5", "title": "Research on interest reading recommendation method of intelligent library based on big data technology"}]}
