{"paperId": "093f3d2f5bf684a2fe93e7c2cbaa14da87d9dbcf", "publicationVenue": {"id": "34342fcb-3fe0-45c6-a017-6e65b73d030f", "name": "IEEE International Conference on e-Science", "type": "conference", "alternate_names": ["e-Science", "Int Conf e-science", "IEEE Int Conf e-science", "E-Science", "International Conference on e-Science"], "url": "https://escience-conference.org/"}, "title": "FDQ: Advance Analytics Over Real Scientific Array Datasets", "abstract": "Scientific data is not only rapidly increasing in size, but in complexity of operations performed upon as well. Compared to the prevalent use of ad-hoc approaches, structured operators provide many benefits. In this paper, we introduce FDQ - an Analytical Functions Distributed Querying Engine intended for Array Data. Motivated by needs of climate scientists in terms of both functionality and scalability, we make three major contributions: First, we introduce a new class of analytical querying - querying over windows where the planes that construct these windows are internally ordered. An example of this querying type is the introduced MINUS analytical function, a function that supports querying over accumulative measurements with data resets. Second, we describe in detail memory management optimizations for efficient processing of analytical (and other structured operators) querying over large datasets. Last, we provide efficient methods to execute these queries in parallel, using a sectioned (tiled) approach. We evaluate our methods using real multi-dimensional climate datasets, and show they outperform existing approaches. When running locally (not in a distributed manner), we observed an average performance improvement of 538% compared to other engines for analytical calculations. We also show our methods performance improve linearly with the provided computing resources (scale up and out).", "venue": "IEEE International Conference on e-Science", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 IEEE 14th International Conference on e-Science (e-Science)", "pages": "453-463"}, "authors": [{"authorId": "3051580", "name": "Roee Ebenstein"}, {"authorId": "145340303", "name": "G. Agrawal"}, {"authorId": "2109656815", "name": "Jiali Wang"}, {"authorId": "17887017", "name": "J. Boley"}, {"authorId": "9297377", "name": "R. Kettimuthu"}], "citations": [{"paperId": "b5f469d5b21ce2ff76c4519a26d037bd55904bec", "title": "Procella: Unifying serving and analytical data at YouTube"}]}
