{"paperId": "0943d4664c52e74a8b79a46ed1d80c33569514b5", "publicationVenue": {"id": "28aa8a6f-d172-4e36-bd3a-aa9e6fc32a9c", "name": "Fall Joint Computer Conference", "type": "conference", "alternate_names": ["Fall joint computer conference", "Fall jt comput conf", "Fall Jt Comput Conf", "FJCC", "JCC"]}, "title": "Optimization Strategies for Data Placement in Satellite Cloud-oriented Distributed File Systems", "abstract": "Forming a collaborative computing network among the deployed satellites in space can process data rapidly and reduce data transmission delay by leveraging the communication, storage, and computing capacities of the satellites. Due to the dynamics of satellite orbits, the distance between satellites varies over time, bringing new challenges to the designing of dedicated distributed file systems for collaborative satellites. Traditional distributed file systems did not consider the network topology and dynamics of satellite clouds and the limited computing resources of satellite node cores. In view of the torus network topology of satellite clouds, we design a highly available distributed metadata management mechanism for satellite clouds to ensure efficient metadata reading and reliability. On this basis, a topology-aware replica placement strategy is proposed to minimize communication costs and energy consumption for replica placement. Based on the metadata strategy and replica placement strategy mentioned above, we design and implement a distributed file system for satellite clouds. Experimental results demonstrate that our proposed placement strategy can improve the data transmission performance of the replica placement by more than double compared to the random placement strategy.", "venue": "Fall Joint Computer Conference", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE International Conference on Joint Cloud Computing (JCC)", "pages": "70-77"}, "authors": [{"authorId": "2237126089", "name": "Ying Zhang"}, {"authorId": "2592610", "name": "Tianyu Wo"}, {"authorId": "2236935919", "name": "Kun Fan"}, {"authorId": "2136792605", "name": "Tianyu Ye"}, {"authorId": "2237102802", "name": "Jiwei Zhang"}, {"authorId": "2237102222", "name": "Junhua Zhang"}, {"authorId": "2237135657", "name": "Xiao Feng"}], "citations": []}
