{"paperId": "09474afc6ea5f5912c75cc027a909dac6cd355a5", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Efficient Sampling for Big Provenance", "abstract": "Provenance has been studied extensively to explain existing and missing results for many applications while focusing on scalability and usability challenges. Recently, techniques that efficiently compute a compact representation of provenance have been introduced. In this work, we introduce a practical solution that computes a sample of provenance for existing results without computing full provenance. Our technique computes a sample of provenance based on the distribution of provenance wrt the query result that is estimated from the distribution of input data while considering the correlation among the data. The preliminary evaluation demonstrates that comparing to the naive approach our method efficiently computes a sample of (large size of) provenance with low errors.", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-04-30", "journal": {"name": "Companion Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "2215624561", "name": "Sara Moshtaghi Largani"}, {"authorId": "121945033", "name": "Seok-Gyun Lee"}], "citations": [{"paperId": "b3d08f1d20c58398a9d075d3edfc3deb68f318c6", "title": "How COVID-19 impacted the temporal and spatial distribution of collision hotspots"}, {"paperId": "8057573b1d411888bf597014422f7b62530a5ce0", "title": "TOWARDS STANDARDIZED REGULATIONS FOR BLOCK CHAIN SMART CONTRACTS: INSIGHTS FROM DELPHI AND SWARA ANALYSIS"}, {"paperId": "d593860e5bdcb4bf2adcc4768ec55c93ed52bd9b", "title": "Minimizing Turns in Watchman Robot Navigation: Strategies and Solutions"}, {"paperId": "04c281b83045b9ad3d8380edac0aee81d9c782ca", "title": "Securing Pathways with Orthogonal Robots"}, {"paperId": "c0e8e7574e1945e3d54eb1acf3d102e4c296c087", "title": "Correction: Forecasting heating and cooling loads in residential buildings using machine learning: a comparative study of techniques and influential indicators"}, {"paperId": "4eea4a25934bd834be27d0e9f9659a57f9d9723d", "title": "Forecasting heating and cooling loads in residential buildings using machine learning: a comparative study of techniques and influential indicators"}, {"paperId": "90c18467774fad83023bed0ac05d72b8ed1ccee5", "title": "Efficiently Guiding K-Robots Along Pathways with Minimal Turns"}]}
