{"paperId": "0947c3fb56ba68d199b51c1e86f0d62afa517bce", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Complementary in Time and Space: Optimization on Cost and Performance with Multiple Resources Usage by Server Consolidation in Cloud Data Center", "abstract": "The recent COVID-19 pandemic has accelerated the use of cloud computing. The surge in the number of users presents cloud service providers with severe challenges in managing computing resources. Guaranteeing the QoS of multiple users while reducing the operating cost of the cloud data center (CDC) is a major problem that needs to be solved urgently. To solve this problem, this paper establishes a cost model based on multiple computing resources in CDC, which comprehensively considers the hosts’ energy cost, virtual machine (VM) migration cost, and SLAV penalty cost. To minimize this cost, we design the following solution. We employ a convolutional autoencoder-based filter to preprocess the VM historical workload and use an attention-based RNN method to predict the computing resource usage of the VMs in future periods. Based on the predicted results, we trigger VM migration before the host enters an overloaded state to reduce the occurrence of SLAV. A heuristic algorithm based on the complementary use of multiple resources in space and time is proposed to solve the placement problem. Simulations driven by the VM real workload dataset validate the effectiveness of our proposed method. Compared with the existing methods, our proposed method reduces the energy consumption of the hosts and SLAV and reduces the total cost by 26.1~39.3%.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-09-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2108525317", "name": "Huixi Li"}, {"authorId": "2115520563", "name": "Yongluo Shen"}, {"authorId": "2125185686", "name": "Huidan Xi"}, {"authorId": "28103614", "name": "Yinhao Xiao"}], "citations": []}
