{"paperId": "0952bd46640b17d7c65c93da7579d97b304fa140", "publicationVenue": {"id": "019430f0-1831-4154-afde-9d11a8c351f5", "name": "Environment and Planning B Urban Analytics and City Science", "alternate_names": ["Environ Plan B Urban Anal City Sci"], "issn": "2399-8083", "url": "https://www.eandponline.org/"}, "title": "Anomalous human activity fluctuations from digital trace data signal flood inundation status", "abstract": "The emergence of mobile platforms equipped with Global Positioning System technology enables real-time data collection affording opportunities for mining data applicable to rapid flood inundation assessment. The collected data can be employed to complement existing methods for rapid flood inundation assessment, such as remote sensing, to enhance situational awareness. In particular, telemetry-based digital trace data related to human activity have intrinsic advantages to be used for inundation assessment. In this study, we investigate the use of Mapbox telemetry data, which provides human activity indices with high spatial and temporal resolutions, for application in rapid flood inundation assessment. Using data from Hurricane Harvey in 2017 in Harris County, Texas, we (1) study anomalous fluctuations in human activities and analyze the differences in activity level between inundated and non-inundated areas and (2) investigate changes in the concentration of human activity, to explore the disruption of human activity as an indicator of flood inundation. Results show that both analyses can provide valuable rapid insights regarding flood inundation status. Anomalous activities can be significantly higher/lower in flooded areas compared with non-flooded areas. Also, the concentration of human activity during the flood propagation period across affected watersheds can be observed. This study contributes to the state of knowledge in smart flood resilience by investigating the application of ubiquitous telemetry-based digital trace data to enhance rapid flood inundation assessment. Accordingly, the use of such digital trace data could provide emergency managers and public officials with valuable insights to inform impact evaluation and response actions.", "venue": "Environment and Planning B Urban Analytics and City Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-27", "journal": {"name": "Environment and Planning B: Urban Analytics and City Science", "pages": "1893 - 1911", "volume": "49"}, "authors": [{"authorId": "144704989", "name": "H. Farahmand"}, {"authorId": "2155368347", "name": "Wanqiu Wang"}, {"authorId": "48813438", "name": "A. Mostafavi"}, {"authorId": "40427389", "name": "Mikel Maron"}], "citations": [{"paperId": "6a1563153ebde228dce4bb378ce7495eca2e81f5", "title": "Unveiling dialysis centers’ vulnerability and access inequality during urban flooding"}, {"paperId": "f95eae2a7233f97b83adcc1020b8653a6dfda1b8", "title": "Dissecting Resilience Triangle: Unravelling Resilience Curve Archetypes and Properties in Human Systems Facing Weather Hazards"}, {"paperId": "79fba656d01d5380cea2d6164318c275e431771f", "title": "Emergence of Urban Heat Traps from the Intersection of Human Mobility and Heat Hazard Exposure in Cities"}, {"paperId": "0fff558085754b398f9c7c680263a7cd553e8c70", "title": "Data-driven Tracking of the Bounce-back Path after Disasters: Critical Milestones of Population Activity Recovery and Their Spatial Inequality"}, {"paperId": "c1eef82cdfc8f0e6cab7a2ad1e9c8807112f674a", "title": "Energy Inequality in Climate Hazards: Empirical Evidence of Social and Spatial Disparities in Managed and Hazard-Induced Power Outages"}, {"paperId": "a160d3caf64a89a6900e713e3ac7df4f1769138a", "title": "Unveiling Vulnerability and Inequality in Disrupted Access to Dialysis Centers During Urban Flooding"}, {"paperId": "859a1fead3b6580a5e82861ea2c4481124ac0649", "title": "Lifestyle pattern analysis unveils recovery trajectories of communities impacted by disasters"}, {"paperId": "178adcefb56f46050c42d70a72cfc7b7dedadf4d", "title": "Location intelligence reveals the extent, timing, and spatial variation of hurricane preparedness"}, {"paperId": "bf3521c26877a930ee7a717cc8819b17c74da277", "title": "Community-scale big data reveals disparate impacts of the Texas winter storm of 2021 and its managed power outage"}, {"paperId": "1b93ceea71305de15ad61d01239f20ad9d6db9ab", "title": "Unraveling the Temporal Importance of Community-Scale Human Activity Features for Rapid Assessment of Flood Impacts"}]}
