{"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks", "abstract": "Road safety, optimized traffic management, and passenger comfort have always been the primary goals of the vehicle networking research community. Advances in computer and communication technology have made the dream of modern intelligent vehicles a reality through the use of smart sensors, cameras, networking devices, and storage capabilities. Autonomous operation of modern intelligent vehicles requires massive computations where tasks are outsourced. The research community has proposed various computing paradigms: mobile cloud computing, vehicle cloud computing, multi-access edge computing, vehicle edge computing, vehicle fog computing, and voluntary computing-based VANET (VCBV) to move computational power close to the user and handle the delay-sensitive applications of modern intelligent vehicles. In this study, we have provided a comprehensive overview of all computing paradigms related to vehicular networks. We have presented the architectural details, similarities, differences, and key features of each computing paradigm. Finally, we concluded the study with open research challenges in vehicular networks.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "1720502865", "name": "Abdul Waheed"}, {"authorId": "35191617", "name": "M. A. Shah"}, {"authorId": "46242598", "name": "Syed Muhammad Mohsin"}, {"authorId": "143641116", "name": "Abid-Aziz Khan"}, {"authorId": "152981613", "name": "C. Maple"}, {"authorId": "40998104", "name": "S. Aslam"}, {"authorId": "1758091", "name": "Shahaboddin Shamshirband"}], "citations": [{"paperId": "690c7cb3b1adf2116aef73b26476ba79a24d1c53", "title": "Deep-Reinforcement-Learning-Based Computation Offloading and Power Allocation Within Dynamic Platoon Network"}, {"paperId": "6a04eb62ffe6b7439c445d0507c733f9ce5b57d0", "title": "Many-to-Many Task Offloading in Vehicular Fog Computing: A Multi-Agent Deep Reinforcement Learning Approach"}, {"paperId": "b1be84b24a17ba3001395476c8470253c6ced83e", "title": "Intelligent Data-Driven Architectural Features Orchestration for Network Slicing"}, {"paperId": "1d9c2ad088672e2e9202d0a3503980d952069ae5", "title": "Service delay and optimization of the energy efficiency of a system in fog-enabled smart cities"}, {"paperId": "94f33aaa9b85595a20d5b6a306592f259a34693a", "title": "An IoT Model for Autonomous Cars"}, {"paperId": "b70d0245f6d7ae37b57e1b071d6f7ef121d919de", "title": "Exploring the Potential of Distributed Computing Continuum Systems"}, {"paperId": "6b1dfb50cb852746366d0640971dd4f48f424811", "title": "TBOMC: A Task-Block-Based Overlapping Matching-Coalition Scheme for Task Offloading in Vehicular Fog Computing"}, {"paperId": "42d409fe1cb49e758f05e0807fa1d2b4b85381d4", "title": "Vehicle Trajectory Prediction Method for Task Offloading in Vehicular Edge Computing"}, {"paperId": "898c91504013e87cb9c8911115187186ea7f3390", "title": "Contemporary advances in multi-access edge computing: A survey of fundamentals, architecture, technologies, deployment cases, security, challenges, and directions"}, {"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain."}, {"paperId": "24e103b35b1e1e9b05bd5168a45c2c38f63403d7", "title": "Intelligent Traffic Model for Unmanned Ground Vehicles Based on DSDV-AODV Protocol"}, {"paperId": "fb5e2eca7ec1537d438f652b1079aab04d6b4221", "title": "Reinforcement Learning Methods for Computation Offloading: A Systematic Review"}, {"paperId": "98c5ab7d2bd2da77d73fbd790b90d1ca4082ef23", "title": "Task offloading strategy and scheduling optimization for internet of vehicles based on deep reinforcement learning"}, {"paperId": "4a94d87a487d05432aea58afe4ef604c26163bd4", "title": "Analysis of the Contribution of Computing for The Development of IT Service Centre"}, {"paperId": "58d3f0ed8f376c87f4088ff30ecafcd4397d154e", "title": "Motivation and Strategies for Effective Inclusion of Cloud Solution Provider Certifications in Computing Curricula"}, {"paperId": "df7bedea1313e8b48213e133c262d209dc79e7dc", "title": "Edge Based Priority-Aware Dynamic Resource Allocation for Internet of Things Networks"}, {"paperId": "1128580a21349c6954b9f96e5f101716e7a9bd18", "title": "A Real-time Privacy System for Electric Vehicles using Blockchain Technology"}, {"paperId": "b9cc0159d4e1c6313d27f3b7a9bed91d982c37b1", "title": "An Intelligent Automated System for Detecting Malicious Vehicles in Intelligent Transportation Systems"}, {"paperId": "52f9711f25235e95efc348a9d72eb4ea3443413e", "title": "An Advanced System-Level Testing for Roadside Multimodal Sensing and Processing in IoV"}, {"paperId": "612b306d1e853e010951d09000f7a9f931b674b6", "title": "Embedding Vendor Certifications in the Cloud Computing Curriculum: Scope, Strategy and Perceptions"}, {"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions"}, {"paperId": "e0bfd4f8f9cf89f59e4b1561e37b776eec2128f3", "title": "Reinforcement Learning Methods for Computing Offloading: A Systematic Review"}]}
