{"paperId": "096287b9beadf37909b52ce6d9e7539335dc2bd5", "publicationVenue": null, "title": "Empirical and Practical Implementation Methodology for Clinical Integration of E-Health Iot Technology", "abstract": "This paper structures empirical and practical implementation methodologies for clinical integration of eHealth IoT smart device technology embedded in Cloud service architecture. The results and findings of this two-year research program are summarized from mathematical, system architectural and software engineering perspective. The research takes place in the European Union, in Hungary. The program is the manifestation of the trilateral industry-university collaboration of the University of Debrecen Faculty of Informatics, T-Systems Healthcare Competence Center Central and Eastern Europe and Semmelweis University 2nd Pediatric Clinic Department of Pulmonology. The paper presents the mathematical model for the system architecture optimization. Selected system-architectural solution plans are mapped into directed graphs and converted into adjacency and availability matrices for optimization. Adequate technologies are collected and identified for the research based on industry megatrends. The experiment establishes multidirectional interoperability among eHealth smart devices, telemedicine instruments and clinical information systems. The Open Telemedicine Interoperability Hub, interoperability core module, was developed and embedded into Cloud service architecture. This module transposes and transmits the captured bio-sensory data stream from the eHealth IoT smart-devices and from the telemedicine instrument into the clinical information system. Dominant international healthcare interoperability standards are reviewed and selected for the research. The research program defined different interoperability levels and mapped these against the open systems interconnection model layers. The international interoperability standard, Health Level Seven, was selected for the research. The research explicitly tested interoperability among eHealth consumer electronic sensor-enabled smart-device, spirometer telemedicine instrument and cloud-based hospital information test system. The research proved that universal interoperability between IoT eHealth smart devices and clinical information system technology is from technical perspective absolutely possible. The paper describes the lessons learned, drawbacks and achievements of this research program. An insight is also given into the forthcoming research phase.", "venue": "", "year": 2016, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2016-12-27", "journal": {"name": "International Journal of Medical and Health Sciences", "pages": "117-125", "volume": "3"}, "authors": [{"authorId": "3431539", "name": "Abel Garai"}], "citations": [{"paperId": "80fb89d9e4eb534933c802a94421d215d687d97e", "title": "Blockchain for Giving Patients Control Over Their Medical Records"}, {"paperId": "2a582a1978bfc9cbfc6fbb84ff4088d7ece837f9", "title": "Internet of Things (IoT) in high-risk Environment, Health and Safety (EHS) industries: A comprehensive review"}]}
