{"paperId": "0965457a373b4726647c54e51403fbb420f1bb12", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "A unifying model for distributed data-intensive systems", "abstract": "Modern applications handle increasingly larger volumes of data, generated at an unprecedented and constantly growing rate. They introduce challenges that are radically transforming the research fields that gravitate around data management and processing, resulting in a blooming of distributed data-intensive systems. Each such system comes with its specific assumptions, data and processing model, design choices, implementation strategies, and guarantees. Yet, the problems data-intensive systems face and the solutions they propose are frequently overlapping. This tutorial presents a unifying model for data-intensive systems that dissects them into core building blocks, enabling a precise and unambiguous description and a detailed comparison. From the model, we derive a list of classification criteria and we use them to build a taxonomy of state-of-the-art systems. The tutorial offers a global view of the vast research field of data-intensive systems, highlighting interesting observations on the current state of things, and suggesting promising research directions.", "venue": "Distributed Event-Based Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2022-06-27", "journal": {"name": "Proceedings of the 16th ACM International Conference on Distributed and Event-Based Systems"}, "authors": [{"authorId": "2866882", "name": "Alessandro Margara"}], "citations": [{"paperId": "f903cc0fc8c6556e6db3743a7204417177886117", "title": "A brief survey on big data: technologies, terminologies and data-intensive applications"}]}
