{"paperId": "0980c813b9bfa4b4097158f6f4b4b5ee03b7a298", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "Adaptive Massively Parallel Algorithms for Cut Problems", "abstract": "We study the Weighted Min Cut problem in the Adaptive Massively Parallel Computation (AMPC) model. In 2019, Behnezhad et al. [3] introduced the AMPC model as an extension of the Massively Parallel Computation (MPC) model. In the past decade, research on highly scalable algorithms has had significant impact on many massive systems. The MPC model, introduced in 2010 by Karloff et al. [16], which is an abstraction of famous practical frameworks such as MapReduce, Hadoop, Flume, and Spark, has been at the forefront of this research. While great strides have been taken to create highly efficient MPC algorithms for a range of problems, recent progress has been limited by the 1-vs-2 Cycle Conjecture [20], which postulates that the simple problem of distinguishing between one and two cycles requires Ω(log n) MPC rounds. In the AMPC model, each machine has adaptive read access to a distributed hash table even when communication is restricted (i.e., in the middle of a round). While remaining practical [4], this gives algorithms the power to bypass limitations like the 1-vs-2 Cycle Conjecture.", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-05-27", "journal": {"name": "Proceedings of the 34th ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "1704161", "name": "M. Hajiaghayi"}, {"authorId": "147508395", "name": "Marina Knittel"}, {"authorId": "1991426950", "name": "J. Olkowski"}, {"authorId": "48985250", "name": "Hamed Saleh"}], "citations": [{"paperId": "a3bf6669d19fa023117d026a7ce4b6f71b2484f0", "title": "Massively Parallel Tree Embeddings for High Dimensional Spaces"}, {"paperId": "1184fca17606e02554bd3ce2f8c330d829ecfa50", "title": "Adaptive Massively Parallel Connectivity in Optimal Space"}]}
