{"paperId": "0984afc12b14db45296ee9e37ebe840505cd1b8f", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "A Qualitative Study on Framework Debugging", "abstract": "Features of frameworks, such as inversion of control and the structure of framework applications, require developers to adjust their programming and debugging strategies as compared to sequential programs. However, the benefits and challenges of framework debugging are not fully understood, and gaining this knowledge could provide guidance in debugging strategies and framework tool design. To gain insight into the framework application debugging process, we performed two human studies investigating how developers fix applications that use a framework API incorrectly. These studies focused on the Android Fragment class and the ROS framework. We analyzed the results of the studies using a mixed-methods approach, using techniques from qualitative approaches. Our analysis found that participants benefited from the structure of frameworks and the pre-made solutions to common problems in the domain. Participants encountered challenges with understanding frame-work abstractions, and had particular difficulty with inversion of control and object protocol issues. When compared to prior work on debugging, these results show that framework applications have unique debugging challenges.", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "568-579"}, "authors": [{"authorId": "2112248", "name": "Zack Coker"}, {"authorId": "35529938", "name": "D. Widder"}, {"authorId": "2957803", "name": "Claire Le Goues"}, {"authorId": "143882378", "name": "C. Bogart"}, {"authorId": "4566189", "name": "Joshua Sunshine"}], "citations": [{"paperId": "7f41ec70db32bf8d90d9b2fbca5dc9925e565798", "title": "What constitutes debugging? An exploratory study of debugging episodes"}, {"paperId": "4948c477bfa888281a47ec21aba4b4bc5ad5097e", "title": "Locating Framework-specific Crashing Faults with Compact and Explainable Candidate Set"}, {"paperId": "564abc73c7aa2cba1bea208c3f172abfc2e73342", "title": "Does the Stream API Benefit from Special Debugging Facilities? A Controlled Experiment on Loops and Streams with Specific Debuggers"}, {"paperId": "6e76ab15c36ca5b74b2b2b5c9d9de254689f644d", "title": "Trust in Collaborative Automation in High Stakes Software Engineering Work: A Case Study at NASA"}, {"paperId": "600992960cf9da69569d5a3ee7f6fb08238ec2c2", "title": "An Exploratory Study of Debugging Episodes"}, {"paperId": "b7d9412e8be3896affd6916119fc4f3bb79d0975", "title": "FrameFix: Automatically Repairing Statically-Detected Directive Violations in Framework Applications"}, {"paperId": "e9fadbd46f8b24d558c6f3edb46661387b903649", "title": "Using Hypotheses as a Debugging Aid"}, {"paperId": "199eeb6344fd6ed0102d0030128f327ce53bd90b", "title": "Rethinking Debugging and Debuggers"}]}
