{"paperId": "09854c6be0527cd3b1139515e5cc539b6ca4f3c5", "publicationVenue": null, "title": "Sustainable supplier selection under attractive criteria through FIS and integrated fuzzy MCDM techniques", "abstract": "ABSTRACT Suppliers as upstream partners play a crucial role to establish sustainability in the supply chain. For precise evaluation of the supplier’s performance on sustainability criteria researchers have mainly focused on Multi-Criteria Decision Making (MCDM) and Fuzzy Inference System (FIS) approaches. The objective of the paper is to evaluate the supplier’s sustainability performance through FIS and fuzzy MCDM approaches. Further, the results are compared and utilised to develop the Sustainable Supplier Selection (SSS) framework for the iron and steel industry of India. To calculate Suppliers Performance Index (SPI), three distinct FIS engines have been developed for each sustainability dimensions and fuzzy AHP and TOPSIS techniques are used for the MCDM environment. The results provide a deep inside of the sustainability performance of each supplier. It elicits from the results of two approaches, that ranks are interchanged among the top two suppliers.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-11", "journal": {"name": "International Journal of Sustainable Engineering", "pages": "441 - 462", "volume": "13"}, "authors": [{"authorId": "48889247", "name": "N. Jain"}, {"authorId": "143645469", "name": "A. Singh"}, {"authorId": "46228589", "name": "R. Upadhyay"}], "citations": [{"paperId": "dea6d3b0668a1eeeec3332b71d74b127e2007978", "title": "Sustainable Supplier Selection through Multi-Criteria Decision Making (MCDM) Approach: A Bibliometric Analysis"}, {"paperId": "46f3a8bfddf92bfcf7c1c4d02a09a8a06e7f7cd1", "title": "An integrated group fuzzy inference and best–worst method for supplier selection in intelligent circular supply chains"}, {"paperId": "0eafd8ca1bf21494566333f0088c5d2a93837bd4", "title": "An extended TODIM method for hyperbolic fuzzy environments"}, {"paperId": "da0d62b7b1162a6b5835b9ffa09dd17f66b9db47", "title": "A Novel Resilient and Sustainable Supplier Selection Model Based on Dahp and Dematel Methods"}, {"paperId": "ce51df13b8079713dd71e2350ea4c5c396524c24", "title": "Sustainable and resilient supplier selection in the context of circular economy: an ontology-based model"}, {"paperId": "663aaa01af3141d0bb24e6bf29a3ba8d6153765e", "title": "A Markovian-based fuzzy decision-making approach for the customer-based sustainable-resilient supplier selection problem"}, {"paperId": "aed69beb8c9ed10f5bf675e65ec919bfacde062a", "title": "Sustainable supplier selection in a construction company: a new MCDM method based on dominance-based rough set analysis"}, {"paperId": "a4f8a8492dbc60ac793d593b365030557395f463", "title": "A decision support system for classifying supplier selection criteria using machine learning and random forest approach"}, {"paperId": "01515571d4a429c7720e8125edbe95192dca3075", "title": "A fuzzy SWARA-WASPAS based approach for determining the role of lean practices in enabling the supply chain agility"}, {"paperId": "ace1cb5ee7860c76d91d496e28b1b1c69ffe2129", "title": "Site Selection of Car Parking with the GIS-based Fuzzy Multicriteria Decision Making"}, {"paperId": "6e65a5d17a366740083567c8151f28d6ce8e4c44", "title": "EDAS ve WASPAS yöntemleriyle tıbbi malzeme tedarikçisi belirleme"}, {"paperId": "ecb609abfb8f79a607e6292e14e1e263ab10d70c", "title": "Green Supplier Selection in a Fuzzy Environment: FIS and FPP Approaches"}, {"paperId": "851b9249da154b8ab1ec30323bc5307d3e9210a0", "title": "An integrated Fuzzy MCDM approach for modelling and prioritising the enablers of responsiveness in automotive supply chain using Fuzzy DEMATEL, Fuzzy AHP and Fuzzy TOPSIS"}, {"paperId": "3c37f26dcba450aaa95f2119e598a41f58595113", "title": "A decision framework model for hospital selection in COVID-19 pandemic: A FIS approach"}, {"paperId": "b05e7fee7a737cd197e49dfcd86c13ea3b9a0d65", "title": "Analisis Pemilihan Supplier Kain Byemi Official Store dengan Metode Fuzzy AHP dan Fuzzy Topsis"}, {"paperId": "7866e7b3502bb1873601b5542ae838256ad3603e", "title": "Sustainable supplier selection using HF-DEA-FOCUM-MABAC technique: a case study in the Auto-making industry"}, {"paperId": "a4687c40f1d1c75039488471e7d019088f517580", "title": "A Supplier Selection Model Using Alternative Ranking Process by Alternatives’ Stability Scores and the Grey Equilibrium Product"}, {"paperId": "6982029e1c4f8f540cdca5d2237339221cda80bf", "title": "Double hierarchy hesitant fuzzy linguistic information based framework for personalized ranking of sustainable suppliers"}, {"paperId": "145cb31215ce46c1c0c5129cdd63bf46c31f57e4", "title": "Analytical Network Process for Selecting Raw Material Suppliers of UNP100: A Case Study"}, {"paperId": "b0edd5373aa9492c6de6a6e6d10cf74325b32b96", "title": "Selection of resilient suppliers in manufacturing industries post-COVID-19: implications for economic and social sustainability in emerging economies"}, {"paperId": "2f32f58a5123cc5e37d9fe5dc2419a22f89831b6", "title": "An integrated approach for a sustainable supplier selection based on Industry 4.0 concept"}, {"paperId": "90cf15ae18e4a00a8959a74ca26788dd6e852bf2", "title": "An interval valued neutrosophic decision-making structure for sustainable supplier selection"}, {"paperId": "6d0242a7fdad78a0db3498c0cad82fc75d85b860", "title": "A Pythagorean Fuzzy Approach for Sustainable Supplier Selection Using TODIM"}, {"paperId": "cde1e6c5d018d0f789cafb794cc97c33857341d0", "title": "Comparative analysis of ranking the lean supply chain enablers: An AHP, BWM and fuzzy SWARA based approach"}, {"paperId": "ed0e56b80caf00fba51929ac54f96d5e067307c0", "title": "“A multi-tier sustainable food supplier selection model under uncertainty”"}, {"paperId": "5fc58ad1d486ae0b6cde3d4649a0ca230de0d9f0", "title": "Sustainable Supply Chain Management and Multi-Criteria Decision-Making Methods: A Systematic Review"}, {"paperId": "209a5dff62817836be2b9e3e886f326bcaff369e", "title": "Non-cooperative behavior management in group decision making by a conflict resolution process and its implementation for pharmaceutical supplier selection"}, {"paperId": "520ec906df27f4571134ce8625ca8efbcd74be55", "title": "Transition towards circular supplier selection in petrochemical industry: A hybrid approach to achieve sustainable development goals"}, {"paperId": "6158d2d098eb420f7ea3425bcc0e2462af2f7efc", "title": "A Dynamic Decision Support System for Sustainable Supplier Selection in Circular Economy"}, {"paperId": "19c49c0c0f6be1d6fdb2f426d42a8105fdfeb086", "title": "Analysing the adoption barriers for sustainability in the Indian power sector by DEMATEL approach"}, {"paperId": "01c7d51e78f80ee12deb39640e22b6fd917d7c59", "title": "A Fuzzy BWM Method for Evaluating Supplier Selection Factors in a SME Paper Manufacturer"}, {"paperId": "129f20cff91cd93e144fc2f4b824fe2720f7a42a", "title": "Sustainable Supplier Selection in Construction Industry through Hybrid Fuzzy-Based Approaches"}, {"paperId": "e29bd4ebcd5383b74a525697e51eb91120b25111", "title": "Construction of partner selection criteria in sustainable supply chains: A systematic optimization model"}, {"paperId": "6166f49baab1aeebaa7b8d37d08ad2ad9a08d683", "title": "An integrated approach for performance evaluation of mining industry: a case study of Iranian Steel Complex"}, {"paperId": "5b20be8f97bac3d0b698440900430613532238ab", "title": "Green Supplier Evaluation and Selections: A State-of-the-Art Literature Review of Models, Methods, and Applications"}, {"paperId": "bc58781efc7d7c3d7cb9329321b48d806805cff0", "title": "A decision support system for demand management in healthcare supply chains considering the epidemic outbreaks: A case study of coronavirus disease 2019 (COVID-19)"}, {"paperId": "30a28928f89fbede84b81751e92e4a03b11b8ad2", "title": "Optimization Agricultural Supply Chain: A Case Study of Fertilizer Supplier Selection"}, {"paperId": "0efa53b5c56d25fc2c0764a44b15852d957a8045", "title": "Supplier Evaluation With BWM and Fuzzy CODAS Methods"}, {"paperId": "4f76ede3f63572f2ae4ccbcbaaeccf824608a861", "title": "Green Supplier Evaluation and Selection: A Literature Review"}, {"paperId": "bf818e2b7b7ea8439cd9b0c11c5f68fdf4c8ee88", "title": "GSSOA Using Double Hierarchy Hesitant Linguistic Sets and Decision Field Theory"}, {"paperId": "534e4bbfaf71c9b7f26be22a9a6cba1bc5d23656", "title": "Selection a Suitable Supplier for Enhancing Supply Chain Management under Neutrosophic Environment"}]}
