{"paperId": "09a2ee26ea0cc0a6831363a5752b06c84a1ca57a", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "ExaMon-X: A Predictive Maintenance Framework for Automatic Monitoring in Industrial IoT Systems", "abstract": "In recent years, the Industrial Internet of Things (IIoT) has led to significant steps forward in many industries, thanks to the exploitation of several technologies, ranging from Big Data processing to artificial intelligence (AI). Among the various IIoT scenarios, large-scale data centers can reap significant benefits from adopting Big Data analytics and AI-boosted approaches since these technologies can allow effective predictive maintenance. However, most of the off-the-shelf currently available solutions are not ideally suited to the high-performance computing (HPC) context, e.g., they do not sufficiently take into account the very heterogeneous data sources and the privacy issues that hinder the adoption of the cloud solution, or they do not fully exploit the computing capabilities available in loco in a supercomputing facility. In this article, we tackle this issue, and we propose an IIoT holistic and vertical framework for predictive maintenance in supercomputers. The framework is based on a big lightweight data monitoring infrastructure, specialized databases suited for heterogeneous data, and a set of high-level AI-based functionalities tailored to HPC actors’ specific needs. We present the deployment and assess the usage of this framework in several in-production HPC systems.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "2995-3005", "volume": "10"}, "authors": [{"authorId": "2078352090", "name": "Andrea Borghesi"}, {"authorId": "51091982", "name": "Alessio Burrello"}, {"authorId": "2241007", "name": "Andrea Bartolini"}], "citations": [{"paperId": "6193360ec9229605574d45e971fd1c2f7c6b4fe9", "title": "Runtime Performance Anomaly Diagnosis in Production HPC Systems Using Active Learning"}, {"paperId": "be4bbe1f0b400d31714a87c151c5ad2421a08f3f", "title": "Towards defining industry 5.0 vision with intelligent and softwarized wireless network architectures and services: A survey"}, {"paperId": "59f7284b1d838fb25d821d82fb55f3887fb6c214", "title": "Integrating Big Data Analytics and Machine Learning for Predictive Maintenance within Industrial IoT Frameworks"}, {"paperId": "7cbfa02a55e44e1f1229f86654cb39219ea99358", "title": "A Robot-Operation-System-Based Smart Machine Box and Its Application on Predictive Maintenance"}, {"paperId": "8858d5af47c9e8085fa0699dfc9068e85ec3a98d", "title": "ControlPULP: A RISC-V On-Chip Parallel Power Controller for Many-Core HPC Processors with FPGA-Based Hardware-In-The-Loop Power and Thermal Emulation"}, {"paperId": "d7e395f5fb145062232c8dc80e00d4036f7652c6", "title": "The Graph-Massivizer Approach Toward a European Sustainable Data Center Digital Twin"}, {"paperId": "62ca79f41dd7f82e754d53333c0b9140a7a4e266", "title": "M100 ExaData: a data collection campaign on the CINECA’s Marconi100 Tier-0 supercomputer"}, {"paperId": "c07241ef44731308bc5b00c61e85701695ba885d", "title": "Graph Neural Networks for Anomaly Anticipation in HPC Systems"}, {"paperId": "7cca234b50f4b03dbf99b8579a5fd55a5a653094", "title": "Graph Greenifier: Towards Sustainable and Energy-Aware Massive Graph Processing in the Computing Continuum"}, {"paperId": "f85d7c086e3db42d1d121318e7fda0827b300c15", "title": "Predictive Maintenance Model for IIoT-Based Manufacturing: A Transferable Deep Reinforcement Learning Approach"}, {"paperId": "b1a05313e172e34ed29f42d54715b38c624fb2dd", "title": "Industry 5.0 is Coming: A Survey on Intelligent NextG Wireless Networks as Technological Enablers"}, {"paperId": "a4d0aac839613d69bdd6ecd20b22a5ccea6470ad", "title": "On the Convergence of Malleability and the HPC PowerStack: Exploiting Dynamism in Over-Provisioned and Power-Constrained HPC Systems"}]}
