{"paperId": "09b857a95a47268d2dcdd94b80ea7e8a30025e8a", "publicationVenue": {"id": "8d848812-c4dd-4524-a6ac-5f5822355b19", "name": "International journal of recent technology and engineering", "type": "journal", "alternate_names": ["Int j recent technol eng"], "issn": "2277-3878", "url": "https://www.ijrte.org/"}, "title": "Designing Authentication for Hadoop Cluster using DNA Algorithm", "abstract": "Big Data (BD) generation are exponentially increased and it is necessarily required for modern society. Hadoop Clusters (HC) provides the facilities like Processing, storage and doesn’t have built-in security. But this feature is important as it increases the analysis speed, storage process. HC facilitates storage, processing of data, on the other hand processing of streaming data handled by the Apache Spark. However data storage, processing power, cluster management and data security in HC is not reached up to the mark with increased data. In such situations, HC are scaled out from small scale IT organization and it depends on public cloud centers with lack of data security, communication, computation and operational cost. On the other hand data security in HC is major issue and it uses a separat security mechanisms. This paper proposes New Algorithm Built in Authentication Based on Access (BABA) as a security instance integrated as Hadoop instance for securing data in HC from attackers along with metadata security for avoiding crashes Hadoop. This mechanism provides a secured HC without using other security configurations which will reduce operational cost, computational power, increases data security and providing a better solution for HC.", "venue": "International journal of recent technology and engineering", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-09-30", "journal": {"name": "International Journal of Recent Technology and Engineering"}, "authors": [{"authorId": "2286025808", "name": "PVRD. Prasada Rao Balaraju.J."}], "citations": [{"paperId": "b84771819443580a541fa33bd3f178156bdf048e", "title": "Analysis of Machine Learning based Feature Selection Method for Sentiment Analysis"}, {"paperId": "c7622d542fd5a0dc03358b35cdc997b127a4582d", "title": "A Real Time Stock tendency prognostication using Quantopian"}]}
