{"paperId": "09c387b4dc231406fd0e6b3ed0fa955ca04823df", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Research on parallel solution of GRAPES Helmholtz equation", "abstract": "GRAPES is a new generation of numerical weather prediction system developed and used by Chinese researchers. As the accuracy requirement of weather prediction system is increasing, the grid resolution of the global model is greatly increasing; therefore, the computing power becomes one of the important factors restricting the performance of the numerical weather prediction system. In order to solve the problem, the paper introduces the geometric multi‐grid solution to solve the GRAPES Helmholtz equation. The core idea of multi‐grid solution is to eliminate the swing component of the residual by iterative algorithm and eliminate the smooth components of the residuals by using the coarse grid interpolation to correct the fine grid solution. This paper designs a parallel solution for GRAPES multi‐grid, including grid coarsening operation, smooth operation, and the coarsest grid accurate solution operation. Finally, the actual data with the resolution of 1 is tested, achieving the better acceleration effect. At the same time, the analysis and explanations of the test results have some useful conclusions.", "venue": "Concurrency and Computation", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-25", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "31"}, "authors": [{"authorId": "47786505", "name": "Jingmei Li"}, {"authorId": "145241136", "name": "Qiao Tian"}, {"authorId": "15050606", "name": "Fangyuan Zheng"}, {"authorId": "47203394", "name": "Weifei Wu"}, {"authorId": "48093756", "name": "Jiaxiang Wang"}], "citations": []}
