{"paperId": "09d7939578b31cbcf2fd73822a2fd7a9ad6d47c4", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Eye-tracking paradigms for the assessment of mild cognitive impairment: a systematic review", "abstract": "Mild cognitive impairment (MCI), representing the ‘transitional zone’ between normal cognition and dementia, has become a novel topic in clinical research. Although early detection is crucial, it remains logistically challenging at the same time. While traditional pen-and-paper tests require in-depth training to ensure standardized administration and accurate interpretation of findings, significant technological advancements are leading to the development of procedures for the early detection of Alzheimer’s disease (AD) and facilitating the diagnostic process. Some of the diagnostic protocols, however, show significant limitations that hamper their widespread adoption. Concerns about the social and economic implications of the increasing incidence of AD underline the need for reliable, non-invasive, cost-effective, and timely cognitive scoring methodologies. For instance, modern clinical studies report significant oculomotor impairments among patients with MCI, who perform poorly in visual paired-comparison tasks by ascribing less attentional resources to novel stimuli. To accelerate the Global Action Plan on the Public Health Response to Dementia 2017–2025, this work provides an overview of research on saccadic and exploratory eye-movement deficits among older adults with MCI. The review protocol was drafted based on the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Electronic databases were systematically searched to identify peer-reviewed articles published between 2017 and 2022 that examined visual processing in older adults with MCI and reported gaze parameters as potential biomarkers. Moreover, following the contemporary trend for remote healthcare technologies, we reviewed studies that implemented non-commercial eye-tracking instrumentation in order to detect information processing impairments among the MCI population. Based on the gathered literature, eye-tracking-based paradigms may ameliorate the screening limitations of traditional cognitive assessments and contribute to early AD detection. However, in order to translate the findings pertaining to abnormal gaze behavior into clinical applications, it is imperative to conduct longitudinal investigations in both laboratory-based and ecologically valid settings.", "venue": "Frontiers in Psychology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-07-20", "journal": {"name": "Frontiers in Psychology", "volume": "14"}, "authors": [{"authorId": "144731340", "name": "A. Wolf"}, {"authorId": "40806592", "name": "Kornkanok Tripanpitak"}, {"authorId": "2110925", "name": "S. Umeda"}, {"authorId": "1404355996", "name": "M. Otake-Matsuura"}], "citations": [{"paperId": "1ff2e66a79ffabb2ac945e2d722eb9ed9b5cf72b", "title": "Return to Play Following Concussion: Role for Imaging?"}, {"paperId": "7b26d8f690e63386c4004da079799152595c67ad", "title": "Eye-Tracking Technology in Dentistry: A Review of Literature"}, {"paperId": "f2a90fea97113f6da67baea2b0b9bc1ffbc1f571", "title": "Cognition and saccadic eye movement performance are impaired in chronic rhinosinusitis."}]}
