{"paperId": "09dbcddf00f6cbfbfee4e75768ddd930e76ddfa1", "publicationVenue": null, "title": "MapReduce a Comprehensive Review", "abstract": "MapReduce encompasses a framework in the processing and management of large scale datasets within a distributed cluster. The framework has been employed in several applications including search indexes generation, analysis of access log, document clustering, and other data analytics. A flexible computation model is adopted in MapReduce in addition to plain interface which comprises the functions of map and reduce. The interface is customizable based on application developers. MapReduce has captured the interest among many scholars whereby the interest has been on increasing its usability and efficiency in support to database-centric operations. Accordingly, this paper provides a complete review regarding a vast continuum of proposals and systems concentrating basically on the support of distributed data management and processing with the use of the framework of MapReduce.", "venue": "2018 International Conference on Smart Computing and Electronic Enterprise (ICSCEE)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-07-01", "journal": {"name": "2018 International Conference on Smart Computing and Electronic Enterprise (ICSCEE)", "pages": "1-6"}, "authors": [{"authorId": "1411347773", "name": "M. Al-Khasawneh"}, {"authorId": "49643108", "name": "S. Shamsuddin"}, {"authorId": "32044956", "name": "S. Hasan"}, {"authorId": "123006339", "name": "A. Bakar"}], "citations": [{"paperId": "247fab7659cf989ce9a24a26e1e78200a7727434", "title": "KESMR: A Knowledge Enrichment Semantic Model For Recommending Microblogs"}, {"paperId": "4a735a86c45e81bfafd5b7b61a99fde788456f30", "title": "An improved chaotic image encryption algorithm using Hadoop-based MapReduce framework for massive remote sensed images in parallel IoT applications"}, {"paperId": "ba70fc2a816b58ec3a4d3547d07a7ee408b11797", "title": "Intelligent Data Analytics for Diagnosing Melanoma Skin Lesions via Deep Learning in IoT System"}, {"paperId": "c5482cfc23bc95026569391eb59f3fb0d3a56277", "title": "Satellite images encryption Review"}, {"paperId": "f7959c2c6ae5212663b2f513a6bc9db516cd75a8", "title": "Energy- and locality-efficient multi-job scheduling based on MapReduce for heterogeneous datacenter"}]}
