{"paperId": "09f42a539948aa1f24d87abf234d6fd442f1a568", "publicationVenue": {"id": "a0a14d7c-582f-44e2-baab-9d0b8314dca3", "name": "Lernen, Wissen, Daten, Analysen", "type": "conference", "alternate_names": ["LWDA", "Lern Wissen Daten Anal"]}, "title": "Query-Driven Enforcement of Rule-Based Policies for Data-Privacy Compliance", "abstract": "Data privacy is currently a topic in vogue for many organizations. Many of them run enterprise data lakes as data source for an ungoverned ecosystem, wherein they have no overview concerning data processing. They aim for mechanisms that require unsophisticated implementation, are easy to use, assume as little technical knowledge as possible, and enable their privacy officers to determine who processes which data when and for which purpose. To overcome these challenges, we present a framework for query-driven enforcement of rule-based policies to achieve data-privacy compliance. Our framework can be integrated minimally intrusive in existing IT landscapes. In contrast to existing approaches, privacy officers do not require profound technical knowledge because our framework also enables non-experts in evaluating data processing in SQL queries by intuitionally comprehensive, tree-shaped visualizations. Queries can be classified as legal or illegal regarding dataprivacy compliance. We provide a domain-specific language for defining policy rules that can be enforced automatically and in real-time.", "venue": "Lernen, Wissen, Daten, Analysen", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"pages": "42-53"}, "authors": [{"authorId": "2697151", "name": "Peter K. Schwab"}, {"authorId": "1415884203", "name": "Maximilian S. Langohr"}, {"authorId": "1396014699", "name": "Jonas Röckl"}, {"authorId": "1413110984", "name": "Demian E. Vöhringer"}, {"authorId": "39190391", "name": "A. Wahl"}, {"authorId": "1399432410", "name": "K. Meyer-Wegener"}], "citations": [{"paperId": "10e4574708f6c9583bfd29a5a8f4a501921abf5b", "title": "Performance Evaluation of Policy-Based SQL Query Classification for Data-Privacy Compliance"}, {"paperId": "361876b764524897c39289b983dbae8fd7676bf5", "title": "We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomist"}, {"paperId": "1d1f9f6b919fe63ca8cefdd502b2f0853c6b1f5a", "title": "A Framework for DSL-Based Query Classification Using Relational and Graph-Based Data Models"}, {"paperId": "fd2f8524347680e1b0e5c5585f412e449908f472", "title": "Towards Evolutionary, Domain-Specific Query Classification Based on Policy Rules"}]}
