{"paperId": "09fb4f0360abd75bb915820dbe9e6ae62dceb090", "publicationVenue": {"id": "075686b2-f619-4359-8896-06f13bf76dfa", "name": "Journal of Information & Knowledge Management", "type": "journal", "alternate_names": ["J Inf  Knowl Manag"], "issn": "0219-6492", "url": "http://www.worldscinet.com/jikm/jikm.shtml"}, "title": "Big Data Capabilities and Firm's Performance: A Mediating Role of Competitive Advantage", "abstract": "Big data (BD) capabilities have now grabbed the attention of strategic management researchers because of their significant role in firm’s performance and success. Nonetheless, very little empirical evidence has so far been put forward about the contribution of BD capabilities towards a firm performance and Competitive Advantage (CA). This research examines the impact of Big Data Technological Capabilities (BDTC) and Big Data Personal Capabilities (BDPC) on firms’ performance with a mediating role of CA among the firms operating in the world’s top emerging economy such as China. Data were collected through structured questionnaires using a sample size of 312 firms. The hypotheses were tested in AMOS.21 using Structural Equation Modelling (SEM). The results indicate that BDTC and BDPC have significant positive impact on firm performance and CA and there is also significant positive relationship between CA and firm performance. The study highlights that CA partially mediates the relationship between BDTC and firm performance as well as between BDPC and firm performance. Hence, BD-oriented firms achieve CA which in turn leads to superior performance in dynamic markets. This study discussed implications for managerial practices.", "venue": "Journal of Information & Knowledge Management", "year": 2018, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "J. Inf. Knowl. Manag.", "pages": "1850045:1-1850045:28", "volume": "17"}, "authors": [{"authorId": "143943704", "name": "Muhammad Anwar"}, {"authorId": "66388086", "name": "Sher Zaman Khan"}, {"authorId": "35861098", "name": "S. Shah"}], "citations": [{"paperId": "6da5ddb68924a7dded376af5635072576df7c6ee", "title": "Do digital technologies pay off? A meta-analytic review of the digital technologies/firm performance nexus"}, {"paperId": "97b45640a7c007689af0ebfc68b0286be7f58344", "title": "Big data analytics capabilities: Patchwork or progress? A systematic review of the status quo and implications for future research"}, {"paperId": "6dc245b7c81415d4e134ffe699d195aff9f530b8", "title": "The nexus between circular economy innovation, market competitiveness, and triple bottom lines efficiencies among SMEs: evidence from emerging economies"}, {"paperId": "f150c508518b16ae60e28a177ce6691fff8898b9", "title": "Digitalization and Sustainable Competitive Performance in Small–Medium Enterprises: A Moderation Mediation Model"}, {"paperId": "6778fadd229b3133240062c8501360a4489094a5", "title": "Knowledge-Oriented Leadership in Powering Team Performance and Sustainable Competitive Advantages through Innovation: Evidence from Higher Education Institutions"}, {"paperId": "fbc1f76fd23c466d827e04919cca6b69b0274fc4", "title": "Impact of big data technological and personal capabilities on sustainable performance on Jordanian manufacturing companies: the mediating role of innovation"}, {"paperId": "48cae19e19303d35ea4cfa5f670afc4b537e809f", "title": "From Industry 4.0 adoption to innovation ambidexterity to firm performance: a MASEM analysis"}, {"paperId": "d356865bc8ace78ae24db1810f0a785645be7d4f", "title": "COMPETITIVE ADVANTAGE AS A MEDIATING EFFECT IN THE IMPACT OF GREEN INNOVATION AND FIRM PERFORMANCE"}, {"paperId": "6c2f5beb9717c2d963177eb5ac8881ff65a1e885", "title": "The Relationship between Strategic Planning, Strategic Flexibility and Firm Performance in SMES of Saudi Arabia: Mediating Role of Strategic Flexibility"}, {"paperId": "4ca5bfc9cfce41d5948894e9f0ca9035ad5684dd", "title": "The role of blockchain-enabled supply chain applications in improving supply chain performance: the case of Jordanian manufacturing sector"}, {"paperId": "b9addf7ee5cdffd186498bc7c0c54708db50455e", "title": "The influence of big data analytics technological capabilities and strategic agility on performance of private higher education institutions"}, {"paperId": "6140c72c671639684cec275edefcd4d188eace76", "title": "Strategic business value from big data analytics: An empirical analysis of the mediating effects of value creation mechanisms"}, {"paperId": "d579637f5c959303d45471f2b1d8a31b75808b36", "title": "Interplay in Circular Economy Innovation, Business Model Innovation, SDGs, and Government Incentives: A Comparative Analysis of Pakistani, Malaysian, and Chinese SMEs"}, {"paperId": "f1958f1dfe96833e9bf829f2793b72da3a0b6e99", "title": "The impacts of sustainable industrial revolution (IR) on the profitability of Hungarian food companies"}, {"paperId": "d241d5c527e5b6dd2a3437c0e3305f7993f142ce", "title": "The influence of big data analytic capabilities building and education on business model innovation"}, {"paperId": "fbef3eea233fe44b35e566ddf407826a12fd7f9e", "title": "What translates big data into business value? A meta-analysis of the impacts of business analytics on firm performance"}, {"paperId": "b438d81482bfc9b73b8211c0a0ce261a28f66329", "title": "Requirements for DataOps to foster Dynamic Capabilities in Organizations - A mixed methods approach"}, {"paperId": "b630f6130adcf7b3995e7d78a7a1d7056a9042ec", "title": "Maturity model toll to diagnose Industry 4.0 in the clothing industry"}, {"paperId": "a81e63c79ebc52b919a9025a106c0dfd89b0ec00", "title": "Big data analytics in supply chain management: a systematic literature review"}, {"paperId": "7f8e1a201cdd495882311a68dd0adf08f1c4c101", "title": "ENVIRONTMENTAL MANAGEMENT ACCOUNTING, COMPETITIVE ADVANTAGE, FIRM PERFOMANCE: INDONESIA’S MANUFACTURING SECTOR."}, {"paperId": "149ba296d5a391cc8fafccf1ac78a4ff0d59fa61", "title": "Industry 4.0 in textile and apparel sector: a systematic literature review"}, {"paperId": "8154890c591beeac0cdbfdb9868c5feefa1825ba", "title": "Supportive tactics for innovative and sustainability performance in emerging SMEs"}, {"paperId": "8f67c9d605bdc29e4700a39f2c8d11ca67329099", "title": "The Role of Green Supply Chain Management in Predicting Indonesian Firms’ Performance: Competitive Advantage and Board Size Influence"}, {"paperId": "0c1e9f84703febd501dd36d1baa9225f234de11f", "title": "Supply chain dynamics, big data capability and product performance"}, {"paperId": "b17bc2f52a9094a11a85aca4b97428298ffaa881", "title": "Orchestrating frugal eco-innovation: the plethora of challenges and diagnostics in lean startups of emerging economies"}, {"paperId": "e2d9c9de25c7c5b4d1d50ab495a674aa432a8f5f", "title": "The role of entrepreneurial orientation in tangible and intangible resource acquisition and new venture growth"}, {"paperId": "9ea58422cb7b4597fd9430ef9ea533398b7f6fd2", "title": "How Big Data Analytics Boosts Organizational Performance: The Mediating Role of the Sustainable Product Development"}, {"paperId": "dc04e5c69ae036fa3639baddfc19a861d2f2081f", "title": "Enablers to supply chain performance on the basis of digitization technologies"}, {"paperId": "41b664661f644e17d26bab37146c82f58fe6c604", "title": "Big data analytics (BDA) and degree of internationalization: the interplay between governance of BDA infrastructure and BDA capabilities"}, {"paperId": "0119e9378ab59d0318706f6a168adc9550745390", "title": "Data Analytics and SME Performance: A Bibliometric Analysis"}, {"paperId": "9f608425abddc7b79eb91db2ea80f6b4439338f2", "title": "Sustainable Competitive Advantage Driven by Big Data Analytics and Innovation"}, {"paperId": "ad4a99ec00f79d167818783538258bd7969b59b1", "title": "The Impact of Big Data Adoption on SMEs' Performance"}, {"paperId": "c8bba4cc91985710c655ffef6dc0b824bc711de0", "title": "The impact of technological capability on manufacturing companies: A review"}, {"paperId": "7325d2f8e74e08a106e7f780c8b74e2dd7440c06", "title": "Antecedents to firm performance and competitiveness using the lens of big data analytics: a cross-cultural study"}, {"paperId": "5d0ec57252dfe93eeaadae1ef21a59ce46d19821", "title": "Big Data Analytics and Organizational Performance: A Meta-Analysis Study"}, {"paperId": "a9474cfaa219785791287cac119c20dc2d40fbff", "title": "The Contribution of Big Data to Achieving a Competitive Advantage: Proposal of a Conceptual Model Based on the VRIN Model"}, {"paperId": "e81b75d29f1a3305277103eb29c0305aff41781c", "title": "Big Data and Predictive Analytics Capabilities: A Review of Literature on Its Impact on Firm’s Financial Performance"}, {"paperId": "307afd7aa8e5fbdf8a341977cb1471ce668398ec", "title": "Big data-driven supply chain performance measurement system: a review and framework for implementation"}, {"paperId": "6f2e0ce0e40d5c7bd0ed9f0be0e0decf2ae70a3e", "title": "Analytical Study on Building a Comprehensive Big Data Management Maturity Framework"}, {"paperId": "9a146fc949b22ac3a10147b80a9bdf5217b105d9", "title": "The role of the social and technical factors in creating business value from big data analytics: A meta-analysis"}, {"paperId": "1063e3a9605aa6ce71b88dcaa610baaceab0d9bb", "title": "Unravelling the relationship between a firm's big data analytics capability and the realization of a competitive advantage: an IT business value approach"}, {"paperId": "33eea8d982673af56a91bbf631c0d8aab9db3a36", "title": "STRATEGY IS ALL ABOUT DELIBERATELY MAKING CHOICES AND TRADE-OFFS: ANALOGY BETWEENFULLY-FLEDGED ISLAMIC BANKS AND CONVENTIONAL BANKS WITH ISLAMIC WINDOWS"}, {"paperId": "c39b2fb3b9a2500e624f5caea10c11b0b5860d93", "title": "EXPLORING THE RELATIONSHIP BETWEEN BIG DATA AND FIRM PERFORMANCE"}, {"paperId": "bc059d8832ba592c6c52ea897fa471c487e99220", "title": "IT capability, capital availability and firm performance"}]}
