{"paperId": "0a0496ca395ff3a8ed3d99d43bbc623b167c8f9a", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Small is Beautiful: Distributed Orchestration of Spatial Deep Learning Workloads", "abstract": "Several domains such as agriculture, urban sustainability, and meteorology entail processing satellite imagery for modeling and decision-making. In this study, we describe our novel methodology to train deep learning models over collections of satellite imagery. Deep learning models are computationally and resource expensive. As dataset sizes increase, there is a corresponding increase in the CPU, GPU, disk, and network I/O requirements to train models. Our methodology exploits spatial characteristics inherent in satellite data to partition, disperse, and orchestrate model training workloads. Rather than train a single, all-encompassing model we facilitate producing an ensemble of models - each tuned to a particular spatial extent. We support query-based retrieval of targeted portions of satellite imagery including those that satisfy properties relating to cloud occlusion, We validate the suitability of our methodology by supporting deep learning models for multiple spatial analyses. Our approach is agnostic of the underlying deep learning library. Our extensive empirical benchmark demonstrates the suitability of our methodology to not just preserve accuracy, but reduce completion times by 13.9x while reducing data movement costs by 4 orders of magnitude and ensuring frugal resource utilization.", "venue": "International Conference on Utility and Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE/ACM 13th International Conference on Utility and Cloud Computing (UCC)", "pages": "101-111"}, "authors": [{"authorId": "2425318", "name": "Daniel Rammer"}, {"authorId": "1434550792", "name": "Kevin Bruhwiler"}, {"authorId": "1404303168", "name": "Paahuni Khandelwal"}, {"authorId": "2054679088", "name": "Samuel Armstrong"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "9518d377479c1388af901783259ad696952ac0a1", "title": "Enabling Fast, Effective Visualization of Voluminous Gridded Spatial Datasets"}, {"paperId": "53684e6fb3b966a60b7fe46eda101e741f8ca144", "title": "Mind the Gap: Generating Imputations for Satellite Data Collections at Myriad Spatiotemporal Scopes"}]}
