{"paperId": "0a0d27b74bb793b522542d0505fe41b13c41422c", "publicationVenue": {"id": "6685e459-41d2-4a6e-a3c4-5266057e98fd", "name": "Portland International Conference on Management of Engineering and Technology", "type": "conference", "alternate_names": ["PICMET", "Portland Int Conf Manag Eng Technol"]}, "title": "Increasing Labor Productivity in Intelligent Manufacturing Enterprises : An Approach to Identify Relevant Capability Bundles", "abstract": "Manufacturing companies operate in a competitive landscape that forces them to constantly evolve. Traditionally, optimization cycles focus on manufacturing process improvements and material costs reductions to continuously increase productivity. Today, however, manufacturing companies have arrived on the horizon of the fourth industrial revolution. Where in history steam power, electricity, as well as information and communication technologies were the big enablers for productivity increases, the next step is based on the use of data. Strategies for collecting, storing, using, and transforming data give “intelligent” enterprises access to insights and business knowledge that previously remained underexploited. Only when these companies can identify the specific capabilities needed to realize the vision of an “intelligent manufacturing enterprise” they can effectively use these data technologies to sustainably increase labor productivity. The authors present a model structure to decompose mechanisms for data-driven labor productivity increases and relate the relevant capabilities to unlock those potentials. This will support managers of manufacturing enterprises to set the course towards further productivity increases, ultimately helping the company to persist in its competitive environment.", "venue": "Portland International Conference on Management of Engineering and Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-08-01", "journal": {"name": "2022 Portland International Conference on Management of Engineering and Technology (PICMET)", "pages": "1-12"}, "authors": [{"authorId": "145162690", "name": "G. Schuh"}, {"authorId": "52148887", "name": "Thomas Scheuer"}], "citations": []}
