{"paperId": "0a107ec8b37ed53089b59db83f80f0fd02545c94", "publicationVenue": null, "title": "Electronic health record-based facilitation of familial hypercholesterolaemia detection sensitivity of different algorithms in genetically confirmed patients", "abstract": "Abstract Aims Familial hypercholesterolaemia (FH) is a disorder of LDL cholesterol clearance, resulting in increased risk of cardiovascular disease. Recently, we developed a Dutch Lipid Clinic Network (DLCN) criteria-based algorithm to facilitate FH detection in electronic health records (EHRs). In this study, we investigated the sensitivity of this and other algorithms in a genetically confirmed FH population. Methods and results All patients with a healthcare insurance-related coded diagnosis of ‘primary dyslipidaemia’ between 2018 and 2020 were assessed for genetically confirmed FH. Data were extracted at the time of genetic confirmation of FH (T1) and during the first visit in 2018–2020 (T2). We assessed the sensitivity of algorithms on T1 and T2 for DLCN ≥ 6 and compared with other algorithms [familial hypercholesterolaemia case ascertainment tool (FAMCAT), Make Early Diagnoses to Prevent Early Death (MEDPED), and Simon Broome (SB)] using EHR-coded data and using all available data (i.e. including non-coded free text). 208 patients with genetically confirmed FH were included. The sensitivity (95% CI) on T1 and T2 with EHR-coded data for DLCN ≥ 6 was 19% (14–25%) and 22% (17–28%), respectively. When using all available data, the sensitivity for DLCN ≥ 6 was 26% (20–32%) on T1 and 28% (22–34%) on T2. For FAMCAT, the sensitivity with EHR-coded data on T1 was 74% (67–79%) and 32% (26–39%) on T2, whilst sensitivity with all available data was 81% on T1 (75–86%) and 45% (39–52%) on T2. For Make Early Diagnoses to Prevent Early Death MEDPED and SB, using all available data, the sensitivity on T1 was 31% (25–37%) and 17% (13–23%), respectively. Conclusions The FAMCAT algorithm had significantly better sensitivity than DLCN, MEDPED, and SB. FAMCAT has the best potential for FH case-finding using EHRs.", "venue": "European Heart Journal - Digital Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-17", "journal": {"name": "European Heart Journal. Digital Health", "pages": "578 - 586", "volume": "3"}, "authors": [{"authorId": "2161054046", "name": "N. Mohammadnia"}, {"authorId": "51877432", "name": "R. Akyea"}, {"authorId": "4757323", "name": "N. Qureshi"}, {"authorId": "6217062", "name": "W. Bax"}, {"authorId": "33974612", "name": "J. Cornel"}], "citations": []}
