{"paperId": "0a2cb7eb17c320ecec3581ce4368e9cb53d2ff96", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "REIP: A Reconfigurable Environmental Intelligence Platform and Software Framework for Fast Sensor Network Prototyping", "abstract": "Sensor networks have dynamically expanded our ability to monitor and study the world. Their presence and need keep increasing, and new hardware configurations expand the range of physical stimuli that can be accurately recorded. Sensors are also no longer simply recording the data, they process it and transform into something useful before uploading to the cloud. However, building sensor networks is costly and very time consuming. It is difficult to build upon other people’s work and there are only a few open-source solutions for integrating different devices and sensing modalities. We introduce REIP, a Reconfigurable Environmental Intelligence Platform for fast sensor network prototyping. REIP’s first and most central tool, implemented in this work, is an open-source software framework, an SDK, with a flexible modular API for data collection and analysis using multiple sensing modalities. REIP is developed with the aim of being user-friendly, device-agnostic, and easily extensible, allowing for fast prototyping of heterogeneous sensor networks. Furthermore, our software framework is implemented in Python to reduce the entrance barrier for future contributions. We demonstrate the potential and versatility of REIP in real world applications, along with performance studies and benchmark REIP SDK against similar systems.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "82799462", "name": "Yurii Piadyk"}, {"authorId": "2158821210", "name": "Bea Steers"}, {"authorId": "1887741", "name": "C. Mydlarz"}, {"authorId": "108015628", "name": "Mahiny A. Salman"}, {"authorId": "145283043", "name": "Magdalena Fuentes"}, {"authorId": "2150097476", "name": "Junaid Khan"}, {"authorId": "2158160836", "name": "Hong Jiang"}, {"authorId": "3397270", "name": "K. Ozbay"}, {"authorId": "34894065", "name": "J. Bello"}, {"authorId": "2165755853", "name": "Claudio Silva"}], "citations": [{"paperId": "cf792192bf049a607eabdd0f92e904b01df08d21", "title": "Application of the Reconfigurable Environmental Intelligence Platform for HVAC Control"}, {"paperId": "63fa6fe4a9f1326a341369201c5930adb1f16459", "title": "StreetAware: A High-Resolution Synchronized Multimodal Urban Scene Dataset"}, {"paperId": "ff52eaf8baf7cfb10b459bae5fb8ce891e72e899", "title": "Monitoring and Control Framework for IoT, Implemented for Smart Agriculture"}, {"paperId": "79d94afe0c5d06c4d8df7c05f8921f4732a12fea", "title": "Parallel Processing of Sensor Data in a Distributed Rules Engine Environment through Clustering and Data Flow Reconfiguration"}]}
