{"paperId": "0a4b7fff218ddbdd4ea952f26313c837df8f8e44", "publicationVenue": null, "title": "Representing and learning relations and properties under uncertainty", "abstract": "The world around us is composed of entities, each having various properties and participating in relationships with other entities. Consequently, data is often inherently relational. This dissertation studies probabilistic relational representations, reasoning and learning with a focus on three common prediction problems for relational data: link prediction, property prediction, and joint prediction. For link prediction, we develop a tensor factorization model called SimplE which is simple, interpretable, fully-expressive, and integratable with certain types of domain expert knowledge. On two standard benchmarks for knowledge graph completion, we show how SimplE outperforms the state-of-the-art models. For property prediction, first we study the limitations of the existing StaRAI models when being used for property prediction. Based on this study, we develop relational neural networks which combine ideas from lifted relational models with deep learning and perform well empirically. We base the joint prediction on lifted relational models for which parameter learning typically requires inference over a highly-connected graphical model. The inference step is usually the bottleneck for learning. We study a class of inference algorithms known as lifted inference which makes inference tractable by exploiting both conditional independence and symmetries. We study two ways of speeding up lifted inference algorithms: 1through proposing heuristics for elimination ordering and 2through compiling the lifted operations to low-level languages. We also expand the largest known class of models for which we know how to do efficient lifted inference. Thus, structure learning algorithms for lifted relational models that restrict the search space to models for which efficient inference algorithms exist can perform their search over a larger space.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2470890", "name": "Seyed Mehran Kazemi"}], "citations": [{"paperId": "d133783c06fc5b1d34c90dc4a15b7c907f556230", "title": "A Knowledge-Enhanced Framework for Imitative Transportation Trajectory Generation"}, {"paperId": "8e1af41753b94ac01a401d422c9e67a97d8b4582", "title": "Learning Diachronic Embedding and Time-Encoding Sequences for Temporal Knowledge Graph Completion"}, {"paperId": "8a8e4fa580a81ba2fcb86965f323709cafcab275", "title": "Representation Learning for Dynamic Graphs: A Survey"}, {"paperId": "f89ecf4e7ef689db10edd082eea3fea93604e1f3", "title": "Relational Representation Learning for Dynamic (Knowledge) Graphs: A Survey"}, {"paperId": "c15c0a570d2df341253786e1beafc1ef31295cd3", "title": "3DRTE: 3D Rotation Embedding in Temporal Knowledge Graph"}]}
