{"paperId": "0a4e2a789da363eb97be51d435cfc80f401356e7", "publicationVenue": {"id": "294911be-9099-4a8f-9b8e-832d1916ba08", "name": "Ubiquitous Computing, Electronics & Mobile Communication Conference", "type": "conference", "alternate_names": ["UEMCON", "Ubiquitous Comput Electron  Mob Commun Conf"]}, "title": "Security Architecture Framework for Internet of Things (IoT)", "abstract": "The Internet of Things (IoT) nowadays plays an essential and critical role in our lives and is beginning to dominate Internet communications. The twenty-first century will continue to witness exponential growth and dependence on IoT systems in all aspects of life from smart homes, smart vehicles, e-health, smart cities, and smart grid to wearables, and medical devices that are becoming more microscopic due to the increase in processing ability and communications capabilities. The massive deployment of IoT devices in various domains has increased security threats to IoT devices and systems and created internet of vulnerabilities. Different bodies have proposed several fundamental architectural models for IoT. Privacy and security requirements and challenges of IoT are different from any other types of communications. Building trust between different entities and systems is the motive behind this work. This paper proposes a novel security architecture framework for IoT.", "venue": "Ubiquitous Computing, Electronics & Mobile Communication Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 10th Annual Ubiquitous Computing, Electronics & Mobile Communication Conference (UEMCON)", "pages": "0154-0157"}, "authors": [{"authorId": "144469633", "name": "Muath A. Obaidat"}, {"authorId": "28285069", "name": "Matluba Khodjaeva"}, {"authorId": "35063820", "name": "S. Obeidat"}, {"authorId": "2726669", "name": "D. Salane"}, {"authorId": "2073201071", "name": "Jennifer Holst"}], "citations": [{"paperId": "25ecf980052965f26123b1e324ddb57e1bd20338", "title": "Machine Learning Based Framework for Attack Detection on IoT Devices"}, {"paperId": "ff4d353563518e24972841c25c25c69857f9e58a", "title": "A novel privacy protection scheme for internet of things based on blockchain and privacy set intersection technique"}, {"paperId": "fdd1cb8ed5519c9161d2a48b7aa5b498711d117f", "title": "IoT-based Application of Information Security Triad"}, {"paperId": "e82d75dde9bfbd7383e7c5ed907c5d8e26cd04f3", "title": "A Hybrid Dynamic Encryption Scheme for Multi-Factor Verification: A Novel Paradigm for Remote Authentication"}, {"paperId": "3e6cc7f212368ed5e5682f1609b26d0c7fa03457", "title": "Intelligent mobility: a review of the cybersecurity of IoT in smart cities"}, {"paperId": "7327190551db88f3faf08e064f0fca315d18ab6e", "title": "A Comprehensive and Systematic Survey on the Internet of Things: Security and Privacy Challenges, Security Frameworks, Enabling Technologies, Threats, Vulnerabilities and Countermeasures"}, {"paperId": "d4f7facda51bcba5227bc2093f04a6026de7d893", "title": "An Efficient Authenticated Elliptic Curve Cryptography Scheme for Multicore Wireless Sensor Networks"}, {"paperId": "9224e532ce91ed6c99fdc46096d17fb39225ec50", "title": "Techniques to Improve Reliability in an IoT Architecture Framework for Intelligent Products"}, {"paperId": "8857d12ef1d8f2216f517befc7d15f7047f2b34b", "title": "Perspectives of Blockchain in Cybersecurity"}, {"paperId": "d011a86ec7c10aba5a6ace807ca7623e16cbab39", "title": "Hierarchical Structure and Security Model of Internet of Things"}]}
