{"paperId": "0a4f7757e60ca0b8e52ff9df7f0663e5c37eb937", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "ProvLight: Efficient Workflow Provenance Capture on the Edge-to-Cloud Continuum", "abstract": "Modern scientific workflows require hybrid infrastructures combining numerous decentralized resources on the IoT/Edge interconnected to Cloud/HPC systems (aka the Computing Continuum) to enable their optimized execution. Understanding and optimizing the performance of such complex Edge-to-Cloud workflows is challenging. Capturing the provenance of key performance indicators, with their related data and processes, may assist in understanding and optimizing workflow executions. However, the capture overhead can be prohibitive, particularly in resource-constrained devices, such as the ones on the IoT/Edge.To address this challenge, based on a performance analysis of existing systems, we propose ProvLight, a tool to enable efficient provenance capture on the IoT/Edge. We leverage simplified data models, data compression and grouping, and lightweight transmission protocols to reduce overheads. We further integrate ProvLight into the E2Clab framework to enable workflow provenance capture across the Edge-to-Cloud Continuum. This integration makes E2Clab a promising platform for the performance optimization of applications through reproducible experiments.We validate ProvLight at a large scale with synthetic workloads on 64 real-life IoT/Edge devices in the FIT IoT LAB testbed. Evaluations show that ProvLight outperforms state-of-the-art systems like ProvLake and DfAnalyzer in resource-constrained devices. ProvLight is 26—37x faster to capture and transmit provenance data; uses 5—7x less CPU; 2x less memory; transmits 2x less data; and consumes 2—2.5x less energy. ProvLight [1] and E2Clab [2] are available as open-source tools.", "venue": "IEEE International Conference on Cluster Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-20", "journal": {"name": "2023 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "221-233"}, "authors": [{"authorId": "21168032", "name": "Daniel Rosendo"}, {"authorId": "1763201", "name": "M. Mattoso"}, {"authorId": "1726606", "name": "Alexandru Costan"}, {"authorId": "144712722", "name": "Renan Souza"}, {"authorId": "2120208943", "name": "Débora B. Pina"}, {"authorId": "144255847", "name": "P. Valduriez"}, {"authorId": "1779139", "name": "Gabriel Antoniu"}], "citations": [{"paperId": "97248b3e7415d2abf7acd723de8b006ca76373d6", "title": "Towards Lightweight Data Integration Using Multi-Workflow Provenance and Data Observability"}]}
