{"paperId": "0a57c4383c963975602afef6e7caff023be16cc7", "publicationVenue": {"id": "b61ce141-a434-431b-a154-68fc26e348f3", "name": "Proceedings of the Royal Society A", "type": "journal", "alternate_names": ["Proc R Soc A", "Proc R Soc Math Phys Eng Sci", "Proceedings of The Royal Society A: Mathematical, Physical and Engineering Sciences"], "issn": "1364-5021", "url": "https://www.jstor.org/journal/procmathphysengi", "alternate_urls": ["http://rspa.royalsocietypublishing.org/content/by/year", "http://rspa.royalsocietypublishing.org/about", "http://rspa.royalsocietypublishing.org/", "https://royalsocietypublishing.org/journal/rspa"]}, "title": "Making big data small", "abstract": "Big data analytics is often prohibitively costly and is typically conducted by parallel processing with a cluster of machines. Is big data analytics beyond the reach of small companies that can only afford limited resources? This paper tackles this question by presenting Boundedly EvAlable SQL (BEAS), a system for querying big relations with constrained resources. The idea is to make big data small. To answer a query posed on a dataset, it often suffices to access a small fraction of the data no matter how big the dataset is. In the light of this, BEAS answers queries on big data by identifying and fetching a small set of the data needed. Under available resources, it computes exact answers whenever possible and otherwise approximate answers with accuracy guarantees. Underlying BEAS are principled approaches of bounded evaluation and data-driven approximation, the focus of this paper.", "venue": "Proceedings of the Royal Society A", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "Proceedings of the Royal Society A", "volume": "475"}, "authors": [{"authorId": "144502903", "name": "W. Fan"}], "citations": [{"paperId": "b3f7fa21ff32a80b027e9ddd6643f31a186eb9a8", "title": "Bounded Evaluation: Querying Big Data with Bounded Resources"}]}
