{"paperId": "0a5b56b38648b18786f42cc78104e181ff09645e", "publicationVenue": {"id": "757ec547-4fbf-4010-b6ae-c6b833ccd3a4", "name": "Frontiers in Energy Research", "type": "journal", "alternate_names": ["Front Energy Res"], "issn": "2296-598X", "url": "http://www.frontiersin.org/Energy_Research", "alternate_urls": ["https://www.frontiersin.org/journals/energy-research", "http://www.frontiersin.org/Energy_Research/archive"]}, "title": "Automaker’s credits strategy considering fuel consumption and endurance capacity constraints under dual-credit policy in China", "abstract": "After implementing the Dual-credit policy, automakers must adjust their production and operation strategies to cope with policy changes. This paper studies an automotive supply chain consisting of an automaker that produces traditional fuel vehicles and new energy vehicles and a dealer as the research object. Meanwhile, this paper constructs a trading strategy and a cooperative strategy model considering consumers’ fuel consumption sensitivity and endurance capacity sensitivity. This paper also compares decentralized and centralized decision-making of automotive supply chain under different strategies. Furthermore, this paper compares and analyzes the optimal credits strategies of automaker with different investment amounts. The research finds that automaker can obtain positive new energy vehicle credits (NEV credits) through direct trading or by cooperatively obtaining NEV credits with other automakers. Whether automaker chooses the trading strategy or the cooperative strategy, members’ profits of centralized decision-making in automobile supply chain are better than decentralized decision-making. When the investment amount of automaker is small, the cooperative strategy is more advantageous. After coordination through the revenue-sharing contract, the benefits of supply chain members reach Pareto optimality. This paper helps enterprises effectively deal with the Dual-credit policy and provides a reference for achieving carbon emission reduction targets in China.", "venue": "Frontiers in Energy Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-12", "journal": {"volume": "10"}, "authors": [{"authorId": "143652810", "name": "Hong Huo"}, {"authorId": "2175589780", "name": "Dan Luo"}, {"authorId": "2086838", "name": "Zhanghua Yan"}], "citations": [{"paperId": "0b3e308acf3f0574595c44232fdc933ca3fd6d2a", "title": "Can “dual credit” replace “subsidies” successfully? -based on analysis of vehicle supply chain decisions under the digital transformation of technology"}, {"paperId": "691704d96e5359fa206e9c64f93b84190663d4bd", "title": "Pricing of New Energy Vehicles Considering the Dual Credit Policy"}]}
