{"paperId": "0a5e2f812e0f8fc8e71dc74292193cea33c8d422", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "GenTKG: Generative Forecasting on Temporal Knowledge Graph", "abstract": "The rapid advancements in large language models (LLMs) have ignited interest in the temporal knowledge graph (tKG) domain, where conventional embedding-based and rule-based methods dominate. The question remains open of whether pre-trained LLMs can understand structured temporal relational data and replace them as the foundation model for temporal relational forecasting. Therefore, we bring temporal knowledge forecasting into the generative setting. However, challenges occur in the huge chasms between complex temporal graph data structure and sequential natural expressions LLMs can handle, and between the enormous data sizes of tKGs and heavy computation costs of finetuning LLMs. To address these challenges, we propose a novel retrieval-augmented generation framework named GenTKG combining a temporal logical rule-based retrieval strategy and few-shot parameter-efficient instruction tuning to solve the above challenges, respectively. Extensive experiments have shown that GenTKG outperforms conventional methods of temporal relational forecasting with low computation resources using extremely limited training data as few as 16 samples. GenTKG also highlights remarkable cross-domain generalizability with outperforming performance on unseen datasets without re-training, and in-domain generalizability regardless of time split in the same dataset. Our work reveals the huge potential of LLMs in the tKG domain and opens a new frontier for generative forecasting on tKGs. Code and data are released here: https://github.com/mayhugotong/GenTKG.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-11", "journal": {"name": "ArXiv", "volume": "abs/2310.07793"}, "authors": [{"authorId": "2072387342", "name": "Ruotong Liao"}, {"authorId": "2257432618", "name": "Xu Jia"}, {"authorId": "10684484", "name": "Yunpu Ma"}, {"authorId": "1742501819", "name": "Volker Tresp"}], "citations": [{"paperId": "a15364e83f8986d8b8b1b6212596071e4f2d986d", "title": "Chain of History: Learning and Forecasting with LLMs for Temporal Knowledge Graph Completion"}, {"paperId": "1a10ff8e42059451b1e0a40d1732175d0386a744", "title": "Zero-Shot Relational Learning on Temporal Knowledge Graphs with Large Language Models"}]}
