{"paperId": "0a6aaf4de0055074b9a3b0250a63db827ee8b5d4", "publicationVenue": null, "title": "Applying compression algorithms on hadoop cluster implementing through apache tez and hadoop mapreduce", "abstract": "The latest and famous subject all over the cloud research area is Big Data; its main appearances are volume, velocity and variety. The characteristics are difficult to manage through traditional software and their various available methodologies. To manage the data which is occurring from various domains of big data are handled through Hadoop, which is open framework software which is mainly developed to provide solutions. Handling of big data analytics is done through Hadoop Map Reduce framework and it is the key engine of hadoop cluster and it is extensively used in these days. It uses batch processing system. Apache developed an engine named \"Tez\", which supports interactive query system and it won't writes any temporary data into the Hadoop Distributed File System(HDFS).The paper mainly focuses on performance juxtaposition of MapReduce and TeZ, performance of these two engines are examined through the compression of input files and map output files. To compare two engines we used Bzip compression algorithm for the input files and snappy for the map out files. Word Count and Terasort gauge are used on our experiments. For the Word Count gauge, the results shown that Tez engine has better execution time than Hadoop MapReduce engine for the both compressed and non-compressed data. It has reduced the execution time nearly 39% comparing to the execution time of the Hadoop MapReduce engine. Correspondingly for the terasort gauge, the Tez engine has higher execution time than Hadoop MapReduce engine.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-05-07", "journal": {"name": "International journal of engineering and technology", "pages": "80", "volume": "7"}, "authors": [{"authorId": "1643855765", "name": "D. L. Lydia"}, {"authorId": "2286154215", "name": "M. SrinivasaRao"}], "citations": [{"paperId": "a184143861103bfb040ffd64d302e09532afc6a1", "title": "Research on the Secure Medical Big Data Ecosystem Based on Hadoop"}, {"paperId": "5fa58456ac6e7e38f15d5c813d240709af444ecb", "title": "A Review of Machine Learning and It’s Method"}, {"paperId": "27a70014848cce2f778e80a7d8bc401b257a4661", "title": "Predictive Analytics: A Study, Inclinations, Applications & Challenges"}]}
