{"paperId": "0a6d49377e422a749660622bb785ad9642503d6b", "publicationVenue": null, "title": "Exploring privacy-enhancing technologies in the automotive value chain", "abstract": "Privacy-enhancing technologies (PETs) are becoming increasingly crucial for addressing customer needs, security, privacy (e. g., enhancing anonymity and confidentiality), and regulatory requirements. However, applying PETs in organizations requires a precise understanding of use cases, technologies, and limitations. This paper investigates several industrial use cases, their characteristics, and the potential applicability of PETs to these. We conduct expert interviews to identify and classify uses cases, a gray literature review of relevant open-source PET tools, and discuss how the use case characteristics can be addressed using PETs’ capabilities. While we focus mainly on automotive use cases, the results also apply to other use case domains.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "1265-1272"}, "authors": [{"authorId": "1740613789", "name": "Gonzalo Munilla Garrido"}, {"authorId": "2111966322", "name": "Kaja Schmidt"}, {"authorId": "1579524882", "name": "Christopher Harth-Kitzerow"}, {"authorId": "9653883", "name": "Johannes Klepsch"}, {"authorId": "50631038", "name": "André Luckow"}, {"authorId": "2522197", "name": "F. Matthes"}], "citations": [{"paperId": "9fd88e5d05a4a989fb8562ef389d70b5910f1d73", "title": "Investigating Relevant Data in Automotive Procurement Departments: External Shocks as Transparency Creator for Data Deficits in Decision-Making"}, {"paperId": "ca05b2cc6bdd3bf4a59e28189ea2c48b92253d80", "title": "Towards User-Centered Privacy Adaptation Management: Insights From Privacy Research and a System-of-Systems Architecture"}, {"paperId": "59884d101f055e5b7466bcf55a1ad1037d3e7309", "title": "Mitigating Sovereign Data Exchange Challenges: A Mapping to Apply Privacy- and Authenticity-Enhancing Technologies"}, {"paperId": "13c0dba8fceae72752ce145314f011d7d326d97c", "title": "Privacy Protection of Automated and Self-Driving Vehicles (Dagstuhl Seminar 23242)"}]}
