{"paperId": "0a7c3187aabf20f6c9961fa67b6691eeb314ca24", "publicationVenue": {"id": "047958df-6384-459e-9864-63f946419551", "name": "International Conference on Computer Science and Application Engineering", "type": "conference", "alternate_names": ["Int Conf Comput Sci Appl Eng", "IEEE International Conference on Computer Science and Automation Engineering", "IEEE Int Conf Comput Sci Autom Eng", "CSAE"]}, "title": "RDF Multi-query Optimization Algorithm for Query Rewriting Using Common Subgraphs", "abstract": "In the current trend of rapid development of big data, there are frequent application scenarios of high concurrent query processing on RDF data sets. The multi-query optimization scheme for solving concurrent queries needs to provide a global approximate optimal solution for the query set composed of a set of queries, so as to minimize the overall time cost of the query set. Under the premise of accelerating statistics by RDF storage index and narrowing the scope of semantic pruning, firstly, simplified multiple queries are converted into connection graphs, and then all queries are clustered and grouped. In each group, all common subgraphs of connection graphs are iteratively searched and mapping tables are established. Then, the common subgraph is arranged in descending order by the number of vertices to construct the query rewriting scheme. Finally, for all the rewritten queries, the dynamic programming algorithm based on selection rate estimation is used for secondary optimization. On the one hand, the common subgraph is used to rewrite the query to reduce the number of queries, so as to reduce the cost through the reusable common result set. On the other hand, because of the establishment of RDF storage index, the selection rate can be estimated quickly, and the rewritten queries can be optimized again to improve the overall query efficiency. The experimental results show that the proposed algorithm has better query performance than the existing query schemes, especially when the RDF dataset is large, the number of queries in the query set is large, and the query statements are complex, the multi-query optimization method in this paper works better.", "venue": "International Conference on Computer Science and Application Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-10-22", "journal": {"name": "Proceedings of the 3rd International Conference on Computer Science and Application Engineering"}, "authors": [{"authorId": "152808535", "name": "Manzi Wang"}, {"authorId": "46340240", "name": "Haidong Fu"}, {"authorId": "46591453", "name": "Fangfang Xu"}], "citations": [{"paperId": "edf01449ebcfd01c0aa9e747821b2bb08c738693", "title": "RDF Subgraph Query Based on Common Subgraph in Distributed Environment"}, {"paperId": "94f1c54c3b9af873c097b422dbbbf66a5adf0da7", "title": "RDF Query Path Optimization Using Hybrid Genetic Algorithms: Semantic Web vs. Data-Intensive Cloud Computing"}, {"paperId": "a2ba7edc4493c91d1312b9a4478202388115fd4e", "title": "Highly Parallel SPARQL Engine for RDF"}]}
