{"paperId": "0a7e8bbdfc7b0a58765ef1a5a652ff2c515458c2", "publicationVenue": {"id": "56b2a0d8-f52f-453d-9c6b-3618dd6cc61b", "name": "International Conference on Advanced Mechatronic Systems", "type": "conference", "alternate_names": ["ICAMechS", "Int Conf Adv Mechatron Syst"]}, "title": "Quality control system of automobile bearing production based on edge cloud collaboration", "abstract": "In view of the strict quality control and traceability and high equipment management requirements in the current production process of automobile bearing products, a quality control system for shaft products based on the collaboration of edge cloud is proposed. This system realizes the data collection and analysis of various production factors in the bearing processing and assembly process through the workshop Internet of things, the storage, processing and analysis of multi-source heterogeneous data through the cloud platform, and the quality control and optimization of bearing products, production equipment management and optimization, product quality management and traceability functions through the micro service architecture. This paper proposes an edge cloud collaborative system architecture based on multi-source data acquisition and fusion technology, equipment anomaly warning technology and edge computing technology. The experimental results show that the system realizes the intelligent control of the whole process of bearing production, greatly improves the product quality and production efficiency, and provides a new mode for digital and intelligent bearing production process.", "venue": "International Conference on Advanced Mechatronic Systems", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 International Conference on Advanced Mechatronic Systems (ICAMechS)", "pages": "319-322"}, "authors": [{"authorId": "1799842", "name": "Yixiong Feng"}, {"authorId": "2154172731", "name": "Chen Yang"}, {"authorId": "1660976396", "name": "Tianyue Wang"}, {"authorId": "2115238642", "name": "Hao Zheng"}, {"authorId": "2575012", "name": "Yicong Gao"}, {"authorId": "2113534255", "name": "Wei Fan"}], "citations": [{"paperId": "ae58a441d1e3c7e4ad18677f724e957ee6c903c1", "title": "Analysis of Technological Heredity in the Production of Rolling Bearing Rings Made of AISI 52100 Steel Based on Waviness Measurements"}]}
