{"paperId": "0a80ca2e0a3eebc2b979c27cc9fbe2f53e649aa6", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "A Data Reporting Protocol With Revocable Anonymous Authentication for Edge-Assisted Intelligent Transport Systems", "abstract": "Intelligent Transport Systems (ITS) have received growing attention recently driven by technical advances in Industrial Internet of Vehicles (IIoV). In IIoV, vehicles report traffic data to management infrastructures to achieve better ITS services. To ensure security and privacy, many anonymous authentication-enabled data reporting protocols are proposed. However, these protocols usually require a large number of preloaded pseudonyms or involve a costly and irrevocable group signature. Thus, they are not ready for realistic deployment due to large storage overhead, expensive computation costs, or absence of malicious users' revocation. To address these issues, we present a novel data reporting protocol for edge-assisted ITS in this paper, where the traffic data is sent to distributed edge nodes for local processing. Specifically, we propose a new anonymous authentication scheme fine-tuned to fulfill the needs of vehicular data reporting, which allows authenticated vehicles to report unlimited unlinkable messages to edge nodes without huge pseudonyms download and storage costs. Moreover, we designed an efficient certificate update scheme based on a bivariate polynomial function. In this way, malicious vehicles can be revoked with time complexity $\\mathcal {O}$(1). The security analysis demonstrates that our protocol satisfies source authentication, anonymity, unlinkability, traceability, revocability, nonframeability, and nonrepudiation. Further, extensive simulation results show that the performance of our protocol is greatly improved since the signature size is reduced by at least 8%, the computation costs in message signing and verification are reduced by at least 56% and 67%, respectively, and the packet loss rate is reduced by at least 14%.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "7835-7847", "volume": "19"}, "authors": [{"authorId": "2108801470", "name": "Yanping Wang"}, {"authorId": "2108505024", "name": "Xiaofen Wang"}, {"authorId": "46448389", "name": "Hongning Dai"}, {"authorId": "2155405480", "name": "Xiaosong Zhang"}, {"authorId": null, "name": "Muhammad Imran"}], "citations": [{"paperId": "6b937df06d430d95c1ce07ba712c03e1b92661ae", "title": "Efficient Conditional Privacy-Preserving Authentication Scheme for Safety Warning System in Edge-Assisted Internet of Things"}, {"paperId": "7d8a7650684d0542a364da4984d6fad5299bc678", "title": "PPRT: Privacy Preserving and Reliable Trust-Aware Platoon Recommendation Scheme in IoV"}, {"paperId": "ccee884bf2c6b5c66fbabe1e30a9410f2a43f006", "title": "PriRPT: Practical blockchain-based privacy-preserving reporting system with rewards"}]}
