{"paperId": "0a87b1b2e089d8cf80b4b26cbb191f4648937732", "publicationVenue": null, "title": "A Survey of Semantics-Aware Performance Optimization for Data-Intensive Computing", "abstract": "We are living in the era of Big Data and witnessing the explosion of data. Given that the limitation of CPU and I/O in a single computer, the mainstream approach to scalability is to distribute computations among a large number of processing nodes in a cluster or cloud. This paradigm gives rise to the term of data-intensive computing, which denotes a data parallel approach to process massive volume of data. Through the efforts of different disciplines, several promising programming models and a few platforms have been proposed for data-intensive computing, such as MapReduce, Hadoop, Apache Spark and Dyrad. Even though a large body of research work has being proposed to improve overall performance of these platforms, there is still a gap between the actual performance demand and the capability of current commodity systems. This paper is aimed to provide a comprehensive understanding about current semantics-aware approaches to improve the performance of data-intensive computing. We first introduce common characteristics and paradigm shifts in the evolution of data-intensive computing, as well as contemporary programming models and technologies. We then propose four kinds of performance defects and survey the state-of-the-art semantics-aware techniques. Finally, we discuss the research challenges and opportunities in the field of semantics-aware performance optimization for data-intensive computing.", "venue": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "81-88"}, "authors": [{"authorId": "2140497891", "name": "B. Rao"}, {"authorId": "2155151762", "name": "Liqang Wang"}], "citations": [{"paperId": "84538ec76c8c5838fd1cfccd3b41f1c5e21004dd", "title": "A novel data size‐aware offloading technique for resource provisioning in mobile cloud computing"}, {"paperId": "78ee85ac29775aefed350a18500ecfb4c5182dd9", "title": "Distributed real-time ETL architecture for unstructured big data"}, {"paperId": "def13e123abeea4ecc210eee02cf141ce0646567", "title": "SODA: A Semantics-Aware Optimization Framework for Data-Intensive Applications Using Hybrid Program Analysis"}, {"paperId": "83432602dd26f8292221e92c34fa5150a2c2440c", "title": "Data-intensive Computation Offloading using Fog and Cloud Computing for Mobile Devices Applications"}, {"paperId": "2efe5ddcc7672689ab975e576ecbdd49e1b5ecf6", "title": "Report of the 2017 IEEE Cyber Science and Technology Congress"}]}
