{"paperId": "0a87ac278987bbf3667fcc1ecefd378234c71628", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "BioProfiling.jl: profiling biological perturbations with high-content imaging in single cells and heterogeneous populations", "abstract": "Motivation High-content imaging screens provide a cost-effective and scalable way to assess cell states across diverse experimental conditions. The analysis of the acquired microscopy images involves assembling and curating morphological measurements of individual cells into morphological profiles suitable for testing biological hypotheses. Despite being a critical step, there is currently no standard approach to morphological profiling and no solution is available for the high-performance Julia programming language. Results Here, we introduce BioProfiling.jl, an efficient end-to-end solution for compiling and filtering informative morphological profiles in Julia. The package contains all the necessary data structures to curate morphological measurements and helper functions to transform, normalize and visualize profiles. Robust statistical distances and permutation tests enable quantification of the significance of the observed changes despite the high fraction of outliers inherent to high-content screens. This package also simplifies visual artifact diagnostics, thus streamlining a bottleneck of morphological analyses. We showcase the features of the package by analyzing a chemical imaging screen, in which the morphological profiles prove to be informative about the compounds’ mechanisms of action and can be conveniently integrated with the network localization of molecular targets. Availability The Julia package is available on GitHub: https://github.com/menchelab/BioProfiling.jl We also provide Jupyter notebooks reproducing our analyses: https://github.com/menchelab/BioProfilingNotebooks Contact joerg.menche@univie.ac.at", "venue": "bioRxiv", "year": 2021, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-18", "journal": {"name": "Bioinformatics", "pages": "1692 - 1699", "volume": "38"}, "authors": [{"authorId": "115079382", "name": "Loan Vulliard"}, {"authorId": "2058321420", "name": "J. Hancock"}, {"authorId": "1491218399", "name": "A. Kamnev"}, {"authorId": "2045002302", "name": "Christopher W Fell"}, {"authorId": "2228505670", "name": "Joana Ferreira da Silva"}, {"authorId": "6763374", "name": "J. Loizou"}, {"authorId": "37482456", "name": "V. Nagy"}, {"authorId": "40031754", "name": "L. Dupré"}, {"authorId": "3315164", "name": "Jörg Menche"}], "citations": [{"paperId": "c3f1670b4d61a78c1e142da313ca12b09cca7b34", "title": "Reproducible image-based profiling with Pycytominer"}, {"paperId": "81889a936b10b63e17931a09cf7e59e5d684da1d", "title": "Discovery of Molecular Glue Degraders via Isogenic Morphological Profiling"}, {"paperId": "72a01f898fb468b496e6b360b783bb16a04036dd", "title": "A next-generation dynamic programming languageJulia: its features and applications in biological science"}, {"paperId": "11c60ac8da62e43015a7e77c47b95ebe97a5d0d6", "title": "Evolution and Impact of High Content Imaging."}, {"paperId": "b3c8e6e0d30302343b58933de04b089f8b93b4f1", "title": "Deciphering actin remodelling in immune cells through the prism of actin-related inborn errors of immunity."}]}
