{"paperId": "0a8a08a4dc290ac8c274dae6e95c35435b8e7494", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Application of Virtual Reality Based on Multisensor Data Fusion in Theater Space and Installation Art", "abstract": "The application of Virtual Reality (VR) in theater space and installation art is the general trend, and it can be seen in large stage plays and installation art exhibitions. However, as the current VR is not mature enough, it is difficult to perfectly fulfill the exhibition requirements of large theaters, so this paper aims to change this situation by using VR based on multisensor data fusion. In this paper, a data fusion algorithm based on multisensors is designed, which improves the data transmission efficiency and delay of the VR system, so that VR can have a better viewing experience in theater space and installation art. And, through the questionnaire survey and actual interview, the actual feelings of VR audience in theater space and installation art are investigated and studied. Through the experimental analysis of this paper, the algorithm in this paper has high reliability and can improve the experience of using VR. The interview results and results show that the main application of VR in theater space is manifested in three aspects: multiangle and all-round viewing, multiroute viewing, and man-machine interaction in art galleries. The application of VR in installation art is mainly reflected in the perception of installation materials.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-08-28", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2183373191", "name": "Yingjie Gu"}, {"authorId": "2118322044", "name": "Ye Zhou"}], "citations": []}
