{"paperId": "0a8b0d18f8a4d4a8878f08012d149c1fcee3d94d", "publicationVenue": {"id": "472fe64a-ea91-4506-8d2d-4c9a9374e1ea", "name": "Machine Learning and Knowledge Extraction", "alternate_names": ["Mach Learn Knowl Extr"], "issn": "2504-4990", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1327032", "alternate_urls": ["https://nbn-resolving.org/urn/resolver.pl?urn=urn:nbn:ch:bel-1327032", "https://www.mdpi.com/journal/make"]}, "title": "Identifying the Regions of a Space with the Self-Parameterized Recursively Assessed Decomposition Algorithm (SPRADA)", "abstract": "This paper introduces a non-parametric methodology based on classical unsupervised clustering techniques to automatically identify the main regions of a space, without requiring the objective number of clusters, so as to identify the major regular states of unknown industrial systems. Indeed, useful knowledge on real industrial processes entails the identification of their regular states, and their historically encountered anomalies. Since both should form compact and salient groups of data, unsupervised clustering generally performs this task fairly accurately; however, this often requires the number of clusters upstream, knowledge which is rarely available. As such, the proposed algorithm operates a first partitioning of the space, then it estimates the integrity of the clusters, and splits them again and again until every cluster obtains an acceptable integrity; finally, a step of merging based on the clusters’ empirical distributions is performed to refine the partitioning. Applied to real industrial data obtained in the scope of a European project, this methodology proved able to automatically identify the main regular states of the system. Results show the robustness of the proposed approach in the fully-automatic and non-parametric identification of the main regions of a space, knowledge which is useful to industrial anomaly detection and behavioral modeling.", "venue": "Machine Learning and Knowledge Extraction", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-04", "journal": {"name": "Mach. Learn. Knowl. Extr.", "pages": "979-1009", "volume": "5"}, "authors": [{"authorId": "2082059719", "name": "Dylan Molinié"}, {"authorId": "39759946", "name": "K. Madani"}, {"authorId": "1785410", "name": "V. Amarger"}, {"authorId": "39370638", "name": "Abdennasser Chebira"}], "citations": []}
