{"paperId": "0a945821e984945fb44b409536b728a75f265479", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Comparing Hydric Erosion Soil Loss Models in Rainy Mountainous and Dry Flat Regions in Portugal", "abstract": "Soil erosion is a severe and complex issue in the agriculture area. The main objective of this study was to assess the soil loss in two regions, testing different methodologies and combining different factors of the Revised Universal Soil Loss Equation (RUSLE) based on Geographical Information Systems (GIS). To provide the methodologies to other users, a GIS open-source application was developed. The RUSLE equation was applied with the variation of some factors that compose it, namely the slope length and slope steepness (LS) factor and practices factor (P), but also with the use of different sources of information. Eight different erosion models (M1 to M8) were applied to the two regions with different ecological conditions: Montalegre (rainy-mountainous) and Alentejo (dry-flat), both in Portugal, to compare them and to evaluate the soil loss for 3 potential erosion levels: 0–25, 25–50 and >50 ton/ha·year. Regarding the methodologies, in both regions the behavior is similar, indicating that the M5 and M6 methodologies can be more conservative than the others (M1, M2, M3, M4 and M8), which present very consistent values in all classes of soil loss and for both regions. All methodologies were implemented in a GIS application, which is free and available under QGIS software.", "venue": "Land", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-05-25", "journal": {"name": "Land", "pages": "554", "volume": "10"}, "authors": [{"authorId": "145919100", "name": "L. Duarte"}, {"authorId": "145961301", "name": "M. Cunha"}, {"authorId": "2550370", "name": "A. Teodoro"}], "citations": [{"paperId": "51424f587f28e0167d1b8019913b7bd2c4dd55c7", "title": "Analysis of the Effect of Soil Erosion in Abandoned Agricultural Areas: The Case of NE Area of Basilicata Region (Southern Italy)"}, {"paperId": "052c342f5e45e25c3f66c78761f70971aa7090fa", "title": "Soil erosion susceptibility mapping using ensemble machine learning models: A case study of upper Congo river sub-basin"}, {"paperId": "51c3c33725f58a22aef0511308c09288559a46e0", "title": "A cloud-based mapping approach for assessing spatiotemporal changes in erosion dynamics due to biotic and abiotic disturbances in a Mediterranean Peri-Urban forest"}, {"paperId": "61a706ff2b7131ebebb71eeb7be11fa37320b24a", "title": "Quantification and Evaluation of Water Erosion by RUSLE/GIS Approach in the Ykem Watershed (Western Morocco)"}, {"paperId": "913feff167edc76985ed6475b4d23e40e1511154", "title": "Multi-Decadal Assessment of Soil Loss in a Mediterranean Region Characterized by Contrasting Local Climates"}, {"paperId": "f9ce00dc904546f8464a1c5d9862511766fa86dd", "title": "Drone-Based Identification of Erosive Processes in Open-Pit Mining Restored Areas"}, {"paperId": "5484bccd58b8711d7f37fa268dfcd25727e3ae7b", "title": "Digital Soil Mapping Based on Fine Temporal Resolution Landsat Data Produced by Spatiotemporal Fusion"}]}
