{"paperId": "0a9f7eee2f90382c23fa7a82bc3a94c8e8d77569", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "OverGen: Improving FPGA Usability through Domain-specific Overlay Generation", "abstract": "FPGAs have been proven to be powerful computational accelerators across many types of workloads. The mainstream programming approach is high level synthesis (HLS), which maps high-level languages (e.g. C+ #pragmas) to hardware. Unfortunately, HLS leaves a significant programmability gap in terms of reconfigurability, customization and versatility: Although HLS compilation is fast, the downstream physical design takes hours to days; FPGA reconfiguration time limits the time-multiplexing ability of hardware, and tools do not reason about cross-workload flexibility. Overlay architectures mitigate the above by mapping a programmable design (e.g. CPU, GPU, etc.) on top of FPGAs. However, the abstraction gap between overlay and FPGA leads to low efficiency/utilization. Our essential idea is to develop a hardware generation framework targeting a highly-customizable overlay, so that the abstraction gap can be lowered by tuning the design instance to applications of interest. We leverage and extend prior work on customizable spatial architectures, SoC generation, accelerator compilers, and design space explorers to create an end-to-end FPGA acceleration system. Our novel techniques address inefficient networks between on-chip memories and processing elements, as well as improving DSE by reducing the amount of recompilation required. Our framework, OverGen, is highly competitive with fixed-function HLS-based designs, even though the generated designs are programmable with fast reconfiguration. We compared to a state-of-the-art DSE-based HLS framework, AutoDSE. Without kernel-tuning for AutoDSE, OverGen gets 1.2$\\times$ geomean performance, and even with manual kernel-tuning for the baseline, OverGen still gets 0.55$\\times$ geomean performance--all while providing runtime flexibility across workloads.", "venue": "Micro", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "2022 55th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "35-56"}, "authors": [{"authorId": "50152441", "name": "Sihao Liu"}, {"authorId": "1836379365", "name": "Jian Weng"}, {"authorId": "1557636907", "name": "Dylan Kupsh"}, {"authorId": "1508161146", "name": "Atefeh Sohrabizadeh"}, {"authorId": "48707657", "name": "Zhengrong Wang"}, {"authorId": "150187567", "name": "Licheng Guo"}, {"authorId": "2120470627", "name": "Jiuyang Liu"}, {"authorId": "2184111328", "name": "Maxim Zhulin"}, {"authorId": "2184109834", "name": "Rishabh Mani"}, {"authorId": "2156146812", "name": "Lu Zhang"}, {"authorId": "2259796", "name": "J. Cong"}, {"authorId": "1751579", "name": "Tony Nowatzki"}], "citations": [{"paperId": "9fc3c3741d52b6536dec5fef1efaa827b1ee11d8", "title": "A Fully-Configurable Open-Source Software-Defined Digital Quantized Spiking Neural Core Architecture"}, {"paperId": "c28c7af3a965d631e9e822d70748e2748c727b7f", "title": "A CGRA Front-end Compiler Enabling Extraction of General Control and Dedicated Operators"}, {"paperId": "cae306960f7498514df83b467afd81a1f1356ceb", "title": "Primate: A Framework to Automatically Generate Soft Processors for Network Applications"}, {"paperId": "2287306211f8e08900f93d1c2b559722a473a48f", "title": "Affinity Alloc: Taming Not - So Near-Data Computing"}, {"paperId": "40b12bd994889a2f606fae94f46cb2071a050d68", "title": "FDRA: A Framework for Dynamically Reconfigurable Accelerator Supporting Multi-Level Parallelism"}, {"paperId": "4b8af75c85c2603f8fdb647613896f2375d0c1c4", "title": "Flip: Data-centric Edge CGRA Accelerator"}, {"paperId": "bb7576b1d3e484a2c7cbc449af4ff56f4d41ae6c", "title": "SPADES: A Productive Design Flow for Versal Programmable Logic"}, {"paperId": "dec763ee58102856bd0f89ae85c82a5e1287e782", "title": "MESA: Microarchitecture Extensions for Spatial Architecture Generation"}, {"paperId": "d98a691cfab9ed7f71b29eeb2fbadb55d599a194", "title": "Resilient and Secure System on Chip with Rejuvenation in the Wake of Persistent Attacks"}, {"paperId": "fdfb4e597e419fc310674ce16ef744b4e66af2c9", "title": "Efficient Data Streaming for a Tightly-Coupled Coarse-Grained Reconfigurable Array"}, {"paperId": "df7e0d717b02db1e189b44193ea5b198ef97c26b", "title": "Infinity Stream: Portable and Programmer-Friendly In-/Near-Memory Fusion"}, {"paperId": "5249e16d58a838e3c5a2122f8c349024307d3b36", "title": "APEX: A Framework for Automated Processing Element Design Space Exploration using Frequent Subgraph Analysis"}, {"paperId": "dfa7f166d82ac6ecc82da7d0fce5adf907b43490", "title": "HLSDataset: Open-Source Dataset for ML-Assisted FPGA Design using High Level Synthesis"}, {"paperId": "abfe970ef231bfe66ef867749530cb5740c3a842", "title": "Callipepla: Stream Centric Instruction Set and Mixed Precision for Accelerating Conjugate Gradient Solver"}, {"paperId": "2f4007c7559b6eee846578f60d1ec2a9392bdfa8", "title": "Democratizing Domain-Specific Computing"}, {"paperId": "f1409579d297cf0ac2f6041ed64d711c2972dad4", "title": "A Full-Stack Infrastructure for Automating Spatial Architecture Research"}]}
