{"paperId": "0aa0e47b15b59e5508bea390b196f8cd3758b6dc", "publicationVenue": null, "title": "Vertex-Centric Visual Programming for Graph Neural Networks", "abstract": "Graph neural networks (GNNs) have achieved remarkable performance in many graph analytics tasks such as node classification, link prediction and graph clustering. Existing GNN systems (e.g., PyG and DGL) adopt a tensor-centric programming model and train GNNs with manually written operators. Such design results in poor usability due to the large semantic gap between the API and the GNN models, and suffers from inferior efficiency because of high memory consumption and massive data movement. We demonstrateSeastar, a novel GNN training framework that adopts avertex-centric programming paradigm and supportsautomatic kernel generation, to simplify model development and improve training efficiency. We will (i) show how to express GNN models succinctly using a visual \"drag-and-drop'' interface or Seastar's vertex-centric python API; (ii) demonstrate the performance advantage of Seastar over existing GNN systems in convergence speed, training throughput and memory consumption; and (iii) illustrate how Seastar's optimizations (e.g., operator fusion and constant folding) improve training efficiency by profiling the run-time performance.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "47096554", "name": "Yidi Wu"}, {"authorId": null, "name": "Yuntao Gui"}, {"authorId": "35295263", "name": "Tatiana Jin"}, {"authorId": "1717691", "name": "James Cheng"}, {"authorId": "145837716", "name": "Xiao Yan"}, {"authorId": "2113653096", "name": "Peiqi Yin"}, {"authorId": "2111260502", "name": "Yufei Cai"}, {"authorId": "1410395554", "name": "Bo Tang"}, {"authorId": "2087106044", "name": "Fan Yu"}], "citations": [{"paperId": "7f003247a2f17f9682352fb8758b63be561b166b", "title": "IMinimize: A System for Negative Influence Minimization via Vertex Blocking"}, {"paperId": "4d468c7b4345fcd25d40ca67313a743e6e164444", "title": "HGL: Accelerating Heterogeneous GNN Training with Holistic Representation and Optimization"}, {"paperId": "1df8b8cc125f667c6495b76e347da621109b0f73", "title": "ByteGNN: Efficient Graph Neural Network Training at Large Scale"}]}
