{"paperId": "0aa4a497726291741fda41ad4f7be07dfd816a22", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "EvoGraph: An Effective and Efficient Graph Upscaling Method for Preserving Graph Properties", "abstract": "Nowadays, many researchers and industry groups often suffer from the lack of a variety of large-scale real graphs. Although a lot of synthetic graph generation methods,(or models) such as RMAT and BA have been developed, their output graphs tend to be quite different from real-world graphs in terms of graph properties. There are a few graph upscaling methods such as Gscaler, they still fail to preserve important properties of the original graph and fail to upscale due to out of memory or too long runtime. In this paper, we propose a novel graph upscaling method called EvoGraph that can upscale the original graph with preserving its properties regardless of a scale factor. It determines and attaches new edges to the real graph using the preferential attachment mechanism in an effective and efficient way. Through extensive experiments, we have demonstrated that EvoGraph significantly outperforms the state-of-the-art graph upscaling method Gscaler in terms of preserving graph properties and performance measures such as runtime, memory usage, and scalability.", "venue": "Knowledge Discovery and Data Mining", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-07-19", "journal": {"name": "Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining"}, "authors": [{"authorId": "2021341", "name": "Himchan Park"}, {"authorId": "2116504190", "name": "Min-Soo Kim"}], "citations": [{"paperId": "b2c023049cf7e5f1f2cc58b231781a184015302d", "title": "Synthesizing and Scaling WAN Topologies Using Permutation-Invariant Graph Generative Models"}, {"paperId": "ba8a2eadc1b352da641c6a07cfd2cc0b85e2ea2e", "title": "BICE: Exploring Compact Search Space by Using Bipartite Matching and Cell-Wide Verification"}, {"paperId": "79af8667ea55f0bf63462ee807d001d900754b27", "title": "GAMMA: A Graph Pattern Mining Framework for Large Graphs on GPU"}, {"paperId": "fa1dc6a23a946ee4730f0340a709717865d72543", "title": "Natural and Artificial Dynamics in Graphs: Concept, Progress, and Future"}, {"paperId": "58165234e3b2bb072305d3b37237fb182abdba8c", "title": "Building Graphs at Scale via Sequence of Edges: Model and Generation Algorithms"}, {"paperId": "951d86df494801012e83f09b0958384b26d560cc", "title": "M2Bench: A Database Benchmark for Multi-Model Analytic Workloads"}, {"paperId": "bb17e5058e55a3095f1a4084ee223779010ae7be", "title": "SCGG: A deep structure-conditioned graph generative model"}, {"paperId": "2d55d3fc88ef2aa82f671d4d065915a124532b31", "title": "Fast subgraph query processing and subgraph matching via static and dynamic equivalences"}, {"paperId": "5f8d70a041c682966cc486f3973639d01f888475", "title": "Network Completion with Auto-regressive Graph Generative Model"}, {"paperId": "218073b7ea2b103af001c1478e2fa915c2f1d13c", "title": "Versatile Equivalences: Speeding up Subgraph Query Processing and Subgraph Matching"}, {"paperId": "b0160ffbfeeb2b8593e1f31fb149acde5d24b6b6", "title": "iTurboGraph: Scaling and Automating Incremental Graph Analytics"}, {"paperId": "6167f0f2d131f1bbfadb721074aeecae5eae1f89", "title": "Accelerating Triangle Counting on GPU"}, {"paperId": "ad847e6792897a57a2d23ccfa57cd808ce992f23", "title": "Trillion-scale Graph Processing Simulation based on Top-Down Graph Upscaling"}, {"paperId": "d6537b299b7a32f8cca588714025df4feabeb6d4", "title": "FastSGG: Efficient Social Graph Generation Using a Degree Distribution Generation Model"}, {"paperId": "7c8008bf230993440283b9331df54b4ba841e9d9", "title": "LineageBA: A Fast, Exact and Scalable Graph Generation for the Barabási-Albert Model"}, {"paperId": "7c94bed289c35c10841674edc4aa4b9056b21545", "title": "Feluca: A Two-Stage Graph Coloring Algorithm With Color-Centric Paradigm on GPU"}, {"paperId": "c598e9e1c54a139e18bab6f6a637ca56588fb6d9", "title": "Scalable generation of graphs for benchmarking HPC community-detection algorithms"}, {"paperId": "67610be41d6626b9c29a995b495dd97f5609ce0f", "title": "HyGen: generating random graphs with hyperbolic communities"}, {"paperId": "737ebe049a152602f7922f24390572806ec7d19b", "title": "Efficient Subgraph Matching: Harmonizing Dynamic Programming, Adaptive Matching Order, and Failing Set Together"}, {"paperId": "53606cf47c497b82353c5125b32e338ed3933ff1", "title": "Random Graph Generators for Hyperbolic Community Structures"}, {"paperId": "b113704d38cc9109ac4f2b24c2b897c82686d67e", "title": "General Generator for Attributed Graphs with Community Structure"}]}
