{"paperId": "0ab176284d4a4df0fed21f9b668aca26a326c8b5", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Lightweight Data-Security Ontology for IoT †", "abstract": "Although current estimates depict steady growth in Internet of Things (IoT), many works portray an as yet immature technology in terms of security. Attacks using low performance devices, the application of new technologies and data analysis to infer private data, lack of development in some aspects of security offer a wide field for improvement. The advent of Semantic Technologies for IoT offers a new set of possibilities and challenges, like data markets, aggregators, processors and search engines, which rise the need for security. New regulations, such as GDPR, also call for novel approaches on data-security, covering personal data. In this work, we present DS4IoT, a data-security ontology for IoT, which covers the representation of data-security concepts with the novel approach of doing so from the perspective of data and introducing some new concepts such as regulations, certifications and provenance, to classical concepts such as access control methods and authentication mechanisms. In the process we followed ontological methodologies, as well as semantic web best practices, resulting in an ontology to serve as a common vocabulary for data annotation that not only distinguishes itself from previous works by its bottom-up approach, but covers new, current and interesting concepts of data-security, favouring implicit over explicit knowledge representation. Finally, this work is validated by proof of concept, by mapping the DS4IoT ontology to the NGSI-LD data model, in the frame of the IoTCrawler EU project.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1398599779", "name": "Pedro Gonzalez-Gil"}, {"authorId": "82178699", "name": "J. A. Martínez"}, {"authorId": "1398022789", "name": "A. Gómez-Skarmeta"}], "citations": [{"paperId": "371ace66bdbfd679501583b74796f4ebf373d86a", "title": "IoT-Reg: A Comprehensive Knowledge Graph for Real-Time IoT Data Privacy Compliance"}, {"paperId": "0a061d62c17584bc538ac1060683e0dea0c03970", "title": "Video Steganography in IoT: Information Embedding using OpenCV and 2LSB"}, {"paperId": "e7cbf4abc68be17aa8318f0a32bf2ecf1a890e22", "title": "Lightweight Cryptographic Simulation of Power IoT Fused with Bayesian Network Algorithms"}, {"paperId": "7eeec1303cbf0f79f3ee3abb4d2d9b9721ee7cdb", "title": "A Survey on Understanding and Representing Privacy Requirements in the Internet-of-Things"}, {"paperId": "b4c94cfada2d067728d7f588546f2b9bc718e8c9", "title": "Things Data Interoperability: Linking Annotated Entities in oneM2M"}, {"paperId": "7a5797fe5f3c627e062a0b3000632540946e725d", "title": "Semantic Knowledge Management and Blockchain-based Privacy for Internet of Things Applications"}, {"paperId": "818ce4ecd0889e1bfe02c192546054e4dc0a61ee", "title": "Reusable Component Retrieval: A Semantic Search Approach for Low-Resource Languages"}, {"paperId": "8b53cd56b79469abecef93a62cf46ac11b8222b9", "title": "Things Data Interoperability Through Annotating oneM2M resources for NGSI-LD Entities"}, {"paperId": "e48008db653d25d0ebf893a4a6f1e28b035a9bd6", "title": "Security Ontology Structure for Formalization of Security Document Knowledge"}, {"paperId": "aba80f49902e9bbeb04a0df573c47b7a931b9395", "title": "A decentralized framework for device authentication and data security in the next generation internet of medical things"}, {"paperId": "42cbdbd920b66b2aec452245b725e8967a4ebe17", "title": "Code-based encryption techniques with distributed cluster head and energy consumption routing protocol"}, {"paperId": "ac5d9587625ef399805ef0795c582ac203c3f5e9", "title": "The Protection of LAN Using Semantic Firewalls"}, {"paperId": "b9e420685d62160d640a7768a382709dcd2bd6c6", "title": "Smart City Ontologies and Their Applications: A Systematic Literature Review"}, {"paperId": "48fa7c89d754ef9046b5f311f2059640834f64db", "title": "An Ontology based Approach for Context-Aware Security in the Internet of Things (IoT)"}, {"paperId": "47c654ee60a4ff8460687e665017794246f0caf2", "title": "Cybersecurity in Intelligent Transportation Systems"}, {"paperId": "73c1490aed1ba195026e6cb2509a2ea3519b1f94", "title": "The impact of IoT on real-world future decisions"}, {"paperId": "79ba587a9dcb483ee1ec4aa2112f77c87dc1e3c2", "title": "Impact of Enterprise Financing Constraints on Labor Income Share Based on Internet of Things Data Analysis Technology"}, {"paperId": "4c3a021839e73844c69e49600f551d2f99b199f7", "title": "A Cybersecurity Ontology to Support Risk Information Gathering in Cyber-Physical Systems"}, {"paperId": "a36977d13a67e481045f2f8c6726488b28e12d6a", "title": "A Domain-agnostic Framework for Secure Design and Validation of CPS Systems"}, {"paperId": "606da61127a3475ae35994e10fbf61291a220f9f", "title": "The Impact of IOT on Real-World Decisions in the next Stage"}]}
