{"paperId": "0ab3e75f1630a12e6aed0b6a1a927964219232d0", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "Scalable Discovery of Hybrid Process Models in a Cloud Computing Environment", "abstract": "Process descriptions are used to create products and deliver services. To lead better processes and services, the first step is to learn a process model. Process discovery is such a technique which can automatically extract process models from event logs. Although various discovery techniques have been proposed, they focus on either constructing formal models which are very powerful but complex, or creating informal models which are intuitive but lack semantics. In this work, we introduce a novel method that returns hybrid process models to bridge this gap. Moreover, to cope with today's big event logs, we propose an efficient method, called f-HMD, aims at scalable hybrid model discovery in a cloud computing environment. We present the detailed implementation of our approach over the Spark framework, and our experimental results demonstrate that the proposed method is efficient and scalable.", "venue": "IEEE Transactions on Services Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "368-380", "volume": "13"}, "authors": [{"authorId": "2145203816", "name": "Long Cheng"}, {"authorId": "1382676441", "name": "B. van Dongen"}, {"authorId": "145898058", "name": "Wil M.P. van der Aalst"}], "citations": [{"paperId": "c08daab8527761a07c31c9a4549fa64ef62c7e27", "title": "Multi-modal fusion for business process prediction in call center scenarios"}, {"paperId": "b74d1c0b4926571d37c843805be119493c8a804f", "title": "Intelligent Customer Service System Optimization Based on Artificial Intelligence"}, {"paperId": "6ed116d9431941b0008f961543cdf4a4bbe86365", "title": "Innovating Sustainability"}, {"paperId": "37cab66b8973d28654353c0fd72b8b821b775a95", "title": "Research on Financial Risk Intelligent Monitoring and Early Warning Model Based on LSTM, Transformer, and Deep Learning"}, {"paperId": "6e460851eb06aa7516dbe95ebc170674e07787ea", "title": "Service Discovery Mechanism for Micro Services in Cloud Computing: Comparative Study"}, {"paperId": "70c95244b3e56e92b34b12643e597bbdcf913288", "title": "File processing security detection in multi-cloud environments: a process mining approach"}, {"paperId": "214d4204cc021c64dd724f41820dfcad0b992827", "title": "Cross-Department Collaborative Healthcare Process Model Discovery From Event Logs"}, {"paperId": "da29882bc82effaf1e9d5b76968673ff767f6e11", "title": "Discovering hybrid process models with bounds on time and complexity: When to be formal and when not?"}, {"paperId": "cd6d13ed496b0083698681f07c39e030d4a95081", "title": "Optimal alignments between large event logs and process models over distributed systems: An approach based on Petri nets"}, {"paperId": "2cbda88d1c3b6d03e5fcda61035e9abda46afecc", "title": "Deep Adversarial Imitation Reinforcement Learning for QoS-Aware Cloud Job Scheduling"}, {"paperId": "f391c911e9680a6a404ec07ad771725120ad5886", "title": "Visual image encryption scheme based on vector quantization and content transform"}, {"paperId": "f864e6d0fab80cd6b339e68fc2cb3986dcd5e7d3", "title": "An Improved RSA Technique with Efficient Data Integrity Verification for Outsourcing Database in Cloud"}, {"paperId": "12b8b2e1990b1b2a2d4ec1a2d266b7ad713723d0", "title": "Process Mining for Wind Turbine Maintenance Process Analysis: A Case Study"}, {"paperId": "c0714e09fb3d8c9a5eda49dc97b44ea30c346d65", "title": "Cost-aware job scheduling for cloud instances using deep reinforcement learning"}, {"paperId": "0793e4eb13dc44c0247575019f82ff39d7dde419", "title": "Service discovery mechanisms in cloud computing: a comprehensive and systematic literature review"}, {"paperId": "85b2a70e9135006b740dc25809f19f732e923920", "title": "Processes meet Big Data: Scaling process discovery algorithms in Big Data environment"}, {"paperId": "bd806ac54d8312212a7808027b6a94d038b460d1", "title": "Flexible Genetic Algorithm Operators for Task Scheduling in Cloud Datacenters"}, {"paperId": "4b44f179dd55a3c9a06155f56f59bf0c7b32b427", "title": "A WOA-Based Optimization Approach for Task Scheduling in Cloud Computing Systems"}, {"paperId": "e0645432d259a1428fd56f26986bb20012707770", "title": "Rethinking Defeasible Reasoning: A Scalable Approach"}, {"paperId": "4ef54bcffdfb6dd71da528105f1bf4b6fdaa2863", "title": "Simulation of artefact detection in Viber and Telegram instant messengers in Windows operating systems"}, {"paperId": "9bdcd5cc6ea0455930574296a502a5ec91e52505", "title": "Detection of Infection Sources for Avian Influenza A(H7N9) in Live Poultry Transport Network During the Fifth Wave in China"}, {"paperId": "27db160e8430b4dd662b609b9228e61d09778695", "title": "Discovering Business Process Map of Frequent Running Case in Event log"}, {"paperId": "6f52d6a7a6074386de7c263d2464f3ccb41d81f8", "title": "Analysis and Research on Working Performance of Shearer Based on Discrete Element Method"}, {"paperId": "b908695f212d199d89e878e80f61aa7460519c16", "title": "Increasing Scalability of Process Mining using Event Dataframes: How Data Structure Matters"}, {"paperId": "d2da746af0b016de1b29f7fb66780e4149311513", "title": "Learning Process Models in IoT Edge"}, {"paperId": "ad0f03ae96b8c31a0b707880342abe6c6326eb22", "title": "Process Mining on Event Graphs: a Framework to Extensively Support Projects"}, {"paperId": "b331edad63a023197e13ed8d476dabaf5fe77ea7", "title": "Исследование остаточных артефактов Viber и Telegram в операционной системе Windows"}, {"paperId": "d600aabe13b62ef0da0d7b173e61a604d4ea3672", "title": "DISCOVERING BUSINESS PROCESS MAP OF MOST FREQUENT RUNNING CASE IN EVENT LOG Digest of paper 1"}]}
