{"paperId": "0abd16aa2bcfc22c6a3727890fdd574d80b32c13", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Cluster-Based Predictive PCC Voltage Control of Large-Scale Offshore Wind Farm", "abstract": "A large number of wind turbine generators in the large-scale offshore wind farm system poses a challenge to the wind farm control system due to the computational burden in the central control methods or the complexity of the communication network in the decentralized control strategies. A hybrid control method based on the distributed consensus control and the central model predictive control is proposed in this study to overcome the problem. Typically, the wind turbine generators in the large-scale offshore wind farm system are clustered into several groups. The consensus-based distributed reactive power coordination control is proposed to each cluster and the centralized predictive voltage control is used to manage the total reactive powers of all clusters and regulate the voltage at the point of common coupling. The gradient-descent algorithm for the optimal design of the consensus-based cluster control is presented firstly. Based on the convergence property of the consensus control, the equivalent model of the total reactive power response of each cluster is identified, which is used for the design of the centralized predictive voltage control. Eigenvalue analysis of the proposed predictive control strategy is carried out to verify the stability of the distributed and predictive control systems. The robustness of the proposed predictive controller is evaluated in the conditions of significant model errors due to the communication delay in each cluster. A comparison study with the full distributed control based on consensus algorithm is presented to demonstrate the effectiveness of the proposed control method. The feasibility of the proposed predictive controller is evaluated by the control-hardware-in-the-loop simulation using OPAL-RT Technologies. An additional comparison study in term of computation time with the central control method is also carried out. Real-time simulation results show the superior performance of the proposed hybrid method compared to the full distributed consensus controller or the central control strategies.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "4630-4641", "volume": "9"}, "authors": [{"authorId": "3650526", "name": "Thai-Thanh Nguyen"}, {"authorId": "2521156", "name": "Hak-Man Kim"}], "citations": [{"paperId": "353e72e4f0d667292e45d66f6bb59fa7381bee32", "title": "Development of a distributed group control strategy for pumping well groups connected by multisource DC microgrids"}, {"paperId": "7bdcba03bdf361c8d22127fe5a265c57a4afe4e1", "title": "A current injection method for converter power loss representation in electromagnetic transient simulation"}, {"paperId": "7cfcc1003d93b74a661d574a86e3f5c4ae79a39f", "title": "Large-scale distributed photovoltaic cluster partition method based on SLM algorithm"}, {"paperId": "fd7cf797dfa18592f919b035683017f04d940a71", "title": "System Architecture Analysis of Cooperative Control for Large-Scale All-DC Wind Power Plant Clusters"}, {"paperId": "ec24f9b6a481679cf0a90f5efdd22cce5af27d73", "title": "A Small-AC-Signal Injection Based Decentralized Secondary Voltage Control for Parallel Inverters With Accurate Reactive Power Sharing in Islanded Microgrids"}, {"paperId": "638bb6fd386d171e9777f5c71dcaecd8561c748a", "title": "Design of remote inspection system for high-level canal of hydropower station based on cluster centralized control of quadrotor UAV"}, {"paperId": "8ad5b6c7fcd1ee030454fca25dda73e232bdcfec", "title": "Partitional Collaborative Mitigation Strategy of Distribution Network Harmonics Based on Distributed Model Predictive Control"}, {"paperId": "65c2237b3f8bae419504ab7881dc4c410ae5940a", "title": "Coordinated Voltage Control for Offshore Wind Farm Equipped with SVG and Energy Storage"}, {"paperId": "e4f157b01f910cae9f721d3dd0a2314f96282541", "title": "Recent developments in offshore wind energy systems: Technologies and practices"}, {"paperId": "511de73dc82a8695b405da96ccbf004454ea3d76", "title": "Demand Response Method Considering Multiple Types of Flexible Loads in Industrial Parks"}, {"paperId": "3063ee46e0d85963f24cd2f0027ee4f8d372c48d", "title": "Cluster Partition Index System and Evaluation Method of Large-scale Grid-Connected Distributed Generations"}, {"paperId": "386cea2e5ed8fb6a0b97b703ffb104d94808d01f", "title": "Wind Turbine Failures Review and Trends"}]}
