{"paperId": "0acc28f8e6a20b19d05e31abb257c08c7f08ebf9", "publicationVenue": {"id": "e1ce0fed-d655-40bd-b678-9adc73f2e582", "name": "International Symposium on High Performance Computing Systems and Applications", "type": "conference", "alternate_names": ["International Conference on High Performance Computing and Simulation", "Int Conf High Perform Comput  Simul", "Int Symp High Perform Comput Syst Appl", "High Performance Computing Systems and Applications", "High Perform Comput Syst Appl", "Int Conf High Perform Comput Simul", "HPCS", "International Conference on High Performance Computing & Simulation"]}, "title": "Cleaning MapReduce Workflows", "abstract": "Integrity constraints (ICs) such as Functional Dependencies (FDs) or Inclusion Dependencies (INDs) are commonly used in databases to check if input relations obey to certain pre-defined quality metrics. While Data-Intensive Scalable Computing (DISC) platforms such as MapReduce commonly accept as input (semi-structured) data not in relational format, still data is often transformed in key/value pairs when data is required to be re-partitioned; a process commonly referred to as shuffle. In this work, we present a Provenance-Aware model for assessing the quality of shuffled data: more precisely, we capture and model provenance using the PROV-DM W3C recommendation and we extend it with rules expressed à la Datalog to assess data quality dimensions by means of ICs metrics over DISC systems. In this way, data (and algorithmic) errors can be promptly and automatically detected without having to go through a lengthy process of output debugging.", "venue": "International Symposium on High Performance Computing Systems and Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 International Conference on High Performance Computing & Simulation (HPCS)", "pages": "74-78"}, "authors": [{"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "144802103", "name": "Julien Lacroix"}, {"authorId": "1763550", "name": "Omar Boucelma"}, {"authorId": "145020779", "name": "F. Guerra"}], "citations": []}
