{"paperId": "0acd6d5dfdb0f89fdbaed0505e1830f73d926de8", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "JANUS: Benchmarking Commercial and Open-Source Cloud and Edge Platforms for Object and Anomaly Detection Workloads", "abstract": "With diverse IoT workloads, placing compute and analytics close to where data is collected is becoming increasingly important. We seek to understand what is the performance and the cost implication of running analytics on IoT data at the various available platforms. These workloads can be compute-light, such as outlier detection on sensor data, or compute-intensive, such as object detection from video feeds obtained from drones. In our paper, Janus, we profile the performance/$ and the compute versus communication cost for a compute-light IoT workload and a compute-intensive IoT workload. In addition, we also look at the pros and cons of some of the proprietary deep-learning object detection packages, such as Amazon Rekognition, Google Vision, and Azure Cognitive Services, to contrast with open-source and tunable solutions, such as Faster R-CNN (FRCNN). We find that AWS IoT Greengrass delivers at least 2X lower latency and 1.25X lower cost compared to all other cloud platforms for the compute-light outlier detection workload. For the compute-intensive streaming video analytics task, an open-source solution to object detection running on cloud VMs saves on dollar costs compared to proprietary solutions provided by Amazon, Microsoft, and Google, but loses out on latency (up to 6X). If it runs on a low-powered edge device, the latency is up to 49X lower.", "venue": "IEEE International Conference on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE 13th International Conference on Cloud Computing (CLOUD)", "pages": "590-599"}, "authors": [{"authorId": "143826636", "name": "K. Shankar"}, {"authorId": "2108818266", "name": "Pengcheng Wang"}, {"authorId": "1396536560", "name": "Ran Xu"}, {"authorId": "39145389", "name": "Ashraf Y. Mahgoub"}, {"authorId": "2228303", "name": "S. Chaterji"}], "citations": [{"paperId": "f7dc4a02e3f9fb4c65040903e14ad88bb5b136a2", "title": "Asgard: Are NoSQL databases suitable for ephemeral data in serverless workloads?"}, {"paperId": "9c659508bab230bdcf76fee90c365edcc294c8d5", "title": "Automated Road Defect and Anomaly Detection for Traffic Safety: A Systematic Review"}, {"paperId": "f6401a8b4be578d8860ae4eca95165fa236fef46", "title": "CNN Acceleration Through Flexible Distribution of Computations Between a Hardwired Processor and an FPGA"}, {"paperId": "48ee89c1cd53240c869b618b3a535762447d3f40", "title": "Smartadapt: Multi-branch Object Detection Framework for Videos on Mobiles"}, {"paperId": "15826649a3a3d6017cc086ba41904e67f5ff2c14", "title": "A data-driven approach to increasing the lifetime of IoT sensor nodes"}, {"paperId": "a3f16b54cfabf56fdf7614d5e9eb19d0b8c882a4", "title": "ORPHEUS: Living Labs for End-to-End Data Infrastructures for Digital Agriculture"}, {"paperId": "fbdde1a876c8a6510eaa8429595e6301ff3adfd7", "title": "Persistent Airborne Surveillance using Semi-Autonomous Drone swarms"}, {"paperId": "98f0e6249421c8c98aa0c8b1762d8072762f7d2a", "title": "ApproxNet: Content and Contention-Aware Video Object Classification System for Embedded Clients"}]}
