{"paperId": "0ad235540813c13977aca82bd5503c6d0bf72402", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Towards Polyglot Data Stores - Overview and Open Research Questions", "abstract": "Nowadays, data-intensive applications face the problem of handling heterogeneous data with sometimes mutually exclusive use cases and soft non-functional goals such as consistency and availability. Since no single platform copes everything, various stores (RDBMS, NewSQL, NoSQL) for different workloads and use-cases have been developed. However, since each store is only a specialization, this motivates progress in polyglot data management emerged new systems called Mult- and Polystores. They are trying to access different stores transparently and combine their capabilities to achieve one or multiple given use-cases. This paper describes representative real-world use cases for data-intensive applications (OLTP and OLAP). It derives a set of requirements for polyglot data stores. Subsequently, we discuss the properties of selected Multi- and Polystores and evaluate them based on given needs illustrated by three common application use cases. We classify them into functional features, query processing technique, architecture and adaptivity and reveal a lack of capabilities, especially in changing conditions tightly integration. Finally, we outline the benefits and drawbacks of the surveyed systems and propose future research directions and current challenges in this area.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-12", "journal": {"name": "ArXiv", "volume": "abs/2204.05779"}, "authors": [{"authorId": "31233292", "name": "Daniel Glake"}, {"authorId": "115006986", "name": "Felix Kiehn"}, {"authorId": "2115764462", "name": "Mareike Schmidt"}, {"authorId": "24033128", "name": "Fabian Panse"}, {"authorId": "144929258", "name": "N. Ritter"}], "citations": [{"paperId": "9f886f9a5270b5283a2b0b40e06ae8e3faeb8136", "title": "Self-Adapting Design and Maintenance of Multi-Model Databases"}, {"paperId": "05d70a97554d7a210aada1161e1b7488564da169", "title": "Polyglot Data Management: State of the Art & Open Challenges"}, {"paperId": "e43272b6d0cf8c6bb5931c226dc5dd47cf88b0df", "title": "The Metaverse Data Deluge: What Can We Do About It?"}, {"paperId": "9602241f2e0fcc43e1d99e17c4bb4404eca8780b", "title": "Sense The Physical, Walkthrough The Virtual, Manage The Metaverse: A Data-centric Perspective"}]}
