{"paperId": "0ad30c04fdfc4cf14dd30d63ee23e3f5e77db1fe", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Intelligent Data Handling in Current and Next-Generation Automated Vehicle Development—A Review", "abstract": "The higher the vehicle autonomy level is, the more the problems that need to be solved by engineers designing its sensors and control systems. Apart from the mechanical, electrical, algorithmic and validation challenges, such projects require to efficiently gather, store and handle the very large amounts of data logged from the vehicles. This is because the key functionalities of the control system in automated vehicles are based on data that is collected from a variety of sources, processed and analyzed to generate actuation signals. The article goes through the challenges, opportunities as well as solutions associated with data logging, collection, storage, annotation, reprocessing and evaluation. It highlights that effective and efficient data handling is an essential element for obtaining the required performance, reliability, safety and quality capabilities that would allow the mass production of automated vehicles. In terms of the safety of passengers and other road users, the behavior of a mass-produced automated vehicle must be predictable and more reliable than that of an ordinary driver. The multitude of variants that test sequences must cover is practically endless. Therefore, shortening the time-to-market to an acceptable length is only possible if you use the right methods of working with data.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "32061-32072", "volume": "11"}, "authors": [{"authorId": "2456853", "name": "M. Komorkiewicz"}, {"authorId": "2060367333", "name": "A. Chin"}, {"authorId": "2653798", "name": "P. Skruch"}, {"authorId": "9079459", "name": "Marcin Szelest"}], "citations": []}
