{"paperId": "0ada76b6d91f3a42a9ed63bf66461acb7787c5ad", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "Dynamic Priority Job Scheduling on a Hadoop YARN Platform", "abstract": "In Hadoop’s big data processing systems, YARN is responsible for resource management and job scheduling. The built-in job scheduling algorithms in YARN are simple to execute, but have some limitations such as job starvation, excessive server load, and load imbalance. In this paper, we propose a new Hybrid Dynamic Priority job Scheduling algorithm (HDPS) to address these limitations. HDPS dynamically adjusts the priority of a job as its waiting time increases to prevent job starvation. It also features a task assignment strategy designed specifically to address data locality by considering the available resources of servers and the distribution of data blocks stored on servers to reduce data transfer time and improve job execution efficiency. We implement and integrate HDPS into YARN and conduct experiments in a real Hadoop system using built-in benchmark test cases of Hadoop. Experimental results show that HDPS exhibits comprehensive superior performance over existing algorithms in terms of execution efficiency and load balance.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE 29th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "412-419"}, "authors": [{"authorId": "2293638460", "name": "Nana Du"}, {"authorId": "2294149368", "name": "Yudong Ji"}, {"authorId": "2293430191", "name": "Aiqin Hou"}, {"authorId": "2293554404", "name": "Chase Q. Wu"}, {"authorId": "2293637664", "name": "Weike Nie"}], "citations": []}
