{"paperId": "0aec4100d6459690d69e5e36780479ff20030559", "publicationVenue": null, "title": "Using Large Language Models to Understand Telecom Standards", "abstract": "The Third Generation Partnership Project (3GPP) has successfully introduced standards for global mobility. However, the volume and complexity of these standards has increased over time, thus complicating access to relevant information for vendors and service providers. Use of Generative Artificial Intelligence (AI) and in particular Large Language Models (LLMs), may provide faster access to relevant information. In this paper, we evaluate the capability of state-of-art LLMs to be used as Question Answering (QA) assistants for 3GPP document reference. Our contribution is threefold. First, we provide a benchmark and measuring methods for evaluating performance of LLMs. Second, we do data preprocessing and fine-tuning for one of these LLMs and provide guidelines to increase accuracy of the responses that apply to all LLMs. Third, we provide a model of our own, TeleRoBERTa, that performs on-par with foundation LLMs but with an order of magnitude less number of parameters. Results show that LLMs can be used as a credible reference tool on telecom technical documents, and thus have potential for a number of different applications from troubleshooting and maintenance, to network operations and software product development.", "venue": "", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2024-04-02", "journal": null, "authors": [{"authorId": "2294878093", "name": "Athanasios Karapantelakis"}, {"authorId": "2294878159", "name": "Mukesh Shakur"}, {"authorId": "2294878065", "name": "Alexandros Nikou"}, {"authorId": "35125438", "name": "Farnaz Moradi"}, {"authorId": "2294878114", "name": "Christian Orlog"}, {"authorId": "2158641657", "name": "Fitsum Gaim"}, {"authorId": "2294878154", "name": "Henrik Holm"}, {"authorId": "2220159393", "name": "Doumitrou Daniil Nimara"}, {"authorId": "2294878229", "name": "Vincent Huang"}], "citations": []}
