{"paperId": "0aed1d32749c308750bbca4ec010215b4fad7ab3", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Two-Step CFAR-Based 3D Point Cloud Extraction Method for Circular Scanning Ground-Based Synthetic Aperture Radar", "abstract": "Ground-Based Synthetic Aperture Radar (GBSAR) has non-contact, all-weather, high resolution imaging and microdeformation sensing capabilities, which offers advantages in applications such as building structure monitoring and mine slope deformation retrieval. The Circular Scanning Ground-Based Synthetic Aperture Radar (CS-GBSAR) is one of its newest developed working mode, in which the radar rotates around an axis in a vertical plane. Such nonlinear observation geometry brings the unique advantage of three-dimensional (3D) imaging compared with traditional GBSAR modes. However, such nonlinear observation geometry causes strong sidelobes in SAR images, which makes it a difficult task to extract point cloud data. The Conventional Cell Averaging Constant False Alarm Rate (CA-CFAR) algorithm can extract 3D point cloud data layer-by-layer at different heights, which is time consuming and is easily influenced by strong sidelobes to obtain inaccurate results. To address these problems, this paper proposes a new two-step CFAR-based 3D point cloud extraction method for CS-GBSAR, which can extract accurate 3D point cloud data under the influence of strong sidelobes. It first utilizes maximum projection to obtain three-view images from 3D image data. Then, the first step CA-CFAR is applied to obtain the coarse masks of three-views. Then, the volume mask in the original 3D image is obtained via inverse projection. This can remove strong sidelobes outside the potential target region and obtain potential target area data by intersecting it with the SAR 3D image. Then, the second step CA-CFAR is applied to the potential target area data to obtain 3D point clouds. Finally, to further eliminate the residual strong sidelobes and output accurate 3D point clouds, the modified Density-Based Spatial Clustering of Applications with Noise (DBSCAN) clustering algorithm is applied. The original DBSCAN method uses a spherical template to cluster. It covers more points, which is easily influenced by the strong sidelobe. Hence, the clustering results have more noise points. Meanwhile, modified DBSCAN clusters have a cylindrical template to accommodate the data’s features, which can reduce false clustering. The proposed method is validated via real data acquired by the North China University of Technology (NCUT)-developed CS-GBSAR system. The laser detection and ranging (LiDAR) data are used as the reference ground truth to demonstrate the method. The comparison experiment with conventional method shows that the proposed method can reduce 95.4% false clustered points and remove the strong sidelobes, which shows the better performance of the proposed method.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-15", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2106225906", "name": "Wenjie Shen"}, {"authorId": "2187011746", "name": "Jie Zhi"}, {"authorId": "2145213876", "name": "Yanping Wang"}, {"authorId": "2157278968", "name": "J. Sun"}, {"authorId": "2192009", "name": "Yun Lin"}, {"authorId": "98177814", "name": "Y. Li"}, {"authorId": "2116485356", "name": "Wen Jiang"}], "citations": [{"paperId": "639201c2180446d2ea9a86777011abbaeff66fb2", "title": "GC-DBSCAN-Based Dynamic Target Recognition Method for Millimeter Wave Radar"}]}
