{"paperId": "0afc63f594d15bab89afc9deaf190fc7000a5fd8", "publicationVenue": {"id": "65e58b80-9699-4da6-bd60-929b57b8533d", "name": "IEEE Transactions on Cognitive Communications and Networking", "type": "journal", "alternate_names": ["IEEE Trans Cogn Commun Netw"], "issn": "2332-7731", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687307", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687307"]}, "title": "Active Learning for Network Traffic Classification: A Technical Study", "abstract": "Network Traffic Classification (NTC) has become an important feature in various network management operations, e.g., Quality of Service (QoS) provisioning and security services. Machine Learning (ML) algorithms as a popular approach for NTC can promise reasonable accuracy in classification and deal with encrypted traffic. However, ML-based NTC techniques suffer from the shortage of labeled traffic data which is the case in many real-world applications. This study investigates the applicability of an active form of ML, called Active Learning (AL), in NTC. AL reduces the need for a large number of labeled examples by actively choosing the instances that should be labeled. The study first provides an overview of NTC and its fundamental challenges along with surveying the literature on ML-based NTC methods. Then, it introduces the concepts of AL, discusses it in the context of NTC, and review the literature in this field. Further, challenges and open issues in AL-based classification of network traffic are discussed. Moreover, as a technical survey, some experiments are conducted to show the broad applicability of AL in NTC. The simulation results show that AL can achieve high accuracy with a small amount of data.", "venue": "IEEE Transactions on Cognitive Communications and Networking", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-13", "journal": {"name": "IEEE Transactions on Cognitive Communications and Networking", "pages": "422-439", "volume": "8"}, "authors": [{"authorId": "143730558", "name": "A. Shahraki"}, {"authorId": "2055548438", "name": "Mahmoud Abbasi"}, {"authorId": "2848485", "name": "Amirhosein Taherkordi"}, {"authorId": "9483953", "name": "A. Jurcut"}], "citations": [{"paperId": "f517dfa7a0d2b8f0f6fef48541cd50f025f32163", "title": "ServeFlow: A Fast-Slow Model Architecture for Network Traffic Analysis"}, {"paperId": "e8dc70ca8d1b0c5eb2b4a9be7005a8114dccd6b2", "title": "Method for multi-task learning fusion network traffic classification to address small sample labels"}, {"paperId": "8ac08457294f43d0c8a7dfa3bc61189dddc96b59", "title": "An Active Learning Framework Using Deep Q-Network for Zero-day Attack Detection"}, {"paperId": "6971aad2362fbd8817cddeaa8ce0c32bbfdd716b", "title": "Select Informative Samples for Night-Time Vehicle Detection Benchmark in Urban Scenes"}, {"paperId": "58b7153e2484396eb739bb6741ed2c1abbe8e749", "title": "FSA-IDS: A Flow-based Self-Active Intrusion Detection System"}, {"paperId": "179becb63a09a2e6c8256e8005f88f1cc02571e6", "title": "Sustaining the High Performance of AI-Based Network Traffic Classification Models"}, {"paperId": "868b1c12086a271b6a73550d15035d83666b65c2", "title": "Active Learning Framework For Long-term Network Traffic Classification"}, {"paperId": "913fb5db1a5a29a364799b347ac06714e370d986", "title": "Traffic classification using distributions of latent space in software-defined networks: An experimental evaluation"}, {"paperId": "d29291257e52f49a19fe5999ac2caa0fc5d95d68", "title": "A Survey on Active Learning: State-of-the-Art, Practical Challenges and Research Directions"}, {"paperId": "2fd0fca891062e2ea8ef4c658dce13e5529f2b1c", "title": "Lightweight Deep Learning-Based Model for Traffic Prediction in Fog-Enabled Dense Deployed IoT Networks"}, {"paperId": "02ebbc6f991ea7982d0a247b297594046f03a4d5", "title": "Active Learning Framework to Automate NetworkTraffic Classification"}, {"paperId": "8ce91e64ebbbb9d628676a6bbfee6f133f794608", "title": "Is margin all you need? An extensive empirical study of active learning on tabular data"}, {"paperId": "00f05d0cda5d33dd1f9643b3f1214f628a8802c6", "title": "Preservice Training Strategies and Guarantee Mechanisms for Primary and Secondary School Teachers in the Development of Smart Cities by the Internet of Things"}, {"paperId": "37eb0fec06410d8b59a45124440e2dbaa343a82e", "title": "Automated design of phononic crystals under thermoelastic wave propagation through deep reinforcement learning"}, {"paperId": "3083ce91784e0f5b2b966dc501c4ab74f771dc1c", "title": "Network Traffic Classification using ML: A Comparative Analysis"}, {"paperId": "3f369986740879dd473be04a2167a96d1d94dc8f", "title": "Fine-grained TLS Services Classification with Reject Option"}, {"paperId": "8e1ad45fc1bc098a33468fd4981223457af080f7", "title": "A comparative study on online machine learning techniques for network traffic streams analysis"}, {"paperId": "c4cff634c9bc9fa9aa9a1eeabdf903113e47f407", "title": "A Survey of techniques for fine-grained web traffic identification and classification."}, {"paperId": "e3e9769e21ad84c15955def627a0ec40b083b30b", "title": "KeyClass: Efficient keyword matching for network traffic classification"}, {"paperId": "1934d3009456e6baddae344995eb4634234beede", "title": "INSOMNIA: Towards Concept-Drift Robustness in Network Intrusion Detection"}, {"paperId": "645ee7cc41031296475d92c397c8d407ed3517ed", "title": "From statistical‐ to machine learning‐based network traffic prediction"}, {"paperId": "3c065b89107ecf9a8ab0e7b190a742aea14ea0c7", "title": "A comprehensive review on Federated Learning for Data-Sensitive Application: Open issues & challenges"}, {"paperId": "73c0eef923fe89aa7e49cfad2462b1d32f494500", "title": "User Behavior Detection Using Multi-Modal Signatures of Encrypted Network Traffic"}, {"paperId": "578ef462df74ebe982ed4b9db6902264a8d332ac", "title": "LPMLP-Based Framework for IPsec VPN Cloud Gateway with Advanced Network Monitoring and Issue Resolution"}, {"paperId": "c349dbaed01f0618cd67d563bce1c569028112e3", "title": "CBS: A Deep Learning Approach for Encrypted Traffic Classification With Mixed Spatio-Temporal and Statistical Features"}, {"paperId": "3e98133f16d7768851a81c3535924808fac64a16", "title": "Application of Artificial Intelligence to Network Forensics: Survey, Challenges and Future Directions"}]}
