{"paperId": "0b0893c965adbbefd119b08380a7d4038fd1cbe9", "publicationVenue": {"id": "7f03ba38-4bb4-41a3-a6d7-914c28f84272", "name": "Dependable Systems and Networks", "type": "conference", "alternate_names": ["DSN", "Dependable Syst Netw"], "url": "http://www.dsn.org/"}, "title": "HiMFP: Hierarchical Intelligent Memory Failure Prediction for Cloud Service Reliability", "abstract": "In large-scale datacenters, memory failure is one of the leading causes of server crashes, and uncorrectable error (UCE) is the major fault type indicating defects of memory modules. Existing approaches tend to predict UCEs using Correctable Errors (CE). However, bit-level CE information has not been completely discussed in previous works and CEs with error bit patterns are strongly correlated with UCE occurrences. In this paper, we present a novel Hierarchical Intelligent Memory Failure Prediction (HiMFP) framework which can predict UCEs on multiple levels of the memory system and associate with memory recovery techniques. Particularly, we leverage CE addresses on multiple levels of memory, especially bit-level, and construct machine learning models based on spatial and temporal CE information. Results of algorithm evaluation using real-world datasets indicate that HiMFP significantly enhances the prediction performance compared with the baseline algorithm. Overall, Virtual Machines (VM) interruptions caused by UCEs can be reduced by around 45% using HiMFP.", "venue": "Dependable Systems and Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 53rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN)", "pages": "216-228"}, "authors": [{"authorId": "2153795356", "name": "Qiao Yu"}, {"authorId": "2230032714", "name": "Wengui Zhang"}, {"authorId": "50465913", "name": "Paolo Notaro"}, {"authorId": "40333325", "name": "Soroush Haeri"}, {"authorId": "152352395", "name": "Jorge Cardoso"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "c437507abc0967527c9c16e0ae84bc95ba4b12fe", "title": "SRA-E-ABCO: terminal task offloading for cloud-edge-end environments"}, {"paperId": "53787a15a18df3784ce3d096584d3d219790e37a", "title": "Exploring Error Bits for Memory Failure Prediction: An In-Depth Correlative Study"}, {"paperId": "599a278734e2c3523aced12fecdf34d22d001e3a", "title": "STIM: Predicting Memory Uncorrectable Errors with Spatio-Temporal Transformer"}]}
