{"paperId": "0b1ac67cfc010b217c30847a17bdc497032ed3bc", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Tactile based Intelligence Touch Technology in IoT configured WCN in B5G/6G-A Survey", "abstract": "Touch enabled sensation and actuation is expected to be one of the most promising, straightforward and important uses of the next generation communication networks. In light of the next generation (B5G/6G) system’s need for low latency, the infrastructure should be reconfigurable and intelligent in order to be able to work in real time and interoperable with the existing wireless network. It has a drastic impact on the society due to its high precision, accuracy, reliability and efficiency as well as the ability to connect a user from far away or remote areas. Such a touch-enabled interaction is primarily concerned with the real time transmission of the tactile based haptic information over the internet, in addition to the usual audio, visual and data traffic, thus enabling a paradigm shift towards establishing a real time control and steering communication system. Due to the existing system’s latency and overhead, it creates delays and limits the usability of the future applications. In light of the aforementioned concerns, this study proposes an intelligent touch-enabled system for B5G/6G and IoT based wireless communication network that incorporates the AR/VR technologies. The tactile internet and network slicing serve as the backbone of the touch technology which incorporates intelligence from techniques such as artificial intelligence and machine/deep learning. The survey also introduces a layered and interfacing architecture complete with its E2E solution for the intelligent touch based wireless communication system. It is anticipated for the next generation system to provide numerous opportunities for various sectors utilizing AR/VR technology in robotics and healthcare facilities, all with the intension of helping in addressing severe problems faced by the society. Conclusively the article presents a few use cases concerning the deployment of touch infrastructure in automation and robotics as well as in intelligent healthcare systems, assisting in the diagnosis and treatment of the prevailing covid-19 cases. The paper concludes with some considerable future research aspects of the proposed system with few of the ongoing projects pertaining to the development in the incorporation of the next generation (6G) system.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-11", "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2152950520", "name": "Mantisha Gupta"}, {"authorId": "2557314", "name": "R. Jha"}, {"authorId": "2116997951", "name": "Sanjeev Jain"}], "citations": [{"paperId": "6e06a73f05391568dfeded4c64b87105f1f78de6", "title": "Exploiting Intelligent Reflecting Surface for Enhancing Full-Duplex Wireless-Powered Communication Networks"}, {"paperId": "cca681bdfbcc7499b258e5b9a9254d2d1856743b", "title": "A comprehensive survey on 6G and beyond: Enabling technologies, opportunities of machine learning and challenges"}, {"paperId": "8e974579e8fba6f6501cb1a3e626bbcad7d2d1e3", "title": "Over-the-Air Computation with Quantized CSI and Discrete Power Control Levels"}, {"paperId": "bc94d32343acaa681c30c1016c6eca52757720af", "title": "Federated Learning: A Cutting-Edge Survey of the Latest Advancements and Applications"}, {"paperId": "d9fe15fb720322abfb157dc070453e230cfca348", "title": "The role of vehicular applications in the design of future 6G infrastructures"}, {"paperId": "245dcd3a123786aa651c8840340f1c6ddd503209", "title": "Touch-Interfacing Middleware Network Design in 6G"}, {"paperId": "1fb1babb77e7c7faf2bdeedb9ba7548d5e41bf84", "title": "Virtualization Development Trends: Scoping Review"}, {"paperId": "973a3d1d8282157be0d004a34014c2f9a0cead1e", "title": "Touch-Technology Middleware Interfacing in 6G Network"}, {"paperId": "e1489ff941f79de2bdd980f30798c6c9d1af8439", "title": "Intelligent Reflecting Surfaces for the Enhancement of 6G Internet of Things"}, {"paperId": "8ec41cbc804130b995cb559a491fee986abcd27c", "title": "Digital Tools, Technologies, and Learning Methodologies for Education 4.0 Frameworks: A STEM Oriented Survey"}]}
