{"paperId": "0b38c12cea439b55c25fffe62dba103348e7ec5b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Survey on 5G-and-Beyond Networks With UAVs: Applications, Emerging Technologies, Regulatory Aspects, Research Trends and Challenges", "abstract": "The rapid advancement of fifth-generation (5G)-and-beyond networks coupled with unmanned aerial vehicles (UAVs) has opened up exciting possibilities for diverse applications and cutting-edge technologies, revolutionizing the way connections, communications, and innovations unfold in the digital age. This paper presents a comprehensive survey of the deployment scenarios, applications, emerging technologies, regulatory aspects, research trends, and challenges associated with the use of UAVs in 5G-and-beyond networks. It begins with a succinct background and motivation, followed by a systematic UAV classification and a review of relevant works. The survey covers UAV deployment scenarios, including single and multiple UAV configurations. The categorization of UAV applications in 5G is presented, along with investigations into emerging technologies for enhancing UAV communications. Regulatory considerations encompassing flight guidelines, spectrum allocation, privacy, and safety are discussed. Moreover, light is shed on the latest research trends and open challenges in the field, with promising directions for future investigations identified, concluding with a summary of key findings and contributions. This survey serves as a valuable resource for researchers, practitioners, and policymakers in the UAV and communication domains. Additionally, it offers a comprehensive foundation for informed decision-making, fostering collaboration, and driving advancements in UAV and communication technologies to address the evolving needs of our interconnected world.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "7786-7826", "volume": "12"}, "authors": [{"authorId": "2121670036", "name": "Mohammed Banafaa"}, {"authorId": "2278488451", "name": "Ömer Pepeoğlu"}, {"authorId": "2176228", "name": "Ibraheem Shayea"}, {"authorId": "13251025", "name": "A. Alhammadi"}, {"authorId": "2278506635", "name": "Zaid Shamsan"}, {"authorId": "2190213007", "name": "Muneef A. Razaz"}, {"authorId": "2278506654", "name": "Majid Alsagabi"}, {"authorId": "2278508444", "name": "Sulaiman Al-Sowayan"}], "citations": [{"paperId": "6e4713c122d1cd3fa5f019730b31e1f63e724687", "title": "Reduced Complexity Sequential Digital Predistortion Technique for 5G Applications"}]}
