{"paperId": "0b3fb3e7df397e1128253b8e2c1530db5eff2410", "publicationVenue": {"id": "5c9bdf4b-339c-4d97-b0a9-47c6be5b661d", "name": "International ACM Conference on Management of Emergent Digital EcoSystems", "type": "conference", "alternate_names": ["Int ACM Conf Manag Emergent Digit Ecosyst", "Management of Emergent Digital EcoSystems", "MEDES", "Manag Emergent Digit Ecosyst"]}, "title": "Data Lineage Temporally Using a Graph Database", "abstract": "The purpose of this paper is to analyze and implement incremental updates of data lineage storage in the software tool Manta Flow. The basis of this work is the study of current data lineage storage in Manta Flow, research of existing solutions of incremental updates in version control systems, research of incremental backups in databases, analysis and design of a new solution of incremental updates in Manta Flow and a subsequent prototype implementation and performance testing execution. The resulting prototype can be deployed into the existing Manta Flow product, reducing time complexity of updates in data lineage storage in orders of magnitude.", "venue": "International ACM Conference on Management of Emergent Digital EcoSystems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-12", "journal": {"name": "Proceedings of the 11th International Conference on Management of Digital EcoSystems"}, "authors": [{"authorId": "144668991", "name": "J. Pokorný"}, {"authorId": "121649268", "name": "J. Sýkora"}, {"authorId": "34856697", "name": "M. Valenta"}], "citations": [{"paperId": "506b21337e4d435dffd10b31a452ad0bc1caab1e", "title": "Smart Public Transportation Sensing: Enhancing Perception and Data Management for Efficient and Safety Operations"}, {"paperId": "ba5554a6d4075281fcf7088d871d50dabd0300a9", "title": "The Operating Speed Difference Model of Atlas Platform Based on Deep Learning"}, {"paperId": "b9bbef35deccb8c6911b963a57acf191fc4bebc8", "title": "A Column-Level Data Lineage Processing System Based on Hive"}]}
