{"paperId": "0b5c1cd3652aa9a979da5761d4fdaa51dc55f433", "publicationVenue": {"id": "dcfb1d87-d0b8-47a7-ac44-f3ceb739330e", "name": "Fuzzy Information and Engineering", "type": "journal", "alternate_names": ["Fuzzy Inf Eng"], "issn": "1616-8666", "url": "http://www.journals.elsevier.com/fuzzy-information-and-engineering/", "alternate_urls": ["https://www.tandfonline.com/action/showAxaArticles?journalCode=tfie20", "http://www.tandfonline.com/TFIE", "http://link.springer.com/journal/volumesAndIssues/12543", "http://www.sciencedirect.com/science/journal/16168658", "http://link.springer.com/openurl?genre=journal&issn=1616-8658&volume=", "https://link.springer.com/journal/12543", "http://www.sciencedirect.com/science/journal/16168658/9?sdc=1"]}, "title": "A MapReduce C4.5 Decision Tree Algorithm Based on Fuzzy Rule-Based System", "abstract": "Decision tree is the most efficient and fast technology of data mining that is frequently used in data analysis and prediction. According to the development in science and technology in the last years, the data is growing faster, and the principle of the decision tree algorithms become not efficient in respect runtime and speed-up ratio. In view of the above problem, we propose a new method of classification based on framework Hadoop and Fuzzy logic. Our proposed hybrid approach is designed to propose a new C4.5 decision tree algorithm using fuzzy logic and fuzzy set theory to handle uncertainty and imprecision in data, and Hadoop framework (MapReduce + HDFS) to parallelize our work. This combination of big data technologies, fuzzy systems and C4.5 decision tree algorithm has produced a parallel fuzzy decision tree model, which takes advantage of these three techniques (hadoop + fuzzy logic + C4.5) to produce a decision tree with higher predictive accuracy. In this paper, an experiment is presented to compare our approach with other approaches from the literature. Experiments were carried out using three datasets, and the results show that our new method outperforms the other approaches in terms of accuracy and execution time.", "venue": "Fuzzy Information and Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-10-02", "journal": {"name": "Fuzzy Information and Engineering", "pages": "446 - 473", "volume": "11"}, "authors": [{"authorId": "1414633646", "name": "Fatima Es-Sabery"}, {"authorId": "34576303", "name": "Abdellatif Hair"}], "citations": [{"paperId": "763619a40a50f3fcffa4ab6fee5586566ecdcfca", "title": "Design of Financial Modeling System Based on Decision Tree Analysis"}, {"paperId": "c9ddd8afbee7475781dba61f91f7aea75806342c", "title": "Study on the influence of adolescent smoking on physical training vital capacity in eastern coastal areas"}, {"paperId": "04408221f3b4794b022cac392e598a3c4bdfea44", "title": "A Modified Decision Tree and its Application to Assess Variable Importance"}, {"paperId": "117cec2fa8576da76f2bdcefe72f119b0cceabb2", "title": "Entropy based C4.5-SHO algorithm with information gain optimization in data mining"}, {"paperId": "1fb6b1863223babb571e66618ed8f4fcd93fd4ea", "title": "Evaluation of different extractors of features at the level of sentiment analysis"}, {"paperId": "eb67e45d7634e729e268e4181c7442bd6b6a95e8", "title": "Emotion Processing by Applying a Fuzzy-Based Vader Lexicon and a Parallel Deep Belief Network Over Massive Data"}, {"paperId": "ec0f6c51dbbef19f934392eb903b08fdedfbcacb", "title": "Sentence-Level Classification Using Parallel Fuzzy Deep Learning Classifier"}, {"paperId": "2d8aedff05f2000bd7bfa80f98fddb55a41b9ae2", "title": "A MapReduce Opinion Mining for COVID-19-Related Tweets Classification Using Enhanced ID3 Decision Tree Classifier"}, {"paperId": "6de5bcc78cbe05bc71aced4bbf423203998977ae", "title": "Sentiment Analysis of Covid19 Tweets Using A MapReduce Fuzzified Hybrid Classifier Based On C4.5 Decision Tree and Convolutional Neural Network"}, {"paperId": "08df28686c209cfd2d169564511036ffd99d50aa", "title": "Soft Computational Techniques to Discover Unique and Precise Knowledge from Big Data"}]}
