{"paperId": "0b6774dcc108a5464a177c856c168bf612972138", "publicationVenue": {"id": "234ccdc0-f58f-4f94-b86a-428d11a0c5ad", "name": "International Symposium on Information Theory", "type": "conference", "alternate_names": ["International Symposium on Information Technology", "Int Symp Inf Theory", "Int Symp Inf Technol", "ISIT"], "url": "http://www.wikicfp.com/cfp/program?id=1719"}, "title": "Uplink Cost Adjustable Schemes in Secure Distributed Matrix Multiplication", "abstract": "In secure distributed matrix multiplication (SDMM) the multiplication AB from two private matrices A and B is outsourced by a user to N distributed servers. In ℓ-SDMM, the goal is to design a joint communication-computation procedure that optimally balances conflicting communication and computation metrics without leaking any information on both A and B to any set of ℓ ≤ N servers. To this end, the user applies coding with Ãi and ${\\tilde B_i}$ representing encoded versions of A and B destined to the i-th server. Now, SDMM involves multiple tradeoffs. One such tradeoff is the tradeoff between uplink (UL) and downlink (DL) costs. To find a good balance between these two metrics, we propose two schemes which we term USCSA and GSCSA that are based on secure cross subspace alignment (SCSA). We implement schemes from the literature, in addition to USCSA and GSCSA, and test their performance on Amazon EC2. Our numerical results show that USCSA and GSCSA establish a good balance between the time spend on the communication and computation in SDMMs. This is because they combine advantages of polynomial codes, namely low time for the upload of $\\left( {{{\\tilde A}_i},{{\\tilde B}_i}} \\right)_{i = 1}^N$ and the computation of${O_i} = {\\tilde A_i}{\\tilde B_i}$, with those of SCSA, being a low timing overhead for the download of $\\left( {{O_i}} \\right)_{i = 1}^N$ and the decoding of AB.", "venue": "International Symposium on Information Theory", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "2020 IEEE International Symposium on Information Theory (ISIT)", "pages": "1124-1129"}, "authors": [{"authorId": "145031304", "name": "Jaber Kakar"}, {"authorId": "1390097423", "name": "Anton Khristoforov"}, {"authorId": "81686981", "name": "Seyedhamed Ebadifar"}, {"authorId": "144401550", "name": "A. Sezgin"}], "citations": [{"paperId": "f1ac84a9a59fa5ebea3ea2c1ccc1918156eaecb2", "title": "Heterogeneity Shifts the Storage-Computation Tradeoff in Secure Multi-Cloud Systems"}, {"paperId": "eb454e96b241a8a3997c93836f01c95043b7f9e0", "title": "Secure Private and Adaptive Matrix Multiplication Beyond the Singleton Bound"}, {"paperId": "29b388505fdd739d20ae212b36919bf3673d4591", "title": "Bivariate Polynomial Codes for Secure Distributed Matrix Multiplication"}, {"paperId": "10deb795f1c25e492214339c87a32e31d1378012", "title": "Adaptive Private Distributed Matrix Multiplication"}, {"paperId": "1c33464b79a55f79c23ca5026b1d33a6afe0fe2c", "title": "Secure Distributed Matrix Computation With Discrete Fourier Transform"}]}
