{"paperId": "0b68393ad8b7c122ef2f1d340cbb3ecda695319d", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Dietary Patterns and Association with Anemia in Children Aged 9–16 Years in Guangzhou, China: A Cross-Sectional Study", "abstract": "Anemia affects 1.8 billion people worldwide, and diet is one of the key modifiable factors for treating anemia in children. The dietary pattern has changed rapidly in recent decades, but its effect on childhood anemia has not been reported. This study aimed to identify dietary patterns among children in rural areas of Guangzhou, China, and explore their association with anemia. A total of 1476 children aged 9–16 years old were included in this study. Demographics, lifestyle, and anthropometric and dietary information were collected. Factor analysis was used to identify dietary patterns, and anemia was diagnosed based on hemoglobin levels. Robust Poisson regression and subgroup analysis were used to analyze the association between dietary patterns and anemia. The prevalence of anemia in children was 10.4%, with 6.1% in boys and 15.4% in girls. Four dietary patterns were identified, including a fast food pattern, a vegetarian pattern, a meat and egg pattern, and a rice and wheat pattern. A high score in the fast food pattern was positively associated with risk of anemia in children entering puberty (PR = 1.767, 95% CI: 1.026~3.043, p = 0.039), especially in girls after menarche, with marginal significance (PR = 1.740, 95% CI: 0.977~3.097, p = 0.059). A high score in the meat and egg pattern was negatively associated with risk of anemia in children entering puberty (PR = 0.498, 95% CI: 0.286~0.866, p = 0.013), especially in boys after spermatorrhea (PR = 0.237, 95% CI: 0.031~0.590, p = 0.007). The fast food pattern was a risk factor for anemia in children, and the meat and egg pattern was a protective factor for anemia in children entering puberty. The findings of this study could be used to guide the strategies of evidence-based preventive nutrition interventions to curb anemia in children.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-25", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "2249094164", "name": "Jie Ma"}, {"authorId": "2144794942", "name": "Jie Huang"}, {"authorId": "2248324829", "name": "Chunzi Zeng"}, {"authorId": "2249727356", "name": "X. Zhong"}, {"authorId": "2143424781", "name": "Weiwei Zhang"}, {"authorId": "2249342459", "name": "Bo Zhang"}, {"authorId": "2249006270", "name": "Yan Li"}], "citations": [{"paperId": "1c4a9578a44eb276555a63d1b4ad37827db82977", "title": "Consumption Patterns of Sugar-Sweetened Beverages and Association with Undernutrition among Children Aged 9–17 Years in Guangzhou, China: A Cross-Sectional Study"}]}
