{"paperId": "0b80609992f64c19d9e38a671c13665d826996d4", "publicationVenue": null, "title": "Estimation Large- Scale Fading Channels for Transmit Orthogonal Pilot Reuse Sequences in Massive MIMO System", "abstract": "Massive multiple-input multiple-output (MIMO) is a critical technology for future fifth-generation (5G) systems. Reduced pilot contamination (PC) enhanced system performance, and reduced inter-cell interference and improved channel estimation. However, because the pilot sequence transmitted by users in a single cell to neighboring cells is not orthogonal, massive MIMO systems are still constrained. We propose channel evaluation using orthogonal pilot reuse sequences (PRS) and zero forced (ZF) pre-coding techniques to eliminate channel quality in end users with poor channel quality based on channel evaluation, large-scale shutdown evaluation, and analysis of maximum transmission efficiency. We derived the lower bounds on the downlink data rate (DR) and signal-to-interference noise ratio (SINR) that can be achieved based on PRS assignment to a group of users where the number of antenna elements mitigated the interference when the number of antennas reaches infinity. The channel coherence interval limitation, the orthogonal PRS cannot be allocated to all UEs in each cell. The short coherence intervals able to reduce the PC and improve the quality of channel. The results of the modelling showed that higher DR can be achieved due to better channel evaluation and lower loss.", "venue": "2022 International Conference on Intelligent Technology, System and Service for Internet of Everything (ITSS-IoE)", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-20", "journal": {"name": "2022 International Conference on Intelligent Technology, System and Service for Internet of Everything (ITSS-IoE)", "pages": "1-7"}, "authors": [{"authorId": "123456218", "name": "Qazwan Abdullah  (غزوان عبد الله محمد طربوش)"}, {"authorId": "144756441", "name": "N. Shah"}, {"authorId": "2429085", "name": "S. Hamzah"}, {"authorId": "2087062609", "name": "A. Salh"}, {"authorId": "2065561674", "name": "Mahathir Mohamad"}, {"authorId": "72568939", "name": "Shahilah Nordin"}, {"authorId": "145579770", "name": "M. Abu"}, {"authorId": "2174709114", "name": "Mohammed Abdo Albaom"}, {"authorId": "2149981656", "name": "Safwan Sadeq"}], "citations": []}
