{"paperId": "0b8a86f8021509ab94a50a8f0d7a32ce82edd920", "publicationVenue": {"id": "042bc893-3752-44f7-9e77-c59ce54b1b11", "name": "IEEE/IFIP Network Operations and Management Symposium", "type": "conference", "alternate_names": ["Network Operations and Management Symposium", "NOMS", "IEEE/IFIP Netw Oper Manag Symp", "Netw Oper Manag Symp"], "url": "http://www.comsoc.org/"}, "title": "A Comprehensive Performance Analysis of Stream Processing with Kafka in Cloud Native Deployments for IoT Use-cases", "abstract": "The constant growth of the number of Internet of Things devices drives a huge increase in data that needs to be analyzed, at times in real time. Multiple platforms are available for delivering such data to analytics engines that can perform various operations on the data with low processing latency. These platforms can find their home in cloud native environments where high availability and scaling to the actual workload can be easily achieved. While the deployment environment is elastic, clusters still need to be adequately dimensioned to accommodate the components of the platforms even under high load.In this paper, we provide an analysis in this regard: we discuss key performance indicators of the popular Kafka message bus and the related Kafka Streams processing engine. Namely, we analyze latency, throughput, CPU and memory resource footprint aspects of these services under varying load and processing tasks that appear in Internet of Things applications. We find subsecond processing latency and linear but heavily task-dependent scaling behavior in the other performance indicators’ case.", "venue": "IEEE/IFIP Network Operations and Management Symposium", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "NOMS 2023-2023 IEEE/IFIP Network Operations and Management Symposium", "pages": "1-6"}, "authors": [{"authorId": "2325913", "name": "István Pelle"}, {"authorId": "2220364900", "name": "Bence Szőke"}, {"authorId": "2164122945", "name": "A. Fayad"}, {"authorId": "2381763", "name": "T. Cinkler"}, {"authorId": "2955111", "name": "László Toka"}], "citations": [{"paperId": "73a39f81bc29fd1f9b57969192497d5f840b5dc7", "title": "Efficient topic partitioning of Apache Kafka for high-reliability real-time data streaming applications"}]}
