{"paperId": "0b9034e5233e130037d6fb976989472065dd5d47", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "ERP System Development for Business Agility in Industry 4.0—A Literature Review Based on the TOE Framework", "abstract": "The purpose of this article is to demonstrate how technological, organizational and environmental factors are affecting the use and development of ERP (enterprise resource planning) in the context of the Industry 4.0 (Fourth Industrial Revolution) concept. This article discusses the role of the ERP system in agile organization and the impact of Industry 4.0 factors on business agility with the use of the TOE (technology–organization–environment) framework. The research methods used in this study were based on a systematic literature review of the Scopus and Web of Science databases sources. Both academic and practical examples of the literature were examined. The presented outcomes of this study are a selection of Industry 4.0 technologies assigned to the TOE factors, the indication of the role of organizational agility in the enterprise and the potential technological support of Industry 4.0 indicators in achieving organizational agility. The research results might be interesting for both academic researchers and the practitioners, e.g., project managers involved in the implementation of Industry 4.0, such as top management planning to increase organizational agility in their organizations. However, there is an identified need for conducting additional studies on the influence of each identified factor on organizational agility.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-06", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2036949298", "name": "Patryk Morawiec"}, {"authorId": "2079547351", "name": "Anna Sołtysik-Piorunkiewicz"}], "citations": [{"paperId": "8f93eaf94ca955386f2221771e2dd3fca5027ea8", "title": "Bridging the Nexus Between Cloud ERP and Enterprise Resilience"}, {"paperId": "040e26936ae2ce7a7fa6cf8034503f24a332ee4f", "title": "FinTech revolution in mineral management: Exploring the nexus between technology adoption and sustainable Resource utilization in an industry 4.0 context"}, {"paperId": "b373ec07e798bd950ff28fbb02a7409747863dd1", "title": "How Does Digital Transformation Impact Green Supply Chain Development? An Empirical Analysis Based on the TOE Theoretical Framework"}, {"paperId": "8a39e7affbb56d646a2cf1282bd7c2dc0ca86268", "title": "Change of Competences in the Context of Industry 4.0 Implementation"}]}
