{"paperId": "0b9584de2f1a5e4f2ea65cee5867a1cbf22ce129", "publicationVenue": null, "title": "LAQy: Efficient and Reusable Query Approximations via Lazy Sampling", "abstract": "Modern analytical engines rely on Approximate Query Processing (AQP) to provide faster response times than the hardware allows for exact query answering. However, existing AQP methods impose steep performance penalties as workload unpredictability increases. Specifically, offline AQP relies on predictable workloads to create samples that match the queries in a priori to query execution, reducing query response times when queries match the expected workload. As soon as workload predictability diminishes, existing online AQP methods create query-specific samples with little reuse across queries, producing significantly smaller gains in response times. As a result, existing approaches cannot fully exploit the benefits of sampling under increased unpredictability. We analyze sample creation and propose LAQy, a framework for building, expanding, and merging samples to adapt to the changes in workload predicates. We show the main parameters that affect the sample creation time and propose lazy sampling to overcome the unpredictability issues that cause fast-but-specialized samples to be query-specific. We evaluate LAQy by implementing it in an in-memory code-generation-based scale-up analytical engine to show the adaptivity and practicality of our framework in a modern system. LAQy speeds up online sampling processing as a function of sample reuse ranging from practically zero to full online sampling time and from 2.5x to 19.3x in a simulated exploratory workload.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-13", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 26", "volume": "1"}, "authors": [{"authorId": "2057858492", "name": "Viktor Sanca"}, {"authorId": "66243223", "name": "Periklis Chrysogelos"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "402f50dab29c61709eabe99074bb4b8fe82ccad0", "title": "PairwiseHist: Fast, Accurate and Space-Efficient Approximate Query Processing with Data Compression"}, {"paperId": "34efce39ddd4ea592ccb1e5f5c83c32f8f64fe86", "title": "Improving K-means Clustering Using Speculation"}]}
