{"paperId": "0b972acb31ba9064ddd6370caf9d1ae673968ce3", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "An Adaptive Metadata Management Scheme Based on Deep Reinforcement Learning for Large-Scale Distributed File Systems", "abstract": "A major challenge confronting today’s distributed metadata management schemes is how to meet the dynamic requirements of various applications through effectively mapping and migrating metadata nodes to different metadata servers (MDS’s). Most of the existing works dynamically reallocate nodes to different servers adopting history-based coarse-grained methods, failing to make a timely and efficient update on the distribution of nodes. In this paper, we present the first deep reinforcement learning-leveraged distributed metadata management scheme, AdaM, to address the aforementioned dilemma. AdaM is an adaptive fine-grained metadata management scheme that trains an actor-critic network to migrate “hot” metadata nodes to different MDS’s based on its observations of the current “states” (i.e., access pattern, the structure of namespace tree and current distribution of nodes on MDS’s). Adaptive to varying access patterns, AdaM can automatically migrate hot metadata nodes among servers to keep load balancing while maintaining metadata locality. Besides, we propose a self-adaptive metadata cache policy, which dynamically combines the two strategies of managing caches on the server side and the client side to gain better query performance. Last but not least, we design a distributed metadata processing 2PC Protocol called MST-based 2PC to ensure data consistency. Experiments on a real-world dataset demonstrate the superiority of our proposed method over other schemes.", "venue": "IEEE/ACM Transactions on Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "2840-2853", "volume": "31"}, "authors": [{"authorId": "2161601864", "name": "Xiuqi Huang"}, {"authorId": "2145975123", "name": "Yuanning Gao"}, {"authorId": "2148929038", "name": "Xinyi Zhou"}, {"authorId": "11732258", "name": "Xiaofeng Gao"}, {"authorId": "2116378888", "name": "Guihai Chen"}], "citations": []}
