{"paperId": "0ba21e27e0fc5f3f90136c0ad97620605bc6d605", "publicationVenue": null, "title": "Significant lagrangian linear hotspot discovery", "abstract": "Given a collection of multi-attribute trajectories, an event definition, and a spatial network, the Significant Lagrangian Linear Hotspot Discovery (SLLHD) problem finds the paths where records in the trajectories tend to be events in the Lagrangian perspective. The SLLHD problem is of significant societal importance because of its applications in transportation planning, vehicle design, and environmental protection. Its main challenges include the potentially large number of candidate hotspots caused by the tremendous volume of trajectories as well as the non-monotonicity of the statistic measuring event concentration. The related work on the linear hotspot discovery problem is designed in the Eulerian perspective and focuses on point datasets, which ignores the dependence of event occurrence on trajectories and the paths where trajectories are. To solve this problem, we introduce an algorithm in the Lagrangian perspective, as well as five refinements that improve its computational scalability. Two case studies on real-world datasets and experiments on synthetic data show that the proposed approach finds hotspots which are not detectable by existing techniques. Cost analysis and experimental results on synthetic data show that the proposed approach yields substantial computational savings.", "venue": "IWCTS@SIGSPATIAL", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-11-03", "journal": {"name": "Proceedings of the 13th ACM SIGSPATIAL International Workshop on Computational Transportation Science"}, "authors": [{"authorId": "89843190", "name": "Y. Li"}, {"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "152138770", "name": "Pengyue Wang"}, {"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "2945490", "name": "W. Northrop"}], "citations": [{"paperId": "5caab99564af7b41881f170cbd69f445383b519c", "title": "Scalable Evaluation of Local K-Function for Radius-Accurate Hotspot Detection in Spatial Networks"}, {"paperId": "2a2519ecf6f36f62f993783a399b649ba6f95dfd", "title": "Sustainable Road Planning for Trucks in Urbanized Areas of Chinese Cities Using Deep Learning Approaches"}, {"paperId": "48981e6193d7fe2599c85359270b859007f5c0b4", "title": "Spatiotemporal Data Mining: A Survey"}, {"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey"}, {"paperId": "ad19d9a8687e768a232cef4128c64a7224e93d42", "title": "The 13th ACM SIGSPATIAL International Workshop on Computational Transportation Science (IWCTS 2020)"}]}
