{"paperId": "0ba5499b280b50eaf7f05b1ad13c002258dffdea", "publicationVenue": null, "title": "Learning Analytics - New Flavor and Benefits for Educational Environments", "abstract": "Amount of educational data has been constantly increasing for years in all domains and kinds of education (formal or informal) and educational activities (teaching, learning, assessment, use of social media and collaboration and so on). Accordingly, Learning Analytics (LA) become a powerful mechanism for supporting learners, instructors, teachers, learning system designers and developers to better understand educational processes and predict learners’ needs and performances. In this paper, we analyze the important dimensions and objectives of LA, application possibilities and some challenges to the beneficial exploitation of educational data. The required skills and capabilities that make meaningful use of LA techniques and technologies in this domain are considered and identified. Presented findings can act as a valuable guide for setting up LA services in support of educational practice. Also, they can be used as learner guidance, in quality assurance, curriculum development, and in improving learning process effectiveness and efficiency. Finally, this paper proposes the unavoidable constraints that affect LA technologies in education.", "venue": "Informatics Educ.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-13", "journal": {"name": "Informatics Educ.", "pages": "285-300", "volume": "17"}, "authors": [{"authorId": "1403376848", "name": "Aleksandra Klašnja-Milićević"}, {"authorId": "144395551", "name": "M. Ivanović"}], "citations": [{"paperId": "ed4173573819e11984faee2f397f560ec1bc4dbb", "title": "Integrating TAM and IS success model: exploring the role of blockchain and AI in predicting learner engagement and performance in e-learning"}, {"paperId": "0f9a602fa33032c9d44023fc715ced0a6fb43a3c", "title": "Supporting Student Agency with a Student-Facing Learning Analytics Dashboard"}, {"paperId": "7faddb0394f2dd51b3c987873261c0f5ae36d1fc", "title": "A new e-Learning Resource to Support Music Education in Romanian Schools"}, {"paperId": "0a5ef2278278be519b9a56902730731ede640f46", "title": "Longitudinal Analysis of Teacher Technology Acceptance and Its Relationship to Resource Viewing and Academic Performance of College Students during the COVID-19 Pandemic"}, {"paperId": "cd313973bf4581a44667a818e06a31f60962c3eb", "title": "Revealing latent traits in the social behavior of distance learning students"}, {"paperId": "07af3028c9664d446651745fbf8b6bc72325354d", "title": "Role of interactive presentation platform ASQ in delivering web design course"}, {"paperId": "20b9508fb2df741127c2092147a61af363149625", "title": "Designing Personalized Learning Environments - The Role of Learning Analytics"}, {"paperId": "aa38f4f567910daf955060efc89a97ffc5de463e", "title": "Prediction of Student Success Through Analysis of Moodle Logs: Case Study"}, {"paperId": "a392846ae420a00ab6b70c9164d6064bd81cdd1c", "title": "Navigating the Personal and Professional Practices of Social Media in Higher Education: A Phenomenological Investigation"}, {"paperId": "43d432c7dca6ad82b983cd9989e7a0820d120520", "title": "On Measuring Learning Success of Students with Disabilities in Virtual Environments"}]}
