{"paperId": "0bab0c081441ee036cfcaee93d0b0202cbf133bf", "publicationVenue": {"id": "c52375db-5573-406f-a12b-854c7ba98498", "name": "BioMed Research International", "type": "journal", "alternate_names": ["Biomed Res Int"], "issn": "2314-6133", "url": "http://www.hindawi.com/journals/bmri", "alternate_urls": ["http://www.hindawi.com/journals/bmri/"]}, "title": "A Novel Smart City-Based Framework on Perspectives for Application of Machine Learning in Combating COVID-19", "abstract": "The spread of COVID-19 worldwide continues despite multidimensional efforts to curtail its spread and provide treatment. Efforts to contain the COVID-19 pandemic have triggered partial or full lockdowns across the globe. This paper presents a novel framework that intelligently combines machine learning models and the Internet of Things (IoT) technology specifically to combat COVID-19 in smart cities. The purpose of the study is to promote the interoperability of machine learning algorithms with IoT technology by interacting with a population and its environment to curtail the COVID-19 pandemic. Furthermore, the study also investigates and discusses some solution frameworks, which can generate, capture, store, and analyze data using machine learning algorithms. These algorithms can detect, prevent, and trace the spread of COVID-19 and provide a better understanding of the disease in smart cities. Similarly, the study outlined case studies on the application of machine learning to help fight against COVID-19 in hospitals worldwide. The framework proposed in the study is a comprehensive presentation on the major components needed to integrate the machine learning approach with other AI-based solutions. Finally, the machine learning framework presented in this study has the potential to help national healthcare systems in curtailing the COVID-19 pandemic in smart cities. In addition, the proposed framework is poised as a pointer for generating research interests that would yield outcomes capable of been integrated to form an improved framework.", "venue": "BioMed Research International", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-09-11", "journal": {"name": "BioMed Research International", "volume": "2021"}, "authors": [{"authorId": "9304618", "name": "A. Ezugwu"}, {"authorId": "145963904", "name": "I. A. T. Hashem"}, {"authorId": "144382748", "name": "O. N. Oyelade"}, {"authorId": "2126419435", "name": "Mubarak Almutari"}, {"authorId": "1403206186", "name": "M. Al-garadi"}, {"authorId": "48903175", "name": "I. Abdullahi"}, {"authorId": "103300097", "name": "O. Otegbeye"}, {"authorId": "39461779", "name": "Amit K. Shukla"}, {"authorId": "1721261", "name": "H. Chiroma"}], "citations": [{"paperId": "9e55a79c1d050e11c352f736ac184f9f93ab2df4", "title": "Retracted: A Novel Smart City-Based Framework on Perspectives for Application of Machine Learning in Combating COVID-19"}, {"paperId": "09b497a376842dae9158c1757c9b884f459961a8", "title": "Deep learning in public health: Comparative predictive models for COVID-19 case forecasting"}, {"paperId": "3dea2a8a03b17c0998b0f073b6f46c0f83fd45c5", "title": "Unraveling COVID-19 Progression: A Comprehensive Com-parison of Advanced Deep Learning Methods for Precise Pre-dictions"}, {"paperId": "fa78b0a84447765a93171403e40f58ca331f3402", "title": "Machine Learning Research Trends in Africa: A 30 Years Overview with Bibliometric Analysis Review"}, {"paperId": "459da93899e221d829748ac69dabb3bd94f6be74", "title": "Artificial intelligence centric scientific research on COVID-19: an analysis based on scientometrics data"}, {"paperId": "f385fd563130359dfaad4b9297c8f8bef55731a1", "title": "Institutional Strategies to Maintain and Grow Imaging Research During the COVID-19 Pandemic"}, {"paperId": "d7a804c0949853256ed6d1efdbb330397e5f2c8f", "title": "Entwicklung konkreter Handlungsoptionen für die sichere Öffnung und den Betrieb von Freizeitdestinationen unter Pandemiebedingungen"}, {"paperId": "d475a488950fc78af18b7572a520019ff5c71318", "title": "Smart Cities after COVID-19: Building a conceptual framework through a multidisciplinary perspective"}, {"paperId": "aab99e6b150b77e63b26b073b4f927c62b02ce28", "title": "COVID-19: un desafío para la ciudades inteligentes en el decálogo de la salud pública"}, {"paperId": "6e16a21fb216faf2cedb6cc79b980fdb7e23add7", "title": "Forecasting COVID- 19 cases using Statistical Models and Ontology-based Semantic Modelling: A real time data analytics approach"}, {"paperId": "b28c45fc144a058ec15ff16febafe9ceed610342", "title": "Towards applying internet of things and machine learning for the risk prediction of COVID-19 in pandemic situation using Naive Bayes classifier for improving accuracy"}, {"paperId": "65d77d235b8ca6134a5fa82efee21aa4dc2958d7", "title": "Before and After: Machine learning for perioperative patient care"}, {"paperId": "fe55cc78996ec9fbcf7b41811c4b87fae5c20241", "title": "Investigating the impact of vaccination and non-pharmaceutical measures in curbing COVID-19 spread: A South Africa perspective."}, {"paperId": "78fe680fab6d7b67df200a8eb6bffd8d137f2bfa", "title": "Artificial Intelligence and Internet of Things (AI-IoT) Technologies in Response to COVID-19 Pandemic: A Systematic Review"}]}
