{"paperId": "0bae0651fe084a2387d73fd0f9c6a8140e197151", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "A comprehensive survey on nature‐inspired algorithms and their applications in edge computing: Challenges and future directions", "abstract": "Driven by the vision of real‐time applications and smart communication, recent years have witnessed a paradigm shift from centralized cloud computing toward distributed edge computing. The main features of edge computing are to drag the cloud services toward the network edge with dramatic reductions of latency while increasing the resource utilization of the network and computing devices. Being the natural extension of cloud computing, edge computing inherits a variety of research challenges and brings forth different new issues to solve. These challenges are dealing with solving complex optimization problems including scheduling and processing real‐time applications. Nature‐inspired meta‐heuristic (NIMH) algorithm is an overarching term in the field of an optimization problem that provides robust solutions to the NP‐complete problems, from computationally tractable approximate solutions to real‐time optimization strategies. Nowadays, different NIMH algorithms have been applied in the field of edge computing for solving various research challenges including resource placement and scheduling, communication, mobility, and edge controlling with higher efficiency. In this survey, we classify the existing NIMH into three categories based on their nature of works and included fuzzy logic and systems in the field of edge networks along with different research challenges. Further, we introduce different challenges and future directions to identify promising research works in edge computing.", "venue": "Software, Practice & Experience", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-20", "journal": {"name": "Software: Practice and Experience", "pages": "1004 - 1034", "volume": "52"}, "authors": [{"authorId": "2644477", "name": "Mainak Adhikari"}, {"authorId": "1698593", "name": "S. Srirama"}, {"authorId": "3332736", "name": "Tarachand Amgoth"}], "citations": [{"paperId": "923a1c827b58aee4391228a24d134423631e6448", "title": "Tasks classification across edge servers nodes using K-means With multi-objective constraints Chebyshev distance"}, {"paperId": "07d059fd78f839fd766229526e00bfd4e426854f", "title": "DRLBTSA: Deep reinforcement learning based task-scheduling algorithm in cloud computing"}, {"paperId": "b4a45fd038715e522ad33cbf1d119f4130cb7c43", "title": "A decade of research in fog computing: Relevance, challenges, and future directions"}, {"paperId": "7e3edd3f3ff2f523bdb98dcd06229726f4c7bcec", "title": "Fog computing for next-generation Internet of Things: Fundamental, state-of-the-art and research challenges"}, {"paperId": "20febf0786b9eac097ef436972b9226ed238c76a", "title": "Lightweight intrusion detection for edge computing networks using deep forest and bio-inspired algorithms"}, {"paperId": "505b150177cc6eb23b4f45046b2f5345ca26831b", "title": "Scheduling IoT Applications in Edge and Fog Computing Environments: A Taxonomy and Future Directions"}, {"paperId": "44d50898e329a4aff48b4e2cf775c85accfb4de5", "title": "Resource Provisioning Using Meta-Heuristic Methods for IoT Microservices With Mobility Management"}]}
