{"paperId": "0bb51f2e3d51909285f069ee19c1e3906d60064f", "publicationVenue": {"id": "1df1928c-d75e-4d86-89bc-5a1be8a503d3", "name": "IEEE International Conference on Network Protocols", "type": "conference", "alternate_names": ["ICNP", "International Conference on Network Protocols", "Int Conf Netw Protoc", "IEEE Int Conf Netw Protoc"], "url": "http://www.ieee-icnp.org/"}, "title": "Tailoring Onion Routing to the Internet of Things: Security and Privacy in Untrusted Environments", "abstract": "An increasing number of IoT scenarios involve mobile, resource-constrained IoT devices that rely on untrusted networks for Internet connectivity. In such environments, attackers can derive sensitive private information of IoT device owners, e.g., daily routines or secret supply chain procedures, when sniffing on IoT communication and linking IoT devices and owner. Furthermore, untrusted networks do not provide IoT devices with any protection against attacks from the Internet. Anonymous communication using onion routing provides a well-proven mechanism to keep the relationship between communication partners secret and (optionally) protect against network attacks. However, the application of onion routing is challenged by protocol incompatibilities and demanding cryptographic processing on constrained IoT devices, rendering its use infeasible. To close this gap, we tailor onion routing to the IoT by bridging protocol incompatibilities and offloading expensive cryptographic processing to a router or web server of the IoT device owner. Thus, we realize resource-conserving access control and end-toend security for IoT devices. To prove applicability, we deploy onion routing for the IoT within the well-established Tor network enabling IoT devices to leverage its resources to achieve the same grade of anonymity as readily available to traditional devices.", "venue": "IEEE International Conference on Network Protocols", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 27th International Conference on Network Protocols (ICNP)", "pages": "1-12"}, "authors": [{"authorId": "2086811", "name": "Jens Hiller"}, {"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "1382610408", "name": "Markus Dahlmanns"}, {"authorId": "2610427", "name": "Martin Henze"}, {"authorId": "144844040", "name": "A. Panchenko"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "5e68ebad1b05b72f809e1e82a98f675a7f0fb823", "title": "FedOnion: FL and Onion Routing-Driven Secure Data Exchange Framework for 5G-IIoT Applications"}, {"paperId": "c3f3fdba10d6b37c212c260ee16aaff729f1eaf2", "title": "LUNAR: A Practical Anonymous Network Simulation Platform"}, {"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "title": "A Computer Science Perspective on Digital Transformation in Production"}, {"paperId": "73129ae90b0159b1cce85f61d6ad6e7e84b396f7", "title": "Demo: Traffic Splitting for Tor - A Defense against Fingerprinting Attacks"}, {"paperId": "363a40b260ba774298d3c4b17ea63a196e837c70", "title": "Security-Oriented Network Architecture"}, {"paperId": "8e1bacfc172e1a6a68783c2b82cc3ea3f97d55a1", "title": "Anonymizing communication flow identifiers in the Internet of Things"}, {"paperId": "33e5ab51b7395462f8fc612cd3634968c8dd915a", "title": "Cybersecurity in Power Grids: Challenges and Opportunities"}, {"paperId": "ca03eae0df207d6694cd13ab9c91a6099bb76945", "title": "Take a Bite of the Reality Sandwich: Revisiting the Security of Progressive Message Authentication Codes"}, {"paperId": "52817c3f9d28a8e13e4b834fadb6952f02ab11f2", "title": "Secure and Privacy-Aware Blockchain Design: Requirements, Challenges and Solutions"}, {"paperId": "3c6c5d8ba36b2319a59b5eeecc65c08ae85600c9", "title": "Trust-based secure directed diffusion routing protocol in WSN"}, {"paperId": "7ff742616bdda45d24a1bc1dd08805ed22ba38c7", "title": "Easing the Conscience with OPC UA: An Internet-Wide Study on Insecure Deployments"}, {"paperId": "5ae6991d63974ae38f446ffbc6b39e2004aebc86", "title": "Aitac: an identity-based traceable anonymous communication model"}, {"paperId": "ba7ea18f8cc64b233c0cfa841be3b34f329aaef7", "title": "Secure Distributed Queries over Large Sets of Personal Home Boxes"}, {"paperId": "f8f1a4620bd9a4af8d2f5292dacdd4fccf530fbf", "title": "Communication-Flow Privacy-Preservation in 6LoWPANs-Based IoT Networks"}, {"paperId": "b28d7811767dcd1158dfc8d1aa9a797db2393986", "title": "Cost optimization of secure routing with untrusted devices in software defined networking"}, {"paperId": "a8faef75edb9d02a4c76aeefb34c413c0e5c7ceb", "title": "LacminCC: lightweight anonymous communication model in cloud computing"}, {"paperId": "9fe665deff59ff6dcd001f0ef6d0a79aa3c132af", "title": "SR-TPP: Extending IPv6 Segment Routing to enable Trusted and Private Network Paths"}, {"paperId": "6d96e7df2b7b456e0d6487e286b9e1e3879c2cac", "title": "The Quest for Secure and Privacy-preserving Cloud-based Industrial Cooperation"}, {"paperId": "726769d4103722d42d0b801c149d2809adba62ca", "title": "Survey of Onion Routing Approaches: Advantages, Limitations and Future Scopes"}, {"paperId": "12380ed92413074a41222ebf8a50614af8cd5c5d", "title": "Security Considerations for Collaborations in an Industrial IoT-based Lab of Labs"}, {"paperId": "981333e6fc0977d5cc807ebb3f4505d4f056fa9a", "title": "Prototype Device With Lightweight Protocol for Secure RFID Communication Without Reliable Connectivity"}, {"paperId": "53e8062fb1c597cef248f4d2e0a1d28b4d5eda69", "title": "Dataflow Challenges in an Internet of Production: A Security & Privacy Perspective"}, {"paperId": "5c14d9339db4ea3a802b0fa76fbfea8a31ec84d7", "title": "POSTER: Traffic Splitting to Counter Website Fingerprinting"}, {"paperId": "36c5cb8c7afa305108d21c278e0cc9d20d6d1868", "title": "Multipathing Traffic to Reduce Entry Node Exposure in Onion Routing"}, {"paperId": "4f033c90c1ac79594e9f4a9aeb6144efbf19489a", "title": "GPU-Accelerated Deep Learning-Based Correlation Attack on Tor Networks"}, {"paperId": "1a7451340ea6bc63ea621efaf6b44d4cb99bfa27", "title": "Post-Quantum Era Privacy Protection for Intelligent Infrastructures"}, {"paperId": "4a17e67884bba983c29c8e12fa08270d3d940067", "title": "Verticals in 5G MEC-Use Cases and Security Challenges"}, {"paperId": "5118727269df680e66a79ab63444a6d4672c07d7", "title": "Improving Internet Privacy, Data Protection and Security Concerns"}, {"paperId": "e84e3469c7d820b9c26ae2f296bc7dfdb4c839dc", "title": "Stamping Process Modelling in an Internet of Production"}, {"paperId": "04727223219f6997c2f60278125d408ecf2f61cd", "title": "Transactions on Large-Scale Data- and Knowledge-Centered Systems XLIV: Special Issue on Data Management – Principles, Technologies, and Applications"}, {"paperId": "936ee64b61b2523b4f4488951f06bd2ba32f7cb7", "title": "A Review on Security and Privacy Issues and Challenges in Internet of Things"}]}
