{"paperId": "0bd343e03848372641037b4edb6b4f9479809277", "publicationVenue": {"id": "d5594aad-095f-4587-802a-b011732c7100", "name": "Physics in Medicine and Biology", "type": "journal", "alternate_names": ["Phys Med Biology"], "issn": "0031-9155", "url": "http://www.iop.org/EJ/journal/0031-9155", "alternate_urls": ["https://iopscience.iop.org/journal/0031-9155", "http://iopscience.iop.org/0031-9155", "http://iopscience.org/pmb"]}, "title": "Mild cognitive impairment classification using combined structural and diffusion imaging biomarkers", "abstract": "Alzheimer's disease is a multifactorial neurodegenerative disorder preceded by a prodromal stage called mild cognitive impairment (MCI). Early diagnosis of MCI is crucial for delaying the progression and optimizing the treatment. In this study we propose a random forest (RF) classifier to distinguish between MCI and healthy control subjects (HC), identifying the most relevant features computed from structural T1-weighted and diffusion-weighted magnetic resonance images (sMRI and DWI), combined with neuro-psychological scores. To train the RF we used a set of 60 subjects (HC = 30, MCI = 30) drawn from the Alzheimer's disease neuroimaging initiative database, while testing with unseen data was carried out on a 23-subjects Mexican cohort (HC = 12, MCI = 11). Features from hippocampus, thalamus and amygdala, for left and right hemispheres were fed to the RF, with the most relevant being previously selected by applying extra trees classifier and the mean decrease in impurity index. All the analyzed brain structures presented changes in sMRI and DWI features for MCI, but those computed from sMRI contribute the most to distinguish from HC. However, sMRI+DWI improves classification performance in training area under the receiver operating characteristic curve (AUROC = 93.5 ± 8%, accuracy = 88.8 ± 9%) and testing with unseen data (AUROC = 93.79%, accuracy = 91.3%), having a better performance when neuro-psychological scores were included. Compared to other classifiers the proposed RF provide the best performance for HC/MCI discrimination and the application of a feature selection step improves its performance. These findings imply that multimodal analysis gives better results than unimodal analysis and hence may be a useful tool to assist in early MCI diagnosis.", "venue": "Physics in Medicine and Biology", "year": 2021, "fieldsOfStudy": ["Physics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-24", "journal": {"name": "Physics in Medicine & Biology", "volume": "66"}, "authors": [{"authorId": "1409203209", "name": "J. Perez-Gonzalez"}, {"authorId": "2115011647", "name": "Luis Jimenez Angeles"}, {"authorId": "2115012584", "name": "Karla Rojas Saavedra"}, {"authorId": "2114997882", "name": "Eduardo Barbará Morales"}, {"authorId": "1400440370", "name": "V. Médina-Bañuelos"}], "citations": [{"paperId": "ae5d21d4bd824ae4b3f4f93e55e5d802c3e5bdbc", "title": "Multi-scale fMRI time series analysis for understanding neurodegeneration in MCI"}, {"paperId": "54a3168d1adf2aad23e899d6f8acb2874108291a", "title": "Combining ADC values in DWI with rCBF values in arterial spin labeling (ASL) for the diagnosis of mild cognitive impairment (MCI)"}, {"paperId": "6db6087a712b2ead0206f7d5a7e526d6087083f6", "title": "ECG Marker Evaluation for the Machine-Learning-Based Classification of Acute and Chronic Phases of Trypanosoma cruzi Infection in a Murine Model"}, {"paperId": "a0916d400cf6bbeaa0183e4284c254a3b03dfeaf", "title": "Abnormal white matter changes in Alzheimer's disease based on diffusion tensor imaging: A systematic review"}, {"paperId": "9f93b9402001bb87ca08a1652bd797a1c186d690", "title": "Multimodal magnetic resonance imaging for Alzheimer's disease diagnosis using hybrid features extraction and ensemble support vector machines"}, {"paperId": "da5c482082e9fe8aa87e20ed52a4b4cdba1e2096", "title": "Multi-modality MRI for Alzheimer's disease detection using deep learning."}]}
