{"paperId": "0bf13c31fb013dbeda5ec0c87d2f80ec856b5bb2", "publicationVenue": null, "title": "Deep Learning for Image Analysis in Kidney Care.", "abstract": "Analysis of medical images, such as radiological or tissue specimens, is an indispensable part of medical diagnostics. Conventionally done manually, the process may sometimes be time-consuming and prone to interobserver variability. Image classification and segmentation by deep learning strategies, predominantly convolutional neural networks, may provide a significant advance in the diagnostic process. In renal medicine, most evidence has been generated around the radiological assessment of renal abnormalities and histological analysis of renal biopsy specimens' segmentation. In this article, the basic principles of image analysis by convolutional neural networks, brief descriptions of convolutional neural networks, and their system architecture for image analysis are discussed, in combination with examples regarding their use in image analysis in nephrology.", "venue": "Advances in kidney disease and health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Advances in kidney disease and health", "pages": "\n          25-32\n        ", "volume": "30 1"}, "authors": [{"authorId": "120811666", "name": "Han Zhang"}, {"authorId": "2142660207", "name": "Max Botler"}, {"authorId": "5203440", "name": "J. Kooman"}], "citations": [{"paperId": "d5434f71a7e3c42bcd52d3820a6380fb0879a0be", "title": "AI models for automated segmentation of engineered polycystic kidney tubules."}, {"paperId": "bbc2e246b35135297beeacf087097f1b185d7f71", "title": "End‐to‐end light‐weighted deep‐learning model for abnormality classification in kidney CT images"}, {"paperId": "b70d1bfe94c7157847e5fef487c5cbb26b63dbce", "title": "Enhanced study on Deep learning model for kidney segmentation using DCE-MRI"}, {"paperId": "6877ad2ead13faeb5c655381d6d48a50d7f033b8", "title": "Enabling Accurate Tuberculosis Diagnosis through Deep Learning on Patient CXR Images"}]}
