{"paperId": "0bfa073ab5d7bd8a8ee5e2dece85cb29b90744d5", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Analysis of the Role of Design-Driven Innovation in the Interaction Design of Image Indexing Software under the Background of the Internet of Things", "abstract": "More and more medical images are being produced quickly by modern imaging devices that are connected to the Internet of Things (IoT). For the retrieval of necessary images from a conventional big volume database, the continuous scanning of all image data in an IoT network appears to be ineffective and computationally expensive. Effective image retrieval from a big image database necessitates the use of an effective and scalable image indexing approach. Existing image indexing methods have significant drawbacks, including lower efficiency, constrained scalability, increased computing demands, and longer processing times. To index the medical images obtained by IoT sensors, we suggested a novel, effective Content-Based Cascaded Gabor Wavelet Algorithm (CBCGWA) in this study. Further in this study, the medical images from computed tomography (CT) are employed for medical indexing Totally, the dataset included 168 individually annotated square patches in a subset of 115 high-resolution CT (High-Resolution CT) slices used in this study. An adaptive median filter is used for preprocessing the CT medical images once they are acquired from IoT sensor nodes connected to medical imaging systems. The Gaussian Adaptive Attention Network is then used to cluster together images with comparable attributes (GAAN). The suggested method is used to index the images after image clustering. The cloud database is where the indexed images are eventually maintained. The comparison of the recommended indexing approach to the existing indexing strategies revealed that it is better in terms of processing time, power, and indexing efficiency.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-09", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2184647528", "name": "Li Rong"}], "citations": [{"paperId": "a752fc7ea7ecb5ac3dc9c7ebfe6ec66412ae34f1", "title": "Retracted: Analysis of the Role of Design-Driven Innovation in the Interaction Design of Image Indexing Software under the Background of the Internet of Things"}]}
