{"paperId": "0bfb2be57299ffb79582bc9da7dffe2a4e9cb1e6", "publicationVenue": {"id": "70a61d6b-e3a8-4945-bf57-96fe5fb2ff85", "name": "Open Computer Science", "alternate_names": ["Open Comput Sci"], "issn": "2299-1093", "url": "https://www.degruyter.com/view/j/comp"}, "title": "Data preprocessing impact on machine learning algorithm performance", "abstract": "Abstract The popularity of artificial intelligence applications is on the rise, and they are producing better outcomes in numerous fields of research. However, the effectiveness of these applications relies heavily on the quantity and quality of data used. While the volume of data available has increased significantly in recent years, this does not always lead to better results, as the information content of the data is also important. This study aims to evaluate a new data preprocessing technique called semi-pivoted QR (SPQR) approximation for machine learning. This technique is designed for approximating sparse matrices and acts as a feature selection algorithm. To the best of our knowledge, it has not been previously applied to data preprocessing in machine learning algorithms. The study aims to evaluate the impact of SPQR on the performance of an unsupervised clustering algorithm and compare its results to those obtained using principal component analysis (PCA) as the preprocessing algorithm. The evaluation is conducted on various publicly available datasets. The findings suggest that the SPQR algorithm can produce outcomes comparable to those achieved using PCA without altering the original dataset.", "venue": "Open Computer Science", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Open Computer Science", "volume": "13"}, "authors": [{"authorId": "1743181", "name": "A. Amato"}, {"authorId": "39120770", "name": "V. Di Lecce"}], "citations": [{"paperId": "90dc002e0df8e71150157d0fc15b59996330618d", "title": "Development of a Simulator for Household Refrigerator Using Equation-Based Optimization Control with Bayesian Calibration"}]}
