{"paperId": "0c132dbfa521a5dac11f90bf5305c9e2210dbbe6", "publicationVenue": {"id": "4f9c2bb7-ec38-45aa-b0b3-8bd7680ccc1f", "name": "SIGMOD record", "type": "journal", "alternate_names": ["SIGMOD rec", "Sigmod Record", "Sigmod Rec"], "issn": "0163-5808", "url": "http://portal.acm.org/browse_dl.cfm?CFID=85291668&CFTOKEN=27828468&coll=ACM&dl=ACM&idx=J689&linked=1&part=newsletter", "alternate_urls": ["http://portal.acm.org/sigmod/newsletter"]}, "title": "A Case for Enrichment in Data Management Systems", "abstract": "We describe ENRICHDB, a new DBMS technology designed for emerging domains (e.g., sensor-driven smart spaces and social media analytics) that require incoming data to be enriched using expensive functions prior to its usage. To support online processing, today, such enrichment is performed outside of DBMSs, as a static data processing workflow prior to its ingestion into a DBMS. Such a strategy could result in a significant delay from the time when data arrives and when it is enriched and ingested into the DBMS, especially when the enrichment complexity is high. Also, enriching at ingestion could result in wastage of resources if applications do not use/require all data to be enriched. ENRICHDB's design represents a significant departure from the above, where we explore seamless integration of data enrichment all through the data processing pipeline - at ingestion, triggered based on events in the background, and progressively during query processing. The cornerstone of ENRICHDB is a powerful enrichment data and query model that encapsulates enrichment as an operator inside a DBMS enabling it to co-optimize enrichment with query processing. This paper describes this data model and provides a summary of the system implementation.", "venue": "SIGMOD record", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-29", "journal": {"name": "ACM SIGMOD Record", "pages": "38 - 43", "volume": "51"}, "authors": [{"authorId": "2028613607", "name": "Dhrubajyoti Ghosh"}, {"authorId": "2028613957", "name": "Peeyush Gupta"}, {"authorId": "144156242", "name": "S. Mehrotra"}, {"authorId": "2028614385", "name": "Shantanu Sharma"}], "citations": [{"paperId": "2daa1a351a9e2b1452e2e094fc2a068c1c2d0b75", "title": "moduli: A Disaggregated Data Management Architecture for Data-Intensive Workflows"}, {"paperId": "73e2138f422deb1ee71e1863b789a462b3813640", "title": "Spatio-historical data enrichment for toponomastics in Bali, The Island of Gods"}, {"paperId": "f25e590c2f97b85de6f6f775959945a5ed3dc2df", "title": "JENNER: Just-in-time Enrichment in Query Processing"}, {"paperId": "ccebd0a61e9bcdeb672f8c1b4e933482092b2de3", "title": "Supporting Complex Query Time Enrichment For Analytics"}]}
