{"paperId": "0c156ab7ef7bcbbce8dc893d91c4695047826966", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Optimizing Machine Learning Inference Queries with Correlative Proxy Models", "abstract": "We consider accelerating machine learning (ML) inference queries on unstructured datasets. Expensive operators such as feature extractors and classifiers are deployed as user-defined functions (UDFs), which are not penetrable with classic query optimization techniques such as predicate push-down. Recent optimization schemes (e.g., Probabilistic Predicates or PP) assume independence among the query predicates, build a proxy model for each predicate offline, and rewrite a new query by injecting these cheap proxy models in the front of the expensive ML UDFs. In such a manner, unlikely inputs that do not satisfy query predicates are filtered early to bypass the ML UDFs. We show that enforcing the independence assumption in this context may result in sub-optimal plans. In this paper, we propose CORE, a query optimizer that better exploits the predicate correlations and accelerates ML inference queries. Our solution builds the proxy models online for a new query and leverages a branch-and-bound search process to reduce the building costs. Results on three real-world text, image and video datasets show that CORE improves the query throughput by up to 63% compared to PP and up to 80% compared to running the queries as it is.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-02", "journal": {"name": "ArXiv", "volume": "abs/2201.00309"}, "authors": [{"authorId": "2109493366", "name": "Zhihui Yang"}, {"authorId": "47196264", "name": "Zuozhi Wang"}, {"authorId": "2051754670", "name": "Yicong Huang"}, {"authorId": "2143370657", "name": "Yao Lu"}, {"authorId": null, "name": "Chen Li"}, {"authorId": "38871997", "name": "X. S. Wang"}], "citations": [{"paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a", "title": "Hydro: Adaptive Query Processing of ML Queries"}, {"paperId": "49beab6faf0126d47e19fb781e1677742c150d9c", "title": "The Duck's Brain: Training and Inference of Neural Networks in Modern Database Engines"}, {"paperId": "01f6f821e9e46558952cf947bac760265a1867f4", "title": "Udon: Efficient Debugging of User-Defined Functions in Big Data Systems with Line-by-Line Control"}, {"paperId": "4057dac4f2369ee4b072854e219c71364c9d0d87", "title": "VQPy: An Object-Oriented Approach to Modern Video Analytics"}, {"paperId": "111467991de91a9640c50bd6c645980d3015adbf", "title": "SmartLite: A DBMS-based Serving System for DNN Inference in Resource-constrained Environments"}, {"paperId": "eeab466d688b94133950788eaf8d1bf33bf037cb", "title": "Zelda: Video Analytics using Vision-Language Models"}, {"paperId": "97e8e9ad3862629bacb28b994f2d5d52a2371c00", "title": "Extract-Transform-Load for Video Streams"}, {"paperId": "733ccf709ff18dda193566050d772c000cf5a534", "title": "Optimizing Machine Learning Inference Queries for Multiple Objectives"}, {"paperId": "1add047298154e27d8ef732e6c73c2f1c91eba23", "title": "Optimizing Video Analytics with Declarative Model Relationships"}, {"paperId": "cf7f58c9b5e834345b6322a63f16c60e8695cb8b", "title": "Demonstration of Accelerating Machine Learning Inference Queries with Correlative Proxy Models"}, {"paperId": "23fe77fd81fe9eaad8e8c7164ce759d2ca0f65f4", "title": "On Efficient Approximate Queries over Machine Learning Models"}, {"paperId": "b9b8f753ae32654d46e396a11ea2a88a0312c1a8", "title": "Serving and Optimizing Machine Learning Workflows on Heterogeneous Infrastructures"}, {"paperId": "d473c4de05951f135d947ae8b32933c933c8abeb", "title": "Metadata Representations for Queryable Repositories of Machine Learning Models"}]}
