{"paperId": "0c232df77dce73b7402078539d0236feb3775257", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "A Survey on Sensor-Based Threats and Attacks to Smart Devices and Applications", "abstract": "Modern electronic devices have become “smart” as well as omnipresent in our day-to-day lives. From small household devices to large industrial machines, smart devices have become very popular in every possible application domain. Smart devices in our homes, offices, buildings, and cities can connect with other devices as well as with the physical world around them. This increasing popularity has also placed smart devices as the center of attention among attackers. Already, several types of malicious activities exist that attempt to compromise the security and privacy of smart devices. One interesting and noteworthy emerging threat vector is the attacks that abuse the use of sensors on smart devices. Smart devices are vulnerable to sensor-based threats and attacks due to the lack of proper security mechanisms available to control the use of sensors by installed apps. By exploiting the sensors (e.g., accelerometer, gyroscope, microphone, light sensor, etc.) on a smart device, attackers can extract information from the device, transfer malware to a device, or trigger a malicious activity to compromise the device. In this paper, we explore various threats and attacks abusing sensors of smart devices for malicious purposes. Specifically, we present a detailed survey about existing sensor-based threats and attacks to smart devices and countermeasures that have been developed to secure smart devices from sensor-based threats. Furthermore, we discuss security and privacy issues of smart devices in the context of sensor-based threats and attacks and conclude with future research directions.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-08", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "1125-1159", "volume": "23"}, "authors": [{"authorId": "2288441085", "name": "Ieee Amit Kumar Sikder Member"}, {"authorId": "39411062", "name": "Giuseppe Petracca"}, {"authorId": "2250333", "name": "Hidayet Aksu"}, {"authorId": "145971553", "name": "T. Jaeger"}, {"authorId": "47888295", "name": "A. Uluagac"}, {"authorId": "2288420134", "name": "Amit Kumar"}], "citations": [{"paperId": "31079dd7f9f5bfdebfedcfff38b226d1270caa5c", "title": "Fractional Optimal Control for Malware Propagation in Internet of Underwater Things"}, {"paperId": "284a5e2fe35847c4296cf69a1024a9e90639559f", "title": "Imaging privacy threats from an ambient light sensor"}, {"paperId": "b120f2ba3bbb1cab43793148da3148b6f39b5969", "title": "Integration of federated learning with IoT for smart cities applications, challenges, and solutions"}, {"paperId": "2cc445485ab916dcf5fc552acabbf9fc22096ef1", "title": "Cooperative Abnormal Node Detection with Adversary Resistance: A Probabilistic Approach"}, {"paperId": "abc961ff67f7d5641bfb94886f59807cde224631", "title": "A Study on Networked Industrial Robots in Smart Manufacturing: Vulnerabilities, Data Integrity Attacks and Countermeasures"}, {"paperId": "4d955d62618a9627a9f75632766c97d6a7d6252e", "title": "A Secure Architectural Model Using Blockchain and Estimated Trust Mechanism in Electronic Consumers"}, {"paperId": "978bc651716445f5e3cd09fd4656e1354ae69cee", "title": "A Comprehensive Study on Unmanned Aerial Vehicle Security Issues"}, {"paperId": "b48b265498f13bad4ec22ed0a06dec5caddbd4f4", "title": "A Unified Taxonomy and Evaluation of IoT Security Guidelines"}, {"paperId": "f5cb2595f08b9ff0e9d33124403053867c8cd9d4", "title": "A blockchain-based federated learning mechanism for privacy preservation of healthcare IoT data"}, {"paperId": "4b0c03962994cbed064f35c3df8a3519310cf930", "title": "Privacy Preservation in Artificial Intelligence and Extended Reality (AI-XR) Metaverses: A Survey"}, {"paperId": "952a67b6b2693e7a5b4e49fc293a8f2dd7d748c1", "title": "Drone cybersecurity issues, solutions, trend insights and future perspectives: a survey"}, {"paperId": "5f788051a09b9caffdf39ec9be6599efaee29cad", "title": "Hybrid control for malware propagation in rechargeable WUSN and WASN: From knowledge-driven to data-driven"}, {"paperId": "51cf6fc78b2b04c6db090a38e6b8865f8b78f73d", "title": "Realising smarter stormwater management: A review of the barriers and a roadmap for real world application."}, {"paperId": "5b0c02667552b016d9024f02b9dd60307f5678fc", "title": "A scoping review of literature on the application of swarm intelligence in the object classification domain"}, {"paperId": "e1ca851fb51fccc8fc912771f881174e23844ec5", "title": "A Systematic Literature Review and a Conceptual Framework Proposition for Advanced Persistent Threats (APT) Detection for Mobile Devices Using Artificial Intelligence Techniques"}, {"paperId": "ef73d960f32f64ec25feac1ea20d8218c61e493f", "title": "Detection of Cyber Attacks using Machine Learning ‎based Intrusion Detection System for IoT Based Smart ‎Cities"}, {"paperId": "15d159e025a409223e194c78a9bbd8f248ac87f0", "title": "Privacy and Tracking in the Emerging Mobile Applications: A Survey"}, {"paperId": "f06b5022a7e30412514adff4a8a3a9bb2a6d5da0", "title": "Smartphone Security and Privacy: A Survey on APTs, Sensor-Based Attacks, Side-Channel Attacks, Google Play Attacks, and Defenses"}, {"paperId": "18ea15823d673860a23ba9dce501335caf2da89f", "title": "An improved privacy attack on smartphones exploiting the accelerometer"}, {"paperId": "e9e6711d156042f66c08da829151f3aa10870a9a", "title": "A Linux Audit and MQTT-based Security Monitoring Framework"}, {"paperId": "606faaa65d8c8550af518b809360cb4e01f40ccb", "title": "Are We Aware? An Empirical Study on the Privacy and Security Awareness of Smartphone Sensors"}, {"paperId": "49ff60fc7aade62e47d1f25af266739bbc6307fc", "title": "Linking blockchain technology and digital advertising: How blockchain technology can enhance digital advertising to be more effective, efficient, and trustworthy"}, {"paperId": "eae25c411433b9a660fb497f993f3afd9a38cc14", "title": "Improving Robustness Against Adversarial Attacks with Deeply Quantized Neural Networks"}, {"paperId": "115e9a74d039fe0612e805ae498f7ea8e7485dd8", "title": "The “Smart” Concept from an Electrical Sustainability Viewpoint"}, {"paperId": "b51dcff729accce86d71493101b6a00c16a3a638", "title": "EavesDroid: Eavesdropping User Behaviors via OS Side Channels on Smartphones"}, {"paperId": "cecba1a7dc72a40e740d2c9d9e17f915c709c6c2", "title": "A comprehensive survey on authentication and secure key management in internet of things: Challenges, countermeasures, and future directions"}, {"paperId": "e342f3016c61e7c7d71ebe758d26192645887811", "title": "Wrapper-based deep feature optimization for activity recognition in the wearable sensor networks of healthcare systems"}, {"paperId": "aad25553f7d2ecca7d8070729499413577504c98", "title": "An IoT and spatial Big data based architecture for monitoring Occupational Health Risks exposure"}, {"paperId": "1fdb0620e0a676a42f035a8f3b56bf84576e4ca7", "title": "Energy consumption of on-device machine learning models for IoT intrusion detection"}, {"paperId": "3614816dec3053164da238155936e3cd2a11e795", "title": "Eye-based keystroke prediction for natural texts – a feasibility analysis"}, {"paperId": "83dd8686ff4330127ae39499590ddb3d761b1045", "title": "Living in the Dark: MQTT-Based Exploitation of IoT Security Vulnerabilities in ZigBee Networks for Smart Lighting Control"}, {"paperId": "3c45a4492e2f767611fd701f28045740afaa9afc", "title": "Geospatial complex event processing in smart city applications"}, {"paperId": "e2f36020b0af9e0061976aa4ac62a0fe8e533908", "title": "Identifying Channel Related Vulnerabilities in Zephyr Firmware"}, {"paperId": "5ceaa807ab9a41e38b5b5623597eb4a903add12c", "title": "Who’s Controlling My Device? Multi-User Multi-Device-Aware Access Control System for Shared Smart Home Environment"}, {"paperId": "d0e920489186844abdcfad1e87b0733e40b4da1a", "title": "STMAD: sensor-based threat’s mitigation on smartphones using allowlist and denylist"}, {"paperId": "4fa3bf4584c87bd40de27c3897840e0a0895f79f", "title": "Heterogeneous Network Access and Fusion in Smart Factory: A Survey"}, {"paperId": "3168682b728792c40e66e6a8d64aefa940c95727", "title": "SBTDDL: A novel framework for sensor-based threats detection on Android smartphones using deep learning"}, {"paperId": "d8fb0bce261a8eb253b6aa510ab653808ff433e4", "title": "A Systematic Survey of Attack Detection and Prevention in Connected and Autonomous Vehicles"}, {"paperId": "6f69a7f3310dcdba0e0081e122182072b872d83a", "title": "Emerging technologies and design aspects of next generation cyber physical system with a smart city application perspective"}, {"paperId": "ce563f2ad74761bd78cd251d6c60e8a88b69a59c", "title": "Securing the operation of Smart Home Systems: a literature review"}, {"paperId": "3348b08fd6b8729b928c7ed1f832e4db8696d83b", "title": "Classification of Encrypted IoT Traffic despite Padding and Shaping"}, {"paperId": "4e8fc02d2e360cf247754420f29a3bb250d0bada", "title": "Characterizing Sensor Leaks in Android Apps"}, {"paperId": "e8255098d675767bb75148f358a1069c47b4750b", "title": "A Survey on Security and Privacy Issues of UAVs"}, {"paperId": "1a51c0edf5ea05b13e943be09db559ce7c22f7ea", "title": "Towards Practical Integrity in the Smart Home with HomeEndorser"}, {"paperId": "082be2d2cef8cbc59b887680e767ffdc7bdfbda5", "title": "A Survey of Honeypots and Honeynets for Internet of Things, Industrial Internet of Things, and Cyber-Physical Systems"}, {"paperId": "1d36c1898d44dcb62b5c24aa022d59ca906c3e82", "title": "DDAF: Deceptive Data Acquisition Framework against Stealthy Attacks in Cyber-Physical Systems"}, {"paperId": "0bacc31eb36cc5ae10d3a4bb2dba7aa1ffff2134", "title": "Specialty Grand Challenge: Sensor Networks"}, {"paperId": "bfbf19bb16562b9f6648051be98d279c36c5067a", "title": "Wireless Backhaul in 5G and Beyond: Issues, Challenges and Opportunities"}, {"paperId": "607bcdffe64f11359734379ddf5be0d580676697", "title": "Hey Kimya, Is My Smart Speaker Spying on Me? Taking Control of Sensor Privacy Through Isolation and Amnesia"}, {"paperId": "196c2e1d304093f92b6c6bcd55604c8cc4954f6a", "title": "A Lightweight Remote Mutual Authentication Scheme for Smart Home Environments"}, {"paperId": "df7a4e8c0f0f7c13c758c19a31eb31eae10d2015", "title": "A Survey on Network Security for Cyber–Physical Systems: From Threats to Resilient Design"}, {"paperId": "ee6181e00d5134fb81181ad2bf50f0138a903830", "title": "The Truth Shall Set Thee Free: Enabling Practical Forensic Capabilities in Smart Environments"}, {"paperId": "592feefe59a4134ca5ccfdbd09743334505fc116", "title": "A Survey on IoT-Enabled Home Automation Systems: Attacks and Defenses"}, {"paperId": "96e1842b5e8d6a6c44d59aee89cd533f0faddc88", "title": "A Comprehensive Survey of Security Issues of Smart Home System: “Spear” and “Shields,” Theory and Practice"}, {"paperId": "9570eceaef2d11b8825ebaceb1ae6ff472cdc711", "title": "Bulletin of Electrical Engineering and Informatics"}]}
