{"paperId": "0c3125451c3c965f889ca8f1a14e42581ca88be5", "publicationVenue": {"id": "06b738df-e479-4d00-a5cf-771a9e6d95f8", "name": "International Review of Retail Distribution & Consumer Research", "type": "journal", "alternate_names": ["Int Rev Retail Distrib  Consum Res", "The International Review of Retail, Distribution and Consumer Research", "Int Rev Retail Distrib Consum Res"], "issn": "0959-3969", "url": "http://www.tandfonline.com/loi/rirr20"}, "title": "From transactions to transformations: exploring transformative food retailing", "abstract": "Food retailing is undergoing a major restructuring process that is altering its boundaries, service provision and operations. Digitalisation and other technological advances are shifting the focus from products to services, from offline to online and from physical to virtual. Simultaneously, initiatives such as the United Nations Sustainable Development Goals are exerting pressure on food retailers to address contemporary global challenges, such as promoting healthy and sustainable consumption and production. However, these areas not only challenge food retailers but also provide opportunities for facilitating favourable dietary changes that benefit consumers, companies and society at large. This study introduces transformative food retailing as a construct that shifts attention to the reconfigured role of food retailing and its potential. We identify the shaping forces and characteristics of transformative food retailing and discuss the implications for consumers, food retailers and society at large. This paper is among the first to define and conceptualise food retail as transformative and, as a result, sets a platform for future scholarly research and practice to uncover the full potential of food retailing in serving both consumers and society.", "venue": "International Review of Retail Distribution & Consumer Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-17", "journal": {"name": "The International Review of Retail, Distribution and Consumer Research"}, "authors": [{"authorId": "2875028", "name": "Hannu Saarijärvi"}, {"authorId": "104407701", "name": "L. Sparks"}, {"authorId": "1859063", "name": "Elina Närvänen"}, {"authorId": "4745097", "name": "M. Erkkola"}, {"authorId": "3657654", "name": "M. Fogelholm"}, {"authorId": "2571522", "name": "J. Nevalainen"}], "citations": [{"paperId": "30bdd6380d06f31c4e1e076b9a5601f13f002274", "title": "Retail metamorphosis – how retailing reconfigures itself for the future"}]}
