{"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "publicationVenue": null, "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing", "abstract": "In cloud event processing, data generated at the edge is processed in real-time by cloud resources. Both distributed stream processing (DSP) and Function-as-a-Service (FaaS) have been proposed to implement such event processing applications. FaaS emphasizes fast development and easy operation, while DSP emphasizes efficient handling of large data volumes. Despite their architectural differences, both can be used to model and implement loosely-coupled job graphs. In this paper, we consider the selection of FaaS and DSP from a cost perspective. We implement stateless and stateful workflows from the Theodolite benchmarking suite using cloud FaaS and DSP. In an extensive evaluation, we show how application type, cloud service provider, and runtime environment can influence the cost of application deployments and derive decision guidelines for cloud engineers.", "venue": "2022 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-25", "journal": {"name": "2022 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "67-78"}, "authors": [{"authorId": "52198091", "name": "Tobias Pfandzelter"}, {"authorId": "26667701", "name": "S. Henning"}, {"authorId": "2158858860", "name": "Trever Schirmer"}, {"authorId": "1712950", "name": "W. Hasselbring"}, {"authorId": "3077067", "name": "David Bermbach"}], "citations": [{"paperId": "89e87add8f188fea27767955d3deea851a6f4a29", "title": "ShuffleBench: A Benchmark for Large-Scale Data Shuffling Operations with Distributed Stream Processing Frameworks"}, {"paperId": "f84f3a72790e317895196350109ae64e09daacb3", "title": "Are Unikernels Ready for Serverless on the Edge?"}, {"paperId": "5a4c5bdcb02acfb1252fee5a08c90c8c1d9d6fd5", "title": "Serverless Abstractions for Edge Computing in Large Low-Earth Orbit Satellite Networks"}, {"paperId": "d0e7abadd0273eb6f890faf0cf8ca902e418e872", "title": "Application-Centric Benchmarking of Distributed FaaS Platforms using BeFaaS"}, {"paperId": "c4202b1042b194fb5afe87cff4746bd7e99f6457", "title": "Enoki: Stateful Distributed FaaS from Edge to Cloud"}, {"paperId": "7d9126b242c75d448c144e002f80e4027885cab1", "title": "Towards a Benchmark for Fog Data Processing"}, {"paperId": "8f876c2a8f9766606fe18272535a728f3c04afc0", "title": "Benchmarking scalability of stream processing frameworks deployed as microservices in the cloud"}, {"paperId": "d01fa90ee9444121aaa3e814e4876598f593cd3f", "title": "Benchmarking scalability of stream processing frameworks deployed as event-driven microservices in the cloud"}]}
