{"paperId": "0c3ee3008385103d3a015ceb2463a521be33cc19", "publicationVenue": null, "title": "Sampling-based Techniques for Interactive Exploration of Large Datasets", "abstract": "Extracting useful information from large datasets has become increasingly important. While our computational capabilities have improved greatly in the last few decades, data explosion has resulted in the growth rate of data vastly out-pacing that of computational power. In such scenarios, obtaining results within interactive (few seconds at the most) response times is extremely difficult. Exploring data interactively has numerous advantages such as shortening the feedback loop, providing the ability to perform numerous experiments, and giving a smoother user experience. As a result, providing results using a sample of the data to improve query response time has become hugely important. In this work, I will present our efforts in the direction of interactive exploration of large-scale datasets within interactive response times with projects such as DICE, Sesame, FluxQuery, and a unified join sampling approach. We use approaches such as speculative execution, data sampling, faceted exploration, and scan sharing towards this end. In an OLAP scenario, we note that queries occur not in isolation but as part of a larger query session, where queries might be similar to the previously executed queries. DICE uses this session-oriented behavior of a user to speculatively execute and cache the likely follow-up queries, so that the user query can be answered quickly from the cache. DICE scales up to a billion tuples within sub-second response time using 50 nodes. Further, DICE has a novel, intuitive, synergistic interface designed to aid the speculation and faceted exploration used by the backend.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2354853", "name": "N. Kamat"}], "citations": []}
