{"paperId": "0c42af53d90cc5a099ec17e1ac187e9969784903", "publicationVenue": {"id": "9ae47e2b-f3c9-4be8-903a-3d2c5adb10f9", "name": "Journal of Innovative Engineering and Natural Science", "type": "journal", "alternate_names": ["J Innov Eng Nat Sci"], "issn": "2791-7630"}, "title": "Risk analysis of cyber networks: a quantitative approach based on attack-defense trees", "abstract": "Günümüzde siber saldırıların ve potansiyel zararlarının hızla artmasıyla birlikte, şirketler ve kurumlar için siber güvenliğin sağlanması hayati bir öneme sahiptir. Bu çalışmada, siber risklerin nicel bir analizi için saldırı-savunma ağaçları tabanlı bir yaklaşım geliştirilmiştir. Önerilen yaklaşım, siber tehditleri temsil eden düğümlerin risk seviyelerini ölçerek toplam riski hesaplamak için saldırı-savunma ağacını kullanmaktadır. Ayrıca, belirlenen savunma önlemlerinin alınması durumunda güncellenmiş risk değerini sistematik bir şekilde hesaplamaktadır. Geliştirilen siber risk analizi yaklaşımı, oltalama saldırılarına yönelik yaygın bir senaryoya uygulanmış ve çeşitli savunma stratejileri altında siber risk değerleri hesaplanmıştır. Örneğin, savunma önlemleri alınmadığı durumda siber risk değeri 0,28392 olarak hesaplanırken, teknik savunma önlemlerinin (antivirüs, IDS, erişim denetimi, web içerik sınırlandırma ve spam kontrolü) alınması durumunda risk değeri yaklaşık %97,5 azalarak 0,00721 seviyesine düşmektedir. Teknik savunma önlemlerine ek olarak kullanıcı eğitimi de verildiğinde risk değerindeki azalma %98'e ulaşmaktadır. Sadece bireysel kullanıcılara yönelik temel savunma önlemlerinin (antivirüs ve spam kontrolü) alınması durumunda risk değerindeki azalma ise %90 civarında kalmaktadır. Önerilen yaklaşımın doğruluğunu ve önemini örnek çalışma üzerinden elde edilen bu sonuçlar kanıtlamaktadır. Geliştirilen yaklaşımın siber güvenlik stratejilerinin belirlenmesi yolunda katkıları tartışma bölümünde detaylandırılmıştır.", "venue": "Journal of Innovative Engineering and Natural Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-14", "journal": {"name": "Journal of Innovative Engineering and Natural Science"}, "authors": [{"authorId": "2274545242", "name": "Mehmet Ertem"}, {"authorId": "9721751", "name": "Ilker Ozcelik"}], "citations": []}
