{"paperId": "0c5dd87a68d625ddaf1496a965030e96d9e8030e", "publicationVenue": {"id": "8ae673f4-af3c-41fd-8036-1284fb5f1b1c", "name": "Computer Science", "type": "journal", "alternate_names": ["Comput Sci"], "issn": "1508-2806", "url": "http://journals.bg.agh.edu.pl/COMPUTER/", "alternate_urls": ["http://www.csci.agh.edu.pl/", "https://journals.agh.edu.pl/csci"]}, "title": "Set Representation for Rule Generation Algorithms", "abstract": "The task of mining the association rule has become one of the most widely used discovery pattern methods in Knowledge Discovery in Databases (KDD). One such task is to represent the itemset in the memory. The representation of the itemset largely depend on the type of data structure that is used for storing them. Computing the process of mining the association rule im- pacts the memory and time requirement of the itemset. With the increase in the dimensionality of data and datasets, mining such large volume of datasets will be difficult since all these itemsets cannot be placed in the main memory. As representation of an itemset greatly affects the efficiency of the rule mining association, a compact and compress representation of an itemset is needed. In this paper, a set representation is introduced which is more memory and cost efficient. Bitmap representation takes one byte for an element but the set representation uses one bit. The set representation is being incorporated in Apriori Algorithm. Set representation is also being tested for different rule generation algorithms. The complexities of these different rule generation algorithms using set representation are being compared in terms of memory and time execution.", "venue": "Computer Science", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-06", "journal": {"name": "Comput. Sci.", "volume": "23"}, "authors": [{"authorId": "9655179", "name": "Carynthia Kharkongor"}, {"authorId": "16401303", "name": "B. Nath"}], "citations": []}
