{"paperId": "0c6290aba17c0aebd9cb9784df6453378e0f38d4", "publicationVenue": {"id": "c34aaa9c-865d-444d-96c0-7dc7dc341575", "name": "ACM Transactions on Recommender Systems", "type": "journal", "alternate_names": ["ACM Trans Recomm Syst"], "issn": "2770-6699"}, "title": "Communication-Efficient Federated Neural Collaborative Filtering with Multi-Armed Bandits", "abstract": "Federated learning (FL) has received much attention in privacy-preserving and responsible recommender systems. Recent studies have shown promising results while federating widely-used recommendation methods such as collaborative filtering. A major barrier when bringing FL into production is that the model complexity or the volume of gradients to be transmitted over the communication channel grows linearly as the number of items in a particular system increases. To address this challenge, we propose a communication-efficient neural collaborative filtering method for federated recommender systems. First, to align our solution with other deep neural architectures, we construct standard neural collaborative filtering in federated settings. Second, to solve the underlying model complexity challenge, a multi-armed bandit framework is used that intelligently selects a smaller set of payloads for each iteration of federated model training. The item selection is based on a carefully designed reward function that determines which portion of the overall payloads would be optimal for a particular user. The FL model only comprising of the selected items is transmitted over the network. The FL users train their local models in the regular federated learning way utilizing the payload-efficient global model, requiring no additional optimizations. The results show that using only 10% of the model’s payload, our method can achieve recommendation performance comparable with the standard federated neural collaborative filtering.", "venue": "ACM Transactions on Recommender Systems", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-04", "journal": {"name": "ACM Transactions on Recommender Systems"}, "authors": [{"authorId": "2268099332", "name": "Waqar Ali"}, {"authorId": "2290583431", "name": "Muhammad Ammad-ud-din"}, {"authorId": "2266815631", "name": "Xiangmin Zhou"}, {"authorId": "2290809373", "name": "Yan Zhang"}, {"authorId": "2268248750", "name": "Jie Shao"}], "citations": []}
