{"paperId": "0c653ece36b8b67f43cd5a4db78826c11de6780d", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Research on the innovative development model of ideological and political education based on big data and self-media environment", "abstract": "Abstract This paper aims to explore the innovative development model of ideological and political education. By establishing a Civic and Political Science teaching platform, two functions of classroom interaction and online dual-teacher interaction are designed under nine ideological and political teaching modules. The VR technology and system framework are analyzed, and the corresponding MDP algorithm is constructed. The algorithm model was used to analyze the percentage of students’ favorite Civics classrooms and the acceptance level of VR teaching classrooms. The result data show that only 27.5% of students like Civics class, 51.53% of students maintain a neutral attitude towards Civics class again emotionally, and 16.36% of students do not like Civics class. 70.1% of students prefer the means of communication of Internet platform tools. 16.58% of students prefer the means of communication of newspapers and magazines, 50.2% of students prefer the means of video communication, and 35.26% of students prefer the means of video communication. 35.26% of students prefer book communication. This paper provides reference data and models for the development of ideological and political education innovation.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-04", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2244626353", "name": "Lu Li"}], "citations": []}
