{"paperId": "0c78c34cd0e4771450058a2753659d78a0f54b59", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Potential of Ensemble Learning to Improve Tree-Based Classifiers for Landslide Susceptibility Mapping", "abstract": "Ensemble learning methods have been widely used due to their remarkable generalized performance, but their potential in landslide spatial prediction application is not fully studied. To take full advantage of ensemble learning techniques, the classification and regression tree classifier and four tree-based ensemble classifiers of random forest, extremely randomized tree, gradient boosting decision trees, and extreme gradient boosting decision trees are used in this study for landslide susceptibility assessment. Specifically, a stacking ensemble learning framework coupled with embedded feature selection is presented, consisting of multiple tree-based classifiers mentioned previously as base learners and logistic regression as a metalearner in a two-layer structure. In the study area of Yongxin, China, 364 historical landslide locations were first randomly partitioned into a ratio of 7/3 for training and testing the model. Then, a spatial database of 16 landslide causative factors was constructed for landslide prediction. Meanwhile, the relative importance of these factors were quantified by using the total number of feature splits and the average Gini index during the training process, and a novel embedded feature selection method was used in the base learner of the proposed framework to further improve the computational efficiency and predictive performance by allowing each base learner to obtain its own optimal subfeature space. Finally, different methods were assessed by using several evaluation criteria. Experimental results demonstrated that the proposed ensemble learning framework had the highest area under the curve value of 0.864, and it is more effective than the conventional tree-based classifiers and other ensemble learning methods.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-04", "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "4642-4662", "volume": "13"}, "authors": [{"authorId": "1914560835", "name": "Jiahui Song"}, {"authorId": "2154458426", "name": "Yi Wang"}, {"authorId": "95100116", "name": "Zhice Fang"}, {"authorId": "1560644290", "name": "Ling Peng"}, {"authorId": "27099181", "name": "H. Hong"}], "citations": [{"paperId": "c895c8bec030f255c56df3f3e4401150b3b7afee", "title": "Landslide susceptibility assessment using locally weighted learning integrated with machine learning algorithms"}, {"paperId": "38839f467318c5130989e99a1ff1b160aae36d55", "title": "Computational modeling of nanofluid heat transfer using Fuzzy-based bee algorithm and machine learning method"}, {"paperId": "0c0f798e32cf325e347b3627c83d6a9b4397023c", "title": "Urban waterlogging susceptibility assessment based on hybrid ensemble machine learning models: A case study in the metropolitan area in Beijing, China"}, {"paperId": "b32e328c3434a381181dde56edaa9c06e5a677e0", "title": "Selection of contributing factors for predicting landslide susceptibility using machine learning and deep learning models"}, {"paperId": "2f4da344dcc16426cf21d481b5884936748393dd", "title": "Water index and Swin Transformer Ensemble (WISTE) for water body extraction from multispectral remote sensing images"}, {"paperId": "05d9afecf3db180729eb71e100c908148b72f75b", "title": "Dynamic landslide susceptibility mapping over recent three decades to uncover variations in landslide causes in subtropical urban mountainous areas"}, {"paperId": "d7a1da6f3730d9eb9605946eea74e986c548a896", "title": "Machine Learning-Based Human Posture Identification from Point Cloud Data Acquisitioned by FMCW Millimetre-Wave Radar"}, {"paperId": "757753f088fad7adb39b6c6837b3a2e3a9fee396", "title": "An Ensemble Broad Learning System (BLS) for Evaluating Landslide Susceptibility in Taiyuan City, Northern China"}, {"paperId": "f96685480bcda7880daafd45616bd866693d1901", "title": "Mass movement susceptibility prediction and infrastructural risk assessment (IRA) using GIS-based Meta classification algorithms"}, {"paperId": "d20993920f51792d6bb9d04125f3f0b7fd13f415", "title": "Landslide Susceptibility Mapping and Driving Mechanisms in a Vulnerable Region Based on Multiple Machine Learning Models"}, {"paperId": "e3554f04ec80ae200051aef857592d925a4d86a2", "title": "Investigating causative factors and selecting optimal machine learning algorithms for landslide susceptibility assessment in Lom Kao area, northern Thailand"}, {"paperId": "35f6b05577ab2162926ff63d9ed59a1fa49102df", "title": "New model combination meta-learner to improve accuracy prediction P2P lending with stacking ensemble learning"}, {"paperId": "c066723887e977df3c11e4caf8dd04a296d4e2d1", "title": "Population amount risk assessment of extreme precipitation-induced landslides based on integrated machine learning model and scenario simulation"}, {"paperId": "269460d9107b48c9c568dc609a4ff768c90b245e", "title": "Optimization and validation of drug solubility by development of advanced artificial intelligence models"}, {"paperId": "92bd14b06df03aa3d26f363d6285b6fb3b3d30f2", "title": "Ensemble-Based Deep Learning Model for Network Traffic Classification"}, {"paperId": "83482ac5842a79d0d7866d61b3dfffd3a59fc56e", "title": "Modelling flood susceptibility based on deep learning coupling with ensemble learning models."}, {"paperId": "c2ab0986c39b99b55e41ebd51ef47af73951d44b", "title": "Multi-hazard susceptibility mapping based on Convolutional Neural Networks"}, {"paperId": "056d5ec535b0986fea7aeededa033b7534625f9a", "title": "Using computational-intelligence algorithms and remote sensing data to optimize the locations of check dams to control sediment and runoff in Kandolus watershed, Mazandaran, Iran"}, {"paperId": "d8be3219bfeb2ba639962b0a601ccedee3ca7959", "title": "Evaluation of the landslide susceptibility and its spatial difference in the whole Qinghai-Tibetan Plateau region by five learning algorithms"}, {"paperId": "0ab90991469eedd5c64f2dc6f1f63ff8f44c64f8", "title": "Comparison of Tree-Structured Parzen Estimator Optimization in Three Typical Neural Network Models for Landslide Susceptibility Assessment"}, {"paperId": "0b2556896ffcaf3e9b19d93cc2eec13b677c9536", "title": "Flood susceptibility mapping using extremely randomized trees for Assam 2020 floods"}, {"paperId": "ee7f69d92f3e381b7c8bc0244cc12c5776231b28", "title": "AutoGluon: A revolutionary framework for landslide hazard analysis"}, {"paperId": "54ba1689b609112298d8d4f0e7cc557eadcbdcf9", "title": "A Multi-Model Ensemble Approach for Gold Mineral Prospectivity Mapping: A Case Study on the Beishan Region, Western China"}, {"paperId": "7f06c4bb39e2825998e61589c6ee00fd3758dde1", "title": "Analysis of the ultrasonic signal in polymeric contaminated insulators through ensemble learning methods"}, {"paperId": "53032f074999b4da2196b5b03074fc93a0b14df5", "title": "Employing Remote Sensing, Data Communication Networks, AI, and Optimization Methodologies in Seismology"}]}
