{"paperId": "0c7caaed60f2752a696a8f300bec025f95004d56", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Targeted projection pursuit similarity based attribute selection for academic performance prediction", "abstract": "The performance of student in the academic field reveals the consideration over researchers to enhance student's weakness. With the consumption of high potential factors from the dataset, accurate student performance prediction is carried out. Targeted projection pursuit similarity based attribute selection (TPPS‐AS) technique is designed to improve the student academic performance prediction. TPPS is a machine learning technique that observes the given input. The relevant attributes from the multidimensional space is determined by TPPS. Several research works were recognized recently to conclude the high potential factors for observing student academic performances. A novel technique is designed in this research work to improve the student academic performance prediction in a taken dataset by choosing more relevant attributes. To detect the student academic performance with better accuracy and lesser time, proposed TPPS‐AS technique is employed. The performance of student academic performance prediction is improved by TPPS‐AS technique through the attribute selection with higher accuracy. With this proposed technique, prediction accuracy of the student academic performance is increased after the relevant attributes selection process.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-30", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2088131429", "name": "K. Ramanathan"}, {"authorId": "2129037244", "name": "Balasubramanian Thangavel"}], "citations": []}
