{"paperId": "0c7dfed0102df6a3f86b758f9fb9c6c7ae73d64e", "publicationVenue": null, "title": "FOCUSeR: A Fog Online Context-Aware Up-to-Date Sensor Ranking Method", "abstract": "Data obtained from sensors connected to wireless sensor networks must be stored and processed to enable environments such as smart cities. However, with the exponential growth in the number of devices at the edge of the network, it is necessary to implement robust techniques, capable of selecting reliable data sources and meeting low latency requirements, in order to serve critical applications. Thus, to overcome these challenges, this research work presents FOCUSeR, a method for ranking sensors. The method uses the evaluation of data as a criterion for the ranking, allowing us to identify occurrences of failures in sensors and anomalies in environments. In order to meet the requirements inherent to WSNs, the proposed method was developed to run in a fog computing environment, using online learning and constant updating over time to avoid effects such as time drift. The generated ranking lists are managed through distributed hash tables. To provide reliability to the experimental results, a real experimental environment was developed. Moreover, using this developed testbed, a dataset with labels was created, to support the evaluation of the method. In addition, four other real datasets were used, three of which were labeled through artificial fault injection. These datasets were labeled in a related work that focused on injecting artificial faults. The experimental results obtained demonstrate that the proposed approach can provide reliability in the use of sensor data, using low computational resources and reducing latency in the sensor selection process. Precision rates are approximately 98% and Accuracy rates are greater than 94% across all datasets. In addition, the analyses carried out show that the Accuracy has an increasing rate as the number of samples also increases. Results obtained in the failure data recovery also demonstrate the feasibility of the proposal in this resource.", "venue": "J. Sens. Actuator Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-17", "journal": {"name": "J. Sens. Actuator Networks", "pages": "25", "volume": "11"}, "authors": [{"authorId": "145748016", "name": "F. Costa"}, {"authorId": "2165629800", "name": "Silvia M. Nassar"}, {"authorId": "144749724", "name": "M. Dantas"}], "citations": [{"paperId": "d3ed1e6dda04760a57658c2e469c85f749d281bb", "title": "On the Optimal Self-Supervised Multi-Fault Detector for Temperature Sensor Data"}]}
