{"paperId": "0cabcccb14ca405e6053bf903d31922b64da6141", "publicationVenue": null, "title": "Level of Detail Exploration of Electronic Transition Ensembles using Hierarchical Clustering", "abstract": "We present a pipeline for the interactive visual analysis and exploration of molecular electronic transition ensembles. Each ensemble member is specified by a molecular configuration, the charge transfer between two molecular states, and a set of physical properties. The pipeline is targeted towards theoretical chemists, supporting them in comparing and characterizing electronic transitions by combining automatic and interactive visual analysis. A quantitative feature vector characterizing the electron charge transfer serves as the basis for hierarchical clustering as well as for the visual representations. The interface for the visual exploration consists of four components. A dendrogram provides an overview of the ensemble. It is augmented with a level of detail glyph for each cluster. A scatterplot using dimensionality reduction provides a second visualization, highlighting ensemble outliers. Parallel coordinates show the correlation with physical parameters. A spatial representation of selected ensemble members supports an in‐depth inspection of transitions in a form that is familiar to chemists. All views are linked and can be used to filter and select ensemble members. The usefulness of the pipeline is shown in three different case studies.", "venue": "Computer graphics forum (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-01", "journal": {"name": "Computer Graphics Forum", "volume": "41"}, "authors": [{"authorId": "65799996", "name": "S. S. Thygesen"}, {"authorId": "2318702", "name": "Talha Bin Masood"}, {"authorId": "1923478", "name": "M. Linares"}, {"authorId": "2105903", "name": "V. Natarajan"}, {"authorId": "1706029", "name": "I. Hotz"}], "citations": [{"paperId": "a839db1f588f9f5f178d6d0b5d3b77daae82530f", "title": "Continuous Scatterplot Operators for Bivariate Analysis and Study of Electronic Transitions"}, {"paperId": "2fcce73ceac1f1d6e91fa50228457eecf831a00a", "title": "Designing Feature Vector Representations: A case study from Chemistry"}]}
