{"paperId": "0cad55eb4189759f3ebdf64616693b2cd7ce99c9", "publicationVenue": {"id": "d9595383-415d-4f4f-ab3f-e9a71271dc68", "name": "Journal of Civil Engineering and Management", "type": "journal", "alternate_names": ["J Civ Eng Manag"], "issn": "1392-3730", "url": "http://www.tandfonline.com/tcem", "alternate_urls": ["http://www.tandf.co.uk/journals/TCEM/", "http://jcem.vgtu.lt/", "http://www.tandfonline.com/toc/tcem20/current"]}, "title": "BLOCKCHAIN OF OPTIMAL MULTIPLE CONSTRUCTION PROJECTS PLANNING UNDER PROBABILISTIC ARRIVAL AND STOCHASTIC DURATIONS", "abstract": "With the rapid development of projects, firms are facing challenges in planning and controlling complex multiple construction projects. This research, therefore, aims at developing blockchain of optimal scheduling and sequencing of multiple construction projects under probabilistic arrival and stochastic durations. Each project task was considered as a block. Then, a framework for electronic project recording (EPR) system was developed. The EPRs are records for project tasks that make information available directly and securely to authorized users. In this framework, two optimization models were developed for scheduling and sequencing project blocks. The scheduling model aims to assign project tasks to available resources at minimal total cost and maximal the number of assigned project tasks. On the other hand, the sequencing model seeks to determine the start time of block execution while minimizing delay costs and minimizing the sum of task’s start times. The project arrival date and the task’s execution duration were assumed probabilistic and stochastic (normally distributed), respectively. The developed EPR system was implemented on a real case study of five projects with total of 121 tasks. Further, the system was developed when the task’s execution duration follows the Program Evaluation and Review Technique (PERT) model with four replications. The project costs (idle time and overtime costs) at optimal plan were then compared between the task’s execution duration normally distributed and PERT modelled. The results revealed negligible differences between project costs and slight changes in the sequence of project activities. Consequently, both distributions can be used interchangeably to model the task’s execution duration. Furthermore, the project costs were also compared between four solution replications and were found very close, which indicates the robustness of model solutions to random generation of task’s execution duration at both models. In conclusion, the developed EPR framework including the optimization models provided an effective planning and monitoring of construction projects that can be used to make decisions through project progress and efficient sharing of project resources at minimal idle and overtime costs. Future research considers developing a Blockchain of optimal maintenance planning.", "venue": "Journal of Civil Engineering and Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-03", "journal": {"name": "JOURNAL OF CIVIL ENGINEERING AND MANAGEMENT"}, "authors": [{"authorId": "1399207229", "name": "A. Al-Refaie"}, {"authorId": "2042179712", "name": "Ahmad Al-Hawadi"}, {"authorId": "3124500", "name": "N. Lepkova"}, {"authorId": "70475835", "name": "G. Abbasi"}], "citations": [{"paperId": "b828ea2176b26d3043ee1dcca6c59e794477fbe4", "title": "Real Estate Industry Sustainable Solution (Environmental, Social, and Governance) Significance Assessment—AI-Powered Algorithm Implementation"}]}
