{"paperId": "0cb1408a191e23da467e7d46a7a99a2c86bcc439", "publicationVenue": null, "title": "An Overview on Emerging Security Threats in Big Data Clusters and their Defenses", "abstract": "Big Data is the aggregation of many hardware and software innovations on a heterogeneous base. However, even before the most recent revelations on the concept of Big Data, the vast volumes of data that various analytical firms have collected, kept, and have sparked intrigue. Despite the fact that the security industry is currently one of the primary sectors that huge data for safety objectives, there is a paucity of research that plans foundational systems and provides security requirements for large data execution in security. Unfortunately, electronic attacks, which are the result of the increased reliance on technology, are now a phenomenon with which must be confronted. It is employed in a range of industries, including medical services, security, and web-based entertainment, since it enables speedy and intelligent Big Data solutions. The daily use of media communications services and the internet, electronic devices, Visas, and other similar activities generate large volumes of data that can be classified to facilitate interactions that result in improved decisions and strategic business moves. As innovation has become more complex, the sorts of malware in these breaches have developed and become more complex. Consequently, the goal of the study was to apply big data to the security industry, a novel topic. Due to the structure's adaptability, few defects are produced. These defects put the data at danger and result in assaults. In this work, many sorts of vulnerabilities and potential strategies to mitigate or eradicate them are discussed.", "venue": "2022 International Conference on Edge Computing and Applications (ICECAA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-10-13", "journal": {"name": "2022 International Conference on Edge Computing and Applications (ICECAA)", "pages": "41-49"}, "authors": [{"authorId": "93412553", "name": "Aviral Srivastava"}, {"authorId": "72161196", "name": "Viral Parmar"}], "citations": []}
