{"paperId": "0cc3d018fcbcdeccf0e124f5646f8afa6461bb10", "publicationVenue": {"id": "4f9c2bb7-ec38-45aa-b0b3-8bd7680ccc1f", "name": "SIGMOD record", "type": "journal", "alternate_names": ["SIGMOD rec", "Sigmod Record", "Sigmod Rec"], "issn": "0163-5808", "url": "http://portal.acm.org/browse_dl.cfm?CFID=85291668&CFTOKEN=27828468&coll=ACM&dl=ACM&idx=J689&linked=1&part=newsletter", "alternate_urls": ["http://portal.acm.org/sigmod/newsletter"]}, "title": "Provenance in Collaborative in Silico Scientific Research", "abstract": "Science is a collaborative activity by definition. Research is usually conducted by several scientists working together, and this behavior has been intensified in recent years. Furthermore, experiments are increasingly performed in silico, which demands proper support tools. Provenance-aware Workflow Management Systems and script-based tools have been popular ways of running in silico experiments, but these tools often neglect the collaboration aspect. Even solutions that aim at collaborative experiments do not always address the collaborators- needs. Literature shows surveys discussing subjects related to in silico experiments. However, they either focus on provenance collection and applications, thus treating collaboration as just another possible application, or focus on Workflow Management Systems, only listing collaboration as a possible challenge. This article surveys available tools and approaches that aim at aiding scientists to conduct collaborative in silico experiments. Particularly, we focus on challenges related to the provenance of these collaborative experiments. We devise a taxonomy with the aspects of collaboration in scientific research and discuss each of these aspects. We also identify literature gaps that provide future opportunities.", "venue": "SIGMOD record", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-09", "journal": {"name": "ACM SIGMOD Record", "pages": "36 - 51", "volume": "49"}, "authors": [{"authorId": "1417272426", "name": "Eduardo Jandre"}, {"authorId": "2286407159", "name": "Bruna Diirr"}, {"authorId": "2280212143", "name": "Vanessa Braganholo"}], "citations": [{"paperId": "ecca166beffbc2fe591d851ca04693d46cfcd55c", "title": "Summarizing Provenance of Aggregate Query Results in Relational Databases"}, {"paperId": "707664b6aa206f14dae036e469baef573665ebc3", "title": "A Blockchain-Based Architecture for Trust in Collaborative Scientific Experimentation"}, {"paperId": "7272a31dbd389c5f2c3f151a3b67d3bdceaff489", "title": "PROV-IO: An I/O-Centric Provenance Framework for Scientific Data on HPC Systems"}, {"paperId": "cdde42705366bc806422ecbd6b90162227a22639", "title": "CoCalc: an integrated environment for open science education in informatics and mathematics"}, {"paperId": "c330fa2dee65be4a8ccdc83e64a5e068c21e6437", "title": "Towards A Practical Provenance Framework for Scientiﬁc Data on HPC Systems"}, {"paperId": "0b79b1ad6a175bdaeb2b29b9b6008691170f7403", "title": "CoCalc Tools as a Means of Open Science and Its Didactic Potential in the Educational Process"}]}
