{"paperId": "0ccfa0319b1a455fa155fd071313818fe716fb37", "publicationVenue": null, "title": "End-User Privacy Protection Scheme from cyber intrusion in smart grid advanced metering infrastructure", "abstract": null, "venue": "Int. J. Crit. Infrastructure Prot.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-12", "journal": {"name": "Int. J. Crit. Infrastructure Prot.", "pages": "100410", "volume": "34"}, "authors": [{"authorId": "1807412", "name": "N. Singh"}, {"authorId": "34332977", "name": "V. Mahajan"}], "citations": [{"paperId": "f288c9802dd3eedae6fbc5e5f665c746b8e37500", "title": "Secure and privacy improved cloud user authentication in biometric multimodal multi fusion using blockchain-based lightweight deep instance-based DetectNet."}, {"paperId": "e10ae6edec52c400da3f61d0c4c4dee18b2b11a0", "title": "A study of user data privacy protection algorithms in the context of metaverse based on emotional AI IoT"}, {"paperId": "0b0f68874ae999439f9faefeb606a2f4acc26b48", "title": "Business Impact Analysis of AMM Data: A Case Study"}, {"paperId": "9e15b90f2effec27c2244cff822684f206aa9f7d", "title": "A WOA-CNN-BiLSTM-based multi-feature classification prediction model for smart grid financial markets"}, {"paperId": "620bdf7f09d59b4d7d1db1f4a7bfe0c5dc13e286", "title": "A Trust and Energy based Routing using Gorilla Troops Optimization in RPL Networks"}, {"paperId": "0e7976162b77e3e1cbd4419c7da36e97e0f019ee", "title": "An IOT based smart grid system for advanced cooperative transmission and communication"}, {"paperId": "f18f6e047ef4c4f59c94291da901fc3ecbe35d37", "title": "A detection model of scaling attacks considering consumption pattern diversity in AMI"}, {"paperId": "b89ac804508ada4b4ec4f1ae0581a3977c9c76a3", "title": "Implementation of a smart energy meter using blockchain and Internet of Things: A step toward energy conservation"}, {"paperId": "1249a8cf024bb10c9240349e64832177353d1c92", "title": "A hybrid deep learning model for discrimination of physical disturbance and cyber-attack detection in smart grid"}, {"paperId": "b05b2489ca4ca5116c627f185beb03b12769bcd8", "title": "A Fractional Order Super Twisting Sliding Mode Controller for Energy Management in Smart Microgrid Using Dynamic Pricing Approach"}, {"paperId": "ddfdd1d4cf33078cdd1acda6d827bf12e955ff29", "title": "Cybersecurity in the Smart Grid: Practitioners' Perspective"}, {"paperId": "5661102282884128fa9012c8fe94f31547e733b3", "title": "Statistical machine learning defensive mechanism against cyber intrusion in smart grid cyber-physical network"}, {"paperId": "43f4d7a04b436a844e17e3d806bc943073a65811", "title": "Electricity theft detection in unbalanced sample distribution: a novel approach including a mechanism of sample augmentation"}, {"paperId": "00d9dddce6bb3c534a0ec31f21c98e362daf43ad", "title": "Research on wireless metering based on high-precision synchronous time calibrating and broadband transmission"}, {"paperId": "5dbf437aedd1a2af53ec867b4467abdf4e82d49a", "title": "A rule-based model for electricity theft prevention in advanced metering infrastructure"}, {"paperId": "dfef598ed2ec3ad9c647657fa4f5ac2c8b49cd3f", "title": "CUCKOO-ANN Based Novel Energy-Efficient Optimization Technique for IoT Sensor Node Modelling"}, {"paperId": "a82c9a1fcd1d32220382155b371d3baaf21c4989", "title": "A survey and bibliometric analysis of different communication technologies available for smart meters"}, {"paperId": "9a7e841ca8133fa51a96b2cc380986754a498994", "title": "Design of a coordinated cyber-physical attack in IoT based smart grid under limited intruder accessibility"}, {"paperId": "84b0cce9c285bfa8e13f1d09cad123364b0d1249", "title": "Legal Aspects of Cybersecurity in the Energy Sector—Current State and Latest Proposals of Legislative Changes by the EU"}, {"paperId": "b0a7814a821231e463ba41bcad5b2701404ff051", "title": "Securing communications between smart grids and real users; providing a methodology based on user authentication"}, {"paperId": "cfb0f260bf364ded59c2c23b70a4ee4b0197419c", "title": "Intrusion Detection in Cyber-Physical Layer of Smart Grid Using Intelligent Loop Based Artificial Neural Network Technique"}, {"paperId": "c6af0af6719787865b87500beec8207ae4976a3f", "title": "Privacy-Preserving Fog Aggregation of Smart Grid Data Using Dynamic Differentially-Private Data Perturbation"}, {"paperId": "5523ac84ad7aa05c3935f1562c8551e6885373b2", "title": "on Two-Way Human Resource Recommendation Method Considering User Privacy"}]}
