{"paperId": "0ce51ad682ead66309aead2b7a2c9aa2e274d672", "publicationVenue": {"id": "6a27e1f5-8a5a-4af5-8fdf-c53fa9dc26ea", "name": "UHD Journal of Science and Technology", "type": "journal", "alternate_names": ["UHD J Sci Technol"], "issn": "2521-4209", "url": "http://journals.uhd.edu.iq/index.php/uhdjst/index", "alternate_urls": ["http://journals.uhd.edu.iq/index.php/uhdjst/issue/archive"]}, "title": "Malicious URL Detection Using Decision Tree-based Lexical Features Selection and Multilayer Perceptron Model", "abstract": "Network information security risks multiply and become more dangerous. Hackers today generally target end-to-end technology and take advantage of human weaknesses. Furthermore, hackers take advantage of technology weaknesses by applying various methods to attack. Nowadays, one of the greatest dangers to the modern digital world is malicious URLs, and stopping them is one of the biggest challenges in the field of cyber security. Detecting harmful URLs using machine learning and deep learning algorithms have been the subject of various academic papers. However, time and accuracy are the two biggest challenges of these tools. This paper proposes a multilayer perceptron (MLP) model that utilizes two significant aspects to make it more practical, lightweight, and fast: Using only lexical features and a decision tree (DT) algorithm to select the best relevant subset of features. The effectiveness of the experimental outcomes is evaluated in terms of time, accuracy, and error reduction. The results show that a MLP model using 35 features could achieve an accuracy of 94.51% utilizing only URL lexical features. Furthermore, the model is improved in time after applying the DT as feature selection with a slight improvement in accuracy and loss.", "venue": "UHD Journal of Science and Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-13", "journal": {"name": "UHD Journal of Science and Technology"}, "authors": [{"authorId": "2191288624", "name": "Warmn Ahmed"}, {"authorId": "2191339045", "name": "Noor Ghazi M. Jameel"}], "citations": []}
