{"paperId": "0d05e135f64992b547de31bed33ac3ca64d276c5", "publicationVenue": {"id": "3d58f8bf-fe41-4b9c-84c4-5c4299f3041e", "name": "IEEE Latin America Transactions", "type": "journal", "alternate_names": ["IEEE Lat Am Trans"], "issn": "1548-0992", "url": "https://www.ewh.ieee.org/reg/9/etrans/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9907", "http://ieeexplore.ieee.org/servlet/opac?punumber=9907"]}, "title": "Comparative study of methods to obtain the number of hidden neurons of an auto-encoder in a high-dimensionality context", "abstract": "Fourteen formulas from the state-of-art were used in this paper to find the optimal number of neurons in the hidden layer of an autoencoder neural network. The latter is employed to reduce the dataset dimension on high-dimensionality scenarios with not significant reduction in classification accuracy in comparison to the use of the whole dataset. A Deep Learning neural network was employed to analyze the effectiveness of the studied formulas in classification terms (accuracy). Eight high-dimensional datasets were processed in an experimental set in order to assess this proposal. Results presented in this work show that formula 13 (used to find the number of hidden neurons of the auto-encoder) is effective to reduce the data dimensionality without a statistically significant reduction of the classification performance, as it was confirmed by the Freidman test and the Holm's post-hoc test.", "venue": "IEEE Latin America Transactions", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-12-01", "journal": {"name": "IEEE Latin America Transactions", "pages": "2196-2203", "volume": "18"}, "authors": [{"authorId": "2077522161", "name": "Hector R. Vega-Gutierrez"}, {"authorId": "2077526144", "name": "Carlos Castorena"}, {"authorId": "2578667", "name": "R. Alejo"}, {"authorId": "1410653918", "name": "E. E. Granda-Gutiérrez"}], "citations": [{"paperId": "f7724e1572274b0a84304ec0d41b677e3210b7dc", "title": "Density-Based Clustering to Deal with Highly Imbalanced Data in Multi-Class Problems"}]}
