{"paperId": "0d1bb0d5d775ef9fe9ae903f23ee3e9e6ad06615", "publicationVenue": null, "title": "Spatially enabling the Global Framework for Climate Services: Reviewing geospatial solutions to efficiently share and integrate climate data & information", "abstract": null, "venue": "", "year": 2017, "fieldsOfStudy": ["Geography"], "publicationTypes": ["Review"], "publicationDate": "2017-12-01", "journal": {"name": "Climate Services", "pages": "44-58", "volume": "8"}, "authors": [{"authorId": "38612853", "name": "G. Giuliani"}, {"authorId": "1987744", "name": "S. Nativi"}, {"authorId": "145902059", "name": "A. Obregón"}, {"authorId": "2003787", "name": "M. Beniston"}, {"authorId": "2771547", "name": "A. Lehmann"}], "citations": [{"paperId": "b646ae09744f00d46730bd435ede797f4f7a9028", "title": "Increasing the prospective capacity of global crop and rangeland monitoring with phenology tailored seasonal precipitation forecasts"}, {"paperId": "c0c2f7ad18d07975c23ba80ae22f0950dad8463c", "title": "Toward effective communication of agrometeorological services"}, {"paperId": "9f16917fe27915a1d31831f513167724843e50c0", "title": "Employing the agricultural classification and estimation service (ACES) for mapping smallholder rice farms in Bhutan"}, {"paperId": "f0b16dd8d30ef9708883ed42fc388059eba92341", "title": "Improved representativeness of simulated climate using natural units and monthly resolution"}, {"paperId": "59ce063e2f282c30bc03e33e5ead3369efdce1b2", "title": "DEPLOYMENT OF AI-ENHANCED SERVICES IN CLIMATE RESILIENCE INFORMATION SYSTEMS"}, {"paperId": "68be23a8afa6e3e7a21e6869dcc4476793dab7d3", "title": "Successful climate services for adaptation: What we know, don’t know and need to know"}, {"paperId": "815a84467c6177fbfa85a7fea592e3bfe3bb3d3e", "title": "Re-prioritizing climate services for agriculture: Insights from Bangladesh"}, {"paperId": "d22098f1ed3bbc38c8e7a72185b35d4f859da363", "title": "Essential earth observation variables for high-level multi-scale indicators and policies"}, {"paperId": "1515bf000e3135d86687328cf4eb59a05398b834", "title": "Towards more effective visualisations in climate services: good practices and recommendations"}, {"paperId": "a2d777ecbc1013d64892bd44224a5746f26e5b92", "title": "Hydrological Web Services for Operational Flood Risk Monitoring and Forecasting at Local Scale in Niger"}, {"paperId": "f13441c2fd0ac32a9129f2287d7c5c6336f8c2b2", "title": "Numerical weather prediction and climate modelling: Challenges and opportunities for improving climate services delivery in Southern Africa"}, {"paperId": "d03408ef42070f328b8a138807ee784875e4fef0", "title": "Climate data for the European forestry sector: From end-user needs to opportunities for climate resilience"}, {"paperId": "7b963003930c54b4397b3457cd1dd89e4c4fc684", "title": "Advancing future climate services: Multi-sectorial mapping of the current usage and demand in Denmark"}, {"paperId": "6725a5d19c25438c4efb595f49b75d18b3bbe6b5", "title": "Toward a definition of Essential Mountain Climate Variables"}, {"paperId": "49ac97e928138d42c82e4970da17e71cf64f6ce2", "title": "SwissEnvEO: A FAIR National Environmental Data Repository for Earth Observation Open Science"}, {"paperId": "ec293bfb148dc5b01ec5b519f3d17a5867cb6a3a", "title": "Curating and Visualizing Dense Networks of Monsoon Precipitation Data: Integrating Computer Science Into Forward Looking Climate Services Development"}, {"paperId": "1aa6e2cb5f295c49ba7ef6654706bdf173efd4b5", "title": "Big Data and Actuarial Science"}, {"paperId": "3c97a089cf922b6e1931bf04268b83bfddb4a849", "title": "Archetypical opportunities for water governance adaptation to climate change"}, {"paperId": "1dbe533610738c83688fe490a9e536a6267b3402", "title": "Essential Variables for Environmental Monitoring: What Are the Possible Contributions of Earth Observation Data Cubes?"}, {"paperId": "94e8f776edd5a5ec5d1b34ca7c6493e50712700e", "title": "The VLab Framework: An Orchestrator Component to Support Data to Knowledge Transition"}, {"paperId": "4b03c1b59544fc1d023a31fa920b7afb84ee8afa", "title": "Knowledge generation using satellite earth observations to support sustainable development goals (SDG): A use case on Land degradation"}, {"paperId": "452b41f0d76c5d4e403e9e7d915030316b837bf1", "title": "Harnessing Big Data to Support the Conservation and Rehabilitation of Mangrove Forests Globally"}, {"paperId": "1b05b22e11b5c7f00bfcb7a6114eeccc4ed2953e", "title": "Reviewing the discoverability and accessibility to data and information products linked to Essential Climate Variables"}, {"paperId": "4bb61bd9f485d9ac808b9aa025cd8d253d21b641", "title": "Towards integrated essential variables for sustainability"}, {"paperId": "fb70747ce4030732a274f75fd21207b88927006c", "title": "Reflexive climate service infrastructure relations"}, {"paperId": "0118fce413400ba879658440955cf6713bf8c489", "title": "Digitale Lösungen als Beitrag zur Klimawandelanpassung von Verkehrsinfrastruktur? Eine Analyse webbasierter Anpassungsplattformen hinsichtlich ihrer Nutzerorientierung"}, {"paperId": "b48a917258f4e7e2b78a41289d005513db1de8c9", "title": "Earth Observation Open Science: Enhancing Reproducible Science Using Data Cubes"}, {"paperId": "63c822ec5390179ca1c9f8a66261ad0582504c6f", "title": "The Contribution of the Global Framework for Climate Services Adaptation Programme in Africa (GFCS APA) in National Adaptation Plan (NAP) Process for Tanzania"}, {"paperId": "9be79fc20623746beb163f7fbd334bd2fe445133", "title": "Paving the Way to Increased Interoperability of Earth Observations Data Cubes"}, {"paperId": "5f85f4d7d4eb27cae0e9625ae99996484471eb9c", "title": "A new homogenized daily data set for temperature variability assessment in Italy"}, {"paperId": "ebd9cced047dbb2aafe237b458674b9987cb33cf", "title": "Challenges to the sustainability of climate services in Europe"}, {"paperId": "269a18ca18438c5af3fe83dfefa5828582e2f556", "title": "Towards a knowledge base to support global change policy goals"}, {"paperId": "1e7394ffd58c02408265ac7a4b34a4e32d01b5b2", "title": "The evolving landscape of climate services in sub-Saharan Africa: What roles have NGOs played?"}, {"paperId": "b58b30f6cad64db3667644e72cb72effacd516fe", "title": "Toward a multi-faceted conception of co-production of climate services"}, {"paperId": "ed9ee2c0a5884cb935902a73a7c579faa49475ad", "title": "A brokered Virtual Hub approach for the generation of web applications based on historical maps"}, {"paperId": "6f8e675ea7dda1ce95a77a162564b6875e28d340", "title": "Design for Geospatially Enabled Climate Modeling and Alert System (CLIMSYS): A Position Paper (Short Paper)"}, {"paperId": "1fb004f55c342af5d724ae9a1bf74935824064be", "title": "Semi-Automatic Operational Service for Drought Monitoring and Forecasting in the Tuscany Region"}, {"paperId": "6c17f46955aabd0f1e07e5bfc81917ce329760b6", "title": "Augmented Smart Cities Integrating Sensor Web and Spatial Data Infrastructure (SmaCiSENS)"}, {"paperId": "77c6728ffebdc0f59bd6049409fb5605f01bce66", "title": "Design of Web based Geospatial Data Services Framework – An Implementation of Web-based Climate Services"}, {"paperId": "e15d6192b9295d1d81276d6b3dfc4b1d523ded2e", "title": "Perspective Toward a deﬁnition of Essential Mountain Climate Variables"}, {"paperId": "24e16655392cedbd206eb2d5dc7faaa7deebfbcc", "title": "Perspective Toward a deﬁnition of Essential Mountain Climate Variables"}, {"paperId": "d99140a2adb8539cb890df27509746d8d97bff64", "title": "Earth Observations for Anticipatory Action: Case Studies in Hydrometeorological Hazards"}, {"paperId": "c46c6f0b251a97ee1e7a4d3577ab3e27b2b51f00", "title": "BASIEC: A Coastal Climate Service Framework for Community-Based Adaptation to Rising Sea-Levels"}, {"paperId": "2c3953ad826f67690aa01c271d262b30b03a314b", "title": "Location Intelligence for Augmented Smart Cities Integrating Sensor Web and Spatial Data Infrastructure (SmaCiSENS)"}, {"paperId": "42f5e559ed016d5bada32672ea01335f6bd64062", "title": "Enabling Spatial Intelligence Integrating Architectures of SDI and Sensor Web"}]}
