{"paperId": "0d2445a15c5c04ada543e0d61cc6bde01b595491", "publicationVenue": {"id": "8ba56476-c1c5-4591-8422-2f222f234589", "name": "World Forum on Internet of Things", "type": "conference", "alternate_names": ["WF-IoT", "World Forum Internet Thing"]}, "title": "Towards Real-time Learning for Edge-Cloud Continuum with Vehicular Computing", "abstract": "Sensor-driven IoT systems are well-known for their capacity to accelerate massive amounts of data in a comparatively short period of time. To have any use, the information delivery and decision making based on the data require efficient learning models together with dynamically deployed computing and network resources. The current cloud and high-performance computing infrastructures, as well as modern edge computing systems especially in the 5G and beyond networks, can be addressed to resolve these challenges. However, there are several application areas especially in vehicular and urban computing, where just harnessing more computational power does not solve computational and real-time requirements of the modern sensing systems that operate in mobile and context-dependent environments. For now, the mathematical challenges of distributed computing and real-time learning algorithms have not been profoundly addressed in the context of the IoT and real-world sensing applications. Data-driven systems also require giving full attention to information delivery, data management, data cleaning, and sensor fusion technologies that need to be equally distributed and real-time competent as the learning algorithms themselves. New software-defined computing and networking approaches and architectures are required to orchestrate the numerous connected resources dynamically, controllably, and securely along with the evolving needs. The key challenge here is to uniform collaboration between different aspects of the system, from data processing and delivery to the algorithms and learning models, not forgetting the computational capacity and networking capabilities, all this in real-time with real-world applications.", "venue": "World Forum on Internet of Things", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-14", "journal": {"name": "2021 IEEE 7th World Forum on Internet of Things (WF-IoT)", "pages": "921-926"}, "authors": [{"authorId": "2264026", "name": "Ella Peltonen"}, {"authorId": "2082360000", "name": "Arun Sojan"}, {"authorId": "2159501", "name": "Tero Päivärinta"}], "citations": [{"paperId": "44e6d9f31c25faa528bc8bb0018459df3ff64e62", "title": "Intent-based Management for the Distributed Computing Continuum"}]}
