{"paperId": "0d3205f2be3639d6f211e1c3df493f7752c75ccb", "publicationVenue": {"id": "abcfade0-4cdd-4b9f-bac3-fa13022b0a51", "name": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "type": "conference", "alternate_names": ["Ant Algorithm", "Ant Algorithms", "Int Workshop Ant Colony Optim Swarm Intell", "IEEE Int Conf Adv Netw Telecommun Syst", "Algorithmic Number Theory Symp", "Ant Colony Optimization and Swarm Intelligence", "Int Conf Adv Netw Telecommuncations Syst", "ANTS", "Ant Colony Optim Swarm Intell", "Algorithmic Number Theory Symposium", "International Conference on Advanced Networks and Telecommuncations Systems", "IEEE International Conference on Advanced Networks and Telecommunications Systems"], "url": "http://www.wikicfp.com/cfp/program?id=184", "alternate_urls": ["http://iridia.ulb.ac.be/~ants/", "http://www.wikicfp.com/cfp/program?id=182"]}, "title": "Secure Firmware based Lightweight Trusted Platform Module (FLTPM) for IoT Devices", "abstract": "The Internet of Things (IoT) is a network in which physical things that have Internet access can communicate and share data with other connected objects. IoT is currently gaining popularity due to the large range of applications that it allows. When such applications connect to the Internet, they attempt to send data to other devices across the network. Because certain IoT applications transmit crucial data over the Internet, the data must be protected. However, these IoT devices are limited in terms of power, computation and memory, as well as communication capabilities. IoT devices are being used as a gateway into the larger IoT network. As a result, the security of these devices has become critical in order to protect them from numerous security risks and attacks. There are multiple solutions to mitigate the issue but Trusted Platform Module (TPM) is a prominent one that provides hardware based security but designed primarily for large compute platforms (e.g., desktops, laptops, servers, etc.). Because of the limitations of IoT devices, the traditional method is unsuitable for IoT network & devices and a lightweight and optimized mechanism will be required. Firmware-based Lightweight Trusted Platform Module (FLTPM) is our suggested approach for augmenting hardware security to resource-constrained devices, which includes lightweight cryptography algorithms & services related to providing hardware security, and trusted/safe boot mechanisms. The results showed that the proposed solution was optimized, unique, and lightweight for resource constrained IoT devices, and that it functioned well in appropriate environment conditions.", "venue": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE International Conference on Advanced Networks and Telecommunications Systems (ANTS)", "pages": "738-743"}, "authors": [{"authorId": "2293503166", "name": "Afzal Warsi"}, {"authorId": "2293506965", "name": "Shubham Malav"}, {"authorId": "2293414175", "name": "Vishal J. Rathod"}, {"authorId": "2288565165", "name": "Shrikrishna S Chippalkatti"}, {"authorId": "2285487668", "name": "Hari Babu Pasupuleti"}, {"authorId": "2276463158", "name": "S. D. Sudarsan"}], "citations": []}
