{"paperId": "0d36a04c360230a88c6cd1fd0366b0335ff3e1d2", "publicationVenue": null, "title": "Network Digital Twins: A Threat Analysis", "abstract": "Digital Twin (DT) technologies are being explored for the development and operations of mobile networks. Extensive use of digital twins – so called massive twinning – is also being proposed, in the EU project Hexa-X, as an important use case family of 6G applications. In this study, we examine security aspects of digital twins, focusing on network-related digital twins by means of a threat analysis. We identify and systematize threats affecting these network digital twin systems by using the STRIDE methodology, discuss the different DT threat surfaces and examine the role of DT specific threat surfaces. We also discuss how networks can be impacted by such threats as well as provide examples of threat impact on salient networking focused DT use case families such as network operations and management, network optimization & modeling, etc. Further, we identify aspects of twin architecture which give rise to DT-specific threats. These include not only the overall increased threat surface due to the detailed system data being exported to the DT, but also the introduction of new communication channels and the synchronization process which play a role. Finally, we briefly outline promising directions to explore for mitigating the identified threats in future network digital twin environments.", "venue": "2023 IEEE International Conference on Communications Workshops (ICC Workshops)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-28", "journal": {"name": "2023 IEEE International Conference on Communications Workshops (ICC Workshops)", "pages": "733-739"}, "authors": [{"authorId": "2261555468", "name": "Arun Raghuramu"}, {"authorId": "2261555724", "name": "Michael Liljenstam"}, {"authorId": "2261555986", "name": "Sonika Ujjwal"}, {"authorId": "2263320", "name": "Utku Gülen"}, {"authorId": "2261556733", "name": "Greg Phillips"}, {"authorId": "52281617", "name": "Z. Laaroussi"}, {"authorId": "1904044692", "name": "Leyli Karaçay"}], "citations": []}
