{"paperId": "0d558136634156da3677d89d7ad9654342334c4d", "publicationVenue": {"id": "7777247e-fef1-4bb2-a34c-442bdcbc9b7b", "name": "IEEE Open Journal of the Computer Society", "type": "journal", "alternate_names": ["IEEE Open J Comput Soc"], "issn": "2644-1268", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782664"}, "title": "Training and Serving System of Foundation Models: A Comprehensive Survey", "abstract": "Foundation models (e.g., ChatGPT, DALL-E, PengCheng Mind, PanGu-$\\Sigma$) have demonstrated extraordinary performance in key technological areas, such as natural language processing and visual recognition, and have become the mainstream trend of artificial general intelligence. This has led more and more major technology giants to dedicate significant human and financial resources to actively develop their foundation model systems, which drives continuous growth of these models' parameters. As a result, the training and serving of these models have posed significant challenges, including substantial computing power, memory consumption, bandwidth demands, etc. Therefore, employing efficient training and serving strategies becomes particularly crucial. Many researchers have actively explored and proposed effective methods. So, a comprehensive survey of them is essential for system developers and researchers. This paper extensively explores the methods employed in training and serving foundation models from various perspectives. It provides a detailed categorization of these state-of-the-art methods, including finer aspects such as network, computing, and storage. Additionally, the paper summarizes the challenges and presents a perspective on the future development direction of foundation model systems. Through comprehensive discussion and analysis, it hopes to provide a solid theoretical basis and practical guidance for future research and applications, promoting continuous innovation and development in foundation model systems.", "venue": "IEEE Open Journal of the Computer Society", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-05", "journal": {"name": "ArXiv", "volume": "abs/2401.02643"}, "authors": [{"authorId": "2278400593", "name": "Jiahang Zhou"}, {"authorId": "2278302700", "name": "Yanyu Chen"}, {"authorId": "89600513", "name": "Zicong Hong"}, {"authorId": "2257370299", "name": "Wuhui Chen"}, {"authorId": "2275689330", "name": "Yue Yu"}, {"authorId": "2253551351", "name": "Tao Zhang"}, {"authorId": "2264393917", "name": "Hui Wang"}, {"authorId": "2258091430", "name": "Chuanfu Zhang"}, {"authorId": "2278391904", "name": "Zibin Zheng"}], "citations": []}
