{"paperId": "0d5d6463f85ec40615f328db726efb39e8d53bc0", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Sports and Health Management Using Big Data Based on Voice Feature Processing and Internet of Things", "abstract": "With the support of big data and information technology, various sectors such as sports, health, and medical industry can realize the integration and readjustment of the existing resources, which improve the operation efficiency of the industry and tap its huge potential. With the advancement in big data analysis, voice features, and Internet of &ings (IoT), personalized health management is becoming the development trend and breakthrough of sports and health industry. &e application of big data will tap out the huge potential of the sports and health industry. In this paper, we have used the Mel-requency cepstrum coefficient as the speech feature processing method. When the linear frequency is transformed to the Mel frequency by Fourier transform, the calculation accuracy will decrease with the increase in the frequency, and the low-frequency signal will be retained to improve the anti-noise ability. With further study of the voice feature processing and IoTmodel of big data’s sports and health management, a vector addition regression was developed to compare the two real scoring features of the processing results that pave the way for further analysis and result evaluation.&rough experimental verification, it is proved that themethod in this paper can better learn the speech features. At the same time, with the introduction of noise reduction, the big data of speech recognition in sports health management has a stronger robustness and improves the overall system performance.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Sci. Program.", "pages": "3271863:1-3271863:10", "volume": "2021"}, "authors": [{"authorId": "2145127030", "name": "Lina Sun"}, {"authorId": "2135609961", "name": "Mingzhi Li"}], "citations": [{"paperId": "0727d035662ad284b11d4b004c3e063068a6f616", "title": "Integrating the Bigdata and Deep Learning Analysis Human Movement to Improve the Sports"}, {"paperId": "6031aea92a633c235139a186ca7c5bb167775ffd", "title": "A study on the optimization of teaching paths of integration of core literacy in physical education and health courses in colleges and universities based on function integral algorithm"}, {"paperId": "1220ea758ded2949310c5178c3751249df7a0b40", "title": "Intelligent speech technologies for transcription, disease diagnosis, and medical equipment interactive control in smart hospitals: A review"}, {"paperId": "63b34c34491ce35ed2a60fc4d439812d13251143", "title": "Model Construction of Using Physiological Signals to Detect Mental Health Status"}, {"paperId": "e07d45fd92682338d870eabe94050cd768ef9840", "title": "Prediction and Evaluation Model of Physical Training for Volleyball Players' Effect Based on Grey Markov Theory"}, {"paperId": "96669f515d0a28be476fec867d4923f5b4247423", "title": "Journal Pre-proof Intelligent speech technologies for transcription, disease diagnosis, and medical equipment interactive control in smart hospitals: A review"}, {"paperId": "8ea9680f1f5263a350d5a473461b2b379b44e914", "title": "Intelligent speech technologies for transcription, disease diagnosis, and medical equipment interactive control in smart hospitals: A review"}]}
