{"paperId": "0d62e5726f02f38578c4a2b53d96e31f0edad98e", "publicationVenue": null, "title": "on Out-of-core", "abstract": ": As emerging technologies develop rapidly, domain software puts forward new requirements for development efficiency. In addition, as a declarative programming language with concise syntax and well-defined semantics, Datalog can help developers solve complex problems rapidly and achieve smooth development and thus has attracted wide attention in recent years. However, when solving real-world problems, the existing single-machine Datalog engines are often limited by the size of memory capacity and possess no scalability. To solve these problems, this study designs and implements a Datalog engine based on out-of-core computing. Firstly, a series of operators supporting out-of-core computing are designed to compute the Datalog program, and then the program is converted into a C++ program with the operators. Next, the study designs a partition strategy based on Hash and a minimum replacement scheduling strategy based on search tree pruning. After that, the corresponding partition files are scheduled and computed to generate the final results. Based on this method, the study establishes the prototype tool DDL (disk-based Datalog engine) and selects widely used real-world Datalog programs to conduct experiments on both synthetic and real-world datasets. The experimental results show that DDL has positive performance and high scalability.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2277908221", "name": "张奕裕"}, {"authorId": "2278011520", "name": "Yi-Yu Zhang"}, {"authorId": "2277995349", "name": "Gui-Hang Wang"}, {"authorId": "2277890452", "name": "Zhi-Qiang Zuo"}, {"authorId": "2277986458", "name": "Xuan-Dong Li"}], "citations": [{"paperId": "494afded46e1e90f1a10860384960ae3ed7ff0f8", "title": "Out-of-Core GPU-Accelerated Causal Structure Learning"}, {"paperId": "94c8d848cd774fe31f4dcaa5155716c573995a22", "title": "ISP: An Optimal Out-of-Core Image-Set Processing Streaming Architecture for Parallel Heterogeneous Systems"}, {"paperId": "70ff8d28c1274551e500b60bdda37fed28cf64d1", "title": "Using PASSION System on LU Factorization"}]}
