{"paperId": "0d63eda389d3a8353850507dd226da0f911581e8", "publicationVenue": {"id": "5ccbcf07-811c-4d9f-953c-8c71ab296d62", "name": "Asia Pacific Workshop on Systems", "type": "conference", "alternate_names": ["Asia Pac Workshop Syst", "APSys", "Asia-Pacific Workshop on Systems", "ApSys", "Asia-pacific Workshop Syst"]}, "title": "xOS: The End Of The Process-Thread Duo Reign", "abstract": "Process and Thread are first-order abstractions of the operating system (OS), whose implementation is wired into the OS core. Several research works have shown the inadequacy of these two main abstractions for modern isolation needs, leading to the introduction of additional abstractions with new isolation and communication features. Despite their usefulness, these new proposals are introduced in a somewhat ad-hoc manner, compromising their broad and consensual adoption. This position paper presents xOS, an OS design that does not introduce yet another first-class isolation abstraction but instead investigates how the OS can help application programmers, libraries, and OS developers integrate and easily use new abstractions. To our knowledge, xOS is the first work in this area. Similar to file system development built around a Virtual File System (VFS), xOS introduces the concept of Isolation Context (IC), which should be the unique first-class abstraction wired into the OS core. ICs can be realized in several pluggable Isolation Context Factories (ICFs) such as ProcessFactory (provides processes), Thread-Factory (provides threads), Docker Engine (provides Docker containers), KVM (provides KVM virtual machines), Wasp (provides virtines), etc. We discuss our plan to redesign a general-purpose OS from these foundations, the required APIs, and how to support new and legacy applications.", "venue": "Asia Pacific Workshop on Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-08-24", "journal": {"name": "Proceedings of the 14th ACM SIGOPS Asia-Pacific Workshop on Systems"}, "authors": [{"authorId": "1865719842", "name": "A. Tchana"}, {"authorId": "9943105", "name": "Dorian Goepp"}, {"authorId": "90620100", "name": "Stella Bitchebe"}, {"authorId": "2098661381", "name": "Renaud Lachaize"}], "citations": []}
