{"paperId": "0d69a06abd3447dd0ae1f5f2710fcada710d984e", "publicationVenue": {"id": "e1882330-de0e-49a0-be92-edc862edc88d", "name": "Internet Research", "type": "journal", "alternate_names": ["Internet Res"], "issn": "1066-2243", "url": "https://www.emerald.com/insight/publication/issn/1066-2243"}, "title": "Cognition or interaction? Mediating factors influencing online group open collaboration", "abstract": "PurposeOnline collaboration in today's world is a topic of genuine interest to Internet researchers. The purpose of this paper is to explore the role of group knowledge heterogeneity (GKH) in open collaboration performance using the mediating mechanisms of group cognition (GC) and interaction to understand the determinants of the success of online open collaboration platforms.Design/methodology/approachStudy findings are based on partial least squares structural equation modeling (PLS-SEM), the formal mediation test and moderating effect analysis from Wikipedia's 160 online open collaborative groups.FindingsFor online knowledge heterogeneous groups, open collaboration performance is mediated by both GC and collaborative interaction (COL). The mediating role of GC is weak, while the mediating role of COL is strengthened when knowledge complexity (KC) is higher. By dividing group interaction into COL and communicative interaction (COM), the authors also observed that COL is effective for online open collaboration, whereas COM is limited.Originality/valueThese findings suggest that for more heterogeneous large groups, group interaction would explain more variance in performance than GC, offering an in-depth understanding of the relationship between group heterogeneity and open collaboration performance, answering what determines the success of online open collaboration platforms as well as explaining the inconsistency in prior findings. In addition, this study expands the application of Interactive Team Cognition (ITC) theory to the online open collaboration context.", "venue": "Internet Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-02", "journal": {"name": "Internet Research"}, "authors": [{"authorId": "150238978", "name": "Min Zuo"}, {"authorId": "2363755", "name": "Jiangnan Qiu"}, {"authorId": "2145276456", "name": "Jingxian Wang"}], "citations": []}
