{"paperId": "0d6bb41b0a642e54370ba2c3248afe158b940024", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "BigBench V2: The New and Improved BigBench", "abstract": "Benchmarking Big Data solutions has been gaining a lot of attention from research and industry. BigBench is one of the most popular benchmarks in this area which was adopted by the TPC as TPCx-BB. BigBench, however, has key shortcomings. The structured component of the data model is the same as the TPC-DS data model which is a complex snowflake-like schema. This is contrary to the simple star schema Big Data models in real life. BigBench also treats the semi-structured web-logs more or less as a structured table. In real life, web-logs are modeled as key-value pairs with unknown schema. Specific keys are captured at query time - a process referred to as late binding. In addition, eleven (out of thirty) of the BigBench queries are TPC-DS queries. These queries are complex SQL applied on the structured part of the data model which again is not typical of Big Data workloads. In this paper1, we present BigBench V2 to address the aforementioned limitations of the original BigBench. BigBench V2 is completely independent of TPC-DS with a new data model and an overhauled workload. The new data model has a simple structured data model. Web-logs are modeled as key-value pairs with a substantial and variable number of keys. BigBench V2 mandates late binding by requiring query processing to be done directly on key-value web-logs rather than a pre-parsed form of it. A new scale factor-based data generator is implemented to produce structured tables, key-value semistructured web-logs, and unstructured data. We implemented and executed BigBench V2 on Hive. Our proof of concept shows the feasibility of BigBench V2 and outlines different ways of implementing late binding.", "venue": "IEEE International Conference on Data Engineering", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-04-01", "journal": {"name": "2017 IEEE 33rd International Conference on Data Engineering (ICDE)", "pages": "1225-1236"}, "authors": [{"authorId": "34374672", "name": "A. Ghazal"}, {"authorId": "29758338", "name": "Todor Ivanov"}, {"authorId": "2627558", "name": "Pekka Kostamaa"}, {"authorId": "2568629", "name": "A. Crolotte"}, {"authorId": "11057233", "name": "R. Voong"}, {"authorId": "1401334793", "name": "Mohammed Al-Kateb"}, {"authorId": "11049603", "name": "W. Ghazal"}, {"authorId": "145723719", "name": "R. Zicari"}], "citations": [{"paperId": "73b054b7b4ca4a1a3d85f7a79ec58b268499c0ab", "title": "Exploring the Cognitive Knowledge Structure of Large Language Models: An Educational Diagnostic Assessment Approach"}, {"paperId": "10632e0a667cbc3c52cc8f11a46d8e8e9c7739e3", "title": "Causal Reasoning and Large Language Models: Opening a New Frontier for Causality"}, {"paperId": "50279d81f3533ac6c24bea8b3a179cb8f8a42c50", "title": "A Comparative Performance Evaluation of Multi-Model NoSQL Databases and Polyglot Persistence"}, {"paperId": "2e238a2a2cab83670158529c351cc4f20b1b4de7", "title": "DLBench+: A benchmark for quantitative and qualitative data lake assessment"}, {"paperId": "054b419d2c22cf6d4bb420b51e2181a7f228f9f2", "title": "Does Big Data Require Complex Systems? A Performance Comparison Between Spark and Unicage Shell Scripts"}, {"paperId": "35310ab905495978c8b90aaeacf96bdc4e475f31", "title": "Situation-Aware IoT Data Generation towards Performance Evaluation of IoT Middleware Platforms"}, {"paperId": "951d86df494801012e83f09b0958384b26d560cc", "title": "M2Bench: A Database Benchmark for Multi-Model Analytic Workloads"}, {"paperId": "4000868e095553bc7985e02c6281de6096728298", "title": "Winograd schemata and other datasets for anaphora resolution in Hungarian"}, {"paperId": "eb695b00d93ecf933c17b263e5a22de9c0c707da", "title": "A Remote Memory Sharing System for Virtualized Computing Infrastructures"}, {"paperId": "d48b29889241551e1ee6622fa78c3fa4159255dd", "title": "Selection-Inference: Exploiting Large Language Models for Interpretable Logical Reasoning"}, {"paperId": "e020d4bbd0d51b31058dca7ce16365ea5a0279de", "title": "Beyond TPC-DS, a benchmark for Big Data OLAP systems (BDOLAP-Bench)"}, {"paperId": "0fc0f1905284d9a9df944da274f06c7b7c5a030f", "title": "Benchmarking Data Lakes Featuring Structured and Unstructured Data with DLBench"}, {"paperId": "453dc0bfce0b72cd70848d0ed4f3ac60683d906f", "title": "Analyzing Performance of Apache Spark MLlib with Multinode Clusters on Azure HDInsight: Spark-Perf Case Study"}, {"paperId": "0ada6415b18264c2e56c10dd50ba215aa9af4f83", "title": "CoreBigBench: Benchmarking big data core operations"}, {"paperId": "f976d17cb4aff953f07392ee3b66617c71d68c5b", "title": "Tutorial on Benchmarking Big Data Analytics Systems"}, {"paperId": "1cd07c8f68a83fb4b0ae16c80d140982bf8c4120", "title": "TextBenDS: a Generic Textual Data Benchmark for Distributed Systems"}, {"paperId": "f2cc8603ca284ae9b49be20e5e9e64399f33c0cd", "title": "The impact of columnar file formats on SQL‐on‐hadoop engine performance: A study on ORC and Parquet"}, {"paperId": "3ca7789ce436ac50dfae256609a8b9682f018ff9", "title": "TPCx-BB (Big Bench) in a Single-Node Environment"}, {"paperId": "b935c695627ec9ad7fcf812e63396794d782f1f3", "title": "When eXtended Para - Virtualization (XPV) Meets NUMA"}, {"paperId": "3060d85dd740a8687b0834449c885d494be34db2", "title": "Big SQL systems: an experimental evaluation"}, {"paperId": "697dc08f14a097d9ff7394731d1ab601b21e732a", "title": "Performance Enhancement and Evaluation of Distributed File System for Cloud"}, {"paperId": "8a1a263d4ddcb1fdb7ed6d868aac3d1d5c648459", "title": "Adding Velocity to BigBench"}, {"paperId": "372a2383891257520ad6dea816d3f14ddff8f003", "title": "Exploratory Analysis of Spark Structured Streaming"}, {"paperId": "78b6b6bbf39dd3e845af483edfc8dd348c52622e", "title": "ABench: Big Data Architecture Stack Benchmark"}, {"paperId": "d822c014d3a32ca0f77968335b915bc3b5318b25", "title": "Sanzu: A data science benchmark"}, {"paperId": "920241246c82176173d442fd43214b2762be6e56", "title": "Elastic Resource Sharing for Distributed Deep Learning"}, {"paperId": "e7f0d92a6e0b44dcb96e202f5edb29c20bed01b6", "title": "Performance Evaluation and Benchmarking for the Era of Cloud(s): 11th TPC Technology Conference, TPCTC 2019, Los Angeles, CA, USA, August 26, 2019, Revised Selected Papers"}, {"paperId": "dbeafc625f41d19367d5e348924804022ce863b3", "title": "Metrics for Big Data Benchmarks"}, {"paperId": "84fad4320fe9cc04ab3e9a9dc83db05e4691dd18", "title": "Classifying, evaluating and advancing big data benchmarks"}]}
