{"paperId": "0d6f0fb63930311809cbcdb0ead34ceb09643f70", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "Computation-Efficient Backscatter-Blessed MEC with User Reciprocity", "abstract": "This letter proposes a new user cooperative offloading protocol called user reciprocity in backscatter communication (BackCom)-aided mobile edge computing systems with efficient computation, whose quintessence is that each user can switch alternately between the active or the BackCom mode in different slots, and one user works in the active mode and the other user works in the BackCom mode in each time slot. In particular, the user in the BackCom mode can always use the signal transmitted by the user in the active mode for more data transmission in a spectrum-sharing manner. To evaluate the proposed protocol, a computation efficiency (CE) maximization-based optimization problem is formulated by jointly power control, time scheduling, reflection coefficient adjustment, and computing frequency allocation, while satisfying various physical constraints on the maximum energy budget, the computing frequency threshold, the minimum computed bits, and harvested energy threshold. To solve this non-convex problem, Dinkelbach's method and quadratic transform are first employed to transform the complex fractional forms into linear ones. Then, an iterative algorithm is designed by decomposing the resulting problem to obtain the suboptimal solution. The closed-form solutions for the transmit power, the RC, and the local computing frequency are provided for more insights. Besides, the analytical performance gain with the reciprocal mode is also derived. Simulation results demonstrate that the proposed scheme outperforms benchmark schemes regarding the CE.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-10", "journal": {"name": "ArXiv", "volume": "abs/2305.06094"}, "authors": [{"authorId": "9175932", "name": "Bowen Gu"}, {"authorId": "2211199", "name": "Hao Xie"}, {"authorId": "2108820076", "name": "Dong Li"}], "citations": [{"paperId": "994a94c60d406b118416120fd708d2d909171ce5", "title": "Breaking the Interference and Fading Gridlock in Backscatter Communications: State-of-the-Art, Design Challenges, and Future Directions"}]}
