{"paperId": "0d81eb8ed061ad5235e6e57c9519bea7d681229f", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "MontObEO, Montesinho biodiversity observatory: an Earth observation tool for biodiversity conservation", "abstract": "The Montesinho Natural Park (MNP) is one of the largest protected areas in Portugal, covering an area of 74,225 hectares in the extreme northeast of the country. MNP hosts a wide range of endemic and highly threatened species and priority habitats such as oak forests, meadows, grasslands, and bushlands. However, human activities continue to pose a significant challenge to conservation. To address this challenge, the MontObEO project aims to implement an early warning system to identify changes in habitat suitability and species extinction risk over time and space in the MNP, using a time series of satellite remote sensing data and ecological niche models (SRS-ENMs). Herein, we compiled biodiversity data for five major taxonomic groups (flora-vascular plants, amphibians, reptiles, birds, and mammals) and yearly remote sensing products from MODIS sensors between 2000 and 2021. We conducted all the satellite data processing and modelling procedures in Google Earth Engine (GEE) platform using the MaxEnt algorithm. We measured trends in species’ habitat suitability with the Mann-Kendall test, a non-parametric test for monotonic trend detection in a time series. Those species with stronger decreasing trends will have higher extinction risks. Additionally, we developed a ready-to-use web geographic information system (Web GIS) to map individual species distributions with a high spatial resolution (1 km). This project provides tools for biodiversity conservation in the MNP to help in the decision-making process for conservation planning and could serve as a model for other national or international protected areas.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2023-10-19", "journal": {"pages": "1273411 - 1273411-11", "volume": "12734"}, "authors": [{"authorId": "2219315843", "name": "Nuno Garcia"}, {"authorId": "2219396902", "name": "João Alírio"}, {"authorId": "2261020094", "name": "Daniel Silva"}, {"authorId": "2260777472", "name": "João Campos"}, {"authorId": "2260724066", "name": "Lia Duarte"}, {"authorId": "1403596026", "name": "Salvador Arenas‐Castro"}, {"authorId": "2756488", "name": "I. Pôças"}, {"authorId": "1898834", "name": "N. Sillero"}, {"authorId": "2260698625", "name": "A. C. Teodoro"}], "citations": []}
