{"paperId": "0d8477f8323523098e6b94f88b5b03eea956d521", "publicationVenue": {"id": "d04c484e-f612-4e01-a2d4-beba8913cea2", "name": "Foresight", "type": "journal", "issn": "1463-6689", "url": "https://www.emerald.com/insight/publication/issn/1463-6689", "alternate_urls": ["http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=fs"]}, "title": "Artificial intelligence and big data: ontological and communicative perspectives in multi-sectoral scenarios of modern businesses", "abstract": "\nPurpose\nThe purpose of this paper is to see how critical and vital artificial intelligence (AI) and big data are in today’s world. Besides this, this paper also seeks to explore qualitative and theoretical perspectives to underscore the importance of AI and big data applications in multi-sectoral scenarios of businesses across the world. Moreover, this paper also aims at working out the scope of ontological communicative perspectives based on AI alongside emphasizing their relevance in business organizations that need to survive and sustain with a view to achieve their strategic goals.\n\n\nDesign/methodology/approach\nThis paper attempts to explore the qualitative perspectives to build a direction for strategic management via addressing the following research questions concerned with assessing the scope of ontological communicative perspectives in AI relevant to business organizations; exploring benefits of big data combined with AI in modern businesses; and underscoring the importance of AI and big data applications in multi-sectoral scenarios of businesses in today’s world. Employing bibliometric analysis along with NVivo software to do sentiment analysis, this paper attempts to develop an understanding of what happens when AI and big data are combined in businesses.\n\n\nFindings\nAI and big data have tremendous bearing on modern businesses. Because big data comprises enormous information of diverse sorts, AI-assisted machines, tools and devices help modern businesses process it quickly, efficiently and meaningfully. Therefore, business leaders and entrepreneurs need to focus heavily on ontological and communicative perspectives to deal with diverse range of challenges and problems particularly in the context of recent crises caused by COVID-19 pandemic.\n\n\nResearch limitations/implications\nThere is hardly any arena of human activity wherein AI and big data are not relevant. The implication of this paper is that of combining both well so that we may find answers to the difficult and challenging multi-sectoral scenarios concerning not just businesses but life at large. Moreover, automated tools based on AI such as natural language processing and speech to text also facilitate meaningful communication at various levels not just in business organizations but other fields of human activities as well.\n\n\nSocial implications\nThis paper has layered social implications, as it conceptually works out as to how strategically we may combine AI and big data to benefit modern business scenarios dealing with service providers, manufacturers, entrepreneurs, business leaders, customers and consumers. All the stakeholders are socio-culturally and contextually rooted/situated, and that is how this study becomes socially relevant.\n\n\nOriginality/value\nThis paper is an original piece of research and has been envisioned in view of the challenging business scenarios across the world today. This paper underscores the importance of strategically combining AI and big data, as they have enormous bearing on modern businesses. The insights arrived at in this paper have implications for business leaders and entrepreneurs across the globe who could focus more on ontological and communicative perspectives of AI combined with Big Data to deal with diverse range of challenges and problems that modern businesses have been facing particularly in recent times.\n", "venue": "Foresight", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-06-28", "journal": {"name": "foresight"}, "authors": [{"authorId": "2092998089", "name": "M. Arora"}, {"authorId": "2110786165", "name": "R. Sharma"}], "citations": [{"paperId": "ff1de9bc01c527bb634e9adfdde1e60bebe52a50", "title": "How foresight has evolved since 1999? Understanding its themes, scope and focus"}, {"paperId": "f4b55d56f9c95efcdbbe0669b632a827ac500733", "title": "Entrepreneurial Performance Management Using Artificial Intelligence and Big Data Analytics"}, {"paperId": "997cca75e13af89c32a6c56cbe900bbb54703a53", "title": "Qualitative Research Methodology in Social Sciences"}, {"paperId": "091135b801adb8d18963c6f10699a5113325b086", "title": "The Analysis of Research Literature on the Role of AI in Industrial Sector"}, {"paperId": "2761e9b4041df7d7b51cda6b7af5581299eedeb0", "title": "Toward a model for assessing smart hospital readiness within the Industry 4.0 paradigm"}, {"paperId": "de04bac62d778fe04959dbfbacdca9be7d06a1d5", "title": "Independent Factors Simulation of the Influence on the Level of Sustainable Development in Intellectual Systems of Management"}]}
