{"paperId": "0d8ff4b9580f72c552313b052be0a63b60175150", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Aggregation and visualization of spatial data with application to classification of land use and land cover", "abstract": "Aggregation and visualization of geographical data are an important part of environmental data mining, environmental modelling, and agricultural management. However, it is difficult to aggregate geospatial data of the various formats, such as maps, census and survey data. This paper presents a framework named PlaniSphere, which can aggregate the various geospatial datasets, and synthesizes raw data. We developed an algorithm in PlaniSphere to aggregate remote sensing images with census data for classification and visualization of land use and land cover (LULC). The results show that the framework is able to classify geospatial data sets of LULC from multiple formats. National census data sets can be used for calibration of remote sensing LULC classifications. This provides a new approach for the classification of remote sensing data. This approach proposed in this paper should be useful for LULC classification in environmental spatial analysis.", "venue": "arXiv.org", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-04-19", "journal": {"name": "ArXiv", "volume": "abs/1704.05860"}, "authors": [{"authorId": "34951503", "name": "Mihal Miu"}, {"authorId": "2108046575", "name": "Xiaokun Zhang"}, {"authorId": "2262017747", "name": "M. Ali"}, {"authorId": "2223862836", "name": "Akber Dewan"}, {"authorId": "1999595710", "name": "Junye Wang"}], "citations": [{"paperId": "3419d207dbe1d9829565df8bd20a753a0b9db310", "title": "Influence of Model Grid Size on the Estimation of Surface Fluxes Using the Two Source Energy Balance Model and sUAS Imagery in Vineyards"}, {"paperId": "15049476e1df0a0252ece19deb211287cb74d30e", "title": "Development of Framework for Aggregation and Visualization of Three-Dimensional (3D) Spatial Data"}, {"paperId": "12e81db5b73891baf7629a70f23cf7e3ec3135d9", "title": "Using RS and GIS to Mapping Land Cover of the Cap Bon (Tunisia)"}]}
