{"paperId": "0d92bb74ff88afc4948e8185dad210ce6f960505", "publicationVenue": {"id": "65e58b80-9699-4da6-bd60-929b57b8533d", "name": "IEEE Transactions on Cognitive Communications and Networking", "type": "journal", "alternate_names": ["IEEE Trans Cogn Commun Netw"], "issn": "2332-7731", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687307", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687307"]}, "title": "Online Training Flow Scheduling for Geo-Distributed Machine Learning Jobs Over Heterogeneous and Dynamic Networks", "abstract": "Geo-Distributed Machine Leaning (Geo-DML) has been a promising technology, which performs collaborative learning across geographically dispersed data centers (DCs) with privacy-preserving over Wide Area Networks (WANs). Unfortunately, the limited and heterogeneous WAN bandwidth poses significant challenges to the performance of Geo-DML systems, leading to increased communication overhead and affecting the revenue of ISPs eventually. In particular, when multiple online jobs coexist in Geo-DML systems, the competition for bandwidth between training flows of different jobs aggravates this negative impact. To alleviate it, this paper investigates the problem of online training flow scheduling for Geo-DML jobs. We first formulate the studied problem as an Linear Programming (LP) model with the objective of maximizing the revenue of ISPs. Then, we propose an online traffic scheduling algorithm called Training Flow Adaptive Steering (TFAS), which exploits a primal-dual framework, tailored for efficient resource allocation of jobs to schedule training flows, such that system resources are maximally utilized and training procedures can be expedited and completed in a timely manner. Meanwhile, we conduct rigorous theoretical analysis to guarantee that the proposed algorithm can achieve a good competitive ratio. Extensive evaluation results demonstrate that our algorithm performs well and outperforms commonly adopted solutions 36.2%-49.4% in average.", "venue": "IEEE Transactions on Cognitive Communications and Networking", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "IEEE Transactions on Cognitive Communications and Networking", "pages": "277-291", "volume": "10"}, "authors": [{"authorId": "2261311203", "name": "Lang Fan"}, {"authorId": "2108030357", "name": "Xiaoning Zhang"}, {"authorId": "2145162223", "name": "Yangmin Zhao"}, {"authorId": "145137505", "name": "Keshav Sood"}, {"authorId": "2238973710", "name": "Shui Yu"}], "citations": []}
