{"paperId": "0dacc2c0f4d7eb6d07522a3ece0676143b7102ca", "publicationVenue": null, "title": "Quantum supremacy with analog quantum processors for material science and machine learning", "abstract": "Quantum supremacy is the ability of quantum processors to outperform classical computers at certain tasks. In digital random quantum circuit approaches for supremacy, the output distribution produced is described by the Porter-Thomas (PT) distribution. In this regime, the system uniformly explores its entire Hilbert space, which makes simulating such quantum dynamics with classical computational resources impossible for large systems. However, the latter has no direct application so far in solving a specific problem. In this work, we show that the same sampling complexity can be achieved from driven analog quantum processors, with less stringent requirements for coherence and control. More importantly, we discuss how to apply this approach to solve problems in quantum simulations of phases of matter and machine learning. Specifically, we consider a simple quantum spin chain with nearest-neighbor interactions driven by a global magnetic field. We show how quantum supremacy is achieved as a consequence of the thermalization due to the interplay between the disorder and the driven many-body dynamics. We analyze how the achieved PT distribution can be used as an accessible reference distribution to probe the many-body localization (MBL) phase transition. In the second part of our work, we show how our setup can be used for generative modeling machine learning tasks. We propose a novel variational hybrid quantum-classical approach, exploiting the system's inherent tunable MBL dynamics, to train the device to learn distributions of complex classical data. The performance of our training protocol depends solely on the phase that the quantum system is in, which makes fine-tuning of local parameters not necessary. The protocol is implementable in a range of driven quantum many-body systems, compatible with noisy intermediate-scale quantum devices.", "venue": "", "year": 2019, "fieldsOfStudy": ["Physics", "Mathematics"], "publicationTypes": null, "publicationDate": "2019-06-10", "journal": {"name": "arXiv: Quantum Physics", "volume": ""}, "authors": [{"authorId": "13210350", "name": "J. Tangpanitanon"}, {"authorId": "148151137", "name": "Supanut Thanasilp"}, {"authorId": "40493737", "name": "M. Lemonde"}, {"authorId": "2863772", "name": "D. Angelakis"}], "citations": [{"paperId": "6e78ee22d285243084d3fe3bb774d7f557098b6e", "title": "Complexity phase transitions in instantaneous quantum polynomial-time circuits"}, {"paperId": "63a0bc32632415b95b782ff9002f2ce8ec2cd2f7", "title": "Signatures of a sampling quantum advantage in driven quantum many-body systems"}, {"paperId": "325df1b7af3bae68b816025ea08b212f6b9b6c69", "title": "Simulating complex quantum networks with time crystals"}, {"paperId": "638e41912f314c74436205aa8d332dca963ab1dc", "title": "Parameterized quantum circuits as machine learning models"}]}
