{"paperId": "0db7b8169cfb48ecddae735ee8a2827db7ea8d48", "publicationVenue": {"id": "1891eed9-7602-4a6f-af64-16086e62fd76", "name": "International Journal of Robotics and Automation Technology", "type": "journal", "alternate_names": ["Int J Robot Autom Technol"], "issn": "2409-9694", "url": "http://www.avantipublishers.com/international-journal-of-robotics-and-automation-technology/"}, "title": "fMRI: A Benediction to Neuroscience", "abstract": "Functional Magnetic Resonance Imaging (fMRI) is a looming technique utilized to study local brain functions in vivo on a large dimensional and temporal resolution. The technique is less expensive and completely noninvasive hence it has swiftly become one of the most preferred choices for brain mapping. It establishes on Magnetic Resonanc e Imaging and helps to identify neural correlations and brain-behavior relationship by detecting the changes in blood flow.fMRI is one of the most frequently used technique in the field of neuroscience which has provided researchers with unparalleled access to the brain in action.\nThe imaging data generated from different neuroimaging techniques (primarily fMRI) is a time series data. A typical fMRI study provides huge volume of noisy data with a complex spatio-temporal correlation configuration. Statistics play a vital stint in apprehending the attributes of the data and gaining appropriate conclusions that can be used and understood by neuroscientists.The data is huge and is characterized by volume, velocity, variety and veracity. These attributes makes it fall under big data further raising the issues of big data analytics.\nUpcoming technologies such as cloud computing, Spark and massive parallel computational methods /algorithms could provide the possible solutions for analysis and mining of data. The review highlights fMRI as a source of Big Neuroimaging data, different databases & repositories where data is available, its role in healthcare, problems in the data analysis and how the present technologies provide possible solutions for data analysis.", "venue": "International Journal of Robotics and Automation Technology", "year": 2018, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2018-08-10", "journal": {"name": "International Journal of Robotics and Automation Technology"}, "authors": [{"authorId": "2200518161", "name": "Vijay Khare"}, {"authorId": "2200523930", "name": "Shaurya Singh"}, {"authorId": "2200518131", "name": "Neha Mehra"}, {"authorId": "2200524219", "name": "Shamim Akhter"}, {"authorId": "2200528977", "name": "Chakresh Kumar Jain"}], "citations": []}
