{"paperId": "0dbccbd94d76d4382b2cc3549495cff37eb8fd6e", "publicationVenue": null, "title": "Enhancing Cluster Quality of Numerical Datasets with Domain Ontology", "abstract": "Ontology-based clustering has gained attention in recent years due to the potential benefits of ontology. Current ontology-based clustering approaches have mainly been applied to reduce the dimensionality of attributes in text document clustering. Reduction in dimensionality of attributes using ontology helps to produce high quality clusters for a dataset. However, ontology-based approaches in clustering numerical datasets have not been gained enough attention. Moreover, some literature mentions that ontology-based clustering can produce either high quality or low-quality clusters from a dataset. Therefore, in this paper we present a clustering approach that is based on domain ontology to reduce the dimensionality of attributes in a numerical dataset using domain ontology and to produce high quality clusters. For every dataset, we produce three datasets using domain ontology. We then cluster these datasets using a genetic algorithm-based clustering technique called GenClust++. The clusters of each dataset are evaluated in terms of Sum of Squared-Error (SSE). We use six numerical datasets to evaluate the performance of our ontology-based approach. The experimental results of our approach indicate that cluster quality gradually improves from lower to the higher levels of a domain ontology.", "venue": "2022 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-18", "journal": {"name": "2022 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE)", "pages": "1-6"}, "authors": [{"authorId": "3054097", "name": "S. Heiyanthuduwage"}, {"authorId": "2116362048", "name": "Md Anisur Rahman"}, {"authorId": "145751187", "name": "M. Islam"}], "citations": []}
