{"paperId": "0dbf1050187105c4bcb5293ea39eef130d2f0536", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Quasi-Identifier Recognition Algorithm for Privacy Preservation of Cloud Data Based on Risk Reidentification", "abstract": "Cloud computing plays an essential role as a source for outsourcing data to perform mining operations or other data processing, especially for data owners who do not have sufficient resources or experience to execute data mining techniques. However, the privacy of outsourced data is a serious concern. Most data owners are using anonymization-based techniques to prevent identity and attribute disclosures to avoid privacy leakage before outsourced data for mining over the cloud. In addition, data collection and dissemination in a resource-limited network such as sensor cloud require efficient methods to reduce privacy leakage. The main issue that caused identity disclosure is quasi-identifier (QID) linking. But most researchers of anonymization methods ignore the identification of proper QIDs. This reduces the validity of the used anonymization methods and may thus lead to a failure of the anonymity process. This paper introduces a new quasi-identifier recognition algorithm that reduces identity disclosure which resulted from QID linking. The proposed algorithm is comprised of two main stages: (1) attribute classification (or QID recognition) and (2) QID dimension identification. The algorithm works based on the reidentification of risk rate for all attributes and the dimension of QIDs where it determines the proper QIDs and their suitable dimensions. The proposed algorithm was tested on a real dataset. The results demonstrated that the proposed algorithm significantly reduces privacy leakage and maintains the data utility compared to recent related algorithms.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "7154705:1-7154705:13", "volume": "2021"}, "authors": [{"authorId": "2065979581", "name": "Huda Osman"}, {"authorId": "38263858", "name": "M. M. Siraj"}, {"authorId": "2272279", "name": "Fuad A. Ghaleb"}, {"authorId": "2689948", "name": "Faisal Saeed"}, {"authorId": "3066841", "name": "Eman H. Alkhammash"}, {"authorId": "3191329", "name": "Mohd Aizaini Maarof"}], "citations": [{"paperId": "c0ffde579f8925f4974e4a1c2f13faf107cffe3f", "title": "Effective privacy preserving in cloud computing using position aware Merkle tree model"}, {"paperId": "20e4fe037fd5a1442bfee003135f682d153e883e", "title": "Quasi‐identifier recognition with echo chamber optimization‐based anonymization for privacy preservation of cloud storage"}, {"paperId": "c3e846a906f2bd7cb1ac39068a4f95e7adc1818b", "title": "Unsupervised Text Deidentification"}, {"paperId": "cc866db8d6a31091338af5071b8335ec086c2267", "title": "Privacy-Preserving Healthcare Data Modeling Based on Sensitivity and Utility"}, {"paperId": "e482d6c8b42d9bc1206a6967231779f732bda581", "title": "Privacy preserving framework using Gaussian mutation based firebug optimization in cloud computing"}, {"paperId": "608394729f4fbb581b122ebbbf88967ea467d99f", "title": "A Comprehensive Analysis of Privacy Protection Techniques Developed for COVID-19 Pandemic"}]}
