{"paperId": "0ddf327c941ee2b6018024c524a0a35f02f4c783", "publicationVenue": null, "title": "On the Adaptation to Concept Drift for CTR Prediction", "abstract": "Click-through rate (CTR) prediction is a crucial task in web search, recommender systems, and online advertisement displaying. In practical application, CTR models often serve with high-speed user-generated data streams, whose underlying distribution rapidly changing over time. The concept drift problem inevitably exists in those streaming data, which can lead to performance degradation due to the timeliness issue. To ensure model freshness, incremental learning has been widely adopted in real-world production systems. However, it is hard for the incremental update to achieve the balance of the CTR models between the adaptability to capture the fast-changing trends and generalization ability to retain common knowledge. In this paper, we propose adaptive mixture of experts (AdaMoE), a new framework to alleviate the concept drift problem by statistical weighting policy in the data stream of CTR prediction. The extensive offline experiments on both benchmark and a real-world industrial dataset, as well as an online A/B testing show that our AdaMoE significantly outperforms all incremental learning frameworks considered.", "venue": "", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2022-04-01", "journal": null, "authors": [{"authorId": "49047213", "name": "Congcong Liu"}, {"authorId": "115621737", "name": "Yuejiang Li"}, {"authorId": "2068745494", "name": "Fei Teng"}, {"authorId": "3086256", "name": "Xiwei Zhao"}, {"authorId": "1949218014", "name": "Changping Peng"}, {"authorId": "2146396439", "name": "Zhangang Lin"}, {"authorId": "22528137", "name": "Jinghe Hu"}, {"authorId": "2118926502", "name": "Jingping Shao"}], "citations": [{"paperId": "c15569a0b6136374ec6a1a99caaca2350abe3011", "title": "Temporal Importance Factor for Loss Functions for CTR Prediction"}]}
