{"paperId": "0de2f7c29a53ae19f5a6bc6b8a898fc770cb6e8f", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "ReGraph: Scaling Graph Processing on HBM-enabled FPGAs with Heterogeneous Pipelines", "abstract": "The use of FPGAs for efficient graph processing has attracted significant interest. Recent memory subsystem upgrades including the introduction of HBM in FPGAs promise to further alleviate memory bottlenecks. However, modern multi-channel HBM requires much more processing pipelines to fully utilize its bandwidth potential. Due to insufficient resource efficiency, existing designs do not scale well, resulting in underutilization of the HBM facilities even when all other resources are fully consumed. In this paper, we propose ReGraph1, which customizes heterogeneous pipelines for diverse workloads in graph processing, achieving better resource efficiency, instantiating more pipelines and improving performance. We first identify workload diversity exists in processing graph partitions and classify them into two types: dense partitions established with good locality and sparse partitions with poor locality. Subsequently, we design two types of pipelines: Little pipelines with burst memory access technique to process dense partitions and Big pipelines tolerating random memory access latency to handle sparse partitions. Unlike existing monolithic pipeline designs, our heterogeneous pipelines are tailored for more specific workload characteristics and hence more lightweight, allowing the architecture to scale up more effectively with limited resources. We also present a graph-aware task scheduling method that schedules partitions to the right pipeline types, generates the most efficient pipeline combination and balances workloads. ReGraph surpasses state-of-the-art FPGA accelerators by 1.6×–5.9× in performance and 2.5×–12.3× in resource efficiency.", "venue": "Micro", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-05", "journal": {"name": "2022 55th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "1342-1358"}, "authors": [{"authorId": "2109081099", "name": "Xinyu Chen"}, {"authorId": "2118360318", "name": "Yao Chen"}, {"authorId": "2057583676", "name": "Feng Cheng"}, {"authorId": "1703011692", "name": "Hongshi Tan"}, {"authorId": "2082464122", "name": "Bingsheng He"}, {"authorId": "3339059", "name": "W. Wong"}], "citations": [{"paperId": "69ee8f1f98da4847b3d7ffc9f04a68492873588b", "title": "Enhancing Graph Random Walk Acceleration via Efficient Dataflow and Hybrid Memory Architecture"}, {"paperId": "2318bdeea310b1ea524fa483f9276c4f3ef6c88f", "title": "GraphSet: High Performance Graph Mining through Equivalent Set Transformations"}, {"paperId": "a7712aae416914a31046e748027edf307be3ee45", "title": "Simultaneous and Heterogenous Multithreading"}, {"paperId": "0bfdc7914e6a3a16ebcfe8e071da9d07e5f40cd7", "title": "Graph-OPU: A Highly Integrated FPGA-Based Overlay Processor for Graph Neural Networks"}, {"paperId": "bcb1eeb0752d81c82f3aafd6dc2b8e94d0052fed", "title": "BitColor: Accelerating Large-Scale Graph Coloring on FPGA with Parallel Bit-Wise Engines"}, {"paperId": "a818c337a115d9b19da6a582d6cfc55310a8805e", "title": "SaGraph: A Similarity-aware Hardware Accelerator for Temporal Graph Processing"}, {"paperId": "ecf3f48ca04bfcec3b74f772edab46770732da28", "title": "Modular and Lean Architecture with Elasticity for Sparse Matrix Vector Multiplication on FPGAs"}, {"paperId": "b9592ce44aa3268882572c86d740b3d5450ba7b5", "title": "LL-GNN: Low Latency Graph Neural Networks on FPGAs for High Energy Physics"}, {"paperId": "8cb6dd51a76bc706f5574869bff351340f5fec1b", "title": "LL-GNN: Low Latency Graph Neural Networks on FPGAs for Particle Detectors"}]}
