{"paperId": "0de97f7bd482b670aa7fd6af4de327f030ef1975", "publicationVenue": null, "title": "Analysis of Educational Recommender System Techniques for Enhancing Student's Learning Outcomes", "abstract": "Recommender System was widely used in commercial websites for the past few years. These systems track past activities of customers and recommend them the relevant items. The emergence of E-learning activities over a few decades develops a variety of E-learning content available for virtual learning environments (VLE). A large amount of learning objects is present in E-learning repositories. Dealing with problems of the diversity of data, Educational Recommender System (ERS) plays a vital role in the educational sector. Educational recommender systems track the learners' past activities, know the users' preferences, assist the educators and learners, provide relevant content to learners, and enhance their learning outcomes. A personalized recommender system will intensify the learners' interest in particular content and reduce the course dropout rate. The recommender system makes the decision-making process for choosing the appropriate content easy for learners. ERS uses various approaches and technologies for assisting the learners' and helps them to run their learning process smoothly. Collaborative filtering, Content-based, and knowledge-based are the basic techniques of recommender systems. The research shows that a combination of these approaches will give more effective and efficient results. This mixing of approaches refers to the hybridization techniques. Traditional approaches with deep learning networks will improve the recommendations and provide results with higher accuracy. This paper provides how E-learning support recommender systems produce recommendations using different techniques. The technical results of recommender techniques help to find the best approach for making a recommender system in the future.", "venue": "2023 3rd International Conference on Innovative Practices in Technology and Management (ICIPTM)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-22", "journal": {"name": "2023 3rd International Conference on Innovative Practices in Technology and Management (ICIPTM)", "pages": "1-5"}, "authors": [{"authorId": "1573119789", "name": "Neeti Pal"}, {"authorId": "81409977", "name": "Omdev Dahiya"}], "citations": []}
