{"paperId": "0de90b5716c1c88d38fbf05c66037eff6c40ac31", "publicationVenue": null, "title": "A Critical Review of Multimodal-multisensor Analytics for Anxiety Assessment", "abstract": "Recently, interest has grown in the assessment of anxiety that leverages human physiological and behavioral data to address the drawbacks of current subjective clinical assessments. Complex experiences of anxiety vary on multiple characteristics, including triggers, responses, duration and severity, and impact differently on the risk of anxiety disorders. This article reviews the past decade of studies that objectively analyzed various anxiety characteristics related to five common anxiety disorders in adults utilizing features of cardiac, electrodermal, blood pressure, respiratory, vocal, posture, movement, and eye metrics. Its originality lies in the synthesis and interpretation of consistently discovered heterogeneous predictors of anxiety and multimodal-multisensor analytics based on them. We reveal that few anxiety characteristics have been evaluated using multimodal-multisensor metrics, and many of the identified predictive features are confounded. As such, objective anxiety assessments are not yet complete or precise. That said, few multimodal-multisensor systems evaluated indicate an approximately 11.73% performance gain compared to unimodal systems, highlighting a promising powerful tool. We suggest six high-priority future directions to address the current gaps and limitations in infrastructure, basic knowledge, and application areas. Action in these directions will expedite the discovery of rich, accurate, continuous, and objective assessments and their use in impactful end-user applications.", "venue": "ACM Trans. Comput. Heal.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-08-17", "journal": {"name": "ACM Transactions on Computing for Healthcare", "pages": "1 - 42", "volume": "3"}, "authors": [{"authorId": "40894841", "name": "Hashini Senaratne"}, {"authorId": "2807460", "name": "S. Oviatt"}, {"authorId": "1741854468", "name": "K. Ellis"}, {"authorId": "2072162904", "name": "Glenn Melvin"}], "citations": [{"paperId": "e0b25a06a95876eeab5d125e760d40ec418911aa", "title": "Automated anxiety detection using probabilistic binary pattern with ECG signals"}, {"paperId": "9c6fc5042714db724ba001e8eefbd106162da21f", "title": "Personalized virtual reality exposure for panic disorder and agoraphobia: A preliminary neurophysiological study."}, {"paperId": "31c3743e9fd4fa501a3e9e883b54b8777af2c4de", "title": "Detecting Social Contexts from Mobile Sensing Indicators in Virtual Interactions with Socially Anxious Individuals"}, {"paperId": "3ff22f5107cecbf50139f868930785c5d43cac6c", "title": "Deep Modelling Strategies for Human Confidence Classification using Audio-visual Data"}, {"paperId": "00247f9a3ec12e0f211b83eff68c4a600bbdf33e", "title": "Exploring Earables to Monitor Temporal Lack of Focus during Online Meetings to Identify Onset of Neurological Disorders"}]}
