{"paperId": "0ded846831f881faa4632fb51de7811d4ffb45a5", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Sound Localization for Ad-Hoc Microphone Arrays", "abstract": "Sound localization is a field of signal processing that deals with identifying the origin of a detected sound signal. This involves determining the direction and distance of the source of the sound. Some useful applications of this phenomenon exists in speech enhancement, communication, radars and in the medical field as well. The experimental arrangement requires the use of microphone arrays which record the sound signal. Some methods involve using ad-hoc arrays of microphones because of their demonstrated advantages over other arrays. In this research project, the existing sound localization methods have been explored to analyze the advantages and disadvantages of each method. A novel sound localization routine has been formulated which uses both the direction of arrival (DOA) of the sound signal along with the location estimation in three-dimensional space to precisely locate a sound source. The experimental arrangement consists of four microphones and a single sound source. Previously, sound source has been localized using six or more microphones. The precision of sound localization has been demonstrated to increase with the use of more microphones. In this research, however, we minimized the use of microphones to reduce the complexity of the algorithm and the computation time as well. The method results in novelty in the field of sound source localization by using less resources and providing results that are at par with the more complex methods requiring more microphones and additional tools to locate the sound source. The average accuracy of the system is found to be 96.77% with an error factor of 3.8%.", "venue": "Energies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-10", "journal": {"name": "Energies"}, "authors": [{"authorId": "2120492598", "name": "Muhammad Usman Liaquat"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2148759458", "name": "Amna Rahman"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "2148fc0776426853161d986b50ac0c75696abb72", "title": "A Survey of Sound Source Localization and Detection Methods and Their Applications"}, {"paperId": "5d75e94a3f0d4a25b04f9e8616f5bd0d8eb9753c", "title": "A 2D-DOA Sparse Estimation Method with Total Variation Regularization for Spatially Extended Sources"}, {"paperId": "49b5179d22d9a13d49a02417646872f9335aaf45", "title": "Stochastic Computing Design and Implementation of a Sound Source Localization System"}, {"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "title": "Crack Detection in Concrete Structures Using Deep Learning"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "4134d6bbc5655c00b61f0fed5e4bad834a9715f0", "title": "3D Multiple Sound Source Localization by Proposed T-Shaped Circular Distributed Microphone Arrays in Combination with GEVD and Adaptive GCC-PHAT/ML Algorithms"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "f497d84a0bcb2322bdec006fef4c9ae25c02c03c", "title": "Localization of Sound Sources: A Systematic Review"}, {"paperId": "5a2b32f9afd4c88056a9f6f3aabbb22d451a4e3a", "title": "Binaural Sound Source Distance Estimation and Localization for a Moving Listener"}, {"paperId": "76b31e8f8170f9ad2d7dbea8a402130f21dccd77", "title": "Towards a quieter neonatal intensive care unit: evaluating and visualizing soundscapes to raise awareness on sound-producing events"}]}
