{"paperId": "0df2005794dfc523db458109b1075b4a591f05fe", "publicationVenue": null, "title": "Non-landslide sampling and ensemble learning techniques to improve landslide 1 susceptibility mapping", "abstract": ": In recent years, several catastrophic landslide events have been observed throughout the globe, 14 significantly affecting the loss of lives, infrastructure, everyday life and livelihood. To minimize the impact 15 of landslides and issue early warnings, landslide susceptibility maps (LSM) are essential. Aim to improve the 16 accuracy of LSM, this study applied a random selection of non-landslide samples and low accuracy of 17 individual classifiers using machine learning (ML) techniques, coupled with ensemble learning and ML, for 18 LSM. China's Zigui-Badong section of the Three Gorges Reservoir area (TGRA) was considered a case study. 19 Twelve influencing factors were selected as inputs for modelling, and the relationship between each causal 20 factor and landslide spatial development was quantitatively analyzed. A total of 179 landslides were identified 21 in the present study. About 70% of the landslide pixels were randomly considered for training, and the 22 remaining 30% were used for validation. The Logistic Regression model (LR) was applied to produce an 23 initial susceptibility map, and the non-landslide samples were selected within the classified low-susceptibility 24 area. Subsequently, two ML classifiers – the Classification and Regression Tree (CART), and the Multi-Layer 25 Perceptron (MLP), and four coupling models – the CART-Bagging, CART-Boosting, MLP-Bagging, and 26 MLP-Boosting, were utilized for LSM. Finally, the receiver operating characteristics (ROC) curve and 27 statistical analysis were applied for accuracy assessment. The results show that elevation and distance to 28 rivers were the main causal factors of landslide development in the study area. The modeling accuracy of 29 LR-MLP was calculated approx. 0.901, which is higher than the LR-CART (0.889). The LR-MLP-Boosting 30 performed the best with an accuracy of 0.986 followed by the LR-CART-Bagging (0.973), LR-CART- 31 Boosting (0.981), and LR-MLP-Bagging (0.978). The accuracy has been improved compared with the NO- 32", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1664854146", "name": "Chao Zhou"}, {"authorId": "2144334776", "name": "Yue Wang"}, {"authorId": "31291183", "name": "Ying Cao"}, {"authorId": "2188819970", "name": "R. P. Singhc"}, {"authorId": "3198403", "name": "B. Ahmed"}, {"authorId": "2537282", "name": "M. Motagh"}, {"authorId": "2153675785", "name": "Yang Wang"}, {"authorId": "71063113", "name": "Lingjiang Chen"}], "citations": []}
