{"paperId": "0dfe26c844b9a6a0099d54a4dfd8be5c062713d1", "publicationVenue": {"id": "f8e385ef-b52f-4337-ab3b-e09080aec353", "name": "International Conference on Edge Computing [Services Society]", "type": "conference", "alternate_names": ["Int Conf Edge Comput [services Soc", "EDGE", "At the edge", "edge", "Edge"], "issn": "1923-4996", "alternate_issns": ["0225-7181"], "url": "https://journals.library.mun.ca/ojs/index.php/ate", "alternate_urls": ["https://journals.library.mun.ca/ojs/index.php/ate/index"]}, "title": "Edge Federation: A Dependency-Aware Multi-Task Dispatching and Co-location in Federated Edge Container-Instances", "abstract": "Existing research on Edge Computing has proposed several edge deployment types, such as unmanned aerial vehicles (UAV)-enabled edge computing, telecommunication base stations endowed with edge clusters, fog nodes, cloudlets, etc. However, none of them consider the ability of keeping edge resources running across various edge deployments in a single pool, such that these resources can be holistically managed and controlled from a single federated plane, also eliminate vendor lock-in situations. Moreover, these schemes assume each server can only execute one task or job at any time. They do not consider lightweight tools that can wrap, isolate and co-locate multiple tasks in a virtualized server. As such, they can easily result in fragmentation and over-allocation of resources. Furthermore, as modern applications are becoming more complex, relatively few research considers the different characteristics of tasks, like the class, constraints and dependencies. This research aims to address these limitations, extend the state-of-the-art by providing an intelligent resource scheduling and optimization solutions for high performance in a federated edge computing system, considering both task dependencies and heterogeneous resource demands at the same time. Extensive simulations on real-world data-trace from the recent Alibaba cluster trace, with information on task dependencies and resource demands, show the effectiveness, faster executions, and resource efficiency of our approach.", "venue": "International Conference on Edge Computing [Services Society]", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE International Conference on Edge Computing (EDGE)", "pages": "91-98"}, "authors": [{"authorId": "2949956", "name": "Uchechukwu Awada"}, {"authorId": "30392575", "name": "Jiankang Zhang"}], "citations": [{"paperId": "3d2aa8bbf27f02dd3bc7800c1fb4d039c0737b07", "title": "Meeting the Requirements of Internet of Things: The Promise of Edge Computing"}, {"paperId": "ab225e43a37739c38cec68d7d7b329bee0ff8db0", "title": "A Containerized Cloud Computing Environments with Heterogeneous Task Co-Location"}, {"paperId": "4e3fd69fdddc6b0b7438e4f8f4d2e3bc790cd407", "title": "A Trajectory Prediction-Based and Dependency-Aware Container Migration for Mobile Edge Computing"}, {"paperId": "69fe63781479a70ccd52d5f5680d2a51206aba33", "title": "Resource-aware multi-task offloading and dependency-aware scheduling for integrated edge-enabled IoV"}, {"paperId": "2f229065e7dcb15225caf4ebd0b7ee0733364605", "title": "A game-based approach for cloudlet resource pricing for cloudlet federation"}, {"paperId": "dbad5700ae29a7edda960dba32df92a144a74948", "title": "Edgedrones: Co-Scheduling of Drones for Multi-Location Aerial Computing Missions"}, {"paperId": "42bb26ba43900eb5f9a18e64ddde4cd5c3d10d16", "title": "Standardization Initiatives and Market Approaches in Edge Federation"}, {"paperId": "487b7f666e76e5101cb3283c85d37e44015a57c0", "title": "Cost-aware resource management based on market pricing mechanisms in edge federation environments"}, {"paperId": "fc3eb9cd942a3459ddf5bf962743b8e3482185f0", "title": "A Storage Resource Collaboration Model Among Edge Nodes in Edge Federation Service"}, {"paperId": "4beb82d89cb31428cdd2a5d7455493e70664c1f3", "title": "Air-to-Air Collaborative Learning: A Multi-Task Orchestration in Federated Aerial Computing"}, {"paperId": "7dd8d03bf04ac31182e894a402eaa8b4d8424b2e", "title": "FASDQ: Fault-Tolerant Adaptive Scheduling with Dynamic QoS-Awareness in Edge Containers for Delay-Sensitive Tasks"}, {"paperId": "b941ee5d061615354d6bfbda60da4066f4361dd4", "title": "Resource Pricing Model Based on Two-Level Auction for the Cloudlet Federation"}, {"paperId": "3037c510cf8ffc2ee630fb9fd1aa948061671470", "title": "Edge-AI: IoT Request Service Provisioning in Federated Edge Computing Using Actor-Critic Reinforcement Learning"}, {"paperId": "ab385b5a776d9be070fce4ac97a1b117c5cfa776", "title": "AirEdge: A Dependency-Aware Multi-Task Orchestration in Federated Aerial Computing"}]}
