{"paperId": "0dff531d86f95b9edca7c96a7da678510ef84771", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Post-Flood Risk Management and Resilience Building Practices: A Case Study", "abstract": "The study was conducted to assess the post 2010 flood risk management and resilience-building practices in District Layyah, Pakistan. Exploratory research was applied to gain knowledge of flood risk management to embed the disaster risk reduction, mitigation, and adaptation strategies at the local government and community level. Around 200 questionnaires were collected from the four devastated areas/union councils. Primary data from the field uncovered flood risk management practices by organizations, local government, and the community. It highlights resilience-building practices undertaken by the community through rehabilitation, community participation, and local indigenous practices. The role of the District Layyah’s local government and organizations to mitigate the 2010 flood and their contribution towards flood resilience in affected communities was investigated, as no comparable studies were carried out in the riverine belt of District Layyah previously. Moreover, the tangible and non-tangible measures to lessen the vulnerability to floods and improve flood risk governance at a local level were identified. This study makes a valuable contribution in strengthening the resilience building of vulnerable communities by recommending few changes in existing practices concerning flood risk at a local level.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-05-24", "journal": {"name": "Applied Sciences", "pages": "4823", "volume": "11"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "2120939541", "name": "Numera Anum"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "82199286", "name": "M. A. Parvez Mahmud"}], "citations": [{"paperId": "9b3389ec02a1f0553b4e0fdf343c5ea359800660", "title": "Community-Based Flood Risk Management: Empowering Local Responses: A Case Study in Meru, Klang"}, {"paperId": "1abfda42cfc266b02f2a6aa29445022f5844848d", "title": "Co-evolution of human and hydrological system: Presenting a socio-hydrological approach to flood adaptation in Kalat city, Iran"}, {"paperId": "6cf69866bb145169af84ba09d15be199beda3735", "title": "Flood vulnerability assessment of Thailand's flood-prone Pathum Thani province and vulnerability mitigation strategies."}, {"paperId": "a9dfc8c12332dc73418e04ccf329be80d43a02f3", "title": "Eliciting social themes of flood mitigation and community engagement studies through text mining"}, {"paperId": "ad42e7335d9754be061ba12c0921147034f26606", "title": "Dampak Sosial Ekonomi Bencana Banjir dan Pemetaannya Berbasis Sistem Informasi Geografis (SIG)"}, {"paperId": "b1cdeebbf0b0c76ca4bf2e91321820f8f740853c", "title": "Differentiating between urban flood risk as a unitary problem and as a strand in a braided problem set: Implications for administrative coordination"}, {"paperId": "31d8de8aeed7b82e3fab242c7b22d4725c5f4a4c", "title": "A disaster-damage-based framework for assessing urban resilience to intense rainfall-induced flooding"}, {"paperId": "212ece82b3d5b0cecc9e5b8f192a7a0ff9f7bd2d", "title": "Gray Measure and Spatial Distribution Exploration of Local Emergency Resilience on Compound Disasters"}, {"paperId": "2fa42c2113c081f3e9a52dace4cb6d2c9dca5f7d", "title": "Assessing Institutional Stakeholders’ Perception and Limitations on Coping Strategies in Flooding Risk Management in West Africa"}, {"paperId": "43a490b0a04706e3c7fe409bd4a038442c3eec8f", "title": "Disaster-Resilient Communities on Flood Plains and Their Agricultural Regeneration: A Case Study in Meinong Plain, Taiwan"}, {"paperId": "5add9d6054995a296d002d8e64f8a7de00031d8a", "title": "Investigating the Impact of Spatial Distribution of Sustainable Drainage System (SuDS) Components on Their Flood Mitigation Performance in Communities with High Groundwater Levels"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "de32c29aa83312de76a5148ebd90536e24f78492", "title": "Disruptive technologies as a solution for disaster risk management: A review."}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "a4d9b5caf8cc25e82e447aa9942bdfcaa472541f", "title": "Flood Disaster Mitigation Using the HEC-RAS Application to Determine River Water Levels in the Old City Area of Jakarta"}, {"paperId": "d57d21856bf6cb1a056cc01921d7f74e0ac13c87", "title": "A Gabor Filter-Based Protocol for Automated Image-Based Building Detection"}, {"paperId": "f497d84a0bcb2322bdec006fef4c9ae25c02c03c", "title": "Localization of Sound Sources: A Systematic Review"}, {"paperId": "0ded846831f881faa4632fb51de7811d4ffb45a5", "title": "Sound Localization for Ad-Hoc Microphone Arrays"}]}
