{"paperId": "0e0cc0ccec71a21788fee39e5c2756df50fb8a21", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Efficient Datalog Rewriting for Query Answering in TGD Ontologies", "abstract": "Tuple-generating dependencies (TGDs) are an expressive constraint language for ontology-mediated query answering and thus query answering is of high complexity. Existing systems based on first-order rewriting methods can lead to queries too large for DBMS to handle. It is shown that Datalog rewriting can result in more compact queries, yet previously proposed Datalog rewriting methods are mostly inefficient for implementation. In this paper, we fill the gap by proposing an efficient Datalog rewriting approach for answering conjunctive queries over TGDs, and identify and combine existing fragments of TGDs for which our rewriting method terminates. We implemented a prototype system Drewer, and experiments show that it is able to handle a wide range of benchmarks in the literature. Moreover, Drewer shows superior performance over state-of-the-art systems on both the compactness of rewriting and the efficiency of query answering.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "2515-2528", "volume": "35"}, "authors": [{"authorId": "2108194581", "name": "Zhe Wang"}, {"authorId": "2069589306", "name": "Peng Xiao"}, {"authorId": "34241570", "name": "Kewen Wang"}, {"authorId": "35719930", "name": "Zhiqiang Zhuang"}, {"authorId": "2052564277", "name": "Hai Wan"}], "citations": [{"paperId": "2ade956ba328e55c610e4dc9374eacfeb3908d19", "title": "RDFS(c) Schema Inconsistency Checking Based on a Key Instance and Its Query Rewriting"}, {"paperId": "d621a29972b5e9c31384cca5eaf28c80b42b2389", "title": "A DBpedia-based Benchmark for Ontology-mediated Query Answering"}]}
