{"paperId": "0e11c37fb54a66d6bcc4644982232c6ba2c35e0c", "publicationVenue": {"id": "b2033dc0-3539-44a5-a2f1-54fa1a52c1b4", "name": "Problems and Perspectives in Management", "type": "journal", "alternate_names": ["Probl Perspect Manag", "Probl perspect manag", "Problems and perspectives in management"], "issn": "1727-7051", "url": "http://businessperspectives.org/component/option,com_journals/task,journal/id,3/Itemid,74/", "alternate_urls": ["https://businessperspectives.org/journals/problems-and-perspectives-in-management?category_id=30", "https://businessperspectives.org/journals/problems-and-perspectives-in-management"]}, "title": "Knowledge management overview of feature selection problem in high-dimensional financial data: cooperative co-evolution and MapReduce perspectives", "abstract": "The term “big data” characterizes the massive amounts of data generation by the advanced technologies in different domains using 4Vs – volume, velocity, variety, and veracity - to indicate the amount of data that can only be processed via computationally intensive analysis, the speed of their creation, the different types of data, and their accuracy. High-dimensional financial data, such as time-series and space-time data, contain a large number of features (variables) while having a small number of samples, which are used to measure various real-time business situations for financial organizations. Such datasets are normally noisy, and complex correlations may exist between their features, and many domains, including financial, lack the al analytic tools to mine the data for knowledge discovery because of the high-dimensionality. Feature selection is an optimization problem to find a minimal subset of relevant features that maximizes the classification accuracy and reduces the computations. Traditional statistical-based feature selection approaches are not adequate to deal with the curse of dimensionality associated with big data. Cooperative co-evolution, a meta-heuristic algorithm and a divide-and-conquer approach, decomposes high-dimensional problems into smaller sub-problems. Further, MapReduce, a programming model, offers a ready-to-use distributed, scalable, and fault-tolerant infrastructure for parallelizing the developed algorithm. This article presents a knowledge management overview of evolutionary feature selection approaches, state-of-the-art cooperative co-evolution and MapReduce-based feature selection techniques, and future research directions.", "venue": "Problems and Perspectives in Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-12-26", "journal": {"name": "Problems and Perspectives in Management"}, "authors": [{"authorId": "2244205857", "name": "A.N.M. Bazlur Rashid"}, {"authorId": "31240836", "name": "T. Choudhury"}], "citations": [{"paperId": "dfc6f661b96708c1a1df20bea11a35f89d40ed48", "title": "Feature Reduction in Classification Tasks using Bio-inspired Optimization Algorithms"}, {"paperId": "d8e3c4a5b1a772201c1d51073701e52e35d821f5", "title": "Classification of Mobile Phone Price Dataset Using Machine Learning Algorithms"}, {"paperId": "1c20c46058c0a370032e3a5c4294d6f70d518de6", "title": "Anomaly Detection in Cybersecurity Datasets via Cooperative Co-evolution-based Feature Selection"}, {"paperId": "4902be9ffb0746502a241d26e54488eba5d7bc81", "title": "Infrequent Pattern Detection for Reliable Network Traffic Analysis Using Robust Evolutionary Computation"}, {"paperId": "3fee653c86ef4e0bac47f4a9f7c2b5ea8d1bdb95", "title": "Cooperative co-evolution for feature selection in Big Data with random feature grouping"}, {"paperId": "efc4bfdb0880fc46fdbbe7a624b6da3779cf71d6", "title": "A Local Feature Engineering Strategy to Improve Network Anomaly Detection"}, {"paperId": "2cbf3decdffdf7936c5b804bc5a36025ca7c1d8c", "title": "A Novel Penalty-Based Wrapper Objective Function for Feature Selection in Big Data Using Cooperative Co-Evolution"}, {"paperId": "0b4f206067860f5578318bb6815a241bc76c79ae", "title": "Framework of Data Analytics and Integrating Knowledge Management"}]}
