{"paperId": "0e28b14f57d90fd320909bb3add1ad05cd57d745", "publicationVenue": {"id": "1ee52b4c-8c57-4d60-aead-d9ef4255f1e9", "name": "IEEE Transactions on Automation Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Autom Sci Eng"], "issn": "1545-5955", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8856"}, "title": "A Resource Recommendation Model for Heterogeneous Workloads in Fog-Based Smart Factory Environment", "abstract": "The wide deployment of advanced robots with industrial IoT (IIoT) technologies in smart factories generates a large volume of data during production and a wide variety of data processing workloads are launched to maintain productivity and safety of smart manufacture. The emerging fog computing paradigm offers a promising solution to enhancing data processing performance in a smart factory environment while on the other hand brings in new challenges to resource management, which call for a more effective approach for recommending resource configurations to heterogeneous workloads. In this paper, we propose an Optimized Recommendations of Heterogeneous Resource Configurations (ORHRC) model that employs machine learning techniques to provide resource configuration recommendations for the heterogeneous workloads in a fog computing-based smart factory environment. ORHRC learns a recommendation model by leveraging the operating characteristics and execution time of workloads on fog servers with different configurations. We also design a decision model in ORHRC to further improve prediction accuracy and reduce operational overheads. Experiment results show that ORHRC outperforms the state of art configuration recommendation methods in terms of average prediction accuracy. Note to Practitioners—The various data processing workloads in a smart factory environment need to be processed by the computational resources with optimal configurations for meeting their performance requirements. In this paper, we employ machine learning technologies for enabling automatic recommendation of resource configurations to heterogeneous workloads. Specifically, we develop an Optimized Recommendations of Heterogeneous Resource Configurations (ORHRC) model that can identify the optimal resource configurations for various workloads. We also conducted extensive experiments that verify the effectiveness of the proposed ORHRC model.", "venue": "IEEE Transactions on Automation Science and Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "IEEE Transactions on Automation Science and Engineering", "pages": "1731-1743", "volume": "19"}, "authors": [{"authorId": "2145147084", "name": "Lulu Chen"}, {"authorId": "145659102", "name": "Zhihui Lu"}, {"authorId": "2064375064", "name": "Ai Xiao"}, {"authorId": "144318006", "name": "Q. Duan"}, {"authorId": "1741488268", "name": "Jie Wu"}, {"authorId": "1707003", "name": "P. Hung"}], "citations": [{"paperId": "915466578e856a9c670e775cb983bd3fd9d6aa0a", "title": "Enabling edge-driven Dataspace integration through convergence of distributed technologies"}, {"paperId": "efb10d6edbb14e5b68aa316eb3ff65b21d58ee06", "title": "Intelligent initial model and case design analysis of smart factory for shipyard in China"}, {"paperId": "482a624ca0b186c9581b0b9a4425bb38e1816476", "title": "How to Share: Balancing Layer and Chain Sharing in Industrial Microservice Deployment"}]}
