{"paperId": "0e2c3c2ccd95f148917164dc69c0c338332fc0bc", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Enhancing Urban Data Analysis: Leveraging Graph-Based Convolutional Neural Networks for a Visual Semantic Decision Support System", "abstract": "The persistent increase in the magnitude of urban data, combined with the broad range of sensors from which it derives in modern urban environments, poses issues including data integration, visualization, and optimal utilization. The successful selection of suitable locations for predetermined commercial activities and public utility services or the reuse of existing infrastructure arise as urban planning challenges to be addressed with the aid of the aforementioned data. In our previous work, we have integrated a multitude of publicly available real-world urban data in a visual semantic decision support environment, encompassing map-based data visualization with a visual query interface, while employing and comparing several classifiers for the selection of appropriate locations for establishing parking facilities. In the current work, we challenge the best representative of the previous approach, i.e., random forests, with convolutional neural networks (CNNs) in combination with a graph-based representation of the urban input data, relying on the same dataset to ensure comparability of the results. This approach has been inspired by the inherent visual nature of urban data and the increased capability of CNNs to classify image-based data. The experimental results reveal an improvement in several performance indices, implying a promising potential for this specific combination in decision support for urban planning problems.", "venue": "Italian National Conference on Sensors", "year": 2024, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "24"}, "authors": [{"authorId": "2425567", "name": "N. Sideris"}, {"authorId": "2284178", "name": "Georgios Bardis"}, {"authorId": "2594647", "name": "A. Voulodimos"}, {"authorId": "1721964", "name": "G. Miaoulis"}, {"authorId": "1796092", "name": "D. Ghazanfarpour"}], "citations": []}
