{"paperId": "0e3e62173c1b38693341645b89e48bff5f44db91", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "DSEP Fulcrum: Dynamic Sparsity and Expansion Packets for Fulcrum Network Coding", "abstract": "Fulcrum coding combines a high-field outer Random Linear Network Coding (RLNC) that generates outer coding expansion packets with a small-field inner RLNC that combines the source packets and the outer coding expansion packets. This two-layer Fulcrum coding allows flexible decoding in receivers with heterogeneous computational capabilities. Fulcrum coding has so far only been studied for conventional dense RLNC, which randomly selects all coding coefficients, and only for a statically fixed number of outer expansion packets. However, the probability that the coding coefficient row of a newly received packet is linearly independent of prior received coding coefficient rows (a prerequisite for successful decoding) is highly dynamic. We propose to exploit the dynamics of this probability to reduce the computational complexity of Fulcrum coding. In particular, we vary the density of non-zero coding coefficients, i.e., equivalently, the sparsity of coding coefficients, and the number of outer expansion packets to keep the complexity low while maintaining a reasonably high decoding probability. We introduce the general principles of dynamic sparsity and expansion packets (DSEP) for Fulcrum coding as well as two specific example DSEP policies. Our evaluations indicate that DSEP Fulcrum can increase the encoding throughput tenfold and increase the decoding throughput 1.4 to 4.3 fold while achieving decoding probabilities that are typically less than 1% lower than the conventional Fulcrum decoding probabilities. We also find that DSEP achieves somewhat higher encoding and decoding throughputs than the CodornicesRq (Release 2.1) implementation of RaptorQ block coding for small blocks (generations) of source packets, while RaptorQ is substantially faster for large generation sizes. Furthermore, we develop and evaluate an elementary DSEP recoding mechanism that achieves a recoding throughput more than double the decoding throughput.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "78293-78314", "volume": "8"}, "authors": [{"authorId": "2075327118", "name": "Vu Nguyen"}, {"authorId": "1685675653", "name": "Elif Tasdemir"}, {"authorId": "144060080", "name": "Giang T. Nguyen"}, {"authorId": "9296846", "name": "D. Lucani"}, {"authorId": "8387960", "name": "F. Fitzek"}, {"authorId": "1740196", "name": "M. Reisslein"}], "citations": [{"paperId": "1414ee5b1ef5511ff5d88ec3586d1bdf2b19f539", "title": "Optimizing efficiency of P2P content distribution with network coding: Principles, challenges, and future directions"}, {"paperId": "ce66cff61125b95e2d54bc66cc98b737587dff18", "title": "Design and Analysis of Systematic Batched Network Codes"}, {"paperId": "6931f8743257cf8a01f5f30c6e0f66b6c73fd2ff", "title": "Reducing tail latency with coding-based packet spraying in edge datacenters"}, {"paperId": "a4a1f38339fd661fd0f786e2421cb4b586f62ddc", "title": "Multi-Phase Recoding for Batched Network Coding"}, {"paperId": "0fd5c6e50e70f4b15397840d4bee3b6a91a52be2", "title": "On the Design of Timeout-Based Recoders for Batched Network Codes in the MU-MIMO Regime"}, {"paperId": "fe86080eb7aeeae746fcaf608cd58cbbdcaf1164", "title": "Scalable Network Coding for Heterogeneous Devices over Embedded Fields"}, {"paperId": "3ed35eae89b2a189b37ea45d6e432cfee870e80f", "title": "Ubi-Flex-Cloud: ubiquitous flexible cloud computing: status quo and research imperatives"}, {"paperId": "484abdf989074ae39fb80a04ad6497f612c8643b", "title": "Application Layer-Forward Error Correction Raptor Q Codes in 5G Mobile Networks for Factory of the Future"}, {"paperId": "bfd3846126f0a9f5f7acc44b02c2ee91d3a14d38", "title": "Completion Delay of Random Linear Network Coding in Full-Duplex Relay Networks"}, {"paperId": "88450e29722831bec91c6d82ec5b21b802fd197f", "title": "Perpetual Network Coding for Delay Sensitive Applications"}, {"paperId": "f3a2129371ea8307cd15d2e34264d3fbb203ce68", "title": "BAR: Blockwise Adaptive Recoding for Batched Network Coding"}, {"paperId": "1b0f6fba9271a45ec2bcd0eda47e4b0cd081c63a", "title": "A Unified Adaptive Recoding Framework for Batched Network Coding"}, {"paperId": "b8291a97072152226465badf819584c97460b6e3", "title": "Intrablock Interleaving for Batched Network Coding with Blockwise Adaptive Recoding"}, {"paperId": "530200580707542dbfa0bb4956a2113e75393b93", "title": "Sliding Window RLNC on Multi-Hop Communication for Low Latency"}, {"paperId": "1557341a71b403c6d2749ec463a9d58f7419dff0", "title": "Reconfiguration algorithms for high precision communications in time sensitive networks: Time-aware shaper configuration with IEEE 802.1Qcc"}, {"paperId": "4951b818c15e4f7fc33b8a159ff947f65df58dab", "title": "Real-Time Compression for Tactile Internet Data Streams"}, {"paperId": "90ec9555433e75bb564f06587b8cc3533ae7ba62", "title": "Exploring the Benefits of Memory-Limited Fulcrum Recoding for Heterogeneous Nodes"}, {"paperId": "9913626ee0f8f6a4bb5cfa2f20cf1d3af6d3feef", "title": "Fulcrum Coding Performance on Fog Computing Architecture"}, {"paperId": "86cd92c2027f3b7dbbe0be9e888e56aa7be20cb5", "title": "An Irregular Graph Based Network Code for Low-Latency Content Distribution"}, {"paperId": "9f4cada352edb6a2d75bb4be4adb06e5f08bfd10", "title": "Hardware-Accelerated Platforms and Infrastructures for Network Functions: A Survey of Enabling Technologies and Research Studies"}, {"paperId": "a543a6c4b27db7f9ddd2ca8ec0503d8a5cc26faa", "title": "Physical Education and English Language Arts Based K-12 Engineering Outreach in Software Defined Networking (Extended Version)"}, {"paperId": "86e432a8a6e683f333003ed84567fc8760ae33b6", "title": "A Unified Adaptive Recoding Framework for Batched Network Coding"}, {"paperId": "70eb91b60739a8f83f3165f8ea59396e1170374a", "title": "On Scalable Network Communication for Infrastructure-Vehicle Collaborative Autonomous Driving"}, {"paperId": "4151dbc0d3c0b517817782f933423fa941ac06a3", "title": "Network Coding as Enabler for Achieving URLLC Under TCP and UDP Environments: A Survey"}, {"paperId": "027c23c85505f012f915a6423d5456fbb7367a33", "title": "Middleware for Distributed Fulcrum Coding on the Fly: Leveraging Efficient Communications for 5G-IoT Heterogeneous Mobile Devices"}, {"paperId": "67b7bd499484fe55e86ca8d05ea6170f617218bc", "title": "FSW: Fulcrum Sliding Window Coding for Low-Latency Communication"}, {"paperId": "cb36992f5c795086363b8af0856c177c54b4339f", "title": "Evaluation of Decoding Delay in the Perpetual Coding"}, {"paperId": "cf852b3e43ea46083660a30f428f50faaa11084d", "title": "5G Campus Networks: A First Measurement Study"}, {"paperId": "e13861fb90ff383c4fb014e91f8e3d513c34fd01", "title": "SpaRec: Sparse Systematic RLNC Recoding in Multi-hop Networks"}, {"paperId": "11330d9926ba87fc349d9510f60ae1bd692e304c", "title": "Versatile Network Codes: Energy Consumption in Heterogeneous IoT Devices"}, {"paperId": "68c43163a10b263764ea2bf276eb0df927ce0ba0", "title": "Super Generation Network Coding for Peer-to-Peer Content Distribution Networks"}]}
