{"paperId": "0e3e4b166784833d43a74c7893ea3c4695f3820c", "publicationVenue": null, "title": "What Makes People Join Conspiracy Communities?", "abstract": "Widespread conspiracy theories, like those motivating anti-vaccination attitudes or climate change denial, propel collective action, and bear society-wide consequences. Yet, empirical research has largely studied conspiracy theory adoption as an individual pursuit, rather than as a socially mediated process. What makes users join communities endorsing and spreading conspiracy theories? We leverage longitudinal data from 56 conspiracy communities on Reddit to compare individual and social factors determining which users join the communities. Using a quasi-experimental approach, we first identify 30K future conspiracists?(FC) and30K matched non-conspiracists?(NC). We then provide empirical evidence of the importance of social factors across six dimensions relative to the individual factors by analyzing 6 million Reddit comments and posts. Specifically, in social factors, we find that dyadic interactions with members of the conspiracy communities and marginalization outside of the conspiracy communities are the most important social precursors to conspiracy joining-even outperforming individual factor baselines. Our results offer quantitative backing to understand social processes and echo chamber effects in conspiratorial engagement, with important implications for democratic institutions and online communities.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2020, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-09", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 30", "volume": "4"}, "authors": [{"authorId": "8604993", "name": "S. Phadke"}, {"authorId": "3071381", "name": "Mattia Samory"}, {"authorId": "3019719", "name": "Tanushree Mitra"}], "citations": [{"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "5539dd863a59ff26d26aab8c497e97bfec132190", "title": "Plotting against our nation: COVID-19, nationalisms, and conspiracy theories in five European countries"}, {"paperId": "141acb44c025eebb509bfcf4882e1309b25ec31e", "title": "Identity-Defining Beliefs on Social Media"}, {"paperId": "85adf39a2b2e7a2af19ddaed2c8731321677cb71", "title": "A Panel Study on the Dynamics of Social Media Use and Conspiracy Thinking"}, {"paperId": "5c832b4d00d9dfe20bdba2bd1fe6b1bb4b986bed", "title": "Echo Chambers within the Russo-Ukrainian War: The Role of Bipartisan Users"}, {"paperId": "5191e67484210c21eeefa6af23943b6f62f87584", "title": "The Conspiracy Money Machine: Uncovering Telegram's Conspiracy Channels and their Profit Model"}, {"paperId": "b71187829f1eaca9004fcd360d5a65bb483dd56e", "title": "Vaccination Attitudes Examination (VAX) Scale: a Bifactor-ESEM approach in a youth sample (15–24 years)"}, {"paperId": "1fbbacd6988c47417e0df9f9ba5998e7f75beb69", "title": "Adopting an Ecological Approach to Misinformation: Understanding the Broader Impacts on Online Communities"}, {"paperId": "f004dbaad3b2250694986ca65e93ea089fe77974", "title": "Capturing the conspiracist’s imagination"}, {"paperId": "16b8329a79620e9d6a28c00b7370343c115777b1", "title": "Learning from the Ex-Believers: Individuals' Journeys In and Out of Conspiracy Theories Online"}, {"paperId": "a1bac90e7ba7d1586b1e542a9f762d4c0f6bace4", "title": "Predicting Information Pathways Across Online Communities"}, {"paperId": "388d0b3aa5b0c877ab6d75705be035cd45e5dad3", "title": "Unveiling the formation of conspiracy theory on social media: A discourse analysis"}, {"paperId": "2ce3253fa3892b1820b672437359b29ff1ca0bb4", "title": "Users volatility on Reddit and Voat"}, {"paperId": "60c3a5b7c590d2807231a38ca0cbb4a474568a0f", "title": "What’s the Norm Around Here? Individuals’ Responses Can Mitigate the Effects of Misinformation Prevalence in Shaping Perceptions of a Community"}, {"paperId": "16df95a5375ca5c206c761eb42305f68564fc44c", "title": "Reviewing Interventions to Address Misinformation: The Need to Expand Our Vision Beyond an Individualistic Focus"}, {"paperId": "31fd8b78ce8bccbc2fb91eb7ed57648ab73b7fa6", "title": "A Moth to a Flame? Fulfilling Connectedness Needs Through Romantic Relationships Protects Conspiracy Theorists Against COVID-19 Misinformation"}, {"paperId": "d33febd170a95894c527434e275c23fc063821e7", "title": "The impact of political ideology, knowledge and participation on electoral conspiracy endorsement"}, {"paperId": "60dca9260607069c6dec09cce19be31c6a323c5e", "title": "Cults, Conspiracies, and Fantasies of Knowledge"}, {"paperId": "ccb4e4a5e12611439c4aacd665e089c7d1c054d1", "title": "Understanding the Impact of Awards on Award Winners and the Community on Reddit"}, {"paperId": "94468cacef3cc1415c3b3823ad7b33fdbd151286", "title": "Migration Crisis and Conspiracy in Kazuo Ishiguro"}, {"paperId": "6f3138dfba7578bb6cb2b867d41b016bc5cd217d", "title": "Interconnectedness and (in)coherence as a signature of conspiracy worldviews"}, {"paperId": "ddb795126a2a3798a371250a27575fa52ab610cb", "title": "Rabbit Hole Syndrome: Inadvertent, accelerating, and entrenched commitment to conspiracy beliefs."}, {"paperId": "aef7f0dad66f2c6f973b65a085845db7011f9c6e", "title": "Awake together: Sociopsychological processes of engagement in conspiracist communities."}, {"paperId": "1ea1973237227af049b2adb3ba1744e4ea21722b", "title": "‘Against the cult of veganism’: Unpacking the social psychology and ideology of anti-vegans"}, {"paperId": "9e792d58130cbf4a8bd54694548526600e7307be", "title": "Devotees on an Astroturf: Media, Politics, and Outrage in the Suicide of a Popular FilmStar"}, {"paperId": "aad6e33e76ce4225ff5b1c0b4f80c5de0fdbd690", "title": "Toward Detecting Conspiracy Language in Misinformation Documents"}, {"paperId": "558f7f1a6dba1e70e1c2780b22460a5a3cd40528", "title": "Conspiracy theories and social media platforms."}, {"paperId": "71fc53f702883b62774dd6d3ebc971d82ea9a0d9", "title": "Tracking group identity through natural language within groups"}, {"paperId": "e882fcd2bfd182d28ef339aceb240afd6ab55836", "title": "Pathways through Conspiracy: The Evolution of Conspiracy Radicalization through Engagement in Online Conspiracy Discussions"}, {"paperId": "6e3c3d94bdab82e077bcf131848000be8356ba36", "title": "Characterizing Reddit Participation of Users Who Engage in the QAnon Conspiracy Theories"}, {"paperId": "e20970a411973b90463fb49a7616dee386dafbda", "title": "Making a Radical Misogynist"}, {"paperId": "868c869d445dec2aaf88589333a0c9542850af4b", "title": "Factors affecting conspiracy theory endorsement in paranoia"}, {"paperId": "abc12bed0853575949b7b9ef0a934dfe77300b5b", "title": "Soros, Child Sacrifices, and 5G: Understanding the Spread of Conspiracy Theories on Web Communities"}, {"paperId": "3b523c12b43b0b42137aee19128bb296d4d144c5", "title": "Addressing Challenges and Opportunities in Online Extremism Research: An Interdisciplinary Perspective"}, {"paperId": "9c9a8a2ede08414e191bea6c22e40615a23a9fd1", "title": "WMDecompose: A Framework for Leveraging the Interpretable Properties of Word Mover’s Distance in Sociocultural Analysis"}, {"paperId": "208ef2ecde99834c2654cde5429f108451401ed5", "title": "Sensemaking and the Chemtrail Conspiracy on the Internet: Insights from Believers and Ex-believers"}, {"paperId": "6be747c29791778f77005c3a3fadedcbac0c355a", "title": "COVID and social media"}, {"paperId": "aeb7de3cdc6b44312ffe3087b08bea2a719ec055", "title": "Characterizing Social Imaginaries and Self-Disclosures of Dissonance in Online Conspiracy Discussion Communities"}, {"paperId": "55e7db76f9e426f97fc337539b09eaabbf1e9d55", "title": "Characterizing Online Engagement with Disinformation and Conspiracies in the 2020 U.S. Presidential Election"}, {"paperId": "54500a8722f7b661a731b2497c4863ce95a41e27", "title": "Do conspiracy theories efficiently signal coalition membership? An experimental test using the “Who Said What?” design"}, {"paperId": "a64b0bbedbc043d0df9e92ae048acab986563ac9", "title": "The Polarizing Impact of Continuous Presence on Users' Behavior"}, {"paperId": "aac2e9edc8659da940c0c3979400f8819db43053", "title": "ISSN: 2596-1934"}, {"paperId": "123990544303c2bc0098a2cf4d5a6f31a04c55e9", "title": "Structurizing Misinformation Stories via Rationalizing Fact-Checks"}]}
