{"paperId": "0e413b6b42ebdc544ad1f60b3af69927009c4ac8", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "SPEAr: Expediting Stream Processing with Accuracy Guarantees", "abstract": "Stream Processing Engines (SPEs) are used for realtime and continuous processing with stateful operations. This type of processing poses numerous challenges due to its associated complexity, unpredictable input, and need for timely results. As a result, users tend to overprovision resources, and online scaling is required in order to overcome overloaded situations. Current attempts for expediting stateful processing are impractical, due to their inability to uphold the quality of results, maintain performance, and reduce memory requirements.In this paper, we present the SPEAr system, which can expedite processing of stateful operations automatically by trading accuracy for performance. SPEAr detects when it can accelerate processing by employing online sampling and accuracy estimation at no additional cost. We built SPEAr on top of Storm and our experiments indicate that it can reduce processing times by more than an order of magnitude, use more than an order of magnitude less memory, and offer accuracy guarantees in real-world benchmarks.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1105-1116"}, "authors": [{"authorId": "18091964", "name": "Nikos R. Katsipoulakis"}, {"authorId": "1716685", "name": "Alexandros Labrinidis"}, {"authorId": "1728643", "name": "Panos K. Chrysanthis"}], "citations": [{"paperId": "3fc68135faa06cd7db5fd4e0ae99253e1e94db6d", "title": "TransScale: Combined-Approach Elasticity for Stream Processing in Fog Environments"}, {"paperId": "1bd4520adc9df6a25cb8c67826c3f7ab5bc76b25", "title": "HistSketch: A Compact Data Structure for Accurate Per-Key Distribution Monitoring"}, {"paperId": "e0338d7424ab0d884ef0374c6bfc335d858d2334", "title": "One Size Does Not Fit All: A Bandit-Based Sampler Combination Framework with Theoretical Guarantees"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "86016204cc943938def3d5cdb70e85945962bd10", "title": "A Survey of Techniques for Fulfilling the Time-Bound Requirements of Time-Sensitive IoT Applications"}, {"paperId": "e1184373b5a1e5d2531724b1d6f0779a7c5d6867", "title": "Managing Time-Sensitive IoT Applications via Dynamic Application Task Distribution and Adaptation"}, {"paperId": "54f0cb53d11fdf46e381651e186e6baddecad889", "title": "Improving Stream Load Balance through Shedding"}, {"paperId": "36161a5b77f58e0f042fb07c219ace5ada35af1f", "title": "Leaving stragglers at the window: low-latency stream sampling with accuracy guarantees"}, {"paperId": "fde5bc70cbee7b7cffca2448c81aa6238a424971", "title": "Leveraging Watermarks to Improve Performance of Streaming Systems"}]}
