{"paperId": "0e41bbad96fd670e397024835408acb7f9ed7705", "publicationVenue": null, "title": "Hybrid.Poly: Performance Evaluation of Linear Algebra Analytical Extensions", "abstract": "Anecdotal evidence suggests that Variety is one of the most challenging problems in Big data research [1]. Different data providers use different data models and formats to represent their data, which causes significant impediment to data scientists, whose goal is to make sense of all relevant data regardless of the source. Hybrid.Poly [2], [3] is the analytical polystore data management system designed to make all data accessible to the analyst, oblivious of the source differences.In this paper, we focus on the in-depth analysis and performance evaluation of the Linear Algebra extensions added to the Hybrid.Poly language.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "5430-5432"}, "authors": [{"authorId": "10316631", "name": "Maksim Podkorytov"}, {"authorId": "1705924", "name": "M. Gubanov"}], "citations": [{"paperId": "9f018a6fc0e6668de4aeae9a185de07e6b305562", "title": "Simplifying Access to Large-scale Structured Datasets by Meta-Profiling with Scalable Training Set Enrichment"}, {"paperId": "f6a70628877f248e5dbe516459c8c4ff1225a65c", "title": "Towards Tabular Embeddings, Training the Relational Models"}, {"paperId": "ccf4cdc4eea2c33191441c233258617bdb0f05e7", "title": "WebLens: Towards Interactive Large-scale Structured Data Profiling"}, {"paperId": "2e35d008ab7afe80a4287e5f62b148e33ce8d0f2", "title": "Hybrid.Poly: A Consolidated Interactive Analytical Polystore System"}, {"paperId": "a844d916f22d4ac33d13c12ea8139dbdfa815f1b", "title": "COVIDKG.ORG - a Web-scale COVID-19 Interactive, Trustworthy Knowledge Graph, Constructed and Interrogated for Bias using Deep-Learning"}]}
