{"paperId": "0e49abb18a71eadecbb672fc6f3f6b931b7b5244", "publicationVenue": {"id": "9641a8b5-1baa-4991-8cda-2c1336578145", "name": "International Journal of Education and Management Engineering", "type": "journal", "alternate_names": ["Int J Educ Manag Eng"], "issn": "2305-3623", "url": "https://www.mecs-press.org/ijeme/"}, "title": "The Cell Cycle Model: A Comprehensive Review and Extension Based on Machine Learning", "abstract": ": The cell cycle is a conserved process comprising of an organized series of interdependent and cross regulatory events that lead to controlled cell growth and proliferation. Genomic and volume regulatory processes are of special interest as they decide the fate of cell cycle. Signaling cascades including MAPK, PI3K, Sonic Hedgehog, Wnt and NOTCH signaling pathways are few well known conventional players contributing in controlling the cell cycle progression through different phases by expressing certain proteins. Moreover, the unconventional volume regulatory players exert influence by regulating membrane potential that is determined by ions influx or efflux across the plasma membrane via ion channels, controlling water movement and ultimately contributing to volume increase in growth phases of the cell cycle. Both of these players are interlinked, therefore, in order to establish a better understanding of the interdependence of these players, principles of machine learning were applied on data obtained on cell cycle. The data was processed by using neural networks and it shows that a significant understanding of conventional regulators is available in the literature and it has been under the limelight as well. However, when it comes to unconventional volume regulatory players, a limited understanding is available. Moreover, the precise role of each component and its interdependence with other is not yet fully understood. Due to which, they are not clearly evaluated for their potential role as cell cycle control elements for therapeutic purposes. Therefore, this study aims to summarize the data on cell cycle that is obtained through machine learning and to discuss the advances in cell cycle modelling mechanisms and designs that are based on different mathematical algorithms. Thus, this review will provide a basis to clearly understand and interlink the discoveries on cell cycle so that a comprehensive cell cycle model could be built which, if manipulated can be used for therapeutic purposes by identifying the least explored regulatory control elements", "venue": "International Journal of Education and Management Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-08", "journal": {"name": "International Journal of Education and Management Engineering"}, "authors": [{"authorId": "2006429617", "name": "M. K. Pasha"}], "citations": []}
