{"paperId": "0e53c89da6a244fcead452632cab5f5c7965db75", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Study of Partisan News Sharing in the Russian invasion of Ukraine", "abstract": "Since the Russian invasion of Ukraine, a large volume of biased and partisan news has been spread via social media platforms. As this may lead to wider societal issues, we argue that understanding how partisan news sharing impacts users' communication is crucial for better governance of online communities. In this paper, we perform a measurement study of partisan news sharing. We aim to characterize the role of such sharing in influencing users' communications. Our analysis covers an eight-month dataset across six Reddit communities related to the Russian invasion. We first perform an analysis of the temporal evolution of partisan news sharing. We confirm that the invasion stimulates discussion in the observed communities, accompanied by an increased volume of partisan news sharing. Next, we characterize users' response to such sharing. We observe that partisan bias plays a role in narrowing its propagation. More biased media is less likely to be spread across multiple subreddits. However, we find that partisan news sharing attracts more users to engage in the discussion, by generating more comments. We then built a predictive model to identify users likely to spread partisan news. The prediction is challenging though, with 61.57% accuracy on average. Our centrality analysis on the commenting network further indicates that the users who disseminate partisan news possess lower network influence in comparison to those who propagate neutral news.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-26", "journal": {"name": "ArXiv", "volume": "abs/2311.15294"}, "authors": [{"authorId": "2128128019", "name": "Yiming Zhu"}, {"authorId": "144505165", "name": "E. Haq"}, {"authorId": "2266842067", "name": "Gareth Tyson"}, {"authorId": "41177600", "name": "Lik-Hang Lee"}, {"authorId": "2125059581", "name": "Yuyang Wang"}, {"authorId": "2212824057", "name": "Pan Hui"}], "citations": []}
