{"paperId": "0e54c8ea5535ae4385d0b9ccd3097eb6b6402813", "publicationVenue": null, "title": "Rapid Parallel Detection of Distance-based Outliers in Time Series using MapReduce", "abstract": "Time series analysis is crucial in a large number of knowledge domains ranging from micro and macro economy, industry, tourism, health to hydrology, meteorology, agriculture, demography, etc. The interest in efficiently and meaningfully processing of time series data increased in the last decade with the spreading of sensor networks and Cyber-Physical Systems which produce huge amounts of measured data. The outlier detection is a key issue for Quality Assurance of time series data and its goal is to detect the objects that present a very different behavior from the expected one. Once identified, these objects are either removed or corrected. In this paper we propose a highly scalable parallel data processing algorithm for outlier ranking based on the distance between data objects. As opposed to the current existing sequential implementations, the provided algorithm is based on the parallel processing employed by the MapReduce paradigm. Using real monitored solar data for experimental validation we show the dramatically improvement of running time for large archives of time series (millions of records order).", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-09-21", "journal": {"name": "Journal of Control Engineering and Applied Informatics", "pages": "63-71", "volume": "18"}, "authors": [{"authorId": "2311269", "name": "Sorin N. Ciolofan"}, {"authorId": "144512429", "name": "Florin Pop"}, {"authorId": "1788972", "name": "M. Mocanu"}, {"authorId": "1733437", "name": "V. Cristea"}], "citations": [{"paperId": "9e3baeae797bee48ec5783b127ec385032f004a2", "title": "Conception et exploitation d'une base de modèles: application aux data sciences. (Design and Exploitation of a Models Database: Applied to Data Sciences)"}, {"paperId": "a144bc35abd7964434f6ef5e0f617fd331ae9cc8", "title": "Towards a Hierarchical Approach for Outlier Detection in Industrial Production Settings"}]}
