{"paperId": "0e5aed3331007fdbe364a33a7656321aabcbf8d5", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Interest-Based Approach for Reducing Network Contentions in Vehicular Transportation Systems", "abstract": "Traffic management systems (TMS) are the key for dealing with mobility issues. Moreover, 5G and vehicular networking are expected to play an important role in supporting TMSs for providing a smarter, safer and faster transportation. In this way, several infrastructure-based TMSs have been proposed to improve vehicular traffic mobility. However, in massively connected and multi-service smart city scenarios, infrastructure-based systems can experience low delivery ratios and high latency due to packet congestion in backhaul links on ultra-dense cells with high data traffic demand. In this sense, we propose I am not interested in it (IAN3I), an interest-based approach for reducing network contention and even avoid infrastructure dependence in TMS. IAN3I enables a fully-distributed traffic management and an opportunistic content sharing approach in which vehicles are responsible for storing and delivering traffic information only to vehicles interested in it. Simulation results under a realistic scenario have shown that, when compared to state-of-the-art approaches, IAN3I decreases the number of transmitted messages, packet collisions and latency in up to 95%, 98% and 55% respectively while dealing with traffic efficiency properly, not affecting traffic management performance at all.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "1886588", "name": "A. M. Souza"}, {"authorId": "144677354", "name": "Guilherme Maia"}, {"authorId": "145199028", "name": "T. Braun"}, {"authorId": "145809763", "name": "L. Villas"}], "citations": [{"paperId": "460af49d626e46bf942792f0c35116373d0a6647", "title": "Towards a Personalized Multi-objective Vehicular Traffic Re-routing System"}, {"paperId": "a7ccd99551e400292a77357038b260d06e5dda40", "title": "Uma análise do uso de métricas de centralidade temporais para identificação de zonas de ancoragem para disseminação de conteúdo flutuante em VANETs"}, {"paperId": "f4489d06b78441b20857998a98ec134f6d767ae1", "title": "Systematic Literature Review on Smart Mobility: A Framework for Future “Quantitative” Developments"}, {"paperId": "9fbbcb1610f1f9d4db15f3bba6a2e0e73ca87e78", "title": "An adaptive and Distributed Traffic Management System using Vehicular Ad-hoc Networks"}, {"paperId": "064823e05c54aef06c63a69fe3470558f9ea61c9", "title": "Performance Enriching Channel Allocation Algorithm for Vehicle-to-Vehicle City, Highway and Rural Network"}]}
