{"paperId": "0e74d9dea6398e3eb6290ac8ea792692357dab95", "publicationVenue": null, "title": "Towards making sense of Spark-SQL performance for processing vast distributed RDF datasets", "abstract": "Recently, a wide range of Web applications (e.g. DBPedia, Uniprot, and Probase) are built on top of vast RDF knowledge bases and using the SPARQL query language. The continuous growth of these knowledge bases led to the investigation of new paradigms and technologies for storing, accessing, and querying RDF data. In practice, modern big data systems (e.g, Hadoop, Spark) can handle vast relational repositories, however, their application in the Semantic Web context is still limited. One possible reason is that such frameworks rely on distributed systems, which are good for relational data, however, their performance on dealing with graph data models like RDF has not been well-studied yet. In this paper, we present a systematic evaluation of the performance of SparkSQL engine for processing SPARQL queries. We stated it using three relevant RDF relational schemas, and two different storage backends, namely, Hive, and HDFS. In addition, we show the impact of using three different RDF-based partitioning techniques with our relational scenario. Additionally, we discuss the results of our experiments: (i) we present insights about the trade-offs that characterize different experimental configurations, and (ii) we identify the best and the worst ones for the SP2Bench's benchmark scenario.", "venue": "SBD@SIGMOD", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-05-25", "journal": {"name": "Proceedings of The International Workshop on Semantic Big Data"}, "authors": [{"authorId": "2065777089", "name": "Mohamed Ragab"}, {"authorId": "50271459", "name": "Riccardo Tommasini"}, {"authorId": "1716216761", "name": "Sadiq Eyvazov"}, {"authorId": "1783693", "name": "Sherif Sakr"}], "citations": [{"paperId": "1848fd7dc64e9cd99ebe7a67dd3672907ca851fb", "title": "PAPAYA: A library for performance analysis of SQL-based RDF processing systems"}, {"paperId": "18f95c677e014391acd632cf2c8d5033cf6a1a20", "title": "PAPyA: Performance Analysis of Large RDF Graphs Processing Made Easy"}, {"paperId": "77abea0ef5894c4c6b7e3bf37cbbe7f4caaf56f1", "title": "A Framework to Compute Entity Relatedness in Large RDF Knowledge Bases"}, {"paperId": "85c6db4e2eb186a8cd251220882342cdafd34ce1", "title": "An In-depth Investigation of Large-scale RDF Relational Schema Optimizations Using Spark-SQL"}, {"paperId": "03c5f3a6d1d50da7bfc0f50be0f80e8b582f47e2", "title": "Aadhaar Data Analysis Comparison in MapReduce, Hive and Spark"}, {"paperId": "75f8b79bbc35e6ca6ff1e83a71b117b228ed2bc2", "title": "Javier Guillot Jiménez Strategies to Understand the Connectivity of Entity Pairs in Knowledge Bases"}]}
