{"paperId": "0e74edbc5de43691f210b609fdbf21b587d81747", "publicationVenue": {"id": "0b391b14-8353-4d09-be78-077ce8a257f7", "name": "Energy-Efficient Computing and Networking", "type": "conference", "alternate_names": ["Energy-efficient Comput Netw", "E-Energy", "e-Energy"], "url": "http://www.energyware.org/"}, "title": "BatAlloc: Effective Battery Allocation against Power Outage for Cellular Base Stations", "abstract": "Base stations play a key role in today's cellular networks. Their reliability and availability heavily depend on the electrical power supply. Modern power grid is known to be highly reliable, but still suffers from outage due to severe weather or human-driven accidents, particularly in remote areas. Most of the base stations are thus equipped with backup battery groups. Given their limited numbers and capacities, they however can hardly sustain a long power outage without a proper allocation strategy. A deep discharge will also accelerate the battery degradation and eventually contribute to a higher battery replacement cost. In this paper, we closely examine the power outage events and the backup battery status from a one-year dataset of a major cellular service provider, including 4206 base stations distributed across 8400 square kilometers and more than 1.5 million records on battery activities. We then develop BatAlloc, a battery allocation framework to address the mismatch between the battery supporting ability and diverse power outage incidents. We build up a deep leaning based approach to accurately profile battery features and present an effective solution that minimizes both service interruption time and the overall cost. Our trace-driven experiments show that BatAlloc cuts down the average service interruption time from 5 hours to nearly zero with only 88% of the overall cost compared to the current practical allocation.", "venue": "Energy-Efficient Computing and Networking", "year": 2017, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-05-16", "journal": {"name": "Proceedings of the Eighth International Conference on Future Energy Systems"}, "authors": [{"authorId": "144935272", "name": "Fangxin Wang"}, {"authorId": "33464842", "name": "Feng Wang"}, {"authorId": "1940417", "name": "Xiaoyi Fan"}, {"authorId": "1681457", "name": "Jiangchuan Liu"}], "citations": [{"paperId": "50be12c8616fdab4a1b4ff95a1b13792ab2a882c", "title": "Deep learning models for cloud, edge, fog, and IoT computing paradigms: Survey, recent advances, and future directions"}, {"paperId": "0afc56442801d0452979901a61c13df0b8c4872a", "title": "ShiftGuard: Towards Reliable 5G Network by Optimal Backup Power Allocation"}, {"paperId": "a4513c402c12fd495dce583522d98f9a695e0994", "title": "Deep Learning for Edge Computing Applications: A State-of-the-Art Survey"}, {"paperId": "f33761e738dae3686686c895fe3f2dcc7162224c", "title": "Backup Battery Analysis and Allocation against Power Outage for Cellular Base Stations"}]}
