{"paperId": "0e90b0beb70b6b350fb96e6233a3b3907103f24f", "publicationVenue": {"id": "b4ddf99b-89f6-42b4-8bbc-9bde693530cf", "name": "International Journal of Information Management", "type": "journal", "alternate_names": ["Int J Inf Manag"], "issn": "0268-4012", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/30434/description#description", "alternate_urls": ["https://www.journals.elsevier.com/international-journal-of-information-management", "http://www.sciencedirect.com/science/journal/02684012"]}, "title": "Using big data for co-innovation processes: Mapping the field of data-driven innovation, proposing theoretical developments and providing a research agenda", "abstract": null, "venue": "International Journal of Information Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-20", "journal": {"name": "Int. J. Inf. Manag.", "pages": "102347", "volume": "60"}, "authors": [{"authorId": "47694816", "name": "Stefano Bresciani"}, {"authorId": "51921858", "name": "Francesco Ciampi"}, {"authorId": "2088306205", "name": "Francesco Meli"}, {"authorId": "35207612", "name": "Alberto Ferraris"}], "citations": [{"paperId": "3b7221a2f5f0d23e2aac0a60c1f4b1f35d762544", "title": "Research on the green innovation effect of digital economy network – Empirical evidence from the manufacturing industry in the Yangtze River Delta"}, {"paperId": "bcd8ad6529ca33a2189b5c1b2c626c6ad9942816", "title": "Towards organisation 4.0. An empirical study"}, {"paperId": "7a6b3a655b442f152721461b2de1efee3d706c90", "title": "Tech and grow! Unraveling the interplay between industry 4.0 technologies and supply chain performance: marketing strategy alignment as a moderator"}, {"paperId": "e17bfa4102db0bdd9d759c5491bc7ec2d5f94a67", "title": "Exploring the dynamics of bigdata adoption in the Indian food industry with fuzzy analytical hierarchical process"}, {"paperId": "78cf661b343c8faf24056fe06860858ae0cc38cf", "title": "Growth hacking: A critical review to clarify its meaning and guide its practical application"}, {"paperId": "cd0a2febc9e34ebec30bb8ffa44bb2e95ff9ec36", "title": "Digital marketing analytics: A review of strategies in the age of big data and AI"}, {"paperId": "58d34ba33cf277181f0c2bb4bf154467eb0ef0e2", "title": "Digital innovation drivers in retail banking: the role of leadership, culture, and technostress inhibitors"}, {"paperId": "9c9cf89f4bcad2a2d6bccf2576814afbc9d31540", "title": "Tackling the global challenges using data-driven innovations"}, {"paperId": "0198a63ee8f66e34b3fb1d0a8255360e02707547", "title": "Should SMEs diversify their global destinations? The role of market insights and digital transformation"}, {"paperId": "be583ee1c85eff84821a80e3edb01a7d08969578", "title": "Data-driven allocation of smart grid-connected system based on ant colony optimization algorithm"}, {"paperId": "886f6e33b8c970e4f18769ecc4b048c3e88809c4", "title": "Revisiting the role of HR in the age of AI: bringing humans and machines closer together in the workplace"}, {"paperId": "8d18644f30c07a5c8566ec7db1ccc3fb6b64a6de", "title": "Competitive advantage: A longitudinal analysis of the roles of data-driven innovation capabilities, marketing agility, and market turbulence"}, {"paperId": "26457db35f1198b29e13c620f354766c32f8e514", "title": "Taking stock of research on hybrid organizations: Enriching theoretical perspectives, extending empirical contexts, and expanding practical relevance"}, {"paperId": "83a4ffb693980a7218ed11fb63a4b726255864d1", "title": "Is multi-pronged better? Research on the driving effect of the combination of environmental regulation in mining cities"}, {"paperId": "04314678870e26781cd36f98919922ce3da90314", "title": "Research on the impact of digital transformation on the production efficiency of manufacturing enterprises: Institution-based analysis of the threshold effect"}, {"paperId": "64a2bf4325bb8bc95b610bdf2755d96cbff0caa5", "title": "Analysing the relevance of value creation in the interconnection amongst entrepreneurship, marketing and innovation: a systematic literature review"}, {"paperId": "2a24c9dc9e4750afaa91fc8761ff4b44e14404f6", "title": "Does emotional intelligence impact service innovation capabilities? Exploring the role of diversity climate and innovation culture"}, {"paperId": "29a4d69c72f82963d8fd9ec91a6b1589f7056230", "title": "Can business managerial capacity improve green innovation in different industries? Evidence from Chinese listed companies"}, {"paperId": "70e46bd234b77475ec38a45954332c7af17f5963", "title": "Social Networking Technologies in SMEs: A Bibliometric Analysis"}, {"paperId": "a4586ab3c754b2014c3e6e87ef628cf0a01c8df5", "title": "Resistance of multiple stakeholders to e-health innovations: Integration of fundamental insights and guiding research paths"}, {"paperId": "d94d20384d6eacd811e2cfd54c12475204145b21", "title": "Examining the relationships between big data analytics capability, entrepreneurial orientation and sustainable supply chain performance: moderating role of trust"}, {"paperId": "8e06aa8c861eaef008578a3f36ce555ea6e68f8e", "title": "Agribusiness capabilities and performance: a systematic literature review and research agenda"}, {"paperId": "b6ba1bc65bb6e55e8da38be1cb64f6977c96c211", "title": "Big Data Management Capabilities and Green Innovation: A Dynamic Capabilities View"}, {"paperId": "7f056d1e1c70894cc66ec71609eaaed4b4796eca", "title": "Coping with the heterogeneity of external knowledge sources: Corresponding openness strategies and innovation performance"}, {"paperId": "8687a2582be842c9ca13bfa7b1ef377230cd5971", "title": "Institutional innovation essence and knowledge innovation goal of intellectual property law in the big data era"}, {"paperId": "56f6187825917ea67dd8c13f08ea9f37a1c1e379", "title": "A bibliographic overview of financial engineering in the emerging financial market"}, {"paperId": "3348e2fa59e51be0db3ad644059b987af22adfe3", "title": "Predicting breakthrough innovation engagement via hybrid intelligence: a moderated mediation model of self-extinction and social intelligence"}, {"paperId": "63d9be945f6049a2a59b4a8369a5e7802bf32d8a", "title": "Big data in relation with business intelligence capabilities and e-commerce during COVID-19 pandemic in accountant’s perspective"}, {"paperId": "d140dcd0a241e20088d47125427262ebfa66f8a6", "title": "A configurational approach to new product development performance: The role of open innovation, digital transformation and absorptive capacity"}, {"paperId": "89cf80617af2787baa6926bd704d41cef4e66617", "title": "How should companies deploy their digital supply chain platforms to gain competitive advantages? An asset orchestration perspective"}, {"paperId": "3ca193b37d0bc5a9585daf1458d2969b8950d579", "title": "Toward Digital Transformation and Business Model Innovation: The Nexus between Leadership, Organizational Agility, and Knowledge Transfer"}, {"paperId": "862f7e54e857ecd6dd1386cd9463a6742404ae30", "title": "Impact of faith on food marketing and consumer behaviour: a review"}, {"paperId": "af282253115b3f333e813a0694395beac5c27c2d", "title": "Organizational scaling: The role of knowledge spillovers in driving multinational enterprise persistent rapid growth"}, {"paperId": "705dfb7f66894d79f5a68660f6573a6a6d13d2f9", "title": "Innovation Commons for the Data Economy"}, {"paperId": "ec2e11841ee783fb81b679d2ad58d695db351cad", "title": "Linking big data analytics capability and sustainable supply chain performance: mediating role of innovativeness, proactiveness and risk taking"}, {"paperId": "c6d0aaa96c43de0529351cb41c5a271bdedbf21b", "title": "Unlocking agility: Trapped in the antagonism between co-innovation in digital platforms, business analytics capability and external pressure for AI adoption?"}, {"paperId": "f9d481740b68d0e1d84b35805da68a0cccd7b035", "title": "Drivers and Loci of Big Data Innovation: A Review, Synthesis, and Future Research Directions"}, {"paperId": "ade7af72ca9a48e133be5dbf772e3d438bbb824a", "title": "Firm performance in digitally integrated supply chains: a combined perspective of transaction cost economics and relational exchange theory"}, {"paperId": "4a0d90db169d5e770df3cc38cba1c7917edd24be", "title": "Artificial intelligence and new business models in agriculture: a structured literature review and future research agenda"}, {"paperId": "c91fc66687088206a4027db4b4e54f73f2a975c7", "title": "Digitalization and Productivity: Evidence from EU Manufacturing Sector"}, {"paperId": "e459cc7d5e02d0c8fcbf193c5ccfe0d26375a29b", "title": "Digitalization beyond technology: Proposing an explanatory and predictive model for digital culture in organizations"}, {"paperId": "85e1f4c4c54442687d0d014a19c19c325b8fa670", "title": "Still our most important asset: A systematic review on human resource management in the midst of the fourth industrial revolution"}, {"paperId": "2f4c62d28d4c1832fa3c54d58a1a4c0d0486ecb3", "title": "Unlocking the Power of Digital Commons: Data Cooperatives as a Pathway for Data Sovereign, Innovative and Equitable Digital Communities"}, {"paperId": "51481c84321ab3545365c5bd6508601e17f93d4a", "title": "Data-driven Innovation or Innovation-driven Data Generation?"}, {"paperId": "fd11137a6b3343027436731c06eb04204f987301", "title": "Digital transformation and export performance: a process mechanism of firm digital capabilities"}, {"paperId": "760bb204d64402139cf19469e5b9c683b6b69a6d", "title": "Open data platforms for transformational entrepreneurship: Inclusion and exclusion mechanisms"}, {"paperId": "436148932d150d0ce64af36f48408dde3e6c21ae", "title": "Can data sharing really provide added value? Practical data sharing recommendations for the wind energy sector"}, {"paperId": "296b39266b2c353820f76e3bd5ecf45f48d4d9a7", "title": "Best Practice Data Sharing Guidelines for Wind Turbine Fault Detection Model Evaluation"}, {"paperId": "9a87a781da10db7f3f80517d2cf3653c5aabe22d", "title": "Growth hacking and international dynamic marketing capabilities: a conceptual framework and research propositions"}, {"paperId": "ef8f20ec765771eab2de1f3eded2afcaef856070", "title": "Digitalizing business models in hospitality ecosystems: toward data-driven innovation"}, {"paperId": "6a4ad32b4744461b37a0c763a481de31774260d7", "title": "How can big data and predictive analytics impact the performance and competitive advantage of the food waste and recycling industry?"}, {"paperId": "5016dd3d51992da76c9aa27c0eded9364287cbae", "title": "E-commerce channel management on the manufacturers’ side: ongoing debates and future research pathways"}, {"paperId": "d69850aada934700c022113e634f58b17a5c93c6", "title": "To digit or to head? Designing digital transformation journey of SMEs among digital self-efficacy and professional leadership"}, {"paperId": "dd9558dd70f3e69db567bf3d3f7544030675a3c0", "title": "The state of the art of strategic leadership"}, {"paperId": "51f5ea7c43197768345f38456e3a9a404c2d2232", "title": "The Role of Leadership and Digital Transformation in Higher Education Students’ Work Engagement"}, {"paperId": "641b46fc44d6c7db82640ad6f15da260589513ef", "title": "State-of-the-Art of Artificial Intelligence and Big Data Analytics Reviews in Five Different Domains: A Bibliometric Summary"}, {"paperId": "4cc75b9ae756cd0339bdc77482e15c6baae98a9f", "title": "A systematic review of determinants of cultured meat adoption: impacts and guiding insights"}, {"paperId": "978b4d97f490463d4958d41851d07bab7b87e9ef", "title": "A twin data-driven approach for user-experience based design innovation"}, {"paperId": "0ea51e611b89c22505a1f2dec5f522cf5140ba01", "title": "Unveiling the effects of big data analytics capability on innovation capability through absorptive capacity: why more and better insights matter"}, {"paperId": "650a366890e65390e4ed1cc8c134cf2540928706", "title": "Big data analytics capability in healthcare operations and supply chain management: the role of green process innovation"}, {"paperId": "effd342e79296a3827b54546a1c9ab736fe65548", "title": "Revisiting the bullwhip effect: how can AI smoothen the bullwhip phenomenon?"}, {"paperId": "c7ecb86bf64fda7a65d79c1e96cf8bd949ce36da", "title": "FinTech in the financial system: Towards a capital-intensive and high competence human capital reality?"}, {"paperId": "1febae2c571b6a9109d96f333e3e3db15e1b787c", "title": "Data-driven innovation development: an empirical analysis of the antecedents using PLS-SEM and fsQCA"}, {"paperId": "f022cdadbe700eb64bce2f4b5e5b1088738eb7be", "title": "Data-driven Innovation: Understanding the Direction for Future Research"}, {"paperId": "218633e7b4b73cd72fae4cf5b4c59003204a7645", "title": "INNOVATION MANAGEMENT: IS BIG DATA NECESSARILY BETTER DATA?"}, {"paperId": "65a4973ec543b65847b9e7957b293b27c35c3bb5", "title": "Digital transformation of organization using AI-CRM: From microfoundational perspective with leadership support"}, {"paperId": "f326458164841872ff07982672b64efb9ead81e3", "title": "Creative abilities and digital competencies to transitioning to Business 4.0"}, {"paperId": "c8b8291597c238953f8645ca88503fcd9b31521d", "title": "Perceived customer journey innovativeness and customer satisfaction: a mixed-method approach"}, {"paperId": "fe6c95fbca199171f8cd4b9f38ca537c8043011b", "title": "Business Analytic and Business Value: A Review and Bibliometric Analysis of a Decade of Research"}, {"paperId": "a1b94b301e50992861f32d7a7beefdc9a8cf86b4", "title": "Linking data-driven innovation to firm performance: a theoretical framework and case analysis"}, {"paperId": "09a5a32ba8d18db6a0e665b3aae67b356522afd7", "title": "The Effect of Digitalization on Innovation Capabilities through the Lenses of the Knowledge Management Strategy"}, {"paperId": "f5e0e9c1c77ef96fc77d3e7c8e6dd7b9cb492153", "title": "The adoption of artificial intelligence powered workforce management for effective revenue growth of micro, small, and medium scale enterprises (MSMEs)"}, {"paperId": "aa7be47096b1a1c505778ad6bdd7dd94adc3c818", "title": "Big data analytics capabilities and MSME innovation and performance: A double mediation model of digital platform and network capabilities"}, {"paperId": "03e5bb15193682a235165046a5dfa78b01a2bfb9", "title": "Multichannel digital service delivery and service ecosystems: The role of data integration within Smart Product-Service Systems"}, {"paperId": "c0b8dd1e6f0077f77941386ec861fb02267e31e9", "title": "Unraveling the Performance Puzzle of Digitalization: Evidence from Manufacturing Firms"}, {"paperId": "b93fc0da07052979828916193b59d6e50bc9b44c", "title": "Food start-ups: leveraging digital marketing and disruptive information systems innovations to survive in the post-COVID environment"}, {"paperId": "02f92bf13721737db20303af07e9b3df36912214", "title": "To be more independent or more dependent? The evolution mechanism of co-innovation between digital platforms and content creators"}, {"paperId": "3f9e5ad763d58c85006ae13873ed1cf3dee284aa", "title": "Role of big data analytics capabilities to improve sustainable competitive advantage of MSME service firms during COVID-19 – A multi-theoretical approach"}, {"paperId": "4509e70f2a1c8968869ae1a2264d5f6671e2f66c", "title": "Discovering Themes and Trends in Digital Transformation and Innovation Research"}, {"paperId": "c4d6c97dc801b03679dd5628db64cc4b99be564e", "title": "Risks of data-driven technologies in sustainable supply chain management"}, {"paperId": "df16be9b4aa251ab6ea6245cdd35c06bb0b15b9b", "title": "HIGH EFFICIENCY PUBLIC TRANSPORTATION SYSTEM: ROLE OF BIG DATA IN MAKING RECOMMENDATIONS"}, {"paperId": "207455138f15b43a67bcb98e8fe9fe42822cbf68", "title": "Circularity of food systems: a review and research agenda"}, {"paperId": "3baa8ce84b47896791d9010260a1340bcca51ca9", "title": "Knowledge generation from Big Data for new product development: a structured literature review"}, {"paperId": "a46b6112792f0c297b7999b5ecaf782e99198534", "title": "Does Big Data Drive Innovation In E-Commerce: A Global Perspective?"}, {"paperId": "69c315238dec1789dca309f61a5c19612ec7e271", "title": "Exploring data-driven innovation: What’s missing in the relationship between big data analytics capabilities and supply chain innovation?"}, {"paperId": "61c975e7f4e1da5b1606f086a7e689936a26cf07", "title": "Collaboration, trust and performance in agri-food supply chains: a bibliometric analysis"}, {"paperId": "e860d852b2ce8befd25334ff339e7d7776f52ac0", "title": "Digital technology deployment and firm resilience: Evidence from the COVID-19 pandemic"}, {"paperId": "06964f5191fe2ebf33b382d65d4d47e4af9faa13", "title": "Knowledge-based dynamic capabilities: a scientometric analysis of marriage between knowledge management and dynamic capabilities"}, {"paperId": "ec030c7db1cfa8bf58e79c7a68c064705e088f21", "title": "The Dimensional Structure of Tourism Festival and Special Event Innovation and Their Impacts on Tourists’ Behavioral Intentions"}, {"paperId": "ccd198039863f24faf7d191360a8748bb05094c8", "title": "From data to data: an overview towards qualitative data research reproducibility"}, {"paperId": "930fa32ba6ec94787f016c1d29acc244af832613", "title": "Consumers' perception of suboptimal food: strategies to reduce food waste"}, {"paperId": "151a23e3a42b7088d0cdf992565b0b897688860b", "title": "Artificial intelligence in customer relationship management: literature review and future research directions"}, {"paperId": "4fa733c4b5ef550e4f21ebb68069d118c9c93b07", "title": "Building SMEs’ resilience in times of uncertainty: the role of big data analytics capability and co-innovation"}, {"paperId": "e22205825f49e2ac5e302c1e089a25ec39d46c32", "title": "Impact of big data usage on product and process innovation: the role of data diagnosticity"}, {"paperId": "37db90fdc2e2d6b08fffa81c64ec617ed4725919", "title": "Simulation modeling - An effective method in doing business and management research"}, {"paperId": "159ad8c7eb20fa055c36e1412abce46ed08123c3", "title": "Bibliographic Coupling Links: Alternative Approaches to Carrying Out Systematic Reviews about Renewable and Sustainable Energy"}, {"paperId": "30a8442344ebcf51a77b4bda2b3eb4842db15d64", "title": "Waste management beyond the COVID-19 pandemic: Bibliometric and text mining analyses"}, {"paperId": "dc3f445bbe72b934bef895901ed4f2c3f28cf2ea", "title": "How data-driven innovation capability is shaping the future of market agility and competitive performance?"}, {"paperId": "4c1a3e49ac7c9c6798e322beab85dd4280d9ce9d", "title": "Digital innovation and entrepreneurship transformation through open data hackathons: Design strategies for successful start-up settings"}, {"paperId": "77ac6f2cd274c307c8015e801371b43ceea448ac", "title": "The co-evolutionary relationship between digitalization and organizational agility: Ongoing debates, theoretical developments and future research perspectives"}, {"paperId": "a71db615d362b005b40e944ba93f8b6bec80a6b6", "title": "Big data analytics capability for improved performance of higher education institutions in the Era of IR 4.0: A multi-analytical SEM & ANN perspective."}, {"paperId": "6258d96dd9896a0db141714d7d82d9c50dd128ec", "title": "Trust and reputation in family businesses: A systematic literature review of past achievements and future promises"}, {"paperId": "a1f6c27f70da29a412132c8077e7c2b297514341", "title": "An Investigation on Learning, Polluting, and Unlearning the Spam Emails for Lifelong Learning"}, {"paperId": "a984f5a1f16b9f6176754fc7e9a6137df32a1bc5", "title": "A systematic literature review of food safety management system implementation in global supply chains"}, {"paperId": "9280b2b64512ce905123ea17740d415cadcb4b0d", "title": "Exploring agricultural entrepreneurship and new technologies: academic and practitioners' views"}, {"paperId": "725bffa00a7207fec75622cbe52a7721bc2386ee", "title": "Mapping the intellectual structure of short food supply chains research: a bibliometric analysis"}, {"paperId": "2ca8c92a6889f79f3b883e24a1d352ae62336536", "title": "Simulation of knowledge development in an innovation system based on neural network model"}, {"paperId": "fab4d982c775f9ce29ab889c5124db7c45482d63", "title": "Strategic Innovation as a Factor of Adaptation of National Economies to the Development of Global Value Chains"}, {"paperId": "cea31da2579c5157b5753694f91b25ba17593a14", "title": "A data-driven global innovation system approach and the rise of China’s artificial intelligence industry"}, {"paperId": "6b942a436f286b9f646152f7519ed9c0eee32011", "title": "MOBILE SERVICE CO-INNOVATION AND SERVICE PERFORMANCE: A SERVICE-DOMINANT LOGIC PERSPECTIVE"}, {"paperId": "e26eb167e9f22072b2f1b3f144bb3fd1e67759c9", "title": "A review of industrial big data for decision making in intelligent manufacturing"}, {"paperId": "f0f7b31c722dd8ece63ef156145a55a3efbe7b7a", "title": "English Web-Based Teaching Supervision Based on Intelligent Face Image Perception and Processing for IoT"}, {"paperId": "6095d3994645537f41dea4b86ad7eac748a16712", "title": "Big Data-Driven Digital Economic Industry Based on Innovation Path of Manufacturing"}, {"paperId": "202db67c3a0398e286bf134e38d5c99124fbc49c", "title": "Data-Driven Innovation: A Literature Review, Conceptual Framework, and Research Agenda"}, {"paperId": "144c884623827e0f8b3a00c826ca698429df7e30", "title": "Big data and dynamic capabilities in the digital revolution: The hidden role of source variety"}, {"paperId": "0a36b4b4e6a06d1b862ce452f13b7a42b079d2a2", "title": "Data Cooperatives as Catalysts for Collaboration, Data Sharing, and the (Trans)Formation of the Digital Commons"}, {"paperId": "95663a5e5a6495bb9be0c43104b8c4b6a5b5993e", "title": "Enhancing Customer Loyalty through Artificial Intelligence (AI), Internet of Things (IoT), and Big Data Technologies: Improving Customer Satisfaction, Engagement, Relationship, and Experience"}, {"paperId": "c9c369730a15f6cc29344670a27491b69532aa48", "title": "Exploring the black box of competitive advantage – An integrated bibliometric and chronological literature review approach"}, {"paperId": "86adfe3638e774f80376e137ec3367c3b3354b0b", "title": "Linking Digital Orientation and Data-Driven Innovations: A SAP–LAP Linkage Framework and Research Propositions"}, {"paperId": "1d23800bfae3870f3acd4a3abac8aa6d3f9fdd3c", "title": "Digital transformation of healthcare sector. What is impeding adoption and continued usage of technology-driven innovations by end-users?"}, {"paperId": "08c75f96c1afd89d4160b670de132c30cffc2412", "title": "Impact of blockchain-enabled analytics as a tool to revolutionize the banking industry"}, {"paperId": "24fe0e62841fcf3a80b120e696d076e4cca6d8c0", "title": "Impact of social media analytics on digital innovation"}, {"paperId": "daf32bd5cc03c0fa61cdba9b574aac056d4bf753", "title": "Impact of analytics on supply chain management"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "d7cc0015257bba726fbad0dad210932ebb773ec6", "title": "Machine Unlearning: Learning, Polluting, and Unlearning for Spam Email"}, {"paperId": "85bbb41e65006bd2651e492f73c391a4b3a81923", "title": "Building T-shaped professionals for mastering digital transformation"}]}
