{"paperId": "0e9ff048ae1efe0fb9656f230349f7f446bc13fd", "publicationVenue": null, "title": "Tastes Great! Less Filling! High Performance and Accurate Training Data Collection for Self-Driving Database Management Systems", "abstract": "A self-driving database management system (DBMS) aims to configure, deploy, and optimize almost all aspects of itself automatically without human intervention or guidance. Achieving this high level of automation relies on machine learning (ML) models that predict how a DBMS will behave in different scenarios. This behavior encompasses all DBMS runtime operations, including query execution and maintenance tasks. These ML-based behavior models for a self-driving DBMS require low-level training data about a DBMS's internals. Such training data includes (1) features that describe the workload, environment, and DBMS configuration, and (2) both DBMS- and hardware-level metrics. But it is difficult to collect training data from a DBMS while it is running because it can introduce performance and measurement degradations that hinder the ML models' ability to predict the DBMS's behavior correctly. We present the TScout (TS) framework for collecting training data from self-driving DBMSs. Our framework is an internal approach where developers annotate a DBMS's source code with hooks to monitor the system's behavior. TS then extracts these hooks and generates a kernel-level program (via Linux's BPF) that efficiently captures metrics from multiple sources (e.g., CPU performance counters, memory allocators). TS combines these metrics with internal DBMS state observations, generating training data for behavior models. We integrated TS in a PostgreSQL-compatible DBMS and measured its ability to collect training data for both OLTP and OLAP workloads. Our results show that TS generates training data for a deployed DBMS to train more accurate models than previous methods with only a 7% performance reduction.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "1453023356", "name": "Matthew Butrovich"}, {"authorId": "1384266964", "name": "Wan Shen Lim"}, {"authorId": "2115503336", "name": "Lin Ma"}, {"authorId": "1637393143", "name": "J. Rollinson"}, {"authorId": "2108310792", "name": "William Zhang"}, {"authorId": "112849763", "name": "Yuchong Xia"}, {"authorId": "1774210", "name": "Andrew Pavlo"}], "citations": [{"paperId": "81349e937986746baa6569b2b19f6f3091357ed0", "title": "Algorithmic Complexity Attacks on Dynamic Learned Indexes"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "af0f3465dcd52f369873312cbc09e144c0891ea6", "title": "Serving Deep Learning Models from Relational Databases"}, {"paperId": "fbd2ec1505de35ccceca9bf29c2746733cb09278", "title": "Database Gyms"}]}
