{"paperId": "0eb1ac5ff07c7b0d31d496e753224ab82e436c5f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "RBFNN Design Based on Modified Nearest Neighbor Clustering Algorithm for Path Tracking Control", "abstract": "Radial basis function neural networks are a widely used type of artificial neural network. The number and centers of basis functions directly affect the accuracy and speed of radial basis function neural networks. Many studies use supervised learning algorithms to obtain these parameters, but this leads to more parameters that need to be determined, thereby making the system more complex. This study proposes a modified nearest neighbor-based clustering algorithm for training radial basis function neural networks. The calculation of this clustering algorithm is not large, and it can adapt to varying densities. Furthermore, it does not require researchers to set parameters based on experience. Simulation proves that the clustering algorithm can effectively cluster samples and optimize the abnormal samples. The radial basis function neural network based on modified nearest neighbor-based clustering has higher accuracy in curve fitting than the conventional radial basis function neural network. Finally, the path tracking control based on a radial basis function neural network of a magnetic microrobot is investigated, and its effectiveness is verified through simulation. The test accuracy and training accuracy of the radial basis function neural network was improved by 23.5% and 7.5%, respectively.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2937360", "name": "Dongxi Zheng"}, {"authorId": "2056049983", "name": "W. Jung"}, {"authorId": "2118021407", "name": "Sunghoon Kim"}], "citations": [{"paperId": "33e4d4a35eb3537ccd6e653c40e55250030cf600", "title": "Thermographic fault diagnosis of electrical faults of commutator and induction motors"}, {"paperId": "7c7837341af0b05c0bceac186722eba7ad531b2f", "title": "A Feature Extraction Method Using VMD and Improved Envelope Spectrum Entropy for Rolling Bearing Fault Diagnosis"}, {"paperId": "8c5af27e92b8d28916be2fb919b3b07bd0f112f9", "title": "Estimation of Radial Basis Function Network Centers via Information Forces"}]}
