{"paperId": "0ec99ccdd4b55905403c6087a3d79f0890d7dba0", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Construction and Implementation of Innovation and Entrepreneurship Education System in Colleges and Universities in the Internet Era", "abstract": "\n This study focuses on Innovation and entrepreneurship education resources in colleges and universities, constructs a comprehensive innovation and entrepreneurship education system in colleges and universities through the application of Internet technology, and discusses its logical structure and implementation path in depth. Based on this System, an evaluation system for the quality of Innovation and entrepreneurship education in colleges and universities, which contains four primary indicators and 20 secondary indicators, is screened by expert survey method, and an evaluation model is constructed by combining entropy weight method and TOPSIS algorithm. By analyzing the data, this paper comprehensively assesses the development level of Innovation and entrepreneurship education in Chinese colleges and universities in each province. The results show that 2016 Beijing’s composite score was 0.577; by 2020, Guangdong’s composite score was raised to 0.737, significantly higher than that of other provinces. However, the 10-year average combined scores of Xinjiang, Tibet, Ningxia, and Qinghai in western China were lower than 0.07, highlighting the uneven development of university innovation and entrepreneurship education in the eastern and western regions. The findings of this study provide valuable references for the construction of Innovation and entrepreneurship education system in colleges and universities. They are of great practical significance in promoting the development of Innovation and entrepreneurship education in colleges and universities.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-01", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2289377023", "name": "Baozhen Li"}], "citations": []}
