{"paperId": "0eccb51c9b662e725a6a030971d319515afdc0ca", "publicationVenue": null, "title": "BigSR: real-time expressive RDF stream reasoning on modern Big Data platforms", "abstract": "Shifting from Big Data to Big Knowledge requires systems that are able to cope with the large volume and high-velocity dimensions in a scalable and inference-enabled manner. In this work, we are focusing on stream processing and reasoning using the graph-based RDF data model. We are aiming to explore the ability of modern distributed computing frameworks to process highly expressive knowledge inference queries over Big Data streams. To do so, we consider queries expressed as a positive fragment of a temporal logic framework based on Answer Set Programming and propose solutions to process such queries, based on the two main execution models adopted by major parallel and distributed execution frameworks: Bulk Synchronous Parallel (BSP) and Recordat-A-Time (RAT). We implement our solution named BigSR and conduct a series of experiments with 15 queries from 4 different datasets. Our experiments show that BigSR achieves high throughput beyond million-triples per second using a rather small cluster of machines.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "811-820"}, "authors": [{"authorId": "3464627", "name": "Xiangnan Ren"}, {"authorId": "2141773", "name": "Olivier Curé"}, {"authorId": "3045686", "name": "Hubert Naacke"}, {"authorId": "47490276", "name": "Guohui Xiao"}], "citations": [{"paperId": "eb518f48e9424884c99ac35f98f104f32c4037fc", "title": "ZodiacEdge: a Datalog Engine With Incremental Rule Set Maintenance"}, {"paperId": "b17716bafe30d11e6588b2cb5c08627d6b521fe1", "title": "Context-aware query derivation for IoT data streams with DIVIDE enabling privacy by design"}, {"paperId": "1885d5a5550729790cb98ab76bcf14d8e3f0f929", "title": "A Formal Comparison between Datalog-based Languages for Stream Reasoning"}, {"paperId": "7283fb3ce0e9a51e56e9768d7f6ca275c827b7b6", "title": "I-DLV-sr: A Stream Reasoning System based on I-DLV"}, {"paperId": "57bae65367a828ce46872bf316fcd7c5eca24152", "title": "DSCEP: An Infrastructure for Decentralized Semantic Complex Event Processing"}, {"paperId": "f2b70ccb3fe0b5e3325b5c0c42595098bf77c4ef", "title": "DSCEP: An Infrastructure for Distributed Semantic Complex Event Processing"}, {"paperId": "fe657e5d12b6508d779bc5bc19e12a234395227e", "title": "Gestion de méga-données : passage à l'échelle et qualité pour divers cas d'usage. (Scalability and quality of big data management applied to various use cases)"}]}
