{"paperId": "0ecf59e069d4f60f7ddecbe52b35e9a79f95412d", "publicationVenue": {"id": "7f03ba38-4bb4-41a3-a6d7-914c28f84272", "name": "Dependable Systems and Networks", "type": "conference", "alternate_names": ["DSN", "Dependable Syst Netw"], "url": "http://www.dsn.org/"}, "title": "IDTracker: Discovering Illicit Website Communities via Third-party Service IDs", "abstract": "Illicit websites are restricted by governments and application marketplaces due to their detrimental impact on society. Third-party web services play a crucial role in enabling illicit webmasters to establish websites rapidly and evade detection. In this paper, we discover that third-party services usually assign unique credentials to website developers as their identifications (IDs). Websites using the same services with identical IDs are likely to be hosted on shared infrastructures and have textually similar domain names. This observation sparks the idea of building a community of illicit websites by leveraging third-party service IDs. Therefore, we design IDTracker, a novel system for detecting illicit website communities based on domain name semantic and infrastructure relationship features, which empower classification algorithms to achieve a high F1 score of 0.8968. Furthermore, we deploy IDTracker on an Internet Service Provider's (ISP) environment for three months and identify 6,830 illicit communities containing 165,378 illicit websites. Many of these illicit websites can not be identified by the most sophisticated engines, such as Symantec and Baidu, because of the cloaking tactics. In addition, we conduct a large-scale and long-term measurement on the network infrastructures and third-party services of illicit communities, revealing new phenomena. Our findings can help security communities to thwart illicit websites more effectively.", "venue": "Dependable Systems and Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 53rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN)", "pages": "459-469"}, "authors": [{"authorId": "2174159125", "name": "Chenxu Wang"}, {"authorId": "2181528118", "name": "Zhao Li"}, {"authorId": "2111612710", "name": "Jiang Yin"}, {"authorId": "2230047885", "name": "Zhenni Liu"}, {"authorId": "2118750402", "name": "Zhongyi Zhang"}, {"authorId": "48873848", "name": "Qingyun Liu"}], "citations": []}
