{"paperId": "0ed175d0e4eaa7c488b7ce9f0317416682d18d3a", "publicationVenue": {"id": "165fa1b5-e07f-4b6e-9203-04493f6a7c5c", "name": "Frontiers in Big Data", "alternate_names": ["Front Big Data"], "issn": "2624-909X", "url": "https://www.frontiersin.org/journals/big-data"}, "title": "Tuning of Elasticsearch Configuration: Parameter Optimization Through Simultaneous Perturbation Stochastic Approximation", "abstract": "Elasticsearch is currently the most popular search engine for full-text database management systems. By default, its configuration does not change while it receives data. However, when Elasticsearch stores a large amount of data over time, the default configuration becomes an obstacle to improving performance. In addition, the servers that host Elasticsearch may have limited resources, such as internal memory and CPU. A general solution to these problems is to dynamically tune the configuration parameters of Elasticsearch in order to improve its performance. The sheer number of parameters involved in this configuration makes it a complex task. In this work, we apply the Simultaneous Perturbation Stochastic Approximation method for optimizing Elasticsearch with multiple unknown parameters. Using this algorithm, our implementation optimizes the Elasticsearch configuration parameters by observing the performance and automatically changing the configuration to improve performance. The proposed solution makes it possible to change the configuration parameters of Elasticsearch automatically without having to restart the currently running instance of Elasticsearch. The results show a higher than 40% improvement in the combined data insertion capacity and the system's response time.", "venue": "Frontiers in Big Data", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-11", "journal": {"name": "Frontiers in Big Data", "volume": "5"}, "authors": [{"authorId": "2020945", "name": "H. Haugerud"}, {"authorId": "2164771933", "name": "Mohamad Sobhie"}, {"authorId": "145191958", "name": "A. Yazidi"}], "citations": [{"paperId": "1f73fef8a64d3f5d53c34f751f937398faa098a0", "title": "Research on Dynamic Expansion Method of Multi Source Log Index"}, {"paperId": "ea6bc2c6165c2ae36dfa5949e72b5ae361013bbe", "title": "Determining a consistent experimental setup for benchmarking and optimizing databases"}, {"paperId": "fc7a2297b0f8fe49b90cbf71e70be21c07f5d432", "title": "Performance Analysis of Shard Selection Techniques on Elasticsearch"}]}
