{"paperId": "0ed3d4c2ff2e320b1237c591d6789ac2e4f4c32a", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "MOBILE MAPPING SOLUTIONS FOR THE UPDATE AND MANAGEMENT OF TRAFFIC SIGNS IN A ROAD CADASTRE FREE OPEN-SOURCE GIS ARCHITECTURE", "abstract": "Abstract. The adoption of open-source mobile mapping applications in public administration has risen over the last decade due to their interdisciplinary vocation and flexibility in adapting to existing Geographic Information System (GIS) software architectures. This facilitates complex procedures of data collection and management required for transportation and environmental models, emergency management, and maintenance operations. The Ministry of Infrastructure and Transport in Italy requires road-owning agencies to build and maintain a mapping inventory of their road networks, including georeferenced information about streets and ancillary elements, such as traffic signs. Innovative and integrated street-level approaches for the rapid mapping of road entities using open-source mobile mapping tools represent a valuable low-cost solution for the periodical update of road entities inventory. The adoption of these tools allows public administrators to easily consult the road inventory even outside the office, conducting in situ validation and quality evaluation. This work presents a case study focused on the update and management of traffic sign entities of the Road Cadastre of the Province of Piacenza (Italy) using Qfield and Open Data Kit (ODK) Collect as alternatives to the previous traditional survey method that consisted in the use of field papers. A comparison between the adoption of the two mobile apps is conducted, identifying benefits and limitations in terms of both data accuracy and usability. Validation scripts, project and form structure were developed with the perspective of making the entire workflow as reproducible and transparent as possible, sharing details in a dedicated GitHub repository.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-22", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "91451433", "name": "F. Gaspari"}, {"authorId": "2207809192", "name": "F. Barbieri"}, {"authorId": "2221936080", "name": "I. Demnati"}, {"authorId": "2055906424", "name": "F. Ioli"}, {"authorId": "2052724856", "name": "L. Pinto"}, {"authorId": "2221946673", "name": "V. Toscani"}], "citations": []}
