{"paperId": "0ed437f1f60aa4fec3c0b82fb7771f22521add47", "publicationVenue": {"id": "d30920e9-8883-40c5-a696-056dac43b395", "name": "International Journal of Knowledge and Systems Science", "type": "journal", "alternate_names": ["Int J Knowl Syst Sci"], "issn": "1947-8208", "url": "http://www.igi-global.com/IJKSS", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-knowledge-systems-science/1169"]}, "title": "Role of Educational Data Mining in Student Learning Processes With Sentiment Analysis: A Survey", "abstract": "Educational data mining is a research field that is used to enhance education system. Research studies using educational data mining are in increase because of the knowledge acquired for decision making to enhance the education process by the information retrieved by machine learning processes. Sentiment analysis is one of the most involved research fields of data mining in natural language processing, web mining, and text mining. It plays a vital role in many areas such as management sciences and social sciences, including education. In education, investigating students' opinions, emotions using techniques of sentiment analysis can understand the students' feelings that students experience in academic, personal, and societal environments. This investigation with sentiment analysis helps the academicians and other stakeholders to understand their motive on education is online. This article intends to explore different theories on education, students' learning process, and to study different approaches of sentiment analysis academics.", "venue": "International Journal of Knowledge and Systems Science", "year": 2020, "fieldsOfStudy": ["Psychology", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-10-01", "journal": {"name": "Int. J. Knowl. Syst. Sci.", "pages": "31-44", "volume": "11"}, "authors": [{"authorId": "2286848751", "name": "Amala Jayanthi M."}, {"authorId": "2185704583", "name": "E. Shanthi I"}], "citations": [{"paperId": "8e9eb90e37022117f81390b61d4c9868128f6e7a", "title": "Sentiment Analysis: Current State and Future Research Perspectives"}, {"paperId": "e58632a6980fb282b9ebb0edd6ae2b7ec61aadcf", "title": "Enhancing the Performance of Educational Systems using Efficient Opinion Mining Techniques"}, {"paperId": "14163ce29b0300123c967e5299ac6397c49390b8", "title": "Behavioral Web Tracking in e-Learning: An Educational Process Mining Application"}, {"paperId": "8bcf6275f7be0d55d75896432c565f4a3073bbb7", "title": "Reclust: an efficient clustering algorithm for mixed data based on reclustering and cluster validation"}, {"paperId": "739745096dd46f46b13f7eb8de9868e38cd92c59", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "e70d4a1e270eb112d04e2c91866df6193c7dcfce", "title": "Educational Data Mining Applied For Predicting Students‘ ICT Literacy"}, {"paperId": "e416b2bf22452f3619ab77435496d4c3bf1860fe", "title": "Sentiment Analysis in Online Learning Environment: A Systematic Review"}]}
