{"paperId": "0ef280ccaafc5cd0469ada98a01d4cccb0b391ec", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Investigating Patterns of UAV Attacks for Building Secure UAV Network", "abstract": "Unmanned Aerial Vehicles are remotely handled for fulfilling tasks like photojournalism, security, rescue efforts, and even package deliveries. These gadgets have a variety of sensors and cameras that enable them to gather data and provide real-time images to their administrators. These devices are vulnerable to cyber-attacks that can lead to hacking of devices, resulting in data theft, identity theft and spoofing. Important information carried by unmanned aerial vehicle devices can be intercepted by unauthorized users to destroy the network transmission. This research paper performs an experimental study on generating traffic patterns of unmanned aerial vehicle communication for cyber-attacks. The unmanned aerial vehicle traffic pattern is compared in global positioning system jamming and spoofing attacks for analyzing battery state, system power, logger status and computational load. The achieved results indicate the critical parameters of the network that are to be considered while framing security policies for unmanned aerial vehicle communication.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-14", "journal": {"name": "2023 6th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "136-141", "volume": "6"}, "authors": [{"authorId": "153494643", "name": "Ishu Sharma"}, {"authorId": "147220896", "name": "Keshav Kaushik"}, {"authorId": "39042396", "name": "Gunjan Chhabra"}], "citations": []}
