{"paperId": "0efc09978d45bfd35cb6ef60ac88d11a443ba2e1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models for Spatial Trajectory Patterns Mining", "abstract": "Identifying anomalous human spatial trajectory patterns can indicate dynamic changes in mobility behavior with applications in domains like infectious disease monitoring and elderly care. Recent advancements in large language models (LLMs) have demonstrated their ability to reason in a manner akin to humans. This presents significant potential for analyzing temporal patterns in human mobility. In this paper, we conduct empirical studies to assess the capabilities of leading LLMs like GPT-4 and Claude-2 in detecting anomalous behaviors from mobility data, by comparing to specialized methods. Our key findings demonstrate that LLMs can attain reasonable anomaly detection performance even without any specific cues. In addition, providing contextual clues about potential irregularities could further enhances their prediction efficacy. Moreover, LLMs can provide reasonable explanations for their judgments, thereby improving transparency. Our work provides insights on the strengths and limitations of LLMs for human spatial trajectory analysis.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-07", "journal": {"name": "ArXiv", "volume": "abs/2310.04942"}, "authors": [{"authorId": "2021011947", "name": "Zhengwu Zhang"}, {"authorId": "2257001744", "name": "Hossein Amiri"}, {"authorId": "2257092631", "name": "Zhenke Liu"}, {"authorId": "2260654252", "name": "A. Züfle"}, {"authorId": "2257314969", "name": "Liang Zhao"}], "citations": [{"paperId": "bf64e04ad6015fd623e64784f728eeb4cc8104b6", "title": "Where to Move Next: Zero-shot Generalization of LLMs for Next POI Recommendation"}, {"paperId": "13df472c3fe81bf1b615238fbd7884c8b45d8d1c", "title": "Large Language Models for Time Series: A Survey"}, {"paperId": "8e1c0a78a26a59cbe4ac82f13d9d01017a9bcb73", "title": "Towards Urban General Intelligence: A Review and Outlook of Urban Foundation Models"}]}
