{"paperId": "0f01335dfae95b3253a14b5b3977252ec54ad3ca", "publicationVenue": null, "title": "A Review on Data locality in Hadoop MapReduce", "abstract": "MapReduce has emerged as a strong model for processing parallel and distributed data for huge datasets. Hadoop an open source implementation of MapReduce has approved MapReduce widely. Hadoop fragments the input file into number of data blocks to allocate them to various DataNodes in cluster. Hadoop must provide effective scheduling to process these data blocks in efficient way. One of the issues that play vital role in efficient processing of MapReduce is Data Locality which is caused due to overhead of network. Data locality is equipped for moving the computation adjacent to the data where it dwells. It is a key resource in distributed environment which influences the tasks accomplishing time. The issues which troubles data locality are cluster and network load, resource sharing, cluster environment, size of data blocks, number of mappers and reducers. This paper aims to review various algorithms that are aware of data locality in scheduling, along with their strengths and weaknesses.", "venue": "2018 Fifth International Conference on Parallel, Distributed and Grid Computing (PDGC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-12-01", "journal": {"name": "2018 Fifth International Conference on Parallel, Distributed and Grid Computing (PDGC)", "pages": "723-728"}, "authors": [{"authorId": "153888084", "name": "Anil Sharma"}, {"authorId": "143611240", "name": "Gurwinder Singh"}], "citations": [{"paperId": "6d54ff24a06a462bfd70a0e301ecca315a644050", "title": "Locality-Aware Scheduling for Scalable Heterogeneous Environments"}, {"paperId": "31001719434e2971a9c583d094b3edcef5b4a57b", "title": "An Overview of Data Locality Based Scheduler in Hadoop MapReduce Environment"}, {"paperId": "ae219c00dc21047ba9b1f5a04c1cf05303c36b20", "title": "A Framework to define optimized Shuffling process to reduce data transfer latency: MapReduce in Serverless Infrastructure"}, {"paperId": "6ca29d54020c36afc7ef0557e192b647b37fb25e", "title": "Scaling of Hadoop Cluster for Cost-Effective Processing of MapReduce Applications"}]}
