{"paperId": "0f27743642306b8566d3682696d871f13d334c28", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Blockchain Technology Toward Green IoT: Opportunities and Challenges", "abstract": "In recent decades, the dramatic increase in global industrial activity has resulted in a significant rise in the use of fossil fuel energy resources, while technological progress has increased the carbon footprint and hence global warming. The significant increase in energy consumption caused by the Internet of Things (IoT) technology has created a new challenge and diverted our focus toward creating a more eco-friendly IoT ecosystem. The green IoT is an emerging field that has attracted a great deal of attention from researchers and industries, as it provides energy efficient services and enables the production and use of renewable energy. Meanwhile, blockchain technology has become a highly adoptable technology in the IoT and is attracting considerable interest from energy supply companies, business start-ups, financial institutions, governments and researchers. This study focuses on the role of the emerging blockchain technology in the green IoT ecosystem, presents the crucial factors that need to be taken into consideration in order to build a green IoT ecosystem, and discusses how blockchain technology contributes to make the IoT ecosystem greener. It also presents the open issues and future research directions to be considered when creating a sustainable green IoT ecosystem using blockchain technology.", "venue": "IEEE Network", "year": 2020, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-03", "journal": {"name": "IEEE Network", "pages": "263-269", "volume": "34"}, "authors": [{"authorId": "9198774", "name": "P. Sharma"}, {"authorId": "144996075", "name": "Neeraj Kumar"}, {"authorId": "2109283285", "name": "J. Park"}], "citations": [{"paperId": "f05769699c45e7611f5eb9fc879c21f8e53f3887", "title": "Blockchain technology for society 4.0: a comprehensive review of key applications, requirement analysis, research trends, challenges and future avenues"}, {"paperId": "ca6750637695152b225ff670c6d19962d4115e55", "title": "Deep practice of internet of things image recognition technology based on deep learning in intelligent financial supervision system"}, {"paperId": "8fb287ae3ea21d78cad5235105e724acaef665a5", "title": "Tools, techniques, and trends in sustainable software engineering: A critical review of current practices and future directions"}, {"paperId": "a3ec78501af1cd22918305ebfb5b47f38086f9ea", "title": "Exploring the fusion of greening and digitalization for sustainability"}, {"paperId": "8d075b90d355392de8113327c07f9a3ee28fac91", "title": "Green fintech: Developing a research agenda"}, {"paperId": "e882b5c6658967b1196359bb30f5bb8d493529f5", "title": "Environment Safe Biodegradable Green RFID for Green Internet of Things"}, {"paperId": "f67fe5a92f9c73e83679d43f6d7309e75d05da7f", "title": "A survey on IoT trust model frameworks"}, {"paperId": "9eb4e9eee2d1913cd76c974a239c8817f1530df4", "title": "Can We Run Our Ethereum Nodes at Home?"}, {"paperId": "5366706c2ac55317ecbb8f61ae2d535841125b15", "title": "Green FinTech Innovation as a Future Research Direction: A Bibliometric Analysis on Green Finance and FinTech"}, {"paperId": "8dc339486845a9f170c1fb312d29fee2b3d0f36e", "title": "BENIGREEN: Blockchain-Based Energy-Efficient Privacy-Preserving Scheme for Green IoT"}, {"paperId": "063fc22351681794a63ffb629ddbf623eda39356", "title": "Applying Blockchain Technology and the Internet of Things to Improve the Data Reliability for Livestock Insurance"}, {"paperId": "c4909bc9960cbe3e3be2c9c05617471a09a82df5", "title": "Internet of things in food processing and its potential in industry 4.0 era: A review"}, {"paperId": "cac866a801563ca7c1cf1c0543d08ae1f6d78c34", "title": "Internet of Things (IoT) in solar energy: a bibliometrics analysis and global publications trends"}, {"paperId": "5e4ba78d36c792c198ba955f13920d8e407754df", "title": "State-of-the-Art Research in Blockchain of Things for HealthCare"}, {"paperId": "ef0225e3e6e0e686cd2162ed331ce5a34ed1627d", "title": "The Applications, Opportunities and Challenges of IoT in Supply Chain Management: Insights from Literature Review"}, {"paperId": "3827069ab479762fbbf28868da7a72900eac85c9", "title": "Towards Improving Green Technologies Education: The Role of the ACM/IEEE/AAAI Model Curricula"}, {"paperId": "fe179ac62c1b3cc993511bcba512c35a7425ba29", "title": "A value-based approach to the adoption of cryptocurrencies"}, {"paperId": "6e95c536976688bfa2c73488464e4836eeb13247", "title": "Involvement of Local Authorities in the Protection of Residents’ Health in the Light of the Smart City Concept on the Example of Polish Cities"}, {"paperId": "a43a0813514ecb0f3bd0bd86d598c780a06e8ded", "title": "Sustainable Secure Internet of Things (SS-IoT)"}, {"paperId": "7b00fca7af5151eed6322850b39a9cba57fb7b1a", "title": "A security testing mechanism for detecting attacks in distributed software applications using blockchain"}, {"paperId": "059b86654d3c8f45cd9f1790dd73a0132ce0b586", "title": "Sustainable Internet of Things (S-IoT) with 5G Smart Antennas for Smart Media Data Services"}, {"paperId": "e376567455d286ab348e701a5b058c409c5cc2f0", "title": "Blockchain Changing the Outlook of the Sustainable Food Supply Chain to Achieve Net Zero?"}, {"paperId": "b5e002de7f073c5bb6b027f7e5bb4bb05b0dd3e3", "title": "Blockchain Systems in Embedded Internet of Things: Systematic Literature Review, Challenges Analysis, and Future Direction Suggestions"}, {"paperId": "b5d1c5574b7f74f8820ac5766a86f59ea9cb5d53", "title": "Blockchain Technology Implementation in the Energy Sector: Comprehensive Literature Review and Mapping"}, {"paperId": "d53ffa2f550b3b8c4880b7dbf9bbfb61ffaf8037", "title": "The Transition Toward Merging Big Data Analytics, IoT, and Artificial Intelligence with Blockchain in Transactive Energy Markets"}, {"paperId": "53de064b9bb0ee76f68970d3f0807fad7baba65b", "title": "Service-Based Wireless Energy Crowdsourcing"}, {"paperId": "1c3d0837d223d8f0dd6a61344bf5a0e6a2e7be65", "title": "Potential Requirements and Opportunities of Blockchain-Based Industrial IoT in Supply Chain: A Survey"}, {"paperId": "16881c16c3ab2e82d1d6018e0ce414b15f364ccc", "title": "A review of Blockchain Technology applications for financial services"}, {"paperId": "d40e45036033d82ac9ccbd6a331d73bec7f77b6a", "title": "Efficient Blockchain Scheme for IoT Data Storage and Manipulation in Smart City Environment"}, {"paperId": "f907e64ab4459e48480a0fcf64e8cc89756af840", "title": "An HTTP Anomaly Detection Architecture Based on the Internet of Intelligence"}, {"paperId": "a05892c016608fb3d773b8f6de877da37a271aad", "title": "When SDN and blockchain shake hands"}, {"paperId": "985bcd754beddcbb765aed9a7bc77df82d1bede1", "title": "NCCLA: new caledonian crow learning algorithm based cluster head selection for Internet of Things in smart cities"}, {"paperId": "c002183b52aa9b49e28e44db9e6cafd3f4a0665d", "title": "Recent advances in green technology and Industrial Revolution 4.0 for a sustainable future"}, {"paperId": "457936b10ccc1aa286166badd829cf9c3b8415dd", "title": "Deployment of Interpretive Structural Modeling in Barriers to Industry 4.0: A Case of Small and Medium Enterprises"}, {"paperId": "27c91a4cbc9f3bbdf8cd162165e778e13342f8d1", "title": "Climate change and COP26: Are digital technologies and information management part of the problem or the solution? An editorial reflection and call to action"}, {"paperId": "40672019ad9d9a0064918a995bd685b411983041", "title": "Blockchain Technology as a Game Changer for Green Innovation: Green Entrepreneurship as a Roadmap to Green Economic Sustainability in Peru"}, {"paperId": "904fc97282d1fdfc35657215d08f00efbe71f7a6", "title": "An Electronic Contract Management System Based on Blockchain A case study of technology framework with improved algorithms"}, {"paperId": "5852deac946886b659244128ca9a3bef6a29907e", "title": "Blockchain Technology on Smart Grid, Energy Trading, and Big Data: Security Issues, Challenges, and Recommendations"}, {"paperId": "b0cdccd09a423e6ac295bf93573eb49f2cb8df03", "title": "Investigation of the current usage of BIM capabilities by large-sized building contractors in Kenya based on theory of innovation diffusion"}, {"paperId": "5b19e2b9be33fa73ce38bd188a954fe09dd94b89", "title": "The cyber-consciousness of environmental assessment: how environmental assessments evaluate the impacts of smart, connected, and digital technology"}, {"paperId": "6502e646b5be0db1f0b265a39052a0aa2071e4de", "title": "Is blockchain able to enhance environmental sustainability? A systematic review and research agenda from the perspective of Sustainable Development Goals (SDGs)"}, {"paperId": "2db995f2f659eeb24456a44f630af3637b6e744a", "title": "Intelligent energy management: Evolving developments, current challenges, and research directions for sustainable future"}, {"paperId": "bb8215357804516fc2488c2e1268b2d9bb854168", "title": "Architectures for Blockchain‐IoT Integration\n 1"}, {"paperId": "ace5d926b17dc1e4d12de21c9765b8e9af5cda1e", "title": "Green IoT and Edge AI as Key Technological Enablers for a Sustainable Digital Transition towards a Smart Circular Economy: An Industry 5.0 Use Case"}, {"paperId": "e3b2ec666726cbf86787be1272570fa174487dcf", "title": "Battery lifetime estimation for energy efficient telecommunication networks in smart cities"}, {"paperId": "7b5520cb6447ef7a90b9d8ca7eba9ad0d31112c4", "title": "Blockchain Technology, Its Applications and Open Research Challenges"}, {"paperId": "8299412376e93cd8d335fdb76d506ca7a617f845", "title": "Framework for determining the suitability of blockchain: Criteria and issues to consider"}, {"paperId": "c0d606232d8d7f5350d6002a6ccfce5a36e1a43c", "title": "Energy Management for Internet of Things via Distributed Systems"}, {"paperId": "78c86624188ec26e2a85d6793da70e2c4cee46e4", "title": "Blockchain based solutions to secure IoT: Background, integration trends and a way forward"}, {"paperId": "059a4d3ccc0e3baa06597494b7e5d9dcbdfde1b6", "title": "A Review: Evolution of Technology towards Green IT"}, {"paperId": "a1cdb81de39f32a8a0f51b33a84c13bbf0f18a4a", "title": "A Survey on the Adoption of Blockchain in IoT: Challenges and Solutions"}, {"paperId": "5dbd7b58294b49a1b04f19db9fbc5a16ccf0ce6f", "title": "Blockchain technology for energy‐aware mobile crowd sensing approaches in Internet of Things"}, {"paperId": "8511fe08d48cbbda27f088622f137446f50ff5c9", "title": "Green Internet of Things: The Next Generation Energy Efficient Internet of Things"}, {"paperId": "9a9178f1b39bde8c91d4b860381003ab4dabe408", "title": "Green Internet of Things for a Better World"}, {"paperId": "8fd2e619318bf081e5bdad5cda9001b94d3efcba", "title": "An Improved Blockchain-Based Authentication Protocol for IoT Network Management"}, {"paperId": "ba0bdd244e57f941be9d190e5a8d46785d7e2e1a", "title": "Blockchain and federated learning-based distributed computing defence framework for sustainable society"}, {"paperId": "007bd07254d7968684b89d99fdc83388945efa8a", "title": "Blockchain for precision irrigation: Opportunities and challenges"}, {"paperId": "7a5b83e86384eef4eb9285032d1ee6761473ba42", "title": "Blockchain for the Internet of Vehicles Towards Intelligent Transportation Systems: A Survey"}, {"paperId": "c7b4db7b061f8915f95faae9cdbb101d8b8031bd", "title": "A Survey of State-of-the-Art on Blockchains"}, {"paperId": "b08560d1e197b445f99096a40fe8989f39fe7933", "title": "An Investigation of Energy Consumption in Fused Deposition Modelling using ESP32 IoT Monitoring System"}, {"paperId": "a53658ef46fe21be5cfd5dfe25d2cd4802c6928d", "title": "Blockchain Asset Lifecycle Management for Visual Content Tracking"}, {"paperId": "d4c822021a8cdab4ddf5482ce5a1cf6f1d66543c", "title": "An Updated Survey on the Convergence of Distributed Ledger Technology and Artificial Intelligence: Current State, Major Challenges and Future Direction"}, {"paperId": "0b8d71d39fbef98566d5f76326c3071392a8508a", "title": "Blockchain System Defensive Overview for Double-Spend and Selfish Mining Attacks: A Systematic Approach"}, {"paperId": "1b4f1028473ac7b1d6ea2645733d905bc6a5c4b5", "title": "Social and Economic Contribution of 5G and Blockchain With Green Computing: Taxonomy, Challenges, and Opportunities"}]}
