{"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "publicationVenue": {"id": "8f125553-3fd5-4370-a175-f7179db29048", "name": "IEEE International Performance, Computing, and Communications Conference", "type": "conference", "alternate_names": ["International Phoenix Conference on Computers and Communications", "IPCCC", "Int Phoenix Conf Comput Commun", "International Performance, Computing, and Communications Conference", "Int Perform Comput Commun Conf", "IEEE Int Perform Comput Commun Conf"], "url": "http://www.ipccc.org/"}, "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics", "abstract": "Selecting the right resources for big data analytics jobs is hard because of the wide variety of configuration options like machine type and cluster size. As poor choices can have a significant impact on resource efficiency, cost, and energy usage, automated approaches are gaining popularity. Most existing methods rely on profiling recurring workloads to find near-optimal solutions over time. Due to the cold-start problem, this often leads to lengthy and costly profiling phases. However, big data analytics jobs across users can share many common properties: they often operate on similar infrastructure, using similar algorithms implemented in similar frameworks. The potential in sharing aggregated profiling runs to collaboratively address the cold start problem is largely unexplored. We present Karasu, an approach to more efficient resource configuration profiling that promotes data sharing among users working with similar infrastructures, frameworks, algorithms, or datasets. Karasu trains lightweight performance models using aggregated runtime information of collaborators and combines them into an ensemble method to exploit inherent knowledge of the configuration search space. Moreover, Karasu allows the optimization of multiple objectives simultaneously. Our evaluation is based on performance data from diverse workload executions in a public cloud environment. We show that Karasu is able to significantly boost existing methods in terms of performance, search time, and cost, even when few comparable profiling runs are available that share only partial common characteristics with the target job.", "venue": "IEEE International Performance, Computing, and Communications Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-22", "journal": {"name": "ArXiv", "volume": "abs/2308.11792"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2077225987", "name": "Philipp Wiesner"}, {"authorId": "1796288253", "name": "Thorsten Wittkopp"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}]}
