{"paperId": "0f4fd5beac28d608669cfcc2277285273b7cd416", "publicationVenue": {"id": "777933d7-0e69-495f-8bab-0b79f7d931dc", "name": "Q2S and Security for Wireless and Mobile Networks", "type": "conference", "alternate_names": ["Q2SWinet", "Q2S Secur Wirel Mob Netw"]}, "title": "Classification of Botnet Attacks in IoT Using a Convolutional Neural Network", "abstract": "Detecting malicious attacks on Internet of Things (IoT) devices is a current research trend due to the rise of Botnet attacks across different IoT environments and the lack of standardization in IoT's security field. To tackle these issues, deep learning techniques are a promising strategy to detect and prevent attacks on IoT ecosystems. Most proposals are only concerned with detecting the occurrence of the attack, but classifying its type could be an important additional step. This work proposes a Convolutional Neural Network (CNN) model that can be employed to classify the type of the attack after a proper botnet detection evaluated with N-BaIoT and Bot-IoT datasets. The model achieved a 98% of F1-score and accuracy on N-BaIoT and 100% of F1-score and accuracy on Bot-IoT. Moreover, our model was also compared with recent literature results, including Naive Bayes (NB) and KNN (K-Nearest Neighbours). The work also evaluates the time interval spent on classification tasks, which is an important feature to consider when implementing solutions in edge computing environments.", "venue": "Q2S and Security for Wireless and Mobile Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-10-24", "journal": {"name": "Proceedings of the 18th ACM International Symposium on QoS and Security for Wireless and Mobile Networks"}, "authors": [{"authorId": "2188151911", "name": "Andressa A. Cunha"}, {"authorId": "144003154", "name": "João B. Borges Neto"}, {"authorId": "1757448", "name": "A. Loureiro"}], "citations": [{"paperId": "575b035f3de076d4df4fcac540d0c966c147ebea", "title": "An Approach for Detection of Botnet Based on Machine Learning Classifier"}, {"paperId": "296b2cec28211039e3ee00dd02757c456f5f7241", "title": "TL-BILSTM IoT: transfer learning model for prediction of intrusion detection system in IoT environment"}, {"paperId": "69b9dba6b763615157969a404a8f4813a1af4d5b", "title": "An Explainable Intrusion Detection System for IoT Networks"}, {"paperId": "0e823694946b4cfab9b30946c1634892ac836c58", "title": "Artificial Neural Network for Binary and Multiclassification of Network Attacks"}]}
