{"paperId": "0f55a9af989199040b49d7b4294ce7aabcd05f5e", "publicationVenue": {"id": "983fd916-c977-4314-840b-3fdd258647fe", "name": "International Journal of Energy Research", "type": "journal", "alternate_names": ["Int J Energy Res"], "issn": "0363-907X", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/3343", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1099114X", "http://interscience.wiley.com/jpages/0363-907X", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-114X"]}, "title": "Comparative evaluation of artificial neural networks for the performance prediction of Pt‐based catalysts in water gas shift reaction", "abstract": "Artificial neural networks (ANNs) methods have recently been used for modeling and predicting catalysis, which has been conventionally described using reaction kinetics. ANNs‐based techniques for analyzing complex catalytic systems have shown a high level of accuracy and dependability. In contrast, there is still a lack of strategies to select an appropriate ANNs algorithm according to size and quality of data, the complexity of the reaction, and catalyst characteristics. In this study, four different ANNs were proposed for the performance prediction of Pt‐based catalysts in water gas shift reaction: multilayer perceptron, long short‐term memory, recurrent neural network, and gated recurrent unit. By identifying the optimal ANN structure such as training/testing dataset ratio, topology, and epochs, the capability of the ANNs is comparatively evaluated in terms of prediction accuracy, computational load, and the quantity of required data for model training. As a case study, the effect of types and contents of promoters and supports in Pt‐based catalysts on CO conversion was analyzed. As a result, it was revealed that the multilayer perceptron model shows better performance than the others with the highest accuracy (mean square error = 0.0068) and lowest computation time. In addition, it was identified using the multiplayer perceptron model that Pt/Ca/TiO2 of 10 wt% Ca is the most favorable catalyst by achieving CO conversion over 90% at an operating temperature of 300°C.", "venue": "International Journal of Energy Research", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-14", "journal": {"name": "International Journal of Energy Research", "pages": "9602 - 9620", "volume": "46"}, "authors": [{"authorId": "2118272419", "name": "Chang-Seob Kim"}, {"authorId": "2116411951", "name": "Jiyong Kim"}], "citations": [{"paperId": "8f607c45a9d5a7c27fba3ebce070d3fd5446bb28", "title": "Mechanisms in the Catalytic Reduction of N2O by CO over the M13@Cu42 Clusters of Aromatic-like Inorganic and Metal Compounds"}, {"paperId": "690f94aed2333f46a1fea3e29af85abaeee84a78", "title": "Early-Stage Evaluation of Catalyst Using Machine Learning Based Modeling and Simulation of Catalytic Systems: Hydrogen Production via Water–Gas Shift over Pt Catalysts"}, {"paperId": "b805444061b5f0f99cb514731ca9672ddc1918f5", "title": "Machine learning‐based high‐throughput screening, strategical design and knowledge extraction of Pt/CexZr1−xO2 catalysts for water gas shift reaction"}, {"paperId": "cebfe26f3a33bb230a46c984f5ac0b8158eccc77", "title": "Heterostructure catalyst of Cu-Y2O3 supported on Cu2Y2O5 perovskite in solar-driven water gas shift reaction"}]}
