{"paperId": "0f660e8a483324e8975be39edf76325d41b13200", "publicationVenue": {"id": "7fe84005-586f-4604-98ee-fa60fe8ae618", "name": "Journal of Clinical Medicine", "type": "journal", "alternate_names": ["J Clin Med"], "issn": "2077-0383", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321173", "alternate_urls": ["https://www.mdpi.com/journal/jcm", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321173"]}, "title": "Comparison of the Persistence of Anti-TNF Agents and Ustekinumab in Patients with Crohn’s Disease: A Study Based on the Korean National Database", "abstract": "Background: Biologics play an important role in the treatment of moderate to severe Crohn’s disease (CD). Ustekinumab was approved for such patients in the Republic of Korea on 1 December 2018. Therefore, we need to compare the efficacy of ustekinumab and anti-TNF inhibitors. Methods: We compared one-year persistence rates between anti-TNF inhibitors and ustekinumab in moderate-to-severe CD patients using Korean National Health Insurance Service data from 1 December 2016 to 30 November 2021. We also analysed the risk factors for the non-persistence of biologics. Results: The one-year persistence rates with index therapy in bio-naïve and bio-experienced patients were 87.7% and 69.7% for infliximab (p < 0.001), 85.1% and 72.8% for adalimumab (p < 0.001), and 92.1% and 89.8% for ustekinumab (p = 0.333), respectively. The risk factors for non-persistence were older age, non-use of an immune modulator, and previous biologic exposure in both the infliximab and adalimumab groups. The one-year persistence rate of ustekinumab was higher than that of anti-TNF inhibitors in bio-naïve patients (hazard ratio [HR] 0.53; 95% confidence interval [CI] 0.35–0.81; p = 0.003) and bio-experienced patients (HR 0.32; 95% CI 0.22–0.45; p < 0.001). Conclusions: Ustekinumab was superior in bio-naïve CD patients compared to anti-TNF inhibitors. However, the follow-up time was relatively short; further studies should continuously collect and analyse data.", "venue": "Journal of Clinical Medicine", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "Journal of Clinical Medicine", "volume": "12"}, "authors": [{"authorId": "6565064", "name": "G. Seo"}, {"authorId": "2355648", "name": "S. Jung"}], "citations": []}
