{"paperId": "0fa2bcb7e498047e85c79107683c32ae14f265b9", "publicationVenue": {"id": "7a19500a-c8f6-4284-9b2d-08dc2d492c9a", "name": "Journal of Industrial Ecology", "type": "journal", "alternate_names": ["J Ind Ecol"], "issn": "1088-1980", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1530-9290"}, "title": "A data framework for assessing social inequality and equity in multi‐sector social, ecological, infrastructural urban systems: Focus on fine‐spatial scales", "abstract": "Cities are increasingly advancing multiple societal goals related to environmental sustainability, health, well‐being, and equity. However, there are few comprehensive data sets that address social inequality and equity across multiple infrastructure sectors, determinants, and outcomes, particularly at fine intra‐urban spatial scales. This paper: (1) Offers an overarching conceptualization of inequality and equity in multi‐sector urban systems; (2) Introduces a broad data framework to assess inequality and equity across social (S), ecological (E), infrastructural (I), and urban (U) form determinants (SEIU) and environment (E), health (H), well‐being (W), and economy and security (E) outcomes (EHWE), identifying a universe of >110 SEIU–EHWE data layers (variables) of interest; (3) Provides an illustrative data case study of a US city that synthesizes publicly available sources of the associated SEIU–EHWE data attributes, noting their availability/gaps at fine spatial scales, important to inform social inequality; (4) Discusses analytic methods to quantify inequality and spatial correlates across SEIU determinants and EHWE outcomes; and, (5) Demonstrates several use‐cases of the data framework and companion analytic methods through real‐world applied case studies that inform equity planning in applications ranging from energy sector investments to air pollution and health. The US data case study reveals data availability (covering 41 of the 113 data layers) as well as major gaps associated with EHWE outcomes at fine spatial scales, while the application examples demonstrate practical use. Overall, the SEIU–EHWE data framework provides an anchor for systematically gathering, analyzing, and informing multiple dimensions of inequality and equity in sustainable urban systems.", "venue": "Journal of Industrial Ecology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-15", "journal": {"name": "Journal of Industrial Ecology", "pages": "145 - 163", "volume": "26"}, "authors": [{"authorId": "97820334", "name": "Lara P. Clark"}, {"authorId": "107832765", "name": "Samuel Tabory"}, {"authorId": "144507747", "name": "Kangkang Tong"}, {"authorId": "5215030", "name": "J. Servadio"}, {"authorId": "1417523883", "name": "K. Kappler"}, {"authorId": "1739173197", "name": "C. Xu"}, {"authorId": "51205117", "name": "A. Lawal"}, {"authorId": "27053287", "name": "Peter Wiringa"}, {"authorId": "2352370", "name": "L. Kne"}, {"authorId": "4046103", "name": "R. Feiock"}, {"authorId": "48639582", "name": "J. Marshall"}, {"authorId": "145408389", "name": "A. Russell"}, {"authorId": "95658856", "name": "A. Ramaswami"}], "citations": [{"paperId": "186dc39be15718972458764b7c8b1057b3769c62", "title": "Examining the impact of energy efficiency retrofits and vegetation on energy performance of institutional buildings: An equity-driven analysis"}, {"paperId": "b55032ea4712b5218e00b46d506435733650f62b", "title": "Air pollution exposure and cardiometabolic risk."}, {"paperId": "176de19035c07a532c37e08c4f6ff6f5acbfa276", "title": "Toward Zero-Carbon Urban Transitions with Health, Climate Resilience, and Equity Co-Benefits: Assessing Nexus Linkages"}, {"paperId": "74fb99ee21acd71fe6a4ee4fecde59dd37c63109", "title": "Exploring income and racial inequality in preparedness for Hurricane Ida (2021): insights from digital footprint data"}, {"paperId": "adf2c544b552c6a97b61667292536d13a00a2510", "title": "Weaving Equity into Infrastructure Resilience Research and Practice: A Decadal Review and Future Directions"}, {"paperId": "7e74e0e54318eb96a5c85449ba12c1934d7a1bf2", "title": "Ecological challenges on small tourist islands: A case from Chinese rural island"}, {"paperId": "fe78b700c754c8dbe0d6298617b28fb889fe2873", "title": "National and Intraurban Air Pollution Exposure Disparity Estimates in the United States: Impact of Data-Aggregation Spatial Scale"}, {"paperId": "2f1b623c111b8961f9e72d72ce81444b85d6eea2", "title": "Who Gardens and How in Urban USA: Informing Social Equity in Urban Agriculture Action Plans"}, {"paperId": "b3d1247a0c9ec81cc07a05e9c4020450c699a4fc", "title": "Connecting the dots between urban infrastructure, well-being, livability, and equity: a data-driven approach"}, {"paperId": "da0040989a316f58cc5102b15aaa5f29dce745a8", "title": "Data innovation in industrial ecology"}]}
