{"paperId": "0fa707cb6a13e5d59fe9380dd4ab5360b10b228d", "publicationVenue": {"id": "4539abfb-20e2-438c-a6d0-61dd915da9df", "name": "IEEE Workshop on Local and Metropolitan Area Networks", "type": "conference", "alternate_names": ["Workshop Local Metrop Area Netw", "Workshop on Local and Metropolitan Area Networks", "IEEE Workshop Local  Metrop Area Netw", "LANMAN", "IEEE Workshop on Local & Metropolitan Area Networks", "IEEE Workshop Local Metrop Area Netw"], "issn": "1944-0375", "alternate_issns": ["1944-0367"], "url": "https://ieeexplore.ieee.org/Xplore/home.jsp", "alternate_urls": ["http://www.ieee-lanman.org/"]}, "title": "Living on the Edge: Serverless Computing and the Cost of Failure Resiliency", "abstract": "Serverless computing platforms have gained popularity because they allow easy deployment of services in a highly scalable and cost-effective manner. By enabling just-in-time startup of container-based services, these platforms can achieve good multiplexing and automatically respond to traffic growth, making them particularly desirable for edge cloud data centers where resources are scarce. Edge cloud data centers are also gaining attention because of their promise to provide responsive, low-latency shared computing and storage resources. Bringing serverless capabilities to edge cloud data centers must continue to achieve the goals of low latency and reliability. The reliability guarantees provided by serverless computing however are weak, with node failures causing requests to be dropped or executed multiple times. Thus serverless computing only provides a best effort infrastructure, leaving application developers responsible for implementing stronger reliability guarantees at a higher level. Current approaches for providing stronger semantics such as “exactly once” guarantees could be integrated into serverless platforms, but they come at high cost in terms of both latency and resource consumption. As edge cloud services move towards applications such as autonomous vehicle control that require strong guarantees for both reliability and performance, these approaches may no longer be sufficient. In this paper we evaluate the latency, throughput, and resource costs of providing different reliability guarantees, with a focus on these emerging edge cloud platforms and applications.", "venue": "IEEE Workshop on Local and Metropolitan Area Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "2019 IEEE International Symposium on Local and Metropolitan Area Networks (LANMAN)", "pages": "1-6"}, "authors": [{"authorId": "153673738", "name": "Sameer G. Kulkarni"}, {"authorId": "1390722314", "name": "Guyue Liu"}, {"authorId": "145922660", "name": "K. Ramakrishnan"}, {"authorId": "145641762", "name": "Timothy Wood"}], "citations": [{"paperId": "70210227462b7b3df498b32a30fd75dc7bb61dbd", "title": "FedLesScan: Mitigating Stragglers in Serverless Federated Learning"}, {"paperId": "f0f891888058853f8f291c51d09ce2d331dc8121", "title": "Canary: Fault-Tolerant FaaS for Stateful Time-Sensitive Applications"}, {"paperId": "226c8c7457ed3581ddd7756717f15086ec29f200", "title": "Survey on serverless computing"}]}
