{"paperId": "0fe42856ce2d5dbae0c4206d3f1677e71fedcd93", "publicationVenue": {"id": "658465d7-3c50-4d5d-b3ad-34b6fc978004", "name": "SAGE Open", "type": "journal", "issn": "2158-2440", "url": "https://journals.sagepub.com/home/sgoa", "alternate_urls": ["http://sgo.sagepub.com/", "http://sgo.sagepub.com/content/4/3/2158244014545971"]}, "title": "Application Technology on Collaborative Training of Interactive Learning Activities and Tendency Preference Diversion", "abstract": "Mining problems and exploring rules are the key problems in the learning process, and also the difficulties in education big data. Therefore, taking learning behavior as the research objective, this study demonstrates the collaborative training method of multi view learning interaction process driven by big data, so as to realize the tendency preference diversion of learning behavior. Based on collaborative training method of learning behavior. Through adequate experiments, we get the suitable and valuable rules, constructs the directed topological relationship of tendency preference division, and mines the feasible improvement measures and intervention mechanism. Experiments and practices show that the potential topological relationship can effectively improve and enable learning, and improve the assessment results.", "venue": "SAGE Open", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "SAGE Open", "volume": "12"}, "authors": [{"authorId": "1807986", "name": "Xiaona Xia"}], "citations": [{"paperId": "0983a36da068244f76db5f8c62b4fe9feee7e0c0", "title": "Driving STEM learning effectiveness: dropout prediction and intervention in MOOCs based on one novel behavioral data analysis approach"}, {"paperId": "04f8284b9c8bb5d811d768bab953cf35121b6d0e", "title": "One improved learning analytics of interest transfer in interactive learning activities"}, {"paperId": "65a5fb8d6a1be825d8a2cb52935265a94e6b7082", "title": "Experiential Learning Model for the Development of Collaborative Skills through Project Based Learning Practicum"}, {"paperId": "e034f95d618203ded410755293fde3525deedb2e", "title": "Dropout prediction and decision feedback supported by multi temporal sequences of learning behavior in MOOCs"}, {"paperId": "a99d6defd26ad84f6091b4cbc2ed96d378527b7e", "title": "The Study of Hierarchical Learning Behaviors and Interactive Cooperation Based on Feature Clusters"}, {"paperId": "ba87afe587e0ac466774fce0555dff2082c6db72", "title": "Multi Objective Evaluation Between Learning Behavior and Learning Achievement"}, {"paperId": "0ecd3ca9381d284bd8cd41a8cb3d0e51bb0bfd9d", "title": "Early warning mechanism of interactive learning process based on temporal memory enhancement model"}]}
