{"paperId": "0ff5fba58352f9c1a265642f8d3be1417b1bd77c", "publicationVenue": {"id": "92e50051-bc20-49bb-9a4a-24dd922b146f", "name": "IEEE Systems Conference", "type": "conference", "alternate_names": ["SysCon", "IEEE Syst Conf"]}, "title": "Dependability Issues on an Internet Service Provider and availability study of autonomous systems", "abstract": "The Internet is arguably the most important means of communication, as there is no business strategy without the Internet. The Internet Service Provider’s challenge is to ensure the high availability of services to meet customers’ expectations, guaranteeing that they will be available and ready for whatever may be the user’s interests may be. Every time the user tries to access the service or product, and it is unavailable, we have the characterization of the service as unavailability. In this article, we evaluate the ISP’s core availability, identify availability issues in the router component, and study CTMC and RBD models by performing a model validation experiment, executing a steady-state availability, and performing a sensitivity analysis. Hierarchical modeling strategies, (availability models combining reliability block diagrams (RBD) and continuous time Markov chain (CTMC)) were used, indicating the availability of the infrastructure. The critical component of the system was indicated through sensitivity analysis. We performed a model validation technique to demonstrate that the models represent the behavior of the real system. The results showed that the system availability is 0.99941, and the sensitive analysis indicated that if the system administrator optimized the ISP infrastructure in 50%, it would yield a yearly downtime reduction of 3.4 hours.", "venue": "IEEE Systems Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-17", "journal": {"name": "2023 IEEE International Systems Conference (SysCon)", "pages": "1-7"}, "authors": [{"authorId": "2218335345", "name": "Arthur Sérvio"}, {"authorId": "2013806989", "name": "Felipe Oliveira"}, {"authorId": "1777101", "name": "J. Dantas"}, {"authorId": "2115881102", "name": "D. Silva"}, {"authorId": "2150765825", "name": "Danilo Clemente"}], "citations": [{"paperId": "5e6131e17ce07a656447850a024ac280b27c3b80", "title": "Simulation and Analysis of Link Failover Using Routing Border Gateway Protocol (BGP) Multi- Protocol Label Switching (MPLS) Networks"}]}
