{"paperId": "0ffde92ac6f8c1aa46f0eb04c95ab6daf6fe6a48", "publicationVenue": null, "title": "Resource Allocation in Multiple Backup Modes under Reliability Guarantee with Workload-Dependent Failure Probability", "abstract": "This paper proposes a primary and backup resource allocation model under reliability guarantees to minimize the deployment cost, which is considered as the number of activated physical nodes. We suppose that each node has a workload-dependent failure probability, which reveals a relationship between workload and node failure probability. Backup resources are allocated for the recovery of an unavailable function in a period, where the time relates to different backup modes and assigned recovery workload. We consider multiple states of pre-configuration for each function with different degrees of instantiation, initialization, synchronization, and different recovery times. We consider that the extra-assigned recovery resources can be adopted, which means that the recovery workload can be scaled, to speed up the recovery, while improving the resource efficiency to fully utilize the idle capacity for faster recovery. On the other hand, the extra-assigned recovery resources may lead to unsuccessful recovery in a specific failure configuration. We consider two reliability indicators, which are recovery time and the total unsuccessful recovery probability; each reliability indicator is restricted under a guarantee while minimizing the number of activated nodes as deployment cost. Adopting the proposed model saves on average 14% and 11% of the deployment cost when compared to baselines that do not incorporate variable backup modes and extra-assigned recovery resources, respectively, in our tests.", "venue": "2022 IEEE 11th International Conference on Cloud Networking (CloudNet)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-07", "journal": {"name": "2022 IEEE 11th International Conference on Cloud Networking (CloudNet)", "pages": "40-48"}, "authors": [{"authorId": "2116503162", "name": "Mengfei Zhu"}, {"authorId": "46530992", "name": "E. Oki"}], "citations": [{"paperId": "5987b95b02901ea463370e99dccf970d05f4e1b8", "title": "Robust function deployment against uncertain recovery time in different protection types with workload-dependent failure probability"}]}
