{"paperId": "1006cecb7151591d20c8454cff42ef0e3426a7d7", "publicationVenue": {"id": "88cc76ce-f486-46c4-bfa1-a31809d402d7", "name": "International Conference on Big Data and Smart Computing", "type": "conference", "alternate_names": ["BIGCOMP", "BigComp", "Int Conf Big Data Smart Comput"]}, "title": "Analyzing emotions in twitter during a crisis: A case study of the 2015 Middle East Respiratory Syndrome outbreak in Korea", "abstract": "Social media has emerged as an effective source to investigate people's opinions in the context of a variety of topics and situations. In particular, many recent studies try to investigate social media during the crisis situations that range from natural disasters to man-made conflicts. In this paper, we investigate people's emotional responses expressed on Twitter during the 2015 Middle East Respiratory Syndrome (MERS) outbreak in South Korea. Specifically, we first present an emotion analysis method to classify fine-grained emotions in Korean Twitter posts. Then, we conduct a case study of how Korean Twitter users responded to MERS outbreak using our emotion analysis method. Experimental results on Korean benchmark dataset demonstrate the superior performance of the proposed emotion analysis approach on real-world dataset. Moreover, our analysis results on tweets related to MERS outbreak help to understand the behaviors of humans and the characteristics of sociocultural system. Further, our method can be harnessed by the media to automatically investigate public opinions as well as the authorities to gain insights for quickly deciding the assistance policies.", "venue": "International Conference on Big Data and Smart Computing", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-01-18", "journal": {"name": "2016 International Conference on Big Data and Smart Computing (BigComp)", "pages": "415-418"}, "authors": [{"authorId": "2675750", "name": "H. Do"}, {"authorId": "2249347", "name": "Chae-Gyun Lim"}, {"authorId": "2107906682", "name": "You Jin Kim"}, {"authorId": "145530103", "name": "Ho‐Jin Choi"}], "citations": [{"paperId": "f2a4b0c053bfd4890b02dcc0d5d5f79975c735cd", "title": "The Role of Media in Addressing Opioid Use Disorder: Examining Causal Attributions and Emotions as Mediators of Media Influence on Stigma and Policy Support"}, {"paperId": "c42d63a2b24d0842c0aba106e4273af7e501b134", "title": "Humorous memes for Covid-19 communications and carnivalesque functions"}, {"paperId": "02d661b7c055ee274e79cc730597273c81dbf8cf", "title": "Investigating COVID-19 Vaccine Messaging in Online Social Networks using Artificial Intelligence"}, {"paperId": "988d29c2f8899fc1883ba6f3de3a6a192854d151", "title": "An Exploratory Study of Tweets about the SARS-CoV-2 Omicron Variant: Insights from Sentiment Analysis, Language Interpretation, Source Tracking, Type Classification, and Embedded URL Detection"}, {"paperId": "a8d913fd1005bf64132f32593c67fc30c4b38de1", "title": "Weaponising Social Media for Information Divide and Warfare"}, {"paperId": "af019ba3f2287ee30bbbc6a54eeb953a4e346f84", "title": "Large-Scale Twitter Mining for Extracting the Psychological Impacts of COVID-19"}, {"paperId": "fb472a6789b0c07ebeb52da986fd44d4e61ecf1e", "title": "Beyond Entertainment: Unpacking Danmaku and Comments' Role of Information Sharing and Sentiment Expression in Online Crisis Videos"}, {"paperId": "06cc5753f1b0bb44ff10ba431e3318de9379fda9", "title": "Understanding the landscape and propagation of COVID-19 misinformation and its correction on Sina Weibo"}, {"paperId": "77f638bb11abaa2416d594215a9287d6a73fdd5e", "title": "Applying and Understanding an Advanced, Novel Deep Learning Approach: A Covid 19, Text Based, Emotions Analysis Study"}, {"paperId": "aeed06ed34581faf602e26bc18634572b59e989b", "title": "Analysis and visualization of COVID-19 discourse on Twitter using data science: a case study of the USA, the UK and India"}, {"paperId": "3bfb8d4831b843d5edf03965782c17576bf79de5", "title": "Evaluating Polarity Trend Amidst the Coronavirus Crisis in Peoples’ Attitudes toward the Vaccination Drive"}, {"paperId": "e0adcadffeef47eb356b37cf4d2a241aa4118044", "title": "Social Media Use and Covid-19 Risk Perception among Nigerians: The Roles of Affects, Gender and Information Sources"}, {"paperId": "6117a1906877b3742d5b8f24b7d05dd4c25442e0", "title": "Twitter Users’ Displays of Affect in the Global Warming Debate"}, {"paperId": "014d0d142b82173e588ee812820e40a543cc2f4c", "title": "Mining Emotions on Plutchik's Wheel"}, {"paperId": "96da00216d539957d89d4da50695aa2b6904758b", "title": "Emotions in Twitter communication and stock prices of firms: the impact of Covid-19 pandemic"}, {"paperId": "52053831dd075a9836f3d8146087fe68ae83a90b", "title": "Exploring How Media Influence Preventive Behavior and Excessive Preventive Intention during the COVID-19 Pandemic in China"}, {"paperId": "1893844eda82da46b46e8121e13920ba41c3994f", "title": "Islamic view towards Bitcoin"}, {"paperId": "6bc6374c5cf6d414b086c9fe3562c8939158497b", "title": "Cross-Cultural Polarity and Emotion Detection Using Sentiment Analysis and Deep Learning on COVID-19 Related Tweets"}, {"paperId": "f5dfae4841a193cbe930c6b6c728c49a003d4329", "title": "GIS-Based Emotional Computing: A Review of Quantitative Approaches to Measure the Emotion Layer of Human-Environment Relationships"}, {"paperId": "d3ce39c7fb19678920b2f00aefd4aae0060385f3", "title": "Corpus Driven Analysis of News Reports about Covid-19 in a Malaysian Online Newspaper"}, {"paperId": "afe76ee01e297b6fd2940ea37a1710797f8f109b", "title": "Public Sentiment Insights Analysis using Word Sense Disambiguation Application on Twitter Data during a Pandemic – Covid’19"}, {"paperId": "2b7bf7d309d5b7e2c16feb83d0ebdcb0d3363d76", "title": "Cross-Cultural Polarity and Emotion Detection Using Sentiment Analysis and Deep Learning - a Case Study on COVID-19"}, {"paperId": "7f050d8dda027d049f58b2fc90d31b4ed1937e97", "title": "Emotional Analysis using Twitter Data during Pandemic Situation: COVID-19"}, {"paperId": "67248156d8c33a412bc93a35237207a0b183374f", "title": "Spatio-temporal distribution of negative emotions on Twitter during floods in Chennai, India, in 2015: a post hoc analysis"}, {"paperId": "7ea5d66ac455562f18bc45abb838594589337cbe", "title": "Mood of India During Covid-19 - An Interactive Web Portal Based on Emotion Analysis of Twitter Data"}, {"paperId": "69ef5e0081360b82cac2df5cb80a2ef0cdb9131d", "title": "The Effects of Social Media Use on Preventive Behaviors during Infectious Disease Outbreaks: The Mediating Role of Self-relevant Emotions and Public Risk Perception"}, {"paperId": "757cd063aece993b031a112c82afa7506944477b", "title": "Impact of Alignment between Social Media and Business Processes on SMEs’ Business Process Performance: A Conceptual Model"}, {"paperId": "112564a759962229a5682baea33267ebcb048790", "title": "When Twitter Becomes a Data Source for Geospatial Analysis"}, {"paperId": "c692039333678ac2ebd84fff8ec0a003d8cda494", "title": "An Analysis of Demographic and Behavior Trends Using Social Media: Facebook, Twitter, and Instagram"}, {"paperId": "379be23bf37a7e6ee3ab07240965c2eb19205221", "title": "Sentiment analysis of social media data using Supervised learning and Ekman’s basic emotions theory"}, {"paperId": "1e540e37ba5fbf08653f3356529147009289d525", "title": "Burst Your Bubble! An Intelligent System for Improving Awareness of Diverse Social Opinions"}, {"paperId": "e5cda88512b53cd192b775d5b02d6ea71d09b9c2", "title": "Classification and quantification of user's emotion on Malay language in social network sites using Latent Semantic Analysis"}, {"paperId": "bb7388c1633b269507da7e6d0365b916927f4a1c", "title": "A Theoretic Review of Emotional Language Analysis on Twitter Microblog and the Geography of Emotion"}, {"paperId": "2245f79c760c73633d2b0c3798629d8e13d74474", "title": "Twitter message recommendation based on user interest profiles"}, {"paperId": "dc97239b576093eba4c86b92a872ab2880c0c6f6", "title": "Citizen-Centric Urban Planning through Extracting Emotion Information from Twitter in an Interdisciplinary Space-Time-Linguistics Algorithm"}, {"paperId": "1f76c0da5cc6dc537d9871c70b2a568d3bc7e6f9", "title": "A review of the conceptual themes in the reports of Iranian Corona National Headquarters: word collocation and communicative strategies based on critical discourse analysis"}, {"paperId": "aba81ea3501180cb0bc9d229ed14304bf6676fc5", "title": "Effects of Information Exposure, Emotions, and Self-Efficacy On Risk Perception and Travel Intention During the COVID-19 Pandemic"}, {"paperId": "5b4911d6cc31b83eda5704f8200732d0f9a30aef", "title": "Using Machine Learning to Predict the Sentiment of Arabic Tweets Related to Covid-19"}, {"paperId": "c81f8bf4b0c0e11c906448e4aa5a43865399058b", "title": "Information Extraction and Sentiment Analysis to Gain Insight into the COVID-19 Crisis"}, {"paperId": "7019052d6e44583dd1ab814a322d858bc6437525", "title": "Qin. How Americans’ Views on Mask-Wearing Has Changed in 2020: Sentiment Analysis Based on Twitter Data. A I.S"}, {"paperId": "22306ddbb9bd6dfff1dea12cc400b08e1ca26305", "title": "EMOTION DETECTION IN PUBLIC SPACE: A MULTILANGUAGE COMPARISON IN BARCELONA"}, {"paperId": "54320bf56aac4ab213bde8be15933a6a116513d0", "title": "Identification of Natural Disaster Affected Area Using Twitter"}, {"paperId": "eabe3b85a3736a8c6ae6bce883f33b82b8796ae0", "title": "Use of Verified Twitter Accounts During Crisis Events"}, {"paperId": "efb3b08c60a61581affd7ffef892cff604b7ac5f", "title": "A Survey on Prediction and Detection of Epidemic Diseases Outbreaks"}]}
