{"paperId": "1006bbb634f55fc9aef59771673dae19dd1c68af", "publicationVenue": {"id": "f4989ee4-e1d2-45b4-85ad-c43a8ffef177", "name": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "type": "conference", "alternate_names": ["PODS", "Symp Princ Database Syst", "Symposium on Principles of Database Systems", "ACM SIGACT-SIGMOD-SIGART Symp Princ Database Syst"], "url": "http://www.acm.org/sigmod/pods/index.html"}, "title": "Probabilistic Databases under Updates: Boolean Query Evaluation and Ranked Enumeration", "abstract": "We consider tuple-independent probabilistic databases in a dynamic setting, where tuples can be inserted or deleted. In this context we are interested in efficient data structures for maintaining the query result of Boolean as well as non-Boolean queries. For Boolean queries, we show how the known lifted inference rules can be made dynamic, so that they support single-tuple updates with only a constant number of arithmetic operations. As a consequence, we obtain that the probability of every safe UCQ can be maintained with constant update time. For non-Boolean queries, our task is to enumerate all result tuples ranked by their probability. We develop lifted inference rules for non-Boolean queries, and, based on these rules, provide a dynamic data structure that allows both log-time updates and ranked enumeration with logarithmic delay. As an application, we identify a fragment of non-repeating conjunctive queries that supports log-time updates as well as log-delay ranked enumeration. This characterisation is tight under the OMv-conjecture.", "venue": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-20", "journal": {"name": "Proceedings of the 40th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems"}, "authors": [{"authorId": "2321666", "name": "Christoph Berkholz"}, {"authorId": "47464486", "name": "M. Merz"}], "citations": [{"paperId": "fc028ef6739ab635fbf945722df36638a45dd2b1", "title": "Range Updates and Range Sum Queries on Multidimensional Points with Monoid Weights"}, {"paperId": "1b614fc84679db76224863ae4812850107aaaf4b", "title": "Conjunctive Queries with Free Access Patterns Under Updates"}, {"paperId": "24b0867b97b805f38577793a0997ba5e7122faff", "title": "Any-k Algorithms for Enumerating Ranked Answers to Conjunctive Queries"}]}
