{"paperId": "1009fa50485cb7a00da6780af4b8e88f6d049dbd", "publicationVenue": null, "title": "The Anatomy of the Daily Usage of Bike Sharing Systems: Elevation, Distance and Seasonality", "abstract": "Bike sharing systems have been in place for several years in many urban areas as alternative and sustainable means of transportation. Bicycle usage heavily depends on the available infrastructure (e.g., protected bike lanes), but other—mutable or immutable— environmental characteristics of a city can influence the adoption of the system from its dwellers. Hence, it is important to understand how these factors influence people’s decisions of whether to use a bike system or not. In this this paper, we first investigate how altitude variation influences the usage of the bike sharing system in Pittsburgh. Using trip data from the system, and controlling for a number of other potential confounding factors, we formulate the problem as a classification problem, develop a framework to enable prediction using Poisson regression, and find that there is a negative correlation between the altitude difference and the number of trips between two stations (fewer trips between stations with larger altitude difference). We further, discuss how the results of our analysis can be used to inform decision making during the design and operation of bike sharing systems.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2152585268", "name": "InJung Kim"}, {"authorId": "2096978", "name": "K. Pelechrinis"}], "citations": [{"paperId": "e68d1cbdd789b15bf71f2d833a896d3a8c152a08", "title": "Scalability evaluation of forecasting methods applied to bicycle sharing systems"}, {"paperId": "9b323903d33ad4ddf7401d4c30509dd246e234bc", "title": "Evolvement patterns of usage in a medium-sized bike-sharing system during the COVID-19 pandemic"}, {"paperId": "dfd5b1ff1295d194b44d73961c2ec5cc74fd2d0b", "title": "ANALYSIS AND VISUAL EXPLORATION OF PREDICTION ALGORITHMS FOR PUBLIC BICYCLE SHARING SYSTEMS"}, {"paperId": "6a7fa480afbe1aadccf2c14fe87c279ffce0345a", "title": "A data-driven approach for assessing biking safety in cities"}, {"paperId": "bafd17f3e4a3565ac8567287ef76098241bd6f54", "title": "Advanced Visual Interaction with Public Bicycle Sharing Systems"}]}
