{"paperId": "1012e101afbc12fa91ce15511aa1833792d8fd40", "publicationVenue": null, "title": "THE EFFECT OF SOCIAL NETWORKS ON STUDENT’S ACADEMIC GROUP PERFORMANCE IN A COLLABORATIVE LEARNING ENVIRONMENT", "abstract": "For years universities and colleges have been proposing new methods to enhance students’ skills for team working. The development of information and communication technology plays an important role in increasing the effectiveness and efficiency of tasks such as teaching and learning. One of the factors that have been proven to affect performance using information technology (IT) is Task Technology Fit. It has also been shown that Collaborative Technologies such as social networks can be an effective tool to encourage students to engage in communication, express their opinions and challenge the ideas of others. This study attempt to alleviate the literature gap, regarding the effect of social networks on student’s academic group performance in computer supported collaborative learning (CSCL) environment in the context of Malaysia. A questionnaire was developed based on the Technology to Performance Chain model and it was used as the main data collection method for this study, in order to investigate how social networks can influence students’ group performance in a CSCL environment. The questionnaire was distributed among 129 students in one of the Malaysian public universities. User Satisfaction was added to this model as a new construct, and instead of the common learning management systems, a Social Network (SN) platform (Edmodo) was used. Edmodo was introduced to the students in the beginning of the semester and they were asked to use it in their studies as an e-learning platform. The result obtained from this study, showed that task technology fit has a strong influence on performance impact. Expected consequences of the use did not affect the performance, and social norm plays an important role in performance impact, contrary to common belief. However, user satisfaction did not have a direct influence on performance but an indirect one by increasing SN Utilization.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "117517464", "name": "Arash Bayat Shahbazi"}, {"authorId": "2260921808", "name": "Noorminshah A.Iahad"}, {"authorId": "49181827", "name": "Norasnita Ahmad"}, {"authorId": "2409058", "name": "Abdelsalam H. Busalim"}], "citations": [{"paperId": "46c60f84e970809756d22584616fcea8512b71d3", "title": "Virtual environments in cooperative learning: a contemporary innovative strategy"}]}
