{"paperId": "1013829c36f386c86be52b45b42dfb6c982d89d4", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Industrial Informatics: Emerging Trends and Applications in the Era of Big Data and AI", "abstract": "Industrial informatics is a rapidly developing scientific field that deals with the knowledge-based automation of industrial design and manufacturing processes. In the last decade, industrial informatics has been strongly influenced by the rapid rise of data-based technologies such as Data Science, Big Data, and artificial intelligence. The goal of this paper is to provide a literature review of academic research analyzing the extensive spectrum of industrial informatics. Articles indexed in Scopus with the term “Industrial Informatics” in the title, abstract, or keywords were extracted since the term emerged in the 1990s, over a period of 29 years. The main journals, conferences, authors and countries were studied using bibliometric analysis. Text mining using VosViewer was used to extract the thematic groups of research related to industrial informatics, which are as follows: (i) Internet of Things, (ii) machine learning, (iii) engineering education, (iv) cyber–physical systems, and (v) embedded systems. We also found that China, Germany, and Brazil dominate research in industrial computing. The results showed that research in industrial informatics is related to the emergence of new methods and tools, and is nowadays shifting towards the application of intelligent methods such as machine learning and Big Data.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-15", "journal": {"name": "Electronics"}, "authors": [{"authorId": "114498248", "name": "M. Pejić Bach"}, {"authorId": "103714441", "name": "A. Ivec"}, {"authorId": "2217592176", "name": "Danijela Hrman"}], "citations": [{"paperId": "ada38518c2f5e51d94938dc9a2814607381e51fa", "title": "Recent Advanced Applications of Virtual Industrial Informatics and Robotics"}, {"paperId": "de87ebca59a50ee6e45410ab7c0453e658e586ee", "title": "IT Trends: A Literature Review"}, {"paperId": "a64ffa41e0bebcd3771dce1100b93d4c0b7ad242", "title": "Assessing the Appraisal of Research Quality in Social Sciences and Humanities: A Case Study of the University of Montenegro"}, {"paperId": "bf85beafdd04e43e5d6b7e19ea50e1a6271c5504", "title": "How Could Consumers' Online Review Help Improve Product Design Strategy?"}]}
