{"paperId": "103bb9d12d1e51b638d56c4a27e95a22df4981f7", "publicationVenue": null, "title": "Efficient test execution in End to End testing : Resource optimization in End to End testing through a smart resource characterization and orchestration", "abstract": "Virtualization and containerization have been two disruptive technologies in the past few years. Both technologies have allowed isolating the applications with fewer resources and have impacted fields such as Software Testing. In the field of testing, the execution of the containerized/virtualized test suite has achieved great savings, but when the complexity increases or the cost of deployment rises, there are open challenges like the efficient execution of End to End (E2E) test suites. This paper proposes a research problem and a feasible solution that looks to improve resource usage in the E2E tests, towards smart resource identification and a proper organization of its execution in order to achieve efficient and effective resource usage. The resources are characterized by a series of attributes that provide information about the resource and its usage during the E2E testing phase. The test cases are grouped and scheduled with the resources (i.e. parallelized in the same machine or executed in a fixed arrangement), achieving an efficient test suite execution and reducing its total cost/time.", "venue": "2020 IEEE/ACM 42nd International Conference on Software Engineering: Companion Proceedings (ICSE-Companion)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-06-27", "journal": {"name": "2020 IEEE/ACM 42nd International Conference on Software Engineering: Companion Proceedings (ICSE-Companion)", "pages": "152-154"}, "authors": [{"authorId": "1913955903", "name": "Cristian Augusto"}], "citations": [{"paperId": "376cd51797c0c3ed6ec9e1a58d906aa9cc24f094", "title": "Toward an efficient End-to-End test suite execution"}, {"paperId": "73dbf9b92e568a6bc8a2dbb99d0c2a5f8dfd634d", "title": "Database-Conscious End-to-End Testing for Reactive Systems using Containerization"}]}
