{"paperId": "10449fd1d346fa82d5e92f428339332cc4763bab", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Pre-pandemic activity on a myalgic encephalomyelitis/chronic fatigue syndrome support forum is highly associated with later activity on a long COVID support forum for a variety of reasons: A mixed methods study", "abstract": "Encephalomyelitis/chronic fatigue syndrome (ME/CFS) and long COVID share some clinical and social characteristics. We predicted that this would lead to an increased interaction between pre-pandemic members of a ME/CFS online support community and a long COVID community. We performed a mixed-methods retrospective observational study of the Reddit activity of 7,544 users active on Reddit's long COVID forum. From among 1600 forums, pre-pandemic activity specifically on a ME/CFS forum is the top predictor of later participation on the long COVID forum versus an acute COVID support forum. In the qualitative portion, motives for this co-participation included seeking mutual support and dual identification with both conditions. Some of this effect may be explained by pre-existing ME/CFS possibly being a risk factor for long COVID and/or SARS-CoV-2 infection being a cause of ME/CFS relapse. The high rate of ME/CFS patients seeking mutual support on a long COVID forum speaks to the long-suffering experience of these patients not feeling heard or respected, and the hope of some ME/CFS patients to gain legitimacy through the public's growing recognition of long COVID.", "venue": "medRxiv", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "2238550848", "name": "William U Meyerson"}, {"authorId": "2238550717", "name": "Rick H. Hoyle"}], "citations": [{"paperId": "1660103d4790a31078ce456186775dc9a24bbf50", "title": "The impact of social distancing measures (quarantine) policy on tertiary education and medical consultations in China during the COVID-19 pandemic"}, {"paperId": "7a1ba60ed7be1539fc9f44a51995bb2fbc6ecc2d", "title": "Long COVID in pediatrics-epidemiology, diagnosis, and management."}]}
