{"paperId": "104afa9f1c26a99b2355b2c6f5e397a41a51dd78", "publicationVenue": {"id": "621ec958-6aa9-44cf-8c1b-ceb4e6932bfd", "name": "Webology", "issn": "1735-188X", "url": "http://www.webology.itgo.com/", "alternate_urls": ["https://www.webology.org/", "http://www.webology.ir/", "http://www.webology.ir/index.html"]}, "title": "Design and Implementation a Cloud Computing System for Smart Home Automation", "abstract": "This work providing a smart home concept, teach intelligent home techniques and smart grid appearance. The main applications of various home automation technologies and future improvements, as well as the different concept of energy conservation in the field of smart home. The proposed system integrates many functions and automation devices for many home applications in one application and this is easy to use for monitoring and control from the user using a computer or smartphone via the Internet. The sensors used in this work are: Temperature sensor: to provide an indication of the temperature and to know the customer if necessary to turn the air conditioning on or off, manually or automatically resulting in reduced energy consumption. Humidity Sensor Used to provide an indicator of humidity in garden watering by turning off or turning on the water valve, which can be set manually or automatically to save water at a high level and also protect garden plants from thirst or excessive water. Motion sensor: to control the outside and inside home lighting by ON OFF the light only if the human is detected, this done by using special algorithm. The gain in energy keeping is high percentage. The motion sensor was used to control the movement and recording of the camera by ON OFF, while detecting human movement only, and this is done using a special algorithm. This process facilitates monitoring and reduces the storage process for cameras only when needed. All these procedures of the proposed smart home system are combined with the Internet of Things (IoT), Webbing and Clouding through sensors and actuators controlling the home appliances by using Raspberry-Bi 3B+ platform. Sharing the data and networking smart sensors by using Wi-Fi technology. The Cloud computing services used to facilitate interactions process with smart devices. Moreover, Cisco Packet Tracer program used to simulate all the above process.", "venue": "Webology", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-30", "journal": {"name": "Webology"}, "authors": [{"authorId": "118206575", "name": "Murad O. Abed Helo"}, {"authorId": "153591711", "name": "Alaa Shaker"}, {"authorId": "1405791429", "name": "L. Abdul-Rahaim"}], "citations": [{"paperId": "ea9882fd01cf927c89af66e0078e53d473ddc757", "title": "Design of a home automation system with voice interface “Yanapay 2.0” for people with lower limb motor disabilities"}, {"paperId": "5f39e1508eb748205310a98b840bb0cf7b05681b", "title": "IRHA: An Intelligent RSSI based Home automation System"}]}
