{"paperId": "10500663bac1ed07542a811694841675d6172084", "publicationVenue": {"id": "6c1daa1a-805a-4bc8-8c66-56a95e181cdd", "name": "Benchmarking : An International Journal", "type": "journal", "alternate_names": ["Benchmarking: An International Journal", "Benchmarking", "Benchmarking Int J", "Benchmarking  Int J"], "issn": "1463-5771", "url": "https://www.emerald.com/insight/publication/issn/1463-5771", "alternate_urls": ["http://www.emeraldinsight.com/1463-5771.htm"]}, "title": "A typology of horizontal logistics collaboration concepts: an illustrative case study from agri-food supply chains", "abstract": "PurposeThe purpose of this paper is to develop a comprehensive model for horizontal logistics collaboration (HLC), including the collaboration types, enablers, context influence and performance indicators.Design/methodology/approachFirst, this study discusses the currently available typologies and their limitations and defines relevant collaboration classification dimensions. Then, a detailed analysis of each dimension is conducted, including the identification of resulting collaboration types. Next, collaboration enablers and the context influence are discussed, as well as their implications on the logistics system, with a specific focus on agri-food supply chains (AFSCs). Additionally, adequate key performance indicators (KPIs) are selected to evaluate collaboration outcomes. Finally, the horizontal logistics collaboration concept (HLCC) is applied to an illustrative case study from AFSCs.FindingsThe results show that HLC is a complex strategy where several elements intervene in the creation of the collaboration scenario. The research also shows that the specific characteristics of AFSCs influence the partners' selection process and increase the importance of partners' similarity and information exchange.Practical implicationsThe results provide managers with practical insights into the dynamic nature of HLC both at the operational and relational levels.Originality/valueThis paper provides a theoretical contribution by introducing a new comprehensive model for HLC and a practical typology that allows a deeper understanding of the mechanisms governing different HLC scenarios.", "venue": "Benchmarking : An International Journal", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-07-27", "journal": {"name": "Benchmarking: An International Journal"}, "authors": [{"authorId": "102460681", "name": "Ismail Badraoui"}, {"authorId": "1826837", "name": "Y. Boulaksil"}, {"authorId": "11147753", "name": "J. G. van der Vorst"}], "citations": [{"paperId": "e48d9de9197e4ca58e202f980fb5237e566009b9", "title": "Collaborative planning of multi-tier sustainable supply chains: A reinforcement learning enhanced heuristic approach"}, {"paperId": "70730556809848e44d44eeee9b41e0a024ecd997", "title": "Collaborative Insights on Horizontal Logistics to Integrate Supply Chain Planning and Transportation Logistics Planning – A Systematic Review and Thematic Mapping"}, {"paperId": "2a8bb042c1d5c983d0051ab888f8733f18fbdff7", "title": "Horizontal logistics collaboration success factors: expectations versus reality"}, {"paperId": "d9173366d2187916fcefde450955fe537f59e044", "title": "What drives horizontal logistics collaboration? A grounded theory analysis of Chinese logistics service providers"}, {"paperId": "1836078f592f46cdfaa74e48ca4519d5a7826a34", "title": "Mapping research trends on food supply chain: a bibliometric analysis"}, {"paperId": "89bee0544aee62c676f15b9af70da24ecd2f3b60", "title": "Illustrating scholar–practitioner collaboration for data-driven decision-making in the optimization of logistics facility location and implications for increasing the adoption of AR and VR practices"}, {"paperId": "61ab20ee76665ae7f26057eae11d4f79816167ce", "title": "Horizontal logistics collaboration : cases from agri-food supply chains in Morocco"}]}
