{"paperId": "1053445c1ad561036c5282467986e45c15af06e6", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Crystal: A Unified Cache Storage System for Analytical Databases", "abstract": "Cloud analytical databases employ a disaggregated storage model, where the elastic compute layer accesses data persisted on remote cloud storage in block-oriented columnar formats. Given the high latency and low bandwidth to remote storage and the limited size of fast local storage, caching data at the compute node is important and has resulted in a renewed interest in caching for analytics. Today, each DBMS builds its own caching solution, usually based on fileor block-level LRU. In this paper, we advocate a new architecture of a smart cache storage system called Crystal, that is co-located with compute. Crystal’s clients are DBMS-specific “data sources” with push-down predicates. Similar in spirit to a DBMS, Crystal incorporates query processing and optimization components focusing on efficient caching and serving of single-table hyper-rectangles called regions. Results show that Crystal, with a small DBMS-specific data source connector, can significantly improve query latencies on unmodified Spark and Greenplum while also saving on bandwidth from remote storage. PVLDB Reference Format: Dominik Durner, Badrish Chandramouli, and Yinan Li. Crystal: A Unified Cache Storage System for Analytical Databases. PVLDB, 14(11): 2432 -", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Proc. VLDB Endow.", "pages": "2432-2444", "volume": "14"}, "authors": [{"authorId": "12687177", "name": "Dominik Durner"}, {"authorId": "2241445", "name": "Badrish Chandramouli"}, {"authorId": "2144424734", "name": "Yinan Li"}], "citations": [{"paperId": "2daa1a351a9e2b1452e2e094fc2a068c1c2d0b75", "title": "moduli: A Disaggregated Data Management Architecture for Data-Intensive Workflows"}, {"paperId": "476124d8221f9ea7b1272e8daca4f92f59c1409f", "title": "Exploiting Cloud Object Storage for High-Performance Analytics"}, {"paperId": "57d5ceb4066d8e67c7aeff23467eef1dde253b99", "title": "FIFO can be Better than LRU: the Power of Lazy Promotion and Quick Demotion"}, {"paperId": "62ab0c752b63393c9462ef2b749cd7545d2b1a49", "title": "Predicate Pushdown for Data Science Pipelines"}, {"paperId": "60ba359fccf0cbe952931fb8cb132035f0313198", "title": "Selection Pushdown in Column Stores using Bit Manipulation Instructions"}, {"paperId": "17eb68dc779d70382ac45152ee23398292528246", "title": "SPA: Economical and Workload-Driven Indexing for Data Analytics in the Cloud"}, {"paperId": "313b35dae184ce0f7053e23ec22e538210e26c20", "title": "Accelerating Cloud-Native Databases with Distributed PMem Stores"}, {"paperId": "f365bc53d9380f0d9dba603c766c7bc3e05c217b", "title": "Metadata Caching in Presto: Towards Fast Data Processing"}, {"paperId": "4d99f1a86279bfeba1df181390ca4aaf7a867d50", "title": "On-Demand State Separation for Cloud Data Warehousing"}, {"paperId": "79b02965aa06a3a4471ab43ff09f947faaddf910", "title": "Evaluating push-down on NoSQL data sources: experiments and analysis paper"}, {"paperId": "79b4350a549207f3ae3db60698c093da77e97655", "title": "ScaleStore: A Fast and Cost-Efficient Storage Engine using DRAM, NVMe, and RDMA"}, {"paperId": "dc413c9c14c189351a9ecab003ca6b17d9f95997", "title": "Still Open Problems in Data Warehouse and Data Lake Research: extended abstract"}]}
