{"paperId": "1055fcec1bd8d8515372a897eab665bb5e8d176a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "SoK: Demystifying Privacy Enhancing Technologies Through the Lens of Software Developers", "abstract": "In the absence of data protection measures, software applications lead to privacy breaches, posing threats to end-users and software organisations. Privacy Enhancing Technologies (PETs) are technical measures that protect personal data, thus minimising such privacy breaches. However, for software applications to deliver data protection using PETs, software developers should actively and correctly incorporate PETs into the software they develop. Therefore, to uncover ways to encourage and support developers to embed PETs into software, this Systematic Literature Review (SLR) analyses 39 empirical studies on developers' privacy practices. It reports the usage of six PETs in software application scenarios. Then, it discusses challenges developers face when integrating PETs into software, ranging from intrinsic challenges, such as the unawareness of PETs, to extrinsic challenges, such as the increased development cost. Next, the SLR presents the existing solutions to address these challenges, along with the limitations of the solutions. Further, it outlines future research avenues to better understand PETs from a developer perspective and minimise the challenges developers face when incorporating PETs into software.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-30", "journal": {"name": "ArXiv", "volume": "abs/2401.00879"}, "authors": [{"authorId": "2277446936", "name": "Maisha Boteju"}, {"authorId": "2095895", "name": "Thilina Ranbaduge"}, {"authorId": "1736048", "name": "Dinusha Vatsalan"}, {"authorId": "2991616", "name": "N. Arachchilage"}], "citations": []}
