{"paperId": "106b4393470894cdc77963d869965dad1d700f81", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Comparison of Decision Forest Inference Platforms from A Database Perspective", "abstract": "Decision forest, including RandomForest, XGBoost, and LightGBM, is one of the most popular machine learning techniques used in many industrial scenarios, such as credit card fraud detection, ranking, and business intelligence. Because the inference process is usually performance-critical, a number of frameworks were developed and dedicated for decision forest inference, such as ONNX, TreeLite from Amazon, TensorFlow Decision Forest from Google, HummingBird from Microsoft, Nvidia FIL, and lleaves. However, these frameworks are all decoupled with data management frameworks. It is unclear whether in-database inference will improve the overall performance. In addition, these frameworks used different algorithms, optimization techniques, and parallelism models. It is unclear how these implementations will affect the overall performance and how to make design decisions for an in-database inference framework. In this work, we investigated the above questions by comprehensively comparing the end-to-end performance of the aforementioned inference frameworks and netsDB, an in-database inference framework we implemented. Through this study, we identified that netsDB is best suited for handling small-scale models on large-scale datasets and all-scale models on small-scale datasets, for which it achieved up to hundreds of times of speedup. In addition, the relation-centric representation we proposed significantly improved netsDB's performance in handling large-scale models, while the model reuse optimization we proposed further improved netsDB's performance in handling small-scale datasets.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-09", "journal": {"name": "ArXiv", "volume": "abs/2302.04430"}, "authors": [{"authorId": "2055337820", "name": "Hong Guan"}, {"authorId": "87574963", "name": "Mahidhar Dwarampudi"}, {"authorId": "2204954017", "name": "Venkatesh Gunda"}, {"authorId": "2055927266", "name": "Hong Min"}, {"authorId": "2112532900", "name": "Lei Yu"}, {"authorId": "144551417", "name": "Jia Zou"}], "citations": [{"paperId": "d2026a54f86aa2d9669b83a8fd4be440b51cebc0", "title": "ONNXExplainer: an ONNX Based Generic Framework to Explain Neural Networks Using Shapley Values"}, {"paperId": "5a594238ddeea258b00fa5c4d85051d42f2554b9", "title": "Auto-Differentiation of Relational Computations for Very Large Scale Machine Learning"}, {"paperId": "af0f3465dcd52f369873312cbc09e144c0891ea6", "title": "Serving Deep Learning Models from Relational Databases"}]}
