{"paperId": "1071feecdef5f52fe186d9f2eb206a68a9739149", "publicationVenue": {"id": "1c65904b-0167-4c45-acfd-67d8c430d00b", "name": "Journées Francophones sur les Entrepôts de Données et l'Analyse en ligne", "type": "conference", "alternate_names": ["EDA", "Journées Francoph sur Entrepôts Données l'analyse ligne"]}, "title": "Nouvelle stratégie pour le traitement distribué des processus décisionnels massifs dans un Big Data Warehouse", "abstract": "Résumé. Cet article traite du problème de l’optimisation de l’exécution des charges de requêtes massives dans le cadre des entrepôts de données (ED) distribués où le nombre de processus simultanés à traiter se compte par milliers. En nous inspirant des techniques d’optimisation utilisées dans le contexte centralisé, nous proposons dans cet article une nouvelle stratégie de sélection et de stockage de vues matérialisées (MV) basée sur système de fichiers distribués ; puis nous abordons le traitement des charges de requêtes décisionnelles massives en utilisant les MV. Notre approche joue un rôle de médiateur entre les utilisateurs et l’entrepôt de données pour proposer de meilleurs plans d’exécution à leurs requêtes. Les premiers résultats que nous avons obtenus, à partir de nos expérimentations montrent que dans un environnement distribué notre approche améliore de plus de 50% le coût d’exécution d’une charge de requêtes par rapport au système fourni par défaut.", "venue": "Journées Francophones sur les Entrepôts de Données et l'Analyse en ligne", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "81-94"}, "authors": [{"authorId": "2525250", "name": "Rado Ratsimbazafy"}, {"authorId": "104316719", "name": "Fadila Bentayeb"}, {"authorId": "2094299380", "name": "Omar Boussaïd"}], "citations": [{"paperId": "db3ec8222540de5d4af682f5d40615197756c227", "title": "S2D: Shared Distributed Datasets, Storing Shared Data for Multiple and Massive Queries Optimization in a Distributed Data Warehouse"}]}
