{"paperId": "1073a945181830bc31e6587decd8fc4f8bd60b67", "publicationVenue": {"id": "0efcbead-01a8-4b51-8e8a-d192f79ba6fa", "name": "Wind Energy", "type": "journal", "issn": "1095-4244", "alternate_issns": ["0387-6217"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/6276", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1824", "https://onlinelibrary.wiley.com/journal/10991824"]}, "title": "Reliability‐based topology optimization for offshore wind farm collection system", "abstract": "An optimization framework for global optimization of the cable layout topology for offshore wind farm (OWF) is presented. The framework designs and compares closed-loop and radial layouts for the collection system of OWFs. For the former, a two-stage stochastic optimization program based on a mixed integer linear programming (MILP) model is developed, while for the latter, a hop-indexed full binary model is used. The purpose of the framework is to provide a common base for assessing both designs economically, using the same underlying contingency treatment. A discrete Markov model is implemented for calculating the cable failure probability, useful for estimating the time under contingency for multiple power generation scenarios. The objective function supports simultaneous optimization of (i) initial investment (network topology and cable sizing), (ii) total electrical power loss costs and (iii) operation costs due to energy curtailment from cable failures. Constraints are added accounting for common engineering aspects. The applicability of the full method is demonstrated by tackling three differently sized real-world OWFs. Results show that (i) the profitability of either topology type depends strongly on the project size and wind turbine rating. Closed loop may be a competitive solution for large-scale projects where large amounts of energy are potentially curtailed. (ii) The stochastic model presents low tractability to tackle large-scale instances, increasing the required computing time and memory resources. (iii) Strategies must be adopted in order to apply stochastic optimization for modern OWFs, intending analytically or numerically simplification of mathematical models.", "venue": "Wind Energy", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-07", "journal": {"name": "Wind Energy"}, "authors": [{"authorId": "1401970065", "name": "J. Pérez-Rúa"}, {"authorId": "3467805", "name": "S. Lumbreras"}, {"authorId": "2112762529", "name": "A. Ramos"}, {"authorId": "31769145", "name": "N. Cutululis"}], "citations": [{"paperId": "e5b93df81e654dd86c9b2fa208b539bfddfe9291", "title": "Inter-array cabling optimization in offshore wind power plants, a new reliability indicator for radial grids"}, {"paperId": "1216589e81940918883764bf98cee20b5a718d97", "title": "Review of Offshore Wind Power Reliability Analysis and Assessment"}, {"paperId": "38a9a7409c6564e215d7b2a8e567ca4e4a867572", "title": "Offshore Electrical Grid Layout Optimization for Floating Wind—A Review"}, {"paperId": "a2a241a73ff9d9b1c73d1e83cdb6644f4bf0c2d0", "title": "Wind farm array cable layout optimisation for complex offshore sites—A decomposition based heuristic approach"}, {"paperId": "efa8f18515a14d6d5b3a89cbbb978dca3be8f480", "title": "Reliability-Based Topology Optimization: An Extension of the SESO and SERA Methods for Three-Dimensional Structures"}, {"paperId": "67a41f8d445e09de28aaf1479174216fbc4a1cb1", "title": "Solver-free heuristics to retrieve feasible points for offshore wind farm collection system"}, {"paperId": "0812949325575c1bcdffce8aadfcbccc3928cd63", "title": "Two decades review of reliability-based topology optimization developments"}]}
