{"paperId": "10793f23a2c0d6108173eb985cbac8710f8f0d97", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "A Review on the Diagnosis of Epilepsy using ML", "abstract": "The most prevalent developing neurological disease is epilepsy that affects many lives around the world. The commonly occuring and incalculable seizures leads to the loss of valuable human life. To diagnose epilepsy from brain signals with naked eye is always challenging. Clinicians need hours of training to understand seizure patterns from electroencephalograms (EEG). Despite the great effort, they sometimes misdiagnose due to human error. In this challenging situation, machine learning (ML) model might play an important role in the prefect diagnosis of the problem. The clinicians, instead of analyzing the 24 hours recordings of complicated EEG signals can take the help of ML algorithms and find out the problems of interest in a few seconds and finally give their expert advice, thus helping in accurate and fast diagnosis of the problem. Hence, in this review article, we have come up with a featured review on the diagnosis of epilepsy using machine learning. The paper begins with an understanding of EEG and the challenges in the diagnosis from collecting and processing the electroencephalography (EEG) data. The comparative analysis of various state of art ML techniques is compared and presented. Finally, we have concluded with the best available approach considering computational complexity. The proposed review will certainly help in developing both offline and online model that will assist healthcare professionals to diagnose the problems with higher accuracy and in less time.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-07-06", "journal": {"name": "2023 14th International Conference on Computing Communication and Networking Technologies (ICCCNT)", "pages": "1-6"}, "authors": [{"authorId": "2187954479", "name": "Rakesh Kumar Sadangi"}, {"authorId": "2268070366", "name": "Biswakalpa Patra"}, {"authorId": "49158772", "name": "R. Maity"}, {"authorId": "143788265", "name": "N. Maity"}, {"authorId": "2260817780", "name": "Bijuni Charan Sutar"}], "citations": []}
