{"paperId": "10846a612ad6891aac90bb7e87fe687ff2cc4b91", "publicationVenue": null, "title": "Zero-Cost, Arrow-Enabled Data Interface for Apache Spark", "abstract": "Distributed data processing ecosystems are widespread and their components are highly specialized, such that efficient interoperability is urgent. Recently, Apache Arrow was chosen by the community to serve as a format mediator, providing efficient in-memory data representation. Arrow enables efficient data movement between data processing and storage engines, significantly improving interoperability and overall performance. In this work, we design a new zero-cost data interoperability layer between Apache Spark and Arrow-based data sources through the Arrow Dataset API. Our novel data interface helps separate the computation (Spark) and data (Arrow) layers. This enables practitioners to seamlessly use Spark to access data from all Arrow Dataset API-enabled data sources and frameworks. To benefit our community, we open-source our work and show that consuming data through Apache Arrow is zero-cost: our novel data interface is either on-par or more performant than native Spark.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-24", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "2400-2405"}, "authors": [{"authorId": "1388606537", "name": "Sebastiaan Alvarez Rodriguez"}, {"authorId": "2047518962", "name": "Jayjeet Chakraborty"}, {"authorId": "145355481", "name": "Aaron Chu"}, {"authorId": "145263954", "name": "I. Jimenez"}, {"authorId": "40559862", "name": "J. LeFevre"}, {"authorId": "3198700", "name": "C. Maltzahn"}, {"authorId": "2860260", "name": "Alexandru Uta"}], "citations": [{"paperId": "35e34ca58482b0307455b4539bf58bd6af5cc1bf", "title": "A Deep Dive into Common Open Formats for Analytical DBMSs"}, {"paperId": "2696dbae07d13367d8fc7a9f1ace1cb815a746a9", "title": "Tydi-lang: A Language for Typed Streaming Hardware"}, {"paperId": "db84a181a3e75562e99546f33864e430222eb6e0", "title": "Master Computer Science Investigating End-to-End Arrow-based operations in Apache Spark Name : Mariska IJpelaar Student"}]}
