{"paperId": "1088f92aec8eb5ffba6bfacbb39382792b6f8ca5", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "A New Human-Based Metaheuristic Algorithm for Solving Optimization Problems Based on Technical and Vocational Education and Training", "abstract": "In this paper, a new human-based metaheuristic algorithm called Technical and Vocational Education and Training-Based Optimizer (TVETBO) is introduced to solve optimization problems. The fundamental inspiration for TVETBO is taken from the process of teaching work-related skills to applicants in technical and vocational education and training schools. The theory of TVETBO is expressed and mathematically modeled in three phases: (i) theory education, (ii) practical education, and (iii) individual skills development. The performance of TVETBO when solving optimization problems is evaluated on the CEC 2017 test suite for problem dimensions equal to 10, 30, 50, and 100. The optimization results show that TVETBO, with its high abilities to explore, exploit, and create a balance between exploration and exploitation during the search process, is able to provide effective solutions for the benchmark functions. The results obtained from TVETBO are compared with the performances of twelve well-known metaheuristic algorithms. A comparison of the simulation results and statistical analysis shows that the proposed TVETBO approach provides better results in most of the benchmark functions and provides a superior performance in competition with competitor algorithms. Furthermore, in order to measure the effectiveness of the proposed approach in dealing with real-world applications, TVETBO is implemented on twenty-two constrained optimization problems from the CEC 2011 test suite. The simulation results show that TVETBO provides an effective and superior performance when solving constrained optimization problems of real-world applications compared to competitor algorithms.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "3454074", "name": "M. Hubálovská"}, {"authorId": "2261613370", "name": "Štěpán Major"}], "citations": [{"paperId": "037732c9cfd61ad6742e98ce301c14ac7208ca48", "title": "The Pine Cone Optimization Algorithm (PCOA)"}]}
