{"paperId": "1099e12b2b60a9082fe395658302d68f2dc37751", "publicationVenue": {"id": "9a21a401-874d-49b2-b22f-1ede1635d733", "name": "IJEBD (International Journal of Entrepreneurship and Business Development)", "type": "journal", "alternate_names": ["IJEBD (international J Entrep Bus Dev"], "issn": "2597-4750", "url": "https://jurnal.narotama.ac.id/index.php/ijebd/index"}, "title": "Systematic Literature Review: An overview of Digital Agriculture for Food Sustainability", "abstract": "Digital agriculture has been noted to have far reaching prospects in the transformation of agribusiness. Digital technologies are been applied to improve food production, processing, security and packaging. As most of the least developed and developing economies are strategizing to reduce poverty and hunger, digital agriculture presents opportunities to reverse the trends. Thus, this paper presents a systematic literature review with aim to collect all related research and identify gaps in digital agriculture, as well as to understand the benefits of digital technology in agriculture in other to chart new proposition for future studies. A systematic literature review was carried, and we have extracted 67 journals published within the last two decades (2002 -2022). Findings suggests that digital agriculture is important drivers of food sustainability, with improve production yield and increase household income. Also, 42% of the studies on digital agriculture are dominated by precision agriculture model. This SLR recognizes knowledge gaps in relation to the context, theory and content for future research.", "venue": "IJEBD (International Journal of Entrepreneurship and Business Development)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-05-31", "journal": {"name": "IJEBD (International Journal of Entrepreneurship and Business Development)"}, "authors": [{"authorId": "2137480684", "name": "I. Mustapha"}, {"authorId": "115388122", "name": "O. B. Sakariyau"}, {"authorId": "100596172", "name": "U. Zubairu"}, {"authorId": "121096414", "name": "H. Afang"}], "citations": [{"paperId": "2d1193ffb7d101a5519b6e5530570ee402ff23a9", "title": "Mortality Prediction in Emergency Department Using Machine Learning Models"}, {"paperId": "155ffb420d75c3c8ce87c87b4053ddbcb6195de9", "title": "Influence of Smart Sensors on Structural Health Monitoring Systems and Future Asset Management Practices"}, {"paperId": "c59f871acdf512ac702cddff39db09ec62151a8e", "title": "Financial evaluation and credit access of agricultural firms"}, {"paperId": "0a3272e8c8861edc385506a1814fed433738f972", "title": "Investigating the critical success factors for integrating Lean Six Sigma and Industry 4.0"}, {"paperId": "8f79920a255b2faf5e274b7e67e1677e049659e0", "title": "Thirty years of sustainability reporting research: a scientometric analysis"}, {"paperId": "8066b946fa2e4fec72789f70bc0774a09d10a788", "title": "On Using Twitter to Understand the Stablecoin Terra Collapse"}, {"paperId": "ed2094edfeac92c2caaa55c2259a5c85100e9c42", "title": "Individual and Social Influence on the Sustainable Social Entrepreneurs Development"}, {"paperId": "917c05a8fe955ceb1990e4c7a953e04bdf3d520d", "title": "Influence of Knowledge Sharing, Innovation Capacity, Firm Performance in Nigerian Agro-clusters"}, {"paperId": "2e8daea38cf28d8708624809e977e5f471aa4c99", "title": "Virtual Reality-Based Learning about \"Animals Recognition\" and Its Influence on Students' Understanding"}, {"paperId": "a75ba40a029d9a6f39ffb35f48baa9f5b2109b84", "title": "Digitalization of Business Profile to Promote Qualified Marketing System of SMEs’ Product"}, {"paperId": "a956d9b748560a59403f1896d085f32236ef5fde", "title": "Real-time prediction of free lime in cement clinker using support vector machine algorithm"}, {"paperId": "9e24b0093084f8e63070a0fd702068fc72f3747c", "title": "Real-time Event Streaming for Financial Enterprise System with Kafka"}, {"paperId": "b69094e42d7be4aad11dc16d707c2fc10612d55f", "title": "Byzantine Machine Learning: A Primer"}, {"paperId": "205e74e4747946c68080cc907cdaafe51c565f3c", "title": "Predicting sugar intake using an extended theory of planned behavior in a sample of adolescents: The role of habit and self‐control"}, {"paperId": "d166936ac2481effbe8bd523735f8073476be1ce", "title": "A Review of Cloud Microservices Architecture for Modern Applications"}, {"paperId": "0c86b5b959e87cc4421c7fce52f1efb81019a13a", "title": "Model-Driven Engineering for Artificial Intelligence - A Systematic Literature Review"}, {"paperId": "5f79673b8d1b764f322aecde40b22c98ca8c5459", "title": "A Review of Fintech and Waqf Intersections in Academic Debates"}, {"paperId": "56de792e3a33c313bd94222b834a74c900fde39a", "title": "Halal research streams: A systematic and bibliometrics review"}, {"paperId": "3df3a9ec650307827a7aefd41a272eb2b2281bef", "title": "Entrepreneurial Accounting as a Driver of SMEs’ Sustainability: A Systematic Review"}, {"paperId": "5468d4264c7e27852c85564f5b481e5066d4a44f", "title": "An Experimental Methodology for Introducing Educational Robotics and Storytelling in Therapeutical Activities for Children with Neurodevelopmental Disorders"}, {"paperId": "b9f5769a16249e6b19148945f1c5e6ed688f5665", "title": "A Swedish case study of reprocessing of fashion products"}, {"paperId": "1cf999682f9bcc063702f95627dae38f29bba0ac", "title": "Pre-Computing Batch Normalisation Parameters for Edge Devices on a Binarized Neural Network"}, {"paperId": "0bf18dea4e7d40c3f95d3308d30ff74439f60883", "title": "Integrating Grammarly Tools to Enhance Writing Efficiency in Senior High School"}, {"paperId": "20b1ad46d075ecb59f9c7550e64e71e2cdfb01d0", "title": "Improvements of the Software Quality Assurance Process Towards Issues’ Effectiveness in a Global Software Development Environment."}, {"paperId": "f526cecf009daf366e9c9c2af18bbb82f7432b57", "title": "Psychometric Properties of the Acoso Sexual en las Instituciones de Educación Superior Scale (ASIES) in an Ecuadorian Sample"}, {"paperId": "000ad67ca3c7148e02deab8f2b3649beb55cacde", "title": "Extracellular thiamine concentration influences thermogenic competency of differentiating neck area-derived human adipocytes"}, {"paperId": "79e714a4523a4d2932bf7d889eb006c38de22c59", "title": "Can Machine Learning Predict the Phase Behavior of Surfactants?"}, {"paperId": "6dc2ccf425610b3f99c4d5c68e9eeb9897b2a515", "title": "An Overview of Blockchain and IoT Integration for Secure and Reliable Health Records Monitoring"}, {"paperId": "6245afbae986331e5c576608176f718545578d61", "title": "Horizontally Distributed Inference of Deep Neural Networks for AI-Enabled IoT"}, {"paperId": "92e99bafc3a4dd5c3ce68eb0fa042f1a4b2fbe17", "title": "Psychological Reactions of Lebanese Nurses to Workplace Violence in Critical Care Units"}, {"paperId": "04eaa4c553f7de53131ba5915601cfe94dcd5496", "title": "Quantitative ABCD Analysis of Consumers’ Intention toward Mitigation of Food Waste in Restaurants"}, {"paperId": "3140ac3cd7e918366c9262a82900cee09518d29f", "title": "The effect of workload and job stress on job satisfaction mediated by work motivation"}, {"paperId": "679e3f4b75899295a25c202a184a92abd41a7ca5", "title": "Moirai: A No-Code Virtual Serious Game Authoring Platform"}, {"paperId": "4493aa3f41deb145ad385d7fa6e2fb4805da03ab", "title": "Machine Learning for Software Engineering: A Tertiary Study"}, {"paperId": "20216a612308c42489e95efb84048b6e9aab6491", "title": "Vaccines"}, {"paperId": "796466ae91510e106b79ab5f9412ccf5da3b723d", "title": "APPLICATION OF LEAN OFFICE: OPPORTUNITIES AND TRENDS"}, {"paperId": "3bf83bc1408dc04e84afe4109f6710699b9a3bbf", "title": "Cardiotoxicity linked to anticancer agents and cardioprotective strategy"}, {"paperId": "cc05b2a60f93f853f87886ee3f2a7f4edb7ee2f1", "title": "7,8-Dihydroxyflavone attenuates the virulence of Staphylococcus aureus by inhibiting alpha-hemolysin"}, {"paperId": "4f15c3ec3979ab495245f86acca6ae5bd47943a9", "title": "Brain structural alterations in autism and criminal psychopathy"}, {"paperId": "9e0d815167e60c52f03b587b5df826baa46a20c3", "title": "Contrasting the Perception of Open Government among Public Officials: A Factor Analysis of Mexico and Spain"}, {"paperId": "96a32cb29be1e2741d26cc2e6e420ca46dcc915d", "title": "Using Lean to Improve Operational Performance in a Retail Store and E-Commerce Service: A Portuguese Case Study"}, {"paperId": "9948f35c871c418bf8a8a477af95f035281edb4c", "title": "Characteristics Associated With Loneliness and Coping Skills Utilization During the COVID-19 Pandemic"}, {"paperId": "07f23acb979fcef52732e6390479180d45e727f0", "title": "Perceptions of factors that facilitate and impede learning among twice-exceptional college students with autism spectrum disorder"}, {"paperId": "891f17b4956368103e63448c74b4a0a9212b5d99", "title": "Servant Leadership Effects on Salesperson Self-Efficacy, Performance, Job Satisfaction, and Turnover Intentions"}, {"paperId": "fa72a3b01aa7dfb05bf208d550ed69cac4516d37", "title": "Implementation of Low-Cost Laboratory in Education: A Systematic Literature Review"}, {"paperId": "acaa632c6d19a7257847f78ebd748f708cab03cb", "title": "The source of teacher work stress: a factor analysis approach"}, {"paperId": "4a9b8ab3e79681ebbe2303e6f2c9103ac4f398fe", "title": "Consequences of Online Misinformation on COVID-19: Two Potential Pathways and Disparity by eHealth Literacy"}, {"paperId": "6518a64185412331b45fd32ec3d204baf0904a60", "title": "The Social Bifurcation of Reality: Symmetrical Construction of Knowledge in Science-Trusting and Science-Distrusting Discourses"}, {"paperId": "430d413134c1e3c26574e43a5dfdfdc4fd01256f", "title": "Multi-Class Classification of Medical Data Based on Neural Network Pruning and Information-Entropy Measures"}, {"paperId": "b461cadcc70f20dbb638bbe207d58d6d1dd8bff7", "title": "Foundations for Esports Curricula in Higher Education"}, {"paperId": "dabe9703e2444dd038a19d70a967365a1e770495", "title": "From Lean Production to Lean 4.0: A Systematic Literature Review with a Historical Perspective"}, {"paperId": "c4083a51680783f5c0f20f2d73daebb325eb6cd7", "title": "COVID-19 pandemic disruption: a matter of building companies’ internal and external resilience"}, {"paperId": "e464fd9ecfa8570c3894fb408f351c127f8c26ab", "title": "COVID-19 impact: Customised economic stimulus package recommender system using machine learning techniques"}, {"paperId": "11abc224e2e1983a48957496973bd8ee7bf411ae", "title": "Helping Entrepreneurs Help Themselves: A Review and Relational Research Agenda on Entrepreneurial Support Organizations"}, {"paperId": "e32cd9eb3d3b2c6646681e63b243e1cc99e7d3ac", "title": "Exploring the role of loneliness in relation to self-injurious thoughts and behaviour in the context of the integrated motivational-volitional model."}, {"paperId": "cffbcb8dac85762b13f6e995315624f341868d89", "title": "Saliva as a Source of Biomarkers for Periodontitis and Periimplantitis"}, {"paperId": "58f08c634e653f25910cbb6bef0f619faef0ae7b", "title": "Social Media, Cognitive Reflection, and Conspiracy Beliefs"}, {"paperId": "1067380100c11ccd0381d431d7729020560d2b8c", "title": "Data Delivery in a Disaster or Quarantined Area Divided into Triangles Using DTN-Based Algorithms for Unmanned Aerial Vehicles"}, {"paperId": "bc4f3660b7a7f575f01714c061284fa20476986f", "title": "Rethinking Sustainability Requirements: Drivers, Barriers and Impacts of Digitalisation from the Viewpoint of Experts"}, {"paperId": "228139b2951a635f846a0c1818bafbc8d8c74db9", "title": "Challenges and opportunities in precision irrigation decision-support systems for center pivots"}, {"paperId": "39013a61377de6f139300e0aaf7638e2e36d933c", "title": "Stablecoins: Survivorship, Transactions Costs and Exchange Microstructure"}, {"paperId": "18b9f3652ca6bd0e3d0318ef42f9812cf634b3cb", "title": "Health impacts of daily weather fluctuations: Empirical evidence from COVID-19 in U.S. counties"}, {"paperId": "fc1fd2219ce05577de4a6835428696ea754fa9e0", "title": "A bibliometric review on the drivers of environmental migration"}, {"paperId": "0ade45bbad60c661cf12fb1b465df671d7350ea4", "title": "Influence of Knowledge Management Practices on Entrepreneurial and Organizational Performance: A Mediated-Moderation Model"}, {"paperId": "b226a81aca658739a3506eff96860c590140f29f", "title": "Serious games to prevent and detect bullying and cyberbullying: A systematic serious games and literature review"}, {"paperId": "3522cc51475c919a41384d8b1c529a9bc938e1c2", "title": "Parental attendance in two early-childhood training programmes to improve nurturing care: A randomized controlled trial"}, {"paperId": "e1aa6e1f8ed87b669fbb27585533ecbcb301bbb2", "title": "Developing and testing a new tool to foster wind energy sector industrial skills"}, {"paperId": "ccd203b2b2c246677759c108f0017f3d848ba1cb", "title": "Creation of mutants by using centrality criteria in social network analysis"}, {"paperId": "b140c049c0f0221a2d767e38887ae5c610dfba5c", "title": "Influence of Ambidextrous Learning on Eco-Innovation Performance of Startups: Moderating Effect of Top Management’s Environmental Awareness"}, {"paperId": "9d2465f978bcc507ba2045e99c015ffb750f1330", "title": "Middle and high school science teacher identity considered through the lens of the social identity approach: a systematic review of the literature"}, {"paperId": "6e2ba801cc12dbad88cf09d7557f290acb75a490", "title": "An opportunity-based explanation of entrepreneurial intention: evidence from global sourcing suppliers in China"}, {"paperId": "2efc2d834cba23096de91a68f7c69706b4b6fea8", "title": "The Mondora Method: Quantum Leaders in Benefit Corporations"}, {"paperId": "2da504b430a5b8d458387efe30e41077d751b151", "title": "Improving patients’ satisfaction in a mobile hospital using Lean Six Sigma – a design-thinking intervention"}, {"paperId": "3cda556ae4de83429d9d2cb8b5883a8a045f3c00", "title": "Correlation analysis of the severity and clinical prognosis of 32 cases of patients with COVID-19"}, {"paperId": "296d35407073bf905dc62f894b8aa2cdd383e11a", "title": "A systematic literature review of modern software visualization"}, {"paperId": "0823709b5b88635f9fb561410dfd89d38158fa6f", "title": "Lean practices implementation in aerospace based on sector characteristics: methodology and case study"}, {"paperId": "5452cae7689a8c2b0bb815518240ef9d6c9cb0cc", "title": "General practitioners’ predictions of their own patients’ health literacy: a cross-sectional study in Belgium"}, {"paperId": "a29de7d2fe71f4ed4b8c184a7948950294e0fd48", "title": "Choice for an Entrepreneurial Career: Do Cognitive Styles Matter?"}, {"paperId": "e776716bfe4f3c3fd20101b2e0b3f21409308471", "title": "Systematic Review of Self-Report Measures of General Mental Health and Wellbeing in Adolescent Mental Health"}, {"paperId": "5b80f962ab4ea4d3e5f90663b32b9c38b5ef5e7e", "title": "Predictors of mortality in older patients admitted to a geriatric hospital"}, {"paperId": "7d10f82e272280120fbc5d97c0a6d5508a67bbbb", "title": "Concevoir un produit pour plusieurs vies : Propositions pour la conception et l'évaluation environnementales de solutions en cascade"}, {"paperId": "112b13476d86983a8941f6ddc5ec1256de91cde5", "title": "A Catalogue Supporting Software Sustainability Design"}, {"paperId": "73b836a54988791d525a0aaf37c3500bbaa7a0c5", "title": "An Overlapless Incident Management Maturity Model for Multi-Framework Assessment (ITIL, COBIT, CMMI-SVC)"}, {"paperId": "500209181bd42a8522185595e5d2bad5e9d268a0", "title": "Service Oriented Software Engineering (SOSE):A Survey and Gap Analysis"}, {"paperId": "94746a3c00c3ca53ff1ed549faea295f9adf4182", "title": "Is there any gender‐specific difference in the cut‐off values of ankylosing spondylitis disease activity score in patients with axial spondyloarthritis?"}, {"paperId": "c23d99446d0963c0aedef7eae59e826b362a5211", "title": "Making economic evaluations more helpful for treatment choices in haemophilia"}, {"paperId": "57e8dfffe70e3eac1398664b5cde15400ef31b58", "title": "Neutron production from beam-modifying devices in a modern double scattering proton therapy beam delivery system"}, {"paperId": "473fe33c51b2f52a97b13eecb723c9b31703813d", "title": "Reference dosimetry in a scanned pulsed proton beam using ionisation chambers and a Faraday cup"}, {"paperId": "9e8ab609c7589e8102d3f41f0b99d94c4ef2cbc9", "title": "MODELS AND TOOLS FOR A QUALITY APPROACH IN THE PUBLIC ADMINISTRATION IN THE EUROPEAN UNION"}, {"paperId": "86a6a0ea0a3135a75b0662bbfafba49fc3332cae", "title": "A Study on Factors Affecting the Application of Social Responsibility Accounting in Manufacturing Enterprises of Vietnam"}, {"paperId": "702f65e5f77a137a587b52a36aeae646771b71c6", "title": "A Data Scientific Approach Towards Predictive Maintenance Application in Manufacturing Industry"}, {"paperId": "9a1aa2136bf3ea7a04fd5e1569e5f2f86a9a38e6", "title": "A review of digital maturity models for shipping companies"}, {"paperId": "ff52600cb5419e9a63dac1bbb328a63228587a08", "title": "Autism Spectrum Disorder in Physical Education in Primary School: a Systematic Review"}, {"paperId": "1761ff109a74bc9bdc372bf956f19d7bc9302407", "title": "Opportunity Recognition: A Comparative Analysis of Nascent Student Entrepreneurs and Non-Nascent Students"}, {"paperId": "714e4a06c9402cd665b8b4e6e6ebfbb728184564", "title": "Preventing Compassion Fatigue among Nurses : A Literature Review"}, {"paperId": "3e1089064e3dae2d6c358b1ed7f83e8ad76009ba", "title": "Recommendations For Developing Video Games To Address Depression Among College Students"}, {"paperId": "e1220d7f94f5b689c3988dbeee5044028e098d37", "title": "SousChef: Mobile Meal Recommender System for Older Adults"}, {"paperId": "843dd3a8c8bc3ad94c0b4806fbd2e85047cb43ad", "title": "Coordination Challenges in Global Software Development"}, {"paperId": "814fd9d2da27667c59beef922500d0f01f23a095", "title": "Gamification-supported Exploration and Practicing for Automotive User Interfaces and Vehicle Functions"}]}
