{"paperId": "109d9859c4e99188c1d4f4b71d2570a3bf017e75", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Heterogeneous Social Event Detection via Hyperbolic Graph Representations", "abstract": "Social events reflect the dynamics of society and, here, natural disasters and emergencies receive significant attention. The timely detection of these events can provide organisations and individuals with valuable information to reduce or avoid losses. However, due to the complex heterogeneities of the content and structure of social media, existing models can only learn limited information; large amounts of semantic and structural information are ignored. In addition, due to high labour costs, it is rare for social media datasets to include high-quality labels, which also makes it challenging for models to learn information from social media. In this study, we propose two hyperbolic graph representation-based methods for detecting social events from heterogeneous social media environments. For cases where a dataset has labels, we designed a Hyperbolic Social Event Detection (HSED) model that converts complex social information into a unified social message graph. This model addresses the heterogeneity of social media, and, with this graph, the information in social media can be used to capture structural information based on the properties of hyperbolic space. For cases where the dataset is unlabelled, we designed an Unsupervised Hyperbolic Social Event Detection (UHSED). This model is based on the HSED model but includes graph contrastive learning to make it work in unlabelled scenarios. Extensive experiments demonstrate the superiority of the proposed approaches.", "venue": "IEEE Transactions on Big Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-20", "journal": {"name": "ArXiv", "volume": "abs/2302.10362"}, "authors": [{"authorId": "2208967342", "name": "Zitai Qiu"}, {"authorId": "2142734769", "name": "Jia Wu"}, {"authorId": "2118801701", "name": "Jian Yang"}, {"authorId": "2106353243", "name": "Xing Su"}, {"authorId": "1682418", "name": "C. Aggarwal"}], "citations": []}
