{"paperId": "10a398e55ef003c0c28b43a8da86d8a1f880eadb", "publicationVenue": null, "title": "An Automobile Environment Detection System Based on Deep Neural Network and its Implementation Using IoT-Enabled In-Vehicle Air Quality Sensors", "abstract": "This paper elucidates the development of a deep learning–based driver assistant that can prevent driving accidents arising from drowsiness. As a precursor to this assistant, the relationship between the sensation of sleep depravity among drivers during long journeys and CO2 concentrations in vehicles is established. Multimodal signals are collected by the assistant using five sensors that measure the levels of CO, CO2, and particulate matter (PM), as well as the temperature and humidity. These signals are then transmitted to a server via the Internet of Things, and a deep neural network utilizes this information to analyze the air quality in the vehicle. The deep network employs long short-term memory (LSTM), skip-generative adversarial network (GAN), and variational auto-encoder (VAE) models to build an air quality anomaly detection model. The deep learning models gather data via LSTM, while the semi-supervised deep learning models collect data via GANs and VAEs. The purpose of this assistant is to provide vehicle air quality information, such as PM alerts and sleep-deprived driving alerts, to drivers in real time and thereby prevent accidents.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-21", "journal": {"name": "Sustainability", "pages": "2475", "volume": "12"}, "authors": [{"authorId": "2110889442", "name": "Jae-joon Chung"}, {"authorId": "2115443808", "name": "Hyun Jung Kim"}], "citations": [{"paperId": "6e5b269dff8268a32c404e4e578824efc6177c5f", "title": "Smart home system using blockchain technology in green lighting environment in rural areas"}, {"paperId": "46fa0759807c369753e584dbd98c7c82ead40ca9", "title": "Predicting real-time within-vehicle air pollution exposure with mass-balance and machine learning approaches using on-road and air quality data"}, {"paperId": "b8264c595799b1000a63a01d5f10888df33021ae", "title": "Design and Implementation of an Intelligent Safety and Security System for Vehicles Based on GSM Communication and IoT Network for Real-Time Tracking"}, {"paperId": "0d92ac97a4e5b77546fb9201d6dd591ff8849185", "title": "Image-based Air Quality Prediction using Convolutional Neural Networks and Machine Learning"}, {"paperId": "bc118e2ef30ff294169b52d78026f6b97f383606", "title": "Critical monitoring of the crops and conditions though IoT for agricultural systems"}, {"paperId": "8416090646fb39cad3ba131a92030ae9e50382c7", "title": "Research on threat intelligence detection model based on deep neural network"}, {"paperId": "77c9732483a29231a93e00aef05bab264c4aa607", "title": "Data Quality in IoT-Based Air Quality Monitoring Systems: a Systematic Mapping Study"}, {"paperId": "f76b6af3d19bfba471b37cb6eca36210754c55ae", "title": "Smart Controller for Air Conditioning in Car using IoT"}, {"paperId": "255a7e3a63f86fe5a00cd00c224869b1e45ac8d0", "title": "IoT (Internet of Things) Going to Monitor System for Safe Agricultural Production Application"}, {"paperId": "d8669c4ffbc7d455d5b27eda1de1de67bf2094ee", "title": "A Secure and Reliable Device Access Control Scheme for IoT based Monitoring Systems"}, {"paperId": "fe9387af4ea90ff02840d7a9057b230032871ee6", "title": "Introduction of a Novel Anomalous Sound Detection Methodology"}, {"paperId": "3b9bd2034932a938f9511f51ea94ec1d1736eba6", "title": "On the prediction of air quality within vehicles using outdoor air pollution: sensors and machine learning algorithms"}, {"paperId": "b0ce8f1f8e739566e958b7537bd70f43715593e0", "title": "Kalman and Cauchy clustering for anomaly detection based authentication of IoMTs using extreme learning machine"}, {"paperId": "59676d56e23682724ca15a3c9ff09cad1e2a196b", "title": "Accident Detection in Autonomous Vehicles Using Modified Restricted Boltzmann Machine"}, {"paperId": "a5cf89c27716a0566f881c7c1253759ef3bf21ae", "title": "Deep and Reinforcement Learning Technologies on Internet of Vehicle (IoV) Applications: Current Issues and Future Trends"}, {"paperId": "54f75e66ac7d6eafe374e693f272b428bbffd79d", "title": "Applications of Generative Adversarial Networks in Anomaly Detection: A Systematic Literature Review"}, {"paperId": "a279149a18399f126c93bb1b3bbf506907d66543", "title": "Automatic Warning System for Drivers using Deep Learning Algorithm"}, {"paperId": "6a2c3d388468469f60b5e6f25a1201ed7591522b", "title": "Experimental demonstration of valley-protected backscattering suppression and interlayer topological transport for elastic wave in three-dimensional phononic crystals"}, {"paperId": "3add2454394b5b953cb9236227371bb8daa42625", "title": "The Role of 5G Technologies in a Smart City: The Case for Intelligent Transportation System"}, {"paperId": "4814237990c2916ff783b6b77ea0b09ee701a4dd", "title": "Impact of COVID-19 on IoT Adoption in Healthcare, Smart Homes, Smart Buildings, Smart Cities, Transportation and Industrial IoT"}, {"paperId": "eca20e79d9b1237c4458279abbf51dc40600579d", "title": "Construction and verification of retinal vessel segmentation algorithm for color fundus image under BP neural network model"}, {"paperId": "96902ba638b954010fd674c11482e4fa037e42a8", "title": "Classification of High - Voltage Ignition Waveforms Using Deep Learning"}, {"paperId": "451f8bf92747dcc316afe0a64e28b2df3db2b476", "title": "Monitoring Air Quality and Estimation of Personal Exposure to Particulate Matter Using an Indoor Model and Artificial Neural Network"}, {"paperId": "26ebc96f7d2ae6e9297e04f8998df2c1a8b55760", "title": "The impact of the air exchange rate onto the concentration of pollutant particles in the car cabin"}, {"paperId": "f81f826acec87abb9a6e2d39a7871ad1fa6fea22", "title": "IoT-Driven Bayesian Learning: A Case Study of Reducing Road Accidents of Commercial Vehicles on Highways"}, {"paperId": "52bbc1524d3b0d943f02e07614ef44bde74b2c9f", "title": "Impact of COVID-19 on Adoption of IoT in Different Sectors"}, {"paperId": "5f719973c6129a6c5ee05e1fc6ad90ce1b366067", "title": "A Survey on Vehicle Efficiency Monitoring"}, {"paperId": "c4a2f4f4191f3b88f08513b43b0bfda1b24e80fd", "title": "The Approaches of Positive Experience Design on IoT Intelligent Products"}, {"paperId": "92b3985295c443bbfcc93906f1452f797f0b836a", "title": "M EASUREMENT AND E VALUATION OF A IR Q UALITY M ONITORING T OOL FOR P ASSENGER V EHICLES"}, {"paperId": "adc8ccbe4e17f5c9594f79edbcca353dc38fbf85", "title": "Towards a new era of IoT applications to overcome Pandemic situations: Intelligent systems and recovery strategies to overcome Covid-19"}]}
