{"paperId": "10a7f6bbe7b9d1cce4c8c0230eec4358f77c855b", "publicationVenue": {"id": "fbbafe0e-5e14-431f-9456-f569300a37cb", "name": "IEEE Open Journal of the Communications Society", "type": "journal", "alternate_names": ["IEEE Open J Commun Soc"], "issn": "2644-125X", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782661"}, "title": "Multivariate Forecasting of Network Traffic in SDN-Based Ubiquitous Healthcare System", "abstract": "The emerging 5G network has been revolutionizing the data transfer across the networks. Recently, advanced technologies transform the healthcare industry. With the emergence of 5G technology, smart and ubiquitous healthcare systems are interconnected with high speed and low latency. As ubiquitous healthcare applications require stringent network requirements, managing network traffic and resources becomes difficult. Internet of Medical Things (IoMT) devices generates a large volume and variety of data, including physiological signals, images, and videos. As many medical applications require real-time communication and data transfer, this puts high demands on the network, which needs handle low latency, high availability, and high reliability. Achieving consistent QoS is challenging due to the inherent limitations of conventional methods which are susceptible to network congestion and latency issues. The next generation of Software Defined Networking (SDN) in IoMT can play a vital role in supporting traffic management. Reliable classification and forecasting will enable the SDN controller to make optimal routing decisions dynamically. Therefore in this paper, a novel Medical Traffic Forecasting framework based on Weighted Multivariate Singular Spectrum Analysis (MTF-WMSSA) is proposed for an SDN-enabled IoMT healthcare network to analyze and forecast network traffic and ensure accurate real-time medical data transfer. The evaluation was conducted on the EHMS dataset to study the performance of the proposed method. The comparison of the proposed MTF-WMSSA is made with classical methods such as SVR and LSTM. The result shows that the proposed MTF-WMSSA exhibits improved classification accuracy of 93%. The network parameters that are forecasted are average traffic load, average packet arrival rate and average jitter. The MAPE of the multi-step ahead forecast is 13.64 and 11.41 for short and long intervals respectively. The forecasting algorithm proposed in this paper can efficiently determine future flow parameters which help to implement adaptive traffic engineering. The evaluation was conducted on the dataset to study the performance of the proposed method. The result shows that the proposed MTF-WMSSA exhibits better accuracy for multi-step ahead forecast and outperforms the classical methods.", "venue": "IEEE Open Journal of the Communications Society", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Open Journal of the Communications Society", "pages": "1537-1550", "volume": "5"}, "authors": [{"authorId": "1396274220", "name": "Deva Priya Isravel"}, {"authorId": "2112301", "name": "Salaja Silas"}, {"authorId": "46219977", "name": "Jaspher W. Kathrine"}, {"authorId": "1748252", "name": "E. Rajsingh"}, {"authorId": "2292279471", "name": "I. J. A. Member"}], "citations": []}
