{"paperId": "10ae3c23579256728ad044a0474c707596ae1f54", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Construction of Innovative Working Mode of College Counselors Based on Data Mining Technology", "abstract": "Data mining technology can analyze and mine university management data, provide more data support for university management, and play an important role in optimizing teaching quality, but these technologies are rarely applied to the work of university counselors. Based on this, this paper studies the construction and research of college counselors’ innovative work mode based on data mining technology. Based on the simple analysis of the impact of big data on the traditional working mode of counselors, this paper introduces the application of data mining commonly used in colleges and universities and puts forward the existing shortcomings. The innovative working mode of college counselors is designed. In the analysis of students’ daily behavior, the advantages of cluster analysis and support vector machine are used to analyze students’ consumption behavior. The Apriori algorithm is applied to the student achievement early warning management to improve the Apriori algorithm. Simulation results show that the proposed algorithm can shorten the running time, reduce the number of frequent item sets, and improve the classification accuracy.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-16", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2152508708", "name": "Lei Wang"}, {"authorId": "2293558255", "name": "Jian Xu"}], "citations": [{"paperId": "a551107790c5efdbc3d094ac1ce4387f9db1cb0a", "title": "Retracted: Construction of Innovative Working Mode of College Counselors Based on Data Mining Technology"}]}
