{"paperId": "10b5efd52221d43cb0be2f8ff709c0392980a2a5", "publicationVenue": null, "title": "Predicting Student Performance Using Mental Health and Linguistic Attributes with Deep Learning", "abstract": "Early prediction of students' academic performance is a critical research topic in educational data mining. ML models have been developed to predict academic performance, but it has become difficult to extract high-quality handcrafted attributes due to the large dataset. To solve this issue, a Deep Neural Network (DNN) was presented to automatically extract attributes from students' multi-source data. However, it didn’t deal with the student’s mental health and their mood changes (i.e., physiological attributes), which were also essential to increase the prediction performance. Thus, this article proposes a Student Accomplishment prediction using the Distinctive Deep Learning (SADDL) model. First, the student’s academic and demographic attributes are collected along with the posts shared by them about academic performance on online social networks. A Latent Dirichlet Allocation (LDA) is applied to extract the physiological attributes from the online posts data. Then, all the attributes of students’ data are given to the SADDL network, which comprises three modules: (i) a Long Short-Term Memory (LSTM) module to learn the temporal dependency; (ii) a multidimensional Deep Convolutional Neural Network (DCNN) module to learn the correlation attributes and (iii) a Multi-Layer Perceptron (MLP) module to predict the students’ academic performance. Finally, the experimental results show that the SADDL can predict students’ academic performance with an accuracy of 91.71% while using 80% training and 20% test dataset, which is 9.91% improved than the existing ML models. Similarly, the SADDL has 89.3% while using 70% training and 30% test dataset, which is 10.36% higher than the existing ML models", "venue": "Revue d'Intelligence Artificielle", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Revue d'Intelligence Artificielle"}, "authors": [{"authorId": "2243591428", "name": "Bakyalakshmi Venkatachalam"}, {"authorId": "2243596350", "name": "Kanchana Sivanraju"}], "citations": [{"paperId": "5eca1c72175686cfdcd4616ffecdbb6f511e8a50", "title": "An ID3 Decision Tree Algorithm-Based Model for Predicting Student Performance Using Comprehensive Student Selection Data at Telkom University"}]}
