{"paperId": "10bbf28d4ca11421ef61e64bfb2c3130a3987059", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Pufferfish: Container-driven Elastic Memory Management for Data-intensive Applications", "abstract": "Data-intensive applications often suffer from significant memory pressure, resulting in excessive garbage collection (GC) and out-of-memory (OOM) errors, harming system performance and reliability. In this paper, we demonstrate how lightweight virtualization via OS containers opens up opportunities to address memory pressure and realize memory elasticity: 1) tasks running in a container can be set to a large heap size to avoid OutOfMemory (OOM) errors, and 2) tasks that are under memory pressure and incur significant swapping activities can be temporarily \"suspended\" by depriving resources from the hosting containers, and be \"resumed\" when resources are available. We propose and develop Pufferfish, an elastic memory manager, that leverages containers to flexibly allocate memory for tasks. Memory elasticity achieved by Pufferfish can be exploited by a cluster scheduler to improve cluster utilization and task parallelism. We implement Pufferfish on the cluster scheduler Apache Yarn. Experiments with Spark and MapReduce on real-world traces show Pufferfish is able to avoid OOM errors, improve cluster memory utilization by 2.7x and the median job runtime by 5.5x compared to a memory over-provisioning solution.", "venue": "ACM Symposium on Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-20", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "40377061", "name": "Aidi Pi"}, {"authorId": "1891284", "name": "Shaoqi Wang"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}], "citations": [{"paperId": "072ca19c50fb6b59c207bddb02b15b1a2fec52cd", "title": "Container Restart Reduction Technique in Kubernetes Using Memory Oversubscription"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "c851cf4982f3cdb238354affb9b04927f15c66b7", "title": "Adapt Burstable Containers to Variable CPU Resources"}, {"paperId": "3e46e3f8ff04807067835d633e8007beee23dabf", "title": "Holmes: SMT Interference Diagnosis and CPU Scheduling for Job Co-location"}, {"paperId": "d29e8643affd5d3ee99a8cdd1292bed7ffd38804", "title": "Memory at your service: fast memory allocation for latency-critical services"}, {"paperId": "f3fb6b8e317a5d98169bd001e5803d0bb52460d6", "title": "Preemptive and Low Latency Datacenter Scheduling via Lightweight Containers"}, {"paperId": "2108e27dce37168cbabcefd9e6616079038eed69", "title": "RITA: Efficient Memory Allocation Scheme for Containerized Parallel Systems to Improve Data Processing Latency"}, {"paperId": "1a725e6ebbcc4548c3f1ce16dc45157bb5034daa", "title": "OS-Augmented Oversubscription of Opportunistic Memory with a User-Assisted OOM Killer"}, {"paperId": "4294e2d1990c4b307142ba57d96211b86cc8bd61", "title": "Adaptive Online Estimation of Thrashing-Avoiding Memory Reservations for Long-Lived Containers"}]}
