{"paperId": "10c102de76c5fbd3f81ba1dfb6bf0002cb7a3182", "publicationVenue": {"id": "fcad2179-afdc-4360-ad8b-8b714f64dab3", "name": "AIMS Mathematics", "alternate_names": ["AIM Math"], "issn": "2473-6988", "url": "https://www.aimspress.com/journal/Math", "alternate_urls": ["https://www.aimspress.com/journal/Math/archive.html"]}, "title": "Reinforcement learning-based AI assistant and VR play therapy game for children with Down syndrome bound to wheelchairs", "abstract": "\nSome of the most significant computational ideas in neuroscience for learning behavior in response to reward and penalty are reinforcement learning algorithms. This technique can be used to train an artificial intelligent (AI) agent to serve as a virtual assistant and a helper. The goal of this study is to determine whether combining a reinforcement learning-based Virtual AI assistant with play therapy. It can benefit wheelchair-bound youngsters with Down syndrome. This study aims to employ play therapy methods and Reinforcement Learning (RL) agents to aid children with Down syndrome and help them enhance their abilities like physical and mental skills by playing games with them. This Agent is designed to be smart enough to analyze each patient's lack of ability and provide a specific set of challenges in the game to improve that ability. Increasing the game's difficulty can help players develop these skills. The agent should be able to assess each player's skill gap and tailor the game to them accordingly. The agent's job is not to make the patient victorious but to boost their morale and skill sets in areas like physical activities, intelligence, and social interaction. The primary objective is to improve the player's physical activities such as muscle reflexes, motor controls and hand-eye coordination. Here, the study concentrates on the employment of several distinct techniques for training various models. This research focuses on comparing the reinforcement learning algorithms like the Deep Q-Learning Network, QR-DQN, A3C and PPO-Actor Critic. This study demonstrates that when compared to other reinforcement algorithms, the performance of the AI helper agent is at its highest when it is trained with PPO-Actor Critic and A3C. The goal is to see if children with Down syndrome who are wheelchair-bound can benefit by combining reinforcement learning with play therapy to increase their mobility.\n", "venue": "AIMS Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "AIMS Mathematics"}, "authors": [{"authorId": "2217732788", "name": "Joypriyanka Mariselvam"}, {"authorId": "5463522", "name": "Surendran Rajendran"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}], "citations": [{"paperId": "1e462292921b18533df5d56ded635a00f4beebfd", "title": "Impact of AI-Powered Solutions in Rehabilitation Process: Recent Improvements and Future Trends"}, {"paperId": "27a9a4330ec1985c165a6d8c9376450a9fc89353", "title": "Computational linguistics based text emotion analysis using enhanced beetle antenna search with deep learning during COVID-19 pandemic"}, {"paperId": "25eb7e07d564d3210c3f9941d384592b3332c7a4", "title": "Reinforcement Learning in Supermarket Tycoon to Enhance Multitasking and Problem-Solving in Autistic Children"}, {"paperId": "62526ce5efc2f64740156dff29b0143ab59b5bc8", "title": "Hybrid Recommendations System for Women Health Nutrition at Menstruation Cycle"}, {"paperId": "754cdeb0cc8988684abb6771c90ea25859c113da", "title": "CheckersMind: Enhancing Cognitive Ability in Dimentia Patients Through Checkers Game Therapy with Chatbot"}, {"paperId": "312d4dcb06126e59fc736a937edd05302661d9bd", "title": "Checkers Game Therapy to Improve the Mental Ability Of Alzheimer’s Patient using AI Virtual Assistant"}, {"paperId": "413d1037dfc5bcf5cf91687e36c5aed9afc41815", "title": "Inverse chi-square-based flamingo search optimization with machine learning-based security solution for Internet of Things edge devices"}]}
