{"paperId": "10c70f3b25fe332de58f278aae0c78e580384399", "publicationVenue": {"id": "95476c30-e600-4582-aa77-bf9db261be05", "name": "International Symposium on Industrial Electronics", "type": "conference", "alternate_names": ["International Conference on Intelligence Science and Information Engineering", "ISIE", "Int Symp Ind Electron", "Int Conf Intell Sci Inf Eng"]}, "title": "Detecting Out-Of-Control Sensor Signals in Sheet Metal Forming using In-Network Computing", "abstract": "The ongoing digitization of production enables the collection of increasing volumes of data. These, in turn, allow for data-driven analysis that has the potential for deepening the process understanding by discovering previously unknown connections between process components and parameters. With these opportunities, however, come substantial challenges as current industrial settings are inadequately equipped for handling these large amounts of data. While setting up a local processing infrastructure is challenging, the limited bandwidth within many shop floors as well as their network access also make an upload of all data to external compute capacities infeasible. What is needed are local, process-aware filters that allow for significant data reduction while retaining data of value that can be used for the subsequent analysis. In this paper, we thus propose to leverage In-Network Computing to dynamically detect different states of the physical processes and then filter the sensor values on the data path. Our presented architecture maps the state detection to the switch-local controlplane while fast filtering decisions are performed at line-rate in the dataplane, thus enabling flexible and quick adjustments of the chosen sensor filtering. At the example of a fine-blanking line, we consequently demonstrate that In-Network Computing can sensibly support previously infeasible data analysis techniques in the industrial production landscape.", "venue": "International Symposium on Industrial Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-20", "journal": {"name": "2021 IEEE 30th International Symposium on Industrial Electronics (ISIE)", "pages": "1-6"}, "authors": [{"authorId": "20543442", "name": "Ike Kunze"}, {"authorId": "50981710", "name": "Philipp Niemietz"}, {"authorId": "2055764501", "name": "Liam Tirpitz"}, {"authorId": "1839155", "name": "René Glebke"}, {"authorId": "3488804", "name": "D. Trauth"}, {"authorId": "3172734", "name": "T. Bergs"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "b81195a3c388aecdf52d7739f3d9747a3add7403", "title": "Madtls: Fine-grained Middlebox-aware End-to-end Security for Industrial Communication"}, {"paperId": "95448a0a598b5ac31f518dacea27d9c02da51373", "title": "An Intelligent User Plane to Support In-Network Computing in 6G Networks"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "title": "A Computer Science Perspective on Digital Transformation in Production"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "f48dea788ea389c873de1c7d90f04c7fb15acac8", "title": "The Road to Accountable and Dependable Manufacturing"}, {"paperId": "c1553e864ec182d96c3d1c2fe7a99f4a7c589039", "title": "Modular Control and Services to Operate Lineless Mobile Assembly Systems"}]}
