{"paperId": "10c8008d07037b36a09011dc43414e3d3f397d3e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Split Computing Video Analytics Performance Enhancement With Auction-based Resource Management", "abstract": "Recently, computer vision applications based on deep neural networks (DNN) have developed rapidly. They are expected to be used in Internet-of-Things (IoT) systems such as smart cities, factories of the future, and security surveillance cameras. However, resource-limited IoT devices cannot execute such computationally intensive inference tasks locally within a reasonable time. Edge computing and the split computing technique provide such systems with a solution that reduces the inference latency and improves the system performance by enabling collaborative inference between the devices and the nearby edge server and alleviating the large uplink transmission with the split point carefully selected. This article proposes an incentive-compatible mechanism to configure the frame rate and the input resolution of the camera network for video analytics using layer-level split computing. Specifically, we evaluate the performance of the system at the video level, where the frame rate and the input resolution are both configuration knobs that contribute to accuracy. We also address the joint resource allocation and the split point decision problem for split computing that underlies the configuration. We show that the proposed mechanism achieves optimal configuration and guarantees truthfulness, individual rationality, and weak budget balance.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "106495-106505", "volume": "10"}, "authors": [{"authorId": "2187027703", "name": "Kai-Jung Fu"}, {"authorId": "2108762411", "name": "Ya-Ting Yang"}, {"authorId": "2426572", "name": "Hung-Yu Wei"}], "citations": []}
