{"paperId": "10d6da89c47ecd81a17cc0f16f5e9dc26153acd4", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "Paradise: Real-Time, Generalized, and Distributed Provenance-Based Intrusion Detection", "abstract": "Identifying intrusion from massive and multi-source logs accurately and in real-time presents challenges for today's users. This article presents Paradise, a real-time, generalized, and distributed provenance-based intrusion detection method. Paradise introduces a novel extract strategy to prune and extract process feature vectors from provenance dependencies at the system log level, and it stores them in high-efficiency memory databases. Using this strategy, Paradise does not depend on the specific operating system type or provenance collection framework. Provenance-based dependencies are calculated independently during the detection phase, thus, Paradise can negotiate all detection results from multiple detectors without extra communication overhead between detectors. Paradise also employs an efficient load-balanced distribution scheme that enhances the Kafka architecture to efficiently distribute provenance graph feature vectors to the detectors. The experimental results demonstrate that our method has a high detection accuracy with a low time overhead.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "1624-1640", "volume": "20"}, "authors": [{"authorId": "47096442", "name": "Yafeng Wu"}, {"authorId": "37831075", "name": "Yulai Xie"}, {"authorId": "2159781440", "name": "Xuelong Liao"}, {"authorId": "2113326015", "name": "Pan Zhou"}, {"authorId": "144688379", "name": "D. Feng"}, {"authorId": "2160071675", "name": "Lin Wu"}, {"authorId": "2144461825", "name": "Xuan Li"}, {"authorId": "2170018", "name": "Avani Wildani"}, {"authorId": "152584060", "name": "D. Long"}], "citations": [{"paperId": "c2a630bde512cd825f3fbcb05876406b82289534", "title": "Toward a Reliable Evaluation of Machine Learning Schemes for Network-Based Intrusion Detection"}, {"paperId": "096b262954aff34fd1abcaedfff89d57019363db", "title": "ExpSSOA-Deep maxout: Exponential Shuffled shepherd optimization based Deep maxout network for intrusion detection using big data in cloud computing framework"}, {"paperId": "4556df83f01ef1fd71dcc7a597fb92d5647b511e", "title": "Secure and Ultra-Reliable Provenance Recovery in Sparse Networks: Strategies and Performance Bounds"}]}
