{"paperId": "10d8c5d002509d339d2e4811be4fce9a6694b422", "publicationVenue": {"id": "1c2f3998-b5ca-48ca-9991-94b71c71ecb7", "name": "IEEE Transactions on Smart Grid", "type": "journal", "alternate_names": ["IEEE Trans Smart Grid"], "issn": "1949-3053", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5165411"}, "title": "Privacy-Preserving Probabilistic Voltage Forecasting in Local Energy Communities", "abstract": "This paper presents a new privacy-preserving framework for the short-term (multi-horizon) probabilistic forecasting of nodal voltages in local energy communities. This task is indeed becoming increasingly important for cost-effectively managing network constraints in the context of the massive integration of distributed energy resources. However, traditional forecasting tasks are carried out centrally, by gathering raw data of end-users in a single database that exposes their private information. To avoid such privacy issues, this work relies on a distributed learning scheme, known as federated learning wherein individuals’ data are kept decentralized. The learning procedure is then augmented with differential privacy, which offers formal guarantees that the trained model cannot be reversed-engineered to infer sensitive local information. Moreover, the problem is framed using cross-series learning, which allows to smoothly integrate any new client joining the community (i.e., cold-start forecasting) without being plagued by data scarcity. Outcomes show that the proposed approach achieves improved performance compared to non-collaborative (locally trained) models, and is able to reach a trade-off between privacy and performance for different architectures of deep learning networks.", "venue": "IEEE Transactions on Smart Grid", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-24", "journal": {"name": "IEEE Transactions on Smart Grid", "pages": "798-809", "volume": "14"}, "authors": [{"authorId": "3440913", "name": "J. Toubeau"}, {"authorId": "2068745268", "name": "F. Teng"}, {"authorId": "2154459351", "name": "Yi Wang"}, {"authorId": "2046873714", "name": "Leandro Von Krannichfeldt"}, {"authorId": "2016795", "name": "Thomas Morstyn"}], "citations": [{"paperId": "5670c48c12624126df1e2cf9d1644e83abb0fd96", "title": "Decentralized Privacy-Preserving Electricity Theft Detection for Distribution System Operators"}, {"paperId": "d16f1b3f49685e811e9dd99e02955d42e369ee6d", "title": "Deep Multi-Fidelity Bayesian Data Fusion for Probabilistic Distribution System Voltage Estimation With High Penetration of PVs"}, {"paperId": "b52cb08a4e29a779d658bcbd14a76fee684014e3", "title": "Transfer Learning-Based Framework Enhanced by Deep Generative Model for Cold-Start Forecasting of Residential EV Charging Behavior"}, {"paperId": "412b5fdd69761ad54e3a174c09873a771cf8786c", "title": "Assessing Probabilistic Load Forecasting Accuracy Against Customer Privacy Constraints At a Low Aggregate Level"}, {"paperId": "f7f5f480aee6701d1432a2b89212d78995e1ca96", "title": "Probabilistic Physics-Informed Graph Convolutional Network for Active Distribution System Voltage Prediction"}, {"paperId": "debfad45ffc6b0a401ed047af0375af2d37b766c", "title": "Personalized Federated DARTS for Electricity Load Forecasting of Individual Buildings"}, {"paperId": "556869546f780396cf0d952a985708868d306219", "title": "A Deep Learning-Driven Self-Conscious Distributed Cyber-Physical System for Renewable Energy Communities"}, {"paperId": "2ff796c2b2a7290f692a9b329ca47035aeffbae6", "title": "Customized Load Profiles Synthesis for Electricity Customers Based on Conditional Diffusion Models"}, {"paperId": "f61fc0b2c3dca838767ae12218e800197cd0a6aa", "title": "Crossing Roads of Federated Learning and Smart Grids: Overview, Challenges, and Perspectives"}, {"paperId": "787f7c3196445e8d85e58507f57f633e6505c3a7", "title": "Data Sharing in Energy Systems"}, {"paperId": "47cbefb68fddfb28b06e11e211938a819720b2b1", "title": "Privacy Preserving Ultra-Short-term Wind Power Prediction Based on Secure Multi Party Computation"}, {"paperId": "d80537083943b7a2a5fb41b5a12f9edbe238bc6f", "title": "Distributed Baseline Load Estimation for Load Aggregators Based on Joint FCM Clustering"}]}
