{"paperId": "10ef7035f8043afc37544b7b48d98af54c743e67", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Cluster Analysis Based on Fasting and Postprandial Plasma Glucose and Insulin Concentrations", "abstract": "Plasma glucose and insulin concentrations are clinical markers used in the diagnosis of metabolic diseases, particularly prediabetes and diabetes. In this paper, we carried out a cluster analysis using plasma glucose and insulin data in fasting and two-hour postprandial. Different clustering experiments were performed by changing the attributes, from one (fasting glucose) to four (fasting and postprandial glucose and insulin) attribute input to a k-means clustering algorithm. Based on the elbow and silhouette methods, three clusters were chosen to carry out the clustering experiments. The Pearson correlation coefficient was used to assess the dependence between the glucose and insulin levels for each cluster created. Results show that one cluster contained prediabetics, another cluster contained diabetics, and subjects without prediabetes and diabetes were assigned to another cluster. Although age was not used as an attribute, we have found that subjects in the three clusters have a different age range. Finally, significant correlations were found between insulin levels in fasting and postprandial and between glucose levels in fasting and postprandial. These associations were stronger in the cluster containing diabetics, where insulin production or action is compromised.", "venue": "bioRxiv", "year": 2019, "fieldsOfStudy": ["Biology", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-02", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2141323", "name": "M. Altuve"}, {"authorId": "2971017", "name": "E. Severeyn"}], "citations": [{"paperId": "2e304882f3243e67712414901f73eb1e03ce5da4", "title": "Multiclass classification of metabolic conditions using fasting plasma levels of glucose and insulin"}]}
