{"paperId": "10fbb4e20fe4a6d207439fe38b69b0a1dcc43fe2", "publicationVenue": null, "title": "Traffic-Aware and Energy-Efficiency Network Oriented Spatio-Temporal Analysis and Traffic Prediction", "abstract": "5G applies innovative wireless technology to ultradense deployment to improve coverage and data rate, which brings new challenges to traffic management. Consideration into traffic-aware and energy-efficiency in network optimization is highly required. It is necessary to adjust the network in a green way to ensure the real-time experience of users. In this paper, Call detail record (CDR) data of real network data was used to construct the spatio-temporal model, and a time series decomposing-integrating based prediction method is proposed. From the perspective of time, working day data and weekend data are processed separately; From the perspective of space, geographic grids are divided according to different scenes, such as living area, office area, etc. The prediction result of the selected region and the suggestions for the adjustment of dynamic resource allocation based on spatio- temporal model were obtained, especially for the resource allocation and load balancing. The result showed that compared with the traditional ARIMA algorithm, the proposed algorithm could reduce the computational complexity and improved the accuracy and stability of the prediction.", "venue": "2019 IEEE Globecom Workshops (GC Wkshps)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Globecom Workshops (GC Wkshps)", "pages": "1-6"}, "authors": [{"authorId": "29883240", "name": "Kaisa Zhang"}, {"authorId": "2328747", "name": "Gang Chuai"}, {"authorId": "2153576256", "name": "Weidong Gao"}, {"authorId": "1557387315", "name": "Jinxi Zhang"}, {"authorId": "1557388238", "name": "Xuewen Liu"}], "citations": [{"paperId": "bf6d8841f41e460ff24a50672129c57433581169", "title": "Intelligent Cellular Traffic Prediction in Open-RAN Based on Cross-Domain Data Fusion"}, {"paperId": "149d1d5f2ede458a1018fe104826424682059ada", "title": "Spatial-temporal Cellular Traffic Prediction: A Novel Method Based on Causality and Graph Attention Network"}]}
