{"paperId": "10fbce998c1eaabe7d2a14752cc76993c787dbb2", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "LiDiTE: A Full-Fledged and Featherweight Digital Twin Framework", "abstract": "The rising of the Cyber-Physical System (CPS) and the Industry 4.0 paradigms demands the design and implementation of Digital Twin Frameworks (DTFs) that may support the quick build of reliable Digital Twins (DTs) for experimental and testing purposes. Most of the current DTF proposals allow the generation of DTs at a good pace but affect generality, scalability, portability, and completeness. As a consequence, current DTF are mostly domain-specific and hardly span several application domains (e.g., from simple IoT deployments to the modeling of complex critical infrastructures). Furthermore, the generated DTs often requires a high amount of computational resource to run. In this paper, we present LiDiTE, a solution based on a novel reference model for general-purpose DTFs. LiDiTE overcomes the limitations of state-of-the-art tools by supporting the fine-grained development of real-world complexity scenarios. To achieve that, LiDiTE builds on technologies that favor scalability, reuse, and extensibility of scenarios. We show such features by building the DT of real critical infrastructure and evaluating the performance of our DT against those of the real system. Further contributions of this paper include open access to the source code of LiDiTE and the experimental dataset.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-14", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "4899-4912", "volume": "20"}, "authors": [{"authorId": "152144065", "name": "E. Russo"}, {"authorId": "143684824", "name": "Gabriele Costa"}, {"authorId": "153412732", "name": "G. Longo"}, {"authorId": "2538899", "name": "A. Armando"}, {"authorId": "152607302", "name": "A. Merlo"}], "citations": [{"paperId": "080a0adfec0cd18bf538aa78503187bfdde1f2b3", "title": "Fluid Computing in the Internet of Things: A Digital Twin Approach"}, {"paperId": "727651a34abe43e222309d38a7c834bd66b0ba81", "title": "HoneyICS: A High-interaction Physics-aware Honeynet for Industrial Control Systems"}, {"paperId": "0f573792b4723fbc61515594ad2fe5ace6bf5fa6", "title": "Analysing Interoperability in Digital Twin Software Architectures for Manufacturing"}]}
