{"paperId": "110241d5fdcf159ad8430fd7436ad8d0f75e2fbd", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Building Function Recognition Using the Semi-Supervised Classification", "abstract": "The functional classification of buildings is important for creating and managing urban zones and assisting government departments. Building function recognition is incredibly valuable for wide applications ranging from the determination of energy demand. By aiming at the topic of urban function classification, a semi-supervised graph structure network combined unified message passing model was introduced. The data of this model include spatial location distribution of buildings, building characteristics and the information mined from points of interesting (POIs). In order to extract the context information, each building was regarded as a graph node. Building characteristics and corresponding POIs information were embedded to mine the building function by the graph convolutional neural network. When training the model, several node labels in the graph were masked, and then these labels were predicted by the trained model so that this work could take full advantage of the node label and the feature information of all nodes in both the training and prediction stages. Quasi-experiments proved that the proposed method for building function classification using multi-source data enables the model to capture more meaningful information with limited labels, and it achieves better function classification results.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-01", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "46397087", "name": "Xuejing Xie"}, {"authorId": "2144469172", "name": "Yawen Liu"}, {"authorId": "1837647", "name": "Yongyang Xu"}, {"authorId": "20536771", "name": "Zhanjun He"}, {"authorId": "2047606446", "name": "Xueye Chen"}, {"authorId": "144678643", "name": "Xiaoyun Zheng"}, {"authorId": "2153722665", "name": "Zhong Xie"}], "citations": [{"paperId": "c65a28e3cf3af4a7094eeea1ef0d1fe6883f78ce", "title": "A graph-based neural network approach to integrate multi-source data for urban building function classification"}, {"paperId": "23a17b943ba3bfa3075990d78d0da48951953a0f", "title": "Multiscale Urban Functional Zone Recognition Based on Landmark Semantic Constraints"}, {"paperId": "5001dbca06b7dd570fbcfa11cde7a451f7139035", "title": "BEMF-Net: Semantic Segmentation of Large-Scale Point Clouds via Bilateral Neighbor Enhancement and Multi-Scale Fusion"}, {"paperId": "9839e5d867d3d82b4532c511b01a87049b97c242", "title": "Understanding the Visual Relationship between Function and Facade in Historic Buildings Using Deep Learning—A Case Study of the Chinese Eastern Railway"}, {"paperId": "7ac0c3eeb170dc41f7b4de7bbcd1d96d000ccb3c", "title": "A Shape and Size Free-CNN for Urban Functional Zone Mapping With High-Resolution Satellite Images and POI Data"}]}
