{"paperId": "110f406bca9161d05dbd1a04c8327239777153de", "publicationVenue": {"id": "faae4228-a2f7-40bd-818e-ab1f685df91a", "name": "Forests", "type": "journal", "issn": "1999-4907", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156829", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156829", "https://www.mdpi.com/journal/forests"]}, "title": "Simulation on Different Patterns of Mobile Laser Scanning with Extended Application on Solar Beam Illumination for Forest Plot", "abstract": "Light detection and ranging (LiDAR) technology has become a mainstream tool for forest surveys, significantly contributing to the improved accuracy of forest inventories. However, the accuracy of the scanned data and tree properties derived using LiDAR technology may differ depending on the occlusion effect, scanning configurations, various scanning patterns, and vegetative characteristics of forest plots. Hence, this paper presents a computer simulation program to build a digital forest plot composed of many tree models constructed based on in situ measurement information and two mobile scanning patterns, i.e., airborne laser scanning (ALS) and ground-based mobile laser scanning (MLS). Through the adjustment of scanning parameters and the velocity of vehicle loading LiDAR sensors, the points scanned using two scanning patterns were compared with the original sampling points, derived from the constructed digital forest plots. The results show that only 2% of sampling points were collected by LiDAR sensors with the fastest vehicle speed (10 m/s) and coarsest scanning angular resolution (horizontal angular resolution 0.16° and vertical angular resolution 1.33°), and approximately 50% of sampling points were collected by LiDAR sensors with slow vehicle velocity (1.25 m/s) and a finer scanning angular resolution (horizontal angular resolution 0.08° and vertical angular resolution 0.33°). Meanwhile, the potential extended application of the proposed computer simulation program as a light model of forest plots was discussed to underpin the creation of the forest digital twin. Three main conclusions are drawn: (1) the collected points from airborne laser scanning (ALS) are higher than those collected from ground-based mobile laser scanning (MLS); (2) reducing the vehicle velocity is more efficient at improving the high density of the point cloud data than by increasing the scanning angular resolution; (3) the lateral extension of crown area increasing the light beams’ receptor area and the clumped leaf dispersion augmenting the light penetration with vertical elongation are the two paramount factors influencing the light transmittance of tree crowns.", "venue": "Forests", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-13", "journal": {"name": "Forests"}, "authors": [{"authorId": "2049049187", "name": "K. Jiang"}, {"authorId": "2196521898", "name": "Liang Chen"}, {"authorId": "2144797722", "name": "Xiangjun Wang"}, {"authorId": "2062055456", "name": "Feng An"}, {"authorId": "1731591", "name": "Huaiqing Zhang"}, {"authorId": "33690443", "name": "T. Yun"}], "citations": [{"paperId": "95850a251ddaa480f35e16172f4c6e67b69833ff", "title": "Relative margin induced support vector ordinal regression"}, {"paperId": "83f6385762c7cc072a194c6cc1c1bb88cdecef46", "title": "Coarse-to-fine segmentation of individual street trees from side-view point clouds"}, {"paperId": "19ba755ed008978e98bcf6b30d9401313484f3f1", "title": "Synthetic Forest Stands and Point Clouds for Model Selection and Feature Space Comparison"}, {"paperId": "0ca04190d75c0eac43b82d884cb5c0e58c16cb1f", "title": "Real-time detection of street tree crowns using mobile laser scanning based on pointwise classification"}, {"paperId": "aaa9fc4dd132e793360e45eed0531bc31142bd99", "title": "Forest Fire Prediction Based on Long- and Short-Term Time-Series Network"}, {"paperId": "c0fe12cdc4470ebfb796e56277542fb0ad522dda", "title": "SLAM-Based Forest Plot Mapping by Integrating IMU and Self-Calibrated Dual 3-D Laser Scanners"}, {"paperId": "c34805f0c84d0d4d42f0fffd306e4e91298c67fe", "title": "High-Throughput Extraction of the Distributions of Leaf Base and Inclination Angles of Maize in the Field"}]}
