{"paperId": "1125e3ba920f7df22d52df5c125332277f9a170e", "publicationVenue": {"id": "060e1989-70b4-4980-a75d-cdd0d8fcd555", "name": "ACM Journal on Computing and Cultural Heritage", "type": "journal", "alternate_names": ["ACM J Comput Cult Heritage"], "issn": "1556-4711", "url": "https://jocch.acm.org/", "alternate_urls": ["http://portal.acm.org/jocch/"]}, "title": "TTProfiler: Types and Terms Profile Building for Online Cultural Heritage Knowledge Graphs", "abstract": "As more and more knowledge graphs (KGs) are published on the Web, there is a need for tools that show their content. This implies showing the schema-level patterns instantiated in the graph, but also the terms used to qualify its entities. In this article, we present a new profiling tool that we call TTprofiler. It shows the predicates that relate types in the KG, and also the terms present in this KG, because of their paramount importance in most KGs, especially in the Cultural Heritage (CH) domain. We recall the role of terminologies and how they are implemented and used on the Web, we give the algorithm for building a TT profile from an online KG’s endpoint, and we report on experiments performed over a set of Cultural Heritage Web KGs. A tool for visualizing TT profiles is also provided.", "venue": "ACM Journal on Computing and Cultural Heritage", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-18", "journal": {"name": "ACM Journal on Computing and Cultural Heritage", "pages": "1 - 22", "volume": "16"}, "authors": [{"authorId": "46585378", "name": "Lamine Diop"}, {"authorId": "69946241", "name": "B. Markhoff"}, {"authorId": "2955369", "name": "Arnaud Soulet"}], "citations": [{"paperId": "2e47ba4727cc64511444f294ac8272b65f1f1da8", "title": "How Contentious Terms About People and Cultures are Used in Linked Open Data"}, {"paperId": "80d2f77e3356988095d5efe07952c1ac629a7934", "title": "Et si on comprenait la structure de graphes de connaissances comme Wikidata ?"}]}
