{"paperId": "112a63ec956805f3286a10d3bfb7b8caada49646", "publicationVenue": null, "title": "Forecasting model of electricity market prosperity index based on multidimensional big data", "abstract": "The establishment of electricity market prosperity index prediction model is of great significance to the planning, construction, production and decision-making of electricity market. On this basis, from the perspective of industry and industry, this paper puts forward the design of multi-dimensional big data forecasting model of power industry electricity market prosperity index. This paper analyzes the compilation process of the prosperity index of the power industry, studies the pre-processing method of the power data based on the multidimensional big data. Based on the index division algorithm of multi-dimensional big data time difference analysis and the method of compiling the prosperity index of the power industry, the prosperity index of the power market of the power industry is predicted. Through the calculation of the diffusion index method and composite index of power consumption in power industry. Combined with the multi-dimensional big data nonlinear analysis method, it is applied to the prosperity index analysis of the power industry. Finally, the accurate prediction of the electricity market prosperity index of the power industry is realized. Finally, through the simulation test, according to the power data provided by the electric power bureau of a city, the power prosperity index is compiled, and the forecasting effect of the power industry electricity market prosperity index is tested. Experimental results show that the model has high effectiveness in practical application, and can fully meet the research requirements.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics", "Economics"], "publicationTypes": ["Conference"], "publicationDate": "2021-04-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1883"}, "authors": [{"authorId": "2108773165", "name": "Jia Liu"}, {"authorId": "2090028437", "name": "Rui Ma"}, {"authorId": "2152531907", "name": "Zhenhua Yan"}, {"authorId": "2106562313", "name": "Lu Jia"}, {"authorId": "2144697931", "name": "Liang Wang"}, {"authorId": "2118757939", "name": "Yuanyuan Shi"}], "citations": [{"paperId": "2fbabf3edf40e976cf33da698372459fe597ae1b", "title": "Implementation of Multi-dimensional Power Big Data Visualization Platform Based on Python"}]}
