{"paperId": "112f2070256809c42ef4060c25890d09026d9637", "publicationVenue": {"id": "192d27f9-c6f4-4ada-891f-1099b11c7022", "name": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Mob Adhoc Sens Syst", "Mobile Adhoc and Sensor Systems", "MASS", "Mob Adhoc Sens Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1999"}, "title": "TPMDP: Threshold Personalized Multi-party Differential Privacy via Optimal Gaussian Mechanism", "abstract": "In modern distributed computing applications, such as federated learning and AIoT systems, protecting privacy is crucial to prevent adversarial parties from colluding to steal others’ private information. However, guaranteeing the utility of computation outcomes while protecting all parties’ data privacy can be challenging, particularly when the parties’ privacy requirements are highly heterogeneous. In this paper, we propose a novel privacy framework for multi-party computation called Threshold Personalized Multi-party Differential Privacy (TPMDP), which addresses a limited number of semi-honest colluding adversaries. Our framework enables each party to have a personalized privacy budget. We design a multi-party Gaussian mechanism that is easy to implement and satisfies TPMDP, wherein each party perturbs the computation outcome in a secure multi-party computation protocol using Gaussian noise. To optimize the utility of the mechanism, we cast the utility loss minimization problem into a linear programming (LP) problem. We exploit the specific structure of this LP problem to compute the optimal solution after $\\mathcal{O}(n)$ computations, where n is the number of parties, while a generic solver may require exponentially many computations. Extensive experiments demonstrate the benefits of our approach in terms of low utility loss and high efficiency compared to existing private mechanisms that do not consider personalized privacy requirements or collusion thresholds.", "venue": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-18", "journal": {"name": "2023 IEEE 20th International Conference on Mobile Ad Hoc and Smart Systems (MASS)", "pages": "161-169"}, "authors": [{"authorId": "2218068924", "name": "Jiandong Liu"}, {"authorId": "2109006870", "name": "Lan Zhang"}, {"authorId": "2212029975", "name": "Chaojie Lv"}, {"authorId": "2087140581", "name": "Ting Yu"}, {"authorId": "1795848", "name": "N. Freris"}, {"authorId": "2210949888", "name": "Xiang-Yang Li"}], "citations": []}
