{"paperId": "11389cd78eab880358ea7b5e974d8461439f5055", "publicationVenue": null, "title": "Visualization and Prediction of Rainfall Using Deep Learning and Machine Learning Techniques", "abstract": "The sheer quantity of big information has created tremendous prospects for forecasts and study. Infographic is a normal sight in everyday life. Several trend lines explain the pragmatic approach to weather assessment using interactive media. Because it was Previously unable to evaluate huge data, visual analytic tools have made plotting the system quality. For a good knowledge of the conditions, maps are used. Graphing trends like The precipitation of India have been presented with the maximum, minimum, and medium precipitation in the U.s Districts. The precipitation trend in India's provinces and territories was correctly illustrated in this article. The recurring sequence highlights extremely dry areas.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "910-914"}, "authors": [{"authorId": "2288871375", "name": "T.Aruna"}, {"authorId": "2288990185", "name": "Dr.M.I.Thariq Hussan"}, {"authorId": "2288843348", "name": "P.Naresh"}, {"authorId": "2288989933", "name": "Dr.K.Gurunadha Guptha"}, {"authorId": "2288984036", "name": "A.Rajeshwari"}], "citations": [{"paperId": "ccfc5035b302fe4b1123d026cd78da2ddfc8a47f", "title": "UI/UX Design for Online Learning Approach by Predictive Student Experience"}, {"paperId": "01f84253125fd8e5391d41b3848489bc1f61d72c", "title": "Inbuilt Framework Using IoT and Computer Vision Technique for Automatic Visitor Management"}, {"paperId": "1a9aa478dfc7aea71295cfaa40af944f78f9e8ae", "title": "Detection of Vulnerability in Websites Predominantly Against CSRF Using Machine Learning"}, {"paperId": "20f1c725021847fa5319bfe9aa3956413dc24e4d", "title": "Comparative Study of Machine Learning Algorithms for Fake Review Detection with Emphasis on SVM"}, {"paperId": "ecb36634b6fe36ebeff9cba1f262f607390b3040", "title": "A Novel Deep Learning based Improved Cluster based Region Classifier Algorithm to Recognize and Categorize Emotions using EEG Signals"}, {"paperId": "a4dd1feea8b0b17a858b8f7671c5a9c5a0da5494", "title": "Table of Content"}]}
