{"paperId": "113a20964b1a6a3db07e56cac5d48a20604bcc33", "publicationVenue": {"id": "7eadf6d0-2d35-410f-ad53-2635d1f830d7", "name": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "type": "conference", "alternate_names": ["IAEAC", "IEEE Adv Inf Technol Electron Autom Control Conf"]}, "title": "Research on Data Security in Big Data Cloud Computing Environment", "abstract": "In the big data cloud computing environment, data security issues have become a focus of attention. This paper delivers an overview of conceptions, characteristics and advanced technologies for big data cloud computing. Security issues of data quality and privacy control are elaborated pertaining to data access, data isolation, data integrity, data destruction, data transmission and data sharing. Eventually, a virtualization architecture and related strategies are proposed to against threats and enhance the data security in big data cloud environment.", "venue": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-03-12", "journal": {"name": "2021 IEEE 5th Advanced Information Technology, Electronic and Automation Control Conference (IAEAC)", "pages": "1446-1450", "volume": "5"}, "authors": [{"authorId": "49451396", "name": "Fengling Wang"}, {"authorId": "2144395643", "name": "Han Wang"}, {"authorId": "47936724", "name": "Liang Xue"}], "citations": [{"paperId": "0f7e53f4ec04bb7b2eb47841470f0f0fc526f027", "title": "Enhancing Data Backup and Recovery in Cloud Computing with Secure Database Monitoring"}, {"paperId": "4116dbeefd7bc1e97ec018ada8a2394c999d2d7e", "title": "Data Address focused Implementation of Low Latency Secure Blockchain for EMRs"}, {"paperId": "bf1c927699f4c15201b08ba81ed9b397f93df568", "title": "An Outline of Data Encryption Standard (DES) Tools and Its Facets within the Realm of Cloud Computing"}, {"paperId": "ec63049610ca590d02796e9350a597684ae64b28", "title": "Structured Approach to Web Security: Exploring Evolving Threats and Unresolved Research Challenges"}, {"paperId": "7585fa967378457c5cc76e4d0de0128c945b71e4", "title": "Data Security Analysis in Cloud Computing Environment"}, {"paperId": "2bac5004e92572a6c58b54121b018bb3b948f34a", "title": "Design of Geospatial Big Data Cloud Platform for Land Resources"}, {"paperId": "9b2641a96083145b38ce43e323c2319f32314fe9", "title": "A Distributed Platform for Intrusion Detection System Using Data Stream Mining in a Big Data Environment"}, {"paperId": "495d9ad4f5308eac94183a3c5abe5d6173246f8a", "title": "Research on security defense based on randomization in cloud computing environment"}, {"paperId": "aedd805e7ce7ec115d0adf420af9303c210b39d8", "title": "Big-Data Platform for Performance Monitoring of Telecom-Service-Provider Networks"}, {"paperId": "827025bd5cb40938f24211cc75cafeb36badb439", "title": "Increasing Cyber Defense in the Music Education Sector Using Blockchain Zero-Knowledge Proof Identification"}, {"paperId": "eaaf03e65204c541f91c180150b24941756e71ba", "title": "A Machine Vision Anomaly Detection System to Industry 4.0 Based on Variational Fuzzy Autoencoder"}, {"paperId": "5b61348e696a872a453e5c64901514350f07d14a", "title": "Integrating Cybersecurity Into a Big Data Ecosystem"}]}
