{"paperId": "11564a453352cf1cccd5bb22446bcba39e4dd8da", "publicationVenue": null, "title": "Data Mining Techniques and Machine learning Algorithms in the Multimedia System to Enhance Engineering Education", "abstract": "In the current digital era, engineering education worldwide faces a massive challenge in education and career development. By authorizing educators and administrators to migrate to the actions, cloud services technology has transformed into the educational environment. A Multimedia assisted smart learning system (MSLS) has been suggested in this paper where universities/colleges will advocate future development and begin skill-set enhancement courses by e-learning. To classify their employment prospects at the early stage of graduation, this proposed system measures learners' academic/skill data. Machine learning and Data mining are advanced research fields whose accelerated advancement is attributable to developments in data processing research, database industry growth, and business requirements for methods capable of extracting useful information from massive data stores. In addition, for skill set evaluation, a practical algorithm is suggested to find different groups of students that lack the appropriate skill set. The anticipated student groups can be provided with opportunities by e-learning to enhance their required skill set. The findings suggest that more critical choices can boost employment prospects and overall educational development by implementing the new engineering education system.", "venue": "ACM Trans. Asian Low Resour. Lang. Inf. Process.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-30", "journal": {"name": "Transactions on Asian and Low-Resource Language Information Processing"}, "authors": [{"authorId": "83675690", "name": "Xiao-Nai Tang"}, {"authorId": "2116824859", "name": "Juan Li"}, {"authorId": "2153216060", "name": "Bo Wang"}], "citations": [{"paperId": "1cfbdd99ffee2318f13272636e6239bcad18bcd4", "title": "Machine learning-based AI approaches for personalized smart education systems using entropy and TOPSIS approach"}]}
