{"paperId": "115998ea55663aa50d8d22c2ab13d257410e57a7", "publicationVenue": {"id": "7f501ba9-201f-4020-9843-a6fa8299c43e", "name": "Human Brain Mapping", "type": "journal", "alternate_names": ["Hum Brain Mapp"], "issn": "1065-9471", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38751", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10970193", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1097-0193"]}, "title": "Transfreq: A Python package for computing the theta‐to‐alpha transition frequency from resting state electroencephalographic data", "abstract": "A classic approach to estimate individual theta‐to‐alpha transition frequency (TF) requires two electroencephalographic (EEG) recordings, one acquired in a resting state condition and one showing alpha desynchronisation due, for example, to task execution. This translates into long recording sessions that may be cumbersome in studies involving patients. Moreover, an incomplete desynchronisation of the alpha rhythm may compromise TF estimates. Here we present transfreq, a publicly available Python library that allows TF computation from resting state data by clustering the spectral profiles associated to the EEG channels based on their content in alpha and theta bands. A detailed overview of transfreq core algorithm and software architecture is provided. Its effectiveness and robustness across different experimental setups are demonstrated on a publicly available EEG data set and on in‐house recordings, including scenarios where the classic approach fails to estimate TF. We conclude with a proof of concept of the predictive power of transfreq TF as a clinical marker. Specifically, we present a scenario where transfreq TF shows a stronger correlation with the mini mental state examination score than other widely used EEG features, including individual alpha peak and median/mean frequency. The documentation of transfreq and the codes for reproducing the analysis of the article with the open‐source data set are available online at https://elisabettavallarino.github.io/transfreq/. Motivated by the results showed in this article, we believe our method will provide a robust tool for discovering markers of neurodegenerative diseases.", "venue": "Human Brain Mapping", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-30", "journal": {"name": "Human Brain Mapping", "pages": "5095 - 5110", "volume": "43"}, "authors": [{"authorId": "1387158534", "name": "Elisabetta Vallarino"}, {"authorId": "49651980", "name": "Sara Sommariva"}, {"authorId": "35681063", "name": "F. Famà"}, {"authorId": "2174189268", "name": "Michele Piana"}, {"authorId": "2276342518", "name": "Flavio Nobili"}, {"authorId": "2262569808", "name": "Dario Arnaldi"}], "citations": []}
