{"paperId": "115fa491457c379e996357d929ab71fbad8cd5f7", "publicationVenue": {"id": "3ca62840-ce4b-49fb-ba81-fbc1595d8968", "name": "International Scientific Journal of Computing", "type": "journal", "alternate_names": ["Int J Comput", "International Journal of Computing", "Int Sci J Comput"], "issn": "1727-6209", "url": "http://computingonline.net/"}, "title": "A Method of IoT Information Compression", "abstract": "The Internet of Things (IoT) is a modern paradigm that consists of heterogeneous intercommunicated devices that send and receive messages in various formats through different protocols. Thanks to the smart things mainstream, it is becoming common to collect large quantities of data generated by resource-constrained, distributed devices at one or more servers. However, the wireless transmitting of data is very expensive. For example, in IoT, Bluetooth Low Energy using costs tens of millijoules per connection, while computing at full energy costs only tens of micrjoules, and sitting idle costs close to 1 microjoules per second for STM processors. We need compression of data on smart devices. We introduce an IoT compression method based on the concurrent Cosine and Chebyshev Discrete Transforms. For performance increasing, the modification of Transforms algorithms is proposed. This method is suitable not only for IoT devices collecting data but also for the big servers.", "venue": "International Scientific Journal of Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-30", "journal": {"name": "International Journal of Computing"}, "authors": [{"authorId": "91639393", "name": "Yu. Manzhos"}, {"authorId": "2161091395", "name": "Yevheniia Sokolova"}], "citations": [{"paperId": "b68443cbeab00782685ac9347cc9d7e81c793d05", "title": "Compression Coding Method Using Internal Restructuring of Information Space"}, {"paperId": "496dcd6540051d45bb1a7bf742ebe7f859557e70", "title": "Creation of a video data reliability assessment model for compression coding technology in the conditions of errors in the data transmission channel"}, {"paperId": "f73d908603bea26ea3369dc2b271a9352df9069f", "title": "Editorial “Green Computing, Monitoring and Assessing of Smart IoT Systems and Components”"}, {"paperId": "4b9ad54f7adcbcbbd496623ceb40d9968c543022", "title": "Video Data Video Image Reconstruction Method for Increasing Delivery Efficiency in Air Segment Infocommunication Systems"}]}
