{"paperId": "11759b306ce4225ca035f28192b405bfa6ecf6c1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ADSM: Adaptive Data Scheduling Method for Hybrid Memories in Distributed System", "abstract": "With the deployment of innovative memories such as non-volatile memory and 3D-stacked memory in distributed systems, how to improve the application performance by utilizing the unique characteristics of these hybrid memories remains an active research direction. For instance, the Intel Knight Landing (KNL) processor incorporates a High Bandwidth Memory (HBM) using 3D-stacked technology with traditional DRAM onto the same chip. HBM achieves much higher bandwidth than traditional DRAM when the application exhibits high parallelism and sequential access. In this paper, we propose a new metric SP-factor to guide the data scheduling in distributed system using hybrid memories such as HBM and DRAM. The SP-factor incorporates the data access patterns including data block size and data access parallelism, which leads to better data scheduling decision for higher performance. We apply SP-factor to several data eviction policies on the hybrid memory system, which achieves better performance. Moreover, an adaptive data scheduling method (ADSM) is proposed for such hybrid memory system with HBM and DRAM. ADSM can dynamically adjust scheduling decisions based on runtime performance metrics so that it can adapt to workloads with different data access patterns. Our experimental results show that ADSM can significantly improve the performance of the representative workloads. For SQL query application with mixed access pattern, the cache hit ratio increases by 10.4% and the execution time reduces by 14.6% using ADSM compared to ARC policy.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "180218-180234", "volume": "7"}, "authors": [{"authorId": "153552136", "name": "Jiazhao Sun"}, {"authorId": "2951748", "name": "Yunchun Li"}, {"authorId": "46402263", "name": "Hailong Yang"}, {"authorId": "2157336953", "name": "Wei Li"}], "citations": []}
