{"paperId": "1176c27949ab8d7f8cd98fae6eb9899d982db36f", "publicationVenue": {"id": "2ca1e2ac-8c3b-4251-94ed-24846d391d3b", "name": "Computational and Mathematical Methods in Medicine", "type": "journal", "alternate_names": ["Comput Math Method Med"], "issn": "1748-670X", "url": "https://www.hindawi.com/journals/cmmm/"}, "title": "Classification of Alzheimer's Disease Using Gaussian-Based Bayesian Parameter Optimization for Deep Convolutional LSTM Network", "abstract": "Alzheimer's disease (AD) is one of the most important causes of mortality in elderly people, and it is often challenging to use traditional manual procedures when diagnosing a disease in the early stages. The successful implementation of machine learning (ML) techniques has also shown their effectiveness and its reliability as one of the better options for an early diagnosis of AD. But the heterogeneous dimensions and composition of the disease data have undoubtedly made diagnostics more difficult, needing a sufficient model choice to overcome the difficulty. Therefore, in this paper, four different 2D and 3D convolutional neural network (CNN) frameworks based on Bayesian search optimization are proposed to develop an optimized deep learning model to predict the early onset of AD binary and ternary classification on magnetic resonance imaging (MRI) scans. Moreover, certain hyperparameters such as learning rate, optimizers, and hidden units are to be set and adjusted for the performance boosting of the deep learning model. Bayesian optimization enables to leverage advantage throughout the experiments: A persistent hyperparameter space testing provides not only the output but also about the nearest conclusions. In this way, the series of experiments needed to explore space can be substantially reduced. Finally, alongside the use of Bayesian approaches, long short-term memory (LSTM) through the process of augmentation has resulted in finding the better settings of the model that too in less iterations with an relative improvement (RI) of 7.03%, 12.19%, 10.80%, and 11.99% over the four systems optimized with manual hyperparameters tuning such that hyperparameters that look more appealing from past data as well as the conventional techniques of manual selection.", "venue": "Computational and Mathematical Methods in Medicine", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-04", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2021"}, "authors": [{"authorId": "1638467298", "name": "Monika Sethi"}, {"authorId": "3360312", "name": "S. Ahuja"}, {"authorId": "5363117", "name": "Shalli Rani"}, {"authorId": "1582059706", "name": "Puneet Bawa"}, {"authorId": "2913108", "name": "Atef Zaguia"}], "citations": [{"paperId": "1eb62fecc83548375cf460c655b8772228190026", "title": "A review of artificial intelligence methods for Alzheimer's disease diagnosis: Insights from neuroimaging to sensor data analysis"}, {"paperId": "fa9ad8295cce3936c4fee4a802306bd8852cd8e5", "title": "Early diagnosis of Alzheimer's disease using dual GAN model with pyramid attention networks"}, {"paperId": "181d75616bad8f0196c3a1b1c6ddf6a107a03092", "title": "Study and verification on an improved comprehensive prediction model of landslide displacement"}, {"paperId": "5fe480b099ee50898f47e84cf8b52a61b062ec09", "title": "Retracted: Classification of Alzheimer’s Disease Using Gaussian-Based Bayesian Parameter Optimization for Deep Convolutional LSTM Network"}, {"paperId": "b0c470a33fb43a01a3521a4eb963141d95769db5", "title": "Big Data Analytics Assisted Arithmetic Optimization with Deep Learning Model for Sentiment Classification"}, {"paperId": "a7cc8a6e0a1d4c2d782d1873e878ad70135a7ee9", "title": "Accurate Brain Disease Diagnosis with UE-CNN Uncertainty Discrimination"}, {"paperId": "f66bc2fcfea21958a3d669ef20a9c68b32ab20a5", "title": "HOMLC-Hyperparameter Optimization for Multi-Label Classification of Intrusion Detection Data for Internet of Things Network"}, {"paperId": "e3f55730b980415b344b66f00fd391e36de55ec5", "title": "The Enhanced Load Balancing Technique to Optimize the Data Diffusion Swiftness Using Hybrid Context Modeling"}, {"paperId": "ba348c4e2de692128b4f1c71c74de99f0a449ae0", "title": "CLAUDIA: Cloud-based Automatic Diagnosis of Alzheimer's Prodromal Stage and Disease from 3D Brain Magnetic Resonance"}, {"paperId": "8d40e45ab1af776720bb089871b10b67a1d9d683", "title": "Machine learning, a new tool for the detection of immunodeficiency patterns in systemic lupus erythematosus"}, {"paperId": "6adfa3a6342ef2a2c724c694c5fd048d2a29907c", "title": "Deep Learning Methods Applied to Drug Concentration Prediction of Olanzapine"}, {"paperId": "e01b09081dec3843238ccea44134ce30db107b6c", "title": "A review of the application of three-dimensional convolutional neural networks for the diagnosis of Alzheimer’s disease using neuroimaging"}, {"paperId": "28b1b260976de5b2396ff465dea65381bcfeee01", "title": "PID-based CNN-LSTM for accuracy-boosted virtual sensor in battery thermal management system"}, {"paperId": "e50f3af511c1a75a28e61a61ff8b38838c04cc0c", "title": "Forecasting the Monkeypox Outbreak Using ARIMA, Prophet, NeuralProphet, and LSTM Models in the United States"}, {"paperId": "820e9180653047944c8ea5bdfa45c21486abc1a1", "title": "Deep Transfer Learning For Improving Alzheimer Disease Diagnosis"}, {"paperId": "17999d495eef29e03f0277cd7a53eb3d0abfde1e", "title": "CASPAR: Cloud-based Alzheimer’s, Schizophrenia and Parkinson’s Automatic Recognizer"}, {"paperId": "aa2e8fa59a1e3dd7a650c8adba22a8d762eb650d", "title": "Artificial intelligence in dementia"}, {"paperId": "f6791fd934be0501d17925e7a4e4594e4aa945a5", "title": "A CAD System for Alzheimer's Disease Classification Using Neuroimaging MRI 2D Slices"}, {"paperId": "3760e27b8c3af205ce0ae3e2b4cb896d32d39ab4", "title": "Early diagnosis of Alzheimer's disease based on deep learning: A systematic review."}, {"paperId": "0e681598a83e3e55cfbc34a07a222e99e9f4c445", "title": "CrossViT Wide Residual Squeeze-and-Excitation Network for Alzheimer's disease classification with self attention ProGAN data augmentation"}, {"paperId": "02866b1e1aac64715fec28b997d8967a36221773", "title": "A Comprehensive Survey on the Detection, Classification, and Challenges of Neurological Disorders"}, {"paperId": "4884e4edb5268c065cbc191a65eadde172d66bbf", "title": "OViTAD: Optimized Vision Transformer to Predict Various Stages of Alzheimer’s Disease Using Resting-State fMRI and Structural MRI Data"}]}
