{"paperId": "117cec2fa8576da76f2bdcefe72f119b0cceabb2", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Entropy based C4.5-SHO algorithm with information gain optimization in data mining", "abstract": "Information efficiency is gaining more importance in the development as well as application sectors of information technology. Data mining is a computer-assisted process of massive data investigation that extracts meaningful information from the datasets. The mined information is used in decision-making to understand the behavior of each attribute. Therefore, a new classification algorithm is introduced in this paper to improve information management. The classical C4.5 decision tree approach is combined with the Selfish Herd Optimization (SHO) algorithm to tune the gain of given datasets. The optimal weights for the information gain will be updated based on SHO. Further, the dataset is partitioned into two classes based on quadratic entropy calculation and information gain. Decision tree gain optimization is the main aim of our proposed C4.5-SHO method. The robustness of the proposed method is evaluated on various datasets and compared with classifiers, such as ID3 and CART. The accuracy and area under the receiver operating characteristic curve parameters are estimated and compared with existing algorithms like ant colony optimization, particle swarm optimization and cuckoo search.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-07", "journal": {"name": "PeerJ Computer Science", "volume": "7"}, "authors": [{"authorId": "2052872624", "name": "G. Reddy"}, {"authorId": "2473139", "name": "Suneetha Chittineni"}], "citations": [{"paperId": "f5965c46ae64e377ec7ca0165b989ee219718135", "title": "Investigating predictors of juvenile traditional and/or cyber offense using machine learning by constructing a decision support system"}, {"paperId": "a4edf01d6340c4c0ab9dca2cf65b133f734fcb95", "title": "Design of Intrusion Detection System for Wireless ADHOC Network in the Detection of DOS Attack using Oneclass SVM with Wrapper Approach Feature Selection Comparing with Information Gain Algorithm"}, {"paperId": "7b2b8b4365334c548cb395221aafb01f739d42bc", "title": "Application of nonlinear clustering optimization algorithm in web data mining of cloud computing"}, {"paperId": "45d4689c7e08e95b1d692bfa24d6060f2af66239", "title": "Using Recurrent Neural Networks for Predicting Type-2 Diabetes from Genomic and Tabular Data"}, {"paperId": "73e7b3d94e32d13b5171dc66b03280c9ad7a3dea", "title": "Multiple rather than specific autoantibodies were identified in irritable bowel syndrome with HuProt™ proteome microarray"}, {"paperId": "2a1bca39d3cd2f0f7f4c36b6e68efd07d21bee8a", "title": "A study of student performance under English teaching using a decision tree algorithm"}, {"paperId": "1f6a1ce91ea33f466525d5d8f6c96bb4bd5d2a12", "title": "The Effect of Resampling on Classifier Performance: an Empirical Study"}, {"paperId": "4aa796b68041f08b26ff1c9e32aac1d6311a04f6", "title": "BREAST CANCER DIAGNOSIS AND PROGNOSIS USING STACKING ENSEMBLE TECHNIQUE"}, {"paperId": "fcbb97ab98543a88b443b2aa9936e36b0d9d8506", "title": "Financial market index prediction using machine learning Financial market index prediction using machine learning"}]}
