{"paperId": "118541fc6530f289d3eaeba44c6899ff60839f1d", "publicationVenue": {"id": "f8e385ef-b52f-4337-ab3b-e09080aec353", "name": "International Conference on Edge Computing [Services Society]", "type": "conference", "alternate_names": ["Int Conf Edge Comput [services Soc", "EDGE", "At the edge", "edge", "Edge"], "issn": "1923-4996", "alternate_issns": ["0225-7181"], "url": "https://journals.library.mun.ca/ojs/index.php/ate", "alternate_urls": ["https://journals.library.mun.ca/ojs/index.php/ate/index"]}, "title": "A Survey of Faults and Fault-Injection Techniques in Edge Computing Systems", "abstract": "Edge computing has emerged in recent years to reduce latency, conserve bandwidth, and enhance privacy for applications. As more edge computing applications are being deployed, there is a growing need to ensure fault tolerance for such systems. To achieve fault-tolerant edge computing, understanding potential faults and fault-injection methods is crucial. In this paper, we surveyed 76 research publications in over 25 top conferences and journals published during the last 6 years with a focus on fault-tolerant edge computing. Through our analysis, we identified the most relevant faults as well as the common practical fault-injection techniques, simulation frameworks, and benchmarks used in edge computing. Our key insights from this survey underscore the importance of handling edge-centric faults including performance, resource-stressing, and network-partition faults as well as developing edge-centric fault-injection methods and dependability benchmarks in future studies.", "venue": "International Conference on Edge Computing [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE International Conference on Edge Computing and Communications (EDGE)", "pages": "63-71"}, "authors": [{"authorId": "51362804", "name": "M. Pourreza"}, {"authorId": "144833923", "name": "P. Narasimhan"}], "citations": [{"paperId": "daa311cec5f058de4ba32d1669bccf288840a21e", "title": "Understanding Timing Error Characteristics from Overclocked Systolic Multiply–Accumulate Arrays in FPGAs"}, {"paperId": "f9c17d5606e5364ea108223409b814fe9173e24a", "title": "Digital-twin-assisted meta learning for soft-failure localization in ROADM-based optical networks"}]}
