{"paperId": "119da67cb0923048120cdb0b990efd24973eebc4", "publicationVenue": {"id": "38e1b942-a62d-4d74-8e5d-677db6ed425f", "name": "Symposium on Networked Systems Design and Implementation", "type": "conference", "alternate_names": ["NSDI", "Symp Networked Syst Des Implement", "Networked Systems Design and Implementation", "Networked Syst Des Implement"]}, "title": "Move Fast and Meet Deadlines: Fine-grained Real-time Stream Processing with Cameo", "abstract": "Resource provisioning in multi-tenant stream processing systems faces the dual challenges of keeping resource utilization high (without over-provisioning), and ensuring performance isolation. In our common production use cases, where streaming workloads have to meet latency targets and avoid breaching service-level agreements, existing solutions are incapable of handling the wide variability of user needs. Our framework called Cameo uses fine-grained stream processing (inspired by actor computation models), and is able to provide high resource utilization while meeting latency targets. Cameo dynamically calculates and propagates priorities of events based on user latency targets and query semantics. Experiments on Microsoft Azure show that compared to state-of-the-art, the Cameo framework: i) reduces query latency by 2.7X in single tenant settings, ii) reduces query latency by 4.6X in multi-tenant scenarios, and iii) weathers transient spikes of workload.", "venue": "Symposium on Networked Systems Design and Implementation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-06", "journal": {"pages": "389-405"}, "authors": [{"authorId": "153152418", "name": "Le Xu"}, {"authorId": "2697906", "name": "S. Venkataraman"}, {"authorId": "143720373", "name": "Indranil Gupta"}, {"authorId": "32214483", "name": "Luo Mai"}, {"authorId": "3097319", "name": "Rahul Potharaju"}], "citations": [{"paperId": "8d5f786c9d734403a67fa5e2fea1f36a0ab2e62a", "title": "Djenne: Dependable and Decentralized Computation for Networked Embedded Systems"}, {"paperId": "c44b23f6b060f3004b5b243c4afbf7c1cb778f52", "title": "Dirigo: Self-scaling Stateful Actors For Serverless Real-time Data Processing"}, {"paperId": "d0f789d8327c54b6b8c5c9fd566206b68d5ac42a", "title": "Storm-RTS: Stream Processing with Stable Performance for Multi-Cloud and Cloud-edge"}, {"paperId": "a2769c9e722099691aefed9c2731c366a80293b8", "title": "Quiver: Supporting GPUs for Low-Latency, High-Throughput GNN Serving with Workload Awareness"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "7aae342f5d7f9c3c54276ba1ec32364e624175c9", "title": "StreamSwitch: Fulfilling Latency Service-Layer Agreement for Stateful Streaming"}, {"paperId": "854f39854c2cc6de8234daa671033ed3692232cd", "title": "Generalizable Reinforcement Learning-Based Coarsening Model for Resource Allocation over Large and Diverse Stream Processing Graphs"}, {"paperId": "0f2105929b41e360490445b381729eaad0c77c58", "title": "Tuneman: Customizing Networks to Guarantee Application Bandwidth and Latency"}, {"paperId": "b4258742a640151fa863092bed7f35d25dd92ab5", "title": "Shepherd: Seamless Stream Processing on the Edge"}, {"paperId": "e603147e665047984b7fb0f7a82def32f80ea7eb", "title": "ShadowSync: latency long tail caused by hidden synchronization in real-time LSM-tree based stream processing systems"}, {"paperId": "a9ea1848df46b797ef62f0f5e36e04dd712aedd9", "title": "zStream: towards a low latency micro-batch streaming system"}, {"paperId": "dbbb7b523865ecb00700b4e1fc6f84741c63bb5c", "title": "Online Resource Optimization for Elastic Stream Processing with Regret Guarantee"}, {"paperId": "251aedb43c869e159316b856d61c70b9f410d596", "title": "Radio: Reconciling Disk I/O Interference in a Para-virtualized Cloud"}, {"paperId": "af2b4938c5e2233ee510ce972c4c7c3733656cef", "title": "Distributed intelligence on the Edge-to-Cloud Continuum: A systematic literature review"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "19dc742f583a37aa91c28c473db9dc4e32041758", "title": "LMStream: When Distributed Micro-Batch Stream Processing Systems Meet GPU"}, {"paperId": "82c29f19a0ac9f602ba02ba07e836a39c382a695", "title": "Following the Data, Not the Function: Rethinking Function Orchestration in Serverless Computing"}, {"paperId": "a021b296bdc3227d7a275b781aae4aea93822b42", "title": "Fast and Flexible Human Pose Estimation with HyperPose"}, {"paperId": "3957d638e7ad2c26b32ac6a12e4c6662431ebaff", "title": "Hyperspace: The Indexing Subsystem of Azure Synapse"}, {"paperId": "be0675c2d63559d4a4babfcf64b7dbdab1c798be", "title": "Stream processing with dependency-guided synchronization"}, {"paperId": "2b76b31eb9008e8209b76a9626d24aa2f9a06018", "title": "Adaptive Online Cache Capacity Optimization via Lightweight Working Set Size Estimation at Scale"}, {"paperId": "339158b00fda468806cbd841239689d00cc42c96", "title": "Restructuring Serverless Computing with Data-Centric Function Orchestration"}, {"paperId": "ffe6522f8a4666642919ba0ea7d8c9990b1d41fb", "title": "the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}, {"paperId": "b58c1fb3c2625f2d67d00b4989576de820d32ea9", "title": "This paper is included in the Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation."}]}
