{"paperId": "119d528bef1545738fe455fe570f877cdf6d44c5", "publicationVenue": null, "title": "Advancing manufacturing systems with big-data analytics: A conceptual framework", "abstract": "ABSTRACT With the intensive development and implementation of information and communication technologies in manufacturing, large amounts of heterogeneous data are now being generated, gathered and stored. Handling large amounts of complex data – often referred to as big data – represents a challenge as there are many new approaches, methods, techniques, and tools for data analytics that open up new possibilities for exploiting data by converting them into useful information and/or knowledge. However, the application of advanced data analytics in manufacturing lags behind in terms of penetration and diversity in comparison with other domains such as marketing, healthcare and business, meaning that the available data often remain unexploited. This paper proposes a new conceptual framework for systematically introducing big-data analytics into manufacturing systems. To this end, the paper defines a new stepwise procedure that identifies what knowledge and skills, and which reference models, software and hardware tools, are needed for the development, implementation and operation of data-analytics solutions in manufacturing systems. The feasibility of the proposed conceptual framework is demonstrated in a case study from an engineer-to-order company and by mapping the framework to several previous data-analytics projects.", "venue": "International journal of computer integrated manufacturing (Print)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-01", "journal": {"name": "International Journal of Computer Integrated Manufacturing", "pages": "169 - 188", "volume": "33"}, "authors": [{"authorId": "97636147", "name": "Dominik Kozjek"}, {"authorId": "9233217", "name": "Rok Vrabič"}, {"authorId": "31047325", "name": "B. Rihtarsic"}, {"authorId": "1730104", "name": "N. Lavrač"}, {"authorId": "2016031", "name": "P. Butala"}], "citations": [{"paperId": "df026abc5df7039422f06f827284a6acdac31dfd", "title": "Role of Analytics and Accounting Information Systems in Profitability"}, {"paperId": "a4250878c4b87e74d8042355894dfd31c1816bf5", "title": "Towards Developing Big Data Analytics for Machining Decision-Making"}, {"paperId": "bce1b52e08d410bf360e594f740d7254235e6168", "title": "Predictive Maintenance in the Industrial Sector: A CRISP-DM Approach for Developing Accurate Machine Failure Prediction Models"}, {"paperId": "1adc884d70237c3fbc95ad2976acd2ffcae2e345", "title": "Modelling a Big Data-based Analytical Process: an Aerospace Case Study"}, {"paperId": "5c927f7ae047c7bae3ffcd80945cd7dad3d9904e", "title": "Multi-criteria analysis through determining production technology based on critical features of smart manufacturing systems"}, {"paperId": "a1631253d2b434ab36e9c876f784b4c4574b5c88", "title": "A data-driven digital twin framework for key performance indicators in CNC machining processes"}, {"paperId": "c6289cb66a31c30530fa940217e38663e47e6f29", "title": "Learning with supervised data for anomaly detection in smart manufacturing"}, {"paperId": "591f51d71a5eea24f2df1a819fd311b65d0c0a9b", "title": "Is digital transformation equally attractive to all manufacturers? Contextualizing the operational and customer benefits of smart manufacturing"}, {"paperId": "27617e8fda40e1855fe511fc989ec1f60227f0f5", "title": "Marketing analytics capability, artificial intelligence adoption, and firms' competitive advantage: Evidence from the manufacturing industry"}, {"paperId": "b7d162a3e4c1be96c25ecb3362fc073b38748f4a", "title": "Transforming healthcare with big data analytics: technologies, techniques and prospects"}, {"paperId": "14e87b70ff6c139f8b82aad1a1da31ceef0833c5", "title": "Exploiting a combined process mining approach to enhance the discovery and analysis of support processes in manufacturing"}, {"paperId": "332936122bfea3674b6492ac51a42040f2e63ec3", "title": "IMPACT OF BIG DATA ANALYTICS ON DISTRIBUTED MANUFACTURING: DOES BIG DATA HELP?"}, {"paperId": "6a4929a788a05e489a0c59401a5a5060a5a96867", "title": "SIGNIFICANCE OF ANALYTICS"}, {"paperId": "e6f876617ba6bc62ce309a6b96d576142cf1e496", "title": "Forecasting the efficiency of weft knitting production: a decision tree method"}, {"paperId": "64856e6b6af2dc5c26a88e0d708153848f098d02", "title": "A Systematic Literature Review of Machine Learning Tools for Supporting Supply Chain Management in the Manufacturing Environment"}, {"paperId": "2930ef501c0f04ea2645c58fa6734bfaf1c75da2", "title": "Impact of IoT on Manufacturing Industry 4.0: A New Triangular Systematic Review"}, {"paperId": "e6a0577203a177925768259dab456d0135895af0", "title": "A decade of engineering-to-order (2010–2020): Progress and emerging themes"}, {"paperId": "4270ee72fbd690fa27dc15523551f682a90a5309", "title": "Strategic Key Elements in Big Data Analytics as Driving Forces of IoT Manufacturing Value Creation: A Challenge for Research Framework"}, {"paperId": "d974eb7eeb8576c2c5f7640bb52bbf01a43965b2", "title": "Study on the Digital Intelligent Diagnosis of Miniature Machine Tools"}, {"paperId": "e26eb167e9f22072b2f1b3f144bb3fd1e67759c9", "title": "A review of industrial big data for decision making in intelligent manufacturing"}, {"paperId": "f587e42994354c315e61d1bec4b756fae9ddbdc7", "title": "Understanding the Cyber-Physical System in International Stadiums for Security in the Network from Cyber-Attacks and Adversaries using AI"}, {"paperId": "dc1f8f061188b8f4111f9d71fa63875ed1db9be4", "title": "Societal Impact of IoT-Lead Smart Factory in the Context of Industry 4.0"}, {"paperId": "f7c4c764c8168ae5c25f923be9524ed31f359a60", "title": "Large-scale manufacturing in North America: How machine learning and analytics improve efficiency"}, {"paperId": "f1bba37dbaffd60be899ec272f35e9e8aff68db5", "title": "Analytics and innovation management: Does big data play any role?"}, {"paperId": "fd04de088613c4e096c78aba14707ed7c70abbed", "title": "A NALYTICS AND L OCALIZED M ANUFACTURING : H OW M ACHINE L EARNING CAN H ELP I MPROVE E FFICIENCY"}, {"paperId": "804e362d66bba3674bd060f42926e451cfb708d6", "title": "How analytics drive business performance and profitability"}, {"paperId": "b4f4a88b878ff391a008086f9af24873c37b2961", "title": "Retail analytics and firm profitability: How analytics can help retail companies be successful"}, {"paperId": "e2dbfcea3fecb5cb957644c4d07035e8962185d2", "title": "Decision-Making & Data Science: How Large Businesses Can Use Analytics to Shape Decisions"}, {"paperId": "27cfb8a3dfc24d1718d68e0a222c418d8af75f2c", "title": "Tool failure recognition using inconsistent data"}, {"paperId": "d497b3ccf7ab7e0e0a9dd453fd9d2c5f4ab9f453", "title": "A multi-level model for realizing data-driven maintenance in manufacturing enterprises: Use case of jewelry production"}, {"paperId": "f67f2b47de31fbe8694e2d346d829e8d655010ce", "title": "A Method for Implementation of Machine Learning Solutions for Predictive Maintenance in Small and Medium Sized Enterprises"}, {"paperId": "a4ba1b7fbd805ceee7de19095bcbcd4904ac06dd", "title": "B USINESSES I NNOVATION & AI-H OW AI AND A NALYTICS CAN E NCOURAGE I NNOVATION"}]}
