{"paperId": "11a3e8ffb2240a905b1159670e2b4ecb2ef67543", "publicationVenue": {"id": "5d07677b-829a-4464-87b6-ce4379facda8", "name": "Nuansa Informatika", "alternate_names": ["Nuansa Inform"], "issn": "1858-3911", "url": "http://www.uniku.ac.id/"}, "title": "Penerapan Algoritma K-Means Untuk Klasterisasi Data Obat Pada Rumah Sakit ASRI", "abstract": "Drug management is needed to manage drug stocks. Drugs need to be managed properly, effectively, and efficiently. Through good drug management, the drugs can be obtained quickly and accurately and reduce bad possibilities such as running out of drug stock in health services such as Puskesmas, Hospitals, and others. The results of an interview with one of the employees who manage drug data at the Asri Purwakarta Hospital shows that at the hospital often have drug shortages or excess even though the drug amounts are not too many. Grouping or clusterting is one of the best options that can be used in drug management system because this cluster system can classify the most frequently used drugs and it can become a reference or knowledge based in making decisions to manage the drugs. K-means algorithm is one of the algorithms in clustering that is used in this drug classification research. K-means algorithm is used in the research because of its simplicity and efficiency so it is easy to apply in all fields, especially drug data classification. The results of this study divided the drug data into 2 clusters, the first cluster with high usage there are 6 drugs and the second cluster with low usage with 933 drugs.", "venue": "Nuansa Informatika", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-23", "journal": {"name": "NUANSA INFORMATIKA"}, "authors": [{"authorId": "2160782143", "name": "Muhamad Rizki Nugroho"}, {"authorId": "2160784320", "name": "Iwansyah Edo Hendrawan"}, {"authorId": "74363823", "name": "P. Purwantoro"}], "citations": [{"paperId": "722887f3825ed80efb8a1f17b7acd5d676b956e7", "title": "KLASTERISASI PENERIMA DANA BANTUAN PROGRAM KELUARGA HARAPAN MENGGUNAKAN METODE K-MEANS PADA DESA GEREBA"}, {"paperId": "c7d6a1e8c9e540a6ce91a169bda9bb4f6203912c", "title": "Pengembangan Sistem Cerdas Berbasis Data Mining untuk Meningkatkan Akurasi Prediksi Kebutuhan Obat di Puskesmas Parit Rantang"}, {"paperId": "3e39dce4527e6f5e66a682be6695ad601c6c4d29", "title": "CLUSTERING KUNJUNGAN PASIEN MENGGUNAKAN ALGORITMA K-MEANS PADA RUMAH SAKIT DI WILAYAH BEKASI"}, {"paperId": "d5f82fc5b30fd098b44428811e5d1b5843c84a2e", "title": "PENERAPAN ALGORITME K-MEANS DALAM KLASTERISASI DATA PENJUALAN OBAT APOTEK KIDANGRANGGA"}, {"paperId": "5962f989dcbff15bdf231d9a74954b2de9990480", "title": "Implementasi Data Mining Menggunakan Metode K-Means Dalam Pengelompokkan Bayi Penerima ASI Ekslusif"}, {"paperId": "3f0ffbef253af86e2762282bc7da3d55bad8957a", "title": "Klasterisasi Peserta BPJS Berdasarkan Rekam Medis Menggunakan Algoritma K-Means"}, {"paperId": "58adc7b0dba54f3fdb7648d19fd76bc1ff6ea8c6", "title": "Clustering Vaksinasi Penyakit Mulut dan Kuku Menggunakan Algoritma K-Means"}, {"paperId": "7566addbe2e3015a38c5a3e80f0de1c499e5cf7f", "title": "Implementation of K-Means Algorithm for Diseases Clustering in Elderly Posyandu Participants"}]}
