{"paperId": "11b021ee323610b25370983d8e6c4b428e5ff517", "publicationVenue": {"id": "48fabb98-feb7-4ad6-a81c-bb2f9a779eb2", "name": "Cities", "type": "journal", "issn": "0264-2751", "url": "https://www.journals.elsevier.com/cities", "alternate_urls": ["http://www.sciencedirect.com/science/journal/02642751", "http://www.journals.elsevier.com/cities"]}, "title": "Modeling and evaluating economic and ecological operation efficiency of smart city pilots", "abstract": null, "venue": "Cities", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Cities"}, "authors": [{"authorId": "2109728818", "name": "Malin Song"}, {"authorId": "145505916", "name": "K. Tan"}, {"authorId": "2110274218", "name": "Jianlin Wang"}, {"authorId": "4683066", "name": "Z. Shen"}], "citations": [{"paperId": "4d68961e1173247e154281abd039d6766275a52d", "title": "Can smart cities reduce labor misallocation? Evidence from China"}, {"paperId": "a99aa3a0233e1508c17f5431175103943c821c34", "title": "Analysis on the impact of smart city construction on urban greenness in China's megacities."}, {"paperId": "2423fc7a71329f5d17a11d07c9f268b425e3d19c", "title": "Detecting urban tree canopy using convolutional neural networks with aerial images and LiDAR data"}, {"paperId": "de7abf27fdfd632662cabcd1a182f8c9e6a44419", "title": "National information consumption demonstration city construction and urban green development: A quasi-experiment from Chinese cities"}, {"paperId": "f21d9bec38f98af0f78952c6719e585e237508f3", "title": "Unraveling the Dynamics of BRICS: A Comprehensive Analysis of CO2 Emissions, Energy Consumption, and Technological Innovation"}, {"paperId": "51b7ff7b3aab59e6df27b655f823ef30f3e1e423", "title": "Assessing the role and driving mechanisms of the green financial reform on urban energy consumption and pollution emissions: a policy evaluation from the generalized synthetic control method"}, {"paperId": "9817f63889b275ddb38f0e1e6d9e106d6e26e8bd", "title": "Evaluation of smart city construction efficiency based on multivariate data fusion: A perspective from China"}, {"paperId": "6b370c7c05c93f8e312966c2f5ea3fc1abd2ed61", "title": "Financial efficiency and financial resource allocation of Beijing–Tianjin–Hebei urban agglomeration"}, {"paperId": "b3337274f40a0465b7417849554b67d4a6a118c9", "title": "Green technology innovation under differentiated carbon constraints: The substitution effect of industrial relocation."}, {"paperId": "db0d8d45869f4bb2156c4fdcfb1825312249ab68", "title": "The transfer of energy-intensive projects under carbon constraints: Does energy structure matter?"}, {"paperId": "812bf2a81ed00f71fdf9f3f1059403430a6d3218", "title": "Does the perception of smart governance enhance commercial investments? Evidence from Beijing, Shanghai, Guangzhou, and Hangzhou"}, {"paperId": "f697fc85c5e1155f1c24ec16dfda12eea26b9536", "title": "Multi-tank joint replenishment problem with overlapping time windows in refined oil distribution"}, {"paperId": "e4835463e98a45e155c2155112409d0d486e5da9", "title": "Agricultural Green Ecological Efficiency Evaluation Using BP Neural Network-DEA Model"}, {"paperId": "574418793875bb64d1e770aed3bf945fd2c7f5e1", "title": "A smart warehouse framework, architecture and system aspects under industry 4.0: a bibliometric networks visualisation and analysis"}, {"paperId": "f8792e9d9e45fdf7b7cc68cc00aad98ff810bff6", "title": "Establishing a sustainable development assessment framework for a smart city using a hybrid Z-fuzzy-based decision-making approach"}, {"paperId": "d0595622924f45fa3add7800f5e18fb24c66b870", "title": "Designing a Comprehensive and Flexible Architecture to Improve Energy Efficiency and Decision-Making in Managing Energy Consumption and Production in Panama"}, {"paperId": "c13fcfced3fdd0edb1bf66722f28916598a6c923", "title": "Strategic waste management practices for environmental sustainability – a case of Indian university"}, {"paperId": "618666158b7f420147f6291b33b300109c37c74e", "title": "Dynamic time-frequency connectedness and risk spillover between geopolitical risks and natural resources"}, {"paperId": "f86efc1ad904e400293e51d824a615cd5f154b58", "title": "The effects of smart city construction on urban green total factor productivity: evidence from China"}, {"paperId": "af3026817c60c8557cb7392af2db2159a2a0df3d", "title": "A reverse distribution between synergistic effect and economic development: An analysis from industrial SO2 decoupling and CO2 decoupling"}, {"paperId": "0f7301fcdefe23211cd8049233a14393edf96ff0", "title": "Effects of rising and extreme temperatures on production factor efficiency: Evidence from China's cities"}, {"paperId": "791416fd3d89809749e9057da2f34d07ba5ac5f5", "title": "The effectiveness of smart city policy on pollution reduction in China: new evidence from a quasi-natural experiment"}, {"paperId": "9b642c2eb635aaafbc574ff400056f483ec2e4e5", "title": "How the Pilot Low-Carbon City Policy Promotes Urban Green Innovation: Based on Temporal-Spatial Dual Perspectives"}, {"paperId": "1ab6cedbca10bf12f5fe78fea2ef246a43180df6", "title": "How to Enhance Citizens’ Sense of Gain in Smart Cities? A SWOT-AHP-TOWS Approach"}, {"paperId": "38e3efe99e47667c506930bda0686255b31cf64b", "title": "Do regional integration policies matter? Evidence from a quasi-natural experiment on heterogeneous green innovation"}, {"paperId": "511c6c491a14cb29b5a835d0bab704e86b5050c5", "title": "THE RECENT ECOLOGICAL EFFICIENCY DEVELOPMENT IN CHINA: INTERACTIVE SYSTEMS OF ECONOMY, SOCIETY AND ENVIRONMENT"}, {"paperId": "bc9c77f27a3a07e70f82cf63e0a55e63fd23b790", "title": "Does the creation of healthy cities promote municipal solid waste management? Empirical research in 284 cities in China"}, {"paperId": "d526989c574cd1377ba4afca3dae048d856930e5", "title": "Evaluation of Sustainable Economic and Environmental Development Evidence From OECD Countries"}, {"paperId": "4027b54df6c172a7757269dbb52acc736bce282d", "title": "The Transition of Cities towards Innovations in Mobility: Searching for a Global Perspective"}, {"paperId": "3bfd3b2978383e329ea4b5d33ca6dd5414c6be8e", "title": "Perspectives of Development of Low Emission Zones in Poland: A Short Review"}, {"paperId": "b5b916f32a5525516f19d39638401dee0c5db16d", "title": "Sustainable Energy Development and Climate Change Mitigation at the Local Level through the Lens of Renewable Energy: Evidence from Lithuanian Case Study"}, {"paperId": "eee6e8c7914839dddcb22690ebf1dc41ce9d124b", "title": "Exploration of the Inner Laws of Urbanization Economic Operation and Application Analysis"}, {"paperId": "59a1719549feae79c13c00236e17df2a623ac5c9", "title": "Has Smart City Construction Reduced Corporate Pollution Emissions? New Evidence from Chinese Corporate Pollution Data"}]}
