{"paperId": "11b5afedce962a24e47eb7f2cb56ae9bf37c4c22", "publicationVenue": null, "title": "Classification of Base Station Time Series Based on Weighted Adjustable-Parameter LPVG", "abstract": "With fast development of networking, data storage, data mining is now rapidly expanding in all science and engineering domains. Among them, Internet traffic record of Base Stations expressed as time series is closely related to our online lifestyles. Its classification is one of the most important application to explore the differences in lifestyles of Internet users. Due to the similar global features and different local features of given time series, traditional similarity measurement using original time series only is difficult to identify their differences properly. By transforming time series into visibility graph, similarity is measured in graph domain to adequately capture local features and improve local identification. In this paper, aWeighted Adjustableparameter Limited Penetrable Visibility Graph (WALPVG) is proposed to improve local identification in noisy environment. We modify the visibility criteria of LPVG to remove the noiseindependent traversal in LPVG adding a parameter, preserving local features of time series with noise resistance. By adding weight on the proposed visibility graph, more dynamic structure and local features are extracted. Finally, we use a real-world dataset of usage detail records (UDRs) to verify that our proposed method has better identification than original time series and existing visibility graph method in noisy environment.", "venue": "2019 IEEE 5th Intl Conference on Big Data Security on Cloud (BigDataSecurity), IEEE Intl Conference on High Performance and Smart Computing, (HPSC) and IEEE Intl Conference on Intelligent Data and Security (IDS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-05-01", "journal": {"name": "2019 IEEE 5th Intl Conference on Big Data Security on Cloud (BigDataSecurity), IEEE Intl Conference on High Performance and Smart Computing, (HPSC) and IEEE Intl Conference on Intelligent Data and Security (IDS)", "pages": "126-131"}, "authors": [{"authorId": "2114024374", "name": "Luqi Li"}, {"authorId": "143891653", "name": "Hao Jiang"}, {"authorId": "50825012", "name": "He Nai"}], "citations": []}
