{"paperId": "11c156639a8282f045c94b591eb44a495b39ea3f", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "Improving the Robustness and Efficiency of Continuous Integration and Deployment", "abstract": "Modern software is developed at a rapid pace. To sustain that rapid pace, organizations rely heavily on automated build, test, and release steps. To that end, Continuous Integration and Continuous Deployment (CI/CD) services take the incremental codebase changes that are produced by developers, compile them, link, and package them into software deliverables, verify their functionality, and deliver them to end users. While CI/CD processes provide mission-critical features, if they are misconfigured or poorly operated, the pace of development may be slowed or even halted. To prevent such issues, in this thesis, we set out to study and improve the robustness and efficiency of CI/CD. The thesis will include (1) conceptual contributions in the form of empirical studies of large samples of adopters of CI/CD tools to discover best practices and common limitations, as well as (2) technical contributions in the form of tools that support stakeholders to avoid common limitations (e.g., data misinterpretation issues, CI configuration mistakes).", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "619-623"}, "authors": [{"authorId": "2063714", "name": "Keheliya Gallaba"}], "citations": [{"paperId": "662beadde6c464b2047c2f433872e4fe7617aefc", "title": "Innovations, strategic organizational actions, and sailing-ship effect: illustrated with an IT product"}, {"paperId": "dcd5dbf5c3f3a3fba23a5fbbd2bb797946d57807", "title": "Complexity Coping by Methodical Agile and Modular Product Development - A Bibliometric Review"}, {"paperId": "1d0e18c304946f507ad446517bda07137ea91eee", "title": "Enhancing the Automotive Software Test Environment Using Continuous Integration and Validation Pipeline"}, {"paperId": "d5d93355420c8502ccbc60a61c1bcc9b9dc84ea6", "title": "The Easy Design Handoff Plugin and a CI/CD Pipeline for Automated Design Handoff"}, {"paperId": "b567b47658f414b452a304fae4a4087901601956", "title": "CI-CD Pipeline For Content Releases"}, {"paperId": "8507c9fded5cc03aa6ebbb2cb6f8db2ddcc9e77c", "title": "Adoption challenges of CI/CD methodology in software development teams"}, {"paperId": "4ee668b117daea945710c65f9ad8f75f897383cb", "title": "Uncovering the Benefits and Challenges of Continuous Integration Practices"}, {"paperId": "e75ad9c445e3668528e65f7da69878a711dbd953", "title": "A Study on Development Operations for Continuous Integration using Jenkins"}, {"paperId": "c321e4bcc4764d28dbec1da38c3966e911545562", "title": "A Taxonomy on Continuous Integration and Deployment Tools and Frameworks"}]}
