{"paperId": "11d0a9fce3210b81b714f347dbef7e2419a20832", "publicationVenue": null, "title": "The Data Interaction Game", "abstract": "As many users do not precisely know the structure and/or the content of databases, their queries do not exactly reflect their information needs. The database management systems (DBMS) may interact with users and leverage their feedback on the returned results to learn the information needs behind users' queries. Current query interfaces assume that users follow a fixed strategy of expressing their information needs, that is, the likelihood by which a user submits a query to express an information need remains unchanged during her interaction with the DBMS. Using a real-world interaction workload, we show that users learn and modify how to express their information needs during their interactions with the DBMS. We also show that users' learning is accurately modeled by a well-known reinforcement learning mechanism. As current data interaction systems assume that users do not modify their strategies, they cannot discover the information needs behind users' queries effectively. We model the interaction between users and DBMS as a game with identical interest between two rational agents whose goal is to establish a common language for representing information needs in form of queries. We propose a reinforcement learning method that learns and answers the information needs behind queries and adapts to the changes in users' strategies and prove that it improves the effectiveness of answering queries stochastically speaking. We analyze the challenges of efficient implementation of this method over large-scale relational databases and propose two efficient adaptations of this algorithm over large-scale relational databases. Our extensive empirical studies over real-world query workloads and large-scale relational databases indicate that our algorithms are efficient. Our empirical results also show that our proposed learning mechanism is more effective than the state-of-the-art query answering method.", "venue": "SIGMOD Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "Proceedings of the 2018 International Conference on Management of Data"}, "authors": [{"authorId": "3286927", "name": "Ben McCamish"}, {"authorId": "2087760", "name": "Vahid Ghadakchi"}, {"authorId": "3192362", "name": "Arash Termehchy"}, {"authorId": "1774385", "name": "B. Touri"}, {"authorId": "144768480", "name": "Liang Huang"}], "citations": [{"paperId": "32ba448e90bca6c22c8b90082869d89b7417767b", "title": "Optimizing Dataflow Systems for Scalable Interactive Visualization"}, {"paperId": "f3fa9c91a0ad9385c06b039a064b024a7839fd2a", "title": "How Does User Behavior Evolve During Exploratory Visual Analysis?"}, {"paperId": "fe2d6e98191e9634d8890840a57de027e9b269e7", "title": "Exploratory Training: When Annonators Learn About Data"}, {"paperId": "14dec9c23e5f2ef9e7146cb620c7043620025004", "title": "Assesment of Children Enjoyment in Game-Based Road Safety Education Apps"}, {"paperId": "5d2e2c2261c8f7797d445b4321c11600c6a87da7", "title": "Exploratory training: when trainers learn"}, {"paperId": "ba2bf76c87a903f64f6a4ad11816b3506bf18385", "title": "KondoCloud: Improving Information Management in Cloud Storage via Recommendations Based on File Similarity"}, {"paperId": "2222fe87201177339c89fbfe9ef3c9c8e67674a5", "title": "Prefix-to-SQL: Text-to-SQL Generation from Incomplete User Questions"}, {"paperId": "658ac7ca8b1122e429bf3b01ad73d00fa3bbbb3b", "title": "Evaluation of Machine Learning Algorithms in Predicting the Next SQL Query from the Future"}, {"paperId": "7699389c6d4c94e578f3fe8f2fec0974fe39eb4e", "title": "A Survey on ML4VIS: Applying Machine Learning Advances to Data Visualization"}, {"paperId": "7406dfd7cfe61a8df4d3402eb4a3b1c24abcd673", "title": "Applying Machine Learning Advances to Data Visualization: A Survey on ML4VIS"}, {"paperId": "9640686a3b1fc26722ff53be90ad566ac7690b80", "title": "A Structured Review of Data Management Technology for Interactive Visualization and Analysis"}, {"paperId": "6027391da4b023d0e2e9046b5238f10610294433", "title": "A Game-theoretic Approach to Data Interaction"}, {"paperId": "02d46cc78b14dca297d59d408edd933ccba5c3cf", "title": "How Do Humans and Data Systems Establish a CommonQuery Language?"}, {"paperId": "5b0260b8e3aa94de2665419e4f3fb55da0cfb116", "title": "Integrating Information About Entities Progressively"}, {"paperId": "ac173565060f9d96249b10b1e4bf606289d2dc05", "title": "Progressive Interactions Between Data Sources"}, {"paperId": "c24132d2eb4f4599b4abd363fe55d284d86bd65d", "title": "Streaming Weighted Sampling over Join Queries"}, {"paperId": "b9a05c3b417113bf76e7e6498bd94bd2f2d72408", "title": "Dual-Agent Progressive Join"}, {"paperId": "8e2054a6e5e1b2baf6ff74cd73ee556418f50e1f", "title": "On Supporting Scalable Active Learning-based Interactive Data Exploration with Uncertainty Estimation Index"}, {"paperId": "ec591ce0ba1559c64dbc9e5ace654babe0826730", "title": "Leveraging Human Learning in Interactive Data Exploration"}, {"paperId": "3a396d318c16d15d89afbc48b468a75c3208b340", "title": "Recurrent Neural Networks for Dynamic User Intent Prediction in Human-Database Interaction"}]}
