{"paperId": "11d10894777978ce490d5815fb1aa0f465f580f1", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "Spatiotemporal deep learning approach for estimating water content profiles in soil layers", "abstract": "Land subsidence associated with using natural groundwater resources for serving the growing population needs has been receiving extensive research attention in the literature over the past few decades. The water content fluctuation in the of subsurface soil layers significantly impacts the land subsidence. The key objective of this study is to predict changes in water content profiles in soil layers over a long period of time using a deep learning-based approach. A convolution neural network algorithm that is commonly used in Artificial Intelligence (AI) applications is modified in the present study for processing in-situ measurement water content profiles. The approach used in the proposed AI method has a distinct advantage for generating dynamic predictions based on the extracted spatiotemporal characteristics of the data. In addition, three different algorithms are compared with respect to time series prediction, including long-short-term memory (LSTM), multiple-layer perceptron (MLP) networks and autoregressive integrated moving average (ARIMA).", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2215346473", "name": "Farid Fazel Mojtahedi"}, {"authorId": "2215345023", "name": "Mohammad Amin Ghaffari"}, {"authorId": "2068288851", "name": "S. Rahmati"}, {"authorId": "48002058", "name": "A. Nazari"}, {"authorId": "144762252", "name": "Hamed Sadeghi"}, {"authorId": "46230528", "name": "S. Vanapalli"}], "citations": []}
