{"paperId": "11d6ab00e757b75497414e589d7c03951c433217", "publicationVenue": null, "title": "Big data analytics for security and criminal investigations", "abstract": "Applications of various data analytics technologies to security and criminal investigation during the past three decades have demonstrated the inception, growth, and maturation of criminal analytics. We first identify five cutting‐edge data mining technologies such as link analysis, intelligent agents, text mining, neural networks, and machine learning. Then, we explore their recent applications to the criminal analytics domain, and discuss the challenges arising from these innovative applications. We also extend our study to big data analytics which provides some state‐of‐the‐art technologies to reshape criminal investigations. In this paper, we review the recent literature, and examine the potentials of big data analytics for security intelligence under a criminal analytics framework. We examine some common data sources, analytics methods, and applications related to two important aspects of social network analysis namely, structural analysis and positional analysis that lay the foundation of criminal analytics. Another contribution of this paper is that we also advocate a novel criminal analytics methodology that is underpinned by big data analytics. We discuss the merits and challenges of applying big data analytics to the criminal analytics domain. Finally, we highlight the future research directions of big data analytics enhanced criminal investigations. WIREs Data Mining Knowl Discov 2017, 7:e1208. doi: 10.1002/widm.1208", "venue": "WIREs Data Mining Knowl. Discov.", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-07-01", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "7"}, "authors": [{"authorId": "32198841", "name": "Md. Ileas Pramanik"}, {"authorId": "144031692", "name": "Raymond Y. K. Lau"}, {"authorId": "40381665", "name": "W. Yue"}, {"authorId": "144782498", "name": "Yunming Ye"}, {"authorId": "2109333498", "name": "Chunping Li"}], "citations": [{"paperId": "fb7f9c94732cc3b43a31f18a9f431cde4899ba37", "title": "Visual Data Engineering for Conflict and Terrorism Prediction"}, {"paperId": "00cfea9dcf6a6ebdcbc8ab2d3d6b02177e339bae", "title": "Machine Learning Based Crime Identification System using Data Analytics"}, {"paperId": "4c60590289cbd35f32be7b08c34857ce18a6db64", "title": "Analysis of factors influencing police investigation work based on principal component analysis"}, {"paperId": "be9136e825bc7cc8c79fffc87c3ac1636143a779", "title": "Crime Detection Using Multi-Layer Perceptron in Social Media Platforms"}, {"paperId": "ccb0def1d3488a48156f4bdbd9ee37ba68fa81f1", "title": "Big Data technologies in criminal investigations: The frames of the members of Judiciary Police in Portugal"}, {"paperId": "134f85204a10c6cc7118be5cc54d1682d4e79e67", "title": "The views about Big Data among professionals of police forces: A scoping review of empirical studies"}, {"paperId": "731701f470f114b51718454a803b16e1abac1d25", "title": "A pipeline to collaborative AI models creation between Brazilian governmental institutions"}, {"paperId": "759a2945f341d72116bbcf7ca1e838f3a1cdcfb3", "title": "CopAS: A Big Data Forensic Analytics System"}, {"paperId": "959161f97597c0e5a29dd7fba63ca23e9df8ea0a", "title": "Security Issues and Challenges of Big Data Analytics"}, {"paperId": "275ef8f770798e6b6826a3b047967878db985682", "title": "The use of big data and data mining in the investigation of criminal offences"}, {"paperId": "f9e8a6f6edde439b0379625307804fa4ce9feb78", "title": "Risk and Governance Strategies: China's Big Data Policing in the Context of Marxian Alienation Theory"}, {"paperId": "c98f5f52946418da377ee90749429a072ecd66f4", "title": "MACHINE LEARNING TECHNIQUES BASED EXPLORATION OF VARIOUS TYPES OF CRIMES IN INDIA"}, {"paperId": "fc058879bec724cb7d193aecbf407b068d2cf5df", "title": "BloSecR: A Conceptual Framework of Identity Documents' Security on Blockchain in Refugee Issues and Conserving Fundamental Rights"}, {"paperId": "7c7fda1c61691c1a7c749bbed0ed90d754b65126", "title": "Activities of Law Enforcement Agencies in the Context of the Introduction of Innovative Technologies (Comparative Legal Aspect)"}, {"paperId": "97a6bb25aa2479897d8958a84f37d38701dd82b1", "title": "Big Data applied to criminal investigations: expectations of professionals of police cooperation in the European Union"}, {"paperId": "14e1bef3267d2b49184b7bfa3254f4a1c1f12d0c", "title": "The Role of Big Data Analysis in Increasing the Crime Prediction and Prevention Rates"}, {"paperId": "f79be169d07696e8f805005ee6b103299d52bf2f", "title": "Big data augmentated business trend identification: the case of mobile commerce"}, {"paperId": "56cf1241d235bde1b29b42e09d71ab4f6d40356b", "title": "Modeling user preference dynamics with coupled tensor factorization for social media recommendation"}, {"paperId": "d0d1a0e8c070f9b8a3badc22ec618a09c00804dd", "title": "Crime Analysis and Intelligence System Model Design using Big Data"}, {"paperId": "71fdb9559be8c7f1a0646bd2afb7c280220db8f2", "title": "Privacy preserving big data analytics: A critical analysis of state‐of‐the‐art"}, {"paperId": "8bd301cccd30932c852bd025314050f00ef2ab99", "title": "Healthcare informatics and analytics in big data"}, {"paperId": "fef56a0fe5a761a99aababa954a42c51350298d4", "title": "TSCMF: Temporal and social collective matrix factorization model for recommender systems"}, {"paperId": "7170b56817e758b5a74725182dfcafd19f0f1363", "title": "E2PAMEA: A fast evolutionary algorithm for extracting fuzzy emerging patterns in big data environments"}, {"paperId": "2f66a6c19cbe30f3c877a9bd6ea5bf51e822e282", "title": "Influencing models and determinants in big data analytics research: A bibliometric analysis"}, {"paperId": "09072fdf2efe48aa656245e191a333ef49ece02e", "title": "Artificial intelligence for anti-money laundering: a review and extension"}, {"paperId": "1a619067e4e15367b6f0ba63c2bb058f9c838781", "title": "AN APPROACH TO CRIME DATA ANALYSIS: A SYSTEMATIC REVIEW"}, {"paperId": "6d343d294c1832abd72974b147b1a5d3373ddee1", "title": "A model of policing strategy choice"}, {"paperId": "61b0a491502ff27fe18722c068853fdf86685e2f", "title": "Qualitative hesitant fuzzy group decision making: An additively consistent probability and consensus‐based perspective"}, {"paperId": "21d34aa8bb965c32e4eb4900e5abd85add8c8bbe", "title": "Motif Discovery in Long Time Series: Classifying Phonocardiograms"}, {"paperId": "c9862c44d950ebb64fbce26ed4a8cf8d396ec5a3", "title": "RVFLN-based online adaptive semi-supervised learning algorithm with application to product quality estimation of industrial processes"}, {"paperId": "a040a1ac479118e31079e4e899775b29be87bd05", "title": "Exploring the Impact of (Not) Changing Default Settings in Algorithmic Crime Mapping - A Case Study of Milwaukee, Wisconsin"}, {"paperId": "7e569ce337a1e6bbc716cf2230c822b610acdc7d", "title": "A predictive analytics framework as a countermeasure for attrition of students"}, {"paperId": "3b6b9b9b5a27cead7334e52d69247e61969140be", "title": "Mining clique frequent approximate subgraphs from multi-graph collections"}, {"paperId": "06740d8d19e49c4e7c9bc730f905e6b7589354e9", "title": "Training neural networks on high-dimensional data using random projection"}, {"paperId": "834e1051024a49eb7a227ac6eddf820fb9b77b44", "title": "A review on sentiment discovery and analysis of educational big‐data"}, {"paperId": "3d606ce731ecc6668d91b478d0ae3541af50218f", "title": "Identification of operational demand in law enforcement agencies"}, {"paperId": "20b874e30141b84e8629be5c2c03d49bfbc04ec5", "title": "Big data analytics to identify illegal construction waste dumping: A Hong Kong study"}, {"paperId": "ac673f4e9af6e3bbda90bfc1a0efabfa94073d74", "title": "Data driven particle size estimation of hematite grinding process using stochastic configuration network with robust technique"}, {"paperId": "0b584534ab0f36e2061d5986e8a348757bf37d0d", "title": "Mining High Utility Itemsets from Multiple Databases"}, {"paperId": "4f706d3b61421e7977ebece33010fc366048b336", "title": "Efficiently Updating the Discovered Multiple Fuzzy Frequent Itemsets with Transaction Insertion"}, {"paperId": "6d7c6fc23e36dbb2b3de3e9fe6c3ac3eafd8e800", "title": "A MapReduce-Based Adjoint Method to Predict the Levenson Self Report Psychopathy Scale Value"}, {"paperId": "9e9a21e16d7f6a9981277fe84317663b75a573d3", "title": "Smart health: Big data enabled health paradigm within smart cities"}, {"paperId": "f889d3334b7fd74b140697c29e3e4d4313804fdd", "title": "A method of routing optimization using CHNN in MANET"}, {"paperId": "664c93958d30e7071b795e184e84e2522bcae592", "title": "A Data Streaming Approach to Link Mining in Criminal Networks"}, {"paperId": "bcbe5c3ce11e30c66bb6846a12bb94d482973a7d", "title": "Extension of Canonical Adjacency Matrices for Frequent Approximate Subgraph Mining on Multi-Graph Collections"}, {"paperId": "d231a985487bc49fc785d0dfbb34ec5cc217c6a3", "title": "Hybrid modeling for submergence depth of the pumping well using stochastic configuration networks with random sampling"}, {"paperId": "7ca6261293d92905c5801c5c804083f3680713a6", "title": "Breaking Fake News and Verifying Truth"}, {"paperId": "824a7623cf6347fc2ba1dfb7597a9ba29c012c5d", "title": "A Thorough Analysis of Machine Learning and Deep Learning Methods for Crime Data Analysis"}, {"paperId": "22634b3512a8590cffc4af5cf0364f8e43d15290", "title": "Towards Data Scientific Investigations: A Comprehensive Data Science Framework and Case Study for Investigating Organized Crime and Serving the Public Interest"}, {"paperId": "2f93d6617187fd03c71b227eda0d78ec5e28dc41", "title": "Big Data Analytics and Cybersecurity: Emerging Trends"}, {"paperId": "0467be109e7efef10970393eebef4795698ea81c", "title": "Biometric and Non-biometric Integration: Dual Use Dilemmas"}, {"paperId": "34a484dfd9bdaf6f76ca874d05711d3d12eeb046", "title": "A mobile crowd sensing framework for suspect investigation: An objectivity analysis and de-identification approach"}, {"paperId": "8c2d3e5de202bbfc0b46ec0a5a8ac7e45a0fc142", "title": "Scientific and Technological Advances in Law Enforcement Intelligence Analysis"}, {"paperId": "107d5446dc659bdf5f7d9c7d07846f8dd32d803d", "title": "Text Mining of Public Administration Documents: Preliminary Results on Judgments"}, {"paperId": "574e07185eb4a94252655965e09ff74a7489a22f", "title": "Collective Identity"}, {"paperId": "ee1620b7f4ed9e34fce45b63db30d540fdfb7f81", "title": "Identity Deception"}, {"paperId": "1d6ebba60bbffd1601c0aa1d9baf9825b81f6c12", "title": "Big Data, Cloud and Applications"}, {"paperId": "ccaadf2dcfb2d35cc4a1df8638ec49d38551d8ad", "title": "D3.2 Progress report on dynamic risks for mass gatherings"}, {"paperId": "5734a63f3956dad842663d57ab3c61650a261cf9", "title": "A survey on educational process mining"}]}
