{"paperId": "12120b77b157a8eb14f505e94a3add2374989b5e", "publicationVenue": {"id": "54cdc508-6fba-4c63-8523-bbcb668fc2ca", "name": "Applied System Innovation", "alternate_names": ["Appl Syst Innov"], "issn": "2571-5577", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1109441", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1109441", "https://www.mdpi.com/journal/asi"]}, "title": "Quantum Biotech and Internet of Virus Things: Towards a Theoretical Framework", "abstract": "Quantumization, the process of converting information into quantum (qubit) format, is a key enabler for propelling a new and distinct infrastructure in the pharmaceutical space. Quantum messenger RNA (QmRNA) technology, an indispensable constituent of quantum biotech (QB), is a compelling alternative to conventional vaccine methods because of its capacity for rapid development, high efficacy, and low-cost manufacturing to combat infectious diseases. Internet of Virus Things (IoVT), a biological version of Internet of Things (IoT), comprises applications to fight against pandemics and provides effective vaccine administration. The integration of QB and IoVT constitutes the QBIoVT system to advance the prospect of QmRNA vaccine discovery within a few days. This research disseminates the QBIoVT system paradigm, including architectural aspects, priority areas, challenges, applications, and QmRNA research engine design to accelerate QmRNA vaccines discovery. A comprehensive review of the literature was accomplished, and a context-centered methodology was applied to the QBIoVT paradigm forensic investigations to impel QmRNA vaccine discovery. Based on the above rumination, the principal motive for this study was to develop a novel QBIoVT theoretical framework which has not been produced through earlier theories. The proposed framework shall inspire future QBIoVT system research activities to improve pandemics detection and protection.", "venue": "Applied System Innovation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-08", "journal": {"name": "Applied System Innovation", "pages": "27", "volume": "4"}, "authors": [{"authorId": "145289843", "name": "P. K. Padhi"}, {"authorId": "2087906083", "name": "Feranando Charrua-Santos"}], "citations": [{"paperId": "51ee4139af2f1755899a2a7bee17a5a0589cdd91", "title": "AI for Next Generation Computing: Emerging Trends and Future Directions"}, {"paperId": "8fb856c142c1cdb2635e6f721905ac95d5d3996d", "title": "The Desirable Systemic Uncertainty in Complex IoT Sensor Networks—General Anticipatory Foresight Perspective"}]}
