{"paperId": "12154970ebe8265addb1463c3ed185eaa91bd00d", "publicationVenue": {"id": "1704b8d9-4aa7-4f76-b9dd-eefb0a556059", "name": "Oncology Research", "type": "journal", "alternate_names": ["Oncol Res"], "issn": "0965-0407", "url": "http://www.cognizantcommunication.com/", "alternate_urls": ["https://www.ingentaconnect.com/journals/browse/cog/or"]}, "title": "Biobanking in the digital pathology era", "abstract": "Digital Pathology is becoming more and more important to achieve the goal of precision medicine. Advances in whole-slide imaging, software integration, and the accessibility of storage solutions have changed the pathologists’ clinical practice, not only in terms of laboratory workflow but also for diagnosis and biomarkers analysis. In parallel with the pathology setting advancement, translational medicine is approaching the unprecedented opportunities unrevealed by artificial intelligence (AI). Indeed, the increased usage of biobanks’ datasets in research provided new challenges for AI applications, such as advanced algorithms, and computer-aided techniques. In this scenario, machine learning-based approaches are being propose in order to improve biobanks from biospecimens collection repositories to computational datasets. To date, evidence on how to implement digital biobanks in translational medicine is still lacking. This viewpoint article summarizes the currently available literature that supports the biobanks’ role in the digital pathology era, and to provide possible practical applications of digital biobanks.", "venue": "Oncology Research", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-31", "journal": {"name": "Oncology Research", "pages": "229 - 233", "volume": "29"}, "authors": [{"authorId": "5265202", "name": "G. Bonizzi"}, {"authorId": "2159488711", "name": "L. Zattoni"}, {"authorId": "3838479", "name": "N. Fusco"}], "citations": [{"paperId": "673161d0f6b7abda8f7565aa0046d93ff4c2cd40", "title": "Tumor tissue samples collection for scientific research in morphology and molecular oncology"}, {"paperId": "d7b5d255673592cc43579426cdab340434b2606e", "title": "Unlocking the potential of big data and AI in medicine: insights from biobanking"}, {"paperId": "f33ee5afc70a5df198663ac8e780f9e372f39ec0", "title": "Revolutionizing Cancer Research: The Impact of Artificial Intelligence in Digital Biobanking"}]}
