{"paperId": "1224df04adfd0ab0b6c6de45e74b1f5a09ffffc6", "publicationVenue": null, "title": "Association between Lifestyle-Related Behaviors and Academic Performance among Students", "abstract": "A healthy lifestyle is one factor that minimizes the risk of becoming seriously ill or dying early. A student with a healthy mind and body would be a better learner and thus would achieve a better academic performance. However, the lifestyle of university students was disrupted due to online learning introduced by higher education institutions in response to the outbreak of the coronavirus. Therefore, this study aimed to identify the association between students' lifestyle-related behavior (physical activity, poor diet, healthy diet, sleep, screen time and body mass index) and the academic performance of all full-time students from the October 2021 to February 2022 session in UiTMKB excluding part 1 students, practical students and part-time students. A cross-sectional study was carried out and proportionate stratified random sampling technique was applied to select a sample from the Faculty of Computer and Mathematical Sciences and Faculty of Business and Management. A total of 281 students (24.20% students from the Faculty of Computer and Mathematical Sciences and 75.80% students from the Faculty of Business and Management) were surveyed through questionnaires using Google forms. Binary logistic regression was used to assess the relationship between the lifestyle-related behaviour and the academic performance of the UiTMKB students. The results showed poor diet, healthy diet and sleep have statistically significant influence on the academic performance of the UiTMKB students;meanwhile, the other variables (physical activity, screen time and body mass index) have no significant influence on the academic performance. Thus, this study will significantly assist the students to improve academic performances in terms of the factor of the student's lifestyle-related behavior.", "venue": "International Academic Symposium of Social Science 2022", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-10-20", "journal": {"name": "International Academic Symposium of Social Science 2022"}, "authors": [{"authorId": "40302521", "name": "Siti Aishah Mohd Shafie"}, {"authorId": "2188905749", "name": "Mardhiah Shamsul Shahri"}, {"authorId": "2188908722", "name": "Nur Najwa Najihah Irwan Izuddi"}, {"authorId": "2188908731", "name": "Nursyazana Mohamad Shukri"}, {"authorId": "100535158", "name": "Nasuhar Ab. Aziz"}, {"authorId": "2139539286", "name": "A. Amran"}, {"authorId": "79425417", "name": "M. Nafi"}], "citations": []}
