{"paperId": "1226bc452b65aa93d283fdb766e66180ea678924", "publicationVenue": {"id": "91d19e8f-33cb-44c8-be02-47f3c046c88b", "name": "Indonesian Journal on Learning and Advanced Education (IJOLAE)", "type": "journal", "alternate_names": ["Indones J Learn Adv Educ (IJOLAE"], "issn": "2655-920X", "url": "https://journals.ums.ac.id/index.php/ijolae", "alternate_urls": ["https://journals.ums.ac.id/index.php/ijolae/index"]}, "title": "Elementary Teachers' Perceptions on Genially Learning Media Using Item Response Theory (IRT)", "abstract": "Many studies have developed learning media, but few studies focus on developing learning media in ele-mentary schools using Genially and studying teachers' perceptions of Genially learning media. This study aims to determine teachers' perceptions of hybrid learning media with a more accurate and precise method, namely the item response theory (IRT) from the Rasch model. The survey was carried out by distributing a Likert scale questionnaire of 19 statements. Moreover, the subjects were 45 elementary school teachers in Riau Province, Indonesia. The results showed that they positively perceived the developed genially-based learning media. Genially learning media can support teachers in teaching. Based on these results, teachers need to develop skills in making various technology-based media, in order to support hybrid learning.", "venue": "Indonesian Journal on Learning and Advanced Education (IJOLAE)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-24", "journal": {"name": "Indonesian Journal on Learning and Advanced Education (IJOLAE)"}, "authors": [{"authorId": "122735653", "name": "N. Hermita"}, {"authorId": "69860475", "name": "Z. H. Putra"}, {"authorId": "2086019658", "name": "J. A. Alim"}, {"authorId": "69848965", "name": "T. Wijaya"}, {"authorId": "2073010062", "name": "S. Anggoro"}, {"authorId": "118841271", "name": "Diniya Diniya"}], "citations": [{"paperId": "0fecba8a0d2b792db44bd4e975c16a8b60da1509", "title": "Narzędzia i techniki edukacji zdalnej w kontekście edukacji wczesnoszkolnej i przedszkolnej"}, {"paperId": "65d9c8d14e747b0d6e0d08f13a89cecfa1b6e77d", "title": "Navigating Uncertainty: Exploring Elementary School Teachers' Perspectives on Metacognitive Development in the VUCA Era"}, {"paperId": "b5f78ccc769a06a3e8d9b78dba4cc11b60585307", "title": "Analisis Penerapan Pembelajaran Fisika Pada Kompetensi Profesional Mahasiswa PLP Tahun 2023 Program Studi Pendidikan Fisika"}, {"paperId": "c1a1dc38efad6684f5cf1045e989ca909394ed50", "title": "Peningkatan Kemandirian dan Hasil Belajar Siswa Tingkat SMK Menggunakan Media Pembelajaran Genially"}, {"paperId": "438fa67ab19fc813a85d697a08df60075189e95b", "title": "Pemberdayaan Guru dan Fasilitator dalam Pembelajaran Berdeferensiasi dengan Pendekatan Pendidikan Berpihak pada Anak di Sanggar Belajar Permai Penang Malaysia"}, {"paperId": "c740b288ea9c1e18d579aa80a6118c9c3301dc21", "title": "Textbook Effectiveness with Contextual Teaching and Learning Approach on Creative Thinking Ability Elementary School Students"}, {"paperId": "e49e16af84d50590d8fdaa65affb8db9e4cd6a19", "title": "Development of a Computerized-Adaptive Test to Measure English Vocabulary Size with IRT"}, {"paperId": "6dea4cb0e12a456b5912392df356030bc1fe374f", "title": "Genially- based interactive learning media in the sub-theme of the uniqueness In my home town"}, {"paperId": "de9ab855c94960a71773b95fbbf46a016e66c408", "title": "Using Digital Media During the COVID-19 Pandemic Era: Good Online Program in Higher Education"}, {"paperId": "f1bd45324db18cfc0f933a12087eed7fa020f8a9", "title": "The Role of Instructional Design in Improving Pre-Service and In-Service Teacher’s Mathematics Learning Sets Skills: A Systematic Literature Review in Indonesian Context"}, {"paperId": "ca89eea533959540710afca23b1439269da316ad", "title": "The Development of Interactive Multimedia PowerPoint Geometry Class III in Elementary School"}, {"paperId": "aa881879f4defecb5af89e102103b6938701ae34", "title": "Management of Teacher Competency Development and Training in Improving Learning Quality"}, {"paperId": "b16d5ece0aee4341e07d33ad9a06153bb6f24d0d", "title": "Examination of Conceptual Change Research Over A Decade: A Bibliometric Analysis Using Science Mapping Tool"}, {"paperId": "cab4dd63f8d65abca61046ac83a03b04b11b430c", "title": "Lecturer Gender Perspective With Online Thesis Guidance Case Study Elista in Jambi University"}, {"paperId": "3841943a5273d1c11536054d284483d575c0b4c5", "title": "Science Education Research within TPACK Framework at a Glance: A Bibliometric Analysis"}, {"paperId": "559cdc5baaeb0510ac91dd0ee789aabddb9d8157", "title": "The Influence of Application of Local-wisdom-based Modules toward Peace-loving Characters of Elementary School Students"}, {"paperId": "abdbe7dced6b392fd076476f53eb4cdf2d5a3cfc", "title": "Teacher skills in mathematic learning during the covid-19 pandemic in elementary school"}]}
