{"paperId": "123425969815fb243673a189806956ccc9a4b912", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Behavior of Polish Consumers in Relation to Meals Ordered in Food Service Establishments in the Context of Plate Waste", "abstract": "In the food service industry, food is wasted at every stage of the process. A significant part of food wastage is the so-called plate waste, i.e., food left by the consumer on the plate. The purpose of this research was to analyze the behavior of Polish consumers in relation to meals ordered in food establishments. The following issues were taken into account: leaving an unfinished meal on a plate and reasons for it, taking an unfinished meal home, and ordering half portions. The study was conducted on a representative group of 1115 adult Polish citizens using the CAPI method. Segmentation (cluster analysis) of respondents differing in their behavior in relation to ordered meals was carried out. It turned out that about 53% of Polish citizens do not use food services at all. Men with secondary and higher levels of education and other sources of income (cluster C) less frequently declared leaving unfinished meals on a plate and taking an unfinished meal home, especially in canteens, compared to other clusters. Few respondents declared buying half portions. Excessively large portions and inadequate taste of dishes were indicated by almost 50% of respondents as the main reasons for the generation of plate waste. Measures should be promoted to encourage consumers and food service providers to reduce the generation of plate waste.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-07-04", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2074260415", "name": "M. Tomaszewska"}, {"authorId": "2079913310", "name": "B. Bilska"}, {"authorId": "2081958759", "name": "D. Kołożyn-Krajewska"}], "citations": [{"paperId": "6f3b42a877205437d59e6282f164d671ad13ff53", "title": "Attitudes and Behaviours of Young Consumers towards Wasting Food: Case Study Based on Polish Students"}, {"paperId": "f7ce15945a96e1e37bf37c636293549775fcbe7d", "title": "The Impact of the Nutritional Knowledge of Polish Students Living Outside the Family Home on Consumer Behavior and Food Waste"}, {"paperId": "ef46d60f8a8322c828c83098a97293d0984aa7b2", "title": "The Management of Meals in Food Service Establishments in the Context of Food Waste—Results of Focus Group Interviews with Employees and Owners"}, {"paperId": "340923c90d95bb5b8d0345882a881048a686638d", "title": "Food waste in the context of Poland’s food security: identifying research path dependency through bibliometric research"}]}
