{"paperId": "12386bf7a1ead65d2abfa2754cb823b39428f999", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Comparing Toxicity Across Social Media Platforms for COVID-19 Discourse", "abstract": "The emergence of toxic information on social networking sites, such as Twitter, Parler, and Reddit, has become a growing concern. Consequently, this study aims to assess the level of toxicity in COVID-19 discussions on Twitter, Parler, and Reddit. Using data analysis from January 1 through December 31, 2020, we examine the development of toxicity over time and compare the findings across the three platforms. The results indicate that Parler had lower toxicity levels than both Twitter and Reddit in discussions related to COVID-19. In contrast, Reddit showed the highest levels of toxicity, largely due to various anti-vaccine forums that spread misinformation about COVID-19 vaccines. Notably, our analysis of COVID-19 vaccination conversations on Twitter also revealed a significant presence of conspiracy theories among individuals with highly toxic attitudes. Our computational approach provides decision-makers with useful information about reducing the spread of toxicity within online communities. The study's findings highlight the importance of taking action to encourage more uplifting and productive online discourse across all platforms.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-28", "journal": {"name": "ArXiv", "volume": "abs/2302.14270"}, "authors": [{"authorId": "1637916656", "name": "N. B. Noor"}, {"authorId": "2235080", "name": "Niloofar Yousefi"}, {"authorId": "2003442151", "name": "Billy Spann"}, {"authorId": "47631831", "name": "Dr Nidhi Agarwal"}], "citations": [{"paperId": "78056f5eb0b2b5dd4d0e07d8ff4b139cec77df2d", "title": "Toxicity and Networks of COVID-19 Discourse Communities: A Tale of Two Social Media Platforms"}, {"paperId": "211297f66a8d4f5d881077b24dcf2e971e5a397c", "title": "Towards Developing a Measure to Assess Contagiousness of Toxic Tweets"}]}
