{"paperId": "1242ea6ae9aa88015897dad2ae54fb9b9f118724", "publicationVenue": {"id": "f2966e64-e56f-4cca-88ba-2f3b3c38eda2", "name": "Journal of Technical Education Science", "type": "journal", "alternate_names": ["J Tech Educ Sci"], "issn": "1859-1272"}, "title": "Impact of Integrated Artificial Intelligence and Internet of Things Technologies on Smart City Transformation", "abstract": "Rapid urbanization is placing tremendous pressure on limited resources and aging infrastructure in cities worldwide. Meanwhile, new technologies are emerging to help address urban challenges through data-driven solutions. This paper explores how the strategic integration of artificial intelligence (AI) and Internet of Things (IoT) can transform urban management and services delivery for smart and sustainable cities. The Internet of Things enables the ubiquitous collection of real-time data across urban systems through embedded sensors. However, extracting actionable insights requires advanced analytics. Concurrently, artificial intelligence provides techniques to autonomously analyze huge volumes of IoT-sensed urban data. When combined effectively, AI and IoT can automatically monitor infrastructure, optimize operations, and enhance citizen experiences. This paper first defines key concepts and outlines applications of AI and IoT independently in areas like transportation, energy, environment, and public safety. It then examines how both technologies can be integrated for mutual benefit. Examples of integrated solutions such as predictive maintenance, intelligent transportation, and emergency response optimization are discussed. Challenges to adoption like data privacy, infrastructure costs, skills gaps, and technical standardization are also covered. The conclusion underscores the tremendous potential of AI and IoT to create efficient, resilient and livable urban environments through ubiquitous sensing and autonomous management. With proper policy support and collaborations, cities worldwide can leverage these smart technologies to sustainably combat problems facing urbanization.", "venue": "Journal of Technical Education Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-28", "journal": {"name": "Journal of Technical Education Science"}, "authors": [{"authorId": "2289281728", "name": "Thanh Van Hoang"}], "citations": []}
