{"paperId": "124b7b7134ee5feab97b2187390c04eaf06d51b2", "publicationVenue": null, "title": "Efficient Filters for Geometric Intersection Computations using GPU", "abstract": "Geometric intersection algorithms are fundamental in spatial analysis in Geographic Information System (GIS). Applying high performance computing to perform geometric intersection on huge amount of spatial data to get real-time results is necessary. Given two input geometries (polygon or polyline) of a candidate pair, we introduce a new two-step geospatial filter that first creates sketches of the geometries and uses it to detect workload and then refines the sketches by the common areas of sketches to decrease the overall computations in the refine phase. We call this filter PolySketch-based CMBR (PSCMBR) filter. We show the application of this filter in speeding-up line segment intersections (LSI) reporting task that is a basic computation in a variety of geospatial applications like polygon overlay and spatial join. We also developed a parallel PolySketch-based PNP filter to perform PNP tests on GPU which reduces computational workload in PNP tests. Finally, we integrated these new filters to the hierarchical filter and refinement (HiFiRe) system to solve geometric intersection problem. We have implemented the new filter and refine system on GPU using CUDA. The new filters introduced in this paper reduce more computational workload when compared to existing filters. As a result, we get on average 7.96X speedup compared to our prior version of HiFiRe system.", "venue": "SIGSPATIAL/GIS", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-11-03", "journal": {"name": "Proceedings of the 28th International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "2144470077", "name": "Yiming Liu"}, {"authorId": "2871863", "name": "S. Puri"}], "citations": [{"paperId": "1a48a8df39f5eb03402efde6f56bda6c626c3b99", "title": "Efficient spatial queries over complex polygons with hybrid representations"}, {"paperId": "75e9eee522c8c43fba967e82cf7a8a9592095df6", "title": "APRIL: Approximating Polygons as Raster Interval Lists"}, {"paperId": "4b085b3878436f32b2c432491f5512be90f1a2eb", "title": "Raster Intervals: An Approximation Technique for Polygon Intersection Joins"}, {"paperId": "2d1018d09152cb23c4e9917218ef7b05997fed8d", "title": "Fine-grained dynamic load balancing in spatial join by work stealing on distributed memory"}, {"paperId": "d3a55f1c9b15781c0515caff24742f8b63ae1563", "title": "Accelerating Spatial Autocorrelation Computation with Parallelization, Vectorization and Memory Access Optimization: With a focus on rapid recalculation of COVID related spatial statistics for faster geospatial analysis and response"}, {"paperId": "2e72df18093198a33eb764fdc26332c3c1abad79", "title": "Geospatial Filter and Reﬁne Computations on NVidia Blueﬁeld Data Processing Units (DPU)"}]}
