{"paperId": "12562bf4b685442f0deb2b392f8af9239bb32c78", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Hybrid Workflow Scheduling on Edge Cloud Computing Systems", "abstract": "Internet of Things applications can be represented as workflows in which stream and batch processing are combined to accomplish data analytics objectives in many application domains such as smart home, health care, bioinformatics, astronomy, and education. The main challenge of this combination is the differentiation of service quality constraints between batch and stream computations. Stream processing is highly latency-sensitive while batch processing is more likely resource-intensive. In this work, we propose an end-to-end hybrid workflow scheduling on an edge cloud system as a two-stage framework. In the first stage, we propose a resource estimation algorithm based on a linear optimization approach, gradient descent search (GDS), and in the second stage, we propose a cluster-based provisioning and scheduling technique for hybrid workflows on heterogeneous edge cloud resources. We provide a multi-objective optimization model for execution time and monetary cost under constraints of deadline and throughput. Results demonstrate the framework performance in controlling the execution of hybrid workflows by efficiently tuning several parameters including stream arrival rate, processing throughput, and workflow complexity. In comparison to a meta-heuristics technique using Particle Swarm Optimization (PSO), the proposed scheduler provides significant improvement for large-scale hybrid workflows in terms of execution time and cost with an average of 8% and 35%, respectively.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "134783-134799", "volume": "9"}, "authors": [{"authorId": "119881802", "name": "Raed Alsurdeh"}, {"authorId": "145034579", "name": "R. Calheiros"}, {"authorId": "2964307", "name": "K. Matawie"}, {"authorId": "145762058", "name": "B. Javadi"}], "citations": [{"paperId": "f0524911d8e77919fcfbf163c74c04bad02c7baa", "title": "MBRSDTC\n : Design of a multimodal bioinspired model to improve resource scheduling efficiency with differential task‐level constraints"}, {"paperId": "101734155dbf130f559c2cbdf1668106035a8461", "title": "An approach for modeling the operational requirements of FaaS applications for optimal deployment"}, {"paperId": "70003c9a0236ce7d5852b946b75fb0f9a866183d", "title": "Cloud computing and machine learning for analysis of health care data based on neuro fuzzy logistic regression"}, {"paperId": "bcc4828d86cca0495458c6a6f9294b9edbe33e9d", "title": "A Particle Swarm Optimization Method for AI Stream Scheduling in Edge Environments"}, {"paperId": "bac79e1374a5fef6fcccf1ea48fbac64a0600b8e", "title": "AI Augmented Edge and Fog Computing: Trends and Challenges"}, {"paperId": "abe0584162d9cec88d84b050f411b174dd110137", "title": "Sea lion attacking‐based deer hunting optimization algorithm for dynamic nurse scheduling in health care sector contribution of hybrid algorithm in cloud"}, {"paperId": "5320a82f6a01b011890040fc68ad7f9e0dbb3ecb", "title": "Task Scheduling Model of Edge Computing for AI Flow Computing in Internet of Things"}, {"paperId": "d3035ff9951c539822505e1b2b97c3fb682ac2c5", "title": "Levelized Multiple Workflow Allocation Strategy Under Precedence Constraints With Task Merging in IaaS Cloud Environment"}, {"paperId": "358e483e7f3be652793e420da09370d9146b0f92", "title": "Artiﬁcial Intelligence (AI) Augmented Edge and Fog Computing: Trends and Challenges"}]}
