{"paperId": "126f28a66f753ced021b01f06c0469938ae25b04", "publicationVenue": {"id": "146869d7-bc08-4ccf-89c8-2aba81d32bde", "name": "ACM Journal of Data and Information Quality", "type": "journal", "alternate_names": ["Journal of Data and Information Quality", "J Data Inf Qual", "ACM J Data Inf Qual"], "issn": "1936-1963", "url": "https://dl.acm.org/citation.cfm?id=J1191&picked=prox", "alternate_urls": ["https://dl.acm.org/loi/jdiq", "https://jdiq.acm.org/", "http://portal.acm.org/jdiq"]}, "title": "Transparency, Fairness, Data Protection, Neutrality", "abstract": "The data revolution continues to transform every sector of science, industry, and government. Due to the incredible impact of data-driven technology on society, we are becoming increasingly aware of the imperative to use data and algorithms responsibly—in accordance with laws and ethical norms. In this article, we discuss three recent regulatory frameworks: the European Union’s General Data Protection Regulation (GDPR), the New York City Automated Decisions Systems (ADS) Law, and the Net Neutrality principle, which aim to protect the rights of individuals who are impacted by data collection and analysis. These frameworks are prominent examples of a global trend: Governments are starting to recognize the need to regulate data-driven algorithmic technology. Our goal in this article is to bring these regulatory frameworks to the attention of the data management community and to underscore the technical challenges they raise and that we, as a community, are well-equipped to address. The main takeaway of this article is that legal and ethical norms cannot be incorporated into data-driven systems as an afterthought. Rather, we must think in terms of responsibility by design, viewing it as a systems requirement.", "venue": "ACM Journal of Data and Information Quality", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-08", "journal": {"name": "Journal of Data and Information Quality (JDIQ)", "pages": "1 - 9", "volume": "11"}, "authors": [{"authorId": "69026873", "name": "S. Abiteboul"}, {"authorId": "1682824", "name": "Julia Stoyanovich"}], "citations": [{"paperId": "02f2e448ac3046198b42b342a0a627ca75879a74", "title": "DMPFrame: A Conceptual Metadata Framework for Data Management Plans"}, {"paperId": "096c8f3eeb098b38a1361dba98b1096bb308fb60", "title": "Legal and Ethical Implications of Data Processing in Sex-Positive Techno Parties: the case of ZusammenKommen"}, {"paperId": "d75c6777e99c41adcca905f0e167de10fe5823f8", "title": "“That’s important, but...”: How Computer Science Researchers Anticipate Unintended Consequences of Their Research Innovations"}, {"paperId": "58a7d9db78cddbbbf9e3639c47442229274c80fb", "title": "Applying Data Governance using DAMA-DMBOK 2 Framework: The Case for Human Capital Management Operations"}, {"paperId": "f123ef4e08b0eb5e4f1732a9ef35011d1bccf4df", "title": "Tackling problems, harvesting benefits - A systematic review of the regulatory debate around AI"}, {"paperId": "e87cd63c2bc0a7ab81d31e75ff194b142d84cb34", "title": "Public service operational efficiency and blockchain - A case study of Companies House, UK"}, {"paperId": "28160a04fdf821147929aca8f2fa7ff5d736c3b1", "title": "Software Fairness: An Analysis and Survey"}, {"paperId": "28d9b673f0f1df50e44e7f3e27c22580d5b7bc99", "title": "Integrating Behavioral, Economic, and Technical Insights to Understand and Address Algorithmic Bias: A Human-Centric Perspective"}, {"paperId": "582a56a982b5ccac8c1a660f10f0bfa4705e8b4e", "title": "Editorial: Special Issue on Data Transparency—Uses Cases and Applications"}, {"paperId": "cd5b4b113d5fa90b5dc5aa372111b89d18df88fb", "title": "Automating Research Data Management Using Machine-Actionable Data Management Plans"}, {"paperId": "796a06896f652fdf4cc0b10ed3fd48f834735063", "title": "Economic Democracy and the Quest of Net Neutrality in Indonesia"}, {"paperId": "23c9513541851961647face15bc8df26e8a44b9c", "title": "On a Certain Research Gap in Big Data Mining for Customer Insights"}, {"paperId": "1b8daf33d53b8e4abaf7aef827f6d01e22832c1e", "title": "Effective, but not all the time: Experimental evidence on the effectiveness of a code of ethics' design"}, {"paperId": "409f7955bd2f1254d6a7dd7815f643fde5f99827", "title": "Privacy Intrusiveness in Financial-Banking Fraud Detection"}, {"paperId": "18b18969b8688d01c124543f3956d4fd1b5ad5a7", "title": "Managing bias and unfairness in data for decision support: a survey of machine learning and data engineering approaches to identify and mitigate bias and unfairness within data management and analytics systems"}, {"paperId": "01d4dfaba1d592450c5568fb5a1990dc038a4f0b", "title": "On-line synthesis of parsers for string events"}, {"paperId": "499a3adebe8d05970fb645eaeb7e1e5455950d33", "title": "Modeling and accomplishing the BEREC network neutrality policy"}, {"paperId": "40c9794eaf5c2a142a23237b84ed2a7b3244c8b9", "title": "Legal Requirement Elicitation, Analysis and Specification for a Data Transparency System"}, {"paperId": "27ea4b7b4f0e38d363aa7d3e8dc3c7c282bf0603", "title": "Ethical Dimensions for Data Quality"}, {"paperId": "3b694dfa9df03823db0d765847a16f7cd21a8795", "title": "Data Errors: Symptoms, Causes and Origins"}, {"paperId": "f5bf93fb203d4b63684f895b9b2c88610f152a72", "title": "Informed Consent in Digital Data Management"}, {"paperId": "e63c63c332084b03ae9376c5f8d602e4e053453b", "title": "Complying with the GDPR when vulnerable people use smart devices"}, {"paperId": "1341be192fe9c7c08477a76a2f253b6cbd5c11a0", "title": "Big Data in the Context of Studying Problems of Modern Society"}]}
