{"paperId": "12766d26de60dabd300e1fefd83c62c83576262d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Automated Application Deployment on Multi-Access Edge Computing: A Survey", "abstract": "The advent of technologies such as 5G makes it possible to improve the availability and quality of existing services and introduce new ones, such as enhanced mobile broadband, IoT applications, augmented reality, mission-critical services, cloud gaming, or smart infrastructure. It is now possible to get faster responses to a wide range of requests, but the addition of more users and services can still make normal operation difficult due to network congestion, bandwidth limitations, scalability issues, service differentiation, or security concerns. To solve this problem, and to help meet Service Level Agreements (SLAs), some services must be brought closer to the user. The Multi-access Edge Computing (MEC) initiative is a step in this direction, enabling cloud-like services to be moved closer to the end user, providing lower access latencies. However, the dynamic nature of edge computing environments, and the mobility of users, require the implementation of automated service delivery processes that can adapt to environmental conditions, such as the use of optimal policies tailored to the scenario. This article surveys the research focused on MECs, particularly those that use automated deployment mechanisms, namely Infrastructure as Code (IaC) tools. Today, these tools play a key role in automated deployment mechanisms, especially for maintaining optimal policies, which is still under investigation. The result of this assessment has been the identification of the relevance of IaC to these processes and the identification of future research directions.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "89393-89408", "volume": "11"}, "authors": [{"authorId": "2233773281", "name": "Álvaro Santos"}, {"authorId": "1716043", "name": "Jorge Bernardino"}, {"authorId": "144833822", "name": "N. Correia"}], "citations": [{"paperId": "624188de84c7abf42f02d2a2ed95cea29e010de7", "title": "SLA-ORECS: an SLA-oriented framework for reallocating resources in edge-cloud systems"}, {"paperId": "96aa6d4a8ea6ff7d3dae3c9e86c56b9cf16c6310", "title": "Systematic Analysis of Infrastructure as Code Technologies"}, {"paperId": "6c42d4bbc9346a52de55740995f120736c048e74", "title": "Joint Computation and Communication Resource Optimization for Beyond Diagonal UAV-IRS Empowered MEC Networks"}]}
