{"paperId": "1281227648ab09093742776e9d88a3652d4018c4", "publicationVenue": null, "title": "Role of Emerging IoT Big Data and Cloud Computing for Real Time Application", "abstract": "Although the Internet of things (IoT), cloud computing (CC), and Big Data (BGD) are three different approaches that have evolved independently of each other over time; however, with time, they are becoming increasingly interconnected. The convergence of IoT, CC, and BGD provides new opportunities in various real-time applications, including telecommunication, healthcare, business, education, science, and engineering. Together, these approaches are facing various challenges during data gathering, processing, and management. The focus of this research paper is to pinpoint the emerging trends in IoT, CC, and BGD. The convergence of these approaches and their impact on various real-time applications, benefits, and challenges associated with all these approaches, current industry trends, and future research directions with especial focus on the healthcare domain. The paper also provides a conceptual framework that integrates IoT, CC, and BGD and provides an IoT centric cloud infrastructure using BGD. Finally, this paper summarizes by providing directions for researchers and practitioners about how to leverage the benefits of combining these approaches.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "11"}, "authors": [{"authorId": "40219178", "name": "M. Humayun"}], "citations": [{"paperId": "ad12d9d599d16c83ce8e9956c0fe84918b81c5f8", "title": "Edge-Enabled Smart Traffic Management System: An IoT Implementation for Urban Mobility"}, {"paperId": "fdc49418eba7021835deefc4ad6eeca12dd5f596", "title": "Enhancing Road Safety with Cloud-Integrated IoT Road Signal Detection System"}, {"paperId": "e6c941e01b1f5dfc927b4e8f96434734a1f64f0f", "title": "Role of Industry 4.0 tools in organizational performance of the IT sector"}, {"paperId": "b93dd3cddcf792be1c01d1491d6c21cb8b2ed3d6", "title": "Improving Healthcare Facilities in Remote Areas Using Cutting-Edge Technologies"}, {"paperId": "b8739907c69b0b655a2409831234cb6b4378cb66", "title": "An Overview of IoT for Smart Healthcare Technologies"}, {"paperId": "cb16af7deafdef639ce516261c786cf6c94787dc", "title": "A Secure and Reliable Supply chain management approach integrated with IoT and Blockchain"}, {"paperId": "bf7ddfcdbaacb11ac4a1a2d8a90e107eb6418916", "title": "Improving Security in IoT System Using a Blockchain and a Microservices Technologyy"}, {"paperId": "8a849a9c0e17c8b10cb4684c87b3b1f7696d498d", "title": "Blockchain and LDP Based Smart Healthcare IoT Applications: Architecture, Challenges and Future Works"}, {"paperId": "fc57f56564e2ef0f79ffa0b2195e93df3073051c", "title": "Intelli-farm: IoT based Smart farming using Machine learning approaches"}, {"paperId": "318e1822c7d76e2ab5ef4125d3090b6f7436f21a", "title": "Health Monitoring System Using Internet of Things (IoT) Sensing for Elderly People"}, {"paperId": "9bcee9b324a3a1b373bb640958780fe29e5e4419", "title": "Smart Traffic Management System for Metropolitan Cities of Kingdom Using Cutting Edge Technologies"}, {"paperId": "0a12bd380f0e1ce62d638f0887f6e578d1e929fa", "title": "Big data Analytics for Pre-Teacher Preparation of Higher Education in Thailand"}, {"paperId": "4da3f3937091e4da8b68a28ed5a4c102fe474274", "title": "Software-as-a-Service Security Challenges and Best Practices: A Multivocal Literature Review"}, {"paperId": "74729c221bd24709c99cd76219179dc187130f9c", "title": "Securing Drug Distribution Systems from Tampering Using Blockchain"}, {"paperId": "81b249fa29753d6e3f200d2ddb1a3d50ba7c832c", "title": "Agent-Based Medical Health Monitoring System"}, {"paperId": "e2de8cc88ee28a5d13a196915c743a8add42b5fe", "title": "Real-Time Security Health and Privacy Monitoring for Saudi Highways Using Cutting-Edge Technologies"}, {"paperId": "ddbb6eadc2142997ef299eae2668f1f9477ac568", "title": "A Comparative Analysis Of Data Integrity In Healthcare"}, {"paperId": "bd659a7191b9b45edfbed89f45d01e55a1b32481", "title": "Autonomous Traffic System for Emergency Vehicles"}, {"paperId": "aa7f0a28913e470d970833e27a7119f6e1ee421b", "title": "Arithmetic Framework to Optimize Packet Forwarding among End Devices in Generic Edge Computing Environments"}, {"paperId": "0ebbad0211b011817dab2d5d6e456ded7466a1ee", "title": "Smart schools on the way: How school principals from Catalonia approach the future of education within the fourth industrial revolution"}, {"paperId": "a9854bc2016049292e7e4b3dcfc5d079858d1d82", "title": "Security and Privacy Issues in Cloud Computing"}, {"paperId": "c0dae40e291c73648b73fc01cbcdf594021cc495", "title": "Proposing a Load Balancing Algorithm For Cloud Computing Applications"}, {"paperId": "db50991ca71506c2ed0f28d84157b29e79c06c22", "title": "A Novel Hybrid Approach for Access Control in Cloud Computing"}, {"paperId": "26b06c46d8696bf40c4bf2ff151e8ba948c81f99", "title": "Current Development, Challenges, and Future Trends in Cloud Computing: A Survey"}, {"paperId": "f395a461910ae05795a7fee96f302696824d6a6c", "title": "Bibliographic and Text Analysis of Research on Implementation of Bibliographic and Text Analysis of Research on Implementation of the Internet of Things to Support Education the Internet of Things to Support Education"}, {"paperId": "dd42cc7ba273254629908fee62a50fce4edc4e85", "title": "Design of a Cloud-Blockchain-based Secure Internet of Things Architecture"}, {"paperId": "eff2536385dccca4b90b095a6011486f7fd124b7", "title": "An Integrated Hardware Prototype for Monitoring Gas leaks, Fires, and Remote control via Mobile Application"}, {"paperId": "b7d5230aca99ce71126365dd9d0cb3d892c27417", "title": "A Review on the Role of Machine Learning in Enabling IoT Based Healthcare Applications"}, {"paperId": "a723eeb307a7a4f1d62de872ef5004e230b0026d", "title": "Constrained Quantum Optimization for Resource Distribution Management"}, {"paperId": "a7479f4b1b84b7b343c743e3e3cfd645d9df3b7c", "title": "Improving Latency in Cloud Computing Using Master Node Consensus Approach"}]}
