{"paperId": "128eb49adf1c48f82bdb1870385acb899b822595", "publicationVenue": null, "title": "PriveTAB: Secure and Privacy-Preserving sharing of Tabular Data", "abstract": "Machine Learning has increased our ability to model large quantities of data efficiently in a short time. Machine learning approaches in many application domains require collecting large volumes of data from distributed sources and combining them. However, sharing of data from multiple sources leads to concerns about privacy. Privacy regulations like European Union's General Data Protection Regulation (GDPR) have specific requirements on when and how such data can be shared. Even when there are no specific regulations, organizations may have concerns about revealing their data. For example in cybersecurity, organizations are reluctant to share their network-related data to permit machine learning-based intrusion detectors to be built. This has, in particular, hampered academic research. We need an approach to make confidential data widely available for accurate data analysis without violating the privacy of the data subjects. Privacy in shared data has been discussed in prior work focusing on anonymization and encryption of data. An alternate approach to make data available for analysis without sharing sensitive information is by replacing sensitive information with synthetic data that behave as original data for all analytical purposes. Generative Adversarial Networks (GANs) are one of the well-known models to generate synthetic samples that can have the same distributional characteristics as the original data. However, modeling tabular data using GAN is a non-trivial task. Tabular data contain a mix of categorical and continuous variables and require specialized constraints as described in the CTGAN model. In this paper, we propose a framework to generate privacy-preserving synthetic data suitable for release for analytical purposes. The data is generated using the CTGAN approach, and so is analytically similar to the original dataset. To ensure that the generated data meet the privacy requirements, we use the principle of t-closeness. We ensure that the distribution of attributes in the released dataset is within a certain threshold distance from the real dataset. We also encrypt sensitive values in the final released version of the dataset to minimize information leakage. We show that in a variety of cases, models trained on this synthetic data instead of the real data perform nearly as well when tested on the real data. Specifically, we show that the machine learning models used for network event/attack recognition tasks do not have a significant loss in accuracy when trained on data generated from our framework in place of the real dataset.", "venue": "IWSPA@CODASPY", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-04-18", "journal": {"name": "Proceedings of the 2022 ACM on International Workshop on Security and Privacy Analytics"}, "authors": [{"authorId": "2040711822", "name": "Anantaa Kotal"}, {"authorId": "2482027", "name": "Aritran Piplai"}, {"authorId": "1500371242", "name": "Sai Sree Laya Chukkapalli"}, {"authorId": "2117799283", "name": "A. Joshi"}], "citations": [{"paperId": "b2a0571d6cc7fa612bf664afe4a4cd8c864df7b3", "title": "Privacy-Preserving Data Sharing in Agriculture: Enforcing Policy Rules for Secure and Confidential Data Synthesis"}, {"paperId": "2d7536b2f4b52c3f6eb351899f02eedcefe4372c", "title": "Change Management using Generative Modeling on Digital Twins"}, {"paperId": "a322d65f892c849f9cd99b56a2589e9c5099f7db", "title": "Knowledge-Enhanced Neurosymbolic Artificial Intelligence for Cybersecurity and Privacy"}, {"paperId": "2723635a8dc57599aa81e4af8055ffead4e1755c", "title": "Knowledge-enhanced Neuro-Symbolic AI for Cybersecurity and Privacy"}, {"paperId": "6218a1073cdb846e63758fc04bee699778558f44", "title": "Generating synthetic personal health data using conditional generative adversarial networks combining with differential privacy"}, {"paperId": "7afe4446bbde13f2d8b2e303644da76cb10d970f", "title": "Survey on Privacy-Preserving Techniques for Microdata Publication"}]}
