{"paperId": "129633a30d42053cb9f5f3df19cc10468e50ef09", "publicationVenue": null, "title": "Remus: Efficient Live Migration for Distributed Databases with Snapshot Isolation", "abstract": "Shared-nothing, distributed databases scale transactional and analytical processing over a large data volume by spreading data across servers. However, static sharding of data across nodes makes such systems fail to timely adapt to changing workloads and struggle to obey the cloud pay-as-you-go model. Migrating shards between nodes online is a key technique to react to dynamic changes of workloads for cloud elasticity. Existing approaches introduce severely degraded performance and service interruption, resulting in SLA violation on the cloud; or they are tailor-made to deterministic databases. In this paper, we propose Remus, a new live migration approach for shared-nothing, distributed databases with snapshot isolation. Remus migrates shards between nodes with zero service interruption and minimal performance impact. This is achieved by an efficient unidirectional dual execution during migration. We implement Remus on a shared-nothing, distributed version of PolarDB-PG and evaluate it against state-of-the-art approaches using standard OLTP workloads TPC-C and YCSB, and hybrid workloads consisting of long-lived and short transactions. The results demonstrate Remus is the only effective approach to achieve the goal of zero transaction interruption, zero downtime and marginal performance impact, paving the way for applying the shared-nothing architecture to a cloud database which needs to provide elasticity while guaranteeing strict SLAs.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "1833836", "name": "Junbin Kang"}, {"authorId": "47236927", "name": "Le Cai"}, {"authorId": "2146324505", "name": "Feifei Li"}, {"authorId": "2148929347", "name": "Xingxuan Zhou"}, {"authorId": "152283180", "name": "Wei Cao"}, {"authorId": "2111678574", "name": "Songlu Cai"}, {"authorId": "2169796528", "name": "Daming Shao"}], "citations": [{"paperId": "95aa841476e11d29a4d1bf45ed00996c4af03134", "title": "DBMS-Assisted Live Migration of Virtual Machines"}, {"paperId": "cf944165b36dd241ad985abf98d830742660a6b7", "title": "Special Issue on The ACM SIGMETRICS Workshop on Measurements for Self-Driving Networks"}, {"paperId": "abec4637132923dd3e5a7414c87a6e6e8991520e", "title": "Toward Fast Query Serving in Key-Value Store Migration with Approximate Telemetry"}, {"paperId": "7d87910a491c4e53625287a363a39604ea1b1e0e", "title": "AdaChain: A Learned Adaptive Blockchain"}, {"paperId": "84c0871cca16a1c9ad4a82257ef228f1e3472bf0", "title": "Towards Resource-adaptive Query Execution in Cloud Native Databases"}]}
