{"paperId": "12a99e46d09442311e14af010fa254345bb7825c", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "DualTable: A hybrid storage model for update optimization in Hive", "abstract": "Hive is the most mature and prevalent data warehouse tool providing SQL-like interface in the Hadoop ecosystem. It is successfully used in many Internet companies and shows its value for big data processing in traditional industries. However, enterprise big data processing systems as in Smart Grid applications usually require complicated business logics and involve many data manipulation operations like updates and deletes. Hive cannot offer sufficient support for these while preserving high query performance. Hive using the Hadoop Distributed File System (HDFS) for storage cannot implement data manipulation efficiently and Hive on HBase suffers from poor query performance even though it can support faster data manipulation. There is a project based on Hive issue Hive-5317 to support update operations, but it has not been finished in Hive's latest version. Since this ACID compliant extension adopts same data storage format on HDFS, the update performance problem is not solved. In this paper, we propose a hybrid storage model called DualTable, which combines the efficient streaming reads of HDFS and the random write capability of HBase. Hive on DualTable provides better data manipulation support and preserves query performance at the same time. Experiments on a TPC-H data set and on a real smart grid data set show that Hive on DualTable is up to 10 times faster than Hive when executing update and delete operations.", "venue": "IEEE International Conference on Data Engineering", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-04-27", "journal": {"name": "2015 IEEE 31st International Conference on Data Engineering", "pages": "1340-1351"}, "authors": [{"authorId": "40845069", "name": "Songlin Hu"}, {"authorId": "71670316", "name": "Wantao Liu"}, {"authorId": "1731210", "name": "T. Rabl"}, {"authorId": "2118019541", "name": "Shuo Huang"}, {"authorId": "2119122631", "name": "Ying Liang"}, {"authorId": "2116552144", "name": "Zheng Xiao"}, {"authorId": "145641161", "name": "H. Jacobsen"}, {"authorId": "2056320181", "name": "Xubin Pei"}, {"authorId": "2047132109", "name": "Jiye Wang"}], "citations": [{"paperId": "dbf3a261a1e0c515711bedd9e6ec07867f48c4da", "title": "LogStore: A Workload-Aware, Adaptable Key-Value Store on Hybrid Storage Systems"}, {"paperId": "a2b923f1af0b14f2512515e74ea23c7c591f89e3", "title": "A Versatile Event-Driven Data Model in HBase Database for Multi-source Data of Power Grid"}, {"paperId": "732d8d2c97eab77997af2fa3d56d298288562c29", "title": "A Comparison of ORC-Compress Performance with Big Data Workload on Virtualization"}, {"paperId": "86317984eb85d5e632cfc0dfae311197cbbff1b9", "title": "MapReduce: Review and open challenges"}, {"paperId": "66e7d8c33877b6597ac2c0586219d0404390863a", "title": "Optimizing key-value stores for hybrid storage environments"}, {"paperId": "e7b615824bca6974b395551432c45a996278ca1e", "title": "QMapper for Smart Grid: Migrating SQL-based Application to Hive"}, {"paperId": "ffb9051e77b0422aa72e2918086e9a6834ac7017", "title": "DGFIndex for Smart Grid: Enhancing Hive with a Cost-Effective Multidimensional Range Index"}]}
