{"paperId": "12b236064a66a1c300e9356b4d45047991dc5983", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Generating synthetic signaling networks for in silico modeling studies", "abstract": "Predictive models of signaling pathways have proven to be difficult to develop. The reasons for this include the uncertainty in the number of species, the complexity of species interactions, and the sparseness and uncertainty in experimental data. Traditional approaches to developing mechanistic models rely on collecting experimental data and fitting a single model to that data. This approach works for simple systems but has proven unreliable for complex systems such as biological signaling networks. Thus, there is a need to develop new approaches to create predictive mechanistic models of complex systems. However, to determine the effectiveness of any new algorithm, a baseline model is needed to test the performance of any new algorithm. To meet this need, we developed a method for generating artificial signaling networks that are reasonably realistic and thus could be treated as ground truth models. These synthetic models could then be used to generate synthetic data for developing and testing algorithms designed to recover the underlying network topology and associated parameters. To determine whether our generated signaling networks display meaningful behavior, we compared them with signaling networks from the BioModels Database. This comparison indicated that our generated signaling networks had high topological similarities with BioModel signaling networks with respect to the reaction degree and distance distributions. In addition, our synthetic signaling networks had similar behavioral dynamics with respect to both steady states and oscillations, suggesting that our method generated synthetic signaling networks comparable with BioModel ones and thus could be useful for building network evaluation tools. Highlights We provide a Julia script to generate synthetic random signaling networks. Our generated synthetic random signaling networks had high topological similarities with signaling networks from the BioModels Database. The behavioural dynamics of our synthetic signaling networks are similar to the dynamical behaviors of signaling networks from the BioModels Database.", "venue": "bioRxiv", "year": 2020, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": null, "publicationDate": "2020-05-10", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2110641664", "name": "Jin Xu"}, {"authorId": "2282475128", "name": "Steven Wiley"}, {"authorId": "2282475137", "name": "Herbert M Sauro"}], "citations": []}
