{"paperId": "12b86c14f12a968e9debe17e1eb8698d65c18c82", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "The importance of investigating causative factors and training data selection for accurate landslide susceptibility assessment: the case of Ain Lahcen commune (Tetouan, Northern Morocco)", "abstract": "Abstract Landslide susceptibility maps (LSMs) rely on statistical association for weighting the impact of each predictive factor class. However, the effects of using different training datasets and causative factors combinations on the accuracy of the results are rarely discussed. Accordingly, we investigated the effects of training data and computation technique selection on the accuracy and performance of LSMs. Results show that including relict landslides in the training data diminishes the accuracy of the LSMs compared to models that exclude such processes from the input. As for the effect of choosing different combinations of predictive variables, it was shown to be less significant. After investigating association and causality between predictive variables, the best performing models produced using frequency ratio and logistic regression tend to be more accurate than those including all variables. As for the artificial neural networks, it seems to outperform other models. Indeed, such investigations are beneficial for improving LSMs.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-16", "journal": {"name": "Geocarto International", "pages": "9967 - 9997", "volume": "37"}, "authors": [{"authorId": "1660996947", "name": "Ali Bounab"}, {"authorId": "1742392597", "name": "Kamal Agharroud"}, {"authorId": "2047565666", "name": "Y. El Kharim"}, {"authorId": "147898116", "name": "R. El Hamdouni"}, {"authorId": "2150300687", "name": "Layachi Faghloumi"}], "citations": [{"paperId": "7cc8176628a2108dab0c3eb155bd6e88e1cbd69a", "title": "Effect of Rockfall Spatial Representation on the Accuracy and Reliability of Susceptibility Models (The Case of the Haouz Dorsale Calcaire, Morocco)"}, {"paperId": "907d152dbd53a26a619542075774a9d85f90de56", "title": "Coastal rocky slopes instability analysis and landslide frequency-area distribution alongside the road network in west Mediterranean context (northern of Morocco)"}, {"paperId": "da3e1ae385ba34df76363bd38e88adc2ba4bf39c", "title": "Landslide Susceptibility Assessment in Western External Rif Chain using Machine Learning Methods"}, {"paperId": "0c525a259c98433338776a6e4c8b1a911bc54de5", "title": "A multidisciplinary approach to investigate active and new tectonic effects on landslides spatial distributions: case study in the Pre-Rif Ridges morphostructural unit"}, {"paperId": "0b119b95c2214254a71a1b37c89abaa6a5a3e9fc", "title": "Investigating the Effects of Landslides Inventory Completeness on Susceptibility Mapping and Frequency-Area Distributions: Case of Taounate Province, Northern Morocco"}, {"paperId": "70dd1594c1ad81a9b3d3455d2ca91e96894334dd", "title": "Investigating the effects of landscape characteristics on landslide susceptibility and frequency-area distributions: the case of Taounate province, Northern Morocco"}, {"paperId": "4028b9c3e6333bb5f87af70d394c46a1620ba0ee", "title": "Landslide hazard, susceptibility and risk assessment (HSRA) based on remote sensing and GIS data models: a case study of Muzaffarabad Pakistan"}]}
