{"paperId": "12bba4ea6c9b49b287b223073c090e9b659b831e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Reliability-Aware Approach for Resource Efficient Virtual Network Function Deployment", "abstract": "Network function virtualization (NFV) is a promising technique aimed at reducing capital expenditures (CAPEX) and operating expenditures (OPEX), and improving the flexibility and scalability of an entire network. In contrast to traditional dispatching, NFV can separate network functions from proprietary infrastructure and gather these functions into a resource pool that can efficiently modify and adjust service function chains (SFCs). However, this emerging technique has some challenges. A major problem is reliability, which involves ensuring the availability of deployed SFCs, namely, the probability of successfully chaining a series of virtual network functions while considering both the feasibility and the specific requirements of clients, because the substrate network remains vulnerable to earthquakes, floods, and other natural disasters. Based on the premise of users’ demands for SFC requirements, we present an ensure reliability cost saving algorithm to reduce the CAPEX and OPEX of telecommunication service providers by reducing the reliability of the SFC deployments. The results of extensive experiments indicate that the proposed algorithms perform efficiently in terms of the blocking ratio, resource consumption, time consumption, and the first block.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-13", "journal": {"name": "IEEE Access", "pages": "18238-18250", "volume": "6"}, "authors": [{"authorId": "2152148392", "name": "Jian Sun"}, {"authorId": "40963909", "name": "Guangyang Zhu"}, {"authorId": "2285183764", "name": "Gang Sun"}, {"authorId": "50281324", "name": "D. Liao"}, {"authorId": "2110975826", "name": "Yao Li"}, {"authorId": "3097765", "name": "A. K. Sangaiah"}, {"authorId": "2288747595", "name": "Muthu Ramachandran"}, {"authorId": "2263471844", "name": "Victor Chang"}], "citations": [{"paperId": "f9e18461b46749ac1d26b32f931f9e6d939b47c3", "title": "AI-Based Resource Allocation in E2E Network Slicing with Both Public and Non-Public Slices"}, {"paperId": "f6e62d58eee3f033fc4829f70a0ac4c88a8e7efa", "title": "A Service-differentiated Virtual Network Function Migration Method"}, {"paperId": "5320f01f21c0b0ea7a0a37f3d29704bf50967a2b", "title": "Reliability Estimation and Optimization of a Smart Meter Architecture Using a Monte Carlo Simulation"}, {"paperId": "f03975608141d1f27bbc555c001c1bb442157024", "title": "Efficient Redundancy Allocation for Reliable Service Function Chains in Edge Computing"}, {"paperId": "17aca38fd39315db8bc7d53bb1d51aca212ee9c9", "title": "Real-time network virtualization based on SDN and Docker container"}, {"paperId": "b2ea9b2559d7d602dbcd1463aea60bbc83923b47", "title": "Blockchain-Enabled Joint Resource Allocation for Virtualized Video Service Functions"}, {"paperId": "1ccddb6422d4dd74556c8b5437a4cd85dd331b80", "title": "Fast recovery for online service function chaining interruption using adaptive migration"}, {"paperId": "b08e3ea387f8232312e285b5382e1a3a9dbe5bdd", "title": "Dynamic Service Function Chaining Orchestration in a Multi-Domain: A Heuristic Approach Based on SRv6"}, {"paperId": "00c9afbdabb61de763a9a5ec29a8dbaa4d879cd6", "title": "Comparative Performability Assessment of SFCs: The Case of Containerized IP Multimedia Subsystem"}, {"paperId": "ae52d2b418271ac3f2ef3d8cd380dff4fc2023d3", "title": "Design and Simulation Networking Operating Model for Virtual Network System (VNS)"}, {"paperId": "dd1f5dc04939257c2100289bb70561e36abb5c18", "title": "Reliable Placement of Service Function Chains and Virtual Monitoring Functions With Minimal Cost in Softwarized 5G Networks"}, {"paperId": "da35161e66d59123a801aad845c1e045047d9eb4", "title": "A Reliability-Aware, Delay Guaranteed, and Resource Efficient Placement of Service Function Chains in Softwarized 5G Networks"}, {"paperId": "227061927488a6afc250d9bd5c5bae057ee1edf8", "title": "Dynamic Network Function Provisioning to Enable Network in Box for Industrial Applications"}, {"paperId": "c2ba0a66568ddcdb23544e8c4fd2043445077940", "title": "Dynamic control in Fog Computing infrastructure"}, {"paperId": "647c9b930c40fbc7cb7eac2ac12f6b002f38d36d", "title": "A Survey of Coded Distributed Computing"}, {"paperId": "93d28cab57f577817184ad66569b813f73672403", "title": "Automatic deployment and control of network services in NFV environments"}, {"paperId": "7f9526e8f7428f9b5e8de4ce96a73319d75a411c", "title": "An End-to-End Network Slicing Algorithm Based on Deep Q-Learning for 5G Network"}, {"paperId": "5ef0977db3a7270e500458fe3f0f4f1c63eb5e5e", "title": "Energy-Efficient Provisioning for Service Function Chains to Support Delay-Sensitive Applications in Network Function Virtualization"}, {"paperId": "459c963874cf874b55f096ba863cbdcd45b535a4", "title": "Joint Availability Guarantee and Resource Optimization of Virtual Network Function Placement in Data Center Networks"}, {"paperId": "4e089a926241efc43efa1234d6b0a81be9ded975", "title": "A Dynamic Reliability-Aware Service Placement for Network Function Virtualization (NFV)"}, {"paperId": "628287d585e564528306657ad58a714b35732332", "title": "Improving fog computing performance via Fog-2-Fog collaboration"}, {"paperId": "295f0f0d1d1f83b002edf39d1514983cf94fd21c", "title": "Availability-Aware Service Chain Composition and Mapping in NFV-Enabled Networks"}, {"paperId": "9b133ae48c2f9a4ccfa299465b33dacb4b1cd5a5", "title": "The More the Merrier: Enhancing Reliability of 5G Communication Services With Guaranteed Delay"}, {"paperId": "34d026146483fe6c0428c8f7d6cde2aabd803283", "title": "Energy-efficient and traffic-aware service function chaining orchestration in multi-domain networks"}, {"paperId": "1a86d0d0aa6946b2d711bbcfa7f9b8e607b07c7b", "title": "Availability Evaluation of Multi-Tenant Service Function Chaining Infrastructures by Multidimensional Universal Generating Function"}, {"paperId": "33fe1c1b5299a708c162dfd03e29ac86fb9a80c9", "title": "Queue-aware reliable embedding algorithm for 5G network slicing"}, {"paperId": "3effaa6efc1c802773dde9c4627b45d49f517f31", "title": "Virtual machine migration method based on load cognition"}, {"paperId": "97044493db7ef9b4cad9218305c40afda5c1862b", "title": "A Framework for Provisioning Availability of NFV in Data Center Networks"}, {"paperId": "deaa18a44c5567fefac70d2de0124c3a4f7845a0", "title": "Queue-Aware Dynamic Placement of Virtual Network Functions in 5G Access Network"}, {"paperId": "c4fa2b7832e12abf46687869895ec48b9a63b433", "title": "A Comprehensive Survey on Coded Distributed Computing: Fundamentals, Challenges, and Networking Applications"}, {"paperId": "84f48826f74f0ff32b101d76cd09a81b69b54550", "title": "Reliability-Aware Service Function Chain Backup Protection Method"}, {"paperId": "a314e053fbef0b3b49400b88855a66e05cb28a70", "title": "Optimal Transmission Line Assignment Considering Reliabilities and Assignment Cost in the Multi-State Network"}, {"paperId": "2bbf64d86b2346f93f2626bfb6b8933ae85995c2", "title": "Communication and Computing Cost Optimization of Meshed Hierarchical NFV Datacenters"}, {"paperId": "5d3249fcf5177d5c6f5d8f3d1587b80badeb5fd2", "title": "A Service Function Chain Deployment Method Based on Network Flow Theory for Load Balance in Operator Networks"}, {"paperId": "4bf7ebdc6980f1298ee47d5196dd7d243bc583e4", "title": "Network Function Parallelization for High Reliability and Low Latency Services"}, {"paperId": "49b72e6caecc8b6e3f5018437ca6d5c41ea68bf0", "title": "Survivable Virtual Network Link Shared Protection Method Based on Maximum Spanning Tree"}, {"paperId": "d06158850839e96c8a93a916635ad267027836ac", "title": "Survivable Virtual Network Link Protection Method Based on Network Coding and Protection Circuit"}]}
