{"paperId": "12bdfeb93fafdcccbb422d2a49957ae2ce647787", "publicationVenue": {"id": "9f1937fb-4eb5-485c-996b-9d546e352cb4", "name": "Pharmaceuticals", "type": "journal", "issn": "1424-8247", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169194", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169194", "https://www.mdpi.com/journal/pharmaceuticals"]}, "title": "GRK2 Mediates Macrophage Polarization by Regulating EP4-cAMP-pCREB Signaling in Ulcerative Colitis and the Therapeutic Effect of Paroxetine on Mice with DSS-Induced Colitis", "abstract": "G protein-coupled receptor kinase 2 (GRK2) is one of the cytosolic enzymes, and GRK2 translocation induces prostaglandin E2 receptor 4 (EP4) over-desensitization and reduces the level of cyclic adenosine monophosphate (cAMP) to regulate macrophage polarization. However, the role of GRK2 in the pathophysiology of ulcerative colitis (UC) remains unclear. In this study, we investigated the role of GRK2 in macrophage polarization in UC, using biopsies from patients, a GRK2 heterozygous mouse model with dextran sulfate sodium (DSS)-induced colitis, and THP-1 cells. The results showed that a high level of prostaglandin E2 (PGE2) stimulated the receptor EP4 and enhanced the transmembrane activity of GRK2 in colonic lamina propria mononuclear cells (LPMCs), resulting in a down-regulation of membrane EP4 expression. Then, the suppression of cAMP–cyclic AMP responsive element-binding (CREB) signal inhibited M2 polarization in UC. Paroxetine is acknowledged as one of the selective serotonin reuptake inhibitors (SSRI), which is also considered as a potent GRK2 inhibitor with a high selectivity for GRK2. We found that paroxetine could alleviate symptoms of DSS-induced colitis in mice by regulating GPCR signaling to affect macrophage polarization. Taken together, the current results show that GRK2 may act as a novel therapeutic target in UC by regulating macrophage polarization, and paroxetine as a GRK2 inhibitor may have therapeutic effect on mice with DSS-induced colitis.", "venue": "Pharmaceuticals", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-28", "journal": {"name": "Pharmaceuticals", "volume": "16"}, "authors": [{"authorId": "2107987515", "name": "Jiawei Zhang"}, {"authorId": "145067199", "name": "Xianzheng Zhang"}, {"authorId": "6237076", "name": "M. Lu"}, {"authorId": "48134130", "name": "Yan Chang"}, {"authorId": "7417842", "name": "Qingtong Wang"}, {"authorId": "2922434", "name": "Jiajie Tu"}, {"authorId": "5840162", "name": "Huaxun Wu"}, {"authorId": "2108896233", "name": "Chun Wang"}, {"authorId": "2146482383", "name": "Zhongyang Hong"}, {"authorId": "34766509", "name": "Maoming Xiong"}, {"authorId": "122367915", "name": "Li-hua Song"}, {"authorId": "2191743956", "name": "Wei Wei"}], "citations": []}
