{"paperId": "12c8fcaadf9d1647b7cf312ae3c44619c3ceb35c", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Sparse and Low-Rank Subspace Data Clustering with Manifold Regularization Learned by Local Linear Embedding", "abstract": "Data clustering is an important research topic in data mining and signal processing communications. In all the data clustering methods, the subspace spectral clustering methods based on self expression model, e.g., the Sparse Subspace Clustering (SSC) and the Low Rank Representation (LRR) methods, have attracted a lot of attention and shown good performance. The key step of SSC and LRR is to construct a proper affinity or similarity matrix of data for spectral clustering. Recently, Laplacian graph constraint was introduced into the basic SSC and LRR and obtained considerable improvement. However, the current graph construction methods do not well exploit and reveal the non-linear properties of the clustering data, which is common for high dimensional data. In this paper, we introduce the classic manifold learning method, the Local Linear Embedding (LLE), to learn the non-linear structure underlying the data and use the learned local geometry of manifold as a regularization for SSC and LRR, which results the proposed LLE-SSC and LLE-LRR clustering methods. Additionally, to solve the complex optimization problem involved in the proposed models, an efficient algorithm is also proposed. We test the proposed data clustering methods on several types of public databases. The experimental results show that our methods outperform typical subspace clustering methods with Laplacian graph constraint.", "venue": "Applied Sciences", "year": 2018, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2018-11-06", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2145457173", "name": "Ye Yang"}, {"authorId": "2371027", "name": "Yongli Hu"}, {"authorId": "2110919989", "name": "Fei Wu"}], "citations": [{"paperId": "d2bd14da04ff477066e68eb9b81e4f766670f12b", "title": "Local linear embedding algorithm of mutual neighborhood based on multi-information fusion metric"}, {"paperId": "83df5ce558f026ec02cbc2d834679d4e419f5298", "title": "Multi-Scale Deep Nearest Neighbors"}, {"paperId": "6c9e8e6eecb14d1b317cfa1ce1257d4003d19077", "title": "Graph Convolutional Network Based on Manifold Similarity Learning"}, {"paperId": "e0424f94e4a571031ce2e77d78283bb7aaf599e4", "title": "Dimensionality Reduction of Hyperspectral Images Based on Improved Spatial–Spectral Weight Manifold Embedding"}, {"paperId": "6c3133441640c863a6d98ce62e32f3aaf2c8ec9a", "title": "Weighted Domain Adaptation on Unlabeled Electronic-Nose Drift and Interference Data"}]}
