{"paperId": "12cc7668d7c3ea8532ea17a2e203d1f3b5b5c796", "publicationVenue": {"id": "69bcef46-e562-43b7-a194-bbcb9c0d4657", "name": "Public Health Nutrition", "type": "journal", "alternate_names": ["Public Health Nutr"], "issn": "1368-9800", "url": "https://www.cambridge.org/core/journals/public-health-nutrition", "alternate_urls": ["http://journals.cambridge.org/action/displayJournal?jid=PHN"]}, "title": "Dietary patterns, obesity markers and leukocyte telomere length among Brazilian civil servants: cross-sectional results from the Pro-Saude study", "abstract": "Abstract Objective: Dietary patterns express the combination and variety of foods in the diet. The partial least squares method allows extracting dietary patterns related to a specific health outcome. Few studies have evaluated obesity-related dietary patterns associated with telomeres length. This study aims to identify dietary patterns explaining obesity markers and to assess their association with leukocyte telomere length (LTL), a biological marker of the ageing process. Design: Cross-sectional study. Setting: University campuses in the state of Rio de Janeiro, Brazil Participants: 478 participants of a civil servants’ cohort study with data on food consumption, obesity measurements (total body fat, visceral fat, BMI, leptin and adiponectin) and blood samples. Results: Three dietary patterns were extracted: (1) fast food and meat; (2) healthy and (3) traditional pattern, which included rice and beans, the staple foods most consumed in Brazil. All three dietary patterns explained 23·2 % of food consumption variation and 10·7 % of the obesity-related variables. The fast food and meat pattern were the first factor extracted, explaining 11–13 % variation of the obesity-related response variables (BMI, total body fat and visceral fat), leptin and adiponectin showed the lowest percentage (4·5–0·1 %). The healthy pattern mostly explained leptin and adiponectin variations (10·7 and 3·3 %, respectively). The traditional pattern was associated with LTL (β = 0·0117; 95 % CI 0·0001, 0·0233) after adjustment for the other patterns, age, sex, exercise practice, income and energy intake. Conclusion: Leukocyte telomere length was longer among participants eating a traditional dietary pattern that combines fruit, vegetables and beans.", "venue": "Public Health Nutrition", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-26", "journal": {"name": "Public Health Nutrition", "pages": "2076 - 2082", "volume": "26"}, "authors": [{"authorId": "90129154", "name": "N. Naspolini"}, {"authorId": "4333246", "name": "R. Sichieri"}, {"authorId": "2209732845", "name": "Diana Barbosa Cunha"}, {"authorId": "118015294", "name": "Rosângela Alves Pereira"}, {"authorId": "5884339", "name": "E. Faerstein"}], "citations": [{"paperId": "bad7f0c9ec858302c5a4322cf14c281f0d9f87b4", "title": "Dietary patterns, obesity markers and leukocyte telomere length among Brazilian civil servants: cross-sectional results from the Pro-Saude study – CORRIGENDUM"}]}
