{"paperId": "12d08fe2167085fd340c8262eed0a3d539f14582", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Decoherence Effects in a Three-Level System under Gaussian Process", "abstract": "When subjected to a classical fluctuating field characterized by a Gaussian process, we examine the purity and coherence protection in a three-level quantum system. This symmetry of the three-level system is examined when the local random field is investigated further in the noiseless and noisy regimes. In particular, we consider fractional Gaussian, Gaussian, Ornstein–Uhlenbeck, and power law noisy regimes. We show that the destructive nature of the Ornstein–Uhlenbeck noise toward the symmetry of the qutrit to preserve encoded purity and coherence remains large. Our findings suggest that properly adjusting the noisy parameters to specifically provided values can facilitate optimal extended purity and coherence survival. Non-vanishing terms appear in the final density matrix of the single qutrit system, indicating that it is in a strong coherence regime. Because of all of the Gaussian noises, monotonic decay with no revivals has been observed in the single qutrit system. In terms of coherence and information preservation, we find that the current qutrit system outperforms systems with multiple qubits or qutrits using purity and von Neumann entropy. A comparison of noisy and noiseless situations shows that the fluctuating nature of the local random fields is ultimately lost when influenced using the classical Gaussian noises.", "venue": "Symmetry", "year": 2021, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-29", "journal": {"name": "Symmetry", "pages": "2480", "volume": "14"}, "authors": [{"authorId": "2192144016", "name": "S. M. Zangi"}, {"authorId": "2148758470", "name": "A. Rahman"}, {"authorId": "2192078917", "name": "Zhao-Xo Ji"}, {"authorId": "2164238305", "name": "Hazrat Ali"}, {"authorId": "4332415", "name": "Huanguo Zhang"}], "citations": [{"paperId": "10fa94268a5d53b4fd8ba4ad27cc65edcacbe6a9", "title": "Multistage entanglement swapping using superconducting qubits in the absence and presence of dissipative environment without Bell state measurement"}]}
