{"paperId": "12d85f6c705a7f395e28d5a673a12d3df15e3e3b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Chakra: Advancing Performance Benchmarking and Co-design using Standardized Execution Traces", "abstract": "Benchmarking and co-design are essential for driving optimizations and innovation around ML models, ML software, and next-generation hardware. Full workload benchmarks, e.g. MLPerf, play an essential role in enabling fair comparison across different software and hardware stacks especially once systems are fully designed and deployed. However, the pace of AI innovation demands a more agile methodology to benchmark creation and usage by simulators and emulators for future system co-design. We propose Chakra, an open graph schema for standardizing workload specification capturing key operations and dependencies, also known as Execution Trace (ET). In addition, we propose a complementary set of tools/capabilities to enable collection, generation, and adoption of Chakra ETs by a wide range of simulators, emulators, and benchmarks. For instance, we use generative AI models to learn latent statistical properties across thousands of Chakra ETs and use these models to synthesize Chakra ETs. These synthetic ETs can obfuscate key proprietary information and also target future what-if scenarios. As an example, we demonstrate an end-to-end proof-of-concept that converts PyTorch ETs to Chakra ETs and uses this to drive an open-source training system simulator (ASTRA-sim). Our end-goal is to build a vibrant industry-wide ecosystem of agile benchmarks and tools to drive future AI system co-design.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-23", "journal": {"name": "ArXiv", "volume": "abs/2305.14516"}, "authors": [{"authorId": "145647399", "name": "Srinivas Sridharan"}, {"authorId": "49016253", "name": "Taekyung Heo"}, {"authorId": "2115955952", "name": "Louis Feng"}, {"authorId": "2144716399", "name": "Zhaodong Wang"}, {"authorId": "2058397902", "name": "M. Bergeron"}, {"authorId": "2587709", "name": "Wenyin Fu"}, {"authorId": "6396235", "name": "Shengbao Zheng"}, {"authorId": "2106769330", "name": "Brian Coutinho"}, {"authorId": "1412882761", "name": "Saeed Rashidi"}, {"authorId": "2120210040", "name": "Changhai Man"}, {"authorId": "145984583", "name": "T. Krishna"}], "citations": [{"paperId": "a399c4c0353cd05c81c25881d9e60cad9dc25721", "title": "MAD Max Beyond Single-Node: Enabling Large Machine Learning Model Acceleration on Distributed Systems"}]}
