{"paperId": "12df7a311ba2df1057024cab2bfbb0c5cfb8a2cc", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Study on the optimization of the cultivation path of finance professionals in universities in the digital era", "abstract": "Abstract The rapid development of big data technology is bound to affect the development direction of finance majors in colleges and universities and put forward new challenges to the cultivation of talents. This paper first analyzes the data mining concept, process as well as methods and selects the clustering analysis method, K-means algorithm, and NMF algorithm of big data technology. Secondly, data pre-processing is carried out for students’ learning behavior, learning evaluation, and professional ability data, which makes the subsequent data mining results more reliable. Finally, the judgment matrix is constructed for the training of college finance professionals, and the consistency test of the matrix is carried out to form the absolute indexes of the primary indexes and the relative weight values of the secondary indexes, and the absolute weights of the secondary indexes are obtained through calculation, which finally forms the weights about the student learning behavior, learning evaluation and professional competence evaluation indexes. The learning percentages of student learning clusters are: 16.1%, 19.3%, 30.1%, 34.4%. The innovation and collaboration ability of finance students has been improved, and the deep processing feedback ability of financial knowledge content has been strengthened. Thus, the wide application of big data technology provides a new path for the training of finance professionals in colleges and universities.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-04", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2244569538", "name": "Xiaoying Yang"}], "citations": []}
