{"paperId": "12ef0b7edc605de3305e287f4fea53f99b6df137", "publicationVenue": null, "title": "A Comparison Method for 3D Laser Point Clouds in Displacement Change Detection for Arch Dams", "abstract": "Dam deformation monitoring can directly identify the safe operation state of a dam in advance, which plays an important role in dam safety management. Three-dimensional (3D) terrestrial laser scanning technology is widely used in the field of deformation monitoring due to its fast, complete, and high-density 3D data acquisition capabilities. However, 3D point clouds are characterized by rough surfaces, discrete distributions, which affect the accuracy of deformation analysis of two states data. In addition, it is impossible to directly extract the correspondence points from an irregularly distributed point cloud to unify the coordinates of the two states’ data, and the correspondence lines and planes are often difficult to obtain in the natural environment. To solve the above problems, this paper studies a displacement change detection method for arch dams based on two-step point cloud registration and contour model comparison method. In the environment around a dam, the stable rock is used as the correspondence element to improve the registration accuracy, and a two-step registration method from rough to fine using the iterative closest point algorithm is present to describe the coordinate unification of the two states’ data without control network and target. Then, to analyze the displacement variation of an arch dam surface in two states and improve the accuracy of comparing the two surfaces without being affected by the roughness of the point cloud, the contour model fitting the point clouds is used to compare the change in distance between models. Finally, the method of this paper is applied to the Xiahuikeng Arch Dam, and the displacement changes of the entire dam in different periods are visualized by comparing with the existing methods. The results show that the displacement change in the middle area of the dam is generally greater than that of the two banks, increasing with the increase in elevation, which is consistent with the displacement change behavior of the arch dam during operation and can reach millimeter-level accuracy.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "184", "volume": "10"}, "authors": [{"authorId": "2110511955", "name": "Yijing Li"}, {"authorId": "2113286590", "name": "Ping Liu"}, {"authorId": "9100230", "name": "Huokun Li"}, {"authorId": "47165665", "name": "Faming Huang"}], "citations": [{"paperId": "bce7d3d2b2c4f1150f68b4eb410ca19a25070889", "title": "Monitoring and Quantifying Soil Erosion and Sedimentation Rates in Centimeter Accuracy Using UAV-Photogrammetry, GNSS, and t-LiDAR in a Post-Fire Setting"}, {"paperId": "e06d9feaf2fa442cae06f2a504a1cf820697572b", "title": "Real-time structural monitoring of the Campos Novos dam"}, {"paperId": "1d8db278f4473b07f6246ff8fba9dd475a0a0e94", "title": "A New Method for the Compaction Quality Inspection of High Rockfill Dams Based on 3D Laser Scanning Technology"}, {"paperId": "0bb30b72a0c98728021bb8f9323ed6b1fb2a660e", "title": "Detailed Study of Photogrammetry Technique as a Valid Ice Accretion Measurement Method"}, {"paperId": "6f8f308d4ccbd531f8ffa280decaa5055ebc596e", "title": "Efficiency Study of Combined UAS Photogrammetry and Terrestrial LiDAR in 3D Modeling for Maintenance and Management of Fill Dams"}, {"paperId": "fac625e28104241b15d2c5b02d9740d656a653b7", "title": "Rapid assessment of slope deformation in 3D point cloud considering feature-based simplification and deformed area extraction"}, {"paperId": "f44ecb0671ec416b6a3c1446013c8029b0edbddc", "title": "Application of 3D Laser Scanning Technology Using Laser Radar System to Error Analysis in the Curtain Wall Construction"}, {"paperId": "9bb40aa05d4f19e989fa493847f5d4cd764524e8", "title": "Bridge Non-Destructive Measurements Using a Laser Scanning during Acceptance Testing: Case Study"}, {"paperId": "9e023fad4349384e70ff5120bc486fe0db183c65", "title": "Review on the Research and Applications of TLS in Ground Surface and Constructions Deformation Monitoring"}, {"paperId": "91d89f3006cce11e08462407509880a549cb6a91", "title": "Comparison of TLS and sUAS point clouds for monitoring embankment dams"}, {"paperId": "112a7f282fca155891c6bf9ac65b0667feb7cedc", "title": "Displacement Mapping of Point Clouds for Retaining Structure Considering Shape of Sheet Pile and Soil Fall Effects during Excavation"}, {"paperId": "844f18597bb32fc3248c1f0c691baed980547145", "title": "GPU UTILIZATION IN GEOPROCESSING BIG GEODATA: A REVIEW"}, {"paperId": "a80f845796ebedc9b673177cbe99444a358beeba", "title": "Application of Terrestrial Laser Scanning (TLS) in the Architecture, Engineering and Construction (AEC) Industry"}, {"paperId": "3f665b71a93c78cbcbabb40e0a698c270d90863e", "title": "Copyright Protection of 3D Digitized Artistic Sculptures by Adding Unique Local Inconspicuous Errors by Sculptors"}, {"paperId": "34b54c02c4e74b8bcd4ef0c5a973222db1133c5d", "title": "Geoinformation technologies in the evaluation of short-term geomorphic change: An example of Damdere debris flood area (Bulgaria)"}, {"paperId": "c4bb6f19bf02cf31fc472ee3401b91e54e7487b1", "title": "Landslide susceptibility prediction using C5.0 decision tree model"}, {"paperId": "d0e486d09f251bbe001dd145c088364e8d68d624", "title": "Modernising the control network for determining displacements in hydraulic structures using automatic measurement techniques"}]}
