{"paperId": "12f29e2e571d2ac37c0d6b2c69476dfe9dc14057", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "A bio-inspired adaptive model for search and selection in the Internet of Things environment", "abstract": "The Internet of Things (IoT) is a paradigm that can connect an enormous number of intelligent objects, share large amounts of data, and produce new services. However, it is a challenge to select the proper sensors for a given request due to the number of devices in use, the available resources, the restrictions on resource utilization, the nature of IoT networks, and the number of similar services. Previous studies have suggested how to best address this challenge, but suffer from low accuracy and high execution times. We propose a new distributed model to efficiently deal with heterogeneous sensors and select accurate ones in a dynamic IoT environment. The model’s server uses and manages multiple gateways to respond to the request requirements. First, sensors were grouped into three semantic categories and several semantic sensor network types in order to define the space of interest. Second, each type’s sensors were clustered using the Whale-based Sensor Clustering (WhaleCLUST) algorithm according to the context properties. Finally, the Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS) was improved to search and select the most adequate sensor matching users’ requirements. Experimental results from real data sets demonstrate that our proposal outperforms state-of-the-art approaches in terms of accuracy (96%), execution time, quality of clustering, and scalability of clustering.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "PeerJ Computer Science", "volume": "7"}, "authors": [{"authorId": "1419489348", "name": "Soukaina Bouarourou"}, {"authorId": "3290063", "name": "Abdelhak Boulaalam"}, {"authorId": "3330938", "name": "E. Nfaoui"}], "citations": [{"paperId": "6d2ac1dba1e5bee5e4d16b3d3c0d4bc39f44ec19", "title": "Dynamic coefficient symmetric polynomial-based secure key management scheme for Internet of Things (IoT) networks"}, {"paperId": "1b8da224f5f8041bc1dbdde104ff450ab56ee04e", "title": "Bio-Inspired Internet of Things: Current Status, Benefits, Challenges, and Future Directions"}, {"paperId": "d717da3ee2e12b561c69839f61c2548c18efd70b", "title": "Case Studies with the Contiki-NG Simulator to Design Strategies for Sensors’ Communication Optimization in an IoT-Fog Ecosystem"}, {"paperId": "1dd1598011d6946fce25c7708082891495498bb2", "title": "A Predictive Model for Abnormal Conditions in Smart Farming using IoT Sensors"}, {"paperId": "6ab8115c5e172e3596b9fe182a58647760d1dff1", "title": "An Efﬁcient Model-Based Clustering via Joint Multiple Sink Placement for WSNs"}]}
