{"paperId": "13030aeef1f70f4c0d853cc1b303dc26d8e9f5b3", "publicationVenue": null, "title": "Spatial Query Optimization and Distributed Data Server - Application in the Management of Big Astronomical Surveys. (Optimisation de requêtes spatiales et serveur de données distribué - Application à la gestion de masses de données en astronomie)", "abstract": "Les masses de donnees scientifiques generees par les moyens d'observation modernes, dont l’observation spatiale, soulevent des problemes de performances recurrents, et ce malgre les avancees des systemes distribues de gestion de donnees. Ceci est souvent lie a la complexite des systemes et des parametres qui impactent les performances et la difficulte d’adapter les methodes d’acces au flot de donnees et de traitement.Cette these propose de nouvelles techniques d'optimisations logiques et physiques pour optimiser les plans d'execution des requetes astronomiques en utilisant des regles d'optimisation. Ces methodes sont integrees dans ASTROIDE, un systeme distribue pour le traitement de donnees astronomiques a grande echelle.ASTROIDE allie la scalabilite et l’efficacite en combinant les avantages du traitement distribue en utilisant Spark avec la pertinence d’un optimiseur de requetes astronomiques.Il permet l'acces aux donnees a l'aide du langage de requetes ADQL, couramment utilise.Il implemente des algorithmes de requetes astronomiques (cone search, kNN search, cross-match, et kNN join) en exploitant l'organisation physique des donnees proposee.En effet, ASTROIDE propose une methode de partitionnement des donnees permettant un traitement efficace de ces requetes grâce a l'equilibrage de la repartition des donnees et a l'elimination des partitions non pertinentes. Ce partitionnement utilise une technique d’indexation adaptee aux donnees astronomiques, afin de reduire le temps de traitement des requetes.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Review"], "publicationDate": "2019-01-31", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "8673321", "name": "Mariem Brahem"}], "citations": []}
