{"paperId": "130c3d61dbc1e2dca982179f6f88dc4bc7a944ab", "publicationVenue": {"id": "dc54f07f-65a0-4bc5-8a67-953ed5e659ac", "name": "International Conference on Cyberworlds", "type": "conference", "alternate_names": ["Int Conf Cyberworlds", "Cyberworlds", "Comput World Future Comput Serv Comput Cogn Adapt Content Pattern", "CW", "Computation World: Future Computing, Service Computation, Cognitive, Adaptive, Content, Patterns"], "url": "http://www.wikicfp.com/cfp/program?id=630"}, "title": "Modeling Distributed Stream Processing Systems Under Heavy Workload", "abstract": "Big data applications play a significant role in diverse fields. Distributed Stream Processing Engines (DSPEs) are widely used to support real time applications efficiently. Partitioning algorithms are used to partition data streams into multiple nodes to process in parallel to gain efficient performance. Aggregation cost is an important factor when process stateful streaming applications using such partitioning algorithms because it plays an important role on performance when final result is being produced in stateful streaming applications. However, impact of aggregation cost in stream processing is not discussed comprehensively in existing literature. We use performance modeling to identify the importance of aggregation cost when workload is high. We implement performance model on a multi-node cluster to predict the same behavior as on single resource performance model. We demonstrate that stateful streaming applications need more resources as compare to stateless applications when workload is high and both stateful and stateless applications are running in the same DSPE. Experiments results show that a stateful streaming application needs more resources compared to a stateless streaming application when both applications are running on the same DSPE when the workload is high. Further experiment results show that the performance modeling may be helpful to predict maximum workload that can be process on a DSPE and increase in parallelism level is not guaranteed to increase the performance of streaming applications.", "venue": "International Conference on Cyberworlds", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 International Conference on Cyberworlds (CW)", "pages": "93-100"}, "authors": [{"authorId": "2000479403", "name": "Muhammad Mudassar Qureshi"}, {"authorId": "1713345", "name": "Hanhua Chen"}, {"authorId": "145914256", "name": "Hai Jin"}], "citations": []}
