{"paperId": "131bb279f8b8f2971451e7b8d6c6db959aa2a8c8", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Blockchain Solution for Remote Sensing Data Management Model", "abstract": "A large number of raw data collected by satellites are processed by the production chain to obtain a large number of product data, of which the secure exchange and storage is of interest to researchers in the field of remote sensing information science. Authentic, secure data provide a critical foundation for data analysis and decision-making. Traditional centralized cloud computing systems are vulnerable to attack and, once the central server is successfully attacked, all data will be lost. Distributed ledger technology (DLT) is an innovative computer technology that can ensure information security and traceability, is tamper-proof, and can be applied to the field of remote sensing. Although there are many advantages to using DLT in remote sensing applications, there are some obstacles and limitations to its application. Remote sensing data have the characteristics of a large data volume, a spatiotemporal nature, global scale, and so on, and it is difficult to store and interconnect remote sensing data in the blockchain. To address these issues, this paper proposes a trustworthy and decentralized system using blockchain technology. The novelty of this paper is the proposal of a multi-level blockchain architecture in which the system collects remote sensing data and stores them in the Interplanetary File System (IPFS) network; after generating the IPFS hash, the network rehashes the value again and uploads it on the Ethereum chain for public query. The distributed data storage improves data security, supports the secure exchange of information, and improves the efficiency of data management.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-25", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "144268944", "name": "Quan Zou"}, {"authorId": "1788812", "name": "Wenyang Yu"}, {"authorId": "2221641589", "name": "Ziwei Bao"}], "citations": [{"paperId": "566bd0a8eda5ce2da2ad29479827cb01164ebb58", "title": "Remote Sensing for Agriculture in the Era of Industry 5.0—A Survey"}]}
