{"paperId": "131edb450c975d5acdec2e7cd67f9f714da7c744", "publicationVenue": {"id": "c6b969a5-d295-4c65-bbe8-a2dc52990db8", "name": "IEEE transactions on fuzzy systems", "type": "journal", "alternate_names": ["IEEE trans fuzzy syst", "IEEE Trans Fuzzy Syst", "IEEE Transactions on Fuzzy Systems"], "issn": "1063-6706", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=91"}, "title": "Fast Fuzzy Clustering Based on Anchor Graph", "abstract": "Fuzzy clustering is one of the most popular clustering approaches and has attracted considerable attention in many fields. However, high computational cost has become a bottleneck which limits its applications in large-scale problems. Moreover, most fuzzy clustering algorithms are sensitive to noise. To address these issues, a novel fuzzy clustering algorithm, called fast fuzzy clustering based on anchor graph (FFCAG), is proposed. The FFCAG algorithm integrates anchor-based similarity graph construction and membership matrix learning into a unified framework, such that the prior knowledge of anchors can be further utilized to improve clustering performance. Specifically, FFCAG first constructs an anchor-based similarity graph with a parameter-free neighbor assignment strategy. Then, it designs a quadratic programming model to learn the membership matrix of anchors, which is very different from traditional fuzzy clustering algorithms. More importantly, a novel balanced regularization term is introduced into the objective function to produce more accurate clustering results. Finally, we adopt an alternating optimization algorithm with guaranteed convergence to solve the proposed method. Experimental results performed on synthetic and real-world datasets demonstrate the proposed FFCAG can significantly reduce the computational time with comparable, even superior, clustering performance, compared with state-of-the-art algorithms.", "venue": "IEEE transactions on fuzzy systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-19", "journal": {"name": "IEEE Transactions on Fuzzy Systems", "pages": "2375-2387", "volume": "30"}, "authors": [{"authorId": "144962210", "name": "F. Nie"}, {"authorId": "2152504202", "name": "Chao Liu"}, {"authorId": "48397356", "name": "Rong Wang"}, {"authorId": "2118454138", "name": "Zhen Wang"}, {"authorId": "67180560", "name": "Xuelong Li"}], "citations": [{"paperId": "9a93ec73fc13d895dff1313dd79492a2a32b1e8f", "title": "Soft Multiprototype Clustering Algorithm via Two-Layer Semi-NMF"}, {"paperId": "b5956c98efcb9537e273e1de79051fc188be2754", "title": "An Efficient Federated Multiview Fuzzy C-Means Clustering Method"}, {"paperId": "55d62a4fcf6718ad74a849a2ef911adf2da0bbaa", "title": "Multiview Fuzzy Clustering Based on Anchor Graph"}, {"paperId": "b5756ab8f11b2ec9fdc140adc81827260c5405b9", "title": "Anchor-free Clustering based on Anchor Graph Factorization"}, {"paperId": "b518a2eb1026c3377dd53e84046dd9dfb28fa121", "title": "Adaptive weighted dictionary representation using anchor graph for subspace clustering"}, {"paperId": "e1f847388e321c7c4aa68130d4924ebed12ab561", "title": "Modified suppressed relative entropy fuzzy c-means clustering algorithm"}, {"paperId": "481cf05c5e29e9b7600a45aa343a946f60bef69f", "title": "Local-Global Fuzzy Clustering With Anchor Graph"}, {"paperId": "d515359fade592765a91fec8f836220c0e0f55e1", "title": "Multi-View Bipartite Graph Clustering With Coupled Noisy Feature Filter"}, {"paperId": "f95d26171f8cfff8a982ec5a0161fb2776306465", "title": "Joint Learning of Anchor Graph-Based Fuzzy Spectral Embedding and Fuzzy K-Means"}, {"paperId": "997be2e7b2a05c264a43c9e46bf95c75bcf336a9", "title": "A clustering method based on multi-positive-negative granularity and attenuation-diffusion pattern"}, {"paperId": "189a007e0a36be56a4a5fae2ba63288e0b62243c", "title": "Local feature driven fuzzy local information C-means clustering with kernel metric for blurred and noisy image segmentation"}, {"paperId": "98507bfca78756f14c301c9bfa116ed6e483287a", "title": "LiteWSEC: A Lightweight Framework for Web-Scale Spectral Ensemble Clustering"}, {"paperId": "c693259929bb34a34c453fcabc417492834409c8", "title": "Fast Clustering With Anchor Guidance"}, {"paperId": "1e16a9f45b65dfa80323610ebabd7d280df8d58d", "title": "Scalable Fuzzy Clustering With Anchor Graph"}, {"paperId": "4107d8cc64865e40936e3dda308e5efe738a38ea", "title": "Graph-Based Soft-Balanced Fuzzy Clustering"}, {"paperId": "234e75c55a315ea527112fe77fe0db5de17759ba", "title": "AGFormer: Efficient Graph Representation with Anchor-Graph Transformer"}, {"paperId": "995fc1a760e6f7b5ce035406016ed5f2fad1590a", "title": "Robust interval type-2 kernel-based possibilistic fuzzy clustering algorithm incorporating local and non-local information"}, {"paperId": "2734446259939ff1453202fe75e10a3f1fe0e5a9", "title": "Manifold Enhanced 2-D Fuzzy Subspace Clustering for Image Data"}, {"paperId": "23bcfcc1e199435fdb62169d873e807f1b79974f", "title": "Multi-modal feature selection with anchor graph for Alzheimer's disease"}, {"paperId": "09453b1a6076a2cb79cae7ea77280c054fc88347", "title": "Iteratively Reweighted Algorithm for Fuzzy $c$-Means"}]}
