{"paperId": "133ff0942c18f199b97ffef4bc9ad0a1dacbc707", "publicationVenue": {"id": "2c432ced-7bd7-4aa0-8888-3e39d8a2323c", "name": "Semiotic studies", "alternate_names": ["Semiot stud"], "issn": "2782-2958"}, "title": "Discourse analysis of the American working youth communities on the social network Reddit", "abstract": "The article discusses the working conditions and employment of American working youth during the global pandemic (2020) within the discursive space of the online communities of the social network Reddit. The aim of the study was to conduct a discourse-analysis of professional virtual communities of American working youth. The main tasks were to analyze the specifics of the language of online communication of American working youth, to identify the main problems of employment and labor relations relevant to young Americans, to find out how much American working youth identify with the working class, and to study its class interests, class positions and feelings of solidarity. Infrequent (basic) and frequent (additional) content analyses were used to analyze empirical information (143 text and visual posts in 11 communities of the social network Reddit). The results of the study draw conclusions about the presence of a specific language of communication, similar conditions of employment and living standards, the stability of class positions and the high level of virtual solidarity of American working youth. Comparison of the data obtained with the results of our previous study of virtual communities of Russian working youth allows us to tell about the similarities and differences between American and Russian youth. The main common feature characteristic of both (American and Russian) working youth is the presence of their own group identity.", "venue": "Semiotic studies", "year": 2021, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2021-04-19", "journal": {"name": "Semiotic studies"}, "authors": [{"authorId": "1484455053", "name": "V. Bocharov"}], "citations": [{"paperId": "3cdbafeb97e68ba016e2b77f930304654effe444", "title": "Comments in the VKontakte Social Network as a Discourse Practice of Student Youth"}]}
