{"paperId": "13435cc96b620235c65719ca80179593d9ea6a4f", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "BitGourmet: Deterministic Approximation via Optimized Bit Selection", "abstract": "The goal of deterministic approximation is to produce guaranteed bounds for aggregates in SQL queries (i.e., the exact value is guaranteed to be contained within those bounds). We present our ongoing work on BitGourmet, a novel sys-tem for deterministic approximation, and ﬁrst experimental results. BitGourmet reduces processing time, compared to standard processing, by considering only a subset of bit positions in every column. It stores the entire database as a collection of bit vectors. Given user-speciﬁed constraints on approximation precision, BitGourmet selects an optimal subset of bit vectors to generate a result of the desired precision with minimal processing overheads. BitGourmet features a specialized processing engine with scenario-speciﬁc operators. It uses a multi-objective, cost-based optimizer that employs cardinality, cost, and error models based on bit-level data statistics. Furthermore, it uses a proactive buﬀer management strategy based on query predictions to ﬁll its buﬀer with bit vectors that are likely to be relevant for future queries. We provide ﬁrst experimental results, demonstrating signiﬁcant speedups over state-of-the-art exact processing engines and increased result precision, compared to sampling-based approximation engines.", "venue": "Conference on Innovative Data Systems Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "32184052", "name": "Saehan Jo"}, {"authorId": "2636156", "name": "Immanuel Trummer"}], "citations": [{"paperId": "013e43a172f71a80646c11ae8e051a60afc20363", "title": "SMART: Automatically Scaling Down Language Models with Accuracy Guarantees for Reduced Processing Fees"}, {"paperId": "c722c91532d5682dade05f2ae441178a6fcd0302", "title": "Demonstration of ThalamusDB: Answering Complex SQL Queries with Natural Language Predicates on Multi-Modal Data"}, {"paperId": "4bead15e411d8230a1b7ee0859a2015b80ac08d0", "title": "Demonstration of ScroogeDB"}, {"paperId": "b1b4c7cca7c15e9fe497f69239672834261627a1", "title": "Demonstration of BitGourmet: Data Analysis via Deterministic Approximation"}]}
