{"paperId": "134f85204a10c6cc7118be5cc54d1682d4e79e67", "publicationVenue": null, "title": "The views about Big Data among professionals of police forces: A scoping review of empirical studies", "abstract": "There is a growing tendency toward the introduction of Big Data in police departments to improve the prevention and investigation of crime. However, there is little systematic knowledge about the perspectives of professionals in police forces regarding this technology. This article fills this gap by presenting a scoping review that systematizes empirical studies of the views of professionals in police forces about Big Data in the field of policing and criminal investigation. Fourteen articles were analyzed following a descriptive–analytical method. Optimistic and oppositional views about Big Data among professionals in police forces were then described. Optimistic views focused on the potential of Big Data to improve the objectivity and efficiency of policing and better manage police resources by providing new capabilities and strategies by which to perform crime predictions, risk assessments, criminal investigations, crime analysis, risk management, cooperation and data exchange. Oppositional views related to the police's awareness of Big Data's biases, the lack of a regulatory landscape, misuse of data, privacy threats, data security, misplaced trust in technology, the absence of major changes in work practices, and practical barriers. Analysis of the co-presence of optimistic and oppositional views adds a comprehensive and interpretative argument that might contribute to critical reflections on the technological feasibility, societal usability, and desirability of Big Data technologies in police departments.", "venue": "International Journal of Police Science &amp; Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-06", "journal": {"name": "International Journal of Police Science & Management", "pages": "208 - 220", "volume": "25"}, "authors": [{"authorId": "2151822576", "name": "Laura Neiva"}, {"authorId": "144809236", "name": "H. Machado"}, {"authorId": "150307801", "name": "S. Silva"}], "citations": []}
