{"paperId": "13559985be8e0fd81cfab9230ebb1c4b9a3225fc", "publicationVenue": {"id": "c52375db-5573-406f-a12b-854c7ba98498", "name": "BioMed Research International", "type": "journal", "alternate_names": ["Biomed Res Int"], "issn": "2314-6133", "url": "http://www.hindawi.com/journals/bmri", "alternate_urls": ["http://www.hindawi.com/journals/bmri/"]}, "title": "An ML-Enabled Internet of Things Framework for Early Detection of Heart Disease", "abstract": "Healthcare occupies a central role in sustainable societies and has an undeniable impact on the well-being of individuals. However, over the years, various diseases have adversely affected the growth and sustainability of these societies. Among them, heart disease is escalating rapidly in both economically settled and undeveloped nations and leads to fatalities around the globe. To reduce the death ratio caused by this disease, there is a need for a framework to continuously monitor a patient's heart status, essentially doing early detection and prediction of heart disease. This paper proposes a scalable Machine Learning (ML) and Internet of Things-(IoT-) based three-layer architecture to store and process a large amount of clinical data continuously, which is needed for the early detection and monitoring of heart disease. Layer 1 of the proposed framework is used to collect data from IoT wearable/implanted smart sensor nodes, which includes various physiological measures that have significant impact on the deterioration of heart status. Layer 2 stores and processes the patient data on a local web server using various ML classification algorithms. Finally, Layer 3 is used to store the critical data of patients on the cloud. The doctor and other caregivers can access the patient health conditions via an android application, provide services to the patient, and inhibit him/her from further damage. Various performance evaluation measures such as accuracy, sensitivity, specificity, F1-measure, MCC-score, and ROC curve are used to check the efficiency of our proposed IoT-based heart disease prediction framework. It is anticipated that this system will assist the healthcare sector and the doctors in diagnosing heart patients in the initial phases.", "venue": "BioMed Research International", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "BioMed Research International", "volume": "2022"}, "authors": [{"authorId": "2099404912", "name": "Y. Muhammad"}, {"authorId": "2142401670", "name": "Moteeb Almoteri"}, {"authorId": "100963313", "name": "Hana Mujlid"}, {"authorId": "2064138461", "name": "Abdulrhman Alharbi"}, {"authorId": "52014291", "name": "Fahad A. Alqurashi"}, {"authorId": "51906985", "name": "A. Dutta"}, {"authorId": "31810658", "name": "Sultan Almotairi"}, {"authorId": "70558923", "name": "Hamad Almohamedh"}], "citations": [{"paperId": "b3702f8a8b0392c1304309fd4442bc85e691ca3a", "title": "Machine learning-based smart wearable system for cardiac arrest monitoring using hybrid computing"}, {"paperId": "a2a32a7e24cd9d3ddbfaed9a5e35e52bf164ac99", "title": "Retracted: An ML-Enabled Internet of Things Framework for Early Detection of Heart Disease"}, {"paperId": "a23c55b999899d5e2e9ac2e1b819f82beaf7b6af", "title": "Stakeholder-led understanding of the implementation of digital technologies within heart disease diagnosis: a qualitative study protocol"}, {"paperId": "45f0d348da49776526e7af398f783a503c05d98d", "title": "IoMT Meets Machine Learning: From Edge to Cloud Chronic Diseases Diagnosis System"}]}
