{"paperId": "135c6a0e03dd3801225c88e76b98ff0ea4564c65", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "BigDataSDNSim: A simulator for analyzing big data applications in software‐defined cloud data centers", "abstract": "The integration and crosscoordination of big data processing and software‐defined networking (SDN) are vital for improving the performance of big data applications. Various approaches for combining big data and SDN have been investigated by both industry and academia. However, empirical evaluations of solutions that combine big data processing and SDN are extremely costly and complicated. To address the problem of effective evaluation of solutions that combine big data processing with SDN, we present a new, self‐contained simulation tool named BigDataSDNSim that enables the modeling and simulation of the big data management system YARN, its related programming models MapReduce, and SDN‐enabled networks in a cloud computing environment. BigDataSDNSim supports cost‐effective and easy to conduct experimentation in a controllable, repeatable, and configurable manner. The article illustrates the simulation accuracy and correctness of BigDataSDNSim by comparing the behavior and results of a real environment that combines big data processing and SDN with an equivalent simulated environment. Finally, the article presents two uses cases of BigDataSDNSim, which exhibit its practicality and features, illustrate the impact of data replication mechanisms of MapReduce in Hadoop YARN, and show the superiority of SDN over traditional networks to improve the performance of MapReduce applications.", "venue": "Software, Practice & Experience", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-10", "journal": {"name": "Software: Practice and Experience", "pages": "893 - 920", "volume": "51"}, "authors": [{"authorId": "30449997", "name": "K. Alwasel"}, {"authorId": "145034579", "name": "R. Calheiros"}, {"authorId": "144901372", "name": "S. Garg"}, {"authorId": "1709598", "name": "R. Buyya"}, {"authorId": "144928956", "name": "R. Ranjan"}], "citations": [{"paperId": "483bed07b51f1c4cf5aa900c7698ce297db0607e", "title": "A Comprehensive Survey on Knowledge-Defined Networking"}, {"paperId": "40b1a863ab89f20c2c96d335c3a34ee5d9713a0a", "title": "A Hybrid Software and Hardware SDN Simulation Testbed"}, {"paperId": "b15e0e84da98db092494b23e841ab60c5b889ef0", "title": "Energy Aware Fuzzy Approach for VNF Placement and Consolidation in Cloud Data Centers"}, {"paperId": "1c4a73f78342cf48b1e9e2cb5418da35feeb5519", "title": "How does cloud computing help businesses to manage big data issues"}, {"paperId": "3c84ef346df6265b76b380923193c636df93e7cf", "title": "Notebook‐as‐a‐VRE (NaaVRE): From private notebooks to a collaborative cloud virtual research environment"}, {"paperId": "2d5bc7d58d719a7b6c8ff488d2ed7f563dd69d92", "title": "Cloud and Big Data Electronic Age: A Review"}, {"paperId": "d39647268eca99902f736751cccdfc0e71dd0927", "title": "Coming Together of Big Data and Cloud Computing : A Review"}, {"paperId": "da0151bae81da4213959d20ebb6db4d7c351fd7e", "title": "IoTSim-Osmosis: A framework for modeling and simulating IoT applications over an edge-cloud continuum"}, {"paperId": "0901bebaa92a827f18968c2c3ee417cd45761174", "title": "IoTSim-SDWAN: A simulation framework for interconnecting distributed datacenters over Software-Defined Wide Area Network (SD-WAN)"}, {"paperId": "42a50bd8a90baad3b61c4181d5e6bc0f71573a0b", "title": "A Survey on Cloud Computing Simulation and Modeling"}, {"paperId": "81c9fd267851363acc9120ff7bcd5837402674d5", "title": "An intelligent system for energy management in smart cities based on big data and ontology"}, {"paperId": "b65606670022cb25587c6946d9e5ed60713b1c7e", "title": "Intelligent Monitoring of Data Center Physical Infrastructure"}, {"paperId": "39a6407841b04770d9aa60ab6166eb957fe0005a", "title": "Metaheuristics for scheduling of heterogeneous tasks in cloud computing environments: Analysis, performance evaluation, and future directions"}, {"paperId": "f184b1c3db98a09cb5b198b3e5d1107082e32100", "title": "SimulateIoT: Domain Specific Language to Design, Code Generation and Execute IoT Simulation Environments"}]}
