{"paperId": "1363848ea3e419421137d9af9c8304c90678fb41", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Landslide Susceptibility Mapping: Machine and Ensemble Learning Based on Remote Sensing Big Data", "abstract": "Predicting landslide occurrences can be difficult. However, failure to do so can be catastrophic, causing unwanted tragedies such as property damage, community displacement, and human casualties. Research into landslide susceptibility mapping (LSM) attempts to alleviate such catastrophes through the identification of landslide prone areas. Computational modelling techniques have been successful in related disaster scenarios, which motivate this work to explore such modelling for LSM. In this research, the potential of supervised machine learning and ensemble learning is investigated. Firstly, the Flexible Discriminant Analysis (FDA) supervised learning algorithm is trained for LSM and compared against other algorithms that have been widely used for the same purpose, namely Generalized Logistic Models (GLM), Boosted Regression Trees (BRT or GBM), and Random Forest (RF). Next, an ensemble model consisting of all four algorithms is implemented to examine possible performance improvements. The dataset used to train and test all the algorithms consists of a landslide inventory map of 227 landslide locations. From these sources, 13 conditioning factors are extracted to be used in the models. Experimental evaluations are made based on True Skill Statistic (TSS), the Receiver Operation characteristic (ROC) curve and kappa index. The results show that the best TSS (0.6986), ROC (0.904) and kappa (0.6915) were obtained by the ensemble model. FDA on its own seems effective at modelling landslide susceptibility from multiple data sources, with performance comparable to GLM. However, it slightly underperforms when compared to GBM (BRT) and RF. RF seems most capable compared to GBM, GLM, and FDA, when dealing with all conditioning factors.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-28", "journal": {"name": "Remote. Sens.", "pages": "1737", "volume": "12"}, "authors": [{"authorId": "20934352", "name": "B. Kalantar"}, {"authorId": "1735221", "name": "N. Ueda"}, {"authorId": "2919046", "name": "V. Saeidi"}, {"authorId": "1991774", "name": "K. Ahmadi"}, {"authorId": "30632706", "name": "Alfian Abdul Halin"}, {"authorId": "3138599", "name": "F. Shabani"}], "citations": [{"paperId": "6ac06f21867a68d9c1c0f5c1f3388b1858d40402", "title": "Optimizing landslide susceptibility mapping using machine learning and geospatial techniques"}, {"paperId": "fb5b850a05bde2a55c81a71d8fee8d62ea999a83", "title": "Global Geospatial Data for Flood and Landslide Susceptibility Mapping"}, {"paperId": "88927068c4031ffa8f905aa3f60ab5c1bd3cac3d", "title": "Remote Sensing and GIS in Landslide Management: An Example from the Kravarsko Area, Croatia"}, {"paperId": "1a9520fc9779caf537099fd83c87d62e116c8b2c", "title": "Improving Landslides Prediction: Meteorological Data Preprocessing Based on Supervised and Unsupervised Learning"}, {"paperId": "4710ff1ffa39692d551a22fdcdcee06aabb51604", "title": "Automatic Identification for the Boundaries of InSAR Anomalous Deformation Areas Based on Semantic Segmentation Model"}, {"paperId": "87a756a3109c405ca2ae70f514d6bf020c016c59", "title": "Automatic Mapping of Potential Landslides Using Satellite Multitemporal Interferometry"}, {"paperId": "4f6cd80acbb201322125213a17f5bdad00879bab", "title": "Formation and Hazard Analysis of Landslide Damming Based on Multi-Source Remote Sensing Data"}, {"paperId": "753bfa94fec41d2a8c444161886d7d8387251008", "title": "Development of landslide susceptibility mapping with a multi-variance statistical method approach in Kepahiang Indonesia"}, {"paperId": "a08c320b5b3f6b167457cabd33513e11f3ec4b7d", "title": "Mapping Post-Earthquake Landslide Susceptibility Using U-Net, VGG-16, VGG-19, and Metaheuristic Algorithms"}, {"paperId": "fba3c60b8a8867eb6c171888b7a0de9ae71ddeba", "title": "Impact of Vegetation Differences on Shallow Landslides: A Case Study in Aso, Japan"}, {"paperId": "14409f4a17b180363ec23f7c4315b52d3b0e6223", "title": "Landslide susceptibility mapping in Badakhshan province, Afghanistan: a comparative study of machine learning algorithms"}, {"paperId": "de00666599502195e8076f4ef6aa2027292bf671", "title": "Development and assessment of a novel hybrid machine learning-based landslide susceptibility mapping model in the Darjeeling Himalayas"}, {"paperId": "7392545c01a243c4a843e741d9ca1aa1a1487a1a", "title": "Characterization and Analysis of Landslide Evolution in Intramountain Areas in Loja (Ecuador) Using RPAS Photogrammetric Products"}, {"paperId": "95d0d21accb48665d2f74b8874258ad3a46f3e36", "title": "Does machine learning adequately predict earthquake induced landslides?"}, {"paperId": "cc67d4cedf46ddac2ab36e572a48fb575806c230", "title": "A survey of machine learning and deep learning in remote sensing of geological environment: Challenges, advances, and opportunities"}, {"paperId": "240addbe5c0ba09d6858fbbe3296d6966d780a33", "title": "Flood Susceptibility Mapping Using Machine Learning Algorithms: A Case Study in Huong Khe District, Ha Tinh Province, Vietnam"}, {"paperId": "1cd5e66b9abb737b4222b6d581900f1f6fac16b3", "title": "Mapping land degradation risk due to land susceptibility to dust emission and water erosion"}, {"paperId": "acf690406318b8598dc1f3d1202b02791a933e19", "title": "Dust detection and susceptibility mapping by aiding satellite imagery time series and integration of ensemble machine learning with evolutionary algorithms."}, {"paperId": "7b59601ab481c7ab3f865f909b6584c0a5059965", "title": "Monitoring Geological Risk Areas in the City of São Paulo Based on Multi-Temporal High-Resolution 3D Models"}, {"paperId": "c3d914c22e04acbc93c8a703792777eeb1fdba86", "title": "Integration of GIS and Machine Learning Techniques for Mapping the Landslide-Prone Areas in the State of Goa, India"}, {"paperId": "61e0d089c63502f960c7900e6581bb31bef11807", "title": "Study of a Steady-State Landscape Using Remote Sensing and Topographic Analysis"}, {"paperId": "d777d0a3d14f2b0e12dcb894511336917e3da1b2", "title": "Examining the role of class imbalance handling strategies in predicting earthquake-induced landslide-prone regions"}, {"paperId": "7097d5877033d98ea5b4407bdafb1fd78b4fb37f", "title": "A Multi-Temporal Analysis of Archaeological Site Destruction using Landsat Satellite Data and Machine Learning, Moche Valley, Peru"}, {"paperId": "3b8d0f2b719c861511e391bc7da98b46d891a958", "title": "A Multi-Criteria Decision Analysis (MCDA) Approach for Landslide Susceptibility Mapping of a Part of Darjeeling District in North-East Himalaya, India"}, {"paperId": "b51eb90d395cf65c7989a5cb90936b7c2c73ae7f", "title": "Comparison of optimized data-driven models for landslide susceptibility mapping"}, {"paperId": "82ec324766d7869c99189fba57e2003e917d7f1a", "title": "Geomorphological transformations and future deformation estimations of a large potential landslide in the high-order position area of Diexi, China"}, {"paperId": "bb0063cd0a48c8bdc1e7c7ba8aa7df5f007904e3", "title": "Landslide susceptibility mapping using support vector machine for Meghalaya, India"}, {"paperId": "bb66566af012e56f76b541739f52565e390c00de", "title": "A New Approach to Spatial Landslide Susceptibility Prediction in Karst Mining Areas Based on Explainable Artificial Intelligence"}, {"paperId": "e3a5126dd88f3c66b92f412e69289f9be57f4412", "title": "Assessing probability of failure of urban landslides through rapid characterization of soil properties and vegetation distribution"}, {"paperId": "ba1b85b88d226556b783e39d39ff701521e77fb1", "title": "A Comparative Assessment of Sampling Ratios Using Artificial Neural Network (ANN) for Landslide Predictive Model in Langat River Basin, Selangor, Malaysia"}, {"paperId": "e90e7667b26f05c64b3186c05357884d39e1b8d1", "title": "Machine learning based landslide susceptibility mapping models and GB-SAR based landslide deformation monitoring systems: Growth and evolution"}, {"paperId": "01e4f67d73cc78b9c8deadba04dc73af224ac7ad", "title": "Mapping Dwellings in IDP/Refugee Settlements Using Deep Learning"}, {"paperId": "4ba1def0f5ada61d2f1b9eb5aed6e6c9c77695ac", "title": "Implementation of free and open-source semi-automatic feature engineering tool in landslide susceptibility mapping using the machine-learning algorithms RF, SVM, and XGBoost"}, {"paperId": "1640946710c2c8e947414d5bb1b26a7ed82e1d11", "title": "Multi-hazards (landslides, floods, and gully erosion) modeling and mapping using machine learning algorithms"}, {"paperId": "4f86a1f31cd93328fb2dc408abc191d1efa3b5bc", "title": "A Review of Ensemble Learning Algorithms Used in Remote Sensing Applications"}, {"paperId": "d36403ad04d06dcab73d0bb84bf5293fbb809dcb", "title": "Enhancing the Accuracy of the REPTree by Integrating the Hybrid Ensemble Meta-Classifiers for Modelling the Landslide Susceptibility of Idukki District, South-western India"}, {"paperId": "7719b48cfca60101b0691643d6e07418dbf58224", "title": "Improving performance of mass real estate valuation through application of the dataset optimization and Spatially Constrained Multivariate Clustering Analysis"}, {"paperId": "05f271ee31c043980410de97b2ba2d913cc53002", "title": "Development of multiclass alternating decision trees based models for landslide susceptibility mapping"}, {"paperId": "2c2d93ae3e946219ea4f0232ef061794f1dc7b78", "title": "Image-driven hydrological parameter coupled identification of flood plain wetland conservation and restoration sites."}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "b0c4c1e3d4c9d0f1f65afc2a637b411b3b79ca52", "title": "Landslide Susceptibility Assessment by Using Convolutional Neural Network"}, {"paperId": "c2ab0986c39b99b55e41ebd51ef47af73951d44b", "title": "Multi-hazard susceptibility mapping based on Convolutional Neural Networks"}, {"paperId": "9b2e4f7c16d3209032cf5207acf2ae793d6a87d2", "title": "Spatial analysis of environmental factors influencing dust sources in the east of Iran using a new active-learning approach"}, {"paperId": "89623dca3a2a94a5807f5487f496f0cc55974b5d", "title": "Landslide Susceptibility Mapping Using Weighted-Overlay Approach in Rangamati, Bangladesh"}, {"paperId": "81f7ace96c11a2776310c106f28a04535dc17c2b", "title": "Global sea surface salinity via the synergistic use of SMAP satellite and HYCOM data based on machine learning"}, {"paperId": "47806b0ae79798493a7e821467959bc307fb8b07", "title": "Understanding land degradation induced by gully erosion from the perspective of different geoenvironmental factors."}, {"paperId": "6ec5e9267a4a55529086394dfb21db79a0a370bc", "title": "Advanced hyperparameter optimization for improved spatial prediction of shallow landslides using extreme gradient boosting (XGBoost)"}, {"paperId": "77717fc89986540570aaa9e610336e0f1f2e2b5c", "title": "Prediction of spatial landslide susceptibility applying the novel ensembles of CNN, GLM and random forest in the Indian Himalayan region"}, {"paperId": "7e80353bf5fb96ba6914a239ba06b7d039e78fa5", "title": "Digital soil mapping and modeling in Loess‐derived soils of Iranian Loess Plateau"}, {"paperId": "ecd25389a536c952189ab6759d5ec07354f0d8c9", "title": "GIS-based landslide susceptibility zonation mapping using the analytic hierarchy process (AHP) method in parts of Kalimpong Region of Darjeeling Himalaya"}, {"paperId": "b4f43c15a074dc91f8e0cd4e25e31f724a4f43e7", "title": "A Comparative Assessment of Machine Learning Models for Landslide Susceptibility Mapping in the Rugged Terrain of Northern Pakistan"}, {"paperId": "1e0f2c1077bd047656ecc5a2dbc36e98f7396501", "title": "An attention-constrained neural network with overall cognition for landslide spatial prediction"}, {"paperId": "2c32961d902c6f8ed9814df2e593ccd861b281f5", "title": "Predictive Performances of Ensemble Machine Learning Algorithms in Landslide Susceptibility Mapping Using Random Forest, Extreme Gradient Boosting (XGBoost) and Natural Gradient Boosting (NGBoost)"}, {"paperId": "001fc18c33fe047ef386929853bc9d01255271e1", "title": "Evaluation of debris flow and landslide hazards using ensemble framework of Bayesian- and tree-based models"}, {"paperId": "193be77739bde0bf07ae6501917ed6bcf06a661f", "title": "GIS-based spatial prediction of landslide using road factors and random forest for Sichuan-Tibet Highway"}, {"paperId": "37da6fe36f4da29089d02727931358595061420c", "title": "Smart Disaster Risk Reduction and Emergency Management in the Built Environment"}, {"paperId": "94b7571534dea865634c6a5c6835d279c7c65424", "title": "Evaluating novel hybrid models based on GIS for snow avalanche susceptibility mapping: A comparative study"}, {"paperId": "f86e48d512928edd67f619147aaebb1ed321f037", "title": "Habitat potential modelling and mapping of Teucrium polium using machine learning techniques"}, {"paperId": "b53c2b080caaf8fa188bd1096b7a8354a6be6ae5", "title": "Dynamic prediction of landslide displacement using singular spectrum analysis and stack long short-term memory network"}, {"paperId": "277e98bbf96599da33de741a05e97a9893380c2e", "title": "Evaluation of the Effect of Hydroseeded Vegetation for Slope Reinforcement"}, {"paperId": "d3d292481d865f7d6d76733a2bb86eed272f2d6c", "title": "Landslide prediction based on improved principal component analysis and mixed kernel function least squares support vector regression model"}, {"paperId": "58e5d0cf6ea515d4d72c86288b9751a7f8e1b221", "title": "Application of Bayesian Hyperparameter Optimized Random Forest and XGBoost Model for Landslide Susceptibility Mapping"}, {"paperId": "5252faf9e6b13f3de030bedd2daf99f513b6fe1a", "title": "Deep Neural Network Utilizing Remote Sensing Datasets for Flood Hazard Susceptibility Mapping in Brisbane, Australia"}, {"paperId": "da61d9c65f5d47d64f4be09ed65fb576fd7f2630", "title": "Active-Learning Approaches for Landslide Mapping Using Support Vector Machines"}, {"paperId": "ad1c57489564cd9d3dc46c48942ae804c78ce7c0", "title": "Satellite DEM Improvement Using Multispectral Imagery and an Artificial Neural Network"}, {"paperId": "88a420c6b01d66bc576e8e59b21aa188d3811666", "title": "Plot-Based Classification of Macronutrient Levels in Oil Palm Trees with Landsat-8 Images and Machine Learning"}, {"paperId": "b0a728165a329e898835b8d710f8363bff905cfc", "title": "Evaluation efficiency of hybrid deep learning algorithms with neural network decision tree and boosting methods for predicting groundwater potential"}, {"paperId": "56c2fbd7eb7e19b2ef55c0bf60e59e90d4839c23", "title": "Comparison of Machine Learning Methods for Potential Active Landslide Hazards Identification with Multi-Source Data"}, {"paperId": "170975cd6135dc73be675c8d9d090edcb76013b9", "title": "Landslide susceptibility mapping using frequency ratio model: the case of Gamo highland, South Ethiopia"}, {"paperId": "4a2bf4e2c82186b0d6aba7b61389e9e90ad65de5", "title": "Deep learning and boosting framework for piping erosion susceptibility modeling: spatial evaluation of agricultural areas in the semi-arid region"}, {"paperId": "5d5ec7d62175cde1fc663858239e3c5258d7bbb8", "title": "Perceived Human-Induced Causes of Landslide in Chattogram Metropolitan Area in Bangladesh"}, {"paperId": "40b68a1eaeeca843731690aa58827410bd37a783", "title": "Uncertainties Analysis of Collapse Susceptibility Prediction Based on Remote Sensing and GIS: Influences of Different Data-Based Models and Connections between Collapses and Environmental Factors"}, {"paperId": "8680b5b570611fc0032d031ec10dc192f0a73a4c", "title": "Forest Fire Susceptibility Prediction Based on Machine Learning Models with Resampling Algorithms on Remote Sensing Data"}, {"paperId": "208e037ac3579ae2912e147fe52ea95b01f673ef", "title": "Novel Credal Decision Tree-Based Ensemble Approaches for Predicting the Landslide Susceptibility"}, {"paperId": "61f8554b307b0299f6de7ac0993ebff19877979c", "title": "Improving Spatial Agreement in Machine Learning-Based Landslide Susceptibility Mapping"}, {"paperId": "3a6a89dc9d1bb3c8a633e40fb210ac0b1aca00d4", "title": "Sensors, Features, and Machine Learning for Oil Spill Detection and Monitoring: A Review"}, {"paperId": "eba2533af2ba7deacbff7237c0898be04360d04d", "title": "Flood susceptibility modelling using advanced ensemble machine learning models"}, {"paperId": "de5cb4c2034956be9fed42918b22c9729eddd4de", "title": "Novel Ensemble Approach of Deep Learning Neural Network (DLNN) Model and Particle Swarm Optimization (PSO) Algorithm for Prediction of Gully Erosion Susceptibility"}, {"paperId": "536ecc9e84ef3f5f6d59a10a44da16f7a6510b26", "title": "Mapping land degradation risk due to wind and water erosion"}, {"paperId": "424638deef9efc73e831c028c0c0642c7fedd97f", "title": "Predictive habitat suitability models for Teucrium polium L. using boosted regression trees"}, {"paperId": "ebf7cb974c5ae1a47dac932aef21d88f2562c9e8", "title": "Improving Slope Stability Estimates by Incorporating Geophysical and Remote Sensing Monitoring Data into Hydro-Geomechanical Modeling"}, {"paperId": "2317f02ba8cd042e857004701f04587e301e5d4c", "title": "Machine learning and artificial intelligence models development in rainfall-induced landslide prediction"}, {"paperId": "1a8814ff0b7c19163789163dfa910f407e8e2666", "title": "Landslide Mapping Using Two Main Deep-Learning Convolution Neural Network Streams Combined by the Dempster–Shafer Model"}, {"paperId": "065f100a931c7204d0c7309c7f33840d0bdcb026", "title": "Flood Susceptibility Mapping of the Famnat Watershed, Gilan Province"}]}
