{"paperId": "1378ce0b112a751e9a8a1d170fa4b1e67902a5cd", "publicationVenue": {"id": "2db4308a-41c0-4b7d-b9ea-84f1019bee02", "name": "Uluslararası Yönetim Bilişim Sistemleri ve Bilgisayar Bilimleri Dergisi", "type": "journal", "alternate_names": ["Uluslar Yönet Bilişim Sist ve Bilgi Bilim Derg"], "issn": "2618-5954", "url": "http://dergipark.gov.tr/uybisbbd"}, "title": "TÜRKİYE’DE BÜYÜK VERİ İLE DEĞER YARATAN İŞLETMELER: ÖZEL SEKTÖR UYGULAMALARI ÜZERİNE BİR İNCELEME", "abstract": "Big Data (BD), which has come to the fore as one of the building blocks of digital transformation with the increase of data on a global scale, has also become an important component of the business world. The purpose of BV, which can be defined as data produced in different structures, fast and in large volumes, is to create value with verifiable/reliable data. Therefore, it is necessary to research and understand both technical and operational requirements. BD in Turkey is new to many researchers and businesses. While there are BD studies and applications in public institutions, it is mostly at the level of investments in the private sector. The purpose of this study is to provide insights on how businesses can create value with BD in the digitalization process or how they can make decision processes more efficient based on data, and provide guidance about critical developments that can contribute to increasing the productivity and performance of researchers. In the study, the data sources that cause the enterprises to have too much and rapidly produced data, the change in the way of doing business, the applications explaining the use of BD in the private sector in Turkey by literature review in order to support the applications for the added value obtained were investigated. Examples from different sectors were examined, the values created with BD and the change in the way of doing business within the scope of the applications reached were revealed. The results show that it is possible to make great benefits and make a difference in the competition with BD in terms of reducing costs, increasing productivity, developing new products/services, marketing strategies, prevention of customer loss", "venue": "Uluslararası Yönetim Bilişim Sistemleri ve Bilgisayar Bilimleri Dergisi", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-06-30", "journal": {"name": "Uluslararası Yönetim Bilişim Sistemleri ve Bilgisayar Bilimleri Dergisi"}, "authors": [{"authorId": "48435075", "name": "Ş. Yilmaz"}], "citations": []}
