{"paperId": "13880766c83e2067b1718045c2f42f2dbd7fe019", "publicationVenue": {"id": "fbbafe0e-5e14-431f-9456-f569300a37cb", "name": "IEEE Open Journal of the Communications Society", "type": "journal", "alternate_names": ["IEEE Open J Commun Soc"], "issn": "2644-125X", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782661"}, "title": "Exploring the Intersection of Consortium Blockchain Technologies and Multi-Access Edge Computing: Chronicles of a Proof of Concept Demo", "abstract": "The efficient administration of network resources in Multi-Access Edge Computing (MEC) is an active research topic these days. Task sharing, in particular, is one of the fundamental problems regarding MEC architectures although the existing literature approaches the topic mostly from the mobile user point of view. In this article, we present the chronicles of EdgeChain network, a proof of concept demo of a blockchain-based model for secure and private task sharing collaboration specially designed for edge computing servers. EdgeChain operates on a decentralized approach that counts on the blockchain services provided by the Hyperledger Fabric platform. The network offers enhanced security features that leverage the permissioned nature of Fabric, more specifically, it relies on Fabric’s membership service to validate identities and allowed behavior of participant nodes in the network. This design choice restrains external attackers from interfering with the normal operation of the task sharing scheme. The network also offers enhanced privacy features powered by a smart contract design that makes use of multiple decoupled Fabric channels with separate operation rules, ledgers, and peer-to-peer communication networks. This design choice guarantees that the computational tasks circulating in the network are only exposed to servers participating in task sharing services. The trait prevents other servers in the network to have access to private tasks and their data. The article goes through the multiple stages of the design and construction process of the proof of concept demo, from the blockchain-based task sharing framework and system model, all the way to the implementation details of the network.", "venue": "IEEE Open Journal of the Communications Society", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Open Journal of the Communications Society", "pages": "2203-2236", "volume": "3"}, "authors": [{"authorId": "2191906918", "name": "Angelo Vera-Rivera"}, {"authorId": "144158811", "name": "E. Hossain"}, {"authorId": "152885003", "name": "Ahmed Refaey Hussein"}], "citations": []}
