{"paperId": "138eea7d9f0319d4432e81c8a1e64a78a7969b9d", "publicationVenue": {"id": "294911be-9099-4a8f-9b8e-832d1916ba08", "name": "Ubiquitous Computing, Electronics & Mobile Communication Conference", "type": "conference", "alternate_names": ["UEMCON", "Ubiquitous Comput Electron  Mob Commun Conf"]}, "title": "Interference Mitigation by Intelligent Channel Selection for Device-to-Device Communications", "abstract": "Device-to-Device (D2D) communication is an efficient and interesting feature of wireless networks of the next generation. It provides extremely low latency by allowing immediate communication between nearby wireless devices without transmitting data through the network facilities. This will add advanced features to cellular networks in the 5th generation (5 G) and beyond. Empowering D2D in the mobile network creates many technical problems such as device discovery, mode selection, data security, and interference mitigation. Cognitive radio D2D users (DUs) transmission radiates through diverse ways that cause undesirable interference to primary users (PUs) or cellular users (CUs) that share the same spectrum bands, which eventually lead to serious degradation of service quality and efficiency. This article proposes an intelligent channel selection scheme depending on learning algorithms that drive the selection scheme to be intelligent for D2D Cognitive Radio Network (DCRN) aiming at mitigating interference between DUs and PUs. An extensive analysis and comparisons with other algorithms are carried out to investigate its performance. The simulation results demonstrate that the proposed algorithm improves the accuracy of channel selection, maximizes the average throughput, spectrum utilization, packet delivery, and minimizes both the average delay and interference in D2D network under various network densities and a diverse number of channels.", "venue": "Ubiquitous Computing, Electronics & Mobile Communication Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 10th Annual Ubiquitous Computing, Electronics & Mobile Communication Conference (UEMCON)", "pages": "1103-1109"}, "authors": [{"authorId": "1500418035", "name": "Anas M. Abdelhafez"}, {"authorId": "2571605", "name": "H. Elattar"}, {"authorId": "1403250572", "name": "M. Aboul-Dahab"}], "citations": [{"paperId": "0d3a6c9e5ecf3f2e73c2be232e2c8344e12f46ca", "title": "Deep Learning-Based Power Control Scheme for Perfect Fairness in Device-to-Device Communication Systems"}]}
