{"paperId": "139700d30575f11bc4fae336b43b7b16962da506", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "MCDS: AI Augmented Workflow Scheduling in Mobile Edge Cloud Computing Systems", "abstract": "Workflow scheduling is a long-studied problem in parallel and distributed computing (PDC), aiming at efficiently utilizing compute resources to meet user's service requirements. Recently proposed scheduling methods leverage the low response times of edge computing platforms to optimize application Quality of Service (QoS). However, scheduling workflow applications in mobile edge-cloud systems is challenging due to computational heterogeneity, changing latencies of mobile devices and the volatile nature of workload resource requirements. To overcome these difficulties it is important, but at the same time challenging, to develop a long-sighted optimization scheme with efficient modelling of the QoS objectives. In this work, we propose MCDS: Monte Carlo Learning using Deep Surrogate Models to efficiently schedule workflow applications in mobile edge-cloud computing systems. MCDS is an Artificial Intelligence (AI) based scheduling approach that uses a tree-based search strategy and a deep neural network based surrogate model to estimate the long-term QoS impact of immediate actions for robust optimization of scheduling decisions. Experiments on physical and simulated edge-cloud testbeds show that MCDS can improve over the state-of-the-art methods in terms of energy consumption, response time, SLA violations and cost by at least 6.13, 4.56, 45.09 and 30.71 percent respectively.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "145780334", "name": "Shreshth Tuli"}, {"authorId": "144805467", "name": "G. Casale"}, {"authorId": "144626042", "name": "N. Jennings"}], "citations": [{"paperId": "a26e04c057c56e0d1c0f71a002e1eb1c05a1bc01", "title": "Efficient algorithm for error optimization and resource prediction to mitigate cost and energy consumption in a cloud environment"}, {"paperId": "f80b78a14d28b53386e01c9973e7bb38290b20f7", "title": "Improved Chemical Reaction Optimization With Fitness-Based Quasi-Reflection Method for Scheduling in Hybrid Cloud-Fog Environment"}, {"paperId": "5e4dcc371fa030f44410552fe0d2a6a6cbba88bc", "title": "Coordinated Deep Neural Networks: A Versatile Edge Offloading Algorithm"}, {"paperId": "530641a3c5bb5fa1061f4d0c7bec1d79eb7146f1", "title": "Collaborative Virtual Storage Technology based on Mobile Cloud Computing"}, {"paperId": "4d61013014a1f24cc78b04549a1148d6141e7a9f", "title": "A Scalable Modified Deep Reinforcement Learning Algorithm for Serverless IoT Microservice Composition Infrastructure in Fog Layer"}, {"paperId": "ed10926b1ba3a7b66a007a35e02e9400554a6378", "title": "Co-evolutionary and Elite learning-based bi-objective Poor and Rich Optimization algorithm for scheduling multiple workflows in the cloud"}, {"paperId": "0ab0299bbc83ad0714a52534e695d301f3e74107", "title": "Time-Sensitive and Resource-Aware Concurrent Workflow Scheduling for Edge Computing Platforms Based on Deep Reinforcement Learning"}, {"paperId": "05dbda8ed17d8111b7bfc97606a6891278068561", "title": "Self-Detection and Comprehensive Learning-Based BRO for Cloud Workflow Scheduling Under Budget Constraints"}, {"paperId": "5d3c643d569f4c3cd1c7659b45913583d83d4d5f", "title": "Look-Ahead Task Offloading for Multi-User Mobile Augmented Reality in Edge-Cloud Computing"}, {"paperId": "8e05b1616028c7c60af72c049547960f49f919c3", "title": "BCEdge: SLO-Aware DNN Inference Services with Adaptive Batching on Edge Platforms"}, {"paperId": "b20fcdad150cb7a8b06ca227945f12cd3fb081be", "title": "GreenScale: Carbon-Aware Systems for Edge Computing"}, {"paperId": "93f5da87fd1d3d464b87bd1228c6f275d589e21e", "title": "Models and Methods of Designing Data-Centric Microservice Architectures of Digital Enterprises"}, {"paperId": "56e149922f43864747b3c1d373fb19873dcd7cd0", "title": "MPEFT: A novel task scheduling method for workflows"}, {"paperId": "b4b8286b866a17464a4133c5aa49a3737bdfa2ae", "title": "AI-based Fog and Edge Computing: A Systematic Review, Taxonomy and Future Directions"}, {"paperId": "0d6ec3ac864952a4573f0a53641a3bec09cc5e0b", "title": "When Internet of Things Meets Metaverse: Convergence of Physical and Cyber Worlds"}, {"paperId": "bac79e1374a5fef6fcccf1ea48fbac64a0600b8e", "title": "AI Augmented Edge and Fog Computing: Trends and Challenges"}, {"paperId": "edb4dbbb1a1bdf53d5914743d77b4e26fd0f3106", "title": "Optimizing the Performance of Fog Computing Environments Using AI and Co-Simulation"}, {"paperId": "63f11f28f6406b7bfbc8b83c024089b57235fc48", "title": "MetaNet: Automated Dynamic Selection of Scheduling Policies in Cloud Environments"}, {"paperId": "43f62ca66e0b4f4a6432e8ada80228ebafca3e9a", "title": "6G-enabled Edge AI for Metaverse: Challenges, Methods, and Future Research Directions"}, {"paperId": "b60e894f732e3ae92ba2efc649a53deb1db1ded5", "title": "GOSH: Task Scheduling using Deep Surrogate Models in Fog Computing Environments"}, {"paperId": "0b262a0b4952ebc490a743db36a78355ed94a427", "title": "Internet of Things"}, {"paperId": "3c0bbd7cefa0c8d628a7cab08eb7735dae73c521", "title": "A Survey of State-of-the-Art on Edge Computing: theoretical Models, Technologies, Directions, and Development Paths"}, {"paperId": "358e483e7f3be652793e420da09370d9146b0f92", "title": "Artiﬁcial Intelligence (AI) Augmented Edge and Fog Computing: Trends and Challenges"}]}
