{"paperId": "1398fd7a499fafa36432d997aab93a1d65b97fcf", "publicationVenue": null, "title": "Data‐driven fault diagnosis approaches for industrial equipment: A review", "abstract": "Undetected and unpredicted faults in heavy industrial machines/equipment can lead to unwanted failures. Therefore, prediction of faults puts paramount importance on maintaining the reliability and availability of capital‐intensive equipment. Due to large number of interconnected and interdependent mechanical and electrical components in the machines, fault analysis becomes a complex and challenging task. Under these circumstances, data‐driven fault diagnosis (DDFD) is one of the most powerful, reliable and cost‐effective artificial intelligence tools to detect, isolate, identify and classify the occurrence of faults. This article aims to make a comprehensive literature survey of various DDFD approaches used for analysing faults in industrial machines/equipment; and summarizing the strengths, limitations, and possible applications of existing fault diagnosis methods. Analysing and synthesizing 190 research works conducted on DDFD in last two decades revealed three types of DDFD approaches: supervised‐learning, semi‐supervised‐learning and unsupervised‐learning‐based fault diagnosis. The supervised‐learning is predominantly applied for fault diagnosis contributing to 82% of research works. Therefore, this article puts special emphasis on two supervised‐learning‐based approaches for fault diagnosis: (i) classification‐based artificial neural network approach, and (ii) inference‐based Bayesian network approach. Finally, these fault diagnosis approaches have been briefly discussed with effectiveness of the models and their possible inclusion in future industrial applications.", "venue": "", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2024-02-01", "journal": {"name": "Expert Systems", "volume": "41"}, "authors": [{"authorId": "29793087", "name": "A. Sahu"}, {"authorId": "2843308", "name": "S. K. Palei"}, {"authorId": "2279677199", "name": "Aishwarya Mishra"}], "citations": [{"paperId": "a6d82364b13f27eae8fb44cb987437d9aa314181", "title": "Development of a fault diagnostics and tolerance system: An application to continuous stirred tank reactor"}, {"paperId": "58bb8cbe334c7b265c94993f24021bd7727a1afe", "title": "Heat-vision based drone surveillance augmented by deep learning for critical industrial monitoring"}, {"paperId": "e18c621fe294220b0a3d3f57f7d02c7353bb3440", "title": "Recent trends and advances in machine learning challenges and applications for industry 4.0"}, {"paperId": "77db926bdd3204d5ec3716c8b19ba005756fcfc1", "title": "Dynamic Reliability Assessment Method for a Pantograph System Based on a Multistate T-S Fault Tree, Dynamic Bayesian"}, {"paperId": "a6a644eebef1978b874c5102e7e43cf5a13a605d", "title": "A Rotating Machinery Fault Diagnosis Method Based on Multi-Sensor Fusion and ECA-CNN"}]}
