{"paperId": "13b0276c2665ce6b632e25b129bd50a1ae974566", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Network Coding in Heterogeneous Multicore IoT Nodes With DAG Scheduling of Parallel Matrix Block Operations", "abstract": "Random linear network coding (RLNC) has the potential to improve the performance of current and future Internet of Things (IoT) communication systems, but is computationally demanding due to matrix multiplications and inversions. Some single-core RLNC implementations achieve already sufficient coding speeds for contemporary multimedia streaming formats. However, advances in multimedia streaming formats and IoT applications will require the exploitation of heterogeneous multicore architectures, which are becoming common for a wide range of IoT nodes, including smartphones. In this paper, we introduce and evaluate efficient RLNC computing strategies for IoT node architectures, including the emerging heterogeneous big.LITTLE multicore architectures with multiple big (fast) cores and multiple LITTLE (slow) cores. In contrast to existing RLNC implementation strategies, we build on and adapt highly optimized dense matrix operations from the high performance computing field to RLNC on heterogeneous multicore IoT nodes. Our approach includes the optimization of RLNC matrix operations through optimized operations on matrix blocks with single instruction multiple data instructions. We schedule block operations on the heterogeneous cores through a directed acyclic graph that avoids artificial synchronization points while ensuring the data dependencies. We examine priority scheduling according to the number of outgoing dependencies of a task and data locality of cached blocks. Our extensive measurements with several heterogeneous big.LITTLE multicore IoT node and smartphone processor boards demonstrate higher RLNC encoding and decoding throughputs than existing approaches. Moreover, our measurements indicate that the utilization of more cores decreases energy consumption, which is an important goal for IoT nodes.", "venue": "IEEE Internet of Things Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-11", "journal": {"name": "IEEE Internet of Things Journal", "pages": "917-933", "volume": "4"}, "authors": [{"authorId": "3137891", "name": "Simon Wunderlich"}, {"authorId": "115310207", "name": "Juan A. Cabrera"}, {"authorId": "8387960", "name": "F. Fitzek"}, {"authorId": "1740196", "name": "M. Reisslein"}], "citations": [{"paperId": "6928a205f9c3be9bb8ce1fe04c10931ca7f84c52", "title": "DeepSHARQ: hybrid error coding using deep learning"}, {"paperId": "bc6bb9c2ac44340deb5c551c8fe165dafcfd045e", "title": "Accelerating Network Coding with Programmable Switch ASICs"}, {"paperId": "fe86080eb7aeeae746fcaf608cd58cbbdcaf1164", "title": "Scalable Network Coding for Heterogeneous Devices over Embedded Fields"}, {"paperId": "11ee5764408b49f1fd951a8aec65548f79a8b975", "title": "Trust-Based Multi-Agent Imitation Learning for Green Edge Computing in Smart Cities"}, {"paperId": "484abdf989074ae39fb80a04ad6497f612c8643b", "title": "Application Layer-Forward Error Correction Raptor Q Codes in 5G Mobile Networks for Factory of the Future"}, {"paperId": "630f2a777736413c4359a919687aad432ab3f8da", "title": "Application of IoT in Healthcare: Keys to Implementation of the Sustainable Development Goals"}, {"paperId": "04a8b2c5e3950404bddd9978a845dd2c5be10958", "title": "Transmission Rate Sampling and Selection for Reliable Wireless Multicast"}, {"paperId": "14df0dcafe6d5f1a099813444afa6d64783903b5", "title": "Leveraging Machine Learning Techniques for Architecting Self-Adaptive IoT Systems"}, {"paperId": "465a5bb923283baa5b83846678912e6d90ae94ca", "title": "Data dissemination with interoperability in IoT network"}, {"paperId": "2705807d1ad411934f28ed30c1c5e26d6cebef55", "title": "Next Generation Network Coding Technique for IoT"}, {"paperId": "e8375be04fb1dff0e9d662a59cb3e3457eea1c6f", "title": "ahSpMV: An Autotuning Hybrid Computing Scheme for SpMV on the Sunway Architecture"}, {"paperId": "a10876f21bb8f596fb5c22e1ef47bb419f91831d", "title": "Reducing energy consumption of RNC based media streaming on smartphones via sampling"}, {"paperId": "4880e8e66e1ad4758bc4b3a2ee1b07b705b09515", "title": "Advanced Adaptive Decoder Using Fulcrum Network Codes"}, {"paperId": "ec3898e807512f00bf9715611704f0ac5a4cec0e", "title": "Federated Edge Computing for Disaster Management in Remote Smart Oil Fields"}, {"paperId": "10ee1c252782120e1d3e9f0603e3cffedc1c377f", "title": "Modeling a Novel Network Coding Aware Routing Protocol for Enhancement of Network Performance in Wireless Mesh Network"}, {"paperId": "e4fb13c194372597c7ffb445b368663cb670cb61", "title": "Serverless Edge Computing for Green Oil and Gas Industry"}, {"paperId": "62edf462519f494a81c383c2c6802ace421d294b", "title": "Architecture and Advanced Electronics Pathways Toward Highly Adaptive Energy- Efficient Computing"}, {"paperId": "3c3300c180f83e8fbb1f839b9d9afe716e680a75", "title": "Low-cost IoT design and implementation of a remote food and water control system for pet owners"}, {"paperId": "28e4e7d6934fb8f48fdddcb1ccfb81cc29cd018a", "title": "Services organisation in IoT: mixing Orchestration and Choreography"}, {"paperId": "8d3b6a3b8b922c1cb6f3c8e6187767621f170798", "title": "Hardware Acceleration for RLNC: A Case Study Based on the Xtensa Processor with the Tensilica Instruction-Set Extension"}, {"paperId": "5032feeb21c4f7a61087477a0eff04549b7f1031", "title": "Caterpillar RLNC With Feedback (CRLNC-FB): Reducing Delay in Selective Repeat ARQ Through Coding"}, {"paperId": "9a5ba945b062b2fa08c918ac4b80cdde2e6c2f3a", "title": "IoT based cooperative agents architecture: Lightweight applications for smart cities"}, {"paperId": "1bb6c95b7d06b7f0ce86cb7dfb95087d64e3a3bb", "title": "Internet of Things (IoT) Operating Systems Support, Networking Technologies, Applications, and Challenges: A Comparative Review"}, {"paperId": "25e53c9bc347792eb2882fc8ecd6a40c38a23f84", "title": "Ultra-Low Latency (ULL) Networks: The IEEE TSN and IETF DetNet Standards and Related 5G ULL Research"}, {"paperId": "4bf7a789a0e4c432e97131bc2e98a4052f5c5455", "title": "Ultra-Low Latency (ULL) Networks: A Comprehensive Survey Covering the IEEE TSN Standard and Related ULL Research"}, {"paperId": "048d3b23831793f7be2c78308fd456653898749a", "title": "On the Packet Decoding Delay of Linear Network Coded Wireless Broadcast Sur le délai de décodage des paquets de la diffusion sans fil codée par réseau linéaire"}, {"paperId": "d38d9046a587a9f1ad35001e06e8330d7e81d304", "title": "A push-pull network coding protocol for live peer-to-peer streaming"}, {"paperId": "6ddf765525a958b1596b4baf60e8284788e32982", "title": "Power profiling of multimedia sensor node with name-based segment streaming"}, {"paperId": "cf51b11c3ba9a6e9854a5750f0f9401c4397a8c5", "title": "Caterpillar RLNC (CRLNC): A Practical Finite Sliding Window RLNC Approach"}, {"paperId": "f8ac91255f1c4af695b52b9dfb0a31f6584a8369", "title": "PACE: Redundancy Engineering in RLNC for Low-Latency Communication"}, {"paperId": "a91eac96f282aedf0eca2385c3534bfc3fc4a205", "title": "Full-Duplex Communication in Cognitive Radio Networks: A Survey"}, {"paperId": "455e059558515d12daac407ef6e763bc2bc7c690", "title": "An Overflow Problem in Network Coding for Secure Cloud Storage"}, {"paperId": "67b7bd499484fe55e86ca8d05ea6170f617218bc", "title": "FSW: Fulcrum Sliding Window Coding for Low-Latency Communication"}, {"paperId": "d4b511ebafa0526aad1ad8b56dcee8cb4de819e3", "title": "Improving system performance in Homogeneous Multicore Systems"}, {"paperId": "0e1a8406aa41656ad6a5ab0e54970b5360c1cc3e", "title": "Intelligent networks"}, {"paperId": "a5e8c76387f15693eeaa3b5442a88f1f1c010df5", "title": "Bibliography"}, {"paperId": "e13861fb90ff383c4fb014e91f8e3d513c34fd01", "title": "SpaRec: Sparse Systematic RLNC Recoding in Multi-hop Networks"}, {"paperId": "0e3e62173c1b38693341645b89e48bff5f44db91", "title": "DSEP Fulcrum: Dynamic Sparsity and Expansion Packets for Fulcrum Network Coding"}, {"paperId": "4392a8e5d31b39c4c9a56806ceb0534a9cfba929", "title": "Study and Analysis of Matrix Operations in RLNC Using Various Computing"}, {"paperId": "ba251d056a9d8e97b0c155284f846a29af366459", "title": "Cubic Permutation Polynomials-Based Block RLNC Algorithm in Wireless Networks"}, {"paperId": "bd15df96ad56c05e020abde39f3fe4a7ce494a0a", "title": "Network coding"}, {"paperId": "f3c7addfc7afa9d4d7c7d43376c8db8b8c21367b", "title": "Progressive Multicore RLNC Decoding With Online DAG Scheduling"}, {"paperId": "25693e3d0991cc107a6cee96937a6f8caf429656", "title": "Reduction of Padding Overhead for RLNC Media Distribution With Variable Size Packets"}, {"paperId": "7153705c5c87f00a594cca4f028170f04aa21344", "title": "Small Cells in the Forthcoming 5G/IoT: Traffic Modelling and Deployment Overview"}, {"paperId": "054f16c9c99c246b0963ea8ac7893b01a29fc5a9", "title": "Fulcrum: Flexible Network Coding for Heterogeneous Devices"}, {"paperId": "8d5f189cec633d0baa0a7d211a4b3956699bb351", "title": "Robust Resource Allocation Using Edge Computing for Smart Oil Fields"}, {"paperId": "a5367ac47482dbe1b61f7c9d44ac282397987bcd", "title": "Aalborg Universitet Fulcrum Flexible Network Coding for Heterogeneous Devices"}]}
