{"paperId": "13bf028c16666868d149597d09e6e3433cb9de47", "publicationVenue": {"id": "44a8affe-ff49-4c97-915b-0e4378776101", "name": "International Journal of Emerging Technologies in Learning (iJET)", "type": "journal", "alternate_names": ["Int J Emerg Technol Learn (ijet", "International Journal of Emerging Technologies in Learning", "Int J Emerg Technol Learn", "International Journal of Emerging Technologies in Learning (ijet)"], "issn": "1863-0383", "url": "http://www.i-jet.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-jet/about", "https://www.online-journals.org/index.php/i-jet"]}, "title": "Survey of Machine Learning Techniques for Student Profile Modeling", "abstract": "Developments in information technology have led to the emergence of several online platforms for educational purposes, such as e-learning platforms, e-recommendation systems, e-recruitment system, etc. These systems exploit advances in Machine Learning to provide services tailored to the needs and profile of students. In this paper, we propose a state of art on student profile modeling using machine learning techniques during last four years. We aim to analyze the most used and most efficient machine learning techniques in both online and face-to-face education context, for different objectives such as failure, dropout, orientation, academic performance, etc. and also analyze the dominant features used for each objective in order to achieve a global view of the student profile model. Decision Tree is the most used and the most efficient by most of research studies. And academic, personal identity and online behavior are the top characteristics used for the student profile. To strengthen the survey results, an experiment was carried out, based on the application of machine learning techniques extracted from the state of art analysis, on the same datasets. Decision tree gave the highest performance, which confirms the survey results.", "venue": "International Journal of Emerging Technologies in Learning (iJET)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-26", "journal": {"name": "Int. J. Emerg. Technol. Learn.", "volume": "16"}, "authors": [{"authorId": "1395585819", "name": "Touria Hamim"}, {"authorId": "143927615", "name": "F. Benabbou"}, {"authorId": "3185259", "name": "N. Sael"}], "citations": [{"paperId": "4db6523db9356eb59294401ee1a238622217fe59", "title": "Artificial intelligence for choosing an agile method"}, {"paperId": "c6851f923120650c69530a201212fd31b8078de0", "title": "The accuracy of machine learning models relies on hyperparameter tuning: student result classification using random forest, randomized search, grid search, bayesian, genetic, and optuna algorithms"}, {"paperId": "0666c8fae663661122ee1f5666b00cccee9d3743", "title": "Convolutional Neural Network for Predicting Student\nAcademic Performance in Intelligent Tutoring System"}, {"paperId": "50e5ebc20f55d5f67bc7d2f6628720bf326546b0", "title": "PROFILING MAHASISWA DAN ALUMNI MENGGUNAKAN METODE DECISION TREE"}, {"paperId": "0fedf42656d885eae8c58881f79e5e2d1b9aa3b0", "title": "Eğitim Araştırmalarında Kritik Teknoloji Alanlarının Uygulamaları Kapsamında Yayınlanan Makalelerin Eğilimlerinin İncelenmesi: Bibliyometrik Haritalama Analizi"}, {"paperId": "1ba4caffd86d1794cd356388ccceeb2f9e04d8f6", "title": "The Model of Learning Profile “Diamond of Personality” to Develop the Learners Agency"}, {"paperId": "529ef5c136d34fd89439aa7523b77be987982ec1", "title": "A Machine Learning-based Automatic Model to Predicting Performance of Students"}, {"paperId": "3b1fe3667242a608083b116edcdaf95b63f31626", "title": "Predicting Student Outcomes in Online Courses Using Machine Learning Techniques: A Review"}, {"paperId": "5665002cfda8c459bba66ff0645d1cfdc6b3779a", "title": "Student’s Learning Profile as a Tool of Personal Learning Logistics"}, {"paperId": "1b470ebd974581c0626f62a7548ca46a78317777", "title": "A Hybrid Machine Learning Framework for Predicting Students' Performance in Virtual Learning Environment"}]}
