{"paperId": "13bf410a450a5520ddae9fb210b5ae4ecaa81fae", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "The use of data analytics technique in learning management system to develop fashion design skills and technology acceptance", "abstract": "ABSTRACT Data analytics technique in education provides unparalleled opportunities in the era of e-learning platforms to support students. In this context, learning management system (LMS) as a platform allows recording the learner's activity recorded in order to explore data unique types coming from the academic context in order to improve the learning experience. Therefore, this research aims to reveal the impact of using data analytics technique in LMS to develop the fashion design skills and technology acceptance. The research was applied to students at Home Economics Department who were randomly divided into two equal experimental groups. An extended Technology Acceptance Model (TAM) and a developed product evaluation card were utilized as main research instruments. The empirical findings showed that data analytics technique in LMS had significant and positive influence on the enhancement of students' fashion design skills in the functional, esthetic and creative aspects. Findings also revealed robust supporting evidence for the suggested research model as data analytics technique had a major positive direct impact on the perceived usefulness and perceived ease of use of LMS. In addition, it had positive indirect impact on students' attitude and their behavioral intention to use LMS, that mediated by perceived usefulness of LMS.", "venue": "Interactive Learning Environments", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-24", "journal": {"name": "Interactive Learning Environments", "pages": "3810 - 3827", "volume": "31"}, "authors": [{"authorId": "30774329", "name": "Abdellah Ibrahim Mohammed Elfeky"}, {"authorId": "74489525", "name": "Marwa Yasien Helmy Elbyaly"}], "citations": [{"paperId": "73350fc5f47c999913fb3b2823cfdbed97dc85c4", "title": "The impact of advance organizers in virtual classrooms on the development of integrated science process skills"}, {"paperId": "402f055ce5816cccec05ed8fa0475d9234c8427a", "title": "Exploring technology acceptance patterns of users of the mixed-reality sport technology Zwift: antecedents and consequences of technology acceptance"}, {"paperId": "c68485624fba2a4eab274857822c6abede7c0749", "title": "The adoption and use of learning analytics tools to improve decision making in higher learning institutions: An extension of technology acceptance model"}, {"paperId": "1a6d544b2c9a5b11c1e6213f793f71a37a28434c", "title": "Are creative users more apt in reusing and adopting Open Government Data (OGD)? Gender differences"}, {"paperId": "33d6f49f2b4a2cea2d91fe6d2c328bdba76746c1", "title": "The effect of big data technologies usage on social competence"}, {"paperId": "7ebfaaf79cbc3a6c9577a1b44af6f17843524f57", "title": "Utilizing AI and Data Analytics to Track Patterns and Attitudes of PUV Drivers on the Streets"}, {"paperId": "8ea22ecc224e179811f8b11146e3f79bc914ea41", "title": "Students’ performance in interactive environments: an intelligent model"}, {"paperId": "d70c4f1a399691f3e2d7c1fc9a9ecd8c8a301d42", "title": "Role of Technology in Fashion Designing Skills: An Exploratory Study in the Context of New Technology"}, {"paperId": "29343fc9aabe94ec2012def70a0b2338df0c01c0", "title": "Data Analytics and Reporting API - A Reliable Tool for Data Visualization and Predictive Analysis"}, {"paperId": "4ab1b04dd1925e96037330ea88f72a56f7c005e9", "title": "Understanding key drivers affecting students’ use of artificial intelligence-based voice assistants"}, {"paperId": "4f859b59e83b978bd8923b708ea16c2903231cb2", "title": "THE HUMAN SELF IN ITS ANIMAL SCENES BETWEEN IBN SINA AND IBN AL-QAYYIM"}]}
