{"paperId": "13cc4f15ce289dc30c9af6bcac502cc1aa3599bd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "FPGA Technology Mapping Using Sketch-Guided Program Synthesis", "abstract": "FPGA technology mapping is the process of implementing a hardware design expressed in high-level HDL (hardware design language) code using the low-level, architecture-specific primitives of the target FPGA. As FPGAs become increasingly heterogeneous, achieving high performance requires hardware synthesis tools that better support mapping to complex, highly configurable primitives like digital signal processors (DSPs). Current tools support DSP mapping via handwritten special-case mapping rules, which are laborious to write, error-prone, and often overlook mapping opportunities. We introduce Lakeroad, a principled approach to technology mapping via sketch-guided program synthesis. Lakeroad leverages two techniques -- architecture-independent sketch templates and semantics extraction from HDL -- to provide extensible technology mapping with stronger correctness guarantees and higher coverage of mapping opportunities than state-of-the-art tools. Across representative microbenchmarks, Lakeroad produces 2--3.5$\\times$ the number of optimal mappings compared to proprietary state-of-the-art tools and 6--44$\\times$ the number of optimal mappings compared to popular open-source tools, while also providing correctness guarantees not given by any other tool.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-29", "journal": {"name": "ArXiv", "volume": "abs/2401.16526"}, "authors": [{"authorId": "40949637", "name": "Gus Henry Smith"}, {"authorId": "133709864", "name": "Benjamin Kushigian"}, {"authorId": "2156794834", "name": "Vishal Canumalla"}, {"authorId": "2217309177", "name": "Andrew Cheung"}, {"authorId": "24650215", "name": "Steven Lyubomirsky"}, {"authorId": "51127113", "name": "Sorawee Porncharoenwase"}, {"authorId": "2281823722", "name": "Ren'e Just"}, {"authorId": "2281823111", "name": "Gilbert Louis Bernstein"}, {"authorId": "2272813", "name": "Zachary Tatlock"}], "citations": []}
