{"paperId": "13cf48695d23f7e019d670a1bf059b7f28396992", "publicationVenue": null, "title": "Metamorphic testing of Datalog engines", "abstract": "Datalog is a popular query language with applications in several domains. Like any complex piece of software, Datalog engines may contain bugs. The most critical ones manifest as incorrect results when evaluating queries—we refer to these as query bugs. Given the wide applicability of the language, query bugs may have detrimental consequences, for instance, by compromising the soundness of a program analysis that is implemented and formalized in Datalog. In this paper, we present the first metamorphic-testing approach for detecting query bugs in Datalog engines. We ran our tool on three mature engines and found 13 previously unknown query bugs, some of which are deep and revealed critical semantic issues.", "venue": "ESEC/SIGSOFT FSE", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-08-18", "journal": {"name": "Proceedings of the 29th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "153739620", "name": "Muhammad Numair Mansur"}, {"authorId": "2606785", "name": "M. Christakis"}, {"authorId": "2021178", "name": "Valentin Wüstholz"}], "citations": [{"paperId": "39d62047c57106cd64054859986dde374ccdfa7a", "title": "Understanding and Detecting Annotation-Induced Faults of Static Analyzers"}, {"paperId": "428d0ae6be2e3e5146c2ca166fc7e64848929297", "title": "Finding Cross-rule Optimization Bugs in Datalog Engines"}, {"paperId": "321f669f888e43e8f44390985a5da2d3fabe8a7e", "title": "Detecting Logic Bugs in Graph Database Management Systems via Injective and Surjective Graph Query Transformation"}, {"paperId": "9a68e0b4dbc81d8ee1d24c367f555623758cec00", "title": "Fuzz4All: Universal Fuzzing with Large Language Models"}, {"paperId": "df170dd0f26ec903ee0a8d0ad89305ec60a125c5", "title": "Dependency-Aware Metamorphic Testing of Datalog Engines"}, {"paperId": "c115eb5add622be245ac1216b30dbb25af45c7ae", "title": "Detecting State Inconsistency Bugs in DApps via On-Chain Transaction Replay and Fuzzing"}, {"paperId": "5ea70f3bbe6a709ef9fbdcb76a4de4f514c6825c", "title": "Automated engineering of domain-specific metamorphic testing environments"}, {"paperId": "643e9ab593b1d5d9d6203e629fb3ebe218b5ee82", "title": "Metamorphic testing of Advanced Driver-Assistance System (ADAS) simulation platforms: Lane Keeping Assist System (LKAS) case studies"}, {"paperId": "03e3b6b0178cca431735a4012bc940d1d3a44aef", "title": "Assessing the Impact of Execution Environment on Observation-Based Slicing"}, {"paperId": "e67a2817089312746d69b38ce9abfdc4b1bc69c3", "title": "Finding bugs in Gremlin-based graph database systems via Randomized differential testing"}, {"paperId": "71dd291b4be0d074982f521ff654468755084a76", "title": "GDsmith: Detecting Bugs in Graph Database Engines"}, {"paperId": "0b6b331474c47c08d46f0ed0f9551f7d2c7cf4b6", "title": "Automated testing of image captioning systems"}, {"paperId": "cf33f5402ac949243119f455a2c424eb7d09d0bd", "title": "On the effectiveness of testing sentiment analysis systems with metamorphic testing"}, {"paperId": "7041f1f02e871d627dbe412f584b98c5054f6ce8", "title": "Feedback-Directed Metamorphic Testing"}, {"paperId": "5c47e23ec4d2d8c6641ce7671b2054a5fff1911f", "title": "Finding Bugs in Gremlin-Based Graph Database Systems via Randomized Differential Testing Graph database systems, differential testing, Gremlin"}]}
