{"paperId": "13d38e22daa7e1b0844e785c4e51dd1789cadc14", "publicationVenue": {"id": "73e316c6-3e72-4c26-82ab-47e8da044b15", "name": "Symposium on Field Programmable Gate Arrays", "type": "conference", "alternate_names": ["Field Program Gate Array", "Symp Field Program Gate Array", "Field Programmable Gate Arrays", "FPGA"], "url": "http://www.wikicfp.com/cfp/program?id=1082"}, "title": "ThunderGP: HLS-based Graph Processing Framework on FPGAs", "abstract": "FPGA has been an emerging computing infrastructure in datacenters benefiting from features of fine-grained parallelism, energy efficiency, and reconfigurability. Meanwhile, graph processing has attracted tremendous interest in data analytics, and its performance is in increasing demand with the rapid growth of data. Many works have been proposed to tackle the challenges of designing efficient FPGA-based accelerators for graph processing. However, the largely overlooked programmability still requires hardware design expertise and sizable development efforts from developers. In order to close the gap, we propose ThunderGP, an open-source HLS-based graph processing framework on FPGAs, with which developers could enjoy the performance of FPGA-accelerated graph processing by writing only a few high-level functions with no knowledge of the hardware. ThunderGP adopts the Gather-Apply-Scatter (GAS) model as the abstraction of various graph algorithms and realizes the model by a build-in highly-paralleled and memory-efficient accelerator template. With high-level functions as inputs, ThunderGP automatically explores the massive resources and memory bandwidth of multiple Super Logic Regions (SLRs) on FPGAs to generate accelerator and then deploys the accelerator and schedules tasks for the accelerator. We evaluate ThunderGP with seven common graph applications. The results show that accelerators on real hardware platforms deliver 2.9 times speedup over the state-of-the-art approach, running at 250MHz and achieving throughput up to 6,400 MTEPS (Million Traversed Edges Per Second). We also conduct a case study with ThunderGP, which delivers up to 419 times speedup over the CPU-based design and requires significantly reduced development efforts. This work is open-sourced on Github at https://github.com/Xtra-Computing/ThunderGP.", "venue": "Symposium on Field Programmable Gate Arrays", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-02-17", "journal": {"name": "The 2021 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays"}, "authors": [{"authorId": "2109081099", "name": "Xinyu Chen"}, {"authorId": "1703011692", "name": "Hongshi Tan"}, {"authorId": "2118360318", "name": "Yao Chen"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "3339059", "name": "W. Wong"}, {"authorId": "1713644", "name": "Deming Chen"}], "citations": [{"paperId": "184d429e601a7029f1fe7c29f4f9fe54eed57ad5", "title": "Optimisation and Evaluation of Breadth First Search with oneAPI/SYCL on Intel FPGAs: from Describing Algorithms to Describing Architectures"}, {"paperId": "1825383eac29d7ce7ffd034c34ffc4c5f3e6b88f", "title": "HLPerf: Demystifying the Performance of HLS-based Graph Neural Networks with Dataflow Architectures"}, {"paperId": "791c163c340c8ccdf69c0570838e6a9f16858927", "title": "HiSpMV: Hybrid Row Distribution and Vector Buffering for Imbalanced SpMV Acceleration on FPGAs"}, {"paperId": "771b486e3babc5ccd2e11ed32c5764ee8cda7d0f", "title": "GraFlex: Flexible Graph Processing on FPGAs through Customized Scalable Interconnection Network"}, {"paperId": "ebc8e41e14b01203650ccd6d9418b6e53c35aff8", "title": "Toward Energy Efficient STT-MRAM-based Near Memory Computing Architecture for Embedded Systems"}, {"paperId": "23174000ec7930f2e8390ab3ead94862d1cf1b18", "title": "DONGLE 2.0: Direct FPGA-Orchestrated NVMe Storage for HLS"}, {"paperId": "2d082860ad89c450584010ad0312d8dc60205c1c", "title": "An adaptive graph sampling framework for graph analytics"}, {"paperId": "2e0dd10092f97567a74b9fafdd5df04412c4bd56", "title": "Efficient FPGA-Based Sparse Matrix–Vector Multiplication With Data Reuse-Aware Compression"}, {"paperId": "ddc3c4db1c736c98138407da95927309cacee40f", "title": "A Software-Hardware Co-Optimized Toolkit for Deep Reinforcement Learning on Heterogeneous Platforms"}, {"paperId": "9be2068491f7138b7dee34f16db828e780cdf8a0", "title": "HF-LDPC: HLS-friendly QC-LDPC FPGA Decoder with High Throughput and Flexibility"}, {"paperId": "dde663ddf808bac1eb082d7e8422c10c4f162ed2", "title": "SSDe: FPGA-Based SSD Express Emulation Framework"}, {"paperId": "4f5335ac5c9f1251f25e407415223e76e7c20894", "title": "Dynamic Partitioning Method for Near-Memory Parallel Processing of Sparse Matrix-Vector Multiplication"}, {"paperId": "d1dd5b7b1132da752c7cf0b11a06f7bc1d8a5065", "title": "SwiftSpatial: Spatial Joins on Modern Hardware"}, {"paperId": "fcf19209e7778105a84d306c90aed6dd6a1757d6", "title": "GraphScale: Scalable Processing on FPGAs for HBM and Large Graphs"}, {"paperId": "ad8ee8ea6bd57d98c32c5d41943393c57256545e", "title": "Accelerating SpMV on FPGAs Through Block-Row Compress: A Task-Based Approach"}, {"paperId": "bcb1eeb0752d81c82f3aafd6dc2b8e94d0052fed", "title": "BitColor: Accelerating Large-Scale Graph Coloring on FPGA with Parallel Bit-Wise Engines"}, {"paperId": "94e3bc7762f52ad0b125847abb44991877069a4e", "title": "PH-CF: A Phased Hybrid Algorithm for Accelerating Subgraph Matching Based on CPU-FPGA Heterogeneous Platform"}, {"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "d518dfe3eb6e31bc5cc86963ce89d77829753f47", "title": "RapidStream 2.0: Automated Parallel Implementation of Latency–Insensitive FPGA Designs Through Partial Reconfiguration"}, {"paperId": "35f4fb2bbaa1139c077fcdaff76de945297bb47a", "title": "LightRW: FPGA Accelerated Graph Dynamic Random Walks"}, {"paperId": "0165cf24953cfae9337c8659d9d24968b60edf12", "title": "GNNBuilder: An Automated Framework for Generic Graph Neural Network Accelerator Generation, Simulation, and Optimization"}, {"paperId": "bf444fe86d19caa42a5e93b4a5199bd3effca39d", "title": "Vidi: Record Replay for Reconfigurable Hardware"}, {"paperId": "e55aeb6f2dc0c9d665944c102008e6385c535dee", "title": "AutoScaleDSE: A Scalable Design Space Exploration Engine for High-Level Synthesis"}, {"paperId": "dfddc6943706ff367ae9c9536b70e6da3f2a318a", "title": "ACTS: A Near-Memory FPGA Graph Processing Framework"}, {"paperId": "ec155fa63bc5779ca5a8ea3996d7d95d711f3d72", "title": "DONGLE: Direct FPGA-Orchestrated NVMe Storage for HLS"}, {"paperId": "58dec77293c834d5c8ab6a1a4fadf2f4f62b5030", "title": "HDLRuby: A Ruby Extension for Hardware Description and its Translation to Synthesizable Verilog HDL"}, {"paperId": "8ec4ed52eaadf72ea01c50b77b165d029dbeb001", "title": "FPGA sharing in the cloud: a comprehensive analysis"}, {"paperId": "7c0cb5170e6f5c62ade718f30ec990a6717b2c27", "title": "TLP-LDPC: Three-Level Parallel FPGA Architecture for Fast Prototyping of LDPC Decoder Using High-Level Synthesis"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "75aa3317a7be7d66ab2562924565c9aeab27509d", "title": "Graph_CC: Accelerator of Connected Component Search in Graph Computing"}, {"paperId": "55947cebf2a0463db034a1f4dcfaa98297e6e118", "title": "Design of Software-Hardware Collaborative Graph Computing Accelerator Based on RISC-V"}, {"paperId": "3d20660aee036dac7ed46a78e838d1b8ccf15cb3", "title": "FPGA Acceleration of Probabilistic Sentential Decision Diagrams with High-level Synthesis"}, {"paperId": "105352aa26973006ccd5417e0cf65f07256b46ec", "title": "Analysis of Graph Processing in Reconfigurable Devices for Edge Computing Applications"}, {"paperId": "f071772d67f3c6c8cf424666f5653177f538946a", "title": "SDMA: An Efficient and Flexible Sparse-Dense Matrix-Multiplication Architecture for GNNs"}, {"paperId": "4c5ade2bc12db4aa6b83f9cbfc134c9772fe9731", "title": "GraphScale: Scalable Bandwidth-Efficient Graph Processing on FPGAs"}, {"paperId": "1de8e605b7f1ba72e1e23ea7acc436aad495abff", "title": "Gearbox: a case for supporting accumulation dispatching and hybrid partitioning in PIM-based accelerators"}, {"paperId": "8d9b1bf8bad5fabb11a37e126706fec4371ef7b8", "title": "FlowGNN: A Dataflow Architecture for Real-Time Workload-Agnostic Graph Neural Network Inference"}, {"paperId": "34d861c3786c85f848da57e9679b26eaa14ed881", "title": "FPGA HLS Today: Successes, Challenges, and Opportunities"}, {"paperId": "282951a90e76a7f5066f452632e568df7c5cb38d", "title": "GX-Plug: a Middleware for Plugging Accelerators to Distributed Graph Processing"}, {"paperId": "62b0eeb59158a59c564c41d1ee3d3d0c384d541c", "title": "GraphWave: A Highly-Parallel Compute-at-Memory Graph Processing Accelerator"}, {"paperId": "0de2f7c29a53ae19f5a6bc6b8a898fc770cb6e8f", "title": "ReGraph: Scaling Graph Processing on HBM-enabled FPGAs with Heterogeneous Pipelines"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "df64f7083338d4ad85d204a49f931ba50d9cabc6", "title": "Debugging in the brave new world of reconfigurable hardware"}, {"paperId": "b8be066b41179472c0bff1388b2fc92e338117d0", "title": "High-Performance Sparse Linear Algebra on HBM-Equipped FPGAs Using HLS: A Case Study on SpMV"}, {"paperId": "23766cdf2e4551f80b518322c25073bab0353f44", "title": "RapidStream: Parallel Physical Implementation of FPGA HLS Designs"}, {"paperId": "47a0e5361cb0dd864afec0c5438cb52cf3add726", "title": "The Future of FPGA Acceleration in Datacenters and the Cloud"}, {"paperId": "72752b88498d3469d73d2e37d3e8c479b501bdaf", "title": "A Soft Coprocessor Approach for Developing Image and Video Processing Applications on FPGAs"}, {"paperId": "0d02890defb6b5bd0d6aa63519bdfadd98e09c3b", "title": "Accelerating SSSP for Power-Law Graphs"}, {"paperId": "9a374c2aa04d0428a3bc8d6e8526a9c19ed7e44e", "title": "The Serverless Computing Survey: A Technical Primer for Design Architecture"}, {"paperId": "3bec8b4017541b9be679eb75836de9c713968e22", "title": "HP-GNN: Generating High Throughput GNN Training Implementation on CPU-FPGA Heterogeneous Platform"}, {"paperId": "c76142d04ba5da3e4470e08ef9ddb54b8f56f89c", "title": "Serpens: a high bandwidth memory based accelerator for general-purpose sparse matrix-vector multiplication"}, {"paperId": "1872ba071a8dd41ad7114770be03306e52e8c8d5", "title": "GraphLily: Accelerating Graph Linear Algebra on HBM-Equipped FPGAs"}, {"paperId": "394a3b11dbee1d5ce04e2f3e7f6cdd4ef81e38b1", "title": "Skew-Oblivious Data Routing for Data Intensive Applications on FPGAs with HLS"}, {"paperId": "55a065fb46a62a61e6c0bf47886f72b911538011", "title": "Building Beyond HLS: Graph Analysis and Others"}, {"paperId": "cbcd6312f4bbaa32635ef92a62b453a005011878", "title": "Demystifying memory access patterns of FPGA-based graph processing accelerators"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "e1584c7c593c5656e1e918fddca13f5a6d0672c8", "title": "FlowGNN: A Dataflow Architecture for Universal Graph Neural Network Inference via Multi-Queue Streaming"}]}
