{"paperId": "13d5ce649ab7edd4bc78a743953aa6a433800fd0", "publicationVenue": null, "title": "Is Digitalization Worth the Hassle? Two cases of Innovation Building Operation and Maintenance", "abstract": "The spectrum of innovation in the Architecture-Engineering-Construction-Operation (AECO) industry is called PropTech (abbreviation for Property-Technology). PropTech uses digital technologies to improve the products and processes of the construction and real estate industry over the whole building life cycle. However, PropTech applications are not extensively adopted yet, as many established companies are still doubtful about the added value of a digital transition, which encompasses significant investments. This reluctancy might be due to a lack of evidence about the benefits of technology adoption. Therefore, the present study aims to outline the advantages of adopting digital technology in building management by analysing two case studies that can be considered good practices of an effective investment made possible by PropTech. Netix Controls developed a centralized system based on Machine Learning (ML), to collect and integrate data from different manufacturer chillers, fire alarms, and lighting systems, and applied it to two separate networks of 77 and 14 buildings, respectively, which correspond to the two cases under analysis in this paper. Through desktop data and interviews the study analyses economic costs, environmental impact, and users’ well-being of the two cases and compares them ideally to a fictional case, which does not include ML but only traditional Facility Management (FM) procedures. In conclusion, the advantages of embracing innovation in FM through digital technologies are outlined. In particular, the potential will be discussed of predictive maintenance, and the prospective implications of real-time building management expanded at district and city scale.", "venue": "IOP Conference Series: Earth and Environment", "year": 2023, "fieldsOfStudy": ["Physics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "1176"}, "authors": [{"authorId": "2091321255", "name": "A. Pomè"}, {"authorId": "113827582", "name": "C. Tagliaro"}, {"authorId": "145531974", "name": "A. Celani"}, {"authorId": "2084086083", "name": "G. Ciaramella"}], "citations": []}
