{"paperId": "13d68f75d936e5b37912bd15a160a68a2f2bb3fc", "publicationVenue": null, "title": "Resource-Cost-Aware Fault-Tolerant Design Methodology for End-to-End Functional Safety Computation on Automotive Cyber-Physical Systems", "abstract": "Automotive functional safety standard ISO 26262 aims to avoid unreasonable risks due to systematic failures and random hardware failures caused by malfunctioning behavior. Automotive functions involve distributed end-to-end computation in automotive cyber-physical systems (ACPSs). The automotive industry is highly cost-sensitive to the mass market. This study presents a resource-cost-aware fault-tolerant design methodology for end-to-end functional safety computation on ACPSs. The proposed design methodology involves early functional safety requirement verification and late resource cost design optimization. We first propose the functional safety requirement verification (FSRV) method to verify the functional safety requirement consisting of reliability and response time requirements of the distributed automotive function during the early design phase. We then propose the resource-cost-aware fault-tolerant optimization (RCFO) method to reduce the resource cost while satisfying the functional safety requirement of the function during the late design phase. Finally, we perform experiments with real-life automotive and synthetic automotive functions. Findings reveal that the proposed RCFO and VFSR methods demonstrate satisfactory resource cost reduction compared with other methods while satisfying the functional safety requirement.", "venue": "ACM Trans. Cyber Phys. Syst.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-05", "journal": {"name": "ACM Transactions on Cyber-Physical Systems", "pages": "1 - 27", "volume": "3"}, "authors": [{"authorId": "3324180", "name": "Guoqi Xie"}, {"authorId": "39159696", "name": "Gang Zeng"}, {"authorId": "144909532", "name": "Ji-yao An"}, {"authorId": "1700626", "name": "Renfa Li"}, {"authorId": "2181606", "name": "Keqin Li"}], "citations": [{"paperId": "7f31586de09bccf00293c5846036071b0d037f37", "title": "Hybrid Modular Redundancy: Exploring Modular Redundancy Approaches in RISC-V Multi-Core Computing Clusters for Reliable Processing in Space"}, {"paperId": "50d287518b21461b36f6341fecbcc6d0ed1ae0b3", "title": "An Open-Source Wireless Sensor Node Platform with Active Node-Level Reliability for Monitoring Applications"}, {"paperId": "51fd8a99213d1338aece597f43d13bbf981d2ab0", "title": "Minimizing Resource Consumption Cost of DAG Applications With Reliability Requirement on Heterogeneous Processor Systems"}, {"paperId": "a960d68779d4a32c08b1bd58fd9fbc084a24dd32", "title": "Cost-aware reliability task scheduling of automotive cyber-physical systems"}, {"paperId": "786a8c501a3cbe58774c6e898789328871c3a30f", "title": "Human-Interaction-aware Adaptive Functional Safety Processing for Multi-Functional Automotive Cyber-Physical Systems"}]}
