{"paperId": "13de2f6f59c34428fd71878ef09e99473aba14fb", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "ET2FA: A Hybrid Heuristic Algorithm for Deadline-Constrained Workflow Scheduling in Cloud", "abstract": "Cloud computing is an emerging computational infrastructure for cost-efficient workflow execution that provides flexible and dynamically scalable computing resources at pay-as-you-go pricing. Workflow scheduling, as a typical NP-Complete problem, is one of the major issues in cloud computing. However, in the cloud scenario with unlimited resources, how to generate an efficient and economical workflow scheduling scheme under the deadline constraint is still an extraordinary challenge. In this article, we propose a hybrid heuristic algorithm called enhanced task type first algorithm (ET2FA) to solve deadline-constrained workflow scheduling in cloud with new features such as hibernation and per-second billing. The objectives to be minimized include the total cost and total idle rate. ET2FA involves three phases: 1) Task type first algorithm, which schedules tasks based on topological level and task types, and utilizes a compact-scheduling-condition based VM selection method to assign each task. 2) Delay operation based on block structure, which further optimizes total cost and total idle rate based on block structure properties. 3) Instance hibernate scheduling heuristic, which sets an instance to hibernate if idle for a duration. Extensive simulation experiments based on seven well-known real-world workflow applications show that ET2FA delivers better performance in comparison to the state-of-the-art algorithms.", "venue": "IEEE Transactions on Services Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "1807-1821", "volume": "16"}, "authors": [{"authorId": "2140047505", "name": "Zaixing Sun"}, {"authorId": "2141935665", "name": "Boyu Zhang"}, {"authorId": "3298915", "name": "Chonglin Gu"}, {"authorId": "38984070", "name": "Ruitao Xie"}, {"authorId": "48427396", "name": "Bin Qian"}, {"authorId": "1738076", "name": "Hejiao Huang"}], "citations": [{"paperId": "97d461b04e1fabe210877876115b4c3cfdeabf24", "title": "A DQN-based memetic algorithm for energy-efficient job shop scheduling problem with integrated limited AGVs"}, {"paperId": "91cb6d5817edb02d49bba0ac68c316318a65f88f", "title": "EneX: An Energy-Aware Execution Scheduler for Serverless Computing"}, {"paperId": "04bb17846263692808d261f45fb28d719d38cbf2", "title": "A bidirectional workflow scheduling approach with feedback mechanism in clouds"}, {"paperId": "7d62beafa68819499e764c1f26d2c6863587415a", "title": "A chameleon and remora search optimization algorithm for handling task scheduling uncertainty problem in cloud computing"}, {"paperId": "707c6a09ec44a327fa7ba84cd6b5a03886fe4933", "title": "A Two-Stage Estimation of Distribution Algorithm With Heuristics for Energy-Aware Cloud Workflow Scheduling"}, {"paperId": "dd093e8f7ee820a56cc8bf5a73b549903121c94d", "title": "A Min-Max Workload Scheduling Technique Using Soft-Computing Approach in Multi-Cloud Platform"}, {"paperId": "ad3ee03a7ac75f50644956345f4cf6a3405a1f93", "title": "Efficient, economical and energy-saving multi-workflow scheduling in hybrid cloud"}, {"paperId": "991f186869aff0e30f2fab7197c37392b514d6d5", "title": "Uncertainty‐aware scheduling of real‐time workflows under deadline constraints on multi‐cloud systems"}, {"paperId": "47fbb6ec0d613fcd7471e9bffaffe0ec32e827fd", "title": "Experimental performance analysis of cloud resource allocation framework using spider monkey optimization algorithm"}]}
