{"paperId": "13e532987ef9ce27671407c7368503cba9319cf7", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Survey of Graph Neural Networks and Applications", "abstract": "The advance of deep learning has shown great potential in applications (speech, image, and video classification). In these applications, deep learning models are trained by datasets in Euclidean space with fixed dimensions and sequences. Nonetheless, the rapidly increasing demands on analyzing datasets in non-Euclidean space require additional research. Generally speaking, finding the relationships of elements in datasets and representing such relationships as weighted graphs consisting of vertices and edges is a viable way of analyzing datasets in non-Euclidean space. However, analyzing the weighted graph-based dataset is a challenging problem in existing deep learning models. To address this issue, graph neural networks (GNNs) leverage spectral and spatial strategies to extend and implement convolution operations in non-Euclidean space. Based on graph theory, a number of enhanced GNNs are proposed to deal with non-Euclidean datasets. In this study, we first review the artificial neural networks and GNNs. We then present ways to extend deep learning models to deal with datasets in non-Euclidean space and introduce the GNN-based approaches based on spectral and spatial strategies. Furthermore, we discuss some typical Internet of Things (IoT) applications that employ spectral and spatial convolution strategies, followed by the limitations of GNNs in the current stage.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-28", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "72900649", "name": "Fan Liang"}, {"authorId": "2055414574", "name": "Cheng Qian"}, {"authorId": "144323104", "name": "Wei Yu"}, {"authorId": "145990023", "name": "D. Griffith"}, {"authorId": "1755171", "name": "N. Golmie"}], "citations": [{"paperId": "5576dbc5de8d2d782c3ea5e74a3e941613b56467", "title": "Multi-Wind Turbine Wind Speed Prediction Based on Weighted Diffusion Graph Convolution and Gated Attention Network"}, {"paperId": "c489f7ed73c32ab6757038f3ea81d666e5e13b75", "title": "Artificial Intelligence-Based Algorithms in Medical Image Scan Segmentation and Intelligent Visual Content Generation—A Concise Overview"}, {"paperId": "cb9114e37494c9579fac3863dd2410d322d5be2f", "title": "Open Radio Access Networks for Smart IoT Systems: State of Art and Future Directions"}, {"paperId": "64d2f8ab93cfcf86bbab18e560e64d67e3531f99", "title": "A Study on the Fault Location of Secondary Equipment in Smart Substation Based on the Graph Attention Network"}, {"paperId": "7f3175da753b298918f081d2e9a52235f0193fd3", "title": "Towards facing uncertainties in biofuel supply chain networks: a systematic literature review"}, {"paperId": "93c8d49f10cd10611e49e7f3493806a44a5980dc", "title": "A Spatial-Temporal Graph Convolutional Recurrent Network for Transportation Flow Estimation"}, {"paperId": "c3e86ec15f3fbcbeda23662fc227a992540cd304", "title": "Dynamic End-to-End Information Cascade Prediction Based on Neural Networks and Snapshot Capture"}, {"paperId": "1268bf8bbba86570d7ed9ad882d780dedbb1710c", "title": "Graph Neural Network for spatiotemporal data: methods and applications"}, {"paperId": "03b99f9f4230b48a550059c0b2ae1ec5a69db489", "title": "Deep Neural Networks for Spatial-Temporal Cyber-Physical Systems: A Survey"}, {"paperId": "9bd2e0fc988f8978452ca9952437e01ef96dd949", "title": "Named Data Networking (NDN) for Data Collection of Digital Twins-based IoT Systems"}, {"paperId": "ad2625beeff8dda28c484cd0fa79802772264d2e", "title": "Link prediction for heterogeneous information networks based on enhanced meta-path aggregation and attention mechanism"}, {"paperId": "c8f9e066c41faed77790a78c0d69c3104c9c8822", "title": "Survey on Multi-Task Learning in Smart Transportation"}, {"paperId": "45195fff16a656bc9e1aa69151b234d3a4745b1e", "title": "Graph Convolutional Networks for Semi-Supervised Image Segmentation"}]}
