{"paperId": "13e7a58dc125a2018255922828480ee8ba4d64cd", "publicationVenue": {"id": "be2a4ccf-75ad-4bdb-90ce-7ee154ac4b9c", "name": "Clinical Kidney Journal", "type": "journal", "alternate_names": ["Ndt Plus", "Clin Kidney J"], "issn": "2048-8505"}, "title": "Deep learning to classify arteriovenous access aneurysms in hemodialysis patients", "abstract": "Vascular access aneurysms are common in hemodialysis patients with arteriovenous (AV) fistulas and grafts. Reported in-cidences of aneurysms range from 5% to > 60% [1]. While of-ten without significant clinical sequela,patients may experience complications such as an inability to dialyze owing to rupture risk and—in rare cases—rupture without warning and with po-tentially catastrophic, life- and limb-threatening consequences [1–4]. We developed a novel approach to monitoring of AV aneurysms that builds on the analysis of digital AV access images by a cloud-based deep learning system [5]. We used tablets to take digital images of AV accesses before cannulation in a large and diverse group of hemodialysis patients from 20 dialy-sisclinicsacrosssixUSstates.Theimagesincludedthecannula- tion site and the adjacent skin. A white background was used to enhance contrast. Images were taken with standard resolution and at ambient light. Using a newly developed app, deidentified images were instantaneously uploaded to the cloud in compli-ance with the Health Insurance Portability and Accountability Act. Images were then adjudicated", "venue": "Clinical Kidney Journal", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-16", "journal": {"name": "Clinical Kidney Journal", "pages": "829 - 830", "volume": "15"}, "authors": [{"authorId": "49724027", "name": "Hanjie Zhang"}, {"authorId": "4503391", "name": "D. Preddie"}, {"authorId": "49815444", "name": "W. Krackov"}, {"authorId": "26406669", "name": "M. Sor"}, {"authorId": "2089726654", "name": "Peter Waguespack"}, {"authorId": "2122921551", "name": "Zuwen Kuang"}, {"authorId": "39852078", "name": "Xiaoling Ye"}, {"authorId": "2951771", "name": "P. Kotanko"}], "citations": [{"paperId": "0bf13c31fb013dbeda5ec0c87d2f80ec856b5bb2", "title": "Deep Learning for Image Analysis in Kidney Care."}]}
