{"paperId": "13ef22764931fb58becee9144287c16111c17238", "publicationVenue": {"id": "7b19fb63-6e4e-4972-bd80-9e2b17941c95", "name": "Royal Society Open Science", "type": "journal", "alternate_names": ["R Soc Open Sci"], "issn": "2054-5703", "url": "https://royalsocietypublishing.org/journal/rsos", "alternate_urls": ["http://rsos.royalsocietypublishing.org/"]}, "title": "From Reddit to Wall Street: the role of committed minorities in financial collective action", "abstract": "In January 2021, retail investors coordinated on Reddit to target short-selling activity by hedge funds on GameStop shares, causing a surge in the share price and triggering significant losses for the funds involved. Such an effective collective action was unprecedented in finance, and its dynamics remain unclear. Here, we analyse Reddit and financial data and rationalize the events based on recent findings describing how a small fraction of committed individuals may trigger behavioural cascades. First, we operationalize the concept of individual commitment in financial discussions. Second, we show that the increase of commitment within Reddit pre-dated the initial surge in price. Third, we reveal that initial committed users occupied a central position in the network of Reddit conversations. Finally, we show that the social identity of the broader Reddit community grew as the collective action unfolded. These findings shed light on financial collective action, as several observers anticipate it will grow in importance.", "venue": "Royal Society Open Science", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-15", "journal": {"name": "Royal Society Open Science", "volume": "9"}, "authors": [{"authorId": "51435753", "name": "Lorenzo Lucchini"}, {"authorId": "2905635", "name": "L. Aiello"}, {"authorId": "2818774", "name": "Laura Alessandretti"}, {"authorId": "116041634", "name": "Gianmarco De Francisci Morales"}, {"authorId": "2081249", "name": "Michele Starnini"}, {"authorId": "2836702", "name": "Andrea Baronchelli"}], "citations": [{"paperId": "6aec25ad4d8d3d58620f0be0b52667b6dc7a3f60", "title": "The rise and fall of WallStreetBets: social roles and opinion leaders across the GameStop saga"}, {"paperId": "41f89534a229aeb7ed28b9a19a3648217e9d709e", "title": "The causal role of the Reddit collective action on the GameStop short squeeze"}, {"paperId": "8cbc8cc8e50009936a92e916604a86d16268539d", "title": "Narratives of Collective Action in YouTube's Discourse on Veganism"}, {"paperId": "81fbcc56cbf23534c8a00e4facc1d8fcbaac0318", "title": "Mental health concerns precede quits: shifts in the work discourse during the Covid-19 pandemic and great resignation"}, {"paperId": "baf2806051b2add7bdb2db970d223acc9239baec", "title": "Drivers of social influence in the Twitter migration to Mastodon"}, {"paperId": "24926f7ac6ddd7d4cf98d6d75eeaad808e266890", "title": "Bloomberg and the GameStop saga: The fear of stock market democracy"}, {"paperId": "6611fd3f278a75aef216ceed3c912ff1421becf3", "title": "Mental health concerns prelude the Great Resignation: Evidence from Social Media"}, {"paperId": "1c1e17c6ea05036d63aaffa9cd726a0b12f09556", "title": "Non-normal interactions create socio-economic bubbles"}, {"paperId": "d9533fabe2a5244066fa97c0d822f60ed60b5211", "title": "This Must Be the Place: Predicting Engagement of Online Communities in a Large-scale Distributed Campaign"}, {"paperId": "82066656e9fc34641c9bcb298019df1398655d09", "title": "Self-induced consensus of Reddit users to characterise the GameStop short squeeze"}, {"paperId": "929d48d07f283473aacbf5aa83d936d6b06450b3", "title": "Extreme Views on Reddit: Information or Noise?"}, {"paperId": "1e4612fd7b392c4694b1957403bbafaa492d241f", "title": "Self-induced emergence of consensus in social networks: Reddit and the GameStop short squeeze"}]}
