{"paperId": "1414b8f7f4970e13f43d3fb19c982a9533349ac5", "publicationVenue": {"id": "3bc0e661-dc2a-454a-9ff5-6515430ce9ff", "name": "Frontiers in Cardiovascular Medicine", "type": "journal", "alternate_names": ["Front Cardiovasc Med"], "issn": "2297-055X", "url": "http://www.frontiersin.org/Cardiovascular_Medicine", "alternate_urls": ["http://www.frontiersin.org/Cardiovascular_Medicine/about", "https://www.frontiersin.org/journals/cardiovascular-medicine"]}, "title": "Development and validation of prediction models for hypertension risks: A cross-sectional study based on 4,287,407 participants", "abstract": "Objective To develop an optimal screening model to identify the individuals with a high risk of hypertension in China by comparing tree-based machine learning models, such as classification and regression tree, random forest, adaboost with a decision tree, extreme gradient boosting decision tree, and other machine learning models like an artificial neural network, naive Bayes, and traditional logistic regression models. Methods A total of 4,287,407 adults participating in the national physical examination were included in the study. Features were selected using the least absolute shrinkage and selection operator regression. The Borderline synthetic minority over-sampling technique was used for data balance. Non-laboratory and semi-laboratory analyses were carried out in combination with the selected features. The tree-based machine learning models, other machine learning models, and traditional logistic regression models were constructed to identify individuals with hypertension, respectively. Top features selected using the best algorithm and the corresponding variable importance score were visualized. Results A total of 24 variables were finally included for analyses after the least absolute shrinkage and selection operator regression model. The sample size of hypertensive patients in the training set was expanded from 689,025 to 2,312,160 using the borderline synthetic minority over-sampling technique algorithm. The extreme gradient boosting decision tree algorithm showed the best results (area under the receiver operating characteristic curve of non-laboratory: 0.893 and area under the receiver operating characteristic curve of semi-laboratory: 0.894). This study found that age, systolic blood pressure, waist circumference, diastolic blood pressure, albumin, drinking frequency, electrocardiogram, ethnicity (uyghur, hui, and other), body mass index, sex (female), exercise frequency, diabetes mellitus, and total bilirubin are important factors reflecting hypertension. Besides, some algorithms included in the semi-laboratory analyses showed less improvement in the predictive performance compared to the non-laboratory analyses. Conclusion Using multiple methods, a more significant prediction model can be built, which discovers risk factors and provides new insights into the prediction and prevention of hypertension.", "venue": "Frontiers in Cardiovascular Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-26", "journal": {"name": "Frontiers in Cardiovascular Medicine", "volume": "9"}, "authors": [{"authorId": "145688606", "name": "W. Ji"}, {"authorId": "2108051977", "name": "Yushan Zhang"}, {"authorId": "1708198180", "name": "Yinlin Cheng"}, {"authorId": "2108100687", "name": "Yushan Wang"}, {"authorId": "2118764927", "name": "Yi Zhou"}], "citations": [{"paperId": "0294626e0f0aa06b136c9ecf541ad5c9aad3a301", "title": "Development and validation of machine learning-augmented algorithm for insulin sensitivity assessment in the community and primary care settings: a population-based study in China"}, {"paperId": "ae5a5a78aa79b3404995acb1ce5be67ce9892753", "title": "A Comprehensive Analysis of Hypertension Disease Risk-Factors, Diagnostics, and Detections Using Deep Learning-Based Approaches"}, {"paperId": "1365f7532a5732b3a968b421d5366bb2c1ef0e36", "title": "Machine learning for predicting diabetes risk in western China adults"}, {"paperId": "6cfad18673bbab668812cfc8cbad8d139f8c24fc", "title": "Improving the Classification of PCNSL and Brain Metastases by Developing a Machine Learning Model Based on 18F-FDG PET"}]}
