{"paperId": "14381dc2780e10aeef4aa4545dcd68edf6cfa2e6", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Interoperability Benefits and Challenges in Smart City Services: Blockchain As a Solution", "abstract": "The widespread usage of smart devices with various city-centric services speeds up and improves civic life, in contrast to growing privacy and security concerns. Security issues are exacerbated when e-government service providers trade their services within a centralised framework. Due to security concerns, city-centric centralised services are being converted to blockchain-based systems, which is a very time-consuming and challenging process. The interoperability of these blockchain-based systems is also more challenging due to protocol variances, an excessive amount of local transactions that raise scalability and rapidly occupy memory. In this paper, we have proposed a framework for interoperability across various blockchain-based smart city services. It also summarises how independent service providers might continue self-service choices (i.e., local transactions) without overloading the blockchain network and other organisations. A simulated interoperability network is used to show the network’s effectiveness. The experimental outcomes show the scalability and memory optimization of the blockchain network.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-19", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2150473600", "name": "S. Biswas"}, {"authorId": "2244162832", "name": "Zigang Yao"}, {"authorId": "2244270607", "name": "Lin Yan"}, {"authorId": "2268328371", "name": "Abdulmajeed Alqhatani"}, {"authorId": "3390642", "name": "A. Bairagi"}, {"authorId": "2244098313", "name": "Fatima Asiri"}, {"authorId": "144314447", "name": "Mehedi Masud"}], "citations": [{"paperId": "7adecd09b1abc7a27adaaa13a0163e85eaa3ad45", "title": "Benefit and limitation of using blockchain in smart cities to improve citizen services"}, {"paperId": "50b41c53bbb0f3386ce1a15fbea70d64b0b21c90", "title": "Blockchain and public service delivery: a lifetime cross-referenced model for e-government"}, {"paperId": "b0d268701ab37da3f5274e789cb43cd487c1eaca", "title": "A Survey of Blockchain in Governance: Framework Selection and Future Implementation in Indonesian Government"}, {"paperId": "67acd244047874a7155160a1f9b1b1f61b9fb2b9", "title": "Challenges in Blockchain as a Solution for IoT Ecosystem Threats and Access Control: A Survey"}, {"paperId": "26ad92a3e8a60acfbf2512457385c2323a371299", "title": "System of System Strategy for Multi-Level Interoperability for Smart Cities"}]}
