{"paperId": "143c8f0f3cf50ba1692ed5f0ad28e16697aaddab", "publicationVenue": {"id": "b198f59e-0da6-4b35-b995-a02322b9dada", "name": "IEEE International Conference on Services Computing", "type": "conference", "alternate_names": ["International Conference on Services Computing [Services Society]", "International Conference on Services Computing", "IEEE Int Conf Serv Comput", "Int Conf Serv Comput [services Soc", "SCC", "Int Conf Serv Comput", "IEEE SCC"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1001209/all-proceedings"}, "title": "Columbus: Enabling Scalable Scientific Workflows for Fast Evolving Spatio-Temporal Sensor Data", "abstract": "As spatiotemporal sensor data collections are becoming more available, the ability to generate insights from them is turning increasingly complex for scientists in this domain. Organizing such voluminous data and keeping track of analysis results get tedious from day to day. In this paper, we propose a system comprising a distributed workflow execution engine, a storage framework with flexible spatiotemporal data dispersion and indexing scheme for fast data search and retrieval, and a scheduling scheme that aims at minimizing data movement across machines while simultaneously ensuring fair and efficient allocation of resources among multiple users. Our empirical evaluations demonstrate the feasibility of our approach and its ability to scale.", "venue": "IEEE International Conference on Services Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-01", "journal": {"name": "2017 IEEE International Conference on Services Computing (SCC)", "pages": "9-18"}, "authors": [{"authorId": "25065990", "name": "Johnson Charles Kachikaran Arulswamy"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "87774347413df332e80efaed262929efa26ee6ae", "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets"}, {"paperId": "fe8bfee3ec714e9c9ab3d2abf3b3e8348cd67941", "title": "Leveraging structural-context similarity of Wikipedia links to predict twitter user locations"}]}
