{"paperId": "143f0411796a6d8f811f21ec0f8a9bca2cf3febe", "publicationVenue": {"id": "27d46b6c-db6a-4cb5-9b67-ff74822cb3a4", "name": "Datalog", "type": "conference", "alternate_names": ["Datalog"]}, "title": "Towards Better Understanding of the Performance and Design of Datalog Systems", "abstract": "Recent years have seen a resurgence of interest in the Datalog language and its syntactic extensions from both the industry and academia. Such interest has motivated a line of work to build efficient Datalog systems that support expressing data analytics of different types such as program and graph analyses in a concise and simple way. However, besides the performance improvement of different systems presented in these works over existing competitors, little understanding has been gained about the property of varying Datalog workloads (i.e., program and data), and the computation resource usage of different systems (i.e., memory and CPU utilization), which are crucial for understanding the essence behind the performance difference observed in different systems. When such knowledge is gained, clear guidance could be provided for users to choose between different Datalog systems depending on their use cases and system builders to improve the existing system or build more efficient new systems. In this paper, we propose the general profiling of the Datalog program evaluation and present the corresponding visualizations. We further discuss the insights gained from the produced visualizations and how these insights shed light on the pros and cons of existing Datalog systems, which further provides guidance on making improvements over the existing system and designing/building more efficient new systems.", "venue": "Datalog", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "166-180"}, "authors": [{"authorId": "2113846144", "name": "Zhiwei Fan"}, {"authorId": "2183788508", "name": "Sunil Mallireddy"}, {"authorId": "1713920", "name": "Paraschos Koutris"}], "citations": [{"paperId": "55acc8c01f5f8c7ceb0d215dc30991c29e91a36f", "title": "The Complexity of Why-Provenance for Datalog Queries"}]}
