{"paperId": "14409f4a17b180363ec23f7c4315b52d3b0e6223", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "Landslide susceptibility mapping in Badakhshan province, Afghanistan: a comparative study of machine learning algorithms", "abstract": "Abstract This research aimed to assess landslide susceptibility in the Badakhshan province of Afghanistan, an area highly susceptible to landslides due to its complex topography and geological conditions. Three distinct machine learning (ML) models, namely the Generalized Linear Model (GLM), Maximum Entropy (ME), and Random Forest (RF), were employed to identify the key contributing factors to landslide occurrences in the study region. The dataset used in this study consisted of landslide conditioning factors and a landslide inventory map. The conditioning factors encompassed lithology, soil type, plane curvature, profile curvature, elevation, slope, aspect, precipitation, land use/land cover (LULC), distance to fault, river, road, Normalized Difference Vegetation Index (NDVI), Topographic Wetness Index (TWI), Terrain Ruggedness Index (TRI), and Standardized Precipitation Index (SPI). The landslide inventory map contained 177 landslide locations and 65 non-landslide points obtained from Google Earth. Each machine learning (ML) model was trained and implemented independently using 70% of the training data, with the results validated against the remaining 30% of the landslide inventory dataset. Ensemble results from GLM, ME, and RF were obtained using the median approach. All three models exhibited consistent performance and identified similar landslide-prone areas. Among the various factors studied, proximity to rivers emerged as the most influential factor contributing to landslides, followed by the distance to roads and slope gradient. The study revealed that the districts of Argo and Yaftali Sufla, near Faizabad, were identified as particularly susceptible to landslides, especially in the vicinity of large valleys. Out of the total study area of 3086.4 km2, ∼2162 km2 were deemed relatively safe from landslides, while 149 km2 (representing 4.8% of the study region) were identified as highly susceptible to landslides. Area Under the Receiver Operating Characteristic Curve (AUC) and Root Mean Square Error (RMSE) statistics were used to evaluate the performance of the machine learning (ML) algorithms. The RF and ME models demonstrated the highest performance levels. This research contributes to our understanding of landslide susceptibility in Badakhshan province and can aid in implementing effective landslide risk management strategies in the region.", "venue": "Geocarto International", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-17", "journal": {"name": "Geocarto International", "volume": "38"}, "authors": [{"authorId": "2123172978", "name": "Abdul Baser Qasimi"}, {"authorId": "2232328303", "name": "Vahid Issazade"}, {"authorId": "2157363639", "name": "Enayatullah Enayat"}, {"authorId": "2123177355", "name": "Zabihullah Nadry"}, {"authorId": "2213000794", "name": "A. Majidi"}], "citations": [{"paperId": "7caf8fbe541fbde56518f03a3a5a7ef399c3d3c5", "title": "Landslide dynamic hazard prediction based on precipitation variation trend and backpropagation neural network"}, {"paperId": "60de6dae76b00528b3516923285c9b75c8370641", "title": "Unveiling the Complexity of Earth's Dynamic Ecosystems: Harnessing the Power of Remote Sensing for Environmental Analysis"}, {"paperId": "7c09abc7874c05148836e2284f513f4fe1792d00", "title": "Modeling and Evaluation of the Susceptibility to Landslide Events Using Machine Learning Algorithms in the Province of Chañaral, Atacama Region, Chile"}, {"paperId": "9b9c8d8f4e53ed2a4ae1ccb8e8e18be117407b8d", "title": "Flood susceptibility prediction using MaxEnt and frequency ratio modeling for Kokcha River in Afghanistan"}, {"paperId": "2767542d45da5bb04a3a36d6958394b6629e1ccb", "title": "Geo-Environment Vulnerability Assessment of Multiple Geohazards Using VWT-AHP: A Case Study of the Pearl River Delta, China"}]}
