{"paperId": "14573c0412e8238d4086f4dcc8807693473e3895", "publicationVenue": {"id": "88cc76ce-f486-46c4-bfa1-a31809d402d7", "name": "International Conference on Big Data and Smart Computing", "type": "conference", "alternate_names": ["BIGCOMP", "BigComp", "Int Conf Big Data Smart Comput"]}, "title": "Deep Learning Mental Health Dialogue System", "abstract": "Mental health counseling remains a major challenge in modern society due to cost, stigma, fear, and unavailability. We posit that generative artificial intelligence (AI) models designed for mental health counseling could help improve outcomes by lowering barriers to access. To this end, we have developed a deep learning (DL) dialogue system called Serena. The system consists of a core generative model and post-processing algorithms. The core generative model is a 2.7 billion parameter Seq2Seq Transformer [26] fine-tuned on thousands of transcripts of person-centered-therapy (PCT) sessions. The series of postprocessing algorithms detects contradictions, improves coherency, and removes repetitive answers. Serena is implemented and deployed on https://serena.chat, which currently offers limited free services. While the dialogue system is capable of responding in a qualitatively empathetic and engaging manner, occasionally it displays hallucination and long-term incoherence. Overall, we demonstrate that a deep learning mental health dialogue system has the potential to provide a low-cost and effective complement to traditional human counselors with less barriers to access.", "venue": "International Conference on Big Data and Smart Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-01-23", "journal": {"name": "2023 IEEE International Conference on Big Data and Smart Computing (BigComp)", "pages": "395-398"}, "authors": [{"authorId": "103275096", "name": "L. Brocki"}, {"authorId": "2202228586", "name": "George C. Dyer"}, {"authorId": "1421191892", "name": "A. Gładka"}, {"authorId": "3219565", "name": "N. C. Chung"}], "citations": [{"paperId": "ab80047970b739af80b607468204f7822e6a9653", "title": "The opportunities and risks of large language models in mental health"}, {"paperId": "90c499688f0c781180658114f6c36e68785fc8be", "title": "A Systematic Review of Recent Research on Chatbots"}, {"paperId": "2622aded47f269a96418c9d39b3b5d209277e89b", "title": "Challenges of Large Language Models for Mental Health Counseling"}, {"paperId": "6f542f60a5d4f540d056bb49d47f89f1035ad0cf", "title": "A review of the explainability and safety of conversational agents for mental health to identify avenues for improvement"}, {"paperId": "3c24ac9fcc14c716208cc784a39bda847056c7f0", "title": "Towards Explainable and Safe Conversational Agents for Mental Health: A Survey"}]}
