{"paperId": "145a89b3b63f7cb1c5ddb5892828209a822a6e55", "publicationVenue": null, "title": "A CUDA-Based Parallel Geographically Weighted Regression for Large-Scale Geographic Data", "abstract": "Geographically weighted regression (GWR) introduces the distance weighted kernel function to examine the non-stationarity of geographical phenomena and improve the performance of global regression. However, GWR calibration becomes critical when using a serial computing mode to process large volumes of data. To address this problem, an improved approach based on the compute unified device architecture (CUDA) parallel architecture fast-parallel-GWR (FPGWR) is proposed in this paper to efficiently handle the computational demands of performing GWR over millions of data points. FPGWR is capable of decomposing the serial process into parallel atomic modules and optimizing the memory usage. To verify the computing capability of FPGWR, we designed simulation datasets and performed corresponding testing experiments. We also compared the performance of FPGWR and other GWR software packages using open datasets. The results show that the runtime of FPGWR is negatively correlated with the CUDA core number, and the calculation efficiency of FPGWR achieves a rate of thousands or even tens of thousands times faster than the traditional GWR algorithms. FPGWR provides an effective tool for exploring spatial heterogeneity for large-scale geographic data (geodata).", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-30", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "653", "volume": "9"}, "authors": [{"authorId": "49370874", "name": "Dongchao Wang"}, {"authorId": "2143684817", "name": "Yi Yang"}, {"authorId": "2579602", "name": "A. Qiu"}, {"authorId": "2061736", "name": "Xiaochen Kang"}, {"authorId": "2028916991", "name": "Jiakuan Han"}, {"authorId": "134901438", "name": "Zhengyuan Chai"}], "citations": [{"paperId": "5f3ef09e7b04d56729ac4d3e91ce171221eb607d", "title": "Exploring the usage efficiency of electric bike-sharing from a spatial–temporal perspective"}, {"paperId": "2fc199c92c5fee5ff43e8b38970079127ef3b85d", "title": "Integration Method of Monitoring Video and Geospatial Data Based on 3D Modeling"}, {"paperId": "88c6c69547fd555e876da13dd2347034097611dc", "title": "Unveiling the air pollution tapestry in China: A comprehensive assessment of spatiotemporal variations through geographically and temporally weighted regression"}, {"paperId": "5bf66ffc46efe90123937f0381f70ec140284f9f", "title": "A New Algorithm for Large-Scale Geographically Weighted Regression with K-Nearest Neighbors"}, {"paperId": "06cbd9de294e77e4b32f8204f49f4b0e39f11a40", "title": "Temporal trend evaluation in monitoring programs with high spatial resolution and low temporal resolution using geographically weighted regression models"}, {"paperId": "7c03001487d4bedf00f5b4c694a1f102868bca6e", "title": "Spatiotemporal changes in land use and residential satisfaction in the Huai River-Gaoyou Lake Rim area"}, {"paperId": "c6527f8da91a0943e88b7ab172f5b65ee24c36fa", "title": "High-performance solutions of geographically weighted regression in R"}, {"paperId": "833d50b7404fa3c4c5289e49f76a3b2b181f6e85", "title": "Geographically and temporally weighted co-location quotient: an analysis of spatiotemporal crime patterns in greater Manchester"}, {"paperId": "5c7d0510ad1c37013fbb8ad19732529a476487a8", "title": "Non-Stationary Modeling of Microlevel Road-Curve Crash Frequency with Geographically Weighted Regression"}]}
