{"paperId": "145facb47334e54fd032d282f7bd5dc2d4e591d8", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Expected Scopes of Health Emergency and Disaster Risk Management (Health EDRM): Report on the Expert Workshop at the Annual Conference for the Japanese Association for Disaster Medicine 2020", "abstract": "The World Health Organization (WHO) and its partners established the WHO Thematic Platform for Health Emergency and Disaster Risk Management Research Network (HEALTH EDRM RN) in 2016 to respond to the increasing burden of recent health emergencies and disasters. The mission of the HEALTH EDRM RN, whose secretariat is located at the WHO Kobe Centre (WKC), is to promote global research collaboration and strengthen research activities to inform policies and programs by generating new evidence to manage health risks associated with all types of emergencies and disasters. With the strong support and involvement of all WHO regional offices, the HEALTH EDRM RN now works with more than 200 global experts and partners to pursue its mission. The first Core Group Meetings of the HEALTH EDRM RN were held on 17–18 October 2019, and concluded with the HEALTH EDRM RN-activity priorities to (1) promote operational research to better meet the needs of emergency- and disaster-exposed individuals and communities and efforts to translate science to policies and programs and (2) strengthen the research capacity of the Health EDRM community. In collaboration with the Japanese Association for Disaster Medicine, the WKC held a workshop on 21 February 2020, in which 20 Japanese experts from different research fields participated to further discuss these two points. This paper summarizes the discussion at the workshop.", "venue": "International Journal of Environmental Research and Public Health", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-04-22", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "18"}, "authors": [{"authorId": "36684226", "name": "S. Nomura"}, {"authorId": "51110526", "name": "Ryoma Kayano"}, {"authorId": "46806494", "name": "S. Egawa"}, {"authorId": "4365977", "name": "Nahoko Harada"}, {"authorId": "6332605", "name": "Y. Koido"}], "citations": [{"paperId": "7f662fcfaa9fbd048e0ee95f7afef1d0a732e0b0", "title": "Comparison of different scoring systems in the prognosis of acutely poisoned patients"}, {"paperId": "38bffdd3e9256bcd8b880abc413e818757a2b2fd", "title": "REDEFINING MEDICAL EDUCATION IN INDIA: A PERSPECTIVE"}, {"paperId": "c4f8d167b1c8e87005b20675135e16071bcf32ca", "title": "COVID-19 Pandemic-Revealed Consistencies and Inconsistencies in Healthcare: A Medical and Organizational View"}, {"paperId": "338aa42bbd56a8ada77ffc68354d6988f1ed8b32", "title": "Indonesia’s Climate-Related Disasters and Health Adaptation Policy in the Build-Up to COP26 and Beyond"}, {"paperId": "2faae739ec1be7fe4cf6f7fb25ea26358bf43359", "title": "Optimizing access to drinking water in remote areas. Application to Nepal"}]}
