{"paperId": "1476c3e1194f930b0cc6920e6b84371b45773a16", "publicationVenue": null, "title": "The Doge of Wall Street: Analysis and Detection of Pump and Dump Cryptocurrency Manipulations", "abstract": "Cryptocurrencies are increasingly popular. Even people who are not experts have started to invest in these assets, and nowadays, cryptocurrency exchanges process transactions for over 100 billion US dollars per month. Despite this, many cryptocurrencies have low liquidity and are highly prone to market manipulation. This paper performs an in-depth analysis of two market manipulations organized by communities over the Internet: The pump and dump and the crowd pump. The pump and dump scheme is a fraud as old as the stock market. Now, it has new vitality in the loosely regulated market of cryptocurrencies. Groups of highly coordinated people systematically arrange this scam, usually on Telegram and Discord. We monitored these groups for more than 3 years, detecting around 900 individual events. We report on three case studies related to pump and dump groups. We leverage our unique dataset of the verified pump and dumps to build a machine learning model able to detect a pump and dump in 25 seconds from the moment it starts, achieving the results of 94.5% of F1-score. Then, we move on to the crowd pump, a new phenomenon that hit the news in the first months of 2021, when a Reddit community inflated the price of the GameStop stocks (GME) by over 1,900% on Wall Street, the world’s largest stock exchange. Later, other Reddit communities replicated the operation on the cryptocurrency markets. The targets were DogeCoin (DOGE) and Ripple (XRP). We reconstruct how these operations developed and discuss differences and analogies with the standard pump and dump. We believe this study helps understand a widespread phenomenon affecting cryptocurrency markets. The detection algorithms we develop effectively detect these events in real-time and helps investors stay out of the market when these frauds are in action.", "venue": "ACM Trans. Internet Techn.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-03", "journal": {"name": "ACM Transactions on Internet Technology", "pages": "1 - 28", "volume": "23"}, "authors": [{"authorId": "50722537", "name": "Massimo La Morgia"}, {"authorId": "145447099", "name": "Alessandro Mei"}, {"authorId": "2075610159", "name": "Francesco Sassi"}, {"authorId": "3240139", "name": "Julinda Stefa"}], "citations": [{"paperId": "d5f1d9825dbc012abf36e37ce13931b0ea186fa6", "title": "Sentiment matters: the effect of news-media on spillovers among cryptocurrency returns"}, {"paperId": "843bc2cd55da69c7f337e7156025452e9ddc217f", "title": "Dimensionality reduction techniques to support insider trading detection"}, {"paperId": "a3761a21d11eadd4fafeed2f3766ce5b29debd00", "title": "NotFYCEX: A Simulation Based Price Prediction and Notification System Using Continuous Machine Learning Method"}, {"paperId": "666e39783ffdc15bbcb23b94a9cdbf72672f0d59", "title": "A Prediction Model for Short Price Jump in Cryptocurrency Market"}, {"paperId": "9f314017e479f2a266333ac98739f251e092b27e", "title": "Artificial cheerleading in IEO: Marketing campaign or pump and dump scheme"}, {"paperId": "f4c0bb3921d54d11267c62f69f6194b9c916e5e0", "title": "Survey on cryptocurrency security attacks and detection mechanisms"}, {"paperId": "5fce41596b736b21d07743df0517a1af4aa3feca", "title": "Market Misconduct in Decentralized Finance (DeFi): Analysis, Regulatory Challenges and Policy Implications"}, {"paperId": "6b689ec962c61832d7d576ef23fdc1228ce13dd0", "title": "Pump, Dump, and then What? The Long-Term Impact of Cryptocurrency Pump-and-Dump Schemes"}, {"paperId": "dac93a9fa08dca3863c8c4e716b84f46f9a019d9", "title": "AI-powered Fraud Detection in Decentralized Finance: A Project Life Cycle Perspective"}, {"paperId": "fe6a14f5085b323ebcfb566ab92ef55434bffbe6", "title": "A Survey on Pump and Dump Detection in the Cryptocurrency Market Using Machine Learning"}, {"paperId": "a69fcfdfb089309c580898d2cbd7ac56243d4733", "title": "It’s a Trap! Detection and Analysis of Fake Channels on Telegram"}, {"paperId": "05840338a62dd85ac61c710625d3172a1cbffeab", "title": "Investment in non-fungible tokens (NFTs): the return of Ethereum secondary market NFT sales"}, {"paperId": "45c8d2c49e6ade00dea4df99acabb7304bf3da70", "title": "TGDataset: a Collection of Over One Hundred Thousand Telegram Channels"}, {"paperId": "f9e00de40e8caa38bd9a8425c8ea1389794ef9db", "title": "Profitability and herding of trade-based pump-and-dump manipulation"}, {"paperId": "81adfdf502ae939b012f229a2654662bfb5dba49", "title": "A machine learning approach to support decision in insider trading detection"}, {"paperId": "1a3aee51d33a8894fa683df14949982cb0a1c27c", "title": "Token Spammers, Rug Pulls, and SniperBots: An Analysis of the Ecosystem of Tokens in Ethereum and the Binance Smart Chain (BNB)"}, {"paperId": "1e2806112b08eed0ce87c7695d8f8954c683c587", "title": "ANALISIS PENGARUH INFLUENCER SOSIAL MEDIA TERHADAP KEPUTUSAN MASYARAKAT INDONESIA DALAM PEMBELIAN CRYPTOCURRENCY"}, {"paperId": "ec567f1005ba3d22cd7ce4c26228d6e0afd46ca4", "title": "Sequence-Based Target Coin Prediction for Cryptocurrency Pump-and-Dump"}, {"paperId": "30ea5f4d27a06c15951a7c6cda172222e2496c56", "title": "Linear Laws of Markov Chains with an Application for Anomaly Detection in Bitcoin Prices"}, {"paperId": "51a27a5907c542414c506ee318d5843a75b3c226", "title": "Applications of Signature Methods to Market Anomaly Detection"}, {"paperId": "82066656e9fc34641c9bcb298019df1398655d09", "title": "Self-induced consensus of Reddit users to characterise the GameStop short squeeze"}, {"paperId": "95ae9caa120e3b034ea230892d94385af091de13", "title": "The effectiveness of supervised learning models in detection of pump and dump activity in Dogecoin"}, {"paperId": "cc1db48ad238d549167a68d3f58c8bbef0852c91", "title": "Profitability of cryptocurrency Pump and Dump schemes"}, {"paperId": "39aacec32f023dac18bf6ff57271a1eb1425a540", "title": "Token Spammers, Rug Pulls, and Sniper Bots: An Analysis of the Ecosystem of Tokens in Ethereum and in the Binance Smart Chain (BNB)"}, {"paperId": "21718954f5d82c0981f4e17e97251095004a25b1", "title": "Bulletin of Electrical Engineering and Informatics"}, {"paperId": "1e4612fd7b392c4694b1957403bbafaa492d241f", "title": "Self-induced emergence of consensus in social networks: Reddit and the GameStop short squeeze"}]}
