{"paperId": "1479006efe406902aa1207b5715260020ab00210", "publicationVenue": {"id": "87044072-6913-4ccb-a09a-1b4766d0cb96", "name": "Global Journal of Engineering Sciences", "type": "journal", "alternate_names": ["Glob J Eng Sci"], "issn": "2641-2039", "url": "https://irispublishers.com/gjes/archive.php"}, "title": "Interactive Big Data Analytics Platform for Healthcare and Clinical Services", "abstract": "A Big Data Platform (BDA) with Hadoop/MapReduce technologies distributed over HBase (key-value NoSQL database storage) and generate hospitalization metadata was established for testing functionality and performance. Performance tests retrieved results from simulated patient records with Apache tools in Hadoop’s ecosystem. At optimized iteration, Hadoop distributed file system (HDFS) ingestion with HBase exhibited sustained database integrity over hundreds of iterations; however, to complete its bulk loading via MapReduce to HBase required a month. The framework over generated HBase data files took a week and a month for one billion (10TB) and three billion (30TB), respectively. Apache Spark and Apache Drill showed high performance. However, inconsistencies of MapReduce limited the capacity to generate data. Hospital system based on a patient encounter-centric database was very difficult to establish because data profiles have complex relationships. Recommendations for key-value storage should be considered for healthcare when analyzing large volumes of data over simplified clinical event models.", "venue": "Global Journal of Engineering Sciences", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-09-20", "journal": {"name": "Global Journal of Engineering Sciences"}, "authors": [{"authorId": "2065410", "name": "D. Chrimes"}, {"authorId": "2199693", "name": "M. Kuo"}, {"authorId": "145027929", "name": "A. Kushniruk"}, {"authorId": "3208521", "name": "B. Moa"}], "citations": [{"paperId": "5f810592308294b0dd588390dde058e03f2b9076", "title": "Big health data for elderly employees job performance of SOEs: visionary and enticing challenges"}, {"paperId": "b6593b5ad6b0e00232ee88cf2bc578645c1299a0", "title": "Block Storage Optimization and Parallel Data Processing and Analysis of Product Big Data Based on the Hadoop Platform"}, {"paperId": "0d519610cfeceb456cce775c96190fc7d381aa12", "title": "Big data analytics in healthcare − A systematic literature review and roadmap for practical implementation"}, {"paperId": "a184143861103bfb040ffd64d302e09532afc6a1", "title": "Research on the Secure Medical Big Data Ecosystem Based on Hadoop"}]}
