{"paperId": "147b4452f3989aa7e845840bac4037ae326266d5", "publicationVenue": {"id": "265e5461-e186-46e6-b95b-6767e39326db", "name": "Conference on Network Function Virtualization and Software Defined Network", "type": "conference", "alternate_names": ["NFV-SDN", "Conf Netw Funct Virtualiz Softw Defin Netw"]}, "title": "Branching-Aware Service Function Placement and Routing in Network Function Virtualization", "abstract": "Network Function Virtualization (NFV) is an emerging technology that promises to address issues in traditional middleboxes, providing service flexibility and reduced cost. NFV decouples network functions from the proprietary middlebox hardware, thus allowing the network providers to implement network functions on virtual machines running in standard servers. To deliver an end-to-end service in the NFV environment, Service Function Chain (SFC) is used to define the sequence of actions or Virtual Network Functions (VNFs) that needs to be applied to the data stream of a service delivery demand. Typically, the SFC is regarded as a linear topology that consists of a group of VNFs that the data stream is navigated through. However, our recent exploration on a group of real-life use cases reveals that the data stream can branch out to multiple data streams at certain VNFs (e.g., a load balancer). This branching indicates that the packet flow may be directed to multiple different paths, resulting in a more complex mesh-like service function graph. In this paper, we define the resulting problem as Branching-Aware Service Function Graph embedding and routing (B_SFG). We study how to efficiently accommodate user’s B_SFG requests in the physical network while considering the constraints of function dependency, branching requirements, computing resources of virtual nodes and bandwidth demand of the virtual links. We propose a novel algorithm, B_SFG_CM, which jointly optimizes the processes of node and link mapping of a request. B_SFG_CM employs the proposed techniques of dependency sorting and layering that effectively take into account the node dependency, branching points and the resource status of the physical network. Our experimental results show that the proposed algorithm significantly outperforms the scheme based on the traditional sequential node/link embedding in which the node and link mapping is done sequentially.", "venue": "Conference on Network Function Virtualization and Software Defined Network", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 IEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN)", "pages": "1-6"}, "authors": [{"authorId": "2749049", "name": "Maryam Jalalitabar"}, {"authorId": "2155651845", "name": "Yang Wang"}, {"authorId": "4526268", "name": "Xiaojun Cao"}], "citations": [{"paperId": "1bb01e31c0121feda2f4fbdd170aa9be8bf5d76b", "title": "DINC: Toward Distributed In-Network Computing"}, {"paperId": "dbb654212dc758c86853af99984897f02c98b2b7", "title": "Security and risk analysis in the cloud with software defined networking architecture"}, {"paperId": "b0174da6a95ce733bf749ef3a156321892ac37c4", "title": "Traffic-Weighted Availability-Guaranteed Network Slice Composition with VNF Replications"}, {"paperId": "bb55104fc326398488eaa995990daa8ffd7be4aa", "title": "NetEye: Network Monitoringfor a Software Defined Networkbased Virtualized Network Functions Platform"}, {"paperId": "d64a98600d15bbfa917c06dd56b7ccc775b673b7", "title": "Efficient solutions to the placement and chaining problem of User Plane Functions in 5G networks"}]}
