{"paperId": "147ff6bd033bf7ddb17f7281326dc3739ce63b81", "publicationVenue": null, "title": "DeepCog: A Trustworthy Deep Learning-Based Human Cognitive Privacy Framework in Industrial Policing", "abstract": "The proliferation of the Internet of Things (IoT) has led to the design and incorporation of innovative user control mechanisms, one category based on brain-derived biometric data and known as Brain Control Interface (BCI). BCI devices measure brain signals in EEG and allow users to interact with computerised systems, such as the Industrial Internet of Things (IIoT), intuitively. However, the utilisation of EEG data in the IIoT for actuator control and the collection of such biometric data as evidence for policing the IIoT introduces considerable implications for the users’ cognitive privacy. Thus, considering the importance of cognitive privacy in an evolving era of smart environments, it becomes imperative to develop methods that can ensure the cognitive privacy of users. Cognitive privacy also protects the anonymity of corporations and law enforcement. Furthermore, it maintains the inherent information found in EEG measurements, used by various machine and deep learning models. This paper proposes a novel deep learning-based human cognitive privacy framework, named DeepCog, that ensures users’ privacy through the application of feature transforming normalisation. A deep MLP model then processes the encoded data to classify samples according to an integer-based subject ID, enabling the framework to select the correct secondary deep MLP model (one for each subject) to identify eye activity. Our experiments indicate high accuracy of 93.4%, with precision 93.2% and recall 93.8%, outperforming compelling techniques.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "7485-7493", "volume": "24"}, "authors": [{"authorId": "51229946", "name": "F. Schiliro"}, {"authorId": "3193106", "name": "Nour Moustafa"}, {"authorId": "1630421985", "name": "Imran Razzak"}, {"authorId": "24901061", "name": "A. Beheshti"}], "citations": [{"paperId": "df511f5e6d1514dfa6bb5d480361bca52345bc12", "title": "Towards Global, Socio-Economic, and Culturally Aware Recommender Systems"}, {"paperId": "1ac6400dd778f673ad74d3fcebf0643515d10f75", "title": "An Advanced Healthcare System Where Internet of Things meets Brain-Computer Interface using Event-Related Potential"}, {"paperId": "5c9515ee1c01b5b3e8403dd6483eecd5ea0c2827", "title": "Intent Recognition in Conversational Recommender Systems"}]}
