{"paperId": "1480899df5d17c689073d5932028059a3dbee38f", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Digital Twin Approach in Buildings: Future Challenges via a Critical Literature Review", "abstract": "In 2011, the term Digital Twin was originally introduced by Michael Grieves to define the synchronization between two realities: physical objects placed in a real space and virtual objects within in virtual space, linked through the mutual exchange of data throughout the entire lifecycle, both in real-time and asynchronously. Nowadays, Digital Twin is among the principal and emerging technological innovations of both Industry 4.0 and the emerging Industry 5.0, enabling an interaction between physical and virtual objects, Big Data, Internet of Things, and Artificial Intelligence. The construction sector, too, is now exploring the potentialities offered by the Digital Twin approach in enhancing innovative, responsible, and sustainable governance of buildings’ lifecycles. Concerning these issues, this paper proposes visualizing future challenges with a specific focus on the operation and maintenance phase and its related impact on decarbonization via a critical literature review of the current statements. The applied methodology is based on three different questions related to certain research issues performed in the Scopus database. The selected findings were filtered, classified, and discussed. Some future challenges on specific issues have been identified, defining and promoting novel research ideas.", "venue": "Buildings", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-01", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2256871888", "name": "M. Lauria"}, {"authorId": "71790390", "name": "M. Azzalin"}], "citations": []}
