{"paperId": "148a65b66ce686df7626d305fc8a55b58333d778", "publicationVenue": {"id": "27e2a414-d399-477e-a6d3-81b1c4fc5aad", "name": "International Conference on Control, Decision and Information Technologies", "type": "conference", "alternate_names": ["CoDIT", "CDIT", "Int Conf Control Decis Inf Technol"]}, "title": "Testing Access Control List Policies in a Hadoop Environment", "abstract": "Hadoop has emerged over the past few years as the most popular framework to process large-scale datasets efficiently. The idea is to process large datasets using several programs on multi-nodes hardware. However, the execution of such model on large clusters can be more complex and could produce several failures due to bugs or hardware problems or misuse of sensitive data. In fact, data security and Map-Reduce calculations are key concerns when a Map-Reduce calculation is performed in public domain. In this paper, we propose an Access Control model based on XACML language to test the Access Control List policies on both the MapReduce framework and the Hadoop distributed file system. To this end, we transform both the Access Control List policies and the users’ objectives using the XACML language. Then, we introduce a Multi-Agents system to test the objectives expressed by users against the ACL policies.", "venue": "International Conference on Control, Decision and Information Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-06-29", "journal": {"name": "2020 7th International Conference on Control, Decision and Information Technologies (CoDIT)", "pages": "831-836", "volume": "1"}, "authors": [{"authorId": "2029676993", "name": "Oussama Maakoul"}, {"authorId": "2029677467", "name": "Mohammed Amine Tajioue"}, {"authorId": "23311326", "name": "Sara Hsaini"}, {"authorId": "40061471", "name": "Salma Azzouzi"}, {"authorId": "2153792", "name": "M. E. H. Charaf"}], "citations": [{"paperId": "644c85e47f2bf6f9281f360c6c1b62e6a1a43613", "title": "An Optimal Method for Testing Jobs' Execution in MapReduce Based Systems"}, {"paperId": "8e411b8ac3d7bccfc0b445b5ed5b6d3980d0b727", "title": "An Optimal Approach for Testing Control in The Distributed Cloud"}, {"paperId": "574c7db18b89263f27400e1c0f668da0318b4e18", "title": "An Adaptive Approach to Optimize Probabilistic Distributed Testing"}]}
