{"paperId": "1493436a1205bb2cecd5d945065770237ccdddac", "publicationVenue": null, "title": "Optimal integration decision of industrial internet platform for third-party components in two-sided networks", "abstract": "PurposeWith the development of digitalization and interconnection, there is a growing need for enterprise customers to ensure the compatibility of the third-party components they are using in the manufacturing process, thus raising the integration requirements for the Industrial Internet platform and its third-party developers. Therefore, our study investigates the optimal integration decision of the Industrial Internet platform while considering its access price, the integration cost, and the net utility derived by enterprise customers from the third-party components.Design/methodology/approachWe model a two-sided Industrial Internet platform that connects customers on the demand side to the developers on the supply side. We then explore the integration decision of the Industrial Internet platform and its important factors by solving the optimal profit function.FindingsFirst, despite the high integration cost of third-party developers, the platform still chooses to integrate when enterprise customers derive high utility from the third-party components. Second, due to the compatibility effect, charging the enterprise customers a higher price may reduce the platform profits when these customers derive low utility from the third-party components. Third, the platform profits will increase along with the integration cost of third-party developers when it is low in the case where enterprise customers derive low utility from third-party components.Originality/valueOur findings offer insightful takeaways for the Industrial Internet platform when making integration decisions.", "venue": "Industrial Management &amp; Data Systems", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-15", "journal": {"name": "Industrial Management &amp; Data Systems"}, "authors": [{"authorId": "2291701540", "name": "Nan Feng"}, {"authorId": "2278783821", "name": "Lei Zhang"}, {"authorId": "2260844840", "name": "Xin Liu"}, {"authorId": "2252255997", "name": "Jingjing Xie"}], "citations": []}
