{"paperId": "149592150fe493a138139c205975ecb7f4f89120", "publicationVenue": null, "title": "Intelligent Big Data Analytics in Health", "abstract": "Intelligent big data analytics and machine learning systems have been introduced to explain for the early diagnosis of neurological disorders. A number of scholarly researches about intelligent big data analytics in healthcare and machine learning system used in the healthcare system have been mentioned. The authors have explained the definition of big data, big data samples, and big data analytics. But the main goal is helping researchers or specialists in providing opinion about diagnosing or predicting neurological disorders using intelligent big data analytics and machine learning. Therefore, they focused on the healthcare systems using these innovative ways in particular. The information of platform and tools about big data analytics in healthcare is investigated. Numerous academic studies based on the detection of neurological disorders using both machine learning methods and big data analytics have been reviewed.", "venue": "Early Detection of Neurological Disorders Using Machine Learning Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Early Detection of Neurological Disorders Using Machine Learning Systems"}, "authors": [{"authorId": "146579863", "name": "Ebru Aydindag Bayrak"}, {"authorId": "1690851", "name": "Pınar Kırcı"}], "citations": [{"paperId": "eb853cddc41b417aeced8aaa1b93a879c0960052", "title": "Data Mining as a Method for Comparison of Traffic Accidents in Şişli District of Istanbul"}, {"paperId": "9f0c44abd3c74a5779b2741c2f490f0d7c009ec0", "title": "A Brief Survey on Big Data in Healthcare"}, {"paperId": "ee4dbc52061896201d59f5fe2114f5e574feb336", "title": "Performance Analysis of Machine Learning Algorithms and Feature Selection Methods on Hepatitis Disease"}, {"paperId": "0e1e3727fac12969256e5bbc145e7bb533e055af", "title": "Analysis of Histopathological Images Using Machine Learning Techniques"}]}
