{"paperId": "1496428ed4eed7f50994f49f447226385cdec2a7", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Optimization of RBF-SVM Kernel Using Grid Search Algorithm for DDoS Attack Detection in SDN-Based VANET", "abstract": "The dynamic nature of the vehicular space exposes it to distributed malicious attacks irrespective of the integration of enabling technologies. The software-defined network (SDN) represents one of these enabling technologies, providing an integrated improvement over the traditional vehicular ad-hoc network (VANET). Due to the centralized characteristics of SDN, they are vulnerable to attacks that may result in life-threatening situations. Securing SDN-based VANETs is vital and requires incorporating artificial intelligence (AI) techniques. Hence, this work proposed an intrusion detection model (IDM) to identify Distributed Denial-of-Service (DDoS) attacks in the vehicular space. The proposed solution employs the radial basis function (RBF) kernel of the support vector machine (SVM) classifier and an exhaustive parameter search technique called grid search cross-validation (GSCV). In this framework, the proposed architecture can be deployed on the onboard units (OBUs) of each vehicle, which receive the vehicular data and run intrusion detection tasks to classify a message sequence as a DDoS attack or benign. The performance of the proposed algorithm compared to other ML algorithms using key performance metrics. The proposed framework is validated through experimental simulations to demonstrate its effectiveness in detecting DDoS intrusion. Using the GridSearchCV, optimal values of the RBF-SVM kernel parameters “C” and “gamma” $(\\gamma)$ of 100 and 0.1, respectively, gave the optimal performance. The proposed scheme showed an overall accuracy of 99.33%, a detection rate of 99.22%, and an average squared error of 0.007, outperforming existing benchmarks.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "8477-8490", "volume": "10"}, "authors": [{"authorId": "2216348043", "name": "Goodness Oluchi Anyanwu"}, {"authorId": "83425262", "name": "C. I. Nwakanma"}, {"authorId": "120704782", "name": "Jae-Min Lee"}, {"authorId": "2157216557", "name": "Dong‐Seong Kim"}], "citations": [{"paperId": "9b92fe646f0e9555562928755ec38fb1075a60d5", "title": "A novel framework of DDoS attack detection in network using hybrid heuristic deep learning approaches with attention mechanism"}, {"paperId": "d0f9d30b7c99a0e5b3c99af2f326b25fe9a71e65", "title": "Collaborative Defense Against Hybrid Network Attacks by SDN Controllers and P4 Switches"}, {"paperId": "0a00bae7fb4ec2b85106b8d01105ca7f1549f827", "title": "Contactor Fault Detection and Classification System Using Optical Fiber Bragg Grating Sensors"}, {"paperId": "9ce0c5e9b42bc8402b931db99b8f8a6f7703234a", "title": "Cyber-Twin: Digital Twin-boosted Autonomous Attack Detection for Vehicular Ad-Hoc Networks"}, {"paperId": "18b94bae4036afd1a9ea1e335702f4ec5c1efe7a", "title": "Mitigating Risks in the Cloud-Based Metaverse Access Control Strategies and Techniques"}, {"paperId": "c7ab2f6d35a9165bbe741551aabfab997d1e87f4", "title": "The Evolution of VANET Networks: A Review of Emerging Trends in Artificial Intelligence and Software-Defined Networks"}, {"paperId": "094a543ad7d0073f094fa7cd92b00f86c414b6ba", "title": "Performance Evaluation of Machine Learning-Based Misbehavior Detection Systems in VANETs: A Comprehensive Study"}, {"paperId": "1f09616246f5ac013141320b9a37bad642abf70a", "title": "A Data Mining Based Two-Staged Approach for COVID-19 Diagnosis"}, {"paperId": "49a7f79b5306b43557665efe923f97ba301392f6", "title": "Sentiment Analysis on Investment Education from Twitter using Ensemble Learning"}, {"paperId": "d18b341ad1b3f1f9c74ae9b6f95860ed934478e7", "title": "Intrusion Classification Detection Model for SDN based on Optimized TSO and DT"}, {"paperId": "72f95ee5f46c8f1ae1407f81b7071c83bb96b436", "title": "Integration of IoT and edge cloud computing for smart microgrid energy management in VANET using machine learning"}, {"paperId": "9924118c5631aeca87d0930c798c51f6fa8a45a0", "title": "Online English Education Ability Evaluation System Based on RBF Algorithm"}, {"paperId": "a8d969e6fe9c5008d18c1997008e812c979ef5bc", "title": "Unsupervised Models with LOF and PCA for Robust DDOS Attack Detection"}, {"paperId": "32592d81c58d97f3f0cee2b93f5c1a2e141fcaed", "title": "Effects of logic glitch and (area-power dissipation) leakage on cryptosystems using clock gating technique to enhance web etiquette"}, {"paperId": "f2d38fa38905be8c63eaedadc484ee67f130267a", "title": "Network Intrusion Detection Method Based on Conditional Generative Adversarial Network Integrating Multi-Scale CNN"}, {"paperId": "b41d26c28586804a93596f3b79f629b15fa0aec7", "title": "Machine learning based novel frameworks developments and architectures for secured communication in VANETs for smart transportation"}, {"paperId": "bac5a03c5a674e488551b023dba43d51cab17d8b", "title": "Performance Evaluation of Machine Learning Algorithms applied in SD-VANET for Efficient Transmission of Multimedia Information"}, {"paperId": "03b442672a6f072ac9744f7919862c0ae295e03d", "title": "An Adaptive Real-Time Malicious Node Detection Framework Using Machine Learning in Vehicular Ad-Hoc Networks (VANETs)"}, {"paperId": "0b07edf0188cfd577f7535f2747f5f53116a9aa6", "title": "LSTM-Autoencoder for Vibration Anomaly Detection in Vertical Carousel Storage and Retrieval System (VCSRS)"}, {"paperId": "a441962ddd0a251aa854dcd062c9eed371f61b64", "title": "RSU-Based Online Intrusion Detection and Mitigation for VANET"}, {"paperId": "1b3b8a5de3152aa0ed31f17cf09d3dbfd87a9682", "title": "Performance evaluation of ferro-fluids flooding in enhanced oil recovery operations based on machine learning"}, {"paperId": "0fad4f93a810c7adabc5161e855385158e71d2c4", "title": "A Novel UWB/IMU/Odometer-Based Robot Localization System in LOS/NLOS Mixed Environments"}, {"paperId": "897c61f3709459e48d66c70511e676d164b9c7b6", "title": "Efficiency Assessment of Software-Defined Networking for Real-Time Network Systems"}]}
