{"paperId": "1499e67a1022b7d47e1ad24ac7650ae797769bf5", "publicationVenue": {"id": "b756d3c8-a6b0-4450-ba66-d656679552c6", "name": "Journal of Education Society and Behavioural Science", "type": "journal", "alternate_names": ["J Educ Soc Behav Sci"], "issn": "2456-981X", "url": "http://www.sciencedomain.org/archives/65"}, "title": "Urban Data Science Education: A Key Actor towards Improving Data-Driven Policy-Making for Solving Urban Problems", "abstract": "  \nThis paper explains the benefits of Urban Data Science Education in improving data driving policy-making and highlights the impact of vital use of available open data using a practical demonstration from the Summer-Winter School (SWS) at CEPT University Ahmedabad India.  Good Urban data policies can be an important driver for smart city research and the implementation of good data management practices. Many authors are also becoming interested in the data revolution that is enhancing the way we study and understand cities. It now becomes appropriate to respond to this need in an evidence-informed manner by working with stakeholders to encourage a more resilient approach via education for the younger enthusiast, leading to more transparent, improved, sustainable and safer urban cities. However, the major challenge we foresee is the inability to utilize the large amount of urban data generated daily. With the drive to mobilize more education towards urban data science and analytics, generated data can be effectively utilized to make informed and evidence-based decisions. This paper points to a practical methodology for reproducibility, the key steps taken, as it views the inclusion of an Urban Data Science curriculum as priceless, and a decision that will bring into notice the importance of engaging the younger generation in scholastic learning on data principles and analytics. Data along with spatial enhancement can be the driving factor towards improving data-driven policy-making for solving urban problems in smart cities. \n  \n ", "venue": "Journal of Education Society and Behavioural Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-13", "journal": {"name": "Journal of Education, Society and Behavioural Science"}, "authors": [{"authorId": "104618562", "name": "S. Gandhi"}, {"authorId": "116794918", "name": "F. Anyiam"}], "citations": []}
