{"paperId": "149b7a26c81399be9ff3a05aea0e084313d0fc11", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "A Modified LeNet CNN for Breast Cancer Diagnosis in Ultrasound Images", "abstract": "Convolutional neural networks (CNNs) have been extensively utilized in medical image processing to automatically extract meaningful features and classify various medical conditions, enabling faster and more accurate diagnoses. In this paper, LeNet, a classic CNN architecture, has been successfully applied to breast cancer data analysis. It demonstrates its ability to extract discriminative features and classify malignant and benign tumors with high accuracy, thereby supporting early detection and diagnosis of breast cancer. LeNet with corrected Rectified Linear Unit (ReLU), a modification of the traditional ReLU activation function, has been found to improve the performance of LeNet in breast cancer data analysis tasks via addressing the “dying ReLU” problem and enhancing the discriminative power of the extracted features. This has led to more accurate, reliable breast cancer detection and diagnosis and improved patient outcomes. Batch normalization improves the performance and training stability of small and shallow CNN architecture like LeNet. It helps to mitigate the effects of internal covariate shift, which refers to the change in the distribution of network activations during training. This classifier will lessen the overfitting problem and reduce the running time. The designed classifier is evaluated against the benchmarking deep learning models, proving that this has produced a higher recognition rate. The accuracy of the breast image recognition rate is 89.91%. This model will achieve better performance in segmentation, feature extraction, classification, and breast cancer tumor detection.", "venue": "Diagnostics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-24", "journal": {"name": "Diagnostics", "volume": "13"}, "authors": [{"authorId": "153294015", "name": "Sathiyabhama Balasubramaniam"}, {"authorId": "2142157754", "name": "Yuvarajan Velmurugan"}, {"authorId": "118020673", "name": "D. Jaganathan"}, {"authorId": "2182489339", "name": "Seshathiri Dhanasekaran"}], "citations": [{"paperId": "3891ae6ee8f2a30771638583493dd6f843320238", "title": "General and optimal 2D convolutional neural networks to predict the residual compressive strength of concretes exposed to high temperatures"}, {"paperId": "9074ca8a8f9ed3db6ba72324f3324c35e718ede5", "title": "Enhancing accessibility for improved diagnosis with modified EfficientNetV2-S and cyclic learning rate strategy in women with disabilities and breast cancer"}, {"paperId": "6a6b553e9e3b63c4f685ed16e24d8ef9959e1269", "title": "Concatenated Modified LeNet Approach for Classifying Pneumonia Images"}, {"paperId": "cdefb95a74beedf57cf040be7eb396638ce6a8ff", "title": "Revolutionizing Breast Cancer Diagnosis: A Concatenated Precision through Transfer Learning in Histopathological Data Analysis"}, {"paperId": "db90e1222f968171ef120723f11042a92b66a492", "title": "Transformative Breast Cancer Diagnosis using CNNs with Optimized ReduceLROnPlateau and Early Stopping Enhancements"}, {"paperId": "3739c4aa3fb0e939cfaabf7d7cb1630f3bc35d15", "title": "Novel research and future prospects of artificial intelligence in cancer diagnosis and treatment"}, {"paperId": "e875ec3e3b9088eac1dbea4ed279cc903406552a", "title": "Improving sentiment analysis on PeduliLindungi comments: a comparative study with CNN-Word2Vec and integrated negation handling"}]}
