{"paperId": "14a579a38dc230db6ae38acbea8f1d59748cab2f", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Searching for Structure: Characterizing the Protein Conformational Landscape with Clustering-based Algorithms", "abstract": "The identification and characterization of the main conformations from a protein population is a challenging, inherently high-dimensional problem. We introduce the Secondary sTructural Ensembles with machine LeArning (StELa) double clustering method, which clusters protein structures based on the underlying Ramachandran plot. Our approach takes advantage of the relationship between the phi and psi dihedral angles in a protein backbone and the secondary structure of the protein. The classification of states as vectors composed of the clusters’ indices arising naturally from the Ramachandran plot, followed by the hierarchical clustering of the vectors, enables the identification of the minima from the corresponding free energy landscape (FEL) by lifting the high structure degeneracy found with existing approaches such as the RMSD-based clustering GROMOS. We compare the performance of StELa with not only GROMOS but also with CATS, the combinatorial averaged transient structure clustering method based on distributions of the phi and psi dihedral angle coordinates. Using ensembles of conformations from molecular dynamics (MD) simulations of either intrinsically disordered proteins (IDPs) of various lengths (tau protein fragments) or from local structures from a globular protein, we show that StELa is the only clustering method that identifies nearly all the minima from the corresponding FELs. In contrast, GROMOS yields a large number of clusters that cover the entire FEL and CATS, even with an additional clustering step, is unable to sample well the FEL for long IDPs and for fragments from globular proteins as it misses important minima. TOC Graphic", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Medicine", "Biology", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-15", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "91598724", "name": "Amanda C Macke"}, {"authorId": "2211022974", "name": "Jacob E Stump"}, {"authorId": "2152073793", "name": "M. S. Kelly"}, {"authorId": "2242997468", "name": "Jamie Rowley"}, {"authorId": "2243302617", "name": "Vageesha Herath"}, {"authorId": "2161761435", "name": "Sarah Mullen"}, {"authorId": "1821410", "name": "R. Dima"}], "citations": []}
