{"paperId": "14bb9e42eae9f2e4ca63c1b1b5d7507b15d50aeb", "publicationVenue": null, "title": "A strategy for predicting waste production and planning recycling paths in e-logistics based on improved EMD-LSTM.", "abstract": "With the rapid development of e-commerce, express delivery has been chosen and accepted by consumers, and a large number of express packages have resulted in serious waste of resources and environmental pollution. Because of the irregularity of online goods purchases by users in real life, logistics parks are unable to accurately judge the recycling needs of various regions. In order to solve this problem, we propose an improved empirical mode decomposition (IEMD) algorithm combined with a long-short-term memory (LSTM) network to deal with the addresses and categories in logistics data, analyze the distribution of recyclable logistics waste in the logistics park service area and in the express recycling station within the logistics park, judge the value of recyclable logistics waste, optimize the best path for recycling vehicles and improve the success rate of logistics waste recycling. In order to better research and verify the IEMD-LSTM prediction model, we model and simulate the algorithm behavior of the express waste packaging recycling prediction model system, and compare it with other classification methods through specific logistics data experiments. The prediction accuracy, stability and advantages of the four algorithms are analyzed and compared, and the application reliability of the algorithm proposed in this paper to the logistics waste recycling process is verified. The application in the actual express logistics packaging recycling case shows the feasibility and effectiveness of the waste recycling scheme proposed in this paper.", "venue": "Mathematical biosciences and engineering : MBE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-14", "journal": {"name": "Mathematical biosciences and engineering : MBE", "pages": "\n          17569-17588\n        ", "volume": "20 9"}, "authors": [{"authorId": "2214728070", "name": "Shujuan Liu"}, {"authorId": "2214285608", "name": "Hui Jin"}, {"authorId": "2213656019", "name": "Yanbiao Di"}], "citations": []}
