{"paperId": "14cad8da091eb57f4efa0bf859c7c80c0534d07b", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "Understanding and Optimizing Workloads for Unified Resource Management in Large Cloud Platforms", "abstract": "To fully utilize computing resources, cloud providers such as Google and Alibaba choose to co-locate online services with batch processing applications in their data centers. By implementing unified resource management policies, different types of complex computing jobs request resources in a consistent way, which can help data centers achieve global optimal scheduling and provide computing power with higher quality. To understand this new scheduling paradigm, in this paper, we first present an in-depth study of Alibaba's unified scheduling workloads. Our study focuses on the characterization of resource utilization, the application running performance, and scheduling scalability. We observe that although computing resources are significantly over-committed under unified scheduling, the resource utilization in Alibaba data centers is still low. In addition, existing resource usage predictors tend to make severe overestimations. At the same time, tasks within the same application behave fairly consistently, and the running performance of tasks can be well-profiled with respect to resource contention on the corresponding physical host. Based on these observations, in this paper, we design Optum, a unified data center scheduler for improving the overall resource utilization while ensuring good performance for each application. Optum formulates an optimization problem to schedule unified task requests, aiming to balance the trade-off between utilization and resource contention. Optum also implements efficient heuristics to solve the optimization problem in a scalable manner. Large-scale experiments demonstrate that Optum can save up to 15% of resources without performance degradation compared to state-of-the-art unified scheduling schemes.", "venue": "European Conference on Computer Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-05-08", "journal": {"name": "Proceedings of the Eighteenth European Conference on Computer Systems"}, "authors": [{"authorId": "1491233056", "name": "Chengzhi Lu"}, {"authorId": "2264817", "name": "Huanle Xu"}, {"authorId": "2576616", "name": "Kejiang Ye"}, {"authorId": "2166236", "name": "Guoyao Xu"}, {"authorId": "2117808384", "name": "Liping Zhang"}, {"authorId": "2190171642", "name": "Guodong Yang"}, {"authorId": "2167458317", "name": "Chengzhong Xu"}], "citations": [{"paperId": "dd37714491c3b778f1cbe83dda2c88ca4b9b0104", "title": "vPALs: Towards Verified Performance-aware Learning System For Resource Management"}, {"paperId": "b26c53faa9545069bc491b9c92f4a878ccb27eee", "title": "An Interference-aware Approach for Co-located Container Orchestration with Novel Metric"}, {"paperId": "46f9827e81e0d46d68f4a7d16cc62091ed1b2406", "title": "Lifting the Fog of Uncertainties: Dynamic Resource Orchestration for the Containerized Cloud"}]}
