{"paperId": "14d6b014ae7663f14796924de3b5f244c69f9865", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Predicting Entrepreneurial Intention of Students: Kernel Extreme Learning Machine with Boosted Crow Search Algorithm", "abstract": "College students are the group with the most entrepreneurial vitality and potential. How to cultivate their entrepreneurial and innovative ability is one of the important and urgent issues facing this current social development. This paper proposes a reliable, intelligent prediction model of entrepreneurial intentions, providing theoretical support for guiding college students’ positive entrepreneurial intentions. The model mainly uses the improved crow search algorithm (CSA) to optimize the kernel extreme learning machine (KELM) model with feature selection (FS), namely CSA-KELM-FS, to study entrepreneurial intention. To obtain the best fitting model and key features, the gradient search rule, local escaping operator, and levy flight mutation (GLL) mechanism are introduced to enhance the CSA (GLLCSA), and FS is used to extract the key features. To verify the performance of the proposed GLLCSA, it is compared with eight other state-of-the-art methods. Further, the GLLCSA-KELM-FS model and five other machine learning methods have been used to predict the entrepreneurial intentions of 842 students from the Wenzhou Vocational College in Zhejiang, China, in the past five years. The results show that the proposed model can correctly predict the students’ entrepreneurial intention with an accuracy rate of 93.2% and excellent stability. According to the prediction results of the proposed model, the key factors affecting the student’s entrepreneurial intention are mainly the major studied, campus innovation, entrepreneurship practice experience, and positive personality. Therefore, the proposed GLLCSA-KELM-FS is expected to be an effective tool for predicting students’ entrepreneurial intentions.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-07", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2175975117", "name": "Lingling Zhang"}, {"authorId": "2175530771", "name": "Yinjun Fu"}, {"authorId": "2112599708", "name": "Yan Wei"}, {"authorId": "2164995522", "name": "Huiling Chen"}, {"authorId": "2056989280", "name": "Chunyu Xia"}, {"authorId": "3142404", "name": "Zhennao Cai"}], "citations": [{"paperId": "8b9301e0a6482b9841074f0041d844c5ac2000c0", "title": "Predicting entrepreneurial intention in Colombian academics: a machine learning approach"}, {"paperId": "3a9891961a20010ee4db185b26c92f5323576aef", "title": "How to support innovative small firms? Bibliometric analysis and visualization of start-up incubation"}, {"paperId": "007d6e6be042e11559022f7a4141a7bb8701f5a1", "title": "Characterisation of Youth Entrepreneurship in Medellín-Colombia Using Machine Learning"}]}
