{"paperId": "14de4b9a78b54e6ef7f0b61ecaa2ecba663de63a", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "Characterizing the most effective scaffolding approaches in engineering and technology education: A clustering approach", "abstract": "This study indicates the most effective combinations of scaffolding features within computer science and technology education settings. It addresses the research question, “What combinations of scaffolding characteristics, contexts of use, and assessment levels lead to medium and large effect sizes among college‐ and graduate‐level engineering and technology learners?” To do so, studies in which scaffolding led to a medium or large effect size within the context of technology and engineering education were identified within a scaffolding meta‐analysis data set. Next, two‐step cluster analysis in SPSS 24 was used to identify distinct groups of scaffolding attributes tailored to learning computer science at the undergraduate and graduate levels. Input variables included different scaffolding characteristics, the context of use, education level, and effect size. There was an eight‐cluster solution: five clusters were associated with large effect size, two with medium effect size, and one with both medium and large effect size. The three most important predictors were the context in which scaffolding was used, if and how scaffolding is customized over time and the decision rules that govern scaffolding change. Notably, highly effective scaffolding clusters are associated with most levels of each predictor.", "venue": "Computer Applications in Engineering Education", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-22", "journal": {"name": "Computer Applications in Engineering Education", "pages": "1795 - 1812", "volume": "30"}, "authors": [{"authorId": "2203674", "name": "B. Belland"}, {"authorId": "1456032216", "name": "Eunseo Lee"}, {"authorId": "2090452256", "name": "A. Y. Zhang"}, {"authorId": "2336248", "name": "Chanmin Kim"}], "citations": [{"paperId": "3f0fc0ee27f14e146c280da574052de43e75094f", "title": "Recursive calculation of space multi body system dynamics based on data analysis"}]}
