{"paperId": "14e9d7a393e78edd3a393d5a090bf12bea14f640", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Applications of Clustering Methods for Different Aspects of Electric Vehicles", "abstract": "The growing penetration of electric vehicles can pose several challenges for power systems, especially distribution systems, due to the introduction of significant uncertain load. Analysis of these challenges becomes computationally expensive with higher penetration of electric vehicles due to various preferences, travel behavior, and the battery size of electric vehicles. This problem can be addressed using clustering methods which have been successfully used in many other sectors. Recently, there have been several studies published on applying clustering methods for various aspects of electric vehicles. To summarize the existing efforts and provide future research directions, this contribution presents a three-step analysis. First, the existing clustering methods, including hard and soft clustering, are discussed. Then, the recent literature on the application of clustering methods for different aspects of electric vehicles is reviewed. The review concentrates on four major aspects of electric vehicles: the behavior of the user, driving cycle, used batteries, and charging stations. Then, several representative studies are selected from each category and their merits and demerits are summarized. Finally, gaps in the existing literature are identified and directions for future research are presented. They indicate the need for further research on the impact on distribution circuits, charging infrastructure during emergencies, equity and disparity in rebate allocations, and the use of big data with cluster analysis to assist transportation network management.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-04", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2134419884", "name": "Masooma Nazari"}, {"authorId": "2082387968", "name": "Akhtar Hussain"}, {"authorId": "1730121", "name": "P. Musílek"}], "citations": [{"paperId": "b23b24266ee521f1043933d3cecf57c3a39a5e7a", "title": "Optimizing Electric Vehicle Charging Networks Using Clustering Technique"}, {"paperId": "07cb273269266832660bd109796e75949ef45839", "title": "A Comprehensive Literature Review on Artificial Dataset Generation for Repositioning Challenges in Shared Electric Automated and Connected Mobility"}, {"paperId": "47944944bcde746ec7f3e0862edd765d45394041", "title": "MixPCD: a novel method of constructing driving cycle for electric bus with sparse data"}, {"paperId": "21c33b76acf79ae84727a69cedbbfac56f754726", "title": "Developed Clustering Algorithms for Engineering Applications: A Review"}, {"paperId": "f378b5076c4430734be74a6972dffb35c97236c4", "title": "Energy management of buildings with energy storage and solar photovoltaic: A diversity in experience approach for deep reinforcement learning agents"}, {"paperId": "6285dff2febd11e0dbc5dad48a9c0ed3b13b6aea", "title": "Decision Trees in the Selection of Electric Vehicles Based on Various Parameters"}, {"paperId": "ccc662aaef9972a04723cf3125a6388f7aa13841", "title": "A novel clustering method with consistent data in a three-dimensional graphical format over existing clustering mechanisms"}, {"paperId": "5f5ea23c3bae7f2f406afb8f6cb511e6787b78c6", "title": "Artificial Dataset Generation for Modeling and Simulation of Shared Electric Automated and Connected Mobility Systems with Autonomous Repositioning: A Survey"}, {"paperId": "ff9efa7f278bf0d3afb12ad7003593b80030556b", "title": "An Extended Agglomerative Hierarchical Clustering Techniques"}, {"paperId": "e653fc2e0b2b34992536fff024fd4e6c1c6a1451", "title": "Model-Driven Developed Terminal for Remote Control of Charging Station for Electric Vehicles Powered by Renewable Energy"}, {"paperId": "fc1a461fb3df3aed52525e7df17936be2e51e08f", "title": "Influence of Different Data Interpolation Methods for Sparse Data on the Construction Accuracy of Electric Bus Driving Cycle"}]}
