{"paperId": "14f86269f987b67db871fe184fab8b6619f13c51", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Disaster and Pandemic Management Using Machine Learning: A Survey", "abstract": "This article provides a literature review of state-of-the-art machine learning (ML) algorithms for disaster and pandemic management. Most nations are concerned about disasters and pandemics, which, in general, are highly unlikely events. To date, various technologies, such as IoT, object sensing, UAV, 5G, and cellular networks, smartphone-based system, and satellite-based systems have been used for disaster and pandemic management. ML algorithms can handle multidimensional, large volumes of data that occur naturally in environments related to disaster and pandemic management and are particularly well suited for important related tasks, such as recognition and classification. ML algorithms are useful for predicting disasters and assisting in disaster management tasks, such as determining crowd evacuation routes, analyzing social media posts, and handling the post-disaster situation. ML algorithms also find great application in pandemic management scenarios, such as predicting pandemics, monitoring pandemic spread, disease diagnosis, etc. This article first presents a tutorial on ML algorithms. It then presents a detailed review of several ML algorithms and how we can combine these algorithms with other technologies to address disaster and pandemic management. It also discusses various challenges, open issues and, directions for future research.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-15", "journal": {"name": "Ieee Internet of Things Journal", "pages": "16047 - 16071", "volume": "8"}, "authors": [{"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "150331642", "name": "Vikas Hassija"}, {"authorId": "2118972710", "name": "Sakshi Gupta"}, {"authorId": "2055865930", "name": "Adit Goyal"}, {"authorId": "145837053", "name": "M. Guizani"}, {"authorId": "48440849", "name": "B. Sikdar"}], "citations": [{"paperId": "8f0cd42a9ea485293db8eec8bbffdc8af85d4390", "title": "Mapping Urban Floods via Spectral Indices and Machine Learning Algorithms"}, {"paperId": "f1ef7ea1287aebcf928d65a62ded7c1b861489b0", "title": "Evaluation of the Practicability of Internet of Things in Fighting Against COVID-19"}, {"paperId": "aec19c69530ffd6900aaa9ef2558bbc5d1a6fd29", "title": "An Autoregressive Transformer Model For Crisis Management Using Twitter Tweets"}, {"paperId": "cb815aa4223628f078df7639fd93d2e9ff3abcbd", "title": "Exploiting geospatial data of connectivity and urban infrastructure for efficient positioning of emergency detection units in smart cities"}, {"paperId": "67e213b54c4e2b8d1081cacda8a85b1bed251f26", "title": "A reinforcement learning-based routing algorithm for large street networks"}, {"paperId": "be9b3d441ecfc414afebff2e381cd11b1536ba44", "title": "Because Life Matters- A Disaster Management Web Application"}, {"paperId": "aab2482bb79f6ba19b1a37ec079997ccc5ce60af", "title": "Leveraging AI for Natural Disaster Management : Takeaways From The Moroccan Earthquake"}, {"paperId": "67c7b237b4e895cf7608bec8e571a00a5d04171b", "title": "Revolutionizing Healthcare Image Analysis in Pandemic-Based Fog-Cloud Computing Architectures"}, {"paperId": "53b4647d6448eace9e7b78a8658e501e119bb0a1", "title": "Leveraging machine learning algorithms for improved disaster preparedness and response through accurate weather pattern and natural disaster prediction"}, {"paperId": "08b0e19851fa3e7826fd4855da4f758d1289920f", "title": "Machine Learning in Disaster Management: Flood Control Management"}, {"paperId": "4a66961c5ae8072954d728aa265a8f4c2faf4677", "title": "Assessing the long-term impact of cascade hydropower development on the inundation patterns of floodplain wetlands."}, {"paperId": "fea29c1eff71a9c320fcda5106c5b2ac00654108", "title": "Early Detection of Earthquakes Using IoT and Cloud Infrastructure: A Survey"}, {"paperId": "ad6d2785f8e120c7cd1eb1c5c967aad91727de58", "title": "COVID‐19: A systematic review of prediction and classification techniques"}, {"paperId": "c2d78c7f3bac47dd7827de9e175ffc1cc6505727", "title": "Complementarity, Interoperability, and Level of Integration of Humanitarian Drones with Emerging Digital Technologies: A State-of-the-Art Systematic Literature Review of Mathematical Models"}, {"paperId": "3f9972398ba8dc3654d2cb6842be18d81977b27b", "title": "A machine learning approach to deal with ambiguity in the humanitarian decision making"}, {"paperId": "d3f8a4522fdb3eb924056c188aea4c8ba89f59dc", "title": "An integrated convolutional neural network and sorting algorithm for image classification and efficient flood disaster management"}, {"paperId": "10185336e4f50534f68fbf3f2b9a152765413a0a", "title": "A Smart Framework for Managing Natural Disasters Based on the IoT and ML"}, {"paperId": "e57b9b2a3f9e031b930fd2bdcc0487209b476140", "title": "LocateUAV: Unmanned Aerial Vehicle Location Estimation via Contextual Analysis in an IoT Environment"}, {"paperId": "7386c50d7342a9b6b6ac0913f09bc1fb4a5a0f1a", "title": "The prediction of disaster risk paths based on IECNN model"}, {"paperId": "ddac52628e45db777ecc866c45a6236149de44d0", "title": "Federated learning for smart cities: A comprehensive survey"}, {"paperId": "ce21a415785a9b2985f7df643c1e46f0cf84d10e", "title": "Support Systems of Clinical Decisions in the Triage of the Emergency Department Using Artificial Intelligence: The Efficiency to Support Triage"}, {"paperId": "91711f9f8fa486148052bd222c258682470a98b6", "title": "Bounding pandemic spread by heat spread"}, {"paperId": "04aaf2a2ab1b38f9a98cc8f19211bd345c59d476", "title": "Machine Learning for Emergency Management: A Survey and Future Outlook"}, {"paperId": "605b8ced549a2a08691ab2111572a7f58d0e11a0", "title": "Pre-disaster Management based Machine Learning, IoT and Big Data: Survey and future direction"}, {"paperId": "d90501762678e55b1fed04ed06eba87fec0db8e3", "title": "Indoor AR Navigation and Emergency Evacuation System Based on Machine Learning and IoT Technologies"}, {"paperId": "1d639e1b8c0720bfe45d306bb42b62dd845a4253", "title": "A review about COVID-19 in the MENA region: environmental concerns and machine learning applications"}, {"paperId": "f3c430011e7faf36a38f5e6803c673c0df30d212", "title": "Feature-Based Generalized Gaussian Distribution Method for NLoS Detection in Ultra-Wideband (UWB) Indoor Positioning System"}, {"paperId": "8fce12e02bb974155f03c80fda53332ee6744183", "title": "Diagnosing COVID-19 using artificial intelligence: a comprehensive review"}, {"paperId": "7d2b944c6361cc4486558d1725138f698965aacc", "title": "GaLeNet: Multimodal Learning for Disaster Prediction, Management and Relief"}, {"paperId": "5ec5229bdfce87d122c2b738c09ae6999e656d71", "title": "Machine learning security attacks and defense approaches for emerging cyber physical applications: A comprehensive survey"}, {"paperId": "cac87c75f6553ce0630cf599d4f5bd77252202ad", "title": "BACKM-EHA: A Novel Blockchain-enabled Security Solution for IoMT-based E-healthcare Applications"}, {"paperId": "44f875f9b32138f78e71adc06949251371d57d41", "title": "Artificial intelligence-assisted blockchain-based framework for smart and secure EMR management"}, {"paperId": "a1dbfa5800ccc90988d90c9e9feb5d6b217b6577", "title": "A review on Virtual Reality and Augmented Reality use-cases of Brain Computer Interface based applications for smart cities"}, {"paperId": "836be235652b9fd147130ec984af479fcf57ba52", "title": "A machine learning and blockchain based secure and cost-effective framework for minor medical consultations"}, {"paperId": "bad514ab8604b283410720605e04700190dcfb31", "title": "Role of machine learning and deep learning in securing 5G-driven industrial IoT applications"}, {"paperId": "46105f340a30a406d8bce4e7bb49962a80f41a4f", "title": "Does COVID-19 Clinical Status Associate with Outcome Severity? An Unsupervised Machine Learning Approach for Knowledge Extraction"}, {"paperId": "3b8063fd964eabffe2a88ab6a501011ab6455f1d", "title": "A Comprehensive Survey of Emergency Communication Network and Management"}, {"paperId": "9d1ea71b6d76d65e9f14d4b77481c7cd6c2f92a5", "title": "Smart healthcare IoT applications based on fog computing: architecture, applications and challenges"}, {"paperId": "3958ab160d19c070a06d2fb0c54a43275d31671e", "title": "Applications of Technological Solutions in Primary Ways of Preventing Transmission of Respiratory Infectious Diseases—A Systematic Literature Review"}, {"paperId": "b2d434c73f2d6afc4de83249e8197fcb49de0339", "title": "Enabling Artificial Intelligence for Genome Sequence Analysis of COVID-19 and Alike Viruses"}, {"paperId": "6bfc6c0569a000d986dfad9d54975d5b035916e9", "title": "Blockchain-Empowered Edge Intelligence for Internet of Medical Things Against COVID-19"}, {"paperId": "f7da9f293cbaa20ca89b4e78e6a376c7f02f1668", "title": "Fast, Reliable, and Secure Drone Communication: A Comprehensive Survey"}, {"paperId": "933b385cab9f1ae0e58e34ea8339b21ffe66facd", "title": "AI-enabled remote monitoring of vital signs for COVID-19: methods, prospects and challenges"}, {"paperId": "26d74e7657ce2a97fe797a6f34577940886da00b", "title": "Battling COVID-19 using machine learning: A review"}, {"paperId": "aed5dfba5a1452bd59dc3327ff08cb3a436b5eb5", "title": "The Short Video Popularity Prediction Using Internet of Things and Deep Learning"}, {"paperId": "8058b342b03f4a2a207ae12c37932cb11ec10da7", "title": "Exploring the Potential of Metaverse Technology in Healthcare: Applications, Challenges, and Future Directions"}, {"paperId": "6a6e3e18bbdea20f4f18eb4c2f04375856826b53", "title": "COMPARATIVE STUDY OF AUTOENCODER AND DENSENET – 121 IN CRIME PREDICTION"}, {"paperId": "ebc72c188a709e78fc40a2d5537caef3dce03649", "title": "Internet of Things Applications for Saving Energy"}, {"paperId": "395aad5ec8f591913253f531c979f56fc3029d2d", "title": "Healthcare in Metaverse: A Survey on Current Metaverse Applications in Healthcare"}, {"paperId": "b7d5230aca99ce71126365dd9d0cb3d892c27417", "title": "A Review on the Role of Machine Learning in Enabling IoT Based Healthcare Applications"}, {"paperId": "d765a7b311f71b991c5cc0b7f58d03e777420937", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "dca5898a67f89390a825aaf1ccfb929dc0d000fc", "title": "Prediction of poverty as a consequence of climate change impacts using deep learning: A review"}, {"paperId": "0e00dbdcde54a52849d5f4bac82fad9077d9ea80", "title": "EXPLORING MACHINE LEARNING AND DEEP LEARNING APPROACHES FOR DISASTER PREDICTION AND MANAGEMENT: A SURVEY OF DIFFERENT APPROACHES"}]}
