{"paperId": "14fe35149aed6a47b6ebfd207deb7681b9446bb6", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Urban Planning and Smart City Decision Management Empowered by Real-Time Data Processing Using Big Data Analytics", "abstract": "The Internet of Things (IoT), inspired by the tremendous growth of connected heterogeneous devices, has pioneered the notion of smart city. Various components, i.e., smart transportation, smart community, smart healthcare, smart grid, etc. which are integrated within smart city architecture aims to enrich the quality of life (QoL) of urban citizens. However, real-time processing requirements and exponential data growth withhold smart city realization. Therefore, herein we propose a Big Data analytics (BDA)-embedded experimental architecture for smart cities. Two major aspects are served by the BDA-embedded smart city. Firstly, it facilitates exploitation of urban Big Data (UBD) in planning, designing, and maintaining smart cities. Secondly, it occupies BDA to manage and process voluminous UBD to enhance the quality of urban services. Three tiers of the proposed architecture are liable for data aggregation, real-time data management, and service provisioning. Moreover, offline and online data processing tasks are further expedited by integrating data normalizing and data filtering techniques to the proposed work. By analyzing authenticated datasets, we obtained the threshold values required for urban planning and city operation management. Performance metrics in terms of online and offline data processing for the proposed dual-node Hadoop cluster is obtained using aforementioned authentic datasets. Throughput and processing time analysis performed with regard to existing works guarantee the performance superiority of the proposed work. Hence, we can claim the applicability and reliability of implementing proposed BDA-embedded smart city architecture in the real world.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "7992672", "name": "Bhagya Nathali Silva"}, {"authorId": "2109215851", "name": "Murad Khan"}, {"authorId": "2703536", "name": "Changsu Jung"}, {"authorId": "2111508316", "name": "Jihun Seo"}, {"authorId": "51455282", "name": "Diyan Muhammad"}, {"authorId": "1845785166", "name": "Jihun Han"}, {"authorId": "3310138", "name": "Yongtak Yoon"}, {"authorId": "152742012", "name": "K. Han"}], "citations": [{"paperId": "bb256fd7ffb3de5858cd56ea29364c1ce8e98e9d", "title": "Who built Songdo, the “world’s first smart city?” questioning technology firms’ ability to lead smart city development"}, {"paperId": "082174fb8d992bf355fb6165eb8b1d9de6ebe8d6", "title": "Transformation of Buildings and Urban Spaces to Adapt for Future Mobility: A Systematic Literature Review"}, {"paperId": "14a0d9fd93233dd539b51bad072fc6031b831784", "title": "Sustainable, inclusive city-making through smart, playable environments: developing and testing the CO2rdinates pervasive mobile game"}, {"paperId": "9d401815fbc6cb0e46fa6af0b467f2d57b93f265", "title": "Fault detection research of smart microgrid based on convolutional neural network"}, {"paperId": "e554a2b4e5eff05da38e351a7e6bdf448259be52", "title": "A novel Edge architecture and solution for detecting concept drift in smart environments"}, {"paperId": "6d9cc037d67ecfc9ab353f56aeca25a3ebb854f2", "title": "Readiness of urban design projects for integration with big data. Case study: humanizing neighborhoods initiative—KSA"}, {"paperId": "6401c16e2bda63405bbcd7c26e16ed43477e4d83", "title": "A conceptual digital twin framework for city logistics"}, {"paperId": "9cf612f3f097917faef9644d68bb62fc56739812", "title": "Application of Time Series Database for IoT Smart City Platform"}, {"paperId": "0ab8009d39990b2fc136f0ea1cc888e1d8948e08", "title": "Spiking Equilibrium Convolutional Neural Network for Spatial Urban Ontology"}, {"paperId": "4643b345bf71926413a43a66b0f3611871664d9a", "title": "Visual Aid Systems from Smart City to Improve the Life of People with Low Vision"}, {"paperId": "8bc5223a21b56a11e8c761572755ed00425186da", "title": "Prediction of Smart Building and Smart City Resources using AI-techniques"}, {"paperId": "3539844ca9285344d32b9291219c71774c23aedc", "title": "A Practical Yet Accurate Real-Time Statistical Analysis Library for Hydrologic Time-Series Big Data"}, {"paperId": "ddac52628e45db777ecc866c45a6236149de44d0", "title": "Federated learning for smart cities: A comprehensive survey"}, {"paperId": "35dfdb65d998270b37ea75d65d1ee89f8071d146", "title": "Novel Use of Social Media Big Data and Artificial Intelligence for Community Resilience Assessment (CRA) in University Towns"}, {"paperId": "901c3d8c8a574d480c0e0d224feda502f12c8db9", "title": "Evaluation of product conceptual design based on Pythagorean fuzzy set under big data environment"}, {"paperId": "57721e5abc1e668133f8dcf5bd5c36c1ca1ac794", "title": "A systematic framework for the complex system engineering of city data governance"}, {"paperId": "cc16cccbcb837ef8c30ed4189db25690d70e4fef", "title": "A comprehensive and systematic literature review on the big data management techniques in the internet of things"}, {"paperId": "1edf9675f1305264ef5d8599b295ebe3a55c4a0f", "title": "The kind of problem a smart city is"}, {"paperId": "1445e09194bda3eabfb2aa20eee889e83987171e", "title": "The Theoretical, Practical, and Technological Foundations of the 15-Minute City Model: Proximity and Its Environmental, Social and Economic Benefits for Sustainability"}, {"paperId": "3e6d223e0a0442770f94c91c1daa3e838ed95a97", "title": "Smart city re-imagined: City planning and GeoAI in the age of big data"}, {"paperId": "b7d162a3e4c1be96c25ecb3362fc073b38748f4a", "title": "Transforming healthcare with big data analytics: technologies, techniques and prospects"}, {"paperId": "011c4c415a99465d1d643d4f3f5371f3d885637c", "title": "Edge AI and Blockchain for Smart Sustainable Cities: Promise and Potential"}, {"paperId": "101741e2d5e657e0ffbed4fb1253525fe9d716ce", "title": "Big Data-Driven Urban Management: Potential for Urban Sustainability"}, {"paperId": "bfc8a29fe76bfe515f391302ff5e6b255b6db61e", "title": "SmartAirQ: A Big Data Governance Framework for Urban Air Quality Management in Smart Cities"}, {"paperId": "e556e50e392af61c04163e9b085c37a78f39d1b9", "title": "The impact of Big Data Analytics in Developing Strategic Performance using Balanced Scorecard: A Field Study in Egypt"}, {"paperId": "3bb89d2fc357e9f1bfa757dd6cea998898679402", "title": "Using a deep learning model to quantify trash accumulation for cleaner urban stormwater"}, {"paperId": "7551ad363ac0a90cd4283a6a4cf8493f09260e8d", "title": "Intelligent Community Management System Based on Big Data Technology"}, {"paperId": "6841bd9503629ba64540e75dfab13f6b1cc691ab", "title": "Identification of Stunting Disease using Anthropometry Data and Long Short-Term Memory (LSTM) Model"}, {"paperId": "a7b0e63289c212996f77ea9a1232933cce671cda", "title": "Data-driven smart eco-cities and sustainable integrated districts: A best-evidence synthesis approach to an extensive literature review"}, {"paperId": "c5b009ca7d74d2b2fa7fbe3e3c6fa4557bfa56f5", "title": "A Conceptual and Systematics for Intelligent Power Management System-Based Cloud Computing: Prospects, and Challenges"}, {"paperId": "b7a05e7b030c6476193a8c64852c3de7214b7adf", "title": "Akıllı Şehir Uygulamaları İçin Prosedürel 3B Kent Modeli Oluşturulması ve Fotorealistik 3B Görselleştirme"}, {"paperId": "9a7476bc059b9a371473434348d71dfa6d7eaf88", "title": "Data-Driven Smart Eco-Cities of the Future: An Empirically Informed Integrated Model for Strategic Sustainable Urban Development"}, {"paperId": "8fcd3cce279dcc7d72e45d85b16b7e866f1c3f20", "title": "Extraction of urban built-up area based on the fusion of night-time light data and point of interest data"}, {"paperId": "449915415f8281b850bc0035cc401dac2a50e23b", "title": "Risk Assessment and Prediction of COVID-19 Based on Epidemiological Data From Spatiotemporal Geography"}, {"paperId": "7e40ee480f1d0e0c230266b055b33855a18ce2ad", "title": "Urban Development and Sustainable Utilization: Challenges and Solutions"}, {"paperId": "15081c942decade73cdf2920570be7c955d19e41", "title": "Data-driven smart sustainable cities of the future: urban computing and intelligence for strategic, short-term, and joined-up planning"}, {"paperId": "e88bf09cfa130c513a617cf656b18403501d314d", "title": "Implementation of a Virtual Assistant for the Academic Management of a University with the Use of Artificial Intelligence"}, {"paperId": "ff77909836e55383a703e740ad07bc3e9bbca654", "title": "The utility of Google Trends as a tool for evaluating flooding in data‐scarce places"}, {"paperId": "05d43a44460a68c1a58f3d55d162dfb67e40d811", "title": "Data-driven smart sustainable cities of the future: An evidence synthesis approach to a comprehensive state-of-the-art literature review"}, {"paperId": "d00ec1e3de4b10b0814addcb14ce1527cc36b973", "title": "Smart Cities and Big Data Analytics: A Data-Driven Decision-Making Use Case"}, {"paperId": "84e41a6378a5b2b0dfaa05845561b1e6e46001f9", "title": "Metadata-based measurements transmission verified by a Merkle Tree"}, {"paperId": "ce045deb2c8d322c844182eff537f93090093310", "title": "A framework to simplify pre-processing location-based social media big data for sustainable urban planning and management"}, {"paperId": "b2978f6ffb2f6765fe6ffa81d64fabef50ec6ed0", "title": "Holistic big data integrated artificial intelligent modeling to improve privacy and security in data management of smart cities"}, {"paperId": "49677662eec895a5bb5300a405e9920abd8d7867", "title": "Structure and Nodal Points of Smart City Infrastructure"}, {"paperId": "098e6b1770cb5223a34a42798c55a3c266033615", "title": "An integrated fire detection system using IoT and image processing technique for smart cities"}, {"paperId": "aadcfe8a5556d0950bd128e9c4bda64bc7858c36", "title": "Scheduling Sensor Duty Cycling Based on Event Detection Using Bi-Directional Long Short-Term Memory and Reinforcement Learning"}, {"paperId": "f40b438d7680fd9445b8aa14204a7679bc8aa294", "title": "East Village at Knutsford: A Case Study in Sustainable Urbanism"}, {"paperId": "c8b201a5e7973d5fb3dd5d4d038ae143a5bd07a2", "title": "Futuristic Sustainable Energy Management in Smart Environments: A Review of Peak Load Shaving and Demand Response Strategies, Challenges, and Opportunities"}, {"paperId": "fd5f5ebf8ec71ef9c81fb1ef5ee29d3fb8d2bf5e", "title": "Research on the relationship between Urban economic development level and urban spatial structure—A case study of two Chinese cities"}, {"paperId": "b8d2707ed7657c6ffc7c97052e9ec18582ea280b", "title": "Big Data Analytics in Australian Local Government"}, {"paperId": "3dcd03da78dab23a1762ce650481188774430572", "title": "Application of Web 3D GIS to Display Urban Model and Solar Energy Analysis using The Unmanned Aerial Vehicle (UAV) Data (Case Study: National Cheng Kung University Buildings)"}, {"paperId": "aeba0f242318ff49973823374b4b500465b3d49f", "title": "A Multi-Objective Approach for Optimal Energy Management in Smart Home Using the Reinforcement Learning"}, {"paperId": "52cabfe90c5ac0aeba923cd34064d7cc93827297", "title": "Traffic clustering algorithm of urban data brain based on a hybrid-augmented architecture of quantum annealing and brain-inspired cognitive computing"}, {"paperId": "557bcd776557f2d91b2b2eeb08b219ce4e301566", "title": "The Evolutionary Game for Collaborative Innovation of the IoT Industry under Government Leadership in China: An IoT Infrastructure Perspective"}, {"paperId": "497a0037100709539df68d2b0f12edc25468ed1f", "title": "Vehicular Adhoc Networks Protocol to Avoid Traffic Signal Delay"}, {"paperId": "3c30f2626b1ee1d6868c3ebc151f1233d3b93889", "title": "Decision management"}, {"paperId": "94ea2fd76202f2cda13105cc5f81a56a7a88b1e5", "title": "Big data driven multi-tier architecture for electric mobility as a service in smart cities"}, {"paperId": "685d8dceb2bc78d08588efc0e88ae80f17f2bb84", "title": "Big Data analytics and IoT in Operation safety management in Under Water Management"}, {"paperId": "fc169a6b4fe37966e151cf060ce7b63ee032e1ad", "title": "EPO: An Optimization technique for Urban Traffic Management While Limiting the Pollution using WSN"}, {"paperId": "69fee92ec50ae676276e2b2d2d02d2288f2acac2", "title": "In support of sustainable densification in urban planning: a proposed framework for utilising CCTV for propagation of human energy from movement within urban spaces"}, {"paperId": "b945425a1e4f35cd4f4c2099ffd1aafd3bd1b487", "title": "The Role of Cloud Computing in Smart Cities"}, {"paperId": "75195a71e319ce7a62966ad929365248a469130c", "title": "Smart Energy Transition: An Evaluation of Cities in South Korea"}, {"paperId": "355f2e5901d31fe22594bf1d8cecead117212c40", "title": "API deployment for big data management towards sustainable energy prosumption in smart cities-a layered architecture perspective"}, {"paperId": "6335235fc0e313d54e59c168a5efb263d27fa96f", "title": "A Big-Data-Analytics System for Supporting Decision Making Processes in Complex Smart-City Applications"}, {"paperId": "8a7bbbd7ab460c740e10dd623775b1cc67e671bf", "title": "Flexible Querying and Analytics for Smart Cities and Smart Societies in the Age of Big Data: Overview of the FQAS 2019 International Conference"}, {"paperId": "d7b25e08097356250cd7ede3bd3e629806e138a1", "title": "Application of a Smart City Model to a Traditional University Campus with a Big Data Architecture: A Sustainable Smart Campus"}, {"paperId": "5d1aa8aba0206c1aa04454fe60658e93baf48fea", "title": "People-Centric Service Intelligence for Smart Cities"}, {"paperId": "2d02a33c1f32e7c9e87737befecdbe60b503f140", "title": "Shaping India's Future by Building Smart Future Sustainable Cities"}, {"paperId": "449a3558258608e263454d4751ed59963729e778", "title": "Big Data Analytics"}, {"paperId": "be4de48f2e1f0595f373a89ca79c09ca028dec7a", "title": "Development of smart building for better building management in the era of industrial revolution 4.0"}, {"paperId": "84bc8dc14ee53edd7ca5cdd185018045802ca795", "title": "Dynamic TWGH: Client-Server Optimization for Scalable Combinatorial Test Suite Generation"}, {"paperId": "9fd26287d720315f880b26e4555aaf3157da4932", "title": "Defining Urban Big Data in Urban Planning: Literature Review"}, {"paperId": "7c0b40616b554ea182e8ae24556d03a8e9964408", "title": "Adoption of Service-Oriented Architecture for Biophilic Service Provisioning Processes:Limitations and Possibilities"}, {"paperId": "e6f7761a1dd5a417c0d27c64c2f7f252dac88142", "title": "Data-Driven Urban Management and its Impact on Upgradation of Slums in Islamabad, Pakistan: Mediating Role of Privacy and Security Concerns"}, {"paperId": "03eeb5dc43778c77a7f7eb4772e9506fbf39fc00", "title": "Characteristics and Trends in Big Data for Service Operations Management Research: A Blend of Descriptive Statistics and Bibliometric Analysis"}, {"paperId": "8486484bf53d626015975795627ac30566e0926c", "title": "A Sustainable Development Neural Network Model for Big Data in Smart Cities"}, {"paperId": "badfe56ebd7348a8654365aacb162ec4c84368af", "title": "Intelligent platform for real-time page view statistics using educational big data digital resource sharing"}, {"paperId": "2df8787195815871e2aed45a94e119edc2f1806e", "title": "Big Data Governance, Technology, and Implementation in Climate-Resilient Societies"}, {"paperId": "db0c4a345cdc1fe04845f7a1f3f0229164c29bc1", "title": "Big Data for Smart Cities and Smart Villages: A Review"}, {"paperId": "b7026666dfa595417ebd5be9df396c7037b93c4f", "title": "Selection of Effective Methods of Big Data Analytical Processing in Information Systems of Smart Cities"}, {"paperId": "83d1f0e0f6f5c21c77928e48a5332087848eb4f5", "title": "Smart cities in collaboration with the internet of things"}, {"paperId": "aa83aa72f778d0094fbcd22148136dcc8f7e2fbf", "title": "Flexible Query Answering Systems: 13th International Conference, FQAS 2019, Amantea, Italy, July 2–5, 2019, Proceedings"}, {"paperId": "1048f3b27d07e7e4164d9c28e66235774848a700", "title": "Sustainable Services to Enhance Flexibility in the Upcoming Smart Grids"}, {"paperId": "5a5d111af28b1d267b1f7bae8d29539491d51324", "title": "Housing Digital Built Britain Network"}]}
