{"paperId": "1509d8498e09a449918790cc1d6a239a2aef049e", "publicationVenue": {"id": "159aed30-148b-4b50-99a4-372b0af958d9", "name": "International Symposium on Computers and Communications", "type": "conference", "alternate_names": ["ISCC", "Int Symp Comput Commun"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000156/all-proceedings"}, "title": "On the Applicability of Secret Share Algorithms for Osmotic Computing", "abstract": "Osmotic Computing (OC) is an innovative computation paradigm that runs services on Cloud, Edge, and Internet of Things (IoT) resources based on their workload. Services are encapsulated in container images stored into a central repository on the Cloud. OC suffers from privacy and security issues, for example, hackers could attack the repository and download all container images. Furthermore, network latency could delay the deployment of services in Edge nodes. A possible solution to solve such problems is to employ Secret Share techniques to split the images of services into chunks and distribute them among Edge devices. This work aims at assessing the applicability of these techniques for OC employing the Redundant Residue Number System (RRNS) to split and store Micro-Elements (MELs). We made our analyses for different OC scenarios composed of 10, 100 and 1000 nodes running 1000 MELs each. Furthermore, we considered several degrees of redundancy from 0 to 7. From experimental analyses, we found that the reliability of the system increase with the increasing of the redundancy but the security decreases.", "venue": "International Symposium on Computers and Communications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE Symposium on Computers and Communications (ISCC)", "pages": "1-6"}, "authors": [{"authorId": "5686057", "name": "A. Galletta"}, {"authorId": "143806018", "name": "M. Fazio"}, {"authorId": "1790992", "name": "A. Celesti"}, {"authorId": "1809861", "name": "M. Villari"}], "citations": [{"paperId": "b0d44b383931f9616c3cf332dec2807d7cb38272", "title": "Investigating the Applicability of Nested Secret Share for Drone Fleet Photo Storage"}, {"paperId": "033958f1cae4bbaa813ec6765f9e5a8b290dd40b", "title": "An Efficient Physiological Record System Using Osmotic Computing Paradigm"}, {"paperId": "d0eb66f02b9fad28637e06b8efc281c9a1189ccc", "title": "An efficient edge computing management mechanism for sustainable smart cities"}, {"paperId": "ac2b779f38a44e0859fa7fa39300b58668580ccd", "title": "An Osmotic Computing Enabled Domain Naming System (OCE-DNS) for distributed service relocation between cloud and edge"}]}
