{"paperId": "150bbb7d40f735e048a6f2d43f1bf4fef19ad888", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "DeepHealthNet: Adolescent Obesity Prediction System Based on a Deep Learning Framework", "abstract": "The global prevalence of childhood and adolescent obesity is a major concern due to its association with chronic diseases and long-term health risks. Artificial intelligence technology has been identified as a potential solution to accurately predict obesity rates and provide personalized feedback to adolescents. This study highlights the importance of early identification and prevention of obesity-related health issues. To develop effective algorithms for the prediction of obesity rates and provide personalized feedback, factors such as height, weight, waist circumference, calorie intake, physical activity levels, and other relevant health information must be taken into account. Therefore, by collecting health datasets from 321 adolescents who participated in Would You Do It! application, we proposed an adolescent obesity prediction system that provides personalized predictions and assists individuals in making informed health decisions. Our proposed deep learning framework, DeepHealthNet, effectively trains the model using data augmentation techniques, even when daily health data are limited, resulting in improved prediction accuracy (acc: 0.8842). Additionally, the study revealed variations in the prediction of the obesity rate between boys (acc: 0.9320) and girls (acc: 0.9163), allowing the identification of disparities and the determination of the optimal time to provide feedback. Statistical analysis revealed that the performance of the proposed deep learning framework was more statistically significant (p$< $0.001) compared to the other general models. The proposed system has the potential to effectively address childhood and adolescent obesity.", "venue": "IEEE journal of biomedical and health informatics", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-28", "journal": {"name": "IEEE Journal of Biomedical and Health Informatics", "pages": "2282-2293", "volume": "28"}, "authors": [{"authorId": "2804094", "name": "Ji-Hoon Jeong"}, {"authorId": "1811419765", "name": "Inggeol Lee"}, {"authorId": "2124836570", "name": "Sung-Kyung Kim"}, {"authorId": "40147853", "name": "Tae-Eui Kam"}, {"authorId": "2234854986", "name": "Seong-Whan Lee"}, {"authorId": "1388846779", "name": "E. Lee"}], "citations": []}
