{"paperId": "15191c6b7ce75af6e6d71d55ccde98ec91d37a28", "publicationVenue": {"id": "13925159-5423-4d57-9ac9-3a05a713e0ef", "name": "ACM Transactions on Embedded Computing Systems", "type": "journal", "alternate_names": ["ACM Transactions in Embedded Computing Systems", "ACM Trans Embed Comput Syst"], "issn": "1539-9087", "url": "http://www.acm.org/pubs/contents/journals/tecs/", "alternate_urls": ["http://www.acm.org/tecs/", "http://portal.acm.org/tecs"]}, "title": "Rethinking the Interactivity of OS and Device Layers in Memory Management", "abstract": "In the big data era, a huge number of services has placed a fast-growing demand on the capacity of DRAM-based main memory. However, due to the high hardware cost and serious leakage power/energy consumption, the growth rate of DRAM capacity cannot meet the increased rate of the required main memory space when the energy or hardware cost is a critical concern. To tackle this issue, hybrid main-memory devices/modules have been proposed to replace the pure DRAM main memory with a hybrid main memory module that provides a large main memory space by integrating a small-sized DRAM and a large-sized non-volatile memory (NVM) into the same memory module. Although NVMs have high-density and low-cost features, they suffer from the low read/write performance and low endurance issue, compared to DRAM. Thus, inside the hybrid main-memory module, it also includes a memory management design to use DRAM as the cache of NVMs to enhance its performance and lifetime. However, it also introduces new design challenges in both the OS and the memory module. In this work, we rethink the interactivity of OS and hybrid main-memory module, and propose a cross-layer cache design that (1) utilizes the information from the operating system to optimize the hit ratio of the DRAM cache inside the memory module, and (2) takes advantage of the bulk-size (or block-based) read/write feature of NVM to minimize the time overhead on the data movement between DRAM and NVM. At the same time, this cross-layer cache design is very lightweight and only introduces limited runtime management overheads. A series of experiments was conducted to evaluate the effectiveness of the proposed cross-layer cache design. The results show that the proposed design could improve access performance for up to 88%, compared to the investigated well-known page replacement algorithms.", "venue": "ACM Transactions on Embedded Computing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-31", "journal": {"name": "ACM Transactions on Embedded Computing Systems (TECS)", "pages": "1 - 21", "volume": "21"}, "authors": [{"authorId": "1934860222", "name": "Tse-Yuan Wang"}, {"authorId": "3218732", "name": "Chun-Feng Wu"}, {"authorId": "1996863", "name": "Che-Wei Tsao"}, {"authorId": "3248884", "name": "Yuan-Hao Chang"}, {"authorId": "145348862", "name": "Tei-Wei Kuo"}, {"authorId": "2163745826", "name": "Xue Liu"}], "citations": []}
