{"paperId": "151cffd523256c04b154a752133fbe4e51640835", "publicationVenue": null, "title": "Revealing intra-urban hierarchical spatial structure through representation learning by combining road network abstraction model and taxi trajectory data", "abstract": "ABSTRACT The unprecedented urbanization in China has dramatically changed the urban spatial structure of cities. With the proliferation of individual-level geospatial big data, previous studies have widely used the network abstraction model to reveal the underlying urban spatial structure. However, the construction of network abstraction models primarily focuses on the topology of the road network without considering individual travel flows along with the road networks. Individual travel flows reflect the urban dynamics, which can further help understand the underlying spatial structure. This study therefore aims to reveal the intra-urban hierarchical spatial structure by integrating the road network abstraction model and individual travel flows. To achieve this goal, we 1) quantify the spatial interaction relatedness of road segments based on the Word2Vec model using large volumes of taxi trip data, then 2) characterize the road abstraction network model according to the identified spatial interaction relatedness, and 3) implement a community detection algorithm to reveal sub-regions of a city. Our results reveal three levels of hierarchical spatial structures in the Wuhan metropolitan area. This study provides a data-driven approach to the investigation of urban spatial structure via identifying traffic interaction patterns on the road network, offering insights to urban planning practice and transportation management.", "venue": "Ann. GIS", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-30", "journal": {"name": "Annals of GIS", "pages": "499 - 516", "volume": "29"}, "authors": [{"authorId": "2122825231", "name": "Sheng Hu"}, {"authorId": "2112170676", "name": "Song Gao"}, {"authorId": "2087751891", "name": "W. Luo"}, {"authorId": "2109487346", "name": "Liang Wu"}, {"authorId": "2189505611", "name": "Tianqi Li"}, {"authorId": "1837647", "name": "Yongyang Xu"}, {"authorId": "2116463016", "name": "Ziwei Zhang"}], "citations": [{"paperId": "ac94d1902a1f46a72f3e17721226aa4602c84a26", "title": "A multimodal data fusion model for accurate and interpretable urban land use mapping with uncertainty analysis"}, {"paperId": "ab7becf89d26eae055f8c22c84c097d2ae46707f", "title": "Jointly spatial-temporal representation learning for individual trajectories"}]}
