{"paperId": "15238075da587c6204ecca73f86684a0299ec313", "publicationVenue": {"id": "5e9e1f61-bcfc-411d-833a-75b5a439d61f", "name": "International journal of language and communication disorders", "type": "journal", "alternate_names": ["Int j lang commun disord", "Int J Lang  Commun Disord", "International Journal of Language & Communication Disorders"], "issn": "1368-2822", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1460-6984", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/14606984", "http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291460-6984"]}, "title": "Speech changes in old age: Methodological considerations for speech-based discrimination of healthy ageing and Alzheimer's disease.", "abstract": "BACKGROUND\nRecent evidence suggests that speech substantially changes in ageing. As a complex neurophysiological process, it can accurately reflect changes in the motor and cognitive systems underpinning human speech. Since healthy ageing is not always easily discriminable from early stages of dementia based on cognitive and behavioural hallmarks, speech is explored as a preclinical biomarker of pathological itineraries in old age. A greater and more specific impairment of neuromuscular activation, as well as  a specific cognitive and linguistic impairment in dementia, unchain discriminating changes in speech. Yet, there is no consensus on such discriminatory speech parameters, neither on how they should be elicited and assessed.\n\n\nAIMS\nTo provide a state-of-the-art on speech parameters that allow for early discrimination between healthy and pathological ageing; the aetiology of these parameters; the effect of the type of experimental stimuli on speech elicitation and the predictive power of different speech parameters; and the most promising methods for speech analysis and their clinical implications.\n\n\nMETHODS & PROCEDURES\nA scoping review methodology is used in accordance with the PRISMA model. Following a systematic search of PubMed, PsycINFO and CINAHL, 24 studies are included and analysed in the review.\n\n\nMAIN CONTRIBUTION\nThe results of this review yield three key questions for the clinical assessment of speech in ageing. First, acoustic and temporal parameters are more sensitive to changes in pathological ageing and, of these two, temporal variables are more affected by cognitive impairment. Second, different types of stimuli can trigger speech parameters with different degree of accuracy for the discrimination of clinical groups. Tasks with higher cognitive load are more precise in eliciting higher levels of accuracy. Finally, automatic speech analysis for the discrimination of healthy and pathological ageing should be improved for both research and clinical practice.\n\n\nCONCLUSIONS & IMPLICATIONS\nSpeech analysis is a promising non-invasive tool for the preclinical screening of healthy and pathological ageing. The main current challenges of speech analysis in ageing are the automatization of its clinical assessment and the consideration of the speaker's cognitive background during evaluation.\n\n\nWHAT THIS PAPER ADDS\nWhat is already known on the subject Societal aging  goes hand in hand with the rising incidence of ageing-related neurodegenerations, mainly Alzheimer's disease (AD). This is particularly noteworthy in countries with longer life expectancies. Healthy ageing and early stages of AD share a set of cognitive and behavioural characteristics. Since there is no cure for dementias, developing methods for accurate discrimination of healthy ageing and early AD is currently a priority. Speech has been described as one of the most significantly impaired features in AD. Neuropathological alterations in motor and cognitive systems would underlie specific speech impairment in dementia. Since speech can be evaluated quickly, non-invasively and inexpensively, its value for the clinical assessment of ageing itineraries may be particularly high. What this paper adds to existing knowledge Theoretical and experimental advances in the assessment of speech as a marker of AD have developed rapidly over the last decade. Yet, they are not always known to clinicians. Furthermore, there is a need to provide an updated state-of-the-art on which speech features are discriminatory to AD, how they can be assessed, what kind of results they can yield, and how such results should be interpreted. This article provides an updated overview of speech profiling, methods of speech measurement and analysis, and the clinical power of speech assessment for early discrimination of AD as the most common cause of dementia. What are the potential or actual clinical implications of this work? This article provides an overview of the predictive potential of different speech parameters in relation to AD cognitive impairment. In addition, it discusses the effect that the cognitive state, the type of elicitation task and the type of assessment method may have on the results of the speech-based analysis in ageing.", "venue": "International journal of language and communication disorders", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-05-04", "journal": {"name": "International journal of language & communication disorders"}, "authors": [{"authorId": "50513594", "name": "O. Ivanova"}, {"authorId": "1435820501", "name": "Israel Martínez-Nicolás"}, {"authorId": "2086686065", "name": "J. J. Meilán"}], "citations": [{"paperId": "c29f6ca17957eb20476b6d6503e55445a7fa459d", "title": "Apraxia of speech due to the left postcentral gyrus lesion"}, {"paperId": "cfbc7347f96a4fe15216777d69339de7d352a096", "title": "Aging language and language typology, or why we should pay attention to cross-linguistic features when studying aging"}]}
