{"paperId": "153531553f699e666a31fd962d23de175fe62bb1", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "Novel ensemble of deep learning neural network and support vector machine for landslide susceptibility mapping in Tehri region, Garhwal Himalaya", "abstract": "Abstract Over the years, landslide has become one of the most destructive events that can happen in hilly areas. Tehri, a region in the Himalayas is no different. Current research aids in the construction of ensemble models of DLNN and SVM, which are then compared with various SVM kernels. Landslide susceptibility mapping in the Tehri region of the Himalayas has been worked upon using a deep learning (DLNN), four machine learnings (SVM-RBF, SVM-Linear, SVM-Polynomial, SVM-Sigmoid), and their novel ensembles i.e., DLNN with SVM-RBF, DLNN with SVM-Linear, DLNN with SVM-Polynomial and DLNN with SVM-Sigmoid. 16 geo-environmental landslide conditioning factors (LCFs) have been considered. These models were trained using 70% of inventory landslides and tested using 30% of the same. The results revealed the superiority of DLNN, DLNN-SVM (RBF), DLNN-SVM (Linear) models which quantified 28.32, 26.96 and 22.41% of the area highly susceptible for landslide, respectively.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-02", "journal": {"name": "Geocarto International", "pages": "17018 - 17043", "volume": "37"}, "authors": [{"authorId": "79392261", "name": "S. Saha"}, {"authorId": "47162497", "name": "A. Saha"}, {"authorId": "119696165", "name": "Tusar Kanti Hembram"}, {"authorId": "2090915534", "name": "B. Kundu"}, {"authorId": "51183380", "name": "Raju Sarkar"}], "citations": [{"paperId": "4b0d097401b4297fb12770df4394efd6c2a23d78", "title": "Exploring machine learning and statistical approach techniques for landslide susceptibility mapping in Siwalik Himalayan Region using geospatial technology."}, {"paperId": "e8b9f94a605b6f250183ca2e322615b2594b9743", "title": "An integrated approach of machine learning and remote sensing for evaluating landslide hazards and risk hotspots, NW Himalaya"}, {"paperId": "7c09abc7874c05148836e2284f513f4fe1792d00", "title": "Modeling and Evaluation of the Susceptibility to Landslide Events Using Machine Learning Algorithms in the Province of Chañaral, Atacama Region, Chile"}, {"paperId": "76dde9517c4d6e147abf5faa1436ca9d53661e99", "title": "Quantifying soil erosion and influential factors in Guwahati's urban watershed using statistical analysis, machine and deep learning"}, {"paperId": "99683b47fe1511a9dd0332f27be5cb02df0bbb53", "title": "Integrated deep learning with explainable artificial intelligence for enhanced landslide management"}, {"paperId": "baa9674b191887fadb838402edc12021a42891a1", "title": "Landslide susceptibility prediction by gray wolf optimized support vector machine model under different factor states"}, {"paperId": "de00666599502195e8076f4ef6aa2027292bf671", "title": "Development and assessment of a novel hybrid machine learning-based landslide susceptibility mapping model in the Darjeeling Himalayas"}, {"paperId": "298a3fde7f36b58e6c83b62e09a812e98e44ccb7", "title": "Integration of rotation forest and multiboost ensemble methods with forest by penalizing attributes for spatial prediction of landslide susceptible areas"}, {"paperId": "240addbe5c0ba09d6858fbbe3296d6966d780a33", "title": "Flood Susceptibility Mapping Using Machine Learning Algorithms: A Case Study in Huong Khe District, Ha Tinh Province, Vietnam"}, {"paperId": "07da4446eb50462c07e04e76229f460074d71f17", "title": "A review on landslide susceptibility mapping research in Bangladesh"}, {"paperId": "87b65f3200158c3ec97d3de5a2c7087d36f1c5c1", "title": "Enhancing Social Media Platforms with Machine Learning Algorithms and Neural Networks"}, {"paperId": "489e30435f8bc2813f703485918bcdf2ab67af38", "title": "Impact of Parameter Tuning with Genetic Algorithm, Particle Swarm Optimization, and Bat Algorithm on Accuracy of the SVM Model in Landslide Susceptibility Evaluation"}, {"paperId": "c8647ea74a097ab63b56935cc1bd6754011fa750", "title": "Flood Susceptibility Modeling Using an Advanced Deep Learning-Based Iterative Classifier Optimizer"}, {"paperId": "5e750be4be14e72d37e4c539b9d0571ff319b803", "title": "Enhancing landslide management with hyper-tuned machine learning and deep learning models: Predicting susceptibility and analyzing sensitivity and uncertainty"}, {"paperId": "c7b988d0735aafebad3ed69736d738e23278638e", "title": "Landslide Susceptibility Assessment of a Part of the Western Ghats (India) Employing the AHP and F-AHP Models and Comparison with Existing Susceptibility Maps"}, {"paperId": "e4c9ab2cbaf40059a273613bc196ee03f8d6efa4", "title": "Landslide susceptibility mapping in Three Gorges Reservoir area based on GIS and boosting decision tree model"}, {"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network"}]}
