{"paperId": "153f4c352c9d938709a3ef9fe3bdce0b813a2742", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "Fine Granularity and Adaptive Cache Update Mechanism for Client Caching", "abstract": "Distributed file systems have been commonly used as the back end to provide high-performance I/O services for hosting complicated data processing, such as database workloads. By buffering the frequently used data in the local file cache, which is called the client caching mechanism, can reduce the I/O latency and improve the performance of file access. However, the overhead and complexity for ensuring data consistency may offset the performance benefits caused by data caching. This paper proposes an adaptive, per-block cache update mechanism, which can ensure data consistency of block data in a distributed file system, with low synchronization overhead. Specifically, based on the recent history of read/write requests, the proposed scheme can adaptively select the best-suited consistency update policy for each data block at run time. The experiments on database applications show that our newly proposed mechanism can greatly reduce the overhead resulted by maintaining cache consistency, especially for the workloads having fluctuating read/write ratios. As a consequence, the system performance can be also enhanced.", "venue": "IEEE Systems Journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-01", "journal": {"name": "IEEE Systems Journal", "pages": "1587-1598", "volume": "13"}, "authors": [{"authorId": "35036106", "name": "Jianwei Liao"}, {"authorId": "1754952", "name": "François Trahay"}, {"authorId": "145614398", "name": "Zhigang Cai"}, {"authorId": "2363479", "name": "Hailing Xiong"}, {"authorId": "2118433479", "name": "S. Chen"}, {"authorId": "2236246239", "name": "Y. Ishikawa"}], "citations": [{"paperId": "d2039a6d8c158edfb0ed80de448c12467c214fba", "title": "Toward Efficient Block Replication Management in Distributed Storage"}]}
