{"paperId": "1552c82c82b9ac2c113eec95efbf2487f20c0164", "publicationVenue": {"id": "8972ab32-b3a8-4d2e-bfa0-494c8801bcce", "name": "IEEE Transactions on Sustainable Computing", "alternate_names": ["IEEE Trans Sustain Comput"], "issn": "2377-3790", "alternate_issns": ["2377-3782"], "url": "https://www.computer.org/web/tsusc", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7274860"]}, "title": "Reliability/Performance-Aware Scheduling for Parallel Applications With Energy Constraints on Heterogeneous Computing Systems", "abstract": "Heterogeneous Computing Systems (HCSs) have developed rapidly due to their high performance and low cost, and have been adopted by more and more applications. Energy consumption, reliability, and schedule length are the core issues of HCSs. Due to the negative correlation between frequency and reliability, DVFS-supported HCSs requires high energy consumption and a long schedule length to obtain high reliability, which resulting in performance degradation. In this paper, we focus on the reliability and performance-aware scheduling for energy-constrained parallel applications on HCSs. First, we design an energy pre-allocation mechanism based on Energy Demand Rate (EDR) to pre-allocate energy reasonably. Second, we propose an EDR-aware Maximizing Reliability of Energy-Constrained parallel applications (EMREC) scheduling algorithm. Third, considering that maximize reliability will cause the schedule length to be too long and unacceptable, we further highlight the concept of Reliability Performance Ratio (RPR). Finally, we propose a Maximizing RPR with Energy-Constrained parallel applications (MRPEC) scheduling algorithm, which enables parallel applications have a smaller schedule length while with high reliability. Extensive experimental results in real-world and randomly generated applications show the effectiveness of the proposed algorithms under different conditions.", "venue": "IEEE Transactions on Sustainable Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "IEEE Transactions on Sustainable Computing", "pages": "681-695", "volume": "7"}, "authors": [{"authorId": "3491542", "name": "Jiwu Peng"}, {"authorId": "145730774", "name": "Kenli Li"}, {"authorId": "1610573077", "name": "Jianguo Chen"}, {"authorId": "69486668", "name": "Kuan-Ching Li"}], "citations": [{"paperId": "2a9d0c5edf9533b12d49590ec6e8d6e6885ae1cc", "title": "Efficient Prediction of Makespan Matrix Workflow Scheduling Algorithm for Heterogeneous Cloud Environments"}]}
