{"paperId": "15577b9d82156ed646dfa949b4cf8b72317efd32", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "WOA: Wombat Optimization Algorithm for Solving Supply Chain Optimization Problems", "abstract": "Supply Chain (SC) Optimization is a key activity in today’s industry with the goal of increasing operational efficiency, reducing costs, and improving customer satisfaction. Traditional optimization methods often struggle to effectively use resources while handling complex and dynamic Supply chain networks. This paper introduces a novel biomimetic metaheuristic algorithm called the Wombat Optimization Algorithm (WOA) for supply chain optimization. This algorithm replicates the natural behaviors observed in wombats living in the wild, particularly focusing on their foraging tactics and evasive maneuvers towards predators. The theory of WOA is described and then mathematically modeled in two phases: (i) exploration based on the simulation of wombat movements during foraging and trying to find food and (ii) exploitation based on simulating wombat movements when diving towards nearby tunnels to defend against its predators. The effectiveness of WOA in addressing optimization challenges is assessed by handling the CEC 2017 test suite across various problem dimensions, including 10, 30, 50, and 100. The findings of the optimization indicate that WOA demonstrates a strong ability to effectively manage exploration and exploitation, and maintains a balance between them throughout the search phase to deliver optimal solutions for optimization problems. A total of twelve well-known metaheuristic algorithms are called upon to test their performance against WOA in the optimization process. The outcomes of the simulations reveal that WOA outperforms the other algorithms, achieving superior results across most benchmark functions and securing the top ranking as the most efficient optimizer. Using a Wilcoxon rank sum test statistical analysis, it has been proven that WOA outperforms other algorithms significantly. WOA is put to the test with twenty-two constrained optimization problems from the CEC 2011 test suite and four engineering design problems to showcase its ability to solve real-world optimization problems. The results of the simulations demonstrate that WOA excels in real-world applications by delivering superior solutions and outperforming its competitors.", "venue": "Mathematics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "83493903", "name": "Zoubida Benmamoun"}, {"authorId": "2294633345", "name": "Khaoula Khlie"}, {"authorId": "2294608953", "name": "Mohammad Dehghani"}, {"authorId": "2294633337", "name": "Youness Gherabi"}], "citations": []}
