{"paperId": "15592a151f5459506f9e1adbe2faac32e3365e7a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Recent Advances in Grey Wolf Optimizer, its Versions and Applications: Review", "abstract": "The Grey Wolf Optimizer (GWO) has emerged as one of the most captivating swarm intelligence methods, drawing inspiration from the hunting behavior of wolf packs. GWO’s appeal lies in its remarkable characteristics: it is parameter-free, derivative-free, conceptually simple, user-friendly, adaptable, flexible, and robust. Its efficacy has been demonstrated across a wide range of optimization problems in diverse domains, including engineering, bioinformatics, biomedical, scheduling and planning, and business. Given the substantial growth and effectiveness of GWO, it is essential to conduct a recent review to provide updated insights. This review delves into the GWO-related research conducted between 2019 and 2022, encompassing over 200 research articles. It explores the growth of GWO in terms of publications, citations, and the domains that leverage its potential. The review thoroughly examines the latest versions of GWO, categorizing them based on their contributions. Additionally, it highlights the primary applications of GWO, with computer science and engineering emerging as the dominant research domains. A critical analysis of the accomplishments and limitations of GWO is presented, offering valuable insights. Finally, the review concludes with a brief summary and outlines potential future developments in GWO theory and applications. Researchers seeking to employ GWO as a problem-solving tool will find this comprehensive review immensely beneficial in advancing their research endeavors.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "22991-23028", "volume": "12"}, "authors": [{"authorId": "1411405988", "name": "S. Makhadmeh"}, {"authorId": "1396704271", "name": "M. Al-Betar"}, {"authorId": "3185978", "name": "Iyad Abu Doush"}, {"authorId": "2987268", "name": "Mohammed A. Awadallah"}, {"authorId": "2955070", "name": "Sofian Kassaymeh"}, {"authorId": "2144459212", "name": "Seyedali Mirjalili"}, {"authorId": "1790928", "name": "R. A. Zitar"}], "citations": [{"paperId": "e847c98088c7fe6d2aa0aa64cbd75cbfd512f7a9", "title": "Surrogate-assisted metaheuristics for the facility location problem with distributed demands on network edges"}, {"paperId": "ec4e6ec4fd3810c592c07cb4dd6d99802e4676a6", "title": "A hybrid combination of CNN Attention with optimized random forest with grey wolf optimizer to discriminate between Arabic hateful, abusive tweets"}, {"paperId": "61c9437ed678ff537d4d8cf26a92aca2368dfec4", "title": "Novel grey wolf optimizer based parameters selection for GARCH and ARIMA models for stock price prediction"}, {"paperId": "f02aa13707b624f1aebc2588c9e5ceb3bb1ad174", "title": "Artificial intelligence-based spatio-temporal vision sensors: applications and prospects"}, {"paperId": "dc00f5a682f40723705b75fdee12d126f8ab94b9", "title": "Various Twitter Sentiment Analysis Topics using Feature Reduction method based on Binary Gray Wolf Optimizer with S-shape Transfer Function"}, {"paperId": "293c3a68bae92063684ce261764ae1469d50e629", "title": "Feedforward neural network-based augmented salp swarm optimizer for accurate software development cost forecasting"}, {"paperId": "9c1e66aba9125cd46679b3531e62067a801690bc", "title": "A Novel Improved Grey Wolf Algorithm Based Global Maximum Power Point Tracker Method Considering Partial Shading"}]}
