{"paperId": "155c6b46c519e306d31e6981e6b11da154e339c8", "publicationVenue": {"id": "bb8ef66c-6ae6-48bc-8837-2307ec09d39f", "name": "Education sciences", "type": "journal", "alternate_names": ["Educ Sci", "Education Sciences", "Educ sci"], "issn": "2063-9546", "alternate_issns": ["2227-7102"], "url": "http://nevelestudomany.elte.hu/", "alternate_urls": ["http://nevelestudomany.elte.hu/?lang=en", "https://www.mdpi.com/journal/education", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-235892", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-235892"]}, "title": "Understanding the Impact of a Learning Management System Using a Novel Modified DeLone and McLean Model", "abstract": "Due to the evident importance of e-learning in education, the number of e-courses and systems delivering various services has exploded. Thus, evaluating e-learning systems is critical to ensuring their successful delivery, practical use, and beneficial effects on learners. Therefore, this study aims to evaluate the success of learning management systems using the modified DeLone and McLean model. A survey involving 239 in-service vocational teachers evaluated the research model. Statistical analysis was used to examine the hypotheses, specifically linear regression analysis. The results of the nine proposed hypotheses indicate that two had an insignificant relationship: information quality on user satisfaction (H5) and system quality on use (H7). The finding shows that the proposed model may give an alternative point of view to the LMS evaluation.", "venue": "Education sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-23", "journal": {"name": "Education Sciences"}, "authors": [{"authorId": "23987189", "name": "H. Elmunsyah"}, {"authorId": "3000168", "name": "A. Nafalski"}, {"authorId": "47923021", "name": "A. Wibawa"}, {"authorId": "72396674", "name": "F. Dwiyanto"}], "citations": [{"paperId": "73e235952b424daa898c267b3997ef0129d2cfea", "title": "Learning management systems success in the Covid-19 post-pandemic blended learning context: Empirical evidence from a Brazilian engineering school"}, {"paperId": "de1a83a440ae8d032a32fbc755940abc48e187fe", "title": "A needs analysis on the utilization of learning management systems as blended learning media in elementary school"}, {"paperId": "8fb14b1fde630023250839fb67ef6a52ee3bbf14", "title": "Version Controlling of User Content in Learning Management Systems for Supporting the Teaching/Learning Process"}, {"paperId": "ccd3035daef15f1eaea9fb8a17acbe6e18de992f", "title": "Development of Interactive Media Learning Basic Computer and Telecommunication Network Techniques for Vocational High School Students"}, {"paperId": "e25d100d177a2a685a783badc37268be1b855c33", "title": "E-Module to Grow Interest in Learning Multimedia Engineering for Informatics Engineering Students"}, {"paperId": "83ab9b59e4ff9a07d389d4c5a5f70d8f675cab90", "title": "Developing a Comprehensive Reading Test for Undergraduate Students: An LMS-Based Reading Test"}]}
