{"paperId": "157e6afb0ba7b5e47626fe9531dac3df7b007ae2", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Failure Mechanism Analysis of Mining-Induced Landslide Based on Geophysical Investigation and Numerical Modelling Using Distinct Element Method", "abstract": "Underground mining activity in the karst mountain in southwestern China has induced several large-scale rocky landslides and has caused serious casualties. At present, there is a lack of systematic research on the formation mechanism of landslides in this area using multi-method fusion technology. First, the orthophoto images of the landslide area obtained by UAV photography were used to analyze the deformation characteristics of the landslide. Second, the failure characteristics of the strata overlying the goaf were analyzed by geophysical detection. Finally, the deformation response characteristics of the mountain under underground mining were analyzed by UDEC numerical simulation. The results revealed that during the underground mining, the failure process of the mountain occurred in four stages: fracture expansion, subsidence and collapse, shear sliding, and multi-level sliding. Gently dipping soft–hard alternant strata and a blocky rock mass structure formed the geological foundation of the landslides. Underground mining accelerated the fracturing of the overlying strata and the formation of a stepped penetrating sliding surface. Tensile movement of the structural planes of hard sandstone in the free face, and shear sliding of the weak mudstone layer, were the main causes of the landslides. The slope instability mode was tension-shear fracturing, shear sliding, back toppling, and compressive shear failure. In addition, the fracture propagation in the overlying strata and damaged geological structure revealed by the geophysical detection were consistent with the simulation results. This study provides ideas for the precise countermeasures of disaster prevention and mitigation for similar landslides in this area.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-30", "journal": {"name": "Remote. Sens.", "pages": "6071", "volume": "14"}, "authors": [{"authorId": "145409858", "name": "Jun Li"}, {"authorId": "2156072037", "name": "Bin Li"}, {"authorId": "2058347926", "name": "Kai He"}, {"authorId": "2145972572", "name": "Yang Gao"}, {"authorId": "1833075133", "name": "Jiawei Wan"}, {"authorId": "2170163839", "name": "Weile Wu"}, {"authorId": "2119078524", "name": "Han Zhang"}], "citations": [{"paperId": "de843d0451e0f5f8a7f4a190dd6aad5eaa3f242c", "title": "Damage features and dynamic triggering mechanism of the Jianshanying landslide induced by underground mining in Shuicheng County, Guizhou Province, China"}, {"paperId": "9364450cf8c1cc08a35e6d6e7bc2d68132ed148f", "title": "The Detection and Control Factor Analysis of Active Landslides in Guizhou Province, China, Using Sentinel-1 SAR Imagery"}, {"paperId": "dfa2b165814bde566a9b7b43ca735188b5da1965", "title": "Failure process and three-dimensional motions of mining-induced Jianshanying landslide in China observed by optical, LiDAR and SAR datasets"}, {"paperId": "873fb24e164c155e1e4db4b5ab56522207b2e191", "title": "Retrieving the Kinematic Process of Repeated-Mining-Induced Landslides by Fusing SAR/InSAR Displacement, Logistic Model, and Probability Integral Method"}, {"paperId": "c0af6984b02cf1ef22044f036d56d4a0d6e09a1a", "title": "High Steep Rock Slope Instability Mechanism Induced by the Pillar Deterioration in the Mountain Mining Area"}]}
