{"paperId": "157f4d979d6fcbad9b6e7f1d815b518d2c22c466", "publicationVenue": null, "title": "Energy Saving in Lithium-Ion Battery Manufacturing through the Implementation of Predictive Maintenance", "abstract": "With digitalisation changing the way manufacturing activities are conducted, maintenance practices and systematisation are expected to go through a major change. For the battery module and pack assembly spaces in the electrification industry, which witnesses a significant growth, more effort has to be put into the development of \"digital maintenance\" strategies. Against this background, the current work inspects the identified research gap in this domain, this being that DES models can play a greater role to implement predictive maintenance, and energy consumption varies greatly and is not reported in a standard way. Monitoring process data and logging corresponding energy consumption, can provide a vision of conducting predictive maintenance for a flexible battery module assembly line. Using a configurable DES model also makes the most practical use for a flexible design which can be modified to suit different cases, both in terms of battery structure and components in use from cell to welding. A case study is presented in order to exemplify the implementation of the proposed methodology. In the case study used in this paper, results show a 3% energy consumption drop, but could be different depending on the module configuration and assembly process.", "venue": "2022 International Conference on Computing, Electronics & Communications Engineering (iCCECE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-08-17", "journal": {"name": "2022 International Conference on Computing, Electronics & Communications Engineering (iCCECE)", "pages": "47-52"}, "authors": [{"authorId": "1470737711", "name": "Rohin Titmarsh"}, {"authorId": "52135770", "name": "Fadi Assad"}, {"authorId": "2072394924", "name": "R. Harrison"}], "citations": []}
