{"paperId": "15920905050f753265558fa79ff91e37720198d5", "publicationVenue": {"id": "5f4ae656-d38e-4e8d-9b9f-8aec59306f4c", "name": "AppliedMath", "issn": "2673-9909"}, "title": "A Rule-Based Approach for Mining Creative Thinking Patterns from Big Educational Data", "abstract": "Numerous studies have established a correlation between creativity and intrinsic motivation to learn, with creativity defined as the process of generating original and valuable ideas, often by integrating perspectives from different fields. The field of educational technology has shown a growing interest in leveraging technology to promote creativity in the classroom, with several studies demonstrating the positive impact of creativity on learning outcomes. However, mining creative thinking patterns from educational data remains a challenging task, even with the proliferation of research on adaptive technology for education. This paper presents an initial effort towards formalizing educational knowledge by developing a domain-specific Knowledge Base that identifies key concepts, facts, and assumptions essential for identifying creativity patterns. Our proposed pipeline involves modeling raw educational data, such as assessments and class activities, as a graph to facilitate the contextualization of knowledge. We then leverage a rule-based approach to enable the mining of creative thinking patterns from the contextualized data and knowledge graph. To validate our approach, we evaluate it on real-world datasets and demonstrate how the proposed pipeline can enable instructors to gain insights into students’ creative thinking patterns from their activities and assessment tasks.", "venue": "AppliedMath", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-20", "journal": {"name": "AppliedMath"}, "authors": [{"authorId": "2179451489", "name": "Nasrin Shabani"}, {"authorId": "2140545259", "name": "A. Beheshti"}, {"authorId": "47576177", "name": "Helia Farhood"}, {"authorId": "1721875", "name": "M. Bower"}, {"authorId": "73599160", "name": "Michael Garrett"}, {"authorId": "1405336294", "name": "H. Alinejad-Rokny"}], "citations": [{"paperId": "df511f5e6d1514dfa6bb5d480361bca52345bc12", "title": "Towards Global, Socio-Economic, and Culturally Aware Recommender Systems"}, {"paperId": "773452ccd6e3da1fd08ba4fa9820956568e4b480", "title": "Empowering Generative AI with Knowledge Base 4.0: Towards Linking Analytical, Cognitive, and Generative Intelligence"}]}
