{"paperId": "159a561cd0fc683976c53f0184e8abcad826e0f4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Graph3S: A Simple, Speedy and Scalable Distributed Graph Processing System", "abstract": "Graph is a ubiquitous structure in many domains. The rapidly increasing data volume calls for efficient and scalable graph data processing. In recent years, designing distributed graph processing systems has been an increasingly important area to fulfil the demands of processing big graphs in a distributed environment. Though a variety of distributed graph processing systems have been developed, very little attention has been paid to achieving a good combinational system performance in terms of usage simplicity, efficiency and scalability. To contribute to the study of distributed graph processing system, this work tries to fill this gap by designing a simple, speedy and scalable system. Our observation is that enforcing the communication flexibility of a system leads to the gains of both system efficiency and scalability as well as simple usage. We realize our idea in a system Graph3S and conduct extensive experiments with diverse algorithms over big graphs from different domains to test its performance. The results show that, besides simple usage, our system has outstanding performance over various graph algorithms and can even reach up to two orders of magnitude speedup over existing in-memory systems when applying to some algorithms. Also, its scalability is competitive to disk-based systems and even better when less machines are used.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-02", "journal": {"name": "ArXiv", "volume": "abs/2003.00680"}, "authors": [{"authorId": "2108142732", "name": "Xubo Wang"}, {"authorId": "145770133", "name": "Lu Qin"}, {"authorId": "38736958", "name": "Lijun Chang"}, {"authorId": "102684122", "name": "Ying Zhang"}, {"authorId": "2054328740", "name": "Dong Wen"}, {"authorId": "2873542", "name": "Xuemin Lin"}], "citations": []}
