{"paperId": "15a28380b91783db4e58e01ed8a9154675020b4c", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Single‐objective service composition methods in cloud manufacturing systems: Recent techniques, classification, and future trends", "abstract": "In recent years, cloud manufacturing (CMfg) has been developed as an intelligent manufacturing system, in which geographically distributed manufacturing resources are available as services in the cloud platform. Choosing and integrating single services into a combined service to fulfill the client's requests requires higher emphasis. However, by increasing customers' trend to utilize CMfg, service providers are encouraged to publish services with various functional and non‐functional characteristics. Thus, service composition and optimal selection has become one of the most challenging topics in CMfg. Hence, an inclusive review of current studies on this NP‐hard issue is extremely desirable. This article first, selects the recent studies in the field of single‐objective service composition in CMfg and classifies and surveys them comprehensively in terms of QoS parameters, energy consumption, user constraint, and so forth. This article aims to provide a useful roadmap for future researchers who are intended to explore novel work in this field. The search for articles was conducted in November 2020.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-03", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "41020344", "name": "Vahideh Hayyolalam"}, {"authorId": "27012208", "name": "Behrouz Pourghebleh"}, {"authorId": "2139440420", "name": "Mohammad Reza Chehrehzad"}, {"authorId": "9077845", "name": "A.A. Pourhaji Kazem"}], "citations": [{"paperId": "02650fe20a650d62437ff96db3dd7b556bb61f80", "title": "Cloud-integrated robotics: transforming healthcare and rehabilitation for individuals with disabilities"}, {"paperId": "e65d867fcc59d6393bea8b7a5e8c61f743649a03", "title": "Incentive approaches for cloud computing: challenges and solutions"}, {"paperId": "95f3faed55f6167bc8bfb0396f2fdc377495bd9e", "title": "Multi-objective scheduling of cloud tasks with positional information-enhanced reptile search algorithm"}, {"paperId": "8322dbc99844bb3144484d78a4fefbacc2a20e17", "title": "A new QoS-aware service discovery technique in the Internet of Things using whale optimization and genetic algorithms"}, {"paperId": "b4bb0cd13da3975befcd84aef8fb3c985caaf429", "title": "A new QoS-aware service composition technique in cloud computing using capuchin search algorithm"}, {"paperId": "26f8c5f71642c7942ef64e1c267dcc57b99792da", "title": "Integrating blockchain technology and cloud services in healthcare: a security and privacy perspective"}, {"paperId": "5f28fde0019680254acd3c8ccf2b517728254357", "title": "Load balancing in virtual machines of cloud environments using two-level particle swarm optimization algorithm"}, {"paperId": "fe778f711e762dc47281426206cf9d65efc2d08c", "title": "The importance of nature‐inspired metaheuristic algorithms in the data routing and path finding problem in the internet of things"}, {"paperId": "d6dd026b1b2e70ed8ad655a7b30295d8133d24c2", "title": "Task scheduling in the internet of things: challenges, solutions, and future trends"}, {"paperId": "a57164bfa8fd5c112b34ded4f99f34184a1982ac", "title": "A novel membrane‐inspired multiverse optimizer algorithm for quality of service‐aware cloud web service composition with service level agreements"}, {"paperId": "af0dfad5917ca5613843fa9df468df96005d7f3c", "title": "A tree-based energy-aware data aggregation method in the Internet of Things using the firefly optimization algorithm"}, {"paperId": "1425af2b2513f469dfb8da63dc62fa9ad659f683", "title": "A roadmap towards energy‐efficient data fusion methods in the Internet of Things"}, {"paperId": "3b7776322a7fd9dc1f0828066c6fbc66f2e76b05", "title": "Dynamic QoS/QoE-aware reliable service composition framework for edge intelligence"}, {"paperId": "853c13834f8192e5fdc689633d5d9d84afdea3a7", "title": "Enhanced Linear Regression Models for Resource Usage Prediction in Dynamic Cloud Environments"}, {"paperId": "a824d666a4bcf0d6749e56ed09de8774e3f0b7fc", "title": "A Comprehensive Review of Fault-Tolerant Routing Mechanisms for the Internet of Things"}, {"paperId": "606284168e8777903f117348ac22da61393bb2ec", "title": "IoT Capabilities Composition and Decomposition: A Systematic Review"}, {"paperId": "b14493cb724d09ea592de4fad95367913384fa4d", "title": "Multi-Agent Interests Service Composition Optimization in Cloud Manufacturing Environment"}, {"paperId": "fb7910b56543ad78b3b193aa65b6da33bfa9eea0", "title": "Krill Herd Algorithm for Live Virtual Machines Migration in Cloud Environments"}, {"paperId": "a89ef926b6fdaac64035e8eafad82fb25d51c2e6", "title": "Deadline-aware Task Scheduling for Cloud Computing using Firefly Optimization Algorithm"}, {"paperId": "bc251053ea5130471ccc29ad1d28f47a5d4b71f0", "title": "Cloud Service Composition using Firefly Optimization Algorithm and Fuzzy Logic"}, {"paperId": "60fa7791e12ad77045bbe9217f33553dc0ba9948", "title": "Cloud Task Scheduling using the Squirrel Search Algorithm and Improved Genetic Algorithm"}, {"paperId": "504ddc196981a1bfd5e4ea9d41f328c076bf8e87", "title": "A Hybrid Method Based on Gravitational Search and Genetic Algorithms for Task Scheduling in Cloud Computing"}, {"paperId": "9771e3293024bdcafe0bb54c3c1b2f6e4402bfe4", "title": "Inverted Ant Colony Optimization Algorithm for Data Replication in Cloud Computing"}, {"paperId": "54b3d722f1c7966f2fb6357822fdbc472115befa", "title": "Improved Cat Swarm Optimization Algorithm for Load Balancing in the Cloud Computing Environment"}, {"paperId": "e3ace24b882526fe823be83a0fc5e3515bd9e204", "title": "Cloud Task Scheduling using Particle Swarm Optimization and Capuchin Search Algorithms"}, {"paperId": "df2774de7c322662ef19dbe4a30390c76a819069", "title": "Virtual Machine Allocation in Cloud Computing Environments using Giant Trevally Optimizer"}, {"paperId": "8ebe7f1a53a4f7c63889b966f02f9a3d70e4a2f2", "title": "Whale Optimization Algorithm for Energy-Efficient Task Allocation in the Internet of Things"}, {"paperId": "3cf2d96f700eb728f30dd4b37f62afa050654a9e", "title": "Hybrid Integrated Aquila Optimizer for Efficient Service Composition with Quality of Service Guarantees in Cloud Computing"}, {"paperId": "ed025041930251d87e15088a21b35f4251484c97", "title": "Efficient Cloud Workflow Scheduling with Inverted Ant Colony Optimization Algorithm"}, {"paperId": "5bba1401faeafb4f4d40fe8d0aa96e2fcd24ff44", "title": "QoS and Energy-aware Resource Allocation in Cloud Computing Data Centers using Particle Swarm Optimization Algorithm and Fuzzy Logic System"}, {"paperId": "cf4a9dcb00b8efd6be6737f0b7e7cb1eaceeeeb0", "title": "MG-CS: Micro-Genetic and Cuckoo Search Algorithms for Load-Balancing and Power Minimization in Cloud Computing"}, {"paperId": "7b6e55b2bcdf5114e687f6f8f3d54dd2bd69ae26", "title": "Nature-Inspired Optimization for Virtual Machine Allocation in Cloud Computing: Current Methods and Future Directions"}]}
