{"paperId": "15a3fd454031c368af8b9c19180edf16a0203fe6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Approximate Computing Survey, Part II: Application-Specific & Architectural Approximation Techniques and Applications", "abstract": "The challenging deployment of compute-intensive applications from domains such Artificial Intelligence (AI) and Digital Signal Processing (DSP), forces the community of computing systems to explore new design approaches. Approximate Computing appears as an emerging solution, allowing to tune the quality of results in the design of a system in order to improve the energy efficiency and/or performance. This radical paradigm shift has attracted interest from both academia and industry, resulting in significant research on approximation techniques and methodologies at different design layers (from system down to integrated circuits). Motivated by the wide appeal of Approximate Computing over the last 10 years, we conduct a two-part survey to cover key aspects (e.g., terminology and applications) and review the state-of-the art approximation techniques from all layers of the traditional computing stack. In Part II of our survey, we classify and present the technical details of application-specific and architectural approximation techniques, which both target the design of resource-efficient processors/accelerators&systems. Moreover, we present a detailed analysis of the application spectrum of Approximate Computing and discuss open challenges and future directions.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-20", "journal": {"name": "ArXiv", "volume": "abs/2307.11128"}, "authors": [{"authorId": "39954461", "name": "Vasileios Leon"}, {"authorId": "98254755", "name": "Muhammad Abdullah Hanif"}, {"authorId": "2121374305", "name": "Giorgos Armeniakos"}, {"authorId": "2858184", "name": "Xun Jiao"}, {"authorId": "2077523138", "name": "Muhammad Shafique"}, {"authorId": "144519464", "name": "K. Pekmestzi"}, {"authorId": "2171865403", "name": "D. Soudris"}], "citations": [{"paperId": "364404aa07f6a06f06b95de7cacfafdcf30d1c72", "title": "Approximate Computing Survey, Part I: Terminology and Software & Hardware Approximation Techniques"}]}
