{"paperId": "15a3e97222d98feb0e621f6bd08501653ffb9160", "publicationVenue": {"id": "9846de51-dadf-4086-9e40-62466a7e2c87", "name": "International Conference on Fog and Mobile Edge Computing", "type": "conference", "alternate_names": ["FMEC", "Int Conf Fog Mob Edge Comput"]}, "title": "ART4FL: An Agent-Based Architectural Approach for Trustworthy Federated Learning in the IoT", "abstract": "The integration of the Internet of Things (IoT) and Machine Learning (ML) technologies has opened up for the development of novel types of systems and services. Federated Learning (FL) has enabled the systems to collaboratively train their ML models while preserving the privacy of the data collected by their IoT devices and objects. Several FL frameworks have been developed, however, they do not enable FL in open, distributed, and heterogeneous IoT environments. Specifically, they do not support systems that collect similar data to dynamically discover each other, communicate, and negotiate about the training terms (e.g., accuracy, communication latency, and cost). Towards bridging this gap, we propose ART4FL, an end-to-end framework that enables FL in open IoT settings. The framework enables systems' users to configure agents that participate in FL on their behalf. Those agents negotiate and make commitments (i.e., contractual agreements) to dynamically form federations. To perform FL, the framework deploys the needed services dynamically, monitors the training rounds, and calculates agents' trust scores based on the established commitments. ART4FL exploits a blockchain network to maintain the trust scores, and it provides those scores to negotiating agents' during the federations' formation phase.", "venue": "International Conference on Fog and Mobile Edge Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-18", "journal": {"name": "2023 Eighth International Conference on Fog and Mobile Edge Computing (FMEC)", "pages": "270-275"}, "authors": [{"authorId": "11033180", "name": "Fahed Alkhabbas"}, {"authorId": "12147027", "name": "Sadi Alawadi"}, {"authorId": "2265667891", "name": "Majed Ayyad"}, {"authorId": "1749426", "name": "Romina Spalazzese"}, {"authorId": "2239490673", "name": "Paul Davidsson"}], "citations": [{"paperId": "1e844ad2bba6d2f6173da3fad1a7f71bd87fe2b9", "title": "A cognitive deep learning approach for medical image processing"}, {"paperId": "aa1079cdbad014638608f8921dcd2d70462cbe34", "title": "A Survey on Heterogeneity Taxonomy, Security and Privacy Preservation in the Integration of IoT, Wireless Sensor Networks and Federated Learning"}]}
