{"paperId": "15a8822b4b3927b3cf1a7fd5a24fb6a16ae5fe39", "publicationVenue": null, "title": "Distributed Spatiotemporal Trajectory Query Processing in SQL", "abstract": "Nowadays, the collection of moving object data is significantly increasing due to the ubiquity of GPS-enabled devices. Managing and analyzing this kind of data is crucial in many application domains, including social mobility, pandemics, and transportation. In previous work, we have proposed the MobilityDB moving object database system. It is a production-ready system, that is built on top of PostgreSQL and PostGIS. It accepts SQL queries and offers most of the common spatiotemporal types and operations. In this paper, to address the scalability requirement of big data, we provide an architecture and an implementation of a distributed moving object database system based on MobilityDB. More specifically, we define: (1) an architecture for deploying a distributed MobilityDB database on a cluster using readily available tools, (2) two alternative trajectory data partitioning and index partitioning methods, and (3) a query optimizer that is capable of distributing spatiotemporal SQL queries over multiple MobilityDB instances. The overall outcome is that the cluster is managed in SQL at the run-time and that the user queries are transparently distributed and executed. This is validated with experiments using a real dataset, which also compares MobilityDB with other relevant systems.", "venue": "SIGSPATIAL/GIS", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-11-03", "journal": {"name": "Proceedings of the 28th International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "37565735", "name": "Mohamed S. Bakli"}, {"authorId": "152843469", "name": "M. Sakr"}, {"authorId": "1697955", "name": "E. Zimányi"}], "citations": [{"paperId": "11c26cfcee4adeb81fd3c0ea81fc27877128352a", "title": "Towards Mobility Data Science (Vision Paper)"}, {"paperId": "158add2dcac3ff74c969b24e9db127c0c2d06293", "title": "HGST: A Hilbert-GeoSOT Spatio-Temporal Meshing and Coding Method for Efficient Spatio-Temporal Range Query on Massive Trajectory Data"}, {"paperId": "a348f905283e10092fc4b90029f2132da0e03bb5", "title": "MobilityDB: hands on tutorial on managing and visualizing geospatial trajectories in SQL"}, {"paperId": "bfe0e6dda5d8420a951c5a8bae4c48179bb77280", "title": "A Survey on Big Data Processing Frameworks for Mobility Analytics"}, {"paperId": "bf270bbd4ce56fee451f009ee2babc1bfcb0370e", "title": "MEOS: An Open Source Library for Mobility Data Management"}, {"paperId": "bb629847e0cedcdc224703376fc50201d1e6c032", "title": "Mobility Data Science: Perspectives and Challenges ∗"}]}
