{"paperId": "15b4fd104baaacc0c5b8f3482d3b0fc8ec1f4534", "publicationVenue": {"id": "d1f744e3-5d54-4633-8c6b-01dad2f1f32f", "name": "International Journal of Computing Sciences Research", "type": "journal", "alternate_names": ["International journal of computer science and research", "Int J Comput Sci Res", "Int j comput sci res"], "issn": "2546-115X", "alternate_issns": ["2546-0552", "2210-9668"], "url": "http://www.stepacademic.net/", "alternate_urls": ["http://www.cscjournals.com/publications.php"]}, "title": "Data Mining with R: An Applied Study", "abstract": "Purpose – The aim of this study is to analyze different classification algorithms with R programming and to determine the accuracy rates. It also encourages the use of the R program by giving readers the opportunity to experiment.Method – For the purposes mentioned above, different data sets were obtained from the UC Irvine Machine Learning Repository (2019), which was suitable for classification. After preparing data set and R program for data mining, performance evaluation was made with classification algorithms (J48, Random Forest, Naive Bayes). The 'accuracy' criterion was taken into consideration when interpreting the results.Results – At the end of the study, the accuracy rates were determined for three data sets. Looking at the \"wine\" data, the performance of all three algorithms is quite successful. The results of the other two data sets (lenses and liver) are parallel. Only the ‘liver’ dataset gave a slightly lower accuracy than expected with the Naive Bayes algorithm (0.55).Conclusion – In this study, performance comparison of algorithms has been made within the scope of data mining with R program. The accuracy rate was taken as a criterion. All codes are given with their outputs in order to be an example especially for young researchers or students. It is thought that this study can be a source for other researchers, will encourage the use of R and the researchers or students will try new papers by trying the codes.Recommendations – In subsequent studies, a similar study can be done by developing the given codes. Or how to make classification analysis in R with different algorithms can be examined.", "venue": "International Journal of Computing Sciences Research", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-09-01", "journal": {"name": "International Journal of Computing Sciences Research"}, "authors": [{"authorId": "90796686", "name": "Burcu Durmuş"}, {"authorId": "104326504", "name": "Ö. I. Güneri"}], "citations": [{"paperId": "7530ff529ccc3965af0d4d497ac0db10f4e05a1d", "title": "Analysis and detection of Titanic survivors using generalized linear models and decision tree algorithm"}]}
