{"paperId": "15cac4360fafe7b3ef437467214b2d0b4a264f0e", "publicationVenue": {"id": "0d86bab6-4628-4a46-9723-80c9dc84ce9a", "name": "International Conference on Ultra Modern Telecommunications", "type": "conference", "alternate_names": ["ICUMT", "Int Conf Ultra Mod Telecommun"], "url": "http://icumt.org/"}, "title": "RSS Fingerprinting Dataset Size Reduction Using Feature-Wise Adaptive k-Means Clustering", "abstract": "Modern IoT devices, that include smartphones and wearables, usually have limited resources. They require efficient methods to optimize the use of internal storage, provide computational efficiency, and reduce energy consumption. Device resources should be used appropriately, especially when employed for time-consuming and energy-intensive computations such as positioning or localization. However, reducing computational costs usually degrades the positioning methods. Therefore, the goal of this article is to propose and compare compression mechanisms of the fingerprinting datasets for energy-saving without losing relevant information, by using adaptive k-means clustering. As a result, we achieved a compression ratio of up to 15.97 with a small decrease (1%) in position error.", "venue": "International Conference on Ultra Modern Telecommunications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "2020 12th International Congress on Ultra Modern Telecommunications and Control Systems and Workshops (ICUMT)", "pages": "195-200"}, "authors": [{"authorId": "1750928324", "name": "Lucie Klus"}, {"authorId": "1750929449", "name": "Darwin Quezada-Gaibor"}, {"authorId": "1397616706", "name": "J. Torres-Sospedra"}, {"authorId": "1697970", "name": "E. Lohan"}, {"authorId": "2324790", "name": "C. Granell"}, {"authorId": "144575277", "name": "J. Nurmi"}], "citations": [{"paperId": "f0c8be3f721b45612fa1116899bdb3531930bcb7", "title": "A Two-Nearest Wireless Access Point-Based Fingerprint Clustering Algorithm for Improved Indoor Wireless Localization"}, {"paperId": "3edb0de22519fdda5b1239c2c5cb25b167af79f7", "title": "A Simple and Efficient RSS-AOA Based Localization with Heterogeneous Anchor Nodes"}, {"paperId": "8a41b259f090b2c9008ce4b9e616e90fc7ef8a00", "title": "Highlighting Prominent Features for Size Reduction in Time Series Data using Clustering Techniques"}, {"paperId": "27baba4737f0302a78f3c592a39aeee19b34e49f", "title": "Communication is Verification: IoT Identifier System Using Device Fingerprints"}, {"paperId": "7d92a4a642a0f9ee381cba0e58dca983f72f6385", "title": "Data Cleansing for Indoor Positioning Wi-Fi Fingerprinting Datasets"}, {"paperId": "2ff51130daa58b78663aaf19381399cd55f21354", "title": "Towards Accelerated Localization Performance Across Indoor Positioning Datasets"}, {"paperId": "5acd1a9b7a84e3f38a15bd5ea512806af5364a7e", "title": "Towards Ubiquitous Indoor Positioning: Comparing Systems across Heterogeneous Datasets"}, {"paperId": "34326cb6cbfabfe713bfa77fe80d964abd6251e2", "title": "A Small World Graph Approach for an Efficient Indoor Positioning System"}, {"paperId": "f383cb31f03921a343e93e90f2b081181dc6ed15", "title": "Neural Network Fingerprinting and GNSS Data Fusion for Improved Localization in 5G"}, {"paperId": "e3dfc5d3f5eb77b2315ada78f028cde44acd2fab", "title": "Improved Indoor Localization Performance Using a Modified Affinity Propagation Clustering Algorithm With Context Similarity Coefficient"}, {"paperId": "36f897ad61d586fe7800f8133c1b6016847a94d5", "title": "Autoencoder Extreme Learning Machine for Fingerprint-Based Positioning: A Good Weight Initialization is Decisive"}]}
