{"paperId": "15cb5ba1389107461c0943752db633a552baf3e4", "publicationVenue": {"id": "cdc83875-a82d-445c-b097-cbe91afe99a8", "name": "Conference on Fairness, Accountability and Transparency", "type": "conference", "alternate_names": ["FAccT", "Conf Fairness Account Transpar"], "url": "https://facctconference.org/"}, "title": "Navigating the Audit Landscape: A Framework for Developing Transparent and Auditable XR", "abstract": "“Extended reality” (XR) systems work to blend the physical and digital worlds. This means that XR is highly contextual: its functionality, operation and therefore consequences are driven by a tight, run-time coupling of the technology, the user, and their physical environment. It follows that XR brings particular challenges regarding transparency and accountability, given that it can be difficult to foresee and mitigate all potential issues that might arise from using such systems, given their many potential contexts of use. Further, the physicality of XR can directly result in injury, property damage, or worse, in addition to the more traditionally discussed harms arising from algorithmic systems. Therefore the ability to audit the operation of XR systems is paramount – where information revealing and enabling some reconstruction of an XR system’s use, run-time behaviour, and surrounding context is important for understanding and scrutinising what happens/happened, and why. Towards this, we present a framework to support those involved in developing XR systems to make them more auditable. The framework focuses on supporting the building and instrumentation of an XR system for transparency aims, elaborating key considerations regarding the capture and management of audit data during system operation. We demonstrate the framework’s efficacy with expert XR developers, who indicate the utility and need for such in practice. In all, we provide practical ways forward on, as well as seek to draw attention to, XR transparency and accountability.", "venue": "Conference on Fairness, Accountability and Transparency", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-06-12", "journal": {"name": "Proceedings of the 2023 ACM Conference on Fairness, Accountability, and Transparency"}, "authors": [{"authorId": "2232082", "name": "Chris Norval"}, {"authorId": "73661304", "name": "Richard Cloete"}, {"authorId": "144857568", "name": "Jatinder Singh"}], "citations": [{"paperId": "1a89391749cdb15598dbb27a722d52c63748c67e", "title": "Exploring Healthcare Providers' Perspectives on Extended Reality Technologies for Sustainable Healthcare: A Twitter Analysis"}, {"paperId": "577ea0c8081f53eb3ec39c54952b295b081f4635", "title": "A Room With an Overview: Toward Meaningful Transparency for the Consumer Internet of Things"}]}
