{"paperId": "15e5e5db5cffb9c79ef28f53d2372a9163b0d49b", "publicationVenue": null, "title": "Robustness of hardware-oriented restricted Boltzmann machines in deep belief networks for reliable processing", "abstract": "Remarkable hardware robustness of deep learning is revealed from an error-injection analysis performed using a custom hardware model implementing parallelized restricted Boltzmann machines (RBMs). RBMs used in deep belief networks (DBNs) demonstrate robustness against memory errors during and after learning. Fine-tuning has a significant impact on the recovery of accuracy under the presence of static errors that may modify structural data of RBMs. The proposed hardware networks with fine-graded memory distribution are observed to tolerate memory errors, thereby resulting in a reliable deep learning hardware platform, potentially suitable to safety-critical embedded applications.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Nonlinear Theory and Its Applications, IEICE", "pages": "395-406", "volume": "7"}, "authors": [{"authorId": "3444804", "name": "Kodai Ueyoshi"}, {"authorId": "2699625", "name": "T. Marukame"}, {"authorId": "145797363", "name": "T. Asai"}, {"authorId": "34091148", "name": "M. Motomura"}, {"authorId": "145427025", "name": "A. Schmid"}], "citations": [{"paperId": "e0170564acb8007ed08615b774ebb72d441a1a9c", "title": "Integrated analog neurons inspired by mimicking synapses with metal-oxide memristive devices"}, {"paperId": "72851b004acecf83bc7bf469b41ebf2a1a55f313", "title": "Hardware Artificial Intelligence Driven by Interdisciplinary Fusion of Information Science, Neuroscience and Manufacturing"}, {"paperId": "7d21e75b76378c4a9348e610f0d398c8c8af5ee1", "title": "Deep-FS: A feature selection algorithm for Deep Boltzmann Machines"}, {"paperId": "7f8d73a40d9d0655ffb75279208c5ceafa74d2ec", "title": "Proposal, analysis and demonstration of Analog/Digital-mixed Neural Networks based on memristive device arrays"}, {"paperId": "88eb4bb7ec971cc8cbda2c45abb56d12238fa879", "title": "Artificial neuron operations and spike-timing-dependent plasticity using memristive devices for brain-inspired computing"}, {"paperId": "ef75206479be0ff9053763aa9e84e264791a6569", "title": "Robustness Evaluation of Restricted Boltzmann Machine against Memory and Logic Error"}, {"paperId": "e5d6d6b356409ab8bd8420896f0730d14a54927a", "title": "A survey on real time processing with spiking neural networks"}]}
