{"paperId": "15f0c83fd621a66a1e1aba5be439007c0f30ea22", "publicationVenue": {"id": "a59db0cb-8287-4db4-9378-0eb4c692f830", "name": "International Symposium on Service Oriented Software Engineering", "type": "conference", "alternate_names": ["IEEE International Conference on System of Systems Engineering", "Int Symp Serv Oriented Softw Eng", "International Conference on System of Systems Engineering", "SoSE", "Service Oriented Software Engineering", "Serv Oriented Softw Eng", "Int Conf Syst Syst Eng", "IEEE Int Conf Syst Syst Eng", "SOSE"]}, "title": "A Case of Automatically Deploying and Scaling Out Distributed Systems on the Cloud from Scratch", "abstract": "With the development of cloud computing, more and more enterprises are building their own cluster to deploy various types of distributed systems on the public cloud to satisfy their growing business need. In the process of migrating the business to the cloud, the enterprise faces two problems. The one is that the rental of virtual machines on the public cloud is a complicated process. Users need to understand and select a variety of parameters while the parameters of different public clouds are not the same. The other is that deployment and scale-out of distributed systems remain complex for inexperienced users. To address the above problem, this paper designs and implements a method for automatically deploying and scaling out Docklet, which is a typical distributed system, on the cloud from scratch. Finally, we present several examples to show the effectiveness.", "venue": "International Symposium on Service Oriented Software Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-26", "journal": {"name": "2018 IEEE Symposium on Service-Oriented System Engineering (SOSE)", "pages": "234-239"}, "authors": [{"authorId": "41132162", "name": "Yehong Zhong"}, {"authorId": "4955168", "name": "Junming Ma"}, {"authorId": "143706345", "name": "Bo An"}, {"authorId": "1761268", "name": "Donggang Cao"}], "citations": []}
