{"paperId": "15f8e31d3b3397d94db4dd1539ad91084630e1df", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "Design of Smart Roads - A Vision on Indian Smart Infrastructure Development", "abstract": "India is laying its steps rapidly towards Smart India, adopting technological advancements and implementations to make India more sustainable and citizen-friendly. Smart City's mission launched in the year 2015 to make cities smarter it ultimately makes India smarter and reliable. Infrastructure when adopts advance technologies enlighten the way of living, in this context, we designed a vision for smart roads. Though India is developing at full pace, the graph of road accidents per year due to bad road conditions has a very positive slope from the past two decades. The number of accidents due to potholes increased in the past few years, Integrating advanced technologies to the current road's infrastructure helps us to cut the number of accidents. Artificial Intelligent, Internet of Things, Machine Learning, Deep Learning, Cloud, Fog and Edge computing technologies help to design an accident prevention system further improves the safety and security of citizens.", "venue": "International Conference on Communication Systems and Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-01-01", "journal": {"name": "2020 International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "773-778"}, "authors": [{"authorId": "1557620421", "name": "S. Bhogaraju"}, {"authorId": "1557620375", "name": "Veera Rajesh Kumar Korupalli"}], "citations": [{"paperId": "ac76dc6ff4767b5f29dc9f9d5f70a899381519ad", "title": "A mobile application to aid emergency response through multi-stakeholders’ collaboration"}, {"paperId": "c3a47aec8c184fc88fee73a5aeef0071d284b0ef", "title": "IoT-Edge Computing for Efficient and Effective Information Process on Industrial Automation"}, {"paperId": "ab6f5f2e54e6a5106b735a2a043a6a2d31dea7be", "title": "Rapport of Counterfeit Profiles in Social Networking using Machine Learning Techniques"}, {"paperId": "7c6574c3a8944e8aed2f98efd6dfc16b990e51c6", "title": "Predicting California Bearing Ratio of Lateritic Soils Using Hybrid Machine Learning Technique"}, {"paperId": "992ce46ef4401db493635d7ed8004fd288b75d52", "title": "Machine Learning for Smart Cities: A Survey"}, {"paperId": "16e5a2143105be60ea4ca0466b3e479bbbf3f482", "title": "INTERNET OF THINGS (IOT) TECHNOLOGIES FOR SHIMLA CITY-A CASE STUDY"}, {"paperId": "34e1fb5c65f438137a1274945f15a25d363fdf2a", "title": "Artificial Intelligence: A Universal Virtual Tool to Augment Tutoring in Higher Education"}, {"paperId": "5c7b721b30fcb7612f2204ffffbfaf9672ba2eb2", "title": "IoT in Smart Cities: A Contemporary Survey"}, {"paperId": "657f0f3efc75b8397f2ec84d83093aebf105c241", "title": "Artificial Neural Network - Based Greenhouse Monitoring"}, {"paperId": "574c15fa27a2fbb2dfbe16b7041d9b00d8cb5646", "title": "Smart Roads Geometric Design Criteria and Capacity Estimation Based on AV and CAV Emerging Technologies. A Case Study in the Trans-European Transport Network"}, {"paperId": "aef8950d576f15171c571665e9c5c2a62fb24852", "title": "Smart Transportation System for Solving Urban Traffic Congestion"}, {"paperId": "59096a4c14d0fdc61081d2a17f46c7c3c3657393", "title": "Crowdsensing for Road Pavement Condition Monitoring: Trends, Limitations, and Opportunities"}, {"paperId": "58774221ef5a9d0573d17cf180fed0694195481f", "title": "Advanced Predictive Analytics for Control of Industrial Automation Process"}, {"paperId": "ed4ae84f9a18b237fcd1e070fff497bc6c8682f5", "title": "IoT and Machine Learning based Smart Agri -Farming System"}]}
