{"paperId": "16034d8e47bbbe7970099a839561a060f91e7651", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Recent Advances in Harris Hawks Optimization: A Comparative Study and Applications", "abstract": "The Harris hawk optimizer is a recent population-based metaheuristics algorithm that simulates the hunting behavior of hawks. This swarm-based optimizer performs the optimization procedure using a novel way of exploration and exploitation and the multiphases of search. In this review research, we focused on the applications and developments of the recent well-established robust optimizer Harris hawk optimizer (HHO) as one of the most popular swarm-based techniques of 2020. Moreover, several experiments were carried out to prove the powerfulness and effectivness of HHO compared with nine other state-of-art algorithms using Congress on Evolutionary Computation (CEC2005) and CEC2017. The literature review paper includes deep insight about possible future directions and possible ideas worth investigations regarding the new variants of the HHO algorithm and its widespread applications.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-20", "journal": {"name": "Electronics"}, "authors": [{"authorId": "32168818", "name": "A. Hussien"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2153733724", "name": "Raed Abu Zitar"}, {"authorId": "28001414", "name": "Fatma A. Hashim"}, {"authorId": "145099290", "name": "Mohamed Amin"}, {"authorId": "2098823249", "name": "Abeer Saber"}, {"authorId": "2524054", "name": "Khaled H. Almotairi"}, {"authorId": "1764455", "name": "A. Gandomi"}], "citations": [{"paperId": "aee4a245924f9bd83bfb4caaf1178d3dd63904dd", "title": "Application of metaheuristic optimization algorithms in predicting the compressive strength of 3D-printed fiber-reinforced concrete"}, {"paperId": "4bb02fd7730104ee5c66a0ef9e553ac1b53bd6ad", "title": "A comparative analysis of preying behavior-based metaheuristic algorithms for optimization of laser beam drilling processes"}, {"paperId": "2d39871ad1702c331524c124c98d88ae7a0559cf", "title": "A Comparative Study on Different Optimization Algorithms for Solving Economic Dispatch Problem"}, {"paperId": "17942f9d3134db854dfcc63f34e90b530a2aa07a", "title": "Solving Traveling Salesman Problem Using Parallel River Formation Dynamics Optimization Algorithm on Multi-core Architecture Using Apache Spark"}, {"paperId": "29cc21e305bafe289b6bd02601408edbb1be1494", "title": "Harris Hawks Optimization Algorithm for Dual-Resource Constrained Flexible Job Shop Scheduling Problem with Makespan Criterion"}, {"paperId": "f6db0e80ff71d327e8db63ebe7a8e05d26dee7ae", "title": "Three Chaotic Strategies for Enhancing the Self-Adaptive Harris Hawk Optimization Algorithm for Global Optimization"}, {"paperId": "217cfdd01d964a1b0b1f7b7e1ecc30d76bdd5e33", "title": "Optimizing Inference Distribution for Efficient Kidney Tumor Segmentation Using a UNet-PWP Deep-Learning Model with XAI on CT Scan Images"}, {"paperId": "05fc9d7c7cd19e92ecc282c323f271249b26c08a", "title": "Improved prairie dog optimization algorithm by dwarf mongoose optimization algorithm for optimization problems"}, {"paperId": "9409fd743dfb0689dac45544d05fc59e0395487c", "title": "An Improved Harris Hawks Optimization Algorithm and Its Application in Grid Map Path Planning"}, {"paperId": "940a87b3ecabde6ce923fdc21e1bf9600a6c31b7", "title": "Hunger games pattern search with elite opposite-based solution for solving complex engineering design problems"}, {"paperId": "ec58f3a9b2901e681432ae150bc3b32f340162be", "title": "Novel hybrid of AOA-BSA with double adaptive and random spare for global optimization and engineering problems"}, {"paperId": "acc64c09794cfa2df89fe37ceffdff49fb14b578", "title": "Improved Harris Hawks optimization for global optimization and engineering design"}, {"paperId": "ba9a7b695afafba8609679debb61fbcf33c93049", "title": "Novel memetic of beluga whale optimization with self-adaptive exploration–exploitation balance for global optimization and engineering problems"}, {"paperId": "5166b9e54ae03b7e59b5b127c1ab14297af3392d", "title": "A thermal error prediction model of the motorized spindles based on ABHHO-LSSVM"}, {"paperId": "16857ef591962192e4cef4c742f1b9feabfbc699", "title": "Performance Analysis of 5 G Wireless Hybrid Precoding Using Evolutionary Algorithms"}, {"paperId": "c5a8335eb0bb0a293051a0a1689a684c8230c228", "title": "Application research of combined model based on VMD and MOHHO in precipitable water vapor Prediction"}, {"paperId": "2244e161373ccfac48a78819f858469eb9ba0e3e", "title": "Improved bald eagle search algorithm for global optimization and feature selection"}, {"paperId": "981086d8bc78d5e4ddf121d5bb39dafc75ae5d4a", "title": "Smooth Exploration System: A novel ease-of-use and specialized module for improving exploration of whale optimization algorithm"}, {"paperId": "956f16973d4c85fd841a6ba7586c33e0e0a5fb28", "title": "Enhanced Harris hawk optimizer for hydrothermal generation scheduling with cascaded reservoirs"}, {"paperId": "04c6365ecade1f8fd7182cf04172300c74326149", "title": "A systematic review on fruit fly optimization algorithm and its applications"}, {"paperId": "96ab5a5a35da8fd513610817c506ece5f771c6cd", "title": "A novel Q-learning-based hybrid algorithm for the optimal offloading and scheduling in mobile edge computing environments"}, {"paperId": "2d4c5a6925cebd0966850e124fe7eb44d57f78b9", "title": "Kohonen neural network and symbiotic-organism search algorithm for intrusion detection of network viruses"}, {"paperId": "01b1930f79c9995e58677525890634a002e082bc", "title": "Big Data Analytics Using Artificial Intelligence"}, {"paperId": "6fed3564863bffc54f3d3351f40b04dff992e643", "title": "An enhanced aquila optimization algorithm with velocity-aided global search mechanism and adaptive opposition-based learning."}, {"paperId": "f1ed68067fb6bab0a02af382b76431a15f4cb9ab", "title": "BEESO: Multi-strategy Boosted Snake-Inspired Optimizer for Engineering Applications"}, {"paperId": "34e53a6bfcb9015125c8eb6a989b40bebb763f7d", "title": "A multi-strategy enhanced African vultures optimization algorithm for global optimization problems"}, {"paperId": "41285b78575ba6a35a490312f4c8bf1b5e02baa9", "title": "Elitist Harris Hawks Optimized Voltage Stability Enhancement in Radial Distribution System"}, {"paperId": "372d26369f8af7e7e98efc5b7a99a6ee720557e4", "title": "Enhancing grasshopper optimization algorithm (GOA) with levy flight for engineering applications"}, {"paperId": "50f0492f421595ddec924ab3c600c0682a0f0f0c", "title": "An efficient coverage method for SEMWSNs based on adaptive chaotic Gaussian variant snake optimization algorithm."}, {"paperId": "60f8e959ea5669f1bbee196be4c67c8c221ff73d", "title": "Optimized feature selection assists lithofacies machine learning with sparse well log data combined with calculated attributes in a gradational fluvial sequence"}, {"paperId": "33d80cc2a209057f2a1b2ea8b6893cf24be8ece8", "title": "Optimization of complex engineering problems using modified sine cosine algorithm"}, {"paperId": "1d084557a96ea7fd40ad1ee19ab1ac7680003622", "title": "An Enhanced Evaporation Rate Water-Cycle Algorithm for Global Optimization"}, {"paperId": "74625916ba1c1fe6706955c92732c4208f91048a", "title": "Fick's Law Algorithm: A physical law-based algorithm for numerical optimization"}, {"paperId": "e79aa958e5d85d89555a59757d050b0b9c124aeb", "title": "Kidney Tumor Detection and Classification Based on Deep Learning Approaches: A New Dataset in CT Scans"}, {"paperId": "f28746ac4e10bb73e326d606b0f31ae0bbd968ee", "title": "Enhanced Aquila optimizer algorithm for global optimization and constrained engineering problems."}]}
