{"paperId": "1603f2ee525226f474853267bf1d5867f17d9dcb", "publicationVenue": null, "title": "Comparative Study of Multi-query Optimization Techniques using Shared Predicate-based for Big Data", "abstract": "Big data analytical systems, such as MapReduce, have become main issues for many enterprises and research groups. Currently, multi-query which translated into MapReduce jobs is submitted repeatedly with similar tasks. So, exploiting these similar tasks can offer possibilities to avoid repeated computations of MapReduce jobs. Therefore, many researches have addressed the sharing opportunity to optimize multiquery processing. Consequently, the main goal of this work is to study and compare comprehensively two existed sharing opportunity techniques using predicate-based filters; MRShare and relaxed MRShare. The comparative study has been performed over TPC-H benchmark and confirmed that the relaxed MRShare technique significantly outperforms the MRShare for shared data in terms of predicate-based filters among multi-query.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-05-31", "journal": {"name": "International Journal of Grid and Distributed Computing", "pages": "229-240", "volume": "9"}, "authors": [{"authorId": "3298018", "name": "Radhya Sahal"}, {"authorId": "39023607", "name": "M. Khafagy"}, {"authorId": "2096096", "name": "F. Omara"}], "citations": [{"paperId": "955442a721a0c324c2cbf379de030653c6376938", "title": "A survey on Automatic Query Optimization Approaches in Multi Store Systems for Big Data Analytics"}, {"paperId": "61337f33a4ed84a0683a22acda599b52f06efd46", "title": "Exploiting Reused-Based Sharing Work Opportunities in Big Data Multiquery Optimization with Flink"}, {"paperId": "d4c02f4d74822c80ca02e2086e52030fde74848e", "title": "Performance Impact of Optimization Methods on MySQL Document-Based and Relational Databases"}, {"paperId": "15bfc384fc8ef43c2c4f3d43a4905f5e690406e6", "title": "Exploiting Sharing Join Opportunities in Big Data Multiquery Optimization with Flink"}, {"paperId": "405aa0527c41d7b1157b1874f28d76471d60b858", "title": "A Study on Establishing the Basic Direction for the Development of Korea's Highway Joint Area-Focused on the Hangdam-do Case"}, {"paperId": "442e0909092927465d9ce69c08502c5606b5495c", "title": "Influence of Internet-based Social Big Data on Personal Credit Reporting"}, {"paperId": "64a7db68998cfd57f79e479f14758cb895a05268", "title": "An Integrated Methodological Analysis for the Highest Best Use of Big Data-Based Real Estate Development"}, {"paperId": "41d1f3c0abac716b0b5b55a30e26c3030c0963b2", "title": "Hybrid-Key Stream Cipher Mechanism for Hadoop Distributed File System Security"}, {"paperId": "af8d33bb9feb8a9a0a18040ee380824e4cdb8ae8", "title": "Smurf Detector: a Detection technique of criminal entities involved in Money Laundering"}, {"paperId": "8b636c628393f6abb43f4fabf06c5ebf3de3080d", "title": "SOOM: Sort-Based Optimizer for Big Data Multi-Query"}, {"paperId": "1c7d2495d60501ed54552a399da2e950f27bf14a", "title": "A proposed model for predicting stock market behavior based on detecting fake news"}, {"paperId": "f89a3e89a509bee92e502c1ff27b0e760da02f49", "title": "Multi-split HDFS Technique for Improving Data Confidentiality in Big Data Replication"}, {"paperId": "62e721c657aca3d335eb260b912949400c7edc08", "title": "Recommender Systems Challenges and Solutions Survey"}, {"paperId": "b937b9c0f70320d50c90078448ceec25b27de652", "title": "Big data multi-query optimisation with Apache Flink"}, {"paperId": "e297474294010d2f594b146755a09ed454329ee7", "title": "iHOME: Index-Based JOIN Query Optimization for Limited Big Data Storage"}, {"paperId": "390f6031f3d39750249dea0c28361dafad7200b7", "title": "Region Clustering Based Multiple Query Optimization"}, {"paperId": "579411f0e6155ff4d4f91a3e609e8902386f1f47", "title": "Exploiting coarse-grained reused-based opportunities in Big Data multi-query optimization"}, {"paperId": "4378a09b676e7ad61f049c90061ad06f91799002", "title": "xploiting coarse-grained reused-based opportunities in Big Data ulti-query optimization adhya"}]}
