{"paperId": "1605bf39cf37c161fe3479b9031c028f84eec1c0", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Consider the Consequences: A Risk Assessment Approach for Industrial Control Systems", "abstract": "The development of information and communication technologies extended the application of digitalized industrial control systems (ICSs) to critical infrastructure. With this circumstance, emerging sophisticated cyberattacks by adversaries, including nation-backed terrorists, target ICSs due to their strategic value that critical infrastructure can cause severe consequences to equipment, people, and the environment due to the cyberattacks on ICSs. Therefore, critical infrastructure owners should provide high assurance to those involved, such as neighboring residents and governments, that the facility is adequately protected against cyberattacks. The risk assessment that identifies, estimates, and prioritizes risks is vital to provide high assurance. This study proposes a framework for evaluating risks by quantifying the likelihood of cyber exploitation and the consequences of cyberattacks. The quantification of the likelihood of cyber exploitation is inspired by research on Bayesian attack graphs (BAGs), allowing probability evaluation that considers the causal relationship between ICSs and multistage attacks. For the cyberattack consequences quantification, we propose a methodology to evaluate how far an impact will spread and thus how many functions will be influenced when an ICS is exploited. The methodology is conducted by ICS experts identifying and listing functional dependencies and essential function goals among ICSs that they are already familiar with and do not require in-depth cybersecurity knowledge. Through experiments, we demonstrated how to apply our framework to assess the risks of the plant protection system, which is a safety-grade digital system used in nuclear power plants. The result shows that risk can be multidimensionally assessed than previous literature, such as discovering that components that were not considered important have high risk due to their functional connectivity.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-22", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2080291388", "name": "Aram Kim"}, {"authorId": "51183870", "name": "Junhyoung Oh"}, {"authorId": "1646657671", "name": "Kook-huei Kwon"}, {"authorId": "2145201784", "name": "K. Lee"}], "citations": [{"paperId": "9d258e27bc37733d1c14d76e077a56d77b2e4dee", "title": "Impacts of 5G on cyber-physical risks for interdependent connected smart critical infrastructure systems"}, {"paperId": "297821dd59b9046fee01903abfa2c7fd344a8f29", "title": "Integrated Safety-Security Risk Assessment for Production Systems: A Use Case Using Bayesian Belief Networks"}, {"paperId": "7e7de5699df49f5e641381a01b04ee4412b85525", "title": "Computational Study of Security Risk Evaluation in Energy Management and Control Systems Based on a Fuzzy MCDM Method"}, {"paperId": "60fec897aa32c344ef088235a2568d084cc17b83", "title": "IMCSA: Providing Better Sequence Alignment Space for Industrial Control Protocol Reverse Engineering"}]}
