{"paperId": "1620ca6462fb20e17066d770ac714f1942cbcf4d", "publicationVenue": null, "title": "Surrogate-based Digital Twin for Predictive Fault Modelling and Testing of Cyber Physical Systems", "abstract": "Cyber Physical Systems (CPS) pose a pressing need to ensure they are sufficiently reliable and continue to be dependable. It is, therefore, essential to test these systems to uncover any potential anomalies, which if not detected can lead to failure and/or cause loss or injury. Adequate or complete coverage of behaviours can be difficult to accomplish in CPS. We advocate a less expensive and easy-to-evaluate representation of the system via surrogate modelling. In this paper, we present a novel predictive fault modelling framework leveraging surrogate-based Digital Twin for probing for likely faults that can support software analysts and testers of CPS in their testing plans. The approach abstracts the CPS and uses a variant of Recurrent Neural Network known as Long Short-Term Memory (LSTM) surrogate model for forecasting. The forecasting can help in predicting multiple behaviours of the system components and the likely faults of systems under test; observations will consequently feed into the testing plans. Both direct and iterative (i.e. one-time and multiple-time varying steps) forecasting are supported as part of the framework. We evaluate our surrogate-based Digital Twins predictive modelling approach on two CPSs namely: water distribution system and air pollution detection system. The results show that our approach performed decently in predicting multiple time steps.", "venue": "2022 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "pages": "166-169"}, "authors": [{"authorId": "51249067", "name": "H. Adeyemo"}, {"authorId": "1804288", "name": "Rami Bahsoon"}, {"authorId": "4023505", "name": "P. Tiňo"}], "citations": [{"paperId": "b1684a5f5f684fd70e1b8c3929c59afc92f913eb", "title": "Test Case Generation and Test Oracle Support for Testing CPSs using Hybrid Models"}, {"paperId": "d407d6ccba33f44ad998fdcbe1b85007a6362c5c", "title": "Secure Transmission Scheme for Smart Grid CPS with Digital Twin Architecture Based on Multi-Agent DRL"}, {"paperId": "02895d4c200b11bb28092b050ba073dcd65d7212", "title": "Enhanced multi-fidelity modelling for digital twin and uncertainty quantification"}]}
