{"paperId": "162ae2518ab277ec85055c63936547ce4c0de29b", "publicationVenue": null, "title": "State-of-the-Art techniques in Alzheimer’s Disease prediction and classification: A Comprehensive Review", "abstract": "Alzheimer’s disease (AD) is an incurable neurodegenerative state that leads to decrease in cognitive function, including loss of memory, abnormal behaviour, and language impairment. However, the reason behind the developmental causes of AD is still unclear. At present, there exists no known remedy for this particular ailment, but early detection is a key to developing more advanced treatments for AD. To diagnose early stages of AD, researchers typically use various deep learning models. It uses a variety of optimization and probabilistic techniques to enable machines to learn from large, complex datasets to predict and classify AD. We discuss various diagnostic techniques, neuroimaging modalities, and deep learning models used in AD research using the ADNI dataset. The main focus of this review will be to provide an in-depth review of earlier stage detection and classification of AD. The pipelined processing of neuro images results in detailed images of brain tissues. This helps in diagnosing the ailment more effectually. However, the intricate formations of the brain make it extremely challenging to distinguish between brain tissues and classify Alzheimer’s disease (AD) using conventional classification methods. Hence suitable neural network architecture is implemented for diagnostic purposes. Various Neural Network frameworks are discussed for predicting and classifying accurately. This comprehensive review contributes to our considerate thought of the present state of AD research and serves as a treasured source for researchers, medical professionals, and policy makers at work towards early finding and more accurate classification of AD. Finally, we discuss the main research questions and directions for future research.", "venue": "2023 9th International Conference on Smart Structures and Systems (ICSSS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-11-23", "journal": {"name": "2023 9th International Conference on Smart Structures and Systems (ICSSS)", "pages": "1-8"}, "authors": [{"authorId": "2281976426", "name": "B. Sathyabhama"}, {"authorId": "2281976424", "name": "M. Kannan"}], "citations": []}
