{"paperId": "16318df5de8ef02c05e5b363f0f3d19189db13d2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Context-Aware Edge-Based AI Models for Wireless Sensor Networks—An Overview", "abstract": "Recent advances in sensor technology are expected to lead to a greater use of wireless sensor networks (WSNs) in industry, logistics, healthcare, etc. On the other hand, advances in artificial intelligence (AI), machine learning (ML), and deep learning (DL) are becoming dominant solutions for processing large amounts of data from edge-synthesized heterogeneous sensors and drawing accurate conclusions with better understanding of the situation. Integration of the two areas WSN and AI has resulted in more accurate measurements, context-aware analysis and prediction useful for smart sensing applications. In this paper, a comprehensive overview of the latest developments in context-aware intelligent systems using sensor technology is provided. In addition, it also discusses the areas in which they are used, related challenges, motivations for adopting AI solutions, focusing on edge computing, i.e., sensor and AI techniques, along with analysis of existing research gaps. Another contribution of this study is the use of a semantic-aware approach to extract survey-relevant subjects. The latter specifically identifies eleven main research topics supported by the articles included in the work. These are analyzed from various angles to answer five main research questions. Finally, potential future research directions are also discussed.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-07-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2139883023", "name": "Ahmed A. Al-Saedi"}, {"authorId": "1781288", "name": "V. Boeva"}, {"authorId": "1721675", "name": "E. Casalicchio"}, {"authorId": "1489268703", "name": "Peter Exner"}], "citations": [{"paperId": "88df3947e5eb31b53265624c7636c3191b31e6b4", "title": "Emerging Sensor Communication Network-Based AI/ML Driven Intelligent IoT"}, {"paperId": "76e3298aee6acfa3e9ff9b95aa68ef0fc0605451", "title": "DL based wireless response prediction model for spectrum awareness"}, {"paperId": "55bfda2d234bf53e619d7d2e96d5a847ef504230", "title": "A Knowledge Graph Approach to Spectrum Explainability"}]}
