{"paperId": "1647f519b1a4b1d5ccb850bced823df2aded1755", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "Effective management of class imbalance problem in climate data analysis using a hybrid of deep learning and data level sampling", "abstract": "Climate change and its consequences for human life have emerged as the world’s most pressing challenge. Due to the complexity, veracity, and velocity of climate data, a traditional, simple, and single machine learning model will not be sufficient to perform effective and timely analysis. The climate data can be effectively analyzed, and climate models can be developed with the proposed hybrid model. The deep learning AutoEncoder (AE) is used for feature extraction, removal of redundant and noisy data. The Synthetic Minority class Oversampling (SMOTE) technique to generate samples in minority class to mitigate the imbalance in the sample distribution. Extreme Learning Machine (ELM) is used for further feature classification. The proposed method exploits big data strategies and the results interpretation process to extract accurate insight from climate data. ELM handles the class imbalance problem to improve the performance of the Early Warning System (EWS) model and fine-tune it. The hybrid method drastically reduces the computation cost and improves the accuracy to 93%, 86%, 95%, and 98% of four different datasets against other machine learning models. The experimental results of the AE_SMOTE_ELM model, compared with other state-of-the-art deep learning methods, shows accuracy and an efficiency of 90.4% and 91.76%, respectively, for two climate datasets.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-30", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "4187-4199", "volume": "43"}, "authors": [{"authorId": "145802629", "name": "R. J. Aarthi"}, {"authorId": "2712114", "name": "B. Vinayagasundaram"}], "citations": [{"paperId": "29b7441e41cd4951738626281d1452dcea9a58dd", "title": "Climate Change Adaptation and Mitigation using Deep Learning for Urban Environments"}]}
