{"paperId": "1649fa72ae91324321f6c610b8a0b8ab72ca25d2", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Open-World Social Event Classification", "abstract": "With the rapid development of Internet and the expanding scale of social media, social event classification has attracted increasing attention. The key to social event classification is effectively leveraging the visual and textual semantics for classification. However, most of the existing approaches may suffer from the following limitations: (1) Most of them just simply concatenate the image features and text features to get the multimodal features and ignore the fine-grained semantic relationship between modalities. (2) The majority of them hold the closed-world assumption that all classes in test are already seen in training, while this assumption can be easily broken in real-world applications. In practice, new events on Internet may not belong to any existing/seen class, and therefore cannot be correctly identified by closed-world learning algorithms. To tackle these challenges, we propose an Open-World Social Event Classifier (OWSEC) model in this paper. Firstly, we design a multimodal mask transformer network to capture cross-modal semantic relations and fuse fine-grained multimodal features of social events while masking redundant information. Secondly, we design an open-world classifier and propose a cross-modal event mixture mechanism with a novel open-world classification loss to capture the potential distribution space of the unseen class. Extensive experiments on two public datasets demonstrate the superiority of our proposed OWSEC model for open-world social event classification.", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-04-30", "journal": {"name": "Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "2070687", "name": "Shengsheng Qian"}, {"authorId": "2118061616", "name": "Hong Chen"}, {"authorId": "2106686837", "name": "Dizhan Xue"}, {"authorId": "6342229", "name": "Quan Fang"}, {"authorId": "2155590336", "name": "Changsheng Xu"}], "citations": [{"paperId": "cfe9a697334dc535253fc3a9955b394b7dcc7ec8", "title": "Multi-modal news event detection with external knowledge"}, {"paperId": "065906005c7a2d399f76b7357e865883f6d00018", "title": "Tri-relational multi-faceted graph neural networks for automatic question tagging"}, {"paperId": "50c3aa61f3e5472253675070f215702470c5ae09", "title": "Variational Causal Inference Network for Explanatory Visual Question Answering"}]}
