{"paperId": "164d453d8fcfe382f5f612399cb759f29530bba5", "publicationVenue": {"id": "35f2d652-9310-4864-8080-f431035f28b3", "name": "IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks", "type": "conference", "alternate_names": ["World Wirel Mob Multimedia Netw", "World of Wireless, Mobile and Multimedia Networks", "IEEE Int Symp World Wirel Mob Multimedia Netw", "WoWMoM"], "url": "http://www.wikicfp.com/cfp/program?id=3145"}, "title": "Intrusion Detection in Binary Process Data: Introducing the Hamming-distance to Matrix Profiles", "abstract": "The digitisation of industry provides a plethora of novel applications that increase flexibility and reduce setup and maintenance time as well as cost. Furthermore, novel use cases are created by the digitisation of industry, commonly known as Industry 4.0 or the Industrial Internet of Things, applications make use of communication and computation technology that is becoming available. This enables novel business use cases, such as the digital twin, customer individual production, and data market places. However, the inter-connectivity such use cases rely on also significantly increases the attack surface of industrial enterprises. Sabotage and espionage are aimed at data, which is becoming the most crucial asset of an enterprise. Since the requirements on security solutions in industrial networks are inherently different from office networks, novel approaches for intrusion detection need to be developed. In this work, process data of a real water treatment process that contains attacks is analysed. Analysis is performed by an extension of Matrix Profiles, a motif discovery algorithm for time series. By extending Matrix Profiles with a Hamming-distance metric, binary and tertiary actuators can be integrated into the analysis in a meaningful fashion. This algorithm requires low training effort while providing accurate results. Furthermore, it can be employed in a real-time fashion. Selected actuators in the data set are analysed to highlight the applicability of the extended Matrix Profiles.", "venue": "IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-17", "journal": {"name": "2020 IEEE 21st International Symposium on \"A World of Wireless, Mobile and Multimedia Networks\" (WoWMoM)", "pages": "347-353"}, "authors": [{"authorId": "144298272", "name": "S. D. Antón"}, {"authorId": "1752672", "name": "H. Schotten"}], "citations": [{"paperId": "5dd876e815461905fad649cb6321d2f65826ba87", "title": "Implementation of digital twins in the process industry: A systematic literature review of enablers and barriers"}, {"paperId": "2fe72db64e536e38ff76e598abe5c8253d6ca343", "title": "IPAL: Breaking up Silos of Protocol-dependent and Domain-specific Industrial Intrusion Detection Systems"}, {"paperId": "3b1fd96a7ef852522525f2283305fa03c6cc81ba", "title": "Can Industrial Intrusion Detection Be SIMPLE?"}]}
