{"paperId": "1666251269efeeaf0c73a1ae98e9b97cba497b76", "publicationVenue": {"id": "7cc3baec-aad9-4726-872c-48bbd0deb798", "name": "Frontiers in Nutrition", "type": "journal", "alternate_names": ["Front Nutr"], "issn": "2296-861X", "url": "https://www.frontiersin.org/journals/nutrition", "alternate_urls": ["http://journal.frontiersin.org/journal/nutrition", "http://www.frontiersin.org/nutrition"]}, "title": "Population food intake clusters and cardiovascular disease incidence: a Bayesian quantifying of a prospective population-based cohort study in a low and middle-income country", "abstract": "Aims This study was designed to explore the relationship between cardiovascular disease incidence and population clusters, which were established based on daily food intake. Methods The current study examined 5,396 Iranian adults (2,627 males and 2,769 females) aged 35 years and older, who participated in a 10-year longitudinal population-based study that began in 2001. The frequency of food group consumption over the preceding year (daily, weekly, or monthly) was assessed using a 49-item qualitative food frequency questionnaire (FFQ) administered via a face-to-face interview conducted by an expert dietitian. Participants were clustered based on their dietary intake by applying the semi-parametric Bayesian approach of the Dirichlet Process. In this approach, individuals with the same multivariate distribution based on dietary intake were assigned to the same cluster. The association between the extracted population clusters and the incidence of cardiovascular diseases was examined using Cox proportional hazard models. Results In the 10-year follow-up, 741 participants (401 men and 340 women) were diagnosed with cardiovascular diseases. Individuals were categorized into three primary dietary clusters: healthy, unhealthy, and mixed. After adjusting for potential confounders, subjects in the unhealthy cluster exhibited a higher risk for cardiovascular diseases [Hazard Ratio (HR): 2.059; 95% CI: 1.013, 4.184] compared to those in the healthy cluster. In the unadjusted model, individuals in the mixed cluster demonstrated a higher risk for cardiovascular disease than those in the healthy cluster (HR: 1.515; 95% CI: 1.097, 2.092). However, this association was attenuated after adjusting for potential confounders (HR: 1.145; 95% CI: 0.769, 1.706). Conclusion The results have shown that individuals within an unhealthy cluster have a risk that is twice as high for the incidence of cardiovascular diseases. However, these associations need to be confirmed through further prospective investigations.", "venue": "Frontiers in Nutrition", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-13", "journal": {"name": "Frontiers in Nutrition", "volume": "10"}, "authors": [{"authorId": "6963036", "name": "Reyhaneh Rikhtehgaran"}, {"authorId": "89597038", "name": "Khadije Shamsi"}, {"authorId": "2223383936", "name": "Elnaz Mojoudi Renani"}, {"authorId": "39671391", "name": "Arman Arab"}, {"authorId": "144275843", "name": "Fatemeh Nouri"}, {"authorId": "4906293", "name": "N. Mohammadifard"}, {"authorId": "2606727", "name": "H. Marateb"}, {"authorId": "1954812", "name": "M. Mansourian"}, {"authorId": "2871434", "name": "N. Sarrafzadegan"}], "citations": []}
