{"paperId": "166bc8227ce2beadb0ca4c2e6f19cb98c4798569", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Application of Artificial Intelligence in Predicting Earthquakes: State-of-the-Art and Future Challenges", "abstract": "Predicting the time, location and magnitude of an earthquake is a challenging job as an earthquake does not show specific patterns resulting in inaccurate predictions. Techniques based on Artificial Intelligence (AI) are well known for their capability to find hidden patterns in data. In the case of earthquake prediction, these models also produce a promising outcome. This work systematically explores the contributions made to date in earthquake prediction using AI-based techniques. A total of 84 scientific research papers, which reported the use of AI-based techniques in earthquake prediction, have been selected from different academic databases. These studies include a range of AI techniques including rule-based methods, shallow machine learning and deep learning algorithms. Covering all existing AI-based techniques in earthquake prediction, this article provides an account of the available methodologies and a comparative analysis of their performances. The performance comparison has been reported from the perspective of used datasets and evaluation metrics. Furthermore, using comparative analysis of performances the paper aims to facilitate the selection of appropriate techniques for earthquake prediction. Towards the end, it outlines some open challenges and potential research directions in the field.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "192880-192923", "volume": "8"}, "authors": [{"authorId": "1582951089", "name": "M. H. Banna"}, {"authorId": "5102294", "name": "K. A. Taher"}, {"authorId": "2075403860", "name": "M. Kaiser"}, {"authorId": "144774721", "name": "M. Mahmud"}, {"authorId": "2449870", "name": "Md. Sazzadur Rahman"}, {"authorId": "145294006", "name": "A. Hosen"}, {"authorId": "2259770862", "name": "Gi Hwan Cho"}], "citations": [{"paperId": "54fc838963777208b5cdf35ed661a8f810ec0289", "title": "Data-Driven Prediction of Seismic Intensity Distributions Featuring Hybrid Classification-Regression Models"}, {"paperId": "7609c69f425bef29a4a3ec832269a89fcb797bd4", "title": "The role of artificial intelligence and IoT in prediction of earthquakes: Review"}, {"paperId": "a7c5de615267aa8ba98315978ec96c4d677e9b9a", "title": "Forecasting the Magnitude Category Based on The Flores Sea Earthquake"}, {"paperId": "ba236c267f88307f7ee82019e0643256ebc8b9fb", "title": "Forecast earthquake precursor in the Flores Sea"}, {"paperId": "8c0b0405d8ef42aada5e97437a43b5a363991428", "title": "Virtual Scenarios of Earthquake Early Warning to Disaster Management in Smart Cities Based on Auxiliary Classifier Generative Adversarial Networks"}, {"paperId": "d2e7726268fd6d0383535df1b894549917908544", "title": "Application of Model-Based Time Series Prediction of Infrared Long-Wave Radiation Data for Exploring the Precursory Patterns Associated with the 2021 Madoi Earthquake"}, {"paperId": "de3a0fc3c4d2c6202a29f0fc376533a18651abb3", "title": "Neural Network with Cubature Kalman Filter for Earthquake Prediction in Java"}, {"paperId": "2b8b02a70da944546ed2d1fb3de0a494f467dac8", "title": "EPT: A data-driven transformer model for earthquake prediction"}, {"paperId": "31f6c2114bdf15b670685edb6e49898e699db5b9", "title": "Earthquake Magnitude Prediction using Deep Learning Techniques"}, {"paperId": "541fcebed4146cf4af9a06fb291d37377f3ed2a3", "title": "Uji Performa Prediksi Gempa Bumi di Jawa Timur dengan Artificial Neural Network"}, {"paperId": "681155165a40300665f12e238730a029823a0491", "title": "Técnicas de IA para el estudio de datos geomagnéticos y su implementación como precursores sísmicos: estado del arte"}, {"paperId": "7737bb31c9daf6448ed5959474373d6a5b2ad138", "title": "Machine learning for earthquake prediction: a review (2017–2021)"}, {"paperId": "744f9ccca84db281a4ffa7fb7af4b4fd4535f6a9", "title": "An attention-based LSTM network for large earthquake prediction"}, {"paperId": "04aaf2a2ab1b38f9a98cc8f19211bd345c59d476", "title": "Machine Learning for Emergency Management: A Survey and Future Outlook"}, {"paperId": "4330152358dc55bab8728a71d789d730306a73f7", "title": "Nonlinear Autoregressive Exogenous Neural Network for Earthquake Prediction in Indonesia"}, {"paperId": "86c4baed31a79ed185e55c9b8c530d0f8587483b", "title": "Short-term visibility prediction using tree-based machine learning algorithms and numerical weather prediction data"}, {"paperId": "a1bbed9271790e93933ba12e133fab4a8d892077", "title": "Short-term prediction of particulate matter (PM10 and PM2.5) in Seoul, South Korea using tree-based machine learning algorithms"}, {"paperId": "40acc3e9d760b95b60ee1ad35a31e2a4ee7f5a67", "title": "Indonesian Seismic Mitigation using Earthquake Predicted Artificial Intelligence Model"}, {"paperId": "44d5d5bee9b2b8dff38c7f444fcc8d2096c2bd8a", "title": "Anomaly detection on displacement rates and deformation pattern features using tree-based algorithm in Japan and Indonesia"}, {"paperId": "34710cf52b0d36d5d62cc54201f1a7311a8241c5", "title": "Immune optimization inspired artificial natural killer cell earthquake prediction method"}, {"paperId": "a93c595d0c7c6f5f516ee5a71e0eeebb87ab73ad", "title": "A deep learning approach for the development of an Early Earthquake Warning system"}, {"paperId": "29b0580a811d79bc2f23e021c077fb0083cff561", "title": "Structural recurrent neural network models for earthquake prediction"}, {"paperId": "51f5f9a40d60aaaae83b8a5250d876ae64ddba4d", "title": "Deep-Neural-Network-Based Estimation of Site Amplification Factor from Microtremor H/V Spectral Ratio"}, {"paperId": "2f6f23aa35e22e59e95fa030b80fedd924eb34ff", "title": "Introducing macrophages to artificial immune systems for earthquake prediction"}, {"paperId": "0f3f80d832f41c967362b6be1ac401de08503bf4", "title": "A CNN-BiLSTM model with attention mechanism for earthquake prediction"}, {"paperId": "05d6f5018792a93f1b46f7353827bed7c0e39a29", "title": "A novel SVM voltage supervisor"}, {"paperId": "e2ba8c09a229ed028c4987435661ece964a06e52", "title": "Artificial intelligence and internet of things in screening and management of autism spectrum disorder"}, {"paperId": "b7c17fe813b337cf1a6c5325ccb560b37eca2574", "title": "BiInNet: Bilateral Inversion Network for Real-Time Velocity Analysis"}, {"paperId": "07c6fd72029a8f065c191b18d4185c60a26b16e4", "title": "Keyboard Model of Seismic Cycle of Great Earthquakes in Subduction Zones: Simulation Results and Further Generalization"}, {"paperId": "47e5df90c58f62cbecdf80c3024041e7fc8e8298", "title": "24-hour cloud cover calculation using ground-based imager with machine learning"}, {"paperId": "c07d62f3fc8752d84a7bf176352ab8ecfe1f31e6", "title": "A Hybrid Deep Learning Model to Predict the Impact of COVID-19 on Mental Health form Social Media Big Data"}, {"paperId": "5aae5e90b06cbe418d1ffc4ecca16d265920c077", "title": "A framework for the prediction of earthquake using federated learning"}, {"paperId": "c579ebe4cf6697de0a0926e36fe2e946303ca917", "title": "COVID-19 Infection Detection from Chest X-Ray Images Using Hybrid Social Group Optimization and Support Vector Classifier"}, {"paperId": "2d8b6cb23af04283c712bbd217aafa82412fa7b2", "title": "Towards Social Group Optimization and Machine Learning Based Diabetes Prediction"}, {"paperId": "892eb1f9972f5b1a94973066dabf35f6f14963b7", "title": "Deep Learning in Mining Biological Data"}, {"paperId": "94dc7312a52ce6ba9ff1e8221b822b307695fe73", "title": "Seismic Velocity Inversion Based on Physically Constrained Neural Networks"}, {"paperId": "4b0ec661f227dd0bcc767267ba6ed4e15032811e", "title": "A Hybrid Deep Learning Model to Predict the Impact of COVID-19 on Mental Health From Social Media Big Data"}, {"paperId": "f6dc9d6b0a9ab51c7c3a87410d77e420ab249aec", "title": "2-D Deep Convolutional Neural Network for Predicting the Intensity of Seismic Events"}, {"paperId": "e28d7369ee81ec4cbeb7e8916a79ceb81f2da733", "title": "Optimizing Early Warning Classifiers to Control False Alarms via a Minimum Precision Constraint"}, {"paperId": "841383237137160686e2997f7002343463350460", "title": "A location-dependent earthquake prediction using recurrent neural network algorithms"}, {"paperId": "79f8d4252963e1ed1daa7f4a2e844453a4cf4112", "title": "Meta-Transfer Learning Using Wavelet Decomposition for Multi-Horizon Time Series Forecasting"}, {"paperId": "2158d058895f0df538699ef2cdeb126d65d6cc6e", "title": "Attention-Based Bi-Directional Long-Short Term Memory Network for Earthquake Prediction"}, {"paperId": "d2a2eb7df54d6898be9fb23b0fb0dbdbf84f5e7e", "title": "Probabilistic Artificial Neural Network for Line-Edge-Roughness-Induced Random Variation in FinFET"}, {"paperId": "a188230ef3b814f3321546e8f5851fce752563d6", "title": "Method to Enhance Classification of Skin Cancer Using Back Propagated Artificial Neural Network"}, {"paperId": "905dce55651389d4b45b56b175e4eacad5c1a441", "title": "Recognition of Dysfluency in Speech: A Bidirectional Long-Short Term Memory Based Approach"}, {"paperId": "628a521ffa0fa6291f0c2d7f2a4df740f5de050e", "title": "A Machine Learning Driven Android Based Mobile Application for Flower Identification"}, {"paperId": "f15d9f48fa6a34f4f755a567c9da283a1559fda7", "title": "Key Techniques and Challenges for Processing of Heart Sound Signals"}, {"paperId": "c12c61e0025c343dceb80956cde3afa061c7ccc3", "title": "An Attentional Model for Earthquake Prediction Using Seismic Data"}, {"paperId": "332fcf13cd10bf46140f4fcd1cd92f2637d9900d", "title": "An Attention-Based Mood Controlling Framework for Social Media Users"}, {"paperId": "40742d4f47c0ad0ceef59033d5a3b3900ab6f3a2", "title": "Security Threats and Artificial Intelligence Based Countermeasures for Internet of Things Networks: A Comprehensive Survey"}, {"paperId": "9347107cf58995e9917c6bc7d5dbac96d286f443", "title": "A Machine Learning Approach to Predict Events by Analyzing Bengali Facebook Posts"}, {"paperId": "986ceb344810e7182062a72aaa6eaa05985dfcf9", "title": "Study of Generative Artificial Intelligence’s Biases on the Example of Images Produced by the Stable Diffusion Model"}]}
