{"paperId": "166cf764ba96a2c2b8258f99f05a9a2149cb4663", "publicationVenue": null, "title": "IdroGEO: A Collaborative Web Mapping Application Based on REST API Services and Open Data on Landslides and Floods in Italy", "abstract": "The new national IdroGEO web platform allows the navigation, social sharing and download of data, maps, reports of the Italian Landslide Inventory, national hazard maps, and risk indicators. It is a tool for communication and dissemination of information to support decisions in risk mitigation policies, land use planning, preliminary design of infrastructures, prioritization of mitigation measures, management of civil protection emergencies, and environmental impact assessment. The challenges that have been faced during the design and development of the platform concern usability, access on multiple devices (smartphones, tablets, desktops), interoperability, transparency, reuse of information and software in the public sector, and improvement of the updating of the Italian Landslide Inventory. The methodologies and solutions adopted to address them include Progressive Web Application (PWA), Application Programming Interface (API), open standards, open libraries, and software. A landslide inventory management system has been developed via REST API for data entry and approval workflow in order to maintain the inventory in a distributed and collaborative manner. As a result, IdroGEO provides a public service for citizens, public administration, and professionals, using the “mobile first” approach and with scalable and reliable architecture. IdroGEO represents a solid infrastructure for the interoperability of data that serves as the foundation for creating a first knowledge-graph on landslides and the community who manages them.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-20", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "89", "volume": "10"}, "authors": [{"authorId": "103813712", "name": "C. Iadanza"}, {"authorId": "103467926", "name": "A. Trigila"}, {"authorId": "2156680", "name": "Paolo Starace"}, {"authorId": "133586826", "name": "A. Dragoni"}, {"authorId": "2061614145", "name": "Tommaso Biondo"}, {"authorId": "2061614142", "name": "Marco Roccisano"}], "citations": [{"paperId": "5165be01fc27eee5b1528c35bca8393c63d6b33e", "title": "Adopting the margin of stability for space–time landslide prediction – A data-driven approach for generating spatial dynamic thresholds"}, {"paperId": "2cde1da90882a09f3f1a295629a290a1ef8e0650", "title": "Using Citizen Science to Manage Odour Emissions in National IED Plants: A Systematic Review of the Scientific Literature"}, {"paperId": "7d48a57a1db34bb5fcb96c8440efe4b3e3635f89", "title": "A flood knowledge-constrained large language model interactable with GIS: enhancing public risk perception of floods"}, {"paperId": "1f1ecaee5e3ad9bf1458e73d8e53b93ca176645e", "title": "The impact of hydrogeological events on firms: Evidence from Italy"}, {"paperId": "ea52a30d4b2663afd743eb53ab0d02067ec591ea", "title": "Climate change increases the number of landslides at the juncture of the Alpine, Pannonian and Mediterranean regions"}, {"paperId": "4c2dc32a46ef5a5a531f425bd34bd3e35562905b", "title": "Advances on the investigation of landslides by space-borne synthetic aperture radar interferometry"}, {"paperId": "15a195cb03c4b8deb47c83afa99a83f4a7ac2732", "title": "Tracking a Decade of Hydrogeological Emergencies in Italian Municipalities"}, {"paperId": "17b700d720f35b05aafa4d0411dd6191a69bbd2f", "title": "A methodological framework of landslide quantitative risk assessment in areas with incomplete historical landslide information"}, {"paperId": "95e1a81d18818c28885b459f1f3b58556fa1a43d", "title": "Reliability assessment of open-source multiscale landslide susceptibility maps and effects of their fusion"}, {"paperId": "205262f409e0122e341b5d6ee05ccb5c1216aaad", "title": "From theory to practice: optimisation of available information for landslide hazard assessment in Rome relying on official, fragmented data sources"}, {"paperId": "6be64d84f9b3c2aa63e9c476fcc36963b3ee6d03", "title": "Web-Based Platforms for Landslide Risk Mitigation: The State of the Art"}, {"paperId": "29cfd0bd573512207e25b7bd2ab405ed35fe89c9", "title": "Deciphering seasonal effects of triggering and preparatory precipitation for improved shallow landslide prediction using generalized additive mixed models"}, {"paperId": "394fb7403931dfb5ce2cf4effbbdbf8dafefe76c", "title": "Investigation and preliminary assessment of the Casamicciola landslide in the island of Ischia (Italy) on November 26, 2022"}, {"paperId": "4147eebcc03b4514af7e4d145fe5dfdebc2d65ed", "title": "How can landslide risk maps be validated? Potential solutions with open-source databases"}, {"paperId": "83f0cbdb377a7704b74503585f7f8c75c5a4ad4b", "title": "Landslide susceptibility maps of Italy: Lesson learnt from dealing with multiple landslide types and the uneven spatial distribution of the national inventory"}, {"paperId": "5693a1a74ff13b90a15d865d637828bfdca270e1", "title": "Assessing the importance of conditioning factor selection in landslide susceptibility for the province of Belluno (region of Veneto, northeastern Italy)"}, {"paperId": "a2d777ecbc1013d64892bd44224a5746f26e5b92", "title": "Hydrological Web Services for Operational Flood Risk Monitoring and Forecasting at Local Scale in Niger"}, {"paperId": "354c3184adc3e7534dd78876be766ddc77f6012f", "title": "A methodological approach of QRA for slow-moving landslides at a regional scale"}, {"paperId": "7a051b2ce933c310232226487b525361ca5ae8a6", "title": "Role of Antecedent Rainfall in the Earthquake-Triggered Shallow Landslides Involving Unsaturated Slope Covers"}, {"paperId": "5c8e43eab62c737a02e8afc6735bc1b3dfc4e162", "title": "Assessing the importance of feature selection in Landslide Susceptibility for Belluno province (Veneto Region, NE Italy)"}, {"paperId": "2e6f3d2ac590a124a24284ee537e728961c4a6a3", "title": "Definition of Environmental Indicators for a Fast Estimation of Landslide Risk at National Scale"}, {"paperId": "a7424cd6f3704388bf8e7d5846712370f8cca228", "title": "A Contemporary Systematic Review of Cyberinfrastructure Systems and Applications for Flood and Drought Data Analytics and Communication"}, {"paperId": "f67bd2a7b5ab5a4e8077175b6b4c2a998f44bad0", "title": "“Guidelines for the classification and management of risk, for the evaluation of safety and for the monitoring of existing bridges”. Critical analysis and identification of innovative methods to improve the classification of landslide risk."}, {"paperId": "99fff0290b58b98e5dfc7c8ccaeb7bc572f196f6", "title": "AN OVERVIEW OF GEOINFORMATICS STATE-OF-THE-ART TECHNIQUES FOR LANDSLIDE MONITORING AND MAPPING"}]}
