{"paperId": "166ccfaa1cab23e27eeff5e792c5a7e9b968ab88", "publicationVenue": {"id": "39d9c543-102f-428f-b037-6b5a5569cb2d", "name": "Brazilian Symposium on Computer Networks and Distributed Systems", "type": "conference", "alternate_names": ["SBRC", "Braz Symp Comput Netw Distrib Syst"]}, "title": "Coordenação de Múltiplos Eventos Críticos de Saúde Por Redes Dinâmicas de Interesses Sociais", "abstract": "O atendimento apropriado de múltiplos eventos urbanos críticos depende de uma disseminação coordenada às entidades adequadas e no momento oportuno. Na área de saúde, ambientes estruturados como hospitais, por exemplo, suportam adequadamente a disseminação dos eventos críticos. Contudo, tratar esses eventos é um desafio fora desses ambientes, pois a falta de infraestrutura de rede compromete o serviço. Este artigo apresenta o sistema C-STEALTH para atender eventos críticos de saúde de maneira distribuída, mediante o agrupamento de dispositivos em comunidades através de redes dinâmicas. Essas estratégias oferecem um serviço resiliente à mobilidade das pessoas e às falhas de comunicação, confiabilidade na disseminação dos dados e redução da latência na sua entrega. Simulações no NS-3 mostram que C-STEALTH oferece uma confiabilidade de disseminação de eventos superior a 94% com uma latência de até 166ms e 100% de disponibilidade da rede em alguns casos.", "venue": "Brazilian Symposium on Computer Networks and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-07", "journal": {"pages": "477-490"}, "authors": [{"authorId": "2061109851", "name": "A. Batista"}, {"authorId": "103765968", "name": "G. A. D. Silva"}, {"authorId": "2092122731", "name": "M. N. Lima"}, {"authorId": "1515445024", "name": "A. Santos"}], "citations": [{"paperId": "6756a36956ae40514f5402a123253d37d3709aa1", "title": "MobAngelo: Assistência Emergencial em Ambientes urbanos"}]}
