{"paperId": "1672b010fe8abc50744b92a08bc9148c36aebe35", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "Is GPT Powerful Enough to Analyze the Emotions of Memes?", "abstract": "Large Language Models (LLMs), representing a significant achievement in artificial intelligence (AI) research, have demonstrated their ability in a multitude of tasks. This project aims to explore the capabilities of GPT-3.5, a leading example of LLMs, in processing the sentiment analysis of Internet memes. Memes, which include both verbal and visual aspects, act as a powerful yet complex tool for expressing ideas and sentiments, demanding an understanding of societal norms and cultural contexts. Notably, the detection and moderation of hateful memes pose a significant challenge due to their implicit offensive nature. This project investigates GPT's proficiency in such subjective tasks, revealing its strengths and potential limitations. The tasks include the classification of meme sentiment, determination of humor type, and detection of implicit hate in memes. The performance evaluation, using datasets from SemEval-2020 Task 8 and Facebook hateful memes, offers a comparative understanding of GPT responses against human annotations. Despite GPT's remarkable progress, our findings underscore the challenges faced by these models in handling subjective tasks, which are rooted in their inherent limitations including contextual understanding, interpretation of implicit meanings, and data biases. This research contributes to the broader discourse on the applicability of AI in handling complex, context-dependent tasks, and offers valuable insights for future advancements.", "venue": "International Conference on Machine Learning and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-11-01", "journal": {"name": "2023 International Conference on Machine Learning and Applications (ICMLA)", "pages": "1338-1343"}, "authors": [{"authorId": "2264192455", "name": "Jingjing Wang"}, {"authorId": "2263845369", "name": "Joshua Luo"}, {"authorId": "2264168536", "name": "Grace Yang"}, {"authorId": "2264076177", "name": "Allen Hong"}, {"authorId": "2263712541", "name": "Feng Luo"}], "citations": []}
