{"paperId": "1688452a7f88530d4679b2d233e059507c630348", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Comprehensive Survey on Enterprise Financial Risk Analysis: Problems, Methods, Spotlights and Applications", "abstract": "—Enterprise ﬁnancial risk analysis aims at predicting the future ﬁnancial risk of enterprises. Due to its wide and signiﬁcant application, enterprise ﬁnancial risk analysis has always been the core research topic in the ﬁelds of Finance and Management. Although there are already some valuable and impressive surveys on enterprise risk analysis from the perspective of Finance and Management, these surveys introduce approaches in a relatively isolated way and lack recent advances in enterprise ﬁnancial risk analysis. Due to the rapid expansion of the enterprise risk research area, especially from the Computer Science and Big Data perspective, it is both necessary and challenging to comprehensively review the relevant studies. This survey attempts to connect and systematize the existing enterprise ﬁnancial risk studies, i.e. to summarize and interpret the problems, methodologies, spotlights and applications of enterprise ﬁnancial risk analysis in a comprehensive way, which may help readers to have a better understanding of the current research status and ideas. Unlike previous surveys, this paper attempts to provide a systematic literature survey of enterprise risk analysis approaches from the ﬁelds of Finance, Management, as well as Computer Science, which reviews more than 300 representative articles in the past almost 50 years (from 1968 to 2022). In particular, we ﬁrst introduce the problems of the types, granularity, intelligence and evaluation metrics of enterprise ﬁnancial risk, and summarize the representative works in terms of them perspectively. Then, we compare the analysis methods used to learn enterprise ﬁnancial risk, and summarize the spotlights of the most representative works. Finally, the applications of enterprise risk analysis are also brieﬂy introduced. Our goal is to clarify current cutting-edge research and its possible future directions to model enterprise risk, aiming to fully understand the mechanisms of enterprise risk generation and contagion and its application on corporate governance, ﬁnancial institution and government regulation.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2211.14997"}, "authors": [{"authorId": "2110262691", "name": "Yu Zhao"}, {"authorId": "94613261", "name": "Huaming Du"}], "citations": []}
