{"paperId": "1695833bae176400ac174eda1d3482d7d1d51064", "publicationVenue": {"id": "47e0888a-1a02-4c10-896a-464d8d7572a4", "name": "International Conference on Computing, Networking and Communications", "type": "conference", "alternate_names": ["International Conference on Networking and Computing", "ICNC", "CoCoNet", "Int Conf Nat Comput", "International Conference on Natural Computation", "International Conference on Computing and Network Communications", "Int Conf Comput Netw Commun", "Int Conf Netw Comput"]}, "title": "SAND: A Social-Aware and Distributed Scheme for Device Discovery in the Internet of Things", "abstract": "The Internet of Things (IoT) is continuously growing to connect billions of smart devices anywhere and anytime in an Internet-like structure, which enables a set of new applications, services and interactions between human and objects. In the future, the smart devices are supposed to be able to autonomously discover a target device with desired features and cooperate on generating new services. The pervasiveness of smart devices, as well as the heterogeneity of their design and functionalities, raise a major concern: How can a smart device efficiently discover a desired target device? In this paper, we propose a Social-Aware and Distributed (SAND) scheme that achieves a fast, scalable and effective device discovery in the IoT. The proposed SAND scheme adopts a novel device ranking criteria that measures the device’s degree, social relationship diversity, clustering coefficient and betweenness. Based on this, the discovery request can be guided to travel through critical devices that stand at the major intersections of the network, and thus quickly reach the desired target device while contacting only a limited number of intermediate devices. We conduct comprehensive simulations to evaluate SAND in terms of the discovery success rate and the number of devices contacted. The simulation results demonstrate the effectiveness of SAND.", "venue": "International Conference on Computing, Networking and Communications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-03-05", "journal": {"name": "2018 International Conference on Computing, Networking and Communications (ICNC)", "pages": "38-42"}, "authors": [{"authorId": "32735494", "name": "James Sunthonlap"}, {"authorId": "2056638765", "name": "Phuoc Nguyen"}, {"authorId": "2144222079", "name": "Hao Wang"}, {"authorId": "50861172", "name": "Mohammad Pourhomanyoun"}, {"authorId": "1779394214", "name": "Yuqing Zhu"}, {"authorId": "2433360", "name": "Z. Ye"}], "citations": [{"paperId": "dc3548c0549d88c7ce71896eb2bda9c3d9fdbb2b", "title": "Social Internet of Things (SIoT): Foundations, thrust areas, systematic review and future directions"}]}
