{"paperId": "16a0041a284c96079e0de6ec32ae01f64062e4d4", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Interactive Real-Time Monitoring and Information Traceability for Complex Aircraft Assembly Field Based on Digital Twin", "abstract": "High-quality aircraft assembly is critical in aircraft manufacturing. To meet increasing quality demands, the aircraft assembly process needs to be monitored in real time. In recent years, digital twins have attracted increasing interest in different applications. However, due to the heterogeneous data and multiple protocols in the assembly field, the large amount of data needs to satisfy high throughput, low latency, and low storage cost requirements without interrupting the assembly process, which introduces challenges to real-time monitoring systems. In this article, a real-time monitoring system based on the digital twin that provides interactive services for users based on multisource, multidimensional data, and sophisticated analyses is designed. Moreover, we introduce a time series database (TSDB) for dynamic data storage and SQLServer for static data storage. Time series data can be regarded as a standard type of organized data that are convenient for hierarchical representations and constructing multidimensional data cubes for information traceability. The storage cost is significantly reduced because the compression rate reaches 3.8%. Furthermore, the powerful and comprehensive analysis engine of the TSDB ensures that the monitoring system has real-time responses of less than 4 ms. In addition, a flexible and scalable system that collects multidimensional data without affecting the existing workflow is proposed. We perform various experiments to verify the feasibility and effectiveness of assembling large-scale aircraft components. This study provides a solid data foundation for accelerating the pace of intelligent aircraft manufacturing.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "9745-9756", "volume": "19"}, "authors": [{"authorId": "2200073729", "name": "Yajun Li"}, {"authorId": "2157221946", "name": "Wei Liu"}, {"authorId": "49889630", "name": "Yang Zhang"}, {"authorId": "2157270500", "name": "Wenlong Zhang"}, {"authorId": "36956274", "name": "Changyong Gao"}, {"authorId": "2200088865", "name": "Qihang Chen"}, {"authorId": "2200163497", "name": "Yuqi Ji"}], "citations": [{"paperId": "c6386d78580f9b404c92473b5afa8fc3c5311c4e", "title": "Implementation of Digital Twin in Actual Production: Intelligent Assembly Paradigm for Large-Scale Industrial Equipment"}, {"paperId": "8239486284a7282e36c08208475695af0bb79057", "title": "A review of digital twin intelligent assembly technology and application for complex mechanical products"}]}
