{"paperId": "16aeb2118546ad6479b8be4d233e87fd7d10a4a5", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Study on the permeability coefficient model of salinized frozen soil based on unfrozen water content curve", "abstract": "Due to the fact that the permeability coefficient of salinized frozen soil is difficult to measure through experimental test, this paper develops a model of the permeability coefficient of salinized frozen soil by using SFCC curves, which takes into account the effects of velocity slip on pore wall and seepage of unfrozen water film. This model is on the basis of capillary bundle model, and combines with phase diagram theory of water-salt binary system. For the silty clay from Qinghai-Tibet Plateau and silts from Onedia, the permeability coefficient fluctuation vs. temperature is calculated using the model. The estimated calculations of the permeability coefficient model were all found to be in good agreement with the experimental data by comparison. Additionally, the variation trend of permeability coefficient of NaCl, Na2SO4, and Na2CO3 type saline soils containing different salt contents is examined. The results indicate that before saline soils freeze, NaCl does not crystallize and thus has little impact on the permeability coefficient, whereas Na2SO4 and Na2CO3 both crystallize and block the pores, the permeability coefficient decreases with decreasing temperature. Once the saline soils have frozen, the freezing temperature has a larger impact on the permeability coefficient. During the early stage of freezing, the lower the freezing temperature is, the larger the permeability coefficient is. In the late stage of freezing, the permeability coefficients with various salt contents tended to be the same.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-04", "journal": {"volume": "10"}, "authors": [{"authorId": "32859820", "name": "G. Liu"}, {"authorId": "1708494", "name": "Zhi-Li Zhang"}, {"authorId": "102400324", "name": "Zhemian Cheng"}, {"authorId": "2052269322", "name": "Geng Hao"}, {"authorId": "2153968248", "name": "Yufeng Hao"}, {"authorId": "27818684", "name": "Tingrui Fu"}], "citations": [{"paperId": "3b2daea1f0f02e3bb44ca2337bfd73f35d250208", "title": "Experimental study on the effect of freeze-thaw cycles on the shear characteristics of frozen soil-composite geotextile interface"}, {"paperId": "4304631939921c3372664e26cd1644d0ce588048", "title": "Thermal consolidation of layered saturated soil under time‐dependent loadings and heating considering interfacial flow contact resistance effect"}, {"paperId": "d81ce283ce905e55ecda8f82d3499e2ac9dac027", "title": "Research progress and prospect of frozen soil engineering disasters"}]}
