{"paperId": "16c4c492dde2b2cc93f72e4e05682976c5874401", "publicationVenue": null, "title": "Fast and Reliable Missing Data Contingency Analysis with Predicate-Constraints", "abstract": "Today, data analysts largely rely on intuition to determine whether missing or withheld rows of a dataset significantly affect their analyses. We propose a framework that can produce automatic contingency analysis, i.e., the range of values an aggregate SQL query could take, under formal constraints describing the variation and frequency of missing data tuples. We describe how to process SUM, COUNT, AVG, MIN, and MAX queries in these conditions resulting in hard error bounds with testable constraints. We propose an optimization algorithm based on an integer program that reconciles a set of such constraints, even if they are overlapping, conflicting, or unsatisfiable, into such bounds. Our experiments on real-world datasets against several statistical imputation and inference baselines show that statistical techniques can have a deceptively high error rate that is often unpredictable. In contrast, our framework offers hard bounds that are guaranteed to hold if the constraints are not violated. In spite of these hard bounds, we show competitive accuracy to statistical baselines.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-04-08", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "2132479347", "name": "Xi Liang"}, {"authorId": "2313853", "name": "Zechao Shang"}, {"authorId": "114189441", "name": "Aaron J. Elmore"}, {"authorId": "40428703", "name": "S. Krishnan"}, {"authorId": "143666627", "name": "M. Franklin"}], "citations": [{"paperId": "2ef26e4a6bbbe12f4b0043328db7310c753d3fac", "title": "In-Database Data Imputation"}, {"paperId": "d6702c8dd433162325a5124e7b23c2b1606accd9", "title": "Discovery and Matching Numerical Attributes in Data Lakes"}, {"paperId": "5712e34c2d502d3879df049e69fb438861aeb0b2", "title": "Splitting Tuples of Mismatched Entities"}, {"paperId": "a65e245e5a881f8601361b4377fc9cda5072d2f0", "title": "Quantifying Uncertainty in Aggregate Queries over Integrated Datasets"}, {"paperId": "c801c811e54d2d5e204eb4701a5efb7f401320a6", "title": "Efficient Approximation of Certain and Possible Answers for Ranking and Window Queries over Uncertain Data (Extended version)"}, {"paperId": "6167b4dbf677b78c229524431cd5064b45395db0", "title": "JanusAQP: Efficient Partition Tree Maintenance for Dynamic Approximate Query Processing"}, {"paperId": "de08df783380ccf9e56f192e52f8cad21abd7ca3", "title": "Combining Aggregation and Sampling (Nearly) Optimally for Approximate Query Processing"}, {"paperId": "5ad384ad0359d7497296d79cace2518d6fc59a0f", "title": "Efficient Uncertainty Tracking for Complex Queries with Attribute-level Bounds"}, {"paperId": "c7d17ab65ed7f640cc35360142275c4b35c52f59", "title": "Edinburgh Research Explorer In-Database Data Imputation"}]}
