{"paperId": "16c816201eb629a758676a3c1fa4cead50e5f412", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "When Large Language Models Meet Vector Databases: A Survey", "abstract": "This survey explores the synergistic potential of Large Language Models (LLMs) and Vector Databases (VecDBs), a burgeoning but rapidly evolving research area. With the proliferation of LLMs comes a host of challenges, including hallucinations, outdated knowledge, prohibitive commercial application costs, and memory issues. VecDBs emerge as a compelling solution to these issues by offering an efficient means to store, retrieve, and manage the high-dimensional vector representations intrinsic to LLM operations. Through this nuanced review, we delineate the foundational principles of LLMs and VecDBs and critically analyze their integration's impact on enhancing LLM functionalities. This discourse extends into a discussion on the speculative future developments in this domain, aiming to catalyze further research into optimizing the confluence of LLMs and VecDBs for advanced data handling and knowledge extraction capabilities.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-30", "journal": {"name": "ArXiv", "volume": "abs/2402.01763"}, "authors": [{"authorId": "15217571", "name": "Zhi Jing"}, {"authorId": "2278407298", "name": "Yongye Su"}, {"authorId": "2260277757", "name": "Yikun Han"}, {"authorId": "2282533661", "name": "Bo Yuan"}, {"authorId": "2260396712", "name": "Haiyun Xu"}, {"authorId": "2260828894", "name": "Chunjiang Liu"}, {"authorId": "2266796043", "name": "Kehai Chen"}, {"authorId": "2267153486", "name": "Min Zhang"}], "citations": [{"paperId": "f82bad9b9d63df2c02d5273181e95b3ef2125bad", "title": "Advanced Network Intrusion Detection with TabTransformer"}, {"paperId": "7cd830ef711c3085bdd22a9b214af232de0817b0", "title": "Utilizing Deep Learning for Crystal System Classification in Lithium - Ion Batteries"}, {"paperId": "b804bac55ac4e9e8c30ef6aab765568f5332bc85", "title": "Chain-of-Interaction: Enhancing Large Language Models for Psychiatric Behavior Understanding by Dyadic Contexts"}, {"paperId": "88d4b0084e030e0feeb5a7aa9ac32eb081c36a46", "title": "Large Language Models on Fine-grained Emotion Detection Dataset with Data Augmentation and Transfer Learning"}]}
