{"paperId": "16d3ca7b6985b4f4e6493feae1770e681b7a56a3", "publicationVenue": {"id": "0cd529c6-3b94-4b55-9612-d9ffcca443b9", "name": "Asia Pacific Symposium on Intelligent and Evolutionary Systems", "type": "conference", "alternate_names": ["International Electronics Symposium", "IEEE Symp Intell Embed Syst", "IES", "Asia Pac Symp Intell Evol Syst", "Int Electron Symp", "IEEE Symposium on Intelligent Embedded Systems"]}, "title": "Implementation of Private Blockchain Extension on Open Source IoT Platform using Hyperledger Besu", "abstract": "The Internet of Things has been rapidly developed in many applications. Currently, a lot of IoT applications are using a conventional database as their data accumulation process. A conventional database is centralized and not immutable. So, data security will be a challenging task in IoT applications, especially for confidential data and reliable data. In this research, we would like to build a comprehensive security system to increase IoT data security in the IoT platform. The proposed system is an implementation of blockchain extension in the IoT platform as a connector to the blockchain network. Blockchain extension will be contained of WebSocket, Kafka, and smart contracts. WebSocket act as a data collector from the IoT platform, Kafka act as data queue processing, and the smart contract will act as data models and contract that will be stored and executed as a transaction of data in the blockchain. Kafka makes the blockchain extension more accessible from the outside platform, so users are able to build their smart contract by subscribing to Kafka’s topic. We have tested our system on several bandwidths in several scenarios (Blockchain API execution time, Blockchain API speed, Blockchain, retention performance, and Smart Contract Vulnerability Testing). In Kafka, the optimal Transaction Per Second value is on 8Mbps with 0.76TPS and the smallest TPS value is 0.46TPS at 2Mbps. We also tested the smart contract vulnerability, the results are high severity, and the estimated gas will be 29898 – 136483 gas fees.", "venue": "Asia Pacific Symposium on Intelligent and Evolutionary Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-08-08", "journal": {"name": "2023 International Electronics Symposium (IES)", "pages": "507-513"}, "authors": [{"authorId": "2239285079", "name": "Agus Prayudi"}, {"authorId": "1831245", "name": "S. Sukaridhoto"}, {"authorId": "2196657028", "name": "Udin Harun Al Rasyid"}, {"authorId": "9156592", "name": "R. Budiarti"}, {"authorId": "2175588358", "name": "Oktafian Sultan Hakim"}], "citations": [{"paperId": "ceb67f9d17f6609191e5e45f9a7758b23bc6b767", "title": "Blockchain Integration for Mixed Reality Based Smart Lab Systems"}]}
