{"paperId": "16e046faabc832644cd0825a5bc53f28a0d9cb0d", "publicationVenue": {"id": "dd338a4b-b131-4330-b3d2-a93589833609", "name": "Journal of Ecological Engineering", "type": "journal", "alternate_names": ["J Ecol Eng"], "issn": "2299-8993", "url": "http://www.jeeng.net/"}, "title": "Improving Crop Yield Predictions in Morocco Using Machine Learning Algorithms", "abstract": "In Morocco, agriculture is an important sector that contributes to the country’s economy and food security. Accu - rately predicting crop yields is crucial for farmers, policy makers, and other stakeholders to make informed deci - sions regarding resource allocation and food security. This paper investigates the potential of Machine Learning algorithms for improving the accuracy of crop yield predictions in Morocco. The study examines various factors that affect crop yields, including weather patterns, soil moisture levels, and rainfall, and how these factors can be incorporated into Machine Learning models. The performance of different algorithms, including Decision Trees, Random Forests, and Neural Networks, is evaluated and compared to traditional statistical models used for crop prediction. The study demonstrated that the Machine Learning algorithms outperformed the Statistical models in predicting crop yields. Specifically, the Machine Learning algorithms achieved mean squared error values between 0.10 and 0.23 and coefficient of determination values ranging from 0.78 to 0.90, while the Statistical models had mean squared error values ranging from 0.16 to 0.24 and coefficient of determination values ranging from 0.76 to 0.84. The Feed Forward Artificial Neural Network algorithm had the lowest mean squared error value (0.10) and the highest R ² value (0.90), indicating that it performed the best among the three Machine Learning algorithms. These results suggest that Machine Learning algorithms can significantly improve the accuracy of crop yield pre - dictions in Morocco, potentially leading to improved food security and optimized resource allocation for farmers.", "venue": "Journal of Ecological Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Journal of Ecological Engineering"}, "authors": [{"authorId": "2213653792", "name": "Rachid Ed-Daoudi"}, {"authorId": "47137168", "name": "A. Alaoui"}, {"authorId": "2177937", "name": "B. Ettaki"}, {"authorId": "51103604", "name": "J. Zerouaoui"}], "citations": [{"paperId": "e416636c0d621b2d0d30bb1b70eaee45f84b1c71", "title": "Remote sensing technologies for modelling groundwater storage dynamics: Comprehensive review"}, {"paperId": "4400a9f9ba227fd5096cc3b454946aa030db4b9e", "title": "Machine learning for food security: current status, challenges, and future perspectives"}, {"paperId": "7e5b4962f34f5fd62d489b3da9b21da45ca37464", "title": "Developing a Sustainable Machine Learning Model to Predict Crop Yield in the Gulf Countries"}, {"paperId": "cf143ae7396efddcfdcd74a8388451b92c1a5e0a", "title": "Analysis of Relationship between Grain Yield and NDVI from MODIS in the Fez-Meknes Region, Morocco"}, {"paperId": "c5c32ab6bd868b1db51fc8ceab7d4ae39105e695", "title": "A Machine Learning Approach to Identify Optimal Cultivation Practices for Sustainable apple Production in Precision Agriculture in Morocco"}]}
