{"paperId": "16e7befba3a42ba99af6a1242301fa81d3b801de", "publicationVenue": null, "title": "SWARM: Adaptive Load Balancing in Distributed Streaming Systems for Big Spatial Data", "abstract": "\n The proliferation of GPS-enabled devices has led to the development of numerous location-based services. These services need to process massive amounts of streamed spatial data in real-time. The current scale of spatial data cannot be handled using centralized systems. This has led to the development of distributed spatial streaming systems. Existing systems are using static spatial partitioning to distribute the workload. In contrast, the real-time streamed spatial data follows non-uniform spatial distributions that are continuously changing over time. Distributed spatial streaming systems need to react to the changes in the distribution of spatial data and queries. This article introduces SWARM, a lightweight adaptivity protocol that continuously monitors the data and query workloads across the distributed processes of the spatial data streaming system and redistributes and rebalances the workloads as soon as performance bottlenecks get detected. SWARM is able to handle multiple query-execution and data-persistence models. A distributed streaming system can directly use SWARM to adaptively rebalance the system’s workload among its machines with minimal changes to the original code of the underlying spatial application. Extensive experimental evaluation using real and synthetic datasets illustrate that, on average, SWARM achieves 2\n \n \n \n \n \n \n \n improvement in throughput over a static grid partitioning that is determined based on observing a limited history of the data and query workloads. Moreover, SWARM reduces execution latency on average 4\n \n \n \n \n \n \n \n compared with the other technique.\n", "venue": "ACM Trans. Spatial Algorithms Syst.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-27", "journal": {"name": "ArXiv", "volume": "abs/2002.11862"}, "authors": [{"authorId": "2279240", "name": "Anas Daghistani"}, {"authorId": "1709661", "name": "W. Aref"}, {"authorId": "1696394", "name": "A. Ghafoor"}, {"authorId": "145412742", "name": "Ahmed R. Mahmood"}], "citations": [{"paperId": "11c26cfcee4adeb81fd3c0ea81fc27877128352a", "title": "Towards Mobility Data Science (Vision Paper)"}, {"paperId": "797601c1b73acc8d98046281383bb63f80fbb42d", "title": "Improving the Efficiency of the EMS-Based Smart City: A Novel Distributed Framework for Spatial Data"}, {"paperId": "33907be08194d8f4262787ad16f05143b589a223", "title": "Guard: Attack-Resilient Adaptive Load Balancing in Distributed Streaming Systems"}, {"paperId": "b77a705565304067d3cd1db53a7016566d4f45c3", "title": "ILX: Intelligent \"Location+X\" Data Systems (Vision Paper)"}, {"paperId": "179dac326d74d14a53a75884e865c0df48dfeac5", "title": "Beast: Scalable Exploratory Analytics on Spatio-temporal Data"}, {"paperId": "5b8811596330bb426427338897f537e065238d58", "title": "Scalable Data Partitioning Techniques for Distributed Data Processing in Cloud Environments: A Review"}, {"paperId": "bb629847e0cedcdc224703376fc50201d1e6c032", "title": "Mobility Data Science: Perspectives and Challenges ∗"}]}
