{"paperId": "16e95a21e3cb7b79b6f907b90e8e859377c8aac3", "publicationVenue": {"id": "9fe230fc-d0a3-45d6-86ab-82ae6e7fc46b", "name": "JMIR Aging", "issn": "2561-7605", "url": "https://aging.jmir.org/"}, "title": "Emerging Technologies With Potential Care and Support Applications for Older People: Review of Gray Literature", "abstract": "Background The number of older people with unmet care and support needs is increasing substantially due to the challenges facing the formal and informal care systems. Emerging technological developments have the potential to address some of the care and support challenges of older people. However, limited work has been done to identify emerging technological developments with the potential to meet the care and support needs of the aging population. Objective This review aimed to gain an overview of emerging technologies with potential care and support applications for older people, particularly for those living at home. Methods A scoping gray literature review was carried out by using the databases of 13 key organizations, hand searching reference lists of included documents, using funding data, and consulting technology experts. A narrative synthesis approach was used to analyze and summarize the findings of the literature review. Results A total of 39 documents were included in the final analysis. From the analysis, 8 emerging technologies were identified that could potentially be used to meet older people’s needs in various care and support domains. These emerging technologies were (1) assistive autonomous robots; (2) self-driving vehicles; (3) artificial intelligence–enabled health smart apps and wearables; (4) new drug release mechanisms; (5) portable diagnostics; (6) voice-activated devices; (7) virtual, augmented, and mixed reality; and (8) intelligent homes. These emerging technologies were at different levels of development, with some being trialed for care applications, whereas others being in the early phases of development. However, only a few documents mentioned including older people during the process of designing and developing these technologies. Conclusions This review has identified key emerging technologies with the potential to contribute to the support and care needs of older people. However, to increase the adoption of these technologies by older people, there is a need to involve them and other stakeholders, such as formal and informal carers, in the process of designing and developing these technologies.", "venue": "JMIR Aging", "year": 2019, "fieldsOfStudy": ["Business", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-12-03", "journal": {"name": "JMIR Aging", "volume": "3"}, "authors": [{"authorId": "50507288", "name": "Sarah Abdi"}, {"authorId": "6676439", "name": "L. D. de Witte"}, {"authorId": "30541906", "name": "M. Hawley"}], "citations": [{"paperId": "f19db442bf97452918710701d94f89cfb8149114", "title": "Children’s and Families’ Perspectives and Understanding of Children’s Court Criminal Processes and Consequences: A Scoping Review of Qualitative Grey Literature"}, {"paperId": "631a9b49e719ded4f8da41c8c4c072ad00cff5dd", "title": "ASSESSMENT OF CHOSEN TECHNOLOGIES IMPROVING SENIORS' QUALITY OF LIFE IN THE CONTEXT OF SUSTAINABLE DEVELOPMENT"}, {"paperId": "99a2d453e5457130b6699cf8a78be9bdef2978f7", "title": "Using Interoperability between Mobile Robot and KNX Technology for Occupancy Monitoring in Smart Home Care"}, {"paperId": "f5371c7c14ae101daf9f04f86eb12cdd06188f5b", "title": "myHealthHub for older adult inpatients to reduce loneliness, and improve patient engagement and mental health: protocol of a pilot randomized controlled trial."}, {"paperId": "5673c4c769f93ac6d8e132a0abfcf92ee220365f", "title": "Designing Voice-First Ambient Interfaces to Support Aging in Place"}, {"paperId": "3787ca00282100f47e2b709e58ab267fc536ae3e", "title": "Effectiveness of computer-based interventions for community-dwelling people with cognitive decline: a systematic review with meta-analyses"}, {"paperId": "173ad916754ff01173f2617703ea438aba1a3608", "title": "Interventions Designed to Support Physical Activity and Disease Prevention for Working from Home: A Scoping Review"}, {"paperId": "b222ecaf29bb8d9d767222c03071091f219f4851", "title": "Artificial intelligence in elderly healthcare: A scoping review"}, {"paperId": "249eb2cb9f43094380e57d525db027a498f72caa", "title": "The association between perioperative frailty and ability to complete a web-based geriatric assessment among older adults with cancer."}, {"paperId": "bb48729806b7999b757dcbb318a4788efade1052", "title": "A Conceptual Model of Experiences With Digital Technologies in Aging in Place: Qualitative Systematic Review and Meta-synthesis"}, {"paperId": "0f1a1856f929c4b19708d3be0fc724ffcd10c6f8", "title": "Virtual visits: life-size immersive communication"}, {"paperId": "5000df2681ef75b12d5a3739a7f57b73f6970532", "title": "Leveraging technology to personalize cognitive enhancement methods in aging"}, {"paperId": "9a4bf4b6cd902411a90cd808b845a9e46d36f47e", "title": "Improving a Mobile Telepresence Robot for People With Alzheimer Disease and Related Dementias: Semistructured Interviews With Stakeholders"}, {"paperId": "0a437e32d8e4bd500808b873cb3e1a63cc707924", "title": "Introducing the v-RFA, a voice assistant-based geriatric assessment."}, {"paperId": "e9fb698ea256be7cda624fcb11abe5cf757eee95", "title": "Emerging technologies and their potential for generating new assistive technologies"}, {"paperId": "453df53664d6ee0975fcd56560bd8e20021c8735", "title": "Titrating Support: Stakeholder Perspectives on Improving a Mobile Telepresence Robot for People with Alzheimer's Disease and Related Dementias (Preprint)"}, {"paperId": "399020de6ef07c7985fb84d1baed5b1662ab8cb4", "title": "Exploring the Potential of Emerging Technologies to Meet the Care and Support Needs of Older People: A Delphi Survey"}, {"paperId": "a2ca5782f0e8bfad02b3f1aa42706ff01cefb9bf", "title": "The possibility of care engineering to enhance STEAM education in future care through the title analysis"}, {"paperId": "2fd5e7bad361b2c40e4436e8889c41f43aa73e93", "title": "Smart@home – supporting safety and mobility of elderly and care dependent people in their own homes through the use of technical assistance systems and conventional mobility supporting tools: a cross-sectional survey"}, {"paperId": "3a9405e8717eeb61dbbd28adbb0363738709c2c1", "title": "Inclusive needs assessments should be the foundation for motivating technical CUI research"}]}
