{"paperId": "17080368ff9de8a7d7a5788c9540ccd0c786ffc6", "publicationVenue": {"id": "801703f5-a310-442a-a58a-41bb05ae1f68", "name": "International Conference on Wirtschaftsinformatik", "type": "conference", "alternate_names": ["WI", "Int Conf Wirtsch", "Web Intell", "IEEE/WIC/ACM Int Conf Web Intell", "IEEE/WIC/ACM International Conference on Web Intelligence", "Web Intelligence"], "url": "https://aisel.aisnet.org/wi/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=3061"]}, "title": "A comprehensive study of data intelligence in the context of big data analytics", "abstract": "Modern systems like the Internet of Things, cloud computing, and sensor networks generate a huge data archive. The knowledge extraction from these huge archived data requires modified approaches in algorithm design techniques. The field of study in which analysis of such huge data is carried out is called big data analytics, which helps to optimize the performance with reduced cost and retrieves the information efficiently. The enhancement of traditional data analytics needs to modify to suit big data analytics because it may not manage huge amounts of data. The real thought is how to design the data mining algorithms suitable to handle big data analysis. This paper discusses data analytics at the initial level, to begin with, the insights about the analysis process for big data. Big data analytics have a current research edge in the knowledge extraction field. This paper highlights the challenges and problems associated with big data analysis and provide inner insights into several techniques and methods used.", "venue": "International Conference on Wirtschaftsinformatik", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-07", "journal": {"name": "Web Intell.", "pages": "53-66", "volume": "20"}, "authors": [{"authorId": "70066022", "name": "C. Banchhor"}, {"authorId": "50138175", "name": "N. Srinivasu"}], "citations": [{"paperId": "8b737c31f397c288cde0bde1f04882bc73c1ea99", "title": "Research on the Application of Random Forest-based Feature Selection Algorithm in Data Mining Experiments"}]}
