{"paperId": "170839af97d1ff87a5abc5ed9848d7e7d52e99a6", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "The Role of Technology in Improving the Customer Experience in the Banking Sector: A Systematic Mapping Study", "abstract": "Information Technology (IT) has revolutionized the way we manage our money. The adoption of innovative technologies in banking scenarios allows to access old and new financial services but in a faster and more secure, comfortable, rewarding and engaging way. The number, the performances and the seamless integration of these innovations is a driver for banks to retain their customers and avoid costly change of hearts. The literature is rich in works reporting on the use of technology with direct or indirect impact on the experience of banking customers. Some mapping studies about the adoption of technologies in the field exist, but they are specific to particular technologies (e.g., only Artificial Intelligence), or vice versa too generic (e.g., reviewing the adoption of technologies to support any kind of banking process). So a specific research effort on the crossed domain of technology and Customer Experience (CX) is missing. This paper aims to overcome the following gaps: the lack of a comprehensive map of the research made in the field in the past decade; a discussion on the current research trends of top publications and journals is missing; the next research challenges are yet to be identified. To face these limitations, we designed and submitted 7 different queries to pull papers out of 4 popular scientific databases. From an initial set of 6,756 results, we identified a set of 89 primary studies that we thoroughly analyzed. A selection of the top 20% works allowed us to seek the most performant technologies as well as other promising ones that have not been experimented yet in the field. Main results prove that the combined study of technology and CX in the banking sector is not approached systematically and thus the development of a new specific research line is needed.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "118024-118042", "volume": "10"}, "authors": [{"authorId": "1883772", "name": "R. Vergallo"}, {"authorId": "2969145", "name": "L. Mainetti"}], "citations": [{"paperId": "9b21d617cccdf69049ab6ea41d4c47011261afd9", "title": "Blockchain application in preserving authenticity and enabling transparency in the approval of loans for the clients in banking system"}, {"paperId": "c9e8035e71fab78850722b3b3f7ce1a43e99fdb6", "title": "A Sustainable Approach to Delivering Programmable Peer-to-Peer Offline Payments"}]}
