{"paperId": "170954bdc3815c295095a94077f591d90dff48d5", "publicationVenue": null, "title": "An Efficient Approach for Storage of Big Data Streams in Distributed Stream Processing Systems", "abstract": "Besides, centralized managing, processing and querying, the storage is one of the important components of a big data management. There is always a huge requirement of storing immense volumes of heterogeneous data in different formats. In big data steam processing applications, the storage is given a priority and always plays a big role in historical data analysis. During stream processing, some of the incoming data and the intermediate results are always a good source of future samples. These samples can be used for the future evaluation to eliminate the numerous mistakes of storing and maintaining the big data streams. Hence, a big data stream application requires an efficient support for storage of historical queries. The researchers, scientist and academicians are working hard to develop a sophisticated mechanism that is needed for storage to keep the most useful data for the future references by means of stream archive storage. However, a stream processing system can’t store the whole incoming stream data for future references. A technique is needed to get rid of the expired data and free the space for more incoming data in an archive storage. Hence keeping in view, the storage space limitation, integration issues and its associated cost, we try to optimize the stream archive storage and free more space for future data. The proposed enhanced algorithm will help to delete the obsolete data (retention or expired) and free the space for the new incoming data in a distributed platform. Our paper presents an Enhanced Time Expired Algorithm (ETEA) for stream archived storage in a distributed environment for removing the obsolete data based on time expiration and providing a space for the new incoming data for historical data analysis during the skew time (Hot Spots).We also evaluated the efficiency of our algorithm using the skew factor. The experimental results show that our approach is 98% efficient and fast than other conventional techniques.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "11"}, "authors": [{"authorId": "2253990863", "name": "Sultan S. Alshamrani"}, {"authorId": "90141068", "name": "Quadri Waseem"}, {"authorId": "145241727", "name": "A. Alharbi"}, {"authorId": "2932176", "name": "Wael Alosaimi"}, {"authorId": "1872544", "name": "H. Turabieh"}, {"authorId": "103857264", "name": "H. Alyami"}], "citations": [{"paperId": "320d1c1967825833bdecf4062d5c354cd1dbc1aa", "title": "A Grey Literature Review on Data Stream Processing applications testing"}, {"paperId": "ad5bb1823b2d5ec3299d90a671f377208715daea", "title": "ParaDist-HMM: A Parallel Distributed Implementation of Hidden Markov Model for Big Data Analytics using Spark"}]}
