{"paperId": "17119282c4661329aef3e100df925fb9ed1e7f05", "publicationVenue": null, "title": "Application-Grained Block I/O Analysis for Edge Computational Intelligent", "abstract": "Block I/O workload is widely used in studies on storage performance. However, few studies have focused on the workload characteristics of edge intelligent computing. A discrepancy exists between the workload and the storage, resulting in performance loss. Most studies have focused on the overall block I/O workload characteristics or the performance of the storage; however, a fine-grained analysis is required to understand the workload more comprehensively. In this paper, we propose the concept of an application-grained block I/O analysis for edge computational intelligent. Firstly describe the five steps of the application-grained block I/O analysis, i.e., trace collection, application isolation, application weighting, application trace analysis, and results. Subsequently, discuss the key points of the application-grained block I/O analysis. An application-grained block I/O analysis is performed using five off-the-shelf trace analysis tools and four evaluation parameters.", "venue": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "381-388"}, "authors": [{"authorId": "2053656228", "name": "Fangqi Wan"}, {"authorId": "143959165", "name": "Guangjie Han"}, {"authorId": "1803557", "name": "Gangyong Jia"}, {"authorId": "145554360", "name": "Jian Wan"}, {"authorId": "36847969", "name": "Congfeng Jiang"}], "citations": []}
