{"paperId": "1713101be4b63bfb807ca0f71d3f0d8577ab9b97", "publicationVenue": {"id": "fcad2179-afdc-4360-ad8b-8b714f64dab3", "name": "AIMS Mathematics", "alternate_names": ["AIM Math"], "issn": "2473-6988", "url": "https://www.aimspress.com/journal/Math", "alternate_urls": ["https://www.aimspress.com/journal/Math/archive.html"]}, "title": "A space-time model for analyzing contagious people based on geolocation data using inverse graphs", "abstract": "Mobile devices provide us with an important source of data that capture spatial movements of individuals and allow us to derive general mobility patterns for a population over time. In this article, we present a mathematical foundation that allows us to harmonize mobile geolocation data using differential geometry and graph theory to identify spatial behavior patterns. In particular, we focus on models programmed using Computer Algebra Systems and based on a space-time model that allows for describing the patterns of contagion through spatial movement patterns. In addition, we show how the approach can be used to develop algorithms for finding \"patient zero\" or, respectively, for identifying the selection of candidates that are most likely to be contagious. The approach can be applied by information systems to evaluate data on complex population movements, such as those captured by mobile geolocation data, in a way that analytically identifies, e.g., critical spatial areas, critical temporal segments, and potentially vulnerable individuals with respect to contact events.", "venue": "AIMS Mathematics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "AIMS Mathematics"}, "authors": [{"authorId": "32461747", "name": "S. Merino"}, {"authorId": "2054576367", "name": "Juergen Doellner"}, {"authorId": "78089294", "name": "Javier Martínez"}, {"authorId": "2061585826", "name": "F. Guzmán"}, {"authorId": "31465110", "name": "R. Guzmán"}, {"authorId": "2210183883", "name": "Juan De Dios Lara"}], "citations": []}
