{"paperId": "172bfe713138952a8ce7daffe1f548b0a15bf04c", "publicationVenue": null, "title": "A Survey on Big Data Pre-processing", "abstract": "In this paper, we briefly introduce some basic concepts and characteristics of big data. We are surrounded by massive amount of data but starving for knowledge. In the era of Big Data, how to quickly obtain high-quality and valuable information from massive amounts of data has become an important research direction. Hence, we focus our attention to the data pre-processing which is a sub-content of the data processing workflow. In this paper, the four phases of data pre-processing, including data cleansing, data integration, data reduction, and data transformation, have been discussed. And different approaches for a variety of purposes have been presented, which show current methods and techniques need to be further modified in order to improve the quality of data before data analysis.", "venue": "2017 5th Intl Conf on Applied Computing and Information Technology/4th Intl Conf on Computational Science/Intelligence and Applied Informatics/2nd Intl Conf on Big Data, Cloud Computing, Data Science (ACIT-CSII-BCD)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-07-01", "journal": {"name": "2017 5th Intl Conf on Applied Computing and Information Technology/4th Intl Conf on Computational Science/Intelligence and Applied Informatics/2nd Intl Conf on Big Data, Cloud Computing, Data Science (ACIT-CSII-BCD)", "pages": "241-247"}, "authors": [{"authorId": "52366010", "name": "Zhi-bin Guan"}, {"authorId": "2072498848", "name": "Tongkai Ji"}, {"authorId": "2067732973", "name": "Xu Qian"}, {"authorId": "2148984992", "name": "Yan Ma"}, {"authorId": "32509296", "name": "Xuehai Hong"}], "citations": [{"paperId": "682150e735c21a1baad596ace34011ef32698098", "title": "A Study of Challenges and Limitations to Applying Machine Learning to Highly Unstructured Data"}, {"paperId": "09a8ae8720cb0afa35cfd4b4c149cd5ae5c384db", "title": "Binary Classification of Customer’s Online Purchasing Behavior Using Machine Learning"}, {"paperId": "69d1bf74cc2b5872c40900f8bc8204df6b69fc71", "title": "PrePy - A Customize Library for Data Preprocessing in Python"}, {"paperId": "3bccce47617ea58d6326ae40a2663c7b1f4aa577", "title": "A Step toward Next-Generation Advancements in the Internet of Things Technologies"}, {"paperId": "f0c2f86ec6badf6abe8ccfbc4cecf72d3a56f5b3", "title": "A Context-Aware Data Reduction Framework for High Velocity Data"}, {"paperId": "a7864712d3b99fc38b9f65ff3e2e5c099354a224", "title": "An overview of data reduction solutions at the edge of IoT systems: a systematic mapping of the literature"}, {"paperId": "0ac26567d9e08aac2fdc4e6ef8a0f1d76f578771", "title": "A modified genetic algorithm and weighted principal component analysis based feature selection and extraction strategy in agriculture"}, {"paperId": "02f36522287292fbd423b0af5d6864989ada127b", "title": "Data Preprocessing Techniques for Handling Time Series data for Environmental Science Studies"}, {"paperId": "22e9f7e4e58d065bea5fdd1ad3a6798f2554636a", "title": "Improving Classification Accuracy of Scikit-learn Classifiers with Discrete Fuzzy Interval Values"}, {"paperId": "87f23c26d469847f93735c9844264c901ebefd8b", "title": "The Impact of Fuzzy Discretization’s Output on Classification Accuracy of Random Forest Classifier"}, {"paperId": "0bba8994a89ee1c26216b079594e90f58ad11e41", "title": "Analysis of Medical Slide Images Processing using Depth Learning in Histopathological Studies of Cerebellar Cortex Tissue"}, {"paperId": "1ffb2d0b97808b08a6dfa1f32257d5bc991549f4", "title": "Fog Data Analytics for IoT Applications: Next Generation Process Model with State of the Art Technologies"}, {"paperId": "5fd56c731c3aebaeba2eb7714bf2875954565416", "title": "Fog Data Processing and Analytics for Health Care-Based IoT Applications"}, {"paperId": "24b4ec47d0514726d457ee17820a2cff00d80ef2", "title": "Power System Anomaly Detection Based on OCSVM Optimized by Improved Particle Swarm Optimization"}]}
