{"paperId": "1730001220d2aa1dd0bb6b4dae80b2adb8ed9cf7", "publicationVenue": null, "title": "Database Management System (DBMS): A Cloud-Enabled Service for Small to Medium Enterprise", "abstract": "Cloud storage is a new IT technology that has created tremendous interest in IT academics and customers. Through linking a vast range of servers across the world through the internet and pooling the services, they generate, cloud storage is a capable invention that is intended to offer tremendous cost savings and exceptional versatility in how companies access the services. In particular, the small and medium-sized companies (SMEs) view cloud infrastructure as a persuasive threat to themselves. Nevertheless, previous studies which examine cloud computing from a business perspective are minimal. Moreover, despite the exponential growth of cloud infrastructure in small and medium-sized businesses, there is no prior study concentrating on SMEs. This research explores the factors that lead specifically for their data to the rapid growth of cloud computing in SMEs. It explores the roles cloud computing played within the Database Management System (DBMS). Owing to the strong prevalence of cloud storage within it, the SMEs are selected, and the homogeneous design of DBMS services. This study allows the SMEs’ IT expertise and performs a sample using a systematic questionnaire. The findings showed the term cloud infrastructure applies to several kinds of services. Cloud storage for SMEs is focused on an external (client-oriented) role and an internal (DBMS) function. On the other side, the drawbacks of cloud-based information management systems are restricted mainly to small businesses. This study formulates an important contribution to cloud device science in the field. It should be understood that cloud computing’s position is expanding ahead of its technical merits and differs based on market characteristics and company approach. Future experiments are proposed to consider how companies integrate cloud-enabled technologies into their business operation and policy.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "40498089", "name": "Muhammad Nadim"}, {"authorId": "153610286", "name": "R. Latif"}, {"authorId": "1381486203", "name": "Khalid Hussain"}, {"authorId": "3218095", "name": "Noor Zaman Jhanjhi"}, {"authorId": "144314447", "name": "Mehedi Masud"}, {"authorId": "2139639181", "name": "Saleh Yahya"}, {"authorId": "2140571093", "name": "Alyahyan"}], "citations": []}
