{"paperId": "17583f3e18a2a33a954a9aa55e932acb3f13cc2c", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Guaranteeing Performance SLAs of Cloud Applications Under Resource Storms", "abstract": "In modern data centers, enterprise cloud instances run not only foreground applications like web and databases, but also different background services (e.g., backup, virus/compliance scan, batch) to manage the cloud instances securely and improve the overall resource utilization. These background services often incur resource storms that suddenly consume a lot of shared resources on cloud instances. The resource storms significantly degrade the performance of foreground applications by interfering in the preemption of the shared resources, resulting in frequent SLA violations. However, stock OS schedulers are not designed to handle these situations, and prior works are insufficient to address such resource storms under highly dynamic cloud workloads. This article presents Orchestra, a cloud-specific framework for controlling multiple applications in the user space, aiming at meeting corresponding SLAs. Orchestra takes an online approach with lightweight monitoring and performance models for both applications on the fly. It optimizes the resource allocations to meet corresponding SLAs. We evaluate the performance of Orchestra on a production cloud with a diverse range of SLAs. Orchestra guarantees the foreground application's performance SLAs at all times. At the same time, Orchestra maintains the background's performance by minimizing its performance penalty with proper allocation of the shared resources.", "venue": "IEEE Transactions on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-06", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "1329-1343", "volume": "10"}, "authors": [{"authorId": "2862224", "name": "I. Kim"}, {"authorId": "38348772", "name": "Jinho Hwang"}, {"authorId": "39253519", "name": "Wei Wang"}, {"authorId": "1691920", "name": "M. Humphrey"}], "citations": [{"paperId": "04cd5740dd1f029cd9eecfe1a1f2cdeb6d99c084", "title": "Dynamic Allocation Mechanism of Cloud Computing Resources Driven by Neural Network"}, {"paperId": "337d72868b574e930ab6641666050734ab057a55", "title": "Cryptanalysis Of An Anonymous And Traceable Group Data Sharing In Cloud Computing"}, {"paperId": "82ca7192ee77c9103ae0c026bf1e838bae26d53c", "title": "Location and Time Aware Real Time Cloud Service Recommendation System Based on Multilayer Perceptron"}]}
