{"paperId": "176046038b69ae4fbb10d499a65237e59e53cd60", "publicationVenue": null, "title": "Review of Web Mapping: Eras, Trends and Directions", "venue": "ISPRS Int. J. Geo Inf.", "year": 2017, "fieldsOfStudy": ["Geography", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-10-21", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "317", "volume": "6"}, "authors": [{"authorId": "1730248", "name": "B. Veenendaal"}, {"authorId": "1882834", "name": "M. Brovelli"}, {"authorId": "50341311", "name": "Songnian Li"}], "citations": [{"paperId": "9e7ab54b2e7363c52e123b6b7dab0b5fbfe739a7", "title": "Detecting New Points of Interest Using Taxi GPS Data"}, {"paperId": "b7afaf793922a9bcba3a77eb1f1718121c1b2345", "title": "Critical analysis of the impact of artificial intelligence integration with cutting-edge technologies for production systems"}, {"paperId": "3e64d28d384354d12ed135f0ad27f21bd1cef237", "title": "Web Mapping for Farm Management Information Systems: A Review and Australian Orchard Case Study"}, {"paperId": "adf2f85d2c8d17ffe2897cf28c1b29bf488393dd", "title": "Geospatial Analysis in Web Browsers - Comparison Study on WebGIS Process-Based Applications"}, {"paperId": "102204812d77616a5a82739d8e0cab2d8e9ffea4", "title": "Does spatial thinking ability relate to performance when using web-mapping services? A survey with digital natives"}, {"paperId": "aadb4afab842726a431ae7343909827d2d5d3c00", "title": "Missing the city for buildings? A critical review of pan-scalar map generalization and design in contemporary zoomable maps"}, {"paperId": "6da37a39f3622cdb66dbb33b5f4530c4ca137e0c", "title": "To the question of creating an open ecological geographic information system"}, {"paperId": "76ec5136d3fb0f71486c1ebdad9e407a9de85ec9", "title": "Citizen science and geomorphology: the citizenMorph pilot system for observing and reporting data on landforms"}, {"paperId": "9060b6f3b6853720e7d5b71e1873d78117292d72", "title": "Geospatial Artificial Intelligence (GeoAI) in the Integrated Hydrological and Fluvial Systems Modeling: Review of Current Applications and Trends"}, {"paperId": "67f39b74ae3e86d2893ad6b08f01bece01abf022", "title": "Evaluation of the response time of a geoservice using a hybrid and distributed database"}, {"paperId": "bba9b53916da47461df611f02aa0a0bcf99d9b3e", "title": "Ten GIS-Based Solutions for Managing and Controlling COVID-19 Pandemic Outbreak"}, {"paperId": "521c2d8572be90e4911e534c43c242be4caecfa4", "title": "Visual Feature Encoding for GNNs on Road Networks"}, {"paperId": "b941ff5a72dd018498bb197dd94872baca143478", "title": "A Novel Method to Determine the Optimal Location for a Cellular Tower by Using LiDAR Data"}, {"paperId": "9c0544a981636367604fdfd2ac2e625b76dae406", "title": "Applying Geographic Information System Methodologies to Estimate the Catchment Area Accessibility of Park-and-Ride Facilities"}, {"paperId": "45f20150579f30bcab0edba74b5d9c452db19ec5", "title": "Development and Assessment of a Web-Based National Spatial Data Infrastructure for Nature-Based Solutions and Their Social, Hydrological, Ecological, and Environmental Co-Benefits"}, {"paperId": "755b0e56c4477bf4134bd0909c95e4a6d93a184c", "title": "WebGIS Implementation for Dynamic Mapping and Visualization of Coastal Geospatial Data: A Case Study of BESS Project"}, {"paperId": "4c7a1fcb99341855e2876231e93d1303faf1500a", "title": "Approximations, Errors, and Misconceptions in the Use of Map Projections"}, {"paperId": "91c043e7012b2ffff43e345585dbd1a5432b0e8c", "title": "Map Whiteboard Cloud Solution for Collaborative Editing of Geographic Information"}, {"paperId": "0bd651eefa617a274e146e6836fb021683876725", "title": "La géovisualisation de données massives sur le Web : entre avancées technologiques et évolutions cartographiques"}, {"paperId": "6792622b6ddeeea8378689e37963a88f7e742e57", "title": "A picture is worth a thousand words: using digital tools to visualise marine invertebrate diversity data along the coasts of Mozambique and São Tomé & Príncipe"}, {"paperId": "ae88d84b2fa96f6fc50b3d142f9cbb34023fdadb", "title": "GIS Open-Source Plugins Development: A 10-Year Bibliometric Analysis on Scientific Literature"}, {"paperId": "37b64d40e9fc70bbec23b7005f56d6ec6aee6fa0", "title": "Development of fire risk visualization tool based on heat map"}, {"paperId": "b61bb90c27b24122cea0a1f287d77f304af5d7a9", "title": "An Open Source GIS Application for Spatial Assessment of Health Care Quality Indicators"}, {"paperId": "a75517aa968ba019abd11da8f0b9bb4fb2fabb83", "title": "Pioneering easy-to-use forestry data with Forest Explorer"}, {"paperId": "69b521282b96c65cbe1d51458d86000993bf6329", "title": "Evaluating spatial configuration of fire stations based on real-time traffic"}, {"paperId": "166cf764ba96a2c2b8258f99f05a9a2149cb4663", "title": "IdroGEO: A Collaborative Web Mapping Application Based on REST API Services and Open Data on Landslides and Floods in Italy"}, {"paperId": "6478adc66ec783d5cc1917e4c09e6bd4bf206a13", "title": "What to do in, and what to expect from, urban green spaces – Indicator-based approach to assess cultural ecosystem services"}, {"paperId": "cf1b5d76df347afc6454a20b785d52ebf2b42010", "title": "Analytics of big geosocial media and crowdsourced data"}, {"paperId": "72c09cbe95974c95a7034ea66554f539c8c22eba", "title": "Development of a webmapping application for access to geospatial information on Tourism in Cameroon"}, {"paperId": "74ce2a9a9b69121a5a5ac4d474ce1e7cafebb344", "title": "A webGIS Application to Assess Seawater Quality: A Case Study in a Coastal Area in the Northern Aegean Sea"}, {"paperId": "ee0c0137a6846e46dd17bc37b0cf66a22d0938c7", "title": "VisWebDrone: A Web Application for UAV Photogrammetry Based on Open-Source Software"}, {"paperId": "6e43a3a93488fd8233f4748a11bd4a8bc2f6a622", "title": "Dynamic estimation system for fire station service areas based on travel time data"}, {"paperId": "60c0b224da98d74f531d151c57f4721cf2168a5f", "title": "Land Cover and Soil Consumption Monitoring with a FOS Geoportal in Five Italian Big Urban Areas"}, {"paperId": "bece4dfcd4a9d20655ea6a8cdcfd0d416c201292", "title": "Applying Real-Time Travel Times to Estimate Fire Service Coverage Rate for High-Rise Buildings"}, {"paperId": "40db1f2a9cbd293bb68290670221e94fd6628610", "title": "Map Metadata: the Basis of the Retrieval System of Digital Collections"}, {"paperId": "48d087d5651bd8be0c7774b9dfae518bae17769f", "title": "Multidimensional Visualization and Processing of Big Open Urban Geospatial Data on the Web"}, {"paperId": "c48cfa039f737f835f7284b306cab63c0876a572", "title": "Beyond First Impressions: Estimating Quality of Experience for Interactive Web Applications"}, {"paperId": "43e3eb6312c0fdcc3ca02b89f2347cf07d70c460", "title": "Regional evaluation of fire apparatus requirements for petrol stations based on travel times"}, {"paperId": "3a897aa8e220e07e709868e678ffdd51e3ff71f6", "title": "Performance Testing on Vector vs. Raster Map Tiles - Comparative Study on Load Metrics"}, {"paperId": "0a840e6b8ea77eb53ed238d38b5edbb7e1f432aa", "title": "Global to regional scale evaluation of adaptation measures to reduce the future water gap"}, {"paperId": "8f1c1df314770929cc99e6d0a433bbed8175439b", "title": "Advancements in web‐mapping tools for land use and marine spatial planning"}, {"paperId": "1bbf69425c9f7c0faea99f908ca209ca6a915469", "title": "Quantifying the Influence of Browser, OS and Network Delay on Time Instant Metric Measurements for a Web Mapping Application"}, {"paperId": "419c16a0c2c48d612c5e1f2456e84ef83b93c3d7", "title": "Optimization Big Data Real-time Analytics Using Mobile Phone Data in Origin Destination National Transportation (ATTN) Survey"}, {"paperId": "adc1b032d80cf3fb38151aebf46647b857e8c378", "title": "Towards the Development of Agenda 2063 Geo-Portal to Support Sustainable Development in Africa"}, {"paperId": "33bbaf99a571e4b5823fed7b9c457a8133723ab4", "title": "URBAN GEO BIG DATA"}, {"paperId": "cbc867f8bb74593a3f68ce8dbdae708d305b36d8", "title": "Studmap 3.0 - An Interoperable Web-Based Platform for Geospatial Data Offers in Academic Life"}, {"paperId": "922789a5535cb0b3c4aaada6508acc37e35ffc29", "title": "K-NEAREST NEIGHBOUR QUERY PERFORMANCE ANALYSES ON A LARGE SCALE TAXI DATASET: POSTGRESQL VS. MONGODB"}, {"paperId": "df6020de2d5b477addd795c46179f4dded96cd17", "title": "QRA-Grid: Quantitative Risk Analysis and Grid-based Pre-warning Model for Urban Natural Gas Pipeline"}, {"paperId": "c1ffd0fbd93db73c2311d15f1f8b791a4ccef4fb", "title": "Web GIS and Mapping"}, {"paperId": "4adcef29517b27d5b28366a44b02b22e73781522", "title": "Cloud system ArcGIS online as a managerial decision-making tool in agricultural production"}, {"paperId": "79219625fe49b8606743d63f84b35db5b85ce903", "title": "Digital Story Mapping to Advance Educational Atlas Design and Enable Student Engagement"}, {"paperId": "524beab5229705e14c325411b884133799d3923b", "title": "A Spatial Information System (SIS) for the Architectural and Cultural Heritage of Sardinia (Italy)"}, {"paperId": "4edb3303aaf3cba3887eea5efdadae0473a60247", "title": "Development of a Web-Based GIS of Flood Zones in the Municipality of Ouagadougou in Burkina Faso"}, {"paperId": "69f3d5a874dbdc02659e6c3f9670277758f356d9", "title": "Framework and Use Case for a Web-Based Interactive Analysis Tool to Investigate Urban Expansion and Sustainable Development Goal Indicators"}, {"paperId": "61944a32a7f5c47ffbb5faf3491f8ce57865580a", "title": "Promoting Open Data services to decision-makers: Providing interactive data through Web Maps and Web Applications for Oradea city and Bihor county"}, {"paperId": "3f7b051fb936f8098b17c19e6e492b0ede23536b", "title": "DIGITAL TOOLS FOR THE KNOWLEDGE AND ENHANCEMENT OF WWII HERITAGE. THE CASE STUDY OF BOSA IN THE WEST COAST OF SARDINIA (ITALY)"}, {"paperId": "57e5409b09aeb6223496ffb8574a1ccbca08f801", "title": "C OMPARATIVE ANALYSIS OF FOUR QGIS PLUGINS FOR W EB M APS CREATION"}, {"paperId": "612e53224d41f244994f3cac58fe1027ae36d7d3", "title": "JUST-Studio: A Platform for Spatio-Temporal Data Map Designing and Application Building"}, {"paperId": "a9985a90ab0d5b3d0a72e32cec7493554dc194b3", "title": "IoT and GIS Data Platform Solutions in Agricultural"}, {"paperId": "4a3e7eb231c351387b9e8adb3dc97dc956d94067", "title": "Mappemonde, 131 | 2021"}, {"paperId": "deb5226c33203beed337ffb112bf4d986405e5bf", "title": "High Performance Computing for Geospatial Applications"}, {"paperId": "18f586d806496a98aa31e52179e21adb5944f341", "title": "Integration of Web GIS with High-Performance Computing: A Container-Based Cloud Computing Approach"}, {"paperId": "ef7190a4bd67786c41a8d3609e5c88f1aaf479c6", "title": "Vector tile cache connecting effective spatial communication and geospatial AI"}, {"paperId": "1f149656fd3863ba5e648817699a793487a70e1c", "title": "Multi-layer vario-scale web map comparer with dynamic transitions and visual analytical tool"}, {"paperId": "dc5ee770a3ae717e0ee6f6c84d3a9002e1d6ebf0", "title": "Webová kartografie - specifika tvorby interaktivních map na webu"}, {"paperId": "0bfa59df45984b11e8e2ae6f97d9a9fa7b49c9b3", "title": "Developing A Web Map For Civil Engineering Applications: A Case Study Of Laikipa County"}, {"paperId": "4b63cbe2122c81c42b052e74f335cd32f28426e6", "title": "From Static to Dynamic Visualization of the Sea Surface Height on a Web GIS Application"}, {"paperId": "797df91ce536bce229df071342a77a5159830060", "title": "Application of Geospatial Technology in Evaluating the Impact of Mining Associated Urbanization on Agricultural Lands"}, {"paperId": "b54fdab2f8c1654d7aac91d0ee8edaa6930372d0", "title": "Development of Web Application for University of Uyo Post UTME Examination Timetable"}, {"paperId": "de07c67ac4443ce1542e8c475ad2b94ef6d9af4a", "title": "Studmap 3.0: An Interoperable Web-Based Platform for Geospatial Data Offers in Academic Life"}]}
