{"paperId": "17632a916579c56a62e68303311a2e90e22716eb", "publicationVenue": {"id": "66257d67-2035-4ff6-b62a-4099db02fcde", "name": "Alberto Mendelzon Workshop on Foundations of Data Management", "type": "conference", "alternate_names": ["AMW", "Alberto Mendelzon Workshop Found Data Manag"]}, "title": "TriAL-QL: Distributed Processing of Navigational Queries", "abstract": "Navigational queries are among the most natural query patterns for RDF data, but yet most existing RDF query languages fail to cover all the varieties inherent to its triple-based model, including SPARQL 1.1 and its derivatives. As a consequence, the development of more expressive RDF languages is of general interest. With TriAL* [14], there exists an expressive algebra which subsumes many previous approaches, while adding novel features that are not expressible in most other RDF query languages based on the standard graph model. However, its algebraic notation is inappropriate for practical usage and it is not supported by any existing RDF triple store. In this paper, we propose TriAL-QL, an easy to write and grasp language for TriAL*, preserving its compositional algebraic structure. We present an implementation based on Impala, a massive parallel SQL query engine on Hadoop, using an optimized semi-naive evaluation for the recursive fragments of TriAL*. This way, we support both data-intensive ETL-like workloads and explorative ad-hoc style queries. To demonstrate the scalability and expressiveness of our approach, we conducted experiments on generated social networks with up to 1.8 billion triples and compared different execution strategies to a Hive-based solution.", "venue": "Alberto Mendelzon Workshop on Foundations of Data Management", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2015-05-31", "journal": {"name": "Proceedings of the 18th International Workshop on Web and Databases"}, "authors": [{"authorId": "1403683697", "name": "Martin Przyjaciel-Zablocki"}, {"authorId": "2131714", "name": "A. Schätzle"}, {"authorId": "2925965", "name": "Adriano Lange"}], "citations": [{"paperId": "3cc6b6b976aeaa47a8f62b2577c09c826dadd9eb", "title": "Storing and Querying Semantic Data in the Cloud"}, {"paperId": "0760a0f1e90c9c607f86e55a0fb54a307a7cb6f0", "title": "Querying Semantic Knowledge Bases with SQL-on-Hadoop"}, {"paperId": "59f1df2f60280eea79d195b9c561d52a77fb24de", "title": "Foundations of Modern Query Languages for Graph Databases"}, {"paperId": "41770c3168a8918474603d96b634035677043980", "title": "Foundations of Modern Graph Query Languages"}, {"paperId": "86c333c0e5a406680862fd0ea8e835e483afcfe0", "title": "Reasoning Web. Learning, Uncertainty, Streaming, and Scalability"}]}
