{"paperId": "176a4f766f607dee9dcdbaa3b7616edbd4c97aff", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "The Relationship between VO2max, Power Management, and Increased Running Speed: Towards Gait Pattern Recognition through Clustering Analysis", "abstract": "Triathlon has become increasingly popular in recent years. In this discipline, maximum oxygen consumption (VO2max) is considered the gold standard for determining competition cardiovascular capacity. However, the emergence of wearable sensors (as Stryd) has drastically changed training and races, allowing for the more precise evaluation of athletes and study of many more potential determining variables. Thus, in order to discover factors associated with improved running efficiency, we studied which variables are correlated with increased speed. We then developed a methodology to identify associated running patterns that could allow each individual athlete to improve their performance. To achieve this, we developed a correlation matrix, implemented regression models, and created a heat map using hierarchical cluster analysis. This highlighted relationships between running patterns in groups of young triathlon athletes and several different variables. Among the most important conclusions, we found that high VO2max did not seem to be significantly correlated with faster speed. However, faster individuals did have higher power per kg, horizontal power, stride length, and running effectiveness, and lower ground contact time and form power ratio. VO2max appeared to strongly correlate with power per kg and this seemed to indicate that to run faster, athletes must also correctly manage their power.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "100633760", "name": "Juan Pardo Albiach"}, {"authorId": "2072504280", "name": "Melanie Mir-Jimenez"}, {"authorId": "2091493221", "name": "Vanessa Hueso Moreno"}, {"authorId": "2023724492", "name": "Iván Nacher Moltó"}, {"authorId": "1403481260", "name": "J. Martínez-Gramage"}], "citations": [{"paperId": "1756ba2a5a54240dc5c4e51d86fea37b54bc3cc5", "title": "Does Power Output at Critical Power Intensity Interchange between Cycling and Running?"}, {"paperId": "8afbb349c844197f9941639ab489f202d8037a3a", "title": "Implementing Modern Technology for Vital Sign Monitoring to Enhance Athletic Training and Sports Performance"}, {"paperId": "1c205aabf27e88c426d7eb2bfb87c1804bec1423", "title": "Influence of blood flow restriction training on the aerobic capacity: a systematic review and meta-analysis"}]}
