{"paperId": "176fd97ad01bcbd27214502110e6054c6923262c", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) Software Engineering for Big Data Projects: Domains, Methodologies and Gaps", "abstract": "—Context: Big data has become the new buzzword in the information and communication technology industry. Researchers and major corporations are looking into big data applications to extract the maximum value from the data available to them. However, developing and maintaining stable and scalable big data applications is still a distant milestone. Objective: To look at existing research on how software engineering concepts, namely the phases of the software development project life cycle (SDPLC), can help build better big data application projects. Method: A literature survey was performed. A manual search covered papers returned by search engines resulting in approximately 2,000 papers being searched and 170 papers selected for review. Results: The search results helped in identifying data rich application projects that have the potential to utilize big data successfully. The review helped in exploring SDPLC phases in the context of big data applications and performing a gap analysis of the phases that have yet to see detailed research efforts but deserve attention.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2269824084", "name": "Vijay Dipti Kumar"}, {"authorId": "143937733", "name": "P. Alencar"}], "citations": [{"paperId": "93a294482e55a75eb5b48d8f4b51774c16cddf3d", "title": "Software Engineering and Big Data Software"}, {"paperId": "1ad113614f0d2e65c3575046bae0618d270bf6e5", "title": "Exploring parallel formal verification of BIG-DATA systems"}, {"paperId": "80f75a714635a1999ab1e0fb3aae328a74f19af8", "title": "An Approach to Support Human-in-the-Loop Big Data Software Development Projects"}, {"paperId": "15879b0b4abf929ea3a27852be0a7f65eff39179", "title": "Feasibility Study of Software Engineering Aspects of Bigdata Analytics Applications for Academicians"}, {"paperId": "4c6e31458b0b44c1e8bd6e58f7d7e0767f7fde44", "title": "CRISP-DM Twenty Years Later: From Data Mining Processes to Data Science Trajectories"}, {"paperId": "e29e2950fdcfef40eecd23c4e790fdc3d55a1b01", "title": "Requirements Engineering Practices and Challenges in the Context of Big Data Software Development Projects: Early Insights from a Case Study"}, {"paperId": "8bb74a0dc62e39c4c536887bafe6df85c91d196d", "title": "Understanding the multifaceted geospatial software ecosystem: a survey approach"}, {"paperId": "4c604bb15f78f5337bda9a3ad0e1c6a9b2c0ce41", "title": "Big Data Systems"}, {"paperId": "fba2e6aa98090747aa521fccc427251f547ab65b", "title": "Modeling Distributed Agile Software Development for Big Data Projects: Evolution in Process"}, {"paperId": "d363c1b3dbf5b92051c5d666195f783c28860f8a", "title": "Requirements Engineering in the Context of Big Data Software Applications"}, {"paperId": "f20761b2aeb4f39591c414d5bbb35c39ba9c8fa2", "title": "A Validation Study of a Requirements Engineering Artefact Model for Big Data Software Development Projects"}, {"paperId": "2c77677055995d3c20a534cfaeb709b5412b007a", "title": "Software Engineering for Big Data Application Development: Systematic Literature Survey Using Snowballing"}, {"paperId": "07213c8a42ea85be3b04766e37141478b8436dce", "title": "Design Concerns for Industrial Big Data System in the Smart Factory Domain: From Product Lifecycle View"}, {"paperId": "b9880d85bbfdc613cf9a7d24178df9150ce41e25", "title": "A Systematic Mapping of Software Engineering Approaches to Develop Big Data Systems"}, {"paperId": "b868ffb7176b77b1906081e8aa0a6d79e371bfee", "title": "A Fast and Incremental Development Life Cycle for Data Analytics as a Service"}, {"paperId": "58cfd966a63bd8d2a33352316037dabd39a54705", "title": "A software engineering schema for data intensive applications"}, {"paperId": "3d55a8a443dff070a4370f6c94f348012f9b90e4", "title": "Towards a requirements engineering artefact model in the context of big data software development projects: Research in progress"}, {"paperId": "66369c6339a4741d8d213d82d801a50c18bb65a7", "title": "Make accumulated data in companies eloquent by SQL statement constructors"}, {"paperId": "9e93c2a268b85e7ba6c809ed342a9b4a16ce0113", "title": "The advanced analytics Jumpstart: definition, process model, best practices"}, {"paperId": "2d9f1b2260e256de6e0cf74d98360ac4a0761072", "title": "Broad big data domain via medical big data"}, {"paperId": "9e2f1b4ef987cf7d3edd595680bbd0a97ef36d2e", "title": "Extended definition of medical big data"}, {"paperId": "fed3726dafdeec2074f5357a8c5c521f856d75f5", "title": "Broad big data domain via medical big data"}, {"paperId": "c7a805e724a4248136d43c5b61f2958e3ca0ce54", "title": "Software engineering issues in big data application development"}, {"paperId": "b6c67b9a173d17462ad14966594b20fcec1c8f03", "title": "A Model-Driven Methodology for Big Data Analytics-as-a-Service"}, {"paperId": "e99589a48634fb261ddfcde2b7eb42527e12281c", "title": "Enhanced Framework for Big Data Requirement Elicitation"}, {"paperId": "a2f43fd4c1af8b92b978f4cdb7af005b62cd024b", "title": "Aplicaciones inteligentes sobre internet de las cosas y grandes volúmenes de datos: un enfoque riguroso"}, {"paperId": "c71f897891a9c3ce1b0f45bfcf45953d62666a74", "title": "Model-Driven Engineering for Big Data"}, {"paperId": "5b4730581172355f5c0380c4fb8439d4347d29ea", "title": "A SYSTEMATIC LITERATURE REVIEW"}]}
