{"paperId": "177b16358f58d07a1459fd79a7949e04b6dda1ed", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Scientific Landscape of Embodied Experience in the Virtual Environment: A Bibliometric Analysis", "abstract": "The realm of architecture has been influenced by the expansion in virtual environments (VEs), along with Industry 4.0 technologies transforming human–VE interactions. Despite increasing scholarly interest in embodied experience-integrated VE, there have been few comprehensive literature reviews undertaken on VEs from a holistic experience perspective. Therefore, this article reviews the literature on the embodied experiential dimension of VEs that has become necessary to adapt theories and methodologies in a way that enhances the user experience in a VE. This study employs a bibliometric analysis to review research performance and undertake a science mapping of the literature. The 969 pieces of data retrieved from Web of Science were subjected to a performance analysis, and VOSviewer was used to visualize the intellectual structure and research themes. The results of this study emphasize the strength and growing interest in VEs from the embodied experience perspective. Another significant finding is that VE experience studies are mostly based on embodied technologies. In this paper, the results of analyses are discussed in terms of productivity, collaboration, and research themes for future. This study contributes to the literature by providing a significant theoretical reference for the potential of the embodied experience in VE research, which will mostly attract the interest of architectural design researchers.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-16", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2144575447", "name": "Sanghee Lee"}, {"authorId": "2113344352", "name": "E. Park"}], "citations": [{"paperId": "269134d968be972da395d02ce4770e1dcc537109", "title": "Virtual and Augmented Reality for Building"}]}
