{"paperId": "178cfb0234e3d39fd6ea737c5e17838b02436a5a", "publicationVenue": null, "title": "Model-Distributed Inference in Multi-Source Edge Networks", "abstract": "Distributed inference techniques can be broadly classified into data-distributed and model-distributed schemes. In data-distributed inference (DDI), each worker carries the entire deep neural network (DNN) model, but processes only a subset of the data. However, feeding the data to workers results in high communication costs especially when the data is large. An emerging paradigm is model-distributed inference (MDI), where each worker carries only a subset of DNN layers. In MDI, a source device that has data processes a few layers of DNN and sends the output to a neighboring device. This process ends when all layers are processed in a distributed manner. In this paper, we investigate MDI with multiple sources, i.e., when more than one device has data. We design a multisource MDI (MS-MDI), which optimizes task scheduling decisions across multiple source devices and workers. Experimental results on a real-life testbed of NVIDIA Jetson TX2 edge devices show that MS-MDI improves the inference time significantly as compared to baselines.", "venue": "2023 IEEE International Conference on Acoustics, Speech, and Signal Processing Workshops (ICASSPW)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-04", "journal": {"name": "2023 IEEE International Conference on Acoustics, Speech, and Signal Processing Workshops (ICASSPW)", "pages": "1-5"}, "authors": [{"authorId": "2144889163", "name": "Pengzhen Li"}, {"authorId": "145991708", "name": "H. Seferoglu"}, {"authorId": "1758251", "name": "Erdem Koyuncu"}], "citations": [{"paperId": "492fb417b9c29cffce225c14330cf3f5f7522db4", "title": "Measuring Data Transmissions from the Edge for Distributed Inferencing with gRPC"}, {"paperId": "a00de0e4c56918abf96dfa03e8d0929e7090a077", "title": "Characterizing Distributed Inferencing at the Edge in Resource-Constrained Environments"}, {"paperId": "a8b01c9b98bcd1df5145f9595a4a7572decb22ab", "title": "Adaptive and Resilient Model-Distributed Inference in Edge Computing Systems"}]}
