{"paperId": "1792c394fbfc049d988986280beb0d13aaaf48e8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data Debugging with Shapley Importance over End-to-End Machine Learning Pipelines", "abstract": "Developing modern machine learning (ML) applications is data-centric, of which one fundamental challenge is to understand the influence of data quality to ML training --\"Which training examples are 'guilty' in making the trained ML model predictions inaccurate or unfair?\"Modeling data influence for ML training has attracted intensive interest over the last decade, and one popular framework is to compute the Shapley value of each training example with respect to utilities such as validation accuracy and fairness of the trained ML model. Unfortunately, despite recent intensive interest and research, existing methods only consider a single ML model\"in isolation\"and do not consider an end-to-end ML pipeline that consists of data transformations, feature extractors, and ML training. We present DataScope (ease.ml/datascope), the first system that efficiently computes Shapley values of training examples over an end-to-end ML pipeline, and illustrate its applications in data debugging for ML training. To this end, we first develop a novel algorithmic framework that computes Shapley value over a specific family of ML pipelines that we call canonical pipelines: a positive relational algebra query followed by a K-nearest-neighbor (KNN) classifier. We show that, for many subfamilies of canonical pipelines, computing Shapley value is in PTIME, contrasting the exponential complexity of computing Shapley value in general. We then put this to practice -- given an sklearn pipeline, we approximate it with a canonical pipeline to use as a proxy. We conduct extensive experiments illustrating different use cases and utilities. Our results show that DataScope is up to four orders of magnitude faster over state-of-the-art Monte Carlo-based methods, while being comparably, and often even more, effective in data debugging.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-23", "journal": {"name": "ArXiv", "volume": "abs/2204.11131"}, "authors": [{"authorId": "1689256538", "name": "Bojan Karlavs"}, {"authorId": "46927039", "name": "David Dao"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "2155883428", "name": "Bo Li"}, {"authorId": "2180399", "name": "Sebastian Schelter"}, {"authorId": "5072734", "name": "Wentao Wu"}, {"authorId": "2146064174", "name": "Ce Zhang"}], "citations": [{"paperId": "3653a8de4539d074912f58f5caac5914522becd8", "title": "Constructing Data Transaction Chains Based on Opportunity Cost Exploration"}, {"paperId": "599548449032b38d0fed8fef28ee266fc8b18c3a", "title": "AI and the Problem of Knowledge Collapse"}, {"paperId": "2d37f4300870a74e28076c6765499ca9bc1c544a", "title": "EcoVal: An Efficient Data Valuation Framework for Machine Learning"}, {"paperId": "3900f6bca9cbeec93a40661c60b811e511a70b93", "title": "Efficient Data Shapley for Weighted Nearest Neighbor Algorithms"}, {"paperId": "571bffdecc86ecae34f19faf7940d1117e30147f", "title": "Adaptive Training Distributions with Scalable Online Bilevel Optimization"}, {"paperId": "96c827eea1a35a407616ee564d8c657b16399602", "title": "Threshold KNN-Shapley: A Linear-Time and Privacy-Friendly Approach to Data Valuation"}, {"paperId": "f2dbc96d7f8250b1c6e7ebcdf9a8093b9c286226", "title": "Improving Retrieval-Augmented Large Language Models via Data Importance Learning"}, {"paperId": "1f5b15f53536278df51f99736cfc440ea6d78bc5", "title": "2D-Shapley: A Framework for Fragmented Data Valuation"}, {"paperId": "fba5b4a7f1f9e1cfb2c3922b08b33bf58959aadf", "title": "Automating and Optimizing Data-Centric What-If Analyses on Native Machine Learning Pipelines"}, {"paperId": "4a899ad6f6083b9edea6fbea59f923a32cbf7a12", "title": "A Note on \"Efficient Task-Specific Data Valuation for Nearest Neighbor Algorithms\""}, {"paperId": "333d6631e0f0ad2e96903e8f28fd43d28f189735", "title": "Automated Data Cleaning Can Hurt Fairness in Machine Learning-based Decision Making"}, {"paperId": "f2414dbac9de1499c4fd9dfe0d95492402eb613d", "title": "Fairness-Aware Data Valuation for Supervised Learning"}, {"paperId": "268e3df1a7e14b42c9597357b8527f3f1f4b0be3", "title": "DeepAProt: Deep learning based abiotic stress protein sequence classification and identification tool in cereals"}, {"paperId": "78040774044769c21e1dd7494898f629a62524cc", "title": "DataPerf: Benchmarks for Data-Centric AI Development"}, {"paperId": "ad17afd4e98c58c0bb0309b6f25e6caf931d4353", "title": "A Data-Based Perspective on Transfer Learning"}, {"paperId": "df8dcd129cc083e4c5d1b4cfe21e0c57a3bad67c", "title": "Inherent Inconsistencies of Feature Importance"}, {"paperId": "d045d573295744579ed3d35f5dc8d28245803e99", "title": "Towards data-centric what-if analysis for native machine learning pipelines"}, {"paperId": "6fa3f84affb5af66ec3fe94e618e0124493bb28e", "title": "Data Banzhaf: A Robust Data Valuation Framework for Machine Learning"}, {"paperId": "ae39c1e63507143044bdf4ba0f35141bd6fe3b87", "title": "Reconstructing and Querying ML Pipeline Intermediates"}, {"paperId": "30f41b10ccb0ae04f358910dc880e050a4e04ca6", "title": "Inherent Inconsistencies of Feature Importance"}, {"paperId": "bf614a57d1da7215230f3c167b85091509f381cd", "title": "Towards Declarative Systems for Data-Centric Machine Learning"}]}
