{"paperId": "1793874a0e061fc8777175af18945d4984b83e08", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Statistical Analysis and Neural Network in Detecting Steel Cord Failures in Conveyor Belts", "abstract": "This paper presents the identification and classification of steel cord failures in the conveyor belt core based on an analysis of a two-dimensional image of magnetic field changes recorded using the Diagbelt system around scanned failures in the test belt. The obtained set of identified changes in images, obtained for numerous parameters settings of the device, were the base for statistical analysis. This analysis makes it possible to determine the Pearson’s linear correlation coefficient between the parameters being changed and the image of the failures. In the second stage of the research, artificial intelligence methods were applied to construct a multilayer neural network (MLP) and to teach it appropriate identification of damage. In both methods, the same data sets were used, which made it possible to compare methods.", "venue": "Energies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-07", "journal": {"name": "Energies", "pages": "3081", "volume": "14"}, "authors": [{"authorId": "2114315612", "name": "D. Olchówka"}, {"authorId": "2114323582", "name": "A. Rzeszowska"}, {"authorId": "2089626026", "name": "L. Jurdziak"}, {"authorId": "1395137601", "name": "R. Blazej"}], "citations": [{"paperId": "033ba4d58f994de91ef9f9014bb0adc5fa37ed12", "title": "Belt rotation in pipe conveyors: Development of an overlap monitoring system using digital twins, industrial Internet of things, and autoregressive language models"}, {"paperId": "a13f3d2313818466e837aa4e44737c92724a9fed", "title": "Calibration Procedure for Ultrasonic Sensors for Precise Thickness Measurement"}, {"paperId": "f2f30b176a1cd6036f1d2c8ad1c7e463e8cc4156", "title": "Analysis of the Scope for Reducing the Level of Energy Consumption of Crew Transport in an Underground Mining Plant Using a Conveyor Belt System Mining Plant"}, {"paperId": "6ee0bc97b0bcccf30672608bd3763b79b5c46946", "title": "Profitability of Conveyor Belt Refurbishment and Diagnostics in the Light of the Circular Economy and the Full and Effective Use of Resources"}, {"paperId": "17d23f961632d8dec0a10fc5c04fcf050c866b59", "title": "Roller damage detection method based on the measurement of transverse vibrations of the conveyor belt"}, {"paperId": "b7e18362aa8c10ee62bee2eb6adc0e6222f92ba0", "title": "Types and causes of damage to the conveyor belt - review, classification and mutual relations"}, {"paperId": "fd77605295f25b47fa114159a225f14164d26482", "title": "The Effect of Lay Length on the Antipull Performance of Steel Cords and the Spinning Loss Based on the FEM"}, {"paperId": "67eeef14b7e05286dbe50c15aba394a915da093d", "title": "Conveyor Belt Damage Detection with the Use of a Two-Layer Neural Network"}]}
