{"paperId": "179be300a3656f6fb5df77ac6cdef1b1265b49f5", "publicationVenue": {"id": "27e2a414-d399-477e-a6d3-81b1c4fc5aad", "name": "International Conference on Control, Decision and Information Technologies", "type": "conference", "alternate_names": ["CoDIT", "CDIT", "Int Conf Control Decis Inf Technol"]}, "title": "Review of Applications of ML Approaches in Driver Behavior Analysis Using Qualitative and Quantitative Analysis", "abstract": "The academic and technical sectors of road transportation both find analysis of road network performance to be an essential area of research. There has been an increase in recent years in the number of studies investigating the function and potential applications of machine learning (ML) in the analysis of performance on road networks. Although machine learning has been shown to be useful in assessing performance on road networks, there is still a dearth of in-depth quantitative and qualitative research on the topic. The key goal of this research is to assess machine learning's quantitative and qualitative applications in transportation engineering's study of driver behavior analysis. In this paper, we looked at the research that has been done on how to use machine learning (ML) to study driving behavior analysis (DBA) from 1995 to 2022. All of the reviewed studies in this research were taken from the Web of Science (WOS) platform and analyzed. The analysis and discussions in this study try to provide a broad view of the changes that have occurred in the development process of these studies to other researchers and can be useful for showing the opportunities and challenges confronted by researchers in the use of ML in the analysis of driver behavior.", "venue": "International Conference on Control, Decision and Information Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-07-03", "journal": {"name": "2023 9th International Conference on Control, Decision and Information Technologies (CoDIT)", "pages": "1207-1213"}, "authors": [{"authorId": "118285410", "name": "S. Haghshenas"}, {"authorId": "3249464", "name": "V. Astarita"}, {"authorId": "2598327", "name": "Sina Shaffiee Haghshenas"}, {"authorId": "3309290", "name": "G. Guido"}, {"authorId": "84435266", "name": "Saeid Jafarzadeh Ghoushchi"}], "citations": []}
