{"paperId": "17a310e46359bb8cdb84d4fce0ca4e097d140151", "publicationVenue": {"id": "c99cfe66-b71c-4ca4-bedd-26267b9cb068", "name": "IEEE Transactions on Software Engineering", "type": "journal", "alternate_names": ["IEEE Trans Softw Eng"], "issn": "0098-5589", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=32", "alternate_urls": ["http://www.computer.org/portal/web/tse/about"]}, "title": "Efficient Execution of ATL Model Transformations Using Static Analysis and Parallelism", "abstract": "Although model transformations are considered to be the heart and soul of Model Driven Engineering (MDE), there are still several challenges that need to be addressed to unleash their full potential in industrial settings. Among other shortcomings, their performance and scalability remain unsatisfactory for dealing with large models, making their wide adoption difficult in practice. This paper presents A2L, a compiler for the parallel execution of ATL model transformations, which produces efficient code that can use existing multicore computer architectures, and applies effective optimizations at the transformation level using static analysis. We have evaluated its performance in both sequential and multi-threaded modes obtaining significant speedups with respect to current ATL implementations. In particular, we obtain speedups between 2.32x and 38.28x for the A2L sequential version, and between 2.40x and 245.83x when A2L is executed in parallel, with expected average speedups of 8.59x and 22.42x, respectively.", "venue": "IEEE Transactions on Software Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-23", "journal": {"name": "IEEE Transactions on Software Engineering", "pages": "1097-1114", "volume": "48"}, "authors": [{"authorId": "1742213", "name": "J. Cuadrado"}, {"authorId": "3093085", "name": "Loli Burgueño"}, {"authorId": "1690158", "name": "M. Wimmer"}, {"authorId": "46434062", "name": "Antonio Vallecillo"}], "citations": [{"paperId": "df383930d6a63cb96e9ad6eaf370f69461f40af7", "title": "Selective Traceability for Rule-Based Model-to-Model Transformations"}, {"paperId": "94c9ee0f37e67e6cef1543387ab65bc508df1c37", "title": "The Impact of Model Transformation Language Features on Quality Properties of MTLs: A Study Protocol"}, {"paperId": "d572956b29e100b70acaa34900b7f379a3a3c1d3", "title": "Model Transformation Testing and Debugging: A Survey"}, {"paperId": "287d6e1e1c7ba4ea70094e7b7b64aa862e8c9788", "title": "BPM supported model generation by contemplating key elements of information security"}, {"paperId": "ddc15c6db046a7568c0e18183a8a489b91f97ed1", "title": "Contrasting dedicated model transformation languages versus general purpose languages: a historical perspective on ATL versus Java based on complexity and size"}, {"paperId": "a700872632809d56b5261429ddcef88af28ad91f", "title": "A Survey on the Relevance of the Performance of Model Transformations"}, {"paperId": "eb112b61b456ecf0371225692d532bfbd12dc1d4", "title": "Revisiting Fault Localization Techniques for Model Transformations: Towards A Hybrid Approach"}, {"paperId": "301748bb160335cba1028f3004f6b229ac22fe4d", "title": "Parallel processing proposal by clustering integration of low-cost microcomputers"}, {"paperId": "0f55d3f9ca306d6877bd23c0b0f30bec53110d5d", "title": "Dedicated Model Transformation Languages vs. General-purpose Languages: A Historical Perspective on ATL vs. Java"}]}
