{"paperId": "17a638e33ab4b9ebe223dd1370200108a3fa0b41", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "Understanding, Debugging, and Optimizing Distributed Software Builds: A Design Study", "abstract": "Today's build systems distribute build tasks across thousands of machines, reusing cached build results whenever possible. But despite the sophisticated nature of modern build tools, the core software architecture of the system under build defines the lower bound for how fast the system can compile. Long, consecutive build chains or slow individual build targets can introduce expensive compilation bottlenecks. Further, the growing complexity of both build systems and software systems under build makes comprehending, debugging, and optimizing build performance a significant challenge faced by many software engineers. We present a design study to describe and help mitigate the cognitive challenges faced by software engineers that use modern, cached, and distributed build systems. We characterize the performance analysis process and identify the main stakeholders involved, key usage scenarios, and elicit important requirements for tool support. We propose an interactive BuildExplorer tool for understanding, optimizing, and debugging cached and distributed build sessions, justifying our design decisions among alternative solutions. Our novel solution is evaluated through usage scenario walkthroughs, iterative deployments of the tool in the field, and a user study.", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "496-507"}, "authors": [{"authorId": "30868275", "name": "Carlene Lebeuf"}, {"authorId": "2654682", "name": "Elena Voyloshnikova"}, {"authorId": "39496137", "name": "Kim Herzig"}, {"authorId": "1734938", "name": "M. Storey"}], "citations": [{"paperId": "80b3c885415573cbdb33cd7ebd275db46ec3ea45", "title": "Accelerating Continuous Integration by Caching Environments and Inferring Dependencies"}, {"paperId": "d0a799a419696082f27eb2da0e830b712daf696c", "title": "On the benefits and limits of incremental build of software configurations: an exploratory study"}, {"paperId": "c9bb656aeb2adc0df89de74ebbe9427c73bfdbcd", "title": "Towards Incremental Build of Software Configurations"}, {"paperId": "7bbf157b01fdf153041a48d8edb7bee45e6ec78a", "title": "The nature of build changes"}, {"paperId": "2387ca79a14e543014df76db93b169bdb6da2dca", "title": "Summary of the 2nd International Workshop on Bots in Software Engineering (BotSE 2020)"}, {"paperId": "2eebeb69adaab8cbb59e74517464db9f315abf6b", "title": "Githru: Visual Analytics for Understanding Software Development History Through Git Metadata Analysis"}, {"paperId": "296d35407073bf905dc62f894b8aa2cdd383e11a", "title": "A systematic literature review of modern software visualization"}, {"paperId": "0984afc12b14db45296ee9e37ebe840505cd1b8f", "title": "A Qualitative Study on Framework Debugging"}, {"paperId": "f7edeb7751c598725b8efc40715d2ea2be4f9cda", "title": "Towards Predicting the Impact of Software Changes on Building Activities"}, {"paperId": "20d6ae48cd20fe34b42dd6982e9fa4380e0e1904", "title": "PyroBuildS: Enabling Efficient Exploration of Linux Configuration Space with Incremental Build"}, {"paperId": "1117f6926692b9968be95068f95434eefe9b6b4a", "title": "A Quantitative Study of C/C++ FOSS Software Buildability"}, {"paperId": "aaf29ed16354118e84abb2428edf87ac63238f32", "title": "Object-Oriented Build Automation - A Case Study"}]}
