{"paperId": "17b3f4bd1134e75790f393021bf1aae8da4a0bd1", "publicationVenue": {"id": "61b6d6d2-025c-4257-83a0-9a2f068c583d", "name": "Journal of Enterprise Information Management", "type": "journal", "alternate_names": ["J Enterp Inf Manag"], "issn": "1741-0398", "url": "https://www.emerald.com/insight/publication/issn/1741-0398"}, "title": "Improving information alignment and coordination in humanitarian supply chain through blockchain technology", "abstract": "PurposeThe coordination among the various entities such as the military, government agencies, civilians, non-governmental agencies, and other commercial enterprises is one of the most challenging aspects of managing the humanitarian supply chain. Blockchain technology (BCT) can facilitate coordination, but the cost and other hindrances have limited their application in disaster relief operations. Despite some studies, the existing literature does not provide a nuanced understanding of the application of blockchain technology to improve information alignment and coordination. Motivated by some recent examples where blockchain technology has been used to trace and mobilize resources in the form of funds and materials from the origin to the destination, the authors develop a theoretical model grounded in the contingent resource-based view.Design/methodology/approachTo empirically validate the model and test the research hypotheses, the authors gathered cross-sectional data using a structured pre-tested questionnaire. In this study, the authors gathered our responses from international non-governmental organizations from twenty-four countries. The authors performed the statistical analyses using variance-based structural equation modeling (PLS-SEM) with the help of commercial software (WarpPLS 7.0).FindingsThe findings of the study offer some useful implications for theory and practice. The results obtained through statistical analyses suggest that the BCT significantly affects information alignment and coordination. However, contrary to popular beliefs the study suggests that intergroup leadership has no significant moderating effect on the paths joining BCT and information alignment/coordination. Moreover, the authors found that the control variable (interdependence) significantly affects the information alignment and coordination further, which opens the room for further investigation.Practical implicationsThe result of the study offers some useful guidance. Firstly, it suggests that humanitarian organizations should invest in BCT to improve information alignment and coordination which is one of the most complex tasks in front of humanitarian organizations. Secondly, intergroup leadership may not have desired influence on the effects of BCT on information alignment/coordination. However, the interdependence of the humanitarian organizations on each other may have a significant influence on the information alignment/coordination.Originality/valueThe study offers some useful implications for theory. For instance, how BCT influences information alignment and coordination was not well understood in the context of humanitarian settings. Hence, this study offers a nuanced understanding of technology-enabled coordination in humanitarian settings.", "venue": "Journal of Enterprise Information Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-22", "journal": {"name": "Journal of Enterprise Information Management"}, "authors": [{"authorId": "2051250", "name": "Rameshwar Dubey"}, {"authorId": "143809890", "name": "A. Gunasekaran"}, {"authorId": "70346368", "name": "Cyril R. H. Foropon"}], "citations": [{"paperId": "cdc14df9a527ea51950ee3819e4d704be2428683", "title": "From promise to practice: A cross-institutional analysis of design trends, enablers and challenges in blockchain-enabled cash and voucher delivery"}, {"paperId": "5a61034b884e50cfb9b0a179b40acd7c5a2a20d4", "title": "Recent trends in supply chain management of business-to-business firms: a review and future research directions"}, {"paperId": "0804197198756df716dde3c4525da58ea7b0371a", "title": "Performance management process integration in humanitarian supply chains: focusing on the natural disaster preparedness stage"}, {"paperId": "ca22433988841d9f044aef3b64d3117e0b88a841", "title": "Enhancing supply chain flows through blockchain: a comprehensive literature review"}, {"paperId": "5b6a5980361cc31171720fbe3b5c27696bd94501", "title": "A multi-method study on the barriers of the blockchain technology application in the cold supply chains"}, {"paperId": "925b771d11cb604f9abf3c4ac00d84bebb87bd68", "title": "Adoption of modern technologies for implementing industry 4.0: an integrated MCDM approach"}]}
