{"paperId": "17cdd5e25990079b37adb17c729e29ca0926a04f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Combining the YOLOv4 Deep Learning Model with UAV Imagery Processing Technology in the Extraction and Quantization of Cracks in Bridges", "abstract": "Bridges are often at risk due to the effects of natural disasters, such as earthquakes and typhoons. Bridge inspection assessments normally focus on cracks. However, numerous concrete structures with cracked surfaces are highly elevated or over water, and is not easily accessible to a bridge inspector. Furthermore, poor lighting under bridges and a complex visual background can hinder inspectors in their identification and measurement of cracks. In this study, cracks on bridge surfaces were photographed using a UAV-mounted camera. A YOLOv4 deep learning model was used to train a model for identifying cracks; the model was then employed in object detection. To perform the quantitative crack test, the images with identified cracks were first converted to grayscale images and then to binary images the using local thresholding method. Next, the two edge detection methods, Canny and morphological edge detectors were applied to the binary images to extract the edges of the cracks and obtain two types of crack edge images. Then, two scale methods, the planar marker method, and the total station measurement method, were used to calculate the actual size of the crack edge image. The results indicated that the model had an accuracy of 92%, with width measurements as precise as 0.22 mm. The proposed approach can thus enable bridge inspections and obtain objective and quantitative data.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "145247536", "name": "S. Kao"}, {"authorId": "46623911", "name": "Yung-Chen Chang"}, {"authorId": "2170464470", "name": "Feng-Liang Wang"}], "citations": [{"paperId": "9104ef6c4d7081dff3879e46b1ccb712d082ba0d", "title": "Automated Bridge Inspection Image Retrieval Based on Deep Similarity Learning and GPS"}, {"paperId": "c74a6c7be039644c0b4919ab7db90dd17a7ef892", "title": "A hybrid Bayesian optimization-based deep learning model for modeling the condition of saltwater pipes in Hong Kong"}, {"paperId": "2b4bf558e1607e76119b5c9fcdbdfef7c867b443", "title": "An modified intelligent real-time crack detection method for bridge based on improved target detection algorithm and transfer learning"}, {"paperId": "373e7cd35fd2e0e0d6bc9e16188f143d68fa965c", "title": "Deep-Learning- and Unmanned Aerial Vehicle-Based Structural Crack Detection in Concrete"}, {"paperId": "2eb5a7ef26f6bd0da7f824db30d3882e7c5a1ace", "title": "Deep Learning for Structural Health Monitoring: Data, Algorithms, Applications, Challenges, and Trends"}, {"paperId": "0b8bdf533c88bfd2954975e8732f6eaf873af66b", "title": "Pavement crack detection through a deep-learned asymmetric encoder-decoder convolutional neural network"}, {"paperId": "7c35889fad5a22fa6b899c600716d539ef38f541", "title": "Computer Vision-Based Bridge Inspection and Monitoring: A Review"}, {"paperId": "1fe21e82c8657ce32c162dc15b6dc61c6941fdb2", "title": "Relative-Breakpoint-Based Crack Annotation Method for Lightweight Crack Identification Using Deep Learning Methods"}, {"paperId": "20625730afca03ea00cf4c4fc7e778d410d494b3", "title": "MFF-YOLO: An Accurate Model for Detecting Tunnel Defects Based on Multi-Scale Feature Fusion"}, {"paperId": "645897f1090ad39ba241400e42e497ca8077ff46", "title": "Automatic quantification of concrete cracks via multistage image filtration and trajectory-based local binarization"}, {"paperId": "a2a1d3b74d820e9d7b8d0e4f61a7bc9911925da3", "title": "Deep remote fusion: development of improved deep CNN with atrous convolution-based remote sensing image fusion"}, {"paperId": "09287086cb9543f65330175860391f0687365d70", "title": "An Image Edge Detection Algorithm Based on an Artificial Plant Community"}]}
