{"paperId": "17cf43b30d3334cb4f77910f020d7c93a2d779c2", "publicationVenue": {"id": "99026156-eedd-4e3c-9797-a7eca6658ad3", "name": "IEEE International Conference on Cognitive Infocommunications", "type": "conference", "alternate_names": ["CogInfoCom", "IEEE Int Conf Cogn Infocommunications"]}, "title": "Reflective bio-sensory signal-processing : implementing personal assisted e-Health", "abstract": "In this study, we focus on the interconnection of the cloud-based m-health appliances to the physically separated traditional hospital information systems. Our paper relies on the interoperability between the different healthcare domains. The IoT revolution brings new healthcare solutions to the hands of the healthcare providers. We are presenting our reflective bio-sensory healthcare-specific signal-processing architecture, we are focusing on a personal assisted e-Health solution. In this paper, we describe the benefits and limitations of our Med-i-Hub system and its underlying architectural landscape. Our complex innovative solution is scalable, flexible and expansible. The research team implemented the Med-i-Hub on microservice architecture, avoiding problems caused by monolithic systems. Med-i-Hub enables to collect and analyze health-related data from fitness trackers, smart scales, and further devices. The Med-i-Hub application enables the real-time health signal processing, data aggregation, and analysis. The detailed personal assistant allows the users to monitor and follow the available bio-sensory signals. Through the Med-i-Hub the users can share their health-related signal data with their healthcare provider.", "venue": "IEEE International Conference on Cognitive Infocommunications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-08-01", "journal": {"name": "2018 9th IEEE International Conference on Cognitive Infocommunications (CogInfoCom)", "pages": "000185-000190"}, "authors": [{"authorId": "3431539", "name": "Abel Garai"}, {"authorId": "2977194", "name": "A. Adamkó"}, {"authorId": "3431600", "name": "István Péntek"}], "citations": [{"paperId": "c637e0f0e7e100b9da58ed54f8a2cf80c2229464", "title": "Streaming service provisioning in IoT‐based healthcare: An integrated edge‐cloud perspective"}]}
