{"paperId": "17dcb03efb8973c55ae87388d5b9d86c0fa06ca4", "publicationVenue": {"id": "d8a9bd17-0d6c-4608-8ca1-ad5c3aa863ef", "name": "International Conferences on Information Technologies and Electrical Engineering", "type": "conference", "alternate_names": ["International Conference on Information Technology and Electrical Engineering", "Int Conf Inf Technol Electr Eng", "ICITEE"]}, "title": "Multiple Independent DE Optimizations to Tackle Uncertainty and Variability in Demand in Inventory Management", "abstract": "To determine the effectiveness of metaheuristic Differential Evolution optimization strategy for inventory management (IM) in the context of stochastic demand, this empirical study undertakes a thorough investigation. The primary objective is to discern the most effective strategy for minimizing inventory costs within the context of uncertain demand patterns. Inventory costs refer to the expenses associated with holding and managing inventory within a business. The approach combines a continuous review of IM policies with a Monte Carlo Simulation (MCS). To find the optimal solution, the study focuses on meta-heuristic approaches and compares multiple algorithms. The outcomes reveal that the Differential Evolution (DE) algorithm outperforms its counterparts in optimizing IM. To fine-tune the parameters, the study employs the Latin Hypercube Sampling (LHS) statistical method. To determine the final solution, a method is employed in this study which combines the outcomes of multiple independent DE optimizations, each initiated with different random initial conditions. This approach introduces a novel and promising dimension to the field of inventory management, offering potential enhancements in performance and cost efficiency, especially in the presence of stochastic demand patterns.", "venue": "International Conferences on Information Technologies and Electrical Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-09-22", "journal": {"name": "2023 15th International Conference on Information Technology and Electrical Engineering (ICITEE)", "pages": "57-62"}, "authors": [{"authorId": "9102078", "name": "S. Maitra"}, {"authorId": "2344119", "name": "S. Kundu"}, {"authorId": "2057515522", "name": "Vivek Mishra"}], "citations": []}
