{"paperId": "17f1b2cbbaffd0f3511d1752a048cd88dd65dc71", "publicationVenue": {"id": "a33b4339-8ebd-427d-8a4a-2496fca85732", "name": "Fire", "type": "conference", "alternate_names": ["FIRE Workshops", "Forum Inf Retr Evaluation", "Forum for Information Retrieval Evaluation", "Fire!!!", "FIRE Work", "FIRE"], "issn": "2571-6255", "alternate_issns": ["2156-4078"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1174297", "alternate_urls": ["http://www.jstor.org/action/showPublication?journalCode=fire", "http://www.fire-jbs.org/", "https://www.jstor.org/journal/fire", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1174297", "https://www.mdpi.com/journal/fire"]}, "title": "UAV Assisted Spatiotemporal Analysis and Management of Bushfires: A Case Study of the 2020 Victorian Bushfires", "abstract": "Australia is a regular recipient of devastating bushfires that severely impacts its economy, landscape, forests, and wild animals. These bushfires must be managed to save a fortune, wildlife, and vegetation and reduce fatalities and harmful environmental impacts. The current study proposes a holistic model that uses a mixed-method approach of Geographical Information System (GIS), remote sensing, and Unmanned Aerial Vehicles (UAV)-based bushfire assessment and mitigation. The fire products of Visible Infrared Imager Radiometer Suite (VIIRS) and Moderate-resolution Imaging Spectroradiometer (MODIS) are used for monitoring the burnt areas within the Victorian Region due to the 2020 bushfires. The results show that the aggregate of 1500 m produces the best output for estimating the burnt areas. The identified hotspots are in the eastern belt of the state that progressed north towards New South Wales. The R2 values between 0.91–0.99 indicate the fitness of methods used in the current study. A healthy z-value index between 0.03 to 2.9 shows the statistical significance of the hotspots. Additional analysis of the 2019–20 Victorian bushfires shows a widespread radius of the fires associated with the climate change and Indian Ocean Dipole (IOD) phenomenon. The UAV paths are optimized using five algorithms: greedy, intra route, inter route, tabu, and particle swarm optimization (PSO), where PSO search surpassed all the tested methods in terms of faster run time and lesser costs to manage the bushfires disasters. The average improvement demonstrated by the PSO algorithm over the greedy method is approximately 2% and 1.2% as compared with the intra route. Further, the cost reduction is 1.5% compared with the inter-route scheme and 1.2% compared with the intra route algorithm. The local disaster management authorities can instantly adopt the proposed system to assess the bushfires disasters and instigate an immediate response plan.", "venue": "Fire", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-07-26", "journal": {"name": "Fire"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "1657644010", "name": "S. Qayyum"}], "citations": [{"paperId": "7dfe0a425fc8453bdb1ccded98ddab3b470f4dab", "title": "A comprehensive survey of research towards AI-enabled unmanned aerial systems in pre-, active-, and post-wildfire management"}, {"paperId": "dc117ce0415a052323ae4fc99b2cc1f79d690e80", "title": "Multiple Unmanned Aerial Vehicle Autonomous Path Planning Algorithm Based on Whale-Inspired Deep Q-Network"}, {"paperId": "b6607f24242ac04acd72475005c87ff899f802a4", "title": "Contribution of remote sensing to wildfire trend and dynamic analysis in two of Ghana’s ecological zones: Guinea-savanna and Forest-savanna mosaic"}, {"paperId": "00935188ebe096c2932594544910a2bff0e6012c", "title": "Wildfires in Australia: a bibliometric analysis and a glimpse on ‘Black Summer’ (2019/2020) disaster"}, {"paperId": "ad62b094d573f41360c20403f0dde1e37611d0b3", "title": "Up-Scaling Fuel Hazard Metrics Derived from Terrestrial Laser Scanning Using a Machine Learning Model"}, {"paperId": "57ebdae744bb74f91ca59a8339ac1daa360b53d8", "title": "A Review of Flying Ad Hoc Networks: Key Characteristics, Applications, and Wireless Technologies"}, {"paperId": "7788711952f3fd0a14c9ab1bcf156068c82a0f3e", "title": "Spatio-Temporal Characterization of Fire Using MODIS Data (2000–2020) in Colombia"}, {"paperId": "352f8023ef57bb54ad520bca083d27a1f740e609", "title": "A Framework for Burnt Area Mapping and Evacuation Problem Using Aerial Imagery Analysis"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "495f0acd2ae2c35d493eec91c7759a20792debc2", "title": "Civil Infrastructure Damage and Corrosion Detection: An Application of Machine Learning"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "f071383baeed8d2a13142e139c1f01f8ce635580", "title": "Generalized Net Model of Forest Zone Monitoring by UAVs"}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}, {"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires"}, {"paperId": "56914dc7187899842cc101fad0ad299180efeabe", "title": "Using Multivariate Regression and ANN Models to Predict Properties of Concrete Cured under Hot Weather"}, {"paperId": "01367aa4453e3a2826b232f790086fda32c2fd0f", "title": "Urban Overheating Assessment through Prediction of Surface Temperatures: A Case Study of Karachi, Pakistan"}]}
