{"paperId": "17f44a4ee9fcdbf2cef57d43ad16dea86cb61dba", "publicationVenue": null, "title": "Map Reduce Programming for Electronic Medical Records Data Analysis on Cloud Using Apache Hadoop, Hive and Sqoop", "abstract": "—Health care organizations now a day’s made a strategic decision to turn huge medical data coming from various sources into competitive advantage. This will help the health care organizations to monitor any abnormal measurements which require immediate reaction. Apache Hadoop has emerged as a software framework for distributed processing of large datasets across large clusters of computers. Hadoop is based on simple programming model called MapReduce. Hive is a data warehousing framework built on top of hadoop. Hive is designed to enable easy data summarization, ad-hoc querying and analysis of large volume of data. As health care and Electronic Medical Records (EMR) are generating huge data, it is necessary to store, extract and load such big data using a framework which support distributed processing. Cloud computing model provides efficient resources to store and process the data. In this paper we propose a MapReduce programming for Hadoop which can analyze the EMR on cloud. Hive is used to analyze large data of healthcare and medical records. Sqoop is used for easy data import and export of data from structured data stores such as relational databases, enterprise datawarehouses and NoSQL systems.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2015-08-01", "journal": {"name": "", "pages": "1-4", "volume": ""}, "authors": [{"authorId": "26993989", "name": "Sreekanth Rallapalli"}, {"authorId": "71091257", "name": "Augustin Minalkar"}], "citations": [{"paperId": "fc2a94d1c034328fff1f66c35849956acb203ed5", "title": "Big Data Ingestion and Preparation Tools"}, {"paperId": "2c98d2d9cf3fb6adb7b242d0a8353325327ab854", "title": "Model driven development of hybrid databases using lightweight metamodel extensions"}, {"paperId": "1ee667de5042e6640b15ad11cc6620369d5ce44e", "title": "Cloud Based Healthcare Framework for Criticality Level Analysis"}, {"paperId": "82d8b4d8257178a24b25d77eb136766e01f617b6", "title": "Model Driven Development of Hybrid Databases"}, {"paperId": "00adac377c574cf50f149deb1438545dc19196c7", "title": "Handling Complex Heterogeneous Healthcare Big Data"}]}
