{"paperId": "17f61201f38b453c8cccf6e2ca5484437897084a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Low-Power AES Data Encryption Architecture for a LoRaWAN", "abstract": "In recent years, the Internet of Things (IoT) has significantly increased the number of Internet connections to a large number of objects in different domains, including industry, homes and transportation. The LoRaWAN developed by the LoRa Alliance is a long-range wide area network specification suitable for an IoT environment due to its low-power communication. It provides a star-of-stars topology, well-defined MAC layer protocol and three communication modes to further lower its power consumption and employs the Advanced Encryption Standard (AES) cryptography and several session keys to increase its network security. However, for battery powered IoT end nodes, the AES encryption process consumes some amounts of power owing to involving multiple cycles of repetition. To solve this problem, in this study, we propose a low power consumed AES encryption architecture, named Low-Power AES Data Encryption Architecture (LPADA), which reduces the power consumed by the AES for data encryption by using low power SBox, power gating technique and power management method. A key updating procedure is also proposed to increase the security of the session-key renewal. The system is simulated using the Synopsys library with five different supply voltages. The experimental results show that 62.0% of dynamic power reduction and 88.5% of leakage power lowering have been achieved compared to the power consumed by traditional AES data encryption. The security analysis also shows that the key updating procedure for the LPADA enables mutual authentication between end nodes and application servers, and resists replay attacks and eavesdropping attacks from hackers.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-17", "journal": {"name": "IEEE Access", "pages": "146348-146357", "volume": "7"}, "authors": [{"authorId": "8556349", "name": "K. Tsai"}, {"authorId": "2671327", "name": "Fang-Yie Leu"}, {"authorId": "144026287", "name": "I. You"}, {"authorId": "1998952395", "name": "Shuo-Wen Chang"}, {"authorId": "1388818673", "name": "Shiung-Jie Hu"}, {"authorId": "1390587595", "name": "Hoonyong Park"}], "citations": [{"paperId": "16869733b0aa8e4aa3dee005f38465378b492859", "title": "Hybrid Cryptographic Approach for Data Security Using Elliptic Curve Cryptography for IoT"}, {"paperId": "0920507d27f96cc05928c1deebda572fcc334889", "title": "Enhanced Active Eavesdroppers Detection System for Multihop WSNs in Tactical IoT Applications"}, {"paperId": "dbe670543c90330a2188a95193ae1889eecdcc6f", "title": "Multi-Hop and Mesh for LoRa Networks: Recent Advancements, Issues, and Recommended Applications"}, {"paperId": "4e1b5c90bd247e81e658aab5691fe2a05e1e7adf", "title": "Long range technology for internet of things: review, challenges, and future directions"}, {"paperId": "83f8da77c6c044ee68892d3a365cdb4f0a921b5f", "title": "Leveraging Larger AES Keys in LoRaWAN: A Practical Evaluation of Energy and Time Costs"}, {"paperId": "0f3183a85475fa7ad4861a0bd24eb37069cee655", "title": "Enhancing Edge Network Security in Fog Computing: A Hybrid Authentication and Encryption Approach"}, {"paperId": "543e1b2c808b687d0d3c7f5230c4db85dc13dce9", "title": "Security and Privacy for Low Power IoT Devices on 5G and Beyond Networks: Challenges and Future Directions"}, {"paperId": "d42c99d29093388fabe6d53af361f3a145a6714a", "title": "Smart meter for residential electricity consumption with TLBO algorithm for LoRaWAN"}, {"paperId": "42c23a7fee0e1feea271fd78b635f12875ccd8c6", "title": "Security Enhancement of Joint Procedure Based on Improved Elliptic Curve Cryptography in LoRaWAN"}, {"paperId": "4ca928e311522876c1c0983bcde939d8af66b9d0", "title": "EBSS: A secure blockchain-based sharing scheme for real estate financial credentials"}, {"paperId": "d31e252b7b62f46944ceee2e2512be50e6f2d69e", "title": "Smart plug for monitoring and controlling electrical devices with a wireless communication system integrated in a LoRaWAN"}, {"paperId": "19dbdc7fe29b8d97d8247edcabce266c94c16cf7", "title": "A Secure Lightweight Authentication Scheme in IoT Environment with Perfect Forward and Backward Secrecy"}, {"paperId": "ef4a6caee8c562c3842cd6574ae982b207398314", "title": "A Novel Scheme for Discrete and Secure LoRa Communications"}, {"paperId": "b8eb00f113519a7f1c49c76898dd25e939abfea7", "title": "Enabling PIM-based AES encryption for online video streaming"}, {"paperId": "e8d3df4291b0f27b9b3da3f3b96e7c2c6726f6a8", "title": "Double Diagonal Puzzle Encryption Standard-512 for Securing Data over Cloud Environment"}, {"paperId": "7f7cc7ac75ed20fca11db477d4b5c46f129c5bdf", "title": "Active Eavesdroppers Detection System in Multi-hop Wireless Sensor Networks"}, {"paperId": "60dc86ed973c6fa03f06e7f634c80bc21a461705", "title": "An Advanced Encryption Standard in Memory (AESIM) Efficient, High Performance S-box Based AES Encryption and Decryption Architecture on VLSI"}, {"paperId": "8b8fbcacafd2a482b2e2371f78088ecec599d1b6", "title": "Network Communication Data Encryption Method Based on Wireless Channel Characteristics"}, {"paperId": "59b80b73cb3bfed1e1f93422ec8d574eb0160df7", "title": "Securing Communication in the IoT- Based Power Constrained Devices in Health Care System"}, {"paperId": "a5a340a43a19adfe769b05baf0fedf84b54500ee", "title": "Strengthened 32-bit AES implementation: Architectural error correction configuration with a new voting scheme"}, {"paperId": "aa5338a02191caf51c0a48076562d859f62739d5", "title": "Implementation of GOST 34.12-2018 Encryption for LoRaWAN End-devices"}, {"paperId": "14c71a11daaf9dff486761a3fc8746e3b27b4872", "title": "A Complete Key Management Scheme for LoRaWAN v1.1 †"}, {"paperId": "e32da2a2b2a76784a857101db5f507f51d73928b", "title": "Analysis of Key Generation Methods for Enable Secured Communication in the IoTs System"}, {"paperId": "acbed205d972cdd82e41032043ef7b482f503d27", "title": "Design and Testing of a Power Analyzer Monitor and Programming Device in Industries with a LoRA LPWAN Network"}, {"paperId": "a25c522865c68981b8ad6d0e956bb0056f9e8b23", "title": "Dynamic Multi-path and Multi-protocol Encrypted Communication Mechanism"}, {"paperId": "4d4bd11b1170793ac40ef6f24711f59d76c98968", "title": "LoRa technology for Internet of Things(IoT):A brief Survey"}, {"paperId": "bdd6633f2e11ae2c85c4d97d98cab8aa117e9c6d", "title": "LoRaWAN security survey: Issues, threats and possible mitigation techniques"}, {"paperId": "ebb98f2fa03b5840c1e261738ed3ee71e552eb77", "title": "A Novel Session Key Update Scheme for LoRaWAN"}, {"paperId": "a1e52c13dbc34cb0701581bf4240d5a5cc793bae", "title": "Lightweight Cryptographic Hash Functions: Design Trends, Comparative Study, and Future Directions"}, {"paperId": "26748748a8e1338caed5989e17bd06e596cce73d", "title": "A Novel Secure Root Key Updating Scheme for LoRaWANs Based on CTR_AES DRBG 128"}, {"paperId": "709339845fe647b8e5d5e00b89f8d9d1c4f4d01d", "title": "IoT-based control and monitoring system of a solar-powered brushless dc motor for agro-machines – the case of a Tanzanian-made oil press machine"}]}
