{"paperId": "17fd16b416894cc4bcaea8290e670e3214dc7a1a", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Big Data and Personalisation for Non-Intrusive Smart Home Automation", "abstract": "With the advent of the Internet of Things (IoT), many different smart home technologies are commercially available. However, the adoption of such technologies is slow as many of them are not cost-effective and focus on specific functions such as energy efficiency. Recently, IoT devices and sensors have been designed to enhance the quality of personal life by having the capability to generate continuous data streams that can be used to monitor and make inferences by the user. While smart home devices connect to the home Wi-Fi network, there are still compatibility issues between devices from different manufacturers. Smart devices get even smarter when they can communicate with and control each other. The information collected by one device can be shared with others for achieving an enhanced automation of their operations. This paper proposes a non-intrusive approach of integrating and collecting data from open standard IoT devices for personalised smart home automation using big data analytics and machine learning. We demonstrate the implementation of our proposed novel technology instantiation approach for achieving non-intrusive IoT based big data analytics with a use case of a smart home environment. We employ open-source frameworks such as Apache Spark, Apache NiFi and FB-Prophet along with popular vendor tech-stacks such as Azure and DataBricks.", "venue": "Big Data and Cognitive Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-30", "journal": {"name": "Big Data Cogn. Comput.", "pages": "6", "volume": "5"}, "authors": [{"authorId": "1915210", "name": "S. P. R. Asaithambi"}, {"authorId": "145710905", "name": "S. Venkatraman"}, {"authorId": "114793316", "name": "R. Venkatraman"}], "citations": [{"paperId": "dacba3106e3219bc548ec04ab9d357a28c4f419d", "title": "Role of IoT technologies in big data management systems: A review and Smart Grid case study"}, {"paperId": "3464a7a618abb90347b50b4faa7c2275b6e1905e", "title": "Deep Learning-based Automatic Optimization of Design Smart Home"}, {"paperId": "93bd231c1b826280e02de2b90788bd5cd07ca09b", "title": "Incorporating big data and IoT in intelligent ecosystems: state-of-the-arts, challenges and opportunities, and future directions"}, {"paperId": "24ceb0bbd37c8f3d2477363cb758631145239eb0", "title": "Inhabiting Interconnected Spaces: How Users Shape and Appropriate Their Smart Home Ecosystems"}, {"paperId": "9eb2e6b5e76bb3cbd81c75cc2927da6554c140a7", "title": "A Data Processing and Distribution System Based on Apache Nifi"}, {"paperId": "ea9882fd01cf927c89af66e0078e53d473ddc757", "title": "Design of a home automation system with voice interface “Yanapay 2.0” for people with lower limb motor disabilities"}, {"paperId": "095f85522e57b420afbde739e54379eb258bd7b1", "title": "Design of Literary Theory Teaching System in the Visual Field of Language Graphic Relations"}, {"paperId": "14a09869b935c2fbe27fdc3dc3706b6059dee97c", "title": "Application of Mirror Materials in Wood Furniture Manufacturing Process Based on Big Data Analysis"}, {"paperId": "72849a4732e58fb05999d41c5f4dd2ff9fa96f11", "title": "Modeling of Smart Watch and System Construction Method for the Elderly Based on Big Data"}, {"paperId": "9af8f306939d48f2b73e7975eabf6dc7b19cb79b", "title": "Service Oriented R-ANN Knowledge Model for Social Internet of Things"}, {"paperId": "81f524624c8d5f20213abc6799fb2eaf72824325", "title": "Analysis of Smart Home Systems in the Context of the Internet of Things in Terms of Consumer Experience"}, {"paperId": "bb2ada2e86626d3665c394db295d1af536da02d4", "title": "Bringing Smart Home Technology to Peer-to-Peer Accommodation: Exploring the Drivers of Intention to Stay in Smart Accommodation"}, {"paperId": "813106acd36ddb8ba26c0acb114f26ae906e2cf2", "title": "Big-Data Management: A Driver for Digital Transformation?"}, {"paperId": "c14963654c135d26319b24f6fc669f2298df19bb", "title": "Mass Personalisation as a Service in Industry 4.0: A Resilient Response Case Study"}, {"paperId": "246f216aae09d8cf90bb5ba24c6acd3e97b317d9", "title": "The technology that meets modern human needs – criteria of assessment of smart home system"}, {"paperId": "56cbf84df7607cac4c497c337d800b7a74870de1", "title": "Experts and intelligent systems for smart homes' Transformation to Sustainable Smart Cities: A comprehensive review"}, {"paperId": "63b2f7cb6be48a8da4ed6b59d527d51df37593f0", "title": "A Problem Analysis of Smart Home Automation: Toward Secure and Usable Communication-Based Authorization"}, {"paperId": "c26d375a173e81c546064e8d30e90e7d745a1a4f", "title": "MQTT Protocol Use Cases in the Internet of Things"}]}
