{"paperId": "180407d781a5f57729d88e24431bba50f67c8d03", "publicationVenue": null, "title": "IPChain: Blockchain-Based Security Protocol for IoT Address Management Servers in Smart Homes", "abstract": "The dynamic host configuration protocol (DHCP) servers are forms of an Internet of Things (IoT) address management server (IoTAMS) that gives network configuration settings to newly connected hosts. Administrators of a network may save time by setting DHCP servers instead of every network node. However, the absence of a more robust authentication method for DHCP servers makes hosts susceptible to attacks since neither the server nor the users are able to check the other’s authenticity during DHCP connections. These concerns result in both internal and external threats to the system that have the potential to impair network services. Among these threats are malicious DHCP servers and DHCP starvation. This paper aims to provide a novel approach for tackling these issues and protect the DHCP protocol. The proposed model uses the Diffie–Hellman key exchange mechanism, the elliptic curve discrete logarithm problem (ECDLP), a one-way hash function, blockchain technology, and a smart contract. In addition, registration and validation processes provide support for the proposed model in combating DHCP risks for both internal and external system threats. Results from this study show that the proposed model has an average of 21.1% more resistance to a growing number of adversaries than the benchmark models, thus revealing that the model is better suited for the security of IoT address management servers in smart homes, thereby enhancing resilience against related threats and the success of IP address management.", "venue": "J. Sens. Actuator Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-24", "journal": {"name": "J. Sens. Actuator Networks", "pages": "80", "volume": "11"}, "authors": [{"authorId": "104491493", "name": "B. M. Yakubu"}, {"authorId": "1396739540", "name": "M. Khan"}, {"authorId": "2524840", "name": "P. Bhattarakosol"}], "citations": [{"paperId": "dd27c35591dcbcd853edbc322ec9e430bb39692c", "title": "Green Blockchain and Smart Homes: A Systematic Review"}, {"paperId": "7a03ff4cddb306b9c8ced2f5c0a1a9998774bb0e", "title": "AI in IIoT Management of Cybersecurity for Industry 4.0 and Industry 5.0 Purposes"}, {"paperId": "c4878ceef4b82061dee693dfb1411bc235f7df31", "title": "Design of a Decentralized Identifier-Based Authentication and Access Control Model for Smart Homes"}, {"paperId": "d1585ce9c44d08fafc06e1e6e30342fd9d5c4207", "title": "Blockchain and Artificial Intelligence as Enablers of Cyber Security in the Era of IoT and IIoT Applications"}]}
