{"paperId": "18181a4f65cf8a292b21e31152292ed21e42f431", "publicationVenue": {"id": "47e4f61e-9b0e-431f-bd17-e534b53c655b", "name": "International Conference on Intelligent Computing", "type": "conference", "alternate_names": ["ICIC", "Int Conf Ind Instrum Control", "Int Conf Intell Comput", "International Conference on Industrial Instrumentation and Control"], "url": "http://www.wikicfp.com/cfp/program?id=1382"}, "title": "An IoT Enabled Framework for Smart Buildings Empowered with Cloud & Fog Infrastructures", "abstract": "Modern Urban development of Internet of Things (IoT) are appropriate candidates for the initiative of Smart City; which aims at integrating physical environments into computing & communication technologies leveraging maximum benefit in terms of resource utilization for optimal services. One substantial constituent of Smart City is Smart Building. A smart building is adequately intelligent to sense contextual environment and take smart decisions, competently employing available resource thus being more accurate, energy efficient and secure. Smart Building utilizes systems which are highly complex, dynamic natured and heterogeneous. Considering the functional requirements of Smart Building this research work emphasize that cloud has the potential of supporting complex computations, long term analytics and storage facilities for bulk amount of data being produced. It further specifies that cloud performance could be enhanced if innovative paradigm of Fog Computing is introduced along with cloud solution. The proposed Internet of Things (IoT) framework of Smart Building is deliberated with all associated benefits and apprehension of cloud Fog paradigm. Application model of the framework along with it processing modules is also demonstrated in research effort. Performance metrics are evaluated with cloud deployments and with cloud fog deployments for further clarity.", "venue": "International Conference on Intelligent Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 International Conference on Innovative Computing (ICIC)", "pages": "1-8"}, "authors": [{"authorId": "146884797", "name": "Hira Fayyaz"}, {"authorId": "29167058", "name": "Z. U. Rehman"}, {"authorId": "49134181", "name": "Sagheer Abbas"}], "citations": [{"paperId": "c351690fb6f09d725c5c6cf390b720cc71a64471", "title": "CDBB West Cambridge Digital Twin: Lessons Learned"}, {"paperId": "7f558d5450455ac9e90c9f21bcd4fcce082ccab8", "title": "Residential Power Load Prediction in Smart Cities using Machine Learning Approaches"}, {"paperId": "11b9dfcde5488c64b052807f514578814d7330ce", "title": "How Automate Requirements Engineering System Effects and Support Requirement Engineering"}, {"paperId": "5ecebba166a7e62e8c97034213d6455fb0b2502d", "title": "SenseRT: A Streaming Architecture for Smart Building Sensors"}, {"paperId": "813785fee2e0d233f9d4adcaa763d5de9e31a1af", "title": "Quality attributes in edge computing for the Internet of Things: A systematic mapping study"}]}
