{"paperId": "1825629e1ba38dc82dbc5324860527b027915dc0", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "A comprehensive methodology for discovering semantic relationships among geospatial vocabularies using oceanographic data discovery as an example", "abstract": "ABSTRACT It is challenging to find relevant data for research and development purposes in the geospatial big data era. One long-standing problem in data discovery is locating, assimilating and utilizing the semantic context for a given query. Most research in the geospatial domain has approached this problem in one of two ways: building a domain-specific ontology manually or discovering automatically, semantic relationships using metadata and machine learning techniques. The former relies on rich expert knowledge but is static, costly and labor intensive, whereas the second is automatic and prone to noise. An emerging trend in information science takes advantage of large-scale user search histories, which are dynamic but subject to user- and crawler-generated noise. Leveraging the benefits of these three approaches and avoiding their weaknesses, a novel methodology is proposed to (1) discover vocabulary-based semantic relationships from user search histories and clickstreams, (2) refine the similarity calculation methods from existing ontologies and (3) integrate the results of ontology, metadata, user search history and clickstream analysis to better determine their semantic relationships. An accuracy assessment by domain experts for the similarity values indicates an 83% overall accuracy for the top 10 related terms over randomly selected sample queries. This research functions as an example for building vocabulary-based semantic relationships for different geographical domains to improve various aspects of data discovery, including the accuracy of the vocabulary relationships of commonly used search terms.", "venue": "International Journal of Geographical Information Science", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-07-31", "journal": {"name": "International Journal of Geographical Information Science", "pages": "2310 - 2328", "volume": "31"}, "authors": [{"authorId": "2096996", "name": "Yongyao Jiang"}, {"authorId": "2117014117", "name": "Yun Li"}, {"authorId": "31823352", "name": "C. Yang"}, {"authorId": "2146385158", "name": "Kai Liu"}, {"authorId": "31000999", "name": "E. Armstrong"}, {"authorId": "2108863205", "name": "Thomas S. Huang"}, {"authorId": "2539268", "name": "D. Moroni"}, {"authorId": "2080999551", "name": "Christopher J. Finch"}], "citations": [{"paperId": "b23b2090776bc55b623cda178aa35733348ebd40", "title": "A Method for Identifying Geospatial Data Sharing Websites by Combining Multi-Source Semantic Information and Machine Learning"}, {"paperId": "7eaf28cd2cec76387adea7bd92c5066fe29e8130", "title": "Implicit, Formal, and Powerful Semantics in Geoinformation"}, {"paperId": "31dc2f2a262c83eb3de0948a3d32ae3165cafd35", "title": "A Framework Uniting Ontology-Based Geodata Integration and Geovisual Analytics"}, {"paperId": "7695bcfe3723b34c4452158b787bec5b5cef43ba", "title": "Improving search ranking of geospatial data based on deep learning using user behavior data"}, {"paperId": "5135e1624d1d6c44112faf581918765434932974", "title": "A Review of Geospatial Semantic Information Modeling and Elicitation Approaches"}, {"paperId": "4db77bda1e939b2c9f4e85b69a27d358cbaf8bd0", "title": "A Query Understanding Framework for Earth Data Discovery"}, {"paperId": "ed5e242466fe3a19d25c73577f398db91bec9b2f", "title": "A vocabulary recommendation method for spatiotemporal data discovery based on Bayesian network and ontologies"}, {"paperId": "c241755a045c266b8dc32242a11d44f3dd6285ca", "title": "An Integrated Data Analytics Platform"}, {"paperId": "65d64dd9b6db7ea63c809d4cbaaf10b9fdb37db1", "title": "Big Earth data analytics: a survey"}, {"paperId": "3d20200aca028dec17ae2611b90c37ecd90fa48d", "title": "Planetary Defense Mitigation Gateway: A One-Stop Gateway for Pertinent PD-Related Contents"}, {"paperId": "1d9975c17c991f0865ed272e0fe47925cac9ef24", "title": "A Cloud-Based Framework for Large-Scale Log Mining through Apache Spark and Elasticsearch"}, {"paperId": "b7d1c100f8c3f0a8050f36f7158293d1627aa662", "title": "Towards intelligent geospatial data discovery: a machine learning framework for search ranking"}, {"paperId": "5576ee9d157e227f4d1ccff30d6e8686301c8694", "title": "A Smart Web-Based Geospatial Data Discovery System with Oceanographic Data as an Example"}]}
