{"paperId": "18348ec40d78c8b9bfb3c7d10b4b5a1cb16586d8", "publicationVenue": null, "title": "Optimizing Replication of Data for Distributed Cloud Computing Environments: Techniques, Challenges, and Research Gap", "abstract": "In distributed cloud computing environments, replication of data is a crucial technique for achieving high availability and reliability. However, optimizing replication of data poses significant challenges due to the dynamic nature of cloud environments, the increasing volume of data, and the diverse requirements of various applications. In this paper, a comprehensive analysis of the techniques, challenges, and solutions for optimizing replication of data in distributed cloud computing environments are presented. It is started by providing an overview of the basics of replication of data and the reasons why it is necessary in cloud computing environments. Then, the various replication techniques that have been proposed, including static, dynamic, and hybrid replication are discussed. The advantages and disadvantages of each technique and compare their performance in different scenarios have been analyzed. A combination of techniques may also be used to achieve the desired level of availability, performance, and resilience. Thus, many researchers introduced many strategies and algorithms for the same. The challenges that arise when optimizing replication of data, such as consistency, scalability, fault-tolerance, and security are also reviewed. This survey aims to provide a comprehensive understanding of the techniques, challenges, and solutions for optimizing replication of data in distributed cloud computing environments, and to highlight the future research directions and research gap in this area.", "venue": "2023 2nd International Conference on Edge Computing and Applications (ICECAA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-07-19", "journal": {"name": "2023 2nd International Conference on Edge Computing and Applications (ICECAA)", "pages": "35-41"}, "authors": [{"authorId": "2154962439", "name": "S. Naganandhini"}, {"authorId": "70221305", "name": "D. Shanthi"}], "citations": [{"paperId": "bf3cee9071a7e9a2e59bd6fc718494ddd014ed84", "title": "A novel fuzzy programming approach for piece selection problem in P2P content distribution network"}, {"paperId": "4341b174d5df75fc4a8267a914862c8ee9f57eb2", "title": "A Holistic Approach to Prevent Drug Misuse: Strategies and Framework for Comprehensive Support"}, {"paperId": "3fe1678aeb3c5b4302274414e81c17078cdab114", "title": "Towards Energy-Efficient Data Centres: A Comprehensive Analysis of Cooling Strategies for Maximizing Efficiency and Sustainability"}]}
