{"paperId": "184794e37c15c97d89e2cc1e91fe2b762e85fccd", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Query optimization mechanisms in the cloud environments: A systematic study", "abstract": "The goal of a query optimizer is to provide an optimal Query Execution Plan (QEP) by comparing alternative query plans. In a distributed database system over cloud environment, the relations required by a query plan may be stored at multiple sites. This leads to an exponential increase in the number of possible equivalent plan alternatives to find an optimal QEP. Although it is not computationally reasonable to explore exhaustively all possible plans in such large search space. Although query optimization mechanisms are important in the cloud environments, to the best of our knowledge, there exists no complete and systematic review on investigating these issues. Therefore, in this paper, four categories to study these mechanisms are considered which are search‐based, machine learning‐based, schema‐based, and security‐based mechanisms. Also, this paper represents the advantages and disadvantages of the selected query optimization techniques and investigates the metrics of their techniques. Finally, the important challenges of these techniques are reviewed to develop more efficient query optimization techniques in the future.", "venue": "International Journal of Communication Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-03-12", "journal": {"name": "International Journal of Communication Systems", "volume": "32"}, "authors": [{"authorId": "73185062", "name": "E. Azhir"}, {"authorId": "2253670", "name": "Nima Jafari Navimipour"}, {"authorId": "144513368", "name": "M. Hosseinzadeh"}, {"authorId": "144499901", "name": "A. Sharifi"}, {"authorId": "66424117", "name": "A. Darwesh"}], "citations": [{"paperId": "e0afec78fe17741998c7a3ca3fd958f7744bbc59", "title": "Query Optimization in Distributed Database Based on Improved Artificial Bee Colony Algorithm"}, {"paperId": "e641c822f8facb50df2e236809119ee165941c95", "title": "Blockchain-Based Cloud Storage System with Enhanced Optimization and Integrity Preservation"}, {"paperId": "b4c21c3ebf4747f42e99750de86a5861e14782e2", "title": "LBAA: A novel load balancing mechanism in cloud environments using ant colony optimization and artificial bee colony algorithms"}, {"paperId": "05d9b7dd5c02e9f35607d2a448faaa610e30ae2d", "title": "Cloud healthcare services: A comprehensive and systematic literature review"}, {"paperId": "53834f7848f44463b259f69d151986ffb50b6769", "title": "An Elementary Study of Query Optimization"}, {"paperId": "e2b621e81d6055b111a1b1cdd57df0d979e03809", "title": "Blockchain-based cloud storage system with CP-ABE-based access control and revocation process"}, {"paperId": "6ffa9d997bd772ec8fb3151aeaa21bd71198d14e", "title": "Join queries optimization in the distributed databases using a hybrid multi-objective algorithm"}, {"paperId": "c7420f9400aafa9ca1356b1a5cff4601930cc36a", "title": "Blockchain-based decentralized architecture for cloud storage system"}, {"paperId": "72ef4ee4dceb5db79db7247f0b248ecce119dea0", "title": "Distributed query optimization strategies for cloud environment"}, {"paperId": "a8ae2b8cd0f718aa714d8cdf427f3edf98068678", "title": "A technique for parallel query optimization using MapReduce framework and a semantic-based clustering method"}, {"paperId": "a5b32300f8e46eaa6895552321698a336ccec68e", "title": "An automatic clustering technique for query plan recommendation"}, {"paperId": "edd485697fde8e0450a93f6bd01160f22125cbc5", "title": "SECURING CLOUD DATA AGAINST CYBER-ATTACKS USING HYBRID AES WITH MHT ALGORITHM"}, {"paperId": "1236b14af18700032f33a3592024da7968154831", "title": "A systematic study on meta-heuristic approaches for solving the graph coloring problem"}, {"paperId": "8dda0bb2f6af22a28c4c9d1651b9e5622510df93", "title": "The impact of knowledge on e-health: a systematic literature review of the advanced systems"}, {"paperId": "74bec51a66499fcfbced16ff3fce696acf98c9e1", "title": "Healthcare big data processing mechanisms: The role of cloud computing"}, {"paperId": "c40f22ba2663c71cda021293af1121d2d216f21c", "title": "Health care service delivery based on the Internet of things: A systematic and comprehensive study"}, {"paperId": "c0a20f51ba7eed87d0df54d09a78c3c25d19b0d1", "title": "A method for virtual machine migration in cloud computing using a collective behavior‐based metaheuristics algorithm"}, {"paperId": "0b442b89bafff911ceca46234833406b856975ae", "title": "Priority-based task scheduling method over cloudlet using a swarm intelligence algorithm"}, {"paperId": "2a1a34ef16f084ccd30f75434a72a3d2cb5e8383", "title": "Decentralized and Privacy-Preserving Public Auditing for Cloud Storage Based on Blockchain"}, {"paperId": "c76e68d4df6affc9a94ffa83830a52004bfbf2d8", "title": "Pricing the Cloud: An Auction Approach"}, {"paperId": "a83c4565ec6b5773a5416b317f9a908789f46560", "title": "Knowledge sharing mechanisms in virtual communities: A review of the current literature and recommendations for future research"}]}
