{"paperId": "1848fd7dc64e9cd99ebe7a67dd3672907ca851fb", "publicationVenue": null, "title": "PAPAYA: A library for performance analysis of SQL-based RDF processing systems", "abstract": "Prescriptive Performance Analysis (PPA) has shown to be more useful than traditional descriptive and diagnostic analyses for making sense of Big Data (BD) frameworks’ performance. In practice, when processing large (RDF) graphs on top of relational BD systems, several design decisions emerge and cannot be decided automatically, e.g., the choice of the schema, the partitioning technique, and the storage formats. PPA, and in particular ranking functions, helps enable actionable insights on performance data, leading practitioners to an easier choice of the best way to deploy BD frameworks, especially for graph processing. However, the amount of experimental work required to implement PPA is still huge. In this paper, we present PAPAYA,11 https://github.com/DataSystemsGroupUT/PAPyA a library for implementing PPA that allows (1) preparing RDF graphs data for a processing pipeline over relational BD systems, (2) enables automatic ranking of the performance in a user-defined solution space of experimental dimensions; (3) allows user-defined flexible extensions in terms of systems to test and ranking methods. We showcase PAPAYA on a set of experiments based on the SparkSQL framework. PAPAYA simplifies the performance analytics of BD systems for processing large (RDF) graphs. We provide PAPAYA as a public open-source library under an MIT license that will be a catalyst for designing new research prescriptive analytical techniques for BD applications.", "venue": "Semantic Web", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-05", "journal": {"name": "Semantic Web"}, "authors": [{"authorId": "2065777089", "name": "Mohamed Ragab"}, {"authorId": "2184922672", "name": "Adam Satria Adidarma"}, {"authorId": "2295402533", "name": "Riccardo Tommasini"}], "citations": []}
