{"paperId": "185612cb59ba167b43e208fba3a53cdf6afa153d", "publicationVenue": {"id": "5758d639-a450-4152-901d-7a78c8715aa7", "name": "International Conference on Innovative Computing and Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Control Commun  Comput India", "IEEE Int Conf Cogn Comput", "IEEE International Conference Computer and Communications", "Int Carpathian Control Conf", "Int Conf Cogn Comput [services Soc", "Int Conf Comput Cybern", "IEEE International Conference on Cognitive Computing", "IEEE Int Conf Comput Commun", "International Conference on Computer Communication", "Int Conf Innov Comput Cloud Comput", "International Carpathian Control Conference", "International Conference on Computational Creativity", "Int Conf Comput Commun", "International Conference on Control Communication & Computing India", "ICCC", "International Conference on Computational Cybernetics", "Int Conf Comput Creativity", "International Conference on Cognitive Computing [Services Society]", "IEEE Int Conf Commun China", "IEEE International Conference on Communications in China"], "url": "http://computationalcreativity.net/", "alternate_urls": ["http://www.icccgovernors.org/"]}, "title": "Predictive maintenance of pumping system bearings with evolved autoencoders", "abstract": "Industry 4.0 introduced the application of various remote sensing and intelligent or autonomous decision-making to the manufacturing floors. One of the most important aspects is the maintenance of the machinery and equipment preemptively so that their breakage does as minimal damage (in downtime, safety, etc.) as possible. Analyzing the machinery data with machine algorithms (especially artificial neural networks (ANN)) plays a crucial role. However, designing and training ANN algorithms is still a time-consuming and complex process with various remaining issues, including generalization, the necessity for large datasets, and high time complexity. As a result, a few decades ago, neuroevolution was developed to improve the ANN construction process. Recently, it has gained considerable attention alongside a rise in computational power. In this paper, we use the power of neuroevolution to design a specific type of ANN called an autoencoder (AE) which can be used for a particular type of task, such as anomaly detection (AD). Our proposed method, has shown promising results. Our approach achieved a peak test accuracy of 75% in 0.4 quantiles and an area under the curve (AUC) of 73% in AD on the predictive maintenance dataset. Our proposed method can serve as a starting point for further research.", "venue": "International Conference on Innovative Computing and Cloud Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-06", "journal": {"name": "2022 IEEE 10th Jubilee International Conference on Computational Cybernetics and Cyber-Medical Systems (ICCC)", "pages": "000149-000154"}, "authors": [{"authorId": "1418290389", "name": "Saso Pavlic"}, {"authorId": "2052908523", "name": "Nicholas Young"}, {"authorId": "1681718", "name": "S. Karakatič"}], "citations": []}
