{"paperId": "1872f215570377855739627afa78ed18ba8e4c5b", "publicationVenue": {"id": "01103732-3808-4930-b8e4-7e9e68d5c68d", "name": "North American Chapter of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["North Am Chapter Assoc Comput Linguistics", "NAACL"], "url": "https://www.aclweb.org/portal/naacl"}, "title": "Forecasting COVID-19 Caseloads Using Unsupervised Embedding Clusters of Social Media Posts", "abstract": "We present a novel approach incorporating transformer-based language models into infectious disease modelling. Text-derived features are quantified by tracking high-density clusters of sentence-level representations of Reddit posts within specific US states’ COVID-19 subreddits. We benchmark these clustered embedding features against features extracted from other high-quality datasets. In a threshold-classification task, we show that they outperform all other feature types at predicting upward trend signals, a significant result for infectious disease modelling in areas where epidemiological data is unreliable. Subsequently, in a time-series forecasting task, we fully utilise the predictive power of the caseload and compare the relative strengths of using different supplementary datasets as covariate feature sets in a transformer-based time-series model.", "venue": "North American Chapter of the Association for Computational Linguistics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-20", "journal": {"name": "ArXiv", "volume": "abs/2205.10408"}, "authors": [{"authorId": "2166045586", "name": "Felix Drinkall"}, {"authorId": "8106073", "name": "S. Zohren"}, {"authorId": "1970864", "name": "J. Pierrehumbert"}], "citations": [{"paperId": "6907af75a851c8082f8ae893d29f2c71d49ecf44", "title": "Dynamic Time Warping for Lead-Lag Relationships in Lagged Multi-Factor Models"}, {"paperId": "67352ca13a24f97380577db276c702c620515b2a", "title": "Robust Detection of Lead-Lag Relationships in Lagged Multi-Factor Models"}, {"paperId": "ac6a6f711a0ed8e45ab6caf982b902e37da9c6e0", "title": "Using MT for multilingual covid-19 case load prediction from social media texts"}, {"paperId": "0cea216f7b82a7394942dae04d061d4c5843c866", "title": "Condition-Treatment Relation Extraction on Disease-related Social Media Data"}]}
