{"paperId": "18826046a2b1d4ee08c7909aac90e656a83a9ae2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Survey of Authentication in Internet of Things-Enabled Healthcare Systems", "abstract": "The Internet of medical things (IoMT) provides an ecosystem in which to connect humans, devices, sensors, and systems and improve healthcare services through modern technologies. The IoMT has been around for quite some time, and many architectures/systems have been proposed to exploit its true potential. Healthcare through the Internet of things (IoT) is envisioned to be efficient, accessible, and secure in all possible ways. Even though the personalized health service through IoT is not limited to time or location, many associated challenges have emerged at an exponential pace. With the rapid shift toward IoT-enabled healthcare systems, there is an extensive need to examine possible threats and propose countermeasures. Authentication is one of the key processes in a system’s security, where an individual, device, or another system is validated for its identity. This survey explores authentication techniques proposed for IoT-enabled healthcare systems. The exploration of the literature is categorized with respect to the technology deployment region, as in cloud, fog, and edge. A taxonomy of attacks, comprehensive analysis, and comparison of existing authentication techniques opens up possible future directions and paves the road ahead.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-11-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2145517097", "name": "Mudassar Ali Khan"}, {"authorId": "41034385", "name": "I. Din"}, {"authorId": "102644772", "name": "Tha’er Majali"}, {"authorId": "2154556525", "name": "Byung-Seo Kim"}], "citations": [{"paperId": "74c8f565ca48faa52a45ba39fd76886ca9b4b767", "title": "Exploring Authentication Paradigms in the Internet of Things: A Comprehensive Scoping Review"}, {"paperId": "a8cc0c8c1f06968fd1099d540455707942074d80", "title": "Cryptanalysis and Improvement of Several Identity-Based Authenticated and Pairing-Free Key Agreement Protocols for IoT Applications"}, {"paperId": "435fd89acecfd59f3f0fb613969c5c3d73db4fa6", "title": "Worldwide Research Trends and Hotspot on IOMT Based on Bibliometric Analysis"}, {"paperId": "72f82ed8cb04e39364dd8555e8e8b663453e2333", "title": "Global Models of Smart Cities and Potential IoT Applications: A Review"}, {"paperId": "462cd39ade7a530ed829dda50d7023b7d383ce55", "title": "Visualization of Remote Patient Monitoring System Based on Internet of Medical Things"}, {"paperId": "ca2fc126cd4ef37d8053eee74d40b9a0e0fcc463", "title": "Code Integrity and Confidentiality: An Active Data Approach for Active and Healthy Ageing"}, {"paperId": "ad69536d23781a2995f568274a5d1c7b6a364229", "title": "Securing Access to Internet of Medical Things Using a Graphical-Password-Based User Authentication Scheme"}, {"paperId": "ff52eaf8baf7cfb10b459bae5fb8ce891e72e899", "title": "Monitoring and Control Framework for IoT, Implemented for Smart Agriculture"}, {"paperId": "a4b42f80d7ffe890b53d4da1e640df115225342f", "title": "Smart Gateway for Healthcare Networks Based on Beam Steering Technology"}, {"paperId": "973c87c30c3d501bf96f97709d2e11f347b22db1", "title": "Self-x based closed loop wearable IoT for real-time detection and resolution of sleep apnea"}, {"paperId": "87e10c32ad8efe459b53aff46b52e6c3a15a0f85", "title": "Effective Identity Authentication Based on Multiattribute Centers for Secure Government Data Sharing"}, {"paperId": "a5279061d7d65d90dbc6687a37dbe849c5a8bcac", "title": "Fog Computing in Healthcare: Systematic Review"}]}
