{"paperId": "18a0b2caf6bfff82d05936f7059ff2c94e7f7181", "publicationVenue": null, "title": "Relational schemata for distributed SPARQL query processing", "abstract": "To benefit from mature database technology RDF stores are built on top of relational databases and SPARQL queries are mapped into SQL. Using a shared-nothing computer cluster is a way to achieve scalability by carrying out query processing on top of large RDF datasets in a distributed fashion. Aiming to this the current paper elaborates on the impact of relational schema design when queries are mapped into Apache Spark SQL. A single triple table, a set of tables resulting from partitioning by predicate, a single wide table covering all properties, and a set of tables based on the application model specification called domain-dependent-schema, are the considered designs. For each of the mentioned approaches, the rows of the corresponding tables are stored in the distributed file system HDFS using the columnar-store Parquet. Experiments using standard benchmarks demonstrate that the single wide property table approach, despite its simplicity, is superior to other approaches. Further experiments demonstrate that this single table approach continues to be attractive even when repartitioning by key (RDF subject) is applied before executing queries.", "venue": "SBD '19", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-05", "journal": {"pages": "3:1-3:6"}, "authors": [{"authorId": "3108054", "name": "Victor Anthony Arrascue Ayala"}, {"authorId": "120181206", "name": "Polina Koleva"}, {"authorId": "3199056", "name": "Anas Alzogbi"}, {"authorId": "2074022256", "name": "Matteo Cossu"}, {"authorId": "151112226", "name": "Michael Färber"}, {"authorId": "2276145", "name": "Patrick Philipp"}, {"authorId": "1915169", "name": "Guilherme Schievelbein"}, {"authorId": "1710616", "name": "Io Taxidou"}, {"authorId": "1809410", "name": "G. Lausen"}], "citations": [{"paperId": "9e12a5f5b9094c9e51e4590ef11c9fb26c4c8a65", "title": "An Effective Framework for Enhancing Query Answering in a Heterogeneous Data Lake"}, {"paperId": "0e74d9dea6398e3eb6290ac8ea792692357dab95", "title": "Towards making sense of Spark-SQL performance for processing vast distributed RDF datasets"}, {"paperId": "2d439d5264237c64ca2330eff374526585f4638d", "title": "On Complex Value Relations in Hive"}, {"paperId": "205c1a0107c763f612ce3467c3615897fb38af90", "title": "Strabo 2: Distributed Management of Massive Geospatial RDF Datasets"}, {"paperId": "85c6db4e2eb186a8cd251220882342cdafd34ce1", "title": "An In-depth Investigation of Large-scale RDF Relational Schema Optimizations Using Spark-SQL"}, {"paperId": "54116169e40dd36223e85ef036a82327b3bfd882", "title": "Comparing Schema Advancements for Distributed RDF Querying Using SparkSQL"}, {"paperId": "e8c7c66f0f0fd0ddb8bc0e59b43fd43ebf26f460", "title": "Exploiting Wide Property Tables Empowered by Inverse Properties for Efficient Distributed SPARQL Query Evaluation"}]}
