{"paperId": "18a3e346e2045ff96fc15c33aafcd83cd4d2779a", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "No Provisioned Concurrency: Fast RDMA-codesigned Remote Fork for Serverless Computing", "abstract": "Serverless platforms essentially face a tradeoff between container startup time and provisioned concurrency (i.e., cached instances), which is further exaggerated by the frequent need for remote container initialization. This paper presents MITOSIS, an operating system primitive that provides fast remote fork, which exploits a deep codesign of the OS kernel with RDMA. By leveraging the fast remote read capability of RDMA and partial state transfer across serverless containers, MITOSIS bridges the performance gap between local and remote container initialization. MITOSIS is the first to fork over 10,000 new containers from one instance across multiple machines within a second, while allowing the new containers to efficiently transfer the pre-materialized states of the forked one. We have implemented MITOSIS on Linux and integrated it with FN, a popular serverless platform. Under load spikes in real-world serverless workloads, MITOSIS reduces the function tail latency by 89% with orders of magnitude lower memory usage. For serverless workflow that requires state transfer, MITOSIS improves its execution time by 86%.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-19", "journal": {"pages": "497-517"}, "authors": [{"authorId": "1815539", "name": "Xingda Wei"}, {"authorId": "2152326110", "name": "Fangming Lu"}, {"authorId": "2118915218", "name": "Tianxia Wang"}, {"authorId": "47748458", "name": "Jinyu Gu"}, {"authorId": "2108774629", "name": "Yuh-Wen Yang"}, {"authorId": "144593763", "name": "Rong Chen"}, {"authorId": "2118438836", "name": "Haibo Chen"}], "citations": [{"paperId": "59877dc00faf12035ebe02ebf71d2a6eeada04fa", "title": "Optimizing serverless computing: A comparative analysis of multi-output regression models for predictive function invocations"}, {"paperId": "d9e43027a16d01ad9409703eb2237f1832c24014", "title": "ServerlessLLM: Locality-Enhanced Serverless Inference for Large Language Models"}, {"paperId": "1ecdf0add6e2d139c1afc970d427d7b34a8e6cf3", "title": "Online Function Caching in Serverless Edge Computing"}, {"paperId": "e9f5b03846caa60002ea59207f770d952eb8cede", "title": "Rethinking Deployment for Serverless Functions: A Performance-first Perspective"}, {"paperId": "9f06c7d6e0f45059f7d8805eb47048ee4c496613", "title": "Chitu: Accelerating Serverless Workflows with Asynchronous State Replication Pipelines"}, {"paperId": "c79d37cd367ec1d5dde1ed10bfb399f2a948f851", "title": "Halfmoon: Log-Optimal Fault-Tolerant Stateful Serverless Computing"}, {"paperId": "ebbb0144cd2a6dca0d7adf4d87cd02ae6711de73", "title": "Quark: A High-Performance Secure Container Runtime for Serverless Computing"}, {"paperId": "3851ae623106dc46ed031b44a3137719e4ef262e", "title": "Microsecond-scale Datacenter Computing with Modern Networking"}, {"paperId": "6ae0749175d99bde9a71f2f097ad5bad5984abf7", "title": "TSoR: TCP Socket over RDMA Container Network for Cloud Native Computing"}, {"paperId": "7ddaa49070c732ede191cc431f6512af2892b50a", "title": "μSwitch: Fast Kernel Context Isolation with Implicit Context Switches"}, {"paperId": "a1b751e594bcffd85cc15788d603b700a7f56e2c", "title": "Characterizing Off-path SmartNIC for Accelerating Distributed Systems"}]}
