{"paperId": "18ad0da02b2207288a3fe7c19ee8d223a9ee3ef4", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "MT-Teql: Evaluating and Augmenting Neural NLIDB on Real-world Linguistic and Schema Variations", "abstract": "\n Natural Language Interface to Database (NLIDB) translates human utterances into SQL queries and enables database interactions for non-expert users. Recently, neural network models have become a major approach to implementing NLIDB. However, neural NLIDB faces challenges due to variations in natural language and database schema design. For instance, one user intent or database conceptual model can be expressed in\n various forms.\n However, existing benchmarks, using hold-out datasets, cannot provide thorough understanding of how good neural NLIDBs really are in real-world situations and its robustness against such variations. A key difficulty is to annotate SQL queries for inputs under real-world variations, requiring considerable manual effort and expert knowledge.\n \n To systematically assess the robustness of neural NLIDBs without extensive manual effort, we propose MT-Teql, a unified framework to benchmark NLIDBs against real-world language and schema variations. Inspired by recent advances in DBMS metamorphic testing, MT-Teql implements semantics-preserving transformations on utterances and database schemas to generate their variants. NLIDBs can thus be examined for robustness utilizing utterances/schemas and their variants without requiring manual intervention.\n We benchmarked nine neural NLIDBs using 62,430 inputs and identified 15,433 defects. We analyzed potential root causes of defects and conducted a user study to show how MT-Teql can assist developers to systematically assess NLIDBs. We further show that the transformed (error-triggering) inputs can be used to augment popular NLIDBs and eliminate 46.5%(±5.0%) errors made by them without compromising their accuracy on standard benchmarks. We summarize lessons from this study that can provide insights to select and design NLIDBs that fit particular usage scenarios.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "569-582", "volume": "15"}, "authors": [{"authorId": "1384480816", "name": "Pingchuan Ma"}, {"authorId": "2118511999", "name": "Shuai Wang"}], "citations": [{"paperId": "8ce5d190e1548ac12db306ba1c171d21b5d615b1", "title": "Improving Generalization in Semantic Parsing by Increasing Natural Language Variation"}, {"paperId": "1fec7c75f2183a20b99dd8c34f13f9886e368f06", "title": "An Empirical Study on Large Language Models in Accuracy and Robustness under Chinese Industrial Scenarios"}, {"paperId": "ac441cb1810dce8e41d9cd554366b72aa182bf41", "title": "Testing Graph Database Systems via Graph-Aware Metamorphic Relations"}, {"paperId": "9ddd1a8705cd4af1b193a8a554efe0671d9f0aa9", "title": "$R^3$-NL2GQL: A Hybrid Models Approach for for Accuracy Enhancing and Hallucinations Mitigation"}, {"paperId": "f5314b7b1bb7d7d27a5239b4865cbb0e565ac0f5", "title": "PhyFu: Fuzzing Modern Physics Simulation Engines"}, {"paperId": "25c177209e385a58bd924882d4bbed683f44b821", "title": "RHB-Net: A Relation-aware Historical Bridging Network for Text2SQL Auto-Completion"}, {"paperId": "e7a4e7b349b70b1681978cd57a59a6e1684b219f", "title": "ScienceBenchmark: A Complex Real-World Benchmark for Evaluating Natural Language to SQL Systems"}, {"paperId": "24ef856534bbc0931c8bf5d2e754fda1bdedcde2", "title": "\"Oops, Did I Just Say That?\" Testing and Repairing Unethical Suggestions of Large Language Models with Suggest-Critique-Reflect Process"}, {"paperId": "552db808a7d31d13693139a25cde2f1557bf7693", "title": "CC: Causality-Aware Coverage Criterion for Deep Neural Networks"}, {"paperId": "3603e74611f1438141af17d4c73af81d8c3bc024", "title": "Demonstration of InsightPilot: An LLM-Empowered Automated Data Exploration System"}, {"paperId": "c455f81b9e8f06390075563e49933a6bf3d20b64", "title": "Gar: A Generate-and-Rank Approach for Natural Language to SQL Translation"}, {"paperId": "e817b79f3d1ce0add9cb9b653d91af378f1dea18", "title": "CatSQL: Towards Real World Natural Language to SQL Applications"}, {"paperId": "7195ed3c7f11220f29634cecb68b1d39db2e36d9", "title": "Dr.Spider: A Diagnostic Evaluation Benchmark towards Text-to-SQL Robustness"}, {"paperId": "1f3172d24efa88940e170e3fbcc826e86aac2246", "title": "On the Structural Generalization in Text-to-SQL"}, {"paperId": "bc482964a708d45a290c0d756b0fa01b2e57c26f", "title": "Unveiling Hidden DNN Defects with Decision-Based Metamorphic Testing"}, {"paperId": "d0da09b12d16ea685532cdd47185ad2b888fc03a", "title": "Perfce: Performance Debugging on Databases with Chaos Engineering-Enhanced Causality Analysis"}, {"paperId": "65fd4085a8498928e675d4cb50c0a31092f410fb", "title": "Unleashing the Power of Compiler Intermediate Representation to Enhance Neural Program Embeddings"}, {"paperId": "f091dbd8f03143eafd929ba3935c7cacc2e56757", "title": "Metamorphic Testing of Deep Learning Compilers"}, {"paperId": "1f39cd9084c92537126c1ba3dd9e741a1596b15e", "title": "MDPFuzz: testing models solving Markov decision processes"}, {"paperId": "0e5902c3e895df1b1927fa28f3cc9c5870983067", "title": "Exploring Schema Generalizability of Text-to-SQL"}]}
