{"paperId": "18db1ed23225ecfa0fdf6b3b2107c7e77333949c", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Mitigating Bottlenecks in Wide Area Data Analytics via Machine Learning", "abstract": "Over the past decade, we have witnessed exponential growth in the density (petabyte-level) and breadth (across geo-distributed datacenters) of data distribution. It becomes increasingly challenging but imperative to minimize the response times of data analytic queries over multiple geo-distributed datacenters. However, existing scheduling-based solutions have largely been motivated by pre-established mantras (e.g., bandwidth scarcity). Without data-driven insights into performance bottlenecks at runtime, schedulers might blindly assign tasks to workers that are suffering from unidentified bottlenecks. In this paper, we present Lube, a system framework that minimizes query response times by detecting and mitigating bottlenecks at runtime. Lube monitors geo-distributed data analytic queries in real-time, detects potential bottlenecks, and mitigates them with a bottleneck-aware scheduling policy. Our preliminary experiments on a real-world prototype across Amazon EC2 regions have shown that Lube can detect bottlenecks with over 90 percent accuracy, and reduce the median query response time by up to 33 percent compared to Spark's built-in locality-based scheduler.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "155-166", "volume": "7"}, "authors": [{"authorId": "39483391", "name": "Hao Wang"}, {"authorId": "91269142", "name": "Baochun Li"}], "citations": [{"paperId": "2ecde21d3d17383dcd826d954f18dabcbad65eed", "title": "A Sketch Framework for Fast, Accurate and Fine-Grained Analysis of Application Traffic"}, {"paperId": "af1b75d0c773d642122184675565b1d45cf95fdd", "title": "Data Analytic for Healthcare Cyber Physical System"}, {"paperId": "393a02cd0d8cfb0f0a2ae26df71d0316d482beee", "title": "Geo-Distributed IoT Data Analytics With Deadline Constraints Across Network Edge"}, {"paperId": "b519498bfc1aa85510b2bb09cfc53f9330338b10", "title": "SDTP: Accelerating Wide-Area Data Analytics With Simultaneous Data Transfer and Processing"}, {"paperId": "324fc5af1050b34ebddd7b1c9ca23ebfa35fe51a", "title": "Exploiting multiple levels of parallelism of Convergent Cross Mapping"}, {"paperId": "ae1eb998779821e59ede9d554d786ec273afb076", "title": "Supporting Video Queries on Zero-Streaming Cameras"}]}
