{"paperId": "18dc90083ef0836848bf1cab793f5d8863a1e835", "publicationVenue": {"id": "42ba2c5a-a60c-4306-988d-ff0928f95afa", "name": "International Conference on Generative Programming: Concepts and Experiences", "type": "conference", "alternate_names": ["Generative Programming and Component Engineering", "Gener Program Compon Eng", "GPCE", "Int Conf Gener Program Concept Exp"], "url": "https://dl.acm.org/conference/gpce"}, "title": "Language-Integrated Query for Temporal Data", "abstract": "Modern applications often manage time-varying data. Despite decades of research on temporal databases, which culminated in the addition of temporal data operations into the SQL:2011 standard, temporal data query and manipulation operations are unavailable in most mainstream database management systems, leaving developers with the unenviable task of implementing such functionality from scratch. In this paper, we extend language-integrated query to support writing temporal queries and updates in a uniform host language, with the language performing the required rewriting to emulate temporal capabilities automatically on any standard relational database. We introduce two core languages, λTLINQ and λVLINQ, for manipulating transaction time and valid time data respectively, and formalise existing implementation strategies by giving provably correct semantics-preserving translations into a non-temporal core language, λLINQ. We show how existing work on query normalisation supports a surprisingly simple implementation strategy for sequenced joins. We implement our approach in the Links programming language, and describe a non-trivial case study based on curating COVID-19 statistics.", "venue": "International Conference on Generative Programming: Concepts and Experiences", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-10-21", "journal": {"name": "Proceedings of the 21st ACM SIGPLAN International Conference on Generative Programming: Concepts and Experiences"}, "authors": [{"authorId": "46953264", "name": "S. Fowler"}, {"authorId": "1728168", "name": "Vashti Galpin"}, {"authorId": "144320476", "name": "J. Cheney"}], "citations": [{"paperId": "c326cbdcffc17080b5e243b42477aa8acad34363", "title": "Design of a Smart Cabin Lighting System Based on Internet of Things"}, {"paperId": "0493410b8ec35c4d036bfc61775e6405375547b1", "title": "Edinburgh Research Explorer Language-Integrated Query for Temporal Data"}]}
