{"paperId": "18dee2e2f85bf4758b2e773f436bccffcc167eeb", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "A New Image Reconstruction Algorithm for CCERT Based on Improved DPC and K-Means", "abstract": "Based on density peaks clustering (DPC) and K-means, this work aims to propose a new image reconstruction algorithm for capacitively coupled electrical resistance tomography (CCERT). To better apply DPC and K-means to CCERT, DPC is improved by automatically selecting the cluster centers and K-means is improved by introducing a post-processing in consider of the non-uniform sensitivity characteristic in the sensing area. With the proposed algorithm, linear back projection (LBP) is adopted to obtain the initial image. With the initial image, the improved DPC is adopted to identify the number of targets and get the region of each target. The improved K-means is adopted to determine the gray level threshold in the region of each target according to the distance between the centroid of the target and the center of the pipe. The final image is obtained by gray level threshold filtering. Image reconstruction experiments are carried out by a 12-electrode CCERT system. The experimental results verify the effectiveness of the proposed image reconstruction algorithm. Results also indicate that the improvements of DPC and K-means are successful. Compared with conventional image reconstruction algorithms, the proposed image reconstruction algorithm could get better image reconstruction results with less manual intervention.", "venue": "IEEE Sensors Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-01", "journal": {"name": "IEEE Sensors Journal", "pages": "4476-4485", "volume": "23"}, "authors": [{"authorId": "50219447", "name": "Zheng Wang"}, {"authorId": "31008265", "name": "Yandan Jiang"}, {"authorId": "49024585", "name": "Junchao Huang"}, {"authorId": "1759878", "name": "Baoliang Wang"}, {"authorId": "1797892", "name": "H. Ji"}, {"authorId": "2189696894", "name": "Zhiyao Huang"}], "citations": [{"paperId": "73d61c15a9074eb1d360aa8f11b3bfc113f7fd16", "title": "Imaging of regional lung function by capacitively coupled electrical impedance tomography and image reconstruction using deep neural network"}, {"paperId": "c58d5c9163d7b6c79d480fd737ebdf9f0cd0076e", "title": "A Joint Image Reconstruction Method for Capacitively Coupled Electrical Impedance Tomography"}]}
