{"paperId": "18e09ae5505126f43f1853c60892f29575333b44", "publicationVenue": {"id": "79644985-a91b-42a7-ac72-bb961c283f5e", "name": "IEEE Transactions on Evolutionary Computation", "type": "journal", "alternate_names": ["IEEE Trans Evol Comput"], "issn": "1089-778X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4235", "alternate_urls": ["http://cis.ieee.org/ieee-transactions-on-evolutionary-computation.html", "http://ieee-cis.org/pubs/tec/"]}, "title": "A Review of Population-Based Metaheuristics for Large-Scale Black-Box Global Optimization—Part I", "abstract": "Scalability of optimization algorithms is a major challenge in coping with the ever-growing size of optimization problems in a wide range of application areas from high-dimensional machine learning to complex large-scale engineering problems. The field of large-scale global optimization is concerned with improving the scalability of global optimization algorithms, particularly, population-based metaheuristics. Such metaheuristics have been successfully applied to continuous, discrete, or combinatorial problems ranging from several thousand dimensions to billions of decision variables. In this two-part survey, we review recent studies in the field of large-scale black-box global optimization to help researchers and practitioners gain a bird’s-eye view of the field, learn about its major trends, and the state-of-the-art algorithms. Part I of the series covers two major algorithmic approaches to large-scale global optimization: 1) problem decomposition and 2) memetic algorithms. Part II of the series covers a range of other algorithmic approaches to large-scale global optimization, describes a wide range of problem areas, and finally, touches upon the pitfalls and challenges of current research and identifies several potential areas for future research.", "venue": "IEEE Transactions on Evolutionary Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Transactions on Evolutionary Computation", "pages": "802-822", "volume": "26"}, "authors": [{"authorId": "2636102", "name": "M. Omidvar"}, {"authorId": "2242385479", "name": "Xiaodong Li"}, {"authorId": "2189844706", "name": "Xin Yao"}], "citations": [{"paperId": "367fcd2b70703cba591f21f6336cd6ec624f498f", "title": "Competitive Swarm Optimizer: A decade survey"}, {"paperId": "a9b0b89855c99152d05b0af0cdb49bf30cb73e73", "title": "Multi-objective optimization of syngas production for Fischer-Tropsch synthesis based on biogas catalytic reforming and upgrading"}, {"paperId": "f5c938e1d9ab0243e991322a9f140d8765abb919", "title": "A Knowledge-Based Cooperative Co-Evolutionary Algorithm for Non-Contact Voltage Measurement"}, {"paperId": "5e411d3fc6df7dad09837ed5298afb4a7cf205b8", "title": "A Composite Decomposition Method for Large-Scale Global Optimization"}, {"paperId": "1e95c60d9c8b8550e6a5c950b3c854a33a30b504", "title": "Metaheuristic Optimization Algorithms: an overview"}, {"paperId": "389bc328923aeeb0e1b5ddb97692ecc885bf8133", "title": "Bayesian Optimization that Limits Search Region to Lower Dimensions Utilizing Local GPR"}, {"paperId": "c9dee5822f3b0e95a9721f44c5be308d897e088d", "title": "Contribution-Based Cooperative Co-Evolution With Adaptive Population Diversity for Large-Scale Global Optimization [Research Frontier]"}, {"paperId": "d35f0a1465fb50132a9a50437a3d0251352d6a25", "title": "Learning to Accelerate Evolutionary Search for Large-Scale Multiobjective Optimization"}, {"paperId": "b6ca1f6233b63df59fbb6cd85c31a75ee2afcdb5", "title": "Cooperative coevolutionary differential evolution with linkage measurement minimization for large-scale optimization problems in noisy environments"}, {"paperId": "883ecfc6c27b67087ed66c21b2055b5337fd4f6c", "title": "A dual decomposition strategy for large-scale multiobjective evolutionary optimization"}, {"paperId": "2fd11a99e609e2652540b714ed122baa39c348a7", "title": "A Review of Population-Based Metaheuristics for Large-Scale Black-Box Global Optimization—Part II"}, {"paperId": "e4088afeb185cf38715c3efc3465975e0b6cc4b0", "title": "Coarse-to-fine evolutionary search for large-scale multi-objective optimization: An application to ratio error estimation of voltage transformers"}, {"paperId": "71e875bcdc6600411f30a112c9adecce7777b94a", "title": "IOOA: A multi-strategy fusion improved Osprey Optimization Algorithm for global optimization"}, {"paperId": "9a406e0673b6aa7ca9d14c3f777c72a29ed4816f", "title": "EvoX: A Distributed GPU-accelerated Library towards Scalable Evolutionary Computation"}]}
