{"paperId": "18e100550886ccde8ba0f45c8d513246d7ffaca5", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "SPIDER: An availability‐aware framework for the service function chain placement in distributed scenarios", "abstract": "The network function virtualization (NFV) paradigm replaces hardware‐dependent network functions by virtual network functions (VNFs) that can be deployed in commodity hardware, including legacy servers. Consequently, the use of NFV is expected to reduce operating and capital expenses, as well as improve service deployment operation and management flexibility. For many use cases, the VNFs must be visited and invoked following a specific order of execution in order to compose a complete network service, named service function chain (SFC). Nonetheless, despite the benefits from NFV and SFC virtualization technologies, their introduction must not harm network performance and service availability. On the one hand, redundancy is seen by network service planners as a mechanism well established to combat availability issues. At same time, there is a goal to optimize resource utilization in order to reduce operational expenditure. In this article, we share our experience in the design use of a framework, named SPIDER, focused on SFC placement that considers the network infrastructure condition and the required SFC availability to define the placement strategy. The SPIDER monitors the status of infrastructure nodes and links and defines which servers the VNFs should be placed on and the number of redundant replicas needed. We present a proof‐of‐concept of SPIDER using Kubernetes to launch the VNFs as containers. We also use Kubernetes to forward the traffic between the VNFs, composing the service chain. We perform experiments to evaluate the runtime of SPIDER and the SFC delay under different network conditions.", "venue": "Software, Practice & Experience", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-05", "journal": {"name": "Software: Practice and Experience", "pages": "413 - 437", "volume": "53"}, "authors": [{"authorId": "24302859", "name": "Guto Leoni Santos"}, {"authorId": "1704130", "name": "P. Endo"}, {"authorId": "7286889", "name": "D. Sadok"}, {"authorId": "1745273", "name": "J. Kelner"}], "citations": [{"paperId": "2394061d17244dc9d7e9ff60ca824d270c4bf08f", "title": "Dependability of Network Services in the Context of NFV: A Taxonomy and State of the Art Classification"}, {"paperId": "e112aea752e57caf25f1395fd84efa58fdf94ae9", "title": "Evaluating the Availability of Service Function Chain under Different Elasticity Strategies Based on Colored Petri Net"}, {"paperId": "6480f5286cee93decee66d203b5c000fe5218c28", "title": "EdgeSFG: A matching game mechanism for service function graph deployment in industrial edge computing environment"}]}
