{"paperId": "18f289ec3d154cea55541319756ac3b21c1d66d8", "publicationVenue": {"id": "c43b7adc-9683-46d3-a4a1-f6edfd9695b2", "name": "IEEE Real-Time Systems Symposium", "type": "conference", "alternate_names": ["Real-time Syst Symp", "Real-Time Systems Symposium", "IEEE Real-time Syst Symp", "RTSS"], "url": "http://www.cs.bu.edu/pub/ieee-rts/Home.html"}, "title": "In-ConcReTeS: Interactive Consistency meets Distributed Real-Time Systems, Again!", "abstract": "The problem of replica coordination is fundamental to building Byzantine fault-tolerant (BFT) distributed systems. Seminal BFT architectures for safety-critical real-time systems from the eighties and nineties relied on custom processors and networks, and are hence not readily usable today. Modern-day deployments on cloud platforms do not “scale down” to embedded platforms and are not designed around timeliness. Recent work on real-time BFT protocols focuses on simulations and reliability analyses. In short, there exist no easily programmable BFT libraries that can be conveniently retrofitted onto real-time applications with deadlines and that perform well on embedded platforms. We propose In-ConcReTeS, a BFT key-value store designed for building highly reliable control applications on commodity embedded platforms. At its core, In-ConcReTeS is a real-time friendly redesign and an efficient implementation of a BFT protocol used by seminal fault-tolerant architectures. We evaluated In-ConcReTeS using an inverted pendulum simulation and an automotive benchmark on a cluster of four Raspberry Pis connected over Ethernet. Our results show that, unlike Redis and etcd, In-ConcReTeS can repeatedly synchronize hundreds of key-value pairs, while tolerating faults, every tens of milliseconds.", "venue": "IEEE Real-Time Systems Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE Real-Time Systems Symposium (RTSS)", "pages": "211-224"}, "authors": [{"authorId": "2673657", "name": "A. Gujarati"}, {"authorId": "153223703", "name": "Ningfeng Yang"}, {"authorId": "2110867", "name": "Björn B. Brandenburg"}], "citations": [{"paperId": "447def82d36aa9da2396e3919f54654654221781", "title": "Proximal Byzantine Consensus"}, {"paperId": "09b46e61e2cc44a09eb16956d3345a3100c9323e", "title": "T INY BFT: Byzantine Fault-Tolerant Replication for Highly Resource-Constrained Embedded Systems"}]}
