{"paperId": "18fcd5fab0342263cff293c485aec600e37d7521", "publicationVenue": {"id": "28a83bf1-b6e5-416f-8c5a-fdc53e54f3a1", "name": "International Conference on Automation and Computing", "type": "conference", "alternate_names": ["IEEE International Conference on Autonomic Computing", "IEEE Int Conf Auton Comput", "Int Conf Autom Comput", "ICAC", "International Conference on Autonomic Computing", "Int Conf Auton Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1269", "alternate_urls": ["https://acsos.github.io/"]}, "title": "ExpREsS: EneRgy Efficient Scheduling of Mixed Stream and Batch Processing Workloads", "abstract": "Nowadays we see the wide adoption of novel distributed processing frameworks such as Apache Spark for handling batch and stream processing big data applications. An important aspect that has not been examined in these systems is their energy consumption during the application execution. Reducing the power consumption of modern datacenters is a necessity as datacenters contribute over 2% of the total US electric usage. One way of addressing this energy issue is by scheduling the applications in an energy-efficient way. However, efficiently scheduling applications can be challenging as we need to consider the trade-off between the datacenter's energy usage and per application performance requirements. In this work we propose, ExpREsS, a scheduler for orchestrating the execution of Spark applications so that it both minimizes the energy consumption and satisfies the applications' performance requirements. Our approach exploits time-series prediction models for capturing the applications' energy usage and execution times, and then applies a novel DVFS technique to minimize the energy consumption. Our detailed experimental evaluation using realistic workloads on our local cluster illustrates the working and benefits of our approach.", "venue": "International Conference on Automation and Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 IEEE International Conference on Autonomic Computing (ICAC)", "pages": "27-32"}, "authors": [{"authorId": "8982148", "name": "Stathis Maroulis"}, {"authorId": "2125879", "name": "Nikos Zacheilas"}, {"authorId": "1685532", "name": "V. Kalogeraki"}], "citations": [{"paperId": "e2f2f3fec7ecad567ccb1a4a864a171922496055", "title": "Studying the Energy Consumption of Stream Processing Engines in the Cloud"}, {"paperId": "2776cf55518b51a11ab129660eaab91eb4187837", "title": "Energy Efficient Scheduling for Serverless Systems"}, {"paperId": "5cd843f5f83d5e967aee3265e512bd5623c91c9c", "title": "Tracking the power consumption of concurrent batches in production processes"}, {"paperId": "088d0a45a9458696441f3a32768ae9549246cf3e", "title": "A Holistic Energy-Efficient Real-Time Scheduler for Mixed Stream and Batch Processing Workloads"}, {"paperId": "02bf4a3b6bf7a610a1acf23cdbaba638946316ae", "title": "TS-BatPro: Improving Energy Efficiency in Data Centers by Leveraging Temporal–Spatial Batching"}, {"paperId": "e8e7dfcd894258e903823ef72bc34c307c796f5e", "title": "Resource Management and Scheduling for Big Data Applications in Cloud Computing Environments"}, {"paperId": "fbdcd5b96f03a4d2de9e4059ff50be47c814d43c", "title": "ORiON: Online ResOurce Negotiator for Multiple Big Data Analytics Frameworks"}, {"paperId": "956de39385fec0fec3955f21b6b4a0f082d250e6", "title": "Energy consumption in big data environments – a systematic mapping study"}, {"paperId": "0b56abcc625692db206034ae2883a687c94f4624", "title": "A Regulated Computer Cooling Method: An Eco-Friendly Approach"}, {"paperId": "4b59040a20bee8534e7ce3e98e6f6773b7f7ff46", "title": "On the Fly Load Balancing to Address Hot Topics in Topic-Based Pub/Sub Systems"}, {"paperId": "3c3cc81c9074889eaedd15aa901ff7a55a5cb5c8", "title": "Energy-Aware Cluster Reconfiguration Algorithm for the Big Data Analytics Platform Spark"}, {"paperId": "13d70b5aefaab97fb412674b49b6e40ab5eb286d", "title": "Handbook of Research on Cloud Computing and Big Data Applications in IoT"}]}
