{"paperId": "190d67671ef1882086e03ecd881aca3d716f144f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Harnessing Big Data Analytics for Healthcare: A Comprehensive Review of Frameworks, Implications, Applications, and Impacts", "abstract": "Big Data Analytics (BDA) has garnered significant attention in both academia and industries, particularly in sectors such as healthcare, owing to the exponential growth of data and advancements in technology. The integration of data from diverse sources and the utilization of advanced analytical techniques has the potential to revolutionize healthcare by improving diagnostic accuracy, enabling personalized medicine, and enhancing patient outcomes. In this paper, we aim to provide a comprehensive literature review on the application of big data analytics in healthcare, focusing on its ecosystem, applications, and data sources. To achieve this, an extensive analysis of scientific studies published between 2013 and 2023 was conducted and overall 180 scientific studies were thoroughly evaluated, establishing a strong foundation for future research and identifying collaboration opportunities in the healthcare domain. The study delves into various application areas of BDA in healthcare, highlights successful implementations, and explores their potential to enhance healthcare outcomes while reducing costs. Additionally, it outlines the challenges and limitations associated with BDA in healthcare, discusses modelling tools and techniques, showcases deployed solutions, and presents the advantages of BDA through various real-world use cases. Furthermore, this study identifies and discusses key open research challenges in the field of big data analytics in healthcare, aiming to push the boundaries and contribute to enhanced healthcare outcomes and decision-making processes.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "112891-112928", "volume": "11"}, "authors": [{"authorId": "2258555429", "name": "Awais Ahmed"}, {"authorId": "145086660", "name": "Rui Xi"}, {"authorId": "3355022", "name": "Mengshu Hou"}, {"authorId": "71341163", "name": "Syed Attique Shah"}, {"authorId": "49056545", "name": "S. Hameed"}], "citations": [{"paperId": "830929f7fad3cc1996d7dd107037790eac889ef5", "title": "Efficacy of Machine Learning Techniques in Diagnosing Urinary Tract Infections: A Study Utilizing a Philippine Clinical Dataset"}, {"paperId": "fa4e6691d216858d9f89007d08ceccd78027e849", "title": "A comprehensive review of data analytics in healthcare management: Leveraging big data for decision-making"}, {"paperId": "3fe01cf937b3ee36642e5abc233dc53e9380942f", "title": "A 30-Year Review on Nanocomposites: Comprehensive Bibliometric Insights into Microstructural, Electrical, and Mechanical Properties Assisted by Artificial Intelligence"}, {"paperId": "3c68185557e2c649c7bf4805bad358946f6d11fc", "title": "MED-Prompt: A novel prompt engineering framework for medicine prediction on free-text clinical notes"}, {"paperId": "434d54a265ca84eaa5df0b68c782d3af7885a486", "title": "A computational fractional order model for optimal control of wearable healthcare monitoring devices for maternal health"}, {"paperId": "96edf197349c0000781171b235efb764b42374d0", "title": "Analysis of Publications on Health Information Management Using the Science Mapping Method: A Holistic Perspective"}, {"paperId": "64ae06068a746e9a595d172e819b08f882a1eb35", "title": "OCCNET: Improving Imbalanced Multi-Centred Ovarian Cancer Subtype Classification in Whole Slide Images"}, {"paperId": "3246036c257548c1398c2b27eb4cf472a96bd589", "title": "Diffusion-Enhanced Magnified Histopathological Images for Robust Breast Cancer Classification"}, {"paperId": "a6ab65ceca7fa6b2ac01e1bada5b3ae6969e5758", "title": "Multi-Instance Bias Suppression for Enhanced Generalization in Breast Cancer Diagnosis : Harnessing Histopathological Big Data Insights"}, {"paperId": "cd0188cf0e4776ca0e366fd4384f8bed7b44ddd7", "title": "PLA—A Privacy-Embedded Lightweight and Efficient Automated Breast Cancer Accurate Diagnosis Framework for the Internet of Medical Things"}, {"paperId": "af124c6fb9ba141d71f8ebaa1704119cc9d75529", "title": "Tackling security and privacy challenges in the realm of big data analytics"}]}
