{"paperId": "191e3c2ce3da3277f51213b5137c974e46bd64b2", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "“I Will Not Drink With You Today”: A Topic-Guided Thematic Analysis of Addiction Recovery on Reddit", "abstract": "Recovery from addiction is a journey that requires a lifetime of support from a strong network of peers. Many people seek out this support through online communities, like those on Reddit. However, as these communities developed outside of existing aid groups and medical practice, it is unclear how they enable recovery. Their scale also limits researchers’ ability to engage through traditional qualitative research methods. To study these groups, we performed a topic-guided thematic analysis that used machine-generated topic models to purposively sample from two recovery subreddits: r/stopdrinking and r/OpiatesRecovery. We show that these communities provide access to an experienced and accessible support group whose discussions include consequences, reflections, and celebrations, but that also play a distinct metacommunicative role in supporting formal treatment. We discuss how these communities can act as knowledge sources to improve in-person recovery support and medical practice, and how computational techniques can enable HCI researchers to study communities at scale.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-27", "journal": {"name": "Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "47199688", "name": "R. P. Gauthier"}, {"authorId": "145475756", "name": "M. Costello"}, {"authorId": "2057256778", "name": "James R Wallace"}], "citations": [{"paperId": "c39c21f9cd9a85809cbc0dfc0ed6b004e6c8ef8b", "title": "Understanding Public Perceptions of AI Conversational Agents: A Cross-Cultural Analysis"}, {"paperId": "665645ca6334a404169f02be818206ba96e16319", "title": "Understanding the Language of ADHD and Autism Communities on Social Media"}, {"paperId": "4ab9de9b2f1ccdc3d0461bbe096872aea1ab635d", "title": "Grounded Intuition of GPT-Vision's Abilities with Scientific Images"}, {"paperId": "b077d1c6e8b59f62eea6f3f3136fca5c0cdc3e76", "title": "Characterizing online social support for alcohol use disorder: A mixed-methods approach."}, {"paperId": "855b948f60c1d541457a744c11b96bcf252d1ea9", "title": "Instagram sober journeys: How relapse narratives and viewing orders influence audience response on social media"}, {"paperId": "10e2cf4d3f70255f2ac4f4a3c2057b699c5fda87", "title": "Technology-Mediated Strategies for Coping with Mental Health Challenges: Insights from People with Bipolar Disorder"}, {"paperId": "d44b341013df36d6c420a3964ec3536f896cad58", "title": "\"Always Nice and Confident, Sometimes wrong\": Developer's Experiences Engaging Generative AI Chatbots Versus Human-Powered Q&A Platforms"}, {"paperId": "9c3cb014dbbd234fa9492f3b721c39ebb10c49d5", "title": "AI said, She said - How Users Perceive Consumer Scoring in Practice"}, {"paperId": "4686ebbdcf782cdf7f7a8b853372cbea559fa292", "title": "Peer Surveillance in Online Communities"}, {"paperId": "9c34bb1107920bc09f56a155dfec72c08927b1e6", "title": "Sharing Play Spaces: Design Lessons from Reddit Posts Showing Virtual Reality in the Home"}, {"paperId": "1d3de44f28fe4231dc9748363bc6a88bf9af43fe", "title": "Uncovering Gig Worker-Centered Design Opportunities in Food Delivery Work"}, {"paperId": "56d873109fc546dbef4336fdfa644d076cd85de0", "title": "The Age of Snippet Programming: Toward Understanding Developer Communities in Stack Overflow and Reddit"}, {"paperId": "8c32d0ec3dccd531b737f172f6f94fda00dfd05d", "title": "Point of no Undo: Irreversible Interactions as a Design Strategy"}, {"paperId": "2f55368eb4d48c88c80397f0dc5f63c7ed4013eb", "title": "Agency and Amplification"}, {"paperId": "537bbb47229cb711f9fdf03365d15dba9329887c", "title": "Tumblr is Queer and Twitter is Toxic: Speculating About the Vibe of Social Media Spaces"}, {"paperId": "badb4c531d7957bd77f822a5e058215f049c07ea", "title": "Designing Technologies for Self-care: Describing the Lived Experiences of Individuals with Rheumatoid Arthritis"}]}
