{"paperId": "192363c00a3266f96e2a6bedba8075daa3b0729b", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Big Data and the Ethical Implications of Data Privacy in Higher Education Research", "abstract": "Despite the claimed worth and huge interest regarding the increasing volumes of complex data sets and the rewarding promise to improve research, there is, however, a growing concern regarding data privacy that affects both qualitative and quantitative higher education research. Within the contemporary debates on the impact of Big Data on the nature of higher education research and the effective ways to harmonize Big Data practice with privacy restrictions and regulations, this study sets out to qualitatively examine current issues regarding data privacy, anonymity, informed consent and confidentiality in data-centric higher education research, with a focus on the data collector, data subject and data user. We argue that within current regulations, data protection of research subjects concerns more data collection and disclosure and insufficiently describes use, having procedural implications for both the complex nature of higher education (HE) research and the type of research data being collected. We work our argument through an examination of several factors that call for a reconsideration of data privacy and access to private information in HE research. The conclusions indicate that Big Data-centric HE research is increasingly becoming a mainstream research paradigm which needs to address critical data privacy issues before being widely embraced.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2020-10-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "153270373", "name": "Diana Florea"}, {"authorId": "118174866", "name": "S. Florea"}], "citations": [{"paperId": "c4b838130d140e641115fe0c8f5105f08878c384", "title": "Data sharing and big data in health professions education: Ottawa consensus statement and recommendations for scholarship."}, {"paperId": "20a6b93b0b542d2f6b707f6829713155683a041c", "title": "La perspectiva ética en la literatura científica relacionada con datificación educativa: una revisión sistemática"}, {"paperId": "8fb1045c53f46b3a9c754d76a307f861a6052dbc", "title": "The Impact of the Big Ideology Program on the Construction of Academic Ethos in Colleges and Universities in the Context of Three-Whole Parenting"}, {"paperId": "26088629d6d6ce61e86f61d8b706ecfb0974073a", "title": "Big Data Analytics Artefact for Outcome-Based Funding Prediction in South African Public Universities"}, {"paperId": "12df7a311ba2df1057024cab2bfbb0c5cfb8a2cc", "title": "Study on the optimization of the cultivation path of finance professionals in universities in the digital era"}, {"paperId": "dbfb2613900a6c7490e9a888cb4c56067956b366", "title": "A Journey through the Potential of Research to Drive Innovation in University Education"}, {"paperId": "54cb2ca4f41fe056bdd517d783f347832f211b34", "title": "Technology integration in higher education and student privacy beyond learning environments - A comparison of the UK and US perspective"}, {"paperId": "97d8be9c22d9bc76b5febbd989a7b48ecb951b81", "title": "Empowering Education through Generative AI: Innovative Instructional Strategies for Tomorrow's Learners"}, {"paperId": "803107082de529a87048b94a184acaee35b48b89", "title": "Inter-institutional data-driven education research: consensus values, principles, and recommendations to guide the ethical sharing of administrative education data in the Canadian medical education research context"}, {"paperId": "092fa6222868c13620af9cd527b30ecdff713a7d", "title": "Analysis of the innovation path of university education management informatization in the era of big data"}, {"paperId": "f51020d1ce9add8ddaca488f246f494423da0e7d", "title": "Do sentiments of professors feedback change after migrating from in-person to online modalities? Pre- and during COVID-19 experience"}, {"paperId": "7ce2bd2fd3e71fafcdabe1c2b8cdf577e3a700f8", "title": "Privacy Prevention of Big Data Applications: A Systematic Literature Review"}, {"paperId": "1b4c1b001c5f1d94f8deb4d1956b04eda57d480c", "title": "The “Socialized Architecture”: A Software Engineering Approach for a New Cloud"}, {"paperId": "e456a6286e524cd80236fb718dee3516634437d5", "title": "Higher education and science popularization: Can they achieve coordinated growth?"}, {"paperId": "20cacdba967a744042e458d62e72b15b2fa3fb25", "title": "Data Usage and the Legal Stability of Transactions for the Commercial Operation of Autonomous Vessels Based on Digital Ownership in Korean Civil Law"}, {"paperId": "5edd358d76ab7a603d8fe62746c288ae68639f71", "title": "Elevating Big Data Privacy: Innovative Strategies and Challenges in Data Abundance"}]}
