{"paperId": "19242eb5bb8868c1583070d792349af64778e334", "publicationVenue": {"id": "56f89c7f-077a-4930-b790-aa1370ffb586", "name": "Herald of the Bauman Moscow State Technical University Series Instrument Engineering", "alternate_names": ["Her Bauman Mosc State Tech Univ Ser Instrum Eng"], "issn": "0236-3933", "url": "http://vestnikprib.ru/"}, "title": "Hybrid Evolutionary Algorithm for Solving the Large-Scale Global Optimization Problems", "abstract": "When solving applied problems in various areas of human activity, the need appears to find the best set of parameters according to the given criterion. Usually such a problem is being formulated as a parametric optimization problem. The paper considers optimization problems represented by the black-box model. As such problems dimension grows, it becomes difficult to find a satisfactory solution for many traditional optimization approaches even with a significant increase in the number of objective function calculations. A new hybrid evolutionary method in coordinating the self-adjusting coevolution algorithms with the COSACC-LS1 local search is proposed to solve the problems of global material optimization of the extra-large dimension. COSACC-LS1 is based on the idea of the computing resources automatic allocation between a group of self-tuning differential evolution algorithms based on coevolution and local search algorithm. Effectiveness of the proposed algorithm was evaluated on 15 reference test problems from the LSGO CE 2013 set. Results of the COSACC-LS1-based algorithm were compared with a number of modern metaheuristic algorithms that were designed specifically for solving the very large-scale optimization problems and were the winners and prize-winners in the optimization competitions conducted within the framework of the IEEE CEC. With the help of numerical experiments, it is demonstrated that the proposed algorithm is better than most other popular algorithms according to the average accuracy criterion of the solution found", "venue": "Herald of the Bauman Moscow State Technical University Series Instrument Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Herald of the Bauman Moscow State Technical University. Series Instrument Engineering"}, "authors": [{"authorId": "2045772442", "name": "A. Vakhnin"}, {"authorId": "2915516", "name": "E. Sopov"}, {"authorId": "2198431484", "name": "M.A. Rurich"}], "citations": []}
