{"paperId": "192a606fab027fb53cb895e441256d667aabd6b4", "publicationVenue": null, "title": "Concepts, Analysis, Issues of smartphone and Smart devices: A survey", "abstract": "Smart phone may well be a transportable that provides advanced technologies with usefulness similar as a nonpublic portable computer. The smartphones is a tremendous technology that has transformed our world in variety of different ways .In has exploded onto mainstream market and has become a part of popular culture. It has revolutionized the motions of communication between people and allows access of information in the palms of our hands. Smart phones and smart devices have made a development in industry. When the smartphone and smart device is produced the terminology of production is being handled with both efficiency and master mind but still it gives the problems which cannot be easily handled but the solution of solving these problems are being modified in respected manner The concluded the problems arises every day and every problem now has the solution and other phones which being developed has the convenient way of that problem. The future use of these smartphone and smart devices can be seen in 2020 we can surely see that most reliable way of handling phones can be measured and about 2030. we will be having robots doing future work but technology is going vast and meeting every customer needs .The opportunities for the future of a smartphone are endless. It will only take time to see which of these innovations will be part of our everyday lives", "venue": "2020 3rd International Conference on Computing, Mathematics and Engineering Technologies (iCoMET)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-01-01", "journal": {"name": "2020 3rd International Conference on Computing, Mathematics and Engineering Technologies (iCoMET)", "pages": "1-8"}, "authors": [{"authorId": "3134489", "name": "I. Memon"}, {"authorId": "2066125415", "name": "Qasim Ali"}, {"authorId": "1580616570", "name": "Hadiqua Fazal"}, {"authorId": "7829391", "name": "Asma Zubedi"}, {"authorId": "1500653605", "name": "Sunbul Sajid Khuwaja"}], "citations": [{"paperId": "394206dd1891128bcee96a3d32efca1861fda918", "title": "Enhanced peer-to-peer anonymity approach for privacy preserving in location-based services"}]}
