{"paperId": "193295e8f165179b4b9208dcc2fa1c128eb32fda", "publicationVenue": {"id": "e7c3aea1-83fc-4ada-9c71-1d6e1c527da8", "name": "British Journal of Nutrition", "type": "journal", "alternate_names": ["Br J Nutr"], "issn": "0007-1145", "url": "https://www.cambridge.org/core/journals/british-journal-of-nutrition", "alternate_urls": ["http://journals.cambridge.org/action/displayJournal?jid=BJN"]}, "title": "Meal-specific dietary patterns and their contribution to habitual dietary patterns in the Iranian population", "abstract": "Abstract Recent studies have focused on habitual intake without addressing meal-specific intakes. We aimed to identify meal-specific dietary patterns and their contribution to habitual dietary patterns. This cross-sectional study was conducted on 838 adults, both sexes who attended the health centres in Tehran. Dietary data were recorded by three 24-h dietary recalls (24hDR). Dietary patterns were identified by using principal component analysis on meal-specific and overall food intakes. Intraclass correlation (ICC) was used as a measurement of consistency across meals and days. Correlation analysis and linear regression (partial R 2) were used for meals contribution. Four habitual dietary patterns were derived from average dietary intake of 3-d 24hDR labelled as ‘Western’, ‘Healthy’, ‘Traditional’ and ‘Legume and broth’. Also, we identified two major dietary patterns on each meal level (factor 1 and 2 for breakfast, lunch, afternoon snack and dinner). The highest contribution of energy intake was observed in lunch (25·7 %), followed by dinner (20·81 %). Consistency of food groups was the highest across days (ICC tea = 0·58) and breakfasts (ICC tea = 0·60). Dinner had a strong correlation coefficient with the ‘Western’ habitual dietary pattern then followed by lunch. Similarly, dinner and lunch contributed the most (r and partial R 2) to the ‘Western’ habitual dietary pattern. Our results suggest that habitual dietary patterns to several extents are formed at meal levels, and dinner has a greater contribution to the habitual dietary patterns in Iranian people. This may help planning for local dietary guidelines according to the time of eating to promote public health.", "venue": "British Journal of Nutrition", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-11", "journal": {"name": "British Journal of Nutrition", "pages": "262 - 271", "volume": "129"}, "authors": [{"authorId": "11171473", "name": "Azadeh Lesani"}, {"authorId": "4507367", "name": "K. Djafarian"}, {"authorId": "87822184", "name": "Zahra Akbarzade"}, {"authorId": "2026056497", "name": "Nasim Janbozorgi"}, {"authorId": "2134679742", "name": "Sakineh Shab-Bidar"}], "citations": [{"paperId": "212d1959629bdf98e1fb2eb641e50c3cf5ee09bb", "title": "Meal-specific dietary patterns and biomarkers of insulin resistance in a sample of Iranian adults: a cross-sectional study"}, {"paperId": "50adde6b2d520872ccdd811e0f50318bd8ba9817", "title": "Saturated fats network identified using Gaussian graphical models is associated with metabolic syndrome in a sample of Iranian adults"}]}
