{"paperId": "19417be675962ee26eadfb6e7c57f75588e62c46", "publicationVenue": null, "title": "Enhancing Big Data Analysis by using Map-reduce Technique", "abstract": "Normal 0 false false false MS X-NONE X-NONE Database is defined as a set of data that is organized and distributed in a manner that permits the user to access the data being stored in an easy and more convenient manner. However, in the era of big-data the traditional methods of data analytics may not be able to manage and process the large amount of data. In order to develop an efficient way of handling big-data, this work enhances the use of Map-Reduce technique to handle big-data distributed on the cloud. This approach was evaluated using Hadoop server and applied on Electroencephalogram (EEG) Big-data as a case study. The proposed approach showed clear enhancement on managing and processing the EEG Big-data with average of 50% reduction on response time. The obtained results provide EEG researchers and specialist with an easy and fast method of handling the EEG big data.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-03-01", "journal": {"name": "Bulletin of Electrical Engineering and Informatics", "pages": "113-116", "volume": "7"}, "authors": [{"authorId": "144299700", "name": "Alaa H. Alhamami"}, {"authorId": "1395011574", "name": "Ali Adel Flayyih"}], "citations": [{"paperId": "0c1a10365de440547c7ec9566a6608546a380ec5", "title": "Transforming data-centric eXtensible markup language into relational databases using hybrid approach"}, {"paperId": "4f74edf79b4a1b7a641671863635ae79ed1d49a2", "title": "Multi-dimensional cubic symmetric block cipher algorithm for encrypting big data"}, {"paperId": "4ec8e399845f4c778b445bede0f29c30ff3bf91b", "title": "Data mining in web personalization using the blended deep learning model"}, {"paperId": "a749af20bd0f2271eab3f7f6fd96373e638d174e", "title": "An overview of big data analysis"}, {"paperId": "3837ce32099e5295ae3346f302e33f10e7dce790", "title": "Discovering rules for nursery students using apriori algorithm"}, {"paperId": "6d7d3159afb647bb36e8229e88998c37f18544c6", "title": "Querying massive RDF data using Spark"}, {"paperId": "12170229d94d97b0faf3203e22aa3116d5cb580f", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
