{"paperId": "19486c9c7b9c33682524130be23eb0c7825cba91", "publicationVenue": {"id": "eec60769-4238-493f-94a7-aef2343f1137", "name": "Aerospace", "alternate_names": ["Aerospace"], "issn": "0001-9321"}, "title": "Autonomous Task Planning Method for Multi-Satellite System Based on a Hybrid Genetic Algorithm", "abstract": "The increasing number of satellites for specific space tasks makes it difficult for traditional satellite task planning that relies on ground station planning and on-board execution to fully exploit the overall effectiveness of satellites. Meanwhile, the complex and changeable environment in space also poses challenges to the management of multi-satellite systems (MSS). To address the above issues, this paper formulates a mixed integer optimization problem to solve the autonomous task planning for MSS. First, we constructed a multi-agent-based on-board autonomous management and multi-satellite collaboration architecture. Based on this architecture, we propose a hybrid genetic algorithm with simulated annealing (H-GASA) to solve the multi-satellite cooperative autonomous task planning (MSCATP). With the H-GASA, a heuristic task scheduling scheme was developed to deal with possible task conflicts in MSCATP. Finally, a simulation scenario was established to validate our proposed H-GASA, which exhibits a superior performance in terms of computational power and success rate compared to existing algorithms.", "venue": "Aerospace", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-10", "journal": {"name": "Aerospace"}, "authors": [{"authorId": "2107868585", "name": "Jun Long"}, {"authorId": "2112380388", "name": "Shimin Wu"}, {"authorId": "2118232369", "name": "Xiaodong Han"}, {"authorId": "2107940678", "name": "Yunbo Wang"}, {"authorId": "2109337923", "name": "Limin Liu"}], "citations": [{"paperId": "60a4fee92074c9a1cc57f2d623c1fb377e4b2ba8", "title": "Learning-based constellation scheduling for time-sensitive space multi-target collaborative observation"}, {"paperId": "a228f1e65b504fa436a428eeac5bb2040e8e2f82", "title": "Neuro-Evolutionary Framework for Design Optimization of Two-Phase Transducer with Genetic Algorithms"}, {"paperId": "eed98a4f7ca482cb6c2de8817897521bfbccd7c7", "title": "Large-Scale Multi-Objective Imaging Satellite Task Planning Algorithm for Vast Area Mapping"}, {"paperId": "21ceb1270b2c1bd147a14e2b536cb31e9832c92b", "title": "Application of smart grid and non-dominated sorting genetic algorithm in adaptive energy-saving control of building lighting"}, {"paperId": "2ec22ca91913f95fe0f962c4c492b0f00d722828", "title": "A Hybrid Local Replanning Strategy for Multi-Satellite Imaging Mission Planning in Uncertain Environments"}]}
