{"paperId": "1950fc0cfba0f777e7c310716a5f9ee39f901905", "publicationVenue": null, "title": "Controlled Intentional Degradation in Analytical Video Systems", "abstract": "It is increasingly affordable for governments to collect video data of public locations. This video can be used for a range of broadly valuable analytical tasks, such as counting traffic, measuring commerce, or detecting accidents. Governments also have a range of policy goals --- preserving privacy, reducing bandwidth use, and legal compliance --- that may be obtained by degrading the video at some potential cost to analytical accuracy. Ideally, public administrators could employ controlled intentional video degradation to achieve policy goals while still obtaining the required analytical accuracy. Unfortunately, the optimal amount of induced degradation is data- and query-dependent, and so is difficult to determine even when public policy preferences are well-known. We propose a video degradation-accuracy profiling model for the problem of controlling the appropriate amount of degradation. It offers administrators a profile that illustrates the tradeoff between increased analytical accuracy and increased amounts of degradation. Computing the true tradeoff curves requires full access to the non-degraded video stream, so a primary technical contribution of this work lies in methods for accurately approximating the curves with only limited information. In addition, we propose a profile repair policy to further improve tradeoff curves' accuracy. We describe our prototype system, Smokescreen, plus experiments on two video datasets, two detection models and four aggregate query types. Compared with competing methods, we show our upper bound estimation of analytical error is up to 155% tighter, and Smokescreen enables 88% more accurate tradeoffs.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "22962531", "name": "Wenjia He"}, {"authorId": "1725561", "name": "Michael J. Cafarella"}], "citations": [{"paperId": "70e3fac68959e2175184bdc60e2986cf47df0071", "title": "EQUI-VOCAL: Synthesizing Queries for Compositional Video Events from Limited User Interactions"}, {"paperId": "e28d56a1c489cb820117d9f4303b4151d268a987", "title": "Reproducibility Report for ACM SIGMOD 2022 Paper: “Controlled Intentional Degradation in Analytical Video Systems”"}]}
