{"paperId": "19659d0297c50c9d43c31fe4bbd4a0c6e3b9c08d", "publicationVenue": {"id": "b9f85c9d-5b12-4fa5-b40d-44c77eda3c06", "name": "Journal of Vacation Marketing", "type": "journal", "alternate_names": ["J Vacat Mark"], "issn": "1356-7667", "url": "http://www.sagepub.com/journals/Journal201732/title", "alternate_urls": ["https://journals.sagepub.com/home/jvm", "http://jvm.sagepub.com/"]}, "title": "K-Means segmentation of tourism accommodation based on the active use of websites: Its application to an emerging destination (extremadura, Spain)", "abstract": "The management, maintenance and positioning of a website as a tool for information, promotion and marketing are necessary requirements for the regulated tourist accommodation of today. However, modern websites must go much further as they must also take into account the demands and needs of the 3.0 tourist Websites must therefore be operational (direct bookings, fast loading, adapted to mobile devices, …), informative (before, during and after the trip) and interactive (comments, evaluation of the experience, …). The aim of this study is to analyse the state of development of websites of tourist accommodation at a destination, the Spanish region of Extremadura, which aims to keep up with this technological revolution. To this end, a questionnaire was used to find out the characteristics of the websites (if they exist) of the entire population of “regulated” tourist accommodation in the region (1748 establishments). Based on the items included in this questionnaire and working exclusively with the subpopulation of accommodation with a website, three dimensions of evaluation of these websites were constructed: operability, informative capacity, and interaction. These three dimensions were used as segmentation variables to define a total of four clearly different groups or clusters of websites. The results obtained, using a k-means algorithm, confirm that tourist accommodation establishments in Extremadura have a lot of work to do if they are to increase the usefulness of their websites.", "venue": "Journal of Vacation Marketing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-09", "journal": {"name": "Journal of Vacation Marketing", "pages": "654 - 669", "volume": "29"}, "authors": [{"authorId": "1422162919", "name": "M. Sánchez-Rivero"}, {"authorId": "1965906153", "name": "M. C. Rodríguez-Rangel"}, {"authorId": "1418803134", "name": "Alejandro Ricci-Risquete"}], "citations": [{"paperId": "acba12c834deb8fdb14139277c92fef0b471a1a1", "title": "ANÁLISIS DEL GRADO DE MADUREZ DE SITIOS WEBS: APLICACIÓN A LAS CADENAS HOTELERAS"}, {"paperId": "c49028a733eba0fc982208cb77cdd5f055ff5d4e", "title": "Addressing regional tourism policy: Tools for sustainable destination management"}]}
