{"paperId": "1966a4151679e218698c861ca76423bbfc389129", "publicationVenue": {"id": "5d2ac1a1-1fcd-4505-8b9d-5484ad5ffa66", "name": "Journal of King Saud University: Computer and Information Sciences", "type": "journal", "alternate_names": ["Journal of King Saud University - Computer and Information Sciences", "J King Saud Univ Comput Inf Sci", "J King Saud Univ  Comput Inf Sci"], "issn": "1319-1578", "url": "https://www.journals.elsevier.com/journal-of-king-saud-university-computer-and-information-sciences/", "alternate_urls": ["http://www.sciencedirect.com/science/journal/13191578"]}, "title": "A dynamic planning model for deploying service functions chain in fog-cloud computing", "abstract": null, "venue": "Journal of King Saud University: Computer and Information Sciences", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "J. King Saud Univ. Comput. Inf. Sci.", "pages": "7948-7960", "volume": "34"}, "authors": [{"authorId": "3173772", "name": "Yongheng Zhang"}, {"authorId": "2158119772", "name": "Feng Zhang"}, {"authorId": "120794316", "name": "S. Tong"}, {"authorId": "2273333995", "name": "Amin Rezaeipanah"}], "citations": [{"paperId": "a91fa0a1957a7dc92dd130e432023fc37f2de16f", "title": "An Efficient and Autonomous Planning Scheme for Deploying IoT Services in Fog Computing: A Metaheuristic-Based Approach"}, {"paperId": "7707e73c9b96eaecebdcef99472ff0b2f2bf8533", "title": "A decision-making mechanism for task offloading using learning automata and deep learning in mobile edge networks"}, {"paperId": "e5e4f916b41bb92318ce89f6ffb708437c2bebe8", "title": "DCSP: A Delay and cost-aware service placement and load distribution algorithm for IoT-based fog networks"}, {"paperId": "dbe3043600cec518520ace04d25d33065169aa43", "title": "Dynamic service function chains placement based on parallelized requests in edge computing environment"}, {"paperId": "b700f0d6ec658fd6ad4b28a6a42d5af76dd05ca9", "title": "Dynamic IoT service placement based on shared parallel architecture in fog-cloud computing"}, {"paperId": "8bdb818e443fedcbb2c7ef8dac0d32b26e6cc898", "title": "DRL-based routing algorithm with guaranteed loss, latency and bandwidth in SDN networks: Application of online video conferencing"}, {"paperId": "2d01d61a27d7e3b0f119323cc840841b3aec6528", "title": "An intelligent fuzzy-based routing algorithm for video conferencing service provisioning in software defined networking"}, {"paperId": "0973727ed7eda64405b1bbff1852c5808c7c98ec", "title": "Towards an automatic deployment model of IoT services in Fog computing using an adaptive differential evolution algorithm"}, {"paperId": "de08de8de4e95ed9887a8b1a1225a23c5a691447", "title": "LPB-SPP: Solving the internet of things service placement problem using the learner performance-based behavior algorithm"}, {"paperId": "aea293a39b90ff25cfd8abd3b8e473cd130c55f7", "title": "Dynamic SFC placement with parallelized VNFs in Data Center Networks: A DRL-based approach"}, {"paperId": "2dd3d1f90419e66642806865174e7db89bce8c45", "title": "Towards deploying SFC with parallelized VNFs under resource demand uncertainty in mobile edge computing"}, {"paperId": "0f16b4c6df1b5ebfd521ccf0f879e962bec5dfec", "title": "Service Function Chain Scheduling Method for Power Wide Coverage 5G Multi-link Converged Networks"}, {"paperId": "c0a7fa472bc96856b85251c3cda91d3870702881", "title": "Multi-level Intelligent Collaborative Computing Mechanism Based on DDQN for Smart Highways"}, {"paperId": "ab9276b62898fed8fb6ea8843050d96f984603ee", "title": "Dynamic SFC placement scheme with parallelized SFCs and reuse of initialized VNFs: An A3C-based DRL approach"}, {"paperId": "c4b97ae3fabc8fe5912a35f59869d006923a4b8c", "title": "VMP-A3C: Virtual machines placement in cloud computing based on asynchronous advantage actor-critic algorithm"}, {"paperId": "c6273f6fd60c8180b4b2dd6a47d745d22720b6ed", "title": "An autonomous planning model for solving IoT service placement problem using the imperialist competitive algorithm"}, {"paperId": "b512d44ba3bbe2c71727db0e0f59768f4dfa5b64", "title": "Improving Dynamic Placement of Virtual Machines in Cloud Data Centers Based on Open-Source Development Model Algorithm"}, {"paperId": "5adadff4ae1eaad2f2f5f081583e400c483b4e0d", "title": "An efficient and autonomous scheme for solving IoT service placement problem using the improved Archimedes optimization algorithm"}, {"paperId": "cac66a083772b6ae12df424f12744918955661c4", "title": "DSPPV: Dynamic service function chains placement with parallelized virtual network functions in mobile edge computing"}, {"paperId": "0c901df9c680d85f0597758afe5d99cbbbb50467", "title": "A Fuzzy Based Routing Approach for Improving Online Conferencing Services in Software Defined Networking"}, {"paperId": "a07acae6b1aa32a167cf6c9c8d177d455cb7c22b", "title": "Towards distributed and autonomous IoT service placement in fog computing using asynchronous advantage actor-critic algorithm"}, {"paperId": "ba95175f575c93300f031740f6c50a10b9d4649d", "title": "IPORM: A Resource Management Scheme for Fog-Enabled Cloud Environments: An Improved Political Optimizer-Based Approach"}, {"paperId": "a2802853327933e6b3966f8782006f9b4a85c2e9", "title": "Dynamic service function chain placement with instance reuse in Fog-Cloud​ Computing"}, {"paperId": "f63d740ad413287a2110ade85ab77c8168cbf017", "title": "Task offloading using GPU-based particle swarm optimization for high-performance vehicular edge computing"}, {"paperId": "7acea247f1cdd7e33bfcc96ce8252993042fbca7", "title": "Distributed IoT services placement in fog environment using optimization-based evolutionary approaches"}, {"paperId": "b5bfb37ed9be29d5921721f2057aded2506ebe68", "title": "Deadline and Energy-Aware Application Module Placement in Fog-Cloud Systems"}]}
