{"paperId": "198488e019579a9a6c73dc83938d97a2f60f9e38", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "The role of the Big Geographic Sort in the circulation of misinformation among U.S. Reddit users", "abstract": "Past research has attributed the online circulation of misinformation to two main factors - individual characteristics (e.g., a person’s information literacy) and social media effects (e.g., algorithm-mediated information diffusion) - and has overlooked a third one: the critical mass created by the ofﬂine self-segregation of Americans into like-minded geographical regions such as states (a phenomenon called ‘The Big Sort’). We hypothesized that this latter factor matters for the online spreading of misinformation not least because online interactions, despite having the potential of being global, end up being localized: interaction probability is known to rapidly decay with distance. Upon analysis of more than 8M Reddit comments containing news links spanning four years, from January 2016 to December 2019, we found that Reddit did not work as an ‘hype machine’ for misinformation (as opposed to what previous work reported for other platforms, circulation was not mainly caused by platform-facilitated network effects) but worked as a supply-and-demand system: misinformation news items scaled linearly with the number of users in each state (with a scaling exponent β ≈ 1 , and a goodness of ﬁt R 2 ≈ 0 . 95 ). Furthermore, deviations from such a universal pattern were best explained by state-level personality and cultural factors ( R 2 ≈ { 0 . 12 , 0 . 39 } ), rather than socioeconomic conditions ( R 2 ≈ { 0 . 15 , 0 . 29 } ) or, as one would expect, political characteristics ( R 2 ≈ { 0 . 06 , 0 . 21 } ). Higher-than-expected circulation of any type of news (including reputable news) was found in states characterised by residents who tend to be less diligent in terms of their personality (low in conscientiousness) and by loose cultures understating the importance of adherence to norms (low in cultural tightness). Interestingly, the combination of those factors with low levels of education was then associated with the particular circulation of misinformation. These results suggest that online interactions are geographically bounded and, as such, circulation of misinformation cannot be studied purely as an Internet phenomenon but should be grounded into a user’s ofﬂine cultural environment, which has become increasingly segregated over the decades, and is admittedly hard to change.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-20", "journal": {"name": "ArXiv", "volume": "abs/2205.10161"}, "authors": [{"authorId": "10726253", "name": "Lia Bozarth"}, {"authorId": "144041798", "name": "D. Quercia"}, {"authorId": "47809306", "name": "L. Capra"}, {"authorId": "2899841", "name": "S. Šćepanović"}], "citations": []}
