{"paperId": "1995aa999d5e320eeb49d542e883821a1471d2b5", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Resource Management in Cloud and Cloud-influenced Technologies for Internet of Things Applications", "abstract": "The trend of adopting Internet of Things (IoT) in healthcare, smart cities, Industry 4.0, and so on is increasing by means of cloud computing, which provides on-demand storage and computation facilities over the Internet. To meet specific requirements of IoT applications, the cloud has also shifted its service offering platform to its next-generation models, such as fog, mist, and dew computing. As a result, the cloud and IoT have become part and parcel of smart applications that play significant roles in improving the quality of human life. In addition to the inherent advantages of advanced cloud models, to improve the performance of IoT applications further, it is essential to understand how the resources in the cloud and cloud-influenced platforms are managed to support various phases in the end-to-end IoT deployment. Considering this importance, in this article, we provide a brief description, a systematic review, and possible research directions on every aspect of resource management tasks, such as workload modeling, resource provisioning, workload scheduling, resource allocation, load balancing, energy management, and resource heterogeneity in such advanced platforms, from a cloud perspective. The primary objective of this article is to help early researchers gain insight into the underlying concepts of resource management tasks in the cloud for IoT applications.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-16", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 37", "volume": "55"}, "authors": [{"authorId": "51043236", "name": "Rathinaraja Jeyaraj"}, {"authorId": "2059357059", "name": "Anandkumar Balasubramaniam"}, {"authorId": "1447085358", "name": "Ajay Kumara M.A."}, {"authorId": "2554658", "name": "Nadra Guizani"}, {"authorId": "1940632", "name": "Anand Paul"}], "citations": [{"paperId": "5723b327f7e70699671a5a76a1ea8884022933de", "title": "RCFS: rate and cost fair CPU scheduling strategy in edge nodes"}, {"paperId": "256b754b4a55fa68812897e06000c5df597f7f6a", "title": "YSAF: Yolo with Spatial Attention and FFT to Detect Face Spoofing Attacks"}, {"paperId": "02a95895f88ac496205476efc6b0196568c0e0da", "title": "Machine learning-driven task scheduling with dynamic K-means based clustering algorithm using fuzzy logic in FOG environment"}, {"paperId": "9839ea2a03161fc3924be2ddd8ac1be1bf4f5adf", "title": "Resource provisioning model for executing realistic workload in heterogenous internet of things environment"}, {"paperId": "46990a16dc72428a346b57f4aa62a223163e1175", "title": "A Novel Resource Allocation in Software-Defined Networks for IoT Application"}, {"paperId": "30d12d91c7f65af8c04945bac2b3c78c822cf784", "title": "A Novel Data Management Scheme in Cloud for Micromachines"}, {"paperId": "e0f1f01c511ffb9edfb1c63bd7ef413e3cf59917", "title": "Proactive resource management for cloud of services environments"}, {"paperId": "ac9fc0c70280f17d5d5cca1873fd61e4a5bd1dd2", "title": "Improvement of the Airflow Energy Harvester Based on the New Diamagnetic Levitation Structure"}, {"paperId": "d4ddf130384dc44cd8136d9a8e5ff8a253a51933", "title": "Evaluation of soft computing in methodology for calculating information protection from parameters of its distribution in social networks"}, {"paperId": "c5938e24b16bb6ce8b965f51d73cdf96aae46eb0", "title": "Load Balancing Using Artificial Intelligence for Cloud-Enabled Internet of Everything in Healthcare Domain"}, {"paperId": "e55f26c176c847e561e2629d3718f8e5a373008e", "title": "IoT-Dew Computing-Inspired Real-Time Monitoring of Indoor Environment for Irregular Health Prediction"}, {"paperId": "8457ef5452ac05388f5d07787a6eadaa18452cab", "title": "Privacy-Preserving Big Data Security for IoT With Federated Learning and Cryptography"}]}
