{"paperId": "19b4c5428066b34236d5e23050abe182e30ff29f", "publicationVenue": {"id": "816cf066-eed5-43b6-add7-8bf9d6b3cf05", "name": "International journal of electrical and electronics research", "type": "journal", "alternate_names": ["Int J Electr Electron Res", "Int j electr electron res", "International Journal of Electrical and Electronics Research"], "issn": "2348-6988", "alternate_issns": ["2347-470X"], "url": "http://researchpublish.com/journalss/IJEER"}, "title": "SCSO-MHEF: Sand Cat Swarm Optimization based MHEF for Nonlinear LTI-IoT Sensor Data Enhancement", "abstract": "Sensor data is an integral component of internet of things (IoT) and edge computing environments and initiatives. In IoT, almost any entity imaginable can be outfitted with a unique identifier and the capacity to transfer data over a network. The estimate problem was formulated as a min-max problem subject to system dynamics and limitations on states and disturbances within the moving horizon strategy framework. In this paper, a novel Sand Cat Swarm Optimization Based MHEF for Nonlinear LTI IOT Sensor Data Enhancement (SCSO-MHEF) is proposed. In the proposed method the MHEF is optimized using Sand Cat Swarm Optimization to enhance sensor data stability tuned by initial parameters. Simulation experiments were conducted on various and unique scenarios in various orders LTI system with IOT sensor data in order to validate the suggested approach. This method can be used to analyze systems with dynamically changing systems. The proposed SCSO-MHEF technique overall accuracy of 84.5%, 87.3 %, and 99.5 % better than Kalman Filter (KF), EKF and Moving Horizon Filter (MHEF) respectively.", "venue": "International journal of electrical and electronics research", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-05", "journal": {"name": "International Journal of Electrical and Electronics Research"}, "authors": [{"authorId": "2056450150", "name": "Anees Fathima Bashir"}, {"authorId": "2284554805", "name": "M. P. F. Queen"}, {"authorId": "2284549886", "name": "Irfan Habib"}], "citations": []}
