{"paperId": "19c091c7617ba50ff4618369ee7c54ae81b80df9", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "A Cost Model for SPARK SQL", "abstract": "In this paper, we propose a novel cost model for Spark SQL. The cost model covers the class of Generalized Projection, Selection, Join (GPSJ) queries. The cost model keeps into account the network and IO costs as well as the most relevant CPU costs. The execution cost is computed starting from a physical plan produced by Spark. The set of operations adopted by Spark when executing a GPSJ query are analytically modeled based on the cluster and application parameters, together with a set of database statistics. Experimental results carried out on three benchmarks and on two clusters of different sizes and with different computation features show that our model can estimate the actual execution time with about the 20 percent of errors on the average. Such an accuracy is good enough to let the system choose the most effective plan even when the execution time differences are limited. The error can be reduced to 14 percent, if the analytic model is coupled with our straggler handling strategy.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "819-832", "volume": "31"}, "authors": [{"authorId": "144314220", "name": "Lorenzo Baldacci"}, {"authorId": "1711320", "name": "M. Golfarelli"}], "citations": [{"paperId": "4eb61ac220459437c909b2a6e93c45684bc93ebd", "title": "Mfrlmo: Model-Free Reinforcement Learning for Multi-Objective Optimization of Apache Spark"}, {"paperId": "e98d2d71dec6189eb7f33e915617e5a788a8b073", "title": "A Novel Spark-Based Attribute Reduction and Neighborhood Classification for Rough Evidence"}, {"paperId": "250da3415c59d66e8b3933537189deed6a485de2", "title": "Multi-objective query optimization in Spark SQL"}, {"paperId": "ea38182f7626bb75b12a1f35b97664c8a3298209", "title": "A Resource-Aware Deep Cost Model for Big Data Query Processing"}, {"paperId": "41eafea6256ab2af225617006eac763b2a420ccd", "title": "LOCAT: Low-Overhead Online Configuration Auto-Tuning of Spark SQL Applications"}, {"paperId": "4d5dbec3dc3062255c2637ae23ee0b0fcd46a444", "title": "PACk: An Efficient Partition-based Distributed Agglomerative Hierarchical Clustering Algorithm for Deduplication"}, {"paperId": "d1e17d79fa406c44dc57c7f2e0a293549d4bdf3a", "title": "Forecasting SQL Query Cost at Twitter"}, {"paperId": "98879aea0cdbd4e0290aa32d6da45e6d0357eb32", "title": "ABSTAT-HD: a scalable tool for profiling very large knowledge graphs"}, {"paperId": "53dac5d590fc1cb17668277198f21df907386cc4", "title": "A spark-based parallel distributed posterior decoding algorithm for big data hidden Markov models decoding problem"}, {"paperId": "3957d638e7ad2c26b32ac6a12e4c6662431ebaff", "title": "Hyperspace: The Indexing Subsystem of Azure Synapse"}, {"paperId": "fe18a18d5a5301b5836e75c1b2645994d8bd1285", "title": "Screening hardware and volume factors in distributed machine learning algorithms on spark"}, {"paperId": "1205db22973f35ddbee1f01b7658f3c54f64f7b1", "title": "ACORE: A Query Optimization Approach for Spark SQL Based on Cost Model and Markov Prediction Model"}, {"paperId": "953a78b595041ad6b42fd8fffa66ab89e30d1279", "title": "BIBSQLQC: Brown infomax boosted SQL query clustering algorithm to detect anti-patterns in the query log"}, {"paperId": "b8a3f696171c09c0732cf598e63100a0d8d5f360", "title": "Configuring Parallelism for Hybrid Layouts Using Multi-Objective Optimization"}, {"paperId": "495a77db31bc20113f253c32c6783a4572ac8a25", "title": "2019 Index IEEE Transactions on Knowledge and Data Engineering Vol. 31"}, {"paperId": "5b59236b5d66fa44278fd852e31e5a2848f63d1f", "title": "Storage Format Selection and Optimization for Materialized Intermediate Results in Data-Intensive Flows"}, {"paperId": "ef7fe8f009ec1364145b72954d4461fbc886f7a1", "title": "Automatically Configuring Parallelism for Hybrid Layouts"}, {"paperId": "b8cd0dd4911e1f6cb33c2fca9c5c936178783245", "title": "SDWP: A New Data Placement Strategy for Distributed Big Data Warehouses in Hadoop"}, {"paperId": "13030aeef1f70f4c0d853cc1b303dc26d8e9f5b3", "title": "Spatial Query Optimization and Distributed Data Server - Application in the Management of Big Astronomical Surveys. (Optimisation de requêtes spatiales et serveur de données distribué - Application à la gestion de masses de données en astronomie)"}, {"paperId": "1d1d7d6bba6074db3820ed7a8692eddb43055097", "title": "Performance Analysis of Distributed GPU-Accelerated Task-Based Workflows"}, {"paperId": "99c2ac97171c4fbea9c76a20f919868a4412239c", "title": "Optimizing Execution Plans in a Multistore"}, {"paperId": "a06876418a9ab36a3b631f1824610ada82c2342c", "title": "Large Scale Querying and Processing for Property Graphs"}, {"paperId": "e78124a2f6f3367283440cfeda78bf2d0d32c01a", "title": "SparkTune: tuning Spark SQL through query cost modeling"}]}
