{"paperId": "19ca71996772969492a595728ec03b65cfa22488", "publicationVenue": null, "title": "GPU-Accelerated Graph Label Propagation for Real-Time Fraud Detection", "abstract": "Fraud detection is a pressing challenge for most financial and commercial platforms. In this paper, we study the processing pipeline of fraud detection in a large e-commerce platform of TaoBao. Graph label propagation (LP) is a core component in this pipeline to detect suspicious clusters from the user-interaction graph.Furthermore, the run-time of the LP component occupies 75% overhead of TaoBao's automated detection pipeline. To enable real-time fraud detection, we propose a GPU-based framework, called GLP, to support large-scale LP workloads in enterprises.We have identified two key challenges when integrating GPU acceleration into TaoBao's data processing pipeline: (1)programmability for evolving fraud detection logics; (2)demand for real-time performance. Motivated by these challenges, we offer a set of expressive APIs that data engineers can customize and deploy efficient LP algorithms on GPUs with ease. We propose novel GPU-centric optimizations by leveraging the community as well as power-law properties of large graphs. Extensive experiments have confirmed the effectiveness of our proposed optimizations. With a single GPU, GLP supports a real billion-scale graph workload from the fraud detection pipeline of TaoBao and achieves 8.2x speedup to the current in-house distributed solution running on high-end multicore machines.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2064451068", "name": "Chang Ye"}, {"authorId": "1823512389", "name": "Yuchen Li"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "2156264559", "name": "Zhao Li"}, {"authorId": "48480254", "name": "Jianling Sun"}], "citations": [{"paperId": "6a3816c4f3189f46cba8b2d571bb6890cf47c2a0", "title": "A survey on dynamic graph processing on GPUs: concepts, terminologies and systems"}, {"paperId": "b7bc6984b1563d42bfd9108f56fc69dbb7d567de", "title": "Online Anomaly Detection over Live Social Video Streaming"}, {"paperId": "2d0c9e34d728ad61d9cfab1b7d14cc5d760761ff", "title": "GPUSCAN++: Eficient Structural Graph Clustering on GPUs"}, {"paperId": "1049920ed634bd0f84f93df38c5db64112b371fc", "title": "MINT: Detecting Fraudulent Behaviors from Time-series Relational Data"}, {"paperId": "b07deb1cadf89d3b578f4ff78d718bb01bf2d315", "title": "Accelerating Sampling and Aggregation Operations in GNN Frameworks with GPU Initiated Direct Storage Accesses"}, {"paperId": "09b0db9c91de77a2aa8c6e368f5e9e2953a1f6c0", "title": "BitGNN: Unleashing the Performance Potential of Binary Graph Neural Networks on GPUs"}, {"paperId": "4f81542b7f15e9b2863b1d6435856e751a02829f", "title": "Spade: A Real-Time Fraud Detection Framework on Evolving Graphs"}, {"paperId": "13cce4bbc706426f67558dd7bf41136513c3e2ce", "title": "GraphFly: Efficient Asynchronous Streaming Graphs Processing via Dependency-Flow"}, {"paperId": "412b91005cb4bf89989385f13ce7a770c84b5faa", "title": "SURF: Direction-Optimizing Breadth-First Search Using Workload State on GPUs"}, {"paperId": "3a9558e156e4e681cb2cb34c9e7ed4ca66f58bcc", "title": "Local Clustering over Labeled Graphs: An Index-Free Approach"}, {"paperId": "ec567f1005ba3d22cd7ce4c26228d6e0afd46ca4", "title": "Sequence-Based Target Coin Prediction for Cryptocurrency Pump-and-Dump"}, {"paperId": "c5269518351196e2d6a653b60fa7b024d329b95d", "title": "Fast and Efficient Update Handling for Graph H2TAP"}]}
