{"paperId": "19ccb6dd42bd85d48117b2c51defa299f0a2390c", "publicationVenue": {"id": "8ffee4a9-9078-4b52-9e43-b5adb39f1f34", "name": "IEEE International Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises", "type": "conference", "alternate_names": ["Work Enabling Technol Infrastracture Collab Enterp", "IEEE Int Work Enabling Technol Infrastracture Collab Enterp", "WETICE", "Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises"], "url": "http://www.wikicfp.com/cfp/program?id=3053"}, "title": "Web of Things Data Visualization: From Devices to Web Via Fog and Cloud Computing", "abstract": "Web of Things (WoT) uses current Web protocols and languages as an integration platform of physical devices on the Internet. Previsions estimate that by 2020, 20 to 50 billion such devices will be connected - producing, collecting, and transmitting data over the Internet. The amount of data associated with such a gigantic number of available devices represents a real challenge in data visualization. This paper proposes a Data Visualization model for WoT, based on Fog Computing concepts, more specifically the Fog of Things paradigm. The aim of our proposal is to enable the creation of different data visualizations that take into account the hierarchical levels in an architecture involving Fog and Cloud. In order to demonstrate our proposal, a prototype of the Web of Things application was developed, which is used to perform usability evaluation through the USE questionnaire technique.", "venue": "IEEE International Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE 28th International Conference on Enabling Technologies: Infrastructure for Collaborative Enterprises (WETICE)", "pages": "140-145"}, "authors": [{"authorId": "2061394841", "name": "G. P. Pinto"}, {"authorId": "2336418", "name": "Cássio V. S. Prazeres"}], "citations": [{"paperId": "4b03ab152d482998922e026c0d69b6276172057e", "title": "Towards Web of Things Middleware: A Systematic Review"}, {"paperId": "42fababa415d7f33feca3e7074ba98d7e6b62022", "title": "A Review and State of Art of Internet of Things (IoT)"}, {"paperId": "7623268f060a94f6a7f577d83d8f25590e6ecc5a", "title": "DEW 2019: Data Exploration in the Web 3.0 Age"}, {"paperId": "3cab3394359efcc64e8f420b5c84f145d638b64c", "title": "AN IOT BASED WEATHER STATION USING AN EMBEDDED SYSTEM"}, {"paperId": "a2008075547477226655ca27e27b4e2689de580d", "title": "Special Topics in Multimedia, IoT and Web Technologies"}, {"paperId": "602ccf73a06690f2a5e6f21a0b6a0df4a2ea7ebe", "title": "Fog of Things: Fog Computing in Internet of Things Environments"}]}
