{"paperId": "19cf827b22fb8ec957f28a0df672b576c4ee1936", "publicationVenue": {"id": "d732841e-83f9-49ec-95ca-389e5568634b", "name": "Annual Conference on Genetic and Evolutionary Computation", "type": "conference", "alternate_names": ["GECCO", "Annu Conf Genet Evol Comput", "Genet Evol Comput Conf", "Genetic and Evolutionary Computation Conference"], "url": "http://www.sigevo.org/"}, "title": "Visualizing the tape of life: exploring evolutionary history with virtual reality", "abstract": "Understanding the evolutionary dynamics created by a given evolutionary algorithm is a critical step in determining which ones are most likely to produce desirable outcomes for a given problem. While it is relatively easy to come up with hypotheses that could plausibly explain observed evolutionary outcomes, we often fail to take the next step of confirming that our proposed mechanism accurately describes the underlying evolutionary dynamics. Visualization is a powerful tool for exploring evolutionary history as it actually played out. We can create visualizations that summarize the evolutionary history of a population or group of populations by drawing representative lineages on top of the fitness landscape being traversed. This approach integrates information about the adaptations that took place with information about the evolutionary pressures they were being subjected to as they evolved. However, these visualizations can be challenging to depict on a two-dimensional surface, as they integrate multiple forms of three-dimensional (or more) data. Here, we propose an alternative: taking advantage of recent advances in virtual reality to view evolutionary history in three dimensions. This technique produces an intuitive and detailed illustration of evolutionary processes. A demo of our visualization is available here: https://emilydolson.github.io/fitness_landscape_visualizations.", "venue": "Annual Conference on Genetic and Evolutionary Computation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-07-06", "journal": {"name": "Proceedings of the Genetic and Evolutionary Computation Conference Companion"}, "authors": [{"authorId": "7172470", "name": "Emily L. Dolson"}, {"authorId": "152559260", "name": "Charles Ofria"}], "citations": [{"paperId": "1b3c8d31e00bd74ef6be8f661fafbce073764ef9", "title": "Interpreting the Tape of Life: Ancestry-Based Analyses Provide Insights and Intuition about Evolutionary Dynamics"}, {"paperId": "08eefd179e42a723c6e9aab4c86f0fd3070744ba", "title": "Quantifying the tape of life: Ancestry-based metrics provide insights and intuition about evolutionary dynamics"}]}
