{"paperId": "19ee14573791e949ede4473be68a33e7ee536a7e", "publicationVenue": {"id": "8d848812-c4dd-4524-a6ac-5f5822355b19", "name": "International journal of recent technology and engineering", "type": "journal", "alternate_names": ["Int j recent technol eng"], "issn": "2277-3878", "url": "https://www.ijrte.org/"}, "title": "Moore Data Clustering Based Bloom Hash Storage for Dimensionality Reduction of Big Data Analytics", "abstract": "Big data contains massive amounts of information’s that are difficult to manage, acquire, store and analyses. The clustering of data is a demanding issue in the field of big data analytics. The existing techniques developed for clustering does not provide efficient performance and also time complexity of clustering was higher. Further, minimizing dimensionality of big data was not addressed effectively. In order to overcome these limitations, a Moore Data Clustering based Bloom Hash Storage (MDC-BHS) Technique is proposed. The MDC-BHS Technique is designed with aim of reducing the dimensionality of big data with lesser time through clustering. The MDC-BHS Technique used Moore Data Clustering (MDC) Model in order to group the data in big dataset with minimum time consumption. After performing clustering process, the MDC-BHS Technique employed Bloom Hash Storage (BHS) Model in order to store clustered data with minimum space complexity. The BHS Model is a space-efficient probabilistic data structure which utilized hashing function to create hash value for clustered data. Therefore, proposed MDC-BHS Technique significantly reduces the dimensionality of larger dataset. The experimental evaluation of MDC-BHS technique is carried out on weather data with factors such as clustering time and clustering accuracy and space complexity with respect to number of data. The experimental results demonstrate that MDC-BHS Technique is able to improve the clustering accuracy and also minimizes the space complexity when compared to state-of-the-art works", "venue": "International journal of recent technology and engineering", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-09-30", "journal": {"name": "International Journal of Recent Technology and Engineering"}, "authors": [{"authorId": "2288265976", "name": "Head Maheswari. D"}], "citations": []}
