{"paperId": "1a107ffa135fc020b0cbceda293afb966328a954", "publicationVenue": {"id": "b5459697-d8f0-4093-81c6-149fea21fdef", "name": "International Conference on Smart Grid and Clean Energy Technologies", "type": "conference", "alternate_names": ["ICSGCE", "Int Conf Smart Grid Clean Energy Technol"]}, "title": "Data Management Architecture A Need in Smart Grids Domains", "abstract": "A system architecture is a high level design that enables to represent a (complex) system. As architectures are abstract entities, they must be expressed through their architecture descriptions. These descriptions are documents that arise as the result of activities related to the architecture development. In this work, we propose a practical system architecture definition based on some related concepts as architecture framework, reference model, standards and reference architecture. We also identify the features that an architecture must have as a guide for its development. Then, we analyze the most relevant Smart Grid architectures proposals, looking for whether they include or not a Data Management perspective. Data management is a high-level function that seeks to manage appropriately every aspect associated to data and information assets in an organization. Data is an important asset in smart grid domain. We conclude that there is an important gap between the Smart Grid Data Management requirements and the guides in the reviewed architectures.", "venue": "International Conference on Smart Grid and Clean Energy Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-05-01", "journal": {"name": "2018 International Conference on Smart Grid and Clean Energy Technologies (ICSGCE)", "pages": "32-37"}, "authors": [{"authorId": "52192535", "name": "Marla Constanza Barrera Botero"}, {"authorId": "52195889", "name": "Oscar Germán Duarte Velasco"}], "citations": [{"paperId": "4313b716f198f7d850ec1e629db5e657c79495ae", "title": "Sustainable Electrification—Advances and Challenges in Electrical-Distribution Networks: A Review"}]}
