{"paperId": "1a13e5a1146c76d122c6feddf19d6e1f562cdedd", "publicationVenue": {"id": "99e98681-158c-48ca-8f86-386d75770b50", "name": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "type": "conference", "alternate_names": ["IEEE/ACM Int Symp Model Anal Simul Comput Telecommun Syst", "Model Anal Simul Comput Telecommun Syst", "Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "MASCOTS"], "url": "http://www.mascots-conference.org/"}, "title": "Decentralized Online Federated G-Network Learning for Lightweight Intrusion Detection", "abstract": "Cyberattacks are increasingly threatening net-worked systems, often with the emergence of new types of unknown (zero-day) attacks and the rise of vulnerable devices. uch attacks can also target multiple components of a Supply Chain, which can be protected via Machine Learning (ML)-based Intrusion Detection Systems (IDSs). However, the need to learn large amounts of labelled data often limits the applicability of ML-based IDSs to cybersystems that only have access to private local data, while distributed systems such as Supply Chains have multiple components, each of which must preserve its private data while being targeted by the same attack To address this issue, this paper proposes a novel Decentralized and Online Federated Learning Intrusion Detection (DOF-ID) architecture based on the G-Network model with collaborative learning, that allows each IDS used by a specific component to learn from the experience gained in other components, in addition to its own local data, without violating the data privacy of other components. The performance evaluation results using public Kitsune and Bot-loT datasets show that DOF -ID significantly improves the intrusion detection performance in all of the collaborating components, with acceptable computation time for online learning.", "venue": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-22", "journal": {"name": "2023 31st International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS)", "pages": "1-8"}, "authors": [{"authorId": "1500391660", "name": "Mert Nakıp"}, {"authorId": "1420115367", "name": "Baran Can Gül"}, {"authorId": "2148379374", "name": "Erol Gelenbe"}], "citations": [{"paperId": "e9a1e1df4cb3c9ae38993d697e1980ce52f328a5", "title": "Cross-Layer Federated Learning for Lightweight IoT Intrusion Detection Systems"}, {"paperId": "7a14d3959449a72b07150a349fc2ed5d0fa61b30", "title": "Decentralized Federated Learning: Fundamentals, State of the Art, Frameworks, Trends, and Challenges"}]}
