{"paperId": "1a14d0607ca2ac758636538d47581f1a911616fb", "publicationVenue": null, "title": "BigData Applications from Graph Analytics to Machine Learning by Aggregates in Recursion", "abstract": "In the past, the semantic issues raised by the non-monotonic nature of aggregates often prevented their use in the recursive statements of logic programs and deductive databases. However, the recently introduced notion of Pre-mappability (PreM) has shown that, in key applications of interest, aggregates can be used in recursion to optimize the perfect-model semantics of aggregate-stratified programs. Therefore we can preserve the declarative formal semantics of such programs while achieving a highly efficient operational semantics that is conducive to scalable implementations on parallel and distributed platforms. In this paper, we show that with PreM, a wide spectrum of classical algorithms of practical interest, ranging from graph analytics and dynamic programming based optimization problems to data mining and machine learning applications can be concisely expressed in declarative languages by using aggregates in recursion. Our examples are also used to show that PreM can be checked using simple techniques and templatized verification strategies. A wide range of advanced BigData applications can now be expressed declaratively in logic-based languages, including Datalog, Prolog, and even SQL, while enabling their execution with superior performance and scalability.", "venue": "ICLP Technical Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-18", "journal": {"pages": "273-279"}, "authors": [{"authorId": "2499545", "name": "Ariyam Das"}, {"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "2143717242", "name": "Jin Wang"}, {"authorId": "47628976", "name": "Mingda Li"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": [{"paperId": "5b01f1caeef7c93cf01f9d4ebc0af5efd8acc96e", "title": "Optimizing Parallel Recursive Datalog Evaluation on Multicore Machines"}, {"paperId": "495fbff8c27e854426264b9f9a1888e3927f22df", "title": "Demonstration of LogicLib: An Expressive Multi-Language Interface over Scalable Datalog System"}, {"paperId": "47410d210b22dfa4d437d24b50dc87ac56b0584f", "title": "Recent Progress in Conversational AI"}, {"paperId": "e93f9d67e91553f800f8cd1688253b94d9d73a01", "title": "Data Sensitivity and Classification Management: A Declarative Approach"}, {"paperId": "893ed788c9ca7b160fba2f3001141a0b70a0b479", "title": "Formal semantics and high performance in declarative machine learning using Datalog"}, {"paperId": "59c4149d05557f049c92d1bd774f6724e08dd96f", "title": "Convergence of Datalog over (Pre-) Semirings"}, {"paperId": "d0614367ae0946c8c420e8a8173395ed2d683de8", "title": "KDDLog:Performance and Scalability in Knowledge Discovery by Declarative Queries with Aggregates"}, {"paperId": "c1124e4c7b2d0f287e7a0cdfed0643df711fba16", "title": "Recursive Rules with Aggregation: A Simple Unified Semantics"}, {"paperId": "86e7d81bc9e6eda77e4223d9872c5bd08ec9def2", "title": "RASQL: A Powerful Language and its System for Big Data Applications"}, {"paperId": "c1462eb510849b070bc39335d3ae2911e74fff57", "title": "Monotonic Properties of Completed Aggregates in Recursive Queries"}, {"paperId": "5741548afb3e3e0b74194c0963187e41f42e753d", "title": "Proceedings 35th International Conference on Logic Programming (Technical Communications)"}, {"paperId": "5ba1e2d13cc12e8ebc27255bcef292347d639e47", "title": "Developing Big-Data Application as Queries: an Aggregate-Based approach"}]}
