{"paperId": "1a2deee0992d800163c37f6493cd45843aca4ad0", "publicationVenue": {"id": "0471222d-7141-46cf-8bf3-e7e1676553d1", "name": "IEEE International Symposium on Software Reliability Engineering", "type": "conference", "alternate_names": ["IEEE Int Symp Softw Reliab Eng", "Int Symp Softw Reliab Eng", "International Symposium on Software Reliability Engineering", "ISSRE"], "url": "http://www.wikicfp.com/cfp/program?id=1756"}, "title": "Ahead of Time Mutation Based Fault Localisation using Statistical Inference", "abstract": "Mutation analysis can effectively capture the de-pendency between source code and test results. This has been exploited by Mutation Based Fault Localisation (MBFL) techniques. However, MBFL techniques suffer from the need to expend the high cost of mutation analysis after the observation of failures, which may present a challenge for its practical adoption. We introduce SIMFL (Statistical Inference for Mutation-based Fault Localisation), an MBFL technique that allows users to perform the mutation analysis in advance before a failure is observed, allowing the amortisation of the analysis cost. SIMFL uses mutants as artificial faults and aims to learn the failure patterns among test cases against different locations of mutations. Once a failure is observed, SIMFL requires either almost no or very small additional cost for analysis, depending on the used inference model. An empirical evaluation using DEFECTS4J shows that SIMFL can successfully localise up to 113 out of 203 studied faults (55%) at the top, and 159 (78%) faults within the top five, significantly outperforming existing MBFL techniques while using the results of mutation analysis that has been undertaken before the test failure. The amortised cost of mutation analysis can be further reduced by mutation sampling: SIMFL retains 80 % of its localisation accuracy at the top rank when using only 10% of generated mutants, compared to results obtained without sampling.", "venue": "IEEE International Symposium on Software Reliability Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-26", "journal": {"name": "2021 IEEE 32nd International Symposium on Software Reliability Engineering (ISSRE)", "pages": "253-263"}, "authors": [{"authorId": "2116516016", "name": "Jinhan Kim"}, {"authorId": "144712289", "name": "Gabin An"}, {"authorId": "145278906", "name": "R. Feldt"}, {"authorId": "143828721", "name": "S. Yoo"}], "citations": [{"paperId": "3d48e8db63b5286ab1f5bc04c8f8a88b4ea79024", "title": "Test Case Level Predictive Mutation Testing Combining PIE and Natural Language Features"}, {"paperId": "f637ddce0b06142f6ed8479f0e90d3cf92be8c6b", "title": "GMBFL: Optimizing Mutation-Based Fault Localization via Graph Representation"}, {"paperId": "e96999876706d8725f679e662bfdf33f7bd96fbf", "title": "Large Language Models in Fault Localisation"}, {"paperId": "77721c94ca48c4a16875d3ef6127b846ea2a20e8", "title": "VsusFL: Variable-suspiciousness-based Fault Localization for novice programs"}, {"paperId": "9291205b769264683fd33a3d1592331392bf1a4a", "title": "Learning Test-Mutant Relationship for Accurate Fault Localisation"}, {"paperId": "29f44d6f53d383f9251d6b54810bb23277c9445f", "title": "Predictive Mutation Analysis via the Natural Language Channel in Source Code"}]}
