{"paperId": "1a384db7f845e74a29069f992063096901d1b5ef", "publicationVenue": null, "title": "Concepts and Methods to Assess the Dynamic Thermal Rating of Underground Power Cables \"2279", "abstract": "With the increase in the electrical load and the progressive introduction of power generation from intermittent renewable energy sources, the power line operating conditions are approaching the thermal limits. The definition of thermal limits variable in time has been addressed under the concept of dynamic thermal rating (DTR), with which it is possible to provide a more detailed assessment of the line rating and exploit the electrical system more flexibly. Most of the literature on DTR has addressed overhead lines exposed to different weather conditions. The interest in the dynamic thermal rating of power cables is increasing, considering the evolution of computational methods and advanced systems for cable monitoring. This paper contains an overview of the concepts and methods referring to dynamic cable rating (DCR). Starting from the analytical formulations developed many years ago for determining the power cable rating in steady-state conditions, also reported in International Standards, this paper considers the improvements of these formulations proposed during the years. These improvements are leading to include more specific details in the models used for DCR analysis and the computational methods used to assess the power cable’s thermal conditions buried in soil. This paper is focused on highlighting the path from the initial theories and models to the latest literature contributions. Attention is paid to thermal modelling with different levels of detail, applications of 2D and 3D solvers and simplified models, and their validation based on experimental measurements. A salient point of the overview is considering the DCR impact on reliability aspects, risk estimation, real-time calculations, forecasting, and planning with different", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "32148966", "name": "D. Enescu"}, {"authorId": "1914015", "name": "P. Colella"}, {"authorId": "48058751", "name": "A. Russo"}, {"authorId": "3281052", "name": "R. Porumb"}, {"authorId": "41175375", "name": "G. Seritan"}], "citations": []}
