{"paperId": "1a457eb30107ade99b98a56cbc023472f4f3e047", "publicationVenue": {"id": "e0174555-0649-4c3e-b2d8-519443892039", "name": "International Conference on Artificial Intelligence and Soft Computing", "type": "conference", "alternate_names": ["Int Conf Artif Intell Soft Comput", "ICAISC"], "url": "http://www.wikicfp.com/cfp/program?id=1277"}, "title": "Model of Visualization and Analytics for Open Data (Case: Election Voters & Kids Disability Category)", "abstract": "Several regional head elections had to be postponed due to the pandemic, including in Indonesia because of the COVID-19 pandemic. Several big cities in Indonesia are of concern because of their large population and GDP. This study conducts analysis and testing of datasets taken from Open Data in a city in Indonesia. In addition to conducting research on regional head elections, we also present information on voters from the category of kids with disabilities. The steps used in this research are using regional mapping data of the city of Surabaya in the Election of the Regional Head. Download the data or dataset for the Regional Head Election ampersand Categories of kids with disabilities. Based on the dataset voters from the category of children with disabilities are more than 5 percent.In this research, we use Python to process our datasets & Big Data technology. Data cleaning or cleansing, Exploratory Data Analysis, and Empirical Cumulative Distribution Functions (ECDF) in python are also needed. Result from ECDF chart with steady increase (increment of 0.1). The highest variance value is in Electoral District 5 = 6.090 and the lowest value is in Electoral District 4 = 0.90. The result of Open Data is graphical data visualization and candidate scores to help as an alternative for the 2024 Regional Head Election and the Category of kids with disabilities.", "venue": "International Conference on Artificial Intelligence and Soft Computing", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2023-01-23", "journal": {"name": "2023 1st International Conference on Advanced Innovations in Smart Cities (ICAISC)", "pages": "1-6"}, "authors": [{"authorId": "2059902962", "name": "Ripto Mukti Wibowo"}, {"authorId": "73878140", "name": "Bahjat Fakieh"}, {"authorId": "2169795390", "name": "M. S. Ramzan"}, {"authorId": "123782728", "name": "A. Alzahrani"}, {"authorId": "13374568", "name": "M. Siddiqui"}, {"authorId": "2329385", "name": "B. Alzahrani"}], "citations": []}
