{"paperId": "1a4f6c9d048961748b44b4dbb222291b1d514864", "publicationVenue": {"id": "bfdaa902-daba-44e2-9de0-df4e61fe2f80", "name": "International Conference on Ubiquitous Information Management and Communication", "type": "conference", "alternate_names": ["ICUIMC", "IMCOM", "Int Conf Ubiquitous Inf Manag Commun"], "url": "http://www.wikicfp.com/cfp/program?id=1499"}, "title": "Natural Sciences Meet Social Sciences: Census Data Analytics for Detecting Home Language Shifts", "abstract": "As we are living in a global environment, it is not unusual to have more than one languages or dialects used in a country. Examples include Canada in the Americas, Singapore in Asia, and Switzerland in Europe. With the initiatives of globalization, many people immigrate or live in a country other than their birthplace. As a result, different people in the same country may have different home language (i.e., first language). For instance, as a nation composed of a highly diverse language population, Canada provides a unique opportunity to study the factors causing certain languages (or families of language) to be lost over subsequent generations among allophones (i.e., people whose mother tongue is neither English or French). In this paper, we focus on census data analytics. Specifically, we analyze census microdata by exploring machine learning and data mining techniques-such as decision tree induction, random forest, and categorical naive Bayes-to study the influence of various social and economic factors on the probability that allophones adopt official languages as their language spoken at home. This study is a showcase where natural sciences and engineering (NSE) meet social sciences, in which NSE solutions (e.g., census data analytics) are applicable for the study of social science related phenomena (e.g., successful detection of shifts in home languages).", "venue": "International Conference on Ubiquitous Information Management and Communication", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-01-04", "journal": {"name": "2021 15th International Conference on Ubiquitous Information Management and Communication (IMCOM)", "pages": "1-8"}, "authors": [{"authorId": "2057096423", "name": "Christian M. Choy"}, {"authorId": "104376986", "name": "M. Co"}, {"authorId": "2057096286", "name": "Matthew J. Fogel"}, {"authorId": "2057096224", "name": "Clarke D. Garrioch"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "2057096235", "name": "Ekaterina Martchenko"}], "citations": [{"paperId": "d96f6f34e9011eebfe6c36f30b8439954728eaa7", "title": "An Efficient Approach to Learn an Effective Hierarchy of a Set of OOBN Classes"}, {"paperId": "37a107a57e271515c379595d711e4a48d23bc8c1", "title": "SREMIC: Spatial Relation Extraction-based Malware Image Classification"}, {"paperId": "4cbdcafe8f89118b8ec2d5add73a7a47e56df38c", "title": "Unveiling Market Sentiments: A Comprehensive Analysis of Stock Market Responses to Diverse News Events Using Data Mining Techniques"}, {"paperId": "d2b096acef8b783147a2b34c251d5cb24c8705e9", "title": "Health Informatics on Big COVID-19 Pandemic Data via N-Shot Learning"}, {"paperId": "b78baf42cab8011d464250b357cb93636c13bc80", "title": "Effectively and Efficiently Supporting Predictive Big Data Analytics over Open Big Data in the Transportation Sector: A Bayesian Network Framework"}, {"paperId": "38545e5ff642e6028550eb5e151de94eb2212427", "title": "Predictive Analytics to Support Health Informatics on COVID-19 Data"}, {"paperId": "aa8a61d9976db75776ebdfb2d2360ebeeb4da54c", "title": "Predictive Analytics of COVID-19 with Neural Networks"}, {"paperId": "3afa28fefe1fb78714d49f0daa5341bde5abe7d4", "title": "Explainable Data Analytics for Disease and Healthcare Informatics"}, {"paperId": "eb8846a5423fcbf7d6cac9612f4283e50373f399", "title": "A Bayesian Framework for Supporting Predictive Analytics over Big Transportation Data"}, {"paperId": "28846c01c03eb3b9ba19daf1dd854e441edff85a", "title": "Distributed Big Data Computing for Supporting Predictive Analytics of Service Requests"}, {"paperId": "605a0d9c4b0b152b406b6103332b0f39cab84822", "title": "Predictive Big Data Analytics for Service Requests: A Framework"}]}
