{"paperId": "1a53013fdd66e61ed117ef1fc90dcfbed5a473a5", "publicationVenue": {"id": "24354842-2a0c-4aa2-abe7-06c43b4fb54b", "name": "International Symposium on Computing and Networking - Across Practical Development and Theoretical Research", "type": "conference", "alternate_names": ["CANDAR", "Int Symp Comput Netw  Across Pract Dev Theor Res"], "url": "http://www.wikicfp.com/cfp/program?id=1429"}, "title": "Use cases and success stories of a data analytics system in an automotive Paint Shop", "abstract": "Manufacturing companies are currently developing transformation plans from the 3.0 paradigm, based on automation, robotics and Lean, to the 4.0 approach, based on digitalization of production and data exploitation. In this paper, a specific case of an automotive factory digital transformation is presented, including the description of a roadmap, an architecture, and a first set of analyses regarding quality, reliability and predictive maintenance in the Paint Shop. Data gathering, data visualization and statistical control are also commented. Some of the success stories include reduction of defect rates, optimization of processes and early detection of deviation of parameters, by using Artificial Intelligence algorithms on datasets with thousands of variables and hundreds of thousands of produced cars. These actions have meant savings for the factory, as well as productivity and efficiency improvements, showing that it is possible to obtain short-term victories while implementing a long-term tool. This methodology is currently being transferred to the rest of the factory, including stamping, body in white and assembly line.", "venue": "International Symposium on Computing and Networking - Across Practical Development and Theoretical Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "2020 Eighth International Symposium on Computing and Networking (CANDAR)", "pages": "95-100"}, "authors": [{"authorId": "1403869639", "name": "Ángel Dacal-Nieto"}, {"authorId": "49385124", "name": "J. J. Areal"}, {"authorId": "2069594185", "name": "Miguel García-Fernández"}, {"authorId": "2069650525", "name": "Marcos Lluch"}], "citations": []}
