{"paperId": "1a566f555fc5d0f110196cbe7678b8809b3835a9", "publicationVenue": {"id": "1f7c3e93-2594-4cc3-b957-e6b6d8c6365e", "name": "Business Excellence and Management", "alternate_names": ["Bus Excell Manag"], "issn": "2248-1354", "url": "http://beman.ase.ro/"}, "title": "HOW ANALYTICS CAN IMPROVE LOGISTICS AND SUPPLY CHAIN IN MULTINATIONAL COMPANIES: PERSPECTIVES FROM EUROPE AND AMERICA", "abstract": "The research is focused on the role of big data analytics in logistics of transportation in multinational companies across the world. It shows new opportunities for current supply chain practices, while adding operational excellence and value. A survey was carried out among staff members of multinational companies from the Americas, and Europe. For the statistical investigation of survey data, an equation modeling was used. Results reveal that demand management, seller rating, and vendor satisfaction are the most important factors. The study also found that analytics affect efficiency, operational excellence, customer service, and cost savings in the supply chain industry. The goal is to reduce the gap between demand management and supply chain management by improving customer satisfaction, visibility, and visibility. The big data can produce substantial value added and monetary gains for companies and will quickly become common throughout the industry.", "venue": "Business Excellence and Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-09-15", "journal": {"name": "BUSINESS EXCELLENCE AND MANAGEMENT"}, "authors": [{"authorId": "2165360940", "name": "M. Sazu"}, {"authorId": "2165356747", "name": "S. Jahan"}], "citations": [{"paperId": "5d7323563c934d6b0f47bf46ded3a4fe031a1bcf", "title": "Consumer Buying Behavior and ML: How Machine Learning and Analytics can Utilize Consumer Behavior Data for Better Customer Service?"}, {"paperId": "d473e4f84d89ba9d235a02e9eb2b6255bffcde01", "title": "Can Analytics Improve Manufacturing in Heavy Machinery Industry? Studies from Mexico"}, {"paperId": "d17d04f1583884853a456b875070952fc0cfd181", "title": "Data Driven Decision Making in Manufacturing Businesses in China and Asia Pacific"}, {"paperId": "40338f8f33a2aa16c8a877340ab8447e2f9e50f5", "title": "What makes Small and Medium Enterprises successful: A Study"}, {"paperId": "8f4890396450a854823577435722b60bb928ee65", "title": "How Data Analytics Drives Business Performance: A Study"}, {"paperId": "d50bafd50f70d8ad12f60b9478142d5964846cf8", "title": "How Credit Risk Management in Australia Can Affect Financial Institutions Growth: A Study"}, {"paperId": "df026abc5df7039422f06f827284a6acdac31dfd", "title": "Role of Analytics and Accounting Information Systems in Profitability"}, {"paperId": "72b020a65fc3894eb5e0ff11204f1d9cef578fe0", "title": "A grey decision-making trial and evaluation laboratory model for digital warehouse management in supply chain networks"}, {"paperId": "478dd1ec3a18032243a519ecb8e78c70d6f3c73f", "title": "How to increase customer satisfaction in FMCG industry using social media analytics"}, {"paperId": "f7c4c764c8168ae5c25f923be9524ed31f359a60", "title": "Large-scale manufacturing in North America: How machine learning and analytics improve efficiency"}, {"paperId": "b5c43c35b07bf1431049cdbb736b771cb8ee237a", "title": "Digital healthcare in Europe and efficient patient care: role of analytics"}, {"paperId": "c532bbaa2880f476f474565eee9f8a02855d7612", "title": "Financial innovation at large financial services businesses: Evidence from Eastern Europe"}, {"paperId": "1170c818c75982c347797ffad40d32cc64c84cca", "title": "How the dairy industry in North America is leveraging analytics for increased efficiency"}, {"paperId": "f1bba37dbaffd60be899ec272f35e9e8aff68db5", "title": "Analytics and innovation management: Does big data play any role?"}, {"paperId": "a56b41eeb156f0072cfd1df82d8ff10e3b443f90", "title": "Intelligent manufacturing with machine learning: A perspective of European home goods industry"}, {"paperId": "fd04de088613c4e096c78aba14707ed7c70abbed", "title": "A NALYTICS AND L OCALIZED M ANUFACTURING : H OW M ACHINE L EARNING CAN H ELP I MPROVE E FFICIENCY"}, {"paperId": "804e362d66bba3674bd060f42926e451cfb708d6", "title": "How analytics drive business performance and profitability"}, {"paperId": null, "title": "To analyze the choices of Big Health Data • To identify Big Data analytical strategies and technologies in healthcare"}, {"paperId": "b4f4a88b878ff391a008086f9af24873c37b2961", "title": "Retail analytics and firm profitability: How analytics can help retail companies be successful"}, {"paperId": "7b1c09d75bec5a9081d2748d700737ada539f279", "title": "Role of analytics in driving innovation in the insurance industry in developing countries"}, {"paperId": "5eef402535cc2b5cb8b482a00f6c0823c23e4b4d", "title": "Detecting banking frauds with analytics and machine learning"}, {"paperId": "c8db268a9a0d28f580ecbba24087ffc1dde396fb", "title": "How Innovation Plays a Role in Banking and Increases Profitability"}, {"paperId": "9c4a4ba1c01290cdcb8f49b916285ea545ab749a", "title": "Implementation of Big Data Analytics in Electronics Manufacturing Industry: Impact and Profitability"}, {"paperId": "08567b2372657e5b2653eb5fa13bb4d95b83eddf", "title": "Automotive Manufacturing Firms and Their Usage of Machine Learning to Drive Efficiency in Asia"}, {"paperId": "e2dbfcea3fecb5cb957644c4d07035e8962185d2", "title": "Decision-Making & Data Science: How Large Businesses Can Use Analytics to Shape Decisions"}, {"paperId": "be0846f463a22b06c9a562265dec51fc80c5cf20", "title": "How healthcare industry in Arabs can use data science for sustainable healthcare practices"}, {"paperId": "d5854a61b9d6600f56659ef5ca771b29226d110b", "title": "Information technology & supply chain management: role of big data on efficiency"}, {"paperId": "4f857354bd669831b60e00f9d6fa38ea06b094dc", "title": "Impact of IT & data analytics on cleaner manufacturing in Asia"}, {"paperId": "f1baf7faae9f9b1246028af23ad5bf8be6aec5a4", "title": "Role of IT & analytics on business performance"}, {"paperId": "77bb54027f54f16e585272cda07a1eed0568e864", "title": "Relationship between analytics and innovation in software based firms in Europe"}, {"paperId": "38b80516abba7c2238dcb0361cabdd27fae5aa79", "title": "How supply chain analytics improve business agility of manufacturing firms in Eastern Europe"}, {"paperId": "daf32bd5cc03c0fa61cdba9b574aac056d4bf753", "title": "Impact of analytics on supply chain management"}, {"paperId": "1b2a1a3b24553d12baa6fac804c648602a2df0e8", "title": "Healthcare and IoT devices: role of information technology in the healthcare industry"}, {"paperId": "c8e4dfd2cad9b7a3194d1818ce80dc6dca6a7e22", "title": "Big data and its role on fostering innovation in Asia"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "80c579ad09cb75f361da92e38fb5aa6070b4ceec", "title": "How analytics can impact firm performance in Japanese software companies"}, {"paperId": "eb27b31089b9e72153e60bdb71a16ed07fa5c69f", "title": "Impact of big data analytics & machine learning on innovation of manufacturing companies"}, {"paperId": "3c696b9ea606cabbcc288cddc70a3dca55c40a2f", "title": "Role of data analytics in supply chain for improving customer satisfaction and profitability"}, {"paperId": "1826c4791e0ae5533931d2d58889702c842c04dc", "title": "H EALTHCARE A NALYTICS IN N ON - PROFITS : E VIDENCE FROM N ORTH A MERICA"}, {"paperId": "1fd173b1736d8ee99b76a6691879092868551b71", "title": "GAP iNTERDISCIPLINARITIES"}, {"paperId": "a4ba1b7fbd805ceee7de19095bcbcd4904ac06dd", "title": "B USINESSES I NNOVATION & AI-H OW AI AND A NALYTICS CAN E NCOURAGE I NNOVATION"}]}
