{"paperId": "1a5b79c2b76755cb57d2f841c87e6afbcfdb616a", "publicationVenue": {"id": "dc6419f3-98b3-4718-bba0-6b6d6c3d192b", "name": "JMIR Medical Informatics", "type": "journal", "alternate_names": ["JMIR med informatics", "JMIR medical informatics", "JMIR Med Informatics"], "issn": "2291-9694", "url": "https://medinform.jmir.org/"}, "title": "Exploring Fever of Unknown Origin Intelligent Diagnosis Based on Clinical Data: Model Development and Validation", "abstract": "Background Fever of unknown origin (FUO) is a group of diseases with heterogeneous complex causes that are misdiagnosed or have delayed diagnoses. Previous studies have focused mainly on the statistical analysis and research of the cases. The treatments are very different for the different categories of FUO. Therefore, how to intelligently diagnose FUO into one category is worth studying. Objective We aimed to fuse all of the medical data together to automatically predict the categories of the causes of FUO among patients using a machine learning method, which could help doctors diagnose FUO more accurately. Methods In this paper, we innovatively and manually built the FUO intelligent diagnosis (FID) model to help clinicians predict the category of the cause and improve the manual diagnostic precision. First, we classified FUO cases into four categories (infections, immune diseases, tumors, and others) according to the large numbers of different causes and treatment methods. Then, we cleaned the basic information data and clinical laboratory results and structured the electronic medical record (EMR) data using the bidirectional encoder representations from transformers (BERT) model. Next, we extracted the features based on the structured sample data and trained the FID model using LightGBM. Results Experiments were based on data from 2299 desensitized cases from Peking Union Medical College Hospital. From the extensive experiments, the precision of the FID model was 81.68% for top 1 classification diagnosis and 96.17% for top 2 classification diagnosis, which were superior to the precision of the comparative method. Conclusions The FID model showed excellent performance in FUO diagnosis and thus would be a potentially useful tool for clinicians to enhance the precision of FUO diagnosis and reduce the rate of misdiagnosis.", "venue": "JMIR Medical Informatics", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-28", "journal": {"name": "JMIR Medical Informatics", "volume": "8"}, "authors": [{"authorId": "3078381", "name": "Huizhen Jiang"}, {"authorId": "2110454932", "name": "Yuanjie Li"}, {"authorId": "46413516", "name": "Xuejun Zeng"}, {"authorId": "2072804872", "name": "N. Xu"}, {"authorId": "2218789531", "name": "Congpu Zhao"}, {"authorId": "2155704920", "name": "Jing Zhang"}, {"authorId": "48506529", "name": "Weiguo Zhu"}], "citations": [{"paperId": "25f84399c4b62b87defe6d9da7dbab0bd05c86aa", "title": "Recent advancement in integrating artificial intelligence and information technology with real‐world data for clinical decision‐making in China: A scoping review"}, {"paperId": "b19fae18a05519fde6868ef5546d8d82eb9fc4a5", "title": "Integrating Medical Domain Knowledge for Early Diagnosis of Fever of Unknown Origin: An Interpretable Hierarchical Multimodal Neural Network Approach"}, {"paperId": "a1b2f11ea83c69e16d16fad756f14bf46679811b", "title": "Application of Transformers based methods in Electronic Medical Records: A Systematic Literature Review"}, {"paperId": "3ab36b38d13240592b271d9a826c8d356769c940", "title": "Rheumatic disorders among patients with fever of unknown origin: A systematic review and meta-analysis."}, {"paperId": "ce589c77ee1aa4a130134638a1a43c139a71d4bf", "title": "Application of Machine Learning for the Prediction of Etiological Types of Classic Fever of Unknown Origin"}, {"paperId": "fb42a3d55670981679dab08fabedb49ded11bca3", "title": "Machine Learning for Multimodal Electronic Health Records-based Research: Challenges and Perspectives"}, {"paperId": "49c85e18c682746215009a179a447c8634a2cb67", "title": "Transfer learning for non-image data in clinical research: A scoping review"}]}
