{"paperId": "1a619067e4e15367b6f0ba63c2bb058f9c838781", "publicationVenue": null, "title": "AN APPROACH TO CRIME DATA ANALYSIS: A SYSTEMATIC REVIEW", "abstract": "In the current era, number of crimes occurs in the society and this criminal rate increase day by day. There is tremendous growth of criminal data. Crime has negatively influenced the societies. Crime control is essential for the welfare, stability and development of society. Law enforcement agencies are seeking for the system to target crime structure efficiently. The intelligent crime data analysis provides the best understanding of the dynamics of unlawful activities, discovering patterns of criminal behavior that will be useful to understand where, when and why crimes can occur. There is a need for the advancements in the data storage collection, analysis and algorithm that can handle data and yield high accuracy. This paper demonstrates the data mining technologies which are used in criminal investigation. The contribution of this paper is to highlight the methodology used in crime data analytics. This paper summarizes the challenges arising during the analysis process, which should be removed to get the desired result.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-04-27", "journal": {"name": "", "pages": "67-74", "volume": "5"}, "authors": [{"authorId": "16166909", "name": "Deepika Tyagi"}, {"authorId": "2146391279", "name": "Sanjiv Sharma"}], "citations": [{"paperId": "7fee296647fb98fd1c22993f6206caa174807d5c", "title": "The forensic information identification based on machine learning algorithms"}, {"paperId": "2544d8b30481a24be4b19c5322ffde1a7f2a0ea3", "title": "Development of a Predictive Model of Burgling to Homes based on Machine Learning"}, {"paperId": "7d34242acfc7365346779d0ce84c1b6a6489b70d", "title": "Social Media Comment Classification and Crime Forecasting"}, {"paperId": "588a5f5d2b0dc5dcd1155ef4614238a1f704e6e6", "title": "Application of the method of computer forensic simulation of crimes in the course of an armed conflict"}, {"paperId": "19c993c4b988f6e0783dd0a5593f8cc5e75a47eb", "title": "E2E-VSDL: End-to-end video surveillance-based deep learning model to detect and prevent criminal activities"}, {"paperId": "5d1797987692b0be3e84abee0c3a37d1b7b50913", "title": "Crime forecasting: a machine learning and computer vision approach to crime prediction and prevention"}, {"paperId": "d0d1a0e8c070f9b8a3badc22ec618a09c00804dd", "title": "Crime Analysis and Intelligence System Model Design using Big Data"}, {"paperId": "261973cdead565690a0d5bd02fb7dcf6830eae61", "title": "CRIME REDUCTION SYSTEM THROUGH BRYNE CRIMINAL JUSTICE INNOVATION"}, {"paperId": "824a7623cf6347fc2ba1dfb7597a9ba29c012c5d", "title": "A Thorough Analysis of Machine Learning and Deep Learning Methods for Crime Data Analysis"}, {"paperId": "b1d7b65afa5642c63485ae6e15f2f65867c3ac85", "title": "Special features of criminal statistics of criminality in the field of sport"}, {"paperId": "c200abfe6f2cb9edc256a7fc22c4071b9a181675", "title": "Application of Social Big Data in Crime Data Mining"}]}
