{"paperId": "1a61c7054fe19b2ea43c6f93f7b2cee270cfb7ab", "publicationVenue": null, "title": "Real time Pothole Detection System – An Application facilitating public safety", "abstract": "Roadside potholes are dangerous and jeopardize the security of both automobiles and passengers. This is one of the primary causes of traffic incidents, which result in the fatalities and injuries, in the majority of emerging regions. It's necessary to endlessly gather and update info on the foremost recent road surfaces in order that travelers may be urged to require detours and also the accountable authority will act quickly to repair potholes for the convenience of passengers. The objective of this research is to investigate the capabilities of deep learning techniques and to implement the most effective deep learning approach for hollow detection on sensible objects. Using an Android smartphone, a straightforward and effective system that we name the Pothole Detection System takes images of potholes and uploads them to the acceptable server. For locating potholes on Google Maps, it conjointly makes use of world positioning system. The Planned algorithm is additionally contrasted with six models- SVM, ANN, KNN, and 3 previously trained well known CNN models VGG16, VGG19, YOLOv4 with perspective of its production indicators in order to determine its efficacy. When compared to the earlier methods, the intended model is more accurate. The framework is valid on many photos of potholes, and it acknowledges with a decent degree of exactness.", "venue": "2023 International Conference on Intelligent and Innovative Technologies in Computing, Electrical and Electronics (IITCEE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-27", "journal": {"name": "2023 International Conference on Intelligent and Innovative Technologies in Computing, Electrical and Electronics (IITCEE)", "pages": "389-395"}, "authors": [{"authorId": "143831896", "name": "L. Panda"}, {"authorId": "2213994135", "name": "Kanneganti Bhavya Sri"}, {"authorId": "2210899339", "name": "Reeja S R"}], "citations": []}
