{"paperId": "1a6a71d38512f60db520646487fa2046f7867203", "publicationVenue": null, "title": "BiGeo: A Foundational PaaS Framework for Efficient Storage, Visualization, Management, Analysis, Service, and Migration of Geospatial Big Data - A Case Study of Sichuan Province, China", "abstract": "With the rapid development of big data, numerous industries have turned their focus from information research and construction to big data technologies. Earth science and geographic information systems industries are highly information-intensive, and thus there is an urgent need to study and integrate big data technologies to improve their level of information. However, there is a large gap between existing big data and traditional geographic information technologies. Owing to certain characteristics, it is difficult to quickly and easily apply big data to geographic information technologies. Through the research, development, and application practices achieved in recent years, we have gradually developed a common geospatial big data solution. Based on the formation of a set of geospatial big data frameworks, a complete geospatial big data platform system called BiGeo was developed. Through the management and analysis of massive amounts of spatial data from Sichuan Province, China, the basic framework of this platform can be better utilized to meet our needs. This paper summarizes the design, implementation, and experimental experience of BiGeo, which provides a new type of solution to the research and construction of geospatial big data.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-12", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "449", "volume": "8"}, "authors": [{"authorId": "2110720196", "name": "Xi Liu"}, {"authorId": "48442392", "name": "Lina Hao"}, {"authorId": "3350921", "name": "Wunian Yang"}], "citations": [{"paperId": "67f5490e67f2b83d566cc5798a0a3b5958333d85", "title": "Geospatial Big Data Platforms: A Comprehensive Review"}, {"paperId": "1c54c11f075429adefadc3ae04549f8d0a9b4dab", "title": "A Ceph-based storage strategy for big gridded remote sensing data"}, {"paperId": "d30698c378118ef7c82dc7a3eebc5985b01fc550", "title": "Comprehensive framework for the integration and analysis of geo-environmental data for urban geohazards"}, {"paperId": "a7655a9801083b84c2d78a3b952e4acdc9bfa37a", "title": "Hybrid storage engine for geospatial data using NoSQL and SQL paradigms"}, {"paperId": "b95b7602764486be2109a48902a9d39ed4cc9f2c", "title": "An Integrated Environmental Monitoring Approach through the Development of Coal Mine, a GIS Open Source Application"}]}
