{"paperId": "1a6f4495474f75ae1e8bbf407f70d9a874e5b4d6", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "The Pushshift Reddit Dataset", "abstract": "Social media data has become crucial to the advancement of scientific understanding. However, even though it has become ubiquitous, just collecting large-scale social media data involves a high degree of engineering skill set and computational resources. In fact, research is often times gated by data engineering problems that must be overcome before analysis can proceed. This has resulted recognition of datasets as meaningful research contributions in and of themselves.Reddit, the so called “front page of the Internet,” in particular has been the subject of numerous scientific studies. Although Reddit is relatively open to data acquisition compared to social media platforms like Facebook and Twitter, the technical barriers to acquisition still remain. Thus, Reddit's millions of subreddits, hundreds of millions of users, and billions of comments are at the same time relatively accessible, but time consuming to collect and analyze systematically.In this paper, we present the Pushshift Reddit dataset. Pushshift is a social media data collection, analysis, and archiving platform that since 2015 has collected Reddit data and made it available to researchers. Pushshift's Reddit dataset is updated in real-time, and includes historical data back to Reddit's inception. In addition to monthly dumps, Pushshift provides computational tools to aid in searching, aggregating, and performing exploratory analysis on the entirety of the dataset. The Pushshift Reddit dataset makes it possible for social media researchers to reduce time spent in the data collection, cleaning, and storage phases of their projects.", "venue": "International Conference on Web and Social Media", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-23", "journal": {"name": "ArXiv", "volume": "abs/2001.08435"}, "authors": [{"authorId": "2058611087", "name": "Jason Baumgartner"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "145832870", "name": "Brian Keegan"}, {"authorId": "3314746", "name": "Megan Squire"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}], "citations": [{"paperId": "fe498a23171656ac57297956fd557e21586f02ed", "title": "Predicting the Performance of Foundation Models via Agreement-on-the-Line"}, {"paperId": "0ef96db48c716188120d7d23020a2a154e3bc119", "title": "A Holistic Indicator of Polarization to Measure Online Sexism"}, {"paperId": "3c448b8dbd00d459e4b5b861302a2ce2398faa7c", "title": "Semantic change and socio-semantic variation: the case of COVID-related neologisms on Reddit"}, {"paperId": "097d26af3bd536537a9a679ca5e0156082e9ebf5", "title": "Can Large Language Models Identify Authorship?"}, {"paperId": "e33bd615b021ba90f87e02c036c3acae834d3893", "title": "Authorship Style Transfer with Policy Optimization"}, {"paperId": "4b1b52a631ec3aed6185aef5cee8cd34fd50dcab", "title": "Hybrid Human-LLM Corpus Construction and LLM Evaluation for Rare Linguistic Phenomena"}, {"paperId": "99a24c7f52625d5add31994268fa49cb8ddab620", "title": "Hierarchical graph fusion network and a new argumentative dataset for multiparty dialogue discourse parsing"}, {"paperId": "7644d9053eaa314dc5b439d15bb8a5cb1a393b79", "title": "Contrastive Hawkes graph neural networks with dynamic sampling for event prediction"}, {"paperId": "91b1d4b727be7fe2933a1b840f6eac0497ae7907", "title": "Clustering polycystic ovary syndrome laboratory results extracted from a large internet forum with machine learning"}, {"paperId": "38f4f27bfdc6cdc4c72d714a097541f1e6ca98f2", "title": "Inductive Graph Alignment Prompt: Bridging the Gap between Graph Pre-training and Inductive Fine-tuning From Spectral Perspective"}, {"paperId": "7418519415c830d876d0059d59df718eeb0babdc", "title": "Applying Named Entity Recognition and Graph Networks to Extract Common Interests from Thematic Subfora on Reddit"}, {"paperId": "1e81de58a48dd540e014eb0a80af619a0c899c31", "title": "Amplifying Training Data Exposure through Fine-Tuning with Pseudo-Labeled Memberships"}, {"paperId": "7798dc4f3fd72807d90219df0b95407a174be29a", "title": "Studying Differential Mental Health Expressions in India"}, {"paperId": "08436b3ddafd2edc798753ebc87f6ceffed6e8df", "title": "KnowTuning: Knowledge-aware Fine-tuning for Large Language Models"}, {"paperId": "81738232a8275b65cba357150a50b1856c6f97fe", "title": "Eliciting Personality Traits in Large Language Models"}, {"paperId": "8c93ba189dcab521acc2235beda592c0a89a6f2e", "title": "Teleoscope: Exploring Themes in Large Document Sets By Example"}, {"paperId": "13876ab6fb7ae5c778c787c17d9597624aedd2c1", "title": "A Longitudinal Study of Italian and French Reddit Conversations Around the Russian Invasion of Ukraine"}, {"paperId": "b88b25aba67d7a391eb480563fbfd5b4a6625444", "title": "Long Is More for Alignment: A Simple but Tough-to-Beat Baseline for Instruction Fine-Tuning"}, {"paperId": "1a524ddd684c9ac546183c5b0d6b67f7f7003817", "title": "Attention Allocation of Investors on Social Media: The Role of Prospect Theory"}, {"paperId": "d456a1b018616e9ffb1abc3a4ff250b99e1871ed", "title": "How do medical professionals make sense (or not) of AI? A social-media-based computational grounded theory study and an online survey"}, {"paperId": "d8fade54c037a639daaa99712aa7108c2ea89b75", "title": "Determining the Relativity of Word Meanings Through the Construction of Individualized Models of Semantic Memory."}, {"paperId": "1d0ae034eeabae8d3dfc215bed200d4b44c8b895", "title": "Balancing Brand Safety and User Engagement in a Two-Sided Market: An Analysis of Content Monetization on Reddit"}, {"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "41f89534a229aeb7ed28b9a19a3648217e9d709e", "title": "The causal role of the Reddit collective action on the GameStop short squeeze"}, {"paperId": "ef39c22e3c5cb25ab8f3424bf516bca4904f880c", "title": "Assembling a multi-platform ensemble social bot detector with applications to US 2020 elections"}, {"paperId": "d56fed75c01c6bfb3f37a59f95f174c2b93c5cda", "title": "Jump off the Bandwagon? Characterizing Bandwagon Fans' Future Loyalty in Online NBA Fan Communities"}, {"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}, {"paperId": "5c3bed9da03933d5e6efe28b4ed5ca8885882ddb", "title": "MetaHate: A Dataset for Unifying Efforts on Hate Speech Detection"}, {"paperId": "73081c0d391f057e89b21347860c89cd09c1d2b1", "title": "Few-Shot Detection of Machine-Generated Text using Style Representations"}, {"paperId": "de4dfb773ab455081e5fb1862e08f581c58d43bc", "title": "Risk Taxonomy, Mitigation, and Assessment Benchmarks of Large Language Model Systems"}, {"paperId": "9a12d0ebd5c68bc00848509ff6a451f3a1da0c4d", "title": "Do users adopt extremist beliefs from exposure to hate subreddits?"}, {"paperId": "2e3104c19fd9d0d1e968360c20a5efe2edbe9808", "title": "Mapping cognitive place associations within the United Kingdom through online discussion on Reddit"}, {"paperId": "c9c322288f06976b11879baf566a8de040cf5e35", "title": "German Text Embedding Clustering Benchmark"}, {"paperId": "efc5e94635a850ede9c1f8dbce65d5dc536f3bfb", "title": "Understanding LLMs: A Comprehensive Overview from Training to Inference"}, {"paperId": "820ec3c61b310058052da3812001bedc11a34902", "title": "Characterizing Fake News Targeting Corporations"}, {"paperId": "df2a9ca62d957c01bceb2f2d6e75c8e512c3806c", "title": "Finding Subgraphs with Maximum Total Density and Limited Overlap in Weighted Hypergraphs"}, {"paperId": "412526fdaa3bff930f959718973a907b9ec155b2", "title": "Demographic-Based Public Perception Analysis of Electric Vehicles on Online Social Networks"}, {"paperId": "850ed59753166202c8047ca6a639cc4f24219dd5", "title": "COVID-19 and the decline of active social media engagement"}, {"paperId": "a6ff42900f660427bb7c96cd2afff7ccd1d8e1e7", "title": "The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media"}, {"paperId": "d87f10aeab9fa14344c6393759e44269b80b4c56", "title": "More than Just a Diagnosis: A Multi-Task Approach to Analyzing Bipolar Disorder on Reddit via DeMHeM"}, {"paperId": "9d6d24823c6f0eac87afa66a0df3869bac3956e9", "title": "Unveiling Conversational Patterns: Intent Classification and Clustering in Reddit’s Firearm Trade Community"}, {"paperId": "7d2588950aea6e7899f1e3fae9684688b4b3977d", "title": "Studying social anxiety without triggering it: Establishing an age-controlled cohort of social media users for observational studies"}, {"paperId": "93d3a40d031bd246ee023e0724a179f489a11bdc", "title": "A multilayer network-based framework for investigating the evolution and resilience of multimodal social networks"}, {"paperId": "f8b143a76f2662bf78109f8583fd3ddb46457676", "title": "Measuring Misogyny in Natural Language Generation: Preliminary Results from a Case Study on two Reddit Communities"}, {"paperId": "aac83deb068875d2dffb58b2c8fdeffc6ad2a38a", "title": "A First Look at Toxicity Injection Attacks on Open-domain Chatbots"}, {"paperId": "3af4a80aa08f7bd34c0a0635a121946493df332a", "title": "Who can help me? Reconstructing users' psychological journeys in depression-related social media interactions"}, {"paperId": "3887552e9b48c2d0091d9332a0e6457e2912576c", "title": "Passive data collection on Reddit: a practical approach"}, {"paperId": "0e53c89da6a244fcead452632cab5f5c7965db75", "title": "A Study of Partisan News Sharing in the Russian invasion of Ukraine"}, {"paperId": "422e4b666cbd4dd287a458b8b559cd2426a4f60d", "title": "Safer-Instruct: Aligning Language Models with Automated Preference Data"}, {"paperId": "85c70db6659dbda53766f6cc8918cb79fb0ce6ba", "title": "Temporal Graph Representation Learning with Adaptive Augmentation Contrastive"}, {"paperId": "7287660aba70424835658cd4a30901f137833f2e", "title": "Enhancing Automated Hate Speech Detection: Addressing Islamophobia and Freedom of Speech in Online Discussions"}, {"paperId": "4aa51d6f29d741b9a52e66706196dbe0b9acfdf9", "title": "Investigating the emotional experiences in eSports spectatorship: The case of League of Legends"}, {"paperId": "93c1f788c5474d24db4fb72de5845ab0ac70c1c8", "title": "FLICs (Facebook Language Informal Corpus): a novel dataset for informal language"}, {"paperId": "84048f9c8e0f1655674483313835ab3382b9eb3b", "title": "Fan tokens: Sports and speculation on the blockchain"}, {"paperId": "6475cc4052e4778f6fb098ea9993018f545b6bf9", "title": "Measuring the Rise and Fall of a Subreddit using Text Analytics: The Life Course of r/Antiwork"}, {"paperId": "b37690747ba314455b8a992e794b25223e105d1c", "title": "BLESS: Benchmarking Large Language Models on Sentence Simplification"}, {"paperId": "d2af7f63861ad683b061b508316624615bff162d", "title": "Conversation Chronicles: Towards Diverse Temporal and Relational Dynamics in Multi-Session Conversations"}, {"paperId": "ea6c0620f4d56faa76a8f99d8963ad77fa6fbdb8", "title": "Copyright Violations and Large Language Models"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "d1b6ff418b4cfaab542b9c39dae20c44e374eac0", "title": "Using the Anna Karenina Principle to explain why cause favors negative-sentiment complements"}, {"paperId": "0a888711461571ae87838999c3272fd24b8e784f", "title": "Multi-Stage Pre-training Enhanced by ChatGPT for Multi-Scenario Multi-Domain Dialogue Summarization"}, {"paperId": "38fecb7c5b5f0d16c0f89212aecf6829797ac835", "title": "Evolution of Rules in Reddit Communities"}, {"paperId": "6acca2882b906bcf58d334e331bc93f2da7e8ba7", "title": "Moral consensus and divergence in partisan language use"}, {"paperId": "aa853d6ddf598266a4c48647dae7b0a8e8a8ff49", "title": "User Inference Attacks on Large Language Models"}, {"paperId": "81fbcc56cbf23534c8a00e4facc1d8fcbaac0318", "title": "Mental health concerns precede quits: shifts in the work discourse during the Covid-19 pandemic and great resignation"}, {"paperId": "b1ece182d4934dfc629ca409ef78e56c1762965c", "title": "On the Impact of Cross-Domain Data on German Language Models"}, {"paperId": "0e9270c07f910242fa39b69295125c6c5729615e", "title": "Data Augmentation with Large Language Models for Vietnamese Abstractive Text Summarization"}, {"paperId": "9caef8b62da29337aa283f9fb8870ac76779b446", "title": "The social media discourse of engaged partisans is toxic even when politics are irrelevant"}, {"paperId": "50b1fe279fe57dd5e8a69acc75f7df7ef543e705", "title": "Online Health Information Wants of Caregivers for Persons With Dementia in Social Media"}, {"paperId": "b021383084dd7a1f7470c18534ba8f50d400d7ff", "title": "No Space for Reddit Spacing: Mapping the Reflexive Relationship Between Groups on 4chan and Reddit"}, {"paperId": "e7de0df6ae1f8eb95d34f4bb6e6a39044bdec882", "title": "We have always been social: Comparing social expressiveness between single-player and multiplayer gamers"}, {"paperId": "f095789a23c4a89a61d06c18208c30fd7820d9a7", "title": "Exploring the Effects of Event-induced Sudden Influx of Newcomers to Online Pop Music Fandom Communities: Content, Interaction, and Engagement"}, {"paperId": "61d8bcc5cf12d5e6a05ed32c8869c715611353fe", "title": "A computational text analysis investigation of the relation between personal and linguistic agency"}, {"paperId": "77666a5ce2ced6536d302c7018580d9cbfe62eda", "title": "Here Be Livestreams: Trade-offs in Creating Temporal Maps of Reddit"}, {"paperId": "482c4074a0ab09438cb6822c138ae3e89c979e4c", "title": "Text Embeddings and Clustering for Characterizing Online Communities on Reddit"}, {"paperId": "553d85e202fdbdd4101673b9205135b8eb94811d", "title": "Recovering from Privacy-Preserving Masking with Large Language Models"}, {"paperId": "e037a6a65f5ac25018c593bc23e14fb32e438304", "title": "Artificially Intelligent Opinion Polling"}, {"paperId": "0ecc68fd1070a41ffa2979000766e2a00653a7ba", "title": "Temporal Arcs of Mental Health: Patterns Behind Changes in Depression over Time"}, {"paperId": "110804428354df709b3693f9efc81946a9036ebf", "title": "Neurons in Large Language Models: Dead, N-gram, Positional"}, {"paperId": "33093952c934beb32dca905193970d240b508042", "title": "RDGSL: Dynamic Graph Representation Learning with Structure Learning"}, {"paperId": "d76b9e8d4e1cd64bf3ae8cbc567c510cb9dd2c7d", "title": "Public perception of electric vehicles on Reddit and Twitter: A cross-platform analysis"}, {"paperId": "10b083fb9d9ee181a250afa96442c69f5adf263e", "title": "Entrepreneurial Struggle: A Natural Language Processing Approach"}, {"paperId": "32e39ebcc36199d6b8461f6cb987c1acc97fcb27", "title": "A study towards contextual understanding of toxicity in online conversations"}, {"paperId": "894ed1aba8e42a4ec27ba53ecde383b14c5128ca", "title": "Examining User-Friendly and Open-Sourced Large GPT Models: A Survey on Language, Multimodal, and Scientific GPT Models"}, {"paperId": "11cf88dce827bd67cbfa60400306318022e736d5", "title": "D4: Improving LLM Pretraining via Document De-Duplication and Diversification"}, {"paperId": "04e9416c7496e8c2d72df7b7a03bf37080adb974", "title": "The Challenges of Machine Learning for Trust and Safety: A Case Study on Misinformation Detection"}, {"paperId": "b572b5d2ffbfe797537665f456d9456ab0666d94", "title": "Can Authorship Representation Learning Capture Stylistic Features?"}, {"paperId": "3808ca24161d24b714024655782ea51c3ee49ed1", "title": "'Most people have no idea what autism is': Unpacking autism disclosure using social media analysis."}, {"paperId": "1c486c97e49c53dd0350131da6d962a4ab43845d", "title": "Identifying COVID-19 cases and extracting patient reported symptoms from Reddit using natural language processing"}, {"paperId": "f0950a3f27c0fefffba60ae1c9a8ee360d5eb55f", "title": "Instruction Tuning for Large Language Models: A Survey"}, {"paperId": "6eee67523ccd3e464513160c4197bc526ef9a9bd", "title": "Wisdom of the Crowds or Ignorance of the Masses? A data-driven guide to WSB"}, {"paperId": "0f93119bc2f7d501b30ab06877012229091bd582", "title": "Characterizing Information Seeking Events in Health-Related Social Discourse"}, {"paperId": "05c9f3caeeb1f0c2a763221e9054d94d15e11e7d", "title": "Graph Neural Network Operators: a Review"}, {"paperId": "d755acd2392e0783fea21424c7f5024a6f92bc6a", "title": "Attention-grabbing news coverage: Violent images of the Black Lives Matter movement and how they attract user attention on Reddit"}, {"paperId": "977b7214856aa54ab03ab31fa321f4bd646e63c5", "title": "TUBERAIDER: Attributing Coordinated Hate Attacks on YouTube Videos to their Source Communities"}, {"paperId": "7f55ef29a6f8b2771c5435bbeba29c87264fdc88", "title": "Shepherd: A Critic for Language Model Generation"}, {"paperId": "1104d766527dead44a40532e8a89444d9cef5c65", "title": "\"Do Anything Now\": Characterizing and Evaluating In-The-Wild Jailbreak Prompts on Large Language Models"}, {"paperId": "9a449d25793e97265df2aa63c0f5362556373910", "title": "Behaviour and Bot Analysis on Online Social Networks: Twitter, Parler, and Reddit"}, {"paperId": "f501b4b341a58f37aaf00b4936d0a9a26138bcbe", "title": "Tracing thick and thin concepts through corpora"}, {"paperId": "c9422b80a5279d9e0bce6694d5b2805ab5eabdae", "title": "Shaping Online Dialogue: Examining How Community Rules Affect Discussion Structures on Reddit"}, {"paperId": "c22a4be89e590aa794b5cca36c3f7c775983d833", "title": "Computing recommendations from free-form text"}, {"paperId": "7d7d70cdc1c954157fefff35a1a38557167369bf", "title": "Time-Series Clustering for Determining Behavioral-Based Brand Loyalty of Users Across Social Media"}, {"paperId": "9232bd68bd205f68c2f700316a302cbec878696c", "title": "Comparing the Discussion of Telehealth in Two Social Media Platforms: Social Listening Analysis"}, {"paperId": "979dfafb2acd0056a164729783f5cc8ca6764fdf", "title": "Understanding decentralized autonomous organizations from the inside"}, {"paperId": "6c4826e7022a07d5fb41fbaed2a825919797ce92", "title": "“Help! I need some music!”: Analysing music discourse & depression on Reddit"}, {"paperId": "f196c821ee9560563a1ae7acc6053d754317e2a6", "title": "Analyzing Social Media Data Using Sentiment Mining and Bigram Analysis for the Recommendation of YouTube Videos"}, {"paperId": "7be3256b94667b233b2c0ac343c423c03d2e6fe8", "title": "Understanding Multi-Turn Toxic Behaviors in Open-Domain Chatbots"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}, {"paperId": "ca31b8584b6c022ef15ddfe994fe361e002b7729", "title": "A Comprehensive Overview of Large Language Models"}, {"paperId": "e0ab06855dad25c16b442adb7ef8ddf8dfa03943", "title": "Internet Wizard for Enhancing Open-Domain Question-Answering Chatbot Knowledge Base in Education"}, {"paperId": "0822f1f831832676967eb61c2fd8f54fddab1e59", "title": "Dream Content Discovery from Reddit with an Unsupervised Mixed-Method Approach"}, {"paperId": "877d0bb86f6935825953f7f0ba2e8f80a4f67d54", "title": "Automated Natural Language Processing-Based Supplier Discovery for Financial Services."}, {"paperId": "ce0535fed73902590c08c7bb7928dce9c7873a18", "title": "Exploring Linguistic Style Matching in Online Communities: The Role of Social Context and Conversation Dynamics"}, {"paperId": "9f5ac3c9ce8d8ea095e83dae2de29694148429d1", "title": "Your spouse needs professional help: Determining the Contextual Appropriateness of Messages through Modeling Social Relationships"}, {"paperId": "ff1ee3bfe7a724df9d7e0639a3e8d6b0fde1e593", "title": "Content recommendation with two-level TransE predictors and interaction-aware embedding enhancement: An information seeking behavior perspective"}, {"paperId": "10449fd1d346fa82d5e92f428339332cc4763bab", "title": "Pre-pandemic activity on a myalgic encephalomyelitis/chronic fatigue syndrome support forum is highly associated with later activity on a long COVID support forum for a variety of reasons: A mixed methods study"}, {"paperId": "778cd4ce7192310a8a4eaae3f2caacebbd340916", "title": "COVID-19 and Sinophobia: Detecting Warning Signs of Radicalization on Twitter and Reddit"}, {"paperId": "9bfe3af132079ac8dba8d8805e55bd226bca7783", "title": "The Ethics of Publicly Available Data Research: A Situated Ethics Framework for Reddit"}, {"paperId": "33407f172df978a2134f68702c88e68763bbe2a6", "title": "Tube2Vec: Social and Semantic Embeddings of YouTube Channels"}, {"paperId": "ac32a852a3107f0d867c928c20287313505c6196", "title": "Community and Opinion Leadership Effects on Vaping Discourse: A Network Analysis of Online Reddit Threads"}, {"paperId": "c05fc620a531c41e0cb3e6e9b49cad689a8e1407", "title": "Even pseudonyms and throwaways delete their Reddit posts"}, {"paperId": "438a0221379aacd53f4d8af3b44dfdb2cc3ddab0", "title": "Language models are not naysayers: an analysis of language models on negation benchmarks"}, {"paperId": "9cab8c423d9c13d4f35beb97a7f823c250e8f059", "title": "RECAP: Retrieval-Enhanced Context-Aware Prefix Encoder for Personalized Dialogue Response Generation"}, {"paperId": "0b6edce3dde7e502c6b7c6d83bac0230ec912482", "title": "Improving Open Language Models by Learning from Organic Interactions"}, {"paperId": "271de6816367398ff5c3619e3b061b414388cd8c", "title": "Information Flow Control in Machine Learning through Modular Model Architecture"}, {"paperId": "8a9d1bf3f9d55c67fc4b04631f616a44d2448d86", "title": "Targeted Training for Multi-organization Recommendation"}, {"paperId": "be831248bfda5dfb604ea1676f767e5af6be500f", "title": "Structural Similarities Between Language Models and Neural Response Measurements"}, {"paperId": "080efdd117e5a9816ba00362600eaa1589c6ec9e", "title": "Improving Mental Health Classifier Generalization with Pre-diagnosis Data"}, {"paperId": "889a16582c4b77289ead8b4c900eeb0cb62b05b5", "title": "The Pursuit of Peer Support for Opioid Use Recovery on Reddit"}, {"paperId": "36195ad1ee99c0b0a3c5770a0b15ef889db4b17e", "title": "Investigating Code Generation Performance of ChatGPT with Crowdsourcing Social Data"}, {"paperId": "1e3d68551eb8d2b9a21fbbd9259863db54eae068", "title": "Analysis of Moral Judgment on Reddit"}, {"paperId": "e235880d1ca5465de44c22baa48e4f083be7aa77", "title": "A Call for Standardization and Validation of Text Style Transfer Evaluation"}, {"paperId": "5afac4bb07cbe4ae8f0f90ff0d026b4568697166", "title": "On the Effectiveness of Features for Predicting User Churn in Reddit Communities"}, {"paperId": "7ad6b98f2391a33100d36d7a78a0ea3e29a7de03", "title": "Online reading habits can reveal personality traits: towards detecting psychological microtargeting"}, {"paperId": "04e5d38662022bd5adbde8c6d0bee3b6cb3a0f48", "title": "Using Transformer-Based Topic Modeling to Examine Discussions of Delta-8 Tetrahydrocannabinol: Content Analysis"}, {"paperId": "b67b823380593e54721d73066c0a19b51aef6fda", "title": "CrisisFACTS: Buidling and Evaluating Crisis Timelines"}, {"paperId": "3604797e3a6316f1be9649fe62ddeef762f718b3", "title": "On the relevance of APIs facing fairwashed audits"}, {"paperId": "ae846b1ba5606d63faef3234ea2cd384a0bcbf93", "title": "The Dimensions of Data Labor: A Road Map for Researchers, Activists, and Policymakers to Empower Data Producers"}, {"paperId": "1567bcac0ab09269c9d0ff33c9a406132417fab9", "title": "A Pretrainer's Guide to Training Data: Measuring the Effects of Data Age, Domain Coverage, Quality, & Toxicity"}, {"paperId": "44a5a031c2487bca581a8cfc8013a026200aa6b0", "title": "Causal Document-Grounded Dialogue Pre-training"}, {"paperId": "416d95170cd73d00d72847b2a34c0c39f28621fe", "title": "Exploiting Biased Models to De-bias Text: A Gender-Fair Rewriting Model"}, {"paperId": "546d0624adfc6e18fb87d8cc77e7705bb9ea7445", "title": "LIMA: Less Is More for Alignment"}, {"paperId": "233b18336720a311fd7c82b70481584c8c7edb87", "title": "“I’m fully who I am”: Towards Centering Transgender and Non-Binary Voices to Measure Biases in Open Language Generation"}, {"paperId": "f9128b360de74811bf964ddc7c045ef67a70b31e", "title": "Boosting Distress Support Dialogue Responses with Motivational Interviewing Strategy"}, {"paperId": "412ac5d9b01b66bd865010be03d78b58fd2b4da5", "title": "Operationalizing content moderation \"accuracy\" in the Digital Services Act"}, {"paperId": "4e9e247c32edffe85adf53c8ec760be940183ee4", "title": "Machine-Made Media: Monitoring the Mobilization of Machine-Generated Articles on Misinformation and Mainstream News Websites"}, {"paperId": "5471114e37448bea2457b74894b1ecb92bbcfdf6", "title": "From Pretraining Data to Language Models to Downstream Tasks: Tracking the Trails of Political Biases Leading to Unfair NLP Models"}, {"paperId": "65ad1776ba016f66d2507234c450af79375bf67d", "title": "Investigating Substance Use via Reddit: Systematic Scoping Review"}, {"paperId": "f300e98aea22d684f7ad7e11f03c618fceba3421", "title": "Praise or Insult? Identifying Cyberbullying Using Natural Language Processing"}, {"paperId": "cce1a0b71db567af283b056edb9ed5b5286fd0ba", "title": "Towards A Platform and Benchmark Suite for Model Training on Dynamic Datasets"}, {"paperId": "de1c3794b15bd62409df6cf8407ab1cbb0fb0c67", "title": "The Design and Operation of Digital Platform under Sociotechnical Folk Theories"}, {"paperId": "ecf63f7b3874998d4f8d6b95b0698b573c5bb8cb", "title": "A framework for investigating the dynamics of user and community sentiments in a social platform"}, {"paperId": "410b51dce3d4ca297c79c982967f735dff9c307f", "title": "Natural Language Processing for Large-Scale Analysis of Eczema and Psoriasis Social Media Comments"}, {"paperId": "4034cfaa803c483a60c41202cfecac8aefa2682c", "title": "The Impact of ChatGPT on Streaming Media: A Crowdsourced and Data-Driven Analysis using Twitter and Reddit"}, {"paperId": "01f3db612acf054747848f1cdcc0a4cf3db974e5", "title": "Beyond Phish: Toward Detecting Fraudulent e-Commerce Websites at Scale"}, {"paperId": "6236d5f6be4782c6aff0c1ac5ae2b8084082d501", "title": "“It’s up to the Consumer to be Smart”: Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit"}, {"paperId": "6aca4077892849600584454449151b9b00bdac11", "title": "Language on Reddit Reveals Differential Mental Health Markers for Individuals posting in Immigration Communities"}, {"paperId": "c368b491939d741268e9b6fbc2dcab7daf181408", "title": "Detecting Symptoms of Depression on Reddit"}, {"paperId": "55f12284ee4e8996e35a9723fee279640c1d2a20", "title": "Understanding the Behaviors of Toxic Accounts on Reddit"}, {"paperId": "82beb8a86d438e85a134182128d47607b1b04004", "title": "Multi-Party Chat: Conversational Agents in Group Settings with Humans and Models"}, {"paperId": "db4572f54ae6a1a6cae43f7a1b897a8362cc2ea7", "title": "The role of the big geographic sort in online news circulation among U.S. Reddit users"}, {"paperId": "2ce3253fa3892b1820b672437359b29ff1ca0bb4", "title": "Users volatility on Reddit and Voat"}, {"paperId": "d2d0eae8ba21b019d7c446055f00d4e3c68975cb", "title": "Reddit in the Time of COVID"}, {"paperId": "1ff865a0b9604cd15d1e79f8cf59ddcf34391252", "title": "Scoping the Priorities and Concerns of Parents: Infodemiology Study of Posts on Mumsnet and Reddit"}, {"paperId": "05ce787f3c91d29c65f1a5e89417b5ad028c7301", "title": "Making Sense of Post-match Fan Behaviors in the Online Football Communities"}, {"paperId": "6951ff02d50ec6f48491e8c93632bb7264d8fd6b", "title": "What Makes Creators Engage with Online Critiques? Understanding the Role of Artifacts’ Creation Stage, Characteristics of Community Comments, and their Interactions"}, {"paperId": "a65da7dfce72f329ec07a3e1971fc509c7fc007f", "title": "Financial recommendations on Reddit, stock returns and cumulative prospect theory"}, {"paperId": "31efded912389bcff148c3205b42669ad434f7d9", "title": "An Evaluation on Large Language Model Outputs: Discourse and Memorization"}, {"paperId": "ffd53613590f434a08fbdbdf9c13ef067256f82e", "title": "Learn What Is Possible, Then Choose What Is Best: Disentangling One-To-Many Relations in Language Through Text-based Games"}, {"paperId": "84d9b01fa0f00c304760c2d26a8ab73e8584e061", "title": "Platform-agnostic Model to Detect Sinophobia on Social Media"}, {"paperId": "1394dc4c3126c29a590ec96881e0bdbeaf6843e7", "title": "Unveiling the Dynamics of Censorship, COVID-19 Regulations, and Protest: An Empirical Study of Chinese Subreddit r/china_irl"}, {"paperId": "278055465a08294e09514fa6b2dce1d7ef47cbb3", "title": "Entity graphs for exploring online discourse"}, {"paperId": "5c326260baa5e91a6a39c4d87ebe6770ade86816", "title": "Effective Theory of Transformers at Initialization"}, {"paperId": "2d8054f34c4c2ba1e5241fae19c78dad95b8b184", "title": "Personality Types and Traits—Examining and Leveraging the Relationship between Different Personality Models for Mutual Prediction"}, {"paperId": "9edeff92423b0cec08e73e22b698994389228aab", "title": "Broadening the Understanding of Medical Students' Discussion of Radiology Online: A Social Listening Study of Reddit."}, {"paperId": "47bcabadf1c87200e45cfebafa8831bcfc172b29", "title": "Artificial Intelligence–Enabled Analysis of Statin-Related Topics and Sentiments on Social Media"}, {"paperId": "bb4720ca4cc773e3ad09415e8c49a46418418125", "title": "Enhancing Decentralized Federated Learning for Non-IID Data on Heterogeneous Devices"}, {"paperId": "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d", "title": "A Survey of Large Language Models"}, {"paperId": "3b37ac8b3bf8ce69e9f605f3a7c2c7adaa40a191", "title": "The Nordic Pile: A 1.2TB Nordic Dataset for Language Modeling"}, {"paperId": "08593bf9c1a57d0eef5960fd22f5ecdcd4906361", "title": "What Do My (Online) Friends Think? A Topic Modeling Approach to Identifying Patterns of Response to Self-Injurious Behaviors on Reddit."}, {"paperId": "b5fc8a98522979679289f84e2a9c9e042955b83f", "title": "COVID ONLY ON THURSDAYS: DEALING WITH AN INFODEMIC IN LANGUAGE- AND REGION-BASED ONLINE COMMUNITIES"}, {"paperId": "0a56fc83bac9739ac31259e44f4a59271f3a6fee", "title": "No Love Among Haters: Negative Interactions Reduce Hate Community Engagement"}, {"paperId": "118b5c1537feb2f763f167a68fa710ab70fd6fb5", "title": "Using word embeddings to analyse audience effects and individual differences in parenting Subreddits"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "c5b2243baf88a00db2d4e4f9edb33cde08eb153f", "title": "eP-ALM: Efficient Perceptual Augmentation of Language Models"}, {"paperId": "8c236be5cb8073cb3db317919ceb55130ab66dbe", "title": "Champagne: Learning Real-world Conversation from Large-Scale Web Videos"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "d4e3568b5ec91f751863130cba125c5201780594", "title": "Natural conversations with a virtual being: How user experience with a current conversational AI model compares to expectations"}, {"paperId": "1fd67263900d36942b988f68b627e7889c97848d", "title": "Modeling, Evaluating, and Applying the eWoM Power of Reddit Posts"}, {"paperId": "36c8d3ef11c1ebe311489c27dffca56d19369c38", "title": "Less is More: Mitigate Spurious Correlations for Open-Domain Dialogue Response Generation Models by Causal Discovery"}, {"paperId": "f9f5c6298b169fc75b578c893164ab1abdd6da0d", "title": "Computing the Relativity of Word Meanings through the Construction of Individualized Models of Semantic Memory"}, {"paperId": "12386bf7a1ead65d2abfa2754cb823b39428f999", "title": "Comparing Toxicity Across Social Media Platforms for COVID-19 Discourse"}, {"paperId": "2f918e0232d3b7c2cabecaaa7edc976e068ce0c6", "title": "Upvotes? Downvotes? No Votes? Understanding the relationship between reaction mechanisms and political discourse on Reddit"}, {"paperId": "35df04ad4796093e0609faca030f826b47dd2c67", "title": "Evidence of Demographic rather than Ideological Segregation in News Discussion on Reddit"}, {"paperId": "2fb0cefa8a31a64345ab3d70db0a962151077380", "title": "Implications of the Convergence of Language and Vision Model Geometries"}, {"paperId": "55dc194b52e64fdcd4368553ef3cec485fd6d49e", "title": "Sentiment Analysis and Topic Modeling Regarding Online Classes on the Reddit Platform: Educators versus Learners"}, {"paperId": "5ff9cd8fcb959ca6b458c11e780d61c3f2bf7691", "title": "PLACES: Prompting Language Models for Social Conversation Synthesis"}, {"paperId": "b457420de8383a6d2c5003ee9ba4c4345700c2da", "title": "Exploring Language Used in Posts on r/birthcontrol: Case Study Using Data From Reddit Posts and Natural Language Processing to Advance Contraception Research"}, {"paperId": "e80f538c84201df0123cac7c3d82f8fc6bc59a72", "title": "Topological Analysis of Temporal Hypergraphs"}, {"paperId": "b9a43731c886ab9b5d2e5effbe1c295a568e06a7", "title": "Lived Experience Matters: Automatic Detection of Stigma on Social Media Toward People Who Use Substances"}, {"paperId": "643a3e1a70622a6ba34fda20e499c8569cb7e492", "title": "Reddit language indicates changes associated with diet, physical activity, substance use, and smoking during COVID-19"}, {"paperId": "5aeedad494b6fab24cfe477708e93d4b1ef67fb8", "title": "Comparing COVID-19 vaccine passports attitudes across countries by analysing Reddit comments"}, {"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "d402e3c6924e86ac3e73ddd5e3c680ced1276b9f", "title": "Sub-Standards and Mal-Practices: Misinformation's Role in Insular, Polarized, and Toxic Interactions"}, {"paperId": "5882dd04d95c9c88cdec389059fcf44d56cbb789", "title": "Understanding the Effectiveness of Very Large Language Models on Dialog Evaluation"}, {"paperId": "14573c0412e8238d4086f4dcc8807693473e3895", "title": "Deep Learning Mental Health Dialogue System"}, {"paperId": "34aac42574b7a8778837da73974fbb7473cd6764", "title": "Analysis of Caregiver Burden Expressed in Social Media Discussions"}, {"paperId": "350cec1b8f7c7134f9833a8835bd8f29eb619afc", "title": "Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community"}, {"paperId": "59776421a26312f2e84490e3aa6aecd345311019", "title": "Estimation of Bedtimes of Reddit Users: Integrated Analysis of Time Stamps and Surveys"}, {"paperId": "5775cc62a6929c5957f47433deef12e920f594a0", "title": "A multi-platform collection of social media posts about the 2022 U.S. midterm elections"}, {"paperId": "a52063092fcb963928fa7a11f3ca5a4c112b16a8", "title": "Based and confused: Tracing the political connotations of a memetic phrase across the web"}, {"paperId": "be678fc9d1dec9fba4f7513eede942abd5fe4db7", "title": "Public discourse on automated vehicles in online discussion forums: A social constructionist perspective"}, {"paperId": "2fbacb8be6e16a519edc4cfbf66b7cd4e73bf398", "title": "Democratization of Retail Trading: Can Reddit's WallStreetBets Outperform Investment Bank Analysts?"}, {"paperId": "0505992289a3f902ad628104f92f2af21da38a03", "title": "Too human and not human enough: A grounded theory analysis of mental health harms from emotional dependence on the social chatbot Replika"}, {"paperId": "e965e93e76a9e6c4e4863d145b5c007b540d575d", "title": "OPT-IML: Scaling Language Model Instruction Meta Learning through the Lens of Generalization"}, {"paperId": "9c62006d4c292e81c635dbff1b5216a4708a8c6d", "title": "Multidimensional tie strength and economic development"}, {"paperId": "f78fe02f681a0a9a6867b007bd39e3884de64a91", "title": "SODA: Million-scale Dialogue Distillation with Social Commonsense Contextualization"}, {"paperId": "493a6e7aef4ead8fafa8913ce404a870d862c08b", "title": "Mind the Knowledge Gap: A Survey of Knowledge-enhanced Dialogue Systems"}, {"paperId": "fdcdfa40a3ad4d6d1b1bfac2150fce7eda25ddfa", "title": "Analyzing a Data Science Online Practitioner Community: Trends and Implications for Data Science Project Management"}, {"paperId": "95c11cc5820ba32c60d5f2671f6567b9914a4978", "title": "ALERT: Adapt Language Models to Reasoning Tasks"}, {"paperId": "529548ce8485daac29dbead20c4c383d965ae1d6", "title": "Improving Chess Commentaries by Combining Language Models with Symbolic Reasoning Engines"}, {"paperId": "707dac793bede56d58291fd4a74293d84dc50a7e", "title": "Multivariate Powered Dirichlet Hawkes Process"}, {"paperId": "0888e4c92cb3ec7ddf883b75a240393d65027f4f", "title": "Religion and Spirituality on Social Media in the Aftermath of the Global Pandemic"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}, {"paperId": "c2b4864682bf23fa0c3ce20c80db58ccbe1b8e95", "title": "Comparing Literature- and Subreddit-Derived Laboratory Values in Polycystic Ovary Syndrome (PCOS): Validation of Clinical Data Posted on PCOS Reddit Forums"}, {"paperId": "5fe64941cbf5ca4f354ffa26e5ac7df53e9eb947", "title": "Anger Breeds Controversy: Analyzing Controversy and Emotions on Reddit"}, {"paperId": "1d77e97b35012ff262d189d84754b04d52021dcf", "title": "Emotional and cognitive changes surrounding online depression identity claims"}, {"paperId": "28e02b004fd93f99d1e085f54a2a18937e700722", "title": "Reddit and Google Activity Related to Non-COVID Epidemic Diseases Surged at Start of COVID-19 Pandemic: Retrospective Study"}, {"paperId": "3d10ee58514a041ec45a81e000d1293914cb9e93", "title": "Non-Polar Opposites: Analyzing the Relationship Between Echo Chambers and Hostile Intergroup Interactions on Reddit"}, {"paperId": "a9a53c28f3b964cf561c05bf204b4c06f6454eec", "title": "Bipartite-play Dialogue Collection for Practical Automatic Evaluation of Dialogue Systems"}, {"paperId": "9b32f1b56da9b31816e237e17324beca35c15cce", "title": "ED-FAITH: Evaluating Dialogue Summarization on Faithfulness"}, {"paperId": "693f7cd7a925bbdae041b1af68c2ef26dbb789b9", "title": "Helping Each Other Quit Online: Understanding User Engagement and Real-life Outcomes of the r/StopSmoking Digital Smoking Cessation Community"}, {"paperId": "795736777f08e92a80c95dab7f205d1d7c28a10b", "title": "The CRINGE Loss: Learning what language not to model"}, {"paperId": "98eefeb60efb3a7e1fce55f46290a1c3e43c0500", "title": "Do registers have different functions for text length?"}, {"paperId": "eed6a7201922031e29ccc82cbc8e04b7eb8e115e", "title": "PRISTINE: Semi-supervised Deep Learning Opioid Crisis Detection on Reddit"}, {"paperId": "9b6a769a8562674bd4d126d0e810f97172f147c0", "title": "Paying Attention to the Algorithm Behind the Curtain: Bringing Transparency to YouTube's Demonetization Algorithms"}, {"paperId": "59b9649bac3484e76df514fd577889a7e51e9c53", "title": "Exploring the Utility of Social Content for Understanding Future In-Demand Skills"}, {"paperId": "7081354388f055567bd492623bf25654deb4de71", "title": "Social media for early characterization of pandemic symptoms: A qualitative analysis of patient‐reported COVID‐19 experiences"}, {"paperId": "4756eb61fd4da2093115896144b5d0cb7704934d", "title": "Rally and WebScience: A Platform and Toolkit for Browser-Based Research on Technology and Society Problems"}, {"paperId": "4d8a8fd97601a82653176370f1ad7b2df7029205", "title": "A Space-Time Framework for Sentiment Scope Analysis in Social Media"}, {"paperId": "2fa11f97ae084591d79013c0cbc65d9931d976df", "title": "When Life Gives You Lemons, Make Cherryade: Converting Feedback from Bad Responses into Good Labels"}, {"paperId": "c66b4f762f94b8d3532f532a401c67c2d35e2546", "title": "Personalized Dialogue Generation with Persona-Adaptive Attention"}, {"paperId": "ad2faebf75d6b061652472a67a290321f790c409", "title": "Epistemic stance in the climate change debate"}, {"paperId": "73b222c2808a95878c8a3aa762b9ba1d4dd9ecd4", "title": "Parameter-Efficient Legal Domain Adaptation"}, {"paperId": "7f5801f8036e71658a12d16203617b2ab25ef14f", "title": "Discovering Differences in the Representation of People using Contextualized Semantic Axes"}, {"paperId": "c2a2b801e9091c33d50efd8758d3bcc2b05368ff", "title": "Z-LaVI: Zero-Shot Language Solver Fueled by Visual Imagination"}, {"paperId": "9e011a708831dfd1c2e42ea6f81889c8963e8aa2", "title": "Quantifying relational nouns in corpora"}, {"paperId": "3e7a5a7eb7c4db9ba83e978a23005560b714958c", "title": "Self-Censorship Under Law: A Case Study of The Hong Kong National Security Law"}, {"paperId": "4a7bb730127b5148a9c0144359bd862e42968fc8", "title": "Nobody Wants to Work Anymore: An Analysis of r/antiwork and the Interplay between Social and Mainstream Media during the Great Resignation"}, {"paperId": "9ab5c6644082b6fdbd6a2b0e6ae3527668244424", "title": "Machine-Generated Text: A Comprehensive Survey of Threat Models and Detection Methods"}, {"paperId": "779b224fd48377904bd3750f7f22b81eef94fc29", "title": "Beyond Sentiment: The Value and Measurement of Consumer Certainty in Language"}, {"paperId": "eeb6ab9707eda33fa08c18b786597b3869eccb07", "title": "Fast JSON parser using metaprogramming on GPU"}, {"paperId": "7d21070765f582b7ee4661d04cfcafb0ffe07373", "title": "Revealing Patient-Reported Experiences in Healthcare from Social Media using the DAPMAV Framework"}, {"paperId": "821fb1292a18cf9b06457eb304301ff5585b2654", "title": "Assessing Peer Award Diversification on Reddit"}, {"paperId": "27c00c75ea9b2e71dc70e5a2708c5f065fe170a7", "title": "Small Character Models Match Large Word Models for Autocomplete Under Memory Constraints"}, {"paperId": "e085bd71d3cc53a6eba3aa7e6940171a3a5d1086", "title": "Risk-graded Safety for Handling Medical Queries in Conversational AI"}, {"paperId": "65ada604209d0827ada2c949f5d5f4b6ec5de48b", "title": "Forecasting Cryptocurrencies Log-Returns: a LASSO-VAR and Sentiment Approach"}, {"paperId": "f14bd79572850763b33f485d6a09ef84a9638678", "title": "Change my Mind: Data Driven Estimate of Open-Mindedness from Political Discussions"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "016cb06f7de32e12653f475abae3c44c97923993", "title": "One of Many: Assessing User-level Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "e409f087ca26988d86fec968c6fc62068533a68a", "title": "Quantifying How Hateful Communities Radicalize Online Users"}, {"paperId": "655a45678f2522d406c7606549bb3cf09683f385", "title": "Reducing Offensive Replies in Open Domain Dialogue Systems"}, {"paperId": "60dc8af6ccc5f7591e58722990909135ce370363", "title": "Properties of Reddit News Topical Interactions"}, {"paperId": "b7d8bdf05ab3b15fe328c2f138efde0b68ba7c72", "title": "Robin: A Novel Online Suicidal Text Corpus of Substantial Breadth and Scale"}, {"paperId": "089c3a879253d730e98eaed7b945fa6c4113ca1f", "title": "Why So Toxic?: Measuring and Triggering Toxic Behavior in Open-Domain Chatbots"}, {"paperId": "debe7bd55ee8eabd4267a267c711002961aaaa8a", "title": "Benefits and concerns of seeking and experiencing lucid dreams: benefits are tied to successful induction and dream control"}, {"paperId": "3587d05fafec6053808351b8b72c670f58c9a8ec", "title": "Understanding Longitudinal Behaviors of Toxic Accounts on Reddit"}, {"paperId": "694d06e97843beb90e347115493b1f41f0c2a23b", "title": "Disguising Reddit sources and the efficacy of ethical research"}, {"paperId": "4f2b263ac4391e77a0fc4e77982dba014311486c", "title": "Data Augmentation for Graph Data: Recent Advancements"}, {"paperId": "36342da8ef61828be9c756f225e13c21616e41d3", "title": "VILT: Video Instructions Linking for Complex Tasks"}, {"paperId": "798ae76704c0c68b506a89c398407ee076e89df3", "title": "Register variation across text lengths"}, {"paperId": "767e45d2877f05f87151c63157213d18d4028035", "title": "Experiments with LDA and Top2Vec for embedded topic discovery on social media data—A case study of cystic fibrosis"}, {"paperId": "c003ec4e663bd083e3a0611dbd0f95e570da2f68", "title": "‘Scraping’ Reddit posts for academic research? Addressing some blurred lines of consent in growing internet-based research trend during the time of Covid-19"}, {"paperId": "01643877ef4bf7c75519469500bc73006bae0896", "title": "Moderation and authority-building process: the dynamics of knowledge creation on history subreddits"}, {"paperId": "6611fd3f278a75aef216ceed3c912ff1421becf3", "title": "Mental health concerns prelude the Great Resignation: Evidence from Social Media"}, {"paperId": "fed88738d21df461a8fd43b0673524ba49880e9f", "title": "Characterizing Social Movement Narratives in Online Communities: The 2021 Cuban Protests on Reddit"}, {"paperId": "609fd0ffd05e6730287fcc603267c4cabcbe3e5a", "title": "Learning New Skills after Deployment: Improving open-domain internet-driven dialogue with human feedback"}, {"paperId": "8b3a67c7e5289eed160d2acfd04d71cfb552c67d", "title": "Branch-Train-Merge: Embarrassingly Parallel Training of Expert Language Models"}, {"paperId": "5ab133346b3311bbb3d85f38a22b7faa65165bac", "title": "ELF22: A Context-based Counter Trolling Dataset to Combat Internet Trolls"}, {"paperId": "d4bfa40f79c6b0f519c17755431732e0d76f0df6", "title": "BotBuster: Multi-platform Bot Detection Using A Mixture of Experts"}, {"paperId": "691bf1d8f7ee062f370ce2ced217255ff08ff5c3", "title": "On the Relation Between Opinion Change and Information Consumption on Reddit"}, {"paperId": "4d4e97a2a36378a1f0d04545c2a392ad9b2892b0", "title": "Mapping Linguistic Shifts During Psychological Coping With the COVID-19 Pandemic"}, {"paperId": "d7813c7d536ece78d5c8285e2a507410754ed43b", "title": "Time-Aware Neighbor Sampling on Temporal Graphs"}, {"paperId": "3b0dea60ffca3a5e170990fd340f69338e3776fe", "title": "Types and Sources of Stigma on Opioid Use Treatment and Recovery Communities on Reddit"}, {"paperId": "d9bee3ad1d2a33d48a6daf47b20e92541d3bf749", "title": "VeriDark: A Large-Scale Benchmark for Authorship Verification on the Dark Web"}, {"paperId": "6ab617ba3e8303c85dab4203a8d213d50089ff8b", "title": "SoChainDB: A Database for Storing and Retrieving Blockchain-Powered Social Network Data"}, {"paperId": "3a096a3d67348640084c209abb09f79447fbbc11", "title": "Pile of Law: Learning Responsible Data Filtering from the Law and a 256GB Open-Source Legal Dataset"}, {"paperId": "1ea1973237227af049b2adb3ba1744e4ea21722b", "title": "‘Against the cult of veganism’: Unpacking the social psychology and ideology of anti-vegans"}, {"paperId": "fa24117f9ac102ab15e9580a367b22c5cfd2fe22", "title": "An approach to detect backbones of information diffusers among different communities of a social platform"}, {"paperId": "08ac2ef037d2350d6456052db97293da4d8cac98", "title": "A social and news media benchmark dataset for topic modeling"}, {"paperId": "5962e4c4ec6cc2bec0f7f35e1aef189019b1278c", "title": "HEAL: A Knowledge Graph for Distress Management Conversations"}, {"paperId": "7df0faabdee41aa5a5c314a0ca4bc851a92eac62", "title": "Social Norms on Reddit: A Demographic Analysis"}, {"paperId": "ca94d650f30a850fadaaee1a3e11c15af8901227", "title": "The Problem of Semantic Shift in Longitudinal Monitoring of Social Media: A Case Study on Mental Health During the COVID-19 Pandemic"}, {"paperId": "24b02bd719b29b9499d3c013042d97c50450263e", "title": "Understanding Aesthetics with Language: A Photo Critique Dataset for Aesthetic Assessment"}, {"paperId": "d1ccf9309bb456b9c6a4c5305fd7418c275ba57a", "title": "Enriching Abusive Language Detection with Community Context"}, {"paperId": "cef202f9875ac33afd9c4ed7e3b93ca0870486fd", "title": "Hate Speech and Counter Speech Detection: Conversational Context Does Matter"}, {"paperId": "f1217313b3dd1d4dc5afc09edfcbccae9b5647fe", "title": "Grounding in social media: An approach to building a chit-chat dialogue model"}, {"paperId": "125973447bcab5baa0160ab6426ccad3953b95ea", "title": "A Reddit Dataset for the Russo-Ukrainian Conflict in 2022"}, {"paperId": "1a84d7a29446b1d6909085ca1a4b23faec71f66f", "title": "MentSum: A Resource for Exploring Summarization of Mental Health Online Posts"}, {"paperId": "3e8e3a06f4e4ef6fd34ef03637f62fa1938bc7cf", "title": "Denigrating Women, Venerating “Chad”: Ingroup and Outgroup Evaluations among Male Supremacists on Reddit"}, {"paperId": "05c3fe6906655cb46980227e58a25526c716151b", "title": "AI for Social Good in Healthcare: Moving Towards a Clear Framework and Evaluating Applications"}, {"paperId": "31fda6eb17b565a8a3d0c772779ead5ffbd26a38", "title": "Conversational Resilience: Quantifying and Predicting Conversational Outcomes Following Adverse Events"}, {"paperId": "b7a7fea4bf4c75b1fa3d58171f6944130c26f89e", "title": "Cross-Platform Multimodal Misinformation: Taxonomy, Characteristics and Detection for Textual Posts and Videos"}, {"paperId": "4e2d9ca07cade654bba1469837d6edd508574cb8", "title": "A Tale of Two Subreddits: Measuring the Impacts of Quarantines on Political Engagement on Reddit"}, {"paperId": "32c1245c503f9358d6d8d5509ec04251df88c006", "title": "Measuring Alignment of Online Grassroots Political Communities with Political Campaigns"}, {"paperId": "693be8fc0fe567c67abc507fd0aebe3009ce2f29", "title": "The Reddit Politosphere: A Large-Scale Text and Network Resource of Online Political Discourse"}, {"paperId": "12a058745c2bcc91908689d66a47283edd632e7c", "title": "Happenstance: Utilizing Semantic Search to Track Russian State Media Narratives about the Russo-Ukrainian War On Reddit"}, {"paperId": "08dac48d632b3d97a5b853c250f6a0274c00b2b3", "title": "All That's Happening behind the Scenes: Putting the Spotlight on Volunteer Moderator Labor in Reddit"}, {"paperId": "3db4d1d7a42320d998beaaf53ecada614e6ee541", "title": "Measuring the Monetary Value of Online Volunteer Work"}, {"paperId": "da33c296a9198cd62c9f63707e93433f0fb8c8bf", "title": "How Do Climate Change Skeptics Engage with Opposing Views Online? Evidence from a Major Climate Change Skeptic Forum on Reddit"}, {"paperId": "3979f023b328c766c9ef3e1174a84a23619fedec", "title": "Symptom Identification for Interpretable Detection of Multiple Mental Disorders on Social Media"}, {"paperId": "3a97dcd56b69eed4696648cf89943167be807473", "title": "Keyword expansion techniques for mining social movement data on social media"}, {"paperId": "1872f215570377855739627afa78ed18ba8e4c5b", "title": "Forecasting COVID-19 Caseloads Using Unsupervised Embedding Clusters of Social Media Posts"}, {"paperId": "198488e019579a9a6c73dc83938d97a2f60f9e38", "title": "The role of the Big Geographic Sort in the circulation of misinformation among U.S. Reddit users"}, {"paperId": "7ef43bacd43393ff116e6fcda6a52a6902e016d7", "title": "“I’m sorry to hear that”: Finding New Biases in Language Models with a Holistic Descriptor Dataset"}, {"paperId": "27d50439596b008cdaea6334e466c89320ef8d13", "title": "Social Media Mining of Long-COVID Self-Medication Reported by Reddit Users: Feasibility Study to Support Drug Repurposing"}, {"paperId": "a6cf3a835a673417a086ecae405b34b15d59c7ca", "title": "You’ve never been welcome here: exploring the relationship between exclusivity and incivility in online forums"}, {"paperId": "13a0d8bb38f739990c8cd65a44061c6534f17221", "title": "OPT: Open Pre-trained Transformer Language Models"}, {"paperId": "2c402161c4050f0a063a9530a060cd6b8bae7ff4", "title": "Comparing PSO-based clustering over contextual vector embeddings to modern topic modeling"}, {"paperId": "561cb2df16d1c3e0899e411ab60fecf82a9c36f4", "title": "Privacy, Surveillance, and Power in the Gig Economy"}, {"paperId": "191e3c2ce3da3277f51213b5137c974e46bd64b2", "title": "“I Will Not Drink With You Today”: A Topic-Guided Thematic Analysis of Addiction Recovery on Reddit"}, {"paperId": "c59bc980ad4f544c31c638d9ae83da99afb47920", "title": "Discovering changes in birthing narratives during COVID-19"}, {"paperId": "afc44c380d8ed02ed08ff82214b7da642804923e", "title": "Detecting Addiction, Anxiety, and Depression by Users Psychometric Profiles"}, {"paperId": "9e60bb689182a753886fe40e6790cd7da7de7e3d", "title": "A Large-scale Temporal Analysis of User Lifespan Durability on the Reddit Social Media Platform"}, {"paperId": "f6c62e8c5290b0bc743c8b25293bdb4e59983732", "title": "”I’m always in so much pain and no one will understand” - Detecting Patterns in Suicidal Ideation on Reddit"}, {"paperId": "4c868a92c615df3859433e28b2441bbce9e65fb3", "title": "Reward Reports for Reinforcement Learning"}, {"paperId": "aab1dead436211a7d9eb7a717ee63a5d23cf23f0", "title": "Meet Your Favorite Character: Open-domain Chatbot Mimicking Fictional Characters with only a Few Utterances"}, {"paperId": "e882fcd2bfd182d28ef339aceb240afd6ab55836", "title": "Pathways through Conspiracy: The Evolution of Conspiracy Radicalization through Engagement in Online Conspiracy Discussions"}, {"paperId": "7ccdb149f7aa935f0badff2f674bc2c2290c1043", "title": "Understanding Toxicity Triggers on Reddit in the Context of Singapore"}, {"paperId": "9d070671b49dabf988464779696aff75fe592878", "title": "On Xing Tian and the Perseverance of Anti-China Sentiment Online"}, {"paperId": "01cc34196acf358cec0c4a79f92eec754dc91500", "title": "Same Author or Just Same Topic? Towards Content-Independent Style Representations"}, {"paperId": "e0a5095aca839c870db2ddd732d7f47dc5f047ee", "title": "Reddit as a prediction tool for crypto-assets"}, {"paperId": "acc83ea3059f5583cd715df28d4ef97eb3d60752", "title": "There Are a Thousand Hamlets in a Thousand People’s Eyes: Enhancing Knowledge-grounded Dialogue with Personal Memory"}, {"paperId": "507e95bd3c749a98f5b8deb8a3d4bc0e144a474e", "title": "Signaling the Intent to Change Online Communities: A Case From a Reddit Gaming Community"}, {"paperId": "e95cb5bd74018cea74ad305e5d3d3be61f573796", "title": "“You are not alone”: A big data and qualitative analysis of men's unintended fatherhood"}, {"paperId": "6955d42d6f3f36b0bba60d60b9c23fc430a07db7", "title": "A Centered Convolutional Restricted Boltzmann Machine Optimized by Hybrid Atom Search Arithmetic Optimization Algorithm for Sentimental Analysis"}, {"paperId": "129face57a34967d6a770973b8ddc49207be0962", "title": "Mapping Topics in 100, 000 Real-life Moral Dilemmas"}, {"paperId": "7c71da25ffaea63f8b42227cd50c3cedabdc6077", "title": "How online discussion board activity affects stock trading: the case of GameStop"}, {"paperId": "9de26f7e805b75a305ef675f5acc5156ea24aa04", "title": "Quantifying depression-related language on social media during the COVID-19 pandemic"}, {"paperId": "0b910f8f6ddd48d6a05723a32b5b0b98c7097282", "title": "FLUTE: A Scalable, Extensible Framework for High-Performance Federated Learning Simulations"}, {"paperId": "f8292d4ddf7a6dfe240eeaa9685f5d18eed9a3f6", "title": "Language Models that Seek for Knowledge: Modular Search & Generation for Dialogue and Prompt Completion"}, {"paperId": "d60c4048fdcab1c80c7c13c7545b5caeb4ee944a", "title": "Suum Cuique: Studying Bias in Taboo Detection with a Community Perspective"}, {"paperId": "3941eef6e5299688ed6e7f0235dc8846e1a1e56c", "title": "CLIP meets GamePhysics: Towards bug identification in gameplay videos using zero-shot transfer learning"}, {"paperId": "870c1c8341f6e5c9589be7368ec76a80a08f5bcd", "title": "Turning Stocks into Memes: A Dataset for Understanding How Social Communities Can Drive Wall Street"}, {"paperId": "6e3c3d94bdab82e077bcf131848000be8356ba36", "title": "Characterizing Reddit Participation of Users Who Engage in the QAnon Conspiracy Theories"}, {"paperId": "bce35b3d1cba7a8dd7bb350213780202a2922ec7", "title": "VAST: The Valence-Assessing Semantics Test for Contextualizing Language Models"}, {"paperId": "eaedc81537075bfc5fba3b4c7b4952084c9b6427", "title": "Mental Health Pandemic During the COVID-19 Outbreak: Social Media As a Window to Public Mental Health"}, {"paperId": "261862aae84996f980a2b47df8bfa6fbd17ae19e", "title": "Getting “clean” from nonsuicidal self-injury: Experiences of addiction on the subreddit r/selfharm"}, {"paperId": "8590e8c1e0992fcb560c4a7cbcb7a7225438c39f", "title": "How Do Mothers and Fathers Talk About Parenting to Different Audiences?: Stereotypes and Audience Effects: An Analysis of r/Daddit, r/Mommit, and r/Parenting Using Topic Modelling"}, {"paperId": "e20970a411973b90463fb49a7616dee386dafbda", "title": "Making a Radical Misogynist"}, {"paperId": "f788b0d75ac04a32d1bac65c54e07db737d44d06", "title": "Is this Herpes or Syphilis?: Latent Dirichlet Allocation Analysis of Sexually Transmitted Disease-Related Reddit Posts During the COVID-19 Pandemic"}, {"paperId": "639d1227583d7e1ea9855971909afda3dbfd9eed", "title": "On the Complementarity of Images and Text for the Expression of Emotions in Social Media"}, {"paperId": "3136fbe8c556a4d5aeb302ddb6a59e8cfbaf057f", "title": "The MeLa BitChute Dataset"}, {"paperId": "dab1528f827933bc044d0aaf2681cc77a1b38fab", "title": "“I got a bunch of weed to help me through the withdrawals”: Naturalistic cannabis use reported in online opioid and opioid recovery community discussion forums"}, {"paperId": "5cd830e5d95a61786e7ced65bc7789c96ec16778", "title": "A thematic cluster analysis of parents' online discussions about fussy eating"}, {"paperId": "1997d20294acab3bba07aabd6ac0e2372783d4e5", "title": "Governing Online Goods: Maturity and Formalization in Minecraft, Reddit, and World of Warcraft Communities"}, {"paperId": "be6b999866475d83bbde51ac1ddbd23a8e7bf9bc", "title": "Cross-platform analysis of public responses to the 2019 Ridgecrest earthquake sequence on Twitter and Reddit"}, {"paperId": "4b830ff6272f41cfe20426e4a32b58ebc55b9185", "title": "Explainable Patterns for Distinction and Prediction of Moral Judgement on Reddit"}, {"paperId": "06bd02f05d64417e3ad60368924386d851375ccc", "title": "Information needs of current and prospective foster caregivers: a content analysis of Reddit posts"}, {"paperId": "815d844d0e359e9a8f9279cab97030909bc2b201", "title": "Many Ways to be Lonely: Fine-grained Characterization of Loneliness and its Potential Changes in COVID-19"}, {"paperId": "fa7793e9c6ef4c83460c8269632a692405d9dc19", "title": "Make Reddit Great Again: Assessing Community Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "bda4ba8531648858b322d183c37d7e1d234e421e", "title": "\"I Can't Keep It Up.\" A Dataset from the Defunct Voat.co News Aggregator"}, {"paperId": "06f8feb66aa0e7f6b17d5a167d089952280decfb", "title": "The Computational Thematic Analysis Toolkit"}, {"paperId": "3d49cc45a6669686f6e4a75404842264c6d93df6", "title": "Mental Health Assessment for the Chatbots"}, {"paperId": "94f02394a8f019d7ece7eb9612e96253ba97f30c", "title": "Human Evaluation of Conversations is an Open Problem: comparing the sensitivity of various methods for evaluating dialogue agents"}, {"paperId": "dda9d9b371a7961be74fcfd77923d87d008b99dd", "title": "No Community Can Do Everything: Why People Participate in Similar Online Communities"}, {"paperId": "d51d3b8f189965a4eb8d9f651dbf94c3ef8d52c9", "title": "Parental Mentalizing During a Pandemic: Use of Mental-State Language on Parenting Social Media Before and During the COVID-19 Pandemic"}, {"paperId": "755f137970dadf9088d718c9bedb97029732a024", "title": "Spinning words as disguise: Shady services for ethical research?"}, {"paperId": "8492aa1b0b799e19f7f0eb054c7adaba7bd5d866", "title": "There is no rose without a thorn: Finding weaknesses on BlenderBot 2.0 in terms of Model, Data and User-Centric Approach"}, {"paperId": "41e974ddaceb213d7103155e4662f0430975b84d", "title": "Examining Cannabis, Tobacco, and Vaping Discourse on Reddit: An Exploratory Approach Using Natural Language Processing"}, {"paperId": "03e87b82b80610f3cc8a933b480c5f74b5caf56e", "title": "Extraction and analysis of text patterns from NSFW adult content in Reddit"}, {"paperId": "93004720f6785ce2365ddee9fa889016a166af57", "title": "Natural language processing: A window to understanding skincare trends"}, {"paperId": "a7f3d2bcd5f0cd5e92d7dec451e91d42586fa2b9", "title": "Evolution and differentiation of the cybersecurity communities in three social question and answer sites: A mixed-methods analysis"}, {"paperId": "fc2dc44d760d614ab5370c2b5b3292ac5855ba56", "title": "Judging a book by its cover: Predicting the marginal impact of title on Reddit post popularity"}, {"paperId": "5dd2396aa213f5bb18b800408911fe3f7ceb432a", "title": "Quantifying gender biases towards politicians on Reddit"}, {"paperId": "74982b942f4c64a0a692d70eef8df6971edafc6c", "title": "Time-Aware Neighbor Sampling for Temporal Graph Networks"}, {"paperId": "1d46e27adc68d8f326d0ffa8bfab4c3a13d70413", "title": "From depression to suicidal discourse on Reddit"}, {"paperId": "231abab7bc800d4b2f81f91a36628ae1ee5f829d", "title": "Efficient Dynamic Graph Representation Learning at Scale"}, {"paperId": "55033fd599fd4b9e0dad8533a39df1651ed44bef", "title": "Emotion-based Modeling of Mental Disorders on Social Media"}, {"paperId": "82066656e9fc34641c9bcb298019df1398655d09", "title": "Self-induced consensus of Reddit users to characterise the GameStop short squeeze"}, {"paperId": "072003a8a6c6044f3bc2f75bbc736b3a7fc22d0b", "title": "Am I Me or You? State-of-the-Art Dialogue Models Cannot Maintain an Identity"}, {"paperId": "4c93657508d63f5949ca7cab4c25fe590d83db9f", "title": "Does Godwin’s law (rule of Nazi analogies) apply in observable reality? An empirical study of selected words in 199 million Reddit posts"}, {"paperId": "e73bb1f5144a365ffa51dd78f29737564b3b85a0", "title": "Communication Expressed on the COVID-19 Subreddit in the Midst of a Global Pandemic"}, {"paperId": "189e0ea468a3eaacbbdb36be56aa60a95543cf4a", "title": "A Prior Probability of Speaker Information and Emojis Embedding Approach to Sarcasm Detection"}, {"paperId": "c61ad406f4812eb8607b5bb188719bdefd651d07", "title": "TrollMagnifier: Detecting State-Sponsored Troll Accounts on Reddit"}, {"paperId": "c712e067bbd95d44da250977dc37f3f87afd0e9d", "title": "An inclusive, real-world investigation of persuasion in language and verbal behavior"}, {"paperId": "adfa97019b73ab1de60deedc13f851b763930b1f", "title": "Are Proactive Interventions for Reddit Communities Feasible?"}, {"paperId": "da4261a957eaa96bf626e9641ef68ebed1d5333f", "title": "RedCaps: web-curated image-text data created by the people, for the people"}, {"paperId": "1cc696e31a3ae3d037730df262fce681bfec2f02", "title": "What Makes Online Communities 'Better'? Measuring Values, Consensus, and Conflict across Thousands of Subreddits"}, {"paperId": "715541c39fc9e4e8c804c863c29de592a8d569a8", "title": "ExtremeBB: A Database for Large-Scale Research into Online Hate, Harassment, the Manosphere and Extremism"}, {"paperId": "4f9dda2b7f7526108f5c9695e88a63836a085fa4", "title": "Understanding the Use of e-Prints on Reddit and 4chan’s Politically Incorrect Board"}, {"paperId": "abc12bed0853575949b7b9ef0a934dfe77300b5b", "title": "Soros, Child Sacrifices, and 5G: Understanding the Spread of Conspiracy Theories on Web Communities"}, {"paperId": "fd8357c94fa12e3dc6effac39e12bc747b7cab03", "title": "Reddit and the Fourth Estate: Exploring the magnitude and effects of media influence on community level moderation on Reddit"}, {"paperId": "a574474d0083cc0c9efab1dfba1d6388573ec7a2", "title": "Examining Evaluativity in Legal Discourse: A Comparative Corpus-Linguistic Study of Thick Concepts"}, {"paperId": "73bbe4535a7b3712d729ad6dba8a785daa0dd5ac", "title": "Dirty laundry: The nature and substance of seeking relationship help from strangers online"}, {"paperId": "35eb6755b63c45ff44d05ace8ea1b3b8c8db9eee", "title": "On the Safety of Conversational Models: Taxonomy, Dataset, and Benchmark"}, {"paperId": "a92d7b3d9b4501910ca512f70f1e3da3bb62f99f", "title": "How Well Do You Know Your Audience? Toward Socially-aware Question Generation"}, {"paperId": "114cc14951f65f4c3d0d4ac8e6731e8705378715", "title": "DS-TOD: Efficient Domain Specialization for Task-Oriented Dialog"}, {"paperId": "0794333779d775abc2053052d1e7009066cbd4f1", "title": "SaFeRDialogues: Taking Feedback Gracefully after Conversational Safety Failures"}, {"paperId": "9c9a8a2ede08414e191bea6c22e40615a23a9fd1", "title": "WMDecompose: A Framework for Leveraging the Interpretable Properties of Word Mover’s Distance in Sociocultural Analysis"}, {"paperId": "d553a4d7cf26e8971ba0ac63d40e3cbefdfb642b", "title": "Detecting Community Sensitive Norm Violations in Online Conversations"}, {"paperId": "c2809001fcf66f75b2c518f21a3b309c72a857d8", "title": "An online home for the homeless: A content analysis of the subreddit r/homeless"}, {"paperId": "043af12b66c2d598739921ac541d6d49c744aa07", "title": "Situated Dialogue Learning through Procedural Environment Generation"}, {"paperId": "2830def16e8f45b5b31e318968525c462ff89a76", "title": "Exploring Usability of Reddit in Data Science and Knowledge Processing"}, {"paperId": "732241aebdb00c04f3c9e3a051bb08e666cf8901", "title": "Intraday Herding and Attention Around the Clock"}, {"paperId": "169473a009731c7969a65ed2599e43a03ed83e71", "title": "TLDR9+: A Large Scale Resource for Extreme Summarization of Social Media Posts"}, {"paperId": "705554c3532b7be9c1eb7c993132ffb940282e1b", "title": "Low Frequency Names Exhibit Bias and Overfitting in Contextualizing Language Models"}, {"paperId": "787eadd8399ecff7a249a8dc6ba5d344e85ad140", "title": "Assessing the Extent and Types of Hate Speech in Fringe Communities: A Case Study of Alt-Right Communities on 8chan, 4chan, and Reddit"}, {"paperId": "31000c79187b9159c53aa53e3a73a008ca3844b4", "title": "Using Named Entity Recognition to Identify Substances Used in the Self-medication of Opioid Withdrawal: Natural Language Processing Study of Reddit Data"}, {"paperId": "852325e710f925274c0f776b8d3ed3401e40da62", "title": "Teens’ Social Media Engagement during the COVID-19 Pandemic: A Time Series Examination of Posting and Emotion on Reddit"}, {"paperId": "992129aa96c97fa3b2ced0ddbc4c7d07bfaaf821", "title": "PLATO-XL: Exploring the Large-scale Pre-training of Dialogue Generation"}, {"paperId": "3802687eb6a9225f6eb5922795ae3e85c9a56ccf", "title": "Incels on Reddit: A study in social norms and decentralised moderation"}, {"paperId": "305204fc77037c9b8f25eb00b91fbc8b526af2b8", "title": "A Conditional Generative Matching Model for Multi-lingual Reply Suggestion"}, {"paperId": "697cb0d25869e83b8304b3feb7a9e5dbce85b182", "title": "Automatically Exposing Problems with Neural Dialog Models"}, {"paperId": "95ec171964b16e7c14739b1ab039df2cca6abb73", "title": "NeuTral Rewriter: A Rule-Based and Neural Approach to Automatic Rewriting into Gender Neutral Alternatives"}, {"paperId": "e3dfb9edbae4815eacc2e71ac8f2d81704c9a2a8", "title": "Making Online Communities 'Better': A Taxonomy of Community Values on Reddit"}, {"paperId": "6b69cdcefa7cbdcc0aa95c8d341d97a1822a03ec", "title": "Does It Capture STEL? A Modular, Similarity-based Linguistic Style Evaluation Framework"}, {"paperId": "7ab158f2ba8ad5c84e348a15e700e616025b24ab", "title": "Understanding the Impact of COVID-19 on Online Mental Health Forums"}, {"paperId": "063183d95a249d94c95d12e7e9462e0aa84b6d85", "title": "Hi, my name is Martha: Using names to measure and mitigate bias in generative dialogue models"}, {"paperId": "39bae41c80080edc54f742d0f589a569d8d1a0aa", "title": "Detecting Inspiring Content on Social Media"}, {"paperId": "0e66488e078268e26d3aef6d30aaeb45850f71fd", "title": "Overview of EXIST 2021: sEXism Identification in Social neTworks"}, {"paperId": "731247ebf8df359c4feacf3cb530b2cb35126c7d", "title": "Characterizing Self-Reports of Self-Identified Patient Experiences with Methadone Maintenance Treatment on an Online Community during COVID-19"}, {"paperId": "4279cd78c906b6fd9ec547f25cd562ee30a4a65f", "title": "“Be Nice or Leave Me Alone”: An Intergroup Perspective on Affective Polarization in Online Political Discussions"}, {"paperId": "2ad072c6322c303a5a1ce02bf004c6a2485796dc", "title": "The 4CAT Capture and Analysis Toolkit: A Modular Tool for Transparent and Traceable Social Media Research"}, {"paperId": "718339cbafd0b4613d3389cc2c22592764b92c62", "title": "Distilling the Knowledge of Large-scale Generative Models into Retrieval Models for Efficient Open-domain Conversation"}, {"paperId": "f56cda7ee6b3cfa427d045b6cc754ec68349c511", "title": "Just Say No: Analyzing the Stance of Neural Dialogue Generation in Offensive Contexts"}, {"paperId": "359f162c3e941a40161e5ec7e06dbc1c1c664719", "title": "Twitter flagged Donald Trump’s tweets with election misinformation: They continued to spread both on and off the platform"}, {"paperId": "604b3e4517709d035e0c2cff8295a5fb297a12c7", "title": "'Walking Into a Fire Hoping You Don't Catch': Strategies and Designs to Facilitate Cross-Partisan Online Discussions"}, {"paperId": "917c63f2186119166b3379f5d2816bb1a2f39b09", "title": "DEMix Layers: Disentangling Domains for Modular Language Modeling"}, {"paperId": "38176fb4f6cd793429e1bc7e4e8077f118e86c05", "title": "Using social media Reddit data to examine foster families' concerns and needs during COVID-19"}, {"paperId": "5dd9a3d66848fcf6b8c276fa4aca25f03e9ea3fb", "title": "Why do People Participate in Small Online Communities?"}, {"paperId": "11cde391fdf0386542878ba850084e0ac1fcd5e7", "title": "Leveraging Commonsense Knowledge on Classifying False News and Determining Checkworthiness of Claims"}, {"paperId": "bcf2894ed06eed1b3a39c5852f0746e65365e208", "title": "Charting closed-loop collective cultural decisions: from book best sellers and music downloads to Twitter hashtags and Reddit comments"}, {"paperId": "c62d078529e801a7f45076a515aa2ac906591e6d", "title": "Reddit: A novel data source for cultural ecosystem service studies"}, {"paperId": "1799be03f57d0ceb87bcad5b36c65adb6aa4a0b1", "title": "Sentiment Analysis of the COVID-related r/Depression Posts"}, {"paperId": "a8ed026b9aa2f01703e46562436f5aca70ab39a0", "title": "Why study media ecosystems?"}, {"paperId": "aeb7de3cdc6b44312ffe3087b08bea2a719ec055", "title": "Characterizing Social Imaginaries and Self-Disclosures of Dissonance in Online Conspiracy Discussion Communities"}, {"paperId": "de549c1592a62c129b8d49c8c0137aa6859b103f", "title": "Internet-Augmented Dialogue Generation"}, {"paperId": "13ef22764931fb58becee9144287c16111c17238", "title": "From Reddit to Wall Street: the role of committed minorities in financial collective action"}, {"paperId": "88064de690af282dbdf222774f03ff070b9df22b", "title": "Beyond Goldfish Memory: Long-Term Open-Domain Conversation"}, {"paperId": "d9843797fa08db4a4321ac2bd982d1ef0b231c98", "title": "Identifying Competition and Mutualism Between Online Groups"}, {"paperId": "f458e6f1dfa9502b87dbfc5d023d83dffdb52377", "title": "Regional Patterns in Prevelar Raising"}, {"paperId": "2ef4ab54d00203f9ac610213ac3abc8e1fe541b4", "title": "Anticipating Safety Issues in E2E Conversational AI: Framework and Tooling"}, {"paperId": "1520746c4f4c96b960cdc459ed44ab8946a5c561", "title": "Topics Analysis of Reddit and Twitter Posts Discussing Inflammatory Bowel Disease and Distress From 2017 to 2019"}, {"paperId": "7318bafb562ce50e892527d77383ea68963a22a9", "title": "The Sociomateriality of Rating and Ranking Devices on Social Media: A Case Study of Reddit’s Voting Practices"}, {"paperId": "099fb27ac34f48779a7ba1019556e977c0c28399", "title": "Group Salience, Inflammatory Rhetoric, and the Persistence of Hate Against Religious Minorities"}, {"paperId": "c7dc71e727b4760eeeb5a972fdbbc42cff2fea43", "title": "When the Echo Chamber Shatters: Examining the Use of Community-Specific Language Post-Subreddit Ban"}, {"paperId": "9b6b81765f893cfece4f2da8a33f4e21ced6bd3b", "title": "Early Risk Detection of Pathological Gambling, Self-Harm and Depression Using BERT"}, {"paperId": "32b526be024e1d783eff1b81266d7fb2d9983caf", "title": "Web-scraping the Expression of Loneliness during COVID-19"}, {"paperId": "5e5d687360658b50d04bf2538a1e1be4783fd33e", "title": "Understanding the Effect of Deplatforming on Social Networks"}, {"paperId": "d274812705171203f1e8d0a767bec330d212a8f2", "title": "Toward a Standard Approach for Echo Chamber Detection: Reddit Case Study"}, {"paperId": "ad8f0170bde61a8c1ca56507bf624f9392bb59b7", "title": "Ruddit: Norms of Offensiveness for English Reddit Comments"}, {"paperId": "b50815251c948f00baedccaf5f56c281ffa7650f", "title": "Staircase Attention for Recurrent Processing of Sequences"}, {"paperId": "0611d2f2ea6a3c8fb8534f42758a5a3e9c7bc8fe", "title": "Hash Layers For Large Sparse Models"}, {"paperId": "ce18007d195d75a30710e510eb1b4e19ebf31c97", "title": "Alexa, Google, Siri: What are Your Pronouns? Gender and Anthropomorphism in the Design and Perception of Conversational Assistants"}, {"paperId": "f9ce79b7e238be2e5ca228672181169bb5bc3029", "title": "Addressing Inquiries about History: An Efficient and Practical Framework for Evaluating Open-domain Chatbot Consistency"}, {"paperId": "1b05155aa1f7532609bf2cf5fea668a745399780", "title": "Conversations Are Not Flat: Modeling the Dynamic Information Flow across Dialogue Utterances"}, {"paperId": "f96e1494d714f6bbf496bdd137300c7db5500753", "title": "A Dataset and Baselines for Multilingual Reply Suggestion"}, {"paperId": "4b905b2577962362764d263460034513f417c49e", "title": "Generating Informative Conclusions for Argumentative Texts"}, {"paperId": "041c4a3932eae3931d90b1a0fc033cf5f491c267", "title": "Bot-Adversarial Dialogue for Safe Conversational Agents"}, {"paperId": "7571ed4cf1bbdcf891b576a0da12c910b1f0c72f", "title": "Concealed Data Poisoning Attacks on NLP Models"}, {"paperId": "a27ef1cae80d9a72734868b7a5d4e5092452dc31", "title": "Personalized Response Generation via Generative Split Memory Network"}, {"paperId": "0819e62e97f7c4ac88d4659b9e3bff2cae436ed1", "title": "Introducing CAD: the Contextual Abuse Dataset"}, {"paperId": "e46d58866eb02a30bb129e8d4284856822a1cc2a", "title": "Towards Understanding the Role of Gender in Deploying Social Media-Based Mental Health Surveillance Models"}, {"paperId": "892c37529053e560db6fb32ee6c4f8730405f374", "title": "Gathering Information and Engaging the User ComBot: A Task-Based, Serendipitous Dialog Model for Patient-Doctor Interactions"}, {"paperId": "b1d8c868e1d6d4980ee2f8c50e6fc5e4e7027ca2", "title": "Telling Stories through Multi-User Dialogue by Modeling Character Relations"}, {"paperId": "3ae3ee6f18921aab18a54fe84fdd6521bb741637", "title": "Entropy and complexity unveil the landscape of memes evolution"}, {"paperId": "9a51eb2a3c2a9e2479c705575637c0c87a2a7bfd", "title": "The incel lexicon: Deciphering the emergent cryptolect of a global misogynistic community"}, {"paperId": "071b0fe0c06cc9e26bf08698b83655af58c3908e", "title": "A Long and a Short Leg Make For a Wobbly Equilibrium"}, {"paperId": "5f6657b3b129d0680a3c554b41e032f9ce846d43", "title": "Understanding the Diverging User Trajectories in Highly-related Online Communities during the COVID-19 Pandemic"}, {"paperId": "ce881f9ce693917754211d09970fc2c755d908b7", "title": "Imagine All the People: Characterizing Social Music Sharing on Reddit"}, {"paperId": "0a53be8d3af7b3e774e7a3b1208f2c9351758f8a", "title": "A Deep Metric Learning Approach to Account Linking"}, {"paperId": "aeeaa45f4fa21c8d7131d37b4cf1db2e5ef24bda", "title": "Should You Take Investment Advice From WallStreetBets? A Data-Driven Approach"}, {"paperId": "1476c3e1194f930b0cc6920e6b84371b45773a16", "title": "The Doge of Wall Street: Analysis and Detection of Pump and Dump Cryptocurrency Manipulations"}, {"paperId": "3ef4e04bb2ebbca191244812217ae309a382d693", "title": "Leveraging Community and Author Context to Explain the Performance and Bias of Text-Based Deception Detection Models"}, {"paperId": "63ca82b7e846468e1aa9eacec3b1a26b7ceb94c0", "title": "Disfluency Detection with Unlabeled Data and Small BERT Models"}, {"paperId": "2a8e9e2d1d3c2a4fe01bafe2f250312c6001ad93", "title": "Political Discussion is Abundant in Non-political Subreddits (and Less Toxic)"}, {"paperId": "133ff0942c18f199b97ffef4bc9ad0a1dacbc707", "title": "Discourse analysis of the American working youth communities on the social network Reddit"}, {"paperId": "722dbe4511134f5433a51519d9c28bd15791454d", "title": "Modeling Ideological Salience and Framing in Polarized Online Groups with Graph Neural Networks and Structured Sparsity"}, {"paperId": "3d865fa1b2d9150aa47606daf84d6279e9f804fb", "title": "Structural Correlates of Mental Health Support Access among Sexual Minority Youth of Color during COVID-19"}, {"paperId": "1fa819dd252a8feb5350d3cacac3e019e3b8e5c7", "title": "Temporal Adaptation of BERT and Performance on Downstream Document Classification: Insights from Social Media"}, {"paperId": "a2a7033a5a859e3a6e6f0a83018326400b4c5faa", "title": "Retrieval Augmentation Reduces Hallucination in Conversation"}, {"paperId": "9c523a1ac145ca5a567fb0a6791eb6c11a6fdea0", "title": "Media Cloud: Massive Open Source Collection of Global News on the Open Web"}, {"paperId": "50446db0d47e9820c298edb0bf18226986b40f2a", "title": "Monitoring the opioid epidemic via social media discussions"}, {"paperId": "49f6f469d002ef0cfbd017bc7f14ce9162ab2f50", "title": "Reddit Gaming Communities During Times of Transition"}, {"paperId": "ebdaa0ec85a30e7ea5a3ed202c55a77c33b39ddb", "title": "Studying Reddit: A Systematic Overview of Disciplines, Approaches, Methods, and Ethics"}, {"paperId": "b93d6bc8a2d9d145eae7231b67d4d07077ad8830", "title": "Dealing with Deepfakes: Reddit, Online Content Moderation, and Situational Crime Prevention"}, {"paperId": "098370508aaf56f718a472511987ac2072d0f917", "title": "Detecting Hate Speech with GPT-3"}, {"paperId": "021fd39895d314213587e1b80551cc868b68beae", "title": "Fussy eating in toddlers: A content analysis of parents' online support seeking"}, {"paperId": "030598231fba799180ff53fea7aae2b578d1d5eb", "title": "A Multi-Platform Analysis of Political News Discussion and Sharing on Web Communities"}, {"paperId": "b61e2d1bb31c0d1c348926bf61d7d9f7cb1ab4b4", "title": "Populist Supporters on Reddit: A Comparison of Content and Behavioral Patterns Within Publics of Supporters of Donald Trump and Hillary Clinton"}, {"paperId": "6304ca3255afdda4771a364e941e6ea477a0bb29", "title": "The Healthy States of America: Creating a Health Taxonomy with Social Media"}, {"paperId": "683fae893ec06aa61f552190fa96efffe635e414", "title": "A tool for tracking the propagation of words on Reddit"}, {"paperId": "710e4f01fe1488d6ac36755b4040b7179660e1e4", "title": "Are Anti-Feminist Communities Gateways to the Far Right? Evidence from Reddit and YouTube"}, {"paperId": "769fec9ee0a3402746692b8794d48c75b31987bb", "title": "Political Bias and Factualness in News Sharing Across more then 100, 000 Online Communities"}, {"paperId": "98991c366c9fc5ecdcbe98d23061db6bbe608861", "title": "How do climate change skeptics engage with opposing views? Understanding mechanisms of social identity and cognitive dissonance in an online forum"}, {"paperId": "7731e3dec97c48498b585408d44615346ade144a", "title": "Characterizing English Variation across Social Media Communities with BERT"}, {"paperId": "9ada59fd4676d4cd81f4c86bc787f24b1d43da9e", "title": "Competition Dynamics in the Meme Ecosystem"}, {"paperId": "3b0e53d109c154bae343e4f577720019b18f9e72", "title": "Investigating the phenomenon of NSFW posts in Reddit"}, {"paperId": "81af8dfaa3ecd2c970f5642ce547d6fd57c702d2", "title": "No echo in the chambers of political interactions on Reddit"}, {"paperId": "d01a1ee43c672affabe3b122c5dfabb2b81764c3", "title": "Subgraph nomination: query by example subgraph retrieval in networks"}, {"paperId": "33fa38d80ca900dafe708747f062b75f6e4abd96", "title": "Us vs. Them: A Dataset of Populist Attitudes, News Bias and Emotions"}, {"paperId": "2d9011f3e8e8cdd33553e56b211fbfbb202265fd", "title": "How Dramatic Events Can Affect Emotionality in Social Posting: The Impact of COVID-19 on Reddit"}, {"paperId": "98e5fecbec6afcc9cdc58325816827a0c0f6c1db", "title": "The Gospel According to Q: Understanding the QAnon Conspiracy from the Perspective of Canonical Information"}, {"paperId": "e223687bee7d3b5b4f8b5020b1d9f29ecf415c93", "title": "Analysis of Moral Judgement on Reddit"}, {"paperId": "ec45606af38450b1a88d365b4cee3379b19fcb8a", "title": "A Large Open Dataset from the Parler Social Network"}, {"paperId": "aa1efdf1aa530bb78e2134fbf293bbefe7eed577", "title": "An Early Look at the Parler Online Social Network"}, {"paperId": "d77c78c9439422ed88e754f776a642d43a8acb66", "title": "Reducing Conversational Agents’ Overconfidence Through Linguistic Calibration"}, {"paperId": "01a9102aa93b152f2d2978c568fb7061eb7152f1", "title": "I like fish, especially dolphins: Addressing Contradictions in Dialogue Modeling"}, {"paperId": "759a9a202017d6a5083b21a63b762a62bcf8c733", "title": "Raising the Flag: Monitoring User Perceived Disinformation on Reddit"}, {"paperId": "028035b89da7cfccb41bf9639d82cc38cc8098a8", "title": "Data Leverage: A Framework for Empowering the Public in its Relationship with Technology Companies"}, {"paperId": "df493a38e57b295745e446c3529df0cee48c0759", "title": "A Novel Approach for Identifying Social Media Posts Indicative of Depression"}, {"paperId": "39681973637e16a5bfdd2269c97ebac071a00a4f", "title": "KOSMOS: Knowledge-graph Oriented Social media and Mainstream media Overview System"}, {"paperId": "ccfdc74a7e5cedecc4879ec6a0363a3ee8cf2dde", "title": "Analyzing Adverse Event Signal Detection with Publicly Available Web Sources"}, {"paperId": "fa6d244a469dc5ec862b4591852076f9b66f27c8", "title": "Data-Efficient Methods for Dialogue Systems"}, {"paperId": "381dabacd153f6d81e7878c9a44f88d27e2607ba", "title": "Cyber Buzz: Examining Virality Characteristics of Cybersecurity Content In Social Networks"}, {"paperId": "8a0f00731de478df520b09db65e17404494f90e3", "title": "Dank or not? Analyzing and predicting the popularity of memes on Reddit"}, {"paperId": "89415cc42492f5141f90fd7a958601536b4a9d3b", "title": "Enhancing data quality in real-time threat intelligence systems using machine learning"}, {"paperId": "e3a0a52665cd9f8b08c0fc85c7c0258cca362c1b", "title": "User-Dependent Neural Sequence Models for Continuous-Time Event Data"}, {"paperId": "ce1816b76803652d382e30c291fa2ac9f0c300e1", "title": "Machine Learning for Predicting Stock Market Movement using News Headlines"}, {"paperId": "af42ed7b612835820720d0820bf1e886edb1c312", "title": "Towards a Comprehensive Taxonomy and Large-Scale Annotated Corpus for Online Slur Usage"}, {"paperId": "7cd6f69fd39113ace2d052585e6bed0b7cafd088", "title": "Improving Dialogue Breakdown Detection with Semi-Supervised Learning"}, {"paperId": "1624c4af400a3ace70201a8fb5903b81596a41b7", "title": "Discovering and Interpreting Biased Concepts in Online Communities"}, {"paperId": "5bd3ed0713b1cfebd0a82988c8009b92543fc1ac", "title": "Discovering and Interpreting Conceptual Biases in Online Communities"}, {"paperId": "75f9cdd2551b7c2b2080b3b1845c1d40e5ce1666", "title": "Demystifying the Messaging Platforms' Ecosystem Through the Lens of Twitter"}, {"paperId": "3c64247b4c75c64b4a67d306200bab5b5d3b5bfa", "title": "Adding Chit-Chat to Enhance Task-Oriented Dialogues"}, {"paperId": "0f8cb4a6c794ee18d5f9177782cf07d000adffca", "title": "An Evaluation Protocol for Generative Conversational Systems"}, {"paperId": "c23893e334d7237793ba83ee96620e8c9c0e1168", "title": "Adding Chit-Chats to Enhance Task-Oriented Dialogues"}, {"paperId": "db500c4e746897e5d5adafbf222b959c512445ad", "title": "Customizing Triggers with Concealed Data Poisoning"}, {"paperId": "4c7c471a124ba8e16ca8d1aeae66dffa52167c11", "title": "Do Platform Migrations Compromise Content Moderation? Evidence from r/The_Donald and r/Incels"}, {"paperId": "880b0282005b9149facb91a8cb92067b0fca2fa1", "title": "Action Sequence Augmentation for Early Graph-based Anomaly Detection"}, {"paperId": "6c364dd9951488f63aac0932cb5ecb74dae800b8", "title": "Does Platform Migration Compromise Content Moderation? Evidence from r/The_Donald and r/Incels"}, {"paperId": "8e10b199058bdaa54598da61cbbdf8c0c91957f9", "title": "Understanding Community-Level Conflicts Through Reddit r/place"}, {"paperId": "4fa24cc5b17e8ff1eb5a01fd37a9d267a57ac563", "title": "Recipes for Safety in Open-domain Chatbots"}, {"paperId": "5217dcf45306c9781d2fe69f4f8543aabf06f258", "title": "Exploring Antecedents and Consequences of Toxicity in Online Discussions"}, {"paperId": "a2cde1da31a61adab24e702999680108ab58e5ff", "title": "COMETA: A Corpus for Medical Entity Linking in the Social Media"}, {"paperId": "cf58cbdaf475109da7c528e6d5d390ed97fba6b2", "title": "Multi-Modal Open-Domain Dialogue"}, {"paperId": "7b4783c176060d47d04c3bd12687fa10ffbd7e40", "title": "Quantifying social organization and political polarization in online platforms"}, {"paperId": "07e8ac289f0041e1d82741359bc1ec4149ceb030", "title": "Community embeddings reveal large-scale cultural organization of online platforms"}, {"paperId": "34b274329317b8e7aa8f8af60f3aa22ed7d87cbb", "title": "How to Motivate Your Dragon: Teaching Goal-Driven Agents to Speak and Act in Fantasy Worlds"}, {"paperId": "f69a8902ca5d250bc135e0cfcb7e7360401e302e", "title": "Understanding the Use of Fauxtography on Social Media"}, {"paperId": "75f061c958505ef5ecc0442d4bcc8fd4c4ee4688", "title": "Controlling Style in Generated Dialogue"}, {"paperId": "abab47e7f46c5fe17565873a08231a5fae72fe1e", "title": "Adjusting for Confounders with Text: Challenges and an Empirical Evaluation Framework for Causal Inference"}, {"paperId": "0e3e4b166784833d43a74c7893ea3c4695f3820c", "title": "What Makes People Join Conspiracy Communities?"}, {"paperId": "4c972fccf05173b618caab94b4de79115aa94fb9", "title": "Quantifying Depressed Social Media During COVID-19: Information Retrieval With ML & NLP"}, {"paperId": "2a030a3a61f031361d6509d0a321129c99b25ce4", "title": "Reading In-Between the Lines: An Analysis of Dissenter"}, {"paperId": "090648f65354977762a4624559e7f7b52ae17f58", "title": "Scruples: A Corpus of Community Ethical Judgments on 32, 000 Real-Life Anecdotes"}, {"paperId": "95a01a28a32dbd2b5b1eaa3be07358ce0c64339b", "title": "(A)synchronous Communication about TV Series on Social Media: A Multi-Method Investigation of Reddit Discussions"}, {"paperId": "aa2bbf5a1485cc90401e4a35c04463fcb4e632f0", "title": "Quantifying the Effects of COVID-19 on Mental Health Support Forums"}, {"paperId": "43b184a9912ecb6de0454892c68c82200f77f234", "title": "Discovering and Categorising Language Biases in Reddit"}, {"paperId": "46ec937a11e52eb8ac7687fa0a6d0dbf3e2d39e6", "title": "Tell Me What You Want: Embedding Narratives for Movie Recommendations"}, {"paperId": "8f249d55e365e8906dabdc0f68ca794511b6bfd8", "title": "The Polarizing Potential of Intergroup Affect in Online Political Discussions: Evidence From Reddit r/Politics"}, {"paperId": "5450f688fee4c654c5c1d4449a9356f1c54117c6", "title": "Troll and divide: the language of online polarization"}, {"paperId": "43a55355f0d2fd99362acc3613424a00fa8c32ce", "title": "Incorrect Data in the Widely Used Inside Airbnb Dataset"}, {"paperId": "951e8e62fdfd2f236d7c1a900fb330ad7c5a7063", "title": "Early Risk Detection of Self-Harm and Depression Severity using BERT-based Transformers"}, {"paperId": "70af4173983eccc0beac29ed4602bf9db5568b92", "title": "PLATO-2: Towards Building an Open-Domain Chatbot via Curriculum Learning"}, {"paperId": "b977401d49c685d2f6209fa15a730419ad4d3d7d", "title": "NLP-based Feature Extraction for the Detection of COVID-19 Misinformation Videos on YouTube"}, {"paperId": "18c54279a916293153db45e6db8422eaa52539cd", "title": "Open-Domain Conversational Agents: Current Progress, Open Problems, and Future Directions"}, {"paperId": "72751082da35ea78c5403266574dcd3be69af1dd", "title": "Patterns of Routes of Administration and Drug Tampering for Nonmedical Opioid Consumption: Data Mining and Content Analysis of Reddit Discussions"}, {"paperId": "8a07b7ac4e7aac7d7856718590c50f221accc254", "title": "A Tale of Two Communities: Characterizing Reddit Response to COVID-19 through /r/China_Flu and /r/Coronavirus"}, {"paperId": "05f8dd59d4184d38e240bdea4d58e424b8cd055c", "title": "Influence via Ethos: On the Persuasive Power of Reputation in Deliberation Online"}, {"paperId": "930fa23c8cbdfb72ef00f958114b4f18ca7dac1c", "title": "Deceptive Deletions for Protecting Withdrawn Posts on Social Platforms"}, {"paperId": "d5f4ab23a6f25da2403991afd0bc3ef884eadc88", "title": "Towards Using Word Embedding Vector Space for Better Cohort Analysis"}, {"paperId": "ccd16db1499fe683d449dc1981a223ef652d0547", "title": "Measuring and Characterizing Hate Speech on News Websites"}, {"paperId": "ed8ea9380d8b10ccd72fe428e61ec34c0d5b3aa4", "title": "Roots of Trumpism: Homophily and Social Feedback in Donald Trump Support on Reddit"}, {"paperId": "2fe6759b0e9757df70ca3db1e1dd9bd1c5a5bda5", "title": "The Effect of Natural Distribution Shift on Question Answering Models"}, {"paperId": "9b539d413393047b28bb7be9b195f142aaf7a80e", "title": "Recipes for Building an Open-Domain Chatbot"}, {"paperId": "1b297d8598b5a9688066a96e76cddcf99a98d970", "title": "PANDORA Talks: Personality and Demographics on Reddit"}, {"paperId": "7d1926413b06a9548f47c33f6bacbb3746a1002a", "title": "\"Trust me, I have a Ph.D.\": A Propensity Score Analysis on the Halo Effect of Disclosing One's Offline Social Status in Online Communities"}, {"paperId": "8118a2f6522b98b6be476326969a6868b75d55e6", "title": "YouTube Recommendations and Effects on Sharing Across Online Social Platforms"}, {"paperId": "c1ef86ec7777e99076d66d0351fd3db272715db5", "title": "Limitations of Imitation: Lessons from another Bitcoin Copycat"}, {"paperId": "5b9bc02aead2f26985cfbb3762dce554433db83d", "title": "\"How over is it?\" Understanding the Incel Community on YouTube"}, {"paperId": "6aeb161170f2cba8b17fa95d5eba5bc3aed607dc", "title": "Understanding the Incel Community on YouTube"}, {"paperId": "4743a52a95d31c49b34152f4e23ac4c1076ab4f2", "title": "From Pick-Up Artists to Incels: A Data-Driven Sketch of the Manosphere"}, {"paperId": "aa446f4b5f3051deaab87f8b19dbc2f885bb19f6", "title": "Technical talk in bitcoin and equity"}, {"paperId": "9dc598972edeff843c369a47db9d6cbe9816c9b4", "title": "Toxic Content Detection in online social networks: a new dataset from Brazilian Reddit Communities"}, {"paperId": "929d48d07f283473aacbf5aa83d936d6b06450b3", "title": "Extreme Views on Reddit: Information or Noise?"}, {"paperId": "e0d3a34ea616d181eedae9e56126e86daefdd2c8", "title": "Enhancing Dialogue Generation with Conversational Concept Flows"}, {"paperId": "a2eb0453f64f4ea97ffc0ba4dde53888762b768d", "title": "Improving the Detection of Multilingual Online Attacks with Rich Social Media Data from Singapore"}, {"paperId": "eee67e8820b8e9582d91cb90f2d65057c06f8cdf", "title": "Understanding the Perception and Awareness of Education Technologies’ Privacy and Security Issues"}, {"paperId": "efe860d5177f9f1b1db59df609f016414ccf930d", "title": "Identifying Slurs and Lexical Hate Speech via Light-Weight Dimension Projection in Embedding Space"}, {"paperId": "b7eb7abb0be339d66ce4d89196f4f3bde7ddbd7f", "title": "Empathetic Response Generation for Distress Support"}, {"paperId": "884d0de388c01b3c49ed2a79deb336fb5dfaa868", "title": "Lived Experience Matters: Automatic Detection of Stigma toward People Who Use Substances on Social Media"}, {"paperId": "a12bc4fc7184d3a43af4f196f697a565c606c52d", "title": "How does the audience affect the way we express our gender roles?"}, {"paperId": "6c46d7e44626c9634903ddc624df8a344f0277c4", "title": "Socratic Question Generation: A Novel Dataset, Models, and Evaluation"}, {"paperId": "d3620fcea4a53070b2d0a93e93251fa2452b2a9c", "title": "Participatory Conspiracy Culture"}, {"paperId": "d03bf32184a5157a0b2df88f04f9c3f0862f7aaa", "title": "To Boldly Prototype What Everyone Has Prototyped Before: The Voyages and Perspectives of Prototyping Novices"}, {"paperId": "ad250884e858b57daf33ff52c3ed253c709327da", "title": "Argot as a Trust Signal: Slang, Jargon & Reputation on a Large Cybercrime Forum"}, {"paperId": "60fc5e7ce1919d5261f0222f2a2c6ffc746a2619", "title": "Inference for mark-censored temporal point processes"}, {"paperId": "40af24f2cb70a1d9f7d02bb08d98fdb61cdf94e8", "title": "Frame-oriented Summarization of Argumentative Discussions"}, {"paperId": "ead1444a55151e4d2b9610c2598adb1aab4eb7d6", "title": "The Meaning of ‘Reasonable’: Evidence From a Corpus-Linguistic Study"}, {"paperId": "e6f08d161a2b8d367de11d9882a55cd998c5456c", "title": "Cross­Platform Reactions to the Post­January 6 Deplatforming"}, {"paperId": "3677526b2f925b22c04219222e1e47fb6309e7b5", "title": "The E�cacy of PRISTINE: Revealing Concealed Opioid Crisis Trends via Reddit Examination"}, {"paperId": "5d7e933794d8a6be26a0534420ec2abb23b8f0da", "title": "Exploring the Implementation of NLP Topic Modeling for Understanding the Dynamics of Informal Learning in an AI Painting Community"}, {"paperId": "9409ab924e5b8857ff9a179bf2d8e3c1e8e963dc", "title": "Measuring Ideological Spectrum Through NLP"}, {"paperId": "289564768fa2b4a5683e0e7f999f9a318fe16721", "title": "Accounting Rules and the Supply of Accountants"}, {"paperId": "7564a279f7f27e219783033e675ee4f909ab4b3d", "title": "Investigating Online Community Engagement through Stancetaking"}, {"paperId": "dd20cb2dfc8830007ee5fadcc4ef41eb494b08bd", "title": "Bubble up – A Fine-tuning Approach for Style Transfer to Community-specific Subreddit Language"}, {"paperId": "2725d16fbdc8b1811a5517be2d6787555be30cd7", "title": "Multi-Source Probing for Open-Domain Conversational Understanding"}, {"paperId": "d998fb3df08b3f456f491816f50103778542cb34", "title": "Methodological Insights in Detecting Subtle Semantic Shifts with Contextualized and Static Language Models"}, {"paperId": "08f7aeca8f94bedbeb425bef1f0b3fcd9361f785", "title": "SafetyKit: First Aid for Measuring Safety in Open-domain Conversational Systems"}, {"paperId": "02df396f75490f9f30edf91283ca6bcad9edbe6a", "title": "News Feeds and User Engagement: Evidence from the Reddit News Tab"}, {"paperId": "8b77cb298e119ed2010a7a2e1cd1b003cbadabe8", "title": "Towards Fine-grained Classification of Climate Change related Social Media Text"}, {"paperId": "795a2a9ea0bbb64fa4c070b3e9269bf114ed1e52", "title": "Conversational Bots for Psychotherapy: A Study of Generative Transformer Models Using Domain-specific Dialogues"}, {"paperId": "3f84a24cac1d568e3eecb6912466b466f285e3e0", "title": "Curating a Large-Scale Motivational Interviewing Dataset Using Peer Support Forums"}, {"paperId": "ab06a5c808bfd10680057b8b9899e669bcbc3e51", "title": "\"I'm sorry to hear that\": finding bias in language models with a holistic descriptor dataset"}, {"paperId": "5fa273f7db53ef98d3789b26a8f2dcf3b71fe005", "title": "Empirical study on BlenderBot 2.0’s Errors Analysis in terms of Model, Data and User-Centric Approach"}, {"paperId": "9ae39b1b2a029bd0134c4e115136a7acd91d0fd3", "title": "\"I can't keep it up anymore.\" The Voat.co dataset"}, {"paperId": "7d4a18c5cd6c739b4b445094cd658142da739782", "title": "“I Can’t Keep It Up Anymore.” A Dataset from the Defunct Voat.co News Aggregator"}, {"paperId": "3114b445230aa29141bd727387c5107a087d0f14", "title": "Distinguishing In-Groups and Onlookers by Language Use"}, {"paperId": "a64b0bbedbc043d0df9e92ae048acab986563ac9", "title": "The Polarizing Impact of Continuous Presence on Users' Behavior"}, {"paperId": "4cfe6e734d70806818b961933cd29064432fac08", "title": "There are N Impostors Among Us: Understanding the Effect of State-Sponsored Troll Accounts on Reddit Discussions"}, {"paperId": "ce680d0e2da39a5ba0c62a3a184f5561340b0884", "title": "Public perception of electric vehicles on reddit over the past decade"}, {"paperId": "cbb726c0b8f7323926a0734e4bb5f09d0258c941", "title": "Nonsuicidal Self-Injury and Substance Use Disorders: A Shared Language of Addiction"}, {"paperId": "830dfc2bb6bfafa9609893227d519ac3c22b5fab", "title": "How do people talk about images? A study on open-domain conversations with images."}, {"paperId": "bb88d49032770ddd306c0e1b5d98676ee01ce692", "title": "‘Am I the Bad One’? Predicting the Moral Judgement of the Crowd Using Pre–trained Language Models"}, {"paperId": "53f5a5e614f4d18a48aa284121e341ae66df682e", "title": "Estimating the Impact of Coordinated Inauthentic Behavior on Content Recommendations in Social Networks"}, {"paperId": "4ec1114c98565aaf47623b42725ba9d842e215dd", "title": "Ready Player Viz: Player-Created Strategic Visualizations for Video Games"}, {"paperId": "f0b5a213078c3538e56503fae8bc77bdd3297234", "title": "Tracking causal relations in the news: data, tools, and models for the analysis of argumentative statements in online media"}, {"paperId": "107e21a674fd1213a54ba411d61a112f85710d58", "title": "Scoping the Institute for Research on the Information Environment"}, {"paperId": "9751274d247da029a7812f98bda13e87beb43ed2", "title": "Topic-Regularized Authorship Representation Learning"}, {"paperId": "3295b719a5c3bd8cd6dae0b48a3cd58f4537cbdd", "title": "Conditional Language Models for Community-Level Linguistic Variation"}, {"paperId": "4c3551ed42fde3ec2cabac9312f21efb2595d5cc", "title": "Modelling subreddit interactions by activity overlap"}, {"paperId": "18bf0ad338709a0fe7e689a71102f32e6e510612", "title": "Multimodal Conversation Modelling for Topic Derailment Detection"}, {"paperId": "259b7a01700c39d5669e88d1434873ea38a13528", "title": "In-Context Policy Iteration"}, {"paperId": "7cca3d2f4267adf1f3339f7a39c0556f90c296a2", "title": "Sexualization of Children in Deepfakes and Hentai: Examining Reddit User Views"}, {"paperId": "9f92b16e10f3df98398871e5983cc391e46f7d5d", "title": "Scalable Computing: Practice and Experience"}, {"paperId": "94dcfda5daa49c090e41a72c5b6b19536cf9b3d2", "title": "Few-shot Authorship Attribution in English Reddit Posts"}, {"paperId": "35a09e5ca05c1100637edacd7800a5508cc9e9fc", "title": "Same Author or Just Same Topic? Towards Topic-Independent Style Representations"}, {"paperId": "518b8538df7e2f20b2789addf24310a348712b0d", "title": "GRILLBot: A flexible conversational agent for solving complex real-world tasks"}, {"paperId": "95475cb4b59badd833846fe59c2f17d08605bf99", "title": "Are Metal Fans Angrier than Jazz Fans? A Genre-Wise Exploration of the Emotional Language of Music Listeners on Reddit"}, {"paperId": "94b8305a6b3469dc85af58c74ea93a0e16fb112f", "title": "What Sounds “Right” to Me? Experiential Factors in the Perception of Political Ideology"}, {"paperId": "3649f3cf214d4287f061de8d7139340b15838062", "title": "From the Stage to the Audience: Propaganda on Reddit"}, {"paperId": "1c8bda8ac573c1496aa91088e22d0b41215ddb7e", "title": "Grounding as a Collaborative Process"}, {"paperId": "aa21a790994f8e404f6e444237b1f891666d2313", "title": "Modeling Ideological Agenda Setting and Framing in Polarized Online Groups with Graph Neural Networks and Structured Sparsity"}, {"paperId": "d592042dd93f1523ccc4646adc66b6d6e53adda5", "title": "Predicting COVID-19 Cases using Reddit Posts and other Online Resources (short paper)"}, {"paperId": "a8ad7261b533bb10b59d971b168e2d6ea8104c35", "title": "Jibes & Delights: A Dataset of Targeted Insults and Compliments to Tackle Online Abuse"}, {"paperId": "a4f04b7a199f22351f806e7aeb1facd1ad23e56b", "title": "On the Need for Thoughtful Data Collection for Multi-Party Dialogue: A Survey of Available Corpora and Collection Methods"}, {"paperId": "ecb7eea12891d96c58d05f23afad5f5a3dc9c5f2", "title": "Early Detection of Signs of Pathological Gambling, Self-Harm and Depression through Topic Extraction and Neural Networks"}, {"paperId": "84166c6920960b0ce128a7359a6d18196d915fc3", "title": "UNSL at eRisk 2021: A Comparison of Three Early Alert Policies for Early Risk Detection"}, {"paperId": "7bf7e1d980f8cedb8dba34d6041a2c2ac7c86f36", "title": "Reddit-TUDFE: practical tool to explore Reddit usability in data science and knowledge processing"}, {"paperId": "90d0e2fa3a811b12ed1d3b3fc2ab17836742801d", "title": "How Well Do You Know Your Audience? Reader-aware Question Generation"}, {"paperId": "c71f40033cb0f8e76ef28e504240ae14317a5094", "title": "Learning Universal Authorship Representations"}, {"paperId": "d03e46ce67d690de0f69057ab27192cf7d0fb48e", "title": "DEBAGREEMENT: A comment-reply dataset for (dis)agreement detection in online debates"}, {"paperId": "9e43717321b82e4e412c40163b64a7374e04bf20", "title": "A Feasibility Study to implement Next Word Prediction Model using Federated Learning on Raspberry Pi"}, {"paperId": "1e4612fd7b392c4694b1957403bbafaa492d241f", "title": "Self-induced emergence of consensus in social networks: Reddit and the GameStop short squeeze"}, {"paperId": "ae5cfcd7f53a5efe0a19e769796b534c33637f59", "title": "Membership Inference Attacks Against NLP Classiﬁcation Models"}, {"paperId": "bcf086239b9d0ddc12fb88c1b57b56928f36f16b", "title": "Breaking Down the Invisible Wall of Informal Fallacies in Online Discussions"}, {"paperId": "54efe3aadf8d793f0332c8c213a09fc7d2ff15c8", "title": "Aligning Multidimensional Worldviews and Discovering Ideological Differences"}, {"paperId": "8c6fbc2791f9a886d19694d00ebfc0ee5d0c3fbe", "title": "FANATIC: FAst Noise-Aware TopIc Clustering"}, {"paperId": "3556a8e4ef339d3b24db0a851cbd683fa95a0722", "title": "Ego Network Structures in Multilayer Online Social Networks"}, {"paperId": "b2dfa4c0e8a80585f3da8ff487bf408323d9f2d3", "title": "A Dialogue Dataset Containing Emotional Support for People in Distress"}, {"paperId": "3e07e0e4c13f01062429e566865a738783216f39", "title": "The Designated Project Committee Approves on the Project Titled ANALYZING PUBLIC SENTIMENT ON COVID-19 PANDEMIC by Pradeepika Gedupudi"}, {"paperId": "2223e80b00eadf1ec6b4ea62fda2c2eeae3bbcbf", "title": "How do people talk about images? A study on open-domain conversation on images."}, {"paperId": "ca5850fc6ef6abba0b3f7d79e309d169a457d2ad", "title": "\"We won't even challenge their lefty academic definition of racist: \" Understanding the Use of e-Prints on Reddit and 4chan"}, {"paperId": "9eae922928b13ef6111da6d60e855e71c3848396", "title": "S AFETY B ENCH : Identifying Safety-Sensitive Situations for Open-domain Conversational Systems"}, {"paperId": "b6854dc4005ddc0b9d78f970d1cbca5e80439055", "title": "Hate Speech and Counter Speech Detection: Context Does Matter"}, {"paperId": "ca8465f3892cdd9c47c8168a5ff6ef7abf9f0b2b", "title": "UPV-Symanto at eRisk 2021: Mental Health Author Profiling for Early Risk Prediction on the Internet"}, {"paperId": "d1b46d12ca867140227e37b55db796d067d6bd2d", "title": "Personalizing Marked Temporal Point Process Models"}, {"paperId": "6503ae3920061b37f59c312b9d1e3771e34cb205", "title": "Capturing Political Polarization of Reddit Submissions in the Trump Era"}, {"paperId": "0b7369a45af941844a72500f12202aa479575c76", "title": "UVM ScholarWorks UVM ScholarWorks Exploring Incel Language and Subreddit Activity on Reddit Exploring Incel Language and Subreddit Activity on Reddit"}, {"paperId": "aa56123a816226be7f7bd25b74784c8a2b2f5e8b", "title": "Linguistic calibration through metacognition: aligning dialogue agent responses with expected correctness"}, {"paperId": "76a9d79cfdfbdb16cc26f8b93e2c1a01164896d1", "title": "Master Computer Science A network-driven understanding of user interaction in topical online communities"}, {"paperId": "ad6a64be7d866daf0971c5a327caa5024f6cdd43", "title": "coronavirus people virus case"}, {"paperId": "46fb83b95b83ebabf3382094fd32d6b3c18bb2fa", "title": "Opleiding Informatica Using sentiment analysis on tweets for predicting cryptocurrency price movements: A case study"}, {"paperId": "64fa08ea409dfe041d644ffcec7aaa2657d295c9", "title": "Proceedings of the Annual Meeting of the Cognitive Science Society"}, {"paperId": "9d0ab1aad741cdd8aca079e7a372af0dda85734d", "title": "eP-ALM: Eﬀicient Perceptual Augmentation of Language Models"}, {"paperId": "bba47079d385bab0facf4527d5da35b7ff0a5c3d", "title": "Basic Arithmetic Properties in the Space of Language Model Prompts"}, {"paperId": "31402e716c2952afec2724090725aa1731d53d1b", "title": "A Pretrained Language Model for Mental Health Risk Detection"}]}
