{"paperId": "1a798167b24473cb73c4c5e28c1af5d952c4c747", "publicationVenue": null, "title": "Iris: Amortized, Resource Efficient Visualizations of Voluminous Spatiotemporal Datasets", "abstract": "The growth in observational data volumes over the past decade has occurred alongside a need to make sense of the phenomena that underpin them. Visualization is a key component of the data wrangling process that precedes the analyses that informs these insights. The crux of this study is interactive visualizations of spatiotemporal phenomena from voluminous datasets. Spatiotemporal visualizations of voluminous datasets introduce challenges relating to interactivity, overlaying multiple datasets and dynamic feature selection, resource capacity constraints, and scaling. In this study we describe our methodology to address these challenges. We rely on a novel mix of algorithms and systems innovations working in concert to ensure effective apportioning and amortization of workloads and enable interactivity during visualizations. In particular our research prototype, Iris, leverages sketching algorithms, effective query predicate generation and evaluation, avoids performance hotspots, harnesses coprocessors for hardware acceleration, and convolutional neural network based encoders to render visualizations while preserving responsiveness and interactivity. We also report on several empirical benchmarks that demonstrate the suitability of our methodology to preserve interactivity while utilizing resources effectively to scale.", "venue": "2020 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "pages": "47-56"}, "authors": [{"authorId": "1434550792", "name": "Kevin Bruhwiler"}, {"authorId": "3438590", "name": "Thilina Buddhika"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": []}
