{"paperId": "1a9e2434376f96f8a4b796740de4dd888d3c3899", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Pilot Contamination Elimination for Channel Estimation with Complete Knowledge of Large-Scale Fading in Downlink Massive MIMO Systems", "abstract": "Massive multiple–input multiple-output (MIMO) is a very important technology for future fifth generation systems (5G). However, massive MIMO systems are still limited because of pilot contamination (PC), which impacts the data rate (DR) due to the non-orthogonality of pilot sequences transmitted by users in the same cell to the neighbouring cells. We propose a channel estimation with complete knowledge of large-scale fading by using an orthogonal pilot reuse sequence (PRS) to eliminate PC in edge users with poor channel quality based on the estimation of largescale fading and performance analysis of maximum ratio transmission (MRT) and zero forcing (ZF) precoding methods. We derived the lower bounds on the achievable downlink DR and signal-to interference noise ratio (SINR) based on assigning PRS to a user grouping that mitigated this problem when the number of antenna elements M → ∞. The simulation results showed that a high DR can be achieved due to better channel estimation and reduced performance loss.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-25", "journal": {"name": "ArXiv", "volume": "abs/2106.13507"}, "authors": [{"authorId": "123456218", "name": "Qazwan Abdullah  (غزوان عبد الله محمد طربوش)"}, {"authorId": "2143201805", "name": "Norsaliza Abdullah"}, {"authorId": "2087062609", "name": "A. Salh"}, {"authorId": "1874985", "name": "L. Audah"}, {"authorId": "29393103", "name": "N. Farah"}, {"authorId": "2115145489", "name": "Abbas Uğurenver"}, {"authorId": "2136002047", "name": "Abdu Saif"}], "citations": [{"paperId": "dab70266b80b43a519f5a0e637fb2744bdb45d75", "title": "Enhancing 5G Massive MIMO Systems Using a Compressive Sensing-Based Approach"}, {"paperId": "6a4ce87dc9ca323327dcdfcde379c6375204b026", "title": "Channel estimation of mmWave Massive MIMO System using multi cell-based Pilot allocation protocol integrated with deep neural network"}, {"paperId": "abf526370b55e7b892d862760eb15af73c53422d", "title": "Pilotcontamination analysis of Massive MIMO 5G networks based on HetNets weighted scheduling with reinforcement markov encoder model"}, {"paperId": "5ef05c3f45f69b5bdc5b4af9d99444ec35b46fd6", "title": "Survey of Micro Fluidic Phased Array Antenna for Beam Steering Techniques"}, {"paperId": "0b80609992f64c19d9e38a671c13665d826996d4", "title": "Estimation Large- Scale Fading Channels for Transmit Orthogonal Pilot Reuse Sequences in Massive MIMO System"}, {"paperId": "31ed980ddc0983031e097659a16c28a22ef77dd0", "title": "Deployment of Polar Codes for Mission-Critical Machine-Type Communication Over Wireless Networks"}, {"paperId": "dcffbe3836bda703cd8d821a7deacffe397b00ee", "title": "Development of A Fully Data-Driven Artificial Intelligence and Deep Learning for URLLC Application in 6G Wireless Systems: A Survey"}, {"paperId": "d7c7afb82abb9fee91666caf6787998521b6380c", "title": "Review of Internet Things (IoT) of Security Threats and Challenges"}, {"paperId": "6d6a97ae9889e698db0733bc528b96836619e07d", "title": "Channel Estimation Based on Compressed Sensing for Massive MIMO Systems With Lens Antenna Array"}]}
