{"paperId": "1aa5c416966bec3dc2b9fa63ce651d0fa3a9fd3b", "publicationVenue": null, "title": "Comparison of Top 100 Cited Research on Machine Learning and Deep Learning in The Last Twenty Years", "abstract": "Objective: The aim is to compare the top 100 research related to machine learning (ML) and deep learning (DL) during 2002-2021 using bibliometric analysis. Method: The data were obtained from Scopus. The data taken in this research were selected from 100 articles with the highest citation in the range from 2002 to 2021. Bibliometric analysis is used in this research. Data from Scopus is exported in the form of .csv form which is processed using Ms. Excel and form of .ris which is processed using VOSviewer.  Results:  The results showed that the trend of ML and DL increased every year. The most widely published document types in ML are articles, while DL is in the form of conference papers. The highest year-wise distribution of publishing ML and DL occurred in 2017. ML advantages are in terms of requires less data and take less time to train, while the DL advantages in terms of higher accuracy than ML, available to tuned in various different ways. Novelty: This research being able to provide an overview for future researchers regarding the trend of ML and DL topics so that the resulting paper can provide various benefits for the coming year. In addition, it can provide broader knowledge about ML and DL itself. Further research can be carried out more intensively using data based on the Web of Science, in addition to the Scopus database.", "venue": "International Journal of Emerging Research and Review", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-31", "journal": {"name": "International Journal of Emerging Research and Review"}, "authors": [{"authorId": "48289815", "name": "Y. Anistyasari"}, {"authorId": "73091586", "name": "B. Prahani"}, {"authorId": "2162716898", "name": "M. C. Pristianti"}, {"authorId": "2278074023", "name": "Tan Amelia"}, {"authorId": "2278488888", "name": "Paken Pandingangan"}, {"authorId": "2179768779", "name": "Rizki Fitri Rahima Uulaa"}, {"authorId": "2219502968", "name": "Mohammad Walid Rasuliy"}], "citations": []}
