{"paperId": "1ab0131b55aeea7f8be536b970de111fef786b5a", "publicationVenue": null, "title": "Assessing Transition-Based Test Selection Algorithms at Google", "abstract": "Continuous Integration traditionally relies on testing every code commit with all impacted tests. This practice requires considerable computational resources, which at Google scale, results in delayed test results and high operational costs. To deal with this issue and provide fast feedback, test selection and prioritization methods aim to execute the tests which are most likely to reveal changes in test results as soon as possible. In this paper we present a simulation framework to support the study and evaluation, with real data, of such techniques. We propose a test selection algorithm evaluation method, and detail several practical requirements which are often ignored by related work, such as the detection of transitions, the collection and analysis of data, and the handling of flaky tests. Based on this framework, we design an experiment evaluating five potential regression test selection algorithms, based on simple heuristics and inspired by previous research, though the evaluation technique is applicable to any number of algorithms for future experiments. Our results show that algorithms based on the recent (transition) execution history do not perform as well as expected (given the previously reported results) and that the test selection problem remains largely open. We found that the best performing algorithms are based on the number of times a test has been triggered and the number of distinct authors committing code that triggers particular tests. More research is needed in order to close the gap between the current approaches and the optimal solution.", "venue": "2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-05-27", "journal": {"name": "2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "pages": "101-110"}, "authors": [{"authorId": "146390001", "name": "Claire Leong"}, {"authorId": "2110052844", "name": "Abhayendra Singh"}, {"authorId": "37766916", "name": "Mike Papadakis"}, {"authorId": "47681863", "name": "Y. L. Traon"}, {"authorId": "10997040", "name": "John Micco"}], "citations": [{"paperId": "991d1d78ff01ee2a3fd3fdd6b72342dd6e7ee900", "title": "Time-based Repair for Asynchronous Wait Flaky Tests in Web Testing"}, {"paperId": "9653e1af0491dbfec6ecab5133fb182156298dad", "title": "Test Selection for Unified Regression Testing"}, {"paperId": "72b07e6004eee667eb3ce7ce1607664b92b2a2e0", "title": "FlakyCat: Predicting Flaky Tests Categories using Few-Shot Learning"}, {"paperId": "f8b793e944f6a5ba8ecbee5ff82a8291e6d09567", "title": "Flake Aware Culprit Finding"}, {"paperId": "2763e1e28d2b8f57bc916d8f2858c4f13ff9cde8", "title": "Severity-Aware Prioritization of System-Level Regression Tests in Automotive Software"}, {"paperId": "f5d0bf2d59260d6164f93dbf2980f5aba0b23cb8", "title": "The Importance of Discerning Flaky from Fault-triggering Test Failures: A Case Study on the Chromium CI"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "5256f2da6ccb01c73576f8aa3e95c8a11b715274", "title": "What Made This Test Flake? Pinpointing Classes Responsible for Test Flakiness"}, {"paperId": "b8410615dbba111166441fc4182486d343543ff9", "title": "On the use of commit-relevant mutants"}, {"paperId": "28e418b8854c51638f518135adb8bc5eeacf6226", "title": "FlakiMe: Laboratory-Controlled Test Flakiness Impact Assessment"}, {"paperId": "ed34d88092deb56d7694602d88da710018447313", "title": "Challenges in Regression Test Selection for End-to-End Testing of Microservice-based Software Systems"}, {"paperId": "f05a5c3520f6aad5e430de978a35b84fa3ce911d", "title": "A Qualitative Study on the Sources, Impacts, and Mitigation Strategies of Flaky Tests"}, {"paperId": "66c0756950fda52249d9a960267a3feb7cbf3944", "title": "Discerning Legitimate Failures From False Alerts: A Study of Chromium's Continuous Integration"}, {"paperId": "bc95c88191bef5bc909bdfb7051d49b7208eaf5c", "title": "Data-driven test selection at scale"}, {"paperId": "bdab29415be76e68d3c98defb72fc882d9daaf42", "title": "Empirically evaluating readily available information for regression test optimization in continuous integration"}, {"paperId": "91119319745c15d1d628b6dcb87251f981014c36", "title": "Continuous test suite failure prediction"}, {"paperId": "074bba8963a9438fc3479ac92c30c67c9adc8e1c", "title": "A Replication Study on the Usability of Code Vocabulary in Predicting Flaky Tests"}, {"paperId": "13fc779909217cc341129a860f9fe0991d39b7a6", "title": "MuDelta: Delta-Oriented Mutation Testing at Commit Time"}, {"paperId": "1a7bf5dd47251b428bba02b9b911075747a63f4f", "title": "On the Use of Mutation in Injecting Test Order-Dependency"}, {"paperId": "e6c8e50fc573b7e2e09da29cc269d97239f1650f", "title": "What Helped, and what did not? An Evaluation of the Strategies to Improve Continuous Integration"}, {"paperId": "dc1b7128c9156206bab48c0effbda1036d04d32d", "title": "Root causing, detecting, and fixing flaky tests: State of the art and future roadmap"}, {"paperId": "08a8e17b471582467b21c21bea72ffeee6026b98", "title": "Commit-Aware Mutation Testing"}, {"paperId": "68598f59698ededb65d997803db708b7ec7cb853", "title": "Empirically revisiting and enhancing IR-based test-case prioritization"}, {"paperId": "16bebbfa0e41c31cf4b2d0203cfc30f85c841b54", "title": "FlakiMe: Laboratory-Controlled Test Flakiness Impact Assessment. A Case Study on Mutation Testing and Program Repair"}, {"paperId": "32cbefa9d54f3663f855014f967229e46f350da0", "title": "Empirical analysis of practitioners' perceptions of test flakiness factors"}, {"paperId": "c540a6900b8d1348fb8e488edd2072b8543de929", "title": "Know You Neighbor: Fast Static Prediction of Test Flakiness"}, {"paperId": "867490b8045c30e9474501ddaf73acd0f9127581", "title": "Testing Industrial Robotic Systems: A New Battlefield!"}, {"paperId": "15c73cff6a30c818e66b16f9a0dd3ad9c96aaaf0", "title": "Cost of Flaky Tests in Continuous Integration: An Industrial Case Study"}]}
