{"paperId": "1abfc297310a653d7c54a19734e184d8b88ed6a4", "publicationVenue": null, "title": "Industrial Process Monitoring and Fault Diagnosis Based on Hybrid Discriminant Analysis", "abstract": "Industrial process data has the characteristics of large scale, high complexity, multivariable and strong correlation. There is great signiﬁcance on how to ﬁnd out and deal with the fault from data accurately and quickly, which can help ensure the eﬃcient operation of the process. The paper proposed a hybrid multi-method process monitoring and fault diagnosis framework for the complex industrial process. The framework include the data classiﬁcation, model library establishment, timely diagnosis. Firstly, the historical data is simply screened by principal component analysis (PCA) methods to distinguish normal and fault information. Then the clustering method is used to classify the fault data set, and the fault model libraries are established by local linear exponential discriminant analysis (LLEDA) method. Finally, the fault diagnosis is carried out. The LLEDA method based on supervised learning is extended to unsupervised learning, which facilitates the processing of a large number of unlabeled data in complex industries. Finally, a typical Tennessee Eastman process is used to verify the eﬀectiveness of the proposed method.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2285972819", "name": "Xiao-Lu Chen"}, {"authorId": "2108666566", "name": "Ruixuan Wang"}, {"authorId": "2093180209", "name": "Wang Jing"}, {"authorId": "2286155112", "name": "Jing-Lin Zhou"}, {"authorId": "2285958500", "name": "Jing-Lin"}], "citations": [{"paperId": "436ca0f81df8f65463015e3863246a9eb5fbe833", "title": "Visualization Monitoring of Industrial Detonator Automatic Assembly Line Based on Digital Twin"}, {"paperId": "4bb82722fac9b26d44c16d475f1da524b5df3059", "title": "Monitoring method for abnormal conditions of cement pre-decomposition based on PCA and MA-OCSVM algorithm"}]}
