{"paperId": "1ac6b3a3904b6c9022206be7c0b9d180b84b1fb4", "publicationVenue": {"id": "289bfdda-eab3-4c9a-97be-ef1e0f9ddfc0", "name": "International Symposium on Software Testing and Analysis", "type": "conference", "alternate_names": ["ISSTA", "Int Symp Softw Test Anal"], "url": "https://dl.acm.org/conference/issta"}, "title": "Unicorn: detect runtime errors in time-series databases with hybrid input synthesis", "abstract": "The ubiquitous use of time-series databases in the safety-critical Internet of Things domain demands strict security and correctness. One successful approach in database bug detection is fuzzing, where hundreds of bugs have been detected automatically in relational databases. However, it cannot be easily applied to time-series databases: the bulk of time-series logic is unreachable because of mismatched query specifications, and serious bugs are undetectable because of implicitly handled exceptions. In this paper, we propose Unicorn to secure time-series databases with automated fuzzing. First, we design hybrid input synthesis to generate high-quality queries which not only cover time-series features but also ensure grammar correctness. Then, Unicorn uses proactive exception detection to discover minuscule-symptom bugs which hide behind implicit exception handling. With the specialized design oriented to time-series databases, Unicorn outperforms the state-of-the-art database fuzzers in terms of coverage and bugs. Specifically, Unicorn outperforms SQLsmith and SQLancer on widely used time-series databases IoTDB, KairosDB, TimescaleDB, TDEngine, QuestDB, and GridDB in the number of basic blocks by 21%-199% and 34%-693%, respectively. More importantly, Unicorn has discovered 42 previously unknown bugs.", "venue": "International Symposium on Software Testing and Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-07-18", "journal": {"name": "Proceedings of the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis"}, "authors": [{"authorId": "2146253995", "name": "Zhiyong Wu"}, {"authorId": "2118673419", "name": "Jie Liang"}, {"authorId": "2433617", "name": "Mingzhe Wang"}, {"authorId": "83359050", "name": "Chijin Zhou"}, {"authorId": "2143496230", "name": "Yu Jiang"}], "citations": [{"paperId": "5ff9885778f8ec824beaeb6802af5c82e299f702", "title": "A Comprehensive Survey on Database Management System Fuzzing: Techniques, Taxonomy and Experimental Comparison"}, {"paperId": "c4a6a53c4c859e6d4c71ae122272a5e7bf91a163", "title": "Towards Better Semantics Exploration for Browser Fuzzing"}, {"paperId": "058f7a552121c7417e783c995f8bc584d09b3eff", "title": "Sequence-Oriented DBMS Fuzzing"}, {"paperId": "08ad81f6da3080374d378a20949d8dde87706a89", "title": "Minerva: browser API fuzzing with dynamic mod-ref analysis"}, {"paperId": "5b15efecca0f9f42e9d7842a8ec6689d2f45bc6a", "title": "Griffin : Grammar-Free DBMS Fuzzing"}, {"paperId": "c5c2bcb84acde8c7fe8964aba2d6d27f220ae80b", "title": "Pinolo: Detecting Logical Bugs in Database Management Systems with Approximate Query Synthesis"}]}
