{"paperId": "1ac9b569f8e0b9edb4a185ddefdd92c1e8faa1cb", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Evaluating the Impact of Public Participation Processes on Participants in Smart City Development: A Scoping Review", "abstract": "This paper provides an overview of the current state of research on the evaluation methods of participatory processes in smart cities. Specifically, it aims to identify and analyze existing evaluation methods and frameworks for public participation (PP) in smart city development. The study focuses on the evaluation of participatory processes to find key indicators and enable an assessment of PP from multiple perspectives. A scoping literature review was conducted to analyze the past ten years of scientific literature on the topic. Relevant literature was retrieved from Scopus, Web of Science, and Google Scholar, and articles were selected based on a set of criteria to ensure quality and relevance. We found that digital participation, also known as “e-participation”, is the most used method either exclusively or mixed with in-person methods. The level of participation achieved was mostly limited to the first two degrees of PP (i.e., information and consultation), and only a few papers addressed the highest degrees (i.e., agenda-setting and co-management). The impact on participants was mostly related to knowledge and skills, awareness raising, and satisfaction with the process and method. This paper highlights the potential to upskill citizens and enhance their understanding of sustainable urban development, fostering their commitment to achieving the United Nations’ sustainability goals for climate change mitigation in the urban context.", "venue": "Buildings", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-08", "journal": {"name": "Buildings"}, "authors": [{"authorId": "1752601535", "name": "C. Senior"}, {"authorId": "2126403453", "name": "A. Temeljotov Salaj"}, {"authorId": "38991510", "name": "Agnar Johansen"}, {"authorId": "21269524", "name": "Jardar Lohne"}], "citations": [{"paperId": "fc77cd81abcb3b91a2185b1e523e0e973f4a8b62", "title": "Urban Heritage Facility Management: A Conceptual Framework for the Provision of Urban-Scale Support Services in Norwegian World Heritage Sites"}, {"paperId": "6389f4911043c2d60c0d7d90cefaa14ebd659a4e", "title": "Smart Cities and Urban Energy Planning: An Advanced Review of Promises and Challenges"}, {"paperId": "f0687827e750157de9bc4afa248fb66bc7e7dd16", "title": "Methods and measures to evaluate the impact of participatory model building on public policymakers: a scoping review protocol"}, {"paperId": "56619c77dd9ebf2cd53f4fdd4cc9fa34c2205ee4", "title": "Usefulness of a Civic Engagement Scale for Research on Smart Cities: Measuring Attitudes and Behavior"}]}
