{"paperId": "1add047298154e27d8ef732e6c73c2f1c91eba23", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Optimizing Video Analytics with Declarative Model Relationships", "abstract": "The availability of vast video collections and the accuracy of ML models has generated significant interest in video analytics systems. Since naively processing all frames using expensive models is impractical, researchers have proposed optimizations such as selectively using faster but less accurate models to replace or filter frames for expensive models. However, these optimizations are difficult to apply on queries with multiple predicates and models, as users must manually explore a large optimization space. Without significant systems expertise or time investment, an analyst may manually create an execution plan that is unnecessarily expensive and/or terribly inaccurate.\n \n We propose\n Relational Hints\n , a declarative interface that allows users to suggest ML model relationships based on domain knowledge. Users can express two key relationships: when a model can replace another (CAN REPLACE) and when a model can be used to filter frames for another (CAN FILTER). We aim to design an interface to express\n model relationships informed by domain specific knowledge\n and define the constraints by which these relationships hold. We then present the\n VIVA video analytics system\n that uses relational hints to optimize SQL queries on video datasets. VIVA automatically selects and validates the hints applicable to the query, generates possible query plans using a formal set of transformations, and finds the best performance plan that meets a user's accuracy requirements. VIVA relieves users from rewriting and manually optimizing video queries as new models become available and execution environments evolve. We evaluate VIVA implemented on top of Spark and show that hints improve performance up to 16.6X without sacrificing accuracy.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "447-460", "volume": "16"}, "authors": [{"authorId": "103852091", "name": "Francisco Romero"}, {"authorId": "2546385", "name": "Johann Hauswald"}, {"authorId": "2273184486", "name": "Aditi Partap"}, {"authorId": "35342489", "name": "Daniel Kang"}, {"authorId": "143834867", "name": "M. Zaharia"}, {"authorId": "117272782", "name": "Christos Kozyrakis"}], "citations": [{"paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a", "title": "Hydro: Adaptive Query Processing of ML Queries"}, {"paperId": "87ab29cd19e83f6101a2d23b1d66a03f8dcab22d", "title": "Predictive and Near-Optimal Sampling for View Materialization in Video Databases"}, {"paperId": "3fd4c19b49143e5a72877028f028b679fbdb5445", "title": "Bias and Diversity in Synthetic-based Face Recognition"}, {"paperId": "4057dac4f2369ee4b072854e219c71364c9d0d87", "title": "VQPy: An Object-Oriented Approach to Modern Video Analytics"}, {"paperId": "0044c39df8e6fc2a55f5c536aa286ec7dca290b0", "title": "Spatialyze: A Geospatial Video Analytics System with Spatial-Aware Optimizations"}, {"paperId": "7180d6d478e265efed74e2742b43857d88572327", "title": "Rethinking Similarity Search: Embracing Smarter Mechanisms over Smarter Data"}, {"paperId": "255f28a73d9e5e93a4b87e04d5de4fca2fd70567", "title": "EVA: An End-to-End Exploratory Video Analytics System"}, {"paperId": "20d2df4e9f301d4229f949fc2a70ea154f0cd24e", "title": "Challenges in Metaverse Research: An Internet of Things Perspective"}, {"paperId": "eeab466d688b94133950788eaf8d1bf33bf037cb", "title": "Zelda: Video Analytics using Vision-Language Models"}, {"paperId": "97e8e9ad3862629bacb28b994f2d5d52a2371c00", "title": "Extract-Transform-Load for Video Streams"}, {"paperId": "abe7cb5a5b9941178ab127c0ac570f871f73d1d0", "title": "VOCALExplore: Pay-as-You-Go Video Data Exploration and Model Building"}]}
