{"paperId": "1ade772f489b4027b3fed3a5869988bc0ea56034", "publicationVenue": {"id": "ef485645-f75f-4344-8b9d-3c260e69503b", "name": "npj Digital Medicine", "alternate_names": ["npj Digit Med"], "issn": "2398-6352", "url": "http://www.nature.com/npjdigitalmed/"}, "title": "Desiderata for delivering NLP to accelerate healthcare AI advancement and a Mayo Clinic NLP-as-a-service implementation", "venue": "npj Digital Medicine", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "NPJ Digital Medicine", "volume": "2"}, "authors": [{"authorId": "32273102", "name": "Andrew Wen"}, {"authorId": "145097134", "name": "S. Fu"}, {"authorId": "2751715", "name": "Sungrim Moon"}, {"authorId": "66370061", "name": "Mohamed El Wazir"}, {"authorId": null, "name": "Andrew Rosenbaum"}, {"authorId": "46599651", "name": "V. Kaggal"}, {"authorId": "30986714", "name": "Sijia Liu"}, {"authorId": "2267995", "name": "S. Sohn"}, {"authorId": "50793079", "name": "Hongfang Liu"}, {"authorId": "1470658832", "name": "Jungwei Fan"}], "citations": [{"paperId": "8decf68648a753e5ce2e3c94bc1a8c9735bd94e1", "title": "MoralBERT: Detecting Moral Values in Social Discourse"}, {"paperId": "0d30cafa2c9443ffb12a99798639da2f396f1bb6", "title": "FedFSA: Hybrid and federated framework for functional status ascertainment across institutions."}, {"paperId": "3b494b3b7b0b2013c0a036c9aa1868af807f8714", "title": "HunFlair2 in a cross-corpus evaluation of biomedical named entity recognition and normalization tools"}, {"paperId": "721a205fc8882095e0fab660ecea12786882663e", "title": "Performance of Generative Artificial Intelligence in Dental Licensing Examinations."}, {"paperId": "293a0dbce81aa126a2086f11875d6881fa6b3a9c", "title": "Deploying a national clinical text processing infrastructure"}, {"paperId": "e258d5999b3c62746a2bb8bfd62ce70ef82a7cd1", "title": "Review of Reinforcement Learning for Robotic Grasping: Analysis and Recommendations"}, {"paperId": "50b31ac9e783dc3cabe18e0bf0db26a5a6fca8c6", "title": "Fusion Modeling: Combining Clinical and Imaging Data to Advance Cardiac Care"}, {"paperId": "3ee3b1579c756b1121c7124e3b52e0cd7868bccc", "title": "NLP and It’s all Application in AI"}, {"paperId": "778e5ed31bfff51a372a93b08f0a4b1191561661", "title": "Text-Transport: Toward Learning Causal Effects of Natural Language"}, {"paperId": "c6944f35a1e907cf6430594312c6240f21f360d5", "title": "Split Learning for Distributed Collaborative Training of Deep Learning Models in Health Informatics"}, {"paperId": "13b6094a0e62f266505741ac223edbb57a0e1cae", "title": "Novedoso rol para mejorar las interfaces enfermera-tecnología y los avances en dispositivos médicos para la atención al paciente"}, {"paperId": "e3b7a16163e92caf552adfa2e7f05eee14ef1915", "title": "Performance and exploration of ChatGPT in medical examination, records and education in Chinese: Pave the way for medical AI"}, {"paperId": "0a3105ff123646c7a7f119c217f895a9424f4d92", "title": "The IMPACT framework and implementation for accessible in silico clinical phenotyping in the digital era"}, {"paperId": "53707e7d7c5c95495b68fed893069c3457509630", "title": "Named Entity Recognition and Normalization for Alzheimer’s Disease Eligibility Criteria"}, {"paperId": "8082ce381146d36de44bbbaeb3e078e206b1fa01", "title": "Additional Value From Free-Text Diagnoses in Electronic Health Records: Hybrid Dictionary and Machine Learning Classification Study"}, {"paperId": "bde4e437e1175d5b3520762581e1845523e20ccc", "title": "ReDWINE: A Clinical Datamart with Text Analytical Capabilities to Facilitate Rehabilitation Research"}, {"paperId": "8fea48dd1a49ebd89a2618b0cb22977e6c9253ff", "title": "A cross-institutional evaluation on breast cancer phenotyping NLP algorithms on electronic health records"}, {"paperId": "5e2d996239189ff92a6f61c4973a9b05e3468f46", "title": "Natural language processing in radiology: Clinical applications and future directions."}, {"paperId": "c401d83c3d31d7a9445a49ad7121068f14645895", "title": "The big data era: The usefulness of folksonomy for natural language processing."}, {"paperId": "fed2fab877ba1af72470d3dc061747d0ea9879d0", "title": "Deep learning approach to detection of colonoscopic information from unstructured reports"}, {"paperId": "3199ea75b2629dcd90be222fc473b7d71f8fd30a", "title": "The Mechanism and Natural History of Mitral Regurgitation in Cardiac Sarcoidosis."}, {"paperId": "4ec1ea356a859f18cfbb0007da798adf735b3aaa", "title": "The Digitization and Decentralization of Clinical Trials."}, {"paperId": "9ec324658f0499463ec1d67cd7f8a7ecfbc3fa76", "title": "Natural language processing: using artificial intelligence to understand human language in orthopedics"}, {"paperId": "198b578b83037d6b41b341224a4410d3a434ec5b", "title": "Recommended practices and ethical considerations for natural language processing‐assisted observational research: A scoping review"}, {"paperId": "ddd260a356df8fd5325f93d06646b4b7846f50de", "title": "An overview of biomedical entity linking throughout the years"}, {"paperId": "663880191e333fbbb3360586690423a06f19f49b", "title": "Automated identification of aspirin exacerbated respiratory disease using natural language processing and machine learning (Preprint)"}, {"paperId": "0d0c9affc2ea26c3570508ad968a66730eb9b41f", "title": "Clinician Adoption of an Artificial Intelligence Algorithm to Detect Left Ventricular Systolic Dysfunction in Primary Care."}, {"paperId": "c30d178b46fff8f33eb85b5c96a644502c214424", "title": "Artificial intelligence-guided screening for atrial fibrillation using electrocardiogram during sinus rhythm: a prospective non-randomised interventional trial"}, {"paperId": "55e04522d99d6dd00c46f29812c0297411c1b1fd", "title": "Tasks as needs: reframing the paradigm of clinical natural language processing research for real-world decision support"}, {"paperId": "9ce404712df66c1aa47cb68d2d35ccdb085362ae", "title": "Artificial Intelligence Applications in Health Care Practice: Scoping Review"}, {"paperId": "13a94aee170be81ef5ad49fcb2c75c0b3c42d70d", "title": "A Novel Framework for Extracting Knowledge Management from Business Intelligence Log Files in Hospitals"}, {"paperId": "84bf475b7fb433383e479fe4986378ae1d9042fb", "title": "Natural Language Processing: from Bedside to Everywhere"}, {"paperId": "9c3a097ea815cac2426e86ebfe35e39e4dc11f2e", "title": "Deep learning accurately predicts food categories and nutrients based on ingredient statements."}, {"paperId": "967607fa58ecf9368f507d246bd6445b5d274f00", "title": "Research on Feature Extraction and Chinese Translation Method of Internet-of-Things English Terminology"}, {"paperId": "43e29b34a41752ef83d838fce82120348fbff60c", "title": "Exploring Representations for Singular and Multi-Concept Relations for Biomedical Named Entity Normalization"}, {"paperId": "b914d6d21f640f4db75ec1f758cf8047ccbdaf08", "title": "Multicenter Validation of Natural Language Processing Algorithms for the Detection of Common Data Elements in Operative Notes for Total Hip Arthroplasty: Algorithm Development and Validation"}, {"paperId": "ea35800b93a953f10c0611f050f7c914fc1e476a", "title": "Practical Considerations for Developing Clinical Natural Language Processing Systems for Population Health Management and Measurement"}, {"paperId": "af184e1a3fd5c849eba6e33ac20751291be9cb38", "title": "A bibliometric analysis of the application of artificial intelligence to advance individualized diagnosis and treatment of critical illness"}, {"paperId": "7a4432825e9527a2930932cee3ee0134e0628ee7", "title": "An open natural language processing (NLP) framework for EHR-based clinical research: a case demonstration using the National COVID Cohort Collaborative (N3C)"}, {"paperId": "cf7e55c2ec5e63979c6cab3a58f6e2f2c57873ad", "title": "NLP Methods for Extraction of Symptoms from Unstructured Data for Use in Prognostic COVID-19 Analytic Models"}, {"paperId": "f9b42ce3eef03780dbae5b068f58807ef58707e6", "title": "La era del big data: análisis del lenguaje natural mediante la aplicación de folksonomía"}, {"paperId": "7623b3854e7283250be756fa213efa9403a5e508", "title": "A review on applied Natural Language Processing to Electronic Health Records"}, {"paperId": "4674352ce68f90cc2e3759c419b5d16b3ab125c4", "title": "A fast, resource efficient, and reliable rule-based system for COVID-19 symptom identification"}, {"paperId": "34aabade5ce44ba1236932c18486b04a6becca85", "title": "Integrating extracted information from bert and multiple embedding methods with the deep neural network for humour detection"}, {"paperId": "f4321ce3b497b6228e8f68ba1202b85ee2b27638", "title": "Artificial intelligence–enabled electrocardiograms for identification of patients with low ejection fraction: a pragmatic, randomized clinical trial"}, {"paperId": "7594a5e4d0e23f838cedf45353c1e2760c3aafdd", "title": "Neural Language Models with Distant Supervision to Identify Major Depressive Disorder from Clinical Notes"}, {"paperId": "e5cff4412de8ffb34968286df830a90ddb54630f", "title": "Identification of a novel presumed cardiac sarcoidosis category for patients at high risk of disease."}, {"paperId": "c12911574f879e8e1b816b6f57e08fb1253c8022", "title": "Translational NLP: A New Paradigm and General Principles for Natural Language Processing Research"}, {"paperId": "f46d05bda5a44c0ab62da8cdcde6bf97262dcb4f", "title": "Leveraging a Joint of Phenotypic and Genetic Features on Cancer Patient Subgrouping"}, {"paperId": "0e9f756c240a6ea71fe201384441ac04057ff647", "title": "Identifying Information Gaps in Electronic Health Records by Using Natural Language Processing: Gynecologic Surgery History Identification"}, {"paperId": "4a055b883e69ec3b2b776e5cb620668986420e36", "title": "Structuring clinical text with AI: Old versus new natural language processing techniques evaluated on eight common cardiovascular diseases"}, {"paperId": "37aa72d207f5bfe2fbf93a8883dc76faa1c75d50", "title": "Comparisons of Graph Neural Networks on Cancer Classification Leveraging a Joint of Phenotypic and Genetic Features"}, {"paperId": "8a93ed2df8322d1ee98fe1b526596d656d195318", "title": "An aberration detection-based approach for sentinel syndromic surveillance of COVID-19 and other novel influenza-like illnesses"}, {"paperId": "31fdb6a6b869c28a83079b685e32233062ab8f13", "title": "Extracting COVID-19 diagnoses and symptoms from clinical text: A new annotated corpus and neural event extraction framework"}, {"paperId": "852772cd24049c2855fd5578de989a56b1d6da76", "title": "Using Text Mining to Analyze Doctor-Patient Verbal Communication: A Geriatric Depression Case Study"}, {"paperId": "4a40fa894feb580fb952a11fe53c0298c1c63f8c", "title": "Ascertainment of delirium status using natural language processing from electronic health records."}, {"paperId": "68ee4781ce8ae82706b57e6b2b09e2203fa9bdcd", "title": "A corpus-driven standardization framework for encoding clinical problems with HL7 FHIR"}, {"paperId": "ba2fc16245eebb146d47bc01afc8f347c46489d0", "title": "Automated Detection of Periprosthetic Joint Infections and Data Elements Using Natural Language Processing."}, {"paperId": "832ef1351fd47985c2d5368fcd3c4dedec39a66f", "title": "Clinical concept extraction: A methodology review"}, {"paperId": "24f0c288d51ff334ef69868f5ad56c5f67f2038d", "title": "COVID-19 SignSym: a fast adaptation of a general clinical NLP tool to identify and normalize COVID-19 signs and symptoms to OMOP common data model"}, {"paperId": "21249d7df50dd5b09535c5cfd4a6ad3edef6510f", "title": "An Aberration Detection-Based Approach for Sentinel Syndromic Surveillance of COVID-19 and Other Novel Influenza-Like Illnesses"}, {"paperId": "91279a54e6f767669649294e3e10038f466b528c", "title": "Patient trajectories and risk factors for severe outcomes among persons hospitalized for COVID-19 in the Maryland/DC region"}, {"paperId": "bb6ae805a00f57c7d5316b18c83d9eead9ae0177", "title": "Natural Language Processing Applications in Business"}, {"paperId": "5d769e995ce6d5ced30a5738a1714487d663d161", "title": "Assessment of the impact of EHR heterogeneity for clinical research through a case study of silent brain infarction"}, {"paperId": "c34cc5ba7cd12e18f7084aff4b5536dfafc6d1a3", "title": "MCICT: Graph convolutional network-based end-to-end model for multi-label classification of imbalanced clinical text"}, {"paperId": "d636b9ed936bf23ad16dd419347e377893365f97", "title": "Artificial Intelligence in Healthcare Sector: A Literature Review of the Adoption Challenges"}, {"paperId": "3677ea3c467d7954df26a40772f7c9716bb19fe1", "title": "What does a Text Classifier Learn about Morality? An Explainable Method for Cross-Domain Comparison of Moral Rhetoric"}, {"paperId": "ed194f652827edd60eef30be1a14783c9abbbf8d", "title": "Automated Identification of Aspirin-Exacerbated Respiratory Disease Using Natural Language Processing and Machine Learning: Algorithm Development and Evaluation Study"}, {"paperId": "32cd422495fe86ecec3d73d2428861ba049b81e6", "title": "A novel role for enhancing nurse-technology interfaces and medical device advancements for patient care"}, {"paperId": "f4a65f89d2c01ecd638b9b21aac90b802fed8446", "title": "Incorporating Ontological Information in Biomedical Entity Linking of Phrases in Clinical Text"}, {"paperId": "77124e8dd3d67077ecea638cec82fc805534400c", "title": "CQL4NLP: Development and Integration of FHIR NLP Extensions in Clinical Quality Language for EHR-driven Phenotyping."}, {"paperId": "55f5402f4b9282ac545a024585f77226bc039fb8", "title": "MLEngineer at SemEval-2020 Task 7: BERT-Flair Based Humor Detection Model (BFHumor)"}, {"paperId": "3e130f7b935c5fe39307c4966a97d7104d18533c", "title": "Timely and Efficient AI Insights on EHR: System Design"}, {"paperId": "900f166085dfe7a068e0a3eb608bc6de6187debc", "title": "HunFlair2 in a cross-corpus evaluation of named entity recognition and normalization tools"}]}
