{"paperId": "1ae01a22c5b07b087a84c3fe27b57015b7b67853", "publicationVenue": null, "title": "N ov 2 01 9 Walking Randomly , Massively , and Efficiently", "abstract": "We introduce a set of techniques that allow for efficiently generating many independent random walks in the Massive Parallel Computation (MPC) model with space per machine strongly sublinear in the number of vertices. In this space-per-machine regime, many natural approaches to graph problems struggle to overcome the Θ(logn) MPC round complexity barrier. Our techniques enable breaking this barrier for PageRank—one of the most important applications of random walks—even in more challenging directed graphs, and for approximate bipartiteness and expansion testing. In the undirected case, we start our random walks from the stationary distribution, which implies that we approximately know the empirical distribution of their next steps. This allows for preparing continuations of random walks in advance and applying a doubling approach. As a result we can generate multiple random walks of length l in Θ(log l) rounds on MPC. Moreover, we show that under the popular 1-vs.-2-Cycles conjecture, this round complexity is asymptotically tight. For directed graphs, our approach stems from our treatment of the PageRank Markov chain. We first compute the PageRank for the undirected version of the input graph and then slowly transition towards the directed case, considering convex combinations of the transition matrices in the process. For PageRank, we achieve the following round complexities for damping factor equal to 1−ǫ: • in O(log logn+ log 1/ǫ) rounds for undirected graphs (with Õ(m/ǫ) total space), • in Õ(log logn+ log 1/ǫ) rounds for directed graphs (with Õ((m+ n)/poly ǫ) total space). The round complexity of our result for computing PageRank has only logarithmic dependence on 1/ǫ. We use this to show that our PageRank algorithm can be used to construct directed length-l random walks in O(log logn+log l) rounds (with Õ((m+n)poly l) total space). Namely, by letting ǫ = Θ(1/l), a length-l PageRank walk with constant probability contains no random jump, and hence is a directed random walk.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "66417149", "name": "J. Łącki"}, {"authorId": "1730859", "name": "Krzysztof Onak"}, {"authorId": "1734541", "name": "P. Sankowski"}], "citations": []}
