{"paperId": "1ae6b40b66f5a1cd944d497a96d2169fe6c4b9d7", "publicationVenue": {"id": "4d30b0bb-68da-457b-b2e3-d0e398aa9a78", "name": "International Conference on Data Analytics and Management in Data Intensive Domains", "type": "conference", "alternate_names": ["DAMDID/RCDL", "Int Conf Data Anal Manag Data Intensive Domain"]}, "title": "Dask-Based efficient Clustering of Educational Texts", "abstract": ". Document clustering process is a long running and computationally demanding process. The need for systems that allow fast document clustering is especially relevant for processing large volumes of text data (Big Data). In this work we present a distributed text clustering framework based on Dask open source library for parallel and distributed computing. The Dask-based processing system developed in this work allows to execute all necessary operations related to the clustering of text documents in a parallel mode. We realized parallel agglomerative clustering algorithm of cosine similarity matrices computed from term frequency-inverse document frequency (TF-IDF) feature matrices of input texts. The system had been applied to intellectual analysis of educational data accumulated in the system ”Electronic education of the Tatarstan Republic” from 2015 to 2020. Specially, by using developed system we clustered the text documents describing lesson planning, and also performed a comparative analysis of the average marks of students, whose training was carried out according to lesson planning belonging to different clusters.", "venue": "International Conference on Data Analytics and Management in Data Intensive Domains", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "362-376"}, "authors": [{"authorId": "47433100", "name": "F. Gafarov"}, {"authorId": "2162610555", "name": "Dmitriy Minullin"}, {"authorId": "2095267414", "name": "V. Gafarova"}], "citations": [{"paperId": "d8a583478c79cbcb79ef0cdf050fa5081b663d75", "title": "Distributed Execution of Dask on HPC: A Case Study"}]}
