{"paperId": "1aed4c69028b05dc1cc65a32bb4278fa5a87d600", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Analytic Queries over Geospatial Time-Series Data Using Distributed Hash Tables", "abstract": "As remote sensing equipment and networked observational devices continue to proliferate, their corresponding data volumes have surpassed the storage and processing capabilities of commodity computing hardware. This trend has led to the development of distributed storage frameworks that incrementally scale out by assimilating resources as necessary. While challenging in its own right, storing and managing voluminous datasets is only the precursor to a broader field of research: extracting insights, relationships, and models from the underlying datasets. The focus of this study is twofold: exploratory and predictive analytics over voluminous, multidimensional datasets in a distributed environment. Both of these types of analysis represent a higher-level abstraction over standard query semantics; rather than indexing every discrete value for subsequent retrieval, our framework autonomously learns the relationships and interactions between dimensions in the dataset and makes the information readily available to users. This functionality includes statistical synopses, correlation analysis, hypothesis testing, probabilistic structures, and predictive models that not only enable the discovery of nuanced relationships between dimensions, but also allow future events and trends to be predicted. The algorithms presented in this work were evaluated empirically on a real-world geospatial time-series dataset in a production environment, and are broadly applicable across other storage frameworks.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-06-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "1408-1422", "volume": "28"}, "authors": [{"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "cd9c7f1309e47036bd603d5bd6fbe003d0833faa", "title": "Bacterial Communities Related to Aroma Formation during Spontaneous Fermentation of ‘Cabernet Sauvignon’ Wine in Ningxia, China"}, {"paperId": "e2ae1ac5f3eb4a3d951bf44c47f33a67c3308a49", "title": "Lightweight, Embeddings Based Storage and Model Construction Over Satellite Data Collections"}, {"paperId": "1e0fcbcc1373cb73ec89562224bf309d1174a91d", "title": "Towards Timely, Resource-Efficient Analyses Through Spatially-Aware Constructs within Spark"}, {"paperId": "0a0496ca395ff3a8ed3d99d43bbc623b167c8f9a", "title": "Small is Beautiful: Distributed Orchestration of Spatial Deep Learning Workloads"}, {"paperId": "1a798167b24473cb73c4c5e28c1af5d952c4c747", "title": "Iris: Amortized, Resource Efficient Visualizations of Voluminous Spatiotemporal Datasets"}, {"paperId": "69079cd2892be0dd21b73b8733882cd94359ad8f", "title": "Spatio-Fog: A green and timeliness-oriented fog computing model for geospatial query resolution"}, {"paperId": "8f741859ea320641471ae216d8c3e24fd765e661", "title": "Trident: Distributed Storage, Analysis, and Exploration of Multidimensional Phenomena"}, {"paperId": "a8b5ba1d4b18fde7bd404cf264edd38b13d34aac", "title": "Simulation Modelling Practice and Theory"}, {"paperId": "1c3117f6b9a913896255edd089cb818cf3f3f018", "title": "Alleviating I/O Inefficiencies to Enable Effective Model Training Over Voluminous, High-Dimensional Datasets"}, {"paperId": "87774347413df332e80efaed262929efa26ee6ae", "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets"}, {"paperId": "2b9059b985b59eab36843d98a8d12115aba39479", "title": "Radix: Enabling High-Throughput Georeferencing for Phenotype Monitoring over Voluminous Observational Data"}, {"paperId": "1f837196a691e2a2ffa940cdc1105886b54df529", "title": "Scalable network analytics for characterization of outbreak influence in voluminous epidemiology datasets"}, {"paperId": "b1e161c1c788014ed68970b4865c6c18d2b78ca5", "title": "Effective Integration of Geotagged, Ancilliary Longitudinal Survey Datasets to Improve Adulthood Obesity Predictive Models"}, {"paperId": "fe8bfee3ec714e9c9ab3d2abf3b3e8348cd67941", "title": "Leveraging structural-context similarity of Wikipedia links to predict twitter user locations"}, {"paperId": "03f949e2a2c0cdc4eb72f47c8f3e7e5d1c3731c2", "title": "Synopsis: A Distributed Sketch over Voluminous Spatiotemporal Observational Streams"}, {"paperId": "bbbb116e680fc58399fcf5670acfb62a81f41caa", "title": "Prediction of Student performance in Higher Education System using R Programming"}, {"paperId": "5000ed835296226108a24b7c0b1e124dfd16e8ae", "title": "A framework for scalable real‐time anomaly detection over voluminous, geospatial data streams"}, {"paperId": "143c8f0f3cf50ba1692ed5f0ad28e16697aaddab", "title": "Columbus: Enabling Scalable Scientific Workflows for Fast Evolving Spatio-Temporal Sensor Data"}, {"paperId": "8fafbbb6ca3435c070119fdd28c7fb9aadb23874", "title": "HERMES: Federating Fog and Cloud Domains to Support Query Evaluations in Continuous Sensing Environments"}, {"paperId": "672c3db094ac5005a299ba8e9d63bd089165eeac", "title": "THESIS A QUESTIONNAIRE INTEGRATION SYSTEM BASED ON QUESTION CLASSIFICATION AND SHORT TEXT SEMANTIC TEXTUAL SIMILARITY Submitted by"}, {"paperId": "a6dd6b45e49792cbe3f43613228660baef2f71fd", "title": "LEVERAGING STREAM PROCESSING ENGINES IN SUPPORT OF PHYSIOLOGICAL DATA PROCESSING Submitted"}, {"paperId": "1e71d9591b2051c1b43b819fafc480fcd8436039", "title": "Implications of storage subsystem interactions on processing efficiency in data intensive computing"}, {"paperId": "1ffc449f4fc3a2310b5ebc4a59f0cebce94eb179", "title": "2016 Ieee International Conference on Big Data (big Data) Network Analysis for Identifying and Characterizing Disease Outbreak Influence from Voluminous Epidemiology Data"}]}
