{"paperId": "1af49a01ac29fdcce7387683b91be51ec2556d20", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Autonomous UAV Aided Vehicular Edge Computing for Service Offering", "abstract": "High Dynamic Unmanned Aerial Vehicles (UAVs) are introduced to assist V2X networking and communication that requires ultra low latency and safety requirements (ULLC). In this paper, we propose a Follow Me UAV (FMU) architecture that aids Vehicular Edge Computing for service offering. Then, a communication protocol is proposed and associated with placement, routing, and optimization algorithms in small and dense networks (OFMU and AFMU). We use deep learning techniques (LSTM and GRU) to predict the connected vehicles trajectory, then the results are used to feed the optimization models. Then, we clarify through Reinforcement Learning based implementations autonomous UAV path planning. Optimization approaches are implemented and evaluated under different quality and computing scenarios. Then, the models are quantified under UAV selection time and energy cost. Results prove the feasibility of the optimization algorithms and suggest the use of mobile UAV as low latency edge servers for service offering.", "venue": "Global Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-01", "journal": {"name": "2021 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "73776406", "name": "Mohammed Laroui"}, {"authorId": "1399276635", "name": "Hatem Ibn-Khedher"}, {"authorId": "2199954", "name": "Hassine Moungla"}, {"authorId": "4274274", "name": "H. Afifi"}], "citations": [{"paperId": "dbad5700ae29a7edda960dba32df92a144a74948", "title": "Edgedrones: Co-Scheduling of Drones for Multi-Location Aerial Computing Missions"}, {"paperId": "7cf1ee53261827d0408ff41c2e489de5b21857f1", "title": "5G Technology based Edge Computing in UAV Networks for Resource Allocation with Routing using Federated Learning Access Network and Trajectory Routing Protocol"}, {"paperId": "93443a2963de8eddd88c0e4a494e245cfb4adaed", "title": "Reinforcement Learning Vs ILP Optimization in IoT support of Drone assisted Cellular Networks"}]}
