{"paperId": "1afd4560517d59ceaf2687072328420d620cc790", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "BETZE: Benchmarking Data Exploration Tools with (Almost) Zero Effort", "abstract": "In this paper, we propose BETZE, a benchmark generator to evaluate the performance of data exploration solutions for semi-structured data. It is tailored to the typical query capabilities of modern JSON document stores and can be extended to match more. At its core, the query generator mimics the behavior of a data scientist through a model similar to the random surfer idea known from PageRank. We propose preset parameters that pose different query loads to the system, intended to reflect novice, intermediate, and expert users interacting with the system. The proposed approach analyzes a given JSON dataset and generates queries into an intermediate representation that is then translated to system-specific query syntax. We have implemented support for MongoDB, PostgreSQL, jq, and our own JSON processor JODA, and describe how additional tools can be supported. To get started, we report on a first experimental study, showing the versatility of the benchmark generator, using the NoBench dataset, and real-world data obtained from Twitter and Reddit.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "2385-2398"}, "authors": [{"authorId": "2056162824", "name": "Nico Schäfer"}, {"authorId": "48786878", "name": "S. Michel"}], "citations": [{"paperId": "66e5716f2d71d9c0e42248b5cd13eecdd2dabb3b", "title": "To UDFs and Beyond: Demonstration of a Fully Decomposed Data Processor for General Data Wrangling Tasks"}]}
