{"paperId": "1afed056abf4824a8dda12edc1a95595f2dc6b51", "publicationVenue": {"id": "44d20e21-d424-4f58-87fb-3aeb82f85a83", "name": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT", "type": "journal", "alternate_names": ["INTERANTIONAL J SCI RES ENG MANAG"], "issn": "2582-3930"}, "title": "A Simple Application: Cloud-Based Vehicle Tracking System", "abstract": "The world has now fully transitioned into the computing era, especially with the emergence of Cloud Computing. Technologies like wireless sensor networks and RFID (Radio Frequency Identification) are prepared to take on new tasks. A significant amount of data is generated, acquired, and stored to take control of our lives and make them more comfortable and secure. The use of various machine learning techniques and large data processing is made possible by cloud computing technologies. The Internet of Things (IoT) system connects various things, objects, and sensors using a cloud-based universal global neural network. Cloud computing and the Internet of Things are quickly developing services with unique characteristics. With the recent growth of cloud computing and IoT-based smart applications, data production, data integrity, confidentiality, authentication, and verification have become more crucial. Nowadays, every business demands that its data be updated in the cloud to be accessed from anywhere. In this regard, people can easily access the internet on their computers and smartphones in most countries, making online information transmission much simpler and more affordable. The author’s goal in this project is to develop a smart vehicle tracking system that will help universities, colleges, malls, etc. to monitor incoming and outgoing vehicles, within and out of time, and vehicle owners’ details on one website. This project introduces a novel algorithm that delivers real-time information about the vehicles (vehicle in time, out time, current date & owner details) and all the information stored on the cloud so anyone can show all the real-time information. Key Words: JavaScript, HTML, CSS, RFID, IoT, Cloud Computing, ARDUINO.", "venue": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-03", "journal": {"name": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT"}, "authors": [{"authorId": "2166084930", "name": "Ijsrem Journal"}], "citations": []}
