{"paperId": "1affef94eebfb56ff3d0542ac221e48700ff772d", "publicationVenue": null, "title": "A Framework for Handling Internet of Things Data with Confidentiality and Blockchain Support", "abstract": "The Internet of Things (IoT) has emerged as a disruptive technology in recent time. Due to a sharp rise in the deployment of IoT devices across the globe, the total amount of generated data reaching record highs every day. There is no denying that IoT devices with the data that they produce enhancing our day to day lives by bringing in innovative solutions. However, there is a darker side of this technology as it enables device manufacturers and service providers to retain this data that they can later use for several purposes, including targeted marketing. Unfortunately, not many people are aware of this data misuse by service providers. To address this issue, we propose a framework for the confidential handling of IoT data with Blockchain-based verification. We used a combination of Solid and Blockchain to accomplish this goal. Our experimental results show that the proposed approach is promising and has the potential to bring a considerable change in the IoT industry.", "venue": "IOT4SAFE@ESWC", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "48841597", "name": "Manoharan Ramachandran"}, {"authorId": "144474949", "name": "Niaz Chowdhury"}, {"authorId": "2906456", "name": "Allan Third"}, {"authorId": "10035471", "name": "Zeeshan Jan"}, {"authorId": "145812197", "name": "Chris Valentine"}, {"authorId": "2073452805", "name": "John Domingue"}], "citations": [{"paperId": "084cc08882a29773225b19439eee9e8c0559bb99", "title": "IoT Data Confidentiality Self-Management"}, {"paperId": "6bb8de0041863895f01176a620906dc992fedb51", "title": "Solution for Capturing Data from Wearable Devices"}, {"paperId": "fc23364c88ab547e1c4f2253bf699cc15f92d599", "title": "A Solid Architecture for Machine Data Exchange with Access Control (short paper)"}]}
