{"paperId": "1b05876bd7664e2a4d89753d9d6e357ec96203e0", "publicationVenue": {"id": "ca7c5b48-6fe3-4fff-87b1-c3101ec9603b", "name": "Symposium on Intelligent Systems and Informatics", "type": "conference", "alternate_names": ["SISY", "Int Symp Intell Syst Informatics", "International Symposium on Intelligent Systems and Informatics", "Symp Intell Syst Informatics"]}, "title": "Review and requirement specification of telemedicine systems interoperability with common data exchange hub", "abstract": "This paper examines the contemporary issues of interoperability between the emerging telemedicine smart devices and classical, industrial telemedicine systems. The article also presents an overview of two health-related data exchange standards from the western hemisphere, and gives a review with requirement specification on telemedicine systems interoperability. The applied health data exchange standards have significant impact on the general and widely interpreted interoperability of Telemedicine Systems. Interoperability for Telemedicine Systems can bring unprecedented value both at personal and at community level. In the other hand, the ability of sharing medical data on a global basis significantly extends the potential means of worldwide epidemic control. International disease analysis and the resulting forecasting-capabilities supported by Telemedicine Systems Interoperability represents a significant milestone in the practical application of various ICT-solutions, like cloud architecture, telecommunication systems, smart-devices and smartphone apps. Legacy healthcare systems, smartphone apps, smart-devices and telemedicine instruments are sharing data continuously and some of them are interdependent on each other. However, there are still significant barriers blocking the flawless circulation of medical information among health-institutions and devices. This paper also intends to explore some barriers on telemedicine systems interoperability and presents recommendation for future enhancement on flawless telemedicine data exchange.", "venue": "Symposium on Intelligent Systems and Informatics", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2016-08-01", "journal": {"name": "2016 IEEE 14th International Symposium on Intelligent Systems and Informatics (SISY)", "pages": "73-78"}, "authors": [{"authorId": "2977194", "name": "A. Adamkó"}, {"authorId": "3431539", "name": "Abel Garai"}, {"authorId": "3431600", "name": "István Péntek"}], "citations": [{"paperId": "f37355476a27da28ef0c161d368d6b41e6a09376", "title": "Development of a conceptual framework for linking mHealth applications to eRecord systems in Botswana"}, {"paperId": "cb9265222a08c583d0aa401731369cde44ff4680", "title": "Interoperability opportunities and challenges in linking mhealth applications and eRecord systems: Botswana as an exemplar"}, {"paperId": "28a05b821653dbb99ce1cc1016db84ba42db1aa8", "title": "Interoperability frameworks linking mHealth applications to electronic record systems"}]}
