{"paperId": "1b08fdd53af6c463431b9565791b9e4bcb099996", "publicationVenue": {"id": "09916faa-74be-4dae-acbe-d754603787b9", "name": "Annals of the American Association of Geographers", "type": "journal", "alternate_names": ["Ann Am Assoc Geogr"], "issn": "2469-4452", "url": "http://www.tandfonline.com/RAAG"}, "title": "Black Businesses Matter: A Longitudinal Study of Black-Owned Restaurants in the COVID-19 Pandemic Using Geospatial Big Data", "abstract": "Black communities in the United States have been disproportionately affected by the COVID-19 pandemic; however, few empirical studies have been conducted to examine the conditions of Black-owned businesses in the United States during this challenging time. In this article, we assess the circumstances of Black-owned restaurants during the entire year of 2020 through a longitudinal quantitative analysis of restaurant patronage. Using multiple sources of geospatial big data, the analysis reveals that most Black-owned restaurants in this study are disproportionately affected by the COVID-19 pandemic among different cities in the United States over time. The finding reveals the need for a more in-depth understanding of Black-owned restaurants’ situations during the pandemic and further indicates the significance of carrying out place-based relief strategies. Our findings also urge big tech companies to improve existing Black-owned business campaigns to enable sustainable support. As the first to systematically examine the racialization of locational information, this article implies that geographic information systems (GIS) development should not be detached from human experience, especially that of minorities. A humanistic rewiring of GIS is envisioned to achieve a more racially equitable world.", "venue": "Annals of the American Association of Geographers", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-08-25", "journal": {"name": "Annals of the American Association of Geographers", "pages": "189 - 205", "volume": "113"}, "authors": [{"authorId": "2107969920", "name": "Xiao Huang"}, {"authorId": "2182927450", "name": "Xiaoqi Bao"}, {"authorId": "48458661", "name": "Zhenlong Li"}, {"authorId": "12211682", "name": "Shaozeng Zhang"}, {"authorId": "2116551988", "name": "Bo Zhao"}], "citations": [{"paperId": "33d955ef7cd3ff9e9db93a64f95b9f287aecef64", "title": "Does vaccination make a difference? Understanding the role of vaccination in consumers’ in-restaurant dining intentions during a pandemic"}, {"paperId": "fb23660d2e5e20de163c3f2dab0443845cf66438", "title": "Leveraging crowd-sourced environmental data to assess air pollution exposure disparity: A case of Los Angeles County"}, {"paperId": "ffc15ac9bc1aa0bf640dbfb7b3a6522b33c32d14", "title": "Evaluation of the Resilience of the Catering Industry in Hong Kong before and after the COVID-19 Outbreak Based on Point-of-Interest Data"}, {"paperId": "9bdf212404ddb2ae2ec2f4580fafb7b420b6a31d", "title": "Do Black‐Owned Restaurants Matter?: Yelp and Platform Visibility amid a Racial Reckoning"}, {"paperId": "ed073b6c240f10f7df060cf508a0cbe0ff579bbe", "title": "Data on Black, Indigenous, and People of Color (BIPOC)-Owned Businesses: What's Out There and What Can Be Done?"}, {"paperId": "dae1884072feba8f3675f5e3d97485768b18fb05", "title": "Spatial, temporal, and social dynamics in visitation to U.S. national parks: A big data approach"}, {"paperId": "57512a7c3e7edf0afae085629ebb9813a4f6df9a", "title": "The Social Effects of Entrepreneurship on Society and Some Potential Remedies: Four Provocations"}, {"paperId": "26847e2191d8fb4c638c326ffa8e7948a502ab95", "title": "Gauging urban resilience in the United States during the COVID-19 pandemic via social network analysis"}, {"paperId": "088bee8452e839ff4727fb389dcc00c1dae8cedd", "title": "Analyzing Spatial-Temporal Impacts of Neighborhood Socioeconomic Status Variables on COVID-19 Outbreaks as Potential Social Determinants of Health"}, {"paperId": "2e34329405fa0c64150f7c7d4993eb4e3b2e9862", "title": "COVID-19 and Urban Futures: Impacts on Business Closures in Miami-Dade County"}, {"paperId": "67cd46c611b4d5d1035eb58886dfd1f868d52d0b", "title": "From Consumer Cities to Consumer Towns? The Post-Pandemic Geography of Retail in the U.S."}]}
