{"paperId": "1b0b5f08e48c4adc0ecca5e59fc6d8607017831a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Novel Personalized Learning Framework With Interactive e-Mentoring", "abstract": "E-learning has established itself as a new alternative to conventional learning styles to accomplish the goal of education and learning for everyone. The classroom learning style is based on a “one size fits all” approach because, in a typical classroom environment, an instructor has to deal with several students at the same time. A similar problem goes along with the traditional learning management systems in which every student must learn the course devised by the instructor, within a specific timeline and achieve specific objectives, despite students’ preferences and capabilities. The recent global pandemic has pushed educational institutes worldwide to recourse to an “online-only” mode of education and teaching delivery which has raised many challenges that need to be addressed. The existing e-learning systems fail to fulfill the expectations of a learner or an instructor in certain ways including the style of content delivery, mode of teaching, an adaptation of learner style that doesn’t match with the teaching style, the content type, and above all the e-learning lacks to provide the e-mentoring capability to deal with the challenges a learner and an instructor’s face during the learning process. This research aims to develop personalized learning by incorporating an intelligent e-mentor. The proposed e-mentor-based learning model is capable of customizing a course for individuals by automatically adapting it to their unique learning styles, preferences, abilities, existing knowledge, and expectations from the course. The outcome of the proposed model shows that e-mentoring not only increased learner satisfaction but also enhanced the learning process making it a preferred choice.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "10428-10458", "volume": "12"}, "authors": [{"authorId": "70495724", "name": "Nazish Nouman"}, {"authorId": "2257939920", "name": "Zubair A. Shaikh"}, {"authorId": "35194201", "name": "Shaukat Wasi"}], "citations": []}
