{"paperId": "1b22bc13f4bd458521c3ed35d9121ca70b6b27bf", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Trade-off Energy and Spectral Efficiency in 5G Massive MIMO System", "abstract": "A massive multiple input multiple-output system is very important to optimize the trade-off energy efficiency and spectral efficiency in fifth-generation cellular networks. The challenges for the next generation depend on increasing the high data traffic in the wireless communication system for both EE and SE. In this paper, the trade off energy efficiency and spectral efficiency based on the first derivative of transmit antennas and transmit power in a downlink massive MIMO system has been investigated. The trade off EE-SE by using a multiobjective optimization problem to decrease transmit power has been analyzed. The EE and SE based on constraint maximum transmit power allocation and a number of antennas by computing the first derivative of transmit power to maximize the trade-off energy efficiency and spectral efficiency has been improved. From the simulation results, the optimum trade-off between EE and SE can be obtained based on the first derivative by selecting the optimal antennas with a low cost of transmit power. Therefore, based on an optimal optimization problem is flexible to make trade-offs between EE-SE for distinct preferences", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-22", "journal": {"name": "ArXiv", "volume": "abs/2105.10722"}, "authors": [{"authorId": "2087062609", "name": "A. Salh"}, {"authorId": "144756441", "name": "N. Shah"}, {"authorId": "1874985", "name": "L. Audah"}, {"authorId": "123456218", "name": "Qazwan Abdullah  (غزوان عبد الله محمد طربوش)"}, {"authorId": "2143201805", "name": "Norsaliza Abdullah"}, {"authorId": "2429085", "name": "S. Hamzah"}, {"authorId": "2136002047", "name": "Abdu Saif"}], "citations": [{"paperId": "b888d11184cc7b54b593f5f03cc84d57fe84994f", "title": "RF Chain Selection Using Hybrid Optimization with Precoding in mm-Wave Massive MIMO Systems"}, {"paperId": "2cffe906708bada1330c4494065be890d05a8c54", "title": "A Survey on 5G Coverage Improvement Techniques: Issues and Future Challenges"}, {"paperId": "5ef05c3f45f69b5bdc5b4af9d99444ec35b46fd6", "title": "Survey of Micro Fluidic Phased Array Antenna for Beam Steering Techniques"}, {"paperId": "0b80609992f64c19d9e38a671c13665d826996d4", "title": "Estimation Large- Scale Fading Channels for Transmit Orthogonal Pilot Reuse Sequences in Massive MIMO System"}, {"paperId": "dcffbe3836bda703cd8d821a7deacffe397b00ee", "title": "Development of A Fully Data-Driven Artificial Intelligence and Deep Learning for URLLC Application in 6G Wireless Systems: A Survey"}, {"paperId": "d7c7afb82abb9fee91666caf6787998521b6380c", "title": "Review of Internet Things (IoT) of Security Threats and Challenges"}]}
