{"paperId": "1b2c7caf443973e00701a45c206a6212a82307aa", "publicationVenue": {"id": "b8327dec-5d24-41b4-95ee-1fb7bf8f5f05", "name": "IEEE International Symposium on Performance Analysis of Systems and Software", "type": "conference", "alternate_names": ["Int Symp Perform Anal Syst Softw", "International Symposium on Performance Analysis of Systems and Software", "IEEE Int Symp Perform Anal Syst Softw", "ISPASS"], "url": "http://ispass.org/"}, "title": "Hardware Acceleration for DBMS Machine Learning Scoring: Is It Worth the Overheads?", "abstract": "Query processing for data analytics with machine learning scoring involves executing heterogeneous operations in a pipelined fashion. Hardware acceleration is one approach to improve the pipeline performance and free up processor resources by offloading computations to the accelerators. However, the performance benefits of accelerators can be limited by the compute and data offloading overheads. Although prior works have studied acceleration opportunities, including with accelerators for machine learning operations, an end-to-end application performance analysis has not been well studied, particularly for data analytics and model scoring pipelines. In this paper, we study speedups and overheads of using PCIe-based hardware accelerators in such pipelines. In particular, we analyze the effectiveness of using GPUs and FPGAs to accelerate scoring for random forest, a popular machine learning model, on tabular input data obtained from Microsoft SQL Server. We observe that the offloading decision as well as the choice of the optimal hardware backend should depend at least on the model complexity (e.g., number of features and tree depth), the scoring data size, and the overheads associated with data movement and invocation of the pipeline stages. We also highlight potential future research explorations based on our findings.", "venue": "IEEE International Symposium on Performance Analysis of Systems and Software", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "2021 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS)", "pages": "243-253"}, "authors": [{"authorId": "144310644", "name": "Zahra Azad"}, {"authorId": "3133317", "name": "Rathijit Sen"}, {"authorId": "2116811298", "name": "Kwanghyun Park"}, {"authorId": "33901930", "name": "A. Joshi"}], "citations": [{"paperId": "252e174031439fcae5c571078d06915142a83937", "title": "VAQUERO: A Scratchpad-based Vector Accelerator for Query Processing"}, {"paperId": "7d449b130b547b1519c6e5902cc6888416f91b36", "title": "Trinity: In-Database Near-Data Machine Learning Acceleration Platform for Advanced Data Analytics"}]}
