{"paperId": "1b3aaa313d90731547e4603001ee93741cd38078", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Big Data Precision Marketing Approach under IoT Cloud Platform Information Mining", "abstract": "In this article, an in-depth study and analysis of the precision marketing approach are carried out by building an IoT cloud platform and then using the technology of big data information mining. The cloud platform uses the MySQL database combined with the MongoDB database to store the cloud platform data to ensure the correct storage of data as well as to improve the access speed of data. The storage method of IoT temporal data is optimized, and the way of storing data in time slots is used to improve the efficiency of reading large amounts of data. For the scalability of the IoT data storage system, a MongoDB database clustering scheme is designed to ensure the scalability of data storage and disaster recovery capability. The relevant theories of big data marketing are reviewed and analyzed; secondly, based on the relevant theories, combined with the author's work experience and relevant information, a comprehensive analysis and research on the current situation of big data marketing are conducted, focusing on its macro-, micro-, and industry environment. The service model combines the types of user needs, encapsulates the resources obtained by the alliance through data mining for service products, and publishes and delivers them in the form of data products. From the perspective of the development of the telecommunications industry, in terms of technology, the telecommunications industry has seen the development trend of mobile replacing fixed networks and triple play. The development of emerging technologies represented by the Internet of Things and cloud computing has also led to technological changes in the telecommunications industry. Operators are facing new development opportunities and challenges. It also divides the service mode into self-service and consulting service mode according to the different degrees of users' cognition and understanding of the service, as well as proposes standardized data mining service guarantee from two aspects: after-sales service and operation supervision. A customized data mining service is a kind of data mining service for users' personalized needs. And the intelligent data mining service guarantee is proposed from two aspects of multicase experience integration and group intelligence. In the empirical research part, the big data alliance in Big Data Industry Alliance, which provides data mining service as the main business, is selected as the research object, and the data mining service model of the big data alliance proposed in this article is applied to the actual alliance to verify the scientific and rationality of the data mining service model and improve the data mining service model management system.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-12", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2152723878", "name": "Li Wang"}], "citations": [{"paperId": "d077fd80a426d51a0dbba6af08012f3174811e97", "title": "Performance Analysis of Random Forest on Quartile Classification Journal"}, {"paperId": "ec0a1fb33ac4d13337bc306b355adfbff7dd62ab", "title": "Information Extraction Using Data Mining Techniques For Big Data Processing in Digital Marketing Platforms"}, {"paperId": "cbda158ff4b2c5bb6375c5c6f3a3a705faba3cba", "title": "Efficient approach of high average utility pattern mining with indexed list-based structure in dynamic environments"}, {"paperId": "80330a915e4165c3917b741092eb995fa832e30e", "title": "Design Mechanism of Precision Marketing Planning Platform Based on User Data Mining"}, {"paperId": "d3d7d34d9ca49622d7ab1a8cd57df80072887703", "title": "Time Series Classification for Portable Medical Devices"}, {"paperId": "948aec696c67d56754cb95b100d50376b9eca10e", "title": "Research on web front-end development based on integrated forest fire monitoring system of communication and remote control"}, {"paperId": "2da0848c909ddf4c5550a2e5cd7b784141c527c7", "title": "An efficient smart data mining framework based cloud internet of things for developing artificial intelligence of marketing information analysis"}, {"paperId": "3ec35196ef7f00aa97279ca032efe927401a841d", "title": "Customer churn prediction model: a case of the telecommunication market"}, {"paperId": "adb676f75d724a3a1181e6b90b451490b38d4905", "title": "Service-based cloud platform application monitoring analysis"}, {"paperId": "d6a51f2bcb67d77fdedbb38d7b888f1043883e13", "title": "Research on Enterprise Digital Precision Marketing Strategy Based on Big Data"}, {"paperId": "8457ef5452ac05388f5d07787a6eadaa18452cab", "title": "Privacy-Preserving Big Data Security for IoT With Federated Learning and Cryptography"}]}
