{"paperId": "1b4ad376972f937882de936f930fdfebcf94cd1c", "publicationVenue": {"id": "fefad1bd-1de8-4384-965f-3b1f81074c17", "name": "Journal of Technical Education and Training", "type": "journal", "alternate_names": ["J Tech Educ Train", "J Tech educ train", "Journal of Technical education and training"], "issn": "2229-8932", "url": "http://penerbit.uthm.edu.my/ojs/index.php/JTET/index", "alternate_urls": ["http://www.myjurnal.my/public/browse-journal-view.php?id=259#"]}, "title": "Digital Learning in Technical and Vocational Education and Training (TVET) In Public University, Malaysia", "abstract": "Digital learning can finally help students in the teaching and learning process. It became necessity due to the global crisis of the pandemic COVID-19. Lecturers have no choice but to provide excellent education online, including technical and vocational education and training (TVET). TVET face-to-face teaching is more practical than online teaching. A preliminary study was conducted to look at the need for a framework in digital learning on TVET in Public University, Malaysia. The instrument used in this study was an online questionnaire (Google Form) that was emailed to lecturers. The data was analysed using the Statistical Package for Social Science (SPSS) version 26.0. Descriptive statistical analysis was performed in the form of mean and percentage scores. A total of 51 lecturers answered this questionnaire. The questionnaire consists of the demographic respondent, lecturers’ knowledge of online teaching and learning, lecturers’ knowledge of digital learning, faculty readiness, and infrastructure needs in educational institutions. The finding is that lecturers' knowledge of online teaching and learning is moderate, lecturers' knowledge of digital learning is high, faculty readiness is high, and infrastructure needs are high. The findings could be used by the higher education stakeholders for developing a framework in TVET digital learning in nurturing the creation of high quality and effective online teaching and learning content.", "venue": "Journal of Technical Education and Training", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-12-27", "journal": {"name": "Journal of Technical Education and Training"}, "authors": [{"authorId": "2220371970", "name": "Ainull Najhwar Abdul Razak"}, {"authorId": "70394450", "name": "Muhammad Khair Noordin"}, {"authorId": "2101288123", "name": "M. F. Abdul Khanan"}], "citations": [{"paperId": "af74ebab6ca452fb3507f368105064b5c1985474", "title": "The Effect of Using Agronutri-X App on The Academic Achievement of Vocational College Students"}, {"paperId": "e087ee217be64b1274953cdcefaebf19bea2efa8", "title": "Teacher professional development during COVID-19 pandemic: Opportunities and challenges"}, {"paperId": "97200396085e9e22ebdc65c9ca02d741c20f839e", "title": "Alternative mechanisms of managing the education’s development in the social investment model of Russia’s economic growth: standardization versus deregulation"}]}
