{"paperId": "1b4c1b001c5f1d94f8deb4d1956b04eda57d480c", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "The “Socialized Architecture”: A Software Engineering Approach for a New Cloud", "abstract": "Today, the cloud means a revolution within the Internet revolution. However, an oligopoly sustaining the cloud may not be the best solution, since ethical problems such as privacy or even transferring data sovereignty could eventually happen. Our research, coined as the \"socialized architecture,\" presents a novel disruptive approach to completely transform the cloud as we know it today. The approach follows ideas already working in the field of volunteer computing, since it tries to socialize spare computing power in the infraused hardware that institutions and normal people own. However, our solution is completely different to current ones, since it does not create hyper-specialized muscles in client machines. The solution is new since it proposes a software engineering approach for developing “socialized services”, which, leveraging an asynchronous interaction model, creates a network of lightweight microservices that can be dynamically allocated and replicated through the network. The use of state-of-the-art patterns, such as Command Query Responsibility Segregation, helps to isolate domain events and persistence needs, while an API Gateway addresses communication. All previous ideas were tested through a complete and functional proof of concept, which is a prototype called Circle implementing a social network. Circle has been useful to expose problems that need to be addressed. The results of the assessment confirm, in our view, that it is worth to start this new field of work.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2154259052", "name": "Pedro Malo-Perisé"}, {"authorId": "9374736", "name": "José Merseguer"}], "citations": [{"paperId": "53e35627850801a9766e1990901516999f25262a", "title": "Volunteer Computing for fog scalability: A systematic literature review"}, {"paperId": "0858f14a39343c65b5b709e7b4cd037947522541", "title": "A comprehensive study towards high-level approaches for weapon detection using classical machine learning and deep learning methods"}, {"paperId": "f25d4587bdf623201f2161f753243b46e985f17b", "title": "Handling the Subjacent Complexity of a Resocialization Program for Inmates: A Systemic Analysis and Leverage Points"}, {"paperId": "79878e6364d8daa87a947cdb29aa1455e29fa606", "title": "Activities Related to an Electromobility Strategy as a Part of Low Carbon Energy Transition: A Survey in Polish Communes"}, {"paperId": "80118ce5499eeebafa5cf112ca6a5251510453dc", "title": "Economic and Financial Feasibility of a Biorefinery for Conversion of Brewers’ Spent Grain into a Special Flour"}, {"paperId": "e9260358464cbb2c22cb6b103d8c52732bb3c505", "title": "Research allocation in mobile volunteer computing system: Taxonomy, challenges and future work"}]}
