{"paperId": "1b4f35063d2d1a66ed2c4ce7e5e47718c7f07ea9", "publicationVenue": {"id": "d2423c06-c1fe-458d-bf8a-cc24aefe3f59", "name": "International Conference on Future Internet of Things and Cloud", "type": "conference", "alternate_names": ["FiCloud", "Int Conf Future Internet Thing Cloud"]}, "title": "Enhancement of Big Data Security in Cloud Computing Using RSA Algorithm", "abstract": "The enhancement of big data security in cloud computing has become inevitable dues to factors such as the volume, velocity, veracity, Value, and velocity of the big data. These enhancements of big data and cloud technologies have computing enabled a wide range of vulnerabilities in applications in organizational business environments leading to various attacks such as denial-of-service attacks, injection attacks, and Phishing among others. Deploying big data in cloud computing environments is a rapidly growing technology that significantly impacts organizations and provides benefits such as demand-driven access to computational services, a distorted version of infinite computing capacity, and assistance with demand-driven scaling up, scaling down, and scaling out. To secure cloud computing for big data processing, a variety of encryption techniques such as RSA, and AES can be applied. However, there are several vulnerabilities during processing. The paper aims to explore the enhancement of big data security in cloud computing using the RSA algorithm to improve the deployment and processing of the variety, volume, veracity, velocity and value of the data utilizing RSA encryptions. The novelty contribution of the paper is threefold: First, explore the current challenges and vulnerabilities in securing big data in cloud computing and how the RSA algorithm can be used to address them. Secondly, we implement the RSA algorithm in a cloud computing environment using the AWS cloud platform to secure big data to improve the performance and scalability of the RSA algorithm for big data security in cloud computing. We compare the RSA algorithm to other cryptographic algorithms in terms of its ability to enhance big data security in cloud computing. Finally, we recommend control mechanisms to improve security in the cloud platform. The results show that the RSA algorithm can be used to improve Cloud Security in a network environment.", "venue": "International Conference on Future Internet of Things and Cloud", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-14", "journal": {"name": "2023 10th International Conference on Future Internet of Things and Cloud (FiCloud)", "pages": "312-319"}, "authors": [{"authorId": "2264445208", "name": "Abel Yeboah-Ofori"}, {"authorId": "2154107625", "name": "Iman Darvishi"}, {"authorId": "2281885491", "name": "Azeez Sakirudeen Opeyemi"}], "citations": [{"paperId": "4bbe742652635cc69afb335a999410ee5e9e6d40", "title": "Big Data Security Using RSA Algorithms in A VPN Domain"}]}
