{"paperId": "1b51d8c00428c78b215dc87ef891899036c9eda8", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "Mitochondrial Cation Signalling in the Control of Inflammatory Processes", "abstract": "Mitochondria are the bioenergetic organelles responsible for the maintenance of cellular homeostasis and have also been found to be associated with inflammation. They are necessary to induce and maintain innate and adaptive immune cell responses, acting as signalling platforms and mediators in effector responses. These organelles are also known to play a pivotal role in cation homeostasis as well, which regulates the inflammatory responses through the modulation of these cation channels. In particular, this review focuses on mitochondrial Ca2+ and K+ fluxes in the regulation of inflammatory response. Nevertheless, this review aims to understand the interplay of these inflammation inducers and pathophysiological conditions. In detail, we discuss some examples of chronic inflammation such as lung, bowel, and metabolic inflammatory diseases caused by a persistent activation of the innate immune response due to a dysregulation of mitochondrial cation homeostasis.", "venue": "International Journal of Molecular Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-11-24", "journal": {"name": "International Journal of Molecular Sciences", "volume": "24"}, "authors": [{"authorId": "2268271777", "name": "Pampa Pain"}, {"authorId": "2268269563", "name": "Francesca Spinelli"}, {"authorId": "47774733", "name": "G. Gherardi"}], "citations": [{"paperId": "0bc3e9687a22be601df33543581c0aced65df82b", "title": "Redox Regulation of Mitochondrial Potassium Channels Activity"}]}
