{"paperId": "1b5cc065e5ec6d26793af0f94234c74649d860f4", "publicationVenue": {"id": "ecc3036c-4c51-45be-8b2e-f5bb0ea3db40", "name": "International Conference on Autonomic Computing and Self-Organizing Systems", "type": "conference", "alternate_names": ["ACSOS", "Int Conf Auton Comput Self-organizing Syst"]}, "title": "Towards a Framework for Adapting Machine Learning Components", "abstract": "Machine Learning (ML) models are now commonly used as components in systems. As any other component, ML components can produce erroneous outputs that may penalize system utility. In this context, self-adaptive systems emerge as a natural approach to cope with ML mispredictions, through the execution of adaptation tactics such as model retraining. To synthesize an adaptation strategy, the self-adaptation manager needs to reason about the cost-benefit tradeoffs of the applicable tactics, which is a non-trivial task for tactics such as model retraining, whose benefits are both context- and data-dependent.To address this challenge, this paper proposes a probabilistic modeling framework that supports automated reasoning about the cost/benefit tradeoffs associated with improving ML components of ML-based systems. The key idea of the proposed approach is to decouple the problems of (i) estimating the expected performance improvement after retrain and (ii) estimating the impact of ML improved predictions on overall system utility.We demonstrate the application of the proposed framework by using it to self-adapt a state-of-the-art ML-based fraud-detection system, which we evaluate using a publicly-available, real fraud detection dataset. We show that by predicting system utility stemming from retraining a ML component, the probabilistic model checker can generate adaptation strategies that are significantly closer to the optimal, as compared against baselines such as periodic retraining, or reactive retraining.", "venue": "International Conference on Autonomic Computing and Self-Organizing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-01", "journal": {"name": "2022 IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS)", "pages": "131-140"}, "authors": [{"authorId": "2062797649", "name": "Maria Casimiro"}, {"authorId": "145850527", "name": "P. Romano"}, {"authorId": "145307943", "name": "D. Garlan"}, {"authorId": "2065898016", "name": "Luís Rodrigues"}], "citations": [{"paperId": "5647d1b81037397cbd515add21e7eb1541941112", "title": "Towards Architecting Sustainable MLOps: A Self-Adaptation Approach"}, {"paperId": "f4eee2705b7cb549adfc628b7dde52542b0c58f7", "title": "Can LLMs Configure Software Tools"}, {"paperId": "5e4a7713a3ea9e68ee213ee9dc4e09ee8fbe537b", "title": "Towards Self-Adaptive Machine Learning-Enabled Systems Through QoS-Aware Model Switching"}]}
