{"paperId": "1b650a822dc4eae0053ee30f64d0fdb3cd915b46", "publicationVenue": {"id": "932f8c16-64c0-4af8-a2d6-a549264c976f", "name": "ACM SIGCOMM Symposium on Software Defined Networking Research", "type": "conference", "alternate_names": ["ACM SIGCOMM Symp Softw Defin Netw Res", "Symp SDN Res", "Symposium on SDN Research", "SOSR"]}, "title": "Say No to Rack Boundaries: Towards A Reconfigurable Pod-Centric DCN Architecture", "abstract": "Data center networks are designed to interconnect large clusters of servers. However, their static, rack-based architecture poses many constraints. For instance, due to over-subscription, bandwidth tends to be highly unbalanced---while servers in the same rack enjoy full bisection bandwidth through a top-of-rack (ToR) switch, servers across racks have much more constrained bandwidth. This translates to a series of performance issues for modern cloud applications. In this paper, we propose a rackless data center (RDC) architecture that removes this fixed \"rack boundary\". We achieve this by inserting circuit switches at the edge layer, and dynamically reconfiguring the circuits to allow servers from different racks to form \"locality groups\". RDC optimizes the topology between servers and edge switches based on the changing workloads, and achieves lower flow completion times and improved load balance for realistic workloads.", "venue": "ACM SIGCOMM Symposium on Software Defined Networking Research", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-04-03", "journal": {"name": "Proceedings of the 2019 ACM Symposium on SDN Research"}, "authors": [{"authorId": "9180632", "name": "Ding-Xue Wu"}, {"authorId": "2154480284", "name": "Weitao Wang"}, {"authorId": "30894196", "name": "Ang Chen"}, {"authorId": "143866548", "name": "T. Ng"}], "citations": [{"paperId": "9900b797bf9aa98004e4b1dbab561e6bd9bda60c", "title": "Learning to Configure Converters in Hybrid Switching Data Center Networks"}, {"paperId": "d644f98027664e6b9206e8af3b031d6bb99a5417", "title": "FASTeller: A Hardware Partial Aggregator for Accurate Flow Counting in Cloud Networks"}, {"paperId": "45a974f5ebdbdadb0fb19bdbefd18d4fd11252ac", "title": "Optimizing multicast flows in high-bandwidth reconfigurable datacenter networks"}, {"paperId": "9179e06619eb75d976752907a56e456523885ab8", "title": "Abstractions for Reconfigurable Hybrid Network Update and A Consistent Update Approach"}, {"paperId": "688bf2f13661fbd0a93c6f728d5320fabe3d0713", "title": "Towards All-optical Circuit-switched Datacenter Network Cores: The Case for Mitigating Traffic Skewness at the Edge"}, {"paperId": "44d73fd748d97157805383db05fd92e690dfac60", "title": "Shufflecast: An Optical, Data-Rate Agnostic, and Low-Power Multicast Architecture for Next-Generation Compute Clusters"}, {"paperId": "80f0b5a0b7c8dcf6e9c21363155c6cef1e82ea6e", "title": "SplitCast: Optimizing Multicast Flows in Reconfigurable Datacenter Networks"}, {"paperId": "938323a0d3ce98f41ea7340a79727d42e65dfe0b", "title": "RDC: Energy-Efficient Data Center Network Congestion Relief with Topological Reconfigurability at the Edge"}, {"paperId": "e2525fb483a5dfda04cdba6faf36a89f47900bf1", "title": "This paper is included in the Proceedings of the 19th USENIX Symposium on Networked Systems Design and Implementation."}]}
