{"paperId": "1b860394dfec26d9c350889006e37fe56731f77e", "publicationVenue": {"id": "5276bfc2-b6f9-4564-83fa-df391a9ea260", "name": "International Conference on AI in Finance", "type": "conference", "alternate_names": ["ICAIF", "Int Conf AI Finance"]}, "title": "Enhancing Financial Sentiment Analysis via Retrieval Augmented Large Language Models", "abstract": "Financial sentiment analysis is critical for valuation and investment decision-making. Traditional NLP models, however, are limited by their parameter size and the scope of their training datasets, which hampers their generalization capabilities and effectiveness in this field. Recently, Large Language Models (LLMs) pre-trained on extensive corpora have demonstrated superior performance across various NLP tasks due to their commendable zero-shot abilities. Yet, directly applying LLMs to financial sentiment analysis presents challenges: The discrepancy between the pre-training objective of LLMs and predicting the sentiment label can compromise their predictive performance. Furthermore, the succinct nature of financial news, often devoid of sufficient context, can significantly diminish the reliability of LLMs’ sentiment analysis. To address these challenges, we introduce a retrieval-augmented LLMs framework for financial sentiment analysis. This framework includes an instruction-tuned LLMs module, which ensures LLMs behave as predictors of sentiment labels, and a retrieval-augmentation module which retrieves additional context from reliable external sources. Benchmarked against traditional models and LLMs like ChatGPT and LLaMA, our approach achieves 15% to 48% performance gain in accuracy and F1 score.", "venue": "International Conference on AI in Finance", "year": 2023, "fieldsOfStudy": ["Computer Science", "Economics"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-10-06", "journal": {"name": "Proceedings of the Fourth ACM International Conference on AI in Finance"}, "authors": [{"authorId": "2257373042", "name": "Boyu Zhang"}, {"authorId": "1504453822", "name": "Hongyang Yang"}, {"authorId": "2257136345", "name": "Tianyu Zhou"}, {"authorId": "2268775254", "name": "Muhammad Ali Babar"}, {"authorId": "2111039012", "name": "Xiao-Yang Liu"}], "citations": [{"paperId": "e88999c8d89cc50c9ad77325c751cac0cea52a47", "title": "AuditLLM: A Tool for Auditing Large Language Models Using Multiprobe Approach"}, {"paperId": "3d6197e4ab55a3a2785ce5934e48cfbe9fe9bf04", "title": "Revolutionizing Finance with LLMs: An Overview of Applications and Insights"}, {"paperId": "b078e62296e646fa08b39f3d980a652a37f5dc7b", "title": "EmoLLMs: A Series of Emotional Large Language Models and Annotation Tools for Comprehensive Affective Analysis"}, {"paperId": "be4468df16aacad6dbb74f1d98ada26ddbd7dba5", "title": "Designing Heterogeneous LLM Agents for Financial Sentiment Analysis"}, {"paperId": "55e3df13c577568e544a39db62be7874920798f0", "title": "An Analysis of Embedding Layers and Similarity Scores using Siamese Neural Networks"}, {"paperId": "5838b56f2c7ca3dd946428dae07bdc26a9265c67", "title": "Deficiency of Large Language Models in Finance: An Empirical Examination of Hallucination"}, {"paperId": "acbb28ffe548d3f87c701c5f9a965bdca474a9a4", "title": "Emotion Detection for Misinformation: A Review"}, {"paperId": "0b220041eb83c23b7b10d32a5d08c0309d528071", "title": "Large Language Models for Information Retrieval: A Survey"}, {"paperId": "6121fb3e393597e02481a516f0035f06ec9a5836", "title": "FinGPT: Democratizing Internet-scale Data for Financial Large Language Models"}, {"paperId": "6f549eff664fbe266d777ab1fe1aa392d9a95ec2", "title": "Integrating Social Media Data and Historical Stock Prices for Predictive Analysis: A Reinforcement Learning Approach"}]}
