{"paperId": "1bbf69425c9f7c0faea99f908ca209ca6a915469", "publicationVenue": {"id": "537b4f76-bc99-4d19-8786-bf5851198a14", "name": "International Conference on Speech Technology and Human-Computer Dialogue", "type": "conference", "alternate_names": ["International Conference for Convergence for Technology", "Int Conf Converg Technol", "Int Conf Commun Technol", "International Conference on Communication Technology", "Int Conf Speech Technol Human-computer Dialogue", "ICCT", "SpeD"]}, "title": "Quantifying the Influence of Browser, OS and Network Delay on Time Instant Metric Measurements for a Web Mapping Application", "abstract": "Modelling Web Quality of Experience (QoE) using technical quality metrics has received much attention over the past years and has become an important part of network QoE monitoring and management studies. Mapping Web QoE metrics (e.g. MOS) to application metrics (e.g. waiting time) and network QoS metrics (e.g delay) helps to quantify the influence of different factor on the perceived quality. The literature shows that network delays can result in significantly longer loading times for web browsing and consequently impact the user’s perceived quality. We investigate the impact of network delay on the measurement of application quality metrics for three browsers and three operating systems using a web mapping application for our experimental tests. We then analyse how the choice of browser and operating system influences application level quality metrics. We demonstrate how time instant quality metrics measurement vary depending on the operating system due to TCP Retransmition TimeOut (RTO). Finally, we publish the collected data for the future studies.", "venue": "International Conference on Speech Technology and Human-Computer Dialogue", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 19th International Conference on Communication Technology (ICCT)", "pages": "1580-1584"}, "authors": [{"authorId": "51196529", "name": "Hamed Z. Jahromi"}, {"authorId": "144380011", "name": "D. Delaney"}, {"authorId": "37996633", "name": "Andrew Hines"}], "citations": []}
