{"paperId": "1bc721fde887c17dbfc14c9a0be38a9f18709507", "publicationVenue": null, "title": "Towards Interactive Pattern Search in Massive Graphs", "abstract": "We present the design overview of a pattern matching engine for labeled graphs that supports interactive search: the user, based on feedback received from the search system, repeatedly revises her search template until s/he is satisfied with the results. To this end, we have developed a distributed memory solution that supports human-in-the-loop processing. Our solution embraces a number of design principles to offer high-performance, scalability and efficiency: (i) fast parallel processing - we adopt a vertex parallel computation model; (ii) aggressive search space reduction - using lightweight routines, we identify and prune away the non-matching part of the graph early; (iii) redundant work elimination - a revised query is likely to share label(s) and/or substructure(s) with its predecessor(s); therefore, whenever possible, we avoid redundant computation by reusing (partial) match information from earlier searches. Our preliminary evaluation highlights the effectiveness of the proposed approach: using a 257 billion edge real-world webgraph, on a 128 node (4,608 cores) deployment, we demonstrate the advantage of our technique over a naive approach (that uses an exact matching solution to independently search the original query and each of its revisions).", "venue": "GRADES-NDA@SIGMOD", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2020-06-14", "journal": {"name": "Proceedings of the 3rd Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA)"}, "authors": [{"authorId": "35885602", "name": "Tahsin Reza"}, {"authorId": "1747805", "name": "M. Ripeanu"}, {"authorId": "1795587", "name": "G. Sanders"}, {"authorId": "2157171", "name": "R. Pearce"}], "citations": [{"paperId": "090402652b83d26f16ef38950cf26f5e72e2b9a7", "title": "Labeled Triangle Indexing for Efficiency Gains in Distributed Interactive Subgraph Search††This work was performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344 (LLNL-CONF-814976). Experiments were performed at the Live"}, {"paperId": "3c1b1401d0b37dedf447abcbb271f0663276e925", "title": "Scalable Pattern Matching in Metadata Graphs via Constraint Checking"}]}
