{"paperId": "1bcff3f95fb3e1725dad06e917122130f9e2be96", "publicationVenue": null, "title": "A Unified Deep Model of Learning from both Data and Queries for Cardinality Estimation", "abstract": "Cardinality estimation is a fundamental problem in database systems. To capture the rich joint data distributions of a relational table, most of the existing work either uses data as unsupervised information or uses query workload as supervised information. Very little work has been done to use both types of information, and cannot fully make use of both types of information to learn the joint data distribution. In this work, we aim to close the gap between data-driven and query-driven methods by proposing a new unified deep autoregressive model, UAE, that learns the joint data distribution from both the data and query workload. First, to enable using the supervised query information in the deep autoregressive model, we develop differentiable progressive sampling using the Gumbel-Softmax trick. Second, UAE is able to utilize both types of information to learn the joint data distribution in a single model. Comprehensive experimental results demonstrate that UAE achieves single-digit multiplicative error at tail, better accuracies over state-of-the-art methods, and is both space and time efficient.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2111193903", "name": "Peizhi Wu"}, {"authorId": "144145211", "name": "G. Cong"}], "citations": [{"paperId": "49a5aadfceac5d5ed9e224bc777f4f616de1daae", "title": "Modeling Shifting Workloads for Learned Database Systems"}, {"paperId": "305612b49d1d43fa8fd70e0cc506d0ab51e8ba8f", "title": "ASM: Harmonizing Autoregressive Model, Sampling, and Multi-dimensional Statistics Merging for Cardinality Estimation"}, {"paperId": "258bca67f4ab6d5474ffac4b25b72804c40b8014", "title": "Selectivity Estimation for Queries Containing Predicates over Set-Valued Attributes"}, {"paperId": "d13b3c9d4a7bd05133578e566657658dc531e29f", "title": "Adding Domain Knowledge to Query-Driven Learned Databases"}, {"paperId": "b53e3a987571564332cd0a40da2a8eb164cadb7d", "title": "ALECE: An Attention-based Learned Cardinality Estimator for SPJ Queries on Dynamic Workloads (Extended)"}, {"paperId": "9fadd417192a0337a4f3362a7b58b76688c66517", "title": "Ensemble Masked Autoencoder and Gaussian Mixture Models for Cardinality Estimation"}, {"paperId": "3dd82e0ab1e141e0e57f2807a5123458f6b1388e", "title": "ShadowAQP: Efficient Approximate Group-by and Join Query via Attribute-oriented Sample Size Allocation and Data Generation"}, {"paperId": "8add1ac7b254b259c038db8027990d44390bd5b3", "title": "Cardinality estimation using normalizing flow"}, {"paperId": "7a1e4be90fb4532512636c50f3ca8031329a2abe", "title": "A Cardinality Estimator in Complex Database Systems Based on TreeLSTM"}, {"paperId": "eb6c926db623073c854c7871ae40b4fe5b42759e", "title": "Cardinality estimation with smoothing autoregressive models"}, {"paperId": "c8071c6336bc0dbb3fbe9025c9ff2bb6c5d66f13", "title": "Duet: efficient and scalable hybriD neUral rElation undersTanding"}, {"paperId": "12e8be17e7fba74dbb329a2e42a38bdb7daac456", "title": "Cardinality Estimation Via Learned Dynamic Sample Selection"}, {"paperId": "bbbe3ff38b109c81689c0378fc66b2aebf8ce7db", "title": "Sampling-Based Techniques for Training Deep Neural Networks with Limited Computational Resources: A Scalability Evaluation"}, {"paperId": "67322d753c9e05f19e7df54923a722d9d68e4e62", "title": "SQL2Circuits: Estimating Metrics for SQL Queries with A Quantum Natural Language Processing Method"}, {"paperId": "b4ac6825a237beb0febd2abb9047da31f5e7cdf7", "title": "BitE : Accelerating Learned Query Optimization in a Mixed-Workload Environment"}, {"paperId": "9a91890329b65d43d91b0d83399d68949bd85ad5", "title": "Speeding Up End-to-end Query Execution via Learning-based Progressive Cardinality Estimation"}, {"paperId": "81b9ebe4c6785351eafd0fc21d24851ce25f01ed", "title": "Efficient and Effective Cardinality Estimation for Skyline Family"}, {"paperId": "de17afa89e38658e1a2e7b5c357856aa08ba0dd7", "title": "dbET: Execution Time Distribution-based Plan Selection"}, {"paperId": "6c4939564ba3d47fd4e54ff6084128f21ddb8037", "title": "AutoCE: An Accurate and Efficient Model Advisor for Learned Cardinality Estimation"}, {"paperId": "dbf137ac9c554f25da72a95d19da3d9b7e9208b1", "title": "Learned Probing Cardinality Estimation for High-Dimensional Approximate NN Search"}, {"paperId": "77566e8ceea14a8ba87c56bb038a4436e430c5ba", "title": "Less is More: Towards Lightweight Cost Estimator for Database Systems"}, {"paperId": "ab46b919ed09cf213467463541170c6ab7845087", "title": "Robust Query Driven Cardinality Estimation under Changing Workloads"}, {"paperId": "6d1814d08f240d0efde960e12d027b6bede3405d", "title": "FactorJoin: A New Cardinality Estimation Framework for Join Queries"}, {"paperId": "1873063968adf638eee556595f53b5c6c2974d28", "title": "NeuroSketch: Fast and Approximate Evaluation of Range Aggregate Queries with Neural Networks"}, {"paperId": "e89ab345ac30b6020dddc37fa5c5da5b4f590087", "title": "SafeBound: A Practical System for Generating Cardinality Bounds"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}, {"paperId": "2830247f6b804a590c3c0753c7181044d8d1ef48", "title": "SAM: Database Generation from Query Workloads with Supervised Autoregressive Models"}, {"paperId": "a6f9d5ca6b5eb637d93e69af9d924f6491e94267", "title": "Learned Cardinality Estimation: An In-depth Study"}, {"paperId": "3d29fea46e7ffadb70f6f38aa5071aaa8195e906", "title": "Neural Subgraph Counting with Wasserstein Estimator"}, {"paperId": "354fbd6c940ead125fe995503b87462470d2d4f5", "title": "Database Optimizers in the Era of Learning"}, {"paperId": "95a7e4b4d535a9c61a6f466a090a4004ef151b50", "title": "Machine Learning for Data Management: A System View"}, {"paperId": "e22327650db67212e382749af2160f11f27fac3b", "title": "Degree Sequence Bound For Join Cardinality Estimation"}, {"paperId": "3ed0ec729a619eda3770c505f1e83ad4d4524b78", "title": "Glue: Adaptively Merging Single Table Cardinality to Estimate Join Query Size"}, {"paperId": "d58ac1399a8db5fe436573e7f692a352e0aa8a51", "title": "Cardinality Estimation in DBMS: A Comprehensive Benchmark Evaluation"}, {"paperId": "689f70ea07215b58e39dfc624480b2b8e8c5848a", "title": "PerfGuard: Deploying ML-for-Systems without Performance Regressions, Almost!"}, {"paperId": "60441de68623abfd43d8d85525f34a26308652bf", "title": "NeuroDB: A Neural Network Framework for Answering Range Aggregate Queries and Beyond"}, {"paperId": "505a3f848c17e8dd04abc3e77e164ce877f673de", "title": "Machine Learning for Databases"}, {"paperId": "d40142b34ced5343439308386c6f85eb8433ceb1", "title": "CARMI: A Cache-Aware Learned Index with a Cost-based Construction Algorithm"}, {"paperId": "3697561ebf4543d49d3cf27f47e05acd229deab7", "title": "QPSeeker: An Efficient Neural Planner combining both data and queries through Variational Inference"}, {"paperId": "f12c83f4a759971649a5ebc7cdddb5cab89e29fc", "title": "ConvMADE: Convolution Makes Cardinality Estimation Stronger"}, {"paperId": "a22cab1bf236c9a602a5a6f938d31d52dd1d112c", "title": "Unsupervised Selectivity Estimation by Integrating Gaussian Mixture Models and an Autoregressive Model"}, {"paperId": "e1b5b8c10e2a2491184e54ad6e2d29c03d20ccd6", "title": "A Performance Study of One-dimensional Learned Cardinality Estimation"}, {"paperId": "a1997a2242cb26bb9b6056a58dd043440d421797", "title": "Cardinality Estimation in Inner Product Space"}]}
