{"paperId": "1bd8cb97f207dee598c54ea40fd65b3ab7c140d5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Survey of Federated Learning Models for Spatial-Temporal Mobility Applications", "abstract": "Federated learning involves training statistical models over edge devices such as mobile phones such that the training data is kept local. Federated Learning (FL) can serve as an ideal candidate for training spatial temporal models that rely on heterogeneous and potentially massive numbers of participants while preserving the privacy of highly sensitive location data. However, there are unique challenges involved with transitioning existing spatial temporal models to decentralized learning. In this survey paper, we review the existing literature that has proposed FL-based models for predicting human mobility, traffic prediction, community detection, location-based recommendation systems, and other spatial-temporal tasks. We describe the metrics and datasets these works have been using and create a baseline of these approaches in comparison to the centralized settings. Finally, we discuss the challenges of applying spatial-temporal models in a decentralized setting and by highlighting the gaps in the literature we provide a road map and opportunities for the research community.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-09", "journal": {"name": "ArXiv", "volume": "abs/2305.05257"}, "authors": [{"authorId": "2180991965", "name": "Yacine Belal"}, {"authorId": "2623828", "name": "Sonia Ben Mokhtar"}, {"authorId": "2146160951", "name": "Hamed Haddadi"}, {"authorId": "2216729579", "name": "Jaron Wang"}, {"authorId": "2058172760", "name": "A. Mashhadi"}], "citations": [{"paperId": "9b7e330b0fed6e5ae4a9d91d1129d050f3a7bae0", "title": "Research on Federated Learning Traffic Prediction Algorithm Based on Deep Autoregressive Networks"}, {"paperId": "1351d7319cd442fb0bd0529fe0de5db61f743378", "title": "FedVANET-TP: Federated Trajectory Prediction Model for VANETs"}]}
