{"paperId": "1bdf6466e987351baf69d30393f325d6ab6f20f9", "publicationVenue": {"id": "38acad02-d647-4d48-be25-55a418138f2a", "name": "Transportation Research Record", "type": "journal", "alternate_names": ["Transp Res Rec"], "issn": "0361-1981", "url": "http://trb.org/news/blurb_detail.asp?id=1676"}, "title": "Identifying Crisis Response Communities in Online Social Networks for Compound Disasters: The Case of Hurricane Laura and COVID-19", "abstract": "Online social networks allow different agencies and the public to interact and share the underlying risks and protective actions during major disasters. This study revealed such crisis communication patterns during Hurricane Laura compounded by the COVID-19 pandemic. Hurricane Laura was one of the strongest (Category 4) hurricanes on record to make landfall in Cameron, Louisiana, U.S. Using an application programming interface (API), this study utilizes large-scale social media data obtained from Twitter through the recently released academic track that provides complete and unbiased observations. The data captured publicly available tweets shared by active Twitter users from the vulnerable areas threatened by Hurricane Laura. Online social networks were based on Twitter’s user influence feature (i.e., mentions or tags) that allows notification of other users while posting a tweet. Using network science theories and advanced community detection algorithms, the study split these networks into 21 components of various size, the largest of which contained eight well-defined communities. Several natural language processing techniques (i.e., word clouds, bigrams, topic modeling) were applied to the tweets shared by the users in these communities to observe their risk-taking or risk-averse behavior during a major compounding crisis. Social media accounts of local news media, radio, universities, and popular sports pages were among those which heavily involved and closely interacted with local residents. In contrast, emergency management and planning units in the area engaged less with the public. The findings of this study provide novel insights into the design of efficient social media communication guidelines to respond better in future disasters.", "venue": "Transportation Research Record", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-23", "journal": {"name": "Transportation Research Record"}, "authors": [{"authorId": "2168246875", "name": "Khondhaker Al Momin"}, {"authorId": "2230899604", "name": "Imran Kays"}, {"authorId": "2230900685", "name": "Ph.D Arif Mohaimin Sadri"}], "citations": [{"paperId": "fa302d7a5f5c50dca5717adc22151b573c837bd6", "title": "Translating Social Media Crisis Narratives into Road Network Utilization Metrics: The Case of 2020 Oklahoma Ice Storm"}]}
