{"paperId": "1bf9ea0b878f70dcd4b70fd1990a12e2b9d48c30", "publicationVenue": {"id": "582df9fb-30ad-41a1-919c-2aad06999383", "name": "Diversity", "type": "journal", "issn": "1424-2818", "alternate_issns": ["2342-1290"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-146645", "alternate_urls": ["http://mcnet.utu.fi/diversity/", "https://www.mdpi.com/journal/diversity", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-146645"]}, "title": "Mind the Gaps: Taxonomic, Geographic and Temporal Data of Marine Invertebrate Databases from Mozambique and São Tomé and Príncipe", "abstract": "One of the best ways to share and disseminate biodiversity information is through the digitization of data and making it available via online databases. The rapid growth of publicly available biodiversity data is not without problems which may decrease the utility of online databases. In this study we analyze taxonomic, geographic and temporal data gaps, and bias related to existing data on selected marine invertebrate occurrences along the coastline of two African countries, Mozambique and São Tomé and Príncipe. The final marine invertebrate dataset comprises of 19.910 occurrences, but 32% of the original dataset occurrences were excluded due to data gaps. Most marine invertebrates in Mozambique were collected in seagrasses, whereas in São Tomé and Príncipe they were mostly collected offshore. The dataset has a temporal coverage from 1816 to 2019, with most occurrences collected in the last two decades. This study provides baseline information relevant to a better understanding of marine invertebrate biodiversity data gaps and bias in these habitats along the coasts of these countries. The information can be further applied to complete marine invertebrate data gaps contributing to design informed sampling strategies and advancing refined datasets that can be used in management and conservation plans in both countries.", "venue": "Diversity", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-05", "journal": {"name": "Diversity"}, "authors": [{"authorId": "40220759", "name": "M. São Bento"}, {"authorId": "151026596", "name": "Henrique Niza"}, {"authorId": "87161457", "name": "A. Cartaxana"}, {"authorId": "144978581", "name": "S. Bandeira"}, {"authorId": "5528032", "name": "José Nestor de Paula"}, {"authorId": "40060733", "name": "A. M. Correia"}], "citations": [{"paperId": "48cf81347a28b38e738f7b488eb3723a411f0e48", "title": "Catching the Drift of Marine Invertebrate Diversity through Digital Repositories—A Case Study of the Mangroves and Seagrasses of Maputo Bay, Mozambique"}]}
