{"paperId": "1bfad398407453ab9dde5c62960498cab58b149d", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "An Accountable Data Trading Platform Based on Blockchain", "abstract": "In the era of big data, the sale of digital data has became a promising business. Although data trading brings a big dividend, it still has the issues of data authentic right and infringement tracking difficulty. The solutions of monitoring consumers and platform regulation introduce privacy and security issues. To overcome these challenges, a blockchain-based accountable data trading platform is proposed. The platform uses the blockchain technology to build a distributed secure and trusted environment for big data trading. Before listing datasets on the data market, a secure dataset similarity comparison method is used to detect illegal resale. The misbehavior of customers can be traced by the blockchain nodes because the key points of the data trading are recorded in the blockchain. Through secure analysis and performance evaluation, we evaluate the feasibility and effectiveness of the trading platform.", "venue": "Conference on Computer Communications Workshops", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-04-29", "journal": {"name": "IEEE INFOCOM 2019 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1-6"}, "authors": [{"authorId": "49990796", "name": "Yunhua He"}, {"authorId": "96519515", "name": "Hongliang Zhu"}, {"authorId": "2144448213", "name": "Chao Wang"}, {"authorId": "144293517", "name": "Ke Xiao"}, {"authorId": "1780560561", "name": "Yuhan Zhou"}, {"authorId": "34811223", "name": "Yang Xin"}], "citations": [{"paperId": "36cc3b4cd8c8fba4ac098e485eea26bed5bf1d39", "title": "Federated Learning Meets Blockchain: State Channel-Based Distributed Data-Sharing Trust Supervision Mechanism"}, {"paperId": "33e68a93e0cbc296243e33dd4b9e365594018006", "title": "A Survey on Integration of Blockchain in Data Trading Industry"}, {"paperId": "8b10a3542012c490673aa42397ad0997e29c7aef", "title": "Kryptosafe: managing and trading data sets using blockchain and IPFS"}, {"paperId": "2adeabdf9f6c614fd4ff1db194286f2a3f9691fa", "title": "SPDTS: A Differential Privacy-Based Blockchain Scheme for Secure Power Data Trading"}, {"paperId": "767a792ccb51017990c1da2e56e1bba5d926b788", "title": "A Near-Optimal Truthful Online Auction for Efficient Crowdsourced Data Trading with Dynamic Data Owners and Dynamic Data Requests"}, {"paperId": "599f1f766af182d7f7733bc804b7337e41222856", "title": "A blockchain-based trading system for big data"}, {"paperId": "98a678c874b90b46a825deece452fe22de7f6bfa", "title": "Data Trading Certification Based on Consortium Blockchain and Smart Contracts"}]}
