{"paperId": "1c02a847562f79500fd37e1fd4e36f15f39d36c9", "publicationVenue": {"id": "3454cd32-76b1-4baa-88f8-7faa8c04abd1", "name": "Advanced Industrial Conference on Telecommunications", "type": "conference", "alternate_names": ["AICT", "Adv Ind Conf Telecommun", "Int Conf Appl Inf Commun Technol", "International Conference on Application of Information and Communication Technologies"], "url": "http://www.wikicfp.com/cfp/program?id=101"}, "title": "Financial Services Credit Scoring System Using Data Mining", "abstract": "Credit scoring procedures used by most financial services organizations, especially the banking sector to classify their customers-based granting risk methodology. Loans types discussed in this paper can vary from bank to bank and such as housing loans, cars loans, or personal loans. Moreover, this article discussed a different kind of scoring approaches and categorized loans-based scoring level to be good loans or bad loans. Various data mining techniques will be used to analyses and evaluate these loans to enable the bank to grant the loans with minimum risk to the customer that can pay for the loan based on a predefined and approved agreement between the bank and its customers. Data mining techniques and their issues with credit scoring systems will be covered through experiments using data mining techniques and credit scoring techniques using both statistical and advanced techniques by chosen bank credits loans data set for training and testing set.", "venue": "Advanced Industrial Conference on Telecommunications", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-10-07", "journal": {"name": "2020 IEEE 14th International Conference on Application of Information and Communication Technologies (AICT)", "pages": "1-7"}, "authors": [{"authorId": "2112152281", "name": "Adel Hassan"}, {"authorId": "2797078", "name": "Rashid Jayousi"}], "citations": [{"paperId": "58f29f78da2029cd0f655c60514a6628831b5b09", "title": "Credit Risk Assessment"}]}
