{"paperId": "1c08d1ea70926e188ee1f33b7ac6d9e4b73ff661", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Research on the Path of High-Quality Development of Student Management under the Explanatory Structural Model Oriented to Solve the Dilemma of Collaborative Governance of Student Management in Colleges and Universities", "abstract": "\n This paper firstly studies the student management model, analyzes the mechanism of explaining the operation of the structural model, and proposes the DEMATEL method. Secondly, the ISM model is established on the basis of DEMATEL, and the cross-matrix multiplication method is introduced to explore the diffusion of interrelationships among factors in the system. And finally, the construction of the DEMATEL-ISM model is completed. Then, 11 experts were selected to set up an ISM group to construct the relevant reachability matrix after determining the key factors of the problem, and a multi-layer recursive order structure model was established based on the high-quality management influencing factors. Finally, an empirical examination was conducted to examine the overall effect of student management quality in S colleges and universities. Among the key factors of student management, classroom management was identified as the most critical factor affecting the quality of student management, with the ratio of the most important and the important summed up to 76.1%. Among the classroom student participation in higher education, the highest score was given to participatory behavior, with an interval between [2,5] and a mean value of 3.4808. The quality of student management in higher education was characterized by a high level of dissatisfaction among students and teachers, which was 41.94% and 51.28%, respectively. It can be seen that daily management, moral education, teacher management, and teacher competence are insufficient. Colleges and universities need to strengthen the construction of these 4 aspects and put forward relative coping strategies for the deficiencies that exist.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-13", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2280980719", "name": "Rui Wang"}], "citations": []}
