{"paperId": "1c208bc29e4c8d7a25e2c44331d383df4c19e21e", "publicationVenue": {"id": "e109659a-ff21-44f3-94c7-7cfd98f03c63", "name": "Journal of Applied Sciences and Environmental Management", "type": "journal", "alternate_names": ["J Appl Sci Environ Manag"], "issn": "1119-8362", "alternate_issns": ["2659-1502"], "url": "http://www.bioline.org.br/ja"}, "title": "Domestic Energy Consumption and Its Contribution to Greenhouse Gas Emissions: Insights from Koulikoro Urban Community, Sudano-Sahelian Zone of Mali in West Africa", "abstract": "The objective of this study is to estimate the carbon dioxide (CO2) released by domestic energy (firewood and charcoal) in the urban commune of Koulikoro, Mali. This study employed questionnaire survey to identify the type of energies used, their costs, the quantity consumed, and the difficulties of access to these energies and their impact on natural resources in Koulikoro. The consumption of each family per neighbourhood was extrapolated to its total population to determine the carbon emitted and the carbon dioxide released. Thus, the carbon dioxide emitted in tonnes per neighbourhood was determined. The findings revealed three types of energy in the urban commune of Koulikoro, mainly firewood 72%, charcoal 25% and Gas 3%. The use of these energy sources depends on accessibility and availability. The increase in consumption per district is a function of the number of people. Daily used charcoal was estimated at 2 kg day-1 and 7 kg day-1 for firewood. Overall, average firewood using was highest in largest household size and it was 62% higher than in small size category which recorded the lowest. Annual amount of charcoal used was 676 kg year-1 and 2294 kg year-1 for firewood. However, annual amount of fuelwood per person was higher in small size category and 178% greater than in largest household group than other household size. Carbon consumption per capita per year was greater in small household group estimate to be 477 kg pns-1 year-1. Thus, the urban commune of Koulikoro has a significant carbon dioxide emission and firewood emits more CO2 than charcoal.", "venue": "Journal of Applied Sciences and Environmental Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-28", "journal": {"name": "Journal of Applied Sciences and Environmental Management"}, "authors": [{"authorId": "2093047054", "name": "S. Fané"}, {"authorId": "2274670081", "name": "D. Traoré"}, {"authorId": "2274434769", "name": "A. K. Koné"}, {"authorId": "2274669959", "name": "C. Traoré"}, {"authorId": "2274919125", "name": "A. Ahmed"}, {"authorId": "2274669884", "name": "M. Yussuf"}, {"authorId": "2274669914", "name": "M. Karembe"}], "citations": []}
