{"paperId": "1c259361caa85c2d95a7d04e5e42fa98693da85b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models as Evolutionary Optimizers", "abstract": "Evolutionary algorithms (EAs) have achieved remarkable success in tackling complex combinatorial optimization problems. However, EAs often demand carefully-designed operators with the aid of domain expertise to achieve satisfactory performance. In this work, we present the first study on large language models (LLMs) as evolutionary combinatorial optimizers. The main advantage is that it requires minimal domain knowledge and human efforts, as well as no additional training of the model. This approach is referred to as LLM-driven EA (LMEA). Specifically, in each generation of the evolutionary search, LMEA instructs the LLM to select parent solutions from current population, and perform crossover and mutation to generate offspring solutions. Then, LMEA evaluates these new solutions and include them into the population for the next generation. LMEA is equipped with a self-adaptation mechanism that controls the temperature of the LLM. This enables it to balance between exploration and exploitation and prevents the search from getting stuck in local optima. We investigate the power of LMEA on the classical traveling salesman problems (TSPs) widely used in combinatorial optimization research. Notably, the results show that LMEA performs competitively to traditional heuristics in finding high-quality solutions on TSP instances with up to 20 nodes. Additionally, we also study the effectiveness of LLM-driven crossover/mutation and the self-adaptation mechanism in evolutionary search. In summary, our results reveal the great potentials of LLMs as evolutionary optimizers for solving combinatorial problems. We hope our research shall inspire future explorations on LLM-driven EAs for complex optimization challenges.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-29", "journal": {"name": "ArXiv", "volume": "abs/2310.19046"}, "authors": [{"authorId": "2152939552", "name": "Shengcai Liu"}, {"authorId": "3486051", "name": "Caishun Chen"}, {"authorId": "40507824", "name": "Xinghua Qu"}, {"authorId": "2253405825", "name": "Ke Tang"}, {"authorId": "8748397", "name": "Y. Ong"}], "citations": [{"paperId": "03bd8f820e41b9fe7515c9dfaf3b315f1b8da7ee", "title": "From Words to Routes: Applying Large Language Models to Vehicle Routing"}, {"paperId": "b671934871fb9a2db3ba729647f298d46958804d", "title": "Large Language Model-Based Evolutionary Optimizer: Reasoning with elitism"}, {"paperId": "d2503ddd1bcd4b33ac1c703c3475d6aae8abf483", "title": "LLaMoCo: Instruction Tuning of Large Language Models for Optimization Code Generation"}, {"paperId": "b063f6cf5a480fa51806a1cfcdabcc6cdc891a15", "title": "MGE: A Training-Free and Efficient Model Generation and Enhancement Scheme"}, {"paperId": "f859b66e55aebdd4d460e2bc1e74640eafead5ad", "title": "Zero-Shot Chain-of-Thought Reasoning Guided by Evolutionary Algorithms in Large Language Models"}, {"paperId": "af9f5838b3c234f984d0f689b39fc93dbe7f7fe4", "title": "Discovering More Effective Tensor Network Structure Search Algorithms via Large Language Models (LLMs)"}, {"paperId": "44847844e3709eebd55185d3afe20f3c3b28f269", "title": "Conversational Crowdsensing: A Parallel Intelligence Powered Novel Sensing Approach"}, {"paperId": "be7a88babf78512b545f585517704cb597388cbc", "title": "ReEvo: Large Language Models as Hyper-Heuristics with Reflective Evolution"}, {"paperId": "2c3152761de1dec262ed6a0375cca9c4d334a52f", "title": "A match made in consistency heaven: when large language models meet evolutionary algorithms"}, {"paperId": "478f71f1cd9bad0435560544a9dce7ca49d97766", "title": "Evolutionary Computation in the Era of Large Language Model: Survey and Roadmap"}, {"paperId": "6d91f344e9c80df5c69311abfc63b74b42c735c3", "title": "An Example of Evolutionary Computation + Large Language Model Beating Human: Design of Efficient Guided Local Search"}, {"paperId": "6a4719871c5d51ad2cd140561652500df06409bd", "title": "Algorithm Evolution Using Large Language Model"}]}
