{"paperId": "1c274a962c19049686c2145a5f977c8e6f7b13d8", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Interactive Design and Implementation of a Digital Museum under the Background of AR and Blockchain Technology", "abstract": "A museum is the destination of the crystallization of history and culture, and a museum is the center for the development of heritage culture. The display and exhibition of historical relics can promote the harmonious development of society. However, there are many defects in traditional museums. The collection in the museum is scattered. The exhibition needs a specific time and place to open, and the exhibition mode is boring and lacks entertainment, which seriously limits the museum’s dissemination of history and culture. In order to improve the public’s number of visits, museums need to keep pace with the times. Using augmented reality technology can digitize the information in the museum and integrate it with the user’s real environment, which solves the limitation of time and space for most users to visit the museum, and greatly increases the entertainment of users to visit the museum. In addition, the application of blockchain technology in digital museums can effectively ensure the security of museum cultural relics data and quickly restore the lost cultural relics information. The digital museum can help tourists realize cross-region viewing. Through multimedia software and hardware, it can greatly stimulate tourists’ interest and attract tourists of different ages to visit. This article uses digital technology to present physical museums in a digital form on the network, but it is difficult for digital museums to conduct targeted analysis on tourists of different ages. This article will analyze the attraction ability of digital museums to tourists of different ages, thereby attracting tourists of different ages to visit. This paper compared traditional museums with digital museums based on augmented reality technology and blockchain technology. The experimental results showed that from the perspective of young people, the average interactivity of traditional museums and digital museums was 47.20% and 78.20%, respectively; from the perspective of the elderly, the average interactivity of traditional museums and digital museums was 59.04% and 70.36%, respectively. Therefore, the digital museum built by using augmented reality technology and blockchain technology can effectively improve the interaction with users. The digital museum can improve the interaction with tourists of different ages, attract a large number of tourists for virtual visits, and improve the cultural transmission and economic development of the digital museum.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2109745342", "name": "Wangming Hu"}, {"authorId": "2115570180", "name": "Hyunsuk Han"}, {"authorId": "2219752214", "name": "Gulong Wang"}, {"authorId": "2219739017", "name": "Tao Peng"}, {"authorId": "2220668313", "name": "Zhiqiang Yang"}], "citations": [{"paperId": "0598c20047c70b6794fe8acbb6f5e1dff7d71efa", "title": "An empirical study on user experience evaluation of VR interface in digital museums"}]}
