{"paperId": "1c2fe545b63f83832f5371d9c6f9ee4ccb8865d9", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "GeneaLog: Fine-Grained Data Streaming Provenance at the Edge", "abstract": "Fine-grained data provenance in data streaming allows linking each result tuple back to the source data that contributed to it, something beneficial for many applications (e.g., to find the conditions triggering a security- or safety-related alert). Further, when data transmission or storage has to be minimized, as in edge computing and cyber-physical systems, it can help in identifying the source data to be prioritized. The memory and processing costs of fine-grained data provenance, possibly afforded by high-end servers, can be prohibitive for the resource-constrained devices deployed in edge computing and cyber-physical systems. Motivated by this challenge, we present GeneaLog, a novel fine-grained data provenance technique for data streaming applications. Leveraging the logical dependencies of the data, GeneaLog takes advantage of cross-layer properties of the software stack and incurs a minimal, constant size per-tuple overhead. Furthermore, it allows for a modular and efficient algorithmic implementation using only standard data streaming operators. This is particularly useful for distributed streaming applications since the provenance processing can be executed at separate nodes, orthogonal to the data processing. We evaluate an implementation of GeneaLog using vehicular and smart grid applications, confirming it efficiently captures fine-grained provenance data with minimal overhead.", "venue": "International Middleware Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-11-26", "journal": {"name": "Proceedings of the 19th International Middleware Conference"}, "authors": [{"authorId": "1403617104", "name": "Dimitris Palyvos-Giannas"}, {"authorId": "1912583", "name": "Vincenzo Gulisano"}, {"authorId": "1752071", "name": "M. Papatriantafilou"}], "citations": [{"paperId": "117ba24a733ff51160027a502ed3423b0bfec233", "title": "Research Summary: Deterministic, Explainable and Efficient Stream Processing"}, {"paperId": "366d24adbadb4b8b7f1605655ae267c9cb3825e6", "title": "Amnis: Optimized stream processing for edge computing"}, {"paperId": "2fe0db78f3c0169f91e9662cc4bdfc8944742bba", "title": "ARTINALI++: Multi-dimensional Specification Mining for Complex Cyber-Physical System Security"}, {"paperId": "347608eca1d00bacf0d7b24bdd5660ed1baaa342", "title": "s2p: Provenance Research for Stream Processing System"}, {"paperId": "be0bf74d9e7ee4a1e5a9b813501c5b114035c16b", "title": "ARTINALI#: An Efficient Intrusion Detection Technique for Resource-Constrained Cyber-Physical Systems"}, {"paperId": "00ed77e5d8389fd07d39c786788849f67f5f3bce", "title": "Poster: Twins, a Middleware for Adaptive Streaming Provenance at the Edge"}, {"paperId": "39cc97a588662c125870ae1035dea92213655a6b", "title": "Industrial IoT: Challenges, Design Principles, Applications, and Security"}, {"paperId": "ab28b38976d7a5b9df58b2ca27188121c30f7522", "title": "DRIVEN: A framework for efficient Data Retrieval and clustering in Vehicular Networks"}, {"paperId": "460e89e25e557f35b6942ead28a249dfe0ec1dec", "title": "Automatic Translation of Spatio-Temporal Logics to Streaming-Based Monitoring Applications for IoT-Equipped Autonomous Agents"}, {"paperId": "405d8348b9c0cf97e21fea4c67b4b7e6fc75f373", "title": "Haren: A Middleware for Ad-Hoc Thread Scheduling Policies in Data Streaming"}, {"paperId": "ce3ef26eed4c4d7cf6f44c0a8f1f8511e1571226", "title": "Querying Large Vehicular Networks: How to Balance On-Board Workload and Queries Response Timeƒ"}, {"paperId": "c1c3ee5113b5621f2cb5d27bff7ff9412b9bbc28", "title": "Adaptive Stream-based Shifting Bottleneck Detection in IoT-based Computing Architectures"}, {"paperId": "48444d96e699922d9b590a6ca4e1b0016e105690", "title": "Haren: A Framework for Ad-Hoc Thread Scheduling Policies for Data Streaming Applications"}, {"paperId": "63ca073f3a7bcb9e96f4a21c882b8d421a6d76f8", "title": "Mimir - Streaming Operators Classification with Artificial Neural Networks"}, {"paperId": "634cbebd205b465615d2d4cfcc1d142f81fe3824", "title": "Stream-IT: Continuous and dynamic processing of production systems data - throughput bottlenecks as a case-study"}, {"paperId": "c8a28cda8d668b8e58adaf8c77973785d2dad0fa", "title": "DRIVEN: a Framework for Efficient Data Retrieval and Clustering in Vehicular Networks"}, {"paperId": "659e0251563e5dc83dbc6f02a65389cf3042e013", "title": "Time- and Computation-Efficient Data Localization at Vehicular Networks’ Edge"}, {"paperId": "7a6b49508a46ca178ac5a40e9b8053e5568deb79", "title": "Intrusion Detection in Industrial Networks via Data Streaming"}, {"paperId": "21cf77bb67299a1ff500dac507950878b081093e", "title": "Distributed and Communication-Efficient Continuous Data Processing in Vehicular Cyber-Physical Systems"}]}
