{"paperId": "1c3117f6b9a913896255edd089cb818cf3f3f018", "publicationVenue": null, "title": "Alleviating I/O Inefficiencies to Enable Effective Model Training Over Voluminous, High-Dimensional Datasets", "abstract": "There has been an exponential growth in data volumes in several domains. Often these voluminous datasets encompass a large number of features. Fitting models to such high-dimensional, voluminous data allows us to understand phenomena and inform decision-making. The analytics process is naturally iterative as scientists explore the set of features, data fitting algorithms, portions of the dataspace, and the particular algorithm’s hyperparameters to guide their model-building process. It often takes several model-fitting attempts before one arrives at a satisfactory solution that may then be subjected to further refinements. Each of these model-building attempts is itself time-consuming and dominated by I/O and data movement costs. In this study, we present our methodology for significantly alleviating I/O-induced inefficiencies during model training. Rather than work with the raw data, we generate and work with sketches of the data. Our framework, Fennel, is independent of the libraries or analytical engines preferred by users. Our empirical benchmarks have been performed with datasets from diverse domains (weather, epidemiology, and music) and we profile several aspects of our methodology.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "468-477"}, "authors": [{"authorId": "2425318", "name": "Daniel Rammer"}, {"authorId": "2930999", "name": "Walid Budgaga"}, {"authorId": "3438590", "name": "Thilina Buddhika"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "1e0fcbcc1373cb73ec89562224bf309d1174a91d", "title": "Towards Timely, Resource-Efficient Analyses Through Spatially-Aware Constructs within Spark"}, {"paperId": "0a0496ca395ff3a8ed3d99d43bbc623b167c8f9a", "title": "Small is Beautiful: Distributed Orchestration of Spatial Deep Learning Workloads"}]}
