{"paperId": "1c4a73f78342cf48b1e9e2cb5418da35feeb5519", "publicationVenue": {"id": "aa8f57e2-d5cf-4f0d-afcb-8577fb02e10a", "name": "Kybernetes", "type": "journal", "issn": "0368-492X", "url": "https://www.emerald.com/insight/publication/issn/0368-492X", "alternate_urls": ["http://www.emeraldinsight.com/0368-492X.htm", "http://www.emeraldinsight.com/loi/k"]}, "title": "How does cloud computing help businesses to manage big data issues", "abstract": "PurposeBig data has posed problems for businesses, the Information Technology (IT) sector and the science community. The problems posed by big data can be effectively addressed using cloud computing and associated distributed computing technology. Cloud computing and big data are two significant past-year problems that allow high-efficiency and competitive computing tools to be delivered as IT services. The paper aims to examine the role of the cloud as a tool for managing big data in various aspects to help businesses.Design/methodology/approachThis paper delivers solutions in the cloud for storing, compressing, analyzing and processing big data. Hence, articles were divided into four categories: articles on big data storage, articles on big data processing, articles on analyzing and finally, articles on data compression in cloud computing. This article is based on a systematic literature review. Also, it is based on a review of 19 published papers on big data.FindingsFrom the results, it can be inferred that cloud computing technology has features that can be useful for big data management. Challenging issues are raised in each section. For example, in storing big data, privacy and security issues are challenging.Research limitations/implicationsThere were limitations to this systematic review. The first limitation is that only English articles were reviewed. Also, articles that matched the keywords were used. Finally, in this review, authoritative articles were reviewed, and slides and tutorials were avoided.Practical implicationsThe research presents new insight into the business value of cloud computing in interfirm collaborations.Originality/valuePrevious research has often examined other aspects of big data in the cloud. This article takes a new approach to the subject. It allows big data researchers to comprehend the various aspects of big data management in the cloud. In addition, setting an agenda for future research saves time and effort for readers searching for topics within big data.", "venue": "Kybernetes", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-06", "journal": {"name": "Kybernetes", "pages": "1917-1948", "volume": "51"}, "authors": [{"authorId": "15618644", "name": "A. Latifian"}], "citations": [{"paperId": "0195f60b26e40918d9724b299a9a0329a85357be", "title": "The impact of digital transformation on big data analytics and firm’s sustainability performance in a post-pandemic era"}, {"paperId": "2eee1f3cc6eadbbc30b8b8310a33c02f86447c18", "title": "New technological trajectories and research directions in Cloud Computing Technology, 2004-2021"}]}
