{"paperId": "1c4cc67e7e7fa1491cdb73ff49b7b43cefd133cc", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "A Machine Learning Tool for Supporting Advanced Knowledge Discovery from Chess Game Data", "abstract": "In the current era of big data, high volumes of a wide variety of data of different veracity can be easily collected or generated at a high velocity. Embedded in these big data is valuable information or knowledge. This calls for machine learning techniques for supporting advanced knowledge discovery from these big data. A rich source of big heterogeneous data is game data--including sports games, online video games, and board games such as chess games. The deep interaction and simplicity of representation afforded by the game of chess have worked together to produce one of the most studied games in the world. It is a great intellectual challenge, and not only for humans. Chess engines can sometimes play chess better than grandmasters, and they can be used to assist the study of games and individual positions. However, this does not help a chess student choose which games to study. In this paper, we present a machine learning system--specifically, an unsupervised learning tool--to analyze big chess datasets. Evaluation results show that not only can machine learning help find interesting games, but also that chess can be a great testing ground for machine learning and data mining techniques for big data analytics.", "venue": "International Conference on Machine Learning and Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 16th IEEE International Conference on Machine Learning and Applications (ICMLA)", "pages": "649-654"}, "authors": [{"authorId": "2122201221", "name": "James A. Brown"}, {"authorId": "145046124", "name": "A. Cuzzocrea"}, {"authorId": "35589935", "name": "Michael Kresta"}, {"authorId": "35305490", "name": "Korbin D. L. Kristjanson"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "35543490", "name": "Timothy W. Tebinka"}], "citations": [{"paperId": "8ada178cdf0cddc0737f696ee1cdc43a24813169", "title": "Machine Learning Techniques for Effective Pathogen Detection Based on Resonant Biosensors"}, {"paperId": "ddba3dd256d65da9338dc033d510bf56e72679e4", "title": "Keep it simple: A Novel Algorithmic Based Chess Scoresheet Writing using Computer Vision"}, {"paperId": "89b2f1bd87de37834a78a575ce53d8dccd1ec853", "title": "Hybrid modelling of a batch separation process"}, {"paperId": "105e1b01d54c01559dc7e1392016205c74f66fd4", "title": "CHESS AI: Machine learning and Minimax based Chess Engine"}, {"paperId": "09658606353ec900e09232f2bfa6273bf10707dd", "title": "Word Play for Playing Othello (Reverses)"}, {"paperId": "1e13c45e43a00035fe76b8c5738ccd7928b7f669", "title": "A lightweight approach for predicting errors in chess matches"}, {"paperId": "962a09ee320f25e8db172d92abfad3cfe0edf9c0", "title": "Preserving the legacy – Why do professional soccer clubs (not) adopt innovative process technologies? A grounded theory study"}, {"paperId": "a8049d2bf8bbb6ea285a8857bd76a2e6f85cd531", "title": "A Technology Acceptance Model-Based Analytics for Online Mobile Games Using Machine Learning Techniques"}, {"paperId": "b1199e4d68e9fe503e5a5b97c29e2eac46de5e57", "title": "Machine Learning and OLAP on Big COVID-19 Data"}, {"paperId": "d5d07d27edd87031a17b750db3248893a43cd41f", "title": "Compression for Very Sparse Big Social Data"}, {"paperId": "d3edd5733dede8044de3f2e596b925eca4319eff", "title": "Big Data Science on COVID-19 Data"}, {"paperId": "2b44ef7b8df325ec524513c3bc124d5b6a2ec721", "title": "Prediction of Food Preparation Time for Smart City"}, {"paperId": "13d3c3ac588b7ef7457907c23d46e0ecfdf5c6b1", "title": "Temporal Data Analytics on COVID-19 Data with Ubiquitous Computing"}, {"paperId": "5fec0c4df897eb6bae41618fc4badca2e79e6316", "title": "Explainable Machine Learning and Mining of Influential Patterns from Sparse Web"}, {"paperId": "b1b4a24a7e41b4eb4ffacacd0cf2a971e9e45036", "title": "Big Data Analysis and Services: Visualization on Smart Data to Support Healthcare Analytics"}, {"paperId": "8a0393dac3363b649d1833b3439a96bb226f6ec5", "title": "AI-Based Sensor Information Fusion for Supporting Deep Supervised Learning"}, {"paperId": "6984f2aadd187051546e8e6ddb505460b1bc327a", "title": "Computational Intelligence in Sports: A Systematic Literature Review"}, {"paperId": "ca46cbfb5cac14fc7f0677db5739fa1560b421fc", "title": "Scalable Vertical Mining for Big Data Analytics of Frequent Itemsets"}, {"paperId": "31c789d7bf72c52e3c912734d833d24311d39f7f", "title": "Fuzzy Logic-Based Data Analytics on Predicting the Effect of Hurricanes on the Stock Market"}, {"paperId": "3e9cb0c598858a6e8d5177fd65f7f5c69ce09ba6", "title": "Constrained Frequent Pattern Mining from Big Data Via Crowdsourcing"}, {"paperId": "f61c4b280cc939bc6635dd1bb5935e364b01d5f5", "title": "Constrained Big Data Mining in an Edge Computing Environment"}, {"paperId": "59a17139ae33fc33bf8715b54b31951e0bfbd825", "title": "Adaptive Machine Learning Algorithm and Analytics of Big Genomic Data for Gene Prediction"}, {"paperId": "09ee67e82872e342f90f97ba6503bb123f87fe82", "title": "Deep Embedded Knowledge Graph Representations for Tactic Discovery"}, {"paperId": "9c853e8cdb2324541dc0cfadda8112e958fa9bca", "title": "Data Science for Big Data Applications and Services: Data Lake Management, Data Analytics and Visualization"}, {"paperId": "54570473f71255c716dd228334a1ac29ed0e83cf", "title": "Data analytics on the board game Go for the discovery of interesting sequences of moves in joseki"}]}
