{"paperId": "1c54c11f075429adefadc3ae04549f8d0a9b4dab", "publicationVenue": {"id": "ebac41dc-daae-495b-b205-6f48b790974d", "name": "Big Earth Data", "issn": "2574-5417", "url": "https://tandfonline.com/loi/tbed20", "alternate_urls": ["http://www.tandfonline.com/TBED"]}, "title": "A Ceph-based storage strategy for big gridded remote sensing data", "abstract": "ABSTRACT When using distributed storage systems to store gridded remote sensing data in large, distributed clusters, most solutions utilize big table index storage strategies. However, in practice, the performance of big table index storage strategies degrades as scenarios become more complex, and the reasons for this phenomenon are analyzed in this paper. To improve the read and write performance of distributed gridded data storage, this paper proposes a storage strategy based on Ceph software. The strategy encapsulates remote sensing images in the form of objects through a metadata management strategy to achieve the spatiotemporal retrieval of gridded data, finding the cluster location of gridded data through hash-like calculations. The method can effectively achieve spatial operation support in the clustered database and at the same time enable fast random read and write of the gridded data. Random write and spatial query experiments proved the feasibility, effectiveness, and stability of this strategy. The experiments prove that the method has higher stability than, and that the average query time is 38% lower than that for, the large table index storage strategy, which greatly improves the storage and query efficiency of gridded images.", "venue": "Big Earth Data", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-27", "journal": {"name": "Big Earth Data", "pages": "323 - 339", "volume": "6"}, "authors": [{"authorId": "2143616261", "name": "Xinyu Tang"}, {"authorId": "49602855", "name": "X. Yao"}, {"authorId": "81140988", "name": "Diyou Liu"}, {"authorId": "2109091279", "name": "Long Zhao"}, {"authorId": "2156054982", "name": "Li Li"}, {"authorId": "2115991205", "name": "Dehai Zhu"}, {"authorId": "1775836", "name": "Guoqing Li"}], "citations": [{"paperId": "2c79cd9ab26713953b760b5bedba20c5df87766c", "title": "OpenDroneMap: Multi-Platform Performance Analysis"}, {"paperId": "837b1d36180153a69bdcc81501e01f7e8bbede20", "title": "Efficient Management and Scheduling of Massive Remote Sensing Image Datasets"}, {"paperId": "b835a26f28c295dc852dc276f4bea46b260f62bc", "title": "HexTile: A Hexagonal DGGS-Based Map Tile Algorithm for Visualizing Big Remote Sensing Data in Spark"}, {"paperId": "f8a3d2b96df340c883160a54426459f7e2ec9585", "title": "Extraction of ocean tidal information based on global equal-area grid and satellite altimeter data"}, {"paperId": "ce115a9d7d1cc7dcdebf903f4534cc9d7673db96", "title": "Construction of rhombic triacontahedron discrete global grid systems"}]}
