{"paperId": "1c652c94a9538eeaab31bc1080bc67fe0c27180c", "publicationVenue": {"id": "770f1d88-52c2-43dc-a897-6881e70b2f32", "name": "International Conference on Data Science and Advanced Analytics", "type": "conference", "alternate_names": ["Int Conf Data Sci Adv Anal", "IEEE International Conference on Data Science and Advanced Analytics", "IEEE Int Conf Data Sci Adv Anal", "DSAA"]}, "title": "DaskDB: Scalable Data Science with Unified Data Analytics and In Situ Query Processing", "abstract": "Due to the rapidly rising data volume, there is a need to analyze this data efficiently and produce results quickly. However, data scientists today need to use different systems, since presently relational databases are primarily used for SQL querying and data science frameworks for complex data analysis. This may incur significant movement of data across multiple systems, which is expensive. Furthermore, with relational databases, the data must be completely loaded into the database before performing any analysis. We believe that data scientists would prefer to use a single system to perform both data analysis tasks and SQL querying, without requiring data movement between different systems. Ideally, this system would offer adequate performance, scalability, built-in data analysis functionalities, and usability. We present DaskDB, a scalable data science system with support for unified data analytics and in situ SQL query processing on heterogeneous data sources. DaskDB supports invoking Python APIs as User-Defined Functions (UDF). So, it can be easily integrated with most existing Python data science applications. Moreover, we introduce a distributed index join algorithm and a novel distributed learned index to improve join performance. Our experimental evaluation involve the TPC-H benchmark and a custom UDF benchmark, which we developed, for data analytics. And, we demonstrate that DaskDB significantly outperforms PySpark and Hive/Hivemall.", "venue": "International Conference on Data Science and Advanced Analytics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-06", "journal": {"name": "2021 IEEE 8th International Conference on Data Science and Advanced Analytics (DSAA)", "pages": "1-10"}, "authors": [{"authorId": "2114412139", "name": "A. Watson"}, {"authorId": "2157692899", "name": "Suvam Kumar Das"}, {"authorId": "144540209", "name": "S. Ray"}], "citations": [{"paperId": "8406c0ce2b9a2983976f2149f31724e94bc3fd3b", "title": "Scalable Spatial Analytics and In Situ Query Processing in DaskDB"}, {"paperId": "dc9cf93dbdce6614ca6a0a335de6e229bf50cb91", "title": "MUAR: Maximizing Utilization of Available Resources for Query Processing"}, {"paperId": "d28df6acd26036102e74fbc4bc759ccf5c2c3eae", "title": "In-Situ Cross-Database Query Processing"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}]}
