{"paperId": "1c71449c5b47c67995ad1ba7e3a3a2533f715564", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "EasyBDI: Near Real-Time Data Analytics over Heterogeneous Data Sources", "abstract": "The large volume of currently available data creates several opportunities for sciences and industry, especially with the application of data analytics. But also raises challenges that make unfeasible the use of batch-based ETL processes. Indeed, near real-time data analytics is a requirement in several domains as an alternative to traditional data warehouses. In the last years, big data platforms have been developed to enable query execution over distributed data sources. However, they do not deal with subject-oriented analysis, do not provide data distribution transparency, or do not assist with schema mapping and integration. In this demonstration, we present EasyBDI. It’s a near real-time big data analytics prototype that enables users to run queries over heterogeneous data sources based on global logical abstractions created by the system and provides some usual concepts of data warehouse systems, like facts and dimensions. We use two motivating scenarios, one based on three years of real data on photovoltaic energy production and consumption, and the other based on the SSB+ benchmark. We will also present implementation challenges, issues, solutions, and insights.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "702-705"}, "authors": [{"authorId": "2065423883", "name": "B. Silva"}, {"authorId": "144139989", "name": "José Moreira"}, {"authorId": "1410763729", "name": "R. L. C. Costa"}], "citations": [{"paperId": "ee864d3e2ae89970444dc9beb07d8c07f3297344", "title": "Logical big data integration and near real-time data analytics"}]}
