{"paperId": "1c795295710e3dbfa2a42f60a53643b72c3b0769", "publicationVenue": {"id": "ed1a4fd7-872c-49e9-b342-67709ebaacfc", "name": "International Conference on Internet of Things and Intelligence System", "type": "conference", "alternate_names": ["IOTAIS", "Int Conf Internet Thing Intell Syst"]}, "title": "Protection Profile Bricks for Secure IoT Devices", "abstract": "The Internet of Things (IoT) paradigm has been proposed in the last few years with the goal of addressing technical problems in fields such as home and industrial automation, smart lighting systems and traffic monitoring. However, due to the very nature of the IoT devices (generally low-powered and often lacking strong security functionalities), typical deployments pose a great risk in terms of security and privacy. In this respect, the utilization of both a Trusted Execution Environment (TEE) and a Trusted Platform Module (TPM) can serve as a countermeasure against typical attacks. Furthermore, these functional blocks can serve as safe key storage services and provide a robust secure boot implementation and a firmware update mechanism, thus ensuring run-time authentication and integrity. The Common Criteria for Information Technology Security Evaluation allows to determine the degree of attainment of precise security properties in a product. The main objective of this work is to identify, propose and compose bricks of protection profile (PP), as defined by Common Criteria, that are applicable to secure IoT architectures. Moreover, it aims at giving some guiding rules and facilitate future certifications of components and/or their composition. Finally, it also provides a structure for a future methodology of assessment for IoT devices.", "venue": "International Conference on Internet of Things and Intelligence System", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-01-27", "journal": {"name": "2020 IEEE International Conference on Internet of Things and Intelligence System (IoTaIS)", "pages": "8-13"}, "authors": [{"authorId": "8588785", "name": "Antonio de la Piedra"}, {"authorId": "2042183003", "name": "Raphaël Collado"}], "citations": [{"paperId": "4c14141ec9620fb7fe3dff277cb43055e1c1fab2", "title": "Efficient Integrity-Tree Structure for Convolutional Neural Networks through Frequent Counter Overflow Prevention in Secure Memories"}]}
