{"paperId": "1c7d2495d60501ed54552a399da2e950f27bf14a", "publicationVenue": null, "title": "A proposed model for predicting stock market behavior based on detecting fake news", "abstract": ": Stock market is an important area of research due to its higher earnings. The higher earnings for the stock market also imply higher risks, so a large amount of data generated by the stock market is considered a treasure of knowledge for investors. There are several aspects that affect the stock market fluctuations the most important of them is news data. News data have an influential effect on the investors' thoughts and beliefs. Using machine learning and textual data processing considered a significant part of the stock market analysis. Researchers concerned with designing the suitable model to predict the future behavior of stock market to avoid investment risks. It was found that there is a strong relationship between stock news and changes in the stock prices. This study aims at proposed a framework for detecting the stock market fake news that helps in avoiding higher investment risks and improve the stock market prediction accuracy. Discovering the best combination of machine learning algorithms that lead to the best performance of the prediction model that designed based on news sentiment analysis and numeric data analysis. Different experiments have been applied to uncover algorithms that led to the best performance and raising the prediction accuracy up to 92%.", "venue": "Empowering Science and Mathematics for Global Competitiveness", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2019-06-07", "journal": {"name": "Empowering Science and Mathematics for Global Competitiveness"}, "authors": [{"authorId": "3371301", "name": "A. Idrees"}, {"authorId": "144489773", "name": "M. Ibrahim"}, {"authorId": "3853136", "name": "Neamat Hegazy"}], "citations": [{"paperId": "7baacb7c441416d629cb77859776da35a4ba4c40", "title": "EXPLORATORY BIG DATA STATISTICAL ANALYSIS THE IMPACT OF PEOPLE LIFE'S CHARACTERISTICS ON THEIR EDUCATIONAL LEVEL"}, {"paperId": "279946c820b783e6c21090d522e75c9c399c47e7", "title": "A Smart Framework for Enhancing Automated Teller Machines (ATMs) Fraud Prevention"}]}
