{"paperId": "1c7e7f7b14966857dafb33c6fa72e51eb2b73236", "publicationVenue": null, "title": "Geoweaver: Advanced Cyberinfrastructure for Managing Hybrid Geoscientific AI Workflows", "abstract": "AI (artificial intelligence)-based analysis of geospatial data has gained a lot of attention. Geospatial datasets are multi-dimensional; have spatiotemporal context; exist in disparate formats; and require sophisticated AI workflows that include not only the AI algorithm training and testing, but also data preprocessing and result post-processing. This complexity poses a huge challenge when it comes to full-stack AI workflow management, as researchers often use an assortment of time-intensive manual operations to manage their projects. However, none of the existing workflow management software provides a satisfying solution on hybrid resources, full file access, data flow, code control, and provenance. This paper introduces a new system named Geoweaver to improve the efficiency of full-stack AI workflow management. It supports linking all the preprocessing, AI training and testing, and post-processing steps into a single automated workflow. To demonstrate its utility, we present a use case in which Geoweaver manages end-to-end deep learning for in-time crop mapping using Landsat data. We show how Geoweaver effectively removes the tedium of managing various scripts, code, libraries, Jupyter Notebooks, datasets, servers, and platforms, greatly reducing the time, cost, and effort researchers must spend on such AI-based workflows. The concepts demonstrated through Geoweaver serve as an important building block in the future of cyberinfrastructure for AI research.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-21", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "119", "volume": "9"}, "authors": [{"authorId": "2402114", "name": "Ziheng Sun"}, {"authorId": "31082471", "name": "L. Di"}, {"authorId": "3381343", "name": "A. Burgess"}, {"authorId": "2727861", "name": "J. A. Tullis"}, {"authorId": "115896158", "name": "Andrew B. Magill"}], "citations": [{"paperId": "6734e948a54b8b90683b50314d1233f70819243d", "title": "Geoweaver_cwl: Transforming geoweaver AI workflows to common workflow language to extend interoperability"}, {"paperId": "a8de60d26c514ae86dc303f6f9823d4fb7bee20a", "title": "Utility of the Python package Geoweaver_cwl for improving workflow reusability: an illustration with multidisciplinary use cases"}, {"paperId": "b25f85bd7a0a5e0837f6be43e354e4bf0db682a4", "title": "High-resolution mapping of snow cover in montane meadows and forests using Planet imagery and machine learning"}, {"paperId": "1b1b3858bcf99eb5336cca7b0aca9ca6bfa89316", "title": "OpenMindat: Open and FAIR mineralogy data from the Mindat database"}, {"paperId": "1e5a47ca2be2749b2c41591f0fdb410906a4ea25", "title": "On the Analyses of Medical Images Using Traditional Machine Learning Techniques and Convolutional Neural Networks"}, {"paperId": "3ca8baaf637bff648c516040253017971f48c7e4", "title": "Enhancing Reproducibility and Replicability in Remote Sensing Deep Learning Research and Practice"}, {"paperId": "9e570722f9dba07d4defeb0fd894c0ef4a397fdc", "title": "Using Geoweaver to Make Snow Mapping Workflow FAIR"}, {"paperId": "e462ff3f4105461492a3c88311669c9cad6647c1", "title": "Provenance documentation to enable explainable and trustworthy AI: A literature review"}, {"paperId": "4846b1bb0ee2469ec644febeaf5b7781bb9d5b1f", "title": "A review of Earth Artificial Intelligence"}, {"paperId": "eb327e6418718c2cf4f6dbbf50030fc9664c460a", "title": "Integration of Web Processing Services with Workflow-Based Scientific Applications for Solving Environmental Monitoring Problems"}, {"paperId": "badc895e5d48833096f3860e13571147d4df37c2", "title": "Earth and Space Science Informatics Perspectives on Integrated, Coordinated, Open, Networked (ICON) Science"}, {"paperId": "9029189a767ba1f758bd1e241a23df22d4e565ef", "title": "Data Science for Geoscience: Recent Progress and Future Trends from the Perspective of a Data Life Cycle"}, {"paperId": "a8ed02fa7dee96adcf580ed0bc29030286dd3894", "title": "GeoFairy2: A Cross-Institution Mobile Gateway to Location-Linked Data for In-Situ Decision Making"}, {"paperId": "9f01906f8769d2c695b50fc61e81dac099019969", "title": "Where Is the Provenance? Ethical Replicability and Reproducibility in GIScience and Its Critical Applications"}, {"paperId": "cb8649b0d2d10f0c14c8e2993fe34f9f89d30008", "title": "Deep Learning Classification for Crop Types in North Dakota"}]}
