{"paperId": "1c8675b40d527842cb542e610c622dd46db96211", "publicationVenue": {"id": "265922c3-a861-444a-90b0-6190d69a59cf", "name": "International Conference on Electronics, Information and Communications", "type": "conference", "alternate_names": ["ICEIC", "Int Conf Electron Inf Commun"]}, "title": "Empirical Analysis of Side-Channel Attack Resistance of HLS-designed AES Circuits", "abstract": "Many IoT devices have been compromised by side-channel attacks. Among them, power analysis attack, which identifies the secret key of a circuit by analyzing the power consumption of the target device, is well-known. Although there is generally a trade-off between performance and hardware cost (resources) in circuits, the correlation between performance and security is not known. This study investigates the relationship between side-channel attack resistance, performance (clock cycles) and hardware resources of AES circuits. Six AES circuits with different performance are designed by high-level synthesis. T-test is employed to assess side-channel attack resistance. The results show that there is a correlation between side-channel attack resistance, performance and hardware resource usage, but the relationship varies depending on the definition of side-channel attack resistance.", "venue": "International Conference on Electronics, Information and Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-02-05", "journal": {"name": "2023 International Conference on Electronics, Information, and Communication (ICEIC)", "pages": "1-4"}, "authors": [{"authorId": "2142289862", "name": "Takumi Mizuno"}, {"authorId": "1944817137", "name": "Hiroki Nishikawa"}, {"authorId": "49623991", "name": "Xiangbo Kong"}, {"authorId": "2059442942", "name": "Hiroyuki Tomiyama"}], "citations": [{"paperId": "e40178ca5e132bb40048cddbae97658b630771a3", "title": "Impacts of Clock Frequency and Sampling Intervals on Power Side-Channel Leakage of AES Circuits"}, {"paperId": "ed901b7026b8bdf4bd0bd160f979ff48c49b843f", "title": "Simulation-based Analysis of Power Side-Channel Leakage at Different Sampling Intervals"}]}
