{"paperId": "1c91d8284d09a36417ff1aca53238aeaa7cbcf7c", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Deadline-Aware Dynamic Task Scheduling in Edge–Cloud Collaborative Computing", "abstract": "In recent years, modern industry has been exploring the transition to cyber physical system (CPS)-based smart factories. As intelligent industrial detection and control technology grows in popularity, massive amounts of time-sensitive applications are generated. A cutting-edge computing paradigm called edge-cloud collaborative computing was developed to satisfy the need of time-sensitive tasks such as smart vehicles and automatic mechanical remote control, which require substantially low latency. In edge-cloud collaborative computing, it is extremely challenging to improve task scheduling while taking into account both the dynamic changes of user requirements and the limited available resources. The current task scheduling system applies a round-robin policy to cyclically select the next server from the list of available servers, but it may not choose the best-suited server for the task. To satisfy the real-time task flow of industrial production in terms of task scheduling based on deadline and time sensitivity, we propose a hierarchical architecture for edge-cloud collaborative environments in the Industrial Internet of Things (IoT) and then simplify and mathematically formulate the time consumption of edge-cloud collaborative computing to reduce latency. Based on the above hierarchical model, we present a dynamic time-sensitive scheduling algorithm (DSOTS). After the optimization of DSOTS, the dynamic time-sensitive scheduling algorithm with greedy strategy (TSGS) that ranks server capability and job size in a hybrid and hierarchical scenario is proposed. What cannot be ignored is that we propose to employ comprehensive execution capability (CEC) to measure the performance of a server for the first time and perform effective server load balancing while satisfying the user’s requirement for tasks. In this paper, we simulate an edge-cloud collaborative computing environment to evaluate the performance of our algorithm in terms of processing time, SLA violation rate, and cost by extending the CloudSimPlus toolkit, and the experimental results are very promising. Aiming to choose a more suitable server to handle dynamically incoming tasks, our algorithm decreases the average processing time and cost by 30% and 45%, respectively, as well as the average SLA violation by 25%, when compared to existing state-of-the-art solutions.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-08", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2153655214", "name": "Yu Zhang"}, {"authorId": "145455841", "name": "B. Tang"}, {"authorId": "2048642266", "name": "Jincheng Luo"}, {"authorId": "2108454255", "name": "Jiaming Zhang"}], "citations": [{"paperId": "630b0f8c9899afe55dae2a75e25a00fa414deb78", "title": "Dynamic task scheduling in edge cloud systems using deep recurrent neural networks and environment learning approaches"}, {"paperId": "66527249cb44b9b54268dfeb1270d1e9d28115b4", "title": "Exploration of Multi-Task Scheduling in Multi-Access Edge Computing"}, {"paperId": "a26e04c057c56e0d1c0f71a002e1eb1c05a1bc01", "title": "Efficient algorithm for error optimization and resource prediction to mitigate cost and energy consumption in a cloud environment"}, {"paperId": "bd8664ac6e6978fcb81249029a4ab4c5ab07f26f", "title": "CSADE: a delay-sensitive scheduling method based on task admission and delay evaluation on edge–cloud collaboration"}, {"paperId": "d86193ee943370bc5b582d24781fd71e69a7cf84", "title": "Scheduling DNN Inferencing on Edge and Cloud for Personalized UAV Fleets"}, {"paperId": "c86738cd3dbe0a86605b8515d848f32eb9b53199", "title": "Container‐based data‐intensive application scheduling in hybrid cloud‐edge collaborative environment"}, {"paperId": "c0fcf4c12900a655ac1d37e927eac24126a2be8b", "title": "Deadline-Aware Task Offloading and Resource Allocation in a Secure Fog-Cloud Environment"}, {"paperId": "a39f26b1c7b998d6adf2cb04aa28e65a0d5b93f5", "title": "Container-based task scheduling in cloud-edge collaborative environment using priority-aware greedy strategy"}]}
