{"paperId": "1c99cc6568c2038a539f3672b3f951dc16c47c5b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "AnyHome: Open-Vocabulary Generation of Structured and Textured 3D Homes", "abstract": "Inspired by cognitive theories, we introduce AnyHome, a framework that translates any text into well-structured and textured indoor scenes at a house-scale. By prompting Large Language Models (LLMs) with designed templates, our approach converts provided textual narratives into amodal structured representations. These representations guarantee consistent and realistic spatial layouts by directing the synthesis of a geometry mesh within defined constraints. A Score Distillation Sampling process is then employed to refine the geometry, followed by an egocentric inpainting process that adds lifelike textures to it. AnyHome stands out with its editability, customizability, diversity, and realism. The structured representations for scenes allow for extensive editing at varying levels of granularity. Capable of interpreting texts ranging from simple labels to detailed narratives, AnyHome generates detailed geometries and textures that outperform existing methods in both quantitative and qualitative measures.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-11", "journal": {"name": "ArXiv", "volume": "abs/2312.06644"}, "authors": [{"authorId": "2273595418", "name": "Zehao Wen"}, {"authorId": "2274054359", "name": "Zichen Liu"}, {"authorId": "39612999", "name": "Srinath Sridhar"}, {"authorId": "47328629", "name": "Rao Fu"}], "citations": [{"paperId": "54088622a4d5dd367a4b1532c7a10af9198348b1", "title": "I-Design: Personalized LLM Interior Designer"}, {"paperId": "95570dbf9ad210682ad551cd79018832e3fd010d", "title": "Frankenstein: Generating Semantic-Compositional 3D Scenes in One Tri-Plane"}]}
