{"paperId": "1ca4adaaf91488fec0488827db0929e1c5441204", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Finding the right cloud configuration for analytics clusters", "abstract": "Finding good cloud configurations for deploying a single distributed system is already a challenging task, and it becomes substantially harder when a data analytics cluster is formed by multiple distributed systems since the search space becomes exponentially larger. In particular, recent proposals for single system deployments rely on benchmarking runs that become prohibitively expensive as we shift to joint optimization of multiple systems, as users have to wait until the end of a long optimization run to start the production run of their job. We propose Vanir, an optimization framework designed to operate in an ecosystem of multiple distributed systems forming an analytics cluster. To deal with this large search space, Vanir takes the approach of quickly finding a good enough configuration and then attempts to further optimize the configuration during production runs. This is achieved by combining a series of techniques in a novel way, namely a metrics-based optimizer for the benchmarking runs, and a Mondrian forest-based performance model and transfer learning during production runs. Our results show that Vanir can find deployments that perform comparably to the ones found by state-of-the-art single-system cloud configuration optimizers while spending 2X fewer benchmarking runs. This leads to an overall search cost that is 1.3--24X lower compared to the state-of-the-art. Additionally, when transfer learning can be used, Vanir can minimize the benchmarking runs even further, and use online optimization to achieve a performance comparable to the deployments found by today's single-system frameworks.", "venue": "ACM Symposium on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-10-12", "journal": {"name": "Proceedings of the 11th ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "144769168", "name": "M. Bilal"}, {"authorId": "1709876", "name": "Marco Canini"}, {"authorId": "144897390", "name": "R. Rodrigues"}], "citations": [{"paperId": "f4eee2705b7cb549adfc628b7dde52542b0c58f7", "title": "Can LLMs Configure Software Tools"}, {"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "8603b743bb101a987421854b78bf2047785ba7d1", "title": "Dynamic Optimization of Provider-Based Scheduling for HPC Workloads"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "e92469612a06a5d9b40e01103d7322fa2c55f64c", "title": "Smartpick: Workload Prediction for Serverless-enabled Scalable Data Analytics Systems"}, {"paperId": "717feb33598258ae72a4394556e8dc198b2893ef", "title": "Mimir: Finding Cost-efficient Storage Configurations in the Public Cloud"}, {"paperId": "b09753fd583687e0cdc9170d550f1c69414a42f2", "title": "Enhancing the Configuration Tuning Pipeline of Large-Scale Distributed Applications Using Large Language Models (Idea Paper)"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "96d3fac085b7f2396e4c99dc5f7db02eb9cb8588", "title": "TurBO: A cost-efficient configuration-based auto-tuning approach for cluster-based big data frameworks"}, {"paperId": "4b575282429d1306a042a83c51741c74a90b99ea", "title": "Serverless Computing: State-of-the-Art, Challenges and Opportunities"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "04f50ab287d9e02c67a03f8a6b364b02bcf68eb5", "title": "Reducing the Tail Latency of Microservices Applications via Optimal Configuration Tuning"}, {"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "3ed35eae89b2a189b37ea45d6e432cfee870e80f", "title": "Ubi-Flex-Cloud: ubiquitous flexible cloud computing: status quo and research imperatives"}, {"paperId": "2f268203e9ec98efbfe773d41d3f07d28653f6f3", "title": "Kuber: Cost-Efficient Microservice Deployment Planner"}, {"paperId": "4a2432210231c8282e1cea084a3cc37bcd14500d", "title": "Leveraging vCPU-utilization rates to select cost-efficient VMs for parallel workloads"}, {"paperId": "9c1b979b8ba820a712e3198f5cede008a89acbbd", "title": "On the Potential of Execution Traces for Batch Processing Workload Optimization in Public Clouds"}, {"paperId": "f4e6008daf8d5be3651d8d10825e9ce672da04b3", "title": "Apollo: Rapidly Picking the Optimal Cloud Configurations for Big Data Analytics Using a Data-Driven Approach"}, {"paperId": "291d89ab3cbd3022c7d701f3087b298bd5eebe8a", "title": "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation"}, {"paperId": "f6362b6f5ffbb90ddc6daf5bfea28badd61c34f8", "title": "Best VM Selection for Big Data Applications across Multiple Frameworks by Transfer Learning"}, {"paperId": "f687d64bc0289fbf8c6ba7106b86904c7af9b521", "title": "With Great Freedom Comes Great Opportunity: Rethinking Resource Allocation for Serverless Functions"}, {"paperId": "04eb2a1b242a678f1e6df046c7ad3e3959af4af6", "title": "Towards Optimal Configuration of Microservices"}, {"paperId": "8cf7e1737ec49026962d3e8cb400381e411c190f", "title": "Accelerating the Configuration Tuning of Big Data Analytics with Similarity-aware Multitask Bayesian Optimization"}, {"paperId": "ad905877ce76b84130b34aac6026c15d1c7ee8d2", "title": "SRIFTY: Swift and Thrifty Distributed Neural Network Training on the Cloud"}, {"paperId": "c0b83aa3852211d089018a00fe58c2371c629284", "title": "A Model for Query Execution Over Heterogeneous Instances"}, {"paperId": "4d1c255fc35427b355c5f964bd5f063821749182", "title": "OPPerTune : Post-Deployment Configuration Tuning of Services Made Easy"}, {"paperId": "21f07f5c7349e3bc31f0224863124a1a21b17929", "title": "Mimir: Finding Cost-efﬁcient Storage Conﬁgurations in the Public Cloud"}, {"paperId": "144f94da5ae9bf40f56acdf9cff370845d63c81d", "title": "Repository ISTITUZIONALE"}]}
