{"paperId": "1cbcf0f00841268b31307a9e714924594e4316d9", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Threats and Corrective Measures for IoT Security with Observance of Cybercrime: A Survey", "abstract": "Internet of Things (IoT) is the utmost assuring framework to facilitate human life with quality and comfort. IoT has contributed significantly to numerous application areas. The stormy expansion of smart devices and their credence for data transfer using wireless mechanics boost their susceptibility to cyberattacks. Consequently, the cybercrime rate is increasing day by day. Hence, the study of IoT security threats and possible corrective measures can benefit researchers in identifying appropriate solutions to deal with various challenges in cybercrime investigation. IoT forensics plays a vital role in cybercrime investigations. This review paper presents an overview of the IoT framework consisting of IoT architecture, protocols, and technologies. Various security issues at each layer and corrective measures are also discussed in detail. This paper also presents the role of IoT forensics in cybercrime investigation in various domains like smart homes, smart cities, automated vehicles, and healthcare. The role of advanced technologies like artificial intelligence, machine learning, cloud computing, edge computing, fog computing, and blockchain technology in cybercrime investigation is also discussed. Lastly, various open research challenges in IoT to assist cybercrime investigation are explained to provide a new direction for further research.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-26", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "5579148:1-5579148:30", "volume": "2021"}, "authors": [{"authorId": "3946864", "name": "Sita Rani"}, {"authorId": "1938526418", "name": "Aman Kataria"}, {"authorId": "144582540", "name": "Vishal Sharma"}, {"authorId": "7359559", "name": "Smarajit Ghosh"}, {"authorId": "48773857", "name": "V. Karar"}, {"authorId": "2802988", "name": "Kyungroul Lee"}, {"authorId": "2091775930", "name": "Chang Choi"}], "citations": [{"paperId": "fee9da6581f1e5d22bad1dc80578dc57b4158ecf", "title": "Research on Digital Forensics Analyzing Heterogeneous Internet of Things Incident Investigations"}, {"paperId": "b722889256de2fb22d7ded004cdb1c9851e103d8", "title": "The survey and meta-analysis of the attacks, transgressions, countermeasures and security aspects common to the Cloud, Edge and IoT"}, {"paperId": "f81c975feea882b1a64a2f4ba27756d3ed1f9b1f", "title": "Advances in IoT Security: Vulnerabilities, Enabled Criminal Services, Attacks, and Countermeasures"}, {"paperId": "e73625ed77ab38730ad85d9259965c38436413d4", "title": "Preserving Users’ Sensitive Data in Physical and Virtual World Using Machine Learning: A Strategy"}, {"paperId": "f1ac75d96c85121f4e0e52ff8c001ac7f3173f8b", "title": "Federated learning for secure IoMT-applications in smart healthcare systems: A comprehensive review"}, {"paperId": "5007cc93c68a384f294f17fc7bef76c77e6c3244", "title": "LNKDSEA: Machine Learning Based IoT/IIoT Attack Detection Method"}, {"paperId": "d8a9b6b508eb04b15a4b867037d52c6b413b2e96", "title": "Improvements of SERENIOT Based on Machine Learning"}, {"paperId": "060efc9b1b771882018e12151f87990fe8f1d91c", "title": "Machine Learning Intrusion Detection as a Solution to Security and Privacy Issues in IoT: A Systematic Review"}, {"paperId": "d55141b95375ca69b8e6c8850423e3dc5b6aa2a0", "title": "Exploring the Application Sphere of the Internet of Things in Industry 4.0: A Review, Bibliometric and Content Analysis"}, {"paperId": "05faccd9ce018dc9012dbae20b0b8b57b9254db0", "title": "State-of-the-art in IoT forensic challenges"}, {"paperId": "45987fa42def24211fa3ed30a2d2aecd39bac9c5", "title": "Energy Efficient Consensus Approach of Blockchain for IoT Networks with Edge Computing"}, {"paperId": "b6303c95755dbfd5407c840929ad2a8e357320a1", "title": "Security and Privacy Challenges in the Deployment of Cyber-Physical Systems in Smart City Applications: State-of-Art Work"}, {"paperId": "737acfb9c0708d59daff082105cdd2d420129394", "title": "Dynamic Pricing-Based E-commerce Model for the Produce of Organic Farming in India: A Research Roadmap with Main Advertence to Vegetables"}, {"paperId": "352e1b9a1a874e3545c143f7a2ca72ceaff13d58", "title": "Sixth Generation (6G) Cognitive Radio Network (CRN) Application, Requirements, Security Issues, and Key Challenges"}, {"paperId": "f6d9a3ef308b82b1c2bff4582bfad2a6e3147261", "title": "IoT Equipped Intelligent Distributed Framework for Smart Healthcare Systems"}, {"paperId": "66dbcdfc04a10a6c3530874efe6a3be6577d02e3", "title": "Utilizing Bio Metric System for Enhancing Cyber Security in Banking Sector: A Systematic Analysis"}, {"paperId": "cf46b4aff74cd03ebade6ecc389f54137927027d", "title": "Security of The Embedded and IoT Systems: Threats, Attacks, and Countermeasures"}, {"paperId": "58658bebccce80c184dd6415ce060535951e128c", "title": "IoT and Deep Learning on Sensor Data"}, {"paperId": "71f9f1fb1ed27a41078109409788e5fa5cc14a94", "title": "Amalgamation of Advanced Technologies for Sustainable Development of Smart City Environment: A Review"}, {"paperId": "cc75d45fde183d794fc6c5adbbb2b07b05b2f3c1", "title": "DEEP NEURAL SYSTEM FOR IDENTIFYING CYBERCRIME ACTIVITIES IN NETWORKS"}]}
