{"paperId": "1cd270bff29951be07635c3f393e3b017f7cfad2", "publicationVenue": {"id": "026f4249-5e18-4b4c-b47a-aa1927ad7498", "name": "Asian Journal of Research in Computer Science", "type": "journal", "alternate_names": ["Asian J Res Comput Sci"], "issn": "2581-8260", "url": "http://www.sciencedomain.org/"}, "title": "A Survey of Data Mining Activities in Distributed Systems", "abstract": "Distributed systems, which may be utilized to do computations, are being developed as a result of the fast growth of sharing resources. Data mining, which has a huge range of real applications, provides significant techniques for extracting meaningful and usable information from massive amounts of data. Traditional data mining methods, on the other hand, suppose that the data is gathered centrally, stored in memory, and is static. Managing massive amounts of data and processing them with limited resources is difficult. Large volumes of data, for instance, are swiftly generated and stored in many locations. This becomes increasingly costly to centralize them at a single location. Furthermore, traditional data mining methods typically have several issues and limitations, such as memory restrictions, limited processing ability, and insufficient hard drive space, among others. To overcome the following issues, distributed data mining's have emerged as a beneficial option in several applications According to several authors, this research provides a study of state-of-the-art distributed data mining methods, such as distributed common item-set mining, distributed frequent sequence mining, technical difficulties with distributed systems, distributed clustering, as well as privacy-protection distributed data mining. Furthermore, each work is evaluated and compared to the others.", "venue": "Asian Journal of Research in Computer Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-09-07", "journal": {"name": "Asian Journal of Research in Computer Science"}, "authors": [{"authorId": "2133470984", "name": "Waleed A. Mohammad"}, {"authorId": "1557273639", "name": "H. M. Yasin"}, {"authorId": "37135603", "name": "A. Salih"}, {"authorId": "1419470527", "name": "Adel Al-zebari"}, {"authorId": "2120500813", "name": "Naaman M Omar"}, {"authorId": "2121820693", "name": "Karwan Jameel Merceedi"}, {"authorId": "2142852845", "name": "A. Ahmed"}, {"authorId": "2114281195", "name": "Nareen O. M. Salim"}, {"authorId": "2150377273", "name": "Sheren Sadiq Hasan"}, {"authorId": "66319662", "name": "S. F. Kak"}, {"authorId": "92799939", "name": "I. Ibrahim"}], "citations": []}
