{"paperId": "1ce081e82da3cd9485ce88df7e1446c2bfdb043a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Enabling Spatial Digital Twins: Technologies, Challenges, and Future Research Directions", "abstract": "A Digital Twin (DT) is a virtual replica of a physical object or system, created to monitor, analyze, and optimize its behavior and characteristics. A Spatial Digital Twin (SDT) is a specific type of digital twin that emphasizes the geospatial aspects of the physical entity, incorporating precise location and dimensional attributes for a comprehensive understanding within its spatial environment. The current body of research on SDTs primarily concentrates on analyzing their potential impact and opportunities within various application domains. As building an SDT is a complex process and requires a variety of spatial computing technologies, it is not straightforward for practitioners and researchers of this multi-disciplinary domain to grasp the underlying details of enabling technologies of the SDT. In this paper, we are the first to systematically analyze different spatial technologies relevant to building an SDT in layered approach (starting from data acquisition to visualization). More specifically, we present the key components of SDTs into four layers of technologies: (i) data acquisition; (ii) spatial database management \\&big data analytics systems; (iii) GIS middleware software, maps \\&APIs; and (iv) key functional components such as visualizing, querying, mining, simulation and prediction. Moreover, we discuss how modern technologies such as AI/ML, blockchains, and cloud computing can be effectively utilized in enabling and enhancing SDTs. Finally, we identify a number of research challenges and opportunities in SDTs. This work serves as an important resource for SDT researchers and practitioners as it explicitly distinguishes SDTs from traditional DTs, identifies unique applications, outlines the essential technological components of SDTs, and presents a vision for their future development along with the challenges that lie ahead.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-11", "journal": {"name": "ArXiv", "volume": "abs/2306.06600"}, "authors": [{"authorId": "2532195", "name": "Mohammed Eunus Ali"}, {"authorId": "3110314", "name": "M. A. Cheema"}, {"authorId": "2708986", "name": "T. Hashem"}, {"authorId": "35035828", "name": "A. Ulhaq"}, {"authorId": "145348760", "name": "M. Babar"}], "citations": [{"paperId": "d4d4b6525e8525d91ffb047f8ba9e80c08297a26", "title": "Spatial Computing: Concept, Applications, Challenges and Future Directions"}, {"paperId": "3bbcf9d7a6d6b2bf17247fbb500696673d924e76", "title": "Proposal for the Implementation of Spatial Common Ground and Spatial AI using the SSCP (Spatial Simulation-based Cyber-Physical) Model"}, {"paperId": "970225667d657b4d0da37d25bd943e0416b4f7c6", "title": "Graph Theory Applications in Advanced Geospatial Research"}]}
