{"paperId": "1ce566885dfab65e4943c0a574e320144f913cbf", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "VRE: A Versatile, Robust, and Economical Trajectory Data System", "abstract": "\n Managing massive trajectory data from various moving objects has always been a demanding task. A desired trajectory data system should be versatile in its supported query types and distance functions, of low storage cost, and be consistently efficient on processing trajectory data of different properties. Unfortunately, none of the existing systems can meet the above three criteria at the same time. To this end, we propose VRE, a\n v\n ersatile,\n r\n obust, and\n e\n conomical trajectory data system.VRE separates the storage from the processing. In the storage layer, we propose a novel segment-based storage model that takes advantage of the strengths of both point-based and trajectory-based storage models. VRE supports these three storage models and ten storage schemas upon them. With the secondary index, VRE reduces the storage cost up to 3x. In the processing layer, we first propose a two-stage processing framework and a pushdown strategy to alleviate full trajectory transmission cost. Then, we design a unified pruning strategy for five widely used trajectory distance functions and numerous tailored processing algorithms for five advanced queries. Extensive experiments are conducted to verify the design choice and efficiency of VRE, from which we present some key insights that are crucial to both VRE and future trajectory system's design.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "3398-3410", "volume": "15"}, "authors": [{"authorId": "2057697227", "name": "Hai Lan"}, {"authorId": "2129278563", "name": "Jiong Xie"}, {"authorId": "39505779", "name": "Z. Bao"}, {"authorId": "2146324505", "name": "Feifei Li"}, {"authorId": "2113788477", "name": "Wei Tian"}, {"authorId": "2184070988", "name": "Fang Wang"}, {"authorId": "2151485580", "name": "Sheng Wang"}, {"authorId": "2184074807", "name": "Ailin Zhang"}], "citations": [{"paperId": "943f6e65a5e959d4ce09c4f24903c8af746d67b8", "title": "A Data-driven Region Generation Framework for Spatiotemporal Transportation Service Management"}, {"paperId": "74421d1cf1985a46cfcbbe2698d90b3937e9314b", "title": "Effective and Efficient Route Planning Using Historical Trajectories on Road Networks"}, {"paperId": "ca85791c7ce893dbfadc12df9c676ff81fbf9807", "title": "ST4ML: Machine Learning Oriented Spatio-Temporal Data Processing at Scale"}, {"paperId": "ea5ce05d7a57ca144853669afbcd8191bf3080b3", "title": "Construct Trip Graphs by Using Taxi Trajectory Data"}]}
