{"paperId": "1cf241ab230b94a0f510b07086cfdb3aa8b2ba4b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Study of Fairness Concerns in AI-based Mobile App Reviews", "abstract": "Fairness is one of the socio-technical concerns that must be addressed in AI-based systems. Unfair AI-based systems, particularly unfair AI-based mobile apps, can pose difficulties for a significant proportion of the global population. This paper aims to analyze fairness concerns in AI-based app reviews.We first manually constructed a ground-truth dataset, including a statistical sample of fairness and non-fairness reviews. Leveraging the ground-truth dataset, we developed and evaluated a set of machine learning and deep learning classifiers that distinguish fairness reviews from non-fairness reviews. Our experiments show that our best-performing classifier can detect fairness reviews with a precision of 94%. We then applied the best-performing classifier on approximately 9.5M reviews collected from 108 AI-based apps and identified around 92K fairness reviews. Next, applying the K-means clustering technique to the 92K fairness reviews, followed by manual analysis, led to the identification of six distinct types of fairness concerns (e.g., 'receiving different quality of features and services in different platforms and devices' and 'lack of transparency and fairness in dealing with user-generated content'). Finally, the manual analysis of 2,248 app owners' responses to the fairness reviews identified six root causes (e.g., 'copyright issues') that app owners report to justify fairness concerns.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-16", "journal": {"name": "ArXiv", "volume": "abs/2401.08097"}, "authors": [{"authorId": "97623802", "name": "A. R. Nasab"}, {"authorId": "2279754773", "name": "Maedeh Dashti"}, {"authorId": "32723366", "name": "Mojtaba Shahin"}, {"authorId": "2337624", "name": "Mansooreh Zahedi"}, {"authorId": "8772629", "name": "Hourieh Khalajzadeh"}, {"authorId": "2261284357", "name": "Chetan Arora"}, {"authorId": "2279723974", "name": "Peng Liang"}], "citations": []}
