{"paperId": "1d034e37460b1fa8ff4e901d794f514892bbb56f", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 14th USENIX Symposium on Operating Systems Design and Implementation", "abstract": "We describe the design and implementation of Protean – the Microsoft Azure service responsible for allocating Virtual Machines (VMs) to millions of servers around the globe. A single instance of Protean serves an entire availability zone (10-100k machines), facilitating seamless failover and scale-out to customers. The design has proven robust, enabling a substantial expansion of VM offerings and features with minimal changes to the core infrastructure. In particular, Protean preserves a clear separation between policy and mechanisms . From a policy perspective, a ﬂexible rule-based Allocation Agent (AA) allows Protean to efﬁciently address multiple constraints and performance criteria, and adapt to different conditions. On the system side, a multi-layer caching mechanism expedites the allocation process, achieving turnaround times of few milliseconds. A slight compromise on allocation quality enables multiple AAs to run concurrently on the same inventory, resulting in increased throughput with negligible conﬂict rate. Our results from both simulations and production demonstrate that Protean achieves high throughput and utilization (85-90% on a key utilization metric), while satisfying user-speciﬁc requirements. We also demonstrate how Protean is adapted to handle capacity crunch conditions, by zooming in on spikes caused by COVID-19.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2004361985", "name": "Ori Hadary"}, {"authorId": "2286522892", "name": "Luke Marshall"}, {"authorId": "1684547", "name": "Ishai Menache"}, {"authorId": "2286477049", "name": "Abhisek Pan"}, {"authorId": "2004359570", "name": "Esaias E. Greeff"}, {"authorId": "2075263254", "name": "David Dion"}, {"authorId": "2004360271", "name": "Star Dorminey"}, {"authorId": "2287311775", "name": "Shailesh Joshi"}, {"authorId": "2286906140", "name": "Yang Chen"}, {"authorId": "3196342", "name": "M. Russinovich"}, {"authorId": "2286568136", "name": "Thomas Moscibroda"}, {"authorId": "2167789030", "name": "Microsoft Azure"}, {"authorId": "68973648", "name": "Microsoft Research"}], "citations": []}
