{"paperId": "1d084557a96ea7fd40ad1ee19ab1ac7680003622", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "An Enhanced Evaporation Rate Water-Cycle Algorithm for Global Optimization", "abstract": "Water-cycle algorithm based on evaporation rate (ErWCA) is a powerful enhanced version of the water-cycle algorithm (WCA) metaheuristics algorithm. ErWCA, like other algorithms, may still fall in the sub-optimal region and have a slow convergence, especially in high-dimensional tasks problems. This paper suggests an enhanced ErWCA (EErWCA) version, which embeds local escaping operator (LEO) as an internal operator in the updating process. ErWCA also uses a control-randomization operator. To verify this version, a comparison between EErWCA and other algorithms, namely, classical ErWCA, water cycle algorithm (WCA), butterfly optimization algorithm (BOA), bird swarm algorithm (BSA), crow search algorithm (CSA), grasshopper optimization algorithm (GOA), Harris Hawks Optimization (HHO), whale optimization algorithm (WOA), dandelion optimizer (DO) and fire hawks optimization (FHO) using IEEE CEC 2017, was performed. The experimental and analytical results show the adequate performance of the proposed algorithm.", "venue": "Processes", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-02", "journal": {"name": "Processes"}, "authors": [{"authorId": "32168818", "name": "A. Hussien"}, {"authorId": "28001414", "name": "Fatma A. Hashim"}, {"authorId": "1699624735", "name": "R. Qaddoura"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "116686160", "name": "A. Pop"}], "citations": [{"paperId": "304022e651b2c2dc454db9dfa2cbcba25f3eae11", "title": "An enhanced exponential distribution optimizer and its application for multi-level medical image thresholding problems"}, {"paperId": "ff91ef3b2f1d32fe212f87d2e820a084556523a8", "title": "A CNN-based model to count the leaves of rosette plants (LC-Net)"}, {"paperId": "559a37e9eff6828f3b3758fb3495c4f9d4880576", "title": "A new approach for solving global optimization and engineering problems based on modified sea horse optimizer"}, {"paperId": "93585ba546e7bda26bab4dce9d3cbb351c36086f", "title": "An enhanced dynamic differential annealed algorithm for global optimization and feature selection"}, {"paperId": "3f3e0689f821a12a97b9ceabd40f40bba8dc9304", "title": "A quasi-oppositional learning of updating quantum state and Q-learning based on the dung beetle algorithm for global optimization"}, {"paperId": "baa9f8e8390d48128eda19e992db0dc03cea4e1c", "title": "Adapting the pre-trained convolutional neural networks to improve the anomaly detection and classification in mammographic images"}, {"paperId": "58acd943b17505dad8249e103fb7b2012c183005", "title": "Techno-economic feasibility analysis of grid configuration sizing for hybrid renewable energy system in Turkey using different optimization techniques"}, {"paperId": "ec58f3a9b2901e681432ae150bc3b32f340162be", "title": "Novel hybrid of AOA-BSA with double adaptive and random spare for global optimization and engineering problems"}, {"paperId": "acc64c09794cfa2df89fe37ceffdff49fb14b578", "title": "Improved Harris Hawks optimization for global optimization and engineering design"}, {"paperId": "220cfbf252d92d6ab8727bce1723fed21cfee71a", "title": "Artificial Ecosystem-Based Optimization with Dwarf Mongoose Optimization for Feature Selection and Global Optimization Problems"}, {"paperId": "ba9a7b695afafba8609679debb61fbcf33c93049", "title": "Novel memetic of beluga whale optimization with self-adaptive exploration–exploitation balance for global optimization and engineering problems"}, {"paperId": "476ef22e609bbf67eb3da28d1219d237850188f5", "title": "An enhanced hunter‐prey optimization for optimal power flow with FACTS devices and wind power integration"}, {"paperId": "96ab5a5a35da8fd513610817c506ece5f771c6cd", "title": "A novel Q-learning-based hybrid algorithm for the optimal offloading and scheduling in mobile edge computing environments"}, {"paperId": "34e53a6bfcb9015125c8eb6a989b40bebb763f7d", "title": "A multi-strategy enhanced African vultures optimization algorithm for global optimization problems"}, {"paperId": "50f0492f421595ddec924ab3c600c0682a0f0f0c", "title": "An efficient coverage method for SEMWSNs based on adaptive chaotic Gaussian variant snake optimization algorithm."}, {"paperId": "74625916ba1c1fe6706955c92732c4208f91048a", "title": "Fick's Law Algorithm: A physical law-based algorithm for numerical optimization"}, {"paperId": "4573dd063d25b1d823e8d300a8ed1eb6c616e7a0", "title": "Intelligent Financial Forecasting With an Improved Chemical Reaction Optimization Algorithm Based Dendritic Neuron Model"}]}
