{"paperId": "1d0bcfd230730835911adebae87b0a0153936889", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Feature Selection Methods for Uplift Modeling", "abstract": "Uplift modeling is a predictive modeling technique that estimates the user-level incremental effect of a treatment using machine learning models. It is often used for targeting promotions and advertisements, as well as for the personalization of product offerings. In these applications, there are often hundreds of features available to build such models. Keeping all the features in a model can be costly and inefficient. Feature selection is an essential step in the modeling process for multiple reasons: improving the estimation accuracy by eliminating irrelevant features, accelerating model training and prediction speed, reducing the monitoring and maintenance workload for feature data pipeline, and providing better model interpretation and diagnostics capability. However, feature selection methods for uplift modeling have been rarely discussed in the literature. Although there are various feature selection methods for standard machine learning models, we will demonstrate that those methods are sub-optimal for solving the feature selection problem for uplift modeling. To address this problem, we introduce a set of feature selection methods designed specifically for uplift modeling, including both filter methods and embedded methods. To evaluate the effectiveness of the proposed feature selection methods, we use different uplift models and measure the accuracy of each model with a different number of selected features. We use both synthetic and real data to conduct these experiments. We also implemented the proposed filter methods in an open source Python package (CausalML).", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-05", "journal": {"name": "ArXiv", "volume": "abs/2005.03447"}, "authors": [{"authorId": "2152619879", "name": "Zhenyu Zhao"}, {"authorId": "2108243673", "name": "Yumin Zhang"}, {"authorId": "30426642", "name": "Totte Harinen"}, {"authorId": "1507516256", "name": "Mike Yung"}], "citations": [{"paperId": "2f8fea869d2d2e7a1b6f683863eb90b659025e8f", "title": "DESCN: Deep Entire Space Cross Networks for Individual Treatment Effect Estimation"}, {"paperId": "7768cf7ac6e5bb59b1a657bca1144562f91dcd1e", "title": "A Causal Approach for Business Optimization: Application on an Online Marketplace"}, {"paperId": "f5b3d68a227bbf310f85f9ac380afd7eb0be43da", "title": "Customer feature selection from high-dimensional bank direct marketing data for uplift modeling"}, {"paperId": "490101f5fc128ed2391933538af5e6ba6cd30867", "title": "Emulate randomized clinical trials using heterogeneous treatment effect estimation for personalized treatments: Methodology review and benchmark"}, {"paperId": "b92807098b9f94c3c70af23d523046432750e8d2", "title": "A Non-parametric Bayesian Approach for Uplift Discretization and Feature Selection"}, {"paperId": "5549c331dc4bc0a61db3272d774fa9cc0a7a78f7", "title": "Heterogeneous Treatment Effect Estimation for Biomedical Informatics: Tutorial and Benchmark"}]}
