{"paperId": "1d0ec59c7b6471475fb48b66045e37c78809590b", "publicationVenue": {"id": "36ac1bc3-3d44-4cbb-a25c-2bae2454703b", "name": "Journal of Modelling in Management", "type": "journal", "alternate_names": ["J Model Manag"], "issn": "1746-5664", "url": "https://www.emeraldinsight.com/loi/jm2"}, "title": "A Data-driven project categorization process for portfolio selection", "abstract": "\nPurpose\nCategorizing projects allows for better alignment of a portfolio with the organizational strategy and goals. An appropriate project categorization helps understand portfolio’s structure and enables proper project portfolio selection (PPS). In practice, project categorization is, however, conducted in intuitive approaches. Furthermore, little attention has been given to project categorization methods in the project management literature. The purpose of this paper is to provide researchers and practitioners with a data-driven project categorization process designed for PPS.\n\n\nDesign/methodology/approach\nThe suggested process was modeled considering the main characteristics of project categorization systems revealed from the literature. The clustering analysis is used as the core-computing technology, allowing for an empirically based categorization. This study also presents a real-world case study in the automotive industry to illustrate the proposed approach.\n\n\nFindings\nThis study confirmed the potential of clustering analysis for a consistent project categorization. The most important attributes that influenced the project grouping have been identified including strategic and intrinsic features. The proposed approach helps increase the visibility of the portfolio’s structure and the comparability of its components.\n\n\nOriginality/value\nThere is a lack of research regarding project categorization methods, particularly for the purpose of PPS. A novel data-driven process is proposed to help mitigate the issues raised by prior researchers including the inconsistencies, ambiguities and multiple interpretations related to the taken-for-granted categories. The suggested approach is also expected to facilitate projects evaluation and prioritization within appropriate categories and contribute in PPS effectiveness.\n", "venue": "Journal of Modelling in Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-01", "journal": {"name": "Journal of Modelling in Management"}, "authors": [{"authorId": "2172078468", "name": "Ghizlane El bok"}, {"authorId": "2426010", "name": "A. Berrado"}], "citations": [{"paperId": "4291998dfa27e5739aac0d49a1b08dc14e2c4070", "title": "A new fuzzy simulation approach for project evaluation based on concepts of risk, strategy, and group decision making with interval-valued intuitionistic fuzzy sets"}, {"paperId": "502bab9b6d4201b122fb253f8d3526e22ba34cb5", "title": "Initial preference algorithm of industrial project portfolio"}]}
