{"paperId": "1d17cee4991bd248b6fa6c11ba9c3632c73e9b47", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Identifying Incident Causal Factors to Improve Aviation Transportation Safety: Proposing a Deep Learning Approach", "abstract": "Aviation is a complicated transportation system, and safety is of paramount importance because aircraft failure often involves casualties. Prevention is clearly the best strategy for aviation transportation safety. Learning from past incident data to prevent potential accidents from happening has proved to be a successful approach. To prevent potential safety hazards and make effective prevention plans, aviation safety experts identify primary and contributing factors from incident reports. However, safety experts’ review processes have become prohibitively expensive nowadays. The number of incident reports is increasing rapidly due to the acceleration of advances in information technologies and the growth of the commercial and private aviation transportation industries. Consequently, advanced text mining algorithms should be applied to help aviation safety experts facilitate the process of incident data extraction. This paper focuses on constructing deep-learning-based models to identify causal factors from incident reports. First, we prepare the data sets used for training, validation, and testing with approximately 200,000 qualified incident reports from the Aviation Safety Reporting System (ASRS). Then, we take an open-source natural language model, which is well trained with a large corpus of Wikipedia texts, as the baseline and fine-tune it with the texts in incident reports to make it more suited to our specific research task. Finally, we build and train an attention-based long short-term memory (LSTM) model to identify primary and contributing factors in each incident report. The solution we propose has multilabel capability and is automated and customizable, and it is more accurate and adaptable than traditional machine learning methods in extant research. This novel application of deep learning algorithms to the incident reporting system can efficiently improve aviation safety.", "venue": "Journal of Advanced Transportation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-06-13", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "2130374581", "name": "Tianxi Dong"}, {"authorId": "2112539882", "name": "Qiwei Yang"}, {"authorId": "51182462", "name": "Nima Ebadi"}, {"authorId": "2115607317", "name": "Xinyi Luo"}, {"authorId": "144095563", "name": "P. Rad"}], "citations": [{"paperId": "000bd816a2fc8d8d14d3f2508fb060ce840ee16d", "title": "Hierarchical Multi-label Classification for Fine-level Event Extraction from Aviation Accident Reports"}, {"paperId": "8bffc8eba29cc36239b8bbe4529225064d5ca5ee", "title": "Fuzzy electre model for the characterisation of aeronautical operational risks in the approach and landing phase"}, {"paperId": "fd2d6363a5d34ebbd5b02c3c45a24de0f64ea68d", "title": "Generic Deep-Learning-Based Time Series Models for Aviation Accident Analysis and Forecasting"}, {"paperId": "2ce8bd7295aad4e15296ee098ef0d296c9833c38", "title": "Natural Language Processing (NLP) in Aviation Safety: Systematic Review of Research and Outlook into the Future"}, {"paperId": "9627ec89b4e2006e67177d5375657d781e1d71a4", "title": "SafeAeroBERT: Towards a Safety-Informed Aerospace-Specific Language Model"}, {"paperId": "f402971f33a07333bb81394aa3d0c0e93ca2b960", "title": "A Scoping Literature Review of Natural Language Processing Application to Safety Occurrence Reports"}, {"paperId": "64b1e736957c41ff0c572ebfa6bd2e95584ce184", "title": "Civil aviation safety risk intelligent early warning model based on text mining and multi-model fusion"}, {"paperId": "d1bcf5960f6735d9a13bb1f369af9339eb1d4fe7", "title": "Identification of flight accidents causative factors base on SHELLO and improved entropy gray correlation method"}, {"paperId": "b7f6a0bc7f04d706ddd50455c964c6c4858d0b93", "title": "The effect of COVID-19 on self-reported safety incidents in aviation: An examination of the heterogeneous effects using causal machine learning"}, {"paperId": "c514afae6b6d30d5f706e6b0bd60a3790e9e177b", "title": "A Narrative Literature Review of Natural Language Processing Applied to the Occupational Exposome"}, {"paperId": "506a508514c5c9ba894fdff753eba5371f31451e", "title": "Event Extraction for aviation accident reports through attention-based multi-label classification"}, {"paperId": "8520e0442c5ad424170dd772d875d6ec29f7dfc9", "title": "An Analysis of Fixed-Wing Stall-Type Accidents in the United States"}, {"paperId": "4e73781697ac26fa60119fe554bc48f5ef7c0088", "title": "Deep Learning for the Industrial Internet of Things (IIoT): A Comprehensive Survey of Techniques, Implementation Frameworks, Potential Applications, and Future Directions"}, {"paperId": "5ad3b2cdb8342f58e16f1e2c7e2bd18213a77d9e", "title": "Exploration of Natural Language Processing (NLP) Applications in Aviation"}]}
