{"paperId": "1d1d77784cbb07a1550cd02d548077dcf967387e", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Convolutional Neural Networks-Based Object Detection Algorithm by Jointing Semantic Segmentation for Images", "abstract": "In recent years, increasing image data comes from various sensors, and object detection plays a vital role in image understanding. For object detection in complex scenes, more detailed information in the image should be obtained to improve the accuracy of detection task. In this paper, we propose an object detection algorithm by jointing semantic segmentation (SSOD) for images. First, we construct a feature extraction network that integrates the hourglass structure network with the attention mechanism layer to extract and fuse multi-scale features to generate high-level features with rich semantic information. Second, the semantic segmentation task is used as an auxiliary task to allow the algorithm to perform multi-task learning. Finally, multi-scale features are used to predict the location and category of the object. The experimental results show that our algorithm substantially enhances object detection performance and consistently outperforms other three comparison algorithms, and the detection speed can reach real-time, which can be used for real-time detection.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "39037891", "name": "Baohua Qiang"}, {"authorId": "2118229541", "name": "Ruidong Chen"}, {"authorId": "47482909", "name": "Mingliang Zhou"}, {"authorId": "2057014291", "name": "Yuanchao Pang"}, {"authorId": "2072522905", "name": "Yijie Zhai"}, {"authorId": "2740129", "name": "Minghao Yang"}], "citations": [{"paperId": "7e631bbcc70e2af840662dc84fd482892857fb9c", "title": "Dynamic convolution layer based optimization techniques for object classification and semantic segmentation"}, {"paperId": "f0275e7b7893fd7626b7512826126acdfa7ebd65", "title": "Research on Intelligent Semantic Checking Algorithm of Article Editing Based on Artificial Intelligence"}, {"paperId": "3fb3ea8fbc211752cedc0106f4b6940327b3c7e0", "title": "Redefining Radiology: A Review of Artificial Intelligence Integration in Medical Imaging"}, {"paperId": "bd9a3ad47a005700a2deb2d2fadd4a67944966b7", "title": "Analysis Manipulation Copy-Move on Image Digital using SIFT Method and Histogram Color RGB"}, {"paperId": "0dc38168123a9101588b6b2f9747c0d5a61e5717", "title": "Vehicle Detection System using YOLOv4"}, {"paperId": "eee0ef8d40987912dddc2b50cababcad6819cc15", "title": "A Lightweight Semantic Segmentation Algorithm Based on Deep Convolutional Neural Networks"}, {"paperId": "68f414faad7bc0b83d25ae12e3f293fa042ee2bc", "title": "Autonomous detection of concrete damage under fire conditions"}, {"paperId": "b76389dad504f14531c2c0f3ba566d322a19cdeb", "title": "Abnormality classification and localization using dual-branch whole-region-based CNN model with histopathological images"}, {"paperId": "50cffc5d33b379938035bdd99339995e3018f9c0", "title": "A Practice for Object Detection Using YOLO Algorithm"}]}
