{"paperId": "1d1f9f6b919fe63ca8cefdd502b2f0853c6b1f5a", "publicationVenue": null, "title": "A Framework for DSL-Based Query Classification Using Relational and Graph-Based Data Models", "abstract": "In this paper, we demonstrate a framework for DSL-based SQL query classification according to data-privacy directives. Based on query-log analysis, this framework automatically derives query meta-information (QMI) and provides interfaces for browsing and filtering queries based on this QMI. Domain-specific policy rules enable automatic classification of queries concerning their access to personal data. The generic policy-rule definition based on the QMI covers many syntactical SQL variations. To optimize classification performance, our framework stores the QMI both in relational and graph-based databases (DBs). This case study compares the behavior of a relational DB with that of a graph-based DB with respect to a particular task, namely searching for the policy rules applicable to a given query. It turned out that both solutions have their benefits, so a hybrid solution has been chosen in the end.", "venue": "GRADES-NDA@SIGMOD", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-06-14", "journal": {"name": "Proceedings of the 3rd Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA)"}, "authors": [{"authorId": "2697151", "name": "Peter K. Schwab"}, {"authorId": "1415884203", "name": "Maximilian S. Langohr"}, {"authorId": "1399432410", "name": "K. Meyer-Wegener"}], "citations": [{"paperId": "10e4574708f6c9583bfd29a5a8f4a501921abf5b", "title": "Performance Evaluation of Policy-Based SQL Query Classification for Data-Privacy Compliance"}, {"paperId": "361876b764524897c39289b983dbae8fd7676bf5", "title": "We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomist"}, {"paperId": "fd2f8524347680e1b0e5c5585f412e449908f472", "title": "Towards Evolutionary, Domain-Specific Query Classification Based on Policy Rules"}]}
