{"paperId": "1d3876a18588f62c815619a2dcb322a76526fd0d", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Expressway: Prioritizing Edges for Distributed Evaluation of Graph Queries", "abstract": "Distributed Graph analytics is being widely used in various domains for analyzing large real-world graphs. There have been numerous efforts to build distributed frameworks for graph analytics aimed at improving scalability. These frameworks enable the processing of huge graphs that do not fit in the memory of a single machine by imposing message-passing overhead among a cluster of multiple machines, underutilizing the available computing resources. To mitigate this, we present Expressway, a technique to identify important edges, i.e., Highways, that play a key role in delivering the results for their boundary vertices. Expressway first runs the queries using only Highways, reducing the number of edges that needed to be processed during the execution of a graph query significantly. Thus, it can be accomplished in each machine separately in the cluster, avoiding the message-passing overheads. Then Expressway takes the results from running the query on Highways and initializes the vertices to these values, enabling faster convergence of graph algorithms. Our experiments show applying Expressway on the state-of-the-art frameworks results in up to $4.08\\times$ speedup over the single-query framework and up to $4.04\\times$ speedup over the framework to run a batch of concurrent graph queries.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "4362-4371"}, "authors": [{"authorId": "3213790", "name": "Abbas Mazloumi"}, {"authorId": "2127126628", "name": "Mahbod Afarin"}, {"authorId": "1754303635", "name": "Rajiv Gupta"}], "citations": []}
