{"paperId": "1d4dedb97b7e189b141c27e485f1526f8962c3ba", "publicationVenue": {"id": "abc0c598-b988-4841-a8c5-65bfa6f3df77", "name": "Biomedicines", "type": "journal", "issn": "2227-9059", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-327040", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-327040", "https://www.mdpi.com/journal/biomedicines"]}, "title": "Is There a Best First Line Biological/Small Molecule in IBD: Are We Ready for Sequencing?", "abstract": "Inflammatory bowel disease (IBD) is a chronic, life-long inflammatory condition of the gastrointestinal tract. Treatment strategy depends on the severity of the disease course. IBD physicians need to be aware of the life-long treatment options available. The goal is not only to achieve clinical remission but to halt or stabilize the chronic inflammation in the intestines to prevent further structural damage. Therefore, the use of early biologic therapy is recommended in moderate-to-severe IBD patients. However, in the last decade, use of therapeutic drug monitoring has increased considerably, opening an opportunity for sequencing. This review summarizes the available evidence on biologic and small molecules therapy in Crohn’s disease (CD) and ulcerative colitis (UC) in different clinical scenarios, including perianal CD, the elderly, extra intestinal manifestations, and pregnancy.", "venue": "Biomedicines", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-03-23", "journal": {"name": "Biomedicines", "volume": "10"}, "authors": [{"authorId": "1420156457", "name": "G. Hahn"}, {"authorId": "8212651", "name": "P. Golovics"}, {"authorId": "82126898", "name": "P. Wetwittayakhlang"}, {"authorId": "5596796", "name": "A. Al Khoury"}, {"authorId": "6612892", "name": "T. Bessissow"}, {"authorId": "2133268090", "name": "P. Lakatos"}], "citations": [{"paperId": "4c98c88d2a2f27fa58d00aa64e7d1c63285e30fa", "title": "Effectiveness and safety of vedolizumab and infliximab in biologic-naive patients with Crohn’s disease: results from the EVOLVE study"}, {"paperId": "f9c97644c8e45ec4760e7bed67e6e3da889f66a8", "title": "Editorial: Novel Therapeutic Approaches in Inflammatory Bowel Diseases"}, {"paperId": "60c984e150337e97febf5c2d669cfa0cccc7ca79", "title": "Cell membrane nanomaterials composed of phospholipids and glycoproteins for drug delivery in inflammatory bowel disease: A review."}, {"paperId": "3df3db5876c3efbc850557d00ad92dccac336d78", "title": "Prioritization in inflammatory bowel disease therapy"}, {"paperId": "2268f05eceb23c83f3cf8ee5b8851833097bcdd9", "title": "Real-world experience with subcutaneous infliximab: broadening treatment strategies for inflammatory bowel disease"}, {"paperId": "159aee75d60c24fd6e95fde8cf6a9d1fbb7659bb", "title": "Obefazimod: A First-in-class Drug for the Treatment of Ulcerative Colitis."}]}
