{"paperId": "1d4f8f69f90f5479d1dff65fa10650b449fae3e2", "publicationVenue": {"id": "11e94c04-6b12-41c9-963d-1a08cdbc306d", "name": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "type": "conference", "alternate_names": ["PPoPP", "ACM SIGPLAN Symp Princ Pract Parallel Program", "ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming", "ACM SIGPLAN Symp Princ  Pract Parallel Program"], "url": "http://www.acm.org/sigplan/ppopp.htm"}, "title": "End-to-End LU Factorization of Large Matrices on GPUs", "abstract": "LU factorization for sparse matrices is an important computing step for many engineering and scientific problems such as circuit simulation. There have been many efforts toward parallelizing and scaling this algorithm, which include the recent efforts targeting the GPUs. However, it is still challenging to deploy a complete sparse LU factorization workflow on a GPU due to high memory requirements and data dependencies. In this paper, we propose the first complete GPU solution for sparse LU factorization. To achieve this goal, we propose an out-of-core implementation of the symbolic execution phase, thus removing the bottleneck due to large intermediate data structures. Next, we propose a dynamic parallelism implementation of Kahn's algorithm for topological sort on the GPUs. Finally, for the numeric factorization phase, we increase the parallelism degree by removing the memory limits for large matrices as compared to the existing implementation approaches. Experimental results show that compared with an implementation modified from GLU 3.0, our out-of-core version achieves speedups of 1.13--32.65X. Further, our out-of-core implementation achieves a speedup of 1.2--2.2 over an optimized unified memory implementation on the GPU. Finally, we show that the optimizations we introduce for numeric factorization turn out to be effective.", "venue": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-02-25", "journal": {"name": "Proceedings of the 28th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming"}, "authors": [{"authorId": "2111130863", "name": "Yang Xia"}, {"authorId": "2061280007", "name": "Peng Jiang"}, {"authorId": "145340303", "name": "G. Agrawal"}, {"authorId": "2253261", "name": "R. Ramnath"}], "citations": [{"paperId": "502b79d8d8f01e99284ef007d975379263d2ca76", "title": "PanguLU: A Scalable Regular Two-Dimensional Block-Cyclic Sparse Direct Solver on Distributed Heterogeneous Systems"}]}
