{"paperId": "1d53d767356edce2f3b4a57f999ff899a5e37aaa", "publicationVenue": {"id": "fae302ec-bfb0-4ead-a9f5-035f378b6501", "name": "IEEE computer architecture letters", "type": "journal", "alternate_names": ["IEEE comput archit lett", "IEEE Comput Archit Lett", "IEEE Computer Architecture Letters"], "issn": "1556-6056", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=10208"}, "title": "Exploring PIM Architecture for High-Performance Graph Pattern Mining", "abstract": "Graph mining applications, such as subgraph pattern matching and mining, are widely used in real-world domains such as bioinformatics, social network analysis, and computer vision. Such applications are considered as a new class of data-intensive applications that generate massive irregular computation workloads and memory accesses, which are different from many well-studied graph applications such as BFS and page rank. In this letter, we use the emerging process-in-memory architecture to accelerate data-intensive operations in graph mining tasks. We first identify the code blocks that are best suitable for PIM execution. Then, we observe a significant load imbalance on PIM architecture and analyze the root cause for such imbalance in graph mining applications. Lastly, we evaluate several scheduling schemes that help reduce the load imbalance and discuss potential optimizations to enhance performance further.", "venue": "IEEE computer architecture letters", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "IEEE Computer Architecture Letters", "pages": "114-117", "volume": "20"}, "authors": [{"authorId": "1861728707", "name": "Jiya Su"}, {"authorId": "2151971640", "name": "Linfeng He"}, {"authorId": "2061281673", "name": "Peng Jiang"}, {"authorId": "2873256", "name": "Rujia Wang"}], "citations": [{"paperId": "cb0d72d300e2042050f31877642caed84d54f3f8", "title": "PIMMiner: A High-performance PIM Architecture-aware Graph Mining Framework"}, {"paperId": "27efc6391c56eeb6a05b617241d030c11eeba070", "title": "STMatch: Accelerating Graph Pattern Matching on GPU with Stack-Based Loop Optimizations"}, {"paperId": "6550a0af3586ba50f61c4b5f930924cc9318918b", "title": "Arya: Arbitrary Graph Pattern Mining with Decomposition-based Sampling"}]}
