{"paperId": "1d6d3d0f3ed7a959ed298da1d5d1708f46e9b8f1", "publicationVenue": {"id": "c545d136-74ba-4905-8ed9-b9ec76a5e444", "name": "Sistemi Evoluti per Basi di Dati", "type": "conference", "alternate_names": ["SEBD", "Sist Evol Basi Dati"], "url": "http://www.sebd.org/"}, "title": "Cross-Social Network Investigation to Highlight Privacy Violations in Data Sharing Activities", "abstract": "Social networks represent a vast source of information and have an increasing impact on people’s daily lives. In fact, they permit to exhibit users’ lives, share emotions, passions, and interactions with other users around the world. These data need to be monitored because they could produce privacy violations, especially when they involve sensitive information. In this scenario, the definitions of privacy policies for safeguarding users’ data represent a difficult challenge that social networks have to deal with. In fact, although social network platforms offer privacy settings to protect data, often, users are unable to properly manage them to safeguard their privacy. To this end, in this work, we present a statistical investigation concerning privacy policies offered by social network platforms. In particular, we have defined a tool relying on image-recognition techniques capable of exploring social network platforms and identifying user profiles starting from their pictures. Moreover, we have composed a dataset of 5000 users by retrieving their data available over different social network platforms in order to compare publicly accessible data provided in the registration phases, and those retrieved by our analysis. The proposed work underlines privacy violations over social network platforms when privacy policies are not managed correctly, and is targeted to improve the users’ awareness concerning the spreading and managing of their data. We have highlighted all the statistical evaluations made over the gathered data for putting in evidence the privacy issues.", "venue": "Sistemi Evoluti per Basi di Dati", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "593-600"}, "authors": [{"authorId": "2154400526", "name": "Francesca Cerruto"}, {"authorId": "2053231377", "name": "Stefano Cirillo"}, {"authorId": "51220758", "name": "Domenico Desiato"}, {"authorId": "104439124", "name": "Michele Simone Gambardella"}, {"authorId": "1745736", "name": "G. Polese"}], "citations": []}
