{"paperId": "1d6f3b97591f363253ae2f96d12d37b49f47908f", "publicationVenue": null, "title": "A Critical Review of Cloud Computing Environment for Big Data Analytics", "abstract": "Cloud computing offers a secure, scalable, and widely accessible platform for enormous data distributed management systems. There are a variety of appealing characteristics in cloud computing for its consumer market as many cloud services and deployment strategies supplied by Cloud Service Providers (CSPs) are based on customer demands. Furthermore, cloud computing can store and handle a massive volume of information and do real-time big data analytics, presenting customers with helpful information and patterns. Furthermore, many CSPs, such as AWS, Microsoft Azure, and Google Cloud Platform, offers benefits that help customers be more productive by executing activities according to their demands. This paper provides a critical review of the cloud computing environment provided by contemporary CSPs and learns about the present issues of cloud computing for big data analytics.", "venue": "2022 International Conference on Decision Aid Sciences and Applications (DASA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-03-23", "journal": {"name": "2022 International Conference on Decision Aid Sciences and Applications (DASA)", "pages": "76-81"}, "authors": [{"authorId": "2164141409", "name": "Dzulaisar Dzulhikam"}, {"authorId": "22422404", "name": "Muhammad Ehsan Rana"}], "citations": [{"paperId": "122b85321a278301e6c70ca2761f67df16608001", "title": "Cloud Revolution in Manufacturing: Exploring Benefits, Applications, and Challenges in the Era of Digital Transformation"}, {"paperId": "7a1039fd83d6cfd2ec5032f6226e2f046ee4254b", "title": "Corporate Social Responsibility Initiatives in Private Institutes of Higher Learning: Opportunities, Challenges, and Implications"}, {"paperId": "09da8849fa67f59442bca6bf46c8f1d86b549ffc", "title": "Revolutionizing Telehealthcare: Cloud Computing as the Catalyst for a New Medical Frontier"}, {"paperId": "b7a871c12f775af4618a6bc5507646d6ebe48746", "title": "Revolutionizing Higher Education: A Critical Analysis of Cloud Computing's Impact, Suitability, and Challenges"}, {"paperId": "55a02bb4adbd0dd0e6edafa23d0ecfe8ba4ea489", "title": "Integration of distributed acoustic sensing for real-time seismic monitoring of a geothermal field"}, {"paperId": "386088bfb2bf96aff5fa372eb462e3cd1d79f185", "title": "Cloud Computing and its Emerging Trends on Big Data Analytics"}, {"paperId": "8ae29f0d00b3f25f35bc458a2f2bf1846b0ea411", "title": "Building ML Workflow for Malware Images Classification using Machine Learning Services in Leading Cloud Platforms"}, {"paperId": "10b987938a3dea4bd44d9ed9136d16a678148c3f", "title": "Streaming Big Data with Open-source: A Comparative Study and Architectural Recommendations"}, {"paperId": "c91e4955fc117ffdf5e328eea8567633115163aa", "title": "Cloud Computing as an Enabler in the Mobile Application Domain"}, {"paperId": "aedd805e7ce7ec115d0adf420af9303c210b39d8", "title": "Big-Data Platform for Performance Monitoring of Telecom-Service-Provider Networks"}, {"paperId": "e3e82ccacee35a4ffdf75f3b2d4e7f2e66ecc45b", "title": "Cloud-based virtualization environment for IoT-based WSN: solutions, approaches and challenges"}]}
