{"paperId": "1d77e97b35012ff262d189d84754b04d52021dcf", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Emotional and cognitive changes surrounding online depression identity claims", "abstract": "As social media has proliferated, a key aspect to making meaningful connections with people online has been revealing important parts of one’s identity. In this work, we study changes that occur in people’s language use after they share a specific piece of their identity: a depression diagnosis. To do so, we collect data from over five thousand users who have made such a statement, which we refer to as an identity claim. Prior to making a depression identity claim, the Reddit user’s language displays evidence of increasingly higher rates of anxiety, sadness, and cognitive processing language compared to matched controls. After the identity claim, these language markers decrease and more closely match the controls. Similarly, first person singular pronoun usage decreases following the identity claim, which was previously previously found to be indicative of self-focus and associated with depression. By further considering how and to whom people express their identity, we find that the observed longitudinal changes are larger for those who do so in ways that are more correlated with seeking help (sharing in a post instead of a comment; sharing in a mental health support forum). This work suggests that there may be benefits to sharing one’s depression diagnosis, especially in a semi-anonymous forum where others are likely to be empathetic.", "venue": "PLoS ONE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "PLOS ONE", "volume": "17"}, "authors": [{"authorId": "1395927418", "name": "Laura Biester"}, {"authorId": "1854783", "name": "J. Pennebaker"}, {"authorId": "2105984203", "name": "Rada Mihalcea"}], "citations": [{"paperId": "20041a7c126f68378201eef6780a83e363a3fa67", "title": "Trauma Isn't One Size Fits All: How Online Support Communities Point to Different Diagnostic Criteria for C-PTSD and PTSD."}, {"paperId": "0ecc68fd1070a41ffa2979000766e2a00653a7ba", "title": "Temporal Arcs of Mental Health: Patterns Behind Changes in Depression over Time"}]}
