{"paperId": "1d7f79dbc30cf4dc5179ffbeba0bd7b7ddc1305e", "publicationVenue": {"id": "d49d1529-c7d5-4c86-8c1a-0c052de876a4", "name": "Journal of strategic information systems", "type": "journal", "alternate_names": ["Journal of Strategic Information Systems", "J Strateg Inf Syst", "J strateg inf syst"], "issn": "0963-8687", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/525447/description#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/09638687"]}, "title": "When decision support systems fail: Insights for strategic information systems from Formula 1", "abstract": null, "venue": "Journal of strategic information systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-16", "journal": {"name": "J. Strateg. Inf. Syst.", "pages": "221-236", "volume": "27"}, "authors": [{"authorId": "47244093", "name": "P. Aversa"}, {"authorId": "2239708", "name": "Laure Cabantous"}, {"authorId": "2764976", "name": "Stefan Haefliger"}], "citations": [{"paperId": "4c77e6e513718e470d7d1750e75ab341841b7354", "title": "Experience shapes non-linearities between team behavioral interdependence, team collaboration, and performance in massively multiplayer online games"}, {"paperId": "50d3c13c0a966485ad7eedd1978e5c240755cca6", "title": "The Strategic Innovation System: Flows of Innovation from Digital Platforms to Digital Services"}, {"paperId": "3c4c852b4933f8ecc30378018c3510895f057d86", "title": "i-RAT: A discussion support system to rapidly assess economic and environmental impacts of different sugarcane irrigation practices"}, {"paperId": "d2333bcbb213b094a0500fccad90fff8a95c8305", "title": "Defining human-AI teaming the human-centered way: a scoping review and network analysis"}, {"paperId": "90622e6f50526883de9158eb040e9f48ecf1b778", "title": "An Approach Based on Recurrent Neural Networks and Interactive Visualization to Improve Explainability in AI Systems"}, {"paperId": "64d60bbf93da0be8b04998eae2af368def7f9afb", "title": "An Informed Decision Support Framework from a Strategic Perspective in the Health Sector"}, {"paperId": "9835b9a01c91da0b9dd2d11636a345b9aa3be184", "title": "Traduttore, traditore? Gains and losses from the translation of the economies of worth"}, {"paperId": "ad0bd1ab043e53c53022bb960ed577d3eb3a9ce9", "title": "Minimum-Race-Time Energy Allocation Strategies for the Hybrid-Electric Formula 1 Power Unit"}, {"paperId": "f92a512431ac0242de0bb4fb8453dcd0a0f4f9ac", "title": "Recovering the divide: A review of the big data analytics—strategy relationship"}, {"paperId": "0f1875ddaef7d2f3d568454b313029aaad379ae9", "title": "Holding AI to Account: Challenges for the Delivery of Trustworthy AI in Healthcare"}, {"paperId": "780f0109cea019b66d0d39d24ae89a2804d55f60", "title": "A fine-grained perspective on big data knowledge creation: dimensions, insights, and mechanism from a pilot study"}, {"paperId": "6ef2257511e7aca0627deea5c941cc6eb3551b1c", "title": "Supply Chain Efficiency and Effectiveness Management Using Decision Support Systems"}, {"paperId": "934dbc2514f211e3e390740d0439330816f16527", "title": "Orchestration of the complex environmental context: how does strategic management affect and dynamic capabilities mediate performance?"}, {"paperId": "5c23af8c521ee03937c0709c0e72456c96eceb38", "title": "Information Requirements of a Decision Support System for Severe Accident Management in Nuclear Power Plants"}, {"paperId": "e891a1c681730a8022dde401e37ffb14b0a5fda9", "title": "Wertbasiertes Design von Entscheidungsunterstützungssystemen"}, {"paperId": "610a07356db329ae590c3ae1dccdc650bcd3befd", "title": "A Decision Support System for Supporting Strategic Production Allocation in the Automotive Industry"}, {"paperId": "30255ca2d2fd9cc1fe823effd16bab39a33b84b2", "title": "The Effect of Strategic Information System in Global Marketing Channel: A Case Study"}, {"paperId": "1ed13e2932a01bffc1b1e18bd5beb8e4e38b0ee0", "title": "Power dynamics in organisations and the role of information systems"}, {"paperId": "c4417419f7a9cbcae64cb11828ac0204834325a3", "title": "The rise of artificial intelligence – understanding the AI identity threat at the workplace"}, {"paperId": "48a797fd416515a1573b941ee3a276b0be9ffbca", "title": "Big data as a value generator in decision support systems: a literature review"}, {"paperId": "d159b36537e35ae32266b338b2ef01565b5fa4bf", "title": "The balancing act of social enterprise: An IT emergence perspective"}, {"paperId": "aa4e0e9059a4169b347cc2197b6454a88d45bda6", "title": "Synthesis of neural network structure for the analysis of complex structured ocular fundus images"}, {"paperId": "d364d5943400b2987bb1c68139ed04eee4e2b466", "title": "A value-sensitive design approach to minimize value tensions in software-based risk-assessment instruments"}, {"paperId": "1f96a26d35fa9fa96cf0b82e41077f2ea26afbcf", "title": "Instantiation: Reconceptualising the role of technology as a carrier of organisational strategising"}, {"paperId": "bdf02c7cb19e4c96a024628203973b4d6363e184", "title": "Artificial Intelligence and Business Strategy towards Digital Transformation: A Research Agenda"}, {"paperId": "721d125a3b4535255c973a8c17eb42aa91443b7f", "title": "Maneuvering through the stormy seas of digital transformation: the impact of empowering leadership on the AI readiness of enterprises"}, {"paperId": "2678ab3ffea13e4d04b272425ef3f37bab98a414", "title": "35 years of research on business intelligence process: a synthesis of a fragmented literature"}, {"paperId": "52396bd331ce9b73cd7bc0139f9c679a0df76a7f", "title": "Virtual Strategy Engineer: Using Artificial Neural Networks for Making Race Strategy Decisions in Circuit Motorsport"}, {"paperId": "586aac525fd540b1e5083eff380b68cd8dbe6260", "title": "COVID-19 and Cloud Computing, the Leadership Paradoxes of Decision Making Acceleration and Data Regulation"}, {"paperId": "fbfea000e0e56329d3304282f44d8fc24e95ca9d", "title": "When predictive analytics goes wrong: what can healthcare learn from Formula 1?"}, {"paperId": "3853bcb610acf898fb6f965fd901f22ff5706b82", "title": "Discussing Relations Between Dynamic Business Environments and Big Data Analytics"}, {"paperId": "b66c4fcdb47af793e01ed158cd5f014fcd2560bb", "title": "Digital Machines, Space, and Time: Towards a Behavioral Perspective of Flexible Manufacturing"}, {"paperId": "aea61b44800d3da3bf33191dae091f16425f10bf", "title": "Dashboard information system development as visualization of transaction reports in the application BackInd (backpacker reservation system)"}, {"paperId": "eb4faac516819d317f71eee286538435e2a3f1f4", "title": "The big data-business strategy interconnection: a grand challenge for knowledge management. A review and future perspectives"}, {"paperId": "2d75201bff65aad469aa472954ec7ed95a15f64e", "title": "Of BI research: a tale of two communities"}, {"paperId": "3123e88617f9a2ae4c99e8c62d4c25a4757ce457", "title": "Strategic signaling through cloud service certifications: Comparing the relative importance of certifications' assurances to companies and consumers"}, {"paperId": "592660010a5e5983049602885accd72a0ce8e4da", "title": "Contextual Explanation: Alternative Approaches and Persistent Challenges"}, {"paperId": "09d965a09d1979ede62c26d303610e4131800592", "title": "Welcome to the third issue of Volume 27 of The Journal of Strategic Information Systems"}, {"paperId": "c905d7f8abeba2db2a300d05434ad9a9373a0ce6", "title": "Digital strategizing: An assessing review, definition, and research agenda"}, {"paperId": "5cfc821b1e34139518f7c11859fb7216b9440110", "title": "Ai Management beyond the Narratives of Dystopian Nightmares and Utopian Dreams: a Systematic Review and synthesis of the literature"}, {"paperId": "70dda259e8a9bd73f7eb0b5051da06f3451ac88c", "title": "A Socio-Technical Perspective on Organizational Interaction with AI: A Literature Review"}, {"paperId": "57c75c48013f8301288a9ae0b30b2e15380faf60", "title": "A Concept for the Use of Chatbots to Provide the Public with Vital Information in Crisis Situations"}, {"paperId": "88ecb11e9563ba3d1b19eb87b82e967b55888ea1", "title": "How to determine complex MCDM model in the COMET method? Automotive sport measurement case study"}, {"paperId": "e027928b915c141be45e54ed0038e834c2c69acd", "title": "The IS-Notion of Affordances: A Mapping of the Application of The IS-Notion of Affordances: A Mapping of the Application of Affordance Theory in Information Systems Research Affordance Theory in Information Systems Research"}, {"paperId": "26becd54896b2ac9d59f56b7a460676339e72ee7", "title": "Identifying Similarities of Big Data Projects–A Use Case Driven Approach"}, {"paperId": "252b418535ead84933c066f1915feeae0047aa2c", "title": "Determining Potential Failures and Challenges in Data Driven Endeavors: A Real World Case Study Analysis"}, {"paperId": "6955b58d0d95a99cd21a003ef376dda41191c00d", "title": "Design Requirements for AI-based Services Enriching Legacy Information Systems in Enterprises: A Managerial Perspective"}, {"paperId": "c358ac8176bf113149ec941c43721b1987fd1051", "title": "A FRAMEWORK TO ANALYZE AFFORDANCES WHEN USING BIG DATA AND ANALYTICS IN ORGANIZATIONS: A PROPOSAL"}, {"paperId": "4caf6b7d4bf7ec6524d1b9e219d40d3cbb98b124", "title": "Journal of Information Systems and Technology Management"}, {"paperId": "0d3c4e4be77c89b165115934e78930e075cd9bb2", "title": "Where Are You Going Big Data?"}]}
