{"paperId": "1d871ce98e8d572cc16aab38ba1c980ace5e3551", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Federated Class-Incremental Learning with New-Class Augmented Self-Distillation", "abstract": "Federated Learning (FL) enables collaborative model training among participants while guaranteeing the privacy of raw data. Mainstream FL methodologies overlook the dynamic nature of real-world data, particularly its tendency to grow in volume and diversify in classes over time. This oversight results in FL methods suffering from catastrophic forgetting, where the trained models inadvertently discard previously learned information upon assimilating new data. In response to this challenge, we propose a novel Federated Class-Incremental Learning (FCIL) method, named \\underline{Fed}erated \\underline{C}lass-Incremental \\underline{L}earning with New-Class \\underline{A}ugmented \\underline{S}elf-Di\\underline{S}tillation (FedCLASS). The core of FedCLASS is to enrich the class scores of historical models with new class scores predicted by current models and utilize the combined knowledge for self-distillation, enabling a more sufficient and precise knowledge transfer from historical models to current models. Theoretical analyses demonstrate that FedCLASS stands on reliable foundations, considering scores of old classes predicted by historical models as conditional probabilities in the absence of new classes, and the scores of new classes predicted by current models as the conditional probabilities of class scores derived from historical models. Empirical experiments demonstrate the superiority of FedCLASS over four baseline algorithms in reducing average forgetting rate and boosting global accuracy.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "ArXiv", "volume": "abs/2401.00622"}, "authors": [{"authorId": "2146254894", "name": "Zhiyuan Wu"}, {"authorId": "2275080650", "name": "Tianliu He"}, {"authorId": "2109354976", "name": "Sheng Sun"}, {"authorId": "119917160", "name": "Yuwei Wang"}, {"authorId": "2118169652", "name": "Min Liu"}, {"authorId": "2199129359", "name": "Bo Gao"}, {"authorId": "2144282461", "name": "Xue Jiang"}], "citations": [{"paperId": "6f9c0ff832e6e8b5c740d0ea0c49592d16138608", "title": "Knowledge Distillation in Federated Edge Learning: A Survey"}]}
