{"paperId": "1d8a2e518e4bf5b3dafc306742e5902808ac344d", "publicationVenue": {"id": "f30e3168-384d-4fcf-9f9f-370bdd1eaa2f", "name": "OPTIMA", "type": "conference", "alternate_names": ["International Conference on Optimization and Applications", "Int Conf Optim Appl"], "issn": "2549-239X"}, "title": "Using AI and IoT at the Edge of the network", "abstract": "In recent years, IoT devices have been widely used in a variety of sectors such as industry, smart farming, and smart homes. Its application requires performing high computational analysis in real-time. The research era of Artificial Intelligence has witnessed an intense development conducted by millions of research and applications that extend from systems recommendation to video/audio surveillance. AI algorithms have been deployed to IoT data to bring intelligent decisions for IoT applications. These numerous data increase the time of the data transition to the cloud, which becomes the bottleneck of the cloud-based architecture. The edge computing technology brings the AI algorithms to the Edge of the network to improve latency, bandwidth, and data privacy, and guarantee the high accuracy of the AI algorithms. Recently Federated learning (FL) is a machine learning technique that distributes the training among edge devices near to the data source in light of increasing privacy and leveraging from the massive data distributed among numerous edge devices. Therefore, in this paper, we introduce recent research that demonstrates the effectiveness of this approach and present the architectures, models, and methods that implement FL with IoT devices.", "venue": "OPTIMA", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-06", "journal": {"name": "2022 8th International Conference on Optimization and Applications (ICOA)", "pages": "1-6"}, "authors": [{"authorId": "2190307476", "name": "Sanaa Lakrouni"}, {"authorId": "2228635", "name": "Marouane Sebgui"}, {"authorId": "145395363", "name": "Slimane Bah"}], "citations": []}
