{"paperId": "1d8c606517a17faefe353f751899333b3a50f690", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "DermCDSM: Clinical Decision Support Model for Dermatosis Using Systematic Approaches of Machine Learning and Deep Learning", "abstract": "Skin disorders encompass a wide range of conditions that affect the skin, a vital organ of the human body. Early detection of skin diseases is difficult due to a lack of awareness, subtle symptoms, similarities, inter-individual heterogeneity in symptoms, limited access to dermatologists, and difficulties in imaging techniques. In this article, we propose a clinical decision support model for detection and classification of skin diseases (DermCDSM) through productive improvement of division capabilities and a cross-breed profound learning procedure. The division cycle is expected to be further developed using an improved chameleon swarm optimization (ICSO) method that takes into account a more accurate and proficient identification of the main cause of the disease. By employing the ICSO algorithm, we aim to enhance the overall accuracy and reliability of disease detection methods. Multi-strategy seeking optimization (MSSO), which is used to optimize feature selection by identifying the most significant features for the task at hand, has been introduced to handle the tests connected to data dimensionality. Convolutional deep spiking neural networks (CD-SNN), a deep learning method, have been implemented to improve the precision of skin cancer diagnosis and multi-class classification. The benchmark ISIC 2017 dataset is utilized to validate the efficacy of our proposed framework, DermCDSM, and its superiority over existing approaches in terms of accuracy, dependability, and efficiency is demonstrated.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "47319-47337", "volume": "12"}, "authors": [{"authorId": "2270170800", "name": "Ruchi Mittal"}, {"authorId": "51480124", "name": "Fathe Jeribi"}, {"authorId": "2219525725", "name": "R. J. Martin"}, {"authorId": "1628994503", "name": "Varun Malik"}, {"authorId": "87244526", "name": "S. Menachery"}, {"authorId": "2290520183", "name": "Jaiteg Singh"}], "citations": []}
