{"paperId": "1d98839c28886823a3693d07332d8cff013d236f", "publicationVenue": {"id": "2ca1e2ac-8c3b-4251-94ed-24846d391d3b", "name": "Computational and Mathematical Methods in Medicine", "type": "journal", "alternate_names": ["Comput Math Method Med"], "issn": "1748-670X", "url": "https://www.hindawi.com/journals/cmmm/"}, "title": "A Review Paper about Deep Learning for Medical Image Analysis", "abstract": "Medical imaging refers to the process of obtaining images of internal organs for therapeutic purposes such as discovering or studying diseases. The primary objective of medical image analysis is to improve the efficacy of clinical research and treatment options. Deep learning has revamped medical image analysis, yielding excellent results in image processing tasks such as registration, segmentation, feature extraction, and classification. The prime motivations for this are the availability of computational resources and the resurgence of deep convolutional neural networks. Deep learning techniques are good at observing hidden patterns in images and supporting clinicians in achieving diagnostic perfection. It has proven to be the most effective method for organ segmentation, cancer detection, disease categorization, and computer-assisted diagnosis. Many deep learning approaches have been published to analyze medical images for various diagnostic purposes. In this paper, we review the work exploiting current state-of-the-art deep learning approaches in medical image processing. We begin the survey by providing a synopsis of research works in medical imaging based on convolutional neural networks. Second, we discuss popular pretrained models and general adversarial networks that aid in improving convolutional networks' performance. Finally, to ease direct evaluation, we compile the performance metrics of deep learning models focusing on COVID-19 detection and child bone age prediction.", "venue": "Computational and Mathematical Methods in Medicine", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-05-29", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2023"}, "authors": [{"authorId": "2219622039", "name": "Bagher Sistaninejhad"}, {"authorId": "2086935556", "name": "Habib Rasi"}, {"authorId": "2006254571", "name": "Parisa Nayeri"}], "citations": [{"paperId": "6c7224f197491da7c8b21278c0833c8340f34a6a", "title": "A Comprehensive Survey of Convolutions in Deep Learning: Applications, Challenges, and Future Trends"}, {"paperId": "eaea8c979a6137f2b586f7ee32005a18661a8d69", "title": "Exploring the Use of Advanced Imaging Diagnostics: Deep Learning for 3D-MRI Analysis"}, {"paperId": "9f411c24d11ba220bf0ab0d21c8feea67e4122b1", "title": "A Review: Medical Image Analysis Using Deep Learning Models"}, {"paperId": "4bed941d2c4c7a24f950c5bd61667663c40bb082", "title": "Convolutional Neural Network-Assisted Diagnosis of Midpalatal Suture Maturation Stage in Cone-beam Computed Tomography."}, {"paperId": "b810201c6503030f8b616a51c79a08729ac581fc", "title": "A Study on Deep Learning Frameworks to Understand the Real Time Fault Detection and Diagnosis in IT Operations with AIOPs"}]}
