{"paperId": "1da6c4154d7facf3c2f05fee7c8bd13ea68a15aa", "publicationVenue": {"id": "b4b9c2ab-3b92-4da7-a4ae-26c8247300d0", "name": "International Conference on Wireless Communications and Mobile Computing", "type": "conference", "alternate_names": ["IWCMC", "Int Conf Wirel Commun Mob Comput"], "url": "http://iwcmc.com/"}, "title": "Load Optimization of Joint User Association and Dynamic TDD in Ultra Dense Networks", "abstract": "In order to adapt to the rising traffic in 5G even 6G systems, operators have turned their attention to the dense deployment of base stations, which makes the problem of user association more complicated. At the same time, in order to adapt to the differences of traffic in different regions and the asymmetry of uplink and downlink requirement, dynamic TDD technology has also been proposed in some papers. Hence, dynamic TDD based Ultra-dense networks require more complex association algorithms, and these algorithms should consider not only the channel characteristics, but also the load of the base stations and the uplink and downlink resource configuration of the base stations. Although some researches have been done on user association and dynamic TDD, most papers consider them separately. In this paper, we consider user association and dynamic TDD together and add constraints on cross-slot interference and load limits. We propose an algorithm which can decompose the problem into independent subproblems using the generalized Benders method. The subproblems can be solved by the gradient descent algorithm and two-sided matching game algorithm, respectively. Simulation results show that compared with traditional algorithms, our proposed algorithm can significantly improve the performance of user throughput and network load balancing.", "venue": "International Conference on Wireless Communications and Mobile Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "2020 International Wireless Communications and Mobile Computing (IWCMC)", "pages": "545-550"}, "authors": [{"authorId": "3257184", "name": "Shouming Wei"}, {"authorId": "50858020", "name": "Ting Li"}, {"authorId": "2144356386", "name": "Wei Wu"}], "citations": [{"paperId": "2361e88a9a3723ea7f46d96365ae78af58b1031b", "title": "Dynamic TDD configuration for multiple UL/DL service requirements under asymmetric coverage in UAV-assisted cellular network"}, {"paperId": "efe61036a40aee1fa01e1a46da23c39eb4962b21", "title": "5G Multi-Band Numerology-Based TDD RAN Slicing for Throughput and Latency Sensitive Services"}]}
