{"paperId": "1db04857e49b12fb0bc0d0d3c02e52d191b89ae4", "publicationVenue": {"id": "6991f0fc-b6fd-4f39-b3ba-68c0ec4139fb", "name": "RADIOELECTRONIC AND COMPUTER SYSTEMS", "alternate_names": ["RADIOELECTRON COMPUT SYST"], "issn": "1814-4225", "url": "http://nti.khai.edu/ojs/index.php/reks/index"}, "title": "Consistency issue and related trade-offs in distributed replicated systems and databases: a review", "abstract": "Distributed replicated databases play a crucial role in modern computer systems enabling scalable, fault-tolerant, and high-performance data management. However, achieving these qualities requires resolving a number of trade-offs between various properties during system design and operation. This paper reviews trade-offs in distributed replicated databases and provides a survey of recent research papers studying distributed data storage. The paper first discusses a compromise between consistency and latency that appears in distributed replicated data storages and directly follows from CAP and PACELC theorems. Consistency refers to the guarantee that all clients in a distributed system observe the same data at the same time. To ensure strong consistency, distributed systems typically employ coordination mechanisms and synchronization protocols that involve communication and agreement among distributed replicas. These mechanisms introduce additional overhead and latency and can dramatically increase the time taken to complete operations when replicas are globally distributed across the Internet. In addition, we study trade-offs between other system properties including availability, durability, cost, energy consumption, read and write latency, etc. In this paper we also provide a comprehensive review and classification of recent research works in distributed replicated databases. Reviewed papers showcase several major areas of research, ranging from performance evaluation and comparison of various NoSQL databases to suggest new strategies for data replication and putting forward new consistency models. In particular, we observed a shift towards exploring hybrid consistency models of causal consistency and eventual consistency with causal ordering due to their ability to strike a balance between operations ordering guarantees and high performance. Researchers have also proposed various consistency control algorithms and consensus quorum protocols to coordinate distributed replicas. Insights from this review can empower practitioners to make informed decisions in designing and managing distributed data storage systems as well as help identify existing gaps in the body of knowledge and suggest further research directions.", "venue": "RADIOELECTRONIC AND COMPUTER SYSTEMS", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-25", "journal": {"name": "Radioelectronic and Computer Systems"}, "authors": [{"authorId": "2239800617", "name": "Jaafar Ahmed"}, {"authorId": "2090631172", "name": "A. Karpenko"}, {"authorId": "145826913", "name": "O. Tarasyuk"}, {"authorId": "144272633", "name": "A. Gorbenko"}, {"authorId": "2239831347", "name": "A. Sheikh-Akbari"}], "citations": [{"paperId": "1765205a8dfb581ca2dafe13f75b6dd7a55fa7f3", "title": "Enhancement of database access performance by improving data consistency in a non-relational database system (NoSQL)"}]}
