{"paperId": "1db377c8c08b1b6ed818e6eff5d4839491aff851", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Exploring the landscape of big data applications in librarianship: a bibliometric analysis of research trends and patterns", "abstract": "PurposeThis bibliometric study aims to analyze the latest trends and patterns of big data applications in librarianship from 2000 to 2022. By conducting a comprehensive examination of the existing literature, this study aims to provide valuable insights into the emerging field of big data in librarianship and its potential impact on the future of libraries.Design/methodology/approachThis study employed a rigorous four-stage process of identification, screening, eligibility and inclusion to filter and select the most relevant documents for analysis. The Scopus database was utilized to retrieve pertinent data related to big data applications in librarianship. The dataset comprised 430 documents, including journal articles, conference papers, book chapters, reviews and books. Through bibliometric analysis, the study examined the effectiveness of different publication types and identified the main topics and themes within the field.FindingsThe study found that the field of big data in librarianship is growing rapidly, with a significant increase in publications and citations over the past few years. China is the leading country in terms of publication output, followed by the United States of America. The most influential journals in the field are Library Hi Tech and the ACM International Conference Proceeding Series. The top authors in the field are Minami T, Wu J, Fox EA and Giles CL. The most common keywords in the literature are big data, librarianship, data mining, information retrieval, machine learning and webometrics.Originality/valueThis bibliometric study contributes to the existing body of literature by comprehensively analyzing the latest trends and patterns in big data applications within librarianship. It offers a systematic approach to understanding the state of the field and highlights the unique contributions made by various types of publications. The study’s findings and insights contribute to the originality of this research, providing a foundation for further exploration and advancement in the field of big data in librarianship.", "venue": "Library hi tech", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-26", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2293240478", "name": "Md. Nurul Islam"}, {"authorId": "2204666348", "name": "Guangwei Hu"}, {"authorId": "115764975", "name": "M. Ashiq"}, {"authorId": "2265464821", "name": "Shakil Ahmad"}], "citations": []}
