{"paperId": "1dc9626062182372d4a97e245a64fcabadbe49ca", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "Efficient and Scalable Graph Pattern Mining on GPUs", "abstract": "Graph Pattern Mining (GPM) extracts higher-order information in a large graph by searching for small patterns of interest. GPM applications are computationally expensive, and thus attractive for GPU acceleration. Unfortunately, due to the complexity of GPM algorithms and parallel hardware, hand optimizing GPM applications suffers programming complexity, while existing GPM frameworks sacrifice efficiency for programmability. Moreover, little work has been done on GPU to scale GPM computation to large problem sizes. We describe G2Miner, the first Graph Pattern Mining (GPM) framework that runs on multiple GPUs. G2Miner uses pattern-aware, input-aware and architecture-aware search strategies to achieve high efficiency on GPUs. To simplify programming, it provides a code generator that automatically generates pattern-aware CUDA code. G2Miner flexibly supports both breadth-first search (BFS) and depth-first search (DFS) to maximize memory utilization and generate sufficient parallelism for GPUs. For the scalability of G2Miner, we use a customized scheduling policy to balance work among multiple GPUs. Experiments on a V100 GPU show that G2Miner achieves average speedups of 5.4x and 7.2x over two state-of-the-art single-GPU systems, Pangolin and PBE, respectively. In the multi-GPU setting, G2Miner achieves linear speedups from 1 to 8 GPUs, for various patterns and data graphs. We also show that G2Miner on a V100 GPU is 48.3x and 15.2x faster than the state-of-the-art CPU-based system, Peregrine and GraphZero, on a 56-core CPU machine.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-17", "journal": {"name": "ArXiv", "volume": "abs/2112.09761"}, "authors": [{"authorId": "2108923360", "name": "Xuhao Chen"}, {"authorId": "51346163", "name": "Mit Csail"}, {"authorId": "2226803933", "name": "Arvind Mit Csail"}], "citations": [{"paperId": "0c100a01457991731a1991e529d6f4f1cb358418", "title": "GPU-Accelerated Batch-Dynamic Subgraph Matching"}, {"paperId": "917cd596c08acf32dd777f5cef2f10840b95f900", "title": "Accelerating Maximal Biclique Enumeration on GPUs"}, {"paperId": "48669df0e9c05b580eda3892e39e25177b4fcf14", "title": "GraphPar: Efficient Workload-Aware Subgraph Matching System on Multiple GPUs"}, {"paperId": "2318bdeea310b1ea524fa483f9276c4f3ef6c88f", "title": "GraphSet: High Performance Graph Mining through Equivalent Set Transformations"}, {"paperId": "31f8b8bd29e877a568585f61d148269dd53e9759", "title": "Efficient Maximal Biclique Enumeration on GPUs"}, {"paperId": "4a321b971c77355cb70e763bfea05e430b6b29b7", "title": "Everest: GPU-Accelerated System For Mining Temporal Motifs"}, {"paperId": "d1702fc8c89cccc6b2f829caab9218cefffcf9a5", "title": "SMOG: Accelerating Subgraph Matching on GPUs"}, {"paperId": "ec157e71d43859a42788d2206cb1bbc145f67eee", "title": "BEEP: Balanced Efficient subgraph Enumeration in Parallel"}, {"paperId": "b0e010361793bea5e39a5d6cda8fa75461380569", "title": "GraphINC: Graph Pattern Mining at Network Speed"}, {"paperId": "4f009525497c4fd6e14643298e583376de201005", "title": "Parallelizing Maximal Clique Enumeration on GPUs"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "66dd43a62358f18a8fbd60aac44b0f11a12346e6", "title": "DIMMining: pruning-efficient and parallel graph mining on near-memory-computing"}, {"paperId": "36f631f70ab979d3248293a35ae40f8633ec7018", "title": "GLogS: Interactive Graph Pattern Matching Query At Large Scale"}]}
