{"paperId": "1dc9ffa934803e943c60deaff7618db5f4c7bf49", "publicationVenue": null, "title": "Map-Reduce Task Scheduling Optimization Techniques: A Comparative Study", "abstract": "Cloud computing is becoming popular because it offers the pay-as-per-use model with business benefits of enhanced scalability, flexibility, mobility and reliability with cost reduction in use of required resources. Multiple map-reduce sub-tasks from different users use the cloud resources simultaneously. Scheduling these multiple tasks to the available resources is quite challenging. Without optimized scheduling, desired quality of service cannot be achieved. With effective scheduling of map-reduce sub-tasks other parameters of interest like cost, energy consumption and resource usage can be optimized as well. It is obvious that task scheduling optimization on cloud attracted a lot of researchers. Many heuristics, meta-heuristic and their hybridizations were used for scheduling the multiple tasks to available and limited resources of cloud. Use of metaheuristic algorithms in map-reduce task scheduling on cloud showed better results than only heuristic algorithms. Researchers were well realized that by combining the useful features of two or more algorithms, best scheduling solutions can be achieved. Different available hybrid algorithms are reviewed in this study. It will classify the available hybrid algorithms on different parameters for business benefits. it provides the future directions for hybridization of meta-heuristic algorithms for map-reduce task scheduling optimization. In this review different existing models for map-reduce task scheduling optimization in terms of make-span have been explored.", "venue": "2023 7th International Conference on Trends in Electronics and Informatics (ICOEI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-04-11", "journal": {"name": "2023 7th International Conference on Trends in Electronics and Informatics (ICOEI)", "pages": "729-736"}, "authors": [{"authorId": "2217152911", "name": "Vishal Kumar"}, {"authorId": "3197632", "name": "Sumit Kushwaha"}], "citations": []}
