{"paperId": "1dcd3ce2221eff4213487249978f7ec844f1c611", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Communication-efficient Decentralized Machine Learning over Heterogeneous Networks", "abstract": "In the last few years, distributed machine learning has been usually executed over heterogeneous networks such as a local area network within a multi-tenant cluster or a wide area network connecting data centers and edge clusters. In these heterogeneous networks, the link speeds among worker nodes vary significantly, making it challenging for state-of-the-art machine learning approaches to perform efficient training. Both centralized and decentralized training approaches suffer from low-speed links. In this paper, we propose a decentralized approach, namely NetMax, that enables worker nodes to communicate via high-speed links and, thus, significantly speed up the training process. NetMax possesses the following novel features. First, it consists of a novel consensus algorithm that allows worker nodes to train model copies on their local dataset asynchronously and exchange information via peer-to-peer communication to synchronize their local copies, instead of a central master node (i.e., parameter server). Second, each worker node selects one peer randomly with a fine-tuned probability to exchange information per iteration. In particular, peers with high-speed links are selected with high probability. Third, the probabilities of selecting peers are designed to minimize the total convergence time. Moreover, we mathematically prove the convergence of NetMax. We evaluate NetMax on heterogeneous cluster networks and show that it achieves speedups of 3.7×, 3.4×, and 1.9× in comparison with the state-of-the-art decentralized training approaches Prague, Allreduce-SGD, and AD-PSGD, respectively.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-12", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "384-395"}, "authors": [{"authorId": "33481412", "name": "Pan Zhou"}, {"authorId": "1509526758", "name": "Qian Lin"}, {"authorId": "32919563", "name": "Dumitrel Loghin"}, {"authorId": "1693070", "name": "B. Ooi"}, {"authorId": "2108407950", "name": "Yuncheng Wu"}, {"authorId": "49514984", "name": "Hongfang Yu"}], "citations": [{"paperId": "67223657ae4ade6b592ac591b9f04636e780edf6", "title": "Finch: Enhancing Federated Learning With Hierarchical Neural Architecture Search"}, {"paperId": "fc30e163a040c57378b37df5cade3c5b412abe49", "title": "FedCD: A Hybrid Centralized-Decentralized Architecture for Efficient Federated Learning"}, {"paperId": "ff950bee2aae7ed85e304f397bca9c33615bdaf4", "title": "Communication and Energy Efficient Decentralized Learning Over D2D Networks"}, {"paperId": "250dc8f7059e4a23985c06edd7b5b2ca9291a693", "title": "Topologies in distributed machine learning: Comprehensive survey, recommendations and future directions"}, {"paperId": "408a759eb02d7be41cc89365c9ad3abbbe989390", "title": "Exploring the Impact of Serverless Computing on Peer To Peer Training Machine Learning"}, {"paperId": "36d93586d3054b2590e068262f880e9d107d86fc", "title": "Accelerating Decentralized Federated Learning in Heterogeneous Edge Computing"}, {"paperId": "4d043fd5c1a37bad907e05bb3f32a3f0cdd50a47", "title": "TNP: A Step Towards Elastic Training"}, {"paperId": "53592f4560361721d22bf30280a0871c228029aa", "title": "Incentive-Aware Decentralized Data Collaboration"}, {"paperId": "f48d40617405e6fdd9b720d91a0bc557f9c51900", "title": "Decentralized Federated Learning: A Survey and Perspective"}, {"paperId": "bb4720ca4cc773e3ad09415e8c49a46418418125", "title": "Enhancing Decentralized Federated Learning for Non-IID Data on Heterogeneous Devices"}, {"paperId": "24e4542357ba53364b8e718747184284e6b40d10", "title": "HFedDI: A novel privacy preserving horizontal federated learning based scheme for IoT device identification"}, {"paperId": "8af463a4e9d861631c10ca5485e4b5e9c2279342", "title": "Federated learning in cloud-edge collaborative architecture: key technologies, applications and challenges"}, {"paperId": "b92278ee33a6147bbf78255ffdb7bc81cf38d0c1", "title": "Adaptive Configuration for Heterogeneous Participants in Decentralized Federated Learning"}, {"paperId": "574c6e260729cf55b28c570fa45cabcbeb40e20c", "title": "Graph Neural Networks for Intelligent Modelling in Network Management and Orchestration: A Survey on Communications"}, {"paperId": "883eae7647c91bb17831e5b2c55c2250f929912d", "title": "Data heterogeneity in federated learning with Electronic Health Records: Case studies of risk prediction for acute kidney injury and sepsis diseases in critical care"}, {"paperId": "d9f280deeb39686fde956a4b92389983fdb0304e", "title": "Efficient Partial Reduce Across Clouds"}, {"paperId": "3fda4559e6ba046ab3589b98b90f89c8a7839c15", "title": "Distributed hierarchical deep optimization for federated learning in mobile edge computing"}, {"paperId": "e43272b6d0cf8c6bb5931c226dc5dd47cf88b0df", "title": "The Metaverse Data Deluge: What Can We Do About It?"}, {"paperId": "7424e5bc67f6a848a7216153cb25ec5ff7a222af", "title": "Enhancing Federated Learning with In-Cloud Unlabeled Data"}, {"paperId": "b0f5a538a7a08f82a53c1b2618a0ee0e44939cd3", "title": "p2pGNN: A Decentralized Graph Neural Network for Node Classification in Peer-to-Peer Networks"}, {"paperId": "2dc35dcb0c10a6013b6ae1a28e6c6f558ba19344", "title": "A decentralized federated learning-based spatial-temporal model for freight traffic speed forecasting"}, {"paperId": "e3a7c2d839cc31ea2b3547559ff0af74fdc4a896", "title": "Leveraging Network Data Analytics Function and Machine Learning for Data Collection, Resource Optimization, Security and Privacy in 6G Networks"}, {"paperId": "9602241f2e0fcc43e1d99e17c4bb4404eca8780b", "title": "Sense The Physical, Walkthrough The Virtual, Manage The Metaverse: A Data-centric Perspective"}]}
