{"paperId": "1dcd2528d868a7d12fd3e2f325cd9729100bf274", "publicationVenue": {"id": "89812fab-c382-4585-9eec-f88f17762366", "name": "International journal of numerical modelling", "type": "journal", "alternate_names": ["International Journal of Numerical Modelling-electronic Networks Devices and Fields", "Int J Numer Model Netw Device Field", "Int j numer model"], "issn": "0894-3370", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/110550927", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jhome/4673", "https://onlinelibrary.wiley.com/journal/10991204"]}, "title": "Cyber forensic framework for big data analytics using Sunflower Jaya optimization‐based Deep stacked autoencoder", "abstract": "The skills of forensic analysts are at risk to process the increasing data in the Internet of Things‐based environment platforms. However, the technical issues like anti‐forensics, variety of traffic formats, steganography or encrypted data, and real‐time live investigation degrades the performance of the cyber forensic framework. Therefore, an effective method named Sunflower Jaya Optimization‐based Deep stacked autoencoder (SFJO‐based Deep stacked autoencoder) is proposed to perform the cyber forensic framework. The finite element model of Sunflower optimization is integrated with the control parameters of Jaya optimization to solve the issues in the cyber forensic framework. The proposed SFJO‐based Deep stacked autoencoder uses the pollination and the peculiar behaviors to enable the cyber forensic framework based on the error value in the big data analytics model. Accordingly, the solution with the minimal value of error is accepted as the best optimal solution by computing the orientation vector. However, the proposed model is illustrated based on the unconstrained benchmark function, which in turn results in the fitness function to reveal the best candidate solution. The proposed SFJO‐based Deep stacked autoencoder attained better performance using metrics like precision, sensitivity, and specificity with the values of 0.9053, 0.8865, and 0.8839 using dataset‐1.", "venue": "International journal of numerical modelling", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-07", "journal": {"name": "International Journal of Numerical Modelling: Electronic Networks", "volume": "34"}, "authors": [{"authorId": "2121843074", "name": "Sabaresan Venugopal"}, {"authorId": "1793057", "name": "Godfrey Winster Sathianesan"}, {"authorId": "144651224", "name": "R. Rengaswamy"}], "citations": [{"paperId": "ec2e4ae763dbb83c5fa5597014a1ca1118adf11a", "title": "Optimized Deep Neuro Fuzzy Network for Cyber Forensic Investigation in Big Data-Based IoT Infrastructures"}, {"paperId": "19ced4e20b979432216a86c8a9be4561c3515088", "title": "Cyber Forensic Investigation in IoT Using Deep Learning Based Feature Fusion in Big Data"}]}
