{"paperId": "1ddde8f0946b4eee6cc45a3bc31f2e0ee34b5f5a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "InfiniViz: Interactive Visual Exploration using Progressive Bin Refinement", "abstract": "Interactive visualizations can accelerate the data analysis loop through near-instantaneous feedback. To achieve interactivity, techniques such as data cubes and sampling are typically employed. While data cubes can speedup querying for moderate-sized datasets, they are ineffective at doing so at a larger scales due to the size of the materialized data cubes. On the other hand, while sampling can help scale to large datasets, it adds sampling error and the associated issues into the process. \nWhile increasing accuracy by looking at more data may sometimes be valuable, providing result minutiae might not be necessary if they do not impart additional significant information. Indeed, such details not only incur a higher \\emph{computational} cost, but also tax the \\emph{cognitive} load of the analyst with worthless trivia. To reduce both the computational and cognitive expenses, we introduce \\emph{InfiniViz}. Through a novel result refinement-based querying paradigm, \\emph{InfiniViz} provides error-free results for large datasets by increasing bin resolutions progressively over time. Through real and simulated workloads over real and benchmark datasets, we evaluate and demonstrate \\emph{InfiniViz}'s utility at reducing both cognitive and computational costs, while minimizing information loss.", "venue": "arXiv.org", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-10-05", "journal": {"name": "ArXiv", "volume": "abs/1710.01854"}, "authors": [{"authorId": "2354853", "name": "N. Kamat"}, {"authorId": "145781033", "name": "Arnab Nandi"}], "citations": [{"paperId": "40b14e7348a3e804229076bf8198bf7b0e724530", "title": "Evaluating interactive data systems"}, {"paperId": "78e2abaa5d5fb2f17d8b00bb6464beca42afe2ed", "title": "A Holistic Approach for Query Evaluation andResult Vocalization in Voice-Based OLAP"}, {"paperId": "a8e3257d8ec0424d3fd82acdcecd5123f6fa5820", "title": "To Ship or Not to (Function) Ship (Extended version)"}, {"paperId": "cd86f97c47231ee155c4555720dd7dbd82ef5fd2", "title": "Quantitative and Visual Exploratory Data Analysis for Machine Intelligence"}, {"paperId": "d51df4349a6754090d121197d2ee6ea4e12b7a19", "title": "Data Vocalization with CiceroDB"}]}
