{"paperId": "1dea1eb3e90c44757f4f6b99ffe3f490651682eb", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Integration of Building Information Modeling (BIM) and Big Data in China: Recent Application and Future Perspective", "abstract": "The integrated application of building information modeling (BIM) and big data (BD) has received widespread attention, and has been involved in smart construction sites, construction project management, and construction project budgeting. Nevertheless, research on the integrated implementation of BIM and BD in China mainly concentrates on a project stage or profession, the exploration of technology integration mostly focuses on the theoretical level, and the research distribution is scattered. As such, the intention of this paper is to reveal the research history of BIM and BD in China, as well as to study the research methodologies and research fields for a more thorough knowledge of the BIM and BD research and development status in the Chinese construction sector, which adopts a mixed research method that uses a quantitative research via two analytical software tools, i.e., CiteSpace version of 6.1.R6 and the Statistical Analysis Toolkit on line edition for Informetrics software packages, to conduct a macro bibliometric analysis on BIM and BD research in the China National Knowledge Infrastructure database, and provides a follow-up micro qualitative research with content analysis. To ensure the comprehensiveness of the research, the core articles of the topic in the web of science database have been sorted out and analyzed for fully understanding the development of BIM and BD in the field of Chinese construction, resulting in identifying the current research hotspots and trends in China. The results suggest that the popular research keywords on BIM and BD in China since the year 2015 have mainly been focused on informatization, the internet of things, and rail transportation. Three fruitful research themes in BIM and BD research in China have been identified, including smart construction, smart operation, and bridge informatization.", "venue": "Buildings", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-25", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2248078674", "name": "Wenfeng Xia"}, {"authorId": "2223642529", "name": "Yuhong Zheng"}, {"authorId": "2248101267", "name": "Lele Huang"}, {"authorId": "2238887427", "name": "Zhen Liu"}], "citations": [{"paperId": "48a045eb9bb510a461ad4cd39ffc77ea0ee2c047", "title": "Constructing the future: Policy-driven digital fabrication in China's urban development"}, {"paperId": "531075cfd931f13c2d6d1bdcd492d8303352169b", "title": "Application research of intelligent system based on BIM and sensors monitoring technology in construction management"}]}
