{"paperId": "1dedb2f37d1fc0ec51c6a98e0403a21b58697b25", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Transport for the Elderly: Activity Patterns, Mode Choices, and Spatiotemporal Constraints", "abstract": "The rapid aging of the population has posed significant challenges to society and raised new demand for transportation services. Understanding travel needs of the elderly is crucial to making effective strategies for accommodating their demand in many newly motorized cities in developing countries such as China. Using a Markov-chain-based mixture model, we identify two main activity patterns of the elderly: recreation-shopping-oriented (RS-oriented) pattern and schooling-drop-off/pick-up-oriented (SDP-oriented) pattern. Elderly people in the RS-oriented pattern enjoy a cozy life with much time spent on recreation and shopping activities, while those in the SDP-oriented pattern take responsibility of sending grandchildren to school and taking them back home. The RS-oriented elderly people are faced with spatial constraints to access the sparsely distributed recreational sights; however, the SDP-oriented group is subject to temporal constraints when making daily trips. These results would encourage policy makers to reconsider the role of transportation in aged people’s lives and better accommodate their demand through designing safer walking and cycling environment and improving the quality of transit services.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-12-01", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2145499265", "name": "Yang Zhou"}, {"authorId": "144334341", "name": "Quan Yuan"}, {"authorId": "2146344110", "name": "Chao Yang"}], "citations": [{"paperId": "a4a801b08feacf73870b6d0ef3afd7dba17f3b13", "title": "Review of Research on Urban Social Space and Sustainable Development"}, {"paperId": "f4227796194d2a767b55d67c0925683d7d656644", "title": "Selected Urban Mobility Issues of the Elderly:The Polish Experience"}, {"paperId": "da28f740ba8ef9d8dde1fdb7ec8df44da27e8eb8", "title": "Community Time-Activity Trajectory Modelling based on Markov Chain Simulation and Dirichlet Regression"}, {"paperId": "956d9d9048e4dab06ed9012360f8d4af9508f697", "title": "Measuring Neighbourhood Walking Access for Older Adults"}, {"paperId": "0f1719a8238cd3d69afb5cede6c5b7977495fe5c", "title": "Demand, mobility, and constraints: Exploring travel behaviors and mode choices of older adults using a facility-based framework"}, {"paperId": "0b98622dd35d9471e67214132336c6cc50ce244a", "title": "A scoping review of the daily mobilities of older adults in the Global South"}, {"paperId": "da87250ba412c63e5da5539b9623ed7114b03da7", "title": "VALIDITY AND RELIABILITY STUDY OF THE TURKISH VERSION OF THE LIFE SPACE ASSESSMENT"}, {"paperId": "0c21d079ab2aa735291077ff235ebcdd8254fe88", "title": "Spatial and Temporal Distribution of Elderly Public Transport Mode Preference"}, {"paperId": "eedbb925e000d173c5fd4dd389b8978422ec5a0a", "title": "Sustainable Care and Factors Associated with Quality of Life among Older Beneficiaries of Social Services"}, {"paperId": "0d204055c22a01f292212a88395a332999f8c757", "title": "Examining Public Concerns and Attitudes toward Unfair Events Involving Elderly Travelers during the COVID-19 Pandemic Using Weibo Data"}, {"paperId": "ef0af1d26baee54fe0d536474aa52512740ce072", "title": "A new decade for social changes"}]}
