{"paperId": "1defcdcae99a37719d0e51696f92b6b013bd31bc", "publicationVenue": null, "title": "Framework for Data Provenance Assurance in Cloud Environment using Ethereum Blockchain", "abstract": "Ensuring secure data provenance is crucial for maintaining accountability and confidentiality in cloud environments. Cloud data provenance involves recording the history of creation and operations performed on cloud data objects. However, establishing trust between cloud customers and service providers remains a challenge, highlighting the need for assured data provenance models in cloud storage. Blockchain technology has emerged as a solution for designing data provenance assurance mechanisms. It provides a decentralized and distributed ledger to record the provenance of digital assets. In this context, we present a blockchain-based framework for ensuring data provenance in cloud storage. Initially, we develop a cloud storage application using OpenStack swift storage. This application caters to the storage needs of university students and faculty while providing data provenance capabilities. Subsequently, we design a data provenance assurance framework for confidential files of users using the Ethereum blockchain. To evaluate the scalability and performance of the proposed framework, we analyze various factors such as transaction throughput, latency, network size, and load on the blockchain network. The performance of the system is compared under two consensus algorithms: Proof of Work and Proof of Authority. By conducting this analysis, we aim to assess the effectiveness and efficiency of the blockchain-based solution in ensuring data provenance in cloud storage environments.", "venue": "ICST Transactions on Scalable Information Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-09", "journal": {"name": "ICST Transactions on Scalable Information Systems"}, "authors": [{"authorId": "2258261856", "name": "Narayan G"}, {"authorId": "2003023653", "name": "Pavitra Haveri"}, {"authorId": "2258108593", "name": "Rashmi B"}, {"authorId": "2258254842", "name": "Yashwardhan Deewan"}], "citations": []}
