{"paperId": "1df9d4fdd2d2d5ef1fe5b8d62ae6c17040662c08", "publicationVenue": null, "title": "Top-K Deep Video Analytics: A Probabilistic Approach", "abstract": "The impressive accuracy of deep neural networks (DNNs) has created great demands on practical analytics over video data. Although efficient and accurate, the latest video analytic systems have not supported analytics beyond selection and aggregation queries. In data analytics, Top-K is a very important analytical operation that enables analysts to focus on the most important entities. In this paper, we present Everest, the first system that supports efficient and accurate Top-K video analytics. Everest ranks and identifies the most interesting frames/moments from videos with probabilistic guarantees. Everest is a system built with a careful synthesis of deep computer vision models, uncertain data management, and Top-K query processing. Evaluations on real-world videos and the latest Visual Road benchmark show that Everest achieves between 14.3x to 20.6x higher efficiency than baseline approaches with high result accuracy.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "51252562", "name": "Ziliang Lai"}, {"authorId": "2118642200", "name": "Chenxia Han"}, {"authorId": "2768964", "name": "Chris Liu"}, {"authorId": "2110149896", "name": "Pengfei Zhang"}, {"authorId": "145373095", "name": "Eric Lo"}, {"authorId": "2064074042", "name": "Ben Kao"}], "citations": [{"paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a", "title": "Hydro: Adaptive Query Processing of ML Queries"}, {"paperId": "87ab29cd19e83f6101a2d23b1d66a03f8dcab22d", "title": "Predictive and Near-Optimal Sampling for View Materialization in Video Databases"}, {"paperId": "0e818290e64b44a79406c4dabc2c8a96f334d0ff", "title": "Towards a Flexible Scale-out Framework for Efficient Visual Data Query Processing"}, {"paperId": "112dc960359e3ad76c110e8cdfad8a9f9fead087", "title": "Everest: A Top-K Deep Video Analytics System"}, {"paperId": "23fe77fd81fe9eaad8e8c7164ce759d2ca0f65f4", "title": "On Efficient Approximate Queries over Machine Learning Models"}]}
