{"paperId": "1e07c4b8296e8966eeb291d884891839e4104c5a", "publicationVenue": {"id": "e84bb5a1-8f79-42cc-8eb1-3a52f7c73d63", "name": "IEEE International Conference on Systems, Man and Cybernetics", "type": "conference", "alternate_names": ["Smoky Mountains Computational Sciences and Engineering Conference", "Smoky Mt Comput Sci Eng Conf", "IEEE Int Conf Syst Man Cybern", "SMC", "Syst Man Cybern", "Systems, Man and Cybernetics"]}, "title": "Intentional Data Placement Optimization for Distributed Data Warehouses", "abstract": "Parallel computing is a fundamental technique in the management of large quantities of data as it leverages on the concurrent utilization of multiple computing resources. One of the technologies that made big data analytics popular and accessible to enterprises of all sizes is MapReduce (and its open-source Hadoop implementation). With the ability to automatically parallelize the application on a cluster of commodity hardware, MapReduce allows enterprises to analyze terabytes and petabytes of data more conveniently than ever. However, the performance gained from Hadoop's features is currently limited by its default block placement policy, which does not take any data characteristics into account. Indeed, the efficiency of many operations can be improved by a careful data placement, including indexing, grouping, aggregation and joins. In this paper, we present a MapReduce data blocks allocation approach to improve MapReduce jobs execution and query performances on multi-nodes clusters, especially Hadoop clusters. Based on k-means clustering method that allows to master the number of clusters through its k parameter, we study the influence of number of clusters on queries execution instead of queries performances with and without data organization. For this, we used well-known, large-scale data analysis benchmark: TPC-H. Our experiments suggest that defining a good data placement on a cluster during the implementation of a data warehouse increase significantly the OLAP cube construction and querying performances.", "venue": "IEEE International Conference on Systems, Man and Cybernetics", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-01", "journal": {"name": "2015 IEEE International Conference on Systems, Man, and Cybernetics", "pages": "80-86"}, "authors": [{"authorId": "1769989", "name": "Billel Arres"}, {"authorId": "1774419", "name": "N. Kabachi"}, {"authorId": "1735803", "name": "Omar Boussaïd"}, {"authorId": "1739726", "name": "F. Bentayeb"}], "citations": [{"paperId": "7cbdc8cbd4e389a541a1761cf5fae977ba255041", "title": "A Survey of Big Data Machine Learning Applications Optimization in Cloud Data Centers and Networks"}, {"paperId": "92fe1cbfb65f6318622508eeec4b76e4485005ec", "title": "Proactive Data Placement for Surveillance Video Processing in Heterogeneous Cluster"}]}
