{"paperId": "1e121f7ad8cd3176ae1653ef689774e43de91007", "publicationVenue": {"id": "aa8f57e2-d5cf-4f0d-afcb-8577fb02e10a", "name": "Kybernetes", "type": "journal", "issn": "0368-492X", "url": "https://www.emerald.com/insight/publication/issn/0368-492X", "alternate_urls": ["http://www.emeraldinsight.com/0368-492X.htm", "http://www.emeraldinsight.com/loi/k"]}, "title": "Analysis of public reactions to the novel Coronavirus (COVID-19) outbreak on Twitter", "abstract": "\nPurpose\nThe novel Coronavirus (COVID-19) pandemic, which started in late December 2019, has spread to more than 200 countries. As no vaccine is yet available for this pandemic, government and health agencies are taking draconian steps to contain it. This pandemic is also trending on social media, particularly on Twitter. The purpose of this study is to explore and analyze the general public reactions to the COVID-19 outbreak on Twitter.\n\n\nDesign/methodology/approach\nThis study conducts a thematic analysis of COVID-19 tweets through VOSviewer to examine people’s reactions related to the COVID-19 outbreak in the world. Moreover, sequential pattern mining (SPM) techniques are used to find frequent words/patterns and their relationship in tweets.\n\n\nFindings\nSeven clusters (themes) were found through VOSviewer: Cluster 1 (green): public sentiments about COVID-19 in the USA. Cluster 2 (red): public sentiments about COVID-19 in Italy and Iran and a vaccine, Cluster 3 (purple): public sentiments about doomsday and science credibility. Cluster 4 (blue): public sentiments about COVID-19 in India. Cluster 5 (yellow): public sentiments about COVID-19’s emergence. Cluster 6 (light blue): public sentiments about COVID-19 in the Philippines. Cluster 7 (orange): Public sentiments about COVID-19 US Intelligence Report. The most frequent words/patterns discovered with SPM were “COVID-19,” “Coronavirus,” “Chinese virus” and the most frequent and high confidence sequential rules were related to “Coronavirus, testing, lockdown, China and Wuhan.”\n\n\nResearch limitations/implications\nThe methodology can be used to analyze the opinions/thoughts of the general public on Twitter and to categorize them accordingly. Moreover, the categories (generated by VOSviewer) can be correlated with the results obtained with pattern mining techniques.\n\n\nSocial implications\nThis study has a significant socio-economic impact as Twitter offers content posting and sharing to billions of users worldwide.\n\n\nOriginality/value\nAccording to the authors’ best knowledge, this may be the first study to carry out a thematic analysis of COVID-19 tweets at a glance and mining the tweets with SPM to investigate how people reacted to the COVID-19 outbreak on Twitter.\n", "venue": "Kybernetes", "year": 2020, "fieldsOfStudy": ["Geography", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-09", "journal": {"name": "Kybernetes", "pages": "1633-1653", "volume": "50"}, "authors": [{"authorId": "1720983760", "name": "S. Noor"}, {"authorId": "2118268124", "name": "Yi Guo"}, {"authorId": "35743551", "name": "Syed Hamad Hassan Shah"}, {"authorId": "1409842348", "name": "Philippe Fournier‐Viger"}, {"authorId": "50878878", "name": "M. Nawaz"}], "citations": [{"paperId": "8fbad70b1ededca9f4fa6ea01b9f58243c153211", "title": "The impact and management of internet-based public opinion dissemination during emergencies: A case study of Baidu News during the first wave of coronavirus disease 2019 (COVID-19)"}, {"paperId": "077483d6d5b0669a75383906875d138695e9adf0", "title": "Research on online public opinion in the investigation of the “7–20” extraordinary rainstorm and flooding disaster in Zhengzhou, China"}, {"paperId": "1180e58441c4cb4e11a0a79bc18d69c5e74ba2d3", "title": "Malaysian views on COVID-19 vaccination program: a sentiment analysis study using Twitter"}, {"paperId": "3c3f0bcd4daacaf125a8f082d29b042f07261e03", "title": "Public opinion communication mechanism of public health emergencies in Weibo: take the COVID-19 epidemic as an example"}, {"paperId": "e4e0cca4e51bab95aa4e7ea539ae273937c83788", "title": "Using alignment-free and pattern mining methods for SARS-CoV-2 genome analysis"}, {"paperId": "83e87b056ca7181fb9bd16064c49dd6bbcb28201", "title": "Medical device companies crisis communication response to stakeholders during COVID-19: pre-crisis stage to new normal"}, {"paperId": "d5a7b548d8fecad2f8f6a21c0795a68feb0dd663", "title": "Value co-creation in business-to-business context: A bibliometric analysis using HistCite and VOS viewer"}, {"paperId": "7ba211a0335bfd08be2d00e3e2f71dc283c9f78f", "title": "Islamic Financial Research Directions During Pandemic: A Bibliometric Analysis"}, {"paperId": "9edffb9074470962bf3f49203e6ec293b7d20583", "title": "Sentiment analysis of Indian Tweets about Covid-19 vaccines"}, {"paperId": "9cdcf302006ba4235cc755dd1dd35ac12aeab437", "title": "Investigating Topic Modeling Techniques to Extract Meaningful Insights in Italian Long COVID Narration"}, {"paperId": "1a35dc6ff5d30040bc717e227ec3df057b59d04f", "title": "Trend Analysis of Public Enthusiasm for COVID-19 Vaccines on Social Media"}, {"paperId": "68fcd59d9504a763aad0de8dfa2270ad87d64b47", "title": "Asynchronous network-based model and algorithm for sentiment analysis of online public opinions"}, {"paperId": "433ad24c592e2f5e16d4210617ef77aef0350aa2", "title": "Mining association rules from COVID-19 related twitter data to discover word patterns, topics and inferences"}, {"paperId": "272363c06a707686a28f2794d8ab77fd4015f385", "title": "The stochastic evolutionary game analysis of public prevention and control strategies in public health emergencies"}, {"paperId": "68d3d4579e886ab6c290c867f9c69535fd28edd1", "title": "NetNMSP: Nonoverlapping maximal sequential pattern mining"}, {"paperId": "3907131b973e9def8fe30f0a9d2ae8e3afb41e45", "title": "Predictors of third-person perceptions about media's influence on vaccination against COVID-19"}, {"paperId": "f3bfbc527d4b47eb019da078f78bc0298c125391", "title": "Using data mining to track the information spreading on social media about the COVID-19 outbreak"}, {"paperId": "e1ee4e4a56c998156b22e9e82e657e843fb98076", "title": "Real-Time Infoveillance of Moroccan Social Media Users’ Sentiments towards the COVID-19 Pandemic and Its Management"}, {"paperId": "9897fc7fea32a6c4754caa4c1da293b1245770d1", "title": "Public perception of COVID-19 vaccines from the digital footprints left on Twitter: analyzing positive, neutral and negative sentiments of Twitterati"}, {"paperId": "8ae4a578daa40f1fcad66db4fffe9650d5b11418", "title": "Capturing the Trajectory of Psychological Status and Analyzing Online Public Reactions During the Coronavirus Disease 2019 Pandemic Through Weibo Posts in China"}, {"paperId": "81a17724b02a7e849929c1a9a354069a7fb029a0", "title": "Performance evaluation of higher education system amid COVID-19: a threat or an opportunity?"}, {"paperId": "331a2f7ea74f9db8e8dac53fc0a15f60a9704818", "title": "Post-pandemic tourism resilience: changes in Italians’ travel behavior and the possible responses of tourist cities"}, {"paperId": "b3cba8c2aa400ddaf066afac18ff5365826a1341", "title": "Investigating COVID-19 News Across Four Nations: A Topic Modeling and Sentiment Analysis Approach"}, {"paperId": "71a337313a6c5b2661eedb17782baf9016ae322c", "title": "Using artificial intelligence techniques for COVID-19 genome analysis"}, {"paperId": "4388ecee6bf7db702c91dbf8ce28c576c15d6164", "title": "TOPIC LABELING AND SENTIMENT ANALYSIS ON COVID-19 NEWS"}, {"paperId": "e4741d8416c05331c3bbba660f791f53545b337e", "title": "Attention-Based Bi-LSTM Model for Arabic Depression Classification"}, {"paperId": "32cd4caddc7799050d2e5594eee3af7160676412", "title": "The Longest Month: Analyzing COVID-19 Vaccination Opinions Dynamics From Tweets in the Month Following the First Vaccine Announcement"}, {"paperId": "f505b84ed35fa5da414869f9f0cd42454106fea8", "title": "COVID-19 Genome Analysis Using Alignment-Free Methods"}, {"paperId": "8eb0dc5b206cf6443a17f4066a95713f9f6caf21", "title": "GRETA THUNBERG AS A VIRAL CHARACTER IN THE TWEETS OF THE INFORMATION SECTOR DURING THE COP25 CLIMATE SUMMIT GRETA THUNBERG COMO PERSONAJE VIRALIZADOR DE LOS TUIT DEL SECTOR INFORMATIVO DURANTE LA CUMBRE DEL CLIMA COP25"}, {"paperId": "0a2b958424aabb7b814206d73191a917f8516c0f", "title": "Thematic Analysis of Twitter as a Platform for Knowledge Management"}, {"paperId": "dcfaf021439ccc675e1f6a169f1d82d4086d7d86", "title": "Social and Institutional Presence of the Presidents of the Americas on social media: An analysis of the Communication on Twitter about COVID-19"}, {"paperId": "c8834e1946a59a872005e84348c0ce1aa6893777", "title": "International Journal of Disaster Risk Reduction"}]}
