{"paperId": "1e1233b768364b2fee28fc722ebdefcf2db477ea", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Robust System Design Using BILP for Wireless Indoor Positioning Systems", "abstract": "In wireless indoor positioning system designs, reference node (RN) failures during the online phase cause received signal strength values to be unavailable. This leads to accuracy performance degradation and a lack of system reliability in smart office systems. Moreover, the major design concern in the reliability of indoor positioning systems under the faulty RNs during the online phase has not been yet investigated in previous works. To address these gaps, we propose a novel mathematical formulation using a Binary Integer Linear Programming (BILP) approach that employs the Simulated Annealing (SA) solution technique. The proposed robust system design aims to put in place a suitable number of RNs and to determine their optimum locations, which may be located on a single floor or on multiple floors. In particular, the proposed system design provisions to support robust operation both during a normal situation and when there are some RN failures. Experimental results and comparative performance evaluation revealed that the proposed robust system design outperformed other system designs and was able to achieve the highest location accuracy performance in both fault-free and RN-failure scenarios. Specifically, when nine of the RNs in a three-story building failed, the proposed system design achieved 84.6%, 54.7%, and 32.9% more accurate performance than the Uniform, the MSMR, and the PhI-Uni, respectively.", "venue": "Mobile Information Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-25", "journal": {"name": "Mob. Inf. Syst.", "pages": "4198504:1-4198504:19", "volume": "2018"}, "authors": [{"authorId": "8794888", "name": "Kriangkrai Maneerat"}, {"authorId": "2139765", "name": "K. Kaemarungsi"}], "citations": [{"paperId": "fd05a9b08ad8efe4809c4356725946b0abbe3798", "title": "Performance Improvement Design of Bluetooth Low Energy-Based Wireless Indoor Positioning Systems"}, {"paperId": "f99059e2ce970446ea4c6cb7973834eba41bc83c", "title": "A Study of Reference Node Placement based on 4- quadrant Node Selection in Ultra Wideband Indoor Positioning System"}, {"paperId": "f5128ba15443d7174e6338110cf4d67e7c5fcd3e", "title": "RoC: Robust and Low-Complexity Wireless Indoor Positioning Systems for Multifloor Buildings Using Location Fingerprinting Techniques"}]}
