{"paperId": "1e15bad19358b089377c2acab8a465bb7fd9afdb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "CephArmor: A Lightweight Cryptographic Interface for Secure High-Performance Ceph Storage Systems", "abstract": "Clustered storage systems are dominant solutions for the era of data-intensive computing. Ceph represents a sustainable clustered storage solution, supporting object, block, and file storage capabilities with no single point of failure. Despite the strong management abilities, security remains a serious concern in the Ceph storage system. To date, authentication and access control are the only supported security protocols in the system. Data confidentiality will be undermined if a malicious insider or outside intruder accesses storage devices. This study proposes a lightweight cryptographic-based interface, CephArmor, for a Ceph storage system to ensure data confidentiality in storage. The proposed method has been integrated into the Ceph stable version, Pacific, and evaluated through 45Drives Storinator servers, a commercial hardware commodity for storage solutions in real-world scenarios. The experimental results denote a nuanced overhead regarding elapsed time, throughput, average operations per second, and latency on a write operation. In contrast, the read operations illustrated near-zero performance overhead for the same metrics.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "127911-127927", "volume": "10"}, "authors": [{"authorId": "2146169551", "name": "Fatemeh Khoda Parast"}, {"authorId": "2194278178", "name": "Brett Kelly"}, {"authorId": "5202788", "name": "S. Hakak"}, {"authorId": null, "name": "Yang Wang"}, {"authorId": "1737718", "name": "K. Kent"}], "citations": [{"paperId": "767291892718bbe8b0ebfead19bce1b64db1e225", "title": "Efficient Braille Transformation for Secure Password Hashing"}]}
