{"paperId": "1e18ba9c34179b33de3f4d33d15728166ab9bb71", "publicationVenue": {"id": "405a8682-2b02-472d-9d89-0115f4e329bc", "name": "Eastern-European Journal of Enterprise Technologies", "type": "journal", "alternate_names": ["Eastern-european J Enterp Technol"], "issn": "1729-3774", "url": "http://journals.uran.ua/eejet", "alternate_urls": ["http://journals.uran.ua/eejet/index"]}, "title": "Development of an adaptive graphic web interface model for editing XML data", "abstract": "The ability of the end user to work with a large amount of data from a large number of heterogeneous sources and at the same time get an effective result from the work is carried out through the use of graphical web interfaces built on the basis of XML technologies that allow displaying any structure of a file presented in XML format. As a data exchange method between applications on the Web, XML still lacks capabilities for identification of web resources and a system that uses them, and capabilities to express the knowledge provided by XLM documents. In this study, a web interface has been developed (a web-based server application), as an XML records editor that provides display forms for the creation and editing of XML documents and is able to adapt to the internal resources of the system used. The technology is based on the XSD data set schema transformation by the way of XSLT transformations. Screen forms are generated on the server side and are provided to the user with all the necessary tools for correct input and/or editing of heterogeneous data. A distinguishing characteristic of this technology is the ability to display both properly and improperly formed XML data. The developed graphical interface allows any application to automatically exchange and read information from other applications without human intervention, which significantly improves performance and ease of use. This software solution could be used both as an independent data building and editing module presented in the XML format, and as a built-in module plugged into various server software for heterogeneous information management systems", "venue": "Eastern-European Journal of Enterprise Technologies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-17", "journal": {"name": "Eastern-European Journal of Enterprise Technologies"}, "authors": [{"authorId": "2132519862", "name": "A. Mukhitova"}, {"authorId": "51439434", "name": "A. Yerimbetova"}, {"authorId": "104148411", "name": "L. Cherikbayeva"}], "citations": []}
