{"paperId": "1e1bf8b6b8eb2538f8f272cf31d4de02066b8b4b", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "VScan: Efficiently Analyzing Surveillance Videos via Model-joint Mechanism", "abstract": "Identifying key scenes in massive surveillance videos is extremely challenging because these scenes occur rarely while automotive identification using full-feature neural network (NN) models consumes immense computational resources. This paper proposes VScan, an efficient model-joint mechanism that adaptively schedules streams on a light-weight NN model and a full-feature NN model for analyzing videos concurrently. These two combined models with overlapped detectable objects are generic and well-developed. The former model fast scans videos to seek potential interest scenes. Only the streams with identified scenes are further analyzed by the latter model. We provide a model selection approach to select a light-weight model with an appropriate accuracy and high throughput. VScan further determines key parameters to correct predictions at runtime, thus guaranteeing the recall of target scenes. The full-feature model is responsible for ensuring output precision. To maintain a high hardware efficiency and utilization dynamically, VScan uses automatic sampling to reduce unnecessary computations, proposes stream scheduling to maximize hardware usage, and designs GPU scheduling to optimize the data processing flow. Experimental results show that benefitting from the model-joint mechanism and runtime scheduling optimizations, VScan significantly boosts the video processing throughput by up to 15x without key scene loss.", "venue": "International Conference on Parallel Processing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-08-05", "journal": {"name": "Proceedings of the 48th International Conference on Parallel Processing"}, "authors": [{"authorId": "2111574765", "name": "Chen Zhang"}, {"authorId": "2057768419", "name": "Q. Cao"}, {"authorId": "152551122", "name": "Jie Yao"}, {"authorId": "152316551", "name": "Yuanyuan Dong"}, {"authorId": "1680830", "name": "Puyuan Yang"}], "citations": [{"paperId": "db495bb31b8b50bef1e6b3768a3bbaca6b783531", "title": "Handheld Echocardiography Measurements Concordance and Findings Agreement: An Exploratory Study"}, {"paperId": "f08f09c43a287ffd3d7820668be9933f5cb4663e", "title": "ARefine: Efficiently Storing Surveillance Videos via Accuracy-aware Refining Mechanism"}, {"paperId": "c5c5ab4b519441782da687a555eda34d164738df", "title": "Palpable Breast Lump Triage by Minimally Trained Operators in Mexico Using Computer-Assisted Diagnosis and Low-Cost Ultrasound"}]}
