{"paperId": "1e215b8615b058df5b389fc0396682111f32b43c", "publicationVenue": {"id": "a4fe6708-e23e-4db0-a292-0ef7ae2d2aa5", "name": "Nordic Conference on Human-Computer Interaction", "type": "conference", "alternate_names": ["NordiCHI", "Nord Conf Human-computer Interact"]}, "title": "Futures for Health Research Data Platforms From the Participants’ Perspectives", "abstract": "In clinical cohort studies, researchers analyse the life history of population groups to understand the evolution of diseases. Health research data platforms came to facilitate such studies as they allow multiple projects to share access to cohorts’ non-identifiable health information. Some latest initiatives are also starting to include mobile-generated data in their research programmes. Although seemly beneficial, it is not yet clear how potential participants feel about contributing to the new platforms: there is a need to investigate potential factors related to the acceptance in this specific context. In this paper, previous works from related contexts were brought together and, along with a qualitative study, composed a participant-centred perspective of enablers and barriers for contribution. We found that there is an apparent misalignment between current implementations and participants’ preferences, leading us to propose design guidelines for future developments which can make participation more ethical and engaging.", "venue": "Nordic Conference on Human-Computer Interaction", "year": 2020, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-10-25", "journal": {"name": "Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society"}, "authors": [{"authorId": "10799141", "name": "G. N. Vilaza"}, {"authorId": "21215935", "name": "Raju Maharjan"}, {"authorId": "144095233", "name": "D. Coyle"}, {"authorId": "1731746", "name": "J. Bardram"}], "citations": [{"paperId": "93cd34e9531ea01c8e073d351dc940e16f86eee1", "title": "SoK: The Gap Between Data Rights Ideals and Reality"}, {"paperId": "692f322e0bdfd80778ae5c7b1e4415b87f73d629", "title": "Artificially Intelligent Technology for the Margins: A Multidisciplinary Design Agenda"}]}
