{"paperId": "1e229686af34a4713660974e9afe8f295daa7a67", "publicationVenue": null, "title": "CloneHadoop: Process Cloning to Reduce Hadoop's Long Tail", "abstract": "Recent advances in distributed computing have enabled large-scale data processing on high volumes of data with MapReduce. However, the overall runtime of such applications is dependent on the slowest subtask at the tail end of the work queue. Current approaches mitigate this effect by scheduling redundant speculative attempts of straggler tasks. However, speculative attempts have to recompute work already done by the original task. This often prevents late speculations from completing before the straggling task. This work promotes a novel speculation approach via process cloning to avoid redundant computations transparent to users. But speculation requires consistency between task attempts and results in divergent execution of subtasks. The work contributes (1) a process cloning approach for speculative execution, (2) mechanisms to maintain consistency and recover complex components, and (3) an integration of cloning and recovery into Apache Hadoop with optimizations to alleviate resource bottlenecks. In experiments, cloning benefits straggling tasks with runtime reductions of up to 25% on jobs with larger tasks. Our solution scales with different task and problem sizes and is robust across different runtime distributions of straggler tasks.", "venue": "2018 IEEE/ACM 5th International Conference on Big Data Computing Applications and Technologies (BDCAT)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE/ACM 5th International Conference on Big Data Computing Applications and Technologies (BDCAT)", "pages": "11-20"}, "authors": [{"authorId": "30978939", "name": "Sarthak Kukreti"}, {"authorId": "145637373", "name": "F. Mueller"}], "citations": [{"paperId": "eabc7e31bca6c59236e1b5e2a4aec2cfbde2e58d", "title": "Prebaking runtime environments to improve the FaaS cold start latency"}, {"paperId": "ab1c0062964a2df3d7f8d11da4a774530286b801", "title": "Prebaking Functions to Warm the Serverless Cold Start"}]}
