{"paperId": "1e23ebfcc56bf9565e7a9ee67176aa9965e122d8", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Novel MA-VFBC Based Deployment of Obstacle-Avoiding Scattered Sensors for Region-of-Interest Incidence Monitoring", "abstract": "The deployment of mobile and adaptive virtual force barrier coverage (MA-VFBC) classification scheme using a mobile emergency response and command interface (MERCI) platform that is functionally implemented to track and report incidences and consequent collateral damages to infrastructures within a region of interest (ROI) is proposed. Considering the enormous use of the global positioning system (GPS) devices for location data-gathering and processing, and its inherent limitations, the proposed GUI-based MA-VFBC platform is implemented using self-deploying and obstacle-avoiding scattered mobile sensor nodes. The GPS service is kept as alternatives, since only initial co-ordinates from where the deployed sensor starts to move and the maximum boundary location of the target location is considered. The practical experimentation work appraises the use and feel of the (MERCI) platform when integrated with the proposed novel MA-VFBC path-tracking classification schemes, while the simulation work investigates evident real-time system reliability issues as direction of node deployment with path distances, system computation time and system overheads in the presence of dissimilar multiple obstacles.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "3065-3075", "volume": "8"}, "authors": [{"authorId": "148355914", "name": "Williams-Paul Nwadiugwu"}, {"authorId": "120704782", "name": "Jae-Min Lee"}, {"authorId": "72657985", "name": "Dong-Seong Kim"}], "citations": [{"paperId": "f094c7906143a57335ce10e5ee3dd6246b9bbc87", "title": "On the interest of artificial intelligence approaches in solving the IoT coverage problem"}, {"paperId": "b65191e59f616226eb45075566516cf4ae173146", "title": "Neural-Network-Assisted Packet Accelerators for Internet of Things Network Systems"}, {"paperId": "ed9ae1ac94f17661fb8c49bde8cea37332367bf4", "title": "Prioritized-MAC Model for Intelligent UAV-to-BS Communication in Industrial-WSN Systems"}, {"paperId": "283309afa86f17acc0a080e3d19c7ed9fbe71e7a", "title": "Precise-Point-Positioning Estimations for Recreational Drones Using Optimized Cubature-Extended Kalman Filtering"}]}
