{"paperId": "1e2ae39a47f0e78bab452df092f10f7e1d4be740", "publicationVenue": {"id": "d73da5c1-25a6-434d-9613-27fb2114cbb8", "name": "Advance in Civil Engineering", "type": "journal", "alternate_names": ["Adv Civ Eng", "Advances in Civil Engineering"], "issn": "2707-3262", "alternate_issns": ["1687-8086"], "url": "https://www.sciscanpub.com/journals/ace", "alternate_urls": ["http://www.hindawi.com/journals/ace/contents.html", "https://www.hindawi.com/journals/ace/2017/8987626/", "https://www.hindawi.com/journals/ace/"]}, "title": "Implementation of Parallel K-Means Algorithm to Estimate Adhesion Failure in Warm Mix Asphalt", "abstract": "Warm Mix Asphalt (WMA) and Hot Mix Asphalt (HMA) are prepared at lower temperatures, making it more susceptible to moisture damage, which eventually leads to stripping due to the adhesion failure. Moreover, the assessment of the adhesion failure depends on the expertise of the investigator’s subjective visual assessment skills. Nowadays, image processing has gained popularity to address the inaccuracy of visual assessment. To attain high accuracy from image processing algorithms, the loss of pixels plays an essential role. In high-quality image samples, processing takes more execution time due to the greater resolution of the image. Therefore, the execution time of the image processing algorithm is also an essential aspect of quality. This manuscript proposes a parallel k means for image processing (PKIP) algorithm using multiprocessing and distributed computing to assess the adhesion failure in WMA and HMA samples subjected to three different moisture sensitivity tests (dry, one, and three freeze-thaw cycles) and fractured by indirect tensile test. For the proposed experiment, the number of clusters was chosen as ten (k = 10) based on k value and cost of k means function was computed to analyse the adhesion failure. The results showed that the PKIP algorithm decreases the execution time up to 30% to 46% if compared with the sequential k means algorithm when implemented using multiprocessing and distributed computing. In terms of results concerning adhesion failure, the WMA specimens subjected to a higher degree of moisture effect showed relatively lower adhesion failure compared to the Hot Mix Asphalt (HMA) samples when subjected to different levels of moisture sensitivity.", "venue": "Advance in Civil Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-04", "journal": {"name": "Advances in Civil Engineering"}, "authors": [{"authorId": "145010679", "name": "M. N. Akhtar"}, {"authorId": "1828469", "name": "W. Ahmed"}, {"authorId": "102126581", "name": "M. Kakar"}, {"authorId": "3275020", "name": "E. A. Bakar"}, {"authorId": "2228864103", "name": "Abdul Rahim Othman"}, {"authorId": "118036075", "name": "M. Bueno"}], "citations": [{"paperId": "d73637844379a6c0a2fe3a28a754ab7013be1a89", "title": "Smart Sensing with Edge Computing in Precision Agriculture for Soil Assessment and Heavy Metal Monitoring: A Review"}, {"paperId": "f030833755d02686cf4464d88e21181fa6471740", "title": "Estimation of river bathymetry and spatial distribution of precipitation and their uncertainties"}, {"paperId": "fc843c9d51fca63b4884fccd4fb824c55281d1c9", "title": "Development of Standstill Monitoring System (SMS) for Inhouse Agriculture Product Application"}, {"paperId": "70c8068e33b7052a526892551a7f3cd495563ea9", "title": "Image Processing of UAV Imagery for River Feature Recognition of Kerian River, Malaysia"}]}
