{"paperId": "1e46cd606a0db48cdcc839687e9dbdac1a47f1e7", "publicationVenue": {"id": "d66cff25-03a5-432c-b3c8-fbdc87233070", "name": "Methods in Ecology and Evolution", "type": "journal", "alternate_names": ["Method Ecol Evol"], "issn": "2041-210X", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)2041-210X", "alternate_urls": ["http://www.methodsinecologyandevolution.org/view/0/index.html"]}, "title": "Machine learning applications in river research: Trends, opportunities and challenges", "abstract": "As one of the earth's key ecosystems, rivers have been intensively studied and modelled through the application of machine learning (ML). With the amount of large data available, these computer algorithms are ever increasing in numerous fields, although there is ongoing scepticism and scholars still question the actual impact and deliverables of algorithms. This study aims to provide a systematic review of the state‐of‐the‐art ML‐based techniques, trends, opportunities and challenges in river research by applying text mining and automated content analysis. Unsupervised and supervised learning have dominated river research while neural networks and deep learning have also gradually gained popularity. Matrix factorisation and linear models have been the most popular ML algorithms, with around 1300 and 800 publications on these topics in 2020 respectively. In contrast, river researchers have had few applications in multiclass and multilabel algorithm, associate rule and Naïve Bayes. The current article proposes an end‐to‐end workflow of ML applications in river research in order to tackle major ML challenges, including four steps: (1) data collection and preparation; (2) model evaluation and selection; (3) model application; and (4) feedback loops. Within this workflow, river modellers have to balance numerous trade‐offs related to model traits, such as complexity, accuracy, interpretability, bias, data privacy and accessibility and spatial and temporal scales. Any choices made when balancing the trade‐offs can lead to different model outcomes affecting the final applications. Hence, it is necessary to carefully consider and specify modelling goals, understand the data collected and maintain feedback loops in order to continuously improve model performance and eventually reach the research objectives. Moreover, it remains crucial to address the users' needs and demands that often entail additional elements, such as computational cost, development time and the quantity, quality and compatibility of data. Furthermore, river researchers should account for new technologies and regulations in data collection and protection that are transforming the development and applications of ML, most notably data warehouse and information management with multiple‐cycles that are becoming a cornerstone of the integration of ML in decision‐making in river and ecosystem management.", "venue": "Methods in Ecology and Evolution", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-17", "journal": {"name": "Methods in Ecology and Evolution", "pages": "2603 - 2621", "volume": "13"}, "authors": [{"authorId": "48625512", "name": "Long T. Ho"}, {"authorId": "47383249", "name": "P. Goethals"}], "citations": [{"paperId": "0f06dfe73ea9597e94889644092c1f9ae5318916", "title": "Hydrological dynamics of the Kalisindh and Parbati Rivers: An integrated analysis in the context of the Eastern Rajasthan Canal Project (ERCP)"}, {"paperId": "e8140a9192bd26b24868b0bf10bf31483b6c4db8", "title": "Diagnosis of Schizophrenia from EEG signals Using ML Algorithms"}, {"paperId": "983f42ed3c17d587f0391955dbdcb53bd6ef7ec0", "title": "Modeling greenhouse gas emissions from riverine systems: A review."}, {"paperId": "6400b2ddf04026fd70fafc73d0bc2a0bbe6ef03b", "title": "Rapid environmental flow assessment for sustainable water resource management in Tanzania's Lower Rufiji River Basin: A scoping review"}, {"paperId": "0815cd7c6ff36bce4a613525c17a01c156963e1f", "title": "A systematic review of industrial wastewater management: Evaluating challenges and enablers."}, {"paperId": "acafa400f7451ad44fcf9c83e221bcc80b26c87c", "title": "Integrating Open-Source Datasets to Analyze the Transboundary Water–Food–Energy–Climate Nexus in Central Asia"}, {"paperId": "c759b5f9bdacb0360962cda9d91324b9f634699c", "title": "Unravelling spatiotemporal N2O dynamics in an urbanized estuary system using natural abundance isotopes"}, {"paperId": "6030ffc9a1fd9ccea7cdc7d32535279e4d5686d0", "title": "An Automated Machine Learning Approach for Detecting Anomalous Peak Patterns in Time Series Data from a Research Watershed in the Northeastern United States Critical Zone"}, {"paperId": "e9b1e9714d0dd7aacdc6d74de42465c2bd9b395c", "title": "Global patterns and drivers of lead concentration in inland waters"}, {"paperId": "a94ae94012f09ab46adb13ef93882c71614231d7", "title": "Impact of salinity gradient, water pollution and land use types on greenhouse gas emissions from an urbanized estuary."}, {"paperId": "e0ccbf7549d210dca59fdafadf259ed0bae96b05", "title": "Decision Support Framework for Optimal Reservoir Operation to Mitigate Cyanobacterial Blooms in Rivers"}, {"paperId": "1cecea6e700c4f4cc50b1c833771c10828910f3e", "title": "Realising the promise of large data and complex models"}, {"paperId": "b2ec2fe804b77f5ac0c01c5e20f77f6b10fc83a4", "title": "Determination of River Hydromorphological Features in Low-Land Rivers from Aerial Imagery and Direct Measurements Using Machine Learning Algorithms"}]}
