{"paperId": "1e5a3848edba626cb0d5dd749c73027b7eb53575", "publicationVenue": {"id": "bc7e8442-1b7b-4292-aa69-f0c2a3cdc985", "name": "Computer Methods in Biomechanics and Biomedical Engineering", "type": "journal", "alternate_names": ["Comput Method Biomech Biomed Eng"], "issn": "1025-5842", "url": "http://www.tandfonline.com/loi/gcmb20"}, "title": "Heuristic-based channel selection with enhanced deep learning for heart disease prediction under WBAN", "abstract": "Abstract The main intention of this proposal is to design and develop a new heart disease prediction model via WBAN using three stages. The first stage is data aggregation, in which data is scheduled in Time Division Multiple Access manner based on priority level, and the data from the public benchmark datasets are collected representing WBAN. In the second stage, a channel selection is performed using a developed hybrid metaheuristic algorithm named Tunicate Swarm-Sail Fish Optimization (TS-SFO) Algorithm. The main intention of the suggested channel selection algorithm is to solve the multi-objective problem based on certain constraints like Reference Signal Received Quality, Signal to Noise Ratio and channel capacity. The third stage is the heart disease prediction stage, in which the feature extraction and prediction are performed. The data transmitted in the selected channel is used for the feature extraction phase, where the weighted entropy-based statistical feature extraction is developed and extracts the essential statistical features. Then, an enhanced Recurrent Neural Network (RNN) is proposed by tuning certain parameters using the proposed TS-SFO for predicting heart disease with the help of extracted statistical features. Test results show that the flexible design and subsequent tuning of RNN hyper-parameters can achieve a high prediction rate.", "venue": "Computer Methods in Biomechanics and Biomedical Engineering", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-14", "journal": {"name": "Computer Methods in Biomechanics and Biomedical Engineering", "pages": "1429 - 1448", "volume": "25"}, "authors": [{"authorId": "2154373466", "name": "V. Muthu Ganesh"}, {"authorId": "72758634", "name": "Janakiraman Nithiyanantham"}], "citations": [{"paperId": "5b200ebf89bed4dee5d61fecac0d75db206b6b38", "title": "Comparative Analysis of Datamining Algorithms for Heartbeat Level Prediction"}, {"paperId": "0b74c8b93156799b963595112859d3ec03839861", "title": "An intelligent hybrid classification model for heart disease detection using imbalanced electrocardiogram signals"}, {"paperId": "e60c758c2c8b180b3f379919d0f4c73e4c00b444", "title": "Intelligent Bi-LSTM with Architecture Optimization for Heart Disease Prediction in WBAN through Optimal Channel Selection and Feature Selection"}, {"paperId": "9721fb29645f4223b27677ec6efeddda6080f127", "title": "Two-Tier Cooperation Based High-Reliable and Lightweight Forwarding Strategy in Heterogeneous WBAN"}, {"paperId": "a6bba91e0f2e8a856c30be4945bd0fb8b7b53344", "title": "Smart Wearables for the Detection of Cardiovascular Diseases: A Systematic Literature Review"}, {"paperId": "1bcbf0caa9d7aea0dc445d136e82acc17537d0e6", "title": "A hybrid approach for medical images classification and segmentation to reduce complexity"}]}
