{"paperId": "1e5f5adb7eda2615e41910ba2f3b104c3b801cc5", "publicationVenue": {"id": "be1301a4-812c-4d88-bc36-7764d7f5b5e7", "name": "International Conference on Multimedia Computing and Systems", "type": "conference", "alternate_names": ["Int Conf Multimedia Comput Syst", "ICMCS"]}, "title": "Migration of a relational databases to NoSQL: The way forward", "abstract": "NoSQL databases are designed to solve data processing problems in volume. Growth data today pushes us to think about new concepts and approaches for converting data from a source database to a NoSQL database. This paper describes some approaches, methods of migration, database reverse engineering, and offers a migration approach from a relational database to a Document-oriented database NoSQL (MongoDB). The approach based on the achievement of a data model, from which we proceed to the migration of schema and data mapping, while ensuring the integrity constraints between collections.", "venue": "International Conference on Multimedia Computing and Systems", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-09-01", "journal": {"name": "2016 5th International Conference on Multimedia Computing and Systems (ICMCS)", "pages": "18-23"}, "authors": [{"authorId": "17837784", "name": "A. Alami"}, {"authorId": "2747412", "name": "M. Bahaj"}], "citations": [{"paperId": "d55956596b1c9314c94d579def70c05e221c4f02", "title": "Seamless Transition: Migrating from Relational Databases to Document-Oriented Databases"}, {"paperId": "30dca090796a36e7b7ccc4dfad069b9df7a6bbbf", "title": "Extended Property-level k-vertex Cardinality Constraints Model for Graph Databases"}, {"paperId": "204b47d70712b32f894b1cdcf64c4c32be525187", "title": "Pengembangan Model Migrasi Database Relational ke NoSQL Memanfaatkan Metadata SQL"}, {"paperId": "748a635ea86e236c2d8e2b51f1886ebcccc081b4", "title": "A Flexible Schema for Document Oriented Database (SDOD)"}, {"paperId": "f8620fff3514c21b519e25d7d2a4cb3433e57510", "title": "ADAPTABASE - ADAPTIVE MACHINE LEARNING BASED DATABASE CROSSTECHNOLOGY SELECTION"}, {"paperId": "07810fc3ae8d871e0835d74cf551e43238e5c7cb", "title": "Design and Application of a Containerized Hybrid Transaction Processing and Data Analysis Framework"}, {"paperId": "a5cdec2213988380529132ff6bbfbf0dc59001c9", "title": "Performance Evaluation of Redis and MongoDB Databases for Handling Semi-structured Data"}, {"paperId": "158c4da34ab921c991a17f254d877eb9871b37e0", "title": "Migration from relational to NoSQL database"}, {"paperId": "5e72c9db030c18112b74709329b58c768b28c4d0", "title": "Migration of Relational Database to MongoDB and Data Analytics using Naive Bayes Classifier based on Mapreduce Approach"}, {"paperId": "d8bba09b59f3a3d267b51d4b45c551193215be4c", "title": "Mapping and Conversion between Relational and Graph Databases Models: A Systematic Literature Review"}, {"paperId": "fd50d603d64dd0bf98a7a5e64175fb79c5491acb", "title": "A NEW APPROACH FOR MIGRATION OF A RELATIONAL DATABASE INTO COLUMN-ORIENTED NOSQL DATABASE ON HADOOP"}, {"paperId": "541a33e2152e28e022ea35c498b02c8bd971fe5d", "title": "Migration of relational databases RDB to database for objects db 4 o for schema and data"}]}
