{"paperId": "1e65ecb06e4adee88bb06f84be8f88b1a1515709", "publicationVenue": null, "title": "Interpreting the Nature of Rainfall with AI and Big Data Models", "abstract": "Rainfall prediction is one of the most significant and testing task in the cutting edge world. When all is said in done, atmosphere and rainfall are profoundly non-linear and confounded marvels, which require propelled PC demonstrating and recreation for their precise prediction. An Artificial Neural Network (ANN) can be utilized to foresee the conduct of such nonlinear frameworks. Right now, huge information architecture for street trac prediction in enormous metropolitan regions is proposed. The practical attributes of the architecture, that permits preparing of information from different sources, for example, urban and between urban trac information streams and web based life, is explored. Moreover, its calculated plan utilizing best in class computing technologies is figured it out.", "venue": "2020 International Conference on Intelligent Engineering and Management (ICIEM)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-06-01", "journal": {"name": "2020 International Conference on Intelligent Engineering and Management (ICIEM)", "pages": "306-310"}, "authors": [{"authorId": "1860675355", "name": "M. Siddiqui"}, {"authorId": "7987831", "name": "Rajeev Kumar"}], "citations": [{"paperId": "d3418273aaab4cfee81ae99a54d2022ace9f0961", "title": "Intelligent model to image enrichment for strong night-vision surveillance cameras in future generation"}, {"paperId": "b529676a5f967ef079ba41e98f68b65ad0e95184", "title": "Cloud–edge cooperation for meteorological radar big data: a review of data quality control"}, {"paperId": "645575d52821129e224cae7daaf4751095172793", "title": "Design of a Structured Hypercube Network Chip Topology Model for Energy Efficiency in Wireless Sensor Network Using Machine Learning"}, {"paperId": "96b2b14ca49738f79a2884a248c337551b2e58c7", "title": "A Framework of Web Mining Algorithm-Based Hidden Pattern in India E-Government Application Using Blockchain Technology"}]}
