{"paperId": "1e6f174a8df7ac1f4baf9edc24257075e6bebcbd", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Adaptive Density-Sensitive Similarity Measure Based Spectral Clustering Algorithm and Its Parallelization", "abstract": "The clustering effect of the spectral clustering algorithm depends on the calculation of the similarity between samples. Although a better clustering effect of the spectral clustering algorithm can be obtained using the Gaussian kernel function to calculate the similarity between samples, it relies on the setting of the kernel parameter. Therefore, an adaptive density-sensitive similarity measure based spectral clustering (DSSC) algorithm is proposed for improving the clustering effect. Specifically, firstly, the Euclidean distances between samples are calculated to get the nearest neighbors of each sample. Secondly, the standard deviation of distances between each sample and its nearest neighbors is calculated as the density parameter. Thirdly, the density-sensitive distances between each sample and its nearest neighbors are calculated. Finally, the similarities between each sample and its nearest neighbors are calculated to construct a similarity matrix. In addition, the proposed DSSC algorithm is parallelized on Dask distributed parallel computing platform with CPU+GPU, which can improve the computational efficiency of the DSSC algorithm by taking full advantage of the CPU and GPU resources. A series of experiments are conducted to verify the effectiveness of the proposed DSSC algorithm on several synthetic datasets and UCI datasets, and the results show that the DSSC algorithm not only achieves satisfactory clustering results, but also obtains better efficiency of performing large-scale clustering analysis.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "128877-128888", "volume": "9"}, "authors": [{"authorId": "2116290457", "name": "Gen Zhang"}, {"authorId": "2053671015", "name": "Lanjun Wan"}, {"authorId": "2058266171", "name": "Kun Gong"}, {"authorId": "1391213354", "name": "Changyun Li"}, {"authorId": "73663733", "name": "Mansheng Xiao"}], "citations": [{"paperId": "50ee6e2aa0cdb6e276dd667e5411ba27004c7d9b", "title": "Parallel Computing Approach for Preprocessing AIS Data in Transshipment Feature Extraction"}]}
