{"paperId": "1e7eebe93aa5295fdb2ec21cd3bc248db5a646a0", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Large-Scale Measurements and Prediction of DC-WAN Traffic", "abstract": "Large cloud service providers have built an increasing number of geo-distributed data centers (DCs) connected by Wide Area Networks (WANs). These DC-WANs carry both high-priority traffic from interactive services and low-priority traffic from bulk transfers. Given that a DC-WAN is an expensive resource, providers often manage it via traffic engineering algorithms that rely on accurate predictions of inter-DC high-priority (delay-sensitive) traffic. In this article, we perform a large-scale measurement study of high-priority inter-DC traffic from Baidu. We measure how inter-DC traffic varies across their global DC-WAN and show that most existing traffic prediction methods either cannot capture the complex traffic dynamics or overlook traffic interrelations among DCs. Building on our measurements, we propose the Interrelated-Temporal Graph Convolutional Network (IntegNet) model for inter-DC traffic prediction. In contrast to prior efforts, our model exploits both temporal traffic patterns and inferred co-dependencies between DC pairs. IntegNet forecasts the capacity needed for high-priority traffic demands by accounting for the balance between resource provisioning (i.e., allocating resources exceeding actual demand) and QoS losses (i.e., allocating fewer resources than actual demand). Our experiments show that IntegNet can keep a very limited QoS loss, while also reducing overprovisioning by up to 42.1% compared to the state-of-the-art and up to 66.2% compared to the traditional method used in DC-WAN traffic engineering.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1390-1405", "volume": "34"}, "authors": [{"authorId": "2144719476", "name": "Zhaohua Wang"}, {"authorId": "50819554", "name": "Zhenyu Li"}, {"authorId": "49349231", "name": "H. Pan"}, {"authorId": "48573548", "name": "Guangming Liu"}, {"authorId": "2144865185", "name": "Yunfei Chen"}, {"authorId": "2152862695", "name": "Qinghua Wu"}, {"authorId": "2181343328", "name": "Gareth Tyson"}, {"authorId": "2209524571", "name": "Gang Cheng"}], "citations": []}
