{"paperId": "1e877ccbe6f0df293262873e63f08f9a13f4b1f6", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Enhancing the Internet of Things with Knowledge-Driven Software-Defined Networking Technology: Future Perspectives", "abstract": "The Internet of Things (IoT) connects smart devices to enable various intelligent services. The deployment of IoT encounters several challenges, such as difficulties in controlling and managing IoT applications and networks, problems in programming existing IoT devices, long service provisioning time, underused resources, as well as complexity, isolation and scalability, among others. One fundamental concern is that current IoT networks lack flexibility and intelligence. A network-wide flexible control and management are missing in IoT networks. In addition, huge numbers of devices and large amounts of data are involved in IoT, but none of them have been tuned for supporting network management and control. In this paper, we argue that Software-defined Networking (SDN) together with the data generated by IoT applications can enhance the control and management of IoT in terms of flexibility and intelligence. We present a review for the evolution of SDN and IoT and analyze the benefits and challenges brought by the integration of SDN and IoT with the help of IoT data. We discuss the perspectives of knowledge-driven SDN for IoT through a new IoT architecture and illustrate how to realize Industry IoT by using the architecture. We also highlight the challenges and future research works toward realizing IoT with the knowledge-driven SDN.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "47001856", "name": "Yuhong Li"}, {"authorId": "1757837", "name": "Xiang Su"}, {"authorId": "1934437", "name": "A. Ding"}, {"authorId": "5650249", "name": "Anders Lindgren"}, {"authorId": "2109321779", "name": "Xiaoli Liu"}, {"authorId": "1769001", "name": "C. Prehofer"}, {"authorId": "1745217", "name": "J. Riekki"}, {"authorId": "2627161", "name": "R. Rahmani"}, {"authorId": "1759241", "name": "Sasu Tarkoma"}, {"authorId": "2026274608", "name": "Pan Hui"}], "citations": [{"paperId": "7e2a32c4614e892ed866b1f1405f702de41b4d24", "title": "An Adaptive State Consistency Architecture for Distributed Software-Defined Network Controllers: An Evaluation and Design Consideration"}, {"paperId": "3aeddea2a1db53facc8e7d448a3bb01e68b321fe", "title": "Residue Number System Based SDN Routing Optimization Algorithm"}, {"paperId": "52b5cf7645421f80f3db725b875cfba8da004288", "title": "Secure routing in the Internet of Things (IoT) with intrusion detection capability based on software-defined networking (SDN) and Machine Learning techniques"}, {"paperId": "8c1cafc4d278cd33f06565a0eb6caa4f46c9e7bd", "title": "A Review of Blockchain Technology in Knowledge-Defined Networking, Its Application, Benefits, and Challenges"}, {"paperId": "483bed07b51f1c4cf5aa900c7698ce297db0607e", "title": "A Comprehensive Survey on Knowledge-Defined Networking"}, {"paperId": "88d3f0af5865a18660132d37cb4666a01d59380b", "title": "Enhancing Performance of Wide Area CIoT SDN by US-ML Based Optimum Controller Placement"}, {"paperId": "cb49cc47daeec33f2fb9697d4918431c9aa9691d", "title": "Lightweight Model for Botnet Attack Detection in Software Defined Network-Orchestrated IoT"}, {"paperId": "bd7e3dca64d40ed9c6db8d090c2dd1caad9d927a", "title": "Review of Botnet Attack Detection in SDN-Enabled IoT Using Machine Learning"}, {"paperId": "d1a145fb6c682dfe43896b45ce5b6173b8b9a6b1", "title": "Empowering SDN-Docker Based Architecture for Internet of Things Heterogeneity"}, {"paperId": "21d311885484a828373c9eec894838e738dc4eac", "title": "Multi-Controller Model for Improving the Performance of IoT Networks"}, {"paperId": "40ccd98d6dd0e203406cfa93c2f63bf548f61397", "title": "The Impact of Agricultural Information System on Agricultural Product Trading Efficiency Using Internet of Things Technology"}, {"paperId": "e3385430baf3bb7c81a50d9f62baf592f938c2f3", "title": "An evolutionary computing‐based energy‐efficient solution for IoT‐enabled software‐defined sensor network architecture"}, {"paperId": "788390258d53e4ac313c75c1d39b79d06321f630", "title": "Non-Pharmaceutical Interventions against COVID-19 Pandemic: Review of Contact Tracing and Social Distancing Technologies, Protocols, Apps, Security and Open Research Directions"}, {"paperId": "9b686bc68ec195fd820bc8bbc80154d72750e8f4", "title": "Designing Automated Deployment Strategies of Face Recognition Solutions in Heterogeneous IoT Platforms"}, {"paperId": "ccb249546cc68632e8f7c46e8013c7c661e0cbed", "title": "Network Traffic Prediction via Deep Graph-Sequence Spatiotemporal Modeling Based on Mobile Virtual Reality Technology"}, {"paperId": "77cd05f70b8e870ab8d2cd6b311923ac9dfa58fa", "title": "Edge computing in SDN-IoT networks: a systematic review of issues, challenges and solutions"}, {"paperId": "48e4958d593cc0a84f745153b376b3547361d1a0", "title": "Research and Development of Delay-Sensitive Routing Tensor Model in IoT Core Networks"}, {"paperId": "beb1a5bfded4ab81f8d0f584b2b4294208fc23b6", "title": "BAMSim Simulator"}, {"paperId": "86328557c26ba347b05f948fa0d1a99d46184de3", "title": "SSHS: SDN seamless handover system among LAN access points"}, {"paperId": "ff5090542b84e00e83a8bcf2466d65c567d43b24", "title": "Application of Internet of Things Technology in Garment Design"}, {"paperId": "73468866f1a28b6ee93189781292f5352e641310", "title": "Inferring Flow Table State through Active Fingerprinting in SDN Environments: A Practical Approach"}, {"paperId": "00267bf167282620204529effa0f395a85e1458c", "title": "A Survey on 5G Architecture and Security Scopes in SDN and NFV"}]}
