{"paperId": "1e8f18a528c3fb63c8a37456cb98c25dc7ad9d1c", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "Proactive content caching in edge computing environment: A review", "abstract": "Edge computing environment provides processing capability and computing at the network edge and close to users. Edge equipment includes small data centers that locally perform process and content delivery. Therefore, edge equipment management has received much attention due to the rapid growth of information and resources limitations. The content caching and proactive caching techniques are management methods of edge equipment resources. We recently witnessed the development of proactive caching mechanisms that have a crucial enabler in improving heavy traffic, energy, and bandwidth. Also, it has huge potential to increase the quick response time to users' requests that today, these services are demanded by many users and applications. This article prepares a systematic literature review content caching approach in the edge computing environment. The purpose of this study is to survey the research done on the proactive caching strategies in the edge computing environment to identify subjects that must be emphasized more in current and future research paths. This research has studied 71 articles divided into three classes: model‐based, machine‐learning‐based, and heuristic‐based. Next, we discuss content caching approaches based on critical factors such as performance metrics, case studies, utilized techniques, assessment tools, advantages, and disadvantages. Finally, open issues and challenges are presented, and the survey is concluded.", "venue": "Software, Practice & Experience", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-23", "journal": {"name": "Software: Practice and Experience", "pages": "811 - 855", "volume": "53"}, "authors": [{"authorId": "2137444863", "name": "Rafat Aghazadeh"}, {"authorId": "2752252", "name": "Ali Shahidinejad"}, {"authorId": "1409470101", "name": "Mostafa Ghobaei-Arani"}], "citations": [{"paperId": "53311c4f7c4a77c15b3df185433514515166cfe0", "title": "Labeled graph partitioning scheme for distributed edge caching"}, {"paperId": "ac69c0c7e49fbbbc6ea7c7da8d0890f8c5a2a3e7", "title": "Object counting in remote sensing via selective spatial‐frequency pyramid network"}, {"paperId": "e097ebf454256a0d0082fcdd27eb24fa11ee4179", "title": "Edge Computing on IoT for Machine Signal Processing and Fault Diagnosis: A Review"}, {"paperId": "58578cd99a4499e8a5f1b2082339f8b2dc41a3a6", "title": "Blockchain-Based Distributed Caching with replication for Efficient Service Provision in Edge-cloud Environments"}, {"paperId": "126ab8fa66d0843fa6f1581f813e79bc43fc3bca", "title": "Toward caching techniques in edge computing over SDN-IoT architecture: a review of challenges, solutions, and open issues"}, {"paperId": "38995eb15da288665aa873a36feaba874e716d78", "title": "An autonomous proactive content caching method in edge computing environment: a learning-based approach"}, {"paperId": "8874334eff9a2b60774f94d924c0b8e21e7a11bc", "title": "Collaborative Caching in Edge Computing via Federated Learning and Deep Reinforcement Learning"}, {"paperId": "aa2b06d528ae7123e8558d285b53369545c73e6d", "title": "Joint Mobile Edge Caching and Pricing: A Mean-Field Game Approach"}]}
