{"paperId": "1e931b881d247630fd0947c15ed4679c9c0946a6", "publicationVenue": {"id": "a88140cf-3ca8-46c2-b1f7-446f137cf336", "name": "Frontiers in Education Conference", "type": "conference", "alternate_names": ["FIE", "Front Educ Conf"], "url": "http://fie-conference.org/"}, "title": "Designing and Developing a Data Science Programme in Bhutan", "abstract": "Academic programme development primarily focuses on a product rather than a process. Thus, the dynamics among stakeholders and processes while designing and developing a programme receive little attention and are rarely studied. This study discusses the process of developing a four-year undergraduate data science programme at Sherubtse College, Royal University of Bhutan, through the analytic lens of routine dynamics. Routines are recurrent, recognisable action patterns enacted by different interdependent actors to accomplish a task. A need assessment survey was conducted to garner insights and perspectives of stakeholders on data science. Qualitative coding was employed to analyse and synthesise the survey responses to understand the needs and challenges of data science. Drawing on the survey responses, constructive recommendations from the stakeholders, and insights on data science, the programme committee successfully developed an academic programme that caters to the data science needs and demands in Bhutan. The programme was launched in the autumn academic session of 2021 with 29 students, guided by the aim of equipping students with sound theoretical knowledge and practical skills to perform complex data analytics and operationalise data technologies. This study contributes to the knowledge base of data science, namely the use of routine dynamics as an analytical instrument to study the underlying workflow processes and information exchanges in an undertaking. The methodical description of a programme development process by anchoring on an analytic framework offers valuable information for curriculum developers mandated to produce graduates with know-how in dealing with data of varying volume and variety.", "venue": "Frontiers in Education Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-10-08", "journal": {"name": "2022 IEEE Frontiers in Education Conference (FIE)", "pages": "1-9"}, "authors": [{"authorId": "71026231", "name": "Phub Namgay"}, {"authorId": "108473103", "name": "Pema Wangdi"}, {"authorId": "3001283", "name": "Sangay Thinley"}], "citations": [{"paperId": "602d6b257809a48d185eadf73c7f89a7cf326b35", "title": "FAIRifying STEM Data Ecosystem to Enhance Data Reuse"}]}
