{"paperId": "1e960fcac7ab4c9b3c27facee1d979935e8c159d", "publicationVenue": null, "title": "MONITORING SYSTEM DESIGN BASED ON INTERNET OF THINGS (IOT) AT THE XYZ COMPANY DATA CENTER", "abstract": "XYZ company is an engaged consumer electronics and mobile communications company. The use of information technology plays a significant role in this company to run business. Therefore, XYZ companies need to change the DC environment due to the utilization of information technology to adapt to the increasingly competitive competition. The new solutions are going to expect to benefit from a more efficient IT budget. Currently, there is a monitoring system on the DC that provides alerts in the form of indicators that are difficult to be accessed by PT XYZ because of the location is far from the DC; it is indeed challenging to analyze the cause of the server when experiencing downtime or failure. Monitoring is currently in the form of reports provided by DC service providers. Furthermore, this study aims to design a monitoring system using temperature, humidity, and voltage sensors on DC-based Internet of Things (IoT) to identify the air condition and energy consumption used for maximum server performance. The device used is a DHT11 sensor as a temperature and humidity sensor. The voltage sensor operated here is ZMPT101B, which serves to read voltage values, on the microcontroller side using Arduino that serves to process data read from the sensor. The entire process performed by IoT that is going to be sent by ethernet shield to the database server and visualized using Grafana as a monitoring dashboard. This study explains how IoT is able to measure the temperature, humidity, voltage, and availability service providers offer. The method used for availability measurement is AST to classify the DC tier used. The new solution expected that this research could be an input for companies in monitoring DC SLA offered by service providers to meet the company's needs", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [], "citations": []}
