{"paperId": "1e97d20693570d229c7e3dcb0a4b86015f49119d", "publicationVenue": {"id": "04c27a39-9b93-4b31-961a-c38ec6b40bbc", "name": "IEEE Annual Information Technology, Electronics and Mobile Communication Conference", "type": "conference", "alternate_names": ["IEEE Annu Inf Technol Electron Mob Commun Conf", "Int Conf Workshop Comput Commun", "IEMCON", "International Conference and Workshop on Computing and Communication"]}, "title": "A Cloud-Based System Architecture for Advanced Metering in Smart Cities", "abstract": "Advanced meter infrastructures are changing the way smart metering is made, especially making use of computational tools such as machine learning techniques to improve data processing and analyses. In this work, we present a cloud-based system architecture for advanced electric metering in smart cities, whose purpose is to achieve better management of electric energy use by consumers and an efficient balance between demand and consumption by utilities. In our approach, in addition to energy consumption data (kilowatt-hour), other electrical parameters (e.g., current, power factor, active and reactive power) are collected in real-time from smart meters for storage and deeper analyses in a big data ecosystem. Moreover, we introduce the smart gateway (sGateway), a component of the system architecture to provide local processing and to simplify the communication between smart meters and the cloud processing system.", "venue": "IEEE Annual Information Technology, Electronics and Mobile Communication Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 10th Annual Information Technology, Electronics and Mobile Communication Conference (IEMCON)", "pages": "1087-1091"}, "authors": [{"authorId": "38380768", "name": "F. Pires"}, {"authorId": "1471433988", "name": "Lorena León Quiñonez"}, {"authorId": "1471442307", "name": "Leonardo de Souza Mendes"}], "citations": [{"paperId": "eb5fd72ae8ed10cc5be08532788f507bf525289f", "title": "A Framework for Enabling Cloud Services to Leverage Energy Data"}, {"paperId": "4f2b5657eec4e85c428b90506970a1eff6669755", "title": "Cloudization of Smart Metering and Advanced Metering Infrastructure"}, {"paperId": "f7ce5befdee69b7a0950799573297f66dbc7015e", "title": "Advanced Monitoring Infrastructure System Architecture for Massive Multi-Source Data"}, {"paperId": "0b75fbc6e770f3dc88df2b99aaf7c27205009fd6", "title": "LIKA: Lightweight Identity Based Key Agreement Protocol for Secure Data Transmission in Advanced Metering Infrastructure of Smart Grid"}, {"paperId": "a5d8aa7b7499ab90d9a636b0a870a18b5dd5d15d", "title": "Cloud Computing Smart Metering for the Power Consumption of Houses"}, {"paperId": "0799e24620604416ae2875c88f422bd38143a608", "title": "Regulatory and Market Challenges for Battery Energy Storage Systems Worldwide"}, {"paperId": "e73ec836909e1e43b55e0681ef829dce6106a949", "title": "Performance of Smart Cities Concerning the Use of Internet of Things: A Case Study of Four Indian Himalayan Cities"}, {"paperId": "4d95fc6e48d5e12423b33f131f543b6e3616adcb", "title": "A REVIEW OF CRYPTOGRAPHIC IMPACT IN CYBER-SECURITY ON SMART GRID: THREAT, CHALLENGES AND COUNTERMEASURES"}]}
