{"paperId": "1eb512e609490ef1c4e7930a5f5124c3bad5291e", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Dynamic Tuple Scheduling with Prediction for Data Stream Processing Systems", "abstract": "For data stream processing systems such as Apache Heron, workload imbalance across processing instances often causes significant system performance degradation. To mitigate such issues, Apache Heron leverages a naive throttling-based back-pressure scheme, which may lead to unexpected system disruption. This calls for a finer-grained control to distribute data stream units (tuples) between successive instances, a.k.a. tuple scheduling, which well adapts to data stream variations and workload discrepancy. Besides, the benefits of predictive scheduling to data stream processing systems still remain unexplored. In this paper, we formulate tuple scheduling problem as a stochastic network optimization problem, with careful choices in the granularity of system modeling and decision making. With non-trivial transformation, we decouple the problem into a series of online subproblems. By exploiting unique subproblem structure, we propose POTUS, an efficient, online, and distributed scheduling scheme that employs the power of predictive scheduling but requires only limited system dynamics to achieve a tunable trade-off between communication cost reduction and system queue stability. Theoretical analysis and simulations show that POTUS effectively shortens response time with mild-value of future information, even in the face of misprediction. Our solution is also applicable to other data stream processing systems.", "venue": "Global Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "2107913930", "name": "Xi Huang"}, {"authorId": "144161583", "name": "Ziyu Shao"}, {"authorId": "2152283013", "name": "Yang Yang"}], "citations": [{"paperId": "efa003449ccc508ea58eb40694abb325cc415f48", "title": "Online User-AP Association With Predictive Scheduling in Wireless Caching Networks"}, {"paperId": "aec3c3348d45876ada3125503f61c1c1e524be92", "title": "POTUS: Predictive Online Tuple Scheduling for Data Stream Processing Systems"}, {"paperId": "de27f0fe08c53df202c8119c515841835f46081e", "title": "Online VNF Chaining and Predictive Scheduling: Optimality and Trade-Offs"}, {"paperId": "d72fb0670b9feab8aaec608e6cb3fa72d696bd3c", "title": "Online VNF Chaining and Scheduling with Prediction: Optimality and Trade-Offs"}]}
