{"paperId": "1eb71a48256b3c5f5d8f7f39efbaa1b692b49860", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Use Your INSTINCT: INSTruction optimization usIng Neural bandits Coupled with Transformers", "abstract": "Large language models (LLMs) have shown remarkable instruction-following capabilities and achieved impressive performances in various applications. However, the performances of LLMs depend heavily on the instructions given to them, which are typically manually tuned with substantial human efforts. Recent work has used the query-efficient Bayesian optimization (BO) algorithm to automatically optimize the instructions given to black-box LLMs. However, BO usually falls short when optimizing highly sophisticated (e.g., high-dimensional) objective functions, such as the functions mapping an instruction to the performance of an LLM. This is mainly due to the limited expressive power of the Gaussian process (GP) model which is used by BO as a surrogate to model the objective function. Meanwhile, it has been repeatedly shown that neural networks (NNs), especially pre-trained transformers, possess strong expressive power and can model highly complex functions. So, we adopt a neural bandit algorithm which replaces the GP in BO by an NN surrogate to optimize instructions for black-box LLMs. More importantly, the neural bandit algorithm allows us to naturally couple the NN surrogate with the hidden representation learned by a pre-trained transformer (i.e., an open-source LLM), which significantly boosts its performance. These motivate us to propose our INSTruction optimization usIng Neural bandits Coupled with Transformers} (INSTINCT) algorithm. We perform instruction optimization for ChatGPT and use extensive experiments to show that our INSTINCT consistently outperforms the existing methods in different tasks, such as in various instruction induction tasks and the task of improving the zero-shot chain-of-thought instruction.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-02", "journal": {"name": "ArXiv", "volume": "abs/2310.02905"}, "authors": [{"authorId": "2220591847", "name": "Xiaoqiang Lin"}, {"authorId": "2146045435", "name": "Zhaoxuan Wu"}, {"authorId": "3042111", "name": "Zhongxiang Dai"}, {"authorId": "2255434664", "name": "Wenyang Hu"}, {"authorId": "2253679012", "name": "Yao Shu"}, {"authorId": "2247595390", "name": "See-Kiong Ng"}, {"authorId": "2066231840", "name": "P. Jaillet"}, {"authorId": "40222533", "name": "B. Low"}], "citations": [{"paperId": "29c8a097fa1690936fb6ef232996796d3a299e91", "title": "Efficient Prompting Methods for Large Language Models: A Survey"}, {"paperId": "6c5e9961b6c7139ed33a9bc6775f72e497129534", "title": "Localized Zeroth-Order Prompt Optimization"}, {"paperId": "58f14bc6de4a005b439f38fe11db6e4f95e343bf", "title": "Unleashing the Potential of Large Language Models as Prompt Optimizers: An Analogical Analysis with Gradient-based Model Optimizers"}, {"paperId": "0e4f27827817b39ce13bc180417f9c99e60962c0", "title": "Best Arm Identification for Prompt Learning under a Limited Budget"}]}
