{"paperId": "1eb7c9b3ff245647aaeea944eedeb4a9a410920a", "publicationVenue": null, "title": "Role of Cyber security in Gaming technology", "abstract": "Internet addiction has become a popular entertainment for many youthful people in the modern era due to the Internet's quick development. However, never-ending streams of cyber security concerns have surfaced in online games in recent years, catching the eye of many game developers. The game's common cyber security issues include information leaks and cyberattacks. These issues will cost players money, either directly or indirectly. In order to improve the gaming user experience, many gaming companies are strengthening the safety and stability of their networks or gaming systems. By introducing the background, a few prevalent cyber security threats, and a potential latent solution, this article has investigated the cybersecurity risks in online games. We looked into various types of threats to gauge the degree of cyber security risk related to gaming. The main objective of the study is role of cyber security in Gaming Technology. This research report includes statistics gathered from the Antivirus Security Network, which handles cyber security data from Kaspersky product customers. These numbers show how frequently and how many of our product's users came into contact with gaming-related cybersecurity threats during in the reporting period.", "venue": "2023 3rd International Conference on Advance Computing and Innovative Technologies in Engineering (ICACITE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-12", "journal": {"name": "2023 3rd International Conference on Advance Computing and Innovative Technologies in Engineering (ICACITE)", "pages": "446-451"}, "authors": [{"authorId": "1471794244", "name": "Saumitra Chattopadhyay"}, {"authorId": "117345095", "name": "Dr. Nikhilesh"}, {"authorId": "2067221370", "name": "V. Prakash"}, {"authorId": "2074227904", "name": "M. Tiwari"}, {"authorId": "2168432", "name": "Tripti Tiwari"}, {"authorId": "1573795618", "name": "Dhiraj Kapila"}], "citations": []}
