{"paperId": "1eba5f4d2cee4b6c305fceeb65e5f342d6586489", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Blockchain-Based Key Management and Authentication Scheme for IoT Networks With Chaotic Scrambling", "abstract": "Internet of Things (IoT) systems have the great advantage of connecting massive low energy-consumption devices for the information delivery via wireless channels. However, IoT devices suffer from malicious attacks or eavesdropping due to the broadcasting property of wireless channels. With the aim of enhancing the security performances, we first propose a chaotic scrambler, which utilizes the natural high security property of chaotic sequences being aperiodic and sensitive to initial values, to improve the security of signal transmissions. Then, we propose to utilize the traceable and tamper-proof blockchain to integrate the confidential chaotic key into the chain for user identify management and authentications. Subsequently, theoretical security, reliability and throughput capacities are analyzed, and simulation results are provided to validate the design and the theoretical analysis. Furthermore, we present the practical hardware implementation board for the proposed secure chaotic scrambling following the long range wide area network (LoRaWAN) specifications, which demonstrates that the security performances of IoT devices can be effectively enhanced.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "178-188", "volume": "10"}, "authors": [{"authorId": "2144011596", "name": "Jieheng Zheng"}, {"authorId": "2143837366", "name": "Lin Zhang"}, {"authorId": "2115388667", "name": "Yan Feng"}, {"authorId": "2146253888", "name": "Zhiqiang Wu"}], "citations": [{"paperId": "4a429616d3e2171c032b229504b26e4e9421cd9d", "title": "Experimental Study on Colpitts Chaotic Oscillator-Based Communication System Application for the Internet of Things"}, {"paperId": "6fd078515cf79417dc8a5d78832857cc7dd6be5c", "title": "A lightweight hierarchical key management approach for internet of things"}]}
