{"paperId": "1ebef4a2c67a1678add9eebe051b0cc5b6ef26a4", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Scaph: Scalable GPU-Accelerated Graph Processing with Value-Driven Differential Scheduling", "abstract": "We introduce Scaph, a GPU-accelerated graph system that achieves scale-up graph processing on large-scale graphs that are initially partitioned into subgraphs at the host to enable iterative graph computations on the subgraphs on the GPU. For active subgraphs to be processed on GPU at an iteration, the prior work always streams each in its entirety to GPU, even though only the neighboring information for its active vertices will ever be used. In contrast, Scaph boosts performance signiﬁcantly by reducing the amount of such redundant data transferred, thereby improving the effective utilization of the host-GPU bandwidth drastically. The key novelty of Scaph is to classify adaptively at each iteration whether a subgraph is a high-value subgraph (if it is likely to be traversed extensively in the current and future iterations) or a low-value subgraph (otherwise). Scaph then schedules a sub-graph for graph processing on GPU using two graph processing engines, one for high-value subgraphs, which will be streamed to GPU entirely and iterated over repeatedly, one for low-value subgraphs, for which only the neighboring information needed for its active vertices is transferred. Evaluation on real-world and synthesized large-scale graphs shows that Scaph outperforms the state-of-the-art, Totem (4.12 × ), Graphie (8.93 × ), and Garaph (3.71 × ), on", "venue": "USENIX Annual Technical Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "573-588"}, "authors": [{"authorId": "9135861", "name": "Long Zheng"}, {"authorId": "2116891695", "name": "Xianliang Li"}, {"authorId": "2111093661", "name": "Yaohui Zheng"}, {"authorId": "2108860901", "name": "Yu Huang"}, {"authorId": "144925807", "name": "Xiaofei Liao"}, {"authorId": "145914256", "name": "Hai Jin"}, {"authorId": "2220174", "name": "Jingling Xue"}, {"authorId": "1935346", "name": "Zhiyuan Shao"}, {"authorId": "46485180", "name": "Qiang-Sheng Hua"}], "citations": [{"paperId": "6e419d87084f8cc153f79f6c399e48092ba237b0", "title": "HongTu: Scalable Full-Graph GNN Training on Multiple GPUs"}, {"paperId": "5b36dfc37ae7149936ad05e6575800dece051630", "title": "Design and Implementation of External Storage Large-Scale Graph Computing System"}, {"paperId": "23366f13155e836eb155fe6eeba589c1bf2eac93", "title": "GraphMetaP: Efficient MetaPath Generation for Dynamic Heterogeneous Graph Models"}, {"paperId": "44775b43d0f55d0d8b94beb1fe8b76ad64270cbb", "title": "LightTraffic: On Optimizing CPU-GPU Data Traffic for Efficient Large-scale Random Walks"}, {"paperId": "725195ddc1f74e0ac346ef23891524021115fc13", "title": "Resource scheduling techniques in cloud from a view of coordination: a holistic survey"}, {"paperId": "13cce4bbc706426f67558dd7bf41136513c3e2ce", "title": "GraphFly: Efficient Asynchronous Streaming Graphs Processing via Dependency-Flow"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "3b9e59e91d99a49122124b25d58e8a1a887e448b", "title": "HyTGraph: GPU-Accelerated Graph Processing with Hybrid Transfer Management"}, {"paperId": "f2259b785c76fdd285ae574ba38dd56ca6900865", "title": "Unified-memory-based hybrid processing for partition-oriented subgraph matching on GPU"}, {"paperId": "8c1931e9ae4e790504827db2274667444311ad58", "title": "GraSU: A Fast Graph Update Library for FPGA-based Dynamic Graph Processing"}, {"paperId": "b37c5a96fe2f3389d9fe3addb8812634abb82164", "title": "Grus"}, {"paperId": "ecc64b4c8f5ccc7576aeb0c01b25f149334db6b6", "title": "Graph Processing Scheme Using GPU With Value-Driven Differential Scheduling"}]}
