{"paperId": "1ec59b4fb52f7ba4e6f37313d46fd8327c36e254", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "A guided latent Dirichlet allocation approach to investigate real-time latent topics of Twitter data during Hurricane Laura", "abstract": "Natural disasters cause significant damage, casualties and economical losses. Twitter has been used to support prompt disaster response and management because people tend to communicate and spread information on public social media platforms during disaster events. To retrieve real-time situational awareness (SA) information from tweets, the most effective way to mine text is using natural language processing (NLP). Among the advanced NLP models, the supervised approach can classify tweets into different categories to gain insight and leverage useful SA information from social media data. However, high-performing supervised models require domain knowledge to specify categories and involve costly labelling tasks. This research proposes a guided latent Dirichlet allocation (LDA) workflow to investigate temporal latent topics from tweets during a recent disaster event, the 2020 Hurricane Laura. With integration of prior knowledge, a coherence model, LDA topics visualisation and validation from official reports, our guided approach reveals that most tweets contain several latent topics during the 10-day period of Hurricane Laura. This result indicates that state-of-the-art supervised models have not fully utilised tweet information because they only assign each tweet a single label. In contrast, our model can not only identify emerging topics during different disaster events but also provides multilabel references to the classification schema. In addition, our results can help to quickly identify and extract SA information to responders, stakeholders and the general public so that they can adopt timely responsive strategies and wisely allocate resource during Hurricane events.", "venue": "Journal of information science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-12", "journal": {"name": "Journal of Information Science", "pages": "465 - 479", "volume": "49"}, "authors": [{"authorId": "10396097", "name": "Sulong Zhou"}, {"authorId": "2100696708", "name": "Pengyu Kan"}, {"authorId": "32780423", "name": "Qunying Huang"}, {"authorId": "4162129", "name": "J. Silbernagel"}], "citations": [{"paperId": "640d0e972b1524c1519f2a871757a97abc29e9c0", "title": "Surveillance of coastal biodiversity through social network monitoring"}, {"paperId": "f0949c37c17f483c59d9ac5683f1b81b30178fbe", "title": "Spatiotemporal Insights into Online Public Responses to Disasters in Developed and Underdeveloped Countries"}, {"paperId": "d5a0b512b82015616b4c303b181bd947f42a36c0", "title": "Investigating disaster response for resilient communities through social media data and the Susceptible-Infected-Recovered (SIR) model: A case study of 2020 Western U.S. wildfire season"}, {"paperId": "eb1ba93a1289b02e0a78aac7e1eb09777ec9246e", "title": "Topic Extraction: BERTopic's Insight into the 117th Congress's Twitterverse"}, {"paperId": "b2e977608422ea3ee352e47bb49cbf608071ebce", "title": "Improved BTM topic embedding method for Web text data extraction"}, {"paperId": "2d7874ea2ce91eefbd4ec02ef4c4a3dd428df36c", "title": "Improving fraud detection with semi-supervised topic modeling and keyword integration"}, {"paperId": "f251e03c287e17d1fec4b7a07893ff86e74a1d8f", "title": "Expanding Horizons in HCI Research Through LLM-Driven Qualitative Analysis"}, {"paperId": "d183cbe5d92c769014a4c7c27458641c280afce3", "title": "Exploring Cognitive Sustainability Concerns in Public Responses to Extreme Weather Events: An NLP Analysis of Twitter Data"}, {"paperId": "08fe0f51c0ed0af2ebdef322178a45780b17029a", "title": "CovidTrak: A Vision on Social Intelligence-Empowered COVID-19 Contact Tracing"}, {"paperId": "e3f83449498c30167a0050e0ab869d0d388885dd", "title": "Exploring Public Opinions Toward the Use of Generative Artificial Intelligence Chatbot in Higher Education: An Insight from Topic Modelling and Sentiment Analysis"}, {"paperId": "5558a5f8a57be65427f9381859430c6517237c3b", "title": "Understanding and addressing the resistance towards autonomous vehicles (AVs)"}, {"paperId": "866b56a1a6dd47a779e13407875119b8e5602c99", "title": "Analisis Data Review Hotel di Google Maps Melalui Text Mining (Studi Kasus : Kabupanten Bandung)"}, {"paperId": "9d3364477c96e60d350cd02bede12d048580573d", "title": "Analysis of media content recommendation in the new media era considering scene clustering algorithm"}, {"paperId": "6bcfb28fa5abef46cb280b372af3f26ecfdbc4cf", "title": "Event detection from real-time twitter streaming data using community detection algorithm"}, {"paperId": "1aa576ead41847353f272f4f9f494d21b2fadfc0", "title": "Investigating disaster response through social media data and the Susceptible-Infected-Recovered (SIR) model: A case study of 2020 Western U.S. wildfire season"}, {"paperId": "dc911075c553df48dd7ca7913e3f95794311741b", "title": "Automatic classification of construction safety reports using semi-supervised YAKE-Guided LDA approach"}, {"paperId": "adc1fb147394d8df689f748bb06142ad6907f091", "title": "Conceptual Modeling: Topics, Themes, and Technology Trends"}, {"paperId": "fca1e2053e76e8ceb4bbaeb8163d8bd22fda5b7d", "title": "The wisdom of crowds for improved disaster resilience: a near-real-time analysis of crowdsourced social media data on the 2021 flood in Germany"}, {"paperId": "3eceb2e4bfc06e9577d01abe79d1d2b8de8f4db8", "title": "Impact of extreme weather in production economics: Extracting evidence from user-generated content"}, {"paperId": "998f15ee791c749ddb9bf695a73589b79350a82b", "title": "A systematic review of natural language processing applications for hydrometeorological hazards assessment"}, {"paperId": "794244ab57b26e4cff5e0fd0ac244dd233805961", "title": "COVID-19 and telemedicine: A netnography approach"}, {"paperId": "1bdf6466e987351baf69d30393f325d6ab6f20f9", "title": "Identifying Crisis Response Communities in Online Social Networks for Compound Disasters: The Case of Hurricane Laura and COVID-19"}, {"paperId": "e012fea86a6e9774ff95345acd75158b9ff2619e", "title": "YAKE-Guided LDA approach for automatic classification of construction safety reports"}, {"paperId": "8644027d78a2cebc2050f251d9e80a949089be23", "title": "Nurses’ Work Concerns and Disenchantment During the COVID-19 Pandemic: Machine Learning Analysis of Web-Based Discussions"}, {"paperId": "37c38a0c2687d5480cad113f17a0475238d3a2d9", "title": "Identifying Social Media Conversation Topics Regarding Electric Vehicles in Indonesia Using Latent Dirichlet Allocation"}, {"paperId": "2309afd75f6b5d48a2fe779086e7b86f0c31c5c2", "title": "Impacts of Coastal Infrastructure on Shoreline Response to Major Hurricanes in Southwest Louisiana"}, {"paperId": "52a6f4edb11977d8671e1128d9040917201ffd3f", "title": "Wasted pumpkins: a real Halloween horror story"}, {"paperId": "ce89644fc6c5c13fb741c382ce518901251267b7", "title": "Exploring public attention about green consumption on Sina Weibo: Using text mining and deep learning"}, {"paperId": "bf5dd0f1c58d12d3216d6e6a9e5b2e00b2648120", "title": "Geographic context-aware text mining: enhance social media message classification for situational awareness by integrating spatial and temporal features"}, {"paperId": "9fcc02a305260789d6b8c516f3fa1588fed8f041", "title": "AI-News Personalization System Combining Complete Content Characterization and Full Term Interest Portrayal in the Big Data Era"}, {"paperId": "f2691ae99aee8fe8599b67b1f47207cab1640edb", "title": "Social sensing a volcanic eruption: application to Kīlauea 2018"}, {"paperId": "5a70376bee924e3836b972ff6738f2e99e27127f", "title": "Multi-strategy KOA Algorithm for Optimizing Gated Recurrent Cell Networks in Automatic Writing Scoring Method Design"}]}
