{"paperId": "1ecbf2aedc2000eeb2de36ce57ec2b2f62982212", "publicationVenue": null, "title": "Benchmarking in classification and regression", "abstract": "The article presents an overview of the status quo in benchmarking in classification and nonlinear regression. It outlines guidelines for a comparative analysis in machine learning, benchmarking principles, accuracy estimation, and model validation. It provides references to established repositories and competitions and discusses the objectives and limitations of benchmarking. Benchmarking is key to progress in machine learning as it allows an unprejudiced comparison among alternative methods. This article presents guidelines and best practices for benchmarking in classification and regression. It reviews state‐of‐the‐art approaches in machine learning, establishes benchmarking principles and discusses performance metrics for a sound statistical comparative analysis.", "venue": "WIREs Data Mining Knowl. Discov.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-06-18", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "9"}, "authors": [{"authorId": "143762003", "name": "F. Hoffmann"}, {"authorId": "145492266", "name": "T. Bertram"}, {"authorId": "2351970", "name": "R. Mikut"}, {"authorId": "1915293", "name": "M. Reischl"}, {"authorId": "2644194", "name": "O. Nelles"}], "citations": [{"paperId": "090746c2c7508410a26405175de79bbb6f67abcc", "title": "Methods and applications of machine learning in computational design of optoelectronic semiconductors"}, {"paperId": "cbd4213495651e7f1365a61cb8f2694a6ee83f1a", "title": "Image-Based Plant Disease Classification for the Management of Crop Health"}, {"paperId": "c42c3ee22737f1dbac781e03ab9d55e075fd39f5", "title": "Neutralise: An open science initiative for neutral comparison of two-sample tests."}, {"paperId": "33cbdd8011c05bdec3dd3021f33b48f65af1d811", "title": "Prediction of Antimicrobial Efficacy of Direct Cold Atmospheric Plasma Treatment via Ensemble Learning-based Regression Models"}, {"paperId": "c0f5a743e056b19dc715f6d08e6c226335e04a2b", "title": "Machine Learning Assistive State of Charge Estimation of Li-Ion Battery"}, {"paperId": "c0339ec959f1ce34d0913397926528cfd0e797d3", "title": "A review of machine learning models applied to genomic prediction in animal breeding"}, {"paperId": "579e77b860446024ac6f3e54bbaff76ee01e311b", "title": "An Overview of Supervised Machine Learning Approaches for Applications in Active Distribution Networks"}, {"paperId": "ea2af47823b543c400fff34f2e56de01e62aed64", "title": "An interpretable system for predicting the impact of COVID-19 government interventions on stock market sectors"}, {"paperId": "fd9fc72cf65b1b036ebc5a89cd8c535582c2fcbe", "title": "Application of Machine Learning in the Precise and Cost-Effective Self-Compensation of the Thermal Errors of CNC Machine Tools – A Review"}, {"paperId": "909cc27a5f5a2ed8a11c6ab26f551d9f3b888568", "title": "Analysis of financial pressure impacts on the health care industry with an explainable machine learning method: China versus the USA"}, {"paperId": "382fa5b29892928979eb2a756fb0bac35d95a13c", "title": "problexity - an open-source Python library for binary classification problem complexity assessment"}, {"paperId": "7e19a1e72a1ff5d8cfb837af9004125155fba31a", "title": "CACP: Classification Algorithms Comparison Pipeline"}, {"paperId": "33da53b0aed697396e87bb55b8b14bde28498c58", "title": "Identifying benchmark units for research management and evaluation"}, {"paperId": "d73c5ba03603ad006f4a23d4ea8c2d99cddfe2cc", "title": "Estimation of Elbow Wall Thinning Using Ensemble-Averaged Mel-Spectrogram with ResNet-like Architecture"}, {"paperId": "cd2e8ad7816b8d27f2c0bb53dc1bda44ff240500", "title": "Machine learning techniques for robotic and autonomous inspection of mechanical systems and civil infrastructure"}, {"paperId": "d8aec3bb46c1f9467637970ab2216935eefc9b5a", "title": "Systematic Framework to Predict Early-Stage Liver Carcinoma Using Hybrid of Feature Selection Techniques and Regression Techniques"}, {"paperId": "12c2bbfe62de18e1f6a5767549cbf97c9a58f427", "title": "FRAMEWORK PARA USO DO MONITORAMENTO ESTATÍSTICO DO PROCESSO NA VALIDAÇÃO CONTÍNUA DE MODELOS CLASSIFICATÓRIOS"}, {"paperId": "7116e0f89058a55cafae9e96b6222894a4f0ce48", "title": "A comprehensive survey of imbalanced learning methods for bankruptcy prediction"}, {"paperId": "70edaa01feb72fb938ffb744053c564d163561b5", "title": "Polarity in the Classroom: A Case Study Leveraging Peer Sentiment Toward Scalable Assessment"}, {"paperId": "5c259d75aa0372af7ca54d72b5a9d64e405afa1d", "title": "Machine Learning Enhances the Performance of Bioreceptor-Free Biosensors"}, {"paperId": "f2b6194972addd74009afe3d10478c1bb28e17df", "title": "Improving prediction of COVID-19 evolution by fusing epidemiological and mobility data"}, {"paperId": "11b057472ce37133f583e5ae11b737d8cd2780b5", "title": "Enhancing the prediction of COVID-19 evolution by combining models and data sources"}, {"paperId": "b3a29a3d5d18ab8398ea274a7d7c313d910239da", "title": "On the application of Physically-Guided Neural Networks with Internal Variables to Continuum Problems"}, {"paperId": "ed9613fa69650c973013f56d06e488905eb51425", "title": "Solar Panel Detection within Complex Backgrounds Using Thermal Images Acquired by UAVs"}, {"paperId": "8894ef741bfde9b9dab08adf0d52310d406632ef", "title": "Maschinelles Lernen und Künstliche Intelligenz – Eine Revolution in der Automatisierungstechnik oder nur ein Hype?"}, {"paperId": "53b1873d7c4004e1c5d6921f9068d70d30a5fba1", "title": "Boosting algorithms in energy research: a systematic review"}, {"paperId": "7d29a25d606f460e9fedfbec4afc17945591945c", "title": "Automated design process for hybrid regression modeling with a one-class SVM"}, {"paperId": "32600a5a3988791c7c89932869a9d602c431a5e2", "title": "Ausgewählte Beiträge aus dem GMA-Fachausschuss 5.14 „Computational Intelligence“"}, {"paperId": "14f8316e238008f94c4c1c97a350edd445b5f498", "title": "A white paper on good research practices in benchmarking: The case of cluster analysis"}, {"paperId": "8cfb171ddb7178126dbe2dcefc31c198a32a1641", "title": "Dynamic Warning Signals and Time Lag Analysis for Seepage Prediction in Hydropower Dams"}, {"paperId": "87ec74d847b6c1170aa12855f916759a7dd2e98f", "title": "A Survey of Privacy Risks and Mitigation Strategies in the Artificial Intelligence Life Cycle"}, {"paperId": "348524ba258834f3a6578ece95a391702a29c24c", "title": "Systematic Framework to Predict Early-Stage Liver Carcinoma Using Hybrid of Feature Selection Techniques and Regression Techniques"}, {"paperId": "6097733f319c1656f2c5c213572453e43f8ec458", "title": "Sentiment Analysis in Peer Review"}]}
