{"paperId": "1ed069f94344d4e3ba0743a39cf8b013d02857ca", "publicationVenue": {"id": "31c6e511-cc0b-42e2-901d-97b4b6f6605e", "name": "International Conference on Field-Programmable Logic and Applications", "type": "conference", "alternate_names": ["Field-programmable Log Appl", "Int Conf Field-programmable Log Appl", "Field-Programmable Logic and Applications", "FPL"], "url": "http://www.fpl.org/h/"}, "title": "On-The-Fly Parallel Data Shuffling for Graph Processing on OpenCL-Based FPGAs", "abstract": "Graph processing has attracted much attention recently due to its popularity in many big data analytic applications. With high performance and energy efficiency, FPGAs can be an attractive architecture for graph processing. A number of techniques such as caching using block RAMs (BRAMs) to reduce random accesses of global memory and multiple processing element (PE) instances for high throughput have been explored. OpenCL-based FPGAs natively support a high-level programming paradigm, providing good programmability to developers. However, challenges remain because the run-time dependency introduced by multiple PEs usually cannot be handled efficiently by OpenCL's high-level control granularity. In this paper, we propose a novel on-the-fly parallel data shuffling technique that can be implemented in OpenCL to solve this problem. We have integrated our shuffling technique to an edge-centric graph processing framework which achieves a throughput of more than 1,000 million traversed edges per second (MTEPS) on PageRank, SpMV, BFS and SSSP applications and is even better than existing RTL-based designs.", "venue": "International Conference on Field-Programmable Logic and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 29th International Conference on Field Programmable Logic and Applications (FPL)", "pages": "67-73"}, "authors": [{"authorId": "2109081099", "name": "Xinyu Chen"}, {"authorId": "9406380", "name": "Ronak Bajaj"}, {"authorId": "2118360318", "name": "Yao Chen"}, {"authorId": "1790604", "name": "Jiong He"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "3339059", "name": "W. Wong"}, {"authorId": "1713644", "name": "Deming Chen"}], "citations": [{"paperId": "35f4fb2bbaa1139c077fcdaff76de945297bb47a", "title": "LightRW: FPGA Accelerated Graph Dynamic Random Walks"}, {"paperId": "7e085610d5491c4f981e89b82f5ed883b50fc415", "title": "FNNG: A High-Performance FPGA-based Accelerator for K-Nearest Neighbor Graph Construction"}, {"paperId": "e57b662f537e900f1b8b1da85e604e7e1ff31a23", "title": "Edge-Connected Jaccard Similarity for Graph Link Prediction on FPGA"}, {"paperId": "0a4a944c18b843cfe62950310cc282e46eba489f", "title": "On the Characterization of the Performance-Productivity Gap for FPGA"}, {"paperId": "c3aaf6a9fe86feed0f1e7ed972a6a4439b334066", "title": "Bind the gap: compiling real software to hardware FFT accelerators"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "0de2f7c29a53ae19f5a6bc6b8a898fc770cb6e8f", "title": "ReGraph: Scaling Graph Processing on HBM-enabled FPGAs with Heterogeneous Pipelines"}, {"paperId": "d3bb9e1c3fec528ed9a98fe427ba14b72214ec52", "title": "Programming and Synthesis for Software-defined FPGA Acceleration: Status and Future Prospects"}, {"paperId": "394a3b11dbee1d5ce04e2f3e7f6cdd4ef81e38b1", "title": "Skew-Oblivious Data Routing for Data Intensive Applications on FPGAs with HLS"}, {"paperId": "cbcd6312f4bbaa32635ef92a62b453a005011878", "title": "Demystifying memory access patterns of FPGA-based graph processing accelerators"}, {"paperId": "13d38e22daa7e1b0844e785c4e51dd1789cadc14", "title": "ThunderGP: HLS-based Graph Processing Framework on FPGAs"}, {"paperId": "8c1931e9ae4e790504827db2274667444311ad58", "title": "GraSU: A Fast Graph Update Library for FPGA-based Dynamic Graph Processing"}, {"paperId": "58280c3ff32fc4f0a14937928c81be68a754d85c", "title": "Accelerating data filtering for database using FPGA"}, {"paperId": "8cb35bbf013802218d1c3554051ac5425d91868a", "title": "Exploring FPGA Optimizations in OpenCL for Breadth-First Search on Sparse Graph Datasets"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "fd3b482cc03be30ed11498dc046a8fa53a210b51", "title": "HaoCL: Harnessing Large-scale Heterogeneous Processors Made Easy"}, {"paperId": "f1183597b550700b7ac5b20cc95eee57d252cc7d", "title": "Boyi: A Systematic Framework for Automatically Deciding the Right Execution Model of OpenCL Applications on FPGAs"}, {"paperId": "8a4af4ef0d8beb356ffa009ab96437f833a3dba3", "title": "Transformations of High-Level Synthesis Codes for High-Performance Computing"}, {"paperId": "a4125995dcf898ebadbcf90d4acdc522fad6789e", "title": "Is FPGA Useful for Hash Joins?"}]}
