{"paperId": "1ef30c3104e7cf971f4e15d7751f7d3f5767ba53", "publicationVenue": {"id": "40d6d72b-fb7c-4fa0-98c0-2f72f340fed4", "name": "Iraqi Journal for Computers and Informatics", "type": "journal", "alternate_names": ["Iraqi J Comput Informatics"], "issn": "2313-190X", "url": "http://www.uoitc.edu.iq/ijci1/index.html", "alternate_urls": ["http://ijci.uoitc.edu.iq/"]}, "title": "A STUDY ON DATA STREAMING IN FOG COMPUTING ENVIRONMENT", "abstract": "In lately years, data streaming is become more important day by day, considering technologies employed to servethat manner and share number of terminals within the system either direct or indirect interacting with them.Smart devices now play active role in the data streaming environment as well as fog and cloud compatibility. It is affectingthe data collectivity and appears clearly with the new technologies provided and the increase for the number of theusers of such systems. This is due to the number of the users and resources available system start to employ the computationalpower to the fog for moving the computational power to the network edge. It is adopted to connect system that streamed dataas an object. Those inter-connected objects are expected to be producing more significant data streams, which are produced atunique rates, in some cases for being analyzed nearly in real time. In the presented paper a survey of data streaming systemstechnologies is introduced. It clarified the main notions behind big data stream concepts as well as fog computing. From thepresented study, the industrial and research communities are capable of gaining information about requirements for creatingFog computing environment with a clearer view about managing resources in the Fog.The main objective of this paper is to provide short brief and information about Data Streaming in Fog ComputingEnvironment with explaining the major research field within this meaning.", "venue": "Iraqi Journal for Computers and Informatics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-05-01", "journal": {"name": "Iraqi Journal for Computers and informatics"}, "authors": [{"authorId": "150298440", "name": "Shymaa Mohammed Jameel"}, {"authorId": "2286156374", "name": "Baghdad Iraq Informatics"}, {"authorId": "73335507", "name": "M. Croock"}], "citations": []}
