{"paperId": "1f149656fd3863ba5e648817699a793487a70e1c", "publicationVenue": null, "title": "Multi-layer vario-scale web map comparer with dynamic transitions and visual analytical tool", "abstract": ": This paper presents a web map juxtaposition comparer. Using the comparer, we can place two maps side by side for comparison. The maps of the comparer can contain multiple layers, and each of them can be a multi-scale layer or a vario-scale layer. We enhance the comparer’s visual analytical ability by developing more functionalities, including toggling on/off the layers, tuning the opacities, and swiping to change the maps’ widths. The aim of developing the web map juxtaposition comparer is to carry out usability studies to see if a vario-scale map is better then a multi-scale map in helping map users to keep their context during zooming. This paper presents two versions of the comparer. The ﬁrst one uses respectively a multi-scale and a vario-scale vector layer of area objects in the left map and in the right map. Both maps use the same multi-scale raster layer as the background. The second comparer also uses the raster layer as the background, and it uses three thematic layers as the foreground. The change between the thematic layers is realized by switching on/off according to scales. In future, we will implement continuous changes between the three thematic layers for the right map.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2967828", "name": "Dongliang Peng"}, {"authorId": "2723320", "name": "M. Meijers"}, {"authorId": "1717628", "name": "P. V. Oosterom"}, {"authorId": "2285358271", "name": "L.Peng"}, {"authorId": "2285351835", "name": "B.M.Meijers"}, {"authorId": "2285362768", "name": "nl"}], "citations": [{"paperId": "b1f9852cd69d2fb8f08d29b224b0b579607839aa", "title": "Generalizing Simultaneously to Support Smooth Zooming: Case Study of Merging Area Objects"}, {"paperId": "f7a19871d5df68d2a31b5d9f3377f42026b0c366", "title": "Improving the content of vario-scale maps"}]}
