{"paperId": "1f28a7244bd3815cd9dc5b14017bb35436b421b4", "publicationVenue": {"id": "8854982c-a445-46c7-82ec-c4d7aac5c5e3", "name": "International Conference on Distributed Computing in Sensor Systems", "type": "conference", "alternate_names": ["Int Conf Distrib Comput Sens Syst", "Distrib Comput Sens Syst", "Distributed Computing in Sensor Systems", "DCOSS"], "url": "http://www.wikicfp.com/cfp/program?id=672"}, "title": "Multi-Trace: Multi-level Data Trace Generation with the Cooja Simulator", "abstract": "Wireless low-power, multi-hop networks are exposed to numerous attacks also due to their resource-constraints. While there has been a lot of work on intrusion detection systems for such networks, most of these studies have considered only a few topologies, scenarios and attacks. One of the reasons for this shortcoming is the lack of sufficient data traces that are required to train many machine learning algorithms. In contrast to other wireless networks, multi-hop networks do not contain one entity that can capture all the traffic which makes it more difficult to acquire such traces. In this paper we present Multi-Trace. Multi-Trace extends the Cooja simulator with multi-level tracing facilities that enable data logging at different levels while maintaining a global time. We discuss the opportunities that traces generated by Multi-Trace enable for researchers interested in input for their machine learning algorithms. We present experiments that show the efficiency with which Multi-Trace generates traces. We expect Multi-Trace to be a useful tool for the research community.", "venue": "International Conference on Distributed Computing in Sensor Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-01", "journal": {"name": "2021 17th International Conference on Distributed Computing in Sensor Systems (DCOSS)", "pages": "390-395"}, "authors": [{"authorId": "1800321", "name": "N. Finne"}, {"authorId": "2463224", "name": "J. Eriksson"}, {"authorId": "145470665", "name": "T. Voigt"}, {"authorId": "1736971", "name": "G. Suciu"}, {"authorId": "102110961", "name": "Mari-Anais Sachian"}, {"authorId": "1751439", "name": "Jeonggil Ko"}, {"authorId": "2141039993", "name": "Hossein Keipour"}], "citations": [{"paperId": "48d8cb282d096eb1aaf691ad42edbac7467e4fc7", "title": "Build-Launch-Consolidate Framework and Toolkit for Impact Analysis on Wireless Sensor Networks"}, {"paperId": "d4e52f63a52f7b3ee61e1fbafa4e40e60490dbb3", "title": "Machine Learning for Healthcare-IoT Security: A Review and Risk Mitigation"}, {"paperId": "0d978e885aa15a39ffc0ce65425fc88bd6367d00", "title": "A survey on network simulators, emulators, and testbeds used for research and education"}, {"paperId": "b9cc22406627be79d8345aea45fad1135d134c98", "title": "On the Impact of Blackhole-Attack Variations on ML-based Intrusion Detection Systems in IoT"}, {"paperId": "12e0b075553f24a2006575127daea41c4ee8140b", "title": "Observability in Machine Learning based Intrusion Detection Systems for RPL-based IoT"}, {"paperId": "c16588e4152a6b37c2dc34ad9518f69004e68e07", "title": "Implementing and evaluating variations of the Blackhole attack on RPL"}]}
