{"paperId": "1f30ad69e5c7dedc7286455edb147df011b32ccb", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "Giant Armadillo Optimization: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems", "abstract": "In this paper, a new bio-inspired metaheuristic algorithm called Giant Armadillo Optimization (GAO) is introduced, which imitates the natural behavior of giant armadillo in the wild. The fundamental inspiration in the design of GAO is derived from the hunting strategy of giant armadillos in moving towards prey positions and digging termite mounds. The theory of GAO is expressed and mathematically modeled in two phases: (i) exploration based on simulating the movement of giant armadillos towards termite mounds, and (ii) exploitation based on simulating giant armadillos’ digging skills in order to prey on and rip open termite mounds. The performance of GAO in handling optimization tasks is evaluated in order to solve the CEC 2017 test suite for problem dimensions equal to 10, 30, 50, and 100. The optimization results show that GAO is able to achieve effective solutions for optimization problems by benefiting from its high abilities in exploration, exploitation, and balancing them during the search process. The quality of the results obtained from GAO is compared with the performance of twelve well-known metaheuristic algorithms. The simulation results show that GAO presents superior performance compared to competitor algorithms by providing better results for most of the benchmark functions. The statistical analysis of the Wilcoxon rank sum test confirms that GAO has a significant statistical superiority over competitor algorithms. The implementation of GAO on the CEC 2011 test suite and four engineering design problems show that the proposed approach has effective performance in dealing with real-world applications.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "72502760", "name": "O. Alsayyed"}, {"authorId": "1763710", "name": "Tareq Hamadneh"}, {"authorId": "2249582794", "name": "Hassan Al-Tarawneh"}, {"authorId": "2275399114", "name": "Mohammad Alqudah"}, {"authorId": "1865763969", "name": "Saikat Gochhait"}, {"authorId": "2275328957", "name": "Irina Leonova"}, {"authorId": "2128305375", "name": "O. Malik"}, {"authorId": "2261526390", "name": "Mohammad Dehghani"}], "citations": [{"paperId": "037732c9cfd61ad6742e98ce301c14ac7208ca48", "title": "The Pine Cone Optimization Algorithm (PCOA)"}]}
