{"paperId": "1f4aded2d520a36de97cb6c6755f62d50554e7c8", "publicationVenue": {"id": "f458edd1-14b3-4f2b-b448-3e80df57e1d8", "name": "China Communications", "type": "journal", "alternate_names": ["China Commun"], "issn": "1673-5447", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245522"}, "title": "Participants recruitment for coverage maximization by mobility predicting in mobile crowd sensing", "abstract": "Mobile Crowd Sensing (MCS) is an emerging paradigm that leverages sensor-equipped smart devices to collect data. The introduction of MCS also poses some challenges such as providing high-quality data for upper layer MCS applications, which requires adequate participants. However, recruiting enough participants to provide the sensing data for free is hard for the MCS platform under a limited budget, which may lead to a low coverage ratio of sensing area. This paper proposes a novel method to choose participants uniformly distributed in a specific sensing area based on the mobility patterns of mobile users. The method consists of two steps: (1) A second-order Markov chain is used to predict the next positions of users, and select users whose next places are in the target sensing area to form a candidate pool. (2) The Average Entropy (DAE) is proposed to measure the distribution of participants. The participant maximizing the DAE value of a specific sensing area with different granular sub-areas is chosen to maximize the coverage ratio of the sensing area. Experimental results show that the proposed method can maximize the coverage ratio of a sensing area under different partition granularities.", "venue": "China Communications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "China Communications", "pages": "163-176", "volume": "20"}, "authors": [{"authorId": "2237416456", "name": "Yuanni Liu"}, {"authorId": "2237082429", "name": "Xi Liu"}, {"authorId": "2153898580", "name": "Xin Li"}, {"authorId": "2198863679", "name": "Mingxin Li"}, {"authorId": "2237413744", "name": "Yi Li"}], "citations": [{"paperId": "d017f1bfb326e6e670242ee49b188cbfcfa4de5d", "title": "Privacy-preserving federated mobility prediction with compound data and model perturbation mechanism"}]}
