{"paperId": "1f4e7029b6adfa934f3ca2f8126e89932951df34", "publicationVenue": null, "title": "DDBJ Database updates and computational infrastructure enhancement", "abstract": "Abstract The Bioinformation and DDBJ Center (https://www.ddbj.nig.ac.jp) in the National Institute of Genetics (NIG) maintains a primary nucleotide sequence database as a member of the International Nucleotide Sequence Database Collaboration (INSDC) in partnership with the US National Center for Biotechnology Information and the European Bioinformatics Institute. The NIG operates the NIG supercomputer as a computational basis for the construction of DDBJ databases and as a large-scale computational resource for Japanese biologists and medical researchers. In order to accommodate the rapidly growing amount of deoxyribonucleic acid (DNA) nucleotide sequence data, NIG replaced its supercomputer system, which is designed for big data analysis of genome data, in early 2019. The new system is equipped with 30 PB of DNA data archiving storage; large-scale parallel distributed file systems (13.8 PB in total) and 1.1 PFLOPS computation nodes and graphics processing units (GPUs). Moreover, as a starting point of developing multi-cloud infrastructure of bioinformatics, we have also installed an automatic file transfer system that allows users to prevent data lock-in and to achieve cost/performance balance by exploiting the most suitable environment from among the supercomputer and public clouds for different workloads.", "venue": "Nucleic Acids Res.", "year": 2019, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-14", "journal": {"name": "Nucleic Acids Research", "pages": "D45 - D50", "volume": "48"}, "authors": [{"authorId": "145404727", "name": "O. Ogasawara"}, {"authorId": "2067242061", "name": "Y. Kodama"}, {"authorId": "2723486", "name": "J. Mashima"}, {"authorId": "49374982", "name": "T. Kosuge"}, {"authorId": "2629610", "name": "Takatomo Fujisawa"}], "citations": [{"paperId": "89fefacff3dd4e11daabb9c347421fc7166ad8bc", "title": "A human commons cell atlas reveals cell type specificity for OAS1 isoforms"}, {"paperId": "4d1aaeb08bf22cb69e9475f655df729813d62ed6", "title": "Improving data archiving practices in ancient genomics"}, {"paperId": "0dade9175157c984dbf44942cab4a1ec184c6284", "title": "The African Human Microbiome Portal: a public web portal of curated metagenomic metadata"}, {"paperId": "357149f03e5da3f25e3d776c39bae9348d8e132c", "title": "The European Nucleotide Archive in 2023"}, {"paperId": "a80dbd4ce611cec24f736304967b228236a3627d", "title": "PhageScope: a well-annotated bacteriophage database with automatic analyses and visualizations"}, {"paperId": "4da36d2e8a58f624bf96c9144b72ee90af902466", "title": "Survey of deep learning techniques for disease prediction based on omics data"}, {"paperId": "a64c83f19aa7fd9bafdda6d87b3446e8657d5d11", "title": "Genotype and phenotype data standardization, utilization and integration in the big data era for agricultural sciences"}, {"paperId": "461f60d555bd6dc660bcae87c69afb1aa2a95fbb", "title": "MSALigMap—A Tool for Mapping Active-Site Amino Acids in PDB Structures onto Known and Novel Unannotated Homologous Sequences with Similar Function"}, {"paperId": "4a04f4b767f190936e6a0715f64cefef9f11e76a", "title": "Building cloud computing environments for genome analysis in Japan"}, {"paperId": "860ecfc6d9c3d1cd0df204ba37a56fac0e3b5209", "title": "Implementation of Workflow Engine on BRIN HPC Infrastructure"}, {"paperId": "e2b55e5310c2f04876417b8631f8dcb385abf426", "title": "The European Nucleotide Archive in 2022"}, {"paperId": "0edeb4084665886a49b0c465d87f4f6daec31bd8", "title": "Cloud service checklist for academic communities and customization for genome medical research"}, {"paperId": "e5830529e3bf42eb7fee027e81fd75cdb751f936", "title": "PertOrg 1.0: a comprehensive resource of multilevel alterations induced in model organisms by in vivo genetic perturbation"}, {"paperId": "dace59dea017251d349c7939be96e5de76248824", "title": "Ecosystem-specific microbiota and microbiome databases in the era of big data"}, {"paperId": "3e5bf641efd774d55203bfc4f646f19e83b0c272", "title": "getSequenceInfo: a suite of tools allowing to get genome sequence information from public repositories"}, {"paperId": "0ee2379f2ae2bc58c60958f1858a35f8c33aab29", "title": "Continuous mutation of SARS-CoV-2 during migration via three routes at the beginning of the pandemic"}, {"paperId": "20e719221f4b0196cd0666e4e010da26b338350b", "title": "Small investments with big returns: environmental genomic bioprospecting of microbial life"}, {"paperId": "189c6fbe4aa388fecf057b8a645c2fb6f62976da", "title": "Development of RIKEN Plant Metabolome MetaDatabase"}, {"paperId": "306bf47ea438198a100a2ffb1dac04bc980f63de", "title": "Music of metagenomics—a review of its applications, analysis pipeline, and associated tools"}, {"paperId": "e606f472fdb63d74980c24c2a89fadf05ff44bed", "title": "SKIOME Project: a curated collection of skin microbiome datasets enriched with study-related metadata"}, {"paperId": "6af53c934b79fdb491e7c4786d8c9627d1e4ea3d", "title": "PZLAST: an ultra-fast amino acid sequence similarity search server against public metagenomes"}, {"paperId": "184c3857d1c3bfc94e279fd1ee1a0aa9a9b23de6", "title": "A Survey of Current Resources to Study lncRNA-Protein Interactions"}, {"paperId": "d991bfa114d1c3ee815b7292030b5ca07c8b1728", "title": "iPRIns: A Tool with the Improved Precision and Recall for Insertion Detection in the Human Genome"}, {"paperId": "c161f0a0acae5e8118c82fcf67aea78daa7edadf", "title": "A Survey of Current Resources to Study lncRNA-protein Interactions."}, {"paperId": "945aef9a8c8b9ccbaaef3b56d0b28cc30aa14f66", "title": "Dual RNA Sequencing Meta-analysis in Plasmodium Infection Identifies Host-Parasite Interactions"}, {"paperId": "4e6286e382ca2502b2498b5ad851703f3360103e", "title": "Machine learning applications in genome-scale metabolic modeling"}, {"paperId": "bdfde30bc05dbad2bd326be0d21e66b3b5bdc939", "title": "Principal component analysis of coronaviruses reveals their diversity and seasonal and pandemic potential"}, {"paperId": "51b60e3ae36fa9f10cba244f0373c821a468fe09", "title": "The international nucleotide sequence database collaboration"}, {"paperId": "c39264396d9b79234da91690e0ce962196fc293f", "title": "DDBJ update: streamlining submission and access of human data"}, {"paperId": "b27ca23cc865c31df7af68ad170f9c260cda4ab5", "title": "SARS CoV-2 nin (COVID-19) biyoinformatik destekli identifikasyonu"}, {"paperId": "ead707b37a0cdff8a4f2c50680d8a7a17c50b78d", "title": "Practical guide for managing large-scale human genome data in research"}, {"paperId": "960e7494ef4ec5964407488080f249104cd218f0", "title": "Database resources of the National Center for Biotechnology Information"}, {"paperId": "3575e098fc167631117f3dd1fcf88ed98330bb52", "title": "Ten simple rules for annotating sequencing experiments"}, {"paperId": "321cece1ea96872e6efa0905f2c456f062271869", "title": "Open access to genetic sequence data maximizes value to scientists, farmers, and society"}, {"paperId": "4ef3a7f2947a0a4c4ce480f1024c1577a833c8d3", "title": "Considerations for mosquito microbiome research from the Mosquito Microbiome Consortium"}, {"paperId": "5414e00d56163a6f6b2fac2a678666b7468879d2", "title": "SPDB: a specialized database and web-based analysis platform for swine pathogens"}, {"paperId": "dd1c0cadcadad29f602645e149af2d87e7ee6252", "title": "Publicly available transcriptomes provide the opportunity for dual RNA-Seq meta analysis in Plasmodium infection"}, {"paperId": "4de297d81ecda158a2f0a80f15ab476ef4b857cd", "title": "Recent advances in microbial databases with special reference to kinetoplastids"}]}
