{"paperId": "1f5c71bce46a9e02378db1be13da3854b9e37c35", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data Cleaning and Machine Learning: A Systematic Literature Review", "abstract": "Context: Machine Learning (ML) is integrated into a growing number of systems for various applications. Because the performance of an ML model is highly dependent on the quality of the data it has been trained on, there is a growing interest in approaches to detect and repair data errors (i.e., data cleaning). Researchers are also exploring how ML can be used for data cleaning; hence creating a dual relationship between ML and data cleaning. To the best of our knowledge, there is no study that comprehensively reviews this relationship. Objective: This paper's objectives are twofold. First, it aims to summarize the latest approaches for data cleaning for ML and ML for data cleaning. Second, it provides future work recommendations. Method: We conduct a systematic literature review of the papers published between 2016 and 2022 inclusively. We identify different types of data cleaning activities with and for ML: feature cleaning, label cleaning, entity matching, outlier detection, imputation, and holistic data cleaning. Results: We summarize the content of 101 papers covering various data cleaning activities and provide 24 future work recommendations. Our review highlights many promising data cleaning techniques that can be further extended. Conclusion: We believe that our review of the literature will help the community develop better approaches to clean data.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-03", "journal": {"name": "ArXiv", "volume": "abs/2310.01765"}, "authors": [{"authorId": "2253454644", "name": "Pierre-Olivier Cot'e"}, {"authorId": "2076564", "name": "Amin Nikanjam"}, {"authorId": "2256739882", "name": "Nafisa Ahmed"}, {"authorId": "1578277616", "name": "D. Humeniuk"}, {"authorId": "1703493", "name": "Foutse Khomh"}], "citations": []}
