{"paperId": "1f70371c20554c0bcbde90977733b3a31d102640", "publicationVenue": {"id": "da1ee6f4-c965-42d6-8b0b-a4cb9294f05d", "name": "Agronomy", "type": "journal", "issn": "2073-4395", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217994", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217994", "https://www.mdpi.com/journal/agronomy"]}, "title": "Protein Hydrolysates from Crambe abyssinica Seed Cake as Potential Biostimulants for Root Development", "abstract": "Crambe abyssinica Hochst defatted seed meals were used to produce protein hydrolysates through a mild enzymatic two-step hydrolysis process. The resulting hydrolysates were rich in free amino acids, low-molecular-weight peptides, and potential bioactive compounds such as phenols, glucosinolates, or their derivatives. These hydrolysates were tested in bioassays, performed under controlled conditions, on mung bean (Vigna radiata) cuttings, to investigate a possible auxin effect, and on maize (Zea mays L.) in an aeroponic/hydroponic system during the first two weeks of growth. In both assays, crambe hydrolysates revealed a stimulating effect on root development at a dose corresponding to nitrogen concentration of 4.8 mM, promoting lateral root formation and altering root architecture. Furthermore, they exhibited a positive impact on nitrogen content in both maize roots and shoots, along with an increase in the chlorophyll SPAD index. Notably, the observed effects were similar to those induced by a commercial biostimulant based on an animal-derived hydrolysate, tested under the same conditions on maize. The present work underscores the potential of crambe seed by-products for new sustainable and environmentally safe agro-inputs aimed at enhancing crop performance within the framework of a circular economy.", "venue": "Agronomy", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-31", "journal": {"name": "Agronomy"}, "authors": [{"authorId": "12606985", "name": "L. Ugolini"}, {"authorId": "13981513", "name": "L. Malaguti"}, {"authorId": "82486433", "name": "R. Matteo"}, {"authorId": "6508703", "name": "E. Pagnotta"}, {"authorId": "3523568", "name": "Romina Beleggia"}, {"authorId": "2264292315", "name": "L. Righetti"}], "citations": []}
