{"paperId": "1f79d49bb37c313afce3b952ec8138c38ad1660b", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "Failure-Aware Elastic Cloud Workflow Scheduling", "abstract": "With an increasing complexity and functionality in cloud data centers, fault tolerance becomes an essential requirement for tasks executed in clouds, especially for workflows with task precedences. Hosts and network devices are the main physical components in a cloud data center. The PB (Primary-Backup) model is a desirable approach to fault tolerance. Many PB-based workflow scheduling algorithms have been proposed for host faults. However, only a few studies focus on cloud workflow scheduling considering network device faults. This paper analyzes the fault-tolerant properties for scheduling dependent tasks and migrating VMs based on the PB model, considering both host and network device faults in a cloud data center. A failure-aware elastic cloud workflow scheduling algorithm is designed for both host and network device fault tolerance. Additionally, an elastic resource provisioning mechanism is proposed and incorporated into the proposed algorithm to improve resource utilization. Performance evaluations on both randomly generated and real-world workflows show that the proposal effectively improves resource utilization while guaranteeing fault tolerance.", "venue": "IEEE Transactions on Services Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "1846-1859", "volume": "16"}, "authors": [{"authorId": "1938164", "name": "Guangshun Yao"}, {"authorId": "121856658", "name": "Xiaoping Li"}, {"authorId": "2054858380", "name": "Qian Ren"}, {"authorId": "2153667710", "name": "Rubén Ruiz"}], "citations": [{"paperId": "29da7e58ec7b02d99d764cf601f868736341307e", "title": "Multiple objectives dynamic VM placement for application service availability in cloud networks"}, {"paperId": "707c6a09ec44a327fa7ba84cd6b5a03886fe4933", "title": "A Two-Stage Estimation of Distribution Algorithm With Heuristics for Energy-Aware Cloud Workflow Scheduling"}, {"paperId": "35af0858d5e81442983ff9f0a69628aa3616245a", "title": "FIRE: A Failure-Adaptive Reinforcement Learning Framework for Edge Computing Migrations"}]}
