{"paperId": "1f7a13437fb1b1751e65258a9e4ce65221c56f75", "publicationVenue": null, "title": "An Analysis of the Work Resumption in China under the COVID-19 Epidemic Based on Night Time Lights Data", "abstract": "Public emergencies often have an impact on the production and operation of enterprises. Timely and effective quantitative measurement of enterprises’ offline resumption of work after public emergencies is conducive to the formulation and implementation of relevant policies. In this study, we analyze the level of work resumption after the coronavirus disease 2019 (COVID-19)-influenced Chinese Spring Festival in 2020 with night time lights remote sensing data and Baidu Migration data. The results are verified by official statistics and facts, which demonstrates that COVID-19 has seriously affected the resumption of work after the Spring Festival holiday. Since 10 February, work has been resuming in localities. By the end of March, the work resumption index of most cities exceeded 70% and even Shanghai, Nanjing and Suzhou had achieved complete resumption of work. Wuhan only started to resume work in the last week of March due to the more severe outbreak. Although the level of work resumption is gradually increasing in every area, the specific situation of resumption of work varies in different regions. The process of work resumption in coastal areas is faster, while the process is relatively slow in inland cities.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-15", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "614", "volume": "10"}, "authors": [{"authorId": "120675381", "name": "Suzhen Tian"}, {"authorId": "2503541", "name": "Ruyi Feng"}, {"authorId": "2144378991", "name": "Ji Zhao"}, {"authorId": "2108594617", "name": "Lizhe Wang"}], "citations": [{"paperId": "dd91e9c888ae4a398eeda53674bc16ade8135f72", "title": "Identifying effective measures to enhance the recovery of small and micro enterprises after multiple waves of COVID-19 – A case study from Dongguan, China"}, {"paperId": "90ad4220a63f0533f8164b21fcb9ec7d8b3e24bd", "title": "Spatial–Temporal Urban Mobility Pattern Analysis During COVID-19 Pandemic"}, {"paperId": "1acf969885cb6944ff15a71488ffff392ee33c0e", "title": "Dynamic assessment of the COVID-19 lockdown in the Xinjiang region using night-time light remote sensing"}, {"paperId": "d23b6724aa882602fbac05fd632d31f60c3a9a01", "title": "Changes in spatiotemporal pattern and network characteristics in population migration of China’s cities before and after COVID-19"}, {"paperId": "626872428ed1723687a56bb8f5c5e0cfd24ee3d5", "title": "The role of government emergency response capability in regional governance: evidence from the COVID-19 outbreak impact on the housing market"}, {"paperId": "e1601bd77f64e5193b96507814fd1086c14a81e9", "title": "Study of the relationship between urbanization and environment in the Jiulong river basin based on coupling coordination degree model"}, {"paperId": "7fa2e7694a0de50f6ca61be4f8a069bf3edc7709", "title": "China's Largest City-Wide Lockdown: How Extensively Did Shanghai COVID-19 Affect Intensity of Human Activities in the Yangtze River Delta?"}, {"paperId": "be15d6613ebebcf864f79d123aab23fcf592b66d", "title": "Geographical detector-based assessment of multi-level explanatory powers of determinants on China’s medical-service resumption during the COVID-19 epidemic"}, {"paperId": "1b1d8bb340361f9fa762a3b134a13b4ccc60b6df", "title": "Post COVID-19 pandemic recovery of intracity human mobility in Wuhan: Spatiotemporal characteristic and driving mechanism"}, {"paperId": "56dbcf42cc9f3c617e4017adafe35e8181da2ccb", "title": "Night-Time Skyglow Dynamics during the COVID-19 Epidemic in Guangbutun Region of Wuhan City"}, {"paperId": "d50daaa7e43438b8cd212fb1446b1617aca9a53e", "title": "Monitoring Spatiotemporal Distribution of the GDP of Major Cities in China during the COVID-19 Pandemic"}, {"paperId": "89452731f3d331f2121bd137a152b64a13b0e068", "title": "Understanding China's resumption of work and production during the critical period of COVlD‐19 based on multi‐source data"}, {"paperId": "604fc0990678df1157b85ee6e10ade8d2b1cae8d", "title": "Post COVID-19 pandemic recovery of intracity human mobility in Wuhan: Spatiotemporal characteristic and driving mechanism"}, {"paperId": "1cf14e61e3a29ec3fcb634d49b1b32a6afabf54d", "title": "Post COVID-19 pandemic recovery of intracity human mobility in Wuhan: Spatiotemporal characteristic and driving mechanism Travel Behaviour and Society"}, {"paperId": "7742ead05ec795aba46bc0246dabad872d69b442", "title": "Post COVID-19 pandemic recovery of intracity human mobility in Wuhan: Spatiotemporal characteristic and driving mechanism"}]}
