{"paperId": "1f837196a691e2a2ffa940cdc1105886b54df529", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Scalable network analytics for characterization of outbreak influence in voluminous epidemiology datasets", "abstract": "Planning for large‐scale epidemiological outbreaks in livestock populations often involves executing compute‐intensive disease spread simulations. To capture the probabilities of various outcomes, these simulations are executed several times over a collection of representative input scenarios, producing voluminous data. The resulting datasets contain valuable insights, including sequences of events that lead to extreme outbreaks. However, discovering and leveraging such information is also computationally expensive. In this study, we set out to achieve two goals, ie, (1) providing a distributed framework for modeling disease transmission at scale using Spark, including improvements to the default GraphX partitioning strategy, and (2) giving planners and epidemiologists a means to analyze interactions between entities (herds) during simulated disease outbreaks. Using our disease transmission network (DTN), planners or analysts can isolate herds that have a disproportionate effect on epidemiological outcomes, enabling effective allocation of limited resources such as vaccinations and field personnel. We use a representative dataset to verify our approach and optimized the underlying graph partitioning algorithm to ensure the system will scale with increases in the dataset size or number of participating machines. Our analysis includes identification of influential herds as well as the creation of machine learning models for accurate classifications that generalize to other datasets.", "venue": "Concurrency and Computation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-22", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "31"}, "authors": [{"authorId": "40394278", "name": "N. Shah"}, {"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "2068796493", "name": "Harshil Shah"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "0dcf92532700102a0f37a9cbae4cda8c6d52fa2a", "title": "Graph Partitioning With Limited Moves"}, {"paperId": "7245c1c4665843affec0364e4358c0b7f8b47032", "title": "Using Network Analysis and Machine Learning to Identify Virus Spread Trends in COVID-19"}, {"paperId": "76c30eb076acb61ebde680f29cf7a12d1fed7720", "title": "Research perspectives on animal health in the era of artificial intelligence"}, {"paperId": "39ff1368382d391c7bfca0908123bd2bc7c2dfb2", "title": "Concerto: Leveraging Ensembles for Timely, Accurate Model Training Over Voluminous Datasets"}, {"paperId": "7a76676cd1c810ac9ab58f911f941ba835743d33", "title": "Intelligence artificielle et santé animale"}]}
