{"paperId": "1f88e84ca9c30de0aaed61be9edf6bf5ba896ad4", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Advancements in Artificial Intelligence Circuits and Systems (AICAS)", "abstract": "In the rapidly evolving landscape of electronics, Artificial Intelligence Circuits and Systems (AICAS) stand out as a groundbreaking frontier. This review provides an exhaustive examination of the advancements in AICAS, tracing its development from inception to its modern-day applications. Beginning with the foundational principles that underpin AICAS, we delve into the state-of-the-art architectures and design paradigms that are propelling the field forward. This review also sheds light on the multifaceted applications of AICAS, from optimizing energy efficiency in electronic devices to empowering next-generation cognitive computing systems. Key challenges, such as scalability and robustness, are discussed in depth, along with potential solutions and emerging trends that promise to shape the future of AICAS. By offering a comprehensive overview of the current state and potential trajectory of AICAS, this review serves as a valuable resource for researchers, engineers, and industry professionals looking to harness the power of AI in electronics.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-26", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2253535831", "name": "Tymoteusz Miller"}, {"authorId": "2202159838", "name": "Irmina Durlik"}, {"authorId": "11274548", "name": "E. Kostecka"}, {"authorId": "2222062648", "name": "Paulina Mitan-Zalewska"}, {"authorId": "2276698715", "name": "Sylwia Sokołowska"}, {"authorId": "1402963771", "name": "D. Cembrowska-Lech"}, {"authorId": "2276696013", "name": "Adrianna Łobodzińska"}], "citations": [{"paperId": "feb2333acd3123f1e77cbd32a284391a54585268", "title": "A comprehensive review of embedded systems in autonomous vehicles: Trends, challenges, and future directions"}]}
