{"paperId": "1f94f532fdf78f677ea00efaa631f077e78ba380", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "A Survey on QoS Requirements Based on Particle Swarm Optimization Scheduling Techniques for Workflow Scheduling in Cloud Computing", "abstract": "Cloud computing is an innovative technology that deploys networks of servers, located in wide remote areas, for performing operations on a large amount of data. In cloud computing, a workflow model is used to represent different scientific and web applications. One of the main issues in this context is scheduling large workflows of tasks with scientific standards on the heterogeneous cloud environment. Other issues are particular to public cloud computing. These include the need for the user to be satisfied with the quality of service (QoS) parameters, such as scalability and reliability, as well as maximize the end-users resource utilization rate. This paper surveys scheduling algorithms based on particle swarm optimization (PSO). This is aimed at assisting users to decide on the most suitable QoS consideration for large workflows in infrastructure as a service (IaaS) cloud applications and mapping tasks to resources. Besides, the scheduling schemes are categorized according to the variant of the PSO algorithm implemented. Their objectives, characteristics, limitations and testing tools have also been highlighted. Finally, further directions for future research are identified.", "venue": "Symmetry", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-04", "journal": {"name": "Symmetry", "pages": "551", "volume": "12"}, "authors": [{"authorId": "1491626356", "name": "M. Farid"}, {"authorId": "2563887", "name": "R. Latip"}, {"authorId": "143850279", "name": "M. Hussin"}, {"authorId": "1803017", "name": "N. A. W. Hamid"}], "citations": [{"paperId": "ac8420b22b2a82be41c24ad43662f4cb2786465d", "title": "Toward optimizing scientific workflow using multi-objective optimization in a cloud environment"}, {"paperId": "26e263d0afebfc877a29b9bba4a59df1d0b53558", "title": "DE-GWO: A Multi-objective Workflow Scheduling Algorithm for Heterogeneous Fog-Cloud Environment"}, {"paperId": "0510859eb88bc752da6808aba9454562797ccfa4", "title": "Scheduling Scientific Workflow in Multi-Cloud: A Multi-Objective Minimum Weight Optimization Decision-Making Approach"}, {"paperId": "23bda784d71ad2bf3c8ea479ce596f571bb14c00", "title": "Optimization of Maritime Communication Workflow Execution with a Task-Oriented Scheduling Framework in Cloud Computing"}, {"paperId": "91d6376132899e5a35f8628c5ef1564191a0a67c", "title": "HEPGA: A new effective hybrid algorithm for scientific workflow scheduling in cloud computing environment"}, {"paperId": "dad2b08a923f0c7dd22be5acf677b2c2dd60a162", "title": "A Review on Quality of Service Monitoring, Violation and Remediation for the Cloud"}, {"paperId": "4d0907017067654034f491f203a05bad731e04ae", "title": "A Discrete Interval-Based Multi-Objective Memetic Algorithm for Scheduling Workflow With Uncertainty in Cloud Environment"}, {"paperId": "3b53ae37e593b969bbaecd40569bd0ce758d069a", "title": "An Empirical Study on Hybrid Scheduling Algorithms in Cloud Computing"}, {"paperId": "ab8bcaff930fec5d2a2d29c22dae0549fcbab5e2", "title": "Fault aware task scheduling in cloud using min-min and DBSCAN"}, {"paperId": "68bf711269d1dfb3729c361ffbe472eff22bac7a", "title": "Machine learning based secure and efficient task allocation in multi‐cloud"}, {"paperId": "bc0eb55276ada43993eafd6ed349ef3f980fb286", "title": "Prediction-based scheduling techniques for cloud data center’s workload: a systematic review"}, {"paperId": "683974400911ab03da086ad259d83898bb6e74f8", "title": "A dynamic multipopulation genetic algorithm for multiobjective workflow scheduling based on the longest common sequence"}, {"paperId": "96bc01418fc64bf97239a08d13a620f241acfce4", "title": "Identifying Challenges for Clients in Adopting Sustainable Public Cloud Computing"}, {"paperId": "07e1e970146a1a362a5883e987ce95967249ebc1", "title": "A novel technique to optimize quality of service for directed acyclic graph (DAG) scheduling in cloud computing environment using heuristic approach"}, {"paperId": "008ed8459e1267509ba4d028e9868dcc2cb673b8", "title": "Towards edge computing in intelligent manufacturing: Past, present and future"}, {"paperId": "3181e9d024c71a65f87a5c4abe1a9769db7d8f3f", "title": "Mapping and Consolidation of VMs Using Locust-Inspired Algorithms for Green Cloud Computing"}, {"paperId": "0b1a21ec8b61d3300b30781e8cd72d24a9e1e2af", "title": "A review of swarm intelligence algorithms deployment for scheduling and optimization in cloud computing environments"}, {"paperId": "630b12cb80b288ef9f011d868fdb9110ac9f5f08", "title": "Employing Machine Learning Approaches for Predictive Data Analytics in Retail Industry"}, {"paperId": "cdc18d7c5742efeefd66d1e5d0c047a5d91f3f20", "title": "LBPSGORA: Create Load Balancing with Particle Swarm Genetic Optimization Algorithm to Improve Resource Allocation and Energy Consumption in Clouds Networks"}, {"paperId": "9f68cd4d26fa672447eb47c4c2282a5f671ef0fe", "title": "Scientific Workflow Makespan Minimization in Edge Multiple Service Providers Environment"}, {"paperId": "8a10dd070d9a6ee05465c75701abf01d93b09ed1", "title": "PSO+LOA: hybrid constrained optimization for scheduling scientific workflows in the cloud"}, {"paperId": "c70d0a43f833f1105c2c55a8b319a5efcc9ccfde", "title": "Providing Predictable Quality of Service in a Cloud-Based Web System"}, {"paperId": "3f5d4c980377cdb8224ec930f58fb6f35046b0b2", "title": "A Comparative Evaluation of Population-based Optimization Algorithms for Workflow Scheduling in Cloud-Fog Environments"}, {"paperId": "c0c10adfc50a34f574adbe914ab6c035a35c5d5e", "title": "Optimising Cloud Servers Utilisation Based on Locust-Inspired Algorithm"}, {"paperId": "f78fe0c1fda9698f92f640c81b1cbd3ef0421291", "title": "Systematic Literature Review: Metaheuristics-based Approach for Workflow Scheduling in Cloud"}, {"paperId": "25d689d5e3262df010ecf4353d4d95e2d81ac900", "title": "Dynamic Job Scheduling Strategy Using Jobs Characteristics in Cloud Computing"}, {"paperId": "d5687c839e91fcebe644d5e5cad5cf4a0b3a7475", "title": "A QoS Aware FTOPSIS-WOA based task scheduling algorithm with load balancing technique for the cloud computing environment"}, {"paperId": "cb3e06a576db86b105d2ba1401c52b7ea1af22e9", "title": "A Particle Swarm Optimization method based on cost modification heuristic for the Multi Level Lot Sizing Problem"}, {"paperId": "3e8547bc1532eb2b1b6e530327fbfbc5b56357fc", "title": "A survey on provisioning and scheduling algorithms for scientific workflows in cloud computing"}, {"paperId": "927dcc1555fc2c71acc9af2435244ea08171c96e", "title": "Multi-Swarm PSO Algorithm for Static Workflow Scheduling in Cloud-Fog Environments"}, {"paperId": "10af32fc6284db59ed58ab7915aa07b3af81a09c", "title": "A Multimodal Improved Particle Swarm Optimization for High Dimensional Problems in Electromagnetic Devices"}, {"paperId": "78c4f2ee7fa579b35001b4ee430b31e816914400", "title": "PSO-Based Workflow Scheduling: a Comparative Evaluation of Cloud and Cloud-Fog Environments"}, {"paperId": "5680c030a88760a66ca5e6482f385c0d40bed408", "title": "Scheduling Scientiﬁc Workﬂow in Multi-Cloud: A Multi-Objective Minimum Weight Optimization Decision-Making Approach"}]}
