{"paperId": "1f9623e3b1b631bc7648ace17cb45e8e5c5cb77c", "publicationVenue": null, "title": "Shuffle Grouping Fields Grouping Spout Count Count Splitter Metrics Manager Stream Manager Container 2 Spout Count Count Splitter Stream Manager Stream Manager Splitter Splitter Stream Manager Stream Manager Count Count Count Count", "abstract": "Real-time stream processing has become increasingly important in recent years and has led to the development of a multitude of stream processing systems. Given the varying job workloads that characterize stream processing, these systems need to be tuned and adjusted to maintain performance targets in the face of variation in incoming traffic. Current auto-scaling systems adopt a series of trials to approach a job’s expected performance due to a lack of performance modelling tools. We find that general traffic trends in most jobs lend themselves well to prediction. Based on this premise, we built a system called Caladrius that forecasts the future traffic load of a stream processing job and predicts its processing performance after a proposed change to the parallelism of its operators. Experimental results show that Caladrius is able to estimate a job’s throughput performance and CPU load under a given scaling configuration.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "8124005", "name": "Faria Kalim"}, {"authorId": "2054517511", "name": "Thomas Cooper"}, {"authorId": "2119106461", "name": "Huijun Wu"}, {"authorId": "2110976880", "name": "Yao Li"}, {"authorId": "2152171319", "name": "Ning Wang"}, {"authorId": "2054646171", "name": "Neng Lu"}, {"authorId": "40434199", "name": "Maosong Fu"}, {"authorId": "2067733088", "name": "Xiaoyao Qian"}, {"authorId": "2110564396", "name": "Hao Luo"}, {"authorId": "2053697861", "name": "Da Cheng"}, {"authorId": "153709751", "name": "Yaliang Wang"}, {"authorId": "143696573", "name": "Fred Dai"}, {"authorId": "2319032", "name": "Mainak Ghosh"}, {"authorId": "2117783202", "name": "Beinan Wang"}], "citations": []}
