{"paperId": "1fa0e6680fe9cc94fbe1904818f9ccc0d3fc2ed2", "publicationVenue": null, "title": "DCoflow: Deadline-Aware Scheduling Algorithm for Coflows in Datacenter Networks", "abstract": "Datacenter networks routinely support the data transfers of distributed computing frameworks in the form of coflows, i.e., sets of concurrent flows related to a common task. The vast majority of the literature has focused on the problem of scheduling coflows for completion time minimization, i.e., to maximize the average rate at which coflows are dispatched in the network fabric. Modern applications, though, may generate coflows dedicated to online services and mission-critical computing tasks which have to comply with specific completion deadlines. In this paper, we introduce DCoflow, a lightweight deadline-aware scheduler for time-critical coflows in datacenter networks. The algorithm combines an online joint admission control and scheduling logic and returns a σ-order schedule which maximizes the number of coflows that attain their deadlines. Extensive numerical results demonstrate that the proposed solution outperforms existing ones.", "venue": "2022 IFIP Networking Conference (IFIP Networking)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-02", "journal": {"name": "2022 IFIP Networking Conference (IFIP Networking)", "pages": "1-9"}, "authors": [{"authorId": "30756669", "name": "Q. Luu"}, {"authorId": "144075441", "name": "O. Brun"}, {"authorId": "1728874", "name": "R. E. Azouzi"}, {"authorId": "144822891", "name": "F. Pellegrini"}, {"authorId": "2477986", "name": "B. Prabhu"}, {"authorId": "31500893", "name": "Cédric Richier"}], "citations": [{"paperId": "d81f0693983dfc88b03a057377985da647857e3b", "title": "Recent Advances in Data Intensive Applications: Survey"}, {"paperId": "3dbe20a402a257b163a928df534696c6c2163699", "title": "Weighted Scheduling of Time-Sensitive Coflows"}, {"paperId": "21d98e15835b0469493a1e3bfe9b3b134a00dd2d", "title": "Fair Coflow Scheduling via Controlled Slowdown"}]}
