{"paperId": "1fa2cfbbbffe3a5d3f320aa827791997bf3963ba", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "ML-based Cross-Platform Query Optimization", "abstract": "Cost-based optimization is widely known to suffer from a major weakness: administrators spend a significant amount of time to tune the associated cost models. This problem only gets exacerbated in cross-platform settings as there are many more parameters that need to be tuned. In the era of machine learning (ML), the first step to remedy this problem is to replace the cost model of the optimizer with an ML model. However, such a solution brings in two major challenges. First, the optimizer has to transform a query plan to a vector million times during plan enumeration incurring a very high overhead. Second, a lot of training data is required to effectively train the ML model. We overcome these challenges in Robopt, a novel vector-based optimizer we have built for Rheem, a cross-platform system. Robopt not only uses an ML model to prune the search space but also bases the entire plan enumeration on a set of algebraic operations that operate on vectors, which are a natural fit to the ML model. This leads to both speed-up and scale-up of the enumeration process by exploiting modern CPUs via vectorization. We also accompany Robopt with a scalable training data generator for building its ML model. Our evaluation shows that (i) the vector-based approach is more efficient and scalable than simply using an ML model and (ii) Robopt matches and, in some cases, improves Rheem’s cost-based optimizer in choosing good plans without requiring any tuning effort.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1489-1500"}, "authors": [{"authorId": "2827559", "name": "Zoi Kaoudi"}, {"authorId": "1399355221", "name": "Jorge-Arnulfo Quiané-Ruiz"}, {"authorId": "1404359012", "name": "Bertty Contreras-Rojas"}, {"authorId": "1720831393", "name": "Rodrigo Pardo-Meza"}, {"authorId": "1410159156", "name": "Anis Troudi"}, {"authorId": "50793091", "name": "S. Chawla"}], "citations": [{"paperId": "7368bef6b6ddcdf7bf35350491bf69e6574324c0", "title": "Learning Approximation Sets for Exploratory Queries"}, {"paperId": "32ba448e90bca6c22c8b90082869d89b7417767b", "title": "Optimizing Dataflow Systems for Scalable Interactive Visualization"}, {"paperId": "d13b3c9d4a7bd05133578e566657658dc531e29f", "title": "Adding Domain Knowledge to Query-Driven Learned Databases"}, {"paperId": "3377ad969797f7ccbb306ecf72e0e8a474c92ae0", "title": "Apache Wayang: A Unified Data Analytics Framework"}, {"paperId": "bdfa1985004b9bc357db35c7463afe8e3c3b273e", "title": "Advancing human-robot interaction in a manufacturing environment by incorporating hand movements for remote control"}, {"paperId": "f9d7874c779d70ff5b67e15ef7c1a0e0b33e4883", "title": "Unified Data Analytics: State-of-the-art and Open Problems"}, {"paperId": "05d70a97554d7a210aada1161e1b7488564da169", "title": "Polyglot Data Management: State of the Art & Open Challenges"}, {"paperId": "354fbd6c940ead125fe995503b87462470d2d4f5", "title": "Database Optimizers in the Era of Learning"}, {"paperId": "7b8a2e2a040a7529360e558ef89a8dc05e171bbe", "title": "Simpli-Squared: A Very Simple Yet Unexpectedly Powerful Join Ordering Algorithm Without Cardinality Estimates"}, {"paperId": "70f35dff1aca951762f0c7da081d1ce3a39f1592", "title": "CPRQ: Cost Prediction for Range Queries in Moving Object Databases"}, {"paperId": "72e11b7b04c1a5df1b660b143c626355ad27de0f", "title": "Phoebe: A Learning-based Checkpoint Optimizer"}, {"paperId": "22448f32f76a37a422d65f022dcdc628d44d6e52", "title": "Expand your Training Limits! Generating Training Data for ML-based Data Management"}, {"paperId": "5019dfffaa035c7a3565a9f691a9acc62207a95b", "title": "A Survey on Advancing the DBMS Query Optimizer: Cardinality Estimation, Cost Model, and Plan Enumeration"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}, {"paperId": "26c033d8ceff9373614421de265e66df4d8aed7d", "title": "RHEEMix in the data jungle: a cost-based optimizer for cross-platform systems"}, {"paperId": "3053cd1588bb64497860c204d5c09ce6a3cc2797", "title": "Learn What Really Matters: A Learning-to-Rank Approach for ML-based Query Optimization"}, {"paperId": "069e10048e4b50cabb1748ecda156eac515ba8f1", "title": "DataFarm: Farm Your ML-based Query Optimizer's Food! - Human-Guided Training Data Generation -"}, {"paperId": "2d77eb067dea7ebd25685e8e53a29df1f7cc68e8", "title": "Phoebe: A Learning-based Checkpoint Optimizer"}]}
