{"paperId": "1faa5f41a140437be031958976f8357f612ba8e2", "publicationVenue": {"id": "757ec547-4fbf-4010-b6ae-c6b833ccd3a4", "name": "Frontiers in Energy Research", "type": "journal", "alternate_names": ["Front Energy Res"], "issn": "2296-598X", "url": "http://www.frontiersin.org/Energy_Research", "alternate_urls": ["https://www.frontiersin.org/journals/energy-research", "http://www.frontiersin.org/Energy_Research/archive"]}, "title": "Comparison of machine learning and statistical methods in the field of renewable energy power generation forecasting: a mini review", "abstract": "In the post-COVID-19 era, countries are paying more attention to the energy transition as well as tackling the increasingly severe climate crisis. Renewable energy has attracted much attention because of its low economic costs and environmental friendliness. However, renewable energy cannot be widely adopted due to its high intermittency and volatility, which threaten the security and stability of power grids and hinder the operation and scheduling of power systems. Therefore, research on renewable power forecasting is important for integrating renewable energy and the power grid and improving operational efficiency. In this mini-review, we compare two kinds of common renewable power forecasting methods: machine learning methods and statistical methods. Then, the advantages and disadvantages of the two methods are discussed from different perspectives. Finally, the current challenges and feasible research directions for renewable energy forecasting are listed.", "venue": "Frontiers in Energy Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-26", "journal": {"name": "Frontiers in Energy Research"}, "authors": [{"authorId": "2212023992", "name": "Yibo Dou"}, {"authorId": "2110407260", "name": "Shuwen Tan"}, {"authorId": "2219606280", "name": "Dongwei Xie"}], "citations": [{"paperId": "723bf23f8c3772e4a46cad8817ef7ddccfeca2cb", "title": "Traceability analysis for low-voltage distribution network abnormal line loss using a data-driven power flow model"}, {"paperId": "30626d7754c8dbb58002813d2cef0292ef3f32bc", "title": "Data Anomaly Traceability Strategy for Low-Voltage Distribution Network Based on Time Series-Causality Learning"}]}
