{"paperId": "1fbbb736712ba0272d406143d7a25835c177861e", "publicationVenue": null, "title": "Don't Even Ask: Database Access Control through Query Control", "abstract": "This paper presents a vision and description for query control, which is a paradigm for database access control. In this model, individual queries are examined before being executed and are either allowed or denied by a pre-defined policy. Traditional view-based database access control requires the enforcer to view the query, the records, or both. That may present difficulty when the enforcer is not allowed to view database contents or the query itself. This discussion of query control arises from our experience with privacy-preserving encrypted databases, in which no single entity learns both the query and the database contents. Query control is also a good fit for enforcing rules and regulations that are not well-addressed by view-based access control. With the rise of federated database management systems, we believe that new approaches to access control will be increasingly important.", "venue": "SGMD", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-27", "journal": {"name": "SIGMOD Rec.", "pages": "17-22", "volume": "47"}, "authors": [{"authorId": "144657821", "name": "Richard Shay"}, {"authorId": "2057185", "name": "U. Blumenthal"}, {"authorId": "74882299", "name": "V. Gadepally"}, {"authorId": "144220505", "name": "Ariel Hamlin"}, {"authorId": "47610024", "name": "John Darby Mitchell"}, {"authorId": "1939551", "name": "R. Cunningham"}], "citations": [{"paperId": "361466b468a3e6da9709459afc2bcd2ec13863b1", "title": "Empowering Data Federation Security in Polystore Systems"}, {"paperId": "371b1695cf842aff2a4ce14b1e558dbdc3f65b32", "title": "RangeQC: A Query Control Framework for Range Query Leakage Quantification and Mitigation"}, {"paperId": "0414a1d1cf4b69b696638a6fe4ea5b728e7586c6", "title": "Secure and Policy-Compliant Query Processing on Heterogeneous Computational Storage Architectures"}, {"paperId": "a30f7e27968ad360629253eb8a1e2b933169e68d", "title": "Compliant Geo-distributed Query Processing"}, {"paperId": "30712541bb7e51355a2134c75a304076e73c9612", "title": "Technical Report on Data Integration and Preparation"}, {"paperId": "129d4a3dc3c013f28685ac9c211c2ac2ce816649", "title": "Data Publishing: Availability of Data Under Security Policies"}, {"paperId": "b945a51ebbe7b326dacd5d0194f31c069f99d7e8", "title": "Technical Report: Developing a Working Data Hub"}, {"paperId": "d386744c94963e9542365120f6b433725ab00cc7", "title": "Developing a Working Data Hub"}, {"paperId": "57f85ab5638e3f5ec70e3c7e53b06f79a1fb6860", "title": "Technical Report: An Overview of Data Integration and Preparation"}, {"paperId": "96b59e18e04f2b96d6f855bba1c1a3875514074e", "title": "A Survey of Advanced Encryption for Database Security: Primitives, Schemes, and Attacks"}]}
