{"paperId": "1fd17127fa6488ccd2d4e39dca8e566a82dc93c7", "publicationVenue": null, "title": "Reducing cost in continuous integration with a collection of build selection approaches", "abstract": "Continuous integration (CI) is a widely used practice in modern software engineering. Unfortunately, it is also an expensive practice — Google and Mozilla estimate their CI systems in millions of dollars. To reduce CI computation cost, I propose the strategy of build selection to selectively execute those builds whose outcomes are failing and skip those passing builds for cost-saving. In my research, I firstly designed SmartBuildSkip as my first build selection approach that can skip unfruitful builds in CI automatically. Next, I evaluated SmartBuildSkip with all CI-improving approaches for understanding the strength and weakness of existing approaches to recommend future technique design. Then I proposed PreciseBuildSkip as a build selection approach to maximize the safety of skipping builds in CI. I also combined existing approaches both within and across granularity to be applied as a new build selection approach — HybridBuildSkip to save builds in a hybrid way. Finally, I plan to propose a human study to understand how to increase developers' trust on build selection approaches.", "venue": "ESEC/SIGSOFT FSE", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-08-18", "journal": {"name": "Proceedings of the 29th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "47540780", "name": "Xianhao Jin"}], "citations": [{"paperId": "2c9b85104ac4dddaba0f22a5749e0ef2a909a817", "title": "OneSpace: Detecting cross-language clones by learning a common embedding space"}, {"paperId": "39bd108bac25cc26c0b8395ff7922fd917e37bb2", "title": "Revisiting Machine Learning based Test Case Prioritization for Continuous Integration"}, {"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration"}]}
