{"paperId": "1fd372b7ef9a5e58eb569c6687a24bdbab1622b4", "publicationVenue": {"id": "a39f9dfd-2a36-4c61-96ef-c20e96d59ac0", "name": "International Conference on Emerging Technological Trends", "type": "conference", "alternate_names": ["ICETT", "Int Conf Emerg Technol Trends"]}, "title": "A Literature Review on Educational Data Mining with Secondary School Data", "abstract": "This paper presents a literature review on educational data mining (EDM) with secondary school data, amid other literature reviews mostly focus on the data collected from online learning and higher education. EDM is useful for discovering potential patterns in learning data which is beneficial for enhancing learning contexts within the educational system. This literature review uses secondary schools as a basis and intends to summarise the progress made in applying EDM techniques. We have reviewed 18 relevant papers published between 2008 and 2021, and classified these papers based on application scenarios. We found that there are relatively few corresponding studies on the EDM applications in secondary school data, and the existing studies are mostly on classifying students’ academic success or failure, analysing influence factors, identifying their future directions, and discovering the potential dropout risks. In terms of the algorithms used, a majority of research relies on traditional machine learning methods. Deep learning and existing knowledge tracing models are rarely adopted in such scenarios despite their rapid development. Even though EDM is growing rapidly, its research and applications in secondary schools present a clear research gap. Future EDM research should be broadly extended to secondary school settings to remedy this space.", "venue": "International Conference on Emerging Technological Trends", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2023-04-21", "journal": {"name": "Proceedings of the 9th International Conference on Education and Training Technologies"}, "authors": [{"authorId": "153814063", "name": "Ka Ian Chan"}, {"authorId": "2257958937", "name": "Philip I.S. Lei"}, {"authorId": "2216254340", "name": "P. Pang"}], "citations": []}
