{"paperId": "1fd67263900d36942b988f68b627e7889c97848d", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Modeling, Evaluating, and Applying the eWoM Power of Reddit Posts", "abstract": "Electronic Word of Mouth (eWoM) has been largely studied for social platforms, such as Yelp and TripAdvisor, which are highly investigated in the context of digital marketing. However, it can also have interesting applications in other contexts. Therefore, it can be challenging to investigate this phenomenon on generic social platforms, such as Facebook, Twitter, and Reddit. In the past literature, many authors analyzed eWoM on Facebook and Twitter, whereas it was little considered in Reddit. In this paper, we focused exactly on this last platform. In particular, we first propose a model for representing and evaluating the eWoM Power of Reddit posts. Then, we illustrate two possible applications, namely the definition of lifespan templates and the construction of profiles for Reddit posts. Lifespan templates and profiles are ultimately orthogonal to each other and can be jointly employed in several applications.", "venue": "Big Data and Cognitive Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-09", "journal": {"name": "Big Data Cogn. Comput.", "pages": "47", "volume": "7"}, "authors": [{"authorId": "50147365", "name": "Gianluca Bonifazi"}, {"authorId": "1644042132", "name": "Enrico Corradini"}, {"authorId": "2187629498", "name": "Domenico Ursino"}, {"authorId": "66059197", "name": "L. Virgili"}], "citations": [{"paperId": "c440b0aaf4f5bcb04a1aecf139f1df85b4dd4751", "title": "Contribution of Social Media Addiction on Intention to Buy in Social Media Sites"}, {"paperId": "386ad2bbe27f9fd1f22617820a2a1b36002cc474", "title": "Analyzing Sentiments Regarding ChatGPT Using Novel BERT: A Machine Learning Approach"}, {"paperId": "ff3652a96ec24add36c8765521153ffb18aeecff", "title": "Word-of-Mouth Engagement in Online Social Networks: Influence of Network Centrality and Density"}, {"paperId": "70fae9b19c273838ecc3d8d71edbf3ab58803bfb", "title": "A Knowledge Representation System for the Indian Stock Market"}, {"paperId": "494069aa3a7b12159159059829f030e936493cdb", "title": "Heterogeneous Diffusion of Government Microblogs and Public Agenda Networks during Public Policy Communication in China"}]}
