{"paperId": "1fd72e5fb87172cf2f5a7106b43ec2509e186766", "publicationVenue": null, "title": "Team Recognition in Big Scholarly Data: Exploring Collaboration Intensity", "abstract": "The scale of scholarly data has been expanded due to the fact that scientific productions are increasing rapidly and new scholars affiliate academia incessantly. Scholars are shifting their research patterns from individual research to academic teamwork due to the complexity of scientific issues. In order to achieve higher reputations and better performance, academic teams with leaders are constructed to speed up knowledge sharing and problem solving. It is significant to explore team-based issues with the increasing interests of information exploration in big scholarly data. However, existing academic team definitions are commonly not quantitative, which makes it difficult to identify real academic teams. In this work, we propose a collaboration relationship evaluation index called Collaboration Intensity Index (CII), which is a two-way and quantitative index to evaluate collaboration intensity between two scholars in the network. Then, we construct a new type of co-author network with edges weighted by CII, which differs from the original co-author networks. This network reflects the newly scientific research patterns inside or outside academic teams. Furthermore, we propose TRAC (Team Recognition Algorithm based on CII) to identify academic teams from large co-author networks. Finally, we use DBLP data set, which contains 1,250,440 scholars and 1,575,949 published papers, to identify teams by TRAC. Comparing with fast unfolding algorithm and real team data, the effectiveness of our method can be demonstrated.", "venue": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "925-932"}, "authors": [{"authorId": "143630551", "name": "Shuo Yu"}, {"authorId": "2066079415", "name": "Feng Xia"}, {"authorId": "2153281566", "name": "Kaiyuan Zhang"}, {"authorId": "34506974", "name": "Zhaolong Ning"}, {"authorId": "2723575", "name": "Jiaofei Zhong"}, {"authorId": "2215093909", "name": "Chengfei Liu"}], "citations": [{"paperId": "8eb85c982184ae26876bcacf044b0f3817356c36", "title": "CLARA: citation and similarity-based author ranking"}, {"paperId": "8c2f7467c96080c91d18dd8ec6a0577193ff7b8f", "title": "The recognition of kernel research team"}, {"paperId": "eca6efaa9af6060e63e4ba004652ef0772ad0a5f", "title": "Collaborative Team Recognition: A Core Plus Extension Structure"}, {"paperId": "c8921bd7bd3f4415a841ff58cbdd0d6388a7c611", "title": "Graph Learning for Fake Review Detection"}, {"paperId": "301ab399cec08e8d2199279f70923c322e0dfe12", "title": "Mining Homophilic Groups of Users using Edge Attributed Node Embedding from Enterprise Social Networks"}, {"paperId": "3b6ac1763fb98011c52ed9365e1afbef1c414f5b", "title": "CHIEF: Clustering With Higher-Order Motifs in Big Networks"}, {"paperId": "d016d45fcca93345b01742074515b9e64a7e7309", "title": "Familiarity-Based Collaborative Team Recognition in Academic Social Networks"}, {"paperId": "a3b0b89e91eeedbe36db7dff5d019cff7538b389", "title": "Network Representation Learning: From Traditional Feature Learning to Deep Learning"}, {"paperId": "d86bed3cdb57d9277dc800da06e6500082fd48fb", "title": "Detecting Outlier Patterns With Query-Based Artificially Generated Searching Conditions"}, {"paperId": "d84bb2ee995771de0a0b3de8b3f61ac721a7ffb2", "title": "CRI: Measuring City Infection Risk amid COVID-19"}, {"paperId": "2252ff78553a8ffd0d5b08582a8b640b051b29e4", "title": "How to Optimize an Academic Team When the Outlier Member is Leaving?"}, {"paperId": "eb2382bf1e78c83e6f17860f1e60b5d8f3c99a87", "title": "Network embedding: Taxonomies, frameworks and applications"}, {"paperId": "47b9c8d3fb275ff62e634737c583f407ec09abaa", "title": "Data-driven Computational Social Science: A Survey"}, {"paperId": "6325fe2bdf94b7aaa9d8d5ba6483facf7f732f3a", "title": "Multivariate Relations Aggregation Learning in Social Networks"}, {"paperId": "bc10f074708aa95fb072fee68bd5ff0336652168", "title": "Shifu2: A Network Representation Learning Based Model for Advisor-Advisee Relationship Mining"}, {"paperId": "280652fec4b585b8e233e05416a1133e5d8e99b8", "title": "Scholarly Collaboration Patterns Analytics: Moroccan Research Use Case"}, {"paperId": "7a13d1d257c4f28c5d1b45d1f702e384feb9537f", "title": "A Hybrid Recommendation Model Based on Time Dimension for Academic Teams"}, {"paperId": "2da33be4ccb9e3785e823631b5edd23d3bb5271d", "title": "TOSNet: A Topic-Based Optimal Subnetwork Identification in Academic Networks"}]}
