{"paperId": "1fe39616ad793c53c55ca9dfc03072d4df9ed12e", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "A Management Specification for Data Sharing Security in the System Construction of Smart Mine", "abstract": "With the development of Internet of Things technology and the informatization of the coal industry, various intelligent applications have emerged in the process of the system construction of the smart mine. During this process, data sharing is essential to the effective use of data resources in the smart mine. In order to improve the protection of coal mine data, this study proposes a set of management specifications for data sharing applied to the system construction of a smart mine to unify security standards in data storage and sharing. It standardizes the processes of data collection, transmission, and storage. We design three subspecifications for these processes, namely, data source specification, data quality specification, and data storage specification. The data source specification specifies the data collection and transmission standards to improve the security and timeliness of data sharing. The data quality specification sets three evaluation criteria of integrity, accuracy, and timeliness according to the characteristics of each business system and data. The system ensures data quality during data sharing by governing and recording the data failing to meet the criteria. The data storage specification specifies the data storage protocol, data label, and data set restrictions. Only authorized platforms and users can share data and make use of data labels to search data efficiently. Finally, we constructed a coal mine data collection and analysis system. It can collect, manage, store, and safely share the real measured data from a certain colliery according to the specifications.", "venue": "Security and Communication Networks", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-29", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2222373107", "name": "Haitao Wang"}, {"authorId": "2190920072", "name": "Lina Tan"}, {"authorId": "2223203221", "name": "Yang Zhang"}, {"authorId": "2154051480", "name": "Qiwen Gong"}, {"authorId": "2190846097", "name": "Shan Zhang"}, {"authorId": "2109899391", "name": "Yanan Ren"}, {"authorId": "2153238733", "name": "Tao He"}], "citations": []}
