{"paperId": "1fe5c8bfd3200991a5c66635718a161395565e33", "publicationVenue": null, "title": "Influence of Management Competency on Performance of Family Planning Programs in Kuresoi North Sub-County, Nakuru County, Kenya", "abstract": "This study investigated management competency influence on performance of family planning program in Kuresoi North Sub-County, Nakuru County, Kenya. The study was founded on the theory of constraint and adopted a pragmatism paradigm. It applied descriptive research method using mixed method approach to investigate the influence of management competency on performance of family planning program in Kuresoi North Sub-County, Nakuru County, Kenya. The target population in the study was women of reproductive age in 33,482 households distributed in the four Wards of Kuresoi North Sub-County and 19 health management leaders in-charge of all government health facilities offering family planning services in the Sub-County. A sample size of 400 of women of reproductive age and 19 nursing officers in-charge of government health facilities was utilized. The data collection tools used were questionnaire, interview guide, and observation checklist for women of reproductive age and the interview guide for the health facility managers. The research study adopted stratified sampling method. Qualitative data was analyzed according to themes and patterns and then summarizing the data and linking it to objectives and hypothesis. The study findings indicate that there is moderate management efficiency, exhibited pertaining to family planning in the dispensaries and health centers located in Kuresoi North Sub-County. Further findings exhibited that there was a significant and strong positive individual correlation between management competency and performance of family planning program in Kuresoi North Sub-County. Finally, the study findings also exhibited that there is a significant positive relationship between management competency and performance of family planning program in Kuresoi North Sub-County and it predicted the performance of family planning programmes. in Kuresoi North Sub-County.", "venue": "", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2020-06-01", "journal": {"name": "European Journal of Business and Management", "volume": "5"}, "authors": [{"authorId": "66837993", "name": "J. Wambugu"}, {"authorId": "80841856", "name": "D. Kyalo"}, {"authorId": "98265462", "name": "J. Mbugua"}, {"authorId": "84534172", "name": "R. Mutave"}], "citations": []}
