{"paperId": "1fe94efc2d0861f8f6faa6eab8178bef0dc00124", "publicationVenue": null, "title": "A Performance Study of Big Spatial Data Systems", "abstract": "With the accelerated growth in spatial data volume, being generated from a wide variety of sources, the need for efficient storage, retrieval, processing and analyzing of spatial data is ever more important. Hence, spatial data processing system has become an important field of research. In recent times a number of Big Spatial Data systems have been proposed by researchers around the world. These systems can be roughly categorized into Apache Hadoop-based and in-memory systems based on Apache Spark. The available features supported by these systems vary widely. However, there has not been any comprehensive evaluation study of these systems in terms of performance, scalability and functionality. To address this need, we propose a benchmark to evaluate Big Spatial Data systems. Although, Spark is a very popular framework, its performance is limited by the overhead associated with distributed resource management and coordination. The Big Spatial Data systems that are based on Spark, are also constrained by these. We introduce SpatialIgnite, a Big Spatial Data system that we have developed based on Apache Ignite. We investigate the present status of the Big Spatial Data systems by conducting a comprehensive feature analysis and performance evaluation of a few representative systems with our benchmark. Our study shows that SpatialIgnite performs better than Hadoop and Spark based systems that we have evaluated.", "venue": "BigSpatial@SIGSPATIAL", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-11-06", "journal": {"name": "Proceedings of the 7th ACM SIGSPATIAL International Workshop on Analytics for Big Geospatial Data"}, "authors": [{"authorId": "2109951131", "name": "M. Alam"}, {"authorId": "144540209", "name": "S. Ray"}, {"authorId": "1703918", "name": "V. Bhavsar"}], "citations": [{"paperId": "8406c0ce2b9a2983976f2149f31724e94bc3fd3b", "title": "Scalable Spatial Analytics and In Situ Query Processing in DaskDB"}, {"paperId": "052f440686ec0bd4535d536dae559003711a33a3", "title": "GeoYCSB: A Benchmark Framework for the Performance and Scalability Evaluation of Geospatial NoSQL Databases"}, {"paperId": "3d7afe0267bada957aa2810c40b3b922b7b2c78f", "title": "Big Spatial Data Systems - A review"}, {"paperId": "0a2cb7eb17c320ecec3581ce4368e9cb53d2ff96", "title": "REIP: A Reconfigurable Environmental Intelligence Platform and Software Framework for Fast Sensor Network Prototyping"}, {"paperId": "bfe0e6dda5d8420a951c5a8bae4c48179bb77280", "title": "A Survey on Big Data Processing Frameworks for Mobility Analytics"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "d553753a4db9eeb739549b51ce49cfa854e5abf9", "title": "Analyzing spatial analytics systems based on Hadoop and Spark: A user perspective"}, {"paperId": "6c2780f5f2152bc1fc514dcd816f5350d6e5d1e8", "title": "A Two-level Spatial In-Memory Index"}, {"paperId": "f116c5eacf6c743145722d820fd387fd72e89f87", "title": "GeoYCSB: A Benchmark Framework for the Performance and Scalability Evaluation of NoSQL Databases for Geospatial Workloads"}, {"paperId": "3d1ca6fe15e7ccc7ca942c268c7ffccbeedd502e", "title": "Parallel Insertion and Indexing Method for Large Amount of Spatiotemporal Data Using Dynamic Multilevel Grid Technique"}, {"paperId": "d039cdef2e9d8564a12e061a192566bb1afd104b", "title": "Comparative Analysis of Spark and Ignite for Big Spatial Data Processing"}, {"paperId": "ccafce4b84df8a77ec37aa3edc6eeb025daad699", "title": "Parallel and In-Memory Big Spatial Data Processing Systems and Benchmarking"}]}
