{"paperId": "1ffc449f4fc3a2310b5ebc4a59f0cebce94eb179", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) Network Analysis for Identifying and Characterizing Disease Outbreak Influence from Voluminous Epidemiology Data", "abstract": "—Planning for large-scale epidemiological outbreaks in livestock populations often involves executing compute-intensive disease spread simulations. To capture the probabilities of various outcomes, these simulations are executed several times over a collection of representative input scenarios, producing voluminous data. The resulting datasets contain valuable insights, including sequences of events that lead to extreme outbreaks. However, discovering and leveraging such information is also computationally expensive. In this study, we propose a distributed approach for analyzing voluminous epidemiology data to locate and classify the most influential entities in a disease outbreak. Using our disease transmission network (DTN), planners or analysts can isolate entities that have a disproportionate effect on epidemiological outcomes, enabling effective allocation of limited resources such as vaccinations and field personnel. We use a representative dataset to verify our approach, including identification of influential entities and creation of machine learning models for accurate classifications that generalize to other datasets.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "40394278", "name": "N. Shah"}, {"authorId": "2068796493", "name": "Harshil Shah"}, {"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "4c85dce46ecc5ace2438be0eef5bdc761d4e2fa8", "title": "Rapid, Progressive Sub-Graph Explorations for Interactive Visual Analytics over Large-Scale Graph Datasets"}, {"paperId": "bd989e7f50590851854d07e96a8dcc52e48917f6", "title": "When resolution does matter: Modelling indirect contacts in dairy farms at different levels of detail"}, {"paperId": "1f837196a691e2a2ffa940cdc1105886b54df529", "title": "Scalable network analytics for characterization of outbreak influence in voluminous epidemiology datasets"}]}
