{"paperId": "2014f0975363fe79f4eaff258006e338afa6a137", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Glinda: Supporting Data Science with Live Programming, GUIs and a Domain-specific Language", "abstract": "Researchers have explored several avenues to mitigate data scientists’ frustrations with computational notebooks, including: (1) live programming, to keep notebook results consistent and up to date; (2) supplementing scripting with graphical user interfaces (GUIs), to improve ease of use; and (3) providing domain-specific languages (DSLs), to raise a script’s level of abstraction. This paper introduces Glinda, which combines these three approaches by providing a live programming experience, with interactive results, for a domain-specific language for data science. The language’s compiler uses an open-ended set of “recipes” to execute steps in the user’s data science workflow. Each recipe is intended to combine the expressiveness of a written notation with the ease-of-use of a GUI. Live programming provides immediate feedback to a user’s input, whether in the form of program edits or GUI gestures. In a qualitative evaluation with 12 professional data scientists, participants highly rated the live programming and interactive results. They found the language productive and sufficiently expressive and suggested opportunities to extend it.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-05-06", "journal": {"name": "Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "1710751", "name": "R. Deline"}], "citations": [{"paperId": "5c707c95cf59d9de7f05914374e720b9f02f8ef0", "title": "Can GPT-4 Replicate Empirical Software Engineering Research?"}, {"paperId": "676a395973c5ba085e07ede7da11cead9102f441", "title": "Supporting Exploratory Programming in Domain-Specific Applications"}, {"paperId": "4e5239bb3f1438e89f3e6653d1465b656228da88", "title": "Octave: An End-User Programming Environment for Analysis of Spatiotemporal Data for Construction Students"}, {"paperId": "b06d3aa475c99a650f03e4e6e2c61d4aec31cb8e", "title": "Detangler: Helping Data Scientists Explore, Understand, and Debug Data Wrangling Pipelines"}, {"paperId": "9b08d934b652364eed8dafae9868419637fd1606", "title": "How Do Analysts Understand and Verify AI-Assisted Data Analyses?"}, {"paperId": "b410a7465c4726f5957b7bddf5e882ea17ade70a", "title": "Imprimer: Computational Notebooks for CNC Milling"}, {"paperId": "b0335eb2b9a1684fc16ff79234f0b206b30da169", "title": "A Study of Editor Features in a Creative Coding Classroom"}, {"paperId": "0192638593c430e15e2804a74a3e8a7ecb52d435", "title": "On the Design of AI-powered Code Assistants for Notebooks"}, {"paperId": "78c78c0fbcf2d0ac2a58b4882429d95b10cae558", "title": "Improving Programming for Exploratory Digital Fabrication with Inline Machine Control and Styled Toolpath Visualizations"}, {"paperId": "93c19e2949c095ecda7040201818e259d13fa33e", "title": "No Grammar to Rule Them All: A Survey of JSON-style DSLs for Visualization"}, {"paperId": "eaf3352609c99271bfb905e2598e1f4bd0e3b84a", "title": "Characterizing Practices, Limitations, and Opportunities Related to Text Information Extraction Workflows: A Human-in-the-loop Perspective"}, {"paperId": "59cad9487a3632a9fb697a9d58c2b30040e9366d", "title": "Diff in the Loop: Supporting Data Comparison in Exploratory Data Analysis"}, {"paperId": "ee8b04a0586cda1ef26593df6a3191654e3e09c7", "title": "Symphony: Composing Interactive Interfaces for Machine Learning"}, {"paperId": "efef43ad9bd7bfe0d91eb006df3d9543b2c747f5", "title": "Pyxis: A Programmatic Definition of Visualization Insights, Objectives, and Tasks"}, {"paperId": "2aa23effbd01a78fb9bf44e8699c15cddd671a22", "title": "A Programmatic Definition of Visualization Tasks, Insights, and Objectives"}, {"paperId": "db0cd343ceb532ae48d1e0b3e701fd606d5ddfb5", "title": "Design Spaces of Domain-Specific Languages Comparing and Contrasting Approaches in PL and HCI"}]}
