{"paperId": "2016d27daf8e8f2f44da8761502169464bcb364f", "publicationVenue": null, "title": "The Impact of Big Data Analytics on the Employment of Technical Graduates in the IT Industry", "abstract": "This systematic literature review examines the employment of technical graduates in the field of big data analytics across a range of industries, including IT, finance, healthcare, retail, and logistics. The review synthesizes the findings of 23 studies published between 2012 and 2023, using a combination of quantitative, qualitative, and mixed-methods approaches. The review highlights the growing demand for technical graduates with skills in data analysis, data science, machine learning, and AI, as organizations seek to leverage the power of big data to improve decision-making, optimize operations, and enhance customer experience. However, the review also identifies several challenges associated with big data analytics and technical graduate employment, including the shortage of qualified candidates for data analysis and data science roles, and the need for technical graduates to possess a range of soft skills beyond technical knowledge. The review also highlights the potential of big data analytics to transform industries and create new job roles, such as in healthcare informatics, logistics optimization, and data governance. This trend is likely to continue in the coming years, as organizations increasingly rely on big data to drive innovation and gain a competitive advantage. Overall, this review un - derscores the importance of preparing technical graduates for the rapidly evolving field of big data analytics, and the need for ongoing research and innovation in this area. Employers, educators, and policymakers may need to adapt their strategies to meet the evolving needs of the labor market and ensure that technical graduates are well-positioned to succeed in their careers and contribute to the broader economy.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2238036279", "name": "Admas Abtew"}, {"authorId": "47332714", "name": "Amanuel Assefa"}], "citations": []}
