{"paperId": "201bc76ab52c66beafde66ed1153d160ff01c83e", "publicationVenue": {"id": "38e26272-f1d7-470a-a99f-0b5884c9df6e", "name": "De Computis", "alternate_names": ["Comput"], "issn": "1886-1881", "url": "https://dialnet.unirioja.es/servlet/revista?clave_revista=6205&tipo_busqueda=CODIGO", "alternate_urls": ["http://decomputis.org/ojs/", "https://ideas.repec.org/s/dec/articl.html", "http://www.decomputis.org/"]}, "title": "Generic IoT for Smart Buildings and Field-Level Automation - Challenges, Threats, Approaches, and Solutions", "abstract": "Smart home and building systems are popular solutions that support maintaining comfort and safety and improve energy efficiency in buildings. However, dynamically developing distributed network technologies, in particular the Internet of Things (IoT), are increasingly entering the above-mentioned application areas of building automation, offering new functional possibilities. The result of these processes is the emergence of many different solutions that combine field-level and information and communications technology (ICT) networks in various configurations and architectures. New paradigms are also emerging, such as edge and fog computing, providing support for local monitoring and control networks in the implementation of advanced functions and algorithms, including machine learning and artificial intelligence mechanisms. This paper collects state-of-the-art information in these areas, providing a systematic review of the literature and case studies with an analysis of selected development trends. The author systematized this information in the context of the potential development of building automation systems. Based on the conclusions of this analysis and discussion, a framework for the development of the Generic IoT paradigm in smart home and building applications has been proposed, along with a strengths, weaknesses, opportunities, and threats (SWOT) analysis of its usability. Future works are proposed as well.", "venue": "De Computis", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-03", "journal": {"name": "Comput.", "pages": "45", "volume": "13"}, "authors": [{"authorId": "2075472337", "name": "A. Ożadowicz"}], "citations": []}
