{"paperId": "201b46b8f046329fecd316d182c4afe3714f8222", "publicationVenue": {"id": "20e3e0c7-fed4-4b57-a89c-0c9956afb80b", "name": "Conference on Learning for Dynamics & Control", "type": "conference", "alternate_names": ["L4DC", "Conf Learn Dyn  Control"]}, "title": "Counterfactual Programming for Optimal Control", "abstract": "In recent years, considerable work has been done to tackle the issue of designing control laws based on observations to allow unknown dynamical systems to perform pre-specified tasks. At least as important for autonomy, however, is the issue of learning which tasks can be performed in the first place. This is particularly critical in situations where multiple (possibly conflicting) tasks and requirements are demanded from the agent, resulting in infeasible specifications. Such situations arise due to over-specification or dynamic operating conditions and are only aggravated when the dynamical system model is learned through simulations. Often, these issues are tackled using regularization and penalties tuned based on application-specific expert knowledge. Nevertheless, this solution becomes impractical for large-scale systems, unknown operating conditions, and/or in online settings where expert input would be needed during the system operation. Instead, this work enables agents to autonomously pose, tune, and solve optimal control problems by compromising between performance and specification costs. Leveraging duality theory, it puts forward a counterfactual optimization algorithm that directly determines the specification trade-off while solving the optimal control problem.", "venue": "Conference on Learning for Dynamics & Control", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-29", "journal": {"pages": "235-244"}, "authors": [{"authorId": "2120186", "name": "Luiz F. O. Chamon"}, {"authorId": "2856943", "name": "Santiago Paternain"}, {"authorId": "152551711", "name": "Alejandro Ribeiro"}], "citations": [{"paperId": "a933288acfab96c5e5a2519eeb05479ee33bef2c", "title": "Learning Resilient Radio Resource Management Policies With Graph Neural Networks"}, {"paperId": "a99076691b9fbf3435e653252e816dda9826fcec", "title": "Wireless Power Control via Counterfactual Optimization of Graph Neural Networks"}]}
