{"paperId": "201d39f23011e6d7fe87f27c5d0231e45709e573", "publicationVenue": {"id": "87ad3a52-6dd9-45bd-a0f2-f87453c491ed", "name": "International Conference on Knowledge and Systems Engineering", "type": "conference", "alternate_names": ["KSE", "Int Conf Knowl Syst Eng", "Knowledge and Systems Engineering", "Knowl Syst Eng"], "url": "http://www.wikicfp.com/cfp/program?id=1922"}, "title": "Wearable Devices for Monitoring Dementia Sufferers: A Review and Framework for Discussion", "abstract": "A growing number of people suffer from dementia and need to be monitored for safety. Options are nursing homes or home monitoring through smart devices. This article aims to provide an overview of available technology for indoor and outdoor monitoring. We also propose a framework through which current and future systems can be evaluated consisting of Data, Transfer and Storage and Monitoring (DTSM). We analyze wearable devices, means of data collection and data transfer, data accessibility during storage and throughout analysis. We evaluate the DTSM framework in terms of completeness and acceptance. 30 state of the art research papers are classified to identify systems components, evaluated against the DTSM taxonomy. This research contributes to future systems development underpinning wearable devices for the purpose of tracking human activities.", "venue": "International Conference on Knowledge and Systems Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-10-01", "journal": {"name": "2019 11th International Conference on Knowledge and Systems Engineering (KSE)", "pages": "1-7"}, "authors": [{"authorId": "1452353969", "name": "Ashok Dhakal"}, {"authorId": "1847642", "name": "A. Alsadoon"}, {"authorId": "145652146", "name": "P. Prasad"}, {"authorId": "3485536", "name": "Angelika Maag"}, {"authorId": "145616358", "name": "A. Elchouemi"}, {"authorId": "1452350132", "name": "Win Maung"}, {"authorId": "148307797", "name": "V. Nguyen"}], "citations": [{"paperId": "ebc62e03ff2682327c69a4baceb624256fceb039", "title": "AI Based Third Eye for Alzheimer Patient"}, {"paperId": "c6319f17641dd0fc44d041b64234db3ca703bb21", "title": "Monitoring behavioral symptoms of dementia using activity trackers"}]}
