{"paperId": "203278b671b1894d603451b41017e2ad227a3bd3", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "FusionFlow: Accelerating Data Preprocessing for Machine Learning with CPU-GPU Cooperation", "abstract": "Data augmentation enhances the accuracy of DL models by diversifying training samples through a sequence of data transformations. While recent advancements in data augmentation have demonstrated remarkable efficacy, they often rely on computationally expensive and dynamic algorithms. Unfortunately, current system optimizations, primarily designed to leverage CPUs, cannot effectively support these methods due to costs and limited resource availability.\n To address these issues, we introduce FusionFlow, a system that cooperatively utilizes both CPUs and GPUs to accelerate the data preprocessing stage of DL training that runs the data augmentation algorithm. FusionFlow orchestrates data preprocessing tasks across CPUs and GPUs while minimizing interference with GPU-based model training. In doing so, it effectively mitigates the risk of GPU memory overflow by managing memory allocations of the tasks within the GPU-wide free space. Furthermore, FusionFlow provides a dynamic scheduling strategy for tasks with varying computational demands and reallocates compute resources on the fly to enhance training throughput for both single and multi-GPU DL jobs. Our evaluations show that FusionFlow outperforms existing CPU-based methods by 16--285% in single-machine scenarios and, to achieve similar training speeds, requires 50--60% fewer CPUs compared to utilizing scalable compute resources from external servers.", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "Proceedings of the VLDB Endowment"}, "authors": [{"authorId": "2111033673", "name": "Taeyoon Kim"}, {"authorId": "2290682353", "name": "Chanho Park"}, {"authorId": "2290580990", "name": "Mansur Mukimbekov"}, {"authorId": "2290907807", "name": "Heelim Hong"}, {"authorId": "2290542690", "name": "Minseok Kim"}, {"authorId": "2291129133", "name": "Ze Jin"}, {"authorId": "2290825951", "name": "Changdae Kim"}, {"authorId": "2290625221", "name": "Ji-Yong Shin"}, {"authorId": "2285140747", "name": "Myeongjae Jeon"}], "citations": []}
