{"paperId": "2032aa3ea996e32b45890e9d5bfae4638af2b3cc", "publicationVenue": {"id": "22c9862f-a25e-40cd-9d31-d09e68a293e6", "name": "Machine-mediated learning", "type": "journal", "alternate_names": ["Mach learn", "Machine Learning", "Mach Learn"], "issn": "0732-6718", "alternate_issns": ["0885-6125"], "url": "http://www.springer.com/computer/artificial/journal/10994", "alternate_urls": ["https://link.springer.com/journal/10994", "http://www.springer.com/west/home/computer/artificial?SGWID=4-147-70-35726603-0"]}, "title": "Dynamic Datasets and Market Environments for Financial Reinforcement Learning", "abstract": "The financial market is a particularly challenging playground for deep reinforcement learning due to its unique feature of dynamic datasets. Building high-quality market environments for training financial reinforcement learning (FinRL) agents is difficult due to major factors such as the low signal-to-noise ratio of financial data, survivorship bias of historical data, and model overfitting. In this paper, we present FinRL-Meta, a data-centric and openly accessible library that processes dynamic datasets from real-world markets into gym-style market environments and has been actively maintained by the AI4Finance community. First, following a DataOps paradigm, we provide hundreds of market environments through an automatic data curation pipeline. Second, we provide homegrown examples and reproduce popular research papers as stepping stones for users to design new trading strategies. We also deploy the library on cloud platforms so that users can visualize their own results and assess the relative performance via community-wise competitions. Third, we provide dozens of Jupyter/Python demos organized into a curriculum and a documentation website to serve the rapidly growing community. The open-source codes for the data curation pipeline are available at https://github.com/AI4Finance-Foundation/FinRL-Meta", "venue": "Machine-mediated learning", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-25", "journal": {"name": "ArXiv", "volume": "abs/2304.13174"}, "authors": [{"authorId": "4029028", "name": "Xiao-Yang Liu"}, {"authorId": "2186589721", "name": "Ziyi Xia"}, {"authorId": "1504453822", "name": "Hongyang Yang"}, {"authorId": "1505808706", "name": "Jiechao Gao"}, {"authorId": "1759658", "name": "D. Zha"}, {"authorId": "2152184398", "name": "Ming Zhu"}, {"authorId": "2118324724", "name": "Chris Wang"}, {"authorId": "50218397", "name": "Zhaoran Wang"}, {"authorId": "2148900809", "name": "Jian Guo"}], "citations": [{"paperId": "3acbf1d22ffafef3f310377a8466f3254ad89e36", "title": "FNSPID: A Comprehensive Financial News Dataset in Time Series"}, {"paperId": "c3bacc93d8c0c6ed31763d0c0fc7951f0ab82ed8", "title": "Differentially Private Low-Rank Adaptation of Large Language Model Using Federated Learning"}, {"paperId": "6121fb3e393597e02481a516f0035f06ec9a5836", "title": "FinGPT: Democratizing Internet-scale Data for Financial Large Language Models"}]}
