{"paperId": "20346e4e3597a0e7b4591695972b3ce576b87a2f", "publicationVenue": {"id": "cbc4d7be-e64a-4b62-960b-3eaab7e77d51", "name": "IEEE VLSI Test Symposium", "type": "conference", "alternate_names": ["IEEE VLSI Test Symp", "VTS", "VLSI Test Symp", "VLSI Test Symposium"], "url": "http://www.tttc-vts.org/"}, "title": "On Workload-Aware DRAM Failure Prediction in Large-Scale Data Centers", "abstract": "DRAM failures are one of the major hardware threats to the reliability of large-scale data centers since the uncorrectable errors in DRAMs may cause servers to shut down. Existing works try to solve this problem by predicting DRAM failures in advance with Machine Learning models. In these works, correctable errors (CEs) are generally deemed as the most important feature. The major reason behind CEs’ emergence is the accumulated stress caused by intensive workloads. Moreover, defective DRAMs will not manifest themselves as system errors until the defective cells are accessed by some specific workloads. Therefore, the running workloads on a server are also important for DRAM failure prediction. In this paper, we focus on the impact of workloads on DRAM failures. We design the workload features from both macroscopical and microscopical aspects, i.e. node-level performance metrics and cell-level DRAM access pattern, respectively. Furthermore, we propose Hierarchical DRAM Error Code (HiDEC) to represent the DRAM access pattern. We leverage several Decision Tree-based models for DRAM failure prediction to highlight the generality of our designed features. Experiments are carried out based on the dataset collected from a real-world commercial data center. The results show that both macroscopic and microscopic features can bring significant improvements to the prediction performance.", "venue": "IEEE VLSI Test Symposium", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-25", "journal": {"name": "2021 IEEE 39th VLSI Test Symposium (VTS)", "pages": "1-6"}, "authors": [{"authorId": "2144803278", "name": "Xingyi Wang"}, {"authorId": "2116611953", "name": "Yu Li"}, {"authorId": "2109360977", "name": "Yiquan Chen"}, {"authorId": "2108566961", "name": "Shiwen Wang"}, {"authorId": "2108521490", "name": "Yin Du"}, {"authorId": "2087126508", "name": "Cheng He"}, {"authorId": "2216873097", "name": "YuZhong Zhang"}, {"authorId": "2119040352", "name": "Pinan Chen"}, {"authorId": "2153899373", "name": "Xin Li"}, {"authorId": "1410015416", "name": "W. Song"}, {"authorId": "2149106517", "name": "Qiang Xu"}, {"authorId": "2108810808", "name": "Li Jiang"}], "citations": [{"paperId": "53787a15a18df3784ce3d096584d3d219790e37a", "title": "Exploring Error Bits for Memory Failure Prediction: An In-Depth Correlative Study"}, {"paperId": "b0e4ec6482d760235217bc579b0bbe3bcc55a46c", "title": "EXPERT: EXPloiting DRAM ERror Types to Improve the Effective Forecasting Coverage in the Field"}, {"paperId": "0b0893c965adbbefd119b08380a7d4038fd1cbe9", "title": "HiMFP: Hierarchical Intelligent Memory Failure Prediction for Cloud Service Reliability"}, {"paperId": "3d587bba76db564314c598af7106027b5414dd47", "title": "First CE Matters: On the Importance of Long Term Properties on Memory Failure Prediction"}, {"paperId": "742b3204f3eb80a3766abdea4acc04ffcbe83840", "title": "An In-Depth Correlative Study Between DRAM Errors and Server Failures in Production Data Centers"}, {"paperId": "35d13a1a51e2915d317c299fa34c108296e078d6", "title": "A survey on AI for storage"}, {"paperId": "89f01b844ef744336ea31991a972d1780cc3e69f", "title": "Review of Memory RAS for Data Centers"}]}
