{"paperId": "2038813faa6170a4fdb3fbecb254323147e8b28f", "publicationVenue": {"id": "d6180871-4deb-4dbd-abe9-a451beee5571", "name": "Jurnal Teknologi Informasi dan Pendidikan", "type": "journal", "alternate_names": ["J Teknol Inf dan Pendidik"], "issn": "2086-4981", "url": "http://tip.ppj.unp.ac.id/index.php/tip/home"}, "title": "ANALYSIS OF THE USE OF THE BEBUNGE APPLICATION USING END USER COMPUTING SATISFACTION MODEL", "abstract": "The Bekasi district Government already has an integrated service application, namely Bebunge or Bekasi Nyambung Bae. This application is the beginning of a part of the Bekasi district plan to prepare Bekasi for a Smart City. Through the Bebunge application, Bekasi residents can get information for population needs. However, to what extent is the satisfaction of Bekasi society with the Bebunge application so that the Bekasi government can get an evaluation of application usage by looking at the level of user satisfaction. This study analyzes the level of user satisfaction of the Bebunge application using the End User Computing Satisfaction (EUCS) model. The questionnaire analysis method uses inferential statistical analysis with Smart PLS media. Based on the guidelines for the level of satisfaction, the results of the study show that if the satisfaction level of Bekasi society is at an average value of 3.45, which is at level 4, it means that Bekasi society generally uses the Bebunge application with moderate intensity and find the Bebunge practical application. The recommendation for the Bebunge application is that additional features are needed to access job vacancies, information on the latest status updates for COVID-19 in Bekasi, and an Update on the status of the COVID-19 zone in Bekasi. The contribution of this study is to improve the functionality of the Bebunge application for Bekasi society. The second contribution of this study is to become a reference for researchers from the subdomain of smart cities, namely smart society", "venue": "Jurnal Teknologi Informasi dan Pendidikan", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-14", "journal": {"name": "Jurnal Teknologi Informasi dan Pendidikan"}, "authors": [{"authorId": "97794194", "name": "R. Setyadi"}, {"authorId": "2137257319", "name": "Muhammad Hamzah Baqi"}], "citations": [{"paperId": "c4ac1ba9f361fef11c674334b5394491ab9832d8", "title": "Low Citizen E-Participation Within the Bekasi Nyambung Bae Complaint Service in Bekasi Regency"}, {"paperId": "77c037e65ab14d7912fdf714ee863641a19c8911", "title": "College Student's Perception toward \" Peduli Lindungi\" Application through the Usability Scale Method"}]}
