{"paperId": "2042a737e967b079f8ef63584a7701fc024b8981", "publicationVenue": null, "title": "Recurring Threats to Smart Healthcare Systems Based on Machine Learning", "abstract": "Accurate analysis of illness diagnosis, progression, and real-time monitoring, made possible by the ever-increasing availability of healthcare data, is essential for providing better therapies to patients. To detect various diseases and patient behaviors in a SHS (Smart Healthcare System), ML models extract useful characteristics and insights from high-dimensional and heterogeneous healthcare data (SHS). Recent studies, however, reveal that ML models used in a variety of sectors are vulnerable to malicious assaults. In this research, we provide a novel kind of adversarial assaults that may be utilized to undermine the efficacy of SHS machine learning classifiers. Here, we take into account an adversary who may launch both targeted and non-targeted assaults thanks to their partial understanding of the ML algorithm, SHS model, and data distribution. Using these deceptive powers, we modify patient status (diseased, normal condition, activities, etc.) as reported by the SHS by manipulating the readings from medical devices. Five adversarial ML algorithms (Fast Gradient Method, Carlini & Wagner, Crafting Decision Tree, HopSkipJump, and Zeroth Order Optimization) are used in our attack to mislead a SHS in various ways (e.g.., poisoning its input data or incorrectly labelling its outputs). We also conduct black box and white box assaults on a SHS depending on the capabilities of an opponent during the training and testing phases. We test how well our solutions operate in various SHS environments and on a variety of medical equipment. Extensive testing demonstrates that our suggested adversarial or recurring approach may result in a significant decrease in efficacy of an ML-based SHS in accurately identifying illnesses and normal behaviors of the patients, leading to inappropriate therapy.", "venue": "2022 10th International Conference on Reliability, Infocom Technologies and Optimization (Trends and Future Directions) (ICRITO)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-13", "journal": {"name": "2022 10th International Conference on Reliability, Infocom Technologies and Optimization (Trends and Future Directions) (ICRITO)", "pages": "1-8"}, "authors": [{"authorId": "1517962889", "name": "Amit Sundas"}, {"authorId": "74255936", "name": "Sumit Badotra"}], "citations": [{"paperId": "d743c98ddf2a0034399e32644a01094755070637", "title": "Investigating the Role of Machine Learning Algorithms in Predicting Sepsis using Vital Sign Data"}]}
