{"paperId": "20464cd1501b838011a984deecdf6cbc3a77494f", "publicationVenue": null, "title": "The Power of Nested Parallelism in Big Data Processing \u0096 Hitting Three Flies with One Slap \u0096", "abstract": "Many common data analysis tasks, such as performing hyperparameter optimization, processing a partitioned graph, and treating a matrix as a vector of vectors, offer natural opportunities for nested-parallel operations, i.e., launching parallel operations from inside other parallel operations. However, state-of-the-art dataflow engines, such as Spark and Flink, do not support nested parallelism. Users must implement workarounds, causing orders of magnitude slowdowns for their tasks, let alone the implementation effort. We present Matryoshka, a system that enables dataflow engines to support nested parallelism, even in the presence of control flow statements at inner nesting levels. Matryoshka achieves this via a novel two-phase flattening process, which translates nested-parallel programs to flat-parallel programs that can efficiently run on existing dataflow engines. The first phase introduces novel nesting primitives into the code, which allows for dynamic optimizations based on intermediate data characteristics in the second phase at runtime. We validate our system using several common data analysis tasks, such as PageRank and K-means.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2847234", "name": "G. Gévay"}, {"authorId": "1399355221", "name": "Jorge-Arnulfo Quiané-Ruiz"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "5cbbe911564117fc4ac7c53866c189fe60166cad", "title": "SAGA: A Scalable Framework for Optimizing Data Cleaning Pipelines for Machine Learning Applications"}, {"paperId": "6b881dd1026adcbc8deffe85c1280ad54f1d3b71", "title": "UPLIFT: Parallelization Strategies for Feature Transformations in Machine Learning Workloads"}, {"paperId": "51b99c97496c8057e74f1caf4a4ec5703e398afe", "title": "Imperative or Functional Control Flow Handling"}, {"paperId": "d2d1248446703603ad9355ef83e5892412e3efa5", "title": "Handling Iterations in Distributed Dataflow Systems"}, {"paperId": "54dd03b0173840cd054884534b7ceb480390c8d1", "title": "Babelfish: Efficient Execution of Polyglot Queries"}, {"paperId": "53412d6f4bb6183832618188134656a8e8fdfce5", "title": "Functional Programming on Top of SQL Engines"}, {"paperId": "3c3f8344e58ff7a8ea9c924e428bda5b8c775df6", "title": "DAPHNE: An Open and Extensible System Infrastructure for Integrated Data Analysis Pipelines"}]}
