{"paperId": "2051272f8e4f5b90c1b9976e7334c7f734995403", "publicationVenue": null, "title": "Protection Schemes for DDoS, ARP Spoofing, and IP Fragmentation Attacks in Smart Factory", "abstract": "Industry Revolution 4.0 connects the Internet of Things (IoT) resource-constrained devices to Smart Factory solutions and delivers insights. As a result, a complex and dynamic network with a vulnerability inherited from the Internet becomes an attractive target for hackers to attack critical infrastructures. Therefore, this paper selects three potential attacks with the evaluation of the protections, namely (1) distributed denial of service (DDoS), (2) address resolution protocol (ARP) spoofing, and (3) Internet protocol (IP) fragmentation attacks. In the DDoS protection, the F1-score, accuracy, precision, and recall of the four-feature random forest with principal component analysis (RFPCA) model are 95.65%, 97%, 97.06%, and 94.29%, respectively. In the ARP spoofing, a batch processing method adopts the entropy calculated in the 20 s window with sensitivity to network abnormalities detection of various ARP spoofing scenarios involving victims’ traffic. The detected attacker’s MAC address is inserted in the block list to filter malicious traffic. The proposed protection in the IP fragmentation attack is implementing one-time code (OTC) and timestamp fields in the packet header. The simulation shows that the method detected 160 fake fragments from attackers among 2040 fragments.", "venue": "Syst.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-20", "journal": {"name": "Syst.", "pages": "211", "volume": "11"}, "authors": [{"authorId": "2150505511", "name": "Tze Uei Chai"}, {"authorId": "2949858", "name": "H. Goh"}, {"authorId": "2247444", "name": "S. Liew"}, {"authorId": "2321928", "name": "V. Ponnusamy"}], "citations": [{"paperId": "3596649e7c380072741b4d376ab1e88c09cbcff6", "title": "A comprehensive survey of performance, security and privacy issues in the network interface layer of the TCP/IP"}, {"paperId": "c62dcd6136ce3538ebdbbfb7641f327001d72842", "title": "Countering ARP Spoofing Attacks in Software-Defined Networks using a Game-Theoretic Approach"}]}
