{"paperId": "207be119a92827de805fbd0b10a0d635c10aefca", "publicationVenue": {"id": "965c5551-6445-4f91-9587-90e5ebffca81", "name": "Journal of Engineering Research and Sciences", "type": "journal", "alternate_names": ["J Eng Res Sci"], "issn": "2831-4085"}, "title": "Quantum Machine Learning on Remote Sensing Data Classification", "abstract": ": Information extracted from remote sensing data can be applied to monitor the business and natural environments of a geographic area. Although a wide range of classical machine learning techniques have been utilized to obtain such information, their performance differs greatly in classification accuracy. In this study, we aim to examine whether quantum-enhanced machine learning can improve the performance of classical machine learning algorithms in binary classifications of satellite remote sensing data. Using 16 pre-labeled datasets, we apply Support Vector Machine-quantum annealing solver (SVM-QA) - a type of quantum machine learning algorithm, with optimized (Gamma) value on the task of image classification and compare its results with the top performers of classical machine learning algorithms. The results show that in 10 out of 16 datasets, the hyper parameterized SVM-QA classifier outperforms the best classical machine learning algorithms in terms of classification accuracy. The findings suggest the potentiality of quantum computing in remote sensing. This study contributes to the literature of remote sensing image data classification and applications of quantum machine learning for problem solving.", "venue": "Journal of Engineering Research and Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "Journal of Engineering Research and Sciences"}, "authors": [{"authorId": "2237415470", "name": "Yi Liu"}, {"authorId": "2177228516", "name": "Wendy Wang"}, {"authorId": "2237084738", "name": "Haibo Wang"}, {"authorId": "145772697", "name": "B. Alidaee"}], "citations": []}
