{"paperId": "20829a8a12b249596d6a73e029c564fe7d2a3d33", "publicationVenue": {"id": "3d6827a9-8d5b-489b-ba8e-fb372b6e52e3", "name": "ACS Sensors", "type": "journal", "alternate_names": ["AC Sens"], "issn": "2379-3694", "url": "https://pubs.acs.org/journal/ascefj"}, "title": "Liquid Biopsy-Based Volatile Organic Compounds from Blood and Urine and Their Combined Data Sets for Highly Accurate Detection of Cancer.", "abstract": "Liquid biopsy is seen as a prospective tool for cancer screening and tracking. However, the difficulty lies in effectively sieving, isolating, and overseeing cancer biomarkers from the backdrop of multiple disrupting cells and substances. The current study reports on the ability to perform liquid biopsy without the need to physically filter and/or isolate the cancer cells per se. This has been achieved through the detection and classification of volatile organic compounds (VOCs) emitted from the cancer cells found in the headspace of blood or urine samples or a combined data set of both. Spectrometric analysis shows that blood and urine contain complementary or overlapping VOC information on kidney cancer, gastric cancer, lung cancer, and fibrogastroscopy subjects. Based on this information, a nanomaterial-based chemical sensor array in conjugation with machine learning as well as data fusion of the signals achieved was carried out on various body fluids to assess the VOC profiles of cancer. The detection of VOC patterns by either Gas Chromatography-Mass Spectrometry (GC-MS) analysis or our sensor array achieved >90% accuracy, >80% sensitivity, and >80% specificity in different binary classification tasks. The hybrid approach, namely, analyzing the VOC datasets of blood and urine together, contributes an additional discrimination ability to the improvement (>3%) of the model's accuracy. The contribution of the hybrid approach for an additional discrimination ability to the improvement of the model's accuracy is examined and reported.", "venue": "ACS Sensors", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-16", "journal": {"name": "ACS sensors"}, "authors": [{"authorId": "147897979", "name": "Reef Einoch Amor"}, {"authorId": "153236353", "name": "Jeremy Levy"}, {"authorId": "3782783", "name": "Y. Broza"}, {"authorId": "1417429375", "name": "R. Vangravs"}, {"authorId": "2181977938", "name": "Shelley Rapoport"}, {"authorId": "1700777", "name": "Min Zhang"}, {"authorId": "2110028283", "name": "Weiwei Wu"}, {"authorId": "3300092", "name": "M. Leja"}, {"authorId": "38038889", "name": "J. Behar"}, {"authorId": "3472428", "name": "H. Haick"}], "citations": [{"paperId": "15e8dd028b9739cdf0c47b8d6d9033980bee5aae", "title": "Overview of diagnostic tools and nano-based therapy of SARS-CoV-2 infection"}, {"paperId": "b7aecb12fe3b0e6481183f76f0bea99e2ab5ea8a", "title": "Early Detection of Prostate Cancer: The Role of Scent"}]}
