{"paperId": "2087ff48c25e60fbf1b33720f5bdc71554e6a2a9", "publicationVenue": {"id": "0ed0ece3-f3ec-4835-aaab-1d840a580c55", "name": "Computer systems science and engineering", "type": "journal", "alternate_names": ["Comput Syst Sci  Eng", "Computer Systems: Science & Engineering", "Comput syst sci eng"], "issn": "0267-6192"}, "title": "Residential Electricity Classification Method Based On Cloud Computing Platform and Random Forest", "abstract": "With the rapid development and popularization of new-generation technologies such as cloud computing, big data, and artificial intelligence, the construction of smart grids has become more diversified. Accurate quick reading and classification of the electricity consumption of residential users can provide a more in-depth perception of the actual power consumption of residents, which is essential to ensure the normal operation of the power system, energy management and planning. Based on the distributed architecture of cloud computing, this paper designs an improved random forest residential electricity classification method. It uses the unique out-of-bag error of random forest and combines the Drosophila algorithm to optimize the internal parameters of the random forest, thereby improving the performance of the random forest algorithm. This method uses MapReduce to train an improved random forest model on the cloud computing platform, and then uses the trained model to analyze the residential electricity consumption data set, divides all residents into 5 categories, and verifies the effectiveness of the model through experiments and feasibility.", "venue": "Computer systems science and engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Comput. Syst. Sci. Eng.", "pages": "39-46", "volume": "38"}, "authors": [{"authorId": "2150654904", "name": "Ming Li"}, {"authorId": "1410048102", "name": "Zhong-Xiu Fang"}, {"authorId": "2047934868", "name": "Wanwan Cao"}, {"authorId": "145424273", "name": "Yong Ma"}, {"authorId": "153078240", "name": "Shang Wu"}, {"authorId": "2155600309", "name": "Yang Guo"}, {"authorId": "2114921087", "name": "Y. Xue"}, {"authorId": "1935074", "name": "R. Mansour"}], "citations": [{"paperId": "09a753a4d7821db93fff8f86a5acf2646048d09f", "title": "Design of Fruit Fly Optimization Algorithm Based on Gaussian Distribution and Its Application to Image Processing"}, {"paperId": "4abe6cdca83cbfb0469fe408cafa07adf89d5784", "title": "Identification of fruit using a flexible tactile sensor array"}, {"paperId": "fd64be85fbeb79eded163d432ba4bb6c3d44a19b", "title": "Intelligent Monitoring of Power System Electricity Consumption Based on Isolation Forest Algorithm"}, {"paperId": "f977036182332da5d308a2b3b22d3e9478569567", "title": "A risk evaluation model of electric power cloud platform from the information perspective based on fuzzy type-2 VIKOR"}, {"paperId": "6d363fd5e51f0fe8d7019ca1cd77ba48437e9a44", "title": "A new method for constructing roads map in forest area using UAV images"}, {"paperId": "e39cd2f2f2c4bfa4267bca32080f1b806bafa844", "title": "A novel Drosophila‐back propagation method for the lithium‐ion battery state of charge estimation adaptive to complex working conditions"}, {"paperId": "d1982c50ad68d2f66a2ca3ed660863a06bd07d32", "title": "Research on Educational Information Platform Based on Cloud Computing"}, {"paperId": "f2e4be29f21fdca1c8d9077327e22c448caa181d", "title": "Retraction Retracted: Research on Educational Information Platform Based on Cloud Computing"}, {"paperId": "f62573985abd4500d90f840529023e53870c8ff9", "title": "Drone imagery forest fire detection and classification using modified deep learning model"}]}
