{"paperId": "2088e9ce7cea0715aa6e1bd5e35e409b1e010d7f", "publicationVenue": {"id": "79ad93e3-8152-45a5-a97c-d6c327592c09", "name": "IEEE International Conference on Electrical, Computer and Communication Technologies", "type": "conference", "alternate_names": ["ICECCT", "IEEE Int Conf Electr Comput Commun Technol"]}, "title": "Anatomization of Fog Computing and Edge Computing", "abstract": "Today’s business revolution depends on digital transformation. Public and private organization’s experts forecast the technology which plays a concrete role in their business processes steadfastly. Cloud computing plays a corporeal role in information technology operations to provide a low cost, dexterity, flexibility and scalability. Measureless IoT clients and its applications are urging to execute their business process intelligently and rapidly. Globalized process has been taken place in cloud computing, however this mobilized process is too slow to accommodate the time susceptible tasks [1]. Thus introducing next big computing technology termed as fog computing. The goal of Foggingis to implement the decentralized computing architecture, which distributes data, storage, compute and applications between the data source and the cloud. It outspreads the conception of cloud to the edge of the network and it is closely associated with IoT devices. To bring power to the cloud services, Fog computing scrutinizes and resolves the problem by keeping the data closerto the origin [9]. EdgeComputing empowers the data outcome by IoT devices. This IoT device’s process can be processed nearer to itsorigin. By doing this optimized process, long routes data transmission is eluded. Optimized data can be sent to the common data centers or clouds for further process.In this paper, discussed about an extensive similarities and dissimilarities of Cloud, Fog and Edge computing.", "venue": "IEEE International Conference on Electrical, Computer and Communication Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-02-01", "journal": {"name": "2019 IEEE International Conference on Electrical, Computer and Communication Technologies (ICECCT)", "pages": "1-6"}, "authors": [{"authorId": "1381691350", "name": "P. PunithaIlayarani"}, {"authorId": "1381691351", "name": "M. Maria Dominic"}], "citations": [{"paperId": "1cb1639c5ef40a4fd6be2c665b60c77815f38904", "title": "An efficient data replica placement mechanism using biogeography-based optimization technique in the fog computing environment"}]}
