{"paperId": "208dc9d832cf2888b8394d81f658bd856c7a0e81", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Analysis of Consumer IoT Device Vulnerability Quantification Frameworks", "abstract": "The increasing deployment of Internet of Things (IoT) devices in mission-critical systems has made them more appealing to attackers. Cyberattacks on IoT devices have the potential to expose sensitive data, disrupt operations, and even endanger lives. As a result, IoT security has recently gained traction in both industry and academia. However, no research has examined existing IoT vulnerability assessment frameworks in a systematic and comprehensive manner. To address this gap, this paper systematically reviews and analyses the research challenges and state-of-the-art IoT vulnerability assessment frameworks while taking into account both breadth and depth. The study provides insight into current IoT vulnerability assessment approaches, which is useful for ongoing efforts to characterise cybersecurity risks and manage IoT vulnerabilities. It will be of interest to a spectrum of readers, including those in the IoT research community, researchers in cybersecurity, risk and vulnerability management professionals, and others. By offering the latest perspective on the present IoT vulnerability assessment techniques, this study will raise IoT security awareness and facilitate research into IoT vulnerability assessment methodologies. The knowledge provided by this study will also be beneficial to future academics who are interested in the issues and solutions surrounding IoT security. The report also assists in understanding the research direction in IoT vulnerability assessment approaches, making it beneficial for those looking to create new methods for determining IoT vulnerabilities.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-28", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2210441565", "name": "Samira A. Baho"}, {"authorId": "1703056", "name": "J. Abawajy"}], "citations": [{"paperId": "634a71020c339061514082369817b0cb27e9fab7", "title": "Safeguarding Voice Privacy: Harnessing Near-Ultrasonic Interference To Protect Against Unauthorized Audio Recording"}, {"paperId": "b94956aa2643817d87dd5e27e4d316a21137d06b", "title": "A novel cloud-assisted framework for consumer internet of things based on lanner swarm optimization algorithm in smart healthcare systems"}, {"paperId": "e0a591418670bae3d2d0ae6c1ef28310e25cc826", "title": "An All-Inclusive Taxonomy and Critical Review of Blockchain-Assisted Authentication and Session Key Generation Protocols for IoT"}, {"paperId": "20180ce989688037ac17b2a8936c33d41afe189e", "title": "On the Design of Reconfigurable Edge Devices for RF Fingerprint Identification (RED-RFFI) for IoT Systems"}, {"paperId": "b2319ad4828be04bc873a55762cee49583740fb3", "title": "Counterattacking Cyber Threats: A Framework for the Future of Cybersecurity"}, {"paperId": "290af975639dc643cd2ae1fc5e2a7e41c5cd0e0b", "title": "Dynamic risk assessment tool for customer IoT infrastructures for Smart Grids"}, {"paperId": "3c5873281f5d3d869b4b9d7fc15588ce8b7e779d", "title": "Securing the Internet of Things in Artificial Intelligence Era: A Comprehensive Survey"}]}
