{"paperId": "2097422979f9cd6d9bd3e5b67f9d58a805a89972", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Hydraulic Flow Unit Classification and Prediction Using Machine Learning Techniques: A Case Study from the Nam Con Son Basin, Offshore Vietnam", "abstract": "The test study area is the Miocene reservoir of Nam Con Son Basin, offshore Vietnam. In the study we used unsupervised learning to automatically cluster hydraulic flow units (HU) based on flow zone indicators (FZI) in a core plug dataset. Then we applied supervised learning to predict HU by combining core and well log data. We tested several machine learning algorithms. In the first phase, we derived hydraulic flow unit clustering of porosity and permeability of core data using unsupervised machine learning methods such as Ward’s, K mean, Self-Organize Map (SOM) and Fuzzy C mean (FCM). Then we applied supervised machine learning methods including Artificial Neural Networks (ANN), Support Vector Machines (SVM), Boosted Tree (BT) and Random Forest (RF). We combined both core and log data to predict HU logs for the full well section of the wells without core data. We used four wells with six logs (GR, DT, NPHI, LLD, LSS and RHOB) and 578 cores from the Miocene reservoir to train, validate and test the data. Our goal was to show that the correct combination of cores and well logs data would provide reservoir engineers with a tool for HU classification and estimation of permeability in a continuous geological profile. Our research showed that machine learning effectively boosts the prediction of permeability, reduces uncertainty in reservoir modeling, and improves project economics.", "venue": "Energies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-18", "journal": {"name": "Energies"}, "authors": [{"authorId": "101213486", "name": "H. Man"}, {"authorId": "40427634", "name": "D. Hien"}, {"authorId": "1729539834", "name": "K. D. Thong"}, {"authorId": "152415435", "name": "B. V. Dung"}, {"authorId": "114848152", "name": "N. Hoa"}, {"authorId": "2141374541", "name": "Truong Khac Hoa"}, {"authorId": "152517714", "name": "N. Kieu"}, {"authorId": "2114567970", "name": "P. Q. Ngoc"}], "citations": [{"paperId": "b688f41f6f83f5da7896ef398210f2d5cd3bdd87", "title": "Hydraulic flow unit and rock types of the Asmari Formation, an application of flow zone index and fuzzy C-means clustering methods"}, {"paperId": "7874c21530111e07a3c2ba032e7dd0a466e22cc7", "title": "Utilizing machine learning for flow zone indicators prediction and hydraulic flow unit classification"}, {"paperId": "76b765271d0d3ec49683a914d9ef8f3c4c88ee96", "title": "Division Method of Dynamic Flow Units in Fluvial Reservoir at Ultra-high Water Cut Period"}, {"paperId": "b76aaf7ca7418429b3c72b264a18739a7a2394aa", "title": "Experimental Rock Characterisation of Upper Pannonian Sandstones from Szentes Geothermal Field, Hungary"}, {"paperId": "adf420a9e5628f1708094ee21eb72d9bc1cb9d5e", "title": "Robust and Efficient Identification of Hydraulic Flow Units using Differential Evolution Optimization and Two-Stage Clustering Techniques"}, {"paperId": "8ed97e64bfdc7bae6776b3c63e7147dae50f90b7", "title": "Mô hình dự đoán độ thấm từ dữ liệu phân tích mẫu lõi bằng phương pháp HFU và MICP cho tập cát kết thuộc tầng Miocen, mỏ Alpha, bể Nam Côn Sơn"}, {"paperId": "7b3df90127285652b07f870df5e2372b9d73c87c", "title": "A \"data-feature-policy\" solution for multiscale geological-geophysical intelligent reservoir characterization"}, {"paperId": "5b4b63d793511ea38586d9cff52c645a58f95e7b", "title": "Porosity prediction using fuzzy clustering and joint inversion of wireline logs: A case study of the Nam Con Son basin, offshore Vietnam"}]}
