{"paperId": "209cee0638388d78212409732217949eab00e29c", "publicationVenue": null, "title": "Classification Of Human Facial Expressions For Emotion Recognition Using A Distributed Computer System", "abstract": "A computer system was developed to classify human facial expressions for emotion recognition using a distributed computer architecture within the scope of big data. Computers with normal standards and features were used in the distributed computer architecture. Necessary system software for the distributed computer architecture was established and mutual communication protocols were provided between the computers and databases in the computer network. Visual C# parallel programming was used as the software language on the distributed computer architecture. In the software prepared, face image flies were processed and threads were created. The threads created later were processed in the processors of the computers. The threads were run on the processors in the distributed computer system, and facial expressions were classified for emotion recognition. In the distributed computer architecture: the number of image files, the volume of big data and the load of the threads to be processed are taken into account; and databases and parallel programming were used and the classification of human face images was performed. Emotion analysis methods and facial expression recognition techniques were used in the classification process. The distributed computer system is in low cost and high processing speed. With the distributed computer system architecture, big data analytics has become convenient and feasible.", "venue": "2020 5th International Conference on Computer Science and Engineering (UBMK)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-09-01", "journal": {"name": "2020 5th International Conference on Computer Science and Engineering (UBMK)", "pages": "1-6"}, "authors": [{"authorId": "2072627482", "name": "Timuçin Korkmaz"}, {"authorId": "145849759", "name": "H. Erol"}], "citations": [{"paperId": "61840e757b779380069ee27f9eef0740c7da9259", "title": "Development and Progress in Sensors and Technologies for Human Emotion Recognition"}]}
