{"paperId": "209ddd2ac4269a04b948bf6edf7b79ae57e42f99", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Comprehensive Review on Non-Neural Networks Collaborative Filtering Recommendation Systems", "abstract": "Over the past two decades, recommender systems have attracted a lot of interest due to the explosion in the amount of data in online applications. A particular attention has been paid to collaborative filtering, which is the most widely used in applications that involve information recommendations. Collaborative filtering (CF) uses the known preference of a group of users to make predictions and recommendations about the unknown preferences of other users (recommendations are made based on the past behavior of users). First introduced in the 1990s, a wide variety of increasingly successful models have been proposed. Due to the success of machine learning techniques in many areas, there has been a growing emphasis on the application of such algorithms in recommendation systems. In this article, we present an overview of the CF approaches for recommender systems, their two main categories, and their evaluation metrics. We focus on the application of classical Machine Learning algorithms to CF recommender systems by presenting their evolution from their first use-cases to advanced Machine Learning models. We attempt to provide a comprehensive and comparative overview of CF systems (with python implementations) that can serve as a guideline for research and practice in this area.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-20", "journal": {"name": "ArXiv", "volume": "abs/2106.10679"}, "authors": [{"authorId": "2113956530", "name": "Carmel Wenga"}, {"authorId": "2876213", "name": "Majirus Fansi"}, {"authorId": "2583242", "name": "S. Chabrier"}, {"authorId": "2060798827", "name": "Jean-Martial Mari"}, {"authorId": "1705439", "name": "A. Gabillon"}], "citations": [{"paperId": "cf0a182032a5a8ee3e0bccf2581fe61324e8a53b", "title": "Evolutionary Approach to Recommender Systems Improvement by Directory of Products Optimization"}, {"paperId": "f35edbaa2c8f95638e90a8d3d0f7d85b101cd209", "title": "Session-aware Graph Neural Network-based Recommendations for Custom Advertisement Segment Generation"}]}
