{"paperId": "20a6b93b0b542d2f6b707f6829713155683a041c", "publicationVenue": null, "title": "La perspectiva ética en la literatura científica relacionada con datificación educativa: una revisión sistemática", "abstract": "La combinación de educación y tecnología presenta una variedad de dilemas éticos y morales que no podemos ignorar más. El desarrollo tecnológico y digital basado en la recolección de datos ha subrayado aún más estos dilemas. Este artículo presenta los resultados de una revisión sistemática siguiendo el paradigma PRISMA 2020 en las bases de datos Dialnet, Google Scholar, Scopus y Web of Science. En los 15 artículos seleccionados relacionados con los procesos de datificación en educación, se ha analizado si existen marcos éticos relacionados con los procesos de digitalización en educación. Durante el proceso se ha constatado que, a pesar de ser una cuestión fundamental y una preocupación generalizada, en la mayoría de los casos se plantean cuestiones legislativas con el título de perspectiva ética. Sin embargo, realmente no existe un marco ético generalmente consensuado ni establecido con el que dirigir los procesos de digitalización en educación. En los casos en los que existe una visión realmente ética, no ha sido marco para generar una legislación práctica. Como conclusión, podemos subrayar la necesidad de trabajar en el desarrollo de marcos éticos que ayuden a articular códigos morales prácticos que vayan más allá de los aspectos ligados a la privacidad.", "venue": "Edutec. Revista Electrónica de Tecnología Educativa", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-21", "journal": {"name": "Edutec. Revista Electrónica de Tecnología Educativa"}, "authors": [{"authorId": "2274466073", "name": "Egoitz De La Iglesia Ganboa"}, {"authorId": "2139868824", "name": "Amaia Arroyo Sagasta"}], "citations": []}
