{"paperId": "20b104f1f10867f995cf0dfa146150220a999b70", "publicationVenue": {"id": "69776128-8071-4a24-84f7-a12b60fccfd9", "name": "Financial and credit activity problems of theory and practice", "alternate_names": ["Financial crédit act probl theory pract"], "issn": "2306-4994", "url": "http://fkd.org.ua/"}, "title": "ANALYSIS OF RISKS IN THE FINANCIAL SECURITY MANAGEMENT SYSTEM OF BUSINESS ENTITIES", "abstract": "Financial and economic activity is exposed to numerous systemic risks, which are a threat to the financial security of enterprises. The criterion for ensuring financial security is the appropriate level of the company's financial condition. The financial condition of the enterprise is a complex concept and is characterized by the system of indicators – financial coefficients: indicators of liquidity, financial stability, business activity, and management efficiency. The interrelationship and mutual determination between the indicators that cause the occurrence of risk when one of them changes is established.A range of factors that comprehensively characterize the financial and economic activity of the enterprise has been determined and developed risk analysis and assessment methodology, which includes the following stages: preparatory stage; construction of an algorithm for quantitative assessment of risk in the financial security system; interpretation of the results of an integrated risk assessment in the financial security system; determining the priorities of risk management in the system. The methods of financial analysis (horizontal, vertical, coefficient, analysis of business activity and financial stability) were applied and a quantitative assessment of risks was carried out. The indicators-coefficients of the enterprise's functioning are calculated and given an interpretation.The conclusion was formed that the construction of an effective risk management system and its universal functional component of risk analysis are current issues, as they allow to develop a set of measures to minimize threats and risks of conducting financial and economic activities of economic entities. Therefore, the correct assessment of risk with the help of the proposed methods and models of financial analysis for individual economic situations and business entities is effective and has value, as it gives the opportunity to make the optimal decision in specific situations and characterizes the criterion feature of financial security of industrial enterprises – liquidity, financial stability, business activity, profitability.", "venue": "Financial and credit activity problems of theory and practice", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-31", "journal": {"name": "Financial and credit activity problems of theory and practice"}, "authors": [{"authorId": "2237172417", "name": "Zenovii-Mykhailo Zadorozhnyy"}, {"authorId": "121188081", "name": "Svitlana Zhukevych"}, {"authorId": "1517951486", "name": "T. Portovaras"}, {"authorId": "2277389898", "name": "Victoria Rozelyuk"}, {"authorId": "2133911644", "name": "N. Zhuk"}, {"authorId": "2277390972", "name": "Iryna Nazarova"}], "citations": []}
