{"paperId": "20b9508fb2df741127c2092147a61af363149625", "publicationVenue": {"id": "2766654d-1d49-448e-9e1c-48bec1e1c0a2", "name": "Vietnam Journal of Computer Science", "type": "journal", "alternate_names": ["Vietnam J Comput Sci"], "issn": "2196-8896", "url": "https://www.worldscientific.com/worldscinet/vjcs"}, "title": "Designing Personalized Learning Environments - The Role of Learning Analytics", "abstract": "Learning analytics, as a rapidly evolving field, offers an encouraging approach with the aim of understanding, optimizing and enhancing learning process. Learners have the capabilities to interact with the learning analytics system through adequate user interface. Such systems enables various features such as learning recommendations, visualizations, reminders, rating and self-assessments possibilities. This paper proposes a framework for learning analytics aimed to improve personalized learning environments, encouraging the learner’s skills to monitor, adapt, and improve their own learning. It is an attempt to articulate the characterizing properties that reveals the association between learning analytics and personalized learning environment. In order to verify data analysis approaches and to determine the validity and accuracy of a learning analytics, and its corresponding to learning profiles, a case study was performed. The findings indicate that educational data for learning analytics are context specific and variables carry different meanings and can have different implications on learning success prediction.", "venue": "Vietnam Journal of Computer Science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-20", "journal": {"name": "Vietnam. J. Comput. Sci.", "pages": "231-250", "volume": "7"}, "authors": [{"authorId": "1403376848", "name": "Aleksandra Klašnja-Milićević"}, {"authorId": "144395551", "name": "M. Ivanović"}, {"authorId": "3281237", "name": "Bela Stantic"}], "citations": [{"paperId": "c5bff6f26a31a55ca1e78d099a485031c16e7f65", "title": "An Examination of the Studies on Learning Analytics: A Bibliometric Mapping Analysis"}, {"paperId": "78d18c5f843b8e25d7c67f7592739b808e9fcebc", "title": "Improving English Communication Skills in Online Learning Through the Utilization of Feedback Provision and Learning Analytics: A Conceptual Framework"}, {"paperId": "9a571b1a721369a1eee1bb50e047cd98f2e036ad", "title": "Interaction recognition and intervention based on context feature fusion of learning behaviors in interactive learning environments"}]}
