{"paperId": "20cacdba967a744042e458d62e72b15b2fa3fb25", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Data Usage and the Legal Stability of Transactions for the Commercial Operation of Autonomous Vessels Based on Digital Ownership in Korean Civil Law", "abstract": "Stakeholders in the maritime industry have agreed to expand commercial operations by developing autonomous vessels, the epitome of innovative technologies. However, they are still concerned about the risks of infringing on the rights and interests of individuals or organizations linked to data transactions. Based on Locke’s theory of property ownership, and the assurance of absolute ownership as specified in the Constitution of the Republic of Korea, the business model is still in its early stages. This study examined the concept, transaction structure, and application scope of data activating digital platforms to support data transactions, and aid in advancing the new business sector for commercial operations of maritime autonomous surface ships (MASSs). Consequently, this study contributes to and recognizes the future value of knowledge and intellectual property related to maritime data. This is achieved by defining the intellectual property emerging from newer avenues, such as MASSs, blockchain technology, and smart ports, that are consequential to the rapid development of the maritime industry.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-07-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2155592292", "name": "Chang-Hee Lee"}, {"authorId": "41159481", "name": "Yulseong Kim"}, {"authorId": "120970038", "name": "Youngran Shin"}], "citations": [{"paperId": "2d1ed8d68721f37e59c75a940750499b4bcdfee4", "title": "Utilidad de las tecnologías de las industria 4.0 en los smart ports"}, {"paperId": "20b9a115ebb30aaf275ea055be8a809361b09950", "title": "Ai-Based Solution for Sustainability Tracing for Companies"}, {"paperId": "bdd03f7f7df3dfef0a67708aff29901a72f23a1c", "title": "Research on the promotion effect and mechanisms of digital empowerment of food enterprises"}, {"paperId": "173b86ba13dff26fcf3e99115cd27cef15c6518d", "title": "Extracting the Maritime Traffic Route in Korea Based on Probabilistic Approach Using Automatic Identification System Big Data"}]}
