{"paperId": "20d169275b6c53a5084e8bac9ffe4967aca89786", "publicationVenue": null, "title": "WATSON: A Workﬂow-based Data Storage Optimizer for Analytics", "abstract": "—This paper studies the automatic optimization of data placement parameters for the inter-job write once read many (WORM) scenario where data is ﬁrst materialized to storage by a producer job, and then accessed for many times by one or more consumer jobs. Such scenario is ubiquitous in Big Data analytics applications but existing Big Data auto-tuning techniques are often focused on single job performance. To address the shortcomings in existing works, this paper investigates data placement parameters regarding blocking, partitioning and replication and models the trade-offs caused by different conﬁgurations of these parameters through a producer-consumer model. We then present a novel cross-layer solution, WATSON, which can automatically predict future workloads’ data access patterns and tune data placement parameters accordingly to optimize the performance for an inter-job WORM scenario. WATSON can achieve up to eight times performance speedup on various analytics workloads.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "144551417", "name": "Jia Zou"}, {"authorId": "145914105", "name": "Ming Zhao"}, {"authorId": "2286618865", "name": "Juwei Shi"}, {"authorId": "2286410003", "name": "Chen Wang"}], "citations": [{"paperId": "546f3a2c905116d6f9f15ed9b6fbab84c36dd47d", "title": "A Comparison of End-to-End Decision Forest Inference Pipelines"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "106b4393470894cdc77963d869965dad1d700f81", "title": "A Comparison of Decision Forest Inference Platforms from A Database Perspective"}, {"paperId": "3f1f8314a14a1fc6b34b87413b469c36d3470d8e", "title": "Lachesis: Automated Partitioning for UDF-Centric Analytics"}, {"paperId": "a8750f35c52574408b2a44c366876b812a531449", "title": "Effectively Using Remote I/O For Work Composition in Distributed Workflows"}]}
