{"paperId": "20d23315a20c2290388ef26cab2cfc5c3b6bf937", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Investigating Multi-Feature Selection and Ensembling for Audio Classification", "abstract": "Deep Learning (DL) algorithms have shown impressive performance in diverse domains. Among them, audio has attracted many researchers over the last couple of decades due to some interesting patterns--particularly in classification of audio data. For better performance of audio classification, feature selection and combination play a key role as they have the potential to make or break the performance of any DL model. To investigate this role, we conduct an extensive evaluation of the performance of several cutting-edge DL models (i.e., Convolutional Neural Network, EfficientNet, MobileNet, Supper Vector Machine and Multi-Perceptron) with various state-of-the-art audio features (i.e., Mel Spectrogram, Mel Frequency Cepstral Coefficients, and Zero Crossing Rate) either independently or as a combination (i.e., through ensembling) on three different datasets (i.e., Free Spoken Digits Dataset, Audio Urdu Digits Dataset, and Audio Gujarati Digits Dataset). Overall, results suggest feature selection depends on both the dataset and the model. However, feature combinations should be restricted to the only features that already achieve good performances when used individually (i.e., mostly Mel Spectrogram, Mel Frequency Cepstral Coefficients). Such feature combination/ensembling enabled us to outperform the previous state-of-the-art results irrespective of our choice of DL model.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-15", "journal": {"name": "ArXiv", "volume": "abs/2206.07511"}, "authors": [{"authorId": "2152406384", "name": "Muhammad Turab"}, {"authorId": "48504353", "name": "Teerath Kumar"}, {"authorId": "3156701", "name": "Malika Bendechache"}, {"authorId": "2588256", "name": "Takfarinas Saber"}], "citations": [{"paperId": "0bfc19b05d24ea98dcc8d8c3699549902df64d58", "title": "Prediction of dysphagia aspiration through machine learning-based analysis of patients’ postprandial voices"}, {"paperId": "cc184ca3a695ec60185bef2e5c788b0009fe7ec2", "title": "Spoken word recognition using a novel speech boundary segment of voiceless articulatory consonants"}, {"paperId": "ee559b6b097ed4884628a4603028393be5b205a5", "title": "Artificial intelligence framework for heart disease classification from audio signals"}, {"paperId": "e8ea37fec6eee222d558e03e916b6409cb88e233", "title": "Multi-Modal Hate Speech Recognition Through Machine Learning"}, {"paperId": "25a8136cb4fa543dfac6e6c1f30588ad397136d5", "title": "EEG-Based Human Emotion Recognition Using Deep Learning"}, {"paperId": "307379973079ffffae7cf4f53e406f43afacfeb0", "title": "Banking in the Digital Age: Predicting Eligible Customers through Machine Learning and AWS"}, {"paperId": "de27c82a26f1afc54dd9cd3d99867f5ff555933b", "title": "Color Depiction and Push Notification System for Daily Sounds"}, {"paperId": "fa797ecaee4ddf1771aeaf881ae9473854489098", "title": "An ensemble of CNN architectures for early detection of alzheimer’s disease using brain MRI"}, {"paperId": "25f49cb58e67e55fef45c975300547a5609d1a0f", "title": "AudRandAug: Random Image Augmentations for Audio Classification"}, {"paperId": "cd97c3771d24d77e7b739d42b6e28f199aa6c9d4", "title": "Experimental Investigation of Acoustic Features to Optimize Intelligibility in Cochlear Implants"}, {"paperId": "f42e459e18259998277d7e97770b3ccb62f0ef71", "title": "A Comprehensive Survey of Digital Twins in Healthcare in the Era of Metaverse"}, {"paperId": "dc6d4d96e4cf0e8885d4b6adfd2e518338f43209", "title": "A review of deep learning techniques in audio event recognition (AER) applications"}, {"paperId": "83736e134996c2c00e187ac9da37f7af9de7f536", "title": "Go Together: Bridging the Gap between Learners and Teachers"}, {"paperId": "c7b7ddc691ade9522f0bb463695062b1036a8256", "title": "ME-CCNN: Multi-encoded images and a cascade convolutional neural network for breast tumor segmentation and recognition"}, {"paperId": "68f66a2ddf0bdc2dce5c942409cbb7fafdbb2b6a", "title": "Image Data Augmentation Approaches: A Comprehensive Survey and Future directions"}, {"paperId": "56bf301db8a11bcc96cf7bc445047a82a7f20809", "title": "Understanding EEG signals for subject-wise Definition of Armoni Activities"}, {"paperId": "d24d294f0c2bcce8f3395d5efe803df8256c7888", "title": "Data Dimension Reduction makes ML Algorithms efficient"}, {"paperId": "5a0afe1800c74dae6d9ed3093a9dbb28fcbe65f3", "title": "Advanced Audio Aid for Blind People"}, {"paperId": "d2eebc2803b5ddbcadf70fb0be1c8455c5be08fd", "title": "Precise Single-stage Detector"}, {"paperId": "abff11f85278a24a0b0e3ed6022ac8173873dd33", "title": "Introducing Urdu Digits Dataset with Demonstration of an Efficient and Robust Noisy Decoder-Based Pseudo Example Generator"}, {"paperId": "83272ccaf31d788b78a167cb9b0bcdae3acc0663", "title": "Random Data Augmentation based Enhancement: A Generalized Enhancement Approach for Medical Datasets"}, {"paperId": "f8fa77e01b1576654f3a6dcd7c35718b826f8c25", "title": "Automatic Audio Feature Extraction for Keyword Spotting"}, {"paperId": "28704e80c31d8c040635bb994814ae9fc5d9e60c", "title": "Advanced Data Augmentation Approaches: A Comprehensive Survey and Future directions"}]}
