{"paperId": "20d8db849123b9de1509536440a10043d5f689cc", "publicationVenue": null, "title": "IDEA: Integrating Divisive and Ensemble-Agglomerate hierarchical clustering framework for arbitrary shape data", "abstract": "Hierarchical clustering, a traditional clustering method, has been getting attention again. Among several reasons, a credit goes to a recent paper by Dasgupta in 2016 that proposed a cost function that quantitatively evaluates hierarchical clustering trees. An important question is how to combine this recent advance with existing successful clustering methods. In this paper, we propose a hierarchical clustering method to minimize the cost function of clustering tree by incorporating existing clustering techniques. First, we developed an ensemble tree-search method that finds an integrated tree with reduced cost by integrating multiple existing hierarchical clustering methods. Second, to operate on large and arbitrary shape data, we designed an efficient hierarchical clustering framework, called integrating divisive and ensemble-agglomerate (IDEA) by combining it with advanced clustering techniques such as nearest neighbor graph construction, divisive-agglomerate hybridization, and dynamic cut tree. The IDEA clustering method showed better performance in minimizing Dasgupta's cost and improving accuracy (adjusted rand index) over existing cost-minimization-based, and density-based hierarchical clustering methods in experiments using arbitrary shape datasets and complex biology-domain datasets.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "2791-2800"}, "authors": [{"authorId": "5274812", "name": "Hongryul Ahn"}, {"authorId": "2386720", "name": "Inuk Jung"}, {"authorId": "36069693", "name": "Heejoon Chae"}, {"authorId": "9909977", "name": "Minsik Oh"}, {"authorId": "2152585498", "name": "Inyoung Kim"}, {"authorId": "49899831", "name": "Sun Kim"}], "citations": [{"paperId": "0017a074bc35851ac081bfd0b2338887e9e26e59", "title": "An ensemble hierarchical clustering algorithm based on merits at cluster and partition levels"}]}
