{"paperId": "20e768f765c5fe3e15814416c022880ef01a32fc", "publicationVenue": {"id": "68f20e73-515e-4c73-9cd5-5684926b45f7", "name": "IEEE Journal on Selected Areas in Communications", "type": "journal", "alternate_names": ["IEEE J Sel Area Commun"], "issn": "0733-8716", "url": "http://www.comsoc.org/jsac/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=49", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=49"]}, "title": "On SDN-Enabled Online and Dynamic Bandwidth Allocation for Stream Analytics", "abstract": "Data communication in cloud-based distributed stream data analytics often involves a collection of parallel and pipelined TCP flows. As the standard TCP congestion control mechanism and its variants are designed for achieving “fairness” among competing flows and are agnostic to the application layer contexts, the bandwidth allocation among a set of TCP flows traversing bottleneck links often leads to sub-optimal application-layer performance measures, e.g., stream processing throughput or average tuple complete latency. Motivated by this and enabled by the rapid development of the software-defined networking (SDN) techniques, in this paper, we re-investigate the design space of the bandwidth allocation problem and propose a cross-layer framework which utilizes the instantaneous information obtained from the application layer and provides on-the-fly and dynamic bandwidth adjustment algorithms for assisting the stream analytics applications achieving better performance during the runtime. We implement a prototype cross-layer bandwidth allocation framework based on a popular open-source distributed stream processing platform, Apache Storm, together with the OpenDaylight controller, and carry out extensive experiments with real-world analytical workloads on top of a local cluster consisting of ten workstations interconnected by a SDN-enabled fat-tree like testbed. The experiment results clearly validate the effectiveness and efficiency of our proposed framework and algorithms. Finally, we leverage the proposed cross-layer SDN framework and introduce an exemplary mechanism for bandwidth sharing and performance reasoning among multiple active applications and show a case of a point solution on how to approximate application-level fairness.", "venue": "IEEE Journal on Selected Areas in Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-05", "journal": {"name": "IEEE Journal on Selected Areas in Communications", "pages": "1688-1702", "volume": "37"}, "authors": [{"authorId": "1691813", "name": "Walid A. Y. Aljoby"}, {"authorId": "2153687572", "name": "Xin Wang"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "144030168", "name": "Richard T. B. Ma"}], "citations": [{"paperId": "bdaf267bb93c34c17a7f48c25fcab6904378ea67", "title": "On SDN-Enabled Online and Dynamic Bandwidth Allocation for Stream Analytics"}]}
