{"paperId": "20e8d184b4f22104374fdfaf72fbbd35ee59aa59", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "TraNCE: Transforming Nested Collections Efficiently", "abstract": "Nested relational query languages have long been seen as an attractive tool for scenarios involving large hierarchical datasets. In recent years, there has been a resurgence of interest in nested relational languages [5, 2]. One driver has been the affinity of these languages for large-scale processing platforms such as Spark and Flink. This demonstration gives a tour of TraNCE [8, 9], a new system for processing nested data on top of distributed processing systems. The core innovation of the system is a compiler that processes nested relational queries in a series of transformations; these include variants of two prior techniques, shredding [3] and unnesting [4], as well as a materialization transformation that customizes the way levels of the nested output are generated. The TraNCE platform builds on these techniques by adding components for users to create and visualize queries, as well as data exploration and notebook execution targets to facilitate the construction of large-scale data science applications. The demonstration will both showcase the system from the viewpoint of usability by data scientists and illustrate the data management techniques employed. PVLDB Reference Format: Jaclyn Smith, Michael Benedikt, Brandon Moore, and Milos Nikolic. TraNCE: Transforming Nested Collections Efficiently. PVLDB, 12(xxx): xxxx-yyyy, 2021. DOI: https://doi.org/10.14778/xxxxxxx.xxxxxxx", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Proc. VLDB Endow.", "pages": "2727-2730", "volume": "14"}, "authors": [{"authorId": "2119125560", "name": "Jaclyn Smith"}, {"authorId": "1750856", "name": "Michael Benedikt"}, {"authorId": "2544947", "name": "Brandon M. Moore"}, {"authorId": "143687337", "name": "Milos Nikolic"}], "citations": []}
