{"paperId": "20e898b44ca138209f9de1698c93cd2731f8ece1", "publicationVenue": {"id": "72b1619c-55d6-4f98-9218-23cd8aa74091", "name": "IEEE Uttar Pradesh Section International Conference on Electrical, Computer and Electronics Engineering", "type": "conference", "alternate_names": ["UPCON", "IEEE uttar pradesh Sect Int Conf Electr Comput Electron Eng"]}, "title": "Temporal Data Mining: Uncovering Patterns in Time-Series Data Streams with Machine Learning", "abstract": "Temporal data mining is an advanced analytical field that focuses on the extraction of interpretable patterns, correlations, and trends over time within data streams. This paper presents a comprehensive framework for uncovering hidden structures in time-series data through sophisticated machine learning algorithms. The research introduces a novel methodology that integrates time-series decomposition, anomaly detection, and predictive modeling, leveraging the inherent temporal dynamics for enhanced data intelligence. The approach is distinguished by its adaptability to real-time data streams, robustness against noise, and capability for handling large-scale datasets prevalent in the era of Big Data. The framework's efficacy is demonstrated through its application to diverse industry scenarios, including financial markets forecasting, environmental monitoring, and Internet of Things (IoT) sensor data analysis, providing actionable insights with high precision. The proposed system employs a combination of unsupervised and supervised learning techniques, with a particular emphasis on deep learning models that capitalize on their ability to learn complex temporal representations. The paper further discusses the implications of the findings for future research and the potential integration of the framework into existing data analysis pipelines for real-world impact. Methodological advancements and practical applications are explored, setting the stage for new directions in temporal data analysis.", "venue": "IEEE Uttar Pradesh Section International Conference on Electrical, Computer and Electronics Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-01", "journal": {"name": "2023 10th IEEE Uttar Pradesh Section International Conference on Electrical, Electronics and Computer Engineering (UPCON)", "pages": "1539-1544", "volume": "10"}, "authors": [{"authorId": "2256876744", "name": "Ala Harika"}, {"authorId": "2130375336", "name": "Aravinda K"}, {"authorId": "50982869", "name": "Amandeep Nagpal"}, {"authorId": "2289828658", "name": "Dev Vikram Singh"}, {"authorId": "2287962303", "name": "Praveen"}, {"authorId": "113070786", "name": "H. S. Abdulaali"}], "citations": []}
