{"paperId": "20fad96134851a078c239b5f6ae5e079ccf5a074", "publicationVenue": null, "title": "Scheduling Strategy of Space-based Satellite Based on Fireworks Algorithm under Cloud Computing", "abstract": "The scheduling of space-based satellite missions in cloud computing environment is a hotspot of current research. For the task completion time and the balance of virtual machine resource load, the cloud task scheduling fireworks algorithm is improved. According to the performance of virtual machine resources in the cloud environment, virtual The concept of relative fitness of the machine; the random mutation operation of the standard fireworks algorithm is improved to the targeted mutation operation, so that the virtual machine can obtain greater variation of the virtual machine resources with greater adaptability, and accelerate the convergence of the algorithm. Simulation experiments show that this algorithm improves the load balancing of virtual machine resources while reducing the task completion time. It is an effective cloud task scheduling algorithm. The task scheduling of space-based satellite in cloud computing environment is a hot spot of research at present. Aiming at the balance of task completion time and virtual machine resource load, the fireworks algorithm of cloud task scheduling is improved. According to the performance of virtual machine resources in cloud environment, the concept of relative fitness of virtual machine is introduced. The random mutation operation of standard fireworks algorithm is improved to a targeted mutation operation. The simulation results show that the proposed algorithm can reduce the task completion time and improve the load balance of virtual machine resources. It is an effective cloud task scheduling algorithm.", "venue": "ICBDC", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-05-10", "journal": {"name": "Proceedings of the 4th International Conference on Big Data and Computing"}, "authors": [{"authorId": "73628806", "name": "Guilin Tian"}, {"authorId": "2119922300", "name": "Changyun Liu"}, {"authorId": "115851127", "name": "Haobo Jiang"}], "citations": [{"paperId": "b68be99c8137121f3aea88ce6149508caa620be9", "title": "Recent Developments of Fireworks Algorithms"}]}
