{"paperId": "20fce83aa576be3396ab6f3e6cd5d7ff46eb0328", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Comprehensive Review on Vision-Based Violence Detection in Surveillance Videos", "abstract": "Recent advancements in intelligent surveillance systems for video analysis have been a topic of great interest in the research community due to the vast number of applications to monitor humans’ activities. The growing demand for these systems aims towards automatic violence detection (VD) systems enhancing and comforting human lives through artificial neural networks (ANN) and machine intelligence. Extremely overcrowded regions such as subways, public streets, banks, and the industries need such automatic VD system to ensure safety and security in the smart city. For this purpose, researchers have published extensive VD literature in the form of surveys, proposals, and extensive reviews. Existing VD surveys are limited to a single domain of study, i.e., coverage of VD for non-surveillance or for person-to-person data only. To deeply examine and contribute to the VD arena, we survey and analyze the VD literature into a single platform that highlights the working flow of VD in terms of machine learning strategies, neural networks (NNs)-based patterns analysis, limitations in existing VD articles, and their source details. Further, we investigate VD in terms of surveillance datasets and VD applications and debate on the challenges faced by researchers using these datasets. We comprehensively discuss the evaluation strategies and metrics for VD methods. Finally, we emphasize the recommendations in future research guidelines of VD that aid this arena with respect to trending research endeavors.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-09-08", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 44", "volume": "55"}, "authors": [{"authorId": "66624503", "name": "F. Ullah"}, {"authorId": "1747075", "name": "M. Obaidat"}, {"authorId": "46329495", "name": "Amin Ullah"}, {"authorId": "134260245", "name": "K. Muhammad"}, {"authorId": "5956296", "name": "Mohammad Hijji"}, {"authorId": "1777998", "name": "S. Baik"}], "citations": [{"paperId": "f8a777d8f1fcee71b6614f1728614839dcc99895", "title": "Shots segmentation-based optimized dual-stream framework for robust human activity recognition in surveillance video"}, {"paperId": "5a5f92f7e7cc3990e0a3edc4838f48942d95bfa8", "title": "Efficient Human Violence Recognition for Surveillance in Real Time"}, {"paperId": "218678448e8eedc734b822e323f3c11bb8cca4b6", "title": "On Exploring Audio Anomaly in Speech"}, {"paperId": "ef81a4ec36a7b2f668e2f91c199d5f17406abfd1", "title": "Deep Learning-Based Abnormal Elevator Action Detection System"}, {"paperId": "794cd6deb676377528f5ea50753bc65f9af2d3bb", "title": "Two-Stage Violence Detection Using ViTPose and Classification Models at Smart Airports"}, {"paperId": "672721c311e823c33b903cae49099cf167c3de2a", "title": "Survey on video anomaly detection in dynamic scenes with moving cameras"}, {"paperId": "70f9bfea8a5bc0a9d91e5fe7d9ad9b12b3f5797d", "title": "TransCNN: Hybrid CNN and transformer mechanism for surveillance anomaly detection"}, {"paperId": "846aa0fed9590f8697e91bfe1d4f9090df613a25", "title": "Realistic Video Analytics Implementation on a Heterogeneous Infrastructure"}, {"paperId": "b9451371837c5d5f38d06c415ef109d262136b1f", "title": "Real Time Violence Detection Using Autonomous Intelligent Surveillance Robot"}, {"paperId": "27a8c466132827b279af36718d397d213d89efd4", "title": "An Effective Approach for Violence Detection using Deep Learning and Natural Language Processing"}, {"paperId": "d24503bceecd22c6d004313e71d7abc92bb4128f", "title": "A modified YOLOv5 architecture for efficient fire detection in smart cities"}, {"paperId": "a0a9a186c419fe287d9aaa82cbfa7df3b84dd4c0", "title": "An Xception Model Based Real-time Violence Detection"}, {"paperId": "79b1da81947f3e656ec627bc228de5bc91f16c58", "title": "A Shallow System Prototype for Violent Action Detection in Italian Public Schools"}, {"paperId": "7cc8b7032fbe056237617012b6b8d017f97c9c55", "title": "A comprehensive survey on deep facial expression recognition: challenges, applications, and future guidelines"}, {"paperId": "062ad8d95c7de20d52387767692f815783c8f2b1", "title": "FADS: An Intelligent Fatigue and Age Detection System"}, {"paperId": "681ea93c2c87766551fadd807f9b882f1b7e6fa8", "title": "Multimedia datasets for anomaly detection: a review"}, {"paperId": "e54eba8e56bd9b896de0c112c935d025890a5048", "title": "Combining a mobile deep neural network and a recurrent layer for violence detection in videos"}, {"paperId": "c550dc2595f41e02049b6bb1bb6224d3a50fa954", "title": "A Yolo-based Violence Detection Method in IoT Surveillance Systems"}, {"paperId": "7810197f75acf11e6bc872bff8dc642e737deced", "title": "Human Motion Prediction Based on Space-Time-Separable Graph Convolutional Network"}]}
