{"paperId": "2101fd5a64e0884e7f10fbb1e97e881b23ac60ed", "publicationVenue": null, "title": "An Empirical Study on Visualizing the Intellectual Structure and Hotspots of Big Data Research from a Sustainable Perspective", "abstract": "Big data has been extensively applied to many fields and wanted for sustainable development. However, increasingly growing publications and the dynamic nature of research fronts pose challenges to understand the current research situation and sustainable development directions of big data. In this paper, we visually conducted a bibliometric study of big data literatures from the Web of Science (WoS) between 2002 and 2016, involving 4927 effective journal articles in 1729 journals contributed by 16,404 authors from 4137 institutions. The bibliometric results reveal the current annual publications distribution, journals distribution and co-citation network, institutions distribution and collaboration network, authors distribution, collaboration network and co-citation network, and research hotspots. The results can help researchers worldwide to understand the panorama of current big data research, to find the potential research gaps, and to focus on the future sustainable development directions.", "venue": "", "year": 2018, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2018-03-01", "journal": {"name": "Sustainability", "pages": "667", "volume": "10"}, "authors": [{"authorId": "51463259", "name": "F. Hu"}, {"authorId": "2157221973", "name": "Wei Liu"}, {"authorId": "2133075", "name": "S. Tsai"}, {"authorId": "2111016782", "name": "Junbin Gao"}, {"authorId": "2106192702", "name": "Ning Bin"}, {"authorId": "2109396553", "name": "Quan Chen"}], "citations": [{"paperId": "97b45640a7c007689af0ebfc68b0286be7f58344", "title": "Big data analytics capabilities: Patchwork or progress? A systematic review of the status quo and implications for future research"}, {"paperId": "34a644112368e3b8184226a8ef33585ee0137689", "title": "From financial reporting to ESG reporting: a bibliometric analysis of the evolution in corporate sustainability disclosures"}, {"paperId": "641b46fc44d6c7db82640ad6f15da260589513ef", "title": "State-of-the-Art of Artificial Intelligence and Big Data Analytics Reviews in Five Different Domains: A Bibliometric Summary"}, {"paperId": "4999233fd9159570d6bbed96da5739809d9db3be", "title": "The Nexus between Big Data and Sustainability: An Analysis of Current Trends and Developments"}, {"paperId": "61cfcdf15ff3f7d888381df69d789e7dbe09052a", "title": "Big data analytics as a tool for fighting pandemics: a systematic review of literature"}, {"paperId": "9f608425abddc7b79eb91db2ea80f6b4439338f2", "title": "Sustainable Competitive Advantage Driven by Big Data Analytics and Innovation"}, {"paperId": "299f823add258491dd24852a4afb279f891a03d6", "title": "Pricing strategy with customers’ privacy concerns in Smart-X systems"}, {"paperId": "12e6379253101417318c0e6f71915d8d8a9b60c1", "title": "Creating Sustainable Innovativeness through Big Data and Big Data Analytics Capability: From the Perspective of the Information Processing Theory"}, {"paperId": "f2391d818efa5830dac5180a3c77f529888943f6", "title": "Big Data Analytics and Processing Platform in Czech Republic Healthcare"}, {"paperId": "a853fe5139320aa8a4f72977113858869cb5e2a1", "title": "Valuation Impacts of Environmental Protection Taxes and Regulatory Costs in Heavy-Polluting Industries"}, {"paperId": "bdfa925edf66e27fe03e489eb120d536421719b8", "title": "Sustainable Emergency Management Based on Intelligent Information Processing"}, {"paperId": "66372bd949105cc705aec7347269a71f82afadfc", "title": "Big Data, Big Data Analytics Capability, and Sustainable Innovation Performance"}, {"paperId": "fee4964eec2737b19c7ebc4986280c2298737896", "title": "Mapping the knowledge domain of road safety studies: A scientometric analysis."}, {"paperId": "5809b78ef59e4fd3e4cb6724399f155b1e3dd462", "title": "A Bibliometrics analysis on big data research (2009–2018)"}, {"paperId": "f7708b3f296dbd251a6c3e7d500ec3609169217c", "title": "Analysis of Influencing Factors of Big Data Adoption in Chinese Enterprises Using DANP Technique"}, {"paperId": "78f01b478063341bdbd5dcb7d9db31305fa54677", "title": "The Use of Big Data in Regenerative Planning"}, {"paperId": "8a91445c9a1dbfd775f66cc9b3047cae51f46e93", "title": "Knowledge Management, Innovation and Big Data: Implications for Sustainability, Policy Making and Competitiveness"}, {"paperId": "c11401d0a4c79d5fc6f7b8913ad806e410b6013d", "title": "An Empirical Study of Green Finance Research Through Bibliometrics"}]}
