{"paperId": "210d97a6d567b9284ad7d726a87eaec731800888", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Framework to Build a Big Data Ecosystem Oriented to the Collaborative Networked Organization", "abstract": "A Collaborative Networked Organization (CNO) is a set of entities that operate in heterogeneous contexts and aim to collaborate to take advantage of a business opportunity or solve a problem. Big data allows CNOs to be more competitive by improving their strategy, management and business processes. To support the development of big data ecosystems in CNOs, several frameworks have been reported in the literature. However, these frameworks limit their application to a specific CNO manifestation and cannot conduct intelligent processing of big data to support decision making at the CNO. This paper makes two main contributions: (1) the proposal of a metaframework to analyze existing and future frameworks for the development of big data ecosystems in CNOs and (2) to show the Collaborative Networked Organizations–big data (CNO-BD) framework, which includes guidelines, tools, techniques, conceptual solutions and good practices for the building of a big data ecosystem in different kinds of Collaborative Networked Organizations, overcoming the weaknesses of previous issues. The CNO-BD framework consists of seven dimensions: levels, approaches, data fusion, interoperability, data sources, big data assurance and programmable modules. The framework was validated through expert assessment and a case study.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-12", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2087512437", "name": "J. Hernández-Almazán"}, {"authorId": "1707107", "name": "R. Chalmeta"}, {"authorId": "2100405750", "name": "Ramón Ventura Roque-Hernández"}, {"authorId": "1399248752", "name": "Rubén Machucho-Cadena"}], "citations": [{"paperId": "6653f8ce9f3c435389771bf7222872aa4e1a4b4f", "title": "Fusion Orchestration Guidelines (FOG) for Collaborative Computing and Network Data Fusion"}, {"paperId": "a58978ea25bca3805106f86d81b5d56862fc38f4", "title": "A Temporal View of Business Analytics in Interorganizational Relationships: Enablers and Barriers to Value Creation"}]}
