{"paperId": "2111628e47ba340fca0adf813efcbf52635a4b42", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "The State of the Art in Machine Learning-Based Digital Forensics", "abstract": "Digital forensics of visual-based evidence from video surveillance systems and forensic photographs holds object detection as a key aspect of the process. Recognizing an instance of object classes over a wide range of image data using computational techniques is one of the areas that has gained continuous attention over the years due to their numerous practical applications. Several algorithms and techniques have been specified for object detection and recognition with Machine Learning gaining more prominence and ensuring the remarkable performance of object detection and recognition systems. This study presents a comprehensive review of the frameworks and applications of Machine Learning in object detection and classification with particular applications to Digital Forensics. The analysis covers a wide range of publications between 2007 and 2019 available in different indexed and non-indexed databases and the candidate papers were selected using certain exclusion criteria proposed in the Kitchenham’s methodology. The study in a bid to streamline future researches categorized digital forensic researches into six knowledge areas and identified the convolutional neural network as a state-of-the-art algorithm for machine learning-based digital forensics.", "venue": "Social Science Research Network", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2020-05-18", "journal": {"name": "BioRN: Other Computational Biology (Topic)"}, "authors": [{"authorId": "67045894", "name": "Francisca O. Oladipo"}, {"authorId": "70061730", "name": "E. Ogbuju"}, {"authorId": "2127052049", "name": "Femi S Alayesanmi"}, {"authorId": "2127046761", "name": "A. Musa"}], "citations": [{"paperId": "8fc83327fc1d9074fa2257b4e57ec225ea41820a", "title": "Forensic Science and How Statistics Can Help It: Evidence, Hypothesis Testing, and Graphical Models"}, {"paperId": "45daca0e2f3608a01f6f598afe30bf8527f1d2d8", "title": "Enhancing Forensic Analysis Using a Machine Learning-based Approach"}, {"paperId": "8155ba8176d1f6e5849dd602aeb8140821c344de", "title": "The Accuracy of Sex Identification Using CBCT Morphometric Measurements of the Mandible, with Different Machine-Learning Algorithms—A Retrospective Study"}, {"paperId": "3ced28359e2855a7e2baefb6106a7b1e63f1e6dc", "title": "Formal concept analysis approach to understand digital evidence relationships"}, {"paperId": "fa253fcb5fef08369522b20ef390165fa2b3870b", "title": "Hyperspectral Imaging for Biological Stains Detection"}, {"paperId": "63aaab972b3808ecf72eceb543cc480b8fb39e2b", "title": "A Comprehensive Collection and Analysis Model for the Drone Forensics Field"}, {"paperId": "5bc7ad4c5d2537a6892b3bcb397d4a9512949f45", "title": "Drone Forensics and Machine Learning: Sustaining the Investigation Process"}, {"paperId": "69386d9d96173bfdaa12ca15ccc9b7f944594a25", "title": "A survey of machine learning applications in digital forensics"}]}
