{"paperId": "2123df71103e6a7f889108e727ff2df2f7a02f5d", "publicationVenue": null, "title": "Multi-Layered based Digital Forensic Investigation for Internet-of-Things: Systematic Literature Review", "abstract": "Summary The emergence of Internet-of-Things (IoT) has shown a continuous growth due to its efficiency respond, mobility and effectiveness in daily activities. In fact, the increasing deployment of IoT towards industrial 4.0 applications such as in manufacturing, healthcare, transportation and emergency services, shows the worth of value in IoT implementation. Due to gigantic applications, systems and users using IoT, all of these valuable resources fascinate several of cyber-attacks and threats since IoT environment is still in progressing, which there are high changes of IoT breaches. As a consequence, the number of crimes in IoT devices is arising. Studies show that 84% of IoT adopters have experienced a security breach. Majority of these devices included from manufacturers of smart TVs, webcams, remote power outlets, door locks and hubs for controlling multiple devices. A huge of IoT devices have an anti-malware set-up on an electronic device and no encryption was used during transaction or file transfer, which one cannot fully assure personal data safety. Moreover, IoT involves machines that have the ability to remote access and possess internet connectivity. However, the implementation of IoT for convenient use, rise another catastrophic problem that is security and data privacy; and there are many security challenges and requirements that need to be addressed. Therefore, in this paper, a systematic literature review (SLR) is implemented to determine the related materials and achieve the research objectives. The outcome of this paper is to introduce IoT Forensics Framework and discussed the current challenges, which highlight the critical reviews and findings of the study. The impact of this exploration brings a significant enhancement to the phases of IoT Forensics processes and proposes a readiness layer in IoT Forensics environment", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "34402399", "name": "Z. Abidin"}, {"authorId": "1927385", "name": "S. R. Selamat"}, {"authorId": "2734531", "name": "S. Anawar"}, {"authorId": "3271190", "name": "N. Harum"}, {"authorId": "2061601", "name": "S. A. Asmai"}], "citations": []}
