{"paperId": "21363afaae3d31fc1eb5c6bf5150c281e17bae78", "publicationVenue": {"id": "855d4173-dc30-48dc-96c2-42a5b6372940", "name": "IEEE Transactions on Emerging Topics in Computing", "type": "journal", "alternate_names": ["IEEE Trans Emerg Top Comput"], "issn": "2168-6750", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245516", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516"]}, "title": "A Novel Quantum-Inspired Fuzzy Based Neural Network for Data Classification", "abstract": "The performance of the neural network (NN) depends on the various parameters such as structure, initial weight, number of hidden layer neurons, and learning rate. The improvement in classification performance of NN without changing its structure is a challenging issue. This paper proposes a novel learning model called Quantum-inspired Fuzzy Based Neural Network (Q-FNN) to solve two-class classification problems. In the proposed model, NN architecture is formed constructively by adding neurons in the hidden layer and learning is performed using the concept of Fuzzy c-Means (FCM) clustering, where the fuzziness parameter (<inline-formula><tex-math notation=\"LaTeX\">$m$</tex-math><alternatives><mml:math><mml:mi>m</mml:mi></mml:math><inline-graphic xlink:href=\"bharill-ieq1-2901272.gif\"/></alternatives></inline-formula>) is evolved using the quantum computing concept. The quantum computing concept provides a large search space for a selection of <inline-formula><tex-math notation=\"LaTeX\">$m$</tex-math><alternatives><mml:math><mml:mi>m</mml:mi></mml:math><inline-graphic xlink:href=\"bharill-ieq2-2901272.gif\"/></alternatives></inline-formula>, which helps in finding the optimal weights and also optimizes the network architecture. This paper also proposes a modified step activation function for the formation of hidden layer neurons, which handles the overlapping samples belong to different class regions. The performance of the proposed Q-FNN model is superior and competitive with the state-of-the-art methods in terms of accuracy, sensitivity, and specificity on 15 real-world benchmark datasets.", "venue": "IEEE Transactions on Emerging Topics in Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-25", "journal": {"name": "IEEE Transactions on Emerging Topics in Computing", "pages": "1031-1044", "volume": "9"}, "authors": [{"authorId": "39832205", "name": "O. Patel"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "145499331", "name": "M. Prasad"}], "citations": [{"paperId": "dd5360ae2218ea5f8a8ee343d5454d254f74ac18", "title": "Quantum Machine Learning for Security Assessment in the Internet of Medical Things (IoMT)"}, {"paperId": "1f52b5ecdc8a87253121c73a242702c8794a8188", "title": "Tomato leaf disease identification by modified inception based sequential convolution neural networks"}, {"paperId": "d73cbfc01a292464cfd2a0bbf7fb21f7120d7a89", "title": "AVQS-NN: Adaptive Virtualization for Quantum Services for application support using Neural Networks"}, {"paperId": "28280daf9c24532826c0ea2224364c0a57b5c09b", "title": "A High Swing and Low Power Associative Memory Based on Emerging Technologies"}, {"paperId": "350e4ad5d5fd752bfb82dca71ef3820f5174e46e", "title": "The Dichotomy of Cloud and IoT: Cloud-Assisted IoT From a Security Perspective"}, {"paperId": "1fa4fdb2b00beee2b579974f0f2847998a7d68c0", "title": "Crypto Makes AI Evolve"}, {"paperId": "6614ff18cb18c0e68b99f77629ad53123b22dc9b", "title": "AI-Assisted Authentication: State of the Art, Taxonomy and Future Roadmap"}, {"paperId": "376fa009d23eeb54f8d887dfcd7dc9602fefe4f3", "title": "Turning the Hunted into the Hunter via Threat Hunting: Life Cycle, Ecosystem, Challenges and the Great Promise of AI"}, {"paperId": "3355967a28481b816b4758119c72fa923bf988fa", "title": "Privacy-Preserving Cloud Computing: Ecosystem, Life Cycle, Layered Architecture and Future Roadmap"}, {"paperId": "3e0d81b6e748dd269841dac2db276b6eb7c3b3f1", "title": "Fuzzy Logic on Quantum Annealers"}, {"paperId": "b3915621e3055477031069162a193bbd1cf8e650", "title": "A highly efficient chain code for compression using an agent-based modeling simulation of territories in biological beavers"}, {"paperId": "20b4cdfb0be9dcbafcee211725b85e1f14d74519", "title": "Stochastic Dividers for Low Latency Neural Networks"}, {"paperId": "3ba5af6e52a685223bae6eee70cc58db19e15247", "title": "Toward Direct Edge-to-Edge Transfer Learning for IoT-Enabled Edge Cameras"}, {"paperId": "ed0fdb2008b973f3dfc47f3eab05faa7d2aaa141", "title": "Fake-Face Image Classification using Improved Quantum-Inspired Evolutionary-based Feature Selection Method"}, {"paperId": "e6684ccafd3efae18df2ae9269d0c333bffc1eaf", "title": "One-Shot Learning for Surveillance Anomaly Recognition using Siamese 3D CNN"}, {"paperId": "00b931f5703cbfb74582d8c6fdd52ae202629ee4", "title": "Machine Learning Algorithms in Quantum Computing: A Survey"}, {"paperId": "d215fb52e75deb460f03b2adabad4090bf7e42b2", "title": "Autonomic performance prediction framework for data warehouse queries using lazy learning approach"}, {"paperId": "417635d9b530b59650a7d9b8b1b0af0fc5ada4fe", "title": "A Decision Support System with Intelligent Recommendation for Multi-disciplinary Medical Treatment"}, {"paperId": "f43a1fdf0d53c73a1f8ea7573f099f07d6e1de6c", "title": "Deep neural network based Rider-Cuckoo Search Algorithm for plant disease detection"}, {"paperId": "d67ed98587cc647dbb4f16ba02e779ed900a7ba9", "title": "A Holistic Auto-Configurable Ensemble Machine Learning Strategy for Financial Trading"}, {"paperId": "24fa9b529cb34a801304f4de5f1bc89e97d70c05", "title": "Hybrid deep learning and quantum-inspired neural network for day-ahead spatiotemporal wind speed forecasting"}, {"paperId": "f8a43114230c0c0010adc042e7f5dfd50b5e6f5f", "title": "Quantum Machine Learning Revolution in Healthcare: A Systematic Review of Emerging Perspectives and Applications"}, {"paperId": "8640b1914131cfb4cb58bae1a6a0e4b8f4f2a457", "title": "A new chain coding mechanism for compression stimulated by a virtual environment of a predator-prey ecosystem"}]}
