{"paperId": "213a792a8b5eb3ed6d26300c7a0b2c5faaed3483", "publicationVenue": null, "title": "An IoT-based Optimization scheme on task scheduling for minimizing energy in Cloud Computing", "abstract": "Energy conservation is an important concern in virtualized cloud computing systems since it can have numerous benefits, including lower operating costs, enhancing scheme efficacy, and saving the atmosphere. At the same time, implementing a task allocation technique that is low on energy provides an option for achieving these ends. However, the cloud computing method's problem with work scheduling is more complex than that of the ordinary distributed system. Virtual machine (VM) instances use in the bulk of prior scheduling methods, which have long startup times and necessitate the usage of all available system resources. It's also difficult to match cloud resources with user requests to keep energy consumption to a minimum and maximize performance. Using a Honey Badger algorithm (HBA) in a heterogeneous virtualized cloud, this study provides a task scheduling approach that reduces energy consumption. This paper's main goal is to discover which cloud scheduling key is most significant. First, a group of decision-makers must decide on the criteria for review. An optimization technique is then used to give weights for each criterion and then measure the best solution. Finally, the CloudSim toolkit's assessment measures, such as makespan, energy consumption, and resource utilization, are used to compare the performance of the novel and existing algorithms.", "venue": "2022 8th International Conference on Advanced Computing and Communication Systems (ICACCS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-03-25", "journal": {"name": "2022 8th International Conference on Advanced Computing and Communication Systems (ICACCS)", "pages": "01-06", "volume": "1"}, "authors": [{"authorId": "2192130884", "name": "D. Ravi Kumar"}, {"authorId": "2142571461", "name": "K. P. kumar"}, {"authorId": "145095665", "name": "K. G. Raju"}, {"authorId": "148051803", "name": "S. Gowsalya"}, {"authorId": "9354182", "name": "Lavina Balraj"}, {"authorId": "2169004753", "name": "Ajeet Kumar Srivastava"}], "citations": [{"paperId": "e7bb325bd55980e04915dba39b3618cbe88b0c4d", "title": "Real Time Estimation of GHG Emissions Using IoT Integrated Sensor Fusion"}, {"paperId": "237b7cb20aa4620c7d36cf61dd1be579e2ade768", "title": "Quantum Chaotic Honey Badger Algorithm for Feature Selection"}]}
