{"paperId": "2145129c795c7b7b36fb98c7aa3b91ccd2d398b8", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference.", "abstract": "The DNN inferences are often batched for better utilizing the hardware in existing DNN serving systems. However, DNN serving exhibits diversity in many aspects, such as input, operator, and load. The unawareness of these diversities results in inefficient processing. Our investigation shows that the inefficiency roots in the feature of the existing batching mechanism: one entry and one exit. Therefore, we propose DVABatch , a runtime batching system that enables the multi-entry multi-exit batching scheme. We first abstract three meta operations, new, stretch, and split, for adjusting the ongoing batch of queries to achieve the multi-entry multi-exit scheme. The meta operations could be used to form different scheduling logics for different diversities. To deliver the meta operations to an ongoing batch, we slice the DNN models into multiple stages. Each stage corresponds to one executor, which is managed by a state transition diagram. Compared with state-of-the-art solutions, our experimental results show that DVABatch reduces 46.4% average latency and achieves up to 2 . 12 × throughput improvement.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2116301361", "name": "Shucheng Wang"}, {"authorId": "2239206278", "name": "Qiang Cao"}, {"authorId": "2110145307", "name": "Ziyi Lu"}, {"authorId": "2287205123", "name": "Hong Jiang"}, {"authorId": "152551122", "name": "Jie Yao"}, {"authorId": "152316551", "name": "Yuanyuan Dong"}], "citations": [{"paperId": "c2a1dbf0ceefdf850ca1fdf093219bcd42a10404", "title": "CoMeT: Count-Min-Sketch-based Row Tracking to Mitigate RowHammer at Low Cost"}, {"paperId": "ba25f77e417be575b0c41a400b116b82416df73c", "title": "Rowhammer Attacks in Dynamic Random-Access Memory and Defense Methods"}, {"paperId": "ddc11da6b9069d25a68fc6c3fe68f4a9167ae6a7", "title": "DRAM-Locker: A General-Purpose DRAM Protection Mechanism against Adversarial DNN Weight Attacks"}, {"paperId": "95949c27c2296d945582d491b9648a6ecfee1688", "title": "How to Kill the Second Bird with One ECC: The Pursuit of Row Hammer Resilient DRAM"}, {"paperId": "cccf7e41660e45992cb2052ed64f06470086b908", "title": "Siloz: Leveraging DRAM Isolation Domains to Prevent Inter-VM Rowhammer"}, {"paperId": "ee68d4752c2763650a68d65564ae9eca1b6ba266", "title": "Understanding Read Disturbance in High Bandwidth Memory: An Experimental Analysis of Real HBM2 DRAM Chips"}, {"paperId": "7524cc310dba98bea6acaaa7be6802f20815b74a", "title": "ABACuS: All-Bank Activation Counters for Scalable and Low Overhead RowHammer Mitigation"}, {"paperId": "cb1749c7ae049bfb026bca675c5e57e32d5c4056", "title": "Implicit Hammer: Cross-Privilege-Boundary Rowhammer Through Implicit Accesses"}, {"paperId": "c076e5388d489a62b9c90601e992db0edacedaba", "title": "DEACT: Hardware Solution to Rowhammer Attacks"}, {"paperId": "7e3042e89e19d2e4368b00d3187ee122f2fa1082", "title": "PT-Guard: Integrity-Protected Page Tables to Defend Against Breakthrough Rowhammer Attacks"}, {"paperId": "4bdbdcbab8216acd846987f8b3e0e2a98cbbe5ff", "title": "Fundamentally Understanding and Solving RowHammer"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips"}, {"paperId": "38ede183f2731d25b9da879cdeff35eb00549f2a", "title": "A Retrospective and Futurespective of Rowhammer Attacks and Defenses on DRAM"}, {"paperId": "86b1527af836142db5bc549008af40150c01eab7", "title": "Stop! Hammer time: rethinking our approach to rowhammer mitigations"}, {"paperId": "7d6a692efe5c6936ee570d30033c9e714bf945e5", "title": "Copy-on-Flip: Hardening ECC Memory Against Rowhammer Attacks"}, {"paperId": "eb3faf1d777dbbac35a8cc60eb5b372decd44b05", "title": "A Hybrid Alias Analysis and Its Application to Global Variable Protection in the Linux Kernel"}, {"paperId": "e4bc311eaff42eb1f288ea8fc23718871bca12ca", "title": "Panopticon: A Complete In-DRAM Rowhammer Mitigation"}, {"paperId": "ee3049484dc227be47e201b5e18102e3233b8750", "title": "Yes, One-Bit-Flip Matters! Universal DNN Model Inference Depletion with Runtime Code Fault Injection"}]}
