{"paperId": "2158b11b6896ab6d334264b34072085277ea2b59", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "MUSE: A Programmable Metadata Load Estimation Interface for Ceph File System", "abstract": "CephFS represents a prominent distributed file system that utilizes directory fragment migration to achieve improved runtime balance. However, its imprecise imbalance model and subtree selection algorithms can result in suboptimal performance. Our prior work, Lunule, enhances CephFS by introducing an imbalance factor model and a workload-aware load estimation policy. Nevertheless, Lunule’s built-in workload-aware planner still relies on a unified formula with adjustable coefficients, representing a one-size-fits-all approach. In this study, we introduce MUSE, a novel and user-friendly programmable interface that specifically focuses on subtree migration planning. MUSE effectively separates the complex and challenging task of evaluating subtree loads for different workloads, enabling designers to manipulate expected loads in the subsequent epoch. This facilitates the selection of appropriate subtrees for migration and opens up possibilities for implementing true isolated workloadaware policies. Through the utilization of two small Lua scripts, we demonstrate that MUSE achieves comparable load balancing effects and performance to CephFS and Lunule in workloads characterized by temporal and spatial locality.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE 29th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "1951-1958"}, "authors": [{"authorId": "117154739", "name": "Xinyang Shao"}, {"authorId": "2143635672", "name": "Cheng Li"}, {"authorId": "2293944838", "name": "Yinlong Xu"}], "citations": []}
