{"paperId": "215d93635f964d435a31fceac3be2857574e4acb", "publicationVenue": null, "title": "FADM-SLAM: a fast and accurate dynamic intelligent motion SLAM for autonomous robot exploration involving movable objects", "abstract": "\nPurpose\nMany popular simultaneous localization and mapping (SLAM) techniques have low accuracy, especially when localizing environments containing dynamically moving objects since their presence can potentially cause inaccurate data associations. To address this issue, the proposed FADM-SLAM system aims to improve the accuracy of SLAM techniques in environments containing dynamically moving objects. It uses a pipeline of feature-based approaches accompanied by sparse optical flow and multi-view geometry as constraints to achieve this goal.\n\n\nDesign/methodology/approach\nFADM-SLAM, which works with monocular, stereo and RGB-D sensors, combines an instance segmentation network incorporating an intelligent motion detection strategy (iM) with an optical flow technique to improve location accuracy. The proposed AS-SLAM system comprises four principal modules, which are the optical flow mask and iM, the ego motion estimation, dynamic point detection and the feature-based extraction framework.\n\n\nFindings\nExperiment results using the publicly available RGBD-Bonn data set indicate that FADM-SLAM outperforms established visual SLAM systems in highly dynamic conditions.\n\n\nOriginality/value\nIn summary, the first module generates the indication of dynamic objects by using the optical flow and iM with geometric-wise segmentation, which is then used by the second module to compute the starting point of a posture. The third module, meanwhile, first searches for the dynamic feature points in the environment, and second, eliminates them from further processing. An algorithm based on epipolar constraints is implemented to do this. In this way, only the static feature points are retained, which are then fed to the fourth module for extracting important features.\n", "venue": "Robotic Intelligence and Automation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-02", "journal": {"name": "Robotic Intelligence and Automation"}, "authors": [{"authorId": "30975695", "name": "Q. ul Islam"}, {"authorId": "39298292", "name": "H. Ibrahim"}, {"authorId": "2218752761", "name": "Pan Kok Chin"}, {"authorId": "2072804299", "name": "Kevin Lim"}, {"authorId": "2155841399", "name": "Mohd Zaid Abdullah"}], "citations": [{"paperId": "e8138716d619301236c0685e4833a36e6a566f08", "title": "ARD-SLAM: Accurate and robust dynamic SLAM using dynamic object identification and improved multi-view geometrical approaches"}, {"paperId": "4d3be17cb9368f34e784f76b9021b5c2afc66270", "title": "ShipGeoNet: SAR Image-Based Geometric Feature Extraction of Ships Using Convolutional Neural Networks"}]}
