{"paperId": "216944a0054d43b2e72f60f6e3e321876bde6290", "publicationVenue": {"id": "25ad4e74-ffd1-46b6-8be6-b6907e3a50a6", "name": "International Parallel Data Systems Workshop", "type": "conference", "alternate_names": ["Int Parallel Data Syst Workshop", "Petascale Data Storage Workshop", "PDSW"]}, "title": "Towards Physical Design Management in Storage Systems", "abstract": "In the post-Moore era, systems and devices with new architectures will arrive at a rapid rate with significant impacts on the software stack. Applications will not be able to fully benefit from new architectures unless they can delegate adapting to new devices in lower layers of the stack. In this paper we introduce physical design management which deals with the problem of identifying and executing transformations on physical designs of stored data, i.e. how data is mapped to storage abstractions like files, objects, or blocks, in order to improve performance. Physical design is traditionally placed with applications, access libraries, and databases, using hard-wired assumptions about underlying storage systems. Yet, storage systems increasingly not only contain multiple kinds of storage devices with vastly different performance profiles but also move data among those storage devices, thereby changing the benefit of a particular physical design. We advocate placing physical design management in storage, identify interesting research challenges, provide a brief description of a prototype implementation in Ceph, and discuss the results of initial experiments at scale that are replicable using Cloudlab. These experiments show performance and resource utilization trade-offs associated with choosing different physical designs and choosing to transform between physical designs.", "venue": "International Parallel Data Systems Workshop", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-01", "journal": {"name": "2019 IEEE/ACM Fourth International Parallel Data Systems Workshop (PDSW)", "pages": "40-49"}, "authors": [{"authorId": "46826524", "name": "K. Dahlgren"}, {"authorId": "40559862", "name": "J. LeFevre"}, {"authorId": "1908546", "name": "Ashay Shirwadkar"}, {"authorId": "35311253", "name": "Ken Iizawa"}, {"authorId": "35237829", "name": "Aldrin Montana"}, {"authorId": "3064226", "name": "P. Alvaro"}, {"authorId": "3198700", "name": "C. Maltzahn"}], "citations": [{"paperId": "ae8ff6bd6b2c34918a50639acd71faf3499712b3", "title": "Mapping Datasets to Object Storage System"}, {"paperId": "d37764ec8d2e6f644c1ea91e5bf14c6935d19efa", "title": "SkyhookDM: Data Processing in Ceph with Programmable Storage"}, {"paperId": "d65cb369bdfae0aafd581c48be9f6e3ec5321c67", "title": "Culture of Complacency and Crisis"}]}
