{"paperId": "217a40f1cfff83bcf4b3c22d38b8813122cb031d", "publicationVenue": null, "title": "Real Estate Price Prediction Based on Linear Regression and Machine Learning Scenarios", "abstract": "The changes in the housing market are not only related to human beings’ daily life, but also have an important impact on the national economy. The prediction of housing price is one of the most widely concerned topics, which is linked to the formulation of national real estate policies and the analysis of the economic situation. In this context, this paper takes housing price prediction as the topic, selects the Eames housing price dataset in Iowa, and uses supervised multiple linear regression and machine learning algorithm to train and test the real estate price prediction model. Among them, there are 79 explanatory variables, which are related to housing attributes and the explanatory variable is housing price. 1460 data is included in the training set and 1459 in the test set. In the part of machine learning algorithm, PaddlePaddle deep learning framework is used in this paper to train and test the models with the help of AI Studio platform. The experimental results show that the scatter plots of the real values are clustered and distributed on both sides of the predicted line, and their direct differences are within 30 points. According to the analysis, the real estate price prediction model based on linear regression and machine learning is reliable and stable. This paper aims to provide some suggestions for the housing price prediction. These results shed light on guiding the reference direction for investors, so as to guide the formulation of relevant policies.", "venue": "BCP Business &amp; Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-02", "journal": {"name": "BCP Business &amp; Management"}, "authors": [{"authorId": "2212359722", "name": "Tingjun Mao"}], "citations": [{"paperId": "842bf4b803d7dfb569c1c71869853dd4921a3cfc", "title": "Enhancing Used Automobile Valuations: A Data-Cleaning and Linear Regression Approach for Predicting Prices In Competitive Market"}]}
