{"paperId": "218747160ab0f6204fe763883e73fbdbd779b79a", "publicationVenue": {"id": "4c543850-b1e1-448c-87b8-f4f197ad4a57", "name": "Anales de Edificación", "alternate_names": ["An Edificación"], "issn": "2444-1309", "url": "http://polired.upm.es/index.php/anales_de_edificacion", "alternate_urls": ["http://polired.upm.es/index.php/anales_de_edificacion/issue/view/337/showToc"]}, "title": "Aplicación de una herramienta avanzada de análisis de datos en el entorno de la construcción = Application of advanced data analysis tool in building environment.", "abstract": "Los sistemas de monitorización de edificios proporcionan grandes volúmenes de información y existen herramientas avanzadas de análisis de datos. Un problema de detección y diagnóstico de fallos (FDD) en los sistemas energéticos de los edificios también puede considerarse un problema de aprendizaje automático puro. El objetivo de este trabajo es promover la FDD con aplicaciones de aprendizaje automático en el entorno de los edificios. Como contribución, en este trabajo se procesan series de datos temporales brutos, obtenidos de un SCADA, para la posterior construcción de patrones de una instalación térmica de un edificio. La instalación térmica abastece las demandas de ACS y calefacción de un edificio residencial, compuesto por 26 viviendas sociales y situado en Durango (norte de España). Los datos registrados cada 24 horas en valores acumulados se incluyen en el software R para el cálculo de gráficos estadísticos. Para los valores de los contadores de consumo de ACS y calefacción se obtienen 229 puntos de datos válidos y los rangos de consumo diario están comprendidos entre 1,94 - 5,90 m3 y 0 - 547,63 kWh.AbstractBuilding monitoring systems deliver large volumes of information and advanced data analysis tools are available. A fault detection and diagnosis (FDD) problem in building energy systems can also be regarded as a pure machine learning problem. The aim of this work is to promote FDD with machine learning applications in building environment. As a contribution, in this work raw time data series, obtained from a SCADA, are processed for further pattern construction of a building thermal facility. The thermal facility supplies the DHW, and heating demands of a residential building, consisting of 26 social dwelling units and located at Durango (northern Spain). Data recorded every 24 hours in cumulative values is included in the R software for computing statistical graphs. For DHW and heating consumption meter values, 229 valid data points are obtained, and the daily consumption ranges are between 1.94 - 5.90 m3 and 0 - 547.63 kWh respectively.", "venue": "Anales de Edificación", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-30", "journal": {"name": "Anales de Edificación"}, "authors": [{"authorId": "2100992868", "name": "A. Hernández-Arizaga"}, {"authorId": "1418019161", "name": "A. Picallo-Pérez"}, {"authorId": "2137362185", "name": "J. Sala-Lizarraga"}], "citations": []}
