{"paperId": "219da4ca56b70a20f4eaea70d1d11d670f7191e9", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Kalis2.0—A SECaaS-Based Context-Aware Self-Adaptive Intrusion Detection System for IoT", "abstract": "The wide variety of application domains makes the Internet of Things (IoT) quite unique among other types of computer networks: IoT networks can be made of devices of different types, i.e., characterized by different hardware, functionalities, computing capabilities, and also network topology and communication protocols may drastically change from one IoT application to another. Such a heterogeneity requires ad-hoc security solutions, as security techniques that are effective in one IoT context may not be so in another context. Furthermore, IoT networks are ever evolving by their very nature as smart devices can be easily added or removed. These factors call for the design of security tools capable of adapting themselves to the specific IoT instance, but also to the continuous network changes. In this article we propose a context-aware, Security-as-a-Service-based approach for intrusion detection whereby an IDS: 1) autonomously collects information about the monitored system; 2) chooses the best detection strategy accordingly; and 3) modifies the detection strategy as the network evolves over time. This comprehensive approach to intrusion detection is an attempt to face the heterogeneity which characterizes the IoT in all its aspects, making it possible the design of a security tool able to be self-adaptive and context-aware, that is, effective in different and evolving IoT scenarios with little or no human intervention.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "12579-12601", "volume": "11"}, "authors": [{"authorId": "1932064", "name": "Antonino Rullo"}, {"authorId": "3225274", "name": "Daniele Midi"}, {"authorId": "2267576705", "name": "Anand Mudjerikar"}, {"authorId": "2166480026", "name": "Elisa Bertino"}], "citations": []}
