{"paperId": "21a116ddae1c25190f28b4688acc7bf0cfe4de08", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "A Deep Neural Network Framework for Landslide Susceptibility Mapping by Considering Time-Series Rainfall", "abstract": "Landslide susceptibility mapping (LSM) is of great significance in geohazard early warning and prevention. The existing LSM methods mostly used traditional static landslide conditioning factors (LCFs), which only considered the spatial features of single-pixel neighborhoods and could not extract the time-series dynamic features of developing landslides, resulting in low accuracy and insufficient reliability of LSM. To solve this problem, this study proposes to introduce time-series rainfall factors based on the traditional static factors and construct an integrated time-series dynamic neural network (TSDNN) model for LSM. A convolutional neural network (CNN) adding time-distributed convolution and a bidirectional long and short-term memory neural network is utilized to extract time-series rainfall features, and a multiscale convolutional neural network (MSCNN) is utilized to extract static features of the static LCFs. In this study, multicollinearity analysis and geodetector are utilized to analyze the LCFs. Multiple evaluation metrics are utilized to analyze the proposed model performance. The results indicate that the overall accuracy has improved by introducing time-series rainfall factors, and the susceptibility area of actual predicted is more refined. The study indicates that significant advantages of the proposed TSDNN model are over models [CNN, MSCNN, random forest (RF)] when processing combined static and rainfall data. This is notably evident that the accuracy is enhanced by 12.9%, 10.7%, and 11.4% compared to CNN, MSCNN, and RF models in the receiver operating characteristic curve analysis, respectively. Moreover, two typical areas containing three recent landslide events validate the reliability of the proposed TSDNN model. The proposed network model framework for LSM considering time-series rainfall factors can provide new ideas and key technical support for landslide disaster prevention.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "5946-5969", "volume": "17"}, "authors": [{"authorId": "2210541287", "name": "Binghai Gao"}, {"authorId": "2145970171", "name": "Yi He"}, {"authorId": "2288487486", "name": "Xueye Chen"}, {"authorId": "2271547628", "name": "Hesheng Chen"}, {"authorId": "2155401342", "name": "Wang Yang"}, {"authorId": "2108025184", "name": "Lifeng Zhang"}], "citations": []}
