{"paperId": "21c0f2391bcb43b9c67a1cd95d8ba74cb8091d43", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Secure and Privacy-Preserving Human Interaction Recognition of Pervasive Healthcare Monitoring", "abstract": "A cloud-based Artificial Intelligence (AI) service has recently empowered the Internet of Medical Things (IoMT) in many applications on the remote Human Interaction Recognition of Pervasive Healthcare Monitoring (HIR-PHM). In this work, a framework of the skeleton-based HIR-PHM under secure Edge-Fog-Cloud computing (EFCC) was proposed to manage the computation and storage resources, latency, cyber-attack, and privacy-preserving simultaneously. At the Edge, IoMT with a camera, record the human interaction as videos and sends them to the Fog, which installed a human pose estimation model, PoseNet, to convert the videos into human skeleton data. At the Cloud, a skeleton-based Spatial-Temporal Graph Convolution Network with Pairwise Adjacency Matrix (STGCN-PAM) was employed to recognize the human interaction. A Hybrid of One Time Password (OTP), Hashed Messages Authentication Code (HMAC), and symmetric cipher were employed to secure the skeleton data. The UT-Interaction dataset was used to evaluate the proposed framework. Besides, the computation performance and latency under EFCC were compared with Edge-Fog and Edge-Cloud deployments. Experimental results confirmed two major contributions: 1) the proposed framework has promising performance compared with other methods on the dataset. 2) The skeleton-based HIR-PHM with secure EFCC shows the advantages of better computation performance in terms of frame per second.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "2439-2454", "volume": "10"}, "authors": [{"authorId": "2875466", "name": "Chao-Lung Yang"}, {"authorId": "1443743169", "name": "Hendrik Tampubolon"}, {"authorId": "2000695163", "name": "Aji Setyoko"}, {"authorId": "145525478", "name": "K. Hua"}, {"authorId": "47829536", "name": "M. Tanveer"}, {"authorId": "2149192096", "name": "Wei Wei"}], "citations": [{"paperId": "9d73fadf50e3c391bd7bb4c547cc47765ab51cf7", "title": "Field-Programmable Gate Array-Based Implementation of Zero-Trust Stream Data Encryption for Enabling 6G-Narrowband Internet of Things Massive Device Access"}, {"paperId": "0a2cc67aa145bdce1eef73be07a6919a8b7e2690", "title": "Graph Involutional Networks with Dynamic Feature Fusion for Skeleton-Based Action Recognition"}]}
