{"paperId": "21cc1a8e81b24a94b5633d3f2d8d553a7cbf8ad9", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Statistical Analysis of the Performance of Rank Fusion Methods Applied to a Homogeneous Ensemble Feature Ranking", "abstract": "The feature ranking as a subcategory of the feature selection is an essential preprocessing technique that ranks all features of a dataset such that many important features denote a lot of information. The ensemble learning has two advantages. First, it has been based on the assumption that combining different model’s output can lead to a better outcome than the output of any individual models. Second, scalability is an intrinsic characteristic that is so crucial in coping with a large scale dataset. In this paper, a homogeneous ensemble feature ranking algorithm is considered, and the nine rank fusion methods used in this algorithm are analyzed comparatively. The experimental studies are performed on real six medium datasets, and the area under the feature-forward-addition curve criterion is assessed. Finally, the statistical analysis by repeated-measures analysis of variance results reveals that there is no big difference in the performance of the rank fusion methods applied in a homogeneous ensemble feature ranking; however, this difference is a statistical significance, and the B-Min method has a little better performance.", "venue": "Scientific Programming", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-10", "journal": {"name": "Sci. Program.", "pages": "8860044:1-8860044:14", "volume": "2020"}, "authors": [{"authorId": "9406551", "name": "M. Soheili"}, {"authorId": "102660617", "name": "A. Eftekhari-Moghadam"}, {"authorId": "145319395", "name": "M. Dehghan"}], "citations": [{"paperId": "34bd180f45bbbd25be4c3d005287da3504a26dfc", "title": "Ensemble learning based on relative accuracy approach and diversity teams"}, {"paperId": "9b356c75fffa1dffc748a8a53a52b376753e09b8", "title": "Distributed Ensemble Feature Selection Framework for High-Dimensional and High-Skewed Imbalanced Big Dataset"}]}
