{"paperId": "21d4bf6099daf66b3ebb3733848f71dd7cebb245", "publicationVenue": {"id": "822b041c-2f88-4169-86a0-4a29423d8ce9", "name": "Scientia Sinica Technologica", "alternate_names": ["Sci Sin Technol"], "issn": "1674-7259"}, "title": "Dynamic earth observation based on an urban skyline: A new remote sensing approach for urban emergency response", "abstract": "Real-time tempo-spatial data is crucial in responding to urban emergencies. Limited by a revisiting period, spatial resolution, and data availability, traditional remote sensing data is often received too late to aid emergency management. This study proposes a real-time remote sensing approach that is based on the city skyline. In this approach, remote sensing sensors are deployed on super high-rise buildings (>300 m), and real-time land observation products are obtained by following the regular remote sensing processing procedure. This remote sensing approach has advantages such as low-cost, easy sensor deployment and maintenance, no cloud interference, real-time observation, and a wide observation range. This novel remote sensing approach is an effective way to collect real-time tempo-spatial data on a small and medium scale. It can be used in urban flow (i.e., people and vehicle flows) monitoring, surface deformation detection, and urban night light analysis. This approach has great potential to aid in the rapid response to urban emergencies such as city fires, aggregated human activities, and floods.", "venue": "Scientia Sinica Technologica", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-06-10", "journal": {"name": "SCIENTIA SINICA Technologica"}, "authors": [{"authorId": "152745015", "name": "Chisheng Wang"}, {"authorId": "2116991112", "name": "Xue-yuan Guo"}, {"authorId": "1821169", "name": "Jincheng Jiang"}, {"authorId": "2108220785", "name": "Yongquan Wang"}, {"authorId": "2141312424", "name": "Qingquan Li"}, {"authorId": "2004926383", "name": "Hongxing Cui"}, {"authorId": "2115554492", "name": "Xinyu Wang"}], "citations": []}
