{"paperId": "21dbb081162dda173ed95e30d6cc1e4b4c1270e2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Classification of Malicious URLs by CNN Model Based on Genetic Algorithm", "abstract": "Researchers have proposed many models for the identification of malicious URLs in network security, but they have not achieved good results. In order to improve this defect, the current popular machine learning algorithm is combined to train the model, thus improving the accuracy of malicious URL classification. This paper proposes a model of a convolutional neural network based on genetic algorithm optimization. Firstly, the genetic algorithm was used to reduce the data dimension of the grammatical features, structural features, and probabilistic features in the extracted malicious URL text, and then the convolutional neural network was used to establish the model and classify the malicious URL. Through experimental verification, the model has achieved good results. Compared with the traditional machine learning model, it improves the accuracy of malicious URL recognition and provides a reference for malicious URL recognition.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-24", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1854439", "name": "Tiefeng Wu"}, {"authorId": "2192380118", "name": "Yunfang Xi"}, {"authorId": "2111003178", "name": "Miao Wang"}, {"authorId": "93770791", "name": "Z. Zhao"}], "citations": [{"paperId": "820e9504a9b403a924679d6c54190f5d8bcdbe5c", "title": "Identification and Classification of Malicious and Benign URL using Machine Learning Classifiers"}, {"paperId": "eebe05715bbdb167add5f3df1d7518590c076960", "title": "Classification of Malicious URLs Using Naive Bayes and Genetic Algorithm"}, {"paperId": "aa0ed1d8a3d128b6159b543b57ed7cfec035f23d", "title": "Efficient Classification of Malicious URLs: M-BERT—A Modified BERT Variant for Enhanced Semantic Understanding"}]}
