{"paperId": "2200c343abc368caac2b9386911bbb32c9a4ba9c", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A Brief Review of Deep Neural Network Implementations for ARM Cortex-M Processor", "abstract": "Deep neural networks have recently become increasingly used for a wide range of applications, (e.g., image and video processing). The demand for edge inference is growing, especially in the areas of relevance to the Internet-of-Things. Low-cost microcontrollers as edge devices are a promising solution for optimal application systems from several points of view such as: cost, power consumption, latency, or real-time execution. The implementation of these systems has become feasible due to the advanced development of hardware architectures and DSP capabilities, while the cost and power consumption have been maintained at a low level. The aim of the paper is to provide a literature review on the implementation of deep neural networks using ARM Cortex-M core-based low-cost microcontrollers. As an emerging research direction, there are a limited number of publications that address this topic at the moment. Therefore, the research papers that stand out have been analyzed in greater detail, to promote further interest of researchers to bring AI techniques to low power standard ARM Cortex-M microcontrollers. The article addresses a niche research domain. Despite the increasing interest manifested toward both (1) edge AI applications and (2) theoretical contributions in DNN optimization and compression, the number of existing publications dedicated to the current topic is rather limited. Therefore, a comprehensive literature survey using systematic mapping is not possible. The presentation focuses on systems that have shown increased efficiency in resource-constrained applications, as well as the predominant impediments that still hinder their implementation. The reader will take away the following concepts from this paper: (1) an overview of applications, DNN architectures, and results obtained using ARM Cortex-M core-based microcontrollers, (2) an overview of low-cost hardware devices and SW development solutions, and (3) understanding recent trends and opportunities.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-08-14", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2044357006", "name": "Ioan Lucan Orășan"}, {"authorId": "1774192", "name": "Ciprian Seiculescu"}, {"authorId": "32693028", "name": "C. Căleanu"}], "citations": [{"paperId": "9e6e91deb6401520063de74f96e2c838327690f0", "title": "David and Goliath: An Empirical Evaluation of Attacks and Defenses for QNNs at the Deep Edge"}, {"paperId": "36929b050d800ba8d250533a9a62765346cdcff6", "title": "Edge AI for Internet of Energy: Challenges and Perspectives"}, {"paperId": "8c8d80a649548cbcac28443f0d207238d6d631ce", "title": "Diffusion Probabilistic Model Based Face Anonymization in Embedded Environments"}, {"paperId": "642daf8b245bf2d667e5bf4b6ba758ed39479a4e", "title": "KP2Dtiny: Quantized Neural Keypoint Detection and Description on the Edge"}, {"paperId": "3137abf8294553a56a69ab6eb00126ea881d69d7", "title": "Artificial Intelligence Techniques for Electronics"}, {"paperId": "57211aebc89728fe43c1778c8b251922066be292", "title": "Motor Imagery Multi-Tasks Classification for BCIs Using the NVIDIA Jetson TX2 Board and the EEGNet Network"}, {"paperId": "54a24087a82b3a7ef3db4d9ab7f083273c06c8af", "title": "Deployment of Machine Learning Algorithms on Resource-Constrained Hardware Platforms for Prosthetics"}]}
