{"paperId": "221465789151cad603de22f22044c909c5716234", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 20th USENIX Conference on File and Storage Technologies.", "abstract": "We present P AIO , a framework that allows developers to implement portable I/O policies and optimizations for different applications with minor modiﬁcations to their original code base. The chief insight behind P AIO is that if we are able to intercept and differentiate requests as they ﬂow through different layers of the I/O stack, we can enforce complex storage policies without signiﬁcantly changing the layers themselves. P AIO adopts ideas from the Software-Deﬁned Storage community, building data plane stages that mediate and optimize I/O requests across layers and a control plane that coordinates and ﬁne-tunes stages according to different storage policies. We demonstrate the performance and applicability of P AIO with two use cases. The ﬁrst improves 99 th percentile latency by 4 × in industry-standard LSM-based key-value stores. The second ensures dynamic per-application bandwidth guarantees under shared storage environments.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2073947633", "name": "Ricardo Macedo"}, {"authorId": "2286034952", "name": "Yusuke Tanimura"}, {"authorId": "2286024720", "name": "Jason Haga"}, {"authorId": "2286054318", "name": "Vijay Chidambaram"}, {"authorId": "2287784831", "name": "José Pereira"}, {"authorId": "145026668", "name": "J. Paulo"}], "citations": [{"paperId": "ee2a164aaff6e6d575dd669155b1025a991bc166", "title": "Holistic and Opportunistic Scheduling of Background I/Os in Flash-Based SSDs"}, {"paperId": "6a10db11ddc15e4f581e0aaecbdce0bc27716306", "title": "Taming Metadata-intensive HPC Jobs Through Dynamic, Application-agnostic QoS Control"}, {"paperId": "bbf3502c362af83d5e55abbb8bcd3edb4ba7a855", "title": "Protecting Metadata Servers From Harm Through Application-level I/O Control"}, {"paperId": "cf2375254f3c621bc2d43a7198f25fd2882d5b46", "title": "Efficient LSM-Tree Key-Value Data Management on Hybrid SSD/HDD Zoned Storage"}]}
