{"paperId": "221b275c54a3d190514dd3e5a8c2e3e3dc96cfa9", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Early Warning of Student Performance With Integration of Subjective and Objective Elements", "abstract": "Early warning of student performance is using data analytics to predict future trends in student performance as a way to intervene early in situations of academic risk. The popularity of machine learning has improved prediction accuracy. However, most current models only consider subjective student factors without examining the external environment and objective elements. Meanwhile, the global pandemic of COVID-19 has brought serious disruptions to teaching and learning in universities, and existing models cannot cope with this challenge. In this study, we propose a neural network model that integrates various internal and external factors and incorporates data-level sample synthesis and multi-classification cost-sensitive learning methods to achieve early warning of student performance in universities and improve teaching quality and management. Experimental results show that the model can be applied to teaching scenarios with a mixture of online and offline teaching, has higher accuracy than previous prediction mechanisms that only consider some student’s academic characteristics, and outperforms traditional machine learning methods.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "72601-72617", "volume": "11"}, "authors": [{"authorId": "36847398", "name": "Kuangyu Qin"}, {"authorId": "2223363639", "name": "Xiaoyang Xie"}, {"authorId": "145655762", "name": "Qian He"}, {"authorId": "47674263", "name": "Guofeng Deng"}], "citations": []}
