{"paperId": "221e5d7fa2d2fe8602c77cd69d3ed836453771f7", "publicationVenue": {"id": "c0fc53c7-b0ed-487d-9191-1262c8322621", "name": "Journal of Imaging", "type": "journal", "alternate_names": ["J Imaging"], "issn": "2313-433X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-556372", "alternate_urls": ["https://www.mdpi.com/journal/jimaging", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-556372"]}, "title": "A Robust Tensor-Based Submodule Clustering for Imaging Data Using l12 Regularization and Simultaneous Noise Recovery via Sparse and Low Rank Decomposition Approach", "abstract": "The massive generation of data, which includes images and videos, has made data management, analysis, information extraction difficult in recent years. To gather relevant information, this large amount of data needs to be grouped. Real-life data may be noise corrupted during data collection or transmission, and the majority of them are unlabeled, allowing for the use of robust unsupervised clustering techniques. Traditional clustering techniques, which vectorize the images, are unable to keep the geometrical structure of the images. Hence, a robust tensor-based submodule clustering method based on l12 regularization with improved clustering capability is formulated. The l12 induced tensor nuclear norm (TNN), integrated into the proposed method, offers better low rankness while retaining the self-expressiveness property of submodules. Unlike existing methods, the proposed method employs a simultaneous noise removal technique by twisting the lateral image slices of the input data tensor into frontal slices and eliminates the noise content in each image, using the principles of the sparse and low rank decomposition technique. Experiments are carried out over three datasets with varying amounts of sparse, Gaussian and salt and pepper noise. The experimental results demonstrate the superior performance of the proposed method over the existing state-of-the-art methods.", "venue": "Journal of Imaging", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "Journal of Imaging", "volume": "7"}, "authors": [{"authorId": "2067906778", "name": "Jobin Francis"}, {"authorId": "8767801", "name": "Baburaj Madathil"}, {"authorId": "2288329277", "name": "S. N. George"}, {"authorId": "144883951", "name": "S. George"}], "citations": [{"paperId": "2df62fe2dc995d5cdd258c7178b98f24f42d6d1c", "title": "An approximate tensor singular value decomposition approach for the fast grouping of whole-body human poses"}]}
