{"paperId": "222f2f4ffdf3f1984187f2ade6da5beec4e1e44e", "publicationVenue": {"id": "9e95dfeb-9d84-4b9f-bf25-f543f03230b0", "name": "International Conferences on Internet of Things, Embedded Systems and Communications", "type": "conference", "alternate_names": ["IINTEC", "Int Conf Internet Thing Embed Syst Commun"]}, "title": "Securing Mobile IoT Deployment Using Embedded SIM: Concerns and Solutions", "abstract": "Although the Internet of Things (IoT) has gained ground in recent years, it still does not feel as mature as promised. The main reasons are the security concerns and the intelligent deployment of IoT device's connectivity. But, with the upcoming 5G and the 6th generation of Wi-Fi, if the security aspects will be considered rigorously, this has direct impact on the IoT success. Thus, many standardization works to ensure IoT security have already published and recent researches have open new tracks to satisfy the IoT security concerns. In this paper, we address a new track that we believe is crucial to fulfilling the IoT security needs. It is about the use of the embedded SIM (eSIM) for IoT device secured identification. The idea is to distinguish eSIMs used for IoT services from those used for traditional services. As a result, MNO's subscriptions associated to IoT services are managed in a more secure and efficient way. We study the eSIM's security mechanisms and we arise the observed potential vulnerabilities. We propose solutions to avoid such potential vulnerabilities so that the most appropriate level of security for an IoT service will be satisfied.", "venue": "International Conferences on Internet of Things, Embedded Systems and Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 International Conference on Internet of Things, Embedded Systems and Communications (IINTEC)", "pages": "75-79"}, "authors": [{"authorId": "2911875", "name": "S. Chitroub"}, {"authorId": "1430788385", "name": "D. Blaid"}, {"authorId": "1430788587", "name": "H. Aouadia"}, {"authorId": "113017221", "name": "R. Laouar"}], "citations": [{"paperId": "70dbb721415bf2532e1497d937b796b3264bc0c6", "title": "An eSIM-based remote credential provisioning and authentication protocol for IoT devices in 5G cellular network"}]}
