{"paperId": "224f70e319317f53c00d177e9cc2d90714afd5de", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Multi-Task Learning for Electricity Price Forecasting and Resource Management in Cloud Based Industrial IoT Systems", "abstract": "Cloud computing has gained immense popularity in the logistics industry. This innovative technology optimizes computing operations by eliminating the requirement for physical equipment for calculations. Instead, specialized companies provide cloud-based computing services, relying heavily on computers and servers that consume substantial amounts of energy. Hence, ensuring the availability of affordable and dependable electricity is paramount for the efficient design and management of these logistics services. Cloud centers, which are power-intensive, face the challenge of reducing their energy consumption due to escalating power costs. To address this issue, efficient data placement and node management strategies are commonly employed in logistics operations. An AlexNet model has been designed to optimize storage relocation and predict power prices. The outcome of this initiative has resulted in a considerable reduction in energy consumption at data centres. The model uses Dwarf Mongoose Optimization Algorithm (DMOA) to produce an optimal solution for the AlexNet and increase its performance with a real-world dataset from IESO in Ontario, Canada. 75% of the available data was used for training to assure the model’s precision, with the remaining 25% allocated to testing purposes. The model forecasts power prices with an MAE of 2.22% and an MSE of 6.33%, resulting in an average reduction of 22.21% in electricity expenses. Our proposed method has an accuracy of 97% compared to 11 benchmark algorithms, including CNN, DenseNet, and SVM having an accuracy of 89%, 88%, and 82%, respectively.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "54280-54295", "volume": "11"}, "authors": [{"authorId": "8694476", "name": "A. Almazroi"}, {"authorId": "29931741", "name": "N. Ayub"}], "citations": [{"paperId": "a3b55d6cad6d456831209a3dd0705323d75f280f", "title": "Multi-task deep learning for large-scale buildings energy management"}, {"paperId": "9ffa895db00a7b182a0d3d587d5920f8240aecec", "title": "Nature-inspired solutions for energy sustainability using novel optimization methods"}]}
