{"paperId": "226c51ef8c90ea212c6ca9bdc37ebc1356d17e96", "publicationVenue": {"id": "811144ef-4ece-4c08-a7b7-327cf2e2dd13", "name": "International journal of social science and humanity research", "type": "journal", "alternate_names": ["International journal of social science and humanities research", "Int J Soc Sci Humanit Res", "International journal of social sciences and humanities research", "Int j soc sci humanit res", "International Journal of Social Science and Humanities Research-MIYR"], "issn": "2689-3517", "alternate_issns": ["2348-2990", "2348-3156", "2788-9092"], "url": "http://researchpublish.com/journalss/IJSSHR", "alternate_urls": ["http://www.scientificrc.com/"]}, "title": "Moderating Effect of Social Media Usage on Online Reviews and Consumer Purchasing Intention in Kenya.", "abstract": "This study examines the moderating effect of social media on online reviews and consumer purchasing intentions in Kenya. Data were collected from a convenient sample of his 304 consumers who had made previous purchases based on online reviews. The results show that online reviews have a significantly positive impact on consumer purchasing intentions. Additionally, social media platforms can positively influence consumer purchasing intention, amplifying the impact of online reviews. However, the relationship between online reviews and consumer purchasing intention has been moderated by social media, with less impact for consumers who use social media platforms more. These findings suggest that Kenyan businesses and marketers should monitor and act on online reviews on social media platforms to increase their influence on consumer purchasing intentions. Additionally, businesses should target consumers who are less likely to use social media platforms to maximize the impact of online reviews on purchasing intention.", "venue": "International journal of social science and humanity research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-24", "journal": {"name": "International Journal of Social Science and Humanities Research (IJSSHR) ISSN 2959-7056 (o); 2959-7048 (p)"}, "authors": [{"authorId": "120865669", "name": "Juniter Kwamboka"}, {"authorId": "2281080589", "name": "Edward Otieno Owino"}], "citations": []}
