{"paperId": "2277c55eeacde29da28eb5e7d9a63d7ffa47bbd9", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Intelligent Computation Offloading for IoT Applications in Scalable Edge Computing Using Artificial Bee Colony Optimization", "abstract": "Most of the IoT-based smart systems require low latency and crisp response time for their applications. Achieving the demand of this high Quality of Service (QoS) becomes quite challenging when computationally intensive tasks are offloaded to the cloud for execution. Edge computing therein plays an important role by introducing low network latency, quick response, and high bandwidth. However, offloading computations at a large scale overwhelms the edge server with many requests and the scalability issue originates. To address the above issues, an efficient resource management technique is required to maintain the workload over the edge and ensure the reduction of response time for IoT applications. Therefore, in this paper, we introduce a metaheuristic and nature-inspired Artificial Bee Colony (ABC) optimization technique that effectively manages the workload over the edge server under the strict constraints of low network latency and quick response time. The numerical results show that the proposed ABC algorithm has outperformed Particle Swarm Optimization (PSO), Ant Colony Optimization (ACO), and Round-Robin (RR) Scheduling algorithms by producing low response time and effectively managing the workload over the edge server. Furthermore, the proposed technique scales the edge server to meet the demand of high QoS for IoT applications.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-04", "journal": {"name": "Complex.", "pages": "5563531:1-5563531:12", "volume": "2021"}, "authors": [{"authorId": "119788444", "name": "Mohammad Babar"}, {"authorId": "2115773840", "name": "M. Khan"}, {"authorId": "1510901297", "name": "Ahmad Din"}, {"authorId": "3713566", "name": "Farman Ali"}, {"authorId": "2303893", "name": "U. Habib"}, {"authorId": "2065578072", "name": "K. Kwak"}], "citations": [{"paperId": "cdedfaefaad43c370db8d1c28e1b188fbda8cc2f", "title": "Service Level Agreement in cloud computing: Taxonomy, prospects, and challenges"}, {"paperId": "2669c15376854bae700b973862f769e8c01f4607", "title": "MBASE: Meta-heuristic Based optimized location allocation algorithm for baSE station in IoT assist wireless sensor networks"}, {"paperId": "fa9f157e74bae0203515cb50e11dfe592d2c4e39", "title": "e-TOALB: An efficient task offloading in IoT-fog networks"}, {"paperId": "6bedd1561dbd3c9a26501238f4eb4e501f5358c6", "title": "Forecasting failure rate of IoT devices: A deep learning way to predictive maintenance"}, {"paperId": "6aa56290cecf26b9b62c1035ab14235f6f73f5d5", "title": "Multi-objective computation offloading based on Invasive Tumor Growth Optimization for collaborative edge-cloud computing"}, {"paperId": "20de4c2c0e04f7321feb77cbc12b11020b90f202", "title": "Task Reverse Offloading with Deep Reinforcement Learning in Multi-Access Edge Computing"}, {"paperId": "8e013327feaf842084c7c64e7519107f21161e37", "title": "Symmetry in Privacy-Based Healthcare: A Review of Skin Cancer Detection and Classification Using Federated Learning"}, {"paperId": "912be56655e7ff41d5073e41cea36ac19647b26f", "title": "An Autonomic Workload Prediction and Resource Allocation Framework for Fog-Enabled Industrial IoT"}, {"paperId": "aef435a92bbee92ca155d135c2258b813cbe0af1", "title": "Ultra‐reliability and low‐latency communications on the internet of things based on 5G network: Literature review, classification, and future research view"}, {"paperId": "0331bfa0315b7feda0037ef796d0df64b0ab13e0", "title": "DECO: A Deadline-Aware and Energy-Efficient Algorithm for Task Offloading in Mobile Edge Computing"}, {"paperId": "96ab5a5a35da8fd513610817c506ece5f771c6cd", "title": "A novel Q-learning-based hybrid algorithm for the optimal offloading and scheduling in mobile edge computing environments"}, {"paperId": "f915ff067de6ffce7e91a9888d859f0280c23e3f", "title": "Energy-efficient multiuser and multitask computation offloading optimization method"}, {"paperId": "667b4987842988c9c96853291dee9ae2c15d7c78", "title": "Modified Artificial Bee Colony Based Feature Optimized Federated Learning for Heart Disease Diagnosis in Healthcare"}, {"paperId": "f2d08c80008153e9c65dd47651704fc32499f0c5", "title": "An intelligent hybrid method: Multi-objective optimization for MEC-enabled devices of IoE"}, {"paperId": "147303cfdf832c0fe56c9c479b3455d991142dbb", "title": "A Bacterial Foraging Based Smart Offloading for IoT Sensors in Edge Computing"}, {"paperId": "8bd28405c15da15ee0344b5745581e9b35cf59bb", "title": "Effects of Internet of things (IoT) on performance of agricultural in China: A case study"}, {"paperId": "dda8b646c83de55c91942f1bd0f8f61c67007bea", "title": "Multi Objective Task Offloading in Fog Computing using Sparrow Search algorithm"}, {"paperId": "5fd242a5240975d419841c00ae80db2293c0345d", "title": "Ant colony resource optimization for Industrial IoT and CPS"}, {"paperId": "fcbd799f53d4b56a9ab7b5919e2eeee688318d3f", "title": "ScalEdge: A framework for scalable edge computing in Internet of things–based smart systems"}, {"paperId": "58f3443bbf385576a5cc1b41213bf6d95478ff00", "title": "Swarm intelligence and internet of everything optimization solutions"}, {"paperId": "753825328736f4d5175bb8f44e9db82c6e08e7f2", "title": "New Research Directions for Green Mobile Cloud Computing"}, {"paperId": "12ed5dab2a6e808c2bafc96dad687fdc50c13e35", "title": "Scalable Edge Computing for IoT and Multimedia Applications Using Machine Learning"}]}
