{"paperId": "2277598cedadf1562f409a791eb4ae54a2721e37", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Achieving Sustainable Smart Cities through Geospatial Data-Driven Approaches", "abstract": "In recent years, the concept of smart cities has become increasingly important in the pursuit of sustainable development goals. In general, common urban challenges have been addressed through smart-city services, and new perspectives for more sustainable cities have emerged. To realize the full potential of such smart urban environments, geospatial approaches have been used as a focal point, offering a plethora of applications that contribute to a better understanding of urban challenges and innovation potentials. Nevertheless, although significant progress has been made, different problems may arise when the available technologies and resources are not understood or even when their potentialities are not properly capitalized. This article reviews the state of the art in the field, highlighting success cases and remaining challenges in exploiting geospatial data-driven strategies, particularly when leveraging geographic information systems, satellites, and distributed sensors to produce and process geospatial data and datasets in urban scenarios. Moreover, a more organized perspective of the area is provided in this article, as well as future development trends, supporting new research efforts in this area when empowering smart cities for a more sustainable future.", "venue": "Sustainability", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-11", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2246808373", "name": "Daniel G. Costa"}, {"authorId": "2268562150", "name": "João Carlos N. Bittencourt"}, {"authorId": "2065054812", "name": "Franklin Oliveira"}, {"authorId": "41065490", "name": "J. P. J. Peixoto"}, {"authorId": "144728679", "name": "Thiago C. Jesus"}], "citations": []}
