{"paperId": "2280050190d75db29c2f05a6a1d94fae8c95c53c", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Adaptive Mechanism Model for the Prevention of SLA Violation in the Context of COPD Patient Monitoring", "abstract": "In this paper, we introduce a new kind of Service Level Agreement(SLA) Template to better control dynamically quality of medical monitoring platform service. Our approach is based on Health care system and Health Information Technology (HIT) research area, specifically the field of telemonitoring system for patients who suffer from chronic obstructive pulmonary disease (COPD). According to WHO statistics, COPD is the third leading cause of death worldwide. To this end, several solutions or platforms exist today to monitor COPD. Most of these platforms manage large volume of patient data. This can bring about quality and lost data problems. To address these issues, control mechanisms must be proposed and designed to improve the quality of service (QoS) on these platforms. A platform with continuously monitored QoS can save patients’ lives and reduce data quality risk. In this article, we propose an ontology that uses SLAs data from COPD monitoring platforms with dynamic data from a patient context. We dynamically calculate the number of patient data incidents and the number of service request incidents from two dynamic contexts: SLA and the patient context. If the number of incidents is higher than what is expected in the SLA, then alerts are sent to the interface parties in real time. Finally, the contribution of this article is the proposed virtual SLA template to better control SLA violation and improve quality of medical monitoring platforms services.", "venue": "Symmetry", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-22", "journal": {"name": "Symmetry", "pages": "1575", "volume": "12"}, "authors": [{"authorId": "51313530", "name": "Konan-Marcelin Kouamé"}, {"authorId": "3138293", "name": "H. Mcheick"}, {"authorId": "40579401", "name": "Hicham Ajami"}], "citations": [{"paperId": "d70f4529b2434c191525cd61bad45eaeb69227ec", "title": "Augmenting context with power information for green context-awareness in smart environments"}, {"paperId": "3e1bf89cdcb0d6549c2fc61e1e67ccf6913bf901", "title": "Validating Quality of Context in Pervasive Computing Systems: Surf Life Saving Use Case"}, {"paperId": "03ed10dc7e91c043cfe3fb189f269ddd8ed21316", "title": "State of the art in service level agreement implementation and standardization: A literature review"}]}
