{"paperId": "22911a5159ae822b63a546740374e46dae642805", "publicationVenue": {"id": "83117a17-a474-45f0-8c4e-b9120f215aea", "name": "ACM Transactions on Evolutionary Learning and Optimization", "alternate_names": ["ACM Trans Evol Learn Optim"], "issn": "2688-299X"}, "title": "A Species-based Particle Swarm Optimization with Adaptive Population Size and Deactivation of Species for Dynamic Optimization Problems", "abstract": "Population clustering methods, which consider the position and fitness of individuals to form sub-populations in multi-population algorithms, have shown high efficiency in tracking the moving global optimum in dynamic optimization problems. However, most of these methods use a fixed population size, making them inflexible and inefficient when the number of promising regions is unknown. The lack of a functional relationship between the population size and the number of promising regions significantly degrades performance and limits an algorithm’s agility to respond to dynamic changes. To address this issue, we propose a new species-based particle swarm optimization with adaptive population size and number of sub-populations for solving dynamic optimization problems. The proposed algorithm also benefits from a novel systematic adaptive deactivation component that, unlike the previous deactivation components, adapts the computational resource allocation to the sub-populations by considering various characteristics of both the problem and the sub-populations. We evaluate the performance of our proposed algorithm for the Generalized Moving Peaks Benchmark and compare the results with several peer approaches. The results indicate the superiority of the proposed method.", "venue": "ACM Transactions on Evolutionary Learning and Optimization", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-14", "journal": {"name": "ACM Transactions on Evolutionary Learning and Optimization", "pages": "1 - 25", "volume": "3"}, "authors": [{"authorId": "2220002639", "name": "Delaram Yazdani"}, {"authorId": "36933475", "name": "D. Yazdani"}, {"authorId": "40316285", "name": "Donya Yazdani"}, {"authorId": "2636102", "name": "M. Omidvar"}, {"authorId": "1764455", "name": "A. Gandomi"}, {"authorId": "143901530", "name": "X. Yao"}], "citations": [{"paperId": "7f5b41cef194f01a25f9e74c9e8c0e44174ba914", "title": "Clustering in Dynamic Environments: A Framework for Benchmark Dataset Generation With Heterogeneous Changes"}, {"paperId": "d14874487735a007490abffd827fc9d57837af95", "title": "Evolutionary Dynamic Optimization Laboratory: A MATLAB Optimization Platform for Education and Experimentation in Dynamic Environments"}]}
