{"paperId": "22a7ef7ab0d43f18072f00fabcb5dc0944296453", "publicationVenue": null, "title": "Social media in aid of post disaster management", "abstract": "This paper aims to examine tweet posts regarding Typhoon Washi to contend the usefulness of social media and big data as an aid of post-disaster management. Through topic modelling and content analysis, this study examines the priorities of the victims expressed in Twitter and how the priorities changed over a year.,Social media, particularly Twitter, was where the data gathered. Using big data technology, the gathered data were processed and analysed according to the objectives of the study. Topic modelling was used in clustering words from different topics. Clustered words were then used for content analysis in determining the needs of the victims. Word frequency count was also used in determining what words were repeatedly used during the course period. To validate the gathered data online, government documents were requested and concerned government agencies were also interviewed.,Findings of this study argue that housing and relief goods have been the top priorities of the victims. Victims are seeking relief goods, especially when they are in evacuation centres. Also, the lack of legal basis hinders government officials from integrating social media information unto policymaking.,This study only reports Twitter posts containing keywords either, Sendong, SendongPH, Washi or TyphoonWashi. The keywords were determined based on the words that trended after Typhoon Washi struck.,For social media and big data to be adoptable and efficacious, supporting and facilitating conditions are necessary. Structural, technical and financial support, as well as legal framework, should be in place. Maintaining and sustaining positive attitude towards it should be taken care of.,Although many studies have been conducted on the usefulness of social media in times of disaster, many of these focused on the use of social media as medium that can efficiently spread information, and little has been done on how the government can use both social media and big data in collecting and analysing the needs of the victims. This study fills those gaps in social big data literature.", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-04-15", "journal": {"name": "Transforming Government: People, Process and Policy", "pages": "237-260", "volume": "14"}, "authors": [{"authorId": "116237701", "name": "A. Malawani"}, {"authorId": "51969274", "name": "Achmad Nurmandi"}, {"authorId": "52001554", "name": "E. Purnomo"}, {"authorId": "50683472", "name": "T. Rahman"}], "citations": [{"paperId": "ea11ec4b12704da0ed7742d7bd6ac5076697e7df", "title": "A Novel Deep Learning Language Model with Hybrid-GFX Embedding and Hyperband Search for Opinion Analysis"}, {"paperId": "36b492ba1862274f02dc583fc73933b41f164ea1", "title": "Social media in disaster management: review of the literature and future trends through bibliometric analysis"}, {"paperId": "ca80a71cb1a321baf3252fa2ce99e4a2962df883", "title": "A systematic literature review on the use of big data analytics in humanitarian and disaster operations"}, {"paperId": "40d842be85a075aac5871e026aae10504ced1953", "title": "Public Administration Challenges in Disaster Responses: Issues"}, {"paperId": "4397e44edba312bfbb630563350549a7da7e2795", "title": "Determining the factors affecting the disaster resilience of countries by geographical weighted regression"}, {"paperId": "e7a5dc72c33076c0d8fb366d437d1e8c25a08d7b", "title": "Disaster Management Using a Contingency Approach in the Special Region of Yogyakarta"}, {"paperId": "d6523f25898afe2d953e7ea448dc5e1888809cb1", "title": "Insurance as an Alternative for Sustainable Economic Recovery after Natural Disasters: A Systematic Literature Review"}, {"paperId": "e51ab9c9cb895ea6cbf48058c1f6528a702a0c4a", "title": "Social Media Influence Towards Understanding, Awareness and Perception on Royal Institutions: Empirical Study on Young Millennials"}, {"paperId": "0aded430a493546d805a0b467219686e99f2be59", "title": "Social Media Network Analysis (SNA): Identifikasi Komunikasi dan Penyebaran Informasi Melalui Media Sosial Twitter"}, {"paperId": "5bca289253b735d9cfb9691803867aa153132399", "title": "Research themes in big data analytics for policymaking: Insights from a mixed‐methods systematic literature review"}, {"paperId": "ebc89452271b814f31337dc4b69823b42fd701cd", "title": "Local Government Respond to COVID-19 Pandemics: A Study of South Tangerang City"}, {"paperId": "1633720626f19cfb142b354ccd5ed9f72c77bc80", "title": "Disinformation and Miscommunication in Government Communication in Handling COVID-19 Pandemic"}, {"paperId": "be50ee5043e2caf7e5f7e71c24882de35c997f6c", "title": "Bringing Artificial Intelligent to Jakarta Monitoring Covid-19 Outbreak"}, {"paperId": "f00755e85a179185483c56f5282d11f9a977dba0", "title": "Classification of Inundation Level using Tweets in Indonesian Language"}, {"paperId": "698d838344c06aa0cdc3728995ab569660ae030d", "title": "Content analyses of the international federation of red cross and red crescent societies (ifrc) based on machine learning techniques through twitter"}, {"paperId": "dba8829e245a9a37bc1d6a84ea15b947a0a6df28", "title": "The impact of technological innovation on service delivery: social media and smartphone integration in a 311 system"}, {"paperId": "a89f7fa0cf5abb9e19985401525bae3790a9ff04", "title": "Whole community co-production: a full picture behind the successful COVID-19 response in S. Korea"}, {"paperId": "d343ac9ddb135cf9597e04a5bc393601e1785a2f", "title": "Regulation in the COVID-19 pandemic and post-pandemic times: day-watchman tackling the novel coronavirus"}, {"paperId": "cbc2813c8011edc36b4ed6bf18556f13a202076d", "title": "Applications of artificial intelligence for disaster management"}, {"paperId": "79578865d800f31857c940ebcc24d141445519a9", "title": "The Impacts of Covid-19 Pandemic on Socio-Economic Mobility in Indonesia"}, {"paperId": "9472fd6f691305868bb23e200b969f27db736783", "title": "Editorial"}, {"paperId": "2c895daf05d9f1012088994e89c27fe238ee9e9c", "title": "Applications of artificial intelligence for disaster 1 management"}, {"paperId": "f3c3851d3529ba611f6ac4bd2930ef340098162a", "title": "The Influence of Social Media on the Omnibus Law-Making Process in Indonesia"}, {"paperId": "b288f7c8bebfe7898ed512a592d1d2dabaafb499", "title": "Performance of Indonesian Ministry of Health in Overcoming Hoax About Vaccination Amid the COVID-19 Pandemic on Social Media ––"}, {"paperId": "ee21605c6c7eecbcf46dac5d6af73077b174d353", "title": "How Does the Indonesian Government Communicate Food Security during COVID-19 Pandemic: A Social Media Analysis on Indonesia Official Twitter Account"}, {"paperId": "0c14bb596314a6b9fcd5ea007130761ce89602ab", "title": "Sustainable Development Affecting by the Climate Change: a Secondary Study of Cyclones (Natural Disasters: Sidr, Aila and Roanu in Bangladesh)"}, {"paperId": "e0b04d8b2977e1a6b8a66b5dc1bf7c130ed3ebd6", "title": "HighTech and"}]}
