{"paperId": "22bbf5170e5e0fb722d20e2582f8ef55379a4d70", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Authentication of fog‐assisted IoT networks using Advanced Encryption credibility approach with modified Diffie–Hellman encryption", "abstract": "Cloud storage in the network enables the users to access the data from anywhere irrespective of any devices, which prevents data loss and provides centralized management. The cloud server is a pooled, centrally located server resource that many users can access as needed. More efficient data storage and processing could be achieved through fog computing devices and, the fog node handles the task including the semantic transformation of the data before transmitting it to the back‐end cloud servers, managing the process of data from several edge devices simultaneously. The security of the cloud and fog nodes acts as a key component, and that must be ensured for effective computations. In this research, the security of the fog‐assisted Internet of Things (IoT) network is enhanced using the proposed advanced encryption credibility approach (Ad‐En credibility approach), which ensures the privacy and security of the networks by preventing malicious attempts of accessing the data. The proposed Ad‐En credibility approach is performed based on a modified Diffie‐Hellman algorithm that consists of different phases such as the setup phase, entry and identity phase, fog node entry validation phase, and authentication phase. These phases perform different functions and provide strong authentication mechanisms that secure the data with high confidentiality by detecting malicious attempts within a reduced time. The efficiency of the research is proved by measuring the computational time, memory usage, and detection rate. The proposed Ad‐En credibility approach consumed less time of 7 s and memory usage of 8.17 mb with a high detection rate of 85.34%.", "venue": "Concurrency and Computation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-10", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "35"}, "authors": [{"authorId": "2066527010", "name": "Mohammad Luqman"}, {"authorId": "66427307", "name": "Arman Rasool Faridi"}], "citations": [{"paperId": "ca99d18e8e04b67952a1a47be627739720ce4ed8", "title": "TAKM-FC: Two-way Authentication with efficient Key Management in Fog Computing Environments"}]}
