{"paperId": "22be54a496344470e9379761aeed66115d218979", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "TuneTables: Context Optimization for Scalable Prior-Data Fitted Networks", "abstract": "While tabular classification has traditionally relied on from-scratch training, a recent breakthrough called prior-data fitted networks (PFNs) challenges this approach. Similar to large language models, PFNs make use of pretraining and in-context learning to achieve strong performance on new tasks in a single forward pass. However, current PFNs have limitations that prohibit their widespread adoption. Notably, TabPFN achieves very strong performance on small tabular datasets but is not designed to make predictions for datasets of size larger than 1000. In this work, we overcome these limitations and substantially improve the performance of PFNs by developing context optimization techniques for PFNs. Specifically, we propose TuneTables, a novel prompt-tuning strategy that compresses large datasets into a smaller learned context. TuneTables scales TabPFN to be competitive with state-of-the-art tabular classification methods on larger datasets, while having a substantially lower inference time than TabPFN. Furthermore, we show that TuneTables can be used as an interpretability tool and can even be used to mitigate biases by optimizing a fairness objective.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-17", "journal": {"name": "ArXiv", "volume": "abs/2402.11137"}, "authors": [{"authorId": "120557092", "name": "Ben Feuer"}, {"authorId": "9948572", "name": "R. Schirrmeister"}, {"authorId": "1471176143", "name": "Valeriia Cherepanova"}, {"authorId": "2262216898", "name": "Chinmay Hegde"}, {"authorId": "2285681704", "name": "Frank Hutter"}, {"authorId": "2126058635", "name": "Micah Goldblum"}, {"authorId": "2267243275", "name": "Niv Cohen"}, {"authorId": "2087034921", "name": "Colin White"}], "citations": [{"paperId": "23b9f7569077db7cba68d191bbbf0825fc137481", "title": "Interpretable Machine Learning for TabPFN"}]}
