{"paperId": "22c0bea2cea9adfd0f53204ef1e23c5a306fa01a", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Detection and Attribution of Alpine Inland Lake Changes by Using Random Forest Algorithm", "abstract": "The alpine inland lake dynamics have been good indicators of changes in terrestrial hydrological cycles under global climate change. However, the relationship between alpine inland lake and climatic factors remained largely uncertain. This study examines the spatial-temporal change of the fluctuation of the lake by using dense time series Landsat TM/ETM/OLI images to delineate water boundary information based on the Random Forest algorithm and using ICESat (Ice, Cloud and land Elevation Satellite) dataset to monitor changes in variations of water level. Variations of Qinghai Lake (QHL) were analyzed from 1987 to 2020 and the mechanism of these changes was discussed with meteorological data. The results indicated that the QHL fluctuated strongly showing a pattern of shrinkage–expansion over the last three decades. The lake storage significantly decreased by −2.58 × 108 m3·yr−1 (R2 = 0.86, p < 0.01) from 1989 to 2004 and sharply increased (6.92 × 108 m3·yr−1, R2 = 0.92, p < 0.01) after 2004. The relationship between the lake and climate over the last 30 years implies that the decreasing evaporation and increasing precipitation were the major factors affecting the fluctuation of lake storage. Meanwhile, the temporal heterogeneity of the driving mechanism of climate change led to the phased characteristics of lake storage change. In detail, obvious warming led to the shrinkage of the QHL before 2004 through increasing evaporation, while humidifying and accelerating wind stilling dominated the expansion of the QHL after 2004 by increasing precipitation and decreasing evaporation. This paper indicated that the frameworks of multi-source remote sensing and accurate detection of water bodies were required to protect the high-altitude lakes from further climate changes based on the findings of this paper of the QHL recently. The framework presented herein can provide accurate detection and monitoring of water bodies in different locations in the Qinghai-Tibet Plateau, and provide a necessary basis for future political activities and decisions in terms of sustainable water resource management.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-20", "journal": {"name": "Remote. Sens.", "pages": "1144", "volume": "15"}, "authors": [{"authorId": "1847584", "name": "Weisi Guo"}, {"authorId": "30159544", "name": "Xiangnan Ni"}, {"authorId": "2067254219", "name": "Yi Mu"}, {"authorId": "48511247", "name": "Tong Liu"}, {"authorId": "1635783573", "name": "Junzhe Zhang"}], "citations": [{"paperId": "61bc74b3024e041b92308777685638a4e00f0a82", "title": "Spatiotemporal Variations of Global Human-Perceived Heatwave Risks and their Driving Factors Based on Machine Learning"}]}
