{"paperId": "22c42edfa7790410e0b7de065c331abcb11f5fea", "publicationVenue": {"id": "b6c4c4a1-bdf3-4d49-99f5-6f6feded373c", "name": "International Conference on Geoinformatics and Data Analysis", "type": "conference", "alternate_names": ["Int Conf Gas Disch Their Appl", "ICGDA", "International Conference on Gas Discharges and Their Applications", "International Conference Geoinformatics and Data Analysis", "Int Conf Geoinformatics Data Anal"]}, "title": "Spatio-temporal Analysis of Mobile Phone and Social Media Data Across Multiple Disaster Scenarios: An Input to Population Exposure Assessment", "abstract": "Understanding what people need during disasters and how many people are exposed to disasters are critical in effective disaster management especially in urban megacities where high population density poses greater disaster risk. More importantly, analyzing how disaster needs and population vary through time is becoming as critical for modelling population exposure to hazards, which can aid disaster risk estimation and mitigation. Although traditional data collection methods such as remote sensing data are available, it is still a challenge to estimate exposure and analyze dynamic changes in a high temporal resolution. This paper investigates the use of spatio-temporal big data as an input in population exposure assessment across multiple disaster scenarios in Tokyo. Specifically, we demonstrate this through case studies on natural disasters typhoon and earthquake, as well as abnormal scenarios such as heavy snowfall in the city. We utilize geoinformation (e.g., GPS traces) from mobile phone users in Japan, extract trajectory and search query data, and analyze population changes and trends at hourly temporal resolution during disasters. Moreover, we compare the intensity of changes with normal times to delineate extent of exposure. In addition, we collect geo-tagged social media data from Twitter in the same location to analyze hourly trend of tweet volume. By utilizing this method, we are able to get better understanding of the intensity and dynamic trend of the population affected by the disaster at a high temporal resolution (i.e., hourly) which can aid population exposure assessment for disaster risk management.", "venue": "International Conference on Geoinformatics and Data Analysis", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-04-13", "journal": {"name": "Proceedings of the 2023 6th International Conference on Geoinformatics and Data Analysis"}, "authors": [{"authorId": "117492979", "name": "B. J. Detera"}, {"authorId": "2249765974", "name": "Takashi Kanno"}, {"authorId": "2135684477", "name": "Kaya Onda"}, {"authorId": "2239205425", "name": "Kota Tsubouchi"}, {"authorId": "6616007", "name": "A. Kodaka"}, {"authorId": "30739721", "name": "Akihiko Nishino"}, {"authorId": "1710011", "name": "N. Kohtake"}], "citations": []}
