{"paperId": "22d2065efb65f7a6223c879d310afa7d8c01a651", "publicationVenue": null, "title": "The Application of Data Warehouse in Teaching Management in Colleges and Universities", "abstract": "Data warehousing refers to the process of organizing data from different sources to support the process of decision making in organizations as well as support data analytics. Data warehousing assimilates and systematizes data from across different departments in an organization to have a single analysis of the full information. This data is then used to make the decisions in an organization. However, data warehousing has been underestimated in education institutions. The reason is that they are non-profits organizations. With the increase in the number of educational institutions coming up, colleges and universities should consider the integration of such data-driven support systems to make better decisions and for more organization in the academic processes especially for those institutions with different branches. The intricacy in managing these institutions requires development on how consistent information can be relayed to the decision-makers of an institution. This paper explains the need for data warehouses in education institutions and how the teaching institutions can implement data warehousing to help in the management of the institutions. The paper also explores and reviews various methods that institutions can use to mine data. Various stages for promoting and actualizing the system have been shown.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-01-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1738"}, "authors": [{"authorId": "47166232", "name": "Xiaobing Yu"}], "citations": [{"paperId": "050e7646a27c40a2d1eb351e6ba5a631db365724", "title": "Design and Implementation of Workshop Virtual Simulation Experiment Platform Based on Digital Twin"}, {"paperId": "e1044dd794193e84a947c4a0a3e6309f57089cdd", "title": "A Novel Multi-Dimensional Analysis Approach to Teaching and Learning Analytics in Higher Education"}, {"paperId": "c18184138185cd21c4133cccb011f325ac1946f1", "title": "Design and Implementation of a Data Warehouse for Managing an Educational Institution"}, {"paperId": "1a19680f5f431d6c5ed6244e08c9647a5170702f", "title": "Development of Star-Schema Model for Lecturer Performance in Research Activities"}, {"paperId": "7eff44fdf4ba1816c474330e3510cd8c1392c562", "title": "Perancangan Data Warehouse dalam Meningkatkan Sistem Pengelolaan Dokumen Digital dan Tugas Akhir Mahasiswa di Perpustakaan Universitas Sriwijaya"}]}
