{"paperId": "22e16a46416fc5b79bdc29e04a0775d76f8a9e20", "publicationVenue": {"id": "1e07c289-2f48-4e53-952a-2774c8173782", "name": "Business Process Management Journal", "type": "journal", "alternate_names": ["Bus Process Manag J"], "issn": "1463-7154", "url": "https://www.emerald.com/insight/publication/issn/1463-7154"}, "title": "A bibliographic study on big data: concepts, trends and challenges", "abstract": "The purpose of paper is twofold. First, it provides a consolidated overview of the existing literature on “big data” and second, it presents the current trends and opens up various future directions for researchers who wish to explore and contribute in this rapidly evolving field.,To achieve the objective of this study, the bibliographic and network techniques of citation and co-citation analysis was adopted. This analysis involved an assessment of 57 articles published over a period of five years (2011-2015) in ten selected journals.,The findings reveal that the number of articles devoted to the study of “big data” has increased rapidly in recent years. Moreover, the study identifies some of the most influential articles of this area. Finally, the paper highlights the new trends and discusses the challenges associated with big data.,This study focusses only on big data concepts, trends, and challenges and excludes research on its analytics. Thus, researchers may explore and extend this area of research.,To the knowledge of the authors, this is the first study to review the literature on big data by using citation and co-citation analysis.", "venue": "Business Process Management Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-04-28", "journal": {"name": "Bus. Process. Manag. J.", "pages": "555-573", "volume": "23"}, "authors": [{"authorId": "50248574", "name": "Deepa Mishra"}, {"authorId": "39689177", "name": "Zongwei Luo"}, {"authorId": "143966951", "name": "Shan Jiang"}, {"authorId": "1879141", "name": "T. Papadopoulos"}, {"authorId": "2051250", "name": "Rameshwar Dubey"}], "citations": [{"paperId": "159ef1f51e51780c686f5e3da375dfb34da26fb4", "title": "State of the Art and Themes of the Research on Artificial intelligence (AI) Integrated Customer Relationship Management (CRM): Bibliometric Analysis and Topic Modelling"}, {"paperId": "64dfb83219c7d653ee48dde1403158f9e3f2315f", "title": "The Use of UAVs for Morphological Coastal Change Monitoring—A Bibliometric Analysis"}, {"paperId": "dc1edf47cfaccdc1c9a5c32eb26f41c3fedfef76", "title": "Big Data Analytics to Support Open Innovation Strategies in Banks"}, {"paperId": "a44dc77e340413672a7056ecdc06ce9c513e5ba5", "title": "The intersection between knowledge management and organizational learning in tourism and hospitality: A bibliometric analysis"}, {"paperId": "92ed7ea12b2a422279c98070565ec11cf36be3e0", "title": "Analyzing the interaction of the challenges of big data usage in a cloud computing environment"}, {"paperId": "05802c5bc52a84117f251e36d987116cd4b7d093", "title": "Effects of COVID-19 on Residential Planning and Design: A Scientometric Analysis"}, {"paperId": "c515586a66a287b09b15b178bcfd74693734be59", "title": "Bribery Detection Strategy: A Conceptual Model"}, {"paperId": "6880ba0cde4749617f9f019b35f1a73e62428669", "title": "Examining the interplay between artificial intelligence and the agri-food industry"}, {"paperId": "c4730cecd4c44bc5b11f211029722db0ce524fb1", "title": "Drones in agriculture: A review and bibliometric analysis"}, {"paperId": "f4360db4fc327c97416a5f55218da89c820e57e1", "title": "The Interplay between the Internet of Things and agriculture: A bibliometric analysis and research agenda"}, {"paperId": "b624322a357d88a994aad268ad3def6d3a9a31f0", "title": "Big Data Major Security Issues"}, {"paperId": "74655abfcde813eb32cc77b74b622ba3222fc3da", "title": "Effect of COVID-19 on agricultural production and food security: A scientometric analysis"}, {"paperId": "cb94343858b95df2cee34f6eda719ae6588c01f5", "title": "A qualitative study of improving the operations strategy of logistics using radio frequency identification"}, {"paperId": "ee943b840a8f8eb4b0c4e47ff55b8cc6e31756b7", "title": "Intellectual structure of cybersecurity research in enterprise information systems"}, {"paperId": "2830caf1500f94e2516d4871f66e7048bfcfffe1", "title": "Wireless Sensor Networks in Agriculture: Insights from Bibliometric Analysis"}, {"paperId": "975e28806752336fa57ec5a3e7c6376de8549187", "title": "Blockchain technology in the smart city: a bibliometric review"}, {"paperId": "d1374f00a421c7bcc15c2dbdcf4fb9b51c564c47", "title": "The emergent role of digital technologies in the context of humanitarian supply chains: a systematic literature review"}, {"paperId": "7a0b8d54babc9deff5891b090b99cf2e2f89839f", "title": "Accounting And Financial Practice And Research In The Era Of Big Data"}, {"paperId": "692a608d48a5eaef5bd05754d0ba436f8c3e03b8", "title": "Interaction between management control systems and big data analytics: A conceptual framework"}, {"paperId": "f9ccac18408d126daa864996723004b303076b2e", "title": "Big data driven supply chain design and applications for blockchain: An action research using case study approach"}, {"paperId": "e9e7cd50d40dc1f7c8bd9f551005a1bbca4c654d", "title": "Exploring the relationship between supplier development, big data analytics capability, and firm performance"}, {"paperId": "cab2d6b0809bf636a1bd89dc01fdfd17fbae6b85", "title": "Pendeteksian Fraud: Peran Big Data dan Audit Forensik"}, {"paperId": "6260e8c86c4765da4c5e12d907fd987bf6b5ac81", "title": "Towards Understanding and Sustaining Natural Resource Systems through the Systems Perspective: A Systematic Evaluation"}, {"paperId": "73b7f29211fedef36f6319dc78140f6030aed534", "title": "INTEGRAÇÃO DE BIG DATA PARA IMPULSIONAR A ECONOMIA CIRCULAR NO AMBIENTE CONSTRUÍDO"}, {"paperId": "41b664661f644e17d26bab37146c82f58fe6c604", "title": "Big data analytics (BDA) and degree of internationalization: the interplay between governance of BDA infrastructure and BDA capabilities"}, {"paperId": "18384468a9d56eb534b2d570bc7d3f8b895795f4", "title": "Planning and Managing Open Innovative Ecosystems, Data and Government"}, {"paperId": "6d8684917284e4ae3125afd5ab668c1b923a7bfd", "title": "Critical Components of Industry 5.0 Towards a Successful Adoption in the Field of Manufacturing"}, {"paperId": "63380d15aa4d374c572a26527fb119ff1f315113", "title": "Systems Thinking: A Review and Bibliometric Analysis"}, {"paperId": "e3f2929e57ed22bd7938ad425970eef441b12e1d", "title": "Design of technological strategy for Big Data with Hadoop software"}, {"paperId": "eb4faac516819d317f71eee286538435e2a3f1f4", "title": "The big data-business strategy interconnection: a grand challenge for knowledge management. A review and future perspectives"}, {"paperId": "8ddcfd6beeaa182789ff4f0ca0fcf175e6fe2f49", "title": "Procesamiento de big data utilizando el software HADOOP"}, {"paperId": "a817ee10ba3ccfb866be2b581d84e486acb56baa", "title": "Big Data Analytics and Its Applications in Supply Chain Management"}, {"paperId": "fb9bf79cc2089c8003eba33d3d3220a3f46e8efc", "title": "Drivers and Challenges Associated With the Implementation of Big Data Within U.K. Facilities Management Sector: An Exploratory Factor Analysis Approach"}, {"paperId": "b5a6d5680e66b6248e61d24f56b66b9a8090ab16", "title": "Research status in Halal: a review and bibliometric analysis"}, {"paperId": "26e7518b13ea56fd48bff9277679f05ca212acdd", "title": "The research landscape of big data: a bibliometric analysis"}, {"paperId": "445ede46cefad93356d63e5fdc654c17b77bbe3c", "title": "Assessing the Impact of Big Data on Large Organizations’ Strategies"}, {"paperId": "6ad2587e340c2d7e4ceb615097f201d7509b11a6", "title": "Big data adoption: State of the art and research challenges"}, {"paperId": "3a3eae425c61d349bd89cf8617240cb59c85654a", "title": "Analytics-based decision-making for service systems: A qualitative study and agenda for future research"}, {"paperId": "67ba514f06070187c6e18fecfe18293bcf89b3ec", "title": "Organizational Culture Challenges of Adopting Big Data: A Systematic Literature Review"}, {"paperId": "c7e10109fed73e523bf2a78b00e4b657004d41fc", "title": "Big data and dynamic capabilities: a bibliometric analysis and systematic literature review"}, {"paperId": "ca5931b4c08eb96d40c65e1b9f8e4db46bf0585b", "title": "Big data analytics capability in supply chain agility"}, {"paperId": "202c4185c2cd54b1d0365a3841fa5202db7a8a4c", "title": "Internet-of-Things, Data Analytics, and Business Intelligence Technologies Can Assist in Process Management and Process Improvement Efforts in the Fast-Moving Consumer Goods (FMCG) Sector"}, {"paperId": "fbd9a712133690a533089f1b0eddf95c959ef866", "title": "Critical analysis for big data studies in construction: significant gaps in knowledge"}, {"paperId": "28213ebb460cc6e0896c45ce4e05c536a0a9af15", "title": "Dynamic supplier selection and lot-sizing problem considering carbon emissions in a big data environment"}, {"paperId": "b3fe25129485926d27d659bc706dd92d7e299489", "title": "Big data technology: developments in current research and emerging landscape"}, {"paperId": "3501af071cd6f14e020d67728fa7117d79c05afd", "title": "Managing Business Processes in the Age of Digital Transformation: A Literature Review"}, {"paperId": "96618df29e958c48bbe7bfc613e8336a18ada443", "title": "An analysis of the international scientific production on contemporary marketing practices"}, {"paperId": "c93faa4e65a2902ea827fae8c0e123e6803d71a5", "title": "Can Big Data Analytics Enhance Performance Measurement Systems?"}, {"paperId": "2e38eae12273e281a757524f47325f9f98f52ab4", "title": "Big data usage in transient hotel room pricing : deconstructing a black box"}, {"paperId": "8eeebe3487d04dff3d200d8cf139aab2c9ce2f3d", "title": "Artificial Intelligence, Big Data, Strategic Flexibility, Agility, And Organizational Resilience: A Conceptual Framework Based On Existing Literature"}, {"paperId": "383cc2c3ebd14f3710514500a5bbee30d4b19a96", "title": "Ambidextrous organization and agility in big data era: The role of business process management systems"}, {"paperId": "e81277bc2fcbc1f5c01f973415fccd9b27f89c58", "title": "How to turn managers into data-driven decision makers"}, {"paperId": "f11275827f4422cf281d765632ad3df024f1b95f", "title": "Business process management - at the crossroads"}, {"paperId": "c38f7e57452b12adaddcd926d226f2b60f5e16c1", "title": "Unlocking the circular economy through new business models based on large-scale data: An integrative framework and research agenda"}, {"paperId": "131cef9d6caf65a8cf7ad6b771c531c409e8930d", "title": "Big Data and supply chain management: a review and bibliometric analysis"}, {"paperId": "2c726642340beeb311739ec01d72eb70877eea55", "title": "Development trends in e-commerce sector"}, {"paperId": "3e79d26bf4a615f6a413255bcb1e442220a56285", "title": "The Debate on IC, Smart Technologies, and Digitalization"}, {"paperId": "e44b5b8036d979b083074baf128ada374570dbb4", "title": "Big data and natural environment. How does different data support different green strategies?"}, {"paperId": "2c0456a69e11f8b288f5e90e5915bfd60322c8b7", "title": "Drivers and challenges associated with the implementation of big data within U.K. facilities management sector"}, {"paperId": "772e5a63d073e714888662d50a4376dcb93be257", "title": "Drivers and challenges associated with the implementation of big data within U.K. facilities management sector"}, {"paperId": "9ef04395ed2c7158b30727428dfb02ace063d9d1", "title": "From Big Data to Performance: The Importance of Ambidexterity, Agility and BDA Integration in Business Processes—A Theory-Based Framework"}, {"paperId": "f64241865f743c34a1f3c4bf7d4681a8fe20d7da", "title": "Setting the Stage: BDA, Dynamic Capabilities and Ambidexterity, What We Know So Far?"}, {"paperId": "1d2778c1554d1ebbe8ab2c48acb43728e0eb51e4", "title": "The Organizational Challenges of Big Data"}, {"paperId": "a925a1a2f2988823a925a497850eea8d66b16af2", "title": "BIG DATA WITHIN INNOVATION PROCESSES"}]}
