{"paperId": "22f35d5eb50ce365a9623b3c92629cbad81002b0", "publicationVenue": null, "title": "COMPARATIVE ANALYSIS OF REGRESSION ALGORITHMS FOR PREDICTING STUDENTS' OVERALL RATINGS", "abstract": "In the rapidly evolving landscape of education, the integration of Artificial Intelligence (AI) has revolutionized the way we assess students. This research study focuses on the development and evaluation of a modern Machine Learning (ML) model designed to allocate comprehensive ratings to a diverse group of 10 students. The model's objective is to assess students not merely on their academic achievements but also on a holistic scale, taking into account a wide array of parameters, as detailed below.\nVarious factors were systematically analyzed and integrated, including academic performance, extracurricular activities, study routines, and personal attributes, among others. This comprehensive approach seeks to provide a more nuanced and equitable representation of a student's overall capabilities and potential.\nTo determine the most effective ML regression algorithm for predicting these holistic ratings, a rigorous comparative analysis was conducted, evaluating the performance of multiple algorithms. The  study considered factors such as prediction accuracy, model interpretability, and computational efficiency.\nThe findings of this research shed light on which ML regression algorithm best predicts the overall ratings for the students in question, offering insights into the potential for AI-driven holistic assessment in educational settings. By embracing AI technologies, educators and institutions can enhance their understanding of students, ultimately contributing to more tailored and equitable educational experiences. This research carries implications not only for educational practitioners but also for policymakers and technologists seeking to leverage AI for educational improvement.\nThe detailed methodology, results, and practical implications of this study are discussed in the full research paper. It contributes to the ongoing dialogue on the integration of AI in education and its potential to create more inclusive and effective learning environments.", "venue": "Journal of Advance Research in Computer Science &amp; Engineering (ISSN 2456-3552)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-23", "journal": {"name": "Journal of Advance Research in Computer Science &amp; Engineering (ISSN 2456-3552)"}, "authors": [{"authorId": "2261663406", "name": "Muhammad Hamza Khan"}], "citations": []}
