{"paperId": "22fa26194f21a0132a84409975a682d450279284", "publicationVenue": {"id": "d8ec66ab-0083-4a4d-bf44-ce85d2daad69", "name": "Hawaii International Conference on System Sciences", "type": "conference", "alternate_names": ["HICSS", "Hawaii Int Conf Syst Sci"], "url": "http://www.hicss.hawaii.edu/"}, "title": "Let's Get in Touch - Decision Making about Enterprise Architecture Using 3D Visualization in Augmented Reality", "abstract": "Making informed decisions about historically grown and often complex business and Information Technology (IT) landscapes can be particularly difficult. Enterprise Architecture Management (EAM) addresses this issue by enabling stakeholders to base their decisions on relevant information about the organization’s current and future Enterprise Architectures (EAs). However, visualization of EA is often confronted with low usefulness perceptions. Informed by the cognitive fit theory (CFT), we argue that decision-makers benefit from interacting with EA visualizations using Augmented Reality (AR), because it enables a consistent task-related mental representation based on the natural use of decision-makers’ visual-spatial abilities. The goal of this paper is to demonstrate ARs suitability for EA-related decision-making. We follow the design science research (DSR) approach to develop and evaluate an AR head-mounted display (HMD) prototype, using the Microsoft HoloLens. Our results suggest that EA-related decision-making can profit from applying AR, but users find the handling of the HMD device cumbersome.", "venue": "Hawaii International Conference on System Sciences", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-08", "journal": {"pages": "1-10"}, "authors": [{"authorId": "94002875", "name": "Kevin Rehring"}, {"authorId": "93611841", "name": "Malte Greulich"}, {"authorId": "94105647", "name": "Laurenz Bredenfeld"}, {"authorId": "1711375", "name": "F. Ahlemann"}], "citations": [{"paperId": "fe41f417f1e901ad9ae6fe65a3973c151c375663", "title": "A Multimodal Approach to Investigate the Role of Cognitive Workload and User Interfaces in Human-robot Collaboration"}, {"paperId": "8fd0306684133ec709f1fd602791aba0739a3b53", "title": "Effect of Augmented Reality User Interface on Task Performance, Cognitive Load, and Situational Awareness in Human-Robot Collaboration"}, {"paperId": "7762cede4f303b4c26ed681bbcab89e1ae183290", "title": "Virtual Collaboration in Mixed Reality for Enhancing Business Model Innovation"}, {"paperId": "197abb1e8ec153e1f7329e3fda1dc8410f4e01cf", "title": "VR-EAT: Visualization of Enterprise Architecture Tool Diagrams in Virtual Reality"}, {"paperId": "d8a787677cc1beecfb85c1b96af424022c5f68c1", "title": "Evaluating the User Experience of an Augmented Reality Prototype for Enterprise Architecture"}, {"paperId": "44595f50fdceca2b86bee57c6df46ea0c316f40d", "title": "VR-EA: Virtual Reality Visualization of Enterprise Architecture Models with ArchiMate and BPMN"}, {"paperId": "d27d542212c09180a72bcfd652b8aee93cf3a69b", "title": "Challenges in enterprise architecture management: Overview and future research"}, {"paperId": "c40060b24bb86bfec0ea706c24b9fbbd4f189e80", "title": "Business Modeling and Software Design: 10th International Symposium, BMSD 2020, Berlin, Germany, July 6-8, 2020, Proceedings"}, {"paperId": "d008b2734b1a20023e56bc6e183c58abc2ee8b59", "title": "Conceptualizing EA Cities: towards Visualizing Enterprise Architectures as Cities"}, {"paperId": "d9659b63f6a517f1d4ec76c8570812e97db319d5", "title": "2 Related Work 2 . 1 Use of spatial metaphors for Enterprise Architecture"}]}
