{"paperId": "2305af5d6e65112301e8ec9d972dd2b18226e92f", "publicationVenue": {"id": "35061d29-63c1-4735-8973-373a18ed0378", "name": "INGENIO", "type": "journal", "issn": "2588-0829", "url": "https://revistadigital.uce.edu.ec/index.php/INGENIO/about"}, "title": "Análisis de Vulnerabilidades en Equipos de TO de Grado Médico en el Hospital de SOLCA Núcleo de Quito", "abstract": "La importancia de la seguridad de la información que contienen los equipos médicos de un Sistema Hospitalario (SH) es primordial para el seguimiento del estado de salud del paciente. El SH se abastece de equipos cada vez más avanzados tecnológicamente por el alcance de los resultados, los mismos están conectados a la red del SH, si no hay un control adecuado en la administración pueden ser vulnerables ante ataques cibernéticos e impedir el normal funcionamiento de la red hospitalaria y comprometer el historial médico de un paciente, poniendo en riesgo su salud. Nace el interés médico, en poner bajo protección, los equipos OT (tecnología operativa), equipamiento que apoya los procesos industriales y críticos en tiempo real de un SH, para precautelar la información de un paciente. El Hospital Solca Quito, realizará un análisis de vulnerabilidades bajo la herramienta Tenable OT, obteniendo la identificación de los activos, los riesgos y acciones inmediatas, lo que permitirá trabajar de manera segura. \n ", "venue": "INGENIO", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-31", "journal": {"name": "INGENIO"}, "authors": [{"authorId": "2284283360", "name": "Gerardo Cajamarca Méndez"}, {"authorId": "2284287483", "name": "Mario Giovanny Ron Gavi"}, {"authorId": "121662511", "name": "Maria Gabriela Vera"}, {"authorId": "2284287475", "name": "María Karina Alvarado Figueroa"}, {"authorId": "2284288041", "name": "Bryan Alexander Cajamarca Albán"}], "citations": []}
