{"paperId": "2309afd75f6b5d48a2fe779086e7b86f0c31c5c2", "publicationVenue": {"id": "d44a90af-d645-4877-9b98-d89aedc53d99", "name": "Frontiers in Built Environment", "type": "journal", "alternate_names": ["Front Built Environ"], "issn": "2297-3362", "url": "https://www.frontiersin.org/journals/built-environment", "alternate_urls": ["http://journal.frontiersin.org/journal/built-environment"]}, "title": "Impacts of Coastal Infrastructure on Shoreline Response to Major Hurricanes in Southwest Louisiana", "abstract": "The Rockefeller Wildlife Refuge, located along the Chenier Plain in Southwest Louisiana, was the location of the sequential landfall of two major hurricanes in the 2020 hurricane season. To protect the rapidly retreating coastline along the Refuge, a system of breakwaters was constructed, which was partially completed by the 2020 hurricane season. Multi-institutional, multi-disciplinary rapid response deployments of wave gauges, piezometers, geotechnical measurements, vegetation sampling, and drone surveys were conducted before and after Hurricanes Laura and Delta along two transects in the Refuge; one protected by a breakwater system and one which was the natural, unprotected shoreline. Geomorphological changes were similar on both transects after Hurricane Laura, while after Delta there was higher inland sediment deposition on the natural shoreline. Floodwaters drained from the transect with breakwater protection more slowly than the natural shoreline, though topography profiles are similar, indicating a potential dampening or complex hydrodynamic interactions between the sediment—wetland—breakwater system. In addition, observations of a fluidized mud deposit in Rollover Bayou in the Refuge are presented and discussed in context of the maintenance of wetland elevation and stability in the sediment starved Chenier Plain.", "venue": "Frontiers in Built Environment", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-04-27", "journal": {"volume": "8"}, "authors": [{"authorId": "90599344", "name": "J. Cadigan"}, {"authorId": "2144631733", "name": "Jasmine H. Bekkaye"}, {"authorId": "21780612", "name": "N. Jafari"}, {"authorId": "5558702", "name": "Ling Zhu"}, {"authorId": "2137151664", "name": "Ashley R. Booth"}, {"authorId": "47261159", "name": "Q. Chen"}, {"authorId": "2667140", "name": "B. Raubenheimer"}, {"authorId": "2004890362", "name": "B. Harris"}, {"authorId": "1410334482", "name": "Christopher F. O’Connor"}, {"authorId": "31050936", "name": "R. Lane"}, {"authorId": "40414125", "name": "G. Kemp"}, {"authorId": "32024267", "name": "J. Day"}, {"authorId": "47712787", "name": "J. Day"}, {"authorId": "2163566996", "name": "H. O. Ulloa"}], "citations": [{"paperId": "e66b615b1559692cf1d7cdebb8c3ee6aa39d493c", "title": "The Concept of Land Bridge Marshes in the Mississippi River Delta and Implications for Coastal Restoration"}, {"paperId": "3973c99ddcb5de5ffc98dc7b864109bd34010688", "title": "Beach Profile, Water Level, and Wave Runup Measurements Using a Standalone Line-Scanning, Low-Cost (LLC) LiDAR System"}, {"paperId": "6d6ab9afedc241a95be9bd1df1bd495c8a5fb7b4", "title": "A REVIEW OF ISSUES RELATED TO FORMATION, DETERIORATION AND RESTORATION OF THE CHENIER PLAIN, MISSISSIPPI RIVER DELTA, LA - COMBINING NATURE BASED AND ENGINEERED APPROACHES"}, {"paperId": "62df2657a1c4a45168badfc7ce86a610fce42fb9", "title": "Near‐continuous monitoring of a coastal salt marsh margin: Implications for predicting marsh edge erosion"}]}
