{"paperId": "230e4d3449027dc762ebdb608f4877df75854a0f", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Prognostics and Health Management of Rotating Machinery of Industrial Robot with Deep Learning Applications—A Review", "abstract": "The availability of computational power in the domain of Prognostics and Health Management (PHM) with deep learning (DL) applications has attracted researchers worldwide. Industrial robots are the prime mover of modern industry. Industrial robots comprise multiple forms of rotating machinery, like servo motors and numerous gears. Thus, the PHM of the rotating components of industrial robots is crucial to minimize the downtime in the industries. In recent times, deep learning has proved its mettle in different areas, like bio-medical, image recognition, speech recognition, and many more. PHM with DL applications is a rapidly growing field. It has helped achieve a better understanding of the different condition monitoring signals, like vibration, current, temperature, acoustic emission, partial discharge, and pressure. Most current review articles are component- (or system-)specific and have not been updated to reflect the new deep learning approaches. Also, a unified review paper for PHM strategies for industrial robots and their rotating machinery with DL applications has not previously been presented. This paper presents a review of the PHM strategies with various DL algorithms for industrial robots and rotating machinery, along with brief theoretical aspects of the algorithms. This paper presents a trend of the up-to-date advancements in PHM approaches using DL algorithms. Also, the restrictions and challenges associated with the available PHM approaches are discussed, paving the way for future studies.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-06", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2118921554", "name": "Prashant Kumar"}, {"authorId": "46907823", "name": "Salman Khalid"}, {"authorId": "2154890719", "name": "H. Kim"}], "citations": [{"paperId": "f0173f7051a2f1f21df77a2c7c998e16cb147040", "title": "DeepMachining: Online Prediction of Machining Errors of Lathe Machines"}, {"paperId": "1e3855343f13ae40613dc3b52269afc794e58ee4", "title": "Non-invasive vibration analysis with RDWT, UWB radar, and software PLL for open-phase and multiple bearing faults diagnosis in BLDC motor"}, {"paperId": "98c65214cc7c6272c123538a55c72867c4b32657", "title": "Review on Fault Diagnosis and Fault-Tolerant Control Scheme for Robotic Manipulators: Recent Advances in AI, Machine Learning, and Digital Twin"}, {"paperId": "4dc31f0b578184f26d231fae7e4c5e165868fcc3", "title": "Time to failure prediction of rotating machinery using dynamic feature extraction and gaussian process regression"}, {"paperId": "cd6402234500f37286e52811dbdbfb87b557a437", "title": "Large Scale Foundation Models for Intelligent Manufacturing Applications: A Survey"}, {"paperId": "e563ac903e7bc7b5f5aa65ec8acf32613e125c47", "title": "Time Series Prediction in Industry 4.0: A Comprehensive Review and Prospects for Future Advancements"}, {"paperId": "160c746040c6b5f94ea312a501f19bea3df88115", "title": "Robust Control Approaches and Trajectory Planning Strategies for Industrial Robotic Manipulators in the Era of Industry 4.0: A Comprehensive Review"}, {"paperId": "324fac3859c12ffb1e519c76dca0117e03d3fc67", "title": "A Comprehensive Review of Emerging Trends in Aircraft Structural Prognostics and Health Management"}, {"paperId": "c0f2bd3bb083d7fe02e0325acfac5bf7b91c1c7c", "title": "Corn Harvester Bearing Fault Diagnosis Based on ABC-VMD and Optimized EfficientNet"}]}
