{"paperId": "231abab7bc800d4b2f81f91a36628ae1ee5f829d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Efficient Dynamic Graph Representation Learning at Scale", "abstract": "Dynamic graphs with ordered sequences of events between nodes are prevalent in real-world industrial applications such as e-commerce and social platforms. However, representation learning for dynamic graphs has posed great computational challenges due to the time and structure dependency and irregular nature of the data, preventing such models from being deployed to real-world applications. To tackle this challenge, we propose an efficient algorithm, Efficient Dynamic Graph lEarning (EDGE), which selectively expresses certain temporal dependency via training loss to improve the parallelism in computations. We show that EDGE can scale to dynamic graphs with millions of nodes and hundreds of millions of temporal events and achieve new state-of-the-art (SOTA) performance.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "ArXiv", "volume": "abs/2112.07768"}, "authors": [{"authorId": "66273798", "name": "Xinshi Chen"}, {"authorId": "2153097549", "name": "Yan Zhu"}, {"authorId": "46485716", "name": "Haowen Xu"}, {"authorId": "2152975015", "name": "Mengya Liu"}, {"authorId": "2068237657", "name": "Liang Xiong"}, {"authorId": "1390814008", "name": "Muhan Zhang"}, {"authorId": "1779453", "name": "Le Song"}], "citations": [{"paperId": "cbe72081bfaa76cb0a6c3a2802a1edf3cc128b6e", "title": "iLoRE: Dynamic Graph Representation with Instant Long-term Modeling and Re-occurrence Preservation"}, {"paperId": "38ae2071e0bbaa16d61ea007d438cc24a8a11160", "title": "SPEED: Streaming Partition and Parallel Acceleration for Temporal Interaction Graph Embedding"}, {"paperId": "692955986d8aa4e5b2ccc82e6a4a100ab4cf932a", "title": "DistTGL: Distributed Memory-Based Temporal Graph Neural Network Training"}, {"paperId": "58a2baecdc4e4b3f16d1899c0f1080cefe73013a", "title": "Learning Dynamic Graph Embeddings with Neural Controlled Differential Equations"}, {"paperId": "cc580e280b1d36de9db496dcadde04b4fd6b7f88", "title": "TIGER: Temporal Interaction Graph Embedding with Restarts"}]}
