{"paperId": "2327c450809f00277d785e310cd22755e1fece9b", "publicationVenue": {"id": "a42e1ed3-5238-489f-8d4a-654377764896", "name": "Sakarya University Journal of Education", "type": "journal", "alternate_names": ["Sakarya Üniversitesi Eğitim Fakültesi dergisi", "Sak Üniversitesi Eğitim Fakültesi derg", "Sak Univ J Educ"], "issn": "2146-7455", "alternate_issns": ["1303-0310"], "url": "http://suje.sakarya.edu.tr/index", "alternate_urls": ["http://dergipark.ulakbim.gov.tr/sakaefd"]}, "title": "Research Trends and Features of Robotics Studies in Educational Technology and STEM Education: Data Mining on ERIC Samples", "abstract": "In the research, publications in ERIC about Robotics, Educational Technology in Robotics (ET-in-Robotics), and STEM in Robotics (STEM-in-Robotics) have been reached through data mining, their release year, titles, abstracts, and ERIC descriptions have been analyzed. However, it has been aimed to put forward their research trends and features. The analysis of the 1339 publications that were published between 01/01/1973 and 31/12/2021 and available in ERIC has been made using several Python libraries and presented in the form of tables and word clouds. The results showed that the number of publications available in ERIC was the highest between 2017 and 2021 and in the last five years the number of publications available on Robotics in ERIC has gradually increased. In addition, it has been seen that the words \"learning\", \"robotics\", and \"technology\" are important for all three topics, the words “child”, \"science\", “programming” and \"teacher\" for ET-in-Robotics, and the words \"school\" and \"engineering\" for STEM-in-Robotics come to the fore. Also, the most frequently assigned descriptor by ERIC staff to these publications have been found to be \"teaching methods\". When evaluated in general, it has been seen in the STEM-in-Robotics field more specific topics were focused on and robotic activities are taken as a type of instructional technology while in the ET-in-Robotics field robotic activities were taken as a type of educational technology. As a result, a publication that will serve as a guide for new researches in the field of robotics has been presented.", "venue": "Sakarya University Journal of Education", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-15", "journal": {"name": "Sakarya University Journal of Education"}, "authors": [{"authorId": "71536319", "name": "Emre Çam"}], "citations": []}
