{"paperId": "232be7f0e591d30dfa081e2800ff8728636660a2", "publicationVenue": {"id": "4a8bbf74-8b02-49b1-ad58-836790bbc79f", "name": "International Conference on Enterprise Information Systems", "type": "conference", "alternate_names": ["ICEIS", "Int Conf Enterp Inf Syst"], "url": "http://www.iceis.org/"}, "title": "Assessing the Lakehouse: Analysis, Requirements and Definition", "abstract": ": The digital transformation opens new opportunities for enterprises to optimize their business processes by applying data-driven analysis techniques. For storing and organizing the required huge amounts of data, different types of data platforms have been employed in the past, with data warehouses and data lakes being the most prominent ones. Since they possess rather contrary characteristics and address different types of analytics, companies typically utilize both of them, leading to complex architectures with replicated data and slow analytical processes. To counter these issues, vendors have recently been making efforts to break the boundaries and to combine features of both worlds into integrated data platforms. Such systems are commonly called lakehouses and promise to simplify enterprise analytics architectures by serving all kinds of analytical workloads from a single platform. However, it remains unclear how lakehouses can be characterized, since existing definitions focus almost arbitrarily on individual architectural or functional aspects and are often driven by marketing. In this paper, we assess prevalent definitions for lakehouses and finally propose a new definition, from which several technical requirements for lakehouses are derived. We apply these requirements to several popular data management tools, such as Delta Lake, Snowflake and Dremio in order to evaluate whether they enable the construction of lakehouses.", "venue": "International Conference on Enterprise Information Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "44-56"}, "authors": [{"authorId": "1399038645", "name": "Jan Schneider-Barnes"}, {"authorId": "39290791", "name": "Christoph Gröger"}, {"authorId": "2215561083", "name": "Arnold Lutsch"}, {"authorId": "35089933", "name": "H. Schwarz"}, {"authorId": "1682415", "name": "B. Mitschang"}], "citations": []}
