{"paperId": "232ee163d65526aa27a970aa0941cc0b4f28d211", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "Metaheuristic Algorithms in UAV Path-Planning Optimization: A Systematic Review (2018–2022)", "abstract": "Unmanned Aerial Vehicles (UAVs), a subset of aerial robots, play crucial roles in various domains, such as disaster management, agriculture, and healthcare. Their application proves invaluable in situations where human intervention poses risks or involves high costs. However, traditional approaches to UAV path planning struggle in efficiently navigating complex and dynamic environments, often resulting in suboptimal routes and extended mission durations. This study seeks to investigate and improve the utilization of meta-heuristic algorithms for optimizing UAV path planning. Toward this aim, we carried out a systematic review of five major databases focusing on the period from 2018 to 2022. Following a rigorous two-stage screening process and a thorough quality appraisal, we selected 68 papers out of the initial 1500 to answer our research questions. Our findings reveal that hybrid algorithms are the dominant choice, surpassing evolutionary, physics-based, and swarm-based algorithms, indicating their superior performance and adaptability. Notably, time optimization takes precedence in mathematical models, reflecting the emphasis on CPU time efficiency. The prevalence of dynamic environmental types underscores the importance of real-time considerations in UAV path planning, with three-dimensional (3D) models receiving the most attention for accuracy in complex trajectories. Additionally, we highlight the trends and focuses of the UAV path-planning optimization research community and several challenges in using metaheuristic algorithms for the optimization of UAV path planning. Finally, our analysis further highlights a dual focus in UAV research, with a significant interest in optimizing single-UAV operations and a growing recognition of the challenges and potential synergies in multi-UAV systems, alongside a prevalent emphasis on single-target mission scenarios, but with a notable subset exploring the complexities of multi-target missions.", "venue": "Drones", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-25", "journal": {"name": "Drones"}, "authors": [{"authorId": "9069046", "name": "Maral Hooshyar"}, {"authorId": "2143516095", "name": "Yueh-Min Huang"}], "citations": []}
