{"paperId": "23337fe6bf7e0f137bf781eea6f0ebd748724a30", "publicationVenue": {"id": "5cc5c2ff-6f8d-4f83-9524-37fb8ea37941", "name": "Multimodal Technologies and Interaction", "alternate_names": ["Multimodal Technol Interact"], "issn": "2414-4088", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-994038", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-994038", "https://www.mdpi.com/journal/mti"]}, "title": "A Decision-Support System to Analyse Customer Satisfaction Applied to a Tourism Transport Service", "abstract": "Due to the perishable nature of tourist products, which impacts supply and demand, the possibility of analysing the relationship between customers’ satisfaction and service quality can contribute to increased revenues. Machine learning techniques allow the analysis of how these services can be improved or developed and how to reach new markets, and look for the emergence of ideas to innovate and improve interaction with the customer. This paper presents a decision-support system for analysing consumer satisfaction, based on consumer feedback from the customer’s experience when transported by a transfer company, in the present case working in the Algarve region, Portugal. The results show how tourists perceive the service and which factors influence their level of satisfaction and sentiment. One of the results revealed that the first impression associated with good news is what creates the most value in the experience, i.e., “first impressions matter”.", "venue": "Multimodal Technologies and Interaction", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-31", "journal": {"name": "Multimodal Technol. Interact.", "pages": "5", "volume": "7"}, "authors": [{"authorId": "34828818", "name": "C. Ramos"}, {"authorId": "34268422", "name": "P. Cardoso"}, {"authorId": "146885136", "name": "Hortênsio C. L. Fernandes"}, {"authorId": "143955056", "name": "J. Rodrigues"}], "citations": [{"paperId": "1b905d9f896b1162fc28ac7bb781084f4b104f91", "title": "Leveraging Transformer-based Language Models for Enhanced Service Insight in Tourism"}, {"paperId": "cc11f5d3d017e8af94a85bef3b7baa30f40c1ad3", "title": "Analyzing online public opinion on Thailand-China high-speed train and Laos-China railway mega-projects using advanced machine learning for sentiment analysis"}, {"paperId": "2d9d2b6f252be02b73e23d8db055c59bf66963d6", "title": "Analysis of the Coordination Effects and Influencing Factors of Transportation and Tourism Development in Shaanxi Region"}, {"paperId": "665224f7489ff074acc44ead240eba6a2e5355b9", "title": "The effect of customer satisfaction on floral product purchase behavior, evidence from Shanghai, China"}, {"paperId": "a43435eae8451b628e25c2edafa9fb0ec7f724cb", "title": "Harnessing customized AI to create voice of customer via GPT3.5"}]}
