{"paperId": "2333a9280a8b2621e981b74644207a4b62c3ec16", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Low-Cost Vision-Based Monitoring of Computer Numerical Control (CNC) Machine Tools for Small and Medium-Sized Enterprises (SMEs)", "abstract": "In the new era of manufacturing with the Fourth Industrial Revolution, the smart factory is getting much attention as a solution for the factory of the future. Despite challenges in small and medium-sized enterprises (SMEs), such as short-term strategies and labor-intensive with limited resources, they have to improve productivity and stay competitive by adopting smart factory technologies. This study presents a novel monitoring approach for SMEs, KEM (keep an eye on your machine), and using a low-cost vision, such as a webcam and open-source technologies. Mainly, this idea focuses on collecting and processing operational data using cheaper and easy-to-use components. A prototype was tested with the typical 3-axis computer numerical control (CNC) milling machine. From the evaluation, availability of using a low-cost webcam and open-source technologies for monitoring of machine tools was confirmed. The results revealed that the proposed system is easy to integrate and can be conveniently applied to legacy machine tools on the shop floor without a significant change of equipment and cost barrier, which is less than $500 USD. These benefits could lead to a change of monitoring operations to reduce time in operation, energy consumption, and environmental impact for the sustainable production of SMEs.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "2277348", "name": "Hyungjung Kim"}, {"authorId": "91613242", "name": "Woo-Kyun Jung"}, {"authorId": "2069346515", "name": "Ingyu Choi"}, {"authorId": "6578920", "name": "Sung-hoon Ahn"}], "citations": [{"paperId": "901bd0de96762322eb10731b504fb3bb3cca14a8", "title": "Investigation of artificial intelligence in SMEs: a systematic review of the state of the art and the main implementation challenges"}, {"paperId": "8d479f4b3dc0387f7d7c125ffe6914500ec69daf", "title": "A reduced-order machine-learning-based method for fault recognition in Tool Condition Monitoring"}, {"paperId": "a6f3c4d6facf9cf7a665bb7580f470a2946efb59", "title": "Comprehensive approach toward IIoT based condition monitoring of machining processes"}, {"paperId": "b57edc6ae49162cd0eef0f42c0af4cf37d5a0980", "title": "Exploring the effectiveness of using a smartphone for position-oriented process monitoring"}, {"paperId": "0405f3d85bd0a52de3281cca77925478abc4fee0", "title": "Open-source Software for Developing Appropriate Smart Manufacturing Technology for Small and Medium-sized Enterprises (SMEs)"}, {"paperId": "947ecb61df3dc05cf99e2f0830aa7018ead73e4f", "title": "Machine Learning and IoT-based Approach for Tool Condition Monitoring: A Review and Future Prospects"}, {"paperId": "964028e27b612958b2fd7a2073dfd9e2a33ae09f", "title": "Computer Numerical Control (CNC) Technology For Duplicing Signatures Using Microcontroller Arduino"}, {"paperId": "676d143b70d111c2266d9ef7f6694f97545631ac", "title": "Industry 4.0 and micro and small enterprises: systematic literature review and analysis"}, {"paperId": "143feeebaa9cfa88721b54362a8ffa8b0c9f0dd6", "title": "Design of an Affordable Cross-Platform Monitoring Application Based on a Website Creation Tool and Its Implementation on a CNC Lathe Machine"}, {"paperId": "14831c7a4540f7724bcc02e71e429c11621b0637", "title": "Understanding how digital transformation can enable SMEs to achieve sustainable development: A systematic literature review"}, {"paperId": "455609fac921dd33c9b9f1d670a0122171173627", "title": "Open Source IIoT Solution for Gas Waste Monitoring in Smart Factory"}, {"paperId": "1d82c682d3926c08c4e8d78151324a997691c665", "title": "Cutting temperature measurement and prediction in machining processes: comprehensive review and future perspectives"}, {"paperId": "4c2d99deea35e42495940210cba0c4ad17f1dcb7", "title": "Broken stitch detection method for sewing operation using CNN feature map and image-processing techniques"}, {"paperId": "a0557493995b583db6e3c2792373d5c95b33aa21", "title": "Effect of feed rate and depth of cut on face milling process on surface roughness of Al-Mg alloy using CNC milling machine 3 axis"}, {"paperId": "a35a835efe92fa2534837bcab333a262094d8bc3", "title": "IoT-enabled computer vision-based parts inspection system for SME 4.0"}, {"paperId": "f577b4350c7bb17e12052ba421350cb2935f5f9a", "title": "FAULT DIAGNOSIS OF COMPUTER NUMERICAL CONTROL (CNC) MACHINE USING CLOUD KNOWLEDGE BASE AND MONITORING SYSTEM"}, {"paperId": "dd9d87b54573fa14ca6e37b03f8d56fda8dd2b22", "title": "A novel JavaScript MEAN stack approach for real-time nonconformity management in SMEs within Industry 4.0 and Quality 4.0 concepts"}, {"paperId": "f3c9f29cf3e3dc74216736d572cd5380529d481d", "title": "Enabling servitization by retrofitting legacy equipment for Industry 4.0 applications: benefits and barriers for OEMs"}, {"paperId": "60a6e2da63bb618d3fbc72343079f440bf5b0dbb", "title": "Appropriate Smart Factory for SMEs: Concept, Application and Perspective"}, {"paperId": "96c31381d7cf685bc338846e0c9afd0839357b4e", "title": "Computer Vision Based Intelligent 3D CNC Machines"}, {"paperId": "fb19d7764ee98f4daacdf61f27bfb15df8f44466", "title": "Image-based failure detection for material extrusion process using a convolutional neural network"}, {"paperId": "07086317e9634689384131b8966304868ecf7d80", "title": "Computer Vision Tool-Setting System of Numerical Control Machine Tool"}, {"paperId": "1b069b81039802e0cd7351bdd62503914f6daddb", "title": "Non-Invasive Estimation of Machining Parameters during End-Milling Operations Based on Acoustic Emission"}, {"paperId": "2a08f49692a28e06be81d01a659f2b1d48655333", "title": "PROGRAM CONTOUR RAMP DAN POCKET STANDART PADA PROSES PEMBUATAN PRODUK BOTTOM CARRIER MENGGUNAKAN MESIN CNC MILLING RETROFIT PU 3A"}, {"paperId": "2ef7141cb9fd6a49e2ab77b36358885a213709b9", "title": "The Analysis of Key Technologies for Sustainable Machine Tools Design"}, {"paperId": "d1c546860ab614010e5e9ce679e965e16b8a7593", "title": "Hand-Monitoring System Using CutMix-Based Synthetic Augmentation for Safety in Factories"}, {"paperId": "455e27a5fd23d55078a84efd20efcef693114ee9", "title": "Study of Different Additive Manufacturing Processes and Emergent Applications in Modern Healthcare"}, {"paperId": "9f710eb6c56117b4f455a5ba6ac06d8f1b1c0e01", "title": "Reliable Deep Learning and IoT-Based Monitoring System for Secure Computer Numerical Control Machines Against Cyber-Attacks With Experimental Verification"}, {"paperId": "8f5a13e658c0eb6333a1c6433c4a7940da8c178b", "title": "Sound-based remote real-time multi-device operational monitoring system using a Convolutional Neural Network (CNN)"}, {"paperId": "39a350a9f1455de6ba2038079a572c7256dfa1fd", "title": "Low-Cost Precision Monitoring System of Machine Tools for SMEs"}, {"paperId": "a9ef175caf475f3b9b90b0bcebc9be8af10f8a3d", "title": "A Mobile Production Monitoring System Based on Internet of Thing (IoT) and Random Forest Classification"}, {"paperId": "f8e770f8e0505bf577164f7f52f32294d9bcf6d0", "title": "Retrofitting of legacy machines in the context of Industrial Internet of Things (IIoT)"}, {"paperId": "11fd6c38d928181d78d99b57655eeab2b970644e", "title": "Design and Implementation of OCR-based Machine Monitoring System for Small and Medium-Sized Enterprise (SMEs)"}, {"paperId": "c4acde358256652956538c52d747b95b95b327a7", "title": "FPGA AND MACHINING PROCESS - A REVIEW ON PERFORMANCE AND APPLICATIONS"}]}
