{"paperId": "2339e49c04aa2b5d2651439542687ebcc4549b80", "publicationVenue": {"id": "d004c406-1bed-49fd-a0b1-e46b928f0754", "name": "Symposium on Architectures for Networking and Communications Systems", "type": "conference", "alternate_names": ["Symp Archit Netw Commun Syst", "Architectures for Networking and Communications Systems", "ANCS", "Archit Netw Commun Syst"], "url": "http://www.wikicfp.com/cfp/program?id=171"}, "title": "ExRec: Experimental Framework for Reconfigurable Networks Based on Off-the-Shelf Hardware", "abstract": "In order to meet the increasingly stringent throughput and latency requirements in datacenter networks, several innovative network architectures based on reconfigurable optical topologies have been proposed. Examples include demand-oblivious reconfigurable topologies such as RotorNet (SIGCOMM 2017), Opera (NSDI 2020), and Sirius (SIGCOMM 2021), as well as demand-aware topologies such as ProjecToR (SIGCOMM 2016). All these architectures feature attractive performance properties using specific prototypes. However, reproducing these experiments is often difficult due to missing hardware and publicly available software. This paper presents a flexible framework for reconfigurable networks based on off-the-shelf hardware, which supports experimentation and reproducibility at a small scale. We describe how our framework, ExReC, can be instantiated with different configurations, allowing us to emulate existing architectures and to study their trade-offs. Finally, we demonstrate the application of our approach to different use cases and workloads, including distributed machine learning training.", "venue": "Symposium on Architectures for Networking and Communications Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-12-13", "journal": {"name": "Proceedings of the Symposium on Architectures for Networking and Communications Systems"}, "authors": [{"authorId": "66850064", "name": "Johannes Zerwas"}, {"authorId": "145707494", "name": "C. Avin"}, {"authorId": "144594844", "name": "S. Schmid"}, {"authorId": "3028298", "name": "Andreas Blenk"}], "citations": [{"paperId": "e0e3e3ae2279c6aeb65cd9ba1ef66bce25c02016", "title": "OpticNet: Self-Adjusting Networks for ToR-Matching-ToR Optical Switching Architectures"}, {"paperId": "edee7ee8a262a44591d643edb31e8c0bcabb866b", "title": "Chopin: Combining Distributed and Centralized Schedulers for Self-Adjusting Datacenter Networks"}, {"paperId": "31e7de7d3d728ac74b55ebecbe26871c82942950", "title": "CBNet: Demand-aware tree topologies for Reconfigurable Datacenter Networks"}, {"paperId": "46335c7ffada9814149d262210d97ac7c75d7412", "title": "On Efficient Oblivious Wavelength Assignments for Programmable Wide-Area Topologies"}]}
