{"paperId": "233f29a1787a222a2e06d5e4b22df36918c82da9", "publicationVenue": {"id": "3a9e0ec4-25fc-4a07-8b5c-b1500b7babaa", "name": "International Test Conference", "type": "conference", "alternate_names": ["ITC", "Conf Information-theoretic Cryptogr", "Conference on Information-Theoretic Cryptography", "Int Teletraffic Congr", "International Teletraffic Congress", "Int Test Conf"], "url": "http://www.itctestweek.org/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=1778", "https://itcrypto.github.io/"]}, "title": "Highly reliable and low-cost symbiotic IOT devices and systems", "abstract": "IOT has seen countless potential applications that can improve our lives dramatically, but after years of efforts by numerous companies and organizations, the beautiful dreams are yet to be realized. The main obstacles are cost and energy consumption constraints of the devices and systems, which still cannot be contained. As a step forward in improving the reliability and reducing the cost and energy consumption of IOT devices and systems, at ITC-Asia17 we proposed a high-level model for efficient design-space exploration, which is called the symbiotic system (SS) model. Based on that, we also proposed a quorum-sensing model for SS to improve the reliability of IOT systems that contain subsystems. Preliminary experimental result shows that it is possible for an IOT system to achieve low cost, low energy consumption, and high reliability. In this extended work we discuss more evaluation results, and show that by using quorum-sensing-based peer-repair, up to 97% of the faulty devices can be repaired even when the raw yield is only 30%. It shows that by adopting the proposed approach, there is hope in eliminating production test of symbiotic IOT devices in the future.", "venue": "International Test Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-10-01", "journal": {"name": "2017 IEEE International Test Conference (ITC)", "pages": "1-10"}, "authors": [{"authorId": "1995279", "name": "Bing-Yang Lin"}, {"authorId": "2064627959", "name": "Hsin-Wei Hung"}, {"authorId": "2054658597", "name": "S. Tseng"}, {"authorId": "2157288649", "name": "Chi Chen"}, {"authorId": "152360959", "name": "Cheng-Wen Wu"}], "citations": [{"paperId": "b2bc85c641fa8c838a60037ae3abd93589cf091f", "title": "On the Reliability of Industrial Internet of Things from Systematic Perspectives: Evaluation Approaches, Challenges, and Open Issues"}, {"paperId": "4645394e9ebb6e7b717b0784e0bef3d76d775c65", "title": "Test-Friendly Data-Selectable Self-Gating (DSSG)"}, {"paperId": "acc438cfe1ad9b4e63b9e4c577c22a5857ae5e48", "title": "Covering hard-to-detect defects by thermal quorum sensing"}, {"paperId": "3ce0d277fac4fdfe9052f24c85515b988719fef7", "title": "Symbiotic Controller Design Using a Memory-Based FSM Model"}]}
