{"paperId": "234ba3a287178ddce5af915d5c16950d3e0a4064", "publicationVenue": null, "title": "Translation of Array-Based Loops to Spark SQL", "abstract": "Many programs written to analyze data are expressed in terms of array operations in an imperative programming language with loops. However, for data analysts who need to analyze vast volumes of data, large-scale data-intensive processing is becoming a necessity. Hence, they want to convert their programs, originally written to run on a single computer, to work on current Big Data systems, such as Map-Reduce and Spark, so that they can process larger amounts of data. We present a novel framework, called SQLgen, that automatically translates imperative programs with loops and array operations to distributed data-parallel programs. Unlike related work, SQL- gen translates these programs to SQL, which can be translated to more efficient code since it can be optimized using a relational database optimizer. SQLgen has been implemented on Spark SQL. We compare the performance of SQLgen with DIABLO, hand-written RDD-based, and Spark SQL programs on real- world problems. SQLgen is up to 78× faster than DIABLO and up to 25× faster than hand-written RDD-based programs, giving performance close to that of hand-written programs in Spark SQL.", "venue": "2020 IEEE International Conference on Big Data (Big Data)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 IEEE International Conference on Big Data (Big Data)", "pages": "469-476"}, "authors": [{"authorId": "51295778", "name": "Md Hasanuzzaman Noor"}, {"authorId": "1746298", "name": "L. Fegaras"}], "citations": [{"paperId": "11b4cda8d6aa5ec48cf99c86ef217d5de9b2a169", "title": "Automated Translation of Functional Big Data Queries to SQL"}, {"paperId": "3edc26f2de5389b0ad480f0755191687090337c1", "title": "Translation of Array-Based Graph Programs to Spark SQL on Block Arrays"}, {"paperId": "837b12785477d1b00e7ec98256bea1fe2375cb9a", "title": "Translation of Array-based Loop Programs to Optimized SQL-based Distributed Programs"}]}
