{"paperId": "2358912c6d2d9d4db3c79dd79dc059cdc33194fe", "publicationVenue": {"id": "8a339d82-a3aa-4421-8fb4-94effc07509f", "name": "Journal of Information and Technology", "type": "journal", "alternate_names": ["Journal of Information Technology", "Journal of information and technology", "Journal of information technologies", "J inf technol", "J Inf Technol"], "issn": "2775-2720", "alternate_issns": ["2656-7539", "0268-3962", "2617-3573", "2774-4884", "2775-6734", "2527-9467", "1337-7469"], "url": "https://jurnal.stmik-amikbandung.ac.id/", "alternate_urls": ["http://www.palgrave-journals.com/jit/", "http://web.archive.org/web/*/http:/ki.fpv.ucm.sk/index.php?start=casopis", "https://stratfordjournals.org/journals/index.php/Journal-of-Information-and-Techn/issue/archive", "http://www.palgrave-journals.com/jit/index.html"]}, "title": "Data science in organizations: Conceptualizing its breakthroughs and blind spots", "abstract": "The field of data science emerged in recent years, building on advances in computational statistics, machine learning, artificial intelligence, and big data. Modern organizations are immersed in data and are turning toward data science to address a variety of business problems. While numerous complex problems in science have become solvable through data science, not all scientific solutions are equally applicable to business. Many data-intensive business problems are situated in complex socio-political and behavioral contexts that still elude commonly used scientific methods. To what extent can such problems be addressed through data science? Does data science have any inherent blind spots in this regard? What types of business problems are likely to be addressed by data science in the near future, which will not, and why? We develop a conceptual framework to inform the application of data science in business. The framework draws on an extensive review of data science literature across four domains: data, method, interfaces, and cognition. We draw on Ashby’s Law of Requisite Variety as theoretical principle. We conclude that data-scientific advances across the four domains, in aggregate, could constitute requisite variety for particular types of business problems. This explains why such problems can be fully or only partially addressed, solved, or automated through data science. We distinguish between situations that can be improved due to cross-domain compensatory effects, and problems where data science, at best, only contributes merely to better understanding of complex phenomena.", "venue": "Journal of Information and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-26", "journal": {"name": "Journal of Information Technology", "pages": "154 - 175", "volume": "36"}, "authors": [{"authorId": "3194251", "name": "J. Cybulski"}, {"authorId": "2938528", "name": "Rens Scheepers"}], "citations": [{"paperId": "68207a9ae2a8b41d24dc996729f9b63c325bdb02", "title": "Data Science with Semantic Technologies: Application to Information Systems Development"}, {"paperId": "97fa1f74dc39fdb4231086c150191b1c05699c03", "title": "Adopting Business Intelligence towards Strategic Ambidexterity as Digital Marketing Matters"}, {"paperId": "f4da28ce81bb0a65d0ffdd5db15075d71928a273", "title": "Technology readiness and the organizational journey towards AI adoption: An empirical study"}]}
