{"paperId": "2374dc0dd19043790d2691ed644c1b2c4815eea5", "publicationVenue": null, "title": "Predicting Performance and Cost of Serverless Computing Functions with SAAF", "abstract": "Next generation software built for the cloud recently has embraced serverless computing platforms that use temporary infrastructure to host microservices offering building blocks for resilient, loosely coupled systems that are scalable, easy to manage, and extend. Serverless architectures enable decomposing software into independent components packaged and run using isolated containers or microVMs. This decomposition approach enables application hosting using very fine-grained cloud infrastructure enabling cost savings as deployments are billed granularly for resource use. Adoption of serverless platforms promise reduced hosting costs while achieving high availability, fault tolerance, and dynamic elasticity. These benefits are offset by pricing obfuscation, as performance variance from CPU heterogeneity, multitenancy, and provisioning variation obscure the true cost of hosting applications with serverless platforms. Where determining hosting costs for traditional VM-based application deployments simply involves accounting for the number of VMs and their uptime, predicting hosting costs for serverless applications can be far more complex. To address these challenges, we introduce the Serverless Application Analytics Framework (SAAF), a tool that allows profiling FaaS workload performance, resource utilization, and infrastructure to enable accurate performance predictions. We apply Linux CPU time accounting principles and multiple regression to estimate FaaS function runtime. We predict runtime using a series of increasingly variant compute bound workloads that execute across heterogeneous CPUs, different memory settings, and to alternate FaaS platforms evaluating our approach for 77 different scenarios. We found that the mean absolute percentage error of our runtime predictions for these scenarios was just ~3.49% resulting in an average cost error of $6.46 for 1-million FaaS function workloads averaging $150.45 in price.", "venue": "2020 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "pages": "640-649"}, "authors": [{"authorId": "2023731787", "name": "Robert Cordingly"}, {"authorId": "2052958533", "name": "Wen Shu"}, {"authorId": "152208762", "name": "W. Lloyd"}], "citations": [{"paperId": "89775082b227f85c5ba37d95515301efaa344497", "title": "Demystifying the Cost of Serverless Computing: Towards a Win-Win Deal"}, {"paperId": "2afa8e26f26a3d5fe92fa79d05354cd0ae160b3f", "title": "Enhanced Runtime-Adaptable Routing for Serverless Functions based on Performance and Cost Tradeoffs in Hybrid Cloud Settings"}, {"paperId": "d0e7abadd0273eb6f890faf0cf8ca902e418e872", "title": "Application-Centric Benchmarking of Distributed FaaS Platforms using BeFaaS"}, {"paperId": "4aef67cc481b5ab9592b79db393ea019fbdd5ff7", "title": "Parrotfish: Parametric Regression for Optimizing Serverless Functions"}, {"paperId": "17474dc271ac6c476d5017383d6d88fcd460d89a", "title": "Enabling Serverless Sky Computing"}, {"paperId": "a8850db4d5c8a3c986b740a89681fa6fd7287886", "title": "FireFace: Leveraging Internal Function Features for Configuration of Functions on Serverless Edge Platforms"}, {"paperId": "d214e2afb9c24d817c02e34d1fbaea9fb85c199f", "title": "Simulating FaaS Orchestrations In The Cloud-Edge Continuum"}, {"paperId": "36282cb7c9f41628beb01c74a8f2c60bb58d80fc", "title": "Configuration and Placement of Serverless Applications Using Statistical Learning"}, {"paperId": "6406b7220ea0ba742fc53256d540b402df689cd5", "title": "Towards Sustainable Serverless Processing of Massive Graphs on the Computing Continuum"}, {"paperId": "f5ce3fd9102f3567d0d11d61d6881a13e88b6fc3", "title": "The uphill journey of FaaS in the open-source community"}, {"paperId": "9d7dfb6af2d6f47c1911eafbdd59980840804bd0", "title": "GoDeploy: Portable Deployment of Serverless Functions in Federated FaaS"}, {"paperId": "98bfb90d6a109778baeaae6d4fd1af5dc57269c9", "title": "Function Memory Optimization for Heterogeneous Serverless Platforms with CPU Time Accounting"}, {"paperId": "1188fd9628a8f15a2be680504f802d9a5bf655c8", "title": "Characterizing X86 and ARM Serverless Performance Variation: A Natural Language Processing Case Study"}, {"paperId": "efdb0558940a0c3fe8b4bcd484d862f1d1922443", "title": "FaaSET: A Jupyter Notebook to Streamline Every Facet of Serverless Development"}, {"paperId": "41f7d33326e57b489380667320cddd80ed848ad3", "title": "Resource Scaling Strategies for Open-Source FaaS Platforms compared to Commercial Cloud Offerings"}, {"paperId": "e5617de21e517ac5b6dcb1b041710dbd2c755ffc", "title": "Rise of the Planet of Serverless Computing: A Systematic Review"}, {"paperId": "73f8afac6024526c067d3c994bc364abba58507a", "title": "Let's Trace It: Fine-Grained Serverless Benchmarking using Synchronous and Asynchronous Orchestrated Applications"}, {"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing"}, {"paperId": "13af4cd45a3b131e1430e025fa3c478ccadd9c2f", "title": "ETAS: predictive scheduling of functions on worker nodes of Apache OpenWhisk platform"}, {"paperId": "00568778f9d36071efe9ace6672151d1aef48f78", "title": "Optimizing Cloud Function Configuration via Local Simulations"}, {"paperId": "a78edd48f162cda475d141d20095e7dfb784eebb", "title": "FaaSRank: Learning to Schedule Functions in Serverless Platforms"}, {"paperId": "69763f0075accbd43ca31d2442c7511b866d4449", "title": "A Case Study on the Stability of Performance Tests for Serverless Applications"}, {"paperId": "226c8c7457ed3581ddd7756717f15086ec29f200", "title": "Survey on serverless computing"}, {"paperId": "77b25698414648aea2094b2a3e8564f73ea3ff8b", "title": "A Holistic View on Resource Management in Serverless Computing Environments: Taxonomy and Future Directions"}, {"paperId": "a90007f84cda5c5d6ec7fd7ba87e21a21dacc877", "title": "The Serverless Application Analytics Framework: Enabling Design Trade-off Evaluation for Serverless Software"}, {"paperId": "2e275d5a6bf69dce5e10c10cf146385e5c5d6297", "title": "2020 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)"}, {"paperId": "99c89b36852b039f963ea02c09e1ec7c0e5139f5", "title": "Serverless Computing: A Survey of Opportunities, Challenges, and Applications"}, {"paperId": "3aa0fe9d05af104ec56dd0edc09d716919f7275a", "title": "A Literature Review on Serverless Computing"}, {"paperId": "5b390622535a2eb9fa0ba4a7d9696d1e270bf443", "title": "ONLINE GRAPH BASED LATENCY ESTIMATION OF MICROSERVICE APPLICATIONS IN A FAAS ENVIRONMENT"}]}
