{"paperId": "23771e8f8d1ea2bce3a1df464acef9296520c928", "publicationVenue": {"id": "25248f80-fe99-48e5-9b8e-9baef3b8e23b", "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "type": "journal", "alternate_names": ["IEEE Trans Pattern Anal Mach Intell"], "issn": "0162-8828", "url": "http://www.computer.org/tpami/", "alternate_urls": ["http://www.computer.org/portal/web/tpami", "http://ieeexplore.ieee.org/servlet/opac?punumber=34"]}, "title": "Clickstream Analysis for Crowd-Based Object Segmentation with Confidence", "abstract": "With the rapidly increasing interest in machine learning based solutions for automatic image annotation, the availability of reference annotations for algorithm training is one of the major bottlenecks in the field. Crowdsourcing has evolved as a valuable option for low-cost and large-scale data annotation; however, quality control remains a major issue which needs to be addressed. To our knowledge, we are the first to analyze the  annotation process to improve crowd-sourced image segmentation. Our method involves training a regressor to estimate the quality of a segmentation from the annotator's clickstream data. The quality estimation can be used to identify spam and weight individual annotations by their (estimated) quality when merging multiple segmentations of one image. Using a total of 29,000 crowd annotations performed on publicly available data of different object classes, we show that (1) our method is highly accurate in estimating the segmentation quality based on clickstream data, (2) outperforms state-of-the-art methods for merging multiple annotations. As the regressor does not need to be trained on the object class that it is applied to it can be regarded as a low-cost option for quality control and confidence analysis in the context of crowd-based image annotation.", "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "year": 2016, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-11-25", "journal": {"name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "pages": "2814-2826", "volume": "40"}, "authors": [{"authorId": "39110759", "name": "Eric Heim"}, {"authorId": "1693788", "name": "A. Seitel"}, {"authorId": "3052719", "name": "Jonas Andrulis"}, {"authorId": "7886986", "name": "Fabian Isensee"}, {"authorId": "145201251", "name": "C. Stock"}, {"authorId": "118012992", "name": "T. Ross"}, {"authorId": "1397958668", "name": "L. Maier-Hein"}], "citations": [{"paperId": "9fcae68ecdb3eb07e45b5bbffb5ea800f93e08ba", "title": "Quality Control in Crowdsourcing based on Fine-Grained Behavioral Features"}, {"paperId": "acbfb8592e3b8be92d680730ff9d5f96f6c216e3", "title": "A crowdsourcing semi-automatic image segmentation platform for cell biology"}, {"paperId": "31c98a2d34057546b37a0b7e855ec48e83f1c9be", "title": "Surgical data science – from concepts toward clinical translation"}, {"paperId": "4b8f0447e6a7ce0bea485d86b7fddb81eea72950", "title": "Neuron Linear Transformation: Modeling the Domain Shift for Crowd Counting"}, {"paperId": "88db15e7489dd9999a6dfa3dc7ac66493154729a", "title": "Scalable Variational Gaussian Processes for Crowdsourcing: Glitch Detection in LIGO"}, {"paperId": "369f89d1ed4673cc521560ec476e1c4cd5733e88", "title": "Modern Information Technology for Cancer Research: What’s in IT for Me? An Overview of Technologies and Approaches"}, {"paperId": "131ca3a360f47f38f4598b9ddb8b6060bfe26088", "title": "Inter-observer variability of manual contour delineation of structures in CT"}, {"paperId": "8875aa69cbc11ddd969773b87797e3ef27f48b9c", "title": "Toward a standard ontology of surgical process models"}, {"paperId": "4c3ea9224c9c3b8b7cd8ef7c738c9dac0ec64486", "title": "Exploiting the potential of unlabeled endoscopic video data with self-supervised learning"}, {"paperId": "87ef473e83b7392371ac39293a8cc08b3739a524", "title": "Simplifying E-Commerce Analytics by Discovering Hidden Knowledge in Big Data Clickstreams"}]}
