{"paperId": "237bff7713bc15584d622578bfdd0ec8010065b7", "publicationVenue": {"id": "6c2ef016-936e-4f16-bc1f-a931f0bd59a3", "name": "Datenbanksysteme für Business, Technologie und Web", "type": "conference", "alternate_names": ["BTW Workshops", "Datenbanksysteme Bus Technol Web", "BTW Work", "BTW"], "url": "https://fb-dbis.gi.de/btw-konferenz/vergangene-konferenzen/"}, "title": "FactStack", "abstract": ": Data exchange throughout the supply chain is essential for the agile and adaptive manufacturing processes of Industry 4.0. As companies employ numerous, frequently mutually incompatible data management and preservation approaches, interorganizational data sharing and reuse regularly requires human interaction and is thus associated with high overhead costs. An interoperable system, supporting the unified management, preservation, and exchange of data across organizational boundaries is missing to date. We propose FactStack, a unified approach to data management and preservation based upon a novel combination of existing Web-standards and tightly integrated with the HTTP protocol itself. Based on the FactDAG model, FactStack guides and supports the full data lifecycle in a FAIR and interoperable manner, independent of individual software solutions and backward-compatible with existing resource oriented architectures. We describe our reference implementation of the approach and evaluate its performance, showcasing scalability even to high-throughput applications. We analyze the system’s applicability to industry using a representative real-world use case in aircraft manufacturing based on principal requirements identified in prior work. We conclude that FactStack fulfills all requirements and provides a promising solution for the on-demand integration of persistence and provenance into existing resource-oriented architectures, facilitating data management and preservation for the agile and interorganizational manufacturing processes of Industry 4.0. Through its open-source distribution, it is readily available for adoption by the community, paving the way for improved utility and usability of data management and preservation in digital manufacturing and supply chains.", "venue": "Datenbanksysteme für Business, Technologie und Web", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "371-395"}, "authors": [{"authorId": "31648495", "name": "L. Gleim"}, {"authorId": "2055764501", "name": "Liam Tirpitz"}, {"authorId": "152589583", "name": "S. Decker"}], "citations": [{"paperId": "3d355dee9214c4468a46c4d9f55307b4067ab37a", "title": "FAIR Sensor Ecosystem: Long-Term (Re-)Usability of FAIR Sensor Data through Contextualization"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "f48dea788ea389c873de1c7d90f04c7fb15acac8", "title": "The Road to Accountable and Dependable Manufacturing"}, {"paperId": "bd3bc66034a63d4ee70ab588a878000fbbd200ff", "title": "Evaluation of Architectures for FAIR Data Management in a Research Data Management Use Case"}, {"paperId": "e881d17d46c459390947806a9c84641c8df29429", "title": "Capturing Provenance Information in the File System"}, {"paperId": "e215d43ec86427a608e98032a989be7148383881", "title": "Managing Versioned Web Resources in the File System"}]}
