{"paperId": "237e4c1eb7114546f6aec80b61afef6d3fa91ab6", "publicationVenue": {"id": "3e1de0c6-d8f1-44c4-a3ed-34108c71032c", "name": "Human Technology", "type": "journal", "alternate_names": ["Hum Technol"], "url": "http://humantechnology.jyu.fi/"}, "title": "Process management of ergonomic workplace based on augmented reality principles", "abstract": "Ergonomics is an important element of managing performance and productivity in a company. Nowadays, the ergonomic parameters are set in line with the implementation of the Industry 4.0 concept. The paper highlights the link between virtual reality (VR) and augmented reality (AR), when combined with the traditional ergonomic procedure.  Automation and digitization contribute to a significant extent to the creation of ergonomic workplaces and the elimination of the negative effects of non-ergonomic workplaces on people. The aim of the paper is to determine the essential elements of the system process approach to ergonomics management. This is achieved through an analysis of the current approaches from Industry 4.0 and a focus on the augmented reality approach. The backbone of the triple combination of \"man-machine-environment\" determines the ergonomic setting of work and the workplace. Subsequently, the presented case study examines the link between ergonomic workplace principles and data analytics for VR/AR technology. The scientific contribution of the paper lies in the discussion of the case study results, which is beneficial for the ergonomic design of workplaces.", "venue": "Human Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-30", "journal": {"name": "Human Technology"}, "authors": [{"authorId": "2180087733", "name": "Jan Holoči"}, {"authorId": "98893435", "name": "F. Chromjaková"}], "citations": [{"paperId": "7e094153bf77f69d737cc8ba79c1db1984836c7e", "title": "Social Capital Factors Fostering the Sustainable Competitiveness of Enterprises"}]}
