{"paperId": "23840c90749d4e39ea309e4addb802e5813c63ad", "publicationVenue": null, "title": "Democratizing EHR analyses with FIDDLE: a flexible data-driven preprocessing pipeline for structured clinical data", "abstract": "Abstract Objective In applying machine learning (ML) to electronic health record (EHR) data, many decisions must be made before any ML is applied; such preprocessing requires substantial effort and can be labor-intensive. As the role of ML in health care grows, there is an increasing need for systematic and reproducible preprocessing techniques for EHR data. Thus, we developed FIDDLE (Flexible Data-Driven Pipeline), an open-source framework that streamlines the preprocessing of data extracted from the EHR. Materials and Methods Largely data-driven, FIDDLE systematically transforms structured EHR data into feature vectors, limiting the number of decisions a user must make while incorporating good practices from the literature. To demonstrate its utility and flexibility, we conducted a proof-of-concept experiment in which we applied FIDDLE to 2 publicly available EHR data sets collected from intensive care units: MIMIC-III and the eICU Collaborative Research Database. We trained different ML models to predict 3 clinically important outcomes: in-hospital mortality, acute respiratory failure, and shock. We evaluated models using the area under the receiver operating characteristics curve (AUROC), and compared it to several baselines. Results Across tasks, FIDDLE extracted 2,528 to 7,403 features from MIMIC-III and eICU, respectively. On all tasks, FIDDLE-based models achieved good discriminative performance, with AUROCs of 0.757–0.886, comparable to the performance of MIMIC-Extract, a preprocessing pipeline designed specifically for MIMIC-III. Furthermore, our results showed that FIDDLE is generalizable across different prediction times, ML algorithms, and data sets, while being relatively robust to different settings of user-defined arguments. Conclusions FIDDLE, an open-source preprocessing pipeline, facilitates applying ML to structured EHR data. By accelerating and standardizing labor-intensive preprocessing, FIDDLE can help stimulate progress in building clinically useful ML tools for EHR data.", "venue": "J. Am. Medical Informatics Assoc.", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-11", "journal": {"name": "Journal of the American Medical Informatics Association : JAMIA", "pages": "1921 - 1934", "volume": "27"}, "authors": [{"authorId": "134763925", "name": "Shengpu Tang"}, {"authorId": "1994643576", "name": "Parmida Davarmanesh"}, {"authorId": "1994553630", "name": "Yanmeng Song"}, {"authorId": "2479152", "name": "Danai Koutra"}, {"authorId": "4829952", "name": "M. Sjoding"}, {"authorId": "38556322", "name": "J. Wiens"}], "citations": [{"paperId": "60c1555d37107e113c2753397c0f7cce85961acd", "title": "Longitudinal Counterfactuals: Constraints and Opportunities"}, {"paperId": "6c2067044d0f35456a71912f8b24e27b5b2ab71a", "title": "Recent Advances in Predictive Modeling with Electronic Health Records"}, {"paperId": "1193cb384f80b38bcb89f5b8a56cb75383f3ad33", "title": "Benchmarking with MIMIC-IV, an irregular, spare clinical time series dataset"}, {"paperId": "67eb451d464fefc52012310e0af28c7784f23989", "title": "Automated Fusion of Multimodal Electronic Health Records for Better Medical Predictions"}, {"paperId": "b01605316668cb034e19233cb7ff33c9d035b12b", "title": "Research on Multimodal Fusion of Temporal Electronic Medical Records"}, {"paperId": "625b3c6d9e7a52890e51b1490ab935fc410829d3", "title": "Exploratory electronic health record analysis with ehrapy"}, {"paperId": "8fe24db568ccc379a590eac9dc5183d68b78c1ad", "title": "Quantitative patient graph analysis for transient ischemic attack risk factor distribution based on electronic medical records"}, {"paperId": "5bda9200b6466da0779116385a277be6dbc746f4", "title": "Hierarchical Pretraining on Multimodal Electronic Health Records"}, {"paperId": "5d42ad2077c2d6515a58dc591d663282e311bc0d", "title": "Introducing the BlendedICU dataset, the first harmonized, international intensive care dataset"}, {"paperId": "e286d29b5dfc750aa4b6f007d86312c77f077e5c", "title": "Updating Clinical Risk Stratification Models Using Rank-Based Compatibility: Approaches for Evaluating and Optimizing Clinician-Model Team Performance"}, {"paperId": "233e022abeb9dd1e20f5949be40095ff175c037b", "title": "Predicting adverse outcomes in pregnant patients positive for SARS-CoV-2: a machine learning approach- a retrospective cohort study"}, {"paperId": "3f3a7e71f408565f8588929594135a3730fdb391", "title": "Attention-based multimodal fusion with contrast for robust clinical prediction in the face of missing modalities"}, {"paperId": "2a2de7a13c01a1129fc349945b8d9ac1d85e8fd1", "title": "Prediction of postpartum hemorrhage (PPH) using machine learning algorithms in a Kenyan population"}, {"paperId": "2b6005b7e8cd22052e78b11d3f9a3786eaa15895", "title": "A data-driven framework for clinical decision support applied to pneumonia management"}, {"paperId": "1cf2baa7b60e9c449959d9ce6334148d62305a8d", "title": "Leveraging an Alignment Set in Tackling Instance-Dependent Label Noise"}, {"paperId": "6e715cd0ab4036f757f2e30a7a36108f067fa247", "title": "EHRSHOT: An EHR Benchmark for Few-Shot Evaluation of Foundation Models"}, {"paperId": "369b23931bd5e25423a3f575604f1d570f490806", "title": "Event Stream GPT: A Data Pre-processing and Modeling Library for Generative, Pre-trained Transformers over Continuous-time Sequences of Complex Events"}, {"paperId": "05c06e0599300ef1bede4817a789a63aa0f15d6c", "title": "Data encoding for healthcare data democratization and information leakage prevention"}, {"paperId": "2b34af870f41097d1f809a59c812d0c0d86c704b", "title": "Prediction differences and implications of acute kidney injury with and without urine output criteria in adult critically ill patients"}, {"paperId": "4b3e0523fd4e7db31228b7d9656346f7a53b8707", "title": "timeseriesflattener: A Python package for summarizing features from (medical) time series"}, {"paperId": "a06e8c8b8df3f8d46bfa66ac2e95f7a4f9ee2d39", "title": "Characterizing the limitations of using diagnosis codes in the context of machine learning for healthcare"}, {"paperId": "d3d9021293fd0716466306b4a4ec9dbbd1932886", "title": "Self-Supervised Learning-Based General Laboratory Progress Pretrained Model for Cardiovascular Event Detection"}, {"paperId": "b61ec48b5611fcbe8e46785bb61efbd43e64425a", "title": "A Multidatabase ExTRaction PipEline (METRE) for Facile Cross Validation in Critical Care Research"}, {"paperId": "a18f13f223d8da6c2cce5e86738e24047df4c4e2", "title": "UniMed: Multimodal Multitask Learning for Medical Predictions"}, {"paperId": "f8bfd004ddc043409c3465edb77e38c71e8fd8ff", "title": "The Missing Indicator Method: From Low to High Dimensions"}, {"paperId": "d9ba0e47f160c93a950965c605e18d03020c4270", "title": "Domain Adaptation under Missingness Shift"}, {"paperId": "db70cb3edea82d621f1132e0cc7d6436f83bfcc4", "title": "Cleaning of anthropometric data from PCORnet electronic health records using automated algorithms"}, {"paperId": "c037658e4d5a53a0a4e47596769f1ca8686130b2", "title": "Lifting Hospital Electronic Health Record Data Treasures: Challenges and Opportunities"}, {"paperId": "7f46b8f01afe7a4a45daea869dcd24997b26c402", "title": "A data preparation framework for cleaning electronic health records and assessing cleaning outcomes for secondary analysis"}, {"paperId": "dda118e8154765f73cb8f5e2b1b8daa75faf726f", "title": "Multimodal biomedical AI"}, {"paperId": "26a8945006cd5342527d343cf686f8ea934a0586", "title": "Characterizing Patient Representations for Computational Phenotyping"}, {"paperId": "632f910a5b459bcbc46f3670070b6f8507b0c524", "title": "An Extensive Data Processing Pipeline for MIMIC-IV"}, {"paperId": "8289f719ed7e3bb9333b2a4b8835e3ffc8b41cad", "title": "AutoMap: Automatic Medical Code Mapping for Clinical Prediction Model Deployment"}, {"paperId": "7c594909cf6e597d09266d14a6c65af35b520c4b", "title": "Early identification of patients admitted to hospital for covid-19 at risk of clinical deterioration: model development and multisite external validation study"}, {"paperId": "358cb124b7532ba16d4d7c95ba3a51a625b5e82b", "title": "Generating synthetic mixed-type longitudinal electronic health records for artificial intelligent applications"}, {"paperId": "6df275d4db9a3564bc2772c442082f3b97e4c9b5", "title": "From demand forecasting to inventory ordering decisions for red blood cells through integrating machine learning, statistical modeling, and inventory optimization"}, {"paperId": "86c30901285d92affd9ddd07f42ceda2bbde01d2", "title": "How to leverage the multimodal EHR data for better medical prediction?"}, {"paperId": "ef287f9ee76a5396691976c39777a1d87440b85e", "title": "An automated data cleaning method for Electronic Health Records by incorporating clinical knowledge"}, {"paperId": "e0247c063887c96725870a9bff9199434a183473", "title": "Combining chest X-rays and electronic health record (EHR) data using machine learning to diagnose acute respiratory failure"}, {"paperId": "0869f499ebfd95d14b535d8ea3d5de3113f10ee9", "title": "COP-E-CAT: cleaning and organization pipeline for EHR computational and analytic tasks"}, {"paperId": "bdab4514e065afe1a33795ad924c0d26fe717aa1", "title": "Comparison of machine learning algorithms for mortality prediction in intensive care patients on multi-center critical care databases"}, {"paperId": "746c51780d5fe1408e6e3eda515acb809cf222c4", "title": "FIBER: enabling flexible retrieval of electronic health records data for clinical predictive modeling"}, {"paperId": "e957bd06544c3cd3434e59e939d051770b9c69e8", "title": "mikropml: User-Friendly R Package for Supervised Machine Learning Pipelines"}, {"paperId": "f263e5dd800d6b6f2fb98977d7dad4bd2cb2d56c", "title": "Phenoflow: Portable Workflow-based Phenotype Definitions"}, {"paperId": "eb7f691d939f1f62a7444b16f70cde5ef59d9e9d", "title": "Self-supervised based general laboratory progress pretrained model for cardiovascular event detection"}, {"paperId": "10ea36e0c7ff744f07c4316fbc6f6a237ee0f976", "title": "Combining chest X-rays and EHR data using machine learning to diagnose acute respiratory failure"}, {"paperId": "8b3d4ae4ccaee748372e2519fae4250b15febf9b", "title": "Privacy-Preserving Collective Learning With Homomorphic Encryption"}, {"paperId": "87a5ab87b64024814f4eb3b80af42ae595c677fc", "title": "Phenoflow: A Microservice Architecture for Portable Workflow-based Phenotype Definitions."}, {"paperId": "34d49f00732c834226c5381f3204e473974eb967", "title": "Advancing Few-Shot Multi-Label Medication Prediction in Intensive Care Units: The FIDDLE-Rx Approach"}]}
