{"paperId": "23860a13040892e549ec08d6d00779b0f3f2da32", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Blockchain-based Model for Securing Data Pipeline in a Heterogeneous Information System", "abstract": "In our digital world, access to personal and public data has become an item of concern, with challenging security and privacy aspects. Modern information systems are heterogeneous in nature and have an inherent security vulnerability, which is susceptible to data interception and data modification due to unsecured communication data pipelines between connected endpoints. This re-search article presents a blockchain-based model for securing data pipelines in a heterogeneous information system using an integrated multi-hazard early warning system (MHEWS) as a case study. The proposed model utilizes the inherent security features of blockchain technology to address the security and privacy concerns that arise in data pipelines. The model is designed to ensure data integrity, confidentiality, and authenticity in a decentralized manner. The model is evaluated in a hybrid environment using a prototype implementation and simulation experiments with outcomes that demonstrate advantages over traditional approaches for a tamper-proof and immutable data pipeline for data authenticity and integrity using a confidential ledger.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-17", "journal": {"name": "ArXiv", "volume": "abs/2401.09240"}, "authors": [{"authorId": "2279756087", "name": "MN Ramahlosi"}, {"authorId": "2279755879", "name": "Y. Madani"}, {"authorId": "2279757323", "name": "A. Akanbi"}], "citations": [{"paperId": "d8d8d92281a9df83066684fa1f4efb00440e3e76", "title": "Zero-day vulnerability prevention with recursive feature elimination and ensemble learning"}]}
