{"paperId": "238a1456fb08bf01178eeff6d12bd6fba7b80325", "publicationVenue": {"id": "ae70daa0-c404-4e18-ac73-f8a37c17fdd9", "name": "Brazilian Symposium on Databases", "type": "conference", "alternate_names": ["SBBD", "Braz Symp Database"], "url": "http://www.sbc.org.br/"}, "title": "Processamento Eficiente de Consultas Analíticas Estendidas com Predicado de Similaridade em Spark", "abstract": "An image data warehousing extends a conventional data warehousing to also manipulate images represented by feature vectors and attributes for similarity search. A challenge that arises is the efficient processing of analytical queries extended with a similarity search predicate since these queries have a high computational cost. In this article we propose the BrOmnImg method, which efficiently solves this challenge in Spark. Compared to its closest method, BrOmnImg improved query processing up to 65.49%. Resumo. Um data warehousing de imagens estende um data warehousing convencional para também manipular imagens representadas por vetores de caracterı́sticas e atributos para pesquisa por similaridade. Um desafio que surge é o processamento de consultas analı́ticas estendidas com predicado de similaridade, desde que essas consultas possuem alto custo computacional. Neste artigo é proposto o método BrOmnImg, o qual soluciona eficientemente esse desafio usando o framework Spark. Comparado com o método mais próximo, BrOmnImg proveu ganhos de desempenho de até 65,49%.", "venue": "Brazilian Symposium on Databases", "year": 2019, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-26", "journal": {"pages": "229-234"}, "authors": [{"authorId": "116768751", "name": "Guilherme Görgen da Rocha"}, {"authorId": "1506926970", "name": "C. Ciferri"}], "citations": [{"paperId": "db09af9a07629b76e995bfd744c8b4f4c006a4a5", "title": "Efficient Processing of Analytical Queries Extended with Similarity Search Predicates over Images in Spark"}, {"paperId": "cc1e9e8d298384337625949171847ff8401044cc", "title": "ADBIS, TPDL and EDA 2020 Common Workshops and Doctoral Consortium: International Workshops: DOING, MADEISD, SKG, BBIGAP, SIMPDA, AIMinScience 2020 and Doctoral Consortium, Lyon, France, August 25–27, 2020, Proceedings"}]}
