{"paperId": "23998e5a349facd46fbd59a90faf9a4eb02e41e4", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "ARFC: Advance response function of TCP CUBIC for IoT‐based applications using big data", "abstract": "The throughput of a TCP flow depends on the average size of Congestion Window (cwnd) of a congestion control mechanism being used during the communication. The size of cwnd depends upon the usage of available link bandwidth during communication. The response function is a measure of average throughput of a single TCP flow of congestion control mechanism as the level of random packet loss is varied. Nowadays, many organizations are deploying IoT based applications for the analytics of their Big Data. TCP CUBIC and TCP Compound are the default congestion control mechanisms in Linux and Microsoft Windows Operating Systems respectively. Whereas, TCP Reno which is also known as Standard TCP congestion control mechanism is act as a trademark congestion control mechanism. During communication among different IoT applications, TCP CUBIC flows use more available link bandwidth as compared to TCP Reno flows, thus, the average cwnd size of TCP CUBIC flows are greater than the TCP Reno flows. It implies that these both kinds of flows are not sharing available link fairly, which refers as low TCP friendliness of TCP CUBIC. It means that the throughput of TCP CUBIC flows is higher than the trademark congestion control mechanism, i.e., TCP Reno flows. As a result, friendliness behavior or fair share of available link bandwidth among TCP CUBIC flows and TCP Reno flows is decreased. In other words, TCP friendliness of TCP CUBIC flows is reduced. Now, it is important to decrease the average cwnd size of TCP CUBIC flows, such that available link bandwidth can be shared fairly among flows of TCP CUBIC and TCP Reno. The aim of this research is to enhance the TCP friendliness behavior of TCP CUBIC congestion control mechanism for IoT based applications using Big Data. In this paper, an Advance Response Function of TCP CUBIC (ARFC) is designed to share fairly available link bandwidth among flows of TCP CUBIC and TCP Reno. Results show that TCP friendliness behavior of TCP CUBIC is increased by using ARFC. Overall, 18.6% performance is increased by using ARFC.", "venue": "Concurrency and Computation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-27", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "2110092486", "name": "Mudassar Ahmad"}, {"authorId": "152199190", "name": "Usman Ahmad"}, {"authorId": "1796184", "name": "Md. Asri Ngadi"}, {"authorId": "7693282", "name": "Muhammad Asif Habib"}, {"authorId": "144890624", "name": "C. M. N. Faisal"}, {"authorId": "2065639117", "name": "Nasir Mahmood"}], "citations": [{"paperId": "d1c395ac1f7cbae0dac2d6ec9f51b5e7a4635992", "title": "Special issue on real‐time behavioral monitoring in IoT applications using big data analytics"}, {"paperId": "628adf2852b5daa7dd4d67b3c5cbbaa912cb2d42", "title": "ADYTIA: Adaptive and Dynamic TCP Interface Architecture for heterogeneous networks"}]}
