{"paperId": "23a1d378c05ec0ec14c6675558d1ad909b4e8b16", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "Cost-Efficient Service Function Chain Orchestration for Low-Latency Applications in NFV Networks", "abstract": "With the popularization and development of cloud computing, network function virtualization and service function chain (SFC) provisioning have attracted increasing attention from researchers. Excellent and reliable network service is important for network development. Moreover, as the number of network users increases, network service construction costs become very high. Therefore, an efficient algorithm is necessary to provide an SFC with excellent performance and low resource costs. In this paper, we re-examine the problem of optimizing the deployment of an SFC to provide users with excellent and resource-saving network service. We propose a heuristic, closed-loop feedback (CLF) algorithm to find the shortest path to map an SFC. To solve the problem, we introduce and integrate a restricted Boltzmann machine and cross entropy to improve the performance of CLF. Simulation results demonstrate the excellent performance of CLF. The communication delay is reduced by approximately 20%, the accept ratio improves by approximately 15%, and the algorithm running time decreases by approximately 20%. In addition, the resource utilization ratio increases by approximately 15%, and the resource fragmentation ratio decreases by approximately 50%.", "venue": "IEEE Systems Journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "IEEE Systems Journal", "pages": "3877-3888", "volume": "13"}, "authors": [{"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "81134934", "name": "Gungyang Zhu"}, {"authorId": "50281324", "name": "D. Liao"}, {"authorId": "49514984", "name": "Hongfang Yu"}, {"authorId": "144335971", "name": "Xiaojiang Du"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "3592db92ecdf9aa8c583a04d97e64f5db6128544", "title": "Energy-Aware Positioning Service Provisioning for Cloud-Edge-Vehicle Collaborative Network Based on DRL and Service Function Chain"}, {"paperId": "b426d1f0a5bc6a6c810a40190a558c5921d3b33e", "title": "A novel method for effective intrusion detection based on convolutional speaking neural networks"}, {"paperId": "4a0ae86a2866b3e5706241500b687673a6dc4974", "title": "Innovative deep learning techniques for monitoring aggressive behavior in social media posts"}, {"paperId": "f6e62d58eee3f033fc4829f70a0ac4c88a8e7efa", "title": "A Service-differentiated Virtual Network Function Migration Method"}, {"paperId": "398c8c793e1bf94b78fbc0dc0c5918f5029ea3f2", "title": "Service Function Chaining to Support Ultra-Low Latency Communication in NFV"}, {"paperId": "6b2c8983caa7131be69575232da65ba6a7c3baf3", "title": "Slice-Based Service Function Chain Embedding for End-to-End Network Slice Deployment"}, {"paperId": "13f82f5d3cf4ded379ae89472d17f02aee0ac611", "title": "Dynamic SFC Embedding Algorithm Assisted by Federated Learning in Space–Air–Ground-Integrated Network Resource Allocation Scenario"}, {"paperId": "cfcb2676b8ead1d55680fc375bb9a371336cd003", "title": "An online service function chain orchestration method for profit maximization in edge computing networks"}, {"paperId": "e339588a026d590d4aa042fd4ea37d7c977c0779", "title": "Optimal service decomposition for mobile augmented reality with edge cloud support"}, {"paperId": "ae06b060a84405a5f6473ae40781f90fb33bbb5d", "title": "Service Function Chaining in Industrial Internet of Things With Edge Intelligence: A Natural Actor-Critic Approach"}, {"paperId": "65823ff9bedcecfd0c81c8f57889f875917adf1d", "title": "Securing Dynamic Service Function Chain Orchestration in EC-IoT Using Federated Learning"}, {"paperId": "63fd2b83ba497961ea7be9463dc214688ebc04ad", "title": "A novel reliable low-latency service function chaining to enable URLLC in NFV"}, {"paperId": "4da92fce9eb09adf841a40a4b517e35a5f27d5cf", "title": "Delay-aware and resource-efficient service function chain mapping in inter-datacenter elastic optical networks"}, {"paperId": "1cefc7a35d7f065e6666ef279115ade86477b44f", "title": "A review on Virtualized Infrastructure Managers with management and orchestration features in NFV architecture"}, {"paperId": "1e9b2ab1f287665841cfaa577d27d0bf3b1d5114", "title": "Service function chaining to support ultra-low latency communication in NFV"}, {"paperId": "b0174da6a95ce733bf749ef3a156321892ac37c4", "title": "Traffic-Weighted Availability-Guaranteed Network Slice Composition with VNF Replications"}, {"paperId": "1ccddb6422d4dd74556c8b5437a4cd85dd331b80", "title": "Fast recovery for online service function chaining interruption using adaptive migration"}, {"paperId": "6f71b67dfdbcfc4f1684ab3e68d75e44237db56d", "title": "Slice-Based Service Function Chain Embedding with Multiple Factors"}, {"paperId": "803e5ed83cb4837c72b5aa36894fbecdfd7af86f", "title": "Dynamic Service Function Chain Orchestration for NFV/MEC-Enabled IoT Networks: A Deep Reinforcement Learning Approach"}, {"paperId": "fb065a9af2186f271fbb0a9b1518f945dbc40c44", "title": "A multi-stage graph based algorithm for survivable Service Function Chain orchestration with backup resource sharing"}, {"paperId": "acecf9a568245be2f005f4d88ecfaa93e644f75b", "title": "Profit Maximization of Online Service Function Chain Orchestration in an Inter-Datacenter Elastic Optical Network"}, {"paperId": "adf879c3c148a4494d467420d40afc630e3d2941", "title": "Click-UP: Toward the Software Upgrade of Click-Based Modular Network Function"}, {"paperId": "d22df5749e8f7983c7816eb6d6881a0c73005c9f", "title": "Heuristic Based Algorithm for SFC Allocation in 5G Experience Applications"}, {"paperId": "227061927488a6afc250d9bd5c5bae057ee1edf8", "title": "Dynamic Network Function Provisioning to Enable Network in Box for Industrial Applications"}, {"paperId": "67903b5b0298f97bbea07ff6e944d4cbe19e9b42", "title": "A comprehensive survey of service function chain provisioning approaches in SDN and NFV architecture"}, {"paperId": "ee379e60fde36bc354ac3cdf37845ab95ff42012", "title": "A deep reinforcement learning-based algorithm for reliability-aware multi-domain service deployment in smart ecosystems"}, {"paperId": "e9bc6ac85d3049defb4d6c74ba2e51e25c0ef89e", "title": "VNF Placement for Service Function Chains with Strong Low-Delay Restrictions in Edge Computing Networks"}, {"paperId": "764e69550e941478ecaf1ec61d6a0a5ec2bf4050", "title": "Low-Latency and Resource-Efficient Service Function Chaining Orchestration in Network Function Virtualization"}, {"paperId": "5ef0977db3a7270e500458fe3f0f4f1c63eb5e5e", "title": "Energy-Efficient Provisioning for Service Function Chains to Support Delay-Sensitive Applications in Network Function Virtualization"}, {"paperId": "f019b23a24cc5981af30c0ca6aeec08a6b28e377", "title": "CoDeC: A Cost-Effective and Delay-Aware SFC Deployment"}, {"paperId": "c5ca278f035e66910af33c08581306fe6493cb25", "title": "PSNet: Reconfigurable network topology design for accelerating parameter server architecture based distributed machine learning"}, {"paperId": "d860c388ac60124e7b4514cc3cde644ecbf838a0", "title": "Adaptive service function chaining mappings in 5G using deep Q-learning"}, {"paperId": "a3b582522680475c36da0866ef9c7fce94a55744", "title": "Latency- and capacity-aware placement of chained Virtual Network Functions in FMC metro networks"}, {"paperId": "c3217158c09a8921142cf059306af1455065c8fb", "title": "Personality-Aware VNF Deployment for Profit Maximization"}, {"paperId": "baaac264ed7fe7b7fcf4f00123f178b49accd832", "title": "Toward SLAs Guaranteed Scalable VDC Provisioning in Cloud Data Centers"}, {"paperId": "ccfe7a4a62705941b067f2bc3bdad809e73b444e", "title": "MonLink: Piggyback Status Monitoring over LLDP in Software-Defined Energy Internet"}, {"paperId": "d7a195e5d489e35ec84aba86257f79ee1d311cf3", "title": "An Energy-driven Network Function Virtualization for Multi-domain Software Defined Networks"}, {"paperId": "a8639a6b719cf1cf6b1ab35714ab9b118031e121", "title": "Towards Supporting Security and Privacy for Social IoT Applications: A Network Virtualization Perspective"}, {"paperId": "f9df2a289f8f62dbec91980d711882c1028a2ae9", "title": "Flow-aware explicit congestion notification for datacenter networks"}, {"paperId": "b6f16d040e9f056a59aa89d742acc0963960ee35", "title": "On Orchestrating Service Function Chains in 5G Mobile Network"}, {"paperId": "5d3249fcf5177d5c6f5d8f3d1587b80badeb5fd2", "title": "A Service Function Chain Deployment Method Based on Network Flow Theory for Load Balance in Operator Networks"}, {"paperId": "d4e101a66d106bd7ded7535e59c0a3dd4ad8c5ef", "title": "Machine Learning Meets Communication Networks: Current Trends and Future Challenges"}, {"paperId": "0b87316749e4d38985b018c0261bd136c8893b81", "title": "Online Parallelized Service Function Chain Orchestration in Data Center Networks"}, {"paperId": "78d8173d792d80941e00aa7df24747bd3e619314", "title": "Parallelized Service Function Chain Orchestration in Data Center Networks"}]}
