{"paperId": "23a54c1ca83a9d4d1bf980e118b6e8ba16bcd505", "publicationVenue": {"id": "336e2706-61ed-4bc5-97a6-3df713fc01c2", "name": "International Conference on Software Engineering and Knowledge Engineering", "type": "conference", "alternate_names": ["Softw Eng Knowl Eng", "Int Conf Softw Eng Knowl Eng", "SEKE", "Software Engineering and Knowledge Engineering"], "url": "http://ksiresearch.org/seke/seke20.html"}, "title": "Endowing NoSQL DBMS with SQL Features Through Standard Call Level Interfaces", "abstract": "To store, update and retrieve data from database management systems (DBMS), software architects use tools, like call-level interfaces (CLI), which provide standard functionalities to interact with DBMS. However, the emerging of NoSQL paradigm, and particularly new NoSQL DBMS providers, lead to situations where some of the standard functionalities provided by CLI are not supported, very often due to their distance from the relational model or due to design constraints. As such, when a system architect needs to evolve, namely from a relational DBMS to a NoSQL DBMS, he must overcome the difficulties conveyed by the features not provided by NoSQL DBMS. Choosing the wrong NoSQL DBMS risks major issues with components requesting non-supported features. This paper focuses on how to deploy features that are not so commonly supported by NoSQL DBMS (like Stored Procedures, Transactions, Save Points and interactions with local memory structures) by implementing them in standard CLI.", "venue": "International Conference on Software Engineering and Knowledge Engineering", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-07-01", "journal": {"pages": "201-207"}, "authors": [{"authorId": "31763006", "name": "Ó. Pereira"}, {"authorId": "51111281", "name": "D. Simões"}, {"authorId": "1689246", "name": "R. Aguiar"}], "citations": [{"paperId": "110df3e7300b59bc1284af9d929e2937aaf80ecf", "title": "Log-Based Model to Enforce Data Consistency on Agnostic Fault-Tolerant Systems"}, {"paperId": "15c2fb9d112f77b6956ed8fa449f60a49fcc09af", "title": "Fault Tolerance Logging-based Model for Deterministic Systems"}]}
