{"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "publicationVenue": null, "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing", "abstract": "Selecting appropriate computational resources for data processing jobs on large clusters is difficult, even for expert users like data engineers. Inadequate choices can result in vastly increased costs, without significantly improving performance. One crucial aspect of selecting an efficient resource configuration is avoiding memory bottlenecks. By knowing the required memory of a job in advance, the search space for an optimal resource configuration can be greatly reduced.Therefore, we present Ruya, a method for memory-aware optimization of data processing cluster configurations based on iteratively exploring a narrowed-down search space. First, we perform job profiling runs with small samples of the dataset on just a single machine to model the job’s memory usage patterns. Second, we prioritize cluster configurations with a suitable amount of total memory and within this reduced search space, we iteratively search for the best cluster configuration with Bayesian optimization. This search process stops once it converges on a configuration that is believed to be optimal for the given job. In our evaluation on a dataset with 1031 Spark and Hadoop jobs, we see a reduction of search iterations to find an optimal configuration by around half, compared to the baseline.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-08", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "161-169"}, "authors": [{"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "4c27e561d7c0a78fc4f7593235c021d08ab6e1e0", "title": "Towards Advanced Monitoring for Scientific Workflows"}, {"paperId": "150d620b3207725c4db1ae464e8182bd2c611586", "title": "Leveraging Reinforcement Learning for Task Resource Allocation in Scientific Workflows"}]}
