{"paperId": "23bd12545ac5b33fb8ab6842a7b700788c0015eb", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Method for the Automated Inspection of the Surfaces of Photovoltaic Modules", "abstract": "One of the most important conditions for the efficient operation of solar power plants with a large installed capacity is to ensure the systematic monitoring of the surface condition of the photovoltaic modules. This procedure is aimed at the timely detection of external damage to the modules, as well as their partial shading. The implementation of these measures solely through visual inspection by the maintenance personnel of the power plant requires significant labor intensity due to the large areas of the generation fields and the operating conditions. Authors propose an approach aimed at increasing the energy efficiency of high-power solar power plants by automating the inspection procedures of the surfaces of photovoltaic modules. The solution is based on the use of an unmanned aerial vehicle with a payload capable of video and geospatial data recording. To perform the procedures for detecting problem modules, it is proposed to use “object-detection” technology, which uses neural network classification methods characterized by high adaptability to various image parameters. The results of testing the technology showed that the use of a neural network based on the R-CNN architecture with the learning algorithm—Inception v2 (COCO)—allows detecting problematic photovoltaic modules with an accuracy of more than 95% on a clear day.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "100539129", "name": "P. Kuznetsov"}, {"authorId": "2087658203", "name": "D. Kotelnikov"}, {"authorId": "81188415", "name": "L. Yuferev"}, {"authorId": "2069664845", "name": "V. Panchenko"}, {"authorId": "80404717", "name": "Vadim Bolshev"}, {"authorId": "2135062058", "name": "Marek Jasiński"}, {"authorId": "1903013", "name": "A. Flah"}], "citations": []}
