{"paperId": "23cbdb0380f303c2694ebdbdb9e07cc97dbaa5e5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Quantitative Analysis and Guideline of Data Streaming Accelerator in Intel 4th Gen Xeon Scalable Processors", "abstract": "As semiconductor power density is no longer constant with the technology process scaling down, modern CPUs are integrating capable data accelerators on chip, aiming to improve performance and efficiency for a wide range of applications and usages. One such accelerator is the Intel Data Streaming Accelerator (DSA) introduced in Intel 4th Generation Xeon Scalable CPUs (Sapphire Rapids). DSA targets data movement operations in memory that are common sources of overhead in datacenter workloads and infrastructure. In addition, it becomes much more versatile by supporting a wider range of operations on streaming data, such as CRC32 calculations, delta record creation/merging, and data integrity field (DIF) operations. This paper sets out to introduce the latest features supported by DSA, deep-dive into its versatility, and analyze its throughput benefits through a comprehensive evaluation. Along with the analysis of its characteristics, and the rich software ecosystem of DSA, we summarize several insights and guidelines for the programmer to make the most out of DSA, and use an in-depth case study of DPDK Vhost to demonstrate how these guidelines benefit a real application.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-04", "journal": {"name": "ArXiv", "volume": "abs/2305.02480"}, "authors": [{"authorId": "2212858838", "name": "Reese Kuper"}, {"authorId": "50814337", "name": "Ipoom Jeong"}, {"authorId": "2504915", "name": "Yifan Yuan"}, {"authorId": "2112297217", "name": "Jiayu Hu"}, {"authorId": "153537265", "name": "Ren Wang"}, {"authorId": "2077151158", "name": "N. Ranganathan"}, {"authorId": "1686484", "name": "N. Kim"}], "citations": [{"paperId": "021d753cb1e4a6d096224874ebd436477734ead7", "title": "Distributed OpenMP Offloading of OpenMC on Intel GPU MAX Accelerators"}, {"paperId": "cbbe8db661cecdfb481901125f9d7c6472640f06", "title": "HotTiles: Accelerating SpMM with Heterogeneous Accelerator Architectures"}, {"paperId": "1122a56a32f24236ca4655575cd49585e4dadc72", "title": "Portability and Scalability of OpenMP Offloading on State-of-the-art Accelerators"}]}
