{"paperId": "23ccaadb9f104983691045d43a30375610dfc1d7", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Mechanisms of air breakdowns for aluminum conductors steel reinforced wire-wire gaps induced by propane jet flames", "abstract": "In recent years, events of transmission line tripping caused by wildfires have occurred frequently in many mountain areas. In order to understand the mechanism of such events, an experimental system for simulating breakdown discharge processes of model wires induced by a simulated fire source is designed. In this experiment, propane jet flame (somewhat like eruptive fires in real wild fires) is used as a simulated flame source. By setting three different gas flow rates and five different wire-wire gaps, discharge breakdown behaviors and characteristics between two ACSR (aluminum conductors steel reinforced) segments in propane flames with three flame zones are explored. The influences of these different factors on the breakdown characteristics and mechanisms of wire-wire air gaps are analyzed. Results show that breakdown voltages increase almost linearly with the increase of wire-wire gaps in continuous zone of the flames for three gas flow rates. For a short wire-wire gap like 5.0 cm, the pilot discharge channels can be formed more easily, stably and completely under a lower voltage and weaker external ionization environment. The propane jet flame conditions are complex and affected by multiple actions like initial jet force (affected by gas flow rate), temperature distribution, soot particle, ion wind. As a result, local electric field will be distorted, a streamer channel is established dependently in different cases. These factors play individual, competitive or synergistic roles at the same time in breakdowns of real ACSR wire-wire gaps.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-02", "journal": {"volume": "11"}, "authors": [{"authorId": "2111635075", "name": "Siyi Chen"}, {"authorId": "2064357729", "name": "Fei You"}, {"authorId": "2468893", "name": "Jixiang Xu"}, {"authorId": "2124808888", "name": "Zhenhua Wang"}, {"authorId": "2122997189", "name": "Yun Zhang"}, {"authorId": "2143397321", "name": "Yaopeng Zhao"}, {"authorId": "2004605070", "name": "Haoyuan Yang"}, {"authorId": "2210636381", "name": "Zhiqiang Jiang"}], "citations": []}
