{"paperId": "23e47e810e5895a66e3f8e671f0356e5869ff27d", "publicationVenue": {"id": "40e81dcb-c8bc-42c8-b1b4-fce115b774e3", "name": "Dagstuhl Reports", "alternate_names": ["Dagstuhl Rep"], "issn": "2192-5283", "url": "https://www.dagstuhl.de/en/publications/dagstuhl-reports/"}, "title": "Digital Twins for Cyber-Physical Systems Security (Dagstuhl Seminar 22171)", "abstract": "Cyber-physical systems (CPSs) may constitute an attractive attack target due to the increased networking of components that yields an expanded attack surface. If their physical control capabilities are compromised, safety implications may arise. Thus, it is vital that the CPSs being engineered are thoroughly tested and that adequate response measures can be realized upon detecting intruders during operation. However, security testing is hard to conduct due to expensive hardware, limited maintenance periods, and safety risks. Furthermore, the increased stealthiness of threat actors requires new intrusion detection and response methods. Interestingly, digital twins have become an important concept in industrial informatics to solve similar problems, yet with a non-security-related focus: Digital twins that virtually replicate the real systems provide cost-efficient modeling, testing, monitoring, and even predictive capabilities. However, until recently, the digital-twin concept has mainly focused on production optimizations or design improvements without considering its potential for CPS security. The Dagstuhl Seminar 22171 “Digital Twins for Cyber-Physical Systems Security” therefore aimed to serve as an interdisciplinary, open knowledge-sharing platform to investigate the benefits and challenges of applying the digital-twin concept to improve the security of CPSs.", "venue": "Dagstuhl Reports", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Dagstuhl Reports", "pages": "54-71", "volume": "12"}, "authors": [{"authorId": "2053381130", "name": "Alvaro Cárdenas Mora"}, {"authorId": "1401730437", "name": "S. Nadjm-Tehrani"}, {"authorId": "1797267", "name": "E. Weippl"}, {"authorId": "47307908", "name": "Matthias Eckhart"}], "citations": [{"paperId": "5cdce50fe15e88179683341cbd624146550668bc", "title": "Security-Enhancing Digital Twins: Characteristics, Indicators, and Future Perspectives"}]}
