{"paperId": "23eb96ce7273a2a64d65916685b79a5dbf04c843", "publicationVenue": {"id": "59eaa32d-b026-4d64-beaa-c422bc2629ed", "name": "Small", "type": "journal", "issn": "1613-6810", "url": "http://www.small-journal.com/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/16136829", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1613-6829"]}, "title": "Nanocomposite Electret Layer Improved Long-Term Stable Solid-Liquid Contact Triboelectric Nanogenerator for Water Wave Energy Harvesting.", "abstract": "With the continuous rise of environmental pollution and energy crisis, the global energy revolution is risen. Development of renewable blue energy based on the emerging promising triboelectric nanogenerators (TENG) has become an important direction of future energy development. The solid-liquid contact triboelectric nanogenerator (TENG) has the advantages of flexible structure, easy manufacture, and long-term stability, which makes it easier to integrate and achieve large-scale conversion of wave mechanical energy. However, the electric power output is still not large enough, which limits its practical applications. In this work, a nanocomposite electret layer enhanced solid-liquid contact triboelectric nanogenerator (E-TENG) is proposed for water wave energy harvesting, which can effectively improve the electric output and achieve real-time power supply of wireless sensing. Through introducing a nanocomposite electret layer into flexible multilayer solid-liquid contact TENG, higher power output is achieved. The E-TENG (active size of 50 mm × 49 mm) shows desired output performance, a power density of 521 mW m-2 . The generated electric energy can drive wireless temperature sensing by transmitting wireless signals carrying detection information at the period of ˂5.5 min. This research greatly improves the electric output and provides a solid basis for the industrialization of TENG in blue energy.", "venue": "Small", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-31", "journal": {"name": "Small", "pages": "\n          e2310023\n        "}, "authors": [{"authorId": "2277568031", "name": "Xue Jiao Zhao"}, {"authorId": "2113222228", "name": "Hai Lu Wang"}, {"authorId": "2277603166", "name": "Zhong Lin Wang"}, {"authorId": "2146041391", "name": "Jie Wang"}], "citations": []}
