{"paperId": "23ee8b9bc7af0ee1e2c315a6fedc094b90eb3d3b", "publicationVenue": null, "title": "A feature selection for video quality of experience modeling: A systematic literature review", "abstract": "Quality of Experience (QoE) multidimensional concept is the key for successful delivery of multimedia services. Higher user requirements for new experiences such as augmented reality, virtual reality, and future 6G services set higher requirements for QoE. A more complex QoE space requires the use of data mining methods in order to process the data for better QoE prediction. The increased dimensionality of the QoE space becomes a limiting factor for achieving the desired QoE prediction accuracy. Existing studies considering the QoE multidimensional concept with approaches that overcome the challenge of increased QoE space dimensionality are of great importance for future research. Accordingly, this article aims to review the applications of Feature Selection (FS) methods in video QoE modeling. It provides a comprehensive overview of the existing studies with the categorization and review of applied FS methods with reference to the data collection and data modeling steps. The analysis included 71 studies which provides overview of the FS methods applications in video QoE modeling depending on the input Influence Factor (IF) dimension sizes, type of IFs, QoE prediction methods used and QoE evaluation type. Our review revealed the advantages of using FS methods in video QoE modeling, frequency of application of FS methods with potential of applying more FS methods in a series or a parallel, gives an overview of the achieved dimensionality reduction degree for different methods, and provides insights in opportunities for researchers for applying FS methods on complex multidimensional QoE space.", "venue": "WIREs Data. Mining. Knowl. Discov.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-03", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "13"}, "authors": [{"authorId": "2171598054", "name": "Fatima Skaka-Cekic"}, {"authorId": "2634677", "name": "J. Barakovic"}], "citations": []}
