{"paperId": "23f96d995f3f238178f5f2f4ea3bc8a67a37adc6", "publicationVenue": {"id": "e7791e25-168b-40b0-b999-10020aadabf4", "name": "International Conference on Software and Data Technologies", "type": "conference", "alternate_names": ["ICSOFT", "Int Conf Softw Data Technol"], "url": "http://www.icsoft.org/"}, "title": "A Parallel Many-core CUDA-based Graph Labeling Computation", "abstract": ": When working on graphs, reachability is among the most common problems to address, since it is the base for many other algorithms. As with the advent of distributed systems, which process large amounts of data, many applications must quickly explore graphs with millions of vertices, scalable solutions have become of paramount importance. Modern GPUs provide highly parallel systems based on many-core architectures and have gained popularity in parallelizing algorithms that run on large data sets. In this paper, we extend a very efﬁcient state-of-the-art graph-labeling method, namely the GRAIL algorithm, to architectures which exhibit a great amount of data parallelism, i.e., many-core CUDA-based GPUs. GRAIL creates a scalable index for answering reachability queries, and it heavily relies on depth-ﬁrst searches. As depth-ﬁrst visits are intrinsically recursive and they cannot be efﬁciently implemented on parallel systems, we devise an alternative approach based on a sequence of breadth-ﬁrst visits. The paper explores our efforts in this direction, and it analyzes the difﬁculties encountered and the solutions chosen to overcome them. It also presents a comparison (in terms of times to create the index and to use it for reachability queries) between the CPU and the GPU-based versions.", "venue": "International Conference on Software and Data Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "597-605"}, "authors": [{"authorId": "8038281", "name": "S. Quer"}], "citations": [{"paperId": "b9a89c8c5a5a5b759fa47b24847a36195d44b40f", "title": "Graph Reachability on Parallel Many-Core Architectures"}]}
