{"paperId": "2415de181c8c54b0ece76003729d3b7971005e05", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Analysis of the State of Learning in University Students with the Use of a Hadoop Framework", "abstract": "Currently, education is going through a critical moment due to the 2019 coronavirus disease that has been declared a pandemic. This has forced many organizations to undergo a significant transformation, rethinking key elements of their processes and the use of technology to maintain operations. The continuity of education has become dependent on technological tools, as well as on the ability of universities to cope with a precipitous transition to a remote educational model. That has generated problems that affect student learning. This work proposes the implementation of a Big Data framework to identify the factors that affect student performance and decision-making to improve learning. Similar works cover two main research topics under Big Data in education, the modeling and storage of educational data. However, they do not consider issues such as student performance and the improvement of the educational system with the integration of Big Data. In addition, this work provides a guide for future studies and highlights new insights and directions for the successful use of Big Data in education. Real-world data were collected for the evaluation of the proposed framework, the collection of these being the existing limitation in all research due to generalized rejection of data consent.", "venue": "Future Internet", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-24", "journal": {"name": "Future Internet", "pages": "140", "volume": "13"}, "authors": [{"authorId": "1410234504", "name": "W. Villegas-Ch."}, {"authorId": "103754310", "name": "Milton Román Cañizares"}, {"authorId": "2089421683", "name": "Santiago Sánchez-Viteri"}, {"authorId": "1404002431", "name": "J. Garcia-Ortiz"}, {"authorId": "2117667536", "name": "Walter Gaibor-Naranjo"}], "citations": [{"paperId": "340ba4a9632dc91c3a59578964d9f725219ef8ae", "title": "Combined with the Internet technology of college student training mode innovation and student management mechanism optimization"}, {"paperId": "cd5b952169a67fc7ce2fa6f12d9bb87747277bab", "title": "Proposal for the Analysis of the State of Learning in University Students with the Inclusion of ICT in the Classroom"}, {"paperId": "238998aff124ca516f8df484b7a72e387430398b", "title": "Proposal of a Model for the Analysis of the State of the Use of ICT in Education Applied to Technological Institutes of Higher Education"}]}
