{"paperId": "24195f6ff6441811467e95bf5046131f3b9bc0e7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "URLLC in Beyond 5G and 6G Networks: An Interference Management Perspective", "abstract": "Ultra-reliable and low-latency communications (URLLC) is one of the cornerstone services of fifth-generation and beyond (B5G) wireless networks. The URLLC use cases demand strict block error probability and very low-latency targets, and thus even a small 32 byte of payload corruption could be detrimental to the user experience and the overall system performance. Ideally, the current heterogeneous network model and innovative technologies have paved the way for the seamless optimization of B5G URLLC applications. Yet, unprecedented interference issues due to the uncoordinated nature of modern wireless networks, innovative radio access techniques, and frequency reuse methods can significantly affect the performance of the URLLC systems. Therefore, understanding and mitigation of all types of interference associated with each URLLC technology, deployment scenario, and wireless transmission mode are prudent. In this regard, many authors have recently presented interpretative and analytical studies on the management of interference issues; however, the discussion was limited to application-centric approaches and earlier research trends. In this review article, we primarily discuss different types of interference challenges related to the URLLC systems using contemporary designs, frameworks, access modes, and enabling technologies for B5G and sixth-generation (6G) communication networks. We present state-of-the-art research work, in-depth analysis of interference problems, and guidance on the futuristic 6G URLLC technologies and communication networks. This study intends to provide a holistic vision of B5G/6G URLLC systems, their empirical aspects, limitations, essential techniques, and an outlook toward future research avenues.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "54639-54663", "volume": "11"}, "authors": [{"authorId": "2004836913", "name": "Maraj Uddin Ahmed Siddiqui"}, {"authorId": "122871809", "name": "Hanaa Abumarshoud"}, {"authorId": "2579970", "name": "L. Bariah"}, {"authorId": "1745247", "name": "S. Muhaidat"}, {"authorId": null, "name": "Muhammad Ali Imran"}, {"authorId": "46393074", "name": "Lina S. Mohjazi"}], "citations": [{"paperId": "cbc646fbbe53cc21df15d401c59cf4a767ec9f64", "title": "Deep Reinforcement Learning Enhanced Rate-Splitting Multiple Access for Interference Mitigation"}, {"paperId": "830d2a5c310314e960637f15c0a72954b6a80d72", "title": "Performance analysis of successive di-state full-duplex cooperative wireless cellular networks"}, {"paperId": "45ba2323c9b2f09143d8ba359aeed5280c69a726", "title": "Advancing 6G-IoT networks: Willow catkin packet transmission scheduling with AI and bayesian game-theoretic approach-based resource allocation"}, {"paperId": "e131ed781c96d39e6c23809d7e07265e56031cb9", "title": "ORANUS: Latency-tailored Orchestration via Stochastic Network Calculus in 6G O-RAN"}, {"paperId": "83ad4bb9699beac1427ba75a5bd6a54d17e6ab30", "title": "Evaluating the Latency Impact for Time-Critical Operational Technology Applications of Transitioning IEC-61850 GOOSE Operations to 5G"}, {"paperId": "094337a72ee69794d10f7dc9684d8be293f35358", "title": "Internet of Mirrors for Connected Healthcare and Beauty: A Prospective Vision"}, {"paperId": "58bfc7769e076efbe74661d24ccef0deee9ff692", "title": "Recent developments, application cases, and lingering issues on the path to a 6G IoT"}, {"paperId": "d29c948742aa93ff1a6241f0c3930e077bd9239f", "title": "Transmission analysis by using federated machine learning model in optical access networks based multi-agent communication and routing system"}, {"paperId": "2f85e3d83760bb67d2188d88b96621e85490ccce", "title": "Enabling Programmable Deterministic Communications in 6G"}, {"paperId": "023dcdd032ac971a13f61885a350e5d4e3716b44", "title": "Efficient Data Communication for Deep Learning Application via Latent Code Transmission in B5G Wireless Networks"}, {"paperId": "c167677b38490e58f313c96204b23dee091f4381", "title": "Edge Learning for 6G-Enabled Internet of Things: A Comprehensive Survey of Vulnerabilities, Datasets, and Defenses"}, {"paperId": "82114021072b910f50945edab1fd1fa878e4f930", "title": "Scheduling periodic messages on a shared link"}]}
