{"paperId": "241ef0bcba5e7236846105062c9d99e0cfa297e2", "publicationVenue": null, "title": "SWARMGRAPH: Analyzing Large-Scale In-Memory Graphs on GPUs", "abstract": "Graph computation has attracted a significant amount of attention since many real-world data come in the format of graph. Conventional graph platforms are designed to accommodate a single large graph at a time, while simultaneously processing a large number of in-memory graphs whose sizes are small enough to fit into the device memory are ignored. In fact, such a computation framework is needed as the in-memory graphs are ubiquitous in many applications, e.g., code graphs, paper citation networks, chemical compound graphs, and biology graphs. In this paper, we design the first large-scale in-memory graphs computation framework on Graphics Processing Units (GPUs), SWARMGRAPH. To accelerate single graph computation, SWARMGRAPH comes with two new techniques, i.e., memory-aware data placement and kernel invocation reduction. These techniques leverage the fast memory components in GPU, remove the expensive global memory synchronization, and reduce the costly kernel invocations. To rapidly compute many graphs, SWARMGRAPH pipelines the graph loading and computation. The evaluations on large-scale real-world and synthetic graphs show that SWARMGRAPH significantly outperforms the state-of-theart CPU- and GPU-based graph frameworks by orders of magnitude.", "venue": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "52-59"}, "authors": [{"authorId": "3028841", "name": "Yuede Ji"}, {"authorId": "1390915579", "name": "Hang Liu"}, {"authorId": "2107466791", "name": "H. H. Huang"}], "citations": [{"paperId": "27a51a16f08ac4e997b71af7bcda2407e0de48ba", "title": "Peek: A Prune-Centric Approach for K Shortest Path Computation"}, {"paperId": "0fe62fa57a9c7502a15ea17c4545752c9f625d47", "title": "BugGraph: Differentiating Source-Binary Code Similarity with Graph Triplet-Loss Network"}, {"paperId": "7eab68e8c66e6fc56138dc5e16bed3e89ff4abf8", "title": "iSpan: Parallel Identification of Strongly Connected Components with Spanning Trees"}, {"paperId": "36c08430d84d9d5ffb17c878fa538e4c674a188a", "title": "Vestige: Identifying Binary Code Provenance for Vulnerability Detection"}]}
