{"paperId": "24258df418a103638f30ab6e189558940058283f", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Big-BOE: Fusing Spanish Official Gazette with Big Data Technology", "abstract": "The proliferation of new data sources, stemmed from the adoption of open-data schemes, in combination with an increasing computing capacity causes the inception of new type of analytics that process Internet of things with low-cost engines to speed up data processing using parallel computing. In this context, the article presents an initiative, called BIG-Boletín Oficial del Estado (BOE), designed to process the Spanish official government gazette (BOE) with state-of-the-art processing engines, to reduce computation time and to offer additional speed up for big data analysts. The goal of including a big data infrastructure is to be able to process different BOE documents in parallel with specific analytics, to search for several issues in different documents. The application infrastructure processing engine is described from an architectural perspective and from performance, showing evidence on how this type of infrastructure improves the performance of different types of simple analytics as several machines cooperate.", "venue": "Big Data", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-01", "journal": {"name": "Big data", "pages": "\n          124-138\n        ", "volume": "6 2"}, "authors": [{"authorId": "1398856686", "name": "P. Basanta-Val"}, {"authorId": "143784576", "name": "Luis Sánchez-Fernández"}], "citations": [{"paperId": "2e1177b51d2fe76c84b93dd7fa3167055494f1a7", "title": "DODFMiner: An automated tool for Named Entity Recognition from Official Gazettes"}, {"paperId": "6139153a568977dfe1e46f917bc5da92a0086d18", "title": "Construction of a Legal System of Corporate Social Responsibility Based on Big Data Analysis Technology"}, {"paperId": "078b2811967858017aed721998b3e3ff2466f96e", "title": "Outbound Data Legality Analysis in CPTPP Countries under the Environment of Cross-Border Data Flow Governance"}, {"paperId": "810c8f236a248c6eb9cd622f8e7ff38483e53a5c", "title": "Talking about the Innovative Application of Big Data in Enterprise Human Resources Performance Management"}, {"paperId": "435ef88217a961884ccad27de70dcb19f40bafe1", "title": "Teaching Method of Japanese Professional Writing Course Based on Big Data Fusion"}, {"paperId": "7f7ab04c26bcfcac076986f129eb1bbe24846e7f", "title": "A Big Data Integration Platform for Ideological and Political Education for Smart Campuses"}, {"paperId": "70a4360f76a7982caa1df366b36379c5484fe7b9", "title": "Design of Intelligent Educational Administration System Based on Big Data Technology"}, {"paperId": "7ab1c70fb03f04395445dc7f880745eb21cbfc16", "title": "Deep Matrix Factorization With Implicit Feedback Embedding for Recommendation System"}]}
