{"paperId": "242f9cef08c8f0b9deaf08b0dd5abc49721853b3", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Multi-Prototypes Convex Merging Based K-Means Clustering Algorithm", "abstract": "K-Means algorithm is a popular clustering method. However, it has two limitations: 1) it gets stuck easily in spurious local minima, and 2) the number of clusters k has to be given a priori. To solve these two issues, a multi-prototypes convex merging based K-Means clustering algorithm (MCKM) is presented. First, based on the structure of the spurious local minima of the K-Means problem, a multi-prototypes sampling (MPS) is designed to select the appropriate number of multi-prototypes for data with arbitrary shapes. A theoretical proof is given to guarantee that the multi-prototypes selected by MPS can achieve a constant factor approximation to the optimal cost of the K-Means problem. Then, a merging technique, called convex merging (CM), merges the multi-prototypes to get a better local minima without k being given a priori. Specifically, CM can obtain the optimal merging and estimate the correct k. By integrating these two techniques with K-Means algorithm, the proposed MCKM is an efficient and explainable clustering algorithm for escaping the undesirable local minima of K-Means problem without given k first. Experimental results performed on synthetic and real-world data sets have verified the effectiveness of the proposed algorithm.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-14", "journal": {"name": "ArXiv", "volume": "abs/2302.07045"}, "authors": [{"authorId": "46598863", "name": "Dong-Yuan Li"}, {"authorId": "34678057", "name": "Shuisheng Zhou"}, {"authorId": "40227204", "name": "T. Zeng"}, {"authorId": "145977909", "name": "R. Chan"}], "citations": [{"paperId": "f55d184fa0e166cefa8437cac012822c78590c51", "title": "UniForCE: The Unimodality Forest Method for Clustering and Estimation of the Number of Clusters"}]}
