{"paperId": "2439e4e49ba82b966b79423c4a0b18dc8d210be1", "publicationVenue": {"id": "b827eced-82ea-44e6-b6d3-e8dfd4d8f000", "name": "Bulletin of Electrical Engineering and Informatics", "type": "journal", "alternate_names": ["Bull Electr Eng Informatics"], "issn": "2089-3191", "alternate_issns": ["2302-9285"], "url": "https://web.archive.org/web/20180818122233/http:/portalgaruda.org/portalgaruda/journals/index.php/EEI/issue/archive", "alternate_urls": ["http://beei.org/index.php/EEI"]}, "title": "Analyzing the relationship between information technology jobs advertised on-line and skills requirements using association rules", "abstract": "Online job vacancy sites have become an important source of information about the characteristics of labor market demand. It has become an avenue for job matching by both employers and employees and to study and analyze the labor market. This study proposed a methodology for identifying and analyzing skill-job relationships using frequency word occurrences of skills as a requirement of the job. It employed association rule mining which aims to discover frequent patterns, relationships among a set of items in the database. It collected published job vacancy data to IT job and skills requirements from various job portal websites. The proposed job skill requirements for specific I.T. jobs published online analyzing using the FP-growth algorithm of association rule provide a new dimension in labor market research. The study revealed that skill words are highly related to a certain job requirement. The results of the study could provide insights on the gap between the school acquired skills and actual IT industry skill needs and as the basis for curriculum enhancement and policy-making interventions by the Philippine government in its educational system.", "venue": "Bulletin of Electrical Engineering and Informatics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-10-01", "journal": {"name": "Bulletin of Electrical Engineering and Informatics"}, "authors": [{"authorId": "70319235", "name": "Frederick F. Patacsil"}, {"authorId": "2055855167", "name": "Michael E. Acosta"}], "citations": [{"paperId": "a1abc4a48bde8f66a6b4650f70cd1954adcab21f", "title": "Academic Community and Practitioner Perceptions on Information Technology Competencies: A Gap Analysis"}, {"paperId": "2fc49aafa340f21ecd9a4740812389a8837f214f", "title": "A Comprehensive Survey of Artificial Intelligence Techniques for Talent Analytics"}, {"paperId": "ef20799237b0a099104d44f17d2139489557aeaf", "title": "Analysis of the dealer car service spare range using the FP-Growth algorithm"}]}
