{"paperId": "247167e6e1c051c8e479976580738e7ad6266800", "publicationVenue": {"id": "5af914e6-d887-4cb3-83e9-d47c500c3f6c", "name": "Facta Universitatis Series Automatic Control and Robotics", "alternate_names": ["Facta Univ Ser Autom Control Robot"], "issn": "1820-6417", "url": "http://facta.junis.ni.ac.rs/acar/acar.html"}, "title": "BIG MOBILITY DATA ANALYTICS FOR TRAFFIC MONITORING AND CONTROL", "abstract": "With the overpopulation of large cities, the problems with citizens’ mobility, transport inefficiency, traffic congestions and environmental pollution caused by the heavy traffic require advanced ITS solutions to be overcome. Recent advances and wide proliferation of mobile and Internet of Things (IoT) devices, carried by people, built in vehicles and integrated in a road infrastructure, enable collection of large scale data related to mobility and traffic in smart cities, still with a limited use in real world applications. In this paper, we propose the traffic monitoring, control and adaptation platform, named TrafficSense, based on Big Mobility Data processing and analytics. It provides a continuous monitoring of a traffic situation and detection of important traffic parameters, conditions and events, such as travel times along the street segments and traffic congestions in real time. Upon detecting a traffic congestion on an intersection, the TrafficSense application leverages the feedback control loop mechanism to provide a traffic adaptation based on the dynamic configuration of traffic lights duration in order to increase the traffic flows in critical directions at the intersections. We tested and evaluated the developed application on the distributed cloud computing infrastructure. By varying the streaming workload and the cluster parameters we show the feasibility and applicability of our approach and the platform.", "venue": "Facta Universitatis Series Automatic Control and Robotics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-08", "journal": {"name": "Facta Universitatis, Series: Automatic Control and Robotics"}, "authors": [{"authorId": "39732336", "name": "N. Stojanović"}, {"authorId": "145423827", "name": "D. Stojanović"}], "citations": [{"paperId": "a2df9665437f8eaecd65b495cbb44e8d9fd47fab", "title": "On the Problem of Developing a Fault-Tolerant High-Loaded Cluster of Support for an Intelligent Transportation System"}, {"paperId": "e2564f1b4b0ab822d8f76cb1c64b5f6403a379cc", "title": "Exploring the Potentials of Open-Source Big Data and Machine Learning in Shared Mobility Fleet Utilization Prediction"}, {"paperId": "4c9a98f1132202049becc799032efa15d01d386e", "title": "Event-Driven Deep Learning for Edge Intelligence (EDL-EI)"}]}
