{"paperId": "247bc3f8513924c84b8ad051522d9f57b535d3a3", "publicationVenue": {"id": "92e50051-bc20-49bb-9a4a-24dd922b146f", "name": "IEEE Systems Conference", "type": "conference", "alternate_names": ["SysCon", "IEEE Syst Conf"]}, "title": "Deploying Different Clustering Techniques on a Collaborative-based Movie Recommender", "abstract": "Recommendation systems are involved in many industries, for example (e-health, transportation, e-commerce, and agriculture), where Recommendation systems aim to benefit both market and user levels. They help consumers make the right decision based on their preferences without being exposed to data overload. Nowadays, there is a wide range of recommenders based on different filtering approaches, such as Collaborative-based, Content-based, hybrid-based, demographic-based filtering approaches. In this paper, we present clustering-based recommendation systems. We also experiment and show the results for a collaborative-based movie recommender using different clustering techniques such as Kmeans, BIRCH Balanced Iterative Reducing and Clustering using Hierarchies) and DBSCAN (Density-based Spatial Clustering of Applications with Noise). We intended to choose different clustering approaches such as partitional, hierarchical, and density-based clustering approaches. We incorporated Item-based Collaborative filtering, then applied multiple clustering techniques on the dataset based on the users’ ratings. We checked the performance using accuracy measures such as MAE (Mean Absolute Error), RMSE (Root mean square error), and the computed time. These measures were calculated for analysis and comparison purposes.", "venue": "IEEE Systems Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-15", "journal": {"name": "2021 IEEE International Systems Conference (SysCon)", "pages": "1-6"}, "authors": [{"authorId": "1994536695", "name": "Dina Nawara"}, {"authorId": "2279618771", "name": "R. Kashef"}], "citations": [{"paperId": "fa2018033de9b890a6089970c3500ef83bef7742", "title": "MCARS-CC: A Salable Multicontext-Aware Recommender System"}, {"paperId": "cc3846e4023779970a0097dfb23afd0fb17f83e9", "title": "Forecasting The Price of the Flight Tickets using A Novel Hybrid Learning model"}, {"paperId": "8fc1a6c5d69429cf104d95432d5a1f1c226ab9ae", "title": "Bengali Movie Recommendation System using K Nearest Neighbor and Cosine Similarity"}, {"paperId": "72fbee06242c35b621cc9877d5eb1ebc8d11f4ef", "title": "Multi-Context Recommendation Systems (CARS) in Autonomous Driving and Other Applications"}, {"paperId": "818476f934f21f3e0823702118e5fa2d0fd1421a", "title": "Homogenous and Heterogenous Parallel Clustering: An Overview"}, {"paperId": "a97e2f6ff06ccd2cbadff661b8d9263a70afbbe3", "title": "Context-Aware Recommendation Systems in the IoT Environment (IoT-CARS)–A Comprehensive Overview"}]}
