{"paperId": "247ec99d5d53fac41fdbda239572f0a92c6361c2", "publicationVenue": {"id": "1bbe62b5-6321-4644-a043-c05b37f8259f", "name": "International Journal of Computing and Digital Systems", "type": "journal", "alternate_names": ["Int J Comput Digit Syst"], "issn": "2210-142X", "url": "http://journals.uob.edu.bh/ijcds"}, "title": "Towards a Scalable and Efficient ETL", "abstract": ": Extract, transform, and load (ETL) processes are crucial for building repositories of data from a variety of self-contained sources. Despite their complexity and cost, ETL processes have demonstrated some maturity for traditional, XML, and graph data sources. However the main challenge for ETL processes is double: (1) they do not scale when brought down to managing large and highly varied data sources, involving web-data. (2) the deployment of the target data warehouse in a polystore. The paper reviews various research e ff orts along this line of research. The paper then proposes a conceptual modeling of these processes using BPMN (Business Process Modeling Notation). These processes are automatically converted to scripts to be implemented within Spark framework. The solution is packaged according a new distributed architecture (Open ETL) that supports both batch and stream processing. To make our new approach more concrete and evaluable, a real case study using the LUBM benchmark, which involves heterogeneous data sources is considered.", "venue": "International Journal of Computing and Digital Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-01", "journal": {"name": "International Journal of Computing and Digital Systems"}, "authors": [{"authorId": "2224444227", "name": "El Yazid Gueddoudj"}, {"authorId": "3114993", "name": "A. Chikh"}], "citations": [{"paperId": "84afcdcc0d42ff7b6cbf5e53a320cf0fce5f6612", "title": "A Model for Enhancing Unstructured Big Data Warehouse Execution Time"}, {"paperId": "e33e672fd04c2367a45b3271b36aac829451a468", "title": "Hallucination-minimized Data-to-answer Framework for Financial Decision-makers"}]}
