{"paperId": "24959332d6b820ffba7d50ded2d7e782ebc47c9e", "publicationVenue": {"id": "49f8ba44-ceca-4e39-93cd-71a3236d5581", "name": "FEMS Microbiology Reviews", "type": "journal", "alternate_names": ["Fems Microbiol Rev", "Fems Microbiology Reviews", "FEMS Microbiol Rev"], "issn": "0168-6445", "url": "https://academic.oup.com/femsre/issue"}, "title": "Praemonitus praemunitus: can we forecast and prepare for future viral disease outbreaks?", "abstract": "Understanding the origins of past and present viral epidemics is critical in preparing for future outbreaks. Many viruses, including SARS-CoV-2, have led to significant consequences not only due to their virulence, but also because we were unprepared for their emergence. We need to learn from large amounts of data accumulated from well-studied, past pandemics and employ modern informatics and therapeutic development technologies to forecast future pandemics and help minimize their potential impacts. While acknowledging the complexity and difficulties associated with establishing reliable outbreak predictions, herein we provide a perspective on the regions of the world that are most likely to be impacted by future outbreaks. We specifically focus on viruses with epidemic potential, namely SARS-CoV-2, MERS-CoV, DENV, ZIKV, MAYV, LASV, noroviruses, influenza, Nipah virus, hantaviruses, Oropouche virus, MARV, and Ebola virus, which all require attention from both the public and scientific community to avoid societal catastrophes like COVID-19. Based on our literature review, data analysis, and outbreak simulations, we posit that these future viral epidemics are unavoidable, but that their societal impacts can be minimized by strategic investment into basic virology research, epidemiological studies of neglected viral diseases, and antiviral drug discovery.", "venue": "FEMS Microbiology Reviews", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-18", "journal": {"name": "FEMS microbiology reviews"}, "authors": [{"authorId": "1990510059", "name": "Zoe L. Sessions"}, {"authorId": "1742265335", "name": "Tesia M. Bobrowski"}, {"authorId": "143736640", "name": "H. Martin"}, {"authorId": "2188751279", "name": "Jon-Michael T Beasley"}, {"authorId": "2232403911", "name": "Aneri Kothari"}, {"authorId": "2232403893", "name": "Trevor Phares"}, {"authorId": "2112111917", "name": "Michael Li"}, {"authorId": "145086231", "name": "Vinicius M. Alves"}, {"authorId": "2898751", "name": "M. Scotti"}, {"authorId": "5002978", "name": "Nathaniel J. Moorman"}, {"authorId": "3209833", "name": "R. Baric"}, {"authorId": "1719685", "name": "A. Tropsha"}, {"authorId": "2243882", "name": "E. Muratov"}], "citations": [{"paperId": "54398a7119cf75a5005d41fa4333b8ea85991190", "title": "Oropouche virus: A neglected global arboviral threat"}, {"paperId": "1225ce00815499dfd7f7c059d6f5870efa3a3324", "title": "Lycorine derivative effectively inhibits the replication of coronaviruses both in vitro and in vivo"}, {"paperId": "f88953dbf4fd5808e6cc581b2d669adec16a19e7", "title": "Small molecule antiviral compound collection (SMACC): A comprehensive, highly curated database to support the discovery of broad-spectrum antiviral drug molecules"}]}
