{"paperId": "249b1005a6cc7a278969368ad3430ecf9a3977ff", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Big Data and the United Nations Sustainable Development Goals (UN SDGs) at a Glance", "abstract": "The launch of the United Nations (UN) 17 Sustainable Development Goals (SDGs) in 2015 was a historic event, uniting countries around the world around the shared agenda of sustainable development with a more balanced relationship between human beings and the planet. The SDGs affect or impact almost all aspects of life, as indeed does the technological revolution, empowered by Big Data and their related technologies. It is inevitable that these two significant domains and their integration will play central roles in achieving the 2030 Agenda. This research aims to provide a comprehensive overview of how these domains are currently interacting, by illustrating the impact of Big Data on sustainable development in the context of each of the 17 UN SDGs.", "venue": "Big Data and Cognitive Computing", "year": 2021, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-28", "journal": {"name": "Big Data Cogn. Comput.", "pages": "28", "volume": "5"}, "authors": [{"authorId": "144152608", "name": "Hossein Hassani"}, {"authorId": "2118519984", "name": "Xu Huang"}, {"authorId": "100591098", "name": "S. MacFeely"}, {"authorId": "1439737741", "name": "Mohammad Reza Entezarian"}], "citations": [{"paperId": "0360d064ee1ad4063d3af22a0984c34dbeb7f437", "title": "Measuring the Impact of Green Finance on Poverty Reduction: Project of an Empirical Method"}, {"paperId": "904fc39b907559dbc620185b66dfd4e1c4c4b3f7", "title": "Big data in Earth science: Emerging practice and promise"}, {"paperId": "4980f289300eb0296546a4693c0fc574932b18bb", "title": "Urban tree failure probability prediction based on dendrometric aspects and machine learning models"}, {"paperId": "0dbcfdf6859c6650cdfa004b5fcf0b5af2335631", "title": "Does supply chain analytics adoption impacts sustainable performance? A consideration of technophobia as an influencing factor"}, {"paperId": "3e930c19bd0fa17dd41b86354ab2968fbe530b53", "title": "A sustainable health and educational goal development (SHEGD) prediction using metaheuristic extreme learning algorithms"}, {"paperId": "9c9cf89f4bcad2a2d6bccf2576814afbc9d31540", "title": "Tackling the global challenges using data-driven innovations"}, {"paperId": "2a226332fd7c35603ca21fb22497dae8b059e998", "title": "My Human Rights Smart City: Improving Human Rights Transparency Identification System"}, {"paperId": "7fc9fff50c7d8064bdb5101668db465e6dc7be34", "title": "Prioritizing implications of Industry-4.0 on the sustainable development goals: A perspective from the analytic hierarchy process in manufacturing operations"}, {"paperId": "38c33089f602905b46293f1d52f9eb62603f7cfc", "title": "Natural Resource Optimization and Sustainability in Society 5.0: A Comprehensive Review"}, {"paperId": "55a115387c916ad65bcda9440456b3ce59fb9444", "title": "Embedding patient safety in a scaffold of interprofessional education; a qualitative study with thematic analysis"}, {"paperId": "0097b47d81a33a24d9c29efd4d302d4ccb9c22c4", "title": "The evolving landscape of global regulations on genome-edited crops"}, {"paperId": "2da0b591d7a32ac538e563b2e96a589be4ccf7a2", "title": "Improving Interarea Mode Oscillation Damping in Multi-Machine Energy Systems through a Coordinated PSS and FACTS Controller Framework"}, {"paperId": "219e6313e834ceadad13e3b9de6324f1e8ca0c8e", "title": "Social Trend Mining: Lead or Lag"}, {"paperId": "3112068e689d03b241ace28f5144d0aa8e0f3fcd", "title": "Green Tea Extract Solid Dispersion Pellets with Enhanced Permeability for Hyperlipidemia"}, {"paperId": "49e654d2104839a19e8ddf2491a18418b59e8549", "title": "Advancing Sustainable Energy Transition: Blockchain and Peer-to-Peer Energy Trading in India’s Green Revolution"}, {"paperId": "bd1e6739c457067f04dd69ce8c5cc69e8e991817", "title": "Examining Progress on Sustainable Development Goals Across Regions through an Intertemporal Lens"}, {"paperId": "2035f4cc78daefa65c079b758230c77efb95358c", "title": "Sustainalism: An Integrated Socio-Economic-Environmental Model to Address Sustainable Development and Sustainability"}, {"paperId": "d6e34726bfe01bdb1e67de8a1ee6c21cc807b23c", "title": "Data sharing and data governance in sub-Saharan Africa: Perspectives from researchers and scientists engaged in data-intensive research"}, {"paperId": "b44839343b25e91db5d3332588e68dd3943a9bfc", "title": "Data like any other? Sexual and reproductive health, Big Data and the Sustainable Development Goals"}, {"paperId": "8bc94bfa8d5b15d39c56d41129016052a0b2e5ac", "title": "The IHI Rochester Report 2022 on Healthcare Informatics Research: Resuming After the CoViD-19"}, {"paperId": "305386643367be4fd0c5271fd0346df77b30d049", "title": "Analíticas de aprendizaje y su potencial para una educación de calidad sostenible"}, {"paperId": "c1e90ec00596852a7176ef320bb417936b61da2c", "title": "Investment in Forest Watershed—A Model of Good Practice for Sustainable Development of Ecosystems"}, {"paperId": "686abcfbe19ed8ee87ed5e524fdcae92dfa5fa44", "title": "A framework for Digital Transformation towards Smart Governance: using big data tools to target SDGs in Ceará, Brazil"}, {"paperId": "807cf4172037dc72f795387268030b594dc952ee", "title": "Evaluation of the Sustainable Development of Macau, Based on the BP Neural Network"}, {"paperId": "1978af538f02f200a785ff88f2c696762ca4f2b7", "title": "Sustainable value creation by adopting an e-government initiative: empirical evidence from the emerging economy context"}, {"paperId": "c481b143a9afe0cae4d1449381cea5cad42d185d", "title": "Sustainable development goals for gender equality: Extracting associations among the indicators of SDG 5 using numerical association rule mining"}, {"paperId": "e7a020bcd643f5c969fd30a52dff238d8a7ac98e", "title": "Implementation Of Company Environmental Policy In Terms Of Succeeding SDGs Program To Improve Public Health"}, {"paperId": "21cf3afd5447269255898cc99772b40b0df2ac01", "title": "Data divide in digital trade, and its impacts on the digital economy: A literature review"}, {"paperId": "7c154d4a4a8a3bf39d9b1a4c52aab5744beb5f84", "title": "Impactful Digital Twin in the Healthcare Revolution"}, {"paperId": "4d29230f541e39b20cef3ae73304dc4b8dbd8b88", "title": "Decision-Making Using Big Data Relevant to Sustainable Development Goals (SDGs)"}, {"paperId": "1499e67a1022b7d47e1ad24ac7650ae797769bf5", "title": "Urban Data Science Education: A Key Actor towards Improving Data-Driven Policy-Making for Solving Urban Problems"}, {"paperId": "2cc07c3af58672ab79cfdac5205a16ddde4c69fd", "title": "Establishment of big data evaluation model for green and sustainable development of environment"}, {"paperId": "b138d0292fd5147a9dfe35284e3edbe6962a18f5", "title": "Are Global Environmental Uncertainties Inevitable? Measuring Desertification for the SDGs"}, {"paperId": "ecdd9cb4c7210e76a040dbb3f9ecab8bfd726ba1", "title": "The Use of Big Data via 5G to Alleviate Symptoms of Acute Stress Disorder Caused by Quarantine Measures"}, {"paperId": "2e28f244c28e1e3ac17c2b1ff336312965d6b5b0", "title": "The Contribution of Data-Driven Technologies in Achieving the Sustainable Development Goals"}, {"paperId": "b885b17ae01623b6cda389ec2d5d60bcf4b1369b", "title": "Vinculum of Sustainable Development Goal Practices and Firms’ Financial Performance: A Moderation Role of Green Innovation"}, {"paperId": "a7b147452518a5cfa7f21f85e456ff296bd644b2", "title": "A theory of digital technology advancement to address the grand challenges of sustainable development"}, {"paperId": "ff266ac92d84a25676bde5e03d059bf6667c5de3", "title": "The Role of National Centers in Sustainable Development of Pakistan"}, {"paperId": "23feba987d21625f75e7cce6abcef9555232016b", "title": "Dataset Modelling of the Financial Risk Management of Social Entrepreneurship in Emerging Economies"}, {"paperId": "19425c259981535f07f14c55b600bc744839ae5e", "title": "Evaluating the role of partnerships in increasing the use of big Earth data to support the Sustainable Development Goals: an Australian perspective"}, {"paperId": "813106acd36ddb8ba26c0acb114f26ae906e2cf2", "title": "Big-Data Management: A Driver for Digital Transformation?"}, {"paperId": "0e4fc7c655ff6b3838d13a9ca5ced468de65dd50", "title": "Accuracy Improvement of Non-Intrusive Load Monitoring Using Voting-Based Consensus Clustering"}]}
