{"paperId": "24a1c85433fb11620e770d860acac1c2baef1a46", "publicationVenue": {"id": "ff159887-5591-495e-8a29-710e87e64127", "name": "International Journal of Production Research", "type": "journal", "alternate_names": ["Int J Prod Res"], "issn": "0020-7543", "url": "http://www.tandfonline.com/loi/tprs20"}, "title": "Freight delivery in a Physical Internet Supply Chain: an applied optimisation model with peddling and shipment consolidation", "abstract": "The delivery of goods (freight) accounts for the major cost and emissions in logistics systems worldwide. The effective management of the supply chain requires logistical efficiency and sustainability. Several logistics performance measurements such as distances driven and fuel efficiency are also indicators of sustainability. As an emerging paradigm, the Physical Internet (PI) addresses logistical, societal, and sustainability goals. However, the question remains whether some aspects of logistical efficiency in traditional logistics could be incorporated into the PI paradigm. To this effect, we examine how peddling, a consolidation strategy in traditional logistics, can enhance PI supply chain. Specifically, we formulate optimisation models and study the case of a Mexican automotive supply chain from both the PI and traditional logistics perspectives by comparing three different configurations; namely, Model P built on PI, Model S based on conventional standard peddling, and Model H, a hybrid. The hybrid Model H is optimised in a two-phase solution framework. We show via the case of a Mexican automotive supply chain that Model H outperforms others on average distance travelled and truck utilisation. Thereby, it is concluded that appropriate peddling and shipment consolidation policies may enhance PI supply chain logistics performance.", "venue": "International Journal of Production Research", "year": 2021, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-13", "journal": {"name": "International Journal of Production Research", "pages": "4995 - 5011", "volume": "60"}, "authors": [{"authorId": "1578125935", "name": "Simranjeet S. Chadha"}, {"authorId": "2868765", "name": "M. Ülkü"}, {"authorId": "2900048", "name": "U. Venkatadri"}], "citations": [{"paperId": "ce9853f00e8343d28088feabbe90715bd3f986fa", "title": "Resilience-oriented approach of dynamic production and maintenance scheduling optimisation considering operational uncertainty"}, {"paperId": "d361d73d570b6db4a38eff9a0906e248d8b5d13e", "title": "Cloud material handling systems: a cyber-physical system to enable dynamic resource allocation and digital Interoperability"}, {"paperId": "5cc2d79f548ad95e59f7d4b4788193728cd12b5e", "title": "Blockchain-enabled integrated model for production-inventory-delivery problem in Physical Internet"}, {"paperId": "ffc33a7feccc660d00357d721ac9de22b4cdb666", "title": "A dynamic and reactive routing protocol for the physical internet network"}, {"paperId": "a57d8e1f616238297ee9233f9a0116c7fc70de87", "title": "A three-phase heuristic for last-mile delivery with spatial-temporal consolidation and delivery options"}, {"paperId": "578f598387f1de9aed52d116da041951842ec7ec", "title": "On the value of shipment consolidation and machine learning techniques for the optimal design of a multimodal logistics network"}, {"paperId": "f181b3df97f232c1efe1451aa6bd013574e4b4f9", "title": "Toward Greening City Logistics: A Systematic Review on Corporate Governance and Social Responsibility in Managing Urban Distribution Centers"}, {"paperId": "113267c49fa196590806c7b498bd637ed2501568", "title": "Exploitation of material consolidation trade-offs in a multi-tier complex supply networks"}, {"paperId": "6e68b86799b8ae982d8854f45b57d8b57c4c23e1", "title": "Meta-heuristics for sustainable supply chain management: a review"}, {"paperId": "f463c665ab908a3dd410544c3612f7bf7b1c863a", "title": "Optimal Internet of Things Technology Adoption Decisions and Pricing Strategies for High-Traceability Logistics Services"}, {"paperId": "c72f8598132cee78402a8b105b6296a1e00fa543", "title": "On Deploying Blockchain Technologies in Supply Chain Strategies and the COVID-19 Pandemic: A Systematic Literature Review and Research Outlook"}]}
