{"paperId": "24a60edb02da6bace306c267e60baea4b5e3460a", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Security Challenges in Industry 4.0 PLC Systems", "abstract": "The concept of the fourth industrial revolution assumes the integration of people and digitally controlled machines with the Internet and information technologies. At the end of 2015, more than 20 billion machines and devices were connected to the Internet, with an expected growth to half a trillion by 2030. The most important raw material for this digital revolution is data, which when properly stored, analyzed and secured, constitute the basis for the development of any business. In times of rapid industrial development, automation of production processes and systems integration via networks, the effective protection of the cyber-physical systems of a plant is particularly important. To minimize the risks associated with Internet access, one must define all the possible threats and determine their sources in the plant and block or minimize the possibility of sabotage or data loss. This article analyzes the security measures used in industrial systems. In particular, risk management and the study of the risk sources in terms of human, hardware and software aspects in networked PLC and SCADA systems are discussed. Methods of improving the architecture of industrial networks and their management are proposed in order to increase the level of security. Additionally, the safety of the communication protocols with PLCs in industrial control systems is discussed.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-20", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "98798890", "name": "Janusz Hajda"}, {"authorId": "2237561", "name": "Ryszard Jakuszewski"}, {"authorId": "3466821", "name": "S. Ogonowski"}], "citations": [{"paperId": "8b51b9f5e30ed8890c021a00c0a99b3f6f61f17a", "title": "SCADvanceXP—an intelligent Polish system for threat detection and monitoring of industrial networks"}, {"paperId": "f13390304e4ca280f5921d7907c343725d01b21b", "title": "Review of Industry 4.0 from the Perspective of Automation and Supervision Systems: Definitions, Architectures and Recent Trends"}, {"paperId": "2bf1b30c2af9fe992858a692f9a2836443fcd8ed", "title": "Securing Industrial Control Systems: Components, Cyber Threats, and Machine Learning-Driven Defense Strategies"}, {"paperId": "9788fd33f936f5164c4a59585aad43edce33110f", "title": "Digital Twins and the Future of Their Use Enabling Shift Left and Shift Right Cybersecurity Operations"}, {"paperId": "d2704b3f87f0ec205c29a04f608f286cd49380d8", "title": "Risk-Management Framework and Information-Security Systems for Small and Medium Enterprises (SMEs): A Meta-Analysis Approach"}, {"paperId": "c251919efe22dfe99aa6d842770daa25cf20be69", "title": "Combining Models for Safety and Security Concerns in Automating Digital Production"}, {"paperId": "0724dfc64566c8ac67cb8305890ccf543053c43d", "title": "Cybersecurity in Cyber–Physical Power Systems"}, {"paperId": "36979dbbb1ea04979f91fbd2642cc4b9664574fa", "title": "The Path to Fault- and Intrusion-Resilient Manycore Systems on a Chip"}, {"paperId": "9260131233c176922dc33cac36097db7394407af", "title": "A Digital Twin-Based Distributed Manufacturing Execution System for Industry 4.0 with AI-Powered On-The-Fly Replanning Capabilities"}, {"paperId": "a56a47380a1843fbd5360f7d486130ff7679612e", "title": "A Survey on Programmable Logic Controller Vulnerabilities, Attacks, Detections, and Forensics"}, {"paperId": "14a69ef8b64930f8327abbb82a89b2d111d11e65", "title": "Design of PLC Control System by Micro-Automation Equipment"}, {"paperId": "c724e23424e4886c0bfdc8d69f9c6ae16620e12d", "title": "PLC Cybersecurity Test Platform Establishment and Cyberattack Practice"}, {"paperId": "99a8064908a898a2cb881befbb058999bbf4b00c", "title": "Fresh Approaches for Structured Text Programmable Logic Controllers Programs Verification"}, {"paperId": "182f9403f7c37f9d12261569a006e145dbdf0358", "title": "Safety of Control Systems with Dual Architecture Based on PLCs"}, {"paperId": "2578443e0978b0d1f663bab7e67f2df713b0c6e6", "title": "Internet of Things: Development Intelligent Programmable IoT Controller for Emerging Industry Applications"}, {"paperId": "9e7f87f834d7e0df52524bb660829c040e881c2c", "title": "An Intelligent System to Detect Advanced Persistent Threats in Industrial Internet of Things (I-IoT)"}, {"paperId": "6c34f93dbcb34e259114f3fcaaeb202c495ca3cb", "title": "A Situation Based Predictive Approach for Cybersecurity Intrusion Detection and Prevention Using Machine Learning and Deep Learning Algorithms in Wireless Sensor Networks of Industry 4.0"}, {"paperId": "68dce475459d7a583f22c11e19273af335a6ce7f", "title": "Security of Programmable Logic Controllers and Related Systems: Today and Tomorrow"}]}
