{"paperId": "24aee7042a4d121ab69dc2a3c088e5e15a8a5a2e", "publicationVenue": null, "title": "Applications of Machine Learning in Digital Forensics", "abstract": "Digital forensics (DF) has become a substantial process to perform in depth investigations. But due to the digitalization, the potential Data volumes are increasing and hence it has become difficult to analyze them. Machine Learning (ML) is a panacea in this regard. It not only facilitates the analysis process but also yields accurate results. Therefore, with a focus on DF, this paper surveys a wide range of publications mentioning ML based techniques that can be used to ease the process of DF principally in the field of malware, network forensics, image/video forensics, and mobile/memory forensics. The results of the review show that ML is a fast and reliable procedure and needs to be explored more actively, particularly in DF field. The results are also used to develop a conceptual framework for a general procedure of ML based Digital Forensics.", "venue": "2021 International Conference on Digital Futures and Transformative Technologies (ICoDT2)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-05-20", "journal": {"name": "2021 International Conference on Digital Futures and Transformative Technologies (ICoDT2)", "pages": "1-8"}, "authors": [{"authorId": "2179793", "name": "S. Qadir"}, {"authorId": "2106686004", "name": "Basirah Noor"}], "citations": [{"paperId": "86e3319d97027e7309a86bed2071aba0c0093201", "title": "Enhancements in the world of digital forensics"}, {"paperId": "8fc83327fc1d9074fa2257b4e57ec225ea41820a", "title": "Forensic Science and How Statistics Can Help It: Evidence, Hypothesis Testing, and Graphical Models"}, {"paperId": "13c0364cc7efe33f6ea84e8d5f9905fa65dbfc54", "title": "A Comprehensive Analysis of the Role of Artificial Intelligence and Machine Learning in Modern Digital Forensics and Incident Response"}, {"paperId": "7daac2f766bd288d18fd4aeba156dc3192fe594d", "title": "Applications of Machine Learning in Cloud Forensics"}, {"paperId": "1cecb39e472e7fe78ea3f665b8fa793b1d88debc", "title": "Machine learning as new approach for predicting of maxillary sinus volume, a sexual dimorphic study"}, {"paperId": "6bc63c6164e495f99032fdbad0a229e8244784c1", "title": "A comprehensive taxonomy on multimedia video forgery detection techniques: challenges and novel trends"}, {"paperId": "28d449f0c2a81631dd79f737c952c2d081dbbe47", "title": "A Predictive Classification Model for Identifying Conversation-related Mobile Forensic Data in Instant Messaging Applications"}, {"paperId": "8e663d48bd85506e2fbbb8dfc1d5815dc6f0b936", "title": "ForTrace - A holistic forensic data set synthesis framework"}]}
