{"paperId": "24b524dd62a450f2c4b3a2419cc06ea9e8fa7d24", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Analysis of Geological Hazard Susceptibility of Landslides in Muli County Based on Random Forest Algorithm", "abstract": "Landslides seriously threaten human life and property. The rapid and accurate prediction of landslide geological hazard susceptibility is the key to disaster prevention and mitigation. Traditional landslide susceptibility evaluation methods have disadvantages in terms of factor classification and subjective weight determination. Based on this, this paper uses a random forest model built using Python language to predict the landslide susceptibility of Muli County in western Sichuan and outputs the factor weight and model accuracy. The results show that (1) the three most important factors are elevation, distance from the road, and average annual rainfall, and the sum of their weights is 67.54%; (2) the model’s performance is good, with ACC = 99.43%, precision = 99.3%, recall = 99.48%, and F1 = 99.39%; (3) the landslide development and susceptibility zoning factors are basically the same. Therefore, this model can effectively and accurately evaluate regional landslide susceptibility. However, there are some limitations: (1) the landslide information statistical table is incomplete; (2) there are demanding requirements in terms of training concentration relating to the definition of landslide and non-landslide point sets, and the landslide range should be accurately delineated according to field surveys.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-28", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2187913193", "name": "Xiaoyi Wu"}, {"authorId": "2210508246", "name": "Yuanbao Song"}, {"authorId": "92896059", "name": "W. Chen"}, {"authorId": "2180646862", "name": "Guichuan Kang"}, {"authorId": "2065873456", "name": "R. Qu"}, {"authorId": "2107960337", "name": "Zhifei Wang"}, {"authorId": "2109784793", "name": "Jiaxian Wang"}, {"authorId": "153092811", "name": "Pengyi Lv"}, {"authorId": "2210475497", "name": "Han Chen"}], "citations": [{"paperId": "03a8932962f0e610cf4e9548200f691287dff31d", "title": "Multi-defect risk assessment in high-speed rail subgrade infrastructure in China"}, {"paperId": "06b38ec16e6e0462d7f7c2056a8958811e022cae", "title": "Landslide hazard susceptibility evaluation based on SBAS-InSAR technology and SSA-BP neural network algorithm: A case study of Baihetan Reservoir Area"}, {"paperId": "caf3d5f270b05b49d04ebd6f105f1461c1f262b8", "title": "Landslide susceptibility mapping using the uncertain and parameter free density-based clustering (UPFDBCAN) algorithm"}, {"paperId": "77456016e1f76139ad7d5e6d38ac59ed07099cc7", "title": "Evaluating the influence of road construction on landslide susceptibility in Saudi Arabia’s mountainous terrain: a Bayesian-optimised deep learning approach with attention mechanism and sensitivity analysis"}, {"paperId": "3c774fa5ffc74e8ffa76b3bdc897d0c95411254a", "title": "Susceptibility assessment of environmental geological disasters in Liulin County based on RF: from the perspective of positive and negative sample proportion"}, {"paperId": "96ac4cf5d6e892a2edf5e8569452816e082f8145", "title": "Geological Disaster Susceptibility Evaluation of a Random-Forest-Weighted Deterministic Coefficient Model"}, {"paperId": "a74cdc0e7d26305b8f69ffaed88b90396f23f15f", "title": "Geological Hazard Susceptibility Analysis Based on RF, SVM, and NB Models, Using the Puge Section of the Zemu River Valley as an Example"}, {"paperId": "2c9345a277a38742c455e71461347a99c6038968", "title": "Landslide Susceptibility Mapping in Guangdong Province, China, Using Random Forest Model and Considering Sample Type and Balance"}, {"paperId": "4bbcf23c117340c77c8b7b1849ee39da1426986c", "title": "Landslide Susceptibility Zoning in Yunnan Province Based on SBAS-InSAR Technology and a Random Forest Model"}]}
