{"paperId": "24e4b683b5b2703cd1b2e8c9331fba1b47fdd01f", "publicationVenue": {"id": "d65e8b4a-f9c2-45ae-9b87-090db7e872f1", "name": "International Conference on Parallel Architectures and Compilation Techniques", "type": "conference", "alternate_names": ["Int Conf Parallel Archit Compil Tech", "PACT", "Parallel Comput Technol", "Parallel Computing Technologies", "Pan African Conference Science, Computing and Telecommunications", "PaCT", "Pan Afr Conf Sci Comput Telecommun"], "url": "http://www.pactconf.org/", "alternate_urls": ["http://ssd.sscc.ru/en/conference"]}, "title": "GraphMini: Accelerating Graph Pattern Matching Using Auxiliary Graphs", "abstract": "Graph pattern matching is a fundamental problem encountered by many common graph mining tasks and the basic building block of several graph mining systems. This paper explores for the first time how to proactively prune graphs to speed up graph pattern matching by leveraging the structure of the query pattern and the input graph. We propose building auxiliary graphs, which are different pruned versions of the graph, during query execution. This requires careful balancing between the upfront cost of building and managing auxiliary graphs and the gains of faster set operations. To this end, we propose GraphMini, a new system that uses query compilation and a new cost model to minimize the cost of building and maintaining auxiliary graphs and maximize gains. Our evaluation shows that using GraphMini can achieve one order of magnitude speedup compared to state-of-the-art subgraph enumeration systems on commonly used benchmarks.", "venue": "International Conference on Parallel Architectures and Compilation Techniques", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-21", "journal": {"name": "2023 32nd International Conference on Parallel Architectures and Compilation Techniques (PACT)", "pages": "211-224"}, "authors": [{"authorId": "2248799681", "name": "Juelin Liu"}, {"authorId": "1944118877", "name": "Sandeep Polisetty"}, {"authorId": "2248848964", "name": "Hui Guan"}, {"authorId": "2248938735", "name": "Marco Serafini"}], "citations": []}
