{"paperId": "24ee204132ae246bc9df50c7fff3c5ed719ae600", "publicationVenue": null, "title": "Security Enhancement for IoT Systems Based on SoC FPGA Platforms", "abstract": "Security is an important issue in the era of IoT, where a large number of devices are connected. In this paper, we propose a design to enhance the security of the IoT connection using SoC FPGA platforms. The design is a successful combination of the powerful processing and system management capabilities of ARM processors and the flexibility and customizability of FPGA technology. Particularly, we have developed a Digital Signature cryptosystem on a DE10-Standard SoC FPGA board using the built-in ARM processor core and two self-developed IP cores acting as 1024-bit RSA and 256-bit SHA co-processors. Furthermore, we also applied the DMA technique to achieve high-speed data transfer. As a result, the proposed cryptosystem is compact but achieves high performance even with low frequencies. In more detail, the DMA operating at the frequency of 150 MHz can achieve a speed of 1200 Mbps. Also, the 1024-bit RSA core and the 256-bit SHA operating at the frequencies of 50 MHz and 100 MHz have throughputs of 25 Kbps and above 700 Mbps, respectively.", "venue": "2020 4th International Conference on Recent Advances in Signal Processing, Telecommunications & Computing (SigTelCom)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 4th International Conference on Recent Advances in Signal Processing, Telecommunications & Computing (SigTelCom)", "pages": "35-39"}, "authors": [{"authorId": "1752231", "name": "Huu-Thuan Huynh"}, {"authorId": "1410291328", "name": "Tuan-Kiet Tran"}, {"authorId": "1959326652", "name": "Tan-Phat Dang"}, {"authorId": "7677915", "name": "Trong-Tu Bui"}], "citations": [{"paperId": "149d0be4709307e891fe1b6a1d8ea82ee56bfcfb", "title": "A Review on Security Implementations in Soft-Processors for IoT Applications"}, {"paperId": "0212490e89a24f98807f753fdd32c326ba3dee6b", "title": "A Reliable Approach to Secure IoT Systems Using Cryptosystems Based on SoC FPGA Platforms"}]}
