{"paperId": "24fcb635129f5361f7320558330d11d2d2a0de5a", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Integration of Edge Computing and Blockchain for Provision of Data Fusion and Secure Big Data Analysis for Internet of Things", "abstract": "Intelligent computing provides efficient, real-time, and secure data analysis services for the Internet of Things (IoT). As the number of IoT devices increases, IoT generates massive, diverse, and multisourcing datasets that can be used to improve IoT services further. Models trained by intelligent computing from a single system or sensor are often not global, and sending all data directly to the computing platform wastes network bandwidth and may cause network congestion and even privacy leakage. To ensure IoT applications’ quality of service and privacy, we propose a framework that integrates edge computing and blockchain to provide lightweight data fusion and secure data analysis for IoT. We propose a lightweight data fusion method that can reduce the amount of data at the node level and prevent network congestion and bandwidth waste. Furthermore, we propose a hierarchical fuzzy hashing method to check and locate anomalies of IoT machine learning models to ensure the validity of IoT intelligent computing and the security of sensitive data. Finally, we demonstrate the effectiveness of the method proposed in this paper through experiments.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-18", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2117143164", "name": "Jingya Dong"}, {"authorId": "50828784", "name": "Chunhe Song"}, {"authorId": "1689115", "name": "Zhang Tao"}, {"authorId": "2167749915", "name": "Yuanjian Li"}, {"authorId": "2165980894", "name": "Hao Zheng"}], "citations": [{"paperId": "788119223cb52efba17acbabbc2e1453ca072a58", "title": "Integration of Federated Learning and Blockchain for the Provision of Secure Big data Analytics: Systematic Literature Review"}, {"paperId": "a8f10befc7cc04ec2a132b1df8d0dd0bd4c36ba5", "title": "Cooperative computation offloading combined with data compression in mobile edge computing system"}, {"paperId": "5044316f1a8510873c9c3ce2bb53f2fdd6102854", "title": "Decentralized peer-to-peer energy trading strategy in energy blockchain environment: A game-theoretic approach"}, {"paperId": "4db3f1b24c6b1b7e60612caad76da5b7e9ddad09", "title": "A novel cloud-edge collaboration based short-term load forecasting method for smart grid"}, {"paperId": "8acdfb1e0db441cc4c22d8487eadfd1c4dae68cd", "title": "The Development of Privacy Protection Standards for Smart Home"}, {"paperId": "25cea2277ad63828b2f03aba0dfe9fe2e3cf757c", "title": "DAON: A Decentralized Autonomous Oracle Network to Provide Secure Data for Smart Contracts"}, {"paperId": "8457ef5452ac05388f5d07787a6eadaa18452cab", "title": "Privacy-Preserving Big Data Security for IoT With Federated Learning and Cryptography"}]}
