{"paperId": "25017b33fc8259d7a3bfa40ff010a29dbbfeac1d", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Growth of relational model: Interdependence and complementary to big data", "abstract": "A database management system is a constant application of science that provides a platform for the creation, movement, and use of voluminous data. The area has witnessed a series of developments and technological advancements from its conventional structured database to the recent buzzword, bigdata. This paper aims to provide a complete model of a relational database that is still being widely used because of its well known ACID properties namely, atomicity, consistency, integrity and durability. Specifically, the objective of this paper is to highlight the adoption of relational model approaches by bigdata techniques. Towards addressing the reason for this in corporation, this paper qualitatively studied the advancements done over a while on the relational data model. First, the variations in the data storage layout are illustrated based on the needs of the application. Second, quick data retrieval techniques like indexing, query processing and concurrency control methods are revealed. The paper provides vital insights to appraise the efficiency of the structured database in the unstructured environment, particularly when both consistency and scalability become an issue in the working of the hybrid transactional and analytical database management system.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "81297679", "name": "Sucharitha Shetty"}, {"authorId": "153103104", "name": "B. D. Rao"}, {"authorId": "30468325", "name": "S. Prabhu"}], "citations": [{"paperId": "ac3ed09733a7e001f90b4e3f693a901900220331", "title": "Custom application programming interface data extractor applied to the Klarna e-commerce dataset"}, {"paperId": "110494b3aab910c3280d5306a1a221e4bfcd2fba", "title": "Towards a new hybrid approach for building document-oriented data warehouses"}, {"paperId": "30617ed911f0d3414da1d339473ce6fdbe9917d1", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "df77617026c7caf3e0bd1439f03b49fbcdbc1369", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
