{"paperId": "252b418535ead84933c066f1915feeae0047aa2c", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Determining Potential Failures and Challenges in Data Driven Endeavors: A Real World Case Study Analysis", "abstract": ": The utilization of data in general and big data in particular offers large opportunities, but is at the same time accompanied by a huge number of potential causes for failure. To avoid those pitfalls when realizing such undertakings, at the beginning, it is necessary to develop an in-depth understanding of those causes. This contribution analyses twelve real world case studies, from the big data and related domains, which were facing issues. The causes for the experienced problems were extracted and thereupon categorized, facilitating the understanding of practitioners and researchers that are engaged in the big data domain. Furthermore, potential avenues for future research are highlighted.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "453-460"}, "authors": [{"authorId": "133861075", "name": "D. Staegemann"}, {"authorId": "94646104", "name": "M. Volk"}, {"authorId": "145012621", "name": "T. Vu"}, {"authorId": "1904493", "name": "Sascha Bosse"}, {"authorId": "152577850", "name": "Robert Häusler"}, {"authorId": "145481886", "name": "Abdulrahman Nahhas"}, {"authorId": "1646715885", "name": "M. Pohl"}, {"authorId": "1802804", "name": "K. Turowski"}], "citations": [{"paperId": "6296cec82e4828a882c2eecb8c1170f875ff8629", "title": "Data science essentials in business administration: A multidisciplinary perspective"}, {"paperId": "d5899dc61e98c97088f2e126562e6ce79280c38e", "title": "A Survey of Data Quality Requirements That Matter in ML Development Pipelines"}]}
