{"paperId": "2555ed31898b39f40518f54dc18006b7999a8f55", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Timing Process Interventions with Causal Inference and Reinforcement Learning", "abstract": "The shift from the understanding and prediction of processes to their optimization offers great benefits to businesses and other organizations. Precisely timed process interventions are the cornerstones of effective optimization. Prescriptive process monitoring (PresPM) is the sub-field of process mining that concentrates on process optimization. The emerging PresPM literature identifies state-of-the-art methods, causal inference (CI) and reinforcement learning (RL), without presenting a quantitative comparison. Most experiments are carried out using historical data, causing problems with the accuracy of the methods' evaluations and preempting online RL. Our contribution consists of experiments on timed process interventions with synthetic data that renders genuine online RL and the comparison to CI possible, and allows for an accurate evaluation of the results. Our experiments reveal that RL's policies outperform those from CI and are more robust at the same time. Indeed, the RL policies approach perfect policies. Unlike CI, the unaltered online RL approach can be applied to other, more generic PresPM problems such as next best activity recommendations. Nonetheless, CI has its merits in settings where online learning is not an option.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-07", "journal": {"name": "ArXiv", "volume": "abs/2306.04299"}, "authors": [{"authorId": "1395096823", "name": "Hans Weytjens"}, {"authorId": "2067648", "name": "W. Verbeke"}, {"authorId": "1786504", "name": "Jochen De Weerdt"}], "citations": [{"paperId": "b8e77ea0d2814551bc18b7ad32333324b7b412f0", "title": "Prescriptive Process Monitoring Under Resource Constraints: A Reinforcement Learning Approach"}]}
