{"paperId": "256b754b4a55fa68812897e06000c5df597f7f6a", "publicationVenue": {"id": "6f5ccf6c-fd96-4a04-9b0e-f1eade928757", "name": "International Conference on Applied Informatics and Communication", "type": "conference", "alternate_names": ["Int Conf Appl Informatics Commun", "ICAIC"]}, "title": "YSAF: Yolo with Spatial Attention and FFT to Detect Face Spoofing Attacks", "abstract": "Besides biometrics, face authentication is quite popular on smart devices like smartphones and other electronic gadgets to verify and authenticate individuals. In the face authentication method, there is a chance of spoofing attacks, in which a static image or recorded video can be substituted for a real person’s face to breach security and gain access. To solve this problem, smart devices use additional hardware like a dual camera or an infrared sensor, which adds extra cost, weight, and incompatibility to different gadgets. Alternatively, software-based methods may be confused with a video of the user to gain the access. To overcome these problems, in this paper, we present a framework, YSAF, that combines Yolo v8 object detection, spatial attention, and fast Fourier transform (FFT) to restrict facial-based spoofing attacks without additional hardware. In YSAF, spatial attention is first used to focus on relevant features and reduce noise in the input image. Next, frequency analysis through FFT is applied to embed information in the collected images to help the classification model differentiate live faces from static ones. As a final step, Yolo detects whether the object present in the collected images is real or fake (spoof). The YSAF is trained using real images collected by volunteers from different sources and pre-processed with spatial attention and FFT before training with Yolo. The results show that the YSAF accurately blocks spoofing attacks with still images/videos in real-time.", "venue": "International Conference on Applied Informatics and Communication", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-02-07", "journal": {"name": "2024 IEEE 3rd International Conference on AI in Cybersecurity (ICAIC)", "pages": "1-6"}, "authors": [{"authorId": "51043236", "name": "Rathinaraja Jeyaraj"}, {"authorId": "89735469", "name": "B. Subramanian"}, {"authorId": "2284348844", "name": "Karnam Yogesh"}, {"authorId": "2284348055", "name": "Aobo Jin"}, {"authorId": "20902065", "name": "Hardik A. Gohel"}], "citations": []}
