{"paperId": "25721f6f6e0ca403c1d9027ea8ea44110639ff16", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "GeoSparkViz in Action: A Data System with Built-in Support for Geospatial Visualization", "abstract": "Visualizing data on maps is deemed a powerful tool for data scientists to make sense of geospatial data. The geospatial map visualization (abbr. MapViz) process first loads the designated geospatial data, processes the data and then applies the map visualization effect. Guaranteeing detailed and accurate geospatial MapViz (e.g., at multiple zoom levels) requires extremely high-resolution maps. Classic solutions suffer from limited computation resources while scalable MapViz system architectures are not able to co-optimize the data management and visualization phases in the same system. This paper demonstrates GeoSparkViz, a full-fledged system that allows the user to load, prepare, integrate and execute MapViz tasks in the same system. For demonstration purpose, we implemented a web interface using a node.js web server, Baidu echarts library, and MapBox on top of GeoSparkViz to visually explore patterns in the New York City Taxi Trips dataset. The demonstration scenarios show how the data preparation and map visualization phases are combined in GeoSparkViz.", "venue": "IEEE International Conference on Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-08", "journal": {"name": "2019 IEEE 35th International Conference on Data Engineering (ICDE)", "pages": "1992-1995"}, "authors": [{"authorId": "97583810", "name": "Jia Yu"}, {"authorId": "133671993", "name": "Anique Tahir"}, {"authorId": "1769421", "name": "Mohamed Sarwat"}], "citations": [{"paperId": "4dc40e5bf500b8bc891d5876ff76ddde78ec9328", "title": "Efficient Generation of Approximate Region-based Geo-maps from Big Geotagged Data"}, {"paperId": "5ca5076976074c1ad6d216585de8a227cf8fb279", "title": "HiVecMap: A parallel tool for real-time geovisualization of massive geographic vector data"}, {"paperId": "179dac326d74d14a53a75884e865c0df48dfeac5", "title": "Beast: Scalable Exploratory Analytics on Spatio-temporal Data"}, {"paperId": "bd234bb1c162f59593ac91ab1883407f8779eaa5", "title": "Revelation of Geospatial Information using Augmented Reality"}, {"paperId": "1d3a5f25f1a52cf0b79bc4947ec7933c95211532", "title": "Multi-layer Data Model for Transportation Logistics Solutions"}]}
