{"paperId": "2573aeb28d0ae2fcf9a680e76ba51574532ed759", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "FPGA Acceleration of Pre-Alignment Filters for Short Read Mapping With HLS", "abstract": "Pre-alignment filters are useful for reducing the computational requirements of genomic sequence mappers. Most of them are based on estimating or computing the edit distance between sequences and their candidate locations in a reference genome using a subset of the dynamic programming table used to compute Levenshtein distance. Some of their FPGA implementations of use classic HDL toolchains, thus limiting their portability. Currently, most FPGA accelerators offered by heterogeneous cloud providers support C/C++ HLS. In this work, we implement and optimize several state-of-the-art pre-alignment filters using C/C++ based-HLS to expand their portability to a wide range of systems supporting the OpenCL runtime. Moreover, we perform a complete analysis of the performance and accuracy of the filters and analyze the implications of the results. The maximum throughput obtained by an exact filter is 95.1 MPairs/s including memory transfers using 100 bp sequences, which is the highest ever reported for a comparable system and more than two times faster than previous HDL-based results. The best energy efficiency obtained from the accelerator (not considering host CPU) is 2.1 MPairs/J, more than one order of magnitude higher than other accelerator-based comparable approaches from the state of the art.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "22079-22100", "volume": "10"}, "authors": [{"authorId": "1403285152", "name": "David Castells-Rufas"}, {"authorId": "1403923259", "name": "Santiago Marco-Sola"}, {"authorId": "1705263", "name": "J. Moure"}, {"authorId": "2155719479", "name": "Quim Aguado"}, {"authorId": "144765231", "name": "Antonio Espinosa"}], "citations": [{"paperId": "3fcea1e001a43b6de25c04b6d519ea5c7d791e4c", "title": "Integrating FPGA Acceleration in the DNAssim Framework for Faster DNA-Based Data Storage Simulations"}, {"paperId": "c2f514ff25750897e4e86ea5ade2187f064fd5fd", "title": "ISMatch: A real-time hardware accelerator for inexact string matching of DNA sequences on FPGA"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}]}
