{"paperId": "257c68a981b195e59594f10c6210a4318e9499cc", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "Deterministic massively parallel connectivity", "abstract": "We consider the problem of designing fundamental graph algorithms on the model of Massive Parallel Computation (MPC). The input to the problem is an undirected graph G with n vertices and m edges, and with D being the maximum diameter of any connected component in G. We consider the MPC with low local space, allowing each machine to store only Θ(nδ) words for an arbitrary constant δ>0, and with linear global space (which is the number of machines times the local space available), that is, with optimal utilization. In a recent breakthrough, Andoni et al. (FOCS’18) and Behnezhad et al. (FOCS’19) designed parallel randomized algorithms that in O(logD + loglogn) rounds on an MPC with low local space determine all connected components of a graph, improving on the classic bound of O(logn) derived from earlier works on PRAM algorithms. In this paper, we show that asymptotically identical bounds can be also achieved for deterministic algorithms: we present a deterministic MPC low local space algorithm that in O(logD + loglogn) rounds determines connected components of the input graph. Our result matches the complexity of state of the art randomized algorithms for this task. The techniques developed in our paper can be also applied to several related problems, giving new deterministic MPC algorithms for problems like finding a spanning forest, minimum spanning forest, etc. We complement our upper bounds by extending a recent lower bound for connectivity on an MPC conditioned on the 1-vs-2-cycles conjecture (which requires D ≥ log1+Ω(1)n), by showing a related conditional hardness of Ω(logD) MPC rounds for the entire spectrum of D, covering a particularly interesting range when D ≤ O(logn).", "venue": "Symposium on the Theory of Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-08-09", "journal": {"name": "Proceedings of the 54th Annual ACM SIGACT Symposium on Theory of Computing"}, "authors": [{"authorId": "8658641", "name": "Samantha R. Coy"}, {"authorId": "1717169", "name": "A. Czumaj"}], "citations": [{"paperId": "288af42f228748c3609ca8d94a94cc3df250bebd", "title": "Conditionally Optimal Parallel Coloring of Forests"}, {"paperId": "9a6d16898d3086d543838c030916808b949a7871", "title": "Fast Dynamic Programming in Trees in the MPC Model"}, {"paperId": "f722a9daf418bfa3780e5cd4d9f5cc2d9707c329", "title": "Fully Scalable Massively Parallel Algorithms for Embedded Planar Graphs"}, {"paperId": "1184fca17606e02554bd3ce2f8c330d829ecfa50", "title": "Adaptive Massively Parallel Connectivity in Optimal Space"}, {"paperId": "50fb96060ebc203f4a85a3302fb2982a625ce88b", "title": "Fast Parallel Degree+1 List Coloring"}, {"paperId": "bfcb3a52cac1cd1ff719a7fa8dd4e0b3f3b4a91a", "title": "Deterministic Massively Parallel Symmetry Breaking for Sparse Graphs"}, {"paperId": "e1532ee4176d000956fe6c2e5d7e1269f6efd888", "title": "Optimal Deterministic Massively Parallel Connectivity on Forests"}, {"paperId": "529fe22e4eccc5c5c559be2e4e714de3e1cb8c59", "title": "Exponential Speedup Over Locality in MPC with Optimal Memory"}, {"paperId": "7017419ac2e12777476992e35cbe862eb2621288", "title": "Improved Deterministic Connectivity in Massively Parallel Computation"}, {"paperId": "28b378d55cbb8eadf1f5bf51e1a216b2f1c98b05", "title": "Superfast Coloring in CONGEST via Efficient Color Sampling"}, {"paperId": "7575847827411e891f890a81ddfb4e2bc08babcb", "title": "Massively Parallel Computation: Algorithms and Applications"}]}
