{"paperId": "25ad566c62ef8378beabcf723a55b811f60dc087", "publicationVenue": {"id": "edfd6029-6a35-4b4d-a1b9-e845c0f5cb83", "name": "Risk Management & Insurance Review", "type": "journal", "alternate_names": ["Risk Manag  Insur Rev", "Risk management and insurance review", "Risk manag insur rev"], "issn": "1098-1616", "url": "http://www.blackwell-synergy.com/rd.asp?code=rmir&goto=journal", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15406296"]}, "title": "Bridging the cyber protection gap: An investigation into the efficacy of the German cyber insurance market", "abstract": "Cybersecurity requires an effective risk transfer regime and a well‐functioning insurance market to improve stakeholder resilience. However, rapid cyber threat adaptation, limited data availability, and inadequate risk understanding pose significant challenges for the insurance industry and its customers. This research uses a mixed methods approach to analyze the inclusions, exclusions, and suitability of current cyber policies in the German cyber insurance market. The study analyzes 41 cyber insurance policies, representing about 80% of the German cyber insurance market. This examination is supported by semistructured interviews with 23 cyber insurance experts. The authors find that there are no standardized cyber policy wordings, and insurers use different terms and definitions in their insurance policies. Specifically, the results show a significant lack of clarity around coverages and exclusions. This research contributes to the cybersecurity risk management community and will enable businesses, insurance companies, and policymakers to better understand, measure, and manage cyber risk.", "venue": "Risk Management & Insurance Review", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-08", "journal": {"name": "Risk Management and Insurance Review"}, "authors": [{"authorId": "2155014658", "name": "Frank Cremer"}, {"authorId": "2077016707", "name": "Barry Sheehan"}, {"authorId": "2160847401", "name": "Michael Fortmann"}, {"authorId": "47086166", "name": "Martin Mullins"}, {"authorId": "47527467", "name": "Finbarr Murphy"}, {"authorId": "2291285875", "name": "Stefan Materne"}], "citations": []}
