{"paperId": "25c48ca4c32e5738ed6d508b9f74350fd18884a9", "publicationVenue": {"id": "38e1b942-a62d-4d74-8e5d-677db6ed425f", "name": "Symposium on Networked Systems Design and Implementation", "type": "conference", "alternate_names": ["NSDI", "Symp Networked Syst Des Implement", "Networked Systems Design and Implementation", "Networked Syst Des Implement"]}, "title": "Boggart: Towards General-Purpose Acceleration of Retrospective Video Analytics", "abstract": "Commercial retrospective video analytics platforms have increasingly adopted general interfaces to support the custom queries and convolutional neural networks (CNNs) that different applications require. However, existing optimizations were designed for settings where CNNs were platform- (not user-) determined, and fail to meet at least one of the following key platform goals when that condition is violated: reliable accuracy, low latency, and minimal wasted work. We present Boggart, a system that simultaneously meets all three goals while supporting the generality that today's platforms seek. Prior to queries being issued, Boggart carefully employs traditional computer vision algorithms to generate indices that are imprecise, but are fundamentally comprehensive across different CNNs/queries. For each issued query, Boggart employs new techniques to quickly characterize the imprecision of its index, and sparingly run CNNs (and propagate the results to other frames) in a way that bounds accuracy drops. Our results highlight that Boggart's improved generality comes at low cost, with speedups that match (and most often, exceed) prior, model-specific approaches.", "venue": "Symposium on Networked Systems Design and Implementation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-21", "journal": {"pages": "933-951"}, "authors": [{"authorId": "2067723719", "name": "Neil Agarwal"}, {"authorId": "2846332", "name": "R. Netravali"}], "citations": [{"paperId": "dc888056d185572671060c1430deb9978fa4d917", "title": "Apparate: Rethinking Early Exits to Tame Latency-Throughput Tensions in ML Serving"}, {"paperId": "822d2a0507f3138075cd062769cbde8a15f7c1e4", "title": "Characterizing Distributed Mobile Augmented Reality Applications at the Edge"}, {"paperId": "3312c14404fa4f038364efba78665ffa851f7ea5", "title": "OneAdapt: Fast Adaptation for Deep Learning Applications via Backpropagation"}, {"paperId": "eeab466d688b94133950788eaf8d1bf33bf037cb", "title": "Zelda: Video Analytics using Vision-Language Models"}, {"paperId": "59d01debcc5ed1a8226fc3dfce7fad11a5592a20", "title": "MadEye: Boosting Live Video Analytics Accuracy with Adaptive Camera Configurations"}, {"paperId": "9e9c4f691bb830bac30cf7f624ebc82f63b101c1", "title": "VaBUS: Edge-Cloud Real-Time Video Analytics via Background Understanding and Subtraction"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "b0a08f083476eeef5986e9745e3fc2779eb234a7", "title": "Known Knowns and Unknowns: Near-realtime Earth Observation Via Query Bifurcation in Serval"}]}
