{"paperId": "25c8bf348da067a3775eff94882c31723b0f078d", "publicationVenue": {"id": "7f5f1020-fadf-4b1f-b7c3-a169f4e9a99e", "name": "Estudios sobre Educación", "type": "journal", "alternate_names": ["Estud sobre Educ", "Ese-estudios Sobre Educacion", "Ese-estudios Sobre Educ"], "issn": "1578-7001", "url": "https://www.unav.edu/publicaciones/revistas/index.php/estudios-sobre-educacion", "alternate_urls": ["https://dialnet.unirioja.es/servlet/revista?codigo=1907", "https://www.unav.edu/publicaciones/revistas/index.php/estudios-sobre-educacion/index"]}, "title": "Exploring Data Driven Youth Character Education Frameworks: A Systematic Literature Review on Learning Analytics Models and Participatory Design", "abstract": "Character development requires not only high-quality curriculums, but also educators who are able to adapt programs to learners’ needs and context and staff development strategies. Big data and learning analytics strategies may improve youth character development especially in developing countries facilitating educators’ development and practical wisdom, as well as curriculum implementation’s effectiveness in countries with less knowhow in the issue. This study presents a systematic mapping literature review on the models and methods of learning analytics applied in the improvement of youth character education. Based on the literature review results, the research provides insights for future research and implementation of character education programs, and proposes a revised participatory knowledge management data-driven procedure that may facilitate educators to identify and undertake the best character formation actions in specific situations.", "venue": "Estudios sobre Educación", "year": 2019, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-10-01", "journal": {"name": "Estudios sobre Educación"}, "authors": [{"authorId": "2127820260", "name": "Reynaldo Rivero-Baiocchi"}], "citations": [{"paperId": "67fafa7f1c0c3e52a7f6bc63e97194cbfbeeaa3e", "title": "Education 5.0: Requirements, Enabling Technologies, and Future Directions"}, {"paperId": "853f7f3a18c93f9bd3d478cc87849d66d8e72ab5", "title": "The critical success factors’ investigation during knowledge management implementation within SME enterprises: a Participatory Design opportunity"}, {"paperId": "8adc93b42037b515aa5ee1149506f167cda1c17d", "title": "Rendimiento académico y patrones de uso del campus virtual: Un estudio de caso controlado"}, {"paperId": "34bebd4204b17fc16fd5f4c73f2625cd00537150", "title": "Learning Analytics in Online Learning Environment: A Systematic Review on the Focuses and the Types of Student-Related Analytics Data"}, {"paperId": "da047551752829243f7b36e128b3efcc0e135e40", "title": "Participatory Design in Knowledge Management: An Opportunity to Small and Medium Business"}, {"paperId": "67388ec935584a7a38fd0b5ebe20368292bfb2a6", "title": "Social marketing for digital transformation: Digitalizing social action for the development of women at risk of exclusion"}]}
