{"paperId": "25eae3ec5eca81d61058e05908be9aa418a596ec", "publicationVenue": null, "title": "Edge computing for Vehicle to Everything: a short review [version 2; peer review: 1 approved with reservations, 1 not approved]", "abstract": "Vehicle to Everything (V2X) communications and services have sparked considerable interest as a potential component of future Intelligent Transportation Systems. V2X serves to organise communication and interaction between vehicle to vehicle (V2V), vehicle to infrastructure (V2I), vehicle to pedestrians (V2P), and vehicle to networks (V2N). However, having multiple communication channels can generate a vast amount of data for processing and distribution. In addition, V2X services may be subject to performance requirements relating to dynamic handover and low latency communication channels. Good throughput, lower delay, and reliable packet delivery are the core requirements for V2X services. Edge Computing (EC) may be a feasible option to address the challenge of dynamic handover and low latency to allow V2X information to be transmitted across vehicles. Currently, existing comparative studies do not cover the applicability of EC for V2X. This review explores EC approaches to determine the relevance for V2X communication and services. EC allows devices to carry out part or all of the data processing at the point where data is collected. The emphasis of this review is on", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2255490002", "name": "Mohd Fikri"}, {"authorId": "2256164929", "name": "Azli Abdullah"}, {"authorId": "26954926", "name": "S. Yogarayan"}, {"authorId": "2255475150", "name": "Siti Fatimah"}, {"authorId": "2263509828", "name": "Abdul Razak"}, {"authorId": "144701001", "name": "A. Azman"}, {"authorId": "9150386", "name": "A. Hudaya"}, {"authorId": "2288938533", "name": "Muhamad Amin"}, {"authorId": "2137441714", "name": "Mazrah Salleh"}, {"authorId": "2289029236", "name": "Danilo Amendola"}, {"authorId": "2289030086", "name": "Lionel Nkenyereye"}], "citations": []}
