{"paperId": "25f56dff9bd80d8d04f0122b541c2a10f8965286", "publicationVenue": {"id": "e2ffc10b-8941-4382-801c-48e781e51620", "name": "International Journal of Information and Communication Technology Education", "type": "journal", "alternate_names": ["Int J Inf Commun Technol Educ", "International Journal of Information and Communication Technology and Education", "International Journal of Information and Communication Technologies in Education"], "issn": "1550-1337", "alternate_issns": ["2719-065X", "1805-3726"], "url": "http://find.galegroup.com/openurl/openurl?ctx_enc=info:ofi:enc:UTF-8&res_id=info:sid/gale:AONE&rft.issn=1550-1876&rft_val_fmt=info:ofi/fmt:kev:mtx:journal&url_ctx_fmt=info:ofi/fmt:kev:mtx:ctx&url_ver=Z39.88-2004", "alternate_urls": ["https://www.degruyter.com/view/j/ijicte.2017.6.issue-2/issue-files/ijicte.2017.6.issue-2.xml", "http://www.igi-pub.com/journals/details.asp?id=4287", "https://www.igi-global.com/journal/international-journal-information-communication-technology/1082", "http://www.idea-group.com/", "http://periodika.osu.cz/ictejournal"]}, "title": "Applying Big Data Analytics in Higher Education: A Systematic Mapping Study", "abstract": "Higher education systems (HES) have become increasingly absorbed in applying big data analytics due to competition as well as economic pressures. Many studies have been conducted that applied big data analytics in HES; however, a systematic review (SR) of the research is scarce. In this paper, the authors conducted a systematic mapping study to address this deficiency. The qualitative and quantitative analysis of the mapping study resulted in highlighting the research progression over the last decade, and identification of three major themes, 12 subthemes, 10 motivation factors, 10 major challenges, three categories of tools and support techniques, and 16 models for applying big data analytics in higher education. This result contributes to the ongoing research on applying big data analytics in HES. It provides a better understanding of the level of contribution to research as well as identifies gaps for future research direction.", "venue": "International Journal of Information and Communication Technology Education", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-01", "journal": {"name": "Int. J. Inf. Commun. Technol. Educ.", "pages": "29-51", "volume": "17"}, "authors": [{"authorId": "34885819", "name": "A. Alkhalil"}, {"authorId": "2114241296", "name": "Magdy Abd Elrahman Abdallah"}, {"authorId": "114957241", "name": "A. Alogali"}, {"authorId": "3143265", "name": "A. Aljaloud"}], "citations": [{"paperId": "475b092d79c179e1737e2e9ace9dadc02c4a7c1b", "title": "Artificial intelligence in entrepreneurship education: a scoping review"}, {"paperId": "6678d77801e46cb26569fad26e47176428d8f554", "title": "A machine learning-based hybrid recommender framework for smart medical systems"}, {"paperId": "cf9ae6e62a981486e1485c95222f5e983189bdf9", "title": "A Comparative Study of Machine Learning Techniques for College Student Success Prediction"}, {"paperId": "c8cc6ca886011e63c64bc9ac03b5a7798734fcec", "title": "A meta systematic review of artificial intelligence in higher education: a call for increased ethics, collaboration, and rigour"}, {"paperId": "e7a8c0fc877baa324dfd7e4b0823f5e1fed2d3e2", "title": "Investigating Bigdata Analytics Adoption in Higher Education: Pilot Study"}, {"paperId": "ebf9c6242510c221ce746a47161b2ad504b9cbf4", "title": "A Secure and Privacy-Preserving Blockchain-Based XAI-Justice System"}, {"paperId": "829a8a055c6cb63d0d50c89f0ac527251b865701", "title": "A decade of research into the application of big data and analytics in higher education: A systematic review of the literature"}, {"paperId": "8b03c682e3dd4955fc64e91e202cf90656e0ae36", "title": "Integrated development of industrial and regional economy using big data technology"}, {"paperId": "ed6f12d011eeaba52a48eebf29cdb306606a7f97", "title": "Big Data Analytics and Educational Sustainability-A Malaysian Scenario"}, {"paperId": "0e42a1abd05ba1d43d7f0a03f468573de837d613", "title": "Organisational culture and big data socio-technical systems on strategic decision making: Case of Saudi Arabian higher education"}, {"paperId": "7e831181885bb53ef44d228e55d9f2d615a287e3", "title": "Research on the digital economy promoting the high-quality development of trade in the central and western regions under the background of big data technology"}, {"paperId": "a2429ecd3d5ac28ae48fcacf6b8513cc9ad003de", "title": "Application of PSO-Optimized Twin Support Vector Machine in Medium and Long-Term Load Forecasting under the Background of New Normal Economy"}, {"paperId": "9c5874cb657244cabf902e25fe5cff7705446179", "title": "Enterprise Precision Marketing Effectiveness Model Based on Data Mining Technology"}, {"paperId": "71ce0616f852fc335bee05df8f883831624157a6", "title": "A Prediction and Visual Analysis Method for Graduation Destination of Undergraduates Based on LambdaMART Model"}, {"paperId": "20f223b7b49243341789dc10333cceaaf6a88fd9", "title": "Data visualization in introductory business statistics to strengthen students' practical skills"}, {"paperId": "4b3b48c19b47504c450e796093c3c81d1f3d4fb6", "title": "Adoption of Big Data Analytics and Its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management"}, {"paperId": "0cefba5b4fe95e79822d41dc589f8daf140dc0f8", "title": "Towards IoT-Big Data architecture for future education"}, {"paperId": "6db2b3378a6707b60f29d2db031a1fb83af80058", "title": "PONTIFICIA UNIVERSIDAD CATÓLICA DEL PERÚ ESCUELA DE POSGRADO Adoption of Big Data Analytics and its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management TESIS PARA OBTENER EL GRADO DE DOCTOR EN ADMINISTRACIÓN ESTRATÉGICA DE EMPRESAS PRESENTADA POR"}, {"paperId": "d817b8b620dbaf91b617c5f5a44bae00508ed384", "title": "A UNIFIED FRAMEWORK FOR BIG DATA-DRIVEN DECISION MAKING SYSTEM IN HIGHER EDUCATION INSTITUTES"}]}
