{"paperId": "25fb79f1b2644910893084672829e688a0647be8", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Green Internet of Things and Big Data Application in Smart Cities Development", "abstract": "This study reveals that increases in the global population command an augmented demand for products and services that calls for more effective ways of using existing natural resources and materials. The recent development of information and communication technologies, which had a great impact on many areas, also had a damaging effect on the environment and human health. Therefore, societies are moving toward a greener future by reducing the consumption of nonrenewable materials, raw materials, and resources while at the same time decreasing energy pollution and consumption. Since information technology is considered a tool for solving ecological difficulties, the green Internet of things (G-IoT) is playing a vital role in creating a sustainable home. Extensive data analysis is required to obtain a valuable overview of the large and diverse data generated by the G-IoT. The gathered information will facilitate forecasting, decision-making, and other activities related to smart urban services and then contribute to the incessant development of G-IoT technology. Therefore, even if sustainable and smart cities become an actuality, the G-IoT approach and the knowledge gained through big data (BD) analysis will make cities more sustainable, safer, and smarter. The goal of this article is to combine innovation in technological development with the main focus on resource sharing in creating cities that improve the quality of life while reducing pollution and realizing more efficient use of the raw materials. In the practice of big data science, it is always of interest to provide the best description of the data under consideration. Recent studies have pointed out the applicability of the statistical distributions in modeling data in applied sciences. In this article, we introduce a new family of statistical models to provide the best description of the life span of the wireless sensors network’s data. Based on the proposed approach, a special submodel called new exponent power-Weibull distribution is studied in detail. The applicability of the proposed model is shown by analyzing the life span of the wireless sensors network’s data.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-05-27", "journal": {"name": "Complex.", "pages": "4922697:1-4922697:15", "volume": "2021"}, "authors": [{"authorId": "2116369469", "name": "Zhai Yang"}, {"authorId": "49000307", "name": "L. Jianjun"}, {"authorId": "2098808713", "name": "Humaira Faqiri"}, {"authorId": null, "name": "Wasswa Shafik"}, {"authorId": "2114210881", "name": "A. T. Abdulrahman"}, {"authorId": "2061813828", "name": "M. Yusuf"}, {"authorId": "2044833578", "name": "Sh. A. M. Mubarak"}], "citations": [{"paperId": "d60aa2941ce2d88645fb21547ad80a1470b30f5b", "title": "Using Social Media Data to Research the Impact of Campus Green Spaces on Students’ Emotions: A Case Study of Nanjing Campuses"}, {"paperId": "eac7914ff4631e5d3daadfb861c7d1dd96863d17", "title": "Managing the Transition Process to Society 5.0"}, {"paperId": "f0cd97bc775a154a79d7c50310bbad9c9b37fad1", "title": "Harvesting energy overview for sustainable wireless sensor networks"}, {"paperId": "7a980b2bfd69433ea2edaea79e6d401f76cdc3ab", "title": "Artificial intelligence, machine learning and big data in natural resources management: A comprehensive bibliometric review of literature spanning 1975–2022"}, {"paperId": "00027f5ba1d2dff89a6ef775b8f67f0d9b8cd952", "title": "Simulation of IoT-based Smart City of Darwin: Leading Cyber Attacks and Prevention Techniques"}, {"paperId": "4bc8d8419f8d737f0e04e433da2db34f2bdb93b4", "title": "Research trends in the application of big data in smart cities—A literature review"}, {"paperId": "5db04d7c83a5b12d5b48921a868867d844dbf7fb", "title": "Evaluating Security Anomalies by Classifying Traffic Using Deep Learning"}, {"paperId": "2daa38b6edcef495263b29c068a2434a9a135557", "title": "Performance Enhancement of a mmWave Antenna using Modified Series-Fed Array Structure"}, {"paperId": "2e1f6acd014d35e09f2143a7060cc295b77eea71", "title": "Research on Stability-Enhanced Clustering Algorithm Based on Distributed Node Status Judgment in MWSN"}, {"paperId": "9b4388164baf952dfef190492ad72ea1727ef142", "title": "Towards green smart cities using Internet of Things and optimization algorithms: A systematic and bibliometric review"}, {"paperId": "bc59277ed12df16ce560aec1fb370290f4961d04", "title": "Towards Green IoTs - Enabling Sustainable Environment, Bibliometric Analysis and Beyond"}, {"paperId": "e331bcfcc37ebe2bc96bee5df50a612b27792bed", "title": "Recommendation System Comparative Analysis: Internet of Things aided Networks"}, {"paperId": "b37270ea4e5189535c79018c4b9c232ce7d547be", "title": "A reawakening of Machine Learning Application in Unmanned Aerial Vehicle: Future Research Motivation"}, {"paperId": "5fd021faa2099243833c1d78f568f056070d5c1f", "title": "Sustainability-oriented innovations in smart cities: A systematic review and emerging themes"}, {"paperId": "5923aed8a97355ff557d1885cc56a100c414d050", "title": "Innovation Trajectories for a Society 5.0"}, {"paperId": "e74be99175dbb787ff5e1ce335da351fb99812f5", "title": "Performance evaluation and design of 5G communication-based millimeter wave antenna"}, {"paperId": "033f48f4f272ce709ed300d9e2d943cc34904e3e", "title": "MANAGING GREEN IT: A REVOLUTION FOR CRAFTING THE IDEA OF SMART CITY IN A DIFFERENT WAY"}, {"paperId": "3ce8c38edc99bfed862542c345159532c76376d2", "title": "Overview of 5G & Beyond Security"}]}
