{"paperId": "26088629d6d6ce61e86f61d8b706ecfb0974073a", "publicationVenue": {"id": "9c115ef5-1e99-4f08-a0a8-ab8ba2f8f3fa", "name": "International Journal of Service Science Management Engineering and Technology", "type": "journal", "alternate_names": ["Int J Serv Sci Manag Eng Technol", "International Journal of Service Science, Management, Engineering, and Technology"], "issn": "1947-9603", "url": "http://www.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=1132", "alternate_urls": ["http://www.igi-global.com/IJSSMET", "https://www.igi-global.com/journal/international-journal-service-science-management/1132"]}, "title": "Big Data Analytics Artefact for Outcome-Based Funding Prediction in South African Public Universities", "abstract": "This study designed a big data analytics artefact for the prediction of outcome-based funding (OBF) in South African public universities. Universities in South Africa (SA) are subsidized based on their performance known as OBF that is measured depending on the outputs from teaching, research, and engagements. OBF metrics are well documented; however, public universities fail to achieve the targets for higher scores. These failures are attributed to poor decision-making resulting from limited analysis of the voluminous data generated. This study used design science methodology to develop a big data analytics artefact for prediction of OBF outcomes. The artefact was evaluated for prediction using machine learning training and tested with data collected from South African universities. Findings indicated that for better prediction using big data analytics, system characteristics, size, structure, top management support, market, infrastructure, and government regulations factors play a significant role.", "venue": "International Journal of Service Science Management Engineering and Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "Int. J. Serv. Sci. Manag. Eng. Technol.", "pages": "1-27", "volume": "15"}, "authors": [{"authorId": "2265832165", "name": "B. M. Kalema"}, {"authorId": "8164482", "name": "M. A. Segooa"}], "citations": []}
