{"paperId": "26092daa38d22bbb97d6c0a1363f952147c16f34", "publicationVenue": null, "title": "Predictive maintenance: assessment of potentials for residential heating systems", "abstract": "ABSTRACT Predictive Maintenance (PdM) solutions can predict and consequently minimize downtimes. Concerning high implementation cost of PdM solutions for manufacturing systems as well as for sold systems operating in the field, e.g. Building Energy Systems in residential heating (RH), it is unclear under which conditions potentials outweigh investment. In a previous scientific publication, the authors proposed a methodology to systematically assess potentials and benefits of to-be-developed PdM solutions in manufacturing processes. The utilization of the methodology for RH systems is promising, but requires a suitable adaptation to its individual context. Apart from quantifying the benefit compared to investment for PdM solutions, the context of RH is fundamentally different from manufacturing. As a major difference, the systems are not located in-house, but in the field at the customers’ site. This leads to increased challenges in terms of lacking customer and system feedback and data availability. Therefore, this paper addresses the optimization, transfer, and adaptation of the previously developed methodology to RH systems. Additionally, this paper includes baseline information regarding maintenance and RH and an exemplary application of the optimized and adapted methodology that supports the reliability department of BOSCH Thermotechnology for quantifying the potentials of PdM solutions in the field of RH.", "venue": "International journal of computer integrated manufacturing (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-23", "journal": {"name": "International Journal of Computer Integrated Manufacturing", "pages": "1876 - 1900", "volume": "36"}, "authors": [{"authorId": "4454238", "name": "Sahil Arora"}, {"authorId": "145269883", "name": "M. Rabe"}], "citations": [{"paperId": "67bf00921e8f226e25529bfb5a9c27ddc7f3e1ed", "title": "Special issue “Towards Digitalized Manufacturing 4.0”"}]}
