{"paperId": "26094b78caef46d02bedd7abf28d5e98fefea3f4", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "JUST: JD Urban Spatio-Temporal Data Engine", "abstract": "With the prevalence of positioning techniques, a prodigious number of spatio-temporal data is generated con-stantly. To effectively support sophisticated urban applications, e.g., location-based services, based on spatio-temporal data, it is desirable for an efficient, scalable, update-enabled, and easy-to-use spatio-temporal data management system.This paper presents JUST, i.e., JD Urban Spatio-Temporal data engine, which can efficiently manage big spatio-temporal data in a convenient way. JUST incorporates the distributed NoSQL data store, i.e., Apache HBase, as the underlying storage, GeoMesa as the spatio-temporal data indexing tool, and Apache Spark as the execution engine. We creatively design two indexing techniques, i.e., Z2T and XZ2T, which accelerates spatio-temporal queries tremendously. Furthermore, we introduce a compression mechanism, which not only greatly reduces the storage cost, but also improves the query efficiency. To make JUST easy-to-use, we design and implement a complete SQL engine, with which all operations can be performed through a SQL-like query language, i.e., JustQL. JUST also supports inherently new data insertions and historical data updates without index reconstruction. JUST is deployed as a PaaS in JD with multi-users support. Many applications have been developed based on the SDKs provided by JUST. Extensive experiments are carried out with six state-of-the-art distributed spatio-temporal data management systems based on two real datasets and one synthetic dataset. The results show that JUST has a competitive query performance and is much more scalable than them.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1558-1569"}, "authors": [{"authorId": "1720842162", "name": "Ruiyuan Li"}, {"authorId": "1720744037", "name": "Huajun He"}, {"authorId": "2108686066", "name": "Rubin Wang"}, {"authorId": "2142566875", "name": "Yuchuan Huang"}, {"authorId": "2145468871", "name": "Junwen Liu"}, {"authorId": "36326845", "name": "Sijie Ruan"}, {"authorId": "32914659", "name": "Tianfu He"}, {"authorId": "143867129", "name": "Jie Bao"}, {"authorId": "47833418", "name": "Yu Zheng"}], "citations": [{"paperId": "09a02e6a83bc43b5fa3a764ddf761972b2ebc529", "title": "A Survey on Spatio-Temporal Big Data Analytics Ecosystem: Resource Management, Processing Platform, and Applications"}, {"paperId": "3b5325634156f6128cb6b68cc93690d70165e111", "title": "GridMesa: A NoSQL-based big spatial data management system with an adaptive grid approximation model"}, {"paperId": "50af5ad6bf6a2e7d9651ef7397ef97ee3fbefce2", "title": "ERASE: Error-Resilient Representation Learning on Graphs for Label Noise Tolerance"}, {"paperId": "934ee2c0db12a01ac7dfb306119a9251d3637271", "title": "Epidemic Amplifier Detection: Finding High-Risk Locations in COVID-19 Cases' Location Sequences via Multi-task Learning"}, {"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "ca85791c7ce893dbfadc12df9c676ff81fbf9807", "title": "ST4ML: Machine Learning Oriented Spatio-Temporal Data Processing at Scale"}, {"paperId": "0fd15c2e8f873e30b3f7b764bbaa8acc5f8b8211", "title": "Big Data and precision agriculture: a novel spatio-temporal semantic IoT data management framework for improved interoperability"}, {"paperId": "73b0acc88e3e17305576c4454fd98ec1746ca831", "title": "Optimizing segmented trajectory data storage with HBase for improved spatio-temporal query efficiency"}, {"paperId": "d4c0a17d9e234b5a6b7eb801858f4eefc2b884a6", "title": "Extreme-Aware Local-Global Attention for Spatio-Temporal Urban Mobility Learning"}, {"paperId": "5e2ee8d2f117d707d79fcc62dd95166be154fe98", "title": "UrbanKG: An Urban Knowledge Graph System"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}, {"paperId": "07684ab1d76a0303fcb116817280c37686c83a52", "title": "Filling Delivery Time Automatically Based on Couriers’ Trajectories"}, {"paperId": "41022e87eeace334af19df62ad4e5429928a2062", "title": "TrajMesa: A Distributed NoSQL-Based Trajectory Data Management System"}, {"paperId": "797601c1b73acc8d98046281383bb63f80fbb42d", "title": "Improving the Efficiency of the EMS-Based Smart City: A Novel Distributed Framework for Spatial Data"}, {"paperId": "3c9dce90b0db69f8fe34ef43000182ea58db24a5", "title": "A Context-Aware Method for Indexing Large-Scale SpatioTemporal Data"}, {"paperId": "8530d8f2e4a1896cc47c292ec9e9169f1d00ab79", "title": "BOD-tree: An One-Dimensional Balanced Indexing Algorithm"}, {"paperId": "524a4452656f71800b6aeb20c857c9ee3da90f4d", "title": "SPEAR-board: cross-platform interactive spatio-temporal big data analytics"}, {"paperId": "b8fe89d664215e70552ba873cee03dcbdead19f8", "title": "A survey of urban visual analytics: Advances and future directions"}, {"paperId": "0d185d4b37352b47abd61ef3799d29500ed444cc", "title": "BSMD: A blockchain-based secure storage mechanism for big spatio-temporal data"}, {"paperId": "930e95df36e260d4d5e4277c374125646c4dcf65", "title": "LYRIC: Deadline and Budget Aware Spatio-Temporal Query Processing in Cloud"}, {"paperId": "1ce566885dfab65e4943c0a574e320144f913cbf", "title": "VRE: A Versatile, Robust, and Economical Trajectory Data System"}, {"paperId": "1f8ccf996d0f0eb8a08dddb8b5f6fed7908c2d1c", "title": "Cymo: A Storage Model with Query-Aware Indexing for Spatio-Temporal Big Data"}, {"paperId": "9a1640ed3b18169672ba2b04891a00e5fb35ac68", "title": "TraSS: Efficient Trajectory Similarity Search Based on Key-Value Data Stores"}, {"paperId": "64b20b68f2a2fbb93bf70bc3acee43369e898a3f", "title": "Apache ShardingSphere: A Holistic and Pluggable Platform for Data Sharding"}, {"paperId": "934efd9023176c4231d43fb39510e067caf4509d", "title": "Discovering Actual Delivery Locations from Mis-Annotated Couriers' Trajectories"}, {"paperId": "0d77c5578eca3ce256137850b49e3b652e2f3654", "title": "An adaptive geographic meshing and coding method for remote sensing data"}, {"paperId": "418f4d1d36354009c8ea10460a0599d7afd9bfc5", "title": "Query Optimization for Distributed Spatio-Temporal Sensing Data Processing"}, {"paperId": "31770f6c92517b93a530bbc6f1c753a956abeeba", "title": "JUST-Traj: A Distributed and Holistic Trajectory Data Management System"}, {"paperId": "0b9f39ce1062f099d2c53cfcf4e580b75b2e79df", "title": "ICFinder: A Ubiquitous Approach to Detecting Illegal Hazardous Chemical Facilities with Truck Trajectories"}, {"paperId": "13847a85108777574bb14191f04e8603e3d6a600", "title": "Distributed Spatio-Temporal k Nearest Neighbors Join"}, {"paperId": "73f7ca798478f8e6d34283afdbecfbbf8b7501a2", "title": "SALON: A Universal Stay Point-Based Location Analysis Platform"}, {"paperId": "1804c012320f26404f60433ff88b1ff1b7b2059f", "title": "SPEAR: Dynamic Spatio-Temporal Query Processing over High Velocity Data Streams"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "55066eaddcba2f0a01256c54c3a28128e7c53ebf", "title": "Dragoon: a hybrid and efficient big trajectory management system for offline and online analytics"}, {"paperId": "93bd830b9c6e0fe1233d40f1a82d525c11033ed1", "title": "ST-Trie: A Novel Indexing Scheme for Efficiently Querying Heterogeneous, Spatiotemporal IoT Data"}, {"paperId": "28d11009232a0c35161d87b6711bf0344a0fe2d3", "title": "Discovering Real-Time Reachable Area Using Trajectory Connections"}, {"paperId": "21805b2178ac86dbd4c98f4311acc2ce00f92f8a", "title": "Doing in One Go: Delivery Time Inference Based on Couriers' Trajectories"}, {"paperId": "b117fdff4aaa6c1af939571110ab817a6ecb1ae6", "title": "Grand challenges for the spatial information community"}, {"paperId": "7d90512dfea0331a87ad67c95f8f4716d7747878", "title": "Exploratory Trajectory Analysis for Massive Historical AIS Datasets"}, {"paperId": "ee9f40f1c1e77b0b39b6e4a158208614fb4995c0", "title": "Urban Anomaly Analytics: Description, Detection, and Prediction"}, {"paperId": "e5a7c3c1fc27f3a27ed835c4d580f95d280eef18", "title": "What is the Human Mobility in a New City: Transfer Mobility Knowledge Across Cities"}, {"paperId": "23202067b68fabd242f610252e7813b2ef116710", "title": "Efficient Suspected Infected Crowds Detection Based on Spatio-Temporal Trajectories"}, {"paperId": "a38e2b363aec4ad1eae02a67d7dc513cbf0487d0", "title": "Dynamic Public Resource Allocation Based on Human Mobility Prediction"}, {"paperId": "b9d0571018d34f631341af8ace6d3b37796ff39d", "title": "Fine-Grained Urban Flow Inference"}, {"paperId": "612e53224d41f244994f3cac58fe1027ae36d7d3", "title": "JUST-Studio: A Platform for Spatio-Temporal Data Map Designing and Application Building"}]}
