{"paperId": "2613a2842969484176bd50ba7e9cc0c14705930c", "publicationVenue": null, "title": "Supporting Dynamic Quantization for High-Dimensional Data Analytics", "abstract": "Similarity searches are at the heart of exploratory data analysis tasks. Distance metrics are typically used to characterize the similarity between data objects represented as feature vectors. However, when the dimensionality of the data increases and the number of features is large, traditional distance metrics fail to distinguish between the closest and furthest data points. Localized distance functions have been proposed as an alternative to traditional distance metrics. These functions only consider dimensions close to query to compute the distance/similarity. Furthermore, in order to enable interactive explorations of high-dimensional data, indexing support for ad-hoc queries is needed. In this work we set up to investigate whether bit-sliced indices can be used for exploratory analytics such as similarity searches and data clustering for high-dimensional big-data. We also propose a novel dynamic quantization called Query dependent Equi-Depth (QED) quantization and show its effectiveness on characterizing high-dimensional similarity. When applying QED we observe improvements in kNN classification accuracy over traditional distance functions.", "venue": "ExploreDB@SIGMOD/PODS", "year": 2017, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-05-14", "journal": {"name": "Proceedings of the ExploreDB'17"}, "authors": [{"authorId": "2257058", "name": "Gheorghi Guzun"}, {"authorId": "1791664", "name": "G. Canahuate"}], "citations": [{"paperId": "12fd1557414f8292e421a0ad57e7f019303bc7f8", "title": "Unsupervised Analysis of Flow Cytometry Data in a Clinical Setting Captures Cell Diversity and Allows Population Discovery"}, {"paperId": "e874507168185dcb58ccb6f5bf4fd7ae6153b02f", "title": "Multi-Class Cardiovascular Diseases Diagnosis from Electrocardiogram Signals using 1-D Convolution Neural Network"}, {"paperId": "76011b970a9c588e8fd8737bf7f477adbf5a6dbd", "title": "High-dimensional similarity searches using query driven dynamic quantization and distributed indexing"}, {"paperId": "e5fe9190424230d44dc22509ae33593a331dd8e6", "title": "Distributed query-aware quantization for high-dimensional similarity searches"}]}
