{"paperId": "26170c4e06b66e6381f04150889b84c2fc3d7237", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "GraphMP: I/O-Efficient Big Graph Analytics on a Single Commodity Machine", "abstract": "Recent studies showed that single-machine graph processing systems can be as highly competitive as cluster-based approaches on large-scale problems. While several out-of-core graph processing systems and computation models have been proposed, the high disk I/O overhead could significantly reduce performance in many practical cases. In this paper, we propose GraphMP to tackle big graph analytics on a single machine. GraphMP achieves low disk I/O overhead with three techniques. First, we design a vertex-centric sliding window (VSW) computation model to avoid reading and writing vertices on disk. Second, we propose a selective scheduling method to skip loading and processing unnecessary edge shards on disk. Third, we use a compressed edge cache mechanism to fully utilize the available memory of a machine to reduce the amount of disk accesses for edges. Extensive evaluations have shown that GraphMP could outperform existing single-machine out-of-core systems such as GraphChi, X-Stream and GridGraph by up to 30, and can be as highly competitive as distributed graph engines like Pregel+, PowerGraph and Chaos.", "venue": "IEEE Transactions on Big Data", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-09", "journal": {"name": "IEEE Transactions on Big Data", "pages": "816-829", "volume": "6"}, "authors": [{"authorId": "2075416290", "name": "Peng Sun"}, {"authorId": "145868454", "name": "Yonggang Wen"}, {"authorId": "1767765", "name": "T. Duong"}, {"authorId": "33285410", "name": "Xiaokui Xiao"}], "citations": [{"paperId": "5b36dfc37ae7149936ad05e6575800dece051630", "title": "Design and Implementation of External Storage Large-Scale Graph Computing System"}, {"paperId": "c107b20d0de5f3c3c9e73eb5bd69a1cb8df6e3dd", "title": "I/O Efficient Early Bursting Cohesive Subgraph Discovery in Massive Temporal Networks"}, {"paperId": "400cf8c331e7fe95e61c35374929e2c53fcf1655", "title": "A Hybrid Update Strategy for I/O-Efficient Out-of-Core Graph Processing"}]}
