{"paperId": "2617bcb9d373962455036f31fa4d7ab69d5315aa", "publicationVenue": null, "title": "Deep Learning Enabled Classification of Cognitive Impairment Stages Using MRI Images", "abstract": "Machine learning-based computational health care systems using medical images have undergone rapid advancement in clinical disease diagnosis support. It is very crucial to identify the most common form of dementia, which is Alzheimer's Disease (AD), that progress from a pre-clinical stage called Mild Cognitive Impairment (MCI). This work focuses on the classifications of different progression stages of cognitive impairment to Alzheimer's Disease (AD), using 2D T1 weighted axial MRI images. The images obtained from the ADNI database correspond to various stages of cognitive impairment like Cognitive Normal (CN), Mild Cognitive Impairment (MCI), Early Mild Cognitive Impairment (EMCI), Late Mild Cognitive Impairment (LMCI), and Alzheimer's Disease (AD) with 3000 samples of each class. As the focus of the work is to identify the different development stages of cognitive impairment which progress to AD, it proposes a CNN-based two-class classification network for AD/MCI, AD/CN, and MCI/CN and a five-stage CNN classifier for classifying AD vs CN vs EMCI vs LMCI vs MCI stages, the result thus obtained is compared with transfer learning-based model, the Xception architecture, by performing the binary and five class classification tasks with the same dataset. The proposed CNN-based model gives an accuracy of 93.28% for AD/MCI, 91.92% for AD/CN, and 91.90% for MCI/CN, the overall accuracy of the five class classification using the CNN-based model is 93%. The Transfer learning-based work produced an accuracy of 91.33% for AD/MCI, 88.83% for AD/CN, and 86.9% for MCI/CN, 93.89% for five class classifications. The work also evaluates the class-wise performance of the five class classification tasks with both models to analyze the effectiveness of each class in the classification of cognitive impairment progression stages. The results show that both models classify all five progression stages with good accuracy and high specificity, which assures lesser false positive classification.", "venue": "2023 International Conference on Computational Intelligence and Sustainable Engineering Solutions (CISES)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-28", "journal": {"name": "2023 International Conference on Computational Intelligence and Sustainable Engineering Solutions (CISES)", "pages": "499-505"}, "authors": [{"authorId": "2224095093", "name": "Jismi K"}, {"authorId": "2224088353", "name": "Ananda Resmi S"}, {"authorId": "35159801", "name": "A. Ramanujan"}], "citations": []}
