{"paperId": "2619d2480e2d1bbe94e19fb3d34b128bac69b864", "publicationVenue": {"id": "696243a5-4e9a-411c-bcf5-13467acc4901", "name": "Hydrology and Earth System Sciences", "type": "journal", "alternate_names": ["Hydrol Earth Syst Sci"], "issn": "1027-5606", "url": "https://www.hydrology-and-earth-system-sciences.net/", "alternate_urls": ["http://www.copernicus.org/EGS/hess/hess.html"]}, "title": "Performance-based comparison of regionalization methods to improve the at-site estimates of daily precipitation", "abstract": "Abstract. In this article, we compare the performances of three regionalization approaches in improving the at-site estimates of daily precipitation. The first method is built on the idea of conventional RFA (Regional Frequency Analysis) but is based on a fast algorithm that defines distinct homogeneous regions relying on their upper tail similarity. It uses only the precipitation data at hand without the need for any additional covariate. The second is based on the region-of-influence (ROI) approach in which neighborhoods, containing similar sites, are defined for each station. The third is a spatial method that adopts Generalized Additive Model (GAM) forms for the model parameters. In line with our goal of modeling the whole range of positive precipitation, the chosen marginal distribution model is the Extended Generalized Pareto Distribution (EGPD) on which we apply the three methods. We consider a dense network composed of 1176 daily stations located within Switzerland and in neighboring countries. We compute different criteria to assess the models' performances both in the bulk of the distribution as well as in the upper tail. The results show that all the regional methods offered improved robustness over the local EGPD model. While the GAM method is more robust and reliable in the upper tail, the ROI method is better in the bulk of the distribution.\n", "venue": "Hydrology and Earth System Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-30", "journal": {"name": "Hydrology and Earth System Sciences"}, "authors": [{"authorId": "115445031", "name": "A. Haruna"}, {"authorId": "40311046", "name": "J. Blanchet"}, {"authorId": "39392363", "name": "A. Favre"}], "citations": [{"paperId": "469c533f6c021c8560a68f629662636a4fceaee2", "title": "Estimation of Intensity‐Duration‐Area‐Frequency Relationships Based on the Full Range of Non‐Zero Precipitation From Radar‐Reanalysis Data"}, {"paperId": "c98068bd7dcb499e34e6633eeb2aa074bbd7a83d", "title": "Réviser les courbes intensité-durée-fréquence dans un contexte de nouvelle donne hydro-climatique : de la détection de tendances à l’application opérationnelle"}, {"paperId": "443b69e4de077fe564f34af8812171adfaf38f42", "title": "Joint stochastic simulation of extreme coastal and offshore significant wave heights"}, {"paperId": "b5a3b74b9a27adbe2bbf63f06228345703b8df61", "title": "Determining return levels of extreme daily precipitation, reservoir inflow, and dry spells"}, {"paperId": "47e3a87b3a251125fd05ac7573f9f43a218d33f4", "title": "Modeling Intensity‐Duration‐Frequency Curves for the Whole Range of Non‐Zero Precipitation: A Comparison of Models"}]}
