{"paperId": "261973cdead565690a0d5bd02fb7dcf6830eae61", "publicationVenue": null, "title": "CRIME REDUCTION SYSTEM THROUGH BRYNE CRIMINAL JUSTICE INNOVATION", "abstract": ": Human history has been marked by an increase in population growth and a process of accelerated urbanization. Society will continue to address crime as a social problem since it has become a serious social problem. This has prompted the government and other agencies to look for ways to overcome this phenomenon. Studies have shown that management and prevention of crime can improve the quality of life which is an essential factor in producing more sustainable developments. Crime prevention is the first step in any investment in developing countries. Crime prevention is a long-term investment whose effects are not immediately apparent. In countries and individuals globally, crime harms the economy. Managing crime is an important social responsibility of law enforcement agencies. A law enforcement agency's capacity to successfully manage crime lies in its ability to make information readily available and easily accessible. The biggest problem with present procedures is the absence of expertise or data dissemination between law enforcement organizations. The said defect is exploited by criminals who commit crimes in various parts of the country by relocating and changing states. This project's objective is to develop a model that may be utilized to develop a platform for crime reduction. This study utilized an established system development methodology and implementation of the Innovations in Community Based Crime Reduction program. Although object-oriented and evolutionary approaches to system development are also effective, it is important to acknowledge them. The study revealed that there is a deficiency of investigations on an effective method of carrying out a crime prevention campaign involving multiple agencies and the community as a whole. Crime prevention program evaluations show that implementation issues and failures are common, and the examination of Community Based Crime Reduction program (CBCR) sites is no exemption. This work recommends that Community Based Crime Reduction program should be employed to reduce criminal activities and also, and system development will also be effective for crime reduction.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "81281920", "name": "W. Ajayi"}, {"authorId": "2183650274", "name": "Efekodo Kingsley Oghenekaro"}, {"authorId": "2183650270", "name": "Taiwo Mauyon Kuponu"}, {"authorId": "2183652153", "name": "A. A. Oladipupo"}], "citations": []}
