{"paperId": "261b3d31191ee3962f66a6f9eb0bcde86208f8b5", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "Machine Learning Classifiers for Predicting Influence of Digital Technology on Academic Performance of University Students", "abstract": "Students currently participate in various online communities to be highly obtainable of Digital Technologies. However, Information and Communication Technology (ICT) is vital in our lives, and it should not be forgotten that it has both beneficial and harmful consequences. ICT’s impact is undeniably growing. When we consider how often students use phones, laptops, and other types of technology in our immediate areas, it becomes evident how much they are being enslaved to the technology web. Students’ primary duty should be to pay attention to their studies and other academic activities. However, if we look closer, it may be seen that many students spend a significant amount of time playing online games, freelancing, and doing other activities. Freelancing isn’t awful, and however, as a student, we should prioritize studying over freelancing at first. Many students waste time online for non-academic reasons, and as a result, they receive poor grades in their exams. So, this paper attempts to demonstrate how much students use ICT in their academic sphere and how much performance they achieve using technologies in the educational arena. This study uses supervised machine learning classification techniques such as the Support Vector Machine (SVM), Decision Tree, Random Forest, and K-Nearest Neighbor (KNN) for model training and testing. Our machine learning system can evaluate the student’s performance level based on several input criteria labeled as poor, fair, better, and excellent. Finally, the study includes comparative analysis among several classification models, which indicates the superiority of the Random Forest method.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-03", "journal": {"name": "2022 13th International Conference on Computing Communication and Networking Technologies (ICCCNT)", "pages": "1-6"}, "authors": [{"authorId": "2198435885", "name": "Md. Shamim Parvej"}, {"authorId": "2132730944", "name": "Moustafa Abul"}, {"authorId": "2236759139", "name": "Ala Walid"}, {"authorId": "2047943229", "name": "Ferdib-Al-Islam"}, {"authorId": "2148281863", "name": "Arjan Ghosh"}], "citations": [{"paperId": "4705bb6ba92002a7cebbfe0d457ee3e373a1c547", "title": "Compact Firefly Algorithm with Deep Learning Based Chromatic Condition Predictive Model for Organic Synthesis Purification"}]}
