{"paperId": "2624a160957239aa8290b3510b82f72d67aafd95", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Novel Heterogeneous Ensemble Framework Based on Machine Learning Models for Shallow Landslide Susceptibility Mapping", "abstract": "Landslides are devastating natural disasters that seriously threaten human life and property. Landslide susceptibility mapping (LSM) plays a key role in landslide hazard management. Machine learning (ML) models are widely used in LSM but suffer from limitations such as overfitting and unreliable accuracy. To improve the classification performance of a single machine learning (ML) model, this study selects logistic regression (LR), support vector machine (SVM), random forest (RF), and gradient boosting decision tree (GBDT), and proposes a novel heterogeneous ensemble framework based on Bayesian optimization (BO), namely, stratified weighted averaging (SWA), to test its applicability in a typical landslide area in Yanbian Prefecture, China. Firstly, a dataset consisting of 1531 historical landslides was collected from field investigations and historical records, and a spatial database containing 16 predisposing factors was established. The dataset was divided into a training set and a test set in a ratio of 7:3. The results showed that SWA effectively improved the Accuracy, AUC, and robustness of the model compared to a single ML model. The SWA achieved the best classification results (Accuracy = 91.39% and AUC = 0.967). To verify the generalization ability of SWA, we selected published landslide datasets from Yanshan country and Yongxin country in China for testing. SWA also performed well, with an AUC of 0.871 and 0.860, respectively. As indicated by shapely values (SVs), Normalized Difference Vegetation Index (NDVI) is the factor that has the greatest impact on landslide occurrence. The landslide susceptibility maps obtained from this study will provide an effective reference program for land use planning and disaster prevention and mitigation projects in Yanbian Prefecture, China.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-24", "journal": {"name": "Remote. Sens.", "pages": "4159", "volume": "15"}, "authors": [{"authorId": "2234008521", "name": "Haozhe Tang"}, {"authorId": "50096702", "name": "Chang-ming Wang"}, {"authorId": "2234137730", "name": "Silong An"}, {"authorId": "2234171926", "name": "Qingyu Wang"}, {"authorId": "46274271", "name": "Chenglin Jiang"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "12460727aa2fd70b2876437bb5e832156863e31a", "title": "Landslide Hazard Assessment Combined with InSAR Deformation: A Case Study in the Zagunao River Basin, Sichuan Province, Southwestern China"}, {"paperId": "7c09abc7874c05148836e2284f513f4fe1792d00", "title": "Modeling and Evaluation of the Susceptibility to Landslide Events Using Machine Learning Algorithms in the Province of Chañaral, Atacama Region, Chile"}]}
