{"paperId": "262f55d4dae36a1e89c6f88cc0b539faed122625", "publicationVenue": {"id": "fc335b2f-499d-4590-bb2e-6a996a4d65c9", "name": "IEEE International Workshop on Measurement and Networking", "type": "conference", "alternate_names": ["M&N", "IEEE Int Workshop Meas Netw"]}, "title": "Hand-Arm Vibration Monitoring via Embedded Machine Learning on Low Power Wearable Devices", "abstract": "This paper presents a new approach for the measurement of the Hand-Arm Vibration (HAV) exposure caused by the use of vibrating tools. In so doing, a wearable system can be designed in order to be embedded on personal protection equipment of workmen, so to preserve their health and to avoid injuries. In particular, a Machine Learning (ML) model is introduced, whose aim is to distinguish between the absence and the presence of harmful vibrations. In this way, vibration dose assessment systems can operate discarding acceleration signals related to body movements shocks or any other non-vibrational signal. The classifier is trained on a dataset composed of accelerometer data acquired in a real world scenario thus ensuring the classifier performances reliability. Moreover, the classifier is designed for its deployment on a microcontroller. The data processing technique presented in this work can be implemented in portable low cost and low power devices for the measurement of the vibration transmitted to the hand of an operator due to the use of drills, jackhammers, or other vibrating tools. Indeed, Internet of Things (IoT) sensor nodes powered with Artificial Intelligence (AI) capability can be designed by following this approach. Therefore, the brand new concept of the Artificial Intelligence of Things (AIoT) is met.", "venue": "IEEE International Workshop on Measurement and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-18", "journal": {"name": "2022 IEEE International Symposium on Measurements & Networking (M&N)", "pages": "1-6"}, "authors": [{"authorId": "144960176", "name": "A. Fort"}, {"authorId": "153067851", "name": "Elia Landi"}, {"authorId": "153600650", "name": "Riccardo Moretti"}, {"authorId": "27053000", "name": "Lorenzo Parri"}, {"authorId": "40532940", "name": "G. Peruzzi"}, {"authorId": "15147730", "name": "A. Pozzebon"}], "citations": [{"paperId": "a3828b85e1ff9747711474330efda0c46810281d", "title": "A Low-Complexity FPGA-Based Neural Network for Hand-Arm Vibrations Classification"}]}
