{"paperId": "262f162a4cf9ae0b7d78bc011d6589518a250f9b", "publicationVenue": null, "title": "A new perspective for manufacturers: Cloud-based utilization of operational fleet data", "abstract": "Currently, fleet management approaches only focus on the perspective of the fleet operating company and the operators, but not on the perspective of the manufacturer of the fleet members. The manufacturer aims at optimizing existing fleets and supporting the development process of future fleet generations. Furthermore, data-driven models have increasing importance in fleet applications. Thus, this work proposes a concept for a holistic fleet management approach for manufacturers enabling the integration of real-world fleet usage data into the manufacturer’s processes. We build our concept on three layers, one for the manufacturer, the fleet operator and the machines respectively. We focus on the information flow between the layers. Thus, enabling manufacturers to integrate operational data of customers into the development process making the products more customer-oriented. Before launching data-driven fleet services extensive training data is required. However, when launching new fleets disadvantageously only little data is available. As solution, we discuss the transfer of machine learning models in between different fleets (inter-fleet transfer learning). This enables quickly launching reliable machine models for new fleets with a lack of data.", "venue": "ELIV 2021", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "ELIV 2021"}, "authors": [{"authorId": "2139428590", "name": "Friedrich von Bülow"}, {"authorId": "1601485246", "name": "F. Heinrich"}, {"authorId": "2661383", "name": "Tobias Meisen"}], "citations": [{"paperId": "bab610dd431603878b5114039aa64edea7ad3ea7", "title": "State of health forecasting of Lithium-ion batteries operated in a battery electric vehicle fleet"}, {"paperId": "8d10a870bf410af7bca72380a9d73f14c679496d", "title": "Transparent and Interpretable State of Health Forecasting of Lithium-Ion Batteries with Deep Learning and Saliency Maps"}, {"paperId": "cf0b5bf398ebcd554edd74f22dec81815692a627", "title": "Automotive Digital Twins: A Traversal Algorithm for Virtual Testing of Software over-the-air Updates"}]}
