{"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Automatic Database Knob Tuning: A Survey", "abstract": "Knob tuning plays an important role in database optimization, which tunes knob settings to optimize the database performance or improve resource utilization. However, there are several common challenges in knob tuning. First, databases have hundreds of configuration knobs, and it is hard to determine the knobs that cause the performance/resource bottlenecks. Second, most knobs are of continuous values and cause large search space, where heuristic knob tuning may not find high-performance knob settings within limited time. Third, it is increasingly tricky to conduct knob tuning with the proliferation of cloud services, where we need to tune a large number of database instances for various scenarios (e.g., different applications, datasets, and hardware). Recently, many learning-based knob tuning methods are proposed to alleviate those problems. The core idea of learning-based knob tuning is that, with the help of machine learning techniques, it is reasonable to collect knob tuning data, leverage these data to train a knob tuning model, and utilize the tuning model to recommend knob settings for new similar scenarios, so as to achieve the optimization objectives. In this paper, we provide a comprehensive survey on database knob tuning. The pipeline of knob tuning includes knob selection, feature selection, tuning methods, and transfer techniques. First, for knob selection, we introduce the main categories of database knobs and summarize existing knob selection algorithms. Second, for feature selection, we introduce commonly-used tuning features and explain existing feature selection techniques (e.g., runtime metric selection and workload encoding). Third, for tuning methods, we compare four classes of tuning methods, i.e., heuristic methods, Bayesian-optimization methods, deep-learning methods, and reinforcement-learning methods. In particular, we summarize the challenges and discuss how existing methods address those challenges. Moreover, we discuss some transfer techniques that utilize historically well-trained tuning models in new scenarios. Fourth, we discuss the implementation of automatic knob tuning methods in typical systems (e.g., commercial relational databases and Big Data analytics systems). Lastly, we provide some research challenges and future research opportunities. We believe this survey can help researchers better understand the knob tuning problems and existing approaches and further encourage them to solve the remaining problems in automatic knob tuning.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "12470-12490", "volume": "35"}, "authors": [{"authorId": "2123787551", "name": "Xinyang Zhao"}, {"authorId": "50177381", "name": "Xuanhe Zhou"}, {"authorId": "2242412700", "name": "Guoliang Li"}], "citations": [{"paperId": "3d4e8ceb150dbe4f2b6c1b83b35357e5a0636407", "title": "Budget-aware Query Tuning: An AutoML Perspective"}, {"paperId": "d9b6d17c46a48cddbff9ef900e393b745813b48e", "title": "PTSSBench: a performance evaluation platform in support of automated parameter tuning of software systems"}, {"paperId": "8ddb165278176f279ace760a8c14f5e0fcb652b0", "title": "GPTuner: A Manual-Reading Database Tuning System via GPT-Guided Bayesian Optimization"}, {"paperId": "b3422e193ad183a38c8c98525d89d85919041d6f", "title": "HWTune: A Hardware-Aware Database Tuning System with Deep Reinforcement Learning"}, {"paperId": "cd30f3b947cd12656a22226a3a5e79030b909b3b", "title": "IWEK: An Interpretable What-If Estimator for Database Knobs"}, {"paperId": "ebe7b4b3931d9df634b0e9667ec7686e1eac9c94", "title": "Grep: A Graph Learning Based Database Partitioning System"}]}
