{"paperId": "264fa31bc228c0f394eeb9cc4591cac9439920f7", "publicationVenue": null, "title": "Application of a Hadoop-based Distributed System for Offline Processing of Power Quality Disturbances", "abstract": "Electric power quality is a critical issue for electric utilities and their customers and identification of the power quality disturbances is an important task in power system monitoring and protection. Offline processing of power quality disturbances provides an economic alternative for electric distribution companies, not capable of buying enough number of power quality analyzers for monitoring the disturbances online. Due to the wide frequency range of the disturbances which may happen in a power system, a high sampling rate is necessary for digital processing of the disturbances. Therefore, a large volume of data must be processed for this purpose for each node of an electric distribution network and such a processing has not yet been practical. However, thanks to the rapid developments of digital processors and computer networks, processing big databases is not so hard today. Apache Hadoop is an open-source software framework that allows for the distributed processing of large datasets using simple programming models. In this paper, application of Hadoop distributed computing software for offline processing of power quality disturbances is proposed and it is shown that this application makes such a processing possible and leads to a very cheaper system with widespread usage, compared to the power quality analyzers.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-06-01", "journal": {"name": "International Journal of Power Electronics and Drive Systems", "pages": "695-704", "volume": "8"}, "authors": [{"authorId": "72789618", "name": "Nader Mollaei"}, {"authorId": "2053564557", "name": "S. H. Mousavi"}], "citations": [{"paperId": "5563f8771f73a3ba8d072bb5b81b7d63fc34744e", "title": "Sensible and secure IoT communication for digital twins, cyber twins, web twins"}, {"paperId": "3fece5139736d7aa48ccc35f8901a13e3867fbcf", "title": "State of the art in big data applications in microgrid: A review"}]}
