{"paperId": "2657523c524d53515293fee5722359b59167d5bb", "publicationVenue": null, "title": "Article Review: Survey Fuzzy Logic and Aprior Algorithms Employed for E-learning Environment", "abstract": "The adaptive education frameworks within e-learning platforms are designed to ensure that each learner's learning experience differs. To provide adaptive e-learning programs and research materials adapted to adaptive learning, this type of educational approach attempts to integrate the ability to understand and identify the unique needs of an individual in the context of learning with the skills needed to use suitable learning pedagogy and to improve the learning process. Thus, designing realistic student profiles and templates based on an overview of their affective states, level of experience, and individual personality traits and abilities is essential. The data collected can then be used and used effectively for the creation of an adaptive learning system. These learner models can be used in two ways once learned. The first is to educate the pedagogy of the integrated educational method suggested by the experts and designers. The second objective is to provide the framework dynamic self-learning ability based on teachers and students' behaviours to build effective pedagogy and adapt e-learning environments automatically according to pedagogies. Artificial intelligence algorithms can, for various reasons, be useful, including their ability to improve and mimic human reasoning and decision-making (learning-teaching model) and to reduce the source of uncertainty in order to achieve an effective background of learning. These leadership skills ensure progress for both the learner and the system over the lifelong learning process. In the following document, we present a survey on growing and relevant issues in the field of artificial intelligence algorithms, their advantages and drawbacks (fuzzy logic and A prior algorithm), as well as the importance of using these strategies to make e-learning system smarter and more efficient.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-24", "journal": {"name": "", "pages": "1393-1402", "volume": "12"}, "authors": [{"authorId": "1825767047", "name": "Enas Mohammed Hussein Saeed"}], "citations": [{"paperId": "a3da2d2a3122765a5e6bbefb57f6bce75e5272a7", "title": "A Hybrid Artificial Intelligence-Based System for Supporting Eco-Industrialization of Complex Manufacturing Processes"}, {"paperId": "460edd398c293f7b5305bd245b2f1c788708a3e0", "title": "Agent-Based Recommendation in E-Learning Environment Using Knowledge Discovery and Machine Learning Approaches"}, {"paperId": "f40578e5d022145ab1eb5bfd886ece56d5072616", "title": "Development of an enhanced scatter search algorithm using discrete chaotic Arnold’s cat map"}, {"paperId": "50f16f7c8f1715d04af19e4bc48dcc3a0becfb07", "title": "IMPLEMENTATION OF NEW HYBRID EVOLUTIONARY ALGORITHM WITH FUZZY LOGIC CONTROL APPROACH FOR OPTIMIZATION PROBLEMS (p. 6–14)"}]}
