{"paperId": "267cca7585ac3a2bd01470d643415c2a775f8ab6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "CCSL: A Causal Structure Learning Method from Multiple Unknown Environments", "abstract": "Most existing causal structure learning methods assume data collected from one environment and independent and identically distributed (i.i.d.). In some cases, data are collected from different subjects from multiple environments, which provides more information but might make the data non-identical or non-independent distribution. Some previous efforts try to learn causal structure from this type of data in two independent stages, i.e., first discovering i.i.d. groups from non-i.i.d. samples, then learning the causal structures from different groups. This straightforward solution ignores the intrinsic connections between the two stages, that is both the clustering stage and the learning stage should be guided by the same causal mechanism. Towards this end, we propose a unified Causal Cluster Structures Learning (named CCSL) method for causal discovery from non-i.i.d. data. This method simultaneously integrates the following two tasks: 1) clustering samples of the subjects with the same causal mechanism into different groups; 2) learning causal structures from the samples within the group. Specifically, for the former, we provide a Causality-related Chinese Restaurant Process to cluster samples based on the similarity of the causal structure; for the latter, we introduce a variational-inference-based approach to learn the causal structures. Theoretical results provide identification of the causal model and the clustering model under the linear non-Gaussian assumption. Experimental results on both simulated and real-world data further validate the correctness and effectiveness of the proposed method.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-18", "journal": {"name": "ArXiv", "volume": "abs/2111.09666"}, "authors": [{"authorId": "2154941589", "name": "Wei Chen"}, {"authorId": "2618478", "name": "Yunjin Wu"}, {"authorId": "39913331", "name": "Ruichu Cai"}, {"authorId": "1743832", "name": "Yueguo Chen"}, {"authorId": "145586380", "name": "Z. Hao"}], "citations": [{"paperId": "61523d0574d1cb6e8148edfc9c436a5bdc526ba7", "title": "Separability Analysis for Causal Discovery in Mixture of DAGs"}]}
