{"paperId": "267dfdf7b7c693442c48193d5f18feba81eb704b", "publicationVenue": null, "title": "A Short Review on Data Mining Techniques for Electricity Customers Characterization", "abstract": "An important tool to manage electrical systems is the knowledge of customers’ consumption patterns. Data Mining (DM) emerges as an important tool for extracting information about energy consumption in databases and identifying consumption patterns. This paper presents a short review on DM, with a focus on the characterization of electricity customers supported on knowledge discovery in database (KDD) process. The study includes several steps: first, few concepts of the KDD process are presented; following, a short review of clustering algorithms is presented including partitional, hierarchical, fuzzy, evolutionary methods, and Self-Organizing Maps; finally, the main concepts and methods for load classification, based on load shape indices are presented. The main objective of this work is to present a short review of DM techniques applied to identify typical load profiles in electrical systems and new customers’ classification.", "venue": "2019 IEEE PES GTD Grand International Conference and Exposition Asia (GTD Asia)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-03-19", "journal": {"name": "2019 IEEE PES GTD Grand International Conference and Exposition Asia (GTD Asia)", "pages": "194-199"}, "authors": [{"authorId": "121497420", "name": "Samuel S. Cembranel"}, {"authorId": "2558270", "name": "F. Lezama"}, {"authorId": "119708471", "name": "Jo&#x00E3;o Soares"}, {"authorId": "121370950", "name": "S&#x00E9;rgio Ramos"}, {"authorId": "120603140", "name": "Ant&#x00F3;nio Gomes"}, {"authorId": "145579951", "name": "Z. Vale"}], "citations": [{"paperId": "fd58cd4ea90cf2443f7975627c7e9dee6f5f42cc", "title": "A novel clustering based method for characterizing household electricity consumption profiles"}, {"paperId": "819303d3bdf964d84cc64f145303ad6acb2527c2", "title": "The Effect of New Specific Electrical Loads on Residential Complexes"}, {"paperId": "2450fe7a5ef2c4f40817b28aaa0d14cfad5f5d08", "title": "Clustering Electrical Customers with Source Power and Aggregation Constraints: A Reliability-Based Approach in Power Distribution Systems"}, {"paperId": "545f6f3f7e5018e555e539ba47af2c04c9766ea2", "title": "A sharing economy for residential communities with PV-coupled battery storage: Benefits, pricing and participant matching"}, {"paperId": "15927a62d759259474c9040562baa340f816cf54", "title": "Energy Profile Clustering with Balancing Mechanism towards more Reliable Distributed Virtual Nodes for Demand Response"}, {"paperId": "156e7432407d59563169d9d74d11aae1fc3705f8", "title": "Update of specific electric loads of public premises located in residential buildings"}, {"paperId": "ca548bc413ac1c187ecc29e9c55a2c8372b15cfa", "title": "Актуализация удельных электрических нагрузок помещений общественного назначения, встроенных в жилые здания"}, {"paperId": "864f4df9780357e0c610815b56ee6fc032fec359", "title": "Methods for Improving the Quality of Electrical Energy in Distribution Networks"}, {"paperId": "83e90560d0d5e63e0c42092ae03670b2b317d9db", "title": "Application of intelligent electricity metering systems for timely adjustment of standard values for electrical loads calculation"}, {"paperId": "4e0306a900628a83cabe3a997e67b35e303bc45a", "title": "Electricity Theft Detection using CNN-GRU and Manta Ray Foraging Optimization Algorithm"}, {"paperId": "911af7dd8490eeb64e329ac6e5ddf0fc697d4e13", "title": "APLICAÇÃO DE TÉCNICAS DE MINERAÇÃO DE TEXTO EM ORDENS DE SERVIÇOS DE MANUTENÇÃO DE UMA EMPRESA DO SETOR ELÉTRICO"}, {"paperId": "94a0a94701993e17d2b6dcdd2e90002bceb69b0e", "title": "An empirical analysis of domestic electricity load profiles: Who consumes how much and when?"}, {"paperId": "e0d578140e5fdb49409342eaf80b99b5e5cf986e", "title": "Heterogeneity of Electricity Consumption Patterns in Vulnerable Households"}, {"paperId": "5e7604eb1620980572f0283fe145e3cec241ad45", "title": "Beboernes betydning for den realiserede varmebesparelse ved renovering af boliger"}, {"paperId": "b0963c1cdc1b09983dcf1f517f6ceaa4bfded37e", "title": "Identifying Similar Top-K Household Electricity Consumption Patterns"}]}
