{"paperId": "268aece62d0208a487defd8ee6f3a663700785d2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Computation Offloading for Vehicular Environments: A Survey", "abstract": "With significant advances in communication and computing, modern day vehicles are becoming increasingly intelligent. This gives them the ability to contribute to safer roads and passenger comfort through network devices, cameras, sensors, and computational storage and processing capabilities. However, to run new and popular applications, and to enable vehicles operating autonomously requires massive computational resources. Computational resources available with the current day vehicles are not sufficient to process all these demands. In this situation, other vehicles, edge servers, and servers in remote data centers can help the vehicles by lending their computing resources. However, to take advantage of these computing resources, computation offloading techniques have to be leveraged to transfer tasks or entire applications to run on other devices. Such computation offloading can lead to improved performance and Quality of Service (QoS) for applications and for the network. However, computation offloading in a highly dynamic environment such as vehicular networks is a major challenge. Therefore, this survey aims to review and organize the computation offloading literature in vehicular environments. In addition, we demystify some concepts, propose a taxonomy with the most important aspects and classify most works in the area according to each category. We also present the main tools, scenarios, subjects, strategies, objectives, etc., used in the works. Finally, we present the main challenges and future directions to guide future research in this active research area.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "198214-198243", "volume": "8"}, "authors": [{"authorId": "1637373799", "name": "Alisson Barbosa De Souza"}, {"authorId": "1925216", "name": "P. Rego"}, {"authorId": "145050522", "name": "T. Carneiro"}, {"authorId": "33743578", "name": "J. D. C. Rodrigues"}, {"authorId": "117940278", "name": "P. P. R. Filho"}, {"authorId": "41051846", "name": "J. N. De Souza"}, {"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "51905607", "name": "V. H. C. de Albuquerque"}, {"authorId": "48440849", "name": "B. Sikdar"}], "citations": [{"paperId": "8a64b0611a947243f02772f19ac4aa72eed0bbc8", "title": "Enabling Safe ITS: EEG-Based Microsleep Detection in VANETs"}, {"paperId": "6b3910f6a9e94d775d4f643871ed054c79c3961f", "title": "A Review of Driving Style Recognition Methods From Short-Term and Long-Term Perspectives"}, {"paperId": "5e6c34aa93794e41270df0f2ed2d8919546ca2ce", "title": "A Survey of Computation Offloading with Task Type"}, {"paperId": "89a8c154c6eb04d976059b13c3e9995b1e351857", "title": "A Bee Colony-Based Algorithm for Task Offloading in Vehicular Edge Computing"}, {"paperId": "5594116867bba459f14e735ff6046f8fb34d9e10", "title": "A Deep-Reinforcement-Learning-Based Computation Offloading With Mobile Vehicles in Vehicular Edge Computing"}, {"paperId": "a831f6796ff540ae12e7c1dc02618c5d133a6774", "title": "A Markov Decision Process Solution for Energy-Saving Network Selection and Computation Offloading in Vehicular Networks"}, {"paperId": "42afd2e71d706ece24245e7ffb33d72689c907d4", "title": "Leveraging the Edge and Cloud for V2X-Based Real-Time Object Detection in Autonomous Driving"}, {"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain."}, {"paperId": "5cd66540b2a849048899dbfee1d5befee6f5e81d", "title": "Handover-Enabled Dynamic Computation Offloading for Vehicular Edge Computing Networks"}, {"paperId": "fb5e2eca7ec1537d438f652b1079aab04d6b4221", "title": "Reinforcement Learning Methods for Computation Offloading: A Systematic Review"}, {"paperId": "432d53bc701a455a079a776896b61c77e2b87c10", "title": "Blockchain-Assisted Reputation Management Scheme for Internet of Vehicles"}, {"paperId": "afdd90a19c15fe429095ef6a413042429850b82d", "title": "Federated-Learning-Based Energy-Efficient Load Balancing for UAV-Enabled MEC System in Vehicular Networks"}, {"paperId": "b2cec2959c5759d7d83c75dad81092656a96ea31", "title": "A Smart Road Side Unit in a Microeolic Box to Provide Edge Computing for Vehicular Applications"}, {"paperId": "779bb90c7c6cc62a90fd414e187c88abfe473acb", "title": "Collaborative Reinforcement Learning for Multi-Service Internet of Vehicles"}, {"paperId": "54cc3166cca123ee608735e9fac07657e70553be", "title": "Piece-wise pricing optimization with computation resource constraints for parked vehicle edge computing"}, {"paperId": "ea111a40ca2411fc8f690017996d3afc24c91364", "title": "A multi-aerial base station assisted joint computation offloading algorithm based on D3QN in edge VANETs"}, {"paperId": "e532d26bf121edb88fd7c640bcc75146f8ee6825", "title": "A comprehensive review of task offloading in edge computing"}, {"paperId": "b4d9a319e129945343806026227942a7d2340725", "title": "Decision Algorithm for Computational Offloading in Vehicular Fog Computing with Pedestrians"}, {"paperId": "5cfe28bd7a73afe9fe25d29567bfcfa21ac9ace0", "title": "Towards Energy-And Cost-Efficient Sustainable MEC-Assisted Healthcare Systems"}, {"paperId": "bd577a130c9d7d7a21685d2337c7159eab9c4cf8", "title": "Joint resource trading and computation offloading in blockchain enhanced D2D-assisted mobile edge computing"}, {"paperId": "ec744f07dc0464917de06f628ef3291741e7f55e", "title": "Offloading Strategy for Vehicles in the Architecture of Vehicle-MEC-Cloud"}, {"paperId": "cb8010c5590777bd886d12a681779ba455e44eb5", "title": "Task offloading in fog computing: A survey of algorithms and optimization techniques"}, {"paperId": "6e170961dd7848b2571bdae23b8c5a9fe910b0c7", "title": "Federated Deep Reinforcement Learning-Based Task Allocation in Vehicular Fog Computing"}, {"paperId": "c70d7be6ccbc3887d216450f1790ecff5375b640", "title": "A Context-Oriented Framework and Decision Algorithms for Computation Offloading in Vehicular Edge Computing"}, {"paperId": "20fb6808cb66d21e020dd94476213805aa483b54", "title": "Algoritmo de Decisão para Offloading Computacional em Vehicular Fog Computing com Pedestres"}, {"paperId": "fe0e06efeec920c1895decb073102bec48adf70f", "title": "Survey on computation offloading in UAV-Enabled mobile edge computing"}, {"paperId": "b3bc31fcab470f4aba60dee2ccd696c37656ad7c", "title": "Computation offloading in mobile edge computing networks: A survey"}, {"paperId": "4cb5dae2f8ca4e58570db271a5375e5d3961e153", "title": "Task offloading in vehicular fog computing: State-of-the-art and open issues"}, {"paperId": "7b60fa70b5240e0d899bf6e7b9f8843628246bf8", "title": "A Survey on Offloading in Federated Cloud-Edge-Fog Systems with Traditional Optimization and Machine Learning"}, {"paperId": "bee43cc2e7c64fd0083571bf4f0899cc0c61baaf", "title": "Detection and Segmentation of Damaged Photovoltaic Panels Using Deep Learning and Fine-tuning in Images Captured by Drone"}, {"paperId": "fd99f8dd9fb26289ee694d1f60a88cd5c7be4197", "title": "Vehicular Edge Computing: Architecture, Resource Management, Security, and Challenges"}, {"paperId": "c5f577d8ce18bf5e06101e79e832f98e02e60094", "title": "Edge Computing and Deep Learning Enabled Secure Multitier Network for Internet of Vehicles"}, {"paperId": "9d14af1b9dda1433c651a273c0bd0e4b40cd6e47", "title": "A context-oriented framework for computation offloading in vehicular edge computing using WAVE and 5G networks"}, {"paperId": "b85b4ce011cc478e35b042f6b3f965b3b15804f9", "title": "Secure Multi-access Edge Computing Assisted Maneuver Control for Autonomous Vehicles"}, {"paperId": "1c862983fb39473c91edd4295a47c5f2ac744014", "title": "A Survey of Autonomous Vehicles: Enabling Communication Technologies and Challenges"}, {"paperId": "61e46d0132ed08115a8d9ed4d7ece4262a1fd76b", "title": "Fuzzy Logic Based Binary Computation Offloading Scheme in V2X Communication Networks"}, {"paperId": "629da7c83d9dcaa1f615bb44e57dbfe1d4d08041", "title": "Offloading Using Traditional Optimization and Machine Learning in Federated Cloud–Edge–Fog Systems: A Survey"}, {"paperId": "e408af9c5f68beb9838532405cd0abba86681cb9", "title": "Offloading Mechanisms Based on Reinforcement Learning and Deep Learning Algorithms in the Fog Computing Environment"}, {"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions"}, {"paperId": "867b8d893b2cf6bd5b667d183b64de2d149bdfb2", "title": "Platooning-as-a-Service in a Multi-Operator ETSI MEC Environment"}, {"paperId": "e0bfd4f8f9cf89f59e4b1561e37b776eec2128f3", "title": "Reinforcement Learning Methods for Computing Offloading: A Systematic Review"}, {"paperId": "90701bc77eae73acc8fbff26fc2efa36c4d04e6e", "title": "Multi-Objective Task Assignment Solution for Parked Vehicular Computing"}, {"paperId": "ef63e24759d98eec37c36646bd1b35a2c66d9a80", "title": "Dynamic Service Placement in Multi-access Edge Computing: a Systematic Literature Review"}, {"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks"}, {"paperId": "1d36619767d77587ccc629fbff345ba0341450c6", "title": "A Survey of Vehicular Network Systems for Road Traffic Management"}, {"paperId": "b6a99a08fecfd9eed08d000a467c21d07a21367c", "title": "Delay Constrained Hybrid Task Offloading of Internet of Vehicle: A Deep Reinforcement Learning Method"}, {"paperId": "3a50a2d061da1df93ea53ae559d0557be4464e28", "title": "Street Smart in 5G: Vehicular Applications, Communication, and Computing"}, {"paperId": "8c2290cc1555209dcb6affdf4db0ff96370703ed", "title": "Traffic reduction technologies and data aggregation control to minimize latency in IoT systems"}, {"paperId": "1200b6b81f7f4645ebc3d6005a990e30b30b1343", "title": "System Architecture for Autonomous Vehicles"}]}
