{"paperId": "2696dbae07d13367d8fc7a9f1ace1cb815a746a9", "publicationVenue": null, "title": "Tydi-lang: A Language for Typed Streaming Hardware", "abstract": "Transferring composite data structures with variable-length fields often requires designing unique protocols, causing incompatibility issues and decreased collaboration among hardware developers, especially in the open-source community. Because the high-level meaning of a protocol is often lost in translation to low-level languages when a custom protocol needs to be designed, extra documentation is required, the interpretation of which introduces new opportunities for errors. The Tydi specification (Tydi-spec) was proposed to address the issues by codifying the complex structures in a type and providing a standard protocol to transfer typed data among components. This paper presents Tydi-lang, a language that incorporates Tydi-spec for describing typed streams and offers templates for reusable components. An open-source compiler from Tydi-lang to Tydi intermediate representation (Tydi-IR) is implemented, and a Tydi-IR to VHDL compiler is utilized. Through Tydi-lang examples translating high-level SQL to VHDL, we demonstrate its efficiency in raising abstraction levels and reducing design effort.", "venue": "SC Workshops", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-12-12", "journal": {"name": "Proceedings of the SC '23 Workshops of The International Conference on High Performance Computing, Network, Storage, and Analysis"}, "authors": [{"authorId": "2195490447", "name": "Yongding Tian"}, {"authorId": "2196533662", "name": "Matthijs A. Reukers"}, {"authorId": "1387519224", "name": "Z. Al-Ars"}, {"authorId": "11983170", "name": "P. Hofstee"}, {"authorId": "69473390", "name": "M. Brobbel"}, {"authorId": "8751826", "name": "J. Peltenburg"}, {"authorId": "2463330", "name": "J. V. Straten"}], "citations": [{"paperId": "007911af6d7eccc41488c8833fdb922f3731df9d", "title": "Tydi-Chisel: Collaborative and Interface-Driven Data-Streaming Accelerators"}, {"paperId": "693aadb6c397ce176624ea73dfe8d619907acf14", "title": "An Intermediate Representation for Composable Typed Streaming Dataflow Designs"}]}
