{"paperId": "26a35eefcbf2d0598e5d9b020030d9dd48d572eb", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Enhancing Mental Health Condition Detection on Social Media through Multi-Task Learning", "abstract": "Objective: Mental health conditions are traditionally modeled individually, which ignores the complex, interconnected nature of mental health disorders, which often share overlapping symptoms. This study aims to develop an integrated multi-task learning framework to enhance the detection of mental health conditions. Method: Utilizing datasets from Reddit's SuicideWatch and Mental Health Collection (SWMH) and Psychiatric-disorder Symptoms (PsySym), the study develops a BERT-based multi-task learning framework. This framework leverages pre-trained embedding layers of BERT variants to capture linguistic nuances relevant to various mental health conditions from social media narratives. The approach is tested against the two datasets, comparing multitask modeling with a wide array of single-task baselines and large language models (LLM). Results: The multi-task learning framework demonstrated higher performance in efficiently predicting mental health conditions together compared to single-task models and general-purpose LLMs. Specifically, the framework achieved higher F1 scores across multiple conditions, with notable improvements in recall and precision metrics. This indicates more accurate modeling of mental health disorders when considered together, rather than in isolation. Conclusion: The study confirms the effectiveness of a multi-task learning approach in enhancing the detection of mental health conditions from social media data. It sets a new precedent in computational psychiatry and suggests future explorations into multi-task frameworks for deeper insights into mental health disorders.", "venue": "medRxiv", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2024-02-27", "journal": null, "authors": [{"authorId": "2287749842", "name": "LL.M Jiawen Liu"}, {"authorId": "2287429325", "name": "Menglu Su"}, {"authorId": "2287314455", "name": "Department"}], "citations": []}
