{"paperId": "26a8bc2b60968ddfba424ba2db0d19f27e179bae", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Current Challenges Supporting School-Aged Children with Vision Problems: A Rapid Review", "abstract": "Many children have undetected vision problems or insufficient visual information processing that may be a factor in lower academic outcomes. The aim of this paper is to contribute to a better understanding of the importance of vision screening for school-aged children, and to investigate the possibilities of how eye-tracking (ET) technologies can support this. While there are indications that these technologies can support vision screening, a broad understanding of how to apply them and by whom, and if it is possible to utilize them at schools, is lacking. We review interdisciplinary research on performing vision investigations, and discuss current challenges for technology support. The focus is on exploring the possibilities of ET technologies to better support screening and handling of vision disorders, especially by non-vision experts. The data orginate from a literature survey of peer-reviewed journals and conference articles complemented by secondary sources, following a rapid review methodology. We highlight current trends in supportive technologies for vision screening, and identify the involved stakeholders and the research studies that discuss how to develop more supportive ET technologies for vision screening and training by non-experts.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-17", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2008210453", "name": "Qasim Ali"}, {"authorId": "2124792", "name": "I. Heldal"}, {"authorId": "1907647", "name": "C. Helgesen"}, {"authorId": "4722504", "name": "G. Krūmiņa"}, {"authorId": "2515907", "name": "Cristina A. Costescu"}, {"authorId": "1694867", "name": "A. Kovari"}, {"authorId": "40323433", "name": "Jozsef Katona"}, {"authorId": "49820786", "name": "Serge Thill"}], "citations": [{"paperId": "6ae9c0c8b2ce03bb3c8252aa51c157e755e43350", "title": "Discovering the Conceptual Analysis of Interfusion Augmented Reality Model for Visually Impaired Interaction Experience Through Rapid Review Approach"}, {"paperId": "b3e2b68f8ecacfda72714a1bc258ed3262711d1f", "title": "A quantization algorithm of visual fatigue based on underdamped second order stochastic resonance for steady state visual evoked potentials"}, {"paperId": "e5962a706ba1c49f848dcf7e047bb9ac3501e66a", "title": "Technologies Supporting Screening Oculomotor Problems: Challenges for Virtual Reality"}, {"paperId": "52a317dfd209ca97c5f84856fb83b6da630aff00", "title": "Towards Developing an Animation Kit for Functional Vision Screening with Eye Trackers"}, {"paperId": "c1a3275e5a4e3ec228d0eaab1d128a208311d2fe", "title": "Analysis of Eye Tracking Data: Supporting Vision Screening with Eye Tracking Technologies"}, {"paperId": "7e8597ac2f4da1bc279043df0eabc8103104209e", "title": "Pediatric and School-Age Vision Screening in the United States: Rationale, Components, and Future Directions"}, {"paperId": "25057559b9bbb42074c7aaadc674f34225861046", "title": "Development of Vision Screening Tool in Virtual Reality: A Usability Assessment Study"}, {"paperId": "f8863915acf7699b6e249b6525a4ad1f9632cca7", "title": "Displaying Software Installation Agreements to Motivate Users’ Reading"}, {"paperId": "fe82e13e5c57d7edf1a1d8f31aafd00b1130c076", "title": "The effectiveness of using peek acuity in vision screening for the admission of elementary school students"}, {"paperId": "24c3f545f613afe8e2bcbf34bde263a216aef46f", "title": "Research Directions of Applied Cognitive Sciences"}, {"paperId": "33c11bdee4aa45adba67d71b4d6282b538483dc6", "title": "Demo Paper: Challenges for Eye-tracker Based Immersive VR for Vision Problems"}, {"paperId": "1c0ca267ba4ac64e085b27e67a452ec0e9f0718c", "title": "Towards a Framework for Visualization and Analysis of Eye Tracking Data for Functional Vision Screening"}]}
