{"paperId": "26b29b065f1f6cdc1bc99e25dcc490f3ccabe419", "publicationVenue": null, "title": "A Review on Indoor Air Quality Monitoring using IoT at Campus Environment", "abstract": "Indoor Air Quality (IAQ) systems provide a feasible way to maintain a healthy environment. The purpose of this study is to investigate IAQ monitoring systems, summarize existing studies, and to recommend research on IAQ monitoring that using the Internet of Things (IoT). In this systematic review the author analyzes and summarizes articles about IAQ using IoT, obtained from three databases. Based on the criteria, there were 36 studies selected that discusses IAQ, 24 are system development, six are evaluation and comparative articles, three studies proposes methods, and the other three are review articles. From the articles, there are only six researchers have conducted research on campus environment. The relevant past research was reviewed and provided discussion material on monitoring systems, sensors, devices used, and Internet of Things for Indoor Air Quality.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "1752895597", "name": "A. A. Hapsari"}, {"authorId": "3455086", "name": "Asif Iqbal Hajamydeen"}, {"authorId": "145920187", "name": "M. I. Abdullah"}], "citations": [{"paperId": "9d743509cf8372b2bf807654c80992916badf691", "title": "IoT Based Indoor Air and Water Quality Monitoring System Using Node-RED"}, {"paperId": "26b647455c0c215cc40c1e701c240462610ac81f", "title": "Design and Simulation of Environment Indoor Air Quality Monitoring and Controlling System using IoT Technology"}, {"paperId": "2d5b80a7594c72b1b8978459a67164d9e66c4b50", "title": "Achieving better indoor air quality with IoT systems for future buildings: Opportunities and challenges."}, {"paperId": "a75187a71d5ada6e7185ab42c391afb2a9cfeaec", "title": "A Survey on IOT Based Air Pollution Monitoring System"}, {"paperId": "ff8e7a59758ccacf92a5391fa8df264b411f9737", "title": "Exigency for the Control and Upgradation of Indoor Air Quality—Forefront Advancements Using Nanomaterials"}, {"paperId": "ede8f74cecd04f42b99ef6793f639cca8d531b8b", "title": "Design and Development of Virtual Autopsy System for Teaching Medical Undergraduates"}, {"paperId": "de9d0e60f2a9a09d813ebf4171665b58e94463e3", "title": "Comprehensive survey on air quality monitoring systems based on emerging computing and communication technologies"}, {"paperId": "74501f3d173d83d31515cb7c0c2dcfc0374e8d68", "title": "Implementation of an Energy Efficient Framework for Air Quality Monitoring in the Cremation Center based on Improved chacha20 Stream Cipher for Secure Data Transmission"}, {"paperId": "79ce07be5e2e609c253ba91588983a21759058cf", "title": "Real Time Monitoring Approach for Underground Mine Air Quality Pollution Monitoring System Based on IoT Technology"}, {"paperId": "ffb8939d74f27e5219bc34ff2b7e850ec2a3b96e", "title": "Indoor Air Quality Monitoring Systems and COVID-19"}, {"paperId": "1ade07ff53df750c81551aead6c9ac85da885105", "title": "Inter-comparison of environmental low-cost sensors on Arduino platform"}, {"paperId": "15cfeb11d333d7eab52abf500c75eee6a0237798", "title": "Indoor Air Quality Monitoring System with Node.js and MQTT Application"}, {"paperId": "ce30176adfc480c1f8676147b7ae39ada6600925", "title": "Environment indoor air quality assessment using fuzzy inference system"}, {"paperId": "531f5caf8092d1a1b4265c1d370e06636c057b1d", "title": "Towards Elderly Monitoring Management System Using IOT"}, {"paperId": "b8cb0985a351717d16eb1b512f523b6bbaf4e7d2", "title": "Evolving Air Pollution Monitoring Systems for Green 5G: From Cloud to Edge"}, {"paperId": "7a26a6925126abab777157840a6f5b3323377237", "title": "Real Time Indoor Air Quality Monitoring System Based on IoT using MQTT and Wireless Sensor Network"}, {"paperId": "3ee92ae24fa410ba3485db1ccf03151ceb192650", "title": "A Smart Automated Greenhouse: Soil Moisture, Temperature Monitoring and Automatic Water Supply System (Peaty, Loam and Silty)"}, {"paperId": "029c22e1901c9892f5ec424092cf889d776a6faa", "title": "Air Quality Monitoring Using IoT: A Survey"}, {"paperId": "0e9be50a29e467af00c97d78d4601f03fa55019b", "title": "Examining Effectiveness and User Experiences in 3D Mobile based Augmented Reality for MSU Virtual Tour"}, {"paperId": "06ef5584b6154bfb8477dd46d641414304b80564", "title": "A Survey on Smart Monitoring System of Environment Based on IoT"}, {"paperId": "ca55ff9aee3d64365fbf0ab03c45f8d162232993", "title": "IOT enabled Cloud based application for Air Quality Monitoring System-“O2 TOCSIN”"}]}
