{"paperId": "26becd54896b2ac9d59f56b7a460676339e72ee7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Identifying Similarities of Big Data Projects–A Use Case Driven Approach", "abstract": "Big data is considered as one of the most promising technological advancements in the last decades. Today it is used for a multitude of data intensive projects in various domains and also serves as the technical foundation for other recent trends in the computer science domain. However, the complexity of its implementation and utilization renders its adoption a sophisticated endeavor. For this reason, it is not surprising that potential users are often overwhelmed and tend to rely on existing guidelines and best practices to successfully realize and monitor their projects. A valuable source of knowledge are use case descriptions, of which a multitude exists, each of them with a varying information density. In this design science research endeavor, 43 use cases are identified by conducting a thorough literature review in combination with the application and adaption of a corresponding template for big data projects. By a subsequent categorization, which is performed by identifying and employing a hierarchical clustering algorithm, nine different standard use cases emerge, as the contribution’s artifact. This provides decision-makers with an initial entry point, which can be utilized to shape their project ideas, not only by identifying the general meaningfulness of their potential big data project but also in terms of concrete implementation details.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "186599-186619", "volume": "8"}, "authors": [{"authorId": "94646104", "name": "M. Volk"}, {"authorId": "133861075", "name": "D. Staegemann"}, {"authorId": "52474234", "name": "I. Trifonova"}, {"authorId": "1904493", "name": "Sascha Bosse"}, {"authorId": "1802804", "name": "K. Turowski"}], "citations": [{"paperId": "c534db94c463bb089462620731eb7d768ce07376", "title": "An Overview of the Approaches for Generating Test Data in the Context of the Quality Assurance of Big Data Applications"}, {"paperId": "6d26057f202f3346785eec76e85ecd44d9a67c80", "title": "Factors for the implementation of the circular economy in Big Data environments in service companies in post pandemic times of COVID-19: The case of Colombia"}, {"paperId": "91a6858aa5969fb55eb2a12f6b86556b0acc76d0", "title": "Drivers and impact of big data analytic adoption in the retail industry: A quantitative investigation applying structural equation modeling"}, {"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect"}, {"paperId": "46ee405bd0af7e67f8fe990019f8715188f89df6", "title": "Factors Affecting Big Data Adoption: An Empirical Study in Small and Medium Enterprises in Vietnam"}, {"paperId": "9709a7d038c891df9bbe98f4275348a2e2d988b3", "title": "Exploring the Test Driven Development of an Information Retrieval System"}, {"paperId": "fd9f442153d1f3929f2b899b76469477b543a68a", "title": "Lowering Big Data Project Barriers: Identifying System Architecture Templates for Standard Use Cases in Big Data"}, {"paperId": "e5d6e32a3a6b9184693a1ae36573579c64ba25b6", "title": "Implementing Test Driven Development in the Big Data Domain: A Movie Recommendation System as an Exemplary Case"}, {"paperId": "1cf41445fe877a5f323c4c427357c455d6d440d1", "title": "Exploring the Test Driven Development of a Fraud Detection Application using the Google Cloud Platform"}, {"paperId": "8df7def877501efcbbb544c78e504a6c32118d38", "title": "A Preliminary Overview of the Situation in Big Data Testing"}, {"paperId": "5bb1652d1a097945001aa27414c261bf751f3806", "title": "Challenges in Data Acquisition and Management in Big Data Environments"}]}
