{"paperId": "26c9f7542ea711ee40989b5e489578c61de80db6", "publicationVenue": {"id": "b5038ebc-7250-4e6b-807f-7150ef007dd1", "name": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "alternate_names": ["Proc ACM Meas Anal Comput Syst"], "issn": "2476-1249", "url": "https://dl.acm.org/pub.cfm?id=J1567"}, "title": "ECI-Cache", "abstract": "In recent years, high interest in using Virtual Machines (VMs) in data centers and Cloud computing has significantly increased the demand for high-performance data storage systems. A straightforward approach to provide a high performance storage system is using Solid-State Drives (SSDs). Inclusion of SSDs in storage systems, however, imposes significantly higher cost compared to Hard Disk Drives (HDDs). Recent studies suggest using SSDs as a caching layer for HDD-based storage subsystems in virtualization platforms. Such studies neglect to address the endurance and cost of SSDs, which can significantly affect the efficiency of I/O caching. Moreover, previous studies only configure the cache size to provide the required performance level for each VM, while neglecting other important parameters such as cache write policy and request type, which can adversely affect both performance-per-cost and endurance. In this paper, we present a new high-Endurance and Cost-efficient I/O Caching (ECI-Cache) scheme for virtualized platforms, which can significantly improve both the performance-per-cost and endurance of storage subsystems as opposed to previously proposed I/O caching schemes. Unlike traditional I/O caching schemes which allocate cache size only based on reuse distance of accesses, we propose a new metric, Useful Reuse Distance (URD), which considers the request type in reuse distance calculation, resulting in improved performance-per-cost and endurance for the SSD cache. Via online characterization of workloads and using URD, ECI-Cache partitions the SSD cache across VMs and is able to dynamically adjust the cache size and write policy for each VM. To evaluate the proposed scheme, we have implemented ECI-Cache in an open source hypervisor, QEMU (version 2.8.0), on a server running the CentOS 7 operating system (kernel version 3.10.0-327). Experimental results show that our proposed scheme improves the performance, performance-per-cost, and endurance of the SSD cache by 17%, 30% and 65%, respectively, compared to the state-of-the-art dynamic cache partitioning scheme.", "venue": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-03", "journal": {"name": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "pages": "1 - 34", "volume": "2"}, "authors": [{"authorId": "40914288", "name": "Saba Ahmadian"}, {"authorId": "145929920", "name": "O. Mutlu"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "e3df6c77d2c9e66958714c30f5847c19bdcd7442", "title": "Online Monte Carlo Planning with QoS Subgoals for Data Caching in ITS MEC Networks"}, {"paperId": "a99aba1d1a6657860417a312def18f3587c8113e", "title": "Re-architecting I/O Caches for Emerging Fast Storage Devices"}, {"paperId": "5bca74c46e61b057cd9d17f73d2bcd0faf110391", "title": "Multi-resource fair allocation for consolidated flash-based caching systems"}, {"paperId": "e305657709d755127dc95b655bfd59465a65d31f", "title": "CoPA: Cold Page Awakening to Overcome Retention Failures in STT-MRAM Based I/O Buffers"}, {"paperId": "e1e14fc15dd52b411886bdcf173e9bd7d6e04ab8", "title": "RC-RNN: Reconfigurable Cache Architecture for Storage Systems Using Recurrent Neural Networks"}, {"paperId": "275fd6a0f7b37a00947506c66849acac3d673f75", "title": "ETICA: Efficient Two-Level I/O Caching Architecture for Virtualized Platforms"}, {"paperId": "7e5ba999baf58eb71cb021151db280d2d5470519", "title": "MLCache: A Space-Efficient Cache Scheme based on Reuse Distance and Machine Learning for NVMe SSDs"}, {"paperId": "5d3478e924e3ea1688e2876fd4938d972655770c", "title": "ECI-Cache: A High-Endurance and Cost-Efficient I/O Caching Scheme for Virtualized Platforms"}, {"paperId": "049af837db8c08860442fb9fe437788acee45028", "title": "ECI-Cache: A High-Endurance and Cost-Efficient I/O Caching Scheme for Virtualized Platforms"}, {"paperId": "3dc822204575cc5a50a96996c607b73457aaa016", "title": "ReCA: An Efficient Reconfigurable Cache Architecture for Storage Systems with Online Workload Characterization"}]}
