{"paperId": "26d70b3271e1eb6994d8d4f8ac0004c379f2d696", "publicationVenue": null, "title": "Importance of Application-Level Resource Management in Multi-Cloud Deployments", "abstract": "Cloud service providers started with Infrastructure as a Service (IaaS) offerings and over time expanded into Platform as a Service (PaaS) and Software as a Service (SaaS). Even though each provider has a rich product offering, there are many scenarios where a multi-cloud strategy is desirable: utilizing economic dynamics, preventing data lock-in with one vendor, circumventing geographic restrictions, complying with local regulations, or combining on-premise and public-cloud resources. The challenge from a consumer perspective with multi-cloud deployments is the lack of a common abstraction for the offered products and a standardized way to express all of the application requirements for the resulting deployments. In this paper, we contribute by making yet another case for multi-cloud deployments and by predicting the emergence of a new generation of application-level resource managers which will natively support multi-cloud for enterprise applications. We identify three main components of the feedback loop controlled application-level resource managers: the software life-cycle manager, the data storage and access manager, and the service execution manager.", "venue": "2019 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "139-144"}, "authors": [{"authorId": "35413632", "name": "Z. Dimitrijevic"}, {"authorId": "1793101", "name": "Cetin Sahin"}, {"authorId": "2740089", "name": "Christian Tinnefeld"}, {"authorId": "2233699", "name": "J. Patvarczki"}], "citations": [{"paperId": "1f4e7029b6adfa934f3ca2f8126e89932951df34", "title": "DDBJ Database updates and computational infrastructure enhancement"}]}
