{"paperId": "26da3c3a8751d4120f0dffb21d16be0e7445307d", "publicationVenue": null, "title": "Theoretical aspects of prescribing ustekinumab as first-line therapy for Crohn’s disease", "abstract": "The treatment of Crohn’s disease is a complex process in which it is necessary to take into account not only the current condition of the patient and the risks of disease progression, but also the sequence of therapy. To date, only biological drugs can change the course of the disease, but their number is limited and they should be prescribed taking into account the choice of the optimal sequence for each patient, since the effectiveness of any biological drug is affected by previous treatment. Unfortunately, there are no common recommendations on the sequence of choosing biological drugs, and the issue of choosing a first-line drug is relevant. Ustekinumab is a biologic agent targeting interleukin-12 and 23 that has been shown to be effective and safe in the treatment of both patients after TNF-alpha inhibitors and bionaive patients. It has also been shown to be effective in the treatment of strictures and perianal manifestations of Crohn’s disease. Ustekinumab is also effective against articular extraintestinal manifestations such as arthralgia and psoriatic arthritis. A high response rate to ustekinumab was also found in patients with dermatological manifestations – psoriasis, pyoderma gangrenosum, and erythema nodosum. In addition, a good safety profile allows its use in elderly patients. Of particular interest is the direct comparison of biologics. To date, there is only one randomized head-to-head trial of ustekinumab and adalimumab showing comparable efficacy results. And there is also data from a post hoc analysis of randomized trials, where its effectiveness is comparable to infliximab. Thus, ustekinumab can be prescribed for the treatment of Crohn’s disease, including in the first line of therapy.", "venue": "Meditsinskiy sovet = Medical Council", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-25", "journal": {"name": "Meditsinskiy sovet = Medical Council"}, "authors": [{"authorId": "13526920", "name": "M. Shapina"}], "citations": []}
