{"paperId": "26e82e8361be1a672c1098cf144c6fffe8c0ee27", "publicationVenue": {"id": "bb899a20-6789-46e4-9ed0-c7c284028fd9", "name": "JMIR mHealth and uHealth", "type": "journal", "alternate_names": ["JMIR mhealth uhealth", "Jmir mhealth and uhealth", "Jmir mhealth uhealth"], "issn": "2291-5222", "url": "https://mhealth.jmir.org/", "alternate_urls": ["https://mhealth.jmir.org/2016/1/e15/"]}, "title": "Digital Biomarker–Based Studies: Scoping Review of Systematic Reviews", "abstract": "Background Sensors and digital devices have revolutionized the measurement, collection, and storage of behavioral and physiological data, leading to the new term digital biomarkers. Objective This study aimed to investigate the scope of clinical evidence covered by systematic reviews (SRs) of randomized controlled trials involving digital biomarkers. Methods This scoping review was organized using the PRISMA-ScR (Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews) guidelines. With the search limited to English publications, full-text SRs of digital biomarkers included randomized controlled trials that involved a human population and reported changes in participants’ health status. PubMed and the Cochrane Library were searched with time frames limited to 2019 and 2020. The World Health Organization’s classification systems for diseases (International Classification of Diseases, Eleventh Revision), health interventions (International Classification of Health Interventions), and bodily functions (International Classification of Functioning, Disability, and Health [ICF]) were used to classify populations, interventions, and outcomes, respectively. Results A total of 31 SRs met the inclusion criteria. The majority of SRs studied patients with circulatory system diseases (19/31, 61%) and respiratory system diseases (9/31, 29%). Most of the prevalent interventions focused on physical activity behavior (16/31, 52%) and conversion of cardiac rhythm (4/31, 13%). Looking after one’s health (physical activity; 15/31, 48%), walking (12/31, 39%), heart rhythm functions (8/31, 26%), and mortality (7/31, 23%) were the most commonly reported outcomes. In total, 16 physiological and behavioral data groups were identified using the ICF tool, such as looking after one’s health (physical activity; 14/31, 45%), walking (11/31, 36%), heart rhythm (7/31, 23%), and weight maintenance functions (7/31, 23%). Various digital devices were also studied to collect these data in the included reviews, such as smart glasses, smartwatches, smart bracelets, smart shoes, and smart socks for measuring heart functions, gait pattern functions, and temperature. A substantial number (24/31, 77%) of digital biomarkers were used as interventions. Moreover, wearables (22/31, 71%) were the most common types of digital devices. Position sensors (21/31, 68%) and heart rate sensors and pulse rate sensors (12/31, 39%) were the most prevalent types of sensors used to acquire behavioral and physiological data in the SRs. Conclusions In recent years, the clinical evidence concerning digital biomarkers has been systematically reviewed in a wide range of study populations, interventions, digital devices, and sensor technologies, with the dominance of physical activity and cardiac monitors. We used the World Health Organization’s ICF tool for classifying behavioral and physiological data, which seemed to be an applicable tool to categorize the broad scope of digital biomarkers identified in this review. To understand the clinical value of digital biomarkers, the strength and quality of the evidence on their health consequences need to be systematically evaluated.", "venue": "JMIR mHealth and uHealth", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-12-15", "journal": {"name": "JMIR mHealth and uHealth", "volume": "10"}, "authors": [{"authorId": "1411538467", "name": "Hossein Motahari-Nezhad"}, {"authorId": "88274434", "name": "M. Fgaier"}, {"authorId": "2125854367", "name": "M. Mahdi Abid"}, {"authorId": "6996876", "name": "M. Péntek"}, {"authorId": "4802929", "name": "L. Gulácsi"}, {"authorId": "15128505", "name": "Z. Zrubka"}], "citations": [{"paperId": "ce6226fde0fc81a658a31d5700aeb56debd6de40", "title": "The PICOTS-ComTeC Framework for Defining Digital Health Interventions: An ISPOR Special Interest Group Report."}, {"paperId": "4fe52156cecc946006063983532850517b8a30d8", "title": "The Role of Digital Biomarkers in Monitoring the Health Parameters in Individuals with Obesity"}, {"paperId": "e8a7fb342586f9dc12ed2480e8968e72613c0704", "title": "How Effective is Continuous Glucose Monitoring? A Comparison of Different Random-Effect Meta-Analysis Techniques"}, {"paperId": "bba2b81e62c544df8dcc7a3e8adb90ad7abdbf28", "title": "Definitions of digital biomarkers: a systematic mapping of the biomedical literature"}, {"paperId": "39b522cbf13670fe3cf55908536e15d0e5dc9d20", "title": "Disease Insight through Digital Biomarkers Developed by Remotely Collected Wearables and Smartphone Data"}, {"paperId": "b8d2878006a4cdd052cb95d3f6a2d5a72ac355c3", "title": "Towards a single goodness metric of clinically relevant, accurate, fair and unbiased machine learning predictions of health-related quality of life"}, {"paperId": "07ba24c720ebeedc9690d0422f8a128d6042ae28", "title": "The Future of Vestibular Schwannoma Management."}, {"paperId": "e469881f044a22cc40d0ff376cf6e5081200a227", "title": "Digital Biomarker–Based Interventions: Systematic Review of Systematic Reviews"}, {"paperId": "d29ddf5e98b699c907ed2b5604f455620b588577", "title": "Assessing"}, {"paperId": "9605e82bf94d2f693df0f0475d7292c4e8e4f9eb", "title": "The Importance of Data Quality Control in Using Fitbit Device Data From the All of Us Research Program"}]}
