{"paperId": "271078fa99f4b9805af3d4f97aedf89b2bd3302e", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Determinants of University Students’ Intention to Use Video Conferencing Tools during COVID-19 Pandemic: Case of Somalia", "abstract": "In a technologically disadvantaged and thriving developing country, university students in Somalia were abruptly required to adopt nontraditional learning using video conferencing facilities during the COVID-19 pandemic. While video conferencing tools for teaching and learning are claimed to be effective, it is still unclear what advantages and difficulties they brought to higher education in Somalia, particularly to what extent students accepted the use of such technology. This study explores the outside factors that might be influential on students’ intentions to use video conferencing tools during the COVID-19 epidemic. The study employed integrated technology acceptance (TAM) and diffusion of innovations (DOI) models. The proposed model was tested using structural equation modelling with 600 university students during the COVID-19 outbreak in Somalia. The results indicate that significant elements influenced students’ intention to use video conferencing for learning, such as student readiness, usefulness, user satisfaction, ease of use, complexity, relative advantage, trialability, and university support, whereas the quality of service, compatibility, and observability are found to have no impact on students’ intention to use video conferencing tools. The findings show that various COVID-19 related issues play a significant influence in shaping students’ intentions to engage in video conferencing tools for learning during the COVID-19 pandemic, regardless of how effectively educational institutions are prepared to promote the use of such technology. This contribution emphasizes how crucial it is to maintain constant, interactive contact with students and to give them the right supporting environments to further enhance their educational experiences in technologically disadvantaged regions.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-01-30", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "66083816", "name": "Seren Başaran"}, {"authorId": "2203856098", "name": "Kowther Abdikarin Hussein"}], "citations": [{"paperId": "3667add44c4713ca2eb04544fcb2ea12651b9fc9", "title": "Technology, Pedagogy and Content Knowledge Model for Increasing Civic Education Teacher’s Competencies in the Classroom"}, {"paperId": "5691af2a1196c9fab50f4f5e755f782cde6e05d3", "title": "Revving towards sustainability: Environmentalism impact on electric motorcycle adoption"}, {"paperId": "0d952b2c7cc444e73ddf8d24d4f17acf4e394917", "title": "Experiments to Review Literature on Topic Trends in Technology Development in Educational Information Systems"}, {"paperId": "36095e6848443cc0a31211adbdfc3967af617674", "title": "A Model for the Acceptance and Use of Online Meeting Tools"}, {"paperId": "fc224a2e5a01131f75ef7937ed93a2a9505a8f39", "title": "Exploring the Role of Latin American Universities in the Implementation of Transformative Innovation Policy"}, {"paperId": "0b9b37f8b92e8ec62303acf0cb78c6bcc9efb10b", "title": "Student of University Satisfaction Level towards Learning Management Systems (LMS) Integrated Video Conference"}, {"paperId": "95442029b782e7bdcda2d7e44427968d817bc77a", "title": "Consumer Behavior in the Post-COVID-19 Era: The Impact of Perceived Interactivity on Behavioral Intention in the Context of Virtual Conferences"}]}
