{"paperId": "271e8c06bc170e576459e202bba66b6a22ed8ff3", "publicationVenue": {"id": "d184a8bc-eeff-457c-891b-56cb8f3bd4e0", "name": "˜The œinternational Arab journal of information technology", "type": "journal", "alternate_names": ["The International Arab Journal of Information Technology", "̃the œinternational Arab j inf technol", "Int Arab J Inf Technol"], "issn": "1683-3198", "alternate_issns": ["2309-4524"], "url": "http://www.iajit.org/"}, "title": "Mining frequent sequential rules with an efficient parallel algorithm", "abstract": "Sequential rule mining is one of the most common data mining techniques. It intends to find desired rules in large sequence databases. It can decide the essential information that helps acquire knowledge from large search spaces and select curiously rules from sequence databases. The key challenge is to avoid wasting time, which is particularly difficult in large sequence databases. This paper studies the mining rules from two representations of sequential patterns to have compact databases without affecting the final result. In addition, execute a parallel approach by utilizing multi core processor architecture for mining non-redundant sequential rules. Also, perform pruning techniques to enhance the efficiency of the generated rules. The evaluation of the proposed algorithm was accomplished by comparing it with another non-redundant sequential rule algorithm called Non-Redundant with Dynamic Bit Vector (NRD-DBV). Both algorithms were performed on four real datasets with different characteristics. Our experiments show the performance of the proposed algorithm in terms of execution time and computational cost. It achieves the highest efficiency, especially for large datasets and with low values of minimum support, as it takes approximately half the time consumed by the compared algorithm.", "venue": "˜The œinternational Arab journal of information technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Int. Arab J. Inf. Technol.", "pages": "110-120", "volume": "19"}, "authors": [{"authorId": "2004355870", "name": "Nesma Youssef"}, {"authorId": "2074777935", "name": "Hatem Abdulkader"}, {"authorId": "46387298", "name": "A. Abdelwahab"}], "citations": []}
