{"paperId": "2720525d38becd4c67cbb520239f456654561c09", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "TS-Benchmark: A Benchmark for Time Series Databases", "abstract": "Time series data is widely used in scenarios such as supply chain, stock data analysis, and smart manufacturing. A number of time series database systems have been invented to manage and query large volumes of time series data. We observe that the existing benchmarks of time series databases are focused on workloads of complex analysis such as pattern matching and trend prediction whose performance may be highly affected by the data analysis algorithms, instead of the back-end databases. However, in many real applications of time series databases, people are more interested in the performance metrics such as data injection throughput and query processing time. A benchmark is still required to extensively compare the performance of time series databases in such metrics. We introduce such a benchmark called TS-Benchmark which majorly applies a scenario of device monitoring for wind turbines. A DCGAN-based data generation model is proposed to generate large volumes of time series data from some real time series data. The workloads are categorized into three folds: data loading (in batch), streaming data injection, and historical data access (for typical queries). We implement the benchmark and compare four representative time series databases: InfluxDB, TimescaleDB, Druid and OpenTSDB. The results are reported and analyzed.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "588-599"}, "authors": [{"authorId": "9036106", "name": "Yuanzhe Hao"}, {"authorId": "40662005", "name": "Xiongpai Qin"}, {"authorId": "1743832", "name": "Yueguo Chen"}, {"authorId": "2117014175", "name": "Yaru Li"}, {"authorId": "2112314827", "name": "Xiaoguang Sun"}, {"authorId": "2114760907", "name": "Yu Tao"}, {"authorId": "2118038502", "name": "Xiao Zhang"}, {"authorId": "144589756", "name": "Xiaoyong Du"}], "citations": [{"paperId": "679530e9d479cc21360041db5b4338a25a808c73", "title": "Multi-Modal Financial Time-Series Retrieval Through Latent Space Projections"}, {"paperId": "406f9cda15bc6f078d2b6f31a0ad2aad15a8021a", "title": "TSGBench: Time Series Generation Benchmark"}, {"paperId": "11ff450ad8d6eb98f5c320106f96652d3509faeb", "title": "Survey of Time Series Data Generation in IoT"}, {"paperId": "53860f50a4e50f385047c348756b347eb6b195cd", "title": "Performance Impact of Parallel Access of Time Series in the Context of Relational, NoSQL and NewSQL Database Management Systems"}, {"paperId": "75f7c5050f4b858809627d81ab6d5b71b46bb365", "title": "TSM-Bench: Benchmarking Time Series Database Systems for Monitoring Applications"}, {"paperId": "2c03a6e763694865096bd6dcf10260ba4190ccf4", "title": "TS-Cabinet: Hierarchical Storage for Cloud-Edge-End Time-series Database"}, {"paperId": "7e7fbd265c425601663a76cc28ab965534bf1ad0", "title": "Benchmarking Specialized Databases for High-frequency Data"}, {"paperId": "d5523bdf878638531662aa209710d5f645fdad71", "title": "Establishing Reliable Research Data Management by Integrating Measurement Devices Utilizing Intelligent Digital Twins"}, {"paperId": "8630abd22ff443ccfbd7115f2ade78d0330b7c07", "title": "Industrial IoT Edge Computing Platform for Real-Time Monitoring"}, {"paperId": "93539f0918ada5a6f0634c24b843aa21ebf414ff", "title": "Data Analysis and Visualization of INA-CBT Labuan Bajo System"}, {"paperId": "9933915131616bc0bdcc6fb16af18405bf200a06", "title": "FaST: An Efficient Framework For Visualizing Large-Scale Time Series"}, {"paperId": "978c29ab9a973de24a25896afbb6a3c7bc0423bf", "title": "A Comparison Of Relational, NoSQL and NewSQL Database Management Systems For The Persistence Of Time Series Data"}, {"paperId": "56092b161fef090c6a0fece7248e13fdb12da941", "title": "Performance Study of Time Series Databases"}, {"paperId": "c732323dad2794d673089dbd20fe3109336cd222", "title": "Intelligent Monitoring System for Universal Data Collection and Analysis"}, {"paperId": "fd7b348e8cc678c38d1e4ec594a08aae81b21439", "title": "SciTS: A Benchmark for Time-Series Databases in Scientific Experiments and Industrial Internet of Things"}, {"paperId": "b67b0fab1f574335e8984bc24b5e791ff0c9b177", "title": "Closed Loop Benchmark for Timeseries Databases"}, {"paperId": "fc0e27bce9f554b233067e455211ec7c08817ae7", "title": "SciTS: A Benchmark for Time-Series Database in Scientific Experiments and Industrial Internet of Things"}]}
