{"paperId": "27285b3760be8f0473245c13b97988265cd0467b", "publicationVenue": {"id": "8de18c35-6785-4e54-99f2-21ee961302c6", "name": "Conference of the European Chapter of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Conf Eur Chapter Assoc Comput Linguistics", "EACL"], "url": "https://www.aclweb.org/anthology/venues/eacl/"}, "title": "Entity-level Factual Adaptiveness of Fine-tuning based Abstractive Summarization Models", "abstract": "Abstractive summarization models often generate factually inconsistent content particularly when the parametric knowledge of the model conflicts with the knowledge in the input document. In this paper, we analyze the robustness of fine-tuning based summarization models to the knowledge conflict, which we call factual adaptiveness. We utilize pre-trained language models to construct evaluation sets and find that factual adaptiveness is not strongly correlated with factual consistency on original datasets. Furthermore, we introduce a controllable counterfactual data augmentation method where the degree of knowledge conflict within the augmented data can be adjustable. Our experimental results on two pre-trained language models (PEGASUS and BART) and two fine-tuning datasets (XSum and CNN/DailyMail) demonstrate that our method enhances factual adaptiveness while achieving factual consistency on original datasets on par with the contrastive learning baseline.", "venue": "Conference of the European Chapter of the Association for Computational Linguistics", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-02-23", "journal": {"pages": "915-929"}, "authors": [{"authorId": "10788591", "name": "Jongyoon Song"}, {"authorId": "2266467701", "name": "Nohil Park"}, {"authorId": "2223162988", "name": "Bongkyu Hwang"}, {"authorId": "2286345305", "name": "Jaewoong Yun"}, {"authorId": "2046999993", "name": "Seongho Joe"}, {"authorId": "2163133", "name": "Youngjune Gwon"}, {"authorId": "2266420387", "name": "Sungroh Yoon"}], "citations": []}
