{"paperId": "272b4752b4d5a0d16a5d71930f7c81489bad4b21", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Selectivity correction with online machine learning", "abstract": "Computer systems are full of heuristic rules which drive the decisions they make. These rules of thumb are designed to work well on average, but ignore specific information about the available context, and are thus sub-optimal. The emerging field of machine learning for systems attempts to learn decision rules with machine learning algorithms. In the database community, many recent proposals have been made to improve selectivity estimation with batch machine learning methods. Such methods are all batch methods which require retraining and cannot handle concept drift, such as workload changes and schema modifications. We present online machine learning as an alternative approach. Online models learn on the fly and do not require storing data, they are more lightweight than batch models, and finally may adapt to concept drift. As an experiment, we teach models to improve the selectivity estimates made by PostgreSQL's cost model. Our experiments make the case that simple online models are able to compete with a recently proposed deep learning method.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-21", "journal": {"name": "ArXiv", "volume": "abs/2009.09884"}, "authors": [{"authorId": "104920778", "name": "Max Halford"}, {"authorId": "1399596979", "name": "Philippe Saint-Pierre"}, {"authorId": "35023906", "name": "F. Morvan"}], "citations": [{"paperId": "ab46b919ed09cf213467463541170c6ab7845087", "title": "Robust Query Driven Cardinality Estimation under Changing Workloads"}, {"paperId": "2f121efb2efd7c02a583a33df8317f4a5f81e9dd", "title": "Multi-Cloud Query Optimisation with Accurate and Efficient Quoting"}]}
