{"paperId": "27387572208cf777fb2c55db8880dd5407d0e779", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Personalized and privacy-preserving federated heterogeneous medical image analysis with PPPML-HMI", "abstract": "Heterogeneous data is endemic due to the use of diverse models and settings of devices by hospitals in the field of medical imaging. However, there are few open-source frameworks for federated heterogeneous medical image analysis with personalization and privacy protection without the demand to modify the existing model structures or to share any private data. In this paper, we proposed PPPML-HMI, a novel open-source learning paradigm for personalized and privacy-preserving federated heterogeneous medical image analysis. To our best knowledge, personalization and privacy protection were achieved simultaneously for the first time under the federated scenario by integrating the PerFedAvg algorithm and designing the novel cyclic secure aggregation with the homomorphic encryption algorithm. To show the utility of PPPML-HMI, we applied it to a simulated classification task namely the classification of healthy people and patients from the RAD-ChestCT Dataset, and one real-world segmentation task namely the segmentation of lung infections from COVID-19 CT scans. For the real-world task, PPPML-HMI achieved $sim$5% higher Dice score on average compared to conventional FL under the heterogeneous scenario. Meanwhile, we applied the improved deep leakage from gradients to simulate adversarial attacks and showed the strong privacy-preserving capability of PPPML-HMI. By applying PPPML-HMI to both tasks with different neural networks, a varied number of users, and sample sizes, we further demonstrated the strong generalizability of PPPML-HMI.", "venue": "medRxiv", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-20", "journal": {"name": "Computers in biology and medicine", "pages": "\n          107861\n        ", "volume": "169"}, "authors": [{"authorId": "1502765940", "name": "Juexiao Zhou"}, {"authorId": "46696611", "name": "Longxi Zhou"}, {"authorId": "2161017247", "name": "Di Wang"}, {"authorId": "2142540079", "name": "Xiaopeng Xu"}, {"authorId": "144911687", "name": "Haoyang Li"}, {"authorId": "2166165505", "name": "Yuetan Chu"}, {"authorId": "2028962393", "name": "Wenkai Han"}, {"authorId": "2198273175", "name": "Xin Gao"}], "citations": [{"paperId": "db4752eb75f948e23a7666bcaee3975c402f5789", "title": "Federated Learning for Healthcare Applications"}, {"paperId": "49a8427a2ce13c8bb40da2331fd9ffe9cf9946fa", "title": "Boosting Classification Tasks with Federated Learning: Concepts, Experiments and Perspectives"}, {"paperId": "7839d037bb0e41f8a9898f177d2710cfe23633fc", "title": "Path to Medical AGI: Unify Domain-specific Medical LLMs with the Lowest Cost"}, {"paperId": "27d0d2923a42bd2bced1b100844e232ff87368e3", "title": "SkinGPT-4: An Interactive Dermatology Diagnostic System with Visual Large Language Model"}, {"paperId": "482b1c3883b2c30e41b93c6d46d5e92f43b19a8c", "title": "PPML-Omics: A privacy-preserving federated machine learning method protects patients’ privacy in omic data"}, {"paperId": "b283f9bcb85124593ad4fd20039eccb24d5d23c9", "title": "Pre-trained Multimodal Large Language Model Enhances Dermatological Diagnosis using SkinGPT-4"}]}
