{"paperId": "274613d93a3b1bf110950b0d27ff3a03a62bbeb2", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Do TMS evoked responses measured from scalp and hand represent the same cortical mechanisms?", "abstract": "Introduction Transcranial magnetic stimulation (TMS) is a powerful tool to investigate local cortical circuits and broader neural networks. Paired-pulse TMS (ppTMS) paradigms are commonly employed to study excitatory/inhibitory neurotransmissions in motor circuits across time by assessing changes in motor-evoked potentials (MEPs) using electromyography (EMG). The combination of TMS with electroencephalography (EEG) has the capacity to extend this work outside the motor system by focusing on TMS-evoked potentials (TEPs) across both space and time as the measurable output of brain stimulation. However, the relationship between these two putative outputs of TMS effects - MEPs and TEPs - remains unclear Aim To investigate whether the same neural populations are responsible for fluctuations in MEPs with ppTMS as the TEP waveform following single pulse TMS (spTMS). Methods Twenty-four healthy participants received intra-hemispheric and interhemispheric (dual-coil) ppTMS, with different inter-pulse intervals, conditioning intensities, and TMS pulse waveforms over the motor cortex, while EMG was recorded from first dorsal interosseous muscles. EEG was also recorded in response to spTMS with the same intensity and location as the conditioning pulses in ppTMS-EMG. Additionally, TMS was applied to the shoulder as a multisensory control condition. The relationship between ppTMS-EMG and spTMS-EEG were evaluated using metrics sensitive to both the shape and amplitude of the signals. Results The fluctuations in cortical excitability following suprathreshold TMS were correlated in shape, but not amplitude, when measured with ppTMS-EMG and TMS-EEG. This relationship was observable only after reversing the polarity of short latency TEPs (<~60 ms). For interhemispheric measures, supressing sensory potentials in TEPs was required to discern the relationship between the two signals. Conclusion The relationship between MEP and TEP measures suggests both signals reflect activity from overlapping neural populations. This finding establishes a fundamental link between TEP peaks and periods of net excitation/inhibition observed with ppTMS-EMG in both the stimulated motor cortex and connected cortical regions.", "venue": "bioRxiv", "year": 2019, "fieldsOfStudy": ["Physics", "Biology", "Medicine"], "publicationTypes": null, "publicationDate": "2019-09-11", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "12663490", "name": "M. Biabani"}, {"authorId": "2362590", "name": "A. Fornito"}, {"authorId": "1821956", "name": "J. Coxon"}, {"authorId": "48792891", "name": "Ben D. Fulcher"}, {"authorId": "2233030", "name": "N. Rogasch"}], "citations": [{"paperId": "a7f8fabdc0d1743af7d98590150099564da3c5ef", "title": "Motor Cortical Correlates of Paired Associative Stimulation Induced Plasticity: A TMS-EEG Study"}, {"paperId": "e77ea033563b20087d366e2fc84ad3e4079f9940", "title": "Transferability of cathodal tDCS effects from the primary motor to the prefrontal cortex: A multimodal TMS-EEG study"}, {"paperId": "d67bd7de59691fb0ce582aa75b5074447e5bab3b", "title": "Repetitive transcranial magnetic stimulation in primary sleep disorders."}, {"paperId": "82332600827bdd867d5895675981b333ce95d45d", "title": "Reliability and Validity of Transcranial Magnetic Stimulation-Electroencephalography Biomarkers."}, {"paperId": "a07c860a2b39c29a127ecd7ce4d1ad8c8ac84a38", "title": "Identifying transcranial magnetic stimulation induced EEG signatures of different neuronal elements in primary motor cortex"}, {"paperId": "6def8eecc816c9c2b607e001c072907ef4ed75a1", "title": "Transferability of cathodal tDCS effects from the primary motor to the dorsolateral prefrontal cortex: a multimodal TMS-EEG study"}, {"paperId": "c5ad0c4270228d12763ea7c2fbe8f9e1d44443da", "title": "The influence of sensory potentials on transcranial magnetic stimulation – Electroencephalography recordings"}, {"paperId": "47e4af3e8b178b2a747240939ccc215673663983", "title": "Effect of Electro-Acupuncture on Lateralization of the Human Swallowing Motor Cortex Excitability by Navigation-Transcranial Magnetic Stimulation-Electromyography"}, {"paperId": "4a9b3109dd4616d95169ab0e5bdefcc3cec3559a", "title": "Utilising TMS-EEG to Assess the Response to Cerebellar-Brain Inhibition"}, {"paperId": "38081ab2d07d93a06dc4aa91d746962525499e6d", "title": "Synaptic Plasticity 101: The Story of the AMPA Receptor for the Brain Stimulation Practitioner."}, {"paperId": "b8f08b449b05bf274a1786c16a10af5bc8f67158", "title": "Designing and comparing cleaning pipelines for TMS-EEG data: A theoretical overview and practical example"}, {"paperId": "8e0dc9c983863bc1e2095477af9e595224528308", "title": "The influence of somatosensory and auditory evoked potentials on concurrent transcranial-magnetic stimulation – electroencephalography recordings"}, {"paperId": "03e21f36ab58c60d3e1ce1ba17eaf065f0573bca", "title": "Recording brain responses to TMS of primary motor cortex by EEG – utility of an optimized sham procedure"}, {"paperId": "fd3cc340fd2821838fb3fe584183e4e8bb70fc8c", "title": "Relevance of cortical excitability in Alzheimer’s disease"}, {"paperId": "ea014337657d7d1e07ca17b3d68d375daa1fcd24", "title": "Cortical excitability measures from TMS‐EEG and TMS‐EMG – two sides of the same story?"}, {"paperId": "eef1424c187444d55695592a62b9bf7a38437dbb", "title": "Single joint fatiguing exercise decreases long but not short–interval intracortical inhibition in older adults"}]}
