{"paperId": "274ab46abf50d4222e222a870db3b870275cfd04", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Landslide Susceptibility Mapping Using Feature Fusion-Based CPCNN-ML in Lantau Island, Hong Kong", "abstract": "Landslide susceptibility mapping (LSM) is an effective way to predict spatial probability of landslide occurrence. Existing convolutional neural network (CNN)-based methods apply self-built CNN with simple structure, which failed to reach CNN's full potential on high-level feature extraction, meanwhile ignored the use of numerical predisposing factors. For the purpose of exploring feature fusion based CNN models with greater reliability in LSM, this study proposes an ensemble model based on channel-expanded pre-trained CNN and traditional machine learning model (CPCNN-ML). In CPCNN-ML, pre-trained CNN with mature structure is modified to excavate high-level features of multichannel predisposing factor layers. LSM result is generated by traditional machine learning (ML) model based on hybrid feature of high-level features and numerical predisposing factors. Lantau Island, Hong Kong is selected as study area; temporal landslide inventory is used for model training and evaluation. Experimental results show that CPCNN-ML has ability to predict landslide occurrence with high reliability, especially the CPCNN-ML based on random forest. Contrast experiments with self-built CNN and traditional ML models further embody the superiority of CPCNN-ML. It is worth noting that coastal regions are newly identified landslide-prone regions compared with previous research. This finding is of great reference value for Hong Kong authorities to formulate appropriate disaster prevention and mitigation policies.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "3625-3639", "volume": "14"}, "authors": [{"authorId": "2004772264", "name": "Yangyang Chen"}, {"authorId": "2925196", "name": "D. Ming"}, {"authorId": "145194610", "name": "Xiao Ling"}, {"authorId": "3391033", "name": "X. Lv"}, {"authorId": "47110820", "name": "Chenghu Zhou"}], "citations": [{"paperId": "f697c3369149280ba6a68c63da54a0ed951fd3cf", "title": "Seismic Landslide Susceptibility Assessment Using Newmark Displacement Based on a Dual-Channel Convolutional Neural Network"}, {"paperId": "9ba03fa6317f2f261f5d6e0fe16054aab9aa0b9b", "title": "Assessment of the Effect of Training Data Selection on Landslide Susceptibility Mapping"}, {"paperId": "4108f7854123cff0d5a97151a92a8f96ea81c8cc", "title": "Landslide susceptibility mapping with feature fusion transformer and machine learning classifiers incorporating displacement velocity along Karakoram highway"}, {"paperId": "0fad02f52af847fb6087043cc039ef26f973d696", "title": "Landslide susceptibility assessment in multiple urban slope settings with a landslide inventory augmented by InSAR techniques"}, {"paperId": "52110af180fd667bb587adabade40fc71fe811e6", "title": "Landslide susceptibility assessment in Qinzhou based on rough set and semi-supervised support vector machine"}, {"paperId": "c3d914c22e04acbc93c8a703792777eeb1fdba86", "title": "Integration of GIS and Machine Learning Techniques for Mapping the Landslide-Prone Areas in the State of Goa, India"}, {"paperId": "f8298041d26cb3e2e33852c34c450c920b82e1eb", "title": "GeoBIA-based semi-automated landslide detection using UAS data: a case study of Uttarakhand Himalayas"}, {"paperId": "83120ec1893173c0200a8a6890bdac18229550e3", "title": "Twisting Theory: A New Artificial Adaptive System for Landslide Prediction"}, {"paperId": "a443a9798ad5fe7d6065bd51ffe8fc8a937fdf85", "title": "Landslide Suspectibility Mapping Using Hybrid Deep Learning"}, {"paperId": "e90e7667b26f05c64b3186c05357884d39e1b8d1", "title": "Machine learning based landslide susceptibility mapping models and GB-SAR based landslide deformation monitoring systems: Growth and evolution"}, {"paperId": "7ead0cae4e67f390b2eb0083117ea8ab90c53b47", "title": "Landslide Susceptibility Mapping by Fusing Convolutional Neural Networks and Vision Transformer"}, {"paperId": "5e59c6cc1aa6ab19d2ef48368895b5830c1b7187", "title": "Geological Hazards Susceptibility Evaluation Based on GA‐BPNN: A Case Study of Xingye County"}, {"paperId": "668a63b4bcb8b62d973c80e3e7229e5c284a90ba", "title": "Application of Transformer Models to Landslide Susceptibility Mapping"}, {"paperId": "2f277c9e43cc5cf1dfb4b336bd2a17f9fe0007b8", "title": "Feature Engineering of Geohazard Susceptibility Analysis Based on the Random Forest Algorithm: Taking Tianshui City, Gansu Province, as an Example"}, {"paperId": "899adf5ad4b71cfe30e940d87b029e174dfb1e6e", "title": "A SPATIOTEMPORAL FUSION NETWORK TO MULTI SOURCE HETEROGENEOUS DATA FOR LANDSLIDE RECOGNITION"}, {"paperId": "6037b2f472c59e9d958106f16ac0e6bf44988632", "title": "Operational earthquake-induced building damage assessment using CNN-based direct remote sensing change detection on superpixel level"}, {"paperId": "a4f3110bffbb3322b4a1351923d4bf9c30f95a9a", "title": "Application of convolutional neural network fused with machine learning modeling framework for geospatial comparative analysis of landslide susceptibility"}, {"paperId": "0e8958e31cb1fdf05f18657cea78edd806904c59", "title": "Combining spatial response features and machine learning classifiers for landslide susceptibility mapping"}, {"paperId": "812a8cceca7b41e1a223773074b297b4cef3a131", "title": "Incorporating Landslide Spatial Information and Correlated Features among Conditioning Factors for Landslide Susceptibility Mapping"}, {"paperId": "38d395767130cefc273eec61ca8cd8bb5d174c2f", "title": "Susceptibility-Guided Landslide Detection Using Fully Convolutional Neural Network"}, {"paperId": "f16ccc99e18d65c59f657a82ce486e5457ffa4a1", "title": "ShapeFormer: A Shape-Enhanced Vision Transformer Model for Optical Remote Sensing Image Landslide Detection"}, {"paperId": "6d2b024aafe1824580fe8239a3956aedf8244c1a", "title": "Application of bagging, boosting and stacking ensemble and EasyEnsemble methods to landslide susceptibility mapping in the Three Gorges Reservoir area of China"}, {"paperId": "53032f074999b4da2196b5b03074fc93a0b14df5", "title": "Employing Remote Sensing, Data Communication Networks, AI, and Optimization Methodologies in Seismology"}]}
