{"paperId": "27591e2210d67d4e57c3ad620865e359fd8f5fbd", "publicationVenue": {"id": "d33be1bb-cc7a-479d-83ca-3e3e7c947d23", "name": "Journal of Machine and Computing", "type": "journal", "alternate_names": ["J Mach Comput"], "issn": "2788-7669"}, "title": "Implementation of the Internet of Things for early Floods in Agricultural Land using Dimensionality Reduction Technique and Ensemble ML", "abstract": "Due to human activities like global warming, pollution, ozone depletion, deforestation, etc., the frequency and severity of natural disasters have increased in recent years. Unlike many other types of natural disasters, floods may be anticipated and warned about in advance. This work presents a flood monitoring and alarm system enabled by a smart device. A microcontroller (Arduino) is included, and its support for detection and indication makes it useful for keeping tabs on and managing the gadget. The device uses its own sensors to take readings of its immediate surroundings, then uploads that data to the cloud and notifies a central administrator of the impending flood. When admin discovers a crisis situation based on the data it has collected, it quickly sends out alerts to those in the local vicinity of any places that are likely to be flooded. Using an Android app, it alerts the user's screen. The project's end goal is to develop an application that swiftly disseminates flood warning information to rural agricultural communities. Scaled principal component analysis (SPCA) is used to filter out extraneous data, and an ensemble machine learning technique is used to make flood predictions. The tests are performed on a dataset that is being collected in real-time and analysed in terms of a number of different parameters. In this research, we propose a strategy for long-term agricultural output through the mitigation of flood risk.", "venue": "Journal of Machine and Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-05", "journal": {"name": "Journal of Machine and Computing"}, "authors": [{"authorId": "2257985713", "name": "Murali Dhar M S"}, {"authorId": "2258069859", "name": "Kishore Kumar A"}, {"authorId": "2258108591", "name": "Rajakumar B"}, {"authorId": "2258238872", "name": "Poonguzhali P K"}, {"authorId": "2258235908", "name": "Hemakesavulu O"}, {"authorId": "2127541650", "name": "M. R."}], "citations": [{"paperId": "aab682ec0747f6363e105cc1c9bc2433471d47fa", "title": "Lumpy Skin Disease Prediction Using Machine Learning"}]}
