{"paperId": "275ef8f770798e6b6826a3b047967878db985682", "publicationVenue": {"id": "eef4a955-73e8-4456-a7fa-c0e169a5daca", "name": "Revista Amazonía investiga", "alternate_names": ["Rev Amaz investig"], "issn": "2322-6307", "url": "http://www.udla.edu.co/revistas/index.php/amazonia-investiga/index", "alternate_urls": ["https://amazoniainvestiga.info/index.php/amazonia"]}, "title": "The use of big data and data mining in the investigation of criminal offences", "abstract": "The aim of this study was to determine the features and prospects of using Big Data and Data Mining in criminal proceedings. The research involved the methods of a systematic approach, descriptive analysis, systematic sampling, formal legal approach and forecasting. The object of using Big Data and Data Mining are various crimes, the common features of which are the seriousness and complexity of the investigation. The common tools of Big Data and Data Mining in crime investigation and crime forecasting as interrelated tasks were identified. The creation of databases is the result of the processing of data sources by Data Mining methods, each being distinguished by the specifics of use. The main risks of implementing Big Data and Data Mining are violations of human rights and freedoms. Improving the use of Big Data and Data Mining requires standardization of procedures with strict adherence to the fundamental ethical, organizational and procedural rules. The use of Big Data and Data Mining is a forensic innovation in the investigation of serious crimes and the creation of an evidence base for criminal justice. The prospects for widespread use of these methods involve the standardization of procedures based on ethical, organizational and procedural principles. It is appropriate to outline these procedures in framework practical recommendations, emphasizing the responsibility of officials in case of violation of the specified principles. The area of further research is the improvement of innovative technologies and legal regulation of their application.", "venue": "Revista Amazonía investiga", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-18", "journal": {"name": "Revista Amazonia Investiga"}, "authors": [{"authorId": "2182106561", "name": "Andriy Tymchyshyn"}, {"authorId": "2192005542", "name": "Anna Semeniaka"}, {"authorId": "2058613864", "name": "Serhii Bondar"}, {"authorId": "147646035", "name": "N. Akhtyrska"}, {"authorId": "2051343959", "name": "O. Kostiuchenko"}], "citations": []}
