{"paperId": "2776cf55518b51a11ab129660eaab91eb4187837", "publicationVenue": {"id": "ecc3036c-4c51-45be-8b2e-f5bb0ea3db40", "name": "International Conference on Autonomic Computing and Self-Organizing Systems", "type": "conference", "alternate_names": ["ACSOS", "Int Conf Auton Comput Self-organizing Syst"]}, "title": "Energy Efficient Scheduling for Serverless Systems", "abstract": "Serverless computing, also referred to as Function-as-a-Service (FaaS), is a cloud computing model that has attracted significant attention and has been widely adopted in recent years. The serverless computing model offers an intuitive, event-based interface that makes the development and deployment of scalable cloud-based applications easier and cost-effective. An important aspect that has not been examined in these systems is their energy consumption during the application execution. One way to deal with this issue is to schedule the function invocations in an energy-efficient way. However, efficient scheduling of applications in a multi-tenant environment, like FaaS systems, poses significant challenges. The trade-off between the server’s energy usage and the hosted functions’ performance requirements needs to be taken into consideration. In this work, we propose an Energy Efficient Scheduler for orchestrating the execution of serverless functions so that it minimizes energy consumption while it satisfies the applications’ performance demands. Our approach considers real-time performance measurements and historical data and applies a novel DVFS technique to minimize energy consumption. Our detailed experimental evaluation using realistic workloads on our local cluster illustrates the working and benefits of our approach.", "venue": "International Conference on Autonomic Computing and Self-Organizing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-25", "journal": {"name": "2023 IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS)", "pages": "27-36"}, "authors": [{"authorId": "2110083110", "name": "Michail Tsenos"}, {"authorId": "2176395625", "name": "Aristotelis Peri"}, {"authorId": "1685532", "name": "V. Kalogeraki"}], "citations": []}
