{"paperId": "279b48e6f14e28ba685a8c01dd44e22017112019", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Issues and challenges of user and data interaction in healthcare-related IoT: A systematic review", "abstract": "PurposeThe Internet of Things (IoT), which enables smart objects to collect and exchange data, has a variety of application domains used in everyday life including healthcare. As a set of promising next-generation technologies in the healthcare domain, Healthcare-related Internet of Things (H-IoT) promises to facilitate better healthcare by offering data-driven insights. While effective in practice at large, emerging data concerns arise because of the inscrutable black-box systems. Inspired by the notion of human data interaction, this paper seeks to understand how people engage with the H-IoT data that is about and produced by themselves and to elucidate the main data issues and challenges involved in the development of H-IoT.Design/methodology/approachThis work conducted a comprehensive survey and integrated the method of content analysis by systematically review the recently published H-IoT research work in the healthcare domain.FindingsThis study thoroughly surveyed more than 300 research studies published in the last decades and classified seven H-IoT end-user groups, and three H-IoT data types that are important to H-IoT comprehension. Attention to human data interaction, our study also highlights several critical issues associated with this notion in the context of H-IoT.Originality/valueThis study will support H-IoT research by characterizing the data issues and challenges exist in the context of H-IoT user and data interaction. The findings will provide insights in designing for effective interactions with data in the H-IoT.", "venue": "Library hi tech", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-14", "journal": {"name": "Libr. Hi Tech", "pages": "769-782", "volume": "38"}, "authors": [{"authorId": "48137834", "name": "Ning Zou"}, {"authorId": "1845782669", "name": "Shaobo Liang"}, {"authorId": "40249854", "name": "Daqing He"}], "citations": [{"paperId": "9991395c928243acf18b86a5033d62569011cea8", "title": "Advancing elderly healthcare: adapting UTAUT2 with inhibitors for wearable device continuance"}, {"paperId": "48d10dc4b50749d99977b5c769466c6539cdc7e2", "title": "Taxonomic Exploration of Healthcare IoT: Challenges, Solutions, and Future Frontiers"}, {"paperId": "ea57284faa3d8d4941ed9a5a2fd9950fdf0cedef", "title": "Threat Modeling and Assessment Methods in the Healthcare-IT System: A Critical Review and Systematic Evaluation"}, {"paperId": "c4c6292d005b6ed26e5aaa352c6eb00d675204d7", "title": "Technology-enabled cure and care: An application of innovation resistance theory to telemedicine apps in an emerging market context"}, {"paperId": "cce20aee963ba1145f1c560d73fcdd14a5448838", "title": "Big Data Analytics Cloud based Smart IoT Healthcare Network"}, {"paperId": "b8b7ade565287a6ab340b56e4eefa209303d2a9a", "title": "Editorial: 40th anniversary: contemporary library research"}, {"paperId": "221467396a4c4704092fad20259792e9cdc47e4e", "title": "Influence of Internet of things on human psychology (internet of thoughts) for education, healthcare, and businesses"}, {"paperId": "08fb72cd68dd689ac91684f57354793b16b0fb7e", "title": "The IoMT and Cloud in Healthcare: Use, Impact and Efficiency of Contemporary Sensor Devices Used by Patients and Clinicians"}, {"paperId": "2596eef44b5e0580b055c113a3f17699491a8b36", "title": "IEFHAC: Image encryption framework based on hessenberg transform and chaotic theory for smart health"}, {"paperId": "0cd525cfa871ab1f462b5a8211fd8f707871432c", "title": "Assessing individual behavior towards adoption of telemedicine application during COVID-19 pandemic: evidence from emerging market"}, {"paperId": "428f557c1993c5c71e24c85f7be0cf3729877297", "title": "Replica selection and placement techniques on the IoT and edge computing: a deep study"}, {"paperId": "ff62d3cf4b4a54cbcf6154762b83feb7e5203186", "title": "COVID-19 prediction and symptom analysis using wearable sensors and IoT"}, {"paperId": "df1f1991db797bdeeff333811291af97a36b2589", "title": "IoT role in prevention of COVID-19 and health care workforces behavioural intention in India - an empirical examination"}]}
