{"paperId": "27a881cd944462909b7a1b9bec26bc48b7a53e49", "publicationVenue": null, "title": "High-Performance Geospatial Big Data Processing System Based on MapReduce", "abstract": "With the rapid development of Internet of Things (IoT) technologies, the increasing volume and diversity of sources of geospatial big data have created challenges in storing, managing, and processing data. In addition to the general characteristics of big data, the unique properties of spatial data make the handling of geospatial big data even more complicated. To facilitate users implementing geospatial big data applications in a MapReduce framework, several big data processing systems have extended the original Hadoop to support spatial properties. Most of those platforms, however, have included spatial functionalities by embedding them as a form of plug-in. Although offering a convenient way to add new features to an existing system, the plug-in has several limitations. In particular, while executing spatial and nonspatial operations by alternating between the existing system and the plug-in, additional read and write overheads have to be added to the workflow, significantly reducing performance efficiency. To address this issue, we have developed Marmot, a high-performance, geospatial big data processing system based on MapReduce. Marmot extends Hadoop at a low level to support seamless integration between spatial and nonspatial operations of a solid framework, allowing improved performance of geoprocessing workflow. This paper explains the overall architecture and data model of Marmot as well as the main algorithm for automatic construction of MapReduce jobs from a given spatial analysis task. To illustrate how Marmot transforms a sequence of operators for spatial analysis to map and reduce functions in a way to achieve better performance, this paper presents an example of spatial analysis retrieving the number of subway stations per city in Korea. This paper also experimentally demonstrates that Marmot generally outperforms SpatialHadoop, one of the top plug-in based spatial big data frameworks, particularly in dealing with complex and time-intensive queries involving spatial index.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-06", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "399", "volume": "7"}, "authors": [{"authorId": "2743423", "name": "Junghee Jo"}, {"authorId": "2115494675", "name": "Kang-Woo Lee"}], "citations": [{"paperId": "78f9293cd8bc2c5e44efb5dee74a4d80224bd43b", "title": "Geospatial Processing Technology and Future Information Technology Disaster Recovery - Systematic Literature Review"}, {"paperId": "336718b69a34a3e77bcf318135d930e9835d5b9b", "title": "Smart Mobility with Big Data: Approaches, Applications, and Challenges"}, {"paperId": "ae7d3619b662b3e6f926a293a760e1afd04969b4", "title": "Modeling discrete choices with large fine-scale spatial data: opportunities and challenges"}, {"paperId": "c7c554ee309f242cd9533bf41647119cb30a5b7d", "title": "A Scalable Computing Resources System for Remote Sensing Big Data Processing Using GeoPySpark Based on Spark on K8s"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "133cf017959575016afbaaaaed6989463844a502", "title": "Adaptive EHTARA: An Energy-Efficient and Trust Aware Secure Routing Algorithm for Big Data Classification in IoT Network"}, {"paperId": "07b30cb86eb3beac4561edbea3f11a0e4e039cca", "title": "Regional commercial center identification based on POI big data in China"}, {"paperId": "0dd2d1793257a54868c7487ddb30479b456e7820", "title": "Hetero-GCD2RDF: An Interoperable Solution for Geospatial Climatic Data by Deploying Semantic Web Technologies"}, {"paperId": "c25c0ada709d6afaa6bbaaa683fe46efe86ed1f5", "title": "RETRACTED ARTICLE: Flexible big data approach for geospatial analysis"}, {"paperId": "8ddcbb5084b73097b2d605fdc23a0d38dba4a942", "title": "Knowledge Discovery Web Service for Spatial Data Infrastructures"}, {"paperId": "7b33e3b17fe36b5c90f33f0d59539d5beb184379", "title": "A Multiresolution Vector Data Compression Algorithm Based on Space Division"}, {"paperId": "7854d28e20a46f674c6c8d9e968b46606a88e2bd", "title": "Predictive geospatial analytics using principal component regression"}, {"paperId": "aa29ac5d63382f7649d8271653d440bb85b1ce08", "title": "Big spatial data for urban and environmental sustainability"}, {"paperId": "47f7e64879c23ee7be736bd6426ce60b0c56aa4e", "title": "An integrated environmental analytics system (IDEAS) based on a DGGS"}, {"paperId": "c2cbffe7de5e258ee380a4478ad2887a1f25459d", "title": "MapReduce-Based D_ELT Framework to Address the Challenges of Geospatial Big Data"}, {"paperId": "1a6a71d38512f60db520646487fa2046f7867203", "title": "BiGeo: A Foundational PaaS Framework for Efficient Storage, Visualization, Management, Analysis, Service, and Migration of Geospatial Big Data - A Case Study of Sichuan Province, China"}, {"paperId": "724f9578547ddb409beac19c589486c31b8fafdd", "title": "Multi-dimensional geospatial data mining in a distributed environment using MapReduce"}, {"paperId": "d71e8ccbb324913d4e2fcf748a8d8e74047dfa0d", "title": "PARSUC: A Parallel Subsampling-Based Method for Clustering Remote Sensing Big Data"}, {"paperId": "43afbbe39aa953acb9565c50e8831d2522be40b9", "title": "Big Data technologies to process spatial and attribute data when designing and operating mine-engineering systems"}, {"paperId": "dea527df31cd23dee16a203f1fe3c6f32267c903", "title": "Constructing National Geospatial Big Data Platform: Current Status and Future Direction"}, {"paperId": "8fd7c27df58fa4b2bede8abc31ee29d393bdfa0d", "title": "Anomaly Detection for Environmental Data Using Machine Learning Regression"}]}
