{"paperId": "27b909c24c223d1a9ce28bb65a5f3f72d91f1354", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Short-Term Wind Power Forecasting Based on Feature Analysis and Error Correction", "abstract": "Accurate wind power forecasting is an important factor in ensuring the stable operation of a power system. In this paper, we propose a wind power forecasting method based on feature analysis and error correction in order to further improve its accuracy. Firstly, the correlation analysis is carried out on the features using the maximal information coefficient (MIC), and the main features are selected as the model input items. Then, the two primary factors affecting wind power forecasting—the wind speed and wind direction provided by numerical weather prediction (NWP)—are analyzed, and the data are divided and clustered from the above two perspectives. Next, the bidirectional long short-term memory network (BiLSTM) is used to predict the power of each group of sub data. Finally, the error is forecasted by a light gradient boosting machine (LightGBM) in order to correct the prediction results. The calculation example shows that the proposed method achieves the expected purpose and improves the accuracy of forecasting effectively.", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-22", "journal": {"name": "Energies"}, "authors": [{"authorId": "2145253689", "name": "Zifa Liu"}, {"authorId": "2196121101", "name": "Xinyi Li"}, {"authorId": "2146233206", "name": "Haiyan Zhao"}], "citations": [{"paperId": "c16b027ba50bd98b630f61794678d9a118496a14", "title": "Short-Term Wind Power Prediction Based on CEEMDAN-SE and Bidirectional LSTM Neural Network with Markov Chain"}, {"paperId": "8247924108685b66a242f814cc3eae177749d439", "title": "Advanced Machine Learning Techniques for Accurate Very-Short-Term Wind Power Forecasting in Wind Energy Systems Using Historical Data Analysis"}, {"paperId": "d1a57bc630589ad36fc2e5640f089ed5721b5584", "title": "A Review of Modern Wind Power Generation Forecasting Technologies"}]}
