{"paperId": "27bac371d6f44f46405c910208a7f2d4a88033fa", "publicationVenue": null, "title": "Searching for sustainability in the digital agriculture debate: an alternative approach for a systemic transition", "abstract": "One of the key challenges for agriculture today is feeding an increasing population without contributing to climate change. Increasingly, digital agriculture is discussed as a new sociotechnical regime that could help limit emissions for farmers worldwide. While sustainability is an important issue, recent papers in the field of digital agriculture do not address the problem directly. After a literature review, this paper will focus on the importance of shared perspectives as enablers in socio-technical transitions. This paper argues that the myth of the digital sublime could act in favour of the existing and unsustainable model of agriculture. This is partly a result of hardware production and connectivity already being resource-intensive. Precisely because of this high environmental impact, the following discussion will employ the legacy of the Green Revolution to highlight the importance of precaution in deploying digital agriculture. In theory, in order to address the shortcomings of the current system, private sector companies are developing proprietary software solutions that could in practice entrench unsustainable business models. As an alternative, this paper suggests, existing open-source platforms that encourage not-for-profit collaborations between farmers should be scaled up. Through bottom-up processes, future researchers and developers should seek ways to place sustainability at the centre of their analyses, and encourage the adoption of practices that can be tailored to the diverse needs of farmers. Ultimately, stakeholders in digital agriculture should understand that sustainability principles must be encoded at all stages in the deployment of digital agriculture technologies.", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2020-09-09", "journal": {"name": "", "pages": "224-238", "volume": "17"}, "authors": [{"authorId": "1657673888", "name": "Roy Cobby"}], "citations": [{"paperId": "c9945348f55d9273ed8dc71101be992eea846560", "title": "Business strategies towards climate‐smart agriculture in Europe: A literature review"}, {"paperId": "a1e747025f0eff7b2a1696d0c381bd7b51493bfd", "title": "Contested agri-food futures: Introduction to the Special Issue"}, {"paperId": "ebc7ecc08330acb37fc8da6bf4eab0e4777b730b", "title": "Inserting machines, displacing people: how automation imaginaries for agriculture promise ‘liberation’ from the industrialized farm"}, {"paperId": "c4baaa03a450eb751371bcd29f93ea79090f0dc5", "title": "The role of public policies in the digitalisation of the agri-food sector. A systematic review"}, {"paperId": "f4a8ab1bf0b460fdcccd7015125125f9e6d8c8f1", "title": "Trends in science, technology, and innovation in the agri-food sector"}, {"paperId": "61c936a8097bcfbf2df7a266b8d65c81b5b5331c", "title": "Perceived risks and vulnerabilities of employing digitalization and digital data in agriculture – Socially robust orientations from a transdisciplinary process"}, {"paperId": "2c6eb13853d04cabb70bfcdf28690e8887e76d00", "title": "Digitalization of agriculture: A way to solve the food problem or a trolley dilemma?"}, {"paperId": "432e084efe91bcf20d84292cb70c281e0344cc54", "title": "Digital transformation of agriculture and rural areas: A socio-cyber-physical system framework to support responsibilisation"}, {"paperId": "1e1f2b83a9d9fad11fb04677575fe8cd18395f11", "title": "Big Tech and the Smartification of Agriculture: A Critical Perspective"}]}
