{"paperId": "27bf2cbcf4f839dbc2eb0ff293247f07377b80b7", "publicationVenue": {"id": "2662565c-90e7-4514-bda8-3f77dd60f848", "name": "Journal of Business and Management Sciences", "type": "journal", "alternate_names": ["Journal of business & management sciences", "J Bus Manag Sci", "J bus  manag sci"], "issn": "2333-4533", "alternate_issns": ["2220-9220"], "url": "http://www.sciepub.com/journal/JBMS", "alternate_urls": ["https://www.iiu.edu.pk/?page_id=7536"]}, "title": "Exploring the Maturity of Open Governments in Various Countries: An Approach of Machine Learning", "abstract": "In recent years, open data movements have launched around the world. Open data have a wide range of participation and applications in daily activities, business areas, and government policies. Many countries believe that organizations or individuals accessing data on the data platform can develop new insights and innovations to enhance the lives of citizens. The concept of an open government (OG) is born with this context. Many countries publicize the public sector's data for citizens to download and create new applications. However, the government's open data platform may even lead to problems in lawsuits due to the inconsistency or damage in the data. Therefore, how to examine the maturity of an open government is a strong desire or demand of all countries. This study tries to define the maturity of an open government from an ICT (Information and Communication Technology) and open data development perspective. By collecting with different country’s IDI (ICT Development Index) and GODI (Global Open Data Index) from 2015 to 2016, the maturity of an open government is classified into three categories with machine learning approach. Discussion on cluster members changed in national regions between 2015 and 2016, and suggestions of how to increase the maturity of OG or prevent a decline in maturity in countries are presented.", "venue": "Journal of Business and Management Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-02", "journal": {"name": "Journal of Business and Management Sciences"}, "authors": [{"authorId": "50822500", "name": "Po-Yuan Shih"}, {"authorId": "48865347", "name": "Ting-Wei Wu"}, {"authorId": "46635719", "name": "Cheng-Ping Cheng"}], "citations": [{"paperId": "8d2fccc64a0b041238887f9464cdf7b30ea6326d", "title": "Semantic integration of heterogeneous healthcare data based on hybrid root linked health record ontology"}]}
