{"paperId": "27c4fb0fd0f7f765cd8cb6b951cf349d67d2feda", "publicationVenue": null, "title": "LBFM: Multi-Dimensional Membership Index for Block-Level Data Skipping", "abstract": "Data skipping has been a promising technique to reduce data access in query engines. By maintaining metadata for each block of tuples, a query may skip a block if the metadata indicates that the block does not contain relevant data. Obviously, the key factor is how to build effective metadata by extracting representative features of blocks. In this paper, we propose a multi-dimensional index, Layered Bloom Filter Matrix (LBFM), which adopts a recursively layered framework, and represents the matrix as an ordered hierarchy of hashmap and bitmap to compress space consumption instead of space-consuming bit matrix. Additionally, LBFM supports dimension combination cutting, and optimal indexing strategy could be generated according to it, thus the space efficiency could be further improved. We demonstrate time complexity of LBFM, and theoretically prove that LBFM has lower space consumption than Bloom Filter Matrix algorithm. We proto- typed our index technique on Spark SQL. Our experiments on TPC-H and a real-world workload show that LBFM gains significant improvement in aspect of query response time over traditional methods.", "venue": "2017 IEEE International Symposium on Parallel and Distributed Processing with Applications and 2017 IEEE International Conference on Ubiquitous Computing and Communications (ISPA/IUCC)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Symposium on Parallel and Distributed Processing with Applications and 2017 IEEE International Conference on Ubiquitous Computing and Communications (ISPA/IUCC)", "pages": "343-351"}, "authors": [{"authorId": "2153952548", "name": "Yong Wang"}, {"authorId": "2067242918", "name": "Xiao-chun Yun"}, {"authorId": "2108251407", "name": "Xi Wang"}, {"authorId": "1788327", "name": "Shupeng Wang"}, {"authorId": "46220632", "name": "Yongshang Wu"}], "citations": [{"paperId": "265f78f2682e8cff424ee98d0b24579cb5918811", "title": "A Survey on Big IoT Data Indexing: Potential Solutions, Recent Advancements, and Open Issues"}]}
