{"paperId": "27c91fe4f2b5810713d1d8a2eb4bb6a239394cfb", "publicationVenue": {"id": "58472454-bdc7-4e6e-b58e-83c7c47822a0", "name": "Geoscience Communication", "alternate_names": ["Geosci Commun"], "issn": "2569-7110", "url": "https://www.geosci-commun.net/", "alternate_urls": ["https://www.geoscience-communication.net/"]}, "title": "Breaking the Silos: an online serious game for multi-risk disaster risk reduction (DRR) management", "abstract": "Abstract. The increased complexity of disaster risk, due to climate change, expected\npopulation growth and the increasing interconnectedness of disaster impacts\nacross communities and economic sectors, requires disaster risk reduction\n(DRR) measures that are better able to address these growing complexities.\nEspecially disaster risk management (DRM) practitioners need to be able to\noversee these complexities. Nonetheless, in the traditional risk paradigm,\nthere is a strong focus on single hazards and the risk faced by individual\ncommunities and economic sectors. The development of the game and how it\naims to support a shift from a single-risk to a multi-risk paradigm are discussed\nin detail. Breaking the Silos is a serious game designed to support various\nstakeholders (including policy makers, risk managers, researchers) in\nunderstanding and managing the complexities of DRR measures in a\nmulti-risk (multi-hazard) setting, thereby moving away from hazard-silo thinking.\nWhat sets Breaking the Silos apart from other disaster risk games is its\nexplicit focus on multi-risk challenges. The game includes different hazard\ntypes and intensities (and their interactions), different impact indicators, and\n(a)synergies between DRR measures. Moreover, the spread of expert knowledge\nbetween different participants and the high levels of freedom and randomness\nin the game design contribute to a realistic game. The game was launched\nduring the World Bank GFDRR's Understanding Risk 2020 Forum and later played\nagain with the same settings with researchers from the Swiss Federal\nInstitute of Technology (ETH) in Zurich. Feedback from the pre- and\npost-game surveys indicates that Breaking the Silos was found useful by the\nparticipants in increasing awareness of the complexities of risk.\n", "venue": "Geoscience Communication", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-08-17", "journal": {"name": "Geoscience Communication"}, "authors": [{"authorId": "1861810007", "name": "Marleen C. de Ruiter"}, {"authorId": "2129508753", "name": "Anaïs Couasnon​​​​​​​"}, {"authorId": "6914431", "name": "P. Ward"}], "citations": [{"paperId": "c12d88b49845caacdaf7715d8bbf708b392ee539", "title": "Improving climate change resilience knowledge through a gaming approach: Application to marine submersion in the city of Punaauia, Tahiti"}, {"paperId": "cfa3a6ebbde90d51211b49d75aecd9ef3fb8ece3", "title": "“REEF SURVIVOR” – A NEW BOARD GAME DESIGNED TO TEACH COLLEGE AND UNIVERSITY UNDERGRADUATE STUDENTS ABOUT REEF ECOLOGY, EVOLUTION, AND EXTINCTION"}, {"paperId": "0a71bdee69fbf735af48c41a41e7060db629e2de", "title": "Consideration of compound drivers and impacts in the disaster risk reduction cycle"}, {"paperId": "6c93ef386612978f4f4944476d3dcfaee7537340", "title": "Multi-stakeholder analysis of fire risk reduction in a densely populated area in the Netherlands: a case-study in the Veluwe area"}, {"paperId": "7df19b158c2bd3ad51354fa717b448d1d638fb4e", "title": "The challenges of dynamic vulnerability and how to assess it"}, {"paperId": "95f834e46ca232a03ca7b5b7f640accbc4279651", "title": "Invited perspectives: A research agenda towards disaster risk management pathways in multi-(hazard-)risk assessment"}, {"paperId": "0fe33b916325c86ec244e125867f1374ca9a6ce5", "title": "Risk Management and Adaptation for Extremes and Abrupt Changes in Climate and Oceans: Current Knowledge Gaps"}, {"paperId": "9a4356fab7441025f0f6d79070c7eb03ef730f6c", "title": "Invited perspectives: A research agenda towards Disaster Risk Management pathways in multi-risk assessment"}]}
