{"paperId": "27d8ec0b5a92194c34fa83322b63b61d22b3398a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Securing Cyber-Physical Systems Through Blockchain-Based Digital Twins and Threat Intelligence", "abstract": "—The proliferation of digitization and complexity of connectivity in Cyber-Physical Systems (CPSs) calls for a mechanism that can evaluate the functionality and security of critical infrastructures. In this regard, Digital Twins (DTs) are revolutionizing the CPSs. Driven by asset-centric data, DTs are virtual replicas of physical systems that mirror every facet of a product or process and can provide actionable insights through monitoring, optimization, and prediction. Furthermore, replication and simulation modes in DTs can prevent and detect security ﬂaws in the CPS without obstructing the ongoing operations of the live system. However, such beneﬁts of DTs are based on an assumption about data trust, integrity, and security. Data trustworthiness is considered to be more critical when it comes to the integration and interoperability of multiple components or sub-components among different DTs owned by multiple stakeholders to provide an aggregated view of the complex physical system. Moreover, analyzing the huge volume of data for creating actionable insights in real-time is another critical requirement that demands automation. This article focuses on securing CPSs by integrating Artiﬁcial Intelligence (AI) and blockchain for intelligent and trusted DTs. We envision an AI-aided blockchain-based DT framework that can ensure anomaly prevention and detection in addition to responding against novel attack vectors in parallel with the normal ongoing operations of the live systems. We discuss the applicability of the proposed framework for the automotive industry as a CPS use case. Finally, we identify challenges that impede the implementation of intelligence-driven architectures in CPS.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2105.08886"}, "authors": [{"authorId": "39959284", "name": "S. Suhail"}, {"authorId": "1770270", "name": "R. Jurdak"}, {"authorId": "2112115", "name": "Raimundas Matulevičius"}, {"authorId": "143849708", "name": "C. Hong"}], "citations": [{"paperId": "fccb1745c41d20ef26d0f3b8cca77377bb09d874", "title": "Blockchain-Based Digital Twins: Research Trends, Issues, and Future Challenges"}, {"paperId": "b2875f876d8f01011ed5fb9e8577ad534b951df9", "title": "Digital Twin: A Comprehensive Survey of Security Threats"}]}
