{"paperId": "27de9901d97d938e14db9926c52eea2e2d939fde", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Infestation of Oriental House Rat (Rattus tanezumi) with Chigger Mites Varies along Environmental Gradients across Five Provincial Regions of Southwest China", "abstract": "Chigger mites are the exclusive vector of scrub typhus. Based on field investigations of 91 survey sites in 5 provincial regions of Southwest China, this paper reported variations of chigger infestation on the oriental house rat (Rattus tanezumi) along various environmental gradients. A total of 149 chigger species were identified from 2919 R. tanezumi in the 5 provincial regions, and Leptotrombidium deliense (a major vector of scrub typhus in China) was the first dominant chigger species, followed by Ascoschoengastia indica and Walchia ewingi. Rattus tanezumi had a stable overall prevalence (PM = 21.10%), mean abundance (MA = 7.01), and mean intensity (MI = 33.20) of chiggers with the same dominant mites in the whole Southwest China in comparison with a previous report in Yunnan Province, but chigger infestations on R. tanezumi varied along different environmental gradients. Rattus tanezumi in mountainous landscape had a higher infestation load of chiggers with higher species diversity than in flatland landscape. The infestation was higher at lower altitudes and latitudes. A high intensity of vegetation coverage was associated with high infestations. The results reflect the environmental heterogeneity of chiggers on the same host species. Warm climate and high relative humidity are beneficial to chigger infestation on R. tanezumi.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-26", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "2157242674", "name": "Yan-Ling Chen"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "2144087632", "name": "F. Ding"}, {"authorId": "2075453213", "name": "Yan Lv"}, {"authorId": "2185386505", "name": "Peng-Wu Yin"}, {"authorId": "6439830", "name": "Wenyu Song"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "40474509", "name": "P. Peng"}, {"authorId": "2179705810", "name": "Bei Li"}, {"authorId": "145358506", "name": "Ting Chen"}, {"authorId": "39189400", "name": "D. Jin"}], "citations": [{"paperId": "20fccfcd8a915d270366bae3a08873fb996fe2e6", "title": "Scrub typhus in Northeast India: epidemiology, clinical presentations, and diagnostic approaches."}, {"paperId": "cb333bad61f178714180f6c1240b7c9477aaa1b6", "title": "Arthropod Ectoparasites of Two Rodent Species Occurring in Varied Elevations on Tanzania’s Second Highest Mountain"}]}
