{"paperId": "27e0e923a55425396cda9c8b411337a4023dbb60", "publicationVenue": null, "title": "Activity-travel scheduling in stochastic multi-state supernetworks with spatial and temporal correlations", "abstract": "Multi-state supernetworks are capable of representing activity-travel patterns at a high level of detail and thus are a powerful tool for activity-travel scheduling (ATS) of multidimensional choice facets. To alleviate the limitations of the common deterministic network representation, travel time and activity duration uncertainty has been incorporated in multi-state supernetworks. However, the extension unrealistically assumed that all uncertain components are independent. This study suggests an approach of ATS considering spatially and temporally correlated travel times and activity durations in stochastic time-dependent (STD) multi-state supernetworks. Support points are used as a representation of the stochasticity of the STD multi-state supernetwork. ATS is formulated as a pathfinding problem subject to space–time constraints based on recursive formulations. A series of numerical experiments is implemented to demonstrate the applicability of the suggested approach.", "venue": "Transportmetrica A: Transport Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-08", "journal": {"name": "Transportmetrica A: Transport Science", "pages": "1300 - 1324", "volume": "18"}, "authors": [{"authorId": "1576231714", "name": "J. Lyu"}, {"authorId": "3108504", "name": "F. Liao"}, {"authorId": "34698022", "name": "S. Rasouli"}, {"authorId": "143972782", "name": "H. Timmermans"}], "citations": [{"paperId": "e29ee257146f3a26869ca8507bdb763622a0544a", "title": "Identifying risks in temporal supernetworks: an IO-SuperPageRank algorithm"}, {"paperId": "3c10e5810d8625fe2b624228d734d19e1bf0162d", "title": "A critical review of activity participation decision: a key component of activity-based travel demand models"}, {"paperId": "6e5f07d527e99c325b44fa1d947895bceb66611c", "title": "A mixed-equilibrium model of individual and household activity–travel choices in multimodal transportation networks"}]}
