{"paperId": "27efc6391c56eeb6a05b617241d030c11eeba070", "publicationVenue": {"id": "0c1420a4-aa9b-44f9-b264-ba3ac5c37050", "name": "International Conference for High Performance Computing, Networking, Storage and Analysis", "alternate_names": ["Int Conf High Perform Comput Netw Storage Anal"], "issn": "2167-4337", "alternate_issns": ["2167-4329"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000729"}, "title": "STMatch: Accelerating Graph Pattern Matching on GPU with Stack-Based Loop Optimizations", "abstract": "Graph pattern matching is a fundamental task in many graph analytics and graph mining applications. As an NP-hard problem, it is often a performance bottleneck in these applications. Previous work has proposed to use GPU to accelerate the computation. However, we find that the existing GPU solutions fail to show a performance advantage over the state-of-the-art CPU implementation due to their subgraph-centric design. This work proposes a novel stack-based graph pattern matching system on GPU that avoids the synchronization and memory consumption issues of the previous subgraph-centric systems. We also propose a two-level work-stealing and a loop-unrolling technique to improve the inter-warp and intra-warp GPU resource utilization of our system. The experiments show that our system significantly advances the state-of-the-art for graph pattern matching on GPU.", "venue": "International Conference for High Performance Computing, Networking, Storage and Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-01", "journal": {"name": "SC22: International Conference for High Performance Computing, Networking, Storage and Analysis", "pages": "1-13"}, "authors": [{"authorId": "2219313892", "name": "Yi-Hsiu Wei"}, {"authorId": "2061280007", "name": "Peng Jiang"}], "citations": [{"paperId": "12033145eb44d27269e8de892d4d6a00a5eb0c1b", "title": "cuSZp: An Ultra-Fast GPU Error-Bounded Lossy Compression Framework with Optimized End-to-End Performance"}, {"paperId": "4a321b971c77355cb70e763bfea05e430b6b29b7", "title": "Everest: GPU-Accelerated System For Mining Temporal Motifs"}]}
