{"paperId": "27fa83557cdf2d5fa6e0da7f914cd85ec088781a", "publicationVenue": {"id": "dd0168ab-0a80-4af4-892a-cc454e146d30", "name": "International Journal of Automation Technology", "type": "journal", "alternate_names": ["Int j autom technol", "International journal of automation technology", "Int J Autom Technol"], "issn": "1881-7629", "url": "https://www.fujipress.jp/ijat/au/"}, "title": "A Study on Anomaly Detection of Water-Soluble Coolant Using Internal-Sensors", "abstract": "The quality of water-soluble coolant is managed based on the maintenance schedules provided by a manager including periodic replacement of coolant. Post-maintenance is adopted when an anomaly is detected in the daily measurements. However, the reliability of management is dependent upon on the competence and experience of an operator. Condition monitoring allows users to detect critical changes in a water-soluble coolant. In contrast to the conventional method, condition monitoring can be assumed to be continuous and remote using ICT technologies. In this study, the spindle motor and NC data were utilized as internal sensors to monitor the quality of water-soluble coolant. The signal obtained from this sensor system can be easily broadcasted to the Internet as digital data and extended to an automatic data analysis using AI and machine learning in the future. It can be stated that this study enhances continuous and remote monitoring of water-soluble coolant and has the possibility of monitoring the changes in sludge concentration and Brix%. However, the sensor data cannot be used as an absolute index to estimate the quality of water-soluble coolant. It is a valuable indicator only when it is analyzed in combination with other sensor data such as pH and Brix%. The method proposed in this study can be widely extended to monitor the condition of water-soluble coolant and cutting tools.", "venue": "International Journal of Automation Technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-05", "journal": {"name": "Int. J. Autom. Technol.", "pages": "175-181", "volume": "16"}, "authors": [{"authorId": "2069966461", "name": "Y. Kondo"}, {"authorId": "2157548885", "name": "Y. Miyake"}], "citations": []}
