{"paperId": "27fc826988849445a8d994bd71ca543f7d3a2982", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Biometric Authentication-Based Intrusion Detection Using Artificial Intelligence Internet of Things in Smart City", "abstract": "Nowadays, there is a growing demand for information security and security rules all across the world. Intrusion detection (ID) is a critical technique for detecting dangers in a network during data transmission. Artificial Intelligence (AI) methods support the Internet of Things (IoT) and smart cities by creating gadgets replicating intelligent behavior and enabling decision making with little or no human intervention. This research proposes novel technique for secure data transmission and detecting an intruder in a biometric authentication system by feature extraction with classification. Here, an intruder is detected by collecting the biometric database of the smart building based on the IoT. These biometric data are processed for noise removal, smoothening, and normalization. The processed data features are extracted using the kernel-based principal component analysis (KPCA). Then, the processed features are classified using the convolutional VGG−16 Net architecture. Then, the entire network is secured using a deterministic trust transfer protocol (DTTP). The suggested technique’s performance was calculated utilizing several measures, such as the accuracy, f-score, precision, recall, and RMSE. The simulation results revealed that the proposed method provides better intrusion detection outcomes.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-10", "journal": {"name": "Energies"}, "authors": [{"authorId": "2223608", "name": "C. Annadurai"}, {"authorId": "2068534620", "name": "I. Nelson"}, {"authorId": "119876222", "name": "K. Devi"}, {"authorId": "145911873", "name": "R. Manikandan"}, {"authorId": "3218095", "name": "Noor Zaman Jhanjhi"}, {"authorId": "144314447", "name": "Mehedi Masud"}, {"authorId": "2187623018", "name": "Abdullah Sheikh"}], "citations": [{"paperId": "fbd75818cacdca6eedc8ad2301eb92a28b2dc6e4", "title": "AI-powered biometrics for Internet of Things security: A review and future vision"}, {"paperId": "74c8f565ca48faa52a45ba39fd76886ca9b4b767", "title": "Exploring Authentication Paradigms in the Internet of Things: A Comprehensive Scoping Review"}, {"paperId": "0b1b49f234adc26d45207312651d631347f4a72a", "title": "Machine learning and deep learning for user authentication and authorization in cybersecurity: A state-of-the-art review"}, {"paperId": "5d13e7ec6a37315c45b8dd6961376f2dbdd100a7", "title": "Design of urban innovation space system using artificial intelligence technology and internet of things"}, {"paperId": "de2970398fe2134579420a3539b5012ab0fefe4a", "title": "Multimedia Identification and Analysis Algorithm of Piano Performance Music Based on Deep Learning"}, {"paperId": "7dca953c6b68ab9f24779de0518b4777f4988da9", "title": "A survey on safeguarding critical infrastructures: Attacks, AI security, and future directions"}, {"paperId": "d46c10ef77d0f996b9048e85d40fce53a922e636", "title": "A conjugate self-organizing migration (CSOM) and reconciliate multi-agent Markov learning (RMML) based cyborg intelligence mechanism for smart city security"}, {"paperId": "781b55588bc8305f533c4c0155f6b15834b96848", "title": "Humans and robots: Friends of the future? A bird's eye view of biomanufacturing industry 5.0."}, {"paperId": "5caf99cd8ec4f6ff968def16ebf8d0e8fa4aa0c7", "title": "Multiview-Learning-Based Generic Palmprint Recognition: A Literature Review"}, {"paperId": "0810bd8a943168748f6003be3d8f8790201fbf5b", "title": "Robust Multi-Bio-Metric Authentication Framework in Face and Iris recognition"}, {"paperId": "fdf2b973d1bf0fbda2253016b2449fa55c77845f", "title": "Face, Iris, and Fingerprint based Robust Biometric Authentication System"}, {"paperId": "6925f13d156b278ff549d62bc80824c2cdfc4fa0", "title": "Smart Diagnostic System For Early Detection And Prediction Of Polycystic Ovary Syndrome"}, {"paperId": "b158eab692c80cb8fde1a86c999f2862b2da8f5f", "title": "Yolo Based License Plate Detection Of Triple Riders And Violators"}, {"paperId": "9193f98b9c73dcefdd9a62bf5de6e0a4ebb29ec5", "title": "Empirical Analysis on Crime Prediction using Machine Learning"}, {"paperId": "c00a6d02e2cb5301e5bd74fc9fb39104ee9283e6", "title": "International Journal of Emerging Multidisciplinaries: Computer Science and Artificial Intelligence"}]}
