{"paperId": "27fd82706ba4f93dafb922a4755b9bdc9d35ee55", "publicationVenue": {"id": "b32667b3-f81f-4d02-90f5-2fc4cb87e654", "name": "Chinese Journal of Chemical Physics", "type": "journal", "alternate_names": ["Chin J Chem Phys"], "issn": "1674-0068", "alternate_issns": ["1003-7713"], "url": "http://iopscience.iop.org/1674-0068/", "alternate_urls": ["http://erf.sbb.spk-berlin.de/han/caj/eng.oversea.cnki.net/kns55/oldnavi/n_item.aspx?NaviID=48&amp;BaseID=HXWL&amp;Flg=local&amp;NaviLink="]}, "title": "Clustering algorithms to analyze molecular dynamics simulation trajectories for complex chemical and biological systems", "abstract": "Molecular dynamics (MD) simulation has become a powerful tool to investigate the structure-function relationship of proteins and other biological macromolecules at atomic resolution and biologically relevant timescales. MD simulations often produce massive datasets containing millions of snapshots describing proteins in motion. Therefore, clustering algorithms have been in high demand to be developed and applied to classify these MD snapshots and gain biological insights. There mainly exist two categories of clustering algorithms that aim to group protein conformations into clusters based on the similarity of their shape (geometric clustering) and kinetics (kinetic clustering). In this paper, we review a series of frequently used clustering algorithms applied in MD simulations, including divisive algorithms, agglomerative algorithms (single-linkage, complete-linkage, average-linkage, centroid-linkage and ward-linkage), center-based algorithms (K-Means, K-Medoids, K-Centers, and APM), density-based algorithms (neighbor-based, DBSCAN, density-peaks, and Robust-DB), and spectral-based algorithms (PCCA and PCCA+). In particular, differences between geometric and kinetic clustering metrics will be discussed along with the performances of different clustering algorithms. We note that there does not exist a one-size-fits-all algorithm in the classification of MD datasets. For a specific application, the right choice of clustering algorithm should be based on the purpose of clustering, and the intrinsic properties of the MD conformational ensembles. Therefore, a main focus of our review is to describe the merits and limitations of each clustering algorithm. We expect that this review would be helpful to guide researchers to choose appropriate clustering algorithms for their own MD datasets.", "venue": "Chinese Journal of Chemical Physics", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-08-01", "journal": {"name": "Chinese Journal of Chemical Physics"}, "authors": [{"authorId": "2116385901", "name": "Jun-hui Peng"}, {"authorId": "2158624667", "name": "Wei Wang"}, {"authorId": "151266780", "name": "Yeqing Yu"}, {"authorId": "2064783785", "name": "Hanlin Gu"}, {"authorId": "145004602", "name": "Xuhui Huang"}], "citations": [{"paperId": "6e6b7ff27cfd2baf49181ef5f4f782328b38f8f0", "title": "Tutorial on how to build non-Markovian dynamic models from molecular dynamics simulations for studying protein conformational changes."}, {"paperId": "b6e9dd10867c27159c7c325b3dc763d7f5f1375c", "title": "Ω-Loop mutations control the dynamics of the active site by modulating a network of hydrogen bonds in PDC-3 β-lactamase"}, {"paperId": "590b70c3d2561ac2c61613d5a0092cd8de1e44d6", "title": "Quantifying Unbiased Conformational Ensembles from Biased Simulations Using ShapeGMM"}, {"paperId": "f44d80ebbc23257e428982db9c98431482c085a8", "title": "Deciphering Campylobacter jejuni DsbA1 protein dynamics in the presence of anti-virulent compounds: a multi-pronged computer-aided approach."}, {"paperId": "68690a030d24461eb19272fa109b287af636b2f8", "title": "Deciphering the Molecular Association of Human CRIP1a with an Agonist-Bound Cannabinoid Receptor 1."}, {"paperId": "14a579a38dc230db6ae38acbea8f1d59748cab2f", "title": "Searching for Structure: Characterizing the Protein Conformational Landscape with Clustering-based Algorithms"}, {"paperId": "74f1ef0d3ef08c45d4fc43d0759b443a92c8c656", "title": "Identification of potential inhibitors of HER2 targeting breast cancer-a structure-based drug design approach."}, {"paperId": "4fd120ba49dd0f6a60bf5a0a32d93839c22b85c0", "title": "EnGens: a computational framework for generation and analysis of representative protein conformational ensembles"}, {"paperId": "8352b12679f48beaf74819eae02153629f2c7e70", "title": "Dynamacophore model for breast cancer estrogen receptor alpha as an effective lead generation screening technique"}, {"paperId": "01ea2d7e33700f222aaf176682eafa8b27b5a5a6", "title": "EnGens: a computational framework for generation and analysis of representative protein conformational ensembles"}, {"paperId": "ca59f7f5c651758bd8f0f17ea9456dc281a53c18", "title": "An Expedited Route to Optical and Electronic Properties at Finite Temperature via Unsupervised Learning"}, {"paperId": "9b4410f0a0dcc1be00fb92604494b6d6b14206a1", "title": "Glycan Conformation in the Heavily Glycosylated Protein, CEACAM1"}, {"paperId": "aa1146c1db4b205be456323fe657ae54848f9dd4", "title": "Building insightful, memory-enriched models to capture long-time biochemical processes from short-time simulations"}, {"paperId": "ed39f0aeb5a312a9f815f30bf68436c00d0a2266", "title": "Path Planning Strategy for a Manipulator Based on a Heuristically Constructed Network"}, {"paperId": "2d5f7b8bac08a96cced30ec87aae29dd53a993ed", "title": "Size-and-Shape Space Gaussian Mixture Models for Structural Clustering of Molecular Dynamics Trajectories."}, {"paperId": "69f8260e403018030271f1a2f8a020ce56fb068d", "title": "BitQT: a graph-based approach to the quality threshold clustering of molecular dynamics"}, {"paperId": "d03d605aa500b66f4ac1f9ae486c56474ae62c94", "title": "Markov State Models to Study the Functional Dynamics of Proteins in the Wake of Machine Learning"}, {"paperId": "5912e1d8f1bec6aa8f0373840930c8d33f98257e", "title": "Amyloid β fibrils disruption by kolaviron: Molecular docking and extended molecular dynamics simulation studies"}, {"paperId": "dc94e44f0fdaf6e3974817e7a8453dd2112dd2fc", "title": "Multi-Level DBSCAN: A Hierarchical Density-Based Clustering Method for Analyzing Molecular Dynamics Simulation Trajectories"}, {"paperId": "6e49a1fffc40948f0facf5a3f15168a5b6b4fe60", "title": "Using a Coarse-Grained Modeling Framework to Identify Oligomeric Motifs with Tunable Secondary Structure."}, {"paperId": "1140ee2e3271f3da574a11a081de93dbfc7f02d4", "title": "Molecular function recognition by supervised projection pursuit machine learning"}, {"paperId": "d1dfa1bdcdcf42e092c4b354e0910676106ef989", "title": "CLoNe: Automated clustering based on local density neighborhoods for application to biomolecular structural ensembles."}, {"paperId": "945497f0a62e00e275af1b2cab556ff4470dbb4f", "title": "CLoNe: automated clustering based on local density neighborhoods for application to biomolecular structural ensembles"}, {"paperId": "8fc4ae1920861ca37f4c3e75f3c8cf812b9255c2", "title": "Exploring Protocols to Build Reservoirs to Accelerate Temperature Replica Exchange MD Simulations."}, {"paperId": "7404e60b4ac032a98fabbb29adb5a8b4e6586961", "title": "Exploiting a Mechanical Perturbation of Titin Domain to Identify How Force Field Parameterization Affects Protein Refolding Pathways"}, {"paperId": "b281f7f6d074a4de80a3d9aa79cc7574d070335c", "title": "Advances in enhanced sampling molecular dynamics simulations for biomolecules"}, {"paperId": "635f77662ff955761fa11d5187ca46c195e8f2c9", "title": "Automated Parsing of Flexible Molecular Systems using Principal Component Analysis and K-Means Clustering Techniques"}]}
