{"paperId": "28018686d081897aebb21ab2918869d89cec2e4b", "publicationVenue": {"id": "3c4dcc58-1825-414d-ae92-0e13bc0b961d", "name": "International Conference on E-Business and Telecommunication Networks", "type": "conference", "alternate_names": ["Int Conf Bus Telecommun Netw", "ICETE"], "url": "http://www.icete.org/"}, "title": "Secure Strassen-Winograd Matrix Multiplication with MapReduce", "abstract": "Matrix multiplication is a mathematical brick for solving many real life problems. We consider the Strassen-Winograd algorithm (SW), one of the most efficient matrix multiplication algorithms. Our first contribution is to redesign SW with the MapReduce programming model that allows to process big data sets in parallel on a cluster. Moreover, our main contribution is to address the inherent security and privacy concerns that occur when outsourcing data to a public cloud. We propose a secure approach of SW with MapReduce called S2M3, for Secure Strassen-Winograd Matrix Multiplication with MapReduce. We prove the security of our protocol in a standard security model and provide a proof-of-concept empirical evaluation suggesting its efficiency.", "venue": "International Conference on E-Business and Telecommunication Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-26", "journal": {"pages": "220-227"}, "authors": [{"authorId": "1850588", "name": "Radu Ciucanu"}, {"authorId": "153528762", "name": "Matthieu Giraud"}, {"authorId": "3438430", "name": "P. Lafourcade"}, {"authorId": "46269913", "name": "Lihua Ye"}], "citations": [{"paperId": "92fd5b5cc7c608d080e8ce507cca751e539297cd", "title": "Linear Generalized ElGamal Encryption Scheme"}, {"paperId": "c355b13364b1f6b7b93f9e8021800385dc9b725b", "title": "Discovering Numerous Strassen’s Equivalent Equations Using a Simple Micro Multimodal GA: Evolution in Action"}, {"paperId": "5241c046b7cc86fe87b1365dd223fecceda5c6de", "title": "Secure Distributed MapReduce Protocols: How to have privacy-preserving cloud applications? (Protocoles distribués et sécurisés pour le paradigme MapReduce: Comment avoir des applications dans les nuages respectueuses de la vie privée ?)"}, {"paperId": "273903cd8aec4fcaa792e4d5a4cc7ea0641239b6", "title": "Secure and Efficient Matrix Multiplication with MapReduce"}, {"paperId": "9bfa61ed55deaa15e64b9f06bddb404690c8e742", "title": "E-Business and Telecommunications: 16th International Conference, ICETE 2019, Prague, Czech Republic, July 26–28, 2019, Revised Selected Papers"}]}
