{"paperId": "2830247f6b804a590c3c0753c7181044d8d1ef48", "publicationVenue": null, "title": "SAM: Database Generation from Query Workloads with Supervised Autoregressive Models", "abstract": "With the prevalence of cloud databases, database users are increasingly reliant on the cloud database providers to manage their data. It becomes a challenge for cloud providers to benchmark different DBMS for a specific database instance without having access to the underlying data. One viable solution is to leverage a query workload, which contains a set of queries and the corresponding cardinalities, to generate a synthetic database with similar query performance. Existing methods for database generation with cardinality constraints, however, can only handle very small query workloads due to their high complexity and encounter challenges when handling join queries. In this work, we propose SAM, a supervised deep autoregressive model-based method for database generation from query workloads. First, SAM is able to process large-scale query workloads efficiently as its complexity is linear in the size of the query workload, the number of attributes and the attribute domain size. Second, we develop algorithms to obtain unbiased samples of base relations from the deep autoregressive model and assign join keys in a way that accurately recovers the full outer join of the target database. Comprehensive experiments on real-world datasets demonstrate that SAM is able to efficiently generate a high-fidelity database that not only satisfies the input cardinality constraints, but also is close to the target database.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2200859400", "name": "Jingyi Yang"}, {"authorId": "2111193903", "name": "Peizhi Wu"}, {"authorId": "2135868648", "name": "Gao Cong"}, {"authorId": "2110141549", "name": "Tieying Zhang"}, {"authorId": "2202044211", "name": "Xiao He"}], "citations": [{"paperId": "c5f09a2361126ff2384388f8cf82af7253e6840b", "title": "Controllable Tabular Data Synthesis Using Diffusion Models"}, {"paperId": "49a5aadfceac5d5ed9e224bc777f4f616de1daae", "title": "Modeling Shifting Workloads for Learned Database Systems"}, {"paperId": "f42e0db355eec9c46c81ce3d5b459ad83a9554e6", "title": "Unshackling Database Benchmarking from Synthetic Workloads"}, {"paperId": "fae724e55340da540a1284a1cf9f409ee2e0ea1c", "title": "Synthetic Data Generation for Enterprise DBMS"}, {"paperId": "fbd2ec1505de35ccceca9bf29c2746733cb09278", "title": "Database Gyms"}, {"paperId": "f12c83f4a759971649a5ebc7cdddb5cab89e29fc", "title": "ConvMADE: Convolution Makes Cardinality Estimation Stronger"}, {"paperId": "8c3d1f8321f9ed2c7dd0a0864c9004bf1df907a0", "title": "Query Aware Synthetic Data Generation"}]}
