{"paperId": "283f2c8047c86b175134503a83540ed641a7aa60", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Efficient Density-Based Local Outlier Detection Approach for Scattered Data", "abstract": "After the local outlier factor was first proposed, there is a large family of local outlier detection approaches derived from it. Since the existing approaches only focus on the extent of overall separation between an object and its neighbors, and ignore the degree of dispersion between them, the precision of these approaches will be affected by various degrees in the scattered datasets. In addition, the outlier data occupy a relatively small amount in the dataset, but the existing approaches need to perform local outlier factor calculation on all data during the outlier detection, which greatly reduces the efficiency of the algorithms. In this paper, we redefine a local outlier factor called local deviation coefficient (LDC) by taking full advantage of the distribution of the object and its neighbors. And then, we propose a safe non-outlier objects elimination approach named as rough clustering based on multi-level queries (RCMLQ) to preprocess the datasets to eliminate the non-outlier objects to the utmost. Finally, an efficient local outlier detection approach named as efficient density-based local outlier detection for scattered data (E2DLOS) is proposed based on the LDC and RCMLQ. The RCMLQ greatly reduces the amount of data that needs to be quantified for local outlier factor and the LDC is more sensitive to the degree of anomaly of the scattered datasets, and so the E2DLOS improves the existing local outlier detection approaches in time efficiency and detection accuracy. Experiments show that the LDC can better reflect the true abnormal situations of the data for the scattered datasets. And the RCMLQ can be used in parallel with the traditional methods of improving the efficiency of the nearest neighbor search, which can further improve the efficiency of the E2DLOS algorithm by about 16%.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1006-1020", "volume": "7"}, "authors": [{"authorId": "9582313", "name": "Shubin Su"}, {"authorId": "143888193", "name": "Limin Xiao"}, {"authorId": "144405710", "name": "Li Ruan"}, {"authorId": "144208374", "name": "Fei Gu"}, {"authorId": "2369464", "name": "Shupan Li"}, {"authorId": "2144719458", "name": "Zhaokai Wang"}, {"authorId": "2115803680", "name": "Rongbin Xu"}], "citations": [{"paperId": "dc98c65526aab8ddd211f0a455aa8b2762f12a0d", "title": "HLoOP -- Hyperbolic 2-space Local Outlier Probabilities"}, {"paperId": "a27097ffb5cd45aabd8e727bd58ab13c2d89721c", "title": "An Ensemble Outlier Detection Method Based on Information Entropy-Weighted Subspaces for High-Dimensional Data"}, {"paperId": "d375e0d1e440dde38b9d3301dbd576658c35bb6c", "title": "Modelling a stacked dense network model for outlier prediction over medical-based heart prediction data"}, {"paperId": "75d353e3ac0eb516f39876b5a7280ccbbfe64a51", "title": "Detecting outliers from pairwise proximities: Proximity isolation forests"}, {"paperId": "7b9bc7eaeb7f994229fd3dbfec8a9e396b52b407", "title": "Feature consistency anomaly detection method based on adversarial training deep autoencoder"}, {"paperId": "a04393d324eadea07ca53b4c44c5442ca3c47f5f", "title": "Adaptive fuzzy C-means clustering integrated with local outlier factor"}, {"paperId": "5615e28400acc8ab59bd119e6412eeb4ce41a823", "title": "Video-Based Cross-Modal Auxiliary Network for Multimodal Sentiment Analysis"}, {"paperId": "2ac66f36c97bc6ca960d491079f4b33b27031408", "title": "A Comprehensive Analysis on Outlier Prediction using Learning Approaches"}, {"paperId": "8abe9c0ccfbade0b08b981fdbf6c7134b54d9ac3", "title": "Cluster-Based Improved Isolation Forest"}, {"paperId": "d1ab3895a998fa07aba4d3f420229a8972bb5352", "title": "An enhanced local outlier detection using random walk on grid information graph"}, {"paperId": "ea35a77ae6cea870f1ecb4e714326d3f03227501", "title": "Outlier Detection using AI: A Survey"}, {"paperId": "7e4af9e8c6ea3dfc9a4aa7d33001d9c551d762c4", "title": "Distance Based Pattern Driven Mining for Outlier Detection in High Dimensional Big Dataset"}, {"paperId": "cd9a66f6536b693f462b3d41b5db52913f9c3392", "title": "An efficient local outlier detection optimized by rough clustering"}, {"paperId": "a17f1d0cc3695a2fec32b510bdac9f8777c7b386", "title": "An enhanced Hidden Semi-Markov model for outlier detection in multivariate datasets"}, {"paperId": "e449b9b3fe04fe260731a3c74d2123bf6eaadf5b", "title": "A Review of Local Outlier Factor Algorithms for Outlier Detection in Big Data Streams"}, {"paperId": "81a05172c3033a0f224a975877a620b2c76930e5", "title": "Outlier Detection Methods and the Challenges for their Implementation with Streaming Data"}, {"paperId": "a689bd7b44b942102abfc6258fffa369bf3e4624", "title": "A Review of Methods for Detecting Point Anomalies on Numerical Dataset"}, {"paperId": "360737199bc2fe21a3f91f1c0c85e170b5abbf93", "title": "Novelty, distillation, and federation in machine learning for medical imaging"}, {"paperId": "685ff3ce42dc36a8cc3e0f4439baa01f0d7ef224", "title": "Scalable and Robust Outlier Detector using Hierarchical Clustering and Long Short-Term Memory (LSTM) Neural Network for the Internet of Things"}, {"paperId": "275aaca7621b2ee4ff81cd37162f6c9a90f306e4", "title": "Progress in Outlier Detection Techniques: A Survey"}, {"paperId": "8dd43e582a04e3d1cc0f47892743454e94bd4d4c", "title": "Robust Incremental Outlier Detection Approach Based on a New Metric in Data Streams"}, {"paperId": "a9ff1960a3904bc4cd635fd457e71cd668484115", "title": "Local Deviation Coefficient based Outlier detection for Scattered Data"}, {"paperId": "8c451f3a3b6abeee2b120941bf1b117449f9814b", "title": "Enhancing Outlier Detection by Filtering Out Core Points and Border Points"}, {"paperId": "4ff7851ce691cfc49e5dc30facd491e61ebf509a", "title": "k-A Survey of Outlier Detection Techniques"}]}
