{"paperId": "285dd3c6a2e6439ba77b7da65d0cf7fe882d13cb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Deep Reinforcement Learning Based Approach for Energy-Efficient Channel Allocation in Satellite Internet of Things", "abstract": "Recently, Satellite Internet of Things (SIoT), a space network that consists of numerous Low Earth Orbit (LEO) satellites, is regarded as a promising technique since it is the only solution to provide 100% global coverage for the whole earth, without any additional terrestrial infrastructure supports. However, compared with Geostationary Earth Orbit (GEO) satellites, the LEO satellites always move very fast to cover an area within only 5–12 minutes per pass, bringing high dynamics to the network access. Furthermore, to reduce the cost, the power and spectrum channel resources of each LEO satellite are very limited, i.e., less than 10% of GEO. Therefore, to take fully advantage of the limited resource, it is very challenging to have an efficient resource allocation scheme for SIoT. Current resource allocation schemes for satellites are mostly designed for GEO, and these schemes do not consider many LEO specific concerns, including the constrained energy, the mobility characteristic, the dynamics of connections and transmissions etc. Towards this end, we proposed DeepCA, a novel reinforcement learning based approach for energy-efficient channel allocation in SIoT. In DeepCA, we firstly introduce a new sliding block scheme to facilitate the modeling of dynamic feature of the LEO satellite, and formulate the dynamic channel allocation problem in SIoT as a Markov decision process (MDP). We then propose a deep reinforcement learning algorithm for optimal channel allocation. To accelerate the learning process of DeepCA, we utilize the image form to represent the requests of users to reduce the input size, and carefully divide an action into multiple mini-actions to reduce the size of the action set. Extensive simulations show that our proposed DeepCA approach can save at least 67.86% energy consumption compared with traditional algorithms.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "62197-62206", "volume": "8"}, "authors": [{"authorId": "39136591", "name": "Bao-kang Zhao"}, {"authorId": "2108421603", "name": "Jiahao Liu"}, {"authorId": "144216594", "name": "Ziling Wei"}, {"authorId": "144026287", "name": "I. You"}], "citations": [{"paperId": "e719be7fcdaf4316f5ef9aabb0b82429b1a02b0e", "title": "Non-Terrestrial Networks for Energy-Efficient Connectivity of Remote IoT Devices in the 6G Era: A Survey"}, {"paperId": "b0cc82a647fce1199ea1452d206369229193686c", "title": "A novel machine learning-based framework for channel bandwidth allocation and optimization in distributed computing environments"}, {"paperId": "5e94147bb6f2b04f331ee4de415ef5421acd7879", "title": "Deep Reinforcement Learning-Based Anti-Jamming Algorithm Using Dual Action Network"}, {"paperId": "d84a13f2d6bca37f35a15c42d8fd92a757cf641c", "title": "Two-Step Random Access Optimization for 5G-and-Beyond LEO Satellite Communication System: A TD3-Based MsgA Channel Allocation Strategy"}, {"paperId": "e603edf9b6c855b5a7f104875488ac02f353438a", "title": "Latency Optimization for Hybrid GEO–LEO Satellite-Assisted IoT Networks"}, {"paperId": "dd0a1ca46bf24d4acb0971275cbbe34ea80bec7d", "title": "Revolutionizing Future Connectivity: A Contemporary Survey On AI-Empowered Satellite-Based Non-Terrestrial Networks in 6G"}, {"paperId": "9f937eeda31db3840efeeaae477095a72fe47f49", "title": "Channel Allocation for Mega LEO Satellite Constellations in the MEO–LEO Networked Telemetry System"}, {"paperId": "de18c62cfa9d0d4ece93b9f41c1311af9fcf05b7", "title": "A Review on Satellite-Terrestrial Integrated Wireless Networks: Challenges and Open Research Issues"}, {"paperId": "0a47e5b4bc19ddd43177f39fe51438b3c627588a", "title": "Dynamic Uplink and Downlink Resource Allocation using Deep RI Learning Approach in 5G-HetNets"}, {"paperId": "575934716acc62f469e291b620de39521e72bad6", "title": "Hybrid Machine-Learning-Based Spectrum Sensing and Allocation With Adaptive Congestion-Aware Modeling in CR-Assisted IoV Networks"}, {"paperId": "99a7b5dc3505534166571612a6027d3433d34668", "title": "Intelligent aerial video streaming: Achievements and challenges"}, {"paperId": "5595aa33675eadc6fd83317c0df2a81f0eced044", "title": "Resource Allocation for Networked Telemetry System of Mega LEO Satellite Constellations"}, {"paperId": "2c605fcc8443a36d1c290270f9eff3cd019ed843", "title": "Joint CCI Mitigation and Power Control for MC-DS-CDMA in LEO Satellite Networks"}, {"paperId": "4e72744d8fc82dbf9a0992bd3efa85ec564209f7", "title": "A Literature Review on Dynamic LEO Satellite Communication Network"}, {"paperId": "31c42b57ca527da9f1b9bf77eb657ffff7a7b0da", "title": "Synchronizing UAV Teams for Timely Data Collection and Energy Transfer by Deep Reinforcement Learning"}, {"paperId": "0c7da6fdb79bb9c3113a4ddfc7ad937ea6cab2ae", "title": "Comprehensive Performance Analysis of Zigbee Communication: An Experimental Approach with XBee S2C Module"}, {"paperId": "b88d742fbee1bac556567f008b5ee46da6b4e4fc", "title": "Network Selection and QoS Management Algorithm for 5G Converged Shipbuilding Network Based on Digital Twin"}, {"paperId": "e6021fc2e9fc6317230ec4ac671d4bce9e0d5ca8", "title": "Deep Reinforcement Learning-Based Resource Allocation for Satellite Internet of Things with Diverse QoS Guarantee"}, {"paperId": "0dc5c75b93b28abbeb598524c90df71d6e5db86c", "title": "Bridging the Urban-Rural Connectivity Gap through Intelligent Space, Air, and Ground Networks"}, {"paperId": "8c2e4fb3167b1bd17e80cf0b8307103ac6f22f12", "title": "Cooperative user association and resource allocation for task offloading in hybrid GEO‐LEO satellite networks"}, {"paperId": "2839e3da5b1b746dbfa580ac4d79f25f2ef85df6", "title": "Evolution of Non-Terrestrial Networks From 5G to 6G: A Survey"}, {"paperId": "55476893ab00a8f5846695673aa11a40e4372408", "title": "Cellular, Wide-Area, and Non-Terrestrial IoT: A Survey on 5G Advances and the Road Toward 6G"}, {"paperId": "10fe90fd95b29b8b426a057eccb97b956f4ed0c1", "title": "The Frontiers of Deep Reinforcement Learning for Resource Management in Future Wireless HetNets: Techniques, Challenges, and Research Directions"}, {"paperId": "95c03708817052d24670f6a33d4642fcebfc60d9", "title": "Stochastic-Reinforcement Learning Assisted Dynamic Power Management Model for Zone-Routing Protocol in Mobile Ad Hoc Networks"}, {"paperId": "7ed3d41d5ba99a390ac9233e9c3d6af62358aee5", "title": "Artificial Intelligence for Satellite Communication: A Review"}, {"paperId": "0bd24bd9a907de1f1d7094fd951fce6191187e43", "title": "LEO Satellite Channel Allocation Scheme Based on Reinforcement Learning"}, {"paperId": "6c4ec34aa4882f11cf94244cd10ad9b2fe609bae", "title": "Virtual Network Function Placement in Satellite Edge Computing With a Potential Game Approach"}, {"paperId": "3dcf91551e1ca4a2bb5ee8a3430891163cda45f0", "title": "A Tutorial on AI-Enabled Non-Terrestrial Networks in 6G"}, {"paperId": "b2839ad258b327a81e3d59a4ed08953010ef3805", "title": "Dynamic Downlink Interference Management in LEO Satellite Networks Without Direct Communications"}, {"paperId": "8409d3c2abc032283d47bf97dc62107e8c6f9124", "title": "Aerospace Integrated Networks Innovation for Empowering 6G: A Survey and Future Challenges"}, {"paperId": "39ced0e1b1a3f186d2b8fbdebd0cc85f0418c98b", "title": "Deep Reinforcement Learning-Based Long Short-Term Memory for Satellite IoT Channel Allocation"}, {"paperId": "7c6afa9b6042afc4db87d7d2d15f57900c86ce1e", "title": "Pheromone Incentivized Intelligent Multipath Traffic Scheduling Approach for LEO Satellite Networks"}, {"paperId": "da96ce79bbc1ebca6b46d1d7afeda7082ded3e7b", "title": "Uplink Transmission Policies for LoRa-Based Direct-to-Satellite IoT"}, {"paperId": "4b80c21a5b7e11a2b39274e22e8e39a01284c6e8", "title": "Delay Constrained Resource Allocation for NOMA Enabled Satellite Internet of Things with Deep Reinforcement Learning"}, {"paperId": "7f2ca4d70d07c2c38e97dfa834b391cf88b51584", "title": "Intelligent Channel Allocation for Age of Information Optimization in Internet of Medical Things"}, {"paperId": "54a08b66a91342badc1170556f7c3c96a7785e74", "title": "Deep Reinforcement Learning for Power Controlled Channel Allocation in Wireless Avionics Intra-Communications"}]}
