{"paperId": "286fc6d55e562eda97986d04a13cc177ed44887e", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "IoT-Based Object-Detection System to Safeguard Endangered Animals and Bolster Agricultural Farm Security", "abstract": "Significant threats to ecological equilibrium and sustainable agriculture are posed by the extinction of animal species and the subsequent effects on farms. Farmers face difficult decisions, such as installing electric fences to protect their farms, although these measures can harm animals essential for maintaining ecological equilibrium. To tackle these essential issues, our research introduces an innovative solution in the form of an object-detection system. In this research, we designed and implemented a system that leverages the ESP32-CAM platform in conjunction with the YOLOv8 object-detection model. Our proposed system aims to identify endangered species and harmful animals within farming environments, providing real-time alerts to farmers and endangered wildlife by integrating a cloud-based alert system. To train the YOLOv8 model effectively, we meticulously compiled diverse image datasets featuring these animals in agricultural settings, subsequently annotating them. After that, we tuned the hyperparameter of the YOLOv8 model to enhance the performance of the model. The results from our optimized YOLOv8 model are auspicious. It achieves a remarkable mean average precision (mAP) of 92.44% and an impressive sensitivity rate of 96.65% on an unseen test dataset, firmly establishing its efficacy. After achieving an optimal result, we employed the model in our IoT system and when the system detects the presence of these animals, it immediately activates an audible buzzer. Additionally, a cloud-based system was utilized to notify neighboring farmers effectively and alert animals to potential danger. This research’s significance lies in its potential to drive the conservation of endangered species while simultaneously mitigating the agricultural damage inflicted by these animals.", "venue": "Future Internet", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-21", "journal": {"name": "Future Internet", "pages": "372", "volume": "15"}, "authors": [{"authorId": "2213469623", "name": "Mohaimenul Azam Khan Raiaan"}, {"authorId": "2213481865", "name": "Nur Mohammad Fahad"}, {"authorId": "2265681407", "name": "Shovan Chowdhury"}, {"authorId": "2219549743", "name": "Debopom Sutradhar"}, {"authorId": "2267776234", "name": "Saadman Sakib Mihad"}, {"authorId": "3309048", "name": "Md. Motaharul Islam"}], "citations": [{"paperId": "73088f633161245e2f6ed3451d01306f8b33a3fe", "title": "Enhancing cervical cancer diagnosis with graph convolution network: AI-powered segmentation, feature analysis, and classification for early detection"}, {"paperId": "5d4a6ce39cfe7bfc6305cba86464efff8bc20c97", "title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges"}]}
