{"paperId": "288792ae2ae4492549fc299b69537c31c0f65e28", "publicationVenue": {"id": "506fed35-ef05-4fca-9f44-7e3a7d282c8c", "name": "Przeglad Elektrotechniczny", "type": "journal", "alternate_names": ["Przegląd Elektrotechniczny"], "issn": "0033-2097", "alternate_issns": ["2449-9544"], "url": "http://www.red.pe.org.pl/", "alternate_urls": ["https://www.sigma-not.pl/czasopisma-48-elektronika-energetyka-elektrotechnika-przeglad-elektrotechniczny.html", "http://www.sigma-not.pl/czasopisma-48-elektronika-energetyka-elektrotechnika-przeglad-elektrotechniczny.html"]}, "title": "Data-driven fault detection and diagnosis for centralised chilled water air conditioning system", "abstract": "The air conditioning system is complex and consumes the most energy in the building. Due to its complexity, it is difficult to identify faults in the system immediately. In this project, fault detection and diagnosis system using decision tree classifier model was developed to detect and diagnose faults in a chilled water air conditioning system. The developed model successfully classified normal condition and five common faults for more than 99% accuracy and precision. A graphical user interface of the system was also developed to ease the users. Streszczenie. System klimatyzacji jest złożony i zużywa najwięcej energii w budynku. Ze względu na swoją złożoność trudno jest od razu zidentyfikować usterki w systemie. W ramach tego projektu opracowano system wykrywania i diagnostyki usterek wykorzystujący model klasyfikatora drzewa decyzyjnego do wykrywania i diagnozowania usterek w systemie klimatyzacji wody lodowej. Opracowany model pomyślnie sklasyfikował stan normalny i pięć typowych usterek, zapewniając ponad 99% dokładności i precyzji. W celu ułatwienia użytkownikom opracowano również graficzny interfejs użytkownika systemu. (Wykrywanie i diagnostyka usterek w oparciu o dane dla scentralizowanego systemu klimatyzacji na wodę lodową)", "venue": "Przeglad Elektrotechniczny", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-04", "journal": {"name": "PRZEGLĄD ELEKTROTECHNICZNY"}, "authors": [{"authorId": "3405100", "name": "N. Sulaiman"}], "citations": [{"paperId": "03b4b499c16922958a86c675c35d943bc1318f37", "title": "A Novel Fault Diagnosis Method for a Power Transformer Based on Multi-Scale Approximate Entropy and Optimized Convolutional Networks"}]}
