{"paperId": "289532e7dbe2b2471f2c97894318febe0e2c86d9", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Prediction of Alzheimer's disease - A Machine Learning Perspective with Ensemble Learning", "abstract": "According to the World Alzheimer's Report 2022, the current number of people affected by dementia stands at over 55 million. Projections indicate that this figure will escalate to 78 million by the year 2030. Alzheimer's is primarily characterized by dementia, a neurodegenerative condition that progressively damages brain cells. Alarmingly, 75% of Alzheimer's cases go undiagnosed due to a lack of awareness. Machine learning models have shown significant value in the early prediction of Alzheimer's disease. These models enable physicians to start medication at an early stage, which can help delay the onset of symptoms. This paper focuses on the application of five highly effective models for Alzheimer's prediction. The Open Access Series of Imaging Studies (OASIS) dataset is utilized, and an auto classifier is implemented using IBM SPSS Modeler. Eight machine learning models, including C5.0, Neural Network, and Logistic Regression, are employed. Among these, the top five influential models Support Vector Machine (SVM), C5.0 decision tree, Neural Network, eXtreme Gradient Boosting (XGBoost), and Chi-square Automatic Interaction Detection (CHAID) decision tree are compared based on their performance metrics. After evaluating the results achieved by the classifier, it is observed that ensemble learning based XGBoost, outperforms other models, it achieves an impressive accuracy of 96.75% in the prediction of Alzheimer's. In ensemble learning decision trees have demonstrated exceptional performance as weak classifiers in classification-based problems. This system proves to be highly effective, easily implementable, and capable of accurately predicting Alzheimer's using clinical data of patients. Findings of this paper hold great significance for enhancing early detection in Alzheimer's disease.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-14", "journal": {"name": "2023 6th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "2308-2313", "volume": "6"}, "authors": [{"authorId": "2063945038", "name": "Akhilesh Deep Arya"}, {"authorId": "2087079681", "name": "S. Verma"}, {"authorId": "2281352986", "name": "Prasun Chakarabarti"}, {"authorId": "2886168", "name": "Rimpy Bishnoi"}], "citations": []}
