{"paperId": "28a960a69be93b4cbace374917b5250673014248", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Flying through the secure fog: A complete study on UAV‐Fog in heterogeneous networks", "abstract": "A drone or unmanned aerial vehicles (UAVs) is becoming a trending area for researchers worldwide. UAV's contribution is increasing in day‐to‐day life, whether it is in a military zone, disaster management, healthcare sector, smart cities, Internet of Things (IoT), urban air mobility, and many more. In contrast, UAV's limited computational capability and low‐energy sources pose significant challenges for real‐time data processing, storage, networking, and security that are critical in emergencies such as floods, earthquakes, and cyclones. UAVs are rapidly used to satisfy user requirements as well as services. As the demand for UAVs aided heterogeneous wireless networks increases in critical emergencies, fog computing serves several benefits to fulfill users' demands in terms of low latency, support, data storage, mobility, availability, scalability, and so on. This study aims to present a comprehensive study with their technical aspects for understanding fog computing, security issues, privacy concerns, and risks, along with its solutions. This paper suggests the collaboration of UAV‐Fog architecture based on the four‐tier network consisting of smart things, local UAVs, UAV‐Fog, and cloud server, to control UAV's data and also described some of the security issues faced by this cloud infrastructure. Further, this research article also sheds new light on some scenarios of UAV‐Fog for such deployments, applications, opportunities, challenges, and their major security threats and their countermeasures. Afterward, we design taxonomy of the collaboration of UAV‐Fog with their respective approaches.", "venue": "International Journal of Communication Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-25", "journal": {"name": "International Journal of Communication Systems", "volume": "35"}, "authors": [{"authorId": "2000455769", "name": "Akshita Gupta"}, {"authorId": "2118972690", "name": "S. Gupta"}], "citations": [{"paperId": "8ed8e60452d8618ec3fad3851f89f9c67ce648d8", "title": "Unmanned aerial vehicles in collaboration with fog computing network for improving quality of service"}, {"paperId": "3a5ff622624e7dec50d645e95de34835961db24d", "title": "A novel method for indian vehicle registration number plate detection and recognition using CNN"}, {"paperId": "e44870d00c10135f7195685bb04b4df7e78eb31a", "title": "SFL-MDrone: Synchronous federated learning enabled multi drones"}, {"paperId": "667fe45f2e7e8af07b364fec12e602777bbfdf7a", "title": "Cost effectiveness and feasibility considerations on the design of mini-UAVs for balloon takedown. Part 3: reliability and availability"}, {"paperId": "aabbe5d817b8bc5d7dc69b8135e02b5789efc3f8", "title": "The Intelligent Connection Management Model to Enhance the Security of Cloud Computers in High-Density Fog Networks"}, {"paperId": "7d264b14ef2c22fef48e6e473071236ed1bfa6c5", "title": "A comprehensive review on trust management approaches in fog computing"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "554fc1f696960596e2740e8b3a87e56cc2a874a6", "title": "Security analysis of fog computing environment for ensuring the security and privacy of information"}, {"paperId": "122a5fc9e180e277b1c6568abd6f544c51ecbf9d", "title": "Machine learning-based computation offloading in edge and fog: a systematic review"}, {"paperId": "89aaeebd7f8085aeb85c0226978633dd4c4af606", "title": "Autonomous Vehicles: The Cybersecurity Vulnerabilities and Countermeasures for Big Data Communication"}, {"paperId": "82ff9bedce8c90ca69d005e242dae654c4ecc1c5", "title": "Machine Learning Applications in Internet-of-Drones: Systematic Review, Recent Deployments, and Open Issues"}]}
