{"paperId": "28b5df48dd23ffc7e7d64fc43e2a420e05ab88f8", "publicationVenue": null, "title": "Milvus: A Purpose-Built Vector Data Management System", "abstract": "Recently, there has been a pressing need to manage high-dimensional vector data in data science and AI applications. This trend is fueled by the proliferation of unstructured data and machine learning (ML), where ML models usually transform unstructured data into feature vectors for data analytics, e.g., product recommendation. Existing systems and algorithms for managing vector data have two limitations: (1) They incur serious performance issue when handling large-scale and dynamic vector data; and (2) They provide limited functionalities that cannot meet the requirements of versatile applications. This paper presents Milvus, a purpose-built data management system to efficiently manage large-scale vector data. Milvus supports easy-to-use application interfaces (including SDKs and RESTful APIs); optimizes for the heterogeneous computing platform with modern CPUs and GPUs; enables advanced query processing beyond simple vector similarity search; handles dynamic data for fast updates while ensuring efficient query processing; and distributes data across multiple nodes to achieve scalability and availability. We first describe the design and implementation of Milvus. Then we demonstrate the real-world use cases supported by Milvus. In particular, we build a series of 10 applications (e.g., image/video search, chemical structure analysis, COVID-19 dataset search, personalized recommendation, biological multi-factor authentication, intelligent question answering) on top of Milvus. Finally, we experimentally evaluate Milvus with a wide range of systems including two open source systems (Vearch and Microsoft SPTAG) and three commercial systems. Experiments show that Milvus is up to two orders of magnitude faster than the competitors while providing more functionalities. Now Milvus is deployed by hundreds of organizations worldwide and it is also recognized as an incubation-stage project of the LF AI & Data Foundation. Milvus is open-sourced at https://github.com/milvus-io/milvus.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2141735101", "name": "Jianguo Wang"}, {"authorId": "1666260553", "name": "Xiaomeng Yi"}, {"authorId": "1764236", "name": "Rentong Guo"}, {"authorId": "145914256", "name": "Hai Jin"}, {"authorId": "2153916637", "name": "Peng Xu"}, {"authorId": "2153701193", "name": "Shengjun Li"}, {"authorId": "2144797977", "name": "Xiangyu Wang"}, {"authorId": "46909714", "name": "Xiangzhou Guo"}, {"authorId": "2136332740", "name": "Chengming Li"}, {"authorId": "2115215055", "name": "Xiaohai Xu"}, {"authorId": "2114076472", "name": "Kun Yu"}, {"authorId": "2116525062", "name": "Yuxing Yuan"}, {"authorId": "2113959133", "name": "Yinghao Zou"}, {"authorId": "2117315688", "name": "J. Long"}, {"authorId": "2111258930", "name": "Yudong Cai"}, {"authorId": "2116566794", "name": "Zhenxiang Li"}, {"authorId": "2129460589", "name": "Zhifeng Zhang"}, {"authorId": "2113623161", "name": "Yihua Mo"}, {"authorId": "2144097347", "name": "Jun Gu"}, {"authorId": "2113618679", "name": "Ruiyi Jiang"}, {"authorId": "2156252582", "name": "Yi Wei"}, {"authorId": "2113619066", "name": "Charles Xie"}], "citations": [{"paperId": "91580b199345721da361a3a4bffdf5da4f5f811b", "title": "Deep Learning for Trajectory Data Management and Mining: A Survey and Beyond"}, {"paperId": "1a0c403c182c996e51455fcd7e77b9d9b90080f6", "title": "Distance Comparison Operators for Approximate Nearest Neighbor Search: Exploration and Benchmark"}, {"paperId": "c426a9ec535e04ddebd3e64b7f1605f456dcc4f3", "title": "SeRF: Segment Graph for Range-Filtering Approximate Nearest Neighbor Search"}, {"paperId": "15b4a47569ac1057e7257bf6ea7ce75f596751b0", "title": "KPop: Accurate, assembly-free, and scalable comparative analysis of microbial genomes"}, {"paperId": "fcf6bdf503bf26df8bb39f859f33362c701ca75c", "title": "ACORN: Performant and Predicate-Agnostic Search Over Vector Embeddings and Structured Data"}, {"paperId": "53431e4eb6b5e76c67e63585a3babaab8b98eca1", "title": "SheetAgent: A Generalist Agent for Spreadsheet Reasoning and Manipulation via Large Language Models"}, {"paperId": "28bedd99b1fed73b653b90c7d8856edadc954032", "title": "Multi-Spectral Remote Sensing Image Retrieval Using Geospatial Foundation Models"}, {"paperId": "486bb2d71e6430688ce3a7cc2f982835b24c71e7", "title": "MeTMaP: Metamorphic Testing for Detecting False Vector Matching Problems in LLM Augmented Generation"}, {"paperId": "37b8d307762a6965cea923ac3ca60b630291c92d", "title": "Rethinking multimodal corpora from the perspective of Peircean semiotics"}, {"paperId": "b6ee2c33640bad7698073f7d7537b1f371048bcf", "title": "Exploring Musical Roots: Applying Audio Embeddings to Empower Influence Attribution for a Generative Music Model"}, {"paperId": "d4999c6f04c357414f66066f0fa06be14faa8efc", "title": "The Faiss library"}, {"paperId": "726ad321ad9937ed448e0f7fd0d713c538f06307", "title": "Curator: Efficient Indexing for Multi-Tenant Vector Databases"}, {"paperId": "95d21fe791f5f55b19935e8e9bc519998c016352", "title": "Bridging Software-Hardware for CXL Memory Disaggregation in Billion-Scale Nearest Neighbor Search"}, {"paperId": "c36d05d13ff0532fee315d441d20f390d3f2ad75", "title": "Starling: An I/O-Efficient Disk-Resident Graph Index Framework for High-Dimensional Vector Similarity Search on Data Segment"}, {"paperId": "ee074ced021d04ad73223758f476fa00cedac15b", "title": "ESGReveal: An LLM-based approach for extracting structured data from ESG reports"}, {"paperId": "afaddfb3645051aee7d48b52b765bd0d5d66f31d", "title": "Overcoming Limited Data Challenges: Training Large-Scale Deduplication Models through Distributed and Non-Distributed Methods"}, {"paperId": "f70863cda6d86e6b68348e3678f7bb0cb5e3a950", "title": "LM-DiskANN: Low Memory Footprint in Disk-Native Dynamic Graph-Based ANN Indexing"}, {"paperId": "1f297f9c1fdb74b8af026628f595b069c3e3bace", "title": "Near Neighbor Search for Constraint Queries"}, {"paperId": "00a67af3b7dc785b4813b61d232cc76b4fb2b189", "title": "TAP4LLM: Table Provider on Sampling, Augmenting, and Packing Semi-structured Data for Large Language Model Reasoning"}, {"paperId": "8e6b6596718fb3ab0512a8384154bfa9f78f0254", "title": "MUST: An Effective and Scalable Framework for Multimodal Search of Target Modality"}, {"paperId": "2b92c0f4205661ea1ca4decab9229e3916696020", "title": "Unveiling Objects with SOLA: An Annotation-Free Image Search on the Object Level for Automotive Data Sets"}, {"paperId": "9920d14a762231122035fbefab3bfd5983a5298a", "title": "Context-Enhanced Relational Operators with Vector Embeddings"}, {"paperId": "77e851d469c929bb0d91919145a131071aaa3e1b", "title": "Vector Databases and Vector Embeddings-Review"}, {"paperId": "4f6f14315ed322fb8eae5aa04b3e48f5f34324bf", "title": "Can Large Language Models Be Good Companions? An LLM-Based Eyewear System with Conversational Common Ground"}, {"paperId": "10a9b20ac0834dab013fdc7ad0b111dc34fd7901", "title": "An Efficient System for Personal Information Search in Cyberspace Using Facial Recognition Technology"}, {"paperId": "5eb5cad49de8a1f386f3dd127de2046eaa27ea5c", "title": "Prompting Frameworks for Large Language Models: A Survey"}, {"paperId": "ea3bbf50294feb0cbdbc41a680c53bd6d0412485", "title": "Towards Transaction as a Service"}, {"paperId": "85bbc8af01084d2328c49cb3c70241c76e3ef4d5", "title": "Embedding in Recommender Systems: A Survey"}, {"paperId": "47764ccd0fcd215fc862101f9b0642fd5890b3c7", "title": "SPFresh: Incremental In-Place Update for Billion-Scale Vector Search"}, {"paperId": "899f86566b04e7a79d15cd2df62fbb2e66ec8b75", "title": "Survey of Vector Database Management Systems"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "7aac679334e8efd094f56e0eafdd9d5437f17e51", "title": "Knowledge Graph based Explainable Question Retrieval for Programming Tasks"}, {"paperId": "7c3bc20a6dad840ad024c5d64d4845755348a27d", "title": "Approximate Similarity Joins over Dense Vector Embeddings"}, {"paperId": "8a215d3d784862dd2c9434cc2ee434b0d16b9059", "title": "Reducing Computer Vision Dataset Size via Selective Sampling"}, {"paperId": "f7578c467f591a0efec07cc80b13228e3631f61f", "title": "Vector database management systems: Fundamental concepts, use-cases, and current challenges"}, {"paperId": "9c974f3c803e139e28da77b24d40fe534cac4ccf", "title": "Deep Learning for Approximate Nearest Neighbour Search: A Survey and Future Directions"}, {"paperId": "25332d1888053b9d1e883fe756d04fa25f964685", "title": "Recommending Analogical APIs via Knowledge Graph Embedding"}, {"paperId": "b85f3a66245d483f3eb3447eaf9950bd55f2b21e", "title": "PentestGPT: An LLM-empowered Automatic Penetration Testing Tool"}, {"paperId": "7180d6d478e265efed74e2742b43857d88572327", "title": "Rethinking Similarity Search: Embracing Smarter Mechanisms over Smarter Data"}, {"paperId": "f9bde1cfd72e96636408e56a76a0862b22d2be84", "title": "Visual Passage Score Aggregation for Image Retrieval"}, {"paperId": "dfeec393dcd2312ac570aef6fbf6725d069ac940", "title": "Fast Approximate Nearest Neighbor Search with a Dynamic Exploration Graph using Continuous Refinement"}, {"paperId": "a4e32021908ae088839878a94513c2202e4bf084", "title": "Harnessing Scalable Transactional Stream Processing for Managing Large Language Models [Vision]"}, {"paperId": "632a758099f412b13d0a8172830a3ac7ee5e0dd5", "title": "TableGPT: Towards Unifying Tables, Nature Language and Commands into One GPT"}, {"paperId": "0d5b4e9fee9f209cca96d31bad752a064ce01f95", "title": "ReLoop2: Building Self-Adaptive Recommendation Models via Responsive Error Compensation Loop"}, {"paperId": "6727ef300f4dfaed7af9a94193c3e68158cd6eb9", "title": "Beyond Black Box AI generated Plagiarism Detection: From Sentence to Document Level"}, {"paperId": "8093f2b74c5f9d705d88076d5d9675ecbed8ef50", "title": "MarineVRS: Marine Video Retrieval System with Explainability via Semantic Understanding"}, {"paperId": "c4318ccbc429a98d01f719e65014ad0fa3221c66", "title": "RITA: Group Attention is All You Need for Timeseries Analytics"}, {"paperId": "74667af35f3bf9b5d63387766b753f6e08a6f77e", "title": "Bridging the Gap between Geometry and User Intent: Retrieval of CAD Models via Regions of Interest"}, {"paperId": "73dd9f238f4ede76592d69003540351621937ba6", "title": "ARKGraph: All-Range Approximate K-Nearest-Neighbor Graph"}, {"paperId": "7b2eb7992b3462d0da6612648e039f626ed42e6a", "title": "A Cultural Relics Display System Based on Augmented Reality"}, {"paperId": "1ab75c9c22cc35a08f22b8c10fa655f1b41d81ff", "title": "A Trace-driven Performance Evaluation of Hash-based Task Placement Algorithms for Cache-enabled Serverless Computing"}, {"paperId": "513792338b7314a039424af55b610579802123aa", "title": "Filtered-DiskANN: Graph Algorithms for Approximate Nearest Neighbor Search with Filters"}, {"paperId": "e94b14f63042b7decd67c8ae781a35ce58f08de0", "title": "Focus on the Challenges: Analysis of a User-friendly Data Search Approach with CLIP in the Automotive Domain"}, {"paperId": "7cca234b50f4b03dbf99b8579a5fd55a5a653094", "title": "Graph Greenifier: Towards Sustainable and Energy-Aware Massive Graph Processing in the Computing Continuum"}, {"paperId": "d6be04864f3f95e3e17f2f265ff600f22aa6caf2", "title": "A winter sports video classification method and system based on 3D-video Swin transformer"}, {"paperId": "29b7849eca377f115e67b80e8fa2840f26e0e842", "title": "An Empirical Evaluation of Columnar Storage Formats"}, {"paperId": "4f662c42b2bd52422b70d8f44175f33cec4f8969", "title": "High-Throughput Vector Similarity Search in Knowledge Graphs"}, {"paperId": "59f31992ebf4b9b5664eed5819408265eaf5efc9", "title": "High-Dimensional Approximate Nearest Neighbor Search: with Reliable and Efficient Distance Comparison Operations"}, {"paperId": "1e7b8e9028be3dcaf3547c52ad6776bf189bbd8f", "title": "Versatile User Identification in Extended Reality using Pretrained Similarity-Learning"}, {"paperId": "0b3bdb8d28c14ddadd505ab4f549ff8e8b597be6", "title": "An SDN-Based Framework for Load Balancing and Flight Control in UAV Networks"}, {"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics"}, {"paperId": "53169794d50f7541ea4a93417443751ed76a2009", "title": "SEPT: Towards Scalable and Efficient Visual Pre-Training"}, {"paperId": "771a3d29bf9535c165542801e9109305890340f0", "title": "InDiReCT: Language-Guided Zero-Shot Deep Metric Learning for Images"}, {"paperId": "127b7ef160f82226cc1020cc0f2e34080bc33ed4", "title": "The Tensor Data Platform: Towards an AI-centric Database System"}, {"paperId": "b0e2dd233b2fa601fd769dd5a08ce07f0ae13e7c", "title": "Maze: A Cost-Efficient Video Deduplication System at Web-scale"}, {"paperId": "3c580b5ffd611098edaaacdd921759705f9ebffa", "title": "Deep Lake: a Lakehouse for Deep Learning"}, {"paperId": "06e30d919f38c038d60f168692924a48ae6a901d", "title": "VIVA: visual information retrieval in video archives"}, {"paperId": "070e486dc29c8b5c7c109804390c66ba63e317cb", "title": "HQANN: Efficient and Robust Similarity Search for Hybrid Queries with Structured and Unstructured Constraints"}, {"paperId": "9f475a2193f0cb8ecc36ebc33537b99d36d37802", "title": "VStore: in-storage graph based vector search accelerator"}, {"paperId": "7083fd33bdfe380e2649dee969b3c44516d98675", "title": "Manu: A Cloud Native Vector Database Management System"}, {"paperId": "55d30fe12a0cbe116c6e14b6d2c405e298bcd1d0", "title": "SnapMode: An Intelligent and Distributed Large-Scale Fashion Image Retrieval Platform Based On Big Data and Deep Generative Adversarial Network Technologies"}, {"paperId": "4a9dd560cfe60562182b6d52989774ae36a60ec7", "title": "Navigable Proximity Graph-Driven Native Hybrid Queries with Structured and Unstructured Constraints"}, {"paperId": "38799f37de0617c907c068c7fb4f94d858dc096c", "title": "Collaborative adversary nodes learning on the logs of IoT devices in an IoT network"}, {"paperId": "e550839c4f8bf46214b7ae75538792302ce9e499", "title": "Tao: A Learning Framework for Adaptive Nearest Neighbor Search using Static Features Only"}, {"paperId": "53e08d2d6bffb97b7c97692e4d6eae194363e00e", "title": "When Similarity Digest Meets Vector Management System: A Survey on Similarity Hash Function"}, {"paperId": "77355764fa24d063f9526747a432c374110cdad2", "title": "PandaDB: Understanding Unstructured Data in Graph Database"}, {"paperId": "af0f3465dcd52f369873312cbc09e144c0891ea6", "title": "Serving Deep Learning Models from Relational Databases"}, {"paperId": "3ba8eb1ac64d4f611d9dcd57adcfa77d196ec181", "title": "Extensible Motion-based Identification of XR Users with Non-Specific Motion"}, {"paperId": "2b054eb2be8fbb261503370323e4442602eddeed", "title": "Fact Ranking over Large-Scale Knowledge Graphs with Reasoning Embedding Models"}, {"paperId": "7818ae51442ba087a16814f35026f9e463a1c9c4", "title": "Query Optimization for Inference-Based Graph Databases"}, {"paperId": "c18ecaabd4609b1560ed75e57659f43bf45989e6", "title": "E-Scan: Consuming Contextual Data with Model Plugins"}, {"paperId": "f4d546b9cd5681430de63e7d8739dc2d50045fb4", "title": "CacheGen: Fast Context Loading for Language Model Applications"}, {"paperId": "74c85fdda1885b38cd8fd0f1891b1023a7133853", "title": "the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation"}, {"paperId": "0086d4e5b8a16cb1f1fb7c050495d22f8ce70764", "title": "Hybrid Structured and Similarity Queries over Wikidata plus Embeddings with Kypher-V"}, {"paperId": "2afc87b99e7dbc208678a42d8b9d067528eddd34", "title": "Chinese Character Components Segmentation Method Based on Faster RCNN"}, {"paperId": "243b45b406f73dbf6777fe9adf14264efd04c501", "title": "A Distributed Graph Database System to Query Unstructured Data in Big Graph"}, {"paperId": "5f5151ff7a618f9c0ed236a96c760808ed259fe3", "title": "Graph-and Tree-based Indexes for High-dimensional Vector Similarity Search: Analyses, Comparisons, and Future Directions"}, {"paperId": "69d10ea099a2280639bdc43336fd8e4bd4d5ef92", "title": "Are There Fundamental Limitations in Supporting Vector Data Management in Relational Databases? A Case Study of PostgreSQL"}, {"paperId": "1ec83ef65a0c29f83cbfa05ca15987b4ec83ba54", "title": "Exploiting Modern Hardware Architectures for High-Dimensional Vector Search at Speed and Scale"}, {"paperId": "288989c04d2f72e518fb8966d8a85f27d0056923", "title": "Automatic Sub-Task Focus: LifeInsight’s Contribution to NTCIR-17 Lifelog-5"}]}
