{"paperId": "28cc14362f5ef5511f42b54f2ea43f5743d7d4d9", "publicationVenue": null, "title": "DeTTO: Dependency-Aware Trustworthy Task Offloading in Vehicular IoT", "abstract": "In this paper, we investigate the dependency-aware trustworthy task offloading problem (DeTTO), especially in an IoT-enabled vehicular network, where a large computation-intensive task offloaded from a vehicle is fragmented into multiple subtasks and then offloaded to multiple trusted nodes. First, we formulate the task offloading problem as a graph optimization problem intending to find an optimal set of trustworthy nodes for offloading the subtasks. We aim to minimize the task completion delay and energy consumption, while satisfying the dependency relations between the subtasks and the trust requirements of the tasks. We consider three types of dependency structures – fully independent task, fully dependent task, and partially dependent task. For a fully independent task with no dependency between the subtasks, we propose a greedy algorithm to get the optimal set of nodes for task offloading. After showing the NP-hardness of solving the dependent task offloading problem, we propose a two-fold efficient heuristic approach for the tasks with all dependent subtasks. We adopt the solution approaches used by the first two types of tasks for a partially dependent task. Through simulation experiments, we analyze the performance of the proposed algorithms for three types of intra-task dependencies. The experimental results show that the proposed algorithms significantly reduce the delay and energy consumption, when compared to the benchmark schemes.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "24369-24378", "volume": "23"}, "authors": [{"authorId": "37835936", "name": "P. Dass"}, {"authorId": "1739575", "name": "S. Misra"}], "citations": [{"paperId": "0cc36d6c39449dd79caf205ef34d849c52bb7f64", "title": "A green, secure, and deep intelligent method for dynamic IoT-edge-cloud offloading scenarios"}]}
