{"paperId": "28d0c1f199dd4e79f10fbb252195374701cddfc0", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "A systematic review on machine learning models for online learning and examination systems", "abstract": "Examinations or assessments play a vital role in every student’s life; they determine their future and career paths. The COVID pandemic has left adverse impacts in all areas, including the academic field. The regularized classroom learning and face-to-face real-time examinations were not feasible to avoid widespread infection and ensure safety. During these desperate times, technological advancements stepped in to aid students in continuing their education without any academic breaks. Machine learning is a key to this digital transformation of schools or colleges from real-time to online mode. Online learning and examination during lockdown were made possible by Machine learning methods. In this article, a systematic review of the role of Machine learning in Lockdown Exam Management Systems was conducted by evaluating 135 studies over the last five years. The significance of Machine learning in the entire exam cycle from pre-exam preparation, conduction of examination, and evaluation were studied and discussed. The unsupervised or supervised Machine learning algorithms were identified and categorized in each process. The primary aspects of examinations, such as authentication, scheduling, proctoring, and cheat or fraud detection, are investigated in detail with Machine learning perspectives. The main attributes, such as prediction of at-risk students, adaptive learning, and monitoring of students, are integrated for more understanding of the role of machine learning in exam preparation, followed by its management of the post-examination process. Finally, this review concludes with issues and challenges that machine learning imposes on the examination system, and these issues are discussed with solutions.", "venue": "PeerJ Computer Science", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-18", "journal": {"name": "PeerJ Computer Science", "volume": "8"}, "authors": [{"authorId": "3405164", "name": "S. Kaddoura"}, {"authorId": "32443414", "name": "D. Popescu"}, {"authorId": "66081262", "name": "J. Hemanth"}], "citations": [{"paperId": "e93d789ba010c46235f4fd91bba6022350c83c67", "title": "A big data and neural networks driven approach to design students management system"}, {"paperId": "5e01e328a0d80ad8151ea0599e23a99e19e910fa", "title": "Enhancing Human–Computer Interaction in Online Education: A Machine Learning Approach to Predicting Student Emotion and Satisfaction"}, {"paperId": "879955618b93e1f98d0eb6557128a827e86e5ebd", "title": "Logic-Based Reverse Analysis: A Covid-19 Surveillance Data Set Classification Problem"}, {"paperId": "779a6d32caa6c80f107265947b2b8a7790494cf9", "title": "Predicting Student Dropout in Online Learning Platforms Using Deep Learning Techniques"}, {"paperId": "71b59b74178316eaec8186bec495d5888705e9aa", "title": "A Student Engineering Competence Level Prediction Method Based on RNN-GRU and Dynamic Bayesian Network"}, {"paperId": "b6c72f4ecb670ba3996ffd5d54ba4071dd0fe3ff", "title": "Intelligent solution for automatic online exam monitoring"}, {"paperId": "411aa392a5eaff95f2cacf2a697b1ecd9d546c27", "title": "Comprehensive analysis of factors influencing the real-world application of machine learning for student success rate calculation and their impacts on student achievement & educational institutions"}, {"paperId": "2eab23f20cb6bb6378489acda07f1f6ae2146307", "title": "Item Difficulty Prediction Using Item Text Features: Comparison of Predictive Performance across Machine-Learning Algorithms"}, {"paperId": "8b7b7d8a1ec9adbf45b168803d3a00fbb49ecf86", "title": "Deep Learning-Based Education Decision Support System for Student E-learning Performance Prediction"}, {"paperId": "9bebf43d6fcc3b88a4bab0ea34493c4be19c34f8", "title": "Recent trends in computational intelligence for educational big data analysis"}, {"paperId": "31d0a6e69e1a826f6edd3684fb66ac875873d299", "title": "Automated smart artificial intelligence-based proctoring system using deep learning"}, {"paperId": "116a5f28f90ee395aa7620ac8fe8d9e22c16911d", "title": "The Detection of Students' Abnormal Behavior in Online Exams Using Facial Landmarks in Conjunction with the YOLOv5 Models"}, {"paperId": "04e4f3661a578b861cb9ac41c325eef29f92b36e", "title": "Computational Intelligence and Soft Computing Paradigm for Cheating Detection in Online Examinations"}, {"paperId": "e1f058dfa77677924e9c2062613bda1843a16dc9", "title": "Machine Learning Technique for Facial Datasets to Detect Examination Fraudulent Activities in the Online Examination: A Systematic Review Approach"}, {"paperId": "07dea28d0aa79e297705dee99022ac5657dd8fc7", "title": "AirBERT: A fine-tuned language representation model for airlines tweet sentiment analysis"}, {"paperId": "85e6e21412bef3d9042b05b57d02e6515631fc83", "title": "Design and Implementation of Online Japanese Examination System Based on Genetic Algorithm"}, {"paperId": "c5de01178993185488e77ad9191ea562221932ad", "title": "Evaluation of Supervised Machine Learning Approaches for Credit Card Fraud Detection"}, {"paperId": "df1049fba56cc85d55562761040bab0bf8319efd", "title": "Towards effective and efficient online exam systems using deep learning-based cheating detection approach"}, {"paperId": "e6da779a3240971872a92351986d405f69b7d28f", "title": "Machine learning-based analysis of online course learning experience"}, {"paperId": null, "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "86c09a09c8881f08e924929e1b02babd0b041e4a", "title": "The Behaviour of the Ensemble Learning Model in Analysing Educational Data on COVID-19"}, {"paperId": "e79efdcb40e3206fa771af05936d8642d48eaf6b", "title": "Examining the Characteristics of Practical Knowledge From Four Public Facebook Communities of Practice in Instructional Design and Technology"}, {"paperId": "8aeef304f1bd390ff9fd544868afbe6850fbb233", "title": "A Novel Classroom Teaching Evaluation Method for Assessing Learning Effectiveness Based on Machine Vision and Neutrosophic Sets A Novel Classroom Teaching Evaluation Method for Assessing Learning Effectiveness Based on Machine Vision and Neutrosophic Sets"}]}
