{"paperId": "28d49e482ac4d8110d05ded3afbb19dfc31dacd9", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Secure Lending: Blockchain and Prospect Theory-Based Decentralized Credit Scoring Model", "abstract": "Credit scoring is a rigorous statistical analysis carried out by lenders and other third parties to access an individual's creditworthiness. Lenders use credit scoring to estimate the degree of risk in lending money to an individual. However, credit score evaluation is primarily based on a transaction record, payment history, professional background, etc. sourced from different credit bureaus. So, evaluating a credit score is a laborious and tedious task involving a lot of paperwork. In this paper, we propose how blockchain can provide the solution to decentralized credit scoring evaluation and reducing the amount of dependence of paperwork. Lending money is not always objective but subjective to every lender. The decision of lending involves different levels of risk and uncertainty, depending on their perspective. This paper uses the prospect theory to model the optimal investment strategy for different risk vs. return scenarios.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2020, "fieldsOfStudy": ["Economics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "2566-2575", "volume": "7"}, "authors": [{"authorId": "150331642", "name": "Vikas Hassija"}, {"authorId": "150108702", "name": "Gaurang Bansal"}, {"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "144996075", "name": "Neeraj Kumar"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "e2073ee911f41593d384836fd008343ebc025e89", "title": "Blockchain-Enabled Intelligent IoT Protocol for High-Performance and Secured Big Financial Data Transaction"}, {"paperId": "170300d60cfa41632f2b733ab741f86204e8defc", "title": "Robust integration of blockchain and explainable federated learning for automated credit scoring"}, {"paperId": "17afb231f3ac2e6b84ff93d1172513381af97676", "title": "Credit risk assessment of small and micro enterprise based on machine learning"}, {"paperId": "25fc15235d20260e098e5c9b121338dc71f808b7", "title": "Blockchain-driven framework for financing credit in small and medium-sized real estate enterprises"}, {"paperId": "6013124a32c83f5ffc550ead60d567cbdd835def", "title": "aChain: A SQL-Empowered Analytical Blockchain as a Database"}, {"paperId": "9a11e2a432fcaa8c3e6054d874dd12b5b810debf", "title": "A hybrid intelligent model based on logistic regression and fuzzy multiple-attribute decision-making for credit evaluation"}, {"paperId": "ba72dcfe336de3577783aea16f7905a00339aedb", "title": "Decentralized Finance (DeFi): A Survey"}, {"paperId": "002891a605352e285834faf7919cec14d49d4a37", "title": "A Blockchain and ML-Based Framework for Fast and Cost-Effective Health Insurance Industry Operations"}, {"paperId": "e184ec0735c430e197356942b6623fc60b877d51", "title": "An Explainable Federated Learning and Blockchain based Secure Credit Modeling Method"}, {"paperId": "ff0380f628a2089307db72ea338c91828abf1813", "title": "CALOSYS — A Robust Blockchain-based Marketing Loan Ecosystem for Small Businesses"}, {"paperId": "ca166c335fc134b32a78f274ad2a898fbf5ea6a2", "title": "A Tale of Two Currencies: Cash and Crypto"}, {"paperId": "d61ff69bf2769cd9dc47094289ab28da847b34c5", "title": "PageRank and HodgeRank on Ethereum Transactions: A Measure for Social Credit"}, {"paperId": "ebc7de649ef1a39dd08a237e4c144f0472a09eb4", "title": "LEChain:Linear Credit Evaluation System Based on Hyperledger Fabric Blockchain"}, {"paperId": "db27b3bbb82e522a7e8810616acfccd0f3141a6d", "title": "Blockchain-envisioned access control for internet of things applications: a comprehensive survey and future directions"}, {"paperId": "c8bfd7a7c7500addb70cf9c3661569e8f2690dc0", "title": "Privacy-preserving credit evaluation system based on blockchain"}, {"paperId": "423014ae513e94ad831df0f444abc4f8af4cec2f", "title": "Effect of Financial Technology Loans on Financial Inclusion Among the Unbanked Low-Income Earners in Makueni County"}, {"paperId": "8299412376e93cd8d335fdb76d506ca7a617f845", "title": "Framework for determining the suitability of blockchain: Criteria and issues to consider"}, {"paperId": "a5cd30c2257edb9d37576b2678b521c354d86825", "title": "Next generation stock exchange: Recurrent neural learning model for distributed ledger transactions"}, {"paperId": "39c73c52d6282006127d38f67915a1082f001fc1", "title": "Security Service Pricing Model for UAV Swarms: A Stackelberg Game Approach"}, {"paperId": "7ff408633dc65f5cea0e245fb5a47efdb570b567", "title": "Blockchain Meets Metaverse and Digital Asset Management: A Comprehensive Survey"}, {"paperId": "7ab5b35173be303616b50c1dc6acca2f8694bae8", "title": "The Gene of the Digital Economy -- Analysis of the Impacts of Blockchain based on Efficiency Economics"}, {"paperId": "0dc06502e8cef9e2f86d0fd0909df0269560d730", "title": "Blockchain in Financial Services: Current Status, Adaptation Challenges, and Future Vision"}]}
