{"paperId": "28d862410eeac829cd8828aad290c5407f655567", "publicationVenue": {"id": "9ead5bad-2c5c-46f1-86ad-edbbde2be17f", "name": "International Symposium on Mixed and Augmented Reality", "type": "conference", "alternate_names": ["Int Symp Mix Augment Real", "ISMAR"], "url": "https://www.ismar.net/"}, "title": "Augmented Scale Models: Presenting Multivariate Data Around Physical Scale Models in Augmented Reality", "abstract": "Recent research in immersive visualisations has explored the use of physical 3D models together with virtual data visualisations, with a simple data encoding. However, little is known about how this technique could be extended towards more complex multivariate data with multiple charts. We present augmented scale models, immersive visualisations that place charts of multivariate data via Augmented Reality (AR) registered to physical 3D models. We identified two main factors for presenting AR charts in the limited display space around the models: 1) how charts are laid out (Slides vs Dashboard), and 2) how the chart views are arranged in the 3D space (On Scale Model, On Table, On Virtual Board). In a within-subject user study, we evaluated these two design considerations. We found that chart layout and view arrangement do not affect task error but do vary in response time. Dashboard and Slides perform equally well on simple tasks that require comparison of a single chart across scale models. However, in more complex tasks such as comparing multiple charts within a scale model or across several scale models, Dashboard shows no decrease in time performance, while Slides’s time performance decreases significantly. We also found that On Scale Model has the fastest performance, has good chart-scale model integration, and supports charts comparison well. On Table and On Virtual Board on the other hand, show a trade-off between the ability to support charts comparison across models and the chart-scale model integration.", "venue": "International Symposium on Mixed and Augmented Reality", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "2022 IEEE International Symposium on Mixed and Augmented Reality (ISMAR)", "pages": "54-63"}, "authors": [{"authorId": "30102786", "name": "Kadek Ananta Satriadi"}, {"authorId": "49126335", "name": "Andrew Cunningham"}, {"authorId": "143885004", "name": "B. Thomas"}, {"authorId": "40974837", "name": "Adam Drogemuller"}, {"authorId": "2198497741", "name": "Antoine Odi"}, {"authorId": "2198752067", "name": "Niki Patel"}, {"authorId": "2193346697", "name": "Cathlyn Aston"}, {"authorId": "2109379677", "name": "Ross T. Smith"}], "citations": [{"paperId": "fd728f690124de98a6869bbfa1a5f57a07611b23", "title": "Context-Dependent Memory in Situated Visualization"}, {"paperId": "7c6545a36615eb271f07c5689ad30ad598f4ea05", "title": "Visualization Placement for Outdoor Augmented Data Tours"}, {"paperId": "734ccdf9adff36db9cb8ef8ffb03a7d64825f5be", "title": "ProxSituated Visualization: An Extended Model of Situated Visualization using Proxies for Physical Referents"}, {"paperId": "717368bfd2f48cd39259dbc29fbedba2f66fda38", "title": "Active Proxy Dashboard: Binding Physical Referents and Abstract Data Representations in Situated Visualization through Tangible Interaction"}, {"paperId": "0b44324228d08d4e310bc43ac730f0001048970a", "title": "Spatiality and Semantics - Towards Understanding Content Placement in Mixed Reality"}, {"paperId": "57d28a956e4694e3986bbff325f9780d878019e1", "title": "iARVis: Mobile AR Based Declarative Information Visualization Authoring, Exploring and Sharing"}]}
