{"paperId": "28e02b004fd93f99d1e085f54a2a18937e700722", "publicationVenue": {"id": "6c3e705d-29b5-462c-9a3a-6c7877b74a18", "name": "JMIR Formative Research", "alternate_names": ["JMIR Form Res"], "issn": "2561-326X", "url": "https://formative.jmir.org/"}, "title": "Reddit and Google Activity Related to Non-COVID Epidemic Diseases Surged at Start of COVID-19 Pandemic: Retrospective Study", "abstract": "Background Resources such as Google Trends and Reddit provide opportunities to gauge real-time popular interest in public health issues. Despite the potential for these publicly available and free resources to help optimize public health campaigns, use for this purpose has been limited. Objective The purpose of this study is to determine whether early public awareness of COVID-19 correlated with elevated public interest in other infectious diseases of public health importance. Methods Google Trends search data and Reddit comment data were analyzed from 2018 through 2020 for the frequency of keywords “chikungunya,” “Ebola,” “H1N1,” “MERS,” “SARS,” and “Zika,” 6 highly publicized epidemic diseases in recent decades. After collecting Google Trends relative popularity scores for each of these 6 terms, unpaired 2-tailed t tests were used to compare the 2020 weekly scores for each term to their average level over the 3-year study period. The number of Reddit comments per month with each of these 6 terms was collected and then adjusted for the total estimated Reddit monthly comment volume to derive a measure of relative use, analogous to the Google Trends popularity score. The relative monthly incidence of comments with each search term was then compared to the corresponding search term’s pre-COVID monthly comment data, again using unpaired 2-tailed t tests. P value cutoffs for statistical significance were determined a priori with a Bonferroni correction. Results Google Trends and Reddit data both demonstrate large and statistically significant increases in the usage of each evaluated disease term through at least the initial months of the pandemic. Google searches and Reddit comments that included any of the evaluated infectious disease search terms rose significantly in the first months of 2020 above their baseline usage, peaking in March 2020. Google searches for “SARS” and “MERS” remained elevated for the entirety of the 2020 calendar year, as did Reddit comments with the words “Ebola,” “H1N1,” “MERS,” and “SARS” (P<.001, for each weekly or monthly comparison, respectively). Conclusions Google Trends and Reddit can readily be used to evaluate real-time general interest levels in public health–related topics, providing a tool to better time and direct public health initiatives that require a receptive target audience. The start of the COVID-19 pandemic correlated with increased public interest in other epidemic infectious diseases. We have demonstrated that for 6 distinct infectious causes of epidemics over the last 2 decades, public interest rose substantially and rapidly with the outbreak of COVID-19. Our data suggests that for at least several months after the initial outbreak, the public may have been particularly receptive to dialogue on these topics. Public health officials should consider using Google Trends and social media data to identify patterns of engagement with public health topics in real time and to optimize the timing of public health campaigns.", "venue": "JMIR Formative Research", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-26", "journal": {"name": "JMIR Formative Research", "volume": "7"}, "authors": [{"authorId": "2151425518", "name": "Jack A. Cummins"}, {"authorId": "8628972", "name": "A. Lipworth"}], "citations": []}
