{"paperId": "28ee52476342cfe935ecb0836348db221f50a6c8", "publicationVenue": {"id": "ccf41f33-ab31-4ad1-bbe9-28fcd8073421", "name": "International Journal of Decision Support System Technology", "type": "journal", "alternate_names": ["Int J Decis Support Syst Technol"], "issn": "1941-6296", "url": "http://www.igi-global.com/ijdsst", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-decision-support-system/1120"]}, "title": "A Novel Query Method for Spatial Database Based on Improved K-Nearest Neighbor Algorithm", "abstract": "Spatial database is a spatial information database and is the core component of geographic information systems (GIS). Aiming at the problem that time complexity of k-nearest neighbor (kNN) querying algorithms are proportionate to scale of training samples, an efficient query method for spatial database based on the Spark framework and the reversed k-nearest neighbor (RkNN) is proposed. Firstly, based on the Spark framework, a two-layer indexing structure based on grid and Voronoi diagram is constructed, and an efficient filtering and a refining processing algorithm are proposed. Secondly, the filtering step of proposed algorithm is used to obtain the candidates, and the refining step is used to remove the candidates. Finally, the candidate sets from different regions are merged to get the final result. Results of experiments on real-world datasets validate that the proposed method has better query performance and better stability and significantly improves the processing speed.", "venue": "International Journal of Decision Support System Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-25", "journal": {"name": "Int. J. Decis. Support Syst. Technol.", "pages": "1-15", "volume": "16"}, "authors": [{"authorId": "2262322918", "name": "Huili Xia"}, {"authorId": "2262290968", "name": "Feng Xue"}], "citations": [{"paperId": "ff6a6a55c6024a93636076cc8775322aca53b13f", "title": "Ship Track Prediction based PSO-LSTM"}]}
