{"paperId": "28fd0a7f962d06e39a4a997c3921f349bfb699cc", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "Modelling and mapping of landslide susceptibility regulating potential ecosystem service loss: an experimental research in Saudi Arabia", "abstract": "Abstract The study aims to create a novel artificial intelligence model-based landslide susceptibility model (LSM) at Aqabat, Saudi Arabia. For LSM, a combination of bagging, dagging, random forest (RF) ensemble with locally weighted learning (LWL), viz. bagging-LWL, dagging-LWL, and RF-LWL has been developed. The 50 landslide areas were divided into two categories training (40) and testing (10). For training datasets, the LWL-Bagging model had the highest AUC value of ROC curve (AUC-0.91), followed by LWL-RF (AUC-0.881), LWL-Dagging (AUC-0.88) and LWL (AUC-0.875). For testing datasets, AUC values of ROC curve of 0.891, 0.876, 0.868, and 0.844 were found for LWL-Bagging, LWL-RF, LWL-Dagging, and LWL, respectively. Based on AUC value, all hybrid machines learning models performed well, but LWL-Bagging model performed as the best fit model. The potential ecosystem loss services were assessed by assessing possible landslide hazards. The research delivers reliable results to influence policy decisions on ecosystem management and landslide-assessment.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-21", "journal": {"name": "Geocarto International", "pages": "10170 - 10198", "volume": "37"}, "authors": [{"authorId": "33931620", "name": "J. Mallick"}, {"authorId": "101201450", "name": "S. AlQadhi"}, {"authorId": "89374469", "name": "Swapan Talukdar"}, {"authorId": "48371279", "name": "S. K. Sarkar"}, {"authorId": "2149544210", "name": "Sujit Kumar Roy"}, {"authorId": "2631791", "name": "Mohd. Ahmed"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "1abf93b9d06fbcccd74ccfc13a4a1d8465401f2f", "title": "Developing a hybrid deep learning model with explainable artificial intelligence (XAI) for enhanced landslide susceptibility modeling and management"}, {"paperId": "77456016e1f76139ad7d5e6d38ac59ed07099cc7", "title": "Evaluating the influence of road construction on landslide susceptibility in Saudi Arabia’s mountainous terrain: a Bayesian-optimised deep learning approach with attention mechanism and sensitivity analysis"}, {"paperId": "3ba23ae4a61f82424ee75315783912e7ec38b1b6", "title": "Soil erosion susceptibility mapping in Bangladesh"}, {"paperId": "fe6aa700ca6e2fe8576a15fa8aa563b0dcae829c", "title": "Flood Risk and Vulnerability from a Changing Climate Perspective: An Overview Focusing on Flash Floods and Associated Hazards in Jeddah"}, {"paperId": "608214a73cfabbf3282147087ea5c743c94e1d33", "title": "Ecosystem Services Assessment for Their Integration in the Analysis of Landslide Risk"}, {"paperId": "741549751a73f48fc93afae789d87039bb8442b2", "title": "Identification and classification of landslide susceptible zone using geospatial techniques and machine learning models"}, {"paperId": "5248cc3cb4cbfac8d0d44fb9a78dd1fc594517c7", "title": "Cost of Ecosystem Service Value Due to Rohingya Refugee Influx in Bangladesh"}, {"paperId": "f722f8665fac04770c2eef4624ed358344d13419", "title": "Assessing the effect of future landslide on ecosystem services in Aqabat Al-Sulbat region, Saudi Arabia"}]}
