{"paperId": "291d89ab3cbd3022c7d701f3087b298bd5eebe8a", "publicationVenue": {"id": "8f125553-3fd5-4370-a175-f7179db29048", "name": "IEEE International Performance, Computing, and Communications Conference", "type": "conference", "alternate_names": ["International Phoenix Conference on Computers and Communications", "IPCCC", "Int Phoenix Conf Comput Commun", "International Performance, Computing, and Communications Conference", "Int Perform Comput Commun Conf", "IEEE Int Perform Comput Commun Conf"], "url": "http://www.ipccc.org/"}, "title": "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation", "abstract": "Distributed dataflow systems like Spark and Flink enable the use of clusters for scalable data analytics. While runtime prediction models can be used to initially select appropriate cluster resources given target runtimes, the actual runtime performance of dataflow jobs depends on several factors and varies over time. Yet, in many situations, dynamic scaling can be used to meet formulated runtime targets despite significant performance variance.This paper presents Enel, a novel dynamic scaling approach that uses message propagation on an attributed graph to model dataflow jobs and, thus, allows for deriving effective rescaling decisions. For this, Enel incorporates descriptive properties that capture the respective execution context, considers statistics from individual dataflow tasks, and propagates predictions through the job graph to eventually find an optimized new scale-out. Our evaluation of Enel with four iterative Spark jobs shows that our approach is able to identify effective rescaling actions, reacting for instance to node failures, and can be reused across different execution contexts.", "venue": "IEEE International Performance, Computing, and Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-08-27", "journal": {"name": "2021 IEEE International Performance, Computing, and Communications Conference (IPCCC)", "pages": "1-8"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2149671071", "name": "Houkun Zhu"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "32428666", "name": "Alexander Acker"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "4e0ad1a7e02d5ace850ad3dce7816424cd42cecc", "title": "Demeter: Resource-Efficient Distributed Stream Processing under Dynamic Loads with Multi-Configuration Optimization"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "9030114775bde4a74fbf73e786afa8b0ed7f147c", "title": "Magpie: Automatically Tuning Static Parameters for Distributed File Systems using Deep Reinforcement Learning"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "ededbd17ad27afa4c2f637710f4d690ff4d4208f", "title": "Phoebe: QoS-Aware Distributed Stream Processing through Anticipating Dynamic Workloads"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "16d2c4bef413d22e16f4560eacd4ad0068db8d09", "title": "Efficient Runtime Profiling for Black-box Machine Learning Services on Sensor Streams"}, {"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud"}, {"paperId": "6f16bc772c8b298ee1d0f3efe6ccec571d3b6c30", "title": "The Methods of Cloud Computing"}]}
