{"paperId": "2929b1a52878020ac679f491c5bb5df4052ba4fc", "publicationVenue": {"id": "8a9e9f3b-a025-473d-801e-72cdb0653d22", "name": "IEEE Symposium Series on Computational Intelligence", "type": "conference", "alternate_names": ["IEEE Symp Ser Comput Intell", "SSCI"], "url": "http://www.ieee-ssci.org/"}, "title": "Synchronicity Identification in Hippocampal Neurons using Artificial Neural Network assisted Fuzzy C-means Clustering", "abstract": "Neural synchronicity plays a vital role in monitoring the functions that are cognitive. Any disturbance identified in the neural synchrony might lead to a diseased state. In the case of in vitro cell recordings, the neurons demonstrate significant heterogeneity in the firing pattern. Thus, the task of automated identification of synchronous and asynchronous neurons from a large population of neuronal cells remains challenging. To address this issue, an efficient unsupervised machine learning approach has been proposed for a system of primary cultures of hippocampal neurons. Here, a confocal microscope is used for imaging of intracellular calcium using Fluo-4 as the fluorescent indicator. The obtained static images are transformed into time-varying data of cytosolic calcium. Subsequently, an intelligent artificial neural network (ANN) assisted fuzzy clustering algorithm is proposed for grouping the synchronous neurons from a heterogeneous set of calcium data that are spiking in nature. This novel algorithm enables a drastic variable reduction followed by the implementation of a global optimization algorithm to solve the problem in Fuzzy C-means (FCM) clustering. Additionally, the proposed technique computes the optimal cluster number and the hyper-parameters involved in ANNs. To validate the result obtained from ANN assisted FCM, a correlation coefficient, and a spiking pattern plot is analyzed for both the synchronous and asynchronous neuronal cells. Besides this, the proposed algorithm is compared with the traditional FCM, where the solution quality is found to be improved along-with an 88% reduction in decision variable count. The complete novel framework combines the aspects of calcium imaging, ANN-assisted FCM, validation, and comparison, which as a whole, can be used for quick and effective quantification of synchronicity.", "venue": "IEEE Symposium Series on Computational Intelligence", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE Symposium Series on Computational Intelligence (SSCI)", "pages": "1594-1600"}, "authors": [{"authorId": "30853241", "name": "P. D. Pantula"}, {"authorId": "23179811", "name": "S. Miriyala"}, {"authorId": "47955438", "name": "L. Giri"}, {"authorId": "144801499", "name": "K. Mitra"}], "citations": [{"paperId": "6c5993e21d61bf8752eec7be7850aa3107b20de2", "title": "Fuzzy c-means clustering in persistence diagram space for deep learning model selection"}]}
