{"paperId": "292a6d3ea851ca86fd2e903b939226fbee3b3dcb", "publicationVenue": {"id": "6363ebc9-706a-4203-b804-148cbf8810ce", "name": "IEEE International Conference on Bioinformatics and Biomedicine", "type": "conference", "alternate_names": ["Bioinform Biomed", "BIBM", "IEEE Int Conf Bioinform Biomed", "Bioinformatics and Biomedicine"], "url": "http://www.wikicfp.com/cfp/program?id=283"}, "title": "Big Data Trends in Bioinformatics", "abstract": "The amount of biological data available for both the academic community and industry has increased due to the rise of high throughput omics technologies, biotechnology, and health monitoring. This scenario demands efficient storage and analysis of the massive amount of data involved. This work aimed to investigate the scientific literature to map topics related to the use of Big Data in Bioinformatics. Due to the large number of relevant papers to inspect, we employed a three-step data-driven systematic approach. We performed a literature search and selected works related to the theme in three search bases (Scopus, ACM, and Web of Science). Then, we proceeded to a text mining step to analyze terms frequently used in the documents and prepare the documents to be inspected. Afterward, we performed a topic modeling using the LDA (Latent Dirichlet Allocation) algorithm. Twenty groups of topics were obtained and drawn in twenty trend topics, which show a revealing state-of-the-art of the Big Data application in Bioinformatics.", "venue": "IEEE International Conference on Bioinformatics and Biomedicine", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 IEEE International Conference on Bioinformatics and Biomedicine (BIBM)", "pages": "1862-1867"}, "authors": [{"authorId": "1492175284", "name": "D. S. Silva"}, {"authorId": "39592606", "name": "Waldeyr M. C. Silva"}, {"authorId": "2227796131", "name": "RuiZhe Guo"}, {"authorId": "1491628823", "name": "Ana Paula Bernardi"}, {"authorId": "2069055719", "name": "A. M. Mariano"}, {"authorId": "143906110", "name": "M. Holanda"}], "citations": [{"paperId": "e58aa7e2780054ffc2b50d50f875b94c2fe69711", "title": "PhyloMatcher: a tool for resolving conflicts in taxonomic nomenclature"}, {"paperId": "e6c6ae490570a284d973907f467484822bdd80cb", "title": "PhyloMatcher: a tool for resolving conflicts in taxonomic nomenclature"}, {"paperId": "767c9cbeb1408c127c36fad69870a52982a84348", "title": "Comprehending the Consequences of Emerging Technologies on Commercial Enterprises"}, {"paperId": "9f61f04a88856e9107518151ae5f1b8630bb95f6", "title": "Using machine learning and RNA to enhance the efficacy of anti-tumor immunotherapy"}, {"paperId": "b7a37553ef6c4d13e19473e76c04bdb09c5b820c", "title": "A novel multiple kernel fuzzy topic modeling technique for biomedical data"}, {"paperId": "d367142ac67db058dfebd4b11757b22dd19012d1", "title": "Measuring Patient Satisfaction in Military Health Care Facilities"}, {"paperId": "94e1f3702f35fb8bfc04895515269fe0da498eac", "title": "Exploratory Analysis of Topic Interests and Their Evolution in Bioinformatics Research Using Semantic Text Mining and Probabilistic Topic Modeling"}, {"paperId": "5cada9ca206da77dfc812e6bfb81734916aaa399", "title": "Data Mining, Data Analytics, and Bioinformatics"}]}
