{"paperId": "293332e0ac5a63974a6df7765a1f2a38a1d2ad8b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Detecting Frauds and Payment Defaults on Credit Card Data Inherited With Imbalanced Class Distribution and Overlapping Class Problems: A Systematic Review", "abstract": "Credit card payments are one popular e-payment option apart from cash payments. Recent reports show that credit card fraud and payment defaults are increasing annually and are alarming. Thus, researchers have attempted various machine learning techniques to address these two challenges. However, they are challenged to mitigate the two major problems inherited in credit card data: (i) imbalanced class distribution and (ii) overlapping classes. Mitigating these problems shall effectively detect credit card frauds and payment defaults, thus benefiting card issuers and holders. Hence, this paper aims to develop a systematic review using PRISMA to identify and compare various credit card datasets, machine learning techniques, and evaluation metrics. Subsequently, we provide recommendations for handling these two problems. We extracted research papers from 2016 to 2023 from ScienceDirect, Springer, Association and Computing Machinery (ACM), and IEEE databases. The papers shall be included if written in English and published in peer-reviewed and indexed journals or conference proceedings. Finally, 87 papers were selected based on the eligibility criteria. Based on our findings, the European and Taiwan datasets are widely used in the research community. However, most researchers focus on tackling imbalanced class distribution rather than two problems together. We recommended to the research community the application of deep learning, ensemble learning, and sampling methods to effectively detect fraud and payment defaults on credit card datasets that inherit the two problems. In evaluating the machine learning algorithms, we recommend using metrics that can separately evaluate the algorithms’ performance in detecting frauds/payment defaults and normal transactions.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "23636-23652", "volume": "12"}, "authors": [{"authorId": "73144267", "name": "Suraya Nurain Kalid"}, {"authorId": "1854731", "name": "Kok-Chin Khor"}, {"authorId": "2874182", "name": "K. Ng"}, {"authorId": "144018653", "name": "Gee-Kok Tong"}], "citations": []}
