{"paperId": "2938a388327ca5a7b960f5259953514597be4bcd", "publicationVenue": null, "title": "Data journeys: Explaining AI workflows through abstraction", "abstract": "Artificial intelligence systems are not simply built on a single dataset or trained model. Instead, they are made by complex data science workflows involving multiple datasets, models, preparation scripts, and algorithms. Given this complexity, in order to understand these AI systems, we need to provide explanations of their functioning at higher levels of abstraction. To tackle this problem, we focus on the extraction and representation of data journeys from these workflows. A data journey is a multi-layered semantic representation of data processing activity linked to data science code and assets. We propose an ontology to capture the essential elements of a data journey and an approach to extract such data journeys. Using a corpus of Python notebooks from Kaggle, we show that we are able to capture high-level semantic data flow that is more compact than using the code structure itself. Furthermore, we show that introducing an intermediate knowledge graph representation outperforms models that rely only on the code itself. Finally, we report on a user survey to reflect on the challenges and opportunities presented by computational data journeys for explainable AI.", "venue": "Semantic Web", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-15", "journal": {"name": "Semantic Web"}, "authors": [{"authorId": "3256660", "name": "E. Daga"}, {"authorId": "143772714", "name": "Paul Groth"}], "citations": [{"paperId": "4dbeed7abe062deef3bf21af148f8355812cda32", "title": "The role of ontologies and knowledge in Explainable AI"}, {"paperId": "c6ae95795d3708f3b0f231e2e301b901a3b4aff9", "title": "Knowledge Engineering using Large Language Models"}, {"paperId": "91ad92f620399550d3045bb26dcef8b98867e631", "title": "Describing and Organizing Semantic Web and Machine Learning Systems in the SWeMLS-KG"}, {"paperId": "1ba48015b302deb9f86fe7c864d559d0aa68bf14", "title": "Documenting the research process. Opportunities and challenges for Bibliometrics and IR"}]}
