{"paperId": "2942a6844ca3ad1aff9a0f0cd046a0c24e740652", "publicationVenue": null, "title": "Estimating traffic speed and speeding using passively collected big mobility data and a distributed computing framework", "abstract": "With the increasing availability of location‐aware devices, passively collected big GPS trajectory data offer new opportunities for analyzing human mobility. Processing big GPS trajectory data, especially extracting information from billions of trajectory points and assigning information to corresponding road segments in road networks, is a challenging but necessary task for researchers to take full advantage of big data. In this research, we propose an Apache Spark and Sedona‐based computing framework that is capable of estimating traffic speeds for statewide road networks from GPS trajectory data. Taking advantage of spatial resilient distributed datasets supported by Sedona, the framework provides high computing efficiency while using affordable computing resources for map matching and waypoint gap filling. Using a mobility dataset of 126 million trajectory points collected in California, and a road network inclusive of all road types, we computed hourly speed estimates for approximately 600,000 segments across the state. Comparing speed estimates for freeway segments with speed limits, our speed estimates showed that speeding on freeways occurred mostly during the nighttime, while analysis of travel on residential roads showed that speeds were relatively stable over the 24‐h period.", "venue": "Trans. GIS", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "Transactions in GIS", "pages": "1124 - 1144", "volume": "27"}, "authors": [{"authorId": "2115512685", "name": "Peiqi Zhang"}, {"authorId": "1411091750", "name": "Kathleen Stewart"}, {"authorId": "2110973148", "name": "Yao Li"}], "citations": [{"paperId": "f324b3c83b800aa2218c54996656b48052e56770", "title": "Using Connected Vehicle Trajectory Data to Evaluate the Effects of Speeding"}]}
