{"paperId": "2945b18928a36ac1a42f1b8bc1ecdd67056d1a1e", "publicationVenue": {"id": "0f1e902e-a969-4a5d-b316-f66ac2bb560c", "name": "International Workshop on Data Management on New Hardware", "type": "conference", "alternate_names": ["Int Workshop Data Manag New Hardw", "Data Manag New Hardw", "DaMoN", "Data Management on New Hardware"], "url": "http://www.wikicfp.com/cfp/program?id=640"}, "title": "Sampling-Based AQP in Modern Analytical Engines", "abstract": "As the data volume grows, reducing the query execution times remains an elusive goal. While approximate query processing (AQP) techniques present a principled method to trade off accuracy for faster queries in analytics, the sample creation is often considered a second-class citizen. Modern analytical engines optimized for high-bandwidth media and multi-core architectures only exacerbate existing inefficiencies, resulting in prohibitive query-time online sampling and longer preprocessing times in offline AQP systems. We demonstrate that the sampling operators can be practical in modern scale-up analytical systems. First, we evaluate three common sampling methods, identify algorithmic bottlenecks, and propose hardware-conscious optimizations. Second, we reduce the performance penalties of the added processing and sample materialization through system-aware operator design and compare the sample creation time to the matching relational operators of an in-memory JIT-compiled engine. The cost of data reduction with materialization is up to 2.5x of the equivalent group-by in the case of stratified sampling and virtually free (∼ 1x) for reasonable sample sizes of other strategies. As query processing starts to dominate the execution time, the gap between online and offline AQP methods diminishes.", "venue": "International Workshop on Data Management on New Hardware", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-06-12", "journal": {"name": "Proceedings of the 18th International Workshop on Data Management on New Hardware"}, "authors": [{"authorId": "2057858492", "name": "Viktor Sanca"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "4e9ef60fdd0c08b017e34bcefb683c90c65eacb8", "title": "Approximate Queries over Concurrent Updates"}, {"paperId": "0b9584de2f1a5e4f2ea65cee5867a1cbf22ce129", "title": "LAQy: Efficient and Reusable Query Approximations via Lazy Sampling"}, {"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics"}, {"paperId": "1f5c14f07f57227a5b5547f7b49781f61daa94e9", "title": "Communication-Optimal Parallel Reservoir Sampling"}, {"paperId": "d67b7d43e04cda818bdcae7a28b342c41c860339", "title": "Post-Moore's Law Fusion: High-Bandwidth Memory, Accelerators, and Native Half-Precision Processing for CPU-Local Analytics"}, {"paperId": "34efce39ddd4ea592ccb1e5f5c83c32f8f64fe86", "title": "Improving K-means Clustering Using Speculation"}]}
