{"paperId": "2945fd1128d486440cdc2041424ca473986cc9d5", "publicationVenue": {"id": "24801f27-1857-45ea-bdd8-478426c32142", "name": "ACM Transactions on Storage", "type": "journal", "alternate_names": ["ACM Trans Storage"], "issn": "1553-3077", "url": "http://portal.acm.org/tos", "alternate_urls": ["https://tos.acm.org/"]}, "title": "DEFUSE: An Interface for Fast and Correct User Space File System Access", "abstract": "Traditionally, the only option for developers was to implement file systems (FSs) via drivers within the operating system kernel. However, there exists a growing number of file systems (FSs), notably distributed FSs for the cloud, whose interfaces are implemented solely in user space to (i) isolate FS logic, (ii) take advantage of user space libraries, and/or (iii) for rapid FS prototyping. Common interfaces for implementing FSs in user space exist, but they do not guarantee POSIX compliance in all cases, or suffer from considerable performance penalties due to high amounts of wait context switchs between kernel and user space processes. We propose DEFUSE: an interface for user space FSs that provides fast accesses while ensuring access correctness and requiring no modifications to applications. DEFUSE: achieves significant performance improvements over existing user space FS interfaces thanks to its novel design that drastically reduces the number of wait context switchs for FS accesses. Additionally, to ensure access correctness, DEFUSE: maintains POSIX compliance for FS accesses thanks to three novel concepts of bypassed file descriptor (FD) lookup, FD stashing, and user space paging. Our evaluation spanning a variety of workloads shows that by reducing the number of wait context switchs per workload from as many as 16,000 or 41,000 with filesystem in user space down to 9 on average, DEFUSE: increases performance 2× over existing interfaces for typical workloads and by as many as 10× in certain instances.", "venue": "ACM Transactions on Storage", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-30", "journal": {"name": "ACM Transactions on Storage (TOS)", "pages": "1 - 29", "volume": "18"}, "authors": [{"authorId": "1659436513", "name": "James Lembke"}, {"authorId": "3183500", "name": "Pierre-Louis Roman"}, {"authorId": "1697599", "name": "P. Eugster"}], "citations": [{"paperId": "4bcb42006fe71352c46888315fb4c6cec8ca5fdb", "title": "Time Administration of Virtual File System Operations"}]}
