{"paperId": "294e1f4869f9cb18915f22ca1308243b6c4e32c8", "publicationVenue": {"id": "165fa1b5-e07f-4b6e-9203-04493f6a7c5c", "name": "Frontiers in Big Data", "alternate_names": ["Front Big Data"], "issn": "2624-909X", "url": "https://www.frontiersin.org/journals/big-data"}, "title": "Toward data lakes as central building blocks for data management and analysis", "abstract": "Data lakes are a fundamental building block for many industrial data analysis solutions and becoming increasingly popular in research. Often associated with big data use cases, data lakes are, for example, used as central data management systems of research institutions or as the core entity of machine learning pipelines. The basic underlying idea of retaining data in its native format within a data lake facilitates a large range of use cases and improves data reusability, especially when compared to the schema-on-write approach applied in data warehouses, where data is transformed prior to the actual storage to fit a predefined schema. Storing such massive amounts of raw data, however, has its very own challenges, spanning from the general data modeling, and indexing for concise querying to the integration of suitable and scalable compute capabilities. In this contribution, influential papers of the last decade have been selected to provide a comprehensive overview of developments and obtained results. The papers are analyzed with regard to the applicability of their input to data lakes that serve as central data management systems of research institutions. To achieve this, contributions to data lake architectures, metadata models, data provenance, workflow support, and FAIR principles are investigated. Last, but not least, these capabilities are mapped onto the requirements of two common research personae to identify open challenges. With that, potential research topics are determined, which have to be tackled toward the applicability of data lakes as central building blocks for research data management.", "venue": "Frontiers in Big Data", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-08-19", "journal": {"name": "Frontiers in Big Data", "volume": "5"}, "authors": [{"authorId": "2339286", "name": "P. Wieder"}, {"authorId": "1785408193", "name": "Hendrik Nolte"}], "citations": [{"paperId": "a4c0f28866282e6367925e87c67a7e692e40a839", "title": "Enabling enterprise autonomy development with a unified data infrastructure"}, {"paperId": "8f6111c659df5487470b05e8d58a286694dd853b", "title": "Italian, European, and international neuroinformatics efforts: An overview"}, {"paperId": "5f448aa0f3cbc9fd98911af4889e62c3c1370562", "title": "Learn Land Features Using Python Language"}, {"paperId": "b8142eca6ab6b3af2aa5680d3fdb275ade03fcbd", "title": "Progress Analytics in Support of Engineering Advising and Program Reform"}]}
