{"paperId": "295814eba4f5fbc0381d33bc9ed16f4e2eb5949e", "publicationVenue": null, "title": "On-demand aggregation of gridded data over user-specified spatio-temporal domains", "abstract": "The advent of satellite imagery, remote sensing products, and global scale numerical climate models over the last two decades has created an explosion of available gridded environmental data. These space-time explicit datasets are produced and distributed using different spatial and temporal resolutions. Current approaches for comparing two different products generally involve offline pre-computation of aggregations to a common spatio-temporal resolution. This limits the user's ability to interactively compare different data products or transform data products into the required input resolution for modeling. The goal of this work is to enable end users to perform on- the-fly transformations of gridded data products to different spatio-temporal resolutions to facilitate exploratory analyses and comparison of different data products. In this paper we propose a compressed columnar indexing and query processing to support online aggregation of gridded data over user-specified spatio-temporal domains. Our approach requires up to two orders of magnitude less space than more traditional indexing while maintaining competitive execution time for different aggregations in time and space.", "venue": "SIGSPATIAL/GIS", "year": 2016, "fieldsOfStudy": ["Computer Science", "Geography"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2016-10-31", "journal": {"name": "Proceedings of the 24th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "37636509", "name": "Joel E. Tosado"}, {"authorId": "2257058", "name": "Gheorghi Guzun"}, {"authorId": "1791664", "name": "G. Canahuate"}, {"authorId": "144724690", "name": "R. Mantilla"}], "citations": [{"paperId": "57329a4eeb3e4064ead4707b57207fdebbe5e6f2", "title": "Faster Multidimensional Data Queries on Infrastructure Monitoring Systems"}, {"paperId": "b9310d531b5d72a58845e8aa278eeeebe87002f3", "title": "Multidimensional Preference Query Optimization on Infrastructure Monitoring Systems"}]}
