{"paperId": "295dda7a62a6aee0ab26d96a98646e4990db807c", "publicationVenue": {"id": "fcad2179-afdc-4360-ad8b-8b714f64dab3", "name": "AIMS Mathematics", "alternate_names": ["AIM Math"], "issn": "2473-6988", "url": "https://www.aimspress.com/journal/Math", "alternate_urls": ["https://www.aimspress.com/journal/Math/archive.html"]}, "title": "Vision graph neural network-based neonatal identification to avoid swapping and abduction", "abstract": "\nInfant abductions from medical facilities such as neonatal switching, in which babies are given to the incorrect mother while in the hospital, are extremely uncommon. A prominent question is what we can do to safeguard newborns. A brand-new vision graph neural network (ViG) architecture was specifically created to handle this problem. Images were divided into several patches, which were then linked to create a graph by connecting their nearest neighbours to create a ViG model, which converts and communicates information between all nodes based on the graph representation of the newborn's photos taken at delivery. ViG successfully captures both local and global spatial relationships by utilizing the isotropic and pyramid structures within a vision graph neural network, providing both precise and effective identification of neonates. The ViG architecture implementation has the ability to improve the security and safety of healthcare facilities and the well-being of newborns. We compared the accuracy, recall, and precision, F1-Score, Specificity with CNN, GNN and Vision GNN of the network. In that comparison, the network has a Vision GNN accuracy of 92.65%, precision of 92.80%, F1 score of 92.27%, recall value of 92.25%, and specificity of 98.59%. The effectiveness of the ViG architecture was demonstrated using computer vision and deep learning algorithms to identify the neonatal and to avoid baby swapping and abduction.\n", "venue": "AIMS Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "AIMS Mathematics"}, "authors": [{"authorId": "2221907059", "name": "Madhusundar Nelson"}, {"authorId": "5463522", "name": "Surendran Rajendran"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}], "citations": [{"paperId": "573025ffa186768190ae559525a37c2de5592408", "title": "Deep Learning-Based Intelligent Model for Neonatal Cyanosis Identification Using SSGNN"}]}
