{"paperId": "29875289adee9fcd7d66e5a6900819d8fe29e2bc", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Biometrics for Internet-of-Things Security: A Review", "abstract": "The large number of Internet-of-Things (IoT) devices that need interaction between smart devices and consumers makes security critical to an IoT environment. Biometrics offers an interesting window of opportunity to improve the usability and security of IoT and can play a significant role in securing a wide range of emerging IoT devices to address security challenges. The purpose of this review is to provide a comprehensive survey on the current biometrics research in IoT security, especially focusing on two important aspects, authentication and encryption. Regarding authentication, contemporary biometric-based authentication systems for IoT are discussed and classified based on different biometric traits and the number of biometric traits employed in the system. As for encryption, biometric-cryptographic systems, which integrate biometrics with cryptography and take advantage of both to provide enhanced security for IoT, are thoroughly reviewed and discussed. Moreover, challenges arising from applying biometrics to IoT and potential solutions are identified and analyzed. With an insight into the state-of-the-art research in biometrics for IoT security, this review paper helps advance the study in the field and assists researchers in gaining a good understanding of forward-looking issues and future research directions.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "34800223", "name": "Wencheng Yang"}, {"authorId": "47672587", "name": "Song Wang"}, {"authorId": "47813746", "name": "N. Sahri"}, {"authorId": "2204255", "name": "Nickson M. Karie"}, {"authorId": "48796850", "name": "Mohiuddin Ahmed"}, {"authorId": "3262441", "name": "C. Valli"}], "citations": [{"paperId": "fbd75818cacdca6eedc8ad2301eb92a28b2dc6e4", "title": "AI-powered biometrics for Internet of Things security: A review and future vision"}, {"paperId": "2ce003e0023a8097b4311e0493f717f5595140c7", "title": "Unlocking the potential: A comprehensive meta-synthesis of Internet of Things in the sports industry"}, {"paperId": "acfca7999729ad50b94df6e3ebef2c6fda1ee029", "title": "Presenting the Secure Collapsible Makerspace with Biometric Authentication"}, {"paperId": "9cddb76c900c4e73de7ae9856ddd8f912d29ed1e", "title": "AI for Identity and Access Management (IAM) in the Cloud: Exploring the Potential of Artificial Intelligence to Improve User Authentication, Authorization, and Access Control within Cloud-Based Systems"}, {"paperId": "d1350b33bbec603fa97ba146dd91e577d32f0c25", "title": "Feature extraction and learning approaches for cancellable biometrics: A survey"}, {"paperId": "321f7c18e6a0602b285f835203b19f9209e69dde", "title": "Review of EEG-Based Biometrics in 5G-IoT: Current Trends and Future Prospects"}, {"paperId": "feb0a856cfa284003542e859e7805c76fd6b18d6", "title": "A Secure, Flexible, and PPG-Based Biometric Scheme for Healthy IoT Using Homomorphic Random Forest"}, {"paperId": "cfc412b6a8faf1fc840cd9f970950c72cc22a6cf", "title": "SSFID: A Survey and Analysis of Security Framework for IoT Devices"}, {"paperId": "f9e65850bb4c3e88446206c8d57a55bf75c9aa51", "title": "Harnessing highly efficient triboelectric sensors and machine learning for self-powered intelligent security applications"}, {"paperId": "52687a4cbd0a75271c89c0cb78e1752fd0a35305", "title": "Pedestrian Attribute Recognition via Spatio-Temporal Relationship Learning for Visual Surveillance"}, {"paperId": "6be0a68a0cc65c726c04f8f322c5130dc0494d95", "title": "Monitoring soil elements for irrigation management using Internet of Things (IoT) sensors"}, {"paperId": "606d90c68c214da6d1ab2644df00d7ca6e23795d", "title": "Technologies and Services of Communication for Embedded Systems over Internet"}, {"paperId": "dc93e628f333440c1427a9d43d04d9176d98b035", "title": "A Blockchain and IoT-Enabled Secure Health Data Handling Framework"}, {"paperId": "c84e4f8ca905835761de61d4b48f536cfe80f940", "title": "The Role of Biometric in Banking: A Review"}, {"paperId": "0aeeb85853f872cbf88982791b602d9d2df9dad3", "title": "Penerapan Metode Mel Frequency Cepstral Coefficients pada Sistem Pengenalan Suara Berbasis Desktop"}, {"paperId": "95bbf52a69888c916b8142bd08b9725fe262e8b6", "title": "Analysis on IoT Networks Security : Threats, Risks, ESP8266 based Penetration Testing Device and Defense Framework for IoT Infrastructure"}, {"paperId": "c03ba6f4597bb446850739d94856c85868ef0e74", "title": "Enhancing Person Identification with Score Fusion of Biometric Modalities"}, {"paperId": "023a47a666a4544f8e7ca8d8d925d649f9ca1996", "title": "Low Valence Low Arousal Stimuli: An Effective Candidate for EEG-Based Biometrics Authentication System"}, {"paperId": "72116124e29b2acffe42bb489a4b64a92dd8cd6c", "title": "Trust and Voice Biometrics Authentication for Internet of Things"}, {"paperId": "649c90dd9761b942d2e315d25e3b1a829836f6c7", "title": "A Review of Homomorphic Encryption for Privacy-Preserving Biometrics"}, {"paperId": "f8113c846cad5d66fd54c4fdff442430b7d2125e", "title": "Internet of Things (IoT) Feedback System using Raspberry Pi"}, {"paperId": "302fe5ed012a1ed553ba7f9bccb9fb789719b913", "title": "Photoplethysmography Data Reduction Using Truncated Singular Value Decomposition and Internet of Things Computing"}, {"paperId": "56f3108f167ce7b9897dc183ab1326a6b253d1a6", "title": "KurdFace Morph Dataset Creation Using OpenCV"}, {"paperId": "e861117a9d6e8fbd7759eb29b6c1c4f045b4059e", "title": "Co-Learning to Hash Palm Biometrics for Flexible IoT Deployment"}, {"paperId": "d8cb4e00ad8f219cea5ee6ab1731c66d2c548ea6", "title": "Autenticação Biométrica Baseada em PPG e ECG utilizando Aprendizado Profundo"}, {"paperId": "002879fb1d00875d2fce944d412f58d714ed81ec", "title": "Finger Vein and Inner Knuckle Print Recognition Based on Multilevel Feature Fusion Network"}, {"paperId": "3104d2c8d739132d10909962749bfd453794fd3a", "title": "Implementation of face recognition system using BioCryptosystem as template protection scheme"}, {"paperId": "613f8f68744ee14d11fe3a757d68a31e4f7ca0c3", "title": "Highly Sensitive Mutual-Capacitive Fingerprint Sensor With Reference Electrode"}, {"paperId": "5c4486e2351accf7ff61ac1da681f6167f9e73df", "title": "A Secure Online Fingerprint Authentication System for Industrial IoT Devices over 5G Networks"}, {"paperId": "ba327f4daa856eb12a07fdcd474d4df625d0321f", "title": "A Digital Twin Case Study on Automotive Production Line"}, {"paperId": "605826a4e43ad4f24535a86e5d559c8470720435", "title": "Big Health Data Research and Group Harm: The Scope of IRB Review."}, {"paperId": "6a8bd808d2d443b1b496720e8a45354880652855", "title": "Breath odor-based individual authentication by an artificial olfactory sensor system and machine learning."}, {"paperId": "29b879dbefd26017dba2334c1f6321a773406697", "title": "Biometric Identification System based on Object Interactions in Internet of Things Environments"}, {"paperId": "973ee470bce24e0554be6f67415579505dafc0b0", "title": "Representation Learning for EEG-Based Biometrics Using Hilbert-Huang Transform"}, {"paperId": "a61f6cc1dd6c24dfd60e287755039ccdbc2ab1d1", "title": "A Real-Time Biometric Encryption Scheme Based on Fuzzy Logic for IoT"}, {"paperId": "22e1c199346233271033911c159b4691246931b7", "title": "Requirements for Energy-Harvesting-Driven Edge Devices Using Task-Offloading Approaches"}, {"paperId": "e3bcb5a3cb1c7c022a86c70ee3f461e09973d746", "title": "Reinforced Palmprint Reconstruction Attacks in Biometric Systems"}, {"paperId": "20bf33e4d933a705125b1ae7f3114f0492ebabb0", "title": "Industry 4.0: A Proposal of Paradigm Organization Schemes from a Systematic Literature Review"}, {"paperId": "e8cf2f8686da296cf2dd78ce99b84fd8836a82e5", "title": "Quantum advantage in biometric authentication with single photons"}, {"paperId": "2e2f6e6cebd13a3e1326e4b3f60cb12ea19d5fe9", "title": "IoT based Attendance Management System (AMS) with Smartwatches' Compatibility"}, {"paperId": "353faacbafd20de0fa4923206ea81d59f71496c0", "title": "Data structure>labels? Unsupervised heuristics for SVM hyperparameter estimation"}, {"paperId": "4550bed44a38d20f4059dfb6ba541cf2eacb1fab", "title": "Electrical Impedance of Upper Limb Enables Robust Wearable Identity Recognition against Variation in Finger Placement and Environmental Factors"}, {"paperId": "2f0ac71f6a3022d8fbc383de10ac511b4e487999", "title": "Enhancing Mobile Security through Comprehensive Penetration Testing"}, {"paperId": "4ce6bfb8dd45df1ae65add1e58747d93d3d29263", "title": "A Review on Protection and Cancelable Techniques in Biometric Systems"}, {"paperId": "fdf27a3dfaae06c5d61800b3902258edcd598131", "title": "A Review on Security Issues and Solutions of the Internet of Drones"}, {"paperId": "c84a4c436adc2a893a57eff0e5285b2707d39a60", "title": "LORENA: Low memORy symmEtric-key geNerAtion method for based on group cryptography protocol applied to the Internet of Healthcare Things"}, {"paperId": "a512408cb102427a1013925fd7da260b91221436", "title": "Privacy Preservation of Biometrics Used for IoT Systems Security: Brief Review"}]}
