{"paperId": "2997cfe0dd219e9b009bad5c98bdc1079b01e073", "publicationVenue": {"id": "0f276dc7-7c36-4465-aab9-b358ee2dafa9", "name": "International Journal of Data Warehousing and Mining", "type": "journal", "alternate_names": ["Int J Data Warehous Min"], "issn": "1548-3924", "url": "http://www.idea-group.com/journals/details.asp?id=4291", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-data-warehousing-mining/1085"]}, "title": "Optimizing ETL by a Two-Level Data Staging Method", "abstract": "In data warehousing, the data from source systems are populated into a central data warehouse DW through extraction, transformation and loading ETL. The standard ETL approach usually uses sequential jobs to process the data with dependencies, such as dimension and fact data. It is a non-trivial task to process the so-called early-/late-arriving data, which arrive out of order. This paper proposes a two-level data staging area method to optimize ETL. The proposed method is an all-in-one solution that supports processing different types of data from operational systems, including early-/late-arriving data, and fast-/slowly-changing data. The introduced additional staging area decouples loading process from data extraction and transformation, which improves ETL flexibility and minimizes intervention to the data warehouse. This paper evaluates the proposed method empirically, which shows that it is more efficient and less intrusive than the standard ETL method.", "venue": "International Journal of Data Warehousing and Mining", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-07-01", "journal": {"name": "Int. J. Data Warehous. Min.", "pages": "32-50", "volume": "12"}, "authors": [{"authorId": "2109303346", "name": "Xiufeng Liu"}, {"authorId": "1697336", "name": "N. Iftikhar"}, {"authorId": "2609599", "name": "Huan Huo"}, {"authorId": "66190632", "name": "P. S. Nielsen"}], "citations": [{"paperId": "711c0f54ea1d563e8693dacb039e4c2dc70acd94", "title": "Extending The Data Integration Model As The Foundation Of Business Intelligence: A Systematic Literature Review"}, {"paperId": "07088415e22c004b197a63e43c9529d2985873c2", "title": "A data warehouse model for quicker and less expensive implementation"}, {"paperId": "35211ec6da7c8043115670ef97386a28405f16b8", "title": "Multi-Stage Change Data Capture for Files Based System Using Spark ETL Engine"}]}
