{"paperId": "29b90bad02baeaf81531059034eccfc829c9718f", "publicationVenue": {"id": "3d29f427-4810-477c-a7eb-1ce6161b0a7d", "name": "European Conference on Complex Systems", "type": "conference", "alternate_names": ["ECCS", "Eur Conf Complex Syst"]}, "title": "Server Capacity Planning Based Task Computation Offloading in Vehicular Edge Computing Networks", "abstract": "Vehicular edge computing (VEC) is a new paradigm that combines edge computing with vehicular networks to facilitate the efficient processing of data generated by vehicles. In this approach, vehicles offload their computing tasks to nearby roadside units (RSUs) for faster processing. However, VEC faces several challenges in handling offloaded tasks due to the overloading problem on edge servers. As a result, VEC’s performance can deteriorate significantly. To mitigate these challenges, this paper proposes a server capacity planning-based task computation offloading (SCPTCO) approach for vehicular networks (VNs). Server capacity planning is the process of estimating the required capacity of edge servers to handle the offloaded computing tasks from vehicles. Our proposed SCPTCO approach ensures the efficient utilization of edge servers by estimating the required server capacity. Furthermore, we designed a mobility model that considers vehicle movements at various speeds to simulate real-life scenarios. The results of the simulation demonstrated that our proposal performed better than the baseline approaches in all scenarios. It can significantly reduce both service time and task failure rate by 21.3% and 72.2%, respectively, compared to the local edge offloading with random capacity (LEORC) scheme. Moreover, when compared to a local edge offloading with equal capacity (LEOEC) scheme, the reduced rates are around 11.6% and 55.8%, respectively.", "venue": "European Conference on Complex Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-10", "journal": {"name": "2023 European Conference on Communication Systems (ECCS)", "pages": "1-6"}, "authors": [{"authorId": "153080552", "name": "M. Hossain"}, {"authorId": "50299803", "name": "Tangina Sultana"}, {"authorId": "2194615428", "name": "Sharmen Akhter"}, {"authorId": "9369513", "name": "Md. Imtiaz Hossain"}, {"authorId": "50044989", "name": "Ga-Won Lee"}, {"authorId": "1705900", "name": "Eui-nam Huh"}], "citations": []}
