{"paperId": "29df816fd2ba778e9c07d474b9cf476a4911d6c2", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Enabling Efficient and General Subpopulation Analytics in Multidimensional Data Streams", "abstract": "\n Today's large-scale services (\n e.g.\n , video streaming platforms, data centers, sensor grids) need diverse real-time summary statistics across multiple subpopulations of multidimensional datasets. However, state-of-the-art frameworks do not offer general and accurate analytics in real time at reasonable costs. The root cause is the combinatorial explosion of data subpopulations and the diversity of summary statistics we need to monitor simultaneously. We present Hydra, an efficient framework for multidimensional analytics that presents a novel combination of using a \"sketch of sketches\" to avoid the overhead of monitoring exponentially-many subpopulations and universal sketching to ensure accurate estimates for multiple statistics. We build Hydra as an Apache Spark plugin and address practical system challenges to minimize overheads at scale. Across multiple real-world and synthetic multidimensional datasets, we show that Hydra can achieve robust error bounds and is an order of magnitude more efficient in terms of operational cost and memory footprint than existing frameworks (e.g., Spark, Druid) while ensuring interactive estimation times.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "ArXiv", "volume": "abs/2208.04927"}, "authors": [{"authorId": "3440271", "name": "Antonis Manousis"}, {"authorId": "2152159672", "name": "Zhuo Cheng"}, {"authorId": "51294444", "name": "Ran Ben Basat"}, {"authorId": "2080111", "name": "Zaoxing Liu"}, {"authorId": "145145415", "name": "Vyas Sekar"}], "citations": [{"paperId": "ea1baafd5caf148a3f7891251b72297fca7fd895", "title": "OmniSketch: Efficient Multi-Dimensional High-Velocity Stream Analytics with Arbitrary Predicates"}, {"paperId": "79de44f24d4375aaf5c21375b8fe4de55ab5111f", "title": "TrustSketch: Trustworthy Sketch-based Telemetry on Cloud Hosts"}]}
