{"paperId": "29e6c3576e6b22793b64985ca341c9234fbc46ae", "publicationVenue": {"id": "80f85f47-9f79-4683-b9e0-9df43c2cc065", "name": "Measurement science and technology", "type": "journal", "alternate_names": ["Meas sci technol", "Meas Sci Technol", "Measurement Science and Technology"], "issn": "0957-0233", "url": "http://www.iop.org/EJ/journal/-page=scope/0957-0233/1", "alternate_urls": ["http://iopscience.org/mst", "https://iopscience.iop.org/0957-0233"]}, "title": "Imbalanced fault identification via embedding-augmented Gaussian prototype network with meta-learning perspective", "abstract": "In practical engineering, the number of acquired fault samples from different categories can be vastly different due to the low probability of key equipment malfunctioning. When training the imbalanced data, many methods focus on balancing the number of samples or weights between different categories, which may be time-consuming and easy to over-fit. To address this problem, we propose the embedding-augmented Gaussian prototype network (EGPN), which applies a new training mechanism from the perspective of meta-learning. We only train the categories with large samples and the remaining categories only appear in the testing process to calculate untrained prototypes. EGPN includes a feature-embedding augmented module, weighted prototype module and metric module. Firstly, ordinary convolution and dilated convolution are mixed to capture different frequency bands simultaneously, and the residual attention module is added to highlight key features and suppress unimportant features. Different prototypes are calculated by weighting to the embedding vectors through the Gaussian covariance matrix. Finally, the classification is done according to the modified distance. The experiments in the two datasets indicate that the proposed method can effectively recognize the untrained categories with only a few samples used as the prototypes, and can tackle the problem of identifying imbalanced fault data efficiently.", "venue": "Measurement science and technology", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2021-11-22", "journal": {"name": "Measurement Science and Technology", "volume": "33"}, "authors": [{"authorId": "2028270290", "name": "Rujie Hou"}, {"authorId": "2109268698", "name": "Zhenyi Chen"}, {"authorId": "1476814888", "name": "Jinglong Chen"}, {"authorId": "8661775", "name": "Shuilong He"}, {"authorId": "30163510", "name": "Zitong Zhou"}], "citations": [{"paperId": "82f5290906beca9a77bf5c1d3406d419e3c0d94c", "title": "MP-FedCL: Multiprototype Federated Contrastive Learning for Edge Intelligence"}, {"paperId": "ea53502397da9f720a1c4e304badde6e348c78f9", "title": "The intelligent detection method for flip chips using CBN-S-Net algorithm with SAM images"}, {"paperId": "47befcf20103b21c26b933c5b2c210175a15139c", "title": "Imbalance fault diagnosis under long-tailed distribution: Challenges, solutions and prospects"}, {"paperId": "73a82951cffde2841f9cf843a5898eec29ec813e", "title": "High-temperature augmented neighborhood metric learning for cross-domain fault diagnosis with imbalanced data"}, {"paperId": "e6e1006325eb499ced8e80ce99624653fb4910b8", "title": "Data Compression and Damage Evaluation of Underground Pipeline With Musicalized Sonar GMM"}, {"paperId": "01ef9fd30c1e08dc9f38b6ca2b07efd50608f729", "title": "Prediction of Pakistani Honey Authenticity Through Machine Learning"}]}
