{"paperId": "29f01905441870b8653b779bb536d870fe84558b", "publicationVenue": null, "title": "Vibration Signal Processing for Multirotor UAVs Fault Diagnosis: Filtering or Multiresolution Analysis?", "abstract": "In the modern technological advancements, Unmanned Aerial Vehicles (UAVs) have emerged across diverse applications. As UAVs evolve, fault diagnosis witnessed great advancements, with signal processing methodologies taking center stage. This paper presents an assessment of vibration-based signal processing techniques, focusing on Kalman filtering (KF) and Discrete Wavelet Transform (DWT) multiresolution analysis. Experimental evaluation of healthy and faulty states in a quadcopter, using an accelerometer, are presented. The determination of the 1024 Hz sampling frequency is facilitated through finite element analysis of 20 mode shapes. KF exhibits commendable performance, successfully segregating faulty and healthy peaks within an acceptable range. While the six-level multi-decomposition unveils good explanations for fluctuations eluding KF. Ultimately, both KF and DWT showcase high-performance capabilities in fault diagnosis. However, DWT shows superior assessment precision, uncovering intricate details and facilitating a holistic understanding of fault-related characteristics.", "venue": "Eksploatacja i Niezawodność – Maintenance and Reliability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-08", "journal": {"name": "Eksploatacja i Niezawodność – Maintenance and Reliability"}, "authors": [{"authorId": "2202994870", "name": "Luttfi A. Al-Haddad"}, {"authorId": "2176817772", "name": "Wojciech Giernacki"}, {"authorId": "46250081", "name": "A. Shandookh"}, {"authorId": "2271438672", "name": "A. A. Jaber"}, {"authorId": "2175714870", "name": "Radosław Puchalski"}], "citations": [{"paperId": "8d11b53c0dcd39c232a2079d4a353cfbb31f5cb1", "title": "Three-dimensional analysis of steel beam-column bolted connections"}]}
