{"paperId": "29f01a27f44d85a91fe4a9476236890b039136a3", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Application of Data Warehouse Technology Based on Neural Network in Physical Education Quality Management", "abstract": "Data warehouse technology has been created because of China’s technological advancement and the increasing requirements of the educational sector. Physical assessments are treated as tests by many students. Institutions spend plenty of time every year through physical tests, yet the results are rarely shared with students. Teachers are impeded by the size and complexity of physical test data, finding it challenging to support experiments or judge individual students’ development. Students have trouble following up and delivering test-based feedback after instruction. In recent years, various researchers have offered insightful advice on how to build multidimensional database structures for such trouble. However, quality requirements alone are not adequate to guarantee quality in reality. So, this paper presents a novel Hypertuned wide polynet convolutional neural network (HWPCNN) framework in the data warehouse technology to attain the greatest performance in physical education quality management. In this paper, we first apply HWPCNNs for physical education quality management to analyze the accuracy and recall of the model. It is no secret that HWPCNN is now one of the most widely used deep learning techniques. When it comes to managing the quality of physical education, the HWPCNN’s local perception feature in the data warehouse technology allows it to achieve the best possible results. To validate the model’s performance, it is compared to other models and then improved further to increase its accuracy. The physical education resources are gathered as a raw dataset for this inquiry. The raw dataset is cleaned using the Z-score approach to get it ready for further data processing. Then, a sparse matrix approach is employed to build a data cube, while the proposed method is used to index multidimensional databases. To demonstrate that our work is of the best quality in managing physical education, performance metrics of the suggested method are also evaluated and compared with other traditional methods.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-28", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2112525941", "name": "Bo Zhao"}, {"authorId": "2155419253", "name": "Yanjin Liu"}], "citations": [{"paperId": "274ed86cd4fe1f6a9ae296f0e8ac9f6d37d79aae", "title": "Retracted: Application of Data Warehouse Technology Based on Neural Network in Physical Education Quality Management"}]}
