{"paperId": "2a0f8a2bada28b388afef69f2e243ce8c52ecc76", "publicationVenue": {"id": "cf083d4f-b621-467c-9d8a-f3a52ebd4847", "name": "Ingeniería y Desarrollo", "alternate_names": ["Ing Desarro"], "issn": "0122-3461", "url": "http://www.scielo.org.co/scielo.php?lng=en&pid=0122-3461&script=sci_serial", "alternate_urls": ["https://www.redalyc.org/revista.oa?id=852"]}, "title": "Behavior Driven Development: Best Practices for Software Quality", "abstract": "Asegurar la calidad y funcionalidad de un producto de software es garantizar su correcta estructura, composición, ejecución e integridad, pero en algunos casos estas características se ven afectadas debido a la ineficiente gestión y desarrollo del software. El objetivo de la revisión fue identificar buenas prácticas al usar el desarrollo guiado por comportamientos. Para su desarrollo, se indagó en artículos de investigación categorizados en revistas indexadas en bases de datos como IEEE, ScienceDirect, Scielo, Scopus y Redalyc elaboradas entre los años 2016 y 2020. El análisis y revisión permitió identificar buenas prácticas, como el uso de los escenarios solo para pruebas de funcionalidad, organizar las características en carpetas de acuerdo a los escenarios del sistema, contextualizar el funcionamiento al mismo idioma de los clientes para facilitar la comunicación, el uso de etiquetas para agrupar escenarios, organizar características según necesidades y generar escenarios sin dependencia. Se concluyó que estas buenas prácticas permiten una correcta comunicación, diseño estructurado del software, calidad funcional de cada componente de código y sobre todo un producto eficiente con riesgo mínimo de pérdida de recursos y alto margen de éxito.", "venue": "Ingeniería y Desarrollo", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-21", "journal": {"name": "Ingeniería y Desarrollo"}, "authors": [{"authorId": "2134894172", "name": "Aldo Emanuel Soraluz Soraluz"}, {"authorId": "2134894174", "name": "Miguel Ángel Valles Coral"}, {"authorId": "2107860155", "name": "Danny Lévano Rodríguez"}], "citations": []}
