{"paperId": "2a147765b21d0ebb7e415186aee0a187fae6f5f6", "publicationVenue": null, "title": "Simulation-ready digital twin for realtime management of logistics systems", "abstract": "Event-discrete simulation is a key method for decision support systems in planning and control of logistics systems. The ability to start a simulation based on the current situation of the system in real-time is central for these systems. In this paper, we present our system architecture that combines a real-time digital twin of logistics systems with simulation logic in a single (modularized) model. This combination not only reduces offline work creating and maintaining such a model and decision support system but also reduces runtime in this critical real-time use-case. The approach is demonstrated in two industrial use cases.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "4194-4201"}, "authors": [{"authorId": "2046961157", "name": "Benjamin Korth"}, {"authorId": "2432044", "name": "C. Schwede"}, {"authorId": "66406004", "name": "M. Zajac"}], "citations": [{"paperId": "9a06964b5168500f2b1a3887a7b7e2d267117094", "title": "Digital twins and 3D information modeling in a smart city for traffic controlling: A review"}, {"paperId": "3a344a87abf9fb068d3fb6c5313bdea99eddd169", "title": "Data-Based Digital Twin of an Automated Guided Vehicle System"}, {"paperId": "aee45700e2851258d331264be1fc26120c764d00", "title": "Knowledge Equivalence in Digital Twins of Intelligent Systems"}, {"paperId": "6e218d7c9a8bdf18f3615169cd39250cecbbf2c6", "title": "Productivity prediction in aircraft final assembly lines: Comparisons and insights in different productivity ranges"}, {"paperId": "7fd08804f91fdaa3bbcee39bcff36bc4a73f939a", "title": "Digital Supply Chain Twins—Conceptual Clarification, Use Cases and Benefits"}, {"paperId": "9a318623ec2b599c1b7bb4aad603f6c2915ad30c", "title": "A Digital Twin Decision Support System for the Urban Facility Management Process"}, {"paperId": "3a99722cd637887426bac353dcd722d35ce0c082", "title": "Digital Twin-Enabled Decision Support in Mission Engineering and Route Planning"}, {"paperId": "9be0ecf586c2fceb9e2e4546d4d3f4a1bb237f2b", "title": "Comparison of anticipatory algorithms for a dial-a-ride problem"}, {"paperId": "cfcc66ddaaa7065ed475742d193dc76dcd230296", "title": "A Privacy-Preserving Logistics Information System with Traceability"}, {"paperId": "540a230ea308288d91d9cf58898cf29f87b72c48", "title": "IPPODAMO: a Digital Twin Support for Smart Cities Facility Management"}, {"paperId": "29f6531848df27518e225e9d24c034e8060afdc1", "title": "Towards a Digital Twin Framework for Adaptive Last Mile City Logistics"}, {"paperId": "9b843ecf58ce7df3dca84de6c15f9f0d636aea2e", "title": "How Digital Twin Concept Supports Internal Transport Systems?—Literature Review"}, {"paperId": "e6619950364c2bde904f09dec9c49d9dcd5d8d12", "title": "Digital Twins for the built environment: learning from conceptual and process models in manufacturing"}, {"paperId": "7d86409c73e17177b47b3f3b7977121ab8e98418", "title": "Supply Chain Digital Twin Framework Design: An Approach of Supply Chain Operations Reference Model and System of Systems"}, {"paperId": "abe941abaa976343ee682d4e3438f4f930fc75bd", "title": "Digital Twin of COVID-19 Mass Vaccination Centers"}, {"paperId": "ab613c9bcf9af44ec0c7e7be5f420d68346a3413", "title": "Digital Twin for Supply Chain Coordination in Modular Construction"}, {"paperId": "d016bee5f14bb7159c5d68f6e0ac48cf94f33ec3", "title": "Towards Digital Twins of Multimodal Supply Chains"}, {"paperId": "c043c7bbfa376d1e8408970cf8a2b5848a345eee", "title": "Empowering Digital Twin for Industry 4.0 using metaheuristic optimization algorithms: case study PCB drilling optimization"}, {"paperId": "46167a4d9ec9386e5873fbbed4fb16e7c6cd95ed", "title": "A digital twin emulator of a modular production system using a data-driven hybrid modeling and simulation approach"}, {"paperId": "6de5b73bd13cb16166c8920935f2f1399b9d0cce", "title": "Digital Twin for Legal Requirements in Production and Logistics based on the Example of the Storage of Hazardous Substances"}, {"paperId": "cc48fda67ab6ce63932a3c5b21309e106d2e6476", "title": "Parallel Societies: A Computing Perspective of Social Digital Twins and Virtual-Real Interactions"}, {"paperId": "aabf5fc33df15795f57ee692c159e0470b26c2e0", "title": "Operations Management of Satellite Launch Centers"}, {"paperId": "3a6e1df171667c9e6b883b959baaef81b3e541e8", "title": "Production logistics digital twins: Research profiling, application, challenges and opportunities"}, {"paperId": "c89ce2d02f7cfb527658b0ab6dc22eb7c4a8d393", "title": "MODELLING OF E-COMMERCE PACKING LINE IN THE WAREHOUSE – CASE STUDY"}, {"paperId": "6ec84720417f80375cd5791f8209c73cb475e97a", "title": "Supply Chains in the Era of Digital Twins – A Review"}, {"paperId": "3090d6f901a340c70e69420b57181b8af922a7ee", "title": "Architecting Digital Twins"}, {"paperId": "07f00d2f8bade43e73d399f29dc0510280b332e6", "title": "Digital Twin: Technology Evolution Stages and Implementation Layers with Technology Elements"}, {"paperId": "41a8d50d856183ac93d5a96acccfb4dd97d572b0", "title": "Modeling, Analysis, and Optimization of Robotic Light Machining Tasks for Empowering Digital Twin: Generalized Impulse Model Approach"}, {"paperId": "5802f20ee8b5cc5a03665b1b2540010bf6eb8802", "title": "A Cross-Domain Systematic Mapping Study on Software Engineering for Digital Twins"}, {"paperId": "689f42d77ef9f0e71e7149044501a3e673e0e658", "title": "Decision Support for Production Control based on Machine Learning by Simulation-generated Data"}, {"paperId": "7b1b8448263c88f252ef4da26447531bb4d2a306", "title": "5-Dimension Cross-Industry Digital Twin Applications Model and Analysis of Digital Twin Classification Terms and Models"}, {"paperId": "7dc6244e3a9226c4722fbbfc1294ff332ca85b9e", "title": "INNOVATIONS IN LOGISTICS NETWORKS ON THE BASIS OF THE DIGITAL TWIN"}, {"paperId": "32f85dd3f1f32ac6e7f39f52780c35f976de3c04", "title": "On-demand Shared Digital Twins - An Information Architectural Model to Create Transparency in Collaborative Supply Networks"}, {"paperId": "ec32358ddfdcdd298b433fda39401f384bea3c3a", "title": "Simulation-based decision support tool for in-house logistics: the basis for a digital twin"}, {"paperId": "8b2ecf593d4f02de97812522670479d1eba90959", "title": "Digital Twins in Order Picking Systems for Operational Decision Support"}, {"paperId": "5a5bdeadac99c8ed0161e907e5ed9d9eccf51929", "title": "Exploring the Potential of Digital Twins for Production Control & Monitoring"}, {"paperId": "af955b5297e63591a2fd5ec521143330cb6f7c98", "title": "The Role of Digital Twins in the Fulfilment Logistics Chain"}, {"paperId": "7d8ac6efde5654cc0fcf445761af8bdf7e5666a5", "title": "Digital Twins as manifestations of Software eating the world: beyond the Information Technology (IT) artifact"}]}
