{"paperId": "2a1b37af13d9d8993acd74f155efce0349a466fc", "publicationVenue": {"id": "4d899b46-b5c8-436e-8ce3-084673ea8905", "name": "Big Data & Society", "type": "journal", "alternate_names": ["Big Data  Soc"], "issn": "2053-9517", "url": "http://bds.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/bds"]}, "title": "Accounting for the social: Investigating commensuration and Big Data practices at Facebook", "abstract": "This study explores Big Data practices at Facebook through an investigation of the role of commensuration or ‘the transformation of different qualities into a common metric’ in the structuration of analysis and interaction with a major online social media platform. It proposes a conceptual framework and demonstrates the empirical potential of a pragmatic approach based on reading published materials and available documentation. Facebook’s Data Warehousing and Analytics Infrastructure serves as an illustrative example to begin tracing out and describe data assemblages in more detail. In being attentive to the motivations, drivers and challenges engineers face when dealing with Big Data, it is argued that their solutions can enable and support but also constrain specific analytical and transactional capabilities or data flows between various devices and actors. The analysis thus moves beyond methodological critiques of the utility of Big Data that lack empirical support and specificity. It is further argued that analytics not just describe but also actively participate in the enactment of social worlds, thereby opening possibilities for new markets or market segments to arise. Online sociality accounts for a model of the social that makes it visible and measurable qua markets inviting data recontextualisation and the creation of value along multiple axes. Contra Facebook’s claim to make the web more ‘social’, an investigation of commensuration brings to the fore the question how the social is accounted for in the first place.", "venue": "Big Data & Society", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-02-09", "journal": {"name": "Big Data & Society", "volume": "3"}, "authors": [{"authorId": "20846153", "name": "F. V. D. Vlist"}], "citations": [{"paperId": "fccffe82cbe143bc17c27658ad10213163f5aef4", "title": "AI micro-decisions in FinTechs: a mixed method research design"}, {"paperId": "2b1483199d9484e71a28ae5d9a3a66ede2b4ece1", "title": "Human Computer Interaction And User Experience In Computers: An Assessment Of Current Approaches And New Concepts)"}, {"paperId": "94a8053f08556a36df8722f53fe9616f3ea9d444", "title": "CounterFAccTual: How FAccT Undermines Its Organizing Principles"}, {"paperId": "f4cd35f1db63138068d1db01833d0a75c5721f00", "title": "The Media Psychology of Boredom and Mobile Media Use: Theoretical and Methodological Innovations"}, {"paperId": "f48058aa9070b4fd3eb4796e74c9ae932f73dd11", "title": "Accounting in a Social Context"}, {"paperId": "18806624de6d711bc44dd6155ffbac33cb853d70", "title": "Impact of Big Data Analysis on Accounting Profession Field – Study in Jordanian Business Environment"}, {"paperId": "79472473bb90bba50e9018c6ae7b13a98b1ac9a9", "title": "‘Ethical’ artificial intelligence in the welfare state: Discourse and discrepancy in Australian social services"}, {"paperId": "1706b74b9741ae1a47e240025936b28c0a8beeee", "title": "Accounting, Auditing, Accountability: Key Insights from a Multidisciplinary Review of AI and Big Data Literature"}, {"paperId": "e424cc2caf38f9a981c661d86d8ddf023cf3c80f", "title": "Social Media and Platform Historiography: Challenges and Opportunities"}, {"paperId": "d5e0985a0a53e0498da05cca8bdc6126f3ce8239", "title": "Regramming the Platform: Infrastructural Relations between Apps and Social Media"}, {"paperId": "50119fba18732649c9e64adf9cc298c0b1d5dd00", "title": "Algorithmic decision-making? The user interface and its role for human involvement in decisions supported by artificial intelligence"}, {"paperId": "882dc00e207a5a5d731fc7336850bdc72cd510b1", "title": "Virtual Flânerie Teju Cole and the Algorithmic Logic of Racial Ascription"}, {"paperId": "450e99b046262d168c74d61a74b3694e962e2d9e", "title": "Climate of Data-driven Innovation Within E-business Retail Actors"}, {"paperId": "2efe3da4e790569fb9cd98534023e9bfbbad9507", "title": "Prospecting Facebook: the limits of the economy of attention"}, {"paperId": "5fbfb55c28304169b7cae0b2d88e365f5442f580", "title": "Ethics Are Admin: Australian Human Research Ethics Review Forms as (Un)Ethical Actors"}, {"paperId": "3b84fa90cae10be09de72a48ea6db8b20270a858", "title": "Datification and its human, organizational and societal effects: The strategic opportunities and challenges of algorithmic decision-making"}, {"paperId": "bc0fd9a19026326a07295525599503a01b02f4a4", "title": "Debating big data: A literature review on realizing value from big data"}, {"paperId": "eebcd2c0d61b33b73413208f22077c70fc1e865f", "title": "Counter-Mapping Surveillance : A Critical Cartography of Mass Surveillance Technology After Snowden"}, {"paperId": "a714269fa44287c2d7c4c75d847cb72a823b7427", "title": "Data journeys: Capturing the socio-material constitution of data objects and flows"}, {"paperId": "05fa25333af2a8cc4e39933c48c9fd72eaece143", "title": "Debating Big Data"}, {"paperId": "6145ca512a489cc43c9d8a93501fa35c28924838", "title": "Big data analytics techniques and their impacts on reducing information asymmetry: Evidence from Jordan"}, {"paperId": "dab7fb61e8f660954d97863585708b0814a220e6", "title": "Diaspora and mapping methodologies : tracing transnational digital connections with ‘mattering maps’"}, {"paperId": "bca2b75e49e8be7f720c6c43d807123aa6518d00", "title": "Closing the Loop of Big Data Analytics: the Case of Learning Analytics"}, {"paperId": "46d6780bb76b796cd147acd36bcef1b493418d70", "title": "Regarding The Constants Of Nature And Of Art"}]}
