{"paperId": "2a1b6b67460d54839d1633556aab642ab5f0229e", "publicationVenue": {"id": "9039088a-b047-49bc-b12a-3334017ad93d", "name": "Asia-Pacific Conference on Communications", "type": "conference", "alternate_names": ["APCC", "Asia-pacific Conf Commun"], "issn": "2163-0771"}, "title": "Non-parametric message important measure: Compressed storage design for big data in wireless communication systems", "abstract": "This paper mainly considers the compressed storage problem for big data in wireless communication systems, where the message importance is taken into account. Similar to Shannon Entropy and Renyi Entropy, we first define a non-parametric message important measure (NMIM) as a measure for message importance. It can characterize the uncertainty of random events. It is proved that it can sufficiently describe the two key characters of big data: rare events finding and large diversities of events. Based on NMIM, we propose an effective compressed encoding mode for data storage in wireless communication systems. Numerical simulation results show that using our developed strategy takes up very little storage space without losing too much message importance.", "venue": "Asia-Pacific Conference on Communications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 23rd Asia-Pacific Conference on Communications (APCC)", "pages": "1-6"}, "authors": [{"authorId": "3127248", "name": "Shanyun Liu"}, {"authorId": "1978166", "name": "R. She"}, {"authorId": "7469995", "name": "Pingyi Fan"}, {"authorId": "2605688", "name": "Jiaxun Lu"}], "citations": [{"paperId": "1da6c4154d7facf3c2f05fee7c8bd13ea68a15aa", "title": "Load Optimization of Joint User Association and Dynamic TDD in Ultra Dense Networks"}, {"paperId": "152f57993f22d6a5e7be8c1783ac35dd2dbdf47f", "title": "Importance of Small Probability Events in Big Data: Information Measures, Applications, and Challenges"}, {"paperId": "b2f17e2bfd30ba51a7719dd95b8ab25d6234bf16", "title": "A Switch to the Concern of User: Importance Coefficient in Utility Distribution and Message Importance Measure"}, {"paperId": "33824843dc7564075fddf25f9e47728d55d0af9c", "title": "Non-Parametric Message Importance Measure: Storage Code Design and Transmission Planning for Big Data"}, {"paperId": "581d5d4487a92d57dfe0d94a66fcdcaed3abe09d", "title": "Amplifying Inter-Message Distance: On Information Divergence Measures in Big Data"}]}
