{"paperId": "2a1e7f1ff800df05188f109c30a5810cf9c1dfb9", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Energy and Distance-Aware Hopping Sensor Relocation for Wireless Sensor Networks", "abstract": "Recent advances in big data technology collecting and analyzing large amounts of valuable data have attracted a lot of attention. When the information in non-reachable areas is required, IoT wireless sensor network technologies have to be applied. Sensors fundamentally have energy limitations, and it is almost impossible to replace energy-depleted sensors that have been deployed in an inaccessible region. Therefore, moving healthy sensors into the sensing hole will recover the faulty sensor area. In rough surfaces, hopping sensors would be more appropriate than wheel-driven mobile sensors. Sensor relocation algorithms to recover sensing holes have been researched variously in the past. However, the majority of studies to date have been inadequate in reality, since they are nothing but theoretical studies which assume that all the topology in the network is known and then computes the shortest path based on the nonrealistic backing up knowledge—The topology information. In this paper, we first propose a distributed hopping sensor relocation protocol. The possibility of movement of the hopping sensor is also considered to recover sensing holes and is not limited to applying the shortest path strategy. Finally, a performance analysis using OMNeT++ has demonstrated the solidification of the excellence of the proposed protocol.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "1768192", "name": "Moonseong Kim"}, {"authorId": "46569954", "name": "Sooyeon Park"}, {"authorId": "4940270", "name": "Woochang Lee"}], "citations": [{"paperId": "e728046e34000fbd5e4e97295122dfe5c1390ce0", "title": "Algorithm for link prediction in self-regulating network with adaptive topology based on graph theory and machine learning"}, {"paperId": "0d9742b47cc86dfc917766e5a0936bd58f6f6394", "title": "Adaptive Success Rate-based Sensor Relocation for IoT Applications"}, {"paperId": "4ff71742a0da3415bf662f07d0e3c7f18856c936", "title": "Ping-Pong Free Advanced and Energy Efficient Sensor Relocation for IoT-Sensory Network"}, {"paperId": "c53fa3a13a46e8fba7fae882539a4ff5a28fa45a", "title": "Energy-Efficient Asynchronous QoS MAC Protocol for Wireless Sensor Networks"}, {"paperId": "e3356595f3ff38e25c7d0849cd6e2718f1098967", "title": "Energy-Efficient Wireless Hopping Sensor Relocation Based on Prediction of Terrain Conditions"}, {"paperId": "a5dac64f9470fac19ecfdb645d591ca610090505", "title": "Mobility Aware Duty Cycling Algorithm (MADCAL) A Dynamic Communication Threshold for Mobile Sink in Wireless Sensor Network †"}, {"paperId": "1655b391cc4cfbf960575739951cdf9e69eadd0f", "title": "Minimizing the Adverse Effects of Asymmetric Links: A Novel Cooperative Asynchronous MAC Protocol for Wireless Sensor Networks"}, {"paperId": "b522d6fd935a138a23cea2076dbd98a3fbae641f", "title": "SENET: A novel architecture for IoT-based body sensor networks"}, {"paperId": "1139e60545d9a824dbea53db432002c355beafd9", "title": "Success Rate Queue-based Relocation Algorithm of Sensory Network to Overcome Non-uniformly Distributed Obstacles"}]}
