{"paperId": "2a24078aef433e13455050e18b8a3c09fc907dab", "publicationVenue": {"id": "8dce23a9-44e0-4381-a39e-2acc1edff700", "name": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval", "type": "conference", "alternate_names": ["International ACM SIGIR Conference on Research and Development in Information Retrieval", "Int ACM SIGIR Conf Res Dev Inf Retr", "SIGIR", "Annu Int ACM SIGIR Conf Res Dev Inf Retr"], "url": "http://www.acm.org/sigir/"}, "title": "A Consumer Compensation System in Ride-hailing Service", "abstract": "In the ride-hailing business, compensation is mostly used to motivate consumers to place more orders and grow the market scale. However, most of the previous studies focus on car-hailing services. Few works investigate localized smart transportation innovations, such as intra-city freight logistics and designated driving. In addition, satisfying consumer fairness and improving consumer surplus, with the objective of maximizing revenue, are also important. In this paper, we propose a consumer compensation system, where a transfer learning enhanced uplift modeling is designed to measure the elasticity, and a model predictive control based optimization is formulated to control the budget accurately. Our implementation is effective and can keep the online environment lightweight. The proposed system has been deployed in the production environment of the real-world ride-hailing platform for 300 days, which outperforms the expert strategy by using 0.5% less subsidy and achieving 14.4% more revenue.", "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-07-18", "journal": {"name": "Proceedings of the 46th International ACM SIGIR Conference on Research and Development in Information Retrieval"}, "authors": [{"authorId": "2186863918", "name": "Zhe Yu"}, {"authorId": "2223808732", "name": "Chi Xia"}, {"authorId": "2184617617", "name": "Shaosheng Cao"}, {"authorId": "2122829946", "name": "Lin Zhou"}, {"authorId": "2223852719", "name": "Haibin Huang"}], "citations": []}
