{"paperId": "2a379714af3bbce01a729617650b590283c1b746", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Wind Speed Prediction via Collaborative Filtering on Virtual Edge Expanding Graphs", "abstract": "Accurate and stable wind speed prediction is crucial for the safe operation of large-scale wind power grid connections. Existing methods are typically limited to a certain fixed area when learning the information of the wind speed sequence, which cannot make full use of the spatiotemporal correlation of the wind speed sequence. To address this problem, in this paper we propose a new wind speed prediction method based on collaborative filtering against a virtual edge expansion graph structure in which virtual edges enrich the semantics that the graph can express. It is an effective extension of the dataset, connecting wind turbines of different wind farms through virtual edges to ensure that the spatial correlation of wind speed sequences can be effectively learned and utilized. The new collaborative filtering on the graph is reflected in the processing of the wind speed sequence. The wind speed is preprocessed from the perspective of pattern mining to effectively integrate various information, and the k-d tree is used to match the wind speed sequence to achieve the purpose of collaborative filtering. Finally, a model with long short-term memory (LSTM) as the main body is constructed for wind speed prediction. By taking the wind speed of the actual wind farm as the research object, we compare the new approach with four typical wind speed prediction methods. The mean square error is reduced by 16.40%, 11.78%, 9.57%, and 18.36%, respectively, which demonstrates the superiority of the proposed new method.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-06", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "1491243011", "name": "Xiang Ying"}, {"authorId": "2074108746", "name": "Keke Zhao"}, {"authorId": "144530683", "name": "Zhiqiang Liu"}, {"authorId": "1557315198", "name": "Jie Gao"}, {"authorId": "40137924", "name": "Dongxiao He"}, {"authorId": "50079136", "name": "Xuewei Li"}, {"authorId": "2055449196", "name": "Weixin Xiong"}], "citations": [{"paperId": "bceb8aaf2e9849d44216268d9633904f74a847bc", "title": "Multi-Step-Ahead Wind Speed Forecast Method Based on Outlier Correction, Optimized Decomposition, and DLinear Model"}, {"paperId": "c63c2236ce590febfe633fc0f19ce834cdd1eedb", "title": "Performance Analysis of Novel Linear Regression Algorithm with Improved Accuracy Compared over K-Nearest Neighbor in Predicting Wind Power Generation"}]}
