{"paperId": "2a5084827f67adc34a88ba6985970a88ea71017d", "publicationVenue": {"id": "4cc151d1-e28c-4fdf-a570-77c73d5ab813", "name": "International Conference on Behavioral, Economic, and Socio-Cultural Computing", "type": "conference", "alternate_names": ["BESC", "Int Conf Behav Econ Socio-cultural Comput"]}, "title": "Beyond Scores: A Novel Method for Predicting Student Performance Based on Rank and Positional Embedding", "abstract": "Predicting student performance based on continuous assessment scores is an important task in educational data mining (EDM). The task aims to provide personalized feedback and intervention for students at risk of failing the course or dropping out. In this paper, we examine the limitations of using raw scores as input features for predicting student outcomes, as raw scores can be biased and sensitive to the variation of assignment difficulty. We propose a novel approach that uses rank instead of score as the input feature for predicting student performance. Rank is a relative measure that reflects the performance of a student compared to other students in the same course or cohort, which can reduce bias caused by different score distributions and assignment difficulties, and capture the relative position and improvement of each student. In this paper, we use the idea of positional embedding to encode rank into a dense representation for prediction models. Positional encoding assigns a vector representation to each rank based on its ordinal position in a sequence. We apply positional encoding to various recurrent neural network (RNN) models and other machine learning models, such as logistic regression and support vector machines. We compare their performance on public datasets of student assessment scores. Our results show that using rank with positional encoding can significantly improve the prediction accuracy and reliability of RNN models and their variants.", "venue": "International Conference on Behavioral, Economic, and Socio-Cultural Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-30", "journal": {"name": "2023 10th International Conference on Behavioural and Social Computing (BESC)", "pages": "1-7"}, "authors": [{"authorId": "2279866026", "name": "Han Wei"}, {"authorId": "46948092", "name": "Zongxi Li"}, {"authorId": "2279759123", "name": "Haoran Xie"}, {"authorId": "2257044786", "name": "Kevin Hung"}, {"authorId": "2279760884", "name": "Minhong Wang"}], "citations": []}
