{"paperId": "2a57522a24304999c93f3e79625395055aa32d68", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Resource-efficient In-orbit Detection of Earth Objects", "abstract": "With the rapid proliferation of large Low Earth Orbit (LEO) satellite constellations, a huge amount of in-orbit data is generated and needs to be transmitted to the ground for processing. However, traditional LEO satellite constellations, which downlink raw data to the ground, are significantly restricted in transmission capability. Orbital edge computing (OEC), which exploits the computation capacities of LEO satellites and processes the raw data in orbit, is envisioned as a promising solution to relieve the downlink burden. Yet, with OEC, the bottleneck is shifted to the inelastic computation capacities. The computational bottleneck arises from two primary challenges that existing satellite systems have not adequately addressed: the inability to process all captured images and the limited energy supply available for satellite operations. In this work, we seek to fully exploit the scarce satellite computation and communication resources to achieve satellite-ground collaboration and present a satellite-ground collaborative system named TargetFuse for onboard object detection. TargetFuse incorporates a combination of techniques to minimize detection errors under energy and bandwidth constraints. Extensive experiments show that TargetFuse can reduce detection errors by 3.4 times on average, compared to onboard computing. TargetFuse achieves a 9.6 times improvement in bandwidth efficiency compared to the vanilla baseline under the limited bandwidth budget constraint.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-19", "journal": {"name": "ArXiv", "volume": "abs/2402.01675"}, "authors": [{"authorId": "2136450158", "name": "Qiyang Zhang"}, {"authorId": "2225872016", "name": "Xin Yuan"}, {"authorId": "2133283184", "name": "Ruolin Xing"}, {"authorId": "2223689685", "name": "Yiran Zhang"}, {"authorId": "2282549670", "name": "Zimu Zheng"}, {"authorId": "35203306", "name": "Xiao Ma"}, {"authorId": "2239403838", "name": "Mengwei Xu"}, {"authorId": "1691109", "name": "S. Dustdar"}, {"authorId": "2262490952", "name": "Shangguang Wang"}], "citations": [{"paperId": "d4974c17e0b9f8d717d17dab7dfcc08f85d7a1be", "title": "FOOL: Addressing the Downlink Bottleneck in Satellite Computing with Neural Feature Compression"}]}
