{"paperId": "2a5701e86e4a1e5e23eca55c2e7fceba34382487", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Trevor: Automatic configuration and scaling of stream processing pipelines", "abstract": "Operating a distributed data stream processing workload efficiently at scale is hard. The operator of the workload must parallelize and lay out tasks of the workload with resources that match the requirement of target data rate. The challenge is that neither the operator nor the programmer is typically aware of the scaling behavior of the workload as a function of resources. An operator manually searches for a safe operating point that can handle predicted peak load and deploys with ample headroom for absorbing unpredictable spikes. Such empirical, static over-provisioning is wasteful of both compute and human resources. We show that precise performance models can be automatically learned for distributed stream processing systems that can predict the execution performance of a job even before deployment. Further, those models can be used to optimally schedule logically specified jobs onto available physical hardware. Finally, those models and the derived execution schedules can be refined online to dynamically adapt to unpredictable changes in the runtime environment or auto-scale with variations in job load.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-22", "journal": {"name": "ArXiv", "volume": "abs/1812.09442"}, "authors": [{"authorId": "3088529", "name": "M. Bansal"}, {"authorId": "38765920", "name": "Eyal Cidon"}, {"authorId": "2241031", "name": "Arjun Balasingam"}, {"authorId": "2128934", "name": "Aditya Gudipati"}, {"authorId": "117272782", "name": "Christos Kozyrakis"}, {"authorId": "2546322", "name": "S. Katti"}], "citations": [{"paperId": "047d86734c430bbf532b9fd516909add5b34facc", "title": "On combining system and machine learning performance tuning for distributed data stream applications"}, {"paperId": "5ed281bcb30c45bc8f506e247703940d0432217c", "title": "Automatic Performance Tuning for Distributed Data Stream Processing Systems"}, {"paperId": "915ab7b6ca3633230403d47dbb31cf74888cc5c9", "title": "A Survey on Automatic Parameter Tuning for Big Data Processing Systems"}, {"paperId": "40d69f150c1f7409e86f8c3c04d8005a7e6c7ca3", "title": "Real-time resource scaling platform for Big Data workloads on serverless environments"}]}
