{"paperId": "2a673134bb09aff3d2a594f00214abada65976d6", "publicationVenue": {"id": "b6519d1e-b933-42fb-b3f6-eb61165a7434", "name": "IEEE Journal on Emerging and Selected Topics in Circuits and Systems", "type": "journal", "alternate_names": ["IEEE J Emerg Sel Top Circuit Syst"], "issn": "2156-3357", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5503868"}, "title": "Domain-Specific Quantum Architecture Optimization", "abstract": "With the steady progress in quantum computing over recent years, roadmaps for upscaling quantum processors have relied heavily on the targeted qubit architectures. So far, similarly to the early age of classical computing, these designs have been crafted by human experts. These general-purpose architectures, however, leave room for customization and optimization, especially when targeting popular near-term QC applications. In classical computing, customized architectures have demonstrated significant performance and energy efficiency gains over general-purpose counterparts. In this paper, we present a framework for optimizing quantum architectures, specifically through customizing qubit connectivity. It is the first work that (1) provides performance guarantees by integrating architecture optimization with an optimal compiler, (2) evaluates the impact of connectivity customization under a realistic crosstalk error model, and (3) benchmarks on realistic circuits of near-term interest, such as the quantum approximate optimization algorithm (QAOA) and quantum convolutional neural network (QCNN). We demonstrate up to 59% fidelity improvement in simulation by optimizing the heavy-hexagon architecture for QAOA maxcut circuits, and up to 14% improvement on the grid architecture. For the QCNN circuit, architecture optimization improves fidelity by 11% on the heavy-hexagon architecture and 605% on the grid architecture.", "venue": "IEEE Journal on Emerging and Selected Topics in Circuits and Systems", "year": 2022, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-29", "journal": {"name": "IEEE Journal on Emerging and Selected Topics in Circuits and Systems", "pages": "624-637", "volume": "12"}, "authors": [{"authorId": "1959238401", "name": "Wan-Hsuan Lin"}, {"authorId": "2218979994", "name": "D. Tan"}, {"authorId": "10777296", "name": "M. Niu"}, {"authorId": "1491910780", "name": "J. Kimko"}, {"authorId": "2259796", "name": "J. Cong"}], "citations": [{"paperId": "f2d118742a90b30bf0a0233246fa20d045679920", "title": "Context-Aware Coupler Reconfiguration for Tunable Coupler-Based Superconducting Quantum Computers"}, {"paperId": "fd3ee4e60ee592c5606c66f04e6364cf1d9bb07c", "title": "A superconducting quantum processor architecture design method for improving performance and reducing frequency collisions"}, {"paperId": "8ced1f4e99f322ff2900dc665be95e2be7c6b3bc", "title": "Lightning Talk: Scaling Up Quantum Compilation – Challenges and Opportunities"}, {"paperId": "e0d57fd63597d35cff1b43d783fba90ff6d73a30", "title": "A Superconducting Quantum Chip Architecture Design Method for Quantum Programs"}, {"paperId": "cb6c37439a6c8703301462a654d1c28c701678c7", "title": "A Framework for the Design and Realization of Alternative Superconducting Quantum Architectures"}, {"paperId": "47faf6e5608c26b640d1af92268cca1c842f6578", "title": "Qubit-Reuse Compilation with Mid-Circuit Measurement and Reset"}]}
