{"paperId": "2a69573c6906dfbf22526e68d240453d6e7d37e1", "publicationVenue": {"id": "37555ef6-5b69-4ae8-a9b3-f2052c7552a5", "name": "Advances in Multimedia", "alternate_names": ["Adv Multimedia"], "issn": "1687-5680", "url": "https://www.hindawi.com/journals/am/"}, "title": "Design of Cross-Source Education Information Classification Model Based on Cloud Computing Technology", "abstract": "Traditional classification algorithms can be well applied to limited data sets, but the application effect of uncertain data sets was poor. Therefore, this paper proposed a cross-source education information classification model based on cloud computing technology, which aimed to provide support for education information services in the cloud computing environment. Firstly, based on the analysis of the structure and function of the cloud computing platform, this paper expounded the cloud computing service mode and its deployment mode and gave a multisource information processing method based on the cloud computing center combined with the characteristics of information distribution in the cloud computing environment. Secondly, by analyzing the types of educational information resources, this paper summarized the feature extraction of educational information using data mining technology and gave the classification method of educational information based on text features. Finally, a cross-source education information classification model in the cloud computing environment was designed. The experimental comparison showed that the method proposed in this paper can effectively classify the multisource education information under the cloud computing platform. Compared with other traditional classification models, this model not only had higher classification accuracy but also can achieve better classification efficiency. The classification model proposed in this paper can provide a reference for the classification of other information resources in the cloud computing environment.", "venue": "Advances in Multimedia", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-09", "journal": {"name": "Advances in Multimedia"}, "authors": [{"authorId": "2153890825", "name": "Zhimei Lv"}], "citations": []}
