{"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art", "abstract": "Data stream processing (DSP) has emerged over the years as the reference paradigm for the analysis of continuous and fast information flows, which often have to be processed with low-latency requirements to extract insights and knowledge from raw data. Dealing with unbounded dataflows, DSP applications are typically long running and thus, likely experience varying workloads and working conditions over time. To keep a consistent service level in face of such variability, a lot of effort has been spent studying strategies for runtime adaptation of DSP systems and applications. In this survey, we review the most relevant approaches from the literature, presenting a taxonomy to characterize the state of the art along several key dimensions. Our analysis allows us to identify current research trends as well as open challenges that will motivate further investigations in this field.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-10", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 36", "volume": "54"}, "authors": [{"authorId": "1706698", "name": "V. Cardellini"}, {"authorId": "48682252", "name": "Francesco Lo Presti"}, {"authorId": "35126270", "name": "Matteo Nardelli"}, {"authorId": "35590602", "name": "G. Russo"}], "citations": [{"paperId": "f4872af13295b45b5c6eb30d59b9db22246b9359", "title": "Rule based complex event processing for IoT applications: Review, classification and challenges"}, {"paperId": "5fcfdd3f3ab766ce53d5f51212c7db0f0ef3a4df", "title": "Practical Storage-Compute Elasticity for Stream Data Processing"}, {"paperId": "b05fe8fad01809b505783c90279d1da1ea3735e0", "title": "Towards Fine Grain Resource Management for Stream Processing"}, {"paperId": "de1b2d354e0f26dc1aa2c630563bc6f7bdbee706", "title": "SPinDP: A High-Speed Distributed Processing Platform for Sampling and Filtering Data Streams"}, {"paperId": "115c8b085322f2ca11c0802a95bf1c219f676013", "title": "Proactive Streaming Analytics at Scale: A Journey from the State-of-the-art to a Production Platform"}, {"paperId": "b0b935e6b3e53953726cd999672f1bc9d59f5b1b", "title": "A Historical Context for Data Streams"}, {"paperId": "9caf5e110d7c2013051f2d9c8547275da5c682e7", "title": "StreamBed: capacity planning for stream processing"}, {"paperId": "d52ba3b8b67bb05a9fdb1def113a8d7a75546b10", "title": "ContTune: Continuous Tuning by Conservative Bayesian Optimization for Distributed Stream Data Processing Systems"}, {"paperId": "3fc68135faa06cd7db5fd4e0ae99253e1e94db6d", "title": "TransScale: Combined-Approach Elasticity for Stream Processing in Fog Environments"}, {"paperId": "96d13084102077d3c3d3798f854d5a43aea8fd86", "title": "A Hardware-Conscious Stateful Stream Compression Framework for IoT Applications (Vision)"}, {"paperId": "98e4b55a8043d845e6678b9a6b701ff6c03402bc", "title": "AQuA-CEP: Adaptive Quality-Aware Complex Event Processing in the Internet of Things"}, {"paperId": "442cce72a508316afb174365d9ad7dc57fe30052", "title": "On Improving Streaming System Autoscaler Behaviour using Windowing and Weighting Methods"}, {"paperId": "6e6044684ba7a26eb913177953e71de312374eb7", "title": "Hierarchical Auto-scaling Policies for Data Stream Processing on Heterogeneous Resources"}, {"paperId": "1f2811da3079c22b635eb4e8d25781f7df3f4b55", "title": "Research on Industry Data Analytics on Processing Procedure of Named 3-4-8-2 Components Combination for the Application Identification in New Chain Convenience Store"}, {"paperId": "f13822098a392676416a934cb940f13b0d52a1fb", "title": "Region-based Sub-Snapshot (RegSnap): Enhanced Fault Tolerance in Distributed Stream Processing with Partial Snapshot"}, {"paperId": "c67057aac7520175d5f5796c0881420d2cdef01e", "title": "An adaptive non-migrating load-balanced distributed stream window join system"}, {"paperId": "8d5f6cd80b30aae79e0670edcfe5b196bc85f733", "title": "Towards adaptive quality-aware Complex Event Processing in the Internet of Things"}, {"paperId": "800e574b3c0b4a75094f526dee121238d9f4cb1b", "title": "Real-time analysis of market data leveraging Apache Flink"}, {"paperId": "4b9048ee0a33ffa37d73a2507a554e4e6543fe6a", "title": "Scheduling Continuous Operators for IoT edge Analytics with Time Constraints"}]}
