{"paperId": "2a740c4760b0ed1cb9ec6bf72b0ea7d610d13c44", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Security and Privacy Analysis of Vinoth et al.'s Authenticated Key Agreement Scheme for Industrial IoT", "abstract": "Vinoth et al. proposed an authenticated key agreement scheme for industrial IoT (Internet of Things) applications. Vinoth et al.’s scheme aimed to protect the remote sensing data of industrial IoT devices under hostile environments. The scheme is interesting because the authorized user is allowed simultaneously to access the multiple IoT sensing devices. Therefore, we carefully analyzed the security and privacy implications of Vinoth et al.’s scheme. Our findings are summarized as follows. One, Vinoth et al.’s scheme failed to defeat user impersonation attacks. Second, Vinoth et al.’s scheme did not prevent IoT sensing device impersonation attacks. Third, Vinoth et al.’s scheme suffered from replay attacks. Fourth, Vinoth et al.’s scheme was vulnerable to desynchronization attacks. Fifth, Vinoth et al.’s scheme could not maintain user privacy. As a case study, our analysis results enlighten researchers and engineers on the design of robust and efficient authenticated key agreement schemes for IoT applications.", "venue": "Symmetry", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-16", "journal": {"name": "Symmetry", "pages": "1952", "volume": "13"}, "authors": [{"authorId": "143751814", "name": "Da-Zhi Sun"}], "citations": [{"paperId": "b5cb8d5aec0b8b21d8e3591be9cf9932085a2916", "title": "Key Distribution and Authentication Protocols in Wireless Sensor Networks: A Survey"}, {"paperId": "0b9655079595ece729fdf7cbb1aae7074a8da86c", "title": "Combining CoAl-LDH nanosheets with Bi19S27Br3 nanorods to construct a Z-scheme heterojunction for enhancing CO2 photoreduction"}, {"paperId": "43106471cd3bc0cf72ae9a73110ad186859247c6", "title": "Practical Three-Factor Authentication Protocol Based on Elliptic Curve Cryptography for Industrial Internet of Things"}, {"paperId": "fbbf428cfc64d72879e95e2b4f0b06b0bfd52fdb", "title": "Authenticated Distributed Group Key Agreement Protocol Using Elliptic Curve Secret Sharing Scheme"}]}
