{"paperId": "2a790f2c5b05e9b91cd3baa75e8ef4c7a5933a0e", "publicationVenue": null, "title": "Probabilistic Hesitant Fuzzy Methods for Prioritizing Distributed Stream Processing Frameworks for IoT Applications", "abstract": "Distributed stream processing frameworks (DSPFs) are the vital engine, which can handle real-time data processing and analytics for IoT applications. How to prioritize DSPFs and select the most suitable one for special IoT applications is an open issue. To help developers of IoT applications to solve this complex issue, a novel probabilistic hesitant fuzzy multicriteria decision making (MCDM) model is put forward in this paper. To characterize the requirements for large-scale IoT data stream processing, a novel evaluation criteria system including qualitative and quantitative criteria is established. To accurately model the collective opinions from skilled developers and consider their psychological distance, the definition of probabilistic hesitant fuzzy sets (PHFSs) is used. To derive the importance degrees of criteria, a novel probabilistic hesitant fuzzy best-worst (PHFBW) method is proposed based on the score value. To prioritize the DSPFs and choose the most suitable one, a novel probabilistic hesitant fuzzy MULTIMOORA method is put forward. Finally, a practical case composed of four Apache stream processing frameworks, namely, Storm, Flink, Spark, and Samza, is studied. The obtained results indicate that throughput, latency, and reliability are considered to be the three most important criteria, and Flink is the most suitable stream framework.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-01-11", "journal": {"name": "Mathematical Problems in Engineering", "pages": "1-12", "volume": "2021"}, "authors": [{"authorId": "2108651159", "name": "Zhimin Lin"}, {"authorId": "117129310", "name": "Chao Huang"}, {"authorId": "1388825335", "name": "Mingwei Lin"}], "citations": [{"paperId": "7d21519539427d2f39069b14879569f0e0f42545", "title": "An integrated group decision making framework for business performance evaluation of performing arts enterprises with probabilistic hesitant fuzzy IDOCRIW-MOOSRA method"}, {"paperId": "24dda2c1cf0e92e73769cae7628ff686a1349f81", "title": "Retracted: Probabilistic Hesitant Fuzzy Methods for Prioritizing Distributed Stream Processing Frameworks for IoT Applications"}, {"paperId": "9d65a06b59a9ba226b83b31bf911ab9cd57479c9", "title": "Application of MADM methods in Industry 4.0: A literature review"}, {"paperId": "84617f481cc1a3ebf5f4634fbce8922a52f83865", "title": "Hybrid Algorithm for Resource Aware Predictive Scheduling: A case-study to Human Activity Recognition"}, {"paperId": "9be11a3c62a198826390631668df3136e635da75", "title": "TOPSIS methods for probabilistic hesitant fuzzy multiple attribute group decision-making and application to performance evaluation of public charging service quality"}, {"paperId": "fcfb1b553d99fcdd847961317875aca8f31a8987", "title": "Interactive group decision making method based on probabilistic hesitant Pythagorean fuzzy information representation"}, {"paperId": "8a904062daa018e24c45810a10f8496d29cb1433", "title": "Probabilistic Hesitant Fuzzy Taxonomy Method Based on Best–Worst-Method (BWM) and Indifference Threshold-Based Attribute Ratio Analysis (ITARA) for Multi-attributes Decision-Making"}, {"paperId": "1872265f0c853253011765cc37c181172772c3eb", "title": "Evaluating the Performance of Oil and Gas Companies by an Extended Balanced Scorecard and the Hesitant Fuzzy Best-Worst Method"}, {"paperId": "e181a57b86605e21b9f75f6ddbd4fb56913e415f", "title": "Exploring destination image through online reviews: an augmented mining model using latent Dirichlet allocation combined with probabilistic hesitant fuzzy algorithm"}, {"paperId": "8c30350fc99f9421f00cb52a9e67d6753e055785", "title": "A combined hesitant fuzzy MCDM approach for supply chain analytics tool evaluation"}, {"paperId": "5045a179b394d53cb14a2f03693ca08ef6d43e2d", "title": "Generalized Dombi-based probabilistic hesitant fuzzy consensus reaching model for supplier selection under healthcare supply chain framework"}, {"paperId": "4e08c0a83d65c2e6716d9013b9b9d9c11d5fdb43", "title": "TOPSIS Methods for Probabilistic Hesitant Fuzzy MAGDM and Application to Performance Evaluation of Public Charging Service Quality"}]}
