{"paperId": "2a82dcb9dcc96adb7bc592b52707728e86071d33", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "On-Device Intelligence for Malfunction Detection of Water Pump Equipment in Agricultural Premises: Feasibility and Experimentation", "abstract": "The digital transformation of agriculture is a promising necessity for tackling the increasing nutritional needs on Earth and the degradation of natural resources. Toward this direction, the availability of innovative electronic components and of the accompanying software programs can be exploited to detect malfunctions in typical agricultural equipment, such as water pumps, thereby preventing potential failures and water and economic losses. In this context, this article highlights the steps for adding intelligence to sensors installed on pumps in order to intercept and deliver malfunction alerts, based on cheap in situ microcontrollers, sensors, and radios and easy-to-use software tools. This involves efficient data gathering, neural network model training, generation, optimization, and execution procedures, which are further facilitated by the deployment of an experimental platform for generating diverse disturbances of the water pump operation. The best-performing variant of the malfunction detection model can achieve an accuracy rate of about 93% based on the vibration data. The system being implemented follows the on-device intelligence approach that decentralizes processing and networking tasks, thereby aiming to simplify the installation process and reduce the overall costs. In addition to highlighting the necessary implementation variants and details, a characteristic set of evaluation results is also presented, as well as directions for future exploitation.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2125725", "name": "D. Loukatos"}, {"authorId": "2050423958", "name": "M. Kondoyanni"}, {"authorId": "2201215425", "name": "Gerasimos Alexopoulos"}, {"authorId": "26351340", "name": "Chrysanthos Maraveas"}, {"authorId": "3006388", "name": "K. Arvanitis"}], "citations": [{"paperId": "e525158a31416a32c054eb9b0a4606447259057a", "title": "Design of a control system for rotating equipment"}, {"paperId": "e2ba8c4dc9910a1ce20ddb18186db1b0a80f2c24", "title": "Energy Usage Forecasting Model Based on Long Short-Term Memory (LSTM) and eXplainable Artificial Intelligence (XAI)"}, {"paperId": "ea9864f8986286b3cbe16a75cc37005d029ab113", "title": "Forecasting Air Quality in Tripoli: An Evaluation of Deep Learning Models for Hourly PM2.5 Surface Mass Concentrations"}, {"paperId": "2fae37625f983e303003d0e81dac4a560bd7da92", "title": "Unmanned Aerial Vehicle-based Applications in Smart Farming: A Systematic Review"}]}
