{"paperId": "2a894353f7327e8a23cc9edd18a43deb2908ee9d", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Systematic Review of Large Language Models for Patient Care: Current Applications and Challenges", "abstract": "The introduction of large language models (LLMs) into clinical practice promises to improve patient education and empowerment, thereby personalizing medical care and broadening access to medical knowledge. Despite the popularity of LLMs, there is a significant gap in systematized information on their use in patient care. Therefore, this systematic review aims to synthesize current applications and limitations of LLMs in patient care using a data-driven convergent synthesis approach. We searched 5 databases for qualitative, quantitative, and mixed methods articles on LLMs in patient care published between 2022 and 2023. From 4,349 initial records, 89 studies across 29 medical specialties were included, primarily examining models based on the GPT-3.5 (53.2%, n=66 of 124 different LLMs examined per study) and GPT-4 (26.6%, n=33/124) architectures in medical question answering, followed by patient information generation, including medical text summarization or translation, and clinical documentation. Our analysis delineates two primary domains of LLM limitations: design and output. Design limitations included 6 second-order and 12 third-order codes, such as lack of medical domain optimization, data transparency, and accessibility issues, while output limitations included 9 second-order and 32 third-order codes, for example, non-reproducibility, non-comprehensiveness, incorrectness, unsafety, and bias. In conclusion, this study is the first review to systematically map LLM applications and limitations in patient care, providing a foundational framework and taxonomy for their implementation and evaluation in healthcare settings.", "venue": "medRxiv", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2024-03-05", "journal": null, "authors": [{"authorId": "2265313256", "name": "Felix Busch"}, {"authorId": "2243214477", "name": "Lena Hoffmann"}, {"authorId": "2268729478", "name": "Christopher Rueger"}, {"authorId": "2289898829", "name": "Elon HC van Dijk"}, {"authorId": "2289903277", "name": "Rawen Kader"}, {"authorId": "2289903275", "name": "Esteban Ortiz-Prado"}, {"authorId": "2243298766", "name": "Marcus R. Makowski"}, {"authorId": "2273812863", "name": "Luca Saba"}, {"authorId": "5353380", "name": "M. Hadamitzky"}, {"authorId": "3955759", "name": "Jakob Nikolas Kather"}, {"authorId": "2269642468", "name": "Daniel Truhn"}, {"authorId": "2289901320", "name": "Renato Cuocolo"}, {"authorId": "2243310753", "name": "Lisa C. Adams"}, {"authorId": "28908056", "name": "K. Bressem"}], "citations": []}
