{"paperId": "2a8931af1512a7298a6cc53b09e574a1495eb40f", "publicationVenue": {"id": "47ee480e-9ef9-480e-86e1-bd7187dc7ad4", "name": "International Journal of Engineering and Advanced Technology", "type": "journal", "alternate_names": ["Int J Eng Adv Technol"], "issn": "2249-8958", "url": "https://www.ijeat.org/"}, "title": "Global Warming Prediction in India using Machine Learning", "abstract": "Long term global warming prediction can be of major importance in various sectors like climate related studies, agricultural, energy, medical and many more. This paper evaluates the performance of several Machine Learning algorithm (Linear Regression, Multi-Regression tree, Support Vector Regression (SVR), lasso) in problem of annual global warming prediction, from previous measured values over India. The first challenge dwells on creating a reliable, efficient statistical reliable data model on large data set and accurately capture relationship between average annual temperature and potential factors such as concentration of carbon dioxide, methane, nitrous oxide. The data is predicted and forecasted by linear regression because it is obtaining the highest accuracy for greenhouse gases and temperature among all the technologies which can be used. It was also found that CO2 is the plays the role of major contributor temperature change, followed by CH4, then by N20. After seeing the analysed and predicted data of the greenhouse gases and temperature, the global warming can be reduced comparatively within few years. The reduction of global temperature can help the whole world because not only human but also different animals are suffering from the global temperature.", "venue": "International Journal of Engineering and Advanced Technology", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-10-30", "journal": {"name": "International Journal of Engineering and Advanced Technology"}, "authors": [{"authorId": "89230175", "name": "D. Hema"}, {"authorId": "1855533034", "name": "A. Pal"}, {"authorId": "2022824687", "name": "Vineet Loyer"}, {"authorId": "2138914054", "name": "Rajeev Gaurav"}], "citations": [{"paperId": "370c224ae3abc2309b3b67dac3b8a196d95530a5", "title": "Exploring Trends in Global Temperature: A Data Analysis Approach"}]}
