{"paperId": "2a8e9e2d1d3c2a4fe01bafe2f250312c6001ad93", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Political Discussion is Abundant in Non-political Subreddits (and Less Toxic)", "abstract": "Research on online political communication has primarily focused on content in explicitly political spaces. In this work, we set out to determine the amount of political talk missed using this approach. Focusing on Reddit, we estimate that nearly half of all political talk takes place in subreddits that host political content less than 25% of the time. In other words, cumulatively, political talk in non-political spaces is abundant. We further examine the nature of political talk and show that political conversations are less toxic in non-political subreddits. Indeed, the average toxicity of political comments replying to a out-partisan in non-political subreddits is less than even the toxicity of co-partisan replies in explicitly political subreddits.", "venue": "International Conference on Web and Social Media", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-19", "journal": {"pages": "525-536"}, "authors": [{"authorId": "2116525", "name": "Ashwin Rajadesingan"}, {"authorId": "1759771", "name": "Ceren Budak"}, {"authorId": "144741762", "name": "P. Resnick"}], "citations": [{"paperId": "3b7bea22a6f19e99ca1943aba268bffd57498677", "title": "The growing partisan politicization of non-political online spaces: A mixed-method analysis of news app reviews on Google Play between 2009 and 2022"}, {"paperId": "61bb41c5cb3c0da6b69221b3b2ff6ec389e3775a", "title": "Individual drivers of toxicity in radical right-wing populist legislative campaigns"}, {"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "800c6028664084c578614dd709159360bbed8a8b", "title": "Calibrate-Extrapolate: Rethinking Prevalence Estimation with Black Box Classifiers"}, {"paperId": "7d1df260ebd470f4ee246d91a64f0b95c7871e42", "title": "Topic Shifts as a Proxy for Assessing Politicization in Social Media"}, {"paperId": "6acca2882b906bcf58d334e331bc93f2da7e8ba7", "title": "Moral consensus and divergence in partisan language use"}, {"paperId": "5fed378c0ea7d058aaabb751e527f0148b952856", "title": "Polarized Speech on Online Platforms"}, {"paperId": "bbf9d648a2c284cf30651e65cb62b2686ff405a6", "title": "Twits, Toxic Tweets, and Tribal Tendencies: Trends in Politically Polarized Posts on Twitter"}, {"paperId": "349a4af733527ef679eb7f5e687a127c092326e0", "title": "The tension between connective action and platformisation: Disconnected action in the GameStop short squeeze"}, {"paperId": "452edcee44036eee178e4450680c16e4da36f412", "title": "Wisdom of Two Crowds: Misinformation Moderation on Reddit and How to Improve this Process---A Case Study of COVID-19"}, {"paperId": "7fe9b3ecf7fef1af8c0ce83f3d6895d0e018e52c", "title": "Understanding People’s Needs in Viewing Diverse Social Opinions about Controversial Topics"}, {"paperId": "d402e3c6924e86ac3e73ddd5e3c680ced1276b9f", "title": "Sub-Standards and Mal-Practices: Misinformation's Role in Insular, Polarized, and Toxic Interactions"}, {"paperId": "7f7956ccfc583a13b31f3d628af5c00a280ab14c", "title": "Just Another Day on Twitter: A Complete 24 Hours of Twitter Data"}, {"paperId": "70c119e0622ece60999295b6f470da5683a20178", "title": "Silenced on social media: the gatekeeping functions of shadowbans in the American Twitterverse"}, {"paperId": "3d10ee58514a041ec45a81e000d1293914cb9e93", "title": "Non-Polar Opposites: Analyzing the Relationship Between Echo Chambers and Hostile Intergroup Interactions on Reddit"}, {"paperId": "285aa290710918c19bf3fd5b6de310e7eacbecb9", "title": "Exporting Geography Into A Virtual Landscape: A Global Pandemic Locally Discussed"}, {"paperId": "8728527cd05a0c8061e4ad4b3aa23fea2f638c47", "title": "Modeling the Influence of Nonpolitical Content on Social Media Political Communication"}, {"paperId": "691bf1d8f7ee062f370ce2ced217255ff08ff5c3", "title": "On the Relation Between Opinion Change and Information Consumption on Reddit"}, {"paperId": "6bb9247c2890658e6b81fa27c55641ee861a951c", "title": "Adherence to Misinformation on Social Media Through Socio-Cognitive and Group-Based Processes"}, {"paperId": "ec144744ade08556b6bed7ff9f52753080bc4b80", "title": "\"Rough Day ... Need a Hug\": Learning Challenges and Experiences of the Alzheimer's Disease and Related Dementia Caregivers on Reddit"}, {"paperId": "4f9dda2b7f7526108f5c9695e88a63836a085fa4", "title": "Understanding the Use of e-Prints on Reddit and 4chan’s Politically Incorrect Board"}, {"paperId": "288f55879cc77a1317aba73a51651405c7c69d24", "title": "Over-Time Trends in Incivility on Social Media: Evidence From Political, Non-Political, and Mixed Sub-Reddits Over Eleven Years"}, {"paperId": "604b3e4517709d035e0c2cff8295a5fb297a12c7", "title": "'Walking Into a Fire Hoping You Don't Catch': Strategies and Designs to Facilitate Cross-Partisan Online Discussions"}, {"paperId": "106468b5de8ef18a4612962d5a3b3e19272900fa", "title": "Classification without (Proper) Representation: Political Heterogeneity in Social Media and Its Implications for Classification and Behavioral Analysis"}, {"paperId": "a64b0bbedbc043d0df9e92ae048acab986563ac9", "title": "The Polarizing Impact of Continuous Presence on Users' Behavior"}, {"paperId": "ca5850fc6ef6abba0b3f7d79e309d169a457d2ad", "title": "\"We won't even challenge their lefty academic definition of racist: \" Understanding the Use of e-Prints on Reddit and 4chan"}]}
