{"paperId": "2a97c84d1ba7caca76f594438a3c95fd39a95953", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Dynamic Models Supporting Personalised Chronic Disease Management through Healthcare Sensors with Interactive Process Mining", "abstract": "Rich streams of continuous data are available through Smart Sensors representing a unique opportunity to develop and analyse risk models in healthcare and extract knowledge from data. There is a niche for developing new algorithms, and visualisation and decision support tools to assist health professionals in chronic disease management incorporating data generated through smart sensors in a more precise and personalised manner. However, current understanding of risk models relies on static snapshots of health variables or measures, rather than ongoing and dynamic feedback loops of behaviour, considering changes and different states of patients and diseases. The rationale of this work is to introduce a new method for discovering dynamic risk models for chronic diseases, based on patients’ dynamic behaviour provided by health sensors, using Process Mining techniques. Results show the viability of this method, three dynamic models have been discovered for the chronic diseases hypertension, obesity, and diabetes, based on the dynamic behaviour of metabolic risk factors associated. This information would support health professionals to translate a one-fits-all current approach to treatments and care, to a personalised medicine strategy, that fits treatments built on patients’ unique behaviour thanks to dynamic risk modelling taking advantage of the amount data generated by smart sensors.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1417632409", "name": "Zoe Valero-Ramon"}, {"authorId": "1403054624", "name": "C. Fernández-Llatas"}, {"authorId": "2394825", "name": "B. Valdivieso"}, {"authorId": "2598770", "name": "V. Traver"}], "citations": [{"paperId": "6098e82bdd90465d554dde75fb3fa55936f56d42", "title": "Towards Action-State Process Model Discovery"}, {"paperId": "fdbd357f29221a49aa839e18482c647acca79d6c", "title": "Process mining and data mining applications in the domain of chronic diseases: A systematic review"}, {"paperId": "abcb196eb5be669bd3337766e0d0011e958281eb", "title": "Optimization model for healthcare processes using Process Mining"}, {"paperId": "fa648093f89c183b85493830eab8bab1e2006c5e", "title": "Integrating ISA and Part-of Domain Knowledge into Process Model Discovery"}, {"paperId": "b4a873678b1b4632d22cadfe39b54df58b370b53", "title": "A review on smart sensing devices in health surveillance"}, {"paperId": "3bd2d49a44cf3dd15261ce855dc180b0b4202543", "title": "Exploring Values in Museum Artifacts in the SPICE project: a Preliminary Study"}, {"paperId": "8be00c8b52779789e50a3996b3ef4ab6c678ef32", "title": "Dynamic interaction nursing intervention on functional rehabilitation and self-care ability of patients after aneurysm surgery"}, {"paperId": "f2be3b5785dab92c4b06db935413e4b0e54104fa", "title": "Process mining for healthcare: Characteristics and challenges"}, {"paperId": "25ff9fc2cb4abcd5f256f3a10c12b4b1743c5f73", "title": "Process mining applications in the healthcare domain: A comprehensive review"}]}
