{"paperId": "2aa648692073fa2ad68155c8324c85b592cd24c3", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Study on Road Network Vulnerability Considering the Risk of Landslide Geological Disasters in China's Tibet", "abstract": "Road traffic is occasionally blocked by landslide geological disasters in remote mountainous areas, causing obstruction to economic society and national defense construction. It is vital to conduct landslide geological disaster risk assessment and vulnerability research on the road network. Based on landslide geological disaster risk on the road network, this study analyzed the potential effects of the main environmental elements. Due to the lack of previous research works, this study proposed an effective, rational, and understandable multicriteria heuristic analytical hierarchy process model, fuzzy comprehensive evaluation, and frequency ratio-interactive fuzzy stack analysis for vulnerability assessment of road networks in large and complex networks. Based on the comprehensive use of geographic information technology, the road network vulnerability of Tibet in China was evaluated by introducing slope, topographic relief, normalized difference vegetation index (NDVI), annual mean precipitation, distance from river drainage, glaciers and snow, habitation, seismic center and geological fault zone, and soil erosion intensity. According to the findings of the study, the three-stage framework proposed in this study can provide correct inferences and explanations for the potential phenomena of landslide geological disasters; the geological disaster risk are unevenly distributed in the study area; the distribution of the road network vulnerability in China’s Tibet significantly differs among different cities; the high-vulnerability section presents significant regional characteristics, which overlap with the area with a high risk of landslide geological disasters, and its distribution is mostly located in traffic arteries, link aggregations, and relatively frequent human activity.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-28", "journal": {"name": "Remote. Sens.", "pages": "4221", "volume": "15"}, "authors": [{"authorId": "2221148176", "name": "Yunchang Yao"}, {"authorId": "2150208523", "name": "Liang Cheng"}, {"authorId": "2108194875", "name": "Song Chen"}, {"authorId": "47666606", "name": "Hui Chen"}, {"authorId": "2107978003", "name": "Mingfei Chen"}, {"authorId": "2120048858", "name": "Ning Li"}, {"authorId": "2235834508", "name": "Zeming Li"}, {"authorId": "2159811918", "name": "Shengkun Dongye"}, {"authorId": "2236331185", "name": "Yifan Gu"}, {"authorId": "2236001743", "name": "Junfan Yi"}], "citations": [{"paperId": "2e098a37be86ffaffec3598727a22ec71ac72084", "title": "A Multi-Dimensional Feature Fusion Recognition Method for Space Infrared Dim Targets Based on Fuzzy Comprehensive with Spatio-Temporal Correlation"}, {"paperId": "6c2306ea4aa022076656067e0b80f820abe5b83b", "title": "Spatial vulnerability assessment of rural settlements in hilly areas using BP neural network algorithm"}]}
