{"paperId": "2ab24004c75d8a10a5367b9e6a2311e75e4c62b9", "publicationVenue": null, "title": "Improved IoT Device Security Using Hybrid Algorithm with Optimal values", "abstract": "There are many solicitations technologically advanced through Internet of things which achieve one of the growing sectors, the evolution of unknown assaults has been stopped with an improvement of cyber security today. The IoT infrastructure is currently facing a significant problem as a result of an increase in cyberattack trends. The physical environment of the digital world is evolving into one as a result of recent localized attacks on traditional internal networks and the ongoing security threat. Yet, the deployment of dispersed security mechanisms due to IoT device resource constraints is the fundamental issue with physical IoTs connections. IoT devices must be able to automatically check and update their firmware in order to avoid vulnerabilities like buffer overflows. Currently, most intrusion detection techniques rely on single point detection and maintenance, which makes it difficult to pinpoint the attacking strategy when concealed at tacks are frequent. in order to create intrusion detection models, the well-known detection technology recently used traditional Machine Learning (ML) methods, however these algorithms suffer from slow detection rates. Yet, one of the cutting-edge technologies that automatically extracts behaviors from data is deep learning. Thus, compared to typical ML technologies, intrusion detection accuracy is not very good. As a result, the study presented an enhanced Elliptic Curve Cryptography-Long Short-Term Memory (EECC-LSTM) model hybrid technique, in which enhanced ECC functions across a isolated network and is constructed.", "venue": "2023 International Conference on Advances in Computing, Communication and Applied Informatics (ACCAI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-25", "journal": {"name": "2023 International Conference on Advances in Computing, Communication and Applied Informatics (ACCAI)", "pages": "1-6"}, "authors": [{"authorId": "2055869418", "name": "R. Devi"}, {"authorId": "2131377005", "name": "A. Arunachalam"}], "citations": [{"paperId": "b8fe83c55a2692ea8661964be9c7a9e89b8569ce", "title": "Content"}]}
