{"paperId": "2ac0c31282a20a86491308ae889df5adde75e31f", "publicationVenue": {"id": "acdf09ed-68cc-4c8a-b2ab-3c6c4873cc9e", "name": "Therapeutic Advances in Gastroenterology", "type": "journal", "alternate_names": ["Ther Adv Gastroenterol"], "issn": "1756-283X", "url": "https://journals.sagepub.com/home/tag", "alternate_urls": ["http://tag.sagepub.com/"]}, "title": "Real-world outcomes of 54-week vedolizumab therapy and response durability after treatment discontinuation in ulcerative colitis: results from a multicenter prospective POLONEZ study", "abstract": "Background: Vedolizumab is a gut-selective anti-lymphocyte trafficking agent used to treat ulcerative colitis (UC) and Crohn’s disease. Objectives: We aimed to evaluate the effectiveness, safety, and durability of the therapeutic effect of vedolizumab after treatment discontinuation in a real-world cohort of patients with UC treated in Poland. Design: This was a multicenter, prospective study involving patients with moderate to severely active UC from 12 centers in Poland who qualified for reimbursed treatment with vedolizumab between February and November 2019. Methods: The primary endpoints were clinical response (⩾2-point improvement from baseline on partial Mayo score) and clinical remission (partial Mayo score 0–1), including steroid-free remission, at week 54. Other outcomes included response durability at 26 weeks after treatment discontinuation, identification of predictors of response and remission, and safety assessment. Results: In all, 100 patients with UC were enrolled (55 biologic naïve and 45 biologic exposed). At baseline, 68% of patients were on corticosteroids and 45% on immunomodulators. Clinical response was observed in 62% of patients, clinical remission in 50%, and steroid-free remission in 42.6% at week 54. Within 26 weeks after treatment discontinuation, 37% of patients who maintained response by week 54 relapsed. The decreased number of liquid stools and rectal bleeding and endoscopic response at week 14 were predictive factors for response at week 54. Time from diagnosis ranging 2–5 years, decreased stool frequency, and non-concomitant use of corticosteroids at baseline and at week 14 were predictive factors for remission at week 54. Partial Mayo score < 3 with no subscale score > 1 at week 54 was a predictive factor for durable response after treatment discontinuation. The rate of serious adverse events related to treatment was 3.63 per 100 patient-years. Conclusion: Vedolizumab is effective and safe in UC treatment in Polish patients. However, the relapse rate after the treatment cessation was high. Registration: ENCePP (EUPAS34119).", "venue": "Therapeutic Advances in Gastroenterology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Therapeutic Advances in Gastroenterology", "volume": "16"}, "authors": [{"authorId": "35174997", "name": "P. Eder"}, {"authorId": "7496392", "name": "M. Kłopocka"}, {"authorId": "1398440846", "name": "H. Cichoż-Lach"}, {"authorId": "1401047906", "name": "R. Talar-Wojnarowska"}, {"authorId": "1435343595", "name": "M. Kopertowska-Majchrzak"}, {"authorId": "38508944", "name": "A. Michalak"}, {"authorId": "40406957", "name": "R. Filip"}, {"authorId": "40382528", "name": "K. Waszak"}, {"authorId": "1402545227", "name": "K. Stawczyk-Eder"}, {"authorId": "37821145", "name": "Maria Janiak"}, {"authorId": "1486497550", "name": "Krzysztof Skrobot"}, {"authorId": "48919831", "name": "A. Liebert"}, {"authorId": "2891393", "name": "H. Zatorski"}, {"authorId": "1421856222", "name": "A. Solarska-Półchłopek"}, {"authorId": "2125448866", "name": "M. Krogulecki"}, {"authorId": "114945520", "name": "A. Pękala"}, {"authorId": "4288393", "name": "E. Poniewierka"}, {"authorId": "14933213", "name": "I. Smoła"}, {"authorId": "8656488", "name": "Aleksandra Kaczka"}, {"authorId": "2584715", "name": "K. Wojciechowski"}, {"authorId": "2125442192", "name": "S. Drygała"}, {"authorId": "50625783", "name": "E. Zagórowicz"}], "citations": [{"paperId": "46096b19e44fd1993de40b31e2dde4bd70ab814c", "title": "Evolutionary origin and structural ligand mimicry by the inserted domain of alpha-integrin proteins"}, {"paperId": "b563a581bb1d7a99a0309c353887b3501a23d657", "title": "Vedolizumab"}]}
