{"paperId": "2ac35475ccf0a6a89bbd04377a4fe61c175030a4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Meta Ranking: Less Capable Language Models are Capable for Single Response Judgement", "abstract": "Although Large Language Models (LLMs) have demonstrated strong performance on a wide range of tasks, they still face reliability challenges such as hallucination. Previous studies reveal that highly capable LLMs like GPT-4 are effective in judging the reliability of individual responses, while less capable ones are often tuned to evaluate the relative reliability of responses to the same query. To enable less capable LLMs to effectively judge the reliability of individual responses, we propose a novel method named $\\textit{Meta}$ $\\textit{Ranking}$ (MR). Unlike previous methods, which assess the response directly, we achieve the judgement by comparing the target query-response pair with reference query-response pairs. We found its remarkable effectiveness in error detection for LLM responses on reasoning tasks, where less capable LLMs could outperform strong baselines, even without fine-tuning. We further demonstrate that MR can be used to enhance the performance of LLMs in two practical applications: query routing and iterative training data filtering. The former achieves GPT-4-turbo comparable performance with less than half the token consumption, while the latter makes the instruction-tuned LLaMA-7B and Phi-2, a 2.7B model, significantly surpass Alpaca-13B over fewer training samples, underscoring the high potential of our proposed method.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-19", "journal": {"name": "ArXiv", "volume": "abs/2402.12146"}, "authors": [{"authorId": "2117942065", "name": "Zijun Liu"}, {"authorId": "2284687976", "name": "Boqun Kou"}, {"authorId": "2239330639", "name": "Peng Li"}, {"authorId": "2266495259", "name": "Ming Yan"}, {"authorId": "2284726780", "name": "Ji Zhang"}, {"authorId": "2262080010", "name": "Fei Huang"}, {"authorId": "2284726267", "name": "Yang Liu"}], "citations": []}
