{"paperId": "2ad072c6322c303a5a1ce02bf004c6a2485796dc", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "The 4CAT Capture and Analysis Toolkit: A Modular Tool for Transparent and Traceable Social Media Research", "abstract": "This paper introduces the 4CAT Capture and Analysis Toolkit (4CAT), an open-source Web-based research tool that can capture data from a variety of online sources including Twitter, Telegram, Reddit, 4chan, 8kun, BitChute, Douban and Parler, and analyze the data through analytical processors. 4CAT seeks to make robust data capture and analysis available to researchers not familiar with computer programming, without “black-boxing” the implemented research methods. Before outlining the practical use of 4CAT, we discuss three “affordances” that informed its design: modularity, transparency, and traceability. 4CAT is modular because new data sources and analytical processors can be easily added and changed; transparent because it aims to render legible its inner workings; and traceable because of automatic and shareable documentation of intermediate analysis steps. We then show how 4CAT operationalizes these features through a description of its general setup and a short walkthrough. Finally, we discuss how 4CAT strives for an “ethics by design” development philosophy that enables ethically sound data-driven research with it. 4CAT is then positioned as both an answer to and a further call for “tool criticism” in computational social research.", "venue": "Social Science Research Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-31", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "104470945", "name": "S.C.J. Peeters"}, {"authorId": "120414940", "name": "S. Hagen"}], "citations": [{"paperId": "1c61ede7760f3ad3a18863922f829c28f98df175", "title": "Identification of Opinion Leaders in a Telegram Network of Forwarded Messages"}, {"paperId": "3077c8a1938ac028415e73d5e8c213469f31f705", "title": "The Eurabia Conspiracy Theory: Twitter’s Political Influencers, Narratives, and Information Sources"}, {"paperId": "8ec4ca9720bcf013941b1ae35441bdf630775e1c", "title": "Participatory conspiracy culture: Believing, doubting and playing with conspiracy theories on Reddit"}, {"paperId": "4727e7671a5b116c9b3628103ebbe37d3a1f465b", "title": "Propaganda and Manipulation in Mexico: A Programmed, Coordinated and Manipulative “Pink” Campaign"}, {"paperId": "faf1a78325d864f29fa2d825feeeff0e22ae263e", "title": "Social Marketing and the Sustainable Development Goals: Scoping Review (2013–2021)"}, {"paperId": "1239ce470149e9c78e03cd322595c74629ed6d4b", "title": "From disinformation to fact-checking: How Ibero-American fact-checkers on Twitter combat fake news"}, {"paperId": "2f5c0037a7e2f6a4b6bbece1e679e9f4e34eca9a", "title": "A God-Tier LARP? QAnon as Conspiracy Fictioning"}, {"paperId": "a52063092fcb963928fa7a11f3ca5a4c112b16a8", "title": "Based and confused: Tracing the political connotations of a memetic phrase across the web"}, {"paperId": "b0bc1d3e251155568c39d55abe74606e182b5cfb", "title": "Disinformation networks: A quali-quantitative investigation of antagonistic Dutch-speaking Telegram channels"}, {"paperId": "d866afe01090a10d303b4d96b09a8818266aed65", "title": "Online Football-Related Antisemitism in the Context of the COVID-19 Pandemic: A Multi-Method Analysis of the Dutch Twittersphere"}, {"paperId": "7372a421ff239a4dce501137453729a399af9285", "title": "MeVer NetworkX: Network Analysis and Visualization for Tracing Disinformation"}, {"paperId": "8522728296094d23da76f8529c363584c58f48e7", "title": "‘Who is /ourguy/?’: Tracing panoramic memes to study the collectivity of 4chan/pol/"}, {"paperId": "5fae4264fee9bfbd462e6369e11198cfb5420ed5", "title": "News loopholing: Telegram news as portable alternative media"}, {"paperId": "d3620fcea4a53070b2d0a93e93251fa2452b2a9c", "title": "Participatory Conspiracy Culture"}]}
