{"paperId": "2ad9d33bfa4fd192250615e506bfb34842c9444e", "publicationVenue": null, "title": "Elastic Spatial Query Processing in OpenStack Cloud Computing Environment for Time-Constraint Data Analysis", "abstract": "Geospatial big data analysis (GBDA) is extremely significant for time-constraint applications such as disaster response. However, the time-constraint analysis is not yet a trivial task in the cloud computing environment. Spatial query processing (SQP) is typical computation-intensive and indispensable for GBDA, and the spatial range query, join query, and the nearest neighbor query algorithms are not scalable without using MapReduce-liked frameworks. Parallel SQP algorithms (PSQPAs) are trapped in screw-processing, which is a known issue in Geoscience. To satisfy time-constrained GBDA, we propose an elastic SQP approach in this paper. First, Spark is used to implement PSQPAs. Second, Kubernetes-managed Core Operation System (CoreOS) clusters provide self-healing Docker containers for running Spark clusters in the cloud. Spark-based PSQPAs are submitted to Docker containers, where Spark master instances reside. Finally, the horizontal pod auto-scaler (HPA) would scale-out and scale-in Docker containers for supporting on-demand computing resources. Combined with an auto-scaling group of virtual instances, HPA helps to find each of the five nearest neighbors for 46,139,532 query objects from 834,158 spatial data objects in less than 300 s. The experiments conducted on an OpenStack cloud demonstrate that auto-scaling containers can satisfy time-constraint GBDA in clouds.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-03-15", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "84", "volume": "6"}, "authors": [{"authorId": null, "name": "Wei Huang"}, {"authorId": "2145135308", "name": "Wen Zhang"}, {"authorId": "40009007", "name": "Dongying Zhang"}, {"authorId": "144744632", "name": "L. Meng"}], "citations": [{"paperId": "26042d586014dbb48f3460dbc4e9ef6e3ae517d1", "title": "Evaluating operational readiness using chaos engineering simulations on Kubernetes architecture in Big Data"}, {"paperId": "fbac17d000e064875c1826d5bde065c3420b0e22", "title": "High Performance Computing Infrastructure in Technical University Research"}, {"paperId": "68bbff5d365636f0c7f5725690231fe858f01f18", "title": "Serverless Geospatial Data Processing Workflow System Design"}, {"paperId": "92bce1a2c5c64231c5847b75b7d6d2215805660c", "title": "On-the-Fly Fusion of Remotely-Sensed Big Data Using an Elastic Computing Paradigm with a Containerized Spark Engine on Kubernetes"}, {"paperId": "59a37037a289b528282c175b7fe1614024a4a3b3", "title": "A Framework for Cloud-Based Spatially-Explicit Uncertainty and Sensitivity Analysis in Spatial Multi-Criteria Models"}, {"paperId": "f9645841166d58c8eb0cbf39243f45d29667b002", "title": "High-performance docker integration scheme based on OpenStack"}, {"paperId": "1a6a71d38512f60db520646487fa2046f7867203", "title": "BiGeo: A Foundational PaaS Framework for Efficient Storage, Visualization, Management, Analysis, Service, and Migration of Geospatial Big Data - A Case Study of Sichuan Province, China"}, {"paperId": "6f4228710ea65cbe238f64c3d05e0873a86a4078", "title": "Yun: A High-Performance Container Management Service Based on OpenStack"}, {"paperId": "01178fce6900d036df614713e678278bc420dfa3", "title": "Query optimization in cloud environments: challenges, taxonomy, and techniques"}, {"paperId": "fb9052479673f98bb84c4398da25e22d67219865", "title": "Cloud-Based Architectures for Auto-Scalable Web Geoportals towards the Cloudification of the GeoVITe Swiss Academic Geoportal"}]}
