{"paperId": "2ad9bd0b205340eea5987fc8a551f2024fa1e977", "publicationVenue": {"id": "660e7c97-71af-4d68-a87d-536a5ae0c644", "name": "Signal Transduction and Targeted Therapy", "type": "journal", "alternate_names": ["Signal Transduct Target Ther"], "issn": "2059-3635", "url": "http://www.nature.com/sigtrans/"}, "title": "Small molecule metabolites: discovery of biomarkers and therapeutic targets", "abstract": null, "venue": "Signal Transduction and Targeted Therapy", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-03-20", "journal": {"name": "Signal Transduction and Targeted Therapy", "volume": "8"}, "authors": [{"authorId": "143687600", "name": "Shi Qiu"}, {"authorId": "2111027215", "name": "Ying Cai"}, {"authorId": "2162876043", "name": "Hong Yao"}, {"authorId": "2212025197", "name": "Chunsheng Lin"}, {"authorId": "2188443448", "name": "Yiqiang Xie"}, {"authorId": "11237506", "name": "Songqi Tang"}, {"authorId": "2190315270", "name": "Aihua Zhang"}], "citations": [{"paperId": "9c3c39827fbb4a1de1d4aa7dbdeda4ae83abfd07", "title": "Challenges in the Metabolomics-Based Biomarker Validation Pipeline"}, {"paperId": "04593d2268ccd7c26b5296d8342b468ca84ae7b1", "title": "From Data to Cure: A Comprehensive Exploration of Multi-omics Data Analysis for Targeted Therapies."}, {"paperId": "7cd3bc2061fd85ba638a6c8fb738214dad8db99d", "title": "Circulating biomarkers of kidney tumors in TSC (tuberous sclerosis complex) patients"}, {"paperId": "73fec1f2da5964543f4f290dd5352f70665380de", "title": "Gold and Silver Nanoparticles as Biosensors: Characterization of Surface and Changes in the Adsorption of Leucine Dipeptide under the Influence of Substituent Changes"}, {"paperId": "7ffd361459b1b499f9f1b07d99f94f193ca3b283", "title": "Advancements in CHO metabolomics: techniques, current state and evolving methodologies"}, {"paperId": "cb3583e8c8e9062eae5c28b8a134264b4dd6eeeb", "title": "Plasma Metabolic Profiling and Multiclass Diagnostic Model Development for Stable Angina Pectoris and Acute Myocardial Infarction"}, {"paperId": "70beb8a61797f5350a9254aa8c09c6725c8c00e5", "title": "An integrated metabo-lipidomics profile of induced sputum for the identification of novel biomarkers in the differential diagnosis of asthma and COPD"}, {"paperId": "534174b1c3347ee29fde7d1d865779ec4d51b4f8", "title": "Distinguishing benign and malignant thyroid nodules using plasma trimethylamine N-oxide, carnitine, choline and betaine"}, {"paperId": "e79bd3f110d3845e3a6eebba77b92a8ad59618b9", "title": "Super-resolution techniques for biomedical applications and challenges"}, {"paperId": "b90e07746e1d19757bd72d36b09de4a44561cb7a", "title": "NMR and MS reveal characteristic metabolome atlas and optimize esophageal squamous cell carcinoma early detection"}, {"paperId": "5e06c7045d15c06baefa7c019aa8168b598f6893", "title": "Metabolic response of peanut (\n Arachis hypogaea\n L.) to\n Sclerotium rolfsii\n Sacc. in root exudates system"}, {"paperId": "6d27dafe78240682d68bea4b8e46c18fb36deb27", "title": "Plasma metabolites and risk of seven cancers: a two-sample Mendelian randomization study among European descendants"}, {"paperId": "8b8764bab084f8e7171205ab1c8879b7a4d15bd1", "title": "Hydrophilic Interaction Liquid Chromatography–Hydrogen/Deuterium Exchange–Mass Spectrometry (HILIC-HDX-MS) for Untargeted Metabolomics"}, {"paperId": "bc8f10ae598ae66f00d0de151ddc8ec3aaa1f338", "title": "Dairy products authentication with biomarkers: A comprehensive critical review"}, {"paperId": "eca28351c2c39cc301b0753a392650e4592bced8", "title": "Exploiting integrative metabolomics to study host-parasite interactions in Plasmodium infections."}, {"paperId": "c118d8c86b977676abed49827d80ecacea9ae7b5", "title": "Advancing Personalized Medicine by Analytical Means: Selection of Three Metabolites That Allows Discrimination between Glaucoma, Diabetes, and Controls"}, {"paperId": "dbae3aaa1751af6d6861b66f4fe29a7b7c544e0c", "title": "Label-Free Metal-Oxide Transistor Biosensors for Metabolite Detection in Human Saliva."}, {"paperId": "2a143879d5cacb2106e2c6eaa8f76c164d755cae", "title": "Targeted metabolomics in human and animal biofluids and tissues using liquid chromatography coupled with tandem mass spectrometry"}, {"paperId": "d86d8a7c76d5c1e56105805c8f7b61e0f9189738", "title": "Metabolomic Biomarkers for Prognosis in Non-Muscle Invasive Bladder Cancer: A Comprehensive Systematic Review and Meta-Analysis"}, {"paperId": "2599be82252da4a486e115ca2fc1737700ed36a4", "title": "Commercial roadmap of nanobiosensor development"}, {"paperId": "db75c9e1d6bed76d1b72b23e854177a60457ae77", "title": "Metabolomic profiling reveals key metabolites associated with hypertension progression"}, {"paperId": "7350dbf732526cb8e460f9a5249b15bb0af11681", "title": "An IROA Workflow for correction and normalization of ion suppression in mass spectrometry-based metabolomic profiling data"}, {"paperId": "c95f4db4e4cf48512d208bd6630ef9a7dd54dccc", "title": "Biochemical Abnormalities Associated With Sudden Infant Death Syndrome: A Case Report"}, {"paperId": "162cf7b5a423738a99ac5de3ae459c82f2f0231a", "title": "Research advances in the application of metabolomics in exercise science"}, {"paperId": "7b36087844c0e8ad1b08b1ed2bb48c4bd7adb618", "title": "Transcending frontiers in prostate cancer: the role of oncometabolites on epigenetic regulation, CSCs, and tumor microenvironment to identify new therapeutic strategies"}, {"paperId": "1451779e2c56422f789b474f1d80567adfe38b04", "title": "Decoding active compounds and molecular targets of herbal medicine by high-throughput metabolomics technology: A systematic review."}, {"paperId": "108d30df8604b93a09433221292b9a342b42b6ee", "title": "Microbiota Implications in Endocrine-Related Diseases: From Development to Novel Therapeutic Approaches"}, {"paperId": "0d67e1cfd7d42c6f01a9f0a6889771b71f10953e", "title": "Bioreceptors as the key components for electrochemical biosensing in medicine"}, {"paperId": "7058a8ee747cb86fa8ae87b99862cdace8747406", "title": "Insights on Three Dimensional Organoid Studies for Stem Cell Therapy in Regenerative Medicine"}, {"paperId": "65dc0d6760683dc00b5554d961c9f5d56c1b7559", "title": "Evaluating Machine Learning Methods of Analyzing Multiclass Metabolomics"}, {"paperId": "885aec5afe42d3a5acab5a0907c35b835fe2fcbf", "title": "Serum Metabolomics of Retinoblastoma: Assessing the Differential Serum Metabolic Signatures of Unilateral and Bilateral Patients"}, {"paperId": "13d3a8ba5f15fcf119062a82e2f56c53e80c4ae7", "title": "Decoding immune interactions of gut microbiota for understanding the mechanisms of diseases and treatment"}, {"paperId": "80dee4f24193f3715184b9626642a3af8d8cee0d", "title": "Photo-enzyme-polymerized hydrogel platform exhibits photo-switchable redox reversibility for diabetic wound healing"}, {"paperId": "a5a05f2b78fe0b6c1de4b2aabbabbb0dce9a4593", "title": "Development of a single mobile phase for LC-IM-MS-based discovery lipidomics and metabolic phenotyping: Application to methapyrilene hepatotoxicity in the rat."}, {"paperId": "fc79dda7c7485373e03291b035eb5b07df4b90d4", "title": "A machine learning analysis of “big” metabolomics data for classifying depression: model development and validation"}, {"paperId": "71fa8b9ddba61fdbe5deba0996a7966ef8bff55c", "title": "Multinomial machine learning identifies independent biomarkers by integrated metabolic analysis of acute coronary syndrome"}, {"paperId": "703dd856753dbdd0f39b4a64d49a98ab7dc0ccb4", "title": "Metabolomics, the future of biomarkers?"}, {"paperId": "3e823c5439fe996d44b10a5e99f28948e0492317", "title": "Nanozyme-Enhanced Electrochemical Biosensors: Mechanisms and Applications."}, {"paperId": "dd3c9e922292707bc5a1087013ea435727ca1239", "title": "Quantitative Metabolomic Analysis of the Rat Hippocampus: Effects of Age and of the Development of Alzheimer's Disease-Like Pathology."}, {"paperId": "fd6d0c051680d00883941b8340f104dff461a5d1", "title": "Analysis of 4-Hydroxyphenyllactic Acid and Other Diagnostically Important Metabolites of α-Amino Acids in Human Blood Serum Using a Validated and Sensitive Ultra-High-Pressure Liquid Chromatography-Tandem Mass Spectrometry Method"}, {"paperId": "1d60d1412a5b9d3e6e1f44c63c3e904006950dd8", "title": "Metabolomics Reveals Molecular Signatures for Psoriasis Biomarkers and Drug Targets Discovery"}, {"paperId": "fe4888b17704043c9fee3cc44decdeb8be99f111", "title": "Carnosine, Zinc and Copper: A Menage a Trois in Bone and Cartilage Protection"}, {"paperId": "d86c22dc21155c2c10bd0c209087eb3392a6aae6", "title": "The diagnosis of tuberculous meningitis: advancements in new technologies and machine learning algorithms"}, {"paperId": "8c7ad374dac3df0a1a889981967974f5782399ab", "title": "Metabolic Fingerprinting for the Diagnosis of Clinically Similar Long COVID and Fibromyalgia Using a Portable FT-MIR Spectroscopic Combined with Chemometrics"}, {"paperId": "95ff9f10b3db0d6fa54548ec7016b6037292d857", "title": "Advances in mass spectrometry for clinical analysis: Data acquisition, interpretation and information integration"}, {"paperId": "966b7c79b39db1ceee21941cf7ed33d2c93ce7b8", "title": "Recent progress of responsive Raman scattering probes for biosensing and bioimaging"}, {"paperId": "ced864cf89b1179cd9a50463da7be05ee01fefed", "title": "Unraveling the Metabolic Changes in Acute Pancreatitis: A Metabolomics-Based Approach for Etiological Differentiation and Acute Biomarker Discovery"}, {"paperId": "28c36fe7c13b6563cdb10c25a4c3cb16aa0f2b66", "title": "Emerging trends in computational approaches for drug discovery in molecular biology"}, {"paperId": "d5662d4027971c091dc2028d0d1270616eef552f", "title": "Novel biomarkers used for early diagnosis and tyrosine kinase inhibitors as targeted therapies in colorectal cancer"}, {"paperId": "bb02e9052fccda3116f9e74316f67acfa6367426", "title": "Metabolic signature biomarkers for predicting the recurrence of urological cancers."}, {"paperId": "96d75409d81e51505f6b8f3c9f6a6f82986421f5", "title": "Detection, mechanisms, and therapeutic implications of oncometabolites"}, {"paperId": "d3b2e00ef676834731ce4a39ddd6c6163352e8ec", "title": "Targeted quantitative metabolic profiling of brain-derived cell cultures by semi-automated MEPS and LC-MS/MS."}, {"paperId": "26e749370e5678dfca7295907802464a2de8c304", "title": "Estado del arte: Nuevos biomarcadores en el diagnóstico del Síndrome Metabólico"}, {"paperId": "a51cff152a148157daffef1310086eb25274964d", "title": "Advances in Genomic Data and Biomarkers: Revolutionizing NSCLC Diagnosis and Treatment"}, {"paperId": "040b9af5e8444fc47450e61f1fdda9cf5f412b64", "title": "Chemo Markers as Biomarkers in Septic Shock: A Comprehensive Review of Their Utility and Clinical Applications"}, {"paperId": "92ef767a64278831ccf3130697830338d054e223", "title": "Integrative multi-omics reveals the metabolic and functional diversity of microbiomes in the gut microenvironment"}, {"paperId": "240024ea9001e84f03ca4148d03840228adfc38a", "title": "Plasma Metabolomics Predicts Chemotherapy Response in Advanced Pancreatic Cancer"}, {"paperId": "170d4260493606e3f1581e452f6c22c51f6a87f5", "title": "Strategies for Natural Product Discovery by Unlocking Cryptic Biosynthetic Gene Clusters in Fungi"}, {"paperId": "827c53fcd4c4e3d8084e7ef92f31d9ba59f7b9cc", "title": "Metabolomics of infectious diseases in the era of personalized medicine"}, {"paperId": "a09fc99fd411d3ff463936e8eca9ffa46c581e53", "title": "Localization analysis of metabolites from complex biological samples-recent analytical technique of mass spectrometry imaging"}, {"paperId": "3c9efd1f02399fb3282443945aa8a52e78f09fa2", "title": "Precision Monitoring of Antithrombotic Therapy in Cardiovascular Disease"}]}
