{"paperId": "2af6b2ef1f733bd964dc46727fda50f1c117f112", "publicationVenue": null, "title": "Improving the Performance of Precise Query Processing on Large-scale Nested Data with UniHash Index", "abstract": "Querying nested data has become one of the most pivotal issues for seeking desired information on the Web. Unlike the traditional information retrieval, to effectively manage nested data, we generally need store the data and its structures separately, which significantly reduces the performance of data retrieving, especially when the dataset is in a large scale. More seriously, it brings a big challenge on ensuring the efficiency of processing precise queries that need to locate the exact positions of some certain values in a nested dataset. Combining the techniques of column-strip storage and inverted index, this paper defines an expression to represent the data objects’ unique location in nested records— UPath, and based on which we present a new index structure— UniHash to support precise query processing on nested datasets. In addition, this work develops the related algorithms for building UPath, establishing UniHash, performing precise queries on UniHash with MapReduce platform and maintaining UniHash as well. Compared with some existing approaches, such as XPath-based and Dremel, UniHash index is capable of supporting the execution of precise queries over nested dataset with better performance. We give the results of a group of experiments, which were conducted on different real datasets, to demonstrate the efficiency of the approach.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2015-02-28", "journal": {"name": "International journal of database theory and application", "pages": "111-128", "volume": "8"}, "authors": [{"authorId": "46659719", "name": "L. Wang"}, {"authorId": "40659308", "name": "Dunlu Peng"}, {"authorId": "2061282694", "name": "Ping Jiang"}], "citations": [{"paperId": "fceb22e587130b8f47339cbb6bf6da7cdee82846", "title": "Query Optimization on Large Scale Nested Data with Service Tree and Frequent Trajectory"}, {"paperId": "12305763d29e45b1216172588d61f2c98bdeb3a1", "title": "Querying and Extracting Timeline Information from Road Traffic Sensor Data"}]}
