{"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection", "abstract": "Floods are one of the most fatal and devastating disasters, instigating an immense loss of human lives and damage to property, infrastructure, and agricultural lands. To cater to this, there is a need to develop and implement real-time flood management systems that could instantly detect flooded regions to initiate relief activities as early as possible. Current imaging systems, relying on satellites, have demonstrated low accuracy and delayed response, making them unreliable and impractical to be used in emergency responses to natural disasters such as flooding. This research employs Unmanned Aerial Vehicles (UAVs) to develop an automated imaging system that can identify inundated areas from aerial images. The Haar cascade classifier was explored in the case study to detect landmarks such as roads and buildings from the aerial images captured by UAVs and identify flooded areas. The extracted landmarks are added to the training dataset that is used to train a deep learning algorithm. Experimental results show that buildings and roads can be detected from the images with 91% and 94% accuracy, respectively. The overall accuracy of 91% is recorded in classifying flooded and non-flooded regions from the input case study images. The system has shown promising results on test images belonging to both pre- and post-flood classes. The flood relief and rescue workers can quickly locate flooded regions and rescue stranded people using this system. Such real-time flood inundation systems will help transform the disaster management systems in line with modern smart cities initiatives.", "venue": "Smart Cities", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-18", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "1657644010", "name": "S. Qayyum"}, {"authorId": "2141965392", "name": "A. Heravi"}], "citations": [{"paperId": "9e32050b0fab3a4fbe464b02764168622c5cefd5", "title": "TinyEmergencyNet: a hardware-friendly ultra-lightweight deep learning model for aerial scene image classification"}, {"paperId": "a488ec9d53d410945c9e63da120da5b6f3d095e6", "title": "A Survey of AI Techniques in IoT Applications with Use Case Investigations in the Smart Environmental Monitoring and Analytics in Real-Time IoT Platform"}, {"paperId": "bc2202f4dd299de01590b04cc0eae3227be8f19b", "title": "Using Explainable Artificial Intelligence (XAI) to Predict the Influence of Weather on the Thermal Soaring Capabilities of Sailplanes for Smart City Applications"}, {"paperId": "3e9b9685ee8d9081d9fd38b6e2c4958ad384da31", "title": "Classification and detection of natural disasters using machine learning and deep learning techniques: A review"}, {"paperId": "f45ae398e474852ecd14decc26adc8a53a71d52c", "title": "Data-driven approach for AI-based crack detection: techniques, challenges, and future scope"}, {"paperId": "27591e2210d67d4e57c3ad620865e359fd8f5fbd", "title": "Implementation of the Internet of Things for early Floods in Agricultural Land using Dimensionality Reduction Technique and Ensemble ML"}, {"paperId": "b2205568866be11f095c9e3e3427249b0282cdcd", "title": "Hybrid deep learning model with enhanced sunflower optimization for flood and earthquake detection"}, {"paperId": "a00cdec5c4ace3047d166f9a6b5063d956e86118", "title": "Integrated Disaster Risk Management for Flood Detection on Remote Sensing Images using Deep Learning techniques"}, {"paperId": "74d971f10b200ad3f2330ccb8f65295910ff790e", "title": "MFEMANet: an effective disaster image classification approach for practical risk assessment"}, {"paperId": "371a98ae5007a402bf7ca0853a77d4e6a39f81f1", "title": "Flood Inundation and Depth Mapping Using Unmanned Aerial Vehicles Combined with High-Resolution Multispectral Imagery"}, {"paperId": "28945e6207253e508c6ff81e66f0c1e83b056366", "title": "Flood Monitoring and Early Warning Systems – An IoT Based Perspective"}, {"paperId": "a773dc95b2561e17d2482962774299bb2bcf1ae5", "title": "The State of the Art in Deep Learning Applications, Challenges, and Future Prospects: A Comprehensive Review of Flood Forecasting and Management"}, {"paperId": "e06942607687ecc4bf196d541fbee83eb4222e0e", "title": "Deep and Machine Learning-based Methods for Defect Classification in Jet Engines"}, {"paperId": "61f91d38c47ad5608b26fd552f9cbca22bb2e22d", "title": "Classification of structural building damage grades from multi-temporal photogrammetric point clouds using a machine learning model trained on virtual laser scanning data"}, {"paperId": "46dd67fa85d59caf90a0fa1a437d883fec420b74", "title": "Automatic flood detection by leveraging deep convolutional neural networks"}, {"paperId": "b76524b1859aea9f6f4a650e36eb782e40d15c63", "title": "Semantic Riverscapes: Perception and evaluation of linear landscapes from oblique imagery using computer vision"}, {"paperId": "7687d8ac693ea8ea0779dad05eb7af78a8061001", "title": "A Comprehensive Survey on CNN Models on Assessment of Nitrate Contamination in Groundwater"}, {"paperId": "9ef32387ca662a09b174ecac33766fccfc83591f", "title": "TDMA Slot Allocation for UAV Formations: Minimum Superframe Lengths for Two-Dimensional Equidistant Deployments"}, {"paperId": "82ff9bedce8c90ca69d005e242dae654c4ecc1c5", "title": "Machine Learning Applications in Internet-of-Drones: Systematic Review, Recent Deployments, and Open Issues"}, {"paperId": "e7d912883b8bf15df558b1bda8b7e10881b1711d", "title": "Hybrid object detection methodology combining altitude-dependent local deep learning models for search and rescue operations"}, {"paperId": "f47203c453d59f5f256ae7ed42490ae8a9a168ab", "title": "The Disaster-Resilient Smart City in Malaysia: The Use of Technology in Flood Management"}, {"paperId": "94ce1437fbe84aac33b07e8d82308abf98bb83d0", "title": "UAV Image Analysis of Flooded Area Using Convolutional Neural Networks"}, {"paperId": "b5e0ec7ce2ac5981b925c58cec30ded810f6a431", "title": "Intelligent English Online Classroom Real-Time Feedback System based on Remote Computer Monitoring Algorithms"}, {"paperId": "cd82856940dbe4938c505cc60bdaf34e82bc3aeb", "title": "Deep Learning for Arbitrary-Shaped Water Pooling Region Detection on Aerial Images"}, {"paperId": "4ab0e6beec45a502ef3343a3b9f3f00eb2e0da29", "title": "Drone-Based Bathymetry Modeling for Mountainous Shallow Rivers in Taiwan Using Machine Learning"}, {"paperId": "d771f9c0b3279797866c28ec7f6747af81119f2a", "title": "A Context Feature Enhancement Network for Building Extraction from High-Resolution Remote Sensing Imagery"}, {"paperId": "42ac4825221f885cb8f2e5d3a1f81900b070180d", "title": "Flood Detection Based on Unmanned Aerial Vehicle System and Deep Learning"}, {"paperId": "dfce7a518aa0a0e75c7240bac377d26d3211cfe2", "title": "Water body classification from high-resolution optical remote sensing imagery: Achievements and perspectives"}, {"paperId": "894e649606056d1836163bac2fe05af23ecc24b0", "title": "A novel metaheuristics with adaptive neuro-fuzzy inference system for decision making on autonomous unmanned aerial vehicle systems."}, {"paperId": "a4c8a3b901cb277e8103cef6a7d27f6a9d097c19", "title": "Three-Dimensional Convolutional Neural Network on Multi-Temporal Synthetic Aperture Radar Images for Urban Flood Potential Mapping in Jakarta"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "fc46c53efc9e43cb89ba64e46422a4b690584fee", "title": "A simple R-UAV permission-based distributed mutual exclusion in FANET"}, {"paperId": "a59f49d691c7b86d3d93e0dbe2c8abb4f0fb7e59", "title": "ADAPT: An Open-Source sUAS Payload for Real-Time Disaster Prediction and Response with AI"}, {"paperId": "5098bf49e37932cd4df0ce07018e4151b42c2790", "title": "Inspecting Buildings Using Drones and Computer Vision: A Machine Learning Approach to Detect Cracks and Damages"}, {"paperId": "c322fb4b7e1da33dbe6d78d8cf428c7551ec80e4", "title": "Quantum neural network-based multilabel image classification in high-resolution unmanned aerial vehicle imagery"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "f39e5bf6948806d5b3ef33e2802b382292316230", "title": "Assessing Nitrate Contamination Risks in Groundwater: A Machine Learning Approach"}]}
