{"paperId": "2af73a5156d744fbb85d591b4323481e182360d5", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Comparative Study of Convolutional Neural Network and Conventional Machine Learning Methods for Landslide Susceptibility Mapping", "abstract": "Landslide susceptibility mapping (LSM) is a useful tool to estimate the probability of landslide occurrence, providing a scientific basis for natural hazards prevention, land use planning, and economic development in landslide-prone areas. To date, a large number of machine learning methods have been applied to LSM, and recently the advanced convolutional neural network (CNN) has been gradually adopted to enhance the prediction accuracy of LSM. The objective of this study is to introduce a CNN-based model in LSM and systematically compare its overall performance with the conventional machine learning models of random forest, logistic regression, and support vector machine. Herein, we selected Zhangzha Town in Sichuan Province, China, and Lantau Island in Hong Kong, China, as the study areas. Each landslide inventory and corresponding predisposing factors were stacked to form spatial datasets for LSM. The receiver operating characteristic analysis, area under the curve (AUC), and several statistical metrics, such as accuracy, root mean square error, Kappa coefficient, sensitivity, and specificity, were used to evaluate the performance of the models. Finally, the trained models were calculated, and the landslide susceptibility zones were mapped. Results suggest that both CNN and conventional machine learning-based models have a satisfactory performance. The CNN-based model exhibits an excellent prediction capability and achieves the highest performance but also significantly reduces the salt-of-pepper effect, which indicates its great potential for application to LSM.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-11", "journal": {"name": "Remote. Sens.", "pages": "321", "volume": "14"}, "authors": [{"authorId": "144207288", "name": "R. Liu"}, {"authorId": "2150440038", "name": "Xin Yang"}, {"authorId": "145890137", "name": "Chong Xu"}, {"authorId": "2148597895", "name": "Liang Wei"}, {"authorId": "97610729", "name": "Xian-min Zeng"}], "citations": [{"paperId": "69b00e97a57ce5d17502dec7fa52b5827f57aa44", "title": "Comparative study for coastal aquifer vulnerability assessment using deep learning and metaheuristic algorithms."}, {"paperId": "ab75fdc55afbd828f459e65b8d80e60a69f8e345", "title": "Identifying recurrent and persistent landslides using satellite imagery and deep learning: A 30-year analysis of the Himalaya."}, {"paperId": "bf357e81b299ae981f65b42c9786b1f7869560f5", "title": "An essential update on the inventory of landslides triggered by the Jiuzhaigou Mw6.5 earthquake in China on 8 August 2017, with their spatial distribution analyses"}, {"paperId": "4716a15a6466a7d46515b56a7721e814b76a8d2f", "title": "Estimating landslide hazard distribution based on machine learning and bivariate statistics in Utmah Region, Yemen"}, {"paperId": "62be63c211ce57aebd515f3444edc0e895ee4b3f", "title": "A quick method of early landslide identification based on dynamic susceptibility analysis using M-SVM method: a case study"}, {"paperId": "400b316ab07314a3d86c89c3aa0e60e4722148d3", "title": "Optimization of negative sample selection for landslide susceptibility mapping based on machine learning using K-means-KNN algorithm"}, {"paperId": "403fd3f0d3780daa9e01313ee24153c5c9ff823d", "title": "Groundwater potential delineation using geodetector based convolutional neural network in the Gunabay watershed of Ethiopia."}, {"paperId": "fba3c60b8a8867eb6c171888b7a0de9ae71ddeba", "title": "Impact of Vegetation Differences on Shallow Landslides: A Case Study in Aso, Japan"}, {"paperId": "2624a160957239aa8290b3510b82f72d67aafd95", "title": "A Novel Heterogeneous Ensemble Framework Based on Machine Learning Models for Shallow Landslide Susceptibility Mapping"}, {"paperId": "ace19b822978c7d90a266a0032aa95a8a0d436a6", "title": "Deep Learning for Earthquake Disaster Assessment: Objects, Data, Models, Stages, Challenges, and Opportunities"}, {"paperId": "3a3af82656a9edce80027901e75939a3cb3dbbe4", "title": "Assessment of landslide susceptibility using machine learning classifiers in Ziz upper watershed, SE Morocco"}, {"paperId": "f305951e7f6385c18e1f795685469c7bf2b61b86", "title": "Open-Pit Mining Area Extraction from High-Resolution Remote Sensing Images Based on EMANet and FC-CRF"}, {"paperId": "d13fb05f06a7c6b05a2a94146972c58f016b5397", "title": "Thermokarst Lake Susceptibility Assessment Induced by Permafrost Degradation in the Qinghai-Tibet Plateau Using Machine Learning Methods"}, {"paperId": "33f8469ad8f33f916da3b631909b0dc6258e1b62", "title": "Learning a Deep Attention Dilated Residual Convolutional Neural Network for Landslide Susceptibility Mapping in Hanzhong City, Shaanxi Province, China"}, {"paperId": "761232d5e53c64d0997f12a5a47fc92366f17167", "title": "A new combined approach of neural-metaheuristic algorithms for predicting and appraisal of landslide susceptibility mapping"}, {"paperId": "83ae505ff37b063779ac8d56c36fedcb76ff4329", "title": "Novel evolutionary-optimized neural network for predicting landslide susceptibility"}, {"paperId": "48c394bdafcd6b1cafafac4843439b511aed8878", "title": "FR-weighted GeoDetector for landslide susceptibility and driving factors analysis"}, {"paperId": "d2e48e3acc084c235b0b3b7b8ddab668b4d5db33", "title": "3DCNN landslide susceptibility considering spatial-factor features"}, {"paperId": "0fe484b2b97b2f22d1af305e94ffcb9ee55c3c92", "title": "Application of logistic regression model for hazard assessment of landslides caused by the 2012 Yiliang Ms 5.7 earthquake in Yunnan Province, China"}, {"paperId": "a9bbc2e2291d08578712cd6747ac8f4285b5f933", "title": "Land use and land cover classification with hyperspectral data: A comprehensive review of methods, challenges and future directions"}, {"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network"}, {"paperId": "914e42e0fcc5da70fff682adde8ef87061b52411", "title": "The Simulation and Prediction of Land Surface Temperature Based on SCP and CA-ANN Models Using Remote Sensing Data: A Case Study of Lahore"}, {"paperId": "a447ae8dd0e0bc376b8d48cf8e27ead1c70f2dd6", "title": "A Comparative Study of Shallow Machine Learning Models and Deep Learning Models for Landslide Susceptibility Assessment Based on Imbalanced Data"}, {"paperId": "8f7c6b5d17a6a1c68da5ae0f063d453ccd7401ac", "title": "Raster-based landslide susceptibility mapping using compensatory MADM methods"}, {"paperId": "fdc9fc93f0a1623303a8d314f4089b0250804a87", "title": "Clasificación de uso del suelo y vegetación con redes neuronales convolucionales"}, {"paperId": "3d031f646f1c57fe2ca19ea923fbfa015b7b5152", "title": "Landslide susceptibility mapping based on CNN-3D algorithm with attention module embedded"}, {"paperId": "5d7d8eceb07b2c9e65f17c4e3d84cc98691e7616", "title": "Comparison of Effects between Different Weight Calculation Methods for Improving Regional Landslide Susceptibility—A Case Study from Xingshan County of China"}, {"paperId": "3452e38edb0a6d439edc6fb11752fc6ac56327c8", "title": "Assessment of the performance of GIS-based analytical hierarchical process (AHP) approach for flood modelling in Uttar Dinajpur district of West Bengal, India"}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "c0293f3422fa56e9909091c564fd0246c8e23b84", "title": "Improved Shallow Landslide Susceptibility Prediction Based on Statistics and Ensemble Learning"}, {"paperId": "9d2ad6bde3937b98ecc2ac8678e16a9f9344e09b", "title": "A new combined approach of two neural-metaheuristic techniques based on the Cuckoo optimization algorithm and backtracking search algorithms for predicting and appraisal of landslide susceptibility mapping"}]}
