{"paperId": "2afe3702f8f3035898a8937b17c9b66ddbb0c863", "publicationVenue": {"id": "9e049685-267f-4444-a06e-df074744d1ff", "name": "Small Methods", "alternate_names": ["Small Method"], "issn": "2366-9608", "url": "https://onlinelibrary.wiley.com/journal/23669608"}, "title": "Recent Progress of Advanced Materials for Triboelectric Nanogenerators", "abstract": "Triboelectric nanogenerators (TENGs) have received intense attention due to their broad application prospects in the new era of internet of things (IoTs) as distributed power sources and self‐powered sensors. Advanced materials are vital components for TENGs, which decide their comprehensive performance and application scenarios, opening up the opportunity to develop efficient TENGs and expand their potential applications. In this review, a systematic and comprehensive overview of the advanced materials for TENGs is presented, including materials classifications, fabrication methods, and the properties required for applications. In particular, the triboelectric, friction, and dielectric performance of advanced materials is focused upon and their roles in designing the TENGs are analyzed. The recent progress of advanced materials used in TENGs for mechanical energy harvesting and self‐powered sensors is also summarized. Finally, an overview of the emerging challenges, strategies, and opportunities for research and development of advanced materials for TENGs is provided.", "venue": "Small Methods", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-06-17", "journal": {"name": "Small Methods", "volume": "7"}, "authors": [{"authorId": "96765034", "name": "Di Liu"}, {"authorId": "2130335976", "name": "Jiayue Zhang"}, {"authorId": "93153250", "name": "Shengnan Cui"}, {"authorId": "2151769393", "name": "Linglin Zhou"}, {"authorId": "89299288", "name": "Yikui Gao"}, {"authorId": "2156105544", "name": "Zhong Lin Wang"}, {"authorId": "2146041391", "name": "Jie Wang"}], "citations": [{"paperId": "29dad7bcddb575126ffc04b665096572a7681da1", "title": "Surface manipulated triboelectric polymer films via direct fluorination towards high performance TENG"}, {"paperId": "20b7abeb7f96897fc31642cba59e4a5f1907237f", "title": "Multifunctional triboelectric nanogenerator for wind energy harvesting and mist catching"}, {"paperId": "ff0fd1510e3cf98efa3ce615659b3c4345aec177", "title": "CsPbI3-PVDF Composite-Based Multimode Hybrid Piezo-Triboelectric Nanogenerator: Self-Powered Moisture Monitoring System."}, {"paperId": "1e0879abda89363de48c2ee2dccd8d80fa499d8b", "title": "Compositional Engineering of Hybrid Organic-Inorganic Lead-Halide Perovskite and PVDF-Graphene for High-Performance Triboelectric Nanogenerators."}, {"paperId": "432af600a4a6203f39056f0f368f13ddebd1b17e", "title": "A Dual-Mode Flexible Sensor Based on the Combination of Triboelectric and Piezoresistive Sensing to Simultaneously Monitor Non-Contact/Contact Pressure"}, {"paperId": "d1a6ac729f3845cb2e570691a8631788c816ec9f", "title": "Endowing actuators with sensing capability: Recent progress on perceptive soft actuators"}, {"paperId": "36ac2929a8d06b2b02dfa9a19f62cac28185d77b", "title": "Advancing MXene-based integrated microsystems with micro-supercapacitors and/or sensors: Rational design, key progress, and challenging perspectives"}]}
