{"paperId": "2aff1f8b99171c5a7c5f2f87c99bdec865d9b6fa", "publicationVenue": null, "title": "Anomaly Detection of Smart City in IoT Cyberattacks based on Hybrid A-BiLSTM-CRF Method", "abstract": "In recent years, the new Internet of Things (IoT) paradigm has gained widespread adoption, and as a result, smart cities have evolved. “Smart cities” deploy their solutions in real time to enhance the convenience and happiness of urban dwellers. The network traffic of a smart city via IoT systems is rising dramatically, generating new cyber security issues, because these IoT devices are being connected to sensors that are directly connected to massive cloud servers. Researchers need to improve techniques for detecting compromised Internet of Things (IoT) devices in order to defend against these incursions. The proposed method employs the steps of preprocessing the data, selecting the features to use, and training the model. Data preprocessing in machine learning and statistics typically involves the use of normalization and standardization feature scaling techniques to convert the numerical values included in the dataset into the desired scales and ranges. Chi-square, Pearson's Correlation Coefficient, and mutual information are the three main metrics used in the feature selection process. A-BiLSTM-CRF is then used to train the models with the input features. When compared to the two most common alternatives, CRF and Bi-LSTM, the proposed method performs better. The proposed method was successful with a success rate of 97.32%.", "venue": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-15", "journal": {"name": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "pages": "430-435"}, "authors": [{"authorId": "2008210263", "name": "A. J. Chinchawade"}, {"authorId": "2277524976", "name": "M. Kalaiselvi"}, {"authorId": "2277503081", "name": "T. S. Kumar"}, {"authorId": "2277494259", "name": "Yogendra Singh"}, {"authorId": "2277531434", "name": "S. Srisathirapathy"}, {"authorId": "2277528720", "name": "G. C. Babu"}], "citations": []}
