{"paperId": "2b0228665d244df929c240b1096b3ef6eec62e22", "publicationVenue": {"id": "4b9b7f0f-6517-4553-991d-ee3d8e79711b", "name": "JURNAL PAJAR (Pendidikan dan Pengajaran)", "type": "journal", "alternate_names": ["J PAJAR (pendidikan dan Pengajaran"], "issn": "2580-8435", "url": "http://ejournal.unri.ac.id/index.php/PJR", "alternate_urls": ["https://pajar.ejournal.unri.ac.id/index.php/PJR"]}, "title": "SOCIAL MEDIA INTERDISCIPLINARITY IN MULTIMODALITY OF ARTS AND CULTURE EDUCATION FOR MILLENIALS", "abstract": "This study aims to explore the problems of art and culture interactive learning at the Junior High School level which belongs to the millennial generation. The focus of the study lies in the interdisciplinary aspect of social media in its delivery in multimodality of arts and culture learning process. Furthermore, to find out about opportunities, challenges, and responses from students about the use of social media in its development as a medium in art and culture interactive learning. The research method uses qualitative-analytic. Data collection used observation techniques which were carried out from January 2020 to June 2020, and questionnaires to 75 art teachers and 500 Junior High School students who were taken randomly, with spatial boundaries in Surabaya, East Java. The results showed that the learning involvement experienced by students had complexity and multimodality, including collaborative work, observing and evaluating each other's work, and involvement in finding, identifying, and exploring trends related to delivery in social media as a medium for art and culture learning process. Furthermore, it's able to motivate students to be more actively involved in learning with a sense of joy; positioning artwork with others on social media; increase the contextual and conceptual understanding in the material of art and culture and apply it as a process of actualizing students' aesthetic skills; and improve critical thinking and problem-solving skills.", "venue": "JURNAL PAJAR (Pendidikan dan Pengajaran)", "year": 2021, "fieldsOfStudy": ["Sociology", "Psychology"], "publicationTypes": null, "publicationDate": "2021-01-17", "journal": {"name": "JURNAL PAJAR (Pendidikan dan Pengajaran)"}, "authors": [{"authorId": "2089876899", "name": "Yasinda Widya Fahmi"}, {"authorId": "116724292", "name": "D. Djatiprambudi"}, {"authorId": "100763983", "name": "Warih Handayaningrum"}], "citations": [{"paperId": "6739929fb195416054aa4965cfe26e6d23cf2d64", "title": "UTAUT2 MODEL EVALUATION OF ACCEPTANCE WEB-BASED MULTIMODALITY LEARNING MEDIA"}]}
