{"paperId": "2b0522479169bc2000c5b62e989740d37f242cbf", "publicationVenue": {"id": "2ca1e2ac-8c3b-4251-94ed-24846d391d3b", "name": "Computational and Mathematical Methods in Medicine", "type": "journal", "alternate_names": ["Comput Math Method Med"], "issn": "1748-670X", "url": "https://www.hindawi.com/journals/cmmm/"}, "title": "Investigation of Influencing Factors on the Prevalence of Retinopathy in Diabetic Patients Based on Medical Big Data", "abstract": "As one of the most important organs of human beings, the eyes can receive external visual information and play an important role in perception. Therefore, the method of maintaining eye health is a problem that people pay attention to. Omental disease is one of the most serious microvascular complications in diabetic patients, and it is also the main cause of blindness in patients. The purpose of this article is to investigate the main factors that influence the prevalence of retinopathy in diabetic patients based on medical big data. In this article, a method for investigating the causes of the incidence of retinopathy in diabetic patients based on medical big data is proposed, and a questionnaire survey method and other methods are used for experimental investigation. Combining the data in the figure in the experiment in this article, it can be seen that among diabetic patients, the prevalence of diabetes in men is 12.4%, and the prevalence of diabetes in women is 8.4%. From the data in the figure, it can be known that the rate of retinopathy caused by various factors is between 5% and 7%, and the total prevalence of retinopathy is 47.5%. There are many factors affecting the prevalence of retinopathy in diabetic patients, such as the duration of diabetes, urinary albumin index, glycosylated hemoglobin index, and fasting blood glucose level; various factors lead to an increase in the prevalence of retinopathy in diabetic patients. The results show that there are many factors affecting the prevalence of retinopathy in diabetic patients, so patients should pay attention to exercise, control their diet, and prevent retinopathy.", "venue": "Computational and Mathematical Methods in Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-12", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2022"}, "authors": [{"authorId": "2173087912", "name": "Lei Yang"}, {"authorId": "2162295749", "name": "Qin Qi"}, {"authorId": "1996186687", "name": "Fangjiang Zheng"}, {"authorId": "5793520", "name": "Yanqiang Wei"}, {"authorId": "2162341172", "name": "Qiaoe Wu"}], "citations": [{"paperId": "d5c64d3273154c4eb73c8e92f77a43150192bf0c", "title": "A risk prediction model for type 2 diabetes mellitus complicated with retinopathy based on machine learning and its application in health management"}, {"paperId": "bd01e21763eaeed1cdd0fdd4c50b705a8be32015", "title": "EVO-Based Optimization of Deep Learning Models for Diabetic Retinopathy Diagnosis"}, {"paperId": "a703e557948927f2ed2546cb2deb3cb182d23be1", "title": "Retracted: Investigation of Influencing Factors on the Prevalence of Retinopathy in Diabetic Patients Based on Medical Big Data"}, {"paperId": "fa0caada83776d622cf196b9f15937064f817633", "title": "Inhibition of KCTD10 Affects Diabetic Retinopathy Progression by Reducing VEGF and Affecting Angiogenesis"}, {"paperId": "6b54ea9322a17908309026816c484c2633f0e119", "title": "Effects of Lycium barbarum L. Polysaccharides on Vascular Retinopathy: An Insight Review"}, {"paperId": "e3aa70ad81177bf1735c92fab8e59c9ace64de8e", "title": "Physical Activity Status and Diabetic Retinopathy: A Review"}]}
