{"paperId": "2b0f356cb7cc2c55d61d18ff6d1fbba284f3ccf1", "publicationVenue": {"id": "e587f364-8685-4bc2-8192-09d327173a5c", "name": "IEEE Cloud Computing", "type": "journal", "alternate_names": ["IEEE Cloud Comput"], "issn": "2325-6095", "url": "http://publications.computer.org/cloud-computing/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6509491", "https://ieeexplore.ieee.org/servlet/opac?punumber=6509491"]}, "title": "Privacy-Preserving Image Processing in the Cloud", "abstract": "Millions of private images are generated in various digital devices every day. The consequent massive computational workload makes people turn to cloud computing platforms for their economical computation resources. Meanwhile, the privacy concerns over the sensitive information contained in outsourced image data arise in public. In fact, once uploaded to cloud, the security and privacy of the image content can only presume upon the reliability of the cloud service providers. Lack of assuring security and privacy guarantees becomes the main barrier to further deployment of cloud-based image processing systems. This paper studies the design targets and technical challenges lie in constructing cloud-based privacy-preserving image processing system. We explore various image processing tasks, including image feature detection, digital watermarking, content-based image search. The state-of-the-art techniques, including secure multiparty computation, and homomorphic encryption are investigated. A detailed taxonomy of the problem statement and the corresponding solutions is provided", "venue": "IEEE Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-01-12", "journal": {"name": "IEEE Cloud Comput.", "pages": "48-57", "volume": "5"}, "authors": [{"authorId": "3330305", "name": "Zhan Qin"}, {"authorId": "145369053", "name": "J. Weng"}, {"authorId": "143905357", "name": "Yong Cui"}, {"authorId": "144222395", "name": "K. Ren"}], "citations": [{"paperId": "aa1c9d623cbea5f3147caf707204e1ea288f00ee", "title": "Exploring Machine Learning Models for Federated Learning: A Review of Approaches, Performance, and Limitations"}, {"paperId": "bbd7b23598e5e65d37bd119b94d72a7b9e6ef58a", "title": "ObliuSky: Oblivious User-Defined Skyline Query Processing in the Cloud"}, {"paperId": "e3a456ffeabcc51c47c7af1f1e5a97703a289c29", "title": "PrigSim: Towards Privacy-Preserving Graph Similarity Search as a Cloud Service"}, {"paperId": "5df2c660c49e511063fedb911559ae6fda6b44c2", "title": "A Literature Survey on Privacy Preserving in Image processing on Cloud"}, {"paperId": "06c48fde6ba15f7e3d01a8521943d044d83a2b68", "title": "E-TPE: Efficient Thumbnail-Preserving Encryption for Privacy Protection in Visual Sensor Networks"}, {"paperId": "6715a6ccea8828a8f1cbd7fe8c0e0d44e7d7ed59", "title": "Neural Attractor-Based Adaptive Key Generator with DNA-Coded Security and Privacy Framework for Multimedia Data in Cloud Environments"}, {"paperId": "e35035ed213cf15062997564c11ddae259dfd593", "title": "A Novel Image-Based Homomorphic Approach for Preserving the Privacy of Autonomous Vehicles Connected to the Cloud"}, {"paperId": "ba3c9c9a136f7e700125c3f17c15f4e81130c68b", "title": "Lightweight Auditable Secure Cloud Storage With Privacy Enabled Data Storage Optimization"}, {"paperId": "aa99b8b7ea39c02348c8d0a3ad7d2995bcd166d8", "title": "SecSkyline: Fast Privacy-Preserving Skyline Queries Over Encrypted Cloud Databases"}, {"paperId": "1e8515e781434be1aaf1d22baa46bf2345560c62", "title": "SecGNN: Privacy-Preserving Graph Neural Network Training and Inference as a Cloud Service"}, {"paperId": "09aa8d58a82aa2e7000213ea292d7d1745fd4a99", "title": "Preserving Privacy for Blockchain-driven Image Watermarking using Fully Homomorphic Encryption"}, {"paperId": "77de90462a116a1ac3bcb1d6661e4d12b5ca9494", "title": "Medical Cloud Computing Data Processing to Optimize the Effect of Drugs"}, {"paperId": "5076582dc94c4cc13ba1645a768c5b6c065089be", "title": "Privacy-preserving image search (PPIS): Secure classification and searching using convolutional neural network over large-scale encrypted medical images"}, {"paperId": "33c8c2ff179d2ddc106b1d40b01879a6c7491f8d", "title": "Neural-assisted image-dependent encryption scheme for medical image cloud storage"}, {"paperId": "6c7dc8940540547ecae35ab1889b261a35ea62ef", "title": "RETRACTED ARTICLE: Protecting user profile based on attribute-based encryption using multilevel access security by restricting unauthorization in the cloud environment"}, {"paperId": "7de42060c97988760d9ca8500b241712f597f88f", "title": "Cloud-Based Privacy-Preserving Collaborative Consumption for Sharing Economy"}, {"paperId": "2630433328eaec36167de4fea03d0fa82a584e33", "title": "Advanced framework for highly secure and cloud-based storage of colour images"}, {"paperId": "e61edc5dc79d565dc8c8e04c87deeb5a2b7c59c7", "title": "OIDPR: Optimized insulin dosage via privacy‐preserving reinforcement learning"}, {"paperId": "1167405de082a7dba92a439415ce982e722db597", "title": "An Efficient Two-Level Dictionary-Based Technique for Segmentation and Compression Compound Images"}, {"paperId": "9001e99ef5303ea51c7f70f4cacf860f5d242e72", "title": "Towards secure big data analytic for cloud-enabled applications with fully homomorphic encryption"}, {"paperId": "a80385ebaab2c4edc55ff0a0a7d6a2d5e0037db3", "title": "Multimedia access control with secure provenance in fog-cloud computing networks"}, {"paperId": "4e4d38d2244ed3a5b525dbc59b552ceec29ad02b", "title": "Multiple-image encryption based on chaotic phase mask and equal modulus decomposition in quaternion gyrator domain"}, {"paperId": "ce535846f9d88437e756bb2a252dacb47b2749ae", "title": "Integrating Multiple Models Using Image-as-Documents Approach for Recognizing Fine-Grained Home Contexts †"}, {"paperId": "82cf8b089606e410f9192d5f119e246b26fd6bde", "title": "LiPSG: Lightweight Privacy-Preserving Q-Learning-Based Energy Management for the IoT-Enabled Smart Grid"}, {"paperId": "d8d993778cdf25adccdfe749458dcebf49067d2e", "title": "Homomorphic Image Processing Over Geometric Product Spaces and Finite P-Adic Arithmetic"}, {"paperId": "a34f8bec49442bdcd3b4bbb6497b35a2182c554c", "title": "Iprivacy-Performance Measurement of Encrypted Image Over Mobile Cloud"}, {"paperId": "95ef3cd0c97fab525aa35fe2fb0fc1c4a480e497", "title": "A cloud compatible DNA coded security solution for multimedia file sharing & storage"}, {"paperId": "3a0c97330592b0f154d62a29549a002aeee1121b", "title": "FFT-ETM based distortion less and high payload image steganography"}, {"paperId": "21f2b747dc974e149d983c14e8a240c5500d9571", "title": "Designing a trivial information relaying scheme for assuring safety in mobile cloud computing environment"}, {"paperId": "e4cbf80f1402a0c24bd3d54912db937ed3b7ca3e", "title": "Cloud IoT as a Crucial Enabler: a Survey and Taxonomy"}, {"paperId": "7c28054dc2efa61609c73df2f94f32ec28207b2b", "title": "Real-Time Privacy-Preserving Data Release Over Vehicle Trajectory"}, {"paperId": "5db7bdb3879c2cc52cb3ea43199457c741e0ba00", "title": "Privacy Preserving Intrusion Detection Via Homomorphic Encryption"}, {"paperId": "5d6aa6839f6a8f3d86b20fa6b3846049a6d4017b", "title": "Highly robust hybrid image watermarking approach using Tchebichef transform with secured PCA and CAT encryption"}, {"paperId": "95af01a9059f5b0bb2c16f988214a97d6c72607f", "title": "Personal Data Privacy Challenges of the Fourth Industrial Revolution"}, {"paperId": "7afeeaed8b91bec5fb09586f3d41ea0979640849", "title": "Comparative Evaluations of Privacy on Digital Images"}, {"paperId": "1606acd5440e9e579f4fb851a1ffdb4460a5829c", "title": "Multiple Encrypted Random Forests using Compressed Sensing for Private Classification"}, {"paperId": "49ea9cfb6f7af5aa8dc4d78ce33ad9351e1b21a4", "title": "Improved Privacy Preserving Through Random Pixel Shifting Method RPSM in Cloud"}, {"paperId": "d60f38af2c326ebcd9b2464db41a12df23bf7788", "title": "Cloud-Based Biometrics (Biometrics as a Service) for Smart Cities, Nations, and Beyond"}, {"paperId": "43ed44208a9c73dfd377f0a49ef61870e89c8225", "title": "MAGO: Maliciously Secure Subgraph Counting on Decentralized Social Graphs"}, {"paperId": "a3e87caef834c034acf699339ece9c251f8a0222", "title": "Medical Image Cryptanalysis using Adaptive, Lightweight Neural Network based Algorithm for IoT based Secured Cloud Storage"}, {"paperId": "82062ce6c77a19337945ee1ff64cc712cec41ef8", "title": "PeGraph: A System for Privacy-Preserving and Efficient Search Over Encrypted Social Graphs"}, {"paperId": "52f90a729cd909cb6ee1cb5268016efab7a84d22", "title": "Scaling & fuzzing: Personal image privacy from automated attacks in mobile cloud computing"}, {"paperId": "a22adbaa5e8e29d9b4859f02796d869403b6b886", "title": "Key Challenges to Data Management in the Fourth Industrial Revolution"}, {"paperId": "d6e14a1e196d31feb629db5bde98a8617c874161", "title": "An Innovative Mkahe And A Novel Qfwc Of Crop Images In Agriculture Field"}, {"paperId": "449826d64c422e09298ed534fc79d621a3a3243e", "title": "Medical Image Digital Watermarking Algorithm Based on DWT-DFRFT"}, {"paperId": "3d5c2d67504686482ffe6db01b6885ed04bb449e", "title": "HCI Based In-Cabin Monitoring System for Irregular Situations with Occupants Facial Anonymization"}, {"paperId": "f070494c43852cf7198f9ecbe669e849ad6bd7ab", "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)"}, {"paperId": "1e2f48b19dff083e5a6079d4c1be104be7615630", "title": "Intelligent Security and Privacy of Electronic Health Records Using Biometric Images."}, {"paperId": "95a9e5b08d96dd5d50f8d6c051cccbc8da62cc0f", "title": "Privacy-Preserving Lightweight Image Encryption in Mobile Cloud"}, {"paperId": "61cb9c58b31e6b77c855c396d2b55fdcdd197989", "title": "Algorithms and Techniques for Computation Offloading in Edge E nabled Cloud of Things (ECoT)–A Primer"}, {"paperId": "bc1b8c9498f3a1fbea8279bfabd3b1659512dcd5", "title": "Tolla : A user-isolating data management system"}]}
