{"paperId": "2b1143fbed61617fcc27633dd9452a627edb5c99", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "From Kepler to Newton: Explainable AI for Science Discovery", "abstract": "The Observation--Hypothesis--Prediction--Experimentation loop paradigm for scientific research has been practiced by researchers for years towards scientific discoveries. However, with data explosion in both mega-scale and milli-scale scientific research, it has been sometimes very difficult to manually analyze the data and propose new hypotheses to drive the cycle for scientific discovery. In this paper, we discuss the role of Explainable AI in scientific discovery process by demonstrating an Explainable AI-based paradigm for science discovery. The key is to use Explainable AI to help derive data or model interpretations, hypotheses, as well as scientific discoveries or insights. We show how computational and data-intensive methodology -- together with experimental and theoretical methodology -- can be seamlessly integrated for scientific research. To demonstrate the AI-based science discovery process, and to pay our respect to some of the greatest minds in human history, we show how Kepler's laws of planetary motion and Newton's law of universal gravitation can be rediscovered by (Explainable) AI based on Tycho Brahe's astronomical observation data, whose works were leading the scientific revolution in the 16-17th century. This work also highlights the important role of Explainable AI (as compared to Blackbox AI) in science discovery to help humans prevent or better prepare for the possible technological singularity that may happen in the future, since science is not only about the know how, but also the know why. Presentation of the work is available at https://slideslive.com/38986142/from-kepler-to-newton-explainable-ai-for-science-discovery.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-24", "journal": {"name": "ArXiv", "volume": "abs/2111.12210"}, "authors": [{"authorId": "2109968285", "name": "Zelong Li"}, {"authorId": "2111810606", "name": "Jianchao Ji"}, {"authorId": "2145038716", "name": "Yongfeng Zhang"}], "citations": [{"paperId": "17df2453a7f8493c405a0b1ca72d7e9fe23951ba", "title": "Towards Explainable Artificial Intelligence (XAI): A Data Mining Perspective"}, {"paperId": "4ecbffd4be301b7e2db87fdb1408d5d1ca19b33a", "title": "D\\'etection d'objets c\\'elestes dans des images astronomiques par IA explicable"}, {"paperId": "a767a75c931a2d8627b9f2f6c93c01354322cf0d", "title": "Symbolic Regression Applied to Cosmology: An Approximate Expression for the Density Perturbation Variance"}, {"paperId": "98f166771681acfe51c0f69558d8a977f0782739", "title": "Automated Scientific Discovery: From Equation Discovery to Autonomous Discovery Systems"}, {"paperId": "1a29a931030c82e2cc74ab3607be98eea585c213", "title": "IHCV: Discovery of Hidden Time-Dependent Control Variables in Non-Linear Dynamical Systems"}, {"paperId": "628219d6db682340eb40bc5122ed62dbccab3f34", "title": "Counterfactual Collaborative Reasoning"}, {"paperId": "5b9c89f5b743916c95c88605f02ce78be7699941", "title": "ExplainableFold: Understanding AlphaFold Prediction with Explainable AI"}, {"paperId": "4177661bbf202215be362c5e79dab45cb6cfaf49", "title": "Learn Basic Skills and Reuse: Modularized Adaptive Neural Architecture Search (MANAS)"}, {"paperId": "b20c87e2925a81f57d9c913423e9e74c14de5341", "title": "A Survey on Trustworthy Recommender Systems"}, {"paperId": "a9cabebce7c1d833545dd8371f405a8e10858a95", "title": "Revealing the Roles of Part-of-Speech Taggers in Alzheimer Disease Detection: Scientific Discovery Using One-Intervention Causal Explanation"}, {"paperId": "747944b570fbad64cafee70748e5fe9f7f448a7f", "title": "Sources of Artificial Intelligence ∗"}, {"paperId": "39973a5af8b509c84f73a4a9e5b540f8886d3a5d", "title": "A framework for an AI pipeline for borehole data"}]}
