{"paperId": "2b28cd7143c8829166a8dc385ee7ea9b65145f45", "publicationVenue": null, "title": "Optimal Usage of Resources through Quality Aware Scheduling in Containers based Cloud Computing Environment", "abstract": "For cloud computing, the Quality Aware Scheduling of Containers (QASC) model has been proposed for delay-sensitive tasks. Plan your cloud tasks. Typically, time constraints are met while resources are used effectively. It's a really difficult undertaking. In order to distribute containers more effectively, QASC takes into account a number of performance factors. Containers and their make-span logs, as well as input quality metrics like I/O-intensive workload, startup time, hot standby failure rate, and inter-container dependencies, are collected by the QASC model. A metric coefficient that indicates each container's overall rating is calculated by normalizing and averaging these values to determine it. In order to determine how well scheduling performed, the model also includes a quality coefficient that calculates this metric-coefficient threshold. It's also critical for QASC to be able to determine the remaining energy in each container, which represents its request capacity. In order to optimize cloud resources, energy use is also taken into account by the model. From the cloud-sim simulation, an experimental dataset including 50 containers and 1,200 internet protocol-capable users was employed. For the make-span ratio, round-trip time, and energy consumption analysis, this produced 20,000 data points. The RLSched, DSTS, and ADATSA models were contrasted with the QASC model. The outcomes showed that QASC performed better than these models in a number of crucial areas. Tasks may be managed better with the higher average make-span ratio and lower volatility. Its superior job scheduling and resource use were further demonstrated by its shorter round-trip durations and lower energy usage across loads. The QASC model is an extremely complex scheduling method for container-based systems and a significant advancement in cloud computing research. Its approaches and methods enable for more intelligent energy use as well as high-quality services while also improving system performance, particularly for tasks that are delay-sensitive.\n ", "venue": "Scalable Computing : Practice and Experience", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-24", "journal": {"name": "Scalable Comput. Pract. Exp.", "pages": "1235-1245", "volume": "25"}, "authors": [{"authorId": "2287006775", "name": "Poojitha S.A."}, {"authorId": "2287008355", "name": "Ravindranath K"}], "citations": []}
