{"paperId": "2b2f7c90b979d100538c1bb475fc17b567e8feed", "publicationVenue": {"id": "abcfade0-4cdd-4b9f-bac3-fa13022b0a51", "name": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "type": "conference", "alternate_names": ["Ant Algorithm", "Ant Algorithms", "Int Workshop Ant Colony Optim Swarm Intell", "IEEE Int Conf Adv Netw Telecommun Syst", "Algorithmic Number Theory Symp", "Ant Colony Optimization and Swarm Intelligence", "Int Conf Adv Netw Telecommuncations Syst", "ANTS", "Ant Colony Optim Swarm Intell", "Algorithmic Number Theory Symposium", "International Conference on Advanced Networks and Telecommuncations Systems", "IEEE International Conference on Advanced Networks and Telecommunications Systems"], "url": "http://www.wikicfp.com/cfp/program?id=184", "alternate_urls": ["http://iridia.ulb.ac.be/~ants/", "http://www.wikicfp.com/cfp/program?id=182"]}, "title": "Strategic decision for crowd-sensing: An approach based on Markov decision process", "abstract": "With the surging of smartphone sensing and wireless networking, Mobile Crowd Sensing (MCS) has become a promising paradigm for cross-space and large scale sensing. In the smart city context, MCS can be extremely useful in pulling crowd data for better monitoring resource demand and planning. Since these devices are portable it is carried by almost every citizen thus making it ubiquitous. However, portability comes at the cost of limited energy consumption. Thus, the problem is that, how frequently a smartphone would lend itself for crowd-sensing while striking a balance between energy and incentive. In order to solve this problem, we propose a Markov decision process formulation of the problem and solve it to identify an optimal strategy for crowd-sensing depending on remaining energy, recharging probability and current load. Results are taken in R for different real world scenarios.", "venue": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Advanced Networks and Telecommunications Systems (ANTS)", "pages": "1-6"}, "authors": [{"authorId": "47655938", "name": "Arpita Ray"}, {"authorId": "2157899", "name": "C. Chowdhury"}, {"authorId": "1723305", "name": "Sarbani Roy"}], "citations": []}
