{"paperId": "2b3bde1d0dbe05be7affdae0b9d1076129daa20c", "publicationVenue": {"id": "baea33cc-0a71-4b2a-9f01-5071f7b1abc9", "name": "Frontiers in Endocrinology", "type": "journal", "alternate_names": ["Front Endocrinol"], "issn": "1664-2392", "url": "http://www.frontiersin.org/Endocrinology", "alternate_urls": ["https://www.frontiersin.org/journals/endocrinology"]}, "title": "Machine learning-based dynamic prediction of lateral lymph node metastasis in patients with papillary thyroid cancer", "abstract": "Objective To develop a web-based machine learning server to predict lateral lymph node metastasis (LLNM) in papillary thyroid cancer (PTC) patients. Methods Clinical data for PTC patients who underwent primary thyroidectomy at our hospital between January 2015 and December 2020, with pathologically confirmed presence or absence of any LLNM finding, were retrospectively reviewed. We built all models from a training set (80%) and assessed them in a test set (20%), using algorithms including decision tree, XGBoost, random forest, support vector machine, neural network, and K-nearest neighbor algorithm. Their performance was measured against a previously established nomogram using area under the receiver operating characteristic curve (AUC), decision curve analysis (DCA), precision, recall, accuracy, F1 score, specificity, and sensitivity. Interpretable machine learning was used for identifying potential relationships between variables and LLNM, and a web-based tool was created for use by clinicians. Results A total of 1135 (62.53%) out of 1815 PTC patients enrolled in this study experienced LLNM episodes. In predicting LLNM, the best algorithm was random forest. In determining feature importance, the AUC reached 0.80, with an accuracy of 0.74, sensitivity of 0.89, and F1 score of 0.81. In addition, DCA showed that random forest held a higher clinical net benefit. Random forest identified tumor size, lymph node microcalcification, age, lymph node size, and tumor location as the most influentials in predicting LLNM. And the website tool is freely accessible at http://43.138.62.202/. Conclusion The results showed that machine learning can be used to enable accurate prediction for LLNM in PTC patients, and that the web tool allowed for LLNM risk assessment at the individual level.", "venue": "Frontiers in Endocrinology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-10", "journal": {"name": "Frontiers in Endocrinology", "volume": "13"}, "authors": [{"authorId": "2216344116", "name": "Shengwei Lai"}, {"authorId": "47900277", "name": "Yun-long Fan"}, {"authorId": "49781516", "name": "Yuying Zhu"}, {"authorId": "2182283981", "name": "Fei Zhang"}, {"authorId": "2149505009", "name": "Zheng Guo"}, {"authorId": "2155840468", "name": "Bing Wang"}, {"authorId": "2136915566", "name": "Zheng Wan"}, {"authorId": "2216248752", "name": "Pei-lin Liu"}, {"authorId": "2057898076", "name": "N. Yu"}, {"authorId": "1992953929", "name": "Han-dai Qin"}], "citations": [{"paperId": "d633d0f2570b6a8514c81954c305b227901fb120", "title": "Clinical prediction models for cervical lymph node metastasis of papillary thyroid carcinoma"}, {"paperId": "2ddf8309bd082fc70410f2ba9ad702ed5a101ae8", "title": "Enhancing Thyroid Cancer Detection Through Machine Learning Approach"}, {"paperId": "6ba650b0f6972951ca339c6ac0f8f697792cfb33", "title": "Artificial intelligence in the diagnosis of thyroid cancer: Recent advances and future directions"}, {"paperId": "45d5c83c67519b57d3e41090324c033c451de1ae", "title": "Nomogram for preoperative estimation risk of lateral cervical lymph node metastasis in papillary thyroid carcinoma: a multicenter study"}, {"paperId": "4269469ce11a2aa42727c816ccfbff84c875dd84", "title": "The impact of multifocality on lateral lymph node metastasis in papillary thyroid carcinoma."}, {"paperId": "d16fbfd11ae0f1b0f949d2ba20975b0157ca5936", "title": "Prediction of Cervical Lymph Node Metastasis in Clinically Node-Negative T1 and T2 Papillary Thyroid Carcinoma Using Supervised Machine Learning Approach"}, {"paperId": "1c073947d1317f1dd2103567e4e4a57c60821ad1", "title": "Nomogram Model Based on Iodine Nutrition and Clinical Characteristics of Papillary Thyroid Carcinoma to Predict Lateral Lymph Node Metastasis"}, {"paperId": "bf0f7e4bdeb331fd510b857273b12f7264a6b70b", "title": "Cervical lymph node metastasis prediction of postoperative papillary thyroid carcinoma before 131I therapy based on clinical and ultrasound characteristics"}]}
