{"paperId": "2b4aa717fa0e7878c509da17268b8cb9add00c94", "publicationVenue": {"id": "6bffcf64-8860-4c88-9085-f0a3711734d7", "name": "International Journal of Infectious Diseases", "type": "journal", "alternate_names": ["Int J Infect Dis"], "issn": "1201-9712", "url": "https://www.journals.elsevier.com/international-journal-of-infectious-diseases/", "alternate_urls": ["http://www.sciencedirect.com/science/journal/12019712"]}, "title": "An Asia-Pacific study on healthcare workers’ perceptions of, and willingness to receive, the COVID-19 vaccination", "abstract": null, "venue": "International Journal of Infectious Diseases", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-26", "journal": {"name": "International Journal of Infectious Diseases", "pages": "52 - 60", "volume": "106"}, "authors": [{"authorId": "34559163", "name": "N. Chew"}, {"authorId": "2058935366", "name": "Clare Cheong"}, {"authorId": "2058935450", "name": "G. Kong"}, {"authorId": "2058935168", "name": "Kailun Phua"}, {"authorId": "9640327", "name": "J. N. Ngiam"}, {"authorId": "3663627", "name": "B. Tan"}, {"authorId": "2153210976", "name": "Bokun Wang"}, {"authorId": "1650743066", "name": "Fengyi Hao"}, {"authorId": "1424823275", "name": "Wanqiu Tan"}, {"authorId": "2118234838", "name": "Xiaofan Han"}, {"authorId": "145432905", "name": "B. Tran"}, {"authorId": "1737804817", "name": "M. T. Hoang"}, {"authorId": "144008476", "name": "H. Pham"}, {"authorId": "46180469", "name": "G. Vu"}, {"authorId": "2038368279", "name": "Y. Chen"}, {"authorId": "52210032", "name": "Rivan Danuaji"}, {"authorId": "2059122471", "name": "Komalkumar Rn"}, {"authorId": "2067325527", "name": "Meenakshi Pv"}, {"authorId": "2058933296", "name": "Kalpesh Talati"}, {"authorId": "2148350491", "name": "Cyrus S. H. Ho"}, {"authorId": "2051591650", "name": "Arvind K Sharma"}, {"authorId": "2529933", "name": "R. Ho"}, {"authorId": "2251231513", "name": "V. Sharma"}], "citations": [{"paperId": "ea8748d53b812be8f4e4e80e34907a7aacb63000", "title": "Behavioral Intention of Receiving Monkeypox Vaccination and Undergoing Monkeypox Testing and the Associated Factors Among Young Men Who Have Sex With Men in China: Large Cross-Sectional Study"}, {"paperId": "419f0ceb24e26a1f9b69a537c618124a6cc48b0e", "title": "Leveraging seasonal influenza health worker vaccination programmes for COVID-19 vaccine Introduction: A global qualitative analysis."}, {"paperId": "cb5da92ac534c4f8cc831606c0c691adb6752323", "title": "COVID-19 vaccine acceptance and its associated factors in the Western Pacific Region"}, {"paperId": "c5704cac3a23dfaa38c4533a5e80cf4b3c16fbc5", "title": "Relationship Between Attitude Towards Vaccination Against COVID-19 and Socialdemographic, Health-Related and Psychological Parameters Among Unvaccinated Hospital Employees in Latvia"}, {"paperId": "9b6e10332f8eb7afd95fab5a6a61059c081793a3", "title": "Perceptions About COVID-19 Disease and Vaccination Against it Among Adults in Lahore"}, {"paperId": "2180c8e8ba8fa5d4086edbe53e6018982fb85418", "title": "VACCINE COVID-19: REFUSAL TREATMENT IN INDONESIA"}, {"paperId": "8b145aebf2a731390c8ef54fd801c7953d1cbfbc", "title": "Behavioural and social drivers of COVID-19 vaccination in Vietnam: a scoping review"}, {"paperId": "51ff36f33eb693db5f6e5061a014d48f7eb03f15", "title": "COVID-19 vaccine acceptability among healthcare workers in Yemen."}, {"paperId": "973665743e98dd91514a3a7358fc8e482b8112a9", "title": "COVID-19 Vaccine Hesitancy Worldwide and Its Associated Factors: A Systematic Review and Meta-Analysis"}, {"paperId": "d2b05da1becd35189afc36c1033b406261a8fd82", "title": "Willingness and Perception About COVID-19 Vaccine Among Rural Adults"}, {"paperId": "06432de6958b51fead1dcb5a51582ead6fbccbd1", "title": "Parents’ Concerns, Behavior, Perception, and Hesitancy Regarding COVID-19 Vaccinations for Children in Central Saudi Arabia"}, {"paperId": "f197404c70e0609c3a533d64ea78c16c8f3f3171", "title": "Confirmed cases of COVID-19 after vaccination against COVID in health personnel in Bogotá, Colombia."}, {"paperId": "7e366ccbdd970077b2c7fb4ece70a280c8308164", "title": "The wake of the triple epidemic (Tripledemic): does it emphasizes the COVID-19 vaccine as a routine immunization for children? - A cross-sectional study."}, {"paperId": "974956bde96df6c60cd25d62d980aa00a0f4de0a", "title": "Exploring COVID-19 vaccine uptake among healthcare workers in Zimbabwe: A mixed methods study"}, {"paperId": "fd2b888214b032d8521d2259cca322e73c53bee8", "title": "A Community Based Cross Sectional Study of Healthcare Workers on Non-Governmental Organizations’ Response Towards the Covid-19 Vaccine in Klang Valley"}, {"paperId": "6f9bd0a56a4e8d9c2cb805181b96b1c551eb886b", "title": "Psychological benefits of the COVID‐19 vaccination: A Bangladeshi comparative study"}, {"paperId": "f0390ffd53aa007a8979073cc5a24ab8d6b354cf", "title": "Attitude and Acceptance towards COVID-19 Booster Doses among Literacy Advantaged Population in Pakistan: A Cross-Sectional Study"}, {"paperId": "0aae1723e5463827c799d33ccd675240ceb9e289", "title": "Comparison of Antibody Persistence up to 6 Months after Additional Booster Vaccination with ChAdOx1 nCoV-19 Vaccine"}, {"paperId": "d74ffae7fa3d0169110622b78c20554000168a91", "title": "Choice preference and willingness to pay for COVID-19 vaccination in Namibia"}, {"paperId": "26b7efee5df6d51ba4c8c088f084217124d74bb7", "title": "Utilizing the theory of planned behavior to predict COVID-19 vaccination intention: A structural equational modeling approach"}, {"paperId": "453a8da5ba994c004cac5defa88e67bfaec8cfde", "title": "COVID-19 Booster Doses: A Multi-Center Study Reflecting Healthcare Providers’ Perceptions"}, {"paperId": "eb6ea6fff4c3dfd0620672351c4fbf14a8f313c8", "title": "Fear of COVID-19 disease and vaccination as predictors of vaccination status"}, {"paperId": "1bbc5212720cfb5b25202a5a4dda84241595cbe9", "title": "Entrepreneurial Orientation and Financial Growth of Quoted Pharmaceutical Companies in Nigeria"}, {"paperId": "d4e1a21e950e0336cd3ff58f609aa2d2c83897f5", "title": "Mental health outcomes in physiotherapists in COVID-19 and non-cOVID-19 care units: a cross-sectional survey in Belgium"}, {"paperId": "f2d71f8b9af9a54583f8ee11688242fad3e76258", "title": "Analysis of the mental health status of hospital staff during the COVID-19 pandemic."}, {"paperId": "accd2db858d377b52b3b5845e6f14d21969624a1", "title": "Do psychological distress and digital sports influence the willingness to take the vaccine and precautionary saving? Empirical evidence from Shanghai"}, {"paperId": "a98242905fb0384368ac19e714162b8eb0aa5ca1", "title": "Quantifying the heterogeneous impact of lockdown policies on different socioeconomic classes during the first COVID-19 wave in Colombia"}, {"paperId": "c6c2c020b8afcd9871225a4e80f056ba0fb9e255", "title": "HEALTHCARE WORKERS’ ATTITUDE TOWARD COVID-19 VACCINE IN DUHOK GOVERNORATE"}, {"paperId": "c3d53d2b5e0f83fd57233b266aa33d21d5cab7bb", "title": "Does the Covid-19 Vaccine Guarantee Students in Indonesia Willing to Study Offline?"}, {"paperId": "0cc2c7b673fe5b64d510cfcc5c02cc60cd19eb1e", "title": "A Qualitative Comparative Analysis to explore the predictors of individuals’ willingness towards vaccination"}, {"paperId": "67762234073a286aeb62c734e827f8d9895a19e1", "title": "Psychological symptoms and correlates of Chinese healthcare professionals in the intensive care unit before and after the COVID-19 outbreak: A comparison of two cross-sectional studies"}, {"paperId": "8d08f635cc122ea4943751a14927d0314e92f78b", "title": "COVID-19 booster vaccination uptake and infection breakthrough amongst health care workers in Wales: A national prospective cohort study"}, {"paperId": "379a7b6f76bdad377e4757eecef76132dbe5a443", "title": "Perception and Acceptance of COVID-19 Vaccine Among Nurses in Jordan"}, {"paperId": "912884559502921d856f7511856ff9193ce087d8", "title": "Psychological correlates of COVID safety protocol adherence among university students"}, {"paperId": "5c5682b7b991746992c49bf073a34631df247f71", "title": "The challenge of community mental health interventions with patients, relatives, and health professionals during the COVID-19 pandemic: a real-world 9-month follow-up study"}, {"paperId": "993dddee673a808ab211c8d288803f848d455129", "title": "Continued demographic shifts in hospitalised patients with COVID-19 from migrant workers to a vulnerable and more elderly local population at risk of severe disease"}, {"paperId": "e5e11e01d2b3775f33d03a404c873422655e1ee4", "title": "COVID-19 Vaccination Policy: A Study on Street Level Bureaucracy and Local Government"}, {"paperId": "cb37a9349865f2cf5642e0b6430dfbfc0e69e56a", "title": "Mandatory COVID-19 vaccination for healthcare workers: A discussion paper"}, {"paperId": "7bf03d3e3e8eeaa5a98561e884c029c8913aecd1", "title": "Acceptance of COVID-19 vaccine and associated factors among health care workers at public hospitals in Eastern Ethiopia using the health belief model"}, {"paperId": "e7e841c346f176a32283e1a430bd7a0f78741e0e", "title": "The impact of COVID-19 pandemic on the quality of life of healthcare workers and the associated factors: A systematic review"}, {"paperId": "dd361f9c29703b4273d7efd176d55ad5e468ee35", "title": "Exploring the beliefs and experiences with regard to COVID-19 vaccine hesitancy and acceptance in a slum of Karachi, Pakistan"}, {"paperId": "f67c2385273d8fcc11c9d8585d49352350f70d9f", "title": "The Willingness of Parents to Vaccinate Their Children Aged from Five to under Twelve Years with COVID-19 Vaccines between February and March 2022 in Vietnam"}, {"paperId": "9baca6173941d5c799820773453d93b88b4d98f2", "title": "Simulation and forecasting models of COVID-19 taking into account spatio-temporal dynamic characteristics: A review"}, {"paperId": "67f6dd080ff6c3fca8fcd3035db5a5cb7ada943a", "title": "Healthcare Workers and Nonhealthcare Workers Pro-Vaccination Attitude and Its Associated Factors towards COVID-19 Vaccine Globally: A Systematic Review and Meta-Analysis"}, {"paperId": "c8b74734ef809ebef041a7fd2650e7887960b191", "title": "Impfbereitschaft von Krankenhauspersonal in Deutschland: Welche Rolle spielen Verschwörungsannahmen zu COVID-19?"}, {"paperId": "47b1f3208c79f398ddb2da70afba84061372b2f7", "title": "Motivators and barriers to COVID-19 vaccination of healthcare workers in Latvia"}, {"paperId": "0f7bfdf90987dc937a2866ff00e4001e257b6a37", "title": "COVID-19 Vaccination Willingness in Four Asian Countries: A Comparative Study including Thailand, Indonesia, the Philippines, and Vietnam"}, {"paperId": "3e82dcdd6dc756a9855bc4885db77b9b83bf1d9f", "title": "Acceptance of coronavirus disease 2019 (COVID-19) vaccines among healthcare workers: A meta-analysis"}, {"paperId": "b370dc4fb12bdd2462f2125c54778d59feaef98f", "title": "The Willingness to get Vaccinated Against SARS-CoV-2 Virus among Southeast Asian Countries: Does the Vaccine Brand Matter?"}, {"paperId": "bc10ae8ad2b3d004469e481bf47ae4bc7e463a8c", "title": "Mapping the Prevalence of COVID-19 Vaccine Acceptance at the Global and Regional Level: A Systematic Review and Meta-Analysis"}, {"paperId": "4cea015f2122915320640ef9593e5f116bfc0712", "title": "The prevalence of COVID vaccine acceptance among pregnant women: A systematic review and meta-analysis"}, {"paperId": "38b8f42b57fa3770e1473d7d04bb9fff942190cb", "title": "COVID-19 vaccination acceptance in Jambi City, Indonesia: A single vaccination center study"}, {"paperId": "859948bae4126e1155a8ee8e0b23e42f63c6e63f", "title": "Stress, anxiety, and depression in professional graduate students during COVID 19 pandemic"}, {"paperId": "f1d6bad786a3b99dc852c990c5201f4559628a2b", "title": "Association of COVID-19 vaccine attitudes and cognitions of COVID-19-related stigma with vaccine hesitancy among college students"}, {"paperId": "41045481c6bf487285f02bfbe8fd577e77faaa60", "title": "Misperception of Vaccine Acceptance to the COVID-19 Vaccine in Indonesia: A Systematic Review"}, {"paperId": "2eafac1f15c746300baa900dd50f81adaf505a43", "title": "Prevalence and Determinants of COVID-19 Vaccine Acceptance Among Healthcare Workers: A Systematic Review"}, {"paperId": "eb6b8472fdeed5833bb831e939dac8977aa3469a", "title": "Factors Affecting the Psychological Well-Being of Health Care Workers During the COVID-19 Crisis"}, {"paperId": "a42e4b4a3b7d42168ae99d05ae3bbd92ca6bb278", "title": "COVID-19 vaccination hesitancy in Italian healthcare workers: a systematic review and meta-analysis"}, {"paperId": "71f73af28de764241987e406deb831c8967745d0", "title": "Evaluation of hygiene measures at a series of mass gathering events during the COVID-19 pandemic"}, {"paperId": "db76bd744c89455934b97e89bffdc9730269edbf", "title": "Assessing COVID-19 Vaccine’s Acceptability Amongst Health Care Workers in Oman: A cross-sectional study"}, {"paperId": "28e9167a04b3bb8d1898736f3002c088250e5532", "title": "COVID-19 Vaccination Hesitancy among Healthcare Workers—A Review"}, {"paperId": "0291470a1c0a1ab7044e77fa8cec2f23325f3304", "title": "COVID-19 vaccination acceptance in Jambi City, Indonesia: A single vaccination center study"}, {"paperId": "71c35d90b14eff5c7e00234fcc24af8c0b9a64c4", "title": "Opt-out policy and its improvements promote COVID-19 vaccinations"}, {"paperId": "cd696d1688ef2595d0b344ecb5679e01d58a8e98", "title": "Behavioural determinants of COVID-19 vaccination acceptance among healthcare workers: a rapid review"}, {"paperId": "37f50c32a25c658156e41f9512c1de8b3e8b4422", "title": "Acceptance of the COVID-19 vaccine based on the health belief model: a multicenter national survey among medical care workers in China"}, {"paperId": "fea70ac4d7d705291c28af1ffc4d1130bc42a91e", "title": "How do people get information for COVID‐19 according to age groups?"}, {"paperId": "78a1c4d271ae8b3ac38f672809a6295a2103ea57", "title": "Using Integrative Behavior Model to Predict COVID-19 Vaccination Intention among Health Care Workers in Indonesia: A Nationwide Survey"}, {"paperId": "09758bbc8fe94e7185bff0c14b44bb5ee6a6a52d", "title": "COVID-19 vaccination hesitancy and attitude post-initiation of vaccination drive, a cross-sectional study across Odisha"}, {"paperId": "e8a96d85c1c055e02dc61fd9f64229f108ea53fd", "title": "PERCEPTION OF CONTROL, DISEASE, AND VACCINE FOR COVID-19: THE EXAMPLE OF HEALTHCARE PROFESSIONALS"}, {"paperId": "381e9bbd79b37bd8d21c461c28feaebcc2be0327", "title": "Prevalence and Influencing Factors of Vicarious Traumatization among Frontline Healthcare Workers during COVID-19 Pandemic"}, {"paperId": "8575baa07005a21b4db8b75df67283a82e181aed", "title": "Assessing public knowledge, attitudes and determinants of third COVID-19 vaccine booster dose acceptance: current scenario and future perspectives"}, {"paperId": "8ae4d40fd83c44ea2e27f8810fd9b05db3cf3cac", "title": "A Global Survey of COVID-19 Vaccine Acceptance Among Healthcare Workers"}, {"paperId": "7522fe6c90a5a107f37836af692309d4f66ae70f", "title": "Preparation for COVID‐19 vaccines rollout: Interventions to increase trust, acceptability, and uptake in West African countries"}, {"paperId": "bab22ce4d884710bed26f77cb651795891c68f9a", "title": "COVID-19 Vaccine Refusal among Nurses Worldwide: Review of Trends and Predictors"}, {"paperId": "c028fccda456c68b8e51d602d33d5d2cc9e57354", "title": "COVID-19 Vaccine Acceptance among ASEAN Countries: Does the Pandemic Severity Really Matter?"}, {"paperId": "372f056b00cf8ad080f16fff7cb9854fe13e0d34", "title": "Knowledge, attitudes, and perceptions of COVID-19 vaccine and refusal to receive COVID-19 vaccine among healthcare workers in northeastern Ethiopia"}, {"paperId": "0f95a6a4a0d40ef5829fe328f1f0f2094b618e78", "title": "Psychosocial responses to COVID-19 among nurses in two hospitals: a mixed method study at Eastern Nepal"}, {"paperId": "489a45d16883d3bf26fec207b2fbb66e51102017", "title": "Predictors and Perceptions of Healthcare Workers Regarding Vaccines Safety in the Initial Phase of COVID-19 Vaccination Drive in Western Part of India: A Regression Analysis"}, {"paperId": "77f899781da6b6b93646ea32ff50532c477eb95c", "title": "The road to achieving herd immunity: factors associated with Singapore residents’ uptake and hesitancy of the COVID-19 vaccination"}, {"paperId": "8c91a6c7b4d43b04d793c6496348d313c631d188", "title": "‘Why Should I Take the COVID-19 Vaccine after Recovering from the Disease?’ A Mixed-methods Study of Correlates of COVID-19 Vaccine Acceptability among Health Workers in Northern Nigeria"}, {"paperId": "25a32b68922b8fa5431e0d0d24664ff9377a31e0", "title": "Willingness to COVID-19 vaccination: Empirical evidence from EU"}, {"paperId": "54b0fd00e7b2520d37db207c978c281d3420abcd", "title": "Identification of vaccination experience and understanding of Indonesian society"}, {"paperId": "8579ea26bb5d0ab442dcaf5b7c702fd4d5723d6a", "title": "After Over a Year of Pandemic: Mental Well-being and Life Satisfaction of Filipino College Students"}, {"paperId": "237173919ae8fdf189ef72f45a58e19007f3da68", "title": "The influence of social network on COVID-19 vaccine hesitancy among healthcare workers: a cross-sectional survey in Chongqing, China"}, {"paperId": "c8f0178c4ef24c0e8412263a2def8c3e20f1d0fd", "title": "To vaccinate or not to vaccinate!? Predictors of willingness to receive Covid-19 vaccination in Europe, the U.S., and China"}, {"paperId": "ed8b995736a8bbc2c2be5e382e2ed3a20ab787b8", "title": "Control and Prevention of the COVID-19 Epidemic in China: A Qualitative Community Case Study"}, {"paperId": "f1c225f572de886bdcd937088b9bebc29aa537c0", "title": "Autopsy Findings and Causality Relationship between Death and COVID-19 Vaccination: A Systematic Review"}, {"paperId": "8b05f6749b4c76b84b2457a0e8d95abe64bdf7f3", "title": "Psychological factors affecting COVID-19 vaccine acceptance in Indonesia"}, {"paperId": "0f9f6ebbfeebebb1f5757ce65e18c5bfec5ea935", "title": "Psychosocial effects of the quarantine during the first wave of the COVID-19 pandemic on the residents of the island of Brač"}, {"paperId": "105cb40c4f1aa86cced3e25cd62b09efea371c4b", "title": "SVEIKATOS PRIEŽIŪROS ORGANIZACIJŲ DARBUOTOJŲ NUSITEIKIMAS SKIEPYTIS COVID-19 VAKCINA: SISTEMINĖ LITERATŪROS APŽVALGA IR METAANALIZĖ"}, {"paperId": "0ab1875789f9aebd6a4dafc805b131eb56074f82", "title": "COVID-19 vaccine uptake among health care workers in Ghana: a case for targeted vaccine deployment campaigns in the global south"}, {"paperId": "cbbe1abbc0a622965a8f838ecd2c92e564924ea6", "title": "A Text Mining-Based Survey of Pre-Impressions of Medical Staff toward COVID-19 Vaccination in a Designated Medical Institution for Class II Infectious Diseases"}, {"paperId": "d187a9ce59e91fb9e33e59563ce41aa69c4a7ea6", "title": "COVID-19 Vaccine Hesitancy in Healthcare Personnel: A University Hospital Experience"}, {"paperId": "5187db8e6c42044a7660685b8576d0604dc1c880", "title": "COVID-19 Vaccine Hesitancy and Attitude toward Booster Doses among US Healthcare Workers"}, {"paperId": "63e699e82042e6c76238d9be47071747ec2d453d", "title": "Sentiments Regarding COVID-19 Vaccination among Graduate Students in Singapore"}, {"paperId": "b24d7a59e8ff8db53cfff11e46a57193bdeac40e", "title": "COVID-19 vaccination hesitancy and associated factors among solid organ transplant recipients in China"}, {"paperId": "b4b7699974783d59ac2e77070dda290d41f9e04b", "title": "Acute myocardial infarction and myocarditis following COVID-19 vaccination"}, {"paperId": "1eea1037d90738c153c6005fee80dafb43e1d8f8", "title": "Patterns and predictors of adolescent life change during the COVID-19 pandemic: a person-centered approach"}, {"paperId": "8a447675c853f6efe9c96739faa2717b2d0bdd83", "title": "Health Beliefs in Association with Behaviors in Compliance with COVID-19 Public Health Guidelines: A Cross-sectional Study"}, {"paperId": "2a9098edc68266fa5b1d976966f9136d1fd52286", "title": "Attitudes, acceptance and hesitancy among the general population worldwide to receive the COVID-19 vaccines and their contributing factors: A systematic review"}, {"paperId": "7544f189b0d7f80d93bfe1848e3ba1f23b73a0c7", "title": "COVID-19 vaccine acceptance in South Asia: a multi-country study"}, {"paperId": "7aa9b71f59c428dc1a16d512a3f925f31ae01075", "title": "Oxford COVID-19 Vaccine Hesitancy in School Principals: Impacts of Gender, Well-Being, and Coronavirus-Related Health Literacy"}, {"paperId": "223116985e147aee3c22041267d033cb16427a59", "title": "Awareness, Attitude, and Acceptability of Healthcare Workers About COVID-19 Vaccination in Western India"}, {"paperId": "e280e5442a382a88f37c207879b90b4482dc0d9f", "title": "COVID-19 vaccine coverage, concerns, and preferences among Chinese ICU clinicians: a nationwide online survey"}, {"paperId": "2a5c4064d79f162ce763196f1b29a2c48660748e", "title": "Risk Factors of Psychological Disorders After the COVID-19 Outbreak: The Mediating Role of Social Support and Emotional Intelligence"}, {"paperId": "3bb6f5fedb442627d26abfe53672efb05ad9f561", "title": "Attitudes toward COVID-19 vaccination and willingness to pay: comparison of people with and without mental disorders in China"}, {"paperId": "de0be37ac604d49c6e2bd4c40be3c6bc1a9de808", "title": "Mental health outcomes among health‐care workers in Oman during COVID‐19: A cluster analysis"}, {"paperId": "22cd14c625d156663bc58cf371a166566461bbcc", "title": "Vaccination status, acceptance, and knowledge toward a COVID-19 vaccine among healthcare workers: a cross-sectional survey in China"}, {"paperId": "c8b4248c12c20a4aebd43112ea8962396fb9d4c7", "title": "Association between contact with a general practitioner and depressive symptoms during the COVID-19 pandemic and lockdown: a large community-based study in Hangzhou, China"}, {"paperId": "d50d4c298e2d6118d70874169d232bceee1aedad", "title": "Hesitant or Not Hesitant? A Systematic Review on Global COVID-19 Vaccine Acceptance in Different Populations"}, {"paperId": "8bb453d1f1b0d8166bdac8e156095e53a7642100", "title": "Perception, Preventive Practice, and Attitude Towards Vaccine Against COVID-19 Among Health Care Professionals in Bangladesh"}, {"paperId": "37e33d8e7d343984a8317a7eac3a7d6b41e19657", "title": "Preventive behaviours and family inequalities during the COVID-19 pandemic: a cross-sectional study in China"}, {"paperId": "2466cf798096415b649d4239a71e1075aeaca099", "title": "Teachers’ Mental Health and Self-Reported Coping Strategies During the COVID-19 Pandemic in Ecuador: A Mixed-Methods Study"}, {"paperId": "de6dff41ed1b76012ea004044eff4fb8879fad56", "title": "The SARS-CoV-2 Vaccine Hesitancy Among the General Population: A Large Cross-Sectional Study From Kuwait"}, {"paperId": "8895421e3a924f824731bfb25871720902982da1", "title": "COVID-19 vaccination hesitancy in students and trainees of healthcare professions: A global assessment and call for action"}, {"paperId": "d51d2e227360de69b3bd194daeedcdbccc18c2b7", "title": "A pre-COVID-19 assessment of aspects of the school health programme in some selected Nigerian primary schools: implications for school re-opening during the COVID-19 pandemic in developing country contexts"}, {"paperId": "7606cbcd5202cd4b7a8fbd9f19781c365aa1aacc", "title": "Age, frequency of volunteering, and Present-Hedonistic time perspective predict donating items to people in need, but not money to combat COVID-19 during lock-down"}, {"paperId": "dd2564121578fcfd06cfbc34bf803039f15c89e6", "title": "A Comparative Study on the Psychological Health of Frontline Health Workers in Wuhan Under and After the Lockdown"}, {"paperId": "b0c30a07755e1822af83a76599ce5dc833ff6546", "title": "Prevalence and predictors of anxiety, depression and stress among university students during the period of the first lockdown in Germany"}, {"paperId": "b740cae6e517c58c7b4c7cb72515fbe65b24c56c", "title": "Effect of the COVID-19 outbreak and lockdown on mental health among post-secondary students in the Grand Est region of France: results of the PIMS-CoV19 study"}, {"paperId": "189d722d3cf016d61d74d6e07c50fdc5c53192d8", "title": "Acceptability of Healthcare Professionals to Get Vaccinated against COVID-19 Two Weeks before Initiation of National Vaccination"}, {"paperId": "4d3f867813baa3d95143a9941e76fc1323bee85d", "title": "MAROCOVID: Snapshot Monitoring of Knowledge and Perceptions of Safety Behaviors during the COVID-19 Outbreak in Morocco"}, {"paperId": "1497e7ef43447f01ffb42240ad8b29825526b4c0", "title": "Side Effects and Perceptions Following COVID-19 Vaccination in Jordan: A Randomized, Cross-Sectional Study Implementing Machine Learning for Predicting Severity of Side Effects"}, {"paperId": "95f79ba92451ac5948d809e30d91188f20623cae", "title": "Healthcare workers’ distress and perceived discrimination related to COVID‐19 in Colombia"}, {"paperId": "dcca76905ab4dac402ea7fee17e4033464dfeb6c", "title": "Changes in mental health during the COVID-19 crisis in Romania: A repeated cross-section study based on the measurement of subjective perceptions and experiences"}, {"paperId": "9043b327de985171004b86da4f02dafaeaeac7bd", "title": "Depression, anxiety and stress among Australian nursing and midwifery undergraduate students during the COVID-19 pandemic: a cross-sectional study"}, {"paperId": "f6c8ce658af1ae6a153790642834b53d2d31fc7f", "title": "The effects of COVID-19 information sources and knowledge, attitudes, and behavior on vaccination acceptance"}, {"paperId": "8336d1d8665d99dbbb3bc24ec156fa5a2a0029a3", "title": "Perception of Covid-19 Vaccine and Vaccination"}, {"paperId": "cd160a3b77e2eeaee50aaab71e550397113fe71f", "title": "The impact of COVID-19 pandemic on the quality of life of healthcare workers and the associated factors: A systematic review"}, {"paperId": "078fe09225f640687afff996ea8de3f98d37f32c", "title": "COVID-19 Vaccination Monitoring Using IoT and Machine Learning "}, {"paperId": "c614c3476c732517e61e098a0f70c2dd95880944", "title": "Factors Affecting the Psychological Well-Being of Health Care Workers During the COVID-19 Crisis"}, {"paperId": "61d9e6de10745f1236fd8925da0c94ad0909824c", "title": "Predictors of vaccination against coronavirus disease 2019 in Serbia"}, {"paperId": "2e6e4e58bb7db8fee2afd93e68ff3e1ef1a14ab0", "title": "International Journal of Public Health Science (IJPHS)"}, {"paperId": "672dfa396eb67135152f5d94e02b7e077e16adcc", "title": "Factors affecting healthcare worker COVID-19 vaccination acceptance and uptake: a living behavioural science evidence synthesis (v2, May 18th, 2021)"}, {"paperId": "b86cf5693a83ef37e0535912bcfca77a0f5f67a3", "title": "Factors affecting healthcare worker COVID-19 vaccination acceptance and uptake : a living behavioural science evidence synthesis ( v 1 . 0 , March 31 st , 2021 )"}, {"paperId": "f957c1066e3f828c62c49254746f71bb41b3918f", "title": "Readiness to Receive COVID-19 Vaccine of General Population, Healthcare Workers and Medical Students in Jeddah Saudi Arabia"}, {"paperId": "01c153158fb84c897c08ba98cfbba5327479ac68", "title": "Legal Implications Of Being A Prostitute Amid Covid-19: A Gender-Based Research In Thailand"}, {"paperId": "8a6ea7bdda0b8e17a00a42810cda91b821bb3cfa", "title": "PRBM_A_314844 933..944"}, {"paperId": "0ba8d99b0d1f1cb41d21f5e2c12848ebb2d40377", "title": "RMHP_A_336039 4907..4922"}, {"paperId": "32ba13488d9516db6918bb06835d5cfc356a0987", "title": "The Perceptions of Healthcare Workers about the COVID 19 Vaccine, Baghdad, Iraq, 2021"}]}
