{"paperId": "2b5602e65b413a0123fc024337122733e38cc7bb", "publicationVenue": null, "title": "Decentralized Learning Made Easy with DecentralizePy", "abstract": "Decentralized learning (DL) has gained prominence for its potential benefits in terms of scalability, privacy, and fault tolerance. It consists of many nodes that coordinate without a central server and exchange millions of parameters in the inherently iterative process of machine learning (ML) training. In addition, these nodes are connected in complex and potentially dynamic topologies. Assessing the intricate dynamics of such networks is clearly not an easy task. Often in literature, researchers resort to simulated environments that do not scale and fail to capture practical and crucial behaviors, including the ones associated to parallelism, data transfer, network delays, and wall-clock time. In this paper, we propose decentralizepy, a distributed framework for decentralized ML, which allows for the emulation of large-scale learning networks in arbitrary topologies. We demonstrate the capabilities of decentralizepy by deploying techniques such as sparsification and secure aggregation on top of several topologies, including dynamic networks with more than one thousand nodes.", "venue": "EuroMLSys@EuroSys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-04-17", "journal": {"name": "Proceedings of the 3rd Workshop on Machine Learning and Systems"}, "authors": [{"authorId": "1588512022", "name": "Akash Dhasade"}, {"authorId": "1723331", "name": "Anne-Marie Kermarrec"}, {"authorId": "117200775", "name": "Rafael Pires"}, {"authorId": "1628266066", "name": "Rishi Sharma"}, {"authorId": "2214580212", "name": "Milos Vujasinovic"}], "citations": [{"paperId": "f82995a37e66a7790157d673e52b1c9bae4e767a", "title": "Low-Cost Privacy-Aware Decentralized Learning"}, {"paperId": "7bc4857e9256adf472a2d95e7f487a7c10631b67", "title": "Epidemic Learning: Boosting Decentralized Learning with Randomized Communication"}, {"paperId": "2666a0c71932bbb751a0392865fc3bf1494e0173", "title": "Get More for Less in Decentralized Learning Systems"}]}
