{"paperId": "2b69b9c0a93f9febfdc2655eb44853df937572ca", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Design Methodology of Microservices to Support Predictive Analytics for IoT Applications", "abstract": "In the era of digital transformation, the Internet of Things (IoT) is emerging with improved data collection methods, advanced data processing mechanisms, enhanced analytic techniques, and modern service platforms. However, one of the major challenges is to provide an integrated design that can provide analytic capability for heterogeneous types of data and support the IoT applications with modular and robust services in an environment where the requirements keep changing. An enhanced analytic functionality not only provides insights from IoT data, but also fosters productivity of processes. Developing an efficient and easily maintainable IoT analytic system is a challenging endeavor due to many reasons such as heterogeneous data sources, growing data volumes, and monolithic service development approaches. In this view, the article proposes a design methodology that presents analytic capabilities embedded in modular microservices to realize efficient and scalable services in order to support adaptive IoT applications. Algorithms for analytic procedures are developed to underpin the model. We implement the Web Objects to virtualize IoT resources. The semantic data modeling is used to promote interoperability across the heterogeneous systems. We demonstrate the use case scenario and validate the proposed design with a prototype implementation.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "33518439", "name": "Sajjad Ali"}, {"authorId": "10372764", "name": "M. Jarwar"}, {"authorId": "3344348", "name": "I. Chong"}], "citations": [{"paperId": "9ccab66055c87291729113208a3cb7cdc5c1b4f2", "title": "FedMicro-IDA: A federated learning and microservices-based framework for IoT data analytics"}, {"paperId": "474704915b1b0a41185f65be13afd3e9ebe9336d", "title": "Federated Learning Model for Contextual Sensitive Data Quality Applications: Healthcare Use Case"}, {"paperId": "bf07be5eaa4bd2a2f6935195c706a570ae452160", "title": "The Role of Microservices in the Internet of Things: Applications, Challenges, and Research Opportunities"}, {"paperId": "b85309d9b63302c07043b8156a936d00cb22eb4a", "title": "“Scale without mass”: A decision-making tool for scaling remanufacturing practices in the white goods industry"}, {"paperId": "3886e9ca15d131eea97a208010418ddd74171a6a", "title": "An Examination of Virtualization Technologies for Enabling Intelligent Edge Computing"}, {"paperId": "514a96af287ab19a399479f91ae91a28b1593c5c", "title": "AI-Enabled Secure Microservices in Edge Computing: Opportunities and Challenges"}, {"paperId": "49dc8286ca635602733df894fe179ed5a0473f53", "title": "Wrapper Functions for Integrating Mathematical Models into Digital Twin Event Processing"}, {"paperId": "e84f9741fc7b63ff85bb37137b0e944c25596f0a", "title": "Containerized Architecture Performance Analysis for IoT Framework Based on Enhanced Fire Prevention Case Study: Rwanda"}, {"paperId": "3a06697bc772f91db9aaf43a7f5a5f10569677f9", "title": "Demystifying the digital transition of remanufacturing: A systematic review of literature"}, {"paperId": "2ff6f7839ef147bfabb58c8f9db151bf442cd448", "title": "Supercomputing Enabled Deployable Analytics for Disaster Response"}, {"paperId": "a0d1da423621b0bd3ed3ae9802903a7b9cde8f3a", "title": "Semantic Microservice Framework for Digital Twins"}, {"paperId": "f1ad6f699fecd7e2b4803b75d16d0eb2274176a0", "title": "A microservices persistence technique for cloud-based online social data analysis"}, {"paperId": "211b571e2aee2783eccfbd6281f846c6b5c559df", "title": "A TRANSFORMAÇÃO DIGITAL SOB A ÓTICA DA ENGENHARIA DO CONHECIMENTO: UMA REVISÃO SOBRE O USO DE ONTOLOGIAS COMO MODELO"}, {"paperId": "78895554357bb3d3cf8023dee0ab2343f55655cf", "title": "Leveraging Deep Learning and IoT big data analytics to support the smart cities development: Review and future directions"}, {"paperId": "5b635e1fb8752ce90cc795da4759d4233f18bf61", "title": "Diminishing Returns and Deep Learning for Adaptive CPU Resource Allocation of Containers"}, {"paperId": "c492de27889f17f9e6eebf15cee612f6685d0bb3", "title": "An Internet of Things Model for Improving Process Management on University Campus"}, {"paperId": "980e714a0fcb3daee0a4ef2e21960feb048f7390", "title": "Web Objects Based Contextual Data Quality Assessment Model for Semantic Data Application"}, {"paperId": "591aec36af03c6931e13163f2ec329eac35bd51a", "title": "Microservices based Framework to Support Interoperable IoT Applications for Enhanced Data Analytics"}, {"paperId": "03c4c2950392456e872957ee9b641bfc03aed96d", "title": "Microservices based Linked Data Quality Model for Buildings Energy Management Services"}, {"paperId": "d7572fb855bae2bc511144fe58465090dcf546bd", "title": "Architecturing Elastic Edge Storage Services for Data-Driven Decision Making"}, {"paperId": "f0110dfa29993387ea86e8e0312705aff03cdc5f", "title": "A Microservices Model to Enhance the Availability of Data for Building Energy Efficiency Management Services"}, {"paperId": "a98dca07fb7c58cb5d5b439ce032ff4991271400", "title": "Logistic Model to Support Service Modularity for the Promotion of Reusability in a Web Objects-Enabled IoT Environment"}, {"paperId": "09d38cd92ca68c4ccfd2985a3a31911d6e6b513a", "title": "Microservices for Data Analytics in IoT Applications: Current Solutions, Open Challenges, and Future Research Directions"}, {"paperId": "3dfef8e06ac0b4db527a3db4d2c81765c391de9e", "title": "Involving Stakeholders in the Implementation of Microservice-Based Systems: A Case Study in an Ambient-Assisted Living System"}, {"paperId": "72bf3f16a72f5b5177ce2ede3f36f9d1057ed1aa", "title": "Web based Microservice Framework for Survival Analysis of Lung Cancer Patient using Digital Twin"}, {"paperId": "dcd57852eb79c77901cce608f98cc67a694d612e", "title": "A microservice architecture for predictive analytics in manufacturing"}, {"paperId": "0d292640d1fd677bbad16313619cb5ab1261d0db", "title": "Architectural ML Framework for IoT Services Delivery Based on Microservices"}, {"paperId": "ecbda9cf24f91f086573e2bc2bdd5b9be214398f", "title": "Web Crawling Search Prevention with Captcha"}]}
