{"paperId": "2b69d57d04ae5f528c04d737882c41607e1f6b24", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "Identifying Performance Bottleneck in Shared In-Network Aggregation during Distributed Training", "abstract": "As the emergence of recently popular large language model, distributed training (DT) optimizes the performance via using different parallelization strategies, resource schedulers and advanced compression techniques. Meanwhile, a promising acceleration primitive, In-Network Aggregation (INA), offloads the gradient aggregation to programmable switches to further reduce the communication overhead using the switch memory. However, to the best of our knowledge, how to identify the performance bottleneck in real time remains challenging. In this paper, we build Argus, a performance bottleneck monitoring framework for INA. Argus implements an aggregation digest extracting mechanism for real-time monitoring of DT jobs at the multi-tenant, multi-rack clusters. Argus models aggregation to identify performance bottlenecks in aggregation, which assists the scheduler in deciding the resource allocation. Extensive evaluation and prototype implementation show that Argus provides real-time and packet-level aggregation monitoring for identifying bottlenecks in INA with minimal performance overhead.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE 29th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "38-45"}, "authors": [{"authorId": "2293780055", "name": "Chang Liu"}, {"authorId": "11101465", "name": "Jiaqi Zheng"}, {"authorId": "2274899153", "name": "Wenfei Wu"}, {"authorId": "2237082299", "name": "Bohan Zhao"}, {"authorId": "2293637662", "name": "Wei Nie"}, {"authorId": "2293641265", "name": "Xiaoyu Yi"}, {"authorId": "2266805280", "name": "Guihai Chen"}], "citations": []}
