{"paperId": "2b74f3e01ec4f6fd9b683790157eec037f9a1488", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Evaluation of Susceptibility by Mass Movements through Stochastic and Statistical Methods for a Region of Bucaramanga, Colombia", "abstract": "Mass movements are one of the hydrometeorological phenomena with the most negative impacts on the study area, and their evaluation through the calculation of susceptibility provides a tool of vital importance within territorial planning and disaster risk management on natural and anthropic environments. Their evaluation took algorithms designed within stochastic and statistical methods, such as the artificial neural network, the bivariate statistical method, and the logistic regression method, which integrate inherent variables (geoenvironmental characterization) against events or dependent variables. This correlation simulates regions with a probability of occurrence of mass movement under training or weight assignment. Its construction for this study took, as a basis, 50% of the events (test) and 50% of the events (validation) randomly and with equivalent area distribution against the inherent variables. As a result, it was observed that the bivariate method presented a good performance in spatial prediction. This model presents values of AUC = 82.2% (test) and AUC = 76.9% (validation), grouping a total of 591 events of the 856 events in the high category (69%). In turn, from a second evaluation carried out by this method to each hydrographic basin, a condition was established in the area (50 km2) for coherent results at a level of analysis 1:25,000, based on the idea that the variables do not present changes greater than 20% in their attributes, added to a knowledge of the area evaluated.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-16", "journal": {"name": "Remote. Sens.", "pages": "4567", "volume": "15"}, "authors": [{"authorId": "2218037194", "name": "Joaquín Andrés Valencia Ortiz"}, {"authorId": "1402913148", "name": "A. Martínez-Graña"}, {"authorId": "2244494887", "name": "Lenny Mejía Méndez"}], "citations": [{"paperId": "6805ba2626b9c055caa8b5dfa6738bc029ca2aef", "title": "DInSAR Multi-Temporal Analysis for the Characterization of Ground Deformations Related to Tectonic Processes in the Region of Bucaramanga, Colombia"}]}
