{"paperId": "2b75478afae209103e8beddf353abe677e84c9ba", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Comprehensive Review on Development of Smart Cities Using Industry 4.0 Technologies", "abstract": "Smart Cities (SCs) have recently opened new lifestyles as they introduce effective approaches for improving urban management. These cities integrate Industry 4.0 technologies and new organizations into a social and technical system. A Smart City (SC) finally aims to integrate urban business, transportation, water, energy, and other subsystems by analyzing the data collected from sensors and Information and Communication Technology (ICT). In this regard, the current article proposes a hybrid structure based on Cloud Computing (CC), cloud processing, and internet technology to develop and manage SCs and urban planning. Moreover, the development and analysis of sensors to construct an SC, as well as supporting technologies, are addressed. Therefore, the present research is focused on defining and reviewing large data and objects of the Internet and CC to identify the current challenges and limitations. This research, thus, introduced a novel approach in the context of the Internet of objects, whose data are gathered from different geographic locations through devices and sensors to be used in a new system. CC services in a city can analyze and make smart decisions to optimally manage SCs and improve the welfare of citizens. This study consequently sets the path for further investigation into the problems and difficulties associated with Big Data (BD) applications in SCs.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "91981-92030", "volume": "11"}, "authors": [{"authorId": "2027662453", "name": "Marieh Talebkhah"}, {"authorId": "32649968", "name": "A. Sali"}, {"authorId": "46697581", "name": "M. Gordan"}, {"authorId": "145194679", "name": "S. Hashim"}, {"authorId": "3310398", "name": "F. Rokhani"}], "citations": [{"paperId": "b44edcbb6a9071ba24d385772a1294c16a5cd2cb", "title": "Predictive Maintenance for IoT-Enabled Smart Cities using Recurrent Neural Networks"}]}
