{"paperId": "2b76b31eb9008e8209b76a9626d24aa2f9a06018", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Adaptive Online Cache Capacity Optimization via Lightweight Working Set Size Estimation at Scale", "abstract": "Big data applications extensively use cache techniques to accelerate data access. A key challenge for improving cache utilization is provisioning a suitable cache size to fit the dynamic working set size (WSS) and understanding the related item repetition ratio (IRR) of the trace. We propose Cuki, an approximate data structure for e ffi ciently estimating online WSS and IRR for variable-size item access with proven accuracy guarantee. Our solution is cache-friendly, thread-safe, and light-weighted in design. Based on that, we design an adaptive online cache capacity tuning mechanism. Moreover, Cuki can also be adapted to accurately estimate the cache miss ratio curve (MRC) online. We built Cuki as a lightweight plugin of the widely-used distributed file caching system Alluxio. Evaluation results show that Cuki has higher accuracy than four state-of-the-art algorithms by over an order of magnitude and with better stability in performance. The end-to-end data access experiments show that the adaptive cache tuning framework using Cuki reduces the table querying latency by 79% and improves the file reading throughput by 29% on average. Compared with the cutting-edge MRC approach, Cuki uses less memory and improves accuracy by around 73% on average. Cuki is deployed on one of the world’s largest social platforms to run the Presto query workloads.", "venue": "USENIX Annual Technical Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "467-484"}, "authors": [{"authorId": "2163400100", "name": "Rong Gu"}, {"authorId": "2223318601", "name": "Simian Li"}, {"authorId": "1799298", "name": "Haipeng Dai"}, {"authorId": "2113289253", "name": "Hancheng Wang"}, {"authorId": "2118265565", "name": "Yili Luo"}, {"authorId": "2180234793", "name": "Bin Fan"}, {"authorId": "51294444", "name": "Ran Ben Basat"}, {"authorId": "2223158792", "name": "Ke Wang"}, {"authorId": "2223404644", "name": "Zhenyu Song"}, {"authorId": "30169614", "name": "Shouwei Chen"}, {"authorId": "2117783202", "name": "Beinan Wang"}, {"authorId": "46844324", "name": "Yihua Huang"}, {"authorId": "2144043665", "name": "Guihai Chen"}], "citations": [{"paperId": "876d250c259278e36a1c96f500968e4f792f6fd7", "title": "Variable-length Encoding Framework: A Generic Framework for Enhancing the Accuracy of Approximate Membership Queries"}, {"paperId": "6680bcc95154032b4cf300ae461745de427e7113", "title": "MoonKV: Optimizing Update-intensive Workloads for NVM-based Key-value Stores"}]}
