{"paperId": "2b85d8231b5842b1158455624c6104e21c9e939d", "publicationVenue": {"id": "2ca1e2ac-8c3b-4251-94ed-24846d391d3b", "name": "Computational and Mathematical Methods in Medicine", "type": "journal", "alternate_names": ["Comput Math Method Med"], "issn": "1748-670X", "url": "https://www.hindawi.com/journals/cmmm/"}, "title": "Synthetic Epileptic Brain Activities with TripleGAN", "abstract": "Epilepsy is a chronic noninfectious disease caused by sudden abnormal discharge of brain neurons, which leads to intermittent brain dysfunction. It is also one of the most common neurological diseases in the world. The automatic detection of epilepsy based on electroencephalogram through machine learning, correlation analysis, and temporal-frequency analysis plays an important role in epilepsy early warning and automatic recognition. In this study, we propose a method to realize EEG epilepsy recognition by means of triple genetic antagonism network (GAN). TripleGAN is used for EEG temporal domain, frequency domain, and temporal-frequency domain, respectively. The experiment was conducted through CHB-MIT datasets, which operated at the latest level in the same industry in the world. In the CHB-MIT dataset, the classification accuracy, sensitivity, and specificity exceeded 1.19%, 1.36%, and 0.27%, respectively. The crossobject ratio exceeded 0.53%, 2.2%, and 0.37%, respectively. It shows that the established deep learning model of TripleGAN has a good effect on EEG epilepsy classification through simulation and classification optimization of real signals.", "venue": "Computational and Mathematical Methods in Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-27", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2022"}, "authors": [{"authorId": "2110683490", "name": "Meiyan Xu"}, {"authorId": "2183153754", "name": "Jiao Jie"}, {"authorId": "2157677693", "name": "Wangliang Zhou"}, {"authorId": "2183169279", "name": "Hefang Zhou"}, {"authorId": "152351440", "name": "Shunshan Jin"}], "citations": []}
