{"paperId": "2b8c29e2d9f6ae8969ecb5462eae1d19de091b40", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Towards Iterative Relational Algebra on the GPU", "abstract": "Iterative relational algebra (RA kernels in a fixed-point loop) enables bottom-up logic programming languages such as Dat-alog. Such declarative languages are attractive targets for high-performance implementations of relational data analytics in fields such as graph mining, program analysis, and social-media analytics. Language-level constructs are implemented via high-performance relational algebra primitives (e.g., projections, reorderings, and joins). Such primitives would appear a natural target for GPUs, obtaining high throughput on large datasets. However, state-of-the-art Datalog engines are still CPU-based, scaling best between 8–16 threads. While much has explored standalone RA operations on the GPU, relatively less work focuses on iterative RA, which exposes new challenges (e.g., deduplication and memory management). In this short paper, we present a GPU-based hash-join implementation, leveraging (a) a novel open-addressing-based hash table implementation, (b) operator fusing to optimize memory access and (c) two variant implementations of deduplication. To evaluate our work, we implement transitive closure using our hash-join-based CUDA library and compared its performance against cuDF (GPU-based) and Soufflé (CPU-based). We show favorable results against both, with gains up to 10 . 8 × against cuDF and 3 . 9 × against Soufflé.", "venue": "USENIX Annual Technical Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "1009-1016"}, "authors": [{"authorId": "35567165", "name": "Ahmedur Rahman Shovon"}, {"authorId": "2920296", "name": "Thomas Gilray"}, {"authorId": "3148306", "name": "Kristopher K. Micinski"}, {"authorId": "1500379929", "name": "Sidharth Kumar"}], "citations": [{"paperId": "83527b4410e220be3451a83346ef5db4b593e8b7", "title": "Modern Datalog on the GPU"}, {"paperId": "ab7eac8eacf50dcb03a5b4a0776f1a248811826e", "title": "Communication-Avoiding Recursive Aggregation"}]}
