{"paperId": "2b914583df10b31c4b5d80a4bcf731a265e6ab7f", "publicationVenue": null, "title": "Supporting Fine-grained Dataflow Parallelism in Big Data Systems", "abstract": "Big data systems scale with the number of cores in a cluster for the parts of an application that can be executed in data parallel fashion. It has been recently reported, however, that these systems fail to translate hardware improvements, such as increased network bandwidth, into a higher throughput. This is particularly the case for applications that have inherent sequential, computationally intensive phases. In this paper, we analyze the data processing cores of state-of-the-art big data systems to find the cause for these scalability problems. We identify design patterns in the code that are suitable for pipeline and task-level parallelism, potentially increasing application performance. As a proof of concept, we rewrite parts of the Hadoop MapReduce framework in an implicit parallel language that exploits this parallelism without adding code complexity. Our experiments on a data analytics workload show throughput speedups of up to 3.5x.", "venue": "PMAM@PPoPP", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-02-24", "journal": {"name": "Proceedings of the 9th International Workshop on Programming Models and Applications for Multicores and Manycores"}, "authors": [{"authorId": "3704023", "name": "Sebastian Ertel"}, {"authorId": "40047362", "name": "Justus Adam"}, {"authorId": "144195575", "name": "J. Castrillón"}], "citations": [{"paperId": "7cc9389a7f97094a6a8f16ea77efaf3e7b9af21b", "title": "High-performance Deterministic Concurrency Using Lingua Franca"}, {"paperId": "050ffa1eaecf611195832c15daeb3710340224a3", "title": "Features of the Architecture Implementing the Dataflow Computational Model and Its Application in the Creation of Microelectronic High-Performance Computing Systems"}, {"paperId": "a6e7a80322197d16a5d2c4804cfd0489adc90f7d", "title": "Bridging a Data-Flow Execution Model to a Lightweight Programming Model"}, {"paperId": "c9bb195ed4dfd89a126874248e0316b920013b41", "title": "Compiling Unikernels into Micro Kernels"}, {"paperId": "48c6745132c58a5dd136eeb19e5be2efea7f833d", "title": "Towards implicit parallel programming for systems"}, {"paperId": "c714b4c8863e16bff77308197fd692de7f41a439", "title": "A data-flow execution engine for scalable embedded computing"}, {"paperId": "8c435e653c32b84abdfbd8f8cab440658d58ba43", "title": "dEsign enVironmEnt foR Extreme-Scale big data analyTics on heterogeneous platforms"}]}
