{"paperId": "2b92c0f4205661ea1ca4decab9229e3916696020", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Unveiling Objects with SOLA: An Annotation-Free Image Search on the Object Level for Automotive Data Sets", "abstract": "Huge image data sets are the fundament for the development of the perception of automated driving systems. A large number of images is necessary to train robust neural networks that can cope with diverse situations. A sufficiently large data set contains challenging situations and objects. For testing the resulting functions, it is necessary that these situations and objects can be found and extracted from the data set. While it is relatively easy to record a large amount of unlabeled data, it is far more difficult to find demanding situations and objects. However, during the development of perception systems, it must be possible to access challenging data without having to perform lengthy and time-consuming annotations. A developer must therefore be able to search dynamically for specific situations and objects in a data set. Thus, we designed a method which is based on state-of-the-art neural networks to search for objects with certain properties within an image. For the ease of use, the query of this search is described using natural language. To determine the time savings and performance gains, we evaluated our method qualitatively and quantitatively on automotive data sets.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-04", "journal": {"name": "ArXiv", "volume": "abs/2312.01860"}, "authors": [{"authorId": "2135744556", "name": "Philipp Rigoll"}, {"authorId": "31369121", "name": "Jacob Langner"}, {"authorId": "2268687247", "name": "Eric Sax"}], "citations": [{"paperId": "26a81232af439bbe11816e2a6d24267c58e91395", "title": "CLIPping the Limits: Finding the Sweet Spot for Relevant Images in Automated Driving Systems Perception Testing"}]}
