{"paperId": "2b9fdc60647701c9c79c3203c04fded35fe2d7ec", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "An Experimental Design Framework for Label-Efficient Supervised Finetuning of Large Language Models", "abstract": "Supervised finetuning (SFT) on instruction datasets has played a crucial role in achieving the remarkable zero-shot generalization capabilities observed in modern large language models (LLMs). However, the annotation efforts required to produce high quality responses for instructions are becoming prohibitively expensive, especially as the number of tasks spanned by instruction datasets continues to increase. Active learning is effective in identifying useful subsets of samples to annotate from an unlabeled pool, but its high computational cost remains a barrier to its widespread applicability in the context of LLMs. To mitigate the annotation cost of SFT and circumvent the computational bottlenecks of active learning, we propose using experimental design. Experimental design techniques select the most informative samples to label, and typically maximize some notion of uncertainty and/or diversity. In our work, we implement a framework that evaluates several existing and novel experimental design techniques and find that these methods consistently yield significant gains in label efficiency with little computational overhead. On generative tasks, our methods achieve the same generalization performance with only $50\\%$ of annotation cost required by random sampling.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-12", "journal": {"name": "ArXiv", "volume": "abs/2401.06692"}, "authors": [{"authorId": "1702999721", "name": "Gantavya Bhatt"}, {"authorId": "2273521993", "name": "Yifang Chen"}, {"authorId": "2273635329", "name": "Arnav M. Das"}, {"authorId": "2108131127", "name": "Jifan Zhang"}, {"authorId": "2279336657", "name": "Sang T. Truong"}, {"authorId": "1776721", "name": "Stephen Mussmann"}, {"authorId": "2274197423", "name": "Yinglun Zhu"}, {"authorId": "2249153752", "name": "Jeff Bilmes"}, {"authorId": "2273538448", "name": "S. S. Du"}, {"authorId": "2273545367", "name": "Kevin Jamieson"}, {"authorId": "2275600361", "name": "Jordan T. Ash"}, {"authorId": "2262322578", "name": "Robert Nowak"}], "citations": [{"paperId": "c0c461670185fe05c9fc1209c82d380af409ac48", "title": "Deep Submodular Peripteral Networks"}, {"paperId": "cbf8b22de75aa61a00e0100b9b4e8abb18bc11c3", "title": "SmallToLarge (S2L): Scalable Data Selection for Fine-tuning Large Language Models by Summarizing Training Trajectories of Small Models"}, {"paperId": "4c312b34254c59ad5d2dcf71cc5743d536420cac", "title": "Offline Multi-task Transfer RL with Representational Penalization"}]}
