{"paperId": "2badc120904f246e194d9f4f48dfc413d37d4a46", "publicationVenue": {"id": "27c336e8-5d97-498a-a3de-428721d09d56", "name": "IISE Transactions", "alternate_names": ["IISE Trans"], "issn": "2472-5854", "url": "http://www.tandfonline.com/openurl?genre=journal&stitle=uiie20", "alternate_urls": ["http://www.tandfonline.com/uiie"]}, "title": "Optimal unlabeled set partitioning with application to risk-based quarantine policies", "abstract": "Abstract We consider the problem of partitioning a set of items into unlabeled subsets so as to optimize an additive objective, i.e., the objective function value of a partition is equal to the sum of the contribution of each subset. Under an arbitrary objective function, this family of problems is known to be an -complete combinatorial optimization problem. We study this problem under a broad family of objective functions characterized by elementary symmetric polynomials, which are “building blocks” to symmetric functions. By analyzing a continuous relaxation of the problem, we identify conditions that enable the use of a reformulation technique in which the set partitioning problem is cast as a more tractable network flow problem solvable in polynomial-time. We show that a number of results from the literature arise as special cases of our proposed framework, highlighting its generality. We demonstrate the usefulness of the developed methodology through a novel and timely application of quarantining heterogeneous populations in an optimal manner. Our case study on real COVID-19 data reveals significant benefits over conventional measures in terms of both spread mitigation and economic impact, underscoring the importance of data-driven policies.", "venue": "IISE Transactions", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-03-16", "journal": {"name": "IISE Transactions", "pages": "143 - 155", "volume": "56"}, "authors": [{"authorId": "2211900186", "name": "Jiayi Lin"}, {"authorId": "49966869", "name": "Hrayer Aprahamian"}, {"authorId": "102899521", "name": "H. El-Amine"}], "citations": [{"paperId": "926a6d903f4303c9f029c4a16d872eec3968e053", "title": "An optimization-based framework to minimize the spread of diseases in social networks with heterogeneous nodes"}]}
