{"paperId": "2bb31c86d39a11914bb008d4978001b504c91d4b", "publicationVenue": {"id": "96e2d5e9-f228-4df0-b7b2-556b4a285ded", "name": "Journal of Official Statistics", "type": "journal", "alternate_names": ["J Off Stat"], "issn": "0282-423X", "url": "http://www.degruyter.com/view/j/jos", "alternate_urls": ["http://www.jos.nu/"]}, "title": "Megatrend and Intervention Impact Analyzer for Jobs: A Visualization Method for Labor Market Intelligence", "abstract": "Abstract This article presents a visual method for representing the complex labor market internal structure from the perspective of similar occupations based on shared skills; and a prototype tool for interacting with the visualization, together with an extended description of graph construction and the necessary data processing for linking multiple heterogeneous data sources. Since the labor market is not an isolated phenomenon and is constantly impacted by external trends and interventions, the presented method is designed to enable adding extra layers of external information. For instance, what is the impact of a megatrend or an intervention on the labor market? Which parts of the labor market are the most vulnerable to an approaching megatrend or planned intervention? A case study analyzing the labor market together with the megatrend of job automation and computerization is presented. The source code of the prototype is released as open source for repeatability.", "venue": "Journal of Official Statistics", "year": 2018, "fieldsOfStudy": ["Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "Journal of Official Statistics", "pages": "961 - 979", "volume": "34"}, "authors": [{"authorId": "24009738", "name": "Rain Opik"}, {"authorId": "2968611", "name": "T. Kirt"}, {"authorId": "3082140", "name": "I. Liiv"}], "citations": [{"paperId": "225b9f9533e1535f1e7ff31ff138adb04c343d3c", "title": "Index to Volume 34, 2018"}, {"paperId": "eda6546be4d354c3124ddfc9c6d9eb5bbf8c8b85", "title": "How to visualize the competence: the Issue of Occupational Information Network Visualization"}]}
