{"paperId": "2bb4c81fa9e0fa5d38b60416d0937516a846ec6c", "publicationVenue": null, "title": "Scatternet Formation Protocol for Environmental Monitoring in a Smart Garden", "abstract": "The monitoring of different parameters in the smart garden environment requires thousands of nodes and actuators. They form a multi-hop communication network. The scatternets formed with Bluetooth protocol is a communication solution. However, there is no current algorithm that considers the different capabilities of the devices (sensors or actuators) and assigns a role according to these capabilities. In this paper, we present a network topology formation algorithm for role assignment and connection establishment which considers the capabilities of the devices and use slave-slave Bridge to communicate the piconets. We design the algorithms needed for this protocol and test it. We have simulated the algorithms in order to evaluate the time needed for role assignment and to establish the first connections of the piconet. The results include different scenarios composed by one or two masters and one to seven slaves. In addition, we evaluate the established connections in piconets and bridges in a real case of the smart garden sensor network. Finally, we present the changes in the piconet connections after the deployment of two nodes in an existing network.", "venue": "Netw. Protoc. Algorithms", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-06", "journal": {"name": "Netw. Protoc. Algorithms", "pages": "63-84", "volume": "10"}, "authors": [{"authorId": "2170419", "name": "L. Parra"}, {"authorId": "2061199452", "name": "J. Marin"}, {"authorId": "32225085", "name": "P. V. Mauri"}, {"authorId": "144484046", "name": "Jaime Lloret"}, {"authorId": "65786051", "name": "Virginia Torices"}, {"authorId": "66553974", "name": "Alberto Massager"}], "citations": [{"paperId": "4eb6ab1ca0c96963cb3014470575c18f6f148418", "title": "New Sensor Based on Magnetic Fields for Monitoring the Concentration of Organic Fertilisers in Fertigation Systems"}, {"paperId": "5258221e81287eda2f9f118a6b1bc6a17234eb12", "title": "Walk this way! An IoT-based urban routing system for smart cities"}, {"paperId": "1a9ff8a6c0331a6bc2fa6fad63bbbc7f49929178", "title": "ESTIMNATION OF SITUATIONS FOR BLUETOOTH SCATTERNETS, MODELS AND BIFURCATIONS"}, {"paperId": "0a650ca95f5fa7d796b1f801600a0d68bc82657b", "title": "SWAP: Smart WAter Protocol for the irrigation of urban gardens in Smart Cities"}, {"paperId": "b9eae74bc89b4906f4af700dda9932cb7da67ac5", "title": "Comparison of Single Image Processing Techniques and Their Combination for Detection of Weed in Lawns"}]}
