{"paperId": "2bb4bf5898d6ae135869283849fc0e05fb21f4ff", "publicationVenue": null, "title": "Dynamic Provisioning of Data Intensive Computing Middleware Frameworks: A Case Study", "abstract": "Big data has become an important asset for industry, and academic disciplines now utilize large-scale data in their research. This fourth paradigm of scientific research has led to the inclusion of data management, processing, and analytic tools into the traditional high performance computing software libraries. This integration is facilitated through a collection of supporting software components that comprise a data intensive computing middleware framework. From a shared campus cyberinfrastructure perspective, this represents a new challenge to the system administrators in balancing between the traditional high performance computing software stacks and the new data-intensive middleware on the same physical computing resource. In turn, this limits researchers from having access to the new middleware tools while administrators determine how to overcome the challenge. In this paper, we present our experience in configuring dynamic provisioning of two different data-intensive middleware frameworks from a user perspective. We describe the configuration process from setting up dependencies to deploying the middleware, and how this experience can be applied by other researchers and administrators.", "venue": "SCREAM@HPDC", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2015-06-16", "journal": {"name": "Proceedings of the 1st Workshop on The Science of Cyberinfrastructure: Research, Experience, Applications and Models"}, "authors": [{"authorId": "46918941", "name": "Linh Ngo"}, {"authorId": "21223631", "name": "Michael E. Payne"}, {"authorId": "2142983", "name": "Flavio Villanustre"}, {"authorId": "2110665970", "name": "Richard Taylor"}, {"authorId": "1748096", "name": "A. Apon"}], "citations": [{"paperId": "adf99513508448fcf6fa07b04e16c9a3dfe025b8", "title": "Unifying computing resources and access interface to support parallel and distributed computing education"}, {"paperId": "96b5a711fb504641789ef09f95c88cfa810963ba", "title": "Social Media Data in Transportation"}]}
