{"paperId": "2bbfd6ccdfd155fb8767a735d0c5d3e3b6247a3d", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Adjusting for the progressive digitization of health records: working examples on a multi-hospital clinical data warehouse", "abstract": "Objective: To propose a new method to account for time-dependent data missingness caused by the increasing digitization of health records in the analysis of large-scale clinical data. Materials and Methods: Following a data-driven approach we modeled the progressive adoption of a common electronic health record in $38$ hospitals. To this end, we analyzed data collected between $2013$ and $2022$ and made available in the clinical data warehouse of the Greater Paris University Hospitals. Depending on the category of data, we worked either at the hospital, department or unit level. We evaluated the performance of this model with a retrospective cohort study. We measured the temporal variations of some quality and epidemiological indicators by successively applying two methods, either a naive analysis or a novel complete-source-only analysis that accounts for digitization-induced missingness. Results: Unrealistic temporal variations of quality and epidemiological indicators were observed when a naive analysis was performed, but this effect was either greatly reduced or disappeared when the complete-source-only method was applied. Discussion: We demonstrated that a data-driven approach can be used to account for missingness induced by the progressive digitization of health records. This work focused on hospitalization, emergency department and intensive care units records, along with diagnostic codes, discharge prescriptions and consultation reports. Other data categories may require specific modeling of their associated data sources. Conclusions: Electronic health records are constantly evolving and new methods should be developed to debias studies that use these unstable data sources.", "venue": "medRxiv", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-08-21", "journal": null, "authors": [{"authorId": "2232752445", "name": "A. Remaki"}, {"authorId": "79495753", "name": "B. Playe"}, {"authorId": "20910486", "name": "P. Bernard"}, {"authorId": "117277139", "name": "S. Vittoz"}, {"authorId": "80844951", "name": "M. Doutreligne"}, {"authorId": "2059492041", "name": "G. Chatellier"}, {"authorId": "2139937195", "name": "É. Audureau"}, {"authorId": "50143580", "name": "E. Kempf"}, {"authorId": "47308254", "name": "R. Porcher"}, {"authorId": "2065853842", "name": "R. Bey"}], "citations": []}
