{"paperId": "2bc904d9986eab4b911e7622c61b00ae8fb8d049", "publicationVenue": {"id": "9181819e-530e-4408-9917-93c5f58d7fce", "name": "International Congress on Information and Communication Technology", "type": "conference", "alternate_names": ["Int Conf Inf Comput Technol", "International Conference on Inventive Computation Technologies", "ICICT", "Int Congr Inf Commun Technol", "Int Conf Inven Comput Technol", "International Conference on Issues and Challenges in Intelligent Computing Techniques", "International Conference on Information and Computer Technologies", "Int Conf Issue Chall Intell Comput Tech"]}, "title": "Decision Support System to Optimize Cloud Service Prioritization for Model Deployment", "abstract": "The bio-inspired concept of deep learning has brought a revolution in artificial intelligence. It has challenged several areas including computer vision, signal processing, healthcare, transportation, security, robotics and machine translation. The core idea is to make learning algorithms efficient and convenient to use for solving daily life problems. This technology is still naive and facing multiple challenges like massive data availability, computation and infrastructural cost, resource dependency, efficient resource utilization, model production and platform procurement. Also it is found that most of the structured and unstructured data comes in the form of images, captured through different types of sensors. These images if utilized efficiently, can serve as an effective tool to solve numerous problems. To target above, a resource independent deep learning framework is proposed in this article. This work is an effort towards deploying deep neural network off-premises for medical image analysis to eliminate on-premises resource dependency and making efficient use of pay-as-per-demand paradigm offered by cloud services. This approach not only reduces the overall infrastructural cost but also enables a diverse range of need-based computational resource selection. The proposed work has shown promising results and considered as an effort to promote cloud-based resource independent machine intelligence.", "venue": "International Congress on Information and Communication Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-03-01", "journal": {"name": "2021 4th International Conference on Information and Computer Technologies (ICICT)", "pages": "158-162"}, "authors": [{"authorId": "2152496744", "name": "Muhammad Zubair Khan"}, {"authorId": "2109363117", "name": "Yugyung Lee"}, {"authorId": "40496604", "name": "M. K. Khattak"}], "citations": [{"paperId": "eae6527bd93abb2a5a3a9105f4807ed4460edc95", "title": "Retinal Image Analysis to Detect Neovascularization using Deep Segmentation"}, {"paperId": "23c8d67b6a8e2fbf46b74ef29c51e02a7bf0d5fe", "title": "Ocular Inspection to Prevent Vision Impairment Caused by Diabetic Retinopathy"}]}
