{"paperId": "2bca863eece1fc4c91dcf5c136e1564798b30132", "publicationVenue": null, "title": "Exploration of CNN with Node Centred Intrusion Detection Structure Plan for Green Cloud", "abstract": "Privacy is an essential factor in the cloud database, currently available clouds were secured with local algorithms, but those were insufficient for robust security. Deep learning technology with CNN and RCNN has efficiently solved many dynamic cloud security problems. The node intrusion with localization can fix many security issues. In this work node-centric intrusion detection system (IDS) has been imported on a cloud network with CNN deep learning technology, moreover tested the intrusion detection using a layered architecture. In this RCNN with 175 layers were used to build the training process and extract features. 15 classes were presented. csv file with extreme cloud operating conditions. The Kaggle data set with 1 lakh sample were given as input to training, and 20% of the sample was used for testing and reaming used for training. Finally, by applying confusion matrix measures performance measures, the Accuracy of 98.23%, Recall of 97.23%, F1 score of 89.2%, and Sensitivity of 91.23% were attained, which was a good improvement. The proposed method has been used for cloud applications without any eco disturbance called as green cloud.", "venue": "2023 IEEE International Conference on Contemporary Computing and Communications (InC4)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-21", "journal": {"name": "2023 IEEE International Conference on Contemporary Computing and Communications (InC4)", "pages": "1-7", "volume": "1"}, "authors": [{"authorId": "2248829980", "name": "G. Tarun"}, {"authorId": "2248904040", "name": "K. Ch"}, {"authorId": "2248922553", "name": "Sri Kavya"}, {"authorId": "2248915558", "name": "Sai Nikhil"}, {"authorId": "2248898709", "name": "D. Ahammad"}, {"authorId": "2248911372", "name": "Ch.Rohit"}, {"authorId": "2248827658", "name": "K. Saikumar"}], "citations": [{"paperId": "c7bced9a8891832edc97c3305449a081bedea8b7", "title": "A Dynamic Approach to Cyber Risk Assessment for Critical Information Infrastructure"}, {"paperId": "ab94f0a040bac0a9109f43caab1d0aaff009d590", "title": "Enterprise Support Hierarchical Model with Secure Data Protocol"}]}
