{"paperId": "2bd1ce268246f22f65705f8193cd1bb822d80d20", "publicationVenue": {"id": "5d24d24c-e06c-4bd9-a352-e8c01e3336cc", "name": "Asia Pacific Journal of Health Management", "type": "journal", "alternate_names": ["Asia Pac j health manag", "Asia Pac J Health Manag", "Asia Pacific journal of health management"], "issn": "1833-3818", "url": "https://journal.achsm.org.au/"}, "title": "Problems of Big Data Adoption in the Healthcare Industries", "abstract": "Big data offers the knowledge required for healthcare providers to streamline customer service processes that customize healthcare and create best practices for communicating with clients or patients. A more detailed and customized experience can be offered to customers. But there are many challenges that healthcare organizations are facing. The research aims to study big data challenges in the healthcare sector. A literature review is performed to discover big data problems in healthcare. A questionnaire is utilized for the survey research in the hospitals. Target populations are the staff who are working in the hospitals. For analysis, exploratory factor analysis is being performed. All the challenges are grouped into five factors. All the parameters are satisfied for the study.\n(*The paper was presented at the 2nd Conference on Business Data Analytics: Innovation in emerging trends in management data analytics. Apeejay School of Management, Dwarka, Delhi, India. November 2021)", "venue": "Asia Pacific Journal of Health Management", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-13", "journal": {"name": "Asia Pacific Journal of Health Management"}, "authors": [{"authorId": "2145651323", "name": "Surya Kant Pal"}, {"authorId": "153478562", "name": "Subhodeep Mukherjee"}, {"authorId": "122278438", "name": "Manish Mohan Baral"}, {"authorId": "2143503523", "name": "S. Aggarwal"}], "citations": [{"paperId": "15c889220d12c431359ef6ae6414e1931a6f56e9", "title": "Barrier analysis to improve big data analytics capability of the maritime industry: A mixed-method approach"}, {"paperId": "0f01767740531de5012bd8cad959247e0026ad2f", "title": "Big data applications in portfolio management: A review of techniques and strategies"}, {"paperId": "3c9d1b048f25a5138a6079b3a7409b0b64de084d", "title": "Temas de investigación sobre Big Data en el sector salud"}, {"paperId": "9968366bb680037e64c87f0970ec305bd125773d", "title": "A Data-Driven Paradigm for a Resilient and Sustainable Integrated Health Information Systems for Health Care Applications"}, {"paperId": "1cc0a5310895eb069cc2c167a7d3b0bfd0f28132", "title": "Automatic Plagiarism Detection Using Natural Language Processing"}, {"paperId": "a1c0bdd071b8e31a38e88a5738009b57dcbb3946", "title": "The Challenges of Blockchain Technology Adoption in the Agro-based Industries"}, {"paperId": "cc8164ffeaea24193e8d770af84b438a314e2e4e", "title": "Exploring the blockchain for sustainable food supply chain"}, {"paperId": "be3fa0022d7922254356ffefdcf720fdfea25684", "title": "The challenge of healthcare big data to China’s commercial health insurance industry: evaluation and recommendations"}, {"paperId": "f716c79180184e197ae18ed261362e957c43162b", "title": "Investigating sustainable development for the COVID-19 vaccine supply chain: a structural equation modelling approach"}, {"paperId": "d89a0047feee4400d57f1f27ee355ddf5a7e6113", "title": "A Review on Various Data Prediction Technologies"}, {"paperId": "055c48b4dc29ea5494ee027236af766b1922c7bd", "title": "Impact of Pyramid Meditation On Anxiety and Stress Among Youth"}, {"paperId": "887298f5471bc7bb07ab7516431883882ff62cab", "title": "How to Improve Organizational Performance Using Big Data in the Hotels"}]}
