{"paperId": "2bd48542de3f83c438621da217771b901a7831ce", "publicationVenue": {"id": "8ba56476-c1c5-4591-8422-2f222f234589", "name": "World Forum on Internet of Things", "type": "conference", "alternate_names": ["WF-IoT", "World Forum Internet Thing"]}, "title": "Performance of video processing at the edge for crowd-monitoring applications", "abstract": "Video analytics has a key role to play in smart cities and connected community applications such as crowd counting, activity detection, event classification, traffic counting etc. Using a cloud-centric approach where data is funnelled to a central processor presents a number of key problems such as available bandwidth, real-time responsiveness and personal data privacy issues. With the development of edge computing, a new paradigm for smart data management is emerging. Raw video feeds can be pre-processed at the point of capture while integration and deeper analytics is performed in the cloud. In this paper we explore the capacity of video processing at the edge and shown that basic image processing can be achieved in near real-time on low-powered gateway devices. We have also investigated deep learning model capabilities for crowd counting in this context showing that its performance is highly dependent on the input size and rescaling video frames can optimise processing and performance. Increased edge processing resolves a number of issues in video analytics for crowd monitoring applications.", "venue": "World Forum on Internet of Things", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-02-05", "journal": {"name": "2018 IEEE 4th World Forum on Internet of Things (WF-IoT)", "pages": "482-487"}, "authors": [{"authorId": "1414808684", "name": "Camille Ballas"}, {"authorId": "101085204", "name": "Mark A Marsden"}, {"authorId": "143972917", "name": "Dian Zhang"}, {"authorId": "98536322", "name": "N. O’Connor"}, {"authorId": "145777800", "name": "S. Little"}], "citations": [{"paperId": "805440cfdf9d48d9a36e537615d80ab38baee975", "title": "Offloading approach for mobile edge computing based on chaotic quantum particle swarm optimization strategy"}, {"paperId": "556cce6fe10fcd5bcce25e1e7898747d7d67ee9e", "title": "Applying Template Matching Technique for Distortion Removing from Photography"}, {"paperId": "7ef1fcb6b389936788e1abc4b6571a803aa8815f", "title": "The ASU-DCU International Research and Workforce Development Program on Sensors and Machine Learning"}, {"paperId": "03e2454c66a061f44ef1e430371fa1edc43cb2bf", "title": "Public safety in smart cities under the edge computing concept"}, {"paperId": "9ed292124c77430fd21fbd87d4614674c6d859ff", "title": "A Review on Edge Analytics: Issues, Challenges, Opportunities, Promises, Future Directions, and Applications"}, {"paperId": "20131c2b1b1908c330bacc1b963f011a9f55d877", "title": "Deep-Framework: A Distributed, Scalable, and Edge-Oriented Framework for Real-Time Analysis of Video Streams"}, {"paperId": "efd338ca69488b5a073a46257de67ddb7466603b", "title": "Locating people in Real-World for Assisting Crowd Behaviour Analysis Using SSD and Deep SORT Algorithm"}, {"paperId": "466ed106ac216dcf56b22cc0489349e09b346045", "title": "Using Fuzzy Inference System FIS for Identifying Motion in Digital Surveillance Systems"}, {"paperId": "2ccdb37abfd1277a2129e5a097a956495dcf4a4f", "title": "Performance Evaluation of Industrial Internet of Things Services in Devices of Cloud-Fog-Dew-Things Computing"}, {"paperId": "a04ba5745a4d368d7287c338916f65a822c82098", "title": "Crowd Size Estimation Using CommSense Instrument for COVID-19 Echo Period"}, {"paperId": "8d75c87f39c16177b452880c6ad10f1688a174a7", "title": "Distributed load balancing for heterogeneous fog computing infrastructures in smart cities"}, {"paperId": "f64a8e725a9aa96f01a9c258a753e76416ff8658", "title": "Twinned power: formations of cloud-edge control"}, {"paperId": "99006c51a646c82408c9754cb5f36967c011f427", "title": "Face Recognition and Machine Learning at the Edge"}, {"paperId": "0e23599798fb98fa556378aca227ad3c879ca5d4", "title": "Staying at the Edge of Privacy: Edge Computing and Impersonal Extraction"}, {"paperId": "953f8f33f50e0e87d6f44e4e1c46e2bbbc3fa745", "title": "A video-based vehicle counting system using an embedded device in realistic traffic conditions"}, {"paperId": "a35a93dfda184f86eda52ff661a2d52936717306", "title": "RES: Real-Time Video Stream Analytics Using Edge Enhanced Clouds"}, {"paperId": "24e99a8d85c986a40999eaf34d4d60916c702fb0", "title": "Multi-Armed Bandit Learning for Computation-Intensive Services in MEC-Empowered Vehicular Networks"}, {"paperId": "1c8a3e3fec8fa81cea8e5d26ce8cb5cb59e3b3df", "title": "Simplified Video Surveillance Framework for Dynamic Object Detection under Challenging Environment"}, {"paperId": "78cf46228875bfc2b1c13cc599b2fea6e443c6f5", "title": "Real Time Video Analytics for Object Detection and Face Identification using Deep Learning"}, {"paperId": "a6ab2766c6a1e7c59b9802dc5817ce67f3a6ecb3", "title": "Efficient Deployment of Predictive Analytics in Edge Gateways: Fall Detection Scenario"}, {"paperId": "070c40fc866fdec37221c4f4fc44ee6bdbb4e4d8", "title": "On the Evaluation of the Total-Cost-of-Ownership Trade-Offs in Edge vs Cloud Deployments: A Wireless-Denial-of-Service Case Study"}, {"paperId": "785a1c77fabd1ad870a9dbc98d235d2fcbdbaa6f", "title": "Fog computing: from architecture to edge computing and big data processing"}, {"paperId": "3e4388586eb2538657a24ca1ace3c6877ec2235b", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms: A Complete Survey"}, {"paperId": "0d9e5966dd51696f332c361fb40d83e3683c2e7d", "title": "Real-time Crowd Counting based on Wearable Ephemeral IDs"}, {"paperId": "11ffda0b0bcb4518775ffab5d705421422125c0b", "title": "Role of Edge Computing to Leverage IoT-Assisted AAL Ecosystem"}, {"paperId": "6b2ac970962f1ec76e98bfeb79477d5e75fc4760", "title": "Surveillance System for Intruder Detection Using Facial Recognition"}, {"paperId": "61cb9c58b31e6b77c855c396d2b55fdcdd197989", "title": "Algorithms and Techniques for Computation Offloading in Edge E nabled Cloud of Things (ECoT)–A Primer"}, {"paperId": "e0dff5f27ae278eccde8b722347c4d5dcabe8769", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms"}]}
