{"paperId": "2bd5aaf20b65cefe742b2ec86ca7c9b9061c836a", "publicationVenue": {"id": "e3e1f91c-fe26-4f67-8d15-f7acd8abdf42", "name": "Future generations computer systems", "type": "journal", "alternate_names": ["Future gener comput syst", "Future Generation Computer Systems", "Future Gener Comput Syst"], "issn": "0167-739X", "url": "http://www.elsevier.com/wps/find/journaleditorialboard.cws_home/505611/editorialboard", "alternate_urls": ["https://www.journals.elsevier.com/future-generation-computer-systems", "http://www.sciencedirect.com/science/journal/0167739X"]}, "title": "In-depth Analysis On Parallel Processing Patterns for High-Performance Dataframes", "abstract": "The Data Science domain has expanded monumentally in both research and industry communities during the past decade, predominantly owing to the Big Data revolution. Artificial Intelligence (AI) and Machine Learning (ML) are bringing more complexities to data engineering applications, which are now integrated into data processing pipelines to process terabytes of data. Typically, a significant amount of time is spent on data preprocessing in these pipelines, and hence improving its e fficiency directly impacts the overall pipeline performance. The community has recently embraced the concept of Dataframes as the de-facto data structure for data representation and manipulation. However, the most widely used serial Dataframes today (R, pandas) experience performance limitations while working on even moderately large data sets. We believe that there is plenty of room for improvement by taking a look at this problem from a high-performance computing point of view. In a prior publication, we presented a set of parallel processing patterns for distributed dataframe operators and the reference runtime implementation, Cylon [1]. In this paper, we are expanding on the initial concept by introducing a cost model for evaluating the said patterns. Furthermore, we evaluate the performance of Cylon on the ORNL Summit supercomputer.", "venue": "Future generations computer systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Future Gener. Comput. Syst.", "pages": "250-264", "volume": "149"}, "authors": [{"authorId": "147698290", "name": "Niranda Perera"}, {"authorId": "72620200", "name": "A. Sarker"}, {"authorId": "2202025523", "name": "Mills Staylor"}, {"authorId": "1745570", "name": "G. Laszewski"}, {"authorId": "2184722362", "name": "Kaiying Shan"}, {"authorId": "3122947", "name": "Supun Kamburugamuve"}, {"authorId": "146448984", "name": "Chathura Widanage"}, {"authorId": "51227181", "name": "V. Abeykoon"}, {"authorId": "2198488364", "name": "Thejaka Amíla Kanewela"}, {"authorId": "50192176", "name": "Geoffrey Fox"}], "citations": [{"paperId": "feea3a2fc12915e6982b2a7774c0fb9a928bf230", "title": "Design and Implementation of an Analysis Pipeline for Heterogeneous Data"}, {"paperId": "a4868294d4429de051708a0b15cb4d066be43d34", "title": "Second-order Scalable Complex System Modeling Framework and Parallelization Dynamics Method"}]}
