{"paperId": "2be0fb0957399aae1e91a8076fba21296bc29fc4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Simple and Efficient Cardinality Estimation in Data Streams", "abstract": "We study sketching schemes for the cardinality estimation problem in data streams, and advocate for measuring the efficiency of such a scheme in terms of its MVP: Memory-Variance Product, i.e., the product of its space, in bits, and the relative variance of its estimates. \nUnder this natural metric, the celebrated HyperLogLog sketch of Flajolet et al. (2007) has an MVP approaching $6(3\\ln 2-1)\\approx 6.48$ for estimating cardinalities up to $2^{64}$. Applying the Cohen/Ting (2014) martingale transformation results in a sketch Martingale HyperLogLog with MVP $ \\approx 4.16$, though it is not composable. Recently Pettie and Wang (2020) proved that it is possible to achieve MVP approaching $\\approx 1.98$ with a composable sketch called Fishmonger, though the time required to update this sketch is not constant. \nOur aim in this paper is to strike a nice balance between extreme simplicity (exemplified by (Martingale) (Hyper)LogLog) and extreme information-theoretic efficiency exemplified by Fishmonger). We develop a new class of \"curtain\" sketches that are a bit more complex than Martingale LogLog but with substantially better $\\MVP$s, e.g., Martingale Curtain has MVP $ \\approx 2.31$. We also prove that Martingale Fishmonger has an MVP of around $1.63$, and conjecture this to be an information-theoretic lower bound on the problem, independent of update time.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-20", "journal": {"name": "ArXiv", "volume": "abs/2008.08739"}, "authors": [{"authorId": "1727806", "name": "Seth Pettie"}, {"authorId": "2119264608", "name": "Dingyu Wang"}, {"authorId": "1894767683", "name": "Longhui Yin"}], "citations": [{"paperId": "94048ebcf85d3418929f6d0d8587873adf28de9c", "title": "SetSketch: Filling the Gap between MinHash and HyperLogLog"}, {"paperId": "5980dd4d162358c935fbdceedf4f02486ed7c4db", "title": "Information theoretic limits of cardinality estimation: Fisher meets Shannon"}]}
