{"paperId": "2bed3b01846b7d82decf0205a50b5b638e0e978f", "publicationVenue": null, "title": "Robust Data-Driven Framework for Driver Behavior Profiling Using Supervised Machine Learning", "abstract": "Driver behavior profiling has been gaining increased attention due to its relevance in many applications. For instance, car insurance telematics and fleet management entities have been recently using smartphones’ embedded sensors, On-Board Diagnostics II (OBDII) units and other on-board IoT devices to collect data on vehicles’ behavior and evaluate the risk profile of drivers. In this context, this paper presents a robust data-driven framework for calculating drivers’ risk profile measured in terms of the additive inverse of the predicted risk probability. The Strategic Highway Research Program 2 (SHRP2) naturalistic driving study (NDS) dataset, which is the largest dataset of its kind to date, is utilized to build the risk prediction models. Crash and near-crash events are used to quantify riskiness whereas balanced baseline driving events (i.e., events captured during normal day to day driving episodes) are used to reflect total exposure or driving time per driver. Thirteen mutually exclusive behavioral risk predictors are identified, and the feature matrix is formulated. A sensitivity analysis is then performed to find the best number of balanced baseline events below which drivers are filtered out. Different machine learning models are selected, customized, and compared to achieve best risk prediction performance. Finally, the utilization of the proposed prediction model within an envisioned driver profiling cloud-based framework is briefly discussed.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "3336-3350", "volume": "23"}, "authors": [{"authorId": "50686568", "name": "Abdalla E. Abdelrahman"}, {"authorId": "35725657", "name": "H. Hassanein"}, {"authorId": "1745963", "name": "N. Abuali"}], "citations": [{"paperId": "972138009138d2359251a939e5f5e2df9b23820f", "title": "Research on personalized control strategy of EHB system for consistent braking feeling considering driving behaviors"}, {"paperId": "7fa41f7c345fbc11542e93e2ca7bd1124b94ad22", "title": "Advancements in Machine Learning and Data Mining Techniques for Collision Prediction and Hazard Detection in Internet of Vehicles"}, {"paperId": "4eab3fc70892cd81315d0be947fead31af75d9b9", "title": "Machine Learning Insights on Driving Behaviour Dynamics among Germany, Belgium, and UK Drivers"}, {"paperId": "63946f0dbe94db9b0ff6bc81b650150aed491a3f", "title": "A Framework for Combining Lateral and Longitudinal Acceleration to Assess Driving Styles Using Unsupervised Approach"}, {"paperId": "c176e61addd4bc10119e5a135414eade13d140d4", "title": "Review of Energy Management Methods for Fuel Cell Vehicles: From the Perspective of Driving Cycle Information"}, {"paperId": "f41f60337dd800e012fe3fd59b337dc60203ec64", "title": "Characteristics and Identification of Risky Driving Behavior in Expressway Tunnel Based on Behavior Spectrum"}, {"paperId": "dca8af2438b22b53f39bcbbe85de7b2a9fe8b165", "title": "Using Visual and Vehicular Sensors for Driver Behavior Analysis: A Survey"}, {"paperId": "05a136d48b9bf21128e6376fa1390d10bec48087", "title": "Federated learning based driver recommendation for next generation transportation system"}, {"paperId": "5ec05a6eae2e3ee95ccccd7d168bb11980edba4b", "title": "An Open Case-based Reasoning Framework for Personalized On-board Driving Assistance in Risk Scenarios"}, {"paperId": "f1053f0b388320d6b29ddb5296f5d0d7f4b82cb6", "title": "On the Potential of Randomization-based Neural Networks for Driving Behavior Classification"}, {"paperId": "c4096565d7f922db5fe0462e5102c031630d64a1", "title": "Distributed Adaptive Recommendation & Time-stamp based Estimation of Driver-Behaviour"}, {"paperId": "e8c45d370e85c0bcd657e33227f984baad30c990", "title": "A Machine Learning Smartphone-based Sensing for Driver Behavior Classification"}, {"paperId": "c2ad24cc1f4876cec943c4b8a7f34ebacb8c4b13", "title": "From Traditional to Autonomous Vehicles: A Systematic Review of Data Availability"}, {"paperId": "e6ff7fb034c6c90e1421b907498f6b2f067885d2", "title": "Driving Behaviour Analysis Using Machine and Deep Learning Methods for Continuous Streams of Vehicular Data"}, {"paperId": "d4ccda3d201d09964eafdceb862789822c09bcdf", "title": "Understanding Driving Behavior Using fNIRS and Machine Learning"}, {"paperId": "b7e6e9ae399c47bdf72311e2a2379052af144791", "title": "Driver Behavior Classification: A Systematic Literature Review"}, {"paperId": "415c7f9ef4978795c0bf82958451e474748e1d75", "title": "On the Interest of Extending Internet of Behaviors to Internet of Habits: A Preliminary Exploration"}, {"paperId": "777eccdbff99edf41c47e18e6612f7682d27b893", "title": "Data analytics in fleet operations: A systematic literature review and workflow proposal"}]}
