{"paperId": "2bf9d66fed48f81591a545d038c8d4593e435559", "publicationVenue": null, "title": "A False Sense of Security?: Revisiting the State of Machine Learning-Based Industrial Intrusion Detection", "abstract": "Anomaly-based intrusion detection promises to detect novel or unknown attacks on industrial control systems by modeling expected system behavior and raising corresponding alarms for any deviations. As manually creating these behavioral models is tedious and error-prone, research focuses on machine learning to train them automatically, achieving detection rates upwards of 99%. However, these approaches are typically trained not only on benign traffic but also on attacks and then evaluated against the same type of attack used for training. Hence, their actual, real-world performance on unknown (not trained on) attacks remains unclear. In turn, the reported near-perfect detection rates of machine learning-based intrusion detection might create a false sense of security. To assess this situation and clarify the real potential of machine learning-based industrial intrusion detection, we develop an evaluation methodology and examine multiple approaches from literature for their performance on unknown attacks (excluded from training). Our results highlight an ineffectiveness in detecting unknown attacks, with detection rates dropping to between 3.2% and 14.7% for some types of attacks. Moving forward, we derive recommendations for further research on machine learning-based approaches to ensure clarity on their ability to detect unknown attacks.", "venue": "CPSS@AsiaCCS", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-05-18", "journal": {"name": "Proceedings of the 8th ACM on Cyber-Physical System Security Workshop"}, "authors": [{"authorId": "1702968283", "name": "Dominik Kus"}, {"authorId": "144934794", "name": "Eric Wagner"}, {"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "35742321", "name": "Konrad Wolsing"}, {"authorId": "51167464", "name": "I. Fink"}, {"authorId": "1382610408", "name": "Markus Dahlmanns"}, {"authorId": "1719689", "name": "Klaus Wehrle"}, {"authorId": "1860703438", "name": "Martin Henze"}], "citations": [{"paperId": "b96d9720c781107d71436e1dadba12363855f2e1", "title": "Deployment Challenges of Industrial Intrusion Detection Systems"}, {"paperId": "6e0e1664ab4334e79a03ed7d8ca05cff19081479", "title": "You Cannot Escape Me: Detecting Evasions of SIEM Rules in Enterprise Networks"}, {"paperId": "66fb66614df53a00182a9ae6da1b391c9bdefb4e", "title": "On Evasion of Machine Learning-based Intrusion Detection in Smart Grids"}, {"paperId": "84cf562af4bea95f3a706b88d1c6dfc0cd795da1", "title": "Techniques for Enhancing Security in Industrial Control Systems"}, {"paperId": "e25ad7dc85b492011bf5d18aab93b45c7f6a32cd", "title": "Benchmark Evaluation of Anomaly-Based Intrusion Detection Systems in the Context of Smart Grids"}, {"paperId": "5e2cab09d04264e3f9aef03c0a7fb991d2e2356f", "title": "Critical Infrastructure Security Goes to Space: Leveraging Lessons Learned on the Ground"}, {"paperId": "308cde1fcd97dcacf7f5bbfd0478f4409b280b59", "title": "An Approach to Abstract Multi-stage Cyberattack Data Generation for ML-Based IDS in Smart Grids"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "9b7580fbd7d8df909b39ef185a690dfb0fd84928", "title": "SoK: Evaluations in Industrial Intrusion Detection Research"}, {"paperId": "97cd0295796a9b477eb38b342b1fa2d10ffdf896", "title": "Poster: INSIDE - Enhancing Network Intrusion Detection in Power Grids with Automated Facility Monitoring"}, {"paperId": "185dba5a418d13be2bfdf1ebb3c4d4675f88442b", "title": "On specification-based cyber-attack detection in smart grids"}, {"paperId": "2fe72db64e536e38ff76e598abe5c8253d6ca343", "title": "IPAL: Breaking up Silos of Protocol-dependent and Domain-specific Industrial Intrusion Detection Systems"}, {"paperId": "ca143aa225c1e27dbba57472671fa28df39e85fd", "title": "One IDS is not Enough! Exploring Ensemble Learning for Industrial Intrusion Detection"}, {"paperId": "3b1fd96a7ef852522525f2283305fa03c6cc81ba", "title": "Can Industrial Intrusion Detection Be SIMPLE?"}, {"paperId": "7eac5703672862d5cbbb30202caf9ba7210be46c", "title": "Poster: Ensemble Learning for Industrial Intrusion Detection"}]}
