{"paperId": "2c06605a9e9a2c302c36e7b49fd4f707de76910e", "publicationVenue": {"id": "f6571f4f-bfb1-46cc-bd60-36b1818c1b6e", "name": "Forecasting", "issn": "2571-9394", "url": "https://www.mdpi.com/journal/forecasting"}, "title": "Bus Travel Time: Experimental Evidence and Forecasting", "abstract": "Bus travel time analysis plays a key role in transit operation planning, and methods are needed for investigating its variability and for forecasting need. Nowadays, telematics is opening up new opportunities, given that large datasets can be gathered through automated monitoring, and this topic can be studied in more depth with new experimental evidence. The paper proposes a time-series-based approach for travel time forecasting, and data from automated vehicle monitoring (AVM) of bus lines sharing the road lanes with other traffic in Rome (Italy) and Lviv (Ukraine) are used. The results show the goodness of such an approach for the analysis and reliable forecasts of bus travel times. The similarities and dissimilarities in terms of travel time patterns and city structure were also pointed out, showing the need to take them into account when developing forecasting methods.", "venue": "Forecasting", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-08-28", "journal": {"name": "Forecasting"}, "authors": [{"authorId": "2787800", "name": "A. Comi"}, {"authorId": "50052120", "name": "A. Polimeni"}], "citations": [{"paperId": "f6a5fa84f92b5dc2bb9d638a75138bb246694e11", "title": "A Survey on Graph Neural Networks in Intelligent Transportation Systems"}, {"paperId": "4f4094926a91a491811e768d4284e86a87c72065", "title": "Travel time prediction based on route links’ similarity"}, {"paperId": "baa75687e293e1ce87454af30bd326554b44a663", "title": "Sustainable Mobility as a Service: Supply Analysis and Test Cases"}, {"paperId": "a0180d9142dda0a6e65dec948daa5233791bbe2e", "title": "Insights into the socio-economic impacts of traffic congestion in the port and industrial areas of Chittagong city, Bangladesh"}, {"paperId": "4a31663b4ea97970b8d36d06d6779f0a24da09cf", "title": "Dynamic Optimal Travel Strategies in Intelligent Stochastic Transit Networks"}, {"paperId": "7467312d27ad1cf5c8f1bc62a7f1a992b9f40dfc", "title": "Editorial for Special Issue: “Feature Papers of Forecasting”"}, {"paperId": "cf5fe63de514f168b20c0b87c7dbd15b673e019b", "title": "Acceptability of transportation demand management policy packages considering interactions and socio-economic heterogeneity"}, {"paperId": "a8b66db0dbe7d05df899c0b93455a7e1ead3a635", "title": "Possibilities of forecasting bus average speed on city route"}, {"paperId": "fc1212b48c3702b8aaecf4467f50f3b303c798cd", "title": "Monitoring and controlling real-time bus services: a reinforcement learning procedure for eliminating bus bunching"}, {"paperId": "d0fbecb1b2709a8b63ae10417f8e4052c040c7f0", "title": "TIME-SPACE ASYMMETRY VERSUS TIME-SPACE SYMMETRY"}]}
