{"paperId": "2c0af3d414eafbec3e8b85de54d285ae44239840", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Deterministic and non‐deterministic query optimization techniques in the cloud computing", "abstract": "Query optimization is considered as one of the main challenges of query processing phases in the cloud environments. The query optimizer attempts to provide the most optimal execution plan by considering the possible query plans. Therefore, the execution cost of a query can be affected by some factors, including communication costs, unavailability of resources, and access to large distributed data sets. In addition, it is known as NP‐hard problem and many researchers are focused on this problem in recent years. Some techniques are proposed for solving this problem. Deterministic and non‐deterministic methods are two main categories to study these techniques. The deterministic and non‐deterministic query optimization methods can be further divided into three subcategories, cost‐based query plan enumeration, multiple query optimization, and adaptive query optimization methods. Moreover, this paper presents the advantages and disadvantages of the algorithms for solving the query optimization problems in the cloud environments. Moreover, these techniques are compared in terms of optimization, time, cost, efficiency, and scalability. Finally, some key areas are offered to improve the cloud query optimization mechanisms in the future.", "venue": "Concurrency and Computation", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-05", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "31"}, "authors": [{"authorId": "73185062", "name": "E. Azhir"}, {"authorId": "2253670", "name": "Nima Jafari Navimipour"}, {"authorId": "144513368", "name": "M. Hosseinzadeh"}, {"authorId": "144499901", "name": "A. Sharifi"}, {"authorId": "66424117", "name": "A. Darwesh"}], "citations": [{"paperId": "18d0de44b37e1c6c010a2ee644025d55d99eb73b", "title": "Optimization of Microphone Placement for Audio-based Modeling of Construction Jobsites"}, {"paperId": "1460c8081413a0c877aa8d89bbd6cf6a72b17a4f", "title": "Two-Stage Dimensionality Reduction for Social Media Engagement Classification"}, {"paperId": "487673a0970030718f8db94d2434756bb28f792e", "title": "GeoNLU: Bridging the gap between natural language and spatial data infrastructures"}, {"paperId": "6fbe76777d92cf62598e8bce0f15d8e7cecbf096", "title": "Secure query processing and optimization in cloud environment: a review"}, {"paperId": "26f8c5f71642c7942ef64e1c267dcc57b99792da", "title": "Integrating blockchain technology and cloud services in healthcare: a security and privacy perspective"}, {"paperId": "c2b85c468b3b3913467a6451f94c8ba504f6816f", "title": "Enhancing Mean-Variance Mapping Optimization Using Opposite Gradient Method and Interior Point Method for Real Parameter Optimization Problems"}, {"paperId": "c90c58ed007baf0058fca23f7512c8c54ad57f8a", "title": "A Hybrid Service Selection and Composition for Cloud Computing Using the Adaptive Penalty Function in Genetic and Artificial Bee Colony Algorithm"}, {"paperId": "101ebe94e575626f2b4861a281cac5127a0e6c77", "title": "Selectivity Estimation of Inequality Joins In Databases"}, {"paperId": "1c4a73f78342cf48b1e9e2cb5418da35feeb5519", "title": "How does cloud computing help businesses to manage big data issues"}, {"paperId": "5b8af8cfb8becec21cced4dff62a30f79c4d0f67", "title": "Performance analysis of selected metaheuristic optimization algorithms applied in the solution of an unconstrained task"}, {"paperId": "a8ae2b8cd0f718aa714d8cdf427f3edf98068678", "title": "A technique for parallel query optimization using MapReduce framework and a semantic-based clustering method"}, {"paperId": "74bec51a66499fcfbced16ff3fce696acf98c9e1", "title": "Healthcare big data processing mechanisms: The role of cloud computing"}, {"paperId": "266d9e20e8ef85caf15a49391697326f1a2ac1b1", "title": "A new model for assessing the impact of ICT and digital knowledge on students’ thoughts and beliefs"}, {"paperId": "e9e456ed69a3a819713c20a8f2e96009782521a0", "title": "An efficient automated incremental density-based algorithm for clustering and classification"}, {"paperId": "a6b2732d37d7215729380b5751e33b0d03eca1a3", "title": "An Interface for User-Centred Process and Correlation Between Large Datasets"}]}
