{"paperId": "2c23939d248e696daa7c716d484c6c5f64cc40c4", "publicationVenue": {"id": "8a7c9905-f8cf-4711-bca6-0ef69aef9823", "name": "International Journal of Information Technology and Decision Making", "type": "journal", "alternate_names": ["Int J Inf Technol Decis Mak"], "issn": "1793-6845", "url": "http://www.worldscinet.com/ijitdm/ijitdm.shtml"}, "title": "Data-Driven Evidential Reasoning Method for Evaluating e-Government Performance", "abstract": "The construction of electronic government (e-government) systems is a process of continuous improvement. It is necessary to evaluate the performance of e-government systems regularly to improve the services provided by government agencies and enhance the exchange of information between governments and citizens. Evaluating e-government performance based on citizens’ experience is a multiple criterion decision making (MCDM) problem under uncertainty, where assessments are qualitative, and many e-government system users are involved. Deriving criterion weights from a large amount of evaluation data is rarely discussed in previous MCDM studies. This paper proposes a data-driven evidential reasoning (DDER) method for evaluating e-government performance. A criteria framework from the citizens’ experience perspective, including service guide clarity, site usability, information sharing, documentation, and the availability of e-services, is proposed. Belief structures are used to portray uncertain assessments from e-government system users. The criterion weights are learned from the data by minimizing the dissimilarity between the aggregation assessments of the alternatives on each criterion and citizens’ historical observations on a whole. A case study is conducted in 16 cities of Anhui province in China to evaluate the performance of e-government systems. The ranking results verified the applicability and effectiveness of the proposed method.", "venue": "International Journal of Information Technology and Decision Making", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-07", "journal": {"name": "Int. J. Inf. Technol. Decis. Mak.", "pages": "261-285", "volume": "20"}, "authors": [{"authorId": "2118771841", "name": "Ying Yang"}, {"authorId": "2111827186", "name": "Rui-Xue Lu"}, {"authorId": "2065787538", "name": "Min Xue"}, {"authorId": "1720840", "name": "Zhiqin Shou"}, {"authorId": "47987932", "name": "Jianbo Yang"}, {"authorId": "2116845076", "name": "Lei Fu"}], "citations": [{"paperId": "714d4fc76cccec00ead1b2520076a606df5016d9", "title": "Application of MCDM/MCDA methods in city rankings - review and comparative analysis"}]}
