{"paperId": "2c26279cb7935d72e06b66b26224bb5f3a6c665e", "publicationVenue": {"id": "e5bfb038-10b2-4e43-b1e6-fea5aae180cf", "name": "ITM Web of Conferences", "alternate_names": ["ITM Web Conf"], "issn": "2271-2097", "url": "https://web.archive.org/web/*/https:/www.itm-conferences.org/", "alternate_urls": ["https://www.itm-conferences.org/"]}, "title": "AIoT with I4.0: the effect of Internet of Things and Artificial Intelligence technologies on the industry 4.0", "abstract": "The Internet of Things (IoT) extend the connectivity into billions of IoT devices around the world. Artificial Intelligence (AI) is the best solution to manage huge data flow and storage in IoT network. Nowadays, IoT is becoming more popular with the invention of high internet speed and many advanced sensors that can be integrated into a microcontroller. Internet of Things relies on Artificial Intelligence technology which gives the term of Artificial Intelligence of Things (AIoT).\nAIoT is transformational and mutually beneficial for both technologies, as AI adds values to IoT through materials and software. This fusion impacts the revolution of industry 4.0 such as maintenance, production chains, optimization and logistics applied in industries to achieve increased productivity, profitability, efficiency, safety, and security.In this paper we will discuss the merge of Artificial Intelligence and Internet of Things, the soft-hard of AIoT and the impact of AIoT on the industry 4.0 applications.", "venue": "ITM Web of Conferences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "ITM Web of Conferences"}, "authors": [{"authorId": "2168759972", "name": "Nasreddine Haqiq"}, {"authorId": "47257727", "name": "M. Zaim"}, {"authorId": "10384755", "name": "Issam Bouganssa"}, {"authorId": "72628972", "name": "A. Salbi"}, {"authorId": "40536937", "name": "M. Sbihi"}], "citations": [{"paperId": "385e1d9e1f49d823e08e53fe1f08f404020c9f89", "title": "Approaches and Opportunities of Using Machine Learning Methods in Telecommunications and Industry 4.0"}]}
