{"paperId": "2c2997a114ede637cb2a455523e54ef0ca3a1129", "publicationVenue": {"id": "ba675c4e-f2dc-454e-9e38-d195732ed2b6", "name": "IEEE International Conference on Fuzzy Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Fuzzy Syst", "FUZZ-IEEE"]}, "title": "Chi-BD-DRF: Design of Scalable Fuzzy Classifiers for Big Data via A Dynamic Rule Filtering Approach", "abstract": "Big data classification problems are known to be no longer addressable by sequential algorithms. Therefore, it is necessary to design and develop novel solutions to provide accurate yet interpretable models in a tolerable elapsed time. In this area, Fuzzy Rule-Based Classification Systems are very advantageous due to their intrinsic interpretable and accurate capabilities. However, when these systems are applied in Big Data scenarios, the size of the rule set can become too large to be useful, whereas many of the generated rules could be associated with the non-dense areas or outliers. The presence of such rules in the rule base not only increases the running time and computation overheads but also affects on the interpretability of the fuzzy system. In this contribution, we propose a novel approach to obtain compact and accurate fuzzy models for Big data problems in a linearly scalable complex time. To do so, a dynamic filtering approach is applied to remove low supporting rules. Moreover, an efficient computation of the rules’ weights is presented to improve the accuracy of the predictions. This model is developed for Big Data analytics by using Apache Spark framework. This allows taking advantage of the built-in resources and directives for a transparent distributed computing, as well as the machine learning pipeline to ease the complete processing. Experimental results, using different Big Data problems, confirmed the goodness of the proposed algorithm with respect to the baseline fuzzy classifier.", "venue": "IEEE International Conference on Fuzzy Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE)", "pages": "1-7"}, "authors": [{"authorId": "30935111", "name": "Fatemeh Aghaeipoor"}, {"authorId": "144533626", "name": "M. Javidi"}, {"authorId": "1778602", "name": "I. Triguero"}, {"authorId": "143741583", "name": "Alberto Fernández"}], "citations": [{"paperId": "ff45c1531f3e557594c1cfd48205aa0f51edb19b", "title": "QChi: A Faster Classification Algorithm Based on Wang–Mendel Algorithm"}, {"paperId": "677110011dab0810b9bb116f19aeef13be779bc4", "title": "Granular-Ball Fuzzy Set and Its Implementation in SVM"}, {"paperId": "2ca01bba6f4a4007e1b5f6f24d22ce20e30fd8ce", "title": "Transportation Analytics with Fuzzy Logic and Regression"}, {"paperId": "a62c654950ddd8aa117046e61c6080519b50b850", "title": "A Fuzzy-Logic Based Multi-Dimensional Analysis of Traffic Incident Data"}, {"paperId": "72021864c9edff64e60c457b97a2ec18473eff7f", "title": "A Rough Set System for Mining from Streaming Data"}, {"paperId": "0fda171b93c6d32f246a801c522cb04814254d8b", "title": "A new multi-rules approach to improve the performance of the Chi fuzzy rule classification algorithm"}, {"paperId": "a378429c253733d8adc4bb0e387059f5a1d2a9e3", "title": "IFC-BD: An Interpretable Fuzzy Classifier for Boosting Explainable Artificial Intelligence in Big Data"}, {"paperId": "8ef1d56022f334eb8ef13214d5862ca5ad0c0b21", "title": "Fuzzy Granular-Ball Computing Framework and Its Implementation in SVM"}]}
