{"paperId": "2c2dcd75b6ea3334b2f00bdca8293111a46cdfcb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Hyperledger Fabric-based Lightweight Group Management (H-LGM) for IoT Devices", "abstract": "Internet of Things (IoT) is a network that can communicate between devices without human intervention. In this network, IoT devices collect sensor data and provide them for various applications. However, data collected from the device may include sensitive information. If this information is leaked, several serious problems will occur. Therefore, access control is presented to allow only authorized users to access important data. This paper proposes a model for organizing and managing groups with the group key (GK) so that only the authorized users can share data for access control. In particular, rekeying overhead is reduced. Because the IoT devices are resource-constrained, the network lifetime may be reduced as the rekeying overhead increases. There is a problem when group communication between multiple users is not used. If multiple users can easily access all data, the leakage of sensitive information will increase. To solve this problem, only users who need to share data join in a group based on the hyperledger fabric. Our approach groups users with the same GK and protects sensitive data by using secure communication links within the group. In addition, a trusted agent for rekeying sends a new GK to users in the group. Therefore, the security of data is guaranteed, and the network lifetime is extended. We analyze the storage cost, delay, and processing time for rekeying, and we also compare them according to the number of users and the depth of the key tree. The results of the performance analysis show that the proposed hyperledger fabric-based lightweight group management (H-LGM) outperforms the existing method in terms of storage cost, delay, and processing time.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "98585623", "name": "Ju-Hyuck Maeng"}, {"authorId": "2166149137", "name": "Yoonnyoung Heo"}, {"authorId": "1686981", "name": "I. Joe"}], "citations": [{"paperId": "c00ed3a7b7f43a71eb0fdfc0bdaea7e4f19e381f", "title": "Enhancing IoT Data Security: Using the Blockchain to Boost Data Integrity and Privacy"}, {"paperId": "18ee7ea3756cd081f1d0ff9a4f6c64953cb63bbc", "title": "IoT security with blockchain: A review"}, {"paperId": "f7a99782b3006467dae753a40a5a4d9bd1bbd392", "title": "Prototyping a Hyperledger Fabric-Based Security Architecture for IoMT-Based Health Monitoring Systems"}, {"paperId": "8939f9f00cf64e357dee3fb5f036e95b39db3f5c", "title": "A Tutorial on the Implementation of a Hyperledger Fabric-based Security Architecture for IoMT"}]}
