{"paperId": "2c33b8bb3664bd3ee048dc1ae25dd2113d7610cd", "publicationVenue": {"id": "6dcf82ac-7373-43d7-9939-cdc8dcc3fd2f", "name": "IAES International Journal of Artificial Intelligence (IJ-AI)", "type": "journal", "alternate_names": ["IAES Int J Artif Intell", "IAES International Journal of Artificial Intelligence", "IAES Int J Artif Intell (IJ-AI"], "issn": "2089-4872", "url": "http://iaesjournal.com/online/index.php/IJAI"}, "title": "Potential directions on coronary artery disease prediction using machine learning algorithms: A survey", "abstract": "Coronary artery disease (CAD) is the most ubiquitous and protuberant cause of fatal death. The hit in mortality rate is because of certain lifestyle variables including unhealthy diet, usage of tobaccos and drugs, physical inactivity, and environmental pollution. Traditional screening tests including computed tomography, angiography, electrocardiography, and magnetic resonance imaging are employed for diagnosis and would necessitate more manpower. Machine learning (ML) has been utilized in healthcare to create early predictions from massive volumes of data. The Scopus, Web of Science databases were exhaustively searched utilizing a search strategy that comprised CAD prediction, cardiac illness detection, and heart disease categorization. After applying the inclusion and exclusion criteria to the 99 articles obtained, the population of the study was composed of 30 articles. This review study offers an organized look at the articles published in ML-based CAD detection and classification models that include clinical variables. The use of ML could produce amazing results in CAD detection, as evidenced by the classifiers random forest, decision tree, and k-nearest-neighbour with accuracy being >90%. The use of ML in CAD diagnosis lowers false-positive, and false-negative errors, and presents a special opportunity by providing patients quick, and affordable diagnostic services.", "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-01", "journal": {"name": "IAES International Journal of Artificial Intelligence (IJ-AI)"}, "authors": [{"authorId": "2276467587", "name": "Anu Ragavi Vijayaraj"}, {"authorId": "2276471423", "name": "Subbulakshmi Pasupathi"}], "citations": []}
