{"paperId": "2c33f8b51e75721d39c3c3be52a1ffbe8fca70c5", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Learn-as-you-go with Megh: Efficient Live Migration of Virtual Machines", "abstract": "Cloud providers leverage live migration of virtual machines to reduce energy consumption and allocate resources efficiently in data centers. Each migration decision depends on three questions: when to move a virtual machine, which virtual machine to move and where to move it? Dynamic, uncertain, and heterogeneous workloads running on virtual machines make such decisions difficult. Knowledge-based and heuristics-based algorithms are commonly used to tackle this problem. Knowledge-based algorithms, such as MaxWeight scheduling algorithms, are dependent on the specifics and the dynamics of the targeted Cloud architectures and applications. Heuristics-based algorithms, such as MMT algorithms, suffer from high variance and poor convergence because of their greedy approach. We propose an online reinforcement learning algorithm called Megh. Megh does not require prior knowledge of the workload rather learns the dynamics of workloads as-it-goes. Megh models the problem of energy- and performance-efficient resource management during live migration as a Markov decision process and solves it using a functional approximation scheme. While several reinforcement learning algorithms are proposed to solve this problem, these algorithms remain confined to the academic realm as they face the curse of dimensionality. They are either not scalable in real-time, as it is the case of MadVM, or need an elaborate offline training, as it is the case of Q-learning. These algorithms often incur execution overheads which are comparable with the migration time of a VM. Megh overcomes these deficiencies. Megh uses a novel dimensionality reduction scheme to project the combinatorially explosive state-action space to a polynomial dimensional space with a sparse basis. Megh has the capacity to learn uncertain dynamics and the ability to work in real-time without incurring significant execution overhead. Megh is both scalable and robust. We implement Megh using the CloudSim toolkit and empirically evaluate its performance with the PlanetLab and the Google Cluster workloads. Experiments validate that Megh is more cost-effective, converges faster, incurs smaller execution overhead and is more scalable than MadVM and MMT. An empirical sensitivity analysis explicates the choice of parameters in experiments.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1786-1801", "volume": "30"}, "authors": [{"authorId": "3214072", "name": "D. Basu"}, {"authorId": "2108010750", "name": "Xiayang Wang"}, {"authorId": "2115399820", "name": "Yang Hong"}, {"authorId": "2118438836", "name": "Haibo Chen"}, {"authorId": "1735321", "name": "S. Bressan"}], "citations": [{"paperId": "c9314bc9fded12740c3fee75cc102c1d2d657d84", "title": "Multilevel scheduling mechanism for a stochastic fog computing environment using the HIRO model and RNN"}, {"paperId": "2c8bccb96bc922eb57d824b573a417e31597fa39", "title": "Cloud-Native Computing: A Survey From the Perspective of Services"}, {"paperId": "07f72693aff855ca920dd303ae2e49b057087d5f", "title": "MRLCC: an adaptive cloud task scheduling method based on meta reinforcement learning"}, {"paperId": "c8eebfd18624b4579ea472d4a3407a3d05524cbb", "title": "Reducing idleness in financial cloud services via multi-objective evolutionary reinforcement learning based load balancer"}, {"paperId": "9e7afe349d53118f9b0021c5cfdd18339c44745b", "title": "A Novel Method for Dynamic Scheduling for Stochastic Edge-Cloud Computing Environments"}, {"paperId": "211dc0d25072679bf302a7987c38c169b8594c7e", "title": "Energy‐efficiency and sustainability in new generation cloud computing: A vision and directions for integrated management of data centre resources and workloads"}, {"paperId": "1da615bb78e974ac267841ce89d89c6565914707", "title": "VM performance-aware virtual machine migration method based on ant colony optimization in cloud environment"}, {"paperId": "9c8436bd08a08447cdc05edcb8652c72491b0119", "title": "Analysis of Dynamic Scheduling for Edge Cloud Computing"}, {"paperId": "39d57bbe1c1fc7cf14fed771e30c076cfe276909", "title": "CoupHM: Task Scheduling Using Gradient Based Optimization for Human-Machine Computing Systems"}, {"paperId": "88b7d03089168d66ff7a5ab3dcf884d2830d850e", "title": "Performance Analysis of Cloud Hypervisor using Different Workloads in Virtualization"}, {"paperId": "4c82f091a264ca4826536efe114d2930d7e9dc96", "title": "DeepFT: Fault-Tolerant Edge Computing using a Self-Supervised Deep Surrogate Model"}, {"paperId": "ecb6e6c806b6ae5ac52a018d5cebe1382f75a12c", "title": "A Deep Reinforcement Learning based VM Scheduling Strategy Decreasing Data Center Communication costs"}, {"paperId": "69b1ba6b445f443aaa84492e1b703cf245093478", "title": "VM Performance Optimization Virtual Machine Migration Method Based on Ant Colony Optimization in Cloud"}, {"paperId": "715c2dc6299f0f106bb549c923d8f2c83d705b8f", "title": "SimTune: bridging the simulator reality gap for resource management in edge-cloud computing"}, {"paperId": "8994b6ae6c9b4b955275c8cb7b68bc13af50725d", "title": "DRAGON: Decentralized Fault Tolerance in Edge Federations"}, {"paperId": "bac79e1374a5fef6fcccf1ea48fbac64a0600b8e", "title": "AI Augmented Edge and Fog Computing: Trends and Challenges"}, {"paperId": "20e4ae7bdda52e236a3495b693fbb389f738ee6d", "title": "System Optimization of Talent Life Cycle Management Platform Based on Decision Tree Model"}, {"paperId": "026da8d626f8bbebbcf1d313871ec05d54980484", "title": "PreGAN: Preemptive Migration Prediction Network for Proactive Fault-Tolerant Edge Computing"}, {"paperId": "654dded68682745deee0c1e26fa969537747604c", "title": "HUNTER: AI based Holistic Resource Management for Sustainable Cloud Computing"}, {"paperId": "9a1895541c46b2a21715a432b5a8b9e1a00e4e46", "title": "Energy-efficient collaborative optimization for VM scheduling in cloud computing"}, {"paperId": "3b7bdde3323574fd21024042f976a146c5ea028c", "title": "A review paper on hypervisor and virtual machine security"}, {"paperId": "466d0861290dfb7fc56a137b41c67fa7749cb828", "title": "Energy and Thermal-aware Resource Management of Cloud Data Centres: A Taxonomy and Future Directions"}, {"paperId": "8557d9505a7e1b09dced5b019259004d56cc1b95", "title": "COSCO: Container Orchestration Using Co-Simulation and Gradient Based Optimization for Fog Computing Environments"}, {"paperId": "1712c9ed83faa98cfaf373dc7c48574ac15c1035", "title": "Improving the energy-efficiency of virtual machines by I/O compensation"}, {"paperId": "af3bc3ee732af446f4879034afd4d3fed3eef8ef", "title": "ADRL: A Hybrid Anomaly-Aware Deep Reinforcement Learning-Based Resource Scaling in Clouds"}, {"paperId": "090c1c1e23516b553d434b77a6559e8f5202b6fb", "title": "Sova: A Software-Defined Autonomic Framework for Virtual Network Allocations"}, {"paperId": null, "title": "2020 Index IEEE Transactions on Parallel and Distributed Systems Vol. 31"}, {"paperId": "11981c3a83fc9de5f8d1e3f04911e5126a04776e", "title": "An Architecture for the Management of Virtual Machine Migrations"}, {"paperId": "ef9267f8f60c70f649923c01a1dc375a9be0e1ac", "title": "A Review of Intrusion Detection and Blockchain Applications in the Cloud: Approaches, Challenges and Solutions"}, {"paperId": "4bd4190c3b283cba97873aa406311384d77c1f9e", "title": "RLSK: A Job Scheduler for Federated Kubernetes Clusters based on Reinforcement Learning"}, {"paperId": "fa12b4c741ef443078a60a37b7fe8bb558c8b90e", "title": "Workload Scheduling on heterogeneous Mobile Edge Cloud in 5G networks to Minimize SLA Violation"}, {"paperId": "3f7e0a586513bd6f6d5d8e399b0695438d6000e3", "title": "DeepJS: Job Scheduling Based on Deep Reinforcement Learning in Cloud Data Center"}, {"paperId": "a7c733da991f74ec8017578a8325b2202096ce3a", "title": "SOVMM: Survey on Virtual Machine Migration"}, {"paperId": "0036975a5e51251e3ccde743ecc3aa18a9ae7623", "title": "A Survey on Virtual Machine Migration: Challenges, Techniques, and Open Issues"}, {"paperId": "875bb853ee46cf8af7da409c7fef8a2dcd035dd1", "title": "SIGMETRICS: G: SplitPlace: Efficient Splitting and Placement of Deep Neural Networks on Mobile Edge Environments"}, {"paperId": "268b8c34eb737ebcf61fd7c19b5762e80a557320", "title": "An Efficient On-Demand Virtual Machine Migration in Cloud Using Common Deployment Model"}, {"paperId": "2a825bf2293bb32aa325cdfeffd69c2c589955a7", "title": "A Review on Dynamic Virtual Machine Consolidation Approaches for Energy-Efficient Cloud Data Centers"}, {"paperId": "d0d69a09d3793ed4b829f055b7dc473cc337e79b", "title": "Anomaly-aware Management of Cloud Computing Resources"}]}
