{"paperId": "2c36813836dea1ec5b7115af8034b6387dfeec3c", "publicationVenue": null, "title": "Design and Development of an Agricultural Mobile Application using Machine Learning", "abstract": "Machine learning algorithms such as KNN and SVM can provide assistance with a variety of issues, including determining what crops should be planted when, as well as determining when the field requires additional water and fertilizer. The proposed system is intended to collect data on the current condition of the soil and make use of that data in order to establish the types of nutrients that are present in the soil. Farmers will be able to identify pest damage to their crops using camera sensor modules for the internet of things. They will be able to take the appropriate actions now that they have the ability to. Through the use of the app, the farmer is able to receive notifications and other information regarding crops based on the conditions of the soil and the weather. The types of soil, crops, nitrogen, potassium, and phosphorus are a few examples of the types of information that fall under this category. In addition to the characteristics of the soil and the weather, farmers can also base their decisions on the kind of crops they grow based on these elements. Because of this, the farmer is given the ability to take the appropriate measures to reduce crop loss and increase crop yield.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "881-886"}, "authors": [{"authorId": "2140188611", "name": "Vempati Krishna"}, {"authorId": "52297605", "name": "Ashish Tamrakar"}, {"authorId": "51499293", "name": "Rajesh Banala"}, {"authorId": "2198498622", "name": "Damera Saritha"}, {"authorId": "2198498660", "name": "A. Rao"}, {"authorId": "96664448", "name": "D. Buddhi"}], "citations": []}
