{"paperId": "2c5e4a5c09b72ca1403cf64cb3bba09f1c4b0854", "publicationVenue": {"id": "38e26272-f1d7-470a-a99f-0b5884c9df6e", "name": "De Computis", "alternate_names": ["Comput"], "issn": "1886-1881", "url": "https://dialnet.unirioja.es/servlet/revista?clave_revista=6205&tipo_busqueda=CODIGO", "alternate_urls": ["http://decomputis.org/ojs/", "https://ideas.repec.org/s/dec/articl.html", "http://www.decomputis.org/"]}, "title": "Integrating the Internet of Things (IoT) in SPA Medicine: Innovations and Challenges in Digital Wellness", "abstract": "Integrating modern and innovative technologies such as the Internet of Things (IoT) and Machine Learning (ML) presents new opportunities in healthcare, especially in medical spa therapies. Once considered palliative, these therapies conducted using mineral/thermal water are now recognized as a targeted and specific therapeutic modality. The peculiarity of these treatments lies in their simplicity of administration, which allows for prolonged treatments, often lasting weeks, with progressive and controlled therapeutic effects. Thanks to new technologies, it will be possible to continuously monitor the patient, both on-site and remotely, increasing the effectiveness of the treatment. In this context, wearable devices, such as smartwatches, facilitate non-invasive monitoring of vital signs by collecting precise data on several key parameters, such as heart rate or blood oxygenation level, and providing a perspective of detailed treatment progress. The constant acquisition of data thanks to the IoT, combined with the advanced analytics of ML technologies, allows for data collection and precise analysis, allowing real-time monitoring and personalized treatment adaptation. This article introduces an IoT-based framework integrated with ML techniques to monitor spa treatments, providing tailored customer management and more effective results. A preliminary experimentation phase was designed and implemented to evaluate the system’s performance through evaluation questionnaires. Encouraging preliminary results have shown that the innovative approach can enhance and highlight the therapeutic value of spa therapies and their significant contribution to personalized healthcare.", "venue": "De Computis", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-06", "journal": {"name": "Comput.", "pages": "67", "volume": "13"}, "authors": [{"authorId": "1777064", "name": "M. Casillo"}, {"authorId": "2276531269", "name": "Liliana Cecere"}, {"authorId": "2244549602", "name": "Francesco Colace"}, {"authorId": "2120663075", "name": "Angelo Lorusso"}, {"authorId": "26921996", "name": "D. Santaniello"}], "citations": []}
