{"paperId": "2c6ae2908404fab2f490ca31651c5bca4935ce7a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Autothrottle: A Practical Framework for Harvesting CPUs from SLO-Targeted Microservices", "abstract": "As the number of distributed services (or microservices) of cloud-native applications grows, resource management becomes a challenging task. These applications tend to be user-facing and latency-sensitive, and our goal is to continuously minimize the amount of CPU resources allocated while still satisfying the application latency SLO. Although previous efforts have proposed simple heuristics and sophisticated ML-based techniques, we believe that a practical resource manager should accurately scale CPU resources for diverse applications, with minimum human efforts and operation overheads. To this end, we ask: can we systematically break resource management down to subproblems solvable by practical policies? Based on the notion of CPU-throttle-based performance target, we decouple the mechanisms of SLO feedback and resource control, and implement a two-level framework— Autothrottle . It combines a lightweight learned controller at the global level, and agile per-microservice controllers at the local level. We evaluate Autothrottle on three microservice applications, with both short-term and 21-day production workload traces. Empirical results show Autothrottle’s superior CPU core savings up to 26.21% over the best-performing baselines across applications, while maintaining the latency SLO.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2212.12180"}, "authors": [{"authorId": "2117414230", "name": "Zibo Wang"}, {"authorId": "2198272189", "name": "Pinghe Li"}, {"authorId": "2745171", "name": "C. Liang"}, {"authorId": "2110920260", "name": "Feng Wu"}, {"authorId": "51129027", "name": "Francis Y. Yan"}], "citations": [{"paperId": "e45769aae0f1b855b78c2f0036bc742812a43c20", "title": "Intelligent Monitoring Framework for Cloud Services: A Data-Driven Approach"}, {"paperId": "911653c544dad84e56b99bde16a8fb50cdbc278b", "title": "Adaptive resource scaling of service mesh in cloud computing"}]}
