{"paperId": "2c79cd9ab26713953b760b5bedba20c5df87766c", "publicationVenue": {"id": "e4adcb2e-037d-4726-9cac-2ff777ed2507", "name": "Geographies", "type": "journal", "issn": "2673-7086"}, "title": "OpenDroneMap: Multi-Platform Performance Analysis", "abstract": "This paper analyzes the performance of the open-source OpenDroneMap image processing software (ODM) across multiple platforms. We tested desktop and laptop computers as well as high-performance cloud computing and supercomputers. Multiple machine configurations (CPU cores and memory) were used. We used eBee S.O.D.A. drone image datasets from Namibia and northern Finland. For testing, we used the OpenDroneMap command line tool with default settings and the fast orthophoto option, which produced a good quality orthomosaic. We also used the “rerun-all option” to ensure that all jobs started from the same point. Our results show that ODM processing time is dependent upon the number of images, a high number of which can lead to high memory demands, with low memory leading to an excessively long processing time. Adding additional CPU cores is beneficial to ODM up to a certain limit. A 20-core machine seems optimal for a dataset of about 1000 images, although 10 cores will result only in slightly longer processing times. We did not find any indication of improvement when processing larger datasets using 40-core machines. For 1000 images, 64 GB memory seems to be sufficient, but for larger datasets of about 8000 images, higher memory of up to 256 GB is required for efficient processing. ODM can use GPU acceleration, at least in some processing stages, reducing processing time. In comparison to commercial software, ODM seems to be slower, but the created orthomosaics are of equal quality.", "venue": "Geographies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-17", "journal": {"name": "Geographies"}, "authors": [{"authorId": "1505955719", "name": "Augustine-Moses Gaavwase Gbagir"}, {"authorId": "2224237483", "name": "Kylli Ek"}, {"authorId": "2555677", "name": "A. Colpaert"}], "citations": [{"paperId": "1c75dcd6455277dc19c0fcf3c5001df96473cb98", "title": "Self-Organizing Multi-User UAV Swarm Simulation Platform"}, {"paperId": "8e2c8948f755dd36ec690c7b4285cee155a4d273", "title": "Perspectives on Advanced Technologies in Spatial Data Collection and Analysis"}]}
