{"paperId": "2c95cb9e46a04401b4e5731798c16314ba23e656", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Industrial Big Data: From Data to Information to Actions", "abstract": "Technologies related to the Big Data term are increasingly focusing the industrial sector. The underlying concepts are suited to introduce disruptive changes in the various ways information is generated, integrated and used for optimization in modern production plants. Nevertheless, the adoption of these web-inspired technologies in an industrial environment is connected to multiple challenges, as the manufacturing industry has to cope with specific requirements and prerequisites that differ from common Big Data applications. Existing architectural approaches appear to be either partially incomplete or only address individual aspects of the challenges arising from industrial big data. This paper has the goal to thoroughly review existing approaches for industrial big data in manufacturing and to derive a consolidated architecture that is able to deal with all major problems of the industrial big data integration and deployment chain. Appropriate technologies to realize the presented approach are accordingly pointed out.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-05-02", "journal": {"pages": "137-146"}, "authors": [{"authorId": "40987903", "name": "Andreas Kirmse"}, {"authorId": "46186560", "name": "Felix Kuschicke"}, {"authorId": "33577140", "name": "Max Hoffmann"}], "citations": [{"paperId": "037ea200fff605ddb1cfa8c1e7b9cce61a1d4c5c", "title": "KEPERLUAN PEMBINAAN MODEL PENGURUSAN DATA RAYA PEJABAT PENDIDIKAN DAERAH DI MALAYSIA"}, {"paperId": "00231bb5599a1b8bd9695127b6f9f7367e0ca795", "title": "A neural network-based production process modeling and variable importance analysis approach in corn to sugar factory"}, {"paperId": "237e4c1eb7114546f6aec80b61afef6d3fa91ab6", "title": "Process management of ergonomic workplace based on augmented reality principles"}, {"paperId": "a61e744489dd16dc38485a3e48287071467f26d9", "title": "Digitalisierung des Fehlermanagements"}, {"paperId": "c2aaaa0b2a22f3e88fa2a91e0078a46a8980e55b", "title": "How To RAMI 4.0: Towards An Agent-based Information Management Architecture"}, {"paperId": "483b16ed0f67dcfd7d9586ce36d1495e7cd76c8f", "title": "Data-driven decision support for process quality improvements"}, {"paperId": "c90ea2f60aed1d2168708b3cd607d7c4a345674e", "title": "Towards predictive quality in production by applying a flexible process-independent meta-model"}]}
