{"paperId": "2c9997fbed327f626a6f29c3aa9739be3d69dd60", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Machine Learning for Large-Scale Optimization in 6G Wireless Networks", "abstract": "The sixth generation (6G) wireless systems are envisioned to enable the paradigm shift from “connected things” to “connected intelligence”, featured by ultra high density, large-scale, dynamic heterogeneity, diversified functional requirements, and machine learning capabilities, which leads to a growing need for highly efficient intelligent algorithms. The classic optimization-based algorithms usually require highly precise mathematical model of data links and suffer from poor performance with high computational cost in realistic 6G applications. Based on domain knowledge (e.g., optimization models and theoretical tools), machine learning (ML) stands out as a promising and viable methodology for many complex large-scale optimization problems in 6G, due to its superior performance, computational efficiency, scalability, and generalizability. In this paper, we systematically review the most representative “learning to optimize” techniques in diverse domains of 6G wireless networks by identifying the inherent feature of the underlying optimization problem and investigating the specifically designed ML frameworks from the perspective of optimization. In particular, we will cover algorithm unrolling, learning to branch-and-bound, graph neural network for structured optimization, deep reinforcement learning for stochastic optimization, end-to-end learning for semantic optimization, as well as wireless federated learning for distributed optimization, which are capable of addressing challenging large-scale problems arising from a variety of crucial wireless applications. Through the in-depth discussion, we shed light on the excellent performance of ML-based optimization algorithms with respect to the classical methods, and provide insightful guidance to develop advanced ML techniques in 6G networks. Neural network design, theoretical tools of different ML methods, implementation issues, as well as challenges and future research directions are also discussed to support the practical use of the ML model in 6G wireless networks.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-03", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "2088-2132", "volume": "25"}, "authors": [{"authorId": "1830418792", "name": "Yandong Shi"}, {"authorId": "22239538", "name": "Lixiang Lian"}, {"authorId": "2237119117", "name": "Yuanming Shi"}, {"authorId": "2117423865", "name": "Zixin Wang"}, {"authorId": "91986424", "name": "Yong Zhou"}, {"authorId": "2869515", "name": "Liqun Fu"}, {"authorId": "2075397928", "name": "Lin Bai"}, {"authorId": "47540306", "name": "Jun Zhang"}, {"authorId": "2155467725", "name": "Wei Zhang"}], "citations": [{"paperId": "e0227c793ed539dc2444656efaf923472c0ac588", "title": "Graph Neural Network Meets Multi-Agent Reinforcement Learning: Fundamentals, Applications, and Future Directions"}, {"paperId": "65996d57856a406c16f07059ede732034fc955e8", "title": "Digital Twin Channel for 6G: Concepts, Architectures and Potential Applications"}, {"paperId": "fcaae7f8f18a5991eb1f154a974680db809a6a7f", "title": "Hierarchical Digital Twin for Efficient 6G Network Orchestration via Adaptive Attribute Selection and Scalable Network Modeling"}, {"paperId": "741cdf325e4a433dc5988d06b0c94fef857ebb8f", "title": "Federated learning enables 6 G communication technology: Requirements, applications, and integrated with intelligence framework"}, {"paperId": "d63a56fdbd136ef250c9818f1fe881bcadece6df", "title": "A Survey of PAPR Techniques Based on Machine Learning"}, {"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "bef0500a4607b34c36acc2b8c9e0e752fc4e9dc6", "title": "Experimental Design of Machine Learning based Enhanced Communication Efficiency and Noise Reduction over Mobile Cellular Networks"}, {"paperId": "8925f60ee3d21968cfdb226142b4636420a63418", "title": "Multi-Task-Oriented Broadcast for Edge AI Inference via Information Bottleneck"}, {"paperId": "be4bbe1f0b400d31714a87c151c5ad2421a08f3f", "title": "Towards defining industry 5.0 vision with intelligent and softwarized wireless network architectures and services: A survey"}, {"paperId": "4957440a41387c98c38a9e92a93073ef78fd4d2c", "title": "Optimizing Multicarrier Multiantenna Systems for LoS Channel Charting"}, {"paperId": "75f4c30c48fcb39420e1f2d654a85e2f03476f05", "title": "AI-Native Transceiver Design for Near-Field Ultra-Massive MIMO: Principles and Techniques"}, {"paperId": "5e20e4eadff4f292ea8ef84f7a1b7e08fe22e78e", "title": "A Practical Fast Model Inference System Over Tiny Wireless Device"}, {"paperId": "b8522863cac19586784e12c91cf507cc71b7fd09", "title": "Convex Optimization-Based Sidelobe Control for Planar Arrays"}, {"paperId": "67f15823863f11e18daa5c7565360347e10b75c7", "title": "Joint Age-Based Client Selection and Resource Allocation for Communication-Efficient Federated Learning Over NOMA Networks"}, {"paperId": "2df3b3c3c3774120e1e1b2e265e378505d78cf5e", "title": "Efficient optimization algorithms for various machine learning tasks, including classification, regression, and clustering"}, {"paperId": "b08f38b3412ffcf83cb7c3f0b3d907305b0fd1f1", "title": "WLAN Channel Status Duration Prediction for Audio and Video Services Using Probabilistic Neural Networks"}, {"paperId": "8d88f0fb9b54d7b05d2421c5b487970f1518d742", "title": "Resilient Disaster Relief in Industrial IoT: UAV Trajectory Design and Resource Allocation in 6G Non-Terrestrial Networks"}, {"paperId": "8a385503f7281cc0bbe48fc468f6b1ab0c6c21c4", "title": "A Survey on Federated Learning for Reconfigurable Intelligent Metasurfaces-Aided Wireless Networks"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}]}
