{"paperId": "2cbb84659a2d0b2a248b76cb42cde112d17cd9c4", "publicationVenue": {"id": "772d0ed8-03a4-4a6b-abc8-cb5e13b42e94", "name": "International Journal of Information Technology Project Management", "type": "journal", "alternate_names": ["Int J Inf Technol Proj Manag"], "issn": "1938-0240", "url": "https://www.igi-global.com/", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-information-technology-project/1103", "http://www.igi-global.com/bookstore/titledetails.aspx?TitleId=1103"]}, "title": "Examining the Critical Success Factors in IT Projects: A Two-Panel Delphi Study", "abstract": "Many companies experience IT project failures in relatively new areas such as Big Data, Data Science, Enterprise Systems, Blockchain, Cloud Computing, IT security, and IoT. Because of inadequate research in identifying critical success factors for these projects, we conducted a Delphi study employing separate panels for each of two kinds of project implementations, those using a predictive lifecycle approach and those using an adaptive lifecycle approach. We found common critical success factors: user/client involvement, senior management support, effective monitoring and control, effective communication and feedback, good change and configuration management, having a competent project manager, proper project leadership, and excellent vendor performance. Both predictive and adaptive lifecycle IT projects had certain unique critical success factors. The findings provide guidance to IT Project Managers.", "venue": "International Journal of Information Technology Project Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Inf. Technol. Proj. Manag.", "pages": "1-38", "volume": "13"}, "authors": [{"authorId": "1885265", "name": "Abirami Radhakrishnan"}, {"authorId": "2108999078", "name": "J. Davis"}, {"authorId": "2780492", "name": "D. David"}], "citations": []}
