{"paperId": "2cbf041608704c92f3f32c4d703d35a09b5a8b53", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "Harmony: An Approach for Geo-distributed Processing of Big-Data Applications", "abstract": "Big-data application processing is increasingly geo-distributed, a paradigm shift from the traditional cluster-based processing frameworks. As the communication time for data movement across geo-distributed data centers is not a design criterion for traditional cluster-based processing approaches, there are research gaps in the algorithms used for staging and scheduling big-data applications for geo-distributed clusters. We address these gaps by proposing Harmony, an approach consisting of both staging and scheduling strategies to minimize an application’s total execution time. The staging strategy of Harmony exploits the intra-stage parallelism by having concurrent operators within a stage in contrast to the traditional Apache spark which uses fine-grained stages, thus reducing the computation time within each stage. Secondly, the scheduling strategy of Harmony reduces data transfers between geo-distributed data centers by exploiting data locality and thus reducing communication time and total execution time. The proposed approach Harmony achieves a speedup of two times with respect to geo-distributed Apache Spark. In addition, Harmony achieves a speedup of 1.6 times and 2.1 times when compared with the state-of-the-art framework Iridium for geo-distributed analytics over five locations with uniform and non-uniform network link bandwidths respectively.", "venue": "IEEE International Conference on Cluster Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "1-11"}, "authors": [{"authorId": "120811666", "name": "Han Zhang"}, {"authorId": "3101923", "name": "Lavanya Ramapantulu"}, {"authorId": "1805512", "name": "Y. M. Teo"}], "citations": [{"paperId": "7e18f02a7097b8a56182a44dbe243a10b11f95cf", "title": "DAG-Aware Optimization for Geo-Distributed Data Analytics"}, {"paperId": "6aa2c75874c62fad50b4bcfca25f7c7820b94271", "title": "CloudPilot: Flow Acceleration in the Cloud"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}]}
