{"paperId": "2cc95e3d4b363b950ea4efb59786ba14fcccfc54", "publicationVenue": {"id": "9a58e222-f9d9-4a50-ae92-c687cc5918ec", "name": "International Conference on Information and Communicatiaon Technology", "type": "conference", "alternate_names": ["Int Conf Inf Commun Technol", "ICoICT", "ICT-EurAsia", "International Conference on Information and Communication Technology"]}, "title": "Impact Analysis on Disaster Data for Disaster Risk Reduction from Multiple Stakeholders Perspective", "abstract": "Currently, the process in Disaster Risk Reduction (DRR) relies heavily on geospatial information defined as information contained in topographic maps, thematic maps, plans, charts and satellite images. The preparation and use of geospatial information involve parties such as custodians, data providers, users and vendors. However, nonspatial data also crucial in DRR. Due to different data formats, sizes and type of both spatial and nonspatial data, data processing becomes more complex and time-consuming. Furthermore, some supplied data are lack of specific reasoning behind it. As a result, a volume of spatial and nonspatial data keep piling up daily without any beneficial utilisation. Therefore, this paper aims to investigate the impact of disaster-related data of both spatial and nonspatial that contribute to DRR from multiple stakeholders’ perspective. The research is conducted through a focus group discussion (FGD) interview with a total of 54 agencies that involve in DRR in Selangor State, Malaysia. Based on the findings, vulnerability data is the most impactful data for DRR, followed by base data, hazard data, exposure data and risk impact assessment data. The findings from this study will provide the DRR data priority list from various agencies perspective, which can help to anticipated is asters or at least reduce the risk of disaster. This could also assist the relevant agencies to prepare for DRR management more proactively.", "venue": "International Conference on Information and Communicatiaon Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-06-01", "journal": {"name": "2020 8th International Conference on Information and Communication Technology (ICoICT)", "pages": "1-6"}, "authors": [{"authorId": "1885364181", "name": "Syamil Zayid"}, {"authorId": "2072183966", "name": "Nur Azaliah Abu Bakar"}, {"authorId": "1729547301", "name": "Mageshwari Valachamy"}, {"authorId": "81967556", "name": "N. A. Malek"}, {"authorId": "100706451", "name": "Mohd. Naz'ri bin Mahrin"}, {"authorId": "2052439", "name": "K. A. Razak"}], "citations": []}
