{"paperId": "2cccec391d505368d16bd1703baaab30d307d044", "publicationVenue": {"id": "2a65d17a-afd8-466e-aff3-e0d0fbc84fb0", "name": "International Journal of Intelligent Computing and Cybernetics", "type": "journal", "alternate_names": ["Int J Intell Comput Cybern"], "issn": "1756-378X", "alternate_issns": ["1793-5423"], "url": "https://www.emerald.com/insight/publication/issn/1756-378X", "alternate_urls": ["http://www.emeraldinsight.com/journal/ijicc"]}, "title": "SOM approach for clustering customers using credit card transactions", "abstract": "\nPurpose\nThe purpose of this paper is to generate customer clusters using self-organizing map (SOM) approach, a machine learning technique with a big data set of credit card consumptions. The authors aim to use the consumption patterns of the customers in a period of three months deducted from the credit card transactions, specifically the consumption categories (e.g. food, entertainment, etc.).\n\n\nDesign/methodology/approach\nThe authors use a big data set of almost 40,000 credit card transactions to cluster customers. To deal with the size of the data set and the eliminated the required parametric assumptions the authors use a machine learning technique, SOMs. The variables used are grouped into three as demographical variables, categorical consumption variables and summary consumption variables. The variables are first converted to factors using principal component analysis. Then, the number of clusters is specified by k-means clustering trials. Then, clustering with SOM is conducted by only including the demographical variables and all variables. Then, a comparison is made and the significance of the variables is examined by analysis of variance.\n\n\nFindings\nThe appropriate number of clusters is found to be 8 using k-means clusters. Then, the differences in categorical consumption levels are investigated between the clusters. However, they have been found to be insignificant, whereas the summary consumption variables are found to be significant between the clusters, as well as the demographical variables.\n\n\nOriginality/value\nThe originality of the study is to incorporate the credit card consumption variables of customers to cluster the bank customers. The authors use a big data set and dealt with it with a machine learning technique to deduct the consumption patterns to generate the clusters. Credit card transactions generate a vast amount of data to deduce valuable information. It is mainly used to detect fraud in the literature. To the best of the authors’ knowledge, consumption patterns obtained from credit card transaction are first used for clustering the customers in this study.\n", "venue": "International Journal of Intelligent Computing and Cybernetics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-12", "journal": {"name": "Int. J. Intell. Comput. Cybern.", "pages": "372-388", "volume": "12"}, "authors": [{"authorId": "46322135", "name": "S. Ugurlu"}, {"authorId": "1421573718", "name": "A. Elmorsy"}], "citations": [{"paperId": "0c94de07e888cec79049db1384a7824fc369b173", "title": "Network-based exploratory data analysis and explainable three-stage deep clustering for financial customer profiling"}, {"paperId": "23a89c1acfca56707ebb6f160f1092f96f7b6b5d", "title": "Clustering of Bank Customers using LSTM-based encoder-decoder and Dynamic Time Warping"}, {"paperId": "a2108f2e16c2e6d79202dcdb9a14aedace00d13b", "title": "CDEC: a constrained deep embedded clustering"}]}
