{"paperId": "2cccb63373ba2b4c655aa4a055780d5be153690c", "publicationVenue": null, "title": "Performance Evaluation of Virtual Network Service Function Deployment in Docker Containers", "abstract": "Currently, using Container technology to host network functions can leverage faster Virtual Network Function (VNF) installation and optimize resource utilization than Virtual Machine (VM) based virtualization technology. When these network functions run inside a container, these software instances are often known as Cloud-Native Network Functions (CNF). Network providers use VNFs with different functionality in a chain to provide a service to the end user. A set of ordered VNFs is termed a Service Function Chain (SFC). The problem of placing and chaining VNFs of an SFC onto a network topology to minimize a cost function is known as SFC Placement and Chaining. This paper demonstrates how to solve the problem of SFC placement and chaining in a container-based environment. Multiple CNFs are used to create multiple service chains. These SFC have deployed on the National Scientific Foundation Network (NSFNET) topology. The SFC path is calculated using the Ant Colony Optimization algorithm. We have selected end-to-end delay and operational cost as the cost function that is minimized using the ACO algorithm. Performance metrics like end-to-end delay, operational cost, and throughput are recorded. We compare these results to the mathematical model to prove that the experimental and theoretical values are coherent with one another. These results benefit the network operators to do a cost-benefit analysis using the theoretical method, without wasting their time and resources on setting up a full-scale experimental setup.", "venue": "2023 2nd International Conference on Computer Technologies (ICCTech)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-23", "journal": {"name": "2023 2nd International Conference on Computer Technologies (ICCTech)", "pages": "74-79"}, "authors": [{"authorId": "1645077715", "name": "N. Ganesan"}, {"authorId": "2275153108", "name": "Hrithik Sharma"}, {"authorId": "2275415900", "name": "Sahaj Vaghasiya"}, {"authorId": "2275156846", "name": "Prajwal Agarwal"}, {"authorId": "2275530617", "name": "Dev Patel"}, {"authorId": "2264978474", "name": "B. Thangaraju"}], "citations": []}
