{"paperId": "2ccdfdbf3bb408a1c74dde2dbb2cf8492b3591db", "publicationVenue": {"id": "643b0c17-99ac-463b-81c4-df44ad66e34d", "name": "Annals of Internal Medicine", "type": "journal", "alternate_names": ["Ann Intern Med"], "issn": "0003-4819", "url": "http://www.acponline.org/journals/annals/annaltoc.htm", "alternate_urls": ["http://www.annals.org/"]}, "title": "Large language models in medicine: the potentials and pitfalls", "abstract": "Large language models (LLMs) are artificial intelligence models trained on vast text data to generate humanlike outputs. They have been applied to various tasks in health care, ranging from answering medical examination questions to generating clinical reports. With increasing institutional partnerships between companies producing LLMs and health systems, the real-world clinical application of these models is nearing realization. As these models gain traction, health care practitioners must understand what LLMs are, their development, their current and potential applications, and the associated pitfalls in a medical setting. This review, coupled with a tutorial, provides a comprehensive yet accessible overview of these areas with the aim of familiarizing health care professionals with the rapidly changing landscape of LLMs in medicine. Furthermore, the authors highlight active research areas in the field that promise to improve LLMs' usability in health care contexts.", "venue": "Annals of Internal Medicine", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Annals of internal medicine"}, "authors": [{"authorId": "151475294", "name": "J. Omiye"}, {"authorId": "2237426241", "name": "Haiwen Gui"}, {"authorId": "153607697", "name": "Shawheen J. Rezaei"}, {"authorId": "2237427402", "name": "James Zou"}, {"authorId": "2238197697", "name": "Roxana Daneshjou"}], "citations": [{"paperId": "430d93028beeffbd5f5f2588f320b447c75b4170", "title": "High Throughput Phenotyping of Physician Notes with Large Language and Hybrid NLP Models"}, {"paperId": "a1c04034df40cbe6f0d0004d456fdab807ae63ec", "title": "Generalist embedding models are better at short-context clinical semantic search than specialized embedding models"}, {"paperId": "d9403061e3a3392652d037138532fab111c845c1", "title": "Large language models in healthcare and medical domain: A review"}, {"paperId": "ea12b4bff088bb3829e7277e516842e552a63be4", "title": "The Philosopher's Stone: Trojaning Plugins of Large Language Models"}, {"paperId": "bca0bbd01ea917b7a9fe369288ea3ba03d3b1ff3", "title": "A Survey of Large Language Models in Medicine: Progress, Application, and Challenge"}, {"paperId": "8d2709ed1788a67e64425fb410bb49f3ee49e088", "title": "Large Language Models Illuminate a Progressive Pathway to Artificial Healthcare Assistant: A Review"}, {"paperId": "c7492913370b5726eaa6ced163a60de6c9d4bb7f", "title": "A Survey of Large Language Models for Healthcare: from Data, Technology, and Applications to Accountability and Ethics"}]}
