{"paperId": "2cd5581c6a1a781fdb5232a7b15fcb80c016b659", "publicationVenue": null, "title": "Determining the public transport demand by validation data of the electronic tickets", "abstract": "Currently, the definition of transport demand is relevant and not fully solved problem. Existing methods of transport demand calculating provide for on-site examination of passenger flows, which requires a lot of time and resources. Indirect methods of studying transport demand, based on the collection, integration and analysis of large and heterogeneous data generated by various sources in the spaces of human activity: mobile phones, vehicles, etc. (Urban computing [10], Big data [11, 12], internet of things, IoT) represent a special perspective. The article considers a method to determine the transport demand according to the results of the electronic tickets validation (electronic travel tickets): formulated the problem of determining the traffic demand according to system of accounting for electronic tickets and the system of satellite automobile transport monitoring (Global navigation Satellite System), the principle of its decision, the issues of obtained results adequacy.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2020-01-29", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "734"}, "authors": [{"authorId": "144019882", "name": "A. Fadeev"}, {"authorId": "121204107", "name": "S. Alhusseini"}], "citations": [{"paperId": "e9c82ab3fd0e91dc0ec06ea7668228c4c1d70b36", "title": "Transit ridership survey by analysis validation of electronic pass tickets"}, {"paperId": "cd5eb4b270a08c8ba93165743339a2a1c62ffdb6", "title": "Innovative NFC-validation system for accounting of income and expenses of public transport enterprises"}, {"paperId": "f65a50fded32ef1d0bcceecf201fa32a0846717a", "title": "State of the Art for the Creation of a Methodology for the Proper Location of Urban Truck Stops on Route 2A"}]}
