{"paperId": "2cd5e2ffa1cac185f870ddfa1963a8dd7bc970c4", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Explora: Interactive Querying of Multidimensional Data in the Context of Smart Cities", "abstract": "Citizen engagement is one of the key factors for smart city initiatives to remain sustainable over time. This in turn entails providing citizens and other relevant stakeholders with the latest data and tools that enable them to derive insights that add value to their day-to-day life. The massive volume of data being constantly produced in these smart city environments makes satisfying this requirement particularly challenging. This paper introduces Explora, a generic framework for serving interactive low-latency requests, typical of visual exploratory applications on spatiotemporal data, which leverages the stream processing for deriving—on ingestion time—synopsis data structures that concisely capture the spatial and temporal trends and dynamics of the sensed variables and serve as compacted data sets to provide fast (approximate) answers to visual queries on smart city data. The experimental evaluation conducted on proof-of-concept implementations of Explora, based on traditional database and distributed data processing setups, accounts for a decrease of up to 2 orders of magnitude in query latency compared to queries running on the base raw data at the expense of less than 10% query accuracy and 30% data footprint. The implementation of the framework on real smart city data along with the obtained experimental results prove the feasibility of the proposed approach.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1405534118", "name": "Leandro Ordoñez-Ante"}, {"authorId": "2720187", "name": "Gregory van Seghbroeck"}, {"authorId": "145115855", "name": "T. Wauters"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1715957", "name": "F. Turck"}], "citations": [{"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "5a7ed26e8b54b1e3492c17ecaa1d9451d02b05ae", "title": "Efficient Integration of Heterogeneous Mobility-Pollution Big Data for Joint Analytics at Scale with QoS Guarantees"}, {"paperId": "860a1408187d85181196113c107d4ca40c418a71", "title": "Analysis of multi-dimensional Industrial IoT (IIoT) data in Edge-Fog-Cloud based architectural frameworks : A survey on current state and research challenges"}, {"paperId": "3c45a4492e2f767611fd701f28045740afaa9afc", "title": "Geospatial complex event processing in smart city applications"}, {"paperId": "47de54d3c5c162483d7c701d5193eff7bbda75a2", "title": "Explora-VR: Content Prefetching for Tile-Based Immersive Video Streaming Applications"}, {"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams"}, {"paperId": "d00ec1e3de4b10b0814addcb14ce1527cc36b973", "title": "Smart Cities and Big Data Analytics: A Data-Driven Decision-Making Use Case"}]}
