{"paperId": "2cddcc1c8d884c6f7a16acdbd355c38476293cbc", "publicationVenue": {"id": "278131df-030d-4e6c-b083-d57f3b740dc4", "name": "JMIR Research Protocols", "type": "journal", "alternate_names": ["JMIR Res Protoc"], "issn": "1929-0748", "url": "https://www.researchprotocols.org/", "alternate_urls": ["http://www.researchprotocols.org/index"]}, "title": "Monitoring the Spatial Spread of COVID-19 and Effectiveness of Control Measures Through Human Movement Data: Proposal for a Predictive Model Using Big Data Analytics", "abstract": "Background Human movement is one of the forces that drive the spatial spread of infectious diseases. To date, reducing and tracking human movement during the COVID-19 pandemic has proven effective in limiting the spread of the virus. Existing methods for monitoring and modeling the spatial spread of infectious diseases rely on various data sources as proxies of human movement, such as airline travel data, mobile phone data, and banknote tracking. However, intrinsic limitations of these data sources prevent us from systematic monitoring and analyses of human movement on different spatial scales (from local to global). Objective Big data from social media such as geotagged tweets have been widely used in human mobility studies, yet more research is needed to validate the capabilities and limitations of using such data for studying human movement at different geographic scales (eg, from local to global) in the context of global infectious disease transmission. This study aims to develop a novel data-driven public health approach using big data from Twitter coupled with other human mobility data sources and artificial intelligence to monitor and analyze human movement at different spatial scales (from global to regional to local). Methods We will first develop a database with optimized spatiotemporal indexing to store and manage the multisource data sets collected in this project. This database will be connected to our in-house Hadoop computing cluster for efficient big data computing and analytics. We will then develop innovative data models, predictive models, and computing algorithms to effectively extract and analyze human movement patterns using geotagged big data from Twitter and other human mobility data sources, with the goal of enhancing situational awareness and risk prediction in public health emergency response and disease surveillance systems. Results This project was funded as of May 2020. We have started the data collection, processing, and analysis for the project. Conclusions Research findings can help government officials, public health managers, emergency responders, and researchers answer critical questions during the pandemic regarding the current and future infectious risk of a state, county, or community and the effectiveness of social/physical distancing practices in curtailing the spread of the virus. International Registered Report Identifier (IRRID) DERR1-10.2196/24432", "venue": "JMIR Research Protocols", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "JMIR Research Protocols", "volume": "9"}, "authors": [{"authorId": "48458661", "name": "Zhenlong Li"}, {"authorId": "2116431994", "name": "Xiaoming Li"}, {"authorId": "3752225", "name": "D. Porter"}, {"authorId": "49050626", "name": "Jiajia Zhang"}, {"authorId": "2008739232", "name": "Yuqin Jiang"}, {"authorId": "49376678", "name": "B. Olatosi"}, {"authorId": "37016689", "name": "S. Weissman"}], "citations": [{"paperId": "09b497a376842dae9158c1757c9b884f459961a8", "title": "Deep learning in public health: Comparative predictive models for COVID-19 case forecasting"}, {"paperId": "7a599837034083be2c12135bca1835d8921f8187", "title": "Understanding the bias of mobile location data across spatial scales and over time: A comprehensive analysis of SafeGraph data in the United States"}, {"paperId": "dbd28fed54971fe88848b5f85edf470af1fd6463", "title": "Research on demand forecasting and distribution of emergency medical supplies using an agent-based model"}, {"paperId": "651451621db5ccda1f625100bea3da56c7e861a4", "title": "Practices of Knowledge Exchange in the Context of the COVID-19 Pandemic"}, {"paperId": "6627f8a6be9891b6f0b0bdab08b2b160e56a9301", "title": "A data-driven framework to assess population dynamics during novel coronavirus outbreaks: A case study on Xiamen Island, China"}, {"paperId": "14d099e58c8785e23f3ce360f8f7e77bd444e445", "title": "The impact of COVID-19 pandemic on air passenger travel: a focus on empirical findings"}, {"paperId": "6405c922d0f5b48a1a716f9a39c5126920056697", "title": "The Impacts of HIV-Related Service Interruptions During the COVID-19 Pandemic: Protocol of a Mixed Methodology Longitudinal Study."}, {"paperId": "78432519b16edc729d5330d75e0a3ef3a1962c2d", "title": "Contribution of Social Media Analytics to Disaster Response Effectiveness: A Systematic Review of the Literature"}, {"paperId": "c51ccc4ebb9631248748a72939fee74aaf39c385", "title": "Twitter as a predictive system: A systematic literature review"}, {"paperId": "e6f756edcd471c019197ae0240baf7ef02a5c7ba", "title": "Research on emergency management of global public health emergencies driven by digital technology: A bibliometric analysis"}, {"paperId": "afbbaf5f97fa0729c6a259cc54c9719223bc75d4", "title": "A new method for spatio-temporal transmission prediction of COVID-19"}, {"paperId": "28250c01f292ea93e176ff4ecb2cca3b6c38fe13", "title": "Social big data applications and challenges"}, {"paperId": "9baca6173941d5c799820773453d93b88b4d98f2", "title": "Simulation and forecasting models of COVID-19 taking into account spatio-temporal dynamic characteristics: A review"}, {"paperId": "3869629f4e294dd87db422225c19e59a68ac9e2a", "title": "Using geographic information systems to link population estimates to wastewater surveillance data in New York State, USA"}, {"paperId": "00664bcb5ec4f20a5bd7cb00711d48d29531dfe0", "title": "Management of Smart and Sustainable Cities in the Post-COVID-19 Era: Lessons and Implications"}, {"paperId": "3255c88353443614f7fe011e31ae4dbdf1bbdf1b", "title": "Collecting, analyzing, and visualizing location-based social media data: review of methods in GIS-social media analysis"}, {"paperId": "bd9d736bed7d853db346a4eae333685d043818a0", "title": "A high-resolution temporal and geospatial content analysis of Twitter posts related to the COVID-19 pandemic"}, {"paperId": "bb05c669e63f932e03423c0349e20f3938a1bc2b", "title": "Spatiotemporal patterns of the COVID-19 control measures impact on industrial production in Wuhan using time-series earth observation data"}, {"paperId": "34029c60dbd8aa81969a06cf9455969af19e9e42", "title": "A review of GIS methodologies to analyze the dynamics of COVID‐19 in the second half of 2020"}, {"paperId": "655ed1579bce24d235eb19a4fbe9b4edb77cedcb", "title": "Identifying the Socioeconomic, Demographic, and Political Determinants of Social Mobility and Their Effects on COVID-19 Cases and Deaths: Evidence From US Counties"}, {"paperId": "517bc9939cd0125b8c165d737b09fd814d6d5c3a", "title": "Human mobility data in the COVID-19 pandemic: characteristics, applications, and challenges"}, {"paperId": "38989e8dc77bb5716cef6066ef4b14f7f8622240", "title": "Detection of Spatiotemporal Clusters of COVID-19–Associated Symptoms and Prevention Using a Participatory Surveillance App: Protocol for the @choum Study"}, {"paperId": "db0eaa57c11eed0a36ea7d8a784541554921e3c0", "title": "ODT FLOW: Extracting, analyzing, and sharing multi-source multi-scale human mobility"}, {"paperId": "446d067ca07e86751ba8f5463c8effb51d321b4d", "title": "Measuring global multi-scale place connectivity using geotagged social media data"}, {"paperId": "34b555993ee23d048661ba6f08f67c97bf75a528", "title": "Spatial-Temporal Relationship Between Population Mobility and COVID-19 Outbreaks in South Carolina: Time Series Forecasting Analysis"}, {"paperId": "0321f0b9a895bea3d655121d711f799b0be8fac6", "title": "Spatial-temporal relationship between population mobility and COVID-19 outbreaks in South Carolina: A time series forecasting analysis"}, {"paperId": "4c682b3cae2651f7fba1f89c04d94814c0f87673", "title": "Factors associated with self-reported HIV testing in the Dominican Republic"}, {"paperId": "d9cca8dda73a123b688040121936b5f533e171dc", "title": "Systematic Survey on Big Data Analytics and Artificial Intelligence for COVID-19 Containment"}, {"paperId": "c797d4266dbc09bd3348e3f2e52fb03f8196e564", "title": "Social Media and GIScience: collection, analysis, and visualization of user-generated spatial data"}]}
