{"paperId": "2ce31dc6b51c6540a283106ee7e1f780fdb07fa5", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Columnar Formats for Schemaless LSM-based Document Stores", "abstract": "In the last decade, document store database systems have gained more traction for storing and querying large volumes of semi-structured data. However, the flexibility of the document stores' data models has limited their ability to store data in a column-major layout --- making them less performant for analytical workloads than column store relational databases. In this paper, we propose several techniques based on piggy-backing on Log-Structured Merge (LSM) tree events and tailored to document stores to store data in a columnar layout. We first extend the Dremel format, a popular on-disk columnar format for semi-structured data, to comply with document stores' flexible data model. We then introduce a new columnar layout for organizing and storing data in LSM-based storage. We also highlight the potential of using query compilation techniques for document stores, where values' types are known only at runtime. We have implemented and evaluated our techniques to measure their impact on storage, data ingestion, and query performance in Apache AsterixDB. Our experiments show significant performance gains, improving the query execution time by orders of magnitude while minimally impacting ingestion performance.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-22", "journal": {"name": "Proc. VLDB Endow.", "pages": "2085-2097", "volume": "15"}, "authors": [{"authorId": "2555857", "name": "Wail Y. Alkowaileet"}, {"authorId": "1703347", "name": "M. Carey"}], "citations": [{"paperId": "acb9cb50436c71180ca4d9857300f1f505438a63", "title": "QUEST: An Efficient Query Evaluation Scheme Towards Scan-Intensive Cross-Model Analysis"}, {"paperId": "29b7849eca377f115e67b80e8fa2840f26e0e842", "title": "An Empirical Evaluation of Columnar Storage Formats"}]}
