{"paperId": "2ce4b53c519c989dfc16109fd0b947b67cb02c05", "publicationVenue": {"id": "cce4d150-8211-4378-a9ef-a234ec19414c", "name": "ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing", "type": "conference", "alternate_names": ["PODC", "Princ Distrib Comput", "Principles of Distributed Computing", "ACM SIGACT-SIGOPS Symp Princ Distrib Comput"], "url": "http://www.podc.org/"}, "title": "Massively Parallel Computation in a Heterogeneous Regime", "abstract": "Massively-parallel graph algorithms have received extensive attention over the past decade, with research focusing on three memory regimes: the superlinear regime, the near-linear regime, and the sublinear regime. The sublinear regime is the most desirable in practice, but conditional hardness results point towards its limitations. In this work we study a heterogeneous model, where the memory of the machines varies in size. We focus mostly on the heterogeneous setting created by adding a single near-linear machine to the sublinear MPC regime, and show that even a single large machine suffices to circumvent most of the conditional hardness results for the sublinear regime: for graphs with n vertices and m edges, we give (a) an MST algorithm that runs in O(łogłog(m/n)) rounds; (b) an algorithm that constructs an O(k)-spanner of size O(n^1+1/k ) in O(1) rounds; and (c) a maximal-matching algorithm that runs in O(√łog(m/n) łogłog(m/n)) rounds. We also observe that the best known near-linear MPC algorithms for several other graph problems which are conjectured to be hard in the sublinear regime (minimum cut, maximal independent set, and vertex coloring) can easily be transformed to work in the heterogeneous MPC model with a single near-linear machine, while retaining their original round complexity in the near-linear regime. If the large machine is allowed to have superlinear memory, all of the problems above can be solved in O(1) rounds.", "venue": "ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-07-20", "journal": {"name": "Proceedings of the 2022 ACM Symposium on Principles of Distributed Computing"}, "authors": [{"authorId": "40640498", "name": "O. Fischer"}, {"authorId": "2178368375", "name": "A. Horowitz"}, {"authorId": "1757695", "name": "R. Oshman"}], "citations": []}
