{"paperId": "2cfd71eac5967a4e8a948b19bc8c3473f144e160", "publicationVenue": {"id": "9a7667e4-db6f-494f-b99f-70339b6a1876", "name": "Redox Report", "type": "journal", "alternate_names": ["Redox Rep"], "issn": "1351-0002", "url": "https://www.tandfonline.com/toc/yrer20/current", "alternate_urls": ["http://www.tandfonline.com/YRER"]}, "title": "Reduction of butyric acid-producing bacteria in the ileal mucosa-associated microbiota is associated with the history of abdominal surgery in patients with Crohn’s disease", "abstract": "ABSTRACT Fecal microbiota is a significant factor determining the cause, course, and prognosis of Crohn’s disease (CD). However, the factors affecting mucosa-associated microbiota (MAM) remain unclear. This retrospective study examined the differences in ileal MAM between CD patients and healthy controls and investigated the factors affecting MAM in CD patients to clarify potential therapeutic targets. Ileal MAM was obtained using brush forceps during endoscopic examination from 23 healthy controls and 32 CD patients (most were in remission). The samples’ microbiota was profiled using the Illumina MiSeq platform. Compared to controls, CD patients had significantly reduced α-diversity in the ileum and a difference in β-diversity. The abundance of butyric acid-producing bacteria in the ileal MAM was significantly lower in CD patients with a history of abdominal surgery than in those without. Because butyric acid is a major energy source in the intestinal epithelium, its metabolism via β-oxidation increases oxygen consumption in epithelial cells, reducing oxygen concentration in the intestinal lumen and increasing the abundance of obligate anaerobic bacteria. The suppression of obligate anaerobes in CD patients caused an overgrowth of facultative anaerobes. Summarily, reducing the abundance of butyric acid-producing bacteria in the ileal MAM may play an important role in CD pathophysiology.", "venue": "Redox Report", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-02", "journal": {"name": "Redox Report : Communications in Free Radical Research", "volume": "28"}, "authors": [{"authorId": "2150853921", "name": "O. Handa"}, {"authorId": "2046881898", "name": "H. Miura"}, {"authorId": "2226418210", "name": "Tingting Gu"}, {"authorId": "4893273", "name": "M. Osawa"}, {"authorId": "46373959", "name": "H. Matsumoto"}, {"authorId": "5427787", "name": "E. Umegaki"}, {"authorId": "143860033", "name": "R. Inoue"}, {"authorId": "144829218", "name": "Y. Naito"}, {"authorId": "4690653", "name": "A. Shiotani"}], "citations": [{"paperId": "bb1953b06d680849f1741495234d258b46b62068", "title": "Fatty acids and lipid mediators in inflammatory bowel disease: from mechanism to treatment"}]}
