{"paperId": "2cff6d884cbb51ddb80d4a05469ae2eea0e85bac", "publicationVenue": null, "title": "Confidential Computing-Induced Privacy Benefits for the Bootstrapping of New Business Relationships", "abstract": "In addition to quality improvements and cost reductions, dynamic and flexible business relationships are expected to become more important in the future to account for specific customer change requests or small-batch production. Today, despite reservation, sensitive information must be shared upfront between buyers and sellers. However, without a trust relation, this situation is precarious for the involved companies as they fear for their competitiveness following information leaks or breaches of their privacy. To address this issue, the concepts of confidential computing and cloud computing come to mind as they promise to offer scalable approaches that preserve the privacy of participating companies. In particular, designs building on confidential computing can help to technically enforce privacy. Moreover, cloud computing constitutes an elegant design choice to scale these novel protocols to industry needs while limiting the setup and management overhead for practitioners. Thus, novel approaches in this area can advance the status quo of boot-strapping new relationships as they provide privacy-preserving alternatives that are suitable for immediate deployment.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "150100573", "name": "Frederik Fuhrmann"}, {"authorId": "1382610408", "name": "Markus Dahlmanns"}, {"authorId": "2104135108", "name": "T. Heutmann"}, {"authorId": "2139256448", "name": "Alexander Kreppein"}, {"authorId": "3425121", "name": "D. Grunert"}, {"authorId": "2146856680", "name": "Christoph Lange"}, {"authorId": "46253301", "name": "R. Schmitt"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "5827e749b4125b3fc944c5fba56c9378fbd7ff28", "title": "An Interdisciplinary Survey on Information Flows in Supply Chains"}, {"paperId": "411524c102627901740770ba601908fa7984a21d", "title": "Offering Two-way Privacy for Evolved Purchase Inquiries"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}]}
