{"paperId": "2d042709427fb05299fbb0faa62756e1fa92282a", "publicationVenue": {"id": "ab066af1-bfee-42da-84bb-42f7e199d0d0", "name": "IEEE Conference on Decision and Control", "type": "conference", "alternate_names": ["Conference on Decision and Control", "IEEE Conf Decis Control", "Conf Decis Control", "CDC"], "url": "http://www.wikicfp.com/cfp/program?id=403"}, "title": "Consensus-Based Data Statistics in Distributed Network Systems", "abstract": "Data has become increasingly important in network systems because a lot of data is needed in new technologies such as machine learning. To obtain statistics (e.g. maximum, average, and distribution) in a fully distributed way with low complexity is challenging. Existing research on consensus algorithms can successfully obtain the max/min, average and median in a distributed network, but little work has been done on how to compute other statistics, especially probability density function (PDF). In this paper, consensus-based algorithms are proposed to obtain PDF in a fully distributed way with low complexity. The key idea of our algorithms is to divide the range of nodes' values into several sections and calculate the proportions of values in each section in a fully distributed way. If nodes have their unique identifications (IDs), repeatedly run max/min consensus algorithm in the network to reach the partially max/min values and then erase them in order to reach all values exactly once. We prove that the algorithm converges in finite time. When nodes' IDs are not available, the main challenge is to solve the conflicts when two or more nodes have the same value. We propose an asymptotically converged algorithm to solve the problem in this scenario.", "venue": "IEEE Conference on Decision and Control", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE Conference on Decision and Control (CDC)", "pages": "4206-4211"}, "authors": [{"authorId": "2111027355", "name": "Yifan Cai"}, {"authorId": "2800016", "name": "Jianping He"}, {"authorId": "144039882", "name": "Wenbin Yu"}, {"authorId": "152936756", "name": "X. Guan"}], "citations": [{"paperId": "f2b13cedd1ba165c6736625cfdc5a6b4b8590f10", "title": "Consensus and Approximation-based Distribution Statistics in Network Systems"}, {"paperId": "1bc10e17820c18a285d54ed407fcbb4a619e0f29", "title": "Distributed Nonconvex Optimization: Oracle-free Iterations and Globally Optimal Solution"}, {"paperId": "539cc9bbc60af7b7ad5275265ea8ee87ade527c2", "title": "Moving Obstacle Avoidance and Topology Recovery for Multi-agent Systems"}, {"paperId": "6c9c3a897dded936bf6d557e89492a785542c4ec", "title": "Distributed Dynamic Quantile Solver with Plug-and-Play Operation"}]}
