{"paperId": "2d1018d09152cb23c4e9917218ef7b05997fed8d", "publicationVenue": null, "title": "Fine-grained dynamic load balancing in spatial join by work stealing on distributed memory", "abstract": "Spatial join is an important operation for combining spatial data. Parallelization is essential for improving spatial join performance. However, load imbalance due to data skew limits the scalability of parallel spatial join. There are many work sharing techniques to address this problem in a parallel environment. One of the techniques is to use data and space partitioning and then scheduling the partitions among threads/processes with the goal of minimizing workload differences across threads/processes. However, load imbalance still exists due to differences in join costs of different pairs of input geometries in the partitions. For the load imbalance problem, we have designed a work stealing spatial join system (WSSJ-DM) on a distributed memory environment. Work stealing is an approach for dynamic load balancing in which an idle processor steals computational tasks from other processors [5]. This is the first work that uses work stealing concept (instead of work sharing) to parallelize spatial join computation on a large compute cluster. We have evaluated the scalability of the system on shared and distributed memory. Our experimental evaluation shows that work stealing is an effective strategy. We compared WSSJ-DM with work sharing implementations of spatial join on a high performance computing environment using partitioned and un-partitioned datasets. Static and dynamic load balancing approaches were used for comparison. We study the effect of memory affinity in work stealing operations involved in spatial join on a multi-core processor. WSSJ-DM performed spatial join using ST_Intersection on Lakes (8.4M polygons) and Parks (10M polygons) in 30 seconds using 35 compute nodes on a cluster (1260 CPU cores). A work sharing Master-Worker implementation took 160 seconds in contrast.", "venue": "SIGSPATIAL/GIS", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Proceedings of the 30th International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "2118579557", "name": "Jie Yang"}, {"authorId": "2871863", "name": "S. Puri"}, {"authorId": "2146384010", "name": "Hui Zhou"}], "citations": [{"paperId": "1f4d5e010ec1a333a24a38b5cf25cd2ddd626b76", "title": "Adaptive Asynchronous Work-Stealing for distributed load-balancing in heterogeneous systems"}]}
