{"paperId": "2d15a5b78feea72032bbb5a37afe2868a5713a14", "publicationVenue": {"id": "d8ec66ab-0083-4a4d-bf44-ce85d2daad69", "name": "Hawaii International Conference on System Sciences", "type": "conference", "alternate_names": ["HICSS", "Hawaii Int Conf Syst Sci"], "url": "http://www.hicss.hawaii.edu/"}, "title": "Drivers and Inhibitors for Organizations' Intention to Adopt Artificial Intelligence as a Service", "abstract": "The adoption of artificial intelligence promises tremendous economic benefits for organizations. Yet, many organizations struggle to unlock the full potential of this technology. To ease the adoption of artificial intelligence for organizations, several cloud providers have begun offering artificial intelligence as a service (AIaaS). Extant research on AIaaS exhibits a strong focus on technical aspects and has opposing views on what drives or inhibits the adoption of AIaaS within organizations. In this research, we synthesize extant research on AIaaS adoption factors and conduct semi-structured interviews with practitioners. Our research yields 12 factors that drive and 13 factors that inhibit the adoption of AIaaS in practice. We thereby close a gap in scholarly knowledge on the adoption of this emerging service technology, especially on inhibiting factors, and help to guide future research on related behavioral and technical aspects.", "venue": "Hawaii International Conference on System Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "1-10"}, "authors": [{"authorId": "7259180", "name": "Konstantin D. Pandl"}, {"authorId": "8032854", "name": "Heiner Teigeler"}, {"authorId": "1831278", "name": "S. Lins"}, {"authorId": "2244544", "name": "Scott Thiebes"}, {"authorId": "1697247", "name": "A. Sunyaev"}], "citations": [{"paperId": "70ba91232d4f1fa2098fc5c73028fa1cb00eaf09", "title": "Factors that Influence AI Investment Decisions in Oman's Hydrocarbons Industry: A Review of the Theoretical Literature and Proposed Theoretical Mode"}, {"paperId": "b65211c79b8f2eebf9b79006dfa0377216fc5125", "title": "The AI Tech-Stack Model"}, {"paperId": "645b9cdab569c61cbfe2e6fe867cd76c5e5067d8", "title": "Drivers and Inhibitors of Low Code Development Platform Adoption"}, {"paperId": "280640010a579c337e41e57ea572047bf3217b9a", "title": "Trialability and Purposefulness: Their Role Towards Google Classroom Acceptance Following Educational Policy"}, {"paperId": "5b68a02e18415725bc329ff850a9fd15b864f54a", "title": "Artificial Intelligence as a Service"}, {"paperId": "1f87665a3874f307ea07e6f911b7eabed58e86e0", "title": "aiSTROM–A Roadmap for Developing a Successful AI Strategy"}, {"paperId": "82cb10b06a3fa4cdfc99d09851bc5121a70a344b", "title": "What Your Radiologist Might be Missing: Using Machine Learning to Identify Mislabeled Instances of X-ray Images"}]}
