{"paperId": "2d3475fb335ce4659f4730db8ab6db4a37f4aea0", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "Arrow: Low-Level Augmented Bayesian Optimization for Finding the Best Cloud VM", "abstract": "With the advent of big data applications, which tend to have longer execution time, choosing the right cloud VM has significant performance and economic implications. For example, in our large-scale empirical study of 107 different workloads on three popular big data systems, we found that a wrong choice can lead to a 20 times slowdown or an increase in cost by 10 times. Bayesian optimization is a technique for optimizing expensive (black-box) functions. Previous work has only used instance-level information (such as core counts and memory size) which is not sufficient to represent the search space. In this work, we discover that this may lead to the fragility problem–either incurs high search cost or finds only the sub-optimal solution. The central insight of this paper is to use low-level performance information to augment the process of Bayesian Optimization. Our novel low-level augmented Bayesian Optimization is rarely worse than current practices and often performs much better (in 46 of 107 cases). Further, it significantly reduces the search cost in nearly half of our case studies. Based on this work, we conclude that it is often insufficient to use general-purpose off-the-shelf methods for configuring cloud instances without augmenting those methods with essential systems knowledge such as CPU utilization, working memory size and I/O wait time.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-28", "journal": {"name": "2018 IEEE 38th International Conference on Distributed Computing Systems (ICDCS)", "pages": "660-670"}, "authors": [{"authorId": "2110552464", "name": "Chin-Jung Hsu"}, {"authorId": "143934608", "name": "V. Nair"}, {"authorId": "1752331", "name": "Vincent W. Freeh"}, {"authorId": "1703872", "name": "T. Menzies"}], "citations": [{"paperId": "3e3b1a8dbe13fbb1436a1a120611b61bb5e7e9d5", "title": "Proactive Auto-Scaling for Delay-Sensitive IoT Applications Over Edge Clouds"}, {"paperId": "35eec46b3e98391d64b75a510d69d5bb302202a9", "title": "Privacy-Preserving Sharing of Data Analytics Runtime Metrics for Performance Modeling"}, {"paperId": "a21359673263d1de11f593fe396651554433c030", "title": "Deep Configuration Performance Learning: A Systematic Survey and Taxonomy"}, {"paperId": "fcab3fe1adc7bb67eb080956e7c92cad421aa3b0", "title": "Integrating Bayesian Optimization and Machine Learning for the Optimal Configuration of Cloud Systems"}, {"paperId": "d53816e4a13f7ec3d04d5a4c229d217d95266a40", "title": "Oikonomos-II: A Reinforcement-Learning, Resource-Recommendation System for Cloud HPC"}, {"paperId": "707d67b3d1045488d775ab61d55de38c1f3ad876", "title": "ETune: Efficient configuration tuning for big-data software systems via configuration space reduction"}, {"paperId": "46f9827e81e0d46d68f4a7d16cc62091ed1b2406", "title": "Lifting the Fog of Uncertainties: Dynamic Resource Orchestration for the Containerized Cloud"}, {"paperId": "8603b743bb101a987421854b78bf2047785ba7d1", "title": "Dynamic Optimization of Provider-Based Scheduling for HPC Workloads"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "a023de0ae831e7b8bad5c60f8332c7bb35d39795", "title": "xCloudServing: Automated ML Serving Across Clouds"}, {"paperId": "9aac24a9a683a91a1155a96ef6b512071b665587", "title": "Oikonomos: An Opportunistic, Deep-Learning, Resource-Recommendation System for Cloud HPC"}, {"paperId": "c15a24af47a143874250e02c75d366ff20ca5be2", "title": "Proactive Auto-scaling For Delay-sensitive Service Providers Over Public Clouds"}, {"paperId": "6aaf40e9b7421606a7e3f9800cdd65d765b3cf90", "title": "Predicting Software Performance with Divide-and-Learn"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "8810733c7302be5b21db947d37a21e1a63dbdd9e", "title": "Cloud Configuration Optimization for Recurring Batch-Processing Applications"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "e2db3df1716ef26b58cd1f8d9e803045c6b8eef8", "title": "Cougar: A General Framework for Jobs Optimization In Cloud"}, {"paperId": "7350aafd8ca50aebf47b7aeac878ac9456edf77f", "title": "PB3Opt: Profile‐based biased Bayesian optimization to select computing clusters on the cloud"}, {"paperId": "9aefa6858ccf6874ef9e05c39dc477a956504bd1", "title": "A PSO-based Resource Allocation and Task Assignment Approach for Real-Time Cloud Computing-based Robotic Systems"}, {"paperId": "3dd4b8fdbcb3ec776eddfc1e3db2dbdbfe400f3a", "title": "DPM-NFV: Dynamic Power Management Framework for 5G User Plane Function using Bayesian Optimization"}, {"paperId": "4727ccb91512a7181594c6f41b267bb88414d0b2", "title": "CharmSeeker: Automated Pipeline Configuration for Serverless Video Processing"}, {"paperId": "f6371e8d05f7f13910ac0d631e1c9c1492e4d4f6", "title": "Predicting Cloud Performance Using Real-time VM-level Metrics"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "cf0b2d419cfec5c2b74812419cd4e90e200a89e5", "title": "Design Space Exploration of Heterogeneous Systems Applied to the Cloud Resource Allocation Problem"}, {"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases"}, {"paperId": "d456a30f9d2f01d31cf81e41a1df56b9af4e35dc", "title": "Phronesis: Efficient Performance Modeling for High-dimensional Configuration Tuning"}, {"paperId": "0e28b14f57d90fd320909bb3add1ad05cd57d745", "title": "A Resource Recommendation Model for Heterogeneous Workloads in Fog-Based Smart Factory Environment"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "ddf8a6fc4874f1da2177ae86c8ff1c37a2ffb831", "title": "Search-based Methods for Multi-Cloud Configuration"}, {"paperId": "41eafea6256ab2af225617006eac763b2a420ccd", "title": "LOCAT: Low-Overhead Online Configuration Auto-Tuning of Spark SQL Applications"}, {"paperId": "2f268203e9ec98efbfe773d41d3f07d28653f6f3", "title": "Kuber: Cost-Efficient Microservice Deployment Planner"}, {"paperId": "4a2432210231c8282e1cea084a3cc37bcd14500d", "title": "Leveraging vCPU-utilization rates to select cost-efficient VMs for parallel workloads"}, {"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud"}, {"paperId": "7fde8fdbf666fb2a42a9ce4c579dd4cd1236e183", "title": "RIBBON: Cost-Effective and QoS-Aware Deep Learning Model Inference using a Diverse Pool of Cloud Computing Instances"}, {"paperId": "b7215b2fd8a07acf5936379e0067b64502baa3b5", "title": "Tarema: Adaptive Resource Allocation for Scalable Scientific Workflows in Heterogeneous Clusters"}, {"paperId": "5b8f5a218ceecf164886135741a7416553dce7e2", "title": "Morphling: Fast, Near-Optimal Auto-Configuration for Cloud-Native Model Serving"}, {"paperId": "2f65e60dfd8a05f6dfeec8a237507b029386b1eb", "title": "Performance Testing for Cloud Computing with Dependent Data Bootstrapping"}, {"paperId": "f4e6008daf8d5be3651d8d10825e9ce672da04b3", "title": "Apollo: Rapidly Picking the Optimal Cloud Configurations for Big Data Analytics Using a Data-Driven Approach"}, {"paperId": "37d3f45409ec7740a182dea98197a2846443a0b8", "title": "Analysis of Cloud Resource Optimal Allocation Strategy Based on Bayesian Algorithm"}, {"paperId": "e7dcce50d328f13cbcb51ae7de3fe2f1b06e1eab", "title": "Fast and Efficient Performance Tuning of Microservices"}, {"paperId": "291d89ab3cbd3022c7d701f3087b298bd5eebe8a", "title": "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation"}, {"paperId": "f6362b6f5ffbb90ddc6daf5bfea28badd61c34f8", "title": "Best VM Selection for Big Data Applications across Multiple Frameworks by Transfer Learning"}, {"paperId": "052fbae566b46bdb095d78aafa6b590489289ddc", "title": "ROBOTune: High-Dimensional Configuration Tuning for Cluster-Based Data Analytics"}, {"paperId": "a30259926120393ee08378ab58ab1bc2f562b6fb", "title": "Silhouette: Efficient Cloud Configuration Exploration for Large-Scale Analytics"}, {"paperId": "3b9b92f142c09976e1f9e682ebe4b8243dc48a35", "title": "Bellamy: Reusing Performance Models for Distributed Dataflow Jobs Across Contexts"}, {"paperId": "c8a02b5663fda6d3267f9f177b855b58473494fd", "title": "C3O: Collaborative Cluster Configuration Optimization for Distributed Data Processing in Public Clouds"}, {"paperId": "1f46d0757000f48be238c234e6c5820292c08ac5", "title": "SmartTuning: Selecting Hyper-Parameters of a ConvNet System for Fast Training and Small Working Memory"}, {"paperId": "f687d64bc0289fbf8c6ba7106b86904c7af9b521", "title": "With Great Freedom Comes Great Opportunity: Rethinking Resource Allocation for Serverless Functions"}, {"paperId": "95bcf6816c6311e0dfe1a7f7505adbde4ad13c3f", "title": "MOBO-NFV: Automated Tuning of a Network Function Virtualization System using Multi-Objective Bayesian Optimization"}, {"paperId": "f90463dfa118a7e60059c8c3b523568e7df39b0d", "title": "CGPTuner: a Contextual Gaussian Process Bandit Approach for the Automatic Tuning of IT Configurations Under Varying Workload Conditions"}, {"paperId": "91467fee6964d59cf9b5a7f133048eb139f67dcf", "title": "Hummingbird: efficient performance prediction for executing genomic applications in the cloud"}, {"paperId": "b671dab1490a561d8b87b4fc003982d7c76fdb45", "title": "Towards Collaborative Optimization of Cluster Configurations for Distributed Dataflow Jobs"}, {"paperId": "a278412a5c1a97f0e94631841a09cdc467493cae", "title": "TrimTuner: Efficient Optimization of Machine Learning Jobs in the Cloud via Sub-Sampling"}, {"paperId": "5b635e1fb8752ce90cc795da4759d4233f18bf61", "title": "Diminishing Returns and Deep Learning for Adaptive CPU Resource Allocation of Containers"}, {"paperId": "1ca4adaaf91488fec0488827db0929e1c5441204", "title": "Finding the right cloud configuration for analytics clusters"}, {"paperId": "d5b3f8dbef61ead7d86a89e5b0d638e34c33d509", "title": "CADET: A Systematic Method For Debugging Misconfigurations using Counterfactual Reasoning"}, {"paperId": "f5db7a7013133452cd911e7ba09da3e7da78b0e3", "title": "ORHRC: Optimized Recommendations of Heterogeneous Resource Configurations in Cloud-Fog Orchestrated Computing Environments"}, {"paperId": "1bcf5d85aa2d11f2f844feb9cda6c100c92dac30", "title": "Cross-Domain Workloads Performance Prediction via Runtime Metrics Transferring"}, {"paperId": "31f8c61248d6994c6f53942436756356cbefc332", "title": "Automating Cloud Deployment for Deep Learning Inference of Real-time Online Services"}, {"paperId": "040dd5cc325ff9ab696fdf9430114f81d3dfc295", "title": "Do the best cloud configurations grow on trees?"}, {"paperId": "7b01a6e9af93544be4db8f0e4104c9afe4f49279", "title": "A Dynamic Resource Allocation Framework for Apache Spark Applications"}, {"paperId": "e5fc1799abebfada707abd491b4663973e132e8e", "title": "Fast and Low-cost Search for Efficient Cloud Configurations for HPC Workloads"}, {"paperId": "3473d81d07b7301adcf75272d780746a70698716", "title": "End-to-end deep reinforcement learning in computer systems"}, {"paperId": "94b26baa5748aa3a707b8c90a020db41bfbc2ab5", "title": "Not All Explorations Are Equal: Harnessing Heterogeneous Profiling Cost for Efficient MLaaS Training"}, {"paperId": "cc36e3dee92ad2c59f07e325d99fa9158e2edf3b", "title": "Hedge Your Bets: Optimizing Long-term Cloud Costs by Mixing VM Purchasing Options"}, {"paperId": "9f3703253051a95263bc2a882afe4e61b66fc9f9", "title": "Black or White? How to Develop an AutoTuner for Memory-based Analytics"}, {"paperId": "775c8b9885f47f2904c017fba819bdbce6e60361", "title": "Speeding up AutoTuning of the Memory Management Options in Data Analytics"}, {"paperId": "083ee590bddca284cf1adc145cd946cd650c9f30", "title": "A framework for black-box SLO tuning of multi-tenant applications in Kubernetes"}, {"paperId": "e11655d42da13d82d4afd644440ecf557e53bd7a", "title": "Adaptive Cloud Application Tuning with Enhanced Structural Bayesian Optimization"}, {"paperId": "c2d52a8f53d5d7b2b9bde387ba36ccf9b6b671fa", "title": "ParaOpt: Automated Application Parameterization and Optimization for the Cloud"}, {"paperId": "64f37dfe16232b3b730c4663e777dd6a249a2a6e", "title": "SARA: Stably and quickly find optimal cloud configurations for heterogeneous big data workloads"}, {"paperId": "65ce077cfb89b6d589c2f2909fbb6e45f611475e", "title": "Accordia: Adaptive Cloud Configuration Optimization for Recurring Data-Intensive Applications"}, {"paperId": "11acd89b85610c6d5f86d00f235fbdc9c95fe2ac", "title": "Whence to Learn? Transferring Knowledge in Configurable Systems Using BEETLE"}, {"paperId": "9665b717f28bdb23ede44c21e5971e8589e1d686", "title": "A statistics-based performance testing methodology for cloud applications"}, {"paperId": "e963fbb05d1cc320be16ca3f03e244ea2d0d8931", "title": "Lynceus: Cost-efficient Tuning and Provisioning of Data Analytic Jobs"}, {"paperId": "55ce8a41399268d28b2532337d17e054cdd34ce8", "title": "Lynceus: Tuning and Provisioning Data Analytic Jobs on a Budget"}, {"paperId": "fc708f685cc0c94504261eff90c013d269c003e1", "title": "Guided Bayesian Optimization to AutoTune Memory-Based Analytics"}, {"paperId": "d265dbba1c3facc719018bfce276101e9e01c1b3", "title": "Micky: A Cheaper Alternative for Selecting Cloud Instances"}, {"paperId": "3da9197dafab599f3b01c80cb452a8ad30716efe", "title": "Transfer Learning with Bellwethers to find Good Configurations"}, {"paperId": "5655f16d3c46537f951b5686c905f15c2f35991c", "title": "Scout: An Experienced Guide to Find the Best Cloud Configuration"}, {"paperId": "6f16bc772c8b298ee1d0f3efe6ccec571d3b6c30", "title": "The Methods of Cloud Computing"}, {"paperId": "3eaf02337da6a4d0c0d9c9a4ea82294cb7e5cc7b", "title": "CADET: Debugging and Fixing Misconfigurations using Counterfactual Reasoning"}, {"paperId": "3d5159c644841b0a0a9c726814b94d6004840726", "title": "Auto-tuning Spark with Bayesian optimisation"}, {"paperId": "47ba5be1c1f746ba8afa05577fd457b1476cf4b0", "title": "Hdconfigor: Automatically Tuning High Dimensional Configuration Parameters for Log Search Engines"}, {"paperId": "144f94da5ae9bf40f56acdf9cff370845d63c81d", "title": "Repository ISTITUZIONALE"}]}
