{"paperId": "2d36dba4761044fa72ef91cae4d2cc084044e79c", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "When Database Meets New Storage Devices: Understanding and Exposing Performance Mismatches via Configurations", "abstract": "NVMe SSD hugely boosts the I/O speed, with up to GB/s throughput and microsecond-level latency. Unfortunately, DBMS users can often find their high-performanced storage devices tend to deliver less-than-expected or even worse performance when compared to their traditional peers. While many works focus on proposing new DBMS designs to fully exploit NVMe SSDs, few systematically study the symptoms, root causes and possible detection methods of such performance mismatches on existing databases.\n In this paper, we start with an empirical study where we systematically expose and analyze the performance mismatches on six popular databases via controlled configuration tuning. From the study, we find that all six databases can suffer from performance mismatches. Moreover, we conclude that the root causes can be categorized as databases' unawareness of new storage devices characteristics in I/O size, I/O parallelism and I/O sequentiality. We report 17 mismatches to developers and 15 are confirmed.\n Additionally, we realize testing all configuration knobs yields low efficiency. Therefore, we propose a fast performance mismatch detection framework and evaluation shows that our framework brings two orders of magnitude speedup than baseline without sacrificing effectiveness.", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1712-1725", "volume": "16"}, "authors": [{"authorId": "2666215", "name": "Haochen He"}, {"authorId": "2575699", "name": "Erci Xu"}, {"authorId": "50342128", "name": "Shanshan Li"}, {"authorId": "10414205", "name": "Zhouyang Jia"}, {"authorId": "48143137", "name": "Si Zheng"}, {"authorId": "2213157614", "name": "Yue Yu"}, {"authorId": "46282703", "name": "Jun Ma"}, {"authorId": "144078016", "name": "Xiangke Liao"}], "citations": [{"paperId": "4fc3d49c6f626035d9dad35e807d77bd54609510", "title": "Performance Analysis of Distributed Database Management System for IoT in the Context of Smart Agriculture in Indonesia"}]}
