{"paperId": "2d410dc42a4eff7961a54b2383d5a51d568aaa16", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "A Dynamic Multi–Objective Approach for Dynamic Load Balancing in Heterogeneous Systems", "abstract": "Modern standards in High Performance Computing (HPC) have started to consider energy consumption and power draw as a limiting factor. New and more complex architectures have been introduced in HPC systems to afford these new restrictions, and include coprocessors such as GPGPUs for intensive computational tasks. As systems increase in heterogeneity, workload distribution becomes a more core problem to achieve the maximum efficiency in every computational component. We present a Multi-Objective Dynamic Load Balancing (DLB) approach where several objectives can be applied to tune an application. These objectives can be dynamically exchanged during the execution of an algorithm to better adapt to the resources available in a system. We have implemented the Multi–Objective DLB together with a generic heuristic engine, designed to perform multiple strategies for DLB in iterative problems. We also present Ull Multiobjective Framework (UllMF), an open–source tool that implements the Multi-Objective generic approach. UllMF separates metric gathering, objective functions to be optimized and load balancing algorithms, and improves code portability using a simple interface to reduce the costs of new implementations. We illustrate how performance and energy consumption are improved for the implemented techniques, and analyze their quality using different DLB techniques from the literature.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2421-2434", "volume": "31"}, "authors": [{"authorId": "2064409581", "name": "A. Cabrera"}, {"authorId": "1387988305", "name": "Alejandro Acosta"}, {"authorId": "145438237", "name": "F. Almeida"}, {"authorId": "143601416", "name": "V. Blanco"}], "citations": [{"paperId": "095a913152541d7f9716d0f525207ad6fd867061", "title": "Learning to Guide Particle Search for Dynamic Multiobjective Optimization."}, {"paperId": "9b0970a4b1893edbba2118ed0ad8b47f41248e95", "title": "Load Balancing for Multiedge Collaboration in Wireless Metropolitan Area Networks: A Two-Stage Decision-Making Approach"}, {"paperId": "b94785fc7c785174e2eb6006063a8d5d8044de6a", "title": "A Discrete Particle Swarm Optimization Algorithm for Dynamic Scheduling of Transmission Tasks"}, {"paperId": "a0e486ef5f025e3a92141509542cb5d653a4df8e", "title": "Runtime and energy constrained work scheduling for heterogeneous systems"}, {"paperId": "b49acf0fd6b1d4b74f2be35b7802fa2fd5c626f2", "title": "Improved NSGA-III with Second-Order Difference Random Strategy for Dynamic Multi-Objective Optimization"}, {"paperId": "e17a11bf5019a24c99539d0de0323dd1507e4975", "title": "PackStealLB: A scalable distributed load balancer based on work stealing and workload discretization"}, {"paperId": "ae7abc68ef7abf768b2c4336d85e0cfe5abc3dee", "title": "Performance and energy task migration model for heterogeneous clusters"}, {"paperId": "498f9691fbe2e0cf0acdbe82290cb220b449e3d6", "title": "Dynamic Load Balancing Algorithm Based on Optimal Matching of Weighted Bipartite Graph"}]}
