{"paperId": "2d4177248b4f488c8a9198a8242f12022fd53ccd", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Feature Recognition and Style Transfer of Painting Image Using Lightweight Deep Learning", "abstract": "This work aims to improve the feature recognition efficiency of painting images, optimize the style transfer effect of painting images, and save the cost of computer work. First, the theoretical knowledge of painting image recognition and painting style transfer is discussed. Then, lightweight deep learning techniques and their application principles are introduced. Finally, faster convolutional neural network (Faster-CNN) image feature recognition and style transfer models are designed based on a lightweight deep learning model. The model performance is comprehensively evaluated. The research results show that the designed Faster-CNN model has the highest average recognition efficiency of about 28 ms and the lowest of 17.5 ms in terms of feature recognition of painting images. The accuracy of the Faster-CNN model for image feature recognition is about 97% at the highest and 95% at the lowest. Finally, the designed Faster-CNN model can perform style recognition transfer on a variety of painting images. In terms of style recognition transfer efficiency, the highest recognition transfer rate of the designed Faster-CNN model is about 79%, and the lowest is about 77%. This work not only provides an important technical reference for feature recognition and style transfer of painting images but also contributes to the development of lightweight deep learning techniques.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-05", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2115943155", "name": "Y. Tan"}], "citations": [{"paperId": "5778966c4b7fe181aa94a003666469974c59e837", "title": "Fingerprint-inspired biomimetic tactile sensors for the surface texture recognition"}]}
