{"paperId": "2d444a716b2b33d5696cd195c8c558327f955596", "publicationVenue": null, "title": "Efficient Data Transmission Method Considering Hierarchical Data Structure", "abstract": "In the recent IoT environment, efficient data exchange and combination of heterogeneous data is a necessary function to provide richer services to users. Proper determination of transmission order and estimation of communication cost is one of the main techniques for efficiently providing data exchange and combining. The combination of heterogeneous data mainly uses data having a hierarchical structure. The communication cost estimation of data having a hierarchical structure considers the connection characteristics of the connected parent and child. Previously, there was an estimation of communication cost reflecting the XML structure in a distributed environment. However, the previously proposed formulas are difficult to calculate costs due to their high complexity. In addition, when determining the communication order, conventional methods calculate all cases. Many computations are difficult to apply to IoT environments that need to respond quickly to user needs. We propose a modified cost estimating formula that reduces the complexity to solve existing problems. Next, a method of determining the transmission order by estimating the communication cost in advance is proposed.", "venue": "Proceedings of the 2020 International Conference on Computer Communication and Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "Proceedings of the 2020 International Conference on Computer Communication and Information Systems"}, "authors": [{"authorId": "2113777472", "name": "SeoYoon Jang"}, {"authorId": "2111626095", "name": "Jihoon Kang"}], "citations": [{"paperId": "d885e1cf08eea5aa49c92e4fd75c2c8fa59b0e53", "title": "Research on Multi-layer Power Enterprise Data Management Architecture Based on Big Data"}]}
