{"paperId": "2d5bf1c744c739f6bc5ec35bf534642c8cf7d339", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Factors affecting librarians’ intentions to engage in virtual storytimes", "abstract": "PurposeThis study investigated multiple factors associated with librarians’ intentions to engage in virtual storytimes in public libraries. Based on the theory of planned behavior, the study examined the aspects of attitudes, social norms, behavioral controls and organizational support about librarians’ intentions to engage in virtual storytime practices.Design/methodology/approachA survey was conducted to investigate the perceptions of public librarians who work in children’s services across the USA. The study collected 365 valid responses to assess the impact of the selected factors on librarians’ intentions. Structural equation modeling was employed for statistical analysis.FindingsThe results revealed that attitudes, subjective norms and behavioral controls were significant factors associated with librarians’ intention to engage in virtual storytimes. Among these, attitudinal factors were the most influential; however, organizational support was not a significant factor.Originality/valueMinimal research has been conducted to explore factors associated with online storytime practices, which served as a primary delivery mode during the COVID-19 pandemic. This study is among the first attempts to investigate various factors related to virtual storytimes in public libraries from the perspectives of librarians.", "venue": "Library hi tech", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-04-05", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "40258766", "name": "Soohyung Joo"}, {"authorId": "2253641200", "name": "Maria Cahill"}, {"authorId": "2253875289", "name": "Luke LeFebvre"}, {"authorId": "2256302441", "name": "Antonio Garcia"}, {"authorId": "2253523582", "name": "Averi Cole"}], "citations": []}
