{"paperId": "2d67c01053ec5589ee84e1df0ba8bc74daf7a51e", "publicationVenue": {"id": "ccd6a358-7326-42a7-95e5-bd515c9b5e6c", "name": "Management Decision", "type": "journal", "alternate_names": ["Manag Decis"], "issn": "0025-1747", "url": "http://emeraldgrouppublishing.com/products/journals/journals.htm?id=jmh", "alternate_urls": ["https://www.emeraldinsight.com/loi/md", "http://www.emeraldinsight.com/0025-1747.htm"]}, "title": "Cloud-based big data analytics integration with ERP platforms", "abstract": "PurposeThe importance of integrating cloud-based big data analytics software with enterprise resource planning (ERP) platforms is not clearly understood. Specifically, this study aims to look into firms that implemented SAP during the boom of ERP implementations. Further, this study aims to look into the type of cloud-based big data analytics software that those firms installed when cloud-based packages started to be available.Design/methodology/approachThis study specifically looks at productivity and the sources of productivity, such as technical progress and efficiency change, using a non-parametric approach that does not constrain the analysis to any production function.FindingsThis study found that by the time cloud-based big data analytics software started to be available, SAP-adopters already had a competitive advantage over the non-SAP adopters manifested through productivity and specifically through technology and not efficiency. Later, when the same firms decided to integrate their ERP platforms with cloud-based big data analytics software, the firms that had installed SAP already had an initial advantage over the non-SAP-adopters.Research limitations/implicationsIn support of the theory of technology organization environment (Tornatzky and Fleisher, 1990) and Posner's theoretical framework (Posner, 1961), a cloud-based big data analytics software will not change the relative position that firms have in the industry, so a cloud-based big data analytics software by itself will not provide a competitive advantage over competitors. Still, it will ensure that the preliminary technological gap that SAP-adopters already had is not magnified.Practical implicationsKnowing the sources of productivity improvement and technological improvements will give managers greater leverage when negotiating budgets, negotiating long-term contracts in better terms and in the decision process.Originality/valueThis study fills a research gap by looking into the implementation of a cloud-based big data analytics software with ERP.", "venue": "Management Decision", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-22", "journal": {"name": "Management Decision"}, "authors": [{"authorId": "144679914", "name": "Jorge A. Romero"}, {"authorId": "2064380733", "name": "C. Abad"}], "citations": [{"paperId": "1107295d975148d33e09fea6b1601db9905aa549", "title": "A multi-disciplinary review of enablers and barriers to Cloud ERP implementation and innovation outcomes"}, {"paperId": "bd657b2e996656a1ca7834ac088deba2458dfd10", "title": "Does the regional environment matter in ERP system adoption? Evidence from Russia"}]}
