{"paperId": "2d713207d3af52b39fdec78d48df93394181dcad", "publicationVenue": null, "title": "Serverless Autoscaling Metrics for Optimum Performance on Edge Computing", "abstract": "Serverless edge computing integrates two computing paradigms: edge computing and serverless computing. Edge computing conducts the computational on the Edge of networks, allowing less latency than computing on the cloud. Serverless can make developers focus on the functional logic, and the providers will handle the infrastructure. However, with such limitations on edge computing, serverless on the Edge should be optimized. In this paper, we explore the performance of the Knative Serverless framework that runs on Raspberry Pi with different metrics of autoscaling and find the best per-formance of the combination. The experiments consider three different CPU thresholds and five different maximum pod replications. CPU usage, memory usage, and time for finishing matrix multiplication are used for the evaluation metrics. The results of this experiment show that the combination of the CPU threshold and the maximum number of scaled pods affects the computational time of matrix multiplication on the Edge. Choosing an appropriate CPU threshold affected the matrix multiplication performance and balanced the resource usage. The smallest CPU threshold triggers the earliest replication from the other threshold. However, the smallest CPU threshold produces a slow execution time. An appropriate CPU threshold creates a better balance between execution time and resource usage.", "venue": "2023 6th International Seminar on Research of Information Technology and Intelligent Systems (ISRITI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-12-11", "journal": {"name": "2023 6th International Seminar on Research of Information Technology and Intelligent Systems (ISRITI)", "pages": "65-69"}, "authors": [{"authorId": "2126185576", "name": "Mega Pranata"}, {"authorId": "2199209922", "name": "Aditya Wijayanto"}, {"authorId": "2292757420", "name": "Muhammad Fajar Sidiq"}], "citations": []}
