{"paperId": "2d7540954bbca92467b26722ae2445d02d4682e5", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "Performance-based evaluation of academic libraries in the big data era", "abstract": "The concept of big data has been extensively considered as a technological modernisation in organisations and educational institutes. Thus, the purpose of this study is to determine whether the modified technology acceptance model (MTAM) is viable for evaluating the performance of librarians in the use of big data analytics in academic libraries. This study used an empirical research method for collecting data from 211 librarians working in Pakistan’s universities. On the basis of the findings of the MTAM analysis by structural equation modelling, the performances of the academic libraries were comprehended through the process of big data. The main influential components of the performance analysis in this study were the big data analytics capabilities, perceived ease of access and the usefulness of big data practices in academic libraries. Subsequently, the utilisation of big data was significantly affected by skills, perceived ease of access and the usefulness of academic libraries. The results also suggested that the various components of the academic libraries lead to effective organisational performance when linked to big data analytics.", "venue": "Journal of information science", "year": 2020, "fieldsOfStudy": ["Computer Science", "Political Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-12", "journal": {"name": "Journal of Information Science", "pages": "458 - 471", "volume": "47"}, "authors": [{"authorId": "2055583997", "name": "A. Islam"}, {"authorId": "144852604", "name": "K. Ahmad"}, {"authorId": "145354937", "name": "Muhammad Rafi"}, {"authorId": "1455790375", "name": "Zheng Jian-ming"}], "citations": [{"paperId": "de636834c0bf88a9ad499690a3269b432668eb56", "title": "Big Data Analytics Implementation and Practices in Medical Institute Libraries of Pakistan"}, {"paperId": "d6e81354064a7d8bbe13f73c3da987dfcdd63268", "title": "Unlocking the potential: A systematic analysis of big data applications in Ghanaian academic libraries"}, {"paperId": "f49993fb0a4fda1373dd68e03694a54636ccc954", "title": "An Assessment of Students' Knowledge Ambassadors Program in Promoting Usage of e-Resources in the Academic Library at Mzumbe University, Tanzania"}, {"paperId": "abd02ec4af73438805d4499409d986891b81a74a", "title": "Do system quality and information quality affect job performance? The mediation role of users’ perceptions"}, {"paperId": "c584d3b026c247cb9aa8f37b2a22b25cf530a3ea", "title": "Research on the Evaluation Model of School Management Quality in the Compulsory Education Stage Based on Big Data Technology"}, {"paperId": "990bc8a0ccfc1a375492e3282a0d688c8a0542e5", "title": "Adoption of big data analytics for sustainability of library services in academic libraries of Pakistan"}, {"paperId": "5cbb0d1c8611217e9966705194c0051ced39bc34", "title": "Library Management Practices in the Libraries of Pakistan"}, {"paperId": "3f91a01cee68e5716848b347f69dc637ca4e9b1c", "title": "Students’ perception of academic databases as recognition of learning and research during the COVID-19 pandemic"}, {"paperId": "9f1a933095e05318be5e68f48eaf8223bb462e38", "title": "Access, organize and communicate: the strategic use of browser plugins in libraries"}, {"paperId": "ac4c8b6db4439d53bc7f7f0d4e56299e4776d695", "title": "Determining the impact of technological modernization and management capabilities on user satisfaction and trust in library services"}, {"paperId": "fe25a75faaaca3a6579f92327f98195b2ab8e91f", "title": "Design and Development of Iranian Institutional Repositories Integrated Search (IRIS) Portal"}, {"paperId": "d5263db9db08f21cd195d2257852d1b9eb72534d", "title": "Perspectives: Revisited"}, {"paperId": "398e2d42d0a81cb3b6fe782e2a83f6e8b8287973", "title": "Estimation of the knowledge management model for performance measurement in university libraries"}, {"paperId": "cbf47c65168349c6b3bb5e9bf4276dbb07675df0", "title": "Knowledge-based society and emerging disciplines: a correlation of academic performance"}]}
