{"paperId": "2d78abf6e8fdf7de5be774d145542a6189d8fc0d", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Reconfigurable Smart Contracts for Renewable Energy Exchange with Re-Use of Verification Rules", "abstract": "Smart contracts constitute the foundation for blockchain distributed applications. These constructs enable transactions in trustless environments using consensus algorithms and software-controlled verification rules. In the current state of the art, there is a shortage of works on the adaptability of smart contracts, and the re-use of their source code is limited mainly to cloning. The paper discusses the pattern of smart contract design and implementation with the overt declaration of verification rules. The author introduces two advantages of the pattern: Firstly, run-time reconfigurability of the list of smart contract verification rules to adjust for various transaction types. Secondly, the re-use of verification rules between different configurations of the smart contract, and among diverse smart contracts. The paper uses blockchain platform-independent stereotypes from a dedicated Unified Modeling Language (UML) profile for designing smart contracts and verification rules. The implementation of the pattern is developed in object-oriented Java language. The pattern exploits polymorphism and controls inheritance by using sealed classes with permission for specialization only for selected final ones. Thus, the pattern ensures two recently highly desired properties in smart contract design and development: re-use and security. Moreover, the declared verification rules list facilitates test automation and reduces test preparation effort due to the re-use of test classes among smart contract configurations. The pattern usage is illustrated in the example of renewable energy exchange within the prosumers community and amid various communities.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-25", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "47317592", "name": "T. Górski"}], "citations": [{"paperId": "d782b054c8c63624eda75ad1307c19be94bbbb9d", "title": "SmarTS: A Java package for smart contract test suite generation and execution"}, {"paperId": "144432bf84dff6480cfcbf2b0d48a1c0685a90ca", "title": "Integrating economic load dispatch information into the blockchain smart contracts based on the fractional-order swarming optimizer"}, {"paperId": "f959e2bd30865eaf7637e1aa2c86367608a42fd5", "title": "Smart Contract Design Pattern for Processing Logically Coherent Transaction Types"}, {"paperId": "4369364e83a5d1e293a7d01eb01ce03099f70fb9", "title": "Power trading Raft consensus mechanism considering green certificate and carbon emission weights"}, {"paperId": "9b2fe7dbcf00eba45d85952b14c2ddfd7f15cd96", "title": "The impact of blockchain on digital content distribution: a systematic review"}, {"paperId": "a81dfd9976592d6dc451fd64c648234ea0a08b39", "title": "Evaluation of Smart Contract Vulnerability Analysis Tools: A Domain-Specific Perspective"}, {"paperId": "32a6795a77018c3f24cbfc66ce276bf78cdc5711", "title": "Multi-timescale optimal control strategy for energy storage using LSTM prediction–correction in the active distribution network"}, {"paperId": "ea9110c466b602344cf67ee7b98b36cd4bf60167", "title": "Design of blockchain-based applications using model-driven engineering and low-code/no-code platforms: a structured literature review"}, {"paperId": "df2737aee3cf51fdf006e969795a827adcc26902", "title": "Achieving a Secure and Traceable High-Definition Multimedia Data Trading Scheme Based on Blockchain"}, {"paperId": "42859c332185aadf7369f51de7bc6d3ff13760ea", "title": "DCAGS-IoT: Dynamic Cross-Domain Authentication Scheme Using Group Signature in IoT"}, {"paperId": "ebea37932ea395937ce1790df99618121d53736c", "title": "Blockchain-Based Loyalty Management System"}, {"paperId": "9be80bd493863c33e316f1bfb226386c3349da2b", "title": "Managing Expatriate Employment Contracts with Blockchain"}, {"paperId": "84f09dfd6d0915c4c38de277130af108f43e8e18", "title": "Distributed and Federated Authentication Schemes Based on Updatable Smart Contracts"}, {"paperId": "8b7e8df1a80769fb5a16e8288952a56eeb8e2794", "title": "Blockchain-Based Trust and Reputation Management in SIoT"}, {"paperId": "75cef178176da948e62e71f63b3f1a38c856dd04", "title": "Energy Internet Opportunities in Distributed Peer-to-Peer Energy Trading Reveal by Blockchain for Future Smart Grid 2.0"}, {"paperId": "213c3587b83dcafbd935516e9b6dd75f428094ca", "title": "Identity Management and Authentication of a UAV Swarm Based on a Blockchain"}, {"paperId": "be43f48e523e05dd295873cb8130644794c0b755", "title": "A Proactive Protection of Smart Power Grids against Cyberattacks on Service Data Transfer Protocols by Computational Intelligence Methods"}, {"paperId": "7fd36000136a33c3952f88d42e9ef52b71569c08", "title": "Distributed Supervision Model for Enterprise Data Asset Trading Based on Blockchain Multi-Channel in Industry Alliance"}, {"paperId": "d3347bd3cd20ba79f589781338b14e837e1ab899", "title": "ASSERT: A Blockchain-Based Architectural Approach for Engineering Secure Self-Adaptive IoT Systems"}, {"paperId": "6ea9ce2bbe4c4928630a0d98be464eebde749461", "title": "Enabling Technologies for Energy Communities: Some Experimental Use Cases"}, {"paperId": "7a9993c90f94e38e9aa9006041b9df1d376326a8", "title": "Tailored Blockchain Applications for the Natural Gas Industry: The Case Study of SOCAR"}, {"paperId": "8ea5c58aec393d1cd5c5ceb4f855f7735da515f3", "title": "Automatic Repair Method for Null Pointer Dereferences Guided by Program Dependency Graph"}, {"paperId": "4c92aa2612db3a2659320f3580047961a347b083", "title": "Will Oil Price Volatility Cause Market Panic?"}, {"paperId": "39b270b9cb8d4f2d372038a7846c3b3e099992b6", "title": "Integrating Forecasting Service and Gen2 Blockchain Into a Local Energy Trading Platform to Promote Sustainability Goals"}, {"paperId": "91aab06758d0f30e0e5c73223e8ee08651ad5e96", "title": "A secure multi-party payment channel on-chain and off-chain supervisable scheme"}, {"paperId": "ffbd27488e7db5f8fe625d311d32a11ef36d440d", "title": "A New Digital Signature Primitive and Its Application in Blockchain"}]}
