{"paperId": "2d7f9baf62e6b331cce514362fb74afcfdce8039", "publicationVenue": {"id": "acd759b3-bdf2-49d7-96c1-f5750716422e", "name": "Frontiers in Sustainable Cities", "type": "journal", "alternate_names": ["Front Sustain City"], "issn": "2624-9634", "url": "https://www.frontiersin.org/journals/sustainable-cities#"}, "title": "A Novel Building Performance Based Climate Zoning for Ethiopia", "abstract": "Climate zoning plays a vital role in the development and implementation of building energy regulations. his paper presents a novel building performance-based approach for climate zoning. By using a high resolution spatial climate dataset, a climate severity mapping of Ethiopia is presented. Ethiopia represents 13 of the Köppen Geiger global climate zones. Real-time thermal performance measurement of representative residential buildings in three climatic locations is presented. Thermodynamic models of these buildings are developed and validated using energyplus software tool. Hourly building simulations of these buildings are performed for 1,490 locations (15 min spatial resolution) across Ethiopia. Cooling and heating discomfort hours, as well as energy performance index, are computed for each of these geolocations. Spatially interpolated building performance metrics and adaptive thermal comfort limits are presented. The relevance of Köppen Geiger's classification in the context of building performance is statistically tested. We observed that the existing climate zones do not considerably represent the building thermal performance and energy footprint. Effect of thermal severity on building performance is described. Further, climate zones are deduced based on the building performance variables using multivariate statistical clustering. In order to evaluate potential climate responsive strategies, bioclimatic zoning of Ethiopia is presented. The bioclimatic zoning is created using an improved Mahoney's method that incorporates solar radiation. This analysis resulted in 21 bioclimatic strategy zones. A comparative assessment of the new climate zoning with Mahoney's bioclimatic classification is presented. The proposed framework will be relevant for regulating building performance and energy conservation measures.", "venue": "Frontiers in Sustainable Cities", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-08", "journal": {"volume": "4"}, "authors": [{"authorId": "115108045", "name": "B. Zeleke"}, {"authorId": "2157851606", "name": "Mayank Kumar"}, {"authorId": "9382544", "name": "E. Rajasekar"}], "citations": [{"paperId": "4de8bf28e442b61608f3e58e7866965c83f4ca6c", "title": "Bioclimatic classification for building energy efficiency using hierarchical clustering: A case study for Sri Lanka"}, {"paperId": "1acc8b17da53872d7013a3b3c3b8eb102b215082", "title": "A new microclimate zoning method based on multivariate statistics: The case of Reunion Island"}, {"paperId": "39a8d63cb39e3ffd0ad7fb078940357cf50656d4", "title": "A new bioclimatic zoning for India"}, {"paperId": "aa94b00ab0f6c7e2072982eef680e6820c4e8589", "title": "Assessment of climate classification methodologies used in building energy efficiency sector"}]}
