{"paperId": "2d8054f34c4c2ba1e5241fae19c78dad95b8b184", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Personality Types and Traits—Examining and Leveraging the Relationship between Different Personality Models for Mutual Prediction", "abstract": "The popularity of social media services has led to an increase of personality-relevant data in online spaces. While the majority of people who use these services tend to express their personality through measures offered by the Myers–Briggs Type Indicator (MBTI), another personality model known as the Big Five has been a dominant paradigm in academic works that deal with personality research. In this paper, we seek to bridge the gap between the MBTI, Big Five and another personality model known as the Enneagram of Personality, with the goal of increasing the amount of resources for the Big Five model. We further explore the relationship that was previously reported between the MBTI types and certain Big Five traits as well as test for the presence of a similar relationship between Enneagram and Big Five measures. We propose a new method relying on psycholingusitc features selected based on their relationship with the MBTI model. This approach showed the best performance through our experiments and led to an increase of up to 3% in automatic personality recognition for Big Five traits on the per-trait level. Our detailed experimentation offers further insight into the nature of personality and into how well it translates between different personality models.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-02", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2122983612", "name": "Dušan Radisavljević"}, {"authorId": "51953877", "name": "Rafal Rzepka"}, {"authorId": "144710424", "name": "K. Araki"}], "citations": [{"paperId": "3cea0fe210566d9bbe36a11c5524512122f0e450", "title": "Personality prediction from task-oriented and open-domain human–machine dialogues"}, {"paperId": "17606dbe67df42d973015fdd35f2807b0cafc15b", "title": "The Self-Perception and Political Biases of ChatGPT"}]}
