{"paperId": "2d87d98c726e90f7eb84c74339d341ffb20da082", "publicationVenue": {"id": "da1ee6f4-c965-42d6-8b0b-a4cb9294f05d", "name": "Agronomy", "type": "journal", "issn": "2073-4395", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217994", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217994", "https://www.mdpi.com/journal/agronomy"]}, "title": "Design and Evaluation of a Crowdsourcing Precision Agriculture Mobile Application for Lambsquarters, Mission LQ", "abstract": "Precision agriculture is highly dependent on the collection of high quality ground truth data to validate the algorithms used in prescription maps. However, the process of collecting ground truth data is labor-intensive and costly. One solution to increasing the collection of ground truth data is by recruiting citizen scientists through a crowdsourcing platform. In this study, a crowdsourcing platform application was built using a human-centered design process. The primary goals were to gauge users’ perceptions of the platform, evaluate how well the system satisfies their needs, and observe whether the classification rate of lambsquarters by the users would match that of an expert. Previous work demonstrated a need for ground truth data on lambsquarters in the D.C., Maryland, Virginia (DMV) area. Previous social interviews revealed users who would want a citizen science platform to expand their skills and give them access to educational resources. Using a human-centered design protocol, design iterations of a mobile application were created in Kinvey Studio. The application, Mission LQ, taught people how to classify certain characteristics of lambsquarters in the DMV and allowed them to submit ground truth data. The final design of Mission LQ received a median system usability scale (SUS) score of 80.13, which indicates a good design. The classification rate of lambsquarters was 72%, which is comparable to expert classification. This demonstrates that a crowdsourcing mobile application can be used to collect high quality ground truth data for use in precision agriculture.", "venue": "Agronomy", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-28", "journal": {"name": "Agronomy"}, "authors": [{"authorId": "26984702", "name": "Brianna B. Posadas"}, {"authorId": "34901380", "name": "M. Hanumappa"}, {"authorId": "51913343", "name": "K. Niewolny"}, {"authorId": "2223819732", "name": "J. Gilbert"}], "citations": [{"paperId": "47f9f70d5ad876608f37d461ce8a3073dde865b6", "title": "The role of citizen science mobile apps in facilitating a contemporary digital agora"}, {"paperId": "bad3e1a2511f86009491e5ebd359523dd3529484", "title": "AgFAB - A Farmer-centered Agricultural Bower"}, {"paperId": "b52691c0adeb33c78efc25556bac3b3b3ac24c02", "title": "CAPTCHA for crowdsourced image annotation: directions and efficiency analysis"}]}
