{"paperId": "2d89a508be3bbb60aa4b5f1676fdba617a0f9d2d", "publicationVenue": {"id": "f9819fa7-4a3e-4cc6-8fa6-9c87c89d6eb4", "name": "The Journal of Applied Laboratory Medicine", "type": "journal", "alternate_names": ["J Appl Lab Med"], "issn": "2475-7241", "url": "https://academic.oup.com/jalm"}, "title": "Longitudinal Assessment of SARS-CoV-2 Anti-Nucleocapsid and anti-Spike-1-RBD Antibody Testing Following PCR-Detected SARS-CoV-2 Infection", "abstract": "Abstract Background SARS-CoV-2 serologic assays are becoming increasingly available and may serve as a diagnostic aid in a multitude of settings relating to past infection status. However, there is limited literature detailing the longitudinal performance of EUA-cleared serologic assays in US populations, particularly in cohorts with a remote history of PCR-confirmed SARS-CoV-2 infection (e.g., > 2 months). Methods We evaluated the diagnostic sensitivities and specificities of the Elecsys® Anti-SARS-CoV-2 (anti-N) and Elecsys® Anti-SARS-CoV-2 S (anti-S1-RBD) assays, using 174 residual clinical samples up to 267 days post-PCR diagnosis of SARS-CoV-2 infection (n = 154) and a subset of samples obtained prior to the COVID-19 pandemic as negative controls (n = 20). Results The calculated diagnostic sensitivities for the anti-N and anti-S1-RBD assays were 89% and 93%, respectively. Of the 154 samples in the SARS-CoV-2-positive cohort, there were 6 discrepant results between the anti-N and anti-S1-RBD assays, 5 of which were specimens collected ≥ 200 days post-PCR positivity and only had detectable levels of anti-S1-RBD antibodies. When only considering specimens collected ≥ 100 days post-PCR positivity (n = 41), the sensitivities for the anti-N and anti-S1-RBD assays were 85% and 98%, respectively. Conclusions The anti-S1-RBD assay demonstrated superior sensitivity at time points more remote to the PCR detection date, with 6 more specimens from the SARS-CoV-2-positive cohort detected, 5 of which were collected more than 200 days post-PCR positivity. While analytical differences and reagent lot-to-lot variability are possible, this may indicate that, in some instances, anti-S1-RBD antibodies may persist longer in vivo and may be a better target for detecting remote SARS-CoV-2 infection.", "venue": "The Journal of Applied Laboratory Medicine", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-05", "journal": {"name": "The Journal of Applied Laboratory Medicine"}, "authors": [{"authorId": "1390063302", "name": "Joe M. El-Khoury"}, {"authorId": "14677344", "name": "W. Schulz"}, {"authorId": "4835776", "name": "Thomas J. S. Durant"}], "citations": [{"paperId": "85abe67340479bd415a708da2bf4f2b2999dd5b4", "title": "ANALYSIS OF THE PREVALENCE OF ANTI-SARS-CoV-2 ANTIBODIES IN GROUPS OF MEDICAL AND NON-MEDICAL PROFESSIONS"}, {"paperId": "93280cbdd6c4cb8bd90203971bd1c41a422e40c5", "title": "Utility of Roche Elecsys anti-SARS-CoV-2 S in ascertaining post-vaccine neutralizing antibodies"}, {"paperId": "183655d146a1013c3c9a484a20bd6d364c95f182", "title": "Serial cross-sectional estimation of vaccine-and infection-induced SARS-CoV-2 seroprevalence in British Columbia, Canada"}, {"paperId": "5e28d457742acd6b6b9f6277e59b6b4213aba087", "title": "Assessing the Pre-Vaccination Anti-SARS-CoV-2 IgG Seroprevalence among Residents and Staff in Nursing Home in Niigata, Japan, November 2020"}, {"paperId": "541adfefbe783031761b6dcd6e31483ca4f38c1f", "title": "Serial cross-sectional estimation of vaccine and infection-induced SARS-CoV-2 sero-prevalence in children and adults, British Columbia, Canada: March 2020 to August 2022"}, {"paperId": "82ed06bcf073ed0ef1cf64fc72f22745521f6f10", "title": "Performance evaluation of three automated quantitative immunoassays and their correlation with a surrogate virus neutralization test in coronavirus disease 19 patients and pre‐pandemic controls"}, {"paperId": "bd75c971d7fa4d6c7d6c2dc0e2bf346d9c91a48d", "title": "Myopericarditis in young adults presenting to the emergency department after receiving a second COVID‐19 mRNA vaccine"}]}
