{"paperId": "2d8c3dd54560b02058a2614ca410c310481a46aa", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Non-Intrusive Load Monitoring of Buildings Using Spectral Clustering", "abstract": "With widely deployed smart meters, non-intrusive energy measurements have become feasible, which may benefit people by furnishing a better understanding of appliance-level energy consumption. This work is a step forward in using graph signal processing for non-intrusive load monitoring (NILM) by proposing two novel techniques: the spectral cluster mean (SC-M) and spectral cluster eigenvector (SC-EV) methods. These methods use spectral clustering for extracting individual appliance energy usage from the aggregate energy profile of the building. After clustering the data, different strategies are employed to identify each cluster and thus the state of each device. The SC-M method identifies the cluster by comparing its mean with the devices’ pre-defined profiles. The SC-EV method employs an eigenvector resultant to locate the event and then recognize the device using its profile. An ideal dataset and a real-world REFIT dataset are used to test the performance of these two techniques. The f-measure score and disaggregation accuracy of the proposed techniques demonstrate that these two techniques are competitive and viable, with advantages of low complexity, high accuracy, no training data requirement, and fast processing time. Therefore, the proposed techniques are suitable candidates for NILM.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "1491183315", "name": "Muzzamil Ghaffar"}, {"authorId": "23328519", "name": "S. Sheikh"}, {"authorId": "47199531", "name": "Noman Naseer"}, {"authorId": "1403672634", "name": "Z. Mohy-Ud-Din"}, {"authorId": "2114256369", "name": "Hafiz Zia Ur Rehman"}, {"authorId": "31207742", "name": "Muhammad Naved"}], "citations": [{"paperId": "f7f90b2d3ab9b35baf9dbd20b6faf28e87353211", "title": "Non-Intrusive Load Monitoring in Smart Grids: A Comprehensive Review"}, {"paperId": "154d50b81da21b8e25332abb2267802d24042379", "title": "DeepEdge-NILM: A case study of non-intrusive load monitoring edge device in commercial building"}, {"paperId": "7ba5ace8a43c8e2fda5ade89df741dbd592fe6a2", "title": "MSFEN-AM: A Non-intrusive Load Identification Method for Power Saving"}, {"paperId": "4477173e155fdeee3ec2fab084b0d9bbf77d749b", "title": "Non-Intrusive Electric Load Monitoring Approach Based on Current Feature Visualization for Smart Energy Management"}, {"paperId": "94613277c2076e8aef77e0cf226e23bffa38a8c1", "title": "A Residual Convolutional Neural Network with Multi-block for Appliance Recognition in Non-intrusive Load Identification"}, {"paperId": "621d7a487e3f8ac99019eb9cf090cd016c351b52", "title": "Active power-based event detection algorithm for real-time load monitoring systems"}, {"paperId": "98724d61cdf0cad359e4f00d7f847c8ef0ab93ce", "title": "A survey of smart home energy conservation techniques"}, {"paperId": "b3778868ae66a361402e9c9ebae800cf459107f5", "title": "Non-Intrusive Load Monitoring"}, {"paperId": "0e4fc7c655ff6b3838d13a9ca5ced468de65dd50", "title": "Accuracy Improvement of Non-Intrusive Load Monitoring Using Voting-Based Consensus Clustering"}]}
