{"paperId": "2d9011f3e8e8cdd33553e56b211fbfbb202265fd", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "How Dramatic Events Can Affect Emotionality in Social Posting: The Impact of COVID-19 on Reddit", "abstract": "The COVID-19 outbreak impacted almost all the aspects of ordinary life. In this context, social networks quickly started playing the role of a sounding board for the content produced by people. Studying how dramatic events affect the way people interact with each other and react to poorly known situations is recognized as a relevant research task. Since automatically identifying country-based COVID-19 social posts on generalized social networks, like Twitter and Facebook, is a difficult task, in this work we concentrate on Reddit megathreads, which provide a unique opportunity to study focused reactions of people by both topic and country. We analyze specific reactions and we compare them with a “normal” period, not affected by the pandemic; in particular, we consider structural variations in social posting behavior, emotional reactions under the Plutchik model of basic emotions, and emotional reactions under unconventional emotions, such as skepticism, particularly relevant in the COVID-19 context.", "venue": "Future Internet", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-27", "journal": {"name": "Future Internet", "pages": "29", "volume": "13"}, "authors": [{"authorId": "3101511", "name": "Valerio Basile"}, {"authorId": "2162511", "name": "Francesco Cauteruccio"}, {"authorId": "1743359", "name": "G. Terracina"}], "citations": [{"paperId": "0e613354241568766bef3bf60dff7cad1ee6b529", "title": "Analyzing public sentiments on the Cullen Commission inquiry into money laundering: harnessing deep learning in the AI of Things Era"}, {"paperId": "750a06a145c038ef6aeb728bbf05bc63d3185f7b", "title": "What Influences Users' Intention to Share Works in Designer-Driven User-Generated Content Communities? A Study Based on Self-Determination Theory"}, {"paperId": "b128b72cc33e538e021f6e99ba327184ff2e6944", "title": "Measuring Behavior Change with Observational Studies: a Review"}, {"paperId": "c51e6c048f5e35c72c3a90331fc2da252a17ce4f", "title": "A Dataset for Entity Recognition of COVID-19 Public Opinion in Social Media"}, {"paperId": "d2a52f28599ab33f2e0ffb3fd357ab7cec7c7bc1", "title": "Influence of Media Information Sources on Vaccine Uptake: The Full and Inconsistent Mediating Role of Vaccine Hesitancy"}, {"paperId": "be9da9c55e5239303db3c07e728c1d40bfaff483", "title": "Twitter Mining for Detecting Interest Trends on Biodiversity: Messages from Seven Language Communities"}, {"paperId": "eb9d0ddb4db0eaecc1761f0a043acf13a8ae131a", "title": "COVID-19 Impacts on the IT Job Market: A Massive Job Ads Analysis"}, {"paperId": "0fa9cf1e92c33813b2bded274c947463f92bd941", "title": "Know an Emotion by the Company It Keeps: Word Embeddings from Reddit/Coronavirus"}, {"paperId": "ecf63f7b3874998d4f8d6b95b0698b573c5bb8cb", "title": "A framework for investigating the dynamics of user and community sentiments in a social platform"}, {"paperId": "103c04f7a94848fbe7cc1e0279187595512bb29c", "title": "News Coverage of COVID-19 on Social Media and Public’s Negative Emotions: A Computational Study (Preprint)"}, {"paperId": "6c8bbd0bd88968bea97ec54a268b23cb29f303ee", "title": "The Emotional Impact of COVID-19 News Reporting: A Longitudinal Study Using Natural Language Processing"}, {"paperId": "0e37d6b92a98bf48da9145339a356d24c7bd9e13", "title": "Analysis Of COVID-19 Effects On Wellbeing - Study Of Reddit Posts Using Natural Language Processing Techniques"}, {"paperId": "ff155f100c86eeb1b335dd7a74de352cdbadc0cc", "title": "Textual emotion detection in health: Advances and applications"}, {"paperId": "a5e5f65ed933cb43e0848b368b4d79e953372c49", "title": "Bridging the Social Distance: Offline to Online Social Support during the COVID-19 Pandemic"}, {"paperId": "4d8a8fd97601a82653176370f1ad7b2df7029205", "title": "A Space-Time Framework for Sentiment Scope Analysis in Social Media"}, {"paperId": "f1f0af0862332e4d83fc1481d322fc979b649ab9", "title": "Ensemble hybrid model for Hindi COVID-19 text classification with metaheuristic optimization algorithm"}, {"paperId": "7cb419a36cb2469fc92b915dec08e0e3313143de", "title": "Agenda-Setting for COVID-19: A Study of Large-Scale Economic News Coverage Using Natural Language Processing"}, {"paperId": "e00b76b8c9827269faf23ee69a035055d1c101fb", "title": "A Study on Epidemic Information Screening, Prevention and Control of Public Opinion Based on Health and Medical Big Data: A Case Study of COVID-19"}, {"paperId": "55fd5534e3453bd8b27eb9a1318d7d4c3896f2c9", "title": "Public Sentiment Analysis and Topic Modeling Regarding COVID-19's Three Waves of Total Lockdown: A Case Study on Movement Control Order in Malaysia"}, {"paperId": "0852505b8a349b1228f9728fff0a764d23a61aa8", "title": "Multimodal Pipeline for Collection of Misinformation Data from Telegram"}, {"paperId": "32c9e91ea1b18f684d8f2d0b7a779165c2850a04", "title": "Sentimental and spatial analysis of COVID-19 vaccines tweets"}, {"paperId": "03e87b82b80610f3cc8a933b480c5f74b5caf56e", "title": "Extraction and analysis of text patterns from NSFW adult content in Reddit"}, {"paperId": "98bb8af15f7e74e26c486c979cbed0a07177bbfc", "title": "Depicting the Emotion Flow: Super-Spreaders of Emotional Messages on Weibo During the COVID-19 Pandemic"}, {"paperId": "2fb1fea9cb27bd3b245882bdd269cc60650f11cc", "title": "Understanding the emotional response to COVID‐19 information in news and social media: A mental health perspective"}, {"paperId": "bb73234f55568527d75dedda909cd90b051c9ab4", "title": "FibVID: Comprehensive fake news diffusion dataset during the COVID-19 period"}, {"paperId": "b2ac839b6579f9053151a625be2766d646d930bb", "title": "Application of Data Science for Understanding Emotional Dimensional Behavior and Their Connection to Uncertainty and Risk Behavior"}, {"paperId": "58099c0a4cc020af4799f56dad7b3193e7e1d072", "title": "What Inﬂuences Users’ Intention to Share Works in Designer-Driven User-Generated Content Communities? A Study Based on Self-Determination Theory"}]}
