{"paperId": "2d93bb4f91379a34a81dbab937b96d0abd9cb0e9", "publicationVenue": null, "title": "A Systematic Survey: Security Threats to UAV-Aided IoT Applications, Taxonomy, Current Challenges and Requirements With Future Research Directions", "abstract": "Unmanned aerial vehicles (UAVs) as an intermediary can offer an efficient and useful communication paradigm for different Internet of Things (IoT) applications. Following the operational capabilities of IoTs, this emerging technology could be extremely helpful in the area, where human access is not possible. Because IoT devices are employed in an infrastructure-less environment, where they communicate with each other via the wireless medium to share accumulated data in network topological order. However, the unstructured deployment with wireless and dynamic communication make them disclosed to various security threats, which need to be addressed for their efficient results. Therefore, the primary objective of this work is to present a comprehensive survey of the theoretical literature associated with security concerns of this emerging technology from 2015-to-2022. To follow up this, we have overviewed different security threats of UAV-aided IoT applications followed by their countermeasures techniques to identify the current challenges and requirements of this emerging technology paradigm that must be addressed by researchers, enterprise market, and industry stakeholders. In light of underscored constrains, we have highlighted the open security challenges that could be assumed a move forward step toward setting the future research insights. By doing this, we set a preface for the answer to a question, why this paper is needed in the presence of published review articles. For novelty and uniqueness, we have performed a comparative analysis section-wise with rival papers to demonstrate that how this paper is different from them.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "1437-1455", "volume": "24"}, "authors": [{"authorId": "1453069239", "name": "M. Adil"}, {"authorId": "2015986", "name": "M. Jan"}, {"authorId": "119924223", "name": "Yongxin Liu"}, {"authorId": "51041600", "name": "Hussein Abulkasim"}, {"authorId": "2071968440", "name": "A. Farouk"}, {"authorId": "72482218", "name": "H. Song"}], "citations": [{"paperId": "78fd1f4967a66baa177778a1ee68856396ccc3e9", "title": "Secure, Robust, and Energy-Efficient Authenticated Data Sharing in UAV-Assisted 6G Networks"}, {"paperId": "1ffbc48d73ddea9db678e748afc547e713b8d160", "title": "An Improved Congestion-Controlled Routing Protocol for IoT Applications in Extreme Environments"}, {"paperId": "dae9e87ae600017de470745e488aff3027193d73", "title": "Optimizing QoS and security in agriculture IoT deployments: A bioinspired Q-learning model with customized shards"}, {"paperId": "69b68c398447e23827b1b5fb535457c66f4f67f8", "title": "Privacy Preserving Techniques and Deployment Types in Unmanned Aerial Systems"}, {"paperId": "1e7818cbdf48aee846285b176833b00f98cc804c", "title": "Machine-Learning-Based Vulnerability Detection and Classification in Internet of Things Device Security"}, {"paperId": "d8e3376607bc52fe8d82d4171aef4e4cf56cf71f", "title": "A Blockchain-Based Multi-Unmanned Aerial Vehicle Task Processing System for Situation Awareness and Real-Time Decision"}, {"paperId": "f6c59cf6f2297aabe1ad89b34f5650f631fd574a", "title": "A Deep Learning-Based Multi-Signal Radio Spectrum Monitoring Method for UAV Communication"}, {"paperId": "5fd87af776899cd02a8df34655e57f518e9de683", "title": "A Survey on the Design Aspects and Opportunities in Age-Aware UAV-Aided Data Collection for Sensor Networks and Internet of Things Applications"}]}
