{"paperId": "2d96807644cd53b058ffbdef5cee8d042709fc54", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Efficient Certification of Endpoint Control on Blockchain", "abstract": "Proving that an endpoint (e.g. URL, telephone number, etc.) is controlled by a subject is crucial in many applications. In the web, this is witnessed by the widespread adoption of HTTPS. In centralized architectures, this task is usually carried out by trusted certification authorities (CAs). In decentralized applications, for example based on blockchains, or for self-sovereign identity management (SSI), it would be desirable to perform these checks in a decentralized way, relying on the collective behavior of a society of individuals rather than on a single trusted entity. In any case, the result should be a widely usable certificate, as in the centralized CA case. In this paper, we show two blockchain-based methods to prove the association between a subject and an endpoint in a decentralized manner. Our methods are compatible with a wide variety of endpoints and contribute to fill the gap of the current SSI approaches with respect to decentralization. We analyze the security of our proposal and provide a proof-of-concept implementation. We also evaluate performances, costs, and compatibility with current standardization efforts about SSI.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-02", "journal": {"name": "IEEE Access", "pages": "133309-133334", "volume": "9"}, "authors": [{"authorId": "94580478", "name": "Diego Pennino"}, {"authorId": "1721655", "name": "M. Pizzonia"}, {"authorId": "1950204", "name": "A. Vitaletti"}, {"authorId": "1471441018", "name": "Marco Zecchini"}], "citations": [{"paperId": "bd8034392209ef69d645690df191180ba3f5186d", "title": "A systematic state-of-art review on digital identity challenges with solutions using conjugation of IOT and blockchain in healthcare"}, {"paperId": "206913065be02b9b8b19300d80ce51e26e45fba5", "title": "Building a Cross-Chain Identity: A Self-Sovereign Identity-Based Framework"}, {"paperId": "ea4db263a756878775937462d1652b6912b5ecfa", "title": "Licensing System for Sea Fearers using Blockchain Technology"}, {"paperId": "638592ac535737e3b2dea9227337c2a975e36d67", "title": "On-Chain Global Maintenance Services"}, {"paperId": "42b19084b6b12c02a9faac2c4cfc7e15a5461457", "title": "Blockchain Scalability and Security: Communications Among Fast-Changing Committees Made Simple"}, {"paperId": "38ce64e31a54ecc17a3f9690cca2d685a5718861", "title": "Blockchain as IoT Economy Enabler: A Review of Architectural Aspects"}, {"paperId": "0ff12716ab7bbe38e3af6e38bb2de14dff445a4c", "title": "Empowering citizens by a blockchain-Based Robinson list"}, {"paperId": "5ca30ec6fa1d052ca4a648828c618ce50116cb22", "title": "Decentralized robinson list"}, {"paperId": "bbbd70b8457dc54935cb8d55f96857b73c00e0ca", "title": "USBCaptchaIn: Preventing (Un)Conventional Attacks from Promiscuously Used USB Devices in Industrial Control Systems"}]}
