{"paperId": "2daa29c3752860a45282003f636a97f9972ff94a", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Attribute based honey encryption algorithm for securing big data: Hadoop distributed file system perspective", "abstract": "Hadoop has become a promising platform to reliably process and store big data. It provides flexible and low cost services to huge data through Hadoop Distributed File System (HDFS) storage. Unfortunately, absence of any inherent security mechanism in Hadoop increases the possibility of malicious attacks on the data processed or stored through Hadoop. In this scenario, securing the data stored in HDFS becomes a challenging task. Hence, researchers and practitioners have intensified their efforts in working on mechanisms that would protect user’s information collated in HDFS. This has led to the development of numerous encryption-decryption algorithms but their performance decreases as the file size increases. In the present study, the authors have enlisted a methodology to solve the issue of data security in Hadoop storage. The authors have integrated Attribute Based Encryption with the honey encryption on Hadoop, i.e., Attribute Based Honey Encryption (ABHE). This approach works on files that are encoded inside the HDFS and decoded inside the Mapper. In addition, the authors have evaluated the proposed ABHE algorithm by performing encryption-decryption on different sizes of files and have compared the same with existing ones including AES and AES with OTP algorithms. The ABHE algorithm shows considerable improvement in performance during the encryption-decryption of files.", "venue": "PeerJ Computer Science", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-17", "journal": {"name": "PeerJ Computer Science", "volume": "6"}, "authors": [{"authorId": "31354224", "name": "Gayatri Kapil"}, {"authorId": "2396584", "name": "A. Agrawal"}, {"authorId": "1573913504", "name": "Abdulaziz Attaallah"}, {"authorId": "2113921569", "name": "A. Algarni"}, {"authorId": "153411712", "name": "Rajeev Kumar"}, {"authorId": "3229010", "name": "R. Khan"}], "citations": [{"paperId": "e0427ef0a6ee700d5a32f7934da30efe9af17cd9", "title": "Large file encryption in a reduced-round permutation-based AES file management system"}, {"paperId": "cbdec06393b472313434e73a2cb80dc68994eee0", "title": "EStore: A User-Friendly Encrypted Storage Scheme for Distributed File Systems"}, {"paperId": "3c44e92e1f69e45e47bc83656e13074ff8da0298", "title": "A Review on Reading of Text Hidden in Image Using Steganography"}, {"paperId": "509d3165f7c99169a3d0fea25bfa10b136ed0731", "title": "Research communities in cyber security vulnerability assessments: A comprehensive literature review"}, {"paperId": "23f948802ce2b6c906e8822143f730e463c15db7", "title": "On forecasting of COVID-19 transmission in Saudi Arabia and Egypt using reservoir computing model"}, {"paperId": "c8b7cb88edd20d8512bd95df8397ee5745db1fbf", "title": "A Framework for Attribute-Based Access Control in Processing Big Data with Multiple Sensitivities"}, {"paperId": "5559efe1dfe522bec64133f79652ebf926d94387", "title": "Hadoop-based secure storage solution for big data in cloud computing environment"}, {"paperId": "55ece2245d2b01e45507b5d257a83efe3745f2e3", "title": "Fine-grained flexible access control: ciphertext policy attribute based encryption for arithmetic circuits"}, {"paperId": "09db1a8ac2bbf488e86926179f1d09635a0d6842", "title": "Design of ChaApache framework for securing Hadoop application in big data"}, {"paperId": "ae3c98d52735f8d5c334e62fa5b96e5d34c9a99f", "title": "Towards Design and Development of Security Assessment Framework for Internet of Medical Things"}, {"paperId": "191bc18fec6877472b78255cbd0a70360ec15006", "title": "Honey Encryption Security Techniques: A Review Paper"}, {"paperId": "b99905ac24c7f8e5e9a8eb2a8c3857ba8f1c6f6d", "title": "Encryption Algorithm using Matrix Manipulation"}, {"paperId": "595e609ca6bcbf7911e0c90ee39ccc1a445052de", "title": "An Approach To Secure Sensitive Attributes Stored On HDFS Using Blowfish"}, {"paperId": "38282e1baafa129106f787890b266020bf4bb545", "title": "Dual Layered Authentication Security for Sensitive Healthcare Data by Hadoop MapReduce"}, {"paperId": "e5e1b3984e385cb516321f653b2c74b4eb45cd7f", "title": "Improvement of nuclear facilities DNP3 protocol data transmission security using super encryption BRC4 in SCADA systems"}, {"paperId": "173394156bd4716277d8cd23cb29f948b6e05784", "title": "A new SLA-aware method for discovering the cloud services using an improved nature-inspired optimization algorithm"}, {"paperId": "d46abaafcd4854c1196fa9a76f9b12fbfab0a9a8", "title": "A Multi-Perspective Benchmarking Framework for Estimating Usable-Security of Hospital Management System Software Based on Fuzzy Logic, ANP and TOPSIS Methods"}, {"paperId": "eab4d0c7683e269153dd9c2e6c793f954544c838", "title": "Fifty-Six Big Data V’s Characteristics and Proposed Strategies to Overcome Security and Privacy Challenges (BD2)"}, {"paperId": "bca8c306ab411e28e503560c87f240a3e7b612f7", "title": "Hi, May AI help you? An analysis of the barriers impeding the implementation and use of artificial intelligence-enabled virtual assistants in retail"}, {"paperId": "0b30a79fc41c2ad64e49a6172b74f153d4c8fba9", "title": "A Role-Attribute Based Access Control Model for Dynamic Access Control in Hadoop Ecosystem"}, {"paperId": "14229b958015f70f3d09d9ddf64ce508147223f2", "title": "Distinctive Context Sensitive and Hellinger Convolutional Learning for Privacy Preserving of Big Healthcare Data"}, {"paperId": "3d07eb0ae663ede757b10a0c3d0276168d59a9fc", "title": "Malware Analysis in Web Application Security: An Investigation and Suggestion"}, {"paperId": "e8a3fdecafb2ec4ff0d656fc3c2d7ba02b51aebe", "title": "A Hybrid Honey Pot-As-A-Service Model To Secure The Network From Brute Force Attacks"}]}
