{"paperId": "2dae9877d95aaf63c3e8b76e66ef859e8324059e", "publicationVenue": {"id": "98057730-9ff0-4e44-bded-d6bcc56a081f", "name": "EPiC Series in Built Environment", "type": "conference", "alternate_names": ["Epic Ser Built Environ"], "issn": "2632-881X"}, "title": "HVAC Mechanical Contractors Framework for Effective Project Close-Out", "abstract": "Project close-out activities and the transfer of information to the general contractor and owner are critical steps in meeting desired project outcomes and receiving timely final payments. This process, when not planned for, leads to delays and challenges that can harm a project's profitability and overall owner satisfaction. HVAC contractors are one of the major trades on construction job sites responsible for providing important facility operational information. If their close-out processes are not effective, they not only threaten their internal project success but can cause prolonged delays for other project stakeholders. This paper discusses a framework for project close-out for HVAC mechanical contractors. The research developed and analyzed fourteen (14) case studies documenting different companies' close-out processes. This allowed for identifying common challenges and existing workflows to determine how various companies addressed those challenges. The study resulted in a framework, represented as a process model workflow, to help HVAC mechanical contractors improve their internal close-out processes.", "venue": "EPiC Series in Built Environment", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "EPiC Series in Built Environment"}, "authors": [{"authorId": "2274449519", "name": "Jason Lucas"}, {"authorId": "31309794", "name": "Dhaval Gajjar"}, {"authorId": "2005521517", "name": "Marchell Magxaka"}, {"authorId": "2274644517", "name": "Bishesh Bharadwaj"}], "citations": [{"paperId": "f5d1593a33f20231866ccec228165c5a519dbbd6", "title": "Indian management research"}]}
