{"paperId": "2db1c7fb655b670c918b956ddba23531a7fe2a86", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Internet of Things Technology in Ecological Security Assessment System of Intelligent Land", "abstract": "The ecological security of land is related to the sustainable development of human beings. With the continuous progress of science, the evaluation standard of land ecological security is also changing. The traditional safety evaluation method is time-consuming and laborious, with high cost of data acquisition, small amount of data and large error of data itself. The establishment of intelligent land ecological security evaluation system through the Internet of things is conducive to a better understanding of the overall land situation in the region. Taking the land data of Cangzhou City, China as an example, this study uses the Internet of things technology to establish a set of intelligent evaluation and grading model. The random forest algorithm is used to evaluate the land ecological security, and combined with the existing data to predict the land ecological security in 2020–2025. Compared with other security evaluation methods, the intelligent land ecological security evaluation system in this study has the advantages of short operation time, low energy consumption and high accuracy. This method has a strong guiding significance for the future land ecological security management.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-18", "journal": {"name": "IEEE Access", "pages": "99772-99782", "volume": "8"}, "authors": [{"authorId": "1739194176", "name": "Zhaoya Chen"}, {"authorId": "2109787521", "name": "Lijun Ma"}, {"authorId": "2065456309", "name": "F. Guo"}, {"authorId": "2109017251", "name": "Yaheng Chen"}], "citations": [{"paperId": "7f3a0297b48e8256b6ccae7b00e0f28be8349f8b", "title": "Application of Internet of Things technology in smart home system"}]}
