{"paperId": "2dc358b926488fbe23d8d4943116b9729e467ccf", "publicationVenue": null, "title": "How full will my next bus be? A Framework to Predict Bus Crowding Levels", "abstract": "Public transit is one of the first things that come to mind when someone talks about “smart cities.” As a result, many technologies, applications, and infrastructure have been deployed already to bring the promise of the smart city to public transportation. Most of these have focused on answering the question “when will my bus arrive?”; little has been done to answer the question “how full will my next bus be?” which also greatly affects commuters’ quality of life. In this paper, we develop a framework to address the fullness question. We formulate the problem as a classification problem, develop a framework to enable predictions using Random Forests, and evaluate our proposed techniques using data from the Pittsburgh region.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "23551855", "name": "Tahereh Arabghalizi"}, {"authorId": "1716685", "name": "Alexandros Labrinidis"}], "citations": [{"paperId": "512f8813e39b7c008e5c78858da5a1ec90126dbc", "title": "Occupancy Prediction at Transit Stops Using ANN"}, {"paperId": "ca04ed60ead987e6e8cc6c8641276fb935b6e283", "title": "Unified Occupancy on a Public Transport Network Through Combination of AFC and APC Data"}, {"paperId": "3c34f1f0157cab5706e51f2929b59db2521c5e59", "title": "Excess demand in public transportation systems: The case of Pittsburgh's Port Authority"}, {"paperId": "d38b4d25a34a7ae46660613b17448e1505dfb4b6", "title": "A Joint Passenger Flow Inference and Path Recommender System for Deploying New Routes and Stations of Mass Transit Transportation"}, {"paperId": "e6e94ea7a29780221cd8762569cb3e75820a0c83", "title": "Leveraging IoT and Weather Conditions to Estimate the Riders Waiting for the Bus Transit on Campus"}, {"paperId": "1009fa50485cb7a00da6780af4b8e88f6d049dbd", "title": "The Anatomy of the Daily Usage of Bike Sharing Systems: Elevation, Distance and Seasonality"}, {"paperId": "21f1bf47c68c0c90b88850adcfb5a0e68372ad5a", "title": "A Route-Affecting Region Based Approach for Feature Extraction in Transportation Route Planning"}, {"paperId": "fe9e903bc9692351479f1de38e20296ea8347cd1", "title": "Bus Fuel Consumption Problem: An in-depth Analysis and Prediction"}]}
