{"paperId": "2dceb28ed6eda0fe1fc24e00502ab004920a8628", "publicationVenue": {"id": "15d5fe56-5327-496d-ad45-c5a5b49dcfeb", "name": "Diagnostic and Interventional Radiology", "type": "journal", "alternate_names": ["Diagn Interv Radiol"], "issn": "1305-3825", "url": "https://www.dirjournal.org/", "alternate_urls": ["http://www.dirjournal.org/eng/Anasayfa"]}, "title": "Large language models in radiology: fundamentals, applications, ethical considerations, risks, and future directions", "abstract": "With the advent of large language models (LLMs), the artificial intelligence revolution in medicine and radiology is now more tangible than ever. Every day, an increasingly large number of articles are published that utilize LLMs in radiology. To adopt and safely implement this new technology in the field, radiologists should be familiar with its key concepts, understand at least the technical basics, and be aware of the potential risks and ethical considerations that come with it. In this review article, the authors provide an overview of the LLMs that might be relevant to the radiology community and include a brief discussion of their short history, technical basics, ChatGPT, prompt engineering, potential applications in medicine and radiology, advantages, disadvantages and risks, ethical and regulatory considerations, and future directions.", "venue": "Diagnostic and Interventional Radiology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-03", "journal": {"name": "Diagnostic and Interventional Radiology", "pages": "80 - 90", "volume": "30"}, "authors": [{"authorId": "1401160586", "name": "Tugba Akinci D'Antonoli"}, {"authorId": "27697520", "name": "A. Stanzione"}, {"authorId": "2253667766", "name": "Christian Bluethgen"}, {"authorId": "2243435103", "name": "Federica Vernuccio"}, {"authorId": "3900426", "name": "L. Ugga"}, {"authorId": "11008452", "name": "M. Klontzas"}, {"authorId": "2149449960", "name": "Renato Cuocolo"}, {"authorId": "2243437656", "name": "Roberto Cannella"}, {"authorId": "2238864841", "name": "Burak Koçak"}], "citations": [{"paperId": "99066d7f1552f179ec56061fb98625bf6229f942", "title": "The impact of large language models on radiology: a guide for radiologists on the latest innovations in AI."}, {"paperId": "9be02ecf206ad7494bb9531aed9491af203a3c3d", "title": "LLMs-based Few-Shot Disease Predictions using EHR: A Novel Approach Combining Predictive Agent Reasoning and Critical Agent Instruction"}, {"paperId": "047ae5f44c74e2f13a1aa277db53ad53e8fbcd5d", "title": "The Role of Prompt Engineering in Radiology Applications of Generative AI."}, {"paperId": "f4f309c63732cc1986e3ad5ba85d0b8823f38131", "title": "Harnessing ChatGPT dialogues to address claustrophobia in MRI - A radiographers' education perspective."}, {"paperId": "7011b997fc539cad35510a58fefd2b22ba54f89e", "title": "Prompt engineering in consistency and reliability with the evidence-based guideline for LLMs"}, {"paperId": "a2dddfc783e8749334968041533f7757b504a7fa", "title": "AI-Assisted Summarization of Radiological Reports: Evaluating GPT3davinci, BARTcnn, LongT5booksum, LEDbooksum, LEDlegal, and LEDclinical."}, {"paperId": "1edbc7e54be1a1fe7f27d074cda82ae85c6d39dd", "title": "A Radiomic \"Warning-Sign\" of Progression on Brain MRI in Individuals with MS."}, {"paperId": "b9cf9586983fef8d5a0c4a4172973dbb83c4dc89", "title": "Caveat Emptor: Medicolegal Issues May Arise From the Opaque and Unpredictable Nature of Current Large Language Models Used in Diagnostic Imaging."}, {"paperId": "c4ba371adcf730c2728e811b9b9e2dd39502e742", "title": "ChatGPT’s Accuracy on Magnetic Resonance Imaging Basics: Characteristics and Limitations Depending on the Question Type"}, {"paperId": "d248a550f49da269af0db1e9b8e7886b7cd30593", "title": "Can We Use Large Language Models for the Use of Contrast Media in Radiology?"}, {"paperId": "24c86be9dbe4db250310e00506e69f290290cf61", "title": "O structured reporting, where art thou?"}, {"paperId": "594654f9af08fdb79166ea3e6b2b9801c0bee8b1", "title": "and LEDclinical LongT5booksum, LEDbooksum, LEDlegal, BARTcnn, Reports: Evaluating GPT3davinci, AI-Assisted Summarization of Radiologic"}, {"paperId": "4b556154bdb55a27e19db728cb3c2f0569b7e12f", "title": "on Brain MRI in Individuals with MS A Radiomic ''Warning Sign'' of Progression"}]}
