{"paperId": "2dfb2d97abccce933336c51c17194ee65134faa9", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Air Conditioning Systems Fault Detection and Diagnosis-Based Sensing and Data-Driven Approaches", "abstract": "The air conditioning (AC) system is the primary building end-use contributor to the peak demand for energy. The energy consumed by this system has grown as fast as it has in the last few decades, not only in the residential section but also in the industry and transport sectors. Therefore, to combat energy crises, urgent actions on energy efficiency should be taken to support energy security. Consequently, the faults in AC system components increase energy consumption due to the degradation of the system’s performance and the losses in the energy conversion procedure. In this work, AC system fault detection and diagnosis (FDD) methods are investigated to propose analytic tools to identify faults and provide solutions to those problems. The analysis of existing work shows that data-driven approaches are more accurate for both soft and hard fault detection and diagnosis in AC systems. Therefore, the proposed methods are not accurate for simultaneous fault detection, while in some works, authors tested the method with several faults separately without investigating scenarios that combine more than one fault. Moreover, this study shows that integrating data-driven approaches requires deploying an optimal sensing and measurement architecture that can detect a maximum number of faults with minimally deployed sensors. The new sensing, information, and communication technologies are discussed for their integration in AC system monitoring in order to optimize system operation and detect faults.", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-15", "journal": {"name": "Energies"}, "authors": [{"authorId": "35637260", "name": "A. Elmouatamid"}, {"authorId": "2145595256", "name": "Brian Fricke"}, {"authorId": "95879618", "name": "Jian Sun"}, {"authorId": "144621000", "name": "P. Pong"}], "citations": [{"paperId": "d65e0ea76926681a4fe501f547145b00c70cb9d7", "title": "Machine learning-based fault diagnosis for three-phase induction motors in ventilation systems"}]}
