{"paperId": "2e0fc3cca0aee5444282a2f6e4835548c191e18e", "publicationVenue": {"id": "b5ced295-d2ad-416c-b926-1e428c6d5ec3", "name": "International Conference on Communications, Computing, Cybersecurity, and Informatics", "type": "conference", "alternate_names": ["CCCI", "Int Conf Commun Comput Cybersecur Informatics"]}, "title": "Virtual Machine Performance Analysis and Prediction", "abstract": "Virtualization technology promotes the development of cloud computing technology, and cloud service providers provide many virtual machines with different configurations. It is becoming more and more important to analyze the performance of virtual machines based on the characteristics of the workload. This paper analyzes the performance of memory-intensive, compute-intensive and I/O intensive workloads running in virtual machines with different sizes. In order to avoid excessive overhead when comparing the performance of virtual machines, this paper proposes a performance prediction method for virtual machines based on the results of micro-benchmarks. Finally, this paper proposes the concept of virtual machine consistency. If a workload has the same performance in two virtual machines, we call the performance of the two virtual machines consistent with respect to this workload.", "venue": "International Conference on Communications, Computing, Cybersecurity, and Informatics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-03", "journal": {"name": "2020 International Conference on Communications, Computing, Cybersecurity, and Informatics (CCCI)", "pages": "1-5"}, "authors": [{"authorId": "2155293921", "name": "Yuegang Li"}, {"authorId": "10164920", "name": "Dongyang Ou"}, {"authorId": "36847969", "name": "Congfeng Jiang"}, {"authorId": "2109659935", "name": "Jing Shen"}, {"authorId": "1699183550", "name": "Shuangshuang Guo"}, {"authorId": "2045454945", "name": "Yin Liu"}, {"authorId": "2026994173", "name": "Linlin Tang"}], "citations": [{"paperId": "30ce7babe8e41465fbf742ea0aa191cb8da4735c", "title": "A Review Study on Energy Consumption in Cloud Computing"}, {"paperId": "f35811ba8a575ee6350e01d327c3aeeb2cf19ad0", "title": "Proactive Random-Forest Autoscaler for Microservice Resource Allocation"}]}
