{"paperId": "2e14ebe9cfc3771bfdd28a7d481b4688e957efae", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "Comparing Convolutional Neural Network and Machine Learning Models in Landslide Susceptibility Mapping: A Case Study in Wenchuan County", "abstract": "Landslides are one of the most widespread disasters and threaten people’s lives and properties in many areas worldwide. Landslide susceptibility mapping (LSM) plays a crucial role in the evaluation and extenuation of risk. To date, a large number of machine learning approaches have been applied to LSM. Of late, a high-level convolutional neural network (CNN) has been applied with the intention of raising the forecast precision of LSM. The primary contribution of the research was to present a model which was based on the CNN for LSM and methodically compare its capability with the traditional machine learning approaches, namely, support vector machine (SVM), logistic regression (LR), and random forest (RF). Subsequently, we used this model in the Wenchuan region, where a catastrophic earthquake happened on 12 May 2008 in China. There were 405 valuable landslides in the landslide inventory, which were divided into a training set (283 landslides) and validation set (122 landslides). Furthermore, 11 landslide causative factors were selected as the model’s input, and each model’s output was reclassified into five intervals according to the sensitivity. We also evaluated the model’s performance by the receiver operating characteristic (ROC) curve and several statistical metrics, such as precision, recall, F1-score, and other measures. The results indicated that the CNN-based methods achieved the best performance, with the success-rate curve (SRC) and prediction-rate curve (PRC) approaches reaching 93.14% and 91.81%, respectively. The current research indicated that the approach based on the CNN for LSM had both outstanding goodness-of-fit and excellent prediction capability. Generally, the LSM in our research is capable of advancing the ability to assess landslide susceptibility.", "venue": "Frontiers in Environmental Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-16", "journal": {"volume": "10"}, "authors": [{"authorId": "2165376947", "name": "Sikui Zhang"}, {"authorId": "30666656", "name": "L. Bai"}, {"authorId": "2144419972", "name": "Yuanwei Li"}, {"authorId": "2108746718", "name": "Wei-le Li"}, {"authorId": "144281474", "name": "Mingli Xie"}], "citations": [{"paperId": "37739c4feb1e515f3856865741c2bc51949b72cf", "title": "Landslide spatial prediction using cluster analysis"}, {"paperId": "4b0d097401b4297fb12770df4394efd6c2a23d78", "title": "Exploring machine learning and statistical approach techniques for landslide susceptibility mapping in Siwalik Himalayan Region using geospatial technology."}, {"paperId": "ace19b822978c7d90a266a0032aa95a8a0d436a6", "title": "Deep Learning for Earthquake Disaster Assessment: Objects, Data, Models, Stages, Challenges, and Opportunities"}, {"paperId": "d8250efbd0621a3aac30e232a0fc28521f6b3aac", "title": "Enhancing a convolutional neural network model for land subsidence susceptibility mapping using hybrid meta-heuristic algorithms"}, {"paperId": "a00900540c35a539941ad55b9f7c4c18e72c53b0", "title": "GIS-based modeling of landslide susceptibility zonation by integrating the frequency ratio and objective–subjective weighting approach: a case study in a tropical monsoon climate region"}, {"paperId": "3b8d0f2b719c861511e391bc7da98b46d891a958", "title": "A Multi-Criteria Decision Analysis (MCDA) Approach for Landslide Susceptibility Mapping of a Part of Darjeeling District in North-East Himalaya, India"}, {"paperId": "ac0717206038e4ca6c2861c24dde3cce16653190", "title": "Prediction of corrosion failure probability of buried oil and gas pipeline based on an RBF neural network"}, {"paperId": "5abab9bd381e30f9b9b514ed1c1f243b8ae4e9de", "title": "Influencing Physical Characteristics of Landslides in Kuala Lumpur, Malaysia"}, {"paperId": "bf4f1b2e296bc9dbd3b7a5e8ec983e61f6ac92d6", "title": "Landslide susceptibility mapping using O-CURE and PAM clustering algorithms"}, {"paperId": "83a43d5f539eb4faf4d4782be59f29101bfa340b", "title": "CNN-Based Model for Landslide Susceptibility Assessment from Multispectral Data"}, {"paperId": "21a116ddae1c25190f28b4688acc7bf0cfe4de08", "title": "A Deep Neural Network Framework for Landslide Susceptibility Mapping by Considering Time-Series Rainfall"}, {"paperId": "6b6c388fa557fa70e6fd7feac0239dfa57c6caac", "title": "Landslide Risk Evaluation in Shenzhen Based on Stacking Ensemble Learning and InSAR"}]}
