{"paperId": "2e1d98c9101f567c9befbc5c501fdaf29a25030f", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "New Plain-Text Authentication Secure Scheme for Implantable Medical Devices with Remote Control", "abstract": "Implantable medical devices are being increasingly used to treat or monitor different medical conditions. For such purposes, wireless is the most desired communication scheme to be implemented in these devices. On the other hand, the wireless scheme increases security threats on these electronic devices, and any possibility of attack on the medical device may have lethal consequences. The patients usually have their implantable medical devices configured and monitored by their doctors. But for practical purposes, most of the time they possess a remote control for daily non-critical operations. This remote control can be considered as an open gate for attackers to target those medical devices and cause major harm. Motivated by this, we analyze in this paper the communication scheme implemented in the wireless devices, having as a starting point an Implantable Insulin Pump to develop a new protocol that can be used in the remote control-implantable device communication, and that will rely on plain text messages to avoid encryption implementation. Finally, we will analyze how the novelties introduced with this protocol can secure such a wireless link.", "venue": "Global Communications Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "GLOBECOM 2017 - 2017 IEEE Global Communications Conference", "pages": "1-5"}, "authors": [{"authorId": "1411834674", "name": "Taha Belkhouja"}, {"authorId": "144335971", "name": "Xiaojiang Du"}, {"authorId": "143634114", "name": "Amr M. Mohamed"}, {"authorId": "1403346505", "name": "A. Al-Ali"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "8f6c8df6f29b65327828d7a76d9ba341b9edb6df", "title": "Energy-Aware Lightweight PLKG in IMDs: A Deep Dive into the Effects of Channel Fading Models"}, {"paperId": "644abb084844ea5594a74ef3a629263aa5f8b902", "title": "Triboelectric nanogenerators for clinical diagnosis and therapy: A report of recent progress"}, {"paperId": "e2cad8390509d64eba3387a18cde547b269aad45", "title": "Sensors for Context-Aware Smart Healthcare: A Security Perspective"}, {"paperId": "d165d04e418f0263852f0f16db025592363721df", "title": "Sequential Encryption for Multiple Implantable Medical Devices"}, {"paperId": "1190091c760922159a4257f4c4d208b1092a423f", "title": "Security in IoMT Communications: A Survey"}, {"paperId": "50367e67d1927fe7504d1ea6edd75aaafc2704e1", "title": "In-Band Secret-Free Pairing for COTS Wireless Devices"}, {"paperId": "edd19fd6e89930796b5abe860818f4f040912a15", "title": "Role-Based Hierarchical Medical Data Encryption for Implantable Medical Devices"}, {"paperId": "34d535160050be57b6fb5af88d519a13a1e6d020", "title": "Biometric-based authentication scheme for Implantable Medical Devices during emergency situations"}, {"paperId": "0dfad4813a3fbd4f1103af75728185664f18d8d9", "title": "Security Vulnerabilities, Attacks, Countermeasures, and Regulations of Networked Medical Devices—A Review"}, {"paperId": "720b335207fa6819fc2f618bf127622308fa5e73", "title": "Correlation for efficient anomaly detection in medical environment"}, {"paperId": "6077b4945ff2a72ef614d8ad2ba054b3578ceac1", "title": "Medical Internet of Things: A Survey of the Current Threat and Vulnerability Landscape"}]}
