{"paperId": "2e23082e21144024ddbaae48266f347414fe3af0", "publicationVenue": {"id": "3513ce18-3757-4358-b15f-7060af98e6d0", "name": "Frontiers in Neurology", "type": "journal", "alternate_names": ["Front Neurol"], "issn": "1664-2295", "url": "https://www.frontiersin.org/journals/neurology", "alternate_urls": ["http://www.frontiersin.org/neurology/about", "http://frontiersin.org/neurology"]}, "title": "Deep Learning for the Assisted Diagnosis of Movement Disorders, Including Isolated Dystonia", "abstract": "Functional movement disorder (FMD) is a disorder that is altered by distraction or non-physiological maneuvers (this includes excessive placebo response); this disorder is clinically different from movement disorders known to be caused by neurological disease (1). Dystonia is a movement disorder classified by involuntary patterned or twisting body movements, which further results in atypical postures (2). Isolated dystonia is a rare neurological disorder where the patient has dystonia without other neurological disorders like Alzheimer’s. Dystonia often harms the quality of life and can be markedly disabling (3); furthermore, a relatively high number of cases are misdiagnosed or underdiagnosed because of the non-availability of a global biomarker. In a recent research paper by Valeriani and Simonyan (4), a deep learning-based method was proposed, i.e., DystoniaNet, which can recognize a microstructural neural network biomarker for the diagnosis of dystonia from raw MRIs. The biomarker-based on DystoniaNet depicted an overall accuracy of 98.8%, including 3.5% cases in which the network referred the case for further analysis with a diagnosis time of 0.36 s per subject; this was a significant improvement over shallow machine learning networks. The assisted diagnosis of isolated dystonia using deep learning has opened a new direction where computational intelligence plays its part in the early diagnosis of movement disorders.", "venue": "Frontiers in Neurology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-30", "journal": {"name": "Frontiers in Neurology", "volume": "12"}, "authors": [{"authorId": "1945070", "name": "S. M. A. Bashir"}, {"authorId": "2154461379", "name": "Yi Wang"}], "citations": [{"paperId": "9bbecd62030c40a70591ae00e426b824122e6100", "title": "Advancements and Challenges in AI Applications for Movement Disorders"}, {"paperId": "01907b790af90337b6806ce2095c4f9a6492412a", "title": "Enhancing Image Quality through Deep Learning-based Super-Resolution Techniques"}, {"paperId": "fd246d7cac7bb80745de73818be80d702f0db0dc", "title": "Small Object Detection Based on Deep Learning for Remote Sensing: A Comprehensive Review"}, {"paperId": "9a8a9ad23ceaf0d03130d205a36940cc1b7d6fbf", "title": "High-resolution aeromagnetic map through Adapted-SRGAN: A case study in Québec, Canada"}, {"paperId": "1bd8b71f3d79dad694356134b2d39a6de3cd289b", "title": "Remote Sensing Image Super-resolution and Object Detection: Benchmark and State of the Art"}, {"paperId": "b761927f74e5d62566f4ed283eda3b03eba2e15f", "title": "A comprehensive review of deep learning-based single image super-resolution"}, {"paperId": "325f78b2c4937a37e24bc7e1008854b9d6ed55ea", "title": "Characterizing X-Linked Dystonia Parkinsonism Using Clustering Techniques in Data Science"}]}
