{"paperId": "2e28197b244f28573d3abbb671c53eb98b3c91e1", "publicationVenue": null, "title": "Enhancing the Scalability and Performance of Iterative Graph Algorithms on Apache Storm", "abstract": "Real-time processing of large-scale, time-varying graphs is becoming essential in bigdata streaming applications that require high-throughput and low-latency. Streaming applications typically perform graph computations on periodic snapshots of the graph, using windowing. For large-scale graphs, that contains millions of edges, distributed parallel processing is essential to meet the throughput and latency needs of streaming applications. Apache Storm, a widely used stream processing system, provides a topology-based processing architecture which supports distribution and pipelining to meet the latency and throughput needs; a typical Storm topology contains a fixed number of stages, each stage with a single operator supporting a single computation step, which can be parallelized through horizontal scaling (bolt instances). One of the limitations of such a topology, is the fixed number of stages, which makes it not suitable for graph algorithms that require iterative computations, such as the PageRank algorithm, because the number of iterations, hence the number of stages in the topology, is unknown a-priori. In this paper we explore how iterative graph algorithms can be executed efficiently in a distributed manner for scalability (with the graph distributed across a set of Storm bolts), using a single stage of a Storm topology, using Storm’s cyclic communication (S-CC) mechanism. We show that S-CC approach outperforms alternative approaches that can be used for parallel-iterative computations in Storm, such as off-loading to a third-party graph processing system such as Giraph or using a distributed memory architecture, both in terms of scalability and performance.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "3863-3872"}, "authors": [{"authorId": "35741782", "name": "Sachini Jayasekara"}, {"authorId": "2476111", "name": "S. Karunasekera"}, {"authorId": "145098019", "name": "A. Harwood"}], "citations": [{"paperId": "f90a4b77320336ae1d261cbf73cc32a6d3831ffa", "title": "Stream Genetic Programming for Botnet Detection"}, {"paperId": "8ccce87e202b0d9a575eb620dbe73500e6d273ba", "title": "A Utilization Model for Optimization of Checkpoint Intervals in Distributed Stream Processing Systems"}]}
