{"paperId": "2e29bac460d018b95ffd274b558c3545e4b156c0", "publicationVenue": null, "title": "Landslide risk zoning in Ruijin , Jiangxi , China 1", "abstract": "Landslides are one of the major geohazards threatening human society. This study was 13 aimed at conducting such a hazard risk prediction and zoning based on an efficient machine 14 learning approach, Random Forest (RF), for Ruijin, Jiangxi, China. Multiple geospatial and 15 geo-environmental data such as land cover, NDVI, landform, rainfall, stratigraphic lithology, 16 proximity to faults, to roads and to rivers, depth of the weathered crust, etc., were utilized in this 17 research. After pre-processing, including digitization, linear feature buffering and value assignment, 18 19 hazard-causative factors were eventually produced and converted into raster to constitute a 19 19-band geo-environmental dataset. 155 observed landslides that had truly taken places in the past 20 10 years were utilized to establish a vector layer. 70% of the disaster sites (points) were randomly 21 selected to compose a training set (TS) and the remained 30% to form a validation set (VS). A 22 number of non-risk samples were identified in low slope (< 1-3°) areas and also added to the TS and 23 VS in the similar percentage. Then, RF-based classification algorithm was employed to model the 24 probability of landslide occurrence using the above 19-band dataset as predictive variables and TS 25 for training. After performance evaluation, the RF-based model was applied back to the integrated 26 dataset to calculate the probability of the hazard occurrence in the whole study area. The predicted 27 map was evaluated versus both TS and VS and found of high reliability in which the Overall 28 Accuracy (OA) and Kappa Coefficient (KC) are 91.49% and 0.8299 respectively. In terms of the 29 risk probability, the predicted map was further zoned into different risk grades to constitute 30 landslide risk map. Modeling results also revealed the order of importance of the 19 causative 31 factors, and the most important ones are the proximity to roads, slope, May-July rainfall, NDVI and 32 elevation. We hence conclude that the RF algorithm is able to achieve the risk prediction with high 33 accuracy and reliability, and this study may provide an operational methodology for geohazard risk 34 mapping and assessment. The results of this study can serve as reference for the local authorities in 35 prevention and early warning of landslide hazard. 36", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2143908124", "name": "Xiaoting Zhou"}, {"authorId": "2000246087", "name": "Weicheng Wu"}, {"authorId": "49290499", "name": "Ziyu Lin"}, {"authorId": "32664098", "name": "Guiliang Zhang"}, {"authorId": "8707195", "name": "Renxiang Chen"}, {"authorId": "2115414739", "name": "Yong Song"}, {"authorId": "2078142219", "name": "2. Zhiling"}, {"authorId": "1417216346", "name": "Wang"}, {"authorId": "47534858", "name": "Tao Lang"}, {"authorId": "117911527", "name": "Yaozu Qin"}, {"authorId": "2004513603", "name": "Penghui Ou"}, {"authorId": "2004518895", "name": "Wenchao Huangfu"}, {"authorId": "2145954190", "name": "Yangchengsi Zhang"}, {"authorId": "2004274596", "name": "Lifeng Xie"}, {"authorId": "2078136771", "name": "3. Xiaolan"}, {"authorId": "91730660", "name": "Huang"}, {"authorId": "48524384", "name": "Xiaohong Fu"}, {"authorId": "2155868796", "name": "Jie Li"}, {"authorId": "2218916596", "name": "Jingheng Jiang"}, {"authorId": "2155080810", "name": "Ming Zhang"}, {"authorId": "2000164154", "name": "Yixuan Liu"}, {"authorId": "2004217711", "name": "Shanling Peng"}, {"authorId": "108478196", "name": "C. Shao"}, {"authorId": "2144125346", "name": "Yonghui Bai"}, {"authorId": "2108166904", "name": "Xiao-feng Zhang"}, {"authorId": "1390612103", "name": "Xiangtong Liu"}, {"authorId": "2019426140", "name": "Wenheng Liu"}], "citations": []}
