{"paperId": "2e2fb9d765f3d2c21eac7a6e698ab09ae0d9dba5", "publicationVenue": {"id": "51cd5247-2125-402a-a3c9-83545cc7c792", "name": "Biologia", "type": "journal", "issn": "0006-3096", "url": "http://biosoc.pk/biologia"}, "title": "Infestation and distribution of gamasid mites on Himalayan field rat (Rattus nitidus) in Yunnan Province of Southwest China", "abstract": "Besides being an important pest in agriculture and forestry, the Himalayan field rat (Rattus nitidus) can be the reservoir host of many zoonoses. Some ectoparasitic gamasid mites on rodents (rats, mice and voles, etc.) are associated with some zoonoses. A field investigation was made in 39 counties in Yunnan Province of southwestern China between 1990 and 2015, and a total of 928 R. nitidus were collected. Based on some strategies of “data mining”, the present paper analyzed the infestation and distribution of gamasid mites on the body surface of R. nitidus in Yunnan for the first time. There were 19,585 individuals of gamasid mites collected, and 18.971 of them were identified as 54 species and 19 genera under seven families. The results indicated that R. nitidus has a high potential to harbor abundant gamasid mites of diverse species. The two dominant mite species, Laelaps nuttalli and Laelaps echidninus, had an aggregated distribution among different individuals of R. nitidus. The identified 54 species of gamasid mites showed a high species diversity on a single rat species (R. nitidus), and the diversity index at the family level was higher than that at the genus level. The infestation of R. nitidus with gamasid mites in the different habitats and altitude gradients was uneven and heterogenic, which reflects the infestation bias in different environments. Most gamasid mites tended to infest male and adult rats rather than female and juvenile ones, which reflects the infestation bias on different sexes and ages. Based on Chao1’s formula, the total number of gamasid mite species on R. nitidus was estimated to be 66.", "venue": "Biologia", "year": 2021, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2021-01-22", "journal": {"name": "Biologia", "pages": "1763 - 1773", "volume": "76"}, "authors": [{"authorId": "2090526125", "name": "Rong Xiang"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "93382566", "name": "K. Mao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "2107910872", "name": "Xiao-Bin Huang"}], "citations": [{"paperId": "e9fc0ffd20f9911d5c79e4d1a00a13b43acb7fcd", "title": "Preliminary Study on Species Diversity and Community Characteristics of Gamasid Mites on Small Mammals in Three Parallel Rivers Area of China"}, {"paperId": "0410c0a03857c79ac7c16a75a93b479c969b87ab", "title": "Analysis on infestation and related ecology of chigger mites on large Chinese voles (Eothenomys miletus) in five provincial regions of Southwest China"}, {"paperId": "47878e45b0c4c193f2de725898a48dfb6af572c6", "title": "Infestation of chigger mites on Chinese mole shrew, Anourosorex squamipes, in Southwest China and ecological analysis"}, {"paperId": "0cca57666e494ed082c2746a0b8ef52bb4e5762c", "title": "Infestation and distribution of chigger mites on Chevrieri's field mouse (Apodemus chevrieri) in Southwest China"}, {"paperId": "c04df430fb9df3dbdacba275ac6130b75e1a7e12", "title": "Infestation and Seasonal Fluctuation of Gamasid Mites (Parasitiformes: Gamasida) on Indochinese Forest Rat, Rattus andamanensis (Rodentia: Muridae) in Southern Yunnan of China"}, {"paperId": "c890b9543cc35c53daa4194bb9b4198a4dbecbd2", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}, {"paperId": "59536b2dbd986e7cdf5a5d02142f0ded332efafd", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}]}
