{"paperId": "2e6125ee49044ef9e0592bedb74b87985c2f32a4", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "An efficient approach for detecting anomalous events in real‐time weather datasets", "abstract": "Event detection in real‐time is applied in diverse domains such as detection of fraudulent activities in commercial transactions, detection of faulty systems in industries, and so forth. Businesses and organizations benefit from the actionable information obtained through various techniques available for anomalous event detection. Real‐time event detection is nowadays handled through streaming data frameworks. Traditional approaches effectively handle event detection in real‐time but with more false positives, thus, resulting in false alarms. In this article, an efficient approach comprising two components, an offline model and an online event detection pipeline, is proposed to achieve minimum mean absolute error (MAE). An offline module is developed to investigate a variety of deep learning models that prove suitable for event detection in real‐time. The experiments conducted with PubNub sensors datasets demonstrate that the long short‐term memory unit of recurrent neural networks is the best suitable model for anomalous event detection. The online pipeline module is built using streaming data frameworks to predict the abnormal peaks. It is revealed through the experimental results that the proposed approach efficiently detects anomalous events in real‐time and also eliminates false positives.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-09", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "48550260", "name": "Shruti Arora"}, {"authorId": "145555536", "name": "Rinkle Rani"}, {"authorId": "2061541563", "name": "Nitin Saxena"}], "citations": [{"paperId": "452c51e79d38e9db0c671527b401d3424128e0c5", "title": "Open‐domain event schema induction via weighted attentive hypergraph neural network"}, {"paperId": "f599e27a43e019f4b0afecf7a97bbd05ed302938", "title": "Cleaning Big Data Streams: A Systematic Literature Review"}, {"paperId": "ef62a5840f52ea1fd4fe6e3821581f14b2ee8802", "title": "An adaptive medical image registration using hybridization of teaching learning-based optimization with affine and speeded up robust features with projective transformation"}, {"paperId": "ec2d68657d0855191643971c59bdaba6b0a10718", "title": "Comparative Analysis of Machine Learning and Ensemble Learning Classifiers for Parkinson’s Disease Detection"}, {"paperId": "94d31a372219a4c40805ab82066729f782cfe48c", "title": "Music Stream Analysis for the Prediction of Song Popularity using Machine Learning and Deep Learning Approach"}]}
