{"paperId": "2e67a8b0eecf94daa37eac60793e3d667f641059", "publicationVenue": null, "title": "Towards development of spark based agricultural information system including geo-spatial data", "abstract": "Voluminous and variety of disparate information is generated and consumed in agriculture domain at a higher velocity. In agriculture, information is available in the form of weather and soil conditions reports, GPS mapping, water resources, fertilizer/ pesticide use, field characteristics, and commodity market conditions. Big data technology has a huge potential to refer these information and produce comprehensive insight via Geo-spatial processing, remote sensing, advance analytics algorithms, cloud resources, and advance storage systems. The paper, proposes a spark based information management system for agriculture and intend to reduce the technological gap between agro users and information. The system is proposed to collect, query, analyze, and visualize heterogeneous and distributed data including Geo-spatial data at scale using open source. The implementation is done on big data open source architectures by developing various web based analytical and visualization services for cotton crop in Gujarat state, India. The analytical results are explored through interactive maps and Restful ad-hoc APIs.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "3476-3481"}, "authors": [{"authorId": "2105650349", "name": "Purnima Shah"}, {"authorId": "103787278", "name": "Deepa Hiremath"}, {"authorId": "143800564", "name": "S. Chaudhary"}], "citations": [{"paperId": "1ce6ec43a6cb26e4287b1ced3a20e85170b7870f", "title": "Gradient Boosting and Naive Bayes Crop Yield Prediction and Fertilizer Recommendation"}, {"paperId": "46b8cf3cfc9751d9a925300b576cd637f4f3f177", "title": "Price Prediction Model of fruits, Vegetables and Pulses according to Weather"}, {"paperId": "390fa5d6234efe15f17af8510d03225fa48d8583", "title": "Big Data Knowledge Acquisition Platform for Smart Farming"}, {"paperId": "4b4484b9b779e161db32dfb509023b406586958b", "title": "Crop Yield Prediction based on Indian Agriculture using Machine Learning"}, {"paperId": "3f350e8a11776aa1cfc8cdb294f180c9e194299f", "title": "A Survey on Data-driven Performance Tuning for Big Data Analytics Platforms"}, {"paperId": "e304fce537a214684cc27a9a3439703debc0d568", "title": "A Brief Review of Big Data in the Agriculture Domain"}, {"paperId": "284aa2c20c665eb2cf2c42aeb688ea9372f3ac6f", "title": "An ICT Platform Design for Traceability and Big Data Analytics of Sugarcane Harvesting Operation"}, {"paperId": "66ae4e2f03cefab369f4fc94ae08edfeee0f35a9", "title": "A Prediction System for Farmers to Enhance the Agriculture Yield using Cognitive Data Science"}, {"paperId": "038aa4ba1d163c524564c7c9d8903d5d7a49d43b", "title": "Climatic Analysis for Agriculture Cultivation in Geography Using Big Data Analytics"}, {"paperId": "20f5c719c9ae2a9e2ad506477677b21aec342061", "title": "WB-CPI: Weather Based Crop Prediction in India Using Big Data Analytics"}, {"paperId": "7fc0886d84acb06a2b2da4fb4fa0e06a009a1fc0", "title": "Technologies and Innovation: 5th International Conference, CITI 2019, Guayaquil, Ecuador, December 2–5, 2019, Proceedings"}, {"paperId": "444e09b886c1f393b538672950554bc3ce72b646", "title": "Developing Big Data Analytics Architecture for Spatial Data"}, {"paperId": "0247f396fa1ad4382e0a65689679a5550c1b3eb3", "title": "WCP: Weather-Based Crop Yield Prediction Using Machine Learning and Big Data Analytics"}]}
