{"paperId": "2e887515378331bb047d2fae709a94b7f63c6998", "publicationVenue": {"id": "e242f21a-e828-43e0-b1e6-7e01746148c3", "name": "Journal of Soft Computing Exploration", "type": "journal", "alternate_names": ["J Soft Comput Explor"], "issn": "2746-7686", "alternate_issns": ["2746-0991"]}, "title": "SVM Optimization with Correlation Feature Selection Based Binary Particle Swarm Optimization for Diagnosis of Chronic Kidney Disease", "abstract": "Data mining has been widely used to diagnose diseases from medical data. In this study using chronic kidney disease dataset taken from UCI Machine Learning. The dataset has 25 attributes with 400 samples. With 25 attributes that allow redundant data. Redundant data in datasets can reduce computational efficiency and classification accuracy. To increase accuracy of classification algorithm can be done by reducing dimensions of dataset. Correlation-based Feature Selection (CFS) can quickly identify and filter redundant attributes. However, CFS has disadvantage that selected attribute is not necessarily the best attribute. These weaknesses can be overcome by Binary Particle Swarm Optimization (BPSO). BPSO chooses attributes based on the best fitness value. The purpose of this study is to improve accuracy of Support Vector Machine (SVM) by implementing combination of CFS and BPSO as feature selection. Accuracy of SVM in predicting CKD is 63.75%. Whereas, accuracy of SVM by applying CFS as feature selection is 88.75% and average accuracy of ten execution SVM algorithms by applying a combination of CFS and BPSO as feature selection is 95%. Thus, combination of CFS and BPSO as feature selection on the SVM algorithm can improve results of accuracy in diagnosing CKD by 31.25%.", "venue": "Journal of Soft Computing Exploration", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-09", "journal": {"name": "Journal of Soft Computing Exploration"}, "authors": [{"authorId": "2081585366", "name": "D. Aprilianto"}], "citations": [{"paperId": "6f4faf6b15dad1698956e3383a643389cbbcd6e2", "title": "Optimizing Kidney Stone Prediction through Urinary Analysis with Improved Binary Particle Swarm Optimization and eXtreme Gradient Boosting"}, {"paperId": "dc08ab06504afae84324494e729a7fca8f0b86bb", "title": "Data-Driven Early Diagnosis of Chronic Kidney Disease: Development and Evaluation of an Explainable AI Model"}, {"paperId": "98b30c63298321576fa9da109c943b83a8ea4684", "title": "Three stages algorithm for finding optimal solution of balanced triangular fuzzy transportation problems"}, {"paperId": "16254671b4d5996840864b09183836f85d00cab9", "title": "A combination of TDM and KSAM to determine initial feasible solution of transportation problems"}, {"paperId": "580f98fea2dc4e2e8be29d3b631449ea9a97a221", "title": "Irrigation management of agricultural reservoir with correlation feature selection based binary particle swarm optimization"}, {"paperId": "6336050ea176197da5409edd0d99300ef6260b43", "title": "Recommendation of Yogyakarta tourism based on simple additive weighting under fuzziness"}]}
