{"paperId": "2eadc212d63011423b2dea50c865d271e612db89", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Thermal-Aware and DVFS-Enabled Big Data Task Scheduling for Data Centers", "abstract": "Big data has received considerable attentions in recent years because of massive data volumes in multifarious fields. Considering various “V” features, big data tasks are usually highly complex and computational intensive. These tasks are generally performed in parallel in data centers resulting in massive energy consumption and Green House Gases emissions. Therefore, efficient resource allocation considering the synergy of the performance and energy efficiency is one of the crucial challenges today. In this paper, we aim to achieve maximum energy efficiency by combining thermal-aware and dynamic voltage and frequency scaling (DVFS) techniques. This paper proposes: (a) a thermal-aware and power-aware hybrid energy consumption model synchronously considering the computing, cooling, and migration energy consumption; (b) a tensor-based task allocation and frequency assignment model for representing the relationship among different tasks, nodes, time slots, and frequencies; and (c) a big data Task Scheduling algorithm based on Thermal-aware and DVFS-enabled techniques (TSTD) to minimize the total energy consumption of data centers. The experimental results demonstrate that the proposed TSTD algorithm significantly outperforms the state-of-the-art energy efficient algorithms from total, computing, and cooling energy consumption perspectives, as well as cooling energy consumption proportion and total energy consumption savings.", "venue": "IEEE Transactions on Big Data", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "177-190", "volume": "4"}, "authors": [{"authorId": "8424882", "name": "Huazhong Liu"}, {"authorId": "2116440787", "name": "Baoshun Liu"}, {"authorId": "1690341", "name": "L. Yang"}, {"authorId": "145239453", "name": "Man Lin"}, {"authorId": "35143368", "name": "Yuhui Deng"}, {"authorId": "3158019", "name": "Kashif Bilal"}, {"authorId": "1740261", "name": "S. Khan"}], "citations": [{"paperId": "91cb6d5817edb02d49bba0ac68c316318a65f88f", "title": "EneX: An Energy-Aware Execution Scheduler for Serverless Computing"}, {"paperId": "8cf13f374f74cc9dd7187ade52bf0a0041bdd9ff", "title": "Temperature prediction and scheduling of data center based on segmented neural network"}, {"paperId": "73f2a38e9e46223b3f4036b7b1fd119682346c30", "title": "Tensor-Train-based Lightweight Encryption in Federated Cloud Environments"}, {"paperId": "8885376d508e612993a29c4b9d84fb153eaabb7f", "title": "Spatio-temporal load migration potential of data centers: Evaluation and application"}, {"paperId": "ebc5f52884c3fda404c8561effe7165267165bd2", "title": "Multi-Relational Data Characterization by Tensors: Tensor Inversion"}, {"paperId": "3ecaafa9d26d6505f7ffc64dd31bb12c76d190fb", "title": "Renewable energy management in smart grids by using big data analytics and machine learning"}, {"paperId": "63cf546a1037bba91a161f42aa3ce75fe1e13c4b", "title": "A Shapley value-based thermal-efficient workload distribution in heterogeneous data centers"}, {"paperId": "f4bc1416989c252786da90765108c4507f7063ab", "title": "Heating Homes with Servers: Workload Scheduling for Heat Reuse in Distributed Data Centers"}, {"paperId": "fc774987e4d3b471a0c38844b7ee345c066d3b03", "title": "Tensor-Based Recurrent Neural Network and Multi-Modal Prediction With Its Applications in Traffic Network Management"}, {"paperId": "24dd95eec4eca0ba25b5dba4050e255ba7adfaaa", "title": "Thermal-aware adaptive VM allocation considering server locations in heterogeneous data centers"}, {"paperId": "56ae400d3e30a72ce08a65e10ef783f110c956eb", "title": "A global-energy-aware virtual machine placement strategy for cloud data centers"}, {"paperId": "39b386fddfc2405dc106609aba95bf332c3baf1d", "title": "A Survey of Thermal Management in Cloud Data Centre: Techniques and Open Issues"}, {"paperId": "72b6b07d5a0e4e24c9d08cd861f1cfee7e99e87b", "title": "A Two-stage Strategy to Optimize Energy Consumption for Latency-critical Workload under QoS Constraint"}, {"paperId": "6ff3c0c3ca48c1acfae8a28fc18455205d7a70d5", "title": "Threshold temperature scaling: Heuristic to address temperature and power issues in MPSoCs"}, {"paperId": "c232881a3da0a37ba1c3da9b093169aa5298b620", "title": "Power and Temperature-Aware Workflow Scheduling Considering Deadline Constraint in Cloud"}, {"paperId": "432bd28c0dc03277fdf9cfb544babf4699176d1e", "title": "DV-DVFS: merging data variety and DVFS technique to manage the energy consumption of big data processing"}, {"paperId": "0bbc9832626eff5291e9c680b69b64da442ab97a", "title": "Scalable Tensor-Train-Based Tensor Computations for Cyber–Physical–Social Big Data"}, {"paperId": "8464d494b078dc1016dfb6c90926c36a4b0ff04a", "title": "Profit-Sensitive Spatial Scheduling of Multi-Application Tasks in Distributed Green Clouds"}, {"paperId": "d8beb9abb3d1f5a938ca47788ec0d2b5818f990e", "title": "Multi-Dimensional Correlative Recommendation and Adaptive Clustering via Incremental Tensor Decomposition for Sustainable Smart Education"}, {"paperId": "c191fac58328eb4efdfacecf3756506c00ab554e", "title": "iThermoFog: IoT‐Fog based automatic thermal profile creation for cloud data centers using artificial intelligence techniques"}, {"paperId": "2dd26d9a99d37b29f5925d7fd707083a21dd8eca", "title": "ThermoSim: Deep Learning based Framework for Modeling and Simulation of Thermal-aware Resource Management for Cloud Computing Environments"}, {"paperId": "3007e893f15414124f1bf5e277075666ad40da93", "title": "Optimized Renewable Energy Use in Green Cloud Data Centers"}, {"paperId": "a3712e0316bb50f611e363d08e5d98907ef615a9", "title": "A Tensor Computation and Optimization Model for Cyber-Physical-Social Big Data"}, {"paperId": "207f08e73896d301c810617d316d96176b4d4e2c", "title": "Dual-Level Cooperative Game Approach for Energy-Aware Resource Allocation in Data Centers"}, {"paperId": "e271a9fdf3fc7abf1ca199be705581b06d4b10ee", "title": "Explore adaptive dropout deep computing and reinforcement learning to large-scale tasks processing for big data"}, {"paperId": "67f3f79489dcfc5ea81d87f247a6319c94fe53b7", "title": "Impact of Coarse-Grained Power Gate Placement on a Fine-Grained System Design"}, {"paperId": "5e1f5c452e752a436b3b0e356ab3987052632766", "title": "MILP formulations for spatio-temporal thermal-aware scheduling in Cloud and HPC datacenters"}, {"paperId": "645ffe0b6e8ac124ad851935785a04d3870a579e", "title": "A Holistic Optimization Framework for Mobile Cloud Task Scheduling"}, {"paperId": "3c7db54d325ffe05e12e28f71b2b23880e4d5ac4", "title": "2018 Index IEEE Transactions on Big Data Vol. 4"}, {"paperId": "e311eab55d98e0624e39872b91aa17a065e65822", "title": "Big Data Meet Cyber-Physical Systems: A Panoramic Survey"}, {"paperId": "28151771a714dd488d4f76bf5eeaa5eaf89c6769", "title": "A Tensor-Based Holistic Edge Computing Optimization Framework for Internet of Things"}, {"paperId": "6ca6df4fdcfaa23091f17964b95367d1c5a9ceb7", "title": "Assessing power needs to run a workload with quality of service constraint on green datacenters"}, {"paperId": "615a35aca01da8c09fb376626d42bf99c0248817", "title": "Making FreeRTOS Pervasive Systems Learn to Select Energy Saving Technique for Mixed Taskset"}, {"paperId": "84ccdc6cc8e4e3160595ffdb06a02b829808914a", "title": "Mutual Informative MapReduce and Minimum Quadrangle Classification for Brain Tumor Big Data"}, {"paperId": "2a6c37e36a74d405d8c4020a0ef77358bf3d985a", "title": "Internet data centers participating in demand response: A comprehensive review"}, {"paperId": "dc930a3b202f7a45718cdab9cfa6392fd54063e2", "title": "University of Birmingham ThermoSim"}, {"paperId": "9be374254d919ec74b7dfc59d5f7a7d627b017c9", "title": "Brownout-oriented and energy efficient management of cloud data centers"}]}
