{"paperId": "2eb056a07b011d3789553926eb5210669856c968", "publicationVenue": null, "title": "Opportunities and Challenges of Geospatial Analysis for Promoting Urban Livability in the Era of Big Data and Machine Learning", "abstract": "Urban systems involve a multitude of closely intertwined components, which are more measurable than before due to new sensors, data collection, and spatio-temporal analysis methods. Turning these data into knowledge to facilitate planning efforts in addressing current challenges of urban complex systems requires advanced interdisciplinary analysis methods, such as urban informatics or urban data science. Yet, by applying a purely data-driven approach, it is too easy to get lost in the ‘forest’ of data, and to miss the ‘trees’ of successful, livable cities that are the ultimate aim of urban planning. This paper assesses how geospatial data, and urban analysis, using a mixed methods approach, can help to better understand urban dynamics and human behavior, and how it can assist planning efforts to improve livability. Based on reviewing state-of-the-art research the paper goes one step further and also addresses the potential as well as limitations of new data sources in urban analytics to get a better overview of the whole ‘forest’ of these new data sources and analysis methods. The main discussion revolves around the reliability of using big data from social media platforms or sensors, and how information can be extracted from massive amounts of data through novel analysis methods, such as machine learning, for better-informed decision making aiming at urban livability improvement.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-15", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "752", "volume": "9"}, "authors": [{"authorId": "1411400504", "name": "Anna Kovacs-Györi"}, {"authorId": "28077855", "name": "A. Ristea"}, {"authorId": "30172878", "name": "C. Havas"}, {"authorId": "52371671", "name": "Michael W. Mehaffy"}, {"authorId": "1687581", "name": "H. Hochmair"}, {"authorId": "34576508", "name": "Bernd Resch"}, {"authorId": "34951190", "name": "L. Juhász"}, {"authorId": "49925116", "name": "A. Lehner"}, {"authorId": "2878197", "name": "L. Ramasubramanian"}, {"authorId": "50594282", "name": "T. Blaschke"}], "citations": [{"paperId": "acb2e84c3434fbc8b8b37b5f46dbbb8832010ecc", "title": "Does Urban Livability Lead to Place Attachment and Behavioural Intentions? Case Study: Isfahan City"}, {"paperId": "8e51aef5024d68cdfb200538ea037ccfcffd6bee", "title": "Urban Expansion Prediction and Land Use/Land Cover Change Modeling for Sustainable Urban Development"}, {"paperId": "8b2f56bb21aaf8aa928d7dacc5aff553a331b75a", "title": "From near real-time urban data to an explainable city-scale model to help reduce the Urban Heat Island (UHI) effect"}, {"paperId": "a9a9950f510ed2e1e5279040a92e3f2616f5d793", "title": "Does Digital Infrastructure Improve Urban Economic Resilience? Evidence from the Yangtze River Economic Belt in China"}, {"paperId": "17f617626ec3aba7fc87476e56f8f97a53a552f6", "title": "A Semi-Automated Two-Step Building Stock Monitoring Methodology for Supporting Immediate Solutions in Urban Issues"}, {"paperId": "3b2cf962511ee25974623049f0fd1d0741bff0dd", "title": "Geoprocess of geospatial urban data in Tallinn, Estonia"}, {"paperId": "fa06e02da8330f1791ecf06ae9686e0f187da371", "title": "Spatial and temporal characteristics of rural livability and its influencing factors: implications for the development of rural revitalization strategy"}, {"paperId": "2634fc72d0da1f3d11b34c087e26c489b3c309fc", "title": "Climate change and extremes: implications on city livability and associated health risks across the globe"}, {"paperId": "651a2d73183e8c675a0bf8893f497d52cf5a6ca5", "title": "Promoting livability through urban planning: A comprehensive framework based on the “theory of human needs”"}, {"paperId": "14b00b3aaf656e2a5b10854d0ef6c95b514b2475", "title": "Behavioural mapping and online data as tools for socio-spatial analysis of public spaces – Bratislava, Slovakia waterfront case study"}, {"paperId": "83d3007153b9e4077cf5835eb8a3f497324af9c5", "title": "Assessing machine learning techniques in forecasting lumpy skin disease occurrence based on meteorological and geospatial features"}, {"paperId": "f08d4db1fad736e301fe50bfa039856b29bacf7a", "title": "A digital twin uses classification system for urban planning & city infrastructure management"}, {"paperId": "51f633c6b8bd06f7d546e22bdb86b93f4a916c6d", "title": "The Geography of Social Media Data in Urban Areas: Representativeness and Complementarity"}, {"paperId": "8e9fe1bf3ca61c58749de8c703296032d4a2009a", "title": "Exploring the Spatiotemporal Patterns of Residents' Daily Activities Using Text-Based Social Media Data: A Case Study of Beijing, China"}, {"paperId": "7922f02b9697993ba62046795134aaa14af9c11c", "title": "Development of an educational concept for geospatial industry within the core digital economy technologies"}]}
