{"paperId": "2eb26e7fa4cc760c70dc2087626debe968f71df0", "publicationVenue": null, "title": "Secure and Connected Wearable Intelligence for Content Delivery at a Mass Event: A Case Study", "abstract": "Presently, smart and connected wearable systems, such as on-body sensors and head-mounted displays, as well as other small form factor but powerful personal computers are rapidly pervading all areas of our life. Motivated by the opportunities that next-generation wearable intelligence is expected to provide, the goal of this work is to build a comprehensive understanding around some of the user-centric security and trust aspects of the emerging wearable and close-to-body wireless systems operating in mass events and under heterogeneous conditions. The paper thus intends to bring the attention of the research community to this emerging paradigm and discuss the pressing security and connectivity challenges within a popular consumer context. Our selected target scenario is that of a sports match, where wearable-equipped users may receive their preferred data over various radio access protocols. We also propose an authentication framework that allows for delivery of the desired content securely within the considered ecosystem.", "venue": "J. Sens. Actuator Networks", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-22", "journal": {"name": "J. Sens. Actuator Networks", "pages": "5", "volume": "6"}, "authors": [{"authorId": "2105429", "name": "A. Ometov"}, {"authorId": "3447617", "name": "D. Solomitckii"}, {"authorId": "143875035", "name": "Thomas Olsson"}, {"authorId": "3225070", "name": "S. Bezzateev"}, {"authorId": "3459170", "name": "A. Shchesniak"}, {"authorId": "144308173", "name": "Sergey D. Andreev"}, {"authorId": "2014154", "name": "J. Harju"}, {"authorId": "1701549", "name": "Y. Koucheryavy"}], "citations": [{"paperId": "e192de52678da2a4a614fe2cf7c63ece51724d4c", "title": "Managing Perceived Loneliness and Social-Isolation Levels for Older Adults: A Survey with Focus on Wearables-Based Solutions"}, {"paperId": "6ab6ea2bad44b73ffb86d6d5074bc17697f16883", "title": "Wearables for Industrial Work Safety: A Survey"}, {"paperId": "a3c6ce9d8b9ade76a8694ea2d8ea50f3ee727570", "title": "Data from Smartphones and Wearables"}, {"paperId": "2a2651f9e64cd38e208c050ce6c703b129b1e555", "title": "Cellular-Assisted Device-to-Device Communications for Healthcare Monitoring Wireless Body Area Networks"}, {"paperId": "b94eea3e7aef498d1aef8b5ec4c717994a4aa78d", "title": "Decision Support Algorithm Based on the Concentrations of Air Pollutants Visualization"}, {"paperId": "0a9fd636decb123571f48de048b1278356ce48a0", "title": "Localization"}, {"paperId": "3ea9538e44eabfbaa10d6dfb1fef4520964b3d2b", "title": "A Lower Bound on the Average Identification Time in a Passive RFID System"}, {"paperId": "e13c76c66db459c27aec090e6a7169186f057653", "title": "Multi-factor authentication: A survey and challenges in V2X applications"}, {"paperId": "e0f58ae088820dd21e4f360a8fa8a59b117a3524", "title": "The Internet of Things in the Swedish Hockey League"}]}
