{"paperId": "2ee14b46c37f473b0f72c945bf8adf31a73889d3", "publicationVenue": null, "title": "ConeSSD: A Novel Policy to Optimize the Performance of HDFS Heterogeneous Storage", "abstract": "HDFS(Hadoop distributed file system) is the core storage service of Hadoop, which stores and processes large datasets efficiently. Therefore, the performance of storage services significantly impacts big data processing applications. Using SSD to replace HDD devices can obtain better performance, but due to the high unit price, it is too expensive to replace all HDD with SSD in HDFS. Therefore, heterogeneous storage has been widely used in HDFS. However, the existing hierarchical strategy of HDFS is simple and cannot obtain better cost performance. This paper presents a novel heterogeneous storage policy named Cone_SSD, which fully uses SSD media on each node to get the IO performance to near SSD. Experimental results show that the proposed policy improves read and write performance by 48.11 % and 47.45%, respectively, and the fluctuation of reading performance decreases by 54.92 % compared with other policies under the same price-performance ratio.", "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "pages": "876-881"}, "authors": [{"authorId": "2115479629", "name": "Xiao Zhang"}, {"authorId": "1693997", "name": "Liang Wang"}, {"authorId": "2158555331", "name": "Zhijie Huang"}, {"authorId": "2213850822", "name": "Huiru Xie"}, {"authorId": "49889227", "name": "Yuchen Zhang"}, {"authorId": "1409506158", "name": "Michael Ngulube"}], "citations": [{"paperId": "4a0625133bd09b6acb7a8aa99f6ffd5a55abbf4d", "title": "Efficient data persistence and data division for distributed computing in cloud data center networks"}]}
