{"paperId": "2ee7f3f0cfe217bdc9c3e321b7fc882ebd221d6f", "publicationVenue": null, "title": "MDSC: modelling distributed stream processing across the edge-to-cloud continuum", "abstract": "The growth of the Internet of Things is resulting in an explosion of data volumes at the Edge of the Internet. To reduce costs incurred due to data movement and centralized cloud-based processing, it is becoming increasingly important to process and analyze such data closer to the data sources. Exploiting Edge computing capabilities for stream-based processing is however challenging. It requires addressing the complex characteristics and constraints imposed by all the resources along the data path, as well as the large set of heterogeneous data processing and management frameworks. Consequently, the community needs tools that can facilitate the modeling of this complexity and can integrate the various components involved. In this work, we introduce MDSC, a hierarchical approach for modeling distributed stream-based applications on Edge-to-Cloud continuum infrastructures. We demonstrate how MDSC can be applied to a concrete real-life ML-based application - early earthquake warning - to help answer questions such as: when is it worth decentralizing the classification load from the Cloud to the Edge and how?", "venue": "UCC Companion", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-12-06", "journal": {"name": "Proceedings of the 14th IEEE/ACM International Conference on Utility and Cloud Computing Companion"}, "authors": [{"authorId": "1393670168", "name": "Daniel Balouek-Thomert"}, {"authorId": "2110591649", "name": "Pedro Silva"}, {"authorId": "2154411319", "name": "Kevin Fauvel"}, {"authorId": "1726606", "name": "Alexandru Costan"}, {"authorId": "1779139", "name": "Gabriel Antoniu"}, {"authorId": "145203664", "name": "M. Parashar"}], "citations": [{"paperId": "3fe804c2e03d0ebbde596055e4acf0bdfc7143a2", "title": "From Tight Coupling to Flexibility: A Digital Twin Middleware Layer for the ShakeAlert System"}, {"paperId": "096a627fb2562b81f8b31869d398ff8f4d52150b", "title": "Supporting the Natural Disaster Management Distributing Federated Intelligence over the Cloud-Edge Continuum: the TEMA Architecture"}, {"paperId": "f7c46eb1dff559cadfc7a1daaf122516822abb99", "title": "CKN: An Edge AI Distributed Framework"}, {"paperId": "86b8ea3ac2032d241d9fc5dc7451cedf71fe5a6a", "title": "TEMA: Event Driven Serverless Workflows Platform for Natural Disaster Management"}, {"paperId": "ce2bd6eba1a4224c8839ea8ff5d971155d7e29a3", "title": "FMap: A fuzzy map for scheduling elephant flows through jumping traveling salesman problem variant toward software‐defined networking‐based data center networks"}, {"paperId": "542dbf74aa56a9d5f384a4fa06ae543f0bbff421", "title": "Cloud Continuum: The Definition"}]}
