{"paperId": "2ee88649012d6458bcb601e9153d29b41fd949c7", "publicationVenue": {"id": "38e26272-f1d7-470a-a99f-0b5884c9df6e", "name": "De Computis", "alternate_names": ["Comput"], "issn": "1886-1881", "url": "https://dialnet.unirioja.es/servlet/revista?clave_revista=6205&tipo_busqueda=CODIGO", "alternate_urls": ["http://decomputis.org/ojs/", "https://ideas.repec.org/s/dec/articl.html", "http://www.decomputis.org/"]}, "title": "Exploring the Landscape of Data Analysis: A Review of Its Application and Impact in Ecuador", "abstract": "Data analysis is increasingly critical in aiding decision-making within public and private institutions. This paper scrutinizes the status quo of big data and data analysis and its applications within Ecuador, focusing on its societal, educational, and industrial impact. A detailed literature review was conducted from academic databases such as SpringerLink, Scopus, IEEE Xplore, Web of Science, and ACM, incorporating research from inception until May 2023. The search process adhered to the PRISMA statement, employing specific inclusion and exclusion criteria. The analysis revealed that data implementation in Ecuador, while recent, has found noteworthy applications in six principal areas, classified using ISCED: education, science, engineering, health, social, and services. In the scientific and engineering sectors, big data has notably contributed to disaster mitigation and optimizing resource allocation in smart cities. Its application in the social sector has fortified cybersecurity and election data integrity, while in services, it has enhanced residential ICT adoption and urban planning. Health sector applications are emerging, particularly in disease prediction and patient monitoring. Educational applications predominantly involve student performance analysis and curricular evaluation. This review emphasizes that while big data’s potential is being gradually realized in Ecuador, further research, data security measures, and institutional interoperability are required to fully leverage its benefits.", "venue": "De Computis", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-22", "journal": {"name": "Comput.", "pages": "146", "volume": "12"}, "authors": [{"authorId": "1723342817", "name": "Manuel Ayala-Chauvin"}, {"authorId": "2179465334", "name": "Fátima Avilés-Castillo"}, {"authorId": "2100447374", "name": "J. Buele"}], "citations": []}
