{"paperId": "2eebeb69adaab8cbb59e74517464db9f315abf6b", "publicationVenue": {"id": "5e1f6444-5d03-48c7-b202-7f47d492aeae", "name": "IEEE Transactions on Visualization and Computer Graphics", "type": "journal", "alternate_names": ["IEEE Trans Vis Comput Graph"], "issn": "1077-2626", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=2945"}, "title": "Githru: Visual Analytics for Understanding Software Development History Through Git Metadata Analysis", "abstract": "Git metadata contains rich information for developers to understand the overall context of a large software development project. Thus it can help new developers, managers, and testers understand the history of development without needing to dig into a large pile of unfamiliar source code. However, the current tools for Git visualization are not adequate to analyze and explore the metadata: They focus mainly on improving the usability of Git commands instead of on helping users understand the development history. Furthermore, they do not scale for large and complex Git commit graphs, which can play an important role in understanding the overall development history. In this paper, we present Githru, an interactive visual analytics system that enables developers to effectively understand the context of development history through the interactive exploration of Git metadata. We design an interactive visual encoding idiom to represent a large Git graph in a scalable manner while preserving the topological structures in the Git graph. To enable scalable exploration of a large Git commit graph, we propose novel techniques (graph reconstruction, clustering, and Context-Preserving Squash Merge (CSM) methods) to abstract a large-scale Git commit graph. Based on these Git commit graph abstraction techniques, Githru provides an interactive summary view to help users gain an overview of the development history and a comparison view in which users can compare different clusters of commits. The efficacy of Githru has been demonstrated by case studies with domain experts using real-world, in-house datasets from a large software development team at a major international IT company. A controlled user study with 12 developers comparing Githru to previous tools also confirms the effectiveness of Githru in terms of task completion time.", "venue": "IEEE Transactions on Visualization and Computer Graphics", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-07", "journal": {"name": "IEEE Transactions on Visualization and Computer Graphics", "pages": "656-666", "volume": "27"}, "authors": [{"authorId": "2108051792", "name": "Youngtaek Kim"}, {"authorId": "1590802650", "name": "Jaeyoung Kim"}, {"authorId": "2064754612", "name": "Hyeon Jeon"}, {"authorId": "2133040691", "name": "Young-Ho Kim"}, {"authorId": "4430699", "name": "Hyunjoo Song"}, {"authorId": "122905015", "name": "Bohyoung Kim"}, {"authorId": "2016076", "name": "Jinwook Seo"}], "citations": [{"paperId": "2f4d04e64c0ab885d0d7f545f4af38406f24bedb", "title": "An Image-based Typology for Visualization"}, {"paperId": "6ec6a6a7eb303e4d56705ba4ffdfa65fef975297", "title": "Enhancing Idiom Classification on Text-based Conversational Data: Evaluating Transformer Model Performance through k-fold Cross-Validation"}, {"paperId": "94c1125e92a2fa00d0eaf338ed66cbff922b1a25", "title": "ViolationTracker: Building Precise Histories for Static Analysis Violations"}, {"paperId": "4be11057cbfe6c712a63dc04be94d3378ce67864", "title": "Colaroid: A Literate Programming Approach for Authoring Explorable Multi-Stage Tutorials"}, {"paperId": "71684f72659fde39c16c9030383f03b9e7a72737", "title": "An artificial intelligence framework on software bug triaging, technological evolution, and future challenges: A review"}, {"paperId": "e5cd3802f6f123064aaa1c640373653ac0ddbc03", "title": "Automatic feedback and assessment of team-coding assignments in a DevOps context"}, {"paperId": "6339aba25847afe9934c5c3e76ca40e0bac635f8", "title": "See it to believe it?: the role of visualisation in systems research"}, {"paperId": "7bd8edbe92642c9d589b30dfbf888a79903d2501", "title": "Can Git Repository Visualization Support Educators in Assessing Group Projects?"}, {"paperId": "0b13e5382e688b7e41916d16b40e2fc489d6b2c5", "title": "Git-Truck: Hierarchy-Oriented Visualization of Git Repository Evolution"}, {"paperId": "e37efad81d927d8cf26eb12f435aa62ff337bb94", "title": "Not As Easy As You Think - Experiences and Lessons Learnt from Trying to Create a Bottom-Up Visualization Image Typology"}, {"paperId": "4a9fab6c8a70930f14b5700d9384f8b321fd4af7", "title": "Leveraging structural properties of source code graphs for just-in-time bug prediction"}, {"paperId": "0b3d90205f046b39efc66d984739025bd62920d3", "title": "MulUBA: multi-level visual analytics of user behaviors for improving online shopping advertising"}, {"paperId": "cc5b420b92d512e8e2419c01b3f712f633279fbe", "title": "Towards Better Support for Undergraduate Software Engineering Teams"}, {"paperId": "7b46a26606860477ddb6908452ad7f3883d4588b", "title": "Interactive Visualization for Exploring Information Fragments in Software Repositories"}, {"paperId": "ac8dab6229d666feecd063e6ec3c5fe772dd3e70", "title": "Analyzing Software Engineering Processes with Provenance-based Knowledge Graphs"}, {"paperId": "cb373cc4922c57eb1560222fa0c014bb3db8706c", "title": "An Extended Survey Concerning the Significance of Artificial Intelligence and Machine Learning Techniques for Bug Triage and Management"}, {"paperId": "2e4879061db4d8eec2f3937306d8654e32589989", "title": "I Don’t Know What You Did Last Summer: The Missing Role of Humans in Systems Research"}, {"paperId": "282d96d9e3d2865841c3e0d7561d4a139a9e56ea", "title": "GitLab2PROV - Provenance of Software Projects hosted on GitLab"}]}
