{"paperId": "2efba5582aff9a26a24f8e6bf954fe2907930647", "publicationVenue": null, "title": "Optimizing Resource Utilization Using Vector Databases in Green Internet of Things", "abstract": "With the rapid proliferation of Internet of Things (IoT) devices and the ever-increasing volume of sensor data, optimizing resource utilization has become crucial for building sustainable and efficient IoT systems. In this study, we propose a novel approach for optimizing resource utilization in Green IoT through efficient storage and retrieval in vector databases. Our approach leverages specialized data structures, including k-d trees and ball trees, to achieve improved storage efficiency and accelerated retrieval performance for high-dimensional sensor data. We conducted extensive experiments to evaluate the effectiveness of our proposal, comparing it with traditional database approaches. The results demonstrate significant improvements in storage efficiency, with vector databases requiring considerably less storage space compared to traditional databases. Moreover, our approach enables fast and accurate retrieval of high-dimensional sensor data, reducing query times and enhancing real-time data analysis and decision-making capabilities. The technical achievements of our proposal offer promising prospects for the development of sustainable and efficient IoT systems in various domains, such as environmental monitoring, healthcare, and smart cities. Our work contributes to advancing the field of Green IoT by addressing the challenges of resource utilization and query performance through efficient storage and retrieval in vector databases.", "venue": "2023 IEEE Globecom Workshops (GC Wkshps)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-04", "journal": {"name": "2023 IEEE Globecom Workshops (GC Wkshps)", "pages": "1988-1993"}, "authors": [{"authorId": "2237673015", "name": "Rani Kumari"}, {"authorId": "40648209", "name": "D. Sah"}, {"authorId": "2237710014", "name": "Korhan Cengiz"}, {"authorId": "2292743787", "name": "Ali Nauman"}, {"authorId": "2237708968", "name": "Nikola Ivković"}, {"authorId": "2293617414", "name": "Ivan Mihaljevic"}], "citations": []}
