{"paperId": "2f15a472dd454769500d6928f880a1b3d848c6fd", "publicationVenue": {"id": "72c05183-0dc0-4677-a987-a1d6a8691b97", "name": "International Conference on Information Visualisation", "type": "conference", "alternate_names": ["IEEE International Conference on Information Visualization", "Intell Veh Symp", "IEEE Int Conf Inf Vis", "IV", "Int Conf Inf Vis", "Intelligent Vehicles Symposium"], "url": "http://www.wikicfp.com/cfp/program?id=1803"}, "title": "SIDVis: Designing Visual Interactive System for Analyzing Suicide Ideation Detection", "abstract": "Suicide is a critical global issue that demands a comprehensive examination of factors such as mental illness, substance abuse, financial stress, and trauma. Effectively identifying individuals at risk is vital for intervention and prevention efforts. However, distinguishing suicidal ideation (SID) from non-suicidal language poses challenges. Existing research has addressed this issue, but limited attention has been given to visually interpretable and interactive systems tailored for SID. This study contributes to responsible AI by leveraging deep learning and machine learning techniques to enhance SID detection, enabling proactive interventions and support. In this paper, we introduce SIDVis, an interactive visualization system that improves performance and interpretability at the same time. The rigorous evaluation demonstrates that SIDVis not only outperforms existing methods in terms of accuracy but also provides an explanation for the responsible use of the underlying AI approach, demonstrating its potential to improve SID detection and intervention strategies.", "venue": "International Conference on Information Visualisation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-25", "journal": {"name": "2023 27th International Conference Information Visualisation (IV)", "pages": "384-389"}, "authors": [{"authorId": "2265768952", "name": "Md. Rafiqul Islam"}, {"authorId": "2265678843", "name": "Md. Kowsar Hossain Sakib"}, {"authorId": "2259676257", "name": "Anwaar Ulhaq"}, {"authorId": "2131186840", "name": "Shanjita Akter"}, {"authorId": "2146366577", "name": "Jianlong Zhou"}, {"authorId": "2265677287", "name": "David Asirvathamt"}], "citations": [{"paperId": "5aa3cfc2c41c3a2e09a01bbf1f23a17511aa10ab", "title": "LieVis: A Visual Interactive Dashboard for Lie Detection Using Machine Learning and Deep Learning Techniques"}, {"paperId": "9d4c1238d5a0707d65d99cde2c26b67a39f545ef", "title": "Machine Learning with Explainability for Suicide Ideation Detection from Social Media Data"}]}
