{"paperId": "2f22899f2fc6b6f6b07a9eec95ab7f60eb5639c8", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "XGBoost Classification of XAI based LIME and SHAP for Detecting Dementia in Young Adults", "abstract": "As technology progresses on a fast pace, it is imperative that shall be used in the field of medicine for the early detection and diagnostics of dementia. Dementia affects humans by deteriorating the cognitive functions, and as such many algorithms have been used in the detection of the same but all these algorithms remain a black box to the medical fraternity which is still dubious about the nature and credibility of the prediction. To ease this issue, the use of explainable artificial intelligence has been proposed and implemented in this paper, which makes it easy to understand why and how the model is giving a particular output. In this paper the XGBoost classification algorithm has been used which give an accuracy of 93.33% and to understand these predictions, two separate algorithms namely Local Interpretable Model-agnostic Explanations (LIME) and Shapely Additive Explanations (SHAP) have been used. These algorithms are compared based on the type of explanation they provide for the same input and thus the weakness of LIME algorithm has been found out at certain intervals based on the clinically important features of the dataset. On the other hand, both the algorithms make it easy for medical practitioners to understand the dominating factors of a predicted output thereby helping to eliminate the black-box nature of dementia detection.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-06", "journal": {"name": "2023 14th International Conference on Computing Communication and Networking Technologies (ICCCNT)", "pages": "1-6"}, "authors": [{"authorId": "2266780654", "name": "Vandana Sharma"}, {"authorId": "2266111886", "name": "Divya Midhunchakkaravarthy"}], "citations": []}
