{"paperId": "2f2227f368fce8f19393aef7af37165f6179ee47", "publicationVenue": null, "title": "Dynamic data transformation for low latency querying in big data systems", "abstract": "Big data storage technologies inherently entail high latency characteristics, preventing users from performing efficient ad-hoc querying and interactive visualization on large and distributed datasets. Most of the existing approaches addressing this issue thrive on de-normalization of the static data schema and creation of application specific (i.e. hard-coded) materialized views, which certainly reduce data access latency but at the expense of flexibility. In this regard, this paper proposes an approach that relies on an iterative process of data transformation intended to generate read-optimized data schemas. The transformation process is able to automatically identify optimization opportunities (e.g. materialized views, missing indexes), by analyzing the original data schema and the record of queries issued by users and client applications against the data set. An experimental evaluation of the proposed approach evidences a significant reduction in the query latency, ranging from 81.60% to 99.99%.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "2480-2489"}, "authors": [{"authorId": "1405534118", "name": "Leandro Ordoñez-Ante"}, {"authorId": "48609947", "name": "Thomas Vanhove"}, {"authorId": "2720187", "name": "Gregory van Seghbroeck"}, {"authorId": "145115855", "name": "T. Wauters"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1715957", "name": "F. Turck"}], "citations": [{"paperId": "951dfa8af7cc886467d3ffe638701914f28a5614", "title": "A Workload-Driven Approach for View Selection in Large Dimensional Datasets"}, {"paperId": "e95c24a3797284fa9776dcd782f0423b41720dce", "title": "Automatic View Selection for Distributed Dimensional Data"}]}
