{"paperId": "2f268203e9ec98efbfe773d41d3f07d28653f6f3", "publicationVenue": {"id": "d8655d54-1311-417a-91f7-c5c6daf8fba2", "name": "IEEE International Conference on Software Analysis, Evolution, and Reengineering", "type": "conference", "alternate_names": ["IEEE Int Conf Softw Anal Evol Reengineering", "SANER"], "url": "http://www.informatik.uni-stuttgart.de/ifi/ps/reengineering/"}, "title": "Kuber: Cost-Efficient Microservice Deployment Planner", "abstract": "The microservice-based architecture - a SOA-inspired principle of dividing backend systems into indepen-dently deployed components that communicate with each other using language-agnostic APIs - has gained increased popularity in industry. Realistic microservice-based applications contain hundreds of services deployed on a cloud. As cloud providers typically offer a variety of virtual machine (VM) types, each with its own hardware specification and cost, picking a proper cloud configuration for deploying all microservices in a way that satisfies performance targets while minimizing the deployment costs becomes challenging. Existing work focuses on identifying the best VM types for recurrent (mostly high-performance computing) jobs. Yet, identifying the best VM type for the myriad of all possible service combinations and further identifying the optimal subset of combinations that minimizes deployment cost is an intractable problem for applications with a large number of services. To address this problem, we propose an approach, called Kuber, which utilizes a set of strategies to efficiently sample the neces-sary subset of service combinations and VM types to explore. Comparing Kuber with baseline approaches shows that Kuber is able to find the best deployment with the lowest search cost.", "venue": "IEEE International Conference on Software Analysis, Evolution, and Reengineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-01", "journal": {"name": "2022 IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER)", "pages": "252-262"}, "authors": [{"authorId": "29411246", "name": "Harshavardhan Kadiyala"}, {"authorId": "2178758662", "name": "Alberto Misail"}, {"authorId": "40575065", "name": "J. Rubin"}], "citations": [{"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications"}, {"paperId": "dc0d2fd40948cda0f093b369fd1a3e579ecb6a42", "title": "TADL: Fault Localization with Transformer-based Anomaly Detection for Dynamic Microservice Systems"}]}
