{"paperId": "2f3c81894b06b2dd275e1f74b9517b6e54a3aa4b", "publicationVenue": {"id": "ded9d899-86d8-42ae-a0bf-c0a3b6fbdd43", "name": "International Workshop Distributed Fog Services Design", "type": "conference", "alternate_names": ["DFSD", "Int Workshop Distrib Fog Serv Des"]}, "title": "A Survey on Fog Programming: Concepts, State-of-the-Art, and Research Challenges", "abstract": "With the rapid evolution of the Internet of Things (IoT) and the growth of IoT-generated data, cloud computing platforms have been widely used to store and process this type of data. However, cloud computing cannot handle rapidly emerging smart applications with latency-sensitive, high throughput, and high availability and reliability requirements, such as virtual reality and autonomous vehicles. The fog and mobile edge computing paradigms have been proposed to bring the cloud capacity along the network to end devices to address the above concerns. A key development aspect of fog systems is their programming models. Fog programming models and frameworks face challenges that originated from the unique characteristics of fog systems, such as heterogeneity, scalability, and mobility. In this paper, we first study the main characteristics of fog programming, as well as the design requirements of fog programming models with respect to the fog architecture and application types. Then, we survey fog programming models both from research and industry perspectives. Finally, we point out the issues and future challenges in fog programming. The survey framework, presented in this paper, provides useful insights and outlook for the fog programming research and development, inspires further research on fog programming models, and sheds light on the future of programming in this fast-growing computing paradigm.", "venue": "International Workshop Distributed Fog Services Design", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-12-09", "journal": {"pages": "1-6"}, "authors": [{"authorId": "51043175", "name": "Dapeng Lan"}, {"authorId": "2848485", "name": "Amirhosein Taherkordi"}, {"authorId": "1743900", "name": "F. Eliassen"}, {"authorId": "1762787", "name": "G. Horn"}], "citations": [{"paperId": "ad1592d176ab1e5e9a74720f3bfbe7185530f512", "title": "A comprehensive survey of energy-efficient computing to enable sustainable massive IoT networks"}, {"paperId": "2a69bfb777a395f1d53726d13dd41bf8afec7066", "title": "Joint Optimization of Service Migration and Resource Management for Vehicular Edge Computing"}, {"paperId": "46b0d3954dfc6642d43f7d7e646cc1a8914751f7", "title": "MASTER: Reclamation of Hybrid Scratchpad Memory to Maximize Energy Saving in Multi-Core Edge Systems"}, {"paperId": "e23e9925db038da63bb761fbada4a5fc1ff59874", "title": "Edge computing"}, {"paperId": "3d3b07e7e1182d5f9b1a418fd4683cf94aaf712b", "title": "Fog node discovery and selection: A Systematic literature review"}, {"paperId": "a20cf50977e1fec07517b39e1f627ef2b7cd488b", "title": "Fog Computing Platforms for Smart City Applications: A Survey"}, {"paperId": "ec66ad114fbcbb8283d1b47730b89983515539b4", "title": "BarMan: A run-time management framework in the resource continuum"}, {"paperId": "abe136d0bc00e0c14122efc51a37af226e204b74", "title": "A federated fog-cloud framework for data processing and orchestration: a case study in smart cities"}, {"paperId": "8c21d48547bf1ac15c5ed157a0b468b26b555d40", "title": "Deep Reinforcement Learning for Intelligent Migration of Fog Services in Smart Cities"}, {"paperId": "c456eaa5d0973c15fcec11be535b91a5b800f634", "title": "The Many Faces of Edge Intelligence"}]}
