{"paperId": "2f4132d69428bebdb2033430694e6b864cfc1af6", "publicationVenue": null, "title": "Cyber Security and Data Mining: Detecting Malicious URL Using Data Mining Techniques", "abstract": "Increasing usage of data generation and utilization, the threat of data exploitation and loss also increases. So, the need for cyber security also increases. Using data mining techniques, we can protect our data from threats that come along with the extensive use of technology. In this paper, we present machine-learning and deep-learning approaches to identify the cyber-attacks that are in the form of malicious URLs (Uniform Resource Locators). The cyber-attackers use malicious URLs as a way of invading the system and propagating malware over the web. When a person accesses such URL, it initiates a predetermined harmful behavior which can result in various cybercrimes such as spamming, phishing, loss of confidentiality, denial-of-service, etc. To prevent suck attacks, we have analyzed the use of Deep Learning (DL) and Machine Learning (ML) algorithms for the detection and classification of malicious URLs. Machine learning algorithms implemented include Gaussian Naïve Bayes (NB), Multinomial Naïve Bayes (NB), Bernoulli Naïve Bayes, and Random Forest Classifier (RFC). Deep learning algorithms that were implemented include RNN, LTSM, GRU, Bidirectional LSTM, ANN, and 1D convolution neural network.", "venue": "2023 International Conference on Communication, Security and Artificial Intelligence (ICCSAI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-23", "journal": {"name": "2023 International Conference on Communication, Security and Artificial Intelligence (ICCSAI)", "pages": "527-534"}, "authors": [{"authorId": "2284343708", "name": "Priyanshu Malaviya"}, {"authorId": "2284343331", "name": "Sahaj Bhadja"}, {"authorId": "2284342412", "name": "Vishwa Gajjar"}, {"authorId": "2284344496", "name": "Yogesh Kumar"}], "citations": []}
