{"paperId": "2f48cc217d33877735aa21612086ad42932d804f", "publicationVenue": null, "title": "Data: Is It Grey, Maligned or Malignant?", "abstract": "Cancers, growths, past events, social issues, conditions, and trends are each proverbially described as on a spectrum from maligned to malignant and scientists, physicians, journalists, commentators, politicians and other specialists offer opinions and commentary on what frames the answer to this question of the title. This paper explores not just the color and tone of data, but attempts to resolve what characterizes whether data is maligned or malignant. Hues of greyness distinguish the perils of failing to share, publish nor make accessible research data and the contemporary consequences to scholarship and open access are critical objectives in today's information arcade. Access to data is determined by those who can afford it, discover and know about it, and can thus manipulate it. Grey literature can take the offensive approach to further the role of data, and promote it to advance the common good, contribute to social responsibility and human actions. Data, while increasingly ubiquitous and abundant is the driver of evidence- based foundations, and the link to academic credibility, communication, discourse, dialogue, and the platform for greater open access. Grey data, possessing some of the attributes of grey literature, difficult to identify, acquire and access, when endangered or threatened, not archived or preserved, requiring methods to organize, sort and stratify, forces nontraditional publishing to pursue data publication to enhance perpetual access and new interpretations fo r its utility in future learning and research applications. We know that there is a somewhat elevated likelihood that open data policies lead to more widespread knowledge and information sharing, greater self- confidence among information providers and scholars alike, but we know less of whether these patterns have any short or long term benefits or disadvantages fo r individuals or society and of the factors that moderate and mediate these effects. In the meantime, the new reality is that data is central to the work of science, social sciences and basic human conditions of health and wellbeing and data policies mostly proceed from a grey containment to this new reality. The argument that as libraries become active publishers by digitizing content, creating new content, supporting researchers by addressing new domains and formats, that other interpretations of grey data and data more generally are increasingly plausible and that further research on the factors moderating and mediating the effects of data management is needed. This paper explores the continuum for data from maligned to malignant and anticipates data approaching the benign stage emphasizing new hues of grey and open access.", "venue": "", "year": 2015, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2015-04-01", "journal": {"name": "", "volume": "11"}, "authors": [{"authorId": "40296781", "name": "J. Gelfand"}, {"authorId": "143905194", "name": "Daniel C W Tsang"}], "citations": [{"paperId": "3627b5b8adefaef27b634a3348f5c6a5cfbcdbe3", "title": "Low-barrier-to-entry data tools: creating and sharing humanities data"}, {"paperId": "368c6fe8aa3745c3401acd836fbdf492f0c12655", "title": "Deepfakes: A Digital Transformation Leads to Misinformation"}]}
