{"paperId": "2f4f25fa165cd8808a7917320c8f30474838bccd", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Model and Survey of Distributed Data-Intensive Systems", "abstract": "Data is a precious resource in today’s society, and it is generated at an unprecedented and constantly growing pace. The need to store, analyze, and make data promptly available to a multitude of users introduces formidable challenges in modern software platforms. These challenges radically impacted the research fields that gravitate around data management and processing, with the introduction of distributed data-intensive systems that offer innovative programming models and implementation strategies to handle data characteristics such as its volume, the rate at which it is produced, its heterogeneity, and its distribution. Each data-intensive system brings its specific choices in terms of data model, usage assumptions, synchronization, processing strategy, deployment, guarantees in terms of consistency, fault tolerance, and ordering. Yet, the problems data-intensive systems face and the solutions they propose are frequently overlapping. This article proposes a unifying model that dissects the core functionalities of data-intensive systems, and discusses alternative design and implementation strategies, pointing out their assumptions and implications. The model offers a common ground to understand and compare highly heterogeneous solutions, with the potential of fostering cross-fertilization across research communities. We apply our model by classifying tens of systems: an exercise that brings to interesting observations on the current trends in the domain of data-intensive systems and suggests open research directions.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-21", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 69", "volume": "56"}, "authors": [{"authorId": "2866882", "name": "Alessandro Margara"}, {"authorId": "3292643", "name": "G. Cugola"}, {"authorId": "1965902743", "name": "Nicolò Felicioni"}, {"authorId": "2159547615", "name": "Stefano Cilloni"}], "citations": [{"paperId": "a07967bf576dea2ee94602c7aeb18fc48f197d45", "title": "The Noir Dataflow Platform: Efficient Data Processing without Complexity"}, {"paperId": "8f876c2a8f9766606fe18272535a728f3c04afc0", "title": "Benchmarking scalability of stream processing frameworks deployed as microservices in the cloud"}, {"paperId": "866e157e94b5f76cb41e698623cdcfbb2d4785af", "title": "On the Semantic Overlap of Operators in Stream Processing Engines"}, {"paperId": "ae4df74c63a2847c1174a660550996e08d870eab", "title": "Formal Algebraic Model of an Edge Data Center with a Redundant Ring Topology"}, {"paperId": "0965457a373b4726647c54e51403fbb420f1bb12", "title": "A unifying model for distributed data-intensive systems"}, {"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing"}, {"paperId": "d01fa90ee9444121aaa3e814e4876598f593cd3f", "title": "Benchmarking scalability of stream processing frameworks deployed as event-driven microservices in the cloud"}, {"paperId": "880d2c6a950bec308c8ddeb82b91cde05413ed11", "title": "DEBS Grand Challenge: Analysis of Market Data with Noir"}]}
