{"paperId": "2f5edd4bf9a05012fb14cee3d370fbbe91546d7a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Modeling Product Manufacturing Reliability with Quality Variations Centered on the Multilayered Coupling Operational Characteristics of Intelligent Manufacturing Systems", "abstract": "For intelligent manufacturing systems, there are many deviations in operational characteristics, and the coupling effect of harmful operational characteristics leads to the variations in quality of the work-in-process (WIP) and the degradation of the reliability of the finished product, which is reflected as a loss of product manufacturing reliability. However, few studies on the modeling of product manufacturing reliability and mechanism analysis consider the operating mechanism and the coupling of characteristics. Thus, a novel modeling approach based on quality variations centered on the coupling of operational characteristics is proposed to analyze the formation mechanism of product manufacturing reliability. First, the PQR chain containing the co-effects among the manufacturing system performance (P), the manufacturing process quality (Q), and the product manufacturing reliability (R) is elaborated. The connotation of product manufacturing reliability is defined, multilayered operational characteristics are determined, and operational data are collected by smart sensors. Second, on the basis of the coupling effect in the PQR chain, a multilayered product quality variation model is proposed by mining operational characteristic data obtained from sensors. Third, an integrated product manufacturing reliability model is presented on the basis of the variation propagation mechanism of the multilayered product quality variation model. Finally, a camshaft manufacturing reliability analysis is conducted to verify the validity of the proposed method. The method proposed in this paper proved to be effective for evaluating and predicting the product reliability in the smart manufacturing process.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "49425343", "name": "Anqi Zhang"}, {"authorId": "9253584", "name": "Yihai He"}, {"authorId": "2118233138", "name": "Xiao Han"}, {"authorId": "2110975538", "name": "Yao Li"}, {"authorId": "2112094919", "name": "Xiuzhen Yang"}, {"authorId": "2128158999", "name": "Zixuan Zhang"}], "citations": [{"paperId": "106a3d2cfb67fd734df1d1d519a70a6ec05fb138", "title": "A Machine Learning Approach for Improving Wafer Acceptance Testing Based on an Analysis of Station and Equipment Combinations"}, {"paperId": "3fbf6dbbcf6005b72f7e653fbb24747bf10a8d86", "title": "Deep learning for manufacturing sustainability: Models, applications in Industry 4.0 and implications"}, {"paperId": "d16850598ccdff4295dba2cb201fe8314887c6f5", "title": "Construction of an Integrated Framework for Complex Product Design Manufacturing and Service Based on Reliability Data"}, {"paperId": "c10e2eba34f0594d9087d042a035b610db3342f9", "title": "Functional health prognosis approach of multi-station manufacturing system considering coupling operational factors"}]}
