{"paperId": "2f6f13732a3710db88a4fc4b95dd52f75c096404", "publicationVenue": {"id": "54313588-dd70-4bcb-b94a-84500673b4ec", "name": "Cogent Engineering", "type": "journal", "alternate_names": ["Cogent engineering", "Cogent eng", "Cogent Eng"], "issn": "2331-1916", "url": "http://www.tandfonline.com/toc/oaen20/1/1", "alternate_urls": ["http://cogentoa.tandfonline.com/journal/oaen20"]}, "title": "Educational technology: Exploring the convergence of technology and pedagogy through mobility, interactivity, AI, and learning tools", "abstract": "Abstract Efforts at the intersection of technology and pedagogy converge upon four pivotal axes that collectively delineate the future educational landscape. These axes, namely mobility, interactivity, artificial intelligence (AI), and technological learning tools like games and augmented reality, encompass the domain of educational transformation. The fusion of these elements necessitates the development of a mobile-interactive paradigm that duly acknowledes the learner’s temporal availability and optimal convenience. Currently, technology is already integrated into the educational realm. However, its diverse manifestations across various contexts underscore the urgent need to integrate and amalgamate these facets within pedagogical frameworks that prioritize students’ erudition. This research undertakes a comprehensive analysis of multifarious technological modalities and puts forth a harmonized model that could furnish a foundational structure for classroom instruction. Central to this paradigm is the recognition of the paramountcy of intelligent tutoring systems, which serve to democratize access to tutoring. By imbuing these systems with advanced AI capabilities, learners can benefit from personalized and adaptive support, irrespective of their location or socioeconomic background. Furthermore, the significance of conducting technological experiments cannot be understated, as it allows for the exploration of new frontiers and the subsequent application of findings to “teaching-learning models.” These models harness a diverse range of interaction patterns to enhance the educational experience. By embracing these transformative elements, educational frameworks can better cater to the evolving needs of learners, while intelligent tutoring systems and ongoing technological experimentation serve as cornerstones in advancing the educational journey.", "venue": "Cogent Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "Cogent Engineering", "volume": "10"}, "authors": [{"authorId": "2248402666", "name": "Ashraf Alam"}, {"authorId": "2248140635", "name": "Atasi Mohanty"}], "citations": [{"paperId": "c22691f7a579c19432d0dac8de1f7d428e3b0dac", "title": "Harnessing Information Technology in Learning: Exploring Emerging Trends and Innovative Approaches"}, {"paperId": "f2609b0cc05b4e7512b2ecc13365678efa4c5734", "title": "Development of trigonometric comparison teaching materials based on ICT and Tri-N for face-to-face and distance learning"}, {"paperId": "cd615ce9fc97b816634875f6785ebca526e6f653", "title": "Exploring the Landscape: Analysis of Model Results on Various Convolutional Neural Network Architectures for iRESPOND System"}, {"paperId": "73e9e641971e26cb21bb2d6ee0b0905928f9e314", "title": "AI in education: A review of personalized learning and educational technology"}]}
