{"paperId": "2f6f4450e9bc33e7eb050963fbbb9ac48ee7f37d", "publicationVenue": {"id": "fcb86ed6-f18e-4059-9779-7acc73d8b8ab", "name": "The Physics of Fluids", "type": "journal", "alternate_names": ["Physics of Fluids", "Phys Fluid"], "issn": "0031-9171", "alternate_issns": ["1070-6631"], "url": "https://aip.scitation.org/journal/phf", "alternate_urls": ["http://pof.aip.org/"]}, "title": "Towards a robust detection of viscous and turbulent flow regions using unsupervised Machine Learning", "abstract": "We propose an invariant feature space for the detection of viscous-dominated and turbulent regions (i.e., boundary layers and wakes). The developed methodology uses the principal invariants of the strain and rotational rate tensors as input to an unsupervised Machine Learning Gaussian mixture model. The selected feature space is independent of the coordinate frame used to generate the processed data, as it relies on the principal invariants of strain and rotational rate, which are Galilean invariants. This methodology allows us to identify two distinct flow regions: a viscous-dominated, rotational region (boundary layer and wake region) and an inviscid, irrotational region (outer flow region). We have tested the methodology on a laminar and a turbulent (using Large Eddy Simulation) case for flows past a circular cylinder at $Re=40$ and $Re=3900$ and a laminar flow around an airfoil at $Re = 1 × 10^5$. The simulations have been conducted using a high-order nodal Discontinuous Galerkin Spectral Element Method (DGSEM). The results obtained are analysed to show that Gaussian mixture clustering provides an effective identification method of viscous-dominated and rotational regions in the flow. We also include comparisons with traditional sensors to show that the proposed clustering does not depend on the selection of an arbitrary threshold, as required when using traditional sensors.", "venue": "The Physics of Fluids", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2022-07-06", "journal": {"name": "Physics of Fluids"}, "authors": [{"authorId": "2175252459", "name": "Kheir-eddine Otmani"}, {"authorId": "2119229142", "name": "G. Ntoukas"}, {"authorId": "2065756182", "name": "O. Mariño"}, {"authorId": "145772118", "name": "E. Ferrer"}], "citations": [{"paperId": "568bf418b8ae2a0c8e924f932384011f23bb10fc", "title": "Machine learning mesh-adaptation for laminar and turbulent flows: applications to high-order discontinuous Galerkin solvers"}, {"paperId": "91ce9ef259f8962c4538531a3b0de6582fbac17c", "title": "Spatial prediction of the turbulent unsteady von Kármán vortex street using echo state networks"}, {"paperId": "f1d0a6d0be76fe018288a7431785a52f8e5c37d9", "title": "Deciphering the dynamics of distorted turbulent flows: Lagrangian particle tracking and chaos prediction through transformer-based deep learning models"}, {"paperId": "67bd3ca3f936bc0e65a7cfc19777084f3fa8de66", "title": "Improving aircraft performance using machine learning: a review"}, {"paperId": "b7b736a30a31e6dad7d330e1d97f56130b63397f", "title": "Machine learning adaptation for laminar and turbulent flows: applications to high order discontinuous Galerkin solvers"}]}
