{"paperId": "2f7777e49476a4af1b862423882bf2ff5f144424", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Hybrid Chain: Blockchain Enabled Framework for Bi-Level Intrusion Detection and Graph-Based Mitigation for Security Provisioning in Edge Assisted IoT Environment", "abstract": "Internet of Things (IoT) is an emerging technology and its applications are flattering amidst many users, as it makes everything easier. As a consequence of its massive growth, security and privacy are becoming crucial issues where the IoT devices are perpetually vulnerable to cyber-attacks. To overcome this issue, intrusion detection and mitigation is accomplished which enhances the security in IoT networks. In this paper, we proposed Blockchain entrenched Bi-level intrusion detection and graph based mitigation framework named as HybridChain-IDS. The proposed work embrace four sequential processes includes time-based authentication, user scheduling and access control, bi-level intrusion detection and attack graph generation. Initially, we perform time-based authentication to authenticate the legitimate users using NIK-512 hashing algorithm, password and registered time are stored in Hybridchain which is an assimilation of blockchain and Trusted Execution Environment (TEE) which enhances data privacy and security. After that, we perform user scheduling using Cheetah Optimization Algorithm (COA) which reduces the complexity and then the access control is provided to authorized users by smart contract by considering their trust and permission level. Then, we accomplish bi-level intrusion detection using ResCapsNet which extracts sufficient features and classified effectively. Finally, risk of the attack is evaluated, and then the attacks graphs are generated by employing Enhanced k-nearest neighbor (KNN) algorithm to identify the attack path. Furthermore, the countermeasures are taken based on the attack risk level and the attack graph is stored in Hybridchain for eventual attack prediction. The implementation of this proposed work is directed by network simulator of NS-3.26 and the performance of the proposed HybridChain-IDS is enumerated based on various performance metrics.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "27433-27449", "volume": "11"}, "authors": [{"authorId": "98180310", "name": "Ahmed A. M. Sharadqh"}, {"authorId": "67217551", "name": "H. Hatamleh"}, {"authorId": "52066016", "name": "A. Alnaser"}, {"authorId": "1476823585", "name": "S. S. Saloum"}, {"authorId": "32330480", "name": "Tareq A. Alawneh"}], "citations": [{"paperId": "107e9a8f862523cdb13a0f6c29d94673a9c3cc93", "title": "Intelligent Intrusion Detection System Based on Blockchain Technology"}, {"paperId": "ca6accc59b449ddc801784f55516bb4eecda7428", "title": "Analysis of the \"Dandruff Attack\" on the Tron Network: Risks, Damage Assessment, and Solutions"}, {"paperId": "801bdae8691160a732e959ce9a4276ead4a92ac7", "title": "Blockchain-Based Information Sharing Security for the Internet of Things"}, {"paperId": "b261dbe81824f9ae5106876cbf763e179352cf14", "title": "MAC Protocol Based IoT Network Intrusion Detection Using Improved Efficient Shuffle Bidirectional COOT Channel Attention Network"}, {"paperId": "f4e3d4f276442f9e7903b0971df8201bd3304b65", "title": "Systematic review and meta-analysis Detecting lateral movement: A systematic survey"}]}
