{"paperId": "2f8253a36ec7217246ee48bd41492df22ae85d72", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "The pathway of digital learning environments in advancing Sustainable Development Goals (SDGs): A Bibliometric analysis covering three decades of research", "abstract": "A digital learning environment can play a pivotal role in advancing the objectives of Goal 4 and, in doing so, can contribute to several other SDGs. This study purposed to investigate the impact of digital learning on sustainable growth in institutions by emphasizing the educational procedures that were implemented in extended years (three decades) throughout the global and broader countries. Furthermore, this research also analyzes the challenges and opportunities for digital learning in educational institutions, primarily to support the SDGs This research employs a descriptive bibliometric analysis, utilizing Scopus as the primary data source. The research findings indicate a consistent upward trend in publication rates each year, with articles being the most prevalent document type, followed by conference papers. Potential areas for future research include the integration of e-learning practices into various educational levels, from universities to high schools and early education. Additionally, there are opportunities to investigate the development of innovative learning techniques and the emergence of computer-assisted learning as an educational system. Notably, the most influential studies fall within the Q1 category. The implications of this research extend to providing a comprehensive overview of trends in DLE publications from 1993 to 2022 and their potential contributions to the SDGs. Furthermore, future researchers can build upon these findings to develop and enhance digital learning environments in educational contexts, ultimately contributing to the attainment of SDG goals.", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2176565773", "name": "H. V. Saphira"}, {"authorId": "73091586", "name": "B. Prahani"}, {"authorId": "2253833434", "name": "Eko Hariyono"}, {"authorId": "2242098660", "name": "Firmanul Catur Wibowo"}, {"authorId": "83447138", "name": "M. A. H. Bunyamin"}, {"authorId": "2269573209", "name": "Sugeng Wahono"}], "citations": []}
