{"paperId": "2f8fea869d2d2e7a1b6f683863eb90b659025e8f", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "DESCN: Deep Entire Space Cross Networks for Individual Treatment Effect Estimation", "abstract": "Causal Inference has wide applications in various areas such as E-commerce and precision medicine, and its performance heavily relies on the accurate estimation of the Individual Treatment Effect (ITE). Conventionally, ITE is predicted by modeling the treated and control response functions separately in their individual sample spaces. However, such an approach usually encounters two issues in practice, i.e. divergent distribution between treated and control groups due to treatment bias, and significant sample imbalance of their population sizes. This paper proposes Deep Entire Space Cross Networks (DESCN) to model treatment effects from an end-to-end perspective. DESCN captures the integrated information of the treatment propensity, the response, and the hidden treatment effect through a cross network in a multi-task learning manner. Our method jointly learns the treatment and response functions in the entire sample space to avoid treatment bias and employs an intermediate pseudo treatment effect prediction network to relieve sample imbalance. Extensive experiments are conducted on a synthetic dataset and a large-scaled production dataset from the E-commerce voucher distribution business. The results indicate that DESCN can successfully enhance the accuracy of ITE estimation and improve the uplift ranking performance. A sample of the production dataset and the source code are released to facilitate future research in the community, which is, to the best of our knowledge, the first large-scale public biased treatment dataset for causal inference.", "venue": "Knowledge Discovery and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-07-19", "journal": {"name": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2177339115", "name": "Kailiang Zhong"}, {"authorId": "74187619", "name": "Fengtong Xiao"}, {"authorId": "1565743384", "name": "Yan Ren"}, {"authorId": "2177240824", "name": "Yaorong Liang"}, {"authorId": "48215879", "name": "Wenqing Yao"}, {"authorId": "2143759379", "name": "Xiaofeng Yang"}, {"authorId": "1505825169", "name": "Ling Cen"}], "citations": [{"paperId": "df14b6d35b85b4d8a316b086c220e9b5c40f56a6", "title": "Entire Chain Uplift Modeling with Context-Enhanced Learning for Intelligent Marketing"}, {"paperId": "42e65c89a41b683aee02e9bcc01b669d073f6f98", "title": "CANDY: A Causality-Driven Model for Hotel Dynamic Pricing"}, {"paperId": "930dfe2c7e644d3647ef4ee4ebb0a6842aea2125", "title": "Active and Passive Causal Inference Learning"}, {"paperId": "12de56f35c6090ddb416869168230b928b8d14ed", "title": "Pareto Invariant Representation Learning for Multimedia Recommendation"}, {"paperId": "d10f34cb9b42efb8bbad3365c682700102262de4", "title": "Who Should Be Given Incentives? Counterfactual Optimal Treatment Regimes Learning for Recommendation"}, {"paperId": "9dfe11fafe81ced965c0c0c3c3f8ade6fd88d1f9", "title": "Explicit Feature Interaction-aware Uplift Network for Online Marketing"}, {"paperId": "ce5d0a8abe1574508ce8475b4916029bb750abf1", "title": "A Survey of Deep Causal Models and Their Industrial Applications"}, {"paperId": "ecd18261dd5c2022253568852f7726bff5bc557c", "title": "A S URVEY OF D EEP C AUSAL M ODELS"}]}
