{"paperId": "2f918e0232d3b7c2cabecaaa7edc976e068ce0c6", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Upvotes? Downvotes? No Votes? Understanding the relationship between reaction mechanisms and political discourse on Reddit", "abstract": "A significant share of political discourse occurs online on social media platforms. Policymakers and researchers try to understand the role of social media design in shaping the quality of political discourse around the globe. In the past decades, scholarship on political discourse theory has produced distinct characteristics of different types of prominent political rhetoric such as deliberative, civic, or demagogic discourse. This study investigates the relationship between social media reaction mechanisms (i.e., upvotes, downvotes) and political rhetoric in user discussions by engaging in an in-depth conceptual analysis of political discourse theory. First, we analyze 155 million user comments in 55 political subforums on Reddit between 2010 and 2018 to explore whether users’ style of political discussion aligns with the essential components of deliberative, civic, and demagogic discourse. Second, we perform a quantitative study that combines confirmatory factor analysis with difference in differences models to explore whether different reaction mechanism schemes (e.g., upvotes only, upvotes and downvotes, no reaction mechanisms) correspond with political user discussion that is more or less characteristic of deliberative, civic, or demagogic discourse. We produce three main takeaways. First, despite being “ideal constructs of political rhetoric,” we find that political discourse theories describe political discussions on Reddit to a large extent. Second, we find that discussions in subforums with only upvotes, or both up- and downvotes are associated with user discourse that is more deliberate and civic. Third, and perhaps most strikingly, social media discussions are most demagogic in subreddits with no reaction mechanisms at all. These findings offer valuable contributions for ongoing policy discussions on the relationship between social media interface design and respectful political discussion among users.1", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-02-19", "journal": {"name": "Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "20985588", "name": "O. Papakyriakopoulos"}, {"authorId": "66181683", "name": "Severin Engelmann"}, {"authorId": "2143255336", "name": "Amy Winecoff"}], "citations": [{"paperId": "3cdc641e767982eab5855f9c94f201a82ef9b93a", "title": "Wikibench: Community-Driven Data Curation for AI Evaluation on Wikipedia"}, {"paperId": "6475cc4052e4778f6fb098ea9993018f545b6bf9", "title": "Measuring the Rise and Fall of a Subreddit using Text Analytics: The Life Course of r/Antiwork"}, {"paperId": "366d30c6fec367129d21088ba64a6f94ee3583eb", "title": "Narratives of War: Ukrainian Memetic Warfare on Twitter"}, {"paperId": "97175ec18d59490f831cf42caceaa228a5406f85", "title": "Building the Epistemic Community of AI Safety"}]}
