{"paperId": "2f957a21cdd1b20e35e619d85b57374456f651d2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "COPP-DDPG: Computation Offloading with Privacy Preservation in a Vehicular Edge Network", "abstract": "Vehicular edge computing (VEC) is emerging as a prospective technology in the era of 5G and beyond to support delay-sensitive and computation-intensive vehicular applications. However, designing an efficient approach for joint computation offloading and resource allocation is challenging due to the limited resources of VEC servers, the highly dynamic vehicular networks (VNs), different priorities of vehicular applications, and the threat of privacy disclosure. In this work, we propose a cooperative optimization for privacy-preserving and priority-aware offloading and resource allocation in VEC network (VECN) based on deep reinforcement learning (DRL). Firstly, we employed a privacy-preserving framework where the certificate authority (CA) is integrated into the VEC architecture. Furthermore, we formulated the dynamic optimization problem as a Markov decision process (MDP) by constructing a weighted cost function that integrates the priority of stochastic arrival tasks, privacy-preserving of offloading, and dynamic interaction between the edge servers and intelligent connected vehicles (ICVs). To solve this problem, a cooperative optimization for privacy and priority based on deep deterministic policy gradient (COPP-DDPG) is proposed by learning the optimal actions to minimize the weighted cost function. The simulation results show that COPP-DDPG has good convergence and outperforms the other four comparison algorithms in many aspects.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-07", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2115944494", "name": "Yancong Wang"}, {"authorId": "2152768002", "name": "Jian Wang"}, {"authorId": "2503442", "name": "Hongchang Ke"}, {"authorId": "29769448", "name": "Zemin Sun"}], "citations": []}
