{"paperId": "2f9650d7ec4cd35b93fdaa95dc9d02f5ef0cd04a", "publicationVenue": {"id": "7bf51cb8-4a54-4bc9-919c-8f67d9f7d0ae", "name": "International Conference on Information Security and Cryptology", "type": "conference", "alternate_names": ["IEEE Int Conf Intell Syst Control", "ICISC", "IEEE International Conference on Intelligent Systems and Control", "Int Conf Inf Secur Cryptol"], "url": "http://www.wikicfp.com/cfp/program?id=1397"}, "title": "A survey on miscellaneous attacks in Hadoop framework", "abstract": "The world is progressing towards innovative advancement step by step bringing about an exponential rise in data. This enormous volume of data has presented the possibility of Big data, which has caught the consideration of business and IT researchers as a gift and a source of various opportunities for extensive associations. Securing this enormous measure of information has turned into an extraordinary concern in the field of data and communication technology. Hadoop, as an open-source distributed computing and Big data framework, is progressively utilized as a part of the business world, however the imperfection of security mechanism now ends up noticeably one of the fundamental issues obstructing its improvement. This paper depicts the different attack in detail which is possible on the Hadoop framework. The objective of this paper is to draw out an overview on the security risk and their identification technique in the Hadoop environment.", "venue": "International Conference on Information Security and Cryptology", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": null, "journal": {"name": "2018 2nd International Conference on Inventive Systems and Control (ICISC)", "pages": "1043-1048"}, "authors": [{"authorId": "50977864", "name": "Akshay Kumar Suman"}, {"authorId": "4955101", "name": "Manasi Gyanchandani"}, {"authorId": "50474755", "name": "Priyank Jain"}], "citations": [{"paperId": "3eef534549660521ceb21c2962c5250d07cfc699", "title": "Comparative Survey on Big data Security Applications, A Blink on Interactive Security Mechanism in Apache Ozone"}, {"paperId": "a6be34eb8dcb23b5aab003ac6fc4def3e23be62d", "title": "Internet Traffic Analysis: MapReduce based Traffic Flow Classification in Hadoop Environment"}]}
