{"paperId": "2fa7034906676ddb602355854620031a79c94788", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Wearable Technologies and AI at the Far Edge for Chronic Heart Failure Prevention and Management: A Systematic Review and Prospects", "abstract": "Smart wearable devices enable personalized at-home healthcare by unobtrusively collecting patient health data and facilitating the development of intelligent platforms to support patient care and management. The accurate analysis of data obtained from wearable devices is crucial for interpreting and contextualizing health data and facilitating the reliable diagnosis and management of critical and chronic diseases. The combination of edge computing and artificial intelligence has provided real-time, time-critical, and privacy-preserving data analysis solutions. However, based on the envisioned service, evaluating the additive value of edge intelligence to the overall architecture is essential before implementation. This article aims to comprehensively analyze the current state of the art on smart health infrastructures implementing wearable and AI technologies at the far edge to support patients with chronic heart failure (CHF). In particular, we highlight the contribution of edge intelligence in supporting the integration of wearable devices into IoT-aware technology infrastructures that provide services for patient diagnosis and management. We also offer an in-depth analysis of open challenges and provide potential solutions to facilitate the integration of wearable devices with edge AI solutions to provide innovative technological infrastructures and interactive services for patients and doctors.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "89260460", "name": "A. Shumba"}, {"authorId": "3018189", "name": "Teodoro Montanaro"}, {"authorId": "2384354", "name": "Ilaria Sergi"}, {"authorId": "2205368997", "name": "Alessia Bramanti"}, {"authorId": "2241375254", "name": "Michele Ciccarelli"}, {"authorId": "1642635825", "name": "A. Rispoli"}, {"authorId": "3561658", "name": "A. Carrizzo"}, {"authorId": "2280337963", "name": "Massimo de Vittorio"}, {"authorId": "2313037", "name": "L. Patrono"}], "citations": [{"paperId": "37ea241195c3372f64587d53fb65b6216999e7d9", "title": "A comprehensive review on efficient artificial intelligence models for classification of abnormal cardiac rhythms using electrocardiograms"}, {"paperId": "ee1390a871c7269b40b173666d805f228f21b0f6", "title": "Rational Design of Flexible Mechanical Force Sensors for Healthcare and Diagnosis"}, {"paperId": "bf8d9004b08de43ed91ddef6c0573bbcff25a621", "title": "Bibliometric Analysis of Application of Artificial Intelligence in Heart Disease: 2013 to 2023"}]}
