{"paperId": "2fa703ff3b4f0a1eea169e67f43016155f07e220", "publicationVenue": null, "title": "Design and implementation of algorithm execution time predictor for remote sensing product workflow", "abstract": "Remote sensing product production is an important task in the field of remote sensing engineering. Compared with the production process of remote sensing products, the implementation process of remote sensing product production is a multi-task serial and highly concurrent process that integrates a large number of remote sensing digital image processing algorithms and various processes. Remote sensing product workflows transform complex computing tasks into processes that can be described, managed, and automated. In the workflow, algorithms are the smallest execution unit of tasks, and their execution time has a significant impact on the performance and efficiency of the entire workflow. Therefore, accurate prediction of algorithm execution time is crucial for optimizing workflow performance. This paper proposes and designs an algorithm execution time predictor for remote sensing product workflows. Firstly, feature extraction algorithms are used to extract features from algorithm execution logs, and the prediction model suitable for this scenario is determined by analyzing the characteristics of operators in remote sensing product workflows. Then, the model is trained using historical data sets, and the test set results are compared with the actual execution time to verify the accuracy and practicality of the model. Experimental results show that the proposed algorithm execution time predictor outperforms the baseline model in terms of prediction accuracy and time efficiency", "venue": "Conference on Advanced Algorithms and Signal Image Processing", "year": 2023, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Conference"], "publicationDate": "2023-10-10", "journal": {"pages": "127991C - 127991C-7", "volume": "12799"}, "authors": [{"authorId": "2257514136", "name": "Bing Zhou"}, {"authorId": "2257373143", "name": "Qiong Wu"}, {"authorId": "2257095461", "name": "Jiaguo Li"}], "citations": []}
