{"paperId": "2fb150b1599759c8d185e0882b8cc45b11518e17", "publicationVenue": {"id": "e6b7b34e-781a-4646-ace5-b444240e1ea7", "name": "Shock and Vibration", "type": "journal", "alternate_names": ["Shock Vib"], "issn": "1070-9622", "url": "https://www.hindawi.com/journals/sv/", "alternate_urls": ["http://content.iospress.com/journals/shock-and-vibration", "https://www.iospress.nl/"]}, "title": "Learning Transferable Convolutional Proxy by SMI-Based Matching Technique", "abstract": "Domain-transfer learning is a machine learning task to explore a source domain data set to help the learning problem in a target domain. Usually, the source domain has sufficient labeled data, while the target domain does not. In this paper, we propose a novel domain-transfer convolutional model by mapping a target domain data sample to a proxy in the source domain and applying a source domain model to the proxy for the purpose of prediction. In our framework, we firstly represent both source and target domains to feature vectors by two convolutional neural networks and then construct a proxy for each target domain sample in the source domain space. The proxy is supposed to be matched to the corresponding target domain sample convolutional representation vector well. To measure the matching quality, we proposed to maximize their squared-loss mutual information (SMI) between the proxy and target domain samples. We further develop a novel neural SMI estimator based on a parametric density ratio estimation function. Moreover, we also propose to minimize the classification error of both source domain samples and target domain proxies. The classification responses are also smoothened by manifolds of both the source domain and proxy space. By minimizing an objective function of SMI, classification error, and manifold regularization, we learn the convolutional networks of both source and target domains. In this way, the proxy of a target domain sample can be matched to the source domain data and thus benefits from the rich supervision information of the source domain. We design an iterative algorithm to update the parameters alternately and test it over benchmark data sets of abnormal behavior detection in video, Amazon product reviews sentiment analysis, etc.", "venue": "Shock and Vibration", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-10-14", "journal": {"name": "Shock and Vibration"}, "authors": [{"authorId": "2112342984", "name": "Wei Jin"}, {"authorId": "2066031528", "name": "Nan Jia"}], "citations": []}
