{"paperId": "2fb558748a7f64e8a7d6795b38648cae2bf95ddd", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Accelerating Complex Analytics using Speculation", "abstract": "Analytical applications, such as exploratory data analysis and decision support, process complex workloads that include sequences of inter-dependent queries. While modern OLAP systems exploit data parallelism, dependencies force execution ordering constraints that severely limit task parallelism. The serialization of tasks leads to long query response times and under-utilization of resources. We propose a new query processing paradigm that accelerates inter-dependent queries using speculation. As when used in OLTP or in computer micro-architecture, speculative execution helps increase parallelism and improve scheduling efficiency. Nevertheless, analytics present unique challenges in making the right speculative execution decisions, in validating predictions and in repairing results. We enable fast and accurate predictions through approximate query processing (AQP), and efficiently validate speculations through a new streaming join operator. In case of mispredictions we do not discard progress, but apply corrective actions to incrementally repair the result. Our experiments over the TPC-DS benchmark show that, even though speculation adds work, it improves task parallelism, queries run faster, and more importantly, the speedup is increased as a function of query complexity.", "venue": "Conference on Innovative Data Systems Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3416158", "name": "Panagiotis Sioulas"}, {"authorId": "2057858492", "name": "Viktor Sanca"}, {"authorId": "2677459", "name": "Ioannis Mytilinis"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "0b9584de2f1a5e4f2ea65cee5867a1cbf22ce129", "title": "LAQy: Efficient and Reusable Query Approximations via Lazy Sampling"}, {"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics"}, {"paperId": "2945b18928a36ac1a42f1b8bc1ecdd67056d1a1e", "title": "Sampling-Based AQP in Modern Analytical Engines"}, {"paperId": "240f7bb2726b06f0c7ba1b8458e70b0c3c0259d4", "title": "Enhancing the Interactivity of Dataframe Queries by Leveraging Think Time"}, {"paperId": "34efce39ddd4ea592ccb1e5f5c83c32f8f64fe86", "title": "Improving K-means Clustering Using Speculation"}, {"paperId": "13d9af4cc7fa0b480999bdb859243c87f9670d31", "title": "Boosting Efficiency of External Pipelines by Blurring Application Boundaries"}]}
