{"paperId": "2fc5a8e129cb23acf782b5618d39fc62efcb3c01", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Blockchain-Based Authentication in Internet of Vehicles: A Survey", "abstract": "Internet of Vehicles (IoV) has emerged as an advancement over the traditional Vehicular Ad-hoc Networks (VANETs) towards achieving a more efficient intelligent transportation system that is capable of providing various intelligent services and supporting different applications for the drivers and passengers on roads. In order for the IoV and VANETs environments to be able to offer such beneficial road services, huge amounts of data are generated and exchanged among the different communicated entities in these vehicular networks wirelessly via open channels, which could attract the adversaries and threaten the network with several possible types of security attacks. In this survey, we target the authentication part of the security system while highlighting the efficiency of blockchains in the IoV and VANETs environments. First, a detailed background on IoV and blockchain is provided, followed by a wide range of security requirements, challenges, and possible attacks in vehicular networks. Then, a more focused review is provided on the recent blockchain-based authentication schemes in IoV and VANETs with a detailed comparative study in terms of techniques used, network models, evaluation tools, and attacks counteracted. Lastly, some future challenges for IoV security are discussed that are necessary to be addressed in the upcoming research.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-11-27", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "47622655", "name": "S. Abbas"}, {"authorId": "2142000508", "name": "M. A. Talib"}, {"authorId": "73647907", "name": "Afaf Ahmed"}, {"authorId": "2086745857", "name": "Faheem Khan"}, {"authorId": "152985106", "name": "Shabir Ahmad"}, {"authorId": "122204534", "name": "Do-Hyeun Kim"}], "citations": [{"paperId": "05b12354620a3d1141b8bc6bc1704bda0a6fdc9b", "title": "Circulation of legitimate information over VANETs using threshold signature scheme"}, {"paperId": "e0a591418670bae3d2d0ae6c1ef28310e25cc826", "title": "An All-Inclusive Taxonomy and Critical Review of Blockchain-Assisted Authentication and Session Key Generation Protocols for IoT"}, {"paperId": "519bbfc14922b771dbfb1099a5cde4401ea8c579", "title": "A Design of Internet of Vehicles System Incorporating Lightweight Roadside Units and Blockchain Strategy"}, {"paperId": "67446f2b8fa3e02de70b247b3f7c9b98d892e927", "title": "Scaling A Blockchain System With Layered Architecture"}, {"paperId": "99c92029b6f35c1bf737a682fb8e6897a244b385", "title": "VANET Framework for Incident Response and Management"}, {"paperId": "e401649da642d1f244ed21f526a68a1e7612aaf5", "title": "A comparative study on blockchain-based distributed public key infrastructure for IoT applications"}, {"paperId": "56517e46f5d793b39fe6e5553bf8d9334450a558", "title": "Implementation of Blockchain Technology Across Different Domains of Dentistry: A Systematic Review"}, {"paperId": "fa691ce744c0d35fdd7b9e0b24df627621a2a3fe", "title": "A Study for Securing IoV Using Blockchain"}, {"paperId": "df5e3ac01112f7d06033458d54558d2083664ef2", "title": "Design of anonymous authentication scheme for vehicle fog services using blockchain"}, {"paperId": "3bd8be73132e151a9cd974e556511b6a9178d4fd", "title": "Knowledge Mapping with CiteSpace, VOSviewer, and SciMAT on Intelligent Connected Vehicles: Road Safety Issue"}, {"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain."}, {"paperId": "0a57260c18c9b9732a40cf98f3bb4e78a734eb91", "title": "Knowledge Development Trajectory of the Internet of Vehicles Domain Based on Main Path Analysis"}, {"paperId": "7be8b607c555aadf0089e2af5d525d5056a27550", "title": "Privacy Protection Technology for Internet of Vehicles"}, {"paperId": "38e2c7d5eecb7fd66fbcab81e71bafbdb3880bf0", "title": "Blockchain-based Authentication Scheme for Vehicle Network Nodes"}, {"paperId": "1d7ea3f322379a76477a25521c4272a4a35406f9", "title": "An Optimized Decentralized Trust Approach for Securing IoV Stream Data: A Smart Contract-Driven Framework"}, {"paperId": "97df2edec4271035bb66e42fdd4e4350f4762489", "title": "Using Stellar Consensus Protocol to Ensure the Security of Message Transmission in VANETs"}, {"paperId": "9cc28bb09365fa3d6a0be7fa2e920786736fba55", "title": "Development of a Smart Signalization for Emergency Vehicles"}, {"paperId": "ad2e19f2f678bda521f75442d3d45b84278a3b9c", "title": "Blockchain‐based internet of vehicles (BIoV): A systematic review of surveys and reviews"}, {"paperId": "6dcb777ef3064ceddf45bae3a1665aa41583dff1", "title": "NPR-LBN: next point of interest recommendation using large bipartite networks with edge and cloud computing"}, {"paperId": "a7e384545aeb411b22b6e747a226fb7870466d81", "title": "The Internet of Vehicles and Sustainability—Reflections on Environmental, Social, and Corporate Governance"}, {"paperId": "5d44c19d5d7d56297ff496356adec63078c043a5", "title": "Blockchain-Based One-Time Authentication for Secure V2X Communication Against Insiders and Authority Compromise Attacks"}, {"paperId": "e376eb73be217e5aa45aae2786b96843507d534f", "title": "RIS-Enabled Secret Key Generation for Secured Vehicular Communication in the Presence of Denial-of-Service Attacks"}, {"paperId": "aeeecc97395c8a97ab2025982afae89ceca53c20", "title": "The Potential of Blockchain Technology in Dental Healthcare: A Literature Review"}, {"paperId": "7885c699db22717ceeed8338d9dea543029da5f6", "title": "A Features-Based Privacy Preserving Assessment Model for Authentication of Internet of Medical Things (IoMT) Devices in Healthcare"}, {"paperId": "7db3c7dab3d1cc2220d0df32a97a629caf4f1972", "title": "Modeling and analysis of traffic warning message dissemination system in VANETs"}, {"paperId": "c92c93604708200495e8183c134d8eaaa6cf70b4", "title": "Persistência de dados de Redes Veiculares Ad Hoc em Blockchain"}, {"paperId": "3fd779fb6caaee970cdc88e0f7ad7750f4ef2866", "title": "Cybersecurity Awareness and Training (CAT) Framework for Remote Working Employees"}, {"paperId": "736f9cc4bd0adad85682481ab74c411518e72610", "title": "Development of a Model for Spoofing Attacks in Internet of Things"}, {"paperId": "72c2d36ec94ca00f1a7874fae94a08d72e61424b", "title": "Implementation of a Distributed Framework for Permissioned Blockchain-Based Secure Automotive Supply Chain Management"}, {"paperId": "a7cc84b5af8171b5ab3aec0ee177d6fbab1ab20a", "title": "Blockchain-Enabled Vehicular Ad Hoc Networks: A Systematic Literature Review"}, {"paperId": "4f1855b9c373b3af4c74c568b444ed9b6b491f85", "title": "An Efficient Dynamic Solution for the Detection and Prevention of Black Hole Attack in VANETs"}, {"paperId": "dd42cc7ba273254629908fee62a50fce4edc4e85", "title": "Design of a Cloud-Blockchain-based Secure Internet of Things Architecture"}, {"paperId": "8e56612d0c4b9fd0deb30a378cabde2bd6167fa5", "title": "A Lightweight Certificate Authorization and Revocation Scheme for Vehicular Ad-hoc Networks"}]}
