{"paperId": "2fdee183716352fe48494241e9249e8a6f7bd996", "publicationVenue": {"id": "24801f27-1857-45ea-bdd8-478426c32142", "name": "ACM Transactions on Storage", "type": "journal", "alternate_names": ["ACM Trans Storage"], "issn": "1553-3077", "url": "http://portal.acm.org/tos", "alternate_urls": ["https://tos.acm.org/"]}, "title": "Realizing Strong Determinism Contract on Log-Structured Merge Key-Value Stores", "abstract": "We propose Vigil-KV, a hardware and software co-designed framework that eliminates long-tail latency almost perfectly by introducing strong latency determinism. To make Get latency deterministic, Vigil-KV first enables a predictable latency mode (PLM) interface on a real datacenter-scale NVMe SSD, having knowledge about the nature of the underlying flash technologies. Vigil-KV at the system-level then hides the non-deterministic time window (associated with SSD’s internal tasks and/or write services) by internally scheduling the different device states of PLM across multiple physical functions. Vigil-KV further schedules compaction/flush operations and client requests being aware of PLM’s restrictions thereby integrating strong latency determinism into LSM KVs. We implement Vigil-KV upon a 1.92TB NVMe SSD prototype and Linux 4.19.91, but other LSM KVs can adopt its concept. We evaluate diverse Facebook and Yahoo scenarios with Vigil-KV, and the results show that Vigil-KV can reducethe tail latency of a baseline KV system by 3.19× while reducing the average latency by 34%, on average.", "venue": "ACM Transactions on Storage", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-24", "journal": {"name": "ACM Transactions on Storage", "pages": "1 - 29", "volume": "19"}, "authors": [{"authorId": "7198431", "name": "Miryeong Kwon"}, {"authorId": "2187553113", "name": "Seungjun Lee"}, {"authorId": "2179112044", "name": "Hyunkyu Choi"}, {"authorId": "2115742246", "name": "Jooyoung Hwang"}, {"authorId": "36895144", "name": "Myoungsoo Jung"}], "citations": []}
