{"paperId": "2fdf36ce41ed50edad1006578607128cbec63de2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Performability Evaluation of Load Balancing and Fail-over Strategies for Medical Information Systems with Edge/Fog Computing Using Stochastic Reward Nets", "abstract": "The aggressive waves of ongoing world-wide virus pandemics urge us to conduct further studies on the performability of local computing infrastructures at hospitals/medical centers to provide a high level of assurance and trustworthiness of medical services and treatment to patients, and to help diminish the burden and chaos of medical management and operations. Previous studies contributed tremendous progress on the dependability quantification of existing computing paradigms (e.g., cloud, grid computing) at remote data centers, while a few works investigated the performance of provided medical services under the constraints of operational availability of devices and systems at local medical centers. Therefore, it is critical to rapidly develop appropriate models to quantify the operational metrics of medical services provided and sustained by medical information systems (MIS) even before practical implementation. In this paper, we propose a comprehensive performability SRN model of an edge/fog based MIS for the performability quantification of medical data transaction and services in local hospitals or medical centers. The model elaborates different failure modes of fog nodes and their VMs under the implementation of fail-over mechanisms. Sophisticated behaviors and dependencies between the performance and availability of data transactions are elaborated in a comprehensive manner when adopting three main load-balancing techniques including: (i) probability-based, (ii) random-based and (iii) shortest queue-based approaches for medical data distribution from edge to fog layers along with/without fail-over mechanisms in the cases of component failures at two levels of fog nodes and fog virtual machines (VMs). Different performability metrics of interest are analyzed including (i) recover token rate, (ii) mean response time, (iii) drop probability, (iv) throughput, (v) queue utilization of network devices and fog nodes to assimilate the impact of load-balancing techniques and fail-over mechanisms. Discrete-event simulation results highlight the effectiveness of the combination of these for enhancing the performability of medical services provided by an MIS. Particularly, performability metrics of medical service continuity and quality are improved with fail-over mechanisms in the MIS while load balancing techniques help to enhance system performance metrics. The implementation of both load balancing techniques along with fail-over mechanisms provide better performability metrics compared to the separate cases. The harmony of the integrated strategies eventually provides the trustworthiness of medical services at a high level of performability. This study can help improve the design of MIS systems integrated with different load-balancing techniques and fail-over mechanisms to maintain continuous performance under the availability constraints of medical services with heavy computing workloads in local hospitals/medical centers, to combat with new waves of virus pandemics.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "40429857", "name": "T. Nguyen"}, {"authorId": "144431147", "name": "Iure Fé"}, {"authorId": "2068398351", "name": "C. Brito"}, {"authorId": "2241810", "name": "V. K. Kaliappan"}, {"authorId": "143691244", "name": "Eunmi Choi"}, {"authorId": "144241878", "name": "Dugki Min"}, {"authorId": "2108480751", "name": "Jae-Woo Lee"}, {"authorId": "145844148", "name": "Francisco Airton Silva"}], "citations": [{"paperId": "ccf0d7509d11cc537a551f89da4dc5a87aefb14f", "title": "Quantifying the impact of resource redundancy on smart city system dependability: a model-driven approach"}, {"paperId": "598ebdac6b3922f0f81529a8f89f341ef8652c43", "title": "Pelican optimization algorithm with blockchain for secure load balancing in fog computing"}, {"paperId": "18d4cb7617fa8cff307632bde646c3ec37dd5950", "title": "Avaliação de Desempenho de uma Arquitetura de Sistema de Monitoramento de Pacientes em Hospitais Inteligentes com Fontes de Dados Interna e Externa"}, {"paperId": "271285eb978a93d5c61d73b87f84762602269256", "title": "Availability Assessment of Internet of Medical Things Architecture using Private Cloud"}, {"paperId": "414e5a2dd5b8a91c3e077c2a2a80f429c169226c", "title": "Efficient job scheduling paradigm based on hybrid sparrow search algorithm and differential evolution optimization for heterogeneous cloud computing platforms"}, {"paperId": "afa94459e82ce2fed594a15051870fa387067e84", "title": "A Customized Energy Management System for Distributed PV, Energy Storage Units, and Charging Stations on Kinmen Island of Taiwan"}, {"paperId": "c57fbc1a079fecfb4ceecc7445aa308521bf65b8", "title": "An energy efficient and secure model using chaotic levy flight deep Q-learning in healthcare system"}, {"paperId": "09f2def0bc3cf6e2d8876b6c37267f2d281b67d1", "title": "A Comparison between Task Distribution Strategies for Load Balancing Using a Multiagent System"}, {"paperId": "9bc044be4b748c808cee062bbef3cd3dee3aa52c", "title": "Editorial: Special Issue “Edge and Fog Computing for Internet of Things Systems”"}, {"paperId": "5c1b96b435d5109f0adda9a77c454fe8b2b2e7dd", "title": "Supporting availability evaluation of a smart building monitoring system aided by fog computing"}, {"paperId": "8fe1abbf8cb7e1390d33b4a565113c3c9b111811", "title": "Load Balancing in Cloud Computing Using Meta-Heuristic Algorithm: A Review"}, {"paperId": "fe01d7d89178bcf770b2d455a02dd41b30ad3e59", "title": "Model-Driven Impact Quantification of Energy Resource Redundancy and Server Rejuvenation on the Dependability of Medical Sensor Networks in Smart Hospitals"}, {"paperId": "4a4a83c32e8c900f36e5a8a1dd1098d1bfe9576d", "title": "Cloud-Internet of Health Things (IOHT) Task Scheduling Using Hybrid Moth Flame Optimization with Deep Neural Network Algorithm for E Healthcare Systems"}]}
