{"paperId": "2fe21f34b59119788f7dd4814e6ac5f4f460dff8", "publicationVenue": {"id": "27235614-bd3e-4d6b-be38-5ede18f4e209", "name": "IEEE Wireless Communications and Networking Conference", "type": "conference", "alternate_names": ["IEEE Wirel Commun Netw Conf", "WCNC", "Wireless Communications and Networking Conference", "Wirel Commun Netw Conf"], "url": "http://www.ieee-wcnc.org/"}, "title": "Joint Classification of IoT Devices and Relations in the Internet with Network Traffic", "abstract": "With the rapid growth and popularization of Internet of Things (IoT), more and more devices are deployed in homes, enterprises, cities, etc. The existed methods to classify types and relations of devices are usually two separate tasks. So, it is difficult to quickly provide attributes of devices in the smart network for operators at the same time. At this situation, the paper presents a framework JCIDR for Joint Classification of IoT Device and Relations In the Internet with Network Traffic. By fusing the numerical features and binary image features of traffic, the devices and relations of devices can be recognized simultaneously. The experiment is carried out in a real IoT environment and the accuracy of JCIDR is over 86% with about half time reduction. Therefore, JCIDR could provide operators with a fast, easy, low-cost network device monitoring method without professional equipment or protocols.", "venue": "IEEE Wireless Communications and Networking Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-10", "journal": {"name": "2022 IEEE Wireless Communications and Networking Conference (WCNC)", "pages": "560-565"}, "authors": [{"authorId": "1935291279", "name": "Yimo Ren"}, {"authorId": "46382448", "name": "Hong Li"}, {"authorId": "2153556963", "name": "Min Xu"}, {"authorId": "2059068676", "name": "G. Xiong"}, {"authorId": "2115993047", "name": "Shuqin Zhang"}, {"authorId": "2052222", "name": "Hongsong Zhu"}, {"authorId": "2110651504", "name": "Limin Sun"}], "citations": [{"paperId": "cd25329ad8ccba84ad05907a048a7b9720eabf76", "title": "HSGAN-IoT: A hierarchical semi-supervised generative adversarial networks for IoT device classification"}]}
