{"paperId": "2febd636f23c975ab95fd58682f8b0396e7c656b", "publicationVenue": {"id": "142347a8-a3f6-4ce4-bc56-09bc8fc9461d", "name": "Frontiers in Medicine", "type": "journal", "alternate_names": ["Frontiers of Medicine", "Front Med", "Fronteras en Medicina"], "issn": "2296-858X", "alternate_issns": ["2095-0217", "2618-2459"], "url": "https://www.frontiersin.org/journals/medicine", "alternate_urls": ["https://link.springer.com/journal/volumesAndIssues/11684", "http://link.springer.com/journal/11684", "http://www.frontiersin.org/Medicine", "http://journal.frontiersin.org/journal/medicine", "http://www.fronteras.com.ar/"]}, "title": "Data Integration Challenges for Machine Learning in Precision Medicine", "abstract": "A main goal of Precision Medicine is that of incorporating and integrating the vast corpora on different databases about the molecular and environmental origins of disease, into analytic frameworks, allowing the development of individualized, context-dependent diagnostics, and therapeutic approaches. In this regard, artificial intelligence and machine learning approaches can be used to build analytical models of complex disease aimed at prediction of personalized health conditions and outcomes. Such models must handle the wide heterogeneity of individuals in both their genetic predisposition and their social and environmental determinants. Computational approaches to medicine need to be able to efficiently manage, visualize and integrate, large datasets combining structure, and unstructured formats. This needs to be done while constrained by different levels of confidentiality, ideally doing so within a unified analytical architecture. Efficient data integration and management is key to the successful application of computational intelligence approaches to medicine. A number of challenges arise in the design of successful designs to medical data analytics under currently demanding conditions of performance in personalized medicine, while also subject to time, computational power, and bioethical constraints. Here, we will review some of these constraints and discuss possible avenues to overcome current challenges.", "venue": "Frontiers in Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-01-25", "journal": {"name": "Frontiers in Medicine", "volume": "8"}, "authors": [{"authorId": "1404227305", "name": "M. Martínez-García"}, {"authorId": "1399686787", "name": "E. Hernández-Lemus"}], "citations": [{"paperId": "3383c82d39b88e5349d345e32e879806bd72d435", "title": "FairCare: Adversarial training of a heterogeneous graph neural network with attention mechanism to learn fair representations of electronic health records"}, {"paperId": "4bc8bea6082f6b0ecea329ad7c742f05f31d9545", "title": "Revolutionizing Kidney Transplantation: Connecting Machine Learning and Artificial Intelligence with Next-Generation Healthcare—From Algorithms to Allografts"}, {"paperId": "5e4c99573d25a4fba9ebe3a94fbb399229fe4d86", "title": "Just how transformative will AI/ML be for immuno-oncology?"}, {"paperId": "56fc401140e6511d6e1e6f67b56c1a7f8396c5fb", "title": "Advancing Precision Medicine: A Review of Innovative In Silico Approaches for Drug Development, Clinical Pharmacology and Personalized Healthcare"}, {"paperId": "5a5eec4921912b3b7f21b938ed76a8e81a1531c8", "title": "Analyses and Concerns in Precision Medicine: A Statistical Perspective"}, {"paperId": "b3fd59f06693c3f324f8e08834fc1176d042eda9", "title": "Police and hospital data linkage for traffic injury surveillance: A systematic review."}, {"paperId": "798bcacb29a88c27b2fc6cc84a33608388495464", "title": "Harnessing the Stem Cell Niche in Regenerative Medicine: Innovative Avenue to Combat Neurodegenerative Diseases"}, {"paperId": "57ca93715057ac6aa2f212ea7a3a25bacaeffcdc", "title": "Machine Learning Approaches to Predict Asthma Exacerbations: A Narrative Review"}, {"paperId": "7f089c6aeef9c3ba2097a5ea23b6312ae953ef88", "title": "Exploring the effectiveness of machine learning algorithms for early detection of Type-2 Diabetes Mellitus"}, {"paperId": "85c6286b606a5f11a3bee6d9597ce41f9dc7c074", "title": "The promise of data science for health research in Africa"}, {"paperId": "19ea069aafa49b482755b37db075119e268d7a2e", "title": "A Template for Translational Bioinformatics: Facilitating Multimodal Data Analyses in Preclinical Models of Neurological Injury"}, {"paperId": "6beacbfca29a5f11d5e65671d48e171960969cbd", "title": "Omics-Based Investigations of Breast Cancer"}, {"paperId": "a056139c2f699a434506374aac5254dc8eb27077", "title": "Machine Learning in Clinical Text Classification: Specialty Identification and COVID-19 Risk"}, {"paperId": "6f3f3ca41b9ef58c202ef92749ea5f9b5bb99fc8", "title": "More Explorations Needed to Assess Matrix Metalloproteinase 7 Expression When Predicting the Pathologic Response to Neoadjuvant Therapy for Pancreatic Ductal Adenocarcinoma."}, {"paperId": "38154d919b4942d7590a7c55c2bbf5b2064bb91b", "title": "Improving child health through Big Data and data science"}, {"paperId": "bbcb6acaa2883d143746d596ca79c7bdb2c67e58", "title": "Narrative Review of Machine Learning in Rheumatic and Musculoskeletal Diseases for Clinicians and Researchers: Biases, Goals, and Future Directions"}, {"paperId": "0ca04fd781d99da18d4a8b2b49909e7aa7f71cd7", "title": "Type 2 Diabetes Mellitus: Early Detection using Machine Learning Classification"}, {"paperId": "79386a2325de97fd2afd925032976fe8be971561", "title": "Toward disease diagnosis visual support bridging classic and precision medicine"}, {"paperId": "0410b1a31c867075d6e91545dcc200aeca20b5a7", "title": "Computer Ontology of Mathematical Models of Cyclic Space-Time Structure Signals"}, {"paperId": "8209e793decf3f7af2e39bb520fc8999cce14467", "title": "Environmental Justice and the Use of Artificial Intelligence in Urban Air Pollution Monitoring"}, {"paperId": "89acea1650c6429ffb8969e540d00ad6909340dd", "title": "Data analytics in healthcare: A review of patient-centric approaches and healthcare delivery"}]}
