{"paperId": "2ff74c0cab30c7615c49e6445a1f4f93aa0e7237", "publicationVenue": {"id": "69d79d4c-49aa-4c2b-b616-80100a634f67", "name": "Networks", "type": "conference", "alternate_names": ["IFIP TC6 Work Conf Comput Netw Archit Appl", "NETWORKS", "IFIP TC6 Working Conference on Computer Networks, Architecture and Applications"], "issn": "0028-3045", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/32046", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10970037"]}, "title": "Robust network function virtualization", "abstract": "Network function virtualization (NFV) enables on‐demand network function (NF) deployment providing agile and dynamic network services. Through an evaluation metric that quantifies the minimal reliability among all NFs for all demands, service providers and operators may better facilitate flexible NF service recovery and migration, thus offering higher service reliability. In this paper, we present evaluation metrics on NFV reliability and solution approaches to solve robust NFV under random NF‐enabled node failure(s). We demonstrate how to construct an auxiliary NF‐enabled network and its mapping onto the physical substrate network. With the constructed NF‐enabled network, we develop pseudo‐polynomial algorithms to solve the robust NF and SFC s − t path problems: subproblems of robust NFV. We also present approximation algorithms for robust NFV with the SFC‐Fork as the NF forwarding graph. Furthermore, we propose exact solution approaches via mixed‐integer linear programming under the general setting. Computational results show that our proposed solution approaches are capable of managing robust NFV in a large‐size network.", "venue": "Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-09", "journal": {"name": "Networks", "pages": "438 - 462", "volume": "75"}, "authors": [{"authorId": "2238412", "name": "Tachun Lin"}, {"authorId": "2149134097", "name": "Zhili Zhou"}], "citations": [{"paperId": "79ca3d8d719466c107c86201875a49ceba89c1e6", "title": "Multiobjective Optimization Model and Algorithm Based on Differential Brain Storm for Service Path Constructing"}, {"paperId": "427415e2cb5ed9e87e8fb1de2bc22b900e70aa85", "title": "In search of network resilience: An optimization‐based view"}]}
