{"paperId": "2ffcb7161d0972082a2b0f5372a72c14bf1bfb38", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Privacy-preserving Weighted Federated Learning within Oracle-Aided MPC Framework", "abstract": "This paper studies privacy-preserving weighted federated learning within the oracle-aided multi-party computation (MPC) framework. The contribution of this paper mainly comprises the following three-fold: \nIn the first fold, a new notion which we call weighted federated learning (wFL) is introduced and formalized inspired by McMahan et al.'s seminal paper. The weighted federated learning concept formalized in this paper differs from that presented in McMahan et al.'s paper since both addition and multiplication operations are executed over ciphers in our model while these operations are executed over plaintexts in McMahan et al.'s model. \nIn the second fold, an oracle-aided MPC solution for computing weighted federated learning is formalized by decoupling the security of federated learning systems from that of underlying multi-party computations. Our decoupling formulation may benefit machine learning developers to select their best security practices from the state-of-the-art security tool sets; \nIn the third fold, a concrete solution to the weighted federated learning problem is presented and analysed. The security of our implementation is guaranteed by the security composition theorem assuming that the underlying multiplication algorithm is secure against honest-but-curious adversaries.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-17", "journal": {"name": "ArXiv", "volume": "abs/2003.07630"}, "authors": [{"authorId": "35242298", "name": "Huafei Zhu"}, {"authorId": "2109962700", "name": "Zengxiang Li"}, {"authorId": "1566437527", "name": "Merivyn Cheah"}, {"authorId": "1729436", "name": "R. Goh"}], "citations": [{"paperId": "e08edf309fba3106342d96b639b4b47811f0fb7e", "title": "Blockchain-Enabled Secure and Trusted Federated Data Sharing in IIoT"}, {"paperId": "436274f982423198aeb4df0d2d9c857afe48e12a", "title": "Robust privacy‐preserving federated learning framework for IoT devices"}, {"paperId": "d9b15343325296604066fa76c111d9c0e24ef9ab", "title": "PerFED-GAN: Personalized Federated Learning via Generative Adversarial Networks"}, {"paperId": "c2364dc5d19e56d50863e6f880507adcad786a19", "title": "A survey on federated learning in data mining"}, {"paperId": "bced3380c6524e150fa478027d751786637a2fe7", "title": "A Comprehensive Survey of Privacy-preserving Federated Learning"}, {"paperId": "df1fdb44b3a21b39e8f5da18719d822fc4b2fb07", "title": "User-Level Label Leakage from Gradients in Federated Learning"}, {"paperId": "9e06f7cf7c6ec7d8daa7ea294fe47f90e1712c77", "title": "A Systematic Literature Review on Federated Learning: From A Model Quality Perspective"}, {"paperId": "11db64e648bb1e446adebe820bcaaacddbee6600", "title": "Secure and Provenance Enhanced Internet of Health Things Framework: A Blockchain Managed Federated Learning Approach"}, {"paperId": "673ba001fb546bee88daf9e6994f93d5c6cbb109", "title": "CoFED: Cross-silo Heterogeneous Federated Multi-task Learning via Co-training"}, {"paperId": "61f1e81de95648e044b5a63f01a8846c85539739", "title": "User Label Leakage from Gradients in Federated Learning"}]}
