{"paperId": "300f2ab1ed28c73ed0a80cbbe3bdcfa74a4b54da", "publicationVenue": {"id": "e53a7f00-880e-4975-9953-95f2e540dbb7", "name": "Plants", "issn": "2223-7747", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247598", "alternate_urls": ["https://www.mdpi.com/journal/plants", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247598"]}, "title": "Protein Hydrolysates from Animal or Vegetal Sources Affect Morpho-Physiological Traits, Ornamental Quality, Mineral Composition, and Shelf-Life of Chrysanthemum in a Distinctive Manner", "abstract": "Protein hydrolysates (PHs) are a prominent category of plant biostimulants, mainly constituted of amino acids, oligopeptides and polypeptides, obtained by partial hydrolysis of animal or plant protein sources. Despite scientific evidence supporting the biostimulant action of PHs on vegetables, the morphological, physiological, and shelf-life performances underlying the PH action on cut flowers are still poorly explored. Accordingly, the aim of this research is to assess the effects of three commercial biostimulants, one animal PH (PH A, Hicure®) and two plant PHs (PH V1, Trainer® and PH V2, Vegamin©), on two chrysanthemum (Chrysanthemum morifolium) cultivars (Pinacolada and Radost). In both cultivars, only the plant-derived PH (V1 and V2) treatments recorded significantly higher fresh plant biomass than the control (on average +18%, in both cultivars). The foliar application of the vegetal-derived PHs but not the animal one, particularly in Pinacolada, improved the status of plants, stimulating stem elongation and the apical flower diameter. In Pinacolada, applications with PH V1 resulted in a significant increase in nitrate and P concentration in leaves and Ca content in flowers compared with the control (+43%, +27%, and +28% for nitrate, P, and Ca, respectively). In Radost, PH A and PH V2 applications caused a significant reduction in nitrate concentration in both leaves and flowers compared with the control. One week after harvest, in both cultivars, PH A applications caused flower stems to wilt faster than the control. In contrast, plants treated with PH V1 revealed significantly slower flower stem senescence compared to the control. Flower wilting during vase life was correlated to a decrease in the K-to-Na ratio in flowers due to an inability to transport K to the flowers from the leaves rather than an increase in Na in the flowers themselves.", "venue": "Plants", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "Plants", "volume": "11"}, "authors": [{"authorId": "145793619", "name": "P. Carillo"}, {"authorId": "15002541", "name": "A. Pannico"}, {"authorId": "30020292", "name": "C. Cirillo"}, {"authorId": "1705344145", "name": "M. Ciriello"}, {"authorId": "36995045", "name": "G. Colla"}, {"authorId": "39085013", "name": "M. Cardarelli"}, {"authorId": "134708126", "name": "S. De Pascale"}, {"authorId": "5518481", "name": "Y. Rouphael"}], "citations": [{"paperId": "5dc58a589734b318afca0193aa72c90b04ca054a", "title": "Preharvest calcium application boosts the biostimulatory effect of protein hydrolysate by improving the postharvest life of gerbera cut flower"}, {"paperId": "7abd31293d182a8bfd5f302c882ecee7f169d72e", "title": "Amino Acids Biostimulants and Protein Hydrolysates in Agricultural Sciences"}, {"paperId": "cf282783a0130d0788e8a12e049fc525390c3ce2", "title": "Nanobubbles in vase water inhibit transpiration and prolong the vase life of cut chrysanthemum flowers"}, {"paperId": "084066a9ac4a034109e2281f480fa0420ce107f1", "title": "The use of biostimulants to control damage by high temperatures on the growth and flowering of potted cyclamen grown during summer under a Mediterranean greenhouse"}, {"paperId": "3557157777b402b14d17b1d310c0956eb342453d", "title": "Modulation of Morpho-Physiological and Metabolic Profiles of Lettuce Subjected to Salt Stress and Treated with Two Vegetal-Derived Biostimulants"}, {"paperId": "7f4e8207efc35d957b3a2e0cf22eaadfdb664e34", "title": "Peptides, new tools for plant protection in eco-agriculture"}, {"paperId": "0c9cee6ff70878c89ff14e72709c134c0e44f3ce", "title": "A novel biostimulant from chitosan nanoparticles and microalgae-based protein hydrolysate: Improving crop performance in tomato"}]}
