{"paperId": "30174241c53d2d52b0241459f8305e44f9eae43c", "publicationVenue": {"id": "a59db0cb-8287-4db4-9378-0eb4c692f830", "name": "International Symposium on Service Oriented Software Engineering", "type": "conference", "alternate_names": ["IEEE International Conference on System of Systems Engineering", "Int Symp Serv Oriented Softw Eng", "International Conference on System of Systems Engineering", "SoSE", "Service Oriented Software Engineering", "Serv Oriented Softw Eng", "Int Conf Syst Syst Eng", "IEEE Int Conf Syst Syst Eng", "SOSE"]}, "title": "Comparison of Cloud Architectures for Mobile Sensor Optimization Problem Implementation", "abstract": "The field of swarm robotics has continued to grow in recent years, branching into new fields that require more complex algorithms to solve and faster response times to control. Fields such as cloud and fog computing have been used to counter this first issue, allowing agents to use a network to access systems with much higher computational abilities, but this comes at the cost of increased latency. New architectures such as the Lambda and Kappa architectures have been developed to remedy this issue, allowing for cloud computers to be used while not sacrificing response times. This paper focuses on comparing three different architectures to assess their performance on a simulated robotic swam to solve the mobile sensor optimization problem. These three architectures are a traditional robot, the Lambda architecture, and the Kappa architecture. These systems are compared based off their latency and the runtimes of different algorithms in each implementation.", "venue": "International Symposium on Service Oriented Software Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-06-01", "journal": {"name": "2020 IEEE 15th International Conference of System of Systems Engineering (SoSE)", "pages": "469-474"}, "authors": [{"authorId": "1788711319", "name": "Sean Ackels"}, {"authorId": "144685298", "name": "P. Benavidez"}, {"authorId": "1700339", "name": "Mo M. Jamshidi"}], "citations": [{"paperId": "7bf960a7cd4d60d6c42757be6af955fa31e6ed56", "title": "Computer Simulation of the Path and Control of an Intelligent Mobile Robot in Python"}]}
