{"paperId": "301eaf10c324805964cc8ffe0bb0a1dceed396c4", "publicationVenue": {"id": "d7d7587f-a1e9-46a4-9db5-54c95787c6f1", "name": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society", "type": "conference", "alternate_names": ["Int Conf IEEE Eng Med Biology Soc", "International Conference of the IEEE Engineering in Medicine and Biology Society", "EMBC", "Annu Int Conf IEEE Eng Med Biology Soc"], "issn": "2529-7856", "alternate_issns": ["2375-7477"], "url": "https://www.inscribepublications.com/journal/josa", "alternate_urls": ["http://www.sesarju.eu/sesarinnovationdays", "https://embc.embs.org/2018/"]}, "title": "A Scalable ECG Identification System Based on Locality-Sensitive Hashing", "abstract": "Electrocardiograms (ECGs) have the inherent property of being intrinsic and dynamic and are shown to be unique among individuals, making them promising as a biometric trait. Although many ECG biometric recognition approaches have demonstrated accurate recognition results in small enrollment sets, they can suffer from performance degradation when many subjects are enrolled. This study proposes an ECG biometric identification system based on locality-sensitive hashing (LSH) that can accommodate a large number of registrants while maintaining satisfactory identification accuracy. By incorporating the concept of LSH, the identity of an unknown subject can be recognized without performing vector comparisons for all registered subjects. Moreover, a kernel density estimator-based method is used to exclude unregistered subjects. The ECGs of 285 subjects from the PTB dataset were used to evaluate the proposed scheme’s performance. Experimental results demonstrated an IR and EER of 99% and 4%, respectively, when Nen/Nid = 15/3.", "venue": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 45th Annual International Conference of the IEEE Engineering in Medicine & Biology Society (EMBC)", "pages": "1-4"}, "authors": [{"authorId": "2273996395", "name": "Hui-Yu Chu"}, {"authorId": "2273971734", "name": "Tzu-Yun Lin"}, {"authorId": "2274056925", "name": "Song-Hong Lee"}, {"authorId": "2141553593", "name": "Jui-Kun Chiu"}, {"authorId": "2273988228", "name": "Cing-Ping Nien"}, {"authorId": "2182655116", "name": "Shun-Chi Wu"}], "citations": []}
