{"paperId": "3037c510cf8ffc2ee630fb9fd1aa948061671470", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Edge-AI: IoT Request Service Provisioning in Federated Edge Computing Using Actor-Critic Reinforcement Learning", "abstract": "Edge computing plays a critical role in the Internet of Things (IoT) environment as it potentially supports the time-critical IoT applications’ resources as well as latency requirements. In the near future, most edge service providers are envisioned to receive revenue from deploying these applications with the expenditures proportional to placing the offloaded requests from IoT devices and allocating the required resources. One way to maximize the edge profit and minimize the response latency is to integrate the edge nodes and form the edge federation. Therefore, edge service providers can have interoperability to distribute the IoT requests on the appropriate edge nodes in the light of providing satisfactory service levels to meet their objectives. Since the edge nodes are volatile and IoT time-critical applications are increasing, the edge nodes are envisioned to face massive traffic from IoT devices. Therefore, exploiting the traditional dynamic requests placement approaches cannot meet the SLA requirement of both IoT devices and edge service providers. In this article, we designed an intelligent reinforcement learning-based request service provisioning system (i.e., here, we call Edge-AI) as part of a smart edge orchestrator in the edge federation. We implement the proposed method, which is called DRL-Dispatcher, and compare it with greedy and random algorithms in edge federation. The experimental results show that the proposed DRL-Dispatcher performs better in terms of profit and low response latency as compared with the baseline approaches.", "venue": "IEEE transactions on engineering management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "1-10", "volume": "PP"}, "authors": [{"authorId": "49827757", "name": "Hojjat Baghban"}, {"authorId": "2805615", "name": "Amir Rezapour"}, {"authorId": "2116897141", "name": "Ching-Hsien Hsu"}, {"authorId": "28277514", "name": "Sirapop Nuannimnoi"}, {"authorId": "2110521844", "name": "Chin-Yao Huang"}], "citations": [{"paperId": "35030ee608b5e6ff9fb55cff18868ce22b1eb5c7", "title": "Auditable Homomorphic-based Decentralized Collaborative AI with Attribute-based Differential Privacy"}, {"paperId": "69fe63781479a70ccd52d5f5680d2a51206aba33", "title": "Resource-aware multi-task offloading and dependency-aware scheduling for integrated edge-enabled IoV"}, {"paperId": "47983849c96a736528cd8c22c2a976248197d865", "title": "SocialEdge: Socialized Learning-Based Request Scheduling for Edge-Cloud Systems"}, {"paperId": "15bfe71aa320dc1290d6b6fb84459aaa44d5a646", "title": "Joint computation offloading and resource allocation based on deep reinforcement learning in C-V2X edge computing"}, {"paperId": "ba9df85f417fede5f11122f55d914b6cd2232f4a", "title": "Exploring the Impact of AI on The EFL Context: A Case Study of Saudi Universities"}, {"paperId": "2f229065e7dcb15225caf4ebd0b7ee0733364605", "title": "A game-based approach for cloudlet resource pricing for cloudlet federation"}, {"paperId": "356ef8fac6fe9a4876ccec34a3852cb6361745fb", "title": "Decoding the Interplay Between Latency, Reliability, Cost, and Energy While Provisioning Resources in Fog-Computing-Enabled IoT Networks"}]}
