{"paperId": "306ca8df676da280b4ea7af86e549a794c822fdb", "publicationVenue": null, "title": "AI and Blockchain-based Secure Message Exchange Framework for Medical Internet of Things", "abstract": "With the advent of revolutionary technologies, the Internet of Things (IoT) has proved its effectiveness in the medical sector. The inclusion of sensors in IoT devices enables connectivity and facilitates the collection of valuable data for patient monitoring and effective treatment methods. Sensors are tagged with the medical equipment and foster real-time tracking of medical devices such as oxygen pumps, nebulizers, wheelchairs, etc. It collects medical data that has the patient's personal and sensitive information regarding medical history, such as heart rate, diagnosis information, drug prescription, body temperature, etc. However, the security of medical data has become a significant concern. Therefore, this paper proposes an artificial intelligence (AI) and blockchain-enabled scheme that offer cyber security to medical IoT data. Here, different machine learning (ML) classifiers, such as decision tree (DT), K-Nearest neighbor (KNN), Naive Bayes (NB), support vector machine (SVM), and gradient boosting classifier (GBC) are used to classify medical IoT data as an attack (1) and normal (0) class. Then, an IPFS-based blockchain network is used to offer security and transparency to the medical IoT data. Moreover, for evaluation, different performance metrics are considered, such as accuracy, training time, receiver operating characteristic (ROC) curve, and scalability. Among all ML classifiers, KNN achieves the highest accuracy of 95.4%.", "venue": "2023 International Conference on Network, Multimedia and Information Technology (NMITCON)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-09-01", "journal": {"name": "2023 International Conference on Network, Multimedia and Information Technology (NMITCON)", "pages": "1-6"}, "authors": [{"authorId": "2260027240", "name": "Barkha Panchal"}, {"authorId": "2259995245", "name": "Snehal Parmar"}, {"authorId": "2089503188", "name": "Tejal Rathod"}, {"authorId": "79336591", "name": "N. Jadav"}, {"authorId": "1739965103", "name": "Rajesh Gupta"}, {"authorId": "49252696", "name": "S. Tanwar"}], "citations": []}
