{"paperId": "3090d6f901a340c70e69420b57181b8af922a7ee", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Architecting Digital Twins", "abstract": "In 2002, Grieves defined the concept of the digital twin as a virtual instance of physical assets capable of continuously mirroring them. Ever since then, driven by remarkable industrial attention, digital twins flourished and ripened in several sectors. The notable industrial adoption has been sided by a growing interest from the software engineering community in general and the software architecture community in particular as demonstrated by the growing number of published peer-reviewed publications and proposed software architectural solutions for digital twins. In this paper, we report on the planning, execution, and results of a systematic mapping study on architecting digital twins. The study captures crucial aspects of software architectures for digital twins as types of architectural solutions, quality attributes, and architectural patterns. It supports practitioners in creating digital twins tailored to their specific needs and researchers in identifying trends and open challenges. Starting from an initial set of potentially relevant 1630 peer-reviewed publications, we selected 140 primary studies. We analysed the set of primary studies using thorough data extraction, analysis, and synthesis process. To compensate for single method limitations and reduce possible threats to conclusion validity, we discussed the results of our study with experts in the software architecture community. Based on our results, the field of software architecture for digital twins is lively and an increasing number of architectural solutions are being proposed. Although there is a lack of widely accepted reference architectural solutions for digital twins, most of them are built using a combination of the layered and service-oriented patterns and address maintainability, performance efficiency, and compatibility quality attributes.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2119139248", "name": "Enxhi Ferko"}, {"authorId": "1971799", "name": "Alessio Bucaioni"}, {"authorId": "46879548", "name": "M. Behnam"}], "citations": [{"paperId": "53b40b22a80552da5da826888fe88b0b7ad750d3", "title": "The convergence of Digital Twins and Distributed Ledger Technologies: A systematic literature review and an architectural proposal"}, {"paperId": "3a5b508eee1674de18dd7d724297c5302552d9ad", "title": "Digital Twins in Software Engineering—A Systematic Literature Review and Vision"}, {"paperId": "bef31243f3292515a61b78bf2428aa70f74ba3b1", "title": "Digital Twin Space: The Integration of Digital Twins and Data Spaces"}, {"paperId": "e092ae2f7ef03f9415a174a68a85deef29a6aa05", "title": "Adopting a Digital Twin Framework for Autonomous Machine Operation at Construction Sites"}, {"paperId": "c3b3cce29fd7200a6ff0e9830b5a0b7d1f7ff51f", "title": "A Model-Driven Platform for Engineering Holistic Digital Twins"}, {"paperId": "bf7006843e27c0a39163f1d2978ac300d8533d29", "title": "A Systematic Mapping Study on the Role of Software Engineering in Enabling Society 5.0"}, {"paperId": "b3eb43f867bdab9b6d5579d35fd4d7139942c03f", "title": "A Systematic Literature Review of Recent Trends and Challenges in Digital Twin Implementation"}, {"paperId": "eeef84f042ffdd4df6afee2209fb661df8604cf6", "title": "Cyfrowy bliźniak siłownika elektrycznego"}, {"paperId": "595e04d3c7e82e39f7bde4e84987683b0ca93718", "title": "Near real-time analysis of active distribution networks in a Digital Twin framework: A real case study"}, {"paperId": "0e26b4df6e0a386565b98de9ed15cfe238bf30e5", "title": "Towards AI-assisted digital twins for smart railways: preliminary guideline and reference architecture"}, {"paperId": "3fa12190d4cefd2c9a2b1b7e325d8d7ecf43ea44", "title": "Research on Rolling Bearing Fault Diagnosis Based on Digital Twin Data and Improved ConvNext"}, {"paperId": "d9ae4c7ae7bf2f9d234fbe03412e1c77ac064551", "title": "Systematic review of digital twin technology and applications"}, {"paperId": "7be6fef04b3ed41c5dc3a5cc51a302ad48035c55", "title": "Petri nets-based digital twin drives dual-arm cooperative manipulation"}, {"paperId": "cc5d5be6f09aa2f56c27898d90f004f813d5636a", "title": "End-to-End Delay Bound Analysis for VR and Industrial IoE Traffic Flows under Different Scheduling Policies in a 6G Network"}, {"paperId": "ed16a38b30b6023c48bc33a251e7c533c9b32444", "title": "Standardisation in Digital Twin Architectures in Manufacturing"}, {"paperId": "d13bcf50197cb107ebdf55e8bd1498138d5044e6", "title": "Towards a Product Line Architecture for Digital Twins"}, {"paperId": "af72c488eab5cb663194f14351029218d2756c4d", "title": "Applying digital twins for the management of information in turnaround event operations in commercial airports"}, {"paperId": "173a6c55468479c40ce4970da22eba284fa647de", "title": "Overview of Business Hyper-automation"}, {"paperId": "7b4a04095474701b05109d11449dc9ed98a0d04a", "title": "Digital Twins in Healthcare: An Architectural Proposal and Its Application in a Social Distancing Case Study"}, {"paperId": "0f573792b4723fbc61515594ad2fe5ace6bf5fa6", "title": "Analysing Interoperability in Digital Twin Software Architectures for Manufacturing"}, {"paperId": "6c195bef7ea9c3f2164a51f39075bd2b26b58bac", "title": "A Conceptual Architecture for Building Digital Twins"}, {"paperId": "170839af97d1ff87a5abc5ed9848d7e7d52e99a6", "title": "The Role of Technology in Improving the Customer Experience in the Banking Sector: A Systematic Mapping Study"}]}
