{"paperId": "30a194b07a3325fa2781e8120158cf4a1de086f5", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Transfreq: a Python package for computing the theta-to-alpha transition frequency from resting state EEG data", "abstract": "A classic approach to estimate the individual theta-to-alpha transition frequency requires two electroencephalographic (EEG) recordings, one acquired in restingstate condition and one showing an alpha de-synchronisation due e.g. to task execution. This translates into longer recording sessions that my be cumbersome in studies involving patients. Moreover, incomplete de-synchronisation of the alpha rhythm may compromise the final estimation of the transition frequency. Here we present transfreq, a Python library that allows the computation of the transition frequency from resting-state data by clustering the spectral profiles at different EEG channels based on their content in the alpha and theta bands. We first provide an overview of the transfreq core algorithm and of the software architecture. Then we demonstrate its feasibility and robustness across different experimental setups on a publicly available EEG data set and on in-house recordings. A detailed documentation of transfreq and the codes for reproducing the analysis of the paper with the open-source data set are available online at https://elisabettavallarino.github.io/transfreq/", "venue": "bioRxiv", "year": 2021, "fieldsOfStudy": ["Biology"], "publicationTypes": ["Review"], "publicationDate": "2021-12-05", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "1387158534", "name": "Elisabetta Vallarino"}, {"authorId": "49651980", "name": "Sara Sommariva"}, {"authorId": "5082223", "name": "D. Arnaldi"}, {"authorId": "35681063", "name": "F. Famà"}, {"authorId": "144329786", "name": "M. Piana"}, {"authorId": "2055180559", "name": "F. Nobili"}], "citations": [{"paperId": "1d604c830eebda0bd78c631188c979f80a91c93f", "title": "Non-uniform spatial priors for multi-dipole localization from MEG/EEG data"}, {"paperId": "8554b91dd6baba6d38d7e0085001ada6f0eb8e56", "title": "Data-Driven EEG Theta and Alpha Components Are Associated with Subjective Experience during Resting State"}]}
