{"paperId": "30b2ce495981edfcc98136ce170adc4927e9285b", "publicationVenue": {"id": "8a9e9f3b-a025-473d-801e-72cdb0653d22", "name": "IEEE Symposium Series on Computational Intelligence", "type": "conference", "alternate_names": ["IEEE Symp Ser Comput Intell", "SSCI"], "url": "http://www.ieee-ssci.org/"}, "title": "High-Performance Computing based Scalable Online Fuzzy Clustering Algorithms for Big Data", "abstract": "With the rise of big data trends so quickly, real-time stream data processing has become very important. Stream data is a type of big, fast, and unreliable dataset that cannot be handled well by traditional algorithms. Designing the algorithm that can efficiently process streaming data is a challenging task. This paper shows how important is to make a real-time clustering algorithm for data streams with high concept drift and an algorithm that can adapt to different dimensions. We propose Scalable Random Sampling Online Optimization Weighted Fuzzy c-Means (SRSOO-WFCM) algorithms for handling Big Data in a High-Performance Computing (HPC) environment using an Apache Spark cluster. To compare SRSOO-WFCM with the traditional Online Fuzzy c-Means (OFCM) algorithm, we made a scalable version of OFCM named SOFCM. The proposed SRSOO-WFCM and SOFCM are incremental algorithms that involve making one sequential run through the data subsets. We employ both loadable and very large datasets to perform extensive experiments that facilitate comparing the proposed SRSOO-WFCM and SOFCM algorithms. The proposed SRSOO-WFCM algorithm performs better than the SOFCM in terms of Normalized Mutual Information (NMI), Adjusted Rand Index (ARI), and F-score, respectively.", "venue": "IEEE Symposium Series on Computational Intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-04", "journal": {"name": "2022 IEEE Symposium Series on Computational Intelligence (SSCI)", "pages": "1400-1407"}, "authors": [{"authorId": "40499767", "name": "Preeti Jha"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "4474139", "name": "M. Ratnaparkhe"}, {"authorId": "39832205", "name": "O. Patel"}, {"authorId": "2203823132", "name": "Rapolu Pulakitha"}, {"authorId": "2056988849", "name": "Aditi Chauhan"}], "citations": []}
