{"paperId": "30c5b8f03aec2706f6ab8b5e927061a32dfb89e6", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "k-Center Clustering with Outliers in the MPC and Streaming Model", "abstract": "Given a point set P ⊆ X of size n in a metric space (X, dist) of doubling dimension d and two parameters k ∈ ℕ and z ∈ ℕ, the k-center problem with z outliers asks to return a set ${{\\mathcal{C}}^ * } = \\{ c_1^ * , \\cdots ,c_k^ * \\} \\subseteq X$ of k centers such that the maximum distance of all but z points of P to their nearest center in C* is minimized. An (ε, k, z)-coreset for this problem is a weighted point set P* such that an optimal solution for the k-center problem with z outliers on P* gives a (1 ± ε)-approximation for the k-center problem with z outliers on P. We study the construction of such coresets in the Massively Parallel Computing (MPC) model, and in the insertion-only as well as the fully dynamic streaming model. We obtain the following results, for any given 0 < ε ⩽ 1: In all cases, the size of the computed coreset is O(k/εd + z).• In the MPC model the data are distributed over m machines. One is the coordinator machine, which will contain the final answer, the others are worker machines.We present a deterministic 2-round algorithm using $O(\\sqrt n )$ machines, where the worker machines have $O(\\sqrt {nk/{\\varepsilon ^d}} + \\sqrt n \\cdot \\log (z + 1))$ local memory, and the coordinator has $O(\\sqrt {nk/{\\varepsilon ^d}} + \\sqrt n \\cdot \\log (z + 1) + z)$ local memory. The algorithm can handle point sets P that are distributed arbitrarily (possibly adversarially) over the machines. We also present a randomized algorithm that uses only a single round, under the assumption that the input set P is initially distributed randomly over the machines. Then we present a deterministic algorithm that obtains a trade-off between the number of rounds, R, and the storage per machine.In the streaming model we have a single machine with limited storage, and P is revealed in a streaming fashion.○ We present the first lower bound for the insertion-only streaming model, where the points arrive one by one and no points are deleted. We show that any deterministic algorithm that maintains an (ε, k, z)-coreset must use Ω(k/εd + z) space. We complement this by a deterministic streaming algorithm using O(k/εd + z) space, which is thus optimal. ○ For the fully dynamic data streams, where points can be inserted as well as deleted we give a randomized algorithm for point sets from a d-dimensional discrete Euclidean space [Δ]d, where Δ ∈ ℕ indicates the size of the universe from which the coordinates are taken. Our algorithm uses only O((k/εd + z)log4(kΔ/εδ)) space, and it is the first algorithm for this setting. We also present an Ω((k/εd)logΔ + z) lower bound for deterministic fully dynamic streaming algorithms. ○ For the sliding-window model, we show that any deterministic streaming algorithm that guarantees a (1 + ε)-approximation for the k-center problem with outliers in ℝd must use Ω((kz/εd) logσ) space, where σ is the ratio of the largest and smallest distance between any two points in the stream. This (negatively) answers a question posed by De Berg, Monemizadeh, and Zhong [1].", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-24", "journal": {"name": "2023 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "853-863"}, "authors": [{"authorId": "145187873", "name": "M. D. Berg"}, {"authorId": "2146014926", "name": "Leyla Biabani"}, {"authorId": "3335223", "name": "M. Monemizadeh"}], "citations": [{"paperId": "9ecae31a91bcf9681a705a136dbeade82257b5d3", "title": "Moderate Dimension Reduction for k-Center Clustering"}, {"paperId": "e8057a46e762e56b97e721fd8298e0cff45352e7", "title": "Dynamic algorithms for k-center on graphs"}, {"paperId": "bdcace7e81152f74997a8a295b7921242fa2e25d", "title": "Fully Scalable MPC Algorithms for Clustering in High Dimension"}, {"paperId": "a3483de9793bcadd7ac9e914c1c774bc6b978755", "title": "Clustering in Polygonal Domains"}]}
