{"paperId": "30c60932c1a9ef5d3e309bd90b4be4f19d4aa24e", "publicationVenue": null, "title": "Empowering Precision Medicine: AI-Driven Schizophrenia Diagnosis via EEG Signals: A Comprehensive Review from 2002-2023", "abstract": "Schizophrenia (SZ) is a prevalent mental disorder characterized by cognitive, emotional, and behavioral changes. Symptoms of SZ include hallucinations, illusions, delusions, lack of motivation, and difficulties in concentration. Diagnosing SZ involves employing various tools, including clinical interviews, physical examinations, psychological evaluations, the Diagnostic and Statistical Manual of Mental Disorders (DSM), and neuroimaging techniques. Electroencephalography (EEG) recording is a significant functional neuroimaging modality that provides valuable insights into brain function during SZ. However, EEG signal analysis poses challenges for neurologists and scientists due to the presence of artifacts, long-term recordings, and the utilization of multiple channels. To address these challenges, researchers have introduced artificial intelligence (AI) techniques, encompassing conventional machine learning (ML) and deep learning (DL) methods, to aid in SZ diagnosis. This study reviews papers focused on SZ diagnosis utilizing EEG signals and AI methods. The introduction section provides a comprehensive explanation of SZ diagnosis methods and intervention techniques. Subsequently, review papers in this field are discussed, followed by an introduction to the AI methods employed for SZ diagnosis and a summary of relevant papers presented in tabular form. Additionally, this study reports on the most significant challenges encountered in SZ diagnosis, as identified through a review of papers in this field. Future directions to overcome these challenges are also addressed. The discussion section examines the specific details of each paper, culminating in the presentation of conclusions and findings.", "venue": "Applied intelligence (Boston)", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering", "Biology"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-14", "journal": {"name": "ArXiv", "volume": "abs/2309.12202"}, "authors": [{"authorId": "16343443", "name": "M. Jafari"}, {"authorId": "1785311104", "name": "Delaram Sadeghi"}, {"authorId": "65856946", "name": "A. Shoeibi"}, {"authorId": "1405336294", "name": "H. Alinejad-Rokny"}, {"authorId": "2140545259", "name": "A. Beheshti"}, {"authorId": "2248328704", "name": "David López-García"}, {"authorId": "2244142500", "name": "Zhaolin Chen"}, {"authorId": "2238592603", "name": "U. Acharya"}, {"authorId": "1704580", "name": "J. Górriz"}], "citations": [{"paperId": "7afd985b1c6c27d2cfac23cf2089c830b9b73682", "title": "Advanced model based machine learning technique for early stage prediction of ankylosing spondylitis under timely analysis with featured textures"}, {"paperId": "d98ee8023ddb3af245e79c426536864b23510f3c", "title": "A new fractional fuzzy dispersion entropy and its application in muscle fatigue detection."}, {"paperId": "5110e7cdff7a237f2fcbc5e8663dbb76e9d4edcb", "title": "Automated Detection and Forecasting of COVID-19 using Deep Learning Techniques: A Review"}, {"paperId": "af6f11ac83651461db7c7ba9334e48af7b41e422", "title": "Staphylococcus Aureus-Related antibiotic resistance detection using synergy of Surface-Enhanced Raman spectroscopy and deep learning"}]}
