{"paperId": "30d0600be125d98c6f29bb965f06e8c282892554", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Exploring the relationship between environmental drivers and the manifestation of fibropapillomatosis in green turtles (Chelonia mydas) in eastern Brazil", "abstract": "Fibropapillomatosis (FP) is a disease characterized by epithelial tumors that can impede life-sustaining activities of sea turtles, especially green turtles (Chelonia mydas). FP is caused by a herpesvirus, but environmental factors are also thought to play a role in triggering FP tumor growth. In this study, we evaluate the epidemiology of FP tumors in green turtles along the coast of Espírito Santo, Brazil, a region where juvenile green turtles are known to aggregate with high FP prevalence. A dataset comprising 2024 beach-cast green turtles recorded through daily beach surveys on 400 km of coastline from 2018 to 2021 (inclusive) was evaluated. FP tumors were recorded in 40.9% of the individuals in this dataset, and presence of FP tumors was predicted by individual variables (presence of marine leeches, stranding code, curved carapace length, body mass-size residual) and characteristics of the stranding site (distance to nearest metallurgical plant, mean sea surface salinity (SSS), annual range of sea surface temperature (SST)). Additionally, a second dataset comprising detailed information about the size and anatomical distribution of tumors in 271 green turtles with FP from the same region was evaluated. Hierarchical clustering analysis revealed these turtles could be classified in three groups according to the anatomical distribution of their tumors, and in turn the group to which each turtle was assigned could be predicted by the study period (2010–2014 vs. 2018–2022) and by characteristics of the stranding/capture site (green turtle stranding density, mean sea surface chlorophyll-a concentration, mean SSS, mean SST, annual range of SST). These results corroborate that individual and environmental factors play a significant role driving FP epidemiology. Furthermore, the results suggest that rather than behaving as a single entity, FP may be seen as a mosaic of distinct anatomical patterns that are not necessarily driven by the same environmental factors.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-24", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "2134559895", "name": "R. E. Vanstreels"}, {"authorId": "2233448107", "name": "Alexis Durant"}, {"authorId": "2148948917", "name": "A. P. Santos"}, {"authorId": "2115675132", "name": "Robson G. Santos"}, {"authorId": "2106017558", "name": "A. Sarmiento"}, {"authorId": "39564267", "name": "S. Rossi"}, {"authorId": "2233448101", "name": "Fabiola E. Setim"}, {"authorId": "7479881", "name": "M. Gattamorta"}, {"authorId": "5016950", "name": "E. R. Matushima"}, {"authorId": "152596937", "name": "L. F. S. Mayorga"}, {"authorId": "49629759", "name": "M. Uhart"}], "citations": [{"paperId": "80995df11266acb0ae6442ddd9ec60221c584ce9", "title": "Living with a tumor: A case of osteosarcoma involving the medullary region in Phrynops cf. P. geoffroanus (Testudines: Chelidae)."}, {"paperId": "eb25bac93734970ff0c515f9d64e17688962206a", "title": "Scientists investigate green sea turtle tumor disease"}]}
