{"paperId": "30d22bea5fe07307093df266bd7039ae2dc173ed", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Blockchain-Based Authentication and Trust Management Mechanism for Smart Cities", "abstract": "Security has always been the main concern for the internet of things (IoT)-based systems. Blockchain, with its decentralized and distributed design, prevents the risks of the existing centralized methodologies. Conventional security and privacy architectures are inapplicable in the spectrum of IoT due to its resource constraints. To overcome this problem, this paper presents a Blockchain-based security mechanism that enables secure authorized access to smart city resources. The presented mechanism comprises the ACE (Authentication and Authorization for Constrained Environments) framework-based authorization Blockchain and the OSCAR (Object Security Architecture for the Internet of Things) object security model. The Blockchain lays out a flexible and trustless authorization mechanism, while OSCAR makes use of a public ledger to structure multicast groups for authorized clients. Moreover, a meteor-based application is developed to provide a user-friendly interface for heterogeneous technologies belonging to the smart city. The users would be able to interact with and control their smart city resources such as traffic lights, smart electric meters, surveillance cameras, etc., through this application. To evaluate the performance and feasibility of the proposed mechanism, the authorization Blockchain is implemented on top of the Ethereum network. The authentication mechanism is developed in the node.js server and a smart city is simulated with the help of Raspberry Pi B+. Furthermore, mocha and chai frameworks are used to assess the performance of the system. Experimental results reveal that the authentication response time is less than 100 ms even if the average hand-shaking time increases with the number of clients.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-29", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "1486174873", "name": "Muhammad Asif"}, {"authorId": "1722129", "name": "Zeeshan Aziz"}, {"authorId": "2110011024", "name": "M. Ahmad"}, {"authorId": "145891358", "name": "A. Khalid"}, {"authorId": "2161156702", "name": "Hammad Abdul Waris"}, {"authorId": "20801416", "name": "A. Gilani"}], "citations": [{"paperId": "a58ed23a81fc08a35371553f7c81e806c8e514f0", "title": "BRITD: behavior rhythm insider threat detection with time awareness and user adaptation"}, {"paperId": "d7dcdb1b4ca52f64f82298db8279493f4a31f48d", "title": "Blockchain-based key-value store to support dynamic smart contract interaction in the agricultural sector"}, {"paperId": "17994e5f81bb79964adeaf683d5a9780f62a1c3f", "title": "Blockchain-Based Data Breach Detection: Approaches, Challenges, and Future Directions"}, {"paperId": "22cafcd8393623c4e509fb67180385c36295d2b7", "title": "Information Security Applications in Smart Cities: A Bibliometric Analysis of Emerging Research"}, {"paperId": "8656a57920b2b5c83e8ac060aba4b5d38e7f4e2c", "title": "An IoT Security Risk Assessment Framework for Healthcare Environment"}, {"paperId": "12036653d0130c492326403effa235f39e0ba4d3", "title": "Exploitation Techniques of IoST Vulnerabilities in Air-Gapped Networks and Security Measures—A Systematic Review"}, {"paperId": "1ec2faad4b8002adc2fb4c54cf4d29c4877c330f", "title": "Blockchain-Based Searchable Asymmetric Encryption Scheme in Cloud Environment"}, {"paperId": "e658d7316c7dd8e69442a6db9da1c03b9baf3dfa", "title": "Securing blockchain-based crowdfunding platforms: an integrated graph neural networks and machine learning approach"}, {"paperId": "72b894e33073b45fadaaf4068fcb5aca303026d9", "title": "BFT-IoMT: A Blockchain-Based Trust Mechanism to Mitigate Sybil Attack Using Fuzzy Logic in the Internet of Medical Things"}, {"paperId": "d8c5d6e72a3637d3bb2572588f3122f9bdf33e16", "title": "Cybersecurity and Cyber Forensics for Smart Cities: A Comprehensive Literature Review and Survey"}, {"paperId": "4b1f74cf82c2e3c0bb554381472352b4ab726a14", "title": "Swarmtrust: A swarm optimization-based approach to enhance trustworthiness in smart homes"}, {"paperId": "473ace19a05b4a37073075c85b5ab351be361d52", "title": "Trustworthiness Management Based on Blockchain in the Internet of Things"}, {"paperId": "42a5c9da84ee2ca7aea600319bda2c2c532bf6a7", "title": "Smart contract-based security architecture for collaborative services in municipal smart cities"}, {"paperId": "af8ccd5e826aa59f89f79d2ab67d0b2046ba33f3", "title": "Improved TrustChain for Lightweight Devices"}, {"paperId": "f6680b3e4648a8841a0d670ea07c23d83848e23b", "title": "A Blockchain-Based Product Traceability System with Off-Chain EPCIS and IoT Device Authentication"}, {"paperId": "b9b2275ecb36e12177b184cc82eaeddadea8eadd", "title": "A Decentralized Trust Establishment Protocol for Smart IoT Systems"}, {"paperId": "6a0448819f16f8c2c03bd08b26128b65c24eb10f", "title": "A Survey on IoT-Enabled Smart Grids: Emerging, Applications, Challenges, and Outlook"}, {"paperId": "94bc163ff97a290ce0e90a870c0ddc896a2596ac", "title": "Trust Model Concept for IoT Blockchain Applications as Part of the Digital Transformation of Metrology"}, {"paperId": "2bd54caa3e4dfd5a1df9bcdb8a60ca20d1928e98", "title": "Possible Blockchain Solutions According to a Smart City Digitalization Strategy"}, {"paperId": "28c7be5ad3f18acff176058da1fae84d03b33315", "title": "Improving Agricultural Product Traceability Using Blockchain"}, {"paperId": "6964d1c868534db1f2cc109184afc41c6ac8f2b3", "title": "APT Adversarial Defence Mechanism for Industrial IoT Enabled Cyber-Physical System"}, {"paperId": "ff1f82cadb68003d5b2b0d8e97df3bf037749718", "title": "Exploring Synergy of Blockchain and 6G Network for Industrial Automation"}, {"paperId": "50de17c213ae82508ea04d860478d6718e575b31", "title": "Research on Performance Optimization of Alliance Chain Based on Caching Technology"}]}
