{"paperId": "30d8b8c69037b5f17bb0ac0d91527c7747e4b64d", "publicationVenue": {"id": "0a6835b2-217d-4708-8735-f574a583a7d7", "name": "Atmosphere", "type": "journal", "alternate_names": ["ATMOSPHERE"], "issn": "2073-4433", "alternate_issns": ["1598-3560", "2828-3104", "0004-6973"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-187315", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-187315", "https://www.mdpi.com/journal/atmosphere", "http://j-komes.or.kr/", "http://www.tandfonline.com/loi/tato19", "http://www.mdpi.com/journal/atmosphere"]}, "title": "Spatiotemporal Characteristics of Tropical Cyclone Precipitation in Guangdong Province, China, from 1961 to 2020", "abstract": "Tropical cyclones (TCs) are often accompanied by heavy precipitation, which may lead to natural disasters and a serious threat to life and property. However, they also provide indispensable water resources. Studying the temporal and spatial characteristics of TC precipitation is of great importance for TC precipitation forecasting, TC disaster mitigation, and water resource utilization. Guangdong is one of the most frequently and severely TC-affected provinces in China. Due to the different methods used to identify TC precipitation, the conclusions offered by the existing studies are often inconsistent. Moreover, their analyses of the spatiotemporal characteristics of TC precipitation in Guangdong are not sufficiently thorough. In this study, we first selected the historical TCs that affected Guangdong from 1961 to 2020, using an objective separation method for TC wind and rain, based on the observation data from 86 national meteorological stations in Guangdong Province. From these observations covering the past 60 years, the temporal and spatial variations in TC precipitation in Guangdong for four different periods, namely the first rainy season (FRS), the second rainy season (SRS), the non-rainy season (NRS), and over the whole year (WY), were then explored using statistical analysis and multiple cluster methods. The results show that TC frequencies in the four periods all showed a decreasing trend. TC precipitation also showed a decreasing trend in the SRS and NRS, as well as for the WY, but showed a slightly increasing trend in the FRS. Both TC frequency and TC precipitation showed an apparent inter-annual fluctuation and a quasi-periodic pattern. The spatial distribution of TC precipitation in the four periods all showed a decreasing trend from the coastal to the inland stations, but the western coastal areas had higher TC precipitation values than the eastern coastal areas for the SRS, NRS, and WY periods. The spatial variations of TC precipitation in Guangdong in the four periods of the last six decades were quite similar, exhibiting three primary spatial modes and six patterns. Among them, the spatial distribution of TC precipitation being less than normal across the whole province is the most common pattern. The 86 stations can be classified into six groups when using the spatial clustering method and into four groups when using the time-series clustering method. Stations with higher TC precipitation and large inter-annual fluctuations are often distributed in the coastal areas, while stations with less precipitation and small inter-annual fluctuations are distributed in inland areas. However, the primary areas that are affected by TCs may vary in the different periods.", "venue": "Atmosphere", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-30", "journal": {"name": "Atmosphere"}, "authors": [{"authorId": "2137178906", "name": "Jing Zheng"}, {"authorId": "31910432", "name": "Siying Guo"}, {"authorId": "2056624912", "name": "Li Zhuo"}, {"authorId": "2149178241", "name": "Hongyu Wu"}], "citations": []}
