{"paperId": "30da150980e4c53951f1eb318f0ae0f5e8756191", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Significant-attributed Community Search in Heterogeneous Information Networks", "abstract": "Community search is a personalized community discovery problem aimed at finding densely-connected subgraphs containing the query vertex. In particular, the search for communities with high-importance vertices has recently received a great deal of attention. However, existing works mainly focus on conventional homogeneous networks where vertices are of the same type, but are not applicable to heterogeneous information networks (HINs) composed of multi-typed vertices and different semantic relations, such as bibliographic networks. In this paper, we study the problem of high-importance community search in HINs. A novel community model is introduced, named heterogeneous significant community (HSC), to unravel the closely connected vertices of the same type with high attribute values through multiple semantic relationships. An HSC not only maximizes the exploration of indirect relationships across entities of the anchor-type but incorporates their significance. To search the HSCs, we first develop online algorithms by exploiting both segmented-based meta-path expansion and significance increment. Specially, a solution space reuse strategy based on structural nesting is designed to boost the efficiency. In addition, we further devise a two-level index to support searching HSCs in optimal time, based on which a space-efficient compact index is proposed. Extensive experiments on real-world large-scale HINs demonstrate that our solutions are effective and efficient for searching HSCs, and the index-based algorithms are 2-4 orders of magnitude faster than online algorithms.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-25", "journal": {"name": "ArXiv", "volume": "abs/2308.13244"}, "authors": [{"authorId": "2234085274", "name": "Yanghao Liu"}, {"authorId": "2279918", "name": "Fangda Guo"}, {"authorId": "2113743048", "name": "Bingbing Xu"}, {"authorId": "2143029629", "name": "Peng Bao"}, {"authorId": "2476503", "name": "Huawei Shen"}, {"authorId": "2110251463", "name": "Xueqi Cheng"}], "citations": [{"paperId": "349d5d572d6ec4adf5b3854a22dbe7907edf1ea3", "title": "ESC: Edge-attributed Skyline Community Search in Large-scale Bipartite Graphs"}]}
