{"paperId": "30e3a47ebf7b3815afaa3929dd3d1668ee432cda", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Cool, a COhort OnLine analytical processing system", "abstract": "With a huge volume and variety of data accumulated over the years, OnLine Analytical Processing (OLAP) systems are facing challenges in query efficiency. Furthermore, the design of OLAP systems cannot serve modern applications well due to their inefficiency in processing complex queries such as cohort queries with low query latency. In this paper, we present Cool, a cohort online analytical processing system. As an integrated system with the support of several newly proposed operators on top of a sophisticated storage layer, it processes both cohort queries and conventional OLAP queries with superb performance. Its distributed design contains minimal load balancing and fault tolerance support and is scalable. Our evaluation results show that Cool outperforms two state-of-the-art systems, MonetDB and Druid, by a wide margin in single-node setting. The multi-node version of Cool can also beat the distributed Druid, as well as SparkSQL, by one order of magnitude in terms of query latency.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "577-588"}, "authors": [{"authorId": "3063356", "name": "Zhongle Xie"}, {"authorId": "1720772115", "name": "Hongbin Ying"}, {"authorId": "2055372405", "name": "Cong Yue"}, {"authorId": "1793178", "name": "Meihui Zhang"}, {"authorId": "46965289", "name": "Gang Chen"}, {"authorId": "1693070", "name": "B. Ooi"}], "citations": [{"paperId": "faead7a0a15ea1adde323ef699a96c666ac7e445", "title": "Optimal Stacked Sparse Auto-encoder based Online Analytic Processing (OLAP) Hypercube Text Analysis"}, {"paperId": "25017b33fc8259d7a3bfa40ff010a29dbbfeac1d", "title": "Growth of relational model: Interdependence and complementary to big data"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}]}
