{"paperId": "30e90fe524783fb27157ada5ad1a72111f0c6d14", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "Dynamic Maxflow via Dynamic Interior Point Methods", "abstract": "In this paper we provide an algorithm for maintaining a (1−є)-approximate maximum flow in a dynamic, capacitated graph undergoing edge insertions. Over a sequence of m insertions to an n-node graph where every edge has capacity O(poly(m)) our algorithm runs in time O(m √n · є−1). To obtain this result we design dynamic data structures for the more general problem of detecting when the value of the minimum cost circulation in a dynamic graph undergoing edge insertions achieves value at most F (exactly) for a given threshold F. Over a sequence m insertions to an n-node graph where every edge has capacity O(poly(m)) and cost O(poly(m)) we solve this thresholded minimum cost flow problem in O(m √n). Both of our algorithms succeed with high probability against an adaptive adversary. We obtain these results by dynamizing the recent interior point method by [Chen et al. FOCS 2022] used to obtain an almost linear time algorithm for minimum cost flow, and introducing a new dynamic data structure for maintaining minimum ratio cycles in an undirected graph that succeeds with high probability against adaptive adversaries.", "venue": "Symposium on the Theory of Computing", "year": 2022, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-12-13", "journal": {"name": "Proceedings of the 55th Annual ACM Symposium on Theory of Computing"}, "authors": [{"authorId": "145549761", "name": "Jan van den Brand"}, {"authorId": "47909156", "name": "Y. Liu"}, {"authorId": "2139680917", "name": "Aaron Sidford"}], "citations": [{"paperId": "08034a0a533e1a25693970c6f6f04ad8f429c3bc", "title": "Approximating Edit Distance in the Fully Dynamic Model"}, {"paperId": "f93c11f587c721391543c52255281deab1cb430c", "title": "Efficient Data Structures for Incremental Exact and Approximate Maximum Flow"}]}
