{"paperId": "30f5369fec5549452674af431ed32b5e1343205a", "publicationVenue": null, "title": "More Than Smart Pavements: Connected Infrastructure for Enhanced Winter Safety and Resilience on Highways", "abstract": "\n Currently, there is an urgent demand for more cost-effective, resource-efficient and reliable solutions to address safety, mobility, and resilience challenges on highways enduring snowy winter weather. To address this pressing issue, this commentary proposes that the physical and digital infrastructures should be upgraded to take advantage of emerging technologies and facilitate the vehicle-infrastructure integration (VII), to better inform decision-makers at various levels. Driven by the paradigm shift towards more automation and more intelligent transportation, it is time to reimagine the vehicle-infrastructure ecosystem with the cold-climate issues in mind, and to enhance communications and coordination among various highway users and stakeholders. This commentary envisages the deployment of vehicle-to-everything (V2X) technologies to bring about transformative changes and substantial benefits in terms of enhanced winter safety and resilience on highways. At the center of the commentary is a conceptualized design of next-generation highways in cold climates, including the existing infrastructure entities that are appropriate for possible upgrade to connected infrastructure (CI) applications, to leverage the immensely expanded data availability fueled by better spatial and temporal coverage. The commentary also advances the idea that CI solutions can augment the sensing capabilities and confidence level of connected or autonomous vehicles. We then briefly explore the application scenarios of VII system, and conclude with some discussion of the paradigm shift towards V2X applications and a look to the future in terms of identified research needs in the arena of CI. We hope to inspire dialogues and synergistic collaborations among various stakeholders of the VII revolution, because the specific challenges call for systematic, holistic, and multidisciplinary approaches accompanied by concerted efforts in the research, development, pilot testing, and deployment of CI technologies.", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-06-09", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "48203314", "name": "Xianming Shi"}], "citations": []}
