{"paperId": "31000c79187b9159c53aa53e3a73a008ca3844b4", "publicationVenue": {"id": "6c3e705d-29b5-462c-9a3a-6c7877b74a18", "name": "JMIR Formative Research", "alternate_names": ["JMIR Form Res"], "issn": "2561-326X", "url": "https://formative.jmir.org/"}, "title": "Using Named Entity Recognition to Identify Substances Used in the Self-medication of Opioid Withdrawal: Natural Language Processing Study of Reddit Data", "abstract": "Background The cessation of opioid use can cause withdrawal symptoms. People often continue opioid misuse to avoid these symptoms. Many people who use opioids self-treat withdrawal symptoms with a range of substances. Little is known about the substances that people use or their effects. Objective The aim of this study is to validate a methodology for identifying the substances used to treat symptoms of opioid withdrawal by a community of people who use opioids on the social media site Reddit. Methods We developed a named entity recognition model to extract substances and effects from nearly 4 million comments from the r/opiates and r/OpiatesRecovery subreddits. To identify effects that are symptoms of opioid withdrawal and substances that are potential remedies for these symptoms, we deduplicated substances and effects by using clustering and manual review, then built a network of substance and effect co-occurrence. For each of the 16 effects identified as symptoms of opioid withdrawal in the Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition, we identified the 10 most strongly associated substances. We classified these pairs as follows: substance is a Food and Drug Administration–approved or commonly used treatment for the symptom, substance is not often used to treat the symptom but could be potentially useful given its pharmacological profile, substance is a home or natural remedy for the symptom, substance can cause the symptom, or other or unclear. We developed the Withdrawal Remedy Explorer application to facilitate the further exploration of the data. Results Our named entity recognition model achieved F1 scores of 92.1 (substances) and 81.7 (effects) on hold-out data. We identified 458 unique substances and 235 unique effects. Of the 130 potential remedies strongly associated with withdrawal symptoms, 54 (41.5%) were Food and Drug Administration–approved or commonly used treatments for the symptom, 17 (13.1%) were not often used to treat the symptom but could be potentially useful given their pharmacological profile, 13 (10%) were natural or home remedies, 7 (5.4%) were causes of the symptom, and 39 (30%) were other or unclear. We identified both potentially promising remedies (eg, gabapentin for body aches) and potentially common but harmful remedies (eg, antihistamines for restless leg syndrome). Conclusions Many of the withdrawal remedies discussed by Reddit users are either clinically proven or potentially useful. These results suggest that this methodology is a valid way to study the self-treatment behavior of a web-based community of people who use opioids. Our Withdrawal Remedy Explorer application provides a platform for using these data for pharmacovigilance, the identification of new treatments, and the better understanding of the needs of people undergoing opioid withdrawal. Furthermore, this approach could be applied to many other disease states for which people self-manage their symptoms and discuss their experiences on the web.", "venue": "JMIR Formative Research", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-29", "journal": {"name": "JMIR Formative Research", "volume": "6"}, "authors": [{"authorId": "49074404", "name": "Alexander J Preiss"}, {"authorId": "145489965", "name": "Peter Baumgartner"}, {"authorId": "2069104", "name": "M. Edlund"}, {"authorId": "1790278", "name": "G. Bobashev"}], "citations": [{"paperId": "65ad1776ba016f66d2507234c450af79375bf67d", "title": "Investigating Substance Use via Reddit: Systematic Scoping Review"}, {"paperId": "9dd6c8b7a6ef69db2d37d9dfe03e8e8633aebc14", "title": "Using GPT-3 to Build a Lexicon of Drugs of Abuse Synonyms for Social Media Pharmacovigilance"}, {"paperId": "d6acfea69887f8e073848bc12d3a59930370cb56", "title": "Pharmacist, prescriber, and drug policy expert opinions on gabapentinoid misuse."}, {"paperId": "27d50439596b008cdaea6334e466c89320ef8d13", "title": "Social Media Mining of Long-COVID Self-Medication Reported by Reddit Users: Feasibility Study to Support Drug Repurposing"}]}
