{"paperId": "31019f6f7ee967f2775d1b861a23a355e7fc33ab", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Novel Machine Learning Approach Combined with Optimization Models for Eco-efficiency Evaluation", "abstract": "Machine learning approaches have been developed rapidly and also they have been involved in many academic findings and discoveries. Additionally, they are widely assessed in numerous industries such as cement companies. Cement companies in developing countries, despite many profits such as valuable mines, face many challenges. Optimization, as a key part of machine learning, has attracted more attention. The main purpose of this paper is to combine a novel Data Envelopment Analysis (DEA) approach in optimization at the first step to find the Decision-Making Unit (DMU) with innovative clustering algorithms in machine learning at the second step introduce the model and algorithm with higher accuracy. At the optimization section with converting two-stage to a simple standard single-stage model, 24 cement companies from five developing countries over 2014–2019 are compared. Window-DEA analysis is used since it leads to increase judgment on the consequences, mainly when applied to small samples followed by allowing year-by-year comparisons of the results. Applying window analysis can be beneficial for managers to expand their comparison and evaluation. To find the most accurate model CCR (Charnes, Cooper and Rhodes model), BBC (Banker, Charnes and Cooper model) and Free Disposal Hull (FDH) DEA model for measuring the efficiency of decision processes are used. FDH model allows the free disposability to construct the production possibility set. At the machine learning section, a novel three-layers data mining filtering pre-processes proposed by expert judgment for clustering algorithms to increase the accuracy and to eliminate unrelated attributes and data. Finally, the most efficient company, best performance model and the most accurate algorithm are introduced. The results indicate that the 22nd company has the highest efficiency score with an efficiency score of 1 for all years. FDH model has the highest efficiency scores during all periods compared with other suggested models. K-means algorithm receives the highest accuracy in all three suggested filtering layers. The BCC and CCR models have the second and third places, respectively. The hierarchical clustering and density-based clustering algorithms have the second and third places, correspondingly.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-07-28", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "30444624", "name": "Mirpouya Mirmozaffari"}, {"authorId": "2426226", "name": "M. Yazdani"}, {"authorId": "123911735", "name": "Azam Boskabadi"}, {"authorId": "2123687210", "name": "Hamidreza Ahady Dolatsara"}, {"authorId": "95365583", "name": "Kamyar Kabirifar"}, {"authorId": "122853920", "name": "Noorbakhsh Amiri Golilarz"}], "citations": [{"paperId": "0d6a2ff233a7658555816267059e558bb40c90e6", "title": "MACNet: A More Accurate and Convenient Pest Detection Network"}, {"paperId": "822326bc419166f868adae0ce543bfb3dc5c7c45", "title": "Affirmations of Ecosystem: The Ecotopian Bio-Network in Vedic Eco-Narratives"}, {"paperId": "4380261a96f869cd8c1556bd2061f2e52d8a3bed", "title": "Advancing Efficiency Sustainability in Poultry Farms through Data Envelopment Analysis in a Brazilian Production System"}, {"paperId": "fddd98fce9bd1a3112a6e334b318694f4461e8e7", "title": "Distributed Detection of Large-Scale Internet of Things Botnets Based on Graph Partitioning"}, {"paperId": "499e3a02853c9079e710c1b71326e0758d13ccc0", "title": "Pipeline failure evaluation and prediction using failure probability and neural network based on measured data"}, {"paperId": "f45fbc68e7a3cd01ea7f9fc941899b8a2267801a", "title": "Atık Malzeme Olarak Uçucu Kül ve Andezit Tozu İçeren PVA Lif Donatılı Çimento Esaslı Kompozitlerin Basınç Dayanımının Tahmininde Yanıt Yüzey Metodolojisinin Kullanılması"}, {"paperId": "27ea9509df58990020160f3f3750749ff53fa0a6", "title": "The Environmental Approach from the Evaluation of Eco-Efficiency in the Context of Latin American Educational Institutions"}, {"paperId": "e92101e0b8af09ab06dee63a90737e2582a134b5", "title": "Forestry Resource Efficiency, Total Factor Productivity Change, and Regional Technological Heterogeneity in China"}, {"paperId": "3f625becc838d7b3687d41335c7a8395f2904b42", "title": "A mixed-integer non-linear no-wait open-shop scheduling model for minimizing makespan and total tardiness in manufacturing"}, {"paperId": "5cc51546f9045ce68c4dea508c3caffc4534b31c", "title": "Objects detection theory for evaluating the city environmental quality"}, {"paperId": "826c3a827d5f1c0f8f4b7c4a28933829eeacb3e2", "title": "A Developed Multiple Linear Regression (MLR) Model for Monthly Groundwater Level Prediction"}, {"paperId": "591ebf142f982b28621c99689a271915b5a96ebc", "title": "Production system efficiency optimization through application of a hybrid artificial intelligence solution"}, {"paperId": "58029450eef747b9387c6cd1b33f1ed374fec0c0", "title": "Data driven approach for weight restricted data envelopment analysis models with single output"}, {"paperId": "5838c0bde5aa20d51fcd4f4c17537a90f9e81d03", "title": "Spatial–Temporal Evolution and Influential Factors of Eco-Efficiency in Chinese Urban Agglomerations"}, {"paperId": "bcb9c3694f6bdbd2b6e76046188d7a381b760c05", "title": "Measuring energy-based environmental efficiency of buildings using data envelopment analysis models - a hospital application case"}, {"paperId": "aa1b3ef00d5b6bf96d20076bdd8814a9b55aa398", "title": "Physiological Signal-Based Real-Time Emotion Recognition Based on Exploiting Mutual Information with Physiologically Common Features"}, {"paperId": "cddbf8ad71037e1aff287f482556ed2a561fa088", "title": "Enhancing Survey Efficiency and Predictive Ability in Energy System Design through Machine Learning: A Workflow-Based Approach for Improved Outcomes"}, {"paperId": "e4c1dae16c6e8e7a8724fa7b573e874536fcf735", "title": "Kiln predictive modelization for performance optimization"}, {"paperId": "6195315072f51060d7516ba9f0cd9a54deee2df4", "title": "Does Chinese forestry eco-efficiency converge? A three-stage DEA-Malmquist approach"}, {"paperId": "3e9b570bd30fb1e02e3a704a6105b93149ad4be6", "title": "Analysis of IoT Security Challenges and Its Solutions Using Artificial Intelligence"}, {"paperId": "745e6cca20e9b3200d42df41433af55d2bd95688", "title": "A multi-objective medical process mining model using event log and casual matrix"}, {"paperId": "c78c7d6b77f3a1a2de9be2a60eb5ff8640f1616b", "title": "Will Online MOOCs Improve the Efficiency of Chinese Higher Education Institutions? An Empirical Study Based on DEA"}, {"paperId": "7ded32160ad3b5673a03f86ecd8ca98aab359f66", "title": "Scientometric review and analysis of recent approaches to stock market forecasting: Two decades survey"}, {"paperId": "21394af3911c6f7d42b5ddd6892867a44b4de59b", "title": "Predicting Overall Survival with Deep Learning from 18F-FDG PET-CT Images in Patients with Hepatocellular Carcinoma before Liver Transplantation"}, {"paperId": "0ab1b610c616f8f87efc3c1daceadb13a242b8f4", "title": "Multi-Process Remora Enhanced Hyperparameters of Convolutional Neural Network for Lung Cancer Prediction"}, {"paperId": "51f846b546817efa4aa3a3a5234dad35e50f81f9", "title": "A Novel Pipeline Age Evaluation: Considering Overall Condition Index and Neural Network Based on Measured Data"}, {"paperId": "8ff19cd99edc38e69016c040c038d0a26dfd1afe", "title": "A Hybrid Machine Learning Approach to Screen Optimal Predictors for the Classification of Primary Breast Tumors from Gene Expression Microarray Data"}, {"paperId": "f28a24da670af1316d721dc6d2366d075561b942", "title": "An Integrated machine learning and DEA-predefined performance outcome prediction framework with high-dimensional imbalanced data"}, {"paperId": "41c17fa3962d4fb2eca9ab678b2e6e36f7f67733", "title": "Improved Evaluation of Cultivation Performance for Maize Based on Group Decision Method of Data Envelopment Analysis Model"}, {"paperId": "c7e76c38343bd2d333779f0c40b453c218e587c7", "title": "An Evolutionary Neuro-Fuzzy-Based Approach to Estimate the Compressive Strength of Eco-Friendly Concrete Containing Recycled Construction Wastes"}, {"paperId": "056ec2857bca454c3e604d5bb9c81cdecac1aaed", "title": "Input/Output Variables Selection in Data Envelopment Analysis: A Shannon Entropy Approach"}, {"paperId": "b72f708973da9b74ff2c43a37e1655110a580288", "title": "A Prediction of Future Flows of Ephemeral Rivers by Using Stochastic Modeling (AR Autoregressive Modeling)"}, {"paperId": "b14963cafb245b32d590e1beea891aee1b69b525", "title": "A Review on the 40 Years of Existence of Data Envelopment Analysis Models: Historic Development and Current Trends"}, {"paperId": "22b9fba09aacf3b0434b7a205ebd5b2b252f9905", "title": "Design of a Distribution Network in a Multi-product, Multi-period Green Supply Chain System Under Demand Uncertainty"}, {"paperId": "31275582c09dbeac804936cfdf57d7025fb6e715", "title": "Off-Site Construction Three-Echelon Supply Chain Management with Stochastic Constraints: A Modelling Approach"}, {"paperId": "7615b88f45189bf5e8783fb87fb613d550337270", "title": "An integrated artificial intelligence model for efficiency assessment in pharmaceutical companies during the COVID-19 pandemic"}, {"paperId": "f2ab409b257ee5c8b64458140b8bc7575f119797", "title": "A Novel Hybrid Parametric and Non-Parametric Optimisation Model for Average Technical Efficiency Assessment in Public Hospitals during and Post-COVID-19 Pandemic"}, {"paperId": "1f42acf08eff9df248e35f3a55bd2c0fff7b2a80", "title": "Developing a Novel Integrated Generalised Data Envelopment Analysis (DEA) to Evaluate Hospitals Providing Stroke Care Services"}, {"paperId": "9b66d7e534b3a0d918ccf37f0a72028670f5b5fe", "title": "Support vector frontiers: A new approach for estimating production functions through support vector machines"}, {"paperId": "1b611049e38ca6fe734db4874811259a0846ee4a", "title": "Training analysis of optimization models in machine learning"}, {"paperId": "30cdf9e07251bd4ecea69b1187807762b4ce330e", "title": "Innovative models for predicting post-fire bond behavior of steel rebar embedded in steel fiber reinforced rubberized concrete using soft computing methods"}, {"paperId": "1e5df76b2cece4093308642dc8198ecc546cc7ef", "title": "Window data envelopment analysis approach: A review and bibliometric analysis"}, {"paperId": "5e9a908b0239d05c71317ee744b3fcf56eaa9b25", "title": "Optimization of Solar CCHP Systems with Collector Enhanced by Porous Media and Nanofluid"}, {"paperId": "7917aca951c5dec986d5cf31b7bceefe83dc4d3d", "title": "Mechanical properties of GGBFS-based geopolymer concrete incorporating natural zeolite and silica fume with an optimum design using response surface method"}, {"paperId": "486f33f74022dc47d2f96c3e1fce79c0b99d9a8d", "title": "A novel artificial intelligent approach: comparison of machine learning tools and algorithms based on optimization DEA Malmquist productivity index for eco-efficiency evaluation"}, {"paperId": "3d088282fbf18fba7be2db04463be2f50df800e0", "title": "Improving construction and demolition waste collection service in an urban area using a simheuristic approach: A case study in Sydney, Australia"}, {"paperId": "75bd6297befa247fc7395e673bc48b8beaa7a408", "title": "Artificial neural network model to predict the compressive strength of eco-friendly geopolymer concrete incorporating silica fume and natural zeolite"}, {"paperId": "4f818b9db830dd124d7bebf904530d204f361c79", "title": "Analysis of Natural Gas Transportation Prices from Cyprus to Turkey"}, {"paperId": "398cf764bb242511deb2dc68e6618156909d5dba", "title": "Exploring the impacts of COVID-19 pandemic on risks faced by infrastructure projects in Pakistan"}, {"paperId": "8a9cf719ca9e3af31ad620ca5d1a71077453c2c1", "title": "VCS and CVS: New combined parametric and non-parametric operation research models"}, {"paperId": "f978f3e20fa36042ef822a629c58079370e788fe", "title": "Data Mining Algorithms Based on an Optimization Model"}, {"paperId": "e7d5cd11c17558cef3cc9b8a651e9e21f097cc85", "title": "Productivity Evaluation for Banking System in Developing Countries: DEA Malmquist Productivity Index Based on CCR, BCC, CCR-BCC (A Case Study)"}, {"paperId": "ee2ca379126053dbc291735386bb5fa335c93f4a", "title": "A Comparison of Machine Learning Clustering Algorithms Based on the DEA Optimization Approach for Pharmaceutical Companies in Developing Countries"}, {"paperId": "8d4127b8604395d793a5c07c4b8e89848b4c30da", "title": "SBM Model Based Productivity Evaluation"}]}
