{"paperId": "3110aa6c5e1af65291abfd4b0ccdc7d1630e9c69", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Computing Hierarchical Summary from Two-Dimensional Big Data Streams", "abstract": "There are many application domains, where hierarchical data is inherent, but surprisingly, there are few techniques for mining patterns from such important data. Hierarchical Heavy Hitters (HHH) and multilevel and Cross-Level Association Rules (CLAR) mining are well-known hierarchical pattern mining techniques. The problem in these techniques; however, is that they focus on capturing only global patterns from data but cannot identify local contextual patterns. Another problem in these techniques is that they treat all data items in the transaction equally and do not consider the sequential nature of the relationship among items within a transaction; hence, they cannot capture the correlation semantic within the transactions of the data items. There are many applications such as clickstream mining, healthcare data mining, network monitoring, and recommender systems, which require to identify local contextual patterns and correlation semantics. In this work, we introduce a new concept, which can capture the sequential nature of the relationship between pairs of hierarchical items at multiple concept levels and can capture local contextual patterns within the context of the global patterns. We call this notion Hierarchically Correlated Heavy Hitters (HCHH). Specifically, the proposed approach finds the correlation between items corresponding to hierarchically discounted frequency counts. We have provided formal definitions of the proposed concept and developed algorithmic approaches for computing HCHH in data streams efficiently. The proposed HCHH algorithm have deterministic error guarantees, and space bounds. It requires <inline-formula><tex-math notation=\"LaTeX\">$O(\\frac{\\eta}{\\epsilon _p\\epsilon _s})$</tex-math><alternatives><inline-graphic xlink:href=\"shah-ieq1-2778734.gif\"/></alternatives> </inline-formula> memory, where <inline-formula><tex-math notation=\"LaTeX\">$\\eta$</tex-math><alternatives> <inline-graphic xlink:href=\"shah-ieq2-2778734.gif\"/></alternatives></inline-formula> is a small constant, and <inline-formula><tex-math notation=\"LaTeX\">$\\epsilon _p\\in$</tex-math><alternatives> <inline-graphic xlink:href=\"shah-ieq3-2778734.gif\"/></alternatives></inline-formula> [0,1], <inline-formula> <tex-math notation=\"LaTeX\">$\\epsilon _s\\in$</tex-math><alternatives><inline-graphic xlink:href=\"shah-ieq4-2778734.gif\"/> </alternatives></inline-formula> [0,1] are user defined parameters on upper bounds of estimation error. We have compared the proposed HCHH concept with existing hierarchical pattern mining approaches both theoretically as well as experimentally.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "803-818", "volume": "29"}, "authors": [{"authorId": "2052725882", "name": "Zubair Shah"}, {"authorId": "1749644", "name": "A. Mahmood"}, {"authorId": "144067163", "name": "M. Barlow"}, {"authorId": "1699399", "name": "Z. Tari"}, {"authorId": "143824407", "name": "X. Yi"}, {"authorId": "9392149", "name": "Albert Y. Zomaya"}], "citations": [{"paperId": "c4679948b1045b8d677ace5361e8d88715bb89ea", "title": "Online Detection of 1D and 2D Hierarchical Super-Spreaders in High-Speed Networks"}, {"paperId": "10516f0846df695b319eea9a9438c9cf37043089", "title": "A Structured Approach Towards Big Data Identification"}, {"paperId": "b434897e736eb24b9737681b8fa683877b3604cc", "title": "Modeling Method for Leveraging Data Quality in Healthcare Big Data"}, {"paperId": "50b914feeb1b40c2b8315729bc87b6ee4403dcc4", "title": "Computer Data Processing Mode in the Era of Big Data"}, {"paperId": "6b5f112c6d4dbcb1dfea1870b8a06bfad44c5d00", "title": "Top-k frequent items and item frequency tracking over sliding windows of any size"}, {"paperId": "036b15a04574e2901be2fb5e28700beb4412a988", "title": "Gradient Correlation: Are Ensemble Classifiers More Robust Against Evasion Attacks in Practical Settings?"}, {"paperId": "e2ff7ccdb2eb6957465eb172174e6bd4ba618c07", "title": "Lr-Stream: Using latency and resource aware scheduling to improve latency and throughput for streaming applications"}, {"paperId": "797026dae2d720126d72c638061533c2508c0323", "title": "Research and Analysis for Real-Time Streaming Big Data Based on Controllable Clustering and Edge Computing Algorithm"}]}
