{"paperId": "3114b445230aa29141bd727387c5107a087d0f14", "publicationVenue": {"id": "322bf662-0263-48b5-bf26-03b114a182dc", "name": "Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis", "type": "conference", "alternate_names": ["WASSA", "Workshop Comput Approach Subj Sentim Soc Media Anal"]}, "title": "Distinguishing In-Groups and Onlookers by Language Use", "abstract": "Inferring group membership of social media users is of high interest in many domains. Group membership is typically inferred via network interactions with other members, or by the usage of in-group language. However, network information is incomplete when users or groups move between platforms, and in-group keywords lose significance as public discussion about a group increases. Similarly, using keywords to filter content and users can fail to distinguish between the various groups that discuss a topic—perhaps confounding research on public opinion and narrative trends. We present a classifier intended to distinguish members of groups from users discussing a group based on contextual usage of keywords. We demonstrate the classifier on a sample of community pairs from Reddit and focus on results related to the COVID-19 pandemic.", "venue": "Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "157-171"}, "authors": [{"authorId": "147115675", "name": "J. Minot"}, {"authorId": "1612340138", "name": "Milo Z. Trujillo"}, {"authorId": "84101078", "name": "Samuel F. Rosenblatt"}, {"authorId": "2165226791", "name": "Guillermo De Anda-Jáuregui"}, {"authorId": "152916042", "name": "E. Moog"}, {"authorId": "143750914", "name": "Allison M. Roth"}, {"authorId": "18097270", "name": "B. Samson"}, {"authorId": "1387936232", "name": "Laurent Hébert-Dufresne"}], "citations": [{"paperId": "19a543e7ff27d3107f686aad7ea8ecb34caf4970", "title": "Curating corpora with classifiers: A case study of clean energy sentiment online"}]}
