{"paperId": "312354c70fbd87b95e67cd654ebaa7c32c228a52", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Low Cost Big Data Solutions: The Case of Apache Spark on Beowulf Clusters", "abstract": "With distributed computing platforms deployed on affordable hardware, Big Data technologies have democratised the processing of huge volumes of structured and semi-structured data. Still, the costs of installing and operating even relatively small cluster of commodity servers or the cost of hiring cloud resources could prove inaccessible for many companies and institutions. This paper builds two predictive models for estimating the main drivers of the data processing performance for one of the most popular Big Data system (Apache Spark) deployed on gradually increased number of nodes of a Beowulf cluster. Data processing performance was estimated by randomly generated SparkSQL queries on TPC-H database schema, with variable number of joins (including self-joins), predicates, groups, aggregate functions and subqueries included in FROM clause. Using two machine learning techniques, random forest and extreme gradient boosting, predictive models tried to estimate the query duration on predictors related to cluster setup and query structure and also to assess the importance of predictors for the outcome variability. Results were positive and encouraging for extending the cluster number of nodes and the database scale.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "327-334"}, "authors": [{"authorId": "2024188", "name": "Marin Fotache"}, {"authorId": "1740895748", "name": "Marius-Iulian Cluci"}, {"authorId": "1409494457", "name": "Valerica Greavu-Serban"}], "citations": [{"paperId": "9f186655633d69ffd42e4650b115d6b968077943", "title": "Streamlining Stock Price Analysis: Hadoop Ecosystem for Machine Learning Models and Big Data Analytics"}, {"paperId": "ef037a8228a70f64ef560565283c081e2d567674", "title": "Low-cost clusters on big data - A systematic study"}]}
