{"paperId": "312f618c303b55a22f8b41b0fa22ae479ba80133", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "Discovering regions of anomalous spatial co-locations", "abstract": "ABSTRACT Regions of anomalous spatial co-locations (ROASCs) are regions where co-locations between two different features are significantly stronger or weaker than expected. ROASC discovery can provide useful insights for studying unexpected spatial associations at regional scales. The main challenges are that the ROASCs are spatially arbitrary in geographic shape and the distributions of spatial features are unknown a priori. To avoid restrictive assumptions regarding the distribution of data, we propose a distribution-free method for discovering arbitrarily shaped ROASCs. First, we present a multidirectional optimization method to adaptively identify the candidate ROASCs, whose sizes and shapes are fully endogenized. Furthermore, the validity of the candidates is evaluated through significance tests under the null hypothesis that the expected spatial co-locations between two features occur consistently across space. To effectively model the null hypothesis, we develop a bivariate pattern reconstruction method by reconstructing the spatial auto- and cross-correlation structures observed in the data. Synthetic experiments and a case study conducted using Shanghai taxi datasets demonstrate the advantages of our method, in terms of effectiveness, over an available alternative method.", "venue": "International Journal of Geographical Information Science", "year": 2020, "fieldsOfStudy": ["Geology", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-16", "journal": {"name": "International Journal of Geographical Information Science", "pages": "974 - 998", "volume": "35"}, "authors": [{"authorId": "15996861", "name": "Jiannan Cai"}, {"authorId": "2054419042", "name": "M. Deng"}, {"authorId": "2527106", "name": "Yiwen Guo"}, {"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "9b5ffba6c010a900290ee1900e3dadcb49ef400e", "title": "Preferred streets: assessing the impact of the street environment on cycling behaviors using the geographically weighted regression"}, {"paperId": "132c488b38c8a11e895cdf0333f777c06635eab8", "title": "Mining significant local spatial association rules for multi-category point data"}, {"paperId": "9b4f0dfe97a0563fc147aa290a6e2331c3716d0a", "title": "A multi-view anomalous co-location detection framework considering both intra- and inter-feature couplings"}, {"paperId": "9d81943b1bb796db224be92ac3b715c8d2b5ab92", "title": "STO2Vec: A Multiscale Spatio-Temporal Object Representation Method for Association Analysis"}, {"paperId": "8b99b9acad34b3218a6fed8d4cbc1a2a2dad80dc", "title": "Spatially adaptive machine learning models for predicting water quality in Hong Kong"}, {"paperId": "b66a124bd3facf88672172b55296f5dad451e3c3", "title": "Meta-PCP: A concise representation of prevalent co-location patterns discovered from spatial data"}, {"paperId": "34e4c402470f54ec5b59196a92b33c5844264694", "title": "Detecting spatial flow outliers in the presence of spatial autocorrelation"}, {"paperId": "b4dbecb672bfce1bbe674030000c20d8cf12ac5e", "title": "Discovering Spatio-Temporal Co-Occurrence Patterns of Crimes with Uncertain Occurrence Time"}, {"paperId": "d1efdd25aa71281b4bc24a128dfe64d98a953029", "title": "Adaptive-weight water quality assessment and human health risk analysis for river water in Hong Kong"}, {"paperId": "ac3a7e5ef24be861f28e4570fd348f5a4e90249c", "title": "Detecting anomalous spatial interaction patterns by maximizing urban population carrying capacity"}, {"paperId": "03cebbaf866d1d89bcc129ce177b7ce821931d5f", "title": "An approach based on maximal cliques and multi-density clustering for regional co-location pattern mining"}]}
