{"paperId": "31331cda4c8da4aba600acfaa2030c782221fd83", "publicationVenue": null, "title": "Using a Software Tool in Forecasting: a Case Study of Sales Forecasting Taking into Account Data Uncertainty", "abstract": "Abstract Forecasting is one of the logistics activities and a sales forecast is the starting point for the elaboration of business plans. Forecast accuracy affects the business outcomes and ultimately may significantly affect the economic stability of the company. The accuracy of the prediction depends on the suitability of the use of forecasting methods, experience, quality of input data, time period and other factors. The input data are usually not deterministic but they are often of random nature. They are affected by uncertainties of the market environment, and many other factors. Taking into account the input data uncertainty, the forecast error can by reduced. This article deals with the use of the software tool for incorporating data uncertainty into forecasting. Proposals are presented of a forecasting approach and simulation of the impact of uncertain input parameters to the target forecasted value by this case study model. The statistical analysis and risk analysis of the forecast results is carried out including sensitivity analysis and variables impact analysis.", "venue": "", "year": 2016, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2016-10-14", "journal": {"name": "Open Engineering", "volume": "6"}, "authors": [{"authorId": "1480991215", "name": "J. Fabianová"}, {"authorId": "92414246", "name": "Peter Kačmáry"}, {"authorId": "47927699", "name": "V. Molnár"}, {"authorId": "152559185", "name": "P. Michalik"}], "citations": [{"paperId": "d68ead269d22da2dcd79dcc9d7d0629f673562c5", "title": "The impact of driving schools' training on fatal traffic accidents in the Slovak Republic"}, {"paperId": "b171d89e7ae6e36236a4fb277069bc661d73f981", "title": "Application of Facebook's Prophet Algorithm for Successful Sales Forecasting Based on Real-world Data"}, {"paperId": "ab3b514e0902a9075ee24f0d3303a836fee19fd1", "title": "Evaluación de alternativas de diseño de la red logística de distribución para una empresa confitera de Pereira mediante un estudio con simulación"}, {"paperId": "4b1be1e364dcacfcf4d88928c17164b9a2640d05", "title": "Understanding Requirements and Benefits of the Usage of Predictive Analytics in Management Accounting: Results of a Qualitative Research Approach"}, {"paperId": "068d11d332f94f59a2e3967c290006d4d91cd80c", "title": "Performance comparison between ARIMAX, ANN and ARIMAX-ANN hybridization in sales forecasting for furniture industry."}, {"paperId": "bab661cd385d6ae61f743aa8ffe83503b3bf8291", "title": "Various Electronic Data Interchange (EDI) Usage Options and Possible Substitution"}, {"paperId": "a96e86a1350b9eada2ad113211f0a0640c7618a5", "title": "Possibilities of More Efficient Use of Simulation Tools in Enterprise Logistics"}, {"paperId": "95295f94c7d16d0019a1ead440da9859b55e9a65", "title": "Comparative study on retail sales forecasting between single and combination methods"}, {"paperId": "8b3dd3fec7228b21ccda07d441b4ea737ef93ed6", "title": "Primjena umjetnih neuronskih mreža uz pomoć Bayesova pravila učenja u predviđanju prodaje za industriju namještaja"}, {"paperId": "d865ef95e406e9683ec2cbaf67a61bb6d37f3d3f", "title": "Implementation of Industry 4.0 in the belt conveyor transport"}, {"paperId": "8ce9f8d6b07a4f9696d9a2ec2f7d8ddea4d9bf1d", "title": "Analysis of the Utilization of Machinery in the Production Process Using Computer Simulation"}, {"paperId": "1a58bb41bb774861e57e56698e934b9b5d113d8f", "title": "Robotization of Logistics Processes"}, {"paperId": "4d0cf5cdf44b6060a21f1037d497b9fb8bbe352e", "title": "Comparison of the Traditional and Autonomous AGV Systems"}, {"paperId": "265dfe1eb351585218cbb743142541dc70a59445", "title": "Minimizing the Risks in the Storage of Metallurgical Material"}]}
