{"paperId": "313e5a9ebc5e84e3dbc7e466348db64a376b0368", "publicationVenue": null, "title": "Performance Analysis of Automated Testing Tools: JMeter and TestComplete", "abstract": "Presently, we perceive swift progression in web services which acts as communication interface for various web applications. Several automation testing tools help the testers to execute testing on web services or applications. The objective of this paper is to systematically analyze the features, architectures and usage automation testing tools. The functioning of two automation tools such as Apache JMeter and TestComplete has evaluated to test web services and web pages in context to factors i.e. load performance, response time etc. with respect to the number of users or threads. This paper has provided the insight of tool analysis and scenarios where it would be beneficial. It has also described the various results in the format of tables and graphs for easy understanding and uses of these tools.", "venue": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "pages": "399-407"}, "authors": [{"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "107732006", "name": "Sunakshi Mamgain"}, {"authorId": "38503959", "name": "Srikant Kumar"}, {"authorId": "34688005", "name": "Rabindra Kumar Barik"}], "citations": [{"paperId": "f50820adb5dfdb2e120b86ce2c18501decfa8f72", "title": "Quality Assurance of Academic Websites using Performance Testing Tools"}, {"paperId": "1139a258454315a7f5a86010ae2cb27ea16645e4", "title": "An Investigation Into the Efficacy of RANOREX Software Test Automation Tool"}, {"paperId": "de34079a3617e46c0e30dfa415587d612f9be71b", "title": "E2E-Loader: A Framework to Support Performance Testing of Web Applications"}, {"paperId": "133cc501d389724e23e139b6639d19c2dbac9373", "title": "Learning Management System (LMS) Performance Analysis and Evaluation for Some Kurdistan Region Universities"}, {"paperId": "e55aa4cb2b24b6992ec52beb187c0f2c5ed0d843", "title": "DEVELOPMENT OF MANUFACTURING INVENTORY MANAGEMENT SYSTEM USING MATERIAL REQUIREMENT PLANNING METHOD"}, {"paperId": "485786ba04fab26ef7f2d2dec962c0f9e145674a", "title": "Automated Resource Management System Based upon Container Orchestration Tools Comparison"}]}
