{"paperId": "314f5b4f5474673f0b305e401cdecece3863910a", "publicationVenue": {"id": "1a837836-21f5-48ef-98ae-6b40c9b5afc9", "name": "Journal of Global Information Management", "type": "journal", "alternate_names": ["J Glob Inf Manag"], "issn": "1062-7375", "url": "http://www.idea-group.com/journals/details.asp?id=99", "alternate_urls": ["https://www.igi-global.com/journal/journal-global-information-management-jgim/1070", "http://www.metapress.com/"]}, "title": "Application of Big Data Technology in Enterprise Information Security Management and Risk Assessment", "abstract": "Nowadays, the application of enterprise management information has been deeply rooted in daily business activities, and the management risk of enterprise information security (EIS) has also increased. The use of advanced means to provide security protection for it has become the top priority. To optimize the EIS management system, and carry on the risk assessment (RA), firstly, this study analyzes the current situation of the enterprise's internal information management and summarizes the shortcomings and security risks faced by the system. In the era of big data (BD), the security risks of database information systems show a diversified trend. Secondly, to explore the application of BD technology in EIS management, the characteristics of this technology and security control measures for risks are summarized to strengthen the enterprise's information management innovation and implement the application of data security technology.", "venue": "Journal of Global Information Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-09", "journal": {"name": "J. Glob. Inf. Manag.", "pages": "1-16", "volume": "31"}, "authors": [{"authorId": "2154576225", "name": "Yawen Wang"}, {"authorId": "31180015", "name": "Weixian Xue"}, {"authorId": "2209819683", "name": "Anqi Zhang"}], "citations": [{"paperId": "b8dbee48ac9b1dbdad7d08c253ff3719a7b3f74c", "title": "Digital Supply Chain Management: A Review and Bibliometric Analysis"}]}
