{"paperId": "315863a111d1632dc3669bc5929fb50adcb7b073", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "DMSConfig: Automated Configuration Tuning for Distributed IoT Message Systems Using Deep Reinforcement Learning", "abstract": "The Distributed Messaging Systems (DMSs) used in IoT systems require timely and reliable data dissemination, which can be achieved through configurable parameters. However, the high-dimensional configuration space makes it difficult for users to find the best options that maximize application throughput while meeting specific latency constraints. Existing approaches to automatic software profiling have limitations, such as only optimizing throughput, not guaranteeing explicit latency limitations, and resulting in local optima due to discretizing parameter ranges. To overcome these challenges, a novel configuration tuning system called DMSConfig is proposed that uses machine learning and deep reinforcement learning. DMSConfig interacts with a data-driven environment prediction model, avoiding the cost of online interactions with the production environment. DMSConfig employs the deep deterministic policy gradient (DDPG) method and a custom reward mechanism to make configuration decisions based on predicted DMS states and performance. Experiments show that DMSConfig performs significantly better than the default configuration, is highly adaptive to serve tuning requests with different latency boundaries, and has similar throughput to prevalent parameter tuning tools with fewer latency violations.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-17", "journal": {"name": "ArXiv", "volume": "abs/2302.09146"}, "authors": [{"authorId": "94578365", "name": "Zhuangwei Kang"}, {"authorId": "3179736", "name": "Yogesh D. Barve"}, {"authorId": "3449782", "name": "S. Bao"}, {"authorId": "144775006", "name": "A. Dubey"}, {"authorId": "2063985523", "name": "A. Gokhale"}], "citations": []}
