{"paperId": "31601058c918bf08a125d794d55b8f2bfb59f781", "publicationVenue": {"id": "146869d7-bc08-4ccf-89c8-2aba81d32bde", "name": "ACM Journal of Data and Information Quality", "type": "journal", "alternate_names": ["Journal of Data and Information Quality", "J Data Inf Qual", "ACM J Data Inf Qual"], "issn": "1936-1963", "url": "https://dl.acm.org/citation.cfm?id=J1191&picked=prox", "alternate_urls": ["https://dl.acm.org/loi/jdiq", "https://jdiq.acm.org/", "http://portal.acm.org/jdiq"]}, "title": "A Survey on Classifying Big Data with Label Noise", "abstract": "Class label noise is a critical component of data quality that directly inhibits the predictive performance of machine learning algorithms. While many data-level and algorithm-level methods exist for treating label noise, the challenges associated with big data call for new and improved methods. This survey addresses these concerns by providing an extensive literature review on treating label noise within big data. We begin with an introduction to the class label noise problem and traditional methods for treating label noise. Next, we present 30 methods for treating class label noise in a range of big data contexts, i.e., high-volume, high-variety, and high-velocity problems. The surveyed works include distributed solutions capable of operating on datasets of arbitrary sizes, deep learning techniques for large-scale datasets with limited clean labels, and streaming techniques for detecting class noise in the presence of concept drift. Common trends and best practices are identified in each of these areas, implementation details are reviewed, empirical results are compared across studies when applicable, and references to 17 open-source projects and programming packages are provided. An emphasis on label noise challenges, solutions, and empirical results as they relate to big data distinguishes this work as a unique contribution that will inspire future research and guide machine learning practitioners.", "venue": "ACM Journal of Data and Information Quality", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-10", "journal": {"name": "ACM Journal of Data and Information Quality", "pages": "1 - 43", "volume": "14"}, "authors": [{"authorId": "2213731536", "name": "Justin M. Johnson"}, {"authorId": "1725285", "name": "T. Khoshgoftaar"}], "citations": [{"paperId": "8411be63fc86016f21ce302cc1aa3f682fcbbe8b", "title": "Smart grids and renewable energy systems: Perspectives and grid integration challenges"}, {"paperId": "d5f4c544e9d818aff79076c3d40229ad010c4ab4", "title": "Groups of experts often differ in their decisions: What are the implications for AI and machine learning? A commentary on Noise: A Flaw in Human Judgment, by Kahneman, Sibony, and Sunstein (2021)"}, {"paperId": "1f5c71bce46a9e02378db1be13da3854b9e37c35", "title": "Data Cleaning and Machine Learning: A Systematic Literature Review"}, {"paperId": "bd3e71a29bf2a2301e8d4363f70895856ab68c45", "title": "On the Impact of Label Noise in Federated Learning"}, {"paperId": "a5b75f0502d0ffdf917c235e6034b48efebc055e", "title": "FPR Estimation for Fraud Detection in the Presence of Class-Conditional Label Noise"}, {"paperId": "fa245644d37484af6f7cd4e475ff66277bbda22e", "title": "An EvaluationAlessandra Perniciano of Feature Selection Robustness on Class Noisy Data"}, {"paperId": "8feb16a19a1cd545f4d3f39de9aa1482a99e3c3a", "title": "Digital Integration of Temperature Field of Cable-Stayed Bridge Based on Finite Element Model Updating and Health Monitoring"}, {"paperId": "7870add62606394f56fdfac68e744fb9d492aca4", "title": "The impact of inconsistent human annotations on AI driven clinical decision making"}, {"paperId": "8cf00db156d6f85918b4e8a47973150c59578d0e", "title": "Quantifying the Impact of Label Noise on Federated Learning"}, {"paperId": "dd36fa18e4d254e87db4e7a0581ca04206cfe220", "title": "Improving Data Quality with Training Dynamics of Gradient Boosting Decision Trees"}, {"paperId": "2958200c32f081490d99c47c27b0b9a8df236f4e", "title": "CELEST: Federated Learning for Globally Coordinated Threat Detection"}, {"paperId": "061023fa36d2867d4d7096d69607234ccbe831b9", "title": "A Probabilistic Approach to Fairness under Label Bias"}, {"paperId": "db1d3fbbb00a0a02b2bffd6715b3f6460dca3228", "title": "O PEN D ATA O BSERVATORIES"}]}
