{"paperId": "3176da186c4d16be95cd39a9723ff38ec4939ad2", "publicationVenue": {"id": "e9e6879c-d762-4080-bd7b-c302a646319a", "name": "Journal of Education Research and Evaluation", "type": "journal", "alternate_names": ["J Educ Res Evaluation"], "issn": "2549-2675", "alternate_issns": ["2597-422X"], "url": "https://ejournal.undiksha.ac.id/index.php/JERE"}, "title": "The Effect of Academic Supervision and School Climate on Teacher Performance in Islamic Junior High School", "abstract": "This research was motivated by observations of problems regarding the low performance of teachers in junior high schools which showed that academic supervision and school climate were still not in line with what was expected and teacher performance was still not optimal. The aim of this research is to analyze the influence of academic supervision and school climate on teacher performance in junior high schools. This research is a correlational quantitative research with an associative type. The population in this study were all teachers at Islamic College Middle Schools, totaling 98 teachers and the sample was determined using a non-probability sampling technique with a purposive sampling category, namely a sampling method by determining characteristics that were in accordance with the research objectives, obtaining 63 teachers. The research instrument uses a questionnaire with a Likert scale which has 5 alternative answers. Before the questionnaire was used, a trial was carried out to determine its validity and reliability. The data analysis technique was carried out using multiple linear regression tests which were processed using SPSS version 24. The results of data analysis showed that there was a significant influence between academic supervision and school climate on teacher performance with a value of Fcount>Ftable (6.269>3.14), so there was a significant influence between academic supervision and school climate together on teacher performance. In the coefficient of determination test, r² = 0.145 was obtained, which means that the determination of the academic supervision and school climate variables on teacher performance is 14.5%.", "venue": "Journal of Education Research and Evaluation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-23", "journal": {"name": "Journal of Education Research and Evaluation"}, "authors": [{"authorId": "2254376288", "name": "Supervisi Akademik"}, {"authorId": "2241421347", "name": "Iklim Sekolah"}, {"authorId": "2167397758", "name": "K. Guru"}, {"authorId": "2277938032", "name": "Siti Rohmah"}, {"authorId": "2263093872", "name": "Nurjanah"}], "citations": []}
