{"paperId": "3182e566351d1fdfc4f3998620d04cc1a68b8518", "publicationVenue": null, "title": "Efficient Incrementialization of Correlated Nested Aggregate Queries using Relative Partial Aggregate Indexes (RPAI)", "abstract": "Incrementalization of queries is imperative in cases where data arrives as streams and output is latency-critical and/or desired before the full data has been received. Incremental execution computes the output at a given time by reusing the previously computed outputs or maintained views rather than re-evaluating the query from scratch. There are various approaches to perform this incrementalization ranging from query-specific algorithms and data structures (e.g., DYN, AJU) to general systems (e.g., DBToaster, Materialize). DBToaster is a state-of-the-art system that comes with an appealing theoretical background based on the idea of applying Incremental View Maintenance (IVM) recursively, maintaining a hierarchy of materialized views via delta queries. However, one key limitation of this approach is its inability to efficiently incrementalize correlated nested-aggregate queries due to an inefficient delta rule for such queries. Moreover, none of the other specialized approaches have shown efficient ways to optimize such queries either. Nonetheless, these types of queries can be found in many real-world application domains (e.g., finance), for which efficient incrementalization remains a crucial open problem. In this work, we propose an approach to incrementalize such queries based on a novel tree-based index structure called Relative Partial Aggregate Indexes (RPAI). Our approach is asymptotically faster than other systems and shows up to 1100× speedups in workloads of practical importance.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "51428583", "name": "Supun Abeysinghe"}, {"authorId": "2152880354", "name": "Qiyang He"}, {"authorId": "1712987", "name": "Tiark Rompf"}], "citations": [{"paperId": "bce8075ca74c49a51fbca7fae43bdbfd23d2152d", "title": "Incremental Computation: What Is the Essence? (Invited Contribution)"}, {"paperId": "3065f8f5ecc8f88bf594a8c74e66951df7ea0b2c", "title": "Foreign Keys Open the Door for Faster Incremental View Maintenance"}, {"paperId": "d9e616c4a1990ba466a1bd09685f4d0aa98ef979", "title": "DBSP: Automatic Incremental View Maintenance for Rich Query Languages"}, {"paperId": "770911d314dd7866153f2be235607c0eb32255bf", "title": "Rhyme: A Data-Centric Expressive Query Language for Nested Data Structures"}]}
