{"paperId": "318d3d8d5c702bc43e2368e7dfdbd9d5a3f56ba1", "publicationVenue": null, "title": "Sketch of Big Data Real-Time Analytics Model", "abstract": "Big Data has drawn huge attention from researchers in information sciences, decision makers in governments and enterprises. However, there is a lot of potential and highly useful value hidden in the huge volume of data. Data is the new oil, but unlike oil data can be refined further to create even more value. Therefore, a new scientific paradigm is born as data-intensive scientific discovery, also known as Big Data. The growth volume of real-time data requires new techniques and technologies to discover insight value. In this paper we introduce the Big Data real-time analytics model as a new technique. We discuss and compare several Big Data technologies for real-time processing along with various challenges and issues in adapting Big Data. Real-time Big Data analysis based on cloud computing approach is our future research direction.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2015-05-25", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "52500955", "name": "Bakhtiar Amen"}, {"authorId": "144677544", "name": "Joan Lu"}], "citations": [{"paperId": "401bea06256de33e9f5b0644c5d70ea7e4ff37f4", "title": "Advanced Graph Analytics Algorithms On Genre Based Recommending System"}, {"paperId": "f5e2b613139289b08a43c25802311501e1e0db01", "title": "Big data directed acyclic graph model for real-time COVID-19 twitter stream detection"}, {"paperId": "77415957ffa7d2605a516b139be4b2b1e3b99add", "title": "Managing Software Processes with the Multi-Dimensional Resource Space Model"}, {"paperId": "a8c1c13588d3034fe27dd09d765eb683fad3a5b0", "title": "Collective Anomaly Detection Using Big Data Distributed Stream Analytics"}, {"paperId": "6828b03b577e5e42afab2c45b29ca84897e8263a", "title": "Reinforcement Learning for Predictive Analytics in Smart Cities"}]}
