{"paperId": "3193e45172210cb731ddcaca0b8c561d6bec2971", "publicationVenue": {"id": "9c4992a4-b84a-42c0-97de-25e7c9412739", "name": "Information", "issn": "2078-2489", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-181420", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-181420", "https://www.mdpi.com/journal/information"]}, "title": "Cyber Security on the Edge: Efficient Enabling of Machine Learning on IoT Devices", "abstract": "Due to rising cyber threats, IoT devices’ security vulnerabilities are expanding. However, these devices cannot run complicated security algorithms locally due to hardware restrictions. Data must be transferred to cloud nodes for processing, giving attackers an entry point. This research investigates distributed computing on the edge, using AI-enabled IoT devices and container orchestration tools to process data in real time at the network edge. The purpose is to identify and mitigate DDoS assaults while minimizing CPU usage to improve security. It compares typical IoT devices with and without AI-enabled chips, container orchestration, and assesses their performance in running machine learning models with different cluster settings. The proposed architecture aims to empower IoT devices to process data locally, minimizing the reliance on cloud transmission and bolstering security in IoT environments. The results correlate with the update in the architecture. With the addition of AI-enabled IoT device and container orchestration, there is a difference of 60% between the new architecture and traditional architecture where only Raspberry Pi were being used.", "venue": "Information", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-23", "journal": {"name": "Information"}, "authors": [{"authorId": "2117770898", "name": "S. Kumari"}, {"authorId": "2287419135", "name": "Vatsal Tulshyan"}, {"authorId": "145940308", "name": "H. Tewari"}], "citations": []}
