{"paperId": "319c15849d22e08118878b0a0954c699527bfbcc", "publicationVenue": {"id": "6625af65-e8dc-49f0-93fb-69824c0657c1", "name": "Machines", "issn": "2075-1702", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318010", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318010", "https://www.mdpi.com/2075-1702/5/4/24", "https://www.mdpi.com/journal/machines"]}, "title": "The Anatomy of the Internet of Digital Twins: A Symbiosis of Agent and Digital Twin Paradigms Enhancing Resilience (Not Only) in Manufacturing Environments", "abstract": "Due to the growing environmental and geopolitical challenges nowadays, which are causing supply chain complications, industry and society are facing significant new objections. As a complement and extension to the technology-driven premises of Industry 4.0, the value-driven Industry 5.0 focuses on society and the environment. Human centricity, sustainability, and resilience should become a more integral part of both industrial and societal revolutions. One of the enabler technologies for both is the Digital Twin (DT). In order to make DTs intelligent, they must become active, online, goal-seeking, and anticipatory. To meet these requirements, the characteristics of Multi-Agent Systems (MASs) can be employed. This paper contributes to the bilateral emergence of the two industrial paradigms and establishes an approach for the provision of Intelligent Digital Twins (IDTs) within the Internet of Digital Twins (IoDT). Initially, a DT reference model aligned with already established Industry 4.0 reference models enriched with the goals of Industry 5.0 is developed, followed by an outline of how IDTs can be realized with the characteristics of MAS. The work is substantiated by an architectural design for IDTs choreographing marketplace-oriented production processes with a subsequent prototypical implementation, followed by a proof of concept.", "venue": "Machines", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-22", "journal": {"name": "Machines"}, "authors": [{"authorId": "82364502", "name": "J. Lehmann"}, {"authorId": "2694862", "name": "Andreas Lober"}, {"authorId": "2193201636", "name": "Tim Häußermann"}, {"authorId": "2176436787", "name": "Alessa Rache"}, {"authorId": "3338456", "name": "Lisa Ollinger"}, {"authorId": "2075268189", "name": "H. Baumgärtel"}, {"authorId": "2589330", "name": "J. Reichwald"}], "citations": [{"paperId": "c619b39131b9f2c0335945b40900aae26b35d9d6", "title": "Agentenbasiertes Redesign und Neuinterpretation von OPC UA Designstrategien zur Flexiblen Fähigkeitsbasierten Produktion"}, {"paperId": "80e908dfeaf09b8fb6c0c09cfad78ba728c4fb5c", "title": "The resurrection of digital triplet: A cognitive pillar of human-machine integration at the dawn of industry 5.0"}, {"paperId": "44c2b3d7e3744034ccd4d17a7dea8e2512ba5c92", "title": "Digital Twin-Based Concept for Reliable Research Data Management Integrating Proprietary Data Sources for Hyperspectral Imaging"}, {"paperId": "f638ce953ce534c15600ee0bec5b8c840ff70012", "title": "Conceptual Architecture for the Provision and Aggregation of Universal Digital Twins within Containerization Environments"}, {"paperId": "33296f8651f4f039952f39d5dba422490b121f41", "title": "Systematic comparison of software agents and Digital Twins: differences, similarities, and synergies in industrial production"}, {"paperId": "53f8246266d703f62d9f0bd45db9bbfae4e764e3", "title": "Educational Case Studies: Creating a Digital Twin of the Production Line in TIA Portal, Unity, and Game4Automation Framework"}]}
