{"paperId": "31a427cb9055afa0bddc66d685fce5580e0aefcd", "publicationVenue": null, "title": "A Dynamic Task Offloading Method with Centralized Controller to Improve Task Success Rate", "abstract": "As the Internet of Vehicles (IoV) develops, vehicular applications become more complex. The existing offloading methods in the vehicular networks predict the time it takes to process a task and offload it to the computation resources that minimize the delay in execution. However, these methods do not adequately consider other vehicles on the road or the time constraints of the applications. Therefore, we propose a dynamic task offloading method with a centralized controller to improve the task success rate considering all vehicles on the road. We formulate the objective function which maximizes the success rate as a multiple knapsack problem by using an approximation algorithm. In the proposed method, the centralized controller gathers the information on vehicles and edge servers, and based on the algorithm it determines the edge server that maximizes the task success rate in the entire area. The algorithm calculates vehicle priority depending on the task success status of vehicles and determines the edge server based on that priority. In this paper, we conducted the experiments in which we implemented the prototype of the proposed method, and evaluated its performance. The experiments showed that the offloading method improved the task success rate by up to 38% compared to the existing methods.", "venue": "2021 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-03-22", "journal": {"name": "2021 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "pages": "483-488"}, "authors": [{"authorId": "72767486", "name": "Mutsumi Toyoda"}, {"authorId": "1596820607", "name": "Hayata Satake"}, {"authorId": "1787350", "name": "H. Shigeno"}], "citations": [{"paperId": "edb77924ac2dc2e072636db204cab310a7b9a384", "title": "Task offloading strategy to maximize task completion rate in heterogeneous edge computing environment"}]}
