{"paperId": "31af9763f1307ea5c04c9615e61e783defa3ddd7", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Intrusion Detection and Classification System for IoT Traffic with Improved Data Engineering", "abstract": "Nowadays, the Internet of Things (IoT) devices and applications have rapidly expanded worldwide due to their benefits in improving the business environment, industrial environment, and people’s daily lives. However, IoT devices are not immune to malicious network traffic, which causes potential negative consequences and sabotages IoT operating devices. Therefore, developing a method for screening network traffic is necessary to detect and classify malicious activity to mitigate its negative impacts. This research proposes a predictive machine learning model to detect and classify network activity in an IoT system. Specifically, our model distinguishes between normal and anomaly network activity. Furthermore, it classifies network traffic into five categories: normal, Mirai attack, denial of service (DoS) attack, Scan attack, and man-in-the-middle (MITM) attack. Five supervised learning models were implemented to characterize their performance in detecting and classifying network activities for IoT systems. This includes the following models: shallow neural networks (SNN), decision trees (DT), bagging trees (BT), k-nearest neighbor (kNN), and support vector machine (SVM). The learning models were evaluated on a new and broad dataset for IoT attacks, the IoTID20 dataset. Besides, a deep feature engineering process was used to improve the learning models’ accuracy. Our experimental evaluation exhibited an accuracy of 100% recorded for the detection using all implemented models and an accuracy of 99.4–99.9% recorded for the classification process.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-02", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1557271183", "name": "Abdulaziz A. Alsulami"}, {"authorId": "1398996056", "name": "Q. A. Al-Haija"}, {"authorId": "1992724504", "name": "Ahmad M Tayeb"}, {"authorId": null, "name": "Ali Alqahtani"}], "citations": [{"paperId": "de98446f89576c71017557fc91515626de2f957e", "title": "Multi‐objective prairie dog optimization algorithm for IoT‐based intrusion detection"}, {"paperId": "7df041da99c48de11192bc06be5c7e6ede142f4e", "title": "Enhancing intrusion detection in IoT networks using machine learning-based feature selection and ensemble models"}, {"paperId": "d803ccaa91bf935a9115af3fcc3be1845ed0352f", "title": "Optimizing chest tuberculosis image classification with oversampling and transfer learning"}, {"paperId": "e961c884a289712f1421ecc1654387ab3c899a99", "title": "A comparative analysis of using ensemble trees for botnet detection and classification in IoT"}, {"paperId": "f235c7be177870625219cec3b7339830e70fb213", "title": "Ensemble-Based Deep Learning Models for Enhancing IoT Intrusion Detection"}, {"paperId": "2a1c3df6d5f25aa6cb123e4af8f6e734fff9510a", "title": "IoTGeM: Generalizable Models for Behaviour-Based IoT Attack Detection"}, {"paperId": "c96e36aac560bff782483103c2d0662d55fe2458", "title": "Robust genetic machine learning ensemble model for intrusion detection in network traffic"}, {"paperId": "884e3deb7e1cc2569e261720a655f2222efbe3c2", "title": "Deep Neural Decision Forest (DNDF): A Novel Approach for Enhancing Intrusion Detection Systems in Network Traffic Analysis"}, {"paperId": "182c92034ef9ff01a3cc41e00d882c78391e36cb", "title": "Machine Learning-based Traffic Classification and Channel Allocation in IoT: A Survey"}, {"paperId": "1173fd76fa377158b1d9835c399dd3f8502dc000", "title": "A Novel Approach to Elicit Software Requirements for IoT Systems Using SVM Classifier"}, {"paperId": "397e62e9278133d413d53fbeece3aa00add4fc37", "title": "Dynamic Adaptation Attack Detection Model for a Distributed Multi-Access Edge Computing Smart City"}, {"paperId": "54a9bcf3edf88bbbb24159b09cfc5957cc7ae623", "title": "An Analysis of Artificial Intelligence Techniques in Surveillance Video Anomaly Detection: A Comprehensive Survey"}, {"paperId": "251040caa0a9fde986a72e86348b4e10c71e4505", "title": "A Lightweight Double-Stage Scheme to Identify Malicious DNS over HTTPS Traffic Using a Hybrid Learning Approach"}]}
