{"paperId": "31b54e79b4af4b681ab88b5bf01a91d9ed0fd83a", "publicationVenue": {"id": "57cfa558-a4cd-4f6d-8f7e-9a3bd853b969", "name": "International Conference/Workshop on Automation of Software Test", "type": "conference", "alternate_names": ["Int Conf Autom Softw Test", "AST", "Automation of Software Test", "Autom Softw Test"]}, "title": "Test Case Prioritization using Transfer Learning in Continuous Integration Environments", "abstract": "The continuous Integration (CI) process runs a large set of automated test cases to verify software builds. The testing phase in the CI systems has timing constraints to ensure software quality without significantly delaying the CI builds. Therefore, CI requires efficient testing techniques such as Test Case Prioritization (TCP) to run faulty test cases with priority. Recent research studies on TCP utilize different Machine Learning (ML) methods to adopt the dynamic and complex nature of CI. However, the performance of ML for TCP may decrease for a low volume of data and less failure rate, whereas using existing data with similar patterns from other domains can be valuable. We formulate this as a transfer learning (TL) problem. TL has proven to be beneficial for many real-world applications where source domains have plenty of data, but the target domains have a scarcity of it. Therefore, this research investigates leveraging the benefit of transfer learning for test case prioritization (TCP). However, only some industrial CI datasets are publicly available due to data privacy protection regulations. In such cases, model-based transfer learning is a potential solution to share knowledge among different projects without revealing data to other stakeholders. This paper applies TransBoost, a tree-kernel-based TL algorithm, to evaluate the TL approach for 24 study subjects and identify potential source datasets.", "venue": "International Conference/Workshop on Automation of Software Test", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM International Conference on Automation of Software Test (AST)", "pages": "191-200"}, "authors": [{"authorId": "1474577193", "name": "Rezwana Mamata"}, {"authorId": "2452210", "name": "Akramul Azim"}, {"authorId": "1681715", "name": "R. Liscano"}, {"authorId": "2179625467", "name": "Kevin Smith"}, {"authorId": "71638085", "name": "Yee-Kang Chang"}, {"authorId": "2223110872", "name": "Gkerta Seferi"}, {"authorId": "2179558556", "name": "Qasim Tauseef"}], "citations": []}
