{"paperId": "31be917e154c77dfc8870023da8551803391a17e", "publicationVenue": {"id": "a62882dc-8ba9-4736-b1de-ba5e2c79193f", "name": "Journal of Ambient Intelligence and Smart Environments", "type": "journal", "alternate_names": ["J Ambient Intell Smart Environ"], "issn": "1876-1364", "url": "http://content.iospress.com/journals/journal-of-ambient-intelligence-and-smart-environments", "alternate_urls": ["http://www.iospress.nl/journal-of-ambient-intelligence-and-smart-environment/", "http://www.iospress.nl/loadtop/load.php?isbn=18761364"]}, "title": "Probabilistic data structures in smart city: Survey, applications, challenges, and research directions", "abstract": "With the commencement of new technologies like IoT and the Cloud, the sources of data generation have increased exponentially. The use and processing of this generated data have motivated and given birth to many other domains. The concept of a smart city has also evolved from making use of this data in decision-making in the various aspects of daily life and also improvement in the traditional systems. In smart cities, various technologies work collaboratively; they include devices used for data collection, processing, storing, retrieval, analysis, and decision making. Big data storage, retrieval, and analysis play a vital role in smart city applications. Traditional data processing approaches face many challenges when dealing with such voluminous and high-speed generated data, such as semi-structured or unstructured data, data privacy, security, real-time responses, and so on. Probabilistic Data Structures (PDS) has been evolved as a potential solution for many applications in smart cities to complete this tedious task of handling big data with real-time response. PDS has been used in many smart city domains, including healthcare, transportation, the environment, energy, and industry. The goal of this paper is to provide a comprehensive review of PDS and its applications in the domains of smart cities. The prominent domain of the smart city has been explored in detail; origin, current research status, challenges, and existing application of PDS along with research gaps and future directions. The foremost aim of this paper is to provide a detailed survey of PDS in smart cities; for readers and researchers who want to explore this field; along with the research opportunities in the domains.", "venue": "Journal of Ambient Intelligence and Smart Environments", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-25", "journal": {"name": "J. Ambient Intell. Smart Environ.", "pages": "229-284", "volume": "14"}, "authors": [{"authorId": "2109937147", "name": "Mandeep Kumar"}, {"authorId": "2140412870", "name": "Amritpal Singh"}], "citations": [{"paperId": "8ac187eaf8cf711d1c21e462b23e405fddbb817b", "title": "The cybersecurity mesh: A comprehensive survey of involved artificial intelligence methods, cryptographic protocols and challenges for future research"}, {"paperId": "876d250c259278e36a1c96f500968e4f792f6fd7", "title": "Variable-length Encoding Framework: A Generic Framework for Enhancing the Accuracy of Approximate Membership Queries"}, {"paperId": "606b284045e1ad2615839bb2d4fc175e4c97e00e", "title": "Anomalous vehicle recognition in smart cities using persistent bloom filter: Memory efficient and intelligent monitoring"}, {"paperId": "a873e4b9753772daeb87a7762c931b7861549572", "title": "IoT forensics in ambient intelligence environments: Legal issues, research challenges and future directions"}, {"paperId": "7d485ddfddf0f4f0330326bedd6c2a9e4c96e89e", "title": "Internet of Things (IoT)-based indoor plant care system"}, {"paperId": "6b280461a353f520449cf9a017b8993cb5573df0", "title": "Industry 5.0: Sustainability Challenges in Fusion of Human and AI"}, {"paperId": "80ad3b96bb6d201bc847a2bf0d21f2f4a1d40d68", "title": "LSM Tree Optimization Through The Implementation of Cuckoo Filters"}]}
