{"paperId": "31c0e592467f9052a8a70bdaff2de8b89469f016", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "An Empirical Evaluation of the Performance of Video Conferencing Systems", "abstract": "The global COVID-19 pandemic forced society to shift to remote education and work. This shift relies on various video conference systems (VCSs) such as Zoom, Microsoft Teams, and Jitsi, consequently increasing pressure on their digital service infrastructure. Although understanding the performance of these essential cloud services could lead to better designs and improved service deployments, only limited research on this topic currently exists. Addressing this problem, in this work we propose an experimental method to analyze and compare VCSs. Our method is based on real-world experiments where the client-side is controlled, and focuses on VCS resource requirements and performance. We design and implement a tool to automatically conduct these real-world experiments, and use it to compare three platforms on the client side: Zoom, Microsoft Teams, and Jitsi. Our work exposes that there are significant differences between the systems tested in terms of resource usage and performance variability, and provides evidence for a suspected memory leak in Zoom, the system widely regarded as the industry market leader.", "venue": "International Conference on Performance Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-04-19", "journal": {"name": "Companion of the ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "2072424775", "name": "Richard Bieringa"}, {"authorId": "2072426205", "name": "Abijith Radhakrishnan"}, {"authorId": "2170409878", "name": "Tavneet Singh"}, {"authorId": "113958506", "name": "Sophie Vos"}, {"authorId": "3032687", "name": "Jesse Donkervliet"}, {"authorId": "1760940", "name": "A. Iosup"}], "citations": [{"paperId": "830460653e6522506cf1fda6ee68b1a3c090b60e", "title": "A Novel Pipeline for Compressing Image Buffers in Remote Education Video Conferencing using Harris Corner Detection and Pixel Map Array"}, {"paperId": "b3bafa32ee226575bbc5190174dcfa8651dbf535", "title": "A Comprehensive Empirical Study of Query Performance Across GPU DBMSes"}]}
