{"paperId": "31d03b23b3ab36e8f79642777e704ed88366777d", "publicationVenue": {"id": "d135477d-8b21-429b-8564-b80f938a0147", "name": "International Conference on High Performance Computing", "type": "conference", "alternate_names": ["HiPC", "High Performance Computing Symposium", "IEEE International Conference on High Performance Computing, Data, and Analytics", "HPC", "Int Adv Res Workshop High Perform Comput", "Int Conf High Perform Comput", "International Advanced Research Workshop on High Performance Computing", "High Perform Comput Symp", "IEEE Int Conf High Perform Comput Data Anal"], "url": "http://www.wikicfp.com/cfp/program?id=1192"}, "title": "Graph Pattern Mining Paradigms: Consolidation and Renewed Bearing", "abstract": "Graph Pattern Mining (GPM) refers to a class of problems involving the processing of sub graphs extracted from larger graphs. Applications to GPM algorithms include querying subgraphs, identifying motif structures in biological networks, characterizing social media, among others. G PM algorithms are challenging to develop due to subroutines that include non-trivial graph theory concepts and methods such as isomorphism. General-purpose GPM systems have emerged as a solution to improve the user experience with such algorithms. However, existing general-purpose GPM systems are heterogeneous in terms of implementation details, hardware environment and algorithmic paradigms for sub graph exploration and thus, observations taken from the experimental results alone may not clearly identify when a particular paradigm prevails over another. In this work we present an experimentation analysis of popular paradigms used in existing GPM systems. In order to provide a fair and comprehensive evaluation of various algorithmic paradigms we implement all of them within a single GPM framework. Our results show that no single paradigm is best for every application scenario, and we believe that our findings may guide practitioner towards more optimized GPM systems in the future.", "venue": "International Conference on High Performance Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-18", "journal": {"name": "2023 IEEE 30th International Conference on High Performance Computing, Data, and Analytics (HiPC)", "pages": "224-233"}, "authors": [{"authorId": "2295136975", "name": "Vinicius Dias"}, {"authorId": "2295132971", "name": "Samuel Ferraz"}, {"authorId": "2295142688", "name": "Aditya Vadlamani"}, {"authorId": "2295129661", "name": "Mahdi Erfanian"}, {"authorId": "2295130109", "name": "Carlos H. C. Teixeira"}, {"authorId": "2295136888", "name": "Dorgival Guedes"}, {"authorId": "2286104918", "name": "Wagner Meira"}, {"authorId": "2262220716", "name": "Srinivasan Parthasarathy"}], "citations": []}
