{"paperId": "31e27369f64c51ffbfd9bc8e3cbb20705edc6bff", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Citation-Enhanced Generation for LLM-based Chatbots", "abstract": "Large language models (LLMs) exhibit powerful general intelligence across diverse scenarios, including their integration into chatbots. However, a vital challenge of LLM-based chatbots is that they may produce hallucinated content in responses, which significantly limits their applicability. Various efforts have been made to alleviate hallucination, such as retrieval augmented generation and reinforcement learning with human feedback, but most of them require additional training and data annotation. In this paper, we propose a novel post-hoc Citation-Enhanced Generation (CEG) approach combined with retrieval argumentation. Unlike previous studies that focus on preventing hallucinations during generation, our method addresses this issue in a post-hoc way. It incorporates a retrieval module to search for supporting documents relevant to the generated content, and employs a natural language inference-based citation generation module. Once the statements in the generated content lack of reference, our model can regenerate responses until all statements are supported by citations. Note that our method is a training-free plug-and-play plugin that is capable of various LLMs. Experiments on various hallucination-related datasets show our framework outperforms state-of-the-art methods in both hallucination detection and response regeneration on three benchmarks. Our codes and dataset will be publicly available.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-25", "journal": {"name": "ArXiv", "volume": "abs/2402.16063"}, "authors": [{"authorId": "2287244631", "name": "Weitao Li"}, {"authorId": "2287258758", "name": "Junkai Li"}, {"authorId": "2287226229", "name": "Weizhi Ma"}, {"authorId": "2286907986", "name": "Yang Liu"}], "citations": [{"paperId": "ab15463babf98fffc6f683fe2026de0725b5e1a9", "title": "Retrieval-Augmented Generation for AI-Generated Content: A Survey"}]}
