{"paperId": "31f6a5a32efa3ff76a340f1bb47ff35448464667", "publicationVenue": {"id": "64efda39-fbce-4563-9435-4064cc930715", "name": "European Conference on Technology Enhanced Learning", "type": "conference", "alternate_names": ["EC-TEL", "Eur Conf Technol Enhanc Learn"], "url": "http://www.wikicfp.com/cfp/program?id=826"}, "title": "Tracking learners' knowledge and skills development", "abstract": "This Ph.D. research proposal aims to investigate how exploiting educational data to track the learners’ development of knowledge and skills, thus embedding this information in automated tools designed to enhance teaching and learning. The encoding of learners’ knowledge and skills is a crucial issue which can be exploited in addressing several tasks, such as underachievement prediction and personalized learning. However, some challenges characterized how to design the encoding and include it in automated tools: dealing with several formats of data (among which also text, video, images, and audio recording), tackling the strong dependence of educational data from the context where they are collected, and consider ethical issues related to explainability and fairness. With this position paper, we introduce the research questions which lead the project, a brief state of the art about techniques used to tackle the students’ knowledge and skills encoding, the methodology and the expected results. Specifically, we aim to investigate which data can be used to fulfill our main purpose, test our encoding solutions in two case studies (underachievement prediction and knowledge tracing), and assess the contribution of our encoding to tackle them. As for the methodology, we want to explore strategies of Informed Machine Learning, that is to say incorporating an external knowledge source in the machine learning pipeline, which can improve the explainability and fairness of the models and handle the influence of the external context on the educational data.", "venue": "European Conference on Technology Enhanced Learning", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "87-93"}, "authors": [{"authorId": "2284853287", "name": "Andrea Zanellati"}, {"authorId": "1716204", "name": "M. Gabbrielli"}, {"authorId": "1906841", "name": "Olivia Levrini"}], "citations": []}
