{"paperId": "3202d5c495cab12aca5ae63b8c8b8e9299b35517", "publicationVenue": {"id": "51278f27-cfdd-4938-81e4-9d54ca7b3cd0", "name": "Cells", "type": "journal", "issn": "2073-4409", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225453", "alternate_urls": ["https://www.mdpi.com/journal/cells", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225453"]}, "title": "Synergistic Effect of Static Magnetic Fields and 3D-Printed Iron-Oxide-Nanoparticle-Containing Calcium Silicate/Poly-ε-Caprolactone Scaffolds for Bone Tissue Engineering", "abstract": "In scaffold-regulated bone regeneration, most three-dimensional (3D)-printed scaffolds do not provide physical stimulation to stem cells. In this study, a magnetic scaffold was fabricated using fused deposition modeling with calcium silicate (CS), iron oxide nanoparticles (Fe3O4), and poly-ε-caprolactone (PCL) as the matrix for internal magnetic sources. A static magnetic field was used as an external magnetic source. It was observed that 5% Fe3O4 provided a favorable combination of compressive strength (9.6 ± 0.9 MPa) and degradation rate (21.6 ± 1.9% for four weeks). Furthermore, the Fe3O4-containing scaffold increased in vitro bioactivity and Wharton’s jelly mesenchymal stem cells’ (WJMSCs) adhesion. Moreover, it was shown that the Fe3O4-containing scaffold enhanced WJMSCs’ proliferation, alkaline phosphatase activity, and the osteogenic-related proteins of the scaffold. Under the synergistic effect of the static magnetic field, the CS scaffold containing Fe3O4 can not only enhance cell activity but also stimulate the simultaneous secretion of collagen I and osteocalcin. Overall, our results demonstrated that Fe3O4-containing CS/PCL scaffolds could be fabricated three dimensionally and combined with a static magnetic field to affect cell behaviors, potentially increasing the likelihood of clinical applications for bone tissue engineering.", "venue": "Cells", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Cells", "volume": "11"}, "authors": [{"authorId": "2186074212", "name": "Chuan-Yi Kao"}, {"authorId": "4202870", "name": "Tsung-Li Lin"}, {"authorId": "46394276", "name": "Yen-Hong Lin"}, {"authorId": "51268378", "name": "A. Lee"}, {"authorId": "2112457604", "name": "S. Y. Ng"}, {"authorId": "74986374", "name": "Tsui-Hsien Huang"}, {"authorId": "10753961", "name": "T. Hsu"}], "citations": [{"paperId": "845c7e87bfd386c41acbc23ca9096426eb6a7bf8", "title": "Investigation of background, novelty and recent advance of iron (II,III) oxide- loaded on 3D polymer based scaffolds as regenerative implant for bone tissue engineering: A review."}, {"paperId": "b3dabee2f32651b265822d71a3091bccb6a9e978", "title": "Towards Polycaprolactone-Based Scaffolds for Alveolar Bone Tissue Engineering: A Biomimetic Approach in a 3D Printing Technique"}, {"paperId": "d4c5f9835baf0354b4ced69f9dc782aa5c148d39", "title": "Hofmeister effect induced advancement of the hydrogels by 3D printing"}, {"paperId": "950de3a69643435dfe27d9c1cc034aa763bd6bc8", "title": "Spontaneous Osteogenic Differentiation of Human Mesenchymal Stem Cells by Tuna-Bone-Derived Hydroxyapatite Composites with Green Tea Polyphenol-Reduced Graphene Oxide"}, {"paperId": "be0f50a36555a6124517e97e8bb6fbd862be96ad", "title": "Advances in the use of calcium silicate-based materials in bone tissue engineering"}, {"paperId": "8cbe8122c62dfb903d11079d17ba9877aed64690", "title": "Magnetic nanoparticles in 3D-printed scaffolds for biomedical applications"}]}
