{"paperId": "32087bb4edc71e438bf9adacc3bb5fff3bdaa597", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Global Edge Bandwidth Cost Gradient-based Heuristic for Fast Data Delivery to Connected Vehicles under Vehicle Overlaps", "abstract": "The emergence of vehicle connectivity technologies and associated applications have paved the way for increased consumer interest in connected vehicles. These modern day vehicles are now capable of sending/receiving vast amounts of data and offloading computation (which is one possible service) to servers thereby improving safety, comfort, driving experience, etc. In the early stages of connectivity, all the data communication and computation offloading happened between the cloud server and the vehicles. However, this is not feasible in scenarios having strict timing requirements and bandwidth cost constraints. Vehicular Edge Computing (VEC) demonstrated an efficient way to tackle the above problem. In order to optimally utilize the resources of the edge servers for data delivery, an efficient edge resource allocation framework needs to be developed. In a recent work, data/service delivery to connected vehicles assumed a worst-case scenario that all vehicles with routes passing through an edge appear in the edge coverage region simultaneously. However, this worst-case scenario is very pessimistic, which results in overestimation of edge resources. We address this by precisely computing the set of vehicles which simultaneously appear in the coverage region of an edge (which we call vehicle overlaps). In this work, we first propose an optimization framework for edge resource allocation that minimizes the bandwidth cost of data delivery to connected vehicles while considering the traffic flow and vehicle overlaps. Then, we propose an efficient heuristic to deliver data based on minimizing global edge bandwidth cost gradient under vehicle overlaps. We demonstrate the improvement in resource allocation considering vehicle overlaps. Using real world traffic data, we also demonstrate reduction in data delivery times using the proposed heuristic.", "venue": "IEEE Vehicular Technology Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-01", "journal": {"name": "2022 IEEE 95th Vehicular Technology Conference: (VTC2022-Spring)", "pages": "1-7"}, "authors": [{"authorId": "2109983165", "name": "Akshaj Gupta"}, {"authorId": "2112914334", "name": "Joseph John Cherukara"}, {"authorId": "38493287", "name": "Deepak Gangadharan"}, {"authorId": "73098055", "name": "Baek-Hyeon Kim"}, {"authorId": "1681081", "name": "O. Sokolsky"}, {"authorId": "144637634", "name": "Insup Lee"}], "citations": [{"paperId": "3ca1ca7ee03fc8142add2b5322d88c2701d2a38e", "title": "Collision-Aware Data Delivery Framework for Connected Vehicles via Edges"}, {"paperId": "e6fd6d402a9c9239179b25540b362b7ec731f110", "title": "Dynamic Data Delivery Framework for Connected Vehicles via Edge Nodes with Variable Routes"}]}
