{"paperId": "320b72dfeed563c28d13f69229b3549caa3af79f", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "A Machine Learning Modeling Framework for Predictive Maintenance Based on Equipment Load Cycle: An Application in a Real World Case", "abstract": "From a practical point of view, a turbine load cycle (TLC) is defined as the time a turbine in a power plant remains in operation. TLC is used by many electric power plants as a stop indicator for turbine maintenance. In traditional operations, a maximum time for the operation of a turbine is usually estimated and, based on the TLC, the remaining operating time until the equipment is subjected to new maintenance is determined. Today, however, a better process is possible, as there are many turbines with sensors that carry out the telemetry of the operation, and machine learning (ML) models can use this data to support decision making, predicting the optimal time for equipment to stop, from the actual need for maintenance. This is predictive maintenance, and it is widely used in Industry 4.0 contexts. However, knowing which data must be collected by the sensors (the variables), and their impact on the training of an ML algorithm, is a challenge to be explored on a case-by-case basis. In this work, we propose a framework for mapping sensors related to a turbine in a hydroelectric power plant and the selection of variables involved in the load cycle to: (i) investigate whether the data allow identification of the future moment of maintenance, which is done by exploring and comparing four ML algorithms; (ii) discover which are the most important variables (MIV) for each algorithm in predicting the need for maintenance in a given time horizon; (iii) combine the MIV of each algorithm through weighting criteria, identifying the most relevant variables of the studied data set; (iv) develop a methodology to label the data in such a way that the problem of forecasting a future need for maintenance becomes a problem of binary classification (need for maintenance: yes or no) in a time horizon. The resulting framework was applied to a real problem, and the results obtained pointed to rates of maintenance identification with very high accuracies, in the order of 98%.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-19", "journal": {"name": "Energies"}, "authors": [{"authorId": "1381565283", "name": "Arnaldo Rabello de Aguiar Vallim Filho"}, {"authorId": "2165834693", "name": "Daniel Farina Moraes"}, {"authorId": "2165836531", "name": "Marco Vinicius Bhering de Aguiar Vallim"}, {"authorId": "1381565234", "name": "L. Santos da Silva"}, {"authorId": "9342756", "name": "L. A. da Silva"}], "citations": [{"paperId": "89df1ee92c8f8026dea7fa5117a6390ad178ec8a", "title": "Machine learning scopes on microgrid predictive maintenance: Potential frameworks, challenges, and prospects"}, {"paperId": "560952ebff7d981ff281e07e3046a3c59c1216b0", "title": "Predictive Maintenance for Industrial Equipment: Using XGBoost and Local Outlier Factor with Explainable AI for analysis"}, {"paperId": "ef39adf64182301bcf06ba292e8ef3d7eacb451d", "title": "Machine-learning based process monitoring for automated composites manufacturing"}, {"paperId": "b34519d5e7e4f3fc39c199478a76d776f7a11268", "title": "Health Prognostics Classification with Autoencoders for Predictive Maintenance of HVAC Systems"}, {"paperId": "61558da3726a9eb89d7702634ad13c8bb462d103", "title": "A hybrid feature learning approach based on convolutional kernels for ATM fault prediction using event-log data"}, {"paperId": "7913d548232c7726866bb3051007d103413b989e", "title": "An assessment of ensemble learning approaches and single-based machine learning algorithms for the characterization of undersaturated oil viscosity"}, {"paperId": "f37ccdc9769e4e6011f67626bc3dbd643308b2d3", "title": "Machine Learning-Based Modelling and Predictive Maintenance of Turning Operation under Cooling/Lubrication for Manufacturing Systems"}, {"paperId": "44fc9837d3c26e95ed79a493ba196d7f128189c1", "title": "The role of artificial intelligence and digital technologies in dam engineering: Narrative review and outlook"}]}
