{"paperId": "321f7c18e6a0602b285f835203b19f9209e69dde", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Review of EEG-Based Biometrics in 5G-IoT: Current Trends and Future Prospects", "abstract": "The increasing integration of the Internet of Things (IoT) into daily life has led to significant changes in our social interactions. The advent of innovative IoT solutions, combined with the enhanced capabilities and expanded reach of 5G wireless networks, is altering the way humans interact with machines. Notably, the advancement of edge computing, underpinned by 5G networks within IoT frameworks, has markedly extended human sensory perception and interaction. A key biometric within these IoT applications is electroencephalography (EEG), recognized for its sensitivity, cost-effectiveness, and distinctiveness. Traditionally linked to brain–computer interface (BCI) applications, EEG is now finding applications in a wider array of fields, from neuroscience research to the emerging area of neuromarketing. The primary aim of this article is to offer a comprehensive review of the current challenges and future directions in EEG data acquisition, processing, and classification, with a particular focus on the increasing reliance on data-driven methods in the realm of 5G wireless network-supported EEG-enabled IoT solutions. Additionally, the article presents a case study on EEG-based emotion recognition, exemplifying EEG’s role as a biometric tool in the IoT domain, propelled by 5G technology.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1892267", "name": "T. Beyrouthy"}, {"authorId": "144326795", "name": "Nour Mostafa"}, {"authorId": "46909195", "name": "A. Roshdy"}, {"authorId": "8908772", "name": "A. Karar"}, {"authorId": "2150706250", "name": "S. Alkork"}], "citations": [{"paperId": "0ecb7baf1c8731a3a33cb3cccdcce1740759a3bc", "title": "When Does Your Brain Know You? Segment Length and Its Impact on EEG-based Biometric Authentication Accuracy"}, {"paperId": "c7f2a4daaa9aaa54f05c3e2321fe0157274a6c54", "title": "Impact of Future Wireless Networks in the Telecommunication Sector – A Review"}]}
