{"paperId": "321f669f888e43e8f44390985a5da2d3fabe8a7e", "publicationVenue": {"id": "a36dc29e-4ea1-4567-b0fe-1c06daf8bee8", "name": "International Conference on Software Engineering", "type": "conference", "alternate_names": ["Int Conf Softw Eng", "ICSE"], "url": "http://www.icse-conferences.org/"}, "title": "Detecting Logic Bugs in Graph Database Management Systems via Injective and Surjective Graph Query Transformation", "abstract": "Graph Database Management Systems (GDBMSs) store graphs as data. They are used naturally in applications such as social networks, recommendation systems and program analysis. However, they can be affected by logic bugs, which cause the GDBMSs to compute incorrect results and subsequently affect the applications relying on them. In this work, we propose injective and surjective Graph Query Transformation (GQT) to detect logic bugs in GDBMSs. Given a query 𝑄 , we derive a mutated query 𝑄 ′ , so that either their result sets are: (i) semantically equivalent; or (ii) variant based on the mutation to be either a subset or superset of each other. When the expected relationship between the results does not hold, a logic bug in the GDBMS is detected. The key insight to mutate 𝑄 is that the graph pattern in graph queries enables systematic query transformations derived from injective and surjective mappings of the directed edge sets between 𝑄 and 𝑄 ′ . We implemented injective and surjective Graph Query Transformation (GQT) as a tool called GraphGenie and evaluated it on 6 popular and mature GDBMSs. GraphGenie has found 25 unknown bugs, comprising 16 logic bugs, 3 internal errors, and 6 performance issues. Our results demonstrate the practicality and effectiveness of GraphGenie in detecting logic bugs in GDBMSs which has the potential for improving the reliability of applications relying on these", "venue": "International Conference on Software Engineering", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-02-06", "journal": {"pages": "46:1-46:12"}, "authors": [{"authorId": "2166117494", "name": "Yuancheng Jiang"}, {"authorId": "2176478619", "name": "Jiahao Liu"}, {"authorId": "2161601891", "name": "Jinsheng Ba"}, {"authorId": "2283146841", "name": "Roland H. C. Yap"}, {"authorId": "2283433611", "name": "Zhenkai Liang"}, {"authorId": "2868147", "name": "Manuel Rigger"}], "citations": []}
