{"paperId": "3225baf4912cd1b124af6e4d39ec8183b95f132b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Pool Strategies Selection in PoW-Based Blockchain Networks: Game-Theoretic Analysis", "abstract": "In proof-of-work-based (PoW-based) blockchain networks, the miners participate in a crypto-puzzle solving competition to win the reward by publishing a new block. Open mining pools attract a large number of miners for solving difficult problems together. Although the open strategy is likely to be more efficient, it makes pools susceptible to attack at the same time. In this paper, we present a game-theoretic analysis of mining pool strategy selection in order to explore the trade-off between the efficiency of openness and the vulnerability of attacks in a PoW-based blockchain network. We first model the pool mining process as a two-stage game, wherein the pools might decide whether to open or not and to attack or not. Based on the two-stage game model, we analyze the Nash equilibrium and the evolutionary stability of the mining games among pools, which uncovers the pool selection dynamics of PoW-based blockchain networks. In particular, we find that the attack behavior is the norm for a weak pool and triggers lower expected utilities when punishing the attacks more severely. Numerical simulations also support our theoretical findings as well as demonstrate the stability of the pools’ strategy selection.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-02", "journal": {"name": "IEEE Access", "pages": "8427-8436", "volume": "7"}, "authors": [{"authorId": "2118462043", "name": "Yue Wang"}, {"authorId": "8355158", "name": "Changbing Tang"}, {"authorId": "3094785", "name": "Feilong Lin"}, {"authorId": "3185576", "name": "Zhonglong Zheng"}, {"authorId": "49865752", "name": "Zhongyu Chen"}], "citations": [{"paperId": "c1fdf2f1097f1728c8cd6024eb9ab263d4d523ad", "title": "Maximizing NFT Incentives: References Make You Rich"}, {"paperId": "0add589c56417962b7ad2f3dc815e2ebe45046d6", "title": "The Validator’s Dilemma in PoW Blockchain: An Evolutionary Game Perspective"}, {"paperId": "20f7179add2e2c7f39db93eb877412199310db17", "title": "Majority is Not Required: A Rational Analysis of the Private Double-Spend Attack from a Sub-Majority Adversary"}, {"paperId": "8c417b3cabe6f90b5a6118ae20fa2ebbde7bfbc7", "title": "How to Rationally Select Your Delegatee in PoS"}, {"paperId": "9fe986e75c77c0ed925dba14b9514f14ba562852", "title": "Security and privacy protection technologies in securing blockchain applications"}, {"paperId": "b9df43b1ede2dc44b7e20d60b55122c5faf4e830", "title": "Smoothening block rewards: How much should miners pay for mining pools?"}, {"paperId": "3833dbf334098719e2c2b8b9cb46567c2428f997", "title": "Unraveling the MEV Enigma: ABI-Free Detection Model using Graph Neural Networks"}, {"paperId": "33b07df2699ed83ab576727d61d447d0a6f62f64", "title": "Models used to characterise blockchain features. A systematic literature review and bibliometric analysis"}, {"paperId": "48591772e9fc3856fc4287909b85c7a22b1d073a", "title": "Game theory attack pricing for mining pools in blockchain-based IoT"}, {"paperId": "634466bc6c65e8fc5621ceff2f36aa09e8f25a2f", "title": "Game-theoretic Designs for Blockchain-based IoT: Taxonomy and Research Directions"}, {"paperId": "ea8bfdf2e724e48b95463ea06b5c6c9430b6f363", "title": "Second-degree branch structure blockchain expansion model"}, {"paperId": "c398d83af4e6ccf888504e20dd51595eda7fe22a", "title": "A survey on security in consensus and smart contracts"}, {"paperId": "aaeb833fc501036ebfd582403fb9e849cddfd8f3", "title": "Supply chain equilibrium on a game theory-incentivized blockchain network"}, {"paperId": "8156fc5b9f104cc3ac38f9ce3f1b098c0ca1ff10", "title": "Operations Research in the Blockchain Technology"}, {"paperId": "57e7e6d0592734d8b05c96fc3b72a4df3d72f892", "title": "The Evolutionary Equilibrium of Block Withholding Attack"}, {"paperId": "79cc148833e6346d35527c8de0c56d24aadbd8b2", "title": "Mining Pool Selection under Block WithHolding Attack"}, {"paperId": "81d6f9f5974f8631fd3791808d2ba8f99caafd94", "title": "Game Theory Application Resources Management and Distribution in Blockchain Network"}, {"paperId": "e72d546bd4e26436f970066e6a6ad7e6ac93a85d", "title": "Criteria Weighting for Blockchain Software Selection Using Fuzzy AHP"}, {"paperId": "462f46bdc91a17892628cefb380550abff607292", "title": "Equilibrium of Blockchain Miners with Dynamic Asset Allocation"}, {"paperId": "5b17d663ce0b6dea8c42e07cdfd9e0772f6b9d5f", "title": "Improvement of the DPoS Consensus Mechanism in Blockchain Based on Vague Sets"}, {"paperId": "ae1e736954e8f076184755785bfc57aaf0d51c08", "title": "Blockchain Applied to Vehicular Odometers"}, {"paperId": "d16900018eafaeb53fdc5bc01536616f23642373", "title": "Blockchain and cryptocurrencies technologies and network structures: applications, implications and beyond"}, {"paperId": "10edb034f29db20e01381be9bae4381807842343", "title": "Electronic Health Records Sharing Model Based on Blockchain With Checkable State PBFT Consensus Algorithm"}, {"paperId": "650e95c92e02c50e6438d37d1ee4485381d531a8", "title": "A Novel Computing Power Allocation Algorithm for Blockchain System in Multiple Mining Pools Under Withholding Attack"}, {"paperId": "5481339994907796889c41f966aa94fccebdf8d0", "title": "N o 2019-24 Blockchain and cryptocurrencies technologies and network structures : applications , implications and beyond 4 September 2019"}]}
