{"paperId": "323e955a5d6246ce32721fc9e90d3e2201a4e4d4", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "A Comparative Study of MongoDB and Document-Based MySQL for Big Data Application Data Management", "abstract": "In the context of the heavy demands of Big Data, software developers have also begun to consider NoSQL data storage solutions. One of the important criteria when choosing a NoSQL database for an application is its performance in terms of speed of data accessing and processing, including response times to the most important CRUD operations (CREATE, READ, UPDATE, DELETE). In this paper, the behavior of two of the major document-based NoSQL databases, MongoDB and document-based MySQL, was analyzed in terms of the complexity and performance of CRUD operations, especially in query operations. The main objective of the paper is to make a comparative analysis of the impact that each specific database has on application performance when realizing CRUD requests. To perform this analysis, a case-study application was developed using the two document-based MongoDB and MySQL databases, which aim to model and streamline the activity of service providers that use a lot of data. The results obtained demonstrate the performance of both databases for different volumes of data; based on these, a detailed analysis and several conclusions were presented to support a decision for choosing an appropriate solution that could be used in a big-data application.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-05", "journal": {"name": "Big Data Cogn. Comput.", "pages": "49", "volume": "6"}, "authors": [{"authorId": "3028170", "name": "Cornelia Györödi"}, {"authorId": "2041961319", "name": "Diana V. Dumşe-Burescu"}, {"authorId": "9409858", "name": "D. Zmaranda"}, {"authorId": "2707640", "name": "R. Györödi"}], "citations": [{"paperId": "bdc512896905ee4d5b881b520e1322053cd6d698", "title": "Smart contracts and homomorphic encryption for private P2P energy trading and demand response on blockchain"}, {"paperId": "a9343c95c269e8ed11abc5a15fe11383b52e1eab", "title": "Enhancing MySQL Database Security with MySQL Enterprise Transparent Data Encryption"}, {"paperId": "01c0b6c0e6f6aff45d7aca4863013395140f1983", "title": "Implementing a Synchronization Method between a Relational and a Non-Relational Database"}, {"paperId": "b58abbd058a5f96a7ec3a1c0f71c69916ed89f32", "title": "Occupational health assessment summary designed for semantic interoperability"}, {"paperId": "f753519cb38d4c193ef3abcdea7cbc1db41a152f", "title": "Correlation Analysis Model of Environment Parameters Using IoT Framework in a Biogas Energy Generation Context"}, {"paperId": "d97aae998daa6478b9594446e9ff907b4d770663", "title": "Analysis of The Role of Savings and Loans Cooperatives An Effort to MSMEs Case Study on Ksp. Credit Union Harapan Kita"}, {"paperId": "fa97eead531adb6c21e0a02bf37199b9544e2254", "title": "A Study of Performance and Comparison of NoSQL Databases: MongoDB, Cassandra, and Redis Using YCSB"}, {"paperId": "bc4946f200db356c00ce885416284839b377bed8", "title": "Optimization of Transaction Database Design with MySQL and MongoDB"}]}
