{"paperId": "32554fdb170643223d74882dff8017cd6c47de5b", "publicationVenue": {"id": "fdeb5c51-251b-4f10-aaec-bf0b5adc6beb", "name": "World Journal of Advanced Research and Reviews", "type": "journal", "alternate_names": ["World J Adv Res Rev"], "issn": "2581-9615", "url": "http://wjarr.com/"}, "title": "A comparative analysis of big data processing paradigms: Mapreduce vs. apache spark", "abstract": "The paper addresses a highly relevant and contemporary topic in the field of data processing. Big data is a crucial aspect of modern computing, and the choice of processing framework can significantly impact performance and efficiency. The technical revolution of big data has changed how organizations handle and value large databases. As data quantities expand quickly, effective and scalable data processing systems are essential. MapReduce and Apache Spark are two of the most popular large data processing techniques. This study compares these two frameworks to determine their merits, shortcomings, and applicability for big data applications. Nearly quintillion bytes of data are created daily. Approximately 90% of data was produced in the previous two years. At this stage, data comes from temperature sensors, social media, movies, photographs, transaction records (like banking records), mobile phone conversations, GPS signals, etc. In this article, all key big data technologies are introduced. This document compares all big data technologies and discusses their merits and downsides. Run trials using multiple data sets of varying sizes to validate and explain the study. Graphical depiction shows how one tool outperforms others for given data. Big Data is data generated by the rapid usage of the internet, sensors, and heavy machinery, with great volume, velocity, variety, and veracity. Numbers, photos, videos, and text are omnipresent in every sector. Due to the pace and amount of data generation, the computing system struggles to manage large data. Data is stored in a distributed architectural file system due to its size and complexity. Big distributed file systems, which must be fault-tolerant, adaptable, and scalable, make complicated data analysis dangerous and time-consuming. Big data collection is called ‘datafication’. Big data is ‘datafied’ for productivity. Organisation alone does not make Big Data valuable; we must choose what we can do with it.", "venue": "World Journal of Advanced Research and Reviews", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-30", "journal": {"name": "World Journal of Advanced Research and Reviews"}, "authors": [{"authorId": "2261734176", "name": "Sifat Ibtisum"}, {"authorId": "2261734173", "name": "Ehsan Bazgir"}, {"authorId": "2262089983", "name": "S. M. A. Rahman"}, {"authorId": "2265824372", "name": "S. M. S. Hossain"}], "citations": [{"paperId": "721fc93c1b21dd8297619b852afea8a0eac60082", "title": "Heart Disease Prediction using SVM"}, {"paperId": "6d9c897467aad24a09a386eaec6db6d4fc4dc735", "title": "Skin cancer classification using Inception Network"}, {"paperId": "a3f024adb39ecfa4fdb098b435545c396e26a112", "title": "Building Advanced Web Applications Using Data Ingestion and Data Processing Tools"}, {"paperId": "46c1fa689f73f86fefcc08ff1ae32b1966fa2fe3", "title": "Exploring the versatility of medical textiles: Applications in implantable and non-implantable medical textiles"}, {"paperId": "002348bb076eecb57767cf6fa29ac8849eabd93f", "title": "Uncovering COVID-19 conversations: Twitter insights and trends"}, {"paperId": "eb9c454239d182b4853ce5e278677ac2a823507f", "title": "Utilizing remote sensing data and ArcGIS for advanced computational analysis in land surface temperature modeling and land use property characterization"}]}
