{"paperId": "32633b6058c520172af87044dd4494acb9f25a67", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Computer Vision-Based Intrusion Detection System for Internet of Things", "abstract": "The Internet of Things (IoT) contributes to improving and automating the quality of our lives via devices and applications that progressively become more interconnected without user intervention in many areas such as smart homes, smart cities, smart transportation, and smart environment. However, IoT devices are vulnerable to cyberattacks. We cannot prevent all attacks, but they can be detected and resolved with the least damage. Moreover, they are connected for long periods of time without user intervention. Additionally, since they remain connected for long periods of time without user intervention, creative solutions must be devised to keep them safe, such as machine learning. The reach goal is to evaluate different machine learning algorithms to detect IoT network attacks quickly and effectively. The Bot-IoT dataset, which is derived from the original dataset, is used to evaluate various detection algorithms. Five different machine learning algorithms were tested on the two databases, and the results of the tests revealed high and accurate performance at all levels of the dataset.", "venue": "Wireless Communications and Mobile Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-12", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2215670896", "name": "Shema Alosaimi"}, {"authorId": "143812345", "name": "Saad M. Almutairi"}, {"authorId": "2165431302", "name": "Fekadu Ashine Chamato"}], "citations": []}
