{"paperId": "326400ca7add9483d4900531d76ad248cd0dd9e7", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Improving Utilization and Parallelism of Hadoop Cluster by Elastic Containers", "abstract": "Modern datacenter schedulers apply a static policy to partition resources among different tasks. The amount of allocated resource won't get changed during a task's lifetime. However, we found that resource usage during a task's runtime demonstrates high dynamics and it only reaches full usage at few moments. Therefore, the static allocation policy doesn't exploit the dynamic nature of resource usage, leading to low system resource utilization. To address this hard problem, a recently proposed task-consolidation approach packs as many tasks as possible on the same node based on real-time resource demands. However, this approach may cause resource over-allocation and harm application performance. In this paper, we propose and develop ECS, an elastic container based scheduler that leverages resource usage variation within the task lifetime to exploit the potential utilization and parallelism. The key idea is to proactively select and shift tasks backward so that the inherent paralleled tasks can be identified without over-allocation. We formulate the scheduling scheme as an online optimization problem and solves it using a resource leveling algorithm. We have implemented ECS in Apache Yarn and performed evaluations with various MapReduce benchmarks in a cluster. Experimental results show that ECS can efficiently utilize resource and achieves up to 29% reduction on average job completion time while increasing CPU utilization by 25%, compared to stock Yarn.", "venue": "IEEE Conference on Computer Communications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-04-16", "journal": {"name": "IEEE INFOCOM 2018 - IEEE Conference on Computer Communications", "pages": "180-188"}, "authors": [{"authorId": "78212456", "name": "Yinggen Xu"}, {"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "1891284", "name": "Shaoqi Wang"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "145181317", "name": "Changjun Jiang"}], "citations": [{"paperId": "3134575f488648d2b605c9ae1e51515ddc3ae476", "title": "Layer Dependency-Aware Learning Scheduling Algorithms for Containers in Mobile Edge Computing"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "eeae411b49be6ce53f10f34f98da9548d54a73aa", "title": "AutoInfer: Self-Driving Management for Resource-Efficient, SLO-Aware Machine=Learning Inference in GPU Clusters"}, {"paperId": "3bbd732eb6d80c4d4c33d1b54bd09714bdc1ef55", "title": "Towards Efficient Elastic Parallelism for Deep Learning Processor"}, {"paperId": "f22e5159b3a3e431ab6fb35347d43d23a2c3710e", "title": "Optimizing MapReduce Task Scheduling on Virtualized Heterogeneous Environments Using Ant Colony Optimization"}]}
