{"paperId": "32663f33c8d7e3769db2b0874eeae52b669169df", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A New Social Media-Driven Cyber Threat Intelligence", "abstract": "Cyber threats are projected to cause USD 10.5 trillion in damage to the global economy in 2025. Comprehending the level of threat is core to adjusting cyber posture at the personal, organizational, and national levels. However, representing the threat level with a single score is a daunting task if the scores are generated from big and complex data sources such as social media. This paper harnesses the modern technological advancements in artificial intelligence (AI) and natural language processing (NLP) to comprehend the contextual information of social media posts related to cyber-attacks and electronic warfare. Then, using keyword-based index generation techniques, a single index is generated at the country level. Utilizing a convolutional neural network (CNN), the innovative process automatically detects any anomalies within the countrywide threat index and explains the root causes. The entire process was validated with live Twitter feeds from 14 October 2022 to 27 December 2022. During these 75 days, AI-based language detection, translation, and sentiment analysis comprehended 15,983 tweets in 47 different languages (while most of the existing works only work in one language). Finally, 75 daily cyber threat indexes with anomalies were generated for China, Australia, Russia, Ukraine, Iran, and India. Using this intelligence, strategic decision makers can adjust their cyber preparedness for mitigating the detrimental damages afflicted by cyber criminals.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-04", "journal": {"name": "Electronics"}, "authors": [{"authorId": "49907610", "name": "F. Sufi"}], "citations": [{"paperId": "3e4e538e32013a3a7975eec3686cdea5188a064a", "title": "Open-Source Cyber Intelligence Research Through PESTEL Framework: Present and Future Impact"}, {"paperId": "7f66c8de8df165730cea7a316f7f562bd0f3bfc8", "title": "A global cyber-threat intelligence system with artificial intelligence and convolutional neural network"}, {"paperId": "9129496324fc286feb3503946021c424836203ed", "title": "A New Social Media Analytics Method for Identifying Factors Contributing to COVID-19 Discussion Topics"}, {"paperId": "6923d139855c70f70c68186d900fc6db0cc73aaa", "title": "Social Media Analytics on Russia-Ukraine Cyber War with Natural Language Processing: Perspectives and Challenges"}, {"paperId": "cb74216039e142d7d39e37ce520a92c22c08e258", "title": "Novel Application of Open-Source Cyber Intelligence"}, {"paperId": "38c9fa153e53a74b275476cd75b1be88d52ff0e7", "title": "A Systematic Literature Review on Cyber Threat Intelligence for Organizational Cybersecurity Resilience"}, {"paperId": "7a81369d06b9c2bcbed102f61146793631eed547", "title": "A New AI-Based Semantic Cyber Intelligence Agent"}]}
