{"paperId": "326801fa2d296fa3693400dc7a6da7287d4a1e55", "publicationVenue": null, "title": "Approximate computation for big data analytics", "abstract": "Over the past a few years, research and development has made significant progresses on big data analytics. A fundamental issue for big data analytics is the efficiency. If the optimal solution is unable to attain or unnecessary or has a price to high to pay, it is reasonable to sacrifice optimality with a \"good\" feasible solution that can be computed efficiently. Existing approximation techniques can be in general classified into approximation algorithms, approximate query processing for aggregate SQL queries and approximation computing for multiple layers of the system stack. In this article, we systematically introduce approximate computation, i.e., query approximation and data approximation, for efficient and effective big data analytics. We explain the ideas and rationales behind query and data approximation, and show efficiency can be obtained with high effectiveness, and even without sacrificing for effectiveness, for certain data analytic tasks.", "venue": "SIGWEB Newsl.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-02", "journal": {"name": "ACM SIGWEB Newsletter", "pages": "1 - 8", "volume": "2021"}, "authors": [{"authorId": "47325834", "name": "Shuai Ma"}, {"authorId": "7392431", "name": "J. Huai"}], "citations": [{"paperId": "6090951fb9e43bfe6e5b107d1652bfcb9ce0ad55", "title": "Clustering approximation via a fusion of multiple random samples"}, {"paperId": "29957a423483689f0e39cb7abaf4f533d1aafbb7", "title": "Approximate Clustering Ensemble Method for Big Data"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "54038f406ddf4e30256b9095cf88f36dcbae77b5", "title": "Cloud Big Data Mining and Analytics: Bringing Greenness and Acceleration in the Cloud"}, {"paperId": "46a586b0ce1b565e96886e8e2193ad728ef374d8", "title": "Advanced, Privacy-Preserving and Approximate Big Data Management and Analytics in Distributed Environments: What is Now and What is Next"}, {"paperId": "1f4959ffcde5696968a2f70c3d481ad7fa7b1054", "title": "Real-Time Aggregation Approach for Power Quality Data"}]}
