{"paperId": "326e0c846d309a5593dd605df63673d2df8ad273", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "SoDa: A Serverless-Oriented Deadline-Aware Workflow Scheduling Engine for IoT Applications in Edge Clouds", "abstract": "As a coordination tool, workflow with a large number of interdependent tasks has increasingly become a new paradigm for orchestrating computationally intensive tasks in large-scale and complex Internet of Things (IoT) applications. Serverless computing has also recently been applied to real-world problems at the network edge as well, primarily aimed at event based IoT applications. However, the existing workflow scheduling algorithm based on the virtual machine resource model is inefficient in ensuring the QoS (Quality of Service) of users on the serverless platform. In this paper, we design an elastic workflow scheduling framework in edge clouds called EWSF based on the serverless architecture. In addition, we propose a serverless-oriented deadline-aware workflow scheduling algorithm called SoDa. Furthermore, we implemented the EWSF prototype based on Knative and Kubernetes and integrated SoDa as the scheduling engine. The performance of SoDa has been verified on the experimental platform in comparison with six counterparts. The experiment results show that SoDa adapts to various scheduling environments and achieves better performance in terms of overall makespan and execution success rate. In the case of tight cluster resources, SoDa improves the overall makespan and success rate by 10.4% and 55%, respectively, compared with the second-best algorithm.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-07", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2108324171", "name": "Dazhi Li"}, {"authorId": "2008743730", "name": "Jiaang Duan"}, {"authorId": "2110317703", "name": "Yan Yao"}, {"authorId": "2357444", "name": "Shiyou Qian"}, {"authorId": "2116575614", "name": "Jie Zhou"}, {"authorId": "1684808", "name": "Guangtao Xue"}, {"authorId": "2115872509", "name": "Jian Cao"}], "citations": [{"paperId": "eaa75704962e4d6f72a513598e78c7edd2d3e8cc", "title": "Serverless Edge Computing—Where We Are and What Lies Ahead"}, {"paperId": "c80af8fe62dd6ee8930fc820f387febe73635f8a", "title": "A Microservice and Serverless Architecture for Secure IoT System"}, {"paperId": "561b11294b2dd1476e1b669b1f610b3a3c1bb47d", "title": "A Novel Technique to Improve Latency and Response Time of AI Models using Serverless Infrastructure"}]}
