{"paperId": "327811f25fec375cb705fb7908323dfddabc26c8", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Heterogeneous Social Linked Data Integration and Sharing for Public Transportation", "abstract": "Solid (social linked data) technology has made significant progress in social web applications developed, such as Facebook, Twitter, and Wikipedia. Solid is based on semantic web and RDF (Resource Description Framework) technologies. Solid platforms can provide decentralized authentication, data management, and developer support in the form of libraries and web applications. However, thus far, little research has been conducted on understanding the problems involved in sharing public transportation data through Solid technology. It is challenging to provide personalized and adaptable public transportation services for citizens because the public transportation data originate from different devices and are heterogeneous in nature. A novel approach is proposed in this study, in order to provide personalized sharing of public transportation data between different users through integrating and sharing these heterogeneous data. This approach not only integrates diverse data types into a uniform data type using the semantic web but also stores these data in a personal online data store and retrieves data through SPARQL on the Solid platform; these data are visualized on the web pages using Google Maps. To the best of our knowledge, we are the first to apply Solid in public transportation. Furthermore, we conduct performance tests of the new C2RMF (CSV to RDF Mapping File) algorithm and functional and non-functional tests to demonstrate the stability and effectiveness of the approach. Our results indicate the feasibility of the proposed approach in facilitating public transportation data integration and sharing through Solid and semantic web technologies.", "venue": "Journal of Advanced Transportation", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-11", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "2165102726", "name": "Wei Zhao"}, {"authorId": "2107203503", "name": "B. Zhou"}, {"authorId": "2152738749", "name": "Chaoyang Zhang"}], "citations": [{"paperId": "32b5d2da28f83d7d93484bc9ae2171357b67837e", "title": "Autonomous and Sustainable Service Economies: Data-Driven Optimization of Design and Operations through Discovery of Multi-Perspective Parameters"}, {"paperId": "f25982aa1ffb8fca18f8544bda46c107daea338e", "title": "Solid Proof of Concept in an Enterprise Loan Request Use Case"}]}
