{"paperId": "32846b66f6b7695c98484581c7fb2ea8c753525e", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "Smart Meter Data Analytics", "abstract": "Smart electricity meters have been replacing conventional meters worldwide, enabling automated collection of fine-grained (e.g., every 15 minutes or hourly) consumption data. A variety of smart meter analytics algorithms and applications have been proposed, mainly in the smart grid literature. However, the focus has been on what can be done with the data rather than how to do it efficiently. In this article, we examine smart meter analytics from a software performance perspective. First, we design a performance benchmark that includes common smart meter analytics tasks. These include offline feature extraction and model building as well as a framework for online anomaly detection that we propose. Second, since obtaining real smart meter data is difficult due to privacy issues, we present an algorithm for generating large realistic datasets from a small seed of real data. Third, we implement the proposed benchmark using five representative platforms: a traditional numeric computing platform (Matlab), a relational DBMS with a built-in machine learning toolkit (PostgreSQL/MADlib), a main-memory column store (“System C”), and two distributed data processing platforms (Hive and Spark/Spark Streaming). We compare the five platforms in terms of application development effort and performance on a multicore machine as well as a cluster of 16 commodity servers.", "venue": "ACM Transactions on Database Systems", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-11-21", "journal": {"name": "ACM Transactions on Database Systems (TODS)", "pages": "1 - 39", "volume": "42"}, "authors": [{"authorId": "2109303346", "name": "Xiufeng Liu"}, {"authorId": "2285679194", "name": "Lukasz Golab"}, {"authorId": "1975156", "name": "W. Golab"}, {"authorId": "1743316", "name": "Ihab F. Ilyas"}, {"authorId": "2108915034", "name": "Shichao Jin"}], "citations": [{"paperId": "801143c7a718ce46e826580587299cca40160c0c", "title": "A hybrid key agreement scheme utilized elliptic curve Diffie-Hellman for IoT based advanced metering environment"}, {"paperId": "bc5c4bea24b307eb5dab11d1092c96e66050f797", "title": "Short-term forecasting of natural gas consumption by determining the statistical distribution of consumption data"}, {"paperId": "ed90df576883afebc2f6e1f0ac6587eaae230b84", "title": "Analyzing Long-Term and High Instantaneous Power Consumption of Buildings from Smart Meter Big Data with Deep Learning and Knowledge Graph Techniques"}, {"paperId": "c36eac2248a34005f6aae0c7263ed448c9990532", "title": "Leveraging Anomaly Detection and AutoML for Modelling Residential Measurement Power Traces"}, {"paperId": "ac5fe6a51b54e935c823b4441ac05b7c0c4839fd", "title": "Anomaly Detection Techniques in Smart Grid Systems: A Review"}, {"paperId": "cc5e9c7a2d4be95e8daa9a2ef0460f3036a66db5", "title": "Vector Auto-Regression-Based Predictive model for Smart Meter"}, {"paperId": "507a871c44ab588b804ff42c0edfc9ea5c38a411", "title": "Understanding Multi-Scale Spatiotemporal Energy Consumption Data: A Visual Analysis Approach"}, {"paperId": "8388875ce48b8517c8987a4a7096f6b14dfb548c", "title": "Deep Learning Techniques for Smart Meter Data Analytics: A Review"}, {"paperId": "bdc6722f0b7a59c0d1f4445535a876374134b0df", "title": "A Data Analytics/Big Data Framework for Advanced Metering Infrastructure Data"}, {"paperId": "d5f46c8e11cd4857021b86d8414539ff6be0181c", "title": "Single Phase Energy Smart Meter System Design and Implementation Using RFID and Based on IoT"}, {"paperId": "0ccfa0319b1a455fa155fd071313818fe716fb37", "title": "End-User Privacy Protection Scheme from cyber intrusion in smart grid advanced metering infrastructure"}, {"paperId": "4293b10197f9d58c89590486eb9d91b5a7fc4e20", "title": "User preferences for privacy features in digital assistants"}, {"paperId": "39fbe2f95e8cde7517ec3b692a7f9053b13901c1", "title": "Research on data-driven identification and prediction of heat response time of urban centralized heating system"}, {"paperId": "32a83829d86d972f6b34b26570e8681bf8c6e330", "title": "A multi-tier architecture for data analytics in smart metering systems"}, {"paperId": "b8c455fd434858572fc409b5b4fe0dc0a2ab9793", "title": "The Power of Big Data and Data Analytics for AMI Data: A Case Study"}, {"paperId": "ec5d48d979778a7c119d58f8a010131e4c1edf81", "title": "Analytics framework for optimal smart meters data processing"}, {"paperId": "cfcb0198211f3e0451eb65e4fe4998074d5af843", "title": "Evaluation of big data frameworks for analysis of smart grids"}, {"paperId": "2a678fb30a85d686004c3c9ffdb480f540c65470", "title": "Recognition and classification of typical load profiles in buildings with non-intrusive learning approach"}, {"paperId": "3ac75414cbb3a056bcd298748bb0e5df344093e3", "title": "Location-Based Optimized Service Selection for Data Management with Cloud Computing in Smart Grids"}, {"paperId": "1e97d20693570d229c7e3dcb0a4b86015f49119d", "title": "A Cloud-Based System Architecture for Advanced Metering in Smart Cities"}, {"paperId": "f4037ae4edabc58d6af63b7a9e958901f66682db", "title": "AFrame: Extending DataFrames for Large-Scale Modern Data Analysis"}, {"paperId": "977fcda04bbb50b7418e58722aec3e4f5a10b827", "title": "SmartM: A Non-intrusive Load Monitoring Platform"}, {"paperId": "fc24cf7cf075451753a883ec290348d2bea675cc", "title": "Data analytics criteria of IoT enabled smart energy meters (SEMs) in smart cities"}, {"paperId": "6af6848157efe7f9701b72aa045a736209635d6c", "title": "Two approaches for synthesizing scalable residential energy consumption data"}, {"paperId": "bcc86da4983f434fc01feed970bcbd0232ddb464", "title": "Data Analytics of IoT Enabled Smart Energy Meter in Smart Cities"}, {"paperId": "704add092a50039b1b14f92517f6733035c57eec", "title": "Clustering-based analysis for residential district heating data"}, {"paperId": "a93733189002cc6e09004db95df0dd2e23a78270", "title": "Data Storage and Maintenance Challenges: The Case of Advanced Metering Infrastructure Systems"}, {"paperId": "7b6f55863a7e67e7e2aeb0dd0044e47297fe5aa1", "title": "Architecture Design of Smart Meter Controlling System for Dynamic IP Environments"}, {"paperId": "372b4ca1aa48904e843034b0c80e7a990b16bf34", "title": "SciCloud: A Scientific Cloud and Management Platform for Smart City Data"}, {"paperId": "c23f8c2862edaf655d8094bc3bc5664e6007e4ec", "title": "Energy Efficient Energy Analytics"}, {"paperId": "1b3eb63801bdbe8b22b6e40332685760def107c1", "title": "Big Data Analytics for Smart Grids, the Cyberphysical System in Energy—A Bibliographic Review"}, {"paperId": "3b2ba4bb1c9d23519c2d0182ba3c0fe56995a2e1", "title": "The Role of Big Data Analytics in Smart Grid Management"}, {"paperId": "55be845716d278389c4b485886bfd15c68bc0790", "title": "Efficient Load Profiling and Forecasting in Large Electric Power Systems"}, {"paperId": "027ef416624e8b357776576aa32be8f07bf4cff3", "title": "Scalable unified data analytics"}, {"paperId": "230f3f91f6a12aa45d10902a9dcfd03dc5b1bed6", "title": "GPU Accelerated Top-K Selection With Efficient Early Stopping"}, {"paperId": "b55f01df38efa3dd43b609c3b5649dc2a0a8d8b7", "title": "Types of Stream Processing Algorithms"}, {"paperId": "b0fe1b78842e02bc3c09eb00b7eb0bace58ff2cb", "title": "Data Analytics for Low Voltage Electrical Grids"}, {"paperId": "09660ebdb3dbaed953d550008a495038232c55d5", "title": "Smart Meter Data Analytics using Hadoop"}]}
