{"paperId": "329137edc9af04eaef06e9fc70ab211ab006db9a", "publicationVenue": null, "title": "Message Authentication and Provenance Verification for Industrial Control Systems", "abstract": "Successful attacks against industrial control systems (ICSs) often exploit insufficient checking mechanisms. While firewalls, intrusion detection systems, and similar appliances introduce essential checks, their efficacy depends on the attackers’ ability to bypass such middleboxes. We propose a provenance solution to enable the verification of an end-to-end message delivery path and the actions performed on a message. Fast and flexible provenance verification (F2-Pro) provides cryptographically verifiable evidence that a message has originated from a legitimate source and gone through the necessary checks before reaching its destination. F2-Prorelies on lightweight cryptographic primitives and flexibly supports various communication settings and protocols encountered in ICS thanks to its transparent, bump-in-the-wire design. We provide formal definitions and cryptographically prove F2-Pro’s security. For human interaction with ICS via a field service device, F2-Profeatures a multi-factor authentication mechanism that starts the provenance chain from a human user issuing commands. We compatibility tested F2-Proon a smart power grid testbed and reported a sub-millisecond latency overhead per communication hop using a modest ARM Cortex-A15 processor.", "venue": "ACM Trans. Cyber Phys. Syst.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-06", "journal": {"name": "ACM Transactions on Cyber-Physical Systems", "pages": "1 - 28", "volume": "7"}, "authors": [{"authorId": "3021708", "name": "Ertem Esiner"}, {"authorId": "2192980", "name": "Utku Tefek"}, {"authorId": "3105261", "name": "D. Mashima"}, {"authorId": "50461965", "name": "Binbin Chen"}, {"authorId": "1687748", "name": "Z. Kalbarczyk"}, {"authorId": "1772082", "name": "D. Nicol"}], "citations": [{"paperId": "91470c2cc68f54a5ac16c251997f4c86b0ff5a5b", "title": "A Smart Grid Ontology: Vulnerabilities, Attacks, and Security Policies"}]}
