{"paperId": "32a616a105870c594476a9bba35dc5c602aae1d7", "publicationVenue": null, "title": "Big data in IBD: a look into the future", "abstract": null, "venue": "Nature reviews: Gastroenterology & hepatology", "year": 2019, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-01-18", "journal": {"name": "Nature Reviews Gastroenterology & Hepatology", "pages": "312-321", "volume": "16"}, "authors": [{"authorId": "82975584", "name": "P. Olivera"}, {"authorId": "2379943", "name": "S. Danese"}, {"authorId": "35000593", "name": "Nicolas Jay"}, {"authorId": "46476596", "name": "G. Natoli"}, {"authorId": "1387474555", "name": "L. Peyrin-Biroulet"}], "citations": [{"paperId": "d58dcb91c9172b8c4620d34d517e3d00012a576c", "title": "Pharmacological induction of autophagy reduces inflammation in macrophages by degrading immunoproteasome subunits"}, {"paperId": "2120e7a1960067b1f49da484d407354269264dd8", "title": "Аналіз публічних угод злиття та поглинання (M&A) у фармацевтичній сфері на основі методу ринкових угод"}, {"paperId": "b61aaea5372600e32d7ad9cd80c7dcffcca45618", "title": "Artificial intelligence image-based prediction models in IBD exhibit high risk of bias: A systematic review."}, {"paperId": "47cdbb859e97829f7d8d079ad084a367e136a37e", "title": "Therapeutic application and potential mechanism of plant-derived extracellular vesicles in inflammatory bowel disease."}, {"paperId": "f368721271df8547dca97c722a52e0aae60f068c", "title": "Transcriptome analysis identifies genetic risk markers and explores the pathogenesis for inflammatory bowel disease."}, {"paperId": "f5c5c751f2812c973f2b71a6c03fd48273f39a30", "title": "Pathogenesis and precision medicine for predicting response in inflammatory bowel disease: advances and future directions"}, {"paperId": "cb4c71f3e9d3e78511fd1ec068f1e34c541a460d", "title": "Anemoside B4, a new pyruvate carboxylase inhibitor, alleviates colitis by reprogramming macrophage function."}, {"paperId": "e52651499a0c2c7d4f65d948de24af0aedd7326b", "title": "Cocreation to Facilitate Communication and Collaboration Between Multidisciplinary Stakeholders in eHealth Research and Development: Case Study of the CARRIER (Coronary Artery Disease: Risk Estimations and Interventions for Prevention and Early Detection) Consortium"}, {"paperId": "dabfe275b4c5387350e9cb89739301ab3f612904", "title": "Identification of OLA1 as a Novel Protein Target of Vitexin to Ameliorate Dextran Sulfate Sodium-Induced Colitis with Tissue Thermal Proteome Profiling."}, {"paperId": "dd77d2b2898a403e8dba7e04f4ca0590c645c635", "title": "Treatment strategy changes for inflammatory bowel diseases in biologic era: results from a multicenter cohort in Japan, Far East 1000"}, {"paperId": "12bdfeb93fafdcccbb422d2a49957ae2ce647787", "title": "GRK2 Mediates Macrophage Polarization by Regulating EP4-cAMP-pCREB Signaling in Ulcerative Colitis and the Therapeutic Effect of Paroxetine on Mice with DSS-Induced Colitis"}, {"paperId": "9cbadc4940ca547e9ff6e90a8782b65558d63098", "title": "Artificial intelligence in inflammatory bowel disease: implications for clinical practice and future directions"}, {"paperId": "2ad9bd0b205340eea5987fc8a551f2024fa1e977", "title": "Small molecule metabolites: discovery of biomarkers and therapeutic targets"}, {"paperId": "1216a72a5d244945cb5f8103db1bb856b9b62d6f", "title": "CRISSPAC: A web-based platform for predicting the SYNTAX Score and severity of coronary artery disease"}, {"paperId": "ad43250e78f573213a217348c582e740b80720df", "title": "Big Data in Gastroenterology Research"}, {"paperId": "1d21c82c7452d5860f233950f43a67418ca90775", "title": "Performance Comparison of Big Data Processing Utilizing SciDB and Apache Accumulo Databases"}, {"paperId": "4c942f95ac0406672a13a1ce383d7d82da22b285", "title": "Neglected scrub typhus: An updated review with a focus on omics technologies"}, {"paperId": "dae0097383dd9c068cbaf6469ebf1088b427ee93", "title": "Robust 2D MoS2 Artificial Synapse Device Based on a Lithium Silicate Solid Electrolyte for High-Precision Analogue Neuromorphic Computing."}, {"paperId": "f7b66eb78e319f19eb5b370d3d7cbbec3a38c178", "title": "Artificial Intelligence/Machine Learning and Mechanistic Modeling Approaches as Translational Tools to Advance Personalized Medicine Decisions"}, {"paperId": "0a107ec8b37ed53089b59db83f80f0fd02545c94", "title": "Electronic health record-based facilitation of familial hypercholesterolaemia detection sensitivity of different algorithms in genetically confirmed patients"}, {"paperId": "902f66f1fc82a0aa4ef9d98c80f72a03b24088c1", "title": "Development of a multimodal machine-learning fusion model to non-invasively assess ileal Crohn's disease endoscopic activity"}, {"paperId": "6d97d97bd40da994ba40182e7890dc8533d73562", "title": "Towards an Effective Monitoring, Evaluation and Learning (MEL) System: Challenges and Solutions in a Data Science Perspective"}, {"paperId": "41733bf49ad7982290dc790ab9e9580d17577c16", "title": "Research hotspot and trend analysis in the diagnosis of inflammatory bowel disease: A machine learning bibliometric analysis from 2012 to 2021"}, {"paperId": "2d9c87d30100adfb9a6459a76a5fa65a6210862a", "title": "Exploring the Underlying Mechanism of Ren-Shen-Bai-Du Powder for Treating Inflammatory Bowel Disease Based on Network Pharmacology and Molecular Docking"}, {"paperId": "e0059e8fb9f3309849be69f985ba4dd8bc8221cd", "title": "Machine Learning Can Predict the Probability of Biologic Therapy in Patients with Inflammatory Bowel Disease"}, {"paperId": "8281ae2c43f201456541be616499c834a1af8219", "title": "Applications of Neural Networks in Liver Transplantation"}, {"paperId": "5c1d7d4a766b76db649eac589fdff87eb7dabbe0", "title": "Nutraceuticals for the Treatment of IBD: Current Progress and Future Directions"}, {"paperId": "2b96c32468d5269e6833efbb3b6d3ce00b2d45a5", "title": "Commensal bacteria-derived extracellular vesicles suppress ulcerative colitis through regulating the macrophages polarization and remodeling the gut microbiota"}, {"paperId": "f177f4c8e465f58a83e51814dfa657200f6e1f82", "title": "Artificial Intelligence for Inflammatory Bowel Diseases (IBD); Accurately Predicting Adverse Outcomes Using Machine Learning"}, {"paperId": "b2918161f78c34a35d32b86926808f2e2dbe3ba5", "title": "Fast continuous streaming sort in big streaming data environment under fixed-size single storage"}, {"paperId": "9bea5d8ec354bf2ed130786883c0794bd79ac7a8", "title": "Therapeutic effect of indirubin-loaded bovine serum albumin nanoparticules on ulcerative colitis."}, {"paperId": "e65fc52aec8a553aa3c3141fda2be0cfe7129eb4", "title": "Chronisch-entzündliche Darmerkrankung"}, {"paperId": "bf87ac2247a694963cc88410ee2c4bf2c3512eb8", "title": "Review article: randomised controlled trials in inflammatory bowel disease—common challenges and potential solutions"}, {"paperId": "7f355658c38ebb98d363630cd0acb66407f76685", "title": "The Network Distance Learning System Aided by Computer Information and Online Video Technology"}, {"paperId": "74c8c151a53af3bd5180be8821527eb133142e65", "title": "Digital Health Technologies for Remote Monitoring and Management of Inflammatory Bowel Disease: A Systematic Review"}, {"paperId": "7bc9b50707546270fbe67c3e0a953075ff7f29a3", "title": "Artificial intelligence in gastroenterology: A state-of-the-art review"}, {"paperId": "9c4537b203113177c1ee4e3661fa0e6604c1e3fd", "title": "Network Biology Approaches to Achieve Precision Medicine in Inflammatory Bowel Disease"}, {"paperId": "44e09d0241177797c0fdb22555e187c763e904fc", "title": "Machine Learning-based Prediction Models for Diagnosis and Prognosis in Inflammatory Bowel Diseases: A Systematic Review."}, {"paperId": "6af226bd8caf280fd787b886469d06daac7f5b87", "title": "Development of a machine-learning model to assess terminal ileum Endoscopic healing in pediatric Crohn's disease from Magnetic Resonance Enterography data"}, {"paperId": "dd5e78378e7162e5935322105f959e9a5f5acfa7", "title": "A recent update on the use of Chinese medicine in the treatment of inflammatory bowel disease."}, {"paperId": "04367442e6feb828190e571f3e9719dbb79f3ddc", "title": "Predictors: How to Approach the Individualization of Treatment."}, {"paperId": "de069c559db3c19982a1d7e2a59b30fea4fe930b", "title": "Serum exosomal pregnancy zone protein as a promising biomarker in inflammatory bowel disease"}, {"paperId": "3c7a444279236ebcb1a25408fb844c1173516585", "title": "Disruptive innovations in the clinical laboratory: catching the wave of precision diagnostics"}, {"paperId": "ca8a30f9b8b8bfc7764257b335847a77b113f0dd", "title": "Artificial intelligence-rationalized balanced PPARα/γ dual agonism resets dysregulated macrophage processes in inflammatory bowel disease"}, {"paperId": "656b9f72b9d752735fb00c883fb66dcf2eb236a2", "title": "Meet the Regional Editor"}, {"paperId": "32bc68639f44d62d9be04a01ebabdf98db282d8e", "title": "Superior treatment persistence with ustekinumab in Crohn’s disease and vedolizumab in ulcerative colitis compared with anti‐TNF biological agents: real‐world registry data from the Persistence Australian National IBD Cohort (PANIC) study"}, {"paperId": "69259aee0e7f83e897b3bd555d161a9dcb9c21af", "title": "Parallel compression for large collections of genomes"}, {"paperId": "8becf144134e36245e4680a9f166d7582d4fda51", "title": "Evaluation of Natural Language Processing for the Identification of Crohn Disease–Related Variables in Spanish Electronic Health Records: A Validation Study for the PREMONITION-CD Project"}, {"paperId": "34d4037c8f111691ce177e29ccaf7680f8eed5dd", "title": "Immunological Networks Defining the Heterogeneity of Inflammatory Bowel Diseases"}, {"paperId": "6188d36808c84067c573c2a4d891ebc71503b8eb", "title": "Knowledge of Diagnostic and Therapeutic Aspects of IBD Among Nurses Working in Digestive Endoscopy"}, {"paperId": "d18e7bc2403cc86bd160618c6686b5a826356fdf", "title": "Noninvasive early diagnosis of intestinal diseases based on artificial intelligence in genomics and microbiome"}, {"paperId": "f969a1641b5ac21faac494f461b1aa106213a938", "title": "Applying artificial intelligence in the microbiome for gastrointestinal diseases: A review"}, {"paperId": "fd1c54af83e30965dd6f3d6b7d8f8309abef5c92", "title": "Comment intégrer les données massives dans la pratique du pneumologue : le syndrome d’apnées du sommeil comme cas d’usage"}, {"paperId": "595fa9a11d7ae68745f480394af46c8106a333ec", "title": "Biological functions of NLRP3 inflammasome: A therapeutic target in inflammatory bowel disease."}, {"paperId": "d7a65a82c34833768451ca669ed83fb06688464c", "title": "A systematic review of emerging information technologies for sustainable data-centric health-care"}, {"paperId": "8af3be5ea9089a55c36b64ef58358cf2bac9b2e1", "title": "Clinical applications of artificial intelligence and machine learning‐based methods in inflammatory bowel disease"}, {"paperId": "59f56e5db0eaf5e1ba60676566626b020003bd3c", "title": "Designing Consumer Health Information Technology to Support Biform and Articulation Work: A Qualitative Study of Diet and Nutrition Management as Patient Work"}, {"paperId": "c0f56843ce02f92468fe515af6d5eff966e9aa68", "title": "Improving early diagnosis of rare diseases using Natural Language Processing in unstructured medical records: an illustration from Dravet syndrome"}, {"paperId": "9d84dad8aec5db9910aa5297e8090483c70c1911", "title": "IBD Systems Biology Is Here to Stay."}, {"paperId": "1fd4dcdec997c1d11d69f2831c632d3ad87e56c2", "title": "GPA peptide enhances Nur77 expression in intestinal epithelial cells to exert a protective effect against DSS‐induced colitis"}, {"paperId": "78320e40784cb39c01b1ebc7d5ed74fc52045619", "title": "Dysbiosis of gut microbiota in inflammatory bowel disease: Current therapies and potential for microbiota-modulating therapeutic approaches"}, {"paperId": "7165bf44255da5486fb80fe3f30747aa898e1792", "title": "Prevalence of the pathobiont adherent‐invasive Escherichia coli and inflammatory bowel disease: a systematic review and meta‐analysis"}, {"paperId": "171406139911c63a802c51fdfaa1d127f36f836e", "title": "Serum IgG4 Subclass Deficiency Defines a Distinct, Commonly Encountered, Severe Inflammatory Bowel Disease Subtype."}, {"paperId": "2d6f7be893cfabd5b2717b2cea7bdfaf159acbce", "title": "GPA Peptide-Induced Nur77 Localization at Mitochondria Inhibits Inflammation and Oxidative Stress through Activating Autophagy in the Intestine"}, {"paperId": "69f7b3cd3a62271e0453ae169d5e7e478bbef006", "title": "Big data e inteligencia artificial en el futuro manejo de pacientes. ¿Por dónde empezar? ¿En qué punto nos encontramos? ¿Quo tendimus?"}, {"paperId": "f21cafc1b1c4238d92de2e4136edc67bab4c068a", "title": "Gut microbiome, big data and machine learning to promote precision medicine for cancer"}, {"paperId": "b589987ffe4f4afcef4696739641ee93ce5e8f74", "title": "Denosumab Regulates Gut Microbiota Composition and Cytokines in Dinitrobenzene Sulfonic Acid (DNBS)-Experimental Colitis"}, {"paperId": "7f17869a0916f4d301f3901aece2c3b576a09658", "title": "Downregulation of OCTN2 by Cytokines Plays an Important Role in the Progression of Inflammatory Bowel Disease."}, {"paperId": "7eae0e7238d05a461a0827a195c705403bf2c7d8", "title": "What's new in IBD therapy: an \"omics network\" approach."}, {"paperId": "9fbd29185691eba3fd958d9a3f2083dada84d710", "title": "The burden of cost in inflammatory bowel disease: a medical economic perspective."}, {"paperId": "f47f0a2a8842005c698c2d02bc74e56c2002655e", "title": "Big data and artificial intelligence in future patient management. How is it all started? Where are we at now? Quo tendimus?"}, {"paperId": "6ad0201ae03905b01f1df1d052823a8381152fb6", "title": "Head-to-head trials in inflammatory bowel disease: past, present and future"}, {"paperId": "50ca5987c81e74b98184fa2f5a1a7c1daf4de430", "title": "Immunological Profiling of Paediatric Inflammatory Bowel Disease Using Unsupervised Machine Learning."}, {"paperId": "fa826aac74e73b7acb7c3fdbf405cfdbff9dadef", "title": "Artificial intelligence in inflammatory bowel disease: current status and opportunities"}, {"paperId": "a20a3a64bd47d2e21b53df7d3e416b89abe7cd09", "title": "Faecal Microbiota Microsphere Contributed to Relieving Gut Barrier Damage in Colitis"}, {"paperId": "01a1de1f6bc1374eecb221122d017d8743296904", "title": "Precision medicine in inflammatory bowel disease: concept, progress and challenges"}, {"paperId": "5b15e2065a6edb5f390a86a373a481ff6bff12fc", "title": "Phase 1, 2 and 3 trials in inflammatory bowel diseases: a practical guide for the non-specialist."}, {"paperId": "8b64c794ba2e40a289cde2426ee5115cc6bd8b34", "title": "New Drugs In The Ulcerative Colitis Pipeline: Prometheus Unbound."}, {"paperId": "1fec1f29d9f3b3fc48251c24c98d4d8fa3b571f7", "title": "Machine-learning based patient classification using Hepatitis B virus full-length genome quasispecies from Asian and European cohorts"}, {"paperId": "a09d492655dfa9ebf9910324891407f1134ee127", "title": "Intestinal anti-inflammatory effects of artichoke pectin and modified pectin fractions in the dextran sulfate sodium model of mice colitis. Artificial neural network modelling of inflammatory markers."}, {"paperId": "95ec50429ba475119fb8797fa9762a2ddbb23904", "title": "ПЕРСПЕКТИВИ ТА ПРОБЛЕМИ ВИКОРИСТАННЯ ТЕХНОЛОГІЙ BIG DATA В МЕДИЦИНІ"}, {"paperId": "cdcad24476fbd306aafe5828270f67e91b526a47", "title": "The Role of Laparoscopic, Robotic, and Open Surgery in Uncomplicated and Complicated Inflammatory Bowel Disease."}, {"paperId": "f43a1f737579d20735d06f3dedbb16eb1a44714a", "title": "Application of Big Data analysis in gastrointestinal research"}, {"paperId": "445daaab2efd61a549d1dddf7b283b098aabaac7", "title": "Towards an Analysis of Post-Transcriptional Gene Regulation in Psoriasis via microRNAs using Machine Learning Algorithms"}, {"paperId": "353f4715f36356ab9fef50a35b53de981ff58b76", "title": "Tackling pharmacological response heterogeneity by PBPK modeling to advance precision medicine productivity of nanotechnology and genomics therapeutics"}, {"paperId": "b44b02bbe44fde95ca08e7615a6b8e3f5bdcfd3d", "title": "From Data to Wisdom: A Review of Applications and Data Value in the context of Small Data"}, {"paperId": "c2f824ba984963da928eb07f902331aead6617ea", "title": "Health sector and application of big data: A case study of India"}, {"paperId": "4e378a03ac6c7e8d393b77d24b05bb96cd1ea16a", "title": "Magnetic Resonance Enterography indices for ileal Crohn's disease assessment: 1 Comparison between classical and machine-learning-based indices"}, {"paperId": "fe106912299ef7496465bb86e4d6328a5c254c89", "title": "Paroxetine Mediate Macrophage Polarization by Regulating GRK2-EP4-cAMP-pCREB Signaling Pathway in Treating Mice with DSS-Induced Colitis"}, {"paperId": "3576cca815ccb224cba283b9eefa78a056cc8a3b", "title": "Insights on the Potential Preventive and Healing Effects of Flavonoids in Inflammatory Bowel Disease"}, {"paperId": "b30026b14e8a28b1fa028f7ccc8bd3a08522158a", "title": "Inflammatory Pathways and In Vivo Studies of Inflammatory Bowel Disease"}, {"paperId": "373869f627cb972b040c2f3673353f1ca6035fbf", "title": "Master Computer Science The automatic labelling of medical entities in Dutch endoscopy reports"}, {"paperId": "815fd6f5a6ff9964ce7adc8b931a950190c18c7f", "title": "INVITED REVIEW SERIES: \"New frontiers in sleep disordered breathing\" Big data in sleep apnoea: opportunities and challenges"}]}
