{"paperId": "32af3ad2732983a82810d0a36d828a634f063af6", "publicationVenue": null, "title": "Multiscale ultra‐short‐term wind power prediction model based on GD‐IFEM‐PSO and VMD‐BP", "abstract": "Wind power prediction enables advance prediction of the future capacity of wind farms to improve production, increase capacity and reduce costs, however, wind power generation data are highly unstable, making it difficult to achieve high‐precision prediction. Signal decomposition methods and optimization algorithms allow for data smoothing and optimization of parameter settings, but the limitations of parameter dependency and the slow optimization search process prevent existing research from being applied in a practical setting. To address these issues, this article proposes a multiscale ultra‐short‐term wind power prediction model based on particle swarm optimization based on greedy dynamic and integrated fitness evaluation method (GD‐IFEM‐PSO) and variational mode decomposition and back propagation network (VMD‐BP). First, this article improves the velocity update formula in the particle swarm optimization algorithm by the proposed GD weight and sets up a fitness function using multiple evaluation metrics by the proposed integrated fitness evaluation method (IFEM), so that the improved particle swarm optimization algorithm achieves high efficiency in the optimization search while ensuring the comprehensiveness of the evaluation. Second, the variable mode decomposition (VMD) decomposition algorithm is used to decompose the historical wind power data to achieve smoothing of the wind power data, and the improved particle swarm optimization algorithm is used to optimize the K and ⍺ values in the VMD decomposition algorithm to improve the comprehensive performance of the decomposition. Then, to achieve data reduction and fast model training, the components are divided into trend components, low‐frequency vibration components, high‐frequency vibration components, and random noise components according to the central frequency, so that the model can better grasp the data trend while reducing the number of components and achieving high prediction accuracy. Finally, the different components are predicted by the BP neural network and the predicted values of the different categories of components are reconstructed into the final wind power prediction values. To demonstrate the rationality and progressiveness of the proposed model, several models are compared on several data sets, and the results show that the proposed model has faster prediction speed and higher prediction performance, and is more suitable for application in real‐world environments.", "venue": "Energy Science &amp; Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-31", "journal": {"name": "Energy Science & Engineering", "pages": "4700 - 4721", "volume": "11"}, "authors": [{"authorId": "2213124502", "name": "Zhe Zhang"}, {"authorId": "2107962084", "name": "Yongsheng Wang"}, {"authorId": "2136441862", "name": "Zhiwei Xu"}, {"authorId": "2264973779", "name": "Jing Gao"}, {"authorId": "2188344107", "name": "Limin Liu"}], "citations": []}
