{"paperId": "32b8734b4834acf22fac8399026119fa3e60de79", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Investigating Multilingual Instruction-Tuning: Do Polyglot Models Demand for Multilingual Instructions?", "abstract": "The adaption of multilingual pre-trained Large Language Models (LLMs) into eloquent and helpful assistants is essential to facilitate their use across different language regions. In that spirit, we are the first to conduct an extensive study of the performance of multilingual models on parallel, multi-turn instruction-tuning benchmarks across a selection of the most-spoken Indo-European languages. We systematically examine the effects of language and instruction dataset size on a mid-sized, multilingual LLM by instruction-tuning it on parallel instruction-tuning datasets. Our results demonstrate that instruction-tuning on parallel instead of monolingual corpora benefits cross-lingual instruction following capabilities by up to 4.6%. Furthermore, we show that the Superficial Alignment Hypothesis does not hold in general, as the investigated multilingual 7B parameter model presents a counter-example requiring large-scale instruction-tuning datasets. Finally, we conduct a human annotation study to understand the alignment between human-based and GPT-4-based evaluation within multilingual chat scenarios.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-21", "journal": {"name": "ArXiv", "volume": "abs/2402.13703"}, "authors": [{"authorId": "2258553215", "name": "Alexander Arno Weber"}, {"authorId": "2269539", "name": "Klaudia Thellmann"}, {"authorId": "2256877623", "name": "Jan Ebert"}, {"authorId": "1403909672", "name": "Nicolas Flores-Herr"}, {"authorId": "2284864340", "name": "Jens Lehmann"}, {"authorId": "2258551638", "name": "Michael Fromm"}, {"authorId": "2258668067", "name": "Mehdi Ali"}], "citations": []}
