{"paperId": "32bac68666652f2d6e6c9a2f9f006578bcd44340", "publicationVenue": {"id": "42af0896-7bcc-4002-8d09-63fd18f13f53", "name": "Journal of Internet Services and Applications", "type": "journal", "alternate_names": ["J Internet Serv Appl"], "issn": "1867-4828", "url": "http://www.jisajournal.com/", "alternate_urls": ["http://www.springer.com/computer/communication+networks/journal/13174", "http://link.springer.com/journal/volumesAndIssues/13174"]}, "title": "Towards a Decentralized Blockchain-Based Resource Monitoring Solution For Distributed Environments", "abstract": "The increasing number of connected users and devices to Cloud, Fog, and Edge environments encouraged the creation of many applications and services in the most varied areas and domains. Such services are highly distributed on top of heterogeneous infrastructures that require real-time monitoring. The monitoring process may be considered a complex task since it requires experienced users and robust cloud-based solutions to support the most varied needs in such scenarios. The main problem relies on the centralization of the monitoring approaches for cloud-centric solutions that represent a central point of failure in end-to-end communication, compromising the application's security and performance in case of high latency or downtime. In this context, blockchain networks enable exciting features such as decentralization, immutability, and traceability with higher security levels. This work is towards a blockchain-based and decentralized resource monitoring solution for distributed environments. The proposed solution integrates blockchain technology to continuously monitor, store, and safely broadcast Operating System performance counters in a highly decentralized fashion. The results demonstrated that a blockchain-based monitoring tool based on Smart Contract is feasible and that it may serve as an entry point for varied solutions for monitoring, security, scheduling, and so on.", "venue": "Journal of Internet Services and Applications", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-07", "journal": {"name": "Journal of Internet Services and Applications"}, "authors": [{"authorId": "2294489066", "name": "Rodrigo B. Dos Passos"}, {"authorId": "2296451", "name": "Kassiano J. Matteussi"}, {"authorId": "2086268570", "name": "Julio C. S. Dos Anjos"}, {"authorId": "2294488982", "name": "Claudio F. R. Geyer"}], "citations": []}
