{"paperId": "32bc68639f44d62d9be04a01ebabdf98db282d8e", "publicationVenue": {"id": "b584320a-9e3c-4c68-a677-a15f68472cb6", "name": "Alimentary Pharmacology and Therapeutics", "type": "journal", "alternate_names": ["Aliment Pharmacol Ther", "Aliment Pharmacol  Ther", "Alimentary Pharmacology & Therapeutics"], "issn": "0269-2813", "url": "http://www3.interscience.wiley.com/journal/117987555/home", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/13652036"]}, "title": "Superior treatment persistence with ustekinumab in Crohn’s disease and vedolizumab in ulcerative colitis compared with anti‐TNF biological agents: real‐world registry data from the Persistence Australian National IBD Cohort (PANIC) study", "abstract": "Medication persistence contributes real‐world evidence about treatment effectiveness, tolerability and prescriber and patient acceptability.", "venue": "Alimentary Pharmacology and Therapeutics", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-20", "journal": {"name": "Alimentary Pharmacology & Therapeutics", "pages": "292 - 301", "volume": "54"}, "authors": [{"authorId": "40170210", "name": "Y. Ko"}, {"authorId": "3842147", "name": "S. Paramsothy"}, {"authorId": "38389279", "name": "Yunki Y. Yau"}, {"authorId": "2346156", "name": "R. Leong"}], "citations": [{"paperId": "8fc2416ab4784c01a7532e132503e638d7c422f9", "title": "Selection Strategy of Second-Line Biologic Therapies in Adult Patients with Ulcerative Colitis Following Prior Biologic Treatment Failure: Systematic Review and Meta-Analysis."}, {"paperId": "569dd6e07c283257a7bcb6d2a3ab9706bec6b5c5", "title": "Gut microbiota and metabolites as predictors of biologics response in inflammatory bowel disease: A comprehensive systematic review."}, {"paperId": "39123ccd36dcd8911c5028590924227227da9694", "title": "Comparing clinical trial population representativeness to real-world users of 17 biologics approved for immune-mediated inflammatory diseases: an external validity analysis of 66,639 biologic users from the Italian VALORE project."}, {"paperId": "4c98c88d2a2f27fa58d00aa64e7d1c63285e30fa", "title": "Effectiveness and safety of vedolizumab and infliximab in biologic-naive patients with Crohn’s disease: results from the EVOLVE study"}, {"paperId": "e1fa30a7c9205dddec34751a69a21bc3a66d4ea5", "title": "Comparative effectiveness of ustekinumab vs. vedolizumab for anti-TNF-naïve or anti-TNF-exposed Crohn's disease: a multicenter cohort study"}, {"paperId": "509faad56646c3ea14722867d18fcb20e380d504", "title": "Comparative Persistence of Non-tumor Necrosis Factor (TNF) vs. TNF Antagonists for Post-operative Prophylaxis in Crohn’s Disease (CD)"}, {"paperId": "b1f36c4566b796ff425b44472b1fd7a9d3947f7d", "title": "Use of real-world data to assess the effectiveness of ustekinumab in treating IBD patients: a retrospective linked database study in northwest London"}, {"paperId": "0c7b10f6f8f630795c4bad60e38d4e5add335c30", "title": "Ustekinumab as induction and maintenance therapy for ulcerative colitis - national extended follow-up and a review of the literature."}, {"paperId": "b40c010014c9d73a95d7ce55e7c1f04d276f2f06", "title": "Real‐world treatment persistence of four commonly prescribed biologic therapies for moderate to severe psoriasis in Australia"}, {"paperId": "01617b567802e68242fd75c22626b99034922237", "title": "Long-term persistence and other treatment patterns among bio-naïve patients with Crohn’s disease treated with ustekinumab or adalimumab"}, {"paperId": "2cfd71eac5967a4e8a948b19bc8c3473f144e160", "title": "Reduction of butyric acid-producing bacteria in the ileal mucosa-associated microbiota is associated with the history of abdominal surgery in patients with Crohn’s disease"}, {"paperId": "72ac8437a7a9f0847b96a4f35669970ebd2291d9", "title": "Real-World Persistence of Ustekinumab in the Treatment of Inflammatory Bowel Disease."}, {"paperId": "c3efd063deba10f4af075ab89731c981d63f4a12", "title": "Early ileocecal resection for Crohn's disease is associated with improved long-term outcomes compared to anti-tumor necrosis factor therapy: a population-based cohort study."}, {"paperId": "901cdb271148b3c5d3cb6f45a4a4583c05c772a4", "title": "Themen – Stellungnahme zur Nutzenbewertung von Risankizumab (Morbus Crohn, vorbehandelte Patient*innen) vom 24. April 2023"}, {"paperId": "26da3c3a8751d4120f0dffb21d16be0e7445307d", "title": "Theoretical aspects of prescribing ustekinumab as first-line therapy for Crohn’s disease"}, {"paperId": "df3bd4c08c23b88fe697b83d14051925b08ea76d", "title": "Clinical and Demographic Features and Treatment Approaches for Inflammatory Bowel Diseases (Crohn’s Disease, Ulcerative Colitis) in the Russia. The Primery Results of the Analysis of the National Register"}, {"paperId": "0f660e8a483324e8975be39edf76325d41b13200", "title": "Comparison of the Persistence of Anti-TNF Agents and Ustekinumab in Patients with Crohn’s Disease: A Study Based on the Korean National Database"}, {"paperId": "ff98c1d401b57833eeb156865c3e10118fa2335e", "title": "Vedolizumab is superior to infliximab in biologic naïve patients with ulcerative colitis"}, {"paperId": "2ac0c31282a20a86491308ae889df5adde75e31f", "title": "Real-world outcomes of 54-week vedolizumab therapy and response durability after treatment discontinuation in ulcerative colitis: results from a multicenter prospective POLONEZ study"}, {"paperId": "35d665b10928d43a0991e3c357b1fb1cd820b18e", "title": "10 years of biologic use patterns in patients with inflammatory bowel disease: treatment persistence, switching and dose intensification – a nationwide population-based study"}, {"paperId": "c7a00ddec94eb211aace9462725d880d94d3a8b0", "title": "Effectiveness and Safety Profiles of Biological Therapies in Inflammatory Bowel Disease: Real Life Data from an Active Pharmacovigilance Project"}, {"paperId": "80d91b17f3a9c828a217d7f7beaa47c4665535c9", "title": "S802 Persistence Among Patients With Crohn’s Disease Previously Treated With an Anti-tumor Necrosis Factor Inhibitor and Switching or Cycling to Another Biologic Agent"}, {"paperId": "6366b6edce0fd2e7cf7ecc558b7b3df622815324", "title": "Comparative Effectiveness of Ustekinumab and Anti-TNF Agent as First-Line Biological Therapy in Luminal Crohn's Disease: A Retrospective Study From 2 Referral Centers."}, {"paperId": "d8cc3da594b0aba53825e30d1ea45d223bbb346c", "title": "Treatment Patterns and Standardized Outcome Assessments Among Patients With Inflammatory Conditions of the Pouch in a Prospective Multicenter Registry"}, {"paperId": "44795e46d8c56f279619b34ecf78989937c8fc0a", "title": "Ustekinumab versus adalimumab for induction and maintenance therapy in biologic-naive patients with moderately to severely active Crohn's disease: a multicentre, randomised, double-blind, parallel-group, phase 3b trial"}, {"paperId": "9a7e3147274f514e22dff4cf8bf6e82cf44acca2", "title": "Comparative Long-Term Drug Survival of Vedolizumab, Adalimumab, and Infliximab in Biologic-Naïve Patients with Ulcerative Colitis"}, {"paperId": "c0e36938d261d781d54d9de5a3b8108f617edd5a", "title": "Ustekinumab in Crohn’s Disease: New Data for Positioning in Treatment Algorithm"}, {"paperId": "1d4dedb97b7e189b141c27e485f1526f8962c3ba", "title": "Is There a Best First Line Biological/Small Molecule in IBD: Are We Ready for Sequencing?"}, {"paperId": "c205df1b475a24456b0928899c88d9b83bc5d4c4", "title": "Efficacy and Safety of Maintenance Ustekinumab for Ulcerative Colitis Through 3 Years: UNIFI Long-term Extension"}, {"paperId": "9b5b47127f6430c6c818b7a3e3933af90c4490c4", "title": "Editorial: early and persistent biological treatment and its impact on long term surgical outcomes in inflammatory bowel disease"}, {"paperId": "62325cafe56c4f2391e80d0e4646a50148242a76", "title": "Vedolizumab has longer persistence than infliximab as a first-line biological agent but not as a second-line biological agent in moderate-to-severe ulcerative colitis: real-world registry data from the Persistence Australian National IBD Cohort (PANIC) study"}, {"paperId": "db8d9c94c50258eaf72e810cbc43fe8a851cb4f0", "title": "Ustekinumab is associated with superior treatment persistence but not with higher remission rates versus vedolizumab in patients with refractory Crohn’s disease: results from a multicentre cohort study"}]}
