{"paperId": "32c1245c503f9358d6d8d5509ec04251df88c006", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Measuring Alignment of Online Grassroots Political Communities with Political Campaigns", "abstract": "Social media reduces barriers for the formation of large, self-organizing grassroots communities. For political campaigns this poses significant opportunities to address declining party membership, but also reputational risks and potential loss of campaign coherence. While balancing these factors is often done informally, we adopt a behavioural approach by using neural community embeddings to evaluate online communities along cultural, political, and demographic dimensions. We apply this technique to the 2020 U.S. Democratic presidential primaries and the website Reddit, providing novel insights into the important tension between campaigns and third-party actors. Using two benchmark comparison classes, we demonstrate that our embedding dimensions mirror their offline analogues, but more so the views of a candidate's supporters than the candidate's themselves. Finally, we introduce temporal aspects to our community embedding to evaluate the stability of political communities and their interrelations. These analyses serve as an exploration and application of our novel embedding methodology, and give insight into the relationship between online communities and the movements they support.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-31", "journal": {"pages": "806-816"}, "authors": [{"authorId": "2170594930", "name": "Cameron Raymond"}, {"authorId": "89922735", "name": "Isaac Waller"}, {"authorId": "32071555", "name": "Ashton Anderson"}], "citations": [{"paperId": "72ebff83fc77105478e1079a07affd04517c72c0", "title": "The Influence of Social Media Marketing on Voting Intention in Indonesia"}, {"paperId": "6e29d2bed34d6a9b45496e20e12637dc01e32ec1", "title": "Political Elites in False Statements on the Internet"}, {"paperId": "5471114e37448bea2457b74894b1ecb92bbcfdf6", "title": "From Pretraining Data to Language Models to Downstream Tasks: Tracking the Trails of Political Biases Leading to Unfair NLP Models"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}]}
