{"paperId": "32d38f648589122251448cca59873e827f4bebd1", "publicationVenue": null, "title": "Nanopore base calling on the edge", "abstract": "Abstract Motivation MinION is a portable nanopore sequencing device that can be easily operated in the field with features including monitoring of run progress and selective sequencing. To fully exploit these features, real-time base calling is required. Up to date, this has only been achieved at the cost of high computing requirements that pose limitations in terms of hardware availability in common laptops and energy consumption. Results We developed a new base caller DeepNano-coral for nanopore sequencing, which is optimized to run on the Coral Edge Tensor Processing Unit, a small USB-attached hardware accelerator. To achieve this goal, we have designed new versions of two key components used in convolutional neural networks for speech recognition and base calling. In our components, we propose a new way of factorization of a full convolution into smaller operations, which decreases memory access operations, memory access being a bottleneck on this device. DeepNano-coral achieves real-time base calling during sequencing with the accuracy slightly better than the fast mode of the Guppy base caller and is extremely energy efficient, using only 10 W of power. Availability and implementation https://github.com/fmfi-compbio/coral-basecaller Supplementary information Supplementary data are available at Bioinformatics online.", "venue": "Bioinform.", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-09", "journal": {"name": "Bioinformatics", "pages": "4661 - 4667", "volume": "37"}, "authors": [{"authorId": "1734488", "name": "Peter Perešíni"}, {"authorId": "2342953", "name": "V. Boža"}, {"authorId": "1735003", "name": "Broňa Brejová"}, {"authorId": "1746295", "name": "T. Vinař"}], "citations": [{"paperId": "37ec6a40beb567c70123b5f5913f02a00d8d4d78", "title": "The Application of Long-Read Sequencing to Cancer"}, {"paperId": "1583c6d0cc65b294e620ad2e580c69067aa89455", "title": "Complete genome sequence of plant growth-promoting Bacillus stratosphericus AIMST-CREST02 isolated from bulk soil of a paddy field."}, {"paperId": "f3b616530e5054e827e7cc73e28923e683452eac", "title": "Draft genome sequence of Planococcus sp. SK3692"}, {"paperId": "06bf7a094c9560ba31858fb04a956f70073c029a", "title": "A Framework for Designing Efficient Deep Learning-Based Genomic Basecallers"}, {"paperId": "a8c1a0c59767b09a5dbea6e185f56f8119d81d6f", "title": "RawAlign: Accurate, Fast, and Scalable Raw Nanopore Signal Mapping via Combining Seeding and Alignment"}, {"paperId": "391e31c49c806a18503f85d8de853886337bd799", "title": "Whole-genome sequence of Paenibacillus sp., isolated from soil, Fort Collins, Colorado, USA"}, {"paperId": "760fae9b1bc54533e3fb148a11055eb8107404b4", "title": "Short- and Long-Read Sequencing Reveals the Presence and Evolution of an IncF Plasmid Harboring blaCTX-M-15 and blaCTX-M-27 Genes in Escherichia coli ST131"}, {"paperId": "ab58b3143f62743992554706a51f44d04ccaab18", "title": "Applications of long-read sequencing to Mendelian genetics"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "4dd6dafc434211a2232b7076264f0f627258dc4f", "title": "Clinical Diagnostics of Bacterial Infections and Their Resistance to Antibiotics—Current State and Whole Genome Sequencing Implementation Perspectives"}, {"paperId": "dc818351acdd1b78ea3b5d9d159c354ef579a7d7", "title": "Complete Genome Sequence of the Carboxydotrophic Knallgas Bacterium Pseudomonas carboxydohydrogena Strain DSM 1083"}, {"paperId": "c06ed8e93c878fc88ed535433630efd25f45e3b6", "title": "FEATURES OF MUTATION DETECTION IN LONG-READ WHOLE GENOME SEQUENCING DATA"}, {"paperId": "9c742aa0c4909ed8f5383d32727d328df9e67425", "title": "Portable nanopore-sequencing technology: Trends in development and applications"}, {"paperId": "c580902040263554ae04b76ee67728af96f74690", "title": "An Introduction to Nanopore Sequencing: Past, Present, and Future Considerations"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "217199ad7af05c9d8e6318fc5d1bdb5d8d2279f6", "title": "TargetCall: Eliminating the Wasted Computation in Basecalling via Pre-Basecalling Filtering"}, {"paperId": "33a976423a7e46650d09193a5dc9691ba1f1dbe1", "title": "RUBICON: a framework for designing efficient deep learning-based genomic basecallers"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "3636c512e52009b1c26142121c66e8ca9fe5b6a7", "title": "DNA data storage, sequencing data-carrying DNA"}, {"paperId": "a1582994ff7cdd8ba627f72b2be5ec06c6c37db6", "title": "Satellite DNAs and human sex chromosome variation."}, {"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis"}, {"paperId": "4d3fb0382d679483570650e091c89a086a585c07", "title": "GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis"}, {"paperId": "061706935f4c98c24496c0f9ed46f0dd391056d4", "title": "Collaboration between Clinical and Academic Laboratories for Sequencing SARS-CoV-2 Genomes"}, {"paperId": "b12c8e13c07eca9f72bf349405ddb9802f2cbbd4", "title": "Dynamic Pooling Improves Nanopore Base Calling Accuracy"}, {"paperId": "76cc74960bd5fb21e0a089013ba87695c6914506", "title": "Alternative Base Callers Aid Real-time Analysis of SARS-CoV-2 Sequencing Runs"}, {"paperId": "b5db73dd302498ed19732d724bdfca4bec880cd0", "title": "1 Collaboration between clinical and academic laboratories for sequencing SARS-CoV-2 1 genomes 2"}, {"paperId": "dd9473739d761da65646dafe6cef63e2d8c3cd65", "title": "Effects of Food Concentration and Light Intensity on the Growth of a Model Coral"}]}
