{"paperId": "32e63ee82c2dc30e3a91da4dcac05990a72b8e3f", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "Green Anaconda Optimization: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems", "abstract": "A new metaheuristic algorithm called green anaconda optimization (GAO) which imitates the natural behavior of green anacondas has been designed. The fundamental inspiration for GAO is the mechanism of recognizing the position of the female species by the male species during the mating season and the hunting strategy of green anacondas. GAO’s mathematical modeling is presented based on the simulation of these two strategies of green anacondas in two phases of exploration and exploitation. The effectiveness of the proposed GAO approach in solving optimization problems is evaluated on twenty-nine objective functions from the CEC 2017 test suite and the CEC 2019 test suite. The efficiency of GAO in providing solutions for optimization problems is compared with the performance of twelve well-known metaheuristic algorithms. The simulation results show that the proposed GAO approach has a high capability in exploration, exploitation, and creating a balance between them and performs better compared to competitor algorithms. In addition, the implementation of GAO on twenty-one optimization problems from the CEC 2011 test suite indicates the effective capability of the proposed approach in handling real-world applications.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "2132379761", "name": "Mohammad Dehghani"}, {"authorId": "2150730612", "name": "Pavel Trojovský"}, {"authorId": "2128305375", "name": "O. Malik"}], "citations": [{"paperId": "7478db5fbbc293f364deaafdc73a042262934212", "title": "Guided learning strategy: A novel update mechanism for metaheuristic algorithms design and improvement"}, {"paperId": "4ced0e48870f9f32be6117943eef56b288f09864", "title": "Improved Green Anaconda Optimization Algorithm-based Coverage Path Planning Mechanism for Heterogeneous Unmanned Aerial Vehicles"}, {"paperId": "b73cbf598d68f9a0aea863ea747d653ea5bd57b0", "title": "Green anaconda optimized DRN controller for automatic generation control of two-area interconnected wind–solar–tidal system"}, {"paperId": "1eea08bc57f04548749fd7a1d621e01b2addf8b3", "title": "Green Anaconda Optimization Based Energy Aware Clustering Protocol for 6G Wireless Communication Systems"}, {"paperId": "1f30ad69e5c7dedc7286455edb147df011b32ccb", "title": "Giant Armadillo Optimization: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "40c5a94ff4f771d369de23ac1c93e3181200788f", "title": "I-CPA: An Improved Carnivorous Plant Algorithm for Solar Photovoltaic Parameter Identification Problem"}, {"paperId": "8df6ce34e2be4f167559834f195468a121e130a9", "title": "Kookaburra Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "26b5207aaafca7c4701b2b96ab6561d46ad6a221", "title": "Teaching–Learning Optimization Algorithm Based on the Cadre–Mass Relationship with Tutor Mechanism for Solving Complex Optimization Problems"}, {"paperId": "3e9aa8721335331437fcdc54a262a7b90cd2a53f", "title": "Percentile-Based Adaptive Immune Plasma Algorithm and Its Application to Engineering Optimization"}, {"paperId": "ef3d1d72076c278b0748dd853ede516e21cd1d31", "title": "OOBO: A New Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "d4dc6a0c1a98816284fa0b722c12b88d3e5c4a06", "title": "Chaotic Sparrow Search Optimizer for Structural Design Challenges"}, {"paperId": "d782a12d9c3e8ae14093ab8698437b2c14e807f0", "title": "Golf Optimization Algorithm: A New Game-Based Metaheuristic Algorithm and Its Application to Energy Commitment Problem Considering Resilience"}, {"paperId": "6c81bf84abac9e375eb8d8e39b7a086b9507df9a", "title": "A hierarchical multi-leadership sine cosine algorithm to dissolving global optimization and data classification: The COVID-19 case study"}, {"paperId": "bbfb899a01480bfa7831a6f2316e1c7793de79a6", "title": "Design of Intelligent Neuro-Supervised Networks for Brain Electrical Activity Rhythms of Parkinson’s Disease Model"}, {"paperId": "e9facb35b67b20f6245940b28703d0451292e560", "title": "Chaotic American zebra search optimization algorithm for benchmark challenges"}, {"paperId": "564a8990cbe021375c36c3e6cf0dd1d7df912a00", "title": "Drawer Algorithm: A New Metaheuristic Approach for Solving Optimization Problems in Engineering"}, {"paperId": "e59a7c4f7f7fd5615508171061c68bb39d183f85", "title": "Red Panda Optimization Algorithm: An Effective Bio-Inspired Metaheuristic Algorithm for Solving Engineering Optimization Problems"}]}
