{"paperId": "32eacd758e822529eca2974fad3ffdc50661d4da", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "ChronicleDB", "abstract": "Reactive security monitoring, self-driving cars, the Internet of Things (IoT), and many other novel applications require systems for both writing events arriving at very high and fluctuating rates to persistent storage as well as supporting analytical ad hoc queries. As standard database systems are not capable of delivering the required write performance, log-based systems, key-value stores, and other write-optimized data stores have emerged recently. However, the drawbacks of these systems are a fair query performance and the lack of suitable instant recovery mechanisms in case of system failures. In this article, we present ChronicleDB, a novel database system with a storage layout tailored for high write performance under fluctuating data rates and powerful indexing capabilities to support a variety of queries. In addition, ChronicleDB offers low-cost fault tolerance and instant recovery within milliseconds. Unlike previous work, ChronicleDB is designed either as a serverless library to be tightly integrated in an application or as a standalone database server. Our results of an experimental evaluation with real and synthetic data reveal that ChronicleDB clearly outperforms competing systems with respect to both write and query performance.", "venue": "ACM Transactions on Database Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-15", "journal": {"name": "ACM Transactions on Database Systems (TODS)", "pages": "1 - 45", "volume": "44"}, "authors": [{"authorId": "48021246", "name": "M. Seidemann"}, {"authorId": "2321048", "name": "Nikolaus Glombiewski"}, {"authorId": "1642393447", "name": "Michael Körber"}, {"authorId": "3279660", "name": "B. Seeger"}], "citations": [{"paperId": "484af9f7bf0a774bc3a6f17eaa40d0230a977364", "title": "Workload-Aware Performance Tuning for Multimodel Databases Based on Deep Reinforcement Learning"}, {"paperId": "2aca944f3ae4a6644456819caea4b8fba36edbe2", "title": "Out-of-Order Sliding-Window Aggregation with Efficient Bulk Evictions and Insertions"}, {"paperId": "b49f4aba6e4c5d19d07c1d667f79bb8c8a4dda79", "title": "Mask-Mediator-Wrapper: A revised mediator-wrapper architecture for heterogeneous data source integration"}, {"paperId": "7c807587b94682b9ee70d8e6bf1195ca6507faae", "title": "A conceptual framework for establishing trust in real world intelligent systems"}, {"paperId": "542d6f381e9b0ccce233eabb38f083396db240ce", "title": "Designing an Event Store for a Modern Three-layer Storage Hierarchy"}, {"paperId": "42b7a0c9e6cbd1b237e84416feb6abb7e5d4ba10", "title": "GridTables: A One-Size-Fits-Most H2TAP Data Store"}, {"paperId": "d6201676677cb952d545a8ce2ebe80e4a04e109c", "title": "VAT to the Future: Extrapolating Visual Complex Event Processing"}, {"paperId": "675ddc663b813c8373002540d0a89368e758738d", "title": "Pretty Fly for a VAT GUI: Visualizing Event Patterns for Flight Data"}, {"paperId": "30e408df489defbb71fbd7991d3e050587992081", "title": "RHKV: An RDMA and HTM friendly key-value store for data-intensive computing"}, {"paperId": "412a7099d3a5ba4a50c4e963183c825c5e606411", "title": "Efficient Data Ingestion and Query Processing for LSM-Based Storage Systems"}, {"paperId": "2141c0980032a279961dd9d5715dda0c2780da63", "title": "Sprintz"}, {"paperId": "8cc1a554e799ed2a51d259130745be253ccd8eda", "title": "Raster Time Series: Learning and Processing (Raster Zeitreihen: Lernen und Verarbeiten)"}]}
