{"paperId": "32f07910ea0000df91aa6e0b936968a1999aeb88", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Accurate Vehicle and Road Condition Estimation Algorithm for Vehicle Networking Applications", "abstract": "The Internet of Vehicles is essential for building smart cities. By analyzing the big data collected by vehicle sensors on the road, we can estimate vehicle information and real-time road conditions. To improve the prediction accuracy, this paper proposes a new adaptive filtering algorithm for variable measurement noise problems that occur during the driving state estimations of two-axle electric vehicles. Based on the nonlinear three-degree-of-freedom vehicle model, the dual-motor torque output model, and the Dugoff tire model, fuzzy logic is used to correct the measurement noise in the cubature Kalman filter algorithm. Moreover, the ant colony algorithm is used to optimize the input and output membership functions. Based on the big sensor data, we can accurately predict road conditions, such as vehicle speed and road adhesion coefficients. The simulation results based on CarSim/Simulink show that the new algorithm improves the estimation accuracy of the whole system, regardless of whether the measurement noise is fixed or variable. The research in this paper provides a reference for multi-data comprehensive analyses under different vehicle states.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "17705-17715", "volume": "7"}, "authors": [{"authorId": "92510037", "name": "Huiyuan Xiong"}, {"authorId": "2108394680", "name": "Jianxun Liu"}, {"authorId": "3333049", "name": "Rong-hui Zhang"}, {"authorId": "51364394", "name": "Xionglai Zhu"}, {"authorId": "2146397615", "name": "Huan Liu"}], "citations": [{"paperId": "1c91353995f44762a0d5fdca0d6f00ccc9181111", "title": "Transformer Aided Adaptive Extended Kalman Filter for Autonomous Vehicle Mass Estimation"}, {"paperId": "47a68836b6128a59807bee7039e4fed61d1c615d", "title": "Fuzzy Controllers of Antilock Braking System: A Review"}, {"paperId": "21aee83646dbb640bc5854f9d53d124c1295843f", "title": "A Joint Vehicle Mass and Road Slope Estimation of Distributed Drive Electric Vehicles Considering Road Environment Factors"}, {"paperId": "5b6f5d6faa7409ed74850228ccfc09f443dd3603", "title": "Hybrid deep learning algorithm for brain tumour detection"}, {"paperId": "e54df6f68ea3999ffc77a96bd0692a50d050b30a", "title": "Innovative Interaction Approach in IMM Filtering for Vehicle Motion Models With Unequal States Dimension"}, {"paperId": "1762ecb8e188f04806acdbc5f499628aab30f79d", "title": "Robust Speed Tracking Control for Future Electric Vehicles under Network-Induced Delay and Road Slope Variation"}, {"paperId": "b628dd527f7dc8b402c4cd205419063dca40e365", "title": "Robust estimation algorithm based on prior probability statistics"}, {"paperId": "609c17ff16700d59cfe9a2c53af0a9821b443d71", "title": "Internet of Vehicles (IoV): A Survey of Challenges and Solutions"}, {"paperId": "c8af47b634acfa29a2891c8142254da53f2d57af", "title": "Maximizing Harvested Energy through Regenerative Braking Process in Dual-Motor All-Wheel Drive Electric Vehicles"}]}
