{"paperId": "32f27e1b5c82f38412a9c791d6e87fab63cb2692", "publicationVenue": null, "title": "A Formulation of Big Data Analytics Model in Strengthening the Disaster Risk Reduction", "abstract": "A natural disaster is a serious event that contributes to the damage of infrastructures and property losses, the demand of budgetary allocation, disruption of economic and social activities, damages to the environment, and threat to human life. In disaster management, one of the aims is to reduce the impact of natural disaster through disaster risk management. However, the traditional data risk management mechanism to store and analyse huge disasters has become a challenge for relevant organizations due to its massive datasets, especially when it deals with big data and analytics. Therefore, the aim of this paper is to formulate a big data analytics model to strengthen the disaster risk reduction for Selangor State, Malaysia, comprehending both traditional datasets (geospatial data) and big data analytics (nonspatial data). To this end, 59 factors and available datasets were classified into six categories: ecology, economic, environment, organisation, social, and technology. These factors were derived from existing studies and then validated in a focus group discussion with 54 government agencies involved disaster risk management in Selangor State, Malaysia. The final output of this paper is Big Data Analytics Model for Disaster Risk Reduction, which will be useful to all stakeholders related to disaster risk management and disaster risk reduction initiatives.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1885364181", "name": "Syamil Zayid"}, {"authorId": "118381791", "name": "Nur Azaliah"}, {"authorId": "2285589436", "name": "A. Bakar"}, {"authorId": "1729547301", "name": "Mageshwari Valachamy"}, {"authorId": "93156017", "name": "Nur Shuhada"}, {"authorId": "2285712588", "name": "Abdul Malek"}, {"authorId": "73556332", "name": "Suraya Ya'acob"}, {"authorId": "2177762", "name": "N. H. Hassan"}], "citations": [{"paperId": "87c3cb60df69ea5e6416f16e17673fc2db8ec50b", "title": "Adoption of Big Data Analytics (BDA) Technologies in Disaster Management: A Decomposed Theory of Planned Behavior (DTPB) Approach"}]}
