{"paperId": "330486cf211eab3ae9e17a7048094be657e27d49", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An in-Depth Analysis of the Software Features’ Impact on the Performance of Deep Learning-Based Software Defect Predictors", "abstract": "Software Defects Prediction represents an essential activity during software development that contributes to continuously improving software quality and software maintenance and evolution by detecting defect-prone modules in new versions of a software system. In this paper, we are conducting an in-depth analysis on the software features’ impact on the performance of deep learning-based software defect predictors. We further extend a large-scale feature set proposed in the literature for detecting defect-proneness, by adding conceptual software features that capture the semantics of the source code, including comments. The conceptual features are automatically engineered using Doc2Vec, an artificial neural network based prediction model. A broad evaluation performed on the Calcite software system highlights a statistically significant improvement obtained by applying deep learning-based classifiers for detecting software defects when using conceptual features extracted from the source code for characterizing the software entities.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "64801-64818", "volume": "10"}, "authors": [{"authorId": "8788324", "name": "Diana-Lucia Miholca"}, {"authorId": "1752880739", "name": "Vlad-Ioan Tomescu"}, {"authorId": "1695873", "name": "G. Czibula"}], "citations": [{"paperId": "9e6eb2926d237b7a7d2196bb2b97f79769084212", "title": "Applications of Machine Learning in Software Defect Prediction: A Literature Review"}, {"paperId": "c0cc07d98e42ad01256a6770b3819bfb5fb52748", "title": "A Novel Dimensionality Reduction-based Software Bug Prediction using a Bat-Inspired Algorithm"}, {"paperId": "98b27e6dcc816d3a263933db015d89684d345604", "title": "An unsupervised learning-based methodology for uncovering behavioural patterns for specific types of software defects"}, {"paperId": "b70fc7434d0b889aa28eb526b3c0d7ca2b643977", "title": "A study on the relevance of semantic features extracted using BERT-based language models for enhancing the performance of software defect classifiers"}]}
