{"paperId": "3308709248acfc9725da739ebdacf8e4ee10a9f5", "publicationVenue": {"id": "7654260e-79f9-45c5-9663-d72027cf88f3", "name": "IEEE International Conference on Computer Vision", "type": "conference", "alternate_names": ["ICCV", "IEEE Int Conf Comput Vis", "ICCV Workshops", "ICCV Work"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000149/all-proceedings"}, "title": "Communication-Efficient Vertical Federated Learning with Limited Overlapping Samples", "abstract": "Federated learning is a popular collaborative learning approach that enables clients to train a global model without sharing their local data. Vertical federated learning (VFL) deals with scenarios in which the data on clients have different feature spaces but share some overlapping samples. Existing VFL approaches suffer from high communication costs and cannot deal efficiently with limited overlapping samples commonly seen in the real world. We propose a practical VFL framework called one-shot VFL that can solve the communication bottleneck and the problem of limited overlapping samples simultaneously based on semi-supervised learning. We also propose few-shot VFL to improve the accuracy further with just one more communication round between the server and the clients. In our proposed framework, the clients only need to communicate with the server once or only a few times. We evaluate the proposed VFL framework on both image and tabular datasets. Our methods can improve the accuracy by more than 46.5% and reduce the communication cost by more than 330× compared with state-of-the-art VFL methods when evaluated on CIFAR-10. Our code is available at https://nvidia.github.io/NVFlare/research/one-shot-vfl.", "venue": "IEEE International Conference on Computer Vision", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-28", "journal": {"name": "2023 IEEE/CVF International Conference on Computer Vision (ICCV)", "pages": "5180-5189"}, "authors": [{"authorId": "2156016815", "name": "Jingwei Sun"}, {"authorId": "1742135", "name": "Ziyue Xu"}, {"authorId": "144041873", "name": "Dong Yang"}, {"authorId": "10751841", "name": "V. Nath"}, {"authorId": "2108730532", "name": "Wenqi Li"}, {"authorId": "150068346", "name": "Can Zhao"}, {"authorId": "3262394", "name": "Daguang Xu"}, {"authorId": "2213153798", "name": "Yiran Chen"}, {"authorId": "144531567", "name": "H. Roth"}], "citations": [{"paperId": "370a2ef15eabf56e8a43fe1c117524053eebbb27", "title": "Decoupled Vertical Federated Learning for Practical Training on Vertically Partitioned Data"}, {"paperId": "b3356f59293be355b8694f855f4fc43bc5c2b7a8", "title": "Empowering Federated Learning for Massive Models with NVIDIA FLARE"}]}
