{"paperId": "330bb22c83c679a6d6315a7de4d3c9f87637a581", "publicationVenue": null, "title": "Compiling Classical ML Pipelines into Tensor Computations for One-size-ﬁts-all Prediction Serving", "abstract": "Recent advances in Deep Neural Networks (DNNs) and the subsequent explosion of DNN frameworks have fostered the creation of a new class of systems. ONNX, TVM, and TensorRT are notable examples of such systems: they share the same goal of providing a runtime for DNN model inference with state-of-the-art performance, ease of deployment on hardware accelerators (e.g., GPUs), and portability across platforms and devices. Yet, in the enterprise space data is mostly tabular and classical Machine Learning (ML) techniques such as tree methods are frequently used, often within complex pipelines composed of data featurizers and feature selection operators. Unfortunately, in the classical ML space no uniﬁed inference serving system exists. Therefore, developers are forced to resort to bespoken solutions or subpar performance. In this work we present H UMMINGBIRD : a system able to compile classical ML pipelines end-to-end into tensor computations. It thereby seamlessly leverages the features provided by DNN inference systems, e.g., ease of deployment, operator optimizations and GPU support. We discuss the challenges, our initial system prototype, and promising initial empirical results.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2133958031", "name": "Supun Nakandala"}, {"authorId": "40928126", "name": "Gyeong-In Yu"}, {"authorId": "2965406", "name": "Markus Weimer"}, {"authorId": "2192580", "name": "Matteo Interlandi"}], "citations": [{"paperId": "53c45ebc39118801a87838152389346319a0eef7", "title": "Verifiable evaluations of machine learning models using zkSNARKs"}, {"paperId": "7f269715a1f7c3e8b478ad51bd9df433917003af", "title": "evoML Yellow Paper: Evolutionary AI and Optimisation Studio"}, {"paperId": "36e696827d2d8d2a07bea711b3e1fda9ee1c426f", "title": "Hydra: A System for Large Multi-Model Deep Learning"}, {"paperId": "ef685a63f00ebd44fa7b4c10282ea264807a08e0", "title": "SliceLine: Fast, Linear-Algebra-based Slice Finding for ML Model Debugging"}, {"paperId": "f00d069001dbe814eada65478f48cf263617cee4", "title": "Extending Relational Query Processing with ML Inference"}, {"paperId": "8eede56dc8139a266cc87b9bb132bc5c75e338db", "title": "Hydra: An Optimized Data System for Large Multi-Model Deep Learning [Information System Architectures]"}, {"paperId": "df9ee928e73efb498ebd1502bfc8c48a87241118", "title": "Hydra: A Scalable and Optimized Data System for Large Multi-Model Deep Learning"}]}
