{"paperId": "33144f373c9916ee817a316d94805f2b99eed5cf", "publicationVenue": null, "title": "State of the art in risk sensitive urban development: A systematic literature review.", "abstract": "Risk-sensitive urban development is an innovative planning approach that can transform the way cities are built in order to face the uncertainties that arise from climate-induced disaster risks. There are many actions taken by individuals, households, communities, urban development companies and relevant regulatory bodies to manage the risk through the risk sensitive urban development methods. However, there is a disconnection between the existing urban development projects and urban risk management process. Therefore, urban developers and disaster risk managers should understand each other and collaborate in order to provide a solution for this disconnection. In this regard, identifying the state of the art of a risk sensitive urban development is beneficial for both urban development and disaster management authorities to achieve their objectives. This study therefore explores the state of art revealing indices, models, concepts, tools and approaches which guide both urban developers and disaster managers to achieve risk sensitive urban development. A systematic literature review using PRISMA method covering the publications from 2017 to 2022 was carried out to identify the state of the art in risk sensitive urban development. Having followed a systematic filtering process, a total of 45 out of 281 research contributions have been considered for an in-depth analysis. The study found storm surge disaster loss (SSDL), GRaBS assessment tool and early warning systems as the key approaches of risk sensitive urban development which can lead both urban developers and disaster managers to synchronise their ideas to achieve risk sensitive urban development.", "venue": "Proceedings of 10th World Construction Symposium 2022", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-24", "journal": {"name": "Proceedings of 10th World Construction Symposium 2022"}, "authors": [{"authorId": "2129876607", "name": "Agu Damsari"}, {"authorId": "82067598", "name": "M. Thayaparan"}, {"authorId": "152809118", "name": "T. Fernando"}], "citations": [{"paperId": "b33d46fdf4ef80cf76ca2e0a657697e3f95c3eb1", "title": "Urban Defense Index for City Branding: A Case Study of Five Cities in Kalimantan"}]}
