{"paperId": "3322d27b6fb23ce67785def48e67f1c2203ba9af", "publicationVenue": null, "title": "Combining DNN partitioning and early exit", "abstract": "DNN inference is time-consuming and resource hungry. Partitioning and early exit are ways to run DNNs efficiently on the edge. Partitioning balances the computation load on multiple servers, and early exit offers to quit the inference process sooner and save time. Usually, these two are considered separate steps with limited flexibility. This work combines partitioning and early exit and proposes a performance model to estimate both inference latency and accuracy. We use this performance model to offer the best partitioned/early exit DNN based on deployment information and user preferences. Our experiments show that the flexibility in number and position of partitioning points and placement on available devices plays an important role in deciding the best output. In the future, we plan to turn this work into a \"one-click\" system to train and optimize models for edge computing.", "venue": "EdgeSys@EuroSys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-04-05", "journal": {"name": "Proceedings of the 5th International Workshop on Edge Systems, Analytics and Networking"}, "authors": [{"authorId": "2159668495", "name": "Maryam Ebrahimi"}, {"authorId": "24001397", "name": "A. Veith"}, {"authorId": "38447843", "name": "Moshe Gabel"}, {"authorId": "143617511", "name": "E. D. Lara"}], "citations": [{"paperId": "5e4dcc371fa030f44410552fe0d2a6a6cbba88bc", "title": "Coordinated Deep Neural Networks: A Versatile Edge Offloading Algorithm"}, {"paperId": "54d10a4ea1500a5b7814d0acd8f597852159c977", "title": "PORTEND: A Joint Performance Model for Partitioned Early-Exiting DNNs"}, {"paperId": "ae7833bba66d0aaa4657c139944bb2c3645ff106", "title": "Elastic DNN Inference with Unpredictable Exit in Edge Computing"}, {"paperId": "fe1235420f7f06cc7e59f096272cb3ee6e33e41c", "title": "The Case for Hierarchical Deep Learning Inference at the Network Edge"}, {"paperId": "35d032bddcda3bd2d8947d9bb098c8b799d16243", "title": "Mind Your Heart: Stealthy Backdoor Attack on Dynamic Deep Neural Network in Edge Computing"}]}
