{"paperId": "332936122bfea3674b6492ac51a42040f2e63ec3", "publicationVenue": null, "title": "IMPACT OF BIG DATA ANALYTICS ON DISTRIBUTED MANUFACTURING: DOES BIG DATA HELP?", "abstract": "Big data (BD) analytics has brought progressive improvement in the business environment. It provides businesses with optimized production, personalization and improvement in the way production is dispersed. Nevertheless, conflicts arise in the use of these methods in certain industries, like retail items, which usually basis on large-scale production and prolonged supply chain. The study develops a theoretical structure to investigate if big data coupled with different production solutions can provide for a dispersed production system. Through investigation of twenty-one buyer products business instances applying secondary and main data, the study investigated changing production processes, the inherent catalyst, the function of analytics, and its effect on distributed production. The study discovers several uses of distributed manufacturing principles to evaluate the current production processes worked for larger customer product solutions by using analytics and industry analysis. The evaluation’s suggested structure mentioned in this research has a deeper impact on planning, comprehension relationships, among factors of data analytics and distributed production.", "venue": "Journal of process management and new technologies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-29", "journal": {"name": "Journal of process management and new technologies"}, "authors": [{"authorId": "2165360940", "name": "M. Sazu"}, {"authorId": "2165356747", "name": "S. Jahan"}], "citations": [{"paperId": "41a85411466c0fc51d790b8cf4b177e51ee33224", "title": "Applicability of machine learning models using a neural network for predicting the parameters of the development of food markets"}, {"paperId": "c8db268a9a0d28f580ecbba24087ffc1dde396fb", "title": "How Innovation Plays a Role in Banking and Increases Profitability"}, {"paperId": "9c4a4ba1c01290cdcb8f49b916285ea545ab749a", "title": "Implementation of Big Data Analytics in Electronics Manufacturing Industry: Impact and Profitability"}, {"paperId": "08567b2372657e5b2653eb5fa13bb4d95b83eddf", "title": "Automotive Manufacturing Firms and Their Usage of Machine Learning to Drive Efficiency in Asia"}, {"paperId": "d5854a61b9d6600f56659ef5ca771b29226d110b", "title": "Information technology & supply chain management: role of big data on efficiency"}, {"paperId": "4f857354bd669831b60e00f9d6fa38ea06b094dc", "title": "Impact of IT & data analytics on cleaner manufacturing in Asia"}, {"paperId": "f1baf7faae9f9b1246028af23ad5bf8be6aec5a4", "title": "Role of IT & analytics on business performance"}, {"paperId": "72b714ace596c334104ac02d72250c24b91c3ac6", "title": "Role of big data analytics & it in sustainable healthcare services across Europe"}, {"paperId": "38b80516abba7c2238dcb0361cabdd27fae5aa79", "title": "How supply chain analytics improve business agility of manufacturing firms in Eastern Europe"}, {"paperId": "1b2a1a3b24553d12baa6fac804c648602a2df0e8", "title": "Healthcare and IoT devices: role of information technology in the healthcare industry"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "eb27b31089b9e72153e60bdb71a16ed07fa5c69f", "title": "Impact of big data analytics & machine learning on innovation of manufacturing companies"}, {"paperId": "3c696b9ea606cabbcc288cddc70a3dca55c40a2f", "title": "Role of data analytics in supply chain for improving customer satisfaction and profitability"}, {"paperId": "1fd173b1736d8ee99b76a6691879092868551b71", "title": "GAP iNTERDISCIPLINARITIES"}, {"paperId": "a4ba1b7fbd805ceee7de19095bcbcd4904ac06dd", "title": "B USINESSES I NNOVATION & AI-H OW AI AND A NALYTICS CAN E NCOURAGE I NNOVATION"}]}
