{"paperId": "332ac1ffb9f83a37d6b21965ba3192882a5390f9", "publicationVenue": {"id": "b72ab390-f638-485b-8e20-284acbe77426", "name": "Journal of Hospitality Marketing & Management", "type": "journal", "alternate_names": ["J Hosp Mark  Manag"], "issn": "1936-8623", "url": "http://www.informaworld.com/smpp/title~content=t792306863~db=all", "alternate_urls": ["http://www.tandfonline.com/loi/whmm20"]}, "title": "A look back and a leap forward: a review and synthesis of big data and artificial intelligence literature in hospitality and tourism", "abstract": "ABSTRACT In reaction to the growing attention paid to big data and artificial intelligence in hospitality and tourism research, we systematically reviewed 270 relevant studies to identify topical themes and trends. We first briefly reviewed the emergence definition of big data. Next, we introduced the methodology of literature collection and presented results of bibliometric analysis. Then, we identified types of big data used and the application of artificial intelligence in big data usage in hospitality and tourism research, followed by unveiling major themes of big data and artificial intelligence research in extant literature such as forecasting, industry development, marketing, performance analysis, consumer behaviors, attitudes, and so on. In addition, implications and challenges of applying big data and artificial intelligence in hospitality and tourism research and new directions for future research are identified. Finally, we discuss limitations of our review, proposing future research directions for scholars.", "venue": "Journal of Hospitality Marketing & Management", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-07-06", "journal": {"name": "Journal of Hospitality Marketing & Management", "pages": "145 - 175", "volume": "31"}, "authors": [{"authorId": "2064713364", "name": "Hui Lv"}, {"authorId": "2147207947", "name": "Si Shi"}, {"authorId": "97920175", "name": "D. Gursoy"}], "citations": [{"paperId": "b8c99d8da6156ff0d9a4689d64d8d5ab9c122844", "title": "Marketing analytics acceptance: using the UTAUT, perceived trust, personal innovativeness in information technology and user attitude"}, {"paperId": "45245785a03eed0e26f2a150adbe0db013e3f194", "title": "Zooming in and out the landscape: Artificial intelligence and system dynamics in business and management"}, {"paperId": "a2664957317caa089f385065a19fb5e7447130a4", "title": "Trustworthy AI-Based Personalized Insulin Recommender for Elderly People Who Have Type-2 Diabetes"}, {"paperId": "ed9c968740f3c6852bded330633000f76e4c159d", "title": "Defining the Balearic Islands’ Tourism Data Space: An Approach to Functional and Data Requirements"}, {"paperId": "5ab577a3a81018523838d084d2a2f6d508649b7e", "title": "Digital technology in tourism: a bibliometric analysis of transformative trends and emerging research patterns"}, {"paperId": "62c8c1fb00dfc08087830f767b55c96ad977bee7", "title": "Artificial Intelligence in Hospitality and Tourism: Insights From Industry Practices, Research Literature, and Expert Opinions"}, {"paperId": "c72ee72c200efe603d1f5badd172bfcce696bcfe", "title": "Intellectual landscape and emerging trends of big data research in hospitality and tourism: A scientometric analysis"}, {"paperId": "5eed18bbf5da47feb4a2a438bddfbc965058075a", "title": "Indoor/Outdoor Deep Learning Based Image Classification for Object Recognition Applications"}, {"paperId": "9db688721968f7187d1b07188a7344dc8a01e4bf", "title": "Simulation of Multimedia AR Intelligent Tourism System with IoT and Cloud Computing"}, {"paperId": "8356adee6be6358042c03d796075fb7e7ea8d7e5", "title": "Examining the Impact of Artificial intelligence on Hotel Employees: The Case of Egypt"}, {"paperId": "09dbda8a6250c3127b30deb7f05c5975f6d7b9f7", "title": "Data-Driven Decision Making: Participating Big Data Analytics in Business Management"}, {"paperId": "51508cef31ffc65c88a69a3f4ef40175fbcc5a69", "title": "Transient price setting in the era of automated systems: the ‘hands-on’ hotel general manager lives on!"}, {"paperId": "56adb1c467c57b1f7a92522347f2dcc33b237873", "title": "Growth of digital brand name through customer satisfaction with big data analytics in the hospitality sector after the COVID-19 crisis"}, {"paperId": "101469e9d22a66775262c93be994249205056d31", "title": "Artificial intelligence in marketing research and future research directions: Science mapping and research clustering using bibliometric analysis"}, {"paperId": "f068868aac54a8300cabfffe23d809599d0abded", "title": "Intelligent analysis system of college students' employment and entrepreneurship situation: Big data and artificial intelligence-driven approach"}, {"paperId": "6877098456bd45cb8c30d75019fc81650d1212f1", "title": "Role of trust in customer attitude and behaviour formation towards social service robots"}, {"paperId": "d9766e767e39950ec96d6f1114b054ea3bc92117", "title": "Best Practices for Hospital's Core Marketing"}, {"paperId": "bb7535c2f8166edc9f55e3d629cc34628d1226b9", "title": "Big Data Utilization on Tourism Marketing in Post-Pandemic Recovery Ear: Future Prospect for Indonesia"}, {"paperId": "393de0c16dc7c848ca8c476b51ad18b876f10be6", "title": "Artificial Intelligence in the Tourism Industry: An Overview of Reviews"}, {"paperId": "dc628347b7f5f08d523b9ffb0abcc818bb52255b", "title": "The communication path and improvement strategy of symbolic culture of sneaker consumption culture using the big data analysis"}, {"paperId": "b8837c66815049bbeb58da09e4018cc805e8f009", "title": "Artificial intelligence’s impact on hospitality and tourism marketing: exploring key themes and addressing challenges"}, {"paperId": "33e8ede0bc551ffd47477288da4f43c2e6b64afe", "title": "The influence of civilized city honorary title on the urban innovation capacity"}, {"paperId": "d5990a6cb77cefbf8744d4aecbf438dc80aeee72", "title": "Emerging trends in online reviews research in hospitality and tourism: A scientometric update (2000−2020)"}, {"paperId": "57d5abb72b7cedd842fdd60cdc5c50a0b81f8853", "title": "Data Sources as a Driver for Market-Oriented Tourism Organizations: a Bibliometric Perspective"}, {"paperId": "36783ecc0a9e2fdbeff68a88575dd7949ee6f776", "title": "Has COVID-19 Changed Consumers’ Satisfiers and Dissatisfiers? Evidence from Online Reviews of 5-Star Hotels in Shanghai and Beijing"}, {"paperId": "a182812b7dc8556a03447ed725855a5e600dc48b", "title": "Bridging Disciplinary Divides through Computational Social Sciences and Transdisciplinarity in Tourism Education in Higher Educational Institutions: An Austrian Case Study"}, {"paperId": "8db9c841f933de945a4cdd6776b6af1668bbb79b", "title": "How Do Customers React to Technology in the Hospitality and Tourism Industry?"}, {"paperId": "529c71a7c27c520269bf8ea3cc0b22a1f0c432ce", "title": "Evaluation of the Value of the Employee Tourist Interaction using Big Data Analytics"}, {"paperId": "3e71ba8d91f37d44c05d1be9bced1cc57a5046da", "title": "The Impact of Artificial Intelligence on Tourism Sustainability: A Systematic Mapping Review"}, {"paperId": "69394602eb1efca14d1426a596e86f352d0a6968", "title": "The Big data artificial intelligence and corporate social performance: The organizational innovation as Mediator"}, {"paperId": "1d252f720cc38d142dff455f39b9f2d956edd675", "title": "Emerging dimensions of blockchain application in tourism and hospitality sector: a systematic literature review"}, {"paperId": "4a42c5bd5ff5ed57ca1f7f8a6a041cd0e59b033c", "title": "Artificial intelligence in hospitality and tourism. State of the art and future research avenues"}, {"paperId": "e24967de17ba25a13a093d804a5bebfbfeb18d6d", "title": "Improving Tourism Industry Performance through Support System Facilities and Stakeholders: The Role of Environmental Dynamism"}, {"paperId": "c12cea21424b0ca7728bbc48df780e05f7f80414", "title": "How technostressors influence job and family satisfaction: Exploring the role of work–family conflict"}, {"paperId": "63369e355253fff6403dc3da65f2e42c0a94315b", "title": "Effects of management practices for using the SaaS system on performance of hospitality firms in Norway"}, {"paperId": "b5b8115ea9820f6118d8c7ac3f5ce92ae276ca42", "title": "30 years of artificial intelligence (AI) research relating to the hospitality and tourism industry"}, {"paperId": "77691fd1190105085bab3e6a5f59acdd0cfc33d1", "title": "Assessing brand performance consistency from consumer-generated media: the US hotel industry"}, {"paperId": "cb6352fd271cf094c8778282ce9aa085e124d5db", "title": "How does the tourism and hospitality industry use artificial intelligence? A review of empirical studies and future research agenda"}, {"paperId": "26636386cd4db9c52f23972c3c30ca753f9bb100", "title": "What consumer complaints should hoteliers prioritize? Analysis of online reviews under different market segments"}, {"paperId": "a3c4738bd7e2f21c1205872667c7d83228b80c76", "title": "Modelling competitive advantage using the concepts of big data and social media to develop a sustainability strategy"}, {"paperId": "92ddea225458d1427dc0b2b01d560cd2f9cfea84", "title": "A quantitative scoping review of information search behaviour in sport tourism"}, {"paperId": "4d10c2ae995581ed3b012afe79b302197e08d8ed", "title": "Precision Marketing Strategy for Ecotourism Based on Data Mining and User Images"}, {"paperId": "f15eededfa27b3a9dcf1907c42072d98f00fe328", "title": "Big Data and Sustainability in the Tourism Industry"}, {"paperId": "cbe441fc3be6c7db8ff93865001b7445f0a806ac", "title": "Antecedents and consequences of new technology application behavior on word of mouth: The moderating roles of perceived interactivity"}, {"paperId": "781e49fe3c3a0313013a2b4eee360bf8c45074b2", "title": "Research on Tourism Resource Evaluation Based on Artificial Intelligence Neural Network Model"}, {"paperId": "c9de8b052562e03ebe8445a14d9cb3cb08e85fd6", "title": "Enabling All In-Edge Deep Learning: A Literature Review"}, {"paperId": "d16809c390d4d52043e864af122343bdd68b0ad0", "title": "Big data analytics and hotel guest experience: a critical analysis of the literature"}, {"paperId": "efce03a7187ce9e39aee341a9f7164fa3c4b50e5", "title": "Big Data in China Tourism Research: A Systematic Review of Publications from English Journals"}, {"paperId": "6eae6479c62c90a4e94bedf2fae171caccd58d8f", "title": "Impact on Psychological Capital and Adaptive Performance During Pandemic: A Study of Malaysia Young Professionals in Malaysia Service Sectors Context"}, {"paperId": "582b84738900fbfe093f3887b01215fb7f8bfe44", "title": "IMPACT OF ARTIFICIAL INTELLIGENCE AND SERVICE ROBOTS IN TOURISM AND HOSPITALITY SECTOR: CURRENT USE & FUTURE TRENDS"}, {"paperId": "577ae8209960dec7982751e18202d9cafef393f2", "title": "Impact of anthropomorphic features of artificially intelligent service robots on consumer acceptance: moderating role of sense of humor"}, {"paperId": "eda3bd09a023c417a2db62b222f494b0eb024ab9", "title": "Exploration on English Teaching Reform under the Combination of Big Data and Artificial Intelligence Technology"}, {"paperId": "9b8aabefe970826aa3c9e5ea21586ebb45748c0e", "title": "Enabling Deep Learning for All-in EDGE paradigm"}, {"paperId": "a56df8d49490731405e6215be1e85559c075c99c", "title": "The beauty premium of tour guides in the customer decision-making process: An AI-based big data analysis"}, {"paperId": "a1f19a011da8f34dcb1a374dab97f7f70f0e0853", "title": "Factors Affecting the Adoption of Big Data Analytics in Hotels"}, {"paperId": "0882c0267c3a22f14679fc0e58f8b2d08f14b545", "title": "The Tourist Attractions And Facilities Development For Community-Based Tourism To The Digital Economy :Phatthalung"}, {"paperId": null, "title": "A bibliometric analysis on Artificial intelligence in Tourism. State of the art and future research avenues"}, {"paperId": "12d6ac7d217736f86c3470e8c24f4861c8d14d5d", "title": "ROLE OF BIG DATA ANALYTICS AND FIFA WORLD CUP 2022 ON THE QATAR’S TOURISM INDUSTRY: SYSTEMATIC REVIEW"}, {"paperId": "dcadbdff10430574f976adc51c306096bba56a6e", "title": "Role of Artificial Intelligence (AI) and Data Analytics in Enhancing Guest Personalization"}]}
