{"paperId": "33338dc444fc6906e2ff0887aedc219a4be02718", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Design and Implementation of a Personalized Tourism Recommendation System Based on the Data Mining and Collaborative Filtering Algorithm", "abstract": "A personalized tourism recommendation system provides convenient and economically affordable travel information for individuals/groups. This recommendation system banks on accumulated and analyzed data for providing context-aware travel solutions. For improving the recommendation efficiency and data analysis of such systems, this article introduces a mining and filtering harmonized collaborative process, named as the collaborative mining and filtering process (CMFP), for reducing the data processing overheads and improving the recommendation ratio. In this process, the accumulated data from the global and personal travel, expenditure, and other information are collaboratively analyzed. This analysis is powered by knowledge-based transfer learning for reducing the retardation in the large data processing. Based on the context-based data analysis, the filtering and mining are jointly performed for providing recommendations. In the filtering process, the maximum processed contextual data are extracted for updating the current knowledge base. From this base, the recommendation for adaptable travel is recommended for the user. This process's performance is analyzed using the metrics accuracy, data handling rate, mining time, and overhead.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-31", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "48448180", "name": "Xiang Nan"}, {"authorId": "2134150384", "name": "Kayo Kanato"}, {"authorId": "2183623216", "name": "Xiaolan Wang"}], "citations": [{"paperId": "9741ec0469aaf3c3de6c4a2e112496109cfe852b", "title": "Smart tourism destination (STD): developing and validating an impact scale using residents’ overall life satisfaction"}, {"paperId": "b9e920e73639553aa87857319c7d9465f2230c21", "title": "Collaborative Filtering-Based Recommendation Systems for Touristic Businesses, Attractions, and Destinations"}, {"paperId": "26e3727fc8d88968f705a9334f03b999469e53de", "title": "Real-Time Context-Aware Recommendation System for Tourism"}, {"paperId": "8ca6d8db09f083f9f8872cc40e6c65b9a7ac97da", "title": "RVTN: Recommender system for vehicle routing in transportation network"}]}
