{"paperId": "334c2de0c0b431af53f73db6b9e628fcb88c1152", "publicationVenue": null, "title": "In unity there is strength: Showcasing a unified big data platform with MapReduce Over both object and file storage", "abstract": "Big Data platforms often need to support emerging data sources and applications while accommodating existing ones. Since different data and applications have varying requirements, multiple types of data stores (e.g. file-based and object-based) frequently co-exist in the same solution today without proper integration. Hence cross-store data access, key to effective data analytics, can not be achieved without laborious application re-programming, prohibitively expensive data migration, and/or costly maintenance of multiple data copies. We address this vital issue by introducing a first unified big data platform over heterogeneous storage. In particular, we present a prototype joining Apache Hadoop MapReduce with OpenStack's open-source object store Swift and IBM's cluster file system GPFSTM. A sentiment analysis application using 3 months of real Twitter data is employed to test and showcase our prototype. We have found that our prototype achieves 50% data capacity savings, eliminates data migration overhead, offers stronger reliability and enterprise support. Through our case study, we have learned important theoretical lessons concerning performance and reliability, as well as practical ones related to platform configuration. We have also identified several potentially high-impact research directions.", "venue": "2014 IEEE International Conference on Big Data (Big Data)", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-10-01", "journal": {"name": "2014 IEEE International Conference on Big Data (Big Data)", "pages": "960-966"}, "authors": [{"authorId": "144142354", "name": "Rui Zhang"}, {"authorId": "144923248", "name": "Dean Hildebrand"}, {"authorId": "144832635", "name": "Renu Tewari"}], "citations": [{"paperId": "e38f5bb3c507e613d662d8e53f114d3190b113c1", "title": "Future and Challenges of Internet of Things"}, {"paperId": "e61b4479872ed8dbbea3786a17072fdd5c31f10a", "title": "Data Warehouse and Big Data Integration"}, {"paperId": "591558249f5e68434e0834b782b54441c6f0bb42", "title": "A model of multilayer tiered architecture for big data"}, {"paperId": "bc763326397c149af26f7ed26f2c03e867d0d445", "title": "Top 10 Download Article in Computer Science & Information Technology: October 2021"}, {"paperId": "1f2f6216100b3abf664a1f1385ad957e3f46efd7", "title": "Top 10 Read Article in Computer Science & Information Technology: June 2021"}, {"paperId": "c64638ad7be905f41f2bb0249a0a278576083460", "title": "April 2021: Top 10 View Article in Computer Science & Information Technology"}]}
