{"paperId": "33549ace6c47c5b12e6e6bed175910ae6f469018", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Exploring the Methods and Paths of Integrating Entrepreneurship and Innovation Education into Applied Undergraduate Education", "abstract": "\n In the context of a global enthusiasm for innovation and entrepreneurship, this study explores practical strategies for incorporating entrepreneurship and innovation education into applied undergraduate curricula, marking a pivotal shift in educational reform. Utilizing a PEST analysis, cloud computing for resource allocation, and decision tree algorithms, we comprehensively examine the innovation and entrepreneurship education landscape in applied educational institutions. Our study demonstrates that strategic resource allocation can substantially improve both the utilization efficiency of resources and the overall impact of education. Establishing a resource allocation system enhances the alignment between educational resources and specific tasks, leading to marked improvements in resource efficiency. Comparative assessments indicate that applied institutions are particularly adept at fostering students’ entrepreneurial and innovative capacities, with student-led ventures in these institutions generating an average net profit of 210,000 to 500,000 yuan and capturing a market share of 58.88%. The research underscores the necessity of constructing a supportive framework for innovation and entrepreneurship education, advocating for an interdisciplinary stance and stronger school-business partnerships as essential components for optimizing educational effectiveness in applied undergraduate programs.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2294037008", "name": "Yuefeng Wu"}], "citations": []}
