{"paperId": "335acafccca565da56aa0e632860931f8feedfc8", "publicationVenue": {"id": "58c51168-9cc5-44d5-8f6c-6a4d77302e92", "name": "Wseas Transactions on Business and Economics", "alternate_names": ["Wseas Trans Bus Econ"], "issn": "1109-9526", "url": "http://www.worldses.org/journals/economics/index.html"}, "title": "Intellectual Capital as a Factor Forming Economic Security of Enterprises in Society 5.0", "abstract": "The article shows that in Society 5. 0 intellectual capital is a key factor forming economic security of enterprises. The priority of structural components of intellectual capital as a factor of enterprise economic security formation is determined. Features of mining and beneficiation enterprises operation are considered while structuring intellectual capital. The resulting criteria for assessing efficiency of the intellectual capital use during economic security formation are established. Three key groups of competences of personnel necessary for economic security formation are identified. It is substantiated that organic connection of intellectual capital structural elements will enable forming economic security of the enterprise during the current period and providing economic security parameters in the long term. Based on the data obtained from mining and beneficiation enterprises, it is demonstrated that this will be possible due to growth of an innovative level of technological processes which will contribute to product quality enhancement that, in turn, will expand the client base.", "venue": "Wseas Transactions on Business and Economics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-04", "journal": {"name": "WSEAS TRANSACTIONS ON BUSINESS AND ECONOMICS"}, "authors": [{"authorId": "2089019215", "name": "Mishchuk Ievgeniia"}, {"authorId": "2148721937", "name": "Riabykina Yekateryna"}, {"authorId": "2148720468", "name": "Ushenko Natalya"}, {"authorId": "2148717678", "name": "Hamova Oksana"}, {"authorId": "2148720942", "name": "Tkachenko Sergii"}, {"authorId": "2148720473", "name": "Yastremska Natalia"}], "citations": [{"paperId": "b648f0f99b2d233469a589f651ab65e4888cd50f", "title": "ANALYSIS OF COMPETITIVENESS OF INDUSTRIAL ENTERPRISES IN UKRAINE: CHALLENGES AND PROSPECTS"}, {"paperId": "283b469f2d21e427e1b0d11acb61803d164a3ce0", "title": "STRATEGIES FOR STRENGTHENING BUSINESS ECONOMIC SECURITY WITH ACCOUNT TO GLOBAL FINANCIAL CHALLENGES"}, {"paperId": "719609e950e2f2a726ab20fa559b7b5f1ac72a45", "title": "Соціально-економічні умови забезпечення розвитку трансферу знань у сфері вищої освіти в контексті цифрової трансформації"}, {"paperId": "791b79c2fd7f1e1a4ee05bd1f8af8bc70fde474c", "title": "Partnership Modelling of Entrepreneurial, Digital and Performance Competencies among Coffee SME’s in Bener Meriah Regency"}, {"paperId": "908a36c30603872e90bf56fb64f580465551e93b", "title": "Revolutionizing Islamic Education: The Primary Role of Teachers in Society 5.0 Learning Process"}, {"paperId": "a1e4d1e1ea35ce658d52192502c22c1a6f1026fb", "title": "Digital Transformation of Business Processes of Enterprises on the Way to Becoming Industry 5.0 in the Gig Economy"}, {"paperId": "9737ea4b8dc6384ac440f9285f9a7a3854589104", "title": "Research Articles - Invention Patents Equilibrium; Research Integration, Spatiotemporal Development Strategy, and Circular Economy"}, {"paperId": "dea02039f5ee247a8eeeadf33d9cd217cc9ada6c", "title": "The Influence of the Innovation Potential of Personnel on Strengthening Economic Security of Ukrainian Enterprises in the Post-War Period"}, {"paperId": "dae02c7c116931f2a52041ddcc78e60de76eaf4b", "title": "Assessment of Spatial Challenges of the Economic Security System of Industrial Enterprises"}, {"paperId": "91925a155aa1d9f1312bf88e08334d9b30e7d37b", "title": "The Role Of Technology In Era 5.0 In The Development Of Arabic Language In The World Of Education"}, {"paperId": "7343fe68819eade0d1aae3ac138a506f2d780b47", "title": "Verification of the Financial Security of Small and Medium-Sized Enterprises in Poland"}, {"paperId": "dced2cc551714c6f9de8698f0f95a245a34fa54e", "title": "Security of Energy Interests of Enterprises: Innovative Competencies of Personnel, Public Administration and Role of Exchange Trade"}, {"paperId": "776ac85a42c353e8c97e21e3bce199748b310756", "title": "SYSTEM OF STRATEGIC ENSURE OF THE COMPETITIVENESS OF INDUSTRIAL ENTERPRISES"}]}
