{"paperId": "3373c029246e52ae4079e6d3ddeb9c83dc107554", "publicationVenue": {"id": "3f16aef5-6b9f-4f87-baca-cbf8147e352f", "name": "Journal of Chemical Information and Modeling", "type": "journal", "alternate_names": ["J Chem Inf Model"], "issn": "1549-9596", "url": "http://pubs.acs.org/jcim", "alternate_urls": ["http://pubs.acs.org/journals/jcisd8/index.html", "https://pubs.acs.org/journal/jcisd8"]}, "title": "Identifying Conformational Isomers of Organic Molecules in Solution via Unsupervised Clustering", "abstract": "We present a systematic approach for the identification of statistically relevant conformational macrostates of organic molecules from molecular dynamics trajectories. The approach applies to molecules characterized by an arbitrary number of torsional degrees of freedom and enables the transferability of the macrostates definition across different environments. We formulate a dissimilarity measure between molecular configurations that incorporates information on the characteristic energetic cost associated with transitions along all relevant torsional degrees of freedom. Such metric is employed to perform unsupervised clustering of molecular configurations based on the Fast Search and Find of Density Peaks algorithm. We apply this method to investigate the equilibrium conformational ensemble of Sildenafil, a conformationally complex pharmaceutical compound, in different environments including the crystal bulk, the gas phase, and three different solvents (acetonitrile, 1-butanol, and toluene). We demonstrate that while Sildenafil can adopt more than 100 metastable conformational configurations, only 12 are significantly populated across all of the environments investigated. Despite the complexity of the conformational space, we find that the most abundant conformers in solution are the closest to the conformers found in the most common Sildenafil crystal phase.", "venue": "Journal of Chemical Information and Modeling", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science", "Chemistry"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-22", "journal": {"name": "Journal of Chemical Information and Modeling", "pages": "2263 - 2273", "volume": "61"}, "authors": [{"authorId": "152691431", "name": "Veselina Marinova"}, {"authorId": "94825999", "name": "L. Dodd"}, {"authorId": "2108235217", "name": "Song-Jun Lee"}, {"authorId": "7242676", "name": "Geoffrey P. F. Wood"}, {"authorId": "13298081", "name": "I. Marziano"}, {"authorId": "5012206", "name": "M. Salvalaglio"}], "citations": [{"paperId": "c2b977f392e3c0afbe6a447f30e3a799a5e6c799", "title": "Molecular simulation approaches to study crystal nucleation from solutions: Theoretical considerations and computational challenges"}, {"paperId": "7ac59d6ab1a605556fb2b7ae75a95ac96c674c8a", "title": "Structural Investigation of Tetra-n-Butylammonium Perchlorate"}, {"paperId": "b15bb05e5cdd6e44ea597dfe15b1d6ee36a6411b", "title": "Coarse-grained molecular dynamics study based on TorchMD"}, {"paperId": "6a73c1bffea1763e3c392ac64d110447c68557bf", "title": "RECORDS OF PHARMACEUTICAL AND BIOMEDICAL SCIENCES In-Silico Analytical Chemistry Contributions to Analytical and Bio-Analytical Applications in Spectroscopic and Chromatographic Techniques: Molecular, Mechanical and Quantum insights"}, {"paperId": "f3ac8d4caf43d5d802479c11ed60999e41e03aaf", "title": "Theoretical and computational approaches to study crystal nucleation from solution"}]}
