{"paperId": "337af42fe3f4dc70f625971f04bd3dc3785d7383", "publicationVenue": {"id": "851ac07b-1f6a-41ad-bd50-53598e973d16", "name": "Journal of Automation, Mobile Robotics & Intelligent Systems", "type": "journal", "alternate_names": ["J Autom Mob Robot Intell Syst", "Journal of Automation, Mobile Robotics and Intelligent Systems", "J Autom Mob Robot  Intell Syst"], "issn": "2080-2145", "url": "http://www.jamris.org/"}, "title": "Edge Artificial Intelligence-Based Facial Pain Recognition During Myocardial Infarction", "abstract": "Abstract Medical history highlights that myocardial infarction is one of the leading factors of death in human beings. Angina pectoris is a prominent vital sign of myocardial infarction. Medical reports suggest that experiencing chest pain during heart attacks causes changes in facial muscles, resulting in variations in patterns of facial expression. This work intends to develop an automatic facial expression detection to identify the severity of chest pain as a vital sign of MI, using an algorithmic approach that is implemented with a state-of-the-art convolutional neural network (CNN). The advanced object detection lightweight CNN models are as follows: Single Shot Detector Mobile Net V2, and Single Shot Detector Inception V2, which were utilized for designing the vital signs MI model from the 500 Red Blue Green Color images private dataset. The authors developed cardiac emergency health monitoring care using an Edge Artificial Intelligence (“Edge AI”) using NVIDIA’s Jetson Nano embedded GPU platform. The proposed model is mainly focused on the factors of low cost and less power consumption for onboard real-time detection of vital signs of myocardial infarction. The evaluated metrics achieve a mean Average Precision of 85.18%, Average Recall of 88.32%, and 6.85 frames per second for the generated detections.", "venue": "Journal of Automation, Mobile Robotics & Intelligent Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Journal of Automation, Mobile Robotics and Intelligent Systems", "pages": "40 - 55", "volume": "16"}, "authors": [{"authorId": "2238955290", "name": "H. M. Mohan"}, {"authorId": "2119603583", "name": "H. Kumara"}, {"authorId": "2238955194", "name": "S. H. Mallikarjun"}, {"authorId": "2238955819", "name": "A. Y. Prasad"}], "citations": [{"paperId": "603fe4509d6e7859d3e7647bf25d19c7f3d269fc", "title": "Affective Computing for Healthcare: Recent Trends, Applications, Challenges, and Beyond"}]}
