{"paperId": "337f01ef1f476027c065d3488e049abe5616d6b2", "publicationVenue": null, "title": "BIG DATA BREAKING BARRIERS - FIRST STEPS ON A LONG TRAIL", "abstract": "Most data sets and streams have a geospatial component. Some people even claim that about 80% of all data is related to location. In the era of Big Data this number might even be underestimated, as data sets interrelate and initially non-spatial data becomes indirectly geo-referenced. The optimal treatment of Big Data thus requires advanced methods and technologies for handling the geospatial aspects in data storage, processing, pattern recognition, prediction, visualisation and exploration. On the one hand, our work exploits earth and environmental sciences for existing interoperability standards, and the foundational data structures, algorithms and software that are required to meet these geospatial information handling tasks. On the other hand, we are concerned with the arising needs to combine human analysis capacities (intelligence augmentation) with machine power (artificial intelligence). This paper provides an overview of the emerging landscape and outlines our (Digital Earth) vision for addressing the upcoming issues. We particularly request the projection and re-use of the existing environmental, earth observation and remote sensing expertise in other sectors, i.e. to break the barriers of all of these silos by investigating integrated applications.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2015-04-29", "journal": {"name": "ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "691-697", "volume": ""}, "authors": [{"authorId": "1681824", "name": "S. Schade"}], "citations": [{"paperId": "4c50dc4a1f9ee0ff2f32f82f119f07af1fa1c59a", "title": "Challenges in the Geo-Processing of Big Soil Spatial Data"}, {"paperId": "e61192a18f9ee2fe767966cae32164f6c2ba8089", "title": "Indexing hs code- a hybrid indexer for an optimized search of geotagged data"}, {"paperId": "020754c0717fc41bddae1776ef30cd83db8c17db", "title": "Comparing Human Versus Machine-Driven Cadastral Boundary Feature Extraction"}, {"paperId": "254c386c277d938bb3133286e268c91eed8750ed", "title": "Utilizando um cluster virtual com Hadoop como uma ferramenta para exploração de big data em processamento de imagens digitais"}, {"paperId": "827b90820c4319c7b41d272d32b422f0576808fd", "title": "A New Cloud Computing Architecture for the Classification of Remote Sensing Data"}, {"paperId": "d0a56ecebd85fb28a767b7f81d408295d046d3ce", "title": "Considerations on Geospatial Big Data"}, {"paperId": "5eaba30d898291beed563b76b015511f5fd1e96b", "title": "The openEO API-Harmonising the Use of Earth Observation Cloud Services Using Virtual Data Cube Functionalities"}, {"paperId": "8794cb17e88d6fbdae42ae5331c9d17345c19023", "title": "1 Comparing Human Versus Machine-Driven 2 Cadastral Boundary Feature Extraction 3"}, {"paperId": "e1f8ae2743d8eb00df642a004abbcb11cb48d7cf", "title": "Proc. of the 2019 conference on Big Data from Space"}, {"paperId": "d58f4b2bd46553fc8f525965d34589845e716fb5", "title": "Big Data Infrastructures for Processing Sentinel Data"}, {"paperId": "70283824a10aeb0a7952d3f5d28ebeea5ee4361d", "title": "Big Data Infrastructures for Processing Sentinel Data"}]}
