{"paperId": "33aa45145498a053d82e317150dbb52713c4b32a", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Index-Modulation-Based Key Exchange Scheme for Internet of Things Networks", "abstract": "The pervasiveness of the Internet of Things (IoT) in our daily lives has been remarkably increasing over the past years. Due to their massive connectivity and limited resources, ensuring decent security levels for these networks has been challenging. In this article, a novel and efficient physical layer key exchange scheme for IoT devices is proposed. The proposed scheme leverages on the well-known index modulation (IM) technique for the key exchange process by exploiting IM-based selected carrier frequency indices at the legitimate transceiver pairs (i.e., Alice and Bob) to exchange key symbols. Additionally, a random power level selection along with channel precoding is performed for each symbol transmission to enhance the secrecy level against potential eavesdroppers. The performance of the proposed scheme is analyzed based on the upper-bound expression for the key error probability (KEP) metric. As compared to the benchmark scheme, results reveal a promising performance in the KEP, where a minimum of 10 dBW can be gained at the legitimate node, while the KEP at the eavesdropper is kept close to one regardless of its channel conditions. Moreover, extensive numerical results corroborate the accuracy of the derived mathematical framework and endorse the proposed scheme’s robustness under the existence of a smart and powerful adversarial node.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "2606-2617", "volume": "11"}, "authors": [{"authorId": "2143332988", "name": "Tasneem Alshamaseen"}, {"authorId": "1730542", "name": "S. Althunibat"}, {"authorId": "49671842", "name": "M. Qaraqe"}, {"authorId": "9743498", "name": "Elmehdi Illi"}, {"authorId": "143716052", "name": "Muhammad Usman"}], "citations": []}
