{"paperId": "33aba3c5fff4e321b3e3ed14bd1c0c5f253af1d5", "publicationVenue": {"id": "28aa8a6f-d172-4e36-bd3a-aa9e6fc32a9c", "name": "Fall Joint Computer Conference", "type": "conference", "alternate_names": ["Fall joint computer conference", "Fall jt comput conf", "Fall Jt Comput Conf", "FJCC", "JCC"]}, "title": "An Empirical Study of Inter-cluster Resource Orchestration within Federated Cloud Clusters", "abstract": "Federated clusters are composed of multiple independent clusters of machines interconnected by a resource management system, and possess several advantages over centralized cloud datacenter clusters including seamless provisioning of applications across large geographic regions, greater fault tolerance, and increased cluster resource utilization. However, while existing resource management systems for federated clusters are capable of improving application intra-cluster performance, they do not capture inter-cluster performance in their decision making. This is important given federated clusters must execute a wide variety of applications possessing heterogeneous system architectures, which are a impacted by unique inter-cluster performance conditions such as network latency and localized cluster resource contention. In this work we present an empirical study demonstrating how inter-cluster performance conditions negatively impact federated cluster orchestration systems. We conduct a series of micro-benchmarks under various cluster operational scenarios showing the critical importance in capturing inter-cluster performance for resource orchestration in federated clusters. From this benchmark, we determine precise limitations in existing federated orchestration, and highlight key insights to design future orchestration systems. Findings of notable interest entail different application types exhibiting innate performance affinities across various federated cluster operational conditions, and experience substantial performance degradation from even minor increases to latency (8.7x) and resource contention (12.0x) in comparison to centralized cluster architectures.", "venue": "Fall Joint Computer Conference", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-08-01", "journal": {"name": "2021 IEEE International Conference on Joint Cloud Computing (JCC)", "pages": "44-50"}, "authors": [{"authorId": "1382138176", "name": "Dominic Lindsay"}, {"authorId": "1840336659", "name": "Gingfung Yeung"}, {"authorId": "2118950110", "name": "Yehia Elkhatib"}, {"authorId": "3052818", "name": "Peter Garraghan"}], "citations": []}
