{"paperId": "33b31e2dcb1a0e05d2759b5f596d1615c353aba1", "publicationVenue": {"id": "1ac8085d-9196-4e1a-b5c4-0db5fd093f9f", "name": "Batteries", "type": "journal", "issn": "2313-0105", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-550462", "alternate_urls": ["https://www.mdpi.com/journal/batteries", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-550462"]}, "title": "Cyber-Physical Cloud Battery Management Systems: Review of Security Aspects", "abstract": "Battery management systems (BMSs) are critical to ensure the efficiency and safety of high-power battery energy storage systems (BESSs) in vehicular and stationary applications. Recently, the proliferation of battery big data and cloud computing advancements has led to the development of a new generation of BMSs, named Cloud BMS (CBMS), aiming to improve the performance and safety of BESSs. The CBMS is a cyber-physical system with connectivity between the physical BMS and a cloud-based virtual BMS, which is realized through a communication channel such as Internet of Things. Compared to the traditional BMS, the CBMS offers significantly higher computational resources, leveraging the implementation of advanced digital twin models and best-in-class algorithms in the BMS software, which will provide superior performances. However, as for any other CPS, the CBMS creates vulnerabilities against cyberattacks and if not properly secured, could end up damaging the BESS and/or causing dangerous, expensive, and life-threatening situations. Cybersecurity of the CBMSs has thus become a trending topic and several works have been published in this area in recent years. This paper conducts a scoping review to address different topics related to BMS cybersecurity. The CBMS architecture is presented, and the potential cyberattack surfaces are identified. Different possible attack scenarios, including attack points, attack types, and their impact at the component level (BMS and BESS) and system level (vehicle or grid), are discussed. In addition, the paper provides a review of potential countermeasures to protect the CBMS against cyberattacks. The paper also includes a review of the applicable standards and regulations that relate to this trending topic. Finally, based on the reviewed gaps, potential future research domains on BMS cybersecurity topics are identified and presented at the end of the paper.", "venue": "Batteries", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-18", "journal": {"name": "Batteries"}, "authors": [{"authorId": "9155477", "name": "F. Naseri"}, {"authorId": "2209147", "name": "Z. Kazemi"}, {"authorId": "1792089", "name": "P. Larsen"}, {"authorId": "2151652120", "name": "M. M. Arefi"}, {"authorId": "2912104", "name": "E. Schaltz"}], "citations": [{"paperId": "b5c7427803b3fc514c48f03c264283a465832d6e", "title": "Securing energy horizons: Cloud-driven based machine learning methods for battery management systems"}, {"paperId": "1a8aea977462e6f716451da5d82b6df18cfb17b9", "title": "INSPECT: Investigating Supply Chain and Cyber-Physical Security of Battery Systems"}]}
