{"paperId": "33b5d14681ee44dccb74b4bd2d659db92a8ec514", "publicationVenue": {"id": "cf92d1cf-532e-478d-bd57-61db37f7d799", "name": "International Journal of Educational Management", "type": "journal", "alternate_names": ["Int J Educ Manag", "International Journal of Education and Management"], "issn": "0951-354X", "alternate_issns": ["2350-1812"], "url": "https://www.emerald.com/insight/publication/issn/0951-354X", "alternate_urls": ["http://www.ijefm.com/"]}, "title": "Big data academic and learning analytics", "abstract": "\nPurpose\nAlthough big data analytics (BDA) have great benefits for higher education institutions (HEIs), due to lack of sufficient evidence on how BDA investment can pay off, it is tough for HEIs practitioners to realize value from such adoption. The purpose of this paper is to propose a big data academic and learning analytics enabled business value model to explain BDA potential benefits and business value which can be obtained by developing such analytics capabilities in HEIs.\n\n\nDesign/methodology/approach\nThe study examined 47 case descriptions from 26 HEIs to investigate the causal association between the BDA current and potential benefits and business value creation path for big data academic and learning analytics success in HEIs.\n\n\nFindings\nThe pressure of compliance with all legal and regulatory requirements and competition had pushed HEIs hard to adopt BDA tools. However, the study found out that application of risk and security and predictive analytics to higher education fields is still in its infancy. Using this theoretical model, the results provide new insights to higher education administrators on ways to create BDA capabilities for HEIs transformation and suggest an empirical foundation that can lead to more thorough analysis of BDA implementation.\n\n\nOriginality/value\nA distinctive theoretical contribution of this study is its conceptualization of understanding business value from BDA in the typical setting of higher education. The study provides HEIs with an all-inclusive understanding of BDA and gives insights on how it helps to transform HEIs. The new perspectives associated with the big data academic and learning analytics enabled business value model will contribute to future research in this area.\n", "venue": "International Journal of Educational Management", "year": 2018, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2018-08-13", "journal": {"name": "International Journal of Educational Management"}, "authors": [{"authorId": "103299969", "name": "Sushil S. Chaurasia"}, {"authorId": "2480933", "name": "D. Kodwani"}, {"authorId": "112866902", "name": "Hitendra Lachhwani"}, {"authorId": "69898042", "name": "M. Ketkar"}], "citations": [{"paperId": "6cbbf5f0b99fcc65e4e995d8b16f4d346ad01ae8", "title": "Roles of top management support and compatibility in big data predictive analytics for supply chain collaboration and supply chain performance"}, {"paperId": "65d4b58d386de12912078b4f2eefb73eea55d652", "title": "Campaign Management System with Big Data Analytics in Marketing Products through Digital Channel"}, {"paperId": "2c41cc2460e2e0077c2ed8103a979bb41f8029b8", "title": "Knowledge management processes toward organizational performance - a knowledge-based view perspective: an analogy of emerging and developing economies"}, {"paperId": "15920905050f753265558fa79ff91e37720198d5", "title": "A Rule-Based Approach for Mining Creative Thinking Patterns from Big Educational Data"}, {"paperId": "21bf9e7f52658ad0b78e3748a25b6fc61b14f531", "title": "Analytics in Higher Education: Scoping the Landscape of Research in the Area"}, {"paperId": "b0865bcab8cc2cc8fa24ab6f0f4b61a768805043", "title": "A survey on big data-enabled innovative online education systems during the COVID-19 pandemic"}, {"paperId": "9248697c6bddc4211ed20eba3ac5f9543feb4328", "title": "Towards Mining Creative Thinking Patterns from Educational Data"}, {"paperId": "6fc5440542295ef52aec3b78194db5c91cde7bcc", "title": "Data Lake Management for Educational Analysis"}, {"paperId": "f79d4e4865aad81f669c88bc809df596f2efa062", "title": "Big Data in Academia: A Proposed Framework for Improving Students Performance"}, {"paperId": "0d8477f8323523098e6b94f88b5b03eea956d521", "title": "Artificial intelligence and big data: ontological and communicative perspectives in multi-sectoral scenarios of modern businesses"}, {"paperId": "966774189ce00c2fe2170300ec53aa76d2bdfc28", "title": "Higher education managers’ perspectives on quality management and technology acceptance: A tale of elders, mediators, and working bees in times of Covid-19"}, {"paperId": "4b3b48c19b47504c450e796093c3c81d1f3d4fb6", "title": "Adoption of Big Data Analytics and Its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management"}, {"paperId": "f713cd21000b99499f3b1d35bac6dc75130c453b", "title": "Banking and Financial Analytics – An Emerging Big Opportunity Based on Online Big Data"}, {"paperId": "b5629aed5048e74f8d53c7da53cd875418bf5d23", "title": "Internal marketing strategies in United Arab Emirates higher education"}, {"paperId": "03b9eb6fc725c0efd4afe025b1e84ccb8ca41f11", "title": "Data Mining and Artificial Intelligence Techniques Used to Extract Big Data Patterns"}, {"paperId": "8adb47deeef943c2c1bae41f9498a382fb818a16", "title": "Big data in education: a state of the art, limitations, and future research directions"}, {"paperId": "ff525d9dbf6c5bb991a114f9ab3b24d20b7eb5e4", "title": "The Mediating Role of Learning Analytics to Improve Student Academic Performance"}, {"paperId": "c692818a9850e62b63086263574272d8618464eb", "title": "The Antecedent of Student Academic Achievement Prediction"}, {"paperId": "0ea231d8183640e627b24f5469500f83a1ff6eed", "title": "Identification of characteristics and functionalities for the design of an academic analytics model for Higher Education"}, {"paperId": "0de41962c03def0e670cb131daad47addb936b09", "title": "Design principles for learning analytics information systems in higher education"}, {"paperId": "ea6c731d68c794c913d522551c1e105362237e6c", "title": "Catalyzing knowledge management processes towards knowledge worker satisfaction: fuzzy-set qualitative comparative analysis"}, {"paperId": "396710c1f2610f53843b280292a4e3bedd255fd1", "title": "Is it worth for bachelor graduates to diversify study programme for master level?"}, {"paperId": "c3e22ea32d0583cf5fd2ca2b0bd836961547239e", "title": "Fueling knowledge management processes in Chinese higher education institutes (HEIs): the neglected mediating role of knowledge worker satisfaction"}, {"paperId": "624a0866f22da0e7dfe0c37efa19f659e27ce302", "title": "Construction of Big Data Monitoring Platform for Teaching Quality under Intelligent Education"}, {"paperId": "6b8f4850edb7fe5b1d3c6783c457227b69e642ea", "title": "The Impact of Business Intelligence Adoption on Organizational Performance Among Higher Education Institutions in Malaysia"}, {"paperId": "e77e5c146562be5d4ed985f23cdcb760f1ba1128", "title": "Sustainable Competitive Advantage of Big Data Analytics in Higher Education Sector: An Overview"}, {"paperId": "af647f6f22925e19cdfb56811bda00b69bb0cb5f", "title": "Data Analytics in Higher Education: An Integrated View"}, {"paperId": "b0a8e93f988d7bfae00e5ac8e0d9481a1b25c501", "title": "A Systematic Review on Big Data Analytics Frameworks for Higher Education - Tools and Algorithms"}, {"paperId": "1fefb4e35f99db30b326dc809ae08b4fa405a996", "title": "Development and validation of a multidimensional instrument for measuring internal marketing in Chinese higher education"}, {"paperId": "666801e7a7fcb7fba6d50c15926fe0195f960b67", "title": "Higher Education Governance of Big Data"}, {"paperId": "cc3de20da0fea326653c84770591527908b8c326", "title": "A Proposed Framework for Big Data Analytics in Higher Education"}, {"paperId": "e841da548b085d976ba334e3e88d64a8c243cc5e", "title": "Management Process of Big Data in High Education as Sociotechnical System"}, {"paperId": "9dda01a0ecb6917b35f9f8d431bf252949db4aba", "title": "Data Mining in Global Higher Education"}, {"paperId": "c9dd1feda03a86d0756d21af3eb3873c8ea5ddfa", "title": "Educational Tool for Generation and Analysis of Multidimensional Modeling on Data Warehouse"}, {"paperId": "19087ed238f655f1da934e92fc6bd17bdb02b4f7", "title": "END2END UNSTRUCTURED DATA PROCESSING, CONFIDENTIAL DATA STRUCTURING & STORAGE USING IMAGE PROCESSING, NLP, MACHINE LEARNING, AND BLOCKCHAIN"}, {"paperId": "108059291158a834ed8daaa56bad0c066297fb35", "title": "BIG DATA ANALYTICS ADOPTION AT HIGHER EDUCATION INSTITUTIONS IN IRAQ"}]}
