{"paperId": "33d19673c3191c65b08ef5aacca605e9383966e0", "publicationVenue": {"id": "27c42e7e-162c-49a3-8c30-c36674fc2f61", "name": "Journal of Polytechnic", "type": "journal", "alternate_names": ["J Polytech"], "issn": "1302-0900", "url": "http://www.politeknik.gazi.edu.tr/"}, "title": "Nesnelerin İnterneti (IoT) ve Kablosuz Algılayıcı Ağların Güvenliğine Yapılan Saldırıların Tespit Edilmesi ve Önlenmesi", "abstract": "Internet of Things (IoT) covers every object that connects to the Internet and communicates with other devices. Many IoT devices, such as autonomous vehicles, smart refrigerators, smart washing machines, smart toasters, smart watches that can become part of our lives and they can communicate with each other using different wireless network technologies. Because of using IoT devices in many critical areas, attacks against IoT security have increased. By making these attacks on IoT layers, criteria such as data privacy, data integrity, data freshness, data accessibility and authentication can be violated. Some security solutions have been proposed to prevent these attacks, but it is not possible to apply traditional security methods on low-power IoT devices due to some constraints such as limited energy, limited battery time, limited computational power and limited memory. In this paper, attacks that threaten the security of IoT devices are examined and classified according to network layers and defense techniques are proposed.", "venue": "Journal of Polytechnic", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-03-20", "journal": {"name": "Journal of Polytechnic"}, "authors": [{"authorId": "2071613192", "name": "Farzad Kiani"}], "citations": [{"paperId": "c3a593fb74f56d59ceee99e6b5c22be0d8535620", "title": "Türkiye’de Dağıtık Hesap Defteri Teknolojili Nesnelerin İnterneti Ödeme Sistemleri için Sistem Tasarım Önerileri"}]}
