{"paperId": "33d6f49f2b4a2cea2d91fe6d2c328bdba76746c1", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "The effect of big data technologies usage on social competence", "abstract": "The learning management system is a digital environment that enables the tracking of learner activities, allowing special forms of data from the academic context to be explored and used to enhance the learning process. This study aims to identify the effect of using big data technology in digital environments on the development of electronic social competence among optimal investment diploma students. An experimental method was used to explore the effect of big data technologies usage on social competence. The sample for this study consisted of (120) students in the Department of Curriculum and Teaching Methods, divided into two equal groups through random selection. The first group studied the course through a digital environment with the use of big data technology, while the second group studied the course through the digital environment without using big data technology. The electronic social competence scale was further utilized as a tool to meet the study’s goal. The experimental findings showed that big data technologies in the used digital environment significantly improved the electronic social competence of Optimal Investment Diploma students (personal skills, self-management skills, and academic skills). The results provide significant proof of the advantages of big data technology in social competence studies and development.", "venue": "PeerJ Computer Science", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-17", "journal": {"name": "PeerJ Computer Science", "volume": "9"}, "authors": [{"authorId": "30774329", "name": "Abdellah Ibrahim Mohammed Elfeky"}, {"authorId": "2128859317", "name": "A. H. Najmi"}, {"authorId": "74489525", "name": "Marwa Yasien Helmy Elbyaly"}], "citations": [{"paperId": "f36a2bbaaac0ab01ddc200fcd9f3ca7016faa0ba", "title": "The Lawsuit for Annulment of Null Administrative Decisions"}, {"paperId": "b8c21b15130bb4c87c0963bf788e2ad9646f50b2", "title": "The Prophet's Denial of Exaggeration and Extremism"}, {"paperId": "911c3fb88fc34f5d8a1e206418406b85383e8f8f", "title": "Compensation for Invalid or Nonexistent Administrative Decisions"}, {"paperId": "89425024587816ea4561f6f0b44912170d8bbfc1", "title": "The Authority of Administration in Withdrawing Void and Null Decisions"}, {"paperId": "42ac1da1dfd0c25acc9aecc5a63ecbae4222808f", "title": "The Theory of Necessity and Exceptional Circumstances as an Exception to Void and Null Administrative Decisions"}, {"paperId": "193f097946fd350822253e78d7276c993af314fc", "title": "The Role of Parents in Developing National Identity and Digital Citizenship for Kindergarten Children from The Point of View of Parents"}, {"paperId": "1636b3ea0f60cc735b9e95bfd890328534205975", "title": "The Impact of Urban Zoning Regulations on Mitigating Urban Sprawl in the Saudi System"}, {"paperId": "ca070e30895ffc5efdcfde5bc555264c72ead120", "title": "The Legal Regulation of Licensing in the Saudi System"}, {"paperId": "ae8b616c770f3eae8cb89fa97de2c14c51634a8d", "title": "Constructing Evidence Based on Two Premises among Theorists of Islamic Jurisprudence: A Study in Elucidating the Cause of Disagreement"}, {"paperId": "c7b0a2fb3ccd3ccc5a525c33c68a63780a15cdd7", "title": "Criminal Liability in the Absence of Perpetrator Eligibility: Applied Jurisprudential Study"}, {"paperId": "aa36b55405a55bdb64c675532aef510dbd86354d", "title": "Terms of Insurance for Nuclear Damage"}, {"paperId": "86667d537d5f12144cf14fc848b9bf44e3c28f22", "title": "The Nature of Nuclear Damage, in a Legal Context: Analytic Study"}, {"paperId": "b4e114bb08c35892df81fd3732764d7f73270998", "title": "The Independence of the Science of Jurisprudence Is a Study in The Concept and A Cause of Disagreement"}, {"paperId": "80831fbfcd709ee9cc14d558c80a8d794c25ef48", "title": "The Principle of Islah (Consideration of Public Interest) and Its Impact on the Sustainability of Vegetation Cover the Kingdom of Saudi Arabia"}, {"paperId": "d72c176f08e473843964a9e28f36552706be3849", "title": "The Falling of Criminal Liability by Dropping the Inviolability of Self A Comparative Jurisprudential Study"}, {"paperId": "1610f60fbb73172a9efe1dcffdbf215358aced8e", "title": "Sustainability of Natural Resources in Islamic Jurisprudence"}, {"paperId": "107ce91b03304c702195063568f66bc3bf25e17b", "title": "The Legal Basis for Civil Liability in the Nuclear Field"}, {"paperId": "5207faad9518bc74ea1e4e9dde3ae3bc09770bd2", "title": "References to Intertextuality in Diwan (the Collection of Poetry) by\" Hassan Bin Batnnin\". Arriving thereby in the Center Poetically"}, {"paperId": "b32cb5c88b5e1e8e3238394b5deaac1871178fca", "title": "Types of Hadiths that have been Weak by Hadith Scholars in Terms of the Authenticity of the Chain of Transmission and the Correctness of the Meaning"}, {"paperId": "bad04562c4e3440b9304e0e59236247cafb6f628", "title": "Employing Characters in the (Shayout's Novel) By (Hatem Hussein Hatem): Study in Narrative Mechanism"}, {"paperId": "ad385dbd8721e3a87fffb3bdd04878200e4df917", "title": "The Semiotics of the Title in the Diwan (Qadas Jasad) By the writer: Mona Bint Mohammed"}, {"paperId": "7cad880b119e1cf80814b2700d6730c463f8ff87", "title": "A Reading of the Narrative Language in Diwan (For whom the Birds Sing - Leman Toghany Al Toyoor)"}]}
