{"paperId": "33d7fd3765335f57cb624257cb4aa1c9c0ade831", "publicationVenue": {"id": "9899cb13-0f69-47ee-a3c7-bc0721bb7f8d", "name": "Jurnal Sistem Informasi dan Informatika (Simika)", "type": "journal", "alternate_names": ["J Sist Inf dan Inform (simika"], "issn": "2622-6901"}, "title": "EVALUASI USABILITAS SISTEM MENGGUNAKAN METODE SYSTEM USABILITY SCALE (SUS) PADA APLIKASI AKHLAQU DENGAN PENERAPAN TEKNIK INDEXING MONG", "abstract": "The Akhlaqu Application is a web-based Islamic learning platform used by Al-Falah Integrated Islamic Elementary School to facilitate the recording and reporting of students’ activities in developing their memorization. This research aims to assess the level of user satisfaction with the Akhlaqu Application using the System Usability Scale (SUS). The results showed a high level of usability, measured by a System Usability Scale (SUS) score of 89.7, indicating a “very good” quality application that meets high usability standards. In addition, the implementation of text indexes on MongoDB has a positive impact on the speed of transaction data search, especially on complex data searches, improving the efficiency and responsiveness of the application. The implications of this research involve recommendations to continue to improve the usability and performance of the Akhlaqu Application, by maintaining the use of MongoDB index techniques as a reliable solution for optimizing the database. The study concludes that the Akhlaqu Application is an effective tool for managing students’ memorization and recommends further improvements to enhance its usability and performance.", "venue": "Jurnal Sistem Informasi dan Informatika (Simika)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-21", "journal": {"name": "Jurnal Sistem Informasi dan Informatika (Simika)"}, "authors": [{"authorId": "2292617710", "name": "Mochammad Fauzan Fadilah"}, {"authorId": "67048863", "name": "Nining Rahaningsih"}, {"authorId": "65836898", "name": "Raditya Danar Dana"}], "citations": []}
