{"paperId": "33dc8d233f813acf60cbc0711970bb7a94913e79", "publicationVenue": {"id": "72b1619c-55d6-4f98-9218-23cd8aa74091", "name": "IEEE Uttar Pradesh Section International Conference on Electrical, Computer and Electronics Engineering", "type": "conference", "alternate_names": ["UPCON", "IEEE uttar pradesh Sect Int Conf Electr Comput Electron Eng"]}, "title": "Design and Optimization of Low-Power VLSI Circuits for IoT Devices", "abstract": "The proliferation of IoT devices has changed the way we engage with the physical environment. However, because of their widespread use, energy economy and environmentally responsible operations are given special consideration. This study explores the “Design and Optimization of Low-Power VLSI Circuits for IoT Devices,” with an eye on striking a good power-to-performance ratio. Our research takes a holistic strategy, investigating architecture, optimizing at the transistor level, honing algorithms, and incorporating Internet of Things (IoT)-centric concerns. The findings stress the significance of low-power VLSI circuit design for Internet of Things gadgets. Voltage and frequency scaling are two examples of architectural options that may significantly cut power consumption without sacrificing performance. Optimising transistors, in particular via scaling voltage, results in substantial energy savings and increased device lifespan. Using evolutionary algorithms shows how algorithmic optimization may help cut down on power use without sacrificing performance. In addition, the unique requirements of IoT applications stress the need of context-aware circuit design, with an emphasis on maximizing battery life and minimizing environmental impact. By highlighting the trade-offs between power and performance, comparative assessments help direct IoT deployments towards becoming both cost-effective and energy-efficient. In conclusion, our study provides valuable takeaways that have far-reaching consequences across a range of industries. More sustainable and cost-effective practices should be expected from IoT service providers and developers, while users can look forward to longer battery life and greater device dependability. This work is in line with global sustainability initiatives and will help create an Internet of Things that is less harmful to the environment. As the Internet of Things (IoT) grows in popularity, our studies will be a light pointing the way to a more productive, environmentally friendly, and interconnected future.", "venue": "IEEE Uttar Pradesh Section International Conference on Electrical, Computer and Electronics Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-01", "journal": {"name": "2023 10th IEEE Uttar Pradesh Section International Conference on Electrical, Electronics and Computer Engineering (UPCON)", "pages": "1267-1273", "volume": "10"}, "authors": [{"authorId": "2281339262", "name": "Aditi Saxena"}, {"authorId": "2287978437", "name": "Dr. D. Haripriya"}, {"authorId": "2100532051", "name": "Parul Madan"}, {"authorId": "2244009680", "name": "Arun Pratap Srivastava"}, {"authorId": "2281338996", "name": "N. Shalini"}, {"authorId": "2287811894", "name": "Anil Kumar"}], "citations": []}
