{"paperId": "33e740475fbd4426ff069eb8ed44a894fb5b3218", "publicationVenue": null, "title": "Towards the Use of Big Data in Healthcare: A Literature Review", "abstract": "The interest in new and more advanced technological solutions is paving the way for the diffusion of innovative and revolutionary applications in healthcare organizations. The application of an artificial intelligence system to medical research has the potential to move toward highly advanced e-Health. This analysis aims to explore the main areas of application of big data in healthcare, as well as the restructuring of the technological infrastructure and the integration of traditional data analytical tools and techniques with an elaborate computational technology that is able to enhance and extract useful information for decision-making. We conducted a literature review using the Scopus database over the period 2010–2020. The article selection process involved five steps: the planning and identification of studies, the evaluation of articles, the extraction of results, the summary, and the dissemination of the audit results. We included 93 documents. Our results suggest that effective and patient-centered care cannot disregard the acquisition, management, and analysis of a huge volume and variety of health data. In this way, an immediate and more effective diagnosis could be possible while maximizing healthcare resources. Deriving the benefits associated with digitization and technological innovation, however, requires the restructuring of traditional operational and strategic processes, and the acquisition of new skills.", "venue": "Healthcare", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Healthcare", "volume": "10"}, "authors": [{"authorId": "101392862", "name": "Grazia Dicuonzo"}, {"authorId": "2084174748", "name": "Graziana Galeone"}, {"authorId": "2151843865", "name": "Matilda Shini"}, {"authorId": "72329671", "name": "Antonella Massari"}], "citations": [{"paperId": "8fabf24a07f006bd2097584770afd3953aadc4a6", "title": "Shaping the future of AI in healthcare through ethics and governance"}, {"paperId": "608d2a502450568a58b034796ad5a44f4f7a800e", "title": "From machine learning to deep learning: An advances of the recent data-driven paradigm shift in medicine and healthcare"}, {"paperId": "90f81e901b18612d528aad6c891a435ce098e70c", "title": "Enhancing Digital Health Services with Big Data Analytics"}, {"paperId": "3c8b3f27ccc8eb2a502531deef3aef2612951806", "title": "Machine learning for autism spectrum disorder diagnosis using structural magnetic resonance imaging: Promising but challenging"}, {"paperId": "12154970ebe8265addb1463c3ed185eaa91bd00d", "title": "Biobanking in the digital pathology era"}]}
