{"paperId": "33ea7501cb5db54799b92bae54dd00350e4492cc", "publicationVenue": null, "title": "Cluster Analysis of Haze Episodes Based on Topological Features", "abstract": "Severe haze episodes have periodically occurred in Southeast Asia, specifically taunting Malaysia with adverse effects. A technique called cluster analysis was used to analyze these occurrences. Traditional cluster analysis, in particular, hierarchical agglomerative cluster analysis (HACA), was applied directly to data sets. The data sets may contain hidden patterns that can be explored. In this paper, this underlying information was captured via persistent homology, a topological data analysis (TDA) tool, which extracts topological features including components, holes, and cavities in the data sets. In particular, an improved version of HACA was proposed by combining HACA and persistent homology. Additionally, a comparative study between traditional HACA and improved HACA was done using particulate matter data, which was the major pollutant found during haze episodes by the Klang, Petaling Jaya, and Shah Alam air quality monitoring stations. The effectiveness of these two clustering approaches was evaluated based on their ability to cluster the months according to the haze condition. The results showed that clustering based on topological features via the improved HACA approach was able to correctly group the months with severe haze compared to clustering them without such features, and these results were consistent for all three locations.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-05-13", "journal": {"name": "Sustainability", "pages": "1-17", "volume": "12"}, "authors": [{"authorId": "151157904", "name": "N. F. S. Zulkepli"}, {"authorId": "97549598", "name": "M. Noorani"}, {"authorId": "35121943", "name": "F. Razak"}, {"authorId": "1575709615", "name": "M. Ismail"}, {"authorId": "8663175", "name": "M. A. Alias"}], "citations": [{"paperId": "270812161497a60b1fdf17c8544518a4dcc14c5c", "title": "Exploring Contemporary Calligraphic Creation and Aesthetic Characteristics Using Topological Data Analysis Methods"}, {"paperId": "c641b9bedc89a501bcd45aaef67f5cf1b844b670", "title": "Ground-Level Particulate Matter (PM2.5) Concentration Mapping in the Central and South Zones of Peninsular Malaysia Using a Geostatistical Approach"}, {"paperId": "d0847fbc675d26fa29d4bcee8a1ff3ab05f9e64e", "title": "Understanding Published Literatures on Persistent Homology using Social Network Analysis"}, {"paperId": "97e50ec972a6c525a43500fa9ee78edfe845dd81", "title": "Streamflow Data Analysis for Flood Detection using Persistent Homology"}, {"paperId": "d2fdf0f04905e690de894a19f48f416420150531", "title": "Classification of Urban Pollution Levels Based on Clustering and Spatial Statistics"}, {"paperId": "bdf16e1ad11c50a4ea78e2f8c3689147ca0dd9c5", "title": "Hybridization of hierarchical clustering with persistent homology in assessing haze episodes between air quality monitoring stations."}, {"paperId": "f8ebdf1654975723a7425db55f2b02be6bec8c27", "title": "Topological data analysis via unsupervised machine learning for recognizing atmospheric river patterns on flood detection"}, {"paperId": "ed15b1889debcbf52ca53761af2fc61f8db04858", "title": "Time Series Clustering with Topological and Geometric Mixed Distance"}]}
