{"paperId": "33f1554456a869786b0dca8ac4ef2296dee3f530", "publicationVenue": {"id": "5ba95a67-2080-4471-91fd-1426543d948f", "name": "Asia Pacific Journal of Public Administration", "type": "journal", "alternate_names": ["Asia Pac j public adm", "The Asia Pacific journal of public administration", "Asia Pac J Public Adm"], "issn": "2327-6673", "url": "http://www.tandfonline.com/loi/rapa20", "alternate_urls": ["http://www.tandfonline.com/RAPA", "http://sunzi1.lib.hku.hk/hkjo/issue.jsp?book=50"]}, "title": "When the power of the purse meets the power of technology: a case study of Guangzhou People’s Congress in China", "abstract": "Technology in governance has never been as important as it is now. Yet, how legislatures use new technology to enhance their oversight of government is neglected in the existing literature. This study developed a framework of information capacity to explain how big data technology could contribute to stronger legislative budget oversight in China. The authors select Guangzhou as a case and found that the online budget supervision system in Guangzhou provided an opportunity for local people’s congresses in China to improve both their efficiency and effectiveness despite their lack of expertise and time. All things considered, the accountability of the entire budgeting system is being improved. However, China’s case may not be copied elsewhere. The use of big data technology requires a favourable environment and various resources. Both technological advances and behavioural change are likely to take a long time to accomplish.", "venue": "Asia Pacific Journal of Public Administration", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-10-01", "journal": {"name": "Asia Pacific Journal of Public Administration", "pages": "274 - 289", "volume": "42"}, "authors": [{"authorId": "145259314", "name": "Meili Niu"}, {"authorId": "79396701", "name": "Muhua Lin"}], "citations": [{"paperId": "f7eb85f74a735f8c898ddfd9d5210774907fb587", "title": "“Beneficial Owners” Policy: Comparison of Its Efficacy in the West with Prospects for Curbing Corruption in China"}, {"paperId": "0817f11d39b83077ddeed12d67755c73767d1c19", "title": "Smart Energy Trend Observation"}]}
