{"paperId": "33f1045edbd2bd8e09b625598862e57cb2ceeeab", "publicationVenue": {"id": "5b12c785-cf12-40ca-b4d1-aefd13b26e39", "name": "Intelligent Data Analysis", "type": "journal", "alternate_names": ["Intell Data Anal"], "issn": "1088-467X", "url": "http://content.iospress.com/journals/intelligent-data-analysis", "alternate_urls": ["http://www.iospress.nl/intelligent-data-analysis/"]}, "title": "Parallel power load abnormalities detection using fast density peak clustering with a hybrid canopy-K-means algorithm", "abstract": "Parallel power loads anomalies are processed by a fast-density peak clustering technique that capitalizes on the hybrid strengths of Canopy and K-means algorithms all within Apache Mahout’s distributed machine-learning environment. The study taps into Apache Hadoop’s robust tools for data storage and processing, including HDFS and MapReduce, to effectively manage and analyze big data challenges. The preprocessing phase utilizes Canopy clustering to expedite the initial partitioning of data points, which are subsequently refined by K-means to enhance clustering performance. Experimental results confirm that incorporating the Canopy as an initial step markedly reduces the computational effort to process the vast quantity of parallel power load abnormalities. The Canopy clustering approach, enabled by distributed machine learning through Apache Mahout, is utilized as a preprocessing step within the K-means clustering technique. The hybrid algorithm was implemented to minimise the length of time needed to address the massive scale of the detected parallel power load abnormalities. Data vectors are generated based on the time needed, sequential and parallel candidate feature data are obtained, and the data rate is combined. After classifying the time set using the canopy with the K-means algorithm and the vector representation weighted by factors, the clustering impact is assessed using purity, precision, recall, and F value. The results showed that using canopy as a preprocessing step cut the time it proceeds to deal with the significant number of power load abnormalities found in parallel using a fast density peak dataset and the time it proceeds for the k-means algorithm to run. Additionally, tests demonstrate that combining canopy and the K-means algorithm to analyze data performs consistently and dependably on the Hadoop platform and has a clustering result that offers a scalable and effective solution for power system monitoring.", "venue": "Intelligent Data Analysis", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-25", "journal": {"name": "Intelligent Data Analysis"}, "authors": [{"authorId": "2282548396", "name": "Ahmed Hadi Ali Al-Jumaili"}, {"authorId": "1838461", "name": "R. C. Muniyandi"}, {"authorId": "2243291313", "name": "Mohammad Kamrul Hasan"}, {"authorId": "2187179224", "name": "Mandeep Jit Singh"}, {"authorId": "31939030", "name": "J. Paw"}, {"authorId": "88617540", "name": "A. Al-Jumaily"}], "citations": []}
