{"paperId": "33f43df37dca17fc09953f1a59acff78496b645a", "publicationVenue": {"id": "8fe597d4-c02e-4c19-948d-7cfb7b046123", "name": "Journal of Environmental Planning and Management", "type": "journal", "alternate_names": ["J Environ Plan Manag"], "issn": "0964-0568", "url": "http://www.catchword.com/rpsv/catchword/carfax/13600559/contp1-1.htm", "alternate_urls": ["http://figaro.catchword.com/rpsv/catchword/carfax/13600559/contp1-1.htm", "http://www.tandfonline.com/loi/cjep20", "http://www.metapress.com/openurl.asp?genre=journal&issn=0964-0568"]}, "title": "Machine learning data-driven approaches for land use/cover mapping and trend analysis using Google Earth Engine", "abstract": "With the recent advances in earth observation technologies, the increasing availability of data from more and more different satellite sensors as well as progress in semi-automated and automated classification techniques enable the (semi-) automated remote monitoring and analysis of large areas. Online platforms such as Google Earth Engine (GEE) bring data-driven techniques to the desktops of researchers while changing workflows and making excessive data downloads redundant. We present a study that utilizes machine learning algorithms on the GEE cloud computing platform for land use/land cover (LULC) mapping and change detection analysis using a Landsat satellite image time series. We applied different machine learning techniques to data from an environmentally sensitive area in Northern Iran. We tested their efficiency for LULC mapping and change detection analysis using the support vector machine (SVM), random forest (RF) and classification and regression tree (CART). We obtained LULC maps for the years 2000, 2005, 2010, 2015 and 2020. Training data was collected from field operations and historical datasets, and the respective LULC maps were validated using ground control points. In addition, we validated the reliability of the results through a spatial uncertainty analysis using Dempster-Shafer Theory (DST). The resulting accuracies of the classification outcomes varied significantly. SVM performed best with accuracies of 90.25%, 91.84%, 89.02%, 93.35% and 95.65% for 2000, 2005, 2010, 2015 and 2020, respectively. The spatial uncertainty analysis also validated the efficiency of SVM compared to RF and CART. The results confirm the potential of machine learning techniques for time series LULC mapping on the GEE platform while lowering the barriers to analyzing large amounts of satellite data. The results are also critical for decision-makers and authorities for analyzing the LULC changes and developing the respective environmental protection and polices in Northern Iran.", "venue": "Journal of Environmental Planning and Management", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-23", "journal": {"name": "Journal of Environmental Planning and Management", "pages": "665 - 697", "volume": "66"}, "authors": [{"authorId": "2132096", "name": "B. Feizizadeh"}, {"authorId": "2088956747", "name": "Davoud Omarzadeh"}, {"authorId": "2124215515", "name": "Mohammad Kazemi Garajeh"}, {"authorId": "2004315", "name": "T. Lakes"}, {"authorId": "50594282", "name": "T. Blaschke"}], "citations": [{"paperId": "ec435b60737fb809ea0816ee57f481195d925be5", "title": "Performance assessment of machine learning algorithms for mapping of land use/land cover using remote sensing data"}, {"paperId": "adf913d4be154fc31869ada476007c74a005f0e3", "title": "The multiscale nexus among land use-land cover changes and water quality in the Suquía River Basin, a semi-arid region of Argentina"}, {"paperId": "830c517e6fa53561329aff1ab958107d98dce507", "title": "Characterizing land use-land cover changes in N’fis watershed, Western High Atlas, Morocco (1984–2022)"}, {"paperId": "9da1d0ff85f2d6236d1876ab1d2e132ee0d104c4", "title": "Long term analysis of international wetlands in Iran: Monitoring surface water area and water balance"}, {"paperId": "0d74105af0f8d594a1a69a60abe5b437e1de7821", "title": "Monitoring the Spatio-Temporal Distribution of Soil Salinity Using Google Earth Engine for Detecting the Saline Areas Susceptible to Salt Storm Occurrence"}, {"paperId": "e7b809c8d1897064130c28e5f8648d24f2db0890", "title": "Spatial and temporal classification and prediction of LULC in Brahmani and Baitarni basin using integrated cellular automata models"}, {"paperId": "f3a10e942b9118c508b9a599284647e9c94e37f6", "title": "Monitoring Landuse Change in Uchhali and Khabeki Wetland Lakes, Pakistan using Remote Sensing Data"}, {"paperId": "a58bd988dd358415f9e4bbb631e295967dc1d111", "title": "Landscape dynamics and its related factors in the Citarum River Basin: a comparison of three algorithms with multivariate analysis"}, {"paperId": "8c281df1652463334423e6bd7f4bf5726c7f854a", "title": "Impact of land use/land cover changes on evapotranspiration and model accuracy using Google Earth engine and classification and regression tree modeling"}, {"paperId": "973c1970a483ff82e56dd4bf32f2b13346961560", "title": "Transfer-Ensemble Learning: A Novel Approach for Mapping Urban Land Use/Cover of the Indian Metropolitans"}, {"paperId": "488c1966643d6a90ab86b26609dab2d5d2a7db58", "title": "Land Cover and Landscape Structural Changes Using Extreme Gradient Boosting Random Forest and Fragmentation Analysis"}, {"paperId": "9a51e6b8cf12450c1af78f549bb377b0dacf1bcc", "title": "Quantifying LULC changes in Urmia Lake Basin using machine learning techniques, intensity analysis and a combined method of cellular automata (CA) and artificial neural networks (ANN) (CA-ANN)"}, {"paperId": "bf25aaaeffe131ad919fa128f60099a7795a5037", "title": "Mapping and monitoring land use land cover dynamics employing Google Earth Engine and machine learning algorithms on Chattogram, Bangladesh"}, {"paperId": "67e889c146273c87b1ced6ba30f0c7eb78f8d14c", "title": "Spatio-temporal patterns of climate parameter changes in Western Mediterranean basin of Türkiye and implications for urban planning"}, {"paperId": "b7b4e312e0c0c7d4a616ddc3b0a3111e0fccc3f9", "title": "SPATIAL AND TEMPORAL ANALYSIS OF POLLUTANT GASES IN WESTERN BLACK SEA OF TURKIYE"}, {"paperId": "191acf72a33003ec5c62ba92d997b136672ea6f9", "title": "Sat2Cap: Mapping Fine-Grained Textual Descriptions from Satellite Images"}, {"paperId": "79619d6a8c0890c9240c73f4f0577f32bd31f4e3", "title": "A novel alpine land cover classification strategy based on a deep convolutional neural network and multi-source remote sensing data in Google Earth Engine"}, {"paperId": "024097fd596433ac7be976a03774c61c3237491f", "title": "Where Is the Geography? A Study of the Predictors of Obesity Using UK Biobank Data and Machine Learning"}, {"paperId": "620f76187d618df4259bf2371a91388f15e6e813", "title": "Geographic similarity analysis for Land System Science: opportunities and tools to facilitate knowledge integration and transfer"}, {"paperId": "584eca2f7ead8ba620b313f6bb5064c239880d1b", "title": "Dynamics and future prediction of LULC on Pare River basin of Arunachal Pradesh using machine learning techniques"}, {"paperId": "f0f58ba718e44b083cde9ce1b2cfbefc56b2654c", "title": "Monitoring Trends of CO, NO2, SO2, and O3 Pollutants Using Time-Series Sentinel-5 Images Based on Google Earth Engine"}, {"paperId": "a35703f56ffe51357581ebdb91dceedecaeaeee7", "title": "Time series (2001/2002–2021) analysis of Earth observation data using Google Earth Engine (GEE) for detecting changes in land use land cover (LULC) with specific reference to forest cover in East Godavari Region, Andhra Pradesh, India"}, {"paperId": "f279107d943daea111cf184e3e7c9e694c5ceb4c", "title": "Multi-resource potentiality and multi-hazard susceptibility assessments of the central west coast of India applying machine learning and geospatial techniques"}, {"paperId": "9fb966ed9630962b6d3dc4178c642c6cdbb320e5", "title": "Spatial Tools for Inclusive Landscape Governance: Negotiating Land Use, Land-Cover Change, and Future Landscape Scenarios in Two Multistakeholder Platforms in Zambia"}, {"paperId": "6069d06eeb89f699de2ed1c7da1daca3d16d9bea", "title": "Pixel-based unique phenological feature composite method: tackle the challenges of Spartina alterniflora identification and salt marsh classification in mixed vegetations area"}, {"paperId": "f0fdf642a477a9ad6242812dc42e0494608634d0", "title": "Spatiotemporal monitoring of droughts in Iran using remote-sensing indices"}, {"paperId": "35147d2a6cf32bced196f4312022d73d466c3dbf", "title": "Land cover classification and urbanization monitoring using Landsat data: A case study in Changsha city, Hunan province, China"}, {"paperId": "f386c6f4b074c351ea71c2a4ea3608715a0ba8d2", "title": "V-BANet: Land cover change detection using effective deep learning technique"}, {"paperId": "4bad3f9148895e9e7df16398723be8c6b419f0bf", "title": "Health effects of shrinking hyper-saline lakes: spatiotemporal modeling of the Lake Urmia drought on the local population, case study of the Shabestar County"}, {"paperId": "bf302cb23c0a71fc28ce63f3028168e255f0865f", "title": "An integrated approach of remote sensing and geospatial analysis for modeling and predicting the impacts of climate change on food security"}, {"paperId": "bdf9beb89746feb798944b78e63b39840887b596", "title": "Extraction and spatiotemporal changes of open-pit mines during 1985–2020 using Google Earth Engine: A case study of Qingzhou City, Shandong Province, China"}, {"paperId": "c71ed44a14ba421dc7c5a59d68a7aa9908a7b344", "title": "Land Use Land Cover Classification using Machine Learning"}, {"paperId": "c90a093c4ea4d4c10daf56dbd4f5b598938d18cc", "title": "Impacts of the Urmia Lake Drought on Soil Salinity and Degradation Risk: An Integrated Geoinformatics Analysis and Monitoring Approach"}, {"paperId": "2ce4de304f4e802a8462a41152d01518caa48dff", "title": "Land use and land cover change and its impact on river morphology in Johor River Basin, Malaysia"}, {"paperId": "c71459238f3cd3e391c9b0eb4c4075d1d5606dc7", "title": "QADI as a New Method and Alternative to Kappa for Accuracy Assessment of Remote Sensing-Based Image Classification"}, {"paperId": "450730173238dc5a4494b6e087c65680b2e119e5", "title": "A GIS-Based Spatiotemporal Impact Assessment of Droughts in the Hyper-Saline Urmia Lake Basin on the Hydro-Geochemical Quality of Nearby Aquifers"}, {"paperId": "683848059a3d67169e1e0c1f7cefa2bbec1936a6", "title": "Learning-Based Methods for Detection and Monitoring of Shallow Flood-Affected Areas: Impact of Shallow-Flood Spreading on Vegetation Density"}, {"paperId": "b992cfd66219bc5642972533063915a7741076d8", "title": "Effectiveness of the integration of data balancing techniques and tree-based ensemble machine learning algorithms for spatially-explicit land cover accuracy prediction"}, {"paperId": "f6b4d67fcd37ad104f2e4d4f039dadd204931596", "title": "Desert landform detection and mapping using a semi-automated object-based image analysis approach"}, {"paperId": "4780433338b4d6fff2eb06d4d4490061b89afff9", "title": "Change of land use / land cover in kurdistan region of Iraq: A semi-automated object-based approach"}, {"paperId": "fc32620e33821cc9339f1b7edaa70deeacdee826", "title": "Combining high resolution input and stacking ensemble machine learning algorithms for developing robust groundwater potentiality models in Bisha watershed, Saudi Arabia"}, {"paperId": "28cfdf8e2a963e53986b1b6e3e5aa301df5bbeb7", "title": "Land-Use Planning for Farming Area in West Java to Divide Allocation of Vegetables Commodity Using Genetic Algorithm Approach"}, {"paperId": "a0bea4ec7f1e370895043fd133cc2434c2dfb9ba", "title": "An integrated approach of artificial intelligence and geoinformation techniques applied to forest fire risk modeling in Gachsaran, Iran"}, {"paperId": "91006d3fc003c600c36c1421f1bb70c5f27b5a06", "title": "A bi-directional strategy to detect land use function change using time-series Landsat imagery on Google Earth Engine: A case study of Huangshui River Basin in China"}, {"paperId": "f97b529fb0b0d609cb96efc67367160eb468a435", "title": "Cucumber Leaf Diseases Recognition Using Multi Level Deep Entropy-ELM Feature Selection"}, {"paperId": "5ab5655a270a42ff07189cbd3d834cf51ca92d94", "title": "A comparison of the integrated fuzzy object-based deep learning approach and three machine learning techniques for land use/cover change monitoring and environmental impacts assessment"}, {"paperId": "2f2ea8fef503576e6c9c622e5936875f01108423", "title": "A Novel Bottleneck Residual and Self-Attention Fusion-Assisted Architecture for Land Use Recognition in Remote Sensing Images"}, {"paperId": "b645e778219b174066f8cd6a27a40d20a8d3ff48", "title": "Land Use and Urban Sprawl in the Case of the City of Rabat in Morocco: An Integrated Approach Using Remote Sensing, Geospatial Modeling, and Machine Learning"}, {"paperId": "379f4e3b2e52f10e11a01e803e3ac9bcdeb870ae", "title": "Assessment of the effect of land use and land cover (LULC) change on depth runoff: Case study of Skikda floods event"}, {"paperId": "1f7847797517b789050bab61278835d4cea92922", "title": "Applying Big Data Analysis and Machine Learning Approaches for Optimal Production Management"}, {"paperId": "2ca0023e3afd10b2e975c731d23c9360ca6e7333", "title": "Application of Convolutional Neural Networks With Object-Based Image Analysis for Land Cover and Land Use Mapping in Coastal Areas: A Case Study in Ain Témouchent, Algeria"}, {"paperId": "500f396dc7b540656ccae1f3c596be3334b25dc6", "title": "remote sensing"}]}
