{"paperId": "33fa38d80ca900dafe708747f062b75f6e4abd96", "publicationVenue": {"id": "8de18c35-6785-4e54-99f2-21ee961302c6", "name": "Conference of the European Chapter of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Conf Eur Chapter Assoc Comput Linguistics", "EACL"], "url": "https://www.aclweb.org/anthology/venues/eacl/"}, "title": "Us vs. Them: A Dataset of Populist Attitudes, News Bias and Emotions", "abstract": "Computational modelling of political discourse tasks has become an increasingly important area of research in the field of natural language processing. Populist rhetoric has risen across the political sphere in recent years; however, due to its complex nature, computational approaches to it have been scarce. In this paper, we present the new Us vs. Them dataset, consisting of 6861 Reddit comments annotated for populist attitudes and the first large-scale computational models of this phenomenon. We investigate the relationship between populist mindsets and social groups, as well as a range of emotions typically associated with these. We set a baseline for two tasks associated with populist attitudes and present a set of multi-task learning models that leverage and demonstrate the importance of emotion and group identification as auxiliary tasks.", "venue": "Conference of the European Chapter of the Association for Computational Linguistics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-01-28", "journal": {"name": "ArXiv", "volume": "abs/2101.11956"}, "authors": [{"authorId": "2008209083", "name": "Pere-Lluís Huguet Cabot"}, {"authorId": "34854736", "name": "David Abadi"}, {"authorId": "7444483", "name": "A. Fischer"}, {"authorId": "2362276", "name": "Ekaterina Shutova"}], "citations": [{"paperId": "4c8b37c0f02252a76ef795f9c33a507d3006b0f4", "title": "From Melting Pots to Misrepresentations: Exploring Harms in Generative AI"}, {"paperId": "f7c93f5328cca5539081c47dec65651609f3905d", "title": "MAGPIE: Multi-Task Media-Bias Analysis Generalization for Pre-Trained Identification of Expressions"}, {"paperId": "1f6fbad11249905de2c1f3683c5471d958435865", "title": "The Media Bias Taxonomy: A Systematic Literature Review on the Forms and Automated Detection of Media Bias"}, {"paperId": "8d53c510928ad1164aebea4d9477812ed1893be2", "title": "Expanding the Role of Affective Phenomena in Multimodal Interaction Research"}, {"paperId": "9e13410ffb42f11eba304c49189342ec47037bb1", "title": "Introducing MBIB - The First Media Bias Identification Benchmark Task and Dataset Collection"}, {"paperId": "738012ac75da04fe62bc37e8b7f3e755ae519184", "title": "A comparative corpus study of race and Rasse"}, {"paperId": "624b3420a8bf55629590eee02abe2f9d861e9493", "title": "Exploiting Transformer-Based Multitask Learning for the Detection of Media Bias in News Articles"}, {"paperId": "2255878a02bf3d4c28792bc276cfd7180266c3a3", "title": "Share and Shout: Proto-Slogans in Online Political Communities"}, {"paperId": "3190cdbf3a6b090be67c43d90675c5fb5bd5abc0", "title": "Anxious and Angry: Emotional Responses to the COVID-19 Threat"}, {"paperId": "f45346be10c6abf25368a77d6e45764e789ed996", "title": "Our kind of people? Detecting populist references in political debates"}, {"paperId": "77d014853c658836f4d21c18ff288f0252739276", "title": "Emotion Analysis from Texts"}, {"paperId": "ce29a77010e47ed62e2e10c5654ab335e062ae22", "title": "Improving Media Bias Detection with state-of-the-art Transformers"}, {"paperId": "1669a5929c6706efaec0fe2ddb4a62130bd93cb3", "title": "Toward Cultural Bias Evaluation Datasets: The Case of Bengali Gender, Religious, and National Identity"}, {"paperId": "235b0dd9c36d068b6bc9cd4dd5c20455991334a3", "title": "SRL4E – Semantic Role Labeling for Emotions: A Unified Evaluation Framework"}]}
