{"paperId": "340177dc7ea7157e7237e3ac4de082299b404fc9", "publicationVenue": null, "title": "An Intelligent Edge-centric Queries Allocation Scheme based on Ensemble Models", "abstract": "The combination of Internet of Things (IoT) and Edge Computing (EC) can assist in the delivery of novel applications that will facilitate end-users’ activities. Data collected by numerous devices present in the IoT infrastructure can be hosted into a set of EC nodes becoming the subject of processing tasks for the provision of analytics. Analytics are derived as the result of various queries defined by end-users or applications. Such queries can be executed in the available EC nodes to limit the latency in the provision of responses. In this article, we propose a meta-ensemble learning scheme that supports the decision making for the allocation of queries to the appropriate EC nodes. Our learning model decides over queries’ and nodes’ characteristics. We provide the description of a matching process between queries and nodes after concluding the contextual information for each envisioned characteristic adopted in our meta-ensemble scheme. We rely on widely known ensemble models, combine them, and offer an additional processing layer to increase the performance. The aim is to result a subset of EC nodes that will host each incoming query. Apart from the description of the proposed model, we report on its evaluation and the corresponding results. Through a large set of experiments and a numerical analysis, we aim at revealing the pros and cons of the proposed scheme.", "venue": "ACM Trans. Internet Techn.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-12", "journal": {"name": "ACM Transactions on Internet Technology (TOIT)", "pages": "1 - 25", "volume": "20"}, "authors": [{"authorId": "2823733", "name": "Kostas Kolomvatsos"}, {"authorId": "145078804", "name": "C. Anagnostopoulos"}], "citations": [{"paperId": "94f6e628a5dadfaec90981101bf60ad1c022fbd1", "title": "Queries allocation in WSNs with fuzzy control system"}, {"paperId": "be4fe335b3f7e6864b7df2f7a5bc987da8be4883", "title": "A QoS-aware, Proactive Tasks Offloading Model for Pervasive Applications"}, {"paperId": "549268a2cf2196292558a7aa6e4af47e20873422", "title": "Monitoring and Proactive Management of QoS Levels in Pervasive Applications"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}, {"paperId": "140535dc64805e6947168a994179651bb187c129", "title": "A Deep Learning Model for Data Synopses Management in Pervasive Computing Applications"}]}
