{"paperId": "3405a8f4107a648f28539b1cf0c05afe6bf22fb2", "publicationVenue": {"id": "1aab2ad9-5e27-4004-99d5-0ad199f2d847", "name": "World Congress on Intelligent Control and Automation", "type": "conference", "alternate_names": ["WCICA", "World Congr Intell Control Autom"]}, "title": "HTME: A data streams processing strategy based on Hoeffding tree in MapReduce environment", "abstract": "In recent years Wireless Sensor Networks have provided a effective solution for sensing and gathering spatial data by ZigBee protocol or other wireless network protocols. So the massive sensor data streams processing has reached many areas of monitoring application in internet of things. The sensor data streams constantly flow in and flow out of the monitoring system, cloud computing can provide a scalable storage and the massive data processing power to perform both online and offline analysis and mining of the heterogeneous sensor data streams. In order to support the classification of the sensor data streams, in this paper, a sensor data streams processing strategy is proposed based on Hoeffding tree algorithm for event monitoring application in cloud computing. The proposed strategy is sufficient for sensor data streams classification tasks using map-reduce platform of cloud computing. Finally, the possibilities of the strategy are demonstrated on spatial sensing data streams processing operations in comparison with existing solutions in the MapReduce environment. The simulation results show that the strategy achieves more energy savings and also ensures few amounts of sensor data retained in memory.", "venue": "World Congress on Intelligent Control and Automation", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-06-12", "journal": {"name": "2016 12th World Congress on Intelligent Control and Automation (WCICA)", "pages": "1042-1045"}, "authors": [{"authorId": "2112283148", "name": "Xin Song"}, {"authorId": "144407306", "name": "Jing Gao"}, {"authorId": "11193565", "name": "Jin'an Ma"}, {"authorId": "8760178", "name": "Shaokai Niu"}, {"authorId": "2111893209", "name": "Huiyuan He"}], "citations": [{"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "023e6703cb8b4a2942fc51b16389a7a295a829fe", "title": "An Agricultural Habitat Information Acquisition and Remote Intelligent Decision System Based on the Internet of Things"}, {"paperId": "f88bc50f9ab8ebd9c9ba0ffee61436ffca839e60", "title": "Dynamic Load Management Method for Spatial Data Stream Processing on MapReduce Online Frameworks"}]}
