{"paperId": "340ba4a9632dc91c3a59578964d9f725219ef8ae", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Combined with the Internet technology of college student training mode innovation and student management mechanism optimization", "abstract": "\n Based on the current situation of student cultivation mode and student management in colleges and universities, this paper puts forward six basic assumptions on student cultivation and management, and combines the assumptions to obtain the game payment matrix of student cultivation mode and student management. The dynamic equations of the cultivation and management process are reproduced by using mathematical calculus to derive the game payment matrix. Under the constraints, the game evolution model equilibrium point is tested for stability, the game evolution state is derived, and the game evolution model is completed to optimize the innovation of college student training mode and student management mechanism. Numerical simulation analysis is performed on the evolutionary game of college student cultivation and management based on the parameter settings of the evolutionary game model. The results show that the evolutionary game model will converge to a stable strategy point when the ratio of managers (teachers) and students’ initial participation in cultivation and management activities is set to (0.05, 0.95), (0.05, 0.05), (0.95, 0.05) or (0.95, 0.95). This study has a beneficial impact on cultivating exceptional talents, and it also provides a solid resource for society to deliver top-notch talent.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2284299299", "name": "Xiaolan Yang"}, {"authorId": "2284301759", "name": "Xinyong Zeng"}], "citations": []}
