{"paperId": "3414d38cbfe6649bf6210015e61bcf4ee04bdac2", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Multimedia Drama Imaging Technology Based on Big Data Information System", "abstract": "Opera is a unique comprehensive stage art form in China. As a traditional Chinese drama style, it is known as the three ancient drama cultures in the world together with the tragicomedy of ancient Greece and the Sanskrit drama of India. However, in the trend of the new era, Chinese opera is facing a severe existential crisis. How to innovate the opera and make people fall in love with the opera again is a problem worthy of research and analysis at present. This study takes the research of multimedia opera image technology as the object, aims to improve the perception and experience of opera, and studies how to use modern technology to improve opera image. First, this study briefly expounds on the presentation methods and current situation of traditional opera video technology. This study then describes in detail the imaging technology that combines opera and modern technology and then establishes the algorithm model of virtual reality imaging technology. And it then describes in detail the video technology that combines Chinese opera with multimedia technologies such as projection and virtual reality interaction. It then established a virtual reality technology algorithm model for opera images. This study then experiments, analyzes, and improves the multimedia opera video technology based on virtual reality. Finally, by means of a questionnaire survey, it investigates and analyzes the viewing attitude of opera images based on virtual reality technology. Through the research of virtual reality image technology and the investigation of citizens, this study obtains the methods and models to improve traditional opera images and effectively innovates opera. In a survey of citizens, it was found that nearly 70% of the respondents held a positive and optimistic attitude toward the virtual reality-based opera video technology, indicating that people are willing to accept the combination of traditional culture and modern technology. In the element loss detection experiment, it was found that nearly 70% of the interviewees were very interested in the method of combining traditional opera with modern technology. The model of virtual opera scene construction was improved so that the element loss rate was lower than 4%. The element representation delay is less than 3%, which improves the smoothness of the picture and maintains a good viewing experience.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-31", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2085129", "name": "N. Li"}], "citations": []}
