{"paperId": "34364096f61cfa518403dffe6456d4c1d52f1820", "publicationVenue": null, "title": "A Novel Machine Learning Approach Chronic Kidney Disease Prediction", "abstract": "Chronic renal disease (CRD), also known as chronic kidney disease, is affecting an ever-increasing number of people. This trend is expected to continue (CKD). The majority of people get concerned about their health when they first notice symptoms, but when they become concerned, they are more likely to take action. Because the life expectancy of a person without a kidney is just approximately 18 days on average, people are increasingly turning to dialysis and kidney transplants to extend their lives. Because of its lack of indicators, or even total absence of symptoms in some cases, chronic kidney disease (CKD) is notoriously difficult to detect and treat in its early stages. Learning by machine is now the most accurate way for diagnosing and forecasting these conditions, which offers some reason for optimism towards the future. The use of machine learning algorithms is quite effective in forecasting the start of chronic kidney disease (CKD). Using data from Decision Trees, SVMs, KNN, Random Forest, and other machine learning methods, along with 400 patient samples from CKD patients. This study suggests a method for determining a patient's likelihood of developing chronic kidney disease by analysing the patient's health records. The process begins with the preparation of the data, followed by the identification of a method for dealing with missing values, collaborative filtering, and attribute selection. Random forests, decision trees, and K-Nearest Neighbor classifiers all came out on top in terms of accuracy and bias when compared to the other machine learning strategies that were investigated in this study [11]. For the purpose of ensuring that machine learning can effectively detect the existence of chronic kidney disease, this study also includes the inclusion of more practical components such as data gathering and domain expertise.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "887-892"}, "authors": [{"authorId": "2288222867", "name": "Y. David"}, {"authorId": "2285145125", "name": "Solomon Raju"}, {"authorId": "2288226927", "name": "Dr. R. Michaelraj"}, {"authorId": "2288230528", "name": "Shyamala Murthy"}, {"authorId": "2288202726", "name": "Dr. Rajeev Agrawal"}, {"authorId": "2288229756", "name": "Dr. Ghanshyam Vatsa"}, {"authorId": "2066733351", "name": "Abhishek Joshi"}], "citations": [{"paperId": "630ed6cdb365b8f4af581e0cb61139637004e463", "title": "Comorbidity Diseases Diagnosis Using Machine Learning Methods and Chi-Square Feature Selection Technique"}, {"paperId": "bfde9461045e70adf3617737b1594bccb8782f14", "title": "An Intelligent Diagnostic System to Analyze Early-Stage Chronic Kidney Disease for Clinical Application"}, {"paperId": "5a14db04cd3237995a86033d90445c6a91c4a25e", "title": "State-of-Art Facial Monitoring: A Machine Learning Perspective"}]}
