{"paperId": "343edd4e7120f36bb0bcad72a09ba963258d426a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Chameleons on Cloudlets: Elastic Edge Computing Through Microservice Variants", "abstract": "Common deployment models for Edge Computing are based on (composable) microservices that are offloaded to cloudlets. Runtime adaptations-in response to varying load, QoS fulfillment, mobility, etc.-are typically based on coarse-grained and costly management operations such as resource re-allocation or migration. The services themselves, however, remain non-adaptive, worsening the already limited elasticity of Edge Computing compared to Cloud Computing. Edge computing applications often have stringent requirements on the execution time but are flexible regarding the quality of a computation. The potential benefits of exploiting this trade-off remain untapped. This paper introduces the concept of adaptable microservices that provide alternative variants of specific functionalities. We define so-called service variants that differ w.r.t. the internal functioning of the service, manifested in different algorithms, parameters, and auxiliary data they use. Such variants allow fine-grained trade-offs between the QoS (e.g., a maximum tolerable execution time) and the quality of the computation. We integrate adaptable microservices into an Edge Computing framework, show the practical impact of service variants, and present a strategy for switching variants at runtime.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-19", "journal": {"name": "ArXiv", "volume": "abs/2105.10355"}, "authors": [{"authorId": "2148444", "name": "Julien Gedeon"}, {"authorId": "2103388960", "name": "Martin Wagner"}, {"authorId": "2051652429", "name": "Karolis Skaisgiris"}, {"authorId": "2268676", "name": "Florian Brandherm"}, {"authorId": "50874971", "name": "Max Mühlhäuser"}], "citations": [{"paperId": "0a887edc92e55d5187332c5a52404f0d305f5505", "title": "Towards Elasticity in Heterogeneous Edge-dense Environments"}]}
