{"paperId": "344375c97dbc95c2b23f6516912e1eb823df5072", "publicationVenue": {"id": "6ac6be0f-c9a2-4eb8-b98e-4f2456955f94", "name": "Security and Privacy", "alternate_names": ["Secur Priv"], "issn": "2475-6725", "url": "https://onlinelibrary.wiley.com/journal/24756725"}, "title": "Toward the internet of things forensics: A data analytics perspective", "abstract": "The widespread use of networked, intelligent, and adaptable devices in various domains, such as smart cities and home automation, climate control, manufacturing and logistics, healthcare, education, and agriculture, has been hastened by recent developments in hardware and software technologies. In all these application domains, the concept of the Internet of Things helps to achieve process automation and decrease labor costs. While IoT has been an established domain for quite a while, it has seen a lot of advances and challenges in different subdomains over the years. One such subdomain is IoT Forensics which involves digital forensics concerning IoT devices, networks, or clouds. In this process of obtaining substantial evidence from the devices, networks, or cloud, a large amount of data and operations on said data are involved. Hence, looking through IoT Forensics through the methodology dealing with data, known as data analytics, is essential. This paper presents an interpretation of IoT Forensics from the standpoint of data analytics. To explain the same in detail, the paper focuses on IoT Forensics, its methodologies, and how they relate to data analytics stages. Toward the end, the paper discusses current developments in IoT Forensics from the data analytics perspective, limitations observed in the existing technologies, adoption challenges, and possible future advancements.", "venue": "Security and Privacy", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-05", "journal": {"name": "Security and Privacy", "volume": "6"}, "authors": [{"authorId": "2824330", "name": "Pimal Khanpara"}, {"authorId": "2155689701", "name": "Ishwa Shah"}, {"authorId": "49252696", "name": "S. Tanwar"}, {"authorId": "120558823", "name": "Amit Verma"}, {"authorId": "2151298698", "name": "Ravi Sharma"}], "citations": [{"paperId": "fee9da6581f1e5d22bad1dc80578dc57b4158ecf", "title": "Research on Digital Forensics Analyzing Heterogeneous Internet of Things Incident Investigations"}]}
