{"paperId": "3445501ac762c95a8cb126f42832ed4ab9dec221", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Mobility-Aware Fog Computing in Dynamic Environments: Understandings and Implementation", "abstract": "Fog computing is an epitome to enable provisioning resources and services beyond the cloud, at the edge of the network, and nearer to end devices. Fog computing is not a counterfeit for cloud computing but a persuasive counterpart. However, the mobility of end users and/or fog nodes brings a major dilemma in the implementation of real-life scenarios. Therefore, we deliver the state-of-the-art research about mobility in fog computing. By identifying the mobility problems, requirements, and features of different proposals, we discover the open problems from subsisting studies and summarize the advantages of mobility for readers. This will help the researchers and developers avoid the current misapprehensions and capture the real-life scenarios, such as business, government, and education institutions. In spite of the extensive state-of-the-art research work, we also present the diverse mobility factors to investigate the correlation between dynamic nodes with fog nodes in order to accomplish better successful tasks. We conceive that the investigations of mobility factors in the fog computing will furnish the novel perspective on not only dynamic connections but also network dynamics. To revolutionize the follow-up research, we distinguish and foreground futurity directions concerning real-life scenarios of people and vehicles in a dynamic fog environment.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "38867-38879", "volume": "7"}, "authors": [{"authorId": "143940570", "name": "M. Waqas"}, {"authorId": "2056578130", "name": "Yong Niu"}, {"authorId": "1710153599", "name": "Manzoor Ahmed"}, {"authorId": "39948674", "name": "Yong Li"}, {"authorId": "49953590", "name": "Depeng Jin"}, {"authorId": "145169163", "name": "Zhu Han"}], "citations": [{"paperId": "6f046ebd9ea8fdf50f8c4814ea4a9cdd181b6196", "title": "A Many-Objective Ensemble Optimization Algorithm for the Edge Cloud Resource Scheduling Problem"}, {"paperId": "085164f11325303f8184b612bfdb96b08ee8a91c", "title": "An Analysis of Methods and Metrics for Task Scheduling in Fog Computing"}, {"paperId": "fc30e163a040c57378b37df5cade3c5b412abe49", "title": "FedCD: A Hybrid Centralized-Decentralized Architecture for Efficient Federated Learning"}, {"paperId": "2b092ead85738654ff0b5eb3885c22d081345461", "title": "Industry 4.0 and industrial workflow scheduling: A survey"}, {"paperId": "628533a3d647d57d7aee839e2764ec1fc645534c", "title": "Network Intrusion Detection System (NIDS) Based on Pseudo-Siamese Stacked Autoencoders in Fog Computing"}, {"paperId": "0610bb46b72425baca8ed2b13c0a04f072af6d33", "title": "Cyberattacks and Security of Cloud Computing: A Complete Guideline"}, {"paperId": "4ae0612de9511e332fbfeb395a3980710c0190ae", "title": "An Enhancement Algorithm for Mobility over Fog Computing"}, {"paperId": "36d93586d3054b2590e068262f880e9d107d86fc", "title": "Accelerating Decentralized Federated Learning in Heterogeneous Edge Computing"}, {"paperId": "aa2952ade3d8b7b2cd5d4ccf0432749b8f314b3a", "title": "Secure Internet of Vehicles (IoV) With Decentralized Consensus Blockchain Mechanism"}, {"paperId": "f5a96e28ad07316863b78c34e1f71c7926478d37", "title": "Centralized and Collaborative RL-Based Resource Allocation in Virtualized Dynamic Fog Computing"}, {"paperId": "aa71c865c987fb97b9edaf6fe61bc5c3f8ee6878", "title": "Distance Vector and Prominent Reliable Path Selection based Stochastic Routing in Distributed Internet of Things"}, {"paperId": "7ae7de7e5e76a066c24f0d96bcd8573f943eae98", "title": "Cloud-based Smart Parking System using Internet of Things"}, {"paperId": "b4a45fd038715e522ad33cbf1d119f4130cb7c43", "title": "A decade of research in fog computing: Relevance, challenges, and future directions"}, {"paperId": "ba5c0a2b6dcea40c709403439fc9a283cb2b2678", "title": "Mobility and Security Aware Real-Time Task Scheduling in Fog-Cloud Computing for IoT Devices: A Fuzzy-Logic Approach"}, {"paperId": "b490004837fcf8e22de2e54db5ca89f7e57fa680", "title": "A computational offloading optimization scheme based on deep reinforcement learning in perceptual network"}, {"paperId": "d5b69c8d1777f7a8642d1ead11f011d411c0012e", "title": "Decentralized Federated Learning with Data Feature Transmission and Neighbor Selection"}, {"paperId": "1d6e29f09855ceef40bc5b601232cf382a2c25e5", "title": "On the Design of an Algorithm for Mobility Management Over Fog Geographical Allocation for Healthcare Applications"}, {"paperId": "bf9d7ddb23300c50d0c8e6c24c76c10f2e98d4f1", "title": "Mobility-aware Task Offloading in Fog-Assisted Networks"}, {"paperId": "7137fee61050d060b55690bb9c04e62d6cbf4264", "title": "Defense scheme against advanced persistent threats in mobile fog computing security"}, {"paperId": "d3f49040bfd93377645f7e0c79a856cbe8c17738", "title": "Decentralized Consensus Blockchain-Based Authentication Algorithm Using in Secure Internet of Vehicles"}, {"paperId": "0916eac5fff5c4188b9c43a3114d4615b4f091dd", "title": "Edge–Fog–Cloud Computing Hierarchy for Improving Performance and Security of NB-IoT-Based Health Monitoring Systems"}, {"paperId": "7db313144391fce934accfcd9201f6808625165a", "title": "Homa: Online In-Flight Service Provisioning With Dynamic Bipartite Matching"}, {"paperId": "4dea3b773a82b00bc758701f0e3da62ce7b5a85b", "title": "Computation Offloading in Mobile Cloud Computing and Mobile Edge Computing: Survey, Taxonomy, and Open Issues"}, {"paperId": "51ee4139af2f1755899a2a7bee17a5a0589cdd91", "title": "AI for Next Generation Computing: Emerging Trends and Future Directions"}, {"paperId": "53e2b0b95aa5bce5f2948369d11d36c33af05ad8", "title": "Resource Allocation and Task Scheduling in Fog Computing and Internet of Everything Environments: A Taxonomy, Review, and Future Directions"}, {"paperId": "7e6eddbde91111f2e9f82665f3e80df944616370", "title": "The role of artificial intelligence and machine learning in wireless networks security: principle, practice and challenges"}, {"paperId": "cf4d28ea9633da25bae3566f160ac46de88a767d", "title": "Smart Edge Computing for 5 g/6 g Satellite IOT for Reducing Inter Transmission Delay"}, {"paperId": "ad058d9af5f97180cdfe86690a8234a455cd5c09", "title": "A genetic-based approach for service placement in fog computing"}, {"paperId": "ff3b74c35dbb4ea1f4d8634fb7dbb315b6fc39e0", "title": "A revocable and outsourced multi-authority attribute-based encryption scheme in fog computing"}, {"paperId": "410e687cdeb3fd9bf5199126da93bdae0522ef4b", "title": "Modelling a Folded N-Hypercube Topology for Migration in Fog Computing"}, {"paperId": "75a2cc81f558a197f83f042f0f4cde962dce4540", "title": "Applying Multidimensional Geometry to Basic Data Centre Designs"}, {"paperId": "13e98540982ca10e72d354e0faab441249ec03b3", "title": "A systematic review on task scheduling in Fog computing: Taxonomy, tools, challenges, and future directions"}, {"paperId": "61072e819cfb13bda06e47b2f7a21f8f495d508f", "title": "Adaptive Batch Size for Federated Learning in Resource-Constrained Edge Computing"}, {"paperId": "3024e643e7a67014bd5ed4e7d89b82591dbc1c34", "title": "A survey on computation offloading modeling for edge computing"}, {"paperId": "21a5f274383f3068bc9d622a2973234feefffab7", "title": "Towards FoT (Fog-of-Things) enabled Architecture in Governance: Transforming e-Governance to Smart Governance"}, {"paperId": "021bd2d227dddaac66945528dc43b1c053c40272", "title": "Intelligent Resource Allocation in Dynamic Fog Computing Environments"}, {"paperId": "7c6a3fb7f7e63dcd831e30be657f1a796426920c", "title": "Joint Container Placement and Task Provisioning in Dynamic Fog Computing"}, {"paperId": "8caf06cbcf4d56ae75facdded1f001a5f676aa87", "title": "Performance Analysis of Task Offloading With Opportunistic Fog Nodes"}, {"paperId": "f460f3e7c30bb3c0e42ae5d0feae1324d6780161", "title": "An Overview of Fog Computing"}, {"paperId": "dc61135ce73e8596008dee0ecbffac204b9977aa", "title": "A Review on Green Caching Strategies for Next Generation Communication Networks"}, {"paperId": "14cbb19aebec6f46992299a1990373b746482976", "title": "Mobility-Aware Service Placement for Vehicular Users in Edge-Cloud Environment"}, {"paperId": "71592577cd5a5f6bf1987398b2ec2a4c62274cf7", "title": "Authentication of Vehicles and Road Side Units in Intelligent Transportation System"}, {"paperId": "4b8e8a47b27e929be0452a918640217701db7f59", "title": "Arithmetic study about energy save in switches for some data centre topologies"}]}
