{"paperId": "345c14dc6ba113f0705b537589da001a8a5c090e", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Traffic Anomaly Prediction Based on Joint Static-Dynamic Spatio-Temporal Evolutionary Learning", "abstract": "Accurate traffic anomaly prediction offers an opportunity to save the wounded at the right location in time. However, the complex process of traffic anomaly is affected by both various static factors and dynamic interactions. The recent evolving representation learning provides a new possibility to understand this complicated process, but with challenges of imbalanced data distribution and heterogeneity of features. To tackle these problems, this paper proposes a spatio-temporal evolution model named SNIPERfor learning intricate feature interactions to predict traffic anomalies. Specifically, we design spatio-temporal encoders to transform spatio-temporal information into vector space indicating their natural relationship. Then, we propose a temporally dynamical evolving embedding method to pay more attention to rare traffic anomalies and develop an effective attention-based multiple graph convolutional network to formulate the spatially mutual influence from three different perspectives. The FC-LSTM is adopted to aggregate the heterogeneous features considering the spatio-temporal influences. Finally, a loss function is designed to overcome the ’over-smoothing’ and solve the imbalanced data problem. Extensive experiments show that SNIPER averagely outperforms state-of-the-arts by 3.9%, 0.9%, 1.9% and 1.6% on Chicago datasets, and 2.4%, 0.6%, 2.6% and 1.3% on New York City datasets in metrics of AUC-PR, AUC-ROC, F1 score, and accuracy, respectively.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "5356-5370", "volume": "35"}, "authors": [{"authorId": "40134592", "name": "Xiaoming Liu"}, {"authorId": "2156120236", "name": "Zhanwei Zhang"}, {"authorId": "145225199", "name": "Lingjuan Lyu"}, {"authorId": "2156119744", "name": "Zhaohan Zhang"}, {"authorId": "2114810399", "name": "Shuai Xiao"}, {"authorId": "2154740036", "name": "Chao Shen"}, {"authorId": "2149668064", "name": "P. Yu"}], "citations": [{"paperId": "7d9193df7f42917cadf85048345769b8a9322819", "title": "Data-unbalanced traffic accident prediction via adaptive graph and self-supervised learning"}, {"paperId": "73d0854f601fa205a1a58381a15b020dd45ebbaa", "title": "Graph autoencoder with mirror temporal convolutional networks for traffic anomaly detection"}, {"paperId": "84ad920e7232c0b16246a24160c5342f049dd9e9", "title": "Generative Causal Interpretation Model for Spatio-Temporal Representation Learning"}, {"paperId": "ea0da5577d3b1dfc544d6668963fe6ca5051bd64", "title": "Locating X-Ray Coronary Angiogram Keyframes via Long Short-Term Spatiotemporal Attention With Image-to-Patch Contrastive Learning"}, {"paperId": "31f5bf4b3e9d85cb9e23c1f4456d047a8076270c", "title": "Spatiotemporal-Augmented Graph Neural Networks for Human Mobility Simulation"}, {"paperId": "cf1bc779a5d486e84e83eec23697696f015882e4", "title": "A deep spatiotemporal approach in maritime accident prediction: A case study of the territorial sea of South Korea"}, {"paperId": "f93051a9c6d39305acd42b4ad29baf1f522e47ae", "title": "Unify Local and Global Information for Top-N Recommendation"}]}
