{"paperId": "346dc80571d13880a87bbf341577d6eb83414911", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Security and Privacy in IoT Using Machine Learning and Blockchain", "abstract": "Security and privacy of users have become significant concerns due to the involvement of the Internet of Things (IoT) devices in numerous applications. Cyber threats are growing at an explosive pace making the existing security and privacy measures inadequate. Hence, everyone on the Internet is a product for hackers. Consequently, Machine Learning (ML) algorithms are used to produce accurate outputs from large complex databases, where the generated outputs can be used to predict and detect vulnerabilities in IoT-based systems. Furthermore, Blockchain (BC) techniques are becoming popular in modern IoT applications to solve security and privacy issues. Several studies have been conducted on either ML algorithms or BC techniques. However, these studies target either security or privacy issues using ML algorithms or BC techniques, thus posing a need for a combined survey on efforts made in recent years addressing both security and privacy issues using ML algorithms and BC techniques. In this article, we provide a summary of research efforts made in the past few years, from 2008 to 2019, addressing security and privacy issues using ML algorithms and BC techniques in the IoT domain. First, we discuss and categorize various security and privacy threats reported in the past 12 years in the IoT domain. We then classify the literature on security and privacy efforts based on ML algorithms and BC techniques in the IoT domain. Finally, we identify and illuminate several challenges and future research directions using ML algorithms and BC techniques to address security and privacy issues in the IoT domain.", "venue": "ACM Computing Surveys", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-06", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 37", "volume": "53"}, "authors": [{"authorId": "21232829", "name": "Nazar Waheed"}, {"authorId": "2240825626", "name": "Xiangjian He"}, {"authorId": "2240741704", "name": "Muhammad Ikram"}, {"authorId": "2240742096", "name": "Muhammad Usman"}, {"authorId": "2805924", "name": "S. S. Hashmi"}, {"authorId": "2240742096", "name": "Muhammad Usman"}], "citations": [{"paperId": "6515d74227f50cc4904f99eebeca51c9f9db97ba", "title": "Blockchain-enabled Smart Contracts and the Internet of Things: Advancing the research agenda through a narrative review"}, {"paperId": "a4a970174664be38ccf2fe75a810e62e424eda14", "title": "Factors Affecting Trust and Acceptance for Blockchain Adoption in Digital Payment Systems: A Systematic Review"}, {"paperId": "fbb7a7719b9b4efd6158c30a24520f28680c7af2", "title": "IoT-enabled smart cities: a hybrid systematic analysis of key research areas, challenges, and recommendations for future direction"}, {"paperId": "f313c0c84df7b478a30ec9c440edaddbb1e8859e", "title": "Machine Learning and Blockchain: A Bibliometric Study on Security and Privacy"}, {"paperId": "37a6801938b918dcc62012ba863a7f5088d4ccea", "title": "Intelligent Machine Learning Based Internet of Things (IoT) Resource Allocation"}, {"paperId": "8cf9e586d951f9a83299fc2ad740d5819fa3c1ca", "title": "Formal Methods and Validation Techniques for Ensuring Automotive Systems Security"}, {"paperId": "93c2974cd5fa7b4b3f29b77fd8e404e2c5f6f2cd", "title": "Significance of Secure Internet of Things Device Certification – An Authentication Perspective"}, {"paperId": "2d49a48ef53202b8334e47885545d78bd7e9c6db", "title": "BlockFaaS: Blockchain-enabled Serverless Computing Framework for AI-driven IoT Healthcare Applications"}, {"paperId": "f81d87e6186e6d99e56fcbbb708dca20deb3b7b8", "title": "An IoHT System Utilizing Smart Contracts for Machine Learning -Based Authentication"}, {"paperId": "22786bd2da2cd5eae10c39ec7856774690518feb", "title": "IDS in IoT using Machine ‎Learning and Blockchain"}, {"paperId": "8465f5e9ce41f9dc170cb34919c67be0c51d8cbf", "title": "Blockchain and Machine Learning Security for the Internet of Things: A Bibliometric Analysis"}, {"paperId": "9fa803bf4211a66c7e588b962be562725a524983", "title": "Securing Wireless Sensor Networks Using Machine Learning and Blockchain: A Review"}, {"paperId": "33b07df2699ed83ab576727d61d447d0a6f62f64", "title": "Models used to characterise blockchain features. A systematic literature review and bibliometric analysis"}, {"paperId": "e0aa84fcd93066f71485995cac4d6ebd9e6e5557", "title": "Machine learning in cloud-based trust modeling in M-health application using classification with image encryption"}, {"paperId": "c302de6b55b4a9c019a1bee27c9955f893e37c18", "title": "A Systematic Review of Data Quality in CPS and IoT for Industry 4.0"}, {"paperId": "50e111f895b3b059f927efb0cb917edeb3eadad2", "title": "A Survey of Machine and Deep Learning Methods for Privacy Protection in the Internet of Things"}, {"paperId": "b6d4ef869109c782e9560e6438730907171e553f", "title": "Blockchain based Sensor System Design For Embedded IoT"}, {"paperId": "b4a0d33e12e08c53d2d64dd614739aa46bfc7a8f", "title": "Intrusion Detection Model for IoT Using Recurrent Kernel Convolutional Neural Network"}, {"paperId": "4148bd4e1c566ad4fd1f45f23cd82202e54276f7", "title": "A Review of Emerging Technologies for IoT-Based Smart Cities"}, {"paperId": "5969ed4bae11309a8ca6d0b5eab21e8598db3ed5", "title": "Group intrusion detection in the Internet of Things using a hybrid recurrent neural network"}, {"paperId": "970548fc46f7417f26b0d764a647ff2d908aaf3d", "title": "Differentially Private XGBoost Algorithm for Traceability of Rice Varieties"}, {"paperId": "98f88a4d88b5908afa86db52206350aa30c124e6", "title": "Jaccard Index Cat Gradient Boosting Classification for Secured Big Data Communication"}, {"paperId": "31f42be573c81bf17f4db1bf33a314c1dd60dfd0", "title": "Blockchain-Based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}, {"paperId": "b0c1e30e7b82a4bdc4cb85786a8b61d1a26fd36e", "title": "On the ICN-IoT with federated learning integration of communication: Concepts, security-privacy issues, applications, and future perspectives"}, {"paperId": "bf98aaa197f04dda34b5611a374fadf41cb16d0a", "title": "Chain or DAG? Underlying data structures, architectures, topologies and consensus in distributed ledger technology: A review, taxonomy and research issues"}, {"paperId": "23568a5b7e46da37679e56abe15f9eecb498d5e9", "title": "On the use of artificial intelligence to deal with privacy in IoT systems: A systematic literature review"}, {"paperId": "159d614fbf90878025e3131b9e396693065d8ff0", "title": "Adrestus: Secure, scalable blockchain technology in a decentralized ledger via zones"}, {"paperId": "6276f91e770735811e8405c56aca24a480a521b6", "title": "A Prediction of Flight Fare Using K-Nearest Neighbors"}, {"paperId": "0c37967717503f199cd34690e807fc19c8011d0f", "title": "Countering Active Attacks on RAFT-Based IoT Blockchain Networks"}, {"paperId": "b1f67e626978b5f6d865e4c0fbdb5cd0efd8a5ac", "title": "A Lightweight Scalable and Secure Blockchain Based IoT Using Fuzzy Logic"}, {"paperId": "41e0737402fff56e1dd8ce9a946e1aac32e93081", "title": "Threat Analysis and Distributed Denial of Service (DDoS) Attack Recognition in the Internet of Things (IoT)"}, {"paperId": "96ad789606a4d0e73aaa41b1b245573637b441ed", "title": "Internet of Things (IoT): From awareness to continued use"}, {"paperId": "fd7d06f3c1e7185f6c67846e4bb09b7a7bcffa2e", "title": "Security and privacy of internet of medical things: A contemporary review in the age of surveillance, botnets, and adversarial ML"}, {"paperId": "4ed7f27bfeee67aae2c4b2c3d6063a0d52702439", "title": "Machine learning and the Internet of Things security: Solutions and open challenges"}, {"paperId": "3c89654cfecf806d8258dc0adff31d9d4acbe37c", "title": "A Survey on the Applications of Blockchains in Security of IoT Systems"}, {"paperId": "ed5fb5e4adfcd20edb98274decd6a7730903cda3", "title": "IoT network security using autoencoder deep neural network and channel access algorithm"}, {"paperId": "357246f66df110b67adee136037905a446e01ffd", "title": "Federated Learning for Privacy-Preserving Internet of Things"}, {"paperId": "9ef394cd64fbc7168bbd32e1da8cc6adb44edf45", "title": "A survey on deep learning for challenged networks: Applications and trends"}, {"paperId": "f86012e7edeecf311e4fbb5b63caed687456fa3c", "title": "IoT-based Access Management Supported by AI and Blockchains"}, {"paperId": "382f7856d5ad4dde3f1265af8637ac3678a1ee77", "title": "Overview of Information Hiding Algorithms for Ensuring Security in IoT Based Cyber-Physical Systems"}, {"paperId": "660c2cf3e8700c8dcd02e8e39db8e2a078db7f2a", "title": "A Survey on Modern Cloud Computing Security over Smart City Networks: Threats, Vulnerabilities, Consequences, Countermeasures, and Challenges"}, {"paperId": "be9790eacbad9678496791d9022c2e1890e81bd5", "title": "Deep Residual Dense Network for Single Image Super-Resolution"}, {"paperId": "6189bda32ca48252241f46be8b8609f92ee5efdb", "title": "Next-generation Blockchain-Enabled Virtualized Cloud Security Solutions: Review and Open Challenges"}, {"paperId": "29e6b12d3c6cd55e04bdfb9c22201f99578f4080", "title": "Federated Learning for Internet of Things: Recent Advances, Taxonomy, and Open Challenges"}, {"paperId": "0471f5af8c47ca7bce39d889ea811f951e40101a", "title": "Remote Data Security Monitoring Technology for Computer Networks Based on Machine Learning Algorithms"}, {"paperId": "b24d7a0afb252fdf8451de53504c03e6f42c627d", "title": "Blockchain-based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}, {"paperId": "7011da911a8042abc12a503bc04eb642a45a027a", "title": "Overcoming Iot Security Challenges Using Machine Learning"}, {"paperId": "f7625dfbcd5f7fdaae449150703cad220c8a82f8", "title": "Privacy and Security Challenges and Opportunities for IoT Technologies During and Beyond COVID-19"}, {"paperId": "2eea99618e78a3262fd0fffcd83a34da1cc0f684", "title": "Evaluation of Kernel-Level IoT Security and QoS Aware Models from an Empirical Perspective"}]}
