{"paperId": "347062e8f28b1c0d5441cac2c52ad5ecac38a8fb", "publicationVenue": null, "title": "Cloud-based big data analytics platform using algorithm templates for the manufacturing industry", "abstract": "ABSTRACT Specialised knowledge on analytics algorithms is necessary to conduct a data analysis; thus, there are limits to how a manufacturing manager who is not a data analysis expert conducts analysis tasks. This study proposed a manufacturing-specialised data analytics algorithm template and a cloud-based big data analytics platform to resolve such a problem and to enable those not specialising in data analysis to perform analysis tasks. The manufacturing-specialised data analytics algorithm template is a concept in which data characteristics are considered according to manufacturing problems to systematically provide the pre-processing, data mining, and visualisation algorithms required for conducting analysis tasks. A cloud-based big data analytics platform is designed to use algorithm templates for analysis and is capable of not only storing and managing data per company but also creating analysis models and confirming results. The platform consists of the following: inter-connected middleware, data storage, a batch manager, a data analytics modeller, and an analysis engine. This study applied the proposed manufacturing-specialised data analytics algorithm template and cloud-based big data analytics platform to the machine problem-solving process executed by mobile phone component production companies. It also sought study limitations and offered development plans for future research.", "venue": "International journal of computer integrated manufacturing (Print)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "International Journal of Computer Integrated Manufacturing", "pages": "723 - 738", "volume": "32"}, "authors": [{"authorId": "72606352", "name": "Chanmo Jun"}, {"authorId": "2108511858", "name": "J. Y. Lee"}, {"authorId": "73098095", "name": "B. Kim"}], "citations": [{"paperId": "8984e15ea028c0bdd0131ad19d165a7cc822b9f5", "title": "Top ten intelligent algorithms towards smart manufacturing"}, {"paperId": "a4250878c4b87e74d8042355894dfd31c1816bf5", "title": "Towards Developing Big Data Analytics for Machining Decision-Making"}, {"paperId": "1bb7d08cb37ac377810b8db34e4d34c1d88da33b", "title": "System construction for comprehensive industrial ecosystem oriented networked collaborative manufacturing platform (NCMP) based on three chains"}, {"paperId": "cb87eca186cd343222fcfe75b373b2cc88f8e777", "title": "Dynamic Distributed and Parallel Machine Learning algorithms for big data mining processing"}, {"paperId": "d169bed5ba74fd938361b6421a0de535b53f1b7a", "title": "Research on parallel distributed clustering algorithm applied to cutting parameter optimization"}, {"paperId": "72a2e6a495bdb2a4d59c7a3c13754367dd2d0329", "title": "A smart reporting framework as an application of multi-agent system in machining industry"}, {"paperId": "615e793623a206cd60a10439cdedcd16e0a3a278", "title": "An evaluation model for Cloud-based Data mining Systems with Hadoop"}, {"paperId": "c707fd6f6b1d4b121c77d17ced76d26c42471792", "title": "Trends of Digital Transformation in the Shipbuilding Sector"}, {"paperId": "119d528bef1545738fe455fe570f877cdf6d44c5", "title": "Advancing manufacturing systems with big-data analytics: A conceptual framework"}, {"paperId": "8e231b3a68c4fbace5635fc17b7e15f05b36ef20", "title": "Big Data Analysis as a Digital Service: Evidence Form Manufacturing Firms"}]}
