{"paperId": "347608eca1d00bacf0d7b24bdd5660ed1baaa342", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "s2p: Provenance Research for Stream Processing System", "abstract": "The main purpose of our provenance research for DSP (distributed stream processing) systems is to analyze abnormal results. Provenance for these systems is not nontrivial because of the ephemerality of stream data and instant data processing mode in modern DSP systems. Challenges include but are not limited to an optimization solution for avoiding excessive runtime overhead, reducing provenance-related data storage, and providing it in an easy-to-use fashion. Without any prior knowledge about which kinds of data may finally lead to the abnormal, we have to track all transformations in detail, which potentially causes hard system burden. This paper proposes s2p (Stream Process Provenance), which mainly consists of online provenance and offline provenance, to provide fine- and coarse-grained provenance in different precision. We base our design of s2p on the fact that, for a mature online DSP system, the abnormal results are rare, and the results that require a detailed analysis are even rarer. We also consider state transition in our provenance explanation. We implement s2p on Apache Flink named as s2p-flink and conduct three experiments to evaluate its scalability, efficiency, and overhead from end-to-end cost, throughput, and space overhead. Our evaluation shows that s2p-flink incurs a 13% to 32% cost overhead, 11% to 24% decline in throughput, and few additional space costs in the online provenance phase. Experiments also demonstrates the s2p-flink can scale well. A case study is presented to demonstrate the feasibility of the whole s2p solution.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2021-06-15", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "50540163", "name": "Qian Ye"}, {"authorId": "2225478", "name": "Minyan Lu"}], "citations": [{"paperId": "780c0629ede0e173f3d885e76ac81f446b75c7da", "title": "Big social data provenance framework for Zero-Information Loss Key-Value Pair (KVP) Database"}, {"paperId": "a73256c9c192344902d27248d29c0efec243518c", "title": "SPOT: Testing Stream Processing Programs with Symbolic Execution and Stream Synthesizing"}]}
