{"paperId": "3477ac98892f4507bdc2dd80829e85e950028763", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "On Regularity Lemma and Barriers in Streaming and Dynamic Matching", "abstract": "We present a new approach for finding matchings in dense graphs by building on Szemerédi’s celebrated Regularity Lemma. This allows us to obtain non-trivial albeit slight improvements over longstanding bounds for matchings in streaming and dynamic graphs. In particular, we establish the following results for n-vertex graphs: A deterministic single-pass streaming algorithm that finds a (1−o(1))-approximate matching in o(n2) bits of space. This constitutes the first single-pass algorithm for this problem in sublinear space that improves over the 1/2-approximation of the greedy algorithm. A randomized fully dynamic algorithm that with high probability maintains a (1−o(1))-approximate matching in o(n) worst-case update time per each edge insertion or deletion. The algorithm works even against an adaptive adversary. This is the first o(n) update-time dynamic algorithm with approximation guarantee arbitrarily close to one. Given the use of regularity lemma, the improvement obtained by our algorithms over trivial bounds is only by some (log* n)Θ(1) factor. Nevertheless, in each case, they show that the “right” answer to the problem is not what is dictated by the previous bounds. Finally, in the streaming model, we also present a randomized (1−o(1))-approximation algorithm whose space can be upper bounded by the density of certain Ruzsa-Szemerédi (RS) graphs. While RS graphs by now have been used extensively to prove streaming lower bounds, ours is the first to use them as an upper bound tool for desigining improved streaming algorithms.", "venue": "Symposium on the Theory of Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-07-19", "journal": {"name": "Proceedings of the 55th Annual ACM Symposium on Theory of Computing"}, "authors": [{"authorId": "35067898", "name": "Sepehr Assadi"}, {"authorId": "8176576", "name": "Soheil Behnezhad"}, {"authorId": "144335444", "name": "S. Khanna"}, {"authorId": "3092681", "name": "Huan Li"}], "citations": [{"paperId": "becc37ec04b30a04573eb555fc43eead669ff574", "title": "On Approximate Fully-Dynamic Matching and Online Matrix-Vector Multiplication"}, {"paperId": "159d27f6fc10e0084fb491a2ca77b99acee15c6e", "title": "Dynamic (1+ϵ)-Approximate Matching Size in Truly Sublinear Update Time"}, {"paperId": "8fe9e029c082e7c0cc44159983b91c019fc36fc0", "title": "Hidden Permutations to the Rescue: Multi-Pass Streaming Lower Bounds for Approximate Matchings"}, {"paperId": "2cb253429839576df35839fbc381480444a41aed", "title": "Recent Advances in Multi-Pass Graph Streaming Lower Bounds"}, {"paperId": "4fae39d795cee728985409909e741602e3ae3a35", "title": "A Simple $(1-\\epsilon)$-Approximation Semi-Streaming Algorithm for Maximum (Weighted) Matching"}, {"paperId": "aac8d79b81db48eacbc9eab790df65d78ebc8ccd", "title": "Near-Optimal Dynamic Rounding of Fractional Matchings in Bipartite Graphs"}, {"paperId": "2fcd2dad5d9af04c31c4f7e77b062392f12ea1ec", "title": "Streaming Edge Coloring with Asymptotically Optimal Colors"}, {"paperId": "8d4075482754bb76cd7b3792ef6a443db3ab9720", "title": "Dynamic $(1+\\epsilon)$-Approximate Matching Size in Truly Sublinear Update Time"}, {"paperId": "30e90fe524783fb27157ada5ad1a72111f0c6d14", "title": "Dynamic Maxflow via Dynamic Interior Point Methods"}, {"paperId": "424f605f80124bbe058cd7e3f532ffa0afd7394b", "title": "Dynamic Algorithms for Maximum Matching Size"}, {"paperId": "78b444eb2cc2fa1e44424ba2b245972c539682ef", "title": "Maximum Matching sans Maximal Matching: A New Approach for Finding Maximum Matchings in the Data Stream Model"}]}
