{"paperId": "348b84277c5b6faef1cd3e7e9686c9898bee4bc8", "publicationVenue": {"id": "1a837836-21f5-48ef-98ae-6b40c9b5afc9", "name": "Journal of Global Information Management", "type": "journal", "alternate_names": ["J Glob Inf Manag"], "issn": "1062-7375", "url": "http://www.idea-group.com/journals/details.asp?id=99", "alternate_urls": ["https://www.igi-global.com/journal/journal-global-information-management-jgim/1070", "http://www.metapress.com/"]}, "title": "Multi-Label Naïve Bayes Classifier for Identification of Top Destination and Issues to Accost by Tourism Sector", "abstract": "This article describes how the tourism sector plays very important role in the social and economic growth of any country. Technologies like the internet and mobile technologies have changed the marketing strategy of the sector. It has been observed that business operators and the workforce employed in the tourism industry do not have sufficient knowledge, tools and/or strategy to implement technology correctly. Technology can be used in all the dimensions of tourism for gaining a competitive edge and providing a wide range of services to customers. For better customer satisfaction, the industry should know the major issues confronting tourism. Experiences shared by tourists on social media, i.e. Facebook, Twitter, Instagram and YouTube, can be used and analyzed to gain insight on customer needs. In this article, the authors propose a unified framework and have used tweets shared by tourists for the identification of major issues faced by tourism sectors. Identified issues are categorized into four main categories. The obtained results will help players of tourism sector for improving the services and growth of the sector.", "venue": "Journal of Global Information Management", "year": 2018, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-01", "journal": {"name": "J. Glob. Inf. Manag.", "pages": "37-53", "volume": "26"}, "authors": [{"authorId": "8524642", "name": "Sapna Sinha"}, {"authorId": "11818663", "name": "Vishal Bhatnagar"}, {"authorId": "1966681", "name": "Abhay Bansal"}], "citations": [{"paperId": "f811bc87cab351de86810384ab86f1ccd20bbb25", "title": "Smart City Construction and Management by Digital Twins and BIM Big Data in COVID-19 Scenario"}, {"paperId": "4486242b82919c523c20a011066d0e158cfce627", "title": "Smart recommendation for tourist hotels based on multidimensional information: a deep neural network model"}, {"paperId": "8067db54a533fcaa4ed367f8a87b3ef2e30d5f93", "title": "Predicting Diabetes Mellitus With Machine Learning Techniques Using Multi-Criteria Decision Making"}, {"paperId": "fe9a74d5929fe89a7d2623ab1b71e96aa9aca396", "title": "Analysis of SMOTE: Modified for Diverse Imbalanced Datasets Under the IoT Environment"}, {"paperId": "0057ee1280265de0bc9bf9d69126b6c384cfa2b0", "title": "The Evidence of the “No Free Lunch” Theorems and the Theory of Complexity in Business Artificial Intelligence"}, {"paperId": "0feda14253ae8741014e75cbf84e74a03269b00b", "title": "Hybrid Ensemble Learning With Feature Selection for Sentiment Classification in Social Media"}, {"paperId": "5b1e5d3f70746aebf329b723b22f35d28b297524", "title": "Scrutinize the Idea of Hadoop-Based Data Lake for Big Data Storage"}, {"paperId": "bf5b58bdce9634d0b82c604be56895ddf82ae3d3", "title": "INNOVATIVE ALTERNATIVES OF MARKETING COMMUNICATION AND SALES SUPPORT OF PRODUCTS AND SERVICES"}, {"paperId": "dccd782e7490638a8e8319e21a10d16aff09b40e", "title": "Sifting Through Hashtags on Twitter for Enterprising Tourism and Hospitality Using Big Data Environment"}]}
