{"paperId": "349033fd207089387a3e7f7060a6c52c6c4c64a5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Artificial Intelligence Application in Demand Response: Advantages, Issues, Status, and Challenges", "abstract": "In recent years, there has been a significant growth in demand response (DR) as a cost-effective technique of providing flexibility and, as a result, improving the dependability of energy systems. Although the tasks associated with demand side management (DSM) are extremely complex, the use of large-scale data and the frequent requirement for near-real-time decisions mean that Artificial Intelligence (AI) has recently emerged as a key technology for enabling DSM. Optimization algorithm methods can be used to address a variety of problems, including selecting the optimal set of consumers to respond to, learning their attributes and preferences, dynamic pricing, device scheduling, and control, as well as determining the most effective way to incentive and reward participants in DR schemes fairly and effectively. The implementation optimization algorithm needs proper selection to mitigate the cost of energy consumption. Due to that reason, this paper outlines various challenges and opportunities in developing, utilizing, controlling, and scheduling the DR scheme’s optimization algorithm. In addition, several issues in applications and advantages of optimization techniques in artificial intelligence approaches are discussed. The importance of implementing demand response mechanisms in developing countries is also presented. In addition, the status of demand response optimization in demand-side management solutions is also illustrated congruently.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "16907-16922", "volume": "11"}, "authors": [{"authorId": "2190030511", "name": "Amira Noor Farhanie Ali"}, {"authorId": "2753877", "name": "M. F. Sulaima"}, {"authorId": "41195709", "name": "I. Razak"}, {"authorId": "30814547", "name": "A. Kadir"}, {"authorId": "2117232", "name": "H. Mokhlis"}], "citations": [{"paperId": "1c5340af5372d91163eb26e639af7d2614faa394", "title": "Methods and attributes for customer-centric dynamic electricity tariff design: A review"}, {"paperId": "c0e4f2fd79099b6275923aae5405a57b25fb48f5", "title": "Recent Trends and Issues of Energy Management Systems Using Machine Learning"}, {"paperId": "d2f7cf1c2fa1832206d4ee8991c1b7134c5a571a", "title": "Optimizing Energy Consumption in Smart Homes: A Comprehensive Review of Demand Side Management Strategies"}, {"paperId": "e7cb95a4fa74a295a7cdbe2751f55eb8885a033c", "title": "Anime face recognition to create awareness"}, {"paperId": "b91e726595fa1c18c88f820f1c94d7423ceeb2cb", "title": "Hybridization Solution of Electrical Energy Demand Response and Forecasting Program by Using PSO-LSSVM Technique"}, {"paperId": "8029d0246a0ea6216c804a19ca3434b28d231183", "title": "Towards efficient human–machine interaction for home energy management with seasonal scheduling using deep fuzzy neural optimizer"}]}
