{"paperId": "3493104b05ea7721d862b3dc99b97f8678b80596", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Ad-Rec: Advanced Feature Interactions to Address Covariate-Shifts in Recommendation Networks", "abstract": "Recommendation models are vital in delivering personalized user experiences by leveraging the correlation between multiple input features. However, deep learning-based recommendation models often face challenges due to evolving user behaviour and item features, leading to covariate shifts. Effective cross-feature learning is crucial to handle data distribution drift and adapting to changing user behaviour. Traditional feature interaction techniques have limitations in achieving optimal performance in this context. This work introduces Ad-Rec, an advanced network that leverages feature interaction techniques to address covariate shifts. This helps eliminate irrelevant interactions in recommendation tasks. Ad-Rec leverages masked transformers to enable the learning of higher-order cross-features while mitigating the impact of data distribution drift. Our approach improves model quality, accelerates convergence, and reduces training time, as measured by the Area Under Curve (AUC) metric. We demonstrate the scalability of Ad-Rec and its ability to achieve superior model quality through comprehensive ablation studies.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-28", "journal": {"name": "ArXiv", "volume": "abs/2308.14902"}, "authors": [{"authorId": "2143684319", "name": "Muhammad Adnan"}, {"authorId": "2051714641", "name": "Yassaman Ebrahimzadeh Maboud"}, {"authorId": "2132509131", "name": "Divyat Mahajan"}, {"authorId": "144365238", "name": "Prashant J. Nair"}], "citations": [{"paperId": "4c69d79c0ee7ac964284a75135b317d1ce7fb2d6", "title": "Keyformer: KV Cache Reduction through Key Tokens Selection for Efficient Generative Inference"}, {"paperId": "aface9954f16d59daf8143043be1ef8559aa128c", "title": "Disaggregated Multi-Tower: Topology-aware Modeling Technique for Efficient Large-Scale Recommendation"}]}
