{"paperId": "3497ffe43371469641abd3c90c8922fca375819f", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Supporting Meteorologists in Data Analysis through Knowledge-Based Recommendations", "abstract": "Climate change means coping directly or indirectly with extreme weather conditions for everybody. Therefore, analyzing meteorological data to create precise models is gaining more importance and might become inevitable. Meteorologists have extensive domain knowledge about meteorological data yet lack practical data analysis skills. This paper presents a method to bridge this gap by empowering the data knowledge carriers to analyze the data. The proposed system utilizes symbolic AI, a knowledge base created by experts, and a recommendation expert system to offer suiting data analysis methods or data pre-processing to meteorologists. This paper systematically analyzes the target user group of meteorologists and practical use cases to arrive at a conceptual and technical system design implemented in the CAMeRI prototype. The concepts in this paper are aligned with the AI2VIS4BigData Reference Model and comprise a novel first-order logic knowledge base that represents analysis methods and related pre-processings. The prototype implementation was qualitatively and quantitatively evaluated. This evaluation included recommendation validation for real-world data, a cognitive walkthrough, and measuring computation timings of the different system components.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-28", "journal": {"name": "Big Data Cogn. Comput.", "pages": "103", "volume": "6"}, "authors": [{"authorId": "148234271", "name": "Thoralf Reis"}, {"authorId": "2186607097", "name": "Tim Funke"}, {"authorId": "2098809838", "name": "Sebastian Bruchhaus"}, {"authorId": "96526856", "name": "F. Freund"}, {"authorId": "3405635", "name": "M. X. Bornschlegl"}, {"authorId": "1799848", "name": "M. Hemmje"}], "citations": [{"paperId": "3a9393d00fb96644f8c487ada84d6b30812dd840", "title": "A Review on Artificial Intelligence in Internet of Things and Cyber Physical Systems"}, {"paperId": "79a30a42b464ce3683ceb24dfb68ff0c3d2ae641", "title": "An Information System Supporting Insurance Use Cases by Automated Anomaly Detection"}]}
