{"paperId": "34aac42574b7a8778837da73974fbb7473cd6764", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Analysis of Caregiver Burden Expressed in Social Media Discussions", "abstract": "Almost 40% of US adults provide informal caregiving, yet research gaps remain around what burdens affect informal caregivers. This study uses a novel social media site, Reddit, to mine and better understand what online communities focus on as their caregiving burdens. These forums were accessed using an application programming interface, a machine learning classifier was developed to remove low information posts, and topic modeling was applied to the corpus. An expert panel summarized the forums’ themes into ten categories. The largest theme extracted from Reddit’s forums discussed the personal emotional toll of being a caregiver. This was followed by logistic issues while caregiving and caring for parents who have cancer. Smaller themes included approaches to end-of-life care, physical equipment needs when caregiving, and the use of wearables or technology to help monitor care recipients. The platform often discusses caregiving for parents which may reflect the age of Reddit’s users. This study confirms that Reddit forums are used for caregivers to discuss the burdens associated with their role and the types of stress that can result from informal caregiving.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-20", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "14901507", "name": "Catherine C. Shoults"}, {"authorId": "2056901908", "name": "Michael W. Rutherford"}, {"authorId": "50103153", "name": "A. Kemp"}, {"authorId": "2339141", "name": "Merideth A. Addicott"}, {"authorId": "2170903976", "name": "Aliza T Brown"}, {"authorId": "144302728", "name": "Carolyn J. Greene"}, {"authorId": "7157535", "name": "C. Hayes"}, {"authorId": "95803452", "name": "Jennifer M. Gan"}, {"authorId": "1395556792", "name": "L. Larson-Prior"}, {"authorId": "30124120", "name": "Jonathan P. Bona"}], "citations": [{"paperId": "9232bd68bd205f68c2f700316a302cbec878696c", "title": "Comparing the Discussion of Telehealth in Two Social Media Platforms: Social Listening Analysis"}, {"paperId": "1ff865a0b9604cd15d1e79f8cf59ddcf34391252", "title": "Scoping the Priorities and Concerns of Parents: Infodemiology Study of Posts on Mumsnet and Reddit"}]}
