{"paperId": "34cd58ce4da403f75a2b9107d649cf117c9a64ee", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Dissecting the Runtime Performance of the Training, Fine-tuning, and Inference of Large Language Models", "abstract": "Large Language Models (LLMs) have seen great advance in both academia and industry, and their popularity results in numerous open-source frameworks and techniques in accelerating LLM pre-training, fine-tuning, and inference. Training and deploying LLMs are expensive as it requires considerable computing resources and memory, hence many efficient approaches have been developed for improving system pipelines as well as operators. However, the runtime performance can vary significantly across hardware and software stacks, which makes it difficult to choose the best configuration. In this work, we aim to benchmark the performance from both macro and micro perspectives. First, we benchmark the end-to-end performance of pre-training, fine-tuning, and serving LLMs in different sizes , i.e., 7, 13, and 70 billion parameters (7B, 13B, and 70B) on three 8-GPU platforms with and without individual optimization techniques, including ZeRO, quantization, recomputation, FlashAttention. Then, we dive deeper to provide a detailed runtime analysis of the sub-modules, including computing and communication operators in LLMs. For end users, our benchmark and findings help better understand different optimization techniques, training and inference frameworks, together with hardware platforms in choosing configurations for deploying LLMs. For researchers, our in-depth module-wise analyses discover potential opportunities for future work to further optimize the runtime performance of LLMs.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-07", "journal": {"name": "ArXiv", "volume": "abs/2311.03687"}, "authors": [{"authorId": "2220130622", "name": "Longteng Zhang"}, {"authorId": "2265743820", "name": "Xiang Liu"}, {"authorId": "2233541345", "name": "Zeyu Li"}, {"authorId": "2237187329", "name": "Xinglin Pan"}, {"authorId": "2265581222", "name": "Peijie Dong"}, {"authorId": "2223895478", "name": "Ruibo Fan"}, {"authorId": "2265627251", "name": "Rui Guo"}, {"authorId": "2265652022", "name": "Xin Wang"}, {"authorId": "2265583012", "name": "Qiong Luo"}, {"authorId": "2268704", "name": "S. Shi"}, {"authorId": "2259315629", "name": "Xiaowen Chu"}], "citations": [{"paperId": "ac4745d66fca1a1f003f062e1b623fd962846568", "title": "On the Compressibility of Quantized Large Language Models"}]}
