{"paperId": "34d37330e41b97c43975f8d9f03c713db4d15b93", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Research on Anti-Alzheimer’s Traditional Chinese Medicine with Data Security: Datasets, Methods, and Evaluation", "abstract": "Alzheimer’s disease (AD), a growing global health concern, has been posing a significant threat to the health of the aging population. The factors contributing to the occurrence and development of AD are extremely complex, including multiple neural networks and multiple targets, which join together to formulate enormous challenges in AD treatment. Traditional Chinese medicine (TCM) possesses the characteristics to regulate multiple targets at the same time, which is consistent with the pathogenesis of AD, moreover, clinical results in TCM treating AD reveal promising effects. In this paper, we first collected anti-Alzheimer’s prescriptions and their therapeutic effects from commonly used literature databases and expanded the data to form the anti-Alzheimer’s TCM dataset. Next, we combined machine learning models to train and analyze the dataset, which was used to predict the effectiveness of new TCM prescriptions. For the first time, we proposed to use the artificial intelligence method to train the properties of nature, flavor, and channel tropism in TCM prescriptions. The accuracy of the prediction model for the effectiveness of anti-Alzheimer’s can reach up to 85%. The experimental results demonstrated that our method can precisely predict the effectiveness of prescriptions against Alzheimer’s disease, and have great value in providing guidance for the development of new anti-Alzheimer’s drugs. Finally, we built a distributed model training architecture based on federated learning to train and predict the effectiveness of TCM prescriptions under the premise of ensuring data security.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-22", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "1452327949", "name": "Peng Tang"}, {"authorId": "2159708641", "name": "Yubin Zheng"}, {"authorId": "40453004", "name": "Weidong Qiu"}, {"authorId": "2144223466", "name": "Hao Wang"}, {"authorId": "2117062832", "name": "Jie Guo"}, {"authorId": "1390799037", "name": "Zheng Huang"}], "citations": []}
