{"paperId": "34d4037c8f111691ce177e29ccaf7680f8eed5dd", "publicationVenue": {"id": "7a4a2cd2-0615-44b1-83c3-d07ad89415b4", "name": "Journal of Crohn's & Colitis", "type": "journal", "alternate_names": ["Journal of Crohn's and Colitis", "J Crohn's  Colitis", "Journal of Crohns & Colitis", "J Crohn's Colitis", "J Crohn  Colitis"], "issn": "1873-9946", "alternate_issns": ["1197-4982"], "url": "http://www.ecco-jccjournal.org/aims", "alternate_urls": ["http://www.ecco-jccjournal.org/"]}, "title": "Immunological Networks Defining the Heterogeneity of Inflammatory Bowel Diseases", "abstract": "Abstract Current practice in IBD is to classify patients based on clinical signs and symptoms and provide treatments accordingly. However, the response of IBD patients to available treatments is highly variable, highlighting clinically significant heterogeneity among patients. Thus, more accurate patient stratification is urgently needed to more effectively target therapeutic interventions to specific patients. Here we review the degree of heterogeneity in IBD, discussing how the microbiota, genetics, and immune system may contribute to the variation among patients. We highlight how molecular heterogeneity may relate to clinical phenotype, but in other situations may be independent of clinical phenotype, encouraging future studies to fill the gaps. Finally, we discuss novel stratification methodologies as a foundation for precision medicine, in particular a novel stratification strategy based on conserved genes across species. All of these dimensions of heterogeneity have potential to provide strategies for patient stratification and move IBD practice towards personalised medicine.", "venue": "Journal of Crohn's & Colitis", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-05-07", "journal": {"name": "Journal of Crohn's & Colitis", "pages": "1959 - 1973", "volume": "15"}, "authors": [{"authorId": "2089135599", "name": "K. Selin"}, {"authorId": "32894848", "name": "C. Hedin"}, {"authorId": "5054395", "name": "E. Villablanca"}], "citations": [{"paperId": "2761c2e01089d14d60deb3a9a6245677930fd1e9", "title": "Discordant effects of ex-vivo JAK inhibition on inflammatory responses in colonic compared to ileal mucosa"}, {"paperId": "d19d3e32e252e885dd261b2ed83a1f41f2ebbfa1", "title": "The ClC-2 Chloride Channel Activator, Lubiprostone, Improves Intestinal Barrier Function in Biopsies from Crohn’s Disease but Not Ulcerative Colitis Patients"}, {"paperId": "f19bf58e626369b8c09c2391d7c3e62023e67878", "title": "Type 2 immunity in intestinal homeostasis and inflammatory bowel disease"}, {"paperId": "d78dc39a56df9e9d46c77e35022d42d9c9efa8a2", "title": "A Treatment-Naive Cellular Atlas of Pediatric Crohn's Disease Predicts Disease Severity and Therapeutic Response"}, {"paperId": "7e76cefba43a860c48431231f673e73c96d9568d", "title": "World Journal of Gastroenterology"}]}
