{"paperId": "34da78c1a32ecae3c320dc6948bdee2f0b88330f", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Data Analysis for Information Discovery", "abstract": "Artificial intelligence applications are becoming increasingly popular and are producing better results in many areas of research. The quality of the results depends on the quantity of data and its information content. In recent years, the amount of data available has increased significantly, but this does not always mean more information and therefore better results. The aim of this work is to evaluate the effects of a new data preprocessing method for machine learning. This method was designed for sparce matrix approximation, and it is called semi-pivoted QR approximation (SPQR). To best of our knowledge, it has never been applied to data preprocessing in machine learning algorithms. This method works as a feature selection algorithm, and in this work, an evaluation of its effects on the performance of an unsupervised clustering algorithm is proposed. The obtained results are compared to those obtained using, as preprocessing algorithm, principal component analysis (PCA). These two methods have been applied to various publicly available datasets. The obtained results show that the SPQR algorithm can achieve results comparable to those obtained using PCA without introducing any transformation of the original dataset.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1743181", "name": "A. Amato"}, {"authorId": "39120770", "name": "V. Di Lecce"}], "citations": [{"paperId": "ab68c1873343e00089d171f9fbd3bff39558c179", "title": "Smart City Based on Open Data: A Survey"}]}
