{"paperId": "34e53a6bfcb9015125c8eb6a989b40bebb763f7d", "publicationVenue": {"id": "e09f8f4e-50bb-475c-8a00-46f853d8c6c9", "name": "Journal of Computational Design and Engineering", "type": "journal", "alternate_names": ["J Comput Des Eng"], "issn": "2288-4300", "url": "https://www.journals.elsevier.com/journal-of-computational-design-and-engineering/", "alternate_urls": ["http://www.jcde.org/"]}, "title": "A multi-strategy enhanced African vultures optimization algorithm for global optimization problems", "abstract": "\n The African vultures optimization algorithm (AVOA) is a recently proposed metaheuristic inspired by the African vultures’ behaviors. Though the basic AVOA performs very well for most optimization problems, it still suffers from the shortcomings of slow convergence rate and local optimal stagnation when solving complex optimization tasks. Therefore, this study introduces a modified version named enhanced AVOA (EAVOA). The proposed EAVOA uses three different techniques namely representative vulture selection strategy, rotating flight strategy, and selecting accumulation mechanism, respectively, which are developed based on the basic AVOA. The representative vulture selection strategy strikes a good balance between global and local searches. The rotating flight strategy and selecting accumulation mechanism are utilized to improve the quality of the solution. The performance of EAVOA is validated on 23 classical benchmark functions with various types and dimensions and compared to those of nine other state-of-the-art methods according to numerical results and convergence curves. In addition, three real-world engineering design optimization problems are adopted to evaluate the practical applicability of EAVOA. Furthermore, EAVOA has been applied to classify multi-layer perception using XOR and cancer datasets. The experimental results clearly show that the EAVOA has superiority over other methods.", "venue": "Journal of Computational Design and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-11", "journal": {"name": "J. Comput. Des. Eng.", "pages": "329-356", "volume": "10"}, "authors": [{"authorId": "2147253899", "name": "Rong Zheng"}, {"authorId": "32168818", "name": "A. Hussien"}, {"authorId": "1699624735", "name": "R. Qaddoura"}, {"authorId": "9118158", "name": "H. Jia"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2146514405", "name": "Shuang Wang"}, {"authorId": "2098823249", "name": "Abeer Saber"}], "citations": [{"paperId": "a6f8bbb123879943852898b9c2731b2c0186d5df", "title": "An enhanced sea-horse optimizer for solving global problems and cluster head selection in wireless sensor networks"}, {"paperId": "012d291a9896e823f83aeeda0d8c6545a481d018", "title": "Separation of fault characteristic impulses of flexible thin-wall bearing based on wavelet transform and correlated Gini index"}, {"paperId": "7b86019ab4ece635aec44efc2a5612f318d6d80b", "title": "Comparative analysis of the hybrid gazelle‐Nelder–Mead algorithm for parameter extraction and optimization of solar photovoltaic systems"}, {"paperId": "48784832106c2c6724d47ae62349219e7baa89ac", "title": "Enhancing optimal sizing of stand-alone hybrid systems with energy storage considering techno-economic criteria based on a modified artificial rabbits optimizer"}, {"paperId": "ff91ef3b2f1d32fe212f87d2e820a084556523a8", "title": "A CNN-based model to count the leaves of rosette plants (LC-Net)"}, {"paperId": "93585ba546e7bda26bab4dce9d3cbb351c36086f", "title": "An enhanced dynamic differential annealed algorithm for global optimization and feature selection"}, {"paperId": "f71daa92fd9fcfac5944bff7b344c4c14a9d3410", "title": "Optimizing daylight in west-facing facades for LEED V4.1 compliance using metaheuristic approach"}, {"paperId": "3f3e0689f821a12a97b9ceabd40f40bba8dc9304", "title": "A quasi-oppositional learning of updating quantum state and Q-learning based on the dung beetle algorithm for global optimization"}, {"paperId": "baa9f8e8390d48128eda19e992db0dc03cea4e1c", "title": "Adapting the pre-trained convolutional neural networks to improve the anomaly detection and classification in mammographic images"}, {"paperId": "ec58f3a9b2901e681432ae150bc3b32f340162be", "title": "Novel hybrid of AOA-BSA with double adaptive and random spare for global optimization and engineering problems"}, {"paperId": "220cfbf252d92d6ab8727bce1723fed21cfee71a", "title": "Artificial Ecosystem-Based Optimization with Dwarf Mongoose Optimization for Feature Selection and Global Optimization Problems"}, {"paperId": "476ef22e609bbf67eb3da28d1219d237850188f5", "title": "An enhanced hunter‐prey optimization for optimal power flow with FACTS devices and wind power integration"}, {"paperId": "c11ebfd58d0d127e076a4e49bc3dd4e814e1bc60", "title": "MSAO: A multi-strategy boosted snow ablation optimizer for global optimization and real-world engineering applications"}, {"paperId": "ce922d5a92ed1926a07c17d30e8c0c3de3cccb26", "title": "IEDO-net: Optimized Resnet50 for the classification of COVID-19"}]}
