{"paperId": "34e824c5d19b59a9ddcd0e54a73c1fae0d8c146a", "publicationVenue": {"id": "b7ddd94c-612c-4a36-904b-ea858b900ccc", "name": "Organizational Cybersecurity Journal: Practice, Process and People", "type": "journal", "alternate_names": ["Organ Cybersecur J Pract Process People"], "issn": "2635-0270"}, "title": "A service lens on cybersecurity continuity and management for organizations’ subsistence and growth", "abstract": "PurposeThis paper proposes a holistic, proactive and adaptive approach to cybersecurity from a service lens, given the continuously evolving cyber-attack techniques, threat and vulnerability landscape that often overshadow existing cybersecurity approaches.Design/methodology/approachThrough an extensive literature review of relevant concepts and analysis of existing cybersecurity frameworks, standards and best practices, a logical argument is made to produce a dynamic end-to-end cybersecurity service system model.FindingsCyberspace has provided great value for businesses and individuals. The COVID-19 pandemic has significantly motivated the move to cyberspace by organizations. However, the extension to cyberspace comes with additional risks as traditional protection techniques are insufficient and isolated, generally focused on an organization's perimeter with little attention to what is out there. More so, cyberattacks continue to grow in complexity creating overwhelming consequences. Existing cybersecurity approaches and best practices are limited in scope, and implementation strategies, differing in strength and focus, at different levels of granularity. Nevertheless, the need for a proactive, adaptive and responsive cybersecurity solution is recognized.Originality/valueThis paper presents a model that promises proactive, adaptive and responsive end-to-end cybersecurity. The proposed cybersecurity continuity and management model premised on a service system, leveraging on lessons learned from existing solutions, takes a holistic analytical view of service activities from source (service provider) to destination (Customer) to ensure end-to-end security, whether internally (within an organization) or externally.", "venue": "Organizational Cybersecurity Journal: Practice, Process and People", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-11-03", "journal": {"name": "Organizational Cybersecurity Journal: Practice, Process and People"}, "authors": [{"authorId": "2624658", "name": "G. Thomas"}, {"authorId": "26752006", "name": "Mary-Jane Sule"}], "citations": [{"paperId": "78ea7e0e4b30565d634d041a9d779121e6973d4f", "title": "Relevance and Applicability of Cybersecurity Frameworks in the Context of BFSI Vertical in India"}, {"paperId": "eda7c242d6f2496d53094eeb9209c58041a79eba", "title": "Management Strategies to Address Human Resources Challenges in the Information Technology Era"}, {"paperId": "4f34023b61a43137b444a3b719750deb573443f5", "title": "Mitigating cybercrimes in an evolving organizational landscape"}, {"paperId": "3b88da9f3ab10913d5eb40a445f8afef9c85543f", "title": "The Role of Organizational Culture in Cybersecurity: Building a Security-First Culture"}, {"paperId": "6ee5bbd3fd3ce7573d1c39cb8a2fe09ed5de2aa9", "title": "UTILIZING BUSINESS ANALYTICS FOR CYBERSECURITY: A PROPOSAL FOR PROTECTING BUSINESS SYSTEMS AGAINST CYBER ATTACKS"}]}
