{"paperId": "34ece5f762d50465ee187a51f45a810c8188c0ab", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Framework to perform taint analysis and security assessment of IoT devices in smart cities", "abstract": "The Internet of Things has a bootloader and applications responsible for initializing the device’s hardware and loading the operating system or firmware. Ensuring the security of the bootloader is crucial to protect against malicious firmware or software being loaded onto the device. One way to increase the security of the bootloader is to use digital signature verification to ensure that only authorized firmware can be loaded onto the device. Additionally, implementing secure boot processes, such as a chain of trust, can prevent unauthorized access to the device’s firmware and protect against tampering during the boot process. This research is based on the firmware bootloader and application dataflow taint analysis and security assessment of IoT devices as the most critical step in ensuring the security and integrity of these devices. This process helps identify vulnerabilities and potential attack vectors that attackers could exploit and provides a foundation for developing effective remediation strategies.", "venue": "PeerJ Computer Science", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-21", "journal": {"name": "PeerJ Computer Science", "volume": "9"}, "authors": [{"authorId": "2606653", "name": "Akashdeep Bhardwaj"}, {"authorId": "2275962637", "name": "Ankit Vishnoi"}, {"authorId": "2255587943", "name": "Salil Bharany"}, {"authorId": "3100952", "name": "Abdelzahir Abdelmaboud"}, {"authorId": "2256152249", "name": "Ashraf Osman Ibrahim"}, {"authorId": "72627361", "name": "Mohamed Mamoun"}, {"authorId": "73514097", "name": "W. Nagmeldin"}], "citations": []}
