{"paperId": "34fdb1402de567fd78642c70afaadf5e93eddb73", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Future IoT‐enabled threats and vulnerabilities: State of the art, challenges, and future prospects", "abstract": "In the recent era, the security issues affecting the future Internet‐of‐Things (IoT) standards has fascinated noteworthy consideration from numerous research communities. In this view, numerous assessments in the form of surveys were proposed highlighting several future IoT‐centric subjects together with threat modeling, intrusion detection systems (IDS), and various emergent technologies. In contrast, in this article, we have focused exclusively on the emerging IoT‐related vulnerabilities. This article is a multi‐fold survey that emphasizes on understanding the crucial causes of novel vulnerabilities in IoT paradigms and issues in existing research. Initially, we have emphasized on different layers of IoT architecture and highlight various emerging security challenges associated with each layer along with the key issues of different IoT systems. Secondly, we discuss the exploitation, detection, and defense methodologies of IoT malware‐enabled distributed denial of service (DDoS), Sybil, and collusion attack capabilities. We have also discussed numerous state‐of‐the‐art strategies for intrusion detection and methods for IDS setup in future IoT systems. Third, we have presented a brief classification of existing IoT authentication protocols and a comparative analysis of such protocols based on different IoT‐enabled cyber attacks. For conducting a real‐time future IoT research, we have presented some emerging blockchain solutions. We have also discussed a comparative examination of some of the recently developed simulation tools and IoT test beds that are characterized based on different layers of IoT infrastructure. We have also outlined some of the open issues and future research directions and also facilitate the readers with broad classification of existing surveys in this domain that addresses several scopes related to the IoT paradigm. This survey article focuses in enabling IoT‐related research activities by comparing and merging scattered surveys in this domain.", "venue": "International Journal of Communication Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-06", "journal": {"name": "International Journal of Communication Systems", "volume": "33"}, "authors": [{"authorId": "2192266777", "name": "Astha Srivastava"}, {"authorId": "46414662", "name": "Shashank Gupta"}, {"authorId": "51359574", "name": "Megha Quamara"}, {"authorId": "47422069", "name": "Pooja Chaudhary"}, {"authorId": "120182898", "name": "V. Aski"}], "citations": [{"paperId": "e613fb4c45bbf51c11ebcbd68c73ab11778cb9dd", "title": "An adaptive RFID anti-collision algorithm for network intrusion detection"}, {"paperId": "fe385856de97e53ff4336e65de5885cf8cde570d", "title": "Detection and Prevention of Cyber Defense Attacks using Machine Learning Algorithms"}, {"paperId": "65e82ca0af137e83bdc4e5823fb5647e2ab78cbc", "title": "Navigating the IoT landscape: Unraveling forensics, security issues, applications, research challenges, and future"}, {"paperId": "955b05aea555cf4c6bf1def8f20393e8652e9660", "title": "Securing IoT Devices Against Emerging Security Threats: Challenges and Mitigation Techniques"}, {"paperId": "741bae6c20ea7d9c871b83e8314cf175942e9afe", "title": "The internet of modular robotic things: Issues, limitations, challenges, & solutions"}, {"paperId": "d7d8e6868d52ed01fe12e68a3192441ad11947ba", "title": "A fuzzy COPRAS-based decision-making framework for mitigating the impact of vampire sensor nodes in wireless sensor nodes (WSNs)"}, {"paperId": "208dc9d832cf2888b8394d81f658bd856c7a0e81", "title": "Analysis of Consumer IoT Device Vulnerability Quantification Frameworks"}, {"paperId": "101548868b2505127d4fe23b54261c3ec434a296", "title": "Towards adversarial realism and robust learning for IoT intrusion detection and classification"}, {"paperId": "448d34d555017c7da46a385f87a26f85e9cfddc0", "title": "Adversarial attacks and defenses on ML- and hardware-based IoT device fingerprinting and identification"}, {"paperId": "7a8f25fb9c75dee78b18fb91e0dfa23b6a397cd5", "title": "A Comparative Analysis of Machine Learning Techniques for IoT Intrusion Detection"}, {"paperId": "b59b1351ad6803a3dfc40ff2a86d345d153c6f65", "title": "A Deep Learning-based Penetration Testing Framework for Vulnerability Identification in Internet of Things Environments"}, {"paperId": "83ccef46be0fa0922e87d604a22ed0fda9545846", "title": "Efficient data uncertainty management for health industrial internet of things using machine learning"}, {"paperId": "a753478c98d623b3ad9a31a0165312f9e7947b1b", "title": "Data Privacy in IoT Equipped Future Smart Homes"}, {"paperId": "f86379b535de1f0498033709a42a13fefeedafc0", "title": "Internet of Things: Towards a Solid Ecosystem of Interconnected Things"}, {"paperId": "09f3f60a63a03b11c0135cb5fa5aa82365180a4f", "title": "Internet of Things Applications, Security Challenges, Attacks, Intrusion Detection, and Future Visions: A Systematic Review"}, {"paperId": "95eabf9cb05c72eb1c2fc5f8d3db6b06530f1dda", "title": "Authentication mechanisms for IoT system based on distributed MQTT brokers: review and challenges"}, {"paperId": "7652461cea7ed24ebf5ba34fabf0516bab1230f0", "title": "IoT Vulnerability Assessment for Sustainable Computing: Threats, Current Solutions, and Open Challenges"}]}
