{"paperId": "3501e7d064feaf88a3b6b582202a9eb1707f9a91", "publicationVenue": {"id": "146869d7-bc08-4ccf-89c8-2aba81d32bde", "name": "ACM Journal of Data and Information Quality", "type": "journal", "alternate_names": ["Journal of Data and Information Quality", "J Data Inf Qual", "ACM J Data Inf Qual"], "issn": "1936-1963", "url": "https://dl.acm.org/citation.cfm?id=J1191&picked=prox", "alternate_urls": ["https://dl.acm.org/loi/jdiq", "https://jdiq.acm.org/", "http://portal.acm.org/jdiq"]}, "title": "Metadata Harvesting and Quality Assurance within Open Urban Platforms", "abstract": "During the past years, various activities and concepts have shaped and prepared the path for the development of urban environments toward smart cities across the world. One of the initial activities was relating to the opening of vast amounts of data from various public administrations and utility companies within a city in order to create a viable eco-system of urban services and applications. Thereby, the harvested metadata needed to be verified in terms of correctness and a corresponding level of quality had to be assured. In addition, the concept of an Open Urban Platform emerged as an overall solution for smart cities Information Communication Technology (ICT) in the sense that an abstract reference model was established and standardized, providing an overall picture of the ICT structures within a city. Within this article, we use the Open Urban Platform concept as the basics to describe and map our activities within the Open Data domain, focusing mainly on the Open Data prototype for German Open Governmental Data—namely GovData.DE. Thereby, we describe our metadata harvesting and metadata quality assurance approach and discuss on lessons learned, which flow into the definition of metadata quality metrics and have the potential to lead to a corresponding standard within the Deutsches Institut für Normung e.V. (DIN) German national standardization.", "venue": "ACM Journal of Data and Information Quality", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-19", "journal": {"name": "Journal of Data and Information Quality (JDIQ)", "pages": "1 - 20", "volume": "12"}, "authors": [{"authorId": "2711297", "name": "Philipp Lämmel"}, {"authorId": "2785078", "name": "Benjamin Dittwald"}, {"authorId": "80021116", "name": "Lina Bruns"}, {"authorId": "2770759", "name": "Nikolay Tcholtchev"}, {"authorId": "2629122", "name": "Yuri Glikman"}, {"authorId": "70582677", "name": "S. Cuno"}, {"authorId": "2028213778", "name": "Mathias Flügge"}, {"authorId": "1693337", "name": "I. Schieferdecker"}], "citations": [{"paperId": "8b80633c8ac783dc59eed85b4404c764f508548c", "title": "Digital Transformation in the Public Administrations: A Guided Tour for Computer Scientists"}, {"paperId": "700953961ea0b43a3957364e0b0881c5735a2d3c", "title": "Beyond technology in smart cities: a multivocal literature review on data governance"}, {"paperId": "82c00d2912400a10fffce84f6354dafff016df0d", "title": "OGD metadata country portal publishing guidelines compliance: A multi-case study search for completeness and consistency"}, {"paperId": "eea1e362f26bd09f788e6c6d5b716651a09749f0", "title": "Rx-PETaL: A Reactive Data Publishing Framework"}, {"paperId": "db1d3fbbb00a0a02b2bffd6715b3f6460dca3228", "title": "O PEN D ATA O BSERVATORIES"}]}
