{"paperId": "3503b41cfeea12f8e0cb9abdf2937cb794386e74", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ARBA: Anomaly and Reputation Based Approach for Detecting Infected IoT Devices", "abstract": "Today, cyber attacks are constantly evolving and changing, which makes them harder to detect. In particular, detecting attacks in large-scale networks is very challenging because they require high detection rates under real-time resource constraints. In this paper, we focus on detecting infected Internet of Things (IoT) hosts from domain name system (DNS) traffic data. IoT hosts, such as streaming cameras, printers, air conditioners, are hard to protect, unlike PCs and servers. Enterprises are often unaware of the devices which are connected to the network, their types, makes, and vulnerabilities. Since IoT hosts make use of the DNS protocol, analyzing DNS data can give a broad view of malicious activities, because they abuse the DNS protocol and leave fingerprints as part of their attack vector. In this collaborative research between Ben-Gurion University, and IBM, we establish a novel algorithm to detect infected IoT hosts in large-scale DNS traffic, named Anomaly and Reputation Based Algorithm (ARBA). Its novelty resides in developing a framework that combines host classification and domain reputation in a real-time production environment. ARBA is highly computational efficient and meets real-time requirements in terms of run time and computational complexity. By contrast to existing algorithms, it does not require a massive traffic volume for training, which is of significant interest in detecting infected hosts in real-time. The research was conducted on real live streaming data from IBM internal network traffic, and confirm the algorithm’s strong performance in a real-time production environment.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "145751-145767", "volume": "8"}, "authors": [{"authorId": "1646512892", "name": "Gilad Rosenthal"}, {"authorId": "1646595027", "name": "Ofir Erets Kdosha"}, {"authorId": "10748834", "name": "Kobi Cohen"}, {"authorId": "1646665673", "name": "Alon Freund"}, {"authorId": "1646512287", "name": "Avishay Bartik"}, {"authorId": "29326363", "name": "Aviv Ron"}], "citations": [{"paperId": "c8500d980d48250497af882b7e145ce10da0a367", "title": "Deep Multi-Agent Reinforcement Learning for Decentralized Active Hypothesis Testing"}, {"paperId": "e224c3c85a8a0369eab10749765332e573baf485", "title": "Anomaly Detection for IoT Security: Comprehensive Survey"}, {"paperId": "d9efd8ecf7d9478d45817b65b71bf62f10ef25bb", "title": "Intelligent IoT-BOTNET attack detection model with optimized hybrid classification model"}, {"paperId": "a7e49523f1b672046f32450c530ba832b29eb100", "title": "Enhanced Security for an IoT Devices in Cyber-Physical System against Cyber Attacks"}, {"paperId": "bc7ef7d5b3ef5474b19b5e85a5baa680ca1fcc7e", "title": "IMDoC: Identification of Malicious Domain Campaigns via DNS and Communicating Files"}, {"paperId": "0414b2fbd5137ec204ed2e36124958f66136e205", "title": "Botnet Detection Approach Using Graph-Based Machine Learning"}]}
