{"paperId": "3507b9422002f0725d0691166a9cb1bca4063f16", "publicationVenue": {"id": "ca7dcd95-d974-4c9a-a722-6d7715b2ce9f", "name": "Journal of Internet Services and Information Security", "type": "journal", "alternate_names": ["J Internet Serv Inf Secur"], "issn": "2182-2069", "url": "http://www.jisis.org/"}, "title": "Applying Big Data Processing and Machine Learning Methods for Mobile Internet of Things Security Monitoring", "abstract": "The paper offers a new approach to Big Data processing for security monitoring of mobile Internet of things elements based on machine learning and its implementation using parallel algorithms. The architecture of security monitoring system is considered. It speciﬁes several machine learning mechanisms intended for solving classiﬁcation tasks. The classiﬁer operation results are exposed to plurality voting, weight voting and soft voting. The experimental assessment of performance and accuracy of the offered methods is made.", "venue": "Journal of Internet Services and Information Security", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "J. Internet Serv. Inf. Secur.", "pages": "54-63", "volume": "8"}, "authors": [{"authorId": "16777650", "name": "Igor Kotenko"}, {"authorId": "145683384", "name": "I. Saenko"}, {"authorId": "2636647", "name": "A. Branitskiy"}], "citations": [{"paperId": "63a90a7ecc4ff1d740b6ff8e62ee897fc3d13ade", "title": "Exploration on Heterogeneous Network Security Monitoring Algorithm Based on Big data Intelligent Information Technology"}, {"paperId": "6a93637a46841f9f90e988e02f330d61b6314f5c", "title": "Secure fine grained access control for telecare medical communication system"}, {"paperId": "5986f57057d347172bd6067c80fa1ae7d08ca38e", "title": "Design of Machine Learning-Based Malware Detection Methodologies in the Internet of Things Environment"}, {"paperId": "381526cc3ca8c39ce719e3775989839476fc5f79", "title": "Machine Learning Methods for Secure Internet of Things Against Cyber Threats"}, {"paperId": "9765f107079f8ecb7f58eb410aafd9709daf4e5f", "title": "Robust, Effective and Resource Efficient Deep Neural Network for Intrusion Detection in IoT Networks"}, {"paperId": "34d37330e41b97c43975f8d9f03c713db4d15b93", "title": "Research on Anti-Alzheimer’s Traditional Chinese Medicine with Data Security: Datasets, Methods, and Evaluation"}, {"paperId": "acca54af6ae6392e6b1a55729d880df5988e1076", "title": "Federated Compressed Learning Edge Computing Framework with Ensuring Data Privacy for PM2.5 Prediction in Smart City Sensing Applications"}, {"paperId": "d8f9d8e9f621ca124c5102d31240e31041c2c98a", "title": "Intelligent Environmental Art Design Combining Big Data and Artificial Intelligence"}, {"paperId": "3bcbebdb35b02e07205ba59b1544bafe6c8f039c", "title": "Intelligent Mirai Malware Detection for IoT Nodes"}, {"paperId": "e4089f62ece0b303373fe047105559457979e0d5", "title": "Comparative Analysis of LSTM-based Deep Learning Models for HAR using Smartphone Sensor"}, {"paperId": "926fff8330a430737a0c1ad77de7c28de3fa16be", "title": "LSTM Networks Using Smartphone Data for Sensor-Based Human Activity Recognition in Smart Homes"}, {"paperId": "95fa0bbcd164d2f77f82687dda728c9b8c6bd1fc", "title": "SGF-MD: Behavior Rule Specification-Based Distributed Misbehavior Detection of Embedded IoT Devices in a Closed-Loop Smart Greenhouse Farming System"}, {"paperId": "c3fea3202c8a1c733bfdfc4e7e96a453cde69937", "title": "The Algorithm and Structure for Digital Normalized Cross-Correlation by Using First-Order Moment †"}, {"paperId": "17f61201f38b453c8cccf6e2ca5484437897084a", "title": "Low-Power AES Data Encryption Architecture for a LoRaWAN"}, {"paperId": "c161f7b07953db6ce64ebdb5c1750b2217926336", "title": "Behavioral Analysis of Resource Allocation Systems in Cloud Infrastructure"}, {"paperId": "1a6a29e5ea23ccd39c246ff013de205fc9c7aaa6", "title": "A Deep Learning Approach for Maximum Activity Links in D2D Communications"}, {"paperId": "cc62931dd1733bbbf9075c0741b5c78a0d5e753d", "title": "A machine-learning framework for supporting intelligent web-phishing detection and analysis"}, {"paperId": "45a81f00b88f041b2b08c77d81179c225826c85c", "title": "Detection of Distributed Cyber Attacks Based on Weighted Ensembles of Classifiers and Big Data Processing Architecture"}, {"paperId": "f64dd3747c7d8400e8473cb7bab5dd6692546617", "title": "Cooperative Jammer Selection for Secrecy Improvement in Cognitive Internet of Things"}, {"paperId": "6ad14193a05b52c6b0f3d17e9eaf81433685b034", "title": "An Efficient Facebook Place Information Extraction Strategy"}, {"paperId": "42538b1c1a4b1803c6f4fac7f012891bbf6b12ab", "title": "A Framework for implementing an ML or DL model to improve Intrusion Detection Systems (IDS) in the NTMA context, with an example on the dataset (CSE-CIC-IDS2018)"}, {"paperId": "d1e48b9f89b26a79344aaa427313d06d7a3a9c7e", "title": "Memory Efficient Federated Deep Learning for Intrusion Detection in IoT Networks"}, {"paperId": "13e74178846f233e0fa964ebf27b6e75a6050afc", "title": "Queuing Model Based Edge Placement for Work Offloading in Mobile Cloud Networks"}, {"paperId": "285dd3c6a2e6439ba77b7da65d0cf7fe882d13cb", "title": "A Deep Reinforcement Learning Based Approach for Energy-Efficient Channel Allocation in Satellite Internet of Things"}, {"paperId": "95955008bfad4e1ffe7c5f499d64bf2a6eab3bff", "title": "Indoor Positioning System Using Artificial Neural Network With Swarm Intelligence"}, {"paperId": "92bece8c07e7852316573ca781f95c0bb119299b", "title": "Machine Learning and Big Data Processing for Cybersecurity Data Analysis"}, {"paperId": "0aeb1464e2e632e7ce5fc6845d6f6ce1adc80750", "title": "Phil´eas: Anomaly Detection for IoT Monitoring"}, {"paperId": "9846a722dd7ae2cdd82c4d539b63685246254b31", "title": "Mobile Internet Security: 4th International Symposium, MobiSec 2019, Taichung, Taiwan, October 17–19, 2019, Revised Selected Papers"}, {"paperId": "6e606ab50ee528ecf5d0d3089283f751fb149ea1", "title": "Role Mining: Survey and Suggestion on Role Mining in Access Control"}, {"paperId": "52decd3b0243c06de22bf7b16960153bc609e158", "title": "Improved Collaborative Filtering Algorithm Based on Stacked Denoising AutoEncoders"}, {"paperId": "a56ad9fc1e2269de12b0389ecee4acbb79d575fe", "title": "Aggregate Authentication for Massive Internet of Things in 5G Networks"}, {"paperId": "5f521e6e01252f7a20254f29a0ee6bc5ec281c7e", "title": "Power-Efficient Big.LITTLE Core Assignment Scheme for Task Graph Based Real-Time Smartphone Applications"}, {"paperId": "2e03b6fd467f950597c696278c51ef5028f4af9a", "title": "LoRaWAN Network Server Session Keys Establish Method with the Assistance of Join Server"}]}
