{"paperId": "35097a42cf673c981c18ada2cad093358539fab2", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "CoSpot: a cooperative VM allocation framework for increased revenue from spot instances", "abstract": "Most large cloud operators offer a lower-priced, lower-priority alternative to regular (on-demand or reserved) virtual machines, commonly referred to as spot instances. Spot instances are opportunistically allocated to servers in order to utilize any residual cloud capacity, but are evicted whenever regular virtual machines need to use that capacity. This paper proposes CoSpot, a lightweight framework for cooperative allocation of regular virtual machines and spot instances, which allows for easy integration of arbitrary virtual machine and spot allocators. In our experiments, employing the framework achieves up to 245% improvement (average 34% improvement) in spot revenue, with no loss in virtual machine revenue, compared to the baseline VM and spot allocation without using our framework. We also derive and release a reusable workload with both virtual machines and spot instances, based on data previously shared by Microsoft Azure.", "venue": "ACM Symposium on Cloud Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the 13th Symposium on Cloud Computing"}, "authors": [{"authorId": "2103385339", "name": "Syed M. Iqbal"}, {"authorId": "2190148729", "name": "Haley Li"}, {"authorId": "1683714", "name": "S. Bergsma"}, {"authorId": "2637596", "name": "Ivan Beschastnikh"}, {"authorId": "1741933", "name": "Alan J. Hu"}], "citations": [{"paperId": "97c98e57044e7523e1c61329d23992a5300815f6", "title": "spotDNN: Provisioning Spot Instances for Predictable Distributed DNN Training in the Cloud"}]}
