{"paperId": "350cec1b8f7c7134f9833a8835bd8f29eb619afc", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community", "abstract": "In the r/AmITheAsshole subreddit, people anonymously share first person narratives that contain some moral dilemma or conflict and ask the community to judge who is at fault (i.e., who is \"the asshole\"). These first person narratives are, in general, a unique storytelling domain where the author is not only the narrator (the person telling the story) but is also a character (the person living the story) and, thus, the author has two distinct voices presented in the story. In this study, we identify linguistic and narrative features associated with the author as the character or as a narrator. We use these features to answer the following questions: (1) what makes an asshole character and (2) what makes an asshole narrator? We extract both Author-as-Character features (e.g., demographics, narrative event chain, and emotional arc) and Author-as-Narrator features (i.e., the style and emotion of the story as a whole) in order to identify which aspects of the narrative are correlated with the final moral judgment. Our work shows that \"assholes\" as Characters frame themselves as lacking agency with a more positive personal arc, while \"assholes\" as Narrators will tell emotional and opinionated stories.", "venue": "International Conference on Web and Social Media", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-19", "journal": {"name": "ArXiv", "volume": "abs/2301.08104"}, "authors": [{"authorId": "50360470", "name": "Salvatore Giorgi"}, {"authorId": "2074107169", "name": "Ke Zhao"}, {"authorId": "3649759", "name": "Alexander H. Feng"}, {"authorId": "145262322", "name": "Lara J. Martin"}], "citations": [{"paperId": "fe1b76d02b6c5db5a90514ad856bf755d3e3e52b", "title": "Community Needs and Assets: A Computational Analysis of Community Conversations"}, {"paperId": "27553f8bd9cbee90f6e65b9cdecadff0e7cc55ee", "title": "Riveter: Measuring Power and Social Dynamics Between Entities"}, {"paperId": "daf848f282db7f22eb28ae68be0d049badec9e9e", "title": "Moral Judgments in Narratives on Reddit: Investigating Moral Sparks via Social Commonsense and Linguistic Signals"}, {"paperId": "482c4074a0ab09438cb6822c138ae3e89c979e4c", "title": "Text Embeddings and Clustering for Characterizing Online Communities on Reddit"}, {"paperId": "2b6125bf85845a62841008a75bc6f1d48d201681", "title": "Identifying Narrative Content in Podcast Transcripts"}]}
