{"paperId": "3521fe18b00623888aafdcab2503b3508e4e45cb", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "AOEHO: A New Hybrid Data Replication Method in Fog Computing for IoT Application", "abstract": "Recently, the concept of the internet of things and its services has emerged with cloud computing. Cloud computing is a modern technology for dealing with big data to perform specified operations. The cloud addresses the problem of selecting and placing iterations across nodes in fog computing. Previous studies focused on original swarm intelligent and mathematical models; thus, we proposed a novel hybrid method based on two modern metaheuristic algorithms. This paper combined the Aquila Optimizer (AO) algorithm with the elephant herding optimization (EHO) for solving dynamic data replication problems in the fog computing environment. In the proposed method, we present a set of objectives that determine data transmission paths, choose the least cost path, reduce network bottlenecks, bandwidth, balance, and speed data transfer rates between nodes in cloud computing. A hybrid method, AOEHO, addresses the optimal and least expensive path, determines the best replication via cloud computing, and determines optimal nodes to select and place data replication near users. Moreover, we developed a multi-objective optimization based on the proposed AOEHO to decrease the bandwidth and enhance load balancing and cloud throughput. The proposed method is evaluated based on data replication using seven criteria. These criteria are data replication access, distance, costs, availability, SBER, popularity, and the Floyd algorithm. The experimental results show the superiority of the proposed AOEHO strategy performance over other algorithms, such as bandwidth, distance, load balancing, data transmission, and least cost path.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2202060175", "name": "Ahmed Awad Mohamed"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2088490225", "name": "A. Alburaikan"}, {"authorId": "143966355", "name": "H. A. Khalifa"}], "citations": [{"paperId": "6d003b2a0924b6d543b1dbef1bdedd95fd71f5e2", "title": "Optimizing multi-objective task scheduling in fog computing with GA-PSO algorithm for big data application"}, {"paperId": "66376e5313cdd7c5362234d12436fe9218066e59", "title": "Enhancing service availability and resource deployment in IoT using a shared service replication method"}, {"paperId": "50783a530630ad4ac9189b0f60018d64aa343f0f", "title": "Monitoring DC Motor Based On LoRa and IOT"}, {"paperId": "d749442373cba92efad765698b8cd5f8933634f0", "title": "Using the Grey Wolf Aquila Synergistic Algorithm for Design Problems in Structural Engineering"}, {"paperId": "7cb08dd11003baacc13f812eb5b6e2484f5a31b3", "title": "Network Optimization of Carbon Monoxide Sensor Nodes in the Metropolitan Region of São Paulo"}, {"paperId": "ca74d1d58c182249c45024e394a8b9e40c0f9567", "title": "Mimicking Human Verification Behavior for News Media Credibility Evaluation"}, {"paperId": "1956137be7f0a28dc32934206f43ca5cb0483fbb", "title": "A Comprehensive Survey on Aquila Optimizer"}, {"paperId": "0389a48af3cb54044136553786a2625410f09afb", "title": "A Survey on COVID-19 Data Analysis Using AI, IoT, and Social Media"}, {"paperId": "e488dba0cf3bff35cc30d7d35ddd2864be86ba9e", "title": "An Extensive Study of Scheduling the Task using Load Balance in Fog Computing"}]}
