{"paperId": "3543a309bb96324d8e052f132c9a22df0c6da080", "publicationVenue": {"id": "c0047299-4a6a-4b3f-a6f6-e89a0ab88470", "name": "GigaScience", "type": "journal", "issn": "2047-217X", "url": "https://academic.oup.com/gigascience"}, "title": "MaRe: Processing Big Data with application containers on Apache Spark", "abstract": "Abstract Background Life science is increasingly driven by Big Data analytics, and the MapReduce programming model has been proven successful for data-intensive analyses. However, current MapReduce frameworks offer poor support for reusing existing processing tools in bioinformatics pipelines. Furthermore, these frameworks do not have native support for application containers, which are becoming popular in scientific data processing. Results Here we present MaRe, an open source programming library that introduces support for Docker containers in Apache Spark. Apache Spark and Docker are the MapReduce framework and container engine that have collected the largest open source community; thus, MaRe provides interoperability with the cutting-edge software ecosystem. We demonstrate MaRe on 2 data-intensive applications in life science, showing ease of use and scalability. Conclusions MaRe enables scalable data-intensive processing in life science with Apache Spark and application containers. When compared with current best practices, which involve the use of workflow systems, MaRe has the advantage of providing data locality, ingestion from heterogeneous storage systems, and interactive processing. MaRe is generally applicable and available as open source software.", "venue": "GigaScience", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-01", "journal": {"name": "GigaScience", "volume": "9"}, "authors": [{"authorId": "2885797", "name": "Marco Capuccini"}, {"authorId": "5966309", "name": "Martin Dahlö"}, {"authorId": "3280633", "name": "S. Toor"}, {"authorId": "1776762", "name": "O. Spjuth"}], "citations": [{"paperId": "9371f4f2c43211c5df3a0b7a291f65996851a150", "title": "An Event-Driven Architecture for Genomics-Based Diagnostic Data Processing"}, {"paperId": "d70a2222399ae60baa1743a57509e1181da292eb", "title": "Cloud-native distributed genomic pileup operations"}, {"paperId": "eebd8dc223d0dc6531d666445b50747d8f785e7f", "title": "A Dockerized big data architecture for sports analytics"}, {"paperId": "d1b8c407ddcf31dba806e580de02cb8c873ea2a6", "title": "PhenoMeNal: processing and analysis of metabolomics data in the cloud"}]}
