{"paperId": "35493a7ab4ebfba2790d37041ff08b6f6e9ea95a", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "An Implementation of Open Source-Based Software as a Service (SaaS) to Produce TOA and TOC Reflectance of High-Resolution KOMPSAT-3/3A Satellite Image", "abstract": "The majority of cloud applications are created or delivered to provide users with access to system resources or prebuilt processing algorithms for efficient data storage, management, and production. The number of cases linking cloud computing to the use of global observation satellite data continues to rise, owing to the benefits of cloud computing. This study aims to develop a cloud software as a service (SaaS) that yields reflectance products in high-resolution Korea Multi-Purpose Satellite (KOMPSAT)-3/3A satellite images. The SaaS model was designed as three subsystems: a Calibration Processing System (CPS), a Request System for CPS supporting RESTful application programming interface (API), and a Web Interface Application System. Open-source components, libraries, and frameworks were used in this study’s SaaS, including an OpenStack for infrastructure as a service. An absolute atmospheric correction scheme based on a Second Simulation of a Satellite Signal in the Solar Spectrum (6S) radiative transfer code with atmospheric variable inputs was used to generate the top-of-atmosphere (TOA) and top-of-canopy (TOC) reflectance products. The SaaS implemented in this study provides users with the absolute atmospheric calibration functionality to apply their KOMPSAT-3/3A satellite image set through a web browser and obtain output directly from this service. According to experiments to check the total performance time for images, bundled with four bands of red, green, blue, and near-infrared, it took approximately 4.88 min on average for the execution time to obtain all reflectance results since satellite images were registered into the SaaS. The SaaS model proposed and implemented in this study can be used as a reference model for the production system to generate reflectance products from other optical sensor images. In the future, SaaS, which offers professional analysis functions based on open source, is expected to grow and expand into new application fields for public users and communities.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-12", "journal": {"name": "Remote. Sens.", "pages": "4550", "volume": "13"}, "authors": [{"authorId": "144881987", "name": "Kwangseob Kim"}, {"authorId": "145661129", "name": "Kiwon Lee"}], "citations": [{"paperId": "8d0b912bc635254ea7690fa8367a8958b6b05db1", "title": "Exploring the Impact of Software as a Service (SaaS) on Human Life"}, {"paperId": "ee705fe72c437ac82546f59de251733a91118a77", "title": "Prototyping of Utilization Model for KOMPSAT-3/3A Analysis Ready Data Based on the Open Data Cube Platform in Multi-Cloud Computing Environment: A Case Study"}]}
