{"paperId": "354a6c8d68c51cbde7c477a09e8c05ad6d2a0f72", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "Characterization of a Big Data Storage Workload in the Cloud", "abstract": "The proliferation of big data processing platforms has led to radically different system designs, such as MapReduce and the newer Spark. Understanding the workloads of such systems facilitates tuning and could foster new designs. However, whereas MapReduce workloads have been characterized extensively, relatively little public knowledge exists about the characteristics of Spark workloads in representative environments. To address this problem, in this work we collect and analyze a 6-month Spark workload from a major provider of big data processing services, Databricks. Our analysis focuses on a number of key features, such as the long-term trends of reads and modifications, the statistical properties of reads, and the popularity of clusters and of file formats. Overall, we present numerous findings that could form the basis of new systems studies and designs. Our quantitative evidence and its analysis suggest the existence of daily and weekly load imbalances, of heavy-tailed and bursty behaviour, of the relative rarity of modifications, and of proliferation of big data specific formats.", "venue": "International Conference on Performance Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-04-04", "journal": {"name": "Proceedings of the 2019 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "30139648", "name": "Sacheendra Talluri"}, {"authorId": "47168867", "name": "Alicja Luszczak"}, {"authorId": "2004049", "name": "Cristina L. Abad"}, {"authorId": "1760940", "name": "A. Iosup"}], "citations": [{"paperId": "38d231dc11e78813542dacc1793d6953ce9de232", "title": "Characterization of I/O Behaviors in Cloud Storage Workloads"}, {"paperId": "f8055b744083c92dffce162159fe2c567c28cb5a", "title": "Revisiting Temporal Storage I/O Behaviors of Smartphone Applications: Analysis and Synthesis"}, {"paperId": "284221ddb54eb34cff67ecc0f0e4c2d7943a5f7c", "title": "Cluster resource scheduling in cloud computing: literature review and research challenges"}, {"paperId": "c0c673a10796c8a30cdbb8158a56fb1902f63ac4", "title": "Large-Scale Analysis of Docker Images and Performance Implications for Container Storage Systems"}, {"paperId": "b336492cc1a8de095a57fe0684f142816f32d045", "title": "A Black-Box Fork-Join Latency Prediction Model for Data-Intensive Applications"}, {"paperId": "427dfb9bf58a65fbbc658aeb43aeb030407ba8ae", "title": "Characterization and modeling of an edge computing mixed reality workload"}, {"paperId": "8bfd14a2d4f31a7654d1c9abd79653d395e1c014", "title": "Latency-aware Resource Management at the Edge"}, {"paperId": "c9d24ac34cb9d3cc015f926a2a77b4571162311c", "title": "The Workflow Trace Archive: Open-Access Data From Public and Private Computing Infrastructures"}, {"paperId": "5ef6b895b779df3d408088fdac04d32b01c3a6ba", "title": "Efficient Estimation of Read Density when Caching for Big Data Processing"}, {"paperId": "d3731d729d7d767dd23721a174a50122f3600fbd", "title": "Seamless infrastructure programming and control for quality-critical cloud applications"}]}
