{"paperId": "354fbd6c940ead125fe995503b87462470d2d4f5", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Database Optimizers in the Era of Learning", "abstract": "In this tutorial, we review advances made recently in a decades-old problem, namely query optimization. Along with the traditional optimization techniques many of which are still being used successfully in production, various techniques inspired by AI, such as genetic algorithms, had been explored as early as in the '90s as potential solutions, without gaining at that time much traction, especially in commercial offerings. More recently, with the rapid progress on learning, several approaches have brought this technology within the core of a database management system (DBMS) aiming at developing scalable, learning solutions to all challenging components of the system optimizer. We present the early efforts in this area, describe advancements, limitations and open issues, and discuss future research directions.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "3213-3216"}, "authors": [{"authorId": "2141221792", "name": "Dimitris Tsesmelis"}, {"authorId": "1695573", "name": "A. Simitsis"}], "citations": [{"paperId": "d930c396526bb5a7d6c4fdeb5abb23b7c5a97908", "title": "Optimizing Resource Allocation for Tumor Simulations over HPC Infrastructures"}, {"paperId": "a58b0c49cf4ca76380ca7b0eb13ea569bf8c169d", "title": "Join Order Selection with Deep Reinforcement Learning: Fundamentals, Techniques, and Challenges"}, {"paperId": "47a23008ab677567a84f0add7e25306ac6f8f9c3", "title": "COOOL: A Learning-To-Rank Approach for SQL Hint Recommendations"}, {"paperId": "113257034270314a644d95532d5608c77e2de5d5", "title": "Toulouse: Learning Join Order Optimization Policies for Rule-based Data Engines"}, {"paperId": "017ed88c7a7f4d72319bcf5821b591b694fd23f7", "title": "The History, Present, and Future of ETL Technology (invited)"}, {"paperId": "eadd8551b68b67c6b4feb7b46f0e3d7b63199999", "title": "Ontario DataBase Day – Program"}]}
