{"paperId": "3556a8e4ef339d3b24db0a851cbd683fa95a0722", "publicationVenue": null, "title": "Ego Network Structures in Multilayer Online Social Networks", "abstract": "Personal networks, i.e., the ensemble of social relationships that an individual entertains with other people, have received signiﬁcant attention from researchers, and Dunbar’s ego network model has proved to be a valuable tool for understanding their characteristics, both for oﬄine and online interactions. Most of the studies in the literature are focused on single-layer ego networks, where relationships are treated as if they all belong to the same context. However, studies on multi-layer networks have recently highlighted the importance of considering the diﬀerent dimensions of real-life networks. In this study, we bridge the gap between the literature on ego networks and that on multilayer networks by introducing the concept of multilayer ego networks . Our goal is to assess whether multilayer ego networks feature the same structural regularities observed in single-layers ego networks and to investigate the role that the diﬀerent layers play in how people interact with each other. To this aim, we leverage a dataset extracted from Reddit, and we treat each subreddit as a diﬀerent layer of the social network. How results show (i) that multilayer ego networks are self-similar, (ii) that egos distribute their cognitive eﬀorts proportionally across their layers, and (iii) that egos accommodate multiple layers by adapting the outermost circles without signiﬁcantly aﬀecting the innermost ones.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "40493923", "name": "Mustafa Toprak"}, {"authorId": "144386157", "name": "C. Boldrini"}, {"authorId": "1739490", "name": "A. Passarella"}, {"authorId": "2118998743", "name": "N. Sastry"}, {"authorId": "2285227256", "name": "Alessandro Di"}], "citations": []}
