{"paperId": "356bd30b35240793b961f74dd9c85484a7856dc7", "publicationVenue": {"id": "0d6f7fba-7092-46b3-8039-93458dba736b", "name": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Acoust Speech Signal Process", "IEEE Int Conf Acoust Speech Signal Process", "ICASSP", "International Conference on Acoustics, Speech, and Signal Processing"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000002"}, "title": "Clustering of Data with Missing Entries", "abstract": "The analysis of large datasets is often complicated by the presence of missing entries, mainly because most of the current machine learning algorithms are designed to work with full data. The main focus of this work is to introduce a clustering algorithm, that will provide good clustering even in the presence of missing data. The proposed technique solves an lo fusion penalty based optimization problem to recover the clusters. We theoretically analyze the conditions needed for the successful recovery of the clusters. We also propose an algorithm to solve a relaxation of this problem using saturating non-convex fusion penalties. The method is demonstrated on simulated and real datasets, and is observed to perform well in the presence of large fractions of missing entries.", "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "year": 2018, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-01-03", "journal": {"name": "2018 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)", "pages": "2831-2835"}, "authors": [{"authorId": "38596520", "name": "Sunrita Poddar"}, {"authorId": "145004655", "name": "M. Jacob"}], "citations": [{"paperId": "709246b20dd081e812d68fcda85908633196386c", "title": "A Unified Tensor Framework for Clustering and Simultaneous Reconstruction of Incomplete Imaging Data"}, {"paperId": "2439cf0aeda44108c6e249ffc8d08bbaa7714238", "title": "Robust convex clustering"}]}
