{"paperId": "3570fc0d0d54914154104ddfe926533eebd93b94", "publicationVenue": {"id": "6a8c0041-d0b7-4e32-b52c-33adef005c7e", "name": "Frontiers in Artificial Intelligence", "alternate_names": ["Front Artif Intell"], "issn": "2624-8212", "url": "https://www.frontiersin.org/journals/artificial-intelligence#"}, "title": "Declarative Learning-Based Programming as an Interface to AI Systems", "abstract": "Data-driven approaches are becoming increasingly common as problem-solving tools in many areas of science and technology. In most cases, machine learning models are the key component of these solutions. Often, a solution involves multiple learning models, along with significant levels of reasoning with the models' output and input. However, the current tools are cumbersome not only for domain experts who are not fluent in machine learning but also for machine learning experts who evaluate new algorithms and models on real-world data and develop AI systems. We review key efforts made by various AI communities in providing languages for high-level abstractions over learning and reasoning techniques needed for designing complex AI systems. We classify the existing frameworks based on the type of techniques and their data and knowledge representations, compare the ways the current tools address the challenges of programming real-world applications and highlight some shortcomings and future directions. Our comparison is only qualitative and not experimental since the performance of the systems is not a factor in our study.", "venue": "Frontiers in Artificial Intelligence", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-06-18", "journal": {"name": "Frontiers in Artificial Intelligence", "volume": "5"}, "authors": [{"authorId": "2190934", "name": "Parisa Kordjamshidi"}, {"authorId": "144590225", "name": "D. Roth"}, {"authorId": "1746871", "name": "K. Kersting"}], "citations": [{"paperId": "a0cf6848a9035014e7deb23d5f83ae4737521092", "title": "Challenges in AutoML and Declarative Studies Using Systematic Literature Review"}]}
