{"paperId": "357689d5dedd9db49a5ee6b977ea2e5882429a49", "publicationVenue": null, "title": "Clustering Provinces in Indonesia based on Community Welfare Indicators", "abstract": "The Preamble of the 1945 Constitution of the Republic of Indonesia explicitly states that the main task of the government of the Republic of Indonesia is to advance general prosperity, to develop the nation's intellectual life, and to realize social justice for all Indonesian people. Social inequality is a problem that is still faced by Indonesian people today. To solve the problem required supporting data analysis as a basis for policy formulation. This research was conducted with the aim of clustering provinces in Indonesia based on community welfare indicators using K-Means cluster analysis. K-Means cluster analysis is chosen based on the variance value (0.101), which is smaller than the variance value in the average linkage cluster analysis (0.152). Based on data analysis, provinces in Indonesia are clustered into three where the first cluster consists of 21 provinces, the second cluster consists of 3 provinces, and the third cluster consists of 10 provinces. Each cluster has different characteristics that can be of concern to the parties concerned to overcome the social welfare gap. Besides, in order cluster results are more easily understood, visualization of results is added with a Geographic Information System (GIS) using Indonesian maps accompanied by differences in color gradations for each cluster", "venue": "", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2020-02-18", "journal": {"name": "", "pages": "56-63", "volume": "20"}, "authors": [{"authorId": "73421025", "name": "Sekti kartika Dini"}, {"authorId": "97524283", "name": "A. Fauzan"}], "citations": [{"paperId": "414d18f11a2a6693e2a96524cd2df2f0fec513ba", "title": "Assessment of corona virus (COVID-19) infection spread pattern in Iraq using GIS and RS techniques"}, {"paperId": "b182034d0885bcdf70c326d4f9753ea3404bed77", "title": "Clustering Thailand’s Provinces based on Socio-Economic Data"}, {"paperId": "ea24bd5866ddec151b810ac93d2d5b835908434d", "title": "NON HIERARCHICAL K-MEANS ANALYSIS TO CLUSTERING PRIORITY DISTRIBUTION OF FUEL SUBSIDIES IN INDONESIA"}, {"paperId": "276860a0799529b6173af71e4d9123c33a8d7388", "title": "Innovative development of the regions in the context of specific taxation of energy industries"}, {"paperId": "b1887f9635464eecb796904e10a75ea491bbb715", "title": "A Comparative Analysis of Machine Learning Techniques for Exploring Country Clustering Based on Life Expectancy"}, {"paperId": "76ed5fb9b8478dfe619eaef4137d20c01a17d50d", "title": "PERBANDINGAN PERFORMA ALGORITMA K-MEANS, K-MEDOIDS, DAN DBSCAN DALAM PENGGEROMBOLAN PROVINSI DI INDONESIA BERDASARKAN INDIKATOR KESEJAHTERAAN MASYARAKAT"}, {"paperId": "73581892ee3f6d83f83863e95c627cbaec0911cd", "title": "Analysis of Social Inequality and Education Level in South Sulawesi Province, Indonesia"}, {"paperId": "d8f75b66dddb8d9273adff8ca2e13d640808cafe", "title": "Estimation of Dairy Cow Survival in the First Three Lactations for Different Culling Reasons Using the Kaplan–Meier Method"}, {"paperId": "4b8103fb126589e650850e86970ffe0e678c3661", "title": "Cluster Analysis for Grouping Districts in Sidoarjo Regency Based on Education Indicators"}, {"paperId": "f87cc7112342c93604657c21987182a64b663594", "title": "Implementation Of The K-Means Method In Grouping Districts And Cities In North Sumatra On Social Welfare Problems"}, {"paperId": "dfaf0389d363b0093c6085d8995d5a088d98ec69", "title": "Implementasi Metode K-Medoids Clustering untuk Pengelompokan Provinsi di Indonesia Berdasarkan Indikator Pendidikan"}, {"paperId": "d582465b119749f0b6215060fdf7d8109dd51976", "title": "Pillar Algorithm in K-Means Method for Identification Health Human Resources Availability Profile in Central Java"}, {"paperId": "6754632630592ee2e2b8471c16589469a3c13b62", "title": "Application Of K-Means Clustering Algorithm On Population Growth In Simalungun Regency"}, {"paperId": "c55d9a56ce5248322fc17209cb9053f574005e5a", "title": "Spatial Mapping and Prediction of Diphtheria Risk in Surabaya, Indonesia, Using the Hierarchical Clustering Algorithm"}]}
