{"paperId": "35798efd58004978a6082c7c923489c3c401837f", "publicationVenue": null, "title": "GraphWaGu: GPU Powered Large Scale Graph Layout Computation and Rendering for the Web", "abstract": "Large scale graphs are used to encode data from a variety of application domains such as social networks, the web, biological networks, road maps, and finance. Computing enriching layouts and interactive rendering play an important role in many of these applications. However, producing an efficient and interactive visualization of large graphs remains a major challenge, particularly in the web-browser. Existing state of the art web-based visualization systems such as D3.js, Stardust, and NetV.js struggle to achieve interactive layout and visualization for large scale graphs. In this work, we leverage the latest WebGPU technology to develop GraphWaGu , the first WebGPU-based graph visualization system. WebGPU is a new graphics API that brings the full capabilities of modern GPUs to the web browser. Leveraging the computational capabilities of the GPU using this technology enables GraphWaGu to scale to larger graphs than existing technologies. GraphWaGu embodies both fast parallel rendering and layout creation using modified Frutcherman-Reingold and Barnes-Hut algorithms implemented in WebGPU compute shaders. Experimental results demonstrate that our solution achieves the best performance, scalability, and layout quality when compared to current state of the art web-based graph visualization libraries. All of our source code for the project is available at https://github.com/harp-lab/GraphWaGu.", "venue": "EGPGV@EuroVis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "73-83"}, "authors": [{"authorId": "2186576677", "name": "Landon Dyken"}, {"authorId": "2137498644", "name": "Pravin Poudel"}, {"authorId": "101447617", "name": "W. Usher"}, {"authorId": "8808472", "name": "Steve Petruzza"}, {"authorId": "47740443", "name": "J. Chen"}, {"authorId": "1500379929", "name": "Sidharth Kumar"}], "citations": [{"paperId": "f94903792b5d8187db47b84b6f345a541b18b6bf", "title": "Speculative Progressive Raycasting for Memory Constrained Isosurface Visualization of Massive Volumes"}, {"paperId": "0c5cdca063ed4e55b2fadba03cfb45f4c12c88d9", "title": "WebGPU for Scalable Client-Side Aggregate Visualization"}, {"paperId": "28a2a3d12ba1339b5e46470be18bd3d074afe49e", "title": "3D Model Occlusion Culling Optimization Method Based on WebGPU Computing Pipeline"}]}
