{"paperId": "358259d32cd6ae81be7c9ec5ffa479a53ad74cd6", "publicationVenue": {"id": "60c45ccc-5528-42eb-85a9-7606a3d9b220", "name": "International Conference on Interaction Sciences", "type": "conference", "alternate_names": ["Annual ACIS International Conference on Computer and Information Science", "IEEE/ACIS International Conference on Computer and Information Science", "International Conference on Intelligent Systems", "Annu ACIS Int Conf Comput Inf Sci", "International Conference on Information Systems", "Int Conf Interact Sci", "ICIS", "Int Conf Internet Comput Inf Serv", "Int Conf Intell Syst", "IEEE/ACIS Int Conf Comput Inf Sci", "Int Conf Inf Syst", "International Conference on Internet Computing and Information Services"], "url": "https://web.archive.org/web/*/http://www.aicit.org/icis/", "alternate_urls": ["https://aisel.aisnet.org/icis/", "http://www.acisinternational.org/"]}, "title": "Deep Learning-Assisted Physical Education and Resource Allocation Management in Higher Education", "abstract": "One of the most important disciplines for advancing human health is physical education (PE). There are a lot of obstacles in the way of enhancing societal, physical performance. Students able to manage their time well may expedite their healthy physical activity. Additionally, the correlation between sports and exercise is investigated. Significant challenges must be overcome to create a physical, educational environment that emphasizes ecology's defining features and provides personalized assistance. This paper suggested the detection system of higher physical education resources based on deep learning and collaboration filtering algorithms (DSHPE-DLCFA) to meet the needs of both the learner and their education facility. Specific research and student responses confirm its reliability as a resource for designing physical education frameworks. The data recommendation model comprises a collaborative filtering algorithm and a resource feedback matrix. Highly accurate and efficient curriculum material recommendations were made using a deep learning algorithm to integrate new techniques in physical education networks. The experiment's results show efficiency in providing physical education facilities compared to traditional methods.", "venue": "International Conference on Interaction Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-16", "journal": {"name": "2023 Annual International Conference on Emerging Research Areas: International Conference on Intelligent Systems (AICERA/ICIS)", "pages": "1-6"}, "authors": [{"authorId": "2275873665", "name": "Zain Jaffer"}, {"authorId": "2275887131", "name": "Ammar H. Shnawa"}, {"authorId": "2281407688", "name": "Aqeel Ali"}, {"authorId": "2254295368", "name": "Fatima Ghali"}, {"authorId": "2284080312", "name": "Nabaa rabea wasmi Zaydan"}, {"authorId": "2283116523", "name": "Ahmed Read Al-Tameemi"}], "citations": []}
