{"paperId": "3587d05fafec6053808351b8b72c670f58c9a8ec", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Understanding Longitudinal Behaviors of Toxic Accounts on Reddit", "abstract": "Toxic comments are the top form of hate and harassment experienced online. While many studies have investigated the types of toxic comments posted online, the effects that such content has on people, and the impact of potential defenses, no study has captured the long-term behaviors of the accounts that post toxic comments or how toxic comments are operationalized. In this paper, we present a longitudinal measurement study of 929K accounts that post toxic comments on Reddit over an 18 month period. Combined, these accounts posted over 14 million toxic comments that encompass insults, identity attacks, threats of violence, and sexual harassment. We explore the impact that these accounts have on Reddit, the targeting strategies that abusive accounts adopt, and the distinct patterns that distinguish classes of abusive accounts. Our analysis forms the foundation for new time-based and graph-based features that can improve automated detection of toxic behavior online and informs the nuanced interventions needed to address each class of abusive account.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-06", "journal": {"name": "ArXiv", "volume": "abs/2209.02533"}, "authors": [{"authorId": "2134010795", "name": "Deepak Kumar"}, {"authorId": "1697703", "name": "Jeffrey T. Hancock"}, {"authorId": "33411132", "name": "Kurt Thomas"}, {"authorId": "3137133", "name": "Z. Durumeric"}], "citations": [{"paperId": "7b66fdc05ba74ae0108a841d549ff1c3f0613054", "title": "Misbehavior and Account Suspension in an Online Financial Communication Platform"}, {"paperId": "0a56fc83bac9739ac31259e44f4a59271f3a6fee", "title": "No Love Among Haters: Negative Interactions Reduce Hate Community Engagement"}, {"paperId": "01b9fa632ffa5881a905f8f091ca42b70bcc6eae", "title": "The systemic impact of deplatforming on social media"}]}
