{"paperId": "358e483e7f3be652793e420da09370d9146b0f92", "publicationVenue": null, "title": "Artiﬁcial Intelligence (AI) Augmented Edge and Fog Computing: Trends and Challenges", "abstract": "—In recent years, the landscape of computing paradigms has witnessed a gradual yet remarkable shift from monolithic computing to distributed and decentralized paradigms such as Internet of Things (IoT), Edge, Fog, Cloud, and Server-less. The frontiers of these computing technologies have been boosted by shift from manually encoded algorithms to Artiﬁcial Intelligence (AI)-driven autonomous systems for optimum and reliable management of distributed computing resources. Prior work focuses on improving existing systems using AI across a wide range of domains, such as efﬁcient resource provisioning, application deployment, task placement, and service management. This survey reviews the evolution of data-driven AI-augmented technologies and their impact on computing systems. We demystify new techniques and draw key insights in Edge, Fog and Cloud resource management-related uses of AI methods and also look at how AI can innovate traditional applications for enhanced Quality of Service (QoS) in the presence of a continuum of resources. We present the latest trends and impact areas such as optimizing AI models that are deployed on or for computing systems. We layout a roadmap for future research directions in areas such as resource management for QoS optimization and service reliability. Finally, we discuss blue-sky ideas and envision this work as an anchor point for future research on AI-driven computing systems.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "145780334", "name": "Shreshth Tuli"}, {"authorId": "70547270", "name": "Fatemeh Mirhakimi"}, {"authorId": "73461365", "name": "Samodha Pallewatta"}, {"authorId": "70272436", "name": "Syed Zawad"}, {"authorId": "144805467", "name": "G. Casale"}, {"authorId": "145762058", "name": "B. Javadi"}, {"authorId": "145552742", "name": "Feng Yan"}, {"authorId": "1709598", "name": "R. Buyya"}, {"authorId": "144626042", "name": "N. Jennings"}], "citations": []}
