{"paperId": "3597a8dfbbaad2db73f2379c7e9f83262adaaa15", "publicationVenue": null, "title": "Diversity-Ensured Semantic Movie Recommendation by Applying Linked Open Data", "abstract": "The recommender system becomes a significant research area due to the popularity of the social web. Traditional semantic recommender systems deliver poor performance when balancing the recommendation accuracy and diversity. Also, the rank-based recommendation methods lack to obtain the coverage of the entire preferences of the user in the top-N recommendation list. Thus, this paper presents the Diversity-Ensured Semantic-aware Item REcommendation (DESIRE) that deals with the consistent and reliable knowledge source to significantly improve the quality and provide the diversity-ensured top-N recommendation list. The DESIRE approach builds the semantically relevant graphs such as movie-centric and user rating-centric graph with the help of both the Linked Open Data (LOD) and the explicit ratings of the users. By extracting the semantic-path based features from the user rating-centric graph, it executes the ranking algorithm for the top-N movie recommendation. Moreover, the diversity-aware re-ranking tends to maintain the trade-off between the diversity and accuracy in the top-N recommendation.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-04-30", "journal": {"name": "International Journal of Intelligent Engineering and Systems", "pages": "275-286", "volume": "11"}, "authors": [{"authorId": "34600558", "name": "Uma Srinivasan"}, {"authorId": "2074912718", "name": "Chidambaram Mani"}], "citations": [{"paperId": "a68f31c97b8bcd713fcd1e6aef3f0779c10acc07", "title": "Re‐ranking with multiple objective optimization in recommender system"}, {"paperId": "9bb61225b69b034a71ff891963a7007b28190c86", "title": "Resolving data sparsity and cold start problem in collaborative filtering recommender system using Linked Open Data"}, {"paperId": "29b5f62543f0ca68c1cbec336dcdd2a51b8aec2f", "title": "An item-item similarity approach based on linked open data semantic relationship"}, {"paperId": "5621ee7a455774e1e6feda74bf19eabf0ca31207", "title": "Issues and Challenges in the Extraction and Mapping of Linked Open Data Resources with Recommender Systems Datasets"}]}
