{"paperId": "359f162c3e941a40161e5ec7e06dbc1c1c664719", "publicationVenue": {"id": "91a5b241-0923-48b0-8250-c4a923a378d8", "name": "Harvard Kennedy School Misinformation Review", "alternate_names": ["Harv Kennedy Sch Misinformation Rev"], "issn": "2766-1652", "url": "https://misinforeview.hks.harvard.edu/"}, "title": "Twitter flagged Donald Trump’s tweets with election misinformation: They continued to spread both on and off the platform", "abstract": "We analyze the spread of Donald Trump’s tweets that were flagged by Twitter using two intervention strategies—attaching a warning label and blocking engagement with the tweet entirely. We find that while blocking engagement on certain tweets limited their diffusion, messages we examined with warning labels spread further on Twitter than those without labels. Additionally, the messages that had been blocked on Twitter remained popular on Facebook, Instagram, and Reddit, being posted more often and garnering more visibility than messages that had either been labeled by Twitter or received no intervention at all. Taken together, our results emphasize the importance of considering content moderation at the ecosystem level.", "venue": "Harvard Kennedy School Misinformation Review", "year": 2021, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2021-08-24", "journal": {"name": "Harvard Kennedy School Misinformation Review"}, "authors": [{"authorId": "1393027621", "name": "Zeve Sanderson"}, {"authorId": "2108812447", "name": "Megan A. Brown"}, {"authorId": "144402510", "name": "Richard Bonneau"}, {"authorId": "37978142", "name": "Jonathan Nagler"}, {"authorId": "1903670", "name": "Joshua A. Tucker"}], "citations": [{"paperId": "9ae98ad69205f31b3963d9b5bb139b603f678fc9", "title": "Social corrections act as a double-edged sword by reducing the perceived accuracy of false and real news in the UK, Germany, and Italy"}, {"paperId": "8eb567640f364b3bcf543a47cf60bf715d510868", "title": "Memetic commenting: Armenian curses and the Twitter theatre of Trump's deselection"}, {"paperId": "76b9f2953cbbb92f383cddf15654fda3342bfafe", "title": "Crowdsourced Adaptive Surveys"}, {"paperId": "5872863c66dbe567277eaffa8b8bf0d8cbd7eb05", "title": "Political Partisanship and Belief in Misinformation: Operationalizing Theory of Planned Behavior to Predict Intentions to Quit Social Media"}, {"paperId": "05364c626c5389e11dffb64aa2cbc4c91fd927d9", "title": "Falling for Russian Propaganda: Understanding the Factors that Contribute to Belief in Pro-Kremlin Disinformation on Social Media"}, {"paperId": "242098af7eb66767b03bde48e56cedf06319dee0", "title": "Who knowingly shares false political information online?"}, {"paperId": "2291e1114ed00440e751b613d28a67cc223ecb18", "title": "Online media literacy intervention in Indonesia reduces misinformation sharing intention"}, {"paperId": "3a238ab721dc2892fc6bbea0918c5991205701f8", "title": "In the Spotlight: The Russian Government's Use of Official Twitter Accounts to Influence Discussions About its War in Ukraine"}, {"paperId": "0a0cb422ada9de7c2b62db36fce99e4f47d5afe8", "title": "The Intended Uses of Automated Fact-Checking Artefacts: Why, How and Who"}, {"paperId": "53283f3ccf0db648c246fbe016f9cffd120a714d", "title": "The Interconnected Nature of Online Harm and Moderation: Investigating the Cross-Platform Spread of Harmful Content between YouTube and Twitter"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "8ee4cdade78f0f97669b2b32175463c3dfd0b94d", "title": "Identifying cross-platform user relationships in 2020 U.S. election fraud and protest discussions"}, {"paperId": "22bd59aa1fc1c9b6ebe246d5418fe17d601b8e05", "title": "Meaningful Context, a Red Flag, or Both? Preferences for Enhanced Misinformation Warnings Among US Twitter Users"}, {"paperId": "00447aad2abfbf649ed83bc04c3434323884b7c6", "title": "Measuring the effect of Facebook’s downranking interventions against groups and websites that repeatedly share misinformation"}, {"paperId": "cecf9679914a6fc00d406a91f966e26e196530ab", "title": "Assessment of Consumer Perception of Online Content Label Efficacy by Income Level, Party Affiliation and Online Use Levels"}, {"paperId": "8500b01cbdb3c92b83cba6c4a4f6bc5eb46419b4", "title": "Meaningful Context, a Red Flag, or Both? Users' Preferences for Enhanced Misinformation Warnings on Twitter"}, {"paperId": "d7eba84ad00478932d86c91afa4da49b9d21cead", "title": "The Impact of Twitter Labels on Misinformation Spread and User Engagement: Lessons from Trump’s Election Tweets"}, {"paperId": "b9ea2388309958ed678c3f7f6cb1bb088553ad4d", "title": "SYSTEMATIC DISINFORMATION: THE SPREAD OF MISLEADING INFORMATION AS A COLLECTIVE DYNAMIC ON TWITTER"}, {"paperId": "4a6484ed73c18c75f93a8d52f0b58499e8e2515d", "title": "A large-scale sentiment analysis of tweets pertaining to the 2020 US presidential election"}, {"paperId": "611716eae730948239ba9d8635e4752f6810065b", "title": "\"Learn the Facts About COVID-19\": Analyzing the Use of Warning Labels on TikTok Videos"}, {"paperId": "aeb16218391b69d8b3b72c4ba90686627c7eec89", "title": "Harass, mislead, & polarize: An analysis of Twitter political bots’ tactics in targeting the immigration debate before the 2018 U.S. midterm election"}, {"paperId": "e0fc9f4ddbc5be67dbd35b4de238c9e43c9d0036", "title": "Research note: Examining how various social media platforms have responded to COVID-19 misinformation"}, {"paperId": "031803bafeeb1fe9bf779a6e79113be38ceb4586", "title": "Combining interventions to reduce the spread of viral misinformation"}, {"paperId": "a81469da4b75e192630a70c88ed17cb5d9f0e906", "title": "Generative AI and the Future of Elections"}, {"paperId": "87fc618a82dbdeaffdb63d5faf4e4afee2ced7d0", "title": "Learning to Resist Misinformation: A Field Experiment in India ∗"}]}
