{"paperId": "35a3db691222d4e8366e2d9f4650dc452c4d4012", "publicationVenue": null, "title": "Pipelining Graph Construction and Agent-based Computation over Distributed Memory", "abstract": "Graph streaming has received substantial attention for the past 10+ years to cope with large-scale graph computation. Two major approaches, one using conventional data-streaming tools and the other accessing graph databases, facilitate continuous analysis of endlessly flowing graphs and query-based incremental construction of huge graphs, respectively. However, some scientific graphs including biological networks need to stay in memory for repetitive but various analyses. Although a cluster system, thus distributed memory can entirely handle a big graph in memory, a challenge is substantial overhead incurred by loading graphs into memory. A solution is hiding such graph-loading and construction overheads with graph computation in a pipelined fashion. We adapted this pipelining approach for agent-based graph computing where thousands of agents traverse a graph for finding its attributes and shape. We used the multi-agent spatial simulation (MASS) library to implement the concept. A huge graph is incrementally constructed in batches, each spawning and walking agents over the corresponding subgraph, and thus all eventually completing a given computation. We coded and ran two MASS benchmark programs: triangle counting and connected components, with which we evaluated our pipelined graph processing. The best performance was obtained once the batch size shrunk enough to fit cache memory, regardless of the number of cluster nodes. For a single node execution of connected components over a 140MB graph, our graph-pipelining implementation performed 7.7 times faster than non-pipelining execution. Its parallel execution with 24 cluster nodes achieved 8.3 times speed-up as compared to the pipelined single-node execution.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "4616-4624"}, "authors": [{"authorId": "101602119", "name": "YanQin. Hong"}, {"authorId": "1714349", "name": "M. Fukuda"}], "citations": [{"paperId": "d0f5fb3e9e14cb3742613b5c91ebc5efd47b8a3c", "title": "Agent-Based Parallelization of a Multi-Dimensional Semantic Database Model"}]}
