{"paperId": "35aa7176112412b113af66042dfc59b40bb1e258", "publicationVenue": null, "title": "Research on Factors Influencing Smart Library Users’ Use Intention in the Era of Artificial Intelligence", "abstract": "The arrival of the era of artificial intelligence has promoted the development of smart libraries and endowed them with new features such as autonomy, autonomous learning, context perception, and multi-function. Analyzing how these new features affect users’ behavior is of great significance to the application of artificial intelligence and the optimization of services. Based on the TTF model, the four dimensions of product intelligence (autonomy, adaptability, reactivity, and multifunctionality) are introduced to represent the technology characteristics, and the research model is constructed. And the method of SEM is used to conduct empirical analysis. The results show that technology characteristics and individual characteristics are the main factors affecting the task-technology fit (TTF), while the effect of task characteristics on TTF is not significant. Among them, the impact of technology characteristics is greater than the individual characteristics. The relative importance of the four dimensions of technology characteristics is “Autonomy >Multifunctionality, Reactivity> Adaptability”. The TTF significantly positively affects users’ intention to use smart libraries. Therefore, the suggestions on optimizing smart services are put forward.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-09-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2025"}, "authors": [{"authorId": "2144128502", "name": "Jingwen Liu"}, {"authorId": "2151679925", "name": "Dan Song"}, {"authorId": "2129504214", "name": "Weimo Li"}], "citations": [{"paperId": "53327e83330607edb28b6e1599f45b4470c08b7e", "title": "Sistem Informasi Manajemen Riset Unggulan Fakultas Berbasis Web"}, {"paperId": "487689a04a3ec745cac723b3858eb700792c0fe0", "title": "Is Artificial Intelligence Attractive? An Empirical Study on User’s Is Artificial Intelligence Attractive? An Empirical Study on User’s Intention to Use AI-Enabled Applications Intention to Use AI-Enabled Applications"}]}
