{"paperId": "35cb6c17693ddec0d3ceaa598f3cd451637f08ea", "publicationVenue": {"id": "11e94c04-6b12-41c9-963d-1a08cdbc306d", "name": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "type": "conference", "alternate_names": ["PPoPP", "ACM SIGPLAN Symp Princ Pract Parallel Program", "ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming", "ACM SIGPLAN Symp Princ  Pract Parallel Program"], "url": "http://www.acm.org/sigplan/ppopp.htm"}, "title": "iQAN: Fast and Accurate Vector Search with Efficient Intra-Query Parallelism on Multi-Core Architectures", "abstract": "Vector search has drawn a rapid increase of interest in the research community due to its application in novel AI applications. Maximizing its performance is essential for many tasks but remains preliminary understood. In this work, we investigate the root causes of the scalability bottleneck of using intra-query parallelism to speedup the state-of-the-art graph-based vector search systems on multi-core architectures. Our in-depth analysis reveals several scalability challenges from both system and algorithm perspectives. Based on the insights, we propose iQAN, a parallel search algorithm with a set of optimizations that boost convergence, avoid redundant computations, and mitigate synchronization overhead. Our evaluation results on a wide range of real-world datasets show that iQAN achieves up to 37.7× and 76.6× lower latency than state-of-the-art sequential baselines on datasets ranging from a million to a hundred million datasets. We also show that iQAN achieves outstanding scalability as the graph size or the accuracy target increases, allowing it to outperform the state-of-the-art baseline on two billion-scale datasets by up to 16.0× with up to 64 cores.", "venue": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-02-25", "journal": {"name": "Proceedings of the 28th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming"}, "authors": [{"authorId": "2113952229", "name": "Zhen Peng"}, {"authorId": "67016465", "name": "Minjia Zhang"}, {"authorId": "94451829", "name": "K. Li"}, {"authorId": "1740308", "name": "R. Jin"}, {"authorId": "153108488", "name": "Bin Ren"}], "citations": [{"paperId": "a631f10fa7e100492e6f358d940dff2bebc423a4", "title": "JUNO: Optimizing High-Dimensional Approximate Nearest Neighbour Search with Sparsity-Aware Algorithm and Ray-Tracing Core Mapping"}, {"paperId": "3b290827aae5196d219f5edcf4f3e8b7822b190b", "title": "ParlayANN: Scalable and Deterministic Parallel Graph-Based Approximate Nearest Neighbor Search Algorithms"}, {"paperId": "1ec83ef65a0c29f83cbfa05ca15987b4ec83ba54", "title": "Exploiting Modern Hardware Architectures for High-Dimensional Vector Search at Speed and Scale"}]}
