{"paperId": "35d665b10928d43a0991e3c357b1fb1cd820b18e", "publicationVenue": {"id": "acdf09ed-68cc-4c8a-b2ab-3c6c4873cc9e", "name": "Therapeutic Advances in Gastroenterology", "type": "journal", "alternate_names": ["Ther Adv Gastroenterol"], "issn": "1756-283X", "url": "https://journals.sagepub.com/home/tag", "alternate_urls": ["http://tag.sagepub.com/"]}, "title": "10 years of biologic use patterns in patients with inflammatory bowel disease: treatment persistence, switching and dose intensification – a nationwide population-based study", "abstract": "Background: Treatments for inflammatory bowel diseases (IBD) have evolved in the era of biologics. However, the real-world data on their usage patterns and sequencing are still limited. Objectives: We aimed to investigate treatment persistence and dose intensification of first- and second-line biologics in patients with IBD. Design: In this retrospective, cohort study using nationwide claims data, 13,087 patients with IBD initiating biologic therapy between 2010 and 2020 were identified. Methods: Treatment persistence and dose intensification during the first 2 years and switching patterns of biologics were analysed while identifying predictors of non-persistence. Results: As a first-line treatment of Crohn’s disease (CD), ustekinumab had a lower risk for non-persistence compared to infliximab [adjusted hazard ratio (aHR), 0.69, p = 0.048]. Second-line ustekinumab and vedolizumab showed the highest and lowest persistence (79.2% and 54.9%), respectively. As a first-line treatment of ulcerative colitis (UC), golimumab had a higher risk for non-persistence compared to infliximab (aHR, 1.68, p < 0.001). Second-line golimumab also showed a significantly lower persistence rate than adalimumab and vedolizumab. The risk of non-persistence was higher in UC than in CD (first line: aHR, 1.97; second line: aHR, 1.39; p < 0.001), and in the second-line treatment than in the first-line treatment for CD (aHR, 1.55; p < 0.001). The cumulative rate of dose intensification was highest with ustekinumab for CD (first line, 43.3%, second line, 69.1%) and adalimumab for second-line UC (40.7%). It was significantly increased in second-line therapy in CD, but not in UC. Among switchers of first-line anti-tumour necrosis factor-α inhibitor therapy, after all biologics were approved, 69% of CD patients and 78.4% of UC patients switched to other classes of second-line treatment. Conclusion: Ustekinumab had higher persistence in the first-line treatment of CD, while golimumab had lower persistence for first- and second-line treatments of UC. Dose intensification rates varied, with the highest cumulative rates observed for ustekinumab in CD and adalimumab in second-line UC.", "venue": "Therapeutic Advances in Gastroenterology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Therapeutic Advances in Gastroenterology", "volume": "16"}, "authors": [{"authorId": "2249308184", "name": "Hee Moon Koo"}, {"authorId": "2216895727", "name": "Yukyung Jun"}, {"authorId": "1485198455", "name": "Yonghoon Choi"}, {"authorId": "3354211", "name": "C. Shin"}, {"authorId": "1856942", "name": "Y. Park"}, {"authorId": "2116097031", "name": "Nayoung Kim"}, {"authorId": "39112861", "name": "D. H. Lee"}, {"authorId": "2249785594", "name": "Young Kee Shin"}, {"authorId": "144625042", "name": "H. Yoon"}], "citations": []}
