{"paperId": "35d837c1207fddbd93c360c0389e94888db440a0", "publicationVenue": {"id": "01fc9f85-886c-4ca2-8d0f-5b9029534690", "name": "E-Health Telecommunication Systems and Networks", "alternate_names": ["E-health Telecommun Syst Netw"], "issn": "2167-9517", "url": "https://www.scirp.org/journal/etsn/"}, "title": "Unified Analysis Specific to the Medical Field in the Interpretation of Medical Images through the Use of Deep Learning", "abstract": "Deep learning (DL) has seen an exponential development in recent years, with major impact in many medical fields, especially in the field of medical image. The purpose of the work converges in determining the importance of each component, describing the specificity and correlations of these elements involved in achieving the precision of interpretation of medical images using DL. The major contribution of this work is primarily to the updated characterisation of the characteristics of the constituent elements of the deep learning process, scientific data, methods of knowledge incorporation, DL models according to the objectives for which they were designed and the presentation of medical applications in accordance with these tasks. Secondly, it describes the specific correlations between the quality, type and volume of data, the deep learning patterns used in the interpretation of diagnostic medical images and their applications in medicine. Finally presents problems and directions of future research. Data quality and volume, annotations and labels, identification and automatic extraction of specific medical terms can help deep learning models perform image analysis tasks. Moreover, the development of models capable of extracting unattended features and easily incorporated into the architecture of DL networks and the development of techniques to search for a certain network architecture according to the objectives set lead to performance in the interpretation of medical images.", "venue": "E-Health Telecommunication Systems and Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-24", "journal": {"name": "E-Health Telecommunication Systems and Networks"}, "authors": [{"authorId": "2124671903", "name": "Tudor Florin Ursuleanu"}, {"authorId": "145864556", "name": "A. Luca"}, {"authorId": "152774867", "name": "L. Gheorghe"}, {"authorId": "2124671911", "name": "Roxana Grigorovici"}, {"authorId": "2124671619", "name": "Stefan Iancu"}, {"authorId": "2124671566", "name": "Maria Hlusneac"}, {"authorId": "50498863", "name": "C. Preda"}, {"authorId": "48406990", "name": "A. Grigorovici"}], "citations": [{"paperId": "48e6b0731064f806cf4bcb6d8005442808a8287f", "title": "Deep Learning Paradigms for Existing and Imminent Lung Diseases Detection: A Review"}, {"paperId": "c56a211dfd83bbde5091c053030b607eae710759", "title": "Image Classification of Alzheimer's Disease based on Residual Bilinear and Attentive Models"}, {"paperId": "737939a9b9e41d37d45648e5639f0b49b3e982b3", "title": "Impact of quality, type and volume of data used by deep learning models in the analysis of medical images"}, {"paperId": "80bd89852cc9230562c63983c3bcb75619bb14e5", "title": "Deep Learning Application for Analyzing of Constituents and Their Correlations in the Interpretations of Medical Images"}]}
