{"paperId": "35df7522680c1ecad2c390c544d0f4d0f3da6ebc", "publicationVenue": {"id": "59641ff6-f1d8-454b-8b27-409e061cc677", "name": "International Conference on Bio-inspired Systems and Signal Processing", "type": "conference", "alternate_names": ["BIOSIGNALS", "Int Conf Bio-inspired Syst Signal Process"]}, "title": "Biomedical Text Mining: Applicability of Machine Learning-based Natural Language Processing in Medical Database", "abstract": "Machine learning has demonstrated superior performance in solving many problems in various fields of medicine compared to non-machine learning approaches. The aim of this review is to understand how Machine Learning-based Natural Language Processing (ML-NLP) has been applied to the clinical notes databases. Optimization algorithms are listed as examples to demonstrate the simplicity and effectiveness of their applications for clinical notes database. We reviewed the literature in clinical applications of ML-NLP, particularly techniques of deep learning such as mainly in pathology reports of diabetes, schizophrenia, cancer and cardiology, where NLP either on a classical algorithm or with deep learning has been actively adopted. We covered 60 different studies in this domain, focusing on a wide range of medical perspective based algorithms. Machine learning-based approaches combine the benefits of health systems with the expertise and experience of human well-being. From this review, it is clear that these techniques can improve the quantification of diagnosis and prognosis of cases and may create tools to assist patients during diagnosis and treatment. We complete this work by providing guidelines on the applicability of ML-NLP by describing the most relevant libraries to extract medical expressions from clinical reports text that can support clinical decision-making.", "venue": "International Conference on Bio-inspired Systems and Signal Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"pages": "159-166"}, "authors": [{"authorId": "29395807", "name": "N. Mollaei"}, {"authorId": "145196822", "name": "Cátia Cepeda"}, {"authorId": "152794065", "name": "João Rodrigues"}, {"authorId": "2156327549", "name": "Hugo Gamboa"}], "citations": [{"paperId": "e9942d1058ee3623b1ebe1fd047307760141b0ed", "title": "An AI-Driven Clinical Text-Based Decision Support System for Pancreatic Cancer Diagnosis"}, {"paperId": "2f2daa9cb71ad367461fca3ba52e166eef1a49af", "title": "Overview of Chatbots with special emphasis on artificial intelligence-enabled ChatGPT in medical science"}, {"paperId": "181d7a4582fc4901176890cbee3bb3f9a8f8fd56", "title": "X-ray Diffraction Data Analysis by Machine Learning Methods—A Review"}, {"paperId": "054d3c6d09617dcb005c7bd55435675acbffc6a1", "title": "Deep Learning Models for Stock Market Prediction Using Optimization Approach"}, {"paperId": "0dbc5cfa73ed0801854584a770e8fe79f766b4e1", "title": "Detailed Investigation of the use of Text Mining and Natural Language Processing (NLPs) for Cancer Detection"}, {"paperId": "d0c5f901868f6e2cb126fd51b155f631372a9669", "title": "Biomedical Text Classification Using Augmented Word Representation Based on Distributional and Relational Contexts"}, {"paperId": "5a606a1741ab2a6ae6dc00633af73cebdc489c6d", "title": "Occupational health knowledge discovery based on association rules applied to workers’ body parts protection: a case study in the automotive industry"}, {"paperId": "f1817f27d60c7477b66162cfb5f277f3384c2ca0", "title": "Human-Centered Explainable Artificial Intelligence: Automotive Occupational Health Protection Profiles in Prevention Musculoskeletal Symptoms"}]}
