{"paperId": "35df04ad4796093e0609faca030f826b47dd2c67", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Evidence of Demographic rather than Ideological Segregation in News Discussion on Reddit", "abstract": "We evaluate homophily and heterophily among ideological and demographic groups in a typical opinion formation context: online discussions of current news. We analyze user interactions across five years in the r/news community on Reddit, one of the most visited websites in the United States. Then, we estimate demographic and ideological attributes of these users. Thanks to a comparison with a carefully-crafted network null model, we establish which pairs of attributes foster interactions and which ones inhibit them. Individuals prefer to engage with the opposite ideological side, which contradicts the echo chamber narrative. Instead, demographic groups are homophilic, as individuals tend to interact within their own group—even in an online setting where such attributes are not directly observable. In particular, we observe age and income segregation consistently across years: users tend to avoid interactions when belonging to different groups. These results persist after controlling for the degree of interest by each demographic group in different news topics. Our findings align with the theory that affective polarization—the difficulty in socializing across political boundaries—is more connected with an increasingly divided society, rather than ideological echo chambers on social media. We publicly release our anonymized data set and all the code to reproduce our results.1", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-02-15", "journal": {"name": "Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "47286020", "name": "Corrado Monti"}, {"authorId": "2205779426", "name": "Jacopo D'Ignazi"}, {"authorId": "2081249", "name": "Michele Starnini"}, {"authorId": "116041634", "name": "Gianmarco De Francisci Morales"}], "citations": [{"paperId": "13876ab6fb7ae5c778c787c17d9597624aedd2c1", "title": "A Longitudinal Study of Italian and French Reddit Conversations Around the Russian Invasion of Ukraine"}, {"paperId": "1bebd6c86ebe0b34d58833041af5523fbdb58f68", "title": "Navigating Multidimensional Ideologies with Reddit's Political Compass: Economic Conflict and Social Affinity"}, {"paperId": "34b2bb60c3f423967d4db105d4312780c9198658", "title": "Interacting innovation processes"}, {"paperId": "4d2cfe65d32513c58ea8db7e71f5c9ebd2349d83", "title": "Polarized opinion states in static networks driven by limited information horizons"}, {"paperId": "d215c2613270927c450ef41fcd236e6c34f177e1", "title": "INTERACTING INNOVATION PROCESSES: CASE STUDIES FROM REDDIT AND GUTENBERG"}]}
