{"paperId": "35e0d3f43f75e547c072a43c9a66df3156bf826c", "publicationVenue": {"id": "baaccfaa-ab14-4308-bbb6-15df1b0c2646", "name": "Journal of Computers", "type": "journal", "alternate_names": ["J comput", "Journal of computing", "J Comput", "Journal of computer"], "issn": "1796-203X", "alternate_issns": ["2151-9617", "2518-6205"], "url": "http://www.academypublisher.com/jcp/", "alternate_urls": ["http://www.jcomputers.us/", "https://sites.google.com/site/journalofcomputing/", "http://www.journal.computer/Contents/", "http://www.academypublisher.com/jcp/index.html"]}, "title": "A Near Real-Time Approach for Sentiment Analysis Approach Using Arabic Tweets", "abstract": ": Big data storage and real time data analysis are major challenges for IT researchers. The recent massive increase in data has not been accompanied by adequate storage technology and data processing algorithms. Understanding what people think about an idea, a product, a service or a policy is important for individuals, companies and governments. Sentiment analysis process can be used to identify opinions expressed in text on certain subjects. The result accuracy has a direct effect on decision making in both business and government. Our focus in this paper is first to identify the critical issues associated with real-time big data analysis and then to develop a new paradigm on Hadoop Ecosystem with real-time stream data processing to analyze Arabic tweet sentiment on Twitter. To perform real-time analytics, data collection should be performed using Apache Flume in order to move and aggregate all tweets received online (near real-time) to pre-defined locations through a channel called Sinks to the Hadoop distributed file system (HDFS). In addition, due to the serious challenges in Arabic text and speech and the high speed with which tweets arrive, we designed a complex sentiment analysis (SA) module to process each incoming tweet in such a way that no tweets are lost without being analyzed. Also, a sentiment analysis approach to Arabic text was developed using multiple Hive User Defended Functions (UDF). Finally, to guarantee a varied data collection, we proposed a Java MapReduce program for lexicon-based Arabic sentiment analysis, which supports n-gram search in the lexicon. Our approach was applied to determining opinions about MERS virus in the Kingdom of Saudi Arabia on Twitter Public Stream API and the results are discussed.", "venue": "Journal of Computers", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "J. Comput.", "pages": "596-614", "volume": "14"}, "authors": [{"authorId": "2079797092", "name": "Ansi Zarrad"}, {"authorId": "1770016", "name": "I. Alsmadi"}, {"authorId": "3143265", "name": "A. Aljaloud"}], "citations": [{"paperId": "98ac0a988336d04a32f7050653c5c1900109681c", "title": "Extending Adversarial Attacks to Produce Adversarial Class Probability Distributions"}, {"paperId": "377665f62e1de51e019a66a4cfa680d560c5e0ab", "title": "A real-time big data architecture for covid dataset analysis with query on spark"}]}
