{"paperId": "35eb3f9399cf8faf8be5f7177ccaa45dcb06454f", "publicationVenue": null, "title": "AN ENHANCED APPROACH FOR TEST SUITE REDUCTION USING CLUSTERING AND GENETIC ALGORITHMS", "abstract": "Software testing is a procedure used to evaluate the quality, accuracy, and completeness of a generated computer software. It entails a series of actions taken with the goal of identifying software faults so they can be fixed before the product is made available to end users. Testing a program against a collection of inputs known as test cases is one of the most practical ways to find faults in it. Redundant test cases are useless. Besides, they increase the testing effort, testing costs, and testing time. Testing involves spending a lot of time on a lot of unreliable test cases. An excessive cost is wasted when redundant or outdated tests are run that do not increase fault detection capabilities. In this study, the objective is to propose an enhanced approach for test suite reduction to enhance the regression testing process. This is achieved by reducing the time spent in testing by finding a subset of test cases that fulfill the requirements and discovering most of the faults already present. This subset is known as a reduced test suite. A test suite is a set of tests that enables testers to run and report the status of the test execution. Therefore, a clustering-based approach is proposed to considerably minimize the test suite. The proposed approach applies the K-means++ clustering algorithm. Utilizing K-mean++, test cases are grouped into groups depending on their degree of similarity. Then, a multi-objective genetic algorithm is applied to reduce the test suite in each cluster based on code coverage. For any unsupervised clustering algorithm, determining the optimal number of clusters into which the data can be divided is a crucial step. Therefore, two methods were experimented to determine the optimal k : elbow method and silhouette analysis method. The proposed enhanced approach outperformed previously published approaches in terms of test suite reduction and code coverage rate.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2162890910", "name": "Sarah M. Nagy"}, {"authorId": "2390930", "name": "H. A. Maghawry"}, {"authorId": "2576508", "name": "N. Badr"}], "citations": [{"paperId": "c1cd6f7863495f2d923aa3c67c3aaff2aa353148", "title": "ENHANCED REGRESSION TESTING EXECUTION PROCESS USING TEST SUITE REDUCTION TECHNIQUES AND PARALLEL EXECUTION"}]}
