{"paperId": "35eb8d1320178dc086c212349d551f52ec81af25", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Efficient Task Allocation for Computation Offloading in Vehicular Edge Computing", "abstract": "In vehicular edge computing, the edge servers may be overloaded once too many vehicles request the task offloading service, which will cause task offloading failure or the high service delay. To provide high-quality VEC service, the processing capabilities of the vehicles, the edge servers, and the cloud should be utilized simultaneously in task offloading. In this article, we focus on task offloading allocation for the requesting vehicle and the pricing schemes for the edge server and the cloud. From a market perspective, we model the competition and cooperation among the requesting vehicle, the edge server, and the cloud as a Stackelberg game. Then, based on the backward induction method, we transform the game problem into a convex optimization problem and theoretically prove that the game has a unique Nash equilibrium, thereby the optimal task allocation for the requesting vehicle can be obtained. Meanwhile, a genetic algorithm-based searching algorithm is proposed to find the optimal pricing schemes for the edge server and the cloud, and the proposed algorithm has a rapid convergence due to the convex feature of the objective problem. Simulation results demonstrate that the proposed task allocation strategy has better performance than other solutions in terms of task offloading delay and cost, thus, can make the existing resources fully used to undertake more offloading tasks.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5595-5606", "volume": "10"}, "authors": [{"authorId": "2148906875", "name": "Zheng Zhang"}, {"authorId": "2054266330", "name": "Feng Zeng"}], "citations": [{"paperId": "9839a923aae266dd74f7b90fda159faa588d6533", "title": "Cost-effective task partial offloading and resource allocation for multi-vehicle and multi-MEC on B5G/6G edge networks"}, {"paperId": "b0f85dc0e6f82136de5e477bb4cdaef6589a6c1b", "title": "Task offloading in MEC systems interconnected by metro optical networks: A computing load balancing solution"}, {"paperId": "700039f4ad13827ca52742993f29d8619ff25cb7", "title": "Research on Offloading Strategy for Mobile Edge Computing Based on Improved Grey Wolf Optimization Algorithm"}, {"paperId": "cf13582ada0f5ace9a614c1aa7f152fa4b68da5f", "title": "Parked vehicles crowdsourcing for task offloading in vehicular edge computing"}, {"paperId": "f8afda0f5010c4d205797727c8a09c65c145d7d8", "title": "Vehicular Edge-Computing Framework for Making Use of Parking and Charging Electric Vehicles"}]}
