{"paperId": "35ee05c2e1375367a2cd212f57089dba236b6bd1", "publicationVenue": null, "title": "NEW JOB POSITIONS AND RECRUITMENT OF EMPLOYEES SHAPED BY BLOCKCHAIN TECHNOLOGIES", "abstract": "Blockchain as a new tech trend with dynamic development has the real potential to change every industry and company. In this paper are examined the impacts that blockchain has on human resource management – establishment of new job positions and changes in the recruitment process. Application of blockchain technologies in organizations creates not only new technological jobs and positions, but also new jobs and positions in other professions. Due to blockchain technologies, recruitment process will be less time consuming with lover cost and with increased overall quality of recruitment.", "venue": "", "year": 2018, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "152528655", "name": "J. Lukić"}, {"authorId": "65876402", "name": "Serbia Belgrade"}, {"authorId": "73461036", "name": "H. Salkić"}, {"authorId": "2076008472", "name": "B. Ostojić"}], "citations": [{"paperId": "19766ca5a36faf930ba930c62c471f7c24acaa8b", "title": "Interdisciplinary technical perspective: transformation of blockchain and opportunities for organizational training"}, {"paperId": "71e797a141d683757f06ac416bcf1f4bc22e07dd", "title": "Revolutionising HRM practice with blockchain technology: unleashing disruptive paradigms of work and overcoming management challenges"}, {"paperId": "7ac8bc7de1f8a362db831c16b8b58046142750e6", "title": "Exploratory Research on the Use of Blockchain Technology in Recruitment"}, {"paperId": "4890e50d89d1063df0f2fa7d95db1b3dabea0db3", "title": "BC-HRM: A Blockchain-Based Human Resource Management System Utilizing Smart Contracts"}, {"paperId": "a8b3e72ee1fc81d29c2d3d7529b1dc93d510cbf0", "title": "Investigating the Demand for Blockchain Talents in the Recruitment Market: Evidence from Topic Modeling Analysis on Job Postings"}, {"paperId": "aa09028f7692126a7ebf9be99de101b633728659", "title": "Blockchain Applications in Human Resources Management: Opportunities and Challenges"}, {"paperId": "49525809a7b37ca07fd418a0c114c7d138f0e8f1", "title": "The Impact of Blockchain Technology on Human Resource Management"}, {"paperId": "86f126f4b1d28144c5316342a72a598ea0f4639e", "title": "Reshaping Banking Industry Through Digital Transformation"}]}
