{"paperId": "35f42fd36b648721d4ebf4f009e0c61628749390", "publicationVenue": {"id": "18be6e14-0ac5-454e-b78d-100e2dddd04e", "name": "International Journal of Advanced Research in Science, Communication and Technology", "type": "journal", "alternate_names": ["Int J Adv Res Sci Commun Technol"], "issn": "2581-9429"}, "title": "Big Data with IoT to Develop Sustainability", "abstract": "Things- or internet-oriented perspective, the Internet of Things (IoT) is a collection of unrelated networks that are linked and addressed by a common communications protocol [1]. When using sensors that send complex data at fast speeds via the industrial Internet, it might be challenging to give accurate and practical insights. Since the machine's underlying dynamic patterns vary over time due to a variety of variables, including degradation, processing large amounts of data is a significant problem. The actionable model must now be updated because it has become dated as a result. In the article, a brand-new deep learning technique called Gaussian-dependent dynamic probabilistic clustering (GDPC) is proposed. Models for usage in complicated situations that are built on the fusion and optimization of three well-known techniques. The Page-Hinkley test with the Chernoff constraint had been used to detect concept drifts, and the expectation-maximization (EM) approach had been used to estimate parameter values. In contrast to previous irregular models, GDPC's model gives membership probabilities to clusters. When a concept drift can be identified using a Brier score analysis, this can discover the robustness and evolution of the instance assignment. Additionally, the technique uses a tiny quantity of data, which significantly minimises the amount of processing power needed to determine whether the model should be changed. The method may be evaluated on artificial data and data streams from a test bed where different operational circumstances are automatically recognised with satisfactory results in terms of classification accuracy, sensitivity, and characteristics [2]. The typical behaviour of private autos is derived from trajectory data.", "venue": "International Journal of Advanced Research in Science, Communication and Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-07", "journal": {"name": "International Journal of Advanced Research in Science, Communication and Technology"}, "authors": [{"authorId": "2230981799", "name": "Gaurav Singh"}], "citations": []}
