{"paperId": "35f74b71f5de3fe6ee81533fd2fe4511c77ef514", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Streamlining geospatial data processing for isotopic landscape modeling", "abstract": "Stable isotopic landscape modeling has become a promising approach for answering research questions in multiple disciplines. However, its application has been hindered by the difficulty for individual researchers to collect, compile, and integrate environmental and isotopic data over large spatial and temporal scales and to develop and interpret geostatistical models. To address these challenges, we developed IsoMAP (http://isomap.org), a science gateway that enables researchers to access and integrate a number of disparate and diverse datasets, develop isoscape models over selected spatiotemporal domains using geostatistical algorithms, predict maps for the stable isotopic ratios, and associate a sample's isotope value with its most likely geographic origin. One main challenge in developing IsoMAP is to efficiently integrate large heterogeneous datasets into the modeling workflow to ensure real‐time query response and timely data update. In this paper, we described how the geospatial data processing workflow was implemented in the initial version of gateway and how it has been improved by leveraging the built‐in vector and raster data processing capabilities and the materialized view object of the PostgreSQL/PostGIS database. Our experience and lessons learned will be applicable to the development of other geospatial data workflows, a common task in the cyberinfrastructure of many science disciplines.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-13", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "1851016", "name": "Jungha Woo"}, {"authorId": "152665191", "name": "Lan Zhao"}, {"authorId": "2218164", "name": "G. Bowen"}], "citations": [{"paperId": "ff791f54f9cbff213553366c5c8ad27e1a458a62", "title": "Leaf water δ18O, δ2H and d‐excess isoscapes for Australia using region‐specific plant parameters and non‐equilibrium vapour"}, {"paperId": "cdc3596f0133c7a97cc40157b78bc860d45cb865", "title": "The validation case on invasive crustaceans of the LifeWatch ERIC Internal Joint Initiative: State of the art and next steps forward"}, {"paperId": "f6f5d46f83339464c1aa58fff0f712454af4ca63", "title": "Editorial: Science Gateways Special Issue 2020"}]}
