{"paperId": "35ffb6d3bdf1912982c7ebdfbaf4e27a0caa27db", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "A Survey on Digital Forensics in Internet of Things", "abstract": "Internet of Things (IoT) is increasingly permeating peoples’ lives, gradually revolutionizing our way of life. Due to the tight connection between people and IoT, now civil and criminal investigations or internal probes must take IoT into account. From the forensic perspective, the IoT environment contains a rich set of artifacts that could benefit investigations, while the forensic investigation in IoT paradigm may have to alter to accommodate characteristics of IoT. Therefore, in this article, we analyze the impact of IoT on digital forensics and systematize the research efforts made by previous researchers from 2010 to 2018. We sketch the landscape of IoT forensics and examine the state of IoT forensics under a 3-D framework. The 3-D framework consists of a temporal dimension, a spatial dimension, and a technical dimension. The temporal dimension walks through the standard digital forensic process while the spatial dimension explores where to identify sources of evidence in IoT environment. These two dimensions attempt to provide principles and guidelines for standardizing digital investigations in the context of IoT. The technical dimension guides a way to the exploration of tools and techniques to ensure the enforcement of digital forensics in the ever-evolving IoT environment. Put together, we present a holistic overview of digital forensics in IoT. We also highlight open issues and outline promising suggestions to inspire future study.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-01-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1-15", "volume": "7"}, "authors": [{"authorId": "31017289", "name": "Jianwei Hou"}, {"authorId": "2144464160", "name": "Yuewei Li"}, {"authorId": "49402890", "name": "Jingyang Yu"}, {"authorId": "39071854", "name": "Wenchang Shi"}], "citations": [{"paperId": "5364218e6f91400dd6a5fe1634c4b618ec9d94b4", "title": "Comparative study of IoT forensic frameworks"}, {"paperId": "7a0fb93c2855012616b372c6c369b6bd0569490c", "title": "Digital Investigation Forensic Model with P2P Timestamp Blockchain for Monitoring and Analysis"}, {"paperId": "ae129b56b235c9dd5f82a58dad6fb6f6204f6a41", "title": "KFREAIN: Design of A Kernel-Level Forensic Layer for Improving Real-Time Evidence Analysis Performance in IoT Networks"}, {"paperId": "3f1bed2b78102fe5b54bb6a95f94da92fda17a19", "title": "Unlocking the Future: Fostering Human–Machine Collaboration and Driving Intelligent Automation through Industry 5.0 in Smart Cities"}, {"paperId": "f3f1e6fb9c19ae7f3f4f2c91f28b54114e494fb1", "title": "T-FIM: Transparency in Federated Identity Management for Decentralized Trust and Forensics Investigation"}, {"paperId": "fa466ee11f127da425f948c23b7404eefbcfeed8", "title": "Forensic Data Analytics for Anomaly Detection in Evolving Networks"}, {"paperId": "de6e053dd9f21d1a22afce7e0bfe6deb027dc023", "title": "Digital Forensic Analysis of Hologram Projection Fans"}, {"paperId": "98db915c4fbf65660a4b26a971e3f57445117ab7", "title": "Digital Forensics Investigation and Incident Response in Internet of Things (IoT-DFIR): Challenges and Models"}, {"paperId": "d52d05c98f835995817b21ae7f1bac9ae887135f", "title": "Unmasking Cybercrime with Artificial-Intelligence-Driven Cybersecurity Analytics"}, {"paperId": "22a58f246a32efefa446fc27f26ffb0b8238d438", "title": "A Concept Forensic Methodology For The Investigation Of IoT Cyberincidents"}, {"paperId": "c5ea055a5ad4111dddf1fff2683a6bd4eda3efdf", "title": "A Novel Machine Learning Approach for Person Identification and Validation using Digital Forensics Methods"}, {"paperId": "80a0878cdeb00dbce3cec8f16d64598a04f006bb", "title": "Internet of Things and Digital Forensics: Recent Studies and Challenges"}, {"paperId": "85531daaec75d733cfd1bb570ad451e42959fd8d", "title": "Machine Learning-Based Non-Intrusive Digital Forensic Service for Smart Homes"}, {"paperId": "72115b9139c5ac07efd35df96a5d6b5aa2c8adb0", "title": "Forensics in the Internet of Things: Application Specific Investigation Model, Challenges and Future Directions"}, {"paperId": "6958cd8badef383b693a2a012831272f0f60f631", "title": "Digital Forensics in the Age of Smart Environments: A Survey of Recent Advancements and Challenges"}, {"paperId": "9cdc4e31525b07234cc240ae4a598466104a7dc3", "title": "Smart Home IoT Forensics: Current Status, Challenges, and Future Directions"}, {"paperId": "d8c5d6e72a3637d3bb2572588f3122f9bdf33e16", "title": "Cybersecurity and Cyber Forensics for Smart Cities: A Comprehensive Literature Review and Survey"}, {"paperId": "26cea3abd30d8b4284292ba99c99264a22d8604b", "title": "TAARA Method to Processing on the Network Forensics in the Event of an ARP Spoofing Attack"}, {"paperId": "e4b2050a40edc9dcade1cf4187ba149edef7b555", "title": "Agile Methodologies Applied to the Development of Internet of Things (IoT)-Based Systems: A Review"}, {"paperId": "4e16007f7ada8bcd043b1134175a3d9cb92935ee", "title": "Anomaly Detection In IoT Networks Using Hybrid Method Based On PCA-XGBoost"}, {"paperId": "7347c469988075c48e700b933b96cbc3ff428389", "title": "Forensic Analysis of IoT File Systems for Linux-Compatible Platforms"}, {"paperId": "635e6ba2d0378515721103b870a61d94be4d933d", "title": "A systematic literature review of blockchain-based Internet of Things (IoT) forensic investigation process models"}, {"paperId": "27ab987b0fcb5af444101c95d694d65b9c544a99", "title": "Digital forensic analysis of intelligent and smart IoT devices"}, {"paperId": "3a202c95d9de37a7c4611d6ca18afce525edf41b", "title": "Research on IoT Forensics System Based on Blockchain Technology"}, {"paperId": "dcd8fc01361f42efb5e2402c3df74a000535ab2f", "title": "ATLE2FC: Design of an Augmented Transfer Learning Model for Explainable IoT Forensics using Ensemble Classification"}, {"paperId": "a4a8cc7fd2203339fc277f7015ea7e4d2c09d828", "title": "Landscape of IoT security"}, {"paperId": "720c24899ed55ad6b565d347b304a516a83c29f5", "title": "Roadmap of Digital Forensics Investigation Process with Discovery of Tools"}, {"paperId": "2039c4e9870c01dc8d301136ca93e3d24563ff8a", "title": "Chew’s Second Delaunay Triangulation Refinement Scheme for Optimal RSUs Deployment to Ensure Maximum Connectivity in Vehicle to Infrastructure Communication"}, {"paperId": "da0ff1b2b8192328dd4fe9494e25e8ff6e7dba39", "title": "RETRACTED ARTICLE: A User-Centric Machine Learning for Learning Support System with Adequate Cyber Security"}, {"paperId": "14165a25938d86ce915e2a97ecf97ec3e36de50a", "title": "Research Trends, Challenges, and Emerging Topics in Digital Forensics: A Review of Reviews"}, {"paperId": "2f6297c24c9fda965843528ac8cf5407d6e704ed", "title": "RPC: Representative possible world based consistent clustering algorithm for uncertain data"}, {"paperId": "9565563312fdba20a6d1e4cd501f4370f0936c5a", "title": "A centralized hybrid routing model for multicontroller SD‐WANs"}, {"paperId": "722438ed4448840ad0bcd5c1f69fe7c7e7c21a74", "title": "IoT Ethic In Scientific Communications"}, {"paperId": "3e6dab72453171c619f22e838d4220bf2e7c69e8", "title": "Internet of things forensic data analysis using machine learning to identify roots of data scavenging"}, {"paperId": "916ead5d502f90e89d95eda19e6eb418fc049476", "title": "Forensics and Anti-Forensics of a NAND Flash Memory: From a Copy-Back Program Perspective"}, {"paperId": "1cb187d032707f4879525a099163323570859631", "title": "A New Face Detection Framework Based on Adaptive Cascaded Network"}, {"paperId": "c051d7daded45f4b968d5a874df29feb50a7ba89", "title": "A context-centered methodology for IoT forensic investigations"}, {"paperId": "66209bbbe2c2e5ff9d04bd9d2300978cd917430f", "title": "PLFG: A Privacy Attack Method Based on Gradients for Federated Learning"}, {"paperId": "95990b0683ec4cd335202add601a09c24c6e654a", "title": "A Node Location Method in Wireless Sensor Networks Based on a Hybrid Optimization Algorithm"}, {"paperId": "a9857a1dcc420d61eb2dd98a78a9bf982a57f644", "title": "Internet of Things (IoT) Characteristics, Applications, and Digital Forensics Investigation Process: A Review"}, {"paperId": "1f3bf575df03eba1811e415cd857b3163a438478", "title": "Rule-Based Approach to Detect IoT Malicious Files"}, {"paperId": "71285cbe16117240aa3a17966c5f245fc9b2d921", "title": "A Survey on Device Behavior Fingerprinting: Data Sources, Techniques, Application Scenarios, and Datasets"}, {"paperId": "149908df20500f6670b28a3cf9a2e56faa560cd8", "title": "Service cost-based resource optimization and load balancing for edge and cloud environment"}, {"paperId": "44fee8716fa9b17704169f169e163872335f8287", "title": "Secure and Private Smart Grid: The SPEAR Architecture"}, {"paperId": "39e73349a3e95e0aa65970b7e8dfb13719c63f5f", "title": "A dynamic priority strategy for IoV data scheduling towards key data"}, {"paperId": "8b9999f77748e292f321864f4d05783f7c23205b", "title": "Reliability in Internet of Things: Current Status and Future Perspectives"}, {"paperId": "dfc17ceaa9f5a0f2af7410346d60c1c0c38350f3", "title": "Convex\n multi‐objective\n optimization for a hybrid fuel cell power system of more electric aircraft"}, {"paperId": "d11d97e7026d661c5ea2396536e91de5fe2773bf", "title": "A Survey on Industrial Control System Digital Forensics: Challenges, Advances and Future Directions"}, {"paperId": "40b0dcfcc08a54b3b08eff12cdf693b300d02cd1", "title": "A Survey on Threat Hunting in Enterprise Networks"}, {"paperId": "ee6181e00d5134fb81181ad2bf50f0138a903830", "title": "The Truth Shall Set Thee Free: Enabling Practical Forensic Capabilities in Smart Environments"}, {"paperId": "e3b8a06dc6284e9cc530a5153f0df3ba0231ebd0", "title": "New Diagnostic Forensic Protocol for Damaged Secure Digital Memory Cards"}, {"paperId": "262ef80729f8627ad548abd421a2d4196201abba", "title": "A Deep Learning Approach for Identifying User Interest from Targeted Advertising"}, {"paperId": "67c00706a58ba6557bef37e06875d2e894204fca", "title": "A cross-domain qualitative meta-analysis of digital forensics: Research trends, challenges, and emerging topics"}, {"paperId": "299fb55be4a18b7ff99020c064c5c7751e829b9e", "title": "IoT - Tool of Society 4.0 - Literary Review"}, {"paperId": "a3ee6caf04d1dd598ef97a0deb981d89ebc13bf7", "title": "Artificial Intelligence Security Threat, Crime, and Forensics: Taxonomy and Open Issues"}]}
