{"paperId": "3611fe53bdd5fa53210766e671d48406239e0fa7", "publicationVenue": {"id": "3f2626a8-9d78-42ca-9e0d-4b853b59cdcc", "name": "IEEE International Conference on Robotics and Automation", "type": "conference", "alternate_names": ["International Conference on Robotics and Automation", "Int Conf Robot Autom", "ICRA", "IEEE Int Conf Robot Autom"], "issn": "2152-4092", "alternate_issns": ["2379-9544"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000639", "alternate_urls": ["http://www.ncsu.edu/IEEE-RAS/"]}, "title": "Detecting spatio-temporal Relations by Combining a Semantic Map with a Stream Processing Engine", "abstract": "Changes in topological spatial relations of objects are often strong indicators for state transitions in the underlying processes they are involved in. While various aspects of semantic mapping have been extensively researched, the reasoning about the temporal development of spatial relations of instances is often neglected. This paper presents a concept to combine a semantic map with a stream processing framework for live analysis of the spatio-temporal relation of objects, based on the map and information inferred from sensors streams. To demonstrate the functionality of our concept, we implemented a proof-of-concept system to track everyday events in an office environment. The presented application scenario clearly demonstrates the benefits of the proposed architecture for detecting and handling complex spatio-temporal events.", "venue": "IEEE International Conference on Robotics and Automation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-29", "journal": {"name": "2023 IEEE International Conference on Robotics and Automation (ICRA)", "pages": "8224-8230"}, "authors": [{"authorId": "2221117701", "name": "Lennart Niecksch"}, {"authorId": "1896536", "name": "Henning Deeken"}, {"authorId": "2391101", "name": "T. Wiemann"}], "citations": []}
