{"paperId": "361466b468a3e6da9709459afc2bcd2ec13863b1", "publicationVenue": {"id": "45153c2d-728b-40e7-b147-2ac0912a916e", "name": "ACS/IEEE International Conference on Computer Systems and Applications", "type": "conference", "alternate_names": ["ACS/IEEE Int Conf Comput Syst Appl", "AICCSA"], "url": "http://www.arabcomputersociety.org/"}, "title": "Empowering Data Federation Security in Polystore Systems", "abstract": "Integrating data from multiple sources with different native data models can be a demanding task that requires significant manual effort. Polystore is a new federated database view designed to enable polyglot querying across diverse data models. This paper aims to discuss the most significant security challenges associated with data federation. We identify the key privacy risks hindering polystore technologies and highlight the gap between traditional data protection approaches and current security issues. Moreover, we present a reference architecture as an active solution to significantly improve data usage in compliance with upstream security policies. Access control is the most widely-accepted reference in the database community for dealing effectively with this type of problem. In this context, we propose an access control mechanism that increases the resilience of the Polystore through Moving Target Defense (MTD) concept. Our approach is intended to address the security focus on privacy risks associated with Polystore technologies, and to enhance their adoption in modern data-driven applications.", "venue": "ACS/IEEE International Conference on Computer Systems and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-04", "journal": {"name": "2023 20th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA)", "pages": "1-8"}, "authors": [{"authorId": "1390149836", "name": "Juba Agoun"}, {"authorId": "2294755251", "name": "Juba Terras"}, {"authorId": "153086065", "name": "Mohand-Saïd Hacid"}, {"authorId": "2149605512", "name": "Salim Hariri"}], "citations": []}
