{"paperId": "361876b764524897c39289b983dbae8fd7676bf5", "publicationVenue": {"id": "070a8b94-9234-4a39-bff0-23e0c6b74464", "name": "International Conference on Statistical and Scientific Database Management", "type": "conference", "alternate_names": ["Stat Sci Database Manag", "SSDBM", "Statistical and Scientific Database Management", "Int Conf Stat Sci Database Manag"], "url": "http://www.ssdbm.org/"}, "title": "We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomist", "abstract": "This paper explains the demonstration of the DataEconomist, a framework for policy-based SQL query classification according to data-privacy directives. Our framework automatically derives query meta-information based on query-log analysis and provides user-friendly, graphical interfaces for browsing and filtering queries based on this meta-information. We aim to complement existing data-privacy approaches and enable privacy officers to define domain-specific compliance policy rules based on the graphical filter mechanisms. Policies automatically classify queries as compliant or non-compliant regarding their processing of personal data. During our demonstration, conference attendees assess our system in several scenarios. They filter queries based on various query meta-information, learn how to define compliance policies for automatic query classification without profound technical knowledge, and test this classification by formulating non-compliant queries.", "venue": "International Conference on Statistical and Scientific Database Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-07-07", "journal": {"name": "Proceedings of the 32nd International Conference on Scientific and Statistical Database Management"}, "authors": [{"authorId": "2697151", "name": "Peter K. Schwab"}, {"authorId": "1415884203", "name": "Maximilian S. Langohr"}, {"authorId": "1399432410", "name": "K. Meyer-Wegener"}], "citations": [{"paperId": "10e4574708f6c9583bfd29a5a8f4a501921abf5b", "title": "Performance Evaluation of Policy-Based SQL Query Classification for Data-Privacy Compliance"}, {"paperId": "fd2f8524347680e1b0e5c5585f412e449908f472", "title": "Towards Evolutionary, Domain-Specific Query Classification Based on Policy Rules"}]}
