{"paperId": "36196cf9b18de6c18a81c1ca2eef68c82935e52c", "publicationVenue": {"id": "6dd05db1-df4c-4237-bcc7-46e0d2cc7266", "name": "International Conference on Parallel and Distributed Computing: Applications and Technologies", "type": "conference", "alternate_names": ["Parallel Distrib Comput Appl Technol", "Int Conf Parallel Distrib Comput Appl Technol", "PDCAT", "Parallel and Distributed Computing: Applications and Technologies"]}, "title": "Entity Fiber Based Partitioning, No Loss Staging and Fast Loading of Log Data", "abstract": "Real time analysis of fine granularity of log data can help people gain personalized insights on business. For example, real time analysis of e-commerce log data will help us learn recent changes of browsing and shopping behavior of specific customers, which enables us to provide personalized recommendations. To accomplish such analysis, log data should have been loaded quickly into data warehouse without loss. This paper proposes a no loss staging and fast loading solution for log data. Based on open sourced tools such as Kafka, HDFS, and Spark, we have designed and implemented an entity fiber based log data partitioning and staging method, as well as a parallel loading algorithm. Our scheme achieves a data staging performance of around 390,000 records/s, and a data loading performance of around 160,000 records/s.", "venue": "International Conference on Parallel and Distributed Computing: Applications and Technologies", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-12-01", "journal": {"name": "2016 17th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT)", "pages": "199-203"}, "authors": [{"authorId": "40662005", "name": "Xiongpai Qin"}, {"authorId": "1743832", "name": "Yueguo Chen"}, {"authorId": "2071131429", "name": "Guodong Jin"}, {"authorId": "2152801248", "name": "Yang Liu"}, {"authorId": "17295035", "name": "Yiming Cong"}, {"authorId": "144589756", "name": "Xiaoyong Du"}], "citations": [{"paperId": "e25f6e0556dd74522b6357cb736c899f5f5ccd99", "title": "Interactive Entity Centric Analysis of Log Data"}]}
