{"paperId": "361b8d380091cb5fffe809bdc61c22fb212a9abb", "publicationVenue": null, "title": "VNF Deployment and Flow Scheduling in Geo-Distributed Data Centers", "abstract": "Network Function Virtualization (NFV) is a potential solution in the evolution of economical network to reduce acquisition and maintenance costs for network service providers. NFV decouples functionality of network function from the physical infrastructure. By running virtual network functions (VNF) on commodity hardware, NFV promises to make the network more flexible and controllable, and alleviates problems of traditional networks such as the expensive cost for expansion and maintenance. However, there are still many technical challenges, especially for efficiently deploying VNFs and scheduling network flows in geo-distributed data centers. In this paper, we investigate this problem towards minimizing both deployment cost and communication cost. This problem is formulated into a mixed-integer linear programming problem. We further propose a relaxation-based algorithm to deal with the computational complexity. Finally, extensive experiment results show that the proposed algorithm can efficiently reduce the total deployment cost and communication cost.", "venue": "2018 IEEE International Conference on Communications (ICC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-05-20", "journal": {"name": "2018 IEEE International Conference on Communications (ICC)", "pages": "1-6"}, "authors": [{"authorId": "144204231", "name": "Lin Gu"}, {"authorId": "2109079557", "name": "Xiaoxiao Chen"}, {"authorId": "145914256", "name": "Hai Jin"}, {"authorId": "145053994", "name": "Feng Lu"}], "citations": [{"paperId": "6f4e1ffe894091369996351659136d80899d673b", "title": "A survey on the placement of virtual network functions"}, {"paperId": "09805ec2320ac87a3eaf240a089c0f878786bcb7", "title": "Column Generation Based Service Function Chaining Embedding in Multi-Domain Networks"}, {"paperId": "e978cda086452a75f71329b936cbc3a8306919f8", "title": "Optimal VNF Placement and Traffic Steering using Column Generation"}, {"paperId": "cd10951e6651214eb896a1d3c90df1b330e14ffd", "title": "Trusted Cloud-Edge Network Resource Management: DRL-Driven Service Function Chain Orchestration for IoT"}, {"paperId": "f98ebe46a5050cf211d270e0e43823d8e22aac1a", "title": "Virtualized Network Function Provisioning in Stochastic Cloud Environment"}, {"paperId": "69395da3fcf41630701ce5585dfd7e887b93fe22", "title": "Dynamic network service deployment across multiple SDN domains"}, {"paperId": "9992c0f0f1e585b1f295f9c909ab2f6702a51157", "title": "On communication efficient dataflow computing in software defined networking enabled cloud"}, {"paperId": "403612f069be5722c20e0b6571fed4d108712524", "title": "Cost-Efficient Virtual Network Function Placement and Traffic Steering"}, {"paperId": "ece0a08b8d00e8661c53849ea1b8295f67b4f462", "title": "Markov Approximation Method for Optimal Service Orchestration in IoT Network"}, {"paperId": "a2e6e6e644f552c091a03bb9b95554a7de573c0a", "title": "A DRL-Based Container Placement Scheme with Auxiliary Tasks"}, {"paperId": "17b8a1286c8f550280d1e932a9a496b70a647fcd", "title": "Service Chain Orchestration Based on Deep Reinforcement Learning in Intent-Based IoT"}]}
