{"paperId": "361d5e09f2e5de0f60d791bb8adf62089a694bd2", "publicationVenue": {"id": "bbc6980e-ed1b-4a82-a44b-9c20574e289d", "name": "Journal of Systems Research", "type": "journal", "alternate_names": ["J Syst Res"], "issn": "2770-5501"}, "title": "[Tool] Designing Replicable Networking Experiments With Triscale", "abstract": "When designing their performance evaluations, networking researchers often encounter questions such as: How long should a run be? How many runs to perform? How to account for the variability across multiple runs? What statistical methods should be used to analyze the data? Despite their best intentions, researchers often answer these questions differently, thus impairing the replicability of their evaluations and the conﬁdence in their results. In this paper, we propose a concrete methodology for the design and analysis of performance evaluations. Our approach hierarchically partitions the performance evaluation into three timescales, following the principle of separation of concerns. The idea is to understand, for each timescale, the temporal characteristics of variability sources, and then to apply rigorous statistical methods to derive performance results with quantiﬁable conﬁdence in spite of the inherent variability. We implement this methodology in a software framework called TriScale . For each performance metric, TriScale computes a variability score that estimates, with a given conﬁdence, how similar the results would be if the evaluation were replicated; in other words, TriScale quantiﬁes the replicability of evaluations. We showcase the practicality and usefulness of TriScale on four different case studies demonstrating that TriScale helps to generalize and strengthen published results. Improving the standards of replicability in networking is a complex challenge. This paper is an important contribution to this endeavor; it provides networking researchers with a rational and concrete experimental methodology rooted in sound statistical foundations. The ﬁrst of its kind.", "venue": "Journal of Systems Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-22", "journal": {"name": "J. Syst. Res.", "volume": "1"}, "authors": [{"authorId": "3425324", "name": "Romain Jacob"}, {"authorId": "1736614", "name": "Marco Zimmerling"}, {"authorId": "2143859", "name": "C. Boano"}, {"authorId": "2562998", "name": "L. Vanbever"}, {"authorId": "143980067", "name": "L. Thiele"}], "citations": [{"paperId": "3a951c26338b4d2203cfde2c91aa216b68e9a91e", "title": "Challenges and recent advances in the design of real-time wireless Cyber-Physical Systems"}, {"paperId": "a16434fe80140190819c1eb074146a19de6a6d1b", "title": "Experimental Evaluation of the Layered Flow-Based Autonomous TSCH Scheduler"}, {"paperId": "99e7b0019a9ee41a091b8b64914a0d57e9e0198b", "title": "Autonomous Flow-Based TSCH Scheduling for Heterogeneous Traffic Patterns: Challenges, Design, Simulation, and Testbed Evaluation"}, {"paperId": "3cfa71ba965b9f3aa97221192af7286c2561f038", "title": "Poster: Automatic Parameter Exploration for Low-Power Wireless Protocols"}]}
