{"paperId": "362555d9e7d2f5b8f16e9d7973863a4964bd763c", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "K-Means Clustering Algorithm Based on Memristive Chaotic System and Sparrow Search Algorithm", "abstract": "With the advent of the big data era, it is vital to explore the information involved in this type of data. With the continuous development of higher education, the K-means clustering algorithm is widely used to analyze students’ academic data. However, a significant drawback of this method is that it is seriously affected by initial centroids of clustering and easily falls into local optima. Motivated by the fact that the chaos and swarm intelligence algorithm are frequently combined, we propose an approach for data clustering by Memristive Chaotic Sparrow Search Algorithm (MCSSA) in this paper. First, we introduce a memristive chaotic system, which has a property of conditional symmetry. We use the sequences generated by the memristive chaotic system to initialize the location of the sparrows. Then, MCSSA is applied before K-means for finding the optimal locations in the search space. Those locations are used as initial cluster centroids for the K-means algorithm to find final data clusters. Finally, the improved clustering algorithm is applied to the analysis of college students’ academic data, demonstrating the value and viability of the approach suggested in this paper. Through empirical research, it is also confirmed that this method can be promoted and applied.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-28", "journal": {"name": "Symmetry", "pages": "2029", "volume": "14"}, "authors": [{"authorId": "2186567218", "name": "Yilin Wan"}, {"authorId": "2071148370", "name": "Qi Xiong"}, {"authorId": "2186567075", "name": "Zhiwei Qiu"}, {"authorId": "2186629574", "name": "Yaohan Xie"}], "citations": [{"paperId": "1733780ba31c9c7e86a170cd0d99303340c2e040", "title": "Special Issue Editorial: \"Discrete and Continuous Memristive Nonlinear Systems and Symmetry\""}]}
