{"paperId": "36376c50ecfae0fc064a16b6a98a44fb64f05263", "publicationVenue": {"id": "f9f6fa4f-558c-4f4b-b702-6e707e8b5d57", "name": "Frontiers in Communications and Networks", "alternate_names": ["Front Commun Netw"], "issn": "2673-530X", "url": "https://www.frontiersin.org/journals/communications-and-networks#"}, "title": "Role of Wireless Communication in Healthcare System to Cater Disaster Situations Under 6G Vision", "abstract": "The natural disasters created by infectious diseases have a formidable impact on people and societies. Without affecting the city infrastructure, pandemics leave the places abandoned because of the shortage of human resources, either due to deaths, illness, or unwillingness to work because of health risks. However, providing a timely response can prevent losses from occurring due to the virus dissemination. Since the first reported case of influenza in 1918 to the current pandemic Coronavirus Disease-2019 (COVID-19), the system playing a key role in saving human lives is healthcare. Nowadays, smart healthcare system development is a popular trend and wireless communication is the backbone of such systems. To provide patients with diagnosis, treatments, and several health services both within hospitals and remotely, all the healthcare units must be equipped with advanced technologies. A rapid response unit is also required to handle the thrust of the patients and queries generated during disasters. This paper discusses healthcare communication challenges and possible solutions for early awareness and rapid response in disaster situations under the human-centric vision of sixth-generation wireless technologies.", "venue": "Frontiers in Communications and Networks", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-12-15", "journal": {"volume": "1"}, "authors": [{"authorId": "40576267", "name": "Muhammad Bilal Janjua"}, {"authorId": "1423645042", "name": "Ahmet Enes Duranay"}, {"authorId": "143977219", "name": "H. Arslan"}], "citations": [{"paperId": "615802c88cd9c07374476588cd4b6937d77864eb", "title": "Intelligent block copolymer self-assembly towards IoT hardware components"}, {"paperId": "739c1797f7e24915bb2d8b8b8c0e14b1cd732382", "title": "6G and intelligent healthcare: Taxonomy, technologies, open issues and future research directions"}, {"paperId": "9c51c1cad4820cefebbc63273e03e91dfd6157ac", "title": "Computer vision-aided mmWave communications for indoor medical healthcare"}, {"paperId": "1ef69bd4932b9ede4568a9d17c43ccea933949c6", "title": "Resource management in multi-heterogeneous cluster networks using intelligent intra-clustered federated learning"}, {"paperId": "eb9a2ca33a8e66d980eecc718ce9340900a38e75", "title": "The 6G Ecosystem as Support for IoE and Private Networks: Vision, Requirements, and Challenges"}, {"paperId": "65853a2c914f610a154f1cf990c62e1d35e456ef", "title": "Fuzzy Network Based 6G Framework for Healthcare Applications"}, {"paperId": "7b4f6b5ac30a1d640f56af421bc67d19678f6751", "title": "A blockchain-based secured system using the Internet of Medical Things (IOMT) network for e-healthcare monitoring"}, {"paperId": "12195bbaaa05b5c8e23fd6389c2db2a87021a532", "title": "High Throughput and Low Latency Wireless Communication System using Bandwidth-Efficient Transmission for Medical Internet of Thing"}, {"paperId": "d91f464c4207b62744bcd8341ed7d8d51afecc54", "title": "Exploring the Role of 6G Technology in Enhancing Quality of Experience for m-Health Multimedia Applications: A Comprehensive Survey"}, {"paperId": "74fd5682c03f59bea35da50c04b1339da4e22cbe", "title": "Digital forensics challenges and readiness for 6G Internet of Things (IoT) networks"}, {"paperId": "e9386d6bfd36119e2b30829c7f02afb76cf584d2", "title": "Selecting multiple communication technologies in IoT platforms"}, {"paperId": "c6bcc4b496ac81d90df3574ba7cff200f5f615f2", "title": "A Survey of Symbiotic Radio: Methodologies, Applications, and Future Directions"}, {"paperId": "7289ec1403a1d78f523c06835d5d30bf3b338149", "title": "Fight against Future Pandemics: UAV-Based Data-Centric Social Distancing, Sanitizing, and Monitoring Scheme"}, {"paperId": "47628b6e6bfbad3606f332cddd42cdffe34802a1", "title": "Industry 5.0 in Orthopaedics"}, {"paperId": "be4115485ac2c271e08064013ab7ade0cfc501b0", "title": "Pandemic and Natural Disasters Driving the Need for AI Driven NEXTGen Medical Services"}, {"paperId": "ddca9eddbf4ce541febce81978f6bb26e27767a9", "title": "6G Communication Networks: Introduction, Vision, Challenges, and Future Directions"}, {"paperId": "dff148bdb6e1287087d05ca6291fb2cb9ddec576", "title": "Wireless Networking-Driven Healthcare Approaches in Combating COVID-19"}, {"paperId": "e15736474029040a7173845134bda8826ae1d01a", "title": "Multivariate Fuzzy Logic Based Smart Healthcare Monitoring for Risk Evaluation of Cardiac Patients"}, {"paperId": "be8a7e7fa8373afe77f58544f67fa7efb538f3ed", "title": "Home Automation and RFID-Based Internet of Things Security: Challenges and Issues"}, {"paperId": "05c7bc09b003d1c506b6c96a41aa7f421634274a", "title": "Survey on Symbiotic Radio: A Paradigm Shift in Spectrum Sharing and Coexistence"}, {"paperId": "0b8980ac6851b0f878d6d45f991c66781b32a9b2", "title": "Technology‐driven 5G enabled e‐healthcare system during COVID‐19 pandemic"}, {"paperId": "03e496942fc723a669f9f5b3283b08f60484e360", "title": "A Survey on Reconfigurable Intelligent Surface for Physical Layer Security of Next-Generation Wireless Communications"}, {"paperId": "aeb7148607e8085cb2a3e386d836f603598a388e", "title": "Empowering Non-Terrestrial Networks With Artificial Intelligence: A Survey"}, {"paperId": "6f18818d70f992db7e3bf9693094d595010487f6", "title": "6G Driven Fast Computational Networking Framework for Healthcare Applications"}, {"paperId": "7f088a95b1e5d9f01ed2ed67eea5c080cce0b689", "title": "The Next Generation of eHealth: A Multidisciplinary Survey"}]}
