{"paperId": "364404aa07f6a06f06b95de7cacfafdcf30d1c72", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Approximate Computing Survey, Part I: Terminology and Software & Hardware Approximation Techniques", "abstract": "The rapid growth of demanding applications in domains applying multimedia processing and machine learning has marked a new era for edge and cloud computing. These applications involve massive data and compute-intensive tasks, and thus, typical computing paradigms in embedded systems and data centers are stressed to meet the worldwide demand for high performance. Concurrently, the landscape of the semiconductor field in the last 15 years has constituted power as a first-class design concern. As a result, the community of computing systems is forced to find alternative design approaches to facilitate high-performance and/or power-efficient computing. Among the examined solutions, Approximate Computing has attracted an ever-increasing interest, with research works applying approximations across the entire traditional computing stack, i.e., at software, hardware, and architectural levels. Over the last decade, there is a plethora of approximation techniques in software (programs, frameworks, compilers, runtimes, languages), hardware (circuits, accelerators), and architectures (processors, memories). The current article is Part I of our comprehensive survey on Approximate Computing, and it reviews its motivation, terminology and principles, as well it classifies and presents the technical details of the state-of-the-art software and hardware approximation techniques.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-20", "journal": {"name": "ArXiv", "volume": "abs/2307.11124"}, "authors": [{"authorId": "39954461", "name": "Vasileios Leon"}, {"authorId": "98254755", "name": "Muhammad Abdullah Hanif"}, {"authorId": "2121374305", "name": "Giorgos Armeniakos"}, {"authorId": "2858184", "name": "Xun Jiao"}, {"authorId": "2077523138", "name": "Muhammad Shafique"}, {"authorId": "144519464", "name": "K. Pekmestzi"}, {"authorId": "2171865403", "name": "D. Soudris"}], "citations": [{"paperId": "3b524815bcd9089c0fd367ccd9439ab9fbeeee35", "title": "A Survey on Quantum Machine Learning: Current Trends, Challenges, Opportunities, and the Road Ahead"}, {"paperId": "15a3fd454031c368af8b9c19180edf16a0203fe6", "title": "Approximate Computing Survey, Part II: Application-Specific & Architectural Approximation Techniques and Applications"}, {"paperId": "771661aabc40b39ba570f811dfd60c2ab4876a1b", "title": "Performance Improvement of Processor Through Configurable Approximate Arithmetic Units in Multicore Systems"}]}
