{"paperId": "36468b8b35ce9a26e96654633dcf31d32ac9068b", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Monitoring Illegal Tree Cutting through Ultra-Low-Power Smart IoT Devices", "abstract": "Forests play a fundamental role in preserving the environment and fighting global warming. Unfortunately, they are continuously reduced by human interventions such as deforestation, fires, etc. This paper proposes and evaluates a framework for automatically detecting illegal tree-cutting activity in forests through audio event classification. We envisage ultra-low-power tiny devices, embedding edge-computing microcontrollers and long-range wireless communication to cover vast areas in the forest. To reduce the energy footprint and resource consumption for effective and pervasive detection of illegal tree cutting, an efficient and accurate audio classification solution based on convolutional neural networks is proposed, designed specifically for resource-constrained wireless edge devices. With respect to previous works, the proposed system allows for recognizing a wider range of threats related to deforestation through a distributed and pervasive edge-computing technique. Different pre-processing techniques have been evaluated, focusing on a trade-off between classification accuracy with respect to computational resources, memory, and energy footprint. Furthermore, experimental long-range communication tests have been conducted in real environments. Data obtained from the experimental results show that the proposed solution can detect and notify tree-cutting events for efficient and cost-effective forest monitoring through smart IoT, with an accuracy of 85%.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1698481", "name": "A. Andreadis"}, {"authorId": "1752954", "name": "G. Giambene"}, {"authorId": "1763689", "name": "Riccardo Zambon"}], "citations": [{"paperId": "4cba691184204e136723a30ef9dbb6c23ded7920", "title": "An Efficient Method and Hardware System for Monitoring of Illegal Logging Events in Forest"}, {"paperId": "a76b1f98cb38a668514f6ca94111943240ed2833", "title": "A Comparative Study of Preprocessing and Model Compression Techniques in Deep Learning for Forest Sound Classification"}, {"paperId": "b4f4b1768692aa27ec11a479e79e0c0dd693e039", "title": "Downstream Task Performance of Pre-Trained Model For Outdoor Audio Event Classification"}, {"paperId": "04f1ef6b20db81d03e298ca57e0bafc294e5a4d5", "title": "A Survey on Deep Learning Based Forest Environment Sound Classification at the Edge"}, {"paperId": "87f267934c9112e5121e79b26fe55dea22e53ded", "title": "Recent Progress in Micro- and Nanotechnology-Enabled Sensors for Biomedical and Environmental Challenges"}, {"paperId": "177fc0607c353ad45e077753d8dc9b17a756f4f7", "title": "IoT Alert Reflexion of Forbidden Deforestation Regions with Drone observation"}, {"paperId": "d1519eff9f87ad0a8eb07d2431edeea4e9e76c5b", "title": "Forest Sound Classification Dataset: FSC22"}, {"paperId": "2a55fef1fe8c89178aaa6fa09d8e6cb3b4461cc2", "title": "LoRa Modulation: A 2.4GHz Communication Strategy"}, {"paperId": "91211740be244d326e2a6ff26c75ec41e7a1f66f", "title": "Audio Analytics-based Human Trafficking Detection Framework for Autonomous Vehicles"}, {"paperId": "2be1d9cd1c4a21a4bd97bfc2164d9743c488983b", "title": "Edge-Computing-Based Intelligent IoT: Architectures, Algorithms and Applications"}, {"paperId": "f5953a94571bf55e58b900422455f6a01ff9e4b6", "title": "Internet of Things for Sustainable Environment and Smart Agriculture: Technologies, Applications, Challenges and Solutions"}, {"paperId": "a3d966a1faafcef9e04fbddad3f31fe30ad0fd07", "title": "IoT-Ready Temperature Probe for Smart Monitoring of Forest Roads"}]}
