{"paperId": "364e1aaaae62db5493e15742f9a7cf4865fc6c11", "publicationVenue": {"id": "2e5bd046-611b-48bd-9b5f-c5f066b6492e", "name": "International Conference on Smart Grids and Green IT Systems", "type": "conference", "alternate_names": ["SMARTGREENS", "SmartGreens", "International Conference on Smart Cities and Green ICT Systems", "Int Conf Smart City Green ICT Syst", "Int Conf Smart Grid Green IT Syst"]}, "title": "Information Systems Security Management for Internet of Things: Enabled Smart Cities Conceptual Framework", "abstract": "Evolving Information Technology (IT) that drives the fourth Industrial Revolution (4IR) is disrupting organisational management. Particularly in public sector, the global movement towards Smart Cities (SC) initiative involving the Internet of Things (IoT) is motivating drastic changes to IT management methods. The heavy adoption of the IoT technologies in SC creates complexity for the information security to be managed by Information Systems (IS). IS security management approach changes according to the current nature of an organisation. As organisations prepare towards SC, there is a need to understand key concepts in managing IS security in IoT towards SC. The current IS security management for organisations is challenged in five aspects: governance, integrity, interoperability, personalisation, and self-organisation. Therefore, this study proposes an IS security conceptual framework for IoT management towards realising SC. Literature review uses the document analysis method to identify key concepts on relevant reports, for the purpose of developing a proposed conceptual framework. Based on analysis from previous research, a conceptual framework for IS Security Management in IoT-enabled SC was proposed as the outcome of this study.", "venue": "International Conference on Smart Grids and Green IT Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"pages": "44-51"}, "authors": [{"authorId": "122741562", "name": "Zarina Din"}, {"authorId": "3367805", "name": "Dian Indrayani Jambari"}, {"authorId": "2086039", "name": "M. Yusof"}, {"authorId": "2535760", "name": "J. Yahaya"}], "citations": [{"paperId": "2c2dd64b27c3cacab449d49699dfde673888475f", "title": "Analysis of Security Paradigms for Resource and Infrastructure Management in Global Organizations"}, {"paperId": "257703e8a6b143622f075a2ff54d1a094fa15aca", "title": "Information Systems Security Management for IoT Adoption in Smart Cities: A Review"}]}
