{"paperId": "3658f70360c60039c232f1ee4146007f9a7c2480", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "DDR-coin: An Efficient Probabilistic Distributed Trigger Counting Algorithm", "abstract": "A distributed trigger counting (DTC) problem is to detect w triggers in the distributed system consisting of n nodes. DTC algorithms can be used for monitoring systems using sensors to detect a significant global change. When designing an efficient DTC algorithm, the following goals should be considered; minimizing the whole number of exchanged messages used for counting triggers and even distribution of communication loads among nodes. In this paper, we present an efficient DTC algorithm, DDR-coin (Deterministic Detection of Randomly generated coins). The message complexity—the total number of exchanged messages—of DDR-coin is O(nlogn(w/n)) in average. MaxRcvLoad—the maximum number of received messages to detect w triggers in each node—is O(logn(w/n)) on average. DDR-coin is not an exact algorithm; even though w triggers are received by the n nodes, it can fail to raise an alarm with a negligible probability. However, DDR-coin is more efficient than exact DTC algorithms on average and the gap between those is increased for larger n. We implemented the prototype of the proposed scheme using NetLogo 6.1.1. We confirmed that experimental results are close to our mathematical analysis. Compared with the previous schemes—TreeFill, CoinRand, and RingRand— DDR-coin shows smaller message complexity and MaxRcvLoad.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "2012298", "name": "Seokhyun Kim"}, {"authorId": "1720234", "name": "Yongsu Park"}], "citations": [{"paperId": "bf2ee0d39561a79a2108297e445f90a6559ac95b", "title": "A Simple and Efficient Tree-Based Algorithm for the Distributed Trigger Counting Problem"}]}
