{"paperId": "365ebb76ae1278c52bb2118545e09d3679bdf1d0", "publicationVenue": {"id": "a03dd819-cbf4-4e9e-9fb7-2435d554824a", "name": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "type": "conference", "alternate_names": ["Comput Aided Model Des Commun Links Netw", "CAMAD", "IEEE Int Workshop Comput Aided Model Des Commun Links Netw", "Computer Aided Modeling and Design of Communication Links and Networks"], "url": "http://www.wikicfp.com/cfp/program?id=352"}, "title": "Machine Learning Based Resource Utilization Prediction in the Computing Continuum", "abstract": "This paper presents UtilML, a novel approach for tackling resource utilization prediction challenges in the computing continuum. UtilML leverages Long-Short-Term Memory (LSTM) neural networks, a machine learning technique, to forecast resource utilization accurately. The effectiveness of UtilML is demonstrated through its evaluation of data extracted from a real GPU cluster in a computing continuum infrastructure comprising more than 1800 computing devices. To assess the performance of UtilML, we compared it with two related approaches that utilize a Baseline-LSTM model. Furthermore, we analyzed the LSTM results against User-Predicted values provided by GPU cluster owners for task deployment with estimated allocation values. The results indicate that UtilML outperformed user predictions by 2% to 27% for CPU utilization prediction. For memory prediction, UtilML variants excelled, showing improvements of 17% to 20% compared to user predictions.", "venue": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-11-06", "journal": {"name": "2023 IEEE 28th International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD)", "pages": "219-224"}, "authors": [{"authorId": "2293636588", "name": "Christian Bauer"}, {"authorId": "23980748", "name": "Narges Mehran"}, {"authorId": "100533173", "name": "R.-C. Prodan"}, {"authorId": "1887201", "name": "Dragi Kimovski"}], "citations": []}
