{"paperId": "365f8fca7b6a071d9352c88732530fbf1ae09512", "publicationVenue": {"id": "329b8015-5696-471e-b721-db26e24be759", "name": "Romanian Conference on Human-Computer Interaction", "type": "conference", "alternate_names": ["RoCHI", "Romanian Conf Human-computer Interact"], "url": "http://rochi.utcluj.ro/proceedings/en/"}, "title": "Gesture-based Visual Analytics in Virtual Reality", "abstract": "This paper presents an approach to dynamic data visualization and manipulation using virtual reality as a means of display and the Leap Motion controller in order to interact with the virtual scene. The data and related APIs provided to the virtual reality application are based on a separate web application which provides REST APIs in order to get and further manipulate existent data. The algorithm pipeline is managed by using the Unity Game Engine, which provides a means to express control and logic over the sensory inputs of the Leap Motion controller. The application is built by using the Unity Game Engine and it is streamed on any Android phone through RiftCat Vridge software solution for streaming application over WiFi, while interpreting the phone’s sensor input and translating it into virtual head movements. The issues from the standpoint of a corporate need for a more interactive and natural experience in viewing and interacting with big data. Author", "venue": "Romanian Conference on Human-Computer Interaction", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "101-106"}, "authors": [{"authorId": "2071889996", "name": "Mihai Pop"}, {"authorId": "2558262", "name": "A. Sabou"}], "citations": [{"paperId": "2558b6df0bca91e61df8c18b24613f2d056778f1", "title": "Interactive Assembly Simulation in an Immersive Virtual Environment"}, {"paperId": "32ce82fddc7a4bbcd06bdd3d402b0e4df462c497", "title": "FluentMotion - Gesture-based Interaction in Virtual Reality using LeapMotion and Reactive Programming"}]}
