{"paperId": "367b4cea968d8ae02d431ffc9cb501a6897ca755", "publicationVenue": null, "title": "Research on landslide master control factor identification and susceptibility prediction modelling", "abstract": ". It is important to properly identify the primary control elements of landslide susceptibility because the modelling process and its uncertainties differ between machine learning predictions of susceptibility to landslides. In response to the aforementioned issues, the novel \"weight mean method\" is suggested to determine more precise landslide master factors. Support vector machine (SVM) and random forest (RF) are used as examples to discuss the prediction of landslide susceptibility and its uncertainty based on machine learning. For Ruijin City, Jiangxi Province, the landslide inventory and 12 15 different types of underlying environmental factors were acquired, and the factor frequency ratios were employed as input variables for SVM and RF. The landslides and randomly selected non-landslide samples were then divided into training and test sets, and the trained machine learning was used to predict and map landslide susceptibility. In order to assess modeling uncertainty and determine the landslide master control factor, subject work curves, means, and standard deviations were used. The results show that: (1) Machine learning can effectively predict regional landslide susceptibility, the accuracy of landslide 20 susceptibility predicted by RF is higher than that of SVM, while its uncertainty is lower than that of SVM, but the overall susceptibility distribution patterns of both are similar. (2) The weight-mean approach determines that the slope, height, and lithology, in that order, are the primary controlling elements of the landslide in Ruijin City. In comparison to other machine learning models, the case studies and literature study demonstrate how dependable and susceptible the RF model is.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2072727626", "name": "Yin Xing"}, {"authorId": "2144354321", "name": "Yang Chen"}, {"authorId": "2261288058", "name": "Peng Wang"}, {"authorId": "2261201225", "name": "Saipeng Huang"}, {"authorId": "2260827046", "name": "Yunfei Xiang"}], "citations": []}
