{"paperId": "3680ed038c166cef06fcc21e35a0a2f8e4a77101", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enhancing the Role of Large-Scale Recommendation Systems in the IoT Context", "abstract": "The Internet of Things (IoT) connects heterogeneous physical devices with the ability to collect data using sensors and actuators. These data can infer useful information for decision-makers in many applications systems monitoring, healthcare, transportations, data storage, smart homes, and many others. In the Era of the Internet of Things (IoT), recommender systems can support scenarios such as recommending apps, IoT workflows, services, sensor equipment, hotels, and drugs to users and customers. Current state-of-art recommendation systems, including collaborative filtering methods, suffer from scalability and sparsity problems. This article proposes a clustering-based recommendation system that adopts the vector space model from information retrieval to obtain highly accurate recommendations. The proposed algorithm uses four well-known clustering techniques as k-means (KM), fuzzy c-mean (FCM), Single-Linkage (SLINK), and Self-Organizing-Maps (SOM). Various experiments and benchmarking on seven IoT rating datasets from different fields are conducted to assess the performance of the proposed recommender system. The experimental results using both error and prediction metrics indicate that the proposed algorithm outperforms the traditional collaborative filtering approach. Besides, adopting the self-organizing strategy obtains recommendations of significant accuracy as compared to the partitional learning approaches.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "178248-178257", "volume": "8"}, "authors": [{"authorId": "2279618771", "name": "R. Kashef"}], "citations": [{"paperId": "91a78c8a35e6317fc7204af404b801a5e7565950", "title": "An opportunistic energy‐efficient dynamic self‐configuration clustering algorithm in WSN‐based IoT networks"}, {"paperId": "d00d40e54e41de14d903974753d179caaa5f39f5", "title": "Emotion-Enhanced Content Recommendation in IoT-Connected Entertainment Environments for Personalized Streaming Experiences"}, {"paperId": "cc3846e4023779970a0097dfb23afd0fb17f83e9", "title": "Forecasting The Price of the Flight Tickets using A Novel Hybrid Learning model"}, {"paperId": "86e11c64f8730fd0d019cab82470384b81e879be", "title": "A systematic review of privacy techniques in recommendation systems"}, {"paperId": "29365dd2a7487cf0dd89485fca76eb2f57b10272", "title": "Towards A Sustainable and Ethical Supply Chain Management: The Potential of IoT Solutions"}, {"paperId": "72fbee06242c35b621cc9877d5eb1ebc8d11f4ef", "title": "Multi-Context Recommendation Systems (CARS) in Autonomous Driving and Other Applications"}, {"paperId": "c92b18c3ec78c1303118312336e4994b2e5ebff8", "title": "E2DR: A Deep Learning Ensemble-Based Driver Distraction Detection with Recommendations Model"}, {"paperId": "818476f934f21f3e0823702118e5fa2d0fd1421a", "title": "Homogenous and Heterogenous Parallel Clustering: An Overview"}, {"paperId": "9cc2e99a9de1c5a755e5ab4b533011e800bb6d0a", "title": "Cyberattack and Fraud Detection Using Ensemble Stacking"}, {"paperId": "e32594cc7575de61b7af65106eca16e7b0b9e6fe", "title": "A Crowdsourcing and Gamification based Product Ranking Method for E-Commerce"}, {"paperId": "579113a5017e08eebf2f20bf2169b7912d8edfaa", "title": "Forecasting the Early Market Movement in Bitcoin Using Twitter's Sentiment Analysis: An Ensemble-based Prediction Model"}, {"paperId": "247bc3f8513924c84b8ad051522d9f57b535d3a3", "title": "Deploying Different Clustering Techniques on a Collaborative-based Movie Recommender"}, {"paperId": "42649f7d27ffbcb4e189cbd80588e8c43d4a635f", "title": "Enhancing The Performance of Network Traffic Classification Methods Using Efficient Feature Selection Models"}, {"paperId": "5f07fc0667e945db1e2d6f8bb8cf413e2ce9aecd", "title": "Situation-aware recommendation system for personalized healthcare applications"}, {"paperId": "0d27c2fad1f97de1bd1a98283e0e7753f1368226", "title": "Detecting Shilling Attacks Using Hybrid Deep Learning Models"}, {"paperId": "1dd7193857c2ae7e2bd32a8fdd46a2ba8f5fb5ae", "title": "Analisis Pengaruh Scale Up Sistem Terhadap Quality of Service (QoS) Dari Internet of Thing (IoT)"}, {"paperId": "b872ac3245b5f2534530b9ddc8bca53e5b359f25", "title": "Towards addressing item cold-start problem in collaborative filtering by embedding agglomerative clustering and FP-growth into the recommendation system"}, {"paperId": "e48c55dcf0f6904cd925c70f55603f5dfd84f8f4", "title": "Deep Learning Model for Predicting Consumers’ Interests of IoT Recommendation System"}, {"paperId": "f08172d1bf727efd68f11a72412f1a1889dc0943", "title": "Deep Learning Enabled Autoencoder Architecture for Collaborative Filtering Recommendation in IoT Environment"}]}
