{"paperId": "368a30bb16be44acdb08fbf5693078a0310fda2e", "publicationVenue": null, "title": "Autoencoder based Wear Assessment in Sheet Metal Forming", "abstract": "The amount of information contained in process signals such as acoustic emission and force signals has proven vital for the detection of changes in physical conditions or quality feature prediction in sheet metal forming applications. Both signal types have also been researched in the context of wear detection, yet systems that reliably identify the wear state at a given time in sheet metal forming processes based on these signals do not exist. This paper proposes an architecture to assess the wear increase within a given time frame in an experiment based on an autoencoder. The ability of autoencoders to encode and decode signals has been widely studied and this approach leverages the fact that autoencoders are more likely to learn representative encodings on stable and homogeneous signals than on heterogeneous signals with high fluctuations. This approach utilizes the circumstance that high tool wear leads to changes in the signal and signal fluctuation. In consequence, autoencoders can be utilized to track tool wear progression without the need for labelled data. The findings show a strong similarity to physical models for the wear progression of tool components, indicating the validity of this approach. Additionally, an analysis of the signals yields characteristic effects of the considered force signals that could specifically represent wear resistance.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-06-01", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "1157"}, "authors": [{"authorId": "50981710", "name": "Philipp Niemietz"}, {"authorId": "1813365704", "name": "Martin Unterberg"}, {"authorId": "3488804", "name": "D. Trauth"}, {"authorId": "3172734", "name": "T. Bergs"}], "citations": [{"paperId": "4fb627a682f91c33481b911a092f552465c59b7b", "title": "Image-based feature extraction for inline quality assurance and wear classification in high-speed blanking processes"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "03930d29d39723fd6159a47cd3327a1a494ed17f", "title": "Study on learning efficient stroke representations in clocked sheet metal processing: theoretical and practical evaluation"}, {"paperId": "4f29c4cbf0454a6a4e3f79244381b88f2564ffac", "title": "Relating wear stages in sheet metal forming based on short- and long-term force signal variations"}, {"paperId": "d21bd3e8ccf0b7338e12d3d81eb8ee26cdf4ff48", "title": "Towards a real-time tool state detection in sheet metal forming processes validated by wear classification during blanking"}, {"paperId": "21b87d22b70983d669bc8395e6e18393283f46b4", "title": "Perspectives on data-driven models and its potentials in metal forming and blanking technologies"}]}
