{"paperId": "368ed0beb797154604b41b8367a9336e7bf7ce8e", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Short-Term Wind Power Prediction by an Extreme Learning Machine Based on an Improved Hunter–Prey Optimization Algorithm", "abstract": "Considering the volatility and randomness of wind speed, this research suggests an improved hunter-prey optimization (IHPO) algorithm-based extreme learning machine (ELM) short-term wind power prediction model to increase short-term wind power prediction accuracy. The original wind power history data from the wind farm are used in the model to achieve feature extraction and data dimensionality reduction, using the partial least squares’ variable importance of projection (PLS-VIP) and normalized mutual information (NMI) methods. Adaptive inertia weights are added to the HPO algorithm’s optimization search process to speed up the algorithm’s convergence. At the same time, the initialized population is modified, to improve the algorithm’s ability to perform global searches. To accomplish accurate wind power prediction, the enhanced algorithm’s optimal parameters optimize the extreme learning machine’s weights and threshold. The findings demonstrate that the method accurately predicts wind output and can be confirmed using measured data from a wind turbine in Inner Mongolia, China.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-05", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2144796133", "name": "Xiangyue Wang"}, {"authorId": "2117986064", "name": "Ji Li"}, {"authorId": "2067608306", "name": "Lei Shao"}, {"authorId": "2109022739", "name": "Hongli Liu"}, {"authorId": "2189455097", "name": "Lei Ren"}, {"authorId": "2211365251", "name": "Lihua Zhu"}], "citations": [{"paperId": "9b84af03bd837ac7efab5926d5ec58bef570e7a8", "title": "Self‐paced learning long short‐term memory based on intelligent optimization for robust wind power prediction"}, {"paperId": "b482285f7d252e18e677c12bad68afe4383afa5d", "title": "Reliability model for key components of urban rail transit train based on improved hunter-prey optimization"}, {"paperId": "a3f0d01b629eb705f04084b7ea38f660a90706e0", "title": "A hybrid model with combined feature selection based on optimized VMD and improved multi-objective coati optimization algorithm for short-term wind power prediction"}, {"paperId": "c942867647e20bd8781dde43fd411be4ab097292", "title": "ForecastNet Wind Power Prediction Based on Spatio-Temporal Distribution"}, {"paperId": "659ea74234e4006b19ff41e6de61be643e486547", "title": "A novel optimized dynamic fractional-order MPPT controller using hunter pray optimizer for alleviating the tracking oscillation with changing environmental conditions"}, {"paperId": "00e063f50e1efea4c2d5e0819e81753599be25b7", "title": "Verification of the Short-Term Forecast of the Wind Speed for the Gibara II Wind Farm according to the Prevailing Synoptic Situation Types"}, {"paperId": "d1a57bc630589ad36fc2e5640f089ed5721b5584", "title": "A Review of Modern Wind Power Generation Forecasting Technologies"}, {"paperId": "2aa2bc5edf43b9ea7796161be1dcf6ff0f38caef", "title": "Short Term Solar Power Prediction Using Hybrid Two Layered Decomposition Technique Based Optimized ELM"}, {"paperId": "a6ada9d54ed27eeae6a4a7ec6daf62fecfaaae62", "title": "Multistep Wind Power Prediction Using Time-Varying Filtered Empirical Modal Decomposition and Improved Adaptive Sparrow Search Algorithm-Optimized Phase Space Reconstruction–Echo State Network"}, {"paperId": "476ef22e609bbf67eb3da28d1219d237850188f5", "title": "An enhanced hunter‐prey optimization for optimal power flow with FACTS devices and wind power integration"}, {"paperId": "52ad67e4f4856a37bf1d37ec4389a8b042aaeaa9", "title": "Research on Crosstalk Suppression of Automotive Communication System Based on Long Short-term Memory Prediction Phase Shifter"}, {"paperId": "82ae0056882776fce7a161e32ba16c0c671176a0", "title": "Wind Power Short-Term Forecasting Method Based on LSTM and Multiple Error Correction"}]}
