{"paperId": "369181e3b855d8d171a40bb057aaa8e1d2d6d87d", "publicationVenue": {"id": "4e5cb97d-ea4b-4096-a3a7-7e57677a366d", "name": "IEEE Transactions on Learning Technologies", "type": "journal", "alternate_names": ["IEEE Trans Learn Technol"], "issn": "1939-1382", "url": "https://www.computer.org/web/tlt/about-tlt", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4620076", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4620076"]}, "title": "Evaluating the Effectiveness of Accommodations Given to Students With Learning Impairments: Ordinal and Interpretable Machine-Learning-Based Methodology", "abstract": "In most academic institutions, students with learning impairments (LIs) are entitled to various accommodations as a means of compensating for their impairment. Ensuring that the appropriate accommodations were selected requires an intelligent support tool to track their effectiveness. In this article, we regard the effectiveness of such accommodations in terms of their quality and reliability. High-quality accommodations allow students with LIs equal access and equal opportunity to demonstrate their knowledge compared to their peers who do not have LIs. Highly reliable accommodations mean a significant performance difference between students with LIs who actually use the accommodations compared with students with LIs who do not use the accommodations, given similar student characteristics. Previous literature is inconclusive regarding the evidence of the effectiveness of such accommodations since different accommodations may have a different effect on different subgroups of exams and students. This article proposes a methodology, based on ordinal interpretable models, that produce practical insights to professionals who are responsible for students with LIs, to address the problem of exploring the effectiveness of learning accommodations. The suggested models use the ordinal information of the target variables for evaluating student performance and yield practical insights for designing the most suitable accommodation for a student with LIs based on their characteristics. The ordinal interpretable models are evaluated using a database of tens of thousands of engineering students. The results demonstrate that the suggested interpretable models perform significantly better than the compared algorithms on all measures.", "venue": "IEEE Transactions on Learning Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Learning Technologies", "pages": "736-746", "volume": "15"}, "authors": [{"authorId": "29657491", "name": "G. Singer"}, {"authorId": "47430407", "name": "M. Golan"}, {"authorId": "2187892775", "name": "Rachel Shiff"}, {"authorId": "17914918", "name": "D. Kleper"}], "citations": [{"paperId": "6e4eb1396dce8b5dca31d60d28709cb957a60569", "title": "Optimal Real Estate Pricing and Offer Acceptance Strategy"}]}
