{"paperId": "3692ce1284b969e3b58eb66a6ca03212f9929d57", "publicationVenue": {"id": "d9658953-63d4-4ed9-a950-9f0c2745c5e2", "name": "International Symposium on Applied Computational Intelligence and Informatics", "type": "conference", "alternate_names": ["Symp Appl Comput Intell Informatics", "Int Symp Appl Comput Intell Informatics", "SACI", "Symposium on Applied Computational Intelligence and Informatics"]}, "title": "Common open telemedicine hub and infrastructure with interface recommendation", "abstract": "Stable cloud services and global infocommunicational infrastructure capabilities are enabling for the first time in our history the worldwide interoperability of classical medical systems, telemedicine instruments, health-related smart devices and smartphone-apps. In this paper we present a unified service architecture with the corresponding common interface recommendation for integrating classical medical systems from the following areas: interconnection of telemedicine systems, hospital information systems, legacy health care systems, smart health devices and health-related smartphone-apps. Emerging IoT-technologies open new horizons also for medical care solutions. Stable cloud architecture technologies deliver the comprehensive back-end infrastructural basis for dealing efficiently with the foreseeable human medical data boom. Classical medical supply chains and institutions will establish and open IT-interconnection capabilities interacting with smart end-user devices. Collection, aggregation and evaluation of massive health-related data streams call for common architectural platform with unified interfaces. Telemedicine solutions with IoT connectivity handle massive number of active device connections and produce significant unstructured sensor data-flows. As different sensor data implies varying data transmission, processing and storage techniques, there is a remarkable demand for a general and common interface standard. This will enable the flawless interaction among classical legacy medical systems, industrial telemedicine devices, smart-devices and smartphone health-apps via both internet (LAN, WLAN, GSM, etc.) and peer-to-peer (Bluetooth, NFC, etc.) connections. Inevitably arise security and ethical considerations concerning access of sensitive medical data with regard to different domestic and regional regulations. Recent remarkable innovations, like direct Bluetooth LE internet browser support, highlights the further perspectives of the described common open telemedicine hub and infrastructure with the recommended interface hierarchy.", "venue": "International Symposium on Applied Computational Intelligence and Informatics", "year": 2016, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-05-12", "journal": {"name": "2016 IEEE 11th International Symposium on Applied Computational Intelligence and Informatics (SACI)", "pages": "385-390"}, "authors": [{"authorId": "2977194", "name": "A. Adamkó"}, {"authorId": "3431539", "name": "Abel Garai"}, {"authorId": "3431600", "name": "István Péntek"}], "citations": [{"paperId": "c0b83ca432f52017d264e66b16698dbbd4a82103", "title": "GPU and VPU Enabled Virtual Mobile Infrastructure for 3-D Image Rendering and its Application in Telemedicine"}, {"paperId": "8280b01175779e099a912ab41f913a8089bfe4da", "title": "Application of E-Healthcare Based on Machine Learning in an Internet of Things Ecosystem"}, {"paperId": "e36a00a6baf411056c382156ec904b340f200380", "title": "IoT Based Remote Health Monitoring and Alert System"}, {"paperId": "0513280cea9705005577d8e6bf71ebcdee492c5c", "title": "IoT based Healthcare Monitoring and Intravenous Flow Control"}, {"paperId": "a39b76cbdb3420643f098a360c1251d986feed9b", "title": "OSDFramework: a Open-and-Secure data Framework to enable interoperable applications in IoT ecosystems"}, {"paperId": "4a0df78c1288f1fceb99ae84a9950f2d03e67033", "title": "A Review on IOT based Telemedicine Health Care System"}, {"paperId": "06d647e64206ab8750dd487db0d1628610957dce", "title": "Cognitive Cloud-Based Telemedicine System"}, {"paperId": "e18b9a522f94c71ee9fa3bfbcc172b7f39555025", "title": "HEMAN: Health monitoring and nous: An IoT based e-health care system for remote telemedicine"}, {"paperId": "18728a41a6319c43b78371a7415ea483d54b98b8", "title": "Methodology for clinical integration of e-Health sensor-based smart device technology with cloud architecture"}, {"paperId": "2b079d6e146b474c9505f015bc2ba5c2d2e14358", "title": "Security Framework for Managing Data Security within Point of Care Tests"}, {"paperId": "e2bf0691602169985eceacb18ae0dd0fd3af723b", "title": "Comprehensive healthcare interoperability framework integrating telemedicine consumer electronics with cloud architecture"}, {"paperId": "2d0fd4dcaba43667b696a9f2af2653885f5c35d5", "title": "A Clinical System Integration Methodology for Bio-Sensory Technology with Cloud Architecture"}]}
