{"paperId": "36929b050d800ba8d250533a9a62765346cdcff6", "publicationVenue": {"id": "2989732e-2668-4b47-9c29-326646a60273", "name": "Internet of Things", "alternate_names": ["Internet Thing"], "issn": "2542-6605", "alternate_issns": ["2199-1073"], "url": "https://www.journals.elsevier.com/internet-of-things", "alternate_urls": ["https://www.sciencedirect.com/journal/internet-of-things", "http://www.springer.com/series/11636"]}, "title": "Edge AI for Internet of Energy: Challenges and Perspectives", "abstract": "The digital landscape of the Internet of Energy (IoE) is on the brink of a revolutionary transformation with the integration of edge Artificial Intelligence (AI). This comprehensive review elucidates the promise and potential that edge AI holds for reshaping the IoE ecosystem. Commencing with a meticulously curated research methodology, the article delves into the myriad of edge AI techniques specifically tailored for IoE. The myriad benefits, spanning from reduced latency and real-time analytics to the pivotal aspects of information security, scalability, and cost-efficiency, underscore the indispensability of edge AI in modern IoE frameworks. As the narrative progresses, readers are acquainted with pragmatic applications and techniques, highlighting on-device computation, secure private inference methods, and the avant-garde paradigms of AI training on the edge. A critical analysis follows, offering a deep dive into the present challenges including security concerns, computational hurdles, and standardization issues. However, as the horizon of technology ever expands, the review culminates in a forward-looking perspective, envisaging the future symbiosis of 5G networks, federated edge AI, deep reinforcement learning, and more, painting a vibrant panorama of what the future beholds. For anyone vested in the domains of IoE and AI, this review offers both a foundation and a visionary lens, bridging the present realities with future possibilities.", "venue": "Internet of Things", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-28", "journal": {"name": "ArXiv", "volume": "abs/2311.16851"}, "authors": [{"authorId": "2130461741", "name": "Yassine Himeur"}, {"authorId": "2120553429", "name": "A. Sayed"}, {"authorId": "30148974", "name": "A. Alsalemi"}, {"authorId": "3090801", "name": "F. Bensaali"}, {"authorId": "144730155", "name": "A. Amira"}], "citations": [{"paperId": "feb2333acd3123f1e77cbd32a284391a54585268", "title": "A comprehensive review of embedded systems in autonomous vehicles: Trends, challenges, and future directions"}]}
