{"paperId": "36b324d148cb446a5cf902d238dc4491cb25ef41", "publicationVenue": null, "title": "Big Data in Climate Change Research: opportunities and Challenges", "abstract": "The advent of fourth industrial revolution has come at a cost; our planet earth is enduring concurrent changes in population, increase in urban infrastructure, depleting natural resources, depleting forest covers, increase in pollution etc., and its cumulative ill effects on global climate. These changes coupled with advancements in technology viz. Sensors and Data Mining techniques have led to a growth in study of Climate Data as a method to thwart Climate Change. Climate change study is a data intensive subject which has seen numerous innovations in the data collection methods, and study of that data using Big Data Analytics. There has been a considerable shift from traditional study methods like random sampling of climate data to data intensive methods where complete datasets are analyzed by means of Big Data Analytics. The study of climate change and its effects has been one of the top priorities in Big Climate Data Analytics implementations and detailed research has been done covering a plethora of topics. However, the study of climate data by recent methods has revealed several challenges previously unrecorded in data mining literature, unless these challenges are addressed, big data analytics will not have the same meaningful impact that it has on other fields. The purpose of this paper is to provide an overview of use of Big Data in Climate Change research and the opportunities and challenges pertaining to it, by studying and summarizing the current state of applications of Big Data in Climate Science.", "venue": "2020 International Conference on Intelligent Engineering and Management (ICIEM)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-06-01", "journal": {"name": "2020 International Conference on Intelligent Engineering and Management (ICIEM)", "pages": "321-326"}, "authors": [{"authorId": "1490805077", "name": "Prateek Mangal"}, {"authorId": "145355559", "name": "A. Rajesh"}, {"authorId": "2006442968", "name": "Dr. Richa Misra"}], "citations": [{"paperId": "91a8064acbfc85ba59e89e4a9b94b9829ce5aa10", "title": "Recently emerging trends in big data analytic methods for modeling and combating climate change effects"}, {"paperId": "ddd2e2804f7e820e22a6f34cc7a3aa88dc2e60f4", "title": "Technical Indexes and Construction Path of New Power System in Sichuan Province"}, {"paperId": "3497ffe43371469641abd3c90c8922fca375819f", "title": "Supporting Meteorologists in Data Analysis through Knowledge-Based Recommendations"}, {"paperId": "b339c09878455da211ac5dd19d6a181d9148baad", "title": "Agricultural Big Data Architectures in the Context of Climate Change: A Systematic Literature Review"}, {"paperId": "8a923538a58f50b755365c51ccfcb7d71aed5b4f", "title": "Exploring machine learning potential for climate change risk assessment"}, {"paperId": "c9c3eae62113d2156245c98520a1e2011fcf4dd2", "title": "The Usage of Big Data and Data Analytics in the Study of Climate Change"}]}
