{"paperId": "36c1ebe35cad1074fb3ddfcc9e97ae0475c5fa74", "publicationVenue": {"id": "74514e46-03c7-4a3b-a507-9a15754ddbc9", "name": "Journal of Low Power Electronics and Applications", "type": "journal", "alternate_names": ["J Low Power Electron Appl"], "issn": "2079-9268", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-204846", "alternate_urls": ["https://www.mdpi.com/about/announcements/588", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-204846", "https://www.mdpi.com/journal/jlpea"]}, "title": "Energy-Efficient Audio Processing at the Edge for Biologging Applications", "abstract": "Biologging refers to the use of animal-borne recording devices to study wildlife behavior. In the case of audio recording, such devices generate large amounts of data over several months, and thus require some level of processing automation for the raw data collected. Academics have widely adopted offline deep-learning-classification algorithms to extract meaningful information from large datasets, mainly using time-frequency signal representations such as spectrograms. Because of the high deployment costs of animal-borne devices, the autonomy/weight ratio remains by far the fundamental concern. Basically, power consumption is addressed using onboard mass storage (no wireless transmission), yet the energy cost associated with data storage activity is far from negligible. In this paper, we evaluate various strategies to reduce the amount of stored data, making the fair assumption that audio will be categorized using a deep-learning classifier at some point of the process. This assumption opens up several scenarios, from straightforward raw audio storage paired with further offline classification on one side, to a fully embedded AI engine on the other side, with embedded audio compression or feature extraction in between. This paper investigates three approaches focusing on data-dimension reduction: (i) traditional inline audio compression, namely ADPCM and MP3, (ii) full deep-learning classification at the edge, and (iii) embedded pre-processing that only computes and stores spectrograms for later offline classification. We characterized each approach in terms of total (sensor + CPU + mass-storage) edge power consumption (i.e., recorder autonomy) and classification accuracy. Our results demonstrate that ADPCM encoding brings 17.6% energy savings compared to the baseline system (i.e., uncompressed raw audio samples). Using such compressed data, a state-of-the-art spectrogram-based classification model still achieves 91.25% accuracy on open speech datasets. Performing inline data-preparation can significantly reduce the amount of stored data allowing for a 19.8% energy saving compared to the baseline system, while still achieving 89% accuracy during classification. These results show that while massive data reduction can be achieved through the use of inline computation of spectrograms, it translates to little benefit on device autonomy when compared to ADPCM encoding, with the added downside of losing original audio information.", "venue": "Journal of Low Power Electronics and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-27", "journal": {"name": "Journal of Low Power Electronics and Applications"}, "authors": [{"authorId": "2189053712", "name": "Jonathan Miquel"}, {"authorId": "144013918", "name": "L. Latorre"}, {"authorId": "1397357310", "name": "S. Chamaillé‐Jammes"}], "citations": []}
