{"paperId": "36cbf37930a0f0ddc61124eca9d40c6806e534ea", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "A New Meta-Heuristics Data Clustering Algorithm Based on Tabu Search and Adaptive Search Memory", "abstract": "Clustering is a popular data analysis and data mining problem. Symmetry can be considered as a pre-attentive feature, which can improve shapes and objects, as well as reconstruction and recognition. The symmetry-based clustering methods search for clusters that are symmetric with respect to their centers. Furthermore, the K-means (K-M) algorithm can be considered as one of the most common clustering methods. It can be operated more quickly in most conditions, as it is easily implemented. However, it is sensitively initialized and it can be easily trapped in local targets. The Tabu Search (TS) algorithm is a stochastic global optimization technique, while Adaptive Search Memory (ASM) is an important component of TS. ASM is a combination of different memory structures that save statistics about search space and gives TS needed heuristic data to explore search space economically. Thus, a new meta-heuristics algorithm called (MHTSASM) is proposed in this paper for data clustering, which is based on TS and K-M. It uses TS to make economic exploration for data with the help of ASM. It starts with a random initial solution. It obtains neighbors of the current solution called trial solutions and updates memory elements for each iteration. The intensification and diversification strategies are used to enhance the search process. The proposed MHTSASM algorithm performance is compared with multiple clustering techniques based on both optimization and meta-heuristics. The experimental results indicate the superiority of the MHTSASM algorithm compared with other multiple clustering algorithms.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-20", "journal": {"name": "Symmetry", "pages": "623", "volume": "14"}, "authors": [{"authorId": "2085508", "name": "Youseef A. Alotaibi"}], "citations": [{"paperId": "5e7e351f82fc15bdf77c55ca7284cf55440c6fb7", "title": "A Modified Class Topper Algorithm and its Hybridization for Clustering Agriculture, Health-care and Geology Data"}, {"paperId": "36a13d8e5bd21182a0baec06c7a2e8dcf987feb2", "title": "Developing Methodologies for Navigation using Multimedia to help the Visually Impared"}, {"paperId": "8039e672c65ecb8c377608c648aad0ef75b05ff8", "title": "Modeling Optimization of Prefabricated Parallel Production Manufacturing System Based on Hybrid Algorithm of Variable Neighborhood Taboo Search"}, {"paperId": "75fd332701281859c59713cb8749cb3b814e2988", "title": "Stochastic Neural Network Optimization based IoT Data Clustering Algorithm"}, {"paperId": "3a45d445a6b540cb75bcb5562a3dadcb2328a844", "title": "Spectrum Aware Unequal Clustering with Route Selection Protocol for Energy Efficient Cognitive Radio Wireless Sensor Networks"}, {"paperId": "f8a8ddc1bd3be9c8cc3ee053c293864fef75fa99", "title": "OPT-RNN-DBSVM: OPTimal Recurrent Neural Network and Density-Based Support Vector Machine"}, {"paperId": "1f405d63683cd96fe42790df7e50b47d3223c4d5", "title": "Hybrid Muddy Soil Fish Optimization-Based Energy Aware Routing in IoT-Assisted Wireless Sensor Networks"}, {"paperId": "09d1281b8ba9d6045587419b36e1ffc570dc8db5", "title": "Design of a Telepresence Robot to Avoid Obstacles in IoT-Enabled Sustainable Healthcare Systems"}, {"paperId": "e82ae7e5ad84ae4971782dba32a9c49c21ecdb34", "title": "Optimizing airport slot scheduling problem using optimization algorithms"}, {"paperId": "a27369903e2d51524d6741fc8265b8e85a4a9ac5", "title": "A novel Algorithm Adaptive Autarchoglossans Lizard Foraging (AALF) in a shunt active power filter connected to MPPT-based photovoltaic array"}, {"paperId": "1895aa21f966f97d481cf235d57513392e06e12c", "title": "Telepresence Robot with DRL Assisted Delay Compensation in IoT-Enabled Sustainable Healthcare Environment"}, {"paperId": "da94c3d388c4ab609785824901a8ac254cba22fa", "title": "An Enhanced GWO Algorithm with Improved Explorative Search Capability for Global Optimization and Data Clustering"}, {"paperId": "39bddbe2aba43e1868ef90d2c7fd5e05c8953b94", "title": "Gradient-Based Optimizer (GBO): A Review, Theory, Variants, and Applications"}, {"paperId": "50fdb8024f6155e19462d445491b5ee3dcd92fa3", "title": "Optimal Scheduling of Plug-in Electric Vehicles Using Binary Gravitational Search Algorithm with A Suitable Decision Function"}, {"paperId": "3b8be395109a38151da6292e6573ce4970fe10f6", "title": "Intelligent Adaptive Optimisation Method for Enhancement of Information Security in IoT-Enabled Environments"}, {"paperId": "64c0551add8acf83b2582e94783bf640dc09493a", "title": "Research on Optimization Method and Algorithm Design of Green Simultaneous Pick-up and Delivery Vehicle Scheduling under Uncertain Demand"}, {"paperId": "550c6901754127e163ea5e1244c44a5d3d0c49bc", "title": "A Comprehensive Review of Bat Inspired Algorithm: Variants, Applications, and Hybridization"}, {"paperId": "ae13fdcbfb66975396b3e2867ba43568c28cbf8c", "title": "Special Features and Applications on Applied Metaheuristic Computing"}, {"paperId": "ede0dc03866ab8b1c68863001bb8abb145ad3473", "title": "Rapid Text Retrieval and Analysis Supporting Latent Dirichlet Allocation Based on Probabilistic Models"}, {"paperId": "593728eb51c466334b0c8bc0d9d96a6444682bc8", "title": "Improved Metaheuristic-Driven Energy-Aware Cluster-Based Routing Scheme for IoT-Assisted Wireless Sensor Networks"}, {"paperId": "16034d8e47bbbe7970099a839561a060f91e7651", "title": "Recent Advances in Harris Hawks Optimization: A Comparative Study and Applications"}, {"paperId": "ff0d4f3209f293ebe8ab2a7eb54ad870ab28be6a", "title": "Singapore Soundscape Site Selection Survey (S5): Identification of Characteristic Soundscapes of Singapore via Weighted k-means Clustering"}, {"paperId": "6e891e8c8f0a8375bf79ac79ba577899cb76bc49", "title": "A Normal Distributed Dwarf Mongoose Optimization Algorithm for Global Optimization and Data Clustering Applications"}, {"paperId": "06c7c95d52dfd32718161a01acc27d845613e23e", "title": "Chaotic Search-and-Rescue-Optimization-Based Multi-Hop Data Transmission Protocol for Underwater Wireless Sensor Networks"}, {"paperId": "10c102de76c5fbd3f81ba1dfb6bf0002cb7a3182", "title": "Reinforcement learning-based AI assistant and VR play therapy game for children with Down syndrome bound to wheelchairs"}, {"paperId": "295dda7a62a6aee0ab26d96a98646e4990db807c", "title": "Vision graph neural network-based neonatal identification to avoid swapping and abduction"}, {"paperId": "0082ada069a1cbef92cac700c589c7fbf943334d", "title": "Electroencephalogram based face emotion recognition using multimodal fusion and 1-D convolution neural network (ID-CNN) classifier"}, {"paperId": "adebe39c8691f7cad3ee59d5ebb6da92a2ac670d", "title": "Multi-Tier Sentiment Analysis of Social Media Text Using Supervised Machine Learning"}, {"paperId": "8352ddce5d13f5e47dd83ec30e5471af555299ea", "title": "Fault Coverage-Based Test Case Prioritization and Selection Using African Buffalo Optimization"}, {"paperId": "2f8253a36ec7217246ee48bd41492df22ae85d72", "title": "The pathway of digital learning environments in advancing Sustainable Development Goals (SDGs): A Bibliometric analysis covering three decades of research"}]}
