{"paperId": "36d2584d579065758b3cbd7ef51fd883255f796e", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Robust Federated Learning with Parameter Classification and Weighted Aggregation Against Noisy Labels", "abstract": "In recent years, federated learning (FL) has gained increasing attention as a promising approach for preserving privacy in machine learning, as it enables multiple clients to jointly train a shared model while avoiding the need to share their raw data. However, many existing works towards FL assume that the data owned by clients are correctly labeled, which is unrealistic. To mitigate the performance degradation incurred by incorrect labels (i.e., noisy labels), we propose a robust federated learning method with parameter classification and weighted aggregation. Specifically, it classifies the parameters of the deep neural network into critical and noncritical ones according to whether they are important to fit data with clean labels, and updates these two kinds of parameters based on different rules to prevent the model from overfitting noisy labels. Furthermore, a weighted aggregation strategy is designed for the global training phase, which enhances the predictive performance of the global model by strengthening the contributions of clients with higher learning efficiency. Finally, the experimental results demonstrate that the proposed method efficiently addresses the performance degradation caused by noisy labels with low latency and exhibits superior stability compared to the baselines.", "venue": "Global Communications Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-04", "journal": {"name": "GLOBECOM 2023 - 2023 IEEE Global Communications Conference", "pages": "2445-2450"}, "authors": [{"authorId": "2287873789", "name": "Qun Li"}, {"authorId": "2287842657", "name": "Congying Duan"}, {"authorId": "2240166100", "name": "Siguang Chen"}], "citations": []}
