{"paperId": "36ec20d088022bd2cb67f5eea53b26b27d0c4d44", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Deep Convolutional Neural Network for Accurate Prediction of Seismic Events", "abstract": "—In recent years, the realm of seismology has witnessed an increased integration of advanced computational techniques, seeking to enhance the precision and timeliness of earthquake predictions. The paper titled \"Deep Convolutional Neural Network and Machine Learning Enabled Framework for Analysis and Prediction of Seismic Events\" embarks on an ambitious exploration of this interstice, marrying the formidable prowess of Deep Convolutional Neural Networks (CNNs) with an array of machine learning algorithms. At the forefront of our investigation is the Deep CNN, known for its unparalleled capability to process spatial hierarchies and multi-dimensional seismic data. Accompanying this neural behemoth is LightGBM, a gradient boosting framework that offers superior speed and performance, especially with voluminous datasets. Additionally, conventional neural networks, noted for their adeptness in pattern recognition, offer a robust method to gauge the intricacies of seismic data. Our exploration doesn't halt here; the research delves deeper with Random Forest and Support Vector Machines (SVM), both renowned for their resilient performance in classification tasks. By amalgamating these diverse methodologies, this research crafts a multifaceted and synergistic framework. The culmination is a sophisticated tool poised to not only discern the minutiae of seismic activities with heightened accuracy but to predict forthcoming events with a degree of certainty previously deemed elusive. In this era of escalating seismic activities, our research offers a timely beacon, heralding a future where communities are better equipped to respond to the Earth's capricious tremors.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2258760980", "name": "Assem Turarbek"}, {"authorId": "2265054786", "name": "Maktagali A. Bektemesov"}, {"authorId": "103612931", "name": "Aliya Ongarbayeva"}, {"authorId": "2265014482", "name": "Assel Orazbayeva"}, {"authorId": "2265057297", "name": "Aizhan Koishybekova"}, {"authorId": "2204217701", "name": "Yeldos Adetbekov"}], "citations": []}
