{"paperId": "36f58e13341b1197c10d0f747dd3e8cbbb5b46d4", "publicationVenue": null, "title": "MONSOON: Multi-Step Optimization and Execution of Queries with Partially Obscured Predicates", "abstract": "User-defined functions (UDFs) in modern SQL database systems and Big Data processing systems such as Spark---that offer API bindings in high-level languages such as Python or Scala---make automatic optimization challenging. The foundation of modern database query optimization is the collection of statistics describing the data to be processed, but when a database or Big Data computation is partially obscured by UDFs, good statistics are often unavailable. In this paper, we describe a query optimizer called the Monsoon optimizer. In the presence of UDFs, the Monsoon optimizer may choose to collect statistics on the UDFs, and then run the computation. Or, it may optimize and execute part of the plan, collecting statistics on the result of the partial plan, followed by a re optimization step, with the process repeated as needed. Monsoon decides how to interleave execution and statistics collection in a principled fashion by formalizing the problem as a Markov decision process.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-05-29", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "1726079308", "name": "Sourav Sikdar"}, {"authorId": "1741680", "name": "C. Jermaine"}], "citations": [{"paperId": "4ca27b4354236d6c54966c8bfff4f24d182e3a0f", "title": "Virtual self-adaptive bitmap for online cardinality estimation"}, {"paperId": "b127df5d7a2ef34ead38f60d0ec4f83586fea8e3", "title": "Maliva: Using Machine Learning to Rewrite Visualization Queries Under Time Constraints"}, {"paperId": "898fce6016ec5f5ff10fe5fcc6475c16e7dfe829", "title": "Procedural Extensions of SQL: Understanding their usage in the wild"}, {"paperId": "7ab161895d05cbdab1c33303a5bbd96218049114", "title": "Revisiting Runtime Dynamic Optimization for Join Queries in Big Data Management Systems"}, {"paperId": "b14ba832ff820c0bf019f69b4350f781ffb38447", "title": "Development of Intelligent Tools for Detecting Resource-intensive Database Queries"}]}
