{"paperId": "37005eb1cced5212069482c4b522de9c225e8eec", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Fair k-Center Clustering in MapReduce and Streaming Settings", "abstract": "Center-based clustering techniques are fundamental to many real-world applications such as data summarization and social network analysis. In this work, we study the problem of fairness aware k-center clustering over large datasets. We are given an input dataset comprising a set of n points, where each point belongs to a specific demographic group characterized by a protected attribute, such as race or gender. The goal is to identify k clusters such that all clusters have considerable representation from all groups and the maximum radius of these clusters is minimized. The majority of the prior techniques do not scale beyond 100K points for k = 50. To address the scalability challenges, we propose an efficient 2-round algorithm for the MapReduce setting that is guaranteed to be a 9-approximation to the optimal solution. Additionally, we develop a 2-pass streaming algorithm that is efficient and has a low memory footprint. These theoretical results are complemented with an empirical evaluation on million-scale datasets, demonstrating that our techniques are effective to identify high-quality fair clusters and efficient as compared to the state-of-the-art.", "venue": "The Web Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-04-25", "journal": {"name": "Proceedings of the ACM Web Conference 2022"}, "authors": [{"authorId": "2543386", "name": "Suman Kalyan Bera"}, {"authorId": "1976586", "name": "Syamantak Das"}, {"authorId": "2663974", "name": "Sainyam Galhotra"}, {"authorId": "48712933", "name": "S. Kale"}], "citations": [{"paperId": "62d849ca88e294e186cbbf3145945940ed1253ab", "title": "Efficient Constrained k-Center Clustering with Background Knowledge"}, {"paperId": "6850f09001907ad74441f589672cb37d21b6af2a", "title": "New Algorithms for Fair k-Center Problem with Outliers and Capacity Constraints"}, {"paperId": "83fa022adab22adc4f07ea2f320d40ea5caa6e4e", "title": "Near-Optimal Algorithms for Constrained k-Center Clustering with Instance-level Background Knowledge"}, {"paperId": "62eb0847f77001a46529b51cc4ba1c6f4f91361f", "title": "F3KM: Federated, Fair, and Fast k-means"}, {"paperId": "a544840003ccea90e219ad05e50a385b74c2dc65", "title": "Massively parallel and streaming algorithms for balanced clustering"}, {"paperId": "28dbb804bf2a358a1ae30756272a39ddfa039604", "title": "Fair Streaming Principal Component Analysis: Statistical and Algorithmic Viewpoint"}, {"paperId": "e8057a46e762e56b97e721fd8298e0cff45352e7", "title": "Dynamic algorithms for k-center on graphs"}, {"paperId": "036de0c6759dccc48e5bcfbe8729140d73ad834f", "title": "Fair k-Center: a Coreset Approach in Low Dimensions"}]}
