{"paperId": "37094801bdcd69a07915ac77cd6739320180ef57", "publicationVenue": {"id": "3c77be64-fcd3-444d-a98d-f563ab841a7e", "name": "Pharmaceutics", "type": "journal", "issn": "1999-4923", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169204", "alternate_urls": ["https://www.mdpi.com/journal/pharmaceutics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169204"]}, "title": "Extracellular Vesicles of Probiotics: Shedding Light on the Biological Activity and Future Applications", "abstract": "For many decades, the proper functioning of the human body has become a leading scientific topic. In the course of numerous experiments, a striking impact of probiotics on the human body has been documented, including maintaining the physiological balance of endogenous microorganisms, regulating the functioning of the immune system, enhancing the digestive properties of the host, and preventing or alleviating the course of many diseases. Recent research, especially from the last decade, shows that this health-benefiting activity of probiotics is largely conditioned by the production of extracellular vesicles. Although the importance of extracellular vesicles in the virulence of many live-threatening pathogens is widely described in the literature, much less is known with respect to the health-promoting effect of extracellular vesicles secreted by non-pathogenic microorganisms, including probiotics. Based on this, in the current review article, we decided to collect the latest literature data on the health-inducing properties of extracellular vesicles secreted by probiotics. The characteristics of probiotics’ extracellular vesicles will be extended by the description of their physicochemical properties and the proteome in connection with the biological activities exhibited by these structures.", "venue": "Pharmaceutics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Pharmaceutics", "volume": "15"}, "authors": [{"authorId": "29885240", "name": "P. Krzyżek"}, {"authorId": "2159723975", "name": "Beatrice Marinacci"}, {"authorId": "2134217782", "name": "Irene Vitale"}, {"authorId": "48428312", "name": "R. Grande"}], "citations": [{"paperId": "fbaeea7cbfb2caa41ce13b334b9a7a7a345ce4b7", "title": "Next-Generation Probiotics as Novel Therapeutics for Improving Human Health: Current Trends and Future Perspectives"}, {"paperId": "d20e5d1afec4fb28b45811de1b3b0371c465caf2", "title": "The inhibition effects of Lentilactobacillus buchneri-derived membrane vesicles on AGS and HT-29 cancer cells by inducing cell apoptosis"}, {"paperId": "3f195f966783d9f27986498c9bb25d4af0182032", "title": "A mini-review: valuable allies for human health: probiotic strains of Limosilactobacillus reuteri"}, {"paperId": "f0620965624fa04232294eaa52aaa10a00b06ff9", "title": "Latest Update on Outer Membrane Vesicles and Their Role in Horizontal Gene Transfer: A Mini-Review"}, {"paperId": "6be9cd55603f211cdacf6a1272a92ca9a47ba3e9", "title": "Membrane Vesicles as Drug Delivery Systems: Source, Preparation, Modification, Drug Loading, In Vivo Administration and Biodistribution, and Application in Various Diseases"}, {"paperId": "c1bd0916e58abd2fc7f963f8f2847ebe92ea6d14", "title": "Komagataeibacter oboediens changes outer membrane vesicle-associated activities after exposure on the International Space Station"}]}
