{"paperId": "3717b6e1c0f12c1810af0d746c845dbf9eab5a3e", "publicationVenue": {"id": "413f9528-f9e7-4598-88b8-5751fda774f8", "name": "Journal of Educators Online", "type": "journal", "alternate_names": ["J Educ Online"], "issn": "1547-500X", "url": "https://www.thejeo.com/"}, "title": "Sequence Analysis in Distributed Interactive Learning Environments: Visualization and Clustering of Exploratory Behavior", "abstract": "Constructivist learning posits that learners should construct their own meaning and organization of knowledge through exploration. Web-based distributed interactive learning (DIL) environments are a type of information and communications technology that supports learners in exploring learning materials. Although educators can access learners’ navigational paths on DIL websites, the exploratory nature of such paths cannot be efficiently analyzed. Educators cannot determine the effects of small improvements or adjustments on DIL websites. In this study, the navigational paths of learners using alternative versions of a DIL website were recorded and analyzed using integrated sequence analysis methods. Visualization and clustering of the sequences revealed five common navigational patterns, and associations between the navigational patterns and learning outcomes were also identified. The findings show how educators can understand and improve the design of DIL websites by performing a sequence analysis.", "venue": "Journal of Educators Online", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-07-31", "journal": {"name": "Journal of Educators Online"}, "authors": [{"authorId": "33541690", "name": "Jeffrey C. F. Ho"}, {"authorId": "1694510", "name": "Mike Z. Yao"}], "citations": [{"paperId": "178ebca45d73be8f082ccc0197c0a252708a70de", "title": "A survey of visual analytics techniques for online education"}, {"paperId": "e44593ce562bff40fb04702f7f05caf14c34a557", "title": "Research on Interactive Training of Enterprise Employees"}, {"paperId": "910333eee0ac5bfbaf35247172978c3ecab4f395", "title": "Encouraging Learners to Explore Websites: Hyperlinks as Invitations"}]}
