{"paperId": "371a39218794c3313b8fd702be127d0f65bb2571", "publicationVenue": {"id": "faae4228-a2f7-40bd-818e-ab1f685df91a", "name": "Forests", "type": "journal", "issn": "1999-4907", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156829", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156829", "https://www.mdpi.com/journal/forests"]}, "title": "The Development of a Set of Novel Low Cost and Data Processing-Free Measuring Instruments for Tree Diameter at Breast Height and Tree Position", "abstract": "In current forestry investigation studies, the research hotspots have tended to concentrate on ascertaining the precision of certain tree parameters. This has resulted in an augmented intricacy of the technique in terms of algorithms and observation instruments. The complexity of the technology and the cost of the equipment make it impossible to use for large-scale forest surveys, for example, a national forest inventory (NFI). The aim of our study was to design a new type of low-cost measuring method that could be utilized in a NFI and in developing countries. Meanwhile, the newly designed method was expected to be able to output certain forest measurement factors without necessitating data processing by NFI field investigators. Based on these objectives, we developed a measuring method that included hardware comprised of two tools. The first tool was an electronic measuring tape that contained a microcontroller unit (MCU) and could automatically record and collaborate with other equipment via wireless protocols. The second tool was a tree stem position mapper that utilized our own designed mechanisms. The results showed that the tree DBH measurements exhibited a 0.05 cm (0.20%) bias and a 0.36 cm (1.45%) root mean square error (RMSE), and the biases on the x-axis and the y-axis of the tree position estimations were −15.92–9.92 cm and −25.90–10.88 cm, respectively, accompanied by corresponding RMSEs of 15.27–29.40 cm and 14.49–34.68 cm. Moreover, an efficiency test determined that the average measurement time per tree was 20.34 s, thus, demonstrating a marked improvement in speed by nearly one-fold compared to the conventional method. Meanwhile, this measurement kit costs less than 150 Euros and is economically suitable for large-scale applications. We posit that our method has the potential to serve as a standard tool in a Chinese NFI and in developing countries in the future.", "venue": "Forests", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-26", "journal": {"name": "Forests"}, "authors": [{"authorId": "2167485709", "name": "Linhao Sun"}, {"authorId": "2811136", "name": "Zhongke Feng"}, {"authorId": "2167184219", "name": "Yakui Shao"}, {"authorId": "9950829", "name": "Linxin Wang"}, {"authorId": "2216483234", "name": "Jueying Su"}, {"authorId": "2211171335", "name": "Tiantian Ma"}, {"authorId": "2213844247", "name": "Dangui Lu"}, {"authorId": "2216037309", "name": "Jiayi An"}, {"authorId": "2189947708", "name": "Yongqi Pang"}, {"authorId": "2213107781", "name": "Shahzad Fahad"}, {"authorId": "47825073", "name": "Wen Wang"}, {"authorId": "2211882392", "name": "Zhichao Wang"}], "citations": [{"paperId": "3a1e5768d1f77df61e2116c358693a6e4e55dc68", "title": "Development of a Real-Time Continuous Measurement System for Tree Radial Direction"}]}
