{"paperId": "374e461dbbf2ed4f8c2dfdfbb505e2a51a264ed2", "publicationVenue": {"id": "5552b3d9-73b0-435f-8515-a135f23fcbba", "name": "Conference on Emerging Network Experiment and Technology", "type": "conference", "alternate_names": ["Conf Emerg Netw Exp Technol", "CoNEXT"], "url": "http://www.wikicfp.com/cfp/program?id=555"}, "title": "SOAR: minimizing network utilization with bounded in-network computing", "abstract": "In-network computing via smart networking devices is a recent trend for modern datacenter networks. State-of-the-art switches with near line rate computing and aggregation capabilities are developed to enable, e.g., acceleration and better utilization for modern applications like big data analytics, and large scale distributed and federated machine learning. We formulate and study the problem of activating a limited number of in-network computing devices within a network, aiming at reducing the overall network utilization for a given workload. Such limitations on the number of in-network computing elements per workload arise, e.g., in incremental upgrades of network infrastructure, and are also due to requiring specialized middleboxes, or FPGAs, that should support heterogeneous workloads, and multiple tenants. We present an optimal and efficient algorithm for placing such devices in tree networks with arbitrary link rates, and further evaluate our proposed solution in various scenarios and for various tasks. Our results show that having merely a small fraction of network devices support in-network aggregation can lead to a significant reduction in network utilization. Furthermore, we show that various intuitive strategies for performing such placements exhibit significantly inferior performance compared to our solution, for varying workloads, tasks, and link rates.", "venue": "Conference on Emerging Network Experiment and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-10-27", "journal": {"name": "Proceedings of the 17th International Conference on emerging Networking EXperiments and Technologies"}, "authors": [{"authorId": "84341959", "name": "Raz Segal"}, {"authorId": "145707494", "name": "C. Avin"}, {"authorId": "2072519", "name": "Gabriel Scalosub"}], "citations": [{"paperId": "628e918632edb5f60ada2cb6562799a97205ca9f", "title": "GRID: Gradient Routing With In-Network Aggregation for Distributed Training"}, {"paperId": "4cc6008b3615804bd02f55ec9848028d0c726968", "title": "Maximizing Aggregation Throughput for Distributed Training with Constrained In-Network Computing"}, {"paperId": "f70719547a33377ac22cfc106768233c45278eba", "title": "In-network aggregation for data center networks: A survey"}, {"paperId": "5d7a864de646e3f6150c707cf3250256c0b4a138", "title": "QUIC-FL: Quick Unbiased Compression for Federated Learning"}, {"paperId": "5291e78106bfb416715dda5fb3d151389554ee31", "title": "Constrained In-network Computing with Low Congestion in Datacenter Networks"}]}
