{"paperId": "375e0e7dd3bca066228b3392abcb3d38bc5be04a", "publicationVenue": {"id": "169221cc-20d6-4d6f-a35e-8b9046529e13", "name": "IEEE Open Journal of Signal Processing", "type": "journal", "alternate_names": ["IEEE Open J Signal Process"], "issn": "2644-1322", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782710"}, "title": "Scalable Spectral Clustering With Nyström Approximation: Practical and Theoretical Aspects", "abstract": "Spectral clustering techniques are valuable tools in signal processing and machine learning for partitioning complex data sets. The effectiveness of spectral clustering stems from constructing a non-linear embedding based on creating a similarity graph and computing the spectral decomposition of the Laplacian matrix. However, spectral clustering methods fail to scale to large data sets because of high computational cost and memory usage. A popular approach for addressing these problems utilizes the Nyström method, an efficient sampling-based algorithm for computing low-rank approximations to large positive semi-definite matrices. This paper demonstrates how the previously popular approach of Nyström-based spectral clustering has severe limitations. Existing time-efficient methods ignore critical information by prematurely reducing the rank of the similarity matrix associated with sampled points. Also, current understanding is limited regarding how utilizing the Nyström approximation will affect the quality of spectral embedding approximations. To address the limitations, this work presents a principled spectral clustering algorithm that exploits spectral properties of the similarity matrix associated with sampled points to regulate accuracy-efficiency trade-offs. We provide theoretical results to reduce the current gap and present numerical experiments with real and synthetic data. Empirical results demonstrate the efficacy and efficiency of the proposed method compared to existing spectral clustering techniques based on the Nyström method and other efficient methods. The overarching goal of this work is to provide an improved baseline for future research directions to accelerate spectral clustering.", "venue": "IEEE Open Journal of Signal Processing", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-25", "journal": {"name": "IEEE Open Journal of Signal Processing", "pages": "242-256", "volume": "1"}, "authors": [{"authorId": "1398664414", "name": "F. Pourkamali-Anaraki"}], "citations": [{"paperId": "16cb272bb8f90d73c5b8b35b56dc340eb0f1ff01", "title": "Evaluating Regression Models with Partial Data: A Sampling Approach"}, {"paperId": "72ac38f03a21febf6270fae49bbb791ef3909d80", "title": "Eigenvalue based spectral classification"}, {"paperId": "5a3441c5e29cc01cee203201989193b2b06f923d", "title": "Approximate Orthogonal Spectral Autoencoders for Community Analysis in Social Networks"}, {"paperId": "43dad2b279f19e89ecf7beb11613cfd8eceb6244", "title": "The Development Trend of China’s Agricultural Product Cold Chain Logistics from the Perspective of Big Data"}, {"paperId": "90c1bbf58447bc7e2ef09e7a83cadaf20798dbf2", "title": "D-CBRS: Accounting for Intra-Class Diversity in Continual Learning"}, {"paperId": "b428c76f5ba767fe2e416795d1251fcb47ffd718", "title": "SCAR - Spectral Clustering Accelerated and Robustified"}, {"paperId": "c94165ac9aba5cb39c0e1a5df1bbce21cb506658", "title": "Digital Fingerprinting of Microstructures"}, {"paperId": "42e05db84b3cb5d472e6462df0c7c92387d4f698", "title": "Kernel Matrix Approximation on Class-Imbalanced Data With an Application to Scientific Simulation"}]}
