{"paperId": "3775e5c475d53b9e79b62d643c34680390aa5f47", "publicationVenue": null, "title": "COPRAO: A Capability Aware Query Optimizer for Reconfigurable Near Data Processors", "abstract": "Placing the processing power near the data, rather than shipping the data to the processor is inevitable and demanding in the era of Big Data. Thereby near-data processors gained much attention in recent years as they can reduce the massive data transfer between data sources and computing nodes. However, it is important to rethink the computing architecture to achieve the maximum advantage of near-data-processing technology, particularly for query-processing applications. In this paper, we propose a new approach to the query optimization in a relational DBMS, which considers the specialized computing capabilities of the attached FPGA-based near-data processors. The paper focuses on the hardware-conscious optimization using extended rules and cost models as well as on refining the optimization strategies for changes in the hardware state of execution. Our evaluations demonstrate that the proposed query-optimization approach can improve the processing of queries using near-data processors based on FPGAs.", "venue": "2021 IEEE 37th International Conference on Data Engineering Workshops (ICDEW)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering Workshops (ICDEW)", "pages": "54-59"}, "authors": [{"authorId": "1410789156", "name": "G. LekshmiB."}, {"authorId": "1399432410", "name": "K. Meyer-Wegener"}], "citations": [{"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "16298f9b7e4b510f0094720c4c65516922910313", "title": "Past, Present and Future of Computational Storage: A Survey"}, {"paperId": "b14ba832ff820c0bf019f69b4350f781ffb38447", "title": "Development of Intelligent Tools for Detecting Resource-intensive Database Queries"}]}
