{"paperId": "3784ab2bf3474c03515183e2556ce9e5b35fc187", "publicationVenue": null, "title": "Fighting against COVID‐19: Innovations and applications", "abstract": "COVID-19 has triggered over 6.90 million deaths worldwide until the cutoff date of April 23, 2023. The impact of the pandemic on individual countries and regions varies greatly, with some countries experiencing much higher numbers of cases and deaths than others. The highest number of reported deaths has been in the United States, followed by Brazil, India, Mexico, and Russia. However, it is worth noting that some countries may have underreported cases and deaths due to limited testing capacity or other factors. The COVID-19 pandemic has had significant economic and social impacts, with widespread disruptions to businesses, travel, and daily life. The full extent of the pandemic's effects on society may take years to understand and address fully. To fight against COVID-19, Seghier asked the question, what can bioengineers, computer scientists, and big data specialists bring to the table? Particularly, the author predicted artificial intelligence (AI) could help fight against COVID-19. Scientists and engineers worldwide have developed many powerful AI-based innovations and reported successful applications in fighting against COVID-19. Some excellent research outputs were published in the virtual special issue of the International Journal of Imaging Systems and Technology, one of the fast-growing journals in imaging science and photographic technology.", "venue": "International journal of imaging systems and technology (Print)", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-29", "journal": {"name": "International Journal of Imaging Systems and Technology", "volume": "33"}, "authors": [{"authorId": "2211918106", "name": "Yudong Zhang"}], "citations": [{"paperId": "b993baf2bc89e31fcf51c641a04b23e22c6defa3", "title": "Explainable artificial intelligence and machine learning: novel approaches to face infectious diseases challenges"}]}
