{"paperId": "378c2332df0c06c4a8aac723b62e3266fea3c48b", "publicationVenue": null, "title": "DIAERESIS: RDF Data Partitioning and Query Processing on SPARK", "abstract": ". The explosion of the web and the abundance of linked data demand effective and efﬁcient methods for storage, management, and querying. Apache Spark is one of the most widely used engines for big data processing, with more and more systems adopting it for efﬁcient query answering. Existing approaches exploiting Spark for querying RDF data, adopt partitioning techniques for reducing the data that need to be accessed in order to improve efﬁciency. However, simplistic data partitioning fails, on one hand, to minimize data access and on the other hand to group data usually queried together. This is translated into limited improvement in terms of efﬁciency in query answering. In this paper, we present DIAERESIS, a novel platform that accepts as input an RDF dataset and effectively partitions it, minimizing data access and improving query answering efﬁciency. To achieve this, DIAERESIS ﬁrst identiﬁes the top-k most important schema nodes, i.e., the most important classes, as centroids and distributes the other schema nodes to the centroid they mostly depend on. Then, it allocates the corresponding instance nodes to the schema nodes they are instantiated under. Our algorithm enables ﬁne-tuning of data distribution, signiﬁcantly reducing data access for query answering. We experimentally evaluate our approach using both synthetic and real workloads, strictly dominating existing state-of-the-art, showing that we improve query answering in several cases by orders of magnitude.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2279222", "name": "Georgia Troullinou"}, {"authorId": "51039511", "name": "Giannis Agathangelos"}, {"authorId": "1821005", "name": "H. Kondylakis"}, {"authorId": "12619004", "name": "Kostas Stefanidis"}, {"authorId": "1705358", "name": "D. Plexousakis"}], "citations": []}
