{"paperId": "379cf1659e3b9b92413b4fca878c8861ae859db4", "publicationVenue": {"id": "a59db0cb-8287-4db4-9378-0eb4c692f830", "name": "International Symposium on Service Oriented Software Engineering", "type": "conference", "alternate_names": ["IEEE International Conference on System of Systems Engineering", "Int Symp Serv Oriented Softw Eng", "International Conference on System of Systems Engineering", "SoSE", "Service Oriented Software Engineering", "Serv Oriented Softw Eng", "Int Conf Syst Syst Eng", "IEEE Int Conf Syst Syst Eng", "SOSE"]}, "title": "Computing at Massive Scale: Scalability and Dependability Challenges", "abstract": "Large-scale Cloud systems and big data analytics frameworks are now widely used for practical services and applications. However, with the increase of data volume, together with the heterogeneity of workloads and resources, and the dynamic nature of massive user requests, the uncertainties and complexity of resource management and service provisioning increase dramatically, often resulting in poor resource utilization, vulnerable system dependability, and user-perceived performance degradations. In this paper we report our latest understanding of the current and future challenges in this particular area, and discuss both existing and potential solutions to the problems, especially those concerned with system efficiency, scalability and dependability. We first introduce a data-driven analysis methodology for characterizing the resource and workload patterns and tracing performance bottlenecks in a massive-scale distributed computing environment. We then examine and analyze several fundamental challenges and the solutions we are developing to tackle them, including for example incremental but decentralized resource scheduling, incremental messaging communication, rapid system failover, and request handling parallelism. We integrate these solutions with our data analysis methodology in order to establish an engineering approach that facilitates the optimization, tuning and verification of massive-scale distributed systems. We aim to develop and offer innovative methods and mechanisms for future computing platforms that will provide strong support for new big data and IoE (Internet of Everything) applications.", "venue": "International Symposium on Service Oriented Software Engineering", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-03-01", "journal": {"name": "2016 IEEE Symposium on Service-Oriented System Engineering (SOSE)", "pages": "386-397"}, "authors": [{"authorId": "1894612", "name": "Renyu Yang"}, {"authorId": "50874581", "name": "Jie Xu"}], "citations": [{"paperId": "18896abb17580c899c58413c52d979ceb3219985", "title": "An Approach to Workload Generation for Cloud Benchmarking: a View from Alibaba Trace"}, {"paperId": "54e1656ad846f1a9c3db539d5cb67802907c2fda", "title": "Arktos: A Hyperscale Cloud Infrastructure for Building Distributed Cloud"}, {"paperId": "bfcd196e412baaff9e9bc70998e029725a50f4e2", "title": "Joint optimization of cache placement and request routing in unreliable networks"}, {"paperId": "03af9fee07252002d36e5b675a57844693810d1a", "title": "Blockchain-based green big data visualization: BGbV"}, {"paperId": "cfa994a878c05028867cc52bbfbb3eb79c1da368", "title": "Distributed Database Using Sharding Database Architecture"}, {"paperId": "6ab3434ebb28422a29aad85f4768cbc1b8bed355", "title": "Scalability and Flexibility Imparted by the Parallel Processing Models for Computing HCF and LCM of Large Volume of Numeric Data"}, {"paperId": "2ccd137081c8abff273484b0ad2d0cc7361ea0b9", "title": "Enhancing the Scope for Automated Code Generation and Parallelism by Optimizing Loops through Loop Unrolling"}, {"paperId": "d5fa21d7d5cd2a805dee79abdce294f732e72333", "title": "Study of the Functioning of the Distributed Computer System with a Resource Control Mechanism Based on a Network-Centric Approach"}, {"paperId": "576d93fb6fb0af80f2da27e05b0d1d4a8edc1945", "title": "SysOptic: A Fine-Grained Monitoring System for Virtual Machines Based on PMU"}, {"paperId": "1bb5b88814011429c4e07015ce9ee6de16eab153", "title": "Enhancing Dependability in Big Data Analytics Enterprise Pipelines"}, {"paperId": "27302a851443d80ded0634e71770d488d6c32e3b", "title": "Dependable and Coordinated Resources Allocation Algorithms for Distributed Computing"}, {"paperId": "61bd5b3421bde942bb6e12de5a3a48fd7884e439", "title": "Intelligent Resource Scheduling at Scale: A Machine Learning Perspective"}, {"paperId": "55686e005fa4ca77091b718575fa4477559c695a", "title": "A Scalable lnternet-of-Vehicles Service over Joint Clouds"}, {"paperId": "aa269b3c94dd48702ad2791a840fa803db0fe060", "title": "Cider: a Rapid Docker Container Deployment System through Sharing Network Storage"}, {"paperId": "05e10d46587aafa7b27d0634b6ad5a5bc1956704", "title": "Reliable Computing Service in Massive-Scale Systems through Rapid Low-Cost Failover"}, {"paperId": "7e2dfccdae7ebe7690ea63a200172407ec6506dd", "title": "The Internet of Simulation: Enabling agile model based systems engineering for cyber-physical systems"}, {"paperId": "70fbc5bb76c7c08980cb34cb5fba5bbf3a573e27", "title": "Massive-Scale Automation in Cyber-Physical Systems: Vision & Challenges"}, {"paperId": "59ccb9b5394727288e47570248daaffd77e9248c", "title": "SMTP: An Optimized Storage Method for Vehicle Trajectory Data Exploiting Trajectory Patterns"}, {"paperId": "debb768b825d5cdf8bf28b7d4f4aa3f2c0dd6953", "title": "ScalaRDF: A Distributed, Elastic and Scalable In-Memory RDF Triple Store"}, {"paperId": "a9ca962f3134d21b001302e08dbd82296f44058f", "title": "Achieving software parallelism through alternative process models"}]}
