{"paperId": "37a37fc62e2d77b5791d3b4235120ce6719f59ae", "publicationVenue": {"id": "dee2646c-57cc-4b8b-92c8-98d0d78d35cf", "name": "International Conference on Predictive Models in Software Engineering", "type": "conference", "alternate_names": ["Int Conf Predict Model Softw Eng", "Predict Model Softw Eng", "PROMISE Winter Sch", "PROMISE", "PROMISE Winter School", "Predictive Models in Software Engineering"], "url": "http://promisedata.org/", "alternate_urls": ["http://www.promise-noe.eu"]}, "title": "Do Developers Fix Continuous Integration Smells?", "abstract": "Continuous Integration (CI) is a common software engineering practice in which the code changes are frequently merged into a software project repository after automated builds and tests have been successfully run. CI enables developers to quickly detect bugs, enhance the quality of the code, and shorten review times. However, developers may encounter some obstacles in following the CI principles. They may be unaware of them, they may follow the principles partially or they may even act against them. These behaviors result in CI smells. CI smells may in turn lessen the benefits of CI. Addressing CI smells rapidly allows software projects to fully reap the benefits of CI and increase its effectiveness. The main objective of this study is to investigate how frequently developers address CI smells. To achieve this objective, we first selected seven smells, then implemented scripts for detecting these smells automatically, and then ran the scripts in eight open-source software projects using GitHub Actions. To assess the resolution extent of CI smells by practitioners, we calculated the occurrences and time-to-resolution (TTR) of each smell. Our results suggest that Skipped Job smell has been fixed slightly more than other CI smells. The most frequently observed smell was Long Build, which was detected in an average of 19.03% of all CI builds. Fake Success smell does not get resolved in projects where it exists. Our study reveals that practitioners do not fix CI smells in practice. Further studies are needed to explore the underlying reasons behind this, in order to recommend more effective strategies for addressing these smells.", "venue": "International Conference on Predictive Models in Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2023-12-08", "journal": {"name": "Proceedings of the 19th International Conference on Predictive Models and Data Analytics in Software Engineering"}, "authors": [{"authorId": "2268783949", "name": "Ayberk Yaşa"}, {"authorId": "2268784811", "name": "Ege Ergül"}, {"authorId": "2268784696", "name": "Hakan Erdogmus"}, {"authorId": "2268785297", "name": "Eray Tüzün"}], "citations": []}
