{"paperId": "37a93811f3c4c21d9ef563c9f7187a269b56d10c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Distributed Tree-Based Machine Learning for Short-Term Load Forecasting With Apache Spark", "abstract": "Machine learning algorithms have been intensively applied to perform load forecasting to obtain better accuracies as compared to traditional statistical methods. However, with the huge increase in data size, sophisticated models have to be created which require big data platforms. Optimal and effective use of the available computational resources can be attained by maximizing the effective utilization of the cluster nodes. Parallel computing is demanded to allow for optimal resource utilization in dealing with smart grid big data. In this paper, a master-slave parallel computing paradigm is utilized and experimented with for load forecasting in a multi-AMI environment. The paper proposes a concurrent job scheduling algorithm in a multi-energy data source environment using Apache Spark. An efficient resource utilization strategy is proposed for submitting multiple Spark jobs to reduce job completion time. The optimal value of clustering is used in this paper to cluster the data into groups to be able to reduce the computational time additionally. Multiple tree-based machine learning algorithms are tested with parallel computation to evaluate the performance with tunable parameters on a real-world dataset. One thousand distribution transformers’ real data from Spain for three years are used to demonstrate the performance of the proposed methodology with a trade-off between accuracy and processing time.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "57372-57384", "volume": "9"}, "authors": [{"authorId": "150036694", "name": "Ameema Zainab"}, {"authorId": "143875780", "name": "A. Ghrayeb"}, {"authorId": "1390114913", "name": "H. Abu-Rub"}, {"authorId": "8930231", "name": "S. Refaat"}, {"authorId": "2256014907", "name": "O. Bouhali"}], "citations": [{"paperId": "81d771fde1ac497d6a759b2b911cfb1373fb08cd", "title": "Cyber-physical power systems: A comprehensive review about technologies drivers, standards, and future perspectives"}, {"paperId": "2efb1ce1f79de18692a4c1c3f4acee4fb69f28f1", "title": "Equipment- and Time-Constrained Data Acquisition Protocol for Non-Intrusive Appliance Load Monitoring"}, {"paperId": "139ec40e2a48557b7434ce3d3ea31e77cc3c13a1", "title": "Dynamic data replacement and adaptive scheduling policies in spark"}, {"paperId": "7a0617ef23e7cfb7c29cddbc1584bc61b87aa599", "title": "Big Data Management in Smart Grids: Technologies and Challenges"}]}
