{"paperId": "37ad92aa95a630371be2631d17a56c1785b5ac1e", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "CONSORT-TM: Text classification models for assessing the completeness of randomized controlled trial publications", "abstract": "Objective: To develop text classification models for determining whether the checklist items in the CONSORT reporting guidelines are reported in randomized controlled trial publications. Materials and Methods: Using a corpus annotated at the sentence level with 37 fine-grained CONSORT items, we trained several sentence classification models (PubMedBERT fine-tuning, BioGPT fine-tuning, and in-context learning with GPT-4) and compared their performance. To address the problem of small training dataset, we used several data augmentation methods (EDA, UMLS-EDA, text generation and rephrasing with GPT-4) and assessed their impact on the fine-tuned PubMedBERT model. We also fine-tuned PubMedBERT models limited to checklist items associated with specific sections (e.g., Methods) to evaluate whether such models could improve performance compared to the single full model. We performed 5-fold cross-validation and report precision, recall, F1 score, and area under curve (AUC). Results: Fine-tuned PubMedBERT model that takes as input the sentence and the surrounding sentence representations and uses section headers yielded the best overall performance (0.71 micro-F1, 0.64 macro-F1). Data augmentation had limited positive effect, UMLS-EDA yielding slightly better results than data augmentation using GPT-4. BioGPT fine-tuning and GPT-4 in-context learning exhibited suboptimal results. Methods-specific model yielded higher performance for methodology items, other section-specific models did not have significant impact. Conclusion: Most CONSORT checklist items can be recognized reasonably well with the fine-tuned PubMedBERT model but there is room for improvement. Improved models can underpin the journal editorial workflows and CONSORT adherence checks and can help authors in improving the reporting quality and completeness of their manuscripts.", "venue": "medRxiv", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2024-04-01", "journal": null, "authors": [{"authorId": "2294334322", "name": "MS Lan Jiang"}, {"authorId": "2294334636", "name": "MS Mengfei Lan"}, {"authorId": "2294334640", "name": "MS Joe D. Menke"}, {"authorId": "2294334204", "name": "PhD Colby J Vorland"}, {"authorId": "2294334496", "name": "PhD Halil Kilicoglu"}], "citations": []}
