{"paperId": "37b1897aabd2374f722312dbdabf28bbac914d0d", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) Datalography: Scaling Datalog Graph Analytics on Graph Processing Systems", "abstract": "—This paper presents the first Datalog evaluation engine for executing graph analytics over BSP-style graph processing engines. Building on recent advances in Datalog that support efficient evaluation of aggregates functions, it is now easy for data scientists to author many important graph algorithms succinctly. Without the burden of low-level parallelization and optimization, data scientists can avoid programming to the quirks of the latest high-performance distributed computing framework. Where prior approaches build bespoke evaluation engines or modify generalized dataflow processing engines to achieve performance, this work shows how to efficiently evaluate Datalog directly on BSP-style graph processing engines such as Giraph. Datalography incorporates both traditional Datalog optimizations, such as semi-naive evaluation, and new evaluation algorithms and optimization techniques for efficient distributed evaluation of Datalog queries on graph processing engines. In particular we develop evaluation techniques that take advantage of super vertices, eager aggregation, and asynchronous execution to optimize graph processing on Pregel-like systems. We implement our algorithms on top of Apache Giraph and our results indicate that Datalography competes with native, tuned implementations, with some analytics running up to 9 times faster.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2067655", "name": "W. E. Moustafa"}, {"authorId": "2835399", "name": "Vicky Papavasileiou"}, {"authorId": "1860926", "name": "Ken Yocum"}, {"authorId": "50136367", "name": "Alin Deutsch"}], "citations": [{"paperId": "ab7eac8eacf50dcb03a5b4a0776f1a248811826e", "title": "Communication-Avoiding Recursive Aggregation"}, {"paperId": "c979721d68ac59aa61cb7d95b2c8aa3a31a8bd2f", "title": "Probabilistic Reasoning at Scale: Trigger Graphs to the Rescue"}, {"paperId": "885a27c73cf094c41647607fbf8ea1ae3eb89e1f", "title": "Exploiting the Power of Equality-generating Dependencies in Ontological Reasoning"}, {"paperId": "740c9893c743527db7a25b121e47e4d44157c0a6", "title": "Parallel Logic Programming: A Sequel"}, {"paperId": "18230127a20e46a13bccbdae6ce90f29f3a7c464", "title": "DBSpinner: Making a Case for Iterative Processing in Databases"}, {"paperId": "f0fb365d666f0d75d6b0f9a2786aed344d076db8", "title": "Elevated Penetration Attack Models of Virtual Machine Escape Based on FSM"}, {"paperId": "928ce06c204d5940eee31e5233485413b813de6d", "title": "Vadalog: A modern architecture for automated reasoning with large knowledge graphs"}, {"paperId": "c4013eb6e59599e8ec7c42198d2fabd72f20e9eb", "title": "Optimizing Declarative Graph Queries at Large Scale"}, {"paperId": "0d4c57978d74e1783b9131ad2884dcaefc97b3e4", "title": "The Vadalog System: Datalog-based Reasoning for Knowledge Graphs"}, {"paperId": "83dc0eca1a453e2970d32923bb48bb84976bd968", "title": "An Overview of Vadalog: a System for Reasoning over Large Knowledge Graphs"}]}
