{"paperId": "37b54c7d048050e83b177c1c5d4020bd78a7d651", "publicationVenue": null, "title": "Analysis of Internet of Things encrypted data based on cloud computing platform", "abstract": "The research of IOT (Internet of Things) technology is the product of the continuous development of the information age. The impact of IOT technology on human production and life is gradually increasing, and IOT encrypted data based on cloud computing platform is also gradually popular. Because ECS is not completely trusted, cloud tenants will face the risk of sensitive data leakage while enjoying convenient data services. In the development history of IOT technology, cloud computing plays an important role. As a large-scale computing method, cloud computing has super data processing capacity, and can complete data scheduling in real time, effectively accelerate data computing speed. It has high development potential. The analysis of IOT encrypted data on the cloud computing platform has become the basic technology for feature extraction and data mining of big data information. The experimental results in this paper can prove that the method in this paper has better key splitting effect and higher key flexibility, which can realize the random splitting of IOT keys, improve the ability of data to resist external attacks, and ensure data security. It is of great practical value to realize the open source IOT encrypted data platform based on the current cloud computing technology, and it also has great significance to promote the development of IOT technology.", "venue": "International Conference on Intelligent Computing, Communication, and Devices", "year": 2023, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Conference"], "publicationDate": "2023-06-16", "journal": {"pages": "127031J - 127031J-7", "volume": "12703"}, "authors": [{"authorId": "72002609", "name": "Jian Yin"}, {"authorId": "2163960795", "name": "Chunxi Zhang"}, {"authorId": "2113920567", "name": "C. Zheng"}], "citations": []}
