{"paperId": "37bc86beb1181169f36769173498811c509a981d", "publicationVenue": {"id": "bea6dbb8-4367-4c35-8e28-e749f3ad107c", "name": "International Conference on Database Theory", "type": "conference", "alternate_names": ["Int Conf Database Theory", "ICDT"], "url": "http://alpha.luc.ac.be/~lucp1080/icdt/"}, "title": "The Importance of Parameters in Database Queries", "abstract": "We propose and study a framework for quantifying the importance of the choices of parameter values to the result of a query over a database. These parameters occur as constants in logical queries, such as conjunctive queries. In our framework, the importance of a parameter is its SHAP score. This score is a popular instantiation of the game-theoretic Shapley value to measuring the importance of feature values in machine learning models. We make the case for the rationale of using this score by explaining the intuition behind SHAP, and by showing that we arrive at this score in two different, apparently opposing, approaches to quantifying the contribution of a parameter. The application of the SHAP score requires two components in addition to the query and the database: (a) a probability distribution over the combinations of parameter values, and (b) a utility function that measures the similarity between the result for the original parameters and the result for hypothetical parameters. The main question addressed in the paper is the complexity of calculating the SHAP score for different distributions and similarity measures. We first address the case of probabilistically independent parameters. The problem is hard if we consider a fragment of queries that is hard to evaluate (as one would expect), and even for the fragment of acyclic conjunctive queries. In some cases, though, one can efficiently list all relevant parameter combinations, and then the SHAP score can be computed in polynomial time under reasonable general conditions. Also tractable is the case of full acyclic conjunctive queries for certain (natural) similarity functions. We extend our results to conjunctive queries with inequalities between variables and parameters. Finally, we discuss a simple approximation technique for the case of correlated parameters.", "venue": "International Conference on Database Theory", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-09", "journal": {"name": "ArXiv", "volume": "abs/2401.04606"}, "authors": [{"authorId": "2260651828", "name": "Martin Grohe"}, {"authorId": "2262340916", "name": "Benny Kimelfeld"}, {"authorId": "2278794183", "name": "Peter Lindner"}, {"authorId": "3360485", "name": "Christoph Standke"}], "citations": []}
