{"paperId": "37bdc908501ebc88d8be31a2c0c360e77b2f7a3d", "publicationVenue": {"id": "faae4228-a2f7-40bd-818e-ab1f685df91a", "name": "Forests", "type": "journal", "issn": "1999-4907", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156829", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156829", "https://www.mdpi.com/journal/forests"]}, "title": "Landslide Susceptibility Mapping Based on Information-GRUResNet Model in the Changzhou Town, China", "abstract": "Landslide susceptibility mapping is the basis of regional landslide risk assessment and prevention. In recent years, deep learning models have been applied in landslide susceptibility mapping, but some problems remain, such as gradient disappearance, explosion, and degradation. Additionally, the potential nonlinear temporal and spatial characteristics between landslides and environmental factors may not be captured, and nonlandslide points may be randomly selected in the susceptibility mapping process. To overcome these shortcomings, in this paper, an information-gate recurrent unit residual network (Information-GRUResNet) model is proposed to produce a landslide susceptibility map by combining existing landslide records and environmental factor data. The model uses the information theory method to produce the initial landslide susceptibility map. Then, representative grid units and landslide points are selected as input variables of the GRUResNet model, from which nonlinear temporal and spatial characteristics are extracted to produce a landslide susceptibility map. Changzhou town in Wuzhou, China, is selected as a case study, and it is verified that the Information-GRUResNet model can accurately produce a landslide susceptibility map for the selected area. Finally, the Information-GRUResNet model is compared with GRU, RF, and LR models. The experimental results show that the Information-GRUResNet model is more accurate than the other three models.", "venue": "Forests", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-02", "journal": {"name": "Forests"}, "authors": [{"authorId": "2155057240", "name": "Zian Lin"}, {"authorId": "2210714519", "name": "Qiuguang Chen"}, {"authorId": "2204770884", "name": "Weiping Lu"}, {"authorId": "143623220", "name": "Yuanfa Ji"}, {"authorId": "2051694224", "name": "Weibin Liang"}, {"authorId": "6678623", "name": "Xiyan Sun"}], "citations": [{"paperId": "bd11c30b674813c499270d49718e177635a6588c", "title": "A Review of Data Sources and Techniques used for Landslide Visualization"}]}
