{"paperId": "37c38a0c2687d5480cad113f17a0475238d3a2d9", "publicationVenue": null, "title": "Identifying Social Media Conversation Topics Regarding Electric Vehicles in Indonesia Using Latent Dirichlet Allocation", "abstract": "Understanding public perceptions regarding EVs is important so that strategic decisions could be made in developing the EV ecosystem in a country. However, given the large and various aspects of EV adoption, it is very hard to decide which aspects are more important and need to be addressed first. The identification of topics can be facilitated by using topic modeling applied to social media data. This research aims to identify social media conversation topics regarding electric vehicles in Indonesia using Latent Dirichlet Allocation. Tweet search resulted in 11565 tweets which 1746 of them are unique tweets were collected between February 13 to March 9, 2022, using the tweepy library in Python. The LDA modeling resulted in 5 major topics regarding EVs in Indonesia i.e: the ecosystem development (42.9%), the positive impact on the environment (24.1%), the development of the domestic electric vehicle industry (17.5%), the convenience / supporting facilities for electric vehicles (9.7%), and the investment in battery-based electric vehicle production (5.7%). The anecdotal findings and the limitation of this study are discussed.", "venue": "2022 IEEE International Conference on Cybernetics and Computational Intelligence (CyberneticsCom)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-06-16", "journal": {"name": "2022 IEEE International Conference on Cybernetics and Computational Intelligence (CyberneticsCom)", "pages": "102-106"}, "authors": [{"authorId": "40009168", "name": "M. T. Anwar"}, {"authorId": "2048020019", "name": "Mailia Putri Utami"}, {"authorId": "2139957667", "name": "Laksmi Ambarwati"}, {"authorId": "146011607", "name": "Abdul Wahid Arohman"}], "citations": [{"paperId": "a9c686f97f4ea9e37d7ec681d66692f23554fe30", "title": "Fast and Accurate Indonesian QnA Chatbot Using Bag-of-Words and Deep-Learning For Car Repair Shop Customer Service"}, {"paperId": "5aafa77782f15611a90411f7780f8020c8298fad", "title": "Analysing Teacher Training Participants' Feedback Using Natural Language Processing"}]}
