{"paperId": "37d2fe796d958b031f20042ae1b12c2d237c5680", "publicationVenue": {"id": "6ae24a95-700d-4e0b-8c84-4a5863ad023c", "name": "Korean Journal of Parasitology", "type": "journal", "alternate_names": ["Korean J Parasitol"], "issn": "0023-4001", "alternate_issns": ["1738-0006"], "url": "http://parasitol.or.kr/kjp/", "alternate_urls": ["http://parasitol.kr/index.php", "http://www.parasitol.or.kr/kjp/index.html"]}, "title": "Infestation and Related Ecology of Chigger Mites on the Asian House Rat (Rattus tanezumi) in Yunnan Province, Southwest China", "abstract": "This paper is to illustrate the infestation and related ecological characteristics of chigger mites on the Asian house rat (Rattus tanezumi). A total of 17,221 chigger mites were collected from 2,761 R. tanezumi rats, and then identified as 131 species and 19 genera in 2 families. Leptotrombidium deliense, the most powerful vector of scrub typhus in China, was the first major dominant species on R. tanezumi. All the dominant mite species were of an aggregated distribution among different individuals of R. tanezumi. The species composition and infestations of chiggers on R. tanezumi varied along different geographical regions, habitats and altitudes. The species-abundance distribution of the chigger mite community was successfully fitted and the theoretical curve equation was Ŝ (R)=37e−(0.28R)². The total chigger species on R. tanezumi were estimated to be 199 species or 234 species, and this further suggested that R. tanezumi has a great potential to harbor abundant species of chigger mites. The results of the species-plot relationship indicated that the chigger mite community on R. tanezumi in Yunnan was an uneven community with very high heterogeneity. Wide geographical regions with large host samples are recommended in the investigations of chigger mites.", "venue": "Korean Journal of Parasitology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-01", "journal": {"name": "The Korean Journal of Parasitology", "pages": "377 - 392", "volume": "59"}, "authors": [{"authorId": "2144087632", "name": "F. Ding"}, {"authorId": "46386780", "name": "Wen-Li Jiang"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "93382566", "name": "K. Mao"}, {"authorId": "2090526125", "name": "Rong Xiang"}], "citations": [{"paperId": "27de9901d97d938e14db9926c52eea2e2d939fde", "title": "Infestation of Oriental House Rat (Rattus tanezumi) with Chigger Mites Varies along Environmental Gradients across Five Provincial Regions of Southwest China"}, {"paperId": "e9fc0ffd20f9911d5c79e4d1a00a13b43acb7fcd", "title": "Preliminary Study on Species Diversity and Community Characteristics of Gamasid Mites on Small Mammals in Three Parallel Rivers Area of China"}, {"paperId": "0410c0a03857c79ac7c16a75a93b479c969b87ab", "title": "Analysis on infestation and related ecology of chigger mites on large Chinese voles (Eothenomys miletus) in five provincial regions of Southwest China"}, {"paperId": "86dd09314d3c49a45e45e0d5ec1cf8b02e22f170", "title": "Investigation of chigger mites on small mammals in Ruili, Yunnan Province, China."}, {"paperId": "47878e45b0c4c193f2de725898a48dfb6af572c6", "title": "Infestation of chigger mites on Chinese mole shrew, Anourosorex squamipes, in Southwest China and ecological analysis"}, {"paperId": "a16ead70bbaf526f501e1495b19dbb547a5e9849", "title": "Abundance of ectoparasitic ticks and mites (Acari: Ixodida, Mesostigmata, Trombidiformes) on rodents in the Alamedin Gorge of Kyrgyz Range, Kyrgyzstan"}, {"paperId": "0cca57666e494ed082c2746a0b8ef52bb4e5762c", "title": "Infestation and distribution of chigger mites on Chevrieri's field mouse (Apodemus chevrieri) in Southwest China"}]}
