{"paperId": "37e6b75269ad067402f54929d917debe704f1bfb", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "An assessment of blockchain academia and news developments: a bibliometric and text-mining analysis", "abstract": "PurposeThis study aims to provide a more complete picture of blockchain development by combining numerous methodologies with diverse data sources, such as academic papers and news articles. This study displays the developmental status of each subject based on the interrelationships of each topic cluster by analyzing high-frequency keywords extracted from the collected data. Moreover, applying above methodologies will help understanding top research topics, authors, venues, institutes and countries. The differences of blockchain research and new are identified.Design/methodology/approachTo identify and find blockchain development linkages, researchers have used search terms such as co-occurrence, bibliographic coupling, co-citation and co-authorship to help us understand the top research topics, authors, venues, institutes and countries. This study also used text mining analysis to identify blockchain articles' primary concepts and semantic structures.FindingsThe findings show the fundamental topics based on each topic cluster's links. While “technology”, “transaction”, “privacy and security”, “environment” and “consensus” were most strongly associated with blockchain in research, “platform”, “big data and cloud”, “network”, “healthcare and business” and “authentication” were closely tied to blockchain news. This article classifies blockchain principles into five patterns: hardware and infrastructure, data, networking, applications and consensus. These statistics helped the authors comprehend the top research topics, authors, venues, publication institutes and countries.Research limitations/implicationsSince Web of Science (WoS) and LexisNexis Academic data are used, the study has few sources. Others advise merging foreign datasets. WoS is one of the world's largest and most-used databases for assessing scientific papers.Originality/valueThis study has several uses and benefits. First, key concept discoveries can help academics understand blockchain research trends so they can prioritize research initiatives. Second, bibliographic coupling links academic papers on blockchain. It helps information seekers search and classify the material. Co-citation analysis results can help researchers identify potential partners and leaders in their field. The network's key organizations or countries should be proactive in discovering, proposing and creating new relationships with other organizations or countries, especially those from the journal network's border, to make the overall network more integrated and linked. Prominent members help recruit new authors to organizations or countries and link them to the co-authorship network. This study also used concept-linking analysis to identify blockchain articles' primary concepts and semantic structures. This may lead to new authors developing research ideas or subjects in primary disciplines of inquiry.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-16", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2242115620", "name": "Chien-wen Shen"}, {"authorId": "2241539060", "name": "Phung Phi Tran"}], "citations": []}
