{"paperId": "37e76379e9b7d64034198639aa38ba15f7844828", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Asymptotic response time analysis for multi-task parallel jobs", "abstract": "The response time of jobs with multiple parallel tasks is a critical performance metric in many systems, including MapReduce systems, coded data storage systems, etc. However, tight analytical characterizations of the response time of such jobs are largely unknown except for highly degenerate cases. The difficulty is rooted in the fact that a job with multiple tasks is considered complete only when all of its tasks complete processing; i.e., the job response time is the maximum of the response times of its tasks, which is hard to analyze since these task response times are generally not independent. In this paper, we approach this problem by studying when the response times of a job's tasks are close to being independent. We consider a limited fork-join model with $n$ servers, where each job consists of $k^{(n)}\\le n$ tasks. Upon arrival, each job chooses $k^{(n)}$ distinct servers uniformly at random and sends one task to each server. We assume Poisson job arrivals and generally distributed task service times. We establish that under the condition $k^{(n)} = o(n^{1/4})$, the steady state response times at any $k^{(n)}$ servers are asymptotically independent, as $n$ grows large. This result greatly generalizes the asymptotic-independence type of results in the literature where asymptotic independence is shown only for a fixed constant number of queues. We then further show that the job response time converges to the maximum of independent task response times, in a proper sense. This gives the first asymptotically tight analytical characterization of the response time of a multi-task parallel job. To complement the asymptotic independence result, we also show that when $k^{(n)}=\\Theta(n)$, any number of multiple queues are not asymptotically independent. Analysis for the regime of $k^{(n)}$ between $o(n^{1/4})$ and $\\Theta(n)$ remains open.", "venue": "arXiv.org", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-10-01", "journal": {"name": "ArXiv", "volume": "abs/1710.00296"}, "authors": [{"authorId": "47825052", "name": "Weina Wang"}, {"authorId": "1402983212", "name": "Mor Harchol-Balter"}, {"authorId": "144417194", "name": "Haotian Jiang"}, {"authorId": "1403427151", "name": "Alan Scheller-Wolf"}, {"authorId": "143808204", "name": "R. Srikant"}], "citations": []}
