{"paperId": "37e88da46bebb2dd23a37ffd16ec7b317cac95d9", "publicationVenue": {"id": "940c7008-d07d-488d-baa2-1ef7343957dc", "name": "International Journal of Computer Applications", "type": "journal", "alternate_names": ["INTERNATIONAL JOURNAL OF COMPUTER APPLICATION", "International Journal of Computers and Applications", "International journal of mini & microcomputers", "Int J Comput Appl", "INT J COMPUT APPL", "Int j mini  microcomput"], "issn": "0975-8887", "alternate_issns": ["0702-0481", "1206-212X", "2250-1797"], "url": "https://www.ijcaonline.org/", "alternate_urls": ["http://www.tandfonline.com/loi/tjca20#.VbH7kGPLZa4", "http://www.actapress.com/Content_of_Journal.aspx?JournalID=130", "http://epe.lac-bac.gc.ca/101/201/300/intl_j_comp_applications/index.html"]}, "title": "Task scheduling and data replication in cloud with improved correlation strategy", "abstract": "Cloud providers frequently utilize two tightly coupled resource management strategies like task scheduling & data replication to boost the performance of the system generally, guaranteeing service level agreement (SLA) compliance, as well as protecting their own financial gain. An Improved Correlation strategy-based Task Scheduling and Data Replication in Cloud (ICTSDC) is what this work aims to give. The suggested system's primary phases are as follows: Management of replication and task scheduling. Initial job scheduling will be optimization-based and take into account goals such bottleneck value, migration cost, VM load, enhanced correlation, and replication, respectively. For this, a brand-new extended DMO algorithm called Self-adaptive Dwarf Mongoose Optimization (SADMO) is presented. In the replication management stage, the potential copies must first be identified based on the prior objective. The suggested SADMO model implements the optimization technique for replica placement throughout the replication management process. The outcomes of the ICTSDC technique are evaluated to other methods using a variety of metrics, like bottleneck value, migration cost, Virtual Machine (VM) load, improved correlation, as well as replication efficiency. A lower mean value of 0.324 is gained with the ICTSDC scheme for fitness.", "venue": "International Journal of Computer Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-13", "journal": {"name": "International Journal of Computers and Applications", "pages": "697 - 708", "volume": "45"}, "authors": [{"authorId": "2258470068", "name": "D. Rambabu"}, {"authorId": "2258410445", "name": "A. Govardhan"}], "citations": [{"paperId": "e88dbe3399362e69335e16a35913247fe8e7a2d2", "title": "An efficient weighted partial MaxSAT encoding for scheduling in overloaded real-time systems"}]}
