{"paperId": "37eedae46b0c000e3c7db96ef83e7fd3471bdad7", "publicationVenue": {"id": "93a7b6aa-3a96-4e75-a837-cbd3660e8a72", "name": "Geographical Analysis", "type": "journal", "alternate_names": ["Geogr Anal"], "issn": "0016-7363", "alternate_issns": ["2319-5371"], "url": "http://www.wiley.com/bw/journal.asp?ref=0016-7363", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15384632", "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1538-4632", "http://muse.jhu.edu/journals/geo/"]}, "title": "Evolution of Urban Patterns: Urban Morphology as an Open Reproducible Data Science", "abstract": "The recent growth of geographic data science (GDS) fuelled by increasingly available open data and open source tools has influenced urban sciences across a multitude of fields. Yet there is limited application in urban morphology—a science of urban form. Although quantitative approaches to morphological research are finding momentum, existing tools for such analyses have limited scope and are predominantly implemented as plug-ins for standalone geographic information system software. This inherently restricts transparency and reproducibility of research. Simultaneously, the Python ecosystem for GDS is maturing to the point of fully supporting highly specialized morphological analysis. In this paper, we use the open source Python ecosystem in a workflow to illustrate its capabilities in a case study assessing the evolution of urban patterns over six historical periods on a sample of 42 locations. Results show a trajectory of change in the scale and structure of urban form from pre-industrial development to contemporary neighborhoods, with a peak of highest deviation during the post-World War II era of modernism, confirming previous findings. The wholly reproducible method is encapsulated in computational notebooks, illustrating how modern GDS can be applied to urban morphology research to promote open, collaborative, and transparent science, independent of proprietary or otherwise limited software.", "venue": "Geographical Analysis", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-15", "journal": {"name": "Geographical Analysis"}, "authors": [{"authorId": "2065810377", "name": "Martin Fleischmann"}, {"authorId": "97626116", "name": "Alessandra Feliciotti"}, {"authorId": "1856412", "name": "W. Kerr"}], "citations": [{"paperId": "b8a7ec1238e22a6442dfdeadaf508fcf47dcbf12", "title": "Delineating Neighborhoods: An Approach Combining Urban Morphology with Point and Flow Datasets"}, {"paperId": "cac3f0062824d00eb96dce5491e1a0abcb287b98", "title": "The Geographical Analysis of Megacities Through Changes in Their Individual Urban Objects"}, {"paperId": "c9a63c0fc0ab6bfc03b3341bc7b9a98013321d6c", "title": "An inductive method for classifying building form in a city with implications for orientation"}, {"paperId": "0ce3624e9a300fced049fdb1b4bce42a7a75b5fd", "title": "Evaluation & Criticism"}, {"paperId": "347c31d3374baa76480a6e2e1216f0f037c5c6a7", "title": "Segregated by design? Street network topological structure and the measurement of urban segregation"}, {"paperId": "f256d4bb38632821d0ba54cfbdc0a34d51e4d8cd", "title": "Street network patterns for mitigating urban heat islands in arid climates"}, {"paperId": "4451ac4806a29d8fd178de698acdb5d964047855", "title": "Settlement relationships and their morphological homogeneity across time and scale"}, {"paperId": "3371ed0fcc1706bfbb15ded50442f816889afd4a", "title": "Research on the historical evolution of urban street morphology under the background of big data and Internet of Things"}, {"paperId": "ab9d4da210cc8f18b77300dbb92a059205daa91e", "title": "Planned, unplanned, or in-between? A concept of the intensity of plannedness and its empirical relation to the built urban landscape across the globe"}, {"paperId": "897f4f66c1ad7c8028d3046e72605856c12f4417", "title": "Mapping the Urban Heat Island at the territory scale: an unsupervised learning approach for urban planning applied to the Canton of Geneva"}, {"paperId": "2e0588bb422612e4a6db9bafc78d3447a2cfc3e3", "title": "How building and street morphology affect CO2 emissions: Evidence from a spatially varying relationship analysis in Beijing"}, {"paperId": "879953303864b5e0f3bdff2e8ae94a3557e0bc41", "title": "Users’ Vulnerability and Exposure in Public Open Spaces (Squares): A Novel Way for Accounting Them in Multi-Risk Scenarios"}, {"paperId": "3fdaadf72c1fe061a1ea87e64bb34d35efb6f0a7", "title": "An urban design perspective of mass housing estates: Analyzing spatial accessibility over half a century in Spain"}, {"paperId": "961a3593f38099086ef73b241f1562ef08f21c2f", "title": "Effects of Urban Form Indicators on Land Prices in Seoul, Republic\n of Korea"}, {"paperId": "c4a6acd5eb3c153860015540619d7cd54c2f31ea", "title": "Understanding (urban) spaces through form and function"}, {"paperId": "1cc43d9086b075507d2f4fa7930de1f696b37924", "title": "Free and open source urbanism: Software for urban planning practice"}, {"paperId": "08168b0d14f1d55679ba4d2b26db2f22de888c56", "title": "3D building reconstruction from single street view images using deep learning"}, {"paperId": "cf2c62958d9b690909526c0468b7445265d9056e", "title": "Global Building Morphology Indicators"}, {"paperId": "2c4951fba4181c6a2cc591b752e3e0c8526f0998", "title": "Urban morphology parameters towards multi-risk scenarios for squares in the historical centers: Analyses and definition of square typologies and application to the Italian context"}, {"paperId": "62b8b567bc9f945888545674df0c8c0fe5a116c7", "title": "Evaluating the impact of urban morphology on rooftop solar radiation: a new city–scale approach based on Geneva GIS data"}, {"paperId": "a4c5b9b6a38a511969a7fe4f177a3f6f492f0a47", "title": "GANmapper: geographical data translation"}, {"paperId": "9aa1c6961b2a2ba7ea543bd2de5ee0c73e287585", "title": "Methodological foundation of a numerical taxonomy of urban form"}, {"paperId": "bb63346588dbfa2fb3e5fb9fda505ebb1c7a71fe", "title": "British urban morphology: Time to take stock and regroup?"}, {"paperId": "ed827f1703c35b03774433c724a144347d182086", "title": "Greenery in urban morphology: a comparative analysis of differences in urban green space accessibility for various urban structures across European cities"}, {"paperId": "bb8db3a1a1cb3d6e5d47fc77ac1ef18a9dff7060", "title": "GANmapper: geographical content filling"}, {"paperId": "4d93602de0fa17128a3cef64c926fc7b261876aa", "title": "Learning urban areas from tourist data: a case study with spatially constrained clustering and Airbnb data"}]}
