{"paperId": "37f4b887ee7c45ef2fc501e3ac73c0ef64334e8a", "publicationVenue": {"id": "e9883e67-315e-4b98-a80a-5136298bf7a4", "name": "International Journal of Remote Sensing", "type": "journal", "alternate_names": ["Int J Remote Sens"], "issn": "0143-1161", "url": "https://www.tandfonline.com/toc/tres20/current"}, "title": "A novel voting ensemble model for spatial prediction of landslides using GIS", "abstract": "ABSTRACT Inherent complex topography and drastic weather patterns together have concocted various natural disasters worldwide. In difficult terrains such as those prevalent in the North-Eastern regions of India, coupled with the factors such as population explosion and improper land use, lead them to witness some of the world’s most drastic landslides with an astonishing frequency, reckoning landslide susceptibility assessment crucial in such regions. This paper focuses on exploring a promising machine learning ensemble technique of Majority-based voting which has seldom been employed for landslide susceptibility assessment. The ensemble comprises Logistic Regression (LR), Gradient Boosted Decision Trees (GBDT) and Voting Feature Interval (VFI) to prepare landslide susceptibility zonation maps for the Brahmaputra valley region (Assam & Nagaland) and its close vicinity. In the first stage of the study, a landslide inventory for the area comprising 436 landslide locations was prepared in geographic information system (GIS), substantiated by news reports and remote sensing data. In the second stage, 16 landslide causative thematic maps including Elevation, Slope, Slope Aspect, General Curvature, Plan Curvature, Profile Curvature, Surface Roughness, Topographic Wetness Index (TWI), Stream Power Index (SPI), Slope Length, Normalized Difference Vegetation Index (NDVI), Land Use/Land Cover (LULC), Distance from Roads, Rivers, Faults and Railways were prepared. In the third stage, the landslide inventory was annexed with the causative factor maps to obtain a dataset comprising coordinates of the locations and the values of aforementioned causative factors on the corresponding coordinates. The proposed model was then trained and tested on the prepared dataset (70%:30% split). Finally, the efficiency of the new model was tested using the area under receiver operating characteristic curve (AUC of ROC). The validation results demonstrate the mettle of the proposed majority-based voting ensemble LR-GBDT-VFI (AUC: 0.98) against the conventional techniques such as Decision Trees, Support Vector Machines, Random Forest, etc. Altogether, the study offers an approach with wide scope across the field of landslide hazard assessment.", "venue": "International Journal of Remote Sensing", "year": 2019, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2019-08-20", "journal": {"name": "International Journal of Remote Sensing", "pages": "929 - 952", "volume": "41"}, "authors": [{"authorId": "48848479", "name": "Shruti Sachdeva"}, {"authorId": "34446486", "name": "T. Bhatia"}, {"authorId": "48124596", "name": "A. Verma"}], "citations": [{"paperId": "2624a160957239aa8290b3510b82f72d67aafd95", "title": "A Novel Heterogeneous Ensemble Framework Based on Machine Learning Models for Shallow Landslide Susceptibility Mapping"}, {"paperId": "090ec8785660ed71516f9d9e5801b4e22e08af4f", "title": "Using Voting-Based Ensemble Classifiers to Map Invasive Phragmites australis"}, {"paperId": "43461fa36de78280af7a5ab2055a0c676251a9d6", "title": "Machine Learning Classifier Evaluation for Different Input Combinations: A Case Study with Landsat 9 and Sentinel-2 Data"}, {"paperId": "24cf92fd41ae9854082cfc3f4b036638bac79222", "title": "A comparative study of heterogeneous and homogeneous ensemble approaches for landslide susceptibility assessment in the Djebahia region, Algeria."}, {"paperId": "74b448c5b16885154f5f033459c4ff6010ff9941", "title": "Evaluation of deep learning algorithms for landslide susceptibility mapping in an alpine-gorge area: a case study in Jiuzhaigou County"}, {"paperId": "6b7fc9fa46152afd8b6a458502005955f2be482a", "title": "Spatial implementation of frequency ratio, statistical index and index of entropy models for landslide susceptibility mapping in Al-Balouta river basin, Tartous Governorate, Syria"}, {"paperId": "ded046e2fb340704e65307c9dfd5ec26361a57d2", "title": "The influence of sampling on landslide susceptibility mapping using artificial neural networks"}, {"paperId": "3d6bce154c3cb0fc144da6d284d0d20a301bdda9", "title": "Application of machine learning algorithms in landslide susceptibility mapping, Kali Valley, Kumaun Himalaya, India"}, {"paperId": "4f86a1f31cd93328fb2dc408abc191d1efa3b5bc", "title": "A Review of Ensemble Learning Algorithms Used in Remote Sensing Applications"}, {"paperId": "f6e179fca85d2139769e2e5644204e93191a35d9", "title": "Permafrost degradation induced thaw settlement susceptibility research and potential risk analysis in the Qinghai-Tibet Plateau"}, {"paperId": "3e701f6968b76414343c6ace9926c7d3ed34a56d", "title": "An ensemble random forest tree with SVM, ANN, NBT, and LMT for landslide susceptibility mapping in the Rangit River watershed, India"}, {"paperId": "0625452100ecbf0302cc0d2ad3a1bd5d43f08f73", "title": "Comparison of general kernel, multiple kernel, infinite ensemble and semi-supervised support vector machines for landslide susceptibility prediction"}, {"paperId": "b73ac4747ae4e553b63047b1c4dd67e5db11fe5e", "title": "Landslide susceptibility modeling based on GIS and ensemble techniques"}, {"paperId": "fdd154c1e7c601fd1199b9996a2e4aaeaf8e8d05", "title": "Detection of areas prone to flood-induced landslides risk using certainty factor and its hybridization with FAHP, XGBoost and deep learning neural network"}, {"paperId": "56f292a24008b7fb156f8108e3bbd17bf25e4893", "title": "Spatial modeling and susceptibility zonation of landslides using random forest, naïve bayes and K-nearest neighbor in a complicated terrain"}, {"paperId": "39b093e629a4400d17d23cccfb179ec7231f580b", "title": "An approach based on socio-politically optimized neural computing network for predicting shallow landslide susceptibility at tropical areas"}, {"paperId": "4f8c67831f59975153235d6f8c9036e7a47755c3", "title": "A comparison among fuzzy multi-criteria decision making, bivariate, multivariate and machine learning models in landslide susceptibility mapping"}, {"paperId": "ef626505f95dbbba6eb898e8810b65bfaf6555b4", "title": "Built Environment Challenges Due to Climate Change"}, {"paperId": "84f5854c6c0ab18201da48f5c8453572a095d1bc", "title": "Susceptibility Mapping on Urban Landslides Using Deep Learning Approaches in Mt. Umyeon"}, {"paperId": "6f1d45c889aced69d74fa11ba1a2dc469ad876a6", "title": "Geomorphic and Sedimentary Effects of Modern Climate Change: Current and Anticipated Future Conditions in the Western United States"}, {"paperId": "d006dabefc1b0e82b22b7a5fa8be097680c60604", "title": "Comparisons of heuristic, general statistical and machine learning models for landslide susceptibility prediction and mapping"}, {"paperId": "76190ea54f3162fd43256538ae734ae54c5aca76", "title": "Soft Measuring Method of Dioxin Emission Concentration for MSWI Process Based on RF and GBDT"}, {"paperId": "75d6d821e554c240bcf8a79b754f66b1824f21ac", "title": "Machine-learning based landslide susceptibility modelling with emphasis on uncertainty analysis"}, {"paperId": "5693b74d596ca721a3c8755922897f9a168a5dc5", "title": "State of Geographic Information Science (GIS), Spatial Analysis (SA) and Remote Sensing (RS) in India: A Machine Learning Perspective"}]}
