{"paperId": "37fad717b47990a7e5c42b68477c9df3fb4c4ef2", "publicationVenue": {"id": "5e91b192-ddd0-4274-b0e3-5dacd8c395ff", "name": "Karbala International Journal of Modern Science", "type": "journal", "alternate_names": ["Karbala Int J Mod Sci"], "issn": "2405-609X", "url": "https://kijoms.uokerbala.edu.iq/home/"}, "title": "Artificial Intelligence for Para Rubber Identification Combining Five Machine Learning Methods", "abstract": "Abstract This study aims to identify Para rubber species using a combination of five machine learning techniques to classify leaf images. The learning process is defined using a dataset for each classification method. Approximately 1,472 leaf images are prepared consisting of various sizes, shapes, quality provided for the model. The classification indicators are defined with the help of an algorithm to identify at least three of the top five potential classification outcomes. The algorithm accurately predicts 100% of the five classification methods. Methods can provide precise and rapid classification of large quantities, without the need for image preprocessing prior to classification.", "venue": "Karbala International Journal of Modern Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-06", "journal": {"name": "Karbala International Journal of Modern Science"}, "authors": [{"authorId": "102723078", "name": "Chairote Yaiprasert"}], "citations": [{"paperId": "bfced1cf7d34e342ed963a549064b136581bce80", "title": "AI-Powered in the Digital Age: Ensemble Innovation Personalizes the Food Recommendations"}, {"paperId": "16169c7e858372614c8a63acff18d95f8085b43b", "title": "A study on image processing techniques and deep learning techniques for insect identification"}, {"paperId": "b495f62cd83e60c87ec78f49b4afdf8399945039", "title": "AI-driven ensemble three machine learning to enhance digital marketing strategies in the food delivery business"}, {"paperId": "73d688c85b9e66aceb9f9d1df31fe2692f9d2932", "title": "AI-powered ensemble machine learning to optimize cost strategies in logistics business"}]}
