{"paperId": "3802687eb6a9225f6eb5922795ae3e85c9a56ccf", "publicationVenue": {"id": "501d412d-8d7a-4980-ae5b-6639fe31aee2", "name": "First Monday", "type": "journal", "issn": "1396-0458", "url": "http://www.firstmonday.dk/ojs/index.php/fm/about/index", "alternate_urls": ["http://www.firstmonday.org/", "http://www.uic.edu/htbin/cgiwrap/bin/ojs/index.php/fm/"]}, "title": "Incels on Reddit: A study in social norms and decentralised moderation", "abstract": "The social news website Reddit has a long history of hosting communities (‘subreddits’) that advocate or encourage white supremacy (Gillespie 2018), disparagement of minority groups (Topinka 2017), and violence against women (Massanari 2017). As a platform that relies heavily on volunteer moderators to self-govern the subreddits (Matias 2016), Reddit has been criticised for failing to adequately enforce its site-wide rules (Gillespie 2018). Incels—an internet subculture that ascribes to deeply misogynistic beliefs—grew in visibility when they developed subreddits on Reddit. After ongoing criticism and media attention about harmful behaviour of incels both on and off the platform, Reddit imposed escalating sanctions and ultimately banned the most visible of these subreddits over a period of several years. In this paper, we focus on the interaction between formal rules and social norms in incel and related subreddits. This paper aims to improve understanding about how problematic norms are contested in (partially-) decentralised systems of content moderation. We examine discourse about moderation to better understand the role of moderation teams in maintaining and changing social norms in their communities and to examine the interaction between these norms and both sitewide and subreddit-specific rules. Our analysis suggests that the threat of prohibition alone is unlikely to be sufficient to drive cultural change in problematic subreddits. We argue that content moderation is an insufficient frame to understand the regulation of harmful communities; real change requires addressing the underlying cultural norms rather than focusing on individual pieces of content.", "venue": "First Monday", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-15", "journal": {"name": "First Monday", "volume": "27"}, "authors": [{"authorId": "115941746", "name": "Rosalie Gillett"}, {"authorId": "69373969", "name": "Nicolas P Suzor"}], "citations": [{"paperId": "56c3a8de069b32a530778465613ea4bbe34e858b", "title": "'One Style Does Not Regulate All': Moderation Practices in Public and Private WhatsApp Groups"}, {"paperId": "514a9a3001e80c98315fd64f180cec4afbc181b4", "title": "‘It's time to put the copes down and get to work’: a qualitative study of incel exit strategies on r/IncelExit"}, {"paperId": "dcc1d02ce952a347ee6aa11224f23719109fcf08", "title": "The Rage of Lonely Men: Loneliness and Misogyny in the Online Movement of “Involuntary Celibates” (Incels)"}, {"paperId": "f1f7f60d6f33c6ba3acf75e4a836ef10e4ef981d", "title": "Networked Responses to Networked Harassment? Creators’ Coordinated Management of “Hate Raids” on Twitch"}, {"paperId": "34f034892b553d7fdde69bafbc1af37ad0ccd6aa", "title": "Pathways to School Shooting Subculture: Re-thinking Theory Across Strain, Imitation, and Digital Mediation"}, {"paperId": "a0536a7ae4b8366c02ab0cf0cd55d8f80d6eb3ff", "title": "IDA - Incel Data Archive: a multimodal comparable corpus for exploring extremist dynamics in online interaction"}]}
