{"paperId": "3808ca24161d24b714024655782ea51c3ee49ed1", "publicationVenue": {"id": "c702b248-478f-4d24-8dfb-3c9c93bb1b96", "name": "Autism", "type": "journal", "issn": "1362-3613", "url": "http://www.sagepub.com/journalsProdDesc.nav?prodId=Journal200822", "alternate_urls": ["https://journals.sagepub.com/loi/aut", "http://aut.sagepub.com/"]}, "title": "'Most people have no idea what autism is': Unpacking autism disclosure using social media analysis.", "abstract": "LAY ABSTRACT\nAutism disclosure - that is sharing their autism diagnosis or identity with a person or people - is a difficult decision for many autistic people. While telling people they are autistic can be positive and helpful, it can also create a lot of problems. What we have learnt is that disclosure is really complicated. Rather than asking research participants questions about what might happen, we looked at what people were saying on public social media posts (Reddit and Twitter) about what did happen. We used three years of posts that were related to autism disclosure from a wide range of adults (autistic and non-autistic). Four main ideas were created from our data, with the key finding being that society does not understand autism. This lack of understanding creates problems for autistic people in work, dating, healthcare and mental health. The remaining ideas were that autistic people should have privacy and be treated with respect, that autistic representation can help society and that non-autistic people need to do more to help autistic people. Our findings support that society needs to do more through autism advocacy, better media representation and more public role models. Increasing the accuracy of understanding of autism across society will mean that autistic people can feel safer to disclose if they want to.", "venue": "Autism", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-22", "journal": {"name": "Autism : the international journal of research and practice", "pages": "\n          13623613231192133\n        "}, "authors": [{"authorId": "2069860202", "name": "Christopher J. Edwards"}, {"authorId": "46185273", "name": "Abigail M. A. Love"}, {"authorId": "2107761495", "name": "S. Jones"}, {"authorId": "11450626", "name": "R. Cai"}, {"authorId": "2232942333", "name": "Boyd Thai Hoang Nguyen"}, {"authorId": "46482120", "name": "Vicki Gibbs"}], "citations": [{"paperId": "e0d440ce0b7c11269abe4d62d12956f416206ec9", "title": "Organized physical activity participation among autistic Australians: Barriers, enablers and implications for inclusion"}, {"paperId": "41915585fb11c064aa52a1a4fc6574a4bb48e802", "title": "Cerebral cortex genetics; calcium imaging of astrocytes"}]}
