{"paperId": "380f844cd8fa4f699b660314e3de363b0824a1e4", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Integration of Large-Scale Data Processing Systems and Traditional Parallel Database Technology", "abstract": "In 2009 we explored the feasibility of building a hybrid SQL data analysis system that takes the best features from two competing technologies: large-scale data processing systems (such as Google MapReduce and Apache Hadoop) and parallel database management systems (such as Greenplum and Vertica). We built a prototype, HadoopDB, and demonstrated that it can deliver the high SQL query performance and eﬃciency of parallel database management systems while still providing the scalability, fault tolerance, and ﬂex-ibility of large-scale data processing systems. Subsequently, HadoopDB grew into a commercial product, Hadapt, whose technology was eventually acquired by Teradata. In this paper, we provide an overview of HadoopDB’s original design, and its evolution during the subsequent ten years of research and development eﬀort. We describe how the project inno-vated both in the research lab, and as a commercial product at Hadapt and Teradata. We then discuss the current vibrant ecosystem of software projects (most of which are open source) that continued HadoopDB’s legacy of implementing a systems level integration of large-scale data processing systems and parallel database technology.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2290-2299", "volume": "12"}, "authors": [{"authorId": "1698925", "name": "A. Abouzeid"}, {"authorId": "2254232", "name": "D. Abadi"}, {"authorId": "1403671783", "name": "Kamil Bajda-Pawlikowski"}, {"authorId": "1688159", "name": "A. Silberschatz"}], "citations": [{"paperId": "cc3e32bc3cb6b78302ea3122e58919b31687a9d3", "title": "AQUA+: Query Optimization for Hybrid Database-MapReduce System"}]}
