{"paperId": "381526cc3ca8c39ce719e3775989839476fc5f79", "publicationVenue": null, "title": "Machine Learning Methods for Secure Internet of Things Against Cyber Threats", "abstract": "Internet of Things (IoT) connects billions of devices that can communicate with each other with little human input. IoT is the rapid-growth segment of computing, but it is also one of the most susceptible to cyber-attacks. Practical countermeasures to safeguard IoT networks, for instance network anomaly monitoring, must be devised. While attacks cannot be completely prevented, early identification is critical for effective protection. Because IoT devices have limited storage and processing power, typical most sophisticated security solutions are ineffective. Also, IoT devices now connect automatically for longer durations. This necessitates clever network-based security solutions like machine learning. Although numerous studies have recently examined the use of Machine Learning (ML) techniques in attacks detection, a small attention is to be paid for detecting the attacks in IoT networks. We want to add to the field by testing several machine learning techniques for detecting IoT network attacks. The Bot-IoT dataset is used to test detection methods. For implementing the system, various machine learning algorithms are deployed, most of which performed well. During deployment, additional characteristics were collected from the Bot-IoT dataset and compared to existing research, with superior results.", "venue": "2022 IEEE 3rd Global Conference for Advancement in Technology (GCAT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-07", "journal": {"name": "2022 IEEE 3rd Global Conference for Advancement in Technology (GCAT)", "pages": "1-5"}, "authors": [{"authorId": "2195453755", "name": "Shalini K B Devi"}, {"authorId": "2109967731", "name": "Sanjay Kumar"}, {"authorId": "2187594577", "name": "Jambi Ratna Raja Kumar"}], "citations": []}
