{"paperId": "381b3f7c1b0dc188906c2db4b6b823ddeb4f8be5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Straggler-Resilient Decentralized Learning via Adaptive Asynchronous Updates", "abstract": "With the increasing demand for large-scale training of machine learning models, fully decentralized optimization methods have recently been advocated as alternatives to the popular parameter server framework. In this paradigm, each worker maintains a local estimate of the optimal parameter vector, and iteratively updates it by waiting and averaging all estimates obtained from its neighbors, and then corrects it on the basis of its local dataset. However, the synchronization phase is sensitive to stragglers. An efficient way to mitigate this effect is to consider asynchronous updates, where each worker computes stochastic gradients and communicates with other workers at its own pace. Unfortunately, fully asynchronous updates suffer from staleness of the stragglers' parameters. To address these limitations, we propose a fully decentralized algorithm DSGD-AAU with adaptive asynchronous updates via adaptively determining the number of neighbor workers for each worker to communicate with. We show that DSGD-AAU achieves a linear speedup for convergence (i.e., convergence performance increases linearly with respect to the number of workers). Experimental results on a suite of datasets and deep neural network models are provided to verify our theoretical results.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-11", "journal": {"name": "ArXiv", "volume": "abs/2306.06559"}, "authors": [{"authorId": "35479480", "name": "Guojun Xiong"}, {"authorId": "2072753374", "name": "Gang Yan"}, {"authorId": "50695457", "name": "Shiqiang Wang"}, {"authorId": "71003878", "name": "Jian Li"}], "citations": [{"paperId": "4eb4a117efcccbc2cd0ea079d6d69f6b78cec945", "title": "DePRL: Achieving Linear Convergence Speedup in Personalized Decentralized Learning with Shared Representations"}]}
