{"paperId": "382afd4d41638e8399e90edc52b36cc8a3cee317", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "A Software-Defined IoT Device Management Framework for Edge and Cloud Computing", "abstract": "In this article, we present the design and implementation of the software-defined IoT management (SDIM) framework based on software-defined networking (SDN)-enabled architecture that is purposely built for the edge computing multidomain wireless sensor networks (WSNs). This framework can dynamically provision the IoT devices to enable machine-to-machine (M2M) communication as well as continuous operational fault detection for WSNs. Unlike the existing approaches in the literature, SDIM is mainly deployed at multiaccess edge computing (MEC) nodes and is integrated with the cloud by aggregating multidomain topology information. Backed by the experimental results over the University of Bristol 5G test network, we demonstrate in practice that our framework outperforms the implementations of the lightweight M2M (LWM2M) and NETCONF Light IoT device management protocols when deployed autonomously at the network edge and/or the cloud. Specifically, SDIM edge deployments can lower the average device provisioning time as high as 46% compared to LWM2M and 60.3% compared to NETCONF Light. Moreover, it can decrease the average operational fault detection time by approximately 33% compared to LWM2M and roughly 40% compared to NETCONF Light. Also, SDIM reduces control operations time up to 27%, posing a powerful feature for use cases with time-critical control requirements. Last, SDIM manages to both reduce CPU consumption and to have important energy consumption gains at the network edge, which can reach as high as 20% during device provisioning and 4.5%–4.9% during fault detection compared to the benchmark framework deployments.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1718-1735", "volume": "7"}, "authors": [{"authorId": "50264163", "name": "A. Mavromatis"}, {"authorId": "1409492886", "name": "Carlos Colman-Meixner"}, {"authorId": "1911163", "name": "A. P. Silva"}, {"authorId": "1842694", "name": "Xenofon Vasilakos"}, {"authorId": "2322265", "name": "R. Nejabati"}, {"authorId": "3259233", "name": "D. Simeonidou"}], "citations": [{"paperId": "c069296e9bbd956dc2b3d71d01cba62dbade778b", "title": "Edge Controller-Assisted SDN Architecture for Internet of Things"}, {"paperId": "a2a9cda2a7f43d5890485d55f602c9e1216f835a", "title": "Smart contract based DDoS attack traceability audit mechanism in intelligent IoT"}, {"paperId": "0e38bd70c5cb6543f297f9025e2c2256a6369353", "title": "An Edge Device Framework in SEMAR IoT Application Server Platform"}, {"paperId": "8c5bceb137a3c658f4c9edc262261f4ac8744129", "title": "Research and Design of a Decentralized Edge-Computing-Assisted LoRa Gateway"}, {"paperId": "751431e350e27ac0129d8dadedbcd24382c1b813", "title": "Technical Architecture and Evolution Analysis of Measurement Data Sharing for Power IoTs"}, {"paperId": "0e06fd46a252da0e560aea58c67dcf0ffad2a064", "title": "Fuzzy logic system for drug storage based on the internet of things: a survey"}, {"paperId": "8460a1499abd3cfe46fa19c0efe8fc4b6c524faf", "title": "Multi-Objective Optimization of Dynamic Resource Scheduling in IoT Cloud Platform"}, {"paperId": "bf782242cd778c7ef89cb1da5ee7d2dd13481673", "title": "KIND: A Novel Image-Mutual-Information-Based Decision Fusion Method for Saturation Attack Detection in SD-IoT"}, {"paperId": "522ddd866ef0599f8a345a9825e3b259cb6e9bc1", "title": "Research on Motor Bearing Fault Diagnosis Based on the AdaBoost Algorithm and the Ensemble Learning with Bayesian Optimization in the Industrial Internet of Things"}, {"paperId": "00e2ad03dbb4c9f936bf637724fb7979abccaeab", "title": "A new design of intrusion detection in IoT sector using optimal feature selection and high ranking-based ensemble learning model"}, {"paperId": "710376ee2cea201e9f3135d1aa1bc88ad0262a97", "title": "Fraship: A Framework to Support End-User Personalization of Smart Home Services with Runtime Knowledge Graph"}, {"paperId": "cbf54294e5d08da1b33a8b50f186df46c145c33a", "title": "Architecture Design and Reliability Evaluation of a Novel Software-Defined Train Control System"}, {"paperId": "4df2d51594262890f336b1a0fb39691d6f02d63e", "title": "A Survey on Machine Learning Software-Defined Wireless Sensor Networks (ML-SDWSNs): Current Status and Major Challenges"}, {"paperId": "0edec1103b48f10beb98bab0a86c0bdb97178771", "title": "Mobility-Aware Controller Orchestration in Multi-Tier Service-Oriented Architecture for IoT"}, {"paperId": "0bae0651fe084a2387d73fd0f9c6a8140e197151", "title": "A comprehensive survey on nature‐inspired algorithms and their applications in edge computing: Challenges and future directions"}, {"paperId": "f0d61bcae731219a36bdc40edcdb9c6bbfc9df84", "title": "Dynamic Control Architecture Based on Software Defined Networking for the Internet of Things"}, {"paperId": "20f846fc514c4b2ef83a2e0764dce29f4ea8a925", "title": "IoT and Cloud Computing Issues, Challenges and Opportunities: A Review"}, {"paperId": "a6b87daf28e7c7e66cf8e437bd36c2242db60849", "title": "Research on energy-efficient routing algorithm based on SWIPT in multi-hop clustered WSN for 5G system"}, {"paperId": "c1bedf52f2774add23fe9b13ce455c09889f04cc", "title": "Design and Prototype Implementation of a Blockchain-Enabled LoRa System With Edge Computing"}, {"paperId": "8495783c4f80bbbfae83f3fef6fcd2ddd699a740", "title": "IoT-Based Signal Enhancement and Compression Method for Efficient Motor Bearing Fault Diagnosis"}, {"paperId": "75887a78391ca474a7871bf7a674d6b3f1af957b", "title": "A MECS redistribution algorithm for SDN-enable MEC using response time and transmission overhead"}, {"paperId": "34979b5c7de3f53824fb93cf49293c3aea309b3d", "title": "DeepMDP: A Novel Deep-Learning-Based Missing Data Prediction Protocol for IoT"}, {"paperId": "3024e643e7a67014bd5ed4e7d89b82591dbc1c34", "title": "A survey on computation offloading modeling for edge computing"}, {"paperId": "088b46e179559704340e091a2ebeeb897c11e87d", "title": "A Modular Experimentation Methodology for 5G Deployments: The 5GENESIS Approach"}, {"paperId": "b26b6954f79231416608ed63727af9243ae09682", "title": "Towards Zero Downtime Edge Application Mobility for Ultra-Low Latency 5G Streaming"}, {"paperId": "069aacb72e5b0d3d13421a0eac0617a18ecb1ae7", "title": "Experiences from Building a Multi-Access Edge Computing Internet of Things Testbed"}, {"paperId": "d0f6938136cf125b9ea1f0fa36a3538443794127", "title": "AN OVERVIEW ON INTERNET OF THINGS ( IOT)"}, {"paperId": "3e1f735ae225aaf1496a46d81e87ae9630c4666a", "title": "Enterprise Financial Management Informatization under Cloud Computing Environment"}, {"paperId": "bd11d6c254d9a50cb849c3eb88379f6e31517603", "title": "READ-IoT: Reliable Event and Anomaly Detection Framework for the Internet of Things"}, {"paperId": "02f1c495547edd429cb99ca1eff031b0d0b42e62", "title": "IoT Management Analysis Using SDN: Survey"}, {"paperId": "f4dd9cabaa3012bba9a74c6b0f6d2f64a9cc570e", "title": "FoSDN: A Software-Defined Edge Computation for Resource Constraint Network"}, {"paperId": "336bfecd0864062c5840082e47fb693fc6ebb21d", "title": "Intelligent Monitoring System of Residential Environment Based on Cloud Computing and Internet of Things"}, {"paperId": "cdbf8e0ed827f48db17ae2e076cbf169ed7b75a3", "title": "A Network Energy Efficiency Measurement Method for Cloud-Edge Communication Networks"}]}
