{"paperId": "382c08249a354d0ed392a2e3d42051da09cfa5d8", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Edge Computing Robot Interface for Automatic Elderly Mental Health Care Based on Voice", "abstract": "We need open platforms driven by specialists, in which queries can be created and collected for long periods and the diagnosis made based on a rigorous clinical follow-up. In this work, we developed a multi-language robot interface helping to evaluate the mental health of seniors by interacting through questions. Through the voice interface, the specialist can propose questions, as well as receive users’ answers, in text form. The robot can automatically interact with the user using the appropriate language. It can process the answers and under the guidance of a specialist, questions and answers can be oriented towards the desired therapy direction. The prototype was implemented on an embedded device meant for edge computing, thus it was able to filter environmental noise and can be placed anywhere at home. The proposed platform allows the integration of well-known open source and commercial data flow processing frameworks. The experience is now available for specialists to create queries and answers through a Web-based interface.", "venue": "Electronics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-29", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1412562934", "name": "C. Yvanoff-Frenchin"}, {"authorId": "2069114328", "name": "Vitor Ramos"}, {"authorId": "51133851", "name": "T. Belabed"}, {"authorId": "145780655", "name": "C. Valderrama"}], "citations": [{"paperId": "7bbd0cff27d346efc6ccc5169ee02e5284cff19b", "title": "Edge Computing based Human-Robot Cognitive Fusion: A Medical Case Study in the Autism Spectrum Disorder Therapy"}, {"paperId": "b297963ddbd03ed1512581555956b4eb1e7d696b", "title": "Sound Localization Based on Acoustic Source Using Multiple Microphone Array in an Indoor Environment"}, {"paperId": "0c8bb58833443a296ffb98436c7482ac19b61d55", "title": "Edge Container for Speech Recognition"}, {"paperId": "c29cb47ec61c38da570022e6ca5130738f5de2f5", "title": "A Novel Automate Python Edge-to-Edge: From Automated Generation on Cloud to User Application Deployment on Edge of Deep Neural Networks for Low Power IoT Systems FPGA-Based Acceleration"}, {"paperId": "e96b694d41593a5da123911a532e45b0027c1566", "title": "Organic planar diode with Cu electrode via modification of the metal surface by SAM of fluorobiphenyl based thiol"}, {"paperId": "acdbeba70cdfe90613027b1ffdf1ea2988ec80bb", "title": "IoT-Based Bee Swarm Activity Acoustic Classification Using Deep Neural Networks"}, {"paperId": "92b9d538c2cbb397b3e4d286e3a939ff5916f11f", "title": "Advancements in AI-driven multilingual comprehension for social robot interactions: An extensive review"}, {"paperId": "b0ced4c497f6200263fee9e537f61d167c9b7d4b", "title": "User Driven FPGA-Based Design Automated Framework of Deep Neural Networks for Low-Power Low-Cost Edge Computing"}, {"paperId": "110f1c8a13d6b4f70431049abda22aab6d4de5ee", "title": "Yes, ICAN(b)E - Active Aging in Place supported by a Caregiver-centered Modular Low-Cost Platform"}]}
