{"paperId": "38318e2acb49b8828b51fa9c9c7d753c57b79560", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Efficient Processing of Geospatial mHealth Data Using a Scalable Crowdsensing Platform †", "abstract": "Smart sensors and smartphones are becoming increasingly prevalent. Both can be used to gather environmental data (e.g., noise). Importantly, these devices can be connected to each other as well as to the Internet to collect large amounts of sensor data, which leads to many new opportunities. In particular, mobile crowdsensing techniques can be used to capture phenomena of common interest. Especially valuable insights can be gained if the collected data are additionally related to the time and place of the measurements. However, many technical solutions still use monolithic backends that are not capable of processing crowdsensing data in a flexible, efficient, and scalable manner. In this work, an architectural design was conceived with the goal to manage geospatial data in challenging crowdsensing healthcare scenarios. It will be shown how the proposed approach can be used to provide users with an interactive map of environmental noise, allowing tinnitus patients and other health-conscious people to avoid locations with harmful sound levels. Technically, the shown approach combines cloud-native applications with Big Data and stream processing concepts. In general, the presented architectural design shall serve as a foundation to implement practical and scalable crowdsensing platforms for various healthcare scenarios beyond the addressed use case.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "49489474", "name": "Robin Kraft"}, {"authorId": "14866482", "name": "Ferdinand Birk"}, {"authorId": "145870311", "name": "M. Reichert"}, {"authorId": "2064020427", "name": "A. Deshpande"}, {"authorId": "50128231", "name": "W. Schlee"}, {"authorId": "2825185", "name": "B. Langguth"}, {"authorId": "2847350", "name": "H. Baumeister"}, {"authorId": "145714470", "name": "T. Probst"}, {"authorId": "1685612", "name": "M. Spiliopoulou"}, {"authorId": "2052739", "name": "R. Pryss"}], "citations": [{"paperId": "e3ddc0e983923ffac8bb63106cd61d120969ad61", "title": "HARNet: automatic recognition of human activity from mobile health data using CNN and transfer learning of LSTM with SVM"}, {"paperId": "a1f74d518f372758b9a5242aac5106351567ce0d", "title": "A Data Streaming Architecture for Air Quality Monitoring in Smart Cities"}, {"paperId": "3c45a4492e2f767611fd701f28045740afaa9afc", "title": "Geospatial complex event processing in smart city applications"}, {"paperId": "5a100892ed682de7aab09d712e717a5eeaccb988", "title": "Race/Ethnicity, Gender, and Socioeconomic Status Representation in U.S.-Based Randomized Controlled Trials of Tinnitus: A Systematic Review."}, {"paperId": "5bde7d967543739174e9199906f12144bef1dd2c", "title": "Dealing With Inaccurate Sensor Data in the Context of Mobile Crowdsensing and mHealth"}, {"paperId": "7587c29cbe8f8e80d4b690482e3f84a66d0560d5", "title": "Big Geospatial Data or Geospatial Big Data? A Systematic Narrative Review on the Use of Spatial Data Infrastructures for Big Geospatial Sensing Data in Public Health"}, {"paperId": "463b12b4da676a75f54a1d24ba5442f3901f2b49", "title": "A distributed geospatial publish/subscribe system on Apache Spark"}, {"paperId": "a2f79cad1bda9aef05b084331e3ff1dbaf74365f", "title": "Towards the Interpretation of Sound Measurements from Smartphones Collected with Mobile Crowdsensing in the Healthcare Domain: An Experiment with Android Devices"}, {"paperId": "f7028232cf7248c8c7b961ca7e26ed0e627095c0", "title": "eSano – An eHealth Platform for Internet- and Mobile-based Interventions"}, {"paperId": "a7b6113fcec13a00f3e01d46470fb947549e3de7", "title": "Online Debiased Lasso for Streaming Data"}, {"paperId": "efaf4a5c6f672ffe5c898868f7e9ddd8f8907f74", "title": "Trends, Technologies, and Key Challenges in Smart and Connected Healthcare"}, {"paperId": "11467e181b04fe3877ac74d19484de5920a09363", "title": "Online Debiased Lasso"}]}
