{"paperId": "3832c79a7fca13a768a17c4d3766f4e0699e2e57", "publicationVenue": {"id": "5a284490-40a3-4a14-a5c1-51a423dffad6", "name": "ACM International Conference on Embedded Networked Sensor Systems", "type": "conference", "alternate_names": ["ACM Int Conf Embed Networked Sens Syst", "International Conference on Embedded Networked Sensor Systems", "Int Conf Embed Networked Sens Syst", "SenSys"], "url": "https://dl.acm.org/conference/sensys"}, "title": "ApproxDet: content and contention-aware approximate object detection for mobiles", "abstract": "Advanced video analytic systems, including scene classification and object detection, have seen widespread success in various domains such as smart cities and autonomous systems. With an evolution of heterogeneous client devices, there is incentive to move these heavy video analytics workloads from the cloud to mobile devices for low latency and real-time processing and to preserve user privacy. However, most video analytic systems are heavyweight and are trained offline with some pre-defined latency or accuracy requirements. This makes them unable to adapt at runtime in the face of three types of dynamism --- the input video characteristics change, the amount of compute resources available on the node changes due to co-located applications, and the user's latency-accuracy requirements change. In this paper we introduce ApproxDet, an adaptive video object detection framework for mobile devices to meet accuracy-latency requirements in the face of changing content and resource contention scenarios. To achieve this, we introduce a multi-branch object detection kernel, which incorporates a data-driven modeling approach on the performance metrics, and a latency SLA-driven scheduler to pick the best execution branch at runtime. We evaluate ApproxDet on a large benchmark video dataset and compare quantitatively to AdaScale and YOLOv3. We find that ApproxDet is able to adapt to a wide variety of contention and content characteristics and outshines all baselines, e.g., it achieves 52% lower latency and 11.1% higher accuracy over YOLOv3. Our software is open-sourced at https://github.com/purdue-dcsl/ApproxDet.", "venue": "ACM International Conference on Embedded Networked Sensor Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-10-21", "journal": {"name": "Proceedings of the 18th Conference on Embedded Networked Sensor Systems"}, "authors": [{"authorId": "1396536560", "name": "Ran Xu"}, {"authorId": "2200059252", "name": "Chen-Lin Zhang"}, {"authorId": "2108818266", "name": "Pengcheng Wang"}, {"authorId": "2108464612", "name": "Jayoung Lee"}, {"authorId": "145789403", "name": "S. Mitra"}, {"authorId": "2228303", "name": "S. Chaterji"}, {"authorId": "47002659", "name": "Yin Li"}, {"authorId": "1679009", "name": "S. Bagchi"}], "citations": [{"paperId": "249869ad503dbae9774bb340909b8a5a4911b406", "title": "Mondrian: On-Device High-Performance Video Analytics with Compressive Packed Inference"}, {"paperId": "81cabd91414b487f021c110ba9c70311ad6636e9", "title": "Learning-Based Edge-Device Collaborative DNN Inference in IoVT Networks"}, {"paperId": "46f3d9ae7ff61314a237ec6049f81a08a557d906", "title": "SAWEC: Sensing-Assisted Wireless Edge Computing"}, {"paperId": "ca56940861cd4ef1f5ae5cfd8b29138c7c6f662a", "title": "PASS: Patch Automatic Skip Scheme for Efficient On-Device Video Perception"}, {"paperId": "2b6a09a8d2a05b99d6b2cd6a53989cd9fee01dd8", "title": "MIRROR"}, {"paperId": "8badb2e8c7412bf1f3fa1021afe68a8cb1ca38e4", "title": "AdaCLIP: Towards Pragmatic Multimodal Video Retrieval"}, {"paperId": "57b9b1715321f11eadb62d7fb0aadf5e6134e963", "title": "AccuMO: Accuracy-Centric Multitask Offloading in Edge-Assisted Mobile Augmented Reality"}, {"paperId": "b4fca9ce29e122753bed908027ec825d910d6ed0", "title": "EdgeDuet: Tiling Small Object Detection for Edge Assisted Autonomous Mobile Vision"}, {"paperId": "2ca13491844526f62bd6cd4978f2d406f1646fe5", "title": "How to Pipeline Frame Transfer and Server Inference in Edge-assisted AR to Optimize AR Task Accuracy?"}, {"paperId": "c35b61b07bdf6671e062c8c44b0e8939efb71436", "title": "AccDecoder: Accelerated Decoding for Neural-enhanced Video Analytics"}, {"paperId": "9cc87f84b13c7ea2076458a290d90eb82a165461", "title": "Spike-Based Anytime Perception"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "c8b5f08426d4c9182798d6636a30f1c53f0c8f0a", "title": "ROMA: Run-Time Object Detection To Maximize Real-Time Accuracy"}, {"paperId": "256a42e05a0e11aa21523ccaae353f7f2ad136c5", "title": "NeuLens: spatial-based dynamic acceleration of convolutional neural networks on edge"}, {"paperId": "e0906409cd16046d11c949f3936a0088177c4821", "title": "Virtuoso: Energy- and Latency-aware Streamlining of Streaming Videos on Systems-on-Chips"}, {"paperId": "48ee89c1cd53240c869b618b3a535762447d3f40", "title": "Smartadapt: Multi-branch Object Detection Framework for Videos on Mobiles"}, {"paperId": "baa0111f05425eaacb0d3c1ba8dd77dca58944db", "title": "FlexPatch: Fast and Accurate Object Detection for On-device High-Resolution Live Video Analytics"}, {"paperId": "c8510031671052baf009197080469d513f67b26d", "title": "Self-Cueing Real-Time Attention Scheduling in Criticality-Aware Visual Machine Perception"}, {"paperId": "39667c841249644ce67ebf33d8fed493b5a1cea0", "title": "LiteReconfig: cost and content aware reconfiguration of video object detection systems for mobile GPUs"}, {"paperId": "fea67988e9298c804c24054dab2ea708266f184e", "title": "Resource scheduling and provisioning for processing of dynamic stream workflows under latency constraints"}, {"paperId": "2bad0bd9508853a321cca1f8015f76622d78325b", "title": "SmartDet: Context-Aware Dynamic Control of Edge Task Offloading for Mobile Object Detection"}, {"paperId": "499c84de0ed81b2ec384d2442235a91761d01101", "title": "Virtuoso: Video-based Intelligence for real-time tuning on SOCs"}, {"paperId": "6db17d5122b6357b8e992068870092ff89fe3575", "title": "Ramps: Next Generation Platform for Real Time and Resilient IoT Analytics using MmWave and Programmable Switches"}, {"paperId": "e8c90f58d76aabede69af77fa704a1e74e697fdd", "title": "Event Neural Networks"}, {"paperId": "15826649a3a3d6017cc086ba41904e67f5ff2c14", "title": "A data-driven approach to increasing the lifetime of IoT sensor nodes"}, {"paperId": "a3f16b54cfabf56fdf7614d5e9eb19d0b8c882a4", "title": "ORPHEUS: Living Labs for End-to-End Data Infrastructures for Digital Agriculture"}, {"paperId": "53fc331e1a528fc0feac81cad7947adfa030b7c2", "title": "DeepScale: Online Frame Size Adaptation for Multi-object Tracking on Smart Cameras and Edge Servers"}, {"paperId": "f27548c8f29ce10a4b61cd19f4637fc334947dda", "title": "Benchmarking Video Object Detection Systems on Embedded Devices under Resource Contention"}, {"paperId": "fbdde1a876c8a6510eaa8429595e6301ff3adfd7", "title": "Persistent Airborne Surveillance using Semi-Autonomous Drone swarms"}, {"paperId": "47713ad879bc9988e4ef044b9baab3408045f147", "title": "Chanakya: Learning Runtime Decisions for Adaptive Real-Time Perception"}, {"paperId": "6eb7ab884b3f4eef4272fcb5a40b7ef7b349baef", "title": "Towards Performance Clarity of Edge Video Analytics"}, {"paperId": "98f0e6249421c8c98aa0c8b1762d8072762f7d2a", "title": "ApproxNet: Content and Contention-Aware Video Object Classification System for Embedded Clients"}, {"paperId": "5edcec05425895ac2320ac8b969a19ad780f1358", "title": "A PPROX C ALIPER : A P ROGRAMMABLE F RAMEWORK FOR A PPLICATION - AWARE N EURAL N ETWORK O PTIMIZATION"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "54f4075dede9d0e5ed95ca0727a8a1bed9ed7efc", "title": "Virtuoso: Energy- and Latency-Aware Streamlining of Streaming Videos on SOCs"}, {"paperId": "998a86b72eec9b390df682d241d6c587962ac765", "title": "Adaptive Streaming Perception using Deep Reinforcement Learning"}, {"paperId": "f179f0a4db3e0af0ae212173829d3664ec0b4622", "title": "SONIC: Application-aware Data Passing for Chained Serverless Applications"}, {"paperId": "bfdafe6813537d81204db2aa7557e74168b37aa2", "title": "DeepScale: An Online Frame Size Adaptation Framework to Accelerate Visual Multi-object Tracking"}, {"paperId": "6e6d7306028ddfb2f2faf3e3f2409422baa425e6", "title": "2021 USENIX"}, {"paperId": "af90b034313bdc09667991fb4d39c76fe30973e9", "title": "ApproxRobotics: The Cost and Accuracy Tradeoff for Small Mobile AgRobots"}]}
