{"paperId": "383222891883edfa889e208bb29d12dbba2a913c", "publicationVenue": null, "title": "DataChat: An Intuitive and Collaborative Data Analytics Platform", "abstract": "Enterprises invest in data platforms with the aim of extracting meaningful information through analytics. Typically, experts create analytics pipelines that feed into dashboards and provide answers to predetermined questions. This approach makes analytics a spectator sport for most people and introduces operational bottlenecks to leveraging those investments. To improve the value derived from data, many organizations are opting to open up their data assets and allow access to a wider range of users. However, using programming languages such as SQL and Python for analytics can be difficult for most enterprise users. DataChat provides a simplified data science approach that is intuitive, powerful, and accessible to all data users. The platform is built on a library of data functions that are cleanly abstracted to maximize efficiency and ease of use while maintaining a rich suite of tools necessary for data science. With these functions, users can create data analysis pipelines by using a simple point-and-click interface in a spreadsheet view or by using natural English interfaces. Modern sharing and collaboration features are central to all aspects of the platform, allowing teams to easily bridge expertise gaps. A deeper understanding of results is facilitated by providing automatically-generated English explanations of how they were derived. By enhancing these aspects of data science and human-to-human communication, the platform addresses the needs that many organizations are encountering as their analytics needs mature.", "venue": "SIGMOD Conference Companion", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-06-04", "journal": {"name": "Companion of the 2023 International Conference on Management of Data"}, "authors": [{"authorId": "2891738", "name": "Rogers Jeffrey Leo John"}, {"authorId": "2218828903", "name": "Dylan Bacon"}, {"authorId": "2108793284", "name": "Junda Chen"}, {"authorId": "2219552363", "name": "Ushmal Ramesh"}, {"authorId": "2109018738", "name": "Jiatong Li"}, {"authorId": "121490889", "name": "Deepan Das"}, {"authorId": "71133365", "name": "R. Claus"}, {"authorId": "2219555028", "name": "Amos Kendall"}, {"authorId": "2149728753", "name": "Jignesh M. Patel"}], "citations": [{"paperId": "04a016e23ab235549fd9380355fb7d31978abc34", "title": "GPT in Data Science: A Practical Exploration of Model Selection"}, {"paperId": "58219d9826f9ddde448c73e7ecc690111f5698f4", "title": "ReAcTable: Enhancing ReAct for Table Question Answering"}, {"paperId": "34c9a5dcda2449593603825742b0b087f17ab9b8", "title": "Enabling Generative AI to Produce SQL Statements: A Framework for the Auto- Generation of Knowledge Based on EBNF Context-Free Grammars"}]}
