{"paperId": "3843e31da502533ad4c222b31a56eef1df4b6ef3", "publicationVenue": {"id": "182090fa-e886-41f3-8590-443a006fb02f", "name": "Agriculture", "type": "journal", "issn": "0002-1695", "alternate_issns": ["1412-4262", "0551-3677", "2170-1059", "2077-0472"], "url": "http://www.degruyter.com/view/j/agri", "alternate_urls": ["https://www.mdpi.com/journal/agriculture", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217909", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217909", "https://www.agriculture.sk/", "https://revue-agro.univ-setif.dz/"]}, "title": "Exploiting the Internet Resources for Autonomous Robots in Agriculture", "abstract": "Autonomous robots in the agri-food sector are increasing yearly, promoting the application of precision agriculture techniques. The same applies to online services and techniques implemented over the Internet, such as the Internet of Things (IoT) and cloud computing, which make big data, edge computing, and digital twins technologies possible. Developers of autonomous vehicles understand that autonomous robots for agriculture must take advantage of these techniques on the Internet to strengthen their usability. This integration can be achieved using different strategies, but existing tools can facilitate integration by providing benefits for developers and users. This study presents an architecture to integrate the different components of an autonomous robot that provides access to the cloud, taking advantage of the services provided regarding data storage, scalability, accessibility, data sharing, and data analytics. In addition, the study reveals the advantages of integrating new technologies into autonomous robots that can bring significant benefits to farmers. The architecture is based on the Robot Operating System (ROS), a collection of software applications for communication among subsystems, and FIWARE (Future Internet WARE), a framework of open-source components that accelerates the development of intelligent solutions. To validate and assess the proposed architecture, this study focuses on a specific example of an innovative weeding application with laser technology in agriculture. The robot controller is distributed into the robot hardware, which provides real-time functions, and the cloud, which provides access to online resources. Analyzing the resulting characteristics, such as transfer speed, latency, response and processing time, and response status based on requests, enabled positive assessment of the use of ROS and FIWARE for integrating autonomous robots and the Internet.", "venue": "Agriculture", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-02", "journal": {"name": "Agriculture"}, "authors": [{"authorId": "34956292", "name": "L. Emmi"}, {"authorId": "40351823", "name": "R. Fernández"}, {"authorId": "1403763403", "name": "P. González-De-Santos"}, {"authorId": "36486438", "name": "Matteo Francia"}, {"authorId": "1711320", "name": "M. Golfarelli"}, {"authorId": "49978752", "name": "G. Vitali"}, {"authorId": "2216239500", "name": "Hendrik Sandmann"}, {"authorId": "13747368", "name": "M. Hustedt"}, {"authorId": "2216259573", "name": "Merve Wollweber"}], "citations": [{"paperId": "5095b78283f26c8f2a4a05c4665a8bf1c790c08b", "title": "Laser weed seed control: challenges and opportunities"}, {"paperId": "3a5b0449f9bcfbe2c3711d6294ab4b360cac9cde", "title": "Change Management for the Sustainable Development of the Agrarian Economy of Artificial Intelligence"}, {"paperId": "09cf8ea660fb2b80ef99d23b0e020dd95743d5e3", "title": "Potential of Eco-Weeding with High-Power Laser Adoption from the Farmers’ Perspective"}, {"paperId": "24c9a674750376fa36c744d16b40869677d39c3f", "title": "An Efficient Guiding Manager for Ground Mobile Robots in Agriculture"}, {"paperId": "fdc0f1b6f40e6489285855ebe3e336fcb0559471", "title": "Enabling Autonomous Navigation on the Farm: A Mission Planner for Agricultural Tasks"}, {"paperId": "9afcbe7a208a8d5cc7b92a8095cb5036f6193c54", "title": "Robots and Autonomous Machines for Sustainable Agriculture Production"}, {"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "title": "An extensive survey of smart agriculture technologies: Current security posture"}]}
