{"paperId": "384f9bdb15c0f4f6d48b077eca60fc69522f0935", "publicationVenue": {"id": "ccf4a25a-ab6d-4b32-8a6b-fab8cec15859", "name": "Digital Government Research", "type": "conference", "alternate_names": ["DG.O", "Digit Gov Res"]}, "title": "Text mining as a transparency enabler to support decision making in a people management process", "abstract": "This paper discusses a case study that was performed using mining techniques to analyze data pertinent to a people management process of a Federal University. This process consists in observing documents containing data concerning the organizational environment, the duties required by the position, the course program carried out by the employee, and whether they have direct or indirect correlation. Currently, this correlation evaluation is performed subjectively and there are no instruments that can indicate the degree of similarity between the information. We use text mining techniques to automatically identify correlation through textual representation approaches and syntactic and semantic modeling, which retrieve terms and dimension their respective meanings. To obtain the degree of similarity between the respective documents, the measure of the cosines similarity was used. The results showed that the documents evaluated as correlated by the domain expert presented a degree of similarity consistent with the automatic evaluation. For the uncorrelated cases, it was perceived that the degree of high similarity was influenced by the comprehensiveness of the organizational environment common to all documents. After investigation and identification of the appropriate environment specification, the grades obtained represented the evaluation correctly. The proposed approach contributes to the speed of process judgment, as well as to promote formulations of criticism about the content of political qualifications. In addition, it enhanced processes and information transparency by tracking and publicizing all steps. Lastly, we present a simulation for a course recommendation task, considering position profiles and organizational environment.", "venue": "Digital Government Research", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-05-30", "journal": {"name": "Proceedings of the 19th Annual International Conference on Digital Government Research: Governance in the Data Age"}, "authors": [{"authorId": "153147551", "name": "José S. Barroso Júnior"}, {"authorId": "11195097", "name": "Claudia Cappelli"}, {"authorId": "3056270", "name": "K. Revoredo"}, {"authorId": "1796012", "name": "V. Nunes"}], "citations": []}
