{"paperId": "38545e5ff642e6028550eb5e151de94eb2212427", "publicationVenue": {"id": "66e8920f-d30a-439b-9e9c-bcfb052b0cfa", "name": "International Conferences on Biological Information and Biomedical Engineering", "type": "conference", "alternate_names": ["IEEE Int Conf Bioinform Bioeng", "BIBE", "Int Conf Biological Inf Biomed Eng", "Bioinform Bioeng", "Bioinformatics and Bioengineering", "IEEE International Conference on Bioinformatics and Bioengineering"], "url": "http://www.wikicfp.com/cfp/program?id=282"}, "title": "Predictive Analytics to Support Health Informatics on COVID-19 Data", "abstract": "Bioinformatics and health informatics-in conjection with data science, data mining and machine learning-have been applied in numerous real-life applications including disease and healthcare analytics, such as predictive analytics of coronavirus disease 2019 (COVID-19). Many of these existing works usually require large volumes of data train the classification and prediction models. However, these data (e.g., computed tomography (CT) scan images, viral/molecular test results) that can be expensive to produce and/or not easily accessible. For instance, partially due to privacy concerns and other factors, the volume of available disease data can be limited. Hence, in this paper, we present a predictive analytics system to support health analytics. Specifically, the system make good use of autoencoder and few-shot learning to train the prediction model with only a few samples of more accessible and less expensive types of data (e.g., serology/antibody test results from blood samples), which helps to support prediction on classification of potential patients (e.g., potential COVID-19 patients). Moreover, the system also provides users (e.g., healthcare providers) with predictions on hospitalization status and clinical outcomes of COVID-19 patients. This provides healthcare administrators and staff with a good estimate on the demand for healthcare support. With this system, users could then focus and provide timely treatment to the true patients, thus preventing them for spreading the disease in the community. The system is helpful, especially for rural areas, when sophisticated equipment (e.g., CT scanners) may be unavailable. Evaluation results on a real-life datasets demonstrate the effectiveness of our digital health system in health analytics, especially in classifying patients and their medical needs.", "venue": "International Conferences on Biological Information and Biomedical Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-25", "journal": {"name": "2021 IEEE 21st International Conference on Bioinformatics and Bioengineering (BIBE)", "pages": "1-9"}, "authors": [{"authorId": "1726081", "name": "C. Leung"}, {"authorId": "2140498801", "name": "Thanh Huy Daniel Mai"}, {"authorId": "2150443116", "name": "N. D. Tran"}, {"authorId": "1905681423", "name": "Christine Y. Zhang"}], "citations": [{"paperId": "bfd294464559d951498eeb2d242b1be312c5151b", "title": "A Novel Deep Learning Approach for Breast Cancer Detection on Screening Mammography"}, {"paperId": "249197db5c8c964a76726bcab7ee23dc3b7036ef", "title": "A Secure and Privacy Preserving Telehealth Solution in Fog Based Environment"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "6cf5ee5618978ae7d465d5f17356efd300e12fb2", "title": "A comparative analysis of anti-vax discourse on twitter before and after COVID-19 onset"}, {"paperId": "b38235fd1746be6d89d10960549f2c78a9d263fb", "title": "Towards Trustworthy Artificial Intelligence in Healthcare"}, {"paperId": "e1abde48eb0d0477e7c367ed101aec5076c2889b", "title": "A Deep Learning Based Predictive Model for Healthcare Analytics"}]}
