{"paperId": "385a7e0a33d1f49c60bb677811b31a0e080f2baa", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Improved Differential Evolution Algorithm for Slab Allocation and Hot-Rolling Scheduling Integration Problem", "abstract": "To reduce logistics scheduling costs and energy consumption, this paper studies the slab allocation and hot-rolling scheduling integrated optimization problem that arises in practical iron and steel enterprises. In this problem, slabs are first allocated to orders and then sent to heating furnaces for heating; then, they are sent to a hot-rolling mill for rolling. A 0–1 integer programming model is established to minimize the attribute difference in the allocation cost between slabs and orders, the switching cost of hot-rolling processing, and waiting times after slabs reach rolling mills. Given the problem’s characteristics, an improved differential evolution algorithm using a real-number coding method is designed to solve it. Three different heuristic algorithms are proposed to improve the quality of solutions in the initial population. Multiple parent individuals participate in the mutation operation, which increases the population diversity and prevents the algorithm from falling into the local optimum prematurely. Experiments on 14 sets of real production data from a large domestic iron and steel plant show that our improved differential evolution algorithm generates significantly better solutions in a reasonable amount of time compared with CPLEX, the simulated artificial method, and the classical differential evolution algorithm, and it can be used by practitioners.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-26", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2115956089", "name": "Lulu Song"}, {"authorId": "2194266987", "name": "Ying Meng"}, {"authorId": "47748043", "name": "Q. Guo"}, {"authorId": "2216578384", "name": "Xinchang Gong"}], "citations": [{"paperId": "65ee30d39550fc8a752174d7c5fe3275739c4116", "title": "A Fuzzy Portfolio Model With Cardinality Constraints Based on Differential Evolution Algorithms"}, {"paperId": "cc0e649f8d9830d4ced1d52d0cb5a55d6df6de3e", "title": "Bi-Level Iterative Optimization for Integrated Scheduling of Continuous Casting-Hot Rolling"}]}
