{"paperId": "38716d498aeaef16428b384285d691fda607f4bc", "publicationVenue": {"id": "6dc36a30-cc99-4370-b330-e671558d5446", "name": "International journal of engineering and technology", "type": "journal", "alternate_names": ["Int J Eng Technol", "Int j eng technol", "International journal of engineering & technology", "Int j eng  technol", "International Journal of Engineering and Technologies", "Int J Eng  Technol", "International Journal of Engineering & Technology", "International Journal of Engineering and Technology"], "issn": "2564-6184", "alternate_issns": ["0975-4024", "2077-1185", "2227-524X", "2049-3444", "2297-623X", "1812-7711", "1793-8236"], "url": "http://dergipark.gov.tr/ijente", "alternate_urls": ["http://www.enggjournals.com/ijet/", "https://www.sciencepubco.com/index.php/ijet", "http://www.enggjournals.com/ijet/index.html", "http://www.iet-journals.org/", "http://www.ijetch.org/", "http://gscience.gurpukur.com/index.php?cPath=5", "https://www.scipress.com/ETET.5", "https://www.scipress.com/IJET"]}, "title": "Effective Cluster Model of Thermal Power Company Management", "abstract": "The aim of this study is to determine the need for cluster formations; to identify the influence factors on the creation of a cluster of thermal power companies in Poltava region. The method of evaluating the efficiency of formation of this cluster has been developed.The methodological framework of this research is general scientific dialectical method of cognition, in which the research object is studied as a dynamic system in the process of its development. The formation of the main directions of thermal power company development was carried out on the basis of dialectical, historical and systematic methods. In the process of studying and generalization of scientific and practical development methods of comparison, analysis and synthesis, induction and deduction were applied. Also the study is based on regulatory and economic instruments, economical studies and studies of scientific research institutions.As a result of the study the main participants of the cluster formation were identified. So it may be comprised of the members of the cluster, generating thermal energy, the thermal energy consumers and the region where the cluster of thermal power companies will be formed. According to the participants of cluster associations the factors of influence on economic and social effect from implementation of the cluster thermal power companies in the Poltava region were formed. We determined that to reduce the rate for thermal energy it is necessary to conduct a number of activities. The application of the proposed measures will significantly reduce the services cost of thermal power companies. The cost of thermal energy and the distribution among the participants of cluster associations were calculated on the example of Poltava region utility production enterprise of heat economy \"Poltavateploenergo\". The participants are heat producers, transport companies, distribution and heat supply companies, repair work companies, construction work enterprises. It is established that the overall effect of cluster members has both quantitative and qualitative nature. The impact on consumers is qualitative. It is based on the fact that the tariff for consumers remained unchanged in the medium term (five years). The essence of economic effect is in the quality and timeliness of services thermal management. The overall effect of its work influences all members. It occurs when there is the formation and implementation of cluster thermal power companies.But in addition to the advantages of cluster associations its major problems were presented in the work. Among them there are the following problems: the lack of informativeness of executive authorities and business representatives in the application of the cluster approach; the lack of public policy to ensure the systematic approach and organization of interaction between different levels of executive authorities in the implementation of cluster projects; lack of institutional and financial support to cluster initiatives; lack of trained personnel in the organizational aspects of cluster technologies; the lack of effective methodological base for the application of cluster technologies. Scientific novelty of received results is the development and calculation of economic effect from the formation of a cluster of thermal power companies both at the regional level and at the level of the enterprise and the consumer.  ", "venue": "International journal of engineering and technology", "year": 2018, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2018-06-20", "journal": {"name": "International Journal of Engineering & Technology"}, "authors": [{"authorId": "121546105", "name": "V. Chevhanova"}, {"authorId": "89090990", "name": "K. Chichulina"}, {"authorId": "123044373", "name": "V. Skryl"}], "citations": [{"paperId": "f90d0fdc69a490da0ef7a16d340e1d58fe632ea6", "title": "Economic and Mathematical Modeling of Innovative Development of Enterprises in the Construction Industry"}, {"paperId": "a3689950963a563c54ce305dd4cb5b72932e3c81", "title": "Construction Management Based on European Experience of Using Smart-City Technology"}, {"paperId": "f94d4d276d87fa9773995b3c696ec908beca3516", "title": "The Main Vectors of Labor and Education Transformation of Modern Workforce"}]}
