{"paperId": "3874e4fefd54d6113532ee90dc67fe19fae40031", "publicationVenue": {"id": "1821f570-7281-46a3-b739-43ee10e1a19a", "name": "International Black Sea Conference on Communications and Networking", "type": "conference", "alternate_names": ["Int Black Sea Conf Commun Netw", "IEEE Int Black Sea Conf Commun Netw", "BlackSeaCom", "IEEE International Black Sea Conference on Communications and Networking"]}, "title": "Mobile sink assisted data gathering for URLLC in IoT using a fuzzy logic system", "abstract": "The Internet of Things (IoT) is a new technology that employs a variety of sensors and wireless communication protocols. People are leveraging IoT facilitate their actions by using innovative and intelligent equipment. An increasing number of sensors can decrease the Quality of Service (QoS), so implementing a suitable algorithm in an IoT network may enhance this parameter. One of the important applications in IoT with strict QoS requirements is the Ultra-Reliability and Low Latency Communication (URLLC). Several types of URLLC services can be provided in the IoT based on the user's requirements. Also, a proper Cluster Head (CH) selection plays a vital role in receiving and transmitting data and reduces the energy consumption of the devices. In today's IoT devices, the mobility of the sink nodes is one of the most important features to be considered in real-world applications. The selection of the CH is an NP-Hard problem; thus, a fuzzy logic protocol is used to select the appropriate CH and intermediate nodes for routing, and the results are presented in this paper. This method is developed in order to minimize the delay, and energy consumption as well as enhancing the reliability. The method has been tested via MA TLAB Simulation and the results are presented in the final section of the present paper.", "venue": "International Black Sea Conference on Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-06", "journal": {"name": "2022 IEEE International Black Sea Conference on Communications and Networking (BlackSeaCom)", "pages": "379-384"}, "authors": [{"authorId": "2087423266", "name": "Seyedsalar Sefati"}, {"authorId": "2372333", "name": "S. Halunga"}], "citations": [{"paperId": "d0d280a07ef77c588853155d2a6e06035af6d71f", "title": "Meet User’s Service Requirements in Smart Cities Using Recurrent Neural Networks and Optimization Algorithm"}, {"paperId": "c38562f9e5230de41ddbc661036f2654f14b951d", "title": "QoS-based routing protocol and load balancing in wireless sensor networks using the markov model and the artificial bee colony algorithm"}, {"paperId": "aef435a92bbee92ca155d135c2258b813cbe0af1", "title": "Ultra‐reliability and low‐latency communications on the internet of things based on 5G network: Literature review, classification, and future research view"}, {"paperId": "8d3eef3f2d3c8ec55480b894bd642135fee727de", "title": "Enhancement of Quality of Service (QoS) in Internet of Things based on big data environment using the Harris Hawks algorithm"}, {"paperId": "57c9160da0ec742f436c9f912351f40eeb225f85", "title": "Review on sink mobility-based routing algorithms in WSN proposed in the Year 2022"}, {"paperId": "34282daf345a676e03d10d0b698f2c3e95dfbb3d", "title": "A Novel Routing Protocol based on Prediction of Energy Consumption and Link Stability in Mobile Internet of Thing (MIoT)"}]}
