{"paperId": "387e267278b707fcb8a24d6ed75a3f4e45480ed1", "publicationVenue": {"id": "a13678b6-fa73-4df9-ae55-396d24562b66", "name": "Journal of Documentation", "type": "journal", "alternate_names": ["J Doc"], "issn": "0022-0418", "url": "https://www.emerald.com/insight/publication/issn/0022-0418", "alternate_urls": ["http://emeraldinsight.com/loi/jd"]}, "title": "Algorithmic recommendations enabling and constraining information practices among young people", "abstract": "PurposeThis study addresses how algorithmic recommendations and their affordances shape everyday information practices among young people.Design/methodology/approachThematic interviews were conducted with 20 Finnish young people aged 15–16 years. The material was analysed using qualitative content analysis, with a focus on everyday information practices involving online platforms.FindingsThe key finding of the study is that the current affordances of algorithmic recommendations enable users to engage in more passive practices instead of active search and evaluation practices. Two major themes emerged from the analysis: enabling not searching, inviting high trust, which highlights the how the affordances of algorithmic recommendations enable the delegation of search to a recommender system and, at the same time, invite trust in the system, and constraining finding, discouraging diversity, which focuses on the constraining degree of affordances and breakdowns associated with algorithmic recommendations.Originality/valueThis study contributes new knowledge regarding the ways in which algorithmic recommendations shape the information practices in young people's everyday lives specifically addressing the constraining nature of affordances.", "venue": "Journal of Documentation", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-16", "journal": {"name": "Journal of Documentation"}, "authors": [{"authorId": "2277321113", "name": "Ville Jylhä"}, {"authorId": "1843624", "name": "Noora Hirvonen"}, {"authorId": "2261147309", "name": "Jutta Haider"}], "citations": []}
