{"paperId": "388a8cbeca59ca55398c85e61f2ae3431d3784df", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Comparative Analysis of Big Data Frameworks: An Adoption Perspective", "abstract": "The emergence of social media, the worldwide web, electronic transactions, and next-generation sequencing not only opens new horizons of opportunities but also leads to the accumulation of a massive amount of data. The rapid growth of digital data generated from diverse sources makes it inapt to use traditional storage, processing, and analysis methods. These limitations have led to the development of new technologies to process and store very large datasets. As a result, several execution frameworks emerged for big data processing. Hadoop MapReduce, the pioneering framework, set the ground for forthcoming frameworks that improve the processing and development of large-scale data in many ways. This research focuses on comparing the most prominent and widely used frameworks in the open-source landscape. We identify key requirements of a big framework and review each of these frameworks in the perspective of those requirements. To enhance the clarity of comparison and analysis, we group the logically related features, forming a feature vector. We design seven feature vectors and present a comparative analysis of frameworks with respect to those feature vectors. We identify use cases and highlight the strengths and weaknesses of each framework. Moreover, we present a detailed discussion that can serve as a decision-making guide to select the appropriate framework for an application.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2143894745", "name": "Madiha Khalid"}, {"authorId": "2910122", "name": "M. Yousaf"}], "citations": [{"paperId": "e9876b1474f0d79529a2fa592bcce39ee789c1ca", "title": "Big data clustering based on spark chaotic improved particle swarm optimization"}, {"paperId": "e48ffbb51943064173cf8cf25cf93ed941bf7887", "title": "Population based metaheuristics in Spark: Towards a general framework using PSO as a case study"}, {"paperId": "6168adfc298a4c84bce6286d007ba267b530e346", "title": "Accelerating Data Migration: A Comparative Study of Apache Spark and Other Leading Tools"}, {"paperId": "fedff66ebf19f1ab1371b18342ae75fdca1a8731", "title": "A Comparative Study of Bigdata Tools: Hadoop Vs Spark Vs Storm"}, {"paperId": "08b4e5775d87bbe8d30be4fb660576f79b8f3c67", "title": "Detection of anomalies in the HDFS dataset"}, {"paperId": "8b6d9aa5d16c2cad15efe05c52e4fee74ac25fc1", "title": "THE MINISTRY OF SCIENCE AND HIGHER EDUCATION OF THE RUSSIAN FEDERATION"}, {"paperId": "5df4a60e43c1cc587cebfcb9d4a67fb018515d6d", "title": "Research on Legal Supervision System for Economic Based on Big Data"}]}
