{"paperId": "388aeb726dbc0716f60cc2d3d234a3cd68209d9b", "publicationVenue": null, "title": "A Review on Diagnosis and Management of Arrhythmia Using ML", "abstract": ": Cardiac arrhythmia refers to a variety of heart rhythm disorders in which the heartbeat is irregular, rapid, or sluggish. Arrhythmias come in a variety of forms, some of which have no symptoms. When symptoms are present, palpitations or a sense of a pause between heartbeats may be noticeable. In more extreme instances, lightheadedness, fainting, shortness of breath, or chest discomfort may develop. While most arrhythmias are harmless, some can cause serious complications such as stroke or heart failure. Others might lead to cardiac arrest. Arrhythmia affects millions of individuals throughout the world. Nearly half of all deaths due by cardiovascular disease, or roughly 15% of all deaths globally, are caused by sudden cardiac death. Ventricular arrhythmias account for approximately 80% of sudden cardiac death. Arrhythmias can affect people of any age, although they are more frequent as they get older. approach to remove those features that are not contributing enough to improve system performance. To find an optimal network configuration, we proposed a stacked genetic algorithm that stacks two genetic algorithms to give an optimally configured DBN. An analysis of a RBM and DBN trained is performed to give an insight how the system works. Six metrics were used to evaluate the proposed method, including accuracy, sensitivity, specificity, precision, F1 score, and Matthew’s correlation coefficient. The experimental results are compared with other state-of-the-art methods, and OCI-DBN shows a better performance. The validation results assure that the proposed method can provide reliable recommendations to heart disease patients by improving the accuracy of heart disease predictions by up to 94.61%. two deep network classifiers isolated well-organized training groups a chance to build more accurate prediction models. When predicting the risk of coronary heart disease from the given input, only one appropriate model is selected based on the reconstruction error on the Principal Component Analysis model. Dataset used in this study was collected from the Korean National Health and Nutritional Examination Survey. We have conducted two types of experiments on the dataset. The first one proved how Principal Component Analysis and Variational Autoencoder models of the proposed method improves the performance of a single deep neural network. The second experiment compared the proposed method with existing machine learning algorithms, including Naïve Bayes, Random Forest, K-Nearest Neighbor, Decision Tree, Support Vector Machine, and Adaptive Boosting. The experimental results show that the proposed method outperformed conventional machine learning algorithms by giving the accuracy of 0.892, specificity of 0.840, precision of 0.911, recall of 0.920, f-measure of 0.915, and AUC of 0.882.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2176877651", "name": "Dr. Chayadevi"}], "citations": []}
