{"paperId": "38911c40da11fb99bdfc40973bbfd0fd22aa90a7", "publicationVenue": null, "title": "Forecasting Student Achievement through Machine Learning Models", "abstract": "The paper discusses the challenges faced by universities and technical organizations in analyzing students' performance using digital data from various sources such as social media, research, agriculture, and medical records. The two key processes for data collection and analysis are admission and placement, which significantly impact the university's reputation. In addition to academic performance, other factors contribute to understanding a student's overall performance. The paper proposes a system called the forecasting student achievement that enables lecturers to monitor students' results and provides a predictive capability to identify students who may perform poorly in their courses. In this paper, we present a comprehensive analysis of several machine learning classifiers and focuses on the classification performance of Decision Trees, Random Forest, Extreme Gradient Boosting (XGBoost), Logistic Regression, Adaptive Boosting (Adaboost), Naive Bayes, and Support Vector Machines (SVM) with different kernel functions. The model reveal remarkable accuracy in several classifiers, with Decision Trees, Random Forest, XGBoost, Logistic Regression, and SVM (Polynomial Kernel). Additionally, Naive Bayes and Adaboost demonstrate strong classification performance, achieving accuracy scores of 0.976 and 0.99, respectively. Notably, SVM with Linear and Gaussian Kernels exhibit accuracy scores of 0.96, indicating their capability in handling the task.", "venue": "2023 7th International Conference on Electronics, Communication and Aerospace Technology (ICECA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-22", "journal": {"name": "2023 7th International Conference on Electronics, Communication and Aerospace Technology (ICECA)", "pages": "1170-1174"}, "authors": [{"authorId": "2275187537", "name": "N. Abinaya"}, {"authorId": "2283500466", "name": "S. Privanka"}, {"authorId": "2283500464", "name": "E. Pavithra"}, {"authorId": "2283499790", "name": "S. Archanaa"}, {"authorId": "2283500801", "name": "S. R. Dharunraja"}, {"authorId": "2283499013", "name": "R. Vignesh"}], "citations": []}
