{"paperId": "3895ed33a13b2e99b7d376f501804a67d1af933e", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Human Activity Recognition Data Analysis: History, Evolutions, and New Trends", "abstract": "The Assisted Living Environments Research Area–AAL (Ambient Assisted Living), focuses on generating innovative technology, products, and services to assist, medical care and rehabilitation to older adults, to increase the time in which these people can live. independently, whether they suffer from neurodegenerative diseases or some disability. This important area is responsible for the development of activity recognition systems—ARS (Activity Recognition Systems), which is a valuable tool when it comes to identifying the type of activity carried out by older adults, to provide them with assistance. that allows you to carry out your daily activities with complete normality. This article aims to show the review of the literature and the evolution of the different techniques for processing this type of data from supervised, unsupervised, ensembled learning, deep learning, reinforcement learning, transfer learning, and metaheuristics approach applied to this sector of science. health, showing the metrics of recent experiments for researchers in this area of knowledge. As a result of this article, it can be identified that models based on reinforcement or transfer learning constitute a good line of work for the processing and analysis of human recognition activities.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-04-29", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "1410507913", "name": "P. Ariza-Colpas"}, {"authorId": "1680785", "name": "E. Vicario"}, {"authorId": "2077408180", "name": "Ana Isabel Oviedo Carrascal"}, {"authorId": "47625057", "name": "S. A. Butt"}, {"authorId": "1412756302", "name": "M. Piñeres-Melo"}, {"authorId": "2163885104", "name": "A. Quintero-Linero"}, {"authorId": "1963502", "name": "Fulvio Patara"}], "citations": [{"paperId": "386995ad352a5252df6f4055a9e1e2daebacffdb", "title": "Delving into Human Factors through LSTM by Navigating Environmental Complexity Factors within Use Case Points for Digital Enterprises"}, {"paperId": "c16ed261238009c4ea2961a02ec9506134029737", "title": "Optimization Algorithm of Intelligent Warehouse Management System Based on Reinforcement Learning"}, {"paperId": "053e6d8672ba9dd784dc1e7d431a9685bafc1f8a", "title": "Construction And Performance Evaluation of Big Data Prediction Model Based on Fuzzy Clustering Algorithm in Cloud Computing Environment"}, {"paperId": "c60fd7ac9a40f2faf4dc72f1b9b5f176bc9957b5", "title": "An improved human activity recognition technique based on convolutional neural network"}, {"paperId": "e3ddc0e983923ffac8bb63106cd61d120969ad61", "title": "HARNet: automatic recognition of human activity from mobile health data using CNN and transfer learning of LSTM with SVM"}, {"paperId": "1db479502cc25593662ef1cfac69abd0a823b859", "title": "A hybrid and context-aware framework for normal and abnormal human behavior recognition"}, {"paperId": "c6b6f5a9e9f41cc331e3eea1b292302181698df3", "title": "Human Activity Recognition via Score Level Fusion of Wi-Fi CSI Signals"}, {"paperId": "c9ea2c6c108ee3e94e4c248639a868242fa624a3", "title": "Exploring Regularization Methods for Domain Generalization in Accelerometer-Based Human Activity Recognition"}, {"paperId": "5eb105d4d333eaeab925e0bbe53f183785111698", "title": "A Hybrid Deep Learning Model for Human Activity Recognition and Fall Detection for the Elderly"}, {"paperId": "2529e348327d7d5058239aa88a05f8e514083314", "title": "Investigation of Machine Learning Models for Human Activity Recognition: A Comparative Study"}, {"paperId": "edbdbce8d51733d66aebb8966619569ae7adb4d3", "title": "Human Activity Recognition with Smartphone using Classical Machine Learning Models"}, {"paperId": "f6a70420b359d9275782bd24204c59ac4dac550c", "title": "Induction Motor Fault Diagnosis Using Support Vector Machine, Neural Networks, and Boosting Methods"}, {"paperId": "ba07539269c3fee9fcd7c364e87c2221ae59400e", "title": "Deep Activity Recognition based on Patterns Discovery for Healthcare Monitoring"}, {"paperId": "6d29c8f7838d6a653e41e400367209b015c99658", "title": "Smartphone-Based Human Activity and Fall Recognition Using Deep Feature Extraction and Machine-Learning Classifiers"}, {"paperId": "6fb03c1003ea517df32a0309ce17f8e3a57c669c", "title": "Comparing Handcrafted Features and Deep Neural Representations for Domain Generalization in Human Activity Recognition"}, {"paperId": "8b7a98404d5e3eba5f9b5a1735c9041b27bfa1e2", "title": "Heterogeneous Recognition of Human Activity with CNN and RNN-based Networks using Smartphone and Smartwatch Sensors"}, {"paperId": "3e3bdaab4d9e8dd957f83ea13db7a4d997a6ae8f", "title": "Prediction of Kick Count in Triathletes during Freestyle Swimming Session Using Inertial Sensor Technology"}]}
