{"paperId": "38afd50933113f97baddd734e1b5b71fec660d34", "publicationVenue": {"id": "a2802f40-c210-444a-92bf-62245b599bb1", "name": "EDBT/ICDT Workshops", "type": "conference", "alternate_names": ["EDBT-ICDT", "EDBT/ICDT Work"]}, "title": "Communication Cost in Parallel Query Processing", "abstract": "We study the problem of computing conjunctive queries over large databases on parallel architectures without shared storage. Using the structure of such a query $q$ and the skew in the data, we study tradeoffs between the number of processors, the number of rounds of communication, and the per-processor load -- the number of bits each processor can send or can receive in a single round -- that are required to compute $q$. \nWhen the data is free of skew, we obtain essentially tight upper and lower bounds for one round algorithms and we show how the bounds degrade when there is skew in the data. In the case of skewed data, we show how to improve the algorithms when approximate degrees of the heavy-hitter elements are available, obtaining essentially optimal algorithms for queries such as simple joins and triangle join queries. \nFor queries that we identify as tree-like, we also prove nearly matching upper and lower bounds for multi-round algorithms for a natural class of skew-free databases. One consequence of these latter lower bounds is that for any $\\varepsilon>0$, using $p$ processors to compute the connected components of a graph, or to output the path, if any, between a specified pair of vertices of a graph with $m$ edges and per-processor load that is $O(m/p^{1-\\varepsilon})$ requires $\\Omega(\\log p)$ rounds of communication. \nOur upper bounds are given by simple structured algorithms using MapReduce. Our one-round lower bounds are proved in a very general model, which we call the Massively Parallel Communication (MPC) model, that allows processors to communicate arbitrary bits. Our multi-round lower bounds apply in a restricted version of the MPC model in which processors in subsequent rounds after the first communication round are only allowed to send tuples.", "venue": "EDBT/ICDT Workshops", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-02-19", "journal": {"pages": "27"}, "authors": [{"authorId": "144823759", "name": "Dan Suciu"}], "citations": [{"paperId": "9f864821ae1a1bcb4fa3d5cd3eb74d0b8b690411", "title": "A Guide to Formal Analysis of Join Processing in Massively Parallel Systems"}, {"paperId": "b0160842883e95ec8112a3226281a81f079db4ed", "title": "Logical Aspects of Massively Parallel and Distributed Systems"}, {"paperId": "fe3603e516e9d32bbb9f964db217924769d71aa1", "title": "Principles of Data Management (Abridged)"}]}
