{"paperId": "38c964ca346d319b00089d7b8e062e6eda4c790c", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "Persistent Summaries", "abstract": "A persistent data structure, also known as a multiversion data structure in the database literature, is a data structure that preserves all its previous versions as it is updated over time. Every update (inserting, deleting, or changing a data record) to the data structure creates a new version, while all the versions are kept in the data structure so that any previous version can still be queried. Persistent data structures aim at recording all versions accurately, which results in a space requirement that is at least linear to the number of updates. In many of today’s big data applications, in particular, for high-speed streaming data, the volume and velocity of the data are so high that we cannot afford to store everything. Therefore, streaming algorithms have received a lot of attention in the research community, which uses only sublinear space by sacrificing slightly on accuracy. All streaming algorithms work by maintaining a small data structure in memory, which is usually called a sketch, summary, or synopsis. The summary is updated upon the arrival of every element in the stream, thus it is ephemeral, meaning that it can only answer queries about the current status of the stream. In this article, we aim at designing persistent summaries, thereby giving streaming algorithms the ability to answer queries about the stream at any prior time.", "venue": "ACM Transactions on Database Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-23", "journal": {"name": "ACM Transactions on Database Systems (TODS)", "pages": "1 - 42", "volume": "47"}, "authors": [{"authorId": "2111712632", "name": "Tian Zeng"}, {"authorId": "12457830", "name": "Zhewei Wei"}, {"authorId": "2142400057", "name": "Ge Luo"}, {"authorId": "144744111", "name": "K. Yi"}, {"authorId": "2152944669", "name": "Xiaoyong Du"}, {"authorId": "2259699", "name": "Ji-Rong Wen"}], "citations": []}
