{"paperId": "38ce64e31a54ecc17a3f9690cca2d685a5718861", "publicationVenue": null, "title": "Blockchain as IoT Economy Enabler: A Review of Architectural Aspects", "abstract": "In the IoT-based economy, a large number of subjects (companies, public bodies, or private citizens) are willing to buy data or services offered by subjects that provide, operate, or host IoT devices. To support economic transactions in this setting, and to pave the way for the implementation of decentralized algorithmic governance powered by smart contracts, the adoption of the blockchain has been proposed both in scientific literature and in actual projects. The blockchain technology promises a decentralized payment system independent of (and possibly cheaper than) conventional electronic payment systems. However, there are a number of aspects that need to be considered for an effective IoT–blockchain integration. In this review paper, we start from a number of real IoT projects and applications that (may) take advantage of blockchain technology to support economic transactions. We provide a reasoned review of several architectural choices in light of typical requirements of those applications and discuss their impact on transaction throughput, latency, costs, limits on ecosystem growth, and so on. We also provide a survey of additional financial tools that a blockchain can potentially bring to an IoT ecosystem, with their architectural impact. In the end, we observe that there are very few examples of IoT projects that fully exploit the potential of the blockchain. We conclude with a discussion of open problems and future research directions to make blockchain adoption easier and more effective for supporting an IoT economy.", "venue": "J. Sens. Actuator Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-29", "journal": {"name": "J. Sens. Actuator Networks", "pages": "20", "volume": "11"}, "authors": [{"authorId": "94580478", "name": "Diego Pennino"}, {"authorId": "1721655", "name": "M. Pizzonia"}, {"authorId": "1950204", "name": "A. Vitaletti"}, {"authorId": "1471441018", "name": "Marco Zecchini"}], "citations": [{"paperId": "d6b5fd7a960cf90f151655e88ab3efffa76cfff8", "title": "Machine Learning Techniques for Cyberattack Prevention in IoT Systems: A Comparative Perspective of Cybersecurity and Cyberdefense in Colombia"}, {"paperId": "a9eb8c961bc7364180b3c5ed458e354b93349442", "title": "Blockchain Architectures for the Digital Economy: Trends and Opportunities"}, {"paperId": "67acd244047874a7155160a1f9b1b1f61b9fb2b9", "title": "Challenges in Blockchain as a Solution for IoT Ecosystem Threats and Access Control: A Survey"}, {"paperId": "976001dc5b3361d8531448e1f6ca28e809945824", "title": "An Aspect-Oriented Approach to Time-Constrained Strategies in Smart City IoT Applications"}, {"paperId": "3b6dcbea0f406665edea1e1f3b9552ddb54686eb", "title": "Bitcoin-Powered IoT Networks for Climate Change Research: a Peer-to-Peer Micro-Payment System to Enhance Data Collection"}, {"paperId": "759ef5885dfd6b89c65f37083bf873544bca1f63", "title": "A Blockchain-Enabled IoT Logistics System for Efficient Tracking and Management of High-Price Shipments: A Resilient, Scalable and Sustainable Approach to Smart Cities"}, {"paperId": "7328e203ed834eba49ab850e4380ff6b8f743f13", "title": "Decoding the data economy: a literature review of its impact on business, society and digital transformation"}, {"paperId": "72ba0a363a7a068338bbdf84cf1244adaccf451b", "title": "The foundation for future education, teaching, training, learning, and performing infrastructure - The open interoperability conceptual framework approach"}, {"paperId": "823106eb1f834cd7e7932c8ae751ae2dfee7a099", "title": "Blockchain-Enabled IoT for Rural Healthcare: Hybrid-Channel Communication with Digital Twinning"}, {"paperId": "638592ac535737e3b2dea9227337c2a975e36d67", "title": "On-Chain Global Maintenance Services"}, {"paperId": "04c6b3d1ddcbd976532ae474bbc33fb6da54b5e9", "title": "Blockchain for the supply chain of the Italian craft beer sector: tracking and discount coupons"}, {"paperId": "5c3df81691f18dda5ca943b91bd9bcb828b3c306", "title": "IoT and Blockchain Integration: Applications, Opportunities, and Challenges"}, {"paperId": "d192ef2d2c96d6a77a6ab7314dd94d0100aa244e", "title": "Internet of Things and Blockchain Integration: Security, Privacy, Technical, and Design Challenges"}, {"paperId": "2197686c17b0a7ebd48eb88d8601853f62ddb6fb", "title": "New Ways of Working through Emerging Technologies: A Meta-Synthesis of the Adoption of Blockchain in the Accountancy Domain"}, {"paperId": "f8169467540c0f9bd5b2cba82a440a338dd9493b", "title": "Promises, Challenges and Opportunities of Integrating SDN and Blockchain with IoT Applications: A Survey"}, {"paperId": "24342221b6d6378506f43e7f0a86b4490d8540de", "title": "Blockchain-Based Tracking of the Supply Chain of the Italian Craft Beer Sector"}]}
