{"paperId": "38d231dc11e78813542dacc1793d6953ce9de232", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "Characterization of I/O Behaviors in Cloud Storage Workloads", "abstract": "As cloud platforms become increasingly popular, accurately understanding I/O behaviors in modern cloud storage is of paramount importance for system design and optimization. This paper sheds new light on the correlation of inter-arrival times of both read and write requests at the block level in four representative cloud storage workloads – AliCloud, Systor’17, MSRC and FIU. Our study reveals that I/O arrivals at the block level are very complex in modern cloud storage. There is a certain degree of correlation in the long-term timescale for request arrival intervals in AliCloud and Systor’17_read. Request arrival intervals in MSRC, FIU and Systor’17_write, however, are almost uncorrelated. The Gaussianity test confirms that I/O burstiness appears to be Gaussian in AliCloud_write and Systor’17_read, but the burstiness is non-Gaussian in other workloads. Importantly, we unfold the existence of self-similarity in cloud storage workloads with a certain degree of correlations, via visual evidence, the autocorrelation structure of the aggregated process of I/O request sequences, and Hurst parameter estimates. We further design an alpha-stable workload model for synthetic I/O generation, and the experimental results demonstrate that our model has an edge over conventional models in terms of accurately emulating I/O burstiness.", "venue": "IEEE transactions on computers", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "2726-2739", "volume": "72"}, "authors": [{"authorId": "2054838166", "name": "Qiang Zou"}, {"authorId": "1778450", "name": "Yifeng Zhu"}, {"authorId": "3269044", "name": "Jianxi Chen"}, {"authorId": "35143368", "name": "Yuhui Deng"}, {"authorId": "2153438883", "name": "Xiao Qin"}], "citations": [{"paperId": "fe214ae34265f06e6ad93712175b3ffe266a97cd", "title": "Cloud Storage Workload Characterization: An Approach with Time-Series Analysis"}]}
