{"paperId": "38d395767130cefc273eec61ca8cd8bb5d174c2f", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Susceptibility-Guided Landslide Detection Using Fully Convolutional Neural Network", "abstract": "Automatic landslide detection based on very high spatial resolution remote sensing images is crucial for disaster prevention and mitigation applications. With the rapid development of deep-learning techniques, state-of-the-art semantic segmentation methods based on fully convolutional network (FCNN) have achieved outstanding performance in the landslide detection task. However, most of the existing articles only utilize visual features. Even if the advanced FCNN models are applied, there is still a certain amount of falsely detected and miss detected landslides. In this article, we innovatively introduce landslide susceptibility as prior knowledge and propose an innovative susceptibility-guided landslide detection method based on FCNN (SG-FCNN) to detect landslides from single temporal images. In addition, an unsupervised change detection method based on the mean changing magnitude of objects (MCMO) is further proposed and integrated with the SG-FCNN to detect newly occurred landslides from bitemporal images. The effectiveness of the proposed SG-FCNN and MCMO has been tested in Lantau Island, Hong Kong. The experimental results show that the SG-FCNN can significantly reduce the amount of falsely detected and miss detected landslides compared with the FCNN. It can conclude that applying landslide susceptibility as prior knowledge is much more effective than using visual features only, which introduces a new methodology of landslide detection and lifts the detection performance to a new level.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "998-1018", "volume": "16"}, "authors": [{"authorId": "2004772264", "name": "Yangyang Chen"}, {"authorId": "2925196", "name": "D. Ming"}, {"authorId": "47891239", "name": "Junchuan Yu"}, {"authorId": "2158352297", "name": "Lu Xu"}, {"authorId": "2027165530", "name": "Yanni Ma"}, {"authorId": "2152888314", "name": "Yan Li"}, {"authorId": "145194610", "name": "Xiao Ling"}, {"authorId": "2109528958", "name": "Yueqin Zhu"}], "citations": [{"paperId": "5700387130603d1986677fa32992608e1ec1fad3", "title": "A feature enhancement framework for landslide detection"}, {"paperId": "44d742d9de35b39378c0645c3569e50121ae370e", "title": "BisDeNet: A New Lightweight Deep Learning-Based Framework for Efficient Landslide Detection"}, {"paperId": "5a5e0b213b5697adab7dc3f27f16f319dc24611d", "title": "LS-YOLO: A Novel Model for Detecting Multiscale Landslides With Remote Sensing Images"}]}
