{"paperId": "38e2f703e106cd9a5d7cb59382caf6e40a1a21a9", "publicationVenue": {"id": "87884a6c-bedc-4aa9-bf6d-f9a8f937438d", "name": "International Symposium on Memory Systems", "type": "conference", "alternate_names": ["MEMSYS", "Int Symp Mem Syst"]}, "title": "DRAM errors in the field: a statistical approach", "abstract": "This paper summarizes our two-year study of corrected and uncor-rected errors on the MareNostrum 3 supercomputer, covering 2000 billion MB-hours of DRAM in the field. The study analyzes 4.5 million corrected and 71 uncorrected DRAM errors and it compares the reliability of DIMMs from all three major memory manufacturers, built in three different technologies. Our work has two sets of contributions. First, we illustrate the complexity of in-field DRAM error analysis and demonstrate the limitations of various widely-used methods and metrics. For example, we show that average error rates, errors per MB-hour and mean time between failures can provide volatile and unreliable results even after long periods of error logging, leading to incorrect conclusions about DRAM reliability. Second, we present formal statistical methods that overcome many of the limitations of the current approaches. The methods that we present are simple to understand and implement, reliable and widely accepted in the statistical community. Overall, our study alerts the community about the need to, firstly, question the current practice in quantifying DRAM reliability and, secondly, to select a proper analysis approach for future studies. Our strong recommendations are to focus on metrics with a practical value that could be easily related to system reliability, and to select methods that provide stable results, ideally supported with statistical significance.", "venue": "International Symposium on Memory Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-09-30", "journal": {"name": "Proceedings of the International Symposium on Memory Systems"}, "authors": [{"authorId": "30444125", "name": "D. Zivanovic"}, {"authorId": "1404334523", "name": "Pouya Esmaili-Dokht"}, {"authorId": "1404267033", "name": "Sergi Moré"}, {"authorId": "122694214", "name": "Javier Bartolome"}, {"authorId": "145785651", "name": "P. Carpenter"}, {"authorId": "3135771", "name": "Petar Radojkovic"}, {"authorId": "1744495", "name": "E. Ayguadé"}], "citations": [{"paperId": "3e113819403334441ef5f244495de2b0249fb393", "title": "QRAM: A Survey and Critique"}, {"paperId": "b8689d470c3716a7f7916daef58747db04fa9ff8", "title": "HPC Forecast"}, {"paperId": "d6e7b64846653fcbfc6419f99418f4263576cd79", "title": "From Correctable Memory Errors to Uncorrectable Memory Errors: What Error Bits Tell"}, {"paperId": "0bb3ac3a6fb8c0665c6d4b941f81be0251f00001", "title": "Predicting DRAM-Caused Node Unavailability in Hyper-Scale Clouds"}, {"paperId": "461c3dcef446276da0433c1c9101b1000f63a5c2", "title": "Reinventing High Performance Computing: Challenges and Opportunities"}, {"paperId": "79aa5f37b37555f0365437e27efffc5fc9e41e4c", "title": "Predicting Uncorrectable Memory Errors from the Correctable Error History: No Free Predictors in the Field"}, {"paperId": "7e081fb4564716bd07e14714ccaee1f636c5e549", "title": "Systemic Assessment of Node Failures in HPC Production Platforms"}, {"paperId": "b013f8d7c273b589a8c55df2e3e635168dac212d", "title": "Cost-Aware Prediction of Uncorrected DRAM Errors in the Field"}, {"paperId": "f1c016704f6495e49dd29a6cd4510e93e34a9fd4", "title": "HPC Forecast: Cloudy and Uncertain"}, {"paperId": "4bc0c12de04af0e55d43ea51b27c8569227772c4", "title": "Quantifying Soft-Error Resilience of Embedded RISC-V Systems with Capability-based Memory Protection"}]}
