{"paperId": "38f3b2148daa6f28966a8e5428e2917d667fe744", "publicationVenue": {"id": "8f5e0848-3fd6-4129-ab41-393d4529fd7c", "name": "KSII Transactions on Internet and Information Systems", "type": "journal", "alternate_names": ["Ksii Trans Internet Inf Syst", "Ksii Transactions on Internet and Information Systems", "KSII Trans Internet Inf Syst"], "issn": "1976-7277", "url": "http://www.ksii.or.kr/", "alternate_urls": ["http://www.itiis.org/"]}, "title": "Optimization Driven MapReduce Framework for Indexing and Retrieval of Big Data", "abstract": "With the technical advances, the amount of big data is increasing day-by-day such that the traditional software tools face a burden in handling them. Additionally, the presence of the imbalance data in big data is a massive concern to the research industry. In order to assure the effective management of big data and to deal with the imbalanced data, this paper proposes a new indexing algorithm for retrieving big data in the MapReduce framework. In mappers, the data clustering is done based on the Sparse Fuzzy-c-means (Sparse FCM) algorithm. The reducer combines the clusters generated by the mapper and again performs data clustering with the Sparse FCM algorithm. The two-level query matching is performed for determining the requested data. The first level query matching is performed for determining the cluster, and the second level query matching is done for accessing the requested data. The ranking of data is performed using the proposed Monarch chaotic whale optimization algorithm (M-CWOA), which is designed by combining Monarch butterfly optimization (MBO) [22] and chaotic whale optimization algorithm (CWOA) [21]. Here, the Parametric Enabled-Similarity Measure (PESM) is adapted for matching the similarities between two datasets. The proposed M-CWOA outperformed other methods with maximal precision of 0.9237, recall of 0.9371, F1-score of 0.9223, respectively.", "venue": "KSII Transactions on Internet and Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-31", "journal": {"name": "KSII Trans. Internet Inf. Syst.", "pages": "1886-1908", "volume": "14"}, "authors": [{"authorId": "3428305", "name": "H. B. Abdalla"}, {"authorId": "123782831", "name": "Awder M. Ahmed"}, {"authorId": "2273296090", "name": "M. A. A. Sibahee"}], "citations": [{"paperId": "10465a72081c883d4271fcc953d938b71a819fd3", "title": "Indexation techniques in decision support systems: Study and Evaluation"}, {"paperId": "8e223675ecbd3dc9f34bb928d84d313e83c609f3", "title": "Deep Maxout Network-based Feature Fusion and Political Tangent Search Optimizer enabled Transfer Learning for Thalassemia Detection"}, {"paperId": "9409c3a064b5807f6ac6d157bf749203ec8e4840", "title": "Secure identity key and blockchain‐based authentication approach for secure data communication in multi‐WSN"}, {"paperId": "c5605f118fbab08c484a044497a1ec030cc54281", "title": "Hybrid optimization using lion and dragonfly for enhanced resource allocation in fifth-generation networks"}, {"paperId": "cbb2fee78d7f2638d03764f780eccf0f351fc14e", "title": "Internet of things based smart application for rice leaf disease classification using optimization integrated deep maxout network"}, {"paperId": "0f8fa0444541ae768dd0f1a9a46997e80dc9a101", "title": "Aquila optimized feedback artificial tree for detection of fake news and impact identification"}, {"paperId": "1813f17feb1be989289df471f8e978d985227a59", "title": "Exponential Sailfish Optimizer-based generative adversarial network for image annotation on natural scene images."}, {"paperId": "0a18fc1e4361d25e54e0260795b3954dfd9e1a76", "title": "Virtual Machine Migration-Based Intrusion Detection System in Cloud Environment Using Deep Recurrent Neural Network"}, {"paperId": "7963195725cc4f58e3bb9f1945c775c96260b27a", "title": "Comparative Analysis of Chinese Culture and Hong Kong, Macao, and Taiwan Culture in the Field of Public Health Based on the CNN Model"}, {"paperId": "f304db68f15088aec429b08bcc8811f7f11c96b7", "title": "Rider weed deep residual network-based incremental model for text classification using multidimensional features and MapReduce"}, {"paperId": "e4f1169ee452bcc374c74cda8572e7d3fc9021b2", "title": "Hybrid optimization approach for optimal switching loss reduction in three-phase VSI"}, {"paperId": "870547760d4d9197c9e68ceedd90b3cb8cc6ddc4", "title": "Optimized deep learning for genre classification via improved moth flame algorithm"}, {"paperId": "0ed1f18db1846daa3093304d333962bf9d80b244", "title": "Elliptic Curve Cryptography Based Authentication Protocol Enabled with Optimized Neural Network Based DoS Mitigation"}, {"paperId": "fdffb8128780f4f934b7d1bebebdee0010360787", "title": "Compound Facial Expression Recognition and Pain Intensity Measurement Using Optimized Deep Neuro Fuzzy Network"}, {"paperId": "af4c6d926eaf235df2f5a48ce51336d318ae28f4", "title": "Optimization-Assisting Dual-Step Clustering of Time Series Data"}, {"paperId": "fb1130001b73923cb0fc5e11c6f5943928faa868", "title": "Rider and Sunflower optimization-driven neural network for image classification"}, {"paperId": "0c964c435220b71fb245344d6729af19a55c1bfa", "title": "Big Data: Finding Frequencies of Faulty Multimedia Data"}, {"paperId": "4fbe6d4f53f2a2b61d6618da768b1d017cc746e6", "title": "Quality of Service Estimation Enabled With Trust-Based Resource Allocation in Collaborative Cloud Using Improved Grey Wolf Optimization"}, {"paperId": "ad6cd38391afd0df4b5d8a1031d6b629817383e0", "title": "Rider Weed Deep Residual Network-Based Incremental Model for Text Classification Using Multidimensional Features and MapReduce Framework"}, {"paperId": "253cb889d2e040f475ebc88e074d2784583244ea", "title": "Multilevel authentication protocol for enabling secure communication in Internet of Things"}, {"paperId": "7000cbbed2741b4361e97b40c6b72eacb57bbd43", "title": "Optimized deep learning‐based attack detection framework for secure virtualized infrastructures in cloud"}, {"paperId": "ca9367a613ea5e2354a7364da2a32fca542e67ea", "title": "Weighted holoentropy-based features with optimised deep belief network for automatic sentiment analysis: reviewing product tweets"}, {"paperId": "b616b53c54084f7e98365d9dd1bd441b6bab4ef2", "title": "Energy conserving ring cluster‐based routing protocol for wireless sensor network: A hybrid based model"}, {"paperId": "d70319cbee8863becdc3ad0fa741c6f89eea3d64", "title": "Exponential-Ant Cuckoo Search Optimization for image deblurring with spinal cord images based on kernel estimation"}, {"paperId": "cf8db1ba6413df0fe0be69e48ce70a45f5b26165", "title": "Deep Convolutional Neural Network for musical genre classification via new Self Adaptive Sea Lion Optimization"}, {"paperId": "7723a969ecb65802013fef77f3e8bd58445f1905", "title": "A Noise-Tolerant Audio Encryption Framework Designed by the Application of S8 Symmetric Group and Chaotic Systems"}, {"paperId": "f181f1b78af2056bfb377925bed2b2f8a32c930e", "title": "The Role of Emotions Intensity in Helpfulness of Online Physician Reviews"}, {"paperId": "9120de1a3e3867b87e7c77646ea7faf58a46964c", "title": "Improving Mapreduce Speculative Executions with Global Snapshots"}, {"paperId": "565c50fc1922c231f50861c8377028999723bb21", "title": "QoS and QoE aware multi objective resource allocation algorithm for cloud gaming"}]}
