{"paperId": "39016ff17f65d41c4c368c5bad70a67b0ff6ea6a", "publicationVenue": null, "title": "ClickTree: A Tree-based Method for Predicting Math Students' Performance Based on Clickstream Data", "abstract": "The prediction of student performance and the analysis of students' learning behavior play an important role in enhancing online courses. By analysing a massive amount of clickstream data that captures student behavior, educators can gain valuable insights into the factors that influence academic outcomes and identify areas of improvement in courses. In this study, we developed ClickTree, a tree-based methodology, to predict student performance in mathematical assignments based on students' clickstream data. We extracted a set of features, including problem-level, assignment-level and student-level features, from the extensive clickstream data and trained a CatBoost tree to predict whether a student successfully answers a problem in an assignment. The developed method achieved an AUC of 0.78844 in the Educational Data Mining Cup 2023 and ranked second in the competition. Furthermore, our results indicate that students encounter more difficulties in the problem types that they must select a subset of answers from a given set as well as problem subjects of Algebra II. Additionally, students who performed well in answering end-unit assignment problems engaged more with in-unit assignments and answered more problems correctly, while those who struggled had higher tutoring request rate. The proposed method can be utilized to improve students' learning experiences, and the above insights can be integrated into mathematical courses to enhance students' learning outcomes.", "venue": "", "year": 2024, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": null, "publicationDate": "2024-03-01", "journal": null, "authors": [{"authorId": "1481861297", "name": "Narjes Rohani"}, {"authorId": "2293170008", "name": "Behnam Rohani"}, {"authorId": "2386614", "name": "A. Manataki"}], "citations": []}
