{"paperId": "3907fbbee04730cfb892ae3e1ec8dda5bbc65411", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Overlay Indexes: Efficiently Supporting Aggregate Range Queries and Authenticated Data Structures in Off-the-Shelf Databases", "abstract": "Commercial off-the-shelf DataBase Management Systems (DBMSes) are highly optimized to process a wide range of queries by means of carefully designed indexing and query planning. However, many aggregate range queries are usually performed by DBMSes using sequential scans, and certain needs, like storing Authenticated Data Structures (ADS), are not supported at all. Theoretically, these needs could be efficiently fulfilled adopting specific kinds of indexing, which however are normally ruled-out in DBMSes design. We introduce the concept of overlay index: an index that is meant to be stored in a standard database, alongside regular data and managed by regular software, to complement DBMS capabilities. We show a data structure, that we call DB-tree, that realizes an overlay index to support a wide range of custom aggregate range queries as well as ADSes, efficiently. All DB-trees operations can be performed by executing a small number of queries to the DBMS, that can be issued in parallel in one or two query rounds, and involves a logarithmic amount of data. We experimentally evaluate the efficiency of DB-trees showing that our approach is effective, especially if data updates are limited.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-25", "journal": {"name": "IEEE Access", "pages": "175642-175670", "volume": "7"}, "authors": [{"authorId": "94580478", "name": "Diego Pennino"}, {"authorId": "1721655", "name": "M. Pizzonia"}, {"authorId": "2142498660", "name": "Alessio Papi"}], "citations": [{"paperId": "985175110c1dc7930b835a13768da2241a43bd55", "title": "Decentralized Digital Currency System using Merkle Hash Trees"}, {"paperId": "38ce64e31a54ecc17a3f9690cca2d685a5718861", "title": "Blockchain as IoT Economy Enabler: A Review of Architectural Aspects"}, {"paperId": "4d3435528658805f126ca2e25b893c1115caf6e9", "title": "Scaling blockchains without giving up decentralization and security: a solution to the blockchain scalability trilemma"}, {"paperId": "2d96807644cd53b058ffbdef5cee8d042709fc54", "title": "Efficient Certification of Endpoint Control on Blockchain"}, {"paperId": "bbbd70b8457dc54935cb8d55f96857b73c00e0ca", "title": "USBCaptchaIn: Preventing (Un)Conventional Attacks from Promiscuously Used USB Devices in Industrial Control Systems"}]}
