{"paperId": "390fabc008253a8b97fd7a3e4469630dd38527a8", "publicationVenue": null, "title": "Measuring the Similarity of Metro Stations Based on the Passenger Visit Distribution", "abstract": "The distribution of passengers reflects the characteristics of urban rail stations. The automatic fare collection system of rail transit collects a large amount of passenger trajectory data tracking the entry and exit continuously, which provides a basis for detailed passenger distributions. We first exploit the Automatic Fare Collection (AFC) data to construct the passenger visit pattern distribution for stations. Then we measure the similarity of all stations using Wasserstein distance. Different from other similarity metrics, Wasserstein distance takes the similarity between values of quantitative variables in the one-dimensional distribution into consideration and can reflect the correlation between different dimensions of high-dimensional data. Even though the computational complexity grows, it is applicable in the metro stations since the scale of urban rail transit stations is limited to tens to hundreds and detailed modeling of the stations can be performed offline. Therefore, this paper proposes an integrated method that can cluster multi-dimensional joint distribution considering similarity and correlation. Then this method is applied to cluster the rail transit stations by the passenger visit distribution, which provides some valuable insight into the flow management and the station replanning of urban rail transit in the future.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-30", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "18", "volume": "11"}, "authors": [{"authorId": "1591104193", "name": "Kanglin Zhu"}, {"authorId": "5727606", "name": "Haodong Yin"}, {"authorId": "2244893", "name": "Yunchao Qu"}, {"authorId": "49387901", "name": "Jianjun Wu"}], "citations": [{"paperId": "bf08bc204646fb7d1ebd678dbcacc713bac27229", "title": "Metro Station functional clustering and dual-view recurrent graph convolutional network for metro passenger flow prediction"}, {"paperId": "0cfd2b1aa526aa5a2c8f43327659072e397edb22", "title": "Data-driven complexity analysis of weighted Shenzhen Metro network based on urban massive mobility in the rush hours"}, {"paperId": "a4f4339f15dc4f9043b7c79e6be0881532b89427", "title": "Spatiotemporal Evolution of Travel Pattern Using Smart Card Data"}]}
