{"paperId": "3917dfcdac47e72696068e97c21522ab08068731", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Single Data Extraction Algorithm for Oblique Photographic Data Based on the U-Net", "abstract": "In the automated modeling generated by oblique photography, various terrains cannot be physically distinguished individually within the triangulated irregular network (TIN). To utilize the data representing individual features, such as a single building, a process of building monomer construction is required to identify and extract these distinct parts. This approach aids subsequent analyses by focusing on specific entities, mitigating interference from complex scenes. A deep convolutional neural network is constructed, combining U-Net and ResNeXt architectures. The network takes as input both digital orthophoto map (DOM) and oblique photography data, effectively extracting the polygonal footprints of buildings. Extraction accuracy among different algorithms is compared, with results indicating that the ResNeXt-based network achieves the highest intersection over union (IOU) for building segmentation, reaching 0.8255. The proposed “dynamic virtual monomer” technique binds the extracted vector footprints dynamically to the original oblique photography surface through rendering. This enables the selective representation and querying of individual buildings. Empirical evidence demonstrates the effectiveness of this technique in interactive queries and spatial analysis. The high level of automation and excellent accuracy of this method can further advance the application of oblique photography data in 3D urban modeling and geographic information system (GIS) analysis.", "venue": "Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-11", "journal": {"name": "Remote. Sens.", "pages": "979", "volume": "16"}, "authors": [{"authorId": "2290959400", "name": "Shaohua Wang"}, {"authorId": "2265220822", "name": "Xiao Li"}, {"authorId": "2291411623", "name": "Liming Lin"}, {"authorId": "2276191805", "name": "Hao Lu"}, {"authorId": "2291986113", "name": "Ying Jiang"}, {"authorId": "2291015958", "name": "Ning Zhang"}, {"authorId": "2290968769", "name": "Wenda Wang"}, {"authorId": "2276118627", "name": "Jianwei Yue"}, {"authorId": "2265484412", "name": "Ziqiong Li"}], "citations": []}
