{"paperId": "3922a2992b44dc9553bcaa94fe3af82d0a191b05", "publicationVenue": {"id": "850fc070-bb53-4d7e-87ef-5e94e6f107de", "name": "ACS Applied Materials and Interfaces", "type": "journal", "alternate_names": ["AC Appl Mater Interface", "AC Appl Mater  Interface", "ACS Applied Materials & Interfaces"], "issn": "1944-8244", "url": "https://pubs.acs.org/journal/aamick", "alternate_urls": ["http://pubs.acs.org/journal/aamick", "https://pubs.acs.org/loi/aamick"]}, "title": "Smart Printed Triboelectric Wearable Sensor with High Performance for Glove-Based Motion Detection.", "abstract": "In a world increasingly driven by data, wearable triboelectric nanogenerators (TENGs) offer a convenient way to monitor and collect information about human body motions. To meet the demands of the large-scale production of wearable TENGs, material selection to realize a high conversion efficiency and simplify the fabrication process remains a challenge. To address these issues, we present a simple-structured wearable printed arc-shaped triboelectric sensor (PATS) for finger motion detection by leveraging inkjet printing technology. In this regard, pressure sensors composed of diverse materials based on dielectric-dielectric and metal-dielectric structures in contact-separation mode were fabricated and compared. Thanks to the unique characteristics of the silver nanoparticle (Ag-NP)-printed layer and silicon rubber (SR), the SR-Ag PATS shows a high peak-to-peak voltage of 14.15 V and a short-circuit current of 0.78 μA. The proposed sensor with the capability of accurately identifying finger motions at various bending angles suggests promising application potential in glove-based human-machine interface (HMI) systems.", "venue": "ACS Applied Materials and Interfaces", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-12", "journal": {"name": "ACS applied materials & interfaces"}, "authors": [{"authorId": "93411622", "name": "Parinaz Seifaddini"}, {"authorId": "2283917681", "name": "Sina Sheikhahmadi"}, {"authorId": "2254600104", "name": "Mohammadreza Kolahdouz"}, {"authorId": "2084843620", "name": "Hossein Aghababa"}], "citations": []}
