{"paperId": "39289d85fbd39d2add8aee8e8303087e46938b90", "publicationVenue": {"id": "52ee8f70-41d7-4479-a480-646299aafc28", "name": "Frontiers in Ecology and Evolution", "type": "journal", "alternate_names": ["Front Ecol Evol"], "issn": "2296-701X", "url": "http://www.frontiersin.org/Behavioral_and_Evolutionary_Ecology", "alternate_urls": ["http://www.frontiersin.org/ecology_and_evolution", "http://www.frontiersin.org/Ecology_and_Evolution/archive", "https://www.frontiersin.org/journals/ecology-and-evolution"]}, "title": "Coordinated development of regional resources, environment, and economic growth under the background of low-carbon economy", "abstract": "Introduction At present, the rapid growth of social and economic development has also brought great challenges to the development of regional resources and environment. With the deepening of the concept of sustainable development, the coordinated development of regional resources, environment and economic growth has attracted more and more attention. The coordinated development of resources, environment and economic growth is not only the engine of industrial growth, but also the accelerator to promote industrial transfer and optimal allocation of resources, which has injected a strong impetus into social development. However, with the continuous upgrading of the industrial structure, environmental pollution, unbalanced economic development, resource shortage and other problems have gradually emerged in various important development areas. Methods In order to effectively solve this dilemma, this paper takes the Beijing-Tianjin-Hebei region (BTH) as an example, based on the analysis of the current situation of the economic and environmental development of BTH region and the influencing factors, combined with the background of low-carbon economy (LCE), effectively studies the coordinated development of its resources, environment and economic growth. In order to verify the effectiveness of low-carbon economic development, this paper, based on the actual development data of BTH region, tests the three dimensions of economic benefit index, environmental benefit index and emission reduction efficiency index. Results The results show that the average environmental benefit index of 13 cities in the BTH region after the implementation of the target is about 0.457. The average benefit index before the implementation of the target was about 0.449. Discussion From the final results of the test, it can be seen that the development of low-carbon economy has strong feasibility for promoting the coordinated development of regional resources, environment and economic growth.", "venue": "Frontiers in Ecology and Evolution", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-10", "journal": {"volume": "11"}, "authors": [{"authorId": "2274573012", "name": "Ziwen Wang"}], "citations": [{"paperId": "95be3d86f452d38cbe84958d3be3328fd0cc902f", "title": "Study on the coordinated development of urban competitiveness and energy-carbon emission reduction in China"}, {"paperId": "da6fb135ba275d92c40b23502a6b9585ab7a4baf", "title": "The multi-stage evaluation framework for low-carbon development level of rail transit under probabilistic linguistic environment"}]}
