{"paperId": "39391ab293e3d557b3ac4fb85c010a54d9d475fc", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Automatic Extraction of Seismic Landslides in Large Areas with Complex Environments Based on Deep Learning: An Example of the 2018 Iburi Earthquake, Japan", "abstract": "After a major earthquake, the rapid identification and mapping of co-seismic landslides in the whole affected area is of great significance for emergency rescue and loss assessment of seismic hazards. In recent years, researchers have achieved good results in research on a small scale and single environment characteristics of this issue. However, for the whole earthquake-affected area with large scale and complex environments, the correct rate of extracting co-seismic landslides remains low, and there is no ideal method to solve this problem. In this paper, Planet Satellite images with a spatial resolution of 3 m are used to train a seismic landslide recognition model based on the deep learning method to carry out rapid and automatic extraction of landslides triggered by the 2018 Iburi earthquake, Japan. The study area is about 671.87 km2, of which 60% is used to train the model, and the remaining 40% is used to verify the accuracy of the model. The results show that most of the co-seismic landslides can be identified by this method. In this experiment, the verification precision of the model is 0.7965 and the F1 score is 0.8288. This method can intelligently identify and map landslides triggered by earthquakes from Planet images. It has strong practicability and high accuracy. It can provide assistance for earthquake emergency rescue and rapid disaster assessment.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science", "Geology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-06", "journal": {"name": "Remote. Sens.", "pages": "3992", "volume": "12"}, "authors": [{"authorId": "2110149938", "name": "Pengfei Zhang"}, {"authorId": "145890137", "name": "Chong Xu"}, {"authorId": "151482352", "name": "Si-yuan Ma"}, {"authorId": "1855471576", "name": "Xiaoyi Shao"}, {"authorId": "2143725968", "name": "Yingying Tian"}, {"authorId": "2104332045", "name": "Boyu Wen"}], "citations": [{"paperId": "35a63d1370f7c1645899c095f03c18076e67e4a4", "title": "The landslide traces inventory in the transition zone between the Qinghai-Tibet Plateau and the Loess Plateau: a case study of Jianzha County, China"}, {"paperId": "b3cf8441d350b479ba53e44ef651ff0c9ea96e9e", "title": "Active Deformation Areas of Potential Landslide Mapping with a Generalized Convolutional Neural Network"}, {"paperId": "76ce154d58e458153c5fa83af89086d590d03207", "title": "Inventory of Landslides in the Northern Half of the Taihang Mountain Range, China"}, {"paperId": "e27f2dad09ecbaf0bad68c61115fb899ef6b2bac", "title": "Regional landslide mapping model developed by a deep transfer learning framework using post-event optical imagery"}, {"paperId": "e2d6c2b62e4ef5a19b002d95128f6a792b0777a9", "title": "Analysis of the Controlling Effect of Excess Topography on the Distribution of Coseismic Landslides during the Iburi Earthquake, Japan, on 6 September 2018"}, {"paperId": "c1f958a13deda17b5dfe777af797d34a85338fe3", "title": "Mask R-CNN-Based Landslide Hazard Identification for 22.6 Extreme Rainfall Induced Landslides in the Beijiang River Basin, China"}, {"paperId": "48496da21b3486e532a666f9869284d75773d7bc", "title": "Automatic landslide identification by Dual Graph Convolutional Network and GoogLeNet model-a case study for Xinjiang province, China"}, {"paperId": "75df2a46057c57372002835fc7c2f4d6abf9dc35", "title": "Rapid Emergency Response Assessment of Earthquake-Induced Landslides Driven by Fusion of InSAR Deformation Data and Newmark Physical Models"}, {"paperId": "ace19b822978c7d90a266a0032aa95a8a0d436a6", "title": "Deep Learning for Earthquake Disaster Assessment: Objects, Data, Models, Stages, Challenges, and Opportunities"}, {"paperId": "3aafe1f25453c5257ebfef757b5a1c53b18aeeca", "title": "Tempo-Spatial Landslide Susceptibility Assessment from the Perspective of Human Engineering Activity"}, {"paperId": "ed55b30000c40e014daef09b7cd5cd8dd6a5e9ed", "title": "A review of recent earthquake-induced landslides on the Tibetan Plateau"}, {"paperId": "eb35898f02726e0a9de5f15facce0a4613b7a6e6", "title": "FRACTURE-FAULTDETECTIONUSING DEEP LEARNING WITH STEPWISE ELIMINATION FROM SATELLITE IMAGES IN DJIBOUTI"}, {"paperId": "56b97b57a4210e12bf96f6696f36cfc03036bf83", "title": "A landslide extraction method of channel attention mechanism U-Net network based on Sentinel-2A remote sensing images"}, {"paperId": "88a0ec7c7152983e5bf0e6a8832263a41a7e6d7c", "title": "Deep Learning in the Mapping of Agricultural Land Use Using Sentinel-2 Satellite Data"}, {"paperId": "0cfe47d2b4697eabd2435a3c063a63ba51fdcecd", "title": "DUPnet: Water Body Segmentation with Dense Block and Multi-Scale Spatial Pyramid Pooling for Remote Sensing Images"}, {"paperId": "95eb38396ab257159f3f9979a03bcd31fe0dc994", "title": "Automatic Remote Sensing Identification of Co-Seismic Landslides Using Deep Learning Methods"}, {"paperId": "9e01b3ee5706811fb2f1b1267e70f063847da6e0", "title": "Large-scale landslides around the reservoir area of Baihetan hydropower station: Analysis of the spatial distribution"}, {"paperId": "3fde9d6d7df1f765fc44a8e68251b640982349c6", "title": "Efficient Detection of Earthquake-Triggered Landslides Based on U-Net++: An Example of the 2018 Hokkaido Eastern Iburi (Japan) Mw = 6.6 Earthquake"}, {"paperId": "5d52846a61235ca13549a751589087910bc64869", "title": "Large-scale landslide inventory and their mobility in Lvliang City, Shanxi Province, China"}, {"paperId": "dadcf77e5e43391fc2204bc8ab04c436aa871701", "title": "Early landslide mapping with slope units division and multi-scale object-based image analysis — A case study in the Xianshui River basin of Sichuan, China"}, {"paperId": "fe2b6d934f761f010ba4abc8814c0234a270f2de", "title": "L-Unet: A Landslide Extraction Model Using Multi-Scale Feature Fusion and Attention Mechanism"}, {"paperId": "d2870e4e60e426a1dfe6b20de36340200e80e845", "title": "Measurement Method of Plant Phenotypic Parameters Based on Image Deep Learning"}, {"paperId": "14dc260734ff031b3e2b88e1c653f48efdc1838f", "title": "DRs-UNet: A Deep Semantic Segmentation Network for the Recognition of Active Landslides from InSAR Imagery in the Three Rivers Region of the Qinghai-Tibet Plateau"}, {"paperId": "84c9b40e6a5f7ed566989975e29f0338e57da8c7", "title": "Bibliometric analysis of landslide research based on the WOS database"}, {"paperId": "b2a2acb0f1a5e0cd5389f4a6d675765a430de227", "title": "Multi-modal Landslide Monitoring Data Fusion Algorithm Based on Resistivity Imaging"}, {"paperId": "cb7ebb5f17446b373af873ecb9da7c2dd6a66010", "title": "Detection of excavated areas in high-resolution remote sensing imagery using combined hierarchical spatial pyramid pooling and VGGNet"}, {"paperId": "64f60182f953d3b34b7e98868bae88c4b1cf045d", "title": "An Updated Database and Spatial Distribution of Landslides Triggered by the Milin, Tibet Mw6.4 Earthquake of 18 November 2017"}, {"paperId": "8c476839e766f2c7226c8afb301347a6f7b79d54", "title": "Development and distribution of ancient landslides in the northwest corner of the Tibetan Plateau"}, {"paperId": "efe636e44e591c4ade409709171e70593c60e60f", "title": "Spatial distribution and influence factors of landslides triggered by the 2019 Ms 6.0 Changning, Sichuan, China Ms6.0 earthquake: A statistical analysis based on QGIS"}, {"paperId": "6e0bd5a3e1c76f1fb42475ab85e076ab35a1b6bc", "title": "Landslide Inventory Mapping Based on Independent Component Analysis and UNet3+: A Case of Jiuzhaigou, China"}, {"paperId": "810093545f2a4f1a70c8a84a2a9bca8ac1aedf2f", "title": "Reg-SA–UNet++: A Lightweight Landslide Detection Network Based on Single-Temporal Images Captured Postlandslide"}, {"paperId": "98738318312d444486e293a6915d4428d8fc835c", "title": "Earthquake-Triggered Landslides"}]}
