{"paperId": "3943dc97692bb4aca40cdf69fd3167a7c8fdc16c", "publicationVenue": {"id": "8c36c300-10f5-4008-ae53-6371fcc3030d", "name": "International Conferences on Information Science and System", "type": "conference", "alternate_names": ["ICISS", "International Conference on Information Systems Security", "Int Conf Inf Syst Secur", "Int Conf Intell Sustain Syst", "International Conference Intelligent Sustainable Systems", "Int Conf Inf Sci Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1400"}, "title": "Improving Data Security, Interoperability, and Veracity using Blockchain for One Data Governance, Case Study of Local Tax Big Data", "abstract": "Presidential Decree on One Data Indonesia is intended to govern data produced by central agencies and local agencies to support planning, implementation, evaluation, and development control, including one of them is the local tax. It is a Big Data development contains a lot of data from the central and local government of Indonesia. The defining factors of data collection on Big Data are volume, velocity, variety, and veracity. Volume and velocity state how much and how soon the data is generated. Variety states the condition of the data is structured or not, while veracity speaks the level of trust in data validity. Data veracity is a big problem on Big Data Analytics and using data integrity protection feature and other methods, Blockchain can offer solutions to improve data interoperability, security, and veracity.", "venue": "International Conferences on Information Science and System", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 International Conference on ICT for Smart Society (ICISS)", "pages": "1-6", "volume": "7"}, "authors": [{"authorId": "35295706", "name": "S. Wibowo"}, {"authorId": "1491176242", "name": "Tesar Sandikapura"}], "citations": [{"paperId": "4e241db1f4551c25d961ce80edd9e20cb3e715a3", "title": "Big data security & individual (psychological) resilience: A review of social media risks and lessons learned from Indonesia"}, {"paperId": "a3da0cb595bc43352f9991b1e08b36f81868114f", "title": "Big Data and Security: A Review of Social Media Risks and Insights for Indonesia"}, {"paperId": "abdde40a744c96d30135d55e292f100f6c6aa54c", "title": "Future Internet Architectures on an Emerging Scale - A Systematic Review"}, {"paperId": "51bda7b60a1ee769960983975488a37ba9203ff7", "title": "The Integrated Information System Implementation Strategy in Korlantas Polri Based on the Zachman Framework Approach"}, {"paperId": "071de7472b63d03dacb51eb239ca1e2f219584e2", "title": "Unlocking Metaverse-as-a-Service The three pillars to watch: Privacy and Security, Edge Computing, and Blockchain"}, {"paperId": "dc025e3e0e1edb62d6eeb1a36c2feeeaab8c2f02", "title": "Blockchain for the Metaverse: A Review"}, {"paperId": "f7c6df63632354a9c425de95efcd49293f5c271e", "title": "REJUVENATING THE GROUNDWATER TAX STRATEGY IN GARUT REGENCY"}, {"paperId": "b565d031dd2e0ed3eab3a6fb8d508cb1f6b40b28", "title": "Methods for Assessing, Predicting, and Improving Data Veracity: A survey"}, {"paperId": "5fe94e8a410337092b4f490fbc3f1bfcae9cb7c5", "title": "Blockchain Technology Application for Value-Added Tax Systems"}, {"paperId": "68ff237296771370a59ba290ee08ad6ca60e6fd4", "title": "Literature Review of Open Government Data"}, {"paperId": "6d7a95c84ebaf4495e729cb728a29b6aef479ea0", "title": "The Blockchain Technology in Transfer Pricing – Artificial Intelligence and Further Synergies"}, {"paperId": "f07588cf7f9e3027226b7448d7c960b3c2396148", "title": "Hybrid security analysis based on intelligent adaptive learning in Big Data"}, {"paperId": "db4a90879cab7729916df4c1e6fd7ec3b9d73c8f", "title": "Challenges to Implementing Effective Data Governance: A Literature Review"}, {"paperId": "cd5beac8ddbd6adae60798a69a5c4ba356ce0af8", "title": "What Do We Really Need? A Systematic Literature Review of the Requirements for Blockchain-based E-government Services"}]}
