{"paperId": "394a3b11dbee1d5ce04e2f3e7f6cdd4ef81e38b1", "publicationVenue": {"id": "021b37d3-cef1-4c12-a442-257f7900c23d", "name": "Design Automation Conference", "type": "conference", "alternate_names": ["Des Autom Conf", "DAC"], "url": "http://www.dac.com/"}, "title": "Skew-Oblivious Data Routing for Data Intensive Applications on FPGAs with HLS", "abstract": "FPGAs have become emerging computing infrastructures for accelerating applications in datacenters. Meanwhile, high-level synthesis (HLS) tools have been proposed to ease the programming of FPGAs. Even with HLS, irregular data-intensive applications require explicit optimizations, among which multiple processing elements (PEs) with each owning a private BRAM-based buffer are usually adopted to process multiple data per cycle. Data routing, which dynamically dispatches multiple data to designated PEs, avoids data replication in buffers compared to statically assigning data to PEs, hence saving BRAM usage. However, the workload imbalance among PEs vastly diminishes performance when processing skew datasets. In this paper, we propose a skew-oblivious data routing architecture that allocates secondary PEs and schedules them to share the workload of the overloaded PEs at run-time. In addition, we integrate the proposed architecture into a framework called Ditto to minimize the development efforts for applications that require skew handling. We evaluate Ditto on five commonly used applications: histogram building, data partitioning, pagerank, heavy hitter detection and hyperloglog. The results demonstrate that the generated implementations are robust to skew datasets and outperform the state-of-the-art designs in both throughput and BRAM usage efficiency.", "venue": "Design Automation Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-05-10", "journal": {"name": "2021 58th ACM/IEEE Design Automation Conference (DAC)", "pages": "937-942"}, "authors": [{"authorId": "2109081099", "name": "Xinyu Chen"}, {"authorId": "1703011692", "name": "Hongshi Tan"}, {"authorId": "2118360318", "name": "Yao Chen"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "3339059", "name": "W. Wong"}, {"authorId": "1713644", "name": "Deming Chen"}], "citations": [{"paperId": "35f4fb2bbaa1139c077fcdaff76de945297bb47a", "title": "LightRW: FPGA Accelerated Graph Dynamic Random Walks"}, {"paperId": "a3bf65c22246b941e786bc83cd978ccb66ee5a30", "title": "Diba: A Re-configurable Stream Processor"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}]}
