{"paperId": "394e025f28e3424bf0851bfc9c0d8bee90f6a71b", "publicationVenue": {"id": "742d7b2a-78f4-48a5-a113-4a787b8c0c13", "name": "Advances in Mobile Multimedia", "type": "conference", "alternate_names": ["Adv Mob Multimedia", "MoMM"]}, "title": "An Interaction Design Model for Information Visualization in Immersive Augmented Reality platform", "abstract": "Recent advances in immersive technologies such as Augmented Reality (AR) provide new opportunities to explore, analyze and present data through Immersive Analytics (IA). This study presents a thorough overview of current research in immersive AR and further proposes a preliminary model for design of immersive AR applications. The goal is to present data in AR settings where users can rely on familiar perceptions to draw in-depth conclusions on the data. This will be achieved by developing a tangible AR system for information visualization in future. The results obtained from this study will help researchers and designers in the field of Information Visualization, immersive Analytics, Virtual Reality (VR), Augmented Reality (AR), HCI, and Natural User Interfaces (NUI).", "venue": "Advances in Mobile Multimedia", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2019-12-02", "journal": {"name": "Proceedings of the 17th International Conference on Advances in Mobile Computing & Multimedia"}, "authors": [{"authorId": "1981796", "name": "Shafaq Irshad"}, {"authorId": "9115884", "name": "D. R. A. Rambli"}, {"authorId": "145923920", "name": "S. Sulaiman"}], "citations": [{"paperId": "873c6a13e6a1c4b552c7cb999bf6e8809af2f32e", "title": "Investigating the user experience of IDN based virtual reality environments for solving complex issues"}, {"paperId": "7f2ce285df1d97e75b1eb4c68638244302c0cd75", "title": "Data Analysis and Visualization Application Research on Popular Scenic Spots in China"}, {"paperId": "305a1c688c9230a613b3d33ba2c1bb661c3a3ef8", "title": "Characteristics of augmented map research from a cartographic perspective"}, {"paperId": "0c960832fdac95978f6c21e2b435aac9189e81a5", "title": "A proposed UML-based common model for information visualization systems"}]}
