{"paperId": "395b9863108786a2c987b2a9464ebf66614b9610", "publicationVenue": {"id": "9fe230fc-d0a3-45d6-86ab-82ae6e7fc46b", "name": "JMIR Aging", "issn": "2561-7605", "url": "https://aging.jmir.org/"}, "title": "Characteristics and Range of Reviews About Technologies for Aging in Place: Scoping Review of Reviews", "abstract": "Background It is a contemporary and global challenge that the increasing number of older people requiring care will surpass the available caregivers. Solutions are needed to help older people maintain their health, prevent disability, and delay or avoid dependency on others. Technology can enable older people to age in place while maintaining their dignity and quality of life. Literature reviews on this topic have become important tools for researchers, practitioners, policy makers, and decision makers who need to navigate and access the extensive available evidence. Due to the large number and diversity of existing reviews, there is a need for a review of reviews that provides an overview of the range and characteristics of the evidence on technology for aging in place. Objective This study aimed to explore the characteristics and the range of evidence on technologies for aging in place by conducting a scoping review of reviews and presenting an evidence map that researchers, policy makers, and practitioners may use to identify gaps and reviews of interest. Methods The review was conducted in accordance with the PRISMA-ScR (Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews). Literature searches were conducted in Web of Science, PubMed, and Scopus using a search string that consisted of the terms “older people” and “technology for ageing in place,” with alternate terms using Boolean operators and truncation, adapted to the rules for each database. Results A total of 5447 studies were screened, with 344 studies included after full-text screening. The number of reviews on this topic has increased dramatically over time, and the literature is scattered across a variety of journals. Vocabularies and approaches used to describe technology, populations, and problems are highly heterogeneous. We have identified 3 principal ways that reviews have dealt with populations, 5 strategies that the reviews draw on to conceptualize technology, and 4 principal types of problems that they have dealt with. These may be understood as methods that can inform future reviews on this topic. The relationships among populations, technologies, and problems studied in the reviews are presented in an evidence map that includes pertinent gaps. Conclusions Redundancies and unexploited synergies between bodies of evidence on technology for aging in place are highly likely. These results can be used to decrease this risk if they are used to inform the design of future reviews on this topic. There is a need for an examination of the current state of the art in knowledge on technology for aging in place in low- and middle-income countries, especially in Africa.", "venue": "JMIR Aging", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-06-26", "journal": {"name": "JMIR Aging", "volume": "7"}, "authors": [{"authorId": "40879895", "name": "Jenny M. Bergschöld"}, {"authorId": "2264323099", "name": "Mari Gunnes"}, {"authorId": "2264336230", "name": "Arne H. Eide"}, {"authorId": "8513546", "name": "E. Lassemo"}], "citations": []}
