{"paperId": "3961c1a76986b3741310f6064fd3ac231fa9404d", "publicationVenue": {"id": "abc0c598-b988-4841-a8c5-65bfa6f3df77", "name": "Biomedicines", "type": "journal", "issn": "2227-9059", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-327040", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-327040", "https://www.mdpi.com/journal/biomedicines"]}, "title": "Characterization of Maladaptive Processes in Acute, Chronic and Remission Phases of Experimental Colitis in C57BL/6 Mice", "abstract": "Inflammatory bowel disease (IBD) is a chronic recurrent inflammatory disease with unknown etiology. Dextran sulfate sodium (DSS) induced colitis is a widely used mouse model in IBD research. DSS colitis involves activation of the submucosal immune system and can be used to study IBD-like disease characteristics in acute, chronic, remission and transition phases. Insight into colon inflammatory parameters is needed to understand potentially irreversible adaptations to the chronification of colitis, determining the baseline and impact of further inflammatory episodes. We performed analyses of non-invasive and invasive colitis parameters in acute, chronic and remission phases of the DSS colitis in C57BL/6 mice. Non-invasive colitis parameters poorly reflected inflammatory aspects of colitis in chronic remission phase. We found invasive inflammatory parameters, positively linked to repeated DSS-episodes, such as specific colon weight, inflamed colon area, spleen weight, absolute cell numbers of CD4+ and CD8+ T cells as well as B cells, blood IFN-γ level, colonic chemokines BLC and MDC as well as the prevalence of Turicibacter species in feces. Moreover, microbial Lactobacillus species decreased with chronification of disease. Our data point out indicative parameters of recurrent gut inflammation in context of DSS colitis.", "venue": "Biomedicines", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Biomedicines", "volume": "10"}, "authors": [{"authorId": "31163877", "name": "Elif Gelmez"}, {"authorId": "47366058", "name": "K. Lehr"}, {"authorId": "6345434", "name": "O. Kershaw"}, {"authorId": "46971384", "name": "Sarah Frentzel"}, {"authorId": "1396781567", "name": "R. Vílchez-Vargas"}, {"authorId": "5417407", "name": "U. Bank"}, {"authorId": "2149385749", "name": "Alexander Link"}, {"authorId": "2850797", "name": "T. Schüler"}, {"authorId": "49591640", "name": "A. Jeron"}, {"authorId": "6572715", "name": "D. Bruder"}], "citations": [{"paperId": "636fc6da2aea383dab3b6e103b0020b7f363a9da", "title": "Protective Effect of Red Rice Extract Rich in Proanthocyanidins in a Murine Colitis Model"}]}
