{"paperId": "3964176a340507c29f4e8f990474775d9a9fe922", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "The development of low-cost spin coater with wireless IoT control for thin film deposition", "abstract": "A low-cost spin coater with a wireless remote system that can deposit thin films of uniform thickness and quality at a significantly lower cost than traditional methods. The system consists of three main parts, a motorized spindle, a spin-coating head, and a control system connected to the network. The mechanical design on the mechanical part, spin coater system design with ESP32, and implementation of wireless control through visual basic. The network-enabled control system allows for real-time monitoring and adjustment of the deposition process, which can improve efficiency and reproducibility. This low-cost spin coating system represents a promising solution for organizations seeking to access thin film deposition technology at a fraction of the cost of traditional systems. By integrating wireless IoT control into low-cost spin coaters, the impact of this technology on coating uniformity will provide valuable insights for future advancements in this field.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-06-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2295370068", "name": "Ahmad Muhajer Abdul Aziz"}, {"authorId": "2275166089", "name": "M. I. Idris"}, {"authorId": "2221650400", "name": "Zul Atfyi Fauzan Mohammed Napiah"}, {"authorId": "2295370997", "name": "Muhammad Noorazlan Shah Zainudin"}, {"authorId": "153898658", "name": "Marzaini Rashid"}, {"authorId": "1965924830", "name": "Luke J. Bradley"}], "citations": []}
