{"paperId": "39681973637e16a5bfdd2269c97ebac071a00a4f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "KOSMOS: Knowledge-graph Oriented Social media and Mainstream media Overview System", "abstract": "We introduce KOSMOS, a knowledge retrieval system based on the constructed knowledge graph of social media and mainstream media documents. The system first identifies key events from the documents at each time frame through clustering, extracting a document to represent each cluster, then describing the document in terms of 5W1H (Who, What, When, Where, Why, How). The event centric knowledge graph is enhanced by relation triplets and entity disambiguation from the representative document. This knowledge retrieval is supported by a web interface that presents a graph visualisation of related nodes and relevant articles based on a user query. The interface facilitates understanding relationships between events reported in mainstream and social media journalism through the KOSMOS information extraction pipeline, which is valuable to understand media slant and public opinions. Finally, we explore a use case in extracting events and relations from documents to understand the media and community's view to the 2020 COVID19 pandemic.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-11", "journal": {"name": "ArXiv", "volume": "abs/2012.06209"}, "authors": [{"authorId": "2054797274", "name": "Hao Yang Chua"}, {"authorId": "100604753", "name": "S. Yong"}, {"authorId": "2209484529", "name": "Kok Chin Boon"}, {"authorId": "2035499140", "name": "Lander Chin"}, {"authorId": "14532516", "name": "L. Ng"}], "citations": [{"paperId": "2149ffcb6cc304140f6fbdcba01c4a231bfd4c1e", "title": "Events management in social media: a systematic literature review"}]}
