{"paperId": "396a7f409a39d73cc96fb27a3ec725f5a9030f62", "publicationVenue": {"id": "57ef36b3-e71f-44ca-ab80-f893afce2ede", "name": "International Conference on Cloud and Big Data Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Big Data Comput", "International Conference Cloud and Big Data Computing", "ICCBDC"]}, "title": "Big data execution time based on Spark Machine Learning Libraries", "abstract": "The paper focuses on exploring the time consumption of supervised and unsupervised models of Apache Spark framework in massive datasets. Big Data analytics has been relevant in the industry due to the need to convert information into knowledge. Among the challenge of big data is the creation of strategies to improve the execution costs of running machine learning models to make a prediction. Apache Spark is a powerful in-memory platform that offers an extensive machine learning library for regression, classification, clustering, and rule extraction. This investigation, from a computation cost perspective, performs different experiments using real datasets. The main contribution of the paper is to compare the execution time of different machine learning models, such as random forests, decision tree, logistic regression, linear support vector machine, and kNN. The present work expects to combine the areas of big data and machine learning, comparing the results with different configurations and the use of the optimization methods, cache and persist. The evaluation experiments show that logistic regression performed the shortest execution time of the Spark MLlib models.", "venue": "International Conference on Cloud and Big Data Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-08-28", "journal": {"name": "Proceedings of the 2019 3rd International Conference on Cloud and Big Data Computing"}, "authors": [{"authorId": "1390154204", "name": "Anna Karen Gárate-Escamilla"}, {"authorId": "40109655", "name": "A. Hassani"}, {"authorId": "152966673", "name": "Emmanuel Andres"}], "citations": [{"paperId": "2f4445f19564770e5aa8426248b9c13e58ea244c", "title": "Optimization for resource management in heterogeneous spark clusters"}, {"paperId": "9741764a42588e0d46d27a89fccb584086fe06d0", "title": "Performance Evaluation of Machine Learning Models on Apache Spark: An Empirical Study"}, {"paperId": "71c6c21a6e6f18e35a9f206ac153238d1a766b47", "title": "The assessment of annual rainfall field by applying different interpolation methods in the state of Rio Grande do Sul, Brazil"}]}
