{"paperId": "396d6552b42007376d576aef8c5703f6045e2b3c", "publicationVenue": {"id": "6c1a00cb-4b59-44d6-a887-bfd7c5b3768f", "name": "International Conference on Industrial Technology", "type": "conference", "alternate_names": ["ICIT", "Int Conf Ind Technol", "IEEE Int Conf Integr Technol", "IEEE International Conference on Integration Technology"]}, "title": "Smart Emergency Management Based on Social Big Data Analytics: Research Trends and Future Directions", "abstract": "Emergency management needs to be self-operating and utilize an autonomous processing framework to discover knowledge from various data sources. The aim of Smart Emergency Management (SEM) is to help Executive Management Teams (EMTs) make better decisions and deal with drastic events effectively; SEM needs reliable, accurate, and timely information and knowledge. The exponential growth of social networks, cloud computing, and the Internet of Things means that during emergency events human can share, reuse, and generate vast amounts of data through the application of Social Big Data (SBD). Currently, research tends to focus on the usage of SBD as a knowledge source in SEM, in particular, as a real-time data source for tracking disaster situations in order to manage them more effectively. This paper discusses potential research areas for state-of-the-art SBD analytics in support of SEM, examining fundamental frameworks, methodologies, and technologies for SEM; future trends for SEM using SBD analytics are also considered.", "venue": "International Conference on Industrial Technology", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book"], "publicationDate": "2017-12-27", "journal": {"name": "Proceedings of the 2017 International Conference on Information Technology"}, "authors": [{"authorId": "40372233", "name": "Bukhoree Sahoh"}, {"authorId": "2279352", "name": "A. Choksuriwong"}], "citations": [{"paperId": "66a02d0a1097f6bcd0e1ebdfde1b75c2ae54ad63", "title": "Research on Intelligent Emergency Resource Allocation Mechanism for Public Health Emergencies: A Case Study on the Prevention and Control of COVID-19 in China"}, {"paperId": "56c0872ab619f54d1a2c8841e404aac31a7bb0f3", "title": "Multi-source Multimodal Data and Deep Learning for Disaster Response: A Systematic Review"}, {"paperId": "fd397e85eab03993d6061a1c8b3d10865e53773f", "title": "Knowledge-Based Decision Support System for Emergency Management: The Pandemic Framework"}, {"paperId": "d4b0338977c47a0ac27cef10ec181aae6978a297", "title": "A proof-of-concept and feasibility analysis of using social sensors in the context of causal machine learning-based emergency management"}, {"paperId": "8e3fe67b91dabeff8cd609326fc439d3120bb490", "title": "Evolutionary Game Analysis of Cross-Regional Coordinated Governance of Major Public Health Emergencies: The Example of the Spread of the COVID-19 Outbreak"}, {"paperId": "d95299dd3df884422b00d1651f84dc74ae79f79d", "title": "Automatic Semantic Description Extraction from Social Big Data for Emergency Management"}, {"paperId": "b503d701e96e3f5188c7589b3b307e0c40a0d119", "title": "Towards Smart Emergency Management: Trends and Challenges of Feature Engineering"}]}
