{"paperId": "3981ffd1b66d4b8146aa270f9155e0de8ed38f93", "publicationVenue": null, "title": "Natural Disaster Application on Big Data and Machine Learning: A Review", "abstract": "Natural disasters are events that are difficult to avoid. There are several ways of reducing the risks of natural disasters. One of them is implementing disaster reduction programs. There are already several developed countries that apply the concept of disaster reduction. In addition to disaster reduction programs, there are several ways to predict or reducing the risks using artificial intelligence technology. One of them is big data, machine learning, and deep learning. By utilizing this method at the moment, it facilitates tasks in visualizing, analyzing, and predicting natural disaster. This research will focus on conducting a review process and understanding the purpose of machine learning and big data in the area of disaster management and natural disaster. The result of this paper is providing insight and the use of big data, machine learning, and deep learning in 6 disaster management area. This 6-disaster management area includes early warning damage, damage assessment, monitoring and detection, forecasting and predicting, and post-disaster coordination, and response, and long-term risk assessment and reduction.", "venue": "2019 4th International Conference on Information Technology, Information Systems and Electrical Engineering (ICITISEE)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-11-01", "journal": {"name": "2019 4th International Conference on Information Technology, Information Systems and Electrical Engineering (ICITISEE)", "pages": "249-254"}, "authors": [{"authorId": "119909372", "name": "Rania Rizki Arinta"}, {"authorId": "1626117444", "name": "Emanuel Andi W.R."}], "citations": [{"paperId": "e558b2eb4c6dd618c7d0364b65e8e89d8f50b69a", "title": "Machine learning methods in civil engineering: a systematic review"}, {"paperId": "d826b8e3e692bcfe3fc9ce04caf5b4f94ec34e8c", "title": "Review of Disaster Defect Management in Machine Learning"}, {"paperId": "93c73e5dde158165260a8ba003247b7597eded52", "title": "Present and Future of Artificial Intelligence in Disaster Management"}, {"paperId": "86b0b0c13954f5126f22eb1e74dbdfea930fddbd", "title": "Predicting Unmet Healthcare Needs in Post-Disaster: A Machine Learning Approach"}, {"paperId": "e3a9f5d0b1cfdeca2f6ae8bae6e934303fc15624", "title": "The development of new remote technologies in disaster medicine education: A scoping review"}, {"paperId": "10185336e4f50534f68fbf3f2b9a152765413a0a", "title": "A Smart Framework for Managing Natural Disasters Based on the IoT and ML"}, {"paperId": "f75b86172d310f5c807a63ab4c0bb9fe944250e8", "title": "FrankenSplit: Efficient Neural Feature Compression With Shallow Variational Bottleneck Injection for Mobile Edge Computing"}, {"paperId": "605b8ced549a2a08691ab2111572a7f58d0e11a0", "title": "Pre-disaster Management based Machine Learning, IoT and Big Data: Survey and future direction"}, {"paperId": "d7553abb1255efa71d3758953993eda69d147a72", "title": "Disaster Analysis Using Machine Learning"}, {"paperId": "f47203c453d59f5f256ae7ed42490ae8a9a168ab", "title": "The Disaster-Resilient Smart City in Malaysia: The Use of Technology in Flood Management"}, {"paperId": "66f721374b909b432d8733585db7f432e1f79b95", "title": "Efficient Device-Edge Inference for Disaster Classification"}, {"paperId": "7d2b944c6361cc4486558d1725138f698965aacc", "title": "GaLeNet: Multimodal Learning for Disaster Prediction, Management and Relief"}, {"paperId": "010d1b055eae0ad3175ae379124a36d3c9c05e3c", "title": "Machine Learning in Disaster Management: Recent Developments in Methods and Applications"}, {"paperId": "968cb5e086bb46e9f92f4a25063ed621277ea9f9", "title": "Industrial Automation (IIoT) 4.0: An Insight Into Safety Management"}, {"paperId": "da9cb49f83836f2eceabd7bdf49817b1ea15788e", "title": "UTILIZATION OF ARTIFICIAL INTELLIGENCE TO IMPROVE FLOOD DISASTER MITIGATION"}, {"paperId": "3d82a0122df0e9cd67c6f18ea0590784017db6eb", "title": "FrankenSplit: Saliency Guided Neural Feature Compression with Shallow Variational Bottleneck Injection"}, {"paperId": "0f29363b0cda333630842204fa89fd6a47420cc0", "title": "Natural Disasters and Artificial Intelligence"}, {"paperId": "0e00dbdcde54a52849d5f4bac82fad9077d9ea80", "title": "EXPLORING MACHINE LEARNING AND DEEP LEARNING APPROACHES FOR DISASTER PREDICTION AND MANAGEMENT: A SURVEY OF DIFFERENT APPROACHES"}]}
