{"paperId": "399edb0c45206c749a01c8993dc146efc022b11f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "AutoGMM: Automatic Gaussian Mixture Modeling in Python", "abstract": "Gaussian mixture modeling is a fundamental tool in clustering, as well as discriminant analysis and semiparametric density estimation. However, estimating the optimal model for any given number of components is an NP-hard problem, and estimating the number of components is in some respects an even harder problem. In R, a popular package called mclust addresses both of these problems. However, Python has lacked such a package. We therefore introduce AutoGMM, a Python algorithm for automatic Gaussian mixture modeling. AutoGMM builds upon scikit-learn's AgglomerativeClustering and GaussianMixture classes, with certain modifications to make the results more stable. Empirically, on several different applications, AutoGMM performs approximately as well as mclust. This algorithm is freely available and therefore further shrinks the gap between functionality of R and Python for data science.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-06", "journal": {"name": "ArXiv", "volume": "abs/1909.02688"}, "authors": [{"authorId": "150317407", "name": "Thomas L. Athey"}, {"authorId": "1717958", "name": "J. Vogelstein"}], "citations": [{"paperId": "0fa7449a129084ab8fb669f5df4bf65758751c18", "title": "Experience-dependent information routing through the basolateral amygdala"}, {"paperId": "8fade9711bbfda872c267ca4bf3bc2f9d13819c0", "title": "On Excess Mass Behavior in Gaussian Mixture Models with Orlicz-Wasserstein Distances"}, {"paperId": "62b032c667ef990a1437ce9689630b4daaff8caf", "title": "Corpus Statistics Empowered Document Classification"}, {"paperId": "29e900db4c71f4d6e7eb3a31676e97fd1ab3a5e0", "title": "LiCl-induced sickness modulates rat gustatory cortical responses"}, {"paperId": null, "title": "Title LiCl-induced sickness modulates spontaneous activity and response dynamics in rat gustatory cortex . Abbreviated Title Sickness modulates cortical taste responses Names and Affiliations"}]}
