{"paperId": "39bb1c1dc271a109be18984e792b4d0a8f91cd22", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "Development of a Machine Learning Model for Classifying Cooking Recipes According to Dietary Styles", "abstract": "To complement classical methods for identifying Japanese, Chinese, and Western dietary styles, this study aimed to develop a machine learning model. This study utilized 604 features from 8183 cooking recipes based on a Japanese recipe site. The data were randomly divided into training, validation, and test sets for each dietary style at a 60:20:20 ratio. Six machine learning models were developed in this study to effectively classify cooking recipes according to dietary styles. The evaluation indicators were above 0.8 for all models in each dietary style. The top ten features were extracted from each model, and the features common to three or more models were employed as the best predictive features. Five well-predicted features were indicated for the following seasonings: soy sauce, miso (fermented soy beans), and mirin (sweet cooking rice wine) in the Japanese diet; oyster sauce and doubanjiang (chili bean sauce) in the Chinese diet; and olive oil in the Western diet. Predictions by broth were indicated in each diet, such as dashi in the Japanese diet, chicken soup in the Chinese diet, and consommé in the Western diet. The prediction model suggested that seasonings and broths could be used to predict dietary styles.", "venue": "Foods", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-22", "journal": {"name": "Foods", "volume": "13"}, "authors": [{"authorId": "2117166917", "name": "M. Yamaguchi"}, {"authorId": "2170389644", "name": "Michihiro Araki"}, {"authorId": "2188182454", "name": "Kazuki Hamada"}, {"authorId": "2287152323", "name": "Tetsuya Nojiri"}, {"authorId": "2287141813", "name": "Nobuo Nishi"}], "citations": []}
