{"paperId": "39c21f467386bb900cd1ab925c2675294fedc560", "publicationVenue": {"id": "9aa57e01-2dc2-4422-93b7-2b628326f78c", "name": "Information and Communication Technology Convergence", "type": "conference", "alternate_names": ["International Conference on Information and Communication Technology Convergence", "Inf Commun Technol Converg", "Int Conf Inf Commun Technol Converg", "ICTC"]}, "title": "Designing ML-based Approximate Query Processing Services on Time-Varying Large Dataset for Distributed Systems", "abstract": "Approximate query processing (AQP) has been well established for big data analytics to complement performance degradation due to the ever-increasing size of datasets. The evolution of machine learning technologies creates another opportunity for improving the AQP. There are two architectural aspects that should be considered for AQP-based data analytics services to embrace the trends. First, the services should support rapidly changing data. Second, the systems should manage the life-cycle of the machine learning process and accommodate the diversity of ML technologies. This paper discusses the requirements and design considerations for ML-based AQP services on time-varying large datasets for distributed environments in a system-independent way.", "venue": "Information and Communication Technology Convergence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-19", "journal": {"name": "2022 13th International Conference on Information and Communication Technology Convergence (ICTC)", "pages": "1979-1982"}, "authors": [{"authorId": "2192208498", "name": "Kihyuk Nam"}, {"authorId": "2109620517", "name": "Sung-Soo Kim"}, {"authorId": "2115246479", "name": "C. Park"}, {"authorId": "35691849", "name": "Taekyong Nam"}, {"authorId": "2173523", "name": "Taewhi Lee"}], "citations": [{"paperId": "e3197184b40a7b6c825cbb7d6531c1ee76141a92", "title": "A Framework for Learned Approximate Query Processing for Tabular Data with Trajectory"}]}
