{"paperId": "39d57e03251356d1e2d6ec043840404af76592a8", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "A fault-tolerant aware scheduling method for fog-cloud environments", "abstract": "Fog computing is a promising technology that leverages the resources to provide services for requests of IoT (Internet of Things) devices at the cloud edge. The high dynamic and heterogeneous nature of devices at the cloud edge causes failures to be a popular event and therefore fault tolerance became indispensable. Most early scheduling and fault-tolerant methods did not highly consider time-sensitive requests. This increases the possibility of latencies for serving these requests which causes unfavorable impacts. This paper proposes a fault-tolerant scheduling method (FTSM) for allocating services’ requests to the most sufficient devices in fog-cloud IoT-based environments. The main purpose of the proposed method is to reduce the latency and overheads of services and to increase the reliability and capacity of the cloud. The method depends on categorizing devices that can issue requests into three classes according to the type of service required. These classes are time-sensitive, time-tolerant and core. Each time-sensitive request is directly mapped to one or more edge devices using a pre-prepared executive list of devices. Each time-tolerant request may be assigned to one or more devices at the cloud edge or the cloud core. Core requests are assigned to resources at the cloud core. In order to achieve fault tolerance, the proposed method selects the most suitable fault-tolerant technique from replication, checkpointing and resubmission techniques for each request while most existing methods consider only one technique. The effectiveness of the proposed method is assessed using average service time, throughput, operation costs, success rate and capacity percentage as performance indicators.", "venue": "PLoS ONE", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-17", "journal": {"name": "PLoS ONE", "volume": "14"}, "authors": [{"authorId": "48315327", "name": "Abdulaziz Alarifi"}, {"authorId": "1381071311", "name": "F. Abdelsamie"}, {"authorId": "35948070", "name": "M. Amoon"}], "citations": [{"paperId": "a40bd5a657065f5d3a60d289d788f9b3bdcbc5a5", "title": "A hybrid approach for fault-tolerance aware load balancing in fog computing"}, {"paperId": "58157e05d53a99e3e01f1ca895e9bc5e77d99b95", "title": "A Fault-Tolerant Load Balancing Approach Using Whale Optimization Algorithm for Cloud-Fog Based IoT Applications"}, {"paperId": "c7c7cf8389fa1095ec5151248e84a07dddc31bb8", "title": "Fog-cloud scheduling simulator for reinforcement learning algorithms"}, {"paperId": "a035f321f24b9fc33d0ba1fe9c79d9d698be9526", "title": "Content Replica Placement Method for Fault Tolerance in Fog Computing Environment"}, {"paperId": "1948d2462b4955764c3533651f6195c7150b9c0b", "title": "Proactive Fault Prediction of Fog Devices Using LSTM-CRP Conceptual Framework for IoT Applications"}, {"paperId": "bedbece27165836ff224eb4a999259588210e873", "title": "Load balancing techniques for fog computing environment: Comparison, taxonomy, open issues, and challenges"}, {"paperId": "68c4743e8b90ab97921b00b135b133aecfb1fe6f", "title": "Workload Classification: For Better Resource Management in Fog-Cloud Environments"}, {"paperId": "dae611696b0a52e3f6d871c333cc9b914fa2f2f0", "title": "A Multi Agent Based Dynamic Resource Allocation in Fog-Cloud Computing Environment"}, {"paperId": "2c6033f6c25bb11b48beb369ba6945569fbfc53e", "title": "Adaptive Fault Tolerant Resource Allocation Scheme for Cloud Computing Environments"}, {"paperId": "d73212fc259e1266808743b4fbafc92404d71f8d", "title": "Reliable scheduling and load balancing for requests in cloud-fog computing"}, {"paperId": "1ac275d2a233f9f159e706afac48e541d068c62f", "title": "Fuzzy Logic-based Robust Failure Handling Mechanism for Fog Computing"}, {"paperId": "b85776ac19ab0fc03ae6aa74b34a6798941aae6e", "title": "A Self-stabilizing Control Plane for Fog Ecosystems"}, {"paperId": "e8fa7a5f40812a02e6d2f6b1d1acbcf1bfaedb6e", "title": "A Self-stabilizing Control Plane for the Edge and Fog Ecosystems"}, {"paperId": "370018a3a8b1e74b89e3cc05298909334fd5b047", "title": "An Adaptive Service Placement Framework in Fog Computing Environment"}, {"paperId": "1ffb2d0b97808b08a6dfa1f32257d5bc991549f4", "title": "Fog Data Analytics for IoT Applications: Next Generation Process Model with State of the Art Technologies"}, {"paperId": "9adf3d0b4a67acfee9f3819b8eaa102fb32d54b2", "title": "Data Security and Privacy Functions in Fog Data Analytics"}]}
