{"paperId": "39d5f65af31fe61e455ef86702d4435e7184b0fc", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Practical Model for the Evaluation of High School Student Performance Based on Machine Learning", "abstract": "The objective of this research is to develop an machine learning (ML) -based system that evaluates the performance of high school students during the semester and identify the most significant factors affecting student performance. It also specifies how the performance of models is affected when models run on data that only include the most important features. Classifiers employed for the system include random forest (RF), support vector machines (SVM), logistic regression (LR) and artificial neural network (ANN) techniques. Moreover, the Boruta algorithm was used to calculate the importance of features. The dataset includes behavioral information, individual information and the scores of students that were collected from teachers and a one-by-one survey through an online questionnaire. As a result, the effective features of the database were identified, and the least important features were eliminated from the dataset. The ANN accuracy, which was the best accuracy in the original dataset, was reduced in the decreased dataset. On the contrary, SVM performance was improved, which had the highest accuracy among other models, with 0.78. Moreover, the LR and RF models could provide the same performance in the decreased dataset. The results showed that ML models are influential for evaluating students, and stakeholders can use the identified effective factors to improve education.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-06", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2144751746", "name": "Mostafa Zafari"}, {"authorId": "1403015408", "name": "A. Sadeghi-Niaraki"}, {"authorId": "7236280", "name": "Soo-Mi Choi"}, {"authorId": "31498483", "name": "A. Esmaeily"}], "citations": [{"paperId": "b3e704df385ec074a58d6468ac60746cd16a2178", "title": "Systematic review of research on artificial intelligence in K-12 education (2017–2022)"}, {"paperId": "db035cf8e4b77207b1b3df2d569869f5a76fac43", "title": "Machine Learning Approach to Predict Basic Literacy Skills of Elementary School Students"}, {"paperId": "d267319f14c51a80b25c4c07161def95c641e14a", "title": "Special Issue on Artificial Intelligence and Complex Systems"}, {"paperId": "721de04c2f1af0b8e7023afa1323defc1e6bce16", "title": "Evaluation of students' performance during the academic period using the XG-Boost Classifier-Enhanced AEO hybrid model"}, {"paperId": "07b970994ebeaf2d7b48739f13cd86ecc2c762ba", "title": "AI Approaches in Education Based on Individual Learner Characteristics: A Review"}, {"paperId": "d5d5f1551c2a2e3ecdc793ac976b1647f0e87109", "title": "Analysis of Machine Learning Classification Approaches for Predicting Students’ Programming Aptitude"}, {"paperId": "6983757b2ee08a00afedafa67c9b0e98ad435dd6", "title": "Impacto de la inteligencia artificial en los métodos de evaluación en la educación primaria y secundaria: revisión sistemática de la literatura"}, {"paperId": "6da9eea92946e5abe97ba224db589e20b9e55a35", "title": "Impact of artificial intelligence on assessment methods in primary and secondary education: Systematic literature review"}, {"paperId": "9bd9022c43578122098afcaf435b3f49cb6a8064", "title": "Evaluating Student Knowledge Assessment Using Machine Learning Techniques"}, {"paperId": "7b74b0ad681220d69976b8bade53286b28fcec88", "title": "Prediction on Impact of Electronic Gadgets in Students Life using Machine Learning"}, {"paperId": "1b6561e53a0fc10fd7e68638a3ca65e350e50d98", "title": "SA-FEM: Combined Feature Selection and Feature Fusion for Students’ Performance Prediction"}, {"paperId": "e24a0cfc1d2d6ed1cc314ac500dded6594403cb1", "title": "Investigation on Machine Learning Algorithms to Predict High School Students Performance at Risk of Failure"}, {"paperId": "5341c4fe6d932006627b3bcc685ad4ba9800348f", "title": "Systematic Review of Educational Data Mining for Student Performance Prediction using Bibliometric Network Analysis (SeBriNA)"}, {"paperId": "b1666a1378f45550f9a979f7248ef8c236b6fbc2", "title": "Week-Wise Student Performance Early Prediction in Virtual Learning Environment Using a Deep Explainable Artificial Intelligence"}, {"paperId": "a9e6c48daded08b4d607c36dbff2328da63d498a", "title": "Impact of artiﬁcial intelligence on assessment methods in primary and secondary education: Systematic literature review"}]}
