{"paperId": "39d77d66b6dbfa004352347ce7d73cc5778d440f", "publicationVenue": {"id": "9cb01111-9c20-40db-9d45-94528bf932f8", "name": "Societies", "issn": "2075-4698", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217542", "alternate_urls": ["https://www.mdpi.com/journal/societies", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217542"]}, "title": "The Challenges and Opportunities of Era 5.0 for a More Humanistic and Sustainable Society—A Literature Review", "abstract": "We are in an increasingly disruptive context, in an Era in which the world presents challenging and growing levels of uncertainty, unpredictability, and complexity. As a result, society is facing, at all levels and in all areas, more and more global challenges, challenging its stability and prosperity, whether at a technological, economic, social, environmental, or educational level. The new Era, Era 5.0, which places the human being at the center of innovation and technological transformation, can and must make its contribution to improving the quality of life, solving social problems, and human well-being, with the support of technology. Thus, this work intends, based on a systematic review of the literature, to analyze the challenges of Era 5.0 and its impacts on industry, society, and education as engines and promoters of the path to sustainable development. The results of this work show that the challenges for industry and education on the road to a “new” society are immense, in order to achieve a more humanistic society, centered on human beings, quality of life, and sustainability. We believe in contributing to the state of the art in Era 5.0 and providing an analytical reflection in the field of education and industry, on the path towards a society that places the human being at the center of innovation and technological transformation.", "venue": "Societies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-26", "journal": {"name": "Societies"}, "authors": [{"authorId": "120485537", "name": "Maria C. Tavares"}, {"authorId": "2060521432", "name": "Graça Maria do Carmo Azevedo"}, {"authorId": "3648892", "name": "R. P. Marques"}], "citations": [{"paperId": "38c33089f602905b46293f1d52f9eb62603f7cfc", "title": "Natural Resource Optimization and Sustainability in Society 5.0: A Comprehensive Review"}, {"paperId": "4a341538ff1739542aedce6f88c047723ffe3510", "title": "Current State Analysis of Croatian Manufacturing Industry with Regard to Industry 4.0/5.0"}, {"paperId": "2209cf7cdebaf1a7e424bc05f040d6ce4926e64d", "title": "Rethinking innovation through industry and society 5.0 paradigms: a multileveled approach for management and policy-making"}, {"paperId": "58e0c1433d6f3df14cc7e1bd15ecc66d2ebbe4ba", "title": "Authority and Dynamics of Compliance to Resolve Sharia Digital Finance Disputes in Indonesia"}, {"paperId": "9381a6ba03911a36501736372c1d61e01e336dbb", "title": "A Review on the Way Forward in Construction through Industrial Revolution 5.0"}, {"paperId": "68766522b860eb493676de2078e8d9ce3d487e72", "title": "Reviewing and Integrating AEC Practices into Industry 6.0: Strategies for Smart and Sustainable Future-Built Environments"}, {"paperId": "461da5baaf6e75d8ca43336c48444fc66f869a18", "title": "Beyond Conventional Boundaries: A Literature Study on Madrasah Management and the Construction of Online Learning Innovations"}, {"paperId": "988b07f22ae6932eb20220cd63faedd9aab5e17f", "title": "Rethinking the curricula in teaching accounting: The skills required by the market"}, {"paperId": "2b4ed420437543655715ba297af412428a7040a5", "title": "Society 5.0 and Education 5.0 : A Critical Reflection"}, {"paperId": "8dae0a3eba5dc5489861478d24c3bfc086be75f9", "title": "Rethinking the curricula in accounting education: An interdisciplinary student-centered approach"}, {"paperId": "723a6b5cb4debec0870d511280328c76d1d0f02c", "title": "Opportunities and Challenges in Education 5.0 : Coping with the Digital Environment at Higher Education"}, {"paperId": "7424ae31fd7b7f9107ee969c6b65c94fade611ea", "title": "The Psychosocial Model of Absenteeism: Transition from 4.0 to 5.0"}, {"paperId": "73dc67a1ef1387d9d8f15c7b9f4bdbfd74853df8", "title": "ТРАНСФОРМАЦІЯ ЕТИЧНИХ АСПЕКТІВ НАУКОВИХ ДОСЛІДЖЕНЬ В УМОВАХ ЦИФРОВІЗАЦІЇ"}, {"paperId": "02e2aa5a1cdfa4a2f2097dc1d0996cbf0bc2c22d", "title": "Tantangan Generasi Muda untuk Terjun Kedalam Bidang Software Engineering pada Society 5.0"}, {"paperId": "0afd4764822df825323aa81b014f5a28359fbfa1", "title": "Successful Digital Transformation Initiatives in SMEs: A Relational Goods Perspective"}, {"paperId": "54b6c34893ba3023e73aef2ed376032cd723d1de", "title": "Society 5.0-Inspired Digitalization Framework for Resilient and Sustainable Agriculture"}, {"paperId": "a9491756fbe542954672880bd66e257ceb860b36", "title": "Metaverse for revitalization of Aizu-Wakamatsu city"}, {"paperId": "1c47485e481fc1bbaab12e3c8a767cd2cae09d31", "title": "SKILLS AND NEEDS OF THE REPRESENTATIVES OF THE UKRAINIAN ACADEMIC COMMUNITY IN THE CONTEXT OF THE OPEN SCIENCE CONCEPT"}]}
