{"paperId": "39dcdd678acf14b125f2b132d6043890a6059a0c", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "A Review on Bio-inspired Optimization Method for Supervised Feature Selection", "abstract": "—Feature selection is a technique that is commonly used to prepare particular significant features or produce understandable data for improving the task of classification. Bio-inspired optimization algorithms have been successfully used to perform feature selection techniques. The exploration and exploitation mechanism that is based on the inspiration of living things to find a food source and the biological evolution in nature. Nevertheless, irrelevant, noisy, and redundant features persist from the situation of fall into local optima in case of high dimensionality. Thus, this review is conducted to shed some light on techniques that have been used to overcome the problem. The taxonomy of bio-inspired algorithms is presented, along with its performances and limitations, followed by the techniques used in supervised feature selection in term of data perspectives and applications. This review paper has also included the analysis of supervised feature selection on large dataset which showed that recent studies focus on metaheuristic methods because of their promising results. In addition, a discussion of some open issues is presented for further research.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2167693968", "name": "Montha Petwan"}, {"authorId": "1403121220", "name": "K. Ku-Mahamud"}], "citations": [{"paperId": "e2fa2fb76537b786e1c892ed162be2218ce069b5", "title": "Dataset Optimization for Chronic Disease Prediction with Bio-Inspired Feature Selection"}, {"paperId": "f28c7caddcd07f90b0a3f4def2b9cc2a30ef37f2", "title": "Feature selection for sky image classification based on self adaptive ant colony system algorithm"}, {"paperId": "11d29d6492e8a78c21cc12666159fc01c57b1eb3", "title": "Analysis of Bio-Inspired approaches and Social Media Analytics in Twitter datasets for Misinformation Detection"}]}
