{"paperId": "39e6f60a908e958f89c43601f7d301cc4a5e4f22", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Trends in prioritization of test cases: 2017-2019", "abstract": "A core task in software testing is the design of test suites. Large test suites may take too long to run frequently, and test case prioritization (TCP) techniques have been proposed to speed up the detection of faults. These techniques have become increasingly popular and the number of publications has grown in recent years. Surveys have covered most of the techniques, but the latest included only publications until 2016: interest is growing, and new proposals have been developed in the last three years. This paper aims to complete that survey by providing the latest developments in TCP to respond to this growing interest. Specifically we use the taxonomy proposed by Khatibsyarbin et al. on the most important publications from 2017 to the present day (2019). All in all, we found 320 papers in this period about test case prioritization. The results show that the main techniques used are search-, coverage- and similarity-based.", "venue": "ACM Symposium on Applied Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2020-03-30", "journal": {"name": "Proceedings of the 35th Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "1419436645", "name": "M. C. D. Castro-Cabrera"}, {"authorId": "1401632277", "name": "A. García-Domínguez"}, {"authorId": "1401934646", "name": "I. Medina-Bulo"}], "citations": [{"paperId": "4493aa3f41deb145ad385d7fa6e2fb4805da03ab", "title": "Machine Learning for Software Engineering: A Tertiary Study"}, {"paperId": "3665a2b480473cdd24e0554dfd8375df70c43798", "title": "Using goal–question–metric to compare research and practice perspectives on regression testing"}, {"paperId": "a7f1a09ae2fa90bda26374a1bc72a5d7bf4c77dc", "title": "A Taxonomy of Information Attributes for Test Case Prioritisation: Applicability, Machine Learning"}, {"paperId": "acba0439b0e65cbfd7f33b32ecd90e5bffd4d60b", "title": "Systematic Literature Review on Test Case Selection and Prioritization: A Tertiary Study"}, {"paperId": "8a435e465720be9f59ee45d4ef72222497403926", "title": "A Systematic Literature Review on Regression Test Case Prioritization"}, {"paperId": "39d0503fc52ead955c9f7ca7ce94ed9288ddd59c", "title": "AUTOMATION OF TEST CASE PRIORITIZATION: A SYSTEMATIC LITERATURE REVIEW AND CURRENT TRENDS"}, {"paperId": "862a0954fb22ef7f6e8d53759539da438e6777f9", "title": "A CRITICAL ANALYSIS OF SWARM INTELLIGENCE FOR REGRESSION TEST CASE PRIORITIZATION"}]}
