{"paperId": "39f68620a7bed4ecdcadd9603c5cfaeef452bb4e", "publicationVenue": {"id": "c00492c7-e775-4f0a-a843-9f5bbb219dbe", "name": "International Conference on Artificial Intelligence Circuits and Systems", "type": "conference", "alternate_names": ["AICAS", "Int Conf Artif Intell Circuit Syst"]}, "title": "TinyissimoYOLO: A Quantized, Low-Memory Footprint, TinyML Object Detection Network for Low Power Microcontrollers", "abstract": "This paper introduces a highly flexible, quantized, memory-efficient, and ultra-lightweight object detection network, called TinyissimoYOLO. It aims to enable object detection on microcontrollers in the power domain of milliwatts, with less than 0.5 MB memory available for storing convolutional neural network (CNN) weights. The proposed quantized network architecture with 422 k parameters, enables real-time object detection on embedded microcontrollers, and it has been evaluated to exploit CNN accelerators. In particular, the proposed network has been deployed on the MAX78000 microcontroller achieving high frame-rate of up to 180 fps and an ultra-low energy consumption of only 196 µJ per inference with an inference efficiency of more than 106 MAC/Cycle. TinyissimoYOLO can be trained for any multi-object detection. However, considering the small network size, adding object detection classes will increase the size and memory consumption of the network, thus object detection with up to 3 classes is demonstrated. Furthermore, the network is trained using quantization-aware training and deployed with 8-bit quantization on different microcontrollers, such as STM32H7A3, STM32L4R9, Apollo4b and on the MAX78000’s CNN accelerator. Performance evaluations are presented in this paper.", "venue": "International Conference on Artificial Intelligence Circuits and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-22", "journal": {"name": "2023 IEEE 5th International Conference on Artificial Intelligence Circuits and Systems (AICAS)", "pages": "1-5"}, "authors": [{"authorId": "2153356521", "name": "J. Moosmann"}, {"authorId": "2059755704", "name": "Marco Giordano"}, {"authorId": "145891426", "name": "C. Vogt"}, {"authorId": "145274281", "name": "M. Magno"}], "citations": [{"paperId": "469e42640930c6ca9eddddd37c792ba166b82d0f", "title": "Squeezed Edge YOLO: Onboard Object Detection on Edge Devices"}, {"paperId": "1328e00ddf5924e74a312e283193e75817523318", "title": "Q-Segment: Segmenting Images In-Sensor for Vessel-Based Medical Diagnosis"}, {"paperId": "5c525592670cf7d62275d7871ae1b2aafca544b2", "title": "Ultra-Efficient On-Device Object Detection on AI-Integrated Smart Glasses with TinyissimoYOLO"}, {"paperId": "fc8db2e01882a5d43c593ee9abaad0a9435314ec", "title": "Enhancing Lightweight Neural Networks for Small Object Detection in IoT Applications"}, {"paperId": "8e5c3d76a9d160e87765727f5c817aea151ed900", "title": "A Machine Learning-Oriented Survey on Tiny Machine Learning"}, {"paperId": "d8404b207f7cc6667c61c76e25984216c4c456fd", "title": "TinyTracker: Ultra-Fast and Ultra-Low-Power Edge Vision In-Sensor for Gaze Estimation"}, {"paperId": "f8685df1ef518a168da1590487001f571251f9b4", "title": "Flexible and Fully Quantized Ultra-Lightweight TinyissimoYOLO for Ultra-Low-Power Edge Systems"}, {"paperId": "018bac53af8b88b5968c8f847828a8cf6dc3aff9", "title": "Ultra-Fast and Ultra-Low-Power In-Sensor Edge Vision for Gaze Estimation"}]}
