{"paperId": "39f9fc0a54b493297f8a0cd009c24fd4656e0bd4", "publicationVenue": null, "title": "Detection of Epileptic Seizures in EEG Signals using Deep Convolutional Neural Networks", "abstract": "Epilepsy is the most prevalent neurological disease in the world. It affects around 65 million individuals globally, accounting for about 1% of the global population, and about 5 percent of individuals will have at least one seizure in their lives. Patients with epilepsy have recurrent and unexpected seizures as a result of aberrant neuronal activity in the cerebral cortex, which can lead to a variety of unanticipated side effects, including depression, memory loss, and many other psychiatric issues. Electroencephalography (EEG) is the most often used recording mode in epilepsy diagnosis, and long-haul recordings are visually reviewed and scrutinized by neurologists, which is a painstaking and tedious process. To draw the immediate attention of the patient with epilepsy and minimize the strain on neurologists, it is essential to develop an autonomous seizure detection methodology. In this work, a 1-D deep learning model with 5 convolution layers is implemented and applied to the University of Bonn, Germany, and Neurology and Sleep Center, Hauz Khas datasets, and the features for time domain, spectral domain, and the concatenation of time and spectral domain input data for single-channel EEG signals are extracted. Tenfold cross-validation is applied for the categorization of seizure and seizure-free data. The model's performance is evaluated and obtained 99.04% of accuracy, 98.47% of specificity, and 99.33% of sensitivity and it performs better than many existing methodologies.", "venue": "2023 International Conference on Next Generation Electronics (NEleX)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-12-14", "journal": {"name": "2023 International Conference on Next Generation Electronics (NEleX)", "pages": "1-7"}, "authors": [{"authorId": "20703106", "name": "Hema Kumar Goru"}, {"authorId": "2284350032", "name": "B. R. Krishna"}, {"authorId": "2213363083", "name": "Damodar Panigrahy"}], "citations": []}
