{"paperId": "3a0dfbd77a7909000fbda21091104f0bce192ac6", "publicationVenue": null, "title": "Map Reduce Based K-Means Genetic and C- Means Fuzzy Clustering Formation for Community Detection and Community Validation", "abstract": "The networks that are constantly a part of the Cloud infrastructure exist in the real world with different representations, further these networks exchange information with each other. Nowadays, the real-time data stored in Terabytes and Petrabytes must be processed by using an effective mechanism. The HDFS combined with Machine Learning Techniques frequently provides an intelligent technique for processing the big data. For a better understanding of the network's complex structure, the real-time structure in the networks can be represented as a community structure. However, it is necessary to detect the links in a distributed heterogeneous complex network for community detection. This research study proposes a novel algorithm for community detection by employing a genetic algorithm based K-Means Unsupervised Technique and C-Means Fuzzy Clustering. The Map Reduce framework is used to provide scalability and parallelism in the proposed work. The performance analysis metrics such as accuracy and convergence are measured. The Folkes and Mallows Coefficient with Hyperparameter Tuning is used to further assess the community development. The Fuzzy C-Means Clustering Algorithm is used to define the Objective Function. The proposed method has additionally included a Map Reduce Framework and is more efficient when compared to other existing research regarding community recognition over a Cloud Based environment, based on an experimental evaluation of five real-time datasets.", "venue": "2023 7th International Conference on Electronics, Communication and Aerospace Technology (ICECA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-22", "journal": {"name": "2023 7th International Conference on Electronics, Communication and Aerospace Technology (ICECA)", "pages": "1138-1145"}, "authors": [{"authorId": "2283506185", "name": "Dr.M.Vimaladevi"}, {"authorId": "2283504838", "name": "Dr.S.Selvi Assocaite"}, {"authorId": "2283504290", "name": "Mr.V.Prakasham"}, {"authorId": "2283506182", "name": "Ms. R. Vidhya"}], "citations": []}
