{"paperId": "3a1982fa43edcb5bf94a55f99b728a5d9e799731", "publicationVenue": {"id": "5829b001-258d-45ea-a33d-61f8dd10ea76", "name": "Environmental Science and Technology Letters", "type": "journal", "alternate_names": ["Environ Sci Technol Lett"], "issn": "2328-8930", "url": "https://pubs.acs.org/journal/estlcu"}, "title": "Harnessing Semi-Supervised Machine Learning to Automatically Predict Bioactivities of Per- and Polyfluoroalkyl Substances (PFASs)", "abstract": "Many per- and polyfluoroalkyl substances (PFASs) pose significant health hazards due to their bioactive and persistent bioaccumulative properties. However, assessing the bioactivities of PFASs is both time-consuming and costly due to the sheer number and expense of in vivo and in vitro biological experiments. To this end, we harnessed new unsupervised/semi-supervised machine learning models to automatically predict bioactivities of PFASs in various human biological targets, including enzymes, genes, proteins, and cell lines. Our semi-supervised metric learning models were used to predict the bioactivity of PFASs found in the recent Organisation of Economic Co-operation and Development (OECD) report list, which contains 4730 PFASs used in a broad range of industries and consumers. Our work provides the first semi-supervised machine learning study of structure–activity relationships for predicting possible bioactivities in a variety of PFAS species.", "venue": "Environmental Science and Technology Letters", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-26", "journal": {"name": "Environmental Science & Technology Letters", "pages": "1017 - 1022", "volume": "10"}, "authors": [{"authorId": "145953702", "name": "H. Kwon"}, {"authorId": "144655177", "name": "Z. Ali"}, {"authorId": "144898083", "name": "B. Wong"}], "citations": [{"paperId": "c2987b949db54cdf20076096f5bcdd7617c0d784", "title": "Environmental impact of PFAS: Filling data gaps using theoretical quantum chemistry and QSPR modeling."}, {"paperId": "fcc4191bbd10cdb13fb14a37ae639c493c01a949", "title": "Prediction of the Interactions of a Large Number of Per- and Poly-Fluoroalkyl Substances with Ten Nuclear Receptors"}, {"paperId": "09236ed3f7466913d82bef5a347bb8562fa66866", "title": "An artificial intelligence platform for automated PFAS subgroup classification: A discovery tool for PFAS screening."}, {"paperId": "f01ec9b56f4e032c53a2a9a2baf11664a34e491b", "title": "Can the concentration of environmentally persistent free radicals describe its toxicity to Caenorhabditis elegans? Evidence provided by neurotoxicity and oxidative stress"}, {"paperId": "bd5a8be7714bd41441a2ab69c0dffe0e0bef8e92", "title": "Chemical similarity-based design of materials for organic solar cells: Visualizing the generated chemical space of polymers"}, {"paperId": "a426f65df1ec6d8e874b9991b652f613d9853c83", "title": "PFAS: exploration of neurotoxicity and environmental impact."}, {"paperId": "56e74f59f53e9af0f659dec33cb8780264445466", "title": "Tracing per- and polyfluoroalkyl substances (PFASs) in the aquatic environment: Target analysis and beyond"}, {"paperId": "0d97c156f965f7fe79c0b15391b09b6b38745a4e", "title": "Global classification models for predicting acute toxicity of chemicals towards Daphnia magna."}, {"paperId": "ab11509eed5dcb469fac489ec9f4db51d7313498", "title": "Beyond Conventional Density Functional Theory: Advanced Quantum Dynamical Methods for Understanding Degradation of Per- and Polyfluoroalkyl Substances"}, {"paperId": "ad16928b24d2230de0ffbf125f369ed41f53fdbb", "title": "Digital Transformation in Toxicology: Improving Communication and Efficiency in Risk Assessment"}, {"paperId": "f9116e9366ca3853b8b8bf1c4b24a57ea9353038", "title": "A Review on Per- and Polyfluoroalkyl Substances in Pregnant Women: Maternal Exposure, Placental Transfer, and Relevant Model Simulation"}, {"paperId": "805320bf2edb3041c5dc34fa3cc4d6b4ce09aedc", "title": "Current applications and future impact of machine learning in emerging contaminants: A review"}]}
