{"paperId": "3a40cc4443916381a994305ad22582d692bd5c06", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Modeling and Analysis of First Aid Command and Dispatching System of Cloud Medical System", "abstract": "Nowadays, with the phenomenon of the world ageing getting serious, the demand for intelligent medical treatment becomes higher than past. A series of smart bracelets have been launched for the health of the elderly, which can detect the health condition of the elderly in real-time. When an abnormal phenomenon occurs and the rescue will be needed, it can transmit the signal to the medical platform of the hospital or the mobile phone of its guardian, and then the hospital would send an ambulance and relevant doctors to rescue the patient. This paper mainly studies the starting bracelet sensors to collect data to rescue behavior of the entire process, proposes a Petri net model of distributed resource allocation based on cloud medical system. Through the structural analysis of the model and the construction of the algorithm, the rationality and efficiency of the whole system model are verified, and the case study shows that the model can effectively find the optimal scheduling path and each part of the system can respond well.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-20", "journal": {"name": "IEEE Access", "pages": "168752-168758", "volume": "7"}, "authors": [{"authorId": "153615040", "name": "Menghan Jia"}, {"authorId": "40407638", "name": "Wangyang Yu"}, {"authorId": "13777505", "name": "X. Zhai"}, {"authorId": "2419216", "name": "S. Saha"}], "citations": [{"paperId": "912c7b409c1fb5d6331966ae0217b95da9c53417", "title": "Smart ambulance using IoT for blood transfer facilities"}, {"paperId": "f4b2e8812d2a87aa048e94016e7902616b3a5b49", "title": "Embedded medical platform hardware design and application of antibacterial drugs for respiratory infections"}]}
