{"paperId": "3a43c756aae279ef8ec4ea9b989dd9847d9085ba", "publicationVenue": {"id": "e18027ea-e736-4e3a-b7c3-ae50667d79f5", "name": "Journal of Integrative Bioinformatics", "type": "journal", "alternate_names": ["J Integr Bioinform"], "issn": "1613-4516", "alternate_issns": ["1432-4385"], "url": "https://www.degruyter.com/view/j/jib", "alternate_urls": ["http://journal.imbio.de/"]}, "title": "Towards an Internet of Science", "abstract": "Abstract Big data and complex analysis workflows (pipelines) are common issues in data driven science such as bioinformatics. Large amounts of computational tools are available for data analysis. Additionally, many workflow management systems to piece together such tools into data analysis pipelines have been developed. For example, more than 50 computational tools for read mapping are available representing a large amount of duplicated effort. Furthermore, it is unclear whether these tools are correct and only a few have a user base large enough to have encountered and reported most of the potential problems. Bringing together many largely untested tools in a computational pipeline must lead to unpredictable results. Yet, this is the current state. While presently data analysis is performed on personal computers/workstations/clusters, the future will see development and analysis shift to the cloud. None of the workflow management systems is ready for this transition. This presents the opportunity to build a new system, which will overcome current duplications of effort, introduce proper testing, allow for development and analysis in public and private clouds, and include reporting features leading to interactive documents.", "venue": "Journal of Integrative Bioinformatics", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-30", "journal": {"name": "Journal of Integrative Bioinformatics", "volume": "16"}, "authors": [{"authorId": "2603216", "name": "J. Allmer"}], "citations": [{"paperId": "e2871e8155b12dd134e3eece0ea99c50a5c66c94", "title": "Community-wide collaboration is a must to reinstall trust in bioinformatics solutions and biomedical interpretation"}]}
