{"paperId": "3a45d445a6b540cb75bcb5562a3dadcb2328a844", "publicationVenue": null, "title": "Spectrum Aware Unequal Clustering with Route Selection Protocol for Energy Efficient Cognitive Radio Wireless Sensor Networks", "abstract": "Spectrum awareness with energy conservation is a main prerequisite in Cognitive Radio Sensor Networks (CRSN) as the sensor nodes (SNs) operate in physically unattended areas and are energy constrained. Cluster based routing combined with channel allocation accomplishes energy effective path selection as a countermeasure to preserve energy. It is required to perform reliable routing with cluster based channel distribution contributing to development of network efficiency. Therefore, this study introduces a new Spectrum Aware metaheuristic Unequal Clustering with Route Selection Protocol (SAMUC-RSP) technique for Energy Efficient CRSN. The focus of the SAMUC-RSP technique lies in the effective selection of CHs and routes in the CRSN. For accomplishing this, the SAMUC-RSP technique designs fruit fly optimization algorithm based unequal clustering (FFOA-UC) technique to produce unequal clusters in the CRSN. Besides, moth search optimization based routing (MSOR) approach is used to produce an optimal set of routes in the CRSN. The simulation results of the SAMUC-RSP technique are examined in terms of different measures in python environment. Extensive comparison analysis reported the superior results of the SAMUC-RSP method over other existing techniques in the CRSN.", "venue": "2023 Second International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-23", "journal": {"name": "2023 Second International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "pages": "1401-1406"}, "authors": [{"authorId": "2244000188", "name": "Arthi. A"}, {"authorId": "2174763856", "name": "Chinmay Kumar Nayak"}, {"authorId": "2226525605", "name": "Arunmurugan Subbaiyan"}, {"authorId": "2244006108", "name": "M. Muthalakshmi"}, {"authorId": "2222759966", "name": "Srimathi S"}, {"authorId": "2244000625", "name": "Venkatesh p"}], "citations": []}
