{"paperId": "3a5068ac0804a84e79ef93d41705b65da75792fe", "publicationVenue": null, "title": "Standardization of Humanitarian Project Monitoring and Evaluation using Semantic Web", "abstract": "Around the world, wars and conflicts killed thousands of people, as well as, millions of people are displaced. Millions of people have difficulty accessing even basic services such as clean water, food, a place to live and education. Many humanitarian organizations are trying to alleviate these problems through humanitarian relief by means of works and projects. However, evaluating the success of humanitarian relief through projects can be a difficult task. In this context, Semantic Web technologies can be used to standardize the data obtained from humanitarian project outcomes. In this way, machine-processable data about the humanitarian aid projects cycle can be generated which then can be used for detailed querying and automatic evaluation of project life cycles. This is the aim of our work. We propose a new ontology for humanitarian projects' monitoring and evaluation cycle. We also provide extensive semantic rules to automatically infer project progress and evaluation cycle. In this way, all phases of projects including actors (participants, staff) and project activities can be automatically analyzed and queried. Using extensive semantic rules, we can also infer implicit data about project outcomes.", "venue": "2022 International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-09", "journal": {"name": "2022 International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)", "pages": "1-7"}, "authors": [{"authorId": "2173982679", "name": "Wafaa Ibrahim"}, {"authorId": "144517467", "name": "M. Şah"}], "citations": [{"paperId": "f5d2d4ed66360cc1380fa66f5a1b6df3f060ea00", "title": "A drug prescription recommendation system based on novel DIAKID ontology and extensive semantic rules"}, {"paperId": "f3e76b869cfdb4781e91044a87a5543ebc34a269", "title": "Staff Training Ontology for Humanitarian Organizations"}]}
