{"paperId": "3a50a2d061da1df93ea53ae559d0557be4464e28", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Street Smart in 5G: Vehicular Applications, Communication, and Computing", "abstract": "Recent advances in information technology have revolutionized the automotive industry, paving the way for next-generation smart vehicular mobility. Specifically, vehicles, roadside units, and other road users can collaborate to deliver novel services and applications that leverage, for example, big vehicular data and machine learning. Relatedly, fifth-generation cellular networks (5G) are being developed and deployed for low-latency, high-reliability, and high bandwidth communications. While 5G adjacent technologies such as edge computing allow for data offloading and computation at the edge of the network thus ensuring even lower latency and context-awareness. Overall, these developments provide a rich ecosystem for the evolution of vehicular applications, communications, and computing. Therefore in this work, we aim at providing a comprehensive overview of the state of research on vehicular computing in the emerging age of 5G and big data. In particular, this paper highlights several vehicular applications, investigates their requirements, details the enabling communication technologies and computing paradigms, and studies data analytics pipelines and the integration of these enabling technologies in response to application requirements.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "105631-105656", "volume": "10"}, "authors": [{"authorId": "51492568", "name": "A. Alhilal"}, {"authorId": "32973182", "name": "Benjamin Finley"}, {"authorId": "2136102137", "name": "Tristan Braud"}, {"authorId": "71698917", "name": "Dongzhe Su"}, {"authorId": "2106066733", "name": "Pan Hui"}], "citations": [{"paperId": "f2daf5c43cd0ffc7b1cec03748c0ba4cde3bd37e", "title": "Modeling and Performance Analysis of mmWave and WiFi-Based Vehicle Communications"}, {"paperId": "1851337028690ecbeea3cf622080805db42a6780", "title": "Reinforcement Learning-Based Joint Beamwidth and Beam Alignment Interval Optimization in V2I Communications"}, {"paperId": "43ef8486d2bdb3f85c3cfab90db62389b3c6fd7b", "title": "Smart Transportation System Evolution: a Comprehensive Mapping and Analysis"}, {"paperId": "79df4c620f2236ccf9008ad0f14d2dfba1765e4c", "title": "Effects of Imperfect Hardware and Energy Harvesting Nonlinearity on Wireless Networks"}, {"paperId": "aa94271dfe29bc1a301ede0a312552100c45dc4e", "title": "Antenna Selection in Energy Harvesting NOMA Networks"}, {"paperId": "390fe6a9ee4dc94c624790551b979e5543a85c1b", "title": "Adaptive Multi-Sensor Integrated Navigation System Aided by Continuous Error Map from RSU for Autonomous Vehicles in Urban Areas"}, {"paperId": "812cb31ebf93bb458ca9f041246f5cd9466b73f1", "title": "Toward A Traffic Metaverse With Shared Vehicle Perception"}, {"paperId": "d5c811754ea4acfe60cc5c553b5e177a49379733", "title": "Nonorthogonal multiple access multiple input multiple output communications with harvested energy: Performance evaluation"}, {"paperId": "2a2519ecf6f36f62f993783a399b649ba6f95dfd", "title": "Sustainable Road Planning for Trucks in Urbanized Areas of Chinese Cities Using Deep Learning Approaches"}, {"paperId": "d437ebb82cdc5de38ceba96cbcbd12b5d4abd811", "title": "Smart Streets as a Cyber-Physical Social Platform: A Conceptual Framework"}, {"paperId": "7891a2a1984fd6e32526701819139f7f07e5d6ce", "title": "6G Mobile-Edge Empowered Metaverse: Requirements, Technologies, Challenges and Research Directions"}, {"paperId": "29c7ad6f3a48b8e09bdb5777bebcb9a6d20f5ea3", "title": "Vetaverse: A Survey on the Intersection of Metaverse, Vehicles, and Transportation Systems"}, {"paperId": "13372a55d9291f613db692838b2f4b12067663d1", "title": "Vehicular Ad Hoc Network Interference Mitigation Using Digital Beamforming Approach in Roundabout Scenarios"}, {"paperId": "01567abc0357fde8ca170520033d69555705ba52", "title": "Vetaverse: Technologies, Applications, and Visions toward the Intersection of Metaverse, Vehicles, and Transportation Systems"}]}
