{"paperId": "3a526c18a885d03535308078bc734649e012b82d", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "An Improved Deep Spatial-Temporal Hybrid Model for Bus Speed Prediction", "abstract": "For resolving or alleviating the transportation problems, it is necessary to efficiently manage the public transportation and provide public transport services with high quality and advocate green travel, which rely on accurate traffic data. In order to obtain more accurate bus speed in the future, this paper proposed a novel dynamic hierarchical spatial-temporal network model based on Grey Relation Analysis (EGRA), the convolutional neural network (CNN), and the gated recurrent unit (GRU). The proposed model is named the DHSTN; it exploited EGRA to analyze and choose the suitable candidate line sections with high impacts on the target section and, then, construct a multilayer structure based on the CNN, GRU, and attention mechanism to analyze and capture the spatial and temporal dependency, and finally, the extreme learning machine (ELM) is exploited for the fusion of the long-term and short-term dependency to predict the bus speed variation in the next time interval. Comparative experiments indicate that the DHSTN has better performances, the mean absolute error is around 2.6, and it meets the real requirements.", "venue": "Mathematical Problems in Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-27", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "40568586", "name": "Huawei Zhai"}, {"authorId": "3211045", "name": "Licheng Cui"}, {"authorId": "33694401", "name": "Weishi Zhang"}, {"authorId": "2118502044", "name": "Xiaowei Xu"}, {"authorId": "2066088503", "name": "Ruijie Tian"}], "citations": [{"paperId": "bfc03d0b325e2d58776e472356a980116052407c", "title": "Research on a hybrid modeling method of a spiral bevel gear based on cutter simulation"}, {"paperId": "4f4094926a91a491811e768d4284e86a87c72065", "title": "Travel time prediction based on route links’ similarity"}, {"paperId": "37071f24319c47bb02d43b0289dea28a3eee2194", "title": "Predicting Bus Travel Time with Hybrid Incomplete Data – A Deep Learning Approach"}, {"paperId": "608f1bbd6db825d8b6587a4411a95e749d2c477e", "title": "Impact of Altruistic Preference and Government Subsidy on the Multinational Green Supply Chain under Dynamic Tariff"}]}
