{"paperId": "3a565b215ca755021eecd1e6b89154f7e676a9f8", "publicationVenue": null, "title": "Survey on Integration of Consensus Mechanisms in IoT-based Blockchains", "abstract": "While IoT systems are increasingly present in different areas of society, ensuring their data’s privacy, security, and inviolability becomes paramount. In this direction, Blockchain has been used to protect the security and immutability of data generated by IoT devices and sensors. At the heart of Blockchain solutions, consensus algorithms are crucial in ensuring the security of creating and writing data in new blocks. Choosing which consensus algorithms to utilise is critical because of a fundamental tradeoff between their security strength and response time. However, recent surveys of consensus mechanisms for IoT-based Blockchain focused on individually using and analysing these algorithms. Investigating the integration between these algorithms to address IoT-specific requirements better is a promising approach. In this context, this paper presents a literature review that explains and discusses consensus algorithms in IoT environments and their combinations. The review analyses eight dimensions that help understand existing proposals: ease of integration, scalability, latency, throughput, power consumption, configuration issues, integrated algorithms, and adversary tolerance. The final analysis also suggests and discusses open challenges in integrating multiple consensus algorithms considering the particularities of IoT systems.", "venue": "Journal of universal computer science (Online)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-28", "journal": {"name": "J. Univers. Comput. Sci.", "pages": "1139-1160", "volume": "29"}, "authors": [{"authorId": "2286895324", "name": "Anderson Melo de Morais"}, {"authorId": "1906531", "name": "F. Lins"}, {"authorId": "2292274930", "name": "Nelson Souto Rosa"}], "citations": [{"paperId": "64d0875250013c92aa40be57ed90c3b4fa597837", "title": "A Survey of Consortium Blockchain and Its Applications"}, {"paperId": "f1315e823cb4fd3ffa45966577d563bc3552b77b", "title": "Exploring the Potential of Blockchain Technology in an IoT-Enabled Environment: A Review"}]}
