{"paperId": "3a61762f6aa37a8abe642d520ee036b41e464950", "publicationVenue": {"id": "64892184-bfd8-465b-9de9-282cc4bddf19", "name": "International Journal of Computations Information and Manufacturing (IJCIM)", "type": "journal", "alternate_names": ["Int J Comput Inf Manuf (IJCIM"], "issn": "2790-2412"}, "title": "Blockchain Convergence: Analysis of Issues Affecting IoT, AI and Blockchain", "abstract": "The purpose of this study is to appraise the integration or convergence issues influencing the mutual functioning of blockchain, AI, and IoT. The study argued that the recent developments in the field of IoT and blockchain prediction have involved the integration of innumerable classification schemes to establish a hybrid model. The introduction of the hybrid technique relies on the prediction performance that strives to override the limitations of any available architectural scheme. This study offers a comprehensive exploratory appraisal of the issues influencing the successful integration of IoT and blockchain in regards to functionality and effectiveness of security, trust, and flawless communication issues. The exploratory research methodology was used in analyzing the issues affecting the integration of blockchain, artificial intelligence (AI), and the internet of things (IoT). The findings indicated that the integration challenges influencing the effective operations of blockchain, AI, and IoT as a single system involve security, scalability, accountability, and trust of communications. The study recommends that successful and effective integration will enhance the development of new business models as well as the digital transformation of market corporations. Accordingly, new approaches to convergence should ensure that executives address the new technology demands to obtain significant gains in efficiency.", "venue": "International Journal of Computations Information and Manufacturing (IJCIM)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-19", "journal": {"name": "International Journal of Computations, Information and Manufacturing (IJCIM)"}, "authors": [{"authorId": "97584863", "name": "S. Guergov"}, {"authorId": "2066029007", "name": "Neyara Radwan"}], "citations": [{"paperId": "68005c9562d7c151f47a66c912d082f43a5fe227", "title": "Entrepreneurship and Innovation in the Age of Artificial Intelligence: A Blockchain Approach"}, {"paperId": "61b45384acb7ea3e552c3a034835f4b46c0a4c0b", "title": "Impact Of Using AI On Supply Chain Operation Using Blockchain Technology"}, {"paperId": "6c80d720e927e16ca4bf3e921a0f65f7c80ae37a", "title": "Approaching Quality 4.0: The Digital Process Management as a Competitive Advantage"}, {"paperId": "c2493c3b2ea25cb9bb17ae19bd6e9e46ee128e62", "title": "The Impact of Digital marketing and Digital Payment on Financial Performance"}, {"paperId": "5be8de3f3e7f7d3bc2d0c30153430d3a52582f6a", "title": "Impact of Digital Payment Systems and Blockchain on Economic Growth"}, {"paperId": "b945e71677d2d7fb362779068b345c05e484b3d5", "title": "The Blockchain Technology Integration with Internet of Things for Digital supply Chain Transformation"}, {"paperId": "c367126d15c66032beaf0f71f840391188fa2042", "title": "Impact of Open Big Data and Insurtech on Business Digitalization"}, {"paperId": "4b67a68dbb98e0666922c3179a47cd299132db3f", "title": "The Role of Big Data tools and Supply Chain Capabilities in Promoting Supply Chain Sustainability: Insights using Balanced Scorecard Approach"}, {"paperId": "44cbc6203801ed5cbd15c9bb649082c91ea94589", "title": "The impact of Internet of Things (IoT) and Logistics Activities on Digital Operations"}, {"paperId": "5ea3e3dda63a8efc2449e40ab5751577e83f6a75", "title": "The Role of Artificial Intelligence in Mitigating Cyber Security Issues and its Impact on FinTech"}, {"paperId": "97be5329be27b1aa6be9d23fa46d2bf32fb2cd13", "title": "Goldonomics: Cryptocurrency vs. Gold; Which is a Better Store of Value in the Global"}, {"paperId": "afd62354be65a492c52c9f225171c967114d7e95", "title": "THE IMPACT OF SERVICE QUALITY AND SERVICE TRANSPARENCY ON CUSTOMER SATISFACTION"}, {"paperId": "41d96d9d5bfc8685841aafd9982672e7743cbb54", "title": "IMPACT OF INFORMATION TECHNOLOGIES CAPABILITIES AND INFORMATION SYSTEM CAPABILITIES ON BUSINESS PROCESS MANAGEMENT"}, {"paperId": "0fc92fc6040c1630a9a2b912737f8128deeb64bb", "title": "Confluence of Artificial Intelligence and Blockchain Powered Smart Contract in Finance System"}, {"paperId": "febf9115dbbbd014cee6416b112e1d84e826ee87", "title": "EXTREME PROGRAMMING VS SCRUM: A COMPARISON OF AGILE MODELS"}, {"paperId": "94c9499c26701ca072db963b6b61c09ab9c2b5e6", "title": "deck of cards to help track design trends to assist the creation of new products"}, {"paperId": "a800246eafc13fc8b4f203a57192eec85d65fdff", "title": "AI in Blockchain Towards Realizing Cyber Security"}, {"paperId": "d5b5c76bc9bb0add8b3442a6a8ff69cebf669afe", "title": "Management and Treatment of Type 2 Diabetes"}, {"paperId": "d57c8774acaed33f6e0b389b16c749b6e866e89a", "title": "THE ROLE OF VR GAMES TO MINIMIZE THE OBESITY OF VIDEO GAMERS"}, {"paperId": "a175f818a32700114642a73f2969dd30302fcd49", "title": "THE INTERNET’S ROLE IN UNDERMINING THE CREDIBILITY OF THE HEALTHCARE INDUSTRY"}, {"paperId": "384bea3233cb5479646a0af5a9835e54444dff97", "title": "MACHINE LEARNING FOR INTELLIGENT ENERGY CONSUMPTION IN SMART HOMES"}, {"paperId": "07ecd09b5151362a13054679a2e84c0c7c260518", "title": "IMPROVING HOME SECURITY USING BLOCKCHAIN"}, {"paperId": "6d747eff91fd48dc7ee54b6b0def61be1df9ef68", "title": "STUDYING HUMAN ROBOT INTERACTION AND ITS CHARACTERISTICS"}, {"paperId": "e211c0f616304e1c0b415873c6b6a14ae7ea8cc2", "title": "THE IMPLEMENTATION OF ENTERPRISE RESOURCE PLANNING (ERP) IN THE UNITED ARAB EMIRATES: A CASE OF MUSANADA CORPORATION"}, {"paperId": "989059cbadfd1087ae812e32a98350650c2c4b0a", "title": "INVESTIGATING THE FACTORS THAT INFLUENCE STUDENTS` CHOICE OF ENGLISH STUDIES AS A MAJOR: THE CASE OF UNIVERSITY OF NOUAKCHOTT AL AASRIYA, MAURITANIA"}, {"paperId": "b5ea3e61a4dfeaec3b38cfad7909830ffa51a032", "title": "THE IMPACT OF ARTIFICIAL INTELLIGENCE ON THE EFFECTIVE APPLYING OF CYBER GOVERNANCE IN JORDANIAN COMMERCIAL BANKS"}, {"paperId": "31bec69eef7925727f6a60e823ff17967bf4b46d", "title": "Digital Transformation and SMART-The Analytics factor"}, {"paperId": "62c4c7b79a63bc173f79b648f5661ddd124420fc", "title": "Vocabulary Taught Via Mobile Application Gamification: Receptive, Productive and Long-Term Usability of Words Taught Using Quizlet and Quizlet Live"}, {"paperId": "eb6502af12a22ece81a26b689f19ffcd2b117d8c", "title": "The Effect of Artificial Intelligence Using Neural Network in Estimating on An Efficient Accounting Information System: Evidence from Jordanian Commercial Banks"}, {"paperId": "dacdd561017edb47f393304ea70a912f0300ce7d", "title": "Named Entity Recognition using Deep Learning: A Review"}, {"paperId": "57475d60b92ba879e4776471558e9a7bac519237", "title": "FinTech, Regulation, and Cybercrime: Opportunities Arising From New Technologies"}, {"paperId": "873ed3067e8175b7bba033c6b2bcb300ad9dded1", "title": "Exploring the Joint Potential of Blockchain and AI for Securing Internet of Things"}, {"paperId": "617e2fd08f6b1b4f9a8391c888362dc3f6dc0179", "title": "Enhancing IoT Security with Deep Stack Encoder using Various Optimizers for Botnet Attack Prediction"}, {"paperId": "0f151bf675bd6dfeeac2fc169abb3d7568eb0544", "title": "YOLO and Faster R-CNN Object Detection in Architecture, Engineering and Construction (AEC): Applications, Challenges, and Future Prospects"}, {"paperId": "2d0cb59db6532b0a54fc51e22cd2177451ff0eac", "title": "IMPACT OF PROCESS VISIBILITY AND WORK STRESS TO IMPROVE SERVICE QUALITY: EMPIRICAL EVIDENCE FROM DUBAI RETAIL INDUSTRY"}, {"paperId": "696675e739db737b3181f4bb32718ba9b7d70aef", "title": "A COINTEGRATION ANALYSIS FOR THE VALIDITY OF PURCHASING POWER PARITY: EVIDENCE FROM MIDDLE EAST COUNTRIES"}, {"paperId": "7f9275d4c276865ae979eaef43f4211b5c98c11e", "title": "BEHAVIOUR OF INVESTMENT RETURNS IN THE DISINVESTMENT ENVIRONMENT: THE CASE OF POWER INDUSTRY IN INDIAN CPSEs"}]}
