{"paperId": "3a68ae42d4606c75f2254d989cf9af3771847244", "publicationVenue": null, "title": "A NEW SOYBEAN NDVI DATA-BASED PARTITIONING ALGORITHM FOR FERTILIZATION MANAGEMENT ZONING", "abstract": "With the broad application of management zoning, various partitioning algorithms are used for this purpose. The K-means algorithm is the most widely used method with the best performance. We proposed a model-based partitioning algorithm based on the K-means algorithm that does not need to process all the data in each computational iteration and thus is able to improve the management zoning speed. We constructed a calculation model for management zone partitioning using 2000 normalized difference vegetation index (NDVI) values. This model was then used to partition the next 2000 points of NDVI data acquired, and the model was updated after each 2000 NDVI values until the management zoning computation was completed for the entire field. Based on both internal evaluation indicators (the sum of squared errors (SSE) and silhouette coefficient (SC)) and external evaluation indicators (the Rand index (RI) and homogeneity), we compared the clustering performance of the two algorithms in management zone partitioning and found that when the amount of NDVI data reaches 8000 values, the proposed method achieves a management zone partition result similar to that of the conventional K-means algorithm but is faster. This advantage becomes increasingly profound as the data volume", "venue": "", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Applied Ecology and Environmental Research", "pages": "1391-1405", "volume": "19"}, "authors": [{"authorId": "2138753093", "name": "Huai Chen"}, {"authorId": "47119308", "name": "X. Wang"}, {"authorId": "49039436", "name": "W. Zhang"}, {"authorId": "2152795696", "name": "X. Wang"}, {"authorId": "2045211445", "name": "X. Di"}, {"authorId": "2114129999", "name": "L. Qi"}], "citations": [{"paperId": "df5b2e704998d34c9d31d93e9c1782f4d4e3916b", "title": "Automatic Crop Classification Based on Optimized Spectral and Textural Indexes Considering Spatial Heterogeneity"}, {"paperId": "cbfa9e888ec0a570f11e1804dbf0545a6d749c05", "title": "APPLYING NDVI FROM DIFFERENT NUMBER OF SPECTRAL SENSORS IN DELIMITING SOYBEAN FERTILIZATION MANAGEMENT ZONES"}]}
