{"paperId": "3a72136cdf83cfe6dded02e1d5ee3826764bc47e", "publicationVenue": null, "title": "BlockFlow: Trust in Scientific Provenance Data", "abstract": "In scientific collaboration, the data sharing, the exchange of ideas and results is crucial to promote knowledge and accelerate the development of science. Trust is extremely important in this context as well as reproducibility. Although in scientific workflow the provenance has been the basis for reproducibility, in collaborative environments it is necessary to ensure integrity and trustworthiness of this provenance data. One of the technologies that have emerged and can help to address these issues is blockchain. A blockchain-based provenance system for collaborative scientific experiments could lead to a trustworthy environment for scientific experimentation. In this vein, this paper presents the specification of an architecture, named BlockFlow, that provides trust for distributed provenance data.", "venue": "Anais do Brazilian e-Science Workshop (BreSci)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-06-24", "journal": {"name": "Anais do Brazilian e-Science Workshop (BreSci)"}, "authors": [{"authorId": "1576164525", "name": "Raiane Coelho"}, {"authorId": "1804523", "name": "Regina M. M. Braga"}, {"authorId": "145726268", "name": "J. M. David"}, {"authorId": "144763283", "name": "Fernanda Campos"}, {"authorId": "3458069", "name": "Victor Ströele"}], "citations": [{"paperId": "abee8ca38e6941a96385e35e07b837acfaf63ad2", "title": "ForensiBlock: A Provenance-Driven Blockchain Framework for Data Forensics and Auditability"}, {"paperId": "3372d5dab7460aa236053d6161265763f0249088", "title": "SciLedger: A Blockchain-based Scientific Workflow Provenance and Data Sharing Platform"}, {"paperId": "a9fc6248a25ac06d1e04d453f1113bf4fed72b6f", "title": "A Blockchain-based Framework in Support of Privacy Preferences Enforcement for Scientific Workflows : (Invited Paper)"}, {"paperId": "7f53540190eb277dc4e4727ce42fa0ada192cf87", "title": "Uso de Blockchain na Indústria 4.0: Uso do Hyperledger Fabric no projeto FASTEN"}, {"paperId": "9add6c05d5ec9b3bd53264a16eb98bae0b4bf13f", "title": "Blockchain for Reliability in Collaborative Scientific Workflows on Cloud Platforms"}, {"paperId": "becfa328c50baeaee24115421e93c4101f441061", "title": "SciBlock: A Blockchain-Based Tamper-Proof Non-Repudiable Storage for Scientific Workflow Provenance"}]}
