{"paperId": "3a7c593d25f7034984afd599e439626f495c5bae", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Energy efficient reliable data transmission for optimizing IoT data transmission in smart city", "abstract": "The rapid proliferation of the internet of things (IoT) technology has significantly transformed urban landscapes, giving rise to smart city frameworks that leverage interconnected devices for enhanced efficiency and functionality. In these environments, vast amounts of data are generated by diverse sensors and devices, necessitating advanced strategies for effective data collection and transmission. This paper introduces a novel approach to address data collection and transmission challenges in IoT-enabled smart city frameworks. The proposed design integrates IoT-Cloud for efficient data collection and employs the energy efficient reliable data transmission (EERDT) model, optimizing IoT data transmission. The enhanced dragonfly routing algorithm, incorporating the firefly algorithm, enhances data routing efficiency. Experimental results demonstrate EERDT's superiority over energy-aware iot-routing (EAIR) and location-centric energy-harvesting aware-routing (LCEHAR), revealing significant improvements in communication overhead, data processing latency, and network lifetime. The EERDT exhibits substantial reductions in communication overhead, enhancing overall network performance. The EERDT model showcases lower data processing latency and energy consumption, highlighting its potential for resource-efficient IoT data transmission. This work contributes an innovative solution for smart city IoT networks, emphasizing performance enhancements and resource efficiency.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-06-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2295336376", "name": "Ruchita Ashwin Desai"}, {"authorId": "2295380238", "name": "Raj Bhimashankar Kulkarni"}], "citations": []}
