{"paperId": "3a87e922645e17a2a73718c132f7fabfd17b405d", "publicationVenue": {"id": "d2c0e84d-737d-4fe1-93b0-6c188f261f3c", "name": "International journal of advanced networking and applications", "type": "journal", "alternate_names": ["Int j adv netw appl", "International Journal of Advanced Networking and Applications", "Int J Adv Netw Appl"], "issn": "0975-0290", "url": "http://www.ijana.in/"}, "title": "Feature Selection Methods for Classifying Email Messages: Analysis, Proposal, and Comparative Study", "abstract": "Sanaa Abou Elhamayed Department of Informatics Research, Electronics Research Institute, Cairo, Egypt Email:sanaa-hamayed@hotmail.com Samah Osama M. Kamel Department of Informatics Research, Electronics Research Institute, Cairo, Egypt Email: samah_n2003@yahoo.com ----------------------------------------------------------------------ABSTRACT----------------------------------------------------------Spam Email messages have a big problem either for users or for the Internet service providers. The content of such messages may contain viruses and bad information. The spam messages also occupy a huge amount of space on the mail boxes. So, the process of Emails' classification is very important to be analyzed and discussed. This research work aims at classifying the email messages into either spam or non-spam. The E-mail messages or a dataset can be represented in a matrix form. The rows of the matrix are representing the instances (messages) while the columns are representing the features of such instances. K-Nearest Neighbor (KNN) and Naïve Bayes (NB) are two classifiers where they are used to classify the email messages. The proposed approach based on partitioning the dataset into segment and compared with the adopted approach. Moreover, feature selection methods are adopted to choose the significant features and eliminate the others to avoid processing overheads. The choice of the relevant features plays an important role of the classification accuracy. In this work, some feature selection methods are adopted, analyzed, and operated. The performance of such methods is compared. Moreover, a feature selection method is proposed and discussed. The performance of the proposed feature selection method is compared with the adopted ones. This work is operated on a chosen dataset taken from the Internet. The dataset contains about four-thousand messages with fifty-eight features. Moreover, the dataset is supported with a target feature representing the class labels. From the practical experiments it is shown that the performance of the proposed method is better than the adopted ones. It is also expected that the proposed method is applicable to other datasets for other application domains.", "venue": "International journal of advanced networking and applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Networking and Applications"}, "authors": [{"authorId": "148038481", "name": "S. Elhamayed"}, {"authorId": "47648607", "name": "S. O. M. Kamel"}], "citations": [{"paperId": "8c89ee8ab5e583f5b009e46d36c2cb4bd8b59856", "title": "An Overview of Automatic Text Summarization Techniques"}]}
