{"paperId": "3a9b18d5d99d4319fe76bc48d161dba23bc691e1", "publicationVenue": {"id": "f0455aa5-b1f5-47b0-afdb-accda588a9c4", "name": "Frontiers of Physics", "type": "journal", "alternate_names": ["Frontiers of Physics in China", "Frontiers in Physics", "Front Phys China", "Front Phys"], "issn": "2095-0462", "alternate_issns": ["2296-424X"], "url": "http://journal.hep.com.cn/fop/EN/2095-0462/home.shtml", "alternate_urls": ["https://www.frontiersin.org/journals/physics", "http://www.frontiersin.org/Physics", "http://www.frontiersin.org/Physics/archive", "http://www.springer.com/physics/journal/11467"]}, "title": "Typical Modes of the Wind Speed Diurnal Variation in Beijing Based on the Clustering Method", "abstract": "Wind speed is an important meteorological condition affecting the urban environment. Thus, analyzing the typical characteristics of the wind speed diurnal variation is helpful for forecasting pollutant diffusion. Based on the K-means clustering method, the diurnal variation characteristics of the wind speed in Beijing during 2008–2017 are studied, and the spatiotemporal characteristics of the wind speed diurnal variations are analyzed. The results show that there are mainly five to seven clusters of typical characteristics of the wind speed diurnal variation at different stations in Beijing, and the number of clusters near the city is smaller than that in the suburbs. The typical number of the wind speed diurnal variation during 2013–2015 is smaller than that in other periods, which means the anomalous clusters of the diurnal variation are reduced. Besides, the numbers of different clusters in different years are often switched. Especially, the switch between clusters five and six and the switch between clusters six and seven are frequent. Based on the second cluster analysis of the clustering results at the Beijing station, we find 12 clusters of the diurnal variation, including nine clusters of “large in the daytime, while small at night,” two clusters of “monotonous,” and one cluster of “strong wind.” Furthermore, the low-speed clusters of wind mainly locate in the city with a significant increasing trend, while the high-speed clusters and the monotonous clusters of wind locate in the suburbs with a decreasing trend.", "venue": "Frontiers of Physics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"volume": "9"}, "authors": [{"authorId": "50562123", "name": "P. Yan"}, {"authorId": "103459553", "name": "Dongdong Zuo"}, {"authorId": "2109483921", "name": "Ping Yang"}, {"authorId": "2050147773", "name": "Suosuo Li"}], "citations": [{"paperId": "caeb64164ee004a018531abebd96925d41e04870", "title": "Research on the Identification of Typical Terrain Patterns in Yunnan Province Based on the K-Means Technology"}, {"paperId": "98a1a1f4e8e06065d1c8cc06bd6114e1d323c924", "title": "Comparison of Deterministic Wind Speed Generation Models for Wind Erosion Modeling"}, {"paperId": "e8749e5ce82d4d2f9a2f491db3a3b49511efea9e", "title": "Wind and Sea Breeze Characteristics for the Offshore Wind Farms in the Central Coastal Area of Taiwan"}]}
