{"paperId": "3aa2fdd48d2e084fed124239e4c5012067fe866c", "publicationVenue": {"id": "bdc1e449-645b-4e9a-a531-6c02de3188a6", "name": "International Conference on Computer Science and Network Technology", "type": "conference", "alternate_names": ["ICCSNT", "Int Conf Comput Sci Netw Technol"]}, "title": "A document-relation associated query system based on distributed middleware", "abstract": "For the widely existing document and relation mixed-type data, this paper proposes a system of storage and query for associated mixed-type data based on the distributed middleware. It adopts distributed middleware as technological tools to integrate databases of different types, which achieves adaptive and efficient data storage performance for document and relation type data. Furthermore, the hybrid data query mechanism is provided to extend the query object of SQL statement. In addition, the extended SQL operators such as a fuzzy join are implemented to realize the associated query between document data and relation data. In the proposed system, the upper layer uses SQL as query language, while the function can be extended to realize the associated matching query between document and relation data. The concrete execution plan is pushed to each node, so the proposed system could execute the query plan adaptively, which is an effective attempt for multisource and heterogeneous data management.", "venue": "International Conference on Computer Science and Network Technology", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2016-12-01", "journal": {"name": "2016 5th International Conference on Computer Science and Network Technology (ICCSNT)", "pages": "309-314"}, "authors": [{"authorId": "2053314060", "name": "Hao Xue"}, {"authorId": "50469060", "name": "Mei Wang"}], "citations": [{"paperId": "d3c2085da9d1d95cda2ffe2aedcf2c9c10e41e92", "title": "Technological Processes of Working with Documented Information in the Organization as an Indicator of Corporate Information Subculture"}]}
