{"paperId": "3aab069adf185e8beefdce18c8546f0e100251cd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "LASIGE and UNICAGE solution to the NASA LitCoin NLP Competition", "abstract": "Biomedical Natural Language Processing (NLP) tends to become cumbersome for most researchers, frequently due to the amount and heterogeneity of text to be processed. To address this challenge, the industry is continuously developing highly efficient tools and creating more flexible engineering solutions. This work presents the integration between industry data engineering solutions for efficient data processing and academic systems developed for Named Entity Recognition (LasigeUnicage\\_NER) and Relation Extraction (BiOnt). Our design reflects an integration of those components with external knowledge in the form of additional training data from other datasets and biomedical ontologies. We used this pipeline in the 2022 LitCoin NLP Challenge, where our team LasigeUnicage was awarded the 7th Prize out of approximately 200 participating teams, reflecting a successful collaboration between the academia (LASIGE) and the industry (Unicage). The software supporting this work is available at \\url{https://github.com/lasigeBioTM/Litcoin-Lasige_Unicage}.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-10", "journal": {"name": "ArXiv", "volume": "abs/2308.05609"}, "authors": [{"authorId": "153603727", "name": "Pedro Ruas"}, {"authorId": "2066427084", "name": "Diana Sousa"}, {"authorId": "2055379724", "name": "André M. M. Neves"}, {"authorId": "2198490591", "name": "Carlos Cruz"}, {"authorId": "1721340", "name": "Francisco M. Couto"}], "citations": [{"paperId": "3b494b3b7b0b2013c0a036c9aa1868af807f8714", "title": "HunFlair2 in a cross-corpus evaluation of biomedical named entity recognition and normalization tools"}, {"paperId": "900f166085dfe7a068e0a3eb608bc6de6187debc", "title": "HunFlair2 in a cross-corpus evaluation of named entity recognition and normalization tools"}]}
