{"paperId": "3ac75414cbb3a056bcd298748bb0e5df344093e3", "publicationVenue": null, "title": "Location-Based Optimized Service Selection for Data Management with Cloud Computing in Smart Grids", "abstract": "To maximize the utilization, reliability and availability of power resources, some distribution strategy has to be implemented, which is possible nowadays with the support of modern information technologies (IT). To further develop power utilization, the customer should be aware of efficient power utilization, and the problem of customer management has to be resolved, where payment of electric bills could be through online solutions. A customer-aware power regulatory model is proposed that provides awareness to the consumer regarding the usage of electrical energy, in a secure and reliable solution that combines the features of electrical engineering with cloud computing to ensure better performance in notifying issues, which is done based on location and enhances the operation of smart grids. Instant electric meters are equipped with remote gadgets which communicate with a central cloud administration to produce electric bills for the client. The model provides mindfulness by showing history/notifications and suggestions for energy utilization through the smart meters. The user is provided with security keys to view the reading values and pay bills. To make the solution more accessible, the electronic data will be maintained on various servers at different locations of the cloud. Subsequently, there will be a service provider who manages service requests. A hardwired electric meter transmits the electric readings, which in turn access the particular service to make an entry for the particular connection on the cloud. The usage data will also be maintained at different locations in the cloud, which are accessible to different levels of users with appropriate security measures. The user accessibility is controlled by a Third Party Auditor (TPA) that computes the trustworthiness of users using a trust management scheme. This article also proposes a hash function, which computes and verifies the signature of the keys submitted by the users and also has a higher completeness ratio, which reaches 0.93, than typical methods. This is noteworthy, and the investigation results prove the system’s proficiency in providing assured service.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-11-27", "journal": {"name": "Energies", "pages": "4517", "volume": "12"}, "authors": [{"authorId": "98336436", "name": "C. Sivapragash"}, {"authorId": "2129084817", "name": "Padmanaban"}, {"authorId": "2129181389", "name": "Eklas"}, {"authorId": "2129164660", "name": "Holm-Nielsen"}, {"authorId": "2129195715", "name": "Hemalatha"}], "citations": [{"paperId": "1693c80568d3505d9099fa5da7b3cef255f72743", "title": "Research on the Innovation of Science and Technology Management Data Service Mode under Artificial Intelligence Technology"}, {"paperId": "d600762995f93247696bdaf2cc8b7308561b1348", "title": "The Smart Performance Analysis of Reliability based Optimization Service for Secured Cloud Servers using Priority based Scheduling"}, {"paperId": "c78062c8c1d6b3106c4d1e3e8f534746a58a246e", "title": "Adoption of Cloud Computing in E-Government: A Systematic Literature Review"}, {"paperId": "025ecad164fb35caf0f71f2abbe3c41e7ac2b45a", "title": "Role of Smart Buildings in Smart City—Components, Technology, Indicators, Challenges, Future Research Opportunities"}, {"paperId": "9cdad2b4c411d6dc939018f16394319d420fbbf2", "title": "Privacy-Preserving Multidimensional Data Aggregation Scheme Without Trusted Authority in Smart Grid"}, {"paperId": "8345a43fb9a7ad12547126a4acd3fa9f39396f1f", "title": "Proposal for a new layer for energy cloud management: The regulatory layer"}, {"paperId": "7d17d7d910368fd331352c5af4773067fa6cf6b7", "title": "Management Challenges and Opportunities for Energy Cloud Development and Diffusion"}, {"paperId": "7335c668600d7fea117d206b3a5de9d2df558062", "title": "A Decade Review on Smart Cities: Paradigms, Challenges and Opportunities"}, {"paperId": "fd3351cb9b1607542a26ffff376fd60571370035", "title": "Evolution of Smart Home Energy Management System Using Internet of Things and Machine Learning Algorithms"}, {"paperId": "608c824de3e7aca7acc3cbc24f57e1d6243e37f5", "title": "Permeability evaluation of Industry 4.0 technologies in cloud-based energy management systems environments - Energy Cloud"}, {"paperId": "2f4d8cd68c5e73f5ad4b77abfe014a4289eb599b", "title": "TPA in Cloud Computing Needs Secure and Reliable Cloud\nServices"}]}
