{"paperId": "3acaf0ef1181e5c61590f61b5bfb646164f967d6", "publicationVenue": {"id": "aa498b93-1449-4650-8ded-a81fefc804e3", "name": "International journal of real estate studies", "type": "journal", "alternate_names": ["Int j real estate stud"], "issn": "1823-8505", "url": "http://www.ifrj.upm.edu.my/"}, "title": "Estate Surveyors and Valuers’ Perception of the Role of Big Data in Property Marketing in Lagos, Nigeria", "abstract": "Property marketing in Nigeria has frequently been characterised by unique challenges due to inadequate and unreliable data. In recent times, big data has presented a wide range of solutions to contemporary issues in different industries, including real estate. Notwithstanding, there is a paucity of practical studies on the role of big data in property marketing of many developing nations, including Nigeria. Hence, there is a need to investigate the role of big data in transforming property marketing in Nigeria. The aim of this study is therefore to investigate Estate Surveyors and Valuers’ (ESVs) perception of the role of big data in property marketing in Lagos, Nigeria. 82 questionnaires were administered to ESVs in the study area and 55 (67%) of them were found useful for analysis. The data were analysed using frequency, percentage, mean and relative importance index. The results revealed that out of 9 possible roles of big data in property marketing, the 2 most notable ones are that real estate firms can execute laser-focused marketing strategies; and they can match demand with supply. These outcomes distinctly disclosed the merits of adopting big data in marketing properties. The implication of these findings is that big data has the potential of reducing fraud due to the presence of sufficient and reliable data in the property market. This study concludes that big data is a worthy addition to the toolset of real estate practitioners, particularly with respect to property marketing, and wholly recommends its adoption.", "venue": "International journal of real estate studies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-29", "journal": {"name": "International Journal of Real Estate Studies"}, "authors": [{"authorId": "84495180", "name": "A. Oluwunmi"}, {"authorId": "2285268599", "name": "Bolatito Alison Role"}, {"authorId": "101505926", "name": "O. Umeh"}], "citations": []}
