{"paperId": "3ad3f8962b7e21176047540d680d622e3a4b8841", "publicationVenue": null, "title": "An Approach to Criminal Suspect Prediction Software using Machine Learning Classifiers", "abstract": "The goal and the objective of this project is to predict the suspect of criminal and its location by analyzing criminal records and finding criminal hotspots. Investigations in India regarding larceny are very futile in nature and seldom result in apprehension of the criminal. Our software is for police officials to lead their investigation effectively and work towards capturing the unrighteous using data analytics thereby uncovering theft and criminal trends. Such trends lead to uncovering dimensions for an investigation which are difficult to recognize through manual inspection techniques. Such software is not only helpful for the police for effective and smart work in case of low-profile crimes but also the increase in arrests for larceny would ultimately lead to low crime rate and a lawful society. The inclusion of machine learning technique such as KNN technique is used to suspect the criminal by analyzing its data. Through the use of such software for police work in the hope of reduction in crime rate is a progressive step forward for Digital India.", "venue": "2022 International Conference on Computing, Communication, and Intelligent Systems (ICCCIS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-04", "journal": {"name": "2022 International Conference on Computing, Communication, and Intelligent Systems (ICCCIS)", "pages": "885-889"}, "authors": [{"authorId": "9079638", "name": "Ashima Arya"}, {"authorId": "2205235511", "name": "Mitu Sehgal"}, {"authorId": "2205197832", "name": "Neha Bhatia"}, {"authorId": "2170264606", "name": "Nitisha Aggarwal"}, {"authorId": "71335455", "name": "Shiraz Khurana"}], "citations": [{"paperId": "55554feeb1b77f5580b1914d3e858be766eb28ee", "title": "Facial Recognition for Crime Control: A Machine Learning-based Solution"}]}
