{"paperId": "3ad813f111071114b21d33d43856662689519629", "publicationVenue": {"id": "9d8da7ea-fb6b-4a25-9420-a59a97e00a64", "name": "Journal of Quality in Maintenance Engineering", "type": "journal", "alternate_names": ["J Qual Maint Eng"], "issn": "1355-2511", "url": "https://www.emerald.com/insight/publication/issn/1355-2511"}, "title": "Lean maintenance index: a measure of leanness in maintenance organizations", "abstract": "PurposeMaintenance organizations continue to be under pressure to systematically eliminate maintenance wastes and deliver services that their customers value. To this end, maintenance managers are implementing lean maintenance practices. But how does one consistently estimate the leanness of these practices in their organization? The purpose of this paper is to develop a framework for a metrics – referred to as the lean maintenance index (LMI) that can help managers estimate the leanness of maintenance practices.Design/methodology/approachBased on a comprehensive review of literature in the domain, this study identifies four factors and nineteen subfactors that are essential for the success of a lean maintenance program. A fuzzy-set-theory-based assessment framework is developed that can be used by an in-house team to measure the degree of implementation of lean maintenance practices in their organization. The authors applied the framework to a maintenance workshop that services diesel engines and other prime movers.FindingsThe framework provides maintenance managers valuable insights to help identify the strengths and weaknesses of their organization vis-à-vis their maintenance practices, thus enabling them come up with a firm action plan for future process improvements.Originality/valueThis paper adapts the concept of agility and readiness to maintenance work. A key contribution of this study is the identification of factors and subfactors that forms the basis to estimate the leanness of maintenance practices in an organization. Another contribution is its application to a large maintenance workshop that demonstrates the ease of its implementation. Future research in this area can help identify more factors and subfactors and thus improve the estimation of leanness.", "venue": "Journal of Quality in Maintenance Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-09-03", "journal": {"name": "Journal of Quality in Maintenance Engineering"}, "authors": [{"authorId": "147602160", "name": "Maheswar Singha Mahapatra"}, {"authorId": "70272254", "name": "Dinesh Shenoy"}], "citations": [{"paperId": "15f9f21dff888c37955951f45b909447bb2ee8b1", "title": "Lean readiness of organizations – A systematic scientometric review"}, {"paperId": "a0af8a02071e3a5e9f737065d157bbe8d74fd1a2", "title": "Improving the performance of a conveyor belt through lean philosophy and Industry 4.0"}]}
