{"paperId": "3aecbf5dc447add5a51beadca372834a6a277af2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "AgriFusion: An Architecture for IoT and Emerging Technologies Based on a Precision Agriculture Survey", "abstract": "Precision Agriculture (PA) is a management strategy that utilizes communication and information technology for farm management. It is a key to improve productivity by using the best agricultural practices and optimal usage of resources. Agriculture faces diverse challenges due to soil degradation, climate variation, and increasing costs. To unfold these challenges, PA uses Wireless Sensor Networks(WSNs) and exploits acquisition, communication, and processing of the data as basic enabling technologies to amplify the crop yield. Also, many other multidisciplinary technologies are supporting PA in finding the most novel use cases for PA. The use of Machine Learning (ML) and Artificial Intelligence (AI) has transformed PA at almost every level. The fog/edge paradigm is mitigating many challenges such as network bandwidth and security by bringing computation closer to the deployed network. At the same time, Software Defined Networks (SDN) brings flexibility, big data assists in handling data, and nanotechnology plays a crucial part in driving the innovation in PA. This paper delves into ways these technologies are transforming PA in respective tracks, exhibiting the significance of integrating multidisciplinary approaches towards the future of PA. In addition to a comprehensive survey, this paper proposes a multidisciplinary architecture: AgriFusion, for efficient and cost-effective agriculture solutions. A list of industrial solutions for different aspects of farm management and their underlying focused technology have been highlighted. This can help to align research and industrial goals for PA. Furthermore, this paper defines a step approach to describe the performance dichotomy between resource availability and objectives for PA. In addition, solution architecture is proposed for designing Key Performance Indicators (KPI) in PA. In the end, some open research issues in implementing PA and respective future scopes have been presented.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "136253-136283", "volume": "9"}, "authors": [{"authorId": "152602933", "name": "Ritesh K. Singh"}, {"authorId": "2986616", "name": "Rafael Berkvens"}, {"authorId": "3257059", "name": "M. Weyn"}], "citations": [{"paperId": "0b68ddc984ec81b57fecb8afb436c81641be1fbc", "title": "Sustainability insights on learning-based approaches in precision agriculture in internet-of-things"}, {"paperId": "465330351fe312f435b7704efe6427e7b9640fab", "title": "Which Technologies Make Australian Farm Machinery Safer? A Decision Support Tool for Agricultural Safety Effectiveness"}, {"paperId": "b15a8c950ca3b3e9a55f2f5efb4825cfd81574cf", "title": "Drought Prediction for Farmers and Providing a Sustainable Farming Solution using IoT and Machine Learning"}, {"paperId": "cc8cefe38501b69c01884af1205b3dfc3f60a447", "title": "Comparing Remote and Proximal Sensing of Agrometeorological Parameters across Different Agricultural Regions in Croatia: A Case Study Using ERA5-Land, Agri4Cast, and In Situ Stations during the Period 2019-2021"}, {"paperId": "8058a39ee1e9d654c89ff898e2c0c15ade8e2028", "title": "An Evaluation of Research Interests in Vertical Farming through the Analysis of KPIs Adopted in the Literature"}, {"paperId": "6a2a260f9938e9b0555a165a5189fc0674823e8c", "title": "IoT Based Optical Sensor Network For Precision Agriculture"}, {"paperId": "b91c4f4abb8c6463a2a6bf5884a50cceff6cac15", "title": "Machine and Deep Learning-based Techniques for Precision Agriculture with Comparative Analysis"}, {"paperId": "4d71317cb522b09b2d8fd31e1abec3856e2e49fe", "title": "AI and ML for Enhancing Crop Yield and Resource Efficiency in Agriculture"}, {"paperId": "a6ae88c4e1f6b47179f5642401182b9199c02094", "title": "WiCHORD+: A Scalable, Sustainable, and P2P Chord-Based Ecosystem for Smart Agriculture Applications"}, {"paperId": "87a7a35001a0dfc34f69f62cb9adea2ea5f3901d", "title": "Analysis of Decision Support System for Crop Health Management in Smart and Precision Agriculture Based on Internet of Things (IoT) and Artificial Intelligence (AI)"}, {"paperId": "6ce451394bbba64fa218c580e7c4e0f23ae07505", "title": "Innovative Low-Cost Field Protection (LCFP) Technique: Safeguarding Agricultural Land and Crops through Advanced Technology Integration"}, {"paperId": "94d68189e63ff151f3fda0b31c127324062fd3aa", "title": "Design and Development of Smart Farming using ML and IoT in India"}, {"paperId": "963904c6340901ee8c9320322050bc37667d8dcb", "title": "Artificial Intelligence in Sustainable Vertical Farming"}, {"paperId": "c956486040e04de09d04a6f7dbe510cc528bb0c2", "title": "Data-Driven Analysis and Machine Learning-Based Crop and Fertilizer Recommendation System for Revolutionizing Farming Practices"}, {"paperId": "1cfb7c97a4c23a8b36eebfada255a14b622fbfe8", "title": "Smart greenhouse construction and irrigation control system for optimal Brassica Juncea development"}, {"paperId": "94d5b3acad759717db175e2d5a6d1ba472ffbe84", "title": "An AI Factory Digital Twin Deployed Within a High Performance Edge Architecture"}, {"paperId": "8a8149943cdee1ea44369c08951aede7a145f2ae", "title": "Energy Efficient, Secure and Spectrum Aware Ultra-Low Power Internet-of-Things System Infrastructure for Precision Agriculture"}, {"paperId": "3a41d691de8535a0bd3f9d5073d550a5dcf8512c", "title": "A Novel All Members Group Search Optimization Based Data Acquisition in Cloud Assisted Wireless Sensor Network for Smart Farming"}, {"paperId": "8035b578e66970fedc093fdb6b2d93e2fe9265de", "title": "Complementary Use of Ground-Based Proximal Sensing and Airborne/Spaceborne Remote Sensing Techniques in Precision Agriculture: A Systematic Review"}, {"paperId": "24b7c334fc5a3843ef8c7c74577e293b306d3b6c", "title": "Diseño y despliegue de un sistema de monitoreo basado en IoT para cultivos hidropónicos"}, {"paperId": "eda977ddd535d18063a75ad5b392e10b844b814c", "title": "Artificial Intelligence in Agriculture: Benefits, Challenges, and Trends"}, {"paperId": "887a86184e71f7d7125923af54a28f20be07bc54", "title": "Assessment of Smart Mechatronics Applications in Agriculture: A Review"}, {"paperId": "78740811deb205591db782b5c1a9ef9302a64779", "title": "A comparative study of deep learning and Internet of Things for precision agriculture"}, {"paperId": "7acc8a5c49149332ca3abd9c8e1e5766ef5eca97", "title": "Monitoring and prediction of smart farming in fog-based IoT environment using a correlation based ensemble model"}, {"paperId": "89d5cbc6c8d63e74cc98b368d53f08b33f66c225", "title": "IoT-based Spatial Monitoring and Environment Prediction System for Smart Greenhouses"}, {"paperId": "d43ab6a6945144d896f9ac80b793440d5241b2f8", "title": "AgriSecure: A Fog Computing-Based Security Framework for Agriculture 4.0 via Blockchain"}, {"paperId": "d17bd1d7a365a0baadf6589060b02462f3034069", "title": "Cloud Base Intrusion Detection System using Convolutional and Supervised Machine Learning"}, {"paperId": "15211decb864bc9a5eab513e32634b398d7f80d8", "title": "Agri-IoT: A Farm Monitoring and Automation System using Internet of Things"}, {"paperId": "3a43e5199b9b0bde7450a89b6a93c699bd43c50a", "title": "Machine learning and IoT-based smart farming for enhancing the crop yield"}, {"paperId": "667d8f9ff805caa2ee9417f4451423fa451c0ef3", "title": "DynGATT: A dynamic GATT-based data synchronization protocol for BLE networks"}, {"paperId": "86df8a380a06b15bce2d4125088a3b76ca931ea0", "title": "Recent Security Challenges in Agriculture Applications in Smart Agriculture: A Survey"}, {"paperId": "db5075750b606ab9a170488156d13fad52422205", "title": "IoT Assisted Farming using ML techniques"}, {"paperId": "8c6d31e6a7e027c1a64156179e45ab00c04e4f15", "title": "Improved Salp Swarm Algorithm with Transfer Learning Based Weed Detection for Smart Farming"}, {"paperId": "adc4bdba0a4d0e6bf2b7f898ea931058ac951312", "title": "Variance adaptive sporadic sampling for greenhouse monitoring"}, {"paperId": "434fff789065e08fc6fd23ea6c81cab8447bf589", "title": "Using Computer Vision and Machine Learning Based Methods for Plant Monitoring in Agriculture: A Systematic Literature Review"}, {"paperId": "665c48f2b38ba8b951ad285eb53763189589e0da", "title": "Enhancing smart farming through the applications of agriculture 4.0 technologies"}, {"paperId": "3e7475206e2924040be3edf81f49fd1e2df8b20b", "title": "Traffic-Aware Secured Cooperative Framework for IoT-Based Smart Monitoring in Precision Agriculture"}, {"paperId": "38240c3a810e5117cb882ed460dc9014eb319fa1", "title": "Roadmapping 5.0 Technologies in Agriculture: A Technological Proposal for Developing the Coffee Plant Centered on Indigenous Producers’ Requirements from Mexico, via Knowledge Management"}, {"paperId": "5b026687488de4bcc20ca5938e9914255dd9278f", "title": "Joint Communication and Sensing: A Proof of Concept and Datasets for Greenhouse Monitoring Using LoRaWAN"}, {"paperId": "93237baf92c613b2c69d5f772d411390b4f8ed72", "title": "Design and deployment of a practical IoT-based monitoring system for protected cultivations"}, {"paperId": null, "title": "Design and deployment of an IoT-based monitoring system for hydroponic crops"}, {"paperId": "390ffedee06dd2d4adae1bd7dfec08d1dd5dde71", "title": "IoT-Based Water Management Systems: Survey and Future Research Direction"}]}
