{"paperId": "3af2f618c44210027544ec6f50120adfdec38837", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Accelerated Fuzzy C-Means Clustering Based on New Affinity Filtering and Membership Scaling", "abstract": "Fuzzy C-Means (FCM) is a widely used clustering method. However, FCM and its many accelerated variants have low efficiency in the mid-to-late stage of the clustering process. In this stage, all samples are involved in updating their non-affinity centers, and the membership grades of most samples, whose assignments remain unchanged, are still updated by calculating the sample-center distances. All these factors lead to the algorithms converging slowly. In this paper, a new affinity filtering technique is developed to recognize a complete set of non-affinity centers for each sample with low computations. Then, a new membership scaling technique is suggested to set the membership grades between each sample and its non-affinity centers to 0 and maintain the fuzzy membership grades for others. By integrating these two techniques, FCM based on new affinity filtering and membership scaling (AMFCM) is proposed to accelerate the whole convergence process of FCM. Numerous experimental results performed on synthetic and real-world data sets have shown the feasibility and efficiency of the proposed algorithm. Compared with state-of-the-art algorithms, AMFCM is significantly faster and more effective. For example, AMFCM reduces the number of FCM iterations by 80<inline-formula><tex-math notation=\"LaTeX\">$\\%$</tex-math><alternatives><mml:math><mml:mo>%</mml:mo></mml:math><inline-graphic xlink:href=\"zhou-ieq1-3273274.gif\"/></alternatives></inline-formula> on average.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-14", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "12337-12349", "volume": "35"}, "authors": [{"authorId": "153216935", "name": "Dongyuan Li"}, {"authorId": "34678057", "name": "Shuisheng Zhou"}, {"authorId": "1731634", "name": "W. Pedrycz"}], "citations": [{"paperId": "f2b2a3bd973d8062870611165bda4b6075245aa1", "title": "Sparse Membership Affinity Lasso for Fuzzy Clustering"}]}
