{"paperId": "3af4a80aa08f7bd34c0a0635a121946493df332a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Who can help me? Reconstructing users' psychological journeys in depression-related social media interactions", "abstract": "Social media are increasingly being used as self-help boards, where individuals can disclose personal experiences and feelings and look for support from peers or experts. Here we investigate several popular mental health-related Reddit boards about depression while proposing a novel psycho-social framework. We reconstruct users' psychological/linguistic profiles together with their social interactions. We cover a total of 303,016 users, engaging in 378,483 posts and 1,475,044 comments from 01/05/2018 to 01/05/2020. After identifying a network of users' interactions, e.g., who replied to whom, we open an unprecedented window over psycholinguistic, cognitive, and affective digital traces with relevance for mental health research. Through user-generated content, we identify four categories or archetypes of users in agreement with the Patient Health Engagement model: the emotionally turbulent/under blackout, the aroused, the adherent-yet-conflicted, and the eudaimonically hopeful. Analyzing users' transitions over time through conditional Markov processes, we show how these four archetypes are not consecutive stages. We do not find a linear progression or sequential patient journey, where users evolve from struggling to serenity through feelings of conflict. Instead, we find online users to follow spirals towards both negative and positive archetypal stages. Through psychological/linguistic and social network modelling, we can provide compelling quantitative pieces of evidence on how such a complex path unfolds through positive, negative, and conflicting online contexts. Our approach opens the way to data-informed understandings of psychological coping with mental health issues through social media.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-29", "journal": {"name": "ArXiv", "volume": "abs/2311.17684"}, "authors": [{"authorId": "1869835702", "name": "Virginia Morini"}, {"authorId": "150293810", "name": "Salvatore Citraro"}, {"authorId": "2156380588", "name": "Elena Sajno"}, {"authorId": "2160301778", "name": "Maria Sansoni"}, {"authorId": "2268673006", "name": "Giuseppe Riva"}, {"authorId": "2258922704", "name": "Massimo Stella"}, {"authorId": "37340414", "name": "Giulio Rossetti"}], "citations": [{"paperId": "210c2bcc438c38dada64158a78422116d376c757", "title": "From Perils to Possibilities: Understanding how Human (and AI) Biases affect Online Fora"}]}
