{"paperId": "3b01b72a013caeafd19e92610fc0a6d12f10e841", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Employing Convolutional Neural Network for IoT Healthcare Attack Detection in Intensive Care Unit", "abstract": "The Internet of Things helps the healthcare sector to embrace the methodologies with emerging technologies and facilitate technological change from traditional to highly equipped technology. Some of the frequent uses of the Internet of Things in healthcare include monitoring patient healthcare, enhancing proper healthcare and searching medical resources. This digitalization and increase in the use of internet-connected sensors in healthcare have taken to a new height through advancement in technology. But security and efficient use of IoT in healthcare is still a critical challenge. Cyber-attacks are very common at present with the main motive of hacking private patient data and stealing other health information from the devices equipped for fetching patient's well-being. This research paper shows the employment of a convolutional neural network for detecting attacks on Intensive care units in hospitals. The results achieved by the convolutional neural network technique prove that deep learning methodologies are a promising solution to provide reliable and trustworthy communication in healthcare sectors with the Internet of Things devices.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-14", "journal": {"name": "2023 6th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "798-803", "volume": "6"}, "authors": [{"authorId": "153494643", "name": "Ishu Sharma"}, {"authorId": "147220896", "name": "Keshav Kaushik"}, {"authorId": "2214764420", "name": "Vanshika Pahuja"}, {"authorId": "39042396", "name": "Gunjan Chhabra"}], "citations": []}
