{"paperId": "3b066791d595318ed0a9e2da027036c197b1a23e", "publicationVenue": {"id": "282ed0c7-7d4a-49c0-a7f1-5f45b1722d5b", "name": "IEEE Radio and Wireless Symposium", "type": "conference", "alternate_names": ["RWS", "IEEE Radio Wirel Symp"], "url": "http://www.radiowirelessweek.org/"}, "title": "Cluster-based Module to Manage Smart Grid Data for an Enhanced Situation Awareness: A Case Study", "abstract": "Under an imminent or ongoing cyberattack, utility network and security operation control center (NOC/SOC) analysts lack access to relevant, timely data, thus reducing their speeds of incident response and decision-making. To enhance their situation awareness, this paper proposes a Data Module (DM) that uses computer clusters to ingest, process, and store data from heterogeneous sources of smart grids and utility enterprise, and derive contextual relationships across attributes to infer meaningful trends. The goal of DM is to enhance situation awareness of its users in a time-constrained environment. The paper describes DM's architecture, presents three functions (correlation, classification and regression trees, and K-means clustering), and validates them using weather and smart meter data from a real Florida neighborhood for the years 2013 to 2015. In doing so, this paper demonstrates the use of an independent module that can be readily customized and integrated into utility NOC/SOC for effective data ingestion and contextualization for well-informed decision-making.", "venue": "IEEE Radio and Wireless Symposium", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-11-01", "journal": {"name": "2019 Resilience Week (RWS)", "pages": "81-87", "volume": "1"}, "authors": [{"authorId": "2605924", "name": "Aditya Sundararajan"}, {"authorId": "151027837", "name": "Hugo Riggs"}, {"authorId": "1491247090", "name": "Avinash Jeewani"}, {"authorId": "1964794", "name": "A. Sarwat"}], "citations": [{"paperId": "ebd67e0294441a0ed9a497780485f316f0010239", "title": "Impact, Vulnerabilities, and Mitigation Strategies for Cyber-Secure Critical Infrastructure"}, {"paperId": "9af99a96a99ca92fbb75780bccf20ca1033f59fc", "title": "Cybersecurity Center for Secure Evolvable Energy Delivery Systems (SEEDS)"}]}
