{"paperId": "3b09333989550d5d689b5d9967993ac3d03be856", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "TinyML for Ultra-Low Power AI and Large Scale IoT Deployments: A Systematic Review", "abstract": "The rapid emergence of low-power embedded devices and modern machine learning (ML) algorithms has created a new Internet of Things (IoT) era where lightweight ML frameworks such as TinyML have created new opportunities for ML algorithms running within edge devices. In particular, the TinyML framework in such devices aims to deliver reduced latency, efficient bandwidth consumption, improved data security, increased privacy, lower costs and overall network cost reduction in cloud environments. Its ability to enable IoT devices to work effectively without constant connectivity to cloud services, while nevertheless providing accurate ML services, offers a viable alternative for IoT applications seeking cost-effective solutions. TinyML intends to deliver on-premises analytics that bring significant value to IoT services, particularly in environments with limited connection. This review article defines TinyML, presents an overview of its benefits and uses and provides background information based on up-to-date literature. Then, we demonstrate the TensorFlow Lite framework which supports TinyML along with analytical steps for an ML model creation. In addition, we explore the integration of TinyML with network technologies such as 5G and LPWAN. Ultimately, we anticipate that this analysis will serve as an informational pillar for the IoT/Cloud research community and pave the way for future studies.", "venue": "Future Internet", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-06", "journal": {"name": "Future Internet", "pages": "363", "volume": "14"}, "authors": [{"authorId": "2297717", "name": "N. Schizas"}, {"authorId": "2156929752", "name": "Aristeidis Karras"}, {"authorId": "2156928873", "name": "Christos N. Karras"}, {"authorId": "1718248", "name": "S. Sioutas"}], "citations": [{"paperId": "16e0f5cf165cc2ec86aedd7bd97b39d49d235afb", "title": "Anomaly detection based on Artificial Intelligence of Things: A Systematic Literature Mapping"}, {"paperId": "1877a37c613666be07cfa478b81f53ed58ed81d4", "title": "Effective Feature Engineering Framework for Securing MQTT Protocol in IoT Environments"}, {"paperId": "0a132114d8c72afad0cf7efe82a6b8ac977683ee", "title": "Reservoir Computing Using Measurement-Controlled Quantum Dynamics"}, {"paperId": "3a723cf25eec117cc96f75de69d979d67b55ef56", "title": "Analysis of Using Machine Learning Techniques for Estimating Solar Panel Performance in Edge Sensor Devices"}, {"paperId": "e4f58a91670f1df6ec023f53c11b8b26acbf60bb", "title": "TinyML Algorithms for Big Data Management in Large-Scale IoT Systems"}, {"paperId": "35be16b17766c43dba2a5f64cafae8f5beee3b1e", "title": "An Evaluation and Implementation of the Effectiveness of Cloud Security as a Service in IoT Security"}, {"paperId": "ace056976f281231b8e4dfdbabf6ebd037b1d28d", "title": "Tiny Machine Learning Business Intelligence in the Semiconductor Industry: A Case Study"}, {"paperId": "36929b050d800ba8d250533a9a62765346cdcff6", "title": "Edge AI for Internet of Energy: Challenges and Perspectives"}, {"paperId": "a6ae88c4e1f6b47179f5642401182b9199c02094", "title": "WiCHORD+: A Scalable, Sustainable, and P2P Chord-Based Ecosystem for Smart Agriculture Applications"}, {"paperId": "09f6f6941c04859ea9fe955207cb68e43e261b36", "title": "Efficient Neural Networks for Tiny Machine Learning: A Comprehensive Review"}, {"paperId": "7abd4564168d90c9397064f76036b1a879b82c38", "title": "Object Detection at Edge Using TinyML Models"}, {"paperId": "1b64232394baf86d551bfe882f2b69a45c64d22f", "title": "Forecasting the Traffic Flow by Using ARIMA and LSTM Models: Case of Muhima Junction"}, {"paperId": "1960404445e307b541c3b6ec536dffc3ee082e8a", "title": "TinyML-based Event Detection: An Edge-Cloud Approach for Smart Agriculture over LoRa WSNs"}, {"paperId": "0b7c96678f9fe3e398e2c67fe6be8bb72b332d4f", "title": "TinyML optimization for activity classification on the resource-constrained body sensor BI-Vital"}, {"paperId": "389ecabdfa5ea2b97f62af9562b8d66d61c18554", "title": "A multi-microcontroller-based hardware for deploying Tiny machine learning model"}, {"paperId": "5e3d11287f55c0ace13b7d84adf1bba36c2415d8", "title": "An Explainable AI Approach to Agrotechnical Monitoring and Crop Diseases Prediction in Dnipro Region of Ukraine"}, {"paperId": "8e5c3d76a9d160e87765727f5c817aea151ed900", "title": "A Machine Learning-Oriented Survey on Tiny Machine Learning"}, {"paperId": "d47bfbfef30d8ace31424fbc746f94b0afa2baf7", "title": "EVCA Classifier: A MCMC-Based Classifier for Analyzing High-Dimensional Big Data"}, {"paperId": "93a9f9dfd09a615241b93465fa8ac13c22efa37e", "title": "Autonomous Vehicles: Sophisticated Attacks, Safety Issues, Challenges, Open Topics, Blockchain, and Future Directions"}, {"paperId": "e38aac8406dad18f5ff9f481a15b69db7c2e581d", "title": "Federated Edge Intelligence and Edge Caching Mechanisms"}, {"paperId": "19b717fad24ecd42141d1bd3746c00339bbdd075", "title": "A multi-resolution fusion approach for human activity recognition from video data in tiny edge devices"}, {"paperId": "b2585c9f0d2c001fa4476b6e15dd7efafd028477", "title": "Machine-Learning-Based Combined Path Loss and Shadowing Model in LoRaWAN for Energy Efficiency Enhancement"}, {"paperId": "a02dfd5448e6842cd406a6579d5d8f31e69272ce", "title": "TinyML Custom AI Algorithms for Low-Power IoT Data Compression: A Bridge Monitoring Case Study"}, {"paperId": "a16c88cc78590274808c5430febb225e90f1eb58", "title": "Reducing Red Light Running (RLR) with Adaptive Signal Control: A Case Study"}, {"paperId": "eca2824b364c5c07b9ec8d2d0a34f9d093b013a1", "title": "Consensus Big Data Clustering for Bayesian Mixture Models"}, {"paperId": "208b83f810c99abbe1fcc134ec4320212cca8da1", "title": "AutoML with Bayesian Optimizations for Big Data Management"}, {"paperId": "b28d7493fe13e1a1a4a9e46e402e822897feb3cf", "title": "TinyML: Tools, Applications, Challenges, and Future Research Directions"}, {"paperId": "cd0f3b08ef0fc3b58cf3dfaead730307733b33bf", "title": "Neuro-Fuzzy Employee Ranking System in the Public Sector"}, {"paperId": "351861036f0bec856ef2101c42058b0b54977773", "title": "Biometric Aided Intelligent Security System Built using Internet of Things"}, {"paperId": "9600450c059b4b37a100b27887a5048e2de484b8", "title": "An Adaptable and Unsupervised TinyML Anomaly Detection System for Extreme Industrial Environments"}, {"paperId": "68057c68ad1a7e4bcbf331c93957793366cf79ea", "title": "Is TinyML Sustainable?"}, {"paperId": "dfe2b33bbdcc2d35865e7ee2442712f02d6e7a3f", "title": "Tree Data Structures and Efficient Indexing Techniques for Big Data Management: A Comprehensive Study"}, {"paperId": "a84d7ef0ac44a42ff671bc6ca64ad07fb392bf2a", "title": "SparkReact: A Novel and User-friendly Graphical Interface for the Apache Spark MLlib Library"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}, {"paperId": "0adf3bf3f8cc607221d2459d7671fc549cbc2075", "title": "A Comprehensive Survey on TinyML"}, {"paperId": "c8ee13f84b35b0555c0997a9d3f9da9535e26f87", "title": "Eﬀicient Neural Networks for Tiny Machine Learning: A Comprehensive Review"}, {"paperId": "da6b1866b5b6c7fd4275e5c986eac55a615a53a7", "title": "Assessing the environmental impacts of machine learning on microcontrollers."}, {"paperId": "c7cfc15205da667ee445902c6a81f2950d4f22a6", "title": "MITOR: Jurnal Teknik Elektro MITOR: Jurnal Teknik Elektro"}, {"paperId": "b415b57f231d578bd3f414ee397b51af8bb9ee1d", "title": "Forecasting the Trafﬁc Flow by Using ARIMA and LSTM Models: Case of Muhima Junction"}]}
