{"paperId": "3b0dea60ffca3a5e170990fd340f69338e3776fe", "publicationVenue": {"id": "067913e8-43aa-48ad-9cdd-1102a9ece0e8", "name": "Substance Use & Misuse", "type": "journal", "alternate_names": ["Subst Use  Misuse"], "issn": "1082-6084", "url": "http://www.tandfonline.com/loi/isum20", "alternate_urls": ["http://www.tandfonline.com/openurl?genre=journal&stitle=isum20"]}, "title": "Types and Sources of Stigma on Opioid Use Treatment and Recovery Communities on Reddit", "abstract": "Abstract Background: Digitally-mediated peer support may improve opioid use disorder (OUD) recovery. Our objective was to examine the types and sources of stigma that people seek support for in online OUD recovery communities (subreddits) on Reddit. Methods: We extracted all posts containing stigma keywords from three subreddits as well as a random sample that do not contain stigma keywords. We conducted deductive content analysis to confirm that the post self-described an experience of stigma and identify the type (condition, intervention) and source (provider-based, public, self, structural) of stigma. Results: Two-hundred and fifty-nine posts self-reported a stigmatizing experience. The majority of posts described an intervention stigma associated with medications for OUD. Posts discussing intervention stigma acknowledged the role of stigma in their treatment decision-making and quality of their treatment program. The most frequent sources of stigma were the public (including family members), provider-based (healthcare and pharmacy workers), structural (workplace, law enforcement, child protective services, and abstinence-based self-help groups), and self. No posts mentioned courtesy stigma. Posts sought assistance in navigating their experiences and participating in advocacy to counter stigmatized narratives. Conclusions: Our study indicates that people in online communities seek support to disclose and manage experiences of stigma on Reddit in similar ways to people in offline communities with the noted exception of an absence of discussions of courtesy stigma. Since each subreddit is a microcosm of varying needs, we suggest areas of future work for collaborative resources developed between stakeholders of these subreddits and public health that work within the preexisting Reddit social norms.", "venue": "Substance Use & Misuse", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-09", "journal": {"name": "Substance Use & Misuse", "pages": "1511 - 1522", "volume": "57"}, "authors": [{"authorId": "2137452441", "name": "W. Kepner"}, {"authorId": "33186745", "name": "Meredith C Meacham"}, {"authorId": "35076424", "name": "A. Nobles"}], "citations": [{"paperId": "db3f7e6add72298667fe32fce102d2af6761de74", "title": "“Pap smear horror stories, self loathing, feeling like I was less of a woman”: A qualitative content analysis of an online vaginismus forum"}, {"paperId": "ba5ded29eec36b4b99110d9a7d57ad81a826af2c", "title": "First-hand accounts of structural stigma toward people who use opioids on Reddit."}, {"paperId": "9c51ca03fe4c74ea93c70156f3a3caa0305d3976", "title": "'There is no justice in nursing school': A qualitative analysis of nursing students' experiences of discrimination shared on Reddit."}, {"paperId": "43443937817306b154ccb6a2b203c8d420bb265a", "title": "Barriers and Facilitators to Harm Reduction for Opioid Use Disorder: A Qualitative Study of People With Lived Experience."}, {"paperId": "3ef6c3d66213e8ee7bc45baca5fef18111a5b597", "title": "Exploring the Landscape of Drug Communities on Reddit: A Network Study"}, {"paperId": "afd1a008980bcb3948526b41776a72d2c256297b", "title": "Association Between Adverse Childhood Experiences and Opioid Use-Related Behaviors: A Systematic Review."}, {"paperId": "871652a63020045a0fdda51f1f71e0bcddf6516f", "title": "Postmortem toxicology findings from the Camden Opioid Research Initiative"}, {"paperId": "2bb98b9f8dc6dd306ce5b1493cbb8a73c7efffa1", "title": "Media framings of the role of genomics in \"addiction\" in the United States from 2015 to 2019: Individualized risk, biomedical expertise, and the limits of destigmatization."}, {"paperId": "0f3fcdc6b4f20b4f16a859b430d9871d303c2019", "title": "Examining Symptoms of Stimulant Misuse and Community Support Among Members of a Recovery-Oriented Online Community."}, {"paperId": "889a16582c4b77289ead8b4c900eeb0cb62b05b5", "title": "The Pursuit of Peer Support for Opioid Use Recovery on Reddit"}, {"paperId": "85d0fd1e905f6177c7dc1a279242eac83bb70872", "title": "Characteristics of Intimate Partner Violence and Survivor’s Needs During the COVID-19 Pandemic: Insights From Subreddits Related to Intimate Partner Violence"}, {"paperId": "5061ee7d9ba9faf972fba691004580a183f5f737", "title": "“I am a binary trans man and I love being pregnant”: Making meaning of pregnancy in seahorse dad narratives"}, {"paperId": "e75c40bc4d677be10dc28c484694d7a13c91fee2", "title": "Meeting the Unmet Needs of Individuals With Mental Disorders: Scoping Review on Peer-to-Peer Web-Based Interactions"}]}
