{"paperId": "3b13262092f6ff5c6d40f309d8ee91904e622135", "publicationVenue": null, "title": "Analyzing the applications of internet of things in hotel industry", "abstract": "Tourism is one of the fastest growing business domains. Self-assisted services and Internet of things-based devices have become the current age cash. Internet of Things is a network for devices to connect and communicate information using physical devices embedded with sensor, software, cloud computing and other technologies. Therefore, self-assistance options enhance customer experience when it comes to hotel accommodation. The Internet of Things plays major role in improving the stay experience by providing customized services to customers. Self-services like pre-booking, registration and user preferred payment mode, automated check in & check out are also few aspects that are contributing for improved guest experience. In this paper, role of Internet of Things in hotel industry is taken into consideration for improving the guest experience and providing the customized services and the application of IoT in hotel industry has been analyzed.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-07-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1969"}, "authors": [{"authorId": "48539596", "name": "Urvashi Sharma"}, {"authorId": "1491632654", "name": "D. Gupta"}], "citations": [{"paperId": "08ebcc95c171c7a77b63ff0529b2716691fe030d", "title": "A Comprehensive Analysis of Technological Advancements and Smart Tourism Strategies in Malaysia's Post-Pandemic Tourism Industry"}, {"paperId": "366f0829307b868ed69feb03102035d3e25aae7f", "title": "An Exploratory Study on Calibration of Technology for Talent Management in Disruptive Hotel Industry in India"}, {"paperId": "0cb6363ab500a8a96769b6b84bbd75e2b0ae1075", "title": "Detection of features from the internet of things customer attitudes in the hotel industry using a deep neural network model"}, {"paperId": "79cc16883bfaa0956e45786e61b3ff7b86bcb738", "title": "INTERNET OF THINGS (IOT) IN TOURISM AND HOSPITALITY: OPPORTUNITIES AND CHALLENGES"}, {"paperId": "cf1ab49321688e21640b46184beb2927a2149deb", "title": "Are customers ready to be smart? designing smart hotel experiences"}, {"paperId": "c5b5d32298a30284535cf2140f8cfc0f935456e1", "title": "Application of Zero Trust Framework in Security Protection of Power Internet of Things"}, {"paperId": "a0970bda9fff03ba208280a33602ecf48b71f0ab", "title": "THE READINESS FOR IMPLEMENTING ICTs IN HOTEL INDUSTRY ORGANIZATIONS: EVIDENCE FROM THE REGIONAL LEVEL"}]}
