{"paperId": "3b19e3ca1aa2236d36b763473bf790fa1ae6089e", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Deep Learning-Driven Automated Fault Detection and Diagnostics Based on a Contextual Environment: A Case Study of HVAC System", "abstract": "Indoor thermal comfort affects occupants’ daily activities and health. HVAC systems are necessary to control thermal comfort quality. Tracking and monitoring the effectiveness of HVAC system engines are critical activities because they ensure that the system can produce suitable indoor thermal comfort. However, the operation of such systems depends on practitioners and engineers, which is time-consuming and labor-intensive. Moreover, installing physical sensors into the system engine may keep track of the problem but may also require costs and maintenance. This research addressed this concern by presenting deep learning (DL)-driven automated fault detection and diagnostics (AFDD) for HVAC systems. It employed contextual factors as an indirect measurement to avoid modifying HVAC system engines (e.g., according to standard building appliance warranties) but was still able to effectively detect issues. The design and development of the DL model are proposed to encode complex behaviors of an HVAC system using contextual factors. The experimental results show that the predictive performance of our model achieved an average F-measure of over 97%, which was outstanding compared with the standard ML models. This proposed model will be a natural fit for AFDD for HVAC systems and is ready for future real-world applications as required by building engineering.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-22", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2105229242", "name": "Kanjana Haruehansapong"}, {"authorId": "2198143326", "name": "Wisit Roungprom"}, {"authorId": "119188001", "name": "Mallika Kliangkhlao"}, {"authorId": "101988917", "name": "K. Yeranee"}, {"authorId": "40372233", "name": "Bukhoree Sahoh"}], "citations": [{"paperId": "e478540d2ac6e87fe032c61b6007e764d61ebe96", "title": "BIM-based automated fault detection and diagnostics of HVAC systems in commercial buildings"}, {"paperId": "2bfe7187b6cb1003e53abdff5fbdec00e2c55300", "title": "Enhancing the Accuracy of Low-Cost Inclinometers with Artificial Intelligence"}, {"paperId": "deab00923f4ccb5ba83e37bc25ec41501ab7b330", "title": "State-of-the-Art Review and Synthesis: A Requirement-based Roadmap for Standardized Predictive Maintenance Automation Using Digital Twin Technologies"}, {"paperId": "7691b2fb44e4a54bc5e1e4858aeca09ed94b68a0", "title": "Feasibility of Automated Black Ice Segmentation in Various Climate Conditions Using Deep Learning"}]}
