{"paperId": "3b2f1506cf5591b894d23a9d8bff476502aa796c", "publicationVenue": null, "title": "Design and Implementation of Piezoelectric Shoe", "abstract": "A piezoelectric shoe is a type of footwear that uses piezoelectric materials to generate electricity from mechanical pressure. The shoe contains a series of piezoelectric elements that are embedded within the sole and heel, which produce electrical energy when compressed by the wearer's movement. The generated energy can be used to power electronic devices or charge batteries. This technology has potential applications in areas such as sports and fitness tracking, military operations, and emergency response systems. The abstract summarizes the main features and potential applications of piezoelectric shoe technology. The quick development of wearable technology has paved the way for creative approaches to energy harvesting that make use of the body's untapped capacity for energy. The piezoelectric shoe stands out among them as a promising invention because it converts the mechanical energy produced during running and walking into electrical energy. An overview of piezoelectric shoe technology is given in this abstract, along with information on its prospective uses, advantages, and drawback the ability to transform mechanical pressure or strain into electrical voltage is a special property of piezoelectric materials. The piezoelectric shoe can harness the kinetic energy produced by foot motions by incorporating these materials into the sole or other parts of a shoe. Wearable sensors, fitness monitors, and even smartphones can be powered by this energy by harvesting it and using it. the piezoelectric shoe emerges as a promising technology that converts human motion into usable.", "venue": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-11-15", "journal": {"name": "2023 International Conference on Sustainable Communication Networks and Application (ICSCNA)", "pages": "551-555"}, "authors": [{"authorId": "2277676329", "name": "Mrs.M.Shanthini"}, {"authorId": "2277673497", "name": "Mr. V.M.Santhosh"}, {"authorId": "2277673161", "name": "Mr.R.Pongajesh"}, {"authorId": "2277686960", "name": "Mr.S.Kavin Kumar"}, {"authorId": "2277673341", "name": "Mr.R.Surya"}, {"authorId": "2277676691", "name": "Mr.V.Seshathri"}], "citations": []}
