{"paperId": "3b3f3c6bebdb7a06dfa3ea5fd535842a8ff93888", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "MAKING CITIES INTEROPERABLE IN TURKEY", "abstract": "Abstract. The population of cities is increasing rapidly day by day, and it is predicted that this increase will continue in the following years. Accordingly, population growth creates a significant pressure in many different domains of cities such as infrastructure, traffic, energy, and environment. Smart cities come forward as a useful option to struggle with the pressure on cities caused by overwhelming population growth and to make cities liveable and sustainable. Smart city approach creates gains in the fields of sustainable development, competitiveness and environmental sustainability with its ability to transform information into economic, social and environmental benefits. However, smart city services and applications are mostly designed as independent and unrelated units so this approach causes isolated and heterogeneous data and technology islands. As the result, data flow problem occurs between vertical applications and service suppliers, and this interoperability problem causes emergence of independent silos in smart cities. Such silos hinders data integration, prevent citizens and public administrations benefit fully from smart cities, and cause vendor lock-in. In order to use the full potential of smart city approach, it’s vital to secure interoperability systems and applications of smart cities. In this study, interoperability terms and their necessity for smart city ecosystem will be addressed. Afterwards, Smart City Interoperability Model’s (SCIM) contributions to semantic, technical and operational interoperability will be discussed.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-23", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "2084893640", "name": "H. Bayraktar"}, {"authorId": "146466248", "name": "D. Y. Bayar"}, {"authorId": "2064345517", "name": "G. Bilgin"}], "citations": []}
