{"paperId": "3b53ae37e593b969bbaecd40569bd0ce758d069a", "publicationVenue": {"id": "28a83bf1-b6e5-416f-8c5a-fdc53e54f3a1", "name": "International Conference on Automation and Computing", "type": "conference", "alternate_names": ["IEEE International Conference on Autonomic Computing", "IEEE Int Conf Auton Comput", "Int Conf Autom Comput", "ICAC", "International Conference on Autonomic Computing", "Int Conf Auton Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1269", "alternate_urls": ["https://acsos.github.io/"]}, "title": "An Empirical Study on Hybrid Scheduling Algorithms in Cloud Computing", "abstract": "With the flourishment of Internet technology, cloud computing has become the most expedient way to get tasks done without purchasing costly machines. From small businesses to well-established organizations are all availing the cloud services. As millions of users are connected to the cloud, the demand for cloud resources is increasing day by day. This is the reason, the maintenance of streamlined workflow, communication, productivity, service delivery, resource availability, computational cost, load balancing, and performance has become a critical challenge for cloud service providers. To optimally utilize cloud resources, many resource scheduling algorithms exist. In this paper, our contribution is twofold. Firstly, a critical analysis of the heuristics, metaheuristics, and hybrid resource scheduling algorithms in cloud computing is presented by targeting throughput, response time, makespan, load balance, energy efficiency, cost, and resource utilization over the period 2012–2022. Secondly, we discuss the workflow of cloud resource allocation and scheduling techniques and we provide an easy and concise view of the underlying model adopted by each cloud architecture. Our experimental evaluations aim to present the suitability and appropriateness of different resource optimization algorithms in cloud computing.", "venue": "International Conference on Automation and Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-30", "journal": {"name": "2023 28th International Conference on Automation and Computing (ICAC)", "pages": "1-6"}, "authors": [{"authorId": "144446703", "name": "B. Abbasi"}, {"authorId": "35191617", "name": "M. A. Shah"}], "citations": []}
