{"paperId": "3b59fed36d1cb0fd28833700e9f2df83b090fb3c", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "Traffic-Aware Energy Optimizing Strategies for Multi-Cell Coordinated Green Cellular Networks", "abstract": "The ongoing 5G cellular networks are expected to meet the demands posed by the energy and radio resource crises, especially exploiting flexible management for the traffic in idle zone. In this paper, two energy optimizing solutions are proposed for macro-tier with the tradeoff consideration regarding spectrum efficiency and quality of service (QoS), which adapt to the instantaneous traffic variance based upon dynamic cell configuration. To characterize the optimal energy savings for base stations (BSs), an active cell rotation (ACR) scheme is cyclic activated to control the number of active BSs by appropriately scheduling different work patterns in the cell group, and hence, guarantee QoS requirement of the user equipment by a recovery mechanism. An improved cooperative ACR scheme is also proposed, which enables BSs to achieve better spectrum utilization while pursuing energy efficiency in terms of traffic load. In addition, closed-form stationary results as well as asymptotic analysis are also derived for formulating the traffic variance and state transitions by a Markov-based framework. The numerical performances indicate that the proposed methodologies can have positive effects on addressing greenness in both energy and spectrum domains while meeting the upcoming intense traffic and QoS requirements.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-02-21", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "418-431", "volume": "2"}, "authors": [{"authorId": "2460153", "name": "Zhenni Pan"}, {"authorId": "48210881", "name": "Jiang Liu"}, {"authorId": "143943431", "name": "S. Shimamoto"}], "citations": [{"paperId": "436c1e798881ccb362d6493bc927bd573a1121f0", "title": "Energy Efficiency Maximization Under Minimum Rate Constraints in Multi-Cell MIMO Systems With Finite Buffers"}, {"paperId": "750e1ccbf540174f7f3babd433b93a66442bea81", "title": "A Precoding Compensation Scheme for Heterogeneous Communication Networks With CSI Feedback Delay"}, {"paperId": "1d230f7f53813559075a312b800630ca4778f856", "title": "Stochastic Cooperative Optimization for Multicast Scheduling in Heterogeneous and Green 5G Networks"}, {"paperId": "166d6fc65564d6420b9542d929959513ead6ec43", "title": "Energy-Efficient QoE-Driven Radio Resource Management Method for 5G and Beyond Networks"}, {"paperId": "aa6b7152c66afd73d3b61cfbcfbba9f45cfd4138", "title": "GREEN CELLULAR DESIGN USING AN ADAPTIVE POWER MANAGEMENT REDISTRIBUTION FOR MOBILE COMMUNICATION"}, {"paperId": "b253ae0fc71fb088cdfaa51ac57bd74b7be8c407", "title": "Energy Borrowing Transmission Scheme Based on D2D Communication for 5G Networks"}]}
