{"paperId": "3b5a3fcfca9f87c8ac7d886a27f9e464078d4b65", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Mach: A Pluggable Metrics Storage Engine for the Age of Observability", "abstract": "Observability is gaining traction as a key capability for understanding the internal behavior of large-scale system deployments. Instrumenting these systems to report quantitative telemetry data called metrics enables engineers to monitor and maintain services that operate at an enormous scale so they can respond rapidly to any issues that might arise. To be useful, metrics must be ingested, stored, and queryable in real time, but many existing solutions cannot keep up with the sheer volume of generated data. This paper describes Mach, a pluggable storage engine we are building specifically to handle high-volume metrics data. Similar to many popular libraries (e.g., Berkeley DB, LevelDB, RocksDB, WiredTiger), Mach provides a simple API to store and retrieve data. Mach’s lean, loosely coordinated architecture aggressively leverages the characteristics of metrics data and observability work-loads, yielding an order-of-magnitude improvement over existing approaches—especially those marketed as “time series database systems” (TSDBs). In fact, our preliminary results show that Mach can achieve nearly 10 × higher write throughput and 3 × higher read throughput compared to several widely used alternatives.", "venue": "Conference on Innovative Data Systems Research", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": null, "authors": [{"authorId": "8347899", "name": "Franco Solleza"}, {"authorId": "2825799", "name": "Andrew Crotty"}, {"authorId": "2678944", "name": "Suman Karumuri"}, {"authorId": "1738467643", "name": "Nesime Tatbul"}, {"authorId": "2031287", "name": "S. Zdonik"}], "citations": [{"paperId": "0c8bb7e5943ddb3fe80e4a0391243c1915837bf8", "title": "ForestTI: A Scalable Inverted-Index-Oriented Timeseries Management System with Flexible Memory Efficiency"}]}
