{"paperId": "3b60e042b789b2d661cb3325dcd7d95a6094b154", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Optimization Problems on The Weighted Massively Parallel Computation Model: Hardness and Algorithms", "abstract": "The topology-aware Massively Parallel Computation (MPC) model is proposed and studied recently, which enhances the classical MPC model by the awareness of network topology. The work of Hu et. al. on topology-aware MPC model considers only the tree topology. In this paper a more general case is considered, where the underlying network is a weighted complete graph. We then call this model as Weighted Massively Parallel Computation (WMPC) model, and study the problem of minimizing communication cost under it. Three communication cost minimization problems are defined based on different pattern of communication, which are the Data Redistribution Problem, Data Allocation Problem on Continuous data, and Data Allocation Problem on Categorized data. We also define four kinds of objective functions for communication cost, which consider the total cost, bottleneck cost, maximum of send and receive cost, and summation of send and receive cost, respectively. Combining the three problems in different communication pattern with the four kinds of objective cost functions, 12 problems are obtained. The hardness results and algorithms of the 12 problems make up the content of this paper. With rigorous proof, we prove that some of the 12 problems are in P, some FPT, some NP-complete, and some W[1]-complete. Approximate algorithms are proposed for several selected problems.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2302.12953"}, "authors": [{"authorId": "151485594", "name": "Hengzhao Ma"}, {"authorId": "2180540450", "name": "Jianzhong Li"}, {"authorId": "49779773", "name": "Xiangyu Gao"}], "citations": []}
