{"paperId": "3b749cd1dd5e0e46bbd590b9ef088fdac0755fc1", "publicationVenue": {"id": "82901c74-dc2e-4d08-b633-637c7e209284", "name": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "type": "conference", "alternate_names": ["Conf Appl Technol Archit Protoc Comput Commun", "ACM Special Interest Group on Data Communication", "SIGCOMM", "ACM Spéc Interest Group Data Commun"], "url": "https://en.wikipedia.org/wiki/SIGCOMM"}, "title": "P4LRU: Towards An LRU Cache Entirely in Programmable Data Plane", "abstract": "The data plane cache, a critical functionality found in numerous network devices, such as programmable switches, intelligent NICs, and DPUs, is often subject to limitations in its programmability and memory access capacity. As a result, the majority of existing data plane caches rely on simple and inefficient replacement policies. This paper is set to introduce LRU, a near-optimal replacement policy, into the programmable data plane. We first explore the reasons why the traditional implementation of LRU is not suitable for deployment on the data plane. Consequently, we propose P4LRU, a pipeline-optimized version of the LRU implementation. Building on P4LRU, we conceive three distinct in-network systems - LruTable, LruIndex, and LruMon, and successfully bring them to life on Tofino switches. Our thorough experimental trials establish that P4LRU provides a significant performance boost over existing data plane caches in these three systems. We have open-sourced the source codes for the three systems on GitHub [1].", "venue": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-09-01", "journal": {"name": "Proceedings of the ACM SIGCOMM 2023 Conference"}, "authors": [{"authorId": "7637576", "name": "Yikai Zhao"}, {"authorId": "2181541659", "name": "Wenrui Liu"}, {"authorId": "2219955037", "name": "Fenghao Dong"}, {"authorId": "2148553943", "name": "Tong Yang"}, {"authorId": "2139518050", "name": "Yuanpeng Li"}, {"authorId": "2153031945", "name": "Kaicheng Yang"}, {"authorId": "2236292233", "name": "Zirui Liu"}, {"authorId": "2150379703", "name": "Zhengyi Jia"}, {"authorId": "2237113389", "name": "Yongqiang Yang"}], "citations": [{"paperId": "df8f9fbe5afd1edd4b8adf57643dd6aa21eb602f", "title": "In-Network Key-Value Cache with Linearizability"}]}
