{"paperId": "3b7750ebd7be28146ed09fc17df8cd6ea6c360d2", "publicationVenue": {"id": "d9720b90-d60b-48bc-9df8-87a30b9a60dd", "name": "Neural Information Processing Systems", "type": "conference", "alternate_names": ["Neural Inf Process Syst", "NeurIPS", "NIPS"], "url": "http://neurips.cc/"}, "title": "Learning Large Graph Property Prediction via Graph Segment Training", "abstract": "Learning to predict properties of large graphs is challenging because each prediction requires the knowledge of an entire graph, while the amount of memory available during training is bounded. Here we propose Graph Segment Training (GST), a general framework that utilizes a divide-and-conquer approach to allow learning large graph property prediction with a constant memory footprint. GST first divides a large graph into segments and then backpropagates through only a few segments sampled per training iteration. We refine the GST paradigm by introducing a historical embedding table to efficiently obtain embeddings for segments not sampled for backpropagation. To mitigate the staleness of historical embeddings, we design two novel techniques. First, we finetune the prediction head to fix the input distribution shift. Second, we introduce Stale Embedding Dropout to drop some stale embeddings during training to reduce bias. We evaluate our complete method GST-EFD (with all the techniques together) on two large graph property prediction benchmarks: MalNet and TpuGraphs. Our experiments show that GST-EFD is both memory-efficient and fast, while offering a slight boost on test accuracy over a typical full graph training regime.", "venue": "Neural Information Processing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-21", "journal": {"name": "ArXiv", "volume": "abs/2305.12322"}, "authors": [{"authorId": "48865984", "name": "Kaidi Cao"}, {"authorId": "2623548", "name": "P. Phothilimthana"}, {"authorId": "1389570466", "name": "Sami Abu-El-Haija"}, {"authorId": "1389613483", "name": "Dustin Zelle"}, {"authorId": "2389316", "name": "Yanqi Zhou"}, {"authorId": "32532671", "name": "Charith Mendis"}, {"authorId": "1702139", "name": "J. Leskovec"}, {"authorId": "2271808", "name": "Bryan Perozzi"}], "citations": [{"paperId": "c485924b4dac6bf46a45732dbe5569c058cb8546", "title": "TpuGraphs: A Performance Prediction Dataset on Large Tensor Computational Graphs"}, {"paperId": "54c77b3d0fd2afff6dde81eb7b5689113896fb99", "title": "Graph Neural Networks in TensorFlow"}, {"paperId": "4ebcadfea9dfe5949a9220eea3f88c02c347d724", "title": "GNNs for TPU Graphs"}]}
