{"paperId": "3b8be395109a38151da6292e6573ce4970fe10f6", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Intelligent Adaptive Optimisation Method for Enhancement of Information Security in IoT-Enabled Environments", "abstract": "The usage of the Internet increased dramatically during the start of the twenty-first century, entangling the system with a variety of services, including social media and e-commerce. These systems begin producing a large volume of data that has to be secured and safeguarded from unauthorised users and devices. In order to safeguard the information of the cyber world, this research suggests an expanded form of differential evolution (DE) employing an intelligent mutation operator with an optimisation-based design. It combines a novel mutation technique with DE to increase the diversity of potential solutions. The new intelligent mutation operator improves the security, privacy, integrity, and authenticity of the information system by identifying harmful requests and responses and helping to defend the system against assault. When implemented on an e-commerce application, the performance of the suggested technique is assessed in terms of confidentiality, integrity, authentication, and availability. The experimental findings show that the suggested strategy outperforms the most recent evolutionary algorithm (EA).", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2188826342", "name": "Shailendra Pratap Singh"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}, {"authorId": "2156228963", "name": "Gyanendra Kumar"}, {"authorId": "2149701918", "name": "SurSingh Rawat"}], "citations": [{"paperId": "09d1281b8ba9d6045587419b36e1ffc570dc8db5", "title": "Design of a Telepresence Robot to Avoid Obstacles in IoT-Enabled Sustainable Healthcare Systems"}, {"paperId": "1895aa21f966f97d481cf235d57513392e06e12c", "title": "Telepresence Robot with DRL Assisted Delay Compensation in IoT-Enabled Sustainable Healthcare Environment"}]}
