{"paperId": "3b8d0f2b719c861511e391bc7da98b46d891a958", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Multi-Criteria Decision Analysis (MCDA) Approach for Landslide Susceptibility Mapping of a Part of Darjeeling District in North-East Himalaya, India", "abstract": "Landslides are the nation’s hidden disaster, significantly increasing economic loss and social disruption. Unfortunately, limited information is available about the depth and extent of landslides. Therefore, in order to identify landslide-prone zones in advance, a well-planned landslide susceptibility mapping (LSM) approach is needed. The present study evaluates the efficacy of an MCDA-based model (analytical hierarchy process (AHP)) and determines the most accurate approach for detecting landslide-prone zones in one part of Darjeeling, India. LSM is prepared using remote sensing thematic layers such as slope, rainfall earthquake, lineament density, drainage density, geology, geomorphology, aspect, land use and land cover (LULC), and soil. The result obtained is classified into four classes, i.e., very high (11.68%), high (26.18%), moderate (48.87%), and low (13.27%) landslide susceptibility. It is observed that an entire 37.86% of the area is in a high to very high susceptibility zone. The efficiency of the LSM was validated with the help of the receiver operating characteristics (ROC) curve, which demonstrate an accuracy of 96.8%, and the success rate curve showed an accuracy of 81.3%, both of which are very satisfactory results. Thus, the proposed framework will help natural disaster experts to reduce land vulnerability, as well as aid in future development.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-18", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "50184380", "name": "A. Saha"}, {"authorId": "2140215632", "name": "V. G. K. Villuri"}, {"authorId": "2149345255", "name": "A. Bhardwaj"}, {"authorId": "2183578519", "name": "Satish Kumar"}], "citations": [{"paperId": "05b72758f64a7105faf718df1f63ce346ced4411", "title": "Application of machine learning in the assessment of landslide susceptibility: A case study of mountainous eastern Mediterranean region, Syria"}, {"paperId": "4b0d097401b4297fb12770df4394efd6c2a23d78", "title": "Exploring machine learning and statistical approach techniques for landslide susceptibility mapping in Siwalik Himalayan Region using geospatial technology."}, {"paperId": "b8ce2ec968fbda6397e17ab35dbb8aa6a8e43f7d", "title": "Evaluating the variation characteristics of ecological resilience along expressways in developing countries: the case of the Phnom Penh-Sihanoukville Expressway in Cambodia."}, {"paperId": "7fe0938ec0a3b6179c19040ad10ccfa6f892aec6", "title": "Development of landslide susceptibility maps of Tripura, India using GIS and analytical hierarchy process (AHP)"}, {"paperId": "6215af30a9aa5b84e3844ec1034ffe2de5a639c2", "title": "MABAC-based evaluation of multimedia technology application effect in film and television post-production"}, {"paperId": "a468291b84cf779334f7f54cdde5b407e666bfc2", "title": "ExpTODIM-driven framework for 2-tuple linguistic neutrosophic MAGDM with applications to teaching quality evaluation in higher education"}, {"paperId": "38e5a35360d3a3a8a275c4e5ff0be456a7fde122", "title": "Application of AHP-ICM and AHP-EWM in Collapse Disaster Risk Mapping in Huinan County"}, {"paperId": "ec1c190e72cc0c40c4b2b92d6333289b81ae96b6", "title": "A fuzzy group decision-making framework for computer network security evaluation with probabilistic linguistic information"}, {"paperId": "de00666599502195e8076f4ef6aa2027292bf671", "title": "Development and assessment of a novel hybrid machine learning-based landslide susceptibility mapping model in the Darjeeling Himalayas"}]}
