{"paperId": "3b9810d22a546269fe5bfa6c250e1194f794a0bf", "publicationVenue": {"id": "9f6c5b27-f8ad-4ee0-bb4b-81ba28ad4146", "name": "International Journal of Strategic Communication", "type": "journal", "alternate_names": ["Int J Strateg Commun"], "issn": "1553-118X", "url": "http://www.leaonline.com/loi/ijsc", "alternate_urls": ["http://www.tandfonline.com/loi/hstc20"]}, "title": "The Use of Crowdfunding and Social Media Platforms in Strategic Start-up Communication: A Big-data Analysis", "abstract": "ABSTRACT Utilizing big-data analytics for crowdfunding platforms (e.g., AngelList and Crunchbase) and social media sites (e.g., Facebook and Twitter), this study investigates the impact of social media marketing on the start-up fundraising success through the lens of social capital theory. The results show that cognitive, structural, and relational dimensions of social capital sources served as predictors of fundraising for start-ups. Specifically, shared values (e.g., the number of followers, the number of investors of start-up companies) and attention (e.g., product/service descriptions and videos), which account for the cognitive dimension, positively led to the increased amount of investor funding. Trust (e.g., the quality rating, the number of rounds of funding, and the number of investors) as the subconstruct of the relational dimension was a determinant of fundraising. Social interaction ties (e.g., the number of likes, the number of social media followers) were found to increase the amount of funding as an aspect of the structural dimension. The results of a further analysis demonstrate a process of social capital formation by examining the effect of social interaction ties on the amount of funding mediated by shared values and trust. The current study contributes to extend knowledge on the start-up communication aligned with a resource-driven view of strategy.", "venue": "International Journal of Strategic Communication", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-15", "journal": {"name": "International Journal of Strategic Communication", "pages": "313 - 331", "volume": "16"}, "authors": [{"authorId": "2109471777", "name": "Sun-Young Park"}, {"authorId": "35206168", "name": "B. T. Loo"}], "citations": [{"paperId": "5d3561a8a897cb5adf198621f86db0ac51c3732b", "title": "Understanding Crowdfunding via Social Media: A Review of the Relevancy of Previous Studies"}, {"paperId": "6ae978547abc2831262565dac35fffccbdd079a3", "title": "Bibliometrically mapping the research field of entrepreneurial communication: where we stand and where we need to go"}]}
