{"paperId": "3b9e59e91d99a49122124b25d58e8a1a887e448b", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "HyTGraph: GPU-Accelerated Graph Processing with Hybrid Transfer Management", "abstract": "Processing large graphs with memory-limited GPU needs to resolve issues of host-GPU data transfer, which is a key performance bottleneck. Existing GPU-accelerated graph processing frameworks reduce the data transfers by managing the active subgraph transfer at runtime. Some frameworks adopt explicit transfer management approaches based on explicit memory copy with filter or compaction. In contrast, others adopt implicit transfer management approaches based on on-demand access with zero-copy or unified-memory. Having made intensive analysis, we find that as the active vertices evolve, the performance of the two approaches varies in different workloads. Due to heavy redundant data transfers, high CPU compaction overhead, or low bandwidth utilization, adopting a single approach often results in suboptimal performance.In this work, we propose a hybrid transfer management approach to take the merits of both the two approaches at runtime, with an objective to achieve the shortest execution time in each iteration. Based on the hybrid approach, we present HyTGraph, a GPU-accelerated graph processing framework, which is empowered by a set of effective task scheduling optimizations to improve the performance. Our experimental results on real-world and synthesized graphs demonstrate that HyTGraph achieves up to 10.27X speedup over existing GPU-accelerated graph processing systems including Grus, Subway, and EMOGI.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-31", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "558-571"}, "authors": [{"authorId": "30785202", "name": "Qiange Wang"}, {"authorId": "2216556894", "name": "Xin Ai"}, {"authorId": "40600353", "name": "Yanfeng Zhang"}, {"authorId": "47740650", "name": "Jing Chen"}, {"authorId": "2183759818", "name": "Ge Yu"}], "citations": [{"paperId": "ea3bbf50294feb0cbdbc41a680c53bd6d0412485", "title": "Towards Transaction as a Service"}, {"paperId": "ec48a8d0cfb16417dc0a7cda98cb59b9384e90e2", "title": "Universal Multi-modal Entity Alignment via Iteratively Fusing Modality Similarity Paths"}, {"paperId": "ecc64b4c8f5ccc7576aeb0c01b25f149334db6b6", "title": "Graph Processing Scheme Using GPU With Value-Driven Differential Scheduling"}]}
