{"paperId": "3ba9905cdafff6d7d18f139ba57e4d6ca8554065", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Transfer Learning Framework for Forecasting Fresh Produce Yield and Price", "abstract": "Accurate estimates of fresh produce (FP) yields and prices are crucial for having fair bidding prices by retailers along with informed asking prices by farmers, leading to the best prices for customers. To have accurate estimates, the state-of-the-art deep learning (DL) models for forecasting FP yields and prices are improved in this work while a novel transfer learning (TL) framework is proposed for better generalizability. The proposed models are trained and tested using real world datasets for the Santa Barbara region in California, which contain environmental input parameters mapped to FP yield and price output parameters. Based on an aggregated measure (AGM), the proposed model, an ensemble of Attention Deep Feedforward Neural Network with Gated Recurrent Unit (GRU) units and Deep Feedforward Neural Network with embedded GRU units, is found to significantly outperform the state-of-the-art models. Beside finding the best DL, the TL framework is utilizing FP similarity, clustering, and TL techniques customized to fit the problem in hand and enhance the model generalization to other FPs. The literature similarity algorithms are improved by considering the time series features rather than the absolute values of their points. In addition, the FPs are clustered using a hierarchical clustering technique utilizing the complete linkage of a dendrogram to automate the process of finding the similarity thresholds and avoid setting them arbitrarily. Finally, the transfer learning is applied by freezing some layers of the proposed ensemble model and fine-tuning the rest leading to significant improvement in AGM compared to the best literature model.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-07-18", "journal": {"name": "2022 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-8"}, "authors": [{"authorId": "2186558502", "name": "Islam Nasr"}, {"authorId": "153927170", "name": "L. Nassar"}, {"authorId": "1696863", "name": "F. Karray"}], "citations": [{"paperId": "f21159d6979dae247aa7643994e74074fcad78df", "title": "Enhanced Deep Learning Satellite-based Model for Yield Forecasting and Quality Assurance Using Metamorphic Testing"}, {"paperId": "c8277cab60799f99499d9ea3a4a81cd364b7a802", "title": "Enhancing Fresh Produce Yield Forecasting Using Vegetation Indices from Satellite Images"}, {"paperId": "d3e56fd381d03a7146541d868bf20a19bd94d708", "title": "A Study on the Supermarket Replenishment and Pricing Strategies Based on SARIMA Model"}]}
