{"paperId": "3bc193c460dfced96569d0f629e6c430731a70cb", "publicationVenue": null, "title": "JSON Data Management in RDBMS", "abstract": "Being a simple semi-structured data model, JSON has been widely accepted as a simple way to store, query, modify, and exchange data among applications. In comparison with schema-oriented relational data model to store, query, and update application data, JSON data model has the advantage of being self-contained, free from schema evolution issues, and flexible enough to enable agile style development paradigm. Therefore, during the last 5 years, SQL/JSON standard has been established as foundation for managing JSON data in SQL standard and there have been JSON functionalities added into RDBMS products to support SQL/JSON standard to various degree. In this chapter, the authors will analyze the strength and weakness of using JSON as the data model to manage data for applications. For use cases where JSON data model is ideal, they present the design approaches to store, index, query, and update JSON in the kernel of RDBMS to support SQL/JSON standard defined operations effectively and efficiently.", "venue": "Advances in Data Mining and Database Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Advances in Data Mining and Database Management"}, "authors": [{"authorId": "1399980817", "name": "Z. Liu"}], "citations": [{"paperId": "6800cb78062697ca67fcc64a7191c31dc4574e95", "title": "<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si6.svg\" display=\"inline\" id=\"d1e714\"><mml:mi mathvariant=\"bold-italic\">τ</mml:mi></mml:math>JUpdate: An update language for time-varying JSON data"}, {"paperId": "cac26548c5faa192fabeca764caae3606880b5e0", "title": "JUpdate: A JSON Update Language"}, {"paperId": "78ee1358c14989386554390dea7bdad706a7963c", "title": "Implementation of JSON Update Framework in RDBMSs"}, {"paperId": "0ff144a01743eb115d94b49123d4c960f02350b8", "title": "Schema-Based JSON Data Stores in Relational Databases"}, {"paperId": "ce007df8a55ee6115eb39ed38521eeb243a00a04", "title": "τJUpdate: A Temporal Update Language for JSON Data"}]}
