{"paperId": "3bcbebdb35b02e07205ba59b1544bafe6c8f039c", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Intelligent Mirai Malware Detection for IoT Nodes", "abstract": "The advancement in recent IoT devices has led to catastrophic attacks on the devices resulting in breaches in user privacy and exhausting resources of various organizations, so that users and organizations expend increased time and money. One such harmful malware is Mirai, which has created worldwide recognition by impacting the digital world. There are several ways to detect Mirai, but the Machine Learning approach has proved to be accurate and reliable in detecting malware. In this research, a novel-based approach of detecting Mirai using Machine Learning Algorithm is proposed and implemented in Matlab and Python. To evaluate the proposed approaches, Mirai and Benign datasets are considered and training is performed on the dataset comprised of a Training set, Cross-Validation set and Test set using Artificial Neural Network (ANN) consisting of neurons in the hidden layer, which provides consistent accuracy, precision, recall and F-1 score. In this research, an accurate number of hidden layers and neurons are chosen to avoid the problem of Overfitting. This research provides a comparative analysis between ANN and Random Forest models of the dataset formed by merging Mirai and benign datasets of the Mirai malware detection pertaining to seven IoT devices. The dataset used in this research is “N-BaIoT” dataset, which represents data in the features infected by Mirai Malware. The results are found to be accurate and reliable as the best performance was achieved with an accuracy of 92.8% and False Negative rate of 0.3% and F-1 score of 0.99. The expected outcomes of this project, include major findings towards cost-effective Learning solutions in detecting Mirai Malware strains.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-24", "journal": {"name": "Electronics", "pages": "1241", "volume": "10"}, "authors": [{"authorId": "2114861254", "name": "Tarun Ganesh Palla"}, {"authorId": "2838249", "name": "Shahab Tayeb"}], "citations": [{"paperId": "4981a30be834dcd7f825aff1122676120470cfe8", "title": "The evolution of Mirai botnet scans over a six-year period"}, {"paperId": "562904da20b01b09400f08bf72a97f738db63262", "title": "Joined Bi-model RNN with spatial attention and GAN based IoT botnet attacks detection"}, {"paperId": "25022251d1d60037629777c62ceb411e069d7a47", "title": "RepuTE: A soft voting ensemble learning framework for reputation-based attack detection in fog-IoT milieu"}, {"paperId": "46da73e66fe81f109f62b7daf64ab83af589dc2c", "title": "P2ADF: a privacy-preserving attack detection framework in fog-IoT environment"}, {"paperId": "e181b10005e6666dabc66cdd947ce7fea6170d9e", "title": "Malware detection for IoT devices using hybrid system of whitelist and machine learning based on lightweight flow data"}, {"paperId": "0005bdbcec4526d1df0257b581e1d5a7ec2dfbf4", "title": "Estimating Botnet Impact on IoT/IoE networks using Traffic flow Features"}, {"paperId": "7df5b0d5c72fc919192b16b2c61faae85721a80d", "title": "Identification of Immune-Related Genes in Patients with Acute Myocardial Infarction Using Machine Learning Methods"}, {"paperId": "1f69a3151c82c754aef232cde9cdfb2529657c68", "title": "FGMD: A robust detector against adversarial attacks in the IoT network"}, {"paperId": "3906dc23018d4af33f5286b6828b1f5760e7765b", "title": "VMFCVD: An Optimized Framework to Combat Volumetric DDoS Attacks using Machine Learning"}, {"paperId": "53d65f78484a1acb1a10f3fcd86350f316b4525d", "title": "Detection of COVID-19 Using Transfer Learning and Grad-CAM Visualization on Indigenously Collected X-ray Dataset"}, {"paperId": "580e375851ea1624f233b6524b9ddf67487c171b", "title": "Securing IoT Devices in e-Health using Machine Learning Techniques"}, {"paperId": "32e775ee901078119dded79d08424db47f624f30", "title": "Distributed Denial of Service Attack Detection for the Internet of Things Using Hybrid Deep Learning Model"}, {"paperId": "efa338f13e2a87d0b1f09137074e33967bcb03fd", "title": "Prediction Models to Effectively Detect Malware Patterns in the IoT Systems"}]}
