{"paperId": "3bccce47617ea58d6326ae40a2663c7b1f4aa577", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Step toward Next-Generation Advancements in the Internet of Things Technologies", "abstract": "The Internet of Things (IoT) devices generate a large amount of data over networks; therefore, the efficiency, complexity, interfaces, dynamics, robustness, and interaction need to be re-examined on a large scale. This phenomenon will lead to seamless network connectivity and the capability to provide support for the IoT. The traditional IoT is not enough to provide support. Therefore, we designed this study to provide a systematic analysis of next-generation advancements in the IoT. We propose a systematic catalog that covers the most recent advances in the traditional IoT. An overview of the IoT from the perspectives of big data, data science, and network science disciplines and also connecting technologies is given. We highlight the conceptual view of the IoT, key concepts, growth, and most recent trends. We discuss and highlight the importance and the integration of big data, data science, and network science along with key applications such as artificial intelligence, machine learning, blockchain, federated learning, etc. Finally, we discuss various challenges and issues of IoT such as architecture, integration, data provenance, and important applications such as cloud and edge computing, etc. This article will provide aid to the readers and other researchers in an understanding of the IoT’s next-generation developments and tell how they apply to the real world.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2113925981", "name": "Farhan Amin"}, {"authorId": "145642427", "name": "Rashid Abbasi"}, {"authorId": "2151985754", "name": "Abdul Mateen"}, {"authorId": "2191400990", "name": "Muhammad Ali Abid"}, {"authorId": "1786157", "name": "Salabat Khan"}], "citations": [{"paperId": "c574c4a032378b9482bf4a303a2273a5bb177dcf", "title": "Systematic literature review on mechanisms to measure the technological maturity of the Internet of Things in enterprises"}, {"paperId": "19fd08ece2a856cc7a9327e285746b31ca1ffc4a", "title": "Optimum Batch Scheduling Model for Quality Aware Delay Sensitive Data Transmission over Fog Enabled IOT Network"}, {"paperId": "74fed33b73c812d3ea0dd86a128675badb3d55cf", "title": "The Future of Electronic Commerce in the IoT Environment"}, {"paperId": "6adad60c6e8d89db6e874dc2963f12deba8d8e81", "title": "Study on Smart Grid Fault Detection based on ZigBee and MapX Technologies"}, {"paperId": "233e1d52ba3c365890fcd0f0af88603b868c2313", "title": "Rotating Triboelectric Nanogenerators for Energy Harvesting and Their Applications"}, {"paperId": "0a57260c18c9b9732a40cf98f3bb4e78a734eb91", "title": "Knowledge Development Trajectory of the Internet of Vehicles Domain Based on Main Path Analysis"}, {"paperId": "e1e17eea6295167eb3de365d3e7c2ac865305610", "title": "Internet of Things (IoT)-Based Wastewater Management in Smart Cities"}, {"paperId": "ffa8cb20df084e04f2dd52aa72d907e53fa3cfc3", "title": "Efficient lossless based secure communication in 6G Internet-of-Things environments"}, {"paperId": "66c551a80f5754914152ea1d96f14c9292431065", "title": "Simulation Studies of Link Group in Elastic Optical Networks Used in Internet of Things Solutions"}, {"paperId": "cb49cc47daeec33f2fb9697d4918431c9aa9691d", "title": "Lightweight Model for Botnet Attack Detection in Software Defined Network-Orchestrated IoT"}, {"paperId": "ccd1a1d1e4694fd99e04a0154ecaafebe775544c", "title": "Real-Time Cost Optimization Approach Based on Deep Reinforcement Learning in Software-Defined Security Middle Platform"}, {"paperId": "603c6d44529cedfedc66cb822fa589f1f13c1d4d", "title": "Simulation Tools for Fog Computing: A Comparative Analysis"}, {"paperId": "e35f8156506fffa0cc117900816d61306407e67a", "title": "Modeling Languages for Internet of Things (IoT) Applications: A Comparative Analysis Study"}, {"paperId": "63c087f10ab7de77d6133bff1787e36c690c3876", "title": "A Review on Adopting Blockchain and IoT Technologies for Fostering the Circular Economy in the Electrical and Electronic Equipment Value Chain"}, {"paperId": "1d7fbe5e787d60c7ce6989de708fd5cb841219ec", "title": "ASSIST-IoT: A Modular Implementation of a Reference Architecture for the Next Generation Internet of Things"}, {"paperId": "8ed33b23a52d742e3dfa903674503e0dc5148a3b", "title": "Smart Weather Data Management Based on Artificial Intelligence and Big Data Analytics for Precision Agriculture"}, {"paperId": "3aa4b38ffe4193a9b802b4e8d0b4640c27596e66", "title": "An Overview of Medium Access Control and Radio Duty Cycling Protocols for Internet of Things"}]}
