{"paperId": "3bd6f4dfe4855199f00ce80298591d5122880e0e", "publicationVenue": {"id": "d2850659-6e39-4bbb-a79a-641c38c0c0f9", "name": "International Journal of Technology in Education", "type": "journal", "alternate_names": ["Int J Technol Educ", "International Journal of Technology-Enhanced Education"], "issn": "2689-2758", "alternate_issns": ["2771-5612"], "url": "http://www.ijte.net/"}, "title": "ChatGPT for Founding Teams: An Entrepreneurial Pedagogical Innovation", "abstract": "ChatGPT is taking the world and the education sector by storm. Many educators are still hesitant to integrate it within their curricula, owing to the limited practical and theoretical guidance on its applications, despite early conceptual studies advocating for its potential benefits. This pedagogical innovation applied an effectual logic to implement ChatGPT for a founding team activity within an entrepreneurship course. Composing a founding team is an inundating task in venture creation, with long-lasting consequences. So far, there is yet to be an ideal approach proposed in literature or observed in real-life for doing it. In this pedagogical innovation, three student teams with varying business ideas prompted ChatGPT using different keywords and levels of details, to get recommendations on essential team members, their roles and equity split. Each team presented their findings, and then the classroom engaged in a collective discussion. The students were surveyed afterwards to assess the reception and effectiveness of the intervention. Their feedback showed an overwhelming favoritism of ChatGPT, as a convenient and resourceful learning tool. The study establishes the potential value of ChatGPT as a heutagogical tool that supports student-centric entrepreneurial learning across educational institutions and the entrepreneurship ecosystem that extends to the venture creation process.", "venue": "International Journal of Technology in Education", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-04", "journal": {"name": "International Journal of Technology in Education"}, "authors": [{"authorId": "2154035756", "name": "Basel Hammoda"}], "citations": [{"paperId": "d240627f09add2f8ef84869017cba6123009bc73", "title": "Please ''bridge'' the Gap! Conceptualizing ''Practicality'' as a Field of Inquiry"}]}
