{"paperId": "3bdb87927b67b29bddb3bf46000c459f28e3415e", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "OpenDC 2.0: Convenient Modeling and Simulation of Emerging Technologies in Cloud Datacenters", "abstract": "Cloud datacenters are important for the digital society, serving stakeholders across industry, government, and academia. Simulation is a critical part of exploring datacenter technologies, enabling scalable experimentation with millions of jobs and hundreds of thousands of machines, and what-if analysis in a matter of minutes to hours. Although the community has already developed powerful simulators, emerging technologies and applications in modern datacenters require new approaches. Addressing this requirement, in this work we propose OpenDC, a new platform for datacenter simulation. OpenDC includes novel models for emerging cloud-datacenter technologies and applications, such as serverless computing with FaaS deployment and TensorFlow-based machine learning. Our design also focuses on convenience, with a web-based interface for interactive experimentation, support for experiment automation, a library of prefabs for constructing and sharing datacenter designs, and support for diverse input formats and output metrics. We implement, validate, and open-source OpenDC 2.0, a significant redesign and release after a multi-year research and development process. We demonstrate the benefits of OpenDC for the field through a set of representative use-cases: serverless, machine learning, procurement of HPC-as-a-Service infrastructure, educational practices, and reproducibility studies. Overall, OpenDC helps understand how datacenters work, design datacenter infrastructure, and train the next generation of experts.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-01", "journal": {"name": "2021 IEEE/ACM 21st International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "455-464"}, "authors": [{"authorId": "51218038", "name": "F. Mastenbroek"}, {"authorId": "2083988659", "name": "G. Andreadis"}, {"authorId": "2122690122", "name": "Soufiane Jounaid"}, {"authorId": "2125355276", "name": "Wenchen Lai"}, {"authorId": "2122689905", "name": "Jacob Burley"}, {"authorId": "145015081", "name": "J. Bosch"}, {"authorId": "29990622", "name": "Erwin Van Eyk"}, {"authorId": "46579215", "name": "L. Versluis"}, {"authorId": "145153220", "name": "V. V. Beek"}, {"authorId": "1760940", "name": "A. Iosup"}], "citations": [{"paperId": "134b3fa4144094c14f0d32fe44df5f004a5b185f", "title": "CloudSim Express: A Novel Framework for Rapid Low Code Simulation of Cloud Computing Environments"}, {"paperId": "489c6cfe633f22a5aced35826a02356b9c49a365", "title": "ExDe: Design space exploration of scheduler architectures and mechanisms for serverless data-processing"}, {"paperId": "985d9cf96b5d2e8d1d4a6bb93b14df8119dafa4e", "title": "faas‐sim: A trace‐driven simulation framework for serverless edge computing platforms"}, {"paperId": "6b16b8137cf5d0c5e1cef0431f5c19d956ac29a7", "title": "WCSim: A Cloud Computing Simulator with Support for Bag of Tasks Workflows"}, {"paperId": "2c3b14930135c8433b2c7a536cd876eb71185677", "title": "CloudSimSC: A Toolkit for Modeling and Simulation of Serverless Computing Environments"}, {"paperId": "d7e395f5fb145062232c8dc80e00d4036f7652c6", "title": "The Graph-Massivizer Approach Toward a European Sustainable Data Center Digital Twin"}, {"paperId": "1ab75c9c22cc35a08f22b8c10fa655f1b41d81ff", "title": "A Trace-driven Performance Evaluation of Hash-based Task Placement Algorithms for Cache-enabled Serverless Computing"}, {"paperId": "1b5b5cb9852f2b3c87026dfca79843aa50ddc8df", "title": "Soft Reliability Aware Scheduling of Real-time Applications on Cloud with MTTF constraints"}, {"paperId": "7cca234b50f4b03dbf99b8579a5fd55a5a653094", "title": "Graph Greenifier: Towards Sustainable and Energy-Aware Massive Graph Processing in the Computing Continuum"}, {"paperId": "e466ee23784dc9d62387abb94657bfffc28764d6", "title": "Boosting the Impact of Extreme and Sustainable Graph Processing for Urgent Societal Challenges in Europe Graph-Massivizer: A Horizon Europe Project"}, {"paperId": "87ee45ae383a11a7ac9b475733253ebc8dc1a336", "title": "Cloud Simulator Search Framework The Vigilant Fetcher"}, {"paperId": "4e22ad596d8abcea2d619d1ab999141efbd142b7", "title": "The OpenDC Microservice Simulator: Design, Implementation, and Experimentation"}, {"paperId": "08b300602400c4af82251189254e9f568ab5ed97", "title": "Towards Fast and Flexible Simulation of Cloud Resource Management"}, {"paperId": "58042a3e7bb5269a2ab9d1bc8d4f89b5d3147895", "title": "Towards Extreme and Sustainable Graph Processing for Urgent Societal Challenges in Europe"}, {"paperId": "ebd31e323ad6688f332d69a1d2bf025de5b2e16e", "title": "Capelin: Data-Driven Compute Capacity Procurement for Cloud Datacenters Using Portfolios of Scenarios"}, {"paperId": "4b6fdbce8eede6fcaffb9dd898a5f6718ef29081", "title": "Capelin: Data-Driven Capacity Procurement for Cloud Datacenters using Portfolios of Scenarios - Extended Technical Report"}, {"paperId": "2a69288d626cc818c2577aa871cd2ab9b5258dd8", "title": "Estimating the Energy Consumption of Applications in the Computing Continuum with iFogSim"}, {"paperId": "0b18c22c7910e92aa1c012bbda0c688bcabf21f7", "title": "UvA-DARE (Digital Academic Repository) Estimating the Energy Consumption of Applications in the Computing Continuum with iFogSim"}]}
