{"paperId": "3befd8e48abae5dd6ba6ff053823c1db82e7e6a0", "publicationVenue": null, "title": "File-level vs. module-level regression test selection for .NET", "abstract": "Regression testing is used to check the correctness of evolving software. With the adoption of Agile development methodology, the number of tests and software revisions has dramatically increased, and hence has the cost of regression testing. Researchers proposed regression test selection (RTS) techniques that optimize regression testing by skipping tests that are not impacted by recent program changes. Ekstazi is one such state-of-the art technique; Ekstazi is implemented for the Java programming language and has been adopted by several companies and open-source projects. We report on our experience implementing and evaluating Ekstazi#, an Ekstazi-like tool for .NET. We describe the key challenges of bringing the Ekstazi idea to the .NET platform. We evaluate Ekstazi# on 11 open-source projects, as well as an internal Microsoft project substantially larger than each of the open-source projects. Finally, we compare Ekstazi# to an incremental build system (also developed at Microsoft), which, out of the box, provides module-level dependency tracking and skipping tasks (including test execution) whenever dependencies of a task do not change between the current and the last successful build. Ekstazi# on average reduced regression testing time by 43.70% for the open-source projects and by 65.26% for the Microsoft project (the latter is in addition to the savings provided by incremental builds).", "venue": "ESEC/SIGSOFT FSE", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2017-08-21", "journal": {"name": "Proceedings of the 2017 11th Joint Meeting on Foundations of Software Engineering"}, "authors": [{"authorId": "48114493", "name": "Marko Vasic"}, {"authorId": "40079593", "name": "Zuhair Parvez"}, {"authorId": "2174769", "name": "Aleksandar Milicevic"}, {"authorId": "2020926", "name": "Miloš Gligorić"}], "citations": [{"paperId": "bb47c2de97e105e68e23c2fda06d36b54fbcb412", "title": "Fine-Grained Assertion-Based Test Selection"}, {"paperId": "e78a2494304248a5b333a1d04659aca32f0bf7b9", "title": "Automated Code-based Test Case Reuse for Software Product Line Testing"}, {"paperId": "00cf787add0f7b31f5ddf41d8d9ece1eb4af46ca", "title": "More Precise Regression Test Selection via Reasoning about Semantics-Modifying Changes"}, {"paperId": "85b2d3db4f0c3f8b2d9097f7fd6eb6f2c3172f6c", "title": "An information retrieval-based regression test selection technique"}, {"paperId": "9653e1af0491dbfec6ecab5133fb182156298dad", "title": "Test Selection for Unified Regression Testing"}, {"paperId": "ab7366f88da620a8b8677130ffdad06b9b656d58", "title": "BinaryRTS: Cross-language Regression Test Selection for C++ Binaries in CI"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "37e1ffd66f745f134b121317f088b22f8c5a6396", "title": "ATM: Black-box Test Case Minimization based on Test Code Similarity and Evolutionary Search"}, {"paperId": "ed34d88092deb56d7694602d88da710018447313", "title": "Challenges in Regression Test Selection for End-to-End Testing of Microservice-based Software Systems"}, {"paperId": "b2f8399dc3423e4bac9300174b01a55ab1c81f85", "title": "Comparing and Combining Analysis-Based and Learning-Based Regression Test Selection"}, {"paperId": "7b5e06aea115be84f43a439d007e85ad24290cbf", "title": "Soundy Automated Parallelization of Test Execution"}, {"paperId": "38c94550ea66865b1fdec91182dbba7afe63c40b", "title": "An extensive study of class-level and method-level test case selection for continuous integration"}, {"paperId": "316dc68298f7972b77480c61d4946e04936187cf", "title": "Automated Code-based Test Selection for Software Product Line Regression Testing"}, {"paperId": "a861ac528b24b92c75b91369ec05fb4f12a3b730", "title": "Understanding and Improving Regression Test Selection in Continuous Integration"}, {"paperId": "5bc8c1fb660e2f4c4cc97333a60267de46ae2d04", "title": "Method-Level Test Selection for Continuous Integration with Static Dependencies and Dynamic Execution Rules"}, {"paperId": "151ff515a83439b6155abe5c74b51243be35bdf0", "title": "A Framework for Checking Regression Test Selection Tools"}, {"paperId": "c2fd7b55831f1958cbacf3b52756eb487ed8170e", "title": "TestSage: Regression Test Selection for Large-Scale Web Service Testing"}, {"paperId": "08f0e7dd21f9c31314a78f447013bf6576ab3e22", "title": "Resurgence of Regression Test Selection for C++"}, {"paperId": "ad67e66f0c87d654c5e395717b966eedddf99d5e", "title": "Regression test selection for TizenRT"}, {"paperId": "37e8e79462b811965d436620780105f5e41e9c97", "title": "Evaluating Regression Test Selection Opportunities in a Very Large Open-Source Ecosystem"}, {"paperId": "7bea404de137686a67e5d4254dfbf16465ee67ba", "title": "Hybrid Regression Test Selection"}, {"paperId": "6bb809210999927643e75adddf0a516bae062b03", "title": "Eksen : regression test selection for VHDL"}, {"paperId": "6263e3ab615270464d552e873de9713bc6642df0", "title": "Test suite parallelization in open-source projects: A study on its usage and impact"}, {"paperId": "f6ab4267421f480e21c4d9709b62637bcbae45c5", "title": "Regression test selection across JVM boundaries"}, {"paperId": "0bbf9e2021b552ba12f44e531de0633136208449", "title": "Regression Test Case Prioritization: A Systematic Literature Review"}, {"paperId": "73dbf9b92e568a6bc8a2dbb99d0c2a5f8dfd634d", "title": "Database-Conscious End-to-End Testing for Reactive Systems using Containerization"}]}
