{"paperId": "3bfe750065389e412cb81f4f2b73d150c6ad11ac", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Soft Sensing of LPG Processes Using Deep Learning", "abstract": "This study investigates the integration of soft sensors and deep learning in the oil-refinery industry to improve monitoring efficiency and predictive accuracy in complex industrial processes, particularly de-ethanization and debutanization. Soft sensor models were developed to estimate critical variables such as the C2 and C5 contents in liquefied petroleum gas (LPG) after distillation and the energy consumption of distillation columns. The refinery’s LPG purification process relies on periodic sampling and laboratory analysis to maintain product specifications. The models were tested using data from actual refinery operations, addressing challenges such as scalability and handling dirty data. Two deep learning models, an artificial neural network (ANN) soft sensor model and an ensemble random forest regressor (RFR) model, were developed. This study emphasizes model interpretability and the potential for real-time updating or online learning. The study also proposes a comprehensive, iterative solution for predicting and optimizing component concentrations within a dual-column distillation system, highlighting its high applicability and potential for replication in similar industrial scenarios.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2241909859", "name": "Nikolaos Sifakis"}, {"authorId": "2036883088", "name": "Nikolaos Sarantinoudis"}, {"authorId": "1700316", "name": "George J. Tsinarakis"}, {"authorId": "2241909676", "name": "Christos Politis"}, {"authorId": "2243847", "name": "G. Arampatzis"}], "citations": [{"paperId": "a2c2d0478d839905ea98ca7b153f238cf032371e", "title": "A semantic model-based systems engineering approach for assessing the operational performance of metal forming process"}]}
