{"paperId": "3c0a3a88c60d30a03228103737e163b7160c0728", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Application of Fuzzy \n K\n -Means Clustering Algorithm in the Innovation of English Teaching Evaluation Method", "abstract": "As an important course in colleges, the teaching quality of English courses directly affects the efficiency of talent training. Carrying out English teaching evaluation is conducive to solve the problems existing in English teaching timely, improve the teaching level, and promote the demand of English curriculum teaching reform. However, the traditional English teaching evaluation methods adopted by colleges have some disadvantages, such as inaccurate evaluation results and long evaluation time, which urgently needs to innovate and reform the English teaching evaluation method. With the wide application of modern information technology in English teaching, the fuzzy \n \n K\n \n -means clustering algorithm can be used to construct a new English teaching evaluation model, which can effectively make up for the shortcomings of traditional teaching evaluation methods. This study proposes an English teaching evaluation method based on the fuzzy \n \n K\n \n -means clustering algorithm. This study uses the association rule analysis method under the data mining technology to preprocess the English teaching data, establishes the hierarchical structure model combined with the applying steps of the analytic hierarchy, and constructs the judgment matrix, carries out the hierarchical ranking and consistency test, and defines the specific weight of each index in the teaching evaluation index system, transforms the problem of English teaching evaluation into solving the K-means clustering objective function, realizes the scientific and accurate evaluation of English teaching, and provides a guarantee for improving the quality of English teaching. The results show that the English teaching evaluation method based on the fuzzy \n \n K\n \n -means clustering algorithm has a good evaluation accuracy, ensuring that the evaluation error is less than 6%, and the evaluation time is only 3.9 seconds, which significantly reduces the evaluation time.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-18", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2155567204", "name": "HongJie Li"}], "citations": [{"paperId": "c8714d432e099dba1c5533b343f5e9b765368123", "title": "A Study on Innovative Strategies for Teaching English to College Students Based on Knowledge Mapping"}, {"paperId": "e0aaaebb2c0f677feea02049aa06b0c6506e5885", "title": "The Evaluation Algorithm of English Teaching Ability Based on Big Data Fuzzy K-Means Clustering"}]}
