{"paperId": "3c0bbd7cefa0c8d628a7cab08eb7735dae73c521", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Survey of State-of-the-Art on Edge Computing: theoretical Models, Technologies, Directions, and Development Paths", "abstract": "In order to describe the roadmap of current edge computing research activities, we first gave a brief overview of the most advanced edge computing surveys published in the last six years. We found that edge computing has been adaptively integrated into growing number of applications. Edge computing theory and technology will bring substantial innovation and incentive, as well as a large number of application scenarios in different fields, such as edge computing assisted smart city, Internet of Vehicles(IoV), Industrial Internet and many other different fields. However, we believe that a comprehensive investigation of the essence of edge computing is still missing by using the most advanced theoretical models, technologies, directions and development paths. To fill this gap, we have conducted an in-depth survey by identifying and classifying the latest high-quality research results related to theoretical discoveries in edge computing, as well as edge convergence technologies that intersect with the frontiers of Information and Communication Technology (ICT). Finally, we also summarize several promising open issues as future research directions. We hope that this survey report will attract much more attention, stimulate fruitful discussions, and provide ideas and useful guidance for further research on the theoretical models, technologies, directions and development paths of edge computing.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "47655556", "name": "Bin Liu"}, {"authorId": "2396533", "name": "Zhongqiang Luo"}, {"authorId": "2108315482", "name": "Hongbo Chen"}, {"authorId": "2128663353", "name": "Chengjie Li"}], "citations": [{"paperId": "0ce891908c88656d81d769b605f7445de2b5e638", "title": "A Survey on IoT-Edge-Cloud Continuum Systems: Status, Challenges, Use Cases, and Open Issues"}, {"paperId": "b5709d245e860bfc2d0ad6c91f6238edd9c09290", "title": "Integrating 5G Technology for Improved Process Monitoring and Network Slicing in ICS"}, {"paperId": "c33686a6ddc54b12da399839cffc1870e594519d", "title": "Time Constraints on Vehicular Edge Computing: A Performance Analysis"}, {"paperId": "257ae3ad010125a5280ab3bb593e51bfc37b6443", "title": "Analysis on technical structure and competitiveness of ICT manufacturing industries"}, {"paperId": "229bbca81e2f20ecfdbe6ec46461df4a3a10ca6e", "title": "On the Adoption of Modern Technologies to Fight the COVID-19 Pandemic: A Technical Synthesis of Latest Developments"}, {"paperId": "01cd7f09765ef2d325dc95bf87119a78c2907577", "title": "Accuracy-Aware Data Reduction for Internet of Things"}]}
