{"paperId": "3c10e5810d8625fe2b624228d734d19e1bf0162d", "publicationVenue": {"id": "dd9b4bce-03c6-4642-a70d-d3a984d3064c", "name": "International Journal of Urban Sciences", "type": "journal", "alternate_names": ["Int J Urban Sci", "The International Journal of Urban Sciences"], "issn": "1226-5934", "url": "http://www.tandfonline.com/loi/rjus20", "alternate_urls": ["http://www.informaworld.co.uk/RJUS"]}, "title": "A critical review of activity participation decision: a key component of activity-based travel demand models", "abstract": "ABSTRACT Activity-based travel demand models (ABM) have gained popularity during the last three decades and are currently in use in several urban areas. In ABM, special emphasis is given to modelling individuals’ decisions related to participation in activity and its scheduling. Most researchers and popular ABM frameworks have, however, refrained from implicit activity participation decision modelling and have concentrated only on the activity scheduling part thus replacing ‘activity’ with ‘tour’ as the main focus of ABM. This may lead to oversimplification and may offset the need for ABMs in the first place. Thus there is a need to review research focusing on activity participation decisions to facilitate their incorporation and eventual strengthening of existing ABM frameworks. Accordingly, a critical review of activity generation focusing on conceptualization, modelling approaches and activity categorization is conducted to identify the lacunas towards making it more policy-sensitive, efficient and behaviourally realistic. The strength and weaknesses of different modelling techniques are also explored to understand their prediction accuracy and computational complexities. Additionally, the progress of activity participation decision modelling within the existing ABM frameworks is also traced. The existing models are also explored through the lens of changing activity-travel behaviour of urban commuters resulting from technological improvement and wide access to telecommunication services even in developing countries. Our review not only traces the transition of standalone activity participation decision models to activity agenda generation and activity sequence generation models but also identifies the progress in incorporating various spatio-temporal interaction effects and the underlying behavioural dynamics of activity participation decisions within these models. One issue identified though is the trade-off between behavioural dynamism and data requirement and the need for standardization of activity categories.", "venue": "International Journal of Urban Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-11", "journal": {"name": "International Journal of Urban Sciences", "pages": "670 - 703", "volume": "27"}, "authors": [{"authorId": "2117805174", "name": "Suchismita Nayak"}, {"authorId": "49799864", "name": "Debapratim Pandit"}], "citations": [{"paperId": "e93eb0d3d8414d644fccaf3cf21d92f9e8c985fe", "title": "The effects of daily spatiotemporal variables and physical activities at workplaces on physical and mental health"}, {"paperId": "c3dac1855fc27c5ad32c34ece6c41dda072fd168", "title": "Do men and women differ in time-use? Analysing the complexity of activity patterns in Germany"}, {"paperId": "9dcd5cd5bc683afa06c49ee6c22e1853f0fe9bd1", "title": "An Activity-Based Travel Personalization Tool Driven by the Genetic Algorithm"}, {"paperId": "003b20c35640722bb1d69b81e170c9463ef7f159", "title": "A joint and simultaneous prediction framework of weekday and weekend daily-activity travel pattern using conditional dependency networks"}]}
