{"paperId": "3c12e698eaf9627e9ba7fb380363720a5414c50b", "publicationVenue": {"id": "4cb54ea1-cd78-4918-b9eb-a08176f8e260", "name": "AgriEngineering", "issn": "2624-7402", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1324754", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1324754", "https://www.mdpi.com/journal/agriengineering"]}, "title": "Integrated Route-Planning System for Agricultural Robots", "abstract": "Within the transition from precision agriculture (task-specific approach) to smart farming (system-specific approach) there is a need to build and evaluate robotic systems that are part of an overall integrated system under a continuous two-way connection and interaction. This paper presented an initial step in creating an integrated system for agri-robotics, enabling two-way communication between an unmanned ground vehicle (UGV) and a farm management information system (FMIS) under the general scope of smart farming implementation. In this initial step, the primary task of route-planning for the agricultural vehicles, as a prerequisite for the execution of any field operation, was selected as a use-case for building and evaluating this integration. The system that was developed involves advanced route-planning algorithms within the cloud-based FMIS, a comprehensive algorithmic package compatible with agricultural vehicles utilizing the Robot Operating System (ROS), and a communicational and computational unit (CCU) interconnecting the FMIS algorithms, the corresponding user interface, and the vehicles. Its analytical module provides valuable information about UGVs’ performance metrics, specifically performance indicators of working distance, non-working distance, overlapped area, and field-traversing efficiency. The system was demonstrated via the implementation of two robotic vehicles in route-execution tasks in various operational configurations, field features, and cropping systems (open field, row crops, orchards). The case studies showed variability in the operational performance of the field traversal efficiency to be between 79.2% and 93%, while, when implementing the optimal route-planning functionality of the system, there was an improvement of up to 9.5% in the field efficiency. The demonstrated results indicate that the user can obtain better control over field operations by making alterations to ensure optimum field performance, and the user can have complete supervision of the operation.", "venue": "AgriEngineering", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-05", "journal": {"name": "AgriEngineering"}, "authors": [{"authorId": "1582885309", "name": "G. Asiminari"}, {"authorId": "79521336", "name": "Vasileios Moysiadis"}, {"authorId": "1942212", "name": "D. Kateris"}, {"authorId": "2290547881", "name": "Patrizia Busato"}, {"authorId": "2276023135", "name": "Caicong Wu"}, {"authorId": "2698627", "name": "C. Achillas"}, {"authorId": "2182078184", "name": "Claus Sørensen"}, {"authorId": "2161541386", "name": "Simon Pearson"}, {"authorId": "2345652", "name": "D. Bochtis"}], "citations": []}
