{"paperId": "3c20818b4be01efb3afa0127d39eafbedd2673db", "publicationVenue": null, "title": "Exploring the tractability of data fusion models for detecting anomalies in IoT-based dataset", "abstract": "In recent years Internet of Things (IoT) devices have made their way into many different industries. Deep learning and machine learning methodologies have been applied to many IoT-related tasks123 such as intrusion detection systems or anomaly detection. The efficiency of IoT systems is often hindered by anomalies in data present within the system, often leading to undesirable behavior or possibly a full system shutdown. Due to this, the detection of these anomalies is of the utmost importance. Over the years, various traditional and neural network-based machine learning models have emerged for anomaly detection and classification of corrupted IoT data. However, many of these models fail to capture important features in the data which can lead to false anomaly detection or none at all. In this paper we investigate the applicability of using data fusion to improve the detection of data anomalies. This method uses many different models, such as VGG16, Inception, Xception, and ResNet, to extract features from the data. These extracted features are then fused together, to see if the use of multiple models is better than relying on a single model. This paper also provides a detailed analysis of the efficacy of this fusion-based classification method compared to simpler classification methods. This work investigates the applicability of various machine learning and deep learning models, for anomaly detection in various IoT datasets45.", "venue": "Defense + Commercial Sensing", "year": 2023, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2023-06-14", "journal": {"pages": "125220E - 125220E-8", "volume": "12522"}, "authors": [{"authorId": "2223980521", "name": "Devagopal A. M."}, {"authorId": "2223160311", "name": "Vishal Menon"}, {"authorId": "3352857", "name": "Soundararajan Ezekiel"}, {"authorId": "88696221", "name": "Pankaj Chaudhary"}], "citations": [{"paperId": "d8e7a48bbd55ebe22bd24e3afc48c32f91b00eca", "title": "A comparative analysis of various machine learning methods for anomaly detection in cyber attacks on IoT networks"}]}
