{"paperId": "3c34f1f0157cab5706e51f2929b59db2521c5e59", "publicationVenue": null, "title": "Excess demand in public transportation systems: The case of Pittsburgh's Port Authority", "abstract": "“An advanced city is not a place where the poor move about in cars, rather it’s where even the rich use public transportation”. This is what Enrique Peñalosa, the celebrated ex-mayor of Bogota once said. However, in order to achieve this objective, one of the crucial properties that the public transportation systems need to satisfy is reliability . While reliability is often referenced with respect to on-schedule arrivals and departures, in this study we are interested in the ability of the system to satisfy the total passenger demand. This is crucial, since if the capacity of the system is not enough to satisfy all the passengers, then ridership will inevitably drop. However, quantifying this excess demand is not straightforward since public transit data, and in particular data from bus systems that we focus on in this study, only include information for people that got on the bus, and not those that were left behind at a stop due to a full bus. In this work, we design a framework for estimating this excess demand. Our framework includes a mechanism for identifying instances of potential excess demand, and a Poisson regression model for the demand for a given bus route and stop. These instances of potential excess demand are filtered out from the training phase of the Poisson regression. We show through simulated data that this filtering is able to remove the bias introduced by the censored data logged by the system. Failure to remove these data points leads to an underestimation of the excess demand. We then apply our approach on real data collected from the Pittsburgh Port Authority and estimate the excess demand over an one-year period.", "venue": "", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2022-07-02", "journal": null, "authors": [{"authorId": "9887082", "name": "Tianfang Ma"}, {"authorId": "1993123710", "name": "Robizon Khubulashvili"}, {"authorId": "1889943", "name": "Sera Linardi"}, {"authorId": "2096978", "name": "K. Pelechrinis"}], "citations": [{"paperId": "24b638516447756b98693623ef4d7acbb4fbb6ca", "title": "Design of a Robust Cooperative Adaptive Cruise Control System on EDSA Bus Carousel for Improving the Current MRT Line 3 Operations"}]}
