{"paperId": "3c3b5e6152618b641c4f436f05c3a51b1d7fd37d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Group Key Management in Internet of Things: A Systematic Literature Review", "abstract": "IoT networks are gaining popularity in terms of group networks built by sensor nodes and other IoT-related devices. The significance of cryptography protocols for secure communication among nodes in such networks cannot be overstated. Effective point-to-point and multicast communication among groups of nodes is of paramount importance. The security of IoT necessitates the concealment of security protocols and keys that are transmitted between nodes. The management of group keys, commonly referred to as Group Key Management (GKM), is an essential component of secure group communication protocols. It is imperative to develop a Secure Group Communication (SCG) scheme that is designed for practical scenarios, taking into consideration the demands and constraints of real-life implementations. In addition, most of the existing GKM schemes are dependent on public-key cryptography which are vulnerable to quantum computers. This SLR evaluates 48 proposals identified in IEEE Xplore, Springer Link, MDPI, ScienceDirect, Scopus, and Hindawi databases between 2013 and 2023. Moreover, we provide a classification of secure group communication schemes. In addition, we conduct a comprehensive performance and security evaluation of the SGC schemes. In addition to other security features, we consider quantum resistance to be one of the security features, and we describe the application and usage area considering a resource-constrained real-world scenario where GKM is the most important issue.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "77464-77491", "volume": "11"}, "authors": [{"authorId": "1659415087", "name": "Fouzia Samiullah"}, {"authorId": "1951871", "name": "Ming-Lee Gan"}, {"authorId": "1774354", "name": "S. Akleylek"}, {"authorId": "49870066", "name": "Yichiet Aun"}], "citations": [{"paperId": "2d060dc2c6cf266f6a96b1148b84d7b7acb00d0f", "title": "Post-Quantum Group Key Management in IoTs"}]}
