{"paperId": "3c3efe9a4f629bf1cd535c2e87bf457fad1e1088", "publicationVenue": {"id": "eb7fffbe-b4f2-4801-a618-5ee8ef3cc742", "name": "IDAACS International Symposium on Wireless Systems", "type": "conference", "alternate_names": ["IDAACS-SWS", "IDAACS Int Symp Wirel Syst"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1801997/all-proceedings"}, "title": "Clustering Analysis for Big Data in Network Security Domain Using a Spark-Based Method", "abstract": "Considering the problem of network security under the background of big data, the clustering analysis algorithms can be utilized to improve the correctness of network intrusion detection models for security management. As a kind of iterative clustering analysis algorithm, K-means algorithm is not only simple but also efficient, so it is widely used. However, the traditional K-means algorithm cannot well solve the network security problem when facing big data due to its high complexity and limited processing ability. In this case, this paper proposes to optimize the traditional K-means algorithm based on the Spark platform and deploy the optimized clustering analysis algorithm in the distributed architecture, so as to improve the efficiency of clustering algorithm for network intrusion detection in big data environment. The experimental result shows that, compared with the traditional K-means algorithm, the efficiency of the optimized K-means algorithm using a Spark-based method is significantly improved in the running time.", "venue": "IDAACS International Symposium on Wireless Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-17", "journal": {"name": "2020 IEEE 5th International Symposium on Smart and Wireless Systems within the Conferences on Intelligent Data Acquisition and Advanced Computing Systems (IDAACS-SWS)", "pages": "1-4"}, "authors": [{"authorId": "145305524", "name": "Hui Xu"}, {"authorId": "2155468576", "name": "Wei Zhang"}, {"authorId": "2041316551", "name": "Man Gao"}, {"authorId": "1390823158", "name": "Hongwe Chen"}], "citations": [{"paperId": "2881f2637c88ee6b4da1d9f5f7871a8fc18b8f0a", "title": "Status Quo Intelligent Evaluation of the Network Security Legal Awareness: Modelling and Simulations"}, {"paperId": "2bb8fb8feeeb8b04d450f57d71b1e80a5a858ff8", "title": "Cluster Validity Index With Stochastic Extreme Gradient Boost Big Data For Big Data Based On Density Discriminant Analysis"}]}
