{"paperId": "3c450f9c7e6d14c325fb0ddb7e9e4e2055a03840", "publicationVenue": null, "title": "Review of Big Data and Processing Frameworks for Disaster Response Applications", "abstract": "Natural hazards result in devastating losses in human life, environmental assets and personal, and regional and national economies. The availability of different big data such as satellite imageries, Global Positioning System (GPS) traces, mobile Call Detail Records (CDRs), social media posts, etc., in conjunction with advances in data analytic techniques (e.g., data mining and big data processing, machine learning and deep learning) can facilitate the extraction of geospatial information that is critical for rapid and effective disaster response. However, disaster response systems development usually requires the integration of data from different sources (streaming data sources and data sources at rest) with different characteristics and types, which consequently have different processing needs. Deciding which processing framework to use for a specific big data to perform a given task is usually a challenge for researchers from the disaster management field. Therefore, this paper contributes in four aspects. Firstly, potential big data sources are described and characterized. Secondly, the big data processing frameworks are characterized and grouped based on the sources of data they handle. Then, a short description of each big data processing framework is provided and a comparison of processing frameworks in each group is carried out considering the main aspects such as computing cluster architecture, data flow, data processing model, fault-tolerance, scalability, latency, back-pressure mechanism, programming languages, and support for machine learning libraries, which are related to specific processing needs. Finally, a link between big data and processing frameworks is established, based on the processing provisioning for essential tasks in the response phase of disaster management.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-09-03", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "387", "volume": "8"}, "authors": [{"authorId": "51249576", "name": "S. Cumbane"}, {"authorId": "1728613", "name": "Gyözö Gidófalvi"}], "citations": [{"paperId": "91a8064acbfc85ba59e89e4a9b94b9829ce5aa10", "title": "Recently emerging trends in big data analytic methods for modeling and combating climate change effects"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "09c483edabac911878244afde762d3e7b1d0c5ff", "title": "Using Cellular Infrastructures Data to Foster the Transition Towards Smart Cities: a Systematic Mapping"}, {"paperId": "d5de7dac9367cc8a7877b5a884d4f7f9b919c2d5", "title": "Recent developments in geographic information systems across different application domains: a review"}, {"paperId": "bae184c5ca8a95d0e37af0036e7c46fba62fa855", "title": "The Use of Decision Support in Search and Rescue: A Systematic Literature Review"}, {"paperId": "22c42edfa7790410e0b7de065c331abcb11f5fea", "title": "Spatio-temporal Analysis of Mobile Phone and Social Media Data Across Multiple Disaster Scenarios: An Input to Population Exposure Assessment"}, {"paperId": "9c253252ee881dffc531431e75b67610030bb51f", "title": "A comparative study of big data use in Egyptian agriculture"}, {"paperId": "ca80a71cb1a321baf3252fa2ce99e4a2962df883", "title": "A systematic literature review on the use of big data analytics in humanitarian and disaster operations"}, {"paperId": "dd25b08264a261c9b35cdcec6e91ce84128a95da", "title": "Critical success factors for geospatial data sharing in disaster management"}, {"paperId": "eb8336b822988741a0b0b772a51314a15a7451d7", "title": "A novel framework for the automated healthcare disaster based on intellectual machine learning"}, {"paperId": "0952bd46640b17d7c65c93da7579d97b304fa140", "title": "Anomalous human activity fluctuations from digital trace data signal flood inundation status"}, {"paperId": "388a8cbeca59ca55398c85e61f2ae3431d3784df", "title": "A Comparative Analysis of Big Data Frameworks: An Adoption Perspective"}, {"paperId": "9e8426fa380dc6160360d693e3b94eba7660415f", "title": "DRMACert: Certification for Disaster Response Mobile Applications"}, {"paperId": "94933ddec856499c5bb5d76b9062eaef6dd0191a", "title": "Design of Internet of Things and big data analytics-based disaster risk management"}, {"paperId": "52dba5c6c96ca34c6f7f0a61a0c36fe33d7a1136", "title": "VR Interactive Game System Based on Unity3d and Flow Data Processing"}, {"paperId": "4ee7f64ff8cd0974645959937a289d87fff45b4e", "title": "Spatial Distribution of Displaced Population Estimated Using Mobile Phone Data to Support Disaster Response Activities"}, {"paperId": "c44bd49c867cc80f1dc73a09c6c3ba2b24ef045d", "title": "A Big Data Reference Architecture for Emergency Management"}, {"paperId": "db633d5a36df1155ed877926a371a925d112bbe4", "title": "A Distributed Stream Processing Middleware Framework for Real-Time Analysis of Heterogeneous Data on Big Data Platform: Case of Environmental Monitoring"}, {"paperId": "2cc95e3d4b363b950ea4efb59786ba14fcccfc54", "title": "Impact Analysis on Disaster Data for Disaster Risk Reduction from Multiple Stakeholders Perspective"}, {"paperId": "f30219e52292825430aed684acf7fb47365ca0ff", "title": "A Conceptual Framework for using Big Data in Egyptian Agriculture"}, {"paperId": "cb895facae3de0d7f5ae06b078604f5f35f5ba7e", "title": "Stream Processing"}, {"paperId": "32f27e1b5c82f38412a9c791d6e87fab63cb2692", "title": "A Formulation of Big Data Analytics Model in Strengthening the Disaster Risk Reduction"}, {"paperId": "4d81d6a8327ad59a525f9616259664a1720ba775", "title": "Satellites in Emergency Management: A Bibliometric Analysis"}]}
