{"paperId": "3c4d9121155ece334a80cf72ae7f78f668dca304", "publicationVenue": {"id": "5a284490-40a3-4a14-a5c1-51a423dffad6", "name": "ACM International Conference on Embedded Networked Sensor Systems", "type": "conference", "alternate_names": ["ACM Int Conf Embed Networked Sens Syst", "International Conference on Embedded Networked Sensor Systems", "Int Conf Embed Networked Sens Syst", "SenSys"], "url": "https://dl.acm.org/conference/sensys"}, "title": "Starfish: resilient image compression for AIoT cameras", "abstract": "Cameras are key enablers for a wide range of IoT use cases including smart cities, intelligent transportation, AI-enabled farms, and more. These IoT applications require cloud software (including models) to act on the images. However, traditional task oblivious compression techniques are a poor fit for delivering images over low power IoT networks that are lossy and limited in capacity. The key challenge is their brittleness against packet loss; they are highly sensitive to small amounts of packet loss requiring retransmission for transport, which further reduces the available capacity of the network. We propose Starfish, a design that achieves better compression ratios and is graceful with packet loss. In addition to that, Starfish features content-awareness and task-awareness, meaning that we can build specialized codecs for each application scenario and optimized for task objectives, including objective/perceptual quality as well as AI tasks directly. We carefully design the DNN architecture and use an AutoML method to search for TinyML models that work on extremely low power/cost AIoT accelerators. Starfish is not only the first image compress framework that works on a $3 AIoT accelerators but also outperforms JPEG, a well-established baseline, by up to 3x, in terms of bandwidth efficiency and up to 2.5x as efficient in energy consumption. It also features graceful and gradual performance degradation in the presence of packet loss. The application-level simulation indicates that Starfish could deliver 3.7x images while providing better image quality.", "venue": "ACM International Conference on Embedded Networked Sensor Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-11-16", "journal": {"name": "Proceedings of the 18th Conference on Embedded Networked Sensor Systems"}, "authors": [{"authorId": "48956018", "name": "Pan Hu"}, {"authorId": "2260812", "name": "Junha Im"}, {"authorId": "2341661", "name": "Zain Asgar"}, {"authorId": "2546322", "name": "S. Katti"}], "citations": [{"paperId": "0ef3bdec646f079164c6fb410e6a0b6aa2c8f6de", "title": "Intelligent Edge-powered Data Reduction: A Systematic Literature Review"}, {"paperId": "1ddd94286730c84cfc3f4d751005d0884eeef751", "title": "Towards an AI-Driven Data Reduction Framework for Smart City Applications"}, {"paperId": "d75c97baa880d49111feec00931e239d4eeeb7c1", "title": "Progressive Neural Compression for Adaptive Image Offloading Under Timing Constraints"}, {"paperId": "063db2b9939d2699fb2b193b62912f1e235a1427", "title": "Configuration-Adaptive Wireless Visual Sensing System With Deep Reinforcement Learning"}, {"paperId": "ac393cc9907cdf1d5f179eec862a1c0a976327c1", "title": "Tracking Targets in Hyper-Scale Cameras Using Movement Predication"}, {"paperId": "e3af105fe6d0e470a4a76979d402af994372b85e", "title": "DVFO: Learning-Based DVFS for Energy-Efficient Edge-Cloud Collaborative Inference"}, {"paperId": "89d8652120eebdece4fb3cefafa7a2ce37c489f2", "title": "Data transmission reduction formalization for cloud offloading-based IoT systems"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "6b532c521cb59d2a0e41a5a85e8f0546e476ed91", "title": "Tutti: coupling 5G RAN and mobile edge computing for latency-critical video analytics"}, {"paperId": "084a8f1f237e50c0e3b90db29dde2323cb23683d", "title": "A low-rate encoder for image transmission using LoRa communication modules"}, {"paperId": "ce3f3749ecda91dfe263c98fd2bc20c60a6c4a2a", "title": "NeuriCam: Key-Frame Video Super-Resolution and Colorization for IoT Cameras"}, {"paperId": "6d7099e4bfe8259a33fea17dc8f9a4c8ea98b7e9", "title": "FHDnn: communication efficient and robust federated learning for AIoT networks"}, {"paperId": "22efc46612029b089a63206f3c47d7f89fd74fac", "title": "NeuroMessenger: Towards Error Tolerant Distributed Machine Learning Over Edge Networks"}, {"paperId": "a5487bc654643cf64ba6137a7c980c3d682bf891", "title": "DNN-Driven Compressive Offloading for Edge-Assisted Semantic Video Segmentation"}, {"paperId": "a98e51e3c0c3f12a085269dcd24525a754777304", "title": "A Learning Framework for Bandwidth-Efficient Distributed Inference in Wireless IoT"}, {"paperId": "a08bae9de88b23d51341e8ad1aff4b95bee810bb", "title": "An Effective Forest Fire Detection Framework Using Heterogeneous Wireless Multimedia Sensor Networks"}, {"paperId": "e15a1d52b3702366fa915ff62018f9f2a74f463a", "title": "Egeria: Efficient DNN Training with Knowledge-Guided Layer Freezing"}, {"paperId": "da54c442273fb223e946cefea1bf798b02083e1e", "title": "Centipede: Leveraging the Distributed Camera Crowd for Cooperative Video Data Storage"}, {"paperId": "2e96ca3e753e4618e14b2fa27632bd918a125533", "title": "A review on TinyML: State-of-the-art and prospects"}, {"paperId": "a394155f8cd29451ade92156cab75c8d2a9c5440", "title": "DVFO: Dynamic Voltage, Frequency Scaling and Workload Offloading for DNN Edge Inference"}, {"paperId": "392f8749e947c3cceef82fed045557b542a99989", "title": "NeuriCam: Video Super-Resolution and Colorization Using Key Frames"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}]}
