{"paperId": "3c56da45f8d8f5d3c86b369a05789fc6d7724bee", "publicationVenue": null, "title": "A Novel Tour Planning Model using Big Data", "abstract": "Nowadays, many people travel around the world to visit attractions places which have tremendous economic impact on the countries. Tour planning is one of the most beneficial areas in tourism, but the production of tourism tools and tour planning process are not easy tasks. The purpose of the tour planning tools is to increase the satisfaction of tourists, which is provided with a high number of visits and reduced time between visits and travel costs. In this paper, a novel model is proposed for tour planning based on user demands and considering important parameters such as tour cost, traffic volume, weather and time of tour in the city of tourist destination. This model generates various tour plans using big data which comprise traffic data, weather data, events data, tourism data and tourist profile. It offers the best plan according to user priorities and constraints. The main purpose of this model is to select the points of interest by the user, and to arrange the visits based on the knowledge obtained from the big data of the tour planning.", "venue": "2018 International Conference on Artificial Intelligence and Data Processing (IDAP)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 International Conference on Artificial Intelligence and Data Processing (IDAP)", "pages": "1-6"}, "authors": [{"authorId": "66178814", "name": "Mahdis Banaie Dezfouli"}, {"authorId": "9270466", "name": "M. H. Nadimi Shahraki"}, {"authorId": "2066035671", "name": "Hoda Zamani"}], "citations": [{"paperId": "c80961a3566c1058e8d7059444aa43414ae428da", "title": "BE-GWO: Binary extremum-based grey wolf optimizer for discrete optimization problems"}, {"paperId": "b35e36839676bd24c2ec1548ed9436b8d13ffd80", "title": "An Effective Hybridization of Quantum-based Avian Navigation and Bonobo Optimizers to Solve Numerical and Mechanical Engineering Problems"}, {"paperId": "4d6900f34f99c07f9293d9d2d9781c65b71cf628", "title": "MMKE: Multi-trial vector-based monkey king evolution algorithm and its applications for engineering optimization problems"}, {"paperId": "c067538eb3b2888c7d3f48648695fc9ffd2d4344", "title": "Binary Aquila Optimizer for Selecting Effective Features from Medical Data: A COVID-19 Case Study"}, {"paperId": "2f0aa5e37c541839d773e248a7bab6f134a8136f", "title": "Starling murmuration optimizer: A novel bio-inspired algorithm for global and engineering optimization"}, {"paperId": "b6e83b70ef8965e5327353c00e236ede0080d7d9", "title": "An Improved Moth-Flame Optimization Algorithm with Adaptation Mechanism to Solve Numerical and Mechanical Engineering Problems"}, {"paperId": "1c66bf3fba368d05a38d24e18527cd201282fc74", "title": "EWOA-OPF: Effective Whale Optimization Algorithm to Solve Optimal Power Flow Problem"}, {"paperId": "729853bb60ab99f16a3cf72cd21a60218a46e088", "title": "DMFO-CD: A Discrete Moth-Flame Optimization Algorithm for Community Detection"}, {"paperId": "e60d3a903d07e3ac1f90f64bc8b50723dbcda906", "title": "B-MFO: A Binary Moth-Flame Optimization for Feature Selection from Medical Datasets"}, {"paperId": "38f96b369dd9f32c539b47b0c668164873543d20", "title": "R-GWO: Representative-based grey wolf optimizer for solving engineering problems"}, {"paperId": "385303ec4bf19c9f4dc0d455d66022981c10c834", "title": "Binary Sine Cosine Algorithms for Feature Selection from Medical Data"}, {"paperId": "5d881903d8dcff99f8404508ff6dc2c82a27fcf9", "title": "A Binary Metaheuristic Algorithm for Wrapper Feature Selection"}]}
