{"paperId": "3c580b5ffd611098edaaacdd921759705f9ebffa", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Deep Lake: a Lakehouse for Deep Learning", "abstract": "Traditional data lakes provide critical data infrastructure for analytical workloads by enabling time travel, running SQL queries, ingesting data with ACID transactions, and visualizing petabyte-scale datasets on cloud storage. They allow organizations to break down data silos, unlock data-driven decision-making, improve operational efficiency, and reduce costs. However, as deep learning usage increases, traditional data lakes are not well-designed for applications such as natural language processing (NLP), audio processing, computer vision, and applications involving non-tabular datasets. This paper presents Deep Lake, an open-source lakehouse for deep learning applications developed at Activeloop. Deep Lake maintains the benefits of a vanilla data lake with one key difference: it stores complex data, such as images, videos, annotations, as well as tabular data, in the form of tensors and rapidly streams the data over the network to (a) Tensor Query Language, (b) in-browser visualization engine, or (c) deep learning frameworks without sacrificing GPU utilization. Datasets stored in Deep Lake can be accessed from PyTorch, TensorFlow, JAX, and integrate with numerous MLOps tools.", "venue": "Conference on Innovative Data Systems Research", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-22", "journal": {"name": "ArXiv", "volume": "abs/2209.10785"}, "authors": [{"authorId": "51278356", "name": "S. Hambardzumyan"}, {"authorId": "2048019377", "name": "Abhina Tuli"}, {"authorId": "2185721982", "name": "Levon Ghukasyan"}, {"authorId": "2137293430", "name": "Fariz Rahman"}, {"authorId": "1900500991", "name": "Hrant Topchyan"}, {"authorId": "2185707490", "name": "David Isayan"}, {"authorId": "4524377", "name": "M. Harutyunyan"}, {"authorId": "10111751", "name": "Tatevik Hakobyan"}, {"authorId": "13530331", "name": "I. Stranic"}, {"authorId": "13576513", "name": "Davit Buniatyan"}], "citations": [{"paperId": "a96648f16b9704bc04764753e4145f3065659998", "title": "RINAS: Training with Dataset Shuffling Can Be General and Fast"}, {"paperId": "d33ef83d63c44462f6eaa8746d924af27f360e09", "title": "VisionKG: Unleashing the Power of Visual Datasets via Knowledge Graph"}, {"paperId": "545869d935d0f1d127366685170e95577d014086", "title": "The Dynamic Sensorium competition for predicting large-scale mouse visual cortex activity from videos"}, {"paperId": "a24c8ad1a21bb735a327051d2b193d90669dff7d", "title": "MaskSearch: Querying Image Masks at Scale"}, {"paperId": "6e8a9aef98269f89c1d6307114d94da0205fa6d5", "title": "Mithridates: Auditing and Boosting Backdoor Resistance of Machine Learning Pipelines"}, {"paperId": "ab91ab2e3325db87f3ef68504cf99ddd1bfb5a88", "title": "An Overview of the Data-Loader Landscape: Comparative Performance Analysis"}, {"paperId": "cbeaa7fe8e3d86a2b46fc10c0788a26836847f18", "title": "Data Lakes: A Survey of Functions and Systems"}, {"paperId": "be3dd37921a2b053653117d52973a833a797f0a2", "title": "Hyperparameter Search Is All You Need For Training-Agnostic Backdoor Robustness"}, {"paperId": "349ddff1141510e5b1b07084463be71e4be3054e", "title": "Mithridates: Boosting Natural Resistance to Backdoor Learning"}]}
