{"paperId": "3c648529783d941f0afc1b9345c13df93a194d4a", "publicationVenue": null, "title": "Sentiment Analysis of Social Media Data using Hadoop Framework: A Survey", "abstract": "Nowadays, online social media have become the important platform across the globe to share information. People prefer online social media as it is easy to share their opinions on a daily basis hence sentiment analysis is of utmost importance wherein people rely on the opinions shared online. With this extensive growth in the usage of online social media, huge amount of social data is generated. How to process this large set of data efficiently, effectively and in a manner suitable for the user is an important research topic. In this paper, we firstly introduce the definition of sentiment analysis as well as Hadoop and describe the Hadoop architecture, then focus on the analysis of Hadoop framework for sentiment analysis of social media data.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2016-10-17", "journal": {"name": "International Journal of Computer Applications", "pages": "7-10", "volume": "151"}, "authors": [{"authorId": "33792727", "name": "Anisha P. Rodrigues"}, {"authorId": "2722512", "name": "Niranjan N. Chiplunkar"}, {"authorId": "123616149", "name": "Anujna Rao"}], "citations": [{"paperId": "9deb7d4835e18034008e65e7e55c2578135b99a9", "title": "Hadoop framework for efficient sentiment classification using trees"}, {"paperId": "e3aee578635c60a6e89dbbdd5d9cc682a870fde6", "title": "Twitter data analysis using hadoop ecosystems and apache zeppelin"}, {"paperId": "70c2df78eeaddc6964ea3fc9819b1f71d89d6f6b", "title": "Analysis of Comments on Youtube Videos using Hadoop"}, {"paperId": "dc8740f36437b44948fe0aa50345bed57937d137", "title": "Sentiment Analysis on LinkedIn Comments"}, {"paperId": "752a86c372239371dbcfa1b01c887eb0f8913cae", "title": "Sentiment Analysis of Restaurant Reviews"}, {"paperId": "0fafdc9644596ddaaf2264b6585b65a539b879d7", "title": "SENTIMENT ANALYSIS OF TWITTER DATA IN HADOOP USING NAÏVE BAYES AND FUZZY C MEANS CLUSTERING"}]}
