{"paperId": "3c6b895a98ab5ec49bd5efdbada561710a59a9c7", "publicationVenue": {"id": "efca3dc7-b950-48b9-8a74-4fa7bce9cb76", "name": "Inventions", "issn": "2411-5134", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-668154", "alternate_urls": ["https://www.mdpi.com/journal/inventions", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-668154"]}, "title": "A Comprehensive Survey on Data Utility and Privacy: Taking Indian Healthcare System as a Potential Case Study", "abstract": "Background: According to the renowned and Oscar award-winning American actor and film director Marlon Brando, “privacy is not something that I am merely entitled to, it is an absolute prerequisite.” Privacy threats and data breaches occur daily, and countries are mitigating the consequences caused by privacy and data breaches. The Indian healthcare industry is one of the largest and rapidly developing industry. Overall, healthcare management is changing from disease-centric into patient-centric systems. Healthcare data analysis also plays a crucial role in healthcare management, and the privacy of patient records must receive equal attention. Purpose: This paper mainly presents the utility and privacy factors of the Indian healthcare data and discusses the utility aspect and privacy problems concerning Indian healthcare systems. It defines policies that reform Indian healthcare systems. The case study of the NITI Aayog report is presented to explain how reformation occurs in Indian healthcare systems. Findings: It is found that there have been numerous research studies conducted on Indian healthcare data across all dimensions; however, privacy problems in healthcare, specifically in India, are caused by prevalent complacency, culture, politics, budget limitations, large population, and existing infrastructures. This paper reviews the Indian healthcare system and the applications that drive it. Additionally, the paper also maps that how privacy issues are happening in every healthcare sector in India. Originality/Value: To understand these factors and gain insights, understanding Indian healthcare systems first is crucial. To the best of our knowledge, we found no recent papers that thoroughly reviewed the Indian healthcare system and its privacy issues. The paper is original in terms of its overview of the healthcare system and privacy issues. Social Implications: Privacy has been the most ignored part of the Indian healthcare system. With India being a country with a population of 130 billion, much healthcare data are generated every day. The chances of data breaches and other privacy violations on such sensitive data cannot be avoided as they cause severe concerns for individuals. This paper segregates the healthcare system’s advances and lists the privacy that needs to be addressed first.", "venue": "Inventions", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-06-23", "journal": {"name": "Inventions"}, "authors": [{"authorId": "9348833", "name": "Prathamesh P. Churi"}, {"authorId": "144025675", "name": "A. Pawar"}, {"authorId": "1490693349", "name": "Antonio-José Moreno-Guerrero"}], "citations": [{"paperId": "2d0f323d5af7b0a817ba6c8cb52803c33d744d1b", "title": "PAs in India: A survey report on qualifications, deployment, specialties, and job satisfaction."}, {"paperId": "e1ca6666e5cc7cf288cc436eb465df9b3dd170d3", "title": "Understanding Data Breach from a Global Perspective: Incident Visualization and Data Protection Law Review"}, {"paperId": "b649ccd16851a0ab0e89620542257f3063d901b1", "title": "Performance analysis of perturbation-based privacy preserving techniques: an experimental perspective"}, {"paperId": "b6ba945b5fd392da1c337b1bb6b0df3af3d59d60", "title": "Construção e validação de um e-book sobre risco cardiovascular em pessoas vivendo com o vírus da imunodeficiência humana"}, {"paperId": "271dd30dae6ba9bb6dc67e4ea6c73699785b4e5f", "title": "Construction and validation of an e-book about cardiovascular risk in people living with the human immunodeficiency virus"}, {"paperId": "2d8b75c1c35ebbdb9351bf30073a2a9dc2a0385d", "title": "Cognitive computing technological trends and future research directions in healthcare - A systematic literature review"}, {"paperId": "4f420811ee70e30a6ef22ad53e81565cab843a37", "title": "A Secure BlockChain Framework for IoT Healthcare"}, {"paperId": "4f400266b24e1b627f1b21b2d7985856604a8d22", "title": "Utility-driven assessment of anonymized data via clustering"}, {"paperId": "023f7b21bf75f82def4e60cbc595479a16d47b62", "title": "Appropriateness of Alerts and Physicians’ Responses With a Medication-Related Clinical Decision Support System: Retrospective Observational Study"}, {"paperId": "73bb63956100f1d26abe59a4412669c31ebf868d", "title": "Secure Model for IoT Healthcare System under Encrypted Blockchain Framework"}, {"paperId": "b824298bf03569bbff9c4ff35a13c81d5d14fd46", "title": "Bridging unlinkability and data utility: Privacy preserving data publication schemes for healthcare informatics"}, {"paperId": "19f531d413ff628f5e63136a089411d4ad52ebce", "title": "The Factors Contributing to Physicians’ Current Use of and Satisfaction With Electronic Health Records in Kuwait’s Public Health Care: Cross-sectional Questionnaire Study"}, {"paperId": "e3ac0d20f24df84f2313de979cfc06b1b3d3cd8e", "title": "EMERGING TRENDS IN INFORMATION AND COMMUNICATION TECHNOLOGIES FOR SMART HEALTHCARE SYSTEM"}, {"paperId": "fb2686911e54d43550900b9b2791b10960d05090", "title": "An analysis of the increasing cases of data breaches in india"}, {"paperId": "608394729f4fbb581b122ebbbf88967ea467d99f", "title": "A Comprehensive Analysis of Privacy Protection Techniques Developed for COVID-19 Pandemic"}]}
