{"paperId": "3c75c1e06f4e6f58023e1f41210b2606920190a2", "publicationVenue": null, "title": "Optimizing OLAP Cubes Construction by Improving Data Placement on Multi-nodes Clusters", "abstract": "The increasing volumes of relational data let us find an alternative to cope with them. The Hadoop framework - which is an open source project based on the MapReduce paradigm - is a popular choice for big data analytics. However, the performance gained from Hadoop's features is currently limited by its default block placement policy, which does not take any data characteristics into account. Indeed, the efficiency of many operations can be improved by a careful data placement, including indexing, grouping, aggregation and joins. In this paper we propose a data warehouse placement policy to improve query gain performances on multi nodes clusters, especially Hadoop clusters. We investigate the performance gain for OLAP cube construction query with and without data organization. And this, by varying the number of nodes and data warehouse size. It has been found that, the proposed data placement policy has lowered global execution time for building OLAP data cubes up to 20 percent compared to default data placement.", "venue": "2015 23rd Euromicro International Conference on Parallel, Distributed, and Network-Based Processing", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-03-04", "journal": {"name": "2015 23rd Euromicro International Conference on Parallel, Distributed, and Network-Based Processing", "pages": "520-524"}, "authors": [{"authorId": "1769989", "name": "Billel Arres"}, {"authorId": "1774419", "name": "N. Kabachi"}, {"authorId": "1735803", "name": "Omar Boussaïd"}], "citations": [{"paperId": "02197c795325672ee95d508e96a8b2d57092b8ce", "title": "A comparative study of cluster-based Big Data Cube implementations"}, {"paperId": "b8cd0dd4911e1f6cb33c2fca9c5c936178783245", "title": "SDWP: A New Data Placement Strategy for Distributed Big Data Warehouses in Hadoop"}, {"paperId": "62caa0f9bf0d81d1162873319935663c03f97631", "title": "Partitioning and Bucketing Techniques to Speed up Query Processing in Spark-SQL"}, {"paperId": "a92bb7ea2b3b6b25f7d1b3db6313de0f547e44fa", "title": "Loop Query of Big Data with Low Transmission Cost"}, {"paperId": "51c7e63392c22b3f311088ae5f80ba872e2b6657", "title": "A Data Mining-based Blocks Placement Optimization for Distributed Data Warehouses"}, {"paperId": "2288ffd22f0137249a654ad04280f55fdfd6a38e", "title": "A Data Pre-partitioning and Distribution Optimization Approach for Distributed Data Warehouses"}]}
