{"paperId": "3c761194051d0552b4a6b70da2b82da0bbea5c97", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Scalable Linear Algebra on a Relational Database System", "abstract": "As data analytics has become an important application for modern data management systems, a new category of data management system has appeared recently: the scalable linear algebra system. In this paper, we argue that a parallel or distributed database system is actually an excellent platform upon which to build such functionality. Most relational systems already have support for cost-based optimization—which is vital to scaling linear algebra computations—and it is well-known how to make relational systems scale. We show that by making just a few changes to a parallel/distributed relational database system, such a system can be a competitive platform for scalable linear algebra. Taken together, our results should at least raise the possibility that brand new systems designed from the ground up to support scalable linear algebra are not absolutely necessary, and that such systems could instead be built on top of existing relational technology. Our results also suggest that if scalable linear algebra is to be added to a modern dataflow platform such as Spark, they should be added on top of the system's more structured (relational) data abstractions, rather than being constructed directly on top of the system's raw dataflow operators.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "1224-1238", "volume": "31"}, "authors": [{"authorId": "40298273", "name": "Shangyu Luo"}, {"authorId": "31963326", "name": "Zekai J. Gao"}, {"authorId": "1705924", "name": "M. Gubanov"}, {"authorId": "2248828", "name": "L. Perez"}, {"authorId": "153762821", "name": "Christopher Jermaine"}], "citations": [{"paperId": "4a58f24b0bf620729f43b880b29f801f1917848e", "title": "In-Database Machine Learning with CorgiPile: Stochastic Gradient Descent without Full Data Shuffle"}, {"paperId": "570f3dc9c87a81d8377c38aa6a26c465028c3f7a", "title": "Givens rotations for QR decomposition, SVD and PCA over database joins"}, {"paperId": "57876f54c79c2f75376268f01554579f48784947", "title": "Matrix Query Languages"}, {"paperId": "6952211b90fbb0f32a7e8f5719ca4c0ee0c27268", "title": "On matrices and K-relations"}, {"paperId": "cb4b3413c7048d1de2aed3b877aa694b5514a68c", "title": "On the Expressive Power of Linear Algebra on Graphs"}, {"paperId": "1006edbd19994f2859e3ac17f01ce3fb3d674ea1", "title": "Learning Models over Relational Data Using Sparse Tensors and Functional Dependencies"}, {"paperId": "4738dacf3970bbb6e23a2cdf60f9297410d7bb1f", "title": "In-Database Learning with Sparse Tensors"}]}
