{"paperId": "3c7a444279236ebcb1a25408fb844c1173516585", "publicationVenue": {"id": "da80dc02-2106-4cc6-8a2c-814239ebb3be", "name": "Critical reviews in clinical laboratory sciences", "type": "journal", "alternate_names": ["Crit Rev Clin Lab Sci", "Critical Reviews in Clinical Laboratory Sciences", "Crit rev clin lab sci"], "issn": "1040-8363", "url": "http://www.tandfonline.com/ilab", "alternate_urls": ["http://www.tandfonline.com/loi/ilab", "http://www.tandfonline.com/loi/ilab19"]}, "title": "Disruptive innovations in the clinical laboratory: catching the wave of precision diagnostics", "abstract": "Abstract Disruptive innovation is an invention that disrupts an existing market and creates a new one by providing a different set of values, which ultimately overtakes the existing market. Typically, when disruptive innovations are introduced, their performance is initially less than existing standard technologies, but because of their ability to bring the cost down, and with gradual improvement, they end up replacing established service standards. Disruptive technologies have their fingerprints in health care. Pathology and laboratory medicine are fertile soils for disruptive innovations because they are heavily reliant on technology. Disruptive innovations have resulted in a revolution of our diagnostic ability and will take laboratory medicine to the next level of patient care. There are several examples of disruptive innovations in the clinical laboratory. Digitizing pathology practice is an example of disruptive technology, with many advantages and an extended scope of applications. Next-generation sequencing can be disruptive in two ways. The first is by replacing an array of laboratory tests, which each requires expensive and specialized instruments and expertise, with a single cost-effective technology. The second is by disrupting the current paradigm of the clinical laboratory as a diagnostic service by taking it into a new era of preventive or primary care pathology. Other disruptive innovations include the use of dry chemistry reagents in chemistry analyzers and also point of care testing. The use of artificial intelligence is another promising disruptive innovation that can transform the future of pathology and laboratory medicine. Another emerging disruptive concept is the integration of two fields of medicine to create an interrelated discipline such as “histogenomics and radiohistomics.” Another recent disruptive innovation in laboratory medicine is the use of social media in clinical practice, education, and publication. There are multiple reasons to encourage disruptive innovations in the clinical laboratory, including the escalating cost of health care, the need for better accessibility of diagnostic care, and the increased demand on the laboratory in the era of precision diagnostics. There are, however, a number of challenges that need to be overcome such as the significant resistance to disruptive innovations by current technology providers and governmental regulatory bodies. The hesitance from health care providers and insurance companies must also be addressed. Adoption of disruptive innovations requires a multifaceted approach that involves orchestrated solutions to key aspects of the process, including creating successful business models, multidisciplinary collaborations, and innovative accreditation and regulatory oversight. It also must be coupled with successful commercialization plans and modernization of health care structure. Fostering a culture of disruptive innovation requires establishing unique collaborative models between academia and industry. It also requires uncovering new sources of unconventional funding that are open to high-risk high-reward projects. It should also be matched with innovative thinking, including new approaches for delivery of care and identifying novel cohorts of patients who can benefit from disruptive technology.", "venue": "Critical reviews in clinical laboratory sciences", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-23", "journal": {"name": "Critical Reviews in Clinical Laboratory Sciences", "pages": "546 - 562", "volume": "58"}, "authors": [{"authorId": "2120443809", "name": "Ziyad Khatab"}, {"authorId": "4006320", "name": "G. Yousef"}], "citations": [{"paperId": "754b7bca0632a19ff1e43c92de0770dd5a774c1c", "title": "Pathologist workload, burnout, and wellness: connecting the dots"}, {"paperId": "89bbd7a65ada76358273173e543cd8d09c3c95af", "title": "Taking the train of digital health and artificial intelligence to improve medical laboratory service in Africa: Key considerations"}, {"paperId": "22d51ecb0b656482f85f4123c5a1f5ff34616817", "title": "Dynamics of Social Enterprises in Health Care Delivery: Contexts, Models, and Policy Insights From Malaysia"}, {"paperId": "f9881a355fc4769f5d95e45524fcf27579f83e66", "title": "Artificial Intelligence as a Disruptive Technology—A Systematic Literature Review"}, {"paperId": "4a5c020500732d58c522951c31f93b2f916716b3", "title": "Digital transformation towards the clinical laboratory of the future. Perspectives for the next decade"}, {"paperId": "364af5a442304718779661ab86ba9c62825830f4", "title": "Principles of laboratory service management in modern conditions"}, {"paperId": "c4f84a3199409fc2932365028bfc2951144de44b", "title": "Open Innovation as the Catalyst in the Personalized Medicine to Personalized Digital Medicine Transition"}, {"paperId": "78e9e397c6711714032cb459414aba5ad440c664", "title": "La industria 4.0 como apoyo al ODS 9 (Industria, Innovación e Infraestructura) en MIPyMES del sur de Tamaulipas"}]}
