{"paperId": "3c7d71c59f50808c839ac1def6de64ab2fc13674", "publicationVenue": null, "title": "HDVis: An Interactive Heart Disease Analysis Through Visualization System", "abstract": "Heart disease is a disorder in which blood arteries get clogged and the heart ceases to beat. According to several research, this disorder has overtaken cancer as such top cause of death. The fact that anomalies can only be noticed and acknowledged at the end of the process is alarming. It is, however, treatable if the sickness is detected early. The purpose of this study is to develop an interactive visual way (Vis) to analyze heart disease (HD) and its components. First, the data on heart illness was analyzed using a case study method. Second, we look at how user-centered technology may help us address these issues, and we create a Vis called “HDVis” to analyze and display raw data as visualizations like graphs, and a variety more interaction options. This aids in the extraction of important data as well as the portrayal of that data clearly and understandably. Furthermore, we emphasize several crucial findings of this research that might benefit the inquiry of the healthcare community. To test our solution, we conducted 20-person user research. By allowing iterative study and adjustment of the material on such a platform with multiple points of view, the HDVis technology enhances the workflow of visual interpretation. The findings indicate that perhaps the medical community should concentrate too much on establishing proper legislative measures to reduce the incidence of HD.", "venue": "2022 IEEE International Conference on Data Science and Information System (ICDSIS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-29", "journal": {"name": "2022 IEEE International Conference on Data Science and Information System (ICDSIS)", "pages": "1-6"}, "authors": [{"authorId": "2219047515", "name": "Md. Maidul Islam"}, {"authorId": "2187822701", "name": "Tanzina Nasrin Tania"}, {"authorId": "2066061053", "name": "Sharmin Akter"}], "citations": []}
