{"paperId": "3c8b3f27ccc8eb2a502531deef3aef2612951806", "publicationVenue": {"id": "82d7e641-6b2a-4a1c-86b5-bcc9918c6d56", "name": "Frontiers in Neuroinformatics", "type": "journal", "alternate_names": ["Front Neuroinformatics"], "issn": "1662-5196", "url": "https://www.frontiersin.org/journals/neuroinformatics", "alternate_urls": ["http://www.frontiersin.org/neuroinformatics/", "http://journal.frontiersin.org/journal/neuroinformatics"]}, "title": "Machine learning for autism spectrum disorder diagnosis using structural magnetic resonance imaging: Promising but challenging", "abstract": "Autism spectrum disorder (ASD) is a complex neurodevelopmental disorder that affects approximately 1% of the population and causes significant burdens. ASD’s pathogenesis remains elusive; hence, diagnosis is based on a constellation of behaviors. Structural magnetic resonance imaging (sMRI) studies have shown several abnormalities in volumetric and geometric features of the autistic brain. However, inconsistent findings prevented most contributions from being translated into clinical practice. Establishing reliable biomarkers for ASD using sMRI is crucial for the correct diagnosis and treatment. In recent years, machine learning (ML) and specifically deep learning (DL) have quickly extended to almost every sector, notably in disease diagnosis. Thus, this has led to a shift and improvement in ASD diagnostic methods, fulfilling most clinical diagnostic requirements. However, ASD discovery remains difficult. This review examines the ML-based ASD diagnosis literature over the past 5 years. A literature-based taxonomy of the research landscape has been mapped, and the major aspects of this topic have been covered. First, we provide an overview of ML’s general classification pipeline and the features of sMRI. Next, representative studies are highlighted and discussed in detail with respect to methods, and biomarkers. Finally, we highlight many common challenges and make recommendations for future directions. In short, the limited sample size was the main obstacle; Thus, comprehensive data sets and rigorous methods are necessary to check the generalizability of the results. ML technologies are expected to advance significantly in the coming years, contributing to the diagnosis of ASD and helping clinicians soon.", "venue": "Frontiers in Neuroinformatics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-09-28", "journal": {"name": "Frontiers in Neuroinformatics", "volume": "16"}, "authors": [{"authorId": "2186194883", "name": "Reem Ahmed Bahathiq"}, {"authorId": "8306368", "name": "H. Banjar"}, {"authorId": "7627007", "name": "Ahmed K. Bamaga"}, {"authorId": "2412745", "name": "Salma Kammoun Jarraya"}], "citations": [{"paperId": "bab06c4bd637e0ea9cfa01b4f889658f79862035", "title": "Morphometric network-based abnormalities correlate with psychiatric comorbidities and gene expression in PCDH19-related developmental and epileptic encephalopathy"}, {"paperId": "1c32d8fd538acf399e06ea7d3f26606428901c44", "title": "Etiologic Evaluation of Children with Autism Spectrum Disorder"}, {"paperId": "01af9ee8126feab0251dc46f38b78ea7e60bbc27", "title": "Diagnosing autism severity associated with physical fitness and gray matter volume in children with autism spectrum disorder: Explainable machine learning method."}, {"paperId": "9b408d8a71ca149e6fdac5e9ea43d7609c95a369", "title": "Validation of plasma protein glycation and oxidation biomarkers for the diagnosis of autism."}, {"paperId": "5bdae9492fde4bcf1c997e74570729ca6ba6e058", "title": "The Dynamical Biomarkers in Functional Connectivity of Autism Spectrum Disorder Based on Dynamic Graph Embedding"}, {"paperId": "12e40d3fff82853ac302f64b7af3fdc7000970a3", "title": "Do it the transformer way: A comprehensive review of brain and vision transformers for autism spectrum disorder diagnosis and classification"}, {"paperId": "d6ba7648d80b4b4c9120a503baaabe0efd2d8b97", "title": "A Predictive Analysis of Autism Spectrum Disorder Using Ensemble Techniques of Machine Learning"}, {"paperId": "1a23e66e00c7e764fb1b3aa318e2434a8c22c57f", "title": "Enhancing the diagnosis of autism spectrum disorder using phenotypic, structural, and functional MRI data"}, {"paperId": "63ff292d842044f3c60e216bee6ad54806b916d1", "title": "Few-Shot Classification of Autism Spectrum Disorder using Site-Agnostic Meta-Learning and Brain MRI"}, {"paperId": "3ec95843584d7467caf06ca47195fc9615714db8", "title": "COMPARISON OF MACHINE LEARNING MODELS FOR AUTOMATED AUTISM DIAGNOSIS"}, {"paperId": "d6d17ea29ec844ae5f26dbb85dc7800126ab184d", "title": "Few-Shot Classification of Autism Spectrum Disorder using Site-Agnostic Meta-Learning and Brain MRI"}]}
