{"paperId": "3c8baa86d137c0270626618aee26c50e8a25eb8f", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "Network-Aware Container Placement in Cloud-Edge Kubernetes Clusters", "abstract": "With the diffusion of Fog and Edge Computing paradigms, new application categories have emerged with specific quality of service requirements, in terms of communication latency and throughput. The placement of these applications on distributed Cloud-Edge environments is a challenging task, because of the continuously varying node-to-node network latency and bandwidth on Edge infrastructure. Although Kubernetes is the de-facto standard for container orchestration on Cloud data centers, its scheduling strategy is not suitable for the placement of time critical applications on Edge environments because it does not take into account current network conditions, neither communication requirements between microservices during its scheduling decisions. In this work we propose a network-aware scheduler plugin that extends the default Kubernetes scheduler, in order to deal with variable network conditions on cloud-edge clusters and run-time communication requirements of microservices. A custom descheduler is also proposed that periodically monitors run-time network state and traffic exchanged between microservices and evicts Pods from cluster nodes if better placement decisions can be done. An evaluation of our scheduling and descheduling strategies has been carried out on a sample microservices-based application deployed on a test bed environment.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "2022 22nd IEEE International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "859-865"}, "authors": [{"authorId": "2106438773", "name": "Angelo Marchese"}, {"authorId": "1725309", "name": "O. Tomarchio"}], "citations": [{"paperId": "902c76c480dac94cb26883fff1afadd46f1cae98", "title": "Toward Distributively Build Time-Sensitive-Service Coverage in Compute First Networking"}, {"paperId": "090a9686b12ada78112e8c3f5865859d9d3373d6", "title": "Cost-aware service placement and scheduling in the Edge-Cloud Continuum"}, {"paperId": "72619d65b36406539a4f81a659cba66f721cfc03", "title": "Cost-Effective Scheduling for Kubernetes in the Edge-to-Cloud Continuum"}, {"paperId": "be8ce2d58abb7e0324b268bb8b0147b4446e6270", "title": "CSFRL: A Reinforcement Learning Technology Enabled Computing Power Scheduling Framework Based on Kubernetes"}, {"paperId": "3d8679dbb88e50186345563aac67f035c52f4e8d", "title": "Online Dynamic Container Rescheduling for Improved Application Service Time"}, {"paperId": "8056571c1753318679b4cbc58b0bd86964fa228f", "title": "The Impact of Directed Pod Eviction on Kubernetes Resource Utilization"}, {"paperId": "2c8bccb96bc922eb57d824b573a417e31597fa39", "title": "Cloud-Native Computing: A Survey From the Perspective of Services"}, {"paperId": "f9f6a5b0f16083df7685630677a3834ccbcfee95", "title": "Sophos: A Framework for Application Orchestration in the Cloud-to-Edge Continuum"}]}
