{"paperId": "3c8e12256d6da5904c6b21bf3da3c394b060cb12", "publicationVenue": {"id": "7b19fb63-6e4e-4972-bd80-9e2b17941c95", "name": "Royal Society Open Science", "type": "journal", "alternate_names": ["R Soc Open Sci"], "issn": "2054-5703", "url": "https://royalsocietypublishing.org/journal/rsos", "alternate_urls": ["http://rsos.royalsocietypublishing.org/"]}, "title": "Study on the file management method of data storage system for airborne radar", "abstract": "In order to solve the problem that the air-to-ground data transfer rate is much lower than the radar data rate, the onboard system is commonly used for storing the airborne radar data. However, there are two main problems in the data storage using the traditional file management method. The first is that the frequent data updating of the file allocation table (FAT) and the file directory table (FDT) cause a high frequency of address jumps among the discontinuous areas, which leads to a long response time. The second is that the updating frequencies of the FAT, the FDT and the data region are seriously inconsistent, which results in uneven wear of the three areas. To solve these two problems, a file management method, which optimizes the data writing in the three areas of the FAT, the FDT and the data region, is proposed in this study. An actual measurement is carried out on a data storage system of the airborne radar using the proposed file management method. The result shows that the proposed method significantly reduces the updating frequency of FAT and FDT, and achieves the wear levelling of file area and data region.", "venue": "Royal Society Open Science", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "Royal Society Open Science", "volume": "8"}, "authors": [{"authorId": "46985157", "name": "H. Tian"}, {"authorId": "2089846068", "name": "Fangfang Ju"}, {"authorId": "2113809213", "name": "Hongshan Nie"}, {"authorId": "2136400915", "name": "Qiong Yang"}, {"authorId": "2108185808", "name": "Yuanyu Wu"}, {"authorId": "2133436176", "name": "Shuangjian Li"}], "citations": [{"paperId": "3e1589b405b21a70a1ed5b61c01b1424ef2e9314", "title": "Research on intelligent file management system: a design strategy based on RFID technology and improved AICT algorithm"}, {"paperId": "deaafd832d6bd7851b99060fa0eb44c91c12f87d", "title": "RadarSSD: A Computational Storage for Radar Signal Processing"}]}
