{"paperId": "3c9c2dbc162346eadd7c3120b5adce0d3cd1fb12", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on IoT Smart Healthcare: Emerging Technologies, Applications, Challenges, and Future Trends", "abstract": "The internet of things (IoT) refers to a framework of interrelated, web associated objects that can gather and move information over a remote network without human interference. With a quick development in the arrangement of IoT gadgets and expanding want to make medical care more financially savvy, customized, and proactive, IoT is ready to assume a solid function in all perspectives of the healthcare industry. In this context, IoT-based healthcare provides several benefits such as instant and reliable treatment, cost reduction, improved communication, etc. by using different new technologies. Wireless Body Area Networks (WBAN) technologies can enhance the quality of data gathering and data transferring in smart systems. Machine Learning(ML) are put to use at every level of smart healthcare systems. Fog computing reduces communication cost and provides low latency. Software-Defined Networking (SDN) and Network Function Virtualization (NFV) technologies provide less complex and more flexible network structures. Blockchain technology offers a better way of protection of users' sensitive information. This paper aims to provide comprehensive descriptions of ongoing research projects and the utilization of the above-mentioned technologies in smart healthcare systems. In this paper, the latest studies, proposed techniques, and the current solutions of smart healthcare systems are elaborated in the context of emerging technologies, applications and challenges of these systems to provide a better understanding of what IoT means in the healthcare industry now and what it will mean in the future.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-05", "journal": {"name": "ArXiv", "volume": "abs/2109.02042"}, "authors": [{"authorId": "3332735", "name": "M. A. Tunc"}, {"authorId": "2114368966", "name": "Emre Gures"}, {"authorId": "2176228", "name": "Ibraheem Shayea"}], "citations": [{"paperId": "c99e1313da13ea5f67fff5e6ab6b6cbee62fa5a9", "title": "The Role of Fog Computing and IoT in WBAN: Enhancing Healthcare Efficacy"}, {"paperId": "cb95453932b9aedaade7bf9ddd575fa13bbaa127", "title": "Towards Smart Healthcare: Challenges and Opportunities in IoT and ML"}, {"paperId": "f2d0f3dc518a0a309ecfb8c56d76dbf764a2f36a", "title": "Exploring IoT-Applications: A Survey of Recent Progress, Challenges, and Impact of AI, Blockchain, and Disruptive Technologies"}, {"paperId": "65e82ca0af137e83bdc4e5823fb5647e2ab78cbc", "title": "Navigating the IoT landscape: Unraveling forensics, security issues, applications, research challenges, and future"}, {"paperId": "efec8ea85089568009d52af7e0ace6fc9e5ac1fc", "title": "Advancement of Smart Healthcare Monitoring Systems in an Internet of Things-based Environment"}, {"paperId": "bfaa6888fcdedcdab906b7b75fb23645f2ece669", "title": "IoT Device Identification: A Machine Learning Assessment"}, {"paperId": "f67c3dee32c8ff71deee5c7392a6be6be6dd407d", "title": "Adaptive Handover Decision Algorithm for Load Balancing in 5G Heterogeneous Networks"}, {"paperId": "89e6323c8a901ba85103d8f0d1fa5ea8e16ac1d2", "title": "Telemedicine Framework in COVID-19 Pandemic"}, {"paperId": "0bcc580c7b00a1fbfd7ffe6104aa16f3b59caac8", "title": "Fuzzy Logic-Based Load Balancing Algorithm in Heterogeneous Networks"}, {"paperId": "fbea129e0869de18d3d6b4e816dfacf80e771782", "title": "E-Cardiac Care: A Comprehensive Systematic Literature Review"}, {"paperId": "2283d7d769b3e3fed49b74ace3af5516a0b21f28", "title": "Modern Intelligent Health Systems: Queueing, Simulation"}, {"paperId": "2d2bee18fed2434a4b2af924b95cb224149f0552", "title": "Smart Cities: Concepts, Standarts, Frameworks, Models, Technologies"}, {"paperId": "08afea3d8d4c0e9a554198a4ffe7cb6808f0c883", "title": "Advanced EHR system in homes-in-schools’ automation using internet of things and machine learning"}, {"paperId": "7cb0692f4539b20cc18c96ce7bfb524e218af9ae", "title": "Pervasive Healthcare Internet of Things: A Survey"}, {"paperId": "e9d6cd9b35215029e544dbaf18c5bd38154fd474", "title": "A survey on COVID-19 impact in the healthcare domain: worldwide market implementation, applications, security and privacy issues, challenges and future prospects"}, {"paperId": "9e78d66913f80006fe6930423b3c9bb28b2bc162", "title": "Integration of Hybrid Networks, AI, Ultra Massive-MIMO, THz Frequency, and FBMC Modulation Toward 6G Requirements: A Review"}, {"paperId": "6be922e744a0b33c18693a8d5456e952bc2ba2bd", "title": "Machine Learning Based Load Balancing Algorithms in Future Heterogeneous Networks: A Survey"}, {"paperId": "18a5f59d6f0cb8e6b5a48310c3233c6a1a6112bf", "title": "Iot-Based COVID-19 Remote Patient Treatment System Using Arduino"}]}
