{"paperId": "3cad3e658384ac56fbbf5ae3e76fc5dc4557b0fc", "publicationVenue": {"id": "dc5f2e48-3f23-4c26-aa6d-731461dddebe", "name": "International Conference on Software Architecture", "type": "conference", "alternate_names": ["IEEE/IFIP International Conference on Software Architecture", "Int Conf Softw Archit", "ICSA", "IEEE/IFIP Int Conf Softw Archit"], "url": "http://icsa-conferences.org/"}, "title": "Towards a Reference Architecture for Cloud-Based Plant Genotyping and Phenotyping Analysis Frameworks", "abstract": "The domain of plant genotyping and phenotyping presents a number of challenges in the area of large data computation. Various tools and systems have been developed to automate the scientific workflows and support the computational needs of this domain. In this paper, we review a number of the popular systems (i.e., Galaxy, iPlant, GenAp and LemnaTec) in the domain of plant genotyping and phenotyping using the scenario-based architectural analysis method (SAAM). In particular, we focus on how different stakeholders are using these systems in a variety of scenarios and to what extent the systems support their needs. Our SAAM analysis shows that the existing systems have shortcomings. For example, they are limited in their support for high throughput processing of large amounts of heterogeneous types of data. Based on our findings we propose a reference architecture along with a preliminary evaluation in the subject domain. The reference architecture and its evaluation is aimed at helping developers/architects create suitable architectural designs and select appropriate technologies when developing plant phenotyping and genotyping systems.", "venue": "International Conference on Software Architecture", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2017-04-03", "journal": {"name": "2017 IEEE International Conference on Software Architecture (ICSA)", "pages": "41-50"}, "authors": [{"authorId": "50666808", "name": "B. Roy"}, {"authorId": "2785515", "name": "A. Mondal"}, {"authorId": "1738612", "name": "C. Roy"}, {"authorId": "38558513", "name": "Kevin A. Schneider"}, {"authorId": "11031783", "name": "Kawser Wazed"}], "citations": [{"paperId": "b94d7852d06e035f8cca9c3beddfcd099a18f2d9", "title": "Smart and Adaptive Architecture for a Dedicated Internet of Things Network Comprised of Diverse Entities: A Proposal and Evaluation"}, {"paperId": "73b1f5ad853620d6ccfc09cc98affaa9954a5344", "title": "Clustering of mobile IoT nodes with support for scheduling of time-sensitive applications in fog and cloud layers"}, {"paperId": "b96434cb6c8f88219e1a96224658513f0c6e3dbd", "title": "Fog-based architecture for scheduling multiple workflows with high availability requirement"}, {"paperId": "af4afbf2465b3ff08ed9762e0c8810c101cb23d6", "title": "VizSciFlow: A Visually Guided Scripting Framework for Supporting Complex Scientific Data Analysis"}, {"paperId": "c8fed8830caf52edea31a2ba040b86516cdaa4ec", "title": "Extending reference architecture of big data systems towards machine learning in edge computing environments"}, {"paperId": "83a29c498c1ce7e2470e76d01ec0c1affd8d2473", "title": "A Data Management Scheme for Micro-Level Modular Computation-Intensive Programs in Big Data Platforms"}, {"paperId": "4ed6321c60c66521dec9ce2ad32fe596bd78fe72", "title": "A longitudinal study of popular ad libraries in the Google Play Store"}, {"paperId": "7b99f20582e1ff8899773e7afd13499fb4d53cde", "title": "Micro-level Modularity of Computaion-intensive Programs in Big Data Platforms: A Case Study with Image Data"}, {"paperId": "85aea81ff3255013a113a08819871e62708495d5", "title": "An Intermediate Data-driven Methodology for Scientific Workflow Management System to Support Reusability"}, {"paperId": "4ec7dbc01ee0652c128909a17109325e1a0cfc9c", "title": "An Exploratory Study on Automatic Architectural Change Analysis Using Natural Language Processing Techniques"}, {"paperId": "17e1c12c8607d84584e7d6fdf19c261dcf16597b", "title": "Designing for Real-Time Groupware Systems to Support Complex Scientific Data Analysis"}, {"paperId": "178169837cc97d2aa52f391384b8baf30e3c0a2f", "title": "Application of image-based phenotyping tools to identify QTL for in-field winter survival of winter wheat (Triticum aestivum L.)"}, {"paperId": "aa63cbb6ef20f4da4af4c6a9b8230db63522dae1", "title": "Towards a Reference Architecture with Modular Design for Large-scale Genotyping and Phenotyping Data Analysis: A Case Study with Image Data"}]}
