{"paperId": "3cb45de5c6b0204242bdbd9e7c181c6715c8c2f1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "On the Design of Student Assessment Model Based on Intelligence Quotient using Machine Learning", "abstract": "The goal of this research is to figure out how to calculate academic achievements and students’ cognitive quotients for placement. This study will attempt to forecast students’ intelligence quotients or academic grades to measure the IQ of a student in a holistic manner using all kinds of parameters, from students’ academic records to input from their professors and even their family background, thus creating a dataset of 9000 instances with all these data. We implemented and trained multiple machine learning algorithms on the data and collected the outcomes to select the best algorithm. Students’ quantitative reasoning ability was selected as a parameter that could be assessed by their performance on aptitude tests. Certifications of the student during their bachelor’s degree have been considered, which would also give us an idea about the student’s critical and logical thinking ability. All the parameters were rated on a scale of 1-10. The driving motivation behind this investigation was to discover what parameters force a student to be placed in a company then the final overall “student score” is calculated to determine a student’s intelligence quotient. The final IQ score of the student-generated was graded on a scale of 0-3 and a suitable salary package range for the student was estimated giving the company a good idea of the student’s capability.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2164408725", "name": "Nikhila Kathirisetty"}, {"authorId": "117691911", "name": "R. Jadeja"}, {"authorId": "2141374683", "name": "Deepak Garg"}, {"authorId": "1491243701", "name": "H. Thakkar"}], "citations": [{"paperId": "bbcca9f28622ac2641df4b549827bcdc96e196d9", "title": "Student's Performance-Based Model for Prediction of Placement Factor Using Machine Learning"}, {"paperId": "2773d252b5df82af10c26431473e8a995e3c11c7", "title": "Student Placement Probabilistic Assessment Using Emotional Quotient With Machine Learning: A Conceptual Case Study"}, {"paperId": "66e1fd7ac23750206494efea6776ad04274df3b0", "title": "Inovasi Kurikulum"}]}
