{"paperId": "3cb7ed79a50723133fedcfbfbcb78a88a72972ad", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Development of a model for evaluating the effectiveness of innovative startups based on information cycles and using neural networks", "abstract": "An integrated approach to the creation and development of innovative startup projects in the field of information technology is considered. To conduct research, the authors proposed a model of information cycles of startup projects based on the creation of an information model of such projects. At the same time there are dynamic processes of changes in the parameters of the model, which are turbulent in nature and require the use of tools and methods of artificial intelligence for research. The key areas of knowledge of such influence are defined. The mathematical model of processes of management of development of IT startups on the basis of creation and development of a difficult IT product, taking into account influences of environments of the project is constructed, the basic characteristics are allocated and parameters are defined. To do this, the construction of predictive models is proposed to be carried out by modified Demarc trends, the method of self-organization and the neural network. The modeling of the main objective functions of the mathematical model of these processes is performed. The analysis of the received results is carried out and the conclusions are made.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2128864925", "name": "Morozov Viktor"}, {"authorId": "2128882845", "name": "Kolomiiets Anna"}, {"authorId": "2128888747", "name": "Mezentseva Olga"}], "citations": [{"paperId": "da546ea3e7545efbeeb2b3931c20b7ee5ee745a5", "title": "Exploring the impact of using Chat-GPT on student learning outcomes in technology learning: The comprehensive experiment"}, {"paperId": "aa7cad02781d31b29498a68cd218514476e305df", "title": "USING A VALUE APPROACH TO MANAGE INNOVATIVE PROJECTS"}, {"paperId": "bd47fe15c6cb7b01baa2cd6e1282dbe69d18c15c", "title": "Research on the Use of Machine Learning Methods for Forecasting Time Series when Making Management Decisions in IT Projects Under Martial Law"}]}
