{"paperId": "3cc0756ffe08934c0ddc9ebdbdd695eabb97c567", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Using Camshift and Kalman Algorithm to Trajectory Characteristic Matching of Basketball Players", "abstract": "Because of its unique charm, sports video is widely welcomed by the public in today’s society. Therefore, the analysis and research of sports game video data have high practical significance and commercial value. Taking a basketball game video as an example, this paper studies the tracking feature matching of basketball players’ detection, recognition, and prediction in the game video. This paper is divided into four parts to improve the application of the interactive multimodel algorithm to track characteristic matching: moving object detection, recognition, basketball track characteristic matching, and player track characteristic matching. The main work and research results of each part are as follows: firstly, the improved K-means clustering algorithm is used to segment the golf field area; then, HSV is combined with the RGB Fujian value method to eliminate the field area; at last, straight field lines were extracted by Hough transform, and elliptical field lines were extracted by curve fitting, and the field lines were eliminated to realize the detection of moving objects. Seven normalized Hu invariant moments are used as the target features to realize the recognition of moving targets. By obtaining the feature distance between the sample and the template, the category of the sample is judged, which has a good robustness. The Kalman filter is used to match the characteristics of the basketball trajectory. Aiming at the occlusion of basketball, the least square method was used to fit the basketball trajectory, and the basketball position was predicted at the occlusion moment, which realized the occlusion trajectory matching. The matching of players’ track characteristics is realized by the CamShift algorithm based on the color model, which makes full use of players’ color information and realizes real-time performance. In order to solve the problem of occlusion between players in the track feature matching, CamShift and Kalman algorithms were used to determine the occlusion factor through the search window and then weighted Kalman and CamShift according to the occlusion degree to get the track feature matching result. The experimental results show that the detection time is greatly shortened, the memory space occupied is small, and the effect is very ideal.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-16", "journal": {"name": "Complex.", "pages": "4728814:1-4728814:11", "volume": "2021"}, "authors": [{"authorId": "2114786377", "name": "Shuang Liang"}, {"authorId": "2154899596", "name": "Yang Li"}], "citations": [{"paperId": "4c9195d74af752d58e172542bfb7be3db723b7d9", "title": "Moving scene object tracking method based on deep convolutional neural network"}, {"paperId": "89e2816c45eaf7708290d4f33177ad5630f3b1e6", "title": "Detection and Fine Positioning of Basketball Technical Characteristic Target Based on Deep Learning Algorithm"}, {"paperId": "398c122db0d8c1ebfe5eb1c5903c22ce6fbe7cdc", "title": "Retracted: Using Camshift and Kalman Algorithm to Trajectory Characteristic Matching of Basketball Players"}, {"paperId": "58c9f687f717b9bc8c0ec205d7fd048993669e2e", "title": "Machine Learning-Augmented Micro-Defect Detection on Plastic Straw"}, {"paperId": "c5283fbf886581bc741b86dfe98ed5debc4b0d5f", "title": "HIGH-INTENSITY PHYSICAL TRAINING FOR CHINESE BOXING ATHLETES"}, {"paperId": "71727412cc717a5a7ba629bf4eef0ea15b07e3bb", "title": "A video images-aware knowledge extraction method for intelligent healthcare management of basketball players."}, {"paperId": "9e3f3a0d40eb41268c440e15f9bfdaed29502fee", "title": "A Sports Digital Training System Based on Middle and Bottom Visual Information"}, {"paperId": "c95b772bec013db4e3d13cde2e0486e797c5e56d", "title": "Feature-reduction Fuzzy c-means Clustering for Basketball Players Positioning"}, {"paperId": "fff2e8733e47ef72d61b5b6996830569dee3b058", "title": "Soccer Robot Localization Detection Model Based on Monte Carlo Particle Filter and Template Matching Algorithm"}, {"paperId": "7eb8965cdc7c1f7522babec4ea2636f0aa037603", "title": "Improved Kernel Correlation Filter Based Moving Target Tracking for Robot Grasping"}]}
