{"paperId": "3cc62b3bb01b24aec1016a9a4ab055208d6327f3", "publicationVenue": {"id": "60275282-b076-42f7-99dc-8757c2064681", "name": "Informatics", "type": "journal", "alternate_names": ["Informatics (basel", "Informatics (Basel)"], "issn": "2227-9709", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-390272", "alternate_urls": ["https://www.mdpi.com/journal/informatics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-390272"]}, "title": "Identification of the Consequences of COVID-19 through the Analysis of Data Obtained in Surveys of a Specific Population", "abstract": "The pandemic caused by the 2019 coronavirus disease has marked a total change in the development of society. Since then, its effects have been visible in people, both in work, education and psychological areas. There are many jobs and organizations that have set out to identify the reality of people after the pandemic and how the pandemic has affected their daily lives. To do this, countries have organized data and statistics collection campaigns that allow investigating the new needs of people. With this, instruments such as surveys have become more relevant and valid to know what these needs are. However, the analysis processes must guarantee answers that are able to determine the direct impact that each question has on people’s feelings. This work proposes a framework to determine the incidence values of surveys based on their categories and questions and how they capture the reality of people in areas such as education, the impact of work, family and the stress generated by the pandemic. With the results obtained, each element and category that the population considers a consequence of COVID-19 that affects the normal development of life has been identified.", "venue": "Informatics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-07", "journal": {"name": "Informatics", "pages": "46", "volume": "9"}, "authors": [{"authorId": "1410234504", "name": "W. Villegas-Ch."}, {"authorId": "1404002431", "name": "J. Garcia-Ortiz"}, {"authorId": "1415069761", "name": "Iván Ortiz-Garcés"}, {"authorId": "2089421683", "name": "Santiago Sánchez-Viteri"}], "citations": []}
