{"paperId": "3ccc45d50f0b397078caae01a045fab763e76220", "publicationVenue": null, "title": "Low Latency Deployment of Service-based Data-intensive Applications in Cloud-Edge Environment", "abstract": "Efficiently deploying the service components of data-intensive applications on edge or cloud servers to minimize latency is one of the main challenges faced by the cloudedge environment. Most existing studies consider either service deployment or data placement, rather than the joint optimization of them. To this end, this work considers the driving relationship between data and services in a heterogeneous environment including remote cloud and nearby edge servers, and aims to obtain a satisfactory data placement and service deployment scheme while ensuring the QoS for users. Firstly, we formulate the desired problem and decouple data placement from service deployment by polynomial reduction. Then, a priority-based data placement strategy (PDPS) is proposed, which can generate a data placement scheme. After that, the original problem is reduced to a classical assignment problem, and a service deployment strategy based on an improved Hungarian algorithm (HA-SDS) is proposed to obtain a service deployment scheme. The effectiveness of our proposed method are evaluated by ablation and comparative experiments, which performs better than other existing algorithms.", "venue": "2022 IEEE International Conference on Web Services (ICWS)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-07-01", "journal": {"name": "2022 IEEE International Conference on Web Services (ICWS)", "pages": "57-66"}, "authors": [{"authorId": "2185174227", "name": "Jingtan Jia"}, {"authorId": "40596069", "name": "P. Wang"}], "citations": [{"paperId": "91c94cfbe07b349f016fe2d5fe532595029e88f2", "title": "A Budget-constrained Service Deployment Strategy based on Cost Allocation in Cloud-Edge Environment"}, {"paperId": "7034d45160c8cac0afb8e3a3c99ac3d8fec74145", "title": "Towards Timely Edge-assisted Video Analytics Services"}]}
