{"paperId": "3cd12f39de9f0efa23028f28255883373943f9c8", "publicationVenue": null, "title": "Power modeling for Phytium FT-2000+/64 multi-core architecture", "abstract": "Power and energy consumption is the first-class constraint on high-performance-computing (HPC) systems. Understanding the power consumption on such systems is crucial for software optimization and hardware architecture design. Unfortunately, the subtle interactions between the CPU and the memory subsystem make precise power modeling highly challenging on emerging multi-core architectures. This paper presents the first software-based power model for Phytium FT-2000+/64, an ARM-based HPC multi-core architecture. It shows by carefully choosing and modeling a set of system-wide metrics, one can build an accurate power model for the multi-core CPU and the DRAM memory subsystem, two major energy consumers of an HPC system computing node. We evaluate our approach by applying it to HPCC benchmarks and comparing our results against real power measurement. Experimental results show that our approach is highly accurately in modeling power consumption of FT-2000+/64. The average error rate for CPU power modeling in all the scales (8, 16, 32, 64 processes) is 2%, and the average error rate for memory power modeling is about 7.5%.", "venue": "Proceedings of the Workshop on Benchmarking in the Datacenter", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book"], "publicationDate": "2020-02-22", "journal": {"name": "Proceedings of the Workshop on Benchmarking in the Datacenter"}, "authors": [{"authorId": "72288914", "name": "Zhixin Ou"}, {"authorId": "2108324795", "name": "Juan Chen"}, {"authorId": "1992910760", "name": "Yunfang Zhang"}, {"authorId": "144427011", "name": "Yong Dong"}, {"authorId": "2157706940", "name": "Yuan Yuan"}, {"authorId": "6112006", "name": "Zhenlian Wang"}], "citations": [{"paperId": "96be270e2c1b88a3a3527d006b0cc7615c3dea34", "title": "Evaluating Performance, Power and Energy of Deep Neural Networks on CPUs and GPUs"}]}
