{"paperId": "3cd21b5634574420382dbfdff5dbb0f625dd966b", "publicationVenue": {"id": "c52375db-5573-406f-a12b-854c7ba98498", "name": "BioMed Research International", "type": "journal", "alternate_names": ["Biomed Res Int"], "issn": "2314-6133", "url": "http://www.hindawi.com/journals/bmri", "alternate_urls": ["http://www.hindawi.com/journals/bmri/"]}, "title": "MapReduce Algorithms for Inferring Gene Regulatory Networks from Time-Series Microarray Data Using an Information-Theoretic Approach", "abstract": "Gene regulation is a series of processes that control gene expression and its extent. The connections among genes and their regulatory molecules, usually transcription factors, and a descriptive model of such connections are known as gene regulatory networks (GRNs). Elucidating GRNs is crucial to understand the inner workings of the cell and the complexity of gene interactions. To date, numerous algorithms have been developed to infer gene regulatory networks. However, as the number of identified genes increases and the complexity of their interactions is uncovered, networks and their regulatory mechanisms become cumbersome to test. Furthermore, prodding through experimental results requires an enormous amount of computation, resulting in slow data processing. Therefore, new approaches are needed to expeditiously analyze copious amounts of experimental data resulting from cellular GRNs. To meet this need, cloud computing is promising as reported in the literature. Here, we propose new MapReduce algorithms for inferring gene regulatory networks on a Hadoop cluster in a cloud environment. These algorithms employ an information-theoretic approach to infer GRNs using time-series microarray data. Experimental results show that our MapReduce program is much faster than an existing tool while achieving slightly better prediction accuracy than the existing tool.", "venue": "BioMed Research International", "year": 2017, "fieldsOfStudy": ["Computer Science", "Medicine", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-01-22", "journal": {"name": "BioMed Research International", "volume": "2017"}, "authors": [{"authorId": "10672007", "name": "Yasser Abduallah"}, {"authorId": "2000928", "name": "T. Turki"}, {"authorId": "144321334", "name": "K. Byron"}, {"authorId": "2112456561", "name": "Zongxuan Du"}, {"authorId": "1406526712", "name": "M. Cervantes-Cervantes"}, {"authorId": "29829232", "name": "J. Wang"}], "citations": [{"paperId": "eea1282d82be578d8ba1dd27221b7d26c6b9661b", "title": "SCGRNs: Novel supervised inference of single-cell gene regulatory networks of complex diseases"}, {"paperId": "43d0cd25f2e142381897d2b66d7315d2fb814ff1", "title": "Inference of Large-scale Time-delayed Gene Regulatory Network with Parallel MapReduce Cloud Platform"}, {"paperId": "9e3baeae797bee48ec5783b127ec385032f004a2", "title": "Conception et exploitation d'une base de modèles: application aux data sciences. (Design and Exploitation of a Models Database: Applied to Data Sciences)"}, {"paperId": "5bc40ea862110afa3bf892ae16183ba374ae3d36", "title": "Reverse Engineering Gene Regulatory Networks Using Graph Mining"}, {"paperId": "3f2548f6d1778c1dcea4b50aa1e7ae471e7ea89f", "title": "Reverse Engineering Regulatory Networks in Cells Using a Dynamic Bayesian Network and Mutual Information Scoring Function"}, {"paperId": "e7e232b71dd7c9122d3549471c5ea091ef197966", "title": "A Time-Delayed Information-Theoretic Approach to the Reverse Engineering of Gene Regulatory Networks Using Apache Spark"}, {"paperId": "62958eaed7b3ef07e4f6777ebc18d945de59c6de", "title": "Transfer Learning Approaches to Improve Drug Sensitivity Prediction in Multiple Myeloma Patients"}, {"paperId": "a39f2f917194a84574e48119c53abf0527bf65b8", "title": "Comparing MapReduce and Spark in Computing the PCC Matrix in Gene Co-expression Networks"}, {"paperId": "c4c1727fc5adc0d4c87cf72285840824b041c90f", "title": "HPC Tools to Deal with Microarray Data."}, {"paperId": "e9890607f655e781f73afbe53549c3886c19ef53", "title": "Big data analytics in computational biology and bioinformatics"}, {"paperId": "7945a33dc51d58a0fa8c97ff673b94adb81ae331", "title": "Development and evaluation of machine learning algorithms for biomedical applications"}]}
