{"paperId": "3cd8dc2b28d2d5ca47440deacd34404bef875a0d", "publicationVenue": {"id": "bb899a20-6789-46e4-9ed0-c7c284028fd9", "name": "JMIR mHealth and uHealth", "type": "journal", "alternate_names": ["JMIR mhealth uhealth", "Jmir mhealth and uhealth", "Jmir mhealth uhealth"], "issn": "2291-5222", "url": "https://mhealth.jmir.org/", "alternate_urls": ["https://mhealth.jmir.org/2016/1/e15/"]}, "title": "Clustering Insomnia Patterns by Data From Wearable Devices: Algorithm Development and Validation Study", "abstract": "Background As societies become more complex, larger populations suffer from insomnia. In 2014, the US Centers for Disease Control and Prevention declared that sleep disorders should be dealt with as a public health epidemic. However, it is hard to provide adequate treatment for each insomnia sufferer, since various behavioral characteristics influence symptoms of insomnia collectively. Objective We aim to develop a neural-net based unsupervised user clustering method towards insomnia sufferers in order to clarify the unique traits for each derived groups. Unlike the current diagnosis of insomnia that requires qualitative analysis from interview results, the classification of individuals with insomnia by using various information modalities from smart bands and neural-nets can provide better insight into insomnia treatments. Methods This study, as part of the precision psychiatry initiative, is based on a smart band experiment conducted over 6 weeks on individuals with insomnia. During the experiment period, a total of 42 participants (19 male; average age 22.00 [SD 2.79]) from a large university wore smart bands 24/7, and 3 modalities were collected and examined: sleep patterns, daily activities, and personal demographics. We considered the consecutive daily information as a form of images, learned the latent variables of the images via a convolutional autoencoder (CAE), and clustered and labeled the input images based on the derived features. We then converted consecutive daily information into a sequence of the labels for each subject and finally clustered the people with insomnia based on their predominant labels. Results Our method identified 5 new insomnia-activity clusters of participants that conventional methods have not recognized, and significant differences in sleep and behavioral characteristics were shown among groups (analysis of variance on rank: F4,37=2.36, P=.07 for the sleep_min feature; F4,37=9.05, P<.001 for sleep_efficiency; F4,37=8.16, P<.001 for active_calorie; F4,37=6.53, P<.001 for walks; and F4,37=3.51, P=.02 for stairs). Analyzing the consecutive data through a CAE and clustering could reveal intricate connections between insomnia and various everyday activity markers. Conclusions Our research suggests that unsupervised learning allows health practitioners to devise precise and tailored interventions at the level of data-guided user clusters (ie, precision psychiatry), which could be a novel solution to treating insomnia and other mental disorders.", "venue": "JMIR mHealth and uHealth", "year": 2019, "fieldsOfStudy": ["Medicine", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "JMIR mHealth and uHealth", "volume": "7"}, "authors": [{"authorId": "48079828", "name": "Sungkyu (Shaun) Park"}, {"authorId": "2152574379", "name": "Sang Won Lee"}, {"authorId": "1444699639", "name": "Sungwon Han"}, {"authorId": "1775511", "name": "M. Cha"}], "citations": [{"paperId": "425ce6376c441faf1532f725be97ac8d21f10134", "title": "Stochastic analysis of fog computing and machine learning for scalable low-latency healthcare monitoring"}, {"paperId": "60eaf238efbd0e9510141f880812797eecd17b38", "title": "Fine tuned personalized machine learning models to detect insomnia risk based on data from a smart bed platform"}, {"paperId": "b4946714561a595e9b59ebed530386cb00e86441", "title": "Recognizing Seasonal Sleep Patterns of Elderly in Smart Homes Using Clustering"}, {"paperId": "5ba8fb0eefc4f9203569ce4ad888d15a75ff738c", "title": "Visualizing Wearable Medical Device Research Trends: A Co-occurrence Network-Based Bibliometric Analysis"}, {"paperId": "0d400c7d89a0ba4d07d9196c00c715b5bf42bc7c", "title": "Exploring Digital Biomarkers of Illness Activity in Mood Episodes: Hypotheses Generating and Model Development Study"}, {"paperId": "80fc8b763f44e75c177931fa425bc77c86cdc1af", "title": "Recognizing Long-term Sleep Behaviour Change using Clustering for Elderly in Smart Homes"}, {"paperId": "82306f625e5b0e58d1f670768fac996fa5d0b340", "title": "A Scoping Review of the Use of Machine Learning in Health Economics and Outcomes Research: Part 1-Data From Wearable Devices."}, {"paperId": "fe5624ee86f4d7766f476527997b856c52340cf6", "title": "Challenges and best practices for digital unstructured data enrichment in health research: A systematic narrative review"}, {"paperId": "b97bf4220985e0a2e95f8fe01be5f11ea7a38166", "title": "Machine Learning for Healthcare Wearable Devices: The Big Picture"}, {"paperId": "ca4766acf2cf858d2ed796b73b1841deafae84a4", "title": "Discovering self-quantified patterns using multi-time window models"}, {"paperId": "393af6cf5f1dda21bfec1e5802ee18b3cdbc34d8", "title": "Clinical applications of artificial intelligence in sleep medicine: a sleep clinician’s perspective"}, {"paperId": "78f658721ee06fa2067ec5401e4d55d23833a7c9", "title": "Recent Trends of Artificial Intelligence and Machine Learning for Insomnia Research"}, {"paperId": "a1cbd3f1753527a1131bd32285f3f7aad7bed289", "title": "Machine Learning Techniques to Identify and Characterize Sleep Disorders Using Biosignals"}]}
