{"paperId": "3cf48392eb14a0bb5732e29a9854f4ef093b4e1c", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "Service Selection With Package Bundles and Compatibility Constraints", "abstract": "With the rapid proliferation of strategic alliances between service providers, enterprises cooperate towards service quality improvement and provide lower cost service bundles. This article presents a novel solution to the minimum cost service bundle selection problem for workflows in the presence of singleton subscription costs and service bundle offerings and compatibility requirements. Given a workflow specifying a set of tasks and a set of candidate services for each task, with a set of compatibility constraints between services, the selection problem has the objective of selecting the most suitable service offering(s) for each task. In this article, we analyze the selection problem in the presence of service bundle offerings. We present a novel multi-partite hyper-graph visualization of the selection problem and analyze its hardness. Additionally we present a novel combination of ILP and abstraction refinement as a potential solution, that is shown to expedite a naïve ILP based solution. We present experiments to substantiate this claim.", "venue": "IEEE Transactions on Services Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "3031-3046", "volume": "15"}, "authors": [{"authorId": "52142302", "name": "Kaustabha Ray"}, {"authorId": "3073989", "name": "A. Banerjee"}, {"authorId": "1816617", "name": "S. Mohalik"}], "citations": [{"paperId": "69ab0fe490606bce90c4c83b577aaa92a24f6326", "title": "A QoS-Aware Clustering Based Multi-Layer Model for Web Service Selection"}]}
