{"paperId": "3d10ee58514a041ec45a81e000d1293914cb9e93", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Non-Polar Opposites: Analyzing the Relationship Between Echo Chambers and Hostile Intergroup Interactions on Reddit", "abstract": "Previous research has documented the existence of both online echo chambers and hostile intergroup interactions. In this paper, we explore the relationship between these two phenomena by studying the activity of 5.97M Reddit users and 421M comments posted over 13 years. We examine whether users who are more engaged in echo chambers are more hostile when they comment on other communities. We then create a typology of relationships between political communities based on whether their users are toxic to each other, whether echo chamber-like engagement with these communities has a polarizing effect, and on the communities' political leanings. \n\nWe observe both the echo chamber and hostile intergroup interaction phenomena, but neither holds universally across communities. Contrary to popular belief, we find that polarizing and toxic speech is more dominant between communities on the same, rather than opposing, sides of the political spectrum, especially on the left; however, this mostly points to the collective targeting of political outgroups.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-25", "journal": {"name": "ArXiv", "volume": "abs/2211.14388"}, "authors": [{"authorId": "2128581780", "name": "Alexandros Efstratiou"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "1747580", "name": "T. Caulfield"}, {"authorId": "2350947", "name": "G. Stringhini"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "2064581974", "name": "Emiliano De Cristofaro"}], "citations": [{"paperId": "43a48c7d381a5a30e98ccc318fa4ba800219cb8c", "title": "Bridging or Breaking: Impact of Intergroup Interactions on Religious Polarization"}, {"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "b1296d4ed314f9b1e15880a6d640f54d01d2204b", "title": "\"Here's Your Evidence\": False Consensus in Public Twitter Discussions of COVID-19 Science"}, {"paperId": "e919225a72b2e0ca101028ba0d607cec2bb359aa", "title": "The event-driven nature of online political hostility: How offline political events make online interactions more hostile"}, {"paperId": "b021383084dd7a1f7470c18534ba8f50d400d7ff", "title": "No Space for Reddit Spacing: Mapping the Reflexive Relationship Between Groups on 4chan and Reddit"}, {"paperId": "d402e3c6924e86ac3e73ddd5e3c680ced1276b9f", "title": "Sub-Standards and Mal-Practices: Misinformation's Role in Insular, Polarized, and Toxic Interactions"}]}
