{"paperId": "3d20660aee036dac7ed46a78e838d1b8ccf15cb3", "publicationVenue": {"id": "cb87b91e-7788-4e4f-bed1-6ca64f4102de", "name": "ACM Transactions on Reconfigurable Technology and Systems", "type": "journal", "alternate_names": ["ACM Trans Reconfigurable Technol Syst"], "issn": "1936-7406", "url": "https://trets.cse.sc.edu/index.html", "alternate_urls": ["http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1151&linked=1&part=transaction", "http://portal.acm.org/trets/"]}, "title": "FPGA Acceleration of Probabilistic Sentential Decision Diagrams with High-level Synthesis", "abstract": "Probabilistic Sentential Decision Diagrams (PSDDs) provide efficient methods for modeling and reasoning with probability distributions in the presence of massive logical constraints. PSDDs can also be synthesized from graphical models such as Bayesian networks (BNs) therefore offering a new set of tools for performing inference on these models (in time linear in the PSDD size). Despite these favorable characteristics of PSDDs, we have found multiple challenges in PSDD’s FPGA acceleration. Problems include limited parallelism, data dependency, and small pipeline iterations. In this article, we propose several optimization techniques to solve these issues with novel pipeline scheduling and parallelization schemes. We designed the PSDD kernel with a high-level synthesis (HLS) tool for ease of implementation and verified it on the Xilinx Alveo U250 board. Experimental results show that our methods improve the baseline FPGA HLS implementation performance by 2,200X and the multicore CPU implementation by 20X. The proposed design also outperforms state-of-the-art BN and Sum Product Network (SPN) accelerators that store the graph information in memory.", "venue": "ACM Transactions on Reconfigurable Technology and Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-06", "journal": {"name": "ACM Transactions on Reconfigurable Technology and Systems", "pages": "1 - 22", "volume": "16"}, "authors": [{"authorId": "2167589948", "name": "Young-kyu Choi"}, {"authorId": "2184090122", "name": "Carlos Santillana"}, {"authorId": "2117688661", "name": "Yujia Shen"}, {"authorId": "1700031", "name": "Adnan Darwiche"}, {"authorId": "2259796", "name": "J. Cong"}], "citations": [{"paperId": "8f30d325b555bd0b1cb61e55ed44a67e4b2ce2c4", "title": "The Memory-Bounded Speedup Model and Its Impacts in Computing"}, {"paperId": "c77994dc9e1639b92fc6e8e4b1d229ade3e434ff", "title": "Logarithm-Approximate Floating-Point Multiplier for Hardware-efficient Inference in Probabilistic Circuits"}]}
