{"paperId": "3d2654e239ca2c7671042f381bc2627878ab925c", "publicationVenue": null, "title": "Sparse FCM-Based Map-Reduce Framework for Distributed Parallel Data Clustering in E-Khool Learning Platform", "abstract": "Parallel clustering serves as a platform for handling big data. The literature displays a number of clustering algorithms using a map-reduce framework, but they did not assure the effective clusters such that knowledge extraction becomes tough. With the aim to render a better and effective data clustering method to analyze the big data arriving from distributed systems, this paper uses a new clustering method. The proposed method named as BatDolphin-based Sparse Fuzzy C-Means (BatDol-Sparse FCM) clustering algorithm is proposed that paves way for the optimal selection of the cluster centroids. The distributed big data is managed using the Map-Reduce framework that is inbuilt with the BatDolphin-based Sparse Fuzzy C-Means algorithm such that the local and global clustering is executed. The implementation of the proposed BatDol-Sparse FCM algorithm is done by using data from the E-khool Learning Management System (LMS) and three medical datasets from the UCI repository. The analysis is performed using the metrics, such as clustering accuracy (CA) and dice coefficient (DC). From the simulation results, it is evident that the proposed parallel clustering scheme provided better results than the existing algorithms with the values of 0.96 and 0.9667 for CA and DC respectively.", "venue": "Int. J. Uncertain. Fuzziness Knowl. Based Syst.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Int. J. Uncertain. Fuzziness Knowl. Based Syst.", "pages": "1-23", "volume": "31"}, "authors": [{"authorId": "2215031788", "name": "A. S. Antely"}, {"authorId": "2210469390", "name": "P. Jegatheeswari"}, {"authorId": "2215033863", "name": "M. B. Prasad"}, {"authorId": "2210460717", "name": "V. Vinolin"}, {"authorId": "2210465362", "name": "S. Vinusha"}, {"authorId": "2137296944", "name": "B. Rajakumar"}, {"authorId": "144154014", "name": "D. Binu"}], "citations": []}
