{"paperId": "3d297441afbc2124bc805f2a9a4d3db3e21ae217", "publicationVenue": {"id": "36c06bc2-aa20-4634-bce8-9ca08e27fded", "name": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing", "alternate_names": ["Pac Symp Biocomput Pac Symp Biocomput"], "issn": "2335-6928", "alternate_issns": ["2335-6936"]}, "title": "Clinfo.ai: An Open-Source Retrieval-Augmented Large Language Model System for Answering Medical Questions using Scientific Literature", "abstract": "The quickly-expanding nature of published medical literature makes it challenging for clinicians and researchers to keep up with and summarize recent, relevant findings in a timely manner. While several closed-source summarization tools based on large language models (LLMs) now exist, rigorous and systematic evaluations of their outputs are lacking. Furthermore, there is a paucity of high-quality datasets and appropriate benchmark tasks with which to evaluate these tools. We address these issues with four contributions: we release Clinfo.ai, an open-source WebApp that answers clinical questions based on dynamically retrieved scientific literature; we specify an information retrieval and abstractive summarization task to evaluate the performance of such retrieval-augmented LLM systems; we release a dataset of 200 questions and corresponding answers derived from published systematic reviews, which we name PubMed Retrieval and Synthesis (PubMedRS-200); and report benchmark results for Clinfo.ai and other publicly available OpenQA systems on PubMedRS-200.", "venue": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-24", "journal": {"name": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing", "pages": "\n          8-23\n        ", "volume": "29"}, "authors": [{"authorId": "2052999011", "name": "A. Lozano"}, {"authorId": "2261671769", "name": "Scott L. Fleming"}, {"authorId": "2234347139", "name": "Chia-Chun Chiang"}, {"authorId": "2262093570", "name": "Nigam H. Shah"}], "citations": [{"paperId": "be691e9c403a5ab5bba539e60e3abb5cdac0e72d", "title": "Exploring the Potential of Large Language Models in Neurology, Using Neurologic Localization as an Example"}, {"paperId": "06f7e2637d42419b35f73889ec1aeda3b1362090", "title": "MedInsight: A Multi-Source Context Augmentation Framework for Generating Patient-Centric Medical Responses using Large Language Models"}, {"paperId": "0b220041eb83c23b7b10d32a5d08c0309d528071", "title": "Large Language Models for Information Retrieval: A Survey"}]}
