{"paperId": "3d2aa8bbf27f02dd3bc7800c1fb4d039c0737b07", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Meeting the Requirements of Internet of Things: The Promise of Edge Computing", "abstract": "Over the last few decades, Internet of Things (IoT) has become the spotlight area of research within the Industries and Academics. Primarily, IoT devices are characterized by small and nonscalable resources, including low processing capabilities, less internal memory, and short battery life. However, IoT applications demand extensive storage and faster response to ensure seamless and interoperable communication. Hence, Edge Computing and data/task offloading among the edge or cloud servers become promising, while also posing critical research challenges for edge-enabled large-scale IoT ecosystems. Several research activities have addressed the difficulties of determining an efficient and scalable data offloading strategy utilizing edge and cloud computing-supported technologies. This article focuses on the state-of-the-art edge IoT data offloading techniques, and optimization models in the heterogeneous IoT environment. We examine how edge and cloud-supported technologies can handle delay-sensitive IoT applications efficiently. Moreover, we introduce an IoT-based healthcare use case scenario to explain edge data execution and resource provisioning in IoT networks. Finally, we discuss several challenging issues and possible solutions to establish interoperable communication and computation for IoT applications.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "7474-7498", "volume": "11"}, "authors": [{"authorId": "78788188", "name": "A. Hazra"}, {"authorId": "9208952", "name": "Alakesh Kalita"}, {"authorId": "9332444", "name": "M. Gurusamy"}], "citations": []}
