{"paperId": "3d38c8c3ac758a02817a6879234eb99aa21cd3aa", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Advancements and Challenges in IoT Simulators: A Comprehensive Review", "abstract": "The Internet of Things (IoT) has emerged as an important concept, bridging the physical and digital worlds through interconnected devices. Although the idea of interconnected devices predates the term “Internet of Things”, which was coined in 1999 by Kevin Ashton, the vision of a seamlessly integrated world of devices has been accelerated by advancements in wireless technologies, cost-effective computing, and the ubiquity of mobile devices. This study aims to provide an in-depth review of existing and emerging IoT simulators focusing on their capabilities and real-world applications, and discuss the current challenges and future trends in the IoT simulation area. Despite substantial research in the IoT simulation domain, many studies have a narrow focus, leaving a gap in comprehensive reviews that consider broader IoT development metrics, such as device mobility, energy models, Software-Defined Networking (SDN), and scalability. Notably, there is a lack of literature examining IoT simulators’ capabilities in supporting renewable energy sources and their integration with Vehicular Ad-hoc Network (VANET) simulations. Our review seeks to address this gap, evaluating the ability of IoT simulators to simulate complex, large-scale IoT scenarios and meet specific developmental requirements, as well as examining the current challenges and future trends in the field of IoT simulation. Our systematic analysis has identified several significant gaps in the current literature. A primary concern is the lack of a generic simulator capable of effectively simulating various scenarios across different domains within the IoT environment. As a result, a comprehensive and versatile simulator is required to simulate the diverse scenarios occurring in IoT applications. Additionally, there is a notable gap in simulators that address specific security concerns, particularly battery depletion attacks, which are increasingly relevant in IoT systems. Furthermore, there is a need for further investigation and study regarding the integration of IoT simulators with traffic simulation for VANET environments. In addition, it is noteworthy that renewable energy sources are underrepresented in IoT simulations, despite an increasing global emphasis on environmental sustainability. As a result of these identified gaps, it is imperative to develop more advanced and adaptable IoT simulation tools that are designed to meet the multifaceted challenges and opportunities of the IoT domain.", "venue": "Italian National Conference on Sensors", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-02-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "24"}, "authors": [{"authorId": "2073424788", "name": "Reham Almutairi"}, {"authorId": "2242718848", "name": "Giacomo Bergami"}, {"authorId": "2242482978", "name": "Graham Morgan"}], "citations": [{"paperId": "ceb128e1cdc84fb7ae4871ec604186a76c3fb3ab", "title": "Secure Computing for Fog-Enabled Industrial IoT"}]}
