{"paperId": "3d3bda84052db0c4c6d957183cb4a28e04c94ef4", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Data Provenance in Security and Privacy", "abstract": "Provenance information corresponds to essential metadata that describes the entities, users, and processes involved in the history and evolution of a data object. The benefits of tracking provenance information have been widely understood in a variety of domains; however, only recently have provenance solutions gained interest in the security community. Indeed, on the one hand, provenance allows for a reliable historical analysis enabling security-related applications such as forensic analysis and attribution of malicious activity. On the other hand, the unprecedented changes in the threat landscape place demands for securing provenance information to facilitate its trustworthiness. With the recent growth of provenance studies in security, in this work we examine the role of data provenance in security and privacy. To set this work in context, we outline fundamental principles and models of data provenance and explore how the existing studies achieve security principles. We further review the existing schemes for securing data provenance collection and manipulation known as secure provenance and the role of data provenance for security and privacy, which we refer to as threat provenance.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-22", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 35", "volume": "55"}, "authors": [{"authorId": "19245819", "name": "Bofeng Pan"}, {"authorId": "1773559", "name": "Natalia Stakhanova"}, {"authorId": "144540209", "name": "S. Ray"}], "citations": [{"paperId": "ffce633256a3ada73cf1069d449ac06a47da3e38", "title": "Medical Image Data Provenance for Medical Cyber-Physical System"}, {"paperId": "f76b2688248167247a93ad46931d5f50ae7c35d2", "title": "Tractable Executable Binary Provenance Signalling through Vision Transformers"}, {"paperId": "15bfef0b901a0d2361536b1e99613e2cdc0ecaf1", "title": "ProvSec: Open Cybersecurity System Provenance Analysis Benchmark Dataset with Labels"}, {"paperId": "abee8ca38e6941a96385e35e07b837acfaf63ad2", "title": "ForensiBlock: A Provenance-Driven Blockchain Framework for Data Forensics and Auditability"}, {"paperId": "fd2438327ba33c868a7469d78adf54b2225a1222", "title": "Forensics Science and Using a Color Model Digital Twin Artwork to Identify a Counterfeit"}, {"paperId": "9505d9b2913dcb2a795c3c841a11a7a19d9e026a", "title": "Provenance Data Management in Health Information Systems: A Systematic Literature Review"}, {"paperId": "e650db2530daefac6418dd9f770fb8106eec90bc", "title": "A Near Real-Time Big Data Provenance Generation Method Based on the Conjoint Analysis of Heterogeneous Logs"}, {"paperId": "1bb97646f2f7570382158b424a532fcfac276577", "title": "A Framework for Data Provenance Assurance in Cloud Environment using Ethereum Blockchain"}]}
