{"paperId": "3d4fa6475b03c89fb959ac31f9dba8f1b73e0bb0", "publicationVenue": null, "title": "How can transport impacts of urban growth be modelled? An approach to consider spatial and temporal scales", "abstract": null, "venue": "", "year": 2020, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": ["Review"], "publicationDate": "2020-04-01", "journal": {"name": "Sustainable Cities and Society", "pages": "102031", "volume": "55"}, "authors": [{"authorId": "50442987", "name": "S. Perveen"}, {"authorId": "3266895", "name": "Tan Yigitcanlar"}, {"authorId": "2135695452", "name": "M. Kamruzzaman"}, {"authorId": "2753760", "name": "Duzgun Agdas"}], "citations": [{"paperId": "cd4c496322a0abfc16f91fd30eae04829093ff3d", "title": "Electrification transition and carbon emission reduction of urban passenger transportation systems——A case study of Shenzhen, China"}, {"paperId": "b05f6ffee0a0af3bbd06ca6438149ff26e139e60", "title": "Where Is the Peri-Urban? A Systematic Review of Peri-Urban Research and Approaches for Its Identification and Demarcation Worldwide"}, {"paperId": "9614e5f0ce4bcd5538ae7f4e00f02a15db168ddd", "title": "Evaluating future railway-induced urban growth of twelve cities using multiple SLEUTH models with open-source geospatial inputs"}, {"paperId": "cb28c302d208981fbb5458f0a12c4f83f2fad5cc", "title": "Analysing Urban Growth Using Machine Learning and Open Data: An Artificial Neural Network Modelled Case Study of Five Greek Cities"}, {"paperId": "bc22d928f1cc7b6126b093ed0b265f38a04341f7", "title": "Understanding political bias in climate change belief: A public perception study from South East Queensland"}, {"paperId": "c4edb664e7b082c04e846f5d18922a2113b1cc27", "title": "The impact of urban morphology on transportation: a case study of the city of Al-Kut, Iraq"}, {"paperId": "ce61a76a3ce12f669368f2ddfe9ffb8d2c2569e3", "title": "Are climate change, urbanisation and political views correlated? Empirical evidence from South East Queensland"}, {"paperId": "e878fe9677f449c6366a306a03ae818523a19ab9", "title": "Scenario simulation of CO2 emissions from light-duty passenger vehicles under land use-transport planning: A case of Shenzhen International Low Carbon City"}, {"paperId": "9ca98069b01f7ee2036222e8f80587c487bf7e2c", "title": "Simulating the Impacts of Hybrid Campus and Autonomous Electric Vehicles as GHG Mitigation Strategies: A Case Study for a Mid-Size Canadian Post-Secondary School"}, {"paperId": "76da303ecc42e41df48321a678e1a1b77803e867", "title": "Why is determining peri-urban area boundaries critical for sustainable urban development?"}, {"paperId": "a831e96342aeac54d7fea081ceb4f78c9c754775", "title": "Public perceptions of peri-urbanism triggered climate change: Survey evidence from South East Queensland, Australia"}, {"paperId": "a5d20d5d55aa35c7affd272d4882895e0ed09a78", "title": "The role of Integrated Logistics Centers (ILCs) in modelling the flows of goods in urban areas based on the example of Italy"}, {"paperId": "a59442500084cfb82dbf39d03b1ab9a0e32ddc61", "title": "Selecting Indicators to Monitor and Assess Environmental Health in a Portuguese Urban Setting: A Participatory Approach"}, {"paperId": "c8ad496a6a6d2f19fce5edd72d4eca6cc148fd08", "title": "What is the most suitable methodological approach to demarcate peri-urban areas? A systematic review of the literature"}, {"paperId": "402cc15867ff35c0d34618dcea7ddfeecd030470", "title": "An Adaptive Regenerative Braking Strategy Design Based on Naturalistic Regeneration Performance for Intelligent Vehicles"}]}
