{"paperId": "3d5709e5f5f1cbbde718a765a1fad5474a35ec01", "publicationVenue": null, "title": "Machine Learning for Automatic Resource Management in the Datacenter and the Cloud", "abstract": "Author(s): Yadwadkar, Neeraja Jayant | Advisor(s): Katz, Randy H.; Gonzalez, Joseph E. | Abstract: Traditional resource management techniques that rely on simple heuristics often fail to achieve predictable performance in contemporary complex systems that span physical servers, virtual servers, private and/or public clouds. My research aims to bring the benefits of data-driven models to resource management of such complex systems. In my dissertation, I argue that the advancements in machine learning can be leveraged to manage and optimize today's systems by deriving actionable insights from the performance and utilization data these systems generate. To realize this vision of model-based resource management, we need to deal with the key challenges data-driven models raise: uncertainty in predictions, cost of training, generalizability from benchmark datasets to real-world systems datasets, and interpretability of the models.In this dissertation, to demonstrate how to handle these challenges, we chose two main problem domains: (I) Scheduling in parallel data intensive computational frameworks for improved tail latencies, and (II) Performance-aware resource allocation in the public cloud environments for meeting user-specified performance and cost goals.We begin by presenting Wrangler, a system that predicts when stragglers (slow-running tasks) are going to occur based on cluster resource utilization counters and makes scheduling decisions to avoid such situations. Wrangler introduces a notion of a confidence measure with these predictions to overcome modeling uncertainty. We then describe our Multi-Task Learning formulations that share information between the various models, allowing us to significantly reduce the cost of training. To capture the challenges of resource allocation in the public cloud environments, we present key observations from our empirical analysis based on performance profiles of workloads executing across different public cloud environments. Finally, we describe PARIS, a Performance-Aware Resource Inference System, that we built to enable cloud users to select the best VM (virtual machine) for their applications in the public cloud environments so as to satisfy any performance and cost constraints.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2397000", "name": "N. Yadwadkar"}], "citations": [{"paperId": "08a08ddbd9c3c4e8b178f496e141eb918971f495", "title": "Machine Learning Empowered Intelligent Data Center Networking: A Survey"}, {"paperId": "d7ef891338a6c3983ae4b81b135e188b32b654e9", "title": "Machine Learning (ML)-Centric Resource Management in Cloud Computing: A Review and Future Directions"}, {"paperId": "43a1e9f5afd630392f2712c088222d2a24287cf1", "title": "A Simulator for Intelligent Workload Managers in Heterogeneous Clusters"}, {"paperId": "1f8c66cd903ab12a528396bd4bc085d9ff35a4f8", "title": "Achieving Optimal Cache Utility in Constrained Wireless Networks through Federated Learning"}, {"paperId": "2656b614e032f14098c0e458fe2669295ba19863", "title": "Toward ML-centric cloud platforms"}, {"paperId": "0db0e3c1a5e03372c1bd091514d9b3783a274950", "title": "A scalable and adaptable allocation framework for heterogeneous resources in a large cluster environment"}, {"paperId": "e21948e0af85258d9e4b19013f25374bfc1205da", "title": "Cloud Service Level Agreements and Resource Management"}, {"paperId": "c6f844def026bb7734b06da9167845b12331422d", "title": "Optimizing Distributed Systems using Machine Learning"}]}
