{"paperId": "3d58bf1d2b90d07ded8ddff707caac2a23ea46df", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "FlexMiner: A Pattern-Aware Accelerator for Graph Pattern Mining", "abstract": "Graph pattern mining (GPM) is a class of algorithms widely used in many real-world applications in bio-medicine, e-commerce, security, social sciences, etc. GPM is a computationally intensive problem with an enormous amount of coarse-grain parallelism and therefore, attractive for hardware acceleration. Unfortunately, existing GPM accelerators have not used the best known algorithms and optimizations, and thus offer questionable benefits over software implementations.We present FlexMiner, a software/hardware co-designed GPM accelerator that improves the efficiency without compromising the generality or productivity of state-of-the-art software GPM frameworks. FlexMiner exploits massive amount of coarse-grain parallelism in GPM by deploying a large number of specialized processing elements. For efficient searches, the FlexMiner hardware accepts pattern-specific execution plans, which are generated automatically by the FlexMiner compiler from the given pattern(s). To avoid repetitive computation on neighborhood connectivity, we provide dedicated on-chip storage to memoize reusable connectivity information in a connectivity map (c-map ) which is implemented with low-cost yet high-throughput hardware. The on-chip memories in FlexMiner are managed dynamically using heuristics derived by the compiler, and thus are fully utilized. We have evaluated FlexMiner with 4 GPM applications on a wide range of real-world graphs. Our cycle-accurate simulation shows that FlexMiner with 64 PEs achieves 10.6× speedup on average over the state-of-the-art software system executing 20 threads on a 10-core Intel CPU.", "venue": "International Symposium on Computer Architecture", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-06-01", "journal": {"name": "2021 ACM/IEEE 48th Annual International Symposium on Computer Architecture (ISCA)", "pages": "581-594"}, "authors": [{"authorId": "2108923360", "name": "Xuhao Chen"}, {"authorId": "8243043", "name": "Tianhao Huang"}, {"authorId": "2326476", "name": "Shuotao Xu"}, {"authorId": "2723048", "name": "Thomas Bourgeat"}, {"authorId": "3261653", "name": "Chanwoo Chung"}, {"authorId": "66319904", "name": "A. Arvind"}], "citations": [{"paperId": "69ee8f1f98da4847b3d7ffc9f04a68492873588b", "title": "Enhancing Graph Random Walk Acceleration via Efficient Dataflow and Hybrid Memory Architecture"}, {"paperId": "31d03b23b3ab36e8f79642777e704ed88366777d", "title": "Graph Pattern Mining Paradigms: Consolidation and Renewed Bearing"}, {"paperId": "24e4b683b5b2703cd1b2e8c9331fba1b47fdd01f", "title": "GraphMini: Accelerating Graph Pattern Matching Using Auxiliary Graphs"}, {"paperId": "478247d1e7526ce6fa94dbc710d49a01a6327c7a", "title": "Exploiting the Potential of Flexible Processing Units"}, {"paperId": "b09657afeeb873d0a84f4750ef6b3f8ffc308aca", "title": "HyperGRAF: Hyperdimensional Graph-Based Reasoning Acceleration on FPGA"}, {"paperId": "15d999fbb9779e1e0d791dbd22e08fadcd72b733", "title": "PSMiner: A Pattern-Aware Accelerator for High-Performance Streaming Graph Pattern Mining"}, {"paperId": "2b3e3057e15a67a0a2837d47cd712d2fe5d2ef9f", "title": "Seizing the Bandwidth Scaling of On-Package Interconnect in a Post-Moore's Law World"}, {"paperId": "1bb10600aa2ebc639a878fde3b0c75471abd0da5", "title": "Shogun: A Task Scheduling Framework for Graph Mining Accelerators"}, {"paperId": "cb0d72d300e2042050f31877642caed84d54f3f8", "title": "PIMMiner: A High-performance PIM Architecture-aware Graph Mining Framework"}, {"paperId": "b0e010361793bea5e39a5d6cda8fa75461380569", "title": "GraphINC: Graph Pattern Mining at Network Speed"}, {"paperId": "338191e6464727584b1b67f6e9792641e4c7da4f", "title": "Fast Community Detection in Graphs with Infomap Method using Accelerated Sparse Accumulation"}, {"paperId": "79af8667ea55f0bf63462ee807d001d900754b27", "title": "GAMMA: A Graph Pattern Mining Framework for Large Graphs on GPU"}, {"paperId": "954bf70c187fe0611d0b5ccf5fa13883f1b76de9", "title": "SGCN: Exploiting Compressed-Sparse Features in Deep Graph Convolutional Network Accelerators"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "56c03061c0cb6f6bcb1d9430ce164c7142d6f991", "title": "A GPU-based Graph Pattern Mining System"}, {"paperId": "2a0ea17fc849b1ecb77db0f829e21ff61bec25ec", "title": "Slice-and-Forge: Making Better Use of Caches for Graph Convolutional Network Accelerators"}, {"paperId": "afa3dd52f1ac721d41e658be28ad8e45b1792023", "title": "Mint: An Accelerator For Mining Temporal Motifs"}, {"paperId": "f071772d67f3c6c8cf424666f5653177f538946a", "title": "SDMA: An Efficient and Flexible Sparse-Dense Matrix-Multiplication Architecture for GNNs"}, {"paperId": "66dd43a62358f18a8fbd60aac44b0f11a12346e6", "title": "DIMMining: pruning-efficient and parallel graph mining on near-memory-computing"}, {"paperId": "adbb5d0a264772b32c8aaed9a1bf178afd7a3ec5", "title": "NDMiner: accelerating graph pattern mining using near data processing"}, {"paperId": "5be7d06ee1647b4b257036e8d1f3b4a0ecb0b05c", "title": "Hyperscale FPGA-as-a-service architecture for large-scale distributed graph neural network"}, {"paperId": "e7f11a945bb268378371804536b5e8d4af42563a", "title": "SparseCore: stream ISA and processor specialization for sparse computation"}, {"paperId": "84f8d0441396576a6e916dc9f395bd12c073c24b", "title": "FINGERS: exploiting fine-grained parallelism in graph mining accelerators"}, {"paperId": "e9494701245cabacb11c2f384875a45c9cb2cc21", "title": "A one-for-all and o(v log(v ))-cost solution for parallel merge style operations on sorted key-value arrays"}, {"paperId": "1dc9626062182372d4a97e245a64fcabadbe49ca", "title": "Efficient and Scalable Graph Pattern Mining on GPUs"}, {"paperId": "8d10e435782480689674971bc057bfefc4755548", "title": "Practical Near-Data-Processing Architecture for Large-Scale Distributed Graph Neural Network"}]}
