{"paperId": "3d67ca19f9ea92f34dd8c7643439c2892e69ea83", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Research on Customer Marketing Acceptance for Future Automatic Driving—A Case Study in China City", "abstract": "This paper investigates the acceptance of intelligent driving vehicles in the Chinese market using Guangzhou City as an example and a field questionnaire investigation based on the innovation diffusion theory. First, we tested the reliability and validity of 2530 effective questionnaires in 2018. Second, the cognition, expectations, technical concerns, and prospective expectations data of consumers with respect to intelligent driving vehicles are analyzed statistically. Finally, T-test and Pearson’s correlation analysis is carried out on the intelligent driving vehicle performance parameters and the respondents’ basic information. The research shows that consumers are more focused on the developmental prospects of intelligent driving vehicles and express concerns about their technological safety. Furthermore, the acceptance of intelligent driving cars depends on age, the higher the expectation, the sooner to buy an intelligent, and so on. Ninety percentage of the respondents are willing to purchase intelligent driving vehicles and are willing to pay extra money to buy them. This result will provide an objective reference for the government to issue supporting policies and laws regarding intelligent driving vehicles, and it is useful to help the enterprises to adjust their research and developmental directions for intelligent driving vehicles.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "20938-20949", "volume": "7"}, "authors": [{"authorId": "49528991", "name": "Hai-wei Wang"}, {"authorId": "47349202", "name": "Feng You"}, {"authorId": "2056599764", "name": "Xinnan Chu"}, {"authorId": "2108672944", "name": "Xiaolong Li"}, {"authorId": "2112540433", "name": "Xiaojuan Sun"}], "citations": [{"paperId": "fcecaa58a97fa01b25aa7aa5625527bcd8f1adba", "title": "Survey on the acceptance of smart cars amongst middle-aged and elderly in China"}, {"paperId": "ef05dead71f06dc4567f904fd3f9e1e1d27f197e", "title": "Modeling and analysis of human-machine mixed traffic flow considering the influence of the trust level toward autonomous vehicles"}, {"paperId": "43fe01f5c7a1d7ef7d7101b25c84c516dc3feb48", "title": "Sentiments about autonomous vehicles"}, {"paperId": "4647f6086d7b905217b27ebc1ae3d176f568550d", "title": "Research on Market Prospect of High-Level Automatic Driving"}, {"paperId": "fc105ff4664aa5059b748aa70208d913fd45e1f9", "title": "Driver Drowsiness Detection and Alert System using YOLO"}, {"paperId": "aa10af7ea70da760541112981e960fa48f044208", "title": "An Empirical Study on Drivers’ Willingness to Use Automatic Features of Intelligent Vehicles: A Psychological Empowerment Perspective"}, {"paperId": "3307ce486f7428c1cbfb2337094996606f2a1d6f", "title": "Use of social networking in the Middle East: student perspectives in higher education"}, {"paperId": "d3f2094caacaf12c2993440d79d96cd3c035689c", "title": "A Fatigue Driving Detection Algorithm Based on Facial Motion Information Entropy"}, {"paperId": "b70e402def4c4bd97e2e0e248caf46c797412126", "title": "Vehicle Movement Analyses Considering Altitude Based on Modified Digital Elevation Model and Spherical Bilinear Interpolation Model: Evidence from GPS-Equipped Taxi Data in Sanya, Zhengzhou, and Liaoyang"}, {"paperId": "36aeabd11cf7086ce87835ec3be05103e7bd5a2a", "title": "MaaS and IoT: Concepts, methodologies, and applications"}, {"paperId": "a7e13319274bf21ab173523cf046c149b6b3eea7", "title": "Technological Advancements Within the Canadian Electric Vehicle Industry"}, {"paperId": "676595d606529cb05f96fb76f8909ee2c2bf3852", "title": "Drivers Fatigue Level Prediction Using Facial, and Head Behavior Information"}, {"paperId": "67454a03e66956ada8daba19ff477db673ec0701", "title": "WILLINGNESS TO PAY FOR CONNECTED VEHICLES: AN ALTERNATIVE-SPECIFIC MIXED LOGIT REGRESSION APPROACH"}]}
