{"paperId": "3d6b6fc6987e3b8c32abfd51f0680b8025527d5b", "publicationVenue": null, "title": "Fostering Trustworthiness of Federated Learning Ecosystem through Realistic Scenarios", "abstract": "The present study thoroughly evaluates the most common blocking challenges faced by the federated learning (FL) ecosystem and analyzes existing state-of-the-art solutions. A system adaptation pipeline is designed to enable the integration of different AI-based tools in the FL system, while FL training is conducted under realistic conditions using a distributed hardware infrastructure. The suggested pipeline and FL system’s robustness are tested against challenges related to tool deployment, data heterogeneity, and privacy attacks for multiple tasks and data types. A representative set of AI-based tools and related datasets have been selected to cover several validation cases and distributed to each edge device to closely reflect real-world scenarios. The study presents significant outcomes of the experiments and analyzes the models’ performance under different realistic FL conditions, while highlighting potential limitations and issues that occurred during the FL process.", "venue": "Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-16", "journal": {"name": "Inf.", "pages": "342", "volume": "14"}, "authors": [{"authorId": "40292497", "name": "A. Psaltis"}, {"authorId": "1395031819", "name": "Kassiani Zafeirouli"}, {"authorId": "2727205", "name": "P. Leskovský"}, {"authorId": "10780877", "name": "S. Bourou"}, {"authorId": "2135253098", "name": "Juan Camilo Vásquez-Correa"}, {"authorId": "2336021", "name": "Aitor García-Pablos"}, {"authorId": "2206105393", "name": "S. C. Sánchez"}, {"authorId": "47381330", "name": "A. Dimou"}, {"authorId": "3096444", "name": "C. Patrikakis"}, {"authorId": "1747572", "name": "P. Daras"}], "citations": [{"paperId": "e43a323e57d9c2886b3f75846cc5b03b1e615527", "title": "CODA: an open-source platform for federated analysis and machine learning on distributed healthcare data"}]}
