{"paperId": "3d8090add11821d51c124e35cd907ac76307b79d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Opportunities, Applications, and Challenges of Edge-AI Enabled Video Analytics in Smart Cities: A Systematic Review", "abstract": "Video analytics with deep learning techniques has generated immense interest in academia and industry, captivating minds with its transformative potential. Deep learning techniques and the deluge of video data enable the mechanization of tasks that were once the exclusive domain of human effort. Furthermore, edge intelligence is emerging as an interdisciplinary technology that drives the fusion of edge computing and artificial intelligence (AI). Edge computing allows the Internet of Things (IoT) devices with limited resources to offload their compute-intensive AI applications to the network edge servers for execution. Specifically, AI workloads for video analytics can be moved to the network edge from the cloud, providing improved latency and bandwidth savings, among other benefits. This article reviews current technologies used in Edge AI-assisted video analytics in smart cities. It examines the various artificial intelligence models and privacy-preserving techniques used in edge video analytics. It identifies the various applications of video analytics in smart cities, including security and surveillance, transportation and traffic management, healthcare, education, sports and entertainment, and many more. Besides, it highlights the challenges of edge video analysis and open research issues. It is expected that this review will be valuable for researchers, engineers, and decision-makers who want to understand the landscape and scale of edge video analytics in smart cities.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "80543-80572", "volume": "11"}, "authors": [{"authorId": "48527054", "name": "E. Badidi"}, {"authorId": "1995554", "name": "Karima Moumane"}, {"authorId": "150998718", "name": "Firdaous El Ghazi"}], "citations": [{"paperId": "48f46a149d1030729d1c256d665a7c5b81a8ddf9", "title": "UHD Database Focus on Smart Cities and Smart Transport"}, {"paperId": "89bb81abd527c121a9d8a1487acfe669f9675c14", "title": "Wireless Power Transfer for Smart Power Outlet"}, {"paperId": "db41d4b1cfac2bdef8395c0637bdbd02fc7d27cf", "title": "Blockchain and Machine Learning in EHR Security: A Systematic Review"}]}
