{"paperId": "3d865fa1b2d9150aa47606daf84d6279e9f804fb", "publicationVenue": {"id": "68bb9f10-60db-40b4-a338-3791643238e8", "name": "Journal of Clinical Child & Adolescent Psychology", "type": "journal", "alternate_names": ["J Clin Child  Adolesc Psychol", "J Clin Child Adolesc Psychol", "Journal of Clinical Child and Adolescent Psychology"], "issn": "1537-4416", "url": "http://www.informaworld.com/smpp/title~content=1537-4416", "alternate_urls": ["http://www.tandfonline.com/toc/hcap20/current"]}, "title": "Structural Correlates of Mental Health Support Access among Sexual Minority Youth of Color during COVID-19", "abstract": "ABSTRACT Many youth with mental health needs cannot access treatment, with multiply-marginalized youth, such as sexual minority youth of Color (SMYoC), experiencing both structural and identity-related barriers to care. The COVID-19 pandemic threatens to exacerbate multi-level treatment access barriers facing SMYoC youth nationwide. However, little large-scale research has examined access to mental health care among SMYoC across the United States, either during or prior to the pandemic. Such work is critical to understanding and ameliorating barriers in this domain. Using data from adolescents who self-identified as SMYoC and who endorsed a desire for mental health support during the COVID-19 pandemic (N = 470, ages 13–16, from 43 U.S. states), we examined associations between state-level, structural factors (income inequality; mental health-care provider shortage; anti-Black racism; homophobia; and the interaction between anti-Black racism and homophobia) and SMYoC mental health treatment access. Multinomial logistic regressions revealed state-level mental health-care provider shortage as the only significant predictor of SMYoC reporting they never (versus always) accessed mental health support during the COVID-19 pandemic. SMYoC living in areas with both lower homophobia and lower anti-Black racism were more likely to report always (versus sometimes) accessing mental health treatment. Results highlight the critical importance of considering diverse structural factors and applying an intersectional lens when exploring barriers to mental health treatment among multiply-marginalized youth. In locations where provider shortages are less severe, cultural stigma – including anti-Black racism and homophobia – may still pose challenges for SMYoC in need of mental health care.", "venue": "Journal of Clinical Child & Adolescent Psychology", "year": 2021, "fieldsOfStudy": ["Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-16", "journal": {"name": "Journal of Clinical Child & Adolescent Psychology", "pages": "649 - 658", "volume": "52"}, "authors": [{"authorId": "2006474636", "name": "C. Roulston"}, {"authorId": "12040787", "name": "Sarah C. McKetta"}, {"authorId": "46984071", "name": "Maggi A. Price"}, {"authorId": "6643595", "name": "K. Fox"}, {"authorId": "5265542", "name": "J. Schleider"}], "citations": [{"paperId": "3471e534b35a47f87e1f8f285bf5d3d4f50b1e12", "title": "Introduction: Student Experiences of COVID-19 Around the Globe: Insights from the Pandemic Journaling Project."}, {"paperId": "4895d550a4a198d889dc116ddec25bb54b4e13d0", "title": "Conceptualizing Neighborhood Context in Youth Psychotherapy Research."}, {"paperId": "180c292f1d9caa54acc08cfb18b400c0f3906e1d", "title": "“What Works” to Support LGBTQ+ Young People's Mental Health: An Intersectional Youth Rights Approach"}, {"paperId": "e7feda63c6b73909c7cd8bfc9b17bca3fbb6a1c2", "title": "“A ray of light in the chaos”: Relationships between companion animals and LGBTQ+ emerging adults during the COVID-19 pandemic"}, {"paperId": "e1f510791e93ce72f616e56ff5bdffbfd14e69ec", "title": "Employing Dissemination and Implementation Science to Promote Mental Health Equity for Transgender Youth"}, {"paperId": "0972cdf1e6464935b607ef5f19f67d6587b05de3", "title": "A longitudinal investigation of the effects of the COVID-19 pandemic on 2SLGBTQ+ youth experiencing homelessness"}, {"paperId": "1efcbd36b283444b65a45918a34abcf4d68d08fe", "title": "Internalizing the COVID-19 pandemic: Gendered differences in youth mental health."}, {"paperId": "c728414de87c09de011fe57860e489edf09f06cf", "title": "Crisis as Opportunity, Risk, or Turmoil: Qualitative Study of Youth Narratives About the COVID-19 Pandemic"}, {"paperId": "5765340ef4e02101e2c5320243f59fab39efd3c6", "title": "Structural transphobia is associated with psychological distress and suicidality in a large national sample of transgender adults"}, {"paperId": "05afeaf196aa21105a5a38cd54bb6d44d7b6f203", "title": "Associations between the Self-Reported Likelihood of Receiving the COVID-19 Vaccine, Likelihood of Contracting COVID-19, Discrimination, and Anxiety/Depression by Sexual Orientation"}, {"paperId": "c1fe4f7c8e8a7b352e4d93ccb4b1a908c6122276", "title": "Transgender-Specific Adolescent Mental Health Provider Availability is Substantially Lower in States with More Restrictive Policies."}, {"paperId": "a41a839a0ddd5d0d65d42c50a6eb590172a075b3", "title": "Structural determinants of tailored behavioral health services for sexual and gender minorities in the United States, 2010 to 2020: a panel analysis"}, {"paperId": "dc881f2f9da5e22dfc9adfb025bb346cf5b1e44a", "title": "A protocol for applying health equity-informed implementation science models and frameworks to adapt a sleep intervention for adolescents at risk for suicidal thoughts and behaviors"}, {"paperId": "e0c9e55e88245723fa9858949121e0fb3f070ec8", "title": "Multi‐Disciplinary Collaborative Consensus Guidance Statement on the Assessment and Treatment of Post‐Acute Sequelae of SARS‐CoV‐2 Infection (PASC) in Children and Adolescents"}, {"paperId": "3a052c26ee61f01f9cffd99a1b83a6bd08d4e7b9", "title": "The impacts of COVID-19 on LGBTQ+ foster youth alumni"}, {"paperId": "6c8a7c43bfe17e05664ebb3843452284078be630", "title": "Future Directions in Mental Health Treatment with Stigmatized Youth"}, {"paperId": "baa8e375de9d3b7b7b7885fc8950f3f63ae4e0cb", "title": "COVID-19 and Youth Psychopathological Distress in Umbria, Central Italy: A 2-Year Observational Study in a Real-World Setting"}, {"paperId": "5a9d2091531706c9df52ca051346de67cd402e69", "title": "The impact of COVID-19 on U.S. adolescents: loss of basic needs and engagement in health risk behaviors"}, {"paperId": "c74ac693747f99e3580a000b2841e955f163ddec", "title": "The impacts of COVID-19 on LGBTQ + foster youth alumni ☆ Abuse & Neglect"}]}
