{"paperId": "3d930d62659f683f039c79c73058b84c684539c5", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "A Study on the Decay Model of Multi-Block Taxi Travel Demand under the Influence of Major Urban Public Health Events", "abstract": "A sudden major public health event is likely to have a negative impact on public transport travel for residents, with public travel modes such as the metro and conventional buses experiencing varying degrees of decline in patronage. As a complement to public transport, taxi travel will suffer the same impact. Land use and population density among various functional blocks in a city are different, and therefore their changing rates in taxi travel demand are varied. This paper reveals the taxi travel demand correlations between urban blocks and then constructs a taxi travel demand decay model based on the Dynamic Input-Output Inoperability Model (DIIM) to simulate the decay degree of taxi travel demand in each block. When a major public health event occurs, the residential panic levels in different functional blocks may vary. It results in variable changing speeds of residential travel demand in each block. Based on this assumption, we use the intensity of travel demand as a correlation strength factor between blocks, and equate it with the technical coefficient in the DIIM model. We also define other variables to serve in model construction. These variables include the decay degree of travel demand intensity, residential travel willingness, coefficient of travel demand decay, derivative coefficient of travel demand interdependency, and demand perturbation coefficient. Lastly, we select a central area of Ningbo as the study area, and use taxi travel data in Ningbo during the COVID-19 pandemic of 2020 as input, simulate taxi travel demand dynamics, and analyze the accuracy and sensitivity of the model parameters. The relative errors between the five types of blocks and the actual decay of travel demand intensity are 8.3%, 3.8%, 8.7%, 5.5%, and 5.3%, respectively, which can basically match the actual situation, proving the validity of the model. The results of the study reveal the pattern of taxi travel demand decay among various blocks after major public health events. It provides methodological reference for decision makers to understand the development trend of multi-block taxi travel demand, so as to help form effective emergency plans for different blocks.", "venue": "International Journal of Environmental Research and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "19"}, "authors": [{"authorId": "2159579422", "name": "Feiyi Luo"}, {"authorId": "96467923", "name": "Zhengfeng Huang"}, {"authorId": "2069414", "name": "P. Zheng"}], "citations": []}
