{"paperId": "3d974a54d70edc2449fc88ee9f69f0ec8b4ecb99", "publicationVenue": null, "title": "International Journal of Science and Business", "abstract": "It's possible to explain Edge computing (EC) as a distributed system of IT that decentralized the power of processing in which the mobile Internet of Things (IoT) computing would be allowed. In EC, data processed by local tools, computers, or servers, instead of being process and transmitted from the data center. However, with the wider capabilities of EC by increasing the network performance and reducing the latency, security challenges, and the risks will increase with data being stored and used on these devices on the edge or end of the network. This paper first provides a definition of EC and explain the reasons that led to the rapid spread of this type of computing with an explanation of the most important differences between EC and CC, in terms of the resources available for each type, processing, storage, as well as the privacy and security factor. Later, explaining the uses and benefits of this type of computing. However, the challenges are also taken into consideration, foremost among which is security. Through reviewing a number of previous researches, security challenges have been identified in four main sectors, including data privacy and security, access control, attack mitigation, and detection for anomalies Finally, choosing a set of solutions that were drawn from previous studies and contributed in reducing and limiting these challenges. Hopping this paper sheds light on Edge Computing security and paves the way for more future research. IJSB Literature review Accepted 1 February 2021 Published 3 February 2021 DOI: 10.5281/zenodo.4496939", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2174390412", "name": "Baydaa Hassan Husain"}, {"authorId": "3093729", "name": "Shavan K. Askar"}], "citations": []}
