{"paperId": "3dad0b968814cb4ec1ad06ce3d688bf2ce9196ba", "publicationVenue": {"id": "9802250b-ea09-494d-8cd9-c67b11cbd6c4", "name": "Journal of Communications Software and Systems", "type": "journal", "alternate_names": ["J Commun Softw Syst", "J commun softw syst", "Journal of communications software and systems"], "issn": "1845-6421", "url": "http://jcomss.fesb.unist.hr/"}, "title": "Security Enhancement in Cloud Environment using Secure Secret Key Sharing", "abstract": "Securing the data in distributed cloud system is considered one of the major concern for the cloud customers who faces security risks. The data leakage or data tampering are widely used by attackers to extract the private information of other users who shares the confidential data through virtualization. This paper presents Secure Secret Sharing (SSS) technique which is being recognized as one of the leading method to secure the sensitive data. It shares encrypted data over cloud and generated secret key is split into different parts distributed to qualified participants (Qn) only which is analyzed by malicious checkers. It verifies the clients based on their previous performances, whether these users proved to be authorized participant or not. The key computation is evaluated by the Key handler (KH) called trusted party which manages authorized control list, encryption/decryption and reconstruction of key shares. The Lagrange’s interpolation method is used to reconstruct the secret from shares. The experimental results shows that the proposed secure data sharing algorithm not only provides excellent security and performance, but also achieves better key management and data confidentiality than previous countermeasures. It improves the security by using secure VM placement and evaluated based on time consumption and probability computation to prove the efficacy of our algorithm. Experiments are performed on cloudsim based on following parameters i.e. time computation of key generation; response time and encryption/decryption. The experimental results demonstrate that this method can effectively reduce the risks and improves the security and time consumption upto 27.81% and 43.61% over existing algorithms.", "venue": "Journal of Communications Software and Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-07-20", "journal": {"name": "Journal of communications software and systems"}, "authors": [{"authorId": "48657686", "name": "S. Chhabra"}, {"authorId": "2109463103", "name": "Ashutosh Kumar Singh"}], "citations": [{"paperId": "03709c368a67a567c249df0c96b2e2cedbfee9f5", "title": "Cryptography approach for Secure Outsourced Data Storage in Cloud Environment"}, {"paperId": "fe621625212884c0c0280b8b87bfa122a6abe336", "title": "A smart resource management mechanism with trust access control for cloud computing environment"}, {"paperId": "22b2c9ecd9ad92e11955b930fe3c355b3c2a8321", "title": "Security and Privacy-Preservation of IoT Data in Cloud-Fog Computing Environment"}, {"paperId": "e800e5c8e8e65dbce1000b0a84695a175e57301d", "title": "A Privacy-Preserving Outsourced Data Model in Cloud Environment"}, {"paperId": "623744ca7dfd0e7850fd0d407ec410ae818155c0", "title": "An Intelligent Security Centered Resource-efficient Resource Management Model for Cloud Computing Environments"}, {"paperId": "be3bc721cde45a6f376862c0f80b1f5c47b9869a", "title": "SACS-ABE&B: Supervised Access Control Scheme Based on Attribute-Based Encryption and Blockchain"}, {"paperId": "db684468c043b68821cfb0c22702311096672732", "title": "A Comprehensive Vision on Cloud Computing Environment: Emerging Challenges and Future Research Directions"}]}
