{"paperId": "3db4d1d7a42320d998beaaf53ecada614e6ee541", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Measuring the Monetary Value of Online Volunteer Work", "abstract": "Online volunteers are a crucial labor force that keeps many for-profit systems afloat (e.g. social media platforms and online review sites). Despite their substantial role in upholding highly valuable technological systems, online volunteers have no way of knowing the value of their work. This paper uses content moderation as a case study and measures its monetary value to make apparent volunteer labor’s value. Using a novel dataset of private logs generated by moderators, we use linear mixed-effect regression and estimate that Reddit moderators worked a minimum of 466 hours per day in 2020. These hours are worth 3.4 million USD based on the median hourly wage for comparable content moderation services in the U.S. We discuss how this information may inform pathways to alleviate the one-sided relationship between technology companies and online volunteers.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-28", "journal": {"pages": "596-606"}, "authors": [{"authorId": "47892132", "name": "Hanlin Li"}, {"authorId": "32980371", "name": "Brent J. Hecht"}, {"authorId": "2510840", "name": "Stevie Chancellor"}], "citations": [{"paperId": "f02d424237ee5c3f78674096dcc1b0342aa1cdfa", "title": "Creator Hearts: Investigating the Impact Positive Signals from YouTube Creators in Shaping Comment Section Behavior"}, {"paperId": "7725b46537e22b6fed3091ee4ce5e7b5f616bc7f", "title": "Perceptions of Moderators as a Large-Scale Measure of Online Community Governance"}, {"paperId": "7e434762aad2fb169806c19871163445f9d5dd67", "title": "Toxicity Detection is NOT all you Need: Measuring the Gaps to Supporting Volunteer Content Moderators"}, {"paperId": "ccabfec9bf769d5f8f1153951f26a7a92446589d", "title": "Measuring User-Moderator Alignment on r/ChangeMyView"}, {"paperId": "938b52a1ab3e4ad6c380fadfb7ba3053c2428af0", "title": "ConvEx: A Visual Conversation Exploration System for Discord Moderators"}, {"paperId": "5e977499f761fbbb5fc887b815cdd845652bcff8", "title": "Understanding Extrafamilial Intergenerational Communication: A Case Analysis of an Age-Integrated Online Community"}, {"paperId": "d1b31c9a9fd43fb065c56b705ac6e8c46fdf9c7e", "title": "Cleaning Up the Streets: Understanding Motivations, Mental Models, and Concerns of Users Flagging Social Media Posts"}, {"paperId": "2b6d7564063f186cee2f855be88d89f0d3894eeb", "title": "What Teams Do: Exploring Volunteer Content Moderation Team Labor on Facebook"}, {"paperId": "d60a3f7bd3fcce20b259a677d41dcf6573fcc81c", "title": "Hate Raids on Twitch: Understanding Real-Time Human-Bot Coordinated Attacks in Live Streaming Communities"}, {"paperId": "0b4637c42260a3b7e966dbb671f01b2789dc69fc", "title": "Towards Intersectional Moderation: An Alternative Model of Moderation Built on Care and Power"}, {"paperId": "db4572f54ae6a1a6cae43f7a1b897a8362cc2ea7", "title": "The role of the big geographic sort in online news circulation among U.S. Reddit users"}, {"paperId": "00beb95a43a1a523986a988f0e54587965c75bad", "title": "Understanding Moderators’ Conflict and Conflict Management Strategies with Streamers in Live Streaming Communities"}, {"paperId": "8527471455ecde438082350fe95a7a802bf3a667", "title": "Ethical Tensions, Norms, and Directions in the Extraction of Online Volunteer Work"}, {"paperId": "08dac48d632b3d97a5b853c250f6a0274c00b2b3", "title": "All That's Happening behind the Scenes: Putting the Spotlight on Volunteer Moderator Labor in Reddit"}, {"paperId": "76455567dcc850dc16c61aa4750fd5fec237aa95", "title": "On the Governance of Federated Platforms"}, {"paperId": "81df2a3097f66a3953a33859d4e9b6b4b73aaa7e", "title": "Can This Platform Survive? Governance Challenges for the Fediverse"}]}
