{"paperId": "3dc822204575cc5a50a96996c607b73457aaa016", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "ReCA: An Efficient Reconfigurable Cache Architecture for Storage Systems with Online Workload Characterization", "abstract": "In recent years, Solid-State Drives (SSDs) have gained tremendous attention in computing and storage systems due to significant performance improvement over Hard Disk Drives (HDDs). The cost per capacity of SSDs, however, prevents them from entirely replacing HDDs in such systems. One approach to effectively take advantage of SSDs is to use them as a caching layer to store performance critical data blocks in order to reduce the number of accesses to HDD-based disk subsystem. Due to characteristics of Flash-based SSDs such as limited write endurance and long latency on write operations, employing caching algorithms at the Operating System (OS) level necessitates to take such characteristics into consideration. Previous OS-level caching techniques are optimized towards only one type of application, which affects both generality and applicability. In addition, they are not adaptive when the workload pattern changes over time. This paper presents an efficient Reconfigurable Cache Architecture (ReCA) for storage systems using a comprehensive workload characterization to find an optimal cache configuration for I/O intensive applications. For this purpose, we first investigate various types of I/O workloads and classify them into five major classes. Based on this characterization, an optimal cache configuration is presented for each class of workloads. Then, using the main features of each class, we continuously monitor the characteristics of an application during system runtime and the cache organization is reconfigured if the application changes from one class to another class of workloads. The cache reconfiguration is done online and workload classes can be extended to emerging I/O workloads in order to maintain its efficiency with the characteristics of I/O requests. Experimental results obtained by implementing ReCA in a 4U rackmount server with SATA 6Gb/s disk interfaces running Linux 3.17.0 show that the proposed architecture improves performance and lifetime up to 24 and 33 percent, respectively.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-03", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1605-1620", "volume": "29"}, "authors": [{"authorId": "2894539", "name": "Reza Salkhordeh"}, {"authorId": "3060759", "name": "Shahriar Ebrahimi"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "454df4f4d3508aa96a6392a1eca6da347bf70e57", "title": "Video File Allocation for Wear-Leveling in Distributed Storage Systems With Heterogeneous Solid-State-Disks (SSDs)"}, {"paperId": "a99aba1d1a6657860417a312def18f3587c8113e", "title": "Re-architecting I/O Caches for Emerging Fast Storage Devices"}, {"paperId": "ef7d25f543f03a4cf5cd073310a3a5b361356f1a", "title": "Enhancing the Performance of an Autonomous Distributed Storage System in a Large-Scale Network"}, {"paperId": "e1e14fc15dd52b411886bdcf173e9bd7d6e04ab8", "title": "RC-RNN: Reconfigurable Cache Architecture for Storage Systems Using Recurrent Neural Networks"}, {"paperId": "275fd6a0f7b37a00947506c66849acac3d673f75", "title": "ETICA: Efficient Two-Level I/O Caching Architecture for Virtualized Platforms"}, {"paperId": "cf11a0ed193df2aa00573737136e6f9c98e2c820", "title": "A System-Level Framework for Analytical and Empirical Reliability Exploration of STT-MRAM Caches"}, {"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays"}, {"paperId": "fc6955ef2530d59f20ce7ea40148beeb6d1766a1", "title": "STAIR: High Reliable STT-MRAM Aware Multi-Level I/O Cache Architecture by Adaptive ECC Allocation"}, {"paperId": "e0b706a73648af0217f235886e6133b2927f64c6", "title": "Workload-Adaptive Configuration Tuning for Hierarchical Cloud Schedulers"}, {"paperId": "6b8b39aaf8297756fc755064437db212e6a7d467", "title": "Evaluating Reliability of SSD-Based I/O Caches in Enterprise Storage Systems"}, {"paperId": "857138baa0ee48b1f9c1d617a16a5beecc963d78", "title": "Data Heat Prediction in Storage Systems Using Behavior Specific Prediction Models"}, {"paperId": "69ae2d6128094a3a97e503badeaff4989519828e", "title": "An Adaptive SSD Cache Architecture Simultaneously Using Multiple Caches"}, {"paperId": "17119282c4661329aef3e100df925fb9ed1e7f05", "title": "Application-Grained Block I/O Analysis for Edge Computational Intelligent"}, {"paperId": "8daf81a51094227b4fa4e8d18d3b558578c9fd8b", "title": "Automating Distributed Tiered Storage Management in Cluster Computing"}, {"paperId": "0b3be8e79a977d77d80a6f57baaf449ae64962aa", "title": "Lifetime-aware solid-state disk (SSD) cache management for video servers"}, {"paperId": "5a4122add1e631ffc45367a1467e2693e28fb6b5", "title": "Optimizing the SSD Burst Buffer by Traffic Detection"}, {"paperId": "9a5c3d04cde121acd808b8a7d6ef7a4014b2cb72", "title": "Dependability Analysis of Data Storage Systems in Presence of Soft Errors"}, {"paperId": "8dc8ce191a565f665f2319b024baac9a7cbe521f", "title": "An Efficient Hybrid I/O Caching Architecture Using Heterogeneous SSDs"}, {"paperId": "3aedc5997c36befdbecd4b225588e7f404638b45", "title": "LBICA: A Load Balancer for I/O Cache Architectures"}, {"paperId": "049af837db8c08860442fb9fe437788acee45028", "title": "ECI-Cache: A High-Endurance and Cost-Efficient I/O Caching Scheme for Virtualized Platforms"}, {"paperId": "9f35c25377f322d975527bfe070c535c1284e659", "title": "Modeling Impact of Human Errors on the Data Unavailability and Data Loss of Storage Systems"}, {"paperId": "26c9f7542ea711ee40989b5e489578c61de80db6", "title": "ECI-Cache"}, {"paperId": "c794dcb58b4b8bd67cb39744ea8552eed339850e", "title": "Investigating power outage effects on reliability of solid-state drives"}, {"paperId": "ef80ef9a7c548c4364780ee3fa3b00ecfde90a60", "title": "Desperately Seeking ... Optimal Multi-Tier Cache Configurations"}]}
