{"paperId": "3dd4b8fdbcb3ec776eddfc1e3db2dbdbfe400f3a", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "DPM-NFV: Dynamic Power Management Framework for 5G User Plane Function using Bayesian Optimization", "abstract": "Network Function Virtualization (NFV), the replacement of purpose-built network appliances with software functions running on general purpose compute servers, is ubiquitous in today's telecommunication networks. The 5G User Plane Function (UPF) is an important example of an NFV workload, which enables 5G and internet communications. The UPF has strict packet drop requirements and because user traffic load can vary dramatically throughout the day, the selection of a single static configuration leads to over-provisioning of server resources. To reduce the cost of ownership, network operators can reduce power consumption during periods of low traffic load, but to do so they must ensure that packet drop requirements are met. In this paper we present DPM-NFV, a machine learning based framework that enables dynamic tuning of a real NFV system. Our methodology is composed of two phases: (1) Offline, targeted automated studies use Bayesian Optimization to infer the best configurations for various load levels; (2) Online, a run-time classifier dynamically selects the best configuration for the current load. Our results obtained on a real system demonstrate that the UPF can meet strict packet drop requirements while reducing power consumption by up to 52% with smooth traffic and up to 46% with bursty traffic.", "venue": "Global Communications Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-04", "journal": {"name": "GLOBECOM 2022 - 2022 IEEE Global Communications Conference", "pages": "4099-4105"}, "authors": [{"authorId": "2199424", "name": "J. Sydir"}, {"authorId": "2156071993", "name": "Bin Li"}, {"authorId": "2528093", "name": "Pietro Mercati"}, {"authorId": "113282542", "name": "Charlie Tai"}, {"authorId": "144025680", "name": "R. Iyer"}, {"authorId": "1744640", "name": "M. Kishinevsky"}, {"authorId": "2117515858", "name": "Boris Serafimov"}], "citations": [{"paperId": "3fbd6123f44af0b23d5d3a7fbb224ce2da0e1e7e", "title": "An intelligent scheduling for 5G user plane function placement and chaining reconfiguration"}, {"paperId": "e6ef061db95031af5bdf18b138701d2baeda6215", "title": "PROMPT: Learning Dynamic Resource Allocation Policies for Edge-Network Applications"}, {"paperId": "32505f8e53ea332c7f1c5174bdbcfa8b287d1c49", "title": "SMaRT-5G Project Sustainable Mobile and RAN Transformation (SMaRT)"}]}
