{"paperId": "3dd86949c4028ac5d29428acd9e9439e7fc29fa0", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "PAP-REC: Personalized Automatic Prompt for Recommendation Language Model", "abstract": "Recently emerged prompt-based Recommendation Language Models (RLM) can solve multiple recommendation tasks uniformly. The RLMs make full use of the inherited knowledge learned from the abundant pre-training data to solve the downstream recommendation tasks by prompts, without introducing additional parameters or network training. However, handcrafted prompts require significant expertise and human effort since slightly rewriting prompts may cause massive performance changes. In this paper, we propose PAP-REC, a framework to generate the Personalized Automatic Prompt for RECommendation language models to mitigate the inefficiency and ineffectiveness problems derived from manually designed prompts. Specifically, personalized automatic prompts allow different users to have different prompt tokens for the same task, automatically generated using a gradient-based method. One challenge for personalized automatic prompt generation for recommendation language models is the extremely large search space, leading to a long convergence time. To effectively and efficiently address the problem, we develop surrogate metrics and leverage an alternative updating schedule for prompting recommendation language models. Experimental results show that our PAP-REC framework manages to generate personalized prompts, and the automatically generated prompts outperform manually constructed prompts and also outperform various baseline recommendation models. The source code of the work is available at https://github.com/rutgerswiselab/PAP-REC.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "ArXiv", "volume": "abs/2402.00284"}, "authors": [{"authorId": "2109968285", "name": "Zelong Li"}, {"authorId": "2111810606", "name": "Jianchao Ji"}, {"authorId": "152988336", "name": "Yingqiang Ge"}, {"authorId": "2007245028", "name": "Wenyue Hua"}, {"authorId": "2145038716", "name": "Yongfeng Zhang"}], "citations": [{"paperId": "14c7747267c875713be896cc6a3d5bbc16ccb015", "title": "Exploring the Impact of Large Language Models on Recommender Systems: An Extensive Review"}]}
