{"paperId": "3dfc6c80487868e6b84aa444d38edeff6eaee3c2", "publicationVenue": {"id": "a1b15bc8-157e-45a9-b4c8-8211f938775d", "name": "IEEE Communications Magazine", "type": "journal", "alternate_names": ["IEEE Commun Mag"], "issn": "0163-6804", "url": "http://www.comsoc.org/commag", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=35"]}, "title": "Distributed Task-Oriented Communication Networks with Multimodal Semantic Relay and Edge Intelligence", "abstract": "In this article, we present a novel framework, named distributed task-oriented communication networks (DTCN), based on recent advances in multimodal semantic transmission and edge intelligence. In DTCN, the multimodal knowledge of semantic relays and the adaptive adjustment capability of edge intelligence can be integrated to improve task performance. Specifically, we propose the key techniques in the framework, such as semantic alignment and complement, a semantic relay scheme for deep joint source-channel relay coding, and collaborative device-server optimization and inference. Furthermore, a multimodal classification task is used as an example to demonstrate the benefits of the proposed DTCN over existing methods. Numerical results validate that DTCN can significantly improve the accuracy of classification tasks, even in harsh communication scenarios (e.g., low signal-to-noise regime), thanks to multimodal semantic relay and edge intelligence.", "venue": "IEEE Communications Magazine", "year": 2024, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-18", "journal": {"name": "IEEE Communications Magazine"}, "authors": [{"authorId": "2128170425", "name": "Jie Guo"}, {"authorId": "2279897999", "name": "Hao Chen"}, {"authorId": "2291682713", "name": "Bin Song"}, {"authorId": "2675634", "name": "Yuhao Chi"}, {"authorId": "2237799336", "name": "Chau Yuen"}, {"authorId": "2155385513", "name": "F. Yu"}, {"authorId": "2270990241", "name": "Geoffrey Ye Li"}, {"authorId": "1713586", "name": "D. Niyato"}], "citations": []}
