{"paperId": "3e12746bb621126e52fd64561c13c787a5ba6df0", "publicationVenue": {"id": "890beb40-ba59-4681-9bb6-88ed97b7decb", "name": "Journal of Theoretical and Applied Electronic Commerce Research", "type": "journal", "alternate_names": ["J Theor Appl Electron Commer Res"], "issn": "0718-1876", "url": "http://www.scielo.cl/scielo.php?lng=en&pid=0718-1876&script=sci_serial", "alternate_urls": ["http://www.jtaer.com/"]}, "title": "Evolutionary Game Analysis of the Impact of Big Data Credit Technology on the Credit Rationing of Micro and Small Enterprises (MSEs)", "abstract": "Credit rationing hindered the development of MSEs. Big data credit technology creates a great opportunity to address this issue. Then, how does big data credit technology affect and to what extent can it alleviate the credit rationing of MSEs? Based on the bounded rationality economic man hypothesis, the evolutionary game model of banks and MSEs under the traditional mode and big data credit technology are constructed, respectively, in this paper, and the evolutionary trajectory of bank-enterprise credit strategies under the two modes are comparatively analyzed. The results show that it is hard to alleviate the credit rationing of MSEs under the traditional mode. However, under big data credit technology, when the overall credit level of MSEs is high, the credit rationing of MSEs will be effectively alleviated. When the overall credit level of MSEs is too low, it is difficult to determine whether big data credit technology can alleviate the credit rationing of MSEs. In order to verify the feasibility of big data credit technology in alleviating the credit rationing of MSEs, a simulation experiment is conducted to compare the differences in the credit rationing of MSEs with different credit levels under the two credit modes. We found that the credit rationing of MSEs is always lower under big data credit technology than under the traditional mode. Therefore, big data credit technology can effectively alleviate the credit rationing of MSEs under any circumstances. The research provides theoretical support for banks to apply big data credit technology to achieve a win-win situation for both parties.", "venue": "Journal of Theoretical and Applied Electronic Commerce Research", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-18", "journal": {"name": "J. Theor. Appl. Electron. Commer. Res.", "pages": "1926-1954", "volume": "18"}, "authors": [{"authorId": "2260735766", "name": "Yuhuan Jin"}, {"authorId": "2261234221", "name": "Sheng Zhang"}, {"authorId": "2260704026", "name": "Xiaokang Lei"}], "citations": []}
