{"paperId": "3e1ca026052d30e3b9677e363616fae23f6616df", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models as Data Preprocessors", "abstract": "Large Language Models (LLMs), typified by OpenAI's GPT series and Meta's LLaMA variants, have marked a significant advancement in artificial intelligence. Trained on vast amounts of text data, LLMs are capable of understanding and generating human-like text across a diverse range of topics. This study expands on the applications of LLMs, exploring their potential in data preprocessing, a critical stage in data mining and analytics applications. We delve into the applicability of state-of-the-art LLMs such as GPT-3.5, GPT-4, and Vicuna-13B for error detection, data imputation, schema matching, and entity matching tasks. Alongside showcasing the inherent capabilities of LLMs, we highlight their limitations, particularly in terms of computational expense and inefficiency. We propose an LLM-based framework for data preprocessing, which integrates cutting-edge prompt engineering techniques, coupled with traditional methods like contextualization and feature selection, to improve the performance and efficiency of these models. The effectiveness of LLMs in data preprocessing is evaluated through an experimental study spanning 12 datasets. GPT-4 emerged as a standout, achieving 100\\% accuracy or F1 score on 4 datasets, suggesting LLMs' immense potential in these tasks. Despite certain limitations, our study underscores the promise of LLMs in this domain and anticipates future developments to overcome current hurdles.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-30", "journal": {"name": "ArXiv", "volume": "abs/2308.16361"}, "authors": [{"authorId": "2337936", "name": "Haochen Zhang"}, {"authorId": "2815918", "name": "Yuyang Dong"}, {"authorId": "50365559", "name": "Chuan Xiao"}, {"authorId": "37267314", "name": "M. Oyamada"}], "citations": [{"paperId": "d32871dd44a7a3c8e3a8af5319fc8135e802e2cf", "title": "ReMatch: Retrieval Enhanced Schema Matching with LLMs"}, {"paperId": "2aa2a31a642329db9dd5d86e4c4ad8237cae2896", "title": "Leveraging Large Models for Crafting Narrative Visualization: A Survey"}, {"paperId": "d642e004b9e4acef660283e4f518aa9210ff341d", "title": "Cost-Effective In-Context Learning for Entity Resolution: A Design Space Exploration"}, {"paperId": "7e17ef56273063dfa838de30b7cc0546b2e5ee10", "title": "Jellyfish: A Large Language Model for Data Preprocessing"}]}
