{"paperId": "3e201f0df8395730a56d9eab34a77518465e5d9b", "publicationVenue": null, "title": "Expressing FactDAG Provenance with PROV-O", "abstract": ". To foster data sharing and reuse across organizational boundaries, provenance tracking is of vital importance for the establishment of trust and accountability, especially in industrial applications, but often neglected due to associated overhead. The abstract FactDAG data interoperability model strives to address this challenge by simplifying the creation of provenance-linked knowledge graphs of revisioned (and thus immutable) resources. However, to date, it lacks a practical provenance implementation. In this work, we present a concrete alignment of all roles and relations in the FactDAG model to the W3C PROV provenance standard, allowing future software implementations to directly produce standard-compliant provenance information. Maintaining compatibility with existing PROV tooling, an implementation of this mapping will pave the way for practical FactDAG implementations and deployments, improving trust and accountability for Open Data through sim-pliﬁed provenance management.", "venue": "MEPDaW@ISWC", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "53-58"}, "authors": [{"authorId": "31648495", "name": "L. Gleim"}, {"authorId": "2055764501", "name": "Liam Tirpitz"}, {"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "152589583", "name": "S. Decker"}], "citations": [{"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "237bff7713bc15584d622578bfdd0ec8010065b7", "title": "FactStack"}, {"paperId": "d389254deea7fd67f6e1f4acce3f0ee7302a388e", "title": "Data Reliability and Trustworthiness Through Digital Transmission Contracts"}, {"paperId": "e881d17d46c459390947806a9c84641c8df29429", "title": "Capturing Provenance Information in the File System"}, {"paperId": "1271088a3e5d92b4596ce5ab2d31c3957526b8ac", "title": "Open Challenges for the Management and Preservation of Evolving Data on the Web"}, {"paperId": "400d8077cd775f1d56f9e91bc53258685df8b08a", "title": "OntoDrift: a Semantic Drift Gauge for Ontology Evolution Monitoring"}]}
