{"paperId": "3e25bcd157083306c110e5cc8dbe134e5e12aebf", "publicationVenue": {"id": "38a3ba3f-f532-4ba9-a866-a020c30650a9", "name": "Journal of Knowledge Management", "type": "journal", "alternate_names": ["J Knowl Manag"], "issn": "1367-3270", "url": "https://www.emerald.com/insight/publication/issn/1367-3270", "alternate_urls": ["http://www.emeraldinsight.com/1367-3270.htm"]}, "title": "Defining the big social data paradigm through a systematic literature review approach", "abstract": "\nPurpose\nThis study aims to investigate the Big Social Data (BSD) paradigm, which still lacks a clear and shared definition, and causes a lack of clarity and understanding about its beneficial opportunities for practitioners. In the knowledge management (KM) domain, a clear characterization of the BSD paradigm can lead to more effective and efficient KM strategies, processes and systems that leverage a huge amount of structured and unstructured data sources.\n\n\nDesign/methodology/approach\nThe study adopts a systematic literature review (SLR) methodology based on a mixed analysis approach (unsupervised machine learning and human-based) applied to 199 research articles on BSD topics extracted from Scopus and Web of Science. In particular, machine learning processing has been implemented by using topic extraction and hierarchical clustering techniques.\n\n\nFindings\nThe paper provides a threefold contribution: a conceptualization and a consensual definition of the BSD paradigm through the identification of four key conceptual pillars (i.e. sources, properties, technology and value exploitation); a characterization of the taxonomy of BSD data type that extends previous works on this topic; a research agenda for future research studies on BSD and its applications along with a KM perspective.\n\n\nResearch limitations/implications\nThe main limits of the research rely on the list of articles considered for the literature review that could be enlarged by considering further sources (in addition to Scopus and Web of Science) and/or further languages (in addition to English) and/or further years (the review considers papers published until 2018). Research implications concern the development of a research agenda organized along with five thematic issues, which can feed future research to deepen the paradigm of BSD and explore linkages with the KM field.\n\n\nPractical implications\nPractical implications concern the usage of the proposed definition of BSD to purposefully design applications and services based on BSD in knowledge-intensive domains to generate value for citizens, individuals, companies and territories.\n\n\nOriginality/value\nThe original contribution concerns the definition of the big data social paradigm built through an SLR the combines machine learning processing and human-based processing. Moreover, the research agenda deriving from the study contributes to investigate the BSD paradigm in the wider domain of KM.\n", "venue": "Journal of Knowledge Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-08", "journal": {"name": "J. Knowl. Manag.", "pages": "1853-1887", "volume": "25"}, "authors": [{"authorId": "39700317", "name": "Gianluca Solazzo"}, {"authorId": "22097137", "name": "G. Elia"}, {"authorId": "3014056", "name": "G. Passiante"}], "citations": [{"paperId": "7ab437dd0e0771defa8c404f180e8c48aa82bc46", "title": "Transforming data into information for smart services: integration of morphological analysis and text mining"}, {"paperId": "c67fce7543688345a10aef4e18260708b387e10e", "title": "How to exploit Big Social Data in the Covid-19 pandemic: the case of the Italian tourism industry"}]}
