{"paperId": "3e305d49ff1f6d112b52910d65f387c4617af33e", "publicationVenue": {"id": "19842b7b-a4d1-4f9a-9714-87d878cf6e73", "name": "Physical Review E", "type": "journal", "alternate_names": ["Phys rev E", "Physical review. E", "Phys Rev E"], "issn": "1539-3755", "alternate_issns": ["1550-2376", "2470-0045"], "url": "https://journals.aps.org/pre/", "alternate_urls": ["http://pre.aps.org/", "http://journals.aps.org/pre/"]}, "title": "Beyond randomness: Evaluating measures of information entropy in binary series.", "abstract": "The enormous amount of currently available data demands efforts to extract meaningful information. For this purpose, different measurements are applied, including Shannon's entropy, permutation entropy, and the Lempel-Ziv complexity. These methods have been used in many applications, such as pattern recognition, series classification, and several other areas (e.g., physical, financial, and biomedical). Data in these applications are often presented in binary series with temporal correlations. Herein, we compare the measures of information entropy in binary series conveying short- and long-range temporal correlations characterized by the Hurst exponent H. Combining numerical and analytical approaches, we scrutinize different methods that were not efficient in detecting temporal correlations. To surpass this limitation, we propose a measure called the binary permutation index (BPI). We will demonstrate that BPI efficiently discriminates patterns embedded in the series, offering advantages over previous methods. Subsequently, we collect stock market time series and rain precipitation data as well as perform in vivo electrophysiological recordings in the hippocampus of an experimental animal model of temporal lobe epilepsy, in which the BPI application in both public open source and experimental data is demonstrated. An index is proposed to evaluate information entropy, allowing the ability to discriminate randomness and extract meaningful information in binary time series.", "venue": "Physical Review E", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "Physical review. E", "pages": "\n          044101\n        ", "volume": "105 4-1"}, "authors": [{"authorId": "2058896775", "name": "M. Ferraz"}, {"authorId": "4706888", "name": "A. Kihara"}], "citations": [{"paperId": "551aa4a90bb859d21e4260cc0f4ebd1ab346a42d", "title": "The complexity of spontaneous brain activity changes in schizophrenia, bipolar disorder, and ADHD was examined using different variations of entropy"}]}
