{"paperId": "3e3b1a8dbe13fbb1436a1a120611b61bb5e7e9d5", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Proactive Auto-Scaling for Delay-Sensitive IoT Applications Over Edge Clouds", "abstract": "As a new design mechanism for improving service quality and user experience, a common practice is to deploy the delay-sensitive Internet of Things (IoT) control systems in a public edge cloud. However, this method is also faced with the challenge of serving the fluctuating resource demands through timely acquisition of enough instances. In this article, we systematically study the problem of proactively purchasing cloud resources for delay-sensitive IoT control systems over the public edge clouds which are under a flexible pricing model, so that the total cost can be minimized over the long run. We formulate the proactive cloud resource scaling cost minimization (PCRSCM) problem, in which we take the prediction, purchasing, and deployment cost into consideration. This problem can be proved to be NP-hard and we propose the proactive online instance purchase (POIP) algorithm to solve the problem. We prove that the competitive ratio of POIP is 2. We also evaluate the performance of POIP through real trace-driven simulations and real testbed. Our evaluation shows that POIP significantly reduces delay by more than 40% when compared to the reactive method and it costs about 20%, 25%, and 30% less than state-of-the-art methods, such as POLAR, cost minimization for provisioning virtual server, and ARMA prediction with on-demand priority, respectively.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "9536-9546", "volume": "11"}, "authors": [{"authorId": "2225760488", "name": "Weimeng Wang"}, {"authorId": "2258434543", "name": "Lei Liu"}, {"authorId": "2258674512", "name": "Zhongmin Yan"}], "citations": []}
