{"paperId": "3e4540eebf8b89847cd1f9d4b777f37fb9c43290", "publicationVenue": {"id": "a89aea8d-28b2-44b1-9253-2c9736938bde", "name": "International Journal of Engineering Business and Management", "type": "journal", "alternate_names": ["Int j eng bus manag", "International journal of engineering business management", "International Journal of Engineering Business Management", "Int J Eng Bus Manag"], "issn": "2456-7817", "alternate_issns": ["1847-9790"], "url": "http://aipublications.com/ijebm/", "alternate_urls": ["http://enb.sagepub.com/", "https://us.sagepub.com/en-us/nam/international-journal-of-engineering-business-management/journal202568", "https://journals.sagepub.com/home/enb", "http://www.intechopen.com/journals/volume/international_journal_of_engineering_business_management/7/2015/1", "http://haw.nsk.hr/arhiva/vol4/3790/35355/image-thumb.jpg"]}, "title": "Privacy enhancing technology adoption and its impact on SMEs’ performance", "abstract": "As society places greater emphasis on information privacy and data protection, organizations are increasingly adopting Privacy Enhancing Technologies (PETs) to safeguard the personal information of their stakeholders. This trend is fueled by growing consumer awareness and the introduction of government regulations aimed at protecting personal data. By implementing PETs, organizations can ensure compliance with privacy regulations and establish trust with their customers. This study aims to deepen the understanding of the determinants of Privacy Enhancing Technology (PET) adoption in small and medium-sized enterprises (SMEs) and its impact on their performance. It focuses on the technology-organization-environment (TOE) model, managerial readiness, firm size, industry sector, and intent to adopt PETs as potential drivers of PET adoption. By using a large-scale survey of 202 Canadian SMEs, the study evaluates the mediating role of intent in the relationship between the TOE model, managerial readiness, and market performance. The results of this study contribute to the growing body of research on PET adoption in SMEs and provide insights for organizations and managers to effectively adopt PETs. The results of this study indicate that technological, environmental, organizational, and managerial readiness have a positive effect on the intention to adopt PETs. Additionally, the intention to adopt PETs was found to have a positive relationship with firm performance. The findings also reveal that the intention to adopt PETs fully mediates the relationship between the four dimensions of readiness and firm performance. These findings highlight the important role that readiness and intention play in the adoption of PETs and its impact on firm performance. This study also found that firm size moderates the relationship between technological and organizational readiness with intention to adopt PETs, as well as the relationship between environmental and managerial readiness with intention to adopt PETs. The study identified the top five factors affecting PET adoption as cybersecurity awareness, perceived cost of adoption, ease of use, perceived benefits, and IT infrastructure. The findings suggest that technological readiness is the most influential of the four dimensions, followed by organizational, environmental, and managerial factors. This study presents crucial considerations for SMEs to evaluate when deciding on the use of PET technologies, as it pertains to practitioners.", "venue": "International Journal of Engineering Business and Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-01", "journal": {"name": "International Journal of Engineering Business Management"}, "authors": [{"authorId": "11052299", "name": "Tahereh Hasani"}, {"authorId": "2412276", "name": "Davar Rezania"}, {"authorId": "2923630", "name": "Nadège Levallet"}, {"authorId": "2215518058", "name": "Norman O’Reilly"}, {"authorId": "2215572832", "name": "Mohammad Mohammadi"}], "citations": [{"paperId": "90b42d5c46c318113bcac6ee10e56f429e7180f2", "title": "E-commerce for a sustainable future: integrating trust, green supply chain management and online shopping satisfaction"}, {"paperId": "874066b31f1cb555b2a1fa5cd2d00a304ba6d2b8", "title": "Reviewing advancements in privacy-enhancing technologies for big data analytics in an era of increased surveillance"}, {"paperId": "d6e7e6ea037f596f66bc83642593db91606d36b0", "title": "Impact of E-marketing Capabilities and E-marketing Orientation on Sustainable Firm Performance of SME in KSA Through E-relationship Management"}, {"paperId": "a2cf9890a86cfa9197929bb05897a2c653ea5394", "title": "Lights, Camera, Metaverse!: Eliciting Intention to Use Industrial Metaverse, Organizational Agility, and Firm Performance"}, {"paperId": "2d4acb48bbe79d94a89f977d83a3d6174c0bdf5f", "title": "E-Commerce Adoption by SMEs and Its effect on Marketing Performance: An Extended of TOE Framework with AI Integration, Innovation Culture, and Customer Tech-Savviness"}, {"paperId": "b0ec6ee64797ccf93ba1b25160e1e89d87736a41", "title": "A Stackelberg game framework for resource management in the CloudPoS-Based blockchain network"}, {"paperId": "90bb9646b4d1c71e1e6d0c3827ca51ba6729b3ad", "title": "A novel and provably secure mutual authentication protocol for cloud environment using elliptic curve cryptography and fuzzy verifier"}, {"paperId": "950fdb18ce08fc4e905b6221de4c69ff73341a4c", "title": "The impact of facilitating conditions on electric vehicle adoption intention in China: An integrated unified theory of acceptance and use of technology model"}, {"paperId": "09b516053fe562f710c34e123be484ecf3df5fdc", "title": "The Adoption of RFID for Military Logistics: Which Factors Do Matter in Taiwan?"}]}
