{"paperId": "3e46e3f8ff04807067835d633e8007beee23dabf", "publicationVenue": {"id": "27b93d96-c4b9-4a23-a3a0-061ad54deebc", "name": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "type": "conference", "alternate_names": ["HPDC", "IEEE Int Symp High-performance Parallel Distrib Comput"], "url": "http://www.hpdc.org/"}, "title": "Holmes: SMT Interference Diagnosis and CPU Scheduling for Job Co-location", "abstract": "Co-location of latency-critical services with best-effort batch jobs is commonly adopted in production systems to increase resource utilization. Although memory and CPU isolation have been extensively studied, we find Simultaneous Multi-Threading (SMT) technology imposes non-trivial interference on memory access which jeopardizes efficient co-location and performance assurance of latency-critical services. However, there is not an existing metric to quantitatively measure and lacks a deterministic approach to tackle SMT interference on memory access. We present Holmes, a user-space approach to SMT interference diagnosis and adaptive CPU scheduling for efficient job co-location in multi-tenant systems. Holmes tackles two challenges: accurately measuring SMT interference on memory access, and efficiently adjusting CPU allocation to achieve low latency and high resource utilization at the same time. It leverages CPU hardware performance events to diagnose SMT interference on memory access and form a metric. It deploys an interference-aware scheduler to adaptively allocate CPU cores to latency-critical services and batch jobs. Experiments with four real-world key-value stores show that compared to a representative CPU isolation approach, Holmes reduces the average (99th percentile) query latency by up to 49.0% (52.3%) for four real-world latency-critical services. It also significantly improves convergence speed, resource utilization, and system throughput.", "venue": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-27", "journal": {"name": "Proceedings of the 31st International Symposium on High-Performance Parallel and Distributed Computing"}, "authors": [{"authorId": "40377061", "name": "Aidi Pi"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "2167458317", "name": "Chengzhong Xu"}], "citations": [{"paperId": "ad72d157a1e95a8d453cc1e57e62d481338c2653", "title": "Let It Go: Relieving Garbage Collection Pain for Latency Critical Applications in Golang"}, {"paperId": "a5b256463275c6f58d60dd37f472b6b13cf18ee8", "title": "Essential 1: justice is our “comprehensive mission”"}, {"paperId": "d1d4a6164259da45a43183d26b8c08ae4645077e", "title": "Explicating Essential Nine of the Second Edition of the NAPDS Nine Essentials"}, {"paperId": "e020a8350b92f1dcf85f057e70b835e469058e4c", "title": "Non-Lorentzian atomic natural line-shape of core level multiplets: Access high energy x-ray photons in electron capture nuclear decay"}, {"paperId": "14cad8da091eb57f4efa0bf859c7c80c0534d07b", "title": "Understanding and Optimizing Workloads for Unified Resource Management in Large Cloud Platforms"}, {"paperId": "6637cc63393f401237a948809d76b9d0074c5a56", "title": "HIV virologic response, patterns of drug resistance mutations and correlates among adolescents and young adults: A cross-sectional study in Tanzania"}, {"paperId": "1fe033eab8ddb66dd75c6fcb87b9a989629b9f96", "title": "Instruments, agents, and artificial intelligence: novel epistemic categories of reliability"}, {"paperId": "3b5199f1c099e493130c0f25f30ee59264dd6206", "title": "Limits on the cosmic neutrino background"}, {"paperId": "a89e9fcace90748afb3c1c3b37434f3b1d206c60", "title": "Anti-IL-8 antibody activates myeloid cells and potentiates the anti-tumor activity of anti-PD-1 antibody in the humanized pancreatic cancer murine model"}, {"paperId": "7dfb2d42214874edf3f58a25000a188be8c25a6e", "title": "Uncertainty Handling in Genetic Risk Assessment and Counseling"}, {"paperId": "f9b008e80977a0d7d495b8c78bc62d877dd9d943", "title": "Mammoth Ivory Rods in Eastern Beringia: Earliest in North America"}, {"paperId": "962941ef90ca9c8764ba6a61e6b86873e14e81bf", "title": "Women with type 1 diabetes and women with type 2 diabetes differ in knowledge and beliefs about contraception and pregnancy"}, {"paperId": "f7697c87d25b859b5203c5a85ba0f80a5d444d86", "title": "Memories for Virtual AI Characters"}]}
