{"paperId": "3e4897f96ac202241c2a079b73ea6fbfaf6008a9", "publicationVenue": {"id": "289bfdda-eab3-4c9a-97be-ef1e0f9ddfc0", "name": "International Symposium on Software Testing and Analysis", "type": "conference", "alternate_names": ["ISSTA", "Int Symp Softw Test Anal"], "url": "https://dl.acm.org/conference/issta"}, "title": "Scalable build service system with smart scheduling service", "abstract": "Build automation is critical for developers to check if their code compiles, passes all tests and is safe to deploy to the server. Many companies adopt Continuous Integration (CI) services to make sure that the code changes from multiple developers can be safely merged at the head of the project. Internally, CI triggers builds to make sure that the new code change compiles and passes the tests. For any large company which has a monolithic code repository and thousands of developers, it is hard to make sure that all code changes are safe to submit in a timely manner. The reason is that each code change may involve multiple builds, and the company needs to run millions of builds every day to guarantee developers’ productivity. Google is one of those large companies that need a scalable build service to support developers’ work. More than 100,000 code changes are submitted to our repository on average each day, including changes from either human users or automated tools. More than 15 million builds are executed on average each day. In this paper, we first describe an overview of our scalable build service architecture. Then, we discuss more details about how we make build scheduling decisions. Finally, we discuss some experience in the scalability of the build service system and the performance of the build scheduling service.", "venue": "International Symposium on Software Testing and Analysis", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2020-07-13", "journal": {"name": "Proceedings of the 29th ACM SIGSOFT International Symposium on Software Testing and Analysis"}, "authors": [{"authorId": "4054249", "name": "Kaiyuan Wang"}, {"authorId": "1811452770", "name": "Greg Tener"}, {"authorId": "98191794", "name": "V. Gullapalli"}, {"authorId": null, "name": "Xin Huang"}, {"authorId": "2063974855", "name": "Ahmed Gad"}, {"authorId": "1811452774", "name": "Daniel Rall"}], "citations": [{"paperId": "e3fc815a9b7e4b7ca6fd12c337b2f76576be25ff", "title": "Predicting Compilation Resources for Adaptive Build in an Industrial Setting"}, {"paperId": "f8b793e944f6a5ba8ecbee5ff82a8291e6d09567", "title": "Flake Aware Culprit Finding"}, {"paperId": "0b6b969fe06a7ca327312c20f397e201c76effae", "title": "Propeller: A Profile Guided, Relinking Optimizer for Warehouse-Scale Applications"}, {"paperId": "6eb315ef858139a8e1967f852b0da9fd434c7f55", "title": "Smart Build Targets Batching Service at Google"}]}
