{"paperId": "3e536ccd65efae4188fca17f22c125a777742b5b", "publicationVenue": {"id": "6cb480a0-bba3-4bf0-bf6f-8d726736d295", "name": "International Journal of Information Retrieval Research", "type": "journal", "alternate_names": ["Int J Inf Retr Res"], "issn": "2155-6377", "url": "http://www.igi-global.com/ijirr", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-information-retrieval-research/1178"]}, "title": "Dynamic Data Retrieval Using Incremental Clustering and Indexing", "abstract": "The evolution of the Internet and real-time applications has contributed to the growth of massive unstructured data which imposes the increased complexity of efficient retrieval of dynamic data. Extant research uses clustering methods and indexes to speed up the retrieval. However, the quality of clustering methods depends on data representation models where existing models suffer from dimensionality explosion and sparsity problems. As documents evolve, index reconstruction from scratch is expensive. In this work, compact vectors of documents generated by the Doc2Vec model are used to cluster the documents and the indexes are incrementally updated with less complexity using the diff method. The probabilistic ranking scheme BM25+ is used to improve the quality of retrieval for user queries. The experimental analysis demonstrates that the proposed system significantly improves the clustering performance and reduces retrieval time to obtain top-k results.", "venue": "International Journal of Information Retrieval Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Int. J. Inf. Retr. Res.", "pages": "74-91", "volume": "10"}, "authors": [{"authorId": "72537140", "name": "D. UmaPriya"}, {"authorId": "1909073", "name": "P. S. Thilagam"}], "citations": [{"paperId": "ead8cd08ce85bf895753e155a478043eca1e3e9e", "title": "Leveraging Structural and Semantic Measures for JSON Document Clustering"}, {"paperId": "3dec3ccef32b2e350e0aab610f867a8583dc5ef1", "title": "FSOA‐DNFNet: Incremental indexing and image classification using hybrid optimization‐based deep neuro Fuzzy network"}]}
