{"paperId": "3e67e8abbac87dce201eb4981723fa1fc704c635", "publicationVenue": null, "title": "Large Scale Image Processing Using Distributed and Parallel Architecture", "abstract": "--Enormous amount of images are uploaded and used via internet and this ratio is still drastically increasing .So there is instant need to handle this data and customize and filter it as per user and application requirement. This paper describe some parallel and distributed processing techniques like Hadoop, HIPI, Map reduce, CUDA, MPI to process massive database. Mapreduce based large-scale images processing, which exhibit high reliability and scalability in distributed and parallel environment. As highly efficient parallel data processing all these methods are used to analyze and process massive image database. In today’s highly digitalized world large volume of multimedia data need to efficiently store, process and analyze This paper shows usefulness of parallel and distributed techniques. Keywords---Image Processing, Parallel and distributed processing, Mapreduce, Hadoop, HIPI, CUDA, MPI", "venue": "", "year": 2015, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "27691385", "name": "Helly M. Patel"}, {"authorId": "103219375", "name": "Krunal J. Panchal"}, {"authorId": "47273521", "name": "Prashant Chauhan"}, {"authorId": "1911731", "name": "M. Potdar"}], "citations": [{"paperId": "e60b189faa3b1e8440f3412dcb4a7e0b9750d691", "title": "Parallel vs Distributed Edge Detection for Large Medical Image Datasets"}, {"paperId": "9fc0e96ef6c763c58c19694414144311ccd6d186", "title": "A survey on parallel computing for traditional computer vision"}, {"paperId": "ca7c24cf44ea32b56bcb1b20a66cc1d9fbff6116", "title": "Role of Big Data in Medical Imaging Modalities to Extract the Hidden Patterns using HIPI in HDFS Environment"}, {"paperId": "6cdcd3f7a36a60fc23b714940b00693d7728e6c5", "title": "Survey on parallel data cloning and parallel programming"}, {"paperId": "59baec6775aee1ec58d36e5587ad844be4feee1a", "title": "Empirical Aspect of Big Data to Enhance Medical Images Using HIPI"}, {"paperId": "d3d975cd53d074c45a1df2f069e3137230b39422", "title": "Overview of Hadoop in Remote Sensing Image Processing with Various Algorithms and Techniques in Cloud"}]}
