{"paperId": "3e701f6968b76414343c6ace9926c7d3ed34a56d", "publicationVenue": {"id": "00b34432-f7f7-47b7-ab36-5d44dcb497b3", "name": "Natural Hazards", "type": "journal", "alternate_names": ["Nat Hazard"], "issn": "0921-030X", "url": "https://link.springer.com/journal/11069", "alternate_urls": ["http://www.springeronline.com/sgw/cda/frontpage/0,11855,4-10006-70-35533100-0,00.html"]}, "title": "An ensemble random forest tree with SVM, ANN, NBT, and LMT for landslide susceptibility mapping in the Rangit River watershed, India", "abstract": null, "venue": "Natural Hazards", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-13", "journal": {"name": "Natural Hazards", "pages": "1601 - 1633", "volume": "113"}, "authors": [{"authorId": "143616573", "name": "Sk Ajim Ali"}, {"authorId": "1688471998", "name": "F. Parvin"}, {"authorId": "46546356", "name": "Q. Pham"}, {"authorId": "1387272137", "name": "K. M. Khedher"}, {"authorId": "66905712", "name": "M. Dehbozorgi"}, {"authorId": "9220582", "name": "Yasin Wahid Rabby"}, {"authorId": "107606140", "name": "Duong Tran Anh"}, {"authorId": "2221641035", "name": "Duc Nguyen"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "f96cd450fac40912232ed8c6a3d12e785b9be096", "title": "Multi-spectral remote sensing and GIS-based analysis for decadal land use land cover changes and future prediction using random forest tree and artificial neural network"}, {"paperId": "46c84b583576906dffbefd0960efd978901ee264", "title": "How do the landslide and non-landslide sampling strategies impact landslide susceptibility assessment? — A catchment-scale case study from China"}, {"paperId": "53bd421ea66b452a598e6667771e5f54d16ffdb1", "title": "Implication of novel hybrid machine learning model for flood subsidence susceptibility mapping: A representative case study in Saudi Arabia"}, {"paperId": "1abf93b9d06fbcccd74ccfc13a4a1d8465401f2f", "title": "Developing a hybrid deep learning model with explainable artificial intelligence (XAI) for enhanced landslide susceptibility modeling and management"}, {"paperId": "7c09abc7874c05148836e2284f513f4fe1792d00", "title": "Modeling and Evaluation of the Susceptibility to Landslide Events Using Machine Learning Algorithms in the Province of Chañaral, Atacama Region, Chile"}, {"paperId": "d2a5afcfd40fdc3790b538b5cc98a4b82fa2592b", "title": "Application of GIS-Based data-driven bivariate statistical models for Landslide prediction: A case study of highly affected landslide prone areas of Teesta River basin"}, {"paperId": "375af5ec1dba85c4fe0b1455bce29b1aae33d41e", "title": "A novel CGBoost deep learning algorithm for coseismic landslide susceptibility prediction"}, {"paperId": "1ef8bca8db0bb8513d70924e98a9662fe828a908", "title": "Landslide impacting factors and susceptibility assessment in part of the Purvanchal Himalayas using data mining approaches"}, {"paperId": "411da20d095d0fa3f6a82fcf68a1c17aef70ad10", "title": "Gully erosion mapping susceptibility in a Mediterranean environment: A hybrid decision-making model"}, {"paperId": "05d9afecf3db180729eb71e100c908148b72f75b", "title": "Dynamic landslide susceptibility mapping over recent three decades to uncover variations in landslide causes in subtropical urban mountainous areas"}, {"paperId": "e24119d6f41ae34bdd301157132eb1cd694e461a", "title": "Comparative Analysis of Tree-Based Ensemble Learning Algorithms for Landslide Susceptibility Mapping: A Case Study in Rize, Turkey"}, {"paperId": "f96685480bcda7880daafd45616bd866693d1901", "title": "Mass movement susceptibility prediction and infrastructural risk assessment (IRA) using GIS-based Meta classification algorithms"}, {"paperId": "4c86a5cb6a1a419458610b833566c2bf2450e60f", "title": "Comparative study on landslide susceptibility mapping based on different ratios of training samples and testing samples by using RF and FR-RF models"}, {"paperId": "3b44fd0b7c37942fe27c5fcfadc87339a4f7677a", "title": "Landslide Susceptibility Evaluation of Machine Learning Based on Information Volume and Frequency Ratio: A Case Study of Weixin County, China"}, {"paperId": "c7b988d0735aafebad3ed69736d738e23278638e", "title": "Landslide Susceptibility Assessment of a Part of the Western Ghats (India) Employing the AHP and F-AHP Models and Comparison with Existing Susceptibility Maps"}, {"paperId": "3874147846e99750162cb940c51c4ee9a8941ce8", "title": "Evaluation and analysis of statistical and coupling models for highway landslide susceptibility"}, {"paperId": "fc9fba8446e6f5c968a5c89e1e119b85b1cfc324", "title": "Spatial Analysis on the Variances of Landslide Factors Using Geographically Weighted Logistic Regression in Penang Island, Malaysia"}, {"paperId": "65de1cadf0638c0ee9cb889f0eb57f618b5233f2", "title": "Reliable assessment approach of landslide susceptibility in broad areas based on optimal slope units and negative samples involving priori knowledge"}, {"paperId": "481e9ea5c965229d1f32a7972f853ef96b584b89", "title": "基于水系分区的滑坡易发性机器学习分析方法: 以重庆市奉节县为例"}]}
