{"paperId": "3e83aafe308dbb622d43598a1fd2e5bea4b9ea2c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Efficient im2row-Based Fast Convolution Algorithm for ARM Cortex-M MCUs", "abstract": "With the rise of IoT and edge computing, deploying neural networks (NNs) on low-power edge computing devices is drawing more and more attention. In NNs, convolutional layers take up the majority of the computing cycles, especially when NNs are implemented on ARM processors. Therefore, it is necessary to optimize the convolutional implementation on ARM Cortex-M MCUs. This paper proposes an efficient im2row-based fast convolution algorithm with two innovations. First, a novel im2row method for reusing the data of adjacent convolutional windows is presented. This method utilizes a reusable im2row buffer for data reuse, significantly reducing the amount of data copied during im2row and improving efficiency. Second, in algorithm implementation, a <italic>q7_t</italic> to <italic>q15_t</italic> data type extension technique that avoids data reordering is employed. This technique eliminates data reordering instructions, thus reducing the runtime of the algorithm. We evaluate our algorithm in separate convolutional layers and NNs. The results for convolutional layers show that, compared to baseline, the proposed algorithm speeds up the convolutional layer by an average of <inline-formula> <tex-math notation=\"LaTeX\">$1.42\\times $ </tex-math></inline-formula>, and the maximum speedup is up to <inline-formula> <tex-math notation=\"LaTeX\">$2.9\\times $ </tex-math></inline-formula>. Experiments on different NNs demonstrate that our algorithm can speed up the overall NN by up to <inline-formula> <tex-math notation=\"LaTeX\">$2.15\\times $ </tex-math></inline-formula>.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "124384-124395", "volume": "9"}, "authors": [{"authorId": "2155302034", "name": "Peng Wang"}, {"authorId": "2108158038", "name": "Xiaoqin Wang"}, {"authorId": "2054638279", "name": "Rui Luo"}, {"authorId": "2145384996", "name": "Dingyi Wang"}, {"authorId": "2152301500", "name": "Mengjie Luo"}, {"authorId": "2502080", "name": "Shushan Qiao"}, {"authorId": "2135906685", "name": "Yumei Zhou"}], "citations": [{"paperId": "4aba1084176040e0679000edb3d783e4ee520705", "title": "CNNET: A Configurable Hardware Accelerator for Efficient Inference of 8-bit Fixed-Point CNNs"}]}
