{"paperId": "3e8e3a06f4e4ef6fd34ef03637f62fa1938bc7cf", "publicationVenue": {"id": "788f31b6-c30e-434e-a156-2af67e53e68a", "name": "Social psychology quarterly", "type": "journal", "alternate_names": ["Soc psychol q", "Soc Psychol Q", "Social Psychology Quarterly"], "issn": "0190-2725", "url": "https://journals.sagepub.com/home/spq", "alternate_urls": ["http://spq.sagepub.com/", "https://www.jstor.org/journal/socipsycquar"]}, "title": "Denigrating Women, Venerating “Chad”: Ingroup and Outgroup Evaluations among Male Supremacists on Reddit", "abstract": "Can negative evaluations of a broad outgroup paired with positive evaluations of a broad ingroup, sustain willing affiliation with even intensely self-derogating online communities? Synthesizing concepts from masculinities scholarship, social identity theory, and self-verification theory, this study compares language from two distinctive misogynist communities active on Reddit.com—Men Going Their Own Way, male separatists who positively frame members as superior to other men and men as superior to women, and Involuntary Celibates (incels), who openly derogate incel community members—to understand what sustains misogynist incels’ willing affiliation with the self-derogating incel community. Using thematic qualitative analysis, I find that while male separatists favor both their own narrower online community and the broader ingroup of men, misogynist incels engage in a patriarchal bargain, using relatively benevolent depictions of some men alongside negative depictions of all women to perpetuate broader gender inequality.", "venue": "Social psychology quarterly", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-01", "journal": {"name": "Social Psychology Quarterly", "pages": "279 - 299", "volume": "85"}, "authors": [{"authorId": "2133718229", "name": "Katherine Furl"}], "citations": [{"paperId": "645a73547bf210a1d7bbe6b88cdca14ca8459ee7", "title": "The Mating Psychology of Incels (Involuntary Celibates): Misfortunes, Misperceptions, and Misrepresentations."}]}
