{"paperId": "3e9587a397c98f0568087c2361c14279fecc7446", "publicationVenue": {"id": "83999781-2889-4332-a184-0ea95cb13249", "name": "Bulletin of business and economics", "alternate_names": ["Bull bus econ"], "issn": "2409-9368", "url": "http://rfh.org.pk/jur/magazine-category/bbe/"}, "title": "Optimal Emerging trends of Deep Learning Technique for Detection based on Convolutional Neural Network", "abstract": "There has never been a more important need for early, non-invasive lung cancer detection because lung cancer is still one of the world's biggest health concerns. Conventional diagnostic methods such as CT scans and X-rays are very helpful in identifying the disease, but manual interpretation is prone to inconsistent results and human error. In response to this difficulty, our work presents an improved automated approach that uses deep learning models to accurately classify lung images. This work makes use of a large dataset of lung images that have been classified as normal, malignant, and benign. An initial examination of the dataset revealed distinct features related to image dimensions as well as discernible differences between categories. Understanding how important it is for input to neural networks to be consistent, every image was subjected to a thorough preprocessing process in which they were grayscale and standardized to a single dimension. The Synthetic Minority Oversampling Technique (SMOTE) was utilized to address the observed class imbalances within the dataset. Three new architectures—Model I, Model 2, and Model 3—as well as an ensemble method that integrated their forecasts were presented. With an accuracy of roughly 84.7%, Model 1 stood out as the most promising of the models. But the ensemble approach, which was created to capitalize on the advantages of individual models, produced an impressive 82.5% accuracy. Even though Models 2 and 3 had lower accuracy, their distinct advantages and misclassification trends are being taken into consideration for future ensemble enhancements. A prompt, accurate, non-invasive solution to the problems associated with lung cancer detection is provided by the suggested deep learning-driven approach. Reduced diagnostic errors and better patient outcomes could result from its potential for seamless integration with current diagnostic tools. We want to take this research and make it more approachable so that clinicians will accept it and we can move forward with a new generation of diagnostic technology. ", "venue": "Bulletin of business and economics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-25", "journal": {"name": "Bulletin of Business and Economics (BBE)"}, "authors": [{"authorId": "2281088614", "name": "Ammar Hassan"}, {"authorId": "2278281745", "name": "Hamayun Khan"}, {"authorId": "2278341773", "name": "Irfan Uddin"}, {"authorId": "2281130029", "name": "Abdullah Sajid"}], "citations": []}
