{"paperId": "3e9d30ee57a52e0021bbc21c609bfa609b0e29c5", "publicationVenue": null, "title": "K-means cluster approach in grouping of seaweed agroindustry development areas", "abstract": "Location determination is one of the important factors considered in agroindustry development. This study aimed to overview the regional grouping of seaweed agroindustry development in Indonesia. The K-mean Cluster approach was carried out to classify 26 seaweed-producing areas based on several criteria, such as availability of raw materials, labour, markets, and infrastructure. Data processing was conducted using SPSS software and produced 4 significantly different clusters. This was confirmed by a Euclidean distance obtained from ANOVA results, with a significance level below 0.05. The four clusters obtained can be categorized as “Highly Developing”, “Developing”, “Develop Enough”, and “Less Developed. Among 26 seaweed producing areas, East Java Province was included in a Highly Developing cluster, 3 provinces (South Sulawesi, Central Sulawesi, and East Nusa Tenggara) were included in a Developing cluster, 18 provinces (Maluku, West Nusa Tenggara, North Kalimantan, Southeast Sulawesi, Sulawesi North Maluku, Central Java, West Sulawesi, East Kalimantan, Gorontalo, Bengkulu, North Sumatra, West Kalimantan, South Kalimantan, Papua, West Papua, Lampung and Bali) were categorized into a “Develop Enough” cluster and 4 provinces (Banten, DKI Jakarta, West Java, Riau Islands) were categorized into a “Less Developed”.", "venue": "IOP Conference Series: Earth and Environment", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-07-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "1063"}, "authors": [{"authorId": "2094448395", "name": "W. Sudarwati"}, {"authorId": "104893314", "name": "H. Hardjomidjojo"}, {"authorId": "101280542", "name": "Machfud"}, {"authorId": "89369544", "name": "D. Setyaningsih"}], "citations": [{"paperId": "d52a6d1c35c3515568e6e3efd6585ab04a1fd6df", "title": "Construction and Application of Urban and Rural Planning Analysis Model Based on K-Means Algorithm"}]}
