{"paperId": "3ea8ee6b0c8134f7b3f136fbbab837692abe8aa4", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "Polymetallic mineralization prospectivity modelling using multi-geospatial data in logistic regression: The Diapiric Zone, Northeastern Algeria", "abstract": "Abstract Prospecting and exploring minerals present major challenges in tectonically complex regions for sustainable development as in Northeastern Algeria. This area is promising for its mineral potential, especially the metallogenic province ‘The Diapiric Zone’. This study concerns mapping and predicting potential polymetallic mineralization locations by integration of remote sensing, gravity, and magnetic datasets. Several enhancement and processing methods have been applied on Landsat8_OLI and ASTER_1T remote sensed data to reduce uncertainty for achieving the best detection of hydrothermal alteration zones and lithological mapping. Furthermore, the Centre for Exploration Targeting grid analysis technique, the contact occurrence density and entropy orientation tools were employed on ground-gravity and aeromagnetic data to understand and visualize the pathways for hydrothermal fluids circulation of mineral deposits. The polymetallic mineralization prospective areas were produced using a logistic regression model on the resulting multifactor. High zones of lead-zinc cover most the area that has been confirmed by field investigation.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-01", "journal": {"name": "Geocarto International", "pages": "15392 - 15427", "volume": "37"}, "authors": [{"authorId": "2174643205", "name": "Mohammed Hichem Bencharef"}, {"authorId": "107890970", "name": "Ahmed M. Eldosouky"}, {"authorId": "108376858", "name": "S. Zamzam"}, {"authorId": "101317551", "name": "D. Boubaya"}], "citations": [{"paperId": "0cd3bcf79018f7c210c2befa28ecd49bd9706955", "title": "Three-dimensional modeling and geostatistical structural analysis for ore deposit prospecting trend and wisdom mining: a case study in the Jiaoxibei gold field, China"}, {"paperId": "931a4a1c40c31ec666e44e025f2e2281a98bf8c7", "title": "A New Vector for Mapping Gold Mineralization Potential and Proposed Pathways in Highly Weathered Basement Rocks using Multispectral, Radar, and Magnetic Data in Random Forest Algorithm"}, {"paperId": "716b71cc75cd52247021411b65d949c3c055be8a", "title": "Inversion of Geomagnetic Anomalies Caused by Ore Masses Using Hunger Games Search Algorithm"}, {"paperId": "186c3d5415372884ed2feabb8d18684c70058380", "title": "Mapping of the Structural Lineaments and Sedimentary Basement Relief Using Gravity Data to Guide Mineral Exploration in the Denizli Basin"}, {"paperId": "8f70b703ab04a65cc8dfe6859df3a9b18d9bdf01", "title": "Extracting hydrothermally altered information using WorldView-3 data: a case study of Huitongshan, NW Gansu, China"}, {"paperId": "484a1b5db45d469214a8283d55b08dd10b8a0fde", "title": "An aeromagnetic denoising-decomposition-3D inversion approach for mineral exploration"}, {"paperId": "33f9d66f3e7350c14be3659e1f53c764441e7d3f", "title": "Arbuscular mycorrhizal fungi participate to the restoration of a gypsum mining site in western Algeria"}, {"paperId": "dbbfb461418d6da3dd5870651bd57c2a887d697e", "title": "Sulfide disseminations and hydrothermal alteration haloes in the Gabal Monqul area, Egypt: Field, mineralogical, and remote sensing studies"}, {"paperId": "fb6671294e13ee64adc9fcf219845ce0ec57747b", "title": "Exploratory assessment of geothermal resources in some parts of the Middle Benue Trough of Nigeria using airborne potential field data"}, {"paperId": "4058c2a8fdf1402fdc4e7c294e5e7249aef93db8", "title": "Modeling of structural features from aeromagnetic maps using an improved deep learning technique"}, {"paperId": "fdea3e2e80124c4ddae5e3946502fbcc3f535458", "title": "Application of High-Precision Filters on Airborne Magnetic Data: A Case Study of the Ogoja Region, Southeast Nigeria"}, {"paperId": "b274c48f275fc28122c1889fda707870b41260a5", "title": "Integrating mineralogy, geochemistry and aeromagnetic data for detecting Fe–Ti ore deposits bearing layered mafic intrusion, Akab El-Negum, Eastern Desert, Egypt"}, {"paperId": "0d445c7b93c63ef311ae3d5b8f8850cf1d57c6a5", "title": "Occurrence Characteristics of Magnetite and Aeromagnetic Prospecting Northeast of Hebei Province"}, {"paperId": "eadffc0ab3d7751317df41cfd927b41eec4eb8fc", "title": "Role of an advanced gravity data analysis in improving the geologic understanding of the northern Tebessa region, Northeastern Algeria"}, {"paperId": "50c96828f0534db073f14fc336058f3b65f0dafd", "title": "Inversion of the Gravity Gradiometry Data by ResUnet Network: An Application in Nordkapp Basin, Barents Sea"}]}
