{"paperId": "3eb801a8d8005c4c54c25e1f11ae9edddb202cd2", "publicationVenue": null, "title": "ApproxCT: Approximate Clustering Techniques for Energy Efficient Computer Vision in Cyber-Physical Systems", "abstract": "The emerging trends in miniaturization of Internet of Things (IoT) have highly empowered the Cyber-Physical Systems (CPS) for many social applications especially, medical imaging in healthcare. The medical imaging usually involves big data processing and it is expedient to realize its clustering after data acquisition. However, the state-of-the-art clustering techniques are compute intensive and tend to reduce the processing capability of battery-driven or energy harvested IoT based embedded devices (e.g., edge and fogs). Thus, there is a desire to perform energy efficient implementation of the machine learning based clustering techniques. Since, the clustering techniques are inherently resilient to noise and thus, their resilience can be exploited for energy efficiency using approximate computing. In this paper, we proposed approximate versions of the widely used K-Means and Mean Shift clustering techniques using the state-of-the-art low power approximate adders (IMPACT). The trade-off between power consumption and the output quality is exploited using five well-known pattern recognition datasets. The experiments reveal that K-Means algorithm exhibits more error resilience towards approximation with a maximum of 10% - 25% power savings.", "venue": "2018 12th International Conference on Open Source Systems and Technologies (ICOSST)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 12th International Conference on Open Source Systems and Technologies (ICOSST)", "pages": "64-70"}, "authors": [{"authorId": "68972564", "name": "Raja Haseeb Javed"}, {"authorId": "145135743", "name": "Ayesha Siddique"}, {"authorId": "1810873", "name": "R. Hafiz"}, {"authorId": "2090504235", "name": "Osman Hasan"}, {"authorId": "145063983", "name": "M. Shafique"}], "citations": [{"paperId": "c0eda0c5b4314edcfd8ac734586e745b590e711f", "title": "Moving Target Defense Through Approximation for Low-Power Neuromorphic Edge Intelligence"}, {"paperId": "39f2f19b0bbd773e7d403128da5af0bcf9a3e016", "title": "Exposing Reliability Degradation and Mitigation in Approximate DNNs Under Permanent Faults"}, {"paperId": "2fbf6b70d1e667959191ff48a56fdd0f02434fe4", "title": "A Survey and Future Directions on Clustering: From WSNs to IoT and Modern Networking Paradigms"}, {"paperId": "57169892a94fc885c82351d3394fad71c9d3c2a7", "title": "Exploring Fault-Energy Trade-offs in Approximate DNN Hardware Accelerators"}, {"paperId": "f5e335394b305bd8efdfd86f7be579584439f13c", "title": "A systematic review of IoT communication strategies for an efficient smart environment"}, {"paperId": "3d66e3e38a79363282de3af36c8ee602075f406e", "title": "Machine Learning for Resource Management in Cellular and IoT Networks: Potentials, Current Solutions, and Open Challenges"}]}
