{"paperId": "3ec3ddab8dc694070b597d0c1382fe3fdb88f44e", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Theft Prediction Model Based on Spatial Clustering to Reflect Spatial Characteristics of Adjacent Lands", "abstract": "Previous studies have shown that when a crime occurs, the risk of crime in adjacent areas increases. To reflect this, previous grid-based crime prediction studies combined all the cells surrounding the event location to be predicted for use in model training. However, the actual land is continuous rather than a set of independent cells as in a geographic information system. Because the patterns that occur according to the detailed method of crime vary, it is necessary to reflect the spatial characteristics of the adjacent land in crime prediction. In this study, cells with similar spatial characteristics were classified using the Max-p region model (a spatial clustering technique), and the performance was compared to the existing method using random forest (a tree-based machine learning model). According to the results, the F1 score of the model using spatial clustering increased by approximately 2%. Accordingly, there are differences in the physical environmental factors influenced by the detailed method of crime. The findings reveal that crime involving the same offender is likely to occur around the area of the original crime, indicating that a repeated crime is likely in areas with similar spatial features to the area where the crime occurred.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2021-07-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2155182489", "name": "Dong Young Kim"}, {"authorId": "2913222", "name": "Sung-Kwan Jung"}, {"authorId": "12936004", "name": "Yongwook Jeong"}], "citations": [{"paperId": "8be43a4e576708ec141165efa7cb3dc9fad011da", "title": "Predicting and analysing initiator crime environments based on machine learning for improving urban safety"}, {"paperId": "f71c27ea61468e3f5edf97b75ff7ed69eb6b6230", "title": "Analyzing Criminal Macrocauses on Intentional Lethal Violent Crimes: An Unsupervised Learning Approach for Smart City Initiatives"}, {"paperId": "b5300cf6da920e1ebf206851fd18a92123fc5a40", "title": "Spatiotemporal Predictive Geo-Visualization of Criminal Activity for Application to Real-Time Systems for Crime Deterrence, Prevention and Control"}, {"paperId": "d85ec8f762cbfe25f98a608de8a06ad7e1e9a3a6", "title": "Sustainable Real Estate and Resilient Cities: Management, Assessment and Innovations"}, {"paperId": "4f543bbf128493a55d55e0e0743363c91571391f", "title": "Machine learning for spatial analyses in urban areas: a scoping review"}, {"paperId": "4dd7c047f7bad672147a585a681e71a5b4543515", "title": "Technological Solution for Crime Prevention in Los Olivos"}]}
