{"paperId": "3ec8308dba12187ee76f3f5eaa4958d1f1cfd54a", "publicationVenue": {"id": "7ddefda0-174f-499a-9dce-855879dd01b7", "name": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "type": "conference", "alternate_names": ["IPDPSW", "IEEE Int Symp Parallel  Distrib Process Work Phd Forum"]}, "title": "BigDataBench-S: An Open-Source Scientific Big Data Benchmark Suite", "abstract": "Data generated from modern scientific instrumentation have grown up to an unprecedented scale. Moreover, data formats and computational behaviors of scientific big data workloads are much more complex than those in Internet services. These two facts pose a serious challenge to scientific data management and analytics. Among many concerns, the first one is how to build a comprehensive and representative scientific big data benchmark suite. Previous benchmark efforts either focus on Internet areas (i.e. BigDataBench) or pay attention to a specific area (i.e. GeneBase). This paper presents our preliminary work on building a comprehensive scientific big data benchmark suite---BigDataBench-S. Also, we use BigDataBench-S to evaluate several general-purpose big data management systems specifically designed for Internet services applications. Our evaluation shows: these systems cannot achieve expected performance for many scientific workloads, especially for complex matrix computation, for the lack of appropriate mechanisms and policies on data storage, query optimization and support of distributed matrix computation.", "venue": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-01", "journal": {"name": "2017 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)", "pages": "1068-1077"}, "authors": [{"authorId": "144362581", "name": "Xinhui Tian"}, {"authorId": "19284323", "name": "Shaopeng Dai"}, {"authorId": "1695539", "name": "Zhihui Du"}, {"authorId": "46874006", "name": "Wanling Gao"}, {"authorId": "1380311995", "name": "Rui Ren"}, {"authorId": "3181573", "name": "Yaodong Cheng"}, {"authorId": "2109019595", "name": "Zhifei Zhang"}, {"authorId": "144094781", "name": "Zhen Jia"}, {"authorId": "2118952508", "name": "Peijian Wang"}, {"authorId": "2062319", "name": "Jianfeng Zhan"}], "citations": [{"paperId": "f094782807b127fab81378677afa505403c8a506", "title": "A Solution to Query Processing Challenges Through Smart Query Processor for Big Data Analytics"}, {"paperId": "60513bd2c330dbdc71230c3c198e08fc0a78278b", "title": "Process-driven quality improvement for scientific data based on information product map"}, {"paperId": "1d9f157927f3fe3a372f686a8f86b74d7fac65bf", "title": "ABench2020: A WCET Benchmark Suite in Ada Programming Language"}, {"paperId": "ac73a63a3adbdf30ff798b6a2bc907c3bf058dfd", "title": "MBBench: A WCET Benchmark Suite"}, {"paperId": "91501c98a18cd9e95b87bde7b634482b4737ce25", "title": "IndexIt: Enhancing Data Locating Services for Parallel File Systems"}, {"paperId": "43e318bd214b623655c9a67f8888e5d5131335e6", "title": "Visual Road: A Video Data Management Benchmark"}, {"paperId": "d2008e64cfbf2a86f4f823bea3e2ddc225eac9ab", "title": "PBench: A Parallel, Real-Time Benchmark Suite"}, {"paperId": "de844933393619dd60f20dea3f097fe4f0beb81f", "title": "A Survey of Big Data, High Performance Computing, and Machine Learning Benchmarks"}]}
