{"paperId": "3ed35eae89b2a189b37ea45d6e432cfee870e80f", "publicationVenue": {"id": "256a5738-77cc-4cee-ad61-ef18264f639c", "name": "Applied Computing and Informatics", "type": "journal", "alternate_names": ["Appl Comput Informatics"], "issn": "2210-8327", "alternate_issns": ["2634-1964"], "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/724375/description#description", "alternate_urls": ["https://www.journals.elsevier.com/applied-computing-and-informatics/", "https://www.emeraldgrouppublishing.com/journal/ajms"]}, "title": "Ubi-Flex-Cloud: ubiquitous flexible cloud computing: status quo and research imperatives", "abstract": "PurposeCloud computing originated in central data centers that are connected to the backbone of the Internet. The network transport to and from a distant data center incurs long latencies that hinder modern low-latency applications. In order to flexibly support the computing demands of users, cloud computing is evolving toward a continuum of cloud computing resources that are distributed between the end users and a distant data center. The purpose of this review paper is to concisely summarize the state-of-the-art in the evolving cloud computing field and to outline research imperatives.Design/methodology/approachThe authors identify two main dimensions (or axes) of development of cloud computing: the trend toward flexibility of scaling computing resources, which the authors denote as Flex-Cloud, and the trend toward ubiquitous cloud computing, which the authors denote as Ubi-Cloud. Along these two axes of Flex-Cloud and Ubi-Cloud, the authors review the existing research and development and identify pressing open problems.FindingsThe authors find that extensive research and development efforts have addressed some Ubi-Cloud and Flex-Cloud challenges resulting in exciting advances to date. However, a wide array of research challenges remains open, thus providing a fertile field for future research and development.Originality/valueThis review paper is the first to define the concept of the Ubi-Flex-Cloud as the two-dimensional research and design space for cloud computing research and development. The Ubi-Flex-Cloud concept can serve as a foundation and reference framework for planning and positioning future cloud computing research and development efforts.", "venue": "Applied Computing and Informatics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-05-19", "journal": {"name": "Applied Computing and Informatics"}, "authors": [{"authorId": "8597321", "name": "Akhilesh S. Thyagaturu"}, {"authorId": "2165603200", "name": "G. Nguyen"}, {"authorId": "3407759", "name": "B. Rimal"}, {"authorId": "1740196", "name": "M. Reisslein"}], "citations": [{"paperId": "d15c8c9ce5cb4ec74576690977e9238ec2b4704c", "title": "IoT-Inspired Secure Healthcare Framework for Adult: Blockchain Perspective"}]}
