{"paperId": "3edd1c95677095e561d6c47b7a75169027a4608f", "publicationVenue": {"id": "c763f370-eee9-4b18-a73d-80d35017fbd8", "name": "International Journal on Advanced Science, Engineering and Information Technology", "type": "journal", "alternate_names": ["Int J Adv Sci Eng Inf Technol"], "issn": "2088-5334", "url": "http://ijaseit.insightsociety.org/"}, "title": "Statistical Comparison of Architecture Driven Modernization with other Cloud Migration Frameworks and Formation of Clusters", "abstract": "Corporations are migrating their legacy software systems towards the cloud environment for amelioration, to avail benefits of the cloud. Long term success of modernizing a legacy software depends on the characteristics of the chosen cloud migration approach. Organizations must think over how strategically imperative is the chosen cloud migration framework to their business? Thus, the Object Management Group (OMG) has defined standards for the modernization process based on Architecture Driven Modernization (ADM) framework. ADM serves as a vehicle for facilitating the arrangement of information technology with business stratagem and its architecture. Until now, it seems that there is no systematic mapping among ADM and other cloud migration frameworks, highlighting the demanding features. This research aims to give an in-depth study of similar cloud migration frameworks. Thus, the researchers introduced the clusters containing cloud migration frameworks having similar features to ADM. This systematic mapping can be seen as a valuable asset for those who are interested in choosing the best migration framework from the pool of cloud modernization frameworks, according to their legacy software requirements. The clustering technique is used to appraise and compare ADM with some of the other cloud migration frameworks for highlighting the similarities and key differences. The quality of clusters is evaluated by the Rand index and Silhouette measurements. The study distills the record and yields a sound and healthy catalog for essential events and concerns that are communal in cloud migration frameworks. This research offers the one-stop-shop convenience that the industry desperately desires.", "venue": "International Journal on Advanced Science, Engineering and Information Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-20", "journal": {"name": "International Journal on Advanced Science, Engineering and Information Technology"}, "authors": [{"authorId": "47944948", "name": "Mubeen Aslam"}, {"authorId": "1941227", "name": "L. Rahim"}, {"authorId": "47577197", "name": "M. Hashmani"}, {"authorId": "1702521", "name": "J. Watada"}], "citations": [{"paperId": "c230eab7db1a942c8e4dc29bf87cf0aab0bddc31", "title": "AI-based Quality-driven Decomposition Tool for Monolith to Microservice Migration"}, {"paperId": "ec3a5cf47df62c5b6a980b3a4388427c17060000", "title": "Cloud migration framework clustering method for social decision support in modernizing the legacy system"}]}
