{"paperId": "3eef8fb1197f4295a9c59f23cc381909691ac827", "publicationVenue": {"id": "4ee942df-8fd9-437c-a9a6-e82a7cfdfb33", "name": "International Conference on Data Science and Information Technology", "type": "conference", "alternate_names": ["DSIT ", "Int Conf Data Sci Inf Technol"]}, "title": "An evolutionary adaptive clustering algorithm", "abstract": "In order to solve the problem that the number of clusters needs to be specified artificially in the partition clustering and hierarchical clustering methods, this paper proposes an adaptive clustering algorithm which can search the number of clusters independently through the self evolution pattern of samples without any prior knowledge (AdaCluster). Adacluster algorithm includes two stages: cluster number self evolution stage and label propagation stage. In the evolution stage, a small number of samples are randomly sampled from the sample space, and then the number of clusters is independently evolved according to the designed control parameters in an incremental form to obtain the initial clustering results; In the label propagation stage, the cluster labels obtained in the evolution stage are propagated to the unlabeled samples. Adacluster algorithm is completely based on self evolution pattern, and can determine the number of clusters without any prior parameters. The Adacluster algorithm is compared with other typical algorithms on a large number of datasets, and applied in image segmentation. The results show that Adacluster algorithm has excellent clustering performance and high robustness.", "venue": "International Conference on Data Science and Information Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-07-23", "journal": {"name": "2021 4th International Conference on Data Science and Information Technology"}, "authors": [{"authorId": "50492525", "name": "Peng Li"}, {"authorId": "2117713193", "name": "Haibin Xie"}, {"authorId": "2112354515", "name": "Zhiyong Ding"}], "citations": []}
