{"paperId": "3f0a8cbde7efc0403506357e5f77ac2ab109b6e2", "publicationVenue": null, "title": "Comparative Study of Classification Algorithms to Analyze and Predict a Twitter Sentiment in Apache Spark", "abstract": "Nowadays, the major sources of information exchange are Twitter, Facebook, WordPress, etc. The tweets can be considered as the source of the public opinion on an event, a product, or a topic. Consequently, it contains large volumes of natural data. Enormous dataset contains a huge volume and variety of information. Therefore, it cannot be prepared utilizing normal conventional tools. It can be processed by building up distributed environment or by contracting cloud based isolated infrastructure. Therefore, better approaches and instruments are required to bring the respect of the information. Apache spark is actually appropriate for performing machine learning on large-scale information. To discover out how rapidly Spark processes of huge information, we make an approach that utilize Machine Learning library (MLlib) classification algorithms in Apache Spark. We implement Logistic Regression, Multilayer Perceptron (MLP), Random Forest and Support Vector Machine (SVM) and compare among them. The models are for analysis and predicting the sentiment based on a corona tweets. A sentiment analysis based on tweets is a challenging issue. The classification algorithm is assessed by precision, recall, f-measure, accuracy and time consumed. The results show that logistic regression algorithm has higher speed in doing enormous information processing than other chosen algorithms. Moreover, according to the obtained results, apache spark has exceptionally great speed in handling big data. The classification algorithm is assessed by precision, recall, f-measure, accuracy and time consumed.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2020-11-19", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "928"}, "authors": [{"authorId": "1409149923", "name": "Wafaa S. Albaldawi"}, {"authorId": "1704251", "name": "Rafah M. Almuttairi"}], "citations": [{"paperId": "0ba211175390d3217569f49bb990987a9611e643", "title": "Analyzing Large-Scale Twitter Real Time Streaming Data with Manifold Machine Learning Algorithms in Apache SPARK"}, {"paperId": "5604cc41164599fc2c85bc17d663203c251a83fa", "title": "Nuclear energy: Twitter data mining for social listening analysis"}, {"paperId": "85ef1968226586cf8d475f0233327d8122c3f7f6", "title": "Statistical analysis of the performance of four Apache Spark ML algorithms"}, {"paperId": "aff7c8de7224c35ef8265c22c6597068a369e0da", "title": "Real Time Big Data Sentiment Analysis and Classification of Facebook"}, {"paperId": "6c7fd9f1574424d0d09edc4d5432a6b0ffd8e579", "title": "A Survey on Big Data Research in Fighting COVID-19: Contributions and Techniques"}]}
