{"paperId": "3f124fdeee71ad2e1b8812146a780106f9e2b667", "publicationVenue": {"id": "8db748fc-382d-4da1-a80c-4aa6f816ad84", "name": "Mühendislik Bilimleri ve Araştırmaları Dergisi", "type": "journal", "alternate_names": ["Mühendis Bilim ve Araştırmaları Derg"], "issn": "2687-4415", "url": "https://dergipark.org.tr/tr/pub/bjesr"}, "title": "Data Mining For CO2 Emissions Prediction In Italy", "abstract": "Received :15 Jaunuary 2021 Accepted : 8 February 2021 This study is a preliminary evaluation of the situation of CO2 emissions in Italy, reviewing the international and national literature, using global datasets, and using data mining techniques for analysis and prediction. The study used descriptive methods. It focuses on finding the main potential parameters that effect the concentration of CO2 emissions based on energy resources in Italy. Sequential Minimal Optimization regression (SMOreg), Linear Regression, and Simple Linear Regression are used. Based on the analysis, the Liquid Fuel sector has had the highest rate of increase in CO2 emission 56.8%. R. Linear Regression algorithm gives us a better performance of the prediction for the CO2 emissions than the second algorithm Simple Linear Regression. These results are in line with the present condition in Italy due to the Italian National Program on Climate Change which focuses on reducing carbon dioxide emissions.", "venue": "Mühendislik Bilimleri ve Araştırmaları Dergisi", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": ["Review"], "publicationDate": "2021-02-08", "journal": {"name": "Mühendislik Bilimleri ve Araştırmaları Dergisi"}, "authors": [{"authorId": "2101055079", "name": "Saleh Y. Abuzir"}, {"authorId": "3039654", "name": "Yousef S. Abuzir"}], "citations": [{"paperId": "77af6154a0cda2de859072a98042035d0b8c2df5", "title": "Forecast of Turkey's Import and Export by Data Mining Methods"}, {"paperId": "cd4368803bb1c4cd74a9eab6c78ba617827ab76c", "title": "Effectual Text Classification in Data Mining: A Practical Approach"}, {"paperId": "44d81f154ebe491dcd6c4636ec4dbb3c8cd593c3", "title": "Kurum Üzüm Tanelerinin Sınıflandırılması İçin Hibrit Bir Yaklaşım"}]}
