{"paperId": "3f318d659d9f9fbc2d9c3f1a5aa9ea164fcf4485", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Incentive Mechanisms for Smart Grid: State of the Art, Challenges, Open Issues, Future Directions", "abstract": "Smart grids (SG) are electricity grids that communicate with each other, provide reliable information, and enable administrators to operate energy supplies across the country, ensuring optimized reliability and efficiency. The smart grid contains sensors that measure and transmit data to adjust the flow of electricity automatically based on supply/demand, and thus, responding to problems becomes quicker and easier. This also plays a crucial role in controlling carbon emissions, by avoiding energy losses during peak load hours and ensuring optimal energy management. The scope of big data analytics in smart grids is huge, as they collect information from raw data and derive intelligent information from the same. However, these benefits of the smart grid are dependent on the active and voluntary participation of the consumers in real-time. Consumers need to be motivated and conscious to avail themselves of the achievable benefits. Incentivizing the appropriate actor is an absolute necessity to encourage prosumers to generate renewable energy sources (RES) and motivate industries to establish plants that support sustainable and green-energy-based processes or products. The current study emphasizes similar aspects and presents a comprehensive survey of the start-of-the-art contributions pertinent to incentive mechanisms in smart grids, which can be used in smart grids to optimize the power distribution during peak times and also reduce carbon emissions. The various technologies, such as game theory, blockchain, and artificial intelligence, used in implementing incentive mechanisms in smart grids are discussed, followed by different incentive projects being implemented across the globe. The lessons learnt, challenges faced in such implementations, and open issues such as data quality, privacy, security, and pricing related to incentive mechanisms in SG are identified to guide the future scope of research in this sector.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-27", "journal": {"name": "Big Data Cogn. Comput.", "pages": "47", "volume": "6"}, "authors": [{"authorId": "2286538930", "name": "S. Bhattacharya"}, {"authorId": "2174374615", "name": "Rajeswari Chengoden"}, {"authorId": "2154336483", "name": "Gautam Srivastava"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "31823344", "name": "A. R. Javed"}, {"authorId": "2173576296", "name": "Nancy Victor"}, {"authorId": "29919430", "name": "Praveen Kumar Reddy Maddikunta"}, {"authorId": "11041265", "name": "T. Gadekallu"}], "citations": [{"paperId": "770800bcd4696cd5e04164d9d068da9582674149", "title": "Enhancing electricity distribution efficiency in Pakistan: A framework for progress and action"}, {"paperId": "2ebbbfd8721dd3e83f06bdad90d2332e94496ec4", "title": "Collaborative drivers’ networks for the development of Smart Energy environments"}, {"paperId": "83bbe81ef55502a1da74d2590dfdc3c67f2ef808", "title": "Feedback Optimization of Incentives for Distribution Grid Services"}, {"paperId": "dacba3106e3219bc548ec04ab9d357a28c4f419d", "title": "Role of IoT technologies in big data management systems: A review and Smart Grid case study"}, {"paperId": "f24f9c1c84f1ab113e6b96edd30b1e44abe1d96a", "title": "A Generalizable Deep Neural Network Method for Detecting Attacks in Industrial Cyber-Physical Systems"}, {"paperId": "287153d44da6a154677d590b95540523f91c62dd", "title": "Detection of cyber-attacks on smart grids using improved VGG19 deep neural network architecture and Aquila optimizer algorithm"}, {"paperId": "51637225f73b1e5ef1d42af4cbb0d045a6013f43", "title": "Prediction of Smart Grid Stability Utilizing Machine Learning Algorithms"}, {"paperId": "b1420266a76d8789230bf2cbafb0edd251595f44", "title": "Data-driven next-generation smart grid towards sustainable energy evolution: techniques and technology review"}, {"paperId": "3b8b5c5a1d12e20c786cffa5da809602e46eaf40", "title": "The Research Agenda on Smart Grids: Foresights for Social Acceptance"}, {"paperId": "d7bfaf8fed1e2e674fcacc3379b190ac939e506a", "title": "Recent Advances Towards Securing Smart Grids with Blockchain"}, {"paperId": "63b8bf3ac7327cc1d23909bf250332e052f3c5b8", "title": "Enhance Demand Response Participants Performance Using a Personalized Recommendation Method"}, {"paperId": "be8bc94f6245e2cc5d22e40c3f7bffad81cc9be1", "title": "A Blockchain based Framework for Secure and Decentralized Energy Trading in a Community"}, {"paperId": "2692c8e4b541ed15b0e93ff38f91dffa8d07df92", "title": "Artificial Intelligence Applications and Prospects for The Smart Grid"}, {"paperId": "8d31cc3a4fa70b98b546ec1169e454997994509a", "title": "Ensemble-Learning-Based Decision Support System for Energy-Theft Detection in Smart-Grid Environment"}, {"paperId": "dd016f3d0d29714038c37635080e1c470cdb26de", "title": "Consumer Attitudes toward Energy Reduction and Changing Energy Consumption Behaviors"}, {"paperId": "9bc31151482576a255bb0f2b8c5427b81619e1f4", "title": "A Survey on Soft Computing Techniques for Federated Learning- Applications, Challenges and Future Directions"}, {"paperId": "852c3ddb4f458e2e48516a1e1a87c030936ea7cf", "title": "Circumventing Google Play vetting policies: a stealthy cyberattack that uses incremental updates to breach privacy"}, {"paperId": "cdd5c7417263e0bc3ecaa82c32f3855d2af931e9", "title": "Energy flexibility and viability enhancement for an ocean-energy-supported zero-emission office building with respect to both existing and advanced utility business models with dynamic responsive incentives"}, {"paperId": "ff2a223b472ef5c59db459b285115df86d5bc750", "title": "Demand Response Contextual Remuneration of Prosumers with Distributed Storage"}, {"paperId": "574c6e260729cf55b28c570fa45cabcbeb40e20c", "title": "Graph Neural Networks for Intelligent Modelling in Network Management and Orchestration: A Survey on Communications"}, {"paperId": "75b9b958d5520c6a2b7692562161e6e78fcd90df", "title": "Incentive techniques for the Internet of Things: A survey"}, {"paperId": "b7ea00dddef0de8d734d1e9a54e9750050337844", "title": "A Survey on Sot Computing Techniques for Federated Learning-Applications, Challenges and Future Directions"}]}
