{"paperId": "3f3d26859a23e0b06061199ab41249bb0ab9b6d2", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Toward Approximate Intelligence: Approximate Query Engines & Approximate Data Exploration", "abstract": "The AI methods are regaining a lot of attention in the areas of data analytics and decision support. Given the increasing amount of information and computational resources available, it is now possible for intelligent algorithms to learn from the data and assist humans more efficiently. Still, there is a question about the goals of learning and a form of the resulting data-driven knowledge. It is evident that humans do not operate with precise information in decision-making and, thus, it might be unnecessary to provide them with complete outcomes of analytical processes. Consequently, the next question arises whether approximate results of computations or results derived from the approximate data could be delivered more efficiently than their standard counterparts. Such questions are analogous to the ones about precision of calculations conducted by machine learning and KDD methods, whereby heuristic algorithms could be boosted by letting them rely on approximate computations. This leads us toward discussion of the importance of approximations in the areas of machine intelligence and business intelligence and, more broadly, the meaning of approximate derivations for various aspects of AI. In this talk, this discussion is supported by four industry-related case studies\\footnoteThe first case study refers entirely to the author's work for Security On-Demand (\\urlhttps://www.securityondemand.com/ ). The work on the second case study was co-financed by the EU Smart Growth Operational Programme 2014-2020 under the Innovation Voucher project POIR.02.03.02-14-0009/15-00. The work on the third case study is co-financed by the EU Smart Growth Operational Programme 2014-2020 under the project POIR.01.01.01-00-0831/17-00. The work on the fourth case study is co-financed by the EU Smart Growth Operational Programme 2014-2020 under the GameINN project POIR.01.02.00-00-0184/17-00 : \\beginenumerate ıtem The approximate database engine based on the paradigms of rough-granular computing applied in the area of cyber-security analytics \\citeslezak:queryengine,\\citeslezak:scalablefeature, \\citeslezak:cyberengine ıtem The similarity-based feature engineering methodology embedded into an HR support system working with heterogeneous information sources \\citeslezak:jobs ; ıtem The ensemble-based attribute approximation approach that will be used in the area of online health support \\citeOvu ; ıtem The process of approximate data generation that will be used for tuning an online gaming coaching platform \\citeEsensei.\\endenumerate", "venue": "The Web Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-04-23", "journal": {"name": "Companion Proceedings of the The Web Conference 2018"}, "authors": [{"authorId": "145514740", "name": "D. Ślęzak"}], "citations": []}
