{"paperId": "3f4618df564eb7e897e5c9367ddf4ccbdf979c22", "publicationVenue": null, "title": "A machine learning framework with dataset-knowledgeability pre-assessment and a local decision-boundary crispness score: An industry 4.0-based case study on composite autoclave manufacturing", "abstract": null, "venue": "Computers in industry (Print)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Comput. Ind.", "pages": "103510", "volume": "132"}, "authors": [{"authorId": "49921399", "name": "B. Crawford"}, {"authorId": "2281759898", "name": "R. Sourki"}, {"authorId": "3296352", "name": "H. Khayyam"}, {"authorId": "3182010", "name": "A. Milani"}], "citations": [{"paperId": "1f177f429080dee922104208423288cadfd0b7be", "title": "Multi-scale neighborhood query graph convolutional network for multi-defect location in CFRP laminates"}, {"paperId": "5b644dbba6d6a8ef134692f43e73f56edb0b5402", "title": "A Root Cause Analysis Method for Abnormal Production in Discrete Manufacturing Workshop"}, {"paperId": "96c13b6f20eb3412d008c2a00b2bd89e69ba918a", "title": "A perspective on biodegradable polymer biocomposites - from processing to degradation"}, {"paperId": "f2a7c1aff41ff50c21cfbb07e4d91d4bc1954e40", "title": "A Risk Evaluation Method Before Using a Black-box Model Considering Sensor Failure"}, {"paperId": "edf246c126facc7b6ee8814943ccada84d2b54c4", "title": "Comparison of k-nearest Neighbor & Artificial Neural Network prediction in the mechanical properties of aluminum alloys"}, {"paperId": "c40ff86113f76265ddca067c7beb3c94f260a5c8", "title": "Bayesian diagnostic learning for a costly composite manufacturing: critical role of dataset size and auxiliary in situ measurements"}, {"paperId": "8fca9b5082adfa3acc2c2ec607b5771ecfb8c9d7", "title": "Autonomous Navigation of Robots: Optimization with DQN"}, {"paperId": "d629a6a6362dcce6424827f30ef97aa9fb4ee730", "title": "Assessment of Smart Transformation in the Manufacturing Process of Aerospace Components Through a Data-Driven Approach"}, {"paperId": "26b87e8849ef5e0dba5b1e337d0f6fbdb9f240e4", "title": "GMDH-Kalman Filter prediction of high-cycle fatigue life of drilled industrial composites: A hybrid machine learning with limited data"}, {"paperId": "b11a58401bf22cc4c4b95d8cbc3f6d9e0b7063a1", "title": "A two-step machine learning approach for dynamic model selection: A case study on a micro milling process"}, {"paperId": "dc63ca70563ae0748a8dcca18df6106448176e9c", "title": "Machine learning for polymer composites process simulation– a review"}, {"paperId": "d2b04d59a9928b9ea8c44c955e937176769ef62b", "title": "Fiber Reinforced Composite Manufacturing With the Aid of Artificial Intelligence – A State-of-the-Art Review"}, {"paperId": "4feb07f7361eb8a45e7137d6fe630145e466c174", "title": "The Development of an Information Technology Architecture for Automated, Agile and Versatile Companies with Ecological and Ethical Guidelines"}, {"paperId": "8e905cb2195b6984e5a0c0e8f1afbbb441a9b174", "title": "Meso-Level Bending/Reverse-Bending Analysis of Dry Woven Fabrics: Observing an Irreversible Behavior during Forming"}, {"paperId": "6cb769818a0a7452652286221981f718d72918c5", "title": "Applications of Artificial Intelligence Techniques for trajectories optimization in robotics mobile platforms"}, {"paperId": "6fea526473e0d5e21369377431cf93c6478f6c76", "title": "Entreciencias: Diálogos en la Sociedad del Conocimiento"}, {"paperId": "f2b5d0537d2437e372b791ca12187dfe1ba956bb", "title": "A case study in smart manufacturing: predictive analysis of cure cycle results for a composite component"}, {"paperId": "011d3f710c8d27fb8b1fcd9c2acb800539e98afb", "title": "Smart manufacturing applications for inspection and quality assurance processes"}]}
