{"paperId": "3f4fd58d5478b3ffbe47e37c9796d7ac7318329c", "publicationVenue": {"id": "c0291a9f-e445-43cb-9dda-c07b71930c03", "name": "The International Journal of Management Science and Business Administration", "type": "journal", "alternate_names": ["Int J Manag Sci Bus Adm", "International Journal of Management Science and Business Administration"], "issn": "1849-5664", "url": "https://researchleap.com/category/international-journal-of-management-science-and-business-administration/"}, "title": "Visual Business Analytics: Using the Example of a Call Center", "abstract": "In this article we will examine an approach to the analysis of semi-structured log data using the example of a call center as a subsection of a central corporate service center. In such data all events of a caller passing through the routing are stored. Consequently, it is possible to trace more precisely what the customer experiences during his call. However, this information is only available in semi-structured form. A little-known approach in Anglo-Saxon literature, the Visual Business Analytics (VBA), represents a holistic concept for achieving added value from semi-structured data. In the VBA, data is initially transformed and structured and then prepared for analysis purposes. The goal is to derive recommendations for supporting management decisions in a call center. In the further course, the development of the approaches of information representation is examined first, then the VBA is presented and applied to the log protocols in a call center. Finally, other call center applications of VBA are considered, and an outlook is given on other industries in which the use of VBA offers advantages.", "venue": "The International Journal of Management Science and Business Administration", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-01", "journal": {"name": "THE INTERNATIONAL JOURNAL OF MANAGEMENT SCIENCE AND BUSINESS ADMINISTRATION"}, "authors": [{"authorId": "2166878745", "name": "Pascal-Philipp Nollenburg"}, {"authorId": "2166263220", "name": "Arthur Dill"}], "citations": [{"paperId": "fed583024e89cbf85bb03c132620a6cc95330601", "title": "Code-Switched Urdu ASR for Noisy Telephonic Environment using Data Centric Approach with Hybrid HMM and CNN-TDNN"}]}
