{"paperId": "3f5b3242929a71b9b6a6937e9a8cd34a2452a2cf", "publicationVenue": {"id": "a339909f-0b8a-42e7-96b5-abf92c7ad1a8", "name": "The social science", "type": "journal", "alternate_names": ["SOC SCI", "Social Science", "soc sci", "Soc Sci", "Social Sciences", "SOCIAL SCIENCES", "The Social Sciences", "Social Scientist"], "issn": "0419-6759", "alternate_issns": ["2332-0400", "0970-0293", "0037-7848", "2326-9863", "2734-9357", "0134-5486", "2076-0760", "1818-5800"], "url": "http://www.ciaonet.org/frame/oljourfrm.html", "alternate_urls": ["http://www.socialsciencesjournal.org/index", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283138", "http://www.sciencepublishinggroup.com/journal/archive.aspx?issueid=-1&journalid=202", "https://journalofscience.ou.edu.vn/index.php/soci-en", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283138", "http://www.medwelljournals.com/new/5/c4p.php?id=5&jid=TSS&theme=5", "https://dsal.uchicago.edu/books/socialscientist/", "https://www.mdpi.com/journal/socsci", "http://www.jstor.org/journals/09700293.html", "http://www.jstor.org/action/showPublication?journalCode=sociscience", "https://www.jstor.org/journal/socialscientist", "https://www.jstor.org/journal/sociscience", "https://www.jstor.org/journals/09700293.html"]}, "title": "Big Data in Education: Perception of Training Advisors on Its Use in the Educational System", "abstract": "Big Data has revolutionized decision making in many fields, including education. The incorporation of information and communication technologies into education enables us to gather information about the teaching and learning process. As Big Data can help us improve it, it is paramount to integrate it into initial and continuous learning stages. This study therefore aims at finding out the perception of the training advisors of teacher training centers (N = 117) in Andalusia on the application of Big Data in education. The tool is an adaptation of the VABIDAE (Assessment of Big Data Applied to Education) scale, and the study of the descriptive statistics was carried out by using the analysis of variance (ANOVA) and Mann–Whitney U tests in order to check the existence of significant differences and correlations between the items that make up the scale. The results reflect the positive perception of training advisors on the use of Big Data in education. Significant differences were found in the competence level variable, whereby this tool was better rated by those advisors who feel that they have an advanced competence level. In conclusion, Big Data is valued for its ability to personalize educational processes and the consequent improvement in academic results, which shows the need to increase the level of knowledge about this tool.", "venue": "The social science", "year": 2020, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2020-04-15", "journal": {"name": "Social Sciences"}, "authors": [{"authorId": "2096296729", "name": "Julio Ruiz-Palmero"}, {"authorId": "1651794186", "name": "Ernesto Colomo-Magaña"}, {"authorId": "1712212558", "name": "José Manuel Ríos-Ariza"}, {"authorId": "1412557115", "name": "Melchor Gómez-García"}], "citations": [{"paperId": "29ad3b5267164de23097ee9bb85748b600c062f4", "title": "Evolution and Emerging Trends in Musical Information Retrieval: A Comprehensive Review and Future Prospects"}, {"paperId": "113303dc1b3392828e560bf8f461c7abce8f95d9", "title": "Impact of Big Data on the Development of University Education by Computer Software Analysis"}, {"paperId": "2ee88649012d6458bcb601e9153d29b41fd949c7", "title": "Exploring the Landscape of Data Analysis: A Review of Its Application and Impact in Ecuador"}, {"paperId": "e09449eb024f797b5b8150f941409b8fd330c574", "title": "REVIEW: BIG DATA V’S MODELS, CHALLENGES, HADOOP ECOSYSTEM, ISSUES, USES, BENEFITS AND APPLICATIONS"}, {"paperId": "a6874558cccae6410f03db48b0ed4ad81c8c5469", "title": "Design and Management of Micro-Teaching Mode of Education in Colleges Driven by Big Data"}, {"paperId": "72da36488cbba54d00d8320a0ef513a4bbba8ccc", "title": "Cognitive Web Service-Based Learning Analytics in Education Systems Using Big Data Analytics"}, {"paperId": "00525124ec70e71823d16774a38a8e30a2f70410", "title": "Method of Assessing the Logistics Process as Regards Information Flow Unreliability on the Example of a Container Terminal"}, {"paperId": "af133cec689566543c78ebc15a0dd82f734d03c5", "title": "Explore Big Data Analytics Applications and Opportunities: A Review"}, {"paperId": "84e49d646d8d32ab92a396cfa5ac1b5ae9f9a7ca", "title": "The Potential of Big Data Application in Mathematics Education in Malaysia"}, {"paperId": "efcfe285939a1305e974d2f1dbc503919a20654d", "title": "Estrategias de vinculación social que proponen las universidades del Ecuador en el entorno de COVID-19"}, {"paperId": "9ad5ff6326da5a4b1066a7029edcf9a3cd059dfd", "title": "Preliminary Study of the Integration of Big Data to Answer the Challenges of Islamic Education in the Technological Age"}, {"paperId": "80743a9fbea0767761d59fae1d209b7fc7ef3f28", "title": "The Promises and Challenges of Artificial Intelligence for Teachers: a Systematic Review of Research"}, {"paperId": "be7da34a4f5608eb169e49e142724aceff420335", "title": "What Does It Take to Adopt Big Data Management Approach at Malaysian Higher Education Institutions?"}, {"paperId": "b3f3d47e91103f0c1df21ca600f8aac093bc86e8", "title": "Automated text detection from big data scene videos in higher education: a practical approach for MOOCs case study"}, {"paperId": "48d168afe8fdf9a56cd5c30ecd9b6b12a4350234", "title": "Co-word analysis and academic performance from the Australasian Journal of Educational Technology in Web of Science"}, {"paperId": "239c74d048ea481854b0fb54380f5844c9fc38c3", "title": "Using Big and Open Data to Generate Content for an Educational Game to Increase Student Performance and Interest"}, {"paperId": "24ea8ee775de3be1775daa9f459e4b727d48c9ce", "title": "Tendency to Use Big Data in Education Based on Its Opportunities According to Andalusian Education Students"}, {"paperId": "350cad86978500bcb8c0c50c6c6c4ad096214791", "title": "An Adaptive Machine Learning Methodology Applied to Neuromarketing Analysis: Prediction of Consumer Behaviour Regarding the Key Elements of the Packaging Design of an Educational Toy"}, {"paperId": "47d021da0517ddc487fe59a61a317c5d75490d26", "title": "Application Research on Big Data of Military Training in Military Academy Teaching"}, {"paperId": "d057b667bec3c48fec86fc889b6179217591493a", "title": "Validity of the “Big Data Tendency in Education” Scale as a Tool Helping to Reach Inclusive Social Development"}, {"paperId": "566ad32b293cb4bd7fa8f1fb9f650f1d4449f82e", "title": "Role of Big Data in Education"}, {"paperId": "bc043210079c65abd56b496e61f2fef5eebf54a6", "title": "Determinants of Big Data Adoption for Higher Education Institutions in Malaysia"}]}
