{"paperId": "3f76d9692923ce35a2fea37193bbea8549f9b537", "publicationVenue": {"id": "a9382755-e9fb-4e39-b66f-6456c9c5f8b3", "name": "BIO Web of Conferences", "alternate_names": ["BIO Web Conf"], "issn": "2117-4458", "url": "https://www.bio-conferences.org/", "alternate_urls": ["https://www.bio-conferences.org/component/issues/"]}, "title": "Real-Time Traffic Management in Smart Cities: Insights from the Traffic Management Simulation and Impact Analysis", "abstract": "Using simulation and empirical data analysis, this research examines the efficacy of real-time traffic control in smart cities. Traffic data collected in real time from strategically placed sensors shows that traffic volume was reduced by 8.33% on Main Street after a traffic light timing change was implemented. Traffic volume at Highway Junction was also significantly reduced by 5.56% as a result of traffic sign updates. On the other hand, interventions result in a relatively small decrease in traffic volume (2.78%) in the City Center. The influence of these actions is shown by the traffic simulation models, which show average vehicle speeds rising from 25 to 28 mph on Main Street, 45 to 50 mph at Highway Junction, and 30 to 32 mph in the Residential Area. The aforementioned research highlights the crucial function of data-driven decision-making in traffic management, guaranteeing effective distribution of resources and quantifiable enhancements in urban mobility. Urban planners and legislators may use these discoveries to build smart cities that are more accessible, sustainable, and efficient.", "venue": "BIO Web of Conferences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "BIO Web of Conferences"}, "authors": [{"authorId": "2280219719", "name": "Ekaterina Dmitrieva"}, {"authorId": "2210111562", "name": "Ashish Pathani"}, {"authorId": "2280225487", "name": "Gaurav Pushkarna"}, {"authorId": "2256808727", "name": "Puja Acharya"}, {"authorId": "38915986", "name": "Manju Rana"}, {"authorId": "2280222847", "name": "P. Surekha"}], "citations": []}
