{"paperId": "3f787068b1edd4a16608b440ac96bb7be7669a26", "publicationVenue": {"id": "f51b8132-f142-4bab-913a-705ac6f05107", "name": "Technologies", "type": "journal", "alternate_names": ["Technol (basel", "Technologies (Basel)"], "issn": "2227-7080", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318028", "alternate_urls": ["https://www.mdpi.com/journal/technologies", "https://pub.uni-bielefeld.de/publication/2932656", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318028"]}, "title": "A Review of 4IR/5IR Enabling Technologies and Their Linkage to Manufacturing Supply Chain", "abstract": "Over the last decade, manufacturing processes have undergone significant change. Most factory activities have been transformed through a set of features built into a smart manufacturing framework. The tools brought to bear by the fourth industrial revolution are critical enablers of such change and progress. This review article describes the series of industrial revolutions and explores traditional manufacturing before presenting various enabling technologies. Insights are offered regarding traditional manufacturing lines where some enabling technologies have been included. The manufacturing supply chain is envisaged as enhancing the enabling technologies of Industry 4.0 through their integration. A systematic literature review is undertaken to evaluate each enabling technology and the manufacturing supply chain and to provide some theoretical synthesis. Similarly, obstacles are listed that must be overcome before a complete shift to smart manufacturing is possible. A brief discussion maps out how the fourth industrial revolution has led to novel manufacturing technologies. Likewise, a review of the fifth industrial revolution is given, and the justification for this development is presented.", "venue": "Technologies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-21", "journal": {"name": "Technologies"}, "authors": [{"authorId": "31072449", "name": "M. Fanoro"}, {"authorId": "49456639", "name": "M. Božanić"}, {"authorId": "2114125278", "name": "Saurabh Sinha"}], "citations": [{"paperId": "31107fb74c4b4f182d761e3d775ca3ff16d233d5", "title": "Factors influencing the adoption of industrial internet of things for the manufacturing and production small and medium enterprises in developing countries"}, {"paperId": "8b7441fad608a9fcd46aeba1cceb6e36b164d5c8", "title": "Adoption Behaviour of Digital Technologies by Firms: Evidence from South Africa’s Manufacturing Sector"}, {"paperId": "6d974fcc8e10dc6f256cd41d7ba38ad5a0ad7213", "title": "Reimagining South African political campaigns through indigenous language posters in the 4IR: A political communication perspective"}, {"paperId": "9f07bcaa8a34c539f2bb1b60d424df5ad8ee1484", "title": "Embedding Sustainable Mathematics Higher Education in the Fourth Industrial Revolution Era Post-COVID-19: Exploring Technology-Based Teaching Methods"}, {"paperId": "6ccb643717e6a45c222679bcd9f3ab3bd9ee582b", "title": "Analysing the Connection Between AI and Industry 4.0 from a Cybersecurity Perspective: Defending the Smart Revolution"}, {"paperId": "50db9e6724affb8892f0e5328f7ccf3955bffa47", "title": "Problematizing the Adoption of Formal Methods in the 4IR–5IR Transition"}, {"paperId": "08353cd3dc306d2207e3ee37a55b0d74dde5a90e", "title": "Impact of 4ir technology and its impact on the current deployment"}, {"paperId": "d7e9f1a10d27fc86949c4c80c896b0f61bc1f463", "title": "A Review of the Impact of Battery Degradation on Energy Management Systems with a Special Emphasis on Electric Vehicles"}]}
