{"paperId": "3f7b051fb936f8098b17c19e6e492b0ede23536b", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "DIGITAL TOOLS FOR THE KNOWLEDGE AND ENHANCEMENT OF WWII HERITAGE. THE CASE STUDY OF BOSA IN THE WEST COAST OF SARDINIA (ITALY)", "abstract": "Abstract. The essay shows some results of a research aimed at building a digital database of Sardinian military architectures of Second World War. Following an activity of cataloguing entrusted to integrated digital survey methods already applied in other case studies of the region, this contribute analyses the built heritage placed in territory of Bosa, a centre located in the west coast of the island, in which 33 bunkers have been founded, most of them represented in the IGM military historical maps.These “modern sentinels”, positioned along the coastline, the main roads and the railway leading to the actual urban context, are designed in reinforced concrete, also integrated with local stone, with a frequently use of square and circle shape often combined or modified and adapted to achieve a complete mimesis in the landscape that hosts them.The survey, applied at architecture and landscape scale, has produced a complete collection of data functional to realize an interoperable digital database, a necessary tool for a deepened knowledge and enhancement of a lost WWII heritage.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "2060199114", "name": "A. Pirinu"}, {"authorId": "122290835", "name": "R. Argiolas"}, {"authorId": "2021238334", "name": "N. Paba"}], "citations": []}
