{"paperId": "3f809c937091fcec8ae8b159a4ae6d578ba0ca70", "publicationVenue": null, "title": "Analysis on Convolutional Neural Network Model using Skin Disease Dataset", "abstract": "Skin conditions are most frequently seen in persons of all ages and are brought on by bacteria, infections, or radiation. Some illnesses spread over time and have several harmful skin effects. Extreme weather, pollution, and depletion of the ozone layer are a few effects of climate change that could damage the skin condition. Skin diseases can be cured in over 90% of cases if they are discovered and treated in the early stages. The convolutional neural network approach is an effective method for identifying skin disorders that may lead to better outcomes for both treatment and diagnosis. In this study, the author uses the convolutional neural network (CNN) technique because of its great precision in extracting characteristics from pictures and their ability to recognize patterns, CNNs are used for picture analysis and identification and provide a review of deep learning algorithm and how they can be used to diagnose skin conditions. simple description of skin-conditions, image acquisition and a literature review on deep learning techniques in dermatology presented by different authors. When compared to VGG16, Resnetv2 and the CNN model, the CNN model is better because its computation effectiveness, capacity to identify spatial layouts, flexibility, and interpretation. The visual signs of several skin conditions can appear identical, making it difficult for CNN models to differentiate among diseases. CNN-based models may not apply adequately to different datasets after being trained on one dataset. The results show that the suggested technique has a higher level of diagnostic precision. It improves the effectiveness of an CNN model that has been pre-trained for detecting certain types of skin illnesses by using transfer learning along with it.", "venue": "2023 International Conference on Sustainable Computing and Smart Systems (ICSCSS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-06-14", "journal": {"name": "2023 International Conference on Sustainable Computing and Smart Systems (ICSCSS)", "pages": "529-536"}, "authors": [{"authorId": "2221249460", "name": "Maragani Datta Pavan"}, {"authorId": "2221251258", "name": "Cherukuri Bhavath Ram"}, {"authorId": "2221252514", "name": "Dinesh Chowdary Vemulapalli"}, {"authorId": "2221251245", "name": "Sri Teja Cheemakurthy"}, {"authorId": "2067138373", "name": "M. Kavitha"}, {"authorId": "2127999858", "name": "Vijaya Chandra Jadala"}], "citations": [{"paperId": "18acac1b9de2036471792f5b4328ed4cb98d7314", "title": "Leveraging deep neural networks to uncover unprecedented levels of precision in the diagnosis of hair and scalp disorders"}]}
