{"paperId": "3f84a24cac1d568e3eecb6912466b466f285e3e0", "publicationVenue": {"id": "f51ff783-cdff-4e22-94fb-28e6336d17b3", "name": "International Conference on Computational Linguistics", "type": "conference", "alternate_names": ["Int Conf Comput Linguistics", "COLING"], "url": "https://www.aclweb.org/anthology/venues/coling/"}, "title": "Curating a Large-Scale Motivational Interviewing Dataset Using Peer Support Forums", "abstract": "A significant limitation in developing therapeutic chatbots to support people going through psychological distress is the lack of high-quality, large-scale datasets capturing conversations between clients and trained counselors. As a remedy, researchers have focused their attention on scraping conversational data from peer support platforms such as Reddit. But the extent to which the responses from peers align with responses from trained counselors is understudied. We address this gap by analyzing the differences between responses from counselors and peers by getting trained counselors to annotate ≈17K such responses using Motivational Interviewing Treatment Integrity (MITI) code, a well-established behavioral coding system that differentiates between favorable and unfavorable responses. We developed an annotation pipeline with several stages of quality control. Due to its design, this method was able to achieve 97% of coverage, meaning that out of the 17.3K responses we successfully labeled 16.8K with a moderate agreement. We use this data to conclude the extent to which conversational data from peer support platforms align with real therapeutic conversations and discuss in what ways they can be exploited to train therapeutic chatbots.", "venue": "International Conference on Computational Linguistics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "3315-3330"}, "authors": [{"authorId": "16939988", "name": "A. Welivita"}, {"authorId": "1781996", "name": "P. Pu"}], "citations": [{"paperId": "ba939583290f513309f34cf6647316ee7a1b9b2b", "title": "Algorithms for Empathy: Using Machine Learning to Categorize Common Empathetic Traits Across Professional and Peer-Based Conversations"}, {"paperId": "78f43c0000d55e4ed45afe2d3d14e02ce623123b", "title": "Few-shot Dialogue Strategy Learning for Motivational Interviewing via Inductive Reasoning"}, {"paperId": "2a3d3eeda974703f1727ff724f1078bd5e6b2e1f", "title": "TherapyBot: a chatbot for mental well-being using transformers"}, {"paperId": "0fe0c070df0bfbbc30ce444a5251ece063091271", "title": "Mitigating Unhelpfulness in Emotional Support Conversations with Multifaceted AI Feedback"}, {"paperId": "6f542f60a5d4f540d056bb49d47f89f1035ad0cf", "title": "A review of the explainability and safety of conversational agents for mental health to identify avenues for improvement"}, {"paperId": "4118c8bca76b4bfafc379d80bf91455df88614b6", "title": "Aligning Language Models with Human Preferences via a Bayesian Approach"}, {"paperId": "5e522686891c980b2fc6f9c3ad4408f402dfb5b4", "title": "Therapist Self-Disclosure as a Natural Language Processing Task"}]}
