{"paperId": "3f863fa7b87595c98b07ce48056e87eea197b3b6", "publicationVenue": {"id": "03cece31-c46a-4f05-916e-2d6d458dee27", "name": "Local Economy", "type": "journal", "alternate_names": ["Local Econ"], "issn": "0269-0942", "url": "https://journals.sagepub.com/home/lec", "alternate_urls": ["http://lec.sagepub.com/"]}, "title": "Unequal futures of rural mobility: Challenges for a “Smart Countryside”", "abstract": "Current transport strategy in the UK is strongly urban-focused, with assumptions that technological advances in mobility will simply trickle down into rural areas. This article challenges such a view and instead draws on rural development thinking aligned to a “Smart Countryside” which emphasises the need for place-based approaches. Survey and interview methods are employed to develop a framework of rural needs associated with older people, younger people and businesses. This framework is employed to assess a range of mobility innovations that could most effectively address these needs in different rural contexts. In presenting visions of future rural mobility, the article also identifies key infrastructure as well as institutional and financial changes that are required to facilitate the roll-out of new technologies across rural areas.", "venue": "Local Economy", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-01", "journal": {"name": "Local Economy: The Journal of the Local Economy Policy Unit", "pages": "586 - 608", "volume": "35"}, "authors": [{"authorId": "72231638", "name": "G. Bosworth"}, {"authorId": "33864863", "name": "Liz Price"}, {"authorId": "67141476", "name": "M. Collison"}, {"authorId": "2053944696", "name": "Charles Fox"}], "citations": [{"paperId": "00ea3324c95ac557859acddcbfbcb553b5078ad4", "title": "A Voluntary Divide? Exploring the Role of Digitalisation in German Rural Volunteering"}, {"paperId": "75d03e1b0f34f6deaa76a9cfc802d3c6395d45ce", "title": "Everyday technology's interplay in the lives of people with dementia: A multiple case study in the rural North of England"}, {"paperId": "10da66ff029cafb0191ef94768bdfc9a47a70577", "title": "E-bike use and ownership in the Lake District National-Park UK"}, {"paperId": "508cfc749d472bedd33185cf0b16c12f7ab904f9", "title": "Can Edu-Metaverse Reshape Virtual Teaching Community (VTC) to Promote Educational Equity? An Exploratory Study"}, {"paperId": "31de117993d3699e2a9937a4b57d8b3894d7f985", "title": "The Implications of a Co-Created Software Solution for Mobility in Rural Areas"}, {"paperId": "10c1f13ab379a5c54e29896baab18c039cb8475e", "title": "Development of Business Activities in Peripheral Parts of Rural Areas, Western Bohemia"}, {"paperId": "a6ad7bf96c616bf46ca100267ce7c324db60cbd9", "title": "Can the transition to sustainable mobility be fair in rural areas? A stakeholder approach to mobility justice"}, {"paperId": "83c59a3508eb0c9a04647efd00b3916ce88d2096", "title": "Alleviation of energy poverty through transitions to low-carbon energy infrastructure"}, {"paperId": "48d72fc15507fdd73c8b3b0eeedeb465ebadde48", "title": "Examining the transport to school patterns of New Zealand adolescents by home-to-school distance and settlement types"}, {"paperId": "e1c74fb8be5c824a1dcd2d1791a9cd09a4a8fb73", "title": "Sustainable Environmental Development from the Regional Perspective—The Interesting Case of Poland"}, {"paperId": "202628b54f3b49df16c7554f30f1768d61f71f86", "title": "Estimating Mode of Transport in Daily Mobility during the COVID-19 Pandemic Using a Multinomial Logistic Regression Model"}, {"paperId": "9a971ba3a473a8093b4fde2100381b01b729dae0", "title": "How can Quality of Life be Achieved in a Sustainable Way? Perceptions of Swiss Rural Inhabitants"}, {"paperId": "66f009400a278e8d4604439ec033f0adf3d18443", "title": "Barriers to the Implementation of Smart Projects in Rural Areas, Small Towns, and the City in Brno Metropolitan Area"}, {"paperId": "19bf5b542f3e3b4098b8c9248accd415d761ef3e", "title": "Oczekiwania turystów w zakresie innowacji poprawiających mobilność na terenie Puszczy Białowieskiej"}, {"paperId": "a8524f37818f222890f5e5e1a687c3ec2340b5b2", "title": "Smart regional spaces: ready set go!"}, {"paperId": "be7e55f15be175953885fe24f020a3f3e571d2ca", "title": "A Rural Transport Implementation Index for Connected, Autonomous and Electric Vehicles"}, {"paperId": "17684761d2a745caa760c97e5f6fe00a62ef2806", "title": "Improving quality of life for residents of biosphere reserves and nature parks: management recommendations from Switzerland"}, {"paperId": "c2bce7ef4b93029ac001ce17e2f8be2a22bbde04", "title": "Framework for connecting the mobility challenges in low density areas to smart mobility solutions: the case study of Estonian municipalities"}, {"paperId": "1ce74249fc40c61e68ed8df11fae1fad38914d23", "title": "Investment in digital infrastructure: Why and for whom?"}, {"paperId": "a7e0b8241e9475f8d9a55fa2998ac30f7dc6ab9e", "title": "Sustainable Innovative Mobility Solutions Preferred by Inhabitants of Rural Areas—The Case of Lithuania and Poland"}, {"paperId": "a5844afe6215592584f0e9501cf0898e1da8712f", "title": "Mehr als smarte Technik: ein konzeptioneller Rahmen zu „Smart Countryside“"}, {"paperId": "a3ea479c8a6c9c845d1c3dd69f05fca4edf63b05", "title": "Using cloud-based virtual learning environments to mitigate increasing disparity in urban-rural academic competence"}, {"paperId": "4356cfa1401700eca0484af1c8337773b9e8b149", "title": "Planning Perspectives on Rural Connected, Autonomous and Electric Vehicle Implementation"}, {"paperId": "6e56038337077501dd7773b804630472a5f19fbf", "title": "Hubs, hopes and high stakes for a relatively disadvantaged low tech place"}, {"paperId": "a6606d6f4e0b2e3a6fdf706da8b9c08910cbd5b3", "title": "Rural arts entrepreneurs’ placemaking – how ‘entrepreneurial placemaking’ explains rural creative hub evolution during COVID-19 lockdown"}, {"paperId": "f0fa6a5e11882a5028b1434d29d1ee7d68a21603", "title": "All hubs and no spokes? Exploring the potential of hubs to sustain rural and regional development"}, {"paperId": "66fa98949bd959f8073a599b01676aa93a798227", "title": "Peripherality and university collaboration: Evidence from rural SMEs in the UK"}, {"paperId": "fb731e1536f968aeb06056fd93c09c67e84d0eaa", "title": "Territorial and Human Geography Challenges: How Can Smart Villages Support Rural Development and Population Inclusion?"}, {"paperId": "8ba176ed1948d505030c2977ff51187992dec8be", "title": "Globalisation and local economic development: Place-based and bottom-up public policies in Switzerland and Mexico"}, {"paperId": "2c27fe31209c975ec339bbed57dcc66153b6e1d9", "title": "Using the smartphone in carpooling for new mobility services"}, {"paperId": "f1b17b938d55dd68efc268108bf52c3e3de93f2f", "title": "Sustainable Mobility and the Institutional Lock-In: The Example of Rural France"}, {"paperId": "acbfe31d6e74b2d0543378f5376cdac009345680", "title": "Research Report Mapping and examining the determinants of England’s rural creative microclusters"}, {"paperId": "d8fd14ebb1b1ddd1a8d57a74882ec205ec873bf0", "title": "Bus Demand Forecasting for Rural Areas Using XGBoost and Random Forest Algorithm"}]}
