{"paperId": "3f9532875b7f9c34d6d66485ddde6aadd5954512", "publicationVenue": {"id": "a2c55fa1-915a-42f2-8431-8c1e163ecb0c", "name": "Review of Economic and Business Studies", "type": "journal", "alternate_names": ["Rev Econ Bus Stud"], "issn": "1843-763X", "url": "https://content.sciendo.com/view/journals/rebs/rebs-overview.xml", "alternate_urls": ["http://www.rebs.ro/archive.html"]}, "title": "Big Data Proprietary Platforms. The Case of Oracle Exadata", "abstract": "Abstract The most prominent Big Data solutions – such as NoSQL systems, Hadoop Frameworks, Spark, etc. – have been open-sourced. Nevertheless, commercial providers have targeted niches of this huge market with products more or less viable and affordable. This paper addresses the problem of benchmarking Big Data platforms with a focus on Oracle Exadata solution provided by one the most important data technologies vendor. Many classical benchmark approaches, such as TPC-H, are based on a predefined set of queries, and consequently they are not prone to predictive modeling. By contrast, for the TPC-H benchmark schema, we generate a set of 500 random queries containing not only tuple filters (WHERE), but also tuple grouping (GROUP BY) and group filters (HAVING), we collected results of the queries execution on four Oracle Exadata settings. Query duration was the outcome variable. Various query parameters, such as the number of joins, the number of attributes of different types within SELECT and WHERE clauses, and also some environment metrics served as predictors. Results were interpreted using exploratory data analysis and also Multivariate Adaptive Regression Splines (MARS) for both predicting the performance and explaining the main drivers of the system performance.", "venue": "Review of Economic and Business Studies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-06-01", "journal": {"name": "Review of Economic and Business Studies", "pages": "45 - 78", "volume": "11"}, "authors": [{"authorId": "2024188", "name": "Marin Fotache"}, {"authorId": "117464635", "name": "Alexandru Tica"}, {"authorId": "72908598", "name": "Ionut Hrubaru"}, {"authorId": "150324502", "name": "Teodor Marius Spînu"}], "citations": [{"paperId": "f8568bc88df60b7cdcea7da1197463d7816e5710", "title": "Corpus-Based Japanese Reading Teaching Database Cloud Service Model"}, {"paperId": "312354c70fbd87b95e67cd654ebaa7c32c228a52", "title": "Low Cost Big Data Solutions: The Case of Apache Spark on Beowulf Clusters"}]}
