{"paperId": "3f9ee8c3ecdeb75baddcd45035c2dc804230638a", "publicationVenue": null, "title": "Impact of Data Compression on the Performance of Column-oriented Data Stores", "abstract": "Compression of data in traditional relational database management systems significantly improves the system performance by decreasing the size of the data that results in less data transfer time within the communication environment and higher efficiency in I/O operations. The column-oriented database management systems should perform even better since each attribute is stored in a separate column, so that its sequential values are stored and accessed sequentially on the disk. That further increases the compression efficiency as the entire column is compressed/decompressed at once. The aim of this research is to determine if data compression could improve the performance of HBase, running on a small-sized Hadoop cluster, consisted of one name node and nine data nodes. Test scenario includes performing Insert and Select queries on multiple records with and without data compression. Four data compression algorithms are tested since they are natively supported by HBase SNAPPY, LZO, LZ4 and GZ. Results show that data compression in HBase highly improves system performance in terms of storage saving. It shrinks data 5 to 10 times (depending on the algorithm) without any noticeable additional CPU load. That allows smaller but significantly faster SSD disks to be used as cluster’s primary data storage. Furthermore, the substantial decrease in the network traffic is an additional benefit with major impact on big data processing. Keywords—Column-oriented data stores; data compression; distributed non-relational databases; benchmarking columnoriented databases", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "103635380", "name": "Tsvetelina Mladenova"}, {"authorId": "2925614", "name": "Yordan Kalmukov"}, {"authorId": "39839198", "name": "M. Marinov"}, {"authorId": "2115004618", "name": "Irena Valova"}], "citations": [{"paperId": "50c7fe0bde7c1a3311e744136c56620e87405909", "title": "Requirements and Trade-Offs of Compression Techniques in Key–Value Stores: A Survey"}]}
