{"paperId": "3f9e3488c5a05bb4783cb03a90e695c5338919b1", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Deep-Learning-Facilitated, Detection-First Strategy for Operationally Monitoring Localized Deformation with Large-Scale InSAR", "abstract": "SAR interferometry (InSAR) has emerged in the big-data era, particularly benefitting from the acquisition capability and open-data policy of ESA’s Sentinel-1 SAR mission. A large number of Sentinel-1 SAR images have been acquired and archived, allowing for the generation of thousands of interferograms, covering millions of square kilometers. In such a large-scale interferometry scenario, many applications actually aim at monitoring localized deformation sparsely distributed in the interferogram. Thus, it is not effective to apply the time-series InSAR analysis to the whole image and identify the deformed targets from the derived velocity map. Here, we present a strategy facilitated by the deep learning networks to firstly detect the localized deformation and then carry out the time-series analysis on small interferogram patches with deformation signals. Specifically, we report following-up studies of our proposed deep learning networks for masking decorrelation areas, detecting local deformation, and unwrapping high-gradient phases. In the applications of mining-induced subsidence monitoring and slow-moving landslide detection, the presented strategy not only reduces the computation time, but also avoids the influence of large-scale tropospheric delays and unwrapping errors. The presented detection-first strategy introduces deep learning to the time-series InSAR processing chain and makes the mission of operationally monitoring localized deformation feasible and efficient for the large-scale InSAR.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-27", "journal": {"name": "Remote. Sens.", "pages": "2310", "volume": "15"}, "authors": [{"authorId": "2958230", "name": "Tengchuan Wang"}, {"authorId": "2145908179", "name": "Qi Zhang"}, {"authorId": "2146255152", "name": "Zhipeng Wu"}], "citations": []}
