{"paperId": "3fa20c9bcfb6b8569de0708107043475a9c9ed71", "publicationVenue": null, "title": "Transforming Smart Cities with Spatial Computing", "abstract": "Spatial methods have a rich history of reforming city infrastructure. For example, John Snow’s 1854 London Cholera map spurred cities to protect drinking water via sewer systems and to increase green spaces for public health. Today, geospatial data and mapping are among the technologies that cities use the most due to strategic (e.g., long-term planning, land-use), tactical (e.g., property tax, site selection, asset tracking) and operational (e.g., E-911, situation awareness, gunshot location) use cases. Moreover, they (e.g., Google Maps) help citizens navigate, drones stay clear of restricted spaces (e.g., airports, NFL games), and sharing-economy (e.g., Uber) match consumers with nearby providers. Future spatial computing opportunities for smart cities are even more compelling. GIS promises to help re-imagine, redesign, see, and compare alternative infrastructure futures to address risks (e.g., climate change, rising inequality, population growth) and opportunities (e.g., autonomous vehicles, distributed energy production). This paper surveys recent spatial computing accomplishments and identifies research needs for smart-city use-cases.", "venue": "2018 IEEE International Smart Cities Conference (ISC2)", "year": 2018, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Smart Cities Conference (ISC2)", "pages": "1-9"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "152697699", "name": "Jayant Gupta"}, {"authorId": "2152884622", "name": "Yan Li"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "cb815aa4223628f078df7639fd93d2e9ff3abcbd", "title": "Exploiting geospatial data of connectivity and urban infrastructure for efficient positioning of emergency detection units in smart cities"}, {"paperId": "258c6f3ab29f11ac3501e035553728e415e5be1c", "title": "Geopositional Data Analysis Using Clustering Techniques to Assist Occupants in a Specific City"}, {"paperId": "2f99f6523a1f4e57555303118372d6a3accbe683", "title": "Towards Responsible Spatial Data Science and Geo-AI"}, {"paperId": "797601c1b73acc8d98046281383bb63f80fbb42d", "title": "Improving the Efficiency of the EMS-Based Smart City: A Novel Distributed Framework for Spatial Data"}, {"paperId": "781c4f49fc5c9200f5468cd8c4f8b689252cc058", "title": "Innovative Way of Solution of “Smart City” in Azerbaijan – City Problems"}, {"paperId": "f08d4db1fad736e301fe50bfa039856b29bacf7a", "title": "A digital twin uses classification system for urban planning & city infrastructure management"}, {"paperId": "4b169a78b9fa9d335d139d233fd5d982508df416", "title": "GeoAI – Accelerating a Virtuous Cycle between AI and Geo"}, {"paperId": "7d0e36bb2f6adba4d8d7c00b6556064f8199aed8", "title": "Multiple Dimensions of Smart Cities’ Infrastructure: A Review"}, {"paperId": "a33d925710f1828474283ab18bc76644839599e1", "title": "Strategic framework of Unmanned Aerial Systems integration in the disaster management public organisations of the Dominican Republic"}, {"paperId": "83accdd43820a4d576c385826c8e81062f7147f5", "title": "Use of BIM in Development of Smart Cities: A Review"}, {"paperId": "e15775d7016a21545b0054257a28570481a1b6f8", "title": "Towards Spatial Variability Aware Deep Neural Networks (SVANN): A Summary of Results"}, {"paperId": "04b58585d0d5d707c3b3d9afd996a884ef387fde", "title": "Enabling technologies and sustainable smart cities"}, {"paperId": "65799b1b140fe454d9cc0db7f3a14d397aab338a", "title": "An Integrated Situational Awareness Platform for Disaster Planning and Emergency Response"}, {"paperId": "bdf2d7fd01d4c3bc2fdd83d83c30c988bfc7801b", "title": "A Unified Framework for Robust and Efficient Hotspot Detection in Smart Cities"}, {"paperId": "f5bc5186c5e59332467d0b9aa69d1f68609d629b", "title": "POINT CLOUD TRANSFORMATION USING SENSOR CALIBRATION INFORMATION FOR MAP DATA ADJUSTMENT"}, {"paperId": "668b6fbb8801839d492eb4ee56f7eca3c2a1156f", "title": "A Case Study: Phuket City Data Platform"}, {"paperId": "0d0e44916c2d41d8039d018816385ee17f03c33c", "title": "Algorithmic Urban IoT Context and Convergence of Services Sensing and Planning Units (PUs)"}, {"paperId": "238bb8ea451b9f9be8e0dc19cb0db4aa940561c3", "title": "Big Data Analytics: 7th International Conference, BDA 2019, Ahmedabad, India, December 17–20, 2019, Proceedings"}, {"paperId": "1c2234501000e4f37bccd98e584a67721b5867b3", "title": "Revolutionizing Tree Management via Intelligent Spatial Techniques"}, {"paperId": "388820016708d061424e7824fc7cd0a3865ae980", "title": "Potential Role of Street Lighting System for Safety Enhancement on the Roads in Future"}, {"paperId": "dfa114dd4d1d7519063f9a4fe21cd931f9ed9ed2", "title": "Smart city concept in the light of the literature review"}, {"paperId": "15167f62148a037ed6bdd2790eea6984d2234ed3", "title": "Strategic Framework for Unmanned Aerial Systems Integration in Public Organisations in the Dominican Republic disaster management context"}, {"paperId": "d4dc401ee549fd176b042edeb2daff27d21bff86", "title": "Analyzing Domain Knowledge for Big Data Analysis: A Case Study with Urban Tree Type Classification"}, {"paperId": "af30b3c8094b8c1f630540b5334000d8e00683b6", "title": "Spatial Data Science to Assist Underserved"}]}
