{"paperId": "3fa9f7aa5e8050b54e1aca41407c12922a6e4867", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Supervised Knowledge Makes Large Language Models Better In-context Learners", "abstract": "Large Language Models (LLMs) exhibit emerging in-context learning abilities through prompt engineering. The recent progress in large-scale generative models has further expanded their use in real-world language applications. However, the critical challenge of improving the generalizability and factuality of LLMs in natural language understanding and question answering remains under-explored. While previous in-context learning research has focused on enhancing models to adhere to users' specific instructions and quality expectations, and to avoid undesired outputs, little to no work has explored the use of task-Specific fine-tuned Language Models (SLMs) to improve LLMs' in-context learning during the inference stage. Our primary contribution is the establishment of a simple yet effective framework that enhances the reliability of LLMs as it: 1) generalizes out-of-distribution data, 2) elucidates how LLMs benefit from discriminative models, and 3) minimizes hallucinations in generative tasks. Using our proposed plug-in method, enhanced versions of Llama 2 and ChatGPT surpass their original versions regarding generalizability and factuality. We offer a comprehensive suite of resources, including 16 curated datasets, prompts, model checkpoints, and LLM outputs across 9 distinct tasks. Our empirical analysis sheds light on the advantages of incorporating discriminative models into LLMs and highlights the potential of our methodology in fostering more reliable LLMs.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-26", "journal": {"name": "ArXiv", "volume": "abs/2312.15918"}, "authors": [{"authorId": "2145500840", "name": "Linyi Yang"}, {"authorId": "2190935184", "name": "Shuibai Zhang"}, {"authorId": "2164113313", "name": "Zhuohao Yu"}, {"authorId": "1993226927", "name": "Guangsheng Bao"}, {"authorId": "2108024273", "name": "Yidong Wang"}, {"authorId": "2273553706", "name": "Jindong Wang"}, {"authorId": "2266367743", "name": "Ruochen Xu"}, {"authorId": "2147205193", "name": "Weirong Ye"}, {"authorId": "2249681654", "name": "Xing Xie"}, {"authorId": "2276449764", "name": "Weizhu Chen"}, {"authorId": "2250437942", "name": "Yue Zhang"}], "citations": [{"paperId": "b6d534c8e49f7a9b167ce35facba0b1a907e4a85", "title": "A Rationale-centric Counterfactual Data Augmentation Method for Cross-Document Event Coreference Resolution"}, {"paperId": "2cea424c7dce71042c24d43317521abdc4c0ffb4", "title": "Large Multimodal Agents: A Survey"}, {"paperId": "b02e8ce41cab6656af38dc0d65b61f56bbb91072", "title": "SymbolicAI: A framework for logic-based approaches combining generative models and solvers"}]}
