{"paperId": "3fb2284f4a0416561f425a3717919cb435195988", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Reversing Years for Global Food Security: A Review of the Food Security Situation in Sub-Saharan Africa (SSA)", "abstract": "All around the world, inequalities persist in the complex web of social, economic, and ecological factors that mediate food security outcomes at different human and institutional scales. There have been rapid and continuous improvements in agricultural productivity and better food security in many regions of the world during the past 50 years due to an expansion in crop area, irrigation, and supportive policy and institutional initiatives. However, in Sub-Saharan Africa, the situation is inverted. Statistics show that food insecurity has risen since 2015 in Sub-Saharan African countries, and the situation has worsened owing to the Ukraine conflict and the ongoing implications of the COVID-19 threat. This review looks into multidimensional challenges to achieving the SDG2 goal of “End hunger, achieve food security and improved nutrition, and promote sustainable agriculture” in Sub-Saharan Africa and the prosper policy recommendations for action. Findings indicate that weak economic growth, gender inequality, high inflation, low crop productivity, low investment in irrigated agriculture and research, climate change, high population growth, poor policy frameworks, weak infrastructural development, and corruption are the major hurdles in the sustaining food security in Sub-Saharan Africa. Promoting investments in agricultural infrastructure and extension services together with implementing policies targeted at enhancing the households’ purchasing power, especially those in rural regions, appear to be essential drivers for improving both food availability and food access.", "venue": "International Journal of Environmental Research and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "19"}, "authors": [{"authorId": "2079766218", "name": "A. Wudil"}, {"authorId": "1500606022", "name": "M. Usman"}, {"authorId": "1390185076", "name": "J. Rosak-Szyrocka"}, {"authorId": "90977793", "name": "L. Pilař"}, {"authorId": "2067397762", "name": "Mortala Boye"}], "citations": [{"paperId": "c4aefa459b99e725bf3b4b271e7cf690114b74c8", "title": "IoT-based agriculture management techniques for sustainable farming: A comprehensive review"}, {"paperId": "5062f4470fee63fe7a431f6bc80bb4cab36e1390", "title": "Disrupted harvests: how Ukraine – Russia war influences global food systems – a systematic review"}, {"paperId": "1653be24d993dfb29237596ef2a5b2e289d682d7", "title": "Lipid mediated plant immunity in susceptible and tolerant soybean cultivars in response to Phytophthora sojae colonization and infection"}, {"paperId": "f29461a9b2f48a927925019ed47c64ecefeadddc", "title": "Globalization and food security in Sub-Saharan Africa"}, {"paperId": "48d668bbf2eb818b8306212584a4299b9c07d3e3", "title": "Destructive Workplace Deviance in the Farming Sector, South Africa"}, {"paperId": "9fdc5a753cf3d53d7b6b90cef3bf3dab920b1e8f", "title": "Do food security indicators vary between male and female-headed households? Evidence from legume farmers in Western Kenya"}, {"paperId": "ec91a0616fee51b1e01e2c544b7c8f040df90fe4", "title": "Sorghum: a Star Crop to Combat Abiotic Stresses, Food Insecurity, and Hunger Under a Changing Climate: a Review"}, {"paperId": "94a7f9d856661cc91c224a0f973586d84a544202", "title": "Enhancing the bioconversion rate and end products of black soldier fly (BSF) treatment – A comprehensive review"}, {"paperId": "68dc81f095eb435e067616bf876ca378022bbd52", "title": "Beyond hunger: Unveiling the rights to food in sub‐Saharan Africa"}, {"paperId": "302983481238728e6ece4d01ed8a72cf3581cdda", "title": "Socioeconomic and regional patterns of child nutritional inequality between tribal and non-tribal communities in India: An analysis based on National Family Health Survey 5 (2019–21)"}, {"paperId": "093f2f340d0cd1015009cd53e6a3093d939d77bf", "title": "Constructive workplace deviance for rising Africa: A case of selected South African farmworkers"}, {"paperId": "51ba5ff847979d626614778bc2ff32d39000e51e", "title": "Solving Food Insecurity and Agricultural Challenges with Hydroponics"}, {"paperId": "54a947c7ed9886e57ea1bacdb30ebbb0f1b8376c", "title": "Examining the disparities: A cross-sectional study of socio-economic factors and food insecurity in Togo"}, {"paperId": "07522c8247f8b4dd36abbf88fda7ec668029653e", "title": "Impacts of improved agricultural technologies on food security and child nutrition in rural Ethiopia"}, {"paperId": "6a3c2444feab21ef67118175a189c79df023bce4", "title": "Multicriteria Suitability Index for Prioritizing Early-Stage Deployments of Wastewater-Derived Fertilizers in Sub-Saharan Africa."}, {"paperId": "db35f9daf6f27fea64dd1df93cd4a3e1ae7d16ee", "title": "A step towards food security: The effect of carbon emission and the moderating influence of human capital. Evidence from Anglophone countries"}, {"paperId": "1242b0c651aa7e0f8abacdc884ee34a326533813", "title": "A Review of Amaranth Crop as a Potential Solution to Ethiopia’s Nutritional Crisis"}, {"paperId": "487f599250f5063d285069fa14bfdd473d0d0dc6", "title": "Achieving carbon neutrality in West Africa: The impact of financial development and good governance"}, {"paperId": "be8fe17abbd0f7c8c9596c186df60091fb07b1fc", "title": "Financial Well-Being of Micro-Entrepreneurs: A Proposed Conceptual Framework"}, {"paperId": "3eac31defcc284a807901241a9bc6b4905c42f7f", "title": "Household food insecurity, family size and their interactions on depression prevalence among teenage pregnant girls in Ghana, a population based cluster survey"}, {"paperId": "6d90f78ba35264a2d4179c5b2367e6ba739a9ae1", "title": "Countries’ vulnerability to food supply disruptions caused by the Russia–Ukraine war from a trade dependency perspective"}, {"paperId": "ba7624767bd8456102f592673ef0661a4cd8d438", "title": "Understanding the connections between climate change, air pollution, and human health in Africa: Insights from a literature review"}, {"paperId": "57ccd4d8df8ebe478cd4ffe033d592e3f1afb703", "title": "How Worried Are You about Food Fraud? A Preliminary Multi-Country Study among Consumers in Selected Sub-Saharan African Countries"}, {"paperId": "9630a2e035adcab943d0b82224fc12d7b4144926", "title": "Response of Black Nightshade to Different Cropping Systems and the Effect on Physiological Parameters and Mineral Composition"}, {"paperId": "ff4898ea10e269f51f9056282dfb5c102390aeb6", "title": "A Review on the Performance of Passive and Active Direct Evaporative Cooling System for Preservation of Perishable Agriculture Produce"}, {"paperId": "c750d0d15c43a8b361470797116e12e1bc832a91", "title": "Nano-Biofertilizer Formulations for Agriculture: A Systematic Review on Recent Advances and Prospective Applications"}, {"paperId": "687661eb5b463e569c4dcba85d35637c6d91078f", "title": "A Review of the Critical Gaps in the Food Security Literature: Addressing Key Issues for Sustainable Development"}, {"paperId": "5a16818e083792e48a4711bc4ed2224e42a4733e", "title": "Characterizing rural households’ livelihood vulnerability to climate change and extremes in Migori River Watershed, Kenya"}, {"paperId": "8fc054cc33ee57bd59c12dcc0b13b24687d23ac9", "title": "Climate change and livestock herders wellbeing in Pakistan: Does nexus of risk perception, adaptation and their drivers matter?"}, {"paperId": "951de9f43064540e25be81dfc1f96b32f8314a4a", "title": "Synergistic Effects of Kaolin and Silicon Nanoparticles for Ameliorating Deficit Irrigation Stress in Maize Plants by Upregulating Antioxidant Defense Systems"}, {"paperId": "c05aca880ecc78437c97fb5a1b308453bc5cb9f8", "title": "Development and Validation of Nutrition and Food Safety Educational Material for Fish Processors in Nigeria"}, {"paperId": "29b79dbcae01ba6fd57cd473f205debe32567765", "title": "Impact of Financial Resources on Agricultural Growth in Sub-Saharan Africa"}, {"paperId": "2c2f059a508467c77e355cab848bc966bd24f4c3", "title": "Pancreatic Cancer in Celiac Disease Patients—A Systematic Review and Meta-Analysis"}, {"paperId": "f799835680db31f42a7682011b44dbb522f64db5", "title": "GLOBALIZATION, INNOVATION AND FOOD SECURITY IN SUBSAHARAN AFRICA: A GMM APPROACH"}, {"paperId": "b0712433cdf349fba2f025bc698c636303543344", "title": "The Relationship between County-Level Population Shrinkage and Food Security from the Perspective of Spatial Patterns and Processes—A Case Study from the Northeast Region of China"}, {"paperId": "1a20063a54bbc5687590b41852800b50020a96d3", "title": "The impact of climate change on insect pest biology and ecology: Implications for pest management strategies, crop production, and food security"}, {"paperId": "114e442bd1bf650cdd0abaadefade5eaba87b257", "title": "Household food insecurity, family size and their interactions for depression prevalence among teenage pregnant girls in Ghana, a multi-stage cluster sampling survey."}, {"paperId": "20dd54b8c3953c2fca6e55d97a2be8111903d48c", "title": "Central Lancashire Online Knowledge (CLoK)"}]}
