{"paperId": "3fb4813a08ecbbf4ceb31f722713f4bc8366e709", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "User-Defined Functions in Modern Data Engines", "abstract": "Modern data management applications involve complex processing tasks over large volumes of data. Although this falls naturally within the scope of relational databases, many such tasks cannot be expressed in SQL and require additional expressive power achieved via user-defined functions (UDFs). However, efficient processing of UDFs in data engines hinge on dealing with the impedance mismatch between UDF execution and SQL processing. In recent years, the problem of efficient UDF execution in modern data engines has gained significant traction. In this tutorial, we present recent advancements in this area, involving a broad scope of solutions ranging from algebraic, cost-based optimization to low level, physical query optimization, compilation, and execution. We also describe limitations and open issues, and discuss promising future research directions.", "venue": "IEEE International Conference on Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-04-01", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "3593-3598"}, "authors": [{"authorId": "2870466", "name": "Ioannis Foufoulas"}, {"authorId": "1695573", "name": "A. Simitsis"}], "citations": [{"paperId": "01f6f821e9e46558952cf947bac760265a1867f4", "title": "Udon: Efficient Debugging of User-Defined Functions in Big Data Systems with Line-by-Line Control"}, {"paperId": "49d9666d6e3dd5a5a49a9db500c2683c23132b91", "title": "Efficient Execution of User-Defined Functions in SQL Queries"}, {"paperId": "b6561842b3973102e5c7d7601eb8a44d21069dae", "title": "MIP: Advanced Data Processing and Analytics for Science and Medicine"}, {"paperId": "017ed88c7a7f4d72319bcf5821b591b694fd23f7", "title": "The History, Present, and Future of ETL Technology (invited)"}, {"paperId": "089edfd1861192c4a86b6982dec8b41261c4ef79", "title": "User-Defined Functions in Relational Databases: Challenges and Promising Solutions based on YeSQL"}]}
