{"paperId": "3fbf6dbbcf6005b72f7e653fbb24747bf10a8d86", "publicationVenue": null, "title": "Deep learning for manufacturing sustainability: Models, applications in Industry 4.0 and implications", "abstract": null, "venue": "Int. J. Inf. Manag. Data Insights", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Int. J. Inf. Manag. Data Insights", "pages": "100107", "volume": "2"}, "authors": [{"authorId": "101717947", "name": "Anbesh Jamwal"}, {"authorId": "2118310162", "name": "Rajeev Agrawal"}, {"authorId": "2125856540", "name": "Monica Sharma"}], "citations": [{"paperId": "c8d22b9bdb9ff91855839d076473512da74ef993", "title": "Sustainable Consumption And Digital Era: A Review And Research Agenda"}, {"paperId": "321db2b347b1a2ba3f21dbe54f5e66860c6e43b5", "title": "Deep-SDM: A Unified Computational Framework for Sequential Data Modeling Using Deep Learning Models"}, {"paperId": "95b6a64f2dbb876156e3448a0692e83753c814ef", "title": "Reinforcement Learning-Based Optimization for Sustainable and Lean Production within the Context of Industry 4.0"}, {"paperId": "b033582abe606e975d2fcce844497c7d4f7be13a", "title": "Broadening the perspective for sustainable artificial intelligence: sustainability criteria and indicators for Artificial Intelligence systems"}, {"paperId": "7980891608a9180f413e217840006da984229901", "title": "On building machine learning models for medical dataset with correlated features"}, {"paperId": "618b49ba0b13cbc4056bbaf05b2c508745981851", "title": "Enhancing Power Efficiency in 4IR Solar Plants through AI-Powered Energy Optimization"}, {"paperId": "a9c35320f1b6415b1f161402c4824199c0ed91dd", "title": "ECONOMIA CIRCULAR DEL AGUA, RELACIÓN CON LOS ODS, BARRERAS Y PRÁCTICAS PARA SU TRANSICIÓN"}, {"paperId": "cd6402234500f37286e52811dbdbfb87b557a437", "title": "Large Scale Foundation Models for Intelligent Manufacturing Applications: A Survey"}, {"paperId": "dbc0501453a40928e7f77409aa98b2a615ab95d8", "title": "Machine learning for sustainable development: leveraging technology for a greener future"}, {"paperId": "4e3c5d96d0e3ab16b510901c36e56c8d23dfee00", "title": "Exploring artificial intelligence and big data scholarship in information systems: A citation, bibliographic coupling, and co-word analysis"}, {"paperId": "942bad9b613209d81f6f0cef972f84dd08193dcd", "title": "Context based diversification on keyword search by conceptualization of typed terms of the query"}, {"paperId": "30ffd0dba4122027e1be444ca7aa25de3b67513c", "title": "Industry 4.0 in the electric sector: Findings from a systematic review of the literature"}, {"paperId": "8575d02962c1c3dfbae33962e7f2e301713aa64d", "title": "The Use of Simulation and Artificial Intelligence as a Decision Support Tool for Sustainable Production Lines"}, {"paperId": "06c4746baed1edbb2f649b3cd26d01150a72edb6", "title": "Current development on the Operator 4.0 and transition towards the Operator 5.0: A systematic literature review in light of Industry 5.0"}, {"paperId": "6f29d26e0557dbe7f50913634be9638f9375fe81", "title": "The impact of artificial intelligence (AI) on employees’ skills and well-being in global labor markets: A systematic review"}, {"paperId": "fb47d5ac679bc8a540bf3993158982e15be3f767", "title": "Double deep Q-network-based self-adaptive scheduling approach for smart shop floor"}, {"paperId": "097bb8145e0863879f0d312734fd04602ecfa82f", "title": "Defect Detection and Classification in Printed Circuit Boards using Convolutional Neural Networks"}, {"paperId": "1935a52375a04e42035accb822fc02cee432f3b2", "title": "Artificial intelligence in supply chain decision-making: an environmental, social, and governance triggering and technological inhibiting protocol"}, {"paperId": "835595c125e17e9b07b12c0fd0100c3be73f88d5", "title": "Trends and Challenges of Text-to-Image Generation: Sustainability Perspective"}, {"paperId": "de6148eaec73b4aec0b537dc5d14ba264e6e22bc", "title": "A review on remanufacturing, reuse, and recycling in supply chain - Exploring the evolution of information technology over two decades"}, {"paperId": "a9a17ae396385b4912f3c6aff0252d6720c87859", "title": "Unravelling the techno-functional building blocks of metaverse ecosystems - A review and research agenda"}, {"paperId": "a1d1f36fce680b5c4a912ca77c73f7c78b2e904e", "title": "A Machine Learning Tool to Monitor and Forecast Results from Testing Products in End-of-Line Systems"}, {"paperId": "7a159d77a64ba528846738d88219a06369b6558d", "title": "To Align Technological Advancement and Ethical Conduct: An Analysis of the Relationship between Digital Technologies and Sustainable Decision-Making Processes"}, {"paperId": "e2d7941ca8688f3a466df0d2dae2b0d45d9fb076", "title": "Virtual learning simulator of a flexible manufacturing line using Petri NET toolbox"}, {"paperId": "ef7bf5109f27b5e1ffe1b18f02cdac5c56c2b729", "title": "Applications of IoT and Advanced Analytics for manufacturing operations: a systematic literature review"}, {"paperId": "1a5c409d07cccb0928de9988673482116b414048", "title": "Artificial intelligence implementation in manufacturing SMEs: A resource orchestration approach"}, {"paperId": "941870fff4e6b9c73530e6e41a9b814b6a0dccfa", "title": "Aplikasi Rekrutmen Karyawan Menggunakan Artificial Neural Network Dan Flask Employee Recruitment Application Using Artificial Neural Network And Flask"}, {"paperId": "79bfa3a8e065ba6fa9501b3e9d9999b4fb895168", "title": "A survey on AI Approaches for Internet of Things Devices Failure Prediction"}, {"paperId": "8ac4896c6e01edb2a79a153e7488630910f3f02d", "title": "Deep-SDM: A Uniﬁed Computational Framework for Sequential Data Modeling Using Deep Learning Models"}]}
