{"paperId": "3fd7d1152d7661683bd1687d17ffa07899f443a3", "publicationVenue": {"id": "103075b0-1b66-4b69-9c47-f54875634fba", "name": "Bioengineering", "type": "journal", "issn": "2306-5354", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-354376", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-354376", "https://www.mdpi.com/journal/bioengineering"]}, "title": "Supervised Machine Learning and Deep Learning Techniques for Epileptic Seizure Recognition Using EEG Signals—A Systematic Literature Review", "abstract": "Electroencephalography (EEG) is a complicated, non-stationary signal that requires extensive preprocessing and feature extraction approaches to be accurately analyzed. In recent times, Deep learning (DL) has shown great promise in exploiting the characteristics of EEG signals as it can learn relevant features from raw data autonomously. Although studies involving DL have become more common in the last two years, the topic of whether DL truly delivers advantages over conventional Machine learning (ML) methodologies remains unsettled. This study aims to present a detailed overview of the main challenges in the field of seizure detection, prediction, and classification utilizing EEG data, and the approaches taken to solve them using ML and DL methods. A systematic review was conducted surveying peer-reviewed publications published between 2017 and 16 July 2022 using two scientific databases (Web of Science and Scopus) totaling 6822 references after discarding duplicate publications. Whereas 2262 articles were screened based on the title, abstract, and keywords, only 214 were eligible for full-text assessment. A total of 91 papers have been included in this survey after meeting the eligible inclusion and exclusion criteria. The most significant findings from the review are summarized, and several important concepts involving ML and DL for seizure detection, prediction, and classification are discussed in further depth. This review aims to learn more about the different approaches for identifying different types and stages of epileptic seizures, which may then be employed to enhance the lives of epileptic patients in the future, as well as aid experts in the field.", "venue": "Bioengineering", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Bioengineering", "volume": "9"}, "authors": [{"authorId": "2108690", "name": "Mohamed S. Nafea"}, {"authorId": "32952037", "name": "Z. Ismail"}], "citations": [{"paperId": "2dc82ad0bffc753cfe07f81c970c2b36bc5969ac", "title": "Deep Convolutional Neural Networks with Genetic Algorithm-Based Synthetic Minority Over-Sampling Technique for Improved Imbalanced Data Classification"}, {"paperId": "27fecec9ad933449d52362e67080170c5bba5cfb", "title": "Epileptic Seizure Detection using Denoising Autoencoder"}, {"paperId": "1321b4b7287bff263a7fc3344e64f7c29e2ea414", "title": "Tri-SeizureDualNet: A novel multimodal brain seizure detection using triple stream skipped feature extraction module entrenched dual parallel attention transformer"}, {"paperId": "070b6a8b6f60eb0c49a1d63579a069b99d876ce6", "title": "An empirical wavelet transform-based approach for motion artifact removal in electroencephalogram signals"}, {"paperId": "9413ffb1ef83d763c38ecdcfd9784d25c651a56f", "title": "Machine Learning and Artificial Intelligence Applications to Epilepsy: a Review for the Practicing Epileptologist"}, {"paperId": "0312d4b2d83d54bbc279f9b8ee876c877ab91745", "title": "Autoencoder for Epileptic Seizure Recognition: An Unsupervised Approach"}, {"paperId": "bd3345ce9d81f5275ee5fecc92b81e3db0bbd3c3", "title": "Systematic reviews of machine learning in healthcare: a literature review."}, {"paperId": "40acbbfbb52db9124e2baa120cdec0f15332f468", "title": "A review of signal processing and machine learning techniques for interictal epileptiform discharge detection"}, {"paperId": "4ca1ecc4f09500542c5a8226de3b8595b0fb9e8d", "title": "Direct Estimation of Equivalent Bioelectric Sources Based on Huygens’ Principle"}, {"paperId": "ed7a82ffc67c954b2f6e4c0bffb35b13ff32b4c8", "title": "Improving the Performance of ECG-based Epileptic Seizure Prediction"}, {"paperId": "d339b86c8d24eb693214a4c99b46060dee97cc02", "title": "Physiological Noise Filtering in Functional Near-Infrared Spectroscopy Signals Using Wavelet Transform and Long-Short Term Memory Networks"}, {"paperId": "ab238a1e161980d0efe0ee800c3588578c469c9c", "title": "A New Hybrid Approach Based on Time Frequency Images and Deep Learning Methods for Diagnosis of Migraine Disease and Investigation of Stimulus Effect"}, {"paperId": "c8b18940dcb4629c667622212f7e9594056610aa", "title": "Epilepsy Detection Using Embedded Machine Learning"}, {"paperId": "022951966d2f64b684689855052931792951eb99", "title": "Prediction of Cognitive Load from Electroencephalography Signals Using Long Short-Term Memory Network"}, {"paperId": "2493fe9b47c346884a8802c51dd37c31578e3085", "title": "Brain Epileptic Seizure Detection Using Joint CNN and Exhaustive Feature Selection With RNN-BLSTM Classifier"}]}
