{"paperId": "3fd9e77cdd6948430f5413e31c6e2ff5dc5afa78", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Risk Factor Detection and Landslide Susceptibility Mapping Using Geo-Detector and Random Forest Models: The 2018 Hokkaido Eastern Iburi Earthquake", "abstract": "Landslide susceptibility mapping is an effective approach for landslide risk prevention and assessments. The occurrence of slope instability is highly correlated with intrinsic variables that contribute to the occurrence of landslides, such as geology, geomorphology, climate, hydrology, etc. However, feature selection of those conditioning factors to constitute datasets with optimal predictive capability effectively and accurately is still an open question. The present study aims to examine further the integration of the selected landslide conditioning factors with Q-statistic in Geo-detector for determining stratification and selection of landslide conditioning factors in landslide risk analysis as to ultimately optimize landslide susceptibility model prediction. The location chosen for the study was Atsuma Town, which suffered from landslides following the Eastern Iburi Earthquake in 2018 in Hokkaido, Japan. A total of 13 conditioning factors were obtained from different sources belonging to six categories: geology, geomorphology, seismology, hydrology, land cover/use and human activity; these were selected to generate the datasets for landslide susceptibility mapping. The original datasets of landslide conditioning factors were analyzed with Q-statistic in Geo-detector to examine their explanatory powers regarding the occurrence of landslides. A Random Forest (RF) model was adopted for landslide susceptibility mapping. Subsequently, four subsets, including the Manually delineated landslide Points with 9 features Dataset (MPD9), the Randomly delineated landslide Points with 9 features Dataset (RPD9), the Manually delineated landslide Points with 13 features Dataset (MPD13), and the Randomly delineated landslide Points with 13 features Dataset (RPD13), were selected by an analysis of Q-statistic for training and validating the Geo-detector-RF- integrated model. Overall, using dataset MPD9, the Geo-detector-RF-integrated model yielded the highest prediction accuracy (89.90%), followed by using dataset MPD13 (89.53%), dataset RPD13 (88.63%) and dataset RPD9 (87.07%), which implied that optimized conditioning factors can effectively improve the prediction accuracy of landslide susceptibility mapping.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Remote. Sens.", "pages": "1157", "volume": "13"}, "authors": [{"authorId": "2144469995", "name": "Yimo Liu"}, {"authorId": "3044277", "name": "Wanchang Zhang"}, {"authorId": "47294892", "name": "Zhijie Zhang"}, {"authorId": "47515123", "name": "Qiang Xu"}, {"authorId": "2108746718", "name": "Wei-le Li"}], "citations": [{"paperId": "d0578d9997868e9e562e8876a77ae73d8d3c0f12", "title": "Elucidating the response mechanisms of hydrological and sediment connectivity to the river network structure, vegetation, and topographic features in the Jinghe River Basin"}, {"paperId": "0dcdcc3840f924a5c820d4d733856123890c785a", "title": "Spatiotemporal Evaluation of Water Resource Vulnerability in Four River Basins of Henan Province, China"}, {"paperId": "5f0f0c4c96d308c69551e26c26387cddb187d47d", "title": "Assessing Spatio-Temporal Variation and Associated Factors of Forest Fragmentation from Morphological Spatial Pattern Analysis and Geo-Detector Analyses: A Case Study of Xinyu City, Jiangxi Province of Eastern China"}, {"paperId": "375af5ec1dba85c4fe0b1455bce29b1aae33d41e", "title": "A novel CGBoost deep learning algorithm for coseismic landslide susceptibility prediction"}, {"paperId": "4716a15a6466a7d46515b56a7721e814b76a8d2f", "title": "Estimating landslide hazard distribution based on machine learning and bivariate statistics in Utmah Region, Yemen"}, {"paperId": "916ea009676633f20f177035174f062d56e25a6a", "title": "Exploring class imbalance with under-sampling, over-sampling, and hybrid sampling based on Mahalanobis distance for landslide susceptibility assessment: a case study of the 2018 Iburi earthquake induced landslides in Hokkaido, Japan"}, {"paperId": "ac5b089edde42e176c43a14274078e4490225b8c", "title": "Study on landslide susceptibility mapping with different factor screening methods and random forest models"}, {"paperId": "2d6fe7aa3efed72d93d3958043187b6160664da6", "title": "Land disturbance tempo-spatial dynamics in mountainous urban agglomeration and its driving forces: A case study of west Sichuan urban agglomeration, China"}, {"paperId": "2d0855d0b6f786987afce43d23fa9ee1d87b05f8", "title": "Co-Seismic Landslides Triggered by the 2014 Mw 6.2 Ludian Earthquake, Yunnan, China: Spatial Distribution, Directional Effect, and Controlling Factors"}, {"paperId": "8ee5bb580b7f2a6360a0fd101da72e483c3a9b15", "title": "Risk assessment and spatial regulation on urban ground collapse based on geo-detector: a case study of Hangzhou urban area"}, {"paperId": "2c23f1699100c3237cbe35121f9c4a16f24ba96e", "title": "Potential risk assessment due to groundwater quality deterioration and quantifying the major influencing factors using geographical detectors in the Gunabay watershed of Ethiopia"}, {"paperId": "74902fe3a814181cc9feda68bc31916d303fca45", "title": "Conv-trans dual network for landslide detection of multi-channel optical remote sensing images"}, {"paperId": "27e3631e74d3391e38d4ece2cf4595dd55aebceb", "title": "A robust discretization method of factor screening for landslide susceptibility mapping using convolution neural network, random forest, and logistic regression models"}, {"paperId": "d4b1745a8ef7302ff64c55b859ddf0611d1ddd93", "title": "Community perceptions of landslide risk and susceptibility: a multi-country study"}, {"paperId": "7d8c287699fd0b68d6f9ee1eb47f36d1135abf77", "title": "High-Resolution Lidar-Derived DEM for Landslide Susceptibility Assessment Using AHP and Fuzzy Logic in Serdang, Malaysia"}, {"paperId": "0f2f02e3a23edd581c01896a2b9dc3a785e08771", "title": "Uncertainties of landslide susceptibility prediction: Influences of different spatial resolutions, machine learning models and proportions of training and testing dataset"}, {"paperId": "5102e0a71e9d41fb5876ca5c6f396558c08a6f55", "title": "Earthquake-Induced Landslide Susceptibility Assessment Using a Novel Model Based on Gradient Boosting Machine Learning and Class Balancing Methods"}, {"paperId": "3d031f646f1c57fe2ca19ea923fbfa015b7b5152", "title": "Landslide susceptibility mapping based on CNN-3D algorithm with attention module embedded"}, {"paperId": "54658816d884a54eb46db2ec6b0d99338fcc103b", "title": "Distribution and Mobility of Coseismic Landslides Triggered by the 2018 Hokkaido Earthquake in Japan"}, {"paperId": "57c3cf38efb9e91234ef557872a0651c9798df99", "title": "An improved potential landslide hazard points evaluating method considering the heterogeneity of environmental features"}, {"paperId": "0bb1e453b9998794cf7272a054722143c9afdfe3", "title": "Landslide Susceptibility Mapping of Landslides with Artificial Neural Networks: Multi-Approach Analysis of aBackpropagation Algorithm Applying the Neuralnet Package in Cuenca, Ecuador"}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "b5711aee3e471c25dacaf20da295760cb17db728", "title": "Multiscale Spatial Distribution Pattern and Influencing Factors on Inland Fishing Gardens in China"}, {"paperId": "b64363715f9efdc5cf6ebb65d28504854a11d5a5", "title": "Susceptibility Analysis of Geohazards in the Longmen Mountain Region after the Wenchuan Earthquake"}, {"paperId": "3929125067a1041dc0d7a55447c4117c5ba16455", "title": "Comprehensive performance assessment of landslide susceptibility mapping with MLP and random forest: a case study after Elazig earthquake (24 Jan 2020, Mw 6.8), Turkey"}, {"paperId": "59ab5668f15de173d2dde255069e94aaa95145a1", "title": "A Hybrid Intelligent Model for Urban Seismic Risk Assessment from the Perspective of Possibility and Vulnerability Based on Particle Swarm Optimization"}, {"paperId": "ba609035f7ef90547a854ef738269a5927ab3f0e", "title": "Monitoring Vegetation Change and Its Potential Drivers in Inner Mongolia from 2000 to 2019"}, {"paperId": "343d5e60aa2c7f41e23db1eb41a033eb2c56aeb0", "title": "Estimation of the source process and forward simulation of long-period ground motion of the 2018 Hokkaido Eastern Iburi, Japan, earthquake"}, {"paperId": "f455cb3309a86c801ad4217e58f13f816231292d", "title": "Controlling role of Ta-d pumice on the coseismic landslides triggered by 2018 Hokkaido Eastern Iburi Earthquake"}, {"paperId": "f67142c1b13305d3de4612a0f39d54cb13b107e7", "title": "Spatial Nonlinear Forces and Consumer Behavior on Community Pharmacies: A Study after the Guangzhou COVID-19 Lift Lockdown"}, {"paperId": "6e81d1f068ceadbd88e019d38dd06ed8e788de70", "title": "Analyzing the environmental evolution of the Tibetan Plateau based on open-source data"}, {"paperId": "12fca47c4ab83d02359ae3240c9732104ebc901e", "title": "APPLICATION OF CNN ON LANDSLIDE SUSCEPTIBILITY ANALYSIS: CASE STUDY ON 2018 HOKKAIDO EASTERN IBURI EARTHQUAKE"}]}
