{"paperId": "3fdd093b7cc8a273980afe579c180c3305bfe9e4", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Coupling Progressive Deep Learning with the AdaBoost Framework for Landslide Displacement Rate Prediction in the Baihetan Dam Reservoir, China", "abstract": "Disasters caused by landslides pose a considerable threat to people’s lives and property, resulting in substantial losses each year. Landslide displacement rate prediction (LDRP) provides a useful fundamental tool for mitigating landslide disasters. However, more accurately predicting LDRP remains a challenge in the study of landslides. Lately, ensemble deep learning algorithms have shown promise in delivering a more precise and effective spatial modeling solution. The core aims of this research are to explore and evaluate the prediction capability of three progressive evolutionary deep learning (DL) techniques, i.e., a recurrent neural network (RNN), long short-term memory (LSTM), and a gated recurrent unit (GRU) ensemble AdaBoost algorithm for modeling rainfall-induced and reservoir-induced landslides in the Baihetan reservoir area in China. The outcomes show that the ensemble DL model could predict the Wangjiashan landslide in the Baihetan reservoir area with improved accuracy. The highest accuracy was achieved in the testing set when the window length equaled 30. However, assembling two predictors outperformed the accuracy of assembling three predictors, with the mean absolute error and root mean square error reaching 1.019 and 1.300, respectively. These findings suggest that the combination of strong learners and DL can yield satisfactory prediction results.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-27", "journal": {"name": "Remote. Sens.", "pages": "2296", "volume": "15"}, "authors": [{"authorId": "116080405", "name": "Weida Ni"}, {"authorId": "114025053", "name": "Liuyuan Zhao"}, {"authorId": "2154724975", "name": "Lele Zhang"}, {"authorId": "2200250367", "name": "Ke Xing"}, {"authorId": "47822855", "name": "J. Dou"}], "citations": [{"paperId": "0dd081a6c65ee481765440958a8a127898f7c87c", "title": "Comparative Study of Deep Neural Networks for Landslide Susceptibility Assessment: A Case Study of Pyeongchang-gun, South Korea"}, {"paperId": "e6344f0f7f008f0dd2e2cfae04ebd3db87d799f1", "title": "Assessing industrial wastewater effluent toxicity using boosting algorithms in machine learning: A case study on ecotoxicity prediction and control strategy development."}, {"paperId": "6971f9b2ae2f895d1108b9b598171fff0c3063a2", "title": "机器学习在滑坡智能防灾减灾中的应用与发展趋势"}]}
