{"paperId": "3ff6e893d1e79b2596ede28001a0f81629b6bcc1", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "CRA: Enabling Data-Intensive Applications in Containerized Environments", "abstract": "Today, a modern data center hosts a wide variety of applications comprising batch, interactive, machine learning, and streaming applications. In this paper, we factor out the commonalities in a large majority of these applications, into a generic dataflow layer called Common Runtime for Applications (CRA). In parallel, another trend, with containerization technologies (e.g., Docker), has taken a serious hold on cloud-scale data centers, with direct implications on building next generation of data center applications. Container orchestrators (e.g., Kubernetes) have made deployment a lot easy, and they solve many infrastructure level problems, e.g., service discovery, auto-restart, and replication. For best in class performance, there is a need to marry the next generation applications with containerization technologies. To that end, CRA leverages and builds upon the containerization and resource orchestration capabilities of Kubernetes/Docker, and makes it easy to build a wide range of cloud-edge applications on top. To the best of our knowledge, we are the first to present a cloud native runtime for building data center applications. We show the efficiency of CRA through various micro-benchmarking experiments.", "venue": "IEEE International Conference on Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-08", "journal": {"name": "2019 IEEE 35th International Conference on Data Engineering (ICDE)", "pages": "1762-1765"}, "authors": [{"authorId": "2737145", "name": "Ibrahim Sabek"}, {"authorId": "2241445", "name": "Badrish Chandramouli"}, {"authorId": "1856878", "name": "U. F. Minhas"}], "citations": [{"paperId": "bf270a1c0eee18fd2383494a72f6c19f5d720b9b", "title": "I learned"}, {"paperId": "e41411ed72ffaeec0ed6ec4d77231c594ea0dc91", "title": "Escapement: A Tool for Interactive Prototyping with Video via Sensor-Mediated Abstraction of Time"}, {"paperId": "36845cce9a409547a4d99ca2ae08d12e519f2bbf", "title": "Architectural Aspects of a Data-Intensive System: A Covid-19 Related Case Study"}, {"paperId": "fd6e3e81abbc11ada2bedc639adcf83efb52503d", "title": "SurfaceFleet: Exploring Distributed Interactions Unbounded from Device, Application, User, and Time"}, {"paperId": "133a83efb2acc30f180c9399df12ce3c5f56d377", "title": "A.M.B.R.O.S.I.A"}, {"paperId": "77e1a9128f09729b8f4cd99b2c0112467dabc162", "title": "A.M.B.R.O.S.I.A: Providing Performant Virtual Resiliency for Distributed Applications"}]}
