{"paperId": "3ffe416f8f01d64072d740bcdbb0932256b2cde1", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Optimal Decision Making Approach for Cyber Security Defense Using Evolutionary Game", "abstract": "At present, there are many techniques for cyber security defense such as firewall, intrusion detection and cryptography. Despite decades of studies and experiences on this issue, there still exists a problem that we always pay great attention to technology while overlooking strategy. In the traditional warfare, the level of decision-making and the formulation of optimal strategies have a great effect on the warfare result. Similarly, the timeliness and quality of decision-making in cyber attack-defense also make great significance. Since the attackers and defenders are oppositional, the selection of optimal defense strategy with the maximum payoff is difficult. To solve this problem, the stochastic evolutionary game model is utilized to simulate the dynamic adversary of cyber attack-defense. We add the parameter $\\lambda $ to the Logit Quantal Response Dynamics (LQRD) equation to quantify the cognitive differences of real-world players. By calculating the evolutionary stable equilibrium, the best decision-making approach is proposed, which makes a balance between defense cost and benefit. Cases studies on ransomware indicate that the proposed approach can help the defender predict possible attack action, select the related optimal defense strategy over time, and gain the maximum defense payoff.", "venue": "IEEE Transactions on Network and Service Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-19", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "1683-1700", "volume": "17"}, "authors": [{"authorId": "145190413", "name": "Hao Hu"}, {"authorId": "2108353389", "name": "Yuling Liu"}, {"authorId": "2127381326", "name": "Chen Chen"}, {"authorId": "150129587", "name": "Hongqi Zhang"}, {"authorId": "2153629111", "name": "Yi Liu"}], "citations": [{"paperId": "c59eec4d0209fecb0e0e2d900848399d7185d42d", "title": "Generation of security system defense strategies based on evolutionary game theory"}, {"paperId": "5a07a8ab6bf24502f5e56d1af1223d1191c8b170", "title": "Automated Security Response through Online Learning with Adaptive Conjectures"}, {"paperId": "84044f48f33b7668608f03666dfd1b20d20ae175", "title": "SoK: Game-Theoretic Cybersecurity: Assumptions, Models, Gaps, and Bridges"}, {"paperId": "b58a8428ea5b0d84cdeb2569c2edf3c7671a9fbc", "title": "WF-MTD: Evolutionary Decision Method for Moving Target Defense Based on Wright-Fisher Process"}, {"paperId": "d0619c1d704460798954e0de8c82b715acf61bf2", "title": "Optimal defense strategy selection method for CPS considering integrated cyber-physical losses"}, {"paperId": "b0f14dd50e8825ee20deb2c67eaf7db85070f496", "title": "A method for analyzing Stackelberg attack-defense game model in 5G by tCPSO"}, {"paperId": "e9aafa41281473ab9d301e3776ff5a48f0525352", "title": "Recent Developments in Game-Theory Approaches for the Detection and Defense against Advanced Persistent Threats (APTs): A Systematic Review"}, {"paperId": "33273a0d67a56b66d7c726ed2e52480e84502d56", "title": "Evolutionary game decision-making method for network attack and defense based on regret minimization algorithm"}, {"paperId": "7e00b97877207a266bde8b19ebddd832518534ff", "title": "A differential game approach for real-time security defense decision in scale-free networks"}, {"paperId": "ff0b8e62b99439b3c98bbfec42dd0807ba5e469b", "title": "Learning Near-Optimal Intrusion Responses Against Dynamic Attackers"}, {"paperId": "6291689e64e74c14ce02d0e08ddb26815d0231a5", "title": "Game theory in network security for digital twins in industry"}, {"paperId": "d7876f36e851c57172726cae8a6f3c99f31ce874", "title": "An Optimal Group Decision-Making Approach for Cyber Security Using Improved Selection-Drift Dynamics"}, {"paperId": "b04ae62c7df3156aeb00e629707e1fdff65bb5ca", "title": "Predictive Cyber Defense Remediation against Advanced Persistent Threat in Cyber-Physical Systems"}, {"paperId": "9a5ab15116cca4c7d74f53316d6813c5f03cb271", "title": "Defending active directory by combining neural network based dynamic program and evolutionary diversity optimisation"}, {"paperId": "3821a5f51568f93466cfeb758a15b1da41cf0977", "title": "Advancing the concept of cybersecurity as a public good"}, {"paperId": "19cf0ac90aa4896a6c155a6b69bf08e14b1bd4a7", "title": "Users' Payment Intention considering Privacy Protection in Cloud Storage: An Evolutionary Game-Theoretic Approach"}, {"paperId": "37a7e89c8ad49e819bc6380870cd9804d41bc80a", "title": "Defense Strategy Selection Model Based on Multistage Evolutionary Game Theory"}, {"paperId": "ecd146f104d874e57ccc5722682b8069eb797be8", "title": "Dynamics of targeted ransomware negotiation"}, {"paperId": "d00f4352d474471b1f0e8663eb12d405dd5d6167", "title": "Optimal Network Defense Strategy Selection Method: A Stochastic Differential Game Model"}, {"paperId": "ff7c2559bad04a5c6d2473505ff39edf72dd7214", "title": "Optimal Network Defense Decision-making Method Based on Delay-Time Differential Game"}, {"paperId": "1abf284fac42764db2bb15a6f91477f4ffc6ed91", "title": "Behavior Choice of Game Parties under the Interference of Cognition in the Game between Coal Miners and Supervisors"}, {"paperId": "9775fa3f678be621fb450cd88c80e00eb7f09d8a", "title": "CPS Attacks Mitigation Approaches on Power Electronic Systems With Security Challenges for Smart Grid Applications: A Review"}, {"paperId": "29084179d8c529aa5de0d876fd552afb8a1fe556", "title": "SOCMTD: Selecting Optimal Countermeasure for Moving Target Defense Using Dynamic Game"}, {"paperId": "395463dd7126b9721cf7ee18184b6521203fc61e", "title": "Computational Models of Human Decision-Making with Application to the Internet of Everything"}, {"paperId": "ddc892da5dc371f1d55fc957df8bc57263f020e2", "title": "Efficient Defense Decision-Making Approach for Multistep Attacks Based on the Attack Graph and Game Theory"}]}
