{"paperId": "3ffedebbd07b66d0cfdd7e180549ab3a63a38ee6", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "Transfer Learning-Aided Collaborative Computational Method for Intelligent Transportation System Applications", "abstract": "Intelligent Transportation System (ITS) assists communication and navigation for users and vehicles in roadside movements. It integrates information technology, computational intelligence, and distributed service platforms for providing classified assistance. The classified assistance ensures object detection, navigation, route identification, and messaging application support. This article introduces a novel Collaborative Computational Method (CCM) using Transfer Learning (TL) for condensed information analysis. In this method, application-centric computations are performed for decision-making and thwarting replicated and false information handling. The information is computed by exploiting the previous application-accuracy knowledge segregating different inputs. This selective computation relies on current and previous information knowledge collaboratively. The learning process is responsible for shift-based validation of computation accuracy using collaborative information. The proposed method’s performance is analyzed using accuracy, computation time, complexity, and information backlogs. The proposed CCM-TL improves by 8.5% and 4.91% accuracy and information sharing. It similarly reduces computation time, complexity, and backlogs by 14.97%, 6.7%, and 16.67%, respectively.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "1355-1367", "volume": "6"}, "authors": [{"authorId": "2157416175", "name": "Tu N. Nguyen"}, {"authorId": "1505808706", "name": "Jiechao Gao"}, {"authorId": "10148761", "name": "Gunasekaran Manogaran"}, {"authorId": "92653281", "name": "R. D. J. Samuel"}, {"authorId": "2474250", "name": "M. Alazab"}], "citations": []}
