{"paperId": "400d98ed7ff0883302e1df5a95247a2f401ef6d1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Emerging Exploration Strategies of Knowledge Graphs", "abstract": "The utilization of semantic web technologies has led to the development of knowledge graphs represented as triples that allow for the exploration of specific and cross-domains. Despite the advantages of semantic links between entities in facilitating user exploration, they can also lead to an overwhelming number of exploration choices that can cause confusion, frustration, uncertainty, and a sense of being lost in the abundant graph, particularly for users who are not familiar with the domain. Thus, identifying exploration strategies is critical to improving user exploration and increasing exploration utility. This study aims to identify exploration strategies that promote knowledge utility (i.e., increase users’ domain knowledge) and exploration experience (i.e., provide users with a positive and pleasant feeling). To accomplish this goal, an experimental user study was conducted, involving lay users in the musical instrument domain, where they were presented with an exploration task and then allowed to freely explore musical instruments. Parameters related to exploration paths were used to analyze the exploration patterns that users follow during their exploration. The findings reveal exploration strategies that promote knowledge utility and exploration experience. This research contributes to the literature on intelligent methods of guiding user exploration through knowledge graphs to enhance exploration effectiveness, which can have broad applications in knowledge graph utilization.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "94713-94731", "volume": "11"}, "authors": [{"authorId": "68994148", "name": "Marwan Al-Tawil"}, {"authorId": "145499774", "name": "V. Dimitrova"}, {"authorId": "33272847", "name": "D. Thakker"}, {"authorId": "1405052048", "name": "Bilal Abu-Salih"}], "citations": [{"paperId": "7759144cb77e9d34469e4a19ebad8d40e482956b", "title": "A systematic literature review of knowledge graph construction and application in education"}]}
