{"paperId": "401e43955af440bc2e8d1641f71aaf59249a524a", "publicationVenue": null, "title": "EvoX: A Distributed GPU-accelerated Framework for Scalable Evolutionary Computation", "abstract": "Inspired by natural evolutionary processes, Evolutionary Computation (EC) has established itself as a cornerstone of Artificial Intelligence. Recently, with the surge in data-intensive applications and large-scale complex systems, the demand for scalable EC solutions has grown significantly. However, most existing EC infrastructures fall short of catering to the heightened demands of large-scale problem solving. While the advent of some pioneering GPU-accelerated EC libraries is a step forward, they also grapple with some limitations, particularly in terms of flexibility and architectural robustness. In response, we introduce EvoX: a computing framework tailored for automated, distributed, and heterogeneous execution of EC algorithms. At the core of EvoX lies a unique programming model to streamline the development of parallelizable EC algorithms, complemented by a computation model specifically optimized for distributed GPU acceleration. Building upon this foundation, we have crafted an extensive library comprising a wide spectrum of 50+ EC algorithms for both single- and multi-objective optimization. Furthermore, the library offers comprehensive support for a diverse set of benchmark problems, ranging from dozens of numerical test functions to hundreds of reinforcement learning tasks. Through extensive experiments across a range of problem scenarios and hardware configurations, EvoX demonstrates robust system and model performances. EvoX is open-source and accessible at: https://github.com/EMI-Group/EvoX.", "venue": "", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2023-01-29", "journal": null, "authors": [{"authorId": "2203359436", "name": "Beichen Huang"}, {"authorId": "39336044", "name": "Ran Cheng"}, {"authorId": "2157835870", "name": "Yaochu Jin"}, {"authorId": "2186649479", "name": "K. Tan"}], "citations": [{"paperId": "2c46db232845ee5e6688bc59b734edecb5cfa4e5", "title": "Tensorized NeuroEvolution of Augmenting Topologies for GPU Acceleration"}, {"paperId": "176188a280cac3e930026588b2506b1352937515", "title": "MToP: A MATLAB Optimization Platform for Evolutionary Multitasking"}, {"paperId": "0d95bcdd699f12fae37d0d166cf80303750dd09a", "title": "Rethinking Population-assisted Off-policy Reinforcement Learning"}]}
