{"paperId": "402646d6298f995fbd1054de5fb66a04fa58dc44", "publicationVenue": {"id": "450bd6f2-b517-4945-9cc0-550a4ee53648", "name": "Science Engineering and Technology", "alternate_names": ["Sci Eng Technol"], "issn": "2744-2527"}, "title": "Evaluation and Challenges of IoT Simulators for Intelligent Transportation System Applications", "abstract": "The Internet-of-Things (IoT) constructs a vast, intricate, and perpetually evolving ecosystem exerting profound societal implications. This labyrinthine nature often culminates in errors that directly impact human lives. A significant domain where this complexity materializes is Intelligent Transportation Systems (ITS). Present tools and methodologies inadequately accommodate the complex task of testing and validation, underscoring the urgency for comprehensive review and enhancement. This study aims to present a broad analysis of existing simulators utilized for ITS simulations. It delves into the role and effectiveness of such simulation tools, highlighting their limitations and proposing research directions. This paper scrutinizes both commercial and research-oriented IoT simulators for ITS, evaluating their features and simulation environment tools. We have detailed various ITS scenarios simulated within these frameworks, intending to gauge their readiness for real-world ITS applications and to elaborate on the challenges involved in ITS infrastructure implementation. The findings suggest that despite numerous simulators aiding the evolution of solutions for IoT challenges in recent years, their utility in actual ITS implementations remain uncertain. Consequently, we explore public cloud platforms offering IoT simulation capabilities, focusing particularly on the capabilities provided by the Amazon Web Services (AWS) IoT simulation for this study. Our research outlines the pressing challenges in this field, while proposing potential solutions and flagging opportunities for further research. This study paves the way towards improving the reliability and accuracy of IoT simulators in the context of ITS, which has immense potential to enhance the quality of human life.", "venue": "Science Engineering and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-15", "journal": {"name": "Science, Engineering and Technology"}, "authors": [{"authorId": "115028743", "name": "K. Khattak"}, {"authorId": "113300730", "name": "Z. Khan"}], "citations": []}
