{"paperId": "4034cfaa803c483a60c41202cfecac8aefa2682c", "publicationVenue": null, "title": "The Impact of ChatGPT on Streaming Media: A Crowdsourced and Data-Driven Analysis using Twitter and Reddit", "abstract": "ChatGPT, a general-purpose text generation AI model, is reshaping various domains ranging from education and software development to legal defense and novel writing. Despite its potential impact, there is a lack of research on how ChatGPT might influence streaming media, which is an essential part of everyday entertainment. As a result, it remains unclear how ChatGPT is changing the future of streaming media. To bridge such a research gap, in this paper, we propose a crowdsourced, data-driven framework that leverages two social media platforms, Twitter and Reddit, to explore the impact of ChatGPT on streaming media. Through extensive analysis of social media data collected from Twitter and Reddit, we reveal how ChatGPT is transforming streaming media from diverse perspectives. Our data analytics demonstrates that ChatGPT is sparking both fear and excitement in the context of the streaming media and enhancing the downstream visual generative models, such as DALLE-2 and Stable Diffusion Videos. To the best of our knowledge, this study is the first large-scale and systematical investigation into the effects of ChatGPT on streaming media. Hope our findings will inspire further research and discussions on this topic across academia and industry.", "venue": "2023 IEEE 9th Intl Conference on Big Data Security on Cloud (BigDataSecurity), IEEE Intl Conference on High Performance and Smart Computing, (HPSC) and IEEE Intl Conference on Intelligent Data and Security (IDS)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE 9th Intl Conference on Big Data Security on Cloud (BigDataSecurity), IEEE Intl Conference on High Performance and Smart Computing, (HPSC) and IEEE Intl Conference on Intelligent Data and Security (IDS)", "pages": "222-227"}, "authors": [{"authorId": "26411760", "name": "Yunhe Feng"}, {"authorId": "2218391241", "name": "Pradhyumna Poralla"}, {"authorId": "2218188451", "name": "Swagatika Dash"}, {"authorId": "2218274055", "name": "Kaicheng Li"}, {"authorId": "2218392567", "name": "Vrushabh Desai"}, {"authorId": "1471335567", "name": "M. Qiu"}], "citations": [{"paperId": "93b62d4c6542e114ca7ffb910653b6a5e51bc210", "title": "Understanding the Impact of AI Generated Content on Social Media: The Pixiv Case"}, {"paperId": "1104d766527dead44a40532e8a89444d9cef5c65", "title": "\"Do Anything Now\": Characterizing and Evaluating In-The-Wild Jailbreak Prompts on Large Language Models"}, {"paperId": "d88c9134473afffa898a48e6ab1b588505f3a1b4", "title": "Exploring AI Tool's Versatile Responses: An In-depth Analysis Across Different Industries and Its Performance Evaluation"}, {"paperId": "36195ad1ee99c0b0a3c5770a0b15ef889db4b17e", "title": "Investigating Code Generation Performance of ChatGPT with Crowdsourcing Social Data"}, {"paperId": "3c2c924b788ef620b9e4a0fdf789a12a5bde5129", "title": "ChatGPT in education: A discourse analysis of worries and concerns on social media"}, {"paperId": "c0ba17ea991086a9107f50c5cf66d5a6d400c200", "title": "Exploring the Sector-Specific Influence and Response of AI Tools: A Critical Review"}, {"paperId": "3cdda20ca8acd01ed05b43ceedb3ee2f0fa93bb4", "title": "Moth Flame Optimization With Hybrid Deep Learning Based Sentiment Classification Toward ChatGPT on Twitter"}, {"paperId": "0596a6dd2bdf24809a897e5e101c15f694861a0f", "title": "Banning of ChatGPT from Educational Spaces: A Reddit Perspective"}]}
