{"paperId": "404c65ac1c63ff232528d91f78fbc1caead56240", "publicationVenue": {"id": "b1846822-6c7a-4679-979a-246fbd7388c3", "name": "International Conference on Information, Communications and Signal Processing", "type": "conference", "alternate_names": ["International Conference on Information and Communication Security", "ICICS", "Int Conf Inf Commun Signal Process", "Int Conf Inf Commun Secur"], "url": "http://www.wikicfp.com/cfp/program?id=1385"}, "title": "TimeClave: Oblivious In-enclave Time series Processing System", "abstract": "Cloud platforms are widely adopted by many systems, such as time series processing systems, to store and process massive amounts of sensitive time series data. Unfortunately, several incidents have shown that cloud platforms are vulnerable to internal and external attacks that lead to critical data breaches. Adopting cryptographic protocols such as homomorphic encryption and secure multi-party computation adds high computational and network overhead to query operations. We present TimeClave, a fully oblivious in-enclave time series processing system: TimeClave leverages Intel SGX to support aggregate statistics on time series with minimal memory consumption inside the enclave. To hide the access pattern inside the enclave, we introduce a non-blocking read-optimised ORAM named RoORAM. TimeClave integrates RoORAM to obliviously and securely handle client queries with high performance. With an aggregation time interval of $10s$, $2^{14}$ summarised data blocks and 8 aggregate functions, TimeClave run point query in $0.03ms$ and a range query of 50 intervals in $0.46ms$. Compared to the ORAM baseline, TimeClave achieves lower query latency by up to $2.5\\times$ and up to $2\\times$ throughput, with up to 22K queries per second.", "venue": "International Conference on Information, Communications and Signal Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-29", "journal": {"pages": "719-737"}, "authors": [{"authorId": "2088530232", "name": "K. Bagher"}, {"authorId": "2075307118", "name": "S. Cui"}, {"authorId": "50242842", "name": "X. Yuan"}, {"authorId": "144031685", "name": "C. Rudolph"}, {"authorId": "2113202091", "name": "X. Yi"}], "citations": []}
