{"paperId": "404d7ad5f1396736fd0141ca727aac6f553870fd", "publicationVenue": null, "title": "Big Data and Product Lifecycle Management", "abstract": "Big Data is on the horizon for many industries and the automotive is no different. Therefore is the aim of this project to explore Big Data opportunities and barriers for an automotive company, focusing on knowledge-driven product development and new services. It does so by looking at it from a Product Life-cycle Management (PLM) perspective, where opportunities and barriers are examined and compared between different divisions of the company. These three divisions are R&D, Operations and Aftermarket. The project also aims to obtain a holistic view, and discuss how these divisions interconnects and what requirements this puts on Big Data solutions. The approaches used are interviews and observations presented as case studies, where people with connection to Big Data and the automotive company gives their view on the subject. It also includes a data mining experiment where a large set of data is examined in order to get a deeper understanding of requirements and barriers for working with Big Data analytics. The project concludes that the potential for knowledge-driven product development powered by Big Data is huge. Actual data on product and user behavior can be used to make decisions on product design, errors can be detected live and shorten feedback-loops and software updates can be done wirelessly. Barriers for this are capabilities in terms of personnel skills, data quality, automatic analytic tools and traceability. Other Big Data opportunities in automotive are new services such as predictive maintenance in Operations and Aftermarket, leading to quicker identification of quality problems enabling better customer services and less quality issues in production.", "venue": "", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2094724408", "name": "Kristoffer Hertzman"}, {"authorId": "30987882", "name": "J. Bladh"}], "citations": []}
