{"paperId": "406939de70c94d9daecc10ee0c11480592aa4268", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Fast and Heavy Disjoint Weighted Matchings for Demand-Aware Datacenter Topologies", "abstract": "Reconfigurable optical topologies promise to improve the performance in datacenters by dynamically optimizing the physical network in a demand-aware manner. State-of-the-art optical technologies allow to establish and update direct connectivity (in the form of edge-disjoint matchings) between top-of-rack switches within microseconds or less. However, to fully exploit temporal structure in the demand, such fine-grained reconfigurations also require fast algorithms for optimizing the interconnecting matchings.Motivated by the desire to offload a maximum amount of demand to the reconfigurable network, this paper initiates the study of fast algorithms to find k disjoint heavy matchings in graphs. We present and analyze six algorithms, based on iterative matchings, b-matching, edge coloring, and node-rankings. We show that the problem is generally ${\\mathcal{N}}{\\mathcal{P}}{\\text{ - hard}}$ and study the achievable approximation ratios.An extensive empirical evaluation of our algorithms on both real-world and synthetic traces (88 in total), including traces collected in Facebook datacenters and in HPC clusters reveals that all our algorithms provide high-quality matchings, and also very fast ones come within 95 % or more of the best solution. However, the running times differ significantly and what is the best algorithm depends on k and the acceptable runtime-quality tradeoff.", "venue": "IEEE Conference on Computer Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-01-17", "journal": {"name": "IEEE INFOCOM 2022 - IEEE Conference on Computer Communications", "pages": "1649-1658"}, "authors": [{"authorId": "2994002", "name": "Kathrin Hanauer"}, {"authorId": "1744110", "name": "Monika Henzinger"}, {"authorId": "144594844", "name": "S. Schmid"}, {"authorId": "1905800485", "name": "Jonathan Trummer"}], "citations": [{"paperId": "382e62b77e30ccfa9a5d5698b4915499f0d69edf", "title": "Streaming Algorithms for Weighted k-Disjoint Matchings"}, {"paperId": "0652413b1ffede389898abca8c372bfa8b66793a", "title": "On b-Matching and Fully-Dynamic Maximum k-Edge Coloring"}, {"paperId": "7754ec27865bedfc1061a2084c056a6ac37654f6", "title": "Distributed Demand-aware Network Design using Bounded Square Root of Graphs"}, {"paperId": "3d0f0b8e3b910eb44a7c1579ae18572520468f2e", "title": "Dynamic Demand-Aware Link Scheduling for Reconfigurable Datacenters"}, {"paperId": "edee7ee8a262a44591d643edb31e8c0bcabb866b", "title": "Chopin: Combining Distributed and Centralized Schedulers for Self-Adjusting Datacenter Networks"}, {"paperId": "a6846082fe78e1b783bb888299cdfafb12aca7ff", "title": "Optimizing Reconfigurable Optical Datacenters: The Power of Randomization"}, {"paperId": "e2d76a9812cbca042d2a648aeda898d259562467", "title": "Self-Adjusting Ego-Trees Topology for Reconfigurable Datacenter Networks"}, {"paperId": "03c62a35a3e273811a1e1c9fb1812ff30cdd870c", "title": "Online B-Matchings for Reconfigurable Datacenters: The Power of Randomization"}]}
