{"paperId": "40a057c355fc81406936e92c313888229fb9876e", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Machine and Deep Learning for IoT Security and Privacy: Applications, Challenges, and Future Directions", "abstract": "The integration of the Internet of Things (IoT) connects a number of intelligent devices with minimum human interference that can interact with one another. IoT is rapidly emerging in the areas of computer science. However, new security problems are posed by the cross-cutting design of the multidisciplinary elements and IoT systems involved in deploying such schemes. Ineffective is the implementation of security protocols, i.e., authentication, encryption, application security, and access network for IoT systems and their essential weaknesses in security. Current security approaches can also be improved to protect the IoT environment effectively. In recent years, deep learning (DL)/machine learning (ML) has progressed significantly in various critical implementations. Therefore, DL/ML methods are essential to turn IoT system protection from simply enabling safe contact between IoT systems to intelligence systems in security. This review aims to include an extensive analysis of ML systems and state-of-the-art developments in DL methods to improve enhanced IoT device protection methods. On the other hand, various new insights in machine and deep learning for IoT securities illustrate how it could help future research. IoT protection risks relating to emerging or essential threats are identified, as well as future IoT device attacks and possible threats associated with each surface. We then carefully analyze DL and ML IoT protection approaches and present each approach’s benefits, possibilities, and weaknesses. This review discusses a number of potential challenges and limitations. The future works, recommendations, and suggestions of DL/ML in IoT security are also included.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-08-27", "journal": {"name": "ArXiv", "volume": "abs/2210.13547"}, "authors": [{"authorId": "144009362", "name": "Subrato Bharati"}, {"authorId": "9386018", "name": "Prajoy Podder"}], "citations": [{"paperId": "57b557ba66d00392af16488d21ed492245694bed", "title": "Machine learning-based lightweight block ciphers for resource-constrained internet of things networks: a review"}, {"paperId": "d6b5fd7a960cf90f151655e88ab3efffa76cfff8", "title": "Machine Learning Techniques for Cyberattack Prevention in IoT Systems: A Comparative Perspective of Cybersecurity and Cyberdefense in Colombia"}, {"paperId": "021a6c9cd594a102d4adb25b9c327e6ffd1ca222", "title": "Deep hashing with multilayer CNN-based biometric authentication for identifying individuals in transportation security"}, {"paperId": "35be16b17766c43dba2a5f64cafae8f5beee3b1e", "title": "An Evaluation and Implementation of the Effectiveness of Cloud Security as a Service in IoT Security"}, {"paperId": "594905b669d92b8a0749ea974a557ae130d3945d", "title": "IoT Security using Machine Learning: Applications and Difficulties based on Forthcoming Directions"}, {"paperId": "499f6485de92adb9857c951847de3d3b71bea480", "title": "Progression and Challenges of IoT in Healthcare: A Short Review"}, {"paperId": "d53a9ba832c83b8366225980f8832801ee3eb7ff", "title": "Security and Privacy Concerns Associated with the Internet of Things(IoT) and the Role of Adapting Blockchain and Machine Learning - A Systematic Literature Review"}, {"paperId": "15f084615cde9318b90d51ae3a3bbb8cc433f13b", "title": "An intrusion detection model using extreme learning machine"}, {"paperId": "fb1a655090dbd90934ea6baa99934f0a4c2a342f", "title": "Application of IoT network for marine wildlife surveillance"}, {"paperId": "9190a9cde62c3a0efd4f8db0d0cd1f23d55e8452", "title": "DWFed: A statistical- heterogeneity-based dynamic weighted model aggregation algorithm for federated learning"}, {"paperId": "830a788b21859ad8d20cf40f85bd7a86d3bed22a", "title": "A Comprehensive Analysis of the Machine Learning Algorithms in IoT IDS Systems"}, {"paperId": "709ba056cef5fb823ce01ecf2a937f2ceb6f5b11", "title": "Cybersecurity Attacks Detection For MQTT-IoT Networks Using Machine Learning Ensemble Techniques"}, {"paperId": "764d8fb51d61f81b385e370b99f65cf82dda9833", "title": "A Secure Hybrid Deep Learning Technique for Anomaly Detection in IIoT Edge Computing"}]}
