{"paperId": "40ab52f94e1e19e0289473ed2d086a837d07747d", "publicationVenue": null, "title": "An evaluation of MapReduce framework in cluster analysis", "abstract": "Data is growing exponentially due to the World Wide Web and scientific enhancements, requires proper strategies and techniques to deal with it. Thus, it requires increasing the computational requirements. Efficient processing paradigms and smart implementation architecture is the key to meet the scalability and performance requirements in large scale data analysis. Clustering is one of the popular data mining techniques to analyse datasets. MapReduce programming paradigm, on the top of Hadoop distributed architecture, is widely used in today's world in order to obtain efficiency for large dataset clustering. In this work, we have experimented and validated the efficiency of K-means clustering algorithm in MapReduce paradigm over hadoop architecture while processing different sized datasets in combination of different hadoop cluster sizes.", "venue": "2017 International Conference on Intelligent Computing, Instrumentation and Control Technologies (ICICICT)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 International Conference on Intelligent Computing, Instrumentation and Control Technologies (ICICICT)", "pages": "110-114"}, "authors": [{"authorId": "31307724", "name": "T. H. Sardar"}, {"authorId": "19213055", "name": "Ahmed Rimaz Faizabadi"}, {"authorId": "48425283", "name": "Z. Ansari"}], "citations": [{"paperId": "fe4cae529bbd410d233b008f29554ff694db204e", "title": "Distributed Big Data Clustering using MapReduce-based Fuzzy C-Medoids"}, {"paperId": "e1350c9b7e106ec836502883967debbcb589d762", "title": "MapReduce-based Fuzzy C-means Algorithm for Distributed Document Clustering"}, {"paperId": "6d8b43484cbbe8fbf8866ea56b7c2da7533d3bab", "title": "Efficient Big Text Data Clustering Algorithms using Hadoop and Spark"}, {"paperId": "95b9ddf19fccd07a036a57c68746dab745b7765d", "title": "An Analysis of Distributed Document Clustering Using MapReduce Based K-Means Algorithm"}, {"paperId": "d39aebb87e2573a267b829be8fad4d18dc8cbdc9", "title": "Utilizing the buckshot algorithm for efficient big data clustering in the MapReduce model"}, {"paperId": "3922a244687529a1668f7072c1762f000d7148d7", "title": "Seed selection algorithm through K-means on optimal number of clusters"}, {"paperId": "eb8dcffe3748171344bad5acfbf537856b09d39a", "title": "Data Categorization Using Hadoop MapReduce-Based Parallel K-Means Clustering"}, {"paperId": "fd2dfa3bf3800f8883a77f23f81a2d99214dfc7f", "title": "An analysis of MapReduce efficiency in document clustering using parallel K-means algorithm"}, {"paperId": "3039d5b6664842dc8b9c0637c055b14cf5b241e6", "title": "The BigKClustering approach for document clustering using Hadoop MapReduce"}, {"paperId": "98d103dc7a2a4af9fbfbf72dbd02ea73d3fa3a8f", "title": "An evaluation of Hadoop cluster efficiency in document clustering using parallel K-means"}, {"paperId": "618040d4539e8a496fab124c66e7a45f2bd57289", "title": "An Improved K-means based Text Document Clustering using Artificial Bee Colony with Support Vector Machine"}, {"paperId": "41dfa1ac619861453c2d30f0cb29ad011199c179", "title": "An Iterative Model for Text Mining Using Big Data Technology"}]}
