{"paperId": "40af24f2cb70a1d9f7d02bb08d98fdb61cdf94e8", "publicationVenue": {"id": "6a470734-72c6-4809-a07d-d34dee0df4a1", "name": "SIGDIAL Conferences", "type": "conference", "alternate_names": ["SIGDIAL", "SIGDIAL Conf", "Annu Meet Spéc Interest Group Discourse Dialogue", "Annual Meeting of the Special Interest Group on Discourse and Dialogue"]}, "title": "Frame-oriented Summarization of Argumentative Discussions", "abstract": "Online discussions on controversial topics with many participants frequently include hundreds of arguments that cover different framings of the topic. But these arguments and frames are often spread across the various branches of the discussion tree structure. This makes it difficult for interested participants to follow the discussion in its entirety as well as to introduce new arguments. In this paper, we present a new rank-based approach to extractive summarization of online discussions focusing on argumentation frames that capture the different aspects of a discussion. Our approach includes three retrieval tasks to find arguments in a discussion that are (1) relevant to a frame of interest, (2) relevant to the topic under discussion, and (3) informative to the reader. Based on a joint ranking by these three criteria for a set of user-selected frames, our approach allows readers to quickly access an ongoing discussion. We evaluate our approach using a test set of 100 controversial Reddit ChangeMyView discussions, for which the relevance of a total of 1871 arguments was manually annotated.", "venue": "SIGDIAL Conferences", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "114-129"}, "authors": [{"authorId": "18417916", "name": "S. Syed"}, {"authorId": "2047307140", "name": "Timon Ziegenbein"}, {"authorId": "2145327410", "name": "Philipp Heinisch"}, {"authorId": "2626599", "name": "Henning Wachsmuth"}, {"authorId": "3046200", "name": "Martin Potthast"}], "citations": [{"paperId": "b563e9a945dc51d52ffeff0bcf93e4154f04655d", "title": "Argument Quality Assessment in the Age of Instruction-Following Large Language Models"}, {"paperId": "813370072963a32c6a3a371fd5000bdbf777eca3", "title": "Indicative Summarization of Long Discussions"}]}
