{"paperId": "40affe1accd915c7e24bc9b6a8395cddf52a70de", "publicationVenue": null, "title": "Apache Tez: A Unifying Framework for Modeling and Building Data Processing Applications", "abstract": "The broad success of Hadoop has led to a fast-evolving and diverse ecosystem of application engines that are building upon the YARN resource management layer. The open-source implementation of MapReduce is being slowly replaced by a collection of engines dedicated to specific verticals. This has led to growing fragmentation and repeated efforts with each new vertical engine re-implementing fundamental features (e.g. fault-tolerance, security, stragglers mitigation, etc.) from scratch. In this paper, we introduce Apache Tez, an open-source framework designed to build data-flow driven processing runtimes. Tez provides a scaffolding and library components that can be used to quickly build scalable and efficient data-flow centric engines. Central to our design is fostering component re-use, without hindering customizability of the performance-critical data plane. This is in fact the key differentiator with respect to the previous generation of systems (e.g. Dryad, MapReduce) and even emerging ones (e.g. Spark), that provided and mandated a fixed data plane implementation. Furthermore, Tez provides native support to build runtime optimizations, such as dynamic partition pruning for Hive. Tez is deployed at Yahoo!, Microsoft Azure, LinkedIn and numerous Hortonworks customer sites, and a growing number of engines are being integrated with it. This confirms our intuition that most of the popular vertical engines can leverage a core set of building blocks. We complement qualitative accounts of real-world adoption with quantitative experimental evidence that Tez-based implementations of Hive, Pig, Spark, and Cascading on YARN outperform their original YARN implementation on popular benchmarks (TPC-DS, TPC-H) and production workloads.", "venue": "SIGMOD Conference", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2015-05-27", "journal": {"name": "Proceedings of the 2015 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "144148361", "name": "Bikas Saha"}, {"authorId": "143982453", "name": "Hitesh Shah"}, {"authorId": "2056907529", "name": "S. Seth"}, {"authorId": "2065830195", "name": "Gopal Vijayaraghavan"}, {"authorId": "3021460", "name": "A. C. Murthy"}, {"authorId": "1692732", "name": "C. Curino"}], "citations": [{"paperId": "12f33fce9a1c5c4c102fbe7685dac34cc1ccd0e6", "title": "DAG-aware harmonizing job scheduling and data caching for disaggregated analytics frameworks"}, {"paperId": "cde959deaf38e5bfaeb1f66cc0b77d21d6dcd09d", "title": "QEVIS: Multi-Grained Visualization of Distributed Query Execution"}, {"paperId": "bea73f051ae6b5779468c9481d9f9ddcc2e443f5", "title": "SAC: Dynamic Caching upon Sketch for In-Memory Big Data Analytics"}, {"paperId": "8424c68702ad3852378ca95ea4deb68785dca763", "title": "Using Cloud Functions as Accelerator for Elastic Data Analytics"}, {"paperId": "44c45e1299e00b3bbf77db2c25c61bb4e1949dfc", "title": "An investigation of distributed computing for combinatorial testing"}, {"paperId": "4b8a096069c3ae9601733874ac7aaa40a7c91442", "title": "LPW: an efficient data-aware cache replacement strategy for Apache Spark"}, {"paperId": "1b1e9b482e9abe523c13dbafb6a480ad30f4f9ea", "title": "The Lannion report on Big Data and Security Monitoring Research"}, {"paperId": "870a1ac39f00d19e26ff7232b76a14a90b38fe8a", "title": "BIG TRAJECTORY DATA: A DISTRIBUTED COMPUTING PERSPECTIVE"}, {"paperId": "2ac4bbcc41e4f7e1873d2f1d9eac4809868117d8", "title": "QoS-Aware Co-Scheduling for Distributed Long-Running Applications on Shared Clusters"}, {"paperId": "e59ce42fbf9c6de756739824f4f9e8990d8277b2", "title": "GHive: accelerating analytical query processing in apache hive via CPU-GPU heterogeneous computing"}, {"paperId": "a05189ed010a2d7bebcf8382e41783814538701a", "title": "Tripod: Harmonizing Job Scheduling and Data Caching for Analytics Frameworks"}, {"paperId": "c8a162f95f118b244c505d6f2079474d2380b9b0", "title": "Performance Comparison of Technological Solutions for Spark Applications in AWS"}, {"paperId": "05250f1a9d9713f1dab6a69af596d7c3b843802e", "title": "Affinity-Aware Resource Provisioning for Long-Running Applications in Shared Clusters"}, {"paperId": "51c9ef8c9048068b0b32578d55b5039eecd64cac", "title": "Astronomical big data processing using machine learning: A comprehensive review"}, {"paperId": "7a93bfabd67bb95808e4fa88ac02fd471112f20c", "title": "A General Framework for Evaluating Robustness of Combinatorial Optimization Solvers on Graphs"}, {"paperId": "388a8cbeca59ca55398c85e61f2ae3431d3784df", "title": "A Comparative Analysis of Big Data Frameworks: An Adoption Perspective"}, {"paperId": "25a7e34f939200ed6365d26c6cc6985089c1a112", "title": "MXDAG: A Hybrid Abstraction for Emerging Applications"}, {"paperId": "cb870b8b4dcb3d021155f5902bc0285aeb722293", "title": "George: Learning to Place Long-Lived Containers in Large Clusters with Operation Constraints"}, {"paperId": "4070944c31d3ee5f557cefeaec8c89c8b9ae8b42", "title": "A Hybrid Machine Learning Approach for Performance Modeling of Cloud-Based Big Data Applications"}, {"paperId": "fbe55d61d00c6c47bc68c63e32d8a03b52a93450", "title": "Para: Harvesting CPU time fragments in Big Data Analytics"}, {"paperId": "ddf97565c3eb0524f222c1abe1a637b364fc43dc", "title": "PoBery: Possibly-complete Big Data Queries with Probabilistic Data Placement and Scanning"}, {"paperId": "def13e123abeea4ecc210eee02cf141ce0646567", "title": "SODA: A Semantics-Aware Optimization Framework for Data-Intensive Applications Using Hybrid Program Analysis"}, {"paperId": "def045b6593bf96eac804b4f92ffad14338d90b0", "title": "Research on Software Defined Programmable Strategy of Fireworks Model Oriented to Edge Computing Nodes"}, {"paperId": "45306e839a728559ca21da1efe10da10f2cf96ca", "title": "MXDAG: A Hybrid Abstraction for Cluster Applications"}, {"paperId": "18afa651c84d09594de0fc603a442f772fb10302", "title": "Cost Optimization for Big Data Workloads Based on Dynamic Scheduling and Cluster-Size Tuning"}, {"paperId": "f12930cd5f58990badc1a7c5d2749cad004cfb0e", "title": "Big data analytics for intelligent manufacturing systems: A review"}, {"paperId": "89e4e410a6394ecc4063a2d214862f7445210a4a", "title": "A Review on Big Data Optimization Techniques"}, {"paperId": "c2fa234572e8968b6e809d8d5c338183c2893a75", "title": "Apache Nemo: A Framework for Optimizing Distributed Data Processing"}, {"paperId": "2fa2fa93bdfbfcf3b7846e3f760299d3f7785301", "title": "Deploying Network Key-Value SSDs to Disaggregate Resources in Big Data Processing Frameworks"}, {"paperId": "82336295513221f4ceeca5246d664f28cfda4321", "title": "Metis: Learning to Schedule Long-Running Applications in Shared Container Clusters at Scale"}, {"paperId": "28710af7c7a9221eff07bd7daa330ea8eaa44866", "title": "Performance Analysis of Scheduling Algorithms in Apache Hadoop"}, {"paperId": "4bf42f1489e8f04c2185f55a46690f4be9fc5c94", "title": "Scaling Event Aggregation at Twitter to Handle Billions of Events per minute"}, {"paperId": "463ddb22e38e9d94da8f9bf6a3d4c8f65e1908a9", "title": "NLC: An Efficient Caching Algorithm Based on Non-critical Path Least Counts for In-Memory Computing"}, {"paperId": "06c013068d9bba8d2d0d843eaa32d401dfa8c36b", "title": "Caching Cost Model for In-memory Data Analytics Framework"}, {"paperId": "f44597be5d25b02bcaae56fbda630d466c2eac87", "title": "A Scalable Heterogeneous Big Data Framework for e-Learning Systems"}, {"paperId": "60466b387dd33502ddfefcb50e0b250e7e7b1a4f", "title": "A Survey of System Scheduling for HPC and Big Data"}, {"paperId": "a6b7b9702b93bf245ed2a422d64c050d35c46b29", "title": "A Task-Aware Fine-Grained Storage Selection Mechanism for In-Memory Big Data Computing Frameworks"}, {"paperId": "f5bc91f2245a5eed7ef3c9e528a3fbcb2947ada0", "title": "Improving resource utilization by timely fine-grained scheduling"}, {"paperId": "abbb321b4f08492aee22d3c57ab771b1c8f30e32", "title": "Think Cities: the accelerator for sustainable planning"}, {"paperId": "2cf97e7f2b0e2ae4d0e67ca233c22148e029993f", "title": "Ignis: An efficient and scalable multi-language Big Data framework"}, {"paperId": "1cd07c8f68a83fb4b0ae16c80d140982bf8c4120", "title": "TextBenDS: a Generic Textual Data Benchmark for Distributed Systems"}, {"paperId": "8f1023935a4d5cd5491231f7a6a72e54285891e6", "title": "CosmoHub: Interactive exploration and distribution of astronomical data on Hadoop"}, {"paperId": "cc640ee1e79ec2007f18b34fdc3793e43019715a", "title": "Bigflow: A General Optimization Layer for Distributed Computing Frameworks"}, {"paperId": "73e2125d2ad73225cffabd85cbb03cb0db860ea2", "title": "Importance of Data Distribution on Hive-Based Systems for Query Performance: An Experimental Study"}, {"paperId": "bb084bbb204f50c539ad53097c66b1ad448ff61a", "title": "General-Purpose vs. Specialized Data Analytics Systems: A Game of ML & SQL Thrones"}, {"paperId": "0cd3961c8bf3a3ebc29cc2cb9bbe0bec612d49da", "title": "A+ Tuning: Architecture+Application Auto-Tuning for In-Memory Data-Processing Frameworks"}, {"paperId": "077a357415395a652203575f1a073f4821a8af56", "title": "Towards a Multi-engine Query Optimizer for Complex SQL Queries on Big Data"}, {"paperId": "bf344ab9331e986cbbe89e896a1b2d4732d7e3f6", "title": "Cluster-size optimization within a cloud-based ETL framework for Big Data"}, {"paperId": "e4c3ee7c672f7b4ff12c611806c08ecd64897d3d", "title": "CS*: Approximate Query Processing on Big Data using Scalable Join Correlated Sample Synopsis"}, {"paperId": "f7fb20c234e33f9342f1559f8d6ff7f8659e4a3f", "title": "Allocation de ressources élastique pour l'optimisation de requêtes. (Elastic resource allocation for query optimization)"}, {"paperId": "10bbf28d4ca11421ef61e64bfb2c3130a3987059", "title": "Pufferfish: Container-driven Elastic Memory Management for Data-intensive Applications"}, {"paperId": "a8ebfefa1d82cf4d5ac1e96df29836d416603b81", "title": "Towards Dependency-Aware Cache Management for Data Analytics Applications"}, {"paperId": "7cbdc8cbd4e389a541a1761cf5fae977ba255041", "title": "A Survey of Big Data Machine Learning Applications Optimization in Cloud Data Centers and Networks"}, {"paperId": "55dfb8184d407298684cb88c67699ecdbb2fa6cc", "title": "A COMPARISON BETWEEN THE HADOOP AND SPARK DISTRIBUTED FRAMEWORKS IN THE CONTEXT OF REGION-GROWING SEGMENTATION OF REMOTE SENSING IMAGES"}, {"paperId": "b1c7c5637a4facdaea59c8d9ce538a65a6aed27c", "title": "Analytical composite performance models for Big Data applications"}, {"paperId": "8b15d095a1b2133384f7eab7b81bcfafce754366", "title": "Resource auto-scaling for SQL-like queries in the cloud based on parallel reinforcement learning"}, {"paperId": "380f844cd8fa4f699b660314e3de363b0824a1e4", "title": "Integration of Large-Scale Data Processing Systems and Traditional Parallel Database Technology"}, {"paperId": "6d7ae61c36b4a81bbd84d2fb9b7bb0c3645cd981", "title": "Bottleneck-Aware Task Scheduling Based on Per-Stage and Multi-ML Profiling"}, {"paperId": "b8420e0a18bf13cc9d59f7b2e7e94ac2971ae02d", "title": "Hydra: A Personalized and Context-Aware Multi-Modal Transportation Recommendation System"}, {"paperId": "213a83e61e1347ffa58da9383a4bf92f4a77a6c8", "title": "Real-time intelligent big data processing: technology, platform, and applications"}, {"paperId": "3abdcb1b7462f7cca0ab381ea2befe84e41e2e93", "title": "MEER: Online Estimation of Optimal Memory Reservations for Long Lived Containers in In-Memory Cluster Computing"}, {"paperId": "b51cca6fcf42d6e56c967144cf54a8151a3958d6", "title": "Quantitative Impact Evaluation of an Abstraction Layer for Data Stream Processing Systems"}, {"paperId": "387881afb8ce8b057edd3c4389a8962ebc0a6344", "title": "DBEst: Revisiting Approximate Query Processing Engines with Machine Learning Models"}, {"paperId": "127836fa57a52e649ebdef37a50fe0e36782d6e4", "title": "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems"}, {"paperId": "284802ea1f551d6c784b43a7bd71b2ab8a43dd13", "title": "Auto-scaling for real-time stream analytics on HPC cloud"}, {"paperId": "f9a5d11cae5e2d2936bd604af469a668d1df1304", "title": "A High-Performance Distributed Relational Database System for Scalable OLAP Processing"}, {"paperId": "615bba2131ecf6400df3d36096be35656e6b80c1", "title": "Lamda-Flow: Automatic Pushdown of Dataflow Operators Close to the Data"}, {"paperId": "ae5702427528dfac3e110ae151a663667b30ffc9", "title": "Scalable Performance Modeling and Evaluation of MapReduce Applications"}, {"paperId": "ff6cea15558b8e5b11743d163047c1c47f3a3baa", "title": "A Dependency-Aware Storage Schema Selection Mechanism for In-Memory Big Data Computing Frameworks"}, {"paperId": "4414ec7a39111148e664155e2a6f99416df4444f", "title": "AI Pro: Data Processing Framework for AI Models"}, {"paperId": "3ff6e893d1e79b2596ede28001a0f81629b6bcc1", "title": "CRA: Enabling Data-Intensive Applications in Containerized Environments"}, {"paperId": "deb3b1023aa97d164a291e64032fa3f05d566a58", "title": "Presto: SQL on Everything"}, {"paperId": "5bff54f49eeba8d1b0961424bc619a694a02103b", "title": "Apache Hive: From MapReduce to Enterprise-grade Big Data Warehousing"}, {"paperId": "8c03332288c663ac80162dcccdd6ec4985ed44e2", "title": "Dependency-Aware Network Adaptive Scheduling of Data-Intensive Parallel Jobs"}, {"paperId": "06ff626fd4951cb6ccf3286f92bca55315f4c96b", "title": "Energy efficiency optimization in big data processing platform by improving resources utilization"}, {"paperId": "3060d85dd740a8687b0834449c885d494be34db2", "title": "Big SQL systems: an experimental evaluation"}, {"paperId": "04b3194931e23bda5601dae4fc70f05539c4981b", "title": "Comparison of Platforms for Recommender Algorithm on Large Datasets"}, {"paperId": "80621619cc5919b336a389f530596a0a0f2183c4", "title": "Probery: A Probability-based Incomplete Query Optimization for Big Data"}, {"paperId": "43bb3366f35fa92e23062c089b39c6f192fdf0a2", "title": "Mira: Sharing Resources for Distributed Analytics at Small Timescales"}, {"paperId": "9ba409f3a40d9d7eca281ca8050119cc47da2285", "title": "LCRC: A Dependency-Aware Cache Management Policy for Spark"}, {"paperId": "b001e8d14ab38d1aa76fca1109721ecdca3dcbfd", "title": "Review of Graph Processing Frameworks"}, {"paperId": "ed6111b7e8d9167f230b62d114244bd300c925bf", "title": "Improving Apache Spark's Cache Mechanism with LRC-Based Method Using Bloom Filter"}, {"paperId": "97d470fc43d6f8faf96950ebb5ecf939c42e3b10", "title": "Spatiotemporal Applications of Big Data"}, {"paperId": "07aef0b1c1ee3e36433eec009b855f6a21067244", "title": "Bash Datalog: Answering Datalog Queries with Unix Shell Commands"}, {"paperId": "2816150440ae74b9c408afdad68acedd8d36b2db", "title": "The big data system, components, tools, and technologies: a survey"}, {"paperId": "12283eb5f00d8e4ab3c2e8b28eaef62acebeb4ff", "title": "BDEv 3.0: Energy efficiency and microarchitectural characterization of Big Data processing frameworks"}, {"paperId": "8a94024aa21b6110c338c683ab50310b365a5034", "title": "Performance Comparison of a Parallel Recommender Algorithm Across Three Hadoop-Based Frameworks"}, {"paperId": "b85206105603a65b3108f84ca92067f928951aca", "title": "Reference-distance Eviction and Prefetching for Cache Management in Spark"}, {"paperId": "30299915a3763f04bce9a6dd73190af3032169f1", "title": "Dynamic Models for the Formal Verification of Big Data Applications Via Stochastic Model Checking"}, {"paperId": "adf99513508448fcf6fa07b04e16c9a3dfe025b8", "title": "Unifying computing resources and access interface to support parallel and distributed computing education"}, {"paperId": "c8a4bbe4b8a17a3256427086093713979d57e5fb", "title": "Towards Selecting Best Combination of SQL-on-Hadoop Systems and JVMs"}, {"paperId": "d2f0824d5d70839eb04171e4cd754c270b64b151", "title": "Ignem: Upward Migration of Cold Data in Big Data File Systems"}, {"paperId": "1ee312df85771c0382839a7ee3b119aa6db080b0", "title": "Multiple Decisional Query Optimization in Big Data Warehouse"}, {"paperId": "ec9ec9d56b7b3f5cfc2a9004d64d235579860c4f", "title": "HDM: A Composable Framework for Big Data Processing"}, {"paperId": "084b523847d526ce908f0799ded7cb6ce3842217", "title": "Characterizing Scheduling Delay for Low-Latency Data Analytics Workloads"}, {"paperId": "12d168c4342506188c87e64850e1faa777c5febe", "title": "Apache Calcite: A Foundational Framework for Optimized Query Processing Over Heterogeneous Data Sources"}, {"paperId": "159d83b33e77638a907124376660bc744252e50a", "title": "Efficient shuffle management with SCache for DAG computing frameworks"}, {"paperId": "b68b9cb2686e41ce251461619348a93b99e71a95", "title": "A performance study of big data analytics platforms"}, {"paperId": "fb3b5250f6120719c98413a9963d2711906eea74", "title": "Ellis: Dynamically Scaling Distributed Dataflows to Meet Runtime Targets"}, {"paperId": "c7d2b86bb93e6ea147a458ed92028e7212bd5518", "title": "NVMD: Non-volatile memory assisted design for accelerating MapReduce and DAG execution frameworks on HPC systems"}, {"paperId": "3930baa2e41393a493743c860e425481acdd8145", "title": "A comparative analysis of state-of-the-art SQL-on-Hadoop systems for interactive analytics"}, {"paperId": "3701b3252876a848157496060764b958fb5da3c2", "title": "Big Social Network Data and Sustainable Economic Development"}, {"paperId": "ae3a094cea8eeb4c987d7897e88eb74cbf98a815", "title": "Apache REEF"}, {"paperId": "b563a45f9c0e78f99eeb5459483682d82ca5ea99", "title": "Distributed data stream processing and edge computing: A survey on resource elasticity and future directions"}, {"paperId": "af2870e2a9434fe9956c78a812258a48ed0dcfb8", "title": "Resource Elasticity for Distributed Data Stream Processing: A Survey and Future Directions"}, {"paperId": "80fa0ad465a3c08ba922709caf1a8cbcf6638191", "title": "LERC: Coordinated Cache Management for Data-Parallel Systems"}, {"paperId": "98ac6ab21def7f6e1b80c0be62ccfc0b594bfc57", "title": "Network-Adaptive Scheduling of Data-Intensive Parallel Jobs with Dependencies in Clusters"}, {"paperId": "1c476eba0f306b356274a0f48c0dbf9b7df9ceea", "title": "Distributed parallel optimization of hyperspectral image classification based on spatial correlation regularized sparse representation"}, {"paperId": "8f202472cda3cf16f4e4ffb1971ee64f9d54824c", "title": "Speculative Slot Reservation: Enforcing Service Isolation for Dependent Data-Parallel Computations"}, {"paperId": "076d7a9baaf4ab9aa0cbb0b15bd450b8370b6604", "title": "Fluid Petri Nets for the Performance Evaluation of MapReduce and Spark Applications"}, {"paperId": "8713e32be6e5e08e0da42d681c7abff53b417185", "title": "Scalable System Scheduling for HPC and Big Data"}, {"paperId": "edcdc1382deff03c458d5defb2035439f85db0bd", "title": "Scalable Informative Rule Mining"}, {"paperId": "2a5861f8f57f602713bbaff8e61be7f0e244fae5", "title": "F2: Reenvisioning Data Analytics Systems"}, {"paperId": "30fa291345c0af88e49770af96cfebb761dfec03", "title": "Whiz: A Fast and Flexible Data Analytics System"}, {"paperId": "90114c58d2dd0269b28e449a84194885652e0a3d", "title": "Fast and Flexible Data Analytics with F2"}, {"paperId": "c86b9ae3872242383d0791f59d388a049d72ad07", "title": "LRC: Dependency-aware cache management for data analytics clusters"}, {"paperId": "a873933b2a7eeb38b64402131a1033556547ec6e", "title": "Uma comparação entre MapReduce e Tez para segmentação de imagens em ambientes de computação em nuvem"}, {"paperId": "b1f4694b275fbf7bb9bd42a2ebe7d253dc6928cb", "title": "Adapting scientific computing algorithms to distributed computing frameworks"}, {"paperId": "517880696e03be3fd7f923af9308f674cb6a2bef", "title": "A Fast Synthetic Aperture Radar Raw Data Simulation Using Cloud Computing"}, {"paperId": "062fcccd907f9b430c489b7d761f48e6c10c5241", "title": "Cluster management system design for big data infrastructures"}, {"paperId": "6bf728c86427d2c57ad7a2d070f7494c0e77377c", "title": "Correctness and Performance for Stateful Chained Network Functions"}, {"paperId": "3f6f1bfd91698090f9052158edc8968291606d51", "title": "StreamNF: Performance and Correctness for Stateful Chained NFs"}, {"paperId": "33b0e1be7e9132ff1e1e5b92d1f397c9a6c4a3a2", "title": "CPU performance in the age of big data : a case study with Hive"}, {"paperId": "01b54e85d5b02ad6af205106739a409a105fee93", "title": "History-Based Harvesting of Spare Cycles and Storage in Large-Scale Datacenters"}, {"paperId": "7e74ea151efcdcfecffdbeaec0728f9ac1f80389", "title": "TR-Spark: Transient Computing for Big Data Analytics"}, {"paperId": "cb94b14716b94d892707d5653939959b6d23f5f8", "title": "Firework: Big Data Sharing and Processing in Collaborative Edge Environment"}, {"paperId": "eb7f8017043cc4be36b1460306c8bda709ddca33", "title": "Partial Materialization for Data Integration in SQL-on-Hadoop Engines"}, {"paperId": "2a60c4561f0b1dbbf34d1e4fbfb4d7904bad66bf", "title": "Big Data 2.0 Processing Systems: Taxonomy and Open Challenges"}, {"paperId": "cfd7fbef3527c41debc5a7a98a66d4de157c4791", "title": "Coded Distributed Computing: Straggling Servers and Multistage Dataflows"}, {"paperId": "803445dfc1c555f90f1e774970976962ea310d99", "title": "A Virtualization-Based Hybrid Storage System for a Map-Reduce Framework"}, {"paperId": "f8e24eddc72e1775b9440b22528d1a42b0e1758e", "title": "Apache Flink in current research"}, {"paperId": "4562404f32057d884a1a04e132513bba0871ce87", "title": "A Scalable Framework for Wireless Distributed Computing"}, {"paperId": "bb292a69117d0f797f9e7c818ed9b06ce41cf953", "title": "High-Responsive Scheduling with MapReduce Performance Prediction on Hadoop YARN"}, {"paperId": "41878982eaaca9328e8c69725bed96940f45e688", "title": "Adaptive Block and Batch Sizing for Batched Stream Processing System"}, {"paperId": "2583c913ad2be00feb063a23f3735232e0ac0ece", "title": "Stage Aware Performance Modeling of DAG Based in Memory Analytic Platforms"}, {"paperId": "fa8156e6c6089d5dc66a9dd31a1e7084887cc832", "title": "Performance analysis of container-based hadoop cluster: OpenVZ and LXC"}, {"paperId": "20f0639f904957b0da59b69b3a3e70290081226c", "title": "Efficiency of Stream Processing Engines for Processing BIGDATA Streams"}, {"paperId": "d19059600752f284f5f715675cb401ecc3ca7879", "title": "A Fundamental Tradeoff Between Computation and Communication in Distributed Computing"}, {"paperId": "e6139538db43919443fbf0e46cde1a4a193519d8", "title": "Fuzzy Based Clustering Algorithms to Handle Big Data with Implementation on Apache Spark"}, {"paperId": "379cf1659e3b9b92413b4fca878c8861ae859db4", "title": "Computing at Massive Scale: Scalability and Dependability Challenges"}, {"paperId": "0668d98e891a24047733b814dd4b1f911f04054f", "title": "Building Pipelines for Heterogeneous Execution Environments for Big Data Processing"}, {"paperId": "4fd3aeb7d84eac614c9c7ccce00e1c76ce20aa52", "title": "Composable and efficient functional big data processing framework"}, {"paperId": "51716f1baf9aa29e4701f9e328487aa6e4660112", "title": "Evolution from Shark to Spark SQL: Preliminary Analysis and Qualitative Evaluation"}, {"paperId": "82e5b2ccf7ce83239a369de9e26aaf614eba7e7d", "title": "Tutorial: SQL-on-Hadoop Systems"}, {"paperId": "fa9518dd3ff99514319730f5808d9a45a6fc15fb", "title": "REEF: Retainable Evaluator Execution Framework"}, {"paperId": "7e7c3d5aab00d5374e53b1b5eabc4f519d2d65fd", "title": "Finding Suitable Activity Clusters for Decomposed Process Discovery"}, {"paperId": "2e2c56325c3caac544285f46187c33439b211962", "title": "ROCO: A General Framework for Evaluating Robustness of Combinatorial Optimization Solvers on Graphs"}, {"paperId": "0c50e604f2ccc533257c80f3a1fef6d9bcd5ae0b", "title": "Mind Your Solver! On Adversarial Attack and Defense for Combinatorial Optimization"}, {"paperId": "6ac1749272c9d2db025a6e26b3166555382db5bc", "title": "Recent Advances in Data Engineering for Networking"}, {"paperId": "725046c474ff5523d267a8dc3177b25844d3eacd", "title": "Whiz: Data-Driven Analytics Execution"}, {"paperId": "805381ca4d70a9d22e3ab973f1a0aba6488b1b05", "title": "Fangorn: Adaptive Execution Framework for Heterogeneous Workloads on Shared Clusters"}, {"paperId": "108983b5bfb6b2fbbc18bb6f80e1cf483e6dc7d7", "title": "Efficient shuffle management for DAG computing frameworks based on the FRQ model"}, {"paperId": "21efd5dac6cdb9b82da37ee31d00f2777150ca4f", "title": "Data Stream Summary in Big Data Context: Challenges and Opportunities"}, {"paperId": "f17c1aa4c9330e2c1a2fb7f8bdfaeaec898df9dd", "title": "Execution Repair for Spark Programs by Active Maintenance of Partition Dependency"}, {"paperId": "202d991c9c273187c6f26a3f8b8ea48f9baae39c", "title": "Improving the Efficiency of Heterogeneous Clouds"}, {"paperId": "8c1f157b9ea8901bdcaa7d1414c7cc7dec536210", "title": "Sol: Fast Distributed Computation Over Slow Networks"}, {"paperId": "d5a7a0ec0230cc8af324192e7bb2f23c39687e8a", "title": "Big Data 2.0 Processing Systems: A Systems Overview"}, {"paperId": "a69dd54eb0fd367db4e07219dffcc4738f6eff01", "title": "Large-Scale Machine/Deep Learning Frameworks"}, {"paperId": "5911ba22ffa0a22d3d003dbebfc04e0f57743c7d", "title": "Large-Scale Graph Processing Systems"}, {"paperId": "a68433b9ae7560e05de19f2d77aea976d1e63478", "title": "Large-Scale Processing Systems of Structured Data"}, {"paperId": "df007e96e11af2737d22189f97f83b07e2b2fb50", "title": "General-Purpose Big Data Processing Systems"}, {"paperId": "b50352566ebe5c34a084d186df0986a14aa60020", "title": "Large-Scale Stream Processing Systems"}, {"paperId": "4294e2d1990c4b307142ba57d96211b86cc8bd61", "title": "Adaptive Online Estimation of Thrashing-Avoiding Memory Reservations for Long-Lived Containers"}, {"paperId": "aaf4304bc3d1857ddbf08aeb8e7b87a7d3dfa90b", "title": "Optimistic scheduling with service guarantees"}, {"paperId": "2980fbcd928f26efc17f2f9cc1930b7d6a9acfa8", "title": "Conclusions and Outlook"}, {"paperId": "94b027348d9b9b31977177f513fa068c981189d9", "title": "Introduction"}, {"paperId": "bebf9a7948ba46602bd5c4063fb7ca5904bec4f6", "title": "Efficient Workload Colocation in Modern Data Centers"}, {"paperId": "16d2632cc502504192d868ff148ac7c002e204e2", "title": "Tangram: Bridging Immutable and Mutable Abstractions for Distributed Data Analytics"}, {"paperId": "8fbd3cbaeb8067cbc8021754d50039692d8a10fd", "title": "Apache Nemo: A Framework for Building Distributed Dataflow Optimization Policies"}, {"paperId": "5f5d8bb054616264124eb7cce8f8490d804d27dd", "title": "2018 Imperial College Computing Student Workshop, ICCSW 2018, September 20-21, 2018, London, United Kingdom"}, {"paperId": "eb2790f3ed7fb41f225dff884be680940d2a76be", "title": "VM Common Runtime for Applications ( CRA ) Scan Analytics Streaming Pipelines Iterative ML ... HDFS User Applications Micro-services"}, {"paperId": "1b8d6aad1256d867b194e14962497690f0a98b6e", "title": "Caching in the Multiverse Mania"}, {"paperId": "1a75c3592c61a83afad995652994910d2a840a4f", "title": "High-level Graphical Programming for Big Data Applications"}, {"paperId": "d235f90caf3e0ab390a92b9fd1be3f4dfbee4820", "title": "Data-Driven Intelligent Scheduling For Long Running Workloads In Large-Scale Datacenters"}, {"paperId": "33747b4c84ced859ac84649366fadc5e9c29d1ef", "title": "Scalable Data Processing System for Satellite Data Mining"}, {"paperId": "e2b457848337a681672065aa91d2bea3fcb11982", "title": "Hive"}, {"paperId": "e1067b71d70dca7263b1c115bc8cc8317d77db2f", "title": "Modular Class Data Sharing in OpenJDK"}, {"paperId": "91ac9f41085698e5e2e95c9841dc2897ade000ce", "title": "Resource scheduling for quality-critical applications on cloud infrastructure"}, {"paperId": "9665ffb506899dd7c303ddb1be53fb76abe47a3d", "title": "Big Data Data Management Systems performance analysis using Aloja and BigBench"}, {"paperId": "f03a4a972ca050f18fb6fc200c3ecc6b06e3c1f5", "title": "Anatomy of machine learning algorithm implementations in MPI, Spark, and Flink"}, {"paperId": "de0c8235c856b1ca680c90b7a15cd0f84a3f3062", "title": "Semantic Caching Framework: An FPGA-Based Application for IoT Security Monitoring"}, {"paperId": "499884ddac793d8331c9b31935788db5de714fef", "title": "Technical Report: Answering Datalog Queries with Unix Shell Commands"}, {"paperId": "917f15484a5d4da002148276801030d57a95ea47", "title": "Semantic caching framework, an application to FPGA-based application for IoT security monitoring"}, {"paperId": "364cb80c5f0753e3df82db7c715e1151b7fe508b", "title": "Dynamic resource allocation for distributed dataflows"}, {"paperId": "487b40b9ca5c55ed1fcc6785fae51a1f26e12d9d", "title": "Architecting Data Centers for High Efficiency and Low Latency"}, {"paperId": "6e1766ac3a4c426884d39ae2ae15d7354d98991e", "title": "Evaluation and optimization of Big Data Processing on High Performance Computing Systems"}, {"paperId": "ea80105faddbaa5f786ab1216c4d9870fe4e5cda", "title": "System Support For Stream Processing In Collaborative Cloud-Edge Environment"}, {"paperId": "25a0e80f94318b31713b4def99a20ec8f42db65c", "title": "SQL Analytics on Big Data"}, {"paperId": "25003bf8bb6882f8ddd82567164c68808c3adc15", "title": "Scaling Distributed Hierarchical File Systems Using NewSQL Databases"}, {"paperId": "767a1c95e257c217cb31df2ffdb94dda5295bd05", "title": "Performance Tuning and Evaluation of Iterative Algorithms in Spark"}, {"paperId": "2caac402de5303c7d85c4aaa395a358254b11ef0", "title": "SQL on Hops"}, {"paperId": "3aa0e9578b2d8a482e4720f4a5ff08f78b487a52", "title": "Leaky Buffer: A Novel Abstraction for Relieving Memory Pressure from Cluster Data Processing Frameworks"}, {"paperId": "6e6f8ebed768dd936fe9ac1d537f5ada5953c03e", "title": "In-Memory Parallel Processing of Massive Remotely Sensed Data Using an Apache Spark on Hadoop YARN Model"}, {"paperId": "2542232e9769399517dac3c863791cf732f3812d", "title": "Performance Comparison of Apache Spark and Tez for Entity Resolution"}, {"paperId": "6b9334e099770bb5e26e408d2bb238cd613afd71", "title": "A case study of tuning MapReduce for efficient Bioinformatics in the cloud"}, {"paperId": "ecb589ed4e1b10a2ef1926f67c636d27434e0e77", "title": "Improving Real Time Tuning on YARN by Vı́ctor"}, {"paperId": "a533976b252e4faa6cdb1466bb3d56660862615c", "title": "ApplicationEllis Resource Manager Cluster Container Container Container Container App Client App Master Core App Worker App WorkerApp Worker Workload History Bell"}, {"paperId": "79c4607648613f00afc4bd5c9558db8fd76e4028", "title": "Hi-WAY: Execution of Scientific Workflows on Hadoop YARN"}, {"paperId": "e1080fb633eb06e22e60711b5f867eb12f95d236", "title": "Building Efficient Large-Scale Big Data Processing Platforms"}, {"paperId": "04230b7040043fc714b926a5108d82d655b37550", "title": "Adaptive Resource Management for Distributed Data Analytics"}, {"paperId": "137c52b153cf93077f268faecceeaaa987929ff9", "title": "Urban Dynamic Estimation Using Mobile Phone Logs and Locally Varying Anisotropy"}, {"paperId": "a37c962f09d0db532a4febbd7ff96ce8d62a1f42", "title": "Scalable data management and processing for genomic computing"}, {"paperId": "2c166bd85ae5b3aaeef9fb36aac1d3e36a330954", "title": "Apache Avro , etc Data Aggregation Messaging Systems Queueing Systems Publish-Subscribe Messaging Stream Processing Data Stream Processing Engines Complex Event-Processing Frameworks IoT Hubs Delivery Web Interfaces Dashboards"}, {"paperId": "4d7f801099d287d3dd1548222760546b3de13d01", "title": "Designing and Modeling High-Performance MapReduce and DAG Execution Framework on Modern HPC Systems"}, {"paperId": "ad4dade5730596fc549d982d6eef83614f48ad87", "title": "Methods to improve applicability and efficiency of distributed data-centric compute frameworks"}, {"paperId": "2841e60dc43eb09f84f875024de059790bb84aff", "title": "ScaR: Towards a Real-Time Recommender Framework Following the Microservices Architecture"}, {"paperId": "9278b8e5813948c51b288b9929784672682988da", "title": "Apache flink : Stream and batch processing in a single engine"}, {"paperId": "2234129b45e9e2ea592e5f92c09623167ee44394", "title": "Apache Flink™: Stream and Batch Processing in a Single Engine"}, {"paperId": "6d7a07b60fd6bcb997ab92bdd257503166c96762", "title": "2016 Ieee International Conference on Big Data (big Data) Identifying Performance Bottlenecks in Hive: Use of Processor Counters"}, {"paperId": "c05af9286bd306bf148818428f7502edcdaa1aa7", "title": "Blaze: Holistic Caching for Iterative Data Processing"}]}
