{"paperId": "40b0dcfcc08a54b3b08eff12cdf693b300d02cd1", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "A Survey on Threat Hunting in Enterprise Networks", "abstract": "With the rapidly evolving technological landscape, the huge development of the Internet of Things, and the embracing of digital transformation, the world is witnessing an explosion in data generation and a rapid evolution of new applications that lead to new, wider, and more sophisticated threats that are complex and hard to be detected. Advanced persistence threats use continuous, clandestine, and sophisticated techniques to gain access to a system and remain hidden for a prolonged period of time, with potentially destructive consequences. Those stealthy attacks are often not detectable by advanced intrusion detection systems (e.g., LightBasin attack was detected in 2022 and has been active since 2016). Indeed, threat actors are able to quickly and intelligently alter their tactics to avoid being detected by security defense lines (e.g., prevention and detection mechanisms). In response to these evolving threats, organizations need to adopt new proactive defense approaches. Threat hunting is a proactive security line exercised to uncover stealthy attacks, malicious activities, and suspicious entities that could circumvent standard detection mechanisms. Additionally, threat hunting is an iterative approach to generate and revise threat hypotheses endeavoring to provide early attack detection in a proactive way. The proactiveness consists of testing and validating the initial hypothesis using various manual and automated tools/techniques with the objective of confirming/refuting the existence of an attack. This survey studies the threat hunting concept and provides a comprehensive review of the existing solutions for Enterprise networks. In particular, we provide a threat hunting taxonomy based on the used technique and a sub-classification based on the detailed approach. Furthermore, we discuss the existing standardization efforts. Finally, we provide a qualitative discussion on current advances and identify various research gaps and challenges that may be considered by the research community to design concrete and efficient threat hunting solutions.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "2299-2324", "volume": "25"}, "authors": [{"authorId": "39531452", "name": "Boubakr Nour"}, {"authorId": "1680923", "name": "M. Pourzandi"}, {"authorId": "1685782", "name": "M. Debbabi"}], "citations": [{"paperId": "21d152743513ae622d11aa927b29c7f49062e608", "title": "A sustainable and trusted solution for IoT-based federated learning using feedback behavior"}, {"paperId": "1891112cf638e8e50109a07cafbfd8b05fdfef5f", "title": "On the Benefits of Vulnerability Data Consolidation in Application Security"}, {"paperId": "4597ee83a6d3419722bdedb13425638d47a4d705", "title": "Countermeasure Strategies to Address Cybersecurity Challenges Amidst Major Crises in the Higher Education and Research Sector: An Organisational Learning Perspective"}, {"paperId": "dd498ef56bfa3b949fdf6781ff1eff4546eb546a", "title": "A Modular Approach to Automatic Cyber Threat Attribution using Opinion Pools"}, {"paperId": "226503ee6d1e66dc8590124f59543e5ef98c44a0", "title": "Threat Trekker: An Approach to Cyber Threat Hunting"}, {"paperId": "cbbe989337706934f2c15512fb6398e52eae6e90", "title": "HuntGPT: Integrating Machine Learning-Based Anomaly Detection and Explainable AI with Large Language Models (LLMs)"}]}
