{"paperId": "40b41ee1cebb34650ffea75c5da6c1f9edc61e40", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "VID-WIN: Fast Video Event Matching With Query-Aware Windowing at the Edge for the Internet of Multimedia Things", "abstract": "Efficient video processing is a critical component in many IoMT applications to detect events of interest. Presently, many window optimization techniques have been proposed in event processing with an underlying assumption that the incoming stream has a structured data model. Videos are highly complex due to the lack of any underlying structured data model. Video stream sources, such as CCTV cameras and smartphones are resource-constrained edge nodes. At the same time, video content extraction is expensive and requires computationally intensive deep neural network (DNN) models that are primarily deployed at high-end (or cloud) nodes. This article presents VID-WIN, an adaptive 2-stage allied windowing approach to accelerate video event analytics in an edge-cloud paradigm. VID-WIN runs parallelly across edge and cloud nodes and performs the query and resource-aware optimization for state-based complex event matching. VID-WIN exploits the video content and DNN input knobs to accelerate the video inference process across nodes. This article proposes a novel content-driven microbatch resizing, query-aware caching, and microbatch-based utility filtering strategy of video frames under resource-constrained edge nodes to improve the overall system throughput, latency, and network usage. Extensive evaluations are performed over five real-world data sets. The experimental results show that VID-WIN video event matching achieves ${\\sim } 2.3\\times $ higher throughput with minimal latency and ~99% bandwidth reduction compared to other baselines while maintaining query-level accuracy and resource bounds.", "venue": "IEEE Internet of Things Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-27", "journal": {"name": "IEEE Internet of Things Journal", "pages": "10367-10389", "volume": "8"}, "authors": [{"authorId": "9220510", "name": "Piyush Yadav"}, {"authorId": "1811412083", "name": "Dhaval Salwala"}, {"authorId": "1724027", "name": "E. Curry"}], "citations": [{"paperId": "b804b0459f81b6f02c387df03503d8b7e29a37d8", "title": "Towards Open World Event Processing: A Paradigm and Research Agenda for Event Processing for the Internet of Multimedia Things (Vision Paper)"}, {"paperId": "eb0059e7b58f105e321adce1e01fdcdb70a81a43", "title": "E-Talk: Accelerating Active Speaker Detection with Audio-Visual Fusion and Edge-Cloud Computing"}, {"paperId": "6dfd70a9de57a2fecddd22d03d359bded0c01718", "title": "MPDM: A Multi-Paradigm Deployment Model for Large-Scale Edge-Cloud Intelligence"}, {"paperId": "c582fd994e805acd3a029b59ba54b7dcaf5b3967", "title": "Real-Time Detection, Recognition, and Surveillance using Drones"}, {"paperId": "7bcd70ad01a8ea93f243aacbf558fc5a5fa9d117", "title": "SmartFilter: An Edge System for Real-Time Application-Guided Video Frames Filtering"}, {"paperId": "c85e2be19eb6b4afa93b9a38f28bb09c74ba3dab", "title": "MavVStream: Extending Database Capabilities for Situation Monitoring Using Extracted Video Contents"}, {"paperId": "b88ddbb19e59f3e23c95441dfe59ff476e851d05", "title": "OpenPubSub: Supporting Large Semantic Content Spaces in Peer-to-Peer Publish/Subscribe Systems for the Internet of Multimedia Things"}, {"paperId": "22d8cc0af47ee76af11b46a4216c8a230ca59d7c", "title": "GNOSIS- query-driven multimodal event processing for unstructured data streams"}, {"paperId": "b2ee20e31e0ad28b3073363c72972e82c495adaf", "title": "QoS Strategies for Wireless Multimedia Sensor Networks with Energy- Efficient\nRouting Techniques & QoS Assurances"}, {"paperId": "564644ef370f228b26e23775cc432425e5fd4451", "title": "Train++: An Incremental ML Model Training Algorithm to Create Self-Learning IoT Devices"}, {"paperId": "f35630a1abab827f5d73a6845a99f7444ac71e84", "title": "Query-Driven Video Event Processing for the Internet of Multimedia Things"}]}
