{"paperId": "40b7626260f37b5fe2a6a7647a76674dc58d5819", "publicationVenue": null, "title": "A Survey on Integrated Sensing, Communication, and Computing Networks for Smart Oceans", "abstract": "The smart ocean has been regarded as an integrated sensing, communication, and computing ecosystem developed for connecting marine objects in surface and underwater environments. The development of the smart ocean is expected to support a variety of marine applications and services such as resource exploration, marine disaster rescuing, and environment monitoring. However, the complex and dynamic marine environments and the limited network resources raise new challenges in marine communication and computing, especially for these computing-intensive and delay-sensitive tasks. Recently, the space–air–ground–sea integrated networks have been envisioned as a promising network framework to enhance the communication and computing performance. In this paper, we conduct a comprehensive survey on the integrated sensing, communication, and computing networks (ISCCNs) for smart oceans based on the collaboration of space–air–ground–sea networks from four domains (i.e., space layer, aerial layer, sea surface layer, and underwater layer), and five aspects (i.e., sensing-related, communication-related, computation-related, security-related, and application-related). Specifically, we provide the key technologies for the ISCCNs in smart oceans, and introduce the state-of-the-art marine sensing, communication, and computing paradigms. The emerging challenges with the potential solutions of the ISCCNs for smart oceans are illustrated to enable the intelligent services. Moreover, the new applications for the ISCCNs in smart oceans are discussed, and potential research directions in smart oceans are provided for future works.", "venue": "J. Sens. Actuator Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-26", "journal": {"name": "J. Sens. Actuator Networks", "pages": "70", "volume": "11"}, "authors": [{"authorId": "51064894", "name": "Minghui Dai"}, {"authorId": "2154898504", "name": "Yang Li"}, {"authorId": "47471151", "name": "Peichun Li"}, {"authorId": "2160043582", "name": "Yuan Wu"}, {"authorId": "144331823", "name": "L. Qian"}, {"authorId": "2113937591", "name": "Bin Lin"}, {"authorId": "2072597704", "name": "Zhou Su"}], "citations": [{"paperId": "fc484dbd175c698f1ac65f5e940b4183920d6d1b", "title": "AUV-aided computing offloading for multi-tier underwater computing: A Stackelberg game learning approach"}, {"paperId": "124471c1e724218b738fb22ef7d67001b5cfe340", "title": "A deep reinforcement learning resource allocation strategy for integrated sensing, communication and computing"}, {"paperId": "6cddf21201906dc29bfe177679478e3c4fef44e7", "title": "Unlocking the Ocean 6G: A Review of Path-Planning Techniques for Maritime Data Harvesting Assisted by Autonomous Marine Vehicles"}, {"paperId": "72e107a4cb1fce889c52659943917d5921f13a63", "title": "Multi-Auv Collaborative Data Collection in Integrated Underwater Acoustic Communication and Detection Networks"}, {"paperId": "ee0812a82f448d2f8335e4544b88367a026adb79", "title": "Neighbor Discovery with Directional Transmission in Integrated Sensing and Communication for Underwater Acoustic Networks"}, {"paperId": "4c4af5f19100a5a73eadc9c07f3dd66edf8bd2d4", "title": "Design of a Mixed Reality System for Simulating Indoor Disaster Rescue"}]}
