{"paperId": "40cbbd32677a0ecec508dc536f20a95b1e2e75ea", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Message Queuing Telemetry Transport (MQTT) Security: A Cryptographic Smart Card Approach", "abstract": "The Message Queuing Telemetry Transport (MQTT) protocol is one of the most extended protocols on the Internet of Things (IoT). However, this protocol does not implement a strong security scheme by default, which does not allow a secure authentication mechanism between participants in the communication. Furthermore, we cannot trust the confidentiality and integrity of data. Lightweight IoT devices send more and more sensible data in areas of Smart Building, Smart City, Smart House, Smart Car, Connected Car, Health Care, Smart Retail, Industrial IoT (IIoT), etc. This makes the security challenges in the protocols used in the IoT particularly important. The standard of MQTT protocol strongly recommends implement it over Transport Layer Security (TLS) instead of plain TCP. Nonetheless, this option is not possible in most lightweight devices that make up the IoT ecosystem. Quite often, the constrained resources of IoT devices prevent the use of secure asymmetric cryptography algorithms implemented by themselves. In this article, we propose making a security schema in MQTT protocol using Cryptographic Smart Cards, for both challenges, the authentication schema and the trusted data confidentiality and data integrity. We carry out this security schema without modifying the standard protocol messages. And finally, we present a time results experiment using an example implementation model with JavaCard library.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "115051-115062", "volume": "8"}, "authors": [{"authorId": "1789779298", "name": "Eduardo Buetas Sanjuan"}, {"authorId": "2085602946", "name": "Ismael Abad Cardiel"}, {"authorId": "1733207", "name": "J. A. Cerrada"}, {"authorId": "1749938", "name": "C. Cerrada"}], "citations": [{"paperId": "50a322a61c5adf7f85078f2ff99523f274648773", "title": "A Demand Forecasting Strategy Based on a Retrofit Architecture for Remote Monitoring of Legacy Building Circuits"}, {"paperId": "c192b89e70f850c2a9eecdeed32fd246c1de6966", "title": "MARAS: Mutual Authentication and Role-Based Authorization Scheme for Lightweight Internet of Things Applications"}, {"paperId": "036d74d48bd929a2b4cfef45427112b6993fc2a2", "title": "Internet of Things Based Secured Data Transmission Protocol for Agriculture Application"}, {"paperId": "25866aa3b66820b31de00723f04c72769ccaa2fe", "title": "Exploring The Viability And Effectiveness of Lightweight Cryptographic Techniques in Enhancing The Iot Data Security of Smart Cities"}, {"paperId": "4c2523e64a919e58a6d2fbdc00afd58337eec159", "title": "Structured text programming to visualize the distribution of packages on a conveyor"}, {"paperId": "ff4e691980415c4aa0b767788ae72b461adf6094", "title": "In-situ crack and keyhole pore detection in laser directed energy deposition through acoustic signal and deep learning"}, {"paperId": "c9a57a0d46ffce85cb23dc84b8b34c7af5bb2a74", "title": "DATA TRANSMISSION USING SECURE HYBRID TECHNIQUES FOR SMART ENERGY METERING DEVICES"}, {"paperId": "b1883921b7ad172fb2150be871a44a583839761b", "title": "Reliable Informational Data and Secured Deviation Notification over Networks Using IOT"}, {"paperId": "feb2510148e6a9639c303303fe36d5457e1061cf", "title": "Building a Modern Microservices Ecosystem for Environmental Monitoring using IoT Sensors."}, {"paperId": "b9dbb076ff89c69b49644eef4e309754dabcd4c7", "title": "MQTT based Push to talk application for Retail Stores"}, {"paperId": "c8055b7bf6ae6ba7e1f6e6b0aad8eb27d4baee4e", "title": "Applications of IoT for optimized greenhouse environment and resources management"}, {"paperId": "d3064a9a8fb3ce8d27edd997cb4d3a588e92a3ef", "title": "A Flexible, Wearable, and Wireless Biosensor Patch with Internet of Medical Things Applications"}, {"paperId": "02b9e9f5f9a9caf4f0e4aa231b649cdf9624be3a", "title": "A Novel Strategy for Smart Building Convergence Based on the SmartLVGrid Metamodel"}, {"paperId": "cbe3179abf4423e651f0547221c8e00d9a677c22", "title": "IoT and Cloud Computing in Health-Care: A New Wearable Device and Cloud-Based Deep Learning Algorithm for Monitoring of Diabetes"}, {"paperId": "0c643c88d6c32f1ce6324ebe1a6723ba64147b2a", "title": "Designing Multi-Layer Security Using Chaotic Map in Cloud Environment"}, {"paperId": "c946b0008a0a06078d8a19e117f520d1c5d7b580", "title": "SCB-HC-ECC–Based Privacy Safeguard Protocol for Secure Cloud Storage of Smart Card–Based Health Care System"}, {"paperId": "9ad150cd11a73acda76fb656fa28693d5564a514", "title": "A Secure Internet of Things Smart Home Network: Design and Configuration"}, {"paperId": "313a06c46823b87b859dce55aeafa766585fb809", "title": "Stimulus-response control strategy based on autonomous decentralized system theory for exploitation of flexibility by virtual power plant"}, {"paperId": "da0a12f496f0566f05eb64f7c88b6ff1eccdfbfd", "title": "A Review on the Study on MQTT Security Challenge"}, {"paperId": "18335c8d291de2d6fdb91915a1bacaf3a446513a", "title": "Privacy and Security in Distributed Learning: A Review of Challenges, Solutions, and Open Research Issues"}, {"paperId": "783b5f98813c7c6ed42195d47eba1d124116a40d", "title": "End-to-End Protection of IoT Communications Through Cryptographic Enforcement of Access Control Policies"}, {"paperId": "2dfdbdc192aad36a430251f31ae0f93211a052fb", "title": "SENMQTT-SET:An Intelligent Intrusion Detection in IoT-MQTT Networks Using Ensemble Multi Cascade Features"}, {"paperId": "aa1db552af782953588f3cc5aa7ff2d678de78cf", "title": "Security in the Internet of Things Application Layer: Requirements, Threats, and Solutions"}, {"paperId": "233db71b1b3f4493e691526c7ca1dfee56248061", "title": "Hardware security for IoT identity assurance"}]}
