{"paperId": "40ceb4c1a9a8abf9f50381c6afee7df0e009f029", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Unlocking the Potential of Competency Exam Data with Machine Learning: Improving Higher Education Evaluation", "abstract": "In Jordanian higher education institutions, a competency exam was developed to ensure that students had the ability to attain particular competence levels. The results of the competency examination are one of the measures used as key performance indicators (KPIs) evaluating the quality of academic programs and universities. There are numerous evaluation methods for students’ performances based on the academic achievement of the pupils, including the application of conventional statistical approaches and machine learning. The objective of this paper is to develop a framework to help decision-makers and universities evaluate academic programs using ML by identifying programs and learning outcomes that need to be established by analyzing competency exam data. The developed framework can also reduce exam costs by substituting machine learning algorithms for the actual execution of the exam. We have created a dataset that can assist academics with their study; the dataset includes demographic and academic data about students, such as their gender, average university degree, type of university, and outcomes on the competency exam based on their level and competencies. Experiments supported the claim that models trained using samples from the student sub-dataset outperform models constructed using samples from the entire dataset. In addition, the experiments demonstrated that ML algorithms are an effective tool for recognizing patterns in student performance. Experiments demonstrated that no single ML model outperforms other ML models. However, the MLP model generates more accurate models, making them more beneficial for developing robust frameworks.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-16", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2212251807", "name": "Ala Smadi"}, {"authorId": "2377898", "name": "Ahmad Al-qerem"}, {"authorId": "70363868", "name": "Ahmad Nabot"}, {"authorId": "2107339", "name": "Issam Jebreen"}, {"authorId": "24074620", "name": "A. Aldweesh"}, {"authorId": "2244103830", "name": "Mohammad Alauthman"}, {"authorId": "2158754531", "name": "Awad M. Abaker"}, {"authorId": "2212251801", "name": "Omer Radhi Al Zuobi"}, {"authorId": "2212248174", "name": "Musab B. Alzghoul"}], "citations": [{"paperId": "62bf26aaf8e44a9c6e535715f7b7aa3bbdb9db67", "title": "Predicting open education competency level: A machine learning approach"}]}
