{"paperId": "40db1f2a9cbd293bb68290670221e94fd6628610", "publicationVenue": null, "title": "Map Metadata: the Basis of the Retrieval System of Digital Collections", "abstract": "The article presents research on the evaluation of hidden map metadata. A hidden map is a map being part of a book that illustrates certain facts described in the book (e.g., military campaigns, political processes, migrations). The evaluation regards their completeness. Metadata completeness is the degree to which objects are described using all metadata elements. The analysis took into account the metadata of archival maps accessed via the GeoPortOst geoportal. Over 3000 hidden maps from the period 1572–2018 were analyzed, and the map set was divided into 8 collections. The main purpose of cartographers and librarians is to facilitate understanding of the relationship between individual information (librarians) and spatial data (cartographers). To this end, the research focused on the kind of information about old maps that should be stored in metadata to describe them in terms of space, time, content and context so as to increase their interoperability. The following metadata were taken into account in the assessment: title of content, type of content, date, date range, rights, language, subject, distribution format, geographic location, scale of map, reference system, mapping methods, map format, and source materials used to develop the map. The completeness of individual metadata as well as the completeness of metadata for individual collections was assessed. Finally, good practices of individual collections and metadata that could increase the interoperability of the entire collection were identified. The evaluation enables the owners to show the strengths and weaknesses of a given collection in a quick and easy way.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-17", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "444", "volume": "9"}, "authors": [{"authorId": "40993349", "name": "M. Kuźma"}, {"authorId": "116283009", "name": "Hans Bauer"}], "citations": [{"paperId": "910f0b8eaef4d426fab4f981fe13ceb57d92ab7e", "title": "An ontology‐based semantic description model of ubiquitous map images"}, {"paperId": "92b006869b6504341632b353282affff97c1e3c0", "title": "Filming the Historical Geography: Story from the Realm of Maps in Regensburg"}, {"paperId": "351c466497211752c77603f905506812616d1203", "title": "Development of metadata for historical cartographic resources associated with the Paris Peace Conference (1919−1920)"}]}
