{"paperId": "40db68f43e8ff6487058ea2b84806dbc9513303b", "publicationVenue": null, "title": "Cost Effective Algorithms for Participant Selection Problem in Mobile Crowd Sensing Environment", "abstract": "Recent developments in the areas of smart phones and wearable devices have paved the way to many emerging applications in Mobile Crowd Sensing (MCS) domain. There has been a phenomenal increase in the number of people using these devices. In this work we consider an MCS application to cover a set of points of interest (targets) with the objective of selecting a minimum set of participants among the mobile devices. This problem, coined as Participant Selection Problem (PSP) to provide desired coverage can be solved optimally using an Integer Linear Programming (ILP). But for large problem size, solving the ILP becomes impractical from the point of execution time as well as the requirement of having the necessary information about all the participants in one place. In this paper, we have proposed a distributed participants selection algorithm (DPSA) to be run at each participants where, the participants after exchanging messages with its neighbors, decides to remain active or idle. We have shown that, those participants which selects themselves as active suffice to cover all the desired targets. We have run a series of experiments to measure the performance of the proposed algorithm where we measure along with number of participants selected also the total energy consumption. Simulation results reveals the close proximity of DPSA compared to the optimal one providing the same coverage.", "venue": "2018 Fifth International Conference on Parallel, Distributed and Grid Computing (PDGC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 Fifth International Conference on Parallel, Distributed and Grid Computing (PDGC)", "pages": "453-458"}, "authors": [{"authorId": "47994186", "name": "Sanjoy Mondal"}, {"authorId": "2116090693", "name": "Saurav Ghosh"}, {"authorId": "2480236", "name": "Sunirmal Khatua"}, {"authorId": "30411754", "name": "R. Das"}, {"authorId": "2247390", "name": "U. Biswas"}], "citations": [{"paperId": "1f4aded2d520a36de97cb6c6755f62d50554e7c8", "title": "Participants recruitment for coverage maximization by mobility predicting in mobile crowd sensing"}, {"paperId": "388afdab2e134f75020601ffec0a88003519915f", "title": "Participant selection algorithms for large-scale mobile crowd sensing environment"}]}
