{"paperId": "40e08440960d36952ec9f8ba61d3ba9cc4bcbf0e", "publicationVenue": {"id": "fe7d0c6c-e5de-4dd3-8a8d-ffe64e0943c8", "name": "WSEAS Transactions on Information Science and Applications", "alternate_names": ["WSEAS Trans Inf Sci Appl"], "issn": "1790-0832", "url": "http://www.worldses.org/journals/index.html", "alternate_urls": ["http://www.worldses.org/journals/information/"]}, "title": "A Blockchain-based Security Architecture for the Internet of Things", "abstract": "The Internet of Things (IoT) is growing at a very fast pace and being increasingly adopted in many scenarios of industrial applications such as energy (smart grid), automobile (smart cars), healthcare (smart healthcare), manufacturing (smart manufacturing and supply chain) and other application such as homes (smart home) and cities (smart city). Nonetheless, these IoT technologies (devices, systems, protocols, and applications) are faced with many security-related issues. IoT Systems have different layers that are vulnerable to various kinds of attacks. To defend against these attacks, one must consider appropriate security approaches and mechanisms to ensure privacy, security, and trust within the various components and layers that make up the IoT system. Appropriate security mechanism is needed at every layer of an IoT system to keep them secure. Hence, finding suitable mechanism for each IoT layer is a necessity to keep IoT systems secure in the 21st-century applications and implementations. The paper first investigates the IoT layers and protocols, their vulnerability issues, and methods to resolve the issues from existing literatures. We then present a blockchain-based security architecture for the internet of things and practically investigated its security feature through implementation of various security mechanism. Analysis and discussion of the blockchain implementation results are carried for the purpose of meeting the security, privacy, and trust requirements of IoT.", "venue": "WSEAS Transactions on Information Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-23", "journal": {"name": "WSEAS TRANSACTIONS ON INFORMATION SCIENCE AND APPLICATIONS"}, "authors": [{"authorId": "89125642", "name": "Kelechi G. Eze"}, {"authorId": "3186361", "name": "C. Akujuobi"}, {"authorId": "2159790668", "name": "Shermar Hunter"}, {"authorId": "34694614", "name": "S. Alam"}, {"authorId": "2113695733", "name": "Sarhan M. Musa"}, {"authorId": "145033360", "name": "Justin Foreman"}], "citations": [{"paperId": "8439616aada33a889f4f52d6a9a3d7f6c5a30b79", "title": "Assessing How Large Language Models Can Be Integrated with or Used for Blockchain Technology: Overview and Illustrative Case Study"}, {"paperId": "514112dfa9820d4be49631047dad5858ac876e08", "title": "Portable System for Health Hygiene Monitoring"}, {"paperId": "6158ae1af25aa88310f094becc3c3589244caedc", "title": "BBNSF: Blockchain-Based Novel Secure Framework Using RP2-RSA and ASR-ANN Technique for IoT Enabled Healthcare Systems"}, {"paperId": "86ebe912150de89d9fdf45d10ced26da361ba79c", "title": "IoT-Based Decentralized Energy Systems"}]}
