{"paperId": "40e3ee16c162b743344a81a52b9cde004a77b229", "publicationVenue": {"id": "aa2288b7-f151-4e26-93a7-512c123c6754", "name": "Global Knowledge Memory and Communication", "alternate_names": ["Glob Knowl Mem Commun"], "issn": "2514-9342", "url": "http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=gkmc"}, "title": "Research data management services in academic libraries: a comparative study of South Asia and Southeast Asia", "abstract": "\nPurpose\nThis study aims to understand the research data management (RDM) services offered by academic libraries in South Asian and Southeast Asian countries. This study aims to evaluate the library and information science professionals’ required RDM skills and the challenges faced with providing RDM services.\n\n\nDesign/methodology/approach\nThe research methodology for this study used a survey method with purposive sampling. Data were collected through online structured questionnaires, which were used to examine the current state of RDM services offered in academic libraries in South Asia and Southeast Asia.\n\n\nFindings\nSouth Asian and Southeast Asian region major types of RDM services provided were data repository, data management training, maintaining Web resources, data study and analysis, and promoting awareness of reusable data sources. Little attention was given to advisory services on data analysis/mining/visualization and supporting reproducibility and workflow transparency. The results indicated that most respondents agreed that metadata standards and data management planning skills were required for RDM services in South Asia and Southeast Asia.\n\n\nOriginality/value\nThis study is significant because it offers a comprehensive assessment of ongoing RDM services in academic libraries of South Asia and Southeast Asia. Most current literature focuses on best practices in developed nations. This study highlights the need for more competent and dedicated academic staff for effective RDM services. Library professionals can use this study to identify the gaps in RDM services and suggest formative measures to overcome such challenges.\n", "venue": "Global Knowledge Memory and Communication", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-09", "journal": {"name": "Global Knowledge, Memory and Communication"}, "authors": [{"authorId": "1560968188", "name": "Priyanka Sinha"}, {"authorId": "2133269556", "name": "S. A."}, {"authorId": "4221218", "name": "M. Sinha"}], "citations": []}
