{"paperId": "40e5480feea184aa7f354e0578392d44836b8774", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Exploring the path of integration of rural tourism culture and food industry in the context of big data", "abstract": "Abstract Under the background of big data, better integrating rural tourism culture and the food culture industry becomes an important research direction to improve the quality of rural tourism and promote rural revitalization. Based on the association rule mining algorithm under big data technology, this paper analyzes the keyword data of tourists for rural tourism culture and food culture on the Internet review platform by combining the survey and research on rural tourism culture resources and food culture resources in Y town. Results: The number of tourists participating in rural tourism was 51.2% for males and 48.8% for females. In terms of age composition, visitors aged 26-60 accounted for 82.5% of the total, thus indicating that middle-aged and older people in pursuit of nostalgia and local flavor dominate rural tourism. Regarding income level, 81.1% of the rural tourism tourists were in the middle and high end. In terms of tourists’ education, 36.1% of the tourists’ education level is undergraduate, while the rest of the education levels are 7.5%/11.2%/19%/26.2%, respectively, indicating that people with high education are more willing and know how to pursue the culture embedded in the countryside. From the big data sentiment analysis of tourists’ evaluation words, the most frequently appearing words are “special” and “delicious”, reaching 492 and 465 times, respectively, while the least frequent keyword is “dangerous”. The least frequent keyword is “dangerous”, but it also appears 61 times. From the viewpoint of experience, the overall experience of rural tourism culture and food culture of tourists is 76.41% and 79.81%. With the above analysis, in the process of integrating the development of rural tourism culture and food culture, we should focus on creating local characteristic brands, developing characteristic food culture, building characteristic rural tribes, and preventing uniformity from enhancing the attractiveness of the countryside and providing a new road for promoting rural revitalization.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-29", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2237738326", "name": "Yiyi Liu"}], "citations": []}
