{"paperId": "40fb487478cbcbe428d6e8b738cf478784881910", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Comprehensive review of load balancing in cloud computing system", "abstract": "Load balancing plays a critical role in optimizing resource utilization and enhancing performance in cloud computing systems. As cloud environments grow in scale and complexity, efficient load balancing mechanisms become increasingly vital. This paper presents a comprehensive review of load balancing techniques in cloud computing systems, with a focus on their applicability, advantages, and limitations. The review encompasses both static and dynamic load balancing approaches, evaluating their effectiveness in addressing the challenges posed by cloud infrastructure, such as heterogeneity, scalability, and variability in workload demands. Furthermore, the review examines load balancing algorithms considering factors such as resource utilization, response time, fault tolerance, and energy efficiency. Additionally, the impact of load balancing on cloud performance metrics, including throughput, latency, and scalability, is analyzed. This review aims to provide insights into the state-of-the-art load balancing strategies and serve as a valuable resource for researchers, practitioners, and system designers involved in the development and optimization of cloud computing systems.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-06-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2003506137", "name": "M. Oyediran"}, {"authorId": "2215830696", "name": "Olufemi S. Ojo"}, {"authorId": "2023282066", "name": "S. A. Ajagbe"}, {"authorId": "2280576893", "name": "Olukayode Aiyeniko"}, {"authorId": "2295235724", "name": "Princewill Chima Obuzor"}, {"authorId": "2266331366", "name": "M. Adigun"}], "citations": []}
