{"paperId": "40fbc5ec62b4358d2f36591bddf8aa866d66a1ef", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Incentivizing Semisupervised Vehicular Federated Learning: A Multidimensional Contract Approach With Bounded Rationality", "abstract": "To facilitate the implementation of deep learning-based vehicular applications, vehicular federated learning is introduced by integrating vehicular edge computing with the newly emerged federated learning technology. In vehicular federated learning, it is widely considered that the raw data collected by vehicles have complete ground-truth labels. This, however, is not realistic and inconsistent with the current applications. To deal with the above dilemma, a semisupervised vehicular federated learning (Semi-VFL) framework is proposed. In the framework, each vehicular client uses labeled data shared by an application provider, and its own unlabeled data to cooperatively update a global deep neural network model. Furthermore, the application provider combines the multidimensional contract theory with prospect theory (PT) to design an incentive mechanism to stimulate appropriate vehicular clients to participate in Semi-VFL. Multidimensional contract theory is used to deal with the information asymmetry scenario where the application provider is not aware of vehicular clients’ 3-D cost information, while PT is used to model the application provider’s risk-aware behavior and make the incentive mechanism more acceptable in practice. After that, a closed-form solution for the optimal contract items under PT is derived. We present the real-world experimental results to demonstrate that Semi-VFL achieves the advantages in both the test accuracy and convergence speed, in comparison with existing baseline schemes. Based on the experimental results, we further perform the simulations to verify that our incentive mechanism is efficient.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "18573-18588", "volume": "9"}, "authors": [{"authorId": "2192785", "name": "Dongdong Ye"}, {"authorId": "3116552", "name": "Xumin Huang"}, {"authorId": "2160043582", "name": "Yuan Wu"}, {"authorId": "2087062968", "name": "Rong Yu"}], "citations": [{"paperId": "7dc5c65dd3fb0ad9475f874dfaf42596771ce7e8", "title": "Optimizing Client and Data Selection in Federated Learning: A Centralized Optimization and Decentralized Game-Theoretic Approach"}, {"paperId": "68a224c66b4732d2c40371cf87c95c81bc13a76d", "title": "Semi-Asynchronous Model Design for Federated Learning in Mobile Edge Networks"}, {"paperId": "2a26c810440db346f6a5b61459fdf31fc5e73b1d", "title": "Blockchain-Empowered Federated Learning for Healthcare Metaverses: User-Centric Incentive Mechanism With Optimal Data Freshness"}, {"paperId": "f6b1802cc1d8cd93797fc95a0a56e0d1ff3c1531", "title": "Task Freshness-aware Incentive Mechanism for Vehicle Twin Migration in Vehicular Metaverses"}, {"paperId": "2652828435c6b1971317473484876565795bdd4e", "title": "A Framework for Incentivized Collaborative Learning"}, {"paperId": "8f730a6263abe6a85c6a281843375d76a8b31f92", "title": "IncEFL: A sharing incentive mechanism for edge-assisted federated learning in industrial IoT"}, {"paperId": "858a1c0a48a72bd4c84bb48f7ea99861d50def29", "title": "Deep Reinforcement Learning Based Vehicle Selection for Asynchronous Federated Learning Enabled Vehicular Edge Computing"}, {"paperId": "0d3221797512a25b997a92bd47c5cbb23827fd84", "title": "Contract-Theory-Based Incentive Mechanism for Federated Learning in Health CrowdSensing"}, {"paperId": "58f28afe184695d294b583387729d79c4d1c3f0b", "title": "Digital Twins Enabled On-Demand Matching for Multi-Task Federated Learning in HetVNets"}, {"paperId": "9125b256410be8e4cebeae6c322868bec96d34d9", "title": "Endogenous security-aware resource management for digital twin and 6G edge intelligence integrated smart park"}, {"paperId": "28125071767280acebcfd051cef58335023f23c3", "title": "Double Auction Mechanism for Cooperative Swarm Learning in Internet of Vehicles"}, {"paperId": "f8644322a6f2f83cb91773f84f43e86143a713a7", "title": "Blockchain-based Federated Learning for Industrial Metaverses: Incentive Scheme with Optimal AoI"}]}
