{"paperId": "4100e67536b89244b8c85355c32ac65b75760b0f", "publicationVenue": null, "title": "Efficient Group K Nearest-Neighbor Spatial Query Processing in Apache Spark", "abstract": "Aiming at the problem of spatial query processing in distributed computing systems, the design and implementation of new distributed spatial query algorithms is a current challenge. Apache Spark is a memory-based framework suitable for real-time and batch processing. Spark-based systems allow users to work on distributed in-memory data, without worrying about the data distribution mechanism and fault-tolerance. Given two datasets of points (called Query and Training), the group K nearest-neighbor (GKNN) query retrieves (K) points of the Training with the smallest sum of distances to every point of the Query. This spatial query has been actively studied in centralized environments and several performance improving techniques and pruning heuristics have been also proposed, while, a distributed algorithm in Apache Hadoop was recently proposed by our team. Since, in general, Apache Hadoop exhibits lower performance than Spark, in this paper, we present the first distributed GKNN query algorithm in Apache Spark and compare it against the one in Apache Hadoop. This algorithm incorporates programming features and facilities that are specific to Apache Spark. Moreover, techniques that improve performance and are applicable in Apache Spark are also incorporated. The results of an extensive set of experiments with real-world spatial datasets are presented, demonstrating that our Apache Spark GKNN solution, with its improvements, is efficient and a clear winner in comparison to processing this query in Apache Hadoop.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-11", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "763", "volume": "10"}, "authors": [{"authorId": "2236586", "name": "Panagiotis Moutafis"}, {"authorId": "2607367", "name": "G. Mavrommatis"}, {"authorId": "1809602", "name": "M. Vassilakopoulos"}, {"authorId": "145747811", "name": "Antonio Corral"}], "citations": [{"paperId": "28ee52476342cfe935ecb0836348db221f50a6c8", "title": "A Novel Query Method for Spatial Database Based on Improved K-Nearest Neighbor Algorithm"}, {"paperId": "739ae8cfbfce8077fee8d48374375a7f4272f877", "title": "Defining and designing spatial queries: the role of spatial relationships"}, {"paperId": "6a4ef4f0391aae863fff4c36a18e04fed43ace1e", "title": "A PID-Based kNN Query Processing Algorithm for Spatial Data"}, {"paperId": "75edd8ade53831583a40ad5f25980d3bb6f15961", "title": "Intelligent Measurement of Coal Moisture Based on Microwave Spectrum via Distance-Weighted kNN"}]}
