{"paperId": "410343ba7e7bf6dc86707dd8eeb5d3736b21df2d", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "A teaching design of ecological class based on immersive virtual reality spatial fusion", "abstract": "This study investigated the effectiveness of the teaching design scheme called the Immersive Virtual Reality Teaching Model (IVRTM) on a small learner population at the researcher’s university. The study was based on one-term experimental teaching among the undergraduates. An ecological class was set up, extending classroom teaching to 3-layer teaching space, including a physical layer (classroom-based), an information layer (internet-based), and a virtual-reality layer (VR-based). The research aimed (1) to create an online-offline spatial ecological learning environment for higher learning efficiency with a series of learning activities, (2) to uncover the learning effectiveness of VR assistance in oral English, and (3) to acquire the students’ attitudes toward the IVRTM. The study approaches involved literature review, empirical method, questionnaire, interviews, and data analysis. The findings would have a positive significance for the promotion of new technology applications in SLA teaching and provide novel and preliminary references for teachers pursuing an effective teaching design of ecological classes based on IVR spatial fusion.", "venue": "Frontiers in Psychology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-22", "journal": {"name": "Frontiers in Psychology", "volume": "13"}, "authors": [{"authorId": "2109195120", "name": "Wenyuan Liu"}], "citations": [{"paperId": "a184ee11059dc0d59c493bd92f9c26cf9ff4b909", "title": "Construction of Input-Comparison-Output (ICO) Intercultural Mode for Sustainable Development in EFL Education"}, {"paperId": "8977ae6507b211a744a0c82ae5be1e9d29063120", "title": "Exploration and application of ecological classroom teaching method in clinical practice teaching"}]}
