{"paperId": "411524c102627901740770ba601908fa7984a21d", "publicationVenue": null, "title": "Offering Two-way Privacy for Evolved Purchase Inquiries", "abstract": "Dynamic and flexible business relationships are expected to become more important in the future to accommodate specialized change requests or small-batch production. Today, buyers and sellers must disclose sensitive information on products upfront before the actual manufacturing. However, without a trust relation, this situation is precarious for the involved companies as they fear for their competitiveness. Related work overlooks this issue so far: existing approaches protect the information of a single party only, hindering dynamic and on-demand business relationships. To account for the corresponding research gap of inadequately privacy-protected information and to deal with companies without an established trust relation, we pursue the direction of innovative privacy-preserving purchase inquiries that seamlessly integrate into today’s established supplier management and procurement processes. Utilizing well-established building blocks from private computing, such as private set intersection and homomorphic encryption, we propose two designs with slightly different privacy and performance implications to securely realize purchase inquiries over the Internet. In particular, we allow buyers to consider more potential sellers without sharing sensitive information and relieve sellers of the burden of repeatedly preparing elaborate yet discarded offers. We demonstrate our approaches’ scalability using two real-world use cases from the domain of production technology. Overall, we present deployable designs that offer two-way privacy for purchase inquiries and, in turn, fill a gap that currently hinders establishing dynamic and flexible business relationships. In the future, we expect significantly increasing research activity in this overlooked area to address the needs of an evolving production landscape.", "venue": "ACM Trans. Internet Techn.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-25", "journal": {"name": "ACM Transactions on Internet Technology", "pages": "1 - 32", "volume": "23"}, "authors": [{"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "1382610408", "name": "Markus Dahlmanns"}, {"authorId": "150100573", "name": "Frederik Fuhrmann"}, {"authorId": "2104135108", "name": "T. Heutmann"}, {"authorId": "2139256448", "name": "Alexander Kreppein"}, {"authorId": "2219169852", "name": "Dennis Grunert"}, {"authorId": "2146856680", "name": "Christoph Lange"}, {"authorId": "46253301", "name": "R. Schmitt"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "5827e749b4125b3fc944c5fba56c9378fbd7ff28", "title": "An Interdisciplinary Survey on Information Flows in Supply Chains"}]}
