{"paperId": "4125f7e770d6cbb2dcba159f6156f599456f9fef", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Parallel Grid-Based Colocation Mining Algorithms on GPUs for Big Spatial Event Data", "abstract": "Colocation patterns refer to subsets of spatial features whose instances are frequently located together. Mining colocation patterns is important in many applications such as identifying relationships between diseases and environmental factors, but is computationally challenging due to the large number of instances and candidate patterns. Existing algorithms are mostly sequential, and thus can be insufficient for big spatial event data. Recently, parallel colocation mining algorithms have been developed based on the Map-reduce framework, which is economically expensive. Another work proposed a GPU algorithm based on iCPI tree, but assumes that the number of neighbors for each instance is within a small constant, and thus cannot be used when instances are dense and unevenly distributed. To address these limitations, we recently proposed grid-based GPU colocation mining algorithms that include a novel cell-aggregate-based upper bound filter, and two refinement algorithms. In this paper, we provide theoretical analysis of running time. Furthermore using GPU profiling, we identify our recent GPU implementation, GPU-grid-join, as a memory bound problem and to address its bottlenecks, we proposes GPU-grid-join+, an optimized GPU algorithm. Our experimental results on real world data shows that GPU-grid-join+ achieves 4 to 12-fold speedup over GPU-grid-join both running on Nvidia P100 GPU as well as 56 to 126-fold speedup over OpenMP implementation over Intel(R) Xeon(R) CPU with 12 cores. Also for synthetic data, the speedup is in ranges 3 to 7-fold and 9 to 42-fold respectively.", "venue": "IEEE Transactions on Big Data", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "107-118", "volume": "6"}, "authors": [{"authorId": "13602322", "name": "Arpan Man Sainju"}, {"authorId": "2475139", "name": "D. Aghajarian"}, {"authorId": "49165342", "name": "Zhe Jiang"}, {"authorId": "1710248", "name": "S. Prasad"}], "citations": [{"paperId": "e0b33681cb5b7c1a5563da5f7ec28f5aaa08406b", "title": "Mining Highly Visited Co-Location Patterns Based on Minimum Visitor Similarity Constraints"}, {"paperId": "db1be83a2c14e6131af1896b7e3f36eb4a948a1b", "title": "A Clique-Querying Mining Framework for Discovering High Utility Co-Location Patterns without Generating Candidates"}, {"paperId": "fd14ce90cd74e39c9015d993557a5ad5baa5ea38", "title": "Social Media Driven Big Data Analysis for Disaster Situation Awareness: A Tutorial"}, {"paperId": "b66a124bd3facf88672172b55296f5dad451e3c3", "title": "Meta-PCP: A concise representation of prevalent co-location patterns discovered from spatial data"}, {"paperId": "3bae6647b78425c76801223ba0710d551f8ec755", "title": "WAMP<inline-formula><tex-math notation=\"LaTeX\">$^2$</tex-math><alternatives><mml:math><mml:msup><mml:mrow/><mml:mn>2</mml:mn></mml:msup></mml:math><inline-graphic xlink:href=\"yao-ieq1-3134269.gif\"/></alternatives></inline-formula>S: Workload-Aware GPU Performance Model Based Pseudo-Preemptive Real-T"}, {"paperId": "c0b0b8e574f20712765ea6be0030e2189814dd78", "title": "GPU-Powered Spatial Database Engine for Commodity Hardware: Extended Version"}, {"paperId": "2d4cc8aeba4cecec82c9423bd8f9bbb448a26184", "title": "Efficiently mining spatial co-location patterns utilizing fuzzy grid cliques"}, {"paperId": "b53948b8cb3237555c5bbbdaca5fa60f4b4add19", "title": "Parallel Co-location Pattern Mining based on Neighbor-Dependency Partition and Column Calculation"}, {"paperId": "58458611a2e8530421d75f73734dc3c884741cc3", "title": "A spatial co-location pattern mining framework insensitive to prevalence thresholds based on overlapping cliques"}, {"paperId": "ffdf9f000f4105c084104dcf10bfc8f552524188", "title": "MCHT: A maximal clique and hash table-based maximal prevalent co-location pattern mining algorithm"}, {"paperId": "d0163a6bf38471b320a9b989f0e460cdc7e303d6", "title": "Mining Colocation from Big Geo-Spatial Event Data on GPU"}, {"paperId": "7a6f078b2d7899b22952b4c6cde4e88723d51dd1", "title": "A novel Approach of Car Recommendation using Machine Learning Algorithm"}, {"paperId": "393fa5e1b1011d53f546c266f9834c4dc8abdbd5", "title": "Delaunay triangulation‐based spatial colocation pattern mining without distance thresholds"}, {"paperId": "1bd20d4dabaedc0037b033d7cc2d93e0e6e50c92", "title": "Fast generation of sequential patterns with item constraints from concise representations"}, {"paperId": "381864fb66bb10b9a02eb75ea0675f176f8263bd", "title": "Parallel co-location mining with MapReduce and NoSQL systems"}, {"paperId": "d71a078243b136a210e9a2e0cdbf62b67e114420", "title": "Mapping Road Safety Features from Streetview Imagery"}, {"paperId": "122d1a70c11fd0a40b16a5ba2fc46e3e96347ce5", "title": "Spatial Co-location Pattern Mining"}, {"paperId": "32ca1fd914f6f833e438172cd7de65b83a4cbda4", "title": "Pragmatic evaluation of data mining models based on quality assessment & metric analysis"}, {"paperId": "6c77c970604b0bf9f90d789fe86d4e4d3fefd8bb", "title": "USING SYSTEMS OF PARALLEL AND DISTRIBUTED DATA PROCESSING TO BUILD HYDROLOGICAL MODELS BASED ON REMOTE SENSING DATA"}]}
