{"paperId": "412f2728b98c3e2df39a4cd7eec1627fd9b04a42", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Open Data on GitHub: Unlocking the Potential of AI", "abstract": "GitHub is the world's largest platform for collaborative software development, with over 100 million users. GitHub is also used extensively for open data collaboration, hosting more than 800 million open data files, totaling 142 terabytes of data. This study highlights the potential of open data on GitHub and demonstrates how it can accelerate AI research. We analyze the existing landscape of open data on GitHub and the patterns of how users share datasets. Our findings show that GitHub is one of the largest hosts of open data in the world and has experienced an accelerated growth of open data assets over the past four years. By examining the open data landscape on GitHub, we aim to empower users and organizations to leverage existing open datasets and improve their discoverability -- ultimately contributing to the ongoing AI revolution to help address complex societal issues. We release the three datasets that we have collected to support this analysis as open datasets at https://github.com/github/open-data-on-github.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-09", "journal": {"name": "ArXiv", "volume": "abs/2306.06191"}, "authors": [{"authorId": "2108795396", "name": "Anthony C. Roman"}, {"authorId": "2117101322", "name": "Ke Xu"}, {"authorId": "2144654209", "name": "Arfon M. Smith"}, {"authorId": "2219925547", "name": "Jehu Torres Vega"}, {"authorId": "1419615994", "name": "Caleb Robinson"}, {"authorId": "4258401", "name": "J. Ferres"}], "citations": [{"paperId": "9ec0c3c2ba3c86fb56cc11e76059dee1bf242db9", "title": "Open Datasheets: Machine-readable Documentation for Open Datasets and Responsible AI Assessments"}]}
