{"paperId": "413aacc10fb9ee70206f45d0981506af1d30876e", "publicationVenue": null, "title": "Apache Spark based kernelized fuzzy clustering framework for single nucleotide polymorphism sequence analysis", "abstract": null, "venue": "Comput. Biol. Chem.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-10", "journal": {"name": "Computational biology and chemistry", "pages": "\n          107454\n        ", "volume": "92"}, "authors": [{"authorId": "40499767", "name": "Preeti Jha"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "4474139", "name": "M. Ratnaparkhe"}, {"authorId": "2020633111", "name": "Mukkamalla Mounika"}, {"authorId": "2023218181", "name": "N. Nagendra"}], "citations": [{"paperId": "797bd3bab08639a480065dcd2ee9c1086070bd7e", "title": "Reconstruction-Aware Kernelized Fuzzy Clustering Framework Incorporating Local Information for Image Segmentation"}, {"paperId": "d89ee5afab182816bd1ab10c22a469fe662feb91", "title": "A Novel Feature Extraction Approach for the Clustering and Classification of Genome Sequences"}, {"paperId": "189a007e0a36be56a4a5fae2ba63288e0b62243c", "title": "Local feature driven fuzzy local information C-means clustering with kernel metric for blurred and noisy image segmentation"}, {"paperId": "fb7993472c46c1c839ab69810f2d5b0b098bab85", "title": "Quadratic surface center-based possibilistic fuzzy clustering with kernel metric and local information for image segmentation"}, {"paperId": "e80721414bba8d5f91f4ef2f21e0bd6321f85213", "title": "Automatic identification of schizophrenia employing EEG records analyzed with deep learning algorithms"}, {"paperId": "dcf1d1e5e6bf5c413a5bf1e4535d84fd871d2041", "title": "Parameter-Free Auto-Weighted Possibilistic Fuzzy C-Means Clustering with Kernel Metric and Robust Algorithm"}, {"paperId": "7ba133a18843375632ce3e4728dae871b986b99e", "title": "Deep neighborhood structure driven interval type-2 kernel fuzzy c-means clustering with local versus non-local information"}, {"paperId": "d38d1665394485d19b97812d4615b8565a52dc53", "title": "Master-slave hierarchy local information driven fuzzy C-means clustering for noisy image segmentation"}, {"paperId": "f1ef4856c820fc4fa8077abf54e85018d0da1e4b", "title": "A Novel Clustering-Based Hybrid Feature Selection Approach Using Ant Colony Optimization"}, {"paperId": "995fc1a760e6f7b5ce035406016ed5f2fad1590a", "title": "Robust interval type-2 kernel-based possibilistic fuzzy clustering algorithm incorporating local and non-local information"}, {"paperId": "d27021955ca941bc39a1e103b6a6e473c23ea5ef", "title": "Robust dynamic semi-supervised picture fuzzy local information clustering with kernel metric and spatial information for noisy image segmentation"}, {"paperId": "5b3e69558b8317a851f516ff121f34fd13d2049f", "title": "Apache Spark-based scalable feature extraction approaches for protein sequence and their clustering performance analysis"}, {"paperId": "cef7e940e420e1a92709663bf446583876019db4", "title": "Distributed fuzzy clustering algorithm for mixed-mode data in Apache SPARK"}, {"paperId": "e184c08d647d11b1f43290520c584468f62f2be3", "title": "A self-learning iterative weighted possibilistic fuzzy c-means clustering via adaptive fusion"}, {"paperId": "21f13eb6ce7a1427d35fd40b0b94728b0e8da4a7", "title": "Improved Fuzzy C-Means Clustering Algorithm-Based Dynamic Contrast-Enhanced Magnetic Resonance Imaging Features in the Diagnosis of Invasive Breast Carcinoma before and after Menopause"}, {"paperId": "239fe73f569e37fa176f0b4bc799140f2a0bdf4e", "title": "Robust fuzzy dual-local information clustering with kernel metric and quadratic surface prototype for image segmentation"}, {"paperId": "04a60ddd1b830a36eed4d80b584213b985edf9c6", "title": "A novel interval-valued data driven type-2 possibilistic local information c-means clustering for land cover classification"}, {"paperId": "25670771a12c48ab10eae58a56ca41644762a972", "title": "A Novel Scalable Apache Spark Based Feature Extraction Approaches for Huge Protein Sequence and their Clustering Performance Analysis"}, {"paperId": "9c9d1d65f1804fc099d2017127bf07ae5fa2a0f5", "title": "Unsupervised Kernel-Induced Fuzzy Possibilistic C-Means Technique in Investigating Real-World Data"}, {"paperId": "d2e5bb34a22c748bfd34ab30fb205bbe0b840dee", "title": "Robust Dynamic Semi-supervised Picture Fuzzy Clustering with KL Divergence and Local Information"}, {"paperId": "b7791a55907264deb340343ec2f0c3e40a6505a8", "title": "Kernel-based fuzzy local information clustering algorithm self-integrating non-local information"}]}
