{"paperId": "4142b445bd9db31ec36ce0792192328a67774862", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Analysis of the Conflict between Car Commuter’s Route Choice Habitual Behavior and Traffic Information Search Behavior", "abstract": "Motivated by the conflict between travelers’ habitual choice behavior and traffic information search behavior, in this paper, a behavioral experiment under different types of traffic information (i.e., per-trip traffic information and en-route traffic information) was designed to obtain data regarding car commuters’ daily route choices. Based on the observed data, participants’ route choices, habit strength, response time, and information search behaviors were analyzed. It is concluded that, in the beginning, the traffic information had a great influence on the habit participants’ route choices, let them think more, and made most of them switch from habit route to the best route (as recommended by traffic information); however, as time went on, the impact of traffic information declined, and several features of habits, such as automatically responding and repeated behavior, would reappear in some participants’ decision-making. Meanwhile, the different way of traffic information search behaviors (i.e., in active performance or in passive reception) could cause different information compliance ratios. These results would help to understand the interrelationship between car commuters’ daily route choice behaviors and traffic information search behaviors in short-term and in long-term, respectively, and provide an interesting starting point for the development of practical traffic information issuing strategies to enhance the impact of traffic information to alleviate traffic congestion during morning commuting.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2146386670", "name": "Kai Liu"}], "citations": []}
