{"paperId": "414920f15379a60bb4625405c85456c98e836f52", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "A High-Level DSL for Geospatial Visualizations with Multi-core Parallelism Support", "abstract": "The amount of data generated worldwide associated with geolocalization has exponentially increased over the last decade due to social networks, population demographics, and the popularization of Global Positioning Systems. Several methods for geovisualization have already been developed, but many of them are focused on a specific application or require learning a variety of tools and programming languages. It becomes even more difficult when users have to manage a large amount of data because state-of-the-art alternatives require the use of third-party pre-processing tools. We present a novel Domain-Specific Language (DSL), which focuses on large data geovisualizations. Through a compiler, we support automatic visualization generations and data pre-processing. The system takes advantage of multi-core parallelism to speed-up data pre-processing abstractly. Our experiments were designated to highlight the programming effort and performance of our DSL. The results have shown a considerable programming effort reduction and efficient parallelism support with respect to the sequential version.", "venue": "Annual International Computer Software and Applications Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 IEEE 41st Annual Computer Software and Applications Conference (COMPSAC)", "pages": "298-304", "volume": "01"}, "authors": [{"authorId": "2467326", "name": "Cleverson Ledur"}, {"authorId": "1895129", "name": "Dalvan Griebler"}, {"authorId": "2917224", "name": "I. Manssour"}, {"authorId": "144025669", "name": "L. G. Fernandes"}], "citations": [{"paperId": "063ff58ac12c1a350e1e269ac2886dee2d4d51ab", "title": "Optimasi Algoritma K-Means Clustering dengan Parallel Processing menggunakan Framework R"}, {"paperId": "dc7614136903e8680f3d5dc4fa867dc80a6d909c", "title": "Parallel and Distributed Processing Support for a Geospatial Data Visualization DSL"}, {"paperId": "1e04616e559f675e07cb88e5f617731dce204b4c", "title": "Parallel Stream Processing with MPI for Video Analytics and Data Visualization"}, {"paperId": "4d4b477361bb7f6b0911e1bf9742bf2f79cef418", "title": "Computing Fast and Scalable Table Cartograms for Large Tables"}, {"paperId": "7fb79d33e3574201a9d612f3ff90aa6c249eab87", "title": "Suporte ao Processamento Paralelo e Distribuído em uma DSL para Visualização de Dados Geoespaciais"}]}
