{"paperId": "41660eb6b6544eb5059edd710f807919a946dca8", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Machine Learning Methods for Automated Fault Detection and Diagnostics in Building Systems—A Review", "abstract": "Energy consumption in buildings is a significant cost to the building’s operation. As faults are introduced to the system, building energy consumption may increase and may cause a loss in occupant productivity due to poor thermal comfort. Research towards automated fault detection and diagnostics has accelerated in recent history. Rule-based methods have been developed for decades to great success, but recent advances in computing power have opened new doors for more complex processing techniques which could be used for more accurate results. Popular machine learning algorithms may often be applied in both unsupervised and supervised contexts, for both classification and regression outputs. Significant research has been performed in all permutations of these divisions using algorithms such as support vector machines, neural networks, Bayesian networks, and a variety of clustering techniques. An evaluation of the remaining obstacles towards widespread adoption of these algorithms, in both commercial and scientific domains, is made. Resolutions for these obstacles are proposed and discussed.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-30", "journal": {"name": "Energies"}, "authors": [{"authorId": "2054870719", "name": "W. Nelson"}, {"authorId": "2044694567", "name": "C. Culp"}], "citations": [{"paperId": "1e814f665db4cec06434a54b30e9248c2067482d", "title": "A Review on Machine/Deep Learning Techniques Applied to Building Energy Simulation, Optimization and Management"}, {"paperId": "5afc1c668b801e96349e9152a51a98f28d701b0f", "title": "AI in HVAC fault detection and diagnosis: A systematic review"}, {"paperId": "b29f13e34f728f9d1344bed28890a9c93df1ef44", "title": "Generation and evaluation of a synthetic dataset to improve fault detection in district heating and cooling systems"}, {"paperId": "a6460bb8ca95f595a12135c73427970596c59d68", "title": "Digital Twin for Fault Detection and Diagnosis of Building Operations: A Systematic Review"}, {"paperId": "48c0ff244a8c866737ec5e6c32df3ec7ad102791", "title": "Feature selection based on Null Importance for Fault Diagnosis of Chiller"}, {"paperId": "9bd541be464f534e2a647987b6c1d16d1f8762eb", "title": "Artificial Intelligence for Energy Processes and Systems: Applications and Perspectives"}, {"paperId": "a9171b943fcae895c8124f66f0d21d671e2414f7", "title": "Implementation of the IDAIC Framework on an Air Handling Unit to Transition to Proactive Maintenance"}, {"paperId": "6a842a3096bfe65af69e1d86a78bacca7ffef530", "title": "Applications of Artificial Intelligence Algorithms in the Energy Sector"}]}
