{"paperId": "416fc25f446ea1cba804325944f3f26aa13c3219", "publicationVenue": null, "title": "Adaptive Aggregation For Federated Learning", "abstract": "In this paper, we present a new scalable and adaptive architecture for FL aggregation. First, we demonstrate how traditional tree overlay based aggregation techniques (from P2P, publish-subscribe and stream processing research) can help FL aggregation scale, but are ineffective from a resource utilization and cost standpoint. Next, we present the design and implementation of AdaFed, which uses serverless/cloud functions to adaptively scale aggregation in a resource efficient and fault tolerant manner. We describe how AdaFed enables FL aggregation to be dynamically deployed only when necessary, elastically scaled to handle participant joins/leaves and is fault tolerant with minimal effort required on the (aggregation) programmer side. We also demonstrate that our prototype based on Ray [1] scales to thousands of participants, and is able to achieve a > 90% reduction in resource requirements and cost, with minimal impact on aggregation latency.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-23", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "180-185"}, "authors": [{"authorId": "143863352", "name": "K. R. Jayaram"}, {"authorId": "46761645", "name": "Vinod Muthusamy"}, {"authorId": "18730445", "name": "Gegi Thomas"}, {"authorId": "2152638957", "name": "Ashish Verma"}, {"authorId": "47296533", "name": "M. Purcell"}], "citations": [{"paperId": "2f345dbf4ffb76d88fbec4aa860f57c2710acd2c", "title": "On the Conflict of Robustness and Learning in Collaborative Machine Learning"}, {"paperId": "aa1079cdbad014638608f8921dcd2d70462cbe34", "title": "A Survey on Heterogeneity Taxonomy, Security and Privacy Preservation in the Integration of IoT, Wireless Sensor Networks and Federated Learning"}, {"paperId": "3d43b4b15891e1ad553345ea1cf71e05601acb63", "title": "ABF-FNN: A new fuzzy neural network for predicting coal mine gas concentration hazard"}, {"paperId": "bc94d32343acaa681c30c1016c6eca52757720af", "title": "Federated Learning: A Cutting-Edge Survey of the Latest Advancements and Applications"}, {"paperId": "bff83319672f0042466599d81d902dee9394663b", "title": "Limitations and Future Aspects of Communication Costs in Federated Learning: A Survey"}, {"paperId": "8221357325c0ea1cc45c825e264a77ba220d2f83", "title": "FLIPS: Federated Learning using Intelligent Participant Selection"}, {"paperId": "70210227462b7b3df498b32a30fd75dc7bb61dbd", "title": "FedLesScan: Mitigating Stragglers in Serverless Federated Learning"}]}
