{"paperId": "418396c16d917d9481e0ff737a33180c54183775", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Dynamic and Decentralized Global Analytics via Machine Learning", "abstract": "Operating at a large scale, data analytics has become an essential tool for gaining insights from operational data, such as user online activities. With the volume of data growing exponentially, data analytic jobs have expanded from a single datacenter to multiple geographically distributed datacenters. Unfortunately, designed originally for a single datacenter, the software stack that supports data analytics is oblivious to on-the-fly resource variations on inter-datacenter networks, which negatively affects the performance of analytic queries. Existing solutions that optimize query execution plans before their execution are not able to quickly adapt to resource variations at query runtime. In this paper, we present Turbo, a lightweight and non-intrusive data-driven system that dynamically adjusts query execution plans for geo-distributed analytics in response to runtime resource variations across datacenters. A highlight of Turbo is its ability to use machine learning at runtime to accurately estimate the time cost of query execution plans, so that adjustments can be made when necessary. Turbo is non-intrusive in the sense that it does not require modifications to the existing software stack for data analytics. We have implemented a real-world prototype of Turbo, and evaluated it on a cluster of 33 instances across 8 regions in the Google Cloud platform. Our experimental results have shown that Turbo can achieve a cost estimation accuracy of over 95% and reduce query completion times by 41%.", "venue": "ACM Symposium on Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-10-11", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "39483391", "name": "Hao Wang"}, {"authorId": "1714907", "name": "Di Niu"}, {"authorId": "91269142", "name": "Baochun Li"}], "citations": [{"paperId": "b6476f998c29577358942be9b25eb904632075ea", "title": "ATOM: Asynchronous Training of Massive Models for Deep Learning in a Decentralized Environment"}, {"paperId": "8d839e860ad07c918414a78c68eebbbb2ff06757", "title": "SWAN: WAN-aware stream processing on geographically-distributed clusters"}, {"paperId": "f5736ea1e1a202373b752aa468235f00d7fe5917", "title": "A Survey on Machine Learning for Geo-Distributed Cloud Data Center Managements"}, {"paperId": "c2dd4b8436443c05033317b1a13f82f5e1a18ee5", "title": "Machine Learning for Computer Systems and Networking: A Survey"}, {"paperId": "9079f37a4c75fff6bbe0f6ad4c6bc67ab5ed286d", "title": "Estimate the Performance of Cloudera Decision Support Queries"}, {"paperId": "8f1acde3b9d7f3983c8d928a36a85776b0d33ad6", "title": "AggNet: Cost-Aware Aggregation Networks for Geo-distributed Streaming Analytics"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}, {"paperId": "e583b9c586b8b8be97600dd4295c7ed608cf0b83", "title": "WASP: Wide-area Adaptive Stream Processing"}, {"paperId": "ac108937037131de59eb540e5e20f9468e2f0818", "title": "Turbo: Dynamic and Decentralized Global Analytics via Machine Learning"}]}
