{"paperId": "41984153280f54733d52ed3c1206b1da1b8de1ec", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "Spike learning based Privacy Preservation of Internet of Medical Things in Metaverse.", "abstract": "With the rising trend of digital technologies, such as augmented and virtual reality, Metaverse has gained a notable popularity. The applications that will eventually benefit from Metaverse is the telemedicine and e-health fields. However, the data and techniques used for realizing the medical side of Metaverse is vulnerable to data and class leakage attacks. Most of the existing studies focus on either of the problems through encryption techniques or addition of noise. In addition, the use of encryption techniques affects the overall performance of the medical services, which hinders its realization. In this regard, we propose Generative adversarial networks and spike learning based convolutional neural network (GASCNN) for medical images that is resilient to both the data and class leakage attacks. We first propose the GANs for generating synthetic medical images from residual networks feature maps. We then perform a transformation paradigm to convert ResNet to spike neural networks (SNN) and use spike learning technique to encrypt model weights by representing the spatial domain data into temporal axis, thus making it difficult to be reconstructed. We conduct extensive experiments on publicly available MRI dataset and show that the proposed work is resilient to various data and class leakage attacks in comparison to existing state-of-the-art works (1.75x increase in FID score) with the exception of slightly decreased performance (less than 3%) from its ResNet counterpart. while achieving 52x energy efficiency gain with respect to standard ResNet architecture.", "venue": "IEEE journal of biomedical and health informatics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-21", "journal": {"name": "IEEE journal of biomedical and health informatics", "volume": "PP"}, "authors": [{"authorId": "10779576", "name": "Sunder Ali Khowaja"}, {"authorId": "2265961", "name": "K. Dahri"}, {"authorId": "10372764", "name": "M. Jarwar"}, {"authorId": "2149677825", "name": "I. Lee"}], "citations": []}
