{"paperId": "41a63d3be2ea4e50cde19b808444b2543580572d", "publicationVenue": {"id": "940c7008-d07d-488d-baa2-1ef7343957dc", "name": "International Journal of Computer Applications", "type": "journal", "alternate_names": ["INTERNATIONAL JOURNAL OF COMPUTER APPLICATION", "International Journal of Computers and Applications", "International journal of mini & microcomputers", "Int J Comput Appl", "INT J COMPUT APPL", "Int j mini  microcomput"], "issn": "0975-8887", "alternate_issns": ["0702-0481", "1206-212X", "2250-1797"], "url": "https://www.ijcaonline.org/", "alternate_urls": ["http://www.tandfonline.com/loi/tjca20#.VbH7kGPLZa4", "http://www.actapress.com/Content_of_Journal.aspx?JournalID=130", "http://epe.lac-bac.gc.ca/101/201/300/intl_j_comp_applications/index.html"]}, "title": "VM Migration Techniques in Cloud: A Review", "abstract": "Cloud computing is recent technology. In cloud environment services are provided in an ubiquitous, easy and on request fashion to share computing resources [4][5]. The key point in cloud computing is Virtualization[6][14],which provides the partition of one physical machine into multiple virtual machines that can run simultaneously. Physical resources and hardware are shared in virtualization [15] where applications are encapsulated within virtual machines (VM) is dynamically mapped onto a pool of physical servers. Live migration of virtual machines is a process of moving a virtual machine in its running state or application in it’s running state between different physical machines, while not disturbing the service provided to the user. All the system resources, which are assigned to the virtual machine like memory, storage, process and Network resources like connectivity, are transferred from the original host machine to the destination machine. Load Balancing, Energy efficiency and fault tolerance which is also known as High availability of physical servers, in Cloud Data center are significant performance needs of Live Migration. This paper incorporates a detailed review on Migration of Virtual machines in cloud environment", "venue": "International Journal of Computer Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-08-19", "journal": {"name": "International Journal of Computer Applications"}, "authors": [{"authorId": "70317314", "name": "Taruna Khemwani"}, {"authorId": "143727792", "name": "R. Rathi"}], "citations": []}
