{"paperId": "41b22c0307dde03f86d9e1c569fa5e028e0e53de", "publicationVenue": {"id": "edbf100f-0a8b-4e06-b100-e077ac2c913e", "name": "International Conference on eDemocracy & eGovernment", "type": "conference", "alternate_names": ["ICEDEG", "Int Conf edemocracy  egovernment"]}, "title": "Performance Evaluation of NoSQL and SQL Queries in Response Time for the E-government", "abstract": "Society demands accurate, right, quickly and easy access information. Therefore, governments are forced to implements or improve information systems with modern technologies. This research work is focused on the research of responses times on relational and non-relational data base models in an experimental data base system provided by the Función Judicial del Ecuador. The data is migrated for load in NoSQL allotment, and the performance tests is obtained a document-oriented data model. With these tests we could know the best database, focusing all on response time of data queries that have been used on performance tests. In addition, we evaluate the performance before and after the relational database administration system (RDBMS), obtaining as a result that the first test of the queries made to MongoDB substantially surpass the queries made to SQL Server, but in the subsequent tests the times they tend to be similar.", "venue": "International Conference on eDemocracy & eGovernment", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-04-04", "journal": {"name": "2018 International Conference on eDemocracy & eGovernment (ICEDEG)", "pages": "257-262"}, "authors": [{"authorId": "2054935588", "name": "Ana Flores"}, {"authorId": "46210054", "name": "S. Ramírez"}, {"authorId": "21191442", "name": "R. Toasa"}, {"authorId": "2058917625", "name": "Javier Vargas"}, {"authorId": "46229535", "name": "Renato Urvina - Barrionuevo"}, {"authorId": "145306157", "name": "J. M. Lavin"}], "citations": [{"paperId": "b235ae9748094b3c4647c001f94cdfb82bfb31bf", "title": "Research on Real-time Data Warehouse Technology for Sea Battlefield"}, {"paperId": "d3ed0b6c54ff6f1d960e91eb44a0071877c55f12", "title": "MongoDB: Analysis of Performance with Data from the National High School Exam (Enem)"}, {"paperId": "39ad1126826b599c3827396fecdf9d6539c8beed", "title": "Bivariate, Cluster and Suitability Analysis of NoSQL Solutions for Different Application Areas"}, {"paperId": "e4a216a8fb349e1afb6bc64a2392dafce1855616", "title": "Benchmarking large-scale data management for Internet of Things"}, {"paperId": "5bbae9d2af04e7669329ba127284a41416d15ecd", "title": "Investigation of eGovernment Services and Alignment between Business and Information Systems"}, {"paperId": "d97bc9f753d6ec0f9dd9a4fc1321c874f66da3d0", "title": "Storage Solutions for Big Data Systems: A Qualitative Study and Comparison"}, {"paperId": "6fb530191b41d3a8eb5937d39b750002590c33ed", "title": "Performance Evaluation of Apache Zookeeper Services in Distributed Systems"}, {"paperId": "7c965b09e6b52485f8b0ce747554b2b679989754", "title": "Query Performance Analysis of NoSQL and Big Data"}, {"paperId": "10a7670ea335cd9761070dfff7f4d23f42dfa647", "title": "Scalable Query Profiling Employing Purging and Elimination Technique"}, {"paperId": "24fb6845be71b9f4d37b574670b15b64ef638ff6", "title": "Chapter Two - Bivariate, cluster, and suitability analysis of NoSQL solutions for big graph applications"}, {"paperId": "e0c464c9c0ff988908d7a81c8669a88ab06f4fe1", "title": "Evaluation of NoSQL Databases Features and Capabilities for Smart City Data Lake Management"}, {"paperId": "6fdabfe3c2367a7fe1cc2457a76f5a096937dabe", "title": "Performance Analysis of Not Only SQL Semi-Stream Join Using MongoDB for Real-Time Data Warehousing"}]}
