{"paperId": "41c06657f69644b3613b40c2bd2a62b1e01629b8", "publicationVenue": {"id": "057c6386-3be2-4649-8e9d-95d09e29102a", "name": "Vaccines", "issn": "2076-393X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-282186", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-282186", "https://www.mdpi.com/journal/vaccines"]}, "title": "HuNoV Non-Structural Protein P22 Induces Maturation of IL-1β and IL-18 and N-GSDMD-Dependent Pyroptosis through Activating NLRP3 Inflammasome", "abstract": "Norovirus infection is the leading cause of foodborne gastroenteritis worldwide, causing more than 200,000 deaths each year. As a result of a lack of reproducible and robust in vitro culture systems and suitable animal models for human norovirus (HuNoV) infection, the pathogenesis of HuNoV is still poorly understood. In recent years, human intestinal enteroids (HIEs) have been successfully constructed and demonstrated to be able to support the replication of HuNoV. The NLRP3 inflammasome plays a key role in host innate immune responses by activating caspase1 to facilitate IL-1β and IL-18 secretion and N-GSDMD-driven apoptosis, while NLRP3 inflammasome overactivation plays an important role in the development of various inflammatory diseases. Here, we found that HuNoV activated enteric stem cell-derived human intestinal enteroids (HIEs) NLRP3 inflammasome, which was confirmed by transfection of Caco2 cells with full-length cDNA clones of HuNoV. Further, we found that HuNoV non-structural protein P22 activated the NLRP3 inflammasome and then matured IL-1β and IL-18 and processed the cleavage of gasdermin-D (GSDMD) to N-GSDMD, leading to pyroptosis. Besides, berberine (BBR) could ameliorate the pyroptosis caused by HuNoV and P22 by inhibiting NLRP3 inflammasome activation. Together, these results reveal new insights into the mechanisms of inflammation and cell death caused by HuNoV and provide potential treatments.", "venue": "Vaccines", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "Vaccines", "volume": "11"}, "authors": [{"authorId": "2118768089", "name": "Nini Chen"}, {"authorId": "47978285", "name": "Pei-yu Chen"}, {"authorId": "2144209161", "name": "Yanhe Zhou"}, {"authorId": "5708382", "name": "Sidong Chen"}, {"authorId": "145349229", "name": "S. Gong"}, {"authorId": "152298438", "name": "Ming Fu"}, {"authorId": "115441854", "name": "L. Geng"}], "citations": [{"paperId": "085f708a1be84895bc9e0978b3c360ff705e27f1", "title": "The gasdermin family: emerging therapeutic targets in diseases"}]}
