{"paperId": "41c42c0809b806f4034a5398610730a394e28d5f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "To do or not to do: cost-sensitive causal decision-making", "abstract": "Causal classification models are adopted across a variety of operational business processes to predict the effect of a treatment on a categorical business outcome of interest depending on the process instance characteristics. This allows optimizing operational decision-making and selecting the optimal treatment to apply in each specific instance, with the aim of maximizing the positive outcome rate. While various powerful approaches have been presented in the literature for learning causal classification models, no formal framework has been elaborated for optimal decision-making based on the estimated individual treatment effects, given the cost of the various treatments and the benefit of the potential outcomes. In this article, we therefore extend upon the expected value framework and formally introduce a cost-sensitive decision boundary for double binary causal classification, which is a linear function of the estimated individual treatment effect, the positive outcome probability and the cost and benefit parameters of the problem setting. The boundary allows causally classifying instances in the positive and negative treatment class to maximize the expected causal profit, which is introduced as the objective at hand in cost-sensitive causal classification. We introduce the expected causal profit ranker which ranks instances for maximizing the expected causal profit at each possible threshold for causally classifying instances and differs from the conventional ranking approach based on the individual treatment effect. The proposed ranking approach is experimentally evaluated on synthetic and marketing campaign data sets. The results indicate that the presented ranking method effectively outperforms the cost-insensitive ranking approach and allows boosting profitability.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-05", "journal": {"name": "ArXiv", "volume": "abs/2101.01407"}, "authors": [{"authorId": "1482479474", "name": "Diego Olaya"}, {"authorId": "2067648", "name": "W. Verbeke"}, {"authorId": "122267913", "name": "Jente Van Belle"}, {"authorId": "2616790", "name": "M. Guerry"}], "citations": [{"paperId": "39ceb3b9901ed4fdc53326b69a694d504f1d0308", "title": "GRFlift: uplift modeling for multi-treatment within GMV constraints"}, {"paperId": "69b2fa0adb990e433d361ca78a112a35a0caffca", "title": "E-Commerce Promotions Personalization via Online Multiple-Choice Knapsack with Uplift Modeling"}, {"paperId": "7bb9d23350dbf3cce456475df7b84731716f3202", "title": "Optimization Levers for Promotions Personalization Under Limited Budget"}]}
