{"paperId": "41d83b925d093ac6413e2c144f87a84c2b561c90", "publicationVenue": null, "title": "Big Data y nuevas geografías: la huella digital de las actividades humanas", "abstract": "El terme Big Data s’ha popularitzat en els ultims anys i fa referencia a la produccio de quantitats ingents de dades. L’activitat humana es captada a traves de multiples xarxes de sensors i dispositius i, per tant, deixa una empremta digital. L’analisi d’aquesta empremta digital te un gran potencial per a la investigacio geografica del comportament huma. En aquest article es descriuen les principals caracteristiques del Big Data i es destaca la importancia de les dades massives per a la ciencia i, particularment, per a la Geografia, centrant l’atencio en l’estudi dels patrons espaciotemporals de l’activitat humana.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2018-05-22", "journal": {"name": "", "pages": "195-217", "volume": "64"}, "authors": [{"authorId": "95435120", "name": "J. Puebla"}], "citations": [{"paperId": "86bd82229a2103f7f1484ed908ba0376bebfc859", "title": "Transformación de la participación ciudadana: desafíos de la educación universitaria en contextos algorítmicos"}, {"paperId": "5abf23e478db56ef63f22e14956adcb3560927fc", "title": "Estimation of mobility and population in Spain during different phases of the COVID-19 pandemic from mobile phone data"}, {"paperId": "846a048825ab31355c25f2342ee80412d7e1ce1a", "title": "Mapping of functional areas in Spain based on mobile phone data during different phases of the COVID-19 pandemic"}, {"paperId": "c9de21bb74270bfe1aeebe7c20b94dcbfc392959", "title": "Digitization of Mariemma's legacy audiovisual collection"}, {"paperId": "3f33c84233d29bd1707fb7a2f05bf23e60ed9468", "title": "¿Se acabó la diversión? El regreso del relato argumental racional"}, {"paperId": "6aa368a4eb0abaa45c3c4fa665bc6349e47b011c", "title": "Transporte y territorio urbano: condiciones de accesibilidad en el aglomerado Gran Buenos Aires"}, {"paperId": "f9906696084de6d65cf9c54c011a4a432aae202e", "title": "Applying a Pedestrian Level of Service in the Context of Social Distancing: The Case of the City of Madrid"}, {"paperId": "298a10905c34fb49db0becff94e26164ee612958", "title": "Desarrollo y consolidación de los estudios regionales en España"}, {"paperId": "6eb4653ce3f3807c83b2abc7cf38cf67d9cd6402", "title": "Geografía de la renta de los hogares en España a nivel municipal: nuevos datos y nuevas posibilidades de geovisualización, exploración y análisis espacial en entornos cloud"}, {"paperId": "2cd92a11487d31a59d4681ef08195cbbc3678676", "title": "A cidade patrimonial e turística"}, {"paperId": "3d9663cd7283e61bde65ed23eb32421429a6c620", "title": "Taking the urban tourist activity pulse through digital footprints"}, {"paperId": "b2f3df20924ab0a319b260da2e7c5a001d621065", "title": "SIG y bases de datos. Oportunidades y retos en la transición de los sistemas tradicionales al Big Data = GIS and databases. Opportunities and Challenges in the Transition from Traditional Systems to Big Data"}, {"paperId": "bf94bb3483c2ccbea42573f191627974a1566f1c", "title": "Expresión de fenómenos urbanos efímeros a partir de las redes sociales"}, {"paperId": "73a274a4dc483f2d4ae1efddc558fdfdc0ea6a03", "title": "Entrevista a Javier Gutiérrez Puebla"}, {"paperId": "3164686c1dcf75d0030b37002bdb2573784b7081", "title": "Social dynamics in cities: analysis through LBSN data"}, {"paperId": "84bad2a8fca87c949f81d0d9f90ce68f14e0a7fe", "title": "Behavioral factors underlying the adoption of smart mobility solutions"}]}
