{"paperId": "41da3cff33e75d9904c659988f6d70edd537278d", "publicationVenue": {"id": "c4de751b-08c4-4e16-91c3-f9be8698841c", "name": "International Conference on Computational Photography", "type": "conference", "alternate_names": ["IEEE International Conference on Communication Problem-Solving", "Int Conf Comput Photogr", "International Conference on Intelligent Computer Communication and Processing", "ICCP", "Int Conf Intell Comput Commun Process", "IEEE Int Conf Commun Probl"]}, "title": "Detecting Malicious URLs Based on Machine Learning Algorithms and Word Embeddings", "abstract": "Relying on the appropriate features is essential in classification models for malware detection, for various important reasons, such as dealing with class imbalance, the ability to detect zero-day malware samples, or preventing attackers to successfully reverse engineer the classification process and changing nonessential feature values to avoid detection. In this paper, we propose a method that uses a combination of word embeddings together with “classical”, domain-engineered features, to obtain reliable classification models for malicious URLs detection. Additionally, we explore different traditional techniques to address class imbalance – such as synthetic oversampling or cost-sensitive learning – and several classification techniques. We find that the best overall results are obtained by using a cost-sensitive neural network – with a precision that exceeds 99% and an accuracy above 90%, while maintaining a recall rate above 89%. We have performed an analysis of the importance of the features proposed, and found that while word embeddings produce better results than bi-gram based features, domain-specific features are necessary for obtaining a high precision in detecting malicious URLs.", "venue": "International Conference on Computational Photography", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-03", "journal": {"name": "2020 IEEE 16th International Conference on Intelligent Computer Communication and Processing (ICCP)", "pages": "187-193"}, "authors": [{"authorId": "82952858", "name": "Andrei Crisan"}, {"authorId": "119227955", "name": "G. Florea"}, {"authorId": "2029679745", "name": "Lorand Halasz"}, {"authorId": "2788293", "name": "C. Lemnaru"}, {"authorId": "1714261", "name": "Ciprian Oprișa"}], "citations": [{"paperId": "6f7de1f7921c7c5b538a72c3dee71684205a56d9", "title": "A CNN-Based Model for Detecting Malicious URLs"}, {"paperId": "289cf2c91558e12d7da647e9d38a394471252208", "title": "Collaborative Filtering of Malicious Information from the MULTimedia Data Using s"}, {"paperId": "1b6546f9ea25f1a43877147084adc509aa635246", "title": "Malicious Domain Detection using NLP Methods — A Review"}, {"paperId": "f2a61250dfe42737ff2014864071b46484bffb64", "title": "Detection of Web Cross-Site Scripting (XSS) Attacks"}, {"paperId": "38929cc602c5d50e687a3dc54cea047e318cb8b9", "title": "A Novel Approach for Malicious URL Detection Based on the Joint Model"}, {"paperId": "ccf2ae666cf9084fce307debeba0d37afe42a5e0", "title": "Detecting Malicious URLs Using Machine Learning Techniques: Review and Research Directions"}]}
