{"paperId": "41e974ddaceb213d7103155e4662f0430975b84d", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "Examining Cannabis, Tobacco, and Vaping Discourse on Reddit: An Exploratory Approach Using Natural Language Processing", "abstract": "Background: Perceptions of tobacco, cannabis, and electronic nicotine delivery systems (ENDS) are continually evolving in the United States. Exploring these characteristics through user generated text sources may provide novel insights into product use behavior that are challenging to identify using survey-based methods. The objective of this study was to compare the topics frequently discussed among Reddit members in cannabis, tobacco, and ENDS-specific subreddits. Methods: We collected 643,070 posts on the social media site Reddit between January 2013 and December 2018. We developed and validated an annotation scheme, achieving a high level of agreement among annotators. We then manually coded a subset of 2,630 posts for their content with relation to experiences and use of the three products of interest, and further developed word cloud representations of the words contained in these posts. Finally, we applied Latent Dirichlet Allocation (LDA) topic modeling to the 643,070 posts to identify emerging themes related to cannabis, tobacco, and ENDS products being discussed on Reddit. Results: Our manual annotation process yielded 2,148 (81.6%) posts that contained a mention(s) of either cannabis, tobacco, or ENDS with 1,537 (71.5%) of these posts mentioning cannabis, 421 (19.5%) mentioning ENDS, and 264 (12.2%) mentioning tobacco. In cannabis-specific subreddits, personal experiences with cannabis, cannabis legislation, health effects of cannabis use, methods and forms of cannabis, and the cultivation of cannabis were commonly discussed topics. The discussion in tobacco-specific subreddits often focused on the discussion of brands and types of combustible tobacco, as well as smoking cessation experiences and advice. In ENDS-specific subreddits, topics often included ENDS accessories and parts, flavors and nicotine solutions, procurement of ENDS, and the use of ENDS for smoking cessation. Conclusion: Our findings highlight the posting and participation patterns of Reddit members in cannabis, tobacco, and ENDS-specific subreddits and provide novel insights into aspects of personal use regarding these products. These findings complement epidemiologic study designs and highlight the potential of using specific subreddits to explore personal experiences with cannabis, ENDS, and tobacco products.", "venue": "Frontiers in Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-05", "journal": {"name": "Frontiers in Public Health", "volume": "9"}, "authors": [{"authorId": "1931624406", "name": "Ryzen Benson"}, {"authorId": "152300565", "name": "Mengke Hu"}, {"authorId": "46652807", "name": "Annie T. Chen"}, {"authorId": "32010307", "name": "Shu-Hong Zhu"}, {"authorId": "144494734", "name": "Mike Conway"}], "citations": [{"paperId": "4e6c55e0f0d3fafd19748c2f96bad0fb897834b9", "title": "Discussion of waterpipe tobacco smoking on reddit"}, {"paperId": "767e45d2877f05f87151c63157213d18d4028035", "title": "Experiments with LDA and Top2Vec for embedded topic discovery on social media data—A case study of cystic fibrosis"}]}
