{"paperId": "4200473f5c4801c517d1fdc54f93009a6f9954ba", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "A Two-Layer Self-Organizing Map with Vector Symbolic Architecture for Spatiotemporal Sequence Learning and Prediction", "abstract": "We propose a new nature- and neuro-science-inspired algorithm for spatiotemporal learning and prediction based on sequential recall and vector symbolic architecture. A key novelty is the learning of spatial and temporal patterns as decoupled concepts where the temporal pattern sequences are constructed using the learned spatial patterns as an alphabet of elements. The decoupling, motivated by cognitive neuroscience research, provides the flexibility for fast and adaptive learning with dynamic changes to data and concept drift and as such is better suited for real-time learning and prediction. The algorithm further addresses several key computational requirements for predicting the next occurrences based on real-life spatiotemporal data, which have been found to be challenging with current state-of-the-art algorithms. Firstly, spatial and temporal patterns are detected using unsupervised learning from unlabeled data streams in changing environments; secondly, vector symbolic architecture (VSA) is used to manage variable-length sequences; and thirdly, hyper dimensional (HD) computing-based associative memory is used to facilitate the continuous prediction of the next occurrences in sequential patterns. The algorithm has been empirically evaluated using two benchmark and three time-series datasets to demonstrate its advantages compared to the state-of-the-art in spatiotemporal unsupervised sequence learning where the proposed ST-SOM algorithm is able to achieve 45% error reduction compared to HTM algorithm.", "venue": "Biomimetics", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "Biomimetics", "volume": "9"}, "authors": [{"authorId": "2083421", "name": "Thimal Kempitiya"}, {"authorId": "143775049", "name": "D. Alahakoon"}, {"authorId": "2276845387", "name": "Evgeny Osipov"}, {"authorId": "2037814642", "name": "Sachin Kahawala"}, {"authorId": "47848775", "name": "Daswin de Silva"}], "citations": []}
