{"paperId": "420f0bddc606d97c9a25f84a9b6508d6e9a477cd", "publicationVenue": null, "title": "Enhancing and securing cyber‐physical systems and Industry 4.0 through digital twins: A critical review", "abstract": "Due to the fierce competitive global market, enterprises need to face and overcome new challenges and requirements to stay ahead of competition. Cyber‐physical systems, Internet of things, and digital twins are some of the contemporary technologies that are used in the context of Industry 4.0 in order to instill intelligence into the industrial sector by changing traditional manufacturing to smart manufacturing. The digitalized and interconnected nature of Industry 4.0 creates new security, privacy, and safety challenges that need to be addressed in order for it to be fully realized. This study presents an overview regarding the use of digital twins as a means to reinforce and secure cyber‐physical systems and Industry 4.0, in general. Digital twins connect the physical and virtual worlds and can be used in combination with other technologies to provide several merits in various sectors, such as real‐time monitoring and controlling, prompt access to dynamic data, constant visualization and analysis, process optimization, advanced decision‐making, and prediction systems. All in all, based on the literature review, digital twins can constitute an essential tool for the realization, reinforcement, and security of cyber‐physical systems and Industry 4.0.", "venue": "J. Softw. Evol. Process.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-25", "journal": {"name": "Journal of Software: Evolution and Process", "volume": "35"}, "authors": [{"authorId": "30474774", "name": "G. Lampropoulos"}, {"authorId": "1693221", "name": "K. Siakas"}], "citations": [{"paperId": "1b3a3eaf2515a6d825366c8be6817604f0252b2a", "title": "The Role of Artificial Intelligence of Things in Achieving Sustainable Development Goals: State of the Art"}, {"paperId": "f90c7423e159fa15ab7801eab4f535b7b31b6e64", "title": "Blockchain in Smart Grids: A Bibliometric Analysis and Scientific Mapping Study"}, {"paperId": "c96fefe24b9fd53f93282f390bd194e3d8519150", "title": "Company Cybersecurity System: Assessment, Risks and Expectations"}, {"paperId": "420efd3564011e9c0ca52ba5ccfa7cb900b090f4", "title": "A Cyber Digital Twin Framework to Support Cyber-Physical Systems Security"}, {"paperId": "063ea65dee5e3c579e057a277347b0036d4dedb5", "title": "Vehicle system dynamics in digital twin studies in rail and road domains"}, {"paperId": "07381d2e92bfedc188530aa32739c6a3cb2efc1a", "title": "Artificial Intelligence, Blockchain, Big Data Analytics, Machine Learning and Data Mining in Traditional CRM and Social CRM: A Critical Review"}, {"paperId": "de735d0a197a0c3c8e8d5c3a47e85a97adb50520", "title": "An integrated outlook of Cyber-Physical systems for Industry 4.0: Topical practices, architecture, and applications"}, {"paperId": "fde0a76d7f756573b03a981980b97cebe90f1f5c", "title": "Feeding-as-a-Service in a cloud manufacturing environment"}]}
