{"paperId": "4220d9f5a6f77fcf65f1969143a6b1ab678d91b2", "publicationVenue": null, "title": "Digital Forensic Investigation on Social Media Platforms: A Survey on Emerging Machine Learning Approaches", "abstract": "An online social network is a platform that is continuously expanding, which enables groups of people to share their views and communicate with one another using the Internet. The social relations among members of the public are significantly improved because of this gesture. Despite these advantages and opportunities, criminals are continuing to broaden their attempts to exploit people by making use of techniques and approaches designed to undermine and exploit their victims for criminal activities. The field of digital forensics, on the other hand, has made significant progress in reducing the impact of this risk. Even though most of these digital forensic investigation techniques are carried out manually, most of these methods are not usually appropriate for use with online social networks due to their complexity, growth in data volumes, and technical issues that are present in these environments. In both civil and criminal cases, including sexual harassment, intellectual property theft, cyberstalking, online terrorism, and cyberbullying, forensic investigations on social media platforms have become more crucial. This study explores the use of machine learning techniques for addressing criminal incidents on social media platforms, particularly during forensic investigations. In addition, it outlines some of the difficulties encountered by forensic investigators while investigating crimes on social networking sites.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2275009476", "name": "©. Abdullahi"}, {"authorId": "2129698743", "name": "Aminu Kazaure"}, {"authorId": "2275015670", "name": "Mohd Aman Jantan"}, {"authorId": "2225121509", "name": "Najwadi Yusoff"}, {"authorId": "1404333198", "name": "Abdullahi Aminu Kazaure"}, {"authorId": "2275016017", "name": "Mohd Najwadi Yusoff"}], "citations": []}
