{"paperId": "422d88b77f79dbe5fccdd4c08be0dfaa0e14423d", "publicationVenue": null, "title": "Development of Product Quality with Enhanced Productivity in Industry 4.0 with AI Driven Automation and Robotic Technology", "abstract": "Automation and robotics have advanced significantly with the introduction of Industry 4.0, revolutionizing the manufacturing environment. This study examines the evolution of product quality in the context of Industry 4.0, concentrating on how robotic and AI-driven automation technologies help to increase productivity. Automation systems can efficiently analyze enormous volumes of data by integrating AI algorithms and machine learning capabilities, allowing for real-time monitoring and production process optimization. Utilizing AI-driven automation, manufacturers may increase task precision and accuracy, improving the quality of the final product. By enhancing human capacities and doing monotonous or physically taxing activities, robotic technology plays a significant role in Industry 4.0. AI-enabled advanced robots can collaborate with human workers, adapt to changing production conditions, and carry out intricate tasks quickly and accurately. Together, humans and robots are more productive and make fewer mistakes, which enhances the quality of the final output. Additionally, real-time defect or deviation detection and correction is possible with AI-driven quality control systems. These systems can detect quality problems at an early stage and take quick corrective action by analyzing sensor data and machine vision. Manufacturers can achieve uniform and standardized product quality while minimizing human error by automating quality control operations. Furthermore, proactive equipment monitoring and a lower chance of unforeseen breakdowns are made possible by the use of AI in predictive maintenance. AI algorithms can forecast maintenance requirements by examining sensor data and historical performance, enabling prompt repairs or replacements. In addition to increasing production by reducing downtime, this predictive strategy also helps to improve product quality by ensuring that machinery is running at peak efficiency.", "venue": "2023 Second International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-23", "journal": {"name": "2023 Second International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "pages": "184-189"}, "authors": [{"authorId": "50614001", "name": "Bechoo Lal"}, {"authorId": "2243995652", "name": "Vishnu Sakravarthy N"}, {"authorId": "2244310929", "name": "Marrapu Aswini Kumar"}, {"authorId": "2212147337", "name": "Narender Chinthamu"}, {"authorId": "1485692073", "name": "S. Pokhriyal"}], "citations": [{"paperId": "f0903bd50be12ca8446b3644406533667bc9683d", "title": "A survey-based approach of framework development for improving the application of internet of things in the construction industry of Malaysia"}, {"paperId": "358754446826527eb84a0737ad34625e62803347", "title": "AI-Powered Blockchain Technology in Industry 4.0, A Review"}]}
