{"paperId": "422df52d517e03b4da5911fa11a1c9928460a8cf", "publicationVenue": {"id": "87ad3a52-6dd9-45bd-a0f2-f87453c491ed", "name": "International Conference on Knowledge and Systems Engineering", "type": "conference", "alternate_names": ["KSE", "Int Conf Knowl Syst Eng", "Knowledge and Systems Engineering", "Knowl Syst Eng"], "url": "http://www.wikicfp.com/cfp/program?id=1922"}, "title": "W-PathSim++: the novel approach of topic-driven similarity search in large-scaled heterogeneous network with the support of Spark-based DataLog", "abstract": "Similarity measurement on objects in a HIN is considered as a challenging problem of networked data mining. There are several proposed models that are used to compute the similarity score between objects in the context of multi-typed objects and links network, such as most well-known PathSim, HeteSim, etc. which are considered as the meta-path-based approaches. However, these meta-path-based models involve the information loss due to the shortage of evaluating the similarity in the text data of content-based objects such as papers. Moreover, these models also encounter the shortage of evaluating the common neighbor relevancy between two pairwise objects. Furthermore, the capability of handling big networked data is also common challenge for prior similarity search models which are designed to work on standalone environment. Therefore, in this paper, we present the W-PathSim++ model which are the extended version of our previous work for solving the problems related to content-based similarity between objects in HIN mining. Moreover, our works in this paper also focus on improving the accuracy of similarity measurement between two objects via thoroughly evaluating their common neighborhood objects. The proposed model is also designed for taking the advantages of DataLog in network representation and meta-path querying as well as implementing within the Spark-based distributed environment in order to enable for handling large-scaled HINs. We test the W-PathSim++ model in compare with previous similarity measure approaches within DBLP dataset in order to demonstrate the effectiveness of our proposed model.", "venue": "International Conference on Knowledge and Systems Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-11-01", "journal": {"name": "2018 10th International Conference on Knowledge and Systems Engineering (KSE)", "pages": "102-106"}, "authors": [{"authorId": "143669653", "name": "P. Do"}, {"authorId": "144270183", "name": "Phu Pham"}], "citations": [{"paperId": "9c8f8673d29fe7ab944d070d80222305dde916c6", "title": "Citation Recommendation Based on Community Merging and Time Effect"}, {"paperId": "5103211b1e8b2100605763d4a88df4afe919a6fa", "title": "Storing, preprocessing and analyzing tweets: finding the suitable noSQL system"}, {"paperId": "8fe219b3d4d7fdc0d0c9e025fea16d94be48aed6", "title": "W-Metagraph2Vec: a novel approval of enriched schematic topic-driven heterogeneous information network embedding"}]}
