{"paperId": "42398f605f3f4d3b6a2014baddf08308e5b5958c", "publicationVenue": null, "title": "Efficient. Scalable and Robust Data Shuffle Service for Distributed MapReduce Computing on Cloud", "abstract": "Distributed Map Reduce computing frameworks, such as Hadoop, Spark, and Flink, are widely used in various domains which face big data challenges. Inside Map Reduce, Shuffle is a critical stage that bridges up the Map stage and Reduce stage through data partition and network transmission under the hood. With the rapidly growing scale of data and clusters, the all-to-all data transfer in Shuffle becomes inefficient and frequently fails, making Shuffle the bottleneck of many big data processing jobs. To improve the Shuffle efficiency, we propose a hybrid Shuffle model based on file pre-merging and partition reorganization mechanisms. To address the Shuf-fle stability issue, we design a novel data transmission model based on the replication mechanism. Finally, to support scalable Shuffle with high performance, we present a Shuffle parallelism degree tuning approach based on machine learning and searching techniques. We have implemented the proposed Shuffle models and strategies into the widely-used MapReduce-based big data platform Spark for evaluation. Experimental evaluation shows that, compared with the state-of-the-art systems, our proposed methods outperform them by 23% on average. As a practical application case, the proposed Shuffle service has been running in the real-world environment of ByteDance. Inc over one year with significant performance improvement.", "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "pages": "337-346"}, "authors": [{"authorId": "2163400100", "name": "Rong Gu"}, {"authorId": "2213459716", "name": "Xu Huang"}, {"authorId": "1799298", "name": "Haipeng Dai"}, {"authorId": "2186123851", "name": "Xiaoyu Geng"}, {"authorId": "2117025111", "name": "Xiaofei Chen"}, {"authorId": "46844324", "name": "Yihua Huang"}, {"authorId": "2057533533", "name": "Fu Xiao"}, {"authorId": "2144043665", "name": "Guihai Chen"}], "citations": []}
