{"paperId": "423c1e2f0d74033c1f9a09546b6297ce7da80f7b", "publicationVenue": {"id": "5d24d24c-e06c-4bd9-a352-e8c01e3336cc", "name": "Asia Pacific Journal of Health Management", "type": "journal", "alternate_names": ["Asia Pac j health manag", "Asia Pac J Health Manag", "Asia Pacific journal of health management"], "issn": "1833-3818", "url": "https://journal.achsm.org.au/"}, "title": "Examining Challenges In The Adoption of Big Data In Health Care Institutions And Its Impact On Patients Satisfaction: An empirical study in Delhi, India", "abstract": "The study aims to investigate the obstacles and factors influencing the adoption of big data in healthcare organizations, and its subsequent impact on patient satisfaction. Big data in healthcare refers to the collecting, analysis, and use of clinical data from patients that is too massive or complex to be grasped by standard data processing methods. Adopting big data in health care will enable manages to render services to patient and customer satisfaction. However, in the health care sector, firms must overcome several hurdles and problems by adopting new technology. A detailed literature review was undertaken to examine many obstacles associated with the use of Big Data. A well-structured questionnaire was prepared in Likert scale to find the elements that influence big data adoption and its impact on patient satisfaction. To evaluate factors, exploratory factor analysis using SPSS 21 was performed, and Structural Equation Modelling (SEM) was performed to assess key significant factors that impact patient satisfaction. The data was gathered from employees associated with the hospitals. The survey received responses from 212 participants. Following the analysis of the data, it was found that five challenging factors influences big data adoption. These are data integration, data understanding, technology and infrastructure, lack of expert and regulation barrier. These factors explained 70.36% of variance. Whereas, SEM analysis indicated that both data integration, data understanding and lack of expertise significantly affect big data adoption Furthermore, big data adoption in hospitals will help in improving patient satisfaction.", "venue": "Asia Pacific Journal of Health Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-05", "journal": {"name": "Asia Pacific Journal of Health Management"}, "authors": [{"authorId": "100569273", "name": "A. Sao"}, {"authorId": "2238268694", "name": "Neetu Sharma"}, {"authorId": "2004315673", "name": "Sakshee Singh"}, {"authorId": "2238297956", "name": "Bharati Vishwas Yelikar"}, {"authorId": "2238254493", "name": "Anoop Bhardwaj"}], "citations": []}
