{"paperId": "423d041626cc83ac610a909d59ea89185d78736f", "publicationVenue": null, "title": "Toward Responsible AI: An Overview of Federated Learning for User-centered Privacy-preserving Computing", "abstract": "With the rapid advances of Artificial Intelligence (AI) technologies and applications, an increasing concern is on the development and application of responsible AI technologies. Building AI technologies or machine-learning models often requires massive amounts of data, which may include sensitive, user private information to be collected from different sites or countries. Privacy, security, and data governance constraints rule out a brute force process in the acquisition and integration of these data. It is thus a serious challenge to protect user privacy while achieving high-performance models. This article reviews recent progress of federated learning in addressing this challenge in the context of privacy-preserving computing. Federated learning allows global AI models to be trained and used among multiple decentralized data sources with high security and privacy guarantees, as well as sound incentive mechanisms. This article presents the background, motivations, definitions, architectures, and applications of federated learning as a new paradigm for building privacy-preserving, responsible AI ecosystems.", "venue": "ACM Trans. Interact. Intell. Syst.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-31", "journal": {"name": "ACM Trans. Interact. Intell. Syst.", "pages": "32:1-32:22", "volume": "11"}, "authors": [{"authorId": "153096457", "name": "Qiang Yang"}], "citations": [{"paperId": "00b3b611588ad3c309b5b227f9e532eba51edada", "title": "Approximate DBSCAN on obfuscated data"}, {"paperId": "5a4be2dae10ae8a4fef900a5f72587ae8379bd00", "title": "Decentralized Federated Learning: A Survey on Security and Privacy"}, {"paperId": "df911f037ed8c7635d8c5ade2f0d8d6bab2dc107", "title": "Artificial Intelligence (AI) in Garment Design: Opportunities and Challenges in the Ready-Made Garments (RMG) Sector of Bangladesh"}, {"paperId": "8f95de88a6b76022931ca4a46201302d008bd2a4", "title": "The knowledge and innovation challenges of ChatGPT: A scoping review"}, {"paperId": "e4a2889ec047fb89e00c7ccbc5744383265470f8", "title": "Towards democratization of digital twins: Design principles for transformation into a human-building interface"}, {"paperId": "713ae494b020cf17e79408ea767e2fcaa4010a08", "title": "Communication Analysis and Privacy in CAI Based on Data Mining and Federated Learning"}, {"paperId": "c4e9f6433ba328212958c4dedba589b45f13d052", "title": "Bayesian Federated Learning: A Survey"}, {"paperId": "4e90c824cb9082cceb25a2f6bdba4a363b71a3c1", "title": "DCFL: Dynamic Clustered Federated Learning under Differential Privacy Settings"}, {"paperId": "0f8dea3cbd1ac39df7849b33bf9cc381f731524e", "title": "Federated Learning for Condition Monitoring of Industrial Processes: A Review on Fault Diagnosis Methods, Challenges, and Prospects"}, {"paperId": "86dfcb4f18e5f44425cf06790bdb294e61773443", "title": "Refacing Defaced MRI with PixelCNN"}, {"paperId": "8e00277d353b59e90190344c5c64a7e4b1ad8d2d", "title": "Privacy-Preserving Aggregation in Federated Learning: A Survey"}, {"paperId": "8f61273a97f57f8ec8fb72c9bd548549bbec8f90", "title": "MarS-FL: Enabling Competitors to Collaborate in Federated Learning"}, {"paperId": "07ce1c6552a2e8967d59a59bc880b1f0007935fb", "title": "Responsible AI: Concepts, critical perspectives and an Information Systems research agenda"}]}
