{"paperId": "4270ee72fbd690fa27dc15523551f682a90a5309", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Strategic Key Elements in Big Data Analytics as Driving Forces of IoT Manufacturing Value Creation: A Challenge for Research Framework", "abstract": "Big Data (BD)-driven business intelligence (BI) is considered to be a new development stage within industrial engineering management to achieve higher business value creation. The article provides extensive research of BD-driven approaches to identify strategic knowledge and value-creating components within Internet of Things (IoT) manufacturing. Due to previous research studies focused mostly on partial solutions and lack a holistic view, this article topic is still far from being sufficiently explored and resolved. The article presents the results of an extensive research study of contemporary professional literature with a specific aim to provide a more holistic and systematical view on the current state and future trends in this issue. To solve this high complex research problem, both quantitative and qualitative research methodology approaches are used. The article is primarily based on a systematic literature review covering 187 essential and 36 additional current research papers within the Web of Science and Scopus database from 2012 to the present. Research findings identify the seven key strategic elements determining that Big Data analytics (BDA) can become a real and tremendous business value creation driver within IoT intelligent manufacturing. These research results provide important conclusions and implications for challenging future investigations into BDA and BI systems in the context of advancing the Industry 4.0 revolution. In conclusion, we propose a final suggestion in the form of a strategic future research chain from IoT through BDA to value creation based on BD intelligence within IoT manufacturing, whereas seven strategic elements might play a crucial.", "venue": "IEEE transactions on engineering management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-18", "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "1-16", "volume": "PP"}, "authors": [{"authorId": "37970070", "name": "R. Rajnoha"}, {"authorId": "2141932883", "name": "Jakub Hadac"}], "citations": [{"paperId": "1fc241f6f070e139b5b38a4439eeef7c78671d42", "title": "From data to data asset: conceptual evolution and strategic imperatives in the digital economy era"}, {"paperId": "fb5e621fd31a8f0d5116d4d2e2beb2d11b5a7361", "title": "Investigating Healthcare 4.0 Transition Through a Knowledge Management Perspective"}, {"paperId": "24d0f856653f9843bb9056eac30fb120f949cbf8", "title": "Convergence or Divergence: A Computational Text Analysis of Stakeholder Concerns on Manufacturing Upgrading in China"}]}
