{"paperId": "42720a90a978a93e59c67a278e5a35718e1d5df7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Discovery of Frequent Patterns of Episodes Within a Time Window for Alarm Management Systems", "abstract": "The sequential pattern mining field is expanding through numerous researches and has a large number of applications such as language processing, alarms management and event management on a broader scale. Its use began with processing items baskets to learn patterns and have a directed marketing strategy but it is generalized to telecommunication alarms management with several works. Our work is in line with this, as it tries to locate patterns and identify them to make predictive statements about certain patterns. It is axed around providing a way to break sequences into episodes and assigning them a value of confidence and support, more precisely in the discovery of frequent patterns of episodes within a time window. Experimental results have shown the effectiveness of our sequential pattern mining approach and its adaptability to alarm management and analytics.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-10", "journal": {"name": "IEEE Access", "pages": "11061-11073", "volume": "8"}, "authors": [{"authorId": "1943339", "name": "Adel Hidri"}, {"authorId": "2079499062", "name": "Ahmed Selmi"}, {"authorId": "8649470", "name": "Minyar Sassi Hidri"}], "citations": [{"paperId": "edab59859126c6eeb793a43ee8e3902ee0d1f240", "title": "The evaluation of occupational accident with sequential pattern mining"}, {"paperId": "daa546b8f8e46377decafb375c62921d9def45d5", "title": "An analysis of process fault diagnosis methods from safety perspectives"}, {"paperId": "c17ec9a1f067fe631dc17d92e2675ace8b822585", "title": "A Scalable Analytical Framework for Complex Event Episode Mining With Various Domains Applications"}]}
