{"paperId": "427a33a818aeeb79526bc19a936990178c266d65", "publicationVenue": {"id": "18cb41bf-d23d-4c47-a30d-3f1ef6abfb1b", "name": "IoT", "issn": "2624-831X", "url": "https://www.mdpi.com/journal/IoT"}, "title": "Using Dynamic Perceptually Important Points for Data Reduction in IoT", "abstract": "Massive amounts of data are generated from various Internet of Things (IoT) devices. Handling these data requires resources and as data volumes increase, the resource requirements increase too. For example, more storage and processing resources are required for downstream tasks such as predictive analytics in the cloud. Furthermore, the transmission of these data results in an increased energy consumption and congestion of network resources. IoT data reduction is one of the solutions to handle some of these resource issues. However, how to reduce data volume without affecting the integrity and pattern of the data for downstream monitoring tasks is a challenge. Moreover, investigating the effects of data reduction on the accuracy of prediction models is often ignored. Therefore, in this paper, a new data reduction algorithm has been proposed for delay-tolerant applications. It has three cases, namely best, good and worst. In the best, the approach forwards an average value. In the good case, the approach sends important data points using Perceptually Important Point (PIP) algorithm. All of the data in a window is forwarded in the worst case, preserving the data pattern when there are many important data points. In this paper, the performance of the approach is examined. The paper presents the trade-off between reduced data and the accuracy of the downstream machine learning and deep learning tasks as well as the time complexity of the approach. For comparison, three algorithms from the literature have also been implemented and tested on a NASA turbofan engine time-series dataset. The results show that the proposed algorithm reduces data size by almost half while maintaining the accuracy of the prediction task.", "venue": "IoT", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-11-08", "journal": {"name": "Proceedings of the 11th International Conference on the Internet of Things"}, "authors": [{"authorId": "3385369", "name": "Taimur Hafeez"}, {"authorId": "1797885", "name": "G. Mcardle"}], "citations": [{"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}, {"paperId": "01cd7f09765ef2d325dc95bf87119a78c2907577", "title": "Accuracy-Aware Data Reduction for Internet of Things"}]}
