{"paperId": "42894148d39b8e903efde0ed6a7d6fa06983f3b3", "publicationVenue": {"id": "a2802f40-c210-444a-92bf-62245b599bb1", "name": "EDBT/ICDT Workshops", "type": "conference", "alternate_names": ["EDBT-ICDT", "EDBT/ICDT Work"]}, "title": "In-memory Caching for Multi-query Optimization of Data-intensive Scalable Computing Workloads", "abstract": "In modern large-scale distributed systems, analytics jobs submitted by various users often share similar work. Instead of optimizing jobs independently, multi-query optimization techniques can be employed to save a considerable amount of cluster resources. In this work, we introduce a novel method combining in-memory cache primitives and multi-query optimization, to improve the efficiency of data-intensive, scalable computing frameworks. By careful selection and exploitation of common (sub) expressions, while satisfying memory constraints, our method transforms a batch of queries into a new, more efficient one which avoids unnecessary recomputations. To find feasible and efficient execution plans, our method uses a cost-based optimization formulation akin to the multiple-choice knapsack problem. Experiments on a prototype implementation of our system show significant benefits of worksharing for TPC-DS workloads.", "venue": "EDBT/ICDT Workshops", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "pages": "1-8", "volume": ""}, "authors": [{"authorId": "143822502", "name": "Pietro Michiardi"}, {"authorId": "143751888", "name": "D. Carra"}, {"authorId": "1711623", "name": "S. Migliorini"}], "citations": [{"paperId": "d2c2f9f33d433cc77a9b753f44cc51fa459e3521", "title": "S/C: Speeding up Data Materialization with Bounded Memory"}, {"paperId": "92fd7d63a3d5993e645ceb284606782b54d12b18", "title": "A Unified Approach to Spatial Proximity Query Processing in Dynamic Spatial Networks"}, {"paperId": "15bfc384fc8ef43c2c4f3d43a4905f5e690406e6", "title": "Exploiting Sharing Join Opportunities in Big Data Multiquery Optimization with Flink"}, {"paperId": "17c4fa566311b04f6e00290afd5795e50a0056e2", "title": "SparkCruise: Handsfree Computation Reuse in Spark"}, {"paperId": "792fdb006a9b46354702aa67b37532a6c0b62e80", "title": "Cache-Based Multi-Query Optimization for Data-Intensive Scalable Computing Frameworks"}, {"paperId": "e140ff9bc1bd92c3b107c228ebf6accfcd9b643d", "title": "A Hybrid Multi-Query Optimization Technique Combining Sub-Expression and Materialized View Reuse"}, {"paperId": "9649d31f4d3bc740c95400e11be9759b259b2083", "title": "Group Processing of Multiple k-Farthest Neighbor Queries in Road Networks"}]}
