{"paperId": "428a9b19d8e2e425b6e9bfc993a5b75250e2df8c", "publicationVenue": null, "title": "Energy Efficient Smart Wearables for the Advance Ubiquitous Applications in the era of Smart Health using Big Data", "abstract": "For the IoT to succeed, every conceivable item must be linked together (healthcare sensors, cameras, household appliances, smart phones, wearable sensors, etc.). As a result, dependable ways of data storage and processing are required to cope with the vast amounts of information created by all of these channels. Cloud computing is a new method being developed to solve this issue. However, some applications (healthcare) necessitate minimal latency and delay since they must process data in real time to increase performance. One of the promising technologies that help the healthcare sector is fog computing since it helps with things like multihop data connection delays, resource distribution, and service flexibility. This research proposes a fog-based IoT healthcare system to reduce the power needs of individual fog nodes. The experimental outcomes demonstrate the effectiveness of the suggested framework with regards to network delay and power consumption. In addition, the authors discussed and made suggestions for key services of big data infrastructure that should be available in fog devices for healthcare big data analytics.", "venue": "2022 International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-24", "journal": {"name": "2022 International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "pages": "836-844"}, "authors": [{"authorId": "48440797", "name": "Upinder Kaur"}, {"authorId": "2162248849", "name": "Murali Dhar M S"}, {"authorId": "2174389291", "name": "M. Reka"}, {"authorId": "2202017043", "name": "S. Vidya Priya Darcini"}, {"authorId": "2150738384", "name": "Tulasi Radhika Patnala"}, {"authorId": "2136697834", "name": "Muzeeb Khan Patan"}], "citations": [{"paperId": "194859b6b46d766539377e8695050c5e8a5b42cf", "title": "Design of an energy-efficient IOT device-assisted wearable sensor platform for healthcare data management"}]}
