{"paperId": "428c1fc18d72ca6731b4197c826b8ee7b3ab88c1", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Modeling Global Distribution for Federated Learning with Label Distribution Skew", "abstract": "Federated learning achieves joint training of deep models by connecting decentralized data sources, which can significantly mitigate the risk of privacy leakage. However, in a more general case, the distributions of labels among clients are different, called ``label distribution skew''. Directly applying conventional federated learning without consideration of label distribution skew issue significantly hurts the performance of the global model. To this end, we propose a novel federated learning method, named FedMGD, to alleviate the performance degradation caused by the label distribution skew issue. It introduces a global Generative Adversarial Network to model the global data distribution without access to local datasets, so the global model can be trained using the global information of data distribution without privacy leakage. The experimental results demonstrate that our proposed method significantly outperforms the state-of-the-art on several public benchmarks. Code is available at \\url{https://github.com/Sheng-T/FedMGD}.", "venue": "Social Science Research Network", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-17", "journal": {"name": "ArXiv", "volume": "abs/2212.08883"}, "authors": [{"authorId": "2055302465", "name": "Tao Sheng"}, {"authorId": "2088079669", "name": "Cheng Shen"}, {"authorId": "2143862419", "name": "Yuan Liu"}, {"authorId": "2148234247", "name": "Yeyu Ou"}, {"authorId": "48500635", "name": "Zhe Qu"}, {"authorId": "2196115405", "name": "Jianxin Wang"}], "citations": [{"paperId": "ce611d07c10f3d200cee9e09dda1fbc14c7954da", "title": "Personalized federated adaptive regularization for heterogeneous medical image classification: COVID-19 CT results"}, {"paperId": "7e299473f60dc3c60752f2a8e8d794fdd3d897a5", "title": "A Survey of Federated Learning From Data Perspective in the Healthcare Domain: Challenges, Methods, and Future Directions"}]}
