{"paperId": "429c38428be5d968a17dd0e9f5e1397d1fb44669", "publicationVenue": {"id": "1cb2de36-251d-439b-b464-86bb97907c14", "name": "Social science computer review", "type": "journal", "alternate_names": ["Social Science Computer Review", "Soc sci comput rev", "Soc Sci Comput Rev"], "issn": "0894-4393", "url": "http://www.sagepub.com/journals/Journal200948/title", "alternate_urls": ["https://journals.sagepub.com/home/ssc", "http://ssc.sagepub.com/"]}, "title": "Less Fragmented but Highly Centralized: A Bibliometric Analysis of Research in Computational Social Science", "abstract": "Since its inception, computational social science (CSS) has been characterized as an interdisciplinary field. Nevertheless, unlike a mature interdisciplinary field that duly integrates knowledge beyond disciplinary boundaries, CSS has arguably been fragmented into multiple lines of inquiry. Although such fragmentation has been a constant concern, limited empirical evidence exists to substantiate any degree of integration in research on CSS. To systematically map the landscape of research on CSS, we examined the dynamic topology of the bibliometric network of CSS during the past 20 years. By comparing the structure of the coupling network and the co-subject network with three prototypical network models that we simulated—the centralized model, the fragmented model, and the cohesive model—our analysis revealed that the citation networks of research on CSS are highly centralized but less fragmented than often assumed. Beyond that, a driving factor shaping the coupling network’s cohesive structure is the citation to high-impact articles. Those and other findings contribute to current understandings of the process of integration in the evolution of disciplines.", "venue": "Social science computer review", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-02", "journal": {"name": "Social Science Computer Review", "pages": "946 - 966", "volume": "41"}, "authors": [{"authorId": "48630717", "name": "Xiaohui Wang"}, {"authorId": "1927682", "name": "Yunya Song"}, {"authorId": "51300943", "name": "Youzhen Su"}], "citations": [{"paperId": "31c7d85a92b170be5a2733220666a8e56e56be17", "title": "Adaptation planning for climate change: An application of the advanced bibliometric analytical framework"}]}
