{"paperId": "429d097fa1f347ff4f5e06609d21c369dec2e8b6", "publicationVenue": null, "title": "Predicting Carbon Dioxide Emissions with the Orange Application: An Empirical Analysis", "abstract": "The effects of climate change, such as droughts, storms, and extreme weather, are increasingly being felt around the world. Greenhouse gases are the primary contributors to climate change, with carbon dioxide (CO2) being the most significant. In fact, CO2 accounts for a significant percentage of all greenhouse gas emissions. As a result, reducing CO2 emissions has become a critical priority for mitigating the impacts of climate change and preserving our planet for future generations. Based on simulation and data mining technologies that use historical data, CO2 is expected to continue to rise. Around the world, 80% of CO2 emissions come from burning fossil fuels, mostly in the automotive or manufacturing industries. Governments have created policies to control CO2 emissions by focusing them on either consumers or manufacturers, in both developed and developing nations. Within the scope of this project, an investigation of vehicle emissions will be carried out using various attributes included within the vehicle dataset, as well as the use of many data mining techniques via the utilization of an orange application. The practical program is an example of organization, and the example will be about cars, exploring data, and figuring out how much gas will be needed. CO2 is taken away from cars, and we will use the CARS.csv file, which has data for a group of car types. It has a table with 36 records that shows the model, weight, and amount of carbon dioxide based on the car's size and weight.", "venue": "Mesopotamian Journal of Computer Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-30", "journal": {"name": "Mesopotamian Journal of Computer Science"}, "authors": [{"authorId": "2213244578", "name": "israa ezzat"}, {"authorId": "2133481217", "name": "Alaa Wagih Abdulqader"}], "citations": [{"paperId": "cd4368803bb1c4cd74a9eab6c78ba617827ab76c", "title": "Effectual Text Classification in Data Mining: A Practical Approach"}]}
