{"paperId": "42a58d723284834d040db43c83e83e58e5fb92a0", "publicationVenue": null, "title": "This Paper Is Included in the Proceedings of the 12th Usenix Symposium on Operating Systems Design and Implementation (osdi '16). Ec-cache: Load-balanced, Low-latency Cluster Caching with Online Erasure Coding Ec-cache: Load-balanced, Low-latency Cluster Caching with Online Erasure Coding", "abstract": "Data-intensive clusters and object stores are increasingly relying on in-memory object caching to meet the I/O performance demands. These systems routinely face the challenges of popularity skew, background load imbalance , and server failures, which result in severe load imbalance across servers and degraded I/O performance. Selective replication is a commonly used technique to tackle these challenges, where the number of cached replicas of an object is proportional to its popularity. In this paper, we explore an alternative approach using era-sure coding. EC-Cache is a load-balanced, low latency cluster cache that uses online erasure coding to overcome the limitations of selective replication. EC-Cache employs erasure coding by: (i) splitting and erasure coding individual objects during writes, and (ii) late binding, wherein obtaining any k out of (k + r) splits of an object are sufficient, during reads. As compared to selective replication, EC-Cache improves load balancing by more than 3× and reduces the median and tail read latencies by more than 2×, while using the same amount of memory. EC-Cache does so using 10% additional bandwidth and a small increase in the amount of stored metadata. The benefits offered by EC-Cache are further amplified in the presence of background network load imbalance and server failures.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2453556", "name": "K. V. Rashmi"}, {"authorId": "144161012", "name": "K. Ramchandran"}, {"authorId": "2288980934", "name": "Mosharaf Chowdhury"}, {"authorId": "8500842", "name": "J. Kosaian"}, {"authorId": "144467753", "name": "I. Stoica"}], "citations": [{"paperId": "0094ecdcd791b573ad51af282d8c846e65c77110", "title": "Elastic Reed-Solomon Codes for Efficient Redundancy Transitioning in Distributed Key-Value Stores"}, {"paperId": "61c501389d3ef0881a6f11d314e0910a1f198d93", "title": ": Erasure-Coded Multi-Source Streaming for UHD Videos Within Cloud Native 5G Networks<inline-formula><tex-math notation=\"LaTeX\"/><alternatives><mml:math><mml:mi mathvariant=\"sans-serif\"/></mml:math><inline-graphic xlink:href=\"pu-ieq1-3238356.gif\"/></alternatives></inline-formula>"}, {"paperId": "be37a418c8c08083e1cd5c30de0816d82338bf84", "title": "Advanced Elastic Reed–Solomon Codes for Erasure-Coded Key–Value Stores"}, {"paperId": "5fc06c970cfda06fb6c51e98097df96b67ae7628", "title": "Enabling Efficient Erasure Coding in Disaggregated Memory Systems"}, {"paperId": "8cd11b65856550b3aff2c05b75f55da6a85c3afb", "title": "Adaptive Data Placement in Multi-Cloud Storage: A Non-Stationary Combinatorial Bandit Approach"}, {"paperId": "c8c1fbeae20c1b299591f3267e49c335dbff4a8d", "title": "A Note on Bandwidth-Optimal Repair Scheme for Reed-Solomon Codes With Low Repair Locality"}, {"paperId": "0337318f1abaaaf96229e089c92f64d0d9bdbd4c", "title": "FIFO queues are all you need for cache eviction"}, {"paperId": "6096a8c76e22816573453b9d2adfae381da825a0", "title": "Toward Optimal Repair and Load Balance in Locally Repairable Codes"}, {"paperId": "928ddeb3222f36df9c1dd72d84bcde997f077e93", "title": "Efficient Fault Tolerance for Recommendation Model Training via Erasure Coding"}, {"paperId": "57d5ceb4066d8e67c7aeff23467eef1dde253b99", "title": "FIFO can be Better than LRU: the Power of Lazy Promotion and Quick Demotion"}, {"paperId": "90f2cbe95586a1dbb7a8caa710bad3fa321d7730", "title": "On-demand Container Loading in AWS Lambda"}, {"paperId": "760203dffaf8635b81e84f5bf30b039f5bf5e482", "title": "Smash: Flexible, Fast, and Resource-efficient Placement and Lookup of Distributed Storage"}, {"paperId": "65420fb10695808772f6766f0b0224dfba6405a3", "title": "Memory Disaggregation: Advances and Open Challenges"}, {"paperId": "2ae005dfe2086e8fe20d939cb39067446921062a", "title": "Adaptive and Scalable Caching With Erasure Codes in Distributed Cloud-Edge Storage Systems"}, {"paperId": "dfe207d1941e585575d70e004d44699068ca425b", "title": "Meeting Coflow Deadlines in Data Center Networks With Policy-Based Selective Completion"}, {"paperId": "a4949eaac3d7d54d887cd88abb3139d114c9496c", "title": "Extending and Programming the NVMe I/O Determinism Interface for Flash Arrays"}, {"paperId": "81ca0102cab7a6d8a2ef88bc684b718767580819", "title": "RCS: A Redirection Computational Scheduler to Accelerate Straggler Recovery for Erasure Coded Cloud Storage System"}, {"paperId": "fbea2338a85e567949574bac92812ae9349b3599", "title": "Repair-Optimal Data Placement for Locally Repairable Codes with Optimal Minimum Hamming Distance"}, {"paperId": "610e6a250cfdf0c496e5c63cf1c0acf6a1335cb8", "title": "LoomIO: Object-Level Coordination in Distributed File Systems"}, {"paperId": "ac25953e902855680b468279c2167d1637dbd350", "title": "Layered Contention Mitigation for Cloud Storage"}, {"paperId": "17447f9a8a7a6d792f4917ccabe0cf7433373eb4", "title": "Short Tail: taming tail latency for erasure-code-based in-memory systems"}, {"paperId": "74e39c52cdfdc7e2a9fb288f2a5a4301c238db95", "title": "POCache: Toward robust and configurable straggler tolerance with parity-only caching"}, {"paperId": "4e6157ff17c2d737049ec043ea7ec5121d977dbd", "title": "Understanding the performance of erasure codes in hadoop distributed file system"}, {"paperId": "0f5686f4a3b9c0af3b945fd2e12e1d4bf5ef1f76", "title": "RAIL: Predictable, Low Tail Latency for NVMe Flash"}, {"paperId": "9a374c2aa04d0428a3bc8d6e8526a9c19ed7e44e", "title": "The Serverless Computing Survey: A Technical Primer for Design Architecture"}, {"paperId": "1c0a3b2773dac98043622ff38e9151cfe04e9b43", "title": "LEGOStore: A Linearizable Geo-Distributed Store Combining Replication and Erasure Coding"}, {"paperId": "6f7218b0c4d10a93756a11c358ab0d69a19bcad2", "title": "LogECMem: Coupling Erasure-Coded In-Memory Key-Value Stores with Parity Logging"}, {"paperId": "bc21043ecd2f88acfe2317e29775d89aed004516", "title": "Geometric Partitioning: Explore the Boundary of Optimal Erasure Code Repair"}, {"paperId": "99aff66b2fe14b5902c72e616f4bd48a3571c815", "title": "IODA: A Host/Device Co-Design for Strong Predictability Contract on Modern Flash Storage"}, {"paperId": "82c29f19a0ac9f602ba02ba07e836a39c382a695", "title": "Following the Data, Not the Function: Rethinking Function Orchestration in Serverless Computing"}, {"paperId": "84b80e87b7ec94e696dc546d9ef8b3756b6384f9", "title": "Enabling Low-Redundancy Proactive Fault Tolerance for Stream Machine Learning via Erasure Coding"}, {"paperId": "3f85da3bfa2779f808e66fc02bbbf89efdcbf25d", "title": "A Holistic Approach to Data Access for Cloud-Native Analytics and Machine Learning"}, {"paperId": "1c1db907c71cf07379441234eed25ccbd4a5d5fd", "title": "Fast Reconstruction for Large Disk Enclosures Based on RAID2.0"}, {"paperId": "84de27f6a448728244287a3a8a5b96ed20764323", "title": "Unifying the data center caching layer: feasible? profitable?"}, {"paperId": "01cd1cf3119686cfe8dad1fc9934e4ce7b8a4825", "title": "Popularity-based full replica caching for erasure-coded distributed storage systems"}, {"paperId": "d67abb8a0e9b99d109f308c5c0d9efe7e442651b", "title": "An energy-saving routing algorithm for opportunity networks based on asynchronous sleeping mode"}, {"paperId": "09fcc7ed1f867bcf9133ab12065ee7366cfaa652", "title": "ECRM: Efficient Fault Tolerance for Recommendation Model Training via Erasure Coding"}, {"paperId": "41d04aa3c25dcfbf1b44ce666c48759e03c216c7", "title": "tf.data: A Machine Learning Data Processing Framework"}, {"paperId": "f11a70dd19f2a1fe6a4bbe71bef10a3b4f6dddb1", "title": "Optimal Caching for Low Latency in Distributed Coded Storage Systems"}, {"paperId": "adcb56b0d9ea7129f4bc82bf6fdd7bb2bf9cb62c", "title": "Traffic-Aware Erasure-Coded Archival Schemes for In-Memory Stores"}, {"paperId": "830b27847ebf81ab369b291bf1ae5ab95ebd8540", "title": "NVMCache: Wear-Aware Load Balancing NVM-based Caching for Large-Scale Storage Systems"}, {"paperId": "a364dd64577fafcf2bb659b3817f5602fd201cf0", "title": "CassandrEAS: Highly Available and Storage-Efficient Distributed Key-Value Store with Erasure Coding"}, {"paperId": "d1c559ed0d1b58b7fe6c604192d2b5d72d13b8fa", "title": "INEC: Fast and Coherent In-Network Erasure Coding"}, {"paperId": "87146382c118ebd634ac835bc834f37f959d2372", "title": "Pegasus: Tolerating Skewed Workloads in Distributed Storage with In-Network Coherence Directories"}, {"paperId": "c1e2f7339d4bb76df15c446e9764d07aef71662b", "title": "Liquid Data Networking"}, {"paperId": "76603f2fc161ef5776dc8024637c049557409c7e", "title": "Service Rate Region: A New Aspect of Coded Distributed System Design"}, {"paperId": "c630373e3bcbcfe0ee8874f9e248fa69d880ac6d", "title": "Enabling I/O-Efficient Redundancy Transitioning in Erasure-Coded KV Stores via Elastic Reed-Solomon Codes"}, {"paperId": "6f6b974e2f701dbb8d1fb10c5bb4088049840c66", "title": "Selective Coflow Completion for Time-sensitive Distributed Applications with Poco"}, {"paperId": "491208cc2b78e9b4a7a8575fc10b657fee619752", "title": "Balancing Fairness and Efficiency for Cache Sharing in Semi-external Memory System"}, {"paperId": "667741092a681f2e9b041d14164d7db844d64799", "title": "Caching with Delayed Hits"}, {"paperId": "e80fa3482966618806d7f6fb3ec5e288c8422f44", "title": "RepBun: Load-Balanced, Shuffle-Free Cluster Caching for Structured Data"}, {"paperId": "c0efcbad169910782c3d17d08c689c43dd2bc631", "title": "StragglerHelper: Alleviating Straggling in Computing Clusters via Sharing Memory Access Patterns"}, {"paperId": "0dc5207a2759f07b46b67dcf1f320cf4f88ec943", "title": "EC-Fusion: An Efficient Hybrid Erasure Coding Framework to Improve Both Application and Recovery Performance in Cloud Storage Systems"}, {"paperId": "d31b6e2991f494373eb27744b097471ffb319c2b", "title": "Quiver: An Informed Storage Cache for Deep Learning"}, {"paperId": "96e24682b8b642e59697200d96bcfb02ec76eee9", "title": "Achieving Load-Balanced, Redundancy-Free Cluster Caching with Selective Partition"}, {"paperId": "3ccbf5113f15c1e54a2df46de62db6ea7044853e", "title": "InfiniCache: Exploiting Ephemeral Serverless Functions to Build a Cost-Effective Memory Cache"}, {"paperId": "49a1d9e5a81eb8d194ac4b2a387773267d1e1fcf", "title": "Scalable and Efficient Data Management in Distributed Clouds : Service Provisioning and Data Processing"}, {"paperId": "311771142d6e48f9e1e1c8ac57f93503674258c4", "title": "HSPP: Load-Balanced and Low-Latency File Partition and Placement Strategy on Distributed Heterogeneous Storage with Erasure Coding"}, {"paperId": "b5ff6a0797455e131fa88d19a4888f9f7e05d542", "title": "EC-ARR: Using Active Reconstruction to Optimize SSD Read Performance"}, {"paperId": "46ee001ba6b3df02be40f214290f446b3a85754f", "title": "Coupling Decentralized Key-Value Stores with Erasure Coding"}, {"paperId": "b6a92f130ac0afaa562cd908323763879a927319", "title": "TriEC: tripartite graph based erasure coding NIC offload"}, {"paperId": "c5ed3d1a2ce418610a6fc9b5520a4f845279969a", "title": "Parity models: erasure-coded resilience for prediction serving systems"}, {"paperId": "a849454dcb927488f44d361915c3436ad5a31639", "title": "Hydra : Resilient and Highly Available Remote Memory"}, {"paperId": "bc569ac5588f3b1db9dba76f14d7ed842256a9ac", "title": "Mitigating the Performance-Efficiency Tradeoff in Resilient Memory Disaggregation"}, {"paperId": "b19f821b0a6059b7eaba37f8e0b276e4b586cd85", "title": "Is it Time to Revisit Erasure Coding in Data-Intensive Clusters?"}, {"paperId": "9699fc774a08d5c5c118420642c3bc1eb4602c7c", "title": "A Generic Construction for All Parameters in Minimum Storage Regenerating Codes"}, {"paperId": "ef0e3899abfc0f73890edaa3f89cfcabd7e8e6ce", "title": "TEA: A Traffic-efficient Erasure-coded Archival Scheme for In-memory Stores"}, {"paperId": "3da7a3cb1b338b70ce7761e1d8eadb9b8a244a57", "title": "Enabling Data Processing under Erasure Coding in the Fog"}, {"paperId": "8300cd088648e7c82f7a0701e0931f3377510c4f", "title": "Yugong: Geo-Distributed Data and Job Placement at Scale"}, {"paperId": "5a73b3f239d880f01bac14ff71a47e58c6a4cacf", "title": "LACS: Load-Aware Cache Sharing with Isolation Guarantee"}, {"paperId": "5d2113b4d6b7bd60c4a1f7791e681042b8fe8cdb", "title": "UMR-EC: A Unified and Multi-Rail Erasure Coding Library for High-Performance Distributed Storage Systems"}, {"paperId": "ee0d321f84e8dc9b3b17b4545415e6a92a2f6268", "title": "Exploring Fault-Tolerant Erasure Codes for Scalable All-Flash Array Clusters"}, {"paperId": "d89f4534d1a87005cdf470ec5d8154998d5abdc7", "title": "Parity Models: A General Framework for Coding-Based Resilience in ML Inference"}, {"paperId": "95a21920d02acd2be64f543a2bf06a96a5946265", "title": "Parity-Only Caching for Robust Straggler Tolerance"}, {"paperId": "89a9387b9d6e8d29c661a07e7ef344963d22f28b", "title": "Terra: Scalable Cross-Layer GDA Optimizations"}, {"paperId": "459186fcb20ca4b8e6089a635833c509bef6aa58", "title": "PaRS: A Popularity-Aware Redundancy Scheme for In-Memory Stores"}, {"paperId": "756f7ef9455718fbb5bd03388a13ae7beadb0d39", "title": "Persistent Octrees for Parallel Mesh Refinement through Non-Volatile Byte-Addressable Memory"}, {"paperId": "7409aa89de965a8bf184d83feb1b63664f4b4b15", "title": "DistCache: Provable Load Balancing for Large-Scale Storage Systems with Distributed Caching"}, {"paperId": "2254a4a2ce7797b165f1624d6454c2e80f463b03", "title": "EC-Bench: Benchmarking Onload and Offload Erasure Coders on Modern Hardware Architectures"}, {"paperId": "fd66fcd980f3b71deb08eea7e47d04948d375c19", "title": "DA Placement: A Dual-Aware Data Placement in a Deduplicated and Erasure-Coded Storage System"}, {"paperId": "382f0226f548971f4161b8d9811751e78a2965b5", "title": "SP-Cache: Load-Balanced, Redundancy-Free Cluster Caching with Selective Partition"}, {"paperId": "4f08130bc5c86e128548cdfc406029bcef619c71", "title": "Netco: Cache and I/O Management for Analytics over Disaggregated Stores"}, {"paperId": "f3ff4d2600a0add5d7d31412705ac209f12caf0c", "title": "SDPaxos: Building Efficient Semi-Decentralized Geo-replicated State Machines"}, {"paperId": "359120679267ebdf37f8a6f112ed2b6d1a51302d", "title": "Efficient Memory Caching for Erasure Coding Based Key-Value Storage Systems"}, {"paperId": "7b8b42bbf9fffe96ecbbaf707ace8f1357220e20", "title": "RobinHood: Tail Latency Aware Caching - Dynamic Reallocation from Cache-Rich to Cache-Poor"}, {"paperId": "a9e9214b8e9a6014b8529e57931f69e73d3af04a", "title": "Harnessing Correlations in Distributed Erasure-Coded Key-Value Stores"}, {"paperId": "f006a67c5b6b13a0862207e6db50d6d7d9d34363", "title": "Cluster Frameworks for Efficient Scheduling and Resource Allocation in Data Center Networks: A Survey"}, {"paperId": "767a84a9110bc5ef04af6a74ed61f98b08c54833", "title": "Faster Data-access in Large-scale Systems: Network-scale Latency Analysis under General Service-time Distributions"}, {"paperId": "526996ca1e36e3291d22053279a00dc8f5b71e68", "title": "EC-Store: Bridging the Gap between Storage and Latency in Distributed Erasure Coded Systems"}, {"paperId": "40fe1f4c35322e33ba5deaf80a875fca2cf66e7a", "title": "OpuS: Fair and Efficient Cache Sharing for In-Memory Data Analytics"}, {"paperId": "c96a71daba02980c06c79969e977906c086afdc0", "title": "Design of Global Data Deduplication for a Scale-Out Distributed Storage System"}, {"paperId": "49418122bba375fa02907d38b0be80689f750b39", "title": "Learning a Code: Machine Learning for Approximate Non-Linear Coded Computation"}, {"paperId": "486145438164f97d4b1414af8c0d5f23f560c9de", "title": "Distributed Lock Management with RDMA: Decentralization without Starvation"}, {"paperId": "d43138d3ef7e581929a9070a8733b33d33e9a683", "title": "Fundamental Limits of Erasure-Coded Key-Value Stores With Side Information"}, {"paperId": "9dd0e0a6a0409a7bff73b45e8b0377c79edb272a", "title": "ARES: Adaptive, Reconfigurable, Erasure Coded, Atomic Storage"}, {"paperId": "747f580cfb89acb9f3c68b8c9788577dab5fbda9", "title": "Asymmetric regenerating codes for heterogeneous distributed storage systems"}, {"paperId": "2b2dfec10b83d50c52d74a2544de457622b5d615", "title": "Clay Codes: Moulding MDS Codes to Yield an MSR Code"}, {"paperId": "f4a720d57c118e6048b1ca2abe2b8916bef18e79", "title": "NetCache: Balancing Key-Value Stores with Fast In-Network Caching"}, {"paperId": "66df0d6b0a807b99c444a2d2ce4778372207355b", "title": "Understanding system characteristics of online erasure coding on scalable, distributed and large-scale SSD array systems"}, {"paperId": "1d434ae65664b49d57418d546e0839aed43fe282", "title": "WPS: A Workload-Aware Placement Scheme for Erasure-Coded In-Memory Stores"}, {"paperId": "bacdc6c3ead0d41f0537941d30bb000f5b569c51", "title": "Revisiting Updating Schemes for Erasure-Coded In-Memory Stores"}, {"paperId": "d371e0bbf68c4995afa2c59362c95e285523557e", "title": "SSeCloud: Using secret sharing scheme to secure keys"}, {"paperId": "9971fe2e997f1cb8e6684dbea8bf462902269649", "title": "Agar: A Caching System for Erasure-Coded Data"}, {"paperId": "dd0eb753f36d9ee92a15e13276a31826eab683d3", "title": "Sprout: A Functional Caching Approach to Minimize Service Latency in Erasure-Coded Storage"}, {"paperId": "20a44558eed182a971f7add68ecc5931fbca2a65", "title": "Efficient and Available In-Memory KV-Store with Hybrid Erasure Coding and Replication"}, {"paperId": "8de431e0e62653711136836642af38179731c2f0", "title": "Information-Theoretically Secure Erasure Codes for Distributed Storage"}, {"paperId": "a7ca6fff9197b1415727f38202153ae41f685d26", "title": "Multi-Version Coding—An Information-Theoretic Perspective of Consistent Distributed Storage"}, {"paperId": "f4f9ff1fb8fc987e0bbcbf1ae60546a09a74788d", "title": "AlpaServe: Statistical Multiplexing with Model Parallelism for Deep Learning Serving"}, {"paperId": "3930781ce4748c7bc9b7fb497440009c6947d845", "title": "C2DN: How to Harness Erasure Codes at the Edge for Efficient Content Delivery"}, {"paperId": null, "title": "Cachew: Machine Learning Input Data Processing as a Service"}, {"paperId": "9258d574c669fb3f3da2354ec288e4bf17e21be5", "title": "Carbink: Fault-Tolerant Far Memory"}, {"paperId": "3f8c0f77d4c13d63706a922b2bdec0b584de08e3", "title": "When to Hedge in Interactive Services"}, {"paperId": "6a03e5ebfc2e2b172a42fc170428ec430b562f8c", "title": "Exploiting Combined Locality for Wide-Stripe Erasure Coding in Distributed Storage"}, {"paperId": "7a0210ef3e8984acf4fee8467007a969d22b2da9", "title": "MapperX: Adaptive Metadata Maintenance for Fast Crash Recovery of DM-Cache Based Hybrid Storage Devices"}, {"paperId": "339158b00fda468806cbd841239689d00cc42c96", "title": "Restructuring Serverless Computing with Data-Centric Function Orchestration"}, {"paperId": "1272035e20470623af4135fe985a297b1aab581b", "title": "The CacheLib Caching Engine: Design and Experiences at Scale"}, {"paperId": "0c5f2a78628db6fc59062c7944c478af0f1345e5", "title": "Near-Optimal Latency Versus Cost Tradeoffs in Geo-Distributed Storage"}, {"paperId": "33cd5965745dc2e8bb8d0400d0b3c18d4e6369d4", "title": "A large scale analysis of hundreds of in-memory cache clusters at Twitter"}, {"paperId": "61a3c8fc061f9d0d584c49eccdf4770a7c77c0d3", "title": "Causal and Interpretable Learning for Datacenter Latency Prediction"}, {"paperId": "d8802c7d1bbb2a7e9f16ee02a753af39729775b3", "title": "Understanding and Mitigating Latency Variability of Latency-Critical Applications"}, {"paperId": "5a3bb9a4be0fcff378f71123412234d4e8a22e37", "title": "USENIX Symposium on Operating Systems Design and Implementation"}, {"paperId": "a8ea980b63deaf1404cd9f539a575b4e7135466e", "title": "Queries Predictions Encoder Decoder Parity ModelModel Instance k Model Instance 1 Frontend Query 1 Query k Parity QueryPredictio"}, {"paperId": "b406953890ae014fcf894a2bdc9209f104afa7be", "title": "GFCache: A Greedy Failure Cache Considering Failure Recency and Failure Frequency for an Erasure-coded Storage System"}, {"paperId": "deced5961f7ff4bc9f908e83271715f09d7bea2a", "title": "Scaling Data Stores with Skewed Data Access: Solutions and Opportunities∗"}, {"paperId": "dbf9130926bb489c3ecc2181fb812cf9222936ee", "title": "ESetStore: an erasure-coding based distributed storage system with fast data recovery"}, {"paperId": "07a22bbfae9359de31eb48f6446f8b0b7a44940c", "title": "ToR Switch Clients L 2 / L 3 Routing Coherence Directory Controller Storage Server Storage Server Storage Server Statistics Engine"}, {"paperId": "ffe6522f8a4666642919ba0ea7d8c9990b1d41fb", "title": "the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}, {"paperId": "e5f034e67a9b344b3f1028f7e8707d3007415ffa", "title": "S IEVE is Simpler than LRU: an Efficient Turn-Key Eviction Algorithm for Web Caches"}, {"paperId": "b990228865d308e32743249ea9372adbc08726b3", "title": "This paper is included in the Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation."}, {"paperId": "5815f70e6d8ecc42c7d4bca071e940673b4d8ebb", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}, {"paperId": "6f5919bc6f0c70426192891871e6bffd7ad16c81", "title": "This paper is included in the Proceedings of the 21st USENIX Conference on File and Storage Technologies."}]}
