{"paperId": "42ce41ef52841ee1b41c8b214e2eb16687e2c39f", "publicationVenue": {"id": "246ff263-9fcf-4dda-9ac6-59a199be980b", "name": "Al-Rafidain Journal of Computer Sciences and Mathematics", "type": "journal", "alternate_names": ["Al-rafidain J Comput Sci Math"]}, "title": "Embedded Descriptor Generation in Faster R-CNN for Multi-Object Tracking", "abstract": "With the rapid growth of computer usage to extract the required knowledge from a huge amount of information, such as a video file, significant attention has been brought towards multi-object detection and tracking. Artificial Neural Networks (ANNs) have shown outstanding performance in multi-object detection, especially the Faster R-CNN network. In this study, a new method is proposed for multi-object tracking based on descriptors generated by a neural network that is embedded in the Faster R-CNN. This embedding allows the proposed method to directly output a descriptor for each object detected by the Faster R-CNN, based on the features detected by the Faster R-CNN to detect the object. The use of these features allows the proposed method to output accurate values rapidly, as these features are already computed for the detection and have been able to provide outstanding performance in the detection stage. The descriptors that are collected from the proposed method are then clustered into a number of clusters equal to the number of objects detected in the first frame of the video. Then, for further frames, the number of clusters is increased until the distance between the centroid of the newly created cluster and the nearest centroid is less than the average distance among the centroids. Newly added clusters are considered for new objects, whereas older ones are kept in case the object reappears in the video. The proposed method is evaluated using the UA-DETRAC (University at Albany Detection and Tracking) dataset and has been able to achieve 64.8% MOTA and 83.6% MOTP, with a processing speed of 127.3 frames per second.", "venue": "Al-Rafidain Journal of Computer Sciences and Mathematics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "AL-Rafidain Journal of Computer Sciences and Mathematics"}, "authors": [{"authorId": "2005973921", "name": "Y. Younis"}, {"authorId": "46261037", "name": "K. Alsaif"}], "citations": []}
