{"paperId": "42d90f2b497350e8ff0ab9b89ab0d5838c8287ce", "publicationVenue": {"id": "a951ae73-ab9a-4790-ab08-6f041bb6f098", "name": "OPUS Uluslararası Toplum Araştırmaları Dergisi", "alternate_names": ["OPUS Uluslar Toplum Araştırmaları Derg"], "issn": "2528-9535", "url": "https://www.opusjournal.net/"}, "title": "Akıllı Turizmde Büyük Veri Kullanımı: Sistematik Bir Derleme", "abstract": "Teknolojide meydana gelen gelismeler ve kisiler arasinda kullaniminin yayginlasmasi sonucunda cevrimici ortamin gunumuzde daha fazla kullanildigi gorulmektedir. Dijital ortamda, bu mecrayi kullanan kisiler hakkinda cesitli bilgiler yer almakta ve isletmeler icin bunlar gunumuzde onemli bir veri kaynagi olusturmaktadir. Cok buyuk miktarlara ulasan bu buyuk veriler analiz edilmekte ve sunulan hizmetlerin etkinliginin artirilmasinda kullanilabilmektedir. Turizm endustrisinde son yillarda onem kazanan akilli turizm uygulamalarinin da musteri istek ve beklentileri dogrultusunda gelistirildigi dikkat cekmektedir. Akilli turizm uygulamalarinda buyuk veri kullanimina iliskin calismalar bu dogrultuda onem kazanmaktadir. Bu baglamda, akilli turizm uygulamalarinda buyuk verinin kullanimina yonelik makalelerin iceriklerinin incelenmesi ve teorik olarak cikarimlar elde edilmesi bu calismanin amacini olusturmaktadir. Sistematik derleme yontemi kullanilarak, belirlenen kriterlere gore uluslararasi veritabanlarinda makaleler taranmis ve analiz edilmistir. Gerceklestirilen analiz sonuclarina gore, akilli turizmde buyuk veri kullanimi konulu az sayida makale calismasinin bulundugu tespit edilmistir. Bununla birlikte, destinasyon yonetimi, musteri iliskileri yonetimi, talep tahminleme ve deger olusturma, akilli turizmde buyuk veri kullaniminin en onemli fonksiyonlari olarak vurgulanabilir.", "venue": "OPUS Uluslararası Toplum Araştırmaları Dergisi", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-12-31", "journal": {"name": "OPUS Uluslararası Toplum Araştırmaları Dergisi"}, "authors": [{"authorId": "82303202", "name": "Fatih Ercan"}], "citations": [{"paperId": "bfec6cc7b5a16773d3eea98afba1801dc71e6e8d", "title": "THE USE OF DIGITAL COMMUNICATION CHANNELS IN HEALTH TOURISM IN TURKEY"}, {"paperId": "cb39c4379850226115dc73fe0207112113cc3465", "title": "COVID-19 DÖNEMİNDE TURİZM YAZININDA REKREASYON ÇALIŞMALARININ SİSTEMATİK DERLEME YÖNTEMİ İLE İNCELENMESİ"}, {"paperId": "bd5a623cde9a2b26a28133898428167de6c1bacc", "title": "COVID-19 and Its Employment Dimension in the Tourism Sector"}]}
