{"paperId": "42e0b219a54208ee1236eb14c1390bcf0300cbd7", "publicationVenue": {"id": "c7f93972-20e4-45c1-9dac-2ffafa2dba1d", "name": "Research in Adaptive and Convergent Systems", "type": "conference", "alternate_names": ["Research in Applied Computation Symposium", "Res Adapt Converg Syst", "RACS", "Res Appl Comput Symp"]}, "title": "Thermal-aware MapReduce Real-Time Scheduling in Heterogeneous Server Systems", "abstract": "With the increased requirements of cloud computing, the cooling cost is getting serious in data centers. However, thermal management has proven to be challenging due to the tradeoff that occurs between performance requirements and overheating. To provide quality of service for interactive web services, this study explores thermal-aware MapReduce real-time scheduling in heterogeneous server systems. A data-locality-aware power controller with thermal consideration is proposed to dynamically switch the power state and to switch the executing frequency of each server. The thermal efficiency of the proposed method was evaluated using a series of workloads, and impressive results were obtained.", "venue": "Research in Adaptive and Convergent Systems", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2016-10-11", "journal": {"name": "Proceedings of the International Conference on Research in Adaptive and Convergent Systems"}, "authors": [{"authorId": "22339024", "name": "T. Tang"}, {"authorId": "1737684", "name": "Ya-Shu Chen"}], "citations": [{"paperId": "d915a191db0c76e8a187c995dd57bd8bb1779d27", "title": "RT-SEAT: A hybrid approach based real-time scheduler for energy and temperature efficient heterogeneous multicore platforms"}, {"paperId": "12afdadb0b69d547bd91162559879c73ddb171f6", "title": "HEAT"}, {"paperId": "73581decd791c9cc7bf0cdd4670631f03fe03f2f", "title": "ETA-HP: an energy and temperature-aware real-time scheduler for heterogeneous platforms"}, {"paperId": "7f64ab3b562f5db03266e927bb38b728e26a3256", "title": "TA-HRT: A temperature-aware scheduler for heterogeneous real-time multicore systems"}, {"paperId": "67c401785f013ebaf740180f73307bfb702a2e07", "title": "TEARS: A temperature-aware real-time scheduler for heterogeneous multi-core systems"}, {"paperId": "26ea179ebd509c6b5882b648a1768de7f60c7b73", "title": "Trading-Off Computing and Cooling Energies by VM Migration in Data Centers"}, {"paperId": "621ac967c93f321440103019aeb42c1531dae7e3", "title": "Thermal-Aware File and Resource Allocation in Data Centers"}]}
