{"paperId": "42f7ddc280a0b15ae1f53f06784eb6acc3eada3c", "publicationVenue": null, "title": "Revolutionizing Weed Detection in Agriculture through the Integration of IoT, Big Data, and Deep Learning with Robotic Technology", "abstract": "The objective of this study is to develop a weed detection and classification technique that can be utilized by robotic weed control systems. The approach leverages deep learning-based image processing algorithms to classify plants as either crops or weeds based on their features. A categorization strategy is applied to identify weeds, which can grow both inside and outside of crop rows. Data collected from crop image wavelet analysis is initially used to differentiate between crops and weeds, and the farmer receives a phone alert. Afterwards, the farmer provides the robot with instructions to spray the necessary areas. The entire model is executed by a cutting-edge real-time object detection system, YOLOv4 (You Only Look Once). During testing, this model has shown superiority over classifier-based systems in several aspects, such as achieving higher accuracy rates and being able to evaluate the full context of the image for all predictions. For instance, the deep learning-based image processing algorithms used in this technique can differentiate between crops and weeds with higher accuracy compared to traditional classifier-based systems. Additionally, the YOLOv4 object detection system used in this study is capable of analyzing the entire image to make predictions, taking into account the context of each object. This represents a significant improvement over traditional classifier-based systems that often rely on local features to make predictions, which can lead to misclassifications", "venue": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-07-19", "journal": {"name": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "pages": "1-6"}, "authors": [{"authorId": "2243999048", "name": "Nafil Khalid"}, {"authorId": "2244002648", "name": "Hajar Elkhiri"}, {"authorId": "2244002653", "name": "Elyazyd Oumaima"}, {"authorId": "2243998467", "name": "Nouhaila ElFahsi"}, {"authorId": "2244002678", "name": "Zaglami Fatima Zahra"}, {"authorId": "2097268657", "name": "Kobbane Abdellatif"}], "citations": []}
