{"paperId": "430d413134c1e3c26574e43a5dfdfdc4fd01256f", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Multi-Class Classification of Medical Data Based on Neural Network Pruning and Information-Entropy Measures", "abstract": "Medical data includes clinical trials and clinical data such as patient-generated health data, laboratory results, medical imaging, and different signals coming from continuous health monitoring. Some commonly used data analysis techniques are text mining, big data analytics, and data mining. These techniques can be used for classification, clustering, and machine learning tasks. Machine learning could be described as an automatic learning process derived from concepts and knowledge without deliberate system coding. However, finding a suitable machine learning architecture for a specific task is still an open problem. In this work, we propose a machine learning model for the multi-class classification of medical data. This model is comprised of two components—a restricted Boltzmann machine and a classifier system. It uses a discriminant pruning method to select the most salient neurons in the hidden layer of the neural network, which implicitly leads to a selection of features for the input patterns that feed the classifier system. This study aims to investigate whether information-entropy measures may provide evidence for guiding discriminative pruning in a neural network for medical data processing, particularly cancer research, by using three cancer databases: Breast Cancer, Cervical Cancer, and Primary Tumour. Our proposal aimed to investigate the post-training neuronal pruning methodology using dissimilarity measures inspired by the information-entropy theory; the results obtained after pruning the neural network were favourable. Specifically, for the Breast Cancer dataset, the reported results indicate a 10.68% error rate, while our error rates range from 10% to 15%; for the Cervical Cancer dataset, the reported best error rate is 31%, while our proposal error rates are in the range of 4% to 6%; lastly, for the Primary Tumour dataset, the reported error rate is 20.35%, and our best error rate is 31%.", "venue": "Entropy", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-27", "journal": {"name": "Entropy", "volume": "24"}, "authors": [{"authorId": "1403656528", "name": "Máximo Sánchez-Gutiérrez"}, {"authorId": "38613936", "name": "Pedro Pablo González Pérez"}], "citations": [{"paperId": "f9303598ccfaf184266d0b9efea81366ceb98afb", "title": "Nonlinear-Control-Oriented Modeling of the Multi-Variable Underground Coal Gasification Process for UCG Project Thar: A Machine Learning Perspective"}, {"paperId": "d93f825728cd7fd0d3e4fc61bff6cfd0e68793f4", "title": "A Systematic Review of Literature on Sustaining Decision-Making in Healthcare Organizations Amid Imperfect Information in the Big Data Era"}, {"paperId": "892af2476f8cdc6409400bf7a02be6fc8d23b3c7", "title": "Classification of customer churn prediction model for telecommunication industry using analysis of variance"}, {"paperId": "1cda564d14eb94594e6d4e60973b0ccffa636829", "title": "Medical Data Classification using a Gravitational Search Algorithm and Artificial Intelligence"}]}
