{"paperId": "4314a27dec577595bbcee0d4d9ccfd158976761b", "publicationVenue": {"id": "a812fb6c-86bf-469b-83ab-2225a7383534", "name": "Meditari Accountancy Research", "type": "journal", "alternate_names": ["Meditari : Research Journal of the School of Accounting Sciences", "Meditari Account Res", "Meditari  Res J Sch Account Sci"], "issn": "1022-2529", "alternate_issns": ["2049-372X"], "url": "https://www.emerald.com/insight/publication/issn/1022-2529", "alternate_urls": ["https://www.emeraldinsight.com/journal/medar"]}, "title": "Breaching intellectual capital: critical reflections on Big Data security", "abstract": "\nPurpose\nReflecting on Big Data’s assumed benefits, this study aims to identify the risks and challenges of data security underpinning Big Data’s socio-economic value and intellectual capital (IC).\n\n\nDesign/methodology/approach\nThe study reviews academic literature, professional documents and public information to provide insights, critique and projections for IC and Big Data research and practice.\n\n\nFindings\nThe “voracity” for data represents a further “V” of Big Data, which results in a continuous hunt for data beyond legal and ethical boundaries. Cybercrimes, data security breaches and privacy violations reflect voracity and represent the dark side of the Big Data ecosystem. Losing the confidentiality, integrity or availability of data because of a data security breach poses threat to IC and value creation. Thus, cyberthreats compromise the social value of Big Data, impacting on stakeholders’ and society’s interests.\n\n\nResearch limitations/implications\nBecause of the interpretative nature of this study, other researchers may not draw the same conclusions from the evidence provided. It leaves some open questions for a wide research agenda about the societal, ethical and managerial implications of Big Data.\n\n\nOriginality/value\nThis paper introduces the risks of data security and the challenges of Big Data to stimulate new research paths for IC and accounting research.\n", "venue": "Meditari Accountancy Research", "year": 2018, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2018-07-30", "journal": {"name": "Meditari Accountancy Research"}, "authors": [{"authorId": "122988786", "name": "Matteo La Torre"}, {"authorId": "33272905", "name": "John Dumay"}, {"authorId": "51044941", "name": "M. A. Rea"}], "citations": [{"paperId": "c0b914d3f8e2c19c9d20bb1169484c2da20a9dea", "title": "A Systematic Review Investigating Cyberthreats and the Preservation of Intellectual Capital in Big Data"}, {"paperId": "0c033678dad4a968f2b3bcc3d80508db940b432a", "title": "WHAT DO SHARIAH BOARDS THINK ABOUT AI?"}, {"paperId": "ccc03bcb5560984ffba1f548ed7d733b8a3d3433", "title": "Analysing the implications of cybersecurity breaches on firm leadership"}, {"paperId": "9bb5c5fd4482f31a5886e682df7f6c3235183df7", "title": "A conceptual framework of barriers to data science implementation: a practitioners' guideline"}, {"paperId": "68f78c8976fe2bda9be1690fd785f962e4e59911", "title": "Financial innovation in Islamic banks: evidence on the interaction between Shariah board and FinTech"}, {"paperId": "24bb3c1d0077838a886b171e34ca68093d002f35", "title": "Determinants of Cyberattack Prevention in UAE Financial Organizations: Assessing the Mediating Role of Cybersecurity Leadership"}, {"paperId": "3753c56145eaf8e47e617950054f02ae0cccb3c3", "title": "Corporate accountability and big data analytics: is non-financial disclosure a missing link?"}, {"paperId": "d4422934dd63eaa640c32176fa321e470a6a715b", "title": "Decisions and Coordination of Green Supply Chain Considering Big Data Targeted Advertising"}, {"paperId": "75189455564c4ed2e0b62c5c723b22272889cd68", "title": "Societal Impacts of Cyber Security in Academic Literature – Systematic Literature Review"}, {"paperId": "8b8373538bdc082f65d87d182d71eb06bf22dcb0", "title": "Antecedents of privacy concerns and online information disclosure: moderating role of government regulation"}, {"paperId": "25892f3c0095e54db1b9c09d1d6f6b2c75341b87", "title": "Drivers of privacy concerns when interacting with a chatbot in a customer service encounter"}, {"paperId": "d44918c0dcde86542dec8cf0c64cef3958958b6c", "title": "Multilayered MapReduce Framework to Link Cybernetic Vulnerabilities and Cybernetic Laws from E-News Articles"}, {"paperId": "b959011790332cd8ab9edac34846f32736fab74a", "title": "The digitalization-reputation link: a multiple case-study on Italian banking groups"}, {"paperId": "c2fdb06e3cb5f041fbab869d716c72eb3c877d69", "title": "RETRACTED ARTICLE: The complementarities of big data and intellectual capital on sustainable value creation; collective intelligence approach"}, {"paperId": "e01a47508c9ef2f9bd92c23c086e24d7ea26d97b", "title": "Impact of AI regulation and governance on online personal data sharing: from sociolegal, technology and policy perspective"}, {"paperId": "6cc7ab430f40a71f6d1f6062de5ac08d88178eb6", "title": "The Effect of Intellectual Capital and Board Characteristics on Value Creation and Growth"}, {"paperId": "c729a2b2b89252c281fc615bba28ae6ba557a9d4", "title": "CORPORATE CYBERESPIONAGE: IDENTIFICATION AND PREVENTION PART 2"}, {"paperId": "897b83028ee61f58db390d8bf5c95dfb4b8704e4", "title": "CORPORATE CYBERESPIONAGE: IDENTIFICATION AND PREVENTION PART 1"}, {"paperId": "6e6fac594af82932f25b27652cdbfe8e3a28613a", "title": "Value that matters: intellectual capital and big data to assess performance in healthcare. An empirical analysis on the European context"}, {"paperId": "c14fa70bd1a6af014b2d780c5059d111d51c2df3", "title": "Integrating Big Data and Intellectual Capital: Resource Complementarity in Business Value Creation"}, {"paperId": "890d5cafc629ef375499b2748ac59152e7fb59a6", "title": "Securing intellectual capital: an exploratory study in Australian universities"}, {"paperId": "ca88670849f2e3b1e705a9a20c7bb9afba12cab5", "title": "PRECEPT: a framework for ethical digital forensics investigations"}, {"paperId": "a87636e2066d8d7377028b79fa12062ba1fd2c1b", "title": "SE-Enc: A Secure and Efficient Encoding Scheme Using Elliptic Curve Cryptography"}, {"paperId": "d43dcc9f22a5d81c31735fea8d9b529b119b1b7c", "title": "Protecting intellectual property from insider threats"}, {"paperId": "588cf9946d6f8401c9a40ca309a45a3a0b63e166", "title": "Strategy and organisational cybersecurity: a knowledge-problem perspective"}, {"paperId": "e8719c6549a619b55f6ca3cbf3800810eeca270a", "title": "Protecting a new Achilles heel: the role of auditors within the practice of data protection"}, {"paperId": "12892bf600cde7ef2f31fc5790ee6f49d51f066d", "title": "Integrated Cloud Financial Accounting Cycle: How Artificial Intelligence, Blockchain, and XBRL will Change the Accounting, Fiscal and Auditing Practices"}, {"paperId": "ba83c17db6652537236e9c832946a62059e91836", "title": "Guest editorial"}, {"paperId": "7918457bec55a2ae6569230cb34fba737d24d7e9", "title": "The fall and rise of intellectual capital accounting: new prospects from the Big Data revolution"}, {"paperId": "173d45c4a04fb7a7e48bfe92239de85f4e74a99c", "title": "Data Science in Economics and Business"}, {"paperId": "0344f6d1d4f96667fecbef193de6fdb22ee6a897", "title": "The Emerging of Enhanced Intellectual Capital: The Impact of Enabling Technologies on the Professional Football Clubs"}, {"paperId": "4dae8c45b9de862330375553f8faefeafd0d99a9", "title": "Human Capital Vulnerability and Cybersecurity Risk Management: An Integrated Approach"}, {"paperId": "0892d836790dfd514d414d0a1a279f43b8dd0d7b", "title": "Big Accounting Data and Sustainable Business Growth: Evidence from Listed Firms in Thailand"}, {"paperId": "aedbcadede818151f0c6a797dfbb1c4918834ba2", "title": "Intellectual Capital Disclosure in the Digital Era: Challenges and Opportunities for MNEs"}]}
