{"paperId": "431f5506b76f23242648f5234c437b008afe813a", "publicationVenue": null, "title": "Near-Realtime Server Reboot Monitoring and Root Cause Analysis in a Large-Scale System", "abstract": "Large-scale Internet services run on a fleet of distributed servers, and the continuous availability of the hardware is key to the robustness of the services. Unplanned reboots disrupt the services running on the hardware and lower the fleet availability. Server reboots are also important signals that could indicate underlying issues such as memory leaks from the services, catastrophic hardware failures, and network or power disruptions at the datacenters.In this paper, we present an at-scale, near-realtime reboot monitoring framework built with multiple state-of-the-art data infrastructures, as well as machine learning-based anomaly detection and automated root cause analysis across hundreds of server attribute combinations. We observed that 1% of the reboots in our hardware fleet were associated with kernel panics and out-of-memory events, and these reboots exhibit strong locality temporally and across services", "venue": "2021 51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks - Supplemental Volume (DSN-S)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-01", "journal": {"name": "2021 51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks - Supplemental Volume (DSN-S)", "pages": "37-40"}, "authors": [{"authorId": "1666645566", "name": "F. Lin"}, {"authorId": "2115138426", "name": "Bhargav Bolla"}, {"authorId": "102776308", "name": "Eric Pinkham"}, {"authorId": "2115142158", "name": "Neil Kodner"}, {"authorId": "2115111972", "name": "Daniel Moore"}, {"authorId": "2053097977", "name": "Amol Desai"}, {"authorId": "3060271", "name": "S. Sankar"}], "citations": [{"paperId": "7f3dbd7b0d01ff6a54211702c5a039167350ac40", "title": "Real-Time Server Monitoring and Notification System with Prometheus, Grafana, and Telegram Integration"}, {"paperId": "be2dc8767bbd01fbef5cb41b6df0871a36fbd8df", "title": "A Deep Learning Approach for Root Cause Analysis in Real-Time IIoT Edge Networks"}, {"paperId": "34ad27ced445cdb178388159a7a75d252dad66cc", "title": "A Metaverse: Taxonomy, Components, Applications, and Open Challenges"}]}
