{"paperId": "432d53bc701a455a079a776896b61c77e2b87c10", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Blockchain-Assisted Reputation Management Scheme for Internet of Vehicles", "abstract": "With the rapid development of Internet of Vehicles (IoV), particularly the introduction of Mobile Edge Computing (MEC), vehicles can efficiently share data with one another. However, edge computing nodes are vulnerable to various network attacks, posing security risks to data storage and sharing. Moreover, the presence of abnormal vehicles during the sharing process poses significant security threats to the entire network. To address these issues, this paper proposes a novel reputation management scheme, which proposes an improved multi-source multi-weight subjective logic algorithm. This algorithm fuses the direct and indirect opinion feedback of nodes through the subjective logic trust model while considering factors such as event validity, familiarity, timeliness, and trajectory similarity. Vehicle reputation values are periodically updated, and abnormal vehicles are identified through reputation thresholds. Finally, blockchain technology is employed to ensure the security of data storage and sharing. By analyzing real vehicle trajectory datasets, the algorithm is proven to effectively improve the differentiation and detection rate of abnormal vehicles.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "47968272", "name": "Li-Yu Daisy Liu"}, {"authorId": "2216941255", "name": "Junquan Gong"}, {"authorId": "1806109", "name": "Qilie Liu"}], "citations": [{"paperId": "deace9a60578c79c926ebc1aea7ee159beb11f9b", "title": "Blockchain‐assisted twin migration for vehicular metaverses: A game theory approach"}]}
