{"paperId": "4330152358dc55bab8728a71d789d730306a73f7", "publicationVenue": {"id": "56b2a0d8-f52f-453d-9c6b-3618dd6cc61b", "name": "International Conference on Advanced Mechatronic Systems", "type": "conference", "alternate_names": ["ICAMechS", "Int Conf Adv Mechatron Syst"]}, "title": "Nonlinear Autoregressive Exogenous Neural Network for Earthquake Prediction in Indonesia", "abstract": "In this work, a nonlinear autoregressive exogenous neural network (NARXNN) is combined with the extended Kalman filter (EKF) algorithm for predicting the earthquake magnitudes in Indonesia. It is seen that the proposed neural model has a feedback loop from the output to the input layer, and such a recurrent model structure is selected based on the dynamic characteristics of the real earthquake magnitude data of Indonesia. The trained neural model with the real earthquake data shows a superior capability of producing smaller Mean Squared Error (MSE) and high accurate prediction error compared to a regular NARXNN and Feed-Forward Neural Network (FFNN) models. The experiments with the earthquake dataset of the last few years from the Meteorology, Climatology, and Geophysics Agency of Indonesia, are carried out for training the proposed recurrent neural model and then predict the next 15 earthquake magnitudes in Indonesia. The experiment results demonstrate that the proposed neural model has an excellent performance and will play an important role on earthquake magnitude prediction in Indonesia in the near future.", "venue": "International Conference on Advanced Mechatronic Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 International Conference on Advanced Mechatronic Systems (ICAMechS)", "pages": "137-142"}, "authors": [{"authorId": "143855596", "name": "Nur Hasanah"}, {"authorId": "145445446", "name": "Z. Man"}, {"authorId": "8538791", "name": "Z. Cao"}, {"authorId": "37449849", "name": "Jinchuan Zheng"}], "citations": [{"paperId": "de3a0fc3c4d2c6202a29f0fc376533a18651abb3", "title": "Neural Network with Cubature Kalman Filter for Earthquake Prediction in Java"}]}
