{"paperId": "433b035fbbe933fba97a1814a7f0ea7b37932310", "publicationVenue": {"id": "98f1d180-6ccd-49ce-8f52-3bbfac3694b6", "name": "Contributions to Plasma Physics", "type": "journal", "alternate_names": ["Contrib Plasma Phys", "Contributions To Plasma Physics"], "issn": "0863-1042", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/60500228?CRETRY=1&SRETRY=0", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15213986"]}, "title": "Two‐step clustering for data reduction combining DBSCAN and k‐means clustering", "abstract": "A novel combination of two widely‐used clustering algorithms is proposed here for the detection and reduction of high data density regions. The density‐based spatial clustering of applications with noise (DBSCAN) algorithm is used for the detection of high data density regions and the k‐means algorithm for reduction. The proposed algorithm iterates while successively decrementing the DBSCAN search radius, allowing for an adaptive reduction factor based on the effective data density. The algorithm is demonstrated for a physics simulation application, where a surrogate model for fusion reactor plasma turbulence is generated with neural networks. A training dataset for the surrogate model is created with a quasilinear gyrokinetics code for turbulent transport calculations in fusion plasmas. The training set consists of model inputs derived from a repository of experimental measurements, meaning there is a potential risk of over‐representing specific regions of this input parameter space. By applying the proposed reduction algorithm to this dataset, this study demonstrates that the training dataset can be reduced by a factor ˜20 using the proposed algorithm, without a noticeable loss in the surrogate model accuracy. This reduction also provides a way of analyzing existing high‐dimensional datasets for biases and consequently reducing them, which lowers the cost of re‐populating that parameter space with higher quality data.", "venue": "Contributions to Plasma Physics", "year": 2021, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-22", "journal": {"name": "Contributions to Plasma Physics", "volume": "63"}, "authors": [{"authorId": "153537626", "name": "B. J. J. Kremers"}, {"authorId": "2166681824", "name": "Aaron Ho"}, {"authorId": "50001252", "name": "J. Citrin"}, {"authorId": "1404059794", "name": "K. V. D. Plassche"}], "citations": [{"paperId": "3da7d9a355daeb7a3deb311bacb95f8864ca1401", "title": "Research on fabric surface defect detection algorithm based on improved Yolo_v4"}, {"paperId": "f75fca7296a34305ac1ac9d54716841ffbfe9b0b", "title": "Efficient training sets for surrogate models of tokamak turbulence with Active Deep Ensembles"}, {"paperId": "3f48ff7f228a6f343f3044e88659671b125e0894", "title": "Urban Resident Travel Survey Method Based on Cellular Signaling Data"}, {"paperId": "c2a9b532e72deb9e40acf915b49843f7806bd211", "title": "Special issue: Machine learning methods in plasma physics"}]}
