{"paperId": "4340377e2088b435c8c40e16e3a5bf082650d498", "publicationVenue": {"id": "17d084e4-701d-448f-93ac-c6fdfebea754", "name": "International Conference on Advanced Aspects of Software Engineering", "type": "conference", "alternate_names": ["International Conference Advanced Aspects Software Engineering", "Int Conf Adv Asp Softw Eng", "ICAASE"]}, "title": "Towards a Big Educational Data Analytics", "abstract": "The Big data is a broad term that is related to the collection, storage, and analysis of large volumes of data. These big data can play a significant part to understand the often issues nature and help improve performances of several sectors, including higher education. However, it is not possible for higher education big data owners to go through all data and make critical decisions for the improvement of the sector. Here comes the importance of big data analytics. Due to the lack of big educational datasets, we eventually explore the three phases of big data analytics (descriptive, predictive, and prescriptive analytics) and their benefits through a case study where machine learning techniques were applied to predict student performance. We used an educational dataset collected from the Kalboard 360 learning management system. We end up giving recommendations and advice to improve student performance and convince educational institutions to use and benefit from their data.", "venue": "International Conference on Advanced Aspects of Software Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-17", "journal": {"name": "2022 International Conference on Advanced Aspects of Software Engineering (ICAASE)", "pages": "1-6"}, "authors": [{"authorId": "2189464252", "name": "Mohamed Lamine Boughouas"}, {"authorId": "2397096", "name": "Y. Kissoum"}, {"authorId": "2189464227", "name": "Abdelouahad Mouhssen"}, {"authorId": "103292100", "name": "M. Karek"}, {"authorId": "1975480", "name": "S. Mazouzi"}], "citations": []}
