{"paperId": "4345e3e83305164b56a46e4c65fb105f5d0e74d6", "publicationVenue": {"id": "75e57f78-3c41-4803-8f91-bf6a220e9a66", "name": "Ore Geology Reviews", "type": "journal", "alternate_names": ["Ore Geol Rev"], "issn": "0169-1368", "url": "https://www.journals.elsevier.com/ore-geology-reviews", "alternate_urls": ["http://www.sciencedirect.com/science/journal/01691368"]}, "title": "Effective delineation of rare metal-bearing granites from remote sensing data using machine learning methods: A case study from the Umm Naggat Area, Central Eastern Desert, Egypt", "abstract": null, "venue": "Ore Geology Reviews", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-01", "journal": {"name": "Ore Geology Reviews"}, "authors": [{"authorId": "2071400530", "name": "M. A. Abdelkader"}, {"authorId": "2109740298", "name": "Yasushi Watanabe"}, {"authorId": "1573619032", "name": "A. Shebl"}, {"authorId": "2049802309", "name": "H. A. El-Dokouny"}, {"authorId": "108215096", "name": "M. Dawoud"}, {"authorId": "93933173", "name": "Á. Csámer"}], "citations": [{"paperId": "e86cbd4fcb8aeb5a61a5d36c1ab5b215ac52d710", "title": "Structural and alteration zones controls on Cu mineralisation in the northwest of Nain (northeastern Isfahan, Iran): A remote sensing perspective"}, {"paperId": "e954983974bcd31aaf89a4cb2133a9646d69bae1", "title": "Using edge detection techniques and machine learning classifications for accurate lithological discrimination and structure lineaments extraction: a comparative case study from Gattar area, Northern Eastern Desert of Egypt"}, {"paperId": "867f605a719c9b2274054a56b15e4349c1953fe7", "title": "PRISMA hyperspectral data for lithological mapping in the Egyptian Eastern Desert: Evaluating the Support Vector Machine, Random Forest, and XG Boost Machine Learning Algorithms"}, {"paperId": "51605428980ad7dcb77b6f44b9b42e62cb660a75", "title": "Remote Sensing for Lithology Mapping in Vegetation-Covered Regions: Methods, Challenges, and Opportunities"}, {"paperId": "343491de9641126f2fd923c3fcf5d4381d2f8e7a", "title": "Chromite-Bearing Peridotite Identification, Based on Spectral Analysis and Machine Learning: A Case Study of the Luobusa Area, Tibet, China"}, {"paperId": "6e1c301ecb67ca1d48b8f1270ed751ad1ddba101", "title": "Geochemistry and petrogenesis of late Neoproterozoic Nuweibi and Atawi rare metals bearing granites, central Eastern Desert, Egypt"}, {"paperId": "dce4da099b926c98cfc8e84f71a946d663b6627e", "title": "Automatic lineaments detection using radar and optical data with an emphasis on geologic and tectonic implications: a case study of Kabul Block, eastern Afghanistan"}, {"paperId": "b3e80c15a032edd15b0ea84803e3f04f23d3a4e4", "title": "Impact of DEMs for Improvement Sentinel 2 Lithological Mapping Utilizing Support Vector Machine: A Case Study of Mineralized Fe-Ti-Rich Gabbroic Rocks from the South Eastern Desert of Egypt"}, {"paperId": "37d009644b7433f03081c13623163a1a5956d5e5", "title": "Multiscale (microscopic to remote sensing) preliminary exploration of auriferous-uraniferous marbles: A case study from the Egyptian Nubian Shield"}, {"paperId": "8e9b24bd5b338de46ca7ca4cb17d9a485a32811f", "title": "Detecting Oxides Mineralization Utilizing Remote Sensing and Comprehensive Mineralogical Analysis: A Case Study Around Mikbi-Zayatit District, South Eastern Desert, Egypt"}, {"paperId": "b2fc7f6c333d9ed8f17e4b9940666cdc49d18944", "title": "Towards better delineation of hydrothermal alterations via multi-sensor remote sensing and airborne geophysical data"}, {"paperId": "05f5192062323c76709c20cf4d027549219a07b8", "title": "Lithology classification in semi-arid area combining multi-source remote sensing images using support vector machine optimized by improved particle swarm algorithm"}, {"paperId": "73dcd397d872883035c80bd1fcf86cf947614678", "title": "Application of GIS and remote sensing in mineral exploration: current and future perspectives"}, {"paperId": "d7f8f68e5a20f911122c709dd9814dcd7c3d6421", "title": "Lithium-Bearing Pegmatite Identification, Based on Spectral Analysis and Machine Learning: A Case Study of the Dahongliutan Area, NW China"}]}
