{"paperId": "43461fa36de78280af7a5ab2055a0c676251a9d6", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Machine Learning Classifier Evaluation for Different Input Combinations: A Case Study with Landsat 9 and Sentinel-2 Data", "abstract": "High-resolution multispectral remote sensing images offer valuable information about various land features, providing essential details and spatially accurate representations. In the complex urban environment, classification accuracy is not often adequate using the complete original multispectral bands for practical applications. To improve the classification accuracy of multispectral images, band reduction techniques are used, which can be categorized into feature extraction and feature selection techniques. The present study examined the use of multispectral satellite bands, spectral indices (including Normalized Difference Built-up Index, Normalized Difference Vegetation Index, and Normalized Difference Water Index) for feature extraction, and the principal component analysis technique for feature selection. These methods were analyzed both independently and in combination for the classification of multiple land use and land cover features. The classification was performed for Landsat 9 and Sentinel-2 satellite images in Delhi, India, using six machine learning techniques: Classification and Regression Tree, Minimum Distance, Naive Bayes, Random Forest, Gradient Tree Boosting, and Support Vector Machine on Google Earth Engine platform. The performance of the classifiers was evaluated quantitatively and qualitatively to analyze the classification results with whole image (comprehensive feature) and small subset (targeted feature). The RF and GTB classifiers were found to outperform all others in the quantitative analysis of all input combinations for both Landsat 9 and Sentinel-2 datasets. RF achieved a classification total accuracy of 96.19% for Landsat and 96.95% for Sentinel-2, whereas GTB achieved 91.62% for Landsat and 92.89% for Sentinel-2 in all band combinations. Furthermore, the RF classifier achieved the highest F1 score of 0.97 in both the Landsat and Sentinel datasets. The qualitative analysis revealed that the PCA bands were particularly useful to classifiers in distinguishing even the slightest differences among the feature class. The findings contribute to the understanding of feature extraction and selection techniques for land use and land cover classification, offering insights into their effectiveness in different scenarios.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-23", "journal": {"name": "Remote. Sens.", "pages": "3241", "volume": "15"}, "authors": [{"authorId": "2222467928", "name": "P. A. Palanisamy"}, {"authorId": "2055618034", "name": "K. Jain"}, {"authorId": "1758126", "name": "S. Bonafoni"}], "citations": [{"paperId": "1fbbc2951104e1200c708d2febfb3bbdc460aec7", "title": "Multi-Temporal Passive and Active Remote Sensing for Agricultural Mapping and Acreage Estimation in Context of Small Farm Holds in Ethiopia"}, {"paperId": "9be9339c76a5f7b6ee795c8edb55d54c1cfdf537", "title": "Evaluating Land Use and Ecological Patterns in Xiong'an New Area of China with Machine Learning Methodology"}, {"paperId": "b1aff6d311f42cfca6f854702fe1343880afed86", "title": "A Parallel-Cascaded Ensemble of Machine Learning Models for Crop Type Classification in Google Earth Engine Using Multi-Temporal Sentinel-1/2 and Landsat-8/9 Remote Sensing Data"}, {"paperId": "541087b473e6adff3bd93ad700e1a285f0069bf7", "title": "MONITORING SUMMER DAYTIME AND NIGHTTIME DECADAL TRENDS OF LAND SURFACE TEMPERATURE OVER THE NATIONAL CAPITAL REGION DELHI"}, {"paperId": "6395f3b51e5e4d6efc6ad4ec833c5ce8bafb9187", "title": "Land Cover Classification in the Antioquia Region of the Tropical Andes Using NICFI Satellite Data Program Imagery and Semantic Segmentation Techniques"}, {"paperId": "c001aed06536d39c2dd0c22fda0304422917ccd1", "title": "Comparison of Accuracy and Reliability of Random Forest, Support Vector Machine, Artificial Neural Network and Maximum Likelihood method in Land use/cover Classification of Urban Setting"}, {"paperId": "16d6ba72b9b4569aed4bf85c4c82b9194893f6bf", "title": "Modelling change detection for unveiling urban transitions: using machine learning algorithms and Sentinel-2 data in Larache City, Morocco"}]}
