{"paperId": "4366db4eff5ed294065309d9ec178940c86a2a70", "publicationVenue": null, "title": "Automating Incremental and Asynchronous Evaluation for Recursive Aggregate Data Processing", "abstract": "In database and large-scale data analytics, recursive aggregate processing plays an important role, which is generally implemented under a framework of incremental computing and executed synchronously and/or asynchronously. We identify three barriers in existing recursive aggregate data processing. First, the processing scope is largely limited to monotonic programs. Second, checking on conditions for monotonicity and correctness for async processing is sophisticated and manually done. Third, execution engines may be suboptimal due to separation of sync and async execution. In this paper, we lay an analytical foundation for conditions to check if a recursive aggregate program that is monotonic or even non-monotonic can be executed incrementally and asynchronously with its correct result. We design and implement a condition verification tool that can automatically check if a given program satisfies the conditions. We further propose a unified sync-async engine to execute these programs for high performance. To integrate all these effective methods together, we have developed a distributed Datalog system, called PowerLog. Our evaluation shows that PowerLog can outperform three representative Datalog systems on both monotonic and non-monotonic recursive programs.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-05-29", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "30785202", "name": "Qiange Wang"}, {"authorId": "40600353", "name": "Yanfeng Zhang"}, {"authorId": "65981652", "name": "Hao Wang"}, {"authorId": "2054684040", "name": "Liang Geng"}, {"authorId": "1747102", "name": "Rubao Lee"}, {"authorId": "10375334", "name": "Xiaodong Zhang"}, {"authorId": "145024112", "name": "Ge Yu"}], "citations": [{"paperId": "9d3eabb3761d377eba935b4889fc497c3603d180", "title": "Optimizing Nested Recursive Queries"}, {"paperId": "95ded2a69df2362b445f27d17a0d6bc5c3d71d49", "title": "Ingress: an automated incremental graph processing system"}, {"paperId": "28046efa97f66923b4e24072dc614333b99aeea6", "title": "RAGraph: A Region-Aware Framework for Geo-Distributed Graph Processing"}, {"paperId": "67a6f91179cc1fcc8408c26ab9b90e5c38ab0d7f", "title": "Layph: Making Change Propagation Constraint in Incremental Graph Processing by Layering Graph"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "3b9e59e91d99a49122124b25d58e8a1a887e448b", "title": "HyTGraph: GPU-Accelerated Graph Processing with Hybrid Transfer Management"}, {"paperId": "e08e552c62b40c7ee2ec660b365d11956ef1d40d", "title": "NeutronStar: Distributed GNN Training with Hybrid Dependency Management"}, {"paperId": "5b01f1caeef7c93cf01f9d4ebc0af5efd8acc96e", "title": "Optimizing Parallel Recursive Datalog Evaluation on Multicore Machines"}, {"paperId": "7c2a78d9457f7187e58ef1adf5e2ec6e3a27e635", "title": "Fast datalog evaluation for batch and stream graph processing"}, {"paperId": "d2d1248446703603ad9355ef83e5892412e3efa5", "title": "Handling Iterations in Distributed Dataflow Systems"}, {"paperId": "47d6afe5756109d7090b1c3f821d9e10ebc714b8", "title": "Incrementalizing Graph Algorithms"}, {"paperId": "3895eda45dc64171dd9617af18561b9a8b193252", "title": "Automating Incremental Graph Processing with Flexible Memoization"}, {"paperId": "825a4c0026a1d8f348e25e9722971d98b24d03a1", "title": "Accelerating Large-Scale Prioritized Graph Computations by Hotness Balanced Partition"}, {"paperId": "18230127a20e46a13bccbdae6ce90f29f3a7c464", "title": "DBSpinner: Making a Case for Iterative Processing in Databases"}, {"paperId": "c1124e4c7b2d0f287e7a0cdfed0643df711fba16", "title": "Recursive Rules with Aggregation: A Simple Unified Semantics"}, {"paperId": "729428224c66aa30a50199c9c526512d1c1f4b23", "title": "Monotonic Aggregation for Temporal Datalog"}, {"paperId": "62264de0d0c93d4f07b762320eeb0fbf57385fcf", "title": "Reproducibility Report for ACM SIGMOD 2020 Paper: “Automating Incremental and Asynchronous Evaluation for Recursive Aggregate Data Processing”"}, {"paperId": "3b31000fbcb11707c456d659884a474a3e2af0ab", "title": "Distributed Graph Processing: Techniques and Systems"}]}
