{"paperId": "436ca0f81df8f65463015e3863246a9eb5fbe833", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Visualization Monitoring of Industrial Detonator Automatic Assembly Line Based on Digital Twin", "abstract": "The continuous development of information technology has increased the level of automation and informatization in the manufacturing industry, which makes it necessary for companies to effectively monitor their assembly lines. Aiming to visualize the monitoring challenges of the assembly line production process, taking the industrial detonator automatic assembly line as the research object and referring to the digital twin five-dimensional model, a visualization monitoring method that utilizes an assembly line based on a digital twin is proposed. First, the architecture of the assembly line visualization monitoring system based on digital twin is constructed, and its specific operation flow is studied. Then, three key implementation methods, including assembly line virtual entity model construction, data collection in the assembly process and complex equipment error detection, are studied. Finally, a visualization monitoring system for the industrial detonator automatic assembly line is designed and developed, which verifies that the proposed method is effective in the visualization monitoring of the assembly line.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2108546519", "name": "Hongjun Li"}, {"authorId": "2216711623", "name": "Yu Yang"}, {"authorId": "2145178389", "name": "Chi Zhang"}, {"authorId": "2155988660", "name": "Chengjun Zhang"}, {"authorId": "2283009", "name": "Wei Chen"}], "citations": [{"paperId": "c13ed4d39a0b0d1bbbb7400c84f9624a97d82b22", "title": "A Bibliometric Analysis of Digital Twin in the Supply Chain"}]}
