{"paperId": "4370f0f5a7ae6580ff72596f9573fca10a112cad", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "To Migrate or Not to Migrate: An Analysis of Operator Migration in Distributed Stream Processing", "abstract": "One of the most important issues in distributed data stream processing systems is using operator migration to handle highly variable workloads cost-efficiently and adapt to the needs at any given time on demand. Operator migration is a complex process involving changes in the state and stream management of a running query, typically without any data loss, and with as little disruption to the execution as possible. This tutorial aims to introduce operator migration, explain the core elements of operator migration, and provide the reader with a good understanding of the design alternatives used in existing solutions. We developed a conceptual model to explain the fundamentals of operator migration and introduce a unified terminology, leading to a taxonomy of existing solutions. The conceptual model separates mechanisms, i.e., how to migrate, and policy, i.e., when to migrate. This separation is further applied to structure the description of existing solutions, offering the reader an algorithmic perspective on various design alternatives. To enhance our understanding of the impact of various design alternatives on migration mechanisms, we also conducted an empirical study that provides quantitative insights. The operator downtime for the naïve migration approach is almost 20 times longer than when applying an incremental checkpoint-based approach.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-07", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "670-705", "volume": "26"}, "authors": [{"authorId": "88740128", "name": "Espen Volnes"}, {"authorId": "1705423", "name": "T. Plagemann"}, {"authorId": "1743153", "name": "V. Goebel"}], "citations": [{"paperId": "c3ed9325fe3ff66b86c0731320c9fe54c8af7576", "title": "DOLL: Distributed OnLine Learning Using Preemptible Cloud Instances"}, {"paperId": "093b132eae9a4c331be32c56fe2249cbe8323263", "title": "Travel light: state shedding for efficient operator migration"}]}
