{"paperId": "437a386f3fe4b8c7449a37e2364412a26e0a478c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "PolicyGPT: Automated Analysis of Privacy Policies with Large Language Models", "abstract": "Privacy policies serve as the primary conduit through which online service providers inform users about their data collection and usage procedures. However, in a bid to be comprehensive and mitigate legal risks, these policy documents are often quite verbose. In practical use, users tend to click the Agree button directly rather than reading them carefully. This practice exposes users to risks of privacy leakage and legal issues. Recently, the advent of Large Language Models (LLM) such as ChatGPT and GPT-4 has opened new possibilities for text analysis, especially for lengthy documents like privacy policies. In this study, we investigate a privacy policy text analysis framework PolicyGPT based on the LLM. This framework was tested using two datasets. The first dataset comprises of privacy policies from 115 websites, which were meticulously annotated by legal experts, categorizing each segment into one of 10 classes. The second dataset consists of privacy policies from 304 popular mobile applications, with each sentence manually annotated and classified into one of another 10 categories. Under zero-shot learning conditions, PolicyGPT demonstrated robust performance. For the first dataset, it achieved an accuracy rate of 97%, while for the second dataset, it attained an 87% accuracy rate, surpassing that of the baseline machine learning and neural network models.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-19", "journal": {"name": "ArXiv", "volume": "abs/2309.10238"}, "authors": [{"authorId": "2243996656", "name": "Chenhao Tang"}, {"authorId": "2145977326", "name": "Zheng Liu"}, {"authorId": "120688117", "name": "Chong-Yi Ma"}, {"authorId": "47039788", "name": "Zihao Wu"}, {"authorId": "2111161355", "name": "Yiwei Li"}, {"authorId": "46641573", "name": "W. Liu"}, {"authorId": "2181182", "name": "Dajiang Zhu"}, {"authorId": "2210054417", "name": "Quanzheng Li"}, {"authorId": "113075935", "name": "Xiang Li"}, {"authorId": "2115345993", "name": "Tianming Liu"}, {"authorId": "2244143682", "name": "Lei Fan"}], "citations": [{"paperId": "50ea1f3387e0e1a5f45722fa9d657982c78c2ce8", "title": "CBR-RAG: Case-Based Reasoning for Retrieval Augmented Generation in LLMs for Legal Question Answering"}, {"paperId": "3d6197e4ab55a3a2785ce5934e48cfbe9fe9bf04", "title": "Revolutionizing Finance with LLMs: An Overview of Applications and Insights"}, {"paperId": "0ae7bc864a66feae9e5a189a9ac24cf4c19aa0dd", "title": "Large Language Models are legal but they are not: Making the case for a powerful LegalLLM"}]}
