{"paperId": "438497a8fe2a387aeabf4c182a92a154aa480385", "publicationVenue": {"id": "b7aa40ac-729b-49d6-9064-4d1a9480e9a9", "name": "International Symposium on High-Performance Computer Architecture", "type": "conference", "alternate_names": ["HPCA", "High Perform Comput Appl", "Int Symp High-performance Comput Archit", "High Performance Computing and Applications"], "url": "https://web.archive.org/web/*/http://www.hpcaconf.org/"}, "title": "Data Motion Acceleration: Chaining Cross-Domain Multi Accelerators", "abstract": "There has been an arms race for devising accelerators for deep learning in recent years. However, real-world applications are not only neural networks but often span across multiple domains, e.g., database queries, compression, encryption, video coding, signal processing, and traditional machine learning, which may or may not contain deep learning. The sole focus on this single domain is sub-optimal as it misses the potential to proliferate and promote cross-domain multi-acceleration as there is an opportunity to harness the power of chaining heterogeneous Domain-Specific Architectures (DSAs) in modern datacenter applications. However, there is a catch as the data motion overhead can outweigh the benefits from all these chained heterogeneous accelerators. We dub the data restructuring and communication overhead of executing a single application using a chain of accelerators [1] as the data motion overhead. In a stark contrast with most works on DSAs that deal with accelerating compute kernels, this work focuses on accelerating data motion within a chain of heterogeneous DSAs in a multi-accelerator datacenter. To that end, this paper introduces Data Motion Acceleration (DMX) for (1) reducing data movement, (2) accelerating data restructuring, and (3) enabling interoperability between heterogeneous accelerators from different domains through a cross-stack hardware-software solution. The results with five end-to-end applications show that utilizing DMX offers up to 8.2 ×, 13.6 ×, and 5.2 × improvement in latency, throughput, and energy efficiency in a multi-accelerator system, respectively.", "venue": "International Symposium on High-Performance Computer Architecture", "year": 2024, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2024-03-02", "journal": {"name": "2024 IEEE International Symposium on High-Performance Computer Architecture (HPCA)", "pages": "1043-1062"}, "authors": [{"authorId": "2292055172", "name": "Shu-Ting Wang"}, {"authorId": "2156103275", "name": "Hanyang Xu"}, {"authorId": "2220462573", "name": "Amin Mamandipoor"}, {"authorId": "30851921", "name": "R. Mahapatra"}, {"authorId": "2056775119", "name": "Byung Hoon Ahn"}, {"authorId": "51285863", "name": "Soroush Ghodrati"}, {"authorId": "144121089", "name": "K. Kailas"}, {"authorId": "2292049071", "name": "Mohammad Alian"}, {"authorId": "2292060086", "name": "Hadi Esmaeilzadeh"}], "citations": []}
