{"paperId": "439a0602739b6a4c6e06b1fe4c29cde25e139e82", "publicationVenue": null, "title": "Auto-Validate: Unsupervised Data Validation Using Data-Domain Patterns Inferred from Data Lakes", "abstract": "Complex data pipelines are increasingly common in diverse applications such as BI reporting and ML modeling. These pipelines often recur regularly (e.g., daily or weekly), as BI reports need to be refreshed, and ML models need to be retrained. However, it is widely reported that in complex production pipelines, upstream data feeds can change in unexpected ways, causing downstream applications to break silently that are expensive to resolve. Data validation has thus become an important topic, as evidenced by notable recent efforts from Google and Amazon, where the objective is to catch data quality issues early as they arise in the pipelines. Our experience on production data suggests, however, that on string-valued data, these existing approaches yield high false-positive rates and frequently require human intervention. In this work, we develop a corpus-driven approach to auto-validate machine-generated data by inferring suitable data-validation \"patterns'' that accurately describe the underlying data-domain, which minimizes false-positives while maximizing data quality issues caught. Evaluations using production data from real data lakes suggest that \\sj is substantially more effective than existing methods. Part of this technology ships as an Auto-Tag feature in Microsoft Azure Purview.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-04-10", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2112689626", "name": "Jie Song"}, {"authorId": "2687810", "name": "Yeye He"}], "citations": [{"paperId": "ab18ac071fa08f19ab094634dfaaf82bf82f7cb8", "title": "Auto-Validate by-History: Auto-Program Data Quality Constraints to Validate Recurring Data Pipelines"}, {"paperId": "adf814579b2dbcdb760d37b20bf83d2f0a00e226", "title": "Desbordante: from benchmarking suite to high-performance science-intensive data profiler (preprint)"}, {"paperId": "bcd8b4954fb94feaf45912b4654ebda31c390eba", "title": "DeepJoin: Joinable Table Discovery with Pre-trained Language Models"}, {"paperId": "f4ab159a7b1027fee9e9ec2f7c7c553e52767350", "title": "Security for Machine Learning-based Software Systems: a survey of threats, practices and challenges"}, {"paperId": "c35bfaf0b1e29d4b7b92106a15d0d0b50860cd2a", "title": "Auto-Tag: Tagging-Data-By-Example in Data Lakes"}, {"paperId": "75264d5b7d144845737faa3947b82d06c6c537aa", "title": "Semantic programming by example with pre-trained models"}, {"paperId": "cbeaa7fe8e3d86a2b46fc10c0788a26836847f18", "title": "Data Lakes: A Survey of Functions and Systems"}]}
