{"paperId": "43a490b0a04706e3c7fe409bd4a038442c3eec8f", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Disaster-Resilient Communities on Flood Plains and Their Agricultural Regeneration: A Case Study in Meinong Plain, Taiwan", "abstract": "Taiwan’s near-mountain alluvial plain is a high-risk area with frequent disasters, and residents have become more tolerant of the compound disasters that occur with overall environmental changes associated with the development of urbanization in recent years. This paper presents a case study of a near-mountainous alluvial plain in Southern Taiwan. The Hakka ethnic group is the main community in the study area and also the main research object. This case study illustrates the disaster resilience of the community to natural and artificial disasters. This study adopted two research approaches, namely historical geography and political economic geography, as well as community resilience theory. Research methods including case study, secondary literature analysis, fieldwork, and interviews were used. Through text analysis, it was found that (1) the community’s awareness of disaster avoidance was rooted in the experience of reclamation in the early 17th century; (2) communities have experienced artificial disasters caused by political and economic intervention, which have been transformed into disaster awareness and community resilience; (3) cumulative artificial disasters have a greater impact on communities than unpredictable natural disasters; and (4) the energy of community resilience and agricultural regeneration is based on the duality of disasters.", "venue": "Water", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-28", "journal": {"name": "Water"}, "authors": [{"authorId": "3258726", "name": "Shu-Chen Tsai"}, {"authorId": "108249195", "name": "Su-Hsin Lee"}], "citations": [{"paperId": "7ffe94e50f2f21cc71718aa1ca3f1417c9603597", "title": "On the tailor-made water governance mechanism for Taiwan's semiconductor industry"}]}
