{"paperId": "43aa77bcdfaad44e9f1ade56ddb32d1b53ccee30", "publicationVenue": {"id": "05f07129-5526-4754-baa0-d919347a6089", "name": "International Journal of Digital Curation", "type": "journal", "alternate_names": ["Int J Digit Curation"], "issn": "1746-8256", "url": "http://www.ijdc.net/", "alternate_urls": ["http://www.ijdc.net/index.php/ijdc/index"]}, "title": "Towards Environmentally Sustainable Long-term Digital Preservation", "abstract": "ARCHIVER and Pre-Commercial Procurement funding has enabled small to medium enterprises (SMEs) to innovate and deliver new services for EOSC. Within the framework of the ARCHIVER pre-commercial procurement tender, between December 2020 and August 2021, three commercial consortia competed to deliver innovative, prototype solutions for long-term data preservation. Two of them were selected to continue with the pilot phase and deliver research-ready solutions for long-term data preservation of research data, therefore filling a gap in the current European Open Science panorama. \nDigital preservation relies on technological infrastructure (information and communication technology, ICT) that can have environmental impacts. While altering technology usage can reduce the impact of digital preservation practices, this alone is not a strategy for sustainable practice. Moving toward environmentally sustainable digital preservation requires critically examining the motivations and assumptions that shape current practice. The use of scalable cloud infrastructures can reduce the environmental impacts of long-term data preservation solutions.", "venue": "International Journal of Digital Curation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-31", "journal": {"name": "Int. J. Digit. Curation", "pages": "6", "volume": "17"}, "authors": [{"authorId": "2205891802", "name": "Ignacio Peluaga"}, {"authorId": "2068339260", "name": "J. Fernandes"}, {"authorId": "2120455710", "name": "S. Natraj"}], "citations": []}
