{"paperId": "43b4714b9fcb4c36b9c59dc1f183bc4ace9a0941", "publicationVenue": {"id": "5ccbcf07-811c-4d9f-953c-8c71ab296d62", "name": "Asia Pacific Workshop on Systems", "type": "conference", "alternate_names": ["Asia Pac Workshop Syst", "APSys", "Asia-Pacific Workshop on Systems", "ApSys", "Asia-pacific Workshop Syst"]}, "title": "High-Performance Stateful Stream Processing on Solid-State Drives", "abstract": "Stream processing has been widely used in big data analytics because it provides real-time information on continuously incoming data streams with low latency. As the volume of data increases and the processing logic becomes more complicated, the size of internal states in stream processing applications also increases. To deal with large states efficiently, modern stream processing systems support storing internal states on solid state drives (SSDs) by utilizing persistent key-value (KV) stores optimized for SSDs. For example, Apache Flink and Apache Samza store internal states on RocksDB. However, delegating state management to persistent KV stores degrades the performance, because the KV stores cannot optimize their state management strategies according to stream query semantics as they are not aware of the query semantics. In this paper, we investigate the performance limitations of current state management approaches on SSDs and show that query-aware optimizations can significantly improve the performance of stateful query processing on SSDs. Based on our observation, we propose a new stream processing system design with static and runtime query-aware optimizations. We also discuss additional research directions on integrating emerging storage technologies with stateful stream processing.", "venue": "Asia Pacific Workshop on Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-08-27", "journal": {"name": "Proceedings of the 9th Asia-Pacific Workshop on Systems"}, "authors": [{"authorId": "34096276", "name": "Gyewon Lee"}, {"authorId": "46258720", "name": "Jeongyoon Eo"}, {"authorId": "2111452394", "name": "J. Seo"}, {"authorId": "24682327", "name": "Taegeon Um"}, {"authorId": "1704157", "name": "Byung-Gon Chun"}], "citations": [{"paperId": "edb0c0907548a72220ca375aeda8fe9d2cceea61", "title": "FlowKV: A Semantic-Aware Store for Large-Scale State Management of Stream Processing Engines"}, {"paperId": "341ffc8e6c7fb06ed3b3338504e4c2457d3990f4", "title": "A Survey on Transactional Stream Processing"}, {"paperId": "70c10f1df663c059702ed3fa251c3841b8403d4b", "title": "Hardware-Conscious Stream Processing"}, {"paperId": "f1ddf757d3dd8c5263607d5e6103a2a218bebe86", "title": "Meces: Latency-efficient Rescaling via Prioritized State Migration for Stateful Distributed Stream Processing Systems"}, {"paperId": "9a3a237a25434cff96c2e56b9420f932a578e3c2", "title": "In support of workload-aware streaming state management"}]}
