{"paperId": "43bb3366f35fa92e23062c089b39c6f192fdf0a2", "publicationVenue": null, "title": "Mira: Sharing Resources for Distributed Analytics at Small Timescales", "abstract": "Modern distributed analytics stacks consist of application frameworks that enable processing of large amounts of data, and a resource manager that allows applications to share computational resources. The initial use case for these systems was running batch jobs with long lifetimes (e.g., a few hours), but, since their inception, new use cases have emerged where users increasingly use them to gain insight interactively, or even online. Efficiently sharing resources under these additional use cases, requires operating at smaller timescales (minutes or even seconds) than the existing systems were designed for and are capable of.In this paper, we present Mira, a system for optimized elastic execution of short-running and interactive data-analytics applications with low-latency execution startup, fast resource management and efficient resource utilization on shared clusters. We analyze the resource sharing overheads in a commonly used distributed processing stack (Spark+YARN) and reveal opportunities to accelerate applications in shared environments. Our experiments show, that Mira is able to reduce resource sharing related overheads by more than 400× and reduce application runtime by up to 4.2×.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "231-241"}, "authors": [{"authorId": "143918412", "name": "Michael Kaufmann"}, {"authorId": "7975384", "name": "K. Kourtis"}, {"authorId": "2662127", "name": "Adrian Schüpbach"}, {"authorId": "1714121", "name": "M. Zitterbart"}], "citations": [{"paperId": "284221ddb54eb34cff67ecc0f0e4c2d7943a5f7c", "title": "Cluster resource scheduling in cloud computing: literature review and research challenges"}, {"paperId": "202d991c9c273187c6f26a3f8b8ea48f9baae39c", "title": "Improving the Efficiency of Heterogeneous Clouds"}]}
