{"paperId": "43c13a0d9d132c5f4c8f03db039f730396ba92e0", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Self-supervised Learning for Pre-Training 3D Point Clouds: A Survey", "abstract": "Point cloud data has been extensively studied due to its compact form and flexibility in representing complex 3D structures. The ability of point cloud data to accurately capture and represent intricate 3D geometry makes it an ideal choice for a wide range of applications, including computer vision, robotics, and autonomous driving, all of which require an understanding of the underlying spatial structures. Given the challenges associated with annotating large-scale point clouds, self-supervised point cloud representation learning has attracted increasing attention in recent years. This approach aims to learn generic and useful point cloud representations from unlabeled data, circumventing the need for extensive manual annotations. In this paper, we present a comprehensive survey of self-supervised point cloud representation learning using DNNs. We begin by presenting the motivation and general trends in recent research. We then briefly introduce the commonly used datasets and evaluation metrics. Following that, we delve into an extensive exploration of self-supervised point cloud representation learning methods based on these techniques. Finally, we share our thoughts on some of the challenges and potential issues that future research in self-supervised learning for pre-training 3D point clouds may encounter.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-08", "journal": {"name": "ArXiv", "volume": "abs/2305.04691"}, "authors": [{"authorId": "2197075824", "name": "Ben Fei"}, {"authorId": "2158065044", "name": "Weidong Yang"}, {"authorId": "2179524486", "name": "Liwen Liu"}, {"authorId": "2068287693", "name": "Tian-jian Luo"}, {"authorId": "2047131853", "name": "Rui Zhang"}, {"authorId": "1527103472", "name": "Yixuan Li"}, {"authorId": "2145970811", "name": "Ying He"}], "citations": [{"paperId": "a29fd41812deb68aa6ee1c28b1221e3cabf3ac5c", "title": "3DMambaIPF: A State Space Model for Iterative Point Cloud Filtering via Differentiable Rendering"}, {"paperId": "610948c8ee113ec569cd4e7cb18b2ef2a40641af", "title": "MaskLRF: Self-supervised Pretraining via Masked Autoencoding of Local Reference Frames for Rotation-invariant 3D Point Set Analysis"}, {"paperId": "e43873bbb8f87120620bdf52a2e1f6d90d3ecc4d", "title": "T-MAE: Temporal Masked Autoencoders for Point Cloud Representation Learning"}, {"paperId": "205ada2927972cb3156e94247e29d454bf620399", "title": "Towards Knowledge-driven Autonomous Driving"}, {"paperId": "0a7a1d8cd1edd28ac24bb6d4247af613f2618641", "title": "Annotator: A Generic Active Learning Baseline for LiDAR Semantic Segmentation"}, {"paperId": "0a3eab75098f2ae26406ae9a3f27d38fab515668", "title": "Code-Switched Text Synthesis in Unseen Language Pairs"}]}
