{"paperId": "43c1e59bbd8f447e80b479b57f2ae8d5e7d95337", "publicationVenue": {"id": "064cbda6-2af7-40cb-9a07-22d7899d8f57", "name": "International Journal of Health Sciences", "type": "journal", "alternate_names": ["Int j health sci", "International Journal of Health Science", "International journal of health sciences", "Int J Health Sci", "International Journal Of Health Science"], "issn": "2710-2564", "alternate_issns": ["0924-2287", "2764-0159", "1791-4299", "1658-3639", "2827-9603", "2550-696X", "2550-6978"], "url": "https://interhealthjournal.page.tl/Home-IJHS.htm", "alternate_urls": ["http://www.ijhs.org.sa/", "https://www.ijhs.org.sa/index.php/journal", "http://sciencescholar.us/journal/index.php/ijhs"]}, "title": "Consistent sharing of personal health data in cloud using attribute based encryption (ABE)", "abstract": "Personal Health Record (PHR) is a booming model of patient’s health data updating and periodic maintenance. The patients' power over admittance to track their own PHRs is a challenging and recent technology. Attribute based Encryption (ABE) is advanced technologies were rules are framed based on their characteristics rather than identities. It is a secure key of the patient and is dependent on their characteristics .This paper focus on numerous information of the patients and the clients, to fit them in the PHR framework. The decryption of the secure key is done only when the characteristics match with the data base in the cloud. The security access can be a key or a text data. If numerous keys are created the cloud will grant access only when at least one key attribute gets match with the cloud data. This technology provides an additional dynamic tuning of access or record credits, to uphold the skill-ful on-request client/property denial and access under emergency situations. Other than this a Thresh-old Identity Based Encryption (TIBE) conspire is accommodated upgrading solid unscrambling consistency.", "venue": "International Journal of Health Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-29", "journal": {"name": "International journal of health sciences"}, "authors": [{"authorId": "2043650622", "name": "M. Rajkumar"}, {"authorId": "49078054", "name": "J. Karthika"}], "citations": []}
