{"paperId": "43cf07e127650631ba276b00445a8602ebd837ae", "publicationVenue": null, "title": "S Stream Query Optimization", "abstract": "A stream query optimization modifies a stream query to make it faster. Users want stream queries to be fast for several reasons. They want to grasp opportunities or avert risks observable on the input streams before it is too late. They want any views derived from the input streams to be upto-date and not stale. And they want their system to keep up with the rate of input streams without falling behind, which would require shedding load or saving data to disk for later processing. Knowing about stream query optimizations helps developers at all layers. Application developers who know about stream query optimizations can get the most out of the optimizations built into their streaming platform and can supplement them by hand-optimizing their application where necessary. Streaming platform developers can use knowledge about stream query optimizations to make their platform faster by implementing additional optimizations or by generalizing their existing optimizations to apply in more situations. Finally, researchers who invent new optimizations need to know the state-of-the-art optimizations to channel their efforts into the most innovative and impactful direction. The rest of this section introduces some basic concepts and gives a high-level overview and categorization of the most common stream query optimizations. An optimization should be both safe and profitable. An optimization is safe if it can be applied to a stream query without changing what it computes, as determined by the user’s requirements. An optimization is profitable if it makes the stream query faster, as measured by metrics that matter to the user, such as", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "1728836", "name": "Martin Hirzel"}, {"authorId": "144902788", "name": "R. Soulé"}, {"authorId": "1742813", "name": "B. Gedik"}, {"authorId": "144402955", "name": "S. Schneider"}], "citations": []}
