{"paperId": "43ddfdb8691100bd34f54650fcedde85084c100b", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Combined Method for Preparation of Landslide Susceptibility Map in Izmir (Türkiye)", "abstract": "Landslide susceptibility maps (LSMs) have been used frequently by researchers for many years in prediction of the occurrence of landslides. Since many landslides have occurred there in the past, Izmir, which is the third largest city of Türkiye, was selected for landslide susceptibility assessment using geographical information systems (GIS) and remote sensing (RS) techniques. The aim of this study is to create a better landslide susceptibility map (LSM) for the Izmir metropolitan area and its surroundings by minimizing the shortcomings of some of the commonly used methods. For this purpose, four different LSMs were prepared using the logistic regression (LR), analytical hierarchy process (AHP), frequency ratio (FR) and index of entropy (IOE) methods with susceptibility classes ranging from extremely low to extremely high. These four maps were then overlaid. The highest susceptibility class was chosen for each pixel to form a combined landslide susceptibility map (CLSM). The final CLSM is a thematic map presenting landslide susceptibility using five different classes. The geo-environmental factors selected for use in this analysis were slope angle, slope aspect, lithology, slope curvature, elevation, density of discontinuity, stream power index (SPI), land use and distance from stream. Finally, the areas under receiver-operating characteristic (ROC) curves were employed to compare the predictive capability of the five models used. Overall, the Combined Method (CM) (AUC = 0.887) performed very well for landslide susceptibility assessment. Out of all the models, the IOE model (AUC = 0.841) had a slightly lower predictive capability than the CM model, and AHP (AUC = 0.816) was better than FR (AUC = 0.738) and LR (AUC = 0.727). It was observed that, compared to rural areas, residential areas of Izmir city are particularly susceptible to landslides.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "50879063", "name": "C. Kıncal"}, {"authorId": "2184529871", "name": "Hakan Kayhan"}], "citations": [{"paperId": "88927068c4031ffa8f905aa3f60ab5c1bd3cac3d", "title": "Remote Sensing and GIS in Landslide Management: An Example from the Kravarsko Area, Croatia"}, {"paperId": "87a756a3109c405ca2ae70f514d6bf020c016c59", "title": "Automatic Mapping of Potential Landslides Using Satellite Multitemporal Interferometry"}, {"paperId": "38e5a35360d3a3a8a275c4e5ff0be456a7fde122", "title": "Application of AHP-ICM and AHP-EWM in Collapse Disaster Risk Mapping in Huinan County"}, {"paperId": "489e30435f8bc2813f703485918bcdf2ab67af38", "title": "Impact of Parameter Tuning with Genetic Algorithm, Particle Swarm Optimization, and Bat Algorithm on Accuracy of the SVM Model in Landslide Susceptibility Evaluation"}, {"paperId": "ab78758cb3542b37309887daf05b117b6e49e886", "title": "Snow avalanche susceptibility mapping using novel tree-based machine learning algorithms (XGBoost, NGBoost, and LightGBM) with eXplainable Artificial Intelligence (XAI) approach"}, {"paperId": "6b7fc9fa46152afd8b6a458502005955f2be482a", "title": "Spatial implementation of frequency ratio, statistical index and index of entropy models for landslide susceptibility mapping in Al-Balouta river basin, Tartous Governorate, Syria"}]}
