{"paperId": "4401bc479fed88233ba5a332a7c988707db4595d", "publicationVenue": {"id": "cbc4d7be-e64a-4b62-960b-3eaab7e77d51", "name": "IEEE VLSI Test Symposium", "type": "conference", "alternate_names": ["IEEE VLSI Test Symp", "VTS", "VLSI Test Symp", "VLSI Test Symposium"], "url": "http://www.tttc-vts.org/"}, "title": "Special Session: Towards an Agile Design Methodology for Efficient, Reliable, and Secure ML Systems", "abstract": "The real-world use cases of Machine Learning (ML) have exploded over the past few years. However, the current computing infrastructure is insufficient to support all real-world applications and scenarios. Apart from high efficiency requirements, modern ML systems are expected to be highly reliable against hardware failures as well as secure against adversarial and IP stealing attacks. Privacy concerns are also becoming a first-order issue. This article summarizes the main challenges in agile development of efficient, reliable and secure ML systems, and then presents an outline of an agile design methodology to generate efficient, reliable and secure ML systems based on user-defined constraints and objectives.", "venue": "IEEE VLSI Test Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-18", "journal": {"name": "2022 IEEE 40th VLSI Test Symposium (VTS)", "pages": "1-14"}, "authors": [{"authorId": "41051596", "name": "Shail Dave"}, {"authorId": "51486203", "name": "Alberto Marchisio"}, {"authorId": "98254755", "name": "Muhammad Abdullah Hanif"}, {"authorId": "153290110", "name": "Amira Guesmi"}, {"authorId": "1726554", "name": "Aviral Shrivastava"}, {"authorId": "2880991", "name": "Ihsen Alouani"}, {"authorId": "2077523138", "name": "Muhammad Shafique"}], "citations": [{"paperId": "a37c236803455afd7da3dc027e7865a0414a5697", "title": "Embodied Neuromorphic Artificial Intelligence for Robotics: Perspectives, Challenges, and Research Development Stack"}, {"paperId": "97a8b8cf631e1bf8740f0c80c17d78cf94a460a7", "title": "A review of Deep Learning Privacy, Security and Defenses"}, {"paperId": "1f030ff1635fd9d4271d41249004ec961e7cd12c", "title": "Exploring Winograd Convolution for Cost-Effective Neural Network Fault Tolerance"}, {"paperId": "b6067c140109b5eadbee61e0d758d54f68253dd5", "title": "A Homomorphic Encryption Framework for Privacy-Preserving Spiking Neural Networks"}, {"paperId": "7f28ed3b335d17dfc082f73e1bc884b26f2b80de", "title": "RobCaps: Evaluating the Robustness of Capsule Networks against Affine Transformations and Adversarial Attacks"}, {"paperId": "4b0868fcee18fe18f4966fdb1ebf82786ebb4fef", "title": "SwiftTron: An Efficient Hardware Accelerator for Quantized Transformers"}, {"paperId": "a3b2e7ef9bb1c0268ae25fc5cbb5fb0ba3cefbd9", "title": "Testability and Dependability of AI Hardware: Survey, Trends, Challenges, and Perspectives"}, {"paperId": "88548720b667aa4ef7127e7609242aaabd379633", "title": "Learning-Oriented Reliability Improvement of Computing Systems From Transistor to Application Level"}, {"paperId": "5aff7fca8e7be46c9c6318af1b9894e4009232f6", "title": "Explainable-DSE: An Agile and Explainable Exploration of Efficient HW/SW Codesigns of Deep Learning Accelerators Using Bottleneck Analysis"}, {"paperId": "f796b5345c6179eccfeb3b9f4c63496ff71429cd", "title": "RoHNAS: A Neural Architecture Search Framework With Conjoint Optimization for Adversarial Robustness and Hardware Efficiency of Convolutional and Capsule Networks"}, {"paperId": "8d3307fe809c81874d6f292d6f8f1db51bff79b9", "title": "fakeWeather: Adversarial Attacks for Deep Neural Networks Emulating Weather Conditions on the Camera Lens of Autonomous Systems"}, {"paperId": "f26e65f3d9fe9c1fa99da6d79323507e0e0a3165", "title": "Explainable-DSE: An Agile and Explainable Exploration of Efficient Hardware/Software Codesigns of Deep Learning Accelerators Using Bottleneck Analysis"}, {"paperId": "fe143ea36debfc31953a5c161c9a73ec6b968b08", "title": "Automating the Architectural Execution Modeling and Characterization of Domain-Specific Architectures"}]}
