{"paperId": "44053b226eda810c4f46b92f651bf0ebff2319a6", "publicationVenue": {"id": "e95c8d18-09be-464f-a3cf-5b2637f0eff6", "name": "Algorithms", "type": "journal", "issn": "1999-4893", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-150910", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-150910", "http://www.mdpi.com/journal/algorithms", "http://www.mdpi.com/journal/algorithms/"]}, "title": "A Dynamic Distributed Deterministic Load-Balancer for Decentralized Hierarchical Infrastructures", "abstract": "In this work, we propose D3-Tree, a dynamic distributed deterministic structure for data management in decentralized networks, by engineering and extending an existing decentralized structure. Conducting an extensive experimental study, we verify that the implemented structure outperforms other well-known hierarchical tree-based structures since it provides better complexities regarding load-balancing operations. More specifically, the structure achieves an O(logN) amortized bound (N is the number of nodes present in the network), using an efficient deterministic load-balancing mechanism, which is general enough to be applied to other hierarchical tree-based structures. Moreover, our structure achieves O(logN) worst-case search performance. Last but not least, we investigate the structure’s fault tolerance, which hasn’t been sufficiently tackled in previous work, both theoretically and through rigorous experimentation. We prove that D3-Tree is highly fault-tolerant and achieves O(logN) amortized search cost under massive node failures, accompanied by a significant success rate. Afterwards, by incorporating this novel balancing scheme into the ART (Autonomous Range Tree) structure, we go one step further to achieve sub-logarithmic complexity and propose the ART+ structure. ART+ achieves an O(logb2logN) communication cost for query and update operations (b is a double-exponentially power of 2 and N is the total number of nodes). Moreover, ART+ is a fully dynamic and fault-tolerant structure, which supports the join/leave node operations in O(loglogN) expected WHP (with high proability) number of hops and performs load-balancing in O(loglogN) amortized cost.", "venue": "Algorithms", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-18", "journal": {"name": "Algorithms", "pages": "96", "volume": "15"}, "authors": [{"authorId": "1718248", "name": "S. Sioutas"}, {"authorId": "1777284", "name": "Efrosini Sourla"}, {"authorId": "1702182", "name": "K. Tsichlas"}, {"authorId": "68973605", "name": "Gerasimos Vonitsanos"}, {"authorId": "1730580", "name": "C. Zaroliagis"}], "citations": []}
