{"paperId": "4409e0adeac5903778ff105cffa2d39c6633aea1", "publicationVenue": null, "title": "Security and Forensics in the Internet of Things: Research Advances and Challenges", "abstract": "Considering the billions of Internet of Things (IoT) devices around the world, the IoT has brought convenience to people’s lives, but also created a larger attack surface. Therefore, specific attention should be paid to IoT, especially from two aspects, namely, security and forensics. Security properties, especially authentication, ensure the integrity of large amounts of data processed in IoT networks, while forensic investigations can identify, collect, and retain evidence when abuse in IoT systems occurs. Regarding these two critical aspects, this article introduces and analyzes the latest biometric-based authentication research effort in IoT, as well as some IoT forensic investigation models/frameworks. In addition, we also investigate some unresolved challenges that IoT research still faces and provide a direction for future work.", "venue": "2020 Workshop on Emerging Technologies for Security in IoT (ETSecIoT)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-04-01", "journal": {"name": "2020 Workshop on Emerging Technologies for Security in IoT (ETSecIoT)", "pages": "12-17"}, "authors": [{"authorId": "34800223", "name": "Wencheng Yang"}, {"authorId": "2840505", "name": "Michael N. Johnstone"}, {"authorId": "3210745", "name": "L. Sikos"}, {"authorId": "47672587", "name": "Song Wang"}], "citations": [{"paperId": "5364218e6f91400dd6a5fe1634c4b618ec9d94b4", "title": "Comparative study of IoT forensic frameworks"}, {"paperId": "c06c3860c8fd5dc15e50a5e1844753c540f7c098", "title": "Privacy-Preservation and Containment in IoT Forensics Investigations: A Comparative Study"}, {"paperId": "65e82ca0af137e83bdc4e5823fb5647e2ab78cbc", "title": "Navigating the IoT landscape: Unraveling forensics, security issues, applications, research challenges, and future"}, {"paperId": "98db915c4fbf65660a4b26a971e3f57445117ab7", "title": "Digital Forensics Investigation and Incident Response in Internet of Things (IoT-DFIR): Challenges and Models"}, {"paperId": "80a0878cdeb00dbce3cec8f16d64598a04f006bb", "title": "Internet of Things and Digital Forensics: Recent Studies and Challenges"}, {"paperId": "72115b9139c5ac07efd35df96a5d6b5aa2c8adb0", "title": "Forensics in the Internet of Things: Application Specific Investigation Model, Challenges and Future Directions"}, {"paperId": "9cdc4e31525b07234cc240ae4a598466104a7dc3", "title": "Smart Home IoT Forensics: Current Status, Challenges, and Future Directions"}, {"paperId": "d8c5d6e72a3637d3bb2572588f3122f9bdf33e16", "title": "Cybersecurity and Cyber Forensics for Smart Cities: A Comprehensive Literature Review and Survey"}, {"paperId": "15cdc2d0f4958138ffefcc61660f9dea0b2c497b", "title": "Investigating IoT Systems Security Attacks using Network Forensics"}, {"paperId": "be278f1f89c589a8fdcf1d2d698e59eefab1dd96", "title": "INTERNET OF THINGS BASED ZIGBEE SNIFFER FOR SMART AND SECURE HOME"}, {"paperId": "471623107e3106e5110a933e33495a4c47714f4c", "title": "Cyber Forensics Tools: A Review on Mechanism and Emerging Challenges"}, {"paperId": "b31b85d76b3f5f8e55ed44092a7870dc1230683e", "title": "Smart Home Forensics—Data Analysis of IoT Devices"}]}
