{"paperId": "440f651126f734b9b81ada530630e2ffe2b1503e", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "Spatiotemporal Segmentation of Metro Trips Using Smart Card Data", "abstract": "Contactless smart card systems have gained universal prevalence in modern metros. In addition to its original goal of ticketing, the large amount of transaction data collected by the smart card system can be utilized for many operational and management purposes. This paper investigates an important problem: how to extract spatiotemporal segmentation information of trips inside a metro system. More specifically, for a given trip, we want to answer several key questions: How long does it take for a passenger to walk from the station gantry to the station platform? How much time does he/she wait for the next train? How long does he/she spend on the train? How long does it take to transfer from one line to another? This segmentation information is important for many application scenarios such as travel time prediction, travel planning, and transportation scheduling. However, in reality, we only assume that only each trip's tap-in and tap-out time can be directly obtained; all other temporal endpoints of segments are unknown. This makes the research very challenging. To the best of our knowledge, we are the first to give a practical solution to this important problem. By analyzing the tap-in/tap-out event pattern, our intuition is to pinpoint some special passengers whose transaction data can be very helpful for segmentation. A novel methodology is proposed to extract spatiotemporal segmentation information: first, for nontransfer trips, by deriving the boarding time between the gantry and the platform, and then, for with-transfer trips, by deriving the transfer time. Evaluation studies are based on large-scale real-system data of the Shenzhen metro system, which is one of the largest metro systems in China and serves millions of passengers daily. Onsite investigations validate that our algorithm is accurate and that the average estimation error is only around 15%.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2016, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-03-01", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "1137-1149", "volume": "65"}, "authors": [{"authorId": "2153305194", "name": "Fan Zhang"}, {"authorId": "145839881", "name": "Juanjuan Zhao"}, {"authorId": "2072926271", "name": "Chen Tian"}, {"authorId": "2153074801", "name": "Cheng-Zhong Xu"}, {"authorId": "1723807", "name": "Xue Liu"}, {"authorId": "145262558", "name": "Lei Rao"}], "citations": [{"paperId": "0cccd418179272a76b72827852c1bea17ca2634f", "title": "FairMobi-Net: A Fairness-aware Deep Learning Model for Urban Mobility Flow Generation"}, {"paperId": "44e0dcde5a4f0e2e6ec50783e76192d52b39ff77", "title": ": Mobility-Driven Integration of Heterogeneous Urban Cyber-Physical Systems Under Disruptive Events"}, {"paperId": "5b03b074cca62e3385cc35247b67d9c32f3e87da", "title": "The Inception of Time Prudent Approach at Metro Stations"}, {"paperId": "1ab6cedbca10bf12f5fe78fea2ef246a43180df6", "title": "How to Enhance Citizens’ Sense of Gain in Smart Cities? A SWOT-AHP-TOWS Approach"}, {"paperId": "e0db6326998a46827690ae1df94e56f9e23adc28", "title": "Advertisement Revenue and Exposure Optimization for Digital Screens in Subway Networks Using Smart Card Data"}, {"paperId": "9762ec6593ea6a093e7114f7040a1dad72a88857", "title": "Heterogeneity in the transfer time of air-rail intermodal passengers based on ticket booking data"}, {"paperId": "0417471fab97621f927845a57a05ea264dda8f60", "title": "ADS-B-Based Spatiotemporal Alignment Network for Airport Video Object Segmentation"}, {"paperId": "44b6e3b5de8346e830563384ab5b42427be4a79d", "title": "Characteristic density peak clustering algorithm for taxi hot spots detection"}, {"paperId": "3a26254a1fb4a2e1f34765d0f99317909a1973cd", "title": "Vehicle Routing Optimization Based on Multimedia Communication and Intelligent Transportation System"}, {"paperId": "1db87aa53f4c546aeb3250c745e3df5d5a87d9fe", "title": "Short-term trajectory prediction for individual metro passengers integrating diverse mobility patterns with adaptive location-awareness"}, {"paperId": "a4950de2590a825a050151d5fcf4051a81398733", "title": "Network-Wide Link Travel Time and Station Waiting Time Estimation Using Automatic Fare Collection Data: A Computational Graph Approach"}, {"paperId": "9e2a395435f8e7360a2e9946b5c0872d4db1e696", "title": "Transit OD matrix estimation using smartcard data: Recent developments and future research challenges"}, {"paperId": "6d17586565cee669a9b32ae3a5b24fe956ba86f7", "title": "Dynamic traffic bottlenecks identification based on congestion diffusion model by influence maximization in metro‐city scales"}, {"paperId": "dc5c7a95ab00f5b0b7d6540ae594539165bf5843", "title": "Recent Progress in Activity-Based Travel Demand Modeling: Rising Data and Applicability"}, {"paperId": "6db94737c7a4ed8db9d9806c4ffc96c75c9ee036", "title": "Crowding Prediction of In-Situ Metro Passengers Using Smart Card Data"}, {"paperId": "eebfd4b29ab20d07a2136811a319e8ff41b6c920", "title": "Estimating Wait Time and Passenger Load in a Saturated Metro Network: A Data-Driven Approach"}, {"paperId": "861c2ec0ecf50af163927460d9428e4ccba8f3e7", "title": "Passenger Travel Patterns and Behavior Analysis of Long-Term Staying in Subway System by Massive Smart Card Data"}, {"paperId": "0fe41f81ee1e7b5b3017f0e72091a425ec2baed9", "title": "Investigating physical encounters of individuals in urban metro systems with large-scale smart card data"}, {"paperId": "b7ca5a70e11faef57c4415cc8bd64739d18a2384", "title": "Big Data Analysis of Beijing Urban Rail Transit Fares Based on Passenger Flow"}, {"paperId": "223fc008ac9132d39433cc1d36b1257fae3c7a08", "title": "A Method to Estimate URT Passenger Spatial-Temporal Trajectory with Smart Card Data and Train Schedules"}, {"paperId": "1fba793b3bf4d03e01bcb0d4ff41c6aeddc9f418", "title": "Measuring, Predicting and Controlling Disruption Impacts for Urban Public Transport"}, {"paperId": "c5d539d42d71464e2c72b2dc3b159101615f6626", "title": "Urban Human Mobility: Data-Driven Modeling and Prediction"}, {"paperId": "12b69058883df75bee73cbb237540afa6dc1c6d2", "title": "Crowding valuation in urban tram and bus transportation based on smart card data"}, {"paperId": "2218d2cfba4c5ddae7c130bfb4fb4eb39925e325", "title": "A real‐time bus‐subway transfer scheme recommendation systems"}, {"paperId": "0b57a420b2200231b014ce8161d1bd9a974cd834", "title": "Minimizing Metro Transfer Waiting Time with AFCS Data Using Simulated Annealing with Parallel Computing"}, {"paperId": "140b13bd092018c142fe86f817234d14ce5dd82b", "title": "STLoyal: A Spatio-Temporal Loyalty-Based Model for Subway Passenger Flow Prediction"}, {"paperId": "62e8e7d6e8f91458ae704d2dd455216659f69ef2", "title": "Dynamic Integration of Heterogeneous Transportation Modes under Disruptive Events"}, {"paperId": "43e2f4b40af45559e96c54c59d3d01e8fb443bbf", "title": "Smartphone Sensing Meets Transport Data: A Collaborative Framework for Transportation Service Analytics"}, {"paperId": "c197068b7786cd0dbdaa79ba5c5e2c4209954b88", "title": "FISS: function identification of subway stations based on semantics mining and functional clustering"}, {"paperId": "9ec8e4948c6c3b21e1bfa9304b956ae1ee296892", "title": "IS2Fun: Identification of Subway Station Functions Using Massive Urban Data"}, {"paperId": "38b8212c4d034ae0b9b4202136d082c72db12bfc", "title": "A data-driven congestion diffusion model for characterizing traffic in metrocity scales"}, {"paperId": "fb3a9385573d59cea026818e018138291104b52d", "title": "MetroTime: Travel Time Decomposition under Stochastic Time Table for Metro Networks"}, {"paperId": "99fe65b3a3e6d923ef69fe58b4bdfb1d33bdef68", "title": "Spatio-Temporal Analysis of Passenger Travel Patterns in Massive Smart Card Data"}, {"paperId": "533f8b1dfc0faa125bc8359901ea59fa58c0e386", "title": "Geospatial Area Embedding Based on the Movement Purpose Hypothesis Using Large-Scale Mobility Data from Smart Card"}, {"paperId": "b0ff6f9581e81fe2c4e6f8db3a3a8d01a7096871", "title": "Real-Time Charging Station Recommendation System for Electric-Vehicle Taxis"}, {"paperId": "45be6f714004472e9ac02e03f92074828e88dba2", "title": "Representation learning for geospatial areas using large-scale mobility data from smart card"}, {"paperId": "67ed656ca36da2c6b1ce9e56f4feb3b6959f6fd8", "title": "Estimation of Passenger Route Choice Pattern Using Smart Card Data for Complex Metro Systems"}, {"paperId": "f23f285e2a76edd52682c2cc13c89a071e02afeb", "title": "Perspectives on stability and mobility of transit passenger's travel behaviour through smart card data"}, {"paperId": "2bed6952fb13808613136e62716941f1d866842f", "title": "Assessing longitudinal stability of public transport users with smart card data"}, {"paperId": "596c6926d4bcfb7eee292a1bf82f7645b5f8209d", "title": "SMART RAILWAY SYSTEM USING TRIP CHAINING METHOD"}, {"paperId": "ff61d9795621e40557fd97e0d33692cde032a4c1", "title": "Smart Card ID: An Evolving and Viable Technology"}, {"paperId": "0110eca7cda7aea7a61b1ebca53caa39b54f7e9d", "title": "A framework for identification of systematic service deterioration in urban rail systems"}, {"paperId": "f41ce38eb92d01f6db72ccb7ae1f4be8684a7873", "title": "Passengers Segmentation for Metro Run using Smart Card"}]}
