{"paperId": "4423f8c87959116db52238f1fa7f15bbd48f94d6", "publicationVenue": null, "title": "VSS: A Storage System for Video Analytics", "abstract": "We present a new video storage system (VSS) designed to decouple high-level video operations from the low-level details required to store and efficiently retrieve video data. VSS is designed to be the storage subsystem of a video data management system (VDBMS) and is responsible for: (1) transparently and automatically arranging the data on disk in an efficient, granular format; (2) caching frequently-retrieved regions in the most useful formats; and (3) eliminating redundancies found in videos captured from multiple cameras with overlapping fields of view. Our results suggest that VSS can improve VDBMS read performance by up to 54%, reduce storage costs by up to 45%, and enable developers to focus on application logic rather than video storage and retrieval.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-03-30", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "144843868", "name": "Brandon Haynes"}, {"authorId": "2064928598", "name": "Dong He"}], "citations": [{"paperId": "8ea275865dd81ad5771a95fc2e1ea1eea7647480", "title": "High-Performance Caching of Homomorphic Encryption for Cloud Databases"}, {"paperId": "021f6f79c1289f4a1462216397bd5fd539851358", "title": "Toward Efficient Homomorphic Encryption for Outsourced Databases through Parallel Caching"}, {"paperId": "97e8e9ad3862629bacb28b994f2d5d52a2371c00", "title": "Extract-Transform-Load for Video Streams"}, {"paperId": "70e3fac68959e2175184bdc60e2986cf47df0071", "title": "EQUI-VOCAL: Synthesizing Queries for Compositional Video Events from Limited User Interactions"}, {"paperId": "7421820b8f677fcaafa6a40b9d2cd840e25cb8ac", "title": "SoC-Cluster as an Edge Server: an Application-driven Measurement Study"}, {"paperId": "1add047298154e27d8ef732e6c73c2f1c91eba23", "title": "Optimizing Video Analytics with Declarative Model Relationships"}, {"paperId": "bff7617fcb58d3314de00ebec0ebb8003eabaa26", "title": "Video-zilla: An Indexing Layer for Large-Scale Video Analytics"}, {"paperId": "e3c7f1a9dd8c6cfd943d9f216d9282ccb80425f4", "title": "FiGO: Fine-Grained Query Optimization in Video Analytics"}, {"paperId": "ae492e7cb34e0c2630575516d87fde3276242d32", "title": "EVA: A Symbolic Approach to Accelerating Exploratory Video Analytics with Materialized Views"}, {"paperId": "973784aa89107ba227f4ba896325f79e84e10957", "title": "Cost Minimization of Cloud Services for On-Demand Video Streaming"}, {"paperId": "d6ea727d8c45481d3d62cf1e67a39b003267061f", "title": "Live video analytics as a service"}, {"paperId": "6ec2e6585cdda2bbbd9e7c6fa49ab518b4c2bcb5", "title": "INCHE: High-Performance Encoding for Relational Databases through Incrementally Homomorphic Encryption"}, {"paperId": "7bc07012b9a9ae8150c1e66e91168cfa6603b8f5", "title": "VIVA: An End-to-End System for Interactive Video Analytics"}, {"paperId": "b7cbefd6c8acad3caa5b8b1836c23147ddf427cc", "title": "VOCAL: Video Organization and Interactive Compositional AnaLytics"}, {"paperId": "cfe67cae58393210279b095ddbedf1b5099e9a56", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
