{"paperId": "4425869cb55722a036bfa394c769895c81a32fb1", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Digital Learning and Training Methodology in Study of Health Monitoring in Resco System", "abstract": "This paper deals with Digital Learning and Training Methodology (DLTM) or Pedagogy (DLTP) in Study of Health Monitoring in RESCO. In a closed room teaching learning process its practically difficult to establish set up for grid connected power system and setup for condition monitoring in all academic institute which can be accessed for all time even from remote end. To overcome this limitation, RESCO model of solar power system connected with grid has been considered. Various health parameters of the system have been captured and stored in cloud from data capturing and transmission unit. Data are made accessible for study by remote end learners as well as data may be accessed from research laboratory. All information is made available for use at all time and can be accessed by computers and smart phone. If needed, researcher can interact with the system. This type of digital learning and training methodology is helpful to provide information, skill and knowledge to big number of learners of any age group as required.", "venue": "Social Science Research Network", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-04-24", "journal": {"name": "Materials Engineering eJournal"}, "authors": [{"authorId": "2066449510", "name": "S. Chattopadhyay"}, {"authorId": "2059371282", "name": "T. K. Das"}, {"authorId": "48806744", "name": "Arabinda Das"}], "citations": [{"paperId": "fc06e8805b790bb147324565be611948b9de14e4", "title": "Process Analytics Model Approach in Healthcare"}]}
