{"paperId": "4426ec037a7d63a0dc60dfc959695c779d69f2c4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Theoretical Perspective of Multi-Dividing Ontology Learning Trick in Two-Sample Setting", "abstract": "The multi-dividing ontology learning framework has been proven to have a higher efficiency for tree-structured ontology learning, and in this work, we consider a special setting of this learning framework in which ontology sample set for each rate is divided into two groups. This setting can be regarded as the classic two-sample learning problem associated with multi-dividing ontology framework. In this work, we mainly focus on the theoretical analysis of multi-dividing two-sample ontology learning algorithm, whose ontology objective function is proposed, and the generalization bounds in this setting is obtained in terms of $U$ -statistics technique. The theoretical result given is of potential guiding significance in the field of ontology engineering applications.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "220703-220709", "volume": "8"}, "authors": [{"authorId": "2006684875", "name": "Linli Zhu"}, {"authorId": "49195402", "name": "Gang Hua"}], "citations": [{"paperId": "e06e219da41fa7c2bfe45a9252683c712fa049fb", "title": "OnTARi: an ontology for factors influencing therapy adherence to rehabilitation"}, {"paperId": "1947d755dac814a96550b3a544d2a03eee550d6b", "title": "Entropic measures of complexity in a new medical coding system"}, {"paperId": "de6cfff69168ad0fb13b47cabcc8e3790c309f20", "title": "The Theoretical Analysis of Multi-dividing Ontology Learning by Rademacher Vector"}]}
