{"paperId": "442e0909092927465d9ce69c08502c5606b5495c", "publicationVenue": {"id": "392d4fdc-ed74-4f5a-822b-3a7a00e28152", "name": "Asia-pacific Journal of Convergent Research Interchange", "type": "journal", "alternate_names": ["Asia-pacific J Converg Res Interchange"], "issn": "2508-9080"}, "title": "Influence of Internet-based Social Big Data on Personal Credit Reporting", "abstract": "With the advent of the era of big data, the connotation of Credit investigation in China has gradually shifted from traditional data to social big data. The sources of credit data are not limited to traditional data, such as credit data; It also includes data on network behavior based on Internet transactions. The scene of credit investigation also extends from the financial industry to economic and social life. Based on the traditional credit analysis model, this paper puts forward a new network behavior credit analysis model by replacing \"mortgage\" with \"social\". Through data collection, data model, data service and other links, this paper proves that big data of network behavior can cover all credit investigation elements and can be used as a data source for personal credit analysis, with very high integrity. Among them, social network big data is a very important data source and occupies a high weight. This paper adopts the information research method, collects, processes and collates the social network big data, personal credit investigation and other information, constructs the \"5C\" credit analysis method of network behavior, and studies the personal credit investigation of the social network big data by combining the examples of Domestic Internet giants Tencent and Ali, and adopts the tabling method and cobweb map, etc. The network behavior credit analysis model proposed in this paper makes full use of the big data of social network to promote the development of personal credit investigation business and provides meaningful and valuable Suggestions for the government and industry.", "venue": "Asia-pacific Journal of Convergent Research Interchange", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-07-31", "journal": {"name": "Asia-pacific Journal of Convergent Research Interchange"}, "authors": [{"authorId": "1891280534", "name": "Meng Li"}, {"authorId": "2283829866", "name": "Shuang Zhang"}, {"authorId": "2288971551", "name": "Fuqiang Wang"}], "citations": [{"paperId": "2f66eea2f8541a48b1c424abd795ad497109fc45", "title": "Text Classification of Mixed Model Based on Deep Learning"}, {"paperId": "23f5b82e26eb116d9f2c3fd35488c4ff31a4e858", "title": "Discovery of village resources in urban regeneration project based on big data analytics"}, {"paperId": "8bc04c1df03d2c502401432a9ab514b834997f50", "title": "Development of High-Strength Concrete Mixed Design System Using Artificial Intelligence"}]}
