{"paperId": "442eb86f58c7b0b49cb3be792b6c4ffaca8118c6", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Query-Driven Data Minimization with the DataEconomist", "abstract": "In this paper, we explain the demonstration of the DataEconomist, a framework for query-driven data minimization in relational DBMS conformable to law. Our approach automatically minimizes user access rights based on the analysis of SQL query logs and thereby enables a parsimonious data processing. A minimization of data collection is reached by automatic detection and manual deletion of data belonging to unneeded schema elements. In contrast to existing approaches, the DataEconomist supports privacy officers by focusing on the queries instead of making them trawl through a vast amount of collected personal data and specify legal use cases for their processing. SQL queries easily showwho has processed when which data for which purpose and make it easy for the privacy officers to decide about the queries’ compliance with data privacy regulations. Our framework does not require any knowledge of SQL by providing a graphical tool for searching and filtering queries and visualizations of query result sets.", "venue": "International Conference on Extending Database Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "614-617"}, "authors": [{"authorId": "2697151", "name": "Peter K. Schwab"}, {"authorId": "1411246523", "name": "Julian O. Matschinske"}, {"authorId": "39190391", "name": "A. Wahl"}, {"authorId": "1399432410", "name": "K. Meyer-Wegener"}], "citations": [{"paperId": "361876b764524897c39289b983dbae8fd7676bf5", "title": "We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomist"}, {"paperId": "09f42a539948aa1f24d87abf234d6fd442f1a568", "title": "Query-Driven Enforcement of Rule-Based Policies for Data-Privacy Compliance"}]}
