{"paperId": "444ee33af8f2d81a55590e8f27058f2f887f304f", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "Relative Assortativity Index: A Quantitative Metric to Assess the Impact of Link Prediction Techniques on Assortativity of Complex Networks", "abstract": "\n We propose a quantitative metric (called relative assortativity index, RAI) to assess the extent with which a real-world network would become relatively more assortative due to link addition(s) using a link prediction technique. Our methodology is as follows: for a link prediction technique applied on a particular real-world network, we keep track of the assortativity index values incurred during the sequence of link additions until there is negligible change in the assortativity index values for successive link additions. We count the number of network instances for which the assortativity index after a link addition is greater or lower than the assortativity index prior to the link addition and refer to these counts as relative assortativity count and relative dissortativity count, respectively. RAI is computed as (relative assortativity count − relative dissortativity count) / (relative assortativity count + relative dissortativity count). We analyzed a suite of 80 real-world networks across different domains using 3 representative neighborhood-based link prediction techniques (Preferential attachment, Adamic Adar and Jaccard coefficients [JACs]). We observe the RAI values for the JAC technique to be positive and larger for several real-world networks, while most of the biological networks exhibited positive RAI values for all the three techniques.", "venue": "Computer/law journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-21", "journal": {"name": "Comput. J.", "pages": "1417-1437", "volume": "63"}, "authors": [{"authorId": "1765792", "name": "N. Meghanathan"}], "citations": [{"paperId": "69dc1d0d55da81d9b2c2f0a19157ed2577f07ace", "title": "Node Dissimilarity Index for Complex Network Analysis"}]}
