{"paperId": "4458dd0448b93ae5dc5a06cf3481a5ec71b25413", "publicationVenue": {"id": "99e98681-158c-48ca-8f86-386d75770b50", "name": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "type": "conference", "alternate_names": ["IEEE/ACM Int Symp Model Anal Simul Comput Telecommun Syst", "Model Anal Simul Comput Telecommun Syst", "Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "MASCOTS"], "url": "http://www.mascots-conference.org/"}, "title": "Investigating Multi-Tier and QoS-Aware Caching Based on ARC", "abstract": "Memory caching is a common practice to reduce application latencies by buffering relevant data in high speed memory. When the volume of data to cache is too large or a DRAM - based solution too expensive, several technologies such as NVM or high speed SSDs could complement DRAM to form a multi-tier cache. Additionally, most existing policies focus on categorizing the data based on factors like recency and frequency, setting aside the fact that applications/customers have varying Quality-of-Service requirements. This concept is well established in Cloud environment with Service Level Agreement (SLA). In this paper, by extending the Adaptive Replacement Cache (ARC), that uses recency and frequency lists, we propose a QoS-aware Multi-tier Adaptive Replacement Cache (QM-ARC) policy with the ability to take into account data applications/customers priorities through the concept of penalty borrowed from the Cloud. QM-ARC is generic, as it can be applied whatever the number of tiers and can accommodate different penalty functions. Using synthetic and real traces, our solution improved QoS as compared to state-of-the-art work.", "venue": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-16", "journal": {"name": "2023 31st International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS)", "pages": "1-4"}, "authors": [{"authorId": "2171747545", "name": "Lydia Ait-Oucheggou"}, {"authorId": "144722791", "name": "S. Rubini"}, {"authorId": "2279743471", "name": "Abdella Battou"}, {"authorId": "2537219", "name": "Jalil Boukhobza"}], "citations": []}
