{"paperId": "445d6edb7ed2deb5e8e2d1e54b5b9b73d02bef78", "publicationVenue": {"id": "f3fc2b06-d105-40f5-a248-64cf28379e9c", "name": "IEEE International Symposium on Network Computing and Applications", "type": "conference", "alternate_names": ["NCA", "IEEE Int Symp Netw Comput Appl", "Network Computing and Applications", "Netw Comput Appl"], "url": "http://www.ieee-nca.org/"}, "title": "Hardware-Performance-Counters-based anomaly detection in massively deployed smart industrial devices", "abstract": "Energy providers are massively deploying devices to manage distributed resources or equipment. These devices are used for example to manage the energy of smart factories efficiently or to monitor the infrastructure of smart-grids. By design, they typically exhibit homogeneous behavior, with similar software and hardware architecture. Unfortunately, these devices are also of interest to attackers aiming to develop botnets or compromise companies' security. This paper presents a new protection approach based on Hardware Performance Counters (HPC) to detect anomalies in massively deployed devices. These HPC are processed using outlier detection algorithms. Compared to existing solutions, we propose a lightweight approach based on a comparative analysis of devices' HPC without relying on the modeling of the software applications running on the devices. To assess the relevance and the effectiveness of the approach, a thorough experimental analysis is carried out in a representative industrial-type environment, sampling the data from 100 Raspberry Pi to simulate about 10,000 devices deployed simultaneously. The results show high detection and performance efficiency under different software profiles and attack payloads. Moreover, the calibration of the approach depends primarily on the hardware rather than the application software running on the devices. It should ease its deployment in an operational environment.", "venue": "IEEE International Symposium on Network Computing and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-24", "journal": {"name": "2020 IEEE 19th International Symposium on Network Computing and Applications (NCA)", "pages": "1-8"}, "authors": [{"authorId": "2045769007", "name": "Malcolm Bourdon"}, {"authorId": "37287857", "name": "Pierre-François Gimenez"}, {"authorId": "3069408", "name": "E. Alata"}, {"authorId": "3066478", "name": "M. Kaâniche"}, {"authorId": "3343253", "name": "Vincent Migliore"}, {"authorId": "2820698", "name": "V. Nicomette"}, {"authorId": "2416180", "name": "Youssef Laarouchi"}], "citations": [{"paperId": "6590ca8b033a02fcb99b17fc986f327778dd9db4", "title": "Deep Learning-Driven Anomaly Detection for Green IoT Edge Networks"}, {"paperId": "c0c46d27b0a73be15810998895544f0ff8a2e555", "title": "Anomaly Detection in a Smart Industrial Machinery Plant Using IoT and Machine Learning"}, {"paperId": "f6ee81c1330478df5d966248fe799a74a1a6b39e", "title": "A Lightweight Intrusion Detection System against IoT Memory Corruption Attacks"}]}
