{"paperId": "447b5c9f91f1e117fb69a1ea6fe6ee0fcfe7ac07", "publicationVenue": null, "title": "Blogs as Elusive Ethnographic Texts", "abstract": "Burgeoning online environments offer completely new opportunities for ethnographic and other forms of qualitative research. Yet there are no clear standards for how we study online texts from an ethnographic perspective. In this article, we identify barriers to the application of traditional qualitative methods online, using the example of a systematic thematic analysis of weight-loss blogs. These barriers include the influence of the technology structuring online content, the fluid nature of online texts such as blogs, and the highly connected and public nature of online identities, which may span multiple social media platforms. We discuss some potential approaches to addressing these challenges as preliminary steps toward developing a tool kit suited to ethical, high-quality online modes of ethnographic research.", "venue": "", "year": 2017, "fieldsOfStudy": ["Sociology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-04-27", "journal": {"name": "International Journal of Qualitative Methods", "volume": "16"}, "authors": [{"authorId": "112957185", "name": "Liza C. Kurtz"}, {"authorId": "38598312", "name": "S. Trainer"}, {"authorId": "66729646", "name": "M. Beresford"}, {"authorId": "6928746", "name": "Amber Wutich"}, {"authorId": "5771885", "name": "A. Brewis"}], "citations": [{"paperId": "c7ecdc0e7f82ed358404528f9aa0c078acdffd7d", "title": "Blogging at the end-of-life: Anticipatory grief, losses, and positive experiences in facing terminal illness."}, {"paperId": "50d53a8beb440e2558c4f47ad745250b3707440f", "title": "City Governance, Participatory Democracy, and Cultural Heritage in Barcelona, 1986–2022"}, {"paperId": "0f1e18f6a8211134084f39a3eac1841b88625bba", "title": "My mum is on strike! Social reproduction and the (emotional) labor of ‘mothering work’ in neoliberal Britain"}, {"paperId": "8fad76208fa7018597102870466e419a16aa13f4", "title": "Personal Narratives of Mental Illness: From Hostage to Survivor"}, {"paperId": "1d1e8e3ee5b3dcbd87f33f209339686e980ad53b", "title": "Stuck in Wuhan? White mobility capital and the evacuation of mixed-status families after the Covid-19 outbreak"}, {"paperId": "03d1fea924f146112e1161648803b1787a659b69", "title": "Lifestyle challenges and mental health of professional tennis players: an exploratory case study"}, {"paperId": "f51c7f05e832394043dcc38f8fe2832be450b400", "title": "Blogs as Time Capsules of Data: Exploring the Value of Blogs for Research in Human Geography"}, {"paperId": "47971df70ca19c1098aabb157a8847429bb8d142", "title": "Figurative meaning in multimodal work by an autistic artist: a cognitive semantic approach"}, {"paperId": "68e10273363f9d783514c0bd79cbc9f2aa157659", "title": "Perspectives on Fruit and Vegetable Consumption and Government Dietary Guidelines: Content Analysis of Comments on News Websites"}, {"paperId": "47e97e244f0f5457273652dae3033375a8360243", "title": "How Children of Parents With Dementia Can Make Their Subject Positions Understandable and Meaningful"}, {"paperId": "a084fb7e62b5113b730913ec071a07526edc9d3c", "title": "Anarchist Youth in Rural Canada: Technology, Resistance, and the Navigation of Space"}, {"paperId": "19bca1374611b8d3f3954e652d1a3d5cfa2c7190", "title": "Ethical, Practical, and Methodological Considerations for Unobtrusive Qualitative Research About Personal Narratives Shared on the Internet"}, {"paperId": "459854a58a873056191c53d9f565d6c9ee65239d", "title": "Embedding Ethical Principles in the Information Science Research Process"}, {"paperId": "1ec77d241dfca4723998d778cf70a1aa5b61fbfc", "title": "Decentralizing Geographies of Political Action: Civic tech and Place-Based Municipalism"}]}
