{"paperId": "448235eb723056c5f151d83bce1141373997000e", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Random Matrix Model for the Ecological Model of Innovation and Entrepreneurship Education for College Students", "abstract": "The introduction of the ecological perspective into the research of entrepreneurship education is an important transformation of the way of thinking. Using the thinking forms such as integrity, diversity, and openness, it analyzes the ecological role relationship of the various elements of entrepreneurship education itself, and the relationship between the entrepreneurship education system and the external social ecology. The relationship between the system and the influence of various elements on the effect of entrepreneurship education is clarified to ensure that entrepreneurship education achieves practical results. From the perspective of ecology, based on the research on entrepreneurship education in colleges and universities, on the basis of ecological cognition of entrepreneurship education, this research attempts to solve many problems in the current implementation of entrepreneurship education in colleges and universities through the theoretical construction of an ideal college entrepreneurship education ecosystem. The problem of ecological imbalance can better serve the practice of entrepreneurship education in colleges and universities. At the same time, theoretically expand the horizons of entrepreneurship education research in colleges and universities, and further promote the “conditional” integration of ecological thinking and entrepreneurship education. This paper introduces the random matrix theory and introduces the related theory of Monte Carlo method. The weight assignment of the evaluation index system is realized, which lays the foundation for the quantitative evaluation. The weight coefficients of the indicators at all levels are determined by the analytic hierarchy process, and the importance of the indicators is judged by the weight coefficients, so as to realize the scientific quantitative evaluation of the innovation and entrepreneurship education ecosystem. At the same time, the scientificity of the evaluation index system is verified by means of the method of reliability and validity test. The conclusions of this study theoretically solve the main problems existing in the evaluation of the current innovation and entrepreneurship education ecosystem. By building a complete evaluation index system for the innovation and entrepreneurship education ecosystem in colleges and universities, it helps researchers and users to clarify the connotation and elements of the innovation and entrepreneurship education ecosystem in colleges and universities, and fully taps the “hidden” elements of evaluation indicators, making the evaluation more comprehensive.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-24", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2115413249", "name": "Fen Yang"}], "citations": [{"paperId": "23bbdebb1254d5971df5d043553eaf0f27eae6bb", "title": "Modified TODIM-TOPSIS technique for type-2 neutrosophic number multiple-attribute decision-making and applications to innovation and entrepreneurship education evaluation in vocational colleges"}, {"paperId": "d0f7c28f0480cf79ff85e45adc7571680caa09fc", "title": "CoCoSo framework for multi-attribute decision-making with triangular fuzzy neutrosophic sets: “Innovation and entrepreneurship” evaluation case"}, {"paperId": "45fff76cd7526a3979992d06854b31d28e729e1e", "title": "Research on innovation and entrepreneurship education environment evaluation in universities under the background of \"Double Innovation\" with interval-valued intuitionistic fuzzy information"}, {"paperId": "4bcd39fb2768075ee4164aa6620763337203948a", "title": "Entrepreneurship Education for Training the Talent in China: Exploring the Influencing Factors and Their Effects"}, {"paperId": "ed7a3246a9fb269eafa8eaa4afe9ed6ddb5f9718", "title": "Entrepreneurship Education: Encouraging Entrepreneurial Intentions for Equality Education Students in Semarang"}]}
