{"paperId": "449c811c8e022829170f5a42384ce220cd7c00a4", "publicationVenue": {"id": "cc2c39ca-a61b-4647-8c25-f3df190587a9", "name": "Environment and Planning F", "type": "journal", "alternate_names": ["Environ Plan F"], "issn": "2634-9825"}, "title": "Moving beyond anonymity: Embracing a collective approach to location privacy in data-intensive geospatial analytics", "abstract": "Privacy has been an important topic within the geospatial science community, particularly driven by the widespread adoption of geospatial technologies such as mobile devices and the vast amount of location data they generate. This has sparked considerable interest in location privacy that is specifically dedicated to the protection of location information. However, existing literature on location privacy mostly focuses on preserving anonymity and protecting against individual identifiability when using geospatial data. While this is undoubtedly valuable, it may prove insufficient in a landscape characterized by pervasive data collection and analytics. This article argues that the powerful capabilities of algorithms in data-intensive geospatial analytics allow for the profiling of groups of individuals and the prediction of sensitive information that has not been explicitly collected, without necessarily compromising individual identifiability. Nonetheless, these practices pose severe threats to privacy and can contribute to inequality in the treatment of certain populations, leading to structural and societal challenges. In response to these challenges, a collective approach should be embraced to address location privacy concerns. Both regulatory and technical practices need to acknowledge the interdependency of privacy, while individuals should cultivate an awareness of cooperation in privacy protection.", "venue": "Environment and Planning F", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-26", "journal": {"name": "Environment and Planning F"}, "authors": [{"authorId": "2254152038", "name": "Yue Lin"}], "citations": []}
