{"paperId": "449fcd05ade1e0c2dbc3dd7d5e3e241f9be5161b", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Hathi: An MCDM-based Approach to Capacity Planning for Cloud-hosted DBMS", "abstract": "The evolution of distributed Database Management Systems (DBMSs) has led to heterogeneity in DBMS technologies. Particularly DBMSs applying a shared-nothing approach enable distributed operation and support fine-grained configurations of distribution characteristics such as replication degree and consistency. Overall, the operation of such DBMSs on IaaS clouds leads to a large configuration space involving different cloud providers, cloud resources and pricing models.The selection of a specific configuration impacts nonfunctional features such as performance, availability, consistency, but also costs of the deployment. In consequence, these need to be traded-off against each other and a suitable configuration needs to be found, satisfying technical and operational aspects. Yet, due to the strong interdependency between different non-functional features as well as the large number of DBMSs, configuration options, and cloud providers, a manual analysis and comparison is not possible.In this paper, we present Hathi, an evaluation-driven Multi Criteria Decision Making (MCDM) framework for planning of cloud-hosted distributed DBMS. By specifying DBMS configurations, workloads, and cloud offers, Hathi automatically performs experiments and evaluates their results. These are then matched against a list of user-defined preferences using an MCDM algorithm.Our evaluation shows that Hathi is able of performing largescale evaluation scenarios involving multiple DBMS in various cluster sizes, cloud providers, and cloud offers. Hathi can weight the resulting data and derives deployment recommendations with respect to throughput, latency, cost, consistency, availability, and stability.", "venue": "International Conference on Utility and Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE/ACM 13th International Conference on Utility and Cloud Computing (UCC)", "pages": "143-154"}, "authors": [{"authorId": "2214992", "name": "Jörg Domaschka"}, {"authorId": "40193076", "name": "Simon Volpert"}, {"authorId": "40596015", "name": "Daniel Seybold"}], "citations": [{"paperId": "8ecb98174162b88c9ceabe74bd0a99543a7f088e", "title": "Built-In Calibration Standard and Decision Support System for Controlling Structured Data Storage Systems Using Soft Computing Techniques"}, {"paperId": "7b7cf2dd08137cd920af5c3c70ed571e8261fd2b", "title": "Benchmarking-as-a-service for cloud-hosted DBMS"}, {"paperId": "9de3d642a85333ad2c5e0d5b534df0597fbf1a04", "title": "S O K: V IRTUALIZATION C LASSIFICATION ON I SOLATION C APABILITIES"}, {"paperId": "5f39026668e6211dbde0e4236d14aad6301e7e8f", "title": "Automated Benchmarking of Cloud-Hosted DBMS With benchANT (Poster)"}]}
