{"paperId": "44ad5b332ba3214cd5b51dbe8f9d95a38c9b7dbf", "publicationVenue": null, "title": "Techniques for Big Data Analytics: a Systematic Survey", "abstract": ": Big data is a process which is used when the insights and meaning of stored data cannot be discovered with the existing data mining and handling techniques. The relational database engines cannot process very large datasets or an unstructured data. The relational database engines cannot process very large datasets or an unstructured data. This large size of data needs a distinguished way of processing approach which is called big data. Big data applies parallelism on the available hardware devices. Frequent changes on things make frequent changes on captured and recorded data. Specifically, the data creation, storage, retrieval and analysis is called big data, which is an enormous amount of data with respect to volume, velocity and variety. Due to the usage of devices such as mobiles, software logs, cameras, microphones and wireless sensors networks, there exist rapid growth in datasets. Hence, for efficient management and retrieval of big data, this paper investigates and examines the graph based indexing techniques for big data analysis. For storing and representing the data, a graph database is used along with the graph structures for logical requests with nodes, edges and properties. Consequently, as the datasets grow rapidly, this large set of data repositories cannot be retrieved and analyzed by using the traditional SQL model and also the relationships between the different datasets cannot be understood. In such case, the graph databases are one part of the solutions. The graph database model is obtained by extracting the relationships among different nodes or data points. It focuses in organizing and analyzing the messy data points according to the relationships, instead of looking at the value of data points. This helps in adding another layer of structuring and analyzing the data and increasing the effectiveness of big data analytics.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2105275264", "name": ".. T. Kesavan"}, {"authorId": "104843067", "name": "Dr B Santhosh Kumar Santhosh Balan"}], "citations": [{"paperId": "c2a7accd51f67141a74a24365bd8468b7e7ca149", "title": "The application of big data in the analysis of factors affecting agricultural business and product marketing in the intelligent agricultural platform"}, {"paperId": "ef71311c8737b5562d81844364b9d7a4b5b5384e", "title": "Advances in Soft Computing: 19th Mexican International Conference on Artificial Intelligence, MICAI 2020, Mexico City, Mexico, October 12–17, 2020, Proceedings, Part I"}]}
