{"paperId": "44af24431ccd6422615245cbfb33b20401596a35", "publicationVenue": null, "title": "SQL versus NoSQL databases for geospatial applications", "abstract": "In the last years, we are witnessing an increasing availability of geolocated data, ranging from satellite images to user generated content (e.g., tweets). This big amount of data is exploited by several cloud-based applications to deliver effective and customized services to end users. In order to provide a good user experience, a low-latency response time is needed, both when data are retrieved and provided. To achieve this goal, current geospatial applications need to exploit efficient and scalable geospatial databases, the choice of which has a high impact on the overall performance of the deployed applications. In this paper, we compare, from a qualitative point of view, four state-of-the-art SQL and NoSQL databases with geospatial features, and then we analyze the performances of two of them, selecting the ones based on the Database-as-a-service (DBaaS) model: Azure SQL Database and Azure DocumentDB (i.e., an SQL database versus a NoSQL one). The empirical evaluation shows pros and cons of both solutions and it is performed on a real use case related to an emergency management application.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "3388-3397"}, "authors": [{"authorId": "2292282200", "name": "Elena Baralis"}, {"authorId": "2292140223", "name": "Andrea Dalla Valle"}, {"authorId": "1712027", "name": "P. Garza"}, {"authorId": "2285986991", "name": "Claudio Rossi"}, {"authorId": "9110562", "name": "F. Scullino"}], "citations": [{"paperId": "fd34804305c7da3045e140141f4d4da3fe73e02c", "title": "Concept of Server-side Clusterization of Semi-Static Big Geodata for Web Maps"}, {"paperId": "052f440686ec0bd4535d536dae559003711a33a3", "title": "GeoYCSB: A Benchmark Framework for the Performance and Scalability Evaluation of Geospatial NoSQL Databases"}, {"paperId": "8e1aa71801f9fa551faf2b47eeec2575a2569342", "title": "ORGANIZING SMART CITY DATA BASED ON 3D POINT CLOUD IN UNSTRUCTURED DATABASE – AN OVERVIEW"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "a7655a9801083b84c2d78a3b952e4acdc9bfa37a", "title": "Hybrid storage engine for geospatial data using NoSQL and SQL paradigms"}, {"paperId": "782fb765ee18108b3da4c8b672a62febc1f3edc6", "title": "A Review of Spatial Big Data Platforms, Opportunities, and Challenges"}, {"paperId": "87dc61d3a9bda20a5470b99d1cf21953f7346ac5", "title": "State-of-the-Art Geospatial Information Processing in NoSQL Databases"}, {"paperId": "9d0969afc4b6ac79091c65a95c93e6e4bfd43c75", "title": "Modeling and presenting incomplete and uncertain data on historical settlement units"}, {"paperId": "b9f4c32e65d071bcd1a695ba549de974f987a0e3", "title": "Geodesign Process Analytics: Focus on Design as a Process and Its Outcomes"}, {"paperId": "f116c5eacf6c743145722d820fd387fd72e89f87", "title": "GeoYCSB: A Benchmark Framework for the Performance and Scalability Evaluation of NoSQL Databases for Geospatial Workloads"}, {"paperId": "657c4e30d07cb97eb7a2f94f6a1d804cea28b627", "title": "Analysis of performance of selected geospatial analyses implemented on the basis of relational and NoSQL databases"}, {"paperId": "03bfd6d1c110701a0e0a398116efa0b22485d8e2", "title": "Assessing NoSql Approaches for Spatial Big Data Management"}, {"paperId": "166d41c1bc10ce5f16154c0dae6d4694076d6003", "title": "Spatial querying of mineral resources using PostGIS"}, {"paperId": "eacc1f6b5b7dc9f127e0edd38f9e8a0bc5011bf6", "title": "Privacy-Preserving Frequent Pattern Mining from Big Uncertain Data"}, {"paperId": "908bb8aa2e5123e06fcca7e5d9fdf545127b3abc", "title": "Database management system performance comparisons: A systematic survey"}, {"paperId": "24fb6845be71b9f4d37b574670b15b64ef638ff6", "title": "Chapter Two - Bivariate, cluster, and suitability analysis of NoSQL solutions for big graph applications"}, {"paperId": "de24175be124917336f198c645a46d02223b52a4", "title": "Benchmarking Scalability of NoSQL Databases for Geospatial Queries"}]}
