{"paperId": "44d742d9de35b39378c0645c3569e50121ae370e", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "BisDeNet: A New Lightweight Deep Learning-Based Framework for Efficient Landslide Detection", "abstract": "Landslides are catastrophic geological events that can cause significant damage to properties and result in the loss of human lives. Deep-learning technology applied to optical remote sensing images can enable effective landslide-prone area detection. However, conventional landslide detection (LD) models often employ complex structural designs to ensure detection accuracy. The complexity often hampers the detection speed, rendering these models inadequate for the swift emergency monitoring of landslides. To address these problems, we propose a new lightweight deep-learning-based framework, BisDeNet, for efficient LD. To improve the efficiency of the proposed BisDeNet, we replaced the context path in the original BiSeNet with DenseNet due to its strong feature extraction ability, few required parameters, and low model complexity. Two sites with different and representative landslide developments were selected as the study areas to verify the performance of our proposed BisDeNet. Additionally, we introduced landslide causative factors to enhance the sampling dataset. To evaluate the effectiveness of our approach, we compared the performance of our BisDeNet with the performances of three other BiSeNet-based methods and an advanced transformer-based model data-efficient image transformer (DeiT). Our experimental results indicate that the F1-scores of BisDeNet in the two study areas are 0.9006 and 0.8850, which are 26.22% and 1.86% higher than the scores of BiSeNet, respectively, but slightly lower than that of the DeiT model. Furthermore, our proposed BisDeNet requires the fewest number of parameters and the least memory out of the five models.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "3648-3663", "volume": "17"}, "authors": [{"authorId": "2250180570", "name": "Tao Chen"}, {"authorId": "2279017904", "name": "Xiao Gao"}, {"authorId": "2279111829", "name": "Gang Liu"}, {"authorId": "2279100182", "name": "Chen Wang"}, {"authorId": "2260916504", "name": "Zeyang Zhao"}, {"authorId": "2204069471", "name": "Jie Dou"}, {"authorId": "2267943637", "name": "Ruiqing Niu"}, {"authorId": "2278921745", "name": "Antonio Plaza"}], "citations": [{"paperId": "bb4095dc010f0d065c036ccce6811a5606771fff", "title": "Deep Learning-Based Landslide Recognition Incorporating Deformation Characteristics"}, {"paperId": "a7c82fb0091aaa4dcf898c36caafcfa4e5b77c34", "title": "LCFSTE: Landslide Conditioning Factors and Swin Transformer Ensemble for Landslide Susceptibility Assessment"}, {"paperId": "8083e919f6ba7f4372015a4194ca436fc5f670c2", "title": "Spatial–Spectral Similarity Based on Adaptive Region for Landslide Inventory Mapping With Remote-Sensed Images"}, {"paperId": "f873b23e212070f3031a28c36672616f31d6b048", "title": "SEDANet: A New Siamese Ensemble Difference Attention Network for Building Change Detection in Remotely Sensed Images"}]}
