{"paperId": "44e09d0241177797c0fdb22555e187c763e904fc", "publicationVenue": {"id": "7a4a2cd2-0615-44b1-83c3-d07ad89415b4", "name": "Journal of Crohn's & Colitis", "type": "journal", "alternate_names": ["Journal of Crohn's and Colitis", "J Crohn's  Colitis", "Journal of Crohns & Colitis", "J Crohn's Colitis", "J Crohn  Colitis"], "issn": "1873-9946", "alternate_issns": ["1197-4982"], "url": "http://www.ecco-jccjournal.org/aims", "alternate_urls": ["http://www.ecco-jccjournal.org/"]}, "title": "Machine Learning-based Prediction Models for Diagnosis and Prognosis in Inflammatory Bowel Diseases: A Systematic Review.", "abstract": "BACKGROUND AND AIMS\nThere is increasing interest in machine learning-based prediction models in inflammatory bowel diseases (IBD). We synthesized and critically appraised studies comparing machine learning vs. traditional statistical models, using routinely available clinical data for risk prediction in IBD.\n\n\nMETHODS\nThrough a systematic review till January 1, 2021, we identified cohort studies that derived and/or validated machine learning models, based on routinely collected clinical data in patients with IBD, to predict the risk of harboring or developing adverse clinical outcomes, and reported its predictive performance against a traditional statistical model for the same outcome. We appraised the risk of bias in these studies using the Prediction model Risk of Bias ASsessment (PROBAST) tool.\n\n\nRESULTS\nWe included 13 studies on machine learning-based prediction models in IBD encompassing themes of predicting treatment response to biologics and thiopurines, predicting longitudinal disease activity and complications and outcomes in patients with acute severe ulcerative colitis. The most common machine learnings models used were tree-based algorithms, which are classification approaches achieved through supervised learning. Machine learning models outperformed traditional statistical models in risk prediction. However, most models were at high risk of bias, and only one was externally validated.\n\n\nCONCLUSIONS\nMachine learning-based prediction models based on routinely collected data generally perform better than traditional statistical models in risk prediction in IBD, though frequently have high risk of bias. Future studies examining these approaches are warranted, with special focus on external validation and clinical applicability.", "venue": "Journal of Crohn's & Colitis", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-07", "journal": {"name": "Journal of Crohn's & colitis"}, "authors": [{"authorId": "32174943", "name": "N. Nguyen"}, {"authorId": "32561675", "name": "Dominic Picetti"}, {"authorId": "7911531", "name": "P. Dulai"}, {"authorId": "145600793", "name": "V. Jairath"}, {"authorId": "4349130", "name": "W. Sandborn"}, {"authorId": "1397958221", "name": "L. Ohno-Machado"}, {"authorId": "2120245652", "name": "Peter L. Chen"}, {"authorId": "40519589", "name": "Siddharth Singh"}], "citations": [{"paperId": "4f211d26c33ff65e424e222dcf786bec1eef0eaa", "title": "The development and validation of automated machine learning models for predicting lymph node metastasis in Siewert type II T1 adenocarcinoma of the esophagogastric junction"}, {"paperId": "9423dd2c9c54977045d27d14a22b4c5b230164d5", "title": "Development and validation of prognostic machine learning models for short- and long-term mortality among acutely admitted patients based on blood tests"}, {"paperId": "e30c393700295c9861773b35749df4e4928b8a57", "title": "A Preliminary Study Assessing a Transfer Learning Approach to Intestinal Image Analysis to Help Determine Treatment Response in Canine Protein-Losing Enteropathy"}, {"paperId": "c2a2b9473954a0aad49cb3acd1f581132a3e146c", "title": "Recent Trends in Non-Invasive Methods of Diagnosis and Evaluation of Inflammatory Bowel Disease: A Short Review"}, {"paperId": "2835080905d0341827dedcd78db2a0fd8423297a", "title": "Impact of artificial intelligence on prognosis, shared decision-making, and precision medicine for patients with inflammatory bowel disease: a perspective and expert opinion"}, {"paperId": "4c12e115bfd912938ec8957b869ac9f80ce6a830", "title": "The importance of predicting patient responses to monoclonal antibodies for Crohn’s disease"}, {"paperId": "1f286b779cf159cd12903faa1aabbb54ca84fdd0", "title": "Poly-omic risk scores predict inflammatory bowel disease diagnosis"}, {"paperId": "4ee1ca0f318f2e38577d7644c7f9a0739be50194", "title": "New pattern of individualized management of chronic diseases: focusing on inflammatory bowel diseases and looking to the future"}, {"paperId": "8f78daa32ffdc7226a8c888537a771236f6e6e9d", "title": "Development and validation of novel models for the prediction of intravenous corticosteroid resistance in acute severe ulcerative colitis using logistic regression and machine learning"}, {"paperId": "7e80321ffdbad16fd298859ec042ad938aef9f00", "title": "A Systematic Review of Artificial Intelligence and Machine Learning Applications to Inflammatory Bowel Disease, with Practical Guidelines for Interpretation"}]}
