{"paperId": "44e76477c547ba97ddee79101551e5a83041e1dd", "publicationVenue": null, "title": "Quantitative analysis of high‐throughput biological data", "abstract": "The study of multiple “omes,” such as the genome, transcriptome, proteome, and metabolome has become widespread in biomedical research. High‐throughput techniques enable the rapid generation of high‐dimensional multiomics data. This multiomics approach provides a more complete perspective to study biological systems compared with traditional methods. However, the quantitative analysis and integration of distinct types of high‐dimensional omics data remain a challenge. Here, we provide an up‐to‐date and comprehensive review of the methods used for omics data quantification and integration. We first review the quantitative analysis of not only bulk but also single‐cell transcriptomics data, as well as proteomics data. Current methods for reducing batch effects and integrating heterogeneous high‐dimensional data are then introduced. Network analysis on large‐scale biomedical data can capture the global properties of drugs, targets, and disease relationships, thus enabling a better understanding of biological systems. Current trends in the applications and methods used to extend quantitative omics data analysis to biological networks are also discussed.", "venue": "WIREs Computational Molecular Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-01", "journal": {"name": "Wiley Interdisciplinary Reviews: Computational Molecular Science", "volume": "13"}, "authors": [{"authorId": "143857848", "name": "Hsueh‐Fen Juan"}, {"authorId": "2115636477", "name": "Hsuan-Cheng Huang"}], "citations": [{"paperId": "7ef7538f559813c62787fb46519602e625890ce0", "title": "Postmortem Minimally Invasive Autopsy in Critically Ill COVID-19 Patients at the Bedside: A Proof-of-Concept Study at the ICU"}, {"paperId": "6b235ab8759c4a6245a3d71174bc31f256050608", "title": "Combination of multiple omics techniques for a personalized therapy or treatment selection"}]}
