{"paperId": "44ef57d6e78e295557bf4bc6113ca0a786354ac1", "publicationVenue": null, "title": "Integration of Industry 4.0 technologies into Total Productive Maintenance practices", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-10-01", "journal": {"name": "International Journal of Production Economics", "pages": "108224", "volume": "240"}, "authors": [{"authorId": "36435137", "name": "G. Tortorella"}, {"authorId": "31365704", "name": "F. S. Fogliatto"}, {"authorId": "1401908230", "name": "P. Cauchick-Miguel"}, {"authorId": "145168914", "name": "S. Kurnia"}, {"authorId": "66803230", "name": "D. Jurburg"}], "citations": [{"paperId": "4a787455c07e26bd9f6cf3c2b74351ec4feffcdd", "title": "Evaluation of the State of Innovative Activity of Machine-Building Enterprise"}, {"paperId": "d9340a5c82d58a35c83248d1d1f819107e89e79f", "title": "Improvement of Industrial Maintenance Plans through Assistance-Driven Reliability-Centered Maintenance and Case-Based Reasoning Design"}, {"paperId": "23e91814b138e03e857d58e38362169015ca1d6c", "title": "Design and analysis of battery management system in electric vehicle"}, {"paperId": "9a88818d949ad0b3452b469c397bc3d93b62468f", "title": "Integration of Industry 4.0 to the CBM practices of the O&G upstream sector in Nigeria"}, {"paperId": "540e5b68420a4fb2fdb47410895c6339bd086beb", "title": "Overcoming strategies for supply chain digitization barriers: Implications for sustainable development goals"}, {"paperId": "cf6be32b175b4e70db28410f32276c2c2250092b", "title": "Digital Outcome Optimization: Ensuring a Return on Investment From Digital Strategy"}, {"paperId": "941cddcefcb2bb44d4902296805106aab8e317f8", "title": "A Sustainable Innovation Framework Based on Lean Six Sigma and Industry 5.0"}, {"paperId": "2ec99b3c5482150a76dcc3239d7ae931e6d58d96", "title": "An analysis of the strategies for overcoming digital supply chain implementation barriers"}, {"paperId": "b4e689bcb3cce84ffefb4224868b39225af2bc4e", "title": "A solution approach proposal with a lean perspective for the poultry sector with WRM and BWM integration"}, {"paperId": "16a2dd3621cb29ee019694998c7b634be299ec37", "title": "Digital enabled agility: Industry 4.0 unlocking real-time information processing, traceability, and visibility to unleash the next extent of agility"}, {"paperId": "d69868237cc1b843820068f497d34ff4ae1b1bdc", "title": "Modern approach to sustainable production in the context of Industry 4.0"}, {"paperId": "428b25f70c13f086ccab3763e7494e1bac094ea6", "title": "A Low-Cost Microcontroller-Based Normal and Abnormal Conditions Classification Model for Induction Motors Using Self-Organizing Feature Maps (SOFM)"}, {"paperId": "37d91d16838eef23cf1db42c043a8711e1dda8da", "title": "Extended reality-based choice experiment to assess the impact of offshore wind turbines in historic center: The case of Manfredonia."}, {"paperId": "29d30f8556e3c6a9a6bbd4e72c2e6b06e230fbd8", "title": "Methodological concerns in case-based research in industrial engineering: revisiting the challenges towards further recommendations"}, {"paperId": "d63d9bb7b3823f7737e1c06071fba0e66c2eb5b5", "title": "Building a competent workforce in implementing Quality 4.0: a systematic literature review and proposed agenda for future research"}, {"paperId": "a2701f351159b6fc9cdd9d0a35366d18749a4d2f", "title": "Special Issue “Digital and Sustainable Manufacturing in Industry 4.0”"}, {"paperId": "fce381e7355e5c06e27e056bda797df8ec4966c7", "title": "How good must failure predictions be to make local spare parts stock superfluous?"}, {"paperId": "19374843fac65243cc4ee05bce2bf7c381ebdc66", "title": "Lean Six Sigma 4.0 – a framework and review for Lean Six Sigma practices in the digital era"}, {"paperId": "ef657242655648fccff401f0d600638bb5afd6a6", "title": "Industry 4.0 technologies integration with lean production tools: a review"}, {"paperId": "43fb1a0d1974f378ff88450c2b74359ff8cda8f5", "title": "A Review of Sustainable Total Productive Maintenance (STPM)"}, {"paperId": "3eb63f88fef7ee4bbc44d0e0caa83631c03b7a43", "title": "The role of technological innovation in responding to environmental concerns"}, {"paperId": "40083627cce1303184af03f3a636c125259db17b", "title": "How has social media been affecting problem-solving in organizations undergoing Lean Production implementation? A multi-case study"}, {"paperId": "7b7bf4de6f90b39dc8cc3a9c5cd65b72453eea2a", "title": "Integration of Industry 4.0 into Lean production systems: A systematic literature review"}, {"paperId": "b3b596ab88a0d40ad955a8a2fd64141ad0e984b8", "title": "Total productive maintenance and sustainability performance: resource-based view perspective"}, {"paperId": "6b500b50bb17002a4a3bfc0d3edc2e9dbd71a668", "title": "Development and validation of TPM implementation practices in industries: investigation from indian SMEs"}, {"paperId": "167300d3c377ef77c512693d16fd39f21d9791d8", "title": "Lean Six Sigma and Industry 4.0 – a bibliometric analysis and conceptual framework development for future research agenda"}, {"paperId": "07e9ae35b9b72f73112f057f074dc1b04d0cef3a", "title": "Investigating the Readiness Factors for Industry 4.0 Implementation for Manufacturing Industry in Egypt"}, {"paperId": "acb21a1e9adb97dc38e072381183755ba7185506", "title": "Technological innovation-enabling industry 4.0 paradigm: A systematic literature review"}, {"paperId": "449a71ff3b2dfb8815d5b82ecc989d1249de2513", "title": "Envisioning maintenance 5.0: Insights from a systematic literature review of Industry 4.0 and a proposed framework"}, {"paperId": "614e2ad9f8388239fa9aea963a757d285ac5c711", "title": "A Realistic Framework to Assess the Barriers to SCM 4.0 in the Foundry Industry"}, {"paperId": "dbfb440bcb50294f73a175d13ae314fead11e26f", "title": "Maintenance work management process model: incorporating system dynamics and 4IR technologies"}, {"paperId": "34c8287d0da660a2d654dade537dfe3ff6f048d9", "title": "Análisis bibliométrico del impacto del Lean Maintenance en la Gestión de las Empresas"}, {"paperId": "3de2c7d54b041214cf9b5bce6504544a339c0b0b", "title": "Investigating the influence of total productive maintenance key success factors on the social sustainability dimension of manufacturing SMEs"}, {"paperId": "b52a1f5a2d407ef789ba4610edfec4aceaf4eaa7", "title": "Drivers and barriers for the traceability digitalisation in the Australian construction supply chain"}, {"paperId": "64a5cb0f898ac23d0f310961136904e6e5b8d8bc", "title": "Lean Industry 4.0: Past, present, and future"}, {"paperId": "736202827d8601af1cbf0a46373b72f58c5243fd", "title": "Maintenance 4.0: implementation challenges and its analysis"}, {"paperId": "976df5dc527c8d3ca8be705a733afca73f6fcd15", "title": "Adoption patterns and performance implications of Smart Maintenance"}, {"paperId": "67a7b5581a1d4fadcb5f3ff6f74fed85c5e5a415", "title": "The interplay between data-driven decision-making and digitalization: A firm-level survey of the Italian and U.S. automotive industries"}, {"paperId": "1049727cc68dc04734aa8fece7716d07081a7f85", "title": "Total productive maintenance and Industry 4.0 in a sustainability context: exploring the mediating effect of circular economy"}, {"paperId": "aacea94a5b6c328d9bc4456695720df9232e474e", "title": "Myths and Facts of Industry 4.0"}, {"paperId": "3b43552b4dc34323a9dbdeb6528b3afc61b7e87c", "title": "Data pooling for multiple single-component systems under population heterogeneity"}, {"paperId": "7b552b2792b8823ea4c7a8ba1e1330bc647a7232", "title": "Underpinning success factors of maintenance digital transformation: A hybrid reactive Delphi approach"}, {"paperId": "161ae7e60a007ea66c45faecd275fef3130c3e58", "title": "Remote Technologies as Common Practice in Industrial Maintenance: What Do Experts Say?"}, {"paperId": "d8d888c20d55f5cc0b28c4f333a55acaa602c59d", "title": "Axiomatic design for lean autonomous maintenance system: an application from textile industry"}, {"paperId": "65bad7be183e57576b0d26ebd5b051317a51d14a", "title": "Motor Bearings Fault Classification using CatBoost Classifier"}, {"paperId": "3a48654dd4152602395f2c0032c47166c28fb379", "title": "Systems-based approach to contemporary business management: An enabler of business sustainability in a context of industry 4.0, circular economy, competitiveness and diverse stakeholders"}, {"paperId": "fb9dd1c1bea395f55c730e5fb3cbcc913d999a85", "title": "Integrating Industry 4.0 and Total Productive Maintenance for global sustainability"}, {"paperId": "72a519a3f9a05dd8b57c1de906f43b6a991d6a4e", "title": "Mediating effect of industry 4.0 technologies on the supply chain management practices and supply chain performance."}, {"paperId": "dea0e8aaee82c2a7cb50b3fb47fd1469e36a78c5", "title": "UAV and IoT-Based Systems for the Monitoring of Industrial Facilities Using Digital Twins: Methodology, Reliability Models, and Application"}, {"paperId": "36d74924a5f41692747c0bb929c6ba1cff0f3ed8", "title": "Digitalisation of manufacturing operations: The influential role of organisational, social, environmental, and technological impediments"}, {"paperId": "120eef73abc5fb70a187ee7baa72b573ea84dee2", "title": "Teaching and learning of industry 4.0: expectations, drivers, and barriers from a knowledge management perspective"}, {"paperId": "6c482ee8004f95ce990eed98b4253bce5de9a74e", "title": "Digitalization of maintenance: exploratory study on the adoption of Industry 4.0 technologies and total productive maintenance practices"}, {"paperId": "5a088ce60dd7f97e86a6d7d5f815029b82ffe01f", "title": "A Comparison of Machine Learning Methods for the Diagnosis of Motor Faults Using Automated Spectral Feature Extraction Technique"}, {"paperId": "804705c2c59fb0ee5f118995539df5e7b2a093f1", "title": "Condition monitoring of water pump bearings using ensemble classifier"}, {"paperId": "8595d379fd63d4ee02da64529b4982ea3f0c0e78", "title": "Integration of Improvement Strategies and Industry 4.0 Technologies in a Dynamic Evaluation Model for Target-Oriented Optimization"}, {"paperId": "1ca1b174f00cd85b454dc9dc2be03c58a929921b", "title": "The impact of Industry 4.0 on the relationship between TPM and maintenance performance"}, {"paperId": "6775ae3c3cedc7e06bda8ff129f35dff2a25fd87", "title": "Production and maintenance in industries: impact of industry 4.0"}, {"paperId": "e67aac6acb3f020750e5ee201aa1a22d7b27ce6f", "title": "Sustainability Through Cognition Aware Safety Systems - Next Level Human-Machine-Interaction"}, {"paperId": "2c85361e3a6649ab5e0df82a800477aa0d86e1ea", "title": "Application of machine learning and rough set theory in lean maintenance decision support system development"}, {"paperId": "f830b3755915a9361f58f6f278d7e183a7f61fd1", "title": "Venture capital and Industry 4.0: The\n G7\n 's versus\n BRICS\n ' experience"}, {"paperId": "0448cb5939b530c511eae62029072792252eca9c", "title": "A 4th Industrial Revolution Systems Approach for Human Resource Optimization in Maintenance"}, {"paperId": "8a9297519068f0bf4fdfca57d5c58205d6b6ee6d", "title": "Development of an agile model using total productive maintenance to enhance industrial sustainability in industry 4.0"}, {"paperId": "82fff53ab5f627a7615f70cd97691dc3fecd83a2", "title": "Lean-TPM based production model to increase the efficiency of the finishing process in textile companies"}, {"paperId": "b1e87d726cfa9080226a783c615a1f3f4a54f495", "title": "Designing Lean Maintenance Using Total Productive Maintenance Method – A Case Study at Wiring Harness Production"}, {"paperId": "f17689c2371279185198e330e1632861b91a8c9a", "title": "Assessing the Barriers to Industry 4.0 Implementation From a Maintenance Management Perspective - Pilot Study Results"}, {"paperId": "05750b32122571218a08130dacd0d65f18bcf079", "title": "Improving the overall equipment effectiveness (OEE) on the chicken bowl printing machine by using the theory of change perspective"}, {"paperId": "6b9dc25cc399fe31c66756c28abdb87f4a2709c0", "title": "A Survey of the Underlying Success Factors of Maintenance Digital Transformation"}, {"paperId": "9ab5d5b22eeee30129b487ac79ba90629ae231c9", "title": "Modeling: Integration of Lean and Technologies of Industry 4.0 for Enterprise Performance"}, {"paperId": "3436c5218793f83d039484c5226d64e12211262f", "title": "Employee Participation in Total Productive Maintenance - a Bottom-Up Perspective"}]}
