{"paperId": "44ffd3a185fcd4c918f2ee27416097624c5e5270", "publicationVenue": null, "title": "Research and Development of Enterprise Data Warehouse Based on SAP BW Modeling", "abstract": "The data warehouse is based on the development of relational databases, parallel processing and distributed processing technologies, as well as online analytical processing technologies. SAP BW is widely used in many enterprise data warehouses. It can issue reports of enterprises at the group level, manage the group's business operations, help find the laws and trends behind the performance of corporations and ultimately provide decision-making support for decision makers of enterprises. Therefore, how to use the SAP BW model architecture to better realize enterprise data warehouses is one of the hot topics in the data warehouse industry today. For a large corporation, its branches and subsidiaries have deployed multiple sets of enterprise data warehouses. At the same time, because there are multiple sets of data warehouse systems, when the data model needs to be modified at the group level, the data model of the branch also needs to be modified accordingly, and the flexibility of maintenance is poor. Finally, every time the corporation needs to upgrade the version of the data warehouse, it needs to maintain and upgrade the version of the data warehouse of each branch and the maintenance cost is high. Therefore, how to integrate multiple sets of data warehouses distributed in various subsidiaries into a corporation enterprise data warehouse by designing the model hierarchy, so as to ensure the reliability of data, enhance the flexibility of model modification and reduce the cost of data warehouse. This paper completes the design of an enterprise data warehouse of a large corporation, which can be used for the summary and collation of data from multiple branches such as finance and sales of a corporation, effectively improving the efficiency of data utilization and ensuring the authenticity of data. At the same time, through hierarchical design, the problems of poor flexibility in model modification and high system maintenance costs are solved.", "venue": "2023 IEEE International Conference on Smart Information Systems and Technologies (SIST)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-04", "journal": {"name": "2023 IEEE International Conference on Smart Information Systems and Technologies (SIST)", "pages": "5-9"}, "authors": [{"authorId": "2235609742", "name": "G. Turken"}, {"authorId": "9343445", "name": "L. Naizabayeva"}, {"authorId": "40858753", "name": "M. Satymbekov"}, {"authorId": "74810309", "name": "Z. Abdiakhmetova"}], "citations": []}
