{"paperId": "45087e65d7ed39b8b271be5afc995dcae0bb2eaa", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Generating Datasets for Anomaly-Based Intrusion Detection Systems in IoT and Industrial IoT Networks", "abstract": "Over the past few years, we have witnessed the emergence of Internet of Things (IoT) and Industrial IoT networks that bring significant benefits to citizens, society, and industry. However, their heterogeneous and resource-constrained nature makes them vulnerable to a wide range of threats. Therefore, there is an urgent need for novel security mechanisms such as accurate and efficient anomaly-based intrusion detection systems (AIDSs) to be developed before these networks reach their full potential. Nevertheless, there is a lack of up-to-date, representative, and well-structured IoT/IIoT-specific datasets which are publicly available and constitute benchmark datasets for training and evaluating machine learning models used in AIDSs for IoT/IIoT networks. Contribution to filling this research gap is the main target of our recent research work and thus, we focus on the generation of new labelled IoT/IIoT-specific datasets by utilising the Cooja simulator. To the best of our knowledge, this is the first time that the Cooja simulator is used, in a systematic way, to generate comprehensive IoT/IIoT datasets. In this paper, we present the approach that we followed to generate an initial set of benign and malicious IoT/IIoT datasets. The generated IIoT-specific information was captured from the Contiki plugin “powertrace” and the Cooja tool “Radio messages”.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "101463968", "name": "Ismael Essop"}, {"authorId": "2073117316", "name": "J. Ribeiro"}, {"authorId": "153227288", "name": "M. Papaioannou"}, {"authorId": "144084756", "name": "G. Zachos"}, {"authorId": "1947016", "name": "G. Mantas"}, {"authorId": "145108890", "name": "Jonathan Rodriguez"}], "citations": [{"paperId": "000e7187390d4764fced2462f925ca06e3cf9477", "title": "A Deep-Learning-Integrated Blockchain Framework for Securing Industrial IoT"}, {"paperId": "f7a99782b3006467dae753a40a5a4d9bd1bbd392", "title": "Prototyping a Hyperledger Fabric-Based Security Architecture for IoMT-Based Health Monitoring Systems"}, {"paperId": "98a9bdbd957de6985aa18de69a6b2df084b976a9", "title": "Anomaly-based Intrusion Detection System for ICS"}, {"paperId": "2bca79782b6297437d6f72cc3b5237a00614347d", "title": "An IoT/IoMT Security Testbed for Anomaly-based Intrusion Detection Systems"}, {"paperId": "ef1d51619898345a2910a146fdddb7c25c30e670", "title": "Behavioral Biometrics for Mobile User Authentication: Benefits and Limitations"}, {"paperId": "5e65261aaed8e77e65915d676a94e332802703b7", "title": "A new Intrusion Detection System for Secured IoT/IIoT Networks based on LGBM"}, {"paperId": "915b780217a1c3f06f8b9f62fbf24eb475a93e99", "title": "Novelty Detection for Risk-based User Authentication on Mobile Devices"}, {"paperId": "1324e4c5ac1fd6f58ab8369f71503d54064fb1e2", "title": "A generation of dataset towards an Anomaly-Based Intrusion Detection System to detect Denial of Sleep Attacks in Internet of Things (IoT)"}, {"paperId": "827dbd78bdae6b957c088046481f40de0fdc32af", "title": "Risk Estimation for a Secure & Usable User Authentication Mechanism for Mobile Passenger ID Devices"}, {"paperId": "7a72acccc24a0ed14df6cb1a3539760ea85af16f", "title": "Generating Datasets Based on the HuMIdb Dataset for Risk-based User Authentication on Smartphones"}, {"paperId": "a41f50150c4fdfff53704884d08962f612a6eff4", "title": "A Scalable Approach of Practical Byzantine Fault Tolerance Algorithms for IoMT Blockchains"}, {"paperId": "d08e6624cd491bb79a0d9e2d12367699f590984e", "title": "Dew-Cloud-Based Hierarchical Federated Learning for Intrusion Detection in IoMT"}, {"paperId": "081c42365be370de7191bd9bc8e5824d11ab20f9", "title": "A Systematic Literature Review on Machine and Deep Learning Approaches for Detecting Attacks in RPL-Based 6LoWPAN of Internet of Things"}, {"paperId": "4c054acb45688c7439335039434c12c18649d6de", "title": "Anomalous behavior detection-based approach for authenticating smart home system users"}, {"paperId": "2852fe41aa13a965eec571bd35b15557de1db2a0", "title": "An Anomaly-Based Intrusion Detection System for Internet of Medical Things Networks"}, {"paperId": "47e1e601b1e34ec4cdd018f925c282181eafbeb2", "title": "Generating IoT Edge Network Datasets based on the TON_IoT Telemetry Dataset"}, {"paperId": "b6c31def07657e96292296567c18f0524f58a630", "title": "A Key Management Framework to Secure IoMT-enabled Healthcare Systems"}, {"paperId": "133c05ea75614892f3f22f921fae05d77d978b32", "title": "Risk-Based User Authentication for Mobile Passenger ID Devices for Land and Sea Border Control"}, {"paperId": "89cc9c58d8f24974ed26806959714133d5ec735d", "title": "A Hyperledger Fabric-based Blockchain Architecture to Secure IoT-based Health Monitoring Systems"}, {"paperId": "1f28a7244bd3815cd9dc5b14017bb35436b421b4", "title": "Multi-Trace: Multi-level Data Trace Generation with the Cooja Simulator"}, {"paperId": "e8790b12f5981b7e908a57d24c2563d54340ba0b", "title": "A holistic framework for prediction of routing attacks in IoT-LLNs"}, {"paperId": "696c69a8765e900e25576b9b3c2400a4a27de909", "title": "IGWO-SoE: Improved Grey Wolf Optimization Based Stack of Ensemble Learning Algorithm for Anomaly Detection in Internet of Things Edge Computing"}, {"paperId": "4c07cf52156a40f6837733f2d0ca0c6dd0258383", "title": "Cyber-Attack Detection and Mitigation Using SVM for 5G Network"}, {"paperId": "1bf16313fc4f5bd95a94ab4527639a93281225dc", "title": "Toward a Secure and Usable User Authentication Mechanism for Mobile Passenger ID Devices for Land/Sea Border Control"}, {"paperId": "4120d160bf2900d7ffb6cbe0a5b8399ef1183de4", "title": "Advances in Engineering and Technology An"}, {"paperId": "b1ceb925c541749956afd3e69272a1a070925a0a", "title": "Generating IoT Specific Anomaly Datasets Using Cooja Simulator (Contiki-OS) and Performance Evaluation of Deep Learning Model Coupled with Aquila Optimizer"}]}
