{"paperId": "4521dc811ae0efec916fd8b2546e445307c6aee4", "publicationVenue": {"id": "9012153e-aed6-447e-bccf-4aaf6f4bf52f", "name": "IEEE International Conference on Consumer Electronics", "type": "conference", "alternate_names": ["ICCE", "Int Conf Comput Educ", "IEEE International Conference on Computational Electromagnetics", "IEEE International Conference on Cloud Engineering", "IEEE Int Conf Cloud Eng", "IEEE Int Conf Comput Electromagn", "International Conference on Computers in Education", "IEEE Int Conf Consum Electron"], "url": "http://www.apsce.net/"}, "title": "Exploration of Fault Identification and Automatic Recovery in Cloud-based FPGA Systems", "abstract": "Field-Programmable Gate Arrays (FPGAs) are increasingly used for data center hardware acceleration in cloud environments. However, their widespread adoption poses challenges in resource management, programming complexity, security, performance optimization, and scalability. This paper focuses on automatic failure identification and recovery in cloud-based FPGA systems. Monitoring is vital for capacity management, resource allocation, Quality of Service (QoS) management, and troubleshooting. While monitoring methods have been proposed for ensuring QoS, automatic recovery remains a significant hurdle. This paper proposes an event-driven monitoring rule inference method using case-based reasoning and correlation analysis for autonomous recovery, ensuring Service Level Objectives (SLO) and Service Level Indicators (SLI) in cloud-based FPGA systems. The approach aims to enhance the reliability and availability of cloud services. Future work includes standardizing error information and collection methods for FPGA systems and promoting public knowledge databases for recovery methods. Additionally, improving FPGA application reliability through strategic recovery sequences and redundant computation confirmation is crucial for critical applications.", "venue": "IEEE International Conference on Consumer Electronics", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-06", "journal": {"name": "2024 IEEE International Conference on Consumer Electronics (ICCE)", "pages": "1-6"}, "authors": [{"authorId": "2287974976", "name": "Satoshi Konno"}, {"authorId": "2287978882", "name": "Inoguchi Yasushi"}], "citations": []}
