{"paperId": "452bd537dc165e755e79252c7589d460457eeabf", "publicationVenue": {"id": "22d1db70-9ab0-44a4-ab3c-72560c6d550d", "name": "Digital Twin", "alternate_names": ["Digit Twin"], "issn": "2752-5783"}, "title": "Digital twin and its applications in the construction industry: A state-of-art systematic review", "abstract": "The construction industry has a great impact on social and economic development because of its wide coverage and a large number of stakeholders involved. It is precisely owing to its large volume that technological innovation of the construction industry is relatively slow. The birth and rapid development of digital twins brings more hope to the construction industry. This paper summarizes the current development of digital twin and its applications in construction industry. First, the concepts and applications of digital twin are analyzed. Then, the research on digital twins in the construction industry in the past five years is reviewed. The main research directions and key technologies are pointed out in the end. This paper could guide related practitioners to clearly grasp the research application status of digital twin in the construction industry. It could also help to find suitable research directions.", "venue": "Digital Twin", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-12", "journal": {"name": "Digital Twin"}, "authors": [{"authorId": "1720804950", "name": "Shuaiming Su"}, {"authorId": "2937841", "name": "R. Zhong"}, {"authorId": "2146417668", "name": "Yishuo Jiang"}], "citations": [{"paperId": "81ecec6dd9c68c5f9a5881f01ffc6c24281aafac", "title": "AIoT-enabled digital twin system for smart tunnel fire safety management"}, {"paperId": "032facb791ee93f777dc18d340d658eddf9561a0", "title": "Trading building demolition waste via digital twins"}, {"paperId": "b031c283420464d0983e3e3ce86af1c677087b08", "title": "Digital Twin-Enabled Two-Stage Optimization Model for Logistics-Assembly Synchronization in Fit-Out Construction"}, {"paperId": "3cb2e401d5d2767b7ce2a4339916f50885c07c86", "title": "Digital Twin-Enabled Building Demolition Waste Trading Workflow"}, {"paperId": "a24fef150fe509f8b40316dc8d6b24f5ee2b935a", "title": "Digital Twin-Enabled Two-Stage Optimization Model for Logistics-Assembly Synchronization in Fit-Out Construction"}, {"paperId": "83008aa18821ce716545b540e0061c5a5ea19ee8", "title": "Multi-domain ubiquitous digital twin model for information management of complex infrastructure systems"}]}
