{"paperId": "4533045a6e550796638c0d2d8b51237d0a2a45c5", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "MEGA Evolving Graph Accelerator", "abstract": "Graph Processing is an emerging workload for applications working with unstructured data, such as social network analysis, transportation networks, bioinformatics and operations research. We examine the problem of graph analytics over evolving graphs, which are graphs that change over time. The problem is challenging because it requires evaluation of a graph query on a sequence of graph snapshots over a time window, typically to track the progression of a property over time. In this paper, we introduce MEGA, a hardware accelerator designed for efficiently evaluating queries over evolving graphs. MEGA leverages CommonGraph, a recently proposed software approach for incrementally processing evolving graphs that gains efficiency by avoiding the need to process expensive deletions by converting them into additions. MEGA supports incremental event-based streaming of edge additions as well as execution of multiple snapshots concurrently to support evolving graphs. We propose Batch-Oriented-Execution (BOE), a novel batch-update scheduling technique that activates snapshots that share batches simultaneously to achieve both computation and data reuse. We introduce optimizations that pack compatible batches together, and pipeline batch processing. To the best of our knowledge, MEGA is the first graph accelerator for evolving graphs that evaluates graph queries over multiple snapshots simultaneously. MEGA achieves 24×-120× speedup over CommonGraph. It also achieves speedups ranging from 4.08× to 5.98× over JetStream, a state-of-the-art streaming graph accelerator.CCS CONCEPTS• Computer systems organization → Data flow architectures.", "venue": "Micro", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-10-28", "journal": {"name": "2023 56th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "310-323"}, "authors": [{"authorId": "2087016541", "name": "Chao Gao"}, {"authorId": "2127126628", "name": "Mahbod Afarin"}, {"authorId": "2111987466", "name": "Shafiur Rahman"}, {"authorId": "2113900189", "name": "Nael B. Abu-Ghazaleh"}, {"authorId": "2110341594", "name": "Rajiv Gupta"}], "citations": [{"paperId": "096819782ce34058faa7ad3d81c9b3d49a5cf527", "title": "Core Graph: Exploiting Edge Centrality to Speedup the Evaluation of Iterative Graph Queries"}]}
