{"paperId": "4537054ba78e048459249d9e772992c9681a8563", "publicationVenue": {"id": "2b3aa273-d994-4f8f-a44b-310f1a8f9a1c", "name": "International Journal of Data and Network Science", "type": "journal", "alternate_names": ["Int J Data Netw Sci"], "issn": "2561-8148", "url": "http://growingscience.com/ijds/ijds.html"}, "title": "The impacts of task technology fit, transparency, and supply chain agility on the blockchain adoption by SMEs in Jordan", "abstract": "This study aims to find out how much the ways that blockchain technology helps in different parts of the supply chain affect how SMEs use blockchain technology. Moreover, the research examines the correlation between blockchain use and overall performance. The data was obtained from the SMEs' owners and managers, who have the authority to implement blockchain technology. Two follow-up phone calls yielded 145 usable replies from 500 prospective respondents, for a response rate of 29%, which was analysed employing structural equation modelling (SEM). The results demonstrated that the contributions of blockchain adoption to task technology fit, task characteristics, technology characteristics, operational supply chain transparency, and supply chain agility influenced the acceptance intentions of SME managers and that there is a significant positive correlation between blockchain adoption and overall performance. The results aid vendors and policymakers in formulating strategies and effective plans to accelerate blockchain adoption by SMEs. Furthermore, the findings provide owners/managers of SMEs with reason to believe that blockchain technology might be a source of competitive advantage.", "venue": "International Journal of Data and Network Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Data and Network Science"}, "authors": [{"authorId": "84561649", "name": "M. Almasarweh"}, {"authorId": "2221518291", "name": "Zaid Jawasreh"}, {"authorId": "2113423283", "name": "Y. Alghasawneh"}, {"authorId": "2221518293", "name": "Mohammed Al Matalka"}, {"authorId": "1412856103", "name": "M. Alshuaibi"}, {"authorId": "2211655691", "name": "N. Kalbouneh"}, {"authorId": "83795591", "name": "M. Zoubi"}], "citations": []}
