{"paperId": "45473b2b9b4c4113839abc9aed799e136dd00c9f", "publicationVenue": {"id": "30cbfe87-baca-4d73-90e6-6d6584486a78", "name": "International Journal of Reconfigurable and Embedded Systems (IJRES)", "type": "journal", "alternate_names": ["Int J Reconfigurable Embed Syst (IJRES"], "issn": "2089-4864", "url": "http://ijres.iaescore.com/index.php/IJRES"}, "title": "Empirical analysis of power side-channel leakage of high-level synthesis designed AES circuits", "abstract": "Many internet of things (IoT) devices and integrated circuit (IC) cards have been compromised by side-channel attacks. Power-analysis attacks, which identify the secret key of a cryptographic circuit by analyzing the power traces, are among the most dangerous side-channel attacks. Gen-erally, there is a trade-off between execution time and circuit area. However, the correlation between security and performance has yet to be determined. In this study, we investigate the cor-relation between side-channel attack resistance and performance (execution time and circuit area) of advanced encryption standard (AES) circuits. Eleven AES circuits with different performances are designed by high-level synthesis and logic synthesis. Of the eleven AES circuits, six are circuits with no side-channel attack countermeasures and five are circuits with masking countermeasures. We employ four metrics based on a T-test to evaluate the side-channel attack resistance. The results based on the correlation coefficient show the correlation between side-channel attack resistance and performance. The correlation varies according to four metrics or masking countermeasure. We argue that designers should change their attitudes towards circuit design when considering security.", "venue": "International Journal of Reconfigurable and Embedded Systems (IJRES)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "International Journal of Reconfigurable and Embedded Systems (IJRES)"}, "authors": [{"authorId": "2142289862", "name": "Takumi Mizuno"}, {"authorId": "1944817137", "name": "Hiroki Nishikawa"}, {"authorId": "49623991", "name": "Xiangbo Kong"}, {"authorId": "2059442942", "name": "Hiroyuki Tomiyama"}], "citations": [{"paperId": "8b0d8892757aef64110eb6d0b27b922d4fca7aba", "title": "Development of the automated decision-making system synthesis method in the management of information security channels"}]}
