{"paperId": "454b7a0806de86a95a7b7df8ed3f196aff66532d", "publicationVenue": {"id": "2b218edb-a8e3-4776-9505-28129095ff02", "name": "International Conference on Advances in Computing and Communication Engineering", "type": "conference", "alternate_names": ["ACCE", "Int Conf Adv Comput Commun Eng"]}, "title": "Machine Learning Techniques in ADAS: A Review", "abstract": "What machine learning (ML) technique is used for system intelligence implementation in ADAS (advanced driving assistance system)? This paper tries to answer this question. This paper analyzes ADAS and ML independently and then relate which ML technique is applicable to what ADAS component and why. The paper gives a good grasp of the current state-of-the-art. Sample works in supervised, unsupervised, deep and reinforcement learnings are presented; their strengths and rooms for improvements are also discussed. This forms part of the basics in understanding autonomous vehicle. This work is a contribution to the ongoing research in ML aimed at reducing road traffic accidents and fatalities, and the invocation of safe driving.", "venue": "International Conference on Advances in Computing and Communication Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-06-01", "journal": {"name": "2018 International Conference on Advances in Computing and Communication Engineering (ICACCE)", "pages": "235-242"}, "authors": [{"authorId": "51232340", "name": "A. Moujahid"}, {"authorId": "1410708428", "name": "Mounir ElAraki Tantaoui"}, {"authorId": "2660452", "name": "M. D. Hina"}, {"authorId": "2738020", "name": "Assia Soukane"}, {"authorId": "51227380", "name": "A. Ortalda"}, {"authorId": "1414342138", "name": "A. Elkhadimi"}, {"authorId": "1398535855", "name": "A. Ramdane-Cherif"}], "citations": [{"paperId": "9c01cf984279a848f02cf4f1915203830018b5b8", "title": "The Calibration of Single Beam Distance Sensors based on Machine Learning Methods"}, {"paperId": "77d1289223d6b90ba7d5385f9a834f47a691cf17", "title": "Monocular Vision-Based Vehicle Distance Prediction utilizing Number Plate"}, {"paperId": "62b0ed216bfa164e1c81433b0109e44a8a2ecd38", "title": "Radar-Lidar Fusion for Classification of Traffic Signaling Motion in Automotive Applications"}, {"paperId": "032466d8c1331b370b0cb831aab45314a16801e1", "title": "A Survey on Uncertainty Assessment in ANN-Based Measurements"}, {"paperId": "b60ca441a4440f84c65c752a9a09754240723002", "title": "The Evaluation of Uncertainty in Measurements Using Artificial Neural Network Techniques"}, {"paperId": "5aa5c418e5f7c260bd297aa55f64350f82be3318", "title": "Semantic Bird's-Eye View Road Line Mapping"}, {"paperId": "5d6525b41bc2f11eb7d6e9c6d47ce80bf3e6ee7a", "title": "Analytical Approach of Machine Learning for Prediction Models"}, {"paperId": "682095588b0f066c3d01b88323d7477ec7fc2779", "title": "Automated Generation of OpenSCENARIO Scenarios for Evaluating Advanced Driver Assistance Systems"}, {"paperId": "a53d7989503fe20b8e94452cb2fa0dccef856ab5", "title": "Development and Validation of Lane Keeping Assist Algorithm for Advanced Driver Assistance System Applications"}, {"paperId": "cca39ff52acd9ab80a1e7f766f5a65f8f4f5cd10", "title": "Real-Time IoT-Based Connected Vehicle Infrastructure for Intelligent Transportation Safety"}, {"paperId": "743a0e05fb713b8e3f4fe0491136baa361d36bba", "title": "Emergency Steering Modelling of Vehicles via Ensemble Radial Basis Function Neural Network(RBFNN)"}, {"paperId": "0f1980d8bdaa8afc566181fa54fb6ca3590545a1", "title": "Lane-Line Segmentation Using YOLOv7"}, {"paperId": "d0044d1f552be69b7ea4c08d38adbcf54d972de0", "title": "Autonomous vehicular overtaking maneuver: A survey and taxonomy"}, {"paperId": "5c52d57f3386c04b3d75d1e6ed72be4ff37e5570", "title": "Automotive Perception Software Development: An Empirical Investigation into Data, Annotation, and Ecosystem Challenges"}, {"paperId": "b4d8b05e9b6b9a7ff01fec7e78773c98a16fb755", "title": "A Novel Approach for Simulation of Automotive Radar Sensors Designed for Systematic Support of Vehicle Development"}, {"paperId": "e0fef0f331e83aa085c96fde4653b2e6eda6afd5", "title": "Recent Advancement in Autonomous Vehicle and Driver Assistance Systems"}, {"paperId": "3a04e300458a9987b1b5d0171d4f3606d0dd6f91", "title": "A Lab-Based Investigation of Reaction Time and Reading Performance using Different In-Vehicle Reading Interfaces during Self-Driving"}, {"paperId": "df4ea1f39d51705b079fb92b969fbafae09ef01a", "title": "Adaptive Driving Assistant Model (ADAM) for Advising Drivers of Autonomous Vehicles"}, {"paperId": "24524dc18027a2834a87581e72d1f530a8947443", "title": "Cooperative Adaptive Cruise Control: A Gated Recurrent Unit Approach"}, {"paperId": "3aa4313450b10344a05e776c1fbe9fe6f7eb7841", "title": "Design and Validation of Reversing Assistant Based on Extreme Learning Machine"}, {"paperId": "09962d75fbe2113f5a2af93d1344a1162d9f8fcb", "title": "Forwarding Collision Assessment with the Localization Information Using the Machine Learning Method"}, {"paperId": "9393238aaa2c594ea950dfbebfdd6467ae2ce542", "title": "A Study on the Noise Removal in Road Images Acquired from Black Box Based on Convolutional Neural Networks"}, {"paperId": "0fba35277b6eebdd9e9cb951cfdc58182dcd7ba4", "title": "A Review of Model Predictive Controls Applied to Advanced Driver-Assistance Systems"}, {"paperId": "7ec5f9f8761c390e557c0ac0f5fee27daee02128", "title": "Machine Learning Technologies in Internet of Vehicles"}, {"paperId": "227ebe5d1433cabcc6b8e45fe94273f3ad51753c", "title": "Road Object Detection in Bangladesh using Faster R-CNN: A Deep Learning Approach"}, {"paperId": "79ab7d80f010f9c96cb7f0322648b86ac6bac1c8", "title": "On Driver Behavior Recognition for Increased Safety: A Roadmap"}, {"paperId": "56cbdf659f8ce317665755f8c9b03d2397338733", "title": "A Vision-Based Driver Assistance System with Forward Collision and Overtaking Detection †"}, {"paperId": "5d9cd69c33f0d731a03cb3e05e44fac6ef027165", "title": "Simultaneous Estimation of Vehicle Roll and Sideslip Angles through a Deep Learning Approach"}, {"paperId": "ea866449231dfee62032305e0dba3c250311e2c6", "title": "Digital Twin: Enabling Technologies, Challenges and Open Research"}, {"paperId": "460bcc9b52c17ff95b2dc0de831ca6780a33ceaa", "title": "Deep learning-based image recognition for autonomous driving"}, {"paperId": "ba9c34e6ea5d3c43fe9e57f0247d162602cc8c20", "title": "Development of Machine Learning Model for Mobile Advanced Driver Assistance (ADA)"}, {"paperId": "f1f58b0c72407c0da047180d306a5aa513f241c7", "title": "Digital Twin: Enabling Technology, Challenges and Open Research"}, {"paperId": "058a5ca2998e0a4964eebf6f1396fb8b63dbae78", "title": "Web-based Video-Assisted Point Cloud Annotation for ADAS validation"}, {"paperId": "acd63100333c863915e46fd48f26a7f3f946abab", "title": "An Integrated Framework for Autonomous Driving: Object Detection, Lane Detection, and Free Space Detection"}, {"paperId": "f39426f8f499bd5c3dd277763922c5bb5af1e9c6", "title": "Securing the Future: A Comprehensive Review of Security Challenges and Solutions in Advanced Driver Assistance Systems"}, {"paperId": "b72fa5d992fb170595e63c72c3ef3b118dee0ea7", "title": "Cross-Domain Translation Learning Method Utilizing Autoencoder Pre-Training for Super-Resolution of Radar Sparse Sensor Arrays"}, {"paperId": "fe053e35664679c29396531aa48ed85c355c29ff", "title": "International Journal of Science and Business"}, {"paperId": "e5f5f0f4d8125ec40e0321107f164e0fed2d5ee4", "title": "Machine Learning Technologies for Secure Vehicular Communication in Internet of Vehicles: Recent Advances and Applications"}, {"paperId": "7db240ccd5e4bbb8a520d24318e8523eda544e9a", "title": "Ansys Real Time Physics Based Radar Simulation – An Enabler for Machine Learning in the Context of Autonomous Driving"}, {"paperId": "f2358803d03060b1ca03d90836ef6eb8e6a9b418", "title": "Resource-Constrained Machine Learning for ADAS: A Systematic Review"}, {"paperId": "fb5b203078ee0413ed73d73e5f41b3befb7640f8", "title": "Machine Learning-Based Radar Perception for Autonomous Vehicles Using Full Physics Simulation"}, {"paperId": "de9d2d4d8aed872e674fec114583a7bc7eec8c79", "title": "Study and Development of a Convolutional Architecture based on Distributed RAM"}, {"paperId": "bb84c6cbd2a66cfe653824b1cdfc96f269b3dd43", "title": "Machine Learning Approach in Identifying Speed Breakers for Autonomous Driving: An Overview"}, {"paperId": "27cbe3c61b91e1a5a4f9334f7ba43cadb0ca4b42", "title": "Deliverable D 2.2 WP2 Report on AI approaches and models"}]}
