{"paperId": "4567888e2d95b984d3d54e4e0cf1447ee28f9bb9", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A Review of Immersive Technologies, Knowledge Representation, and AI for Human-Centered Digital Experiences", "abstract": "The evolution of digital technologies has resulted in the emergence of diverse interaction technologies. In this paper, we conducted a review of seven domains under a human-centric approach user interface design, human-centered web-based information systems, semantic knowledge representation, X-reality applications, human motion and 3D digitization, serious games, and AI. In this review, we studied these domains concerning their impact on the way we interact with digital interfaces, process information, and engage in immersive experiences. As such, we highlighted the shifts in design paradigms, user-centered principles, and the rise of web-based information systems. The results of such shifts are materialized in modern immersive technologies, semantic knowledge representation, serious games, and the facilitation of artificial intelligence for interactions. Through this exploration, we aimed to assist our understanding of the challenges that lie ahead. The seamless integration of technologies, ethical considerations, accessibility, education for technological literacy, interoperability, user trust, environmental sustainability, and regulatory frameworks are becoming significant. These challenges present opportunities for the future to enrich human experiences while addressing societal needs. This paper lays the groundwork for thoughtful and innovative approaches to the challenges that will define the future of human–computer interaction and information technologies.", "venue": "Electronics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-07", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1810863", "name": "Nikolaos Partarakis"}, {"authorId": "2148679961", "name": "X. Zabulis"}], "citations": [{"paperId": "2eeb4ad2381a1b783e34f52bc864726ee42a2b27", "title": "The Role of Artificial Intelligence in the Study of the Psychology of Religion"}]}
