{"paperId": "45759c779f77648ef932a0617e514975e7992bc2", "publicationVenue": null, "title": "Big data application in medical domain", "abstract": "Large volume of data which is a combination of both structured as well as unstructured data is referred by the term Big Data. As the amount of data produced is very huge, it becomes really difficult and time consuming to manage this data. Hadoop is a Big Data technology that is extensively used for the manipulation and analysis of Big Data. The applications of Big Data introduce new scope to determine knowledge. In this paper, applications of Big Data in medical domain is presented. Also, the challenges and benefits of various tools of Big Data in various scenarios are discussed.", "venue": "2017 International Conference on Energy, Communication, Data Analytics and Soft Computing (ICECDS)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 International Conference on Energy, Communication, Data Analytics and Soft Computing (ICECDS)", "pages": "1936-1939"}, "authors": [{"authorId": "9408355", "name": "Chetna Kaushal"}, {"authorId": "2193443", "name": "D. Koundal"}], "citations": [{"paperId": "6ea6af78da296ae66e7982f0402779d05aca3c28", "title": "Text Document clustering using partial Fractionation and Bisecting K-means"}, {"paperId": "06b23dc2a3437f17d5da53d841b04fbd54f5520a", "title": "Big Data Analytics for Prediction Modelling in Healthcare Databases"}, {"paperId": "cd40131013f4864c92178bfd8ca93f7983e24303", "title": "An Optimized Integrated Framework of Big Data Analytics Managing Security and Privacy in Healthcare Data"}, {"paperId": "490b9dc2e9b9507aafd2507a7a9398e98899038c", "title": "Advancement and applicability of classifiers for variant exponential model to optimize the accuracy for deep learning"}, {"paperId": "a1dafe5f661def685c5be3eacde0f0bb41892df2", "title": "An Improved Method for Extractive Based Opinion Summarization Using Opinion Mining"}, {"paperId": "b707ad98ba9cbddb5c787d73225c5d2093e9382d", "title": "Why Big Data and What Is It? Basic to Advanced Big Data Journey for the Medical Industry"}]}
