{"paperId": "457b84d758df3d90ceaaa37f8ac1473bd0cb8c9c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Electrical Cable Optimization in Offshore Wind Farms—A Review", "abstract": "A state-of-the-art review of the optimization of electrical cables in offshore wind farms (OWFs) is presented in this paper. One of the main contributions of this paper is to propose a general classification of this problem, framed in the general context of the OWFs design and optimization (OWiFDO). The classification encompasses two complementary aspects. First, the optimum sizing of electrical cables, with the three main approaches used nowadays, static-rated sizing, dynamic load cycle profile, and dynamic full time series, is conceptually analyzed and compared. The latest techniques and advances are described, along with the presentation of potential research areas not thoroughly addressed today, such as dynamic cable rating, and cable’s lifetime estimation under time-varying conditions. Second, the network optimization of large OWFs is thoroughly presented, dividing the problem with a bottom–top approach: cable layout of the collection system, wind turbines (WTs) allocation to offshore substations (OSSs), number and location of OSSs, and interconnection between OSSs and onshore connection points (OCPs). A comparison among different methods is performed, taking into consideration the main engineering constraints. Global optimization, specifically, binary programming (BIP) or mixed-integer linear programming (MILP), is envisaged as the best way to tackle this topic. The full combinatorial problem is found to be better addressed following a top–bottom approach, combining exact formulations with high-level heuristics, or holistically with evolutionary algorithms.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-07-01", "journal": {"name": "IEEE Access", "pages": "85796-85811", "volume": "7"}, "authors": [{"authorId": "1401970065", "name": "J. Pérez-Rúa"}, {"authorId": "31769145", "name": "N. Cutululis"}], "citations": [{"paperId": "e5b93df81e654dd86c9b2fa208b539bfddfe9291", "title": "Inter-array cabling optimization in offshore wind power plants, a new reliability indicator for radial grids"}, {"paperId": "9df08866c00b246b5778acece06980f2840af1b3", "title": "Optimization of floating wind farm power collection system using a novel two-layer hybrid method"}, {"paperId": "ecb0e408ef030c710dd53102653aa0e660b9b078", "title": "A Review of Optimization Technologies for Large-Scale Wind Farm Planning With Practical and Prospective Concerns"}, {"paperId": "38a9a7409c6564e215d7b2a8e567ca4e4a867572", "title": "Offshore Electrical Grid Layout Optimization for Floating Wind—A Review"}, {"paperId": "7522ab033b3ec7b5034027cf011da521e6b1e8f1", "title": "Study of spatial characteristics of near-coastal wind fields using UAV technology"}, {"paperId": "e4f157b01f910cae9f721d3dd0a2314f96282541", "title": "Recent developments in offshore wind energy systems: Technologies and practices"}, {"paperId": "5b764fc3ca9e229ba1dac5b82643a0678df64bfd", "title": "Balanced cable routing for offshore wind farms with obstacles"}, {"paperId": "5c8881e4047acb75b903058ba54aa2faf860e443", "title": "Fault State Operation Analysis for Offshore Wind Farm with Ring-Topology Collector System: An OPF and Topology Optimization Method"}, {"paperId": "4d1a431432fbe9228b379622fb2823fe53151dfd", "title": "Game optimization of Environmental Friendly New Offshore Wind Farm Power Collection System"}, {"paperId": "67a41f8d445e09de28aaf1479174216fbc4a1cb1", "title": "Solver-free heuristics to retrieve feasible points for offshore wind farm collection system"}, {"paperId": "563b6e4049c1735c7a69df24805b13ea6ed20364", "title": "A Framework for Simultaneous Design of Wind Turbines and Cable Layout in Offshore Wind"}, {"paperId": "1073a945181830bc31e6587decd8fc4f8bd60b67", "title": "Reliability‐based topology optimization for offshore wind farm collection system"}, {"paperId": "757185e3d6c6d6338a3b501ca7539611159e00ea", "title": "Upgrading wave energy test sites by including overplanting: a techno‐economic analysis"}, {"paperId": "ca7ba9ae2f33c8051247997e7a75768059d7d33c", "title": "Reliability and Economic Evaluation of Offshore Wind Power DC Collection Systems"}, {"paperId": "39a507f7b192829a27ae4613adcdb900bf071e58", "title": "Concepts and Methods to Assess the Dynamic Thermal Rating of Underground Power Cables"}, {"paperId": "1cbbd52a65f075db66fc30f13b2073a6d01fc754", "title": "Thermal Assessment of Power Cables and Impacts on Cable Current Rating: An Overview"}, {"paperId": "ffca38b154063e26595c8da81e350af22dc67129", "title": "Variable pitch control on direct-driven PMSG for offshore wind turbine using Repetitive-TS fuzzy PID control"}, {"paperId": "c8de75d6aab9fea85e077af8cd124a5cbd8857dc", "title": "Dynamic Thermal Rating of Electric Cables: A Conceptual Overview"}, {"paperId": "f76f51563158b3fba1aeac997aedc980c1e5449b", "title": "Optimization of Wind Farm Design for Objectives Beyond LCOE"}, {"paperId": "e8afdf1a84743a5ae0b0069f21fae968fa308040", "title": "Integrated Global Optimization Model for Electrical Cables in Offshore Wind Farms"}, {"paperId": "a51be581b29dc0ab0928b53db7636be9e7038ffe", "title": "Closed-Loop Two-Stage Stochastic Optimization of Offshore Wind Farm Collection System"}, {"paperId": "d215fdc602c1f85e548a5a6b81464b9d124f0fd1", "title": "Global Optimization of Offshore Wind Farm Collection Systems"}, {"paperId": "f563e8d663502f178a65b8676b4010abd9fea7b5", "title": "Cable Layout Optimization of Offshore Wind Farms Collection Systems"}, {"paperId": "0e188641d815ca8f1a4a903ce8b634f6f30071f1", "title": "A fast dimension reduction framework for large-scale topology optimization of grid-layout offshore wind farm collector systems"}, {"paperId": "5bb2d1f0c9ebc216fabf159ecf44e4e3bc6ce044", "title": "Optimum Cable Sizing for Offshore Wind Farms Using Binary Integer Programming"}, {"paperId": "f448be65df0873b8c035ec32ef9b00af51f89206", "title": "GA based algorithms for offshore wind farm collector cable optimization"}, {"paperId": "0abd16aa2bcfc22c6a3727890fdd574d80b32c13", "title": "Cluster-Based Predictive PCC Voltage Control of Large-Scale Offshore Wind Farm"}, {"paperId": "1a384db7f845e74a29069f992063096901d1b5ef", "title": "Concepts and Methods to Assess the Dynamic Thermal Rating of Underground Power Cables \"2279"}, {"paperId": "3842eae67a86655bb5eaa1d384365a9de51e5dcc", "title": "Leader-Following Diffusion-Based Reactive Power Coordination and Voltage Control of Offshore Wind Farm"}]}
