{"paperId": "457bbb0f64729dcfb15fe11be2b7fce91fcb1243", "publicationVenue": null, "title": "CompressGraph: Efficient Parallel Graph Analytics with Rule-Based Compression", "abstract": "Modern graphs exert colossal time and space pressure on graph analytics applications. In 2022, Facebook social graph reaches 2.91 billion users with trillions of edges. Many compression algorithms have been developed to support direct processing on compressed graphs to address this challenge. However, previous graph compression algorithms do not focus on leveraging redundancy in repeated neighbor sequences, so they do not save the amount of computation for graph analytics. We develop CompressGraph, an efficient rule-based graph analytics engine that leverages data redundancy in graphs to achieve both performance boost and space reduction for common graph applications. CompressGraph has three advantages over previous works. First, the rule-based abstraction of CompressGraph supports the reuse of intermediate results during graph traversal, thus saving time. Second, CompressGraph has intense expressiveness to support a wide range of graph applications. Third, CompressGraph scales well under high parallelism because the context-free rules have few dependencies. Experiments show that CompressGraph provides significant performance and space benefits on both CPUs and GPUs. On evaluating six typical graph applications, CompressGraph can achieve 1.97× speedup on the CPU, while 3.95× speedup on the GPU, compared to the state-of-the-art CPU and GPU methods, respectively. Moreover, CompressGraph can save an average of 71.27% memory savings on CPU and 70.36 on GPU.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-30", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 31", "volume": "1"}, "authors": [{"authorId": "2117203294", "name": "Zheng Chen"}, {"authorId": "2182283143", "name": "Feng Zhang"}, {"authorId": "2054060619", "name": "Jiawei Guan"}, {"authorId": "2467444", "name": "Jidong Zhai"}, {"authorId": "2111115725", "name": "Xipeng Shen"}, {"authorId": "2043439", "name": "Huanchen Zhang"}, {"authorId": "2218889956", "name": "Wentong Shu"}, {"authorId": "2152944669", "name": "Xiaoyong Du"}], "citations": [{"paperId": "5ca42c1ec411eecb80765f12d8f8bc59cc63d76c", "title": "Compressed Data Direct Computing for Databases"}, {"paperId": "5d837ca27a7bc0882dcd6e6a4dd5d16e0d1f98c3", "title": "Homomorphic Compression: Making Text Processing on Compression Unlimited"}, {"paperId": "09aa3b34765d30e7b71939dc2030d1411e43c9fa", "title": "RECom: A Compiler Approach to Accelerating Recommendation Model Inference with Massive Embedding Columns"}]}
