{"paperId": "45976c13ecc25922acadcefa41c5da01459cd725", "publicationVenue": null, "title": "Dynamic Materialized View Management using Graph Neural Network", "abstract": "—Materialized views (MVs) are vital in DBMS to im- prove the query efﬁciency by reducing redundant computations of shared subqueries in a workload. Traditional methods focus on static MV management, which assumes that MVs will not be added or evicted. However, in real scenarios, query workloads usually dynamically change, and thereby the previously maintained MVs cannot be well adapted to future workloads due to the possible shift in query distribution. Therefore, it is important to study the dynamic MV management problem where workloads dynamically change, but there are several challenges. First, it is challenging to estimate the beneﬁt of using an MV to answer a query (i.e., the execution time reduction of answering the query using the view) in order to select high-quality MVs, especially for dynamic workloads, where queries and MVs dynamically change. Second, it is challenging to efﬁciently maintain the set of MVs to immediately utilize the new views to answer the newly coming queries. However, existing methods either have low accuracy (traditional methods) or low efﬁciency (learning-based methods). To address these challenges, we propose a novel framework GnnMV that leverages the graph neural network (GNN) to estimate the beneﬁt for efﬁcient and effective dynamic MVs management. First, we maintain the dynamic query workloads as a query graph, extract and encode key features of queries to model a GNN. Second, we design a feature aggregation function for neighbor nodes in the graph to achieve high accuracy. Third, we propose to extract a small subgraph for efﬁcient beneﬁt estimation, when the graph becomes larger and larger due to continuously coming queries. Experimental results show that our method signiﬁcantly outperforms state-of-the-art approaches.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2112897213", "name": "Yue Han"}, {"authorId": "1720852203", "name": "Chengliang Chai"}, {"authorId": "2180333808", "name": "Jiabin Liu"}, {"authorId": "2242412700", "name": "Guoliang Li"}, {"authorId": "2111631833", "name": "Chuangxian Wei"}, {"authorId": "1943446516", "name": "Chaoqun Zhan"}], "citations": [{"paperId": "759ef231abd73632dc91f73ae467c3d3bf314deb", "title": "PERBANDINGAN PERFORMA QUERY SELECT DASAR, VIEW, DAN STORED PROCEDURE PADA DATABASE MYSQL"}, {"paperId": "6c4939564ba3d47fd4e54ff6084128f21ddb8037", "title": "AutoCE: An Accurate and Efficient Model Advisor for Learned Cardinality Estimation"}]}
