{"paperId": "459714fdc44ab614e25b5fe98e31bf0c451adbca", "publicationVenue": {"id": "e82d4b1c-8746-42d9-83c4-dbfdf7f66e13", "name": "International Conference on Research and Innovation in Information Systems", "type": "conference", "alternate_names": ["ICRIIS", "Int Conf Res Innov Inf Syst"]}, "title": "Challenges in Managing Information Systems Security for Internet of Things-enabled Smart Cities", "abstract": "Smart Cities (SC) initiative involving Internet of Things (IoT) is forcing drastic changes to IT management approaches. A significant change occurs in the aspect of security management, particularly in the Information Systems (IS) security within the SC ecosystem. The Information Systems’ security management approach evolves as the organisation model changes. As public sector organisations prepare for SC with the adoption of IoT, revision on the existing security management approach remains critical. The preliminary phase of such revision requires an understanding of the specific challenges that pose risks to the IS security. Therefore, this study identifies the potential challenges by conducting a document analysis method on relevant literature. The findings showed that the IS security management for IoTenabled SC is challenged in terms of governance, integrity, interoperability, personalization, and self-organizing. Understanding these challenges initiates the effort towards revising the management approach, specifically for managing the IS security in IoT-enabled SC.", "venue": "International Conference on Research and Innovation in Information Systems", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": ["Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 6th International Conference on Research and Innovation in Information Systems (ICRIIS)", "pages": "1-6"}, "authors": [{"authorId": "122741562", "name": "Zarina Din"}, {"authorId": "3367805", "name": "Dian Indrayani Jambari"}, {"authorId": "2086039", "name": "M. Yusof"}, {"authorId": "2535760", "name": "J. Yahaya"}], "citations": [{"paperId": "1abc213403b16ca5cb4851ab3e1e95baafc68710", "title": "Access management of IoT devices using access control mechanism and decentralized authentication: A review"}, {"paperId": "f29e208cf101acf8215e20f1a9c3ae434f0b206f", "title": "A New Internet of Things (IoT) Framework for Public Sectors"}, {"paperId": "a7fa7935d118b8cbd9fee21cc4f9c43de3c8b96e", "title": "A novel Paradigm for Access Control Trust in IoT Applications: A Distributed Cross-Communication Approach"}, {"paperId": "445e4312dd16d1c46d4864466f2be72117921ad2", "title": "Comprehensive Survey and Research Directions on Blockchain IoT Access Control"}, {"paperId": "fc8443c4b9fb0b977af99cfc6ed705544370b6d9", "title": "Challenges in IoT Technology Adoption into Information System Security Management of Smart Cities: A Review"}, {"paperId": "a4b415cf281ccf106ffb4b9a44da0f6cd5d57e3e", "title": "Information Security Aspects in a Smart City"}]}
