{"paperId": "45a81f00b88f041b2b08c77d81179c225826c85c", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "Detection of Distributed Cyber Attacks Based on Weighted Ensembles of Classifiers and Big Data Processing Architecture", "abstract": "Distributed cyber attacks represent a special class of attacks on computer networks and systems which is rather difficult to detect. In many respects it is explained by the complexity of such detection demanding joint implementation of procedures of data analysis and technologies of Big Data processing. For this reason the development of new methods for detection of distributed cyber attacks is of great interest to specialists in the field of cyber security. The paper offers a new approach to detection of such cyber attacks. The approach is based on sharing of the weighted ensembles of different classifiers (Decision trees, Logistic regression, Support vector machines) and the Big Data processing architecture. Results of comparative analysis of three different types of the weighted ensembles (weighted voting, soft voting, and adaboost) integrating basic classifiers are evaluated. Experiments, made with use of the CICIDS2017 data set, demonstrated a rather high effectiveness of cyber attack detection and the acceptable level of consumption of the system and time resources. The approach suggested can be used for other related information assurance tasks, for example, detection and counteraction of inappropriate, dubious and harmful information.", "venue": "Conference on Computer Communications Workshops", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-04-29", "journal": {"name": "IEEE INFOCOM 2019 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1-6"}, "authors": [{"authorId": "16777650", "name": "Igor Kotenko"}, {"authorId": "145683384", "name": "I. Saenko"}, {"authorId": "2636647", "name": "A. Branitskiy"}], "citations": [{"paperId": "041366584f5db376d5026c592a8584d5dc520250", "title": "NIDM: Novel Intrusion Detection Model Using CNN-LSTM for Big Data Environment"}, {"paperId": "5476330803645f69dc9da37b396d2547438d136b", "title": "Experimental Cyber Attack Detection Framework"}]}
