{"paperId": "45d0ebb4a46cf26281c12c772a172694e1a120b3", "publicationVenue": {"id": "34342fcb-3fe0-45c6-a017-6e65b73d030f", "name": "IEEE International Conference on e-Science", "type": "conference", "alternate_names": ["e-Science", "Int Conf e-science", "IEEE Int Conf e-science", "E-Science", "International Conference on e-Science"], "url": "https://escience-conference.org/"}, "title": "FAIRSECO: An Extensible Framework for Impact Measurement of Research Software", "abstract": "The growing usage of research software in the research community has highlighted the need to recognize and acknowledge the contributions made not only by researchers but also by Research Software Engineers. However, the existing methods for crediting research software and Research Software Engineers have proven to be insufficient. In response, we have developed FAIRSECO, an extensible open source framework with the objective of assessing the impact of research software in research through the evaluation of various factors. The FAIRSECO framework addresses two critical information needs: firstly, it provides potential users of research software with metrics related to software quality and FAIRness. Secondly, the framework provides information for those who wish to measure the success of a project by offering impact data. By exploring the quality and impact of research software, our aim is to ensure that Research Software Engineers receive the recognition they deserve for their valuable contributions.", "venue": "IEEE International Conference on e-Science", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-09", "journal": {"name": "2023 IEEE 19th International Conference on e-Science (e-Science)", "pages": "1-10"}, "authors": [{"authorId": "2247751320", "name": "Deekshitha"}, {"authorId": "40267505", "name": "Siamak Farshidi"}, {"authorId": "2253785860", "name": "Jason Maassen"}, {"authorId": "2923075", "name": "R. Bakhshi"}, {"authorId": "2245293178", "name": "R. V. van Nieuwpoort"}, {"authorId": "1698329", "name": "S. Jansen"}], "citations": []}
