{"paperId": "45d3ebdc0b679656d02dbcebb97c53f6c70686de", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "A Study of the Data Security Attack and Defense Pattern in a Centralized UAV–Cloud Architecture", "abstract": "An unmanned aerial vehicle (UAV) is an autonomous flying robot that has attracted the interest of several communities because of its capacity to increase the safety and productivity of labor. In terms of software engineering, UAV system development is extremely difficult because the focus is not only on functional requirement fulfillment, but also on nonfunctional requirements such as security and safety, which play a crucial role in mission success. Consequently, architecture robustness is very important, and one of the most common architectures developed is based on a centralized pattern in which all UAVs are controlled from a central location. Even though this is a very important problem, many developers must expend a great deal of effort to adapt and improve security. This is because there are few practical perspectives of security development in the context of UAV system development; therefore, the study of attack and defense patterns in centralized architecture is required to fill this knowledge gap. This paper concentrates on enhancing the security aspect of UAV system development by examining attack and defense patterns in centralized architectures. We contribute to the field by identifying 26 attack variations, presenting corresponding countermeasures from a software analyst’s standpoint, and supplying a node.js code template for developers to strengthen their systems’ security. Our comprehensive analysis evaluates the proposed defense strategies in terms of time and space complexity, ensuring their effectiveness. By providing a focused and in-depth perspective on security patterns, our research offers crucial guidance for communities and developers working on UAV-based systems, facilitating the development of more secure and robust solutions.", "venue": "Drones", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-25", "journal": {"name": "Drones"}, "authors": [{"authorId": "2279631431", "name": "Gregorius Airlangga"}, {"authorId": "1785229140", "name": "Alan Liu"}], "citations": [{"paperId": "1b741b646d276ff30edb638f185997b34f56abf3", "title": "Designing UAV Swarm Experiments: A Simulator Selection and Experiment Design Process"}, {"paperId": "2725600ca849ded9ce3f69eb620ebd72767aa43d", "title": "DCM-D2X: An Effective Communication Mobility Model for Decentralized Cooperative Multi-Layer Drone to Everything"}]}
