{"paperId": "45fe31b8581c330b8cab8ca39d4d8d2e28f3e540", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Traffic Congestion Forecasting in Shanghai Based on Multi-Period Hotspot Clustering", "abstract": "Traffic congestion has become increasingly prominent. Effective prediction of road congestion will provide a great reference for urban road planning and residents’ travel. Taxi trajectory data objectively reflect the travel routes of the residents of a city. With good temporal and spatial characteristics and high timeliness, these data have become important in the study of urban spatio-temporal characteristics. In this paper, the PageRank-K clustering algorithm is used to analyse hotspots and cluster hotspots of a region. The shortest-distance matching algorithm based on the transition probability is used for map matching; then, the average speed of the road sections can be calculated, and the direction of taxis can be determined. The Dual_XGBoost model is used for traffic congestion prediction. Finally, we compared our model with similar models. We take roads in Shanghai as the test object. The results show that our method is faster in training, can predict congestion at any time and is more sensitive to long-term features than the other models.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "63255-63269", "volume": "8"}, "authors": [{"authorId": "2115784517", "name": "Chunhui Xu"}, {"authorId": "8573642", "name": "Anqin Zhang"}, {"authorId": "2144839745", "name": "Yu Chen"}], "citations": [{"paperId": "2efcd85fc5eaedfc5aa835d1da20979bde648047", "title": "A Cascaded transition recurrent feature network (CTRFN) based Paramount Transfer learning (PTL) model for traffic congestion prediction"}, {"paperId": "2b7a6af170a7fc6a5ac4eda193c581ac53089ade", "title": "Traffic Shaping and Hysteresis Mitigation Using Deep Reinforcement Learning in a Connected Driving Environment"}, {"paperId": "b1725ce2a39a5c5f04bae97a24b2bb3ee3bc61cd", "title": "The Composite Technique for Predicting Traffic Flow Based on Missing Traffic Information: A Review"}, {"paperId": "7bff7c65f8f80fe73547d615f59b3d4060cd0daf", "title": "Traffic Congestion Propagation Prediction Based on Multi-vector Deep Neural Networks"}, {"paperId": "16537804950ade4a41ed30caee4f532064474ff9", "title": "T-Rank: Graph Data Analytics for Urban Traffic Modeling"}, {"paperId": "51048f5d5e8945e17db7b93c94642dad42584757", "title": "A new traffic congestion prediction strategy (TCPS) based on edge computing"}, {"paperId": "a2927a63f6b98b29fc7cc86bfd8409942dc7a242", "title": "Traffic speed prediction: spatiotemporal convolution network based on long-term, short-term and spatial features"}, {"paperId": "ae65804f060c13fc47eefa5d2eaabef5e9bfec04", "title": "Taxi Passenger Hot Spot Mining Based on a Refined K-Means++ Algorithm"}]}
