{"paperId": "46009aa493d3ffe4c113c64ae5c66c0fdeb578bc", "publicationVenue": null, "title": "Survivability of Cloud Databases - Factors and Prediction", "abstract": "Public cloud database providers observe all sorts of different usage patterns and behaviors while operating their services. Service providers such as Microsoft try to understand and characterize these behaviors in order to improve the quality of their service, provide new features for customers, and/or increase the efficiency of the operations. While there are many types of patterns of behavior that are of interest to providers, such as query types, workload intensity, and temporal activity, in this paper, we focus on the lowest level of behavior -- how long do public cloud databases survive before being dropped? Given the large and diverse relational database population that Azure SQL DB has, we present a large-scale survivability study of our service and identify some factors that can demonstrably help predict the lifespan of cloud databases. The results of this study are being used to influence how Azure SQL DB operates in order to increase efficiency as well as improve customer experience.", "venue": "SIGMOD Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "Proceedings of the 2018 International Conference on Management of Data"}, "authors": [{"authorId": "32563772", "name": "Jose Picado"}, {"authorId": "40493538", "name": "Willis Lang"}, {"authorId": "2386477", "name": "E. Thayer"}], "citations": [{"paperId": "a3505ee5e1181d1f77277c062bf9350ad4be632f", "title": "Proactive Resource Allocation Policy for Microsoft Azure Cognitive Search"}, {"paperId": "7219d1af1ab61fff9dc4949d99faf59d4d3834e9", "title": "Flexible Resource Allocation for Relational Database-as-a-Service"}, {"paperId": "0d7b27efa885fbc5804ab84f23eca4b774fb32e5", "title": "Solver-In-The-Loop Cluster Resource Management for Database-as-a-Service"}, {"paperId": "5a3ab721e11a23ab36cd34b56a7348e62c93c5e3", "title": "Tenant Placement in Over-subscribed Database-as-a-Service Clusters"}, {"paperId": "5c8d13a422c640b1eeff6cd92aec6587d8a759ab", "title": "SA-LSM : Optimize Data Layout for LSM-tree Based Storage using Survival Analysis"}, {"paperId": "17e44fb34a6fbc0f56bc713a2ac24ff82b019bcf", "title": "Moneyball: Proactive Auto-Scaling in Microsoft Azure SQL Database Serverless"}, {"paperId": "d618ea3c240048d4ba518b784d80fe1113536085", "title": "Verifiable Access Technology of Hybrid Database in Distributed System Under Big Data"}, {"paperId": "dc30377f8e686f445c6e064e62a83d2ed90b9a30", "title": "Toto \u0096 Benchmarking the Efficiency of a Cloud Service"}, {"paperId": "28f27f3b17294a1ec50cee645522d2c66c812693", "title": "Seagull: An Infrastructure for Load Prediction and Optimized Resource Allocation"}, {"paperId": "ac31cbedd778709e0e88b72abc60b411e600eb75", "title": "Transparent Access and Integration of Heterogeneous Encrypted Database in Hybrid Cloud Environment"}]}
