{"paperId": "460edd398c293f7b5305bd245b2f1c788708a3e0", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Agent-Based Recommendation in E-Learning Environment Using Knowledge Discovery and Machine Learning Approaches", "abstract": "E-learning is a popular area in terms of learning from social media websites in various terms and contents for every group of people in this world with different knowledge backgrounds and jobs. E-learning sites help users such as students, business workers, instructors, and those searching for different educational institutions. Excluding the benefits of this system, there are various challenges that the users face in online platforms. One of the important challenges is the true information and right content based on these resources, search results and quality. This research proposes virtual and intelligent agent-based recommendation, which requires users’ profile information and preferences to recommend the proper content and search results based on their search history. We applied Natural Language Processing (NLP) techniques and semantic analysis approaches for the recommendation of course selection to e-learners and tutors. Moreover, machine learning performance analysis applied to improve the user rating results in the e-learning environment. The system automatically learns and analyzes the learner characteristics and processes the learning style through the clustering strategy. Compared with the recent state-of-the-art in this field, the proposed system and the simulation results show the minimizing number of metric errors compared to other works. The achievements of the presented approach are providing a comfortable platform to the user for course selection and recommendations. Similarly, we avoid recommending the same contents and courses. We analyze the user preferences and improving the recommendation system performance to provide highly related content based on the user profile situation. The prediction accuracy of the proposed system is 98% compared to hybrid filtering, self organization systems and ensemble modeling.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-06", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "9239463", "name": "Zeinab Shahbazi"}, {"authorId": "1703870", "name": "Y. Byun"}], "citations": [{"paperId": "b5a80f7fd24a7286c2665f4bb485378b694885f8", "title": "Measuring the Impact of Machine Learning on Real-Time Data Analysis"}, {"paperId": "169bc9fee34123357c47b799a4a381cfac16eec5", "title": "Deep Learning Approaches for Enhancing Content Retrieval"}, {"paperId": "4de9abb48e322049d98511583e5534001adf1d24", "title": "An Enhanced Semantic Analysis of Potential Recommender Systems for Big Data Management"}, {"paperId": "ef4238517b4c2a2e855c618ee61d771a6be79bcc", "title": "Recommender Systems and Machine Learning Techniques for Large Educational Data: A Survey"}, {"paperId": "a0bcb6ec8f7399fb902b46eadd813c98a433b8cb", "title": "Personalization-based deep hybrid E-learning model for online course recommendation system"}, {"paperId": "8acfd9a1b9272ed2608a825819e12edf34695703", "title": "A Model for Enhancing User Experience in an E-learning System: A Review on Student Behavior and Content Formatting"}, {"paperId": "d3b8508b3a38c1df964ff39c53721b6984b34c10", "title": "Intelligent Course Recommendation for Higher Education based on Learner Proficiency"}, {"paperId": "192a4ad72e25cd8dde41820e29202ebd5496918e", "title": "Is Artificial Intelligence Really the Next Big Thing in Learning and Teaching in Higher Education? A Conceptual Paper"}, {"paperId": "a3a7194a42006350a6afff178dd6a19f7cf0f27c", "title": "FLICM clustering with matrix factorization based course recommendation in an E-learning platform"}, {"paperId": "d59f80bfcce999a5a1cb882ba8443b5224eaed40", "title": "Identification of Critical Parameters Affecting an E-Learning Recommendation Model Using Delphi Method Based on Expert Validation"}, {"paperId": "0de97f7bd482b670aa7fd6af4de327f030ef1975", "title": "Analysis of Educational Recommender System Techniques for Enhancing Student's Learning Outcomes"}, {"paperId": "b01542b5584a668b3634655b59532b104930611b", "title": "The Teaching Strategy of Socio-Political Education by Deep Learning Under Educational Psychology"}, {"paperId": "727c7daa31ddc901eafc45df868b3e8b0070e5bb", "title": "Impact of digital disruption influencing business continuity in UAE higher education"}, {"paperId": "1e9ea808b6f1f3f5c15278ed3170452d0a030eac", "title": "E-learning course recommendation based on sentiment analysis using hybrid Elman similarity"}, {"paperId": "4c35cec1dbe97ce58fd18bd04daf4efad6f44afd", "title": "E-Learning Environment Based Intelligent Profiling System for Enhancing User Adaptation"}, {"paperId": "c68646d6e52834f06d1f00df6ccf432e0b1cc3cc", "title": "Lithium-Ion Battery Health Prediction on Hybrid Vehicles Using Machine Learning Approach"}, {"paperId": "4064f7832a704bb8a45110ae421a603abd31eca1", "title": "NLP-Based Digital Forensic Analysis for Online Social Network Based on System Security"}, {"paperId": "1b0b5f08e48c4adc0ecca5e59fc6d8607017831a", "title": "A Novel Personalized Learning Framework With Interactive e-Mentoring"}, {"paperId": "cd6207a5d7dc07b904e4313d74d4992a206f52fb", "title": "Imperfect-Information Game AI Agent Based on Reinforcement Learning Using Tree Search and a Deep Neural Network"}, {"paperId": "88297d3a7713b2c4beb6574488efb2312a6221d9", "title": "Journal of University Teaching & Learning Practice Journal of University Teaching & Learning Practice"}]}
