{"paperId": "46160a9e58bbff26067492bb02fa27166497f1b8", "publicationVenue": null, "title": "A New Architecture for Real Time Data Stream Processing", "abstract": "Processing a data stream in real time is a crucial issue for several applications, however processing a large amount of data from different sources, such as sensor networks, web traffic, social media, video streams and other sources, represents a huge challenge. The main problem is that the big data system is based on Hadoop technology, especially MapReduce for processing. This latter is a high scalability and fault tolerant framework. It also processes a large amount of data in batches and provides perception blast insight of older data, but it can only process a limited set of data. MapReduce is not appropriate for real time stream processing, and is very important to process data the moment they arrive at a fast response and a good decision making. Ergo the need for a new architecture that allows real-time data processing with high speed along with low latency. The major aim of the paper at hand is to give a clear survey of the different open sources technologies that exist for real-time data stream processing including their system architectures. We shall also provide a brand new architecture which is mainly based on previous comparisons of real-time processing powered with machine learning and storm technology.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "8"}, "authors": [{"authorId": "51151784", "name": "S. Ounacer"}, {"authorId": "10760594", "name": "Mohamed Amine Talhaoui"}, {"authorId": "10775044", "name": "S. Ardchir"}, {"authorId": "38933965", "name": "A. Daif"}, {"authorId": "1939469", "name": "M. Azouazi"}], "citations": [{"paperId": "298fdf08794f7eb5bb30d834bc7eec2f09c3d0cc", "title": "Scalable Deployments for Real-Time AI Video Stream Processing"}, {"paperId": "dfaa5cf1e32854aa629cd754930799f779a1a9c7", "title": "Latency and Energy-Awareness in Data Stream Processing for Edge Based IoT Systems"}, {"paperId": "cd233723bb3e810e2a9512d05e42d595892a93f7", "title": "Real-Time Big Data Analytics for Data Stream Challenges: An Overview"}, {"paperId": "540ffbb1c688d8590aff3a0962e7696fa690d3d1", "title": "Introducing artificial intelligence to the radiation early warning system"}, {"paperId": "cfd5063808f3a1c6b4b9da598c10b094fb753153", "title": "Evaluative Review of Streaming Analytics: Tools and Technologies in Real-Time Data Processing"}, {"paperId": "56576cfb3e9d4b1e4b5aa9b06d6dfb7f9825266f", "title": "Forecasting Electricity Consumption in a Moroccan Educational Institution"}, {"paperId": "97a5caf166a8764944160beb6c86e5766881d8da", "title": "Big Data Architectures Benchmark for Forecasting Electricity Consumption"}, {"paperId": "d772ada1569da3acd15982ea310240b33f5af305", "title": "Optimización de arquitecturas distribuidas para el procesado de datos masivos"}, {"paperId": "6504dd6a9c6aa1139153e26b9f66915c01e9749c", "title": "Tools and Techniques for Streaming Data"}, {"paperId": "de862cfaeefe246633529baef1f6521407cd2f7f", "title": "A Comparative Approach to Predictive Analytics with Machine Learning for Fraud Detection of Realtime Financial Data"}, {"paperId": "5439fee6f20b07c0d27ece325ade100ea707a519", "title": "Towards an architecture for big data analytics leveraging edge/fog paradigms"}, {"paperId": "a852464842b4c48b33b33c45387aeccde0824e7f", "title": "A Proposed Architecture for Real Time Credit Card Fraud Detection"}, {"paperId": "29fa0ae44dab32221e7a81a56c49c98c10bbc803", "title": "A NOVEL TRUE REAL-TIME SPATIOTEMPORAL DATA STREAM PROCESSING FRAMEWORK"}, {"paperId": "a4da097d05bb7d947e7d28267d45eec19233a2d7", "title": "LE-STREAM: A LATENCY AND ENERGY-AWARE FRAMEWORK FOR DATA STREAM PROCESSING IN THE INTERNET OF THINGS"}, {"paperId": "caff213f6b2f22b60812c53d59c0105cc25a5066", "title": "Development and Evaluation of a Big Data Framework for Performance Management in Mobile Networks"}]}
