{"paperId": "462609bb7a66a841a7fae7201c2cc9bcb4de50f1", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Online Lifetime Prediction for Lithium-Ion Batteries with Cycle-by-Cycle Updates, Variance Reduction, and Model Ensembling", "abstract": "Lithium-ion batteries have found applications in many parts of our daily lives. Predicting their remaining useful life (RUL) is thus essential for management and prognostics. Most approaches look at early life prediction of RUL in the context of designing charging profiles or optimising cell design. While critical, said approaches are not directly applicable to the regular testing of cells used in applications. This article focuses on a class of models called ‘one-cycle’ models which are suitable for this task and characterized by versatility (in terms of online prediction frameworks and model combinations), prediction from limited input, and cells’ history independence. Our contribution is fourfold. First, we show the wider deployability of the so-called one-cycle model for a different type of battery data, thus confirming its wider scope of use. Second, reflecting on how prediction models can be leveraged within battery management cloud solutions, we propose a universal Exponential-smoothing (e-forgetting) mechanism that leverages cycle-to-cycle prediction updates to reduce prediction variance. Third, we use this new model as a second-life assessment tool by proposing a knee region classifier. Last, using model ensembling, we build a “model of models”. We show that it outperforms each underpinning model (from in-cycle variability, cycle-to-cycle variability, and empirical models). This ‘ensembling’ strategy allows coupling explainable and black-box methods, thus giving the user extra control over the final model.", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-06", "journal": {"name": "Energies"}, "authors": [{"authorId": "2022948851", "name": "Calum Strange"}, {"authorId": "2197154416", "name": "Rasheed Ibraheem"}, {"authorId": "2052471503", "name": "G. dos Reis"}], "citations": [{"paperId": "d1bd065a08b1e79af14a824538de6d70833b3619", "title": "Data-Driven Battery Characterization and Prognosis: Recent Progress, Challenges, and Prospects."}, {"paperId": "26536d0a17f86b9550e143353d7e3e5753be97f1", "title": "Early prediction of Lithium-ion cell degradation trajectories using signatures of voltage curves up to 4-minute sub-sampling rates"}, {"paperId": "f0ecc53ac16ef4aebf176294c206406616b7fbef", "title": "Selected Metal Materials in Automotive Electrical Engineering—A Brief Overview of the State of the Art"}]}
