{"paperId": "466a2ae6d8645b7c438f2230d621255b48fa887e", "publicationVenue": {"id": "770f1d88-52c2-43dc-a897-6881e70b2f32", "name": "International Conference on Data Science and Advanced Analytics", "type": "conference", "alternate_names": ["Int Conf Data Sci Adv Anal", "IEEE International Conference on Data Science and Advanced Analytics", "IEEE Int Conf Data Sci Adv Anal", "DSAA"]}, "title": "A data reusing strategy based on hive", "abstract": "Large scale data process has emerged as an important issue for concerned researchers. By reusing calculation results, the efficiency of large scale data process can be improved greatly. This paper proposes an efficient data reusing strategy based on the data warehouse tool-Hive, which works on MapReduce framework. Since the intermediate calculation results have been stored in DFS by different jobs in MapReduce workflow, the key issue is how to find the ruse information. This paper deals with this problem by two steps. In the proposed method, firstly, we define a joint object to organize and store the features of intermediate calculation results. Then, based on joint objects, this paper provides the algorithm to match and generate the reuse plan. This paper provides a way to obtain the best reuse strategy in case that there are more than one calculation result can be used. We conduct the experiments based on TPC-H and SSB benchmarks. The experimental results have demonstrated that our strategy can significantly improve the efficiency of large scale data process, and have little effect on queries executed at first time.", "venue": "International Conference on Data Science and Advanced Analytics", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-10-01", "journal": {"name": "2014 International Conference on Data Science and Advanced Analytics (DSAA)", "pages": "367-373"}, "authors": [{"authorId": "2148795442", "name": "Heng Xie"}, {"authorId": "2118661898", "name": "Mei Wang"}, {"authorId": "1782910", "name": "Jiajin Le"}], "citations": [{"paperId": "b946b08e8585220024d280c5eeb5cce99fe1ca4b", "title": "Analysis of Aadhaar Card Dataset Using Big Data Analytics"}]}
