{"paperId": "467381641e0c2a953572c340abeb1ec9d8d7b0b6", "publicationVenue": null, "title": "Workload Matters: A Robust Approach to Physical RDF Database Design", "abstract": "Recent advances in Information Extraction, Linked Data Management and the Semantic Web have led to a rapid increase in both the volume and the variety of publicly available graph-structured data. As more and more businesses start to capitalize on graphstructured data, data management systems are being exposed to workloads that are far more diverse and dynamic than what they were designed to handle. In particular, most systems rely on a workload-oblivious physical layout with a fixed-schema and are adaptive only if the changes in the schema are minor. Thus, they are unable to perform consistently well across different types of workloads. This thesis introduces fundamental techniques for supporting diverse and dynamic workloads in RDF data management systems. Instead of assuming anything about the workload upfront, these techniques allow systems to adjust their physical designs as queries are executed. This includes changing the way (i) records are clustered in the storage system, (ii) data are organized and indexed, and (iii) queries are optimized, all at runtime. The thesis proceeds with a discussion of the challenges that have been encountered in implementing these ideas in a proof-of-concept prototype called chameleon-db, and it concludes with a thorough experimental evaluation.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2015-10-01", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3215781", "name": "Günes Aluç"}], "citations": [{"paperId": "9f6457c157f6055b38ff132d4f8425de322643f1", "title": "Big Data Processing"}, {"paperId": "5a9f86688ab3aeaea93e553fe98d51eb879ed493", "title": "Distributed Transaction Processing"}, {"paperId": "d7339590354827cfe5b4416437a647b4d10a18dd", "title": "A Unified Relational Storage Scheme for RDF and Property Graphs"}, {"paperId": "d82e7787b3bc6f61b4bd1d23abdebd24ab9a3188", "title": "On Probabilistic k-Richness of the k-Means Algorithms"}, {"paperId": "640ddf4eeb5ca20e7d4336385eeae2e3c98b2043", "title": "Building self-clustering RDF databases using Tunable-LSH"}, {"paperId": "0368c36bba112bf7b0cf79c8cebd5ecf8b5ca0ed", "title": "Any-k: Anytime Top-k Tree Pattern Retrieval in Labeled Graphs"}, {"paperId": "11ee0d273cb40e77554d08f7a24de8dabbb0324e", "title": "Redesign of the gStore system"}, {"paperId": "954174aec50b0ee921b8088193022c46f5400cf8", "title": "Graph-Based RDF Data Management"}, {"paperId": "5c6c4ac19f77bf319ea8ce91baf90613b1e9cbf7", "title": "Accelerating SPARQL Queries and Analytics on RDF Data"}, {"paperId": "f0a2cb2dc684df26d118cf69030ed3408d3812f6", "title": "A Survey of RDF Data Management Systems"}, {"paperId": "f375f5627a1df32eb6fbff25c4d43df0bd755ea1", "title": "A survey of RDF data management systems"}, {"paperId": "c544fb23e4380e3fa93631c3d607569bcac022a0", "title": "Database Integration—Multidatabase Systems"}, {"paperId": "0afb2a839f2cfd7b4cf2455b70651a19871979ab", "title": "Distributed and Parallel Database Design"}, {"paperId": "c517a44f9c8685790958c0ec7b9b3502c58ff4e3", "title": "Using INMDB for the Semantic Web"}]}
