{"paperId": "467dab94043aef59438f9212d15996566454593c", "publicationVenue": null, "title": "Large Scale and Parallel Sentiment Analysis Based on Label Propagation in Twitter Data", "abstract": "Sentiment analysis is a promising branch in natural language processing, but it becomes challenging when dealing with data from Twitter due to the big volume, rapidly changing language style and a lack of training data. As a result, it is difficult to utilize the traditional lexicon-based approach and supervised learning method for the problems mentioned above. In this paper, we propose the label propagation algorithm in order to solve the last two problems based on graph structure and apply GraphX, an API in Spark framework for graph parallel computing, to address the first problem. The results show that the label propagation algorithm is robust and scalable in our parallel implementation. Meanwhile, our approach which utilizes the lexicon and noisy label like emoticons outperform the baseline significantly. For the future works, we plan to test more algorithms in clusters and optimize the way of taking advantage of the social network by adding a community detection procedure before the classification to improve the accuracy.", "venue": "2018 17th IEEE International Conference On Trust, Security And Privacy In Computing And Communications/ 12th IEEE International Conference On Big Data Science And Engineering (TrustCom/BigDataSE)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-08-01", "journal": {"name": "2018 17th IEEE International Conference On Trust, Security And Privacy In Computing And Communications/ 12th IEEE International Conference On Big Data Science And Engineering (TrustCom/BigDataSE)", "pages": "1791-1798"}, "authors": [{"authorId": "2108619242", "name": "Yibing Yang"}, {"authorId": "31141756", "name": "M. O. Shafiq"}], "citations": [{"paperId": "616bab9221cb934d2897b50916feed03f9de9b18", "title": "Deceptive opinion spam detection approaches: a literature survey"}, {"paperId": "760004955410fd626dc7d99a682bd2646e965cd0", "title": "Semi-supervised learning approaches for predicting South African political sentiment for local government elections"}, {"paperId": "3becfa343eb3b3a914e8578e514014d36f9da1bc", "title": "Semi-Supervised Sentiment Classification on E-Commerce Reviews Using Tripartite Graph and Clustering"}, {"paperId": "822d89768fef9eabc0c1690e19fb10266382b616", "title": "Optimizing global processing time in the detection of patterns related to suicide in social networks"}, {"paperId": "86ef744287dd8564177996de9cb809fd1268d631", "title": "Classification of multi-lingual tweets, into multi-class model using Naïve Bayes and semi-supervised learning"}, {"paperId": "aa8db4a77b5e304e960ed4fca6801b6c179b14af", "title": "Identifying High Value Users in Twitter Based on Text Mining Approaches"}, {"paperId": "ab33b006df22dd5ecd4f93dfdec93a4c7843e993", "title": "Analyzing the effectiveness of semi-supervised learning approaches for opinion spam classification"}, {"paperId": "3f97bc142e1dbc16a529d075aaa8fb364e6eb21f", "title": "Data Scarcity: Methods to Improve the Quality of Text Classification"}]}
