{"paperId": "4692960b0423e297fe9404d0315a899dbcac7357", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data science and Machine learning in the Clouds: A Perspective for the Future", "abstract": "As we are fast approaching the beginning of a paradigm shift in the field of science, Data driven science (the so called fourth science paradigm) is going to be the driving force in research and innovation. From medicine to biodiversity and astronomy to geology, all these terms are somehow going to be affected by this paradigm shift. The huge amount of data to be processed under this new paradigm will be a major concern in the future and one will strongly require cloud based services in all the aspects of these computations (from storage to compute and other services). Another aspect will be energy consumption and performance of prediction jobs and tasks within such a scientific paradigm which will change the way one sees computation. Data science has heavily impacted or rather triggered the emergence of Machine Learning, Signal/Image/Video processing related algorithms, Artificial intelligence, Robotics, health informatics, geoinformatics, and many more such areas of interest. Hence, we envisage an era where Data science can deliver its promises with the help of the existing cloud based platforms and services with the addition of new services. In this article, we discuss about data driven science and Machine learning and how they are going to be linked through cloud based services in the future. It also discusses the rise of paradigms like approximate computing, quantum computing and many more in recent times and their applicability in big data processing, data science, analytics, prediction and machine learning in the cloud environments.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-02", "journal": {"name": "ArXiv", "volume": "abs/2109.01661"}, "authors": [{"authorId": "71545750", "name": "H. Barua"}], "citations": [{"paperId": "30101e8bea3ad990f266e2a9002c83dc4091b1a6", "title": "Private and Reliable Neural Network Inference"}, {"paperId": "5a065a57b6b1750048a007fbdec3ce81ba7e9fac", "title": "Green Computing for Big Data and Machine Learning"}, {"paperId": "3bf5bbe5014caf77a49e1c3d0e5de055c45baea2", "title": "Cloud Mining Actionable Pattern Discovery in Big Data: A Survey"}]}
