{"paperId": "46939ebcb1f37a1aa3b74150bbf22f908566b099", "publicationVenue": null, "title": "Smart farming and short food supply chains: Are they compatible?", "abstract": null, "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-05-01", "journal": {"name": "Land Use Policy", "pages": "104541", "volume": "94"}, "authors": [{"authorId": "16090849", "name": "Evagelos D. Lioutas"}, {"authorId": "52584375", "name": "C. Charatsari"}], "citations": [{"paperId": "213e617b1f930a220b0211cb6d07a4946b27de82", "title": "Towards twin transition in the agri-food sector? Framing the current debate on sustainability and digitalisation"}, {"paperId": "98cfe786cf7829c6177b00ec052eebe260d4df63", "title": "Farmers’ Transition to Climate-Smart Agriculture: A Systematic Review of the Decision-Making Factors Affecting Adoption"}, {"paperId": "80a34ccbc6ba261d212834450ae86f5f0777b619", "title": "Feminist political ecologies of agrarian technologies: knowing the digital differently"}, {"paperId": "3c12e698eaf9627e9ba7fb380363720a5414c50b", "title": "Integrated Route-Planning System for Agricultural Robots"}, {"paperId": "2c43167c13a7f18c226d7b945c8efafa56ef53f3", "title": "Exploring farmers' perceptions of the technological characteristics of traceability systems"}, {"paperId": "a760b10cf1c9176a993a4f1e8280393044b3ae81", "title": "Participative assessment of agroecological short food supply chains and proposals for improvement: a case study of Andalusia (Spain)"}, {"paperId": "48bd3354c5bd765af3675a00fd54eb55027b38d3", "title": "A First View on the Competencies and Training Needs of Farmers Working with and Researchers Working on Precision Agriculture Technologies"}, {"paperId": "d378725763572a1aa53eac89bea4a65813aeba81", "title": "Do Agricultural Knowledge and Innovation Systems Have the Dynamic Capabilities to Guide the Digital Transition of Short Food Supply Chains?"}, {"paperId": "90155fc7899a39549e3da12eb3d9540cf360e123", "title": "Consumer perception of food value: A comparative study of global supermarkets and local farmers' markets in Slovakia"}, {"paperId": "84307b29577991e47ed7f4c8f4c587bfd4fd8395", "title": "Shortening food supply chain in home-grown school feeding: experiences and lessons from south central China"}, {"paperId": "b5ef3822c114edb982d0d5641fe555290473e25d", "title": "Competencies Needed for Guiding the Digital Transition of Agriculture: Are Future Advisors Well-Equipped?"}, {"paperId": "2cc04b79227a8f6c4483ee94da2d3c7394b318ec", "title": "Adoption of smart farming technologies in field operations: A systematic review and future research agenda"}, {"paperId": "0dc5c3b61026f0602cdbe1674b669a74bc2d9096", "title": "Market growth strategies for sustainable smart farm: A correlation and causal relationship approach"}, {"paperId": "94f5ebbc0b595c10aa4b1afe3a69e1e9192bc008", "title": "Implementation of information and communication technologies in fruit and vegetable supply chain: a systematic literature review"}, {"paperId": "81eb51d6bb8976e10dcc92bd1b5e18f35c93530b", "title": "Facets of value emerging through the operation of short food supply chains"}, {"paperId": "53fb864f129fe0a7edfb2f486e68a125180f0ea3", "title": "Intelligent push method of agricultural talents teaching resources based on association rule"}, {"paperId": "0d45bb1a6b81b99bb40209a3fede1f8bbfb892ff", "title": "Quality evaluation method of agricultural talents training based on improved random forest algorithm"}, {"paperId": "603effc04e81a1a5425a8c89cb6f0864095eec66", "title": "Farmers' perception of barriers that difficult the implementation of agriculture 4.0"}, {"paperId": "df5ba52baf2ddb3e4e93824febfe784cd803f8a8", "title": "Investigating narratives and trends in digital agriculture: A scoping study of social and behavioural science studies"}, {"paperId": "7f516a18fd3695fb2c3b7d95e4484826e33af35d", "title": "Optimization of food-energy-water-waste nexus in a sustainable food supply chain under the COVID-19 pandemic: a case study in Iran"}, {"paperId": "58c46a507eb3da4cf38f744b3223aefaf825ef02", "title": "Differential Strategies of Continuous Agri-Product Supply Chain Considering Consumer Perception of Eco-Quality"}, {"paperId": "b618f0582a1378de3e47dee790b4c9ecf079815e", "title": "Artificial intelligence in sensory and consumer studies of food products"}, {"paperId": "c2d766b77d5ffa23b3942b0995598a4925c25e08", "title": "Gouvernance responsable de l’innovation et durabilité : le cas de l’agriculture numérique"}, {"paperId": "c9cafb4d043f7b48ffa3b2187623e27919213089", "title": "A review of multi-scale barriers to transitioning from digital agriculture to a digital bioeconomy"}, {"paperId": "806f16cf03928700ff9abb0ec69c608a2113d041", "title": "Short supply chain, technical efficiency, and technological change: Insights from cucumber production"}, {"paperId": "c4baaa03a450eb751371bcd29f93ea79090f0dc5", "title": "The role of public policies in the digitalisation of the agri-food sector. A systematic review"}, {"paperId": "be7fa51dc28c25cde06f3acc50f6f24741e677c6", "title": "Scoping Challenges and Opportunities Presented by COVID-19 for the Development of Sustainable Short Food Supply Chains"}, {"paperId": "b2cde41900db47fc55fb5fd9e1b8ab7cb6bfac6e", "title": "Autonomous agriculture in public perception - German consumer segments' view of crop robots"}, {"paperId": "bcd16f2d1c0275090f7b0ce725a1ed449f20ceda", "title": "The impact of global risks on supply chain performance. An empirical study on construction sector in the COVID-19 pandemic"}, {"paperId": "7a56cf65c6870d1b2d14e1681987f18e30c83a35", "title": "Mountain Food Products: A Cluster Analysis Based on Young Consumers’ Perceptions"}, {"paperId": "350b0804c78317b172329434212bb8043ce2b4cb", "title": "The Human Perspective in Consumer Ethics and Animal Welfare Issues: Envisioning a Future for Change"}, {"paperId": "fe263896870077d1731d64f8a78213a841c6b57c", "title": "Understanding social innovation in short food supply chains: an exploratory analysis"}, {"paperId": "418da4363dfa94651cac0cf12e2528a1836d0cad", "title": "CAN CLIMATE-SMART AGRICULTURE HELP TO ASSURE FOOD SECURITY THROUGH SHORT SUPPLY CHAINS? A SYSTEMATIC BIBLIOMETRIC AND BIBLIOGRAPHIC LITERATURE REVIEW"}, {"paperId": "4d893fbf7cd1e6a2ec7cf1bbb961cb4d7e597ff4", "title": "Technological Innovation and Agrifood Systems Resilience: The Potential and Perils of Three Different Strategies"}, {"paperId": "d049a5418850d27ddb47417c5e77fcea477e83c0", "title": "Short Food Supply Chains in Europe: Scientific Research Directions"}, {"paperId": "961b4a2e16dcf65eb90f79740174d74dd26c4c86", "title": "The Role of Internet Development in China’s Grain Production: Specific Path and Dialectical Perspective"}, {"paperId": "2d006b72d83453fc5cd6f1a4d6d6b101b4fd29d8", "title": "Issues and Challenges in Short Food Supply Chains: A Systematic Literature Review"}, {"paperId": "138dc012022d351b6beac2c03cb8aa4b94916dcc", "title": "What are the priority research questions for digital agriculture?"}, {"paperId": "ea4de0268cd3828ad5f8429c861b00275ca782de", "title": "Estimate and Temporal Monitoring of Height and Diameter of the Canopy of Recently Transplanted Coffee by a Remotely Piloted Aircraft System"}, {"paperId": "cba24397bf9bb8ec88b653b390e19b39ce8e1384", "title": "Does direct farm marketing fulfill its promises? analyzing job satisfaction among direct-market farmers in Canada"}, {"paperId": "383e604c85174061cb47d845d028cba71a6b21fd", "title": "Unlocking adoption challenges of IoT in Indian Agricultural and Food Supply Chain"}, {"paperId": "b574d69f36e73a485b8fda5464c789b29a8382af", "title": "Smart Agriculture and Food Industry with Blockchain and Artificial Intelligence"}, {"paperId": "197534316c10a76eb0dd3af8a258e341d0551a84", "title": "Digital Strategy Decision Support Systems: Agrifood Supply Chain Management in SMEs"}, {"paperId": "fd43a9131501ad2b0d6358af5209fc21783e2cae", "title": "Towards Smart Farming Solutions in the U.S. and South Korea: A Comparison of the Current Status"}, {"paperId": "52829da18e06f337c8ea9bfcafb99ac272456414", "title": "Food Supply Chain Transformation through Technology and Future Research Directions—A Systematic Review"}, {"paperId": "22b542ef9328492e8707047167b99d791e701642", "title": "Digitalization and Future Agro-Food Supply Chain Management: A Literature-Based Implications"}, {"paperId": "2c6eb13853d04cabb70bfcdf28690e8887e76d00", "title": "Digitalization of agriculture: A way to solve the food problem or a trolley dilemma?"}, {"paperId": "06f307ffec1179843a0e140e8f8a4ce7036dffbe", "title": "Digital technologies (DT) adoption in agri-food supply chains amidst COVID-19: an approach towards food security concerns in developing countries"}, {"paperId": "a2be7aeec306b52edd57af55cc6f768f4801819f", "title": "Understanding the implications of equity crowdfunding on sustainability-oriented innovation and changes in agri-food systems: Insights into an open innovation approach"}, {"paperId": "d717eb5d033b74e0501a9c00e0a7d1e7e9de5995", "title": "Digital transformation of the agrifood system: Quantifying the conditioning factors to inform policy planning in the olive sector"}, {"paperId": "6c19a4f92cd2e813e76ac7f89ae3d316432f9b9f", "title": "Distribución de alimentos de los comités de vaso de leche: programa social desarrollado por la municipalidad provincial de San Martín"}, {"paperId": "8470181fa55840a0ce28aca02fa9ae1f0ecf330b", "title": "Review: Anticipating alternative trajectories for responsible Agriculture 4.0 innovation in livestock systems."}, {"paperId": "5f4634aa233231551b832729ac753fdfd0dd8f11", "title": "Agri-Food 4.0 and Innovations: Revamping the Supply Chain Operations"}, {"paperId": "a95d9df0d5f92755109b70ba3c2bed09504eb926", "title": "The Root towards More Circularized Animal Production Systems: From Animal to Territorial Metabolism"}, {"paperId": "af154b5c035a942da822615d927ea89abc2e22fb", "title": "Uncovering research streams on agri-food supply chain management: A bibliometric study"}, {"paperId": "d3829b9f3f8bd37d3bd842dcaa2deff14c243d79", "title": "From Smart Farming towards Unmanned Farms: A New Mode of Agricultural Production"}, {"paperId": "6432a0add754cefc8a2b7e7cd542243c59086354", "title": "A review of industry 4.0 revolution potential in a sustainable and renewable palm oil industry: HAZOP approach"}, {"paperId": "8f1c469c1aa35a39e71c8b3f62343e96a1ca3d3e", "title": "Digital twins in agri-food : Societal and ethical themes and questions for further research"}, {"paperId": "9648784276607a00b4e45487c4e0ccf23d100920", "title": "Towards secure deep learning architecture for smart farming-based applications"}, {"paperId": "9603c317aa07b1668ec06fa8db3bc019375f6151", "title": "Extension and Advisory Organizations on the Road to the Digitalization of Animal Farming: An Organizational Learning Perspective"}, {"paperId": "5b83af54f9e2a27fe194159d7910cb71fde9ab77", "title": "Agriculture supply chain risks and COVID-19: mitigation strategies and implications for the practitioners"}, {"paperId": "1df75b0d7e7e4e57f122a619d1da92d9298ac576", "title": "The future(s) of digital agriculture and sustainable food systems: An analysis of high-level policy documents"}, {"paperId": "27bac371d6f44f46405c910208a7f2d4a88033fa", "title": "Searching for sustainability in the digital agriculture debate: an alternative approach for a systemic transition"}, {"paperId": "b68cdc20d5bb067cb225108cf6a737ef99582dc6", "title": "Peri-Urban Organic Agriculture and Short Food Supply Chains as Drivers for Strengthening City/Region Food Systems—Two Case Studies in Andalucía, Spain"}, {"paperId": "4996545502ce1b6a970c9f9fc4122de5192df430", "title": "Peri-Urban Organic Agriculture and Short Food Supply Chains as Drivers for Strengthening City/Region Food Systems—Two Case Studies in Andalucía, Spain"}, {"paperId": "8049c4fdf67e92b449c67252dc6b17c05a911060", "title": "Smart Farming Prediction System Embedded with the Internet of Things"}, {"paperId": "566c599a7397b80a5812a119c9c42095b19a09f6", "title": "Location matters. Are science and policy arenas facing the Inner Peripheries challenges in EU?"}, {"paperId": "ae7c16169be95bd6464c84c3a0a2d9711746d748", "title": "P RODUCTION E NGINEERING A RCHIVES"}, {"paperId": "13d96c8ea9871f3d35132f862049046b3f18fd65", "title": "Initial Modeling for Smart Farming using Soil Temperature and Humidity"}, {"paperId": "fb40946f0eb5acf226571c637f1af88580828a2c", "title": "Blockchain Enabled Quality Management in Short Food Supply Chains"}, {"paperId": "24fa69bf10e93b4f17ebd07e51dddf88dd3ab0a4", "title": "DIGITAL TRANSFORMATION OF FOOD PRODUCTION IN EUROPE AND OPPORTUNITIES FOR ITS ADAPTATION IN BULGARIA"}, {"paperId": "75ddabaf3f512b6ee12204fdf30350f48403c538", "title": "Prioritising Requirements of Informational Short Food Supply Chain Platforms Using a Fuzzy Approach"}, {"paperId": "1fc5f411339b8a33959e44ab20e3bfdc9ca9622a", "title": "Editorial to the Special Edition on AGRICULTURE 4.0 of the Revista Ciência Agronômica"}, {"paperId": "b48bb540b3f092a2e59acdea6f3cb3f8222408ae", "title": "Agriculture 4.0: a terminological introduction"}]}
