{"paperId": "469438d82c2757faf938343e3811bfc1d69d7439", "publicationVenue": {"id": "44c99d16-ba02-4ef6-aa1f-ed03f91da4cc", "name": "Natural Hazards and Earth System Sciences", "type": "journal", "alternate_names": ["Nat Hazard Earth Syst Sci", "Natural Hazards and Earth System Science"], "issn": "1561-8633", "url": "https://www.nat-hazards-earth-syst-sci.net/volumes_and_issues.html", "alternate_urls": ["https://www.natural-hazards-and-earth-system-sciences.net/", "https://www.natural-hazards-and-earth-system-sciences.net/home.html"]}, "title": "Characteristics and causes of natural and human-induced landslides in a tropical mountainous region: the rift flank west of Lake Kivu (Democratic Republic of the Congo)", "abstract": "Abstract. Tropical mountainous regions are often identified as landslide hotspots with\ngrowing population pressure. Anthropogenic factors are assumed to play a\nrole in the occurrence of landslides in these densely populated regions, yet\nthe relative importance of these human-induced factors remains poorly\ndocumented. In this work, we aim to explore the impact of forest cover\ndynamics, roads and mining activities on the characteristics and causes of\nlandslides in the rift flank west of Lake Kivu in the Democratic Republic of the Congo (DR Congo). To do so, we\ncompile a comprehensive multi-temporal inventory of 2730 landslides. The\nlandslides are of different types and are grouped into five categories that\nare adapted to study the impact of human activities on slope stability: old\n(pre-1950s) and recent (post-1950s) deep-seated landslides, shallow\nlandslides, landslides associated with mining and landslides associated with road\nconstruction. We analyse the landslides according to this classification\nprotocol via frequency–area statistics, frequency ratio distribution and\nlogistic regression susceptibility assessment. We find that natural factors\ncontributing to the cause of recent and old deep-seated landslides were\neither different or changed over time. Under similar topographic conditions,\nshallow landslides are more frequent, but of a smaller size, in areas where\ndeforestation has occurred since the 1950s. We attribute this size\nreduction to the decrease in regolith cohesion due to forest loss, which\nallows for a smaller minimum critical area for landsliding. In areas that\nwere already deforested in the 1950s, shallow landslides are less frequent,\nlarger and occur on less steep slopes. This suggests a combined role\nbetween regolith availability and soil management practices that influence\nerosion and water infiltration. Mining activities increase the odds of\nlandsliding. Landslides associated with mining and roads are larger than\nshallow landslides but smaller than the recent deep-seated instabilities,\nand they are controlled by environmental factors that are not present under\nnatural conditions. Our analysis demonstrates the role of human activities\non the occurrence of landslides in the Lake Kivu region. Overall, it\nhighlights the need to consider this context when studying hillslope\ninstability characteristics and distribution patterns in regions under\nanthropogenic pressure. Our work also highlights the importance of using\nlandslide classification criteria adapted to the context of the\nAnthropocene.\n", "venue": "Natural Hazards and Earth System Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-10", "journal": {"name": "Natural Hazards and Earth System Sciences"}, "authors": [{"authorId": "1459887554", "name": "Jean-Claude Maki Mateso"}, {"authorId": "2837653", "name": "C. Bielders"}, {"authorId": "41032759", "name": "E. Monsieurs"}, {"authorId": "153580126", "name": "Arthur Depicker"}, {"authorId": "3090035", "name": "B. Smets"}, {"authorId": "2100831556", "name": "T. Tambala"}, {"authorId": "2124202353", "name": "Luc Bagalwa Mateso"}, {"authorId": "2612487", "name": "O. Dewitte"}], "citations": [{"paperId": "38671c3d0e3bf9d9ea5a850d02d85ce049eb61f5", "title": "Geospatial assessment of landslide-prone areas in the southern part of Anambra State, Nigeria using classical statistical models"}, {"paperId": "8b74ffba4d1aae0dd62ddc7375fb9f1b7c46ae3a", "title": "Mobilization rates of landslides in a changing tropical environment: 60-year record over a large region of the East African Rift"}, {"paperId": "32b04e923cefc64d35be6e1a8246e8990d3e74d1", "title": "Understanding fatal landslides at global scales: a summary of topographic, climatic, and anthropogenic perspectives"}, {"paperId": "68b865c6fa9934fd475bd21ae5aa8f6e220d3f4c", "title": "Event-based rainfall-induced landslide inventories and rainfall thresholds for Malawi"}, {"paperId": "121d243346de6ad1ff27e7fa5c46634def8fae06", "title": "Landslides, bedrock incision and human-induced environmental changes in an extremely rapidly formed tropical river gorge"}, {"paperId": "4e03f4e3547e3edfd6185d67209eb27f9ed4501f", "title": "Landslide hazard assessment and mapping at national scale for Malawi"}, {"paperId": "6c9014fb3863f68a069ff0bf826bb9e6bc5078e1", "title": "Landslide topology uncovers failure movements"}, {"paperId": "b3ffcf6a99cfd5e8ec73bc2f2b4ca70f336880f1", "title": "The Open Landslide Project (OLP), a New Inventory of Shallow Landslides for Susceptibility Models: The Autumn 2019 Extreme Rainfall Event in the Langhe-Monferrato Region (Northwestern Italy)"}, {"paperId": "c46f620db446f36eff8c55e130a04d9434d94230", "title": "Ensemble models based on radial basis function network for landslide susceptibility mapping"}, {"paperId": "82eb6738401a8ecb3fce3dc2565da30c3cb039a0", "title": "Spatial analysis of landscape rehabilitation in degraded land along topographic variabilities in the Kiliso sub-watershed, Southern Ethiopia"}]}
