{"paperId": "469c533f6c021c8560a68f629662636a4fceaee2", "publicationVenue": {"id": "9c093dbf-5b9b-4ede-b30c-9c38b355d1a9", "name": "Water Resources Research", "type": "journal", "alternate_names": ["Water Resour Res"], "issn": "0043-1397", "url": "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1944-7973", "alternate_urls": ["http://agupubs.onlinelibrary.wiley.com/agu/journal/10.1002/(ISSN)1944-7973/", "https://agupubs.onlinelibrary.wiley.com/journal/19447973", "http://www.agu.org/journals/wr/"]}, "title": "Estimation of Intensity‐Duration‐Area‐Frequency Relationships Based on the Full Range of Non‐Zero Precipitation From Radar‐Reanalysis Data", "abstract": "Intensity‐Duration‐Area‐Frequency (IDAF) models provide the mathematical link between precipitation intensities (I), durations (D), areas (A), and frequency of occurrence (F). They play a critical role in hydrological design, areal rainfall hazard quantification, storm characterization, and early warning system development. IDAF models extend the conventional Intensity‐Duration‐Frequency models by accounting for the spatial extent of precipitation (i.e., the area). In this study, we develop IDAF models using the entire non‐zero precipitation intensities, not only the extremes. We use the extended generalized Pareto distribution (EGPD) to model the precipitation intensities. To build the IDAF models, we adopt a data‐driven approach that allows the linkage of EGPD parameters with duration and area, based on empirically determined parametric relationships. The inference of model parameters is done using a global maximum likelihood estimation, and uncertainties are assessed by the bootstrap method. The study area is Switzerland, a topographically complex region of 42,000 km2 with regional precipitation variability and clear seasonality. The study utilizes 17 years of data from CombiPrecip, a radar‐reanalysis product developed by geostatistically merging radar and rain gauge data in an operational setting. We build the IDAF models for the spatiotemporal range of 1–72 hr and 1 to 1,089 km2 at each pixel in the study area. To the best of our knowledge, our study is the first attempt to use the EGPD in IDAF curve modeling. It discusses the use and limitations of CombiPrecip in extreme value analysis and highlights the challenges of modeling areal precipitation in a complex topographical environment.", "venue": "Water Resources Research", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Water Resources Research"}, "authors": [{"authorId": "115445031", "name": "A. Haruna"}, {"authorId": "2256177905", "name": "Juliette Blanchet"}, {"authorId": "39392363", "name": "A. Favre"}], "citations": []}
