{"paperId": "46a586b0ce1b565e96886e8e2193ad728ef374d8", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "Advanced, Privacy-Preserving and Approximate Big Data Management and Analytics in Distributed Environments: What is Now and What is Next", "abstract": "Nowadays, big data management and analytics are gaining momentum within the research community, stirred-up by both sophisticated theoretical models and pragmatic achievements mainly appearing in the target Cloud-based applications and systems. In this so-delineated context, three top-class topics have emerged in the literature: (i) advanced big data management and analytics in distributed environments; (ii) privacy-preserving big data management and analytics in distributed environments; (iii) approximate big-data-management-and-analytics techniques and algorithms over uncertain and imprecise big data repositories in distributed environments. These critical topics are now heavily influencing the research community, and will play more and more a first-class role in actual and future research experiences. Following this clear evidence, in this paper we provide the current state-of-the-art on the reference topics, along with considerations for driving future research efforts in the field.", "venue": "Annual International Computer Software and Applications Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE 44th Annual Computers, Software, and Applications Conference (COMPSAC)", "pages": "1564-1568"}, "authors": [{"authorId": "145046124", "name": "A. Cuzzocrea"}], "citations": [{"paperId": "7345ffdda0036065121fce6b13946441cb8df32d", "title": "Innovative Paradigms for Supporting Privacy-Preserving Multidimensional Big Healthcare Data Management and Analytics: The Case of the EU H2020 QUALITOP Research Project"}]}
