{"paperId": "46b8c9a17f68a88b8efb22fd3fbebf123d5a6832", "publicationVenue": {"id": "e99415ea-f28f-4d26-b81b-630e82b5681e", "name": "Brazilian Conference on Intelligent Systems", "type": "conference", "alternate_names": ["Braz Conf Intell Syst", "BRACIS"]}, "title": "Using Clustering in Eye-Tracking Calibration Task", "abstract": "In eye-tracking experiments with primates, infants or non-cooperating subjects, the data used during the calibration step generally suffers from high contamination. This contamination typically behaves as clusters, corresponding to the periods in which the subject was not actually looking at the calibration target. In this type of multimodal samples, most techniques used to estimate the central point of the distribution usually fail, resulting in errors when mapping the gaze from the camera to the screen coordinates. In this manuscript, we analyze the viability of using clustering algorithms to find the center of the main cluster, corresponding to the main mode of a multivariate distribution, which will serve as the reference position for calibration. Those algorithms were compared using simulated data mimicking the spatial characteristics of eye-tracking typical patterns. More specifically mixtures of bi-variate Gaussians and Uniform distribution, with different number of clusters, variances, co-variances, percentage of samples in the main cluster and proportion of uniform noise. Then, the validation of these clustering-based techniques was conducted on experimental data from eye-tracking calibrations performed by Capuchin monkeys.", "venue": "Brazilian Conference on Intelligent Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 8th Brazilian Conference on Intelligent Systems (BRACIS)", "pages": "627-632"}, "authors": [{"authorId": "2099954", "name": "Adrien Brilhault"}, {"authorId": "40291590", "name": "S. Neuenschwander"}, {"authorId": "3336561", "name": "Ricardo Rios"}], "citations": [{"paperId": "64971dfa17a228b415b603ca9884488c3645091e", "title": "A new robust multivariate mode estimator for eye-tracking calibration"}]}
