{"paperId": "46c486ce42ae0d57812b611f7a5b295dc0f92a93", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Twitter-Lived Red Tide Crisis on Chiloé Island, Chile: What Can Be Obtained for Social-Ecological Research through Social Media Analysis?", "abstract": "Considering traditional research on social-ecological crises, new social media analysis, particularly Twitter data, contributes with supplementary exploration techniques. In this article, we argue that a social media approach to social-ecological crises can offer an actor-centered meaningful perspective on social facts, a depiction of the general dynamics of meaning making that takes place among actors, and a systemic view of actors’ communication before, during and after the crisis. On the basis of a multi-technique approach to Twitter data (TF-IDF, hierarchical clustering, egocentric networks and principal component analysis) applied to a red tide crisis on Chiloé Island, Chile, in 2016, the most significant red tide in South America ever, we offer a view on the boundaries and dynamics of meaning making in a social-ecological crisis. We conclude that this dynamics shows a permanent reflexive work on elucidating the causes and effects of the crisis that develops according to actors’ commitments, the sequence of events, and political conveniences. In this vein, social media analysis does not replace good qualitative research, it rather opens up supplementary possibilities for capturing meanings from the past that cannot be retrieved otherwise. This is particularly relevant for studying social-ecological crises and supporting collective learning processes that point towards increased resilience capacities and more sustainable trajectories in affected communities.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2020-10-15", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2079104711", "name": "Aldo Mascareño"}, {"authorId": "7520001", "name": "Pablo A. Henríquez"}, {"authorId": "1960473", "name": "M. Billi"}, {"authorId": "1797726", "name": "G. A. Ruz"}], "citations": [{"paperId": "6e36a7725d2fa8f6d7308e9128f14d6c91b07f8a", "title": "What's in a name? Political and economic concepts differ in social media references to harmful algae blooms."}, {"paperId": "e3616c17daa11a86201c8f89dc20ea62d7943a87", "title": "Mythical Infrastructuring"}, {"paperId": "ca8eb601e94eb166d82a81d322ddf6b3305f0aa8", "title": "Advancing recognition justice in telecoupled critical mineral supply chains: The promise of social media"}, {"paperId": "f71453499c8f7345428db6c61c3f63a111c4542e", "title": "Learning from crises? The long and winding road of the salmon industry in Chiloé Island, Chile"}, {"paperId": "46964b1104af4aebc83ba95e2281d8ec4e8429b9", "title": "How Advanced Technological Approaches Are Reshaping Sustainable Social Media Crisis Management and Communication: A Systematic Review"}, {"paperId": "5516f58a0199c02e6b1fa6d077ff20914e232c14", "title": "Critical Transitions in Ecosystems and Society. The Contribution of Sociological Systems Theory to the Analysis of Socio-Environmental Transformations"}, {"paperId": "2bcdcee374212c095449eb9977be69b24161cac8", "title": "Collective capabilities shape the co-production of nature’s contributions to people in the alpine agricultural system of the Maurienne valley, France"}, {"paperId": "954a5b702c7d63ed27b0cd08419e63f3b6a216f9", "title": "The Emotions of the Outbreak. Topics, Sentiments and Politics on Twitter During Chilean October"}, {"paperId": "0bc29c9fd9c3fdcfb608026e99f7b6ef617820b9", "title": "Exploring Negative Spillover Effects on Stakeholders: A Case Study on Social Media Talk about Crisis in the Food Industry Using Data Mining"}, {"paperId": "4a32f7433abd1a7c1801ff2c6ecf4f8f4324c56d", "title": "Using Localized Twitter Activity for Red Tide Impact Assessment"}, {"paperId": "070b46083f9006d362cd411eb87e4233857b270b", "title": "Close to the Edge: From Crisis To Critical Transitions in Social Systems Theory"}, {"paperId": "2779166b088bdac79c1a0346ba5a8e119472e63a", "title": "SIPRI Insights on Peace and Security"}, {"paperId": "eb1295c054907e8d8ee0a096ede0d900e52d7e2a", "title": "Mythical Infrastructuring The Work of Stories in the Making of the Chacao Bridge, Southern Chile"}, {"paperId": "5e6da97a65c2960f215cca164e68967d203bd5c6", "title": "Research on the Changing Trend of Employment-Relevant Terms Based on Internet Big Data Analysis"}]}
