{"paperId": "46c72d5250be5c9bd402928856a8877c7ab3bc0c", "publicationVenue": {"id": "58f3d4ea-da1a-4755-85de-db89c331483c", "name": "International Journal of Advances in Applied Sciences", "type": "journal", "alternate_names": ["Int J Adv Appl Sci", "International Journal of Advanced and Applied Sciences"], "issn": "2252-8814", "alternate_issns": ["2313-3724"], "url": "http://www.iaesjournal.com/online/index.php/IJAAS", "alternate_urls": ["http://www.science-gate.com/IJAAS.html", "http://iaesjournal.com/online/index.php/IJAAS/issue/archive"]}, "title": "Dependability in fog computing: Challenges and solutions", "abstract": "The tremendous increase in IoT devices and the amount of data they produced is very expensive to be processed at cloud data centers. Therefore, fog computing was introduced in 2012 by Cisco as a decentralized computing environment that is considered to be more efficient in handling such a plethora in the number of requests. Fog computing is a distributed computing paradigm that focuses on bringing data processing at the network peripheral to reduce response time and increase the quality of service. Dependability challenges of such distributed and heterogeneous computing environments are considered in this paper. Because fog computing is a new computing paradigm, several studies have been presented to tackle its challenges and issues. However, dependability in specific did not receive much attention. In the paper, we explore several solutions to increase dependability in fog computing such as fault tolerance techniques, placement policies, middleware, and data management mechanisms aiming to help system designers choose the most appropriate solution.", "venue": "International Journal of Advances in Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-01", "journal": {"name": "International Journal of ADVANCED AND APPLIED SCIENCES"}, "authors": [{"authorId": "2167413854", "name": "Alraddady"}], "citations": [{"paperId": "d052152f3ae1e56c401480f3092e6724cf40531b", "title": "HBI-LB: A Dependable Fault-Tolerant Load Balancing Approach for Fog based Internet-of-Things Environment"}]}
