{"paperId": "46caf191da92fbff96b95be32897686e1e53b081", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Divergent Selection Task Offloading Strategy for Connected Vehicles Based on Incentive Mechanism", "abstract": "With the improvements in the intelligent level of connected vehicles (CVs), travelers can enjoy services such as self-driving, self-parking and audiovisual entertainment inside the vehicle, which place extremely high demands on the computing power of onboard systems (OBSs). However, the arithmetic power of a single CV often cannot meet the diverse service demands of the in-vehicle system. As a new computing paradigm, task offloading based on vehicular edge computing has significant advantages in remedying the shortcomings of single-CV computing power and balancing the allocation of computing resources. This paper studied the computational task offloading of high-speed connected vehicles without the help of roadside edge servers in certain geographic areas. User vehicles (UVs) with insufficient computing power offload some of their computational tasks to nearby CVs with abundant resources. We explored the high-speed driving model and task classification model of CVs to refine the task offloading process. Additionally, inspired by game theory, we designed a divergent selection task offloading strategy based on an incentive mechanism (DSIM), in which we balanced the interests of both the user vehicle and service vehicles. CVs that contribute resources are rewarded to motivate more CVs to join. A DSIM algorithm based on a divergent greedy algorithm was introduced to maximize the total rewards of all volunteer vehicles while respecting the will of both the user vehicle and service vehicles. The experimental simulation results showed that, compared with several existing studies, our approach can always obtain the highest reward for service vehicles and lowest latency for user vehicles.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2158193865", "name": "Senyu Yu"}, {"authorId": "37104595", "name": "Yan Guo"}, {"authorId": "1492121686", "name": "Ning Li"}, {"authorId": "2052270501", "name": "Duan Xue"}, {"authorId": "2216714513", "name": "Hao Yuan"}], "citations": []}
