{"paperId": "46d52a75973933a82a25f473a9c166492057fe63", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Evaluation of neural network models for landslide susceptibility assessment", "abstract": "ABSTRACT Identifying and assessing the disaster risk of landslide-prone regions is very critical for disaster prevention and mitigation. Owning to their special advantages, neural network algorithms have been widely used for landslide susceptibility mapping (LSM) in recent decades. In the present study, three advanced neural network models popularly used in relevant studies, i.e. artificial neural network (ANN), one dimensional convolutional neural network (1D CNN) and recurrent neural network (RNN), were evaluated and compared for LSM practice over the Qingchuan County, Sichuan province, China. Extensive experimental results demonstrated satisfactory performances of these three neural network models in accurately predicting susceptible regions. Specifically, ANN and 1D CNN models yielded quite consistent LSM results but slightly differed from those of RNN model spatially. Nevertheless, accuracy evaluations revealed that the RNN model outperformed the other two models both qualitatively and quantitatively but its complexity was relatively high. Experiments concerning training hyper-parameters on the performance of neural network models for LSM suggested that relatively small batch size values with Tanh activation function and SGD optimizer are essential to improve the performance of neural network models for LSM, which may provide a thread to help those who apply these advanced algorithms to improve their efficiency.", "venue": "International Journal of Digital Earth", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-19", "journal": {"name": "International Journal of Digital Earth", "pages": "934 - 953", "volume": "15"}, "authors": [{"authorId": "66613015", "name": "Yaning Yi"}, {"authorId": "3044277", "name": "Wanchang Zhang"}, {"authorId": "29176908", "name": "Xi-wei Xu"}, {"authorId": "47294892", "name": "Zhijie Zhang"}, {"authorId": "2117921642", "name": "Xuan Wu"}], "citations": [{"paperId": "05b72758f64a7105faf718df1f63ce346ced4411", "title": "Application of machine learning in the assessment of landslide susceptibility: A case study of mountainous eastern Mediterranean region, Syria"}, {"paperId": "065fe3cc79811351c95e764e48f86f3ffe081908", "title": "Development of an integrated model for assessing landslide susceptibility on vegetated slopes under random rainfall scenarios"}, {"paperId": "c6f13abfbd07fe5fd4140907c592bd617d8a2036", "title": "Research on the influence of different sampling resolution and spatial resolution in sampling strategy on landslide susceptibility mapping results"}, {"paperId": "81cb61db30a26008572411fd263af08d7b25f4a5", "title": "Verification of 3D DDA-SPH coupling method and its application in the analysis of geological disasters"}, {"paperId": "4795c0f2aa9a142b38ded93c66a280162b6c763b", "title": "Geological Hazard Identification and Susceptibility Assessment Based on MT-InSAR"}, {"paperId": "d91e6dd27dfbde55309fa6dec6e208566bf41225", "title": "Rapid Landslide Extraction from High-Resolution Remote Sensing Images Using SHAP-OPT-XGBoost"}, {"paperId": "281fdd93ccd3b47920f0778a6c08f4cca2c25e3a", "title": "Landslide Susceptibility Analysis on the Vicinity of Bogotá-Villavicencio Road (Eastern Cordillera of the Colombian Andes)"}, {"paperId": "5597ae10957a29fff41e0af5d28833a0aa95d294", "title": "Landslide Susceptibility Prediction from Satellite Data through an Intelligent System based on Deep Learning"}, {"paperId": "42b08944801ffa92ef3daaa5d4a14e48cdaa8b3a", "title": "Regional landslide susceptibility assessment based on improved semi-supervised clustering and deep learning"}, {"paperId": "83120ec1893173c0200a8a6890bdac18229550e3", "title": "Twisting Theory: A New Artificial Adaptive System for Landslide Prediction"}, {"paperId": "f0a790f79f9bbd5b78d869f57e9ebe44b97f1c34", "title": "Examining the Spatially Varying Relationships between Landslide Susceptibility and Conditioning Factors Using a Geographical Random Forest Approach: A Case Study in Liangshan, China"}, {"paperId": "93b8a763d13092c82076ed5dea28e8be3fe2e8f7", "title": "Landslide Detection Using Time-Series InSAR Method along the Kangding-Batang Section of Shanghai-Nyalam Road"}, {"paperId": "21a116ddae1c25190f28b4688acc7bf0cfe4de08", "title": "A Deep Neural Network Framework for Landslide Susceptibility Mapping by Considering Time-Series Rainfall"}]}
