{"paperId": "46e0984fc50082768df708d9e1d31ea26d7261d2", "publicationVenue": null, "title": "The model identification of buildings horizontal displacements with the use of a free geodetic network", "abstract": "The geodetic monitoring of engineering structures, their displacements, and deformations, carried out permanently or periodically, allows obtaining information on the technical condition of facilities. The achieved information enables determining the necessary changes in using objects and minimizing future errors in the similar object’s design. The measurement results are subject to geometric interpretation based on the determined displacement parameters of the object’s shape and the approximation of the vector displacement field. Due to the influence of random factors characterized by a change in time and varying intensity, the deformation measurements performed during the operation of the facilities are of great importance for the safety of structures and engineering structures. In actual tasks of determining the object’s deformation and building a geometric model of displacements, the dominant method is the differential method, the advantage of eliminating systematic errors in measurement results while maintaining the geometric structure of the measurement and control network. The displacement’s geometric model, built based on measurements and calculations, can build a dynamic model of a building object, additionally considering such causes of deformation as, for example, own and usable weight, wind pressure, changes in ambient temperature, or ground vibrations. The article proposes approaches using the free alignment of linear and angular observations made in a geodetic network to determine horizontal displacements of an engineering object. This method may be necessary to study displacements of various parts of the object, thus analyzing its deformation. Free alignment allows for an optimal fit of the equalized network into the approximate network by imposing additional conditions (compared to the classic least squares method) on the vector of estimates of increments to approximate coordinates and the value of the covariance matrix. As an example of applying the proposed approach, the actual data received from the geodetic monitoring of the building structure was used. The structure was a road viaduct located along Wojska Polskiego Street in Bydgoszcz. The object of measurements and analyses was represented by finite sets of fixed points, subject to periodic observations over two years. The authors tested the effectiveness of the proposed algorithm and compared the obtained results with the values of horizontal displacements, which were calculated based on the classic study of geodetic monitoring results using the least-squares method. The accuracy analysis of the obtained values of the geodetic network horizontal displacements using free alignment and the least-squares method was also performed. The results indicate the possibility of using the presented approach to identify the geometric model of horizontal displacements without losing the accuracy of their determination.", "venue": "IOP Conference Series: Earth and Environment", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-11-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "906"}, "authors": [{"authorId": "69489610", "name": "M. Mrówczyńska"}, {"authorId": "89319007", "name": "J. Sztubecki"}, {"authorId": "2143255410", "name": "Zofia Ziçba"}, {"authorId": "73682486", "name": "Izabela Wilczyńska"}], "citations": [{"paperId": "eb7bfee8c30c518951d89640b074c9d757414dfd", "title": "Analysis of using the modified centring plates with eccentric points for geodetic measurements"}, {"paperId": "feafa5965821cae058d1ad672054bbc64369ac6b", "title": "Vertical displacement monitoring using the modified leveling method"}]}
