{"paperId": "46ee405bd0af7e67f8fe990019f8715188f89df6", "publicationVenue": {"id": "c9804a4f-292f-4d93-b2f0-9b5275b100f1", "name": "International Journal of Asian Business and Information Management", "type": "journal", "alternate_names": ["Int J Asian Bus Inf Manag"], "issn": "1947-9646", "url": "http://www.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=1137"}, "title": "Factors Affecting Big Data Adoption: An Empirical Study in Small and Medium Enterprises in Vietnam", "abstract": "This study examined factors impacting the big data adoption of small and medium enterprises (SMEs) in Vietnam. The mixed method study was used. The qualitative research was applied by a group discussion with 15 participants and a cross-sectional survey with 372 representatives of SMEs. The results show that perceived benefit, simplicity, compatibility, data quality, security and privacy, vendor support, management support, financial investment, perceived usefulness, and attitudes toward adoption. This research extended the academic framework and examined causal relationships by adopting new characteristics from the integrated perspective of TOE with TAM beyond the existing research models.", "venue": "International Journal of Asian Business and Information Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Asian Bus. Inf. Manag.", "pages": "1-21", "volume": "13"}, "authors": [{"authorId": "2157574742", "name": "Nguyen Xuan Truong"}], "citations": [{"paperId": "12055baadcee770252ea76e2237c40c95376a7a2", "title": "Determining the Factors Influencing Business Analytics Adoption at Organizational Level: A Systematic Literature Review"}, {"paperId": "7c8db9ea2beba5b274bbcd169fd2ad53393b39e8", "title": "The Dynamics of Cognition Process of Micro, Small, and Medium Enterprises (MSMEs): Evidence From India"}, {"paperId": "ed76dac2c61b3002273cccc6d43c7a1296ffe16a", "title": "Antecedents of Business Analytics Adoption and Impacts on Banks’ Performance: The Perspective of the TOE Framework and Resource-Based View"}]}
