{"paperId": "46ee81606e9c9cbcc73f3534df6d72df0a0ae542", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Reviewing Federated Machine Learning and Its Use in Diseases Prediction", "abstract": "Machine learning (ML) has succeeded in improving our daily routines by enabling automation and improved decision making in a variety of industries such as healthcare, finance, and transportation, resulting in increased efficiency and production. However, the development and widespread use of this technology has been significantly hampered by concerns about data privacy, confidentiality, and sensitivity, particularly in healthcare and finance. The “data hunger” of ML describes how additional data can increase performance and accuracy, which is why this question arises. Federated learning (FL) has emerged as a technology that helps solve the privacy problem by eliminating the need to send data to a primary server and collect it where it is processed and the model is trained. To maintain privacy and improve model performance, FL shares parameters rather than data during training, in contrast to the typical ML practice of sending user data during model development. Although FL is still in its infancy, there are already applications in various industries such as healthcare, finance, transportation, and others. In addition, 32% of companies have implemented or plan to implement federated learning in the next 12–24 months, according to the latest figures from KPMG, which forecasts an increase in investment in this area from USD 107 million in 2020 to USD 538 million in 2025. In this context, this article reviews federated learning, describes it technically, differentiates it from other technologies, and discusses current FL aggregation algorithms. It also discusses the use of FL in the diagnosis of cardiovascular disease, diabetes, and cancer. Finally, the problems hindering progress in this area and future strategies to overcome these limitations are discussed in detail.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2181447214", "name": "Mohammad Moshawrab"}, {"authorId": "34651759", "name": "Mehdi Adda"}, {"authorId": "3112124", "name": "A. Bouzouane"}, {"authorId": "2054762450", "name": "Hussein Ibrahim"}, {"authorId": "2157812", "name": "Ali Raad"}], "citations": [{"paperId": "dbf29d9eaf25d3fda972252a366a490c3a4e1748", "title": "Evaluating end‐users' digital competencies and ethical perceptions of AI systems in the context of sustainable digital banking"}, {"paperId": "f90466b57e4fe3e4b0462f62aa071c8840c3c882", "title": "Sub-clustering based recommendation system for stroke patient: Identification of a specific drug class for a given patient."}, {"paperId": "840a8d81aca475e2f3eb03ddba89f36c79d7a914", "title": "Testing federated analytics across secure data environments using differing statistical approaches on cross-disciplinary data."}, {"paperId": "d5c18e0b01f43ef167e7430a9e50cc78ed1db187", "title": "Ethical Dilemmas in Using AI for Academic Writing and an Example Framework for Peer Review in Nephrology Academia: A Narrative Review"}, {"paperId": "fe23dbea1e25159caf0bf8f714712cc442bc195d", "title": "Innovating Personalized Nephrology Care: Exploring the Potential Utilization of ChatGPT"}, {"paperId": "acc63f5e5d68dbab8019f5e4e290f87619d9d86e", "title": "Federated Learning: Centralized and P2P for a Siamese Deep Learning Model for Diabetes Foot Ulcer Classification"}, {"paperId": "2063593c1da0a1165e91f10c590efa6dd2d7d578", "title": "Unlocking the predictive potential of long non-coding RNAs: a machine learning approach for precise cancer patient prognosis."}, {"paperId": "155b078fafb8ee9c25a6274009a315dbb26933ea", "title": "Edge AI for Early Detection of Chronic Diseases and the Spread of Infectious Diseases: Opportunities, Challenges, and Future Directions"}, {"paperId": "204b3bf6db26a85b147bba839cbb97c3ee2d0cb0", "title": "Federated Learning for Medical Images Analysis: A Meta Survey"}, {"paperId": "ce0e909fe55548e4f2801ff697cc2c179ef599c7", "title": "Data Privacy in Healthcare: In the Era of Artificial Intelligence"}, {"paperId": "2883680b895ec692697482f3b624afa85e04e800", "title": "Enhancing Lung Cancer Classification through Integration of Liquid Biopsy Multi-Omics Data with Machine Learning Techniques"}, {"paperId": "a9eda75824d8029cad813fe5772d6f386d62075e", "title": "Challenges in Implementing the Local Node Infrastructure for a National Federated Machine Learning Network in Radiology"}, {"paperId": "b00c0616b43f171f3abf59f453dda38a276ba1c2", "title": "Lattice-Based Group Signature with Message Recovery for Federal Learning"}, {"paperId": "9e002ff246b1817740c8de53730a29d35cd4986a", "title": "Reviewing Federated Learning Aggregation Algorithms; Strategies, Contributions, Limitations and Future Perspectives"}, {"paperId": "23217859832bb7c2c14668330bcd3f640d36e542", "title": "Portal of Medical Data Models: Application in Federated Data Capture"}, {"paperId": "87e925481abbb3781f6bfbb70d5c33453ca2ecb1", "title": "Artificial Intelligence Technologies in Cardiology"}, {"paperId": "66902aa06439c900e0c5d6491609776f06641ba6", "title": "Reviewing Multimodal Machine Learning and Its Use in Cardiovascular Diseases Detection"}, {"paperId": "170a0dd567b69bea63993ee8472f063f6b126826", "title": "PolyFLAG_SVM: a Polymorphic Federated Learning Aggregation of Gradients Support Vector Machines Framework"}, {"paperId": "86dbba5e08964bbff1844a634dedbdbceb20b39a", "title": "F ED DA: F ASTER A DAPTIVE G RADIENT M ETHODS FOR F EDERATED C ONSTRAINED O PTIMIZATION"}]}
