{"paperId": "46f960dc3c240c019c0154d1789938629f02730e", "publicationVenue": {"id": "020308f7-d9af-4448-b3bf-e55e963fdb29", "name": "International Journal of Applied Mathematics and Computer Sciences", "type": "journal", "alternate_names": ["Int j appl math comput sci", "International journal of applied mathematics and computing science", "Int J Appl Math Comput Sci", "International Journal of Applied Mathematics and Computer Science"], "issn": "1307-6906", "alternate_issns": ["1641-876X", "2333-2425"], "url": "http://www.waset.org/", "alternate_urls": ["https://eudml.org/journal/10251", "https://www.amcs.uz.zgora.pl/?action=online", "http://matwbn.icm.edu.pl/spis.php?wyd=11", "http://www.cayley-nielson.com/ijamcs/index.html", "http://www.amcs.uz.zgora.pl/", "https://www.amcs.uz.zgora.pl/", "http://www.degruyter.com/view/j/amcs?result=261&rskey=uCYtGk"]}, "title": "Applications of rough sets in big data analysis: An overview", "abstract": "Abstract Big data, artificial intelligence and the Internet of things (IoT) are still very popular areas in current research and industrial applications. Processing massive amounts of data generated by the IoT and stored in distributed space is not a straightforward task and may cause many problems. During the last few decades, scientists have proposed many interesting approaches to extract information and discover knowledge from data collected in database systems or other sources. We observe a permanent development of machine learning algorithms that support each phase of the data mining process, ensuring achievement of better results than before. Rough set theory (RST) delivers a formal insight into information, knowledge, data reduction, uncertainty, and missing values. This formalism, formulated in the 1980s and developed by several researches, can serve as a theoretical basis and practical background for dealing with ambiguities, data reduction, building ontologies, etc. Moreover, as a mature theory, it has evolved into numerous extensions and has been transformed through various incarnations, which have enriched expressiveness and applicability of the related tools. The main aim of this article is to present an overview of selected applications of RST in big data analysis and processing. Thousands of publications on rough sets have been contributed; therefore, we focus on papers published in the last few years. The applications of RST are considered from two main perspectives: direct use of the RST concepts and tools, and jointly with other approaches, i.e., fuzzy sets, probabilistic concepts, and deep learning. The latter hybrid idea seems to be very promising for developing new methods and related tools as well as extensions of the application area.", "venue": "International Journal of Applied Mathematics and Computer Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-01", "journal": {"name": "International Journal of Applied Mathematics and Computer Science", "pages": "659 - 683", "volume": "31"}, "authors": [{"authorId": "119875636", "name": "P. Pięta"}, {"authorId": "3316963", "name": "T. Szmuc"}], "citations": [{"paperId": "61255bff17e5dc0e2772a0740168c98e3cc2f61a", "title": "Hypergraph-based attribute reduction of formal contexts in rough sets"}, {"paperId": "a125de23b8d44c80535ea4bb539889f5668dad41", "title": "Analysing High Dimensional Data using Rough Tolerance Relation"}, {"paperId": "3ad0fc2bba596eb7a6bb5c04c35b6c47b437d6b3", "title": "Big Data Technology in the Macrodecision-Making Model of Regional Industrial Economic Information Applied Research"}, {"paperId": "84a378459b8293b54a88ae14cef9170b2440a3b5", "title": "Innovative System for Analyzing English Translation Software Based on IoT Big Data"}, {"paperId": "49c5c2467d54bdc27ed45abeb5e637109fa196b1", "title": "An English Teaching Ability Assessment Method Based on Fuzzy Mean-Shift Clustering"}, {"paperId": "6616fe926874e8510c867329700959ff84667bb6", "title": "The digital twin model of vehicle containers to provide an ergonomic handling mechanism"}]}
