{"paperId": "4717442a051010b172fb681de3562fec4596816d", "publicationVenue": {"id": "4efeae33-1a2d-4256-8af3-eaab30f9cd51", "name": "FME Transaction", "type": "journal", "alternate_names": ["FME Trans", "FME Transactions"], "issn": "1451-2092", "url": "https://www.mas.bg.ac.rs/istrazivanje/fme/start", "alternate_urls": ["https://scindeks.ceon.rs/journaldetails.aspx?issn=1451-2092&lang=en"]}, "title": "An analysis of causal relationships among challenges impeding adoption of Industry 4.0 through DEMATEL technique", "abstract": "Industries must be more innovative than ever before to face rising global competition and stay in the market today. These now aim to enhance operational efficiency by using different advanced technology tools and techniques of Industry 4.0, satisfying the varying customer needs with products of the highest quality offered at minimal costs. With different bottlenecks faced in industrial operations, the large-scale adoption of such systems faces multiple impediments relevant to the country's socioeconomic make-up, and therefore, nine pertinent barriers deterring India's transition to Industry 4.0 with varying interdependencies and importance are identified. Data collected from multiple industry experts is subsequently analyzed using the DEMATEL (Decision Making Trial and Evaluation Laboratory) technique to identify the key barriers having the biggest influence over India's industrial landscape based on their cause effect value and importance scores. The study conclusively ends with discussing the analysis findings for use in solving complex industry problems and identifying new roles, work environments, and skills required in different domains for the adoption of systems of Industry 4.0 in India.", "venue": "FME Transaction", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "FME Transactions"}, "authors": [{"authorId": "2044942030", "name": "Vaibhav Bisht"}, {"authorId": "2217229546", "name": "V.G. Sridhar"}, {"authorId": "3407208", "name": "M. Janardhanan"}], "citations": [{"paperId": "056258b09409b764037b6675b2f59b526ab63803", "title": "Exploring opportunities and barriers of digital technologies in circular manufacturing systems: An overview and a research roadmap"}]}
