{"paperId": "471a807070ab9fe84ac66ddff43aba904b51214b", "publicationVenue": null, "title": "Análisis de los registros en Moodle para estudiar la actividad desarrollada por estudiantes de Histología Humana y su relación con el rendimiento académico", "abstract": "Este trabajo presenta los resultados obtenidos tras la extracción y análisis de los registros almacenados en Moodle correspondientes a la actividad desarrollada por los estudiantes de histología humana en el campus virtual. Mediante el lenguaje de programación R y el programa SPSS se estudió el comportamiento de los alumnos y las posibles diferencias entre estudiantes según su rendimiento académico. Los datos revelan que los estudiantes entran masivamente al campus virtual, con una actividad muy superior a la media de la titulación, y claramente dependiente del calendario académico. Su comportamiento no es homogéneo, observándose diferencias entre los grupos de alumnos según su nota final de teoría. El árbol de decisión obtenido al contrastar el uso efectuado por estudiantes que aprobaron por parciales y los aprobados en el examen final permite establecer diferencias estadísticamente significativas.", "venue": "Libro de Actas IN-RED 2020: VI Congreso de Innovación Edicativa y Docencia en Red", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-07-16", "journal": {"name": "Libro de Actas IN-RED 2020: VI Congreso de Innovación Edicativa y Docencia en Red"}, "authors": [{"authorId": "121215614", "name": "M. Vázquez"}, {"authorId": "66831887", "name": "M. Carrere"}, {"authorId": "114573326", "name": "María del Carmen Bravo Llatas"}, {"authorId": "72060715", "name": "Jesús Cristóbal Barrios"}, {"authorId": "1435598844", "name": "A. Álvarez-Méndez"}], "citations": [{"paperId": "c4dd746062b24241111ffcb188ce332e38e490e6", "title": "Análisis multivariante del uso de espacios virtualizados por estudiantes pregraduados en Ciencias de la Salud"}]}
