{"paperId": "47244189ac32ac724e9dcfba7d50cf36accf8c85", "publicationVenue": null, "title": "uPredict: A User-Level Profiler-Based Predictive Framework in Multi-Tenant Clouds", "abstract": "Accurate performance prediction for cloud applications is an essential component to support many cloud resource management and auto-scaling policies. However, most existing studies on performance prediction for cloud applications in multitenant clouds are at the system level and may require access to performance counters in hypervisors. In this work, we propose uPredict, a user-level profiler-based performance predictive framework for single-VM (virtual machine) applications in multitenant clouds. We designed three micro-benchmarks to assess the contention of CPUs, memory and disks in a VM, respectively. Based on the measured performance of an application and micro-benchmarks, the application and VM-specific predictive models are derived by exploiting various regression and neural network based techniques. These models can then be used to predict the application’s performance using the in-situ profiled resource contention with the micro-benchmarks. We evaluated uPredict extensively with representative benchmarks from PARSEC, NAS Parallel Benchmarks and CloudSuite, on a private cloud and two public clouds. The results show that the average prediction errors are between 10.4% to 17% for various predictive models on the private cloud with high resource contention, while the errors are within 4% on public clouds. A smart load-balancing scheme powered by uPredict is presented and can effectively reduce the execution and turnaround times of the considered application by 19% and 10%, respectively.", "venue": "2020 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "73-82"}, "authors": [{"authorId": "153889781", "name": "Hamidreza Moradi"}, {"authorId": "39253519", "name": "Wei Wang"}, {"authorId": "144391871", "name": "Amanda Fernandez"}, {"authorId": "1721468", "name": "Dakai Zhu"}], "citations": [{"paperId": "5a51800c60ce9c02bf887225758cb1872b2abb23", "title": "A HPC Co-scheduler with Reinforcement Learning"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "76b4fce023fbc6cdb92cf97f5b962fe6fdfc0278", "title": "FOCloud: Feature Model Guided Performance Prediction and Explanation for Deployment Configurable Cloud Applications"}, {"paperId": "845e503878d0590fa76b99e79ba125c254f89528", "title": "Performance Interference of Virtual Machines: A Survey"}, {"paperId": "87c6d2a92a1b732bf4ac087d6ae7aa9c3f3ca5c2", "title": "Prediction of resource contention in cloud using second order Markov model"}]}
