{"paperId": "472ee7a0cac0b52665c793864aa2d56e962a3579", "publicationVenue": null, "title": "A Reflection on Typology and Verification Flaws in consideration of Biocybersecurity/Cyberbiosecurity: Just Another Gap in the Wall", "abstract": "Verification is central to any process in a functional and enduring cyber-secure organization. This verification ishow the validity or accuracy of a state of being is assessed (Schlick, 1936; Balci, 1998). Conversely, breakdownin verification procedures is core to the interruption of normal operations for an organization. A key problemfor organizations that utilize biology as an interlock within their systems is that personnel lack sufficient abilityto verify all practically relevant biological information for procedures such as a nurse logging a blood draw, or amolecular biology technician preparing agar to culture microbes for study. This has several implications, one ofwhich is our diminished ability to approximate and defend against emerging biologically-linked cyberthreats.These could be in the form of mis- or dis-information, contaminants, or calculated threats to vital supplies.Two important questions to ask are: “What may be the implications of diminished ability to undergo strictverification measures (such as triple redundancy and technological distancing).” And “how does this impactour ability to anticipate and make changes for verification of biological processes?” This paper aims to discusskey areas where verification gaps exist and how to bridgethos gaps. Towards this, we cover data integrity,implications of the lack of verification, triple redundancy, technological distancing, biosafety concerns, andmore. All of this will factor into the ability of organizations with proximity to biosecurity to anticipate nationalchanges to biological processes that are nationally relevant.", "venue": "European Conference on Cyber Warfare and Security", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-19", "journal": {"name": "European Conference on Cyber Warfare and Security"}, "authors": [{"authorId": "47798159", "name": "Lucas Potter"}, {"authorId": "2221406407", "name": "Kimberly Mossberg"}, {"authorId": "21803470", "name": "X. Palmer"}], "citations": [{"paperId": "33b5773df2b6418db92cbaa092ddfb079df2bc24", "title": "Addressing Bio-Cybersecurity Workforce Employee Shortages in Biotechnology and Health Science Sectors in the U.S."}]}
