{"paperId": "4748e8e846ed4812177ec498620ce03a1f761864", "publicationVenue": {"id": "05c8fb30-2a95-40d1-9a26-e10e15fc7306", "name": "International Journal of Technology", "type": "journal", "alternate_names": ["Int J Technol"], "issn": "2231-3907", "alternate_issns": ["2086-9614", "2087-2100"], "url": "http://www.enggresearch.net/", "alternate_urls": ["http://www.ijtech.eng.ui.ac.id/?id=home"]}, "title": "Performance Evaluation of XML Dynamic Labeling Schemes on Relational Database", "abstract": ". eXtensible Markup Language (XML), in its semi-structured format has been employed for the data exchange purpose over the Internet due to its expressivity, flexibility, and capability to accommodate both structured and unstructured data. Due to the vast amount of data being transacted and updated frequently, it is essential to have a solution that can efficiently store and query the data. Hence, a robust and persistent labeling scheme that can sustain the need to re-labeling the entire document is desirable. Relational Database (RDB) has emerged since the 1970s and has been widely used as back-end storage in most industries. Since XML and RDB are in different formats, an efficient mapping technique is required. Several labeling and mapping schemes have been proposed, yet, there is no comparison of the performance of these schemes implemented in the RDB storage. In this paper, we first review the dynamic labeling schemes such as ORDPath, ME Labeling, and ORD-GAP in addressing these two needs. Secondly, the XML annotated labeling schemes are transformed into RDB storage. Finally, the performance evaluations are carried out to determine which labeling scheme is more robust and efficient to support storage and query retrieval.", "venue": "International Journal of Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-19", "journal": {"name": "International Journal of Technology"}, "authors": [{"authorId": "2392472", "name": "S. Haw"}, {"authorId": "71387861", "name": "Aisyah Amin"}, {"authorId": "2184878467", "name": "P. Naveen"}, {"authorId": "2147254521", "name": "Kok-Why Ng"}], "citations": [{"paperId": "f39e47a0b6c31801ec7970c989ee6c45ecdc4de0", "title": "Performance Analysis and Improvement for CRUD Operations in Relational Databases from Java Programs Using JPA, Hibernate, Spring Data JPA"}]}
