{"paperId": "4756eb61fd4da2093115896144b5d0cb7704934d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Rally and WebScience: A Platform and Toolkit for Browser-Based Research on Technology and Society Problems", "abstract": "Empirical technology and society research is in a methodological crisis. Problems increasingly involve closed platforms, targeted content, and context-specific behavior. Prevailing research methods, such as surveys, tasks, and web crawls, pose design and ecological validity limitations. Deploying studies in participant browsers and devices is a promising direction. These vantage points can observe individualized experiences and implement UI interventions in real settings. We survey scholarship that uses these methods, annotating 284 sampled papers. Our analysis demonstrates their potential, but also recurring implementation barriers and shortcomings. We then present Rally and sdkName, a platform and toolkit for browser-based research. These systems lower implementation barriers and advance the science of measuring online behavior. Finally, we evaluate Rally and sdkName against our design goals. We report results from a one-month pilot study on news engagement, analyzing 4,466,200 webpage visits from 1,817 participants. We also present observations from interviews with researchers using these systems.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-04", "journal": {"name": "ArXiv", "volume": "abs/2211.02274"}, "authors": [{"authorId": "14763771", "name": "Anne Kohlbrenner"}, {"authorId": "82873265", "name": "Ben Kaiser"}, {"authorId": "1396384885", "name": "Kartikeya Kandula"}, {"authorId": "145873027", "name": "Rebecca Weiss"}, {"authorId": "79109521", "name": "Jonathan R. Mayer"}, {"authorId": "2075303150", "name": "Ted Han"}, {"authorId": "89780333", "name": "R. Helmer"}], "citations": [{"paperId": "65f5c2c10f28dc26cb18ae09daceac8fcbfee9cc", "title": "Evaluating recommender systems in relation to the dissemination of illegal and harmful content in the UK"}]}
