{"paperId": "4758bc743df66df0401054077dcd7e125c6c55b7", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Blockchain-Enabled Cross-Border E-Commerce Supply Chain Management: A Bibliometric Systematic Review", "abstract": "Driven by the internet-based advanced information technologies and logistics channel improvement, the cross-border e-commerce industry keeps an increasing trend in Chinese industrial market. Blockchain, as an empowered technology, contributes to the management innovations for industrial sectors. The blockchain technology, due to its transparency, visibility, and dis-intermediation characteristics, helps to improve operations management of cross-border e-commerce supply chain by innovative industrial applications. However, practical applications of the blockchain technique-enabled cross-border e-commerce sector are still in their infancy and still at the proof-of-concept stage. This paper presents a systematic review on blockchain-enabled cross-border e-commerce supply chain management by employing a bibliometric data-driven analysis. All relevant publications from the Web of Science database from 2013 to 2021 were collected as the research samples. Besides, the VosViewer is adopted to conduct the network and co-word study by visualizing collaborative relationships of sampled literatures. Results show that the blockchain technique has substantial applications in the field of cross-border e-commerce supply chain, whose contributions mainly focus on cross-border e-commerce platform, supply chain operations, and data governance and information management. Academic researchers and industrial managers can promote innovative management practices in cross-border e-commerce supply chain by adopting blockchain. Moreover, we hope this study serves as a future direction for both researchers and engineers on leveraging blockchain to improve the supply chain management performance of the cross-border e-commerce.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-11-29", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "35743975", "name": "F. Zhou"}, {"authorId": "2144407309", "name": "Yijie Liu"}], "citations": [{"paperId": "af66c64b60c27b1bce0da9e1a2d5cd949615656a", "title": "The Influence of Compensation and Career Development on Employees' Organizational Commitment in Class III UPBU Offices in the Merauke Region"}, {"paperId": "b5dc01ca5ebc7922e71aa26fd0648cca7c5e50e1", "title": "Enhanced cross-entropy framework for multiple-attribute decision-making with type-2 neutrosophic number and applications to cross-border e-commerce logistics service providers evaluation"}, {"paperId": "6d12adf4f86775bd980d017d9af52459810ba025", "title": "A Review of Blockchain's Role in E-Commerce Transactions: Open Challenges, and Future Research Directions"}, {"paperId": "4bc3ab2881ef6edd0a0c1f426e99250b3371de33", "title": "Literature Study on IT: Characteristics of E-commerce Seller Side"}, {"paperId": "451ffc75f980ed4536691ecff46f3e655990a038", "title": "Evolutionary Game Analysis of Cross-Border E-Commerce Logistics Alliance Subject Considering Supply Chain Disruption Risk"}, {"paperId": "05cba48bbdc0a04c2d1894c1b79ca7839b5e3ed4", "title": "Digital Technique-Enabled Container Logistics Supply Chain Sustainability Achievement"}, {"paperId": "cd83285d84b279012177973953232b086c1290ee", "title": "Exploring Blockchain Research in Supply Chain Management: A Latent Dirichlet Allocation-Driven Systematic Review"}, {"paperId": "3dddc9ab30ae43f976030f28024aedcd1e52c9ca", "title": "Cryptocurrency and digital currency based on blockchain-enabled IoT: a bibliometric literature review"}, {"paperId": "5ddac07e792823123b145901a27a0469f41770d2", "title": "Optimized Combination of E-Commerce Platform Sales Model and Blockchain Anti-Counterfeit Traceability Service"}, {"paperId": "64db8d039ff718bba77b7e892c5440433617faa7", "title": "Traversing the Macroeconomic Terrain: An Exploration of South Korea’s Economic Responsiveness to Cross-Border E-Commerce Production Technology Alterations in the Global Arena"}, {"paperId": "137ebe1502c25edbeac865aaa12f539128330efd", "title": "A Visual Knowledge Map Analysis of Cross-Border Agri-Food Supply Chain Research Based on CiteSpace"}, {"paperId": "398a4555a314cbae506e3dc1f3c6f29932c76f85", "title": "An evolutionary game analysis on blockchain technology adoption in cross-border e-commerce"}, {"paperId": "498b71629bc50b08853e18e448844bc8156fcd24", "title": "Blockchain-Based E-Commerce: A Review on Applications and Challenges"}, {"paperId": "9834bab9adba52ab7f618a08eb546974af0e8899", "title": "Blockchain in the Construction Industry between 2016 and 2022: A Review, Bibliometric, and Network Analysis"}, {"paperId": "09c05d52c68746d884f2f19ae75bb8e85211abbb", "title": "Three-Party Stochastic Evolutionary Game Analysis of Supply Chain Finance Based on Blockchain Technology"}, {"paperId": "0629919c6961fade22bc835a9e49e3411b7e465a", "title": "Trustful Blockchain-Based Framework for Privacy Enabling Voting in a University"}, {"paperId": "d2892acfb59cbb180c4ef6f80cb6ec2772774352", "title": "Blockchain and Sustainability Disclosure: A Scenario-Based Application for Supply Chains"}, {"paperId": "abd4daf16be48cc1e6219b213f8b31ed18c02da7", "title": "Digital Twin-Enabled Smart Maritime Logistics Management in the Context of Industry 5.0"}]}
