{"paperId": "475b092d79c179e1737e2e9ace9dadc02c4a7c1b", "publicationVenue": {"id": "cd6ce03c-7af8-4c53-84b7-abcca44e2515", "name": "Education + Training", "type": "journal", "alternate_names": ["Educ + Train", "J Educ Train", "Journal of Education and Training"], "issn": "0040-0912", "url": "https://www.emerald.com/insight/publication/issn/0040-0912", "alternate_urls": ["http://www.emeraldinsight.com/loi/et"]}, "title": "Artificial intelligence in entrepreneurship education: a scoping review", "abstract": "PurposeThe study aims to identify the status quo of artificial intelligence in entrepreneurship education with a view to identifying potential research gaps, especially in the adoption of certain intelligent technologies and pedagogical designs applied in this domain.Design/methodology/approachA scoping review was conducted using six inclusive and exclusive criteria agreed upon by the author team. The collected studies, which focused on the adoption of AI in entrepreneurship education, were analysed by the team with regards to various aspects including the definition of intelligent technology, research question, educational purpose, research method, sample size, research quality and publication. The results of this analysis were presented in tables and figures.FindingsEducators introduced big data and algorithms of machine learning in entrepreneurship education. Big data analytics use multimodal data to improve the effectiveness of entrepreneurship education and spot entrepreneurial opportunities. Entrepreneurial analytics analysis entrepreneurial projects with low costs and high effectiveness. Machine learning releases educators’ burdens and improves the accuracy of the assessment. However, AI in entrepreneurship education needs more sophisticated pedagogical designs in diagnosis, prediction, intervention, prevention and recommendation, combined with specific entrepreneurial learning content and entrepreneurial procedure, obeying entrepreneurial pedagogy.Originality/valueThis study holds significant implications as it can shift the focus of entrepreneurs and educators towards the educational potential of artificial intelligence, prompting them to consider the ways in which it can be used effectively. By providing valuable insights, the study can stimulate further research and exploration, potentially opening up new avenues for the application of artificial intelligence in entrepreneurship education.", "venue": "Education + Training", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-20", "journal": {"name": "Education + Training"}, "authors": [{"authorId": "152875146", "name": "Li Chen"}, {"authorId": "2251026839", "name": "Dirk Ifenthaler"}, {"authorId": "2287365082", "name": "Jane Yin-Kim Yau"}, {"authorId": "2111845116", "name": "Wenting Sun"}], "citations": []}
