{"paperId": "476124d8221f9ea7b1272e8daca4f92f59c1409f", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Exploiting Cloud Object Storage for High-Performance Analytics", "abstract": "\n Elasticity of compute and storage is crucial for analytical cloud database systems. All cloud vendors provide disaggregated object stores, which can be used as storage backend for analytical query engines. Until recently, local storage was unavoidable to process large tables efficiently due to the bandwidth limitations of the network infrastructure in public clouds. However, the gap between remote network and local NVMe bandwidth is closing, making cloud storage more attractive. This paper presents a blueprint for performing efficient analytics directly on cloud object stores. We derive cost- and performance-optimal retrieval configurations for cloud object stores with the first in-depth study of this foundational service in the context of analytical query processing. For achieving high retrieval performance, we present\n AnyBlob\n , a novel download manager for query engines that optimizes throughput while minimizing CPU usage. We discuss the integration of high-performance data retrieval in query engines and demonstrate it by incorporating\n AnyBlob\n in our database system\n Umbra.\n Our experiments show that even without caching,\n Umbra\n with integrated\n AnyBlob\n achieves similar performance to state-of-the-art cloud data warehouses that cache data on local SSDs while improving resource elasticity.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2769-2782", "volume": "16"}, "authors": [{"authorId": "12687177", "name": "Dominik Durner"}, {"authorId": "1787012", "name": "Viktor Leis"}, {"authorId": "143993045", "name": "Thomas Neumann"}], "citations": [{"paperId": "c820e65f8175cf4599a890925057c9db901d207c", "title": "SkyPIE: A Fast & Accurate Oracle for Object Placement"}, {"paperId": "3b386f1efb825d8518d768f5f2d349dae1b4f8c8", "title": "Cloud-Native Database Systems and Unikernels: Reimagining OS Abstractions for Modern Hardware"}]}
