{"paperId": "4763fb31ba6aa4d12b1d0d63e4f5895724c32b50", "publicationVenue": {"id": "9051e7ea-542a-4709-9bf5-f5e325b73844", "name": "International journal of software engineering and knowledge engineering", "type": "journal", "alternate_names": ["International Journal of Software Engineering and Knowledge Engineering", "Int j softw eng knowl eng", "Int J Softw Eng Knowl Eng"], "issn": "0218-1940", "url": "http://www.worldscinet.com/ijseke/ijseke.shtml"}, "title": "Trusted Service Provider Discovery Based on Data, Information, Knowledge, and Wisdom", "abstract": "Data, information, knowledge, and wisdom forms a progressive relationship. Information is formed by data collation. Knowledge is filtered, refined, and processed from relevant information. Wisdom is based on knowledge and is accumulated through experience. This paper uses the progressive relationship of service data, information, knowledge, and wisdom to explain the expression of service knowledge graph. It is an increasingly challenging demand to discover trusted Cloud service providers with service data, information, and knowledge. We propose an efficient method of trusted service provider discovery based on service knowledge graphs, called PDG (Provider Discovery based on Graphs), to ensure that each service instance of composite services in Cloud systems is trustworthy. PDG evaluates the outputs of service providers in service classes with the help of additional service information. According to the additional service information, service knowledge is generated and trusted service providers can be found easily. PDG improves the accuracy of processing results by automatically replacing data provided by untrusted service providers with results provided by trusted service providers.", "venue": "International journal of software engineering and knowledge engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "Int. J. Softw. Eng. Knowl. Eng.", "pages": "3-19", "volume": "31"}, "authors": [{"authorId": "39256535", "name": "Y. Lei"}, {"authorId": "145963973", "name": "Yucong Duan"}], "citations": [{"paperId": "8ae5fa23597fe6f1319eef651de78f645a12a87d", "title": "DIKWP Artificial Consciousness White Box Measurement Standards Framework Design and Practice"}, {"paperId": "c7ad5dc1b6f5312f03d2e632a8c9b21f4917dfdc", "title": "Generative Semantic Modeling for Structured Data Source with Large Language Model"}, {"paperId": "6d8644f5a8e2c904c654ce60542cb43cecf63f2c", "title": "Fusion of SoftLexicon and RoBERTa for Purpose-Driven Electronic Medical Record Named Entity Recognition"}, {"paperId": "2380b1b0fbf0b42c55aa5f894f956e5173c641e9", "title": "Purpose Driven Modelling and Analysis for Smart Table Fill and Design based on DIKW"}, {"paperId": "c6b248978dbf6d4011cb488426fcaa4c6c66582b", "title": "Purpose Driven DIKW Modeling and Analysis of Meteorology and Depression"}, {"paperId": "a3f528ca0075f3b563aae1f0569c0962cd5efd8f", "title": "Transwarp Data Cloud: A Stable, Efficient, and Intelligent Data Application Cloud Platform"}, {"paperId": "a66216d978e551775b49ce5f4bdf722926242a0f", "title": "Design and Implementation of An Intelligent Health Management System for Nursing Homes"}, {"paperId": "f634e9776a2f149871be72ebc7d839f95b18ef54", "title": "Enhancing the diversity of self-replicating structures using active self-adapting mechanisms"}, {"paperId": "745aaf57e61b84438147ca3c677bea362d027f5a", "title": "Indicators of Intellectual Thinking as Healthy Thinking and Its Relation with Health-Promoting Lifestyle: A New Perspective in Clinical Psychology and Public Health"}, {"paperId": "5f7181e90eceb1bbe50b7fcb27e7532d940dec35", "title": "Swarm Differential Privacy for Purpose Driven Data-Information-Knowledge-Wisdom Architecture"}]}
