{"paperId": "47646cfc4d7a07a1b306fdac6edbf6a042be4dd5", "publicationVenue": null, "title": "Evaluation of Community Recreational Sports Activities at the Jambi City Governor's Office: Improving Quality and Participation", "abstract": "Purpose of the study: The main objective of this research is to identify the perceptions, preferences and experiences of the community in participating in recreational sports activities around the Jambi City governor's office. \nMethodology: This research uses a descriptive quantitative approach. The sampling technique uses simple random sampling. The data collection instrument uses a structured questionnaire about people's perceptions, preferences and experiences in participating in recreational sports activities in the city center. The data analysis technique uses descriptive statistics. \nMain Findings: The results of this research reveal that people's perceptions, preferences and experiences regarding recreational sports activities in Jambi city center show dominance in the good category, with around 50% of people seeing it as having a positive impact on them. Cycling, jogging/running and gymnastics are the most popular activities, especially on Saturdays and Sundays in the morning and afternoon. Important factors influencing the choice of recreation area include affordable prices, adequate facilities, and variety of activities. \nNovelty/Originality of this study: This research offers an in-depth understanding of people's perceptions, preferences and experiences regarding recreational sports activities in Jambi city center, as well as identifying activities of interest and preferred times of participation. The results have the potential to be an important basis for policy makers to design recreational facilities that suit community needs.", "venue": "Indonesian Journal of Education Research (IJoER)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "Indonesian Journal of Education Research (IJoER)"}, "authors": [{"authorId": "2295003319", "name": "Muhamad Adha Jufrin"}, {"authorId": "2295002696", "name": "Blendina Engan"}, {"authorId": "2294996915", "name": "Roshanak Irandoost"}], "citations": []}
