{"paperId": "4774eee5c0fbd63dd62d72777a8b06afdf03d205", "publicationVenue": null, "title": "CAPTAIN: Comprehensive Composition Assistance for Photo Taking", "abstract": "Many people are interested in taking astonishing photos and sharing them with others. Emerging high-tech hardware and software facilitate the ubiquitousness and functionality of digital photography. Because composition matters in photography, researchers have leveraged some common composition techniques, such as the rule of thirds and the perspective-related techniques, in providing photo-taking assistance. However, composition techniques developed by professionals are far more diverse than well-documented techniques can cover. We present a new approach to leverage the underexplored photography ideas, which are virtually unlimited, diverse, and correlated. We propose a comprehensive fork-join framework, named CAPTAIN (Composition Assistance for Photo Taking), to guide a photographer with a variety of photography ideas. The framework consists of a few components: integrated object detection, photo genre classification, artistic pose clustering, and personalized aesthetics-aware image retrieval. CAPTAIN is backed by a large managed dataset crawled from a Website with ideas from photography enthusiasts and professionals. The work proposes steps to decompose a given amateurish shot into composition ingredients and compose them to bring the photographer a list of useful and related ideas. The work addresses personal preferences for composition by presenting a user-specified preference list of photography ideas. We have conducted many experiments on the newly proposed components and reported findings. A user study demonstrates that the work is useful to those taking photos.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-10", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "pages": "1 - 24", "volume": "18"}, "authors": [{"authorId": "35779995", "name": "F. Farhat"}, {"authorId": "8917957", "name": "Mohammad Mahdi Kamani"}, {"authorId": "2116439116", "name": "J. Z. Wang"}], "citations": [{"paperId": "13d56308c823d2487282f9d3675c182bf1e1c728", "title": "Augmented Reality Based Video Shooting Guidance for Novice Users"}, {"paperId": "d49cd55c36586e3c11f53c2d6c790934ac270d11", "title": "Adaptive Photographic Composition Guidance"}]}
