{"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review", "abstract": "Context: Software regression testing refers to rerunning test cases after the system under test is modified, ascertaining that the changes have not (re-)introduced failures. Not all researchers’ approaches consider applicability and scalability concerns, and not many have produced an impact in practice. Objective: One goal is to investigate industrial relevance and applicability of proposed approaches. Another is providing a live review, open to continuous updates by the community. Method: A systematic review of regression testing studies that are clearly motivated by or validated against industrial relevance and applicability is conducted. It is complemented by follow-up surveys with authors of the selected papers and 23 practitioners. Results: A set of 79 primary studies published between 2016–2022 is collected and classified according to approaches and metrics. Aspects relative to their relevance and impact are discussed, also based on their authors’ feedback. All the data are made available from the live repository that accompanies the study. Conclusions: While widely motivated by industrial relevance and applicability, not many approaches are evaluated in industrial or large-scale open-source systems, and even fewer approaches have been adopted in practice. Some challenges hindering the implementation of relevant approaches are synthesized, also based on the practitioners’ feedback.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-12", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 36", "volume": "55"}, "authors": [{"authorId": "51961109", "name": "Renan Greca"}, {"authorId": "52566125", "name": "Breno Miranda"}, {"authorId": "143898485", "name": "A. Bertolino"}], "citations": [{"paperId": "7a64954fa236aa7954fa27ff38531e36f092cf72", "title": "Orchestration Strategies for Regression Test Suites"}]}
