{"paperId": "47798e0e62f2de23ba6f5ebcc77c481b862cb781", "publicationVenue": null, "title": "COVID-GAN: Estimating Human Mobility Responses to COVID-19 Pandemic through Spatio-Temporal Conditional Generative Adversarial Networks", "abstract": "The COVID-19 pandemic has posed grand challenges to policy makers, raising major social conflicts between public health and economic resilience. Policies such as closure or reopen of businesses are made based on scientific projections of infection risks obtained from infection dynamics models. While most parameters in infection dynamics models can be set using domain knowledge of COVID-19, a key parameter - human mobility - is often challenging to estimate due to complex social contexts and limited training data under escalating COVID-19 conditions. To address these challenges, we formulate the problem as a spatio-temporal data generation problem and propose COVID-GAN, a spatio-temporal Conditional Generative Adversarial Network, to estimate mobility (e.g., changes in POI visits) under various real-world conditions (e.g., COVID-19 severity, local policy interventions) integrated from multiple data sources. We also introduce a domain-constraint correction layer in the generator of COVID-GAN to reduce the difficulty of learning. Experiments using urban mobility data derived from cell phone records and census data show that COVID-GAN can well approximate real-world human mobility responses, and that the proposed domain-constraint based correction can greatly improve solution quality.", "venue": "SIGSPATIAL/GIS", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-11-03", "journal": {"name": "Proceedings of the 28th International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "2052378710", "name": "Han Bao"}, {"authorId": "3209119", "name": "Xun Zhou"}, {"authorId": "2108467161", "name": "Yingxue Zhang"}, {"authorId": "50025199", "name": "Yanhua Li"}, {"authorId": "46269169", "name": "Yiqun Xie"}], "citations": [{"paperId": "6e5a43c926bb83665bef1b9ffa8c273ba0864ad2", "title": "A Survey of Generative AI for Intelligent Transportation Systems"}, {"paperId": "4a48280a5f838b28b0c11b8d717b5ad93ea935ad", "title": "Epidemic Spread Modeling for COVID-19 Using Cross-Fertilization of Mobility Data"}, {"paperId": "caf2594e22aab4ab711799c5297fde997b43bf7d", "title": "Mobility trajectory generation: a survey"}, {"paperId": "5752a436ce5f736c358f7db0b210e38340294cfc", "title": "STORM-GAN+: spatio-temporal meta-GAN for cross-city estimation of heterogeneous human mobility responses to COVID-19"}, {"paperId": "2a2519ecf6f36f62f993783a399b649ba6f95dfd", "title": "Sustainable Road Planning for Trucks in Urbanized Areas of Chinese Cities Using Deep Learning Approaches"}, {"paperId": "4e93098d60589cc748217fdb21581834fa190e44", "title": "Learning Social Meta-knowledge for Nowcasting Human Mobility in Disaster"}, {"paperId": "41b0a2bbeb9cd65fea915b32054e43a8aced9e18", "title": "Harnessing heterogeneity in space with statistically guided meta-learning"}, {"paperId": "6535523ec2055da2f10f99170cedaf8fcaeca28f", "title": "A Survey on Data-driven COVID-19 and Future Pandemic Management"}, {"paperId": "ccf17aa18889bfa2b2e604f1b06494e7d4b96c1a", "title": "STORM-GAN: Spatio-Temporal Meta-GAN for Cross-City Estimation of Human Mobility Responses to COVID-19"}, {"paperId": "bc59310d14d04986b8ee0ae72937ee3290f68a10", "title": "Role of Imaging and AI in the Evaluation of COVID-19 Infection: A Comprehensive Survey."}, {"paperId": "0b52dd455880e62fd3756921efcc8d555057241f", "title": "Analysis of State Transition of COVID-19 Positive Cases in Tokyo, Japan and its Application to Agent Simulation"}, {"paperId": "fbb0338f5795622fe4faa5a1d53da2a182f80a07", "title": "Statistically-Guided Deep Network Transformation to Harness Heterogeneity in Space (Extended Abstract)"}, {"paperId": "655a9aeb283e791f3e51a4fa31f936d193b46ffa", "title": "COVID-GAN+: Estimating Human Mobility Responses to COVID-19 through Spatio-temporal Generative Adversarial Networks with Enhanced Features"}, {"paperId": "dc421280d8bde7e1210163c9cc3bc8aca6ca457b", "title": "Urban Traffic Dynamics Prediction—A Continuous Spatial-temporal Meta-learning Approach"}, {"paperId": "f80acc7073b859ae2fa869e6734db3d473eade93", "title": "A Statistically-Guided Deep Network Transformation and Moderation Framework for Data with Spatial Heterogeneity"}, {"paperId": "2cc6b702a83a4c471438e3a9ae0606764d3e4ab3", "title": "Does the COVID-19 Pandemic Change Human Mobility Equally Worldwide? Cross-Country Cluster Analysis"}, {"paperId": "2080844763820d15eae35dfec99fe86b15ef0b96", "title": "Federated Learning for COVID-19 Detection With Generative Adversarial Networks in Edge Cloud Computing"}, {"paperId": "9f86031e05d8c290ab468ef23b5e90ccea47e6f5", "title": "SPATE-GAN: Improved Generative Modeling of Dynamic Spatio-Temporal Patterns with an Autoregressive Embedding Loss"}, {"paperId": "5e0db2ff53e5f3bb3e3a2e24fb4897e4881bf073", "title": "FedDPGAN: Federated Differentially Private Generative Adversarial Networks Framework for the Detection of COVID-19 Pneumonia"}, {"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey"}, {"paperId": "3de6f21d437cc0a2a5c4e1c252ca5ca86afa3912", "title": "Machine Learning on the COVID-19 Pandemic, Human Mobility and Air Quality: A Review"}, {"paperId": "3dafd2e8a7ae06984a41a9bb48c4bf0c39619723", "title": "Deep neural networks for COVID-19 detection and diagnosis using images and acoustic-based techniques: a recent review"}, {"paperId": "3de0e65b87d59a21b35ea4d8b6173aab94b093b3", "title": "Leveraging Administrative Data for Bias Audits: Assessing Disparate Coverage with Mobility Data for COVID-19 Policy"}, {"paperId": "76150378158f60e7f6373364e3efc572f662b1f1", "title": "Auxiliary-task learning for geographic data with autoregressive embeddings"}, {"paperId": "ab01cf02bfa62b71c2ab5976dc99fdd6c7aa3bcc", "title": "Work from home during the COVID-19 pandemic: An observational study based on a large geo-tagged COVID-19 Twitter dataset (UsaGeoCov19)"}, {"paperId": "a738f83ba0f8d1e82b94b5c73697229ccca72ec6", "title": "Epidemic Spread Modeling for COVID-19 Using Mobility Data"}, {"paperId": "635735b4451de557bebdd49a63c482843c0fe0a2", "title": "Analysis and Agent Simulation of State Transition of COVID-19 Positive Cases in Tokyo, Japan"}]}
