{"paperId": "4780a85603d924cd2ede4076dfd9088d53fddbff", "publicationVenue": null, "title": "Machine Learning Approach for Degradation Path Prediction Using Different Models and Architectures of Artificial Neural Networks", "abstract": "Degradation and failure prediction has become more and more crucial for maintenance planning and scheduling, the decision-making process, and many other areas of manufacturing systems. This paper presents an approach where different artificial neural network models were developed to predict the degradation path of a machine component using different architectures, including fully connected networks (FCN) and arbitrarily connected networks (ACN). These models were trained using the Neuron-by-Neuron (NBN) training algorithm with forward-backward computations, where NBN is an improved form of the Levenberg-Marquardt (LM) algorithm, combined with FCN and ACN architectures, which can be trained efficiently, it can give more accurate predictions with a fewer number of neurons used. The developed models were evaluated using the statistical performance measure of the sum of squared error (SSE). The results show that the used networks are successfully able to predict the degradation path; the 8-neurons model of FCN architecture and the 3-neurons model of ACN architecture with tanh (mbib) hidden layers activation function and linear function (mlin) of the outputs have the lowest prediction error (SSE) among all the developed models. The use of such architectures combined with NBN training algorithm can easily model manufacturing systems with complex component structures that provide a vast amount of data.", "venue": "Periodica Polytechnica: Mechanical Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-25", "journal": {"name": "Periodica Polytechnica Mechanical Engineering"}, "authors": [{"authorId": "1680450030", "name": "B. Shaheen"}, {"authorId": "2075471228", "name": "I. Németh"}], "citations": [{"paperId": "1ad807d5378e72be08c3d08df33b04f784b45eac", "title": "Determination of children's nutritional status with machine learning classification analysis approach"}, {"paperId": "351a1905cf794316bcfd73fdbea3bf717222e332", "title": "Data-driven failure prediction and RUL estimation of mechanical components using accumulative artificial neural networks"}, {"paperId": "5690bc574db7f91bc21dcb976dd14eaef8d2e571", "title": "Performance Monitoring of Wind Turbines Gearbox Utilising Artificial Neural Networks — Steps toward Successful Implementation of Predictive Maintenance Strategy"}, {"paperId": "e61f46b02f0f5c27fbee8eb37fece611ea30a685", "title": "Comparison of Artificial Neural Network Technique-Based Failure Predictions of Mechanical Components"}]}
