{"paperId": "47878e45b0c4c193f2de725898a48dfb6af572c6", "publicationVenue": {"id": "b83914c6-c003-45e1-813a-bea6b9de96fc", "name": "Parasite", "type": "journal", "issn": "1252-607X", "url": "https://www.parasite-journal.org/", "alternate_urls": ["http://www.parasite-journal.org/", "https://www.parasite-journal.org/component/issues/"]}, "title": "Infestation of chigger mites on Chinese mole shrew, Anourosorex squamipes, in Southwest China and ecological analysis", "abstract": "The Chinese mole shrew, Anourosorex squamipes Milne-Edwards, 1872, is a common species of insectivorous mammal in Southwest China. Based on field investigations between 2001 and 2019, the present study reports the infestation of chiggers (larvae of chigger mites) on the shrew in Southwest China and certain ecology parameters for the first time. A total of 3169 chiggers were collected from 1694 A. squamipes and they were identified into 72 species and 10 genera in the family Trombiculidae. The overall infestation prevalence (Pm), mean abundance (MA) and mean intensity (MI) of A. squamipes with chiggers reached 11.1%, 1.87 and 16.86, respectively. The species diversity, species composition and infestation of chiggers on A. squamipes fluctuated in different environments (latitudes, altitudes, habitats and landscapes) and on different sexes and ages of the shrew hosts with high heterogeneity and low species similarity. In the established linear regression equation (M* = 0.173 + 1.054 M) for dominant mite Leptotrombidium densipunctatum, both the α and β values (α = 0.173, β = 1.054) exceeded the boundary values (F = 4.67, p < 0.05), and therefore the spatial distribution pattern of this mite was determined as an aggregated distribution among different individuals of shrew hosts. The species abundance distribution of the chigger community on A. squamipes conformed to the lognormal distribution, and its curve showed a gradually descending tendency from the rare mite species to the dominant mite species. The curve tendency of species-sample relationship implies that more species of chiggers would be found if the host samples infinitely keep increasing.", "venue": "Parasite", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-28", "journal": {"name": "Parasite", "volume": "29"}, "authors": [{"authorId": "2179705810", "name": "Bei Li"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "40474509", "name": "P. Peng"}, {"authorId": "6439830", "name": "Wenyu Song"}, {"authorId": "40603213", "name": "T. Ren"}, {"authorId": "2152836581", "name": "Lei Zhang"}, {"authorId": "35557627", "name": "T. Qian"}], "citations": [{"paperId": "27de9901d97d938e14db9926c52eea2e2d939fde", "title": "Infestation of Oriental House Rat (Rattus tanezumi) with Chigger Mites Varies along Environmental Gradients across Five Provincial Regions of Southwest China"}, {"paperId": "e9fc0ffd20f9911d5c79e4d1a00a13b43acb7fcd", "title": "Preliminary Study on Species Diversity and Community Characteristics of Gamasid Mites on Small Mammals in Three Parallel Rivers Area of China"}, {"paperId": "bcbf14a4c7756e7c09b223140de7f5c029d8102e", "title": "Habitat and Season Drive Chigger Mite Diversity and Abundance on Small Mammals in Peninsular Malaysia"}, {"paperId": "0410c0a03857c79ac7c16a75a93b479c969b87ab", "title": "Analysis on infestation and related ecology of chigger mites on large Chinese voles (Eothenomys miletus) in five provincial regions of Southwest China"}]}
