{"paperId": "479c4e884979a1dfcffc8b9a079d0854876aa120", "publicationVenue": {"id": "0e129215-7c25-46c9-b04b-a0e9faabf021", "name": "International Conference on Information Networking", "type": "conference", "alternate_names": ["Int Conf Inf Netw", "ICOIN"], "url": "http://www.icoin.org/"}, "title": "RAMA: Real-Time Automobile Mutual Authentication Protocol Using PUF", "abstract": "The batteries of electric vehicles enable the functionality of V2G networks. The purpose of V2G is to handle the trading of energy for electric vehicles powered by batteries as well as the power grid. This is essential to make more efficient use of the energy of the grid. The electrical energy stored in the EV batteries can function as a power source for the grid and other energy-deficient EVs. The energy stored in the batteries of the EVs could be used to pump power into the grid when the load on the grid is too heavy. Despite its wide-ranging applications, the privacy and safety of intelligent grids continue to be a severe problem. Any protocol designed for V2G applications must be safe, lightweight, and safeguard the car owner’s privacy. As individuals usually do not guard EVs and charging stations, physical security is also a must. To address these issues, we are proposing a Real-time Automotive Mutual Authentication protocol for V2G devices based on Physical Unclonable Functions (PUF). PUFs are used by the proposed protocol to obtain a two-step mutual authentication (MA) between an EV and the Grid Server. It is lightweight, safe, and preserves privacy.", "venue": "International Conference on Information Networking", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-01-01", "journal": {"name": "2020 International Conference on Information Networking (ICOIN)", "pages": "265-270"}, "authors": [{"authorId": "150108702", "name": "Gaurang Bansal"}, {"authorId": "118346626", "name": "Naren Naren"}, {"authorId": "3185174", "name": "V. Chamola"}], "citations": [{"paperId": "6e404e97da0b33f5379602d5b192757766f0eb4b", "title": "UAV SECaaS: Game-Theoretic Formulation for Security as a Service in UAV Swarms"}, {"paperId": "311b82e3ef64b8be6605d7b5da75ae586fccb84b", "title": "A novel PUF-based protocol to improve the reliability of RSU for anonymous authentication in VANET"}, {"paperId": "5c29965cb7c635e4d7e4b9e56906523d41ee723d", "title": "Mutual authentication method between PUFs"}, {"paperId": "69dda80b8256f2f31aba1408ced3bf0a8ba55baa", "title": "Secure and Trusted Attestation Protocol for UAV Fleets"}, {"paperId": "c58266e1180a848310ff09143a71a4ba18e1ca86", "title": "S-MAPS: Scalable Mutual Authentication Protocol for Dynamic UAV Swarms"}, {"paperId": "db86b5ae90a47b715de3585db929617ce3b1b373", "title": "Deep Neural Networks for Securing IoT Enabled Vehicular Ad-Hoc Networks"}, {"paperId": "39c73c52d6282006127d38f67915a1082f001fc1", "title": "Security Service Pricing Model for UAV Swarms: A Stackelberg Game Approach"}, {"paperId": "76f9fc3599529318021bab7a3d2ae7fe3fd4c7e2", "title": "Blockchain-Envisioned UAV Communication Using 6G Networks: Open Issues, Use Cases, and Future Directions"}, {"paperId": "a234dfa342c37ff7712de3be96191696d1be1c68", "title": "Lightweight Authentication Protocol for Inter Base Station Communication in Heterogeneous Networks"}, {"paperId": "662659cbbfc312f76c8b2ab82acbeba055d842a8", "title": "Applications of blockchain in unmanned aerial vehicles: A review"}, {"paperId": "5dee597647e62b79d07d34a3f31459456801ca28", "title": "A Distributed Framework for Energy Trading Between UAVs and Charging Stations for Critical Applications"}, {"paperId": "e98beae7719951233f013d3899cc1f42a6c54ff7", "title": "DAGIoV: A Framework for Vehicle to Vehicle Communication Using Directed Acyclic Graph and Game Theory"}, {"paperId": "268aece62d0208a487defd8ee6f3a663700785d2", "title": "Computation Offloading for Vehicular Environments: A Survey"}]}
