{"paperId": "47a10e80c0c64775cb8ec3a35ad8520f7061ad2a", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "PODIUM: Probabilistic Datalog Analysis via Contribution Maximization", "abstract": "The use of probabilistic datalog programs has been advocated for applications that involve recursive computation and uncertainty. While using such programs allows for a flexible knowledge derivation, it makes the analysis of query results a challenging task. Particularly, given a set O of output tuples and a number k, one would like to understand which k-size subset of the input tuples has affected the most the derivation of O. This is useful for multiple tasks, such as identifying critical sources of errors and understanding surprising results. To this end, we formalize the Contribution Maximization problem and present an efficient algorithm to solve it. Our algorithm injects a refined variant of the classic Magic Sets technique, integrated with a sampling method, into top-performing algorithms for the well-studied Influence Maximization problem. We propose to demonstrate our solution in a system called PODIUM. We will demonstrate the usefulness of PODIUM using real-life data and programs, and illustrate the effectiveness of our algorithm.", "venue": "International Conference on Information and Knowledge Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-11-03", "journal": {"name": "Proceedings of the 28th ACM International Conference on Information and Knowledge Management"}, "authors": [{"authorId": "1702212", "name": "Tova Milo"}, {"authorId": "2330778", "name": "Y. Moskovitch"}, {"authorId": "1403679857", "name": "Brit Youngmann"}], "citations": []}
