{"paperId": "47a722414dde0ac24e763d94f32191d98bc1cfbf", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Dynamic Load Balancing in Stream Processing Pipelines Containing Stream-Static Joins", "abstract": "Data stream processing systems are used to continuously run mission-critical applications for real-time monitoring and alerting. These systems require high throughput and low latency to process incoming data streams in real time. However, changes in the distribution of incoming data streams over time can cause partition skew, which is defined as an unequal distribution of data partitions among workers, resulting in sub-optimal processing due to an unbalanced load. This paper presents the first solution designed specifically to address partition skew in the context of joining streaming and static data. Our solution uses state-of-the-art principles to monitor processing load, detect load imbalance, and dynamically redistribute partitions, to achieve optimal load balance. To accomplish this, our solution leverages the collocation of streaming and static data, while considering the processing load of the join and the subsequent stream processing operations. Finally, we present the results of an experimental evaluation, in which we compared the throughput and latency of four stream processing pipelines containing such a join. The results show that our solution achieved significantly higher throughput and lower latency than the competing approaches.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-29", "journal": {"name": "Electronics"}, "authors": [{"authorId": "31645784", "name": "J. Marić"}, {"authorId": "1709498", "name": "K. Pripužić"}, {"authorId": "1965904360", "name": "Martina Antonić"}, {"authorId": "3012612", "name": "D. Škvorc"}], "citations": []}
