{"paperId": "47b249761ef11b39000bcf17becde08369359c84", "publicationVenue": {"id": "23b19734-498b-40c2-8d23-97c1382309cc", "name": "Construction Innovation", "type": "journal", "alternate_names": ["Construction Innovation: Information, Process, Management", "Constr Innov", "Constr Innov Inf Process Manag"], "issn": "1471-4175", "url": "https://www.emerald.com/insight/publication/issn/1471-4175", "alternate_urls": ["https://www.emeraldgrouppublishing.com/ci.htm"]}, "title": "Redefining the construction managerial landscape to facilitate Industry 4.0 implementation: scientometric mapping of research frontiers", "abstract": "\nPurpose\nThis study aims to provide an excellent overview of current research trends in the construction sector in digital advancements. It provides a roadmap to policymakers for the effective utilisation of emergent digital technologies and a need for a managerial shift for its smooth adoption.\n\n\nDesign/methodology/approach\nA total of 3,046 peer-reviewed journal review articles covering Internet of Things (IoT), blockchain, building information modelling (BIM) and digital technologies within the construction sector were reviewed using scientometric mapping and weighted mind-map analysis techniques.\n\n\nFindings\nProminent research clusters identified were: practice-factor-strategy, system, sustainability, BIM and construction worker safety. Leading countries, authors, institutions and their collaborative networks were identified with the UK, the USA, China and Australia leading this field of research. A conceptual framework for an IoT-based concrete lifecycle quality control system is provided.\n\n\nOriginality/value\nThe study traces the origins of the initial application of Industry 4.0 concepts in the construction field and reviews available literature from 1983 to 2021. It raises awareness of the latest developments and potential landscape realignment of the construction industry through digital technologies conceptual framework for an IoT-based concrete lifecycle quality control system is provided.\n", "venue": "Construction Innovation", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-13", "journal": {"name": "Construction Innovation"}, "authors": [{"authorId": "143882153", "name": "Arka Ghosh"}, {"authorId": "1703056", "name": "J. Abawajy"}, {"authorId": "2054444893", "name": "Morshed U. Chowdhury"}], "citations": []}
