{"paperId": "47ba5be1c1f746ba8afa05577fd457b1476cf4b0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Hdconfigor: Automatically Tuning High Dimensional Configuration Parameters for Log Search Engines", "abstract": "Search engines are nowadays widely applied to store and analyze logs generated by large-scale distributed systems. To adapt to various workload scenarios, log search engines such as Elasticsearch usually expose a large number of performance-related configuration parameters. As manual configuring is time consuming and labor intensive, automatically tuning configuration parameters to optimize performance has been an urgent need. However, it is challenging because: 1) Due to the complex implementation, the relationship between performance and configuration parameters is difficult to model and thus the objective function is actually a black box; 2) In addition to application parameters, JVM and kernel parameters are also closely related to the performance and together they construct a high dimensional configuration space; 3) To iteratively search for the best configuration, a tool is necessary to automatically deploy the newly generated configuration and launch tests to measure the corresponding performance. To address these challenges, this paper designs and implements HDConfigor, an automatic holistic configuration parameter tuning tool for log search engines. In order to solve the high dimensional optimization problem, we propose a modified Random EMbedding Bayesian Optimization algorithm (mREMBO) in HDConfigor which is a black-box approach. Instead of directly using a black-box optimization algorithm such as Bayesian optimization (BO), mREMBO first generates a lower dimensional embedded space through introducing a random embedding matrix and then performs BO in this embedded space. Therefore, HDConfigor is able to find a competitive configuration automatically and quickly. We evaluate HDConfigor in an Elasticsearch cluster with different workload scenarios. Experimental results show that compared with the default configuration, the best relative median indexing results achieved by mREMBO can reach $2.07\\times $ . In addition, under the same number of trials, mREMBO is able to find a configuration with at least a further 10.31% improvement in throughput compared to Random search, Simulated Annealing and BO.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "80638-80653", "volume": "8"}, "authors": [{"authorId": "2099113460", "name": "Hui Dou"}, {"authorId": "49490237", "name": "Pengfei Chen"}, {"authorId": "144291579", "name": "Zibin Zheng"}], "citations": [{"paperId": "166f20a55c9770881d5761731d4c2af7ac942bfb", "title": "Towards an Optimized Distributed Message Queue System for AIoT Edge Computing: A Reinforcement Learning Approach"}, {"paperId": "315863a111d1632dc3669bc5929fb50adcb7b073", "title": "DMSConfig: Automated Configuration Tuning for Distributed IoT Message Systems Using Deep Reinforcement Learning"}, {"paperId": "8557335220528320364587c47ca88dd0ff7924d0", "title": "LuxIO: Intelligent Resource Provisioning and Auto-Configuration for Storage Services"}, {"paperId": "e0917b7f212261e01194b6eb6e190f1b66ce002b", "title": "ATConf: auto-tuning high dimensional configuration parameters for big data processing frameworks"}, {"paperId": "6e02f1dda7075f9a101d6557fd206c5ecf994377", "title": "DeepCAT: A Cost-Efficient Online Configuration Auto-Tuning Approach for Big Data Frameworks"}, {"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases"}, {"paperId": "0ed175d0e4eaa7c488b7ce9f0317416682d18d3a", "title": "Tuning of Elasticsearch Configuration: Parameter Optimization Through Simultaneous Perturbation Stochastic Approximation"}, {"paperId": "54525759533286c73c6bdad52ded0048d3688cb4", "title": "Automatic configuration of the Cassandra database using irace"}, {"paperId": "ea6bc2c6165c2ae36dfa5949e72b5ae361013bbe", "title": "Determining a consistent experimental setup for benchmarking and optimizing databases"}]}
