{"paperId": "47bbd78c67e8d51353a4e86009a22a3706ae7d03", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Computation Offloading and Content Caching Delivery in Vehicular Edge Computing: A Survey", "abstract": "Autonomous Vehicles (AVs) generated a plethora of data prior to support various vehicle applications. Thus, a big storage and high computation platform is necessary, and this is possible with the presence of Cloud Computing (CC). However, the computation for vehicular networks at the cloud computing suffers from several drawbacks, such as latency and cost, due to the proximity issue. As a solution, the computing capability has been recently proposed at the edge of vehicular networks, which is known as Vehicle Edge Computing (VEC). This leads to other open problems for vehicles to offload and compute data at edge nodes, and also how data is cached in edge nodes and then disseminated to other vehicles. In this paper, we initially present an overview of VEC architectures including types of layers, fog nodes, communication technologies and also vehicle applications, which are used in data offloading and dissemination scenarios. Since the mobility is critical on the VEC performance, the mobility model used in the VEC scenario is also discussed. We extensively review the Computation Offloading (ComOf) techniques as well as Content Caching and Delivery (CachDel) approaches for VEC. We finally highlight some key research challenges, issues and future works in the paper", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-12-17", "journal": {"name": "ArXiv", "volume": "abs/1912.07803"}, "authors": [{"authorId": "2837197", "name": "R. Dziyauddin"}, {"authorId": "1713586", "name": "D. Niyato"}, {"authorId": "3046954", "name": "Nguyen Cong Luong"}, {"authorId": "40621065", "name": "M. Izhar"}, {"authorId": "1469140152", "name": "Marwan Hadhari"}, {"authorId": "5481494", "name": "S. Daud"}], "citations": [{"paperId": "567fef9eaf239e35143ce89539e3efaa18439624", "title": "Deep Reinforcement Learning Based on Parked Vehicles-Assisted for Task Offloading in Vehicle Edge Computing"}, {"paperId": "f9a16392a6fc7e85909c68918f0de7072830bd66", "title": "Vehicle as a Service (VaaS): Leverage Vehicles to Build Service Networks and Capabilities for Smart Cities"}, {"paperId": "78590f5f845297136c281e8d99159a9ed6979e6e", "title": "An Investigation of Task Offloading Latency in Edge-Cloud Environment Using Machine Learning Techniques"}, {"paperId": "c8d2f363bc2863b0d066cfe8261bf277150a59ca", "title": "A Review on AI-Enabled Content Caching in Vehicular Edge Caching and Networks"}, {"paperId": "ed3a3a877100696f239c5055c8f28d58c2319d65", "title": "Minimization of VANET execution time based on joint task offloading and resource allocation"}, {"paperId": "67b63cfa933954a3ed4d49dfd344398cd84cb0d8", "title": "A Novel Distributed Task Scheduling Framework for Supporting Vehicular Edge Intelligence"}, {"paperId": "3d58105c22edfc243654f9519f053121ffb85129", "title": "Multi-Task Offloading Based on Optimal Stopping Theory in Edge Computing Empowered Internet of Vehicles"}, {"paperId": "fd99f8dd9fb26289ee694d1f60a88cd5c7be4197", "title": "Vehicular Edge Computing: Architecture, Resource Management, Security, and Challenges"}, {"paperId": "b70badd108d58bb0cfc577da92ce4cc531a54da0", "title": "A Survey on Caching in Mobile Edge Computing"}, {"paperId": "af45caeb6663e4ef995d14a851bfe7bf2ec8b3f4", "title": "Heuristic and Reinforcement Learning Algorithms for Dynamic Service Placement on Mobile Edge Cloud"}, {"paperId": "af8accc871c7f5c1207130c74142f3630cb25d8e", "title": "Dynamics in Coded Edge Computing for IoT: A Fractional Evolutionary Game Approach"}, {"paperId": "94104b69a27054a0d0b123c10441330eca915372", "title": "A survey on computation resource allocation in IoT enabled vehicular edge computing"}, {"paperId": "1f51588d395399645fd48dde701bb5602a935f64", "title": "Optimized Contextual Data Offloading in Mobile Edge Computing"}, {"paperId": "1e6e358de859b2eddd32729415035b867de9f0db", "title": "Data quality-aware task offloading in Mobile Edge Computing: An Optimal Stopping Theory approach"}, {"paperId": "fc775bfb6e3420bb8b3ec4cf047df75553cf8d37", "title": "Applications of Game Theory in Vehicular Networks: A Survey"}, {"paperId": "643fd12d7102cc542196ed5080e36f6b0a4fe02c", "title": "Revenue and Energy Efficiency-Driven Delay-Constrained Computing Task Offloading and Resource Allocation in a Vehicular Edge Computing Network: A Deep Reinforcement Learning Approach"}, {"paperId": "1f1cb13b6d6e92c2e9ead983a6426be551622534", "title": "Vehicle Speed Aware Computing Task Offloading and Resource Allocation Based on Multi-Agent Reinforcement Learning in a Vehicular Edge Computing Network"}, {"paperId": "01d3d30fb5de9953baba6fb1e02a36ee88cd5062", "title": "Swarm Intelligence for Next-Generation Wireless Networks: Recent Advances and Applications"}, {"paperId": "f3c4919dc488f5437d66c3361646605561e6c624", "title": "Game Theoretic Approaches in Vehicular Networks: A Survey"}, {"paperId": "3c0bbd7cefa0c8d628a7cab08eb7735dae73c521", "title": "A Survey of State-of-the-Art on Edge Computing: theoretical Models, Technologies, Directions, and Development Paths"}, {"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks"}, {"paperId": "12ed5dab2a6e808c2bafc96dad687fdc50c13e35", "title": "Scalable Edge Computing for IoT and Multimedia Applications Using Machine Learning"}, {"paperId": "448ebedf3d1e985fd416354db084cddc87f36e66", "title": "Investigating and Modelling of Task Offloading Latency in Edge-Cloud Environment"}, {"paperId": "78475d3e2dc297e416217694afdc59fd1f8a6402", "title": "Advanced Deep Learning-Based Computational Offloading for Multilevel Vehicular Edge-Cloud Computing Networks"}]}
