{"paperId": "47d6afe5756109d7090b1c3f821d9e10ebc714b8", "publicationVenue": null, "title": "Incrementalizing Graph Algorithms", "abstract": "Incremental algorithms are important to dynamic graph analyses, but are hard to write and analyze. Few incremental graph algorithms are in place, and even fewer offer performance guarantees. This paper approaches this by proposing to incrementalize existing batch algorithms. We identify a class of incrementalizable algorithms abstracted in a fixpoint model. We show how to deduce an incremental algorithm AΔ from such an algorithm A. Moreover, AΔ can be made bounded relative to A, i.e., its cost is determined by the sizes of changes to graphs and changes to the affected area that is necessarily checked by batch algorithm A. We provide generic conditions under which a deduced algorithm AΔ warrants to be correct and relatively bounded, by adopting the same logic and data structures of A, at most using timestamps as an additional auxiliary structure. Based on these, we show that a variety of graph-centric algorithms can be incrementalized with relative boundedness. Using real-life and synthetic graphs, we experimentally verify the scalability and efficiency of the incrementalized algorithms.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "144502903", "name": "W. Fan"}, {"authorId": "2072927082", "name": "Chao Tian"}, {"authorId": "144104152", "name": "Ruiqi Xu"}, {"authorId": "2057788882", "name": "Qiang Yin"}, {"authorId": "37681774", "name": "Wenyuan Yu"}, {"authorId": "1709595", "name": "Jingren Zhou"}], "citations": [{"paperId": "95ded2a69df2362b445f27d17a0d6bc5c3d71d49", "title": "Ingress: an automated incremental graph processing system"}, {"paperId": "bce8075ca74c49a51fbca7fae43bdbfd23d2152d", "title": "Incremental Computation: What Is the Essence? (Invited Contribution)"}, {"paperId": "2af61b106bcff5fe2cda8b116ea3df446292e796", "title": "Maximal D-truss Search in Dynamic Directed Graphs"}, {"paperId": "91d8a4527c26c1beea748daff3bebd905638d315", "title": "Incremental Consistent Updating of Incomplete Databases"}, {"paperId": "3a64f4551ad5297ff6d89e9464c9cccb72b464bb", "title": "Big Graphs: Challenges and Opportunities"}, {"paperId": "976f512259ad595c2dd7c79e3f9e40b0d319cebb", "title": "Relative Subboundedness of Contraction Hierarchy and Hierarchical 2-Hop Index in Dynamic Road Networks"}, {"paperId": "ab9e132e3bdeeb2221c7a4c02b55b8b32dca12ed", "title": "Towards Building Live Open Scientific Knowledge Graphs"}, {"paperId": "71b429ab86d05a1a78799b56aea8c348b11b8150", "title": "Incremental Graph Computations: Doable and Undoable"}, {"paperId": "fecd5bd7c6ffd7b1c9efca939113de8b7054af5d", "title": "GraphScope: A Unified Engine For Big Graph Processing"}]}
