{"paperId": "47da1565b4ecf8b825af57d115d8daa09e96c1bd", "publicationVenue": null, "title": "Theme Mapping and Bibliometrics Analysis of One Decade of Big Data Research in the Scopus Database", "abstract": "Recently, the popularity of big data as a research field has shown continuous and wide-scale growth. This study aims to capture the scientific structure and topic evolution of big data research using bibliometrics and text mining-based analysis methods. Bibliographic data of journal articles regarding big data published between 2009 to 2018 were collected from the Scopus database and analyzed. The results show a significant growth of publications since 2014. Furthermore, the findings of this study highlight the core journals, most cited articles, top productive authors, countries, and institutions. Secondly, a unique approach to identifying and analyzing major research themes in big data publications was proposed. Keywords were clustered, and each cluster was labeled as a theme. Moreover, the papers were divided into four sub-periods to observe the thematic evolution. The theme mapping reveals that research on big data is dominated by big data analytics, which covers methods, tools, supporting infrastructure, and applications. Other critical aspects of big data research are security and privacy. Social networks and the Internet of things are significant sources of big data, and the resources and services offered by cloud computing strongly support the management and processing of big data.", "venue": "Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-28", "journal": {"name": "Inf.", "pages": "69", "volume": "11"}, "authors": [{"authorId": "65763306", "name": "Anne Parlina"}, {"authorId": "3028712", "name": "K. Ramli"}, {"authorId": "3157203", "name": "H. Murfi"}], "citations": [{"paperId": "27334106ba61f0d11be5aad2026b9234b03868ff", "title": "DEVELOPMENTS AND TRENDS IN CYBERSECURITY AGAINST HUMAN FACTORS AND TIME PRESSURE USING BIBLIOMETRIC ANALYSIS"}, {"paperId": "9e2b0bebedda15c8e140ec1fc0fb90e8f4b1b356", "title": "Exploring the scientific research on coal fly ash and agriculture: knowledge mapping and future research directions"}, {"paperId": "4bfc5880a583d64137130fbd419ae60ee1fb70b6", "title": "Exploring Trends in Innovation within Digital Economy Research: A Scientometric Analysis"}, {"paperId": "ee282f0d2efc7e609452394add0fa5ca91d0e05e", "title": "Bibliometric Examination of Global Scientific Research about Carbapenem-Resistant Acinetobacter Baumannii (CRAB)"}, {"paperId": "6525c633d3812bc8174ce0c6bc292d67b13ca771", "title": "Circular economy and agriculture: mapping scientific productivity, research pattern and future research direction"}, {"paperId": "b6930cae0dc7a00e1d84cc370915b985913f30d3", "title": "Current Trends in Math Anxiety Research: a Bibliometric Approach"}, {"paperId": "92a3116cbf52b167b6e2d1a177ca4337a503bd5e", "title": "Bibliometric Analysis of Research Regarding Citarum River in Indonesia and Its Implication for Government Policy"}, {"paperId": "304bfe82fb1d54b5ab0079f912aea212eab33027", "title": "Enhancing vulnerability scoring for information security in intelligent computers"}, {"paperId": "89b01f439cf85283cb3cffb15a67d2740cb1a141", "title": "Trends and Recommendations for Enhancing Maturity Models in Supply Chain Management and Logistics"}, {"paperId": "46a9a88457823419a26da0244a000e9a04bd5e76", "title": "Evolution and trends of hikikomori: a bibliometrics analysis"}, {"paperId": "8d5ba66811bad6a0a1f919a60efde490b0459231", "title": "Bibliometric mining of research directions and trends for big data"}, {"paperId": "ea8393b1f01e1599235d745d41dda7d5514360a8", "title": "A bibliometric analysis of technology in sustainable healthcare: Emerging trends and future directions"}, {"paperId": "8a5d1556bcb78ecabe7bd473f2a68c51779c0ab1", "title": "Does medical waste research during COVID-19 meet the challenge induced by the pandemic to waste management?"}, {"paperId": "01deb8db0cee72fb458b7280c19c858d210886e6", "title": "HyFlex Learning Research and Practice: A Longitudinal Analysis"}, {"paperId": "3d8aa8ad6619ed27b6eb2c738f5901fdc37b943c", "title": "Digital twin-enabled smart facility management: A bibliometric review"}, {"paperId": "b885e71bd7c79edd77acce39088b0f656b663537", "title": "Research Implication for Infectious Skin Disease and Phytotherapy in Developing Countries Based on 21st Century Bibliometric Trends"}, {"paperId": "a6598f9da085b4b3aca3966c0cfaa41dd122e2f8", "title": "An Insight into the State of Big Data Research: A Bibliometric Study of Scientific Publications"}, {"paperId": "ce111ddef945f6f5edca75c5e23436655858a633", "title": "Bibliometric Analysis of Deep Learning Applications in Diabetes"}, {"paperId": "fdc90a50c91def90df4f6f1ee1de9459f6da3c02", "title": "Evolution of Tick Vaccinology Highlights Changes in Paradigms in This Research Area"}, {"paperId": "872de149f1e254ef8d9e529268537ac51a9ab042", "title": "Waqf and Environment: A Bibliometric Analysis"}, {"paperId": "9501eef86d38f197a918ec12b1a97d5da9a05f60", "title": "A novel deep neural network based marine predator model for effective classification of big data from social Internet of Things"}, {"paperId": "b63f36ae232c95cf8f621fd64398bff092cbab84", "title": "A scientometric study on application of electrochemical sensors for detection of pesticide using graphene-based electrode modifiers."}, {"paperId": "280a9960b5e0919c92b805fa1c86bbaf42ab3704", "title": "Multimedia big data computing mechanisms: a bibliometric analysis"}, {"paperId": "c6b97a8e2664b1d9c6fe08e0ba9a3fca28e3078a", "title": "A Bibliometric Analysis of the Scientific Research on Artisanal and Small-Scale Mining"}, {"paperId": "e2ff4e810d9b2638a9942ed14e79109ae78b2198", "title": "‘Big data’ Research: A Bibliometric Analysis of the Scopus Database, 2009–2019"}, {"paperId": "d6b1fef5bcc8084715909f98de9ac290cee85804", "title": "The Global Research Trends on the Growth of Remote Learning in Higher Education Institutions: A Bibliometric Analysis"}, {"paperId": "e3d1e06257c736dee7e56345571b1b0b51b10382", "title": "A Bibliometric Analysis of Soft Computing Technology Applications Trends and Characterisation in Educational Research: Africa"}, {"paperId": "c0ccc70610c1b33bc28d8bb15cd2efe48bdf911d", "title": "Design Demand Trend Acquisition Method Based on Short Text Mining of User Comments in Shopping Websites"}, {"paperId": "d75583b0b097cf45ec35a597c74155668a96ca82", "title": "Remediation of Pesticides by Microalgae as Feasible Approach in Agriculture: Bibliometric Strategies"}, {"paperId": "85d1de66200e9cb9d620affc5813c8e263873fd3", "title": "Global quantitative and qualitative assessment of drought research from 1861 to 2019"}, {"paperId": "5704bdb2980ff80145a00317b8229bf0a9874718", "title": "Quality Assurance in Big Data Engineering - A Metareview"}, {"paperId": "b77972e141ae7b4990b5e3c1a94cfbc74e21e828", "title": "Effects of Diesel, Heavy Metals and Plastics Pollution on Penguins in Antarctica: A Review"}, {"paperId": "c714a9dfc235abd67744dd8c395c1605104baa87", "title": "[Thematic analysis of Primary Care journals indexed in Journal Citation Reports: 2015-2019]."}, {"paperId": "b3efba6a16a72bb2df8b2cc440e003089053b47f", "title": "Thematic Analysis of Military Medical Ethics Publications From 2000 to 2020—A Bibliometric Approach"}, {"paperId": "fe8defd9eae0f788d1210231e669fd0f95c4d922", "title": "Examining the Interplay Between Big Data and Microservices - A Bibliometric Review"}, {"paperId": "782d58ae1a5fb0db191d2134f7ddb93222ae7ac5", "title": "Fifty years of information management research: A conceptual structure analysis using structural topic modeling"}, {"paperId": "54121a7eb9444bc7917ffc3ce2ea141bcb062928", "title": "A scalable eigenspace-based fuzzy c-means for topic detection"}, {"paperId": "e0c76829aaab0f08e9df88e19078b5c08013e0b3", "title": "Revealing the research landscape of Master's degrees via bibliometric analyses"}, {"paperId": "a8926f67552cfed7532438e0993b900b269bede5", "title": "Blockchain technology as an enabler of consumer trust: A text mining literature analysis"}, {"paperId": "2a617014f0f260e59c7ea1e4ba9f8a6f8f7a8da0", "title": "Deep Autoencoder-based Fuzzy C-Means for Topic Detection"}, {"paperId": "9c1b81b63dd1e29cd5b6c4332dcc16d74c2dbcae", "title": "Big Data in Business: A Bibliometric Analysis of Relevant Literature"}, {"paperId": "3853bcb610acf898fb6f965fd901f22ff5706b82", "title": "Discussing Relations Between Dynamic Business Environments and Big Data Analytics"}, {"paperId": "53863d6a01eff93372958e75e65f822e83603da5", "title": "Artificial Intelligence Application in Law: A Scientometric Review"}, {"paperId": "5e867416618d01ee823dd3ed1f20045c1c957cae", "title": "Information Security Monitoring and Management Method Based on Big Data in the Internet of Things Environment"}, {"paperId": "e0cbdfc0ebf03e24f4bfb31160757aeb78f63ceb", "title": "Digital Marketing vs. Traditional Marketing"}, {"paperId": "2b2f072ce87a39e1e9f54d58ceee8373dbd6519f", "title": "Towards a Concept for Building a Big Data Architecture with Microservices"}]}
