{"paperId": "47db723cf7fb630f5caea0aeade785e3b5bbdaab", "publicationVenue": null, "title": "Performance evaluation of WLAN in enterprise WAN with real-time applications based on OPNET modeler", "abstract": "Wireless local area networks (WLAN) has been used recently due to their benefits which exhibits outstanding mobility with easier and faster configurations. The wireless local area network performance is much influenced by both network topology and hardware specifications and thus will impact the quality of service (QoS) parameters which are delay, load, and response time. This works estimated the performance of WLAN in enterprise WAN based on the OPNET modeler. Three scenarios have been suggested which are FDDI scenario, FDDI Hybrid Star scenario, and FDDI hybrid ring scenario involving web browsing (HTTP) and file transfer protocol (FTP). Hardware objects and software configurations kept the same for all proposed scenarios. Different types of links and topologies have been applied among WLAN subnets as well as the involved gateway has been changed to measure parameters of quality of services (QoS) for all scenarios used. The findings confirmed that the FDDI Hybrid Ring scenario presents better performance than the FDDI Hybrid Star Scenario and FDDI scenario in terms of WLAN delay, WLAN load, FTP download response time, and HTTP object response time.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-02-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science", "pages": "911-918", "volume": "21"}, "authors": [{"authorId": "1414159006", "name": "M. Al-Hamiri"}, {"authorId": "6075049", "name": "H. J. Abd"}, {"authorId": "2237725740", "name": "Hanaa M. Al Abboodi"}], "citations": [{"paperId": "92ad62ed1cd55d813e40dfce7135bb67e2a65ce5", "title": "Comparative performance analysis of different queuing techniques for campus area network"}, {"paperId": "711e312f51cc3f27e8c735e3575c3645470c9032", "title": "Performance Investigation οf an ICT Network for Data Transmission"}]}
