{"paperId": "47dbb347158e017c7709fc6cbf4084b8d507aa4d", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "An Empirical Investigation into Students’ Actual Use of MOOCs in Saudi Arabia Higher Education", "abstract": "Massive Open Online Courses, or MOOCs, are a type of educational innovation where enrollment in the courses given is free and available online. The MOOCs course selection is extensive and may accommodate hundreds or thousands of students at once. The current study, however, aims to look into how the academic self-efficacy of real MOOC users affects learning engagement and perseverance in higher education in Saudi Arabia. This study added the Technology Acceptance Model (TAM) to social cognitive theory. Therefore, the primary goal is to create a new model by examining the variables that affect the perceived utility and perceived service quality, as well as the students’ general perceptions of MOOCs that are really used. Therefore, this research used a quantitative approach and distributed the questionnaire online through a Google Form. It collected data from 276 King Saud University students and used it to test the hypothesized correlations using structural equation modeling (SEM-PLS). The study’s findings showed that perceptions of perceived benefits and service quality consistently had a significant influence on social interaction, influence, networks of support, and social identity. A further finding was that reported utility and perceived service quality have always been significantly influenced by academic self-efficacy in actual MOOC use. Because of this, learning engagement and perseverance in Saudi Arabian higher education are significantly impacted by the academic self-efficacy of real MOOC users. According to the findings, MOOC programs generally have a positive influence on the kingdom’s higher education system. As a result, it is almost certain that this research model will assist university decision-makers in determining whether or not MOOC usage is prevalent at Saudi educational institutions.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-20", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "1960840", "name": "Uthman T. Alturki"}, {"authorId": "52314245", "name": "A. Aldraiweesh"}], "citations": [{"paperId": "17cd944879d81b5fe560f121cd1765e11c0593b1", "title": "Study on the National Identity Education Intentions of Pre-Service Teachers: Evidence from PLS-SEM and fsQCA"}]}
