{"paperId": "47feb78f053a18b3ced9288d459f92800a4196cf", "publicationVenue": {"id": "d2423c06-c1fe-458d-bf8a-cc24aefe3f59", "name": "International Conference on Future Internet of Things and Cloud", "type": "conference", "alternate_names": ["FiCloud", "Int Conf Future Internet Thing Cloud"]}, "title": "P-Spar(k)ql: SPARQL Evaluation Method on Spark GraphX with Parallel Query Plan", "abstract": "The Semantic Data are built from triples, that contain subjects, predicates and objects. On the other hand we can consider the triples as edges. The subject and the object are the nodes and the predicate is the label of the edge. In this view the Semantic Data define a graph. This graph can be very large, because a Semantic Dataset contains millions of triples. To query this dataset we can use the SPARQL query language. Since the Big Data tools appeared the researchers try to evaluate the SPARQL with that tools. In the last few year the distributed graph analytic tools appeared too. So the challenge is: use the graph analytic tools to evaluate the semantic query on the semantic graph. In this paper we present the PSparkql that extends the Sparkql with parallel query plan. The system uses the Spark GraphX distributed graph analytic tool. We show less edges enough for the evaluation than the Sparkql is using. We also collect some statistics (number of predicates, data properties) about the graph to change the evaluation order of the SPARQL query. We compare our results with related works: the Sparkql and the S2X.", "venue": "International Conference on Future Internet of Things and Cloud", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 IEEE 5th International Conference on Future Internet of Things and Cloud (FiCloud)", "pages": "212-219"}, "authors": [{"authorId": "47060188", "name": "G. Gombos"}, {"authorId": "144936562", "name": "A. Kiss"}], "citations": [{"paperId": "4bc652820861df5f9012bc274c72afbb7eca4481", "title": "Efficient SPARQL Evaluation on Stratified RDF Data with Meta-data"}, {"paperId": "262d93c9b1985adf406eb3fc152c8ea370c61338", "title": "Research on Apache Spark Based Transformer Areas Load Forecasting"}, {"paperId": "378c2332df0c06c4a8aac723b62e3266fea3c48b", "title": "DIAERESIS: RDF Data Partitioning and Query Processing on SPARK"}, {"paperId": "f046c8fc6c9ee114d4d1bc94e5464196e30c89c7", "title": "Semantic-Based Image Retrieval Using Balanced Clustering Tree"}, {"paperId": "f83994ae0e890f546cd5dc91ec5b44d3e54affb8", "title": "A SEMANTIC-BASED IMAGE RETRIEVAL SYSTEM USING A HYBRID METHOD K-MEANS AND K-NEAREST-NEIGHBOR"}, {"paperId": "e78f1d63c4b98d858b9475a78013c9f031b0a28e", "title": "Szemantikus adatok lekérdezése federált és osztott rendszereken"}]}
