{"paperId": "480c832e62ebc5af1248174d33a0f6b58c164234", "publicationVenue": {"id": "9d8ef1a6-70f7-4a89-8fc7-913258eb0471", "name": "International Conferences on Computing Advancements", "type": "conference", "alternate_names": ["Int Conf Control Autom", "ICCA", "International Conference on Control and Automation", "Int Conf Comput Adv"], "url": "http://www.wikicfp.com/cfp/program?id=1295"}, "title": "URL Classification Based on Lexical Features by Machine Learning", "abstract": "The malicious website becomes the hub sector in the cybercrime component of the internet. Attackers delivered malicious URLs to target users via links, emails, or advertisements. Many of the previous research has analyzed URL phishing detection with several approaches to reduce the risk. In this work, we have investigated the lexical structure of the URL as input for the classification models. The system has employed the Extreme Gradient Boosting (XGBoost), Support Vector Machine (SVM), and Artificial Neural Network (ANN) as evaluators for detecting malicious URLs. The datasets are collected from the Phish Tank website to build the proposed system. The approach has adopted static lexical features with imbalanced dataset for safer and faster extraction. Evaluation of the classifiers achieved the accuracy of 88%, 87%, and 88% respectively. The detection rate is high, a false positive rate is 0.13%, and false negative rate is 0.07% in XGBoost. The results show that the imbalanced nature of phishing URL affects the detection system performance.", "venue": "International Conferences on Computing Advancements", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-27", "journal": {"name": "2023 IEEE Conference on Computer Applications (ICCA)", "pages": "345-350"}, "authors": [{"authorId": "2223943693", "name": "Cing Gel Vung"}, {"authorId": "2220188968", "name": "Yu Yu Win"}], "citations": [{"paperId": "aff1a1d566e88380679fc59384b88dd655c21760", "title": "Secured QR Scanner (SQR) based on Query Method"}]}
