{"paperId": "483adc0b3fc4838b1af8870d6516cb49436a35f6", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Internet of things (IoT): a technology review, security issues, threats, and open challenges", "abstract": "Internet of Things (IoT) devices are spread in different areas such as e-tracking, e-commerce, e-home, and e-health, etc. Thus, during the last ten years, the internet of things technology (IoT) has been a research focus. Both privacy and security are the key concerns for the applications of IoT, and still face a huge number of challenges. There are many elements used to run the IoT technology which include hardware and software such as sensors, GPS, cameras, applications, and so forth. In this paper, we have analyzed and explain the technology of IoT along with its elements, security features, security issues, and threats that attached to each layer of IoT to guide the consideration of researchers into solve and understand the most serious problems in IoT environment.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-12-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "66223651", "name": "A. Abbood"}, {"authorId": "9086300", "name": "Qahtan Makki Shallal"}, {"authorId": "1412407676", "name": "M. Fadhel"}], "citations": [{"paperId": "871520657fc516b59e3632c3ef2b49ca5b2e7b4f", "title": "Analysis of Version Number Attack using Multiple RPL Instances"}, {"paperId": "6358227cb519ac7fe9e5bd3316b6532b7a5be7b9", "title": "A Systematic Review of IoT Security: Research Potential, Challenges and Future Directions"}, {"paperId": "ff3ba88957428307cc97d52762669c7cbe650991", "title": "IoT monitoring system for air quality assessment and collecting data"}, {"paperId": "1fd57935252c5c08a4248a791c1e657b717f550c", "title": "Design and realization of low-cost solenoid valve remotely controlled, application in irrigation network"}, {"paperId": "8eabf39e1b1838ac7d523457f3cceb8b9456be15", "title": "Low-cost SARS-CoV-2 vaccine homogenization system for Pfizer-BioNTech covid-19 vials"}, {"paperId": "404e0c9d3c71834bddcde3ee1fc4fc3f0bba0e8a", "title": "The internet of things in high andean wetland monitoring, historical review approach"}]}
