{"paperId": "4845194917aba7287709e89cb1c876c98563f820", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "An Approach for Classification of Alzheimer’s Disease Using Deep Neural Network and Brain Magnetic Resonance Imaging (MRI)", "abstract": "Alzheimer’s disease (AD) is a deadly cognitive condition in which people develop severe dementia symptoms. Neurologists commonly use a series of physical and mental tests to diagnose AD that may not always be effective. Damage to brain cells is the most significant physical change in AD. Proper analysis of brain images may assist in the identification of crucial bio-markers for the disease. Because the development of brain cells is so intricate, traditional image processing algorithms sometimes fail to perceive important bio-markers. The deep neural network (DNN) is a machine learning technique that helps specialists in making appropriate decisions. In this work, we used brain magnetic resonance scans to implement some commonly used DNN models for AD classification. According to the classification results, where the average of multiple metrics is observed, which includes accuracy, precision, recall, and an F1 score, it is found that the DenseNet-121 model achieved the best performance (86.55%). Since DenseNet-121 is a computationally expensive model, we proposed a hybrid technique incorporating LeNet and AlexNet that is light weight and also capable of outperforming DenseNet. To extract important features, we replaced the traditional convolution Layers with three parallel small filters (1×1,3×3, and 5×5). The model functions effectively, with an overall performance rate of 93.58%. Mathematically, it is observed that the proposed model generates significantly fewer convolutional parameters, resulting in a lightweight model that is computationally effective.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-29", "journal": {"name": "Electronics"}, "authors": [{"authorId": "147913237", "name": "Ruhul Amin Hazarika"}, {"authorId": "48996717", "name": "Arnab Kumar Maji"}, {"authorId": "50845571", "name": "D. Kandar"}, {"authorId": "92431973", "name": "E. Jasińska"}, {"authorId": "144182416", "name": "P. Krejci"}, {"authorId": "49770052", "name": "Zbigniew Leonowicz"}, {"authorId": "151118651", "name": "M. Jasinski"}], "citations": [{"paperId": "6d0628e55e05eb311b59be4dfd3a8b122c860bc2", "title": "Deep learning based computer aided diagnosis of Alzheimer's disease: a snapshot of last 5 years, gaps, and future directions"}, {"paperId": "3da114572e05e6bfb95bb2484a62964c57f980b0", "title": "Using hybrid pre-trained models for breast cancer detection"}, {"paperId": "aef1c4d2c629bd900fd6c5be02cb0b68687d33d9", "title": "Deep learning-based multimodality classification of chronic mild traumatic brain injury using resting-state functional MRI and PET imaging"}, {"paperId": "44ebab965026ab78aaf09fe15b05b3295b058f03", "title": "ABC Optimised CNN model for classifying Alzheimer's Disease stages"}, {"paperId": "0fb1f3c14e587f0222156e636e8fd404f856e680", "title": "An effective Alzheimer's disease segmentation and classification using Deep ResUnet and Efficientnet."}, {"paperId": "6d4e4b09c7a42521cfd7e73ea38a5e7dbd14356e", "title": "An Intelligent Detection of Alzheimer Disease Using Advanced Deep Learning Approaches"}, {"paperId": "5afe9510684185f707d5f123d33c99a20d39bcb7", "title": "Advancements in computer-assisted diagnosis of Alzheimer's disease: A comprehensive survey of neuroimaging methods and AI techniques for early detection"}, {"paperId": "4876e2f53b409c700e6277ec6228848553062dbb", "title": "Brain Status Transferring Generative Adversarial Network for Decoding Individualized Atrophy in Alzheimer's Disease"}, {"paperId": "c38eb6ace5e207ed7e4cbcfad7519465a63defeb", "title": "An Efficient Ensemble Approach for Alzheimer’s Disease Detection Using an Adaptive Synthetic Technique and Deep Learning"}, {"paperId": "0b2d41988c77c6bbf522d9ef395bbeff092c1b9d", "title": "Deep learning and image processing-based early detection of Alzheimer disease in cognitively normal individuals"}, {"paperId": "2d553532c828dc7cfdeb0e080575ef66afb45c69", "title": "Accurate Detection of Alzheimer’s Disease Using Lightweight Deep Learning Model on MRI Data"}, {"paperId": "705bf021eb299b176f4d95c25776a49e47d0e83e", "title": "A Novel Method for Diagnosing Alzheimer’s Disease from MRI Scans using the ResNet50 Feature Extractor and the SVM Classifier"}]}
