{"paperId": "48467d85d2f05c958e061c9b5c3e26f1464350ab", "publicationVenue": null, "title": "The Combination of IoT-Sensors in Appliances and block-chain Technology in Smart Cities Energy Solutions", "abstract": "The Internet of things is becoming an essential part of people's daily lives especially in smart cities where it is used to monitor processes and objects. The multifaceted procedures and decentralized nature of blockchain are integral for solving energy consumption challenges experienced in smart cities. The two technologies are the emerging techniques which can be integrated to bridge the gap between the physical and cyber world. This paper discusses the combination of blockchain technology and IoT-sensors to achieve sustainable futuristic energy solutions through effective monitoring of both the physical and electrical parameters. Consumption of electricity on a daily and weekly basis can be evaluated for home appliances and this solution helps in determining the power consumption rates and how energy costs can be reduced based on the real-time data provided. Some of the solutions include processing energy transactions efficiently, real-time monitoring and analysis of energy use, a decentralized system for self-consumption and lastly, allowing more efficient power distribution and allocation of resources based on data provided by the smart sensors.", "venue": "2020 6th International Conference on Advanced Computing and Communication Systems (ICACCS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-03-01", "journal": {"name": "2020 6th International Conference on Advanced Computing and Communication Systems (ICACCS)", "pages": "1373-1378"}, "authors": [{"authorId": "73756469", "name": "Laith T. Khrais"}], "citations": [{"paperId": "f67b8d10631398d59554160da692fdedd04ac5b9", "title": "Digital Trust and Financial Transactions: Building Confidence in Internet Banking Systems"}, {"paperId": "86ca82ad46eb1a16bf4d7aa23c85a48929db3b73", "title": "Navigating the Digital Frontier: a Deep Dive into the Pioneering Role of Augmented Reality in Revolutionizing the Landscape of E-Commerce Shopping Experiences"}, {"paperId": "6fc8e2b69e50062a2acaead1dac925e28265aada", "title": "The Immersive Frontier: Unraveling the Potential of AR Commerce in E-commerce Evolution"}, {"paperId": "2167025e41355e8c50eef97593a81bab4dba5153", "title": "Shaping the Future: Augmented Reality’s Influence on the Evolution of E-commerce"}]}
