{"paperId": "484aefd54095fd961a80c543f8c4d000a10f207e", "publicationVenue": {"id": "fc02eea3-d3cd-4144-911d-6f749c869196", "name": "IEEE Conference on Evolving and Adaptive Intelligent Systems", "type": "conference", "alternate_names": ["EAIS", "IEEE Conf Evol Adapt Intell Syst"]}, "title": "Tiny-MLOps: a framework for orchestrating ML applications at the far edge of IoT systems", "abstract": "Empowering the Internet of Things devices with Artificial Intelligence capabilities can transform all vertical applications domains within the next few years. Current approaches favor hosting Machine Learning (ML) models on Linux-based single-board computers. Nevertheless, these devices’ cost and energy requirements limit the possible application scenarios. Conversely, today’s available 32-bit microcontrollers have much lower costs and only need a few milliwatts to operate, making them an energy-efficient and cost-effective alternative. However, the latter devices, usually referred to as far edge devices, have stringent resource constraints and host non-Linux-based embedded real-time operating systems. Therefore, orchestrating such devices executing portions of ML applications represents a major challenge with current tools and frameworks. This paper formally introduces the Tiny-MLOps framework as the specialization of standard ML orchestration practices, including far edge devices in the loop. To this aim, we will tailor each phase of the classical ML orchestration loop to the reduced resources available onboard typical IoT devices. We will rely on the proposed framework to deliver adaptation and evolving capabilities to resource-constrained IoT sensors mounted on an industrial rotary machine to detect anomalies. As a feasibility study, We will show how to programmatically re-deploy ML-based anomaly detection models to far edge devices. Our preliminary experiments measuring the system performance in terms of deployment, loading, and inference latency of the ML models will corroborate the usefulness of our proposal.", "venue": "IEEE Conference on Evolving and Adaptive Intelligent Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-25", "journal": {"name": "2022 IEEE International Conference on Evolving and Adaptive Intelligent Systems (EAIS)", "pages": "1-8"}, "authors": [{"authorId": "2000961322", "name": "Mattia Antonini"}, {"authorId": "3356325", "name": "Miguel Pincheira"}, {"authorId": "9361414", "name": "M. Vecchio"}, {"authorId": "144798168", "name": "Fabio Antonelli"}], "citations": [{"paperId": "8a656f2c091429ffac4b045df3aa5e055c0a5886", "title": "An Empirical Study of Efficiency and Privacy of Federated Learning Algorithms"}, {"paperId": "2695d3c87b7ba1147e37cfcab2c09346c98271de", "title": "Unlocking the Power of Data in Telecom: Building an Effective MLOps Infrastructure for Model Deployment"}, {"paperId": "a69003ec5c77baaf8fb5d1bd730070df13d10359", "title": "LinkEdge: Open-sourced MLOps Integration with IoT Edge"}, {"paperId": "3525b6420ea8d3ca8fce544f7f75709906d24349", "title": "An Edge Deployment Framework to Scale AI in Industrial Applications"}, {"paperId": "000eb24933802466961f9b34fbe9cdbc2978a204", "title": "Self-* Capabilities of Cloud-Edge Nodes: A Research Review"}, {"paperId": "e995d5862a336fba40f7c782d2a698a0669abea7", "title": "An automatic model management system and its implementation for AIOps on microservice platforms"}, {"paperId": "9600450c059b4b37a100b27887a5048e2de484b8", "title": "An Adaptable and Unsupervised TinyML Anomaly Detection System for Extreme Industrial Environments"}, {"paperId": "030f05c6edc052f89bc91d5933a826ad83da3165", "title": "A Distributed Malicious Traffic Detection Method for Power Grid based on Private Chain"}, {"paperId": "d1a00d982d4e3c0255e34bdc25daff6a6770c1fa", "title": "SensiX++: Bringing MLOps and Multi-tenant Model Serving to Sensory Edge Devices"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}]}
