{"paperId": "484c34fec74e7da36d542f74ea1fef2f9d0bb9d8", "publicationVenue": {"id": "1b052a14-813e-4d66-8518-0be67d838692", "name": "Journal of Electrical and Computer Engineering", "type": "journal", "alternate_names": ["J Electr Comput Eng"], "issn": "2090-0147", "url": "https://www.hindawi.com/journals/jece/"}, "title": "FCM Clustering Approach Optimization Using Parallel High-Speed Intel FPGA Technology", "abstract": "Fuzzy C-Means (FCM) is a widely used clustering algorithm that performs well in various scientific applications. Implementing FCM involves a massive number of computations, and many parallelization techniques based on GPUs and multicore systems have been suggested. In this study, we present a method for optimizing the FCM algorithm for high-speed field-programmable gate technology (FPGA) using a high-level C-like programming language called open computing language (OpenCL). The method was designed to enable the high-level compiler/synthesis tool to manipulate a task-parallelism model and create an efficient design. Our experimental results (based on several datasets) show that the proposed method makes the FCM execution time more than 186 times faster than the conventional design running on a single-core CPU platform. Also, its processing power reached 89 giga floating points operations per second (GFLOPs).", "venue": "Journal of Electrical and Computer Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-11", "journal": {"name": "J. Electr. Comput. Eng.", "pages": "8260283:1-8260283:11", "volume": "2022"}, "authors": [{"authorId": "103996611", "name": "Abedalmuhdi Almomany"}, {"authorId": "1793561", "name": "Amin Jarrah"}, {"authorId": "2068660702", "name": "Anwar Al-Assaf"}], "citations": [{"paperId": "ae6a9736f1bf1b5985801c9bb630a1ec80c888aa", "title": "FPGAs memory synchronization and performance evaluation using the open computing language framework"}, {"paperId": "6484b56f156d685616cd42c977ba684b17d291c5", "title": "Optimizing Electric Vehicle Charging Station Location on Highways: A Decision Model for Meeting Intercity Travel Demand"}, {"paperId": "38a4a26976a86935e695f81bd97cdd4ab4a9ab4c", "title": "POFCM: A Parallel Fuzzy Clustering Algorithm for Large Datasets"}, {"paperId": "de39d7214498d6470ca7a578fa539d90e4e2aec8", "title": "Accelerating FCM Algorithm Using High-Speed FPGA Reconfigurable Computing Architecture"}, {"paperId": "e8878286a25041e5edf453907a6300252e5fbc1b", "title": "Implementation of a motion estimation algorithm for Intel FPGAs using OpenCL"}, {"paperId": "92d549262c2c4c5bca4fe890ec126c29a0256424", "title": "OpenCL Altera SDK v.14.0 vs. v. 13.1 Benchmarks Study"}, {"paperId": "daf28e0414f4ad3dac03dc7708110a422f0d20bd", "title": "Performance Evaluation of FPGA-Based LSTM Neural Networks for Pulse Signal Detection on Real-Time Radar Warning Receivers"}, {"paperId": "582a4f47e8bc95548b77ca1f30aeec7b86ec3c01", "title": "A New Approach of Combining Optical Mapping Algorithm with Adaptive Kalman Filter to Achieve Fast and Early Detection of Cardiac Arrests: A Parallel Implementation"}, {"paperId": "c7c00b3fd49b4af288be9956312feacf2fb96a01", "title": "A Review of the Optimal Design of Neural Networks Based on FPGA"}]}
