{"paperId": "484eb2f1d26b47949f8df68c546d324950389d98", "publicationVenue": {"id": "bd93f51e-8207-47f7-b838-1e50382eded6", "name": "Journal of the Institution of Electronics and Telecommunication Engineers", "type": "journal", "alternate_names": ["J Inst Electron Telecommun Eng", "Iete Journal of Research", "Iete J Res"], "issn": "0377-2063", "url": "http://www.tandfonline.com/loi/tijr20"}, "title": "A Secured Healthcare Management and Service Retrieval for Society Over Apache Spark Hadoop Environment", "abstract": "Typically, the amount of health data increases by their size, computational complexity, and speed. A traditional healthcare system often requires the delivery of medical data to the large storage system, which is comprised of patient’s sensitive information and causes communication overhead. Basically, medical sharing is a serious threat and also a challenging issue. For these reasons, a range of big data analytical approaches such as Machine Learning and Text Mining are often required for organizing huge amounts of data. In this paper, we focus on two big data analytics strategies: Data Retrieval and Data Management over Hadoop Distributed File System (HDFS). The functions of this paper include Privacy Protection, Data Sharing, and Management. In both stages of data retrieval and management, we first authenticate data requestors and data owners who want to store data and share the stored data in the HDFS. Secondly, we present a new model to help the requestor to select trustable and similar partners who want to access the health data stored in the HDFS clusters and give them a proper and accurate set of partners. Thirdly, we cluster patients’ medical data stored in the HDFS and find out their health status (diseases or any serious threats) using a Deep learning algorithm over Spark environment. Finally, in order to prevent the patients from serious diseases, a report is generated and forwarded to stakeholders. Our experiments illustrate the effectiveness of the proposed scheme in terms of accuracy, precision, recall, and f-measure.", "venue": "Journal of the Institution of Electronics and Telecommunication Engineers", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-16", "journal": {"name": "IETE Journal of Research", "pages": "684 - 703", "volume": "69"}, "authors": [{"authorId": "2146129270", "name": "J. Vimala Ithayan"}, {"authorId": "2142767919", "name": "C. Sundar"}], "citations": [{"paperId": "6fc86aa3cdc58ebeb1b860d268b730b39b113aee", "title": "Health Data Sharing towards Knowledge Creation"}, {"paperId": "baa2d359d3821f37f445634fc13cde02fbacb32d", "title": "Cloud-Based Data Protection and Secure Backup Solutions: A Comprehensive Review of Ensuring Business Continuity"}, {"paperId": "b9b100d484b7f6fe7fc1fccd557632340d879e3d", "title": "Cloud-based backup and data recovery"}]}
