{"paperId": "484f682813fe6923a58dc16b9250d14f95706680", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Data-Driven Smart Evaluation Framework for Teaching Effect Based on Fuzzy Comprehensive Analysis", "abstract": "In recent years, the epidemic of communicable diseases has boosted the prevalence of online teaching activities. But how to make smart evaluation towards teaching effect has always been a technical barrier. As consequence, this paper utilizes fuzzy comprehensive analysis to deal with this problem from the perspective of big data mining. In particular, it proposes a data-driven smart evaluation framework for teaching effect based on fuzzy comprehensive analysis. Firstly, business data is timely collected from online courses as the basis, including teacher performance, teaching contents, student feedback, etc. Specifically, the initial data is encoded into structured format, from which characteristics of students behaviors can be analyzed. Then, the fuzzy comprehensive analysis is utilized to calculate evaluation results of teaching effect. Some simulation experiments are conducted based on the computer programming design, in which the proposal technical framework is implemented on a developed Web platform. The experiments reflect that the proposal can well realize evaluation of teaching effect.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "23355-23365", "volume": "11"}, "authors": [{"authorId": "2210880035", "name": "Tengyun Gong"}, {"authorId": "2152810566", "name": "Junmin Wang"}], "citations": [{"paperId": "f543fc1df81e7f0bf764356eab9a75e0113cfbac", "title": "Environmental Literacy Education and Sustainable Development in Schools Based on Teaching Effectiveness"}]}
