{"paperId": "486145438164f97d4b1414af8c0d5f23f560c9de", "publicationVenue": null, "title": "Distributed Lock Management with RDMA: Decentralization without Starvation", "abstract": "Lock managers are a crucial component of modern distributed systems. However, with the increasing availability of fast RDMA-enabled networks, traditional lock managers can no longer keep up with the latency and throughput requirements of modern systems. Centralized lock managers can ensure fairness and prevent starvation using global knowledge of the system, but are themselves single points of contention and failure. Consequently, they fall short in leveraging the full potential of RDMA networks. On the other hand, decentralized (RDMA-based) lock managers either completely sacrifice global knowledge to achieve higher throughput at the risk of starvation and higher tail latencies, or they resort to costly communications in order to maintain global knowledge, which can result in significantly lower throughput. In this paper, we show that it is possible for a lock manager to be fully decentralized and yet exchange the partial knowledge necessary for preventing starvation and thereby reducing tail latencies. Our main observation is that we can design a lock manager primarily using RDMA's fetch-and-add (FA) operations, which always succeed, rather than compare-and-swap (CAS) operations, which only succeed if a given condition is satisfied. While this requires us to rethink the locking mechanism from the ground up, it enables us to sidestep the performance drawbacks of the previous CAS-based proposals that relied solely on blind retries upon lock conflicts. Specifically, we present DSLR (Decentralized and Starvation-free Lock management with RDMA), a decentralized lock manager that targets distributed systems running on RDMA-enabled networks. We demonstrate that, despite being fully decentralized, DSLR prevents starvation and blind retries by guaranteeing first-come-first-serve (FCFS) scheduling without maintaining explicit queues. We adapt Lamport's bakery algorithm to an RDMA-enabled environment with multiple bakers, utilizing only one-sided READ and atomic FA operations. Our experiments show that, on average, DSLR delivers 1.8x (and up to 2.8x) higher throughput than all existing RDMA-based lock managers, while reducing their mean and 99.9% latencies by 2.0x and 18.3x (and up to 2.5x and 47x), respectively.", "venue": "SIGMOD Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "Proceedings of the 2018 International Conference on Management of Data"}, "authors": [{"authorId": "2054253272", "name": "Dong Young Yoon"}, {"authorId": "2288980934", "name": "Mosharaf Chowdhury"}, {"authorId": "2198667", "name": "Barzan Mozafari"}], "citations": [{"paperId": "b2db407974f2cd0a3b07adfae68e40a66dc0dbbd", "title": "Lion: Minimizing Distributed Transactions through Adaptive Replica Provision (Extended Version)"}, {"paperId": "b4cfbedf30678eaeed641cf435166bd1742a1d5e", "title": "RCBench: an RDMA-enabled transaction framework for analyzing concurrency control algorithms"}, {"paperId": "31e2ef864c831a6591a1b60a651ed016e26ac890", "title": "RESCue: A State-Disaggregated NFV System with Resilience, Elasticity, and State Consistency"}, {"paperId": "65420fb10695808772f6766f0b0224dfba6405a3", "title": "Memory Disaggregation: Advances and Open Challenges"}, {"paperId": "241383febed77ed8bf86dd6b8ad7327137dff0bb", "title": "LCL: A Lock Chain Length-based Distributed Algorithm for Deadlock Detection and Resolution"}, {"paperId": "713b9914349118c312d7686493103a553f402322", "title": "Efficient Distributed Transaction Processing in Heterogeneous Networks"}, {"paperId": "c88d996b34b71fc4ac96033e0ea27e08499dcde6", "title": "GCS: Generalized Cache Coherence For Efficient Synchronization"}, {"paperId": "920f568a5f746cbf1722bd934746c315339993e7", "title": "An Adaptive Scheduling Framework for Distributed Key-Value Stores Using RDMA"}, {"paperId": "acdbef76097e9427ed9bc868a756f8af69ea79ec", "title": "Technical Report: Asymmetric Mutual Exclusion for RDMA"}, {"paperId": "4964684f2725abc5a2e1797f57f7fd64da8c4391", "title": "PRISM: Rethinking the RDMA Interface for Distributed Systems"}, {"paperId": "249c31b6a677759288698da4e2d686214e02023f", "title": "DFI: The Data Flow Interface for High-Speed Networks"}, {"paperId": "ee1dd86cf453b4f5d9753bf47f02bab00f08bf08", "title": "In-Network Support for Transaction Triaging"}, {"paperId": "47312082088702b1d6e7497f3ec6a3349505e142", "title": "Invisible Probe: Timing Attacks with PCIe Congestion Side-channel"}, {"paperId": "b4153aafc4bc46e3c59b0c5e600462c3a25e11e3", "title": "RDMA is Turing complete, we just did not know it yet!"}, {"paperId": "2fb87fece72dac972dd02d2f325a30e643096616", "title": "Consensus-based data replication protocol for distributed cloud"}, {"paperId": "3f5b2b911edef58eab9ef900e6eb23756f7dee0b", "title": "T-Lease: a trusted lease primitive for distributed systems"}, {"paperId": "b92d6ee5f51c4e7239e99698b83f80cbc8ed1ed6", "title": "HCL: Distributing Parallel Data Structures in Extreme Scales"}, {"paperId": "a99403f2c86383db8445c34ff2cc8a07fa913f3c", "title": "NetLock: Fast, Centralized Lock Management Using Programmable Switches"}, {"paperId": "45c99a58e561b019c570b0acf387ce8a588b476d", "title": "Avoiding Register Overflow in the Bakery Algorithm"}, {"paperId": "8cb252ade943f0638e192cfc09f1feb7d689f8c8", "title": "Distributed and Optimal RDMA Resource Scheduling in Shared Data Center Networks"}, {"paperId": "5c573e77829a606008bcb2bd0737b93cef3a5a5b", "title": "Modularis: Modular Data Analytics for Hardware, Software, and Platform Heterogeneity"}, {"paperId": "016b0854e8dce422d77297d1bec1ef0ba43ef0e0", "title": "AsymNVM: An Efficient Framework for Implementing Persistent Data Structures on Asymmetric NVM Architecture"}, {"paperId": "e2596c8c84bf71f33b19fef98f131e722016bc5c", "title": "Design and Evaluation of an RDMA-aware Data Shuffling Operator for Parallel Database Systems"}, {"paperId": "e07f7b953ace121daed07224bcd38f3e9b226c72", "title": "Join on Samples: A Theoretical Guide for Practitioners"}, {"paperId": "a849454dcb927488f44d361915c3436ad5a31639", "title": "Hydra : Resilient and Highly Available Remote Memory"}, {"paperId": "bc569ac5588f3b1db9dba76f14d7ed842256a9ac", "title": "Mitigating the Performance-Efficiency Tradeoff in Resilient Memory Disaggregation"}, {"paperId": "6f53f754600db3185e2edbfba6a987a8b1309da9", "title": "Strong consistency is not hard to get: Two-Phase Locking and Two-Phase Commit on Thousands of Cores"}, {"paperId": "a43de92be1926a705c4f99165dbd2ad9913b9770", "title": "RDMA Load Balancing via Data Partition"}, {"paperId": "e78dca3e013744a7ab659a58eda22d19c656dbf4", "title": "Designing Distributed Tree-based Index Structures for Fast RDMA-capable Networks"}, {"paperId": "876115d0bf67c49ab9e1637c9333d78d54a65342", "title": "Storm: a fast transactional dataplane for remote data structures"}, {"paperId": "02918ae52f30c96c55f45eb5a7018684c5bb1ff0", "title": "Scalable Data Management on Modern Networks"}, {"paperId": "4056ee540952e115f3495e2f6f7e750db380dd2f", "title": "An Efficient Framework for Implementing Persist Data Structures on Remote NVM"}, {"paperId": "37e82166eea6e55e79ca532dcc67c48ef05826ce", "title": "A Case for Asymmetric Non-Volatile Memory Architecture"}, {"paperId": "86eca4dde969ec2e0165e46b3f705bf0488b91be", "title": "Author: Please provide a title"}, {"paperId": "5b45ba0bac8daaf1fb6e85389887e8d6b25cf905", "title": "One Buffer Manager to Rule Them All: Using Distributed Memory with Cache Coherence over RDMA"}, {"paperId": "dcc8d6a87c69ca44cb6636d343347ddd6c8c3860", "title": "DPI: The Data Processing Interface for Modern Networks"}, {"paperId": "6dc70d55ee0cfcffe8eeecabad90a36d0868a092", "title": "DPI: The Data Processing Interface for Modern Networks (Extended Abstract)"}, {"paperId": "7ec69a9d6180022f01e6ea8a23cfcf18a75f1a92", "title": "This paper is included in the Proceedings of the 19th USENIX Symposium on Networked Systems Design and Implementation."}]}
