{"paperId": "48664c695d6e0e82bcee90b60bc1f78d0128a2c9", "publicationVenue": {"id": "d6283871-df25-4880-9c85-46e9830f0d22", "name": "International Euromicro Conference on Parallel, Distributed and Network-Based Processing", "type": "conference", "alternate_names": ["Int Euromicro Conf Parallel Distrib Network-based Process", "PDP", "Parallel Distrib Network-based Process", "Parallel, Distributed and Network-Based Processing"], "url": "http://www.euromicro.org/index.html"}, "title": "Attack Detection in IoT Critical Infrastructures: A Machine Learning and Big Data Processing Approach", "abstract": "The paper presents an approach to detection of attacks against Internet-of-Things networks and devices which can be used in critical infrastructures. It is based on use of machine learning and big data processing. Feature of the offered approach is using the method of reduction of output data sets and application of various algorithms of machine learning based on distributed data processing. The paper compares the speed and accuracy of attack detection on the basis of machine learning algorithms in the local and distributed modes.", "venue": "International Euromicro Conference on Parallel, Distributed and Network-Based Processing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-02-01", "journal": {"name": "2019 27th Euromicro International Conference on Parallel, Distributed and Network-Based Processing (PDP)", "pages": "340-347"}, "authors": [{"authorId": "16777650", "name": "Igor Kotenko"}, {"authorId": "145683384", "name": "I. Saenko"}, {"authorId": "10735963", "name": "Alexey Kushnerevich"}, {"authorId": "2636647", "name": "A. Branitskiy"}], "citations": [{"paperId": "9a53adb0f79f167bb24886e7c1c2c3d5835eb83c", "title": "Learning-Driven Zero Trust in Distributed Computing Continuum Systems"}, {"paperId": "5a20a640410c02a53c9afded75a395c328dadad7", "title": "A systematic literature review of machine learning applications in IoT"}, {"paperId": "8354d86b4d81dc87ae658fcc00b7b9295dd30201", "title": "An Exploratory Study of Cognitive Sciences Applied to Cybersecurity"}, {"paperId": "40e6a2e36517f8bad21b035e6085b79518094136", "title": "Static Analysis of Information Systems for IoT Cyber Security: A Survey of Machine Learning Approaches"}, {"paperId": "229ce240b71640f3d1fe8c0917e2acaff09cbfcb", "title": "Ensuring the survivability of embedded computer networks based on early detection of cyber attacks by integrating fractal analysis and statistical methods"}, {"paperId": "5827a3460a6f1615a4046cb6230e7973030d8df2", "title": "Towards Integration of Security and Safety Measures for Critical Infrastructures Based on Bayesian Networks and Graph Theory: A Systematic Literature Review"}, {"paperId": "041366584f5db376d5026c592a8584d5dc520250", "title": "NIDM: Novel Intrusion Detection Model Using CNN-LSTM for Big Data Environment"}, {"paperId": "e55577c4005bc44a4eeaca1b780f74a9dd982554", "title": "Survey of Traffic Classification Solution in IoT Networks"}, {"paperId": "f15b80c3faa75d323f678f75f2eae39397a6b887", "title": "Attack Detection in IoT using Machine Learning"}, {"paperId": "05d5e786cb59c48f74ee3aecd4a1e7b1c6b0e139", "title": "An IoT based Machine Learning Technique for Efficient Online Load Forecasting"}, {"paperId": "b948eb3c57d899366e7ff102674206a13ab1f159", "title": "A technique for early detection of cyberattacks using the traffic self-similarity property and a statistical approach"}, {"paperId": "1406d57574f2322aa7d6844a9e231d44da3bbae3", "title": "An Efficient Machine Learning Techniques Based on IoT for Effective Load Forecasting"}, {"paperId": "2fe75898077be98abddc5ff170401393bfd60f37", "title": "An Approach to Detecting Cyber Attacks against Smart Power Grids Based on the Analysis of Network Traffic Self-Similarity"}, {"paperId": "bc1e5e8a8c3b5a02e94f503a3119658631fcbafd", "title": "Model based IoT security framework using multiclass adaptive boosting with SMOTE"}, {"paperId": "8373edbdf9ad37f12c557c21b5d916c24f1e54eb", "title": "The rise of traffic classification in IoT networks: A survey"}, {"paperId": "8d2142cf2b9ffdbdaf13473c39a6b1bd737d12ba", "title": "Deep learning and big data technologies for IoT security"}, {"paperId": "24e263b699aab6466664703b024424c81f552e73", "title": "Machine Learning Approaches for Securing Internet of Things"}, {"paperId": "4f5c0aed9f450e54be04758608c809bfebb7fdf7", "title": "27th Euromicro International Conference on Parallel, Distributed and Network-Based Processing PDP 2019"}, {"paperId": "23fa0dca7c0e9d186ee625f942e171f05fd18a12", "title": "Zero Trust Architecture (ZTA): A Comprehensive Survey"}, {"paperId": "d452be19c38ca1f8a1a6bcc0c39924b3d1e1ba48", "title": "DECISION TREE BASED INTRUSION DETECTION METHOD IN THE INTERNET OF THINGS"}, {"paperId": "92bece8c07e7852316573ca781f95c0bb119299b", "title": "Machine Learning and Big Data Processing for Cybersecurity Data Analysis"}, {"paperId": "71b24deedf7ffa1ecdb66bea264854989a648255", "title": "Detection of Attacks and Anomalies in The Internet of Things System Using Neural Networks Based on Training with PSO and TLBO Algorithms"}]}
