{"paperId": "48703437461e1c4a653faef17b0e74222813974c", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "An ML‐based task clustering and placement using hybrid Jaya‐gray wolf optimization in fog‐cloud ecosystem", "abstract": "The rapid expansion of IoT systems has caused network congestion and delays in task placement and resource provisioning as usually the tasks are executed at a far location in the cloud. Fog computing reduces the computing burden of cloud data centers as well as the communication burden of the internet as fog resources are placed near the data generation points. Within Fog computing, an important challenge is the optimal task placement which is an NP‐class problem. This work applies machine learning for task clustering and addresses the task placement problem in a fog computing environment using a hybrid of two recent metaheuristics; Jaya and gray wolf optimization (GWO). The hybrid method considers optimizing the total number of active fog nodes, load balancing in fog nodes, and average response time of the tasks. The performance of the proposed method is evaluated on a real‐time LCG dataset and is compared with reinforcement learning fog scheduling (RLFS), genetic algorithm (GA), dynamic resource allocation mechanism (DRAM), load balancing and scheduling algorithm (LBSSA), and particle swarm optimization with simulated annealing (PSO‐SA) algorithms. The results demonstrate the superiority of the suggested method over the baseline techniques in terms of average improvement of 51.04% in load balance variance, 30.25% in average response time, 24.16% in execution time, and 47.10% in the number of devices used.", "venue": "Concurrency and Computation", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-02", "journal": {"name": "Concurrency and Computation: Practice and Experience"}, "authors": [{"authorId": "2256847697", "name": "Rashmi Keshri"}, {"authorId": "3211750", "name": "D. P. Vidyarthi"}], "citations": []}
