{"paperId": "4889d2241bc2fd4e2c2f3c322bea4569b6c49bad", "publicationVenue": {"id": "1db2368e-5986-4b06-9137-e63c1aa4f5e1", "name": "Symposium on Computer Architecture and High Performance Computing", "type": "conference", "alternate_names": ["SBAC-PAD", "Symp Comput Archit High Perform Comput"]}, "title": "Efficient Strategies for Graph Pattern Mining Algorithms on GPUs", "abstract": "Graph Pattern Mining (GPM) is an important, rapidly evolving, and computation demanding area. GPM computation relies on subgraph enumeration, which consists in extracting subgraphs that match a given property from an input graph. Graphics Processing Units (GPUs) have been an effective platform to accelerate applications in many areas. However, the irregularity of subgraph enumeration makes it challenging for efficient execution on GPU due to typical uncoalesced memory access, divergence, and load imbalance. Unfortunately, these aspects have not been fully addressed in previous work. Thus, this work proposes novel strategies to design and implement subgraph enumeration efficiently on GPU. We support a depth-first search style search (DFS-wide) that maximizes memory performance while providing enough parallelism to be exploited by the GPU, along with a warp-centric design that minimizes execution divergence and improves utilization of the computing capabilities. We also propose a low-cost load balancing layer to avoid idleness and redistribute work among thread warps in a GPU. Our strategies have been deployed in a system named DuMato, which provides a simple programming interface to allow efficient implementation of GPM algorithms. Our evaluation has shown that DuMato is often an order of magnitude faster than state-of-the-art GPM systems and can mine larger subgraphs (up to 12 vertices).", "venue": "Symposium on Computer Architecture and High Performance Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE 34th International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD)", "pages": "110-119"}, "authors": [{"authorId": "46825565", "name": "Samuel Ferraz"}, {"authorId": "37219300", "name": "Vinícius Dias"}, {"authorId": "145508122", "name": "Carlos H. C. Teixeira"}, {"authorId": "2711977", "name": "George Teodoro"}, {"authorId": "144433002", "name": "Wagner Meira, Jr"}], "citations": [{"paperId": "31d03b23b3ab36e8f79642777e704ed88366777d", "title": "Graph Pattern Mining Paradigms: Consolidation and Renewed Bearing"}]}
