{"paperId": "488cfab0de1cea2b1c8cd400a0391669f00075a0", "publicationVenue": {"id": "d17c802c-e89b-4bcd-81b1-22f8921283fe", "name": "International Conference on Signals and Electronic Systems", "type": "conference", "alternate_names": ["ICSES", "Int Conf Signal Electron Syst"]}, "title": "Reliability and QoS Aware Intelligent UAV Communication with Throughput Maximization in Wireless Networks", "abstract": "To perform effective traditional terrestrial communication among the wireless networks, Unmanned Ariel Networks (UAVs) are created which provides the way to perform next generation communication system. This technology consists of certain special characteristics like high speed communication and unpredictable mobility among the devices. Due to this drawback in certain period reliability issues are occurred that increases the power utilization and delay occurrences among the devices which lead to affect the overall stability. For that purpose in this Reliability and Quality of Service (QoS) Aware Intelligent UAV Communication with Throughput Maximization (RQIUT) is performed among wireless network. The core processes of this model are system model, energy consumption model, QoS requirements and throughput maximization process. Through this processes the communication among the devices are carried out without delay and unwanted power utilization and that leads to improve the performance. The implementation of this model is carried out in NS3 and the parameters which are concentrated in this analysis are energy efficiency and packet delivery ratio. From the research outcome it is proven that RQIUT perform much better when compared with the earlier baseline researches.", "venue": "International Conference on Signals and Electronic Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-14", "journal": {"name": "2023 International Conference on Innovative Computing, Intelligent Communication and Smart Electrical Systems (ICSES)", "pages": "1-5"}, "authors": [{"authorId": "2292316166", "name": "S. D. Lalitha"}, {"authorId": "2292678740", "name": "K.Suresh Kumar"}, {"authorId": "2292329492", "name": "M.Ramya"}, {"authorId": "2292329439", "name": "J.Harirajkumar"}, {"authorId": "2292305683", "name": "S. Ravi"}], "citations": []}
