{"paperId": "48981e6193d7fe2599c85359270b859007f5c0b4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Spatiotemporal Data Mining: A Survey", "abstract": "Spatiotemporal data mining aims to discover interesting, useful but non-trivial patterns in big spatial and spatiotemporal data. They are used in various application domains such as public safety, ecology, epidemiology, earth science, etc. This problem is challenging because of the high societal cost of spurious patterns and exorbitant computational cost. Recent surveys of spatiotemporal data mining need update due to rapid growth. In addition, they did not adequately survey parallel techniques for spatiotemporal data mining. This paper provides a more up-to-date survey of spatiotemporal data mining methods. Furthermore, it has a detailed survey of parallel formulations of spatiotemporal data mining.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-26", "journal": {"name": "ArXiv", "volume": "abs/2206.12753"}, "authors": [{"authorId": "2109374399", "name": "Arun Sharma"}, {"authorId": "49165342", "name": "Zhe Jiang"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "caf59855d74aab4079d207eb33ad22929b9c5a07", "title": "Dynamics of pesticides in surface water bodies by applying data mining to spatiotemporal big data. A case study for the Puglia Region"}, {"paperId": "8f4b65a267917dc822bca6935b5c20c8519ab36e", "title": "User Re-Identification via Confusion of the Contrastive Distillation Network and Attention Mechanism"}, {"paperId": "03310600617d23b26e1a4dd39095df1a054c5a7f", "title": "Constructing a spatiotemporal situational awareness framework to sense the dynamic evolution of online public opinion on social media"}, {"paperId": "b544f0b4dd9829bd037740224234b274a0eec5b9", "title": "Spatial-Temporal Data Mining for Ocean Science: Data, Methodologies, and Opportunities"}, {"paperId": "c0a91ba44d8ae1667948022c0639ecbd3dee7d50", "title": "SERT: A Transfomer Based Model for Spatio-Temporal Sensor Data with Missing Values for Environmental Monitoring"}, {"paperId": "46b33dcc37b88673d2e0d5cb7c3d63b957dc99e2", "title": "Co-cultures of cerebellar slices from mice with different reelin genetic backgrounds as a model to study cortical lamination"}, {"paperId": "765819259c81d906c8e435cdcb19d852e55fb02a", "title": "A Fast Unsupervised Spatial Temporal Trajectory Similarity Measure Based on Trajectory Image Structure Matching"}]}
