{"paperId": "48a797fd416515a1573b941ee3a276b0be9ffbca", "publicationVenue": null, "title": "Big data as a value generator in decision support systems: a literature review", "abstract": "PurposeThis paper aims to analyze how decision support systems manage Big data to obtain value.Design/methodology/approachA systematic literature review was performed with screening and analysis of 72 articles published between 2012 and 2019.FindingsThe findings reveal that techniques of big data analytics, machine learning algorithms and technologies predominantly related to computer science and cloud computing are used on decision support systems. Another finding was that the main areas that these techniques and technologies are been applied are logistic, traffic, health, business and market. This article also allows authors to understand the relationship in which descriptive, predictive and prescriptive analyses are used according to an inverse relationship of complexity in data analysis and the need for human decision-making.Originality/valueAs it is an emerging theme, this study seeks to present an overview of the techniques and technologies that are being discussed in the literature to solve problems in their respective areas, as a form of theoretical contribution. The authors also understand that there is a practical contribution to the maturity of the discussion and with reflections even presented as suggestions for future research, such as the ethical discussion. This study’s descriptive classification can also serve as a guide for new researchers who seek to understand the research involving decision support systems and big data to gain value in our society.", "venue": "Revista de Gestão", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-07-16", "journal": {"name": "Revista de Gestão"}, "authors": [{"authorId": "16244175", "name": "G. Grander"}, {"authorId": "1830391826", "name": "Luciano Ferreira da Da Silva"}, {"authorId": "2261824414", "name": "E. D. S. Santibañez Gonzalez"}], "citations": [{"paperId": "c019acb706f36541cbbf511b822487a2b56054d0", "title": "Sufficiency and necessity of big data capabilities for decision performance in the public sector"}, {"paperId": "dd7bba79a5636a9c6effe260536a9cedc50f206a", "title": "Effect of Big Data Analytics on Operational Value of Selected Healthcare Service Firms in Lagos State, Nigeria"}, {"paperId": "b6cd406b9676db3861ce233469da2a09c9b14422", "title": "A Survey on Graph Counterfactual Explanations: Definitions, Methods, Evaluation, and Research Challenges"}, {"paperId": "39afa55ddfda1e8a5f8aa87ccb50e5b674845dd6", "title": "Design and Application of Sports-Oriented Public Health Big Data Analysis Platform"}, {"paperId": "9bc0cd94f32ead96e1cb0978e8186708aba1be1e", "title": "Digital Transformation Strategies Enabled by Internet of Things and Big Data Analytics: The Use-Case of Telecommunication Companies in Greece"}]}
