{"paperId": "48ac4085301aadf276448d54112ca579db370db7", "publicationVenue": {"id": "b5e2e7a6-b98e-46c0-bf59-073f9f9638de", "name": "Arab Journal of Basic and Applied Sciences", "type": "journal", "alternate_names": ["Arab J Basic Appl Sci"], "issn": "2576-5299", "url": "https://www.tandfonline.com/loi/tabs20", "alternate_urls": ["https://www.tandfonline.com/tabs"]}, "title": "Exploring the accuracy of correlation coefficients representing the long-term meteorological data for projecting weather in Bahrain for sustainability", "abstract": "Abstract This study aims at modelling long-term weather parameters (1955 to 2020), recorded in Bahrain, and at investigating which parameters have strong correlation coefficients with such data to account for mitigation and achieve sustainability. Eight forms of fitting methods were utilized to calculate the correlation coefficient between each parameter versus each given year. These parameters (Average and Anomalies) are the average temperature, maximum temperature, minimum temperature, humidity, wind speed, dust and precipitation. The forms of correlations used are as follows: Linear regression, Quadratic regression, Cubic regression, Power regression, ab-Exponential regression, Logarithmic regression, Hyperbolic regression and Exponential regression. Among all forms of regressions, the Exponential (cubic) regression is found to have the highest correlation coefficient for such data, both Average and Anomalies data; the highest is for humidity versus year (r = 0.900, strong relation), and the least is for precipitation (r = 0.1647, poor relation) for Average data. As for the Anomalies data, the highest is for humidity versus year (r = 0.9019) and the least is for precipitation versus (r = 0.1647, no relation). The novelty of this paper lies in concluding that the exponential (cubic) regression is the most accurate correlation (among 8 correlation coefficients) to predict all the recorded long-term (65 years) weather parameters in Bahrain eight correlation. This regression fit is the most useful one in projecting the weather trend by 2050 in Bahrain to account for the future built environment to become more resilient, sustainable and tolerant with the environment due to the anticipated damage resulting from climate change. More investigation is to be made for other data set in the Gulf Cooperation Countries, and worldwide, to explore whether this Exponential (cubic) regression will still have the highest correlation coefficient among the others.", "venue": "Arab Journal of Basic and Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-09", "journal": {"name": "Arab Journal of Basic and Applied Sciences", "pages": "231 - 247", "volume": "30"}, "authors": [{"authorId": "2138822321", "name": "W. Alnaser"}, {"authorId": "2149895813", "name": "N. W. Alnaser"}, {"authorId": "100570244", "name": "M. Alothman"}, {"authorId": "2189317461", "name": "H. H. Al-Aali"}], "citations": []}
