{"paperId": "48b9ad2942dbbd7837b4acc9a1e50b6c0abc0fa2", "publicationVenue": {"id": "6625af65-e8dc-49f0-93fb-69824c0657c1", "name": "Machines", "issn": "2075-1702", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318010", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318010", "https://www.mdpi.com/2075-1702/5/4/24", "https://www.mdpi.com/journal/machines"]}, "title": "Logistic Model Tree Forest for Steel Plates Faults Prediction", "abstract": "Fault prediction is a vital task to decrease the costs of equipment maintenance and repair, as well as to improve the quality level of products and production efficiency. Steel plates fault prediction is a significant materials science problem that contributes to avoiding the progress of abnormal events. The goal of this study is to precisely classify the surface defects in stainless steel plates during industrial production. In this paper, a new machine learning approach, entitled logistic model tree (LMT) forest, is proposed since the ensemble of classifiers generally perform better than a single classifier. The proposed method uses the edited nearest neighbor (ENN) technique since the target class distribution in fault prediction problems reveals an imbalanced dataset and the dataset may contain noise. In the experiment that was conducted on a real-world dataset, the LMT forest method demonstrated its superiority over the random forest method in terms of accuracy. Additionally, the presented method achieved higher accuracy (86.655%) than the state-of-the-art methods on the same dataset.", "venue": "Machines", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-24", "journal": {"name": "Machines"}, "authors": [{"authorId": "2179691199", "name": "Bita Ghasemkhani"}, {"authorId": "2066624120", "name": "Reyat Yilmaz"}, {"authorId": "2808975", "name": "Derya Birant"}, {"authorId": "9288221", "name": "R. A. Kut"}], "citations": []}
