{"paperId": "48ba9a76903c247393996b55a76c16895250dd40", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Sustainable Monitoring of Mining Activities: Decision-Making Model Using Spectral Indexes", "abstract": "In response to the escalating demand for mineral resources and the imperative for sustainable management of natural assets, the development of effective methods for monitoring mining excavations is essential. This study presents an innovative decision-making model that employs a suite of spectral indices for the sustainable monitoring of mining activities. The integration of the Combinational Build-up Index (CBI) with additional spectral indices such as BRBA and BAEI, alongside multitemporal analysis, enhances the detection and differentiation of mining areas, ensuring greater stability and reliability of results, particularly when applied to single datasets from the Sentinel-2 satellite. The research indicates that the average accuracy of excavation detection (overall accuracy, OA) for all test fields and data is approximately 72–74%, varying with the method employed. Utilizing a single CBI index often results in a significant overestimation of producer’s accuracy (PA) over user’s accuracy (UA), by about 10–14%. Conversely, the introduction of a set of three complementary indices achieves a balance between PA and UA, with discrepancies of approximately 1–3%, and narrows the range of result variations across different datasets. Furthermore, the study underscores the limitations of employing average threshold values for excavation monitoring and suggests the adoption of dedicated monthly thresholds to diminish accuracy variability. These findings could have considerable implications for the advancement of autonomous and largely automated systems for the surveillance of illegal mining excavations, providing a predictable and reliable methodology for remote sensing applications in environmental monitoring.", "venue": "Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-18", "journal": {"name": "Remote. Sens.", "pages": "388", "volume": "16"}, "authors": [{"authorId": "152146791", "name": "Krystyna Michałowska"}, {"authorId": "2104344808", "name": "Tomasz Pirowski"}, {"authorId": "2050642727", "name": "E. Głowienka"}, {"authorId": "2247050615", "name": "Bartłomiej Szypuła"}, {"authorId": "2116718", "name": "E. Malinverni"}], "citations": []}
