{"paperId": "48c35b6b3128c3d35b015c665ab9c8133071df0b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Integrated Scalable Framework for Cloud and IoT Based Green Healthcare System", "abstract": "Recent developments in IoT-enabled cloud computing and interactive applications have made researchers rethink how healthcare services are currently provided. The IoT-cloud-based systems facilitate remote monitoring and support for patients. However, in the existing area, much emphasis has not been given to making the healthcare systems green. So, in this paper, we present an integrated framework for green healthcare and use cutting-edge technology to make an interactive user interface. We have also ensured the system’s scalability and performance ratio. This system interface has been designed and developed for patients and doctors, where patients can send their healthcare data using wearable sensors, and doctors can receive those data in real-time. For data identification and analysis, we have adopted Hierarchical Clustering Algorithms. Finally, we have come up with a solution for how to make the interactive healthcare experience better for everyone.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "22266-22282", "volume": "11"}, "authors": [{"authorId": "3309048", "name": "Md. Motaharul Islam"}, {"authorId": "2210578490", "name": "Zaheed Ahmed Bhuiyan"}], "citations": [{"paperId": "088d216b6783e2e5cffbc4f145ccdf95cd74a3a3", "title": "Enabling pandemic‐resilient healthcare: Narrowband Internet of Things and edge intelligence for real‐time monitoring"}, {"paperId": "4cf4083fa28d1a892a179f9da0f1d978a4efdbd2", "title": "Enhancing the Healthcare Management System with National Identification: In the Bangladesh Perspective"}, {"paperId": "286fc6d55e562eda97986d04a13cc177ed44887e", "title": "IoT-Based Object-Detection System to Safeguard Endangered Animals and Bolster Agricultural Farm Security"}, {"paperId": "52c17a191cd4d096e3574a96b738a9b4bd18900b", "title": "An IoT- and Cloud-Based E-Waste Management System for Resource Reclamation with a Data-Driven Decision-Making Process"}, {"paperId": "b768e489e9c985609affe71694fa3f74a4bc1cd6", "title": "A New PUF-Based Protocol for Mutual Authentication and Key Agreement Between Three Layers of Entities in Cloud-Based IoMT Networks"}]}
