{"paperId": "48c73c389c3f36d70407eb8309a0b41578c15fc8", "publicationVenue": {"id": "f7ca1c46-3152-4284-bb2c-f54462a4ec59", "name": "IET Quantum Communication", "type": "journal", "alternate_names": ["IET Quantum Commun"], "issn": "2632-8925", "url": "https://ietresearch.onlinelibrary.wiley.com/journal/26328925", "alternate_urls": ["https://digital-library.theiet.org/content/journals/iet-qtc"]}, "title": "QProv: A provenance system for quantum computing", "abstract": "Quantum computing promises breakthroughs in various application areas, such as machine learning, chemistry, or simulations. However, today’s quantum computers are error ‐ prone and have limited capabilities. This leads to various challenges when developing and executing quantum algorithms, for example, the mitigation of occurring errors or the selection of a suitable quantum computer to execute a certain quantum circuit. To address these challenges, detailed information about the quantum circuit to be executed as well as past executions, and the up ‐ to ‐ date information about the available quantum computers are required. Thus, this data must be continuously collected and stored in the long ‐ term, which is currently not supported. To overcome this problem, a provenance approach is introduced for quantum computing. Therefore, relevant provenance attributes that should be gathered in the area of quantum computing are identified. Furthermore, QProv, a provenance system that automatically collects the identified provenance attributes and provides them in a uniform manner to the user is introduced. Finally, a case study with the collected provenance data and corresponding use cases that can benefit from this provenance data are presented here.", "venue": "IET Quantum Communication", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-17", "journal": {"name": "IET Quantum Commun.", "pages": "171-181", "volume": "2"}, "authors": [{"authorId": "1474569575", "name": "Benjamin Weder"}, {"authorId": "2890261", "name": "Johanna Barzen"}, {"authorId": "1688415", "name": "F. Leymann"}, {"authorId": "51418452", "name": "Marie Olivia Salm"}, {"authorId": "1565015599", "name": "Karoline Wild"}], "citations": [{"paperId": "1ab7b8b0d8cb75767a31950d15c4aa7978684389", "title": "Dispatching Shots Among Multiple Quantum Computers: An Architectural Proposal"}, {"paperId": "a7e2cac05048c8de6519e99b9c4111fb11a9d093", "title": "Architectural Vision for Quantum Computing in the Edge-Cloud Continuum"}, {"paperId": "0a605274472d93670458375401983714f27db056", "title": "Provenance-Preserving Analysis and Rewrite of Quantum Workflows for Hybrid Quantum Algorithms"}, {"paperId": "c17dec0732066ec8708c5b094895fa88a8157b19", "title": "Prioritization of Compiled Quantum Circuits for Different Quantum Computers"}, {"paperId": "006ff094ac3a8ca9006fe01493caeb440ece58d2", "title": "Quantum Software Development Lifecycle"}, {"paperId": "eeaf193ba1d1fced86b23387a555bb4c8e75e815", "title": "Hybrid Quantum Applications Need Two Orchestrations in Superposition: A Software Architecture Perspective"}, {"paperId": "a97dcdcd16a528c154ce1a1add9cb82b00f4632d", "title": "How to Select Quantum Compilers and Quantum Computers Before Compilation"}, {"paperId": "800908f83398a6bea5df126963354f21cb508870", "title": "Analysis and Rewrite of Quantum Workflows: Improving the Execution of Hybrid Quantum Algorithms"}, {"paperId": "80d444fc667e79ea947f0e62048ee57f729f8f8b", "title": "Non-Functional Requirements for Quantum Programs"}, {"paperId": "0768051d805657408c7bf1fbef78aeb1b2c5ff54", "title": "Conﬁgurable Readout Error Mitigation in Quantum Workﬂows"}]}
