{"paperId": "48d10dc4b50749d99977b5c769466c6539cdc7e2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Taxonomic Exploration of Healthcare IoT: Challenges, Solutions, and Future Frontiers", "abstract": "An Internet of things (IoT) ecosystem is a fast-developing network in which users can connect a heterogeneity of physical and virtual devices, including customized healthcare areas. As medical resources are scarce, populations are aging with chronic diseases and require remote monitoring, medical expenses are rising, and telemedicine is being demanded in developing nations, the IoT is an attractive topic in healthcare. Through the IoT, people can enjoy better health and diminish pressure on sanitary systems. In this study, previously published studies in Healthcare IoT (HIoT) systems are detailed, analyzed, and taxonomically classified. By categorizing the articles according to the types of HIoT systems, we dispense a detailed taxonomical study. In addition, different evaluation methodologies, tools, and metrics are discussed, along with their advantages and disadvantages. The studies indicate that power management, trust, privacy, fog computing, and resource management are among the open issues. The future of the Internet includes tactile networks, social networks, big data analytics, software-defined networking, network function virtualization, the Internet of nano things (IoNT), and blockchain. It would be beneficial to study and research HioT systems further in terms of interoperability, the implementation of real-world test beds, scalability, and mobility.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2266070220", "name": "Lutifa Alashlam"}, {"authorId": "2211195672", "name": "Ahmad Alzubi"}], "citations": []}
