{"paperId": "48dd2e58a469c42590d70f121c78a14731db6cc2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Towards Smart Data Selection From Time Series Using Statistical Methods", "abstract": "Transmitting and storing large volumes of dynamic / time series data collected by modern sensors can represent a significant technological challenge. A possibility to mitigate this challenge is to effectively select a subset of significant data points in order to reduce data volumes without sacrificing the quality of the results of the subsequent analysis. This paper proposes a method for adaptively identifying optimal data point selection algorithms for sensor time series on a window-by-window basis. Thus, this contribution focuses on quantifying the effect of the application of data selection algorithms to time series windows. The proposed approach is first used on multiple synthetically generated time series obtained by concatenating multiple sources one after the other, and then validated in the entire UCR time series public data archive.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "44390-44401", "volume": "9"}, "authors": [{"authorId": "2064904491", "name": "Amaia Gil"}, {"authorId": "1705562", "name": "M. Quartulli"}, {"authorId": "1718834", "name": "Igor García Olaizola"}, {"authorId": "144286136", "name": "B. Sierra"}], "citations": [{"paperId": "cdfd74a75d8e39057c627a7dc24712f870a438d8", "title": "Viewing China's escalating heatwaves through the lens of complex networks"}, {"paperId": "826e53e4e46ae3a3d5ca35b1d82ff6ab31c5803e", "title": "MinMaxLTTB: Leveraging MinMax-Preselection to Scale LTTB"}, {"paperId": "371ab88fee44168145ae538e3c78a66573d312da", "title": "Data Point Selection for Line Chart Visualization: Methodological Assessment and Evidence-Based Guidelines"}]}
