{"paperId": "48f72b29b44dd3ec721f75bc211e01a05b145509", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "LSTPD: Least Slack Time-Based Preemptive Deadline Constraint Scheduler for Hadoop Clusters", "abstract": "Big data refers to numerous forms of complex and large datasets which need distinctive computational platforms in order to be analyzed. Hadoop is one of the popular frameworks for analytics of big data. In Hadoop, a big job is split into multiple small tasks and then they are distributed to worker nodes in a parallel way using MapReduce to speed up computational processes. In this aspect, it is important how to improve throughput performance. MapReduce jobs require quick responses from the worker nodes to complete them under their deadlines. The existing scheduling schemes for Hadoop such as FIFO, fair, and capacity schedulers cannot guarantee the quick response requirement satisfying a prior deadline. Thus, Hadoop system needs to improve response time and completion time for the heterogeneous MapReduce jobs. In this paper, we propose an efficient preemptive deadline constraint scheduler based on least slack time and data locality. In order for better allocation of tasks and load balancing, we first analyze the task scheduling behaviors of the Hadoop platform. Based on that, we propose a novel preemptive approach which considers the remaining execution time of the job being executed in deciding preemption. The experimental results show that the proposed scheme significantly reduces the job execution time and queue waiting time, compared to existing schemes.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-15", "journal": {"name": "IEEE Access", "pages": "111751-111762", "volume": "8"}, "authors": [{"authorId": "2144373633", "name": "Ihsan Ullah"}, {"authorId": "2115773736", "name": "Muhammad Sajjad Khan"}, {"authorId": "2052760593", "name": "Muhammad Amir"}, {"authorId": "153187935", "name": "Junsu Kim"}, {"authorId": "2109739744", "name": "S. Kim"}], "citations": [{"paperId": "33855e2f3e8ba76004447fff9ff469ef6d4f6a6b", "title": "Hybrid metaheuristic model based performance-aware optimization for map reduce scheduling"}, {"paperId": "bce4a6acded867b966a1fc6f902b6c00b51b75be", "title": "Two phased Yarn scheduling with novel binary hypergraphed PSO"}, {"paperId": "df86437401513c56986cf6a27cde8d42c4f0a11d", "title": "New Efficient YARN Scheduler with Improved MVO"}, {"paperId": "d321758e50fdd0bbbb936608836e7de7e6b3ecad", "title": "New efficient Hadoop scheduler: Generalized particle swarm optimization and simulated annealing‐dominant resource fairness"}, {"paperId": "ba5a0cf5bb0551adfcbd870a7a3e8f853b9fe624", "title": "Reinforcement learning based energy efficient resource allocation strategy of MapReduce jobs with deadline constraint"}, {"paperId": "4359e5acf7a3a6697a23bf372d2872c534fb9cfd", "title": "SMART: Speedup Job Completion Time by Scheduling Reduce Tasks"}, {"paperId": "8f46fd1f49d591e8519d1162d001a0404bab5817", "title": "Autonomic Dominant Resource Fairness (A-DRF) in Cloud Computing"}, {"paperId": "aaee81eb73fcd2e48ce699d339a2b6de66b1b26e", "title": "An Efficient Framework for Load Balancing using MapReduce Algorithm for Bigdata"}, {"paperId": "ddefd4984640fed157d207e2441824d992cb22f0", "title": "Factors affecting cloud data-center efficiency: a scheduling algorithm-based analysis"}, {"paperId": "d6db1602268c8e8fc5f80a7230b2f7b60c245268", "title": "Task Priority-Based Cached-Data Prefetching and Eviction Mechanisms for Performance Optimization of Edge Computing Clusters"}]}
