{"paperId": "4913bc81dcba5b337c50f432b6b7d2eea19d9de6", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "3DPro: Querying Complex Three-Dimensional Data with Progressive Compression and Refinement", "abstract": "Large-scale three-dimensional spatial data has gained increasing attention with the development of self-driving, mineral exploration, CAD, and human atlases. Such 3D objects are often represented with a polygonal model at high resolution to preserve accuracy. This poses major challenges for 3D data management and spatial queries due to the massive amounts of 3D objects, e.g., trillions of 3D cells, and the high complexity of 3D geometric computation. Traditional spatial querying methods in the Filter-Refine paradigm have a major focus on indexing-based filtering using approximations like minimal bounding boxes and largely neglect the heavy computation in the refinement step at the intra-geometry level, which often dominates the cost of query processing. In this paper, we introduce 3DPro, a system that supports efficient spatial queries for complex 3D objects. 3DPro uses progressive compression of 3D objects preserving multiple levels of details, which significantly reduces the size of the objects and has the data fit into memory. Through a novel Filter-Progressive-Refine paradigm, 3DPro can have query results returned early whenever possible to minimize decompression and geometric computations of 3D objects in higher resolution representations. Our experiments demonstrate that 3DPro out-performs the state-of-the-art 3D data processing techniques by up to an order of magnitude for typical spatial queries.", "venue": "International Conference on Extending Database Technology", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-25", "journal": {"name": "Advances in database technology : proceedings. International Conference on Extending Database Technology", "pages": "104 - 117", "volume": "25"}, "authors": [{"authorId": "3422789", "name": "Dejun Teng"}, {"authorId": "3419650", "name": "Furqan Baig"}, {"authorId": "143791693", "name": "Hoang Vo"}, {"authorId": "2221672", "name": "Yanhui Liang"}, {"authorId": "2072805555", "name": "J. Kong"}, {"authorId": "143924592", "name": "Fusheng Wang"}], "citations": [{"paperId": "aef711ff8bd1cfbc71f1dfce7238bf60f5b2816a", "title": "Real-Time Spatial Registration for 3D Human Atlas"}]}
