{"paperId": "491a5ef3d03a5aafa30a9d6ddae86003b3333ace", "publicationVenue": null, "title": "A Proposal of Methodology for Designing Big Data Warehouses", "abstract": "Big Data warehouses are a new class of databases that largely use unstructured and volatile data for analytical purpose. Examples of this kind of data sources are those coming from the Web, such as social networks and blogs, or from sensor networks, where huge amounts of data may be available only for short intervals of time. In order to manage massive data sources, a strategy must be adopted to define multidimensional schemas in presence of fast-changing situations or even undefined business requirements. In the paper, we propose a design methodology that adopts agile and automatic approaches, in order to reduce the time necessary to integrate new data sources and to include new business requirements on the fly. The data are immediately available for analyses, since the underlying architecture is based on a virtual data warehouse that does not require the importing phase. Examples of application of the methodology are presented along the paper in order to show the validity of this approach compared to a traditional one.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-06-13", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "14462720", "name": "F. Di Tria"}, {"authorId": "3073988", "name": "E. Lefons"}, {"authorId": "2448754", "name": "F. Tangorra"}], "citations": [{"paperId": "23337fe6bf7e0f137bf781eea6f0ebd748724a30", "title": "A Decision-Support System to Analyse Customer Satisfaction Applied to a Tourism Transport Service"}, {"paperId": "d4ae73ac17c6bc8a537df2cebf50c9b4a6b420d5", "title": "An Effective and Scalable Data Modeling for Enterprise Big Data Platform"}, {"paperId": "b000244a45189487be3ce94854bc53071065430e", "title": "An Innovative Management Perspective for Organizations through a Reputation Intelligence Management Model"}]}
