{"paperId": "49230d56058232b34c7fa642cc94ebe223e014f7", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Affordable Fast Early Warning System for Edge Computing in Assembly Line", "abstract": "Maintaining product quality is essential for smart factories, hence detecting abnormal events in assembly line is important for timely decision-making. This study proposes an affordable fast early warning system based on edge computing to detect abnormal events during assembly line. The proposed model obtains environmental data from various sensors including gyroscopes, accelerometers, temperature, humidity, ambient light, and air quality. The fault model is installed close to the facilities, so abnormal events can be timely detected. Several performance evaluations are conducted to obtain the optimal scenario for utilizing edge devices to improve data processing and analysis speed, and the final proposed model provides the highest accuracy in terms of detecting abnormal events compared to other classification models. The proposed model was tested over four months of operation in a Korean automobile parts factory, and provided significant benefits from monitoring assembly line, as well as classifying abnormal events. The model helped improve decision-making by reducing or preventing unexpected losses due to abnormal events.", "venue": "Applied Sciences", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-12-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2913270", "name": "Muhammad Syafrudin"}, {"authorId": "31380410", "name": "Norma Latif Fitriyani"}, {"authorId": "3212733", "name": "Ganjar Alfian"}, {"authorId": "3353468", "name": "J. Rhee"}], "citations": [{"paperId": "993b080f82817d30bb5a956cfd96802b2ea0a822", "title": "Decentralized Scheduling for Concurrent Tasks in Mobile Edge Computing via Deep Reinforcement Learning"}, {"paperId": "1d0e428dc44792427ce5f3ebdbec43598dd2a128", "title": "Enhancing manufacturing operations with synthetic data: a systematic framework for data generation, accuracy, and utility"}, {"paperId": "1892aa84853f930e860def0ee3a91374ae3317ec", "title": "A SPHERICAL FUZZY BASED DECISION MAKING FRAMEWORK WITH EINSTEIN AGGREGATION FOR COMPARING PREPAREDNESS OF SMEs IN QUALITY 4.0"}, {"paperId": "7db8c34692ec80359ecf4d2722ba1714901ad8f0", "title": "An Augmented Reality-Based Warning System for Enhanced Safety in Industrial Settings"}, {"paperId": "bbc17cd8fcc36bef9b867b8a53a3eed0910d2601", "title": "Heart Disease Prediction using Ensemble Learning"}, {"paperId": "00044a527a0642b08f385cda845331f0fc8cbbfd", "title": "At the Confluence of Artificial Intelligence and Edge Computing in IoT-Based Applications: A Review and New Perspectives"}, {"paperId": "4221d5510df9e7dacf33e9b4bc54ba1f78c0f233", "title": "Monitoring the Production Information of Conventional Machining Equipment Based on Edge Computing"}, {"paperId": "4c899a73b9dac986096002ebc1c6c7aab5b06f46", "title": "Ethical Responsibility and Sustainability (ERS) Development in a Metaverse Business Model"}, {"paperId": "260191fe44f68b765e3cc7b9388f566547811c7a", "title": "Edge, Fog, and Cloud Computing : An Overview on Challenges and Applications"}, {"paperId": "c22ac667fe7089a6c059d8ad52ebaf5d0e4cca71", "title": "An Integrated Classification and Association Rule Technique for Early-Stage Diabetes Risk Prediction"}, {"paperId": "f9657da3c1a20ea1813824318739cdae6e185087", "title": "Communication and Control of an Assembly, Disassembly and Repair Flexible Manufacturing Technology on a Mechatronics Line Assisted by an Autonomous Robotic System"}, {"paperId": "4cd61401f4fd7511157f0f428c6ec96e7fa39b4e", "title": "An edge-based algorithm for tool wear monitoring in repetitive milling processes"}, {"paperId": "8d94e611061eae2c80581bf6689ee4ab4745a5ae", "title": "Performance Evaluation of Information Gathering from Edge Devices in a Complex of Smart Buildings"}, {"paperId": "008ed8459e1267509ba4d028e9868dcc2cb673b8", "title": "Towards edge computing in intelligent manufacturing: Past, present and future"}, {"paperId": "b881a9510f58f03226b9dc74b85debc54f77bd7b", "title": "YAPAY ZEKA ODAKLI SİBER RİSK VE GÜVENLİK YÖNETİMİ"}, {"paperId": "2fda56727e638d71eababe09c93c33d4552ea55a", "title": "Current advances and future challenges of AIoT applications in particulate matters (PM) monitoring and control."}, {"paperId": "9c37c8980dde688d0277d8f13f6ebf9fe6f94985", "title": "Time-Efficient Ensemble Learning with Sample Exchange for Edge Computing"}, {"paperId": "35da835728d605b0020b409accb2c201d99e2888", "title": "Early Warning Method for Public Health Emergency Under Artificial Neural Network in the Context of Deep Learning"}, {"paperId": "918d5990e963bea4d910a6451c3d21e0c2fd737f", "title": "Manufacturing Technology on a Mechatronics Line Assisted by Autonomous Robotic Systems, Robotic Manipulators and Visual Servoing Systems"}, {"paperId": "0abd70970016713d12e5654a2d6fe0c336aac657", "title": "Advanced Oversampling for Improved Detection of Software Anomalies in a Robot"}, {"paperId": "6cfdfd9220aa9d283d6a4340771b9b8bf95a65a4", "title": "Real-Time and Robust Hydraulic System Fault Detection via Edge Computing"}, {"paperId": "3758482d53f828995ca20ebd1d8ef06bcf0f56d9", "title": "Improving the detection of robot anomalies by handling data irregularities"}, {"paperId": "bfd5001cd4c3fe8af032ade6aeed35046deb9df6", "title": "A Modular Edge-/Cloud-Solution for Automated Error Detection of Industrial Hairpin Weldings using Convolutional Neural Networks"}, {"paperId": "02dd2f2aa967d47a90cdfebeda71d93d272358f1", "title": "Design of a dynamic and self-adapting system, supported with artificial intelligence, machine learning and real-time intelligence for predictive cyber risk analytics"}, {"paperId": "81977ebd30b322eb808c6e2e11a3e610dab797c3", "title": "Improving efficiency of RFID-based traceability system for perishable food by utilizing IoT sensors and machine learning model"}, {"paperId": "c674156a023dea08f174b9d18d87cd7d0abc39f0", "title": "Design of a dynamic and self-adapting system, supported with artificial intelligence, machine learning and real-time intelligence for predictive cyber risk analytics in extreme environments – cyber risk in the colonisation of Mars"}, {"paperId": "4fb6838fb498d99ffc2213d6dc66ac8ae83161b1", "title": "A Distributed Multi-Tier Emergency Alerting System Exploiting Sensors-Based Event Detection to Support Smart City Applications"}, {"paperId": "b1c742de601f85ed5392ac17d432b24158f9ef23", "title": "In Situ Diagnosis of Industrial Motors by Using Vision-Based Smart Sensing Technology"}, {"paperId": "3a9a3a8d90f8598b9cf3a61981cac9016795d4b8", "title": "A smart manufacturing adoption framework for SMEs"}, {"paperId": "558cf71fd626dba932b08fe1bf21599a59dd38bb", "title": "Modelling and Control of Mechatronics Lines Served by Complex Autonomous Systems"}, {"paperId": "80a6890c4b9d30e68f52980427b1fd61281e8cef", "title": "False Positive RFID Detection Using Classification Models"}, {"paperId": "8eb84e9922af254c5a264ced2ed6cc5d1919e5b1", "title": "A Survey of Architecture, Framework and Algorithms for Resource Management in Edge Computing"}, {"paperId": "9edb3290e2c062ab9696e606a98ffb968d953f2e", "title": "HDPM: An Effective Heart Disease Prediction Model for a Clinical Decision Support System"}, {"paperId": "410fad193b2ddaba0579258eea87315c8f2d9538", "title": "Development of Disease Prediction Model Based on Ensemble Learning Approach for Diabetes and Hypertension"}]}
