{"paperId": "49346d240bf8f5cc5f146aeed0397dfc3fc9a7d7", "publicationVenue": {"id": "424830bb-a6eb-4f54-8348-525a173c66bc", "name": "Research on Education and Media", "type": "journal", "alternate_names": ["Res Educ Media"], "issn": "2037-0830", "url": "http://www.degruyter.com/view/j/rem", "alternate_urls": ["http://rem.pensamultimedia.it/", "https://content.sciendo.com/view/journals/rem/rem-overview.xml"]}, "title": "Representation of learning in the post-digital: students’ dropout predictive models with artificial intelligence algorithms", "abstract": "Abstract Within scientific debate on post-digital and education, we present a position paper to describe a research project aimed at the design of a predictive model for students’ low achievements in mathematics in Italy. The model is based on the INVALSI data set, an Italian large-scale assessment test, and we use decision trees as the classification algorithm. In designing this tool, we aim to overcome the use of economic, social, and cultural context indices as main factors for the prediction of a learning gap occurrence. Indeed, we want to include a suitable representation of students’ learning in the model, by exploiting the data collected through the INVALSI tests. We resort to a knowledge-based approach to address this issue and specifically, we try to understand what knowledge is introduced into the model through the representation of learning. In this sense, our proposal allows a students’ learning encoding, which is transferable to different students’ cohort. Furthermore, the encoding methods may be applied to other large-scale assessments test. Hence, we aim to contribute to a debate on knowledge representation in AI tool for education.", "venue": "Research on Education and Media", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-28", "journal": {"name": "Research on Education and Media", "pages": "103 - 110", "volume": "15"}, "authors": [{"authorId": "2284853287", "name": "Andrea Zanellati"}, {"authorId": "115801020", "name": "Anita Macauda"}, {"authorId": "70087509", "name": "C. Panciroli"}, {"authorId": "1716204", "name": "M. Gabbrielli"}], "citations": []}
