{"paperId": "4935f5764d1359bd076e23728bb4372b59c0686f", "publicationVenue": {"id": "22fbe3a4-f70e-490e-a7e1-8196b866d3d9", "name": "Climate", "type": "journal", "issn": "2225-1154", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318082", "alternate_urls": ["https://www.mdpi.com/journal/climate", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318082"]}, "title": "A Systematic Review of Existing Early Warning Systems’ Challenges and Opportunities in Cloud Computing Early Warning Systems", "abstract": "This paper assessed existing EWS challenges and opportunities in cloud computing through the PSALSAR framework for systematic literature review and meta-analysis. The research used extant literature from Scopus and Web of Science, where a total of 2516 pieces of literature were extracted between 2004 and 2022, and through inclusion and exclusion criteria, the total was reduced to 98 for this systematic review. This review highlights the challenges and opportunities in transferring in-house early warning systems (that is, non-cloud) to the cloud computing infrastructure. The different techniques or approaches used in different kinds of EWSs to facilitate climate-related data processing and analytics were also highlighted. The findings indicate that very few EWSs (for example, flood, drought, etc.) utilize the cloud computing infrastructure. Many EWSs are not leveraging the capability of cloud computing but instead using online application systems that are not cloud-based. Secondly, a few EWSs have harnessed the computational techniques and tools available on a single platform for data processing. Thirdly, EWSs combine more than one fundamental tenet of the EWS framework to provide a holistic warning system. The findings suggest that reaching a global usage of climate-related EWS may be challenged if EWSs are not redesigned to fit the cloud computing service infrastructure.", "venue": "Climate", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-08", "journal": {"name": "Climate"}, "authors": [{"authorId": "9132864", "name": "I. E. Agbehadji"}, {"authorId": "4859752", "name": "T. Mabhaudhi"}, {"authorId": "2240105003", "name": "Joel Botai"}, {"authorId": "2530475", "name": "M. Masinde"}], "citations": [{"paperId": "0a3e0af94b4ac7f5927c660e2c830097c68c7f3e", "title": "Climate Risks Resilience Development: A Bibliometric Analysis of Climate-Related Early Warning Systems in Southern Africa"}]}
