{"paperId": "495fbff8c27e854426264b9f9a1888e3927f22df", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "Demonstration of LogicLib: An Expressive Multi-Language Interface over Scalable Datalog System", "abstract": "With the ever-increasing volume of data, there is an urgent need to provide expressive and efficient tools to support Big Data analytics. The declarative logical language Datalog has proven very effective at expressing concisely graph, machine learning, and knowledge discovery applications via recursive queries. In this demonstration, we develop Logic Library (LLib), a library of recursive algorithms written in Datalog that can be executed in BigDatalog, a Datalog engine on top of Apache Spark developed by us. LLib encapsulates complex logic-based algorithms into high-level APIs, which simplify the development and provide a unified interface akin to the one of Spark MLlib. As LLib is fully compatible with DataFrame, it enables the integrated utilization of its built-in applications and new Datalog queries with existing Spark functions, such as those provided by \\mlib and Spark SQL. With a variety of examples, we will (i) show how to write programs with LLib to express a variety of applications; (ii) illustrate its user experience in Apache Spark ecosystem; and (iii) present a user-friendly interface to interact with the LLib framework and monitor the query results.", "venue": "International Conference on Information and Knowledge Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-30", "journal": {"name": "Proceedings of the 31st ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": null, "name": "Mingda Li"}, {"authorId": "2143717242", "name": "Jin Wang"}, {"authorId": "2055961934", "name": "Guorui Xiao"}, {"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": []}
