{"paperId": "49680be4788386b10d0c818cc5f508f7b5ec15f8", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "Living on the Edge: Efficient Handling of Large Scale Sensor Data", "abstract": "Real-time sensor monitoring is critical in many industrial applications and is, e.g., used to model and predict operating conditions to optimize operations as well as to prevent damage in machinery and systems. In many cases, this data is generated by a myriad of sensors and stored or transmitted for post-processing by data analysts. Handling this data near its origin—on the edge—imposes significant challenges for storage and compression: it is necessary to store it in a format that is suitable for large data analytics algorithms, which in most cases means columnar storage. Furthermore, to provide efficient storage and transmission of such sensor data, it must be compressed efficiently. However, existing solutions do not address these challenges sufficiently. In this work, we present a holistic approach for fast streaming of large scale sensor data directly into columnar storage and integrate it with a proven compression scheme. Our approach uses a pipelined scheme for streaming and transposing the data layout, combined with a byte-level transformation of data representation and compression, which we evaluate in comprehensive experiments. As a result, our approach enables transformation of large scale sensor data streams into an efficient, analytics-friendly format already at the sensor site, i.e., on the edge, at data ingestion time. By implementing our optimized approach in the open and widely used columnar storage format Apache Parquet, which we already partly upstreamed, we ensure its accessibility to the community.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-01", "journal": {"name": "2021 IEEE/ACM 21st International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "1-10"}, "authors": [{"authorId": "3367112", "name": "Roman Karlstetter"}, {"authorId": "7182830", "name": "Amir Raoofy"}, {"authorId": "1995242574", "name": "M. Radev"}, {"authorId": "2976972", "name": "C. Trinitis"}, {"authorId": "2122597279", "name": "Jakob Hermann"}, {"authorId": "1772965", "name": "M. Schulz"}], "citations": [{"paperId": "29fca3f4ae956ebe4ef43284a7916c729ce54fb9", "title": "Federated Learning via Decentralized Dataset Distillation in Resource-Constrained Edge Environments"}, {"paperId": "a771b675f72bb3ee710ed127eed332eb306cc014", "title": "Querying Distributed Sensor Streams in the Edge-to-Cloud Continuum"}]}
