{"paperId": "496a0b27573f0de7663667bb24bcd4dfbe8469e6", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "Elastic Provisioning of Hadoop Clusters on OpenStack Private Cloud", "abstract": "Big Data Processing refers to processing, analyzing, and extracting information from a large amount of data. The traditional processing techniques of big data are no longer viable. Therefore this large volume of data is processed by distributed computing frameworks like Apache Hadoop. MapReduce frameworks are an excellent way to process larger datasets on the cloud platform. The automation of Hadoop is achieved on OpenStack based private cloud. Auto-scaling refers to the dynamic addition of nodes to or removal of the nodes from the existing cluster to use the resources effectively. The Quality of Service(QoS) has to be maintained while auto-scaling the resources on-demand. There is a requirement for auto-scaling of the Hadoop cluster when the load increases to adhere to the Service Level Agreements(SLAs). The paper presents the auto-scaling method of Hadoop clusters using predictive algorithms. To effectively implement auto-scaling, the prediction techniques are employed. The proposed model obtains the CPU utilization metrics and scales up or scales down the cluster based on the time series analysis. The experimental result using the OpenStack-based private cloud testbed reveals the effectiveness of the proposed mechanism.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 11th International Conference on Computing, Communication and Networking Technologies (ICCCNT)", "pages": "1-7"}, "authors": [{"authorId": "1396769077", "name": "Namrata Hosamani"}, {"authorId": "1999619684", "name": "Nageshwar Albur"}, {"authorId": "1999619695", "name": "P. Yaji"}, {"authorId": "8470912", "name": "Mohammed Moin Mulla"}, {"authorId": "71830683", "name": "N. D. G."}], "citations": [{"paperId": "f7ce0ec51262204e26f8902b87cd9c82b0c46b7f", "title": "A Systematic Literature Review of Automation Quality of Service in Computer Networks: Research Trends, Datasets, and Methods"}, {"paperId": "74c6720507e1a8b8ad88565ec74b5dc8cb54c5a2", "title": "An Intelligent Resource Management Solution for Hospital Information System Based on Cloud Computing Platform"}, {"paperId": "3ed35eae89b2a189b37ea45d6e432cfee870e80f", "title": "Ubi-Flex-Cloud: ubiquitous flexible cloud computing: status quo and research imperatives"}, {"paperId": "d39ccc676962803d89bd4b497eec492b2624622c", "title": "Design of a small-scale and failure-resistant IaaS cloud using OpenStack"}, {"paperId": "7f68a7385fae58ead1e7465d7b2f156d617bd5a3", "title": "An auto-scaling mechanism for cloud-based multimedia storage systems: a fuzzy-based elastic controller"}]}
