{"paperId": "496a85f34675fb10774f5c3e1baf51d8c5c260d9", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Promising Emerging Technologies for Teaching and Learning: Recent Developments and Future Challenges", "abstract": "As time goes on and the number of people who use information and communication technology (ICT) grows, emerging technologies are receiving a lot of attention from academics, researchers, and users. Emerging technologies are changing more quickly than ever, and it is important to start building skills early in education by using the right examples to teach and learn about digital citizenship. New pedagogies support individual teaching and learning methodologies for knowledge acquisition and self-directed learning. Hundreds of digital education tools have been developed to increase student autonomy, enhance academic process management, promote collaboration, and improve communication between teachers and students. This article examines the current state of emerging technologies from a variety of educational viewpoints, highlights a few of them, and discusses both their established and potential educational benefits. Additionally, it offers in-depth debates on recent developments and future challenges from a wide range of perspectives. The analysis focuses on peer-reviewed research articles published in well-renowned publications databases over the last 8 years, drawing upon a bibliometric analysis using VOSviewer. The results of this study are also anticipated to serve as a substantial impetus for other universities and colleges worldwide to utilize innovatively and revolutionized technology for better academic performance.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-20", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2004815558", "name": "Ahmad Almufarreh"}, {"authorId": "2057786701", "name": "Muhammad Arshad"}], "citations": [{"paperId": "c22691f7a579c19432d0dac8de1f7d428e3b0dac", "title": "Harnessing Information Technology in Learning: Exploring Emerging Trends and Innovative Approaches"}, {"paperId": "7ef34e7cdee1229d3ba43133cb57baf0527838aa", "title": "What keeps historical theme park visitors coming? Research based on expectation confirmation theory"}, {"paperId": "326fee489969bd628ee5b8ba93afe316d73f1d9c", "title": "Utilizing Emerging Technology Trends and Artificial Intelligence in Higher Education"}, {"paperId": "46d476ebcf8e3afd3beb7ad3bf00939017570b3a", "title": "Enhancing forensic education: exploring the importance and implementation of evidence-based education system"}, {"paperId": "99c4385865a4aae558eed0ede5de06cd230e1d7a", "title": "A Cross-Citation-Based Model for Technological Advancement Assessment: Methodology and Application"}, {"paperId": "edc35e4ebb42fef4a61a0fb80674e230fcd29011", "title": "Internet of Things (IoT)-Based Teaching and Learning: Modern Trends and Open Challenges"}, {"paperId": "e9e5ce0ed06b1d90b662b212e0ba2fbe98c74d52", "title": "Energy-Saving Triangle: Internalizing Islamic Ethical Values on Energy Saving in Integrative Learning"}, {"paperId": "2ccbb12985aef5aba1e3eb3e7f3f8611c19c8df1", "title": "Unlocking the Potential: A Comprehensive Evaluation of Augmented Reality and Virtual Reality in Education"}]}
