{"paperId": "49708064207e99ab20c362b5d3bbcaaded546d2b", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Intrusion Detection in IoT Using Deep Learning", "abstract": "Cybersecurity has been widely used in various applications, such as intelligent industrial systems, homes, personal devices, and cars, and has led to innovative developments that continue to face challenges in solving problems related to security methods for IoT devices. Effective security methods, such as deep learning for intrusion detection, have been introduced. Recent research has focused on improving deep learning algorithms for improved security in IoT. This research explores intrusion detection methods implemented using deep learning, compares the performance of different deep learning methods, and identifies the best method for implementing intrusion detection in IoT. This research is conducted using deep learning models based on convolutional neural networks (CNNs), long short-term memory (LSTM), and gated recurrent units (GRUs). A standard dataset for intrusion detection in IoT is considered to evaluate the proposed model. Finally, the empirical results are analyzed and compared with the existing approaches for intrusion detection in IoT. The proposed method seemed to have the highest accuracy compared to the existing methods.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2189851299", "name": "Alaa Mohammed Banaamah"}, {"authorId": "40943349", "name": "I. Ahmad"}], "citations": [{"paperId": "e9228d84ab6b1d219f5017638d6cefb4e513357c", "title": "Optimized deep autoencoder and BiLSTM for intrusion detection in IoTs-Fog computing"}, {"paperId": "cb4b0f1be1d28e559687c1e4b68589b116df590c", "title": "Deep Learning based Intrusion Detection for IoT Networks"}, {"paperId": "c940df41005e48348ba1904ad71f973527ca6caf", "title": "Methodology for the Detection of Contaminated Training Datasets for Machine Learning-Based Network Intrusion-Detection Systems"}, {"paperId": "f284dcc63c1230db3fc2f8674ddb9ba4923c09a0", "title": "Integration of Deep Learning into the IoT: A Survey of Techniques and Challenges for Real-World Applications"}, {"paperId": "e3070872de058d9f0a429b33a363c6022c34e181", "title": "Logistic Regression Ensemble Classifier for Intrusion Detection System in Internet of Things"}, {"paperId": "a24de5744b5276eac7215a7c1ab83d4e79f7108f", "title": "A Comparative Study of IDS-Based Deep Learning Models for IoT Network"}, {"paperId": "586e86f44cbcaf7b9fb876a0d1e4427f0b6b8138", "title": "An Optimized Hybrid Deep Intrusion Detection Model (HD-IDM) for Enhancing Network Security"}, {"paperId": "30c70e2b32ff2166f5275f1ceb0a49fc25038bdd", "title": "Sparse Autoencoder with SGReLU Activation Based Network Intrusion Detection System"}, {"paperId": "c11351ddd7a96f5893cb3760d9d50370383454d2", "title": "Comparison Analysis of Intrusion Detection using Deep Learning in IoT Networks"}, {"paperId": "240dc22c8337da82d5806e2e33d6355e1baec6fe", "title": "IoT networks attacks detection using multi-novel features and extra tree random - voting ensemble classifier (ER-VEC)"}, {"paperId": "69b9dba6b763615157969a404a8f4813a1af4d5b", "title": "An Explainable Intrusion Detection System for IoT Networks"}, {"paperId": "cdf8eb5dfbe3e1438e7070323cbaa6a88ff368b2", "title": "IoT and Man-in-the-Middle Attacks"}, {"paperId": "9915858c98de103d72a35f5604efd32710ad0d82", "title": "Advanced Topics and Smart Systems for Wireless Communications and Networks"}, {"paperId": "77d40d5e138fe1a7e1367caa44715cc6ce74c4b9", "title": "Toward Improved Machine Learning-Based Intrusion Detection for Internet of Things Traffic"}, {"paperId": "ec0d11cb4bea898838e58db7402f658ca777a58a", "title": "A hybrid deep learning-based intrusion detection system for IoT networks."}, {"paperId": "34173b0b6b31640864922d24f39b50b09ff6045f", "title": "Survey of Distributed and Decentralized IoT Securities: Approaches Using Deep Learning and Blockchain Technology"}, {"paperId": "233dc90e7a73ef335224eb32cf57352725b9dc3b", "title": "Hybrid Intrusion Detection System Based on Data Resampling and Deep Learning"}, {"paperId": "9b01a042c08ecd729f8e5cf4747ce093b793993a", "title": "REAL-TIME ANOMALY DETECTION IN INTERNET OF THINGS DEVICES USING TEMPORAL CONVOLUTIONAL NETWORK"}, {"paperId": "b1ceb925c541749956afd3e69272a1a070925a0a", "title": "Generating IoT Specific Anomaly Datasets Using Cooja Simulator (Contiki-OS) and Performance Evaluation of Deep Learning Model Coupled with Aquila Optimizer"}]}
