{"paperId": "499474ffb2602cd7831c921fff885f00705cc9e6", "publicationVenue": {"id": "44c99d16-ba02-4ef6-aa1f-ed03f91da4cc", "name": "Natural Hazards and Earth System Sciences", "type": "journal", "alternate_names": ["Nat Hazard Earth Syst Sci", "Natural Hazards and Earth System Science"], "issn": "1561-8633", "url": "https://www.nat-hazards-earth-syst-sci.net/volumes_and_issues.html", "alternate_urls": ["https://www.natural-hazards-and-earth-system-sciences.net/", "https://www.natural-hazards-and-earth-system-sciences.net/home.html"]}, "title": "Nepalese landslide information system (NELIS): a conceptual framework for a web-based geographical information system for enhanced landslide risk management in Nepal", "abstract": "Abstract. Comprehensive and sustainable landslide risk management, including the identification of areas susceptible to landslides, requires responsible organisations to collaborate efficiently. Landslide risk management efforts are often made after major triggering events, such as hazard mitigation after the 2015 Gorkha earthquake in Nepal. There is also a lack of knowledge sharing and collaboration among stakeholders to cope with major disaster events, in addition to a lack of efficiency and continuity. There should be a system to allow for landslide information to be easily updated after an event. For a variety of users of landslide information in Nepal, the availability and extraction of landslide data from a common database are a vital requirement. In this study, we investigate the requirements to propose a concept for a web-based Nepalese landslide information system (NELIS) that provides users with a platform to share information about landslide events to strengthen collaboration. The system will be defined as a web GIS (geographic information system) that supports responsible organisations in addressing and managing different user requirements of people working with landslides, thereby improving the current state of landslide hazard and risk management in Nepal. The overall aim of this study is to propose a conceptual framework and design of NELIS. A system like NELIS could benefit stakeholders involved in data collection and landslide risk management in their efforts to report and provide landslide information. Moreover, such a system would allow for detailed and structured landslide documentation and consequently provide valuable information regarding susceptibility and hazard and risk mapping. For the reporting of landslides directly to the system, a web portal is proposed. Based on field surveys, a literature review and stakeholder interviews, a structure of the landslide database and a conceptual framework for the NELIS platform are proposed.\n", "venue": "Natural Hazards and Earth System Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-01-26", "journal": {"name": "Natural Hazards and Earth System Sciences"}, "authors": [{"authorId": "69936582", "name": "S. Meena"}, {"authorId": "2070022130", "name": "F. Albrecht"}, {"authorId": "3103141", "name": "D. Hölbling"}, {"authorId": "31568077", "name": "O. Ghorbanzadeh"}, {"authorId": "50594282", "name": "T. Blaschke"}], "citations": [{"paperId": "0e7a9c2596d6420cb0d33e7c2462dd4f6eae9657", "title": "Landslide susceptibility analysis in the Bhilangana Basin (India) using GIS-based machine learning methods"}, {"paperId": "c65e4cb6da773b0c81ad8803e1dae4053bd9a92a", "title": "Intelligent Fire Information System Based on 3D GIS"}, {"paperId": "0cd68a973230a584393caac42e6a571f3a904aff", "title": "Landslide Susceptibility Assessment using Open-Source Data in the Far Western Nepal Himalaya: Case Studies from Selected Local Level Units"}, {"paperId": "acff7916b85465261b91bd967319b4debb84605d", "title": "Effectiveness of Disaster Mitigation Information by National Disaster Relief Agency in Indonesia"}]}
