{"paperId": "499ef580445c64a2cdca9fd03ec64f03d9559975", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Survey on Optimization Techniques for Edge Artificial Intelligence (AI)", "abstract": "Artificial Intelligence (Al) models are being produced and used to solve a variety of current and future business and technical problems. Therefore, AI model engineering processes, platforms, and products are acquiring special significance across industry verticals. For achieving deeper automation, the number of data features being used while generating highly promising and productive AI models is numerous, and hence the resulting AI models are bulky. Such heavyweight models consume a lot of computation, storage, networking, and energy resources. On the other side, increasingly, AI models are being deployed in IoT devices to ensure real-time knowledge discovery and dissemination. Real-time insights are of paramount importance in producing and releasing real-time and intelligent services and applications. Thus, edge intelligence through on-device data processing has laid down a stimulating foundation for real-time intelligent enterprises and environments. With these emerging requirements, the focus turned towards unearthing competent and cognitive techniques for maximally compressing huge AI models without sacrificing AI model performance. Therefore, AI researchers have come up with a number of powerful optimization techniques and tools to optimize AI models. This paper is to dig deep and describe all kinds of model optimization at different levels and layers. Having learned the optimization methods, this work has highlighted the importance of having an enabling AI model optimization framework.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-01-22", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "1930214", "name": "Chellammal Surianarayanan"}, {"authorId": "2202492825", "name": "J. Lawrence"}, {"authorId": "2939136", "name": "P. Chelliah"}, {"authorId": "1705901", "name": "E. Prakash"}, {"authorId": "1505722696", "name": "C. Hewage"}], "citations": [{"paperId": "c75a279be6e2616da5a0c8c7c33f1ec40b732eda", "title": "Model compression of deep neural network architectures for visual pattern recognition: Current status and future directions"}, {"paperId": "a01a60ae5061f720fcd88527c849fab568b1122d", "title": "Optimizing Large-Scale Data Processing with Artificial Intelligence"}, {"paperId": "ca78e7cc072d947ae3adc88ece0250551e2befe5", "title": "An Exploration of the Use Cases for Artificial Intelligence in Data Access Optimization"}, {"paperId": "6e01c1a77bd629a4dfa36fb42b3411bd3e2b2eb4", "title": "Retos de la educación y la inteligencia artificial en la Universidad Estatal a Distancia, Costa Rica"}, {"paperId": "325d7b74940e123d268079e293b26fed76bb7c61", "title": "Temperature Monitoring and Airflow Control System for Balancing the Greenhouse Environment Using IEEE 1451 Standards"}, {"paperId": "9cc6b424f270915a6b996203152b4ebbe1455698", "title": "Planetary biotechnospheres, biotechnosignatures and the search for extraterrestrial intelligence"}, {"paperId": "28073c14d6fc448bdab956c9cd934b38cd9dbde1", "title": "Scalable and custom-precision floating-point hardware convolution core for using in AI edge processors"}, {"paperId": "52bf61f5a0cd9e81270c60011278a4196c7de5f6", "title": "Space Debris: Are Deep Learning-based Image Enhancements part of the Solution?"}, {"paperId": "bc74b94e6c8e9f64f98f0b278cf5b8f65c5372f8", "title": "AFOX: a new adaptive nature-inspired optimization algorithm"}, {"paperId": "3636d8016b09580df2b617bf06c72b4872ed71e8", "title": "Spatial mapping of the DNA adducts in cancer."}, {"paperId": "567fa9edd32749bca408d0f24109525f3a119620", "title": "Simulation and forecasting of fishery weather based on statistical machine learning"}, {"paperId": "4f241fc917a0a69b1c6e9dc1e475ded419d551d4", "title": "Edge AI: A survey"}, {"paperId": "83714efcb3d445c34e686889af3b9939d56c3149", "title": "The Significance of Edge AI towards Real-time and Intelligent Enterprises"}, {"paperId": "3b98add1e5c56cc1e3a1c2190639760e7dba03af", "title": "SOFTWARE DEVELOPMENT FOR PATTERN RECOGNITION IN ENVIRONMENT MONITORING TASKS WITH THE USE OF AUTONOMOUS DRONES"}]}
