{"paperId": "49a1d9e5a81eb8d194ac4b2a387773267d1e1fcf", "publicationVenue": null, "title": "Scalable and Efficient Data Management in Distributed Clouds : Service Provisioning and Data Processing", "abstract": "This thesis focuses on scalable data management solutions to accelerate service provisioning and enable efficient execution of data-intensive applications in large-scale distributed clouds. Data-intensive applications are increasingly running on distributed infrastructures (multiple clusters). The main two reasons for such a trend are 1) moving computation to data sources can eliminate the latency of data transmission, and 2) storing data on one site may not be feasible given the continuous increase of data size.On the one hand, most applications run on virtual clusters to provide isolated services, and require virtual machine images (VMIs) or container images to provision such services. Hence, it is important to enable fast provisioning of virtualization services to reduce the waiting time of new running services or applications. Different from previous work, during the first part of this thesis, we worked on optimizing data retrieval and placement considering challenging issues including the continuous increase of the number and size of VMIs and container images, and the limited bandwidth and heterogeneity of the wide area network (WAN) connections.On the other hand, data-intensive applications rely on replication to provide dependable and fast services, but it became expensive and even infeasible with the unprecedented growth of data size. The second part of this thesis provides one of the first studies on understanding and improving the performance of data-intensive applications when replacing replication with the storage-efficient erasure coding (EC) technique.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-12-17", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "51111432", "name": "Jad Darrous"}], "citations": [{"paperId": "9129cf20d003beb16df97dbbd5f74c1d608fd1c9", "title": "Project-Team STACK Software Stack for Massively Geo-Distributed Infrastructures"}]}
