{"paperId": "49a50e1b7e242dd81824d4f05dbaf4cb86ddf8a3", "publicationVenue": {"id": "ce357952-7a76-49bc-9333-005df10573ef", "name": "International Review of Research in Open and Distance Learning", "type": "journal", "alternate_names": ["The International Review of Research in Open and Distributed Learning", "Int Rev Res Open Distance Learn", "Int Rev Res Open Distrib Learn"], "issn": "1492-3831", "url": "http://epe.lac-bac.gc.ca/100/201/300/intl_review_research/index.html", "alternate_urls": ["http://www.irrodl.org/index.php/irrodl", "http://www.irrodl.org/"]}, "title": "Mapping Network Structure and Diversity of Interdisciplinary Knowledge in Recommended MOOC Offerings", "abstract": "In massive open online courses (MOOCs), recommendation relationships present a collection of associations that imply a new form of integration, such as an interdisciplinary synergy among diverse disciplines. This study took a computer science approach, using the susceptible-infected (SI) model to simulate the process of learners accessing courses within networks of MOOC offerings, and emphasized the potential effects of a network structure. The current low rate of access suggests that a ceiling effect influences learners’ access to learning online, given that there are thousands of courses freely available. Interdisciplinary networks were created by adding recommended courses into four disciplinary networks. The diversity of interdisciplinarity was measured by three attributes, namely variety, balance, and disparity. The results attest to interesting changes in how the diversity of interdisciplinary knowledge grows. Particularly remarkable is the degree to which the diversity of interdisciplinarity increased when new recommended courses were first added. However, changing diversity implied that neighbouring disciplines were more likely to come to the forefront to attach to the interdisciplinarity of MOOC offerings, and that the pace of synergy among disparate disciplines slowed as time passed. In the absence of domain experts, expert knowledge is not sufficient to support interdisciplinary curriculum design. More evidence-based analytics studies showing how interdisciplinarity evolves in course offerings could help us to better design online courses that prepare learners with 21st-century skills.", "venue": "International Review of Research in Open and Distance Learning", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-01", "journal": {"name": "The International Review of Research in Open and Distributed Learning"}, "authors": [{"authorId": "2108089756", "name": "Jingjing Zhang"}, {"authorId": "2018725531", "name": "Yehong Yang"}, {"authorId": "144312710", "name": "E. Barberá"}, {"authorId": "2140045358", "name": "Yu Lu"}], "citations": []}
