{"paperId": "49abbd4a7a2cb47bc8bb6b92e30a80acc5369fa7", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Functional Connectome of the Human Brain with Total Correlation", "abstract": "Recent studies proposed the use of Total Correlation to describe functional connectivity among brain regions as a multivariate alternative to conventional pairwise measures such as correlation or mutual information. In this work, we build on this idea to infer a large-scale (whole-brain) connectivity network based on Total Correlation and show the possibility of using this kind of network as biomarkers of brain alterations. In particular, this work uses Correlation Explanation (CorEx) to estimate Total Correlation. First, we prove that CorEx estimates of Total Correlation and clustering results are trustable compared to ground truth values. Second, the inferred large-scale connectivity network extracted from the more extensive open fMRI datasets is consistent with existing neuroscience studies, but, interestingly, can estimate additional relations beyond pairwise regions. And finally, we show how the connectivity graphs based on Total Correlation can also be an effective tool to aid in the discovery of brain diseases.", "venue": "Entropy", "year": 2022, "fieldsOfStudy": ["Biology", "Mathematics", "Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-06", "journal": {"name": "Entropy", "volume": "24"}, "authors": [{"authorId": "2146262430", "name": "Qiang Li"}, {"authorId": "1719898", "name": "G. V. Steeg"}, {"authorId": "2462771", "name": "Shujian Yu"}, {"authorId": "144432320", "name": "J. Malo"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "dd558ef71778066d96dc9efc5d00025dc66cfda9", "title": "Exploring Nonlinear Dynamics In Brain Functionality Through Phase Portraits And Fuzzy Recurrence Plots"}, {"paperId": "13944d971465113e98dd1e83e8057a9baac07732", "title": "Revealing complex functional topology brain network correspondences between humans and marmosets"}, {"paperId": "9f380e87578599c49ed82b0e5717981614df896c", "title": "Aberrant High-Order Dependencies in Schizophrenia Resting-State Functional MRI Networks"}, {"paperId": "4f11288956dddac97cee2b0a9362cea26bb8dd48", "title": "Revealing Complex Functional Topology Brain Network Correspondences Between Humans and Marmosets"}, {"paperId": "5d2a7b7487657351d6360e37e962fbb9bc4dba1b", "title": "Inflammatory diseases: Function of LncRNAs in their emergence and the role of mesenchymal stem cell secretome in their treatment."}, {"paperId": "f459ecab1d1f2ed1937b78de4ecaa6e8082f32df", "title": "Investigating the relationship between knowledge and the adoption of sustainable agricultural practices: The case of Dutch arable farmers"}, {"paperId": "f1f219814057d16705913658dc95826c72cb0c53", "title": "Higher-Order Organization in the Human Brain From Matrix-Based Rényi’s Entropy"}, {"paperId": "cecb26c63e273116c632c6c3d386cbe47f0bde51", "title": "Functional connectivity via total correlation: Analytical results in visual areas"}, {"paperId": "cacc4b203f76292179385aa9c7320c5798cfa085", "title": "Visual Image Reconstruction from Human Brain Activity using Linear Image Decoders plus Nonlinear Noise Suppression"}]}
