{"paperId": "49ab9b826fe09f5e1c24afd751ab2b06f7d99e6a", "publicationVenue": {"id": "55cbbee6-4000-432f-af6a-c0ffd25ba0c0", "name": "Visualization for Computer Security", "type": "conference", "alternate_names": ["Vis Comput Secur", "VizSEC"]}, "title": "Visualization Of Class Activation Maps To Explain AI Classification Of Network Packet Captures", "abstract": "The classification of internet traffic has become increasingly important due to the rapid growth of today’s networks and application variety. The number of connections and the addition of new applications in our networks causes a vast amount of log data and complicates the search for common patterns by experts. Finding such patterns among specific classes of applications is necessary to fulfill various requirements in network analytics. Supervised deep learning methods learn features from raw data and achieve high accuracy in classification. However, these methods are very complex and are used as black-box models, which weakens the experts’ trust in these classifications. Moreover, by using them as a black-box, new knowledge cannot be obtained from the model predictions despite their excellent performance. Therefore, the explainability of the classifications is crucial. Besides increasing trust, the explanation can be used for model evaluation to gain new insights from the data and to improve the model. In this paper, we present a visual and interactive tool that combines the classification of network data with an explanation technique to form an interface between experts, algorithms, and data.", "venue": "Visualization for Computer Security", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-05", "journal": {"name": "2022 IEEE Symposium on Visualization for Cyber Security (VizSec)", "pages": "1-11"}, "authors": [{"authorId": "13719083", "name": "Igor Cherepanov"}, {"authorId": "34483258", "name": "Alex Ulmer"}, {"authorId": "2184135928", "name": "Jonathan Geraldi Joewono"}, {"authorId": "1682620", "name": "J. Kohlhammer"}], "citations": [{"paperId": "a58b111e56087a375855c13a158bb76183d291ae", "title": "Multi-scale cross-attention transformer encoder for event classification"}, {"paperId": "fa3d7ad76c30098d19fb08c46360a2a4a6e8c65e", "title": "Human Centricity in the Relationship Between Explainability and Trust in AI"}, {"paperId": "9d14e005a6974ead0940178a43e800f4cacb4e79", "title": "Visual Analysis of Computer Security Data Using Artificial Neural Networks"}, {"paperId": "e2736dd7536fe118d40ea104ab194413da898f3a", "title": "Towards the Visualization of Aggregated Class Activation Maps to Analyse the Global Contribution of Class Features"}]}
