{"paperId": "49b1f8402d6b2a9849393bb7c1a5349fa94897ed", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Electrochemical Biosensing and Deep Learning-Based Approaches in the Diagnosis of COVID-19: A Review", "abstract": "COVID-19 caused by the transmission of SARS-CoV-2 virus taking a huge toll on global health and caused life-threatening medical complications and elevated mortality rates, especially among older adults and people with existing morbidity. Current evidence suggests that the virus spreads primarily through respiratory droplets emitted by infected persons when breathing, coughing, sneezing, or speaking. These droplets can reach another person through their mouth, nose, or eyes, resulting in infection. The “gold standard” for clinical diagnosis of SARS-CoV-2 is the laboratory-based nucleic acid amplification test, which includes the reverse transcription-polymerase chain reaction (RT-PCR) test on nasopharyngeal swab samples. The main concerns with this type of test are the relatively high cost, long processing time, and considerable false-positive or false-negative results. Alternative approaches have been suggested to detect the SARS-CoV-2 virus so that those infected and the people they have been in contact with can be quickly isolated to break the transmission chains and hopefully, control the pandemic. These alternative approaches include electrochemical biosensing and deep learning. In this review, we discuss the current state-of-the-art technology used in both fields for public health surveillance of SARS-CoV-2 and present a comparison of both methods in terms of cost, sampling, timing, accuracy, instrument complexity, global accessibility, feasibility, and adaptability to mutations. Finally, we discuss the issues and potential future research approaches for detecting the SARS-CoV-2 virus utilizing electrochemical biosensing and deep learning.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "98633-98648", "volume": "10"}, "authors": [{"authorId": "15624418", "name": "Omer Sadak"}, {"authorId": "51448107", "name": "Ferhat Sadak"}, {"authorId": "144659028", "name": "Ozal Yildirim"}, {"authorId": "40597568", "name": "Nicole M. Iverson"}, {"authorId": "40702132", "name": "Rizwan Qureshi"}, {"authorId": "2710873", "name": "Muhammed Talo"}, {"authorId": "5006448", "name": "C. Ooi"}, {"authorId": "35649968", "name": "U. Rajendra Acharya"}, {"authorId": "49960547", "name": "S. Gunasekaran"}, {"authorId": "49164594", "name": "T. Alam"}], "citations": [{"paperId": "10348f72ec8b1c859f73ca44bf27a4210082de0b", "title": "Development of Biosensor for early Detection of COVID-19"}, {"paperId": "c19365fceae6122d9c7b5585d16771a51b32362d", "title": "Advancements in SARS-CoV-2 Testing: Enhancing Accessibility through Machine Learning-Enhanced Biosensors"}, {"paperId": "e1c53b1c2dd8a22f151b43e66d7c6a0d7c9a5800", "title": "YOLOv5-M: A Deep Neural Network for Medical Object Detection in Real-time"}, {"paperId": "d84c14b9ee9ba5fdc9de0031024aab544c69e675", "title": "A Review of Biosensors and Artificial Intelligence in Healthcare and their Clinical Significance"}, {"paperId": "4b107e518a2497bffe7cb9d71df039cb8e2164df", "title": "Artificial Intelligence and Biosensors in Healthcare and Its Clinical Relevance: A Review"}, {"paperId": "b96bc144aa4a6255d64504ca1570a38b0f077131", "title": "Artiﬁcial Intelligence and Biosensors in Healthcare and its Clinical Relevance: A Review"}]}
