{"paperId": "49c827fb813342869bcf94ae3983e19119a7fb1f", "publicationVenue": null, "title": "Emerging risks identification on food and feed – EFSA", "abstract": "Abstract The European Food Safety Authority's has established procedures for the identification of emerging risk in food and feed. The main objectives are to: (i) to carry out activities aiming at identifying, assessing and disseminating information on emerging issues and ensure coordination with relevant networks and international organisations; (ii) promote the identification of data sources and data collection and /or data generation in prioritised emerging issues; and the (iii) evaluate of the collected information and identify of emerging risks. The objective(s) of the Standing Working Group on Emerging Risks (SWG‐ER) is to collaborate with EFSA on the emerging risks identification (ERI) procedure and provide strategic direction for EFSA work building on past and ongoing projects related to EFSA ERI procedure. The SWG‐ER considered the ERI methodologies in place and results obtained by EFSA. It was concluded that a systematic approach to the identification of emerging issues based on experts’ networks is the major strength of the procedure but at present, it is mainly focused on single issues, over short to medium time horizons, no consistent weighting or ranking is applied and clear governance of emerging risks with follow‐up actions is missing. The analysis highlighted weaknesses with respect to data collection, analysis and integration. No methodology is in place to estimate the value of the procedure outputs in terms of avoided risk and there is urgent need for a communication strategy that addresses the lack of data and knowledge uncertainty and addresses risk perception issues. Recommendations were given in three areas: (i) Further develop a food system‐based approach including the integration of social sciences to improve understanding of interactions and dynamics between actors and drivers and the development of horizon scanning protocols; (ii) Improve data processing pipelines to prepare big data analytics, implement a data validation system and develop data sharing agreements to explore mutual benefits; and (iii) Revise the EFSA procedure for emerging risk identification to increase transparency and improve communication.", "venue": "EFSA journal. European Food Safety Authority", "year": 2018, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-01", "journal": {"name": "EFSA Journal", "volume": "16"}, "authors": [{"authorId": "119997468", "name": "T. Donohoe"}, {"authorId": "4327603", "name": "K. Garnett"}, {"authorId": "90698124", "name": "A. Lansink"}, {"authorId": "121282855", "name": "A. Afonso"}, {"authorId": "153528134", "name": "H. Noteborn"}], "citations": [{"paperId": "bce15fdfde33639975fb72b3f70d24eb5e98754c", "title": "Arsenic speciation and arsenic feed-to-fish transfer in Atlantic salmon fed marine low trophic feeds based blue mussel and kelp."}, {"paperId": "c6ae6d7ded24c70fa8df608ae4ed3ad970940527", "title": "EFSA's activities on emerging risks in 2021"}, {"paperId": "65e26140f39f2b0d22d6eeba9a91b14df83f4e3b", "title": "EFSA's activities on emerging risks in 2020"}, {"paperId": "2812da721c6ba035a4dc837dff7612381f3bb632", "title": "КОНЦЕПТУАЛЬНІ ОСНОВИ СТВОРЕННЯ СИСТЕМИ НАУКОВО-ПРОГНОСТИЧНОГО ЗАБЕЗПЕЧЕННЯ МОРСЬКОЇ ДІЯЛЬНОСТІ УКРАЇНИ"}, {"paperId": "dde7ebd8ac4c950ae3e5724d8511be355327120e", "title": "Emerging risk identification by applying data analytical tools"}, {"paperId": "febe516346d0df9d6599159a1511355171931032", "title": "Citizen Science and Monitoring Forest Pests: a Beneficial Alliance?"}, {"paperId": "bb4c4292b6f2002394bae6db9ca2c951c9de2757", "title": "Trans-governmental regulatory networks and the European Union’s involvement in global governance: an occasional instrument?"}, {"paperId": "8d00ef66c088d9c3182c08f5189e187e63296a2d", "title": "Methodological Approaches for Monitoring Five Major Food Safety Hazards Affecting Food Production in the Galicia–Northern Portugal Euroregion"}, {"paperId": "c516c1c635437198aa997cd01b87e8da6400c999", "title": "Prioritization of Mycotoxins Based on Their Genotoxic Potential with an In Silico-In Vitro Strategy"}, {"paperId": "5c2088a27ffdb0b6e2abfc5723019dae3e444741", "title": "State of the art review of Big Data and web-based Decision Support Systems (DSS) for food safety risk assessment with respect to climate change"}, {"paperId": "7fba842532361ad78e7d30afa4be34a28656273d", "title": "Functional dyspepsia: A critical appraisal of the European consensus from a global perspective"}, {"paperId": "e16e19ac8c2d3f761255a613a25cd252f3b61a70", "title": "Metabolomics in chemical risk analysis - A review."}, {"paperId": "294f49c5a024958f75eb3054c2ffa41995909012", "title": "Big data for sustainable agri‐food supply chains: a review and future research perspectives"}, {"paperId": "a7805fb8d4fb768f8d5e4ba775c4522784329265", "title": "Predicted Aflatoxin B1 Increase in Europe Due to Climate Change: Actions and Reactions at Global Level"}, {"paperId": "c4558c0b781d15b354f243048ecbc767b7247303", "title": "Microplastic contamination of salt intended for human consumption: a systematic review and meta-analysis"}, {"paperId": "21dd812af3c86fa268e9056c1da5004eadf9f797", "title": "Identification of Emerging Hazards in Mussels by the Galician Emerging Food Safety Risks Network (RISEGAL). A First Approach"}, {"paperId": "70b41bc86e35f9c8b46571d876c62c00ce6ebe10", "title": "EFSA's activities on emerging risks in 2019"}, {"paperId": "5e366dededc47b95136ff5e8008e11e38590a4cd", "title": "Determination and Metrics for Emerging Risks Identification DEMETER: Final Report"}, {"paperId": "260329c0781b41698105dee2483924c5c6a35178", "title": "Climate change as a driver of emerging risks for food and feed safety, plant, animal health and nutritional quality"}, {"paperId": "38e89df5c3609351ad0335e43419f10f9af2f042", "title": "EFSA's activities on emerging risks in 2018"}, {"paperId": "c3f41da5227f880ae2343cf7cdaf73b593e33aeb", "title": "Project DEMETER: Concept Note for an Emerging Risks Knowledge Exchange Platform (ERKEP) Framework"}, {"paperId": "416316dd7ce44a4f90bf7ec2de2b173435ca9dbc", "title": "Application of data science in risk assessment and early warning"}, {"paperId": "5752d88f42da7b4b99268132506f3382cb187f04", "title": "Application of data science in risk assessment and early warning"}, {"paperId": "0b01bfcf75e2ad6ef8f3e2e329a8ef8569093068", "title": "Big data in food safety: An overview"}, {"paperId": "10871d80b86dce4fe1aa13974cf77e02ba1cdf22", "title": "Evidence-Informed Policymaking: An Innovative European Multi-actor Project"}, {"paperId": "3fb58d6fd28875ca56ac5381aa778e62ce36d5eb", "title": "Determination and Metrics for Emerging Risks Identification <fc>DEMETER</fc>: Final Report"}]}
