{"paperId": "49d3c8a0e882b155c271c976dd6884be3502ba44", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Flink-ER: An Elastic Resource-Scheduling Strategy for Processing Fluctuating Mobile Stream Data on Flink", "abstract": "As real-time and immediate feedback becomes increasingly important in tasks related to mobile information, big data stream processing systems are increasingly applied to process massive amounts of mobile data. However, when processing a drastically fluctuating mobile data stream, the lack of an elastic resource-scheduling strategy limits the elasticity and scalability of data stream processing systems. To address this problem, this paper builds a flow-network model, a resource allocation model, and a data redistribution model as the foundation for proposing Flink with an elastic resource-scheduling strategy (Flink-ER), which consists of a capacity detection algorithm, an elastic resource reallocation algorithm, and a data redistribution algorithm. The strategy improves the performance of the platform by dynamically rescaling the cluster and increasing the parallelism of operators based on the processing load. The experimental results show that the throughput of a cluster was promoted under the premise of meeting latency constraints, which verifies the efficiency of the strategy.", "venue": "Mobile Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-20", "journal": {"name": "Mob. Inf. Syst.", "pages": "5351824:1-5351824:17", "volume": "2020"}, "authors": [{"authorId": "2118273337", "name": "Ziyang Li"}, {"authorId": "2122292005", "name": "Jiong Yu"}, {"authorId": "2065342230", "name": "Chen Bian"}, {"authorId": "2061196115", "name": "Yonglin Pu"}, {"authorId": "2143464974", "name": "Yuefei Wang"}, {"authorId": "2108284444", "name": "Yitian Zhang"}, {"authorId": "14938152", "name": "Binglei Guo"}], "citations": [{"paperId": "f1c4d6cc1660c28882b021fa603704c0e1599ea1", "title": "An efficient architecture for processing real-time traffic data streams using apache flink"}, {"paperId": "bd16465f1ef98c3c537e4acd1007d35df9235e0e", "title": "Cost-Efficient Scheduling of Streaming Applications in Apache Flink on Cloud"}, {"paperId": "5e8e7c5c03848f17ebd004ed80409a0559ee6bcd", "title": "Multi-agent Reinforcement Learning-based Adaptive Heterogeneous DAG Scheduling"}, {"paperId": "ee57b0df6562a60354f06ae6c9186da5fcef8146", "title": "Scalable adaptive optimizations for stream-based workflows in multi-HPC-clusters and cloud infrastructures"}, {"paperId": "8f438f8fc5b8b4b6338788233cfa1760a3ac819d", "title": "DEBS grand challenge: real-time detection of air quality improvement with Apache Flink"}, {"paperId": "85afb507993a810c1d9b9f3b1cc6b895098cffae", "title": "Rafiki: Task-Level Capacity Planning in Distributed Stream Processing Systems"}]}
