{"paperId": "49d79f48d2fb78d868d8f65e8b4b5cf16e1b643f", "publicationVenue": null, "title": "Influence of Scale of Operation and Farmers’ Risk Aversion on Sugarcane Productivity in Nandi County, Kenya", "abstract": "Aims: Sugarcane ranks among top ten commercial crops grown in Kenya, but its productivity has been on the decline. This study investigated influence of scale of farm operation and farmers’ risk aversion on productivity. Risk aversion was based on farmers’ perceived risks associated with new high yielding, early maturing varieties. Study Design: The survey study adopted an ex post facto research design. Place and Duration of Study: The study was carried out in Nandi County, Western parts of Kenya along a sugarcane growing belt. Data was collected between April and September, 2019. Methodology: An enumerator-administered questionnaire was used to collect data from a sample of 198 respondents. Purposive and stratified random sampling techniques were used to select participants. Data was analyzed with the aid of SPSS Version 20. Chi square test and its related measure of strength of association; Cramer’s V, were utilized to estimate relationships between variables. Welch’s ANOVA (W-test) was run to test for yield differences between groups. Significant differences were subjected to post hoc tests using Games-Howell test to separate the means. Original Research Article Cheruiyot and Sang; AJAEES, 38(3): 14-26, 2020; Article no.AJAEES.55719 15 Results: There was a significant association between farmers scale of operation and productivity; 2 (2, N = 198) = 14.11, P = .001, V = .267. Farmers scale of operation significantly influenced productivity based on W-test (P = .001). Medium scale farms were significantly more productive per unit of land than both small and large scale. Risk aversion as measured by perceived risks of changing to new varieties was associated with sugarcane productivity; 2 (2, N = 198) = 9.25, P = .01, V = .216. Those who perceived high risks associated with new varieties recorded significantly lower yields compared to low risks (P = .001). Conclusion: Small scale and large scale farmers experienced low sugarcane productivity compared to medium scale. Risk aversion among the farmers appeared to negatively influence sugarcane productivity. Capacity building of the farmers on crop management best practices and risk management strategies is recommended.", "venue": "", "year": 2020, "fieldsOfStudy": ["Economics"], "publicationTypes": ["Review"], "publicationDate": "2020-04-08", "journal": {"name": "Asian Journal of Agricultural Extension, Economics and Sociology", "pages": "14-26", "volume": ""}, "authors": [{"authorId": "1659056912", "name": "J. Cheruiyot"}, {"authorId": "1657565233", "name": "Nelly Sang"}], "citations": [{"paperId": "3a49d658d17a71290abbb40abf5b1d7b1bc3ac4c", "title": "Farmers’ Information-inputs and their Sway on Coffee Productivity in the West of Rift, Kenya"}]}
