{"paperId": "49da0ad1e473a006f4fc4b49088a4a040b73251a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Drive Cycle-Based Design With the Aid of Data Mining Methods: A Review on Clustering Techniques of Electric Vehicle Motor Design With a Case Study", "abstract": "The electrification of the automotive has recently shaped the current revolution in transportation. Many automotive companies are now producing their own electric vehicle (EV) models. To cope with these advances, the various subsystems need to be improved regularly, and their issues need to be solved. A way to achieve this is to make use of the extensive amount of information available today. These data can give a better picture and propose ways for enhancements and solutions to problems. The huge amounts of data are dealt with using data mining techniques. This paper surveys the clustering technique, one of the data mining techniques, used in designing and optimizing the electrical machines used for EVs. It presents the various clustering methods used to classify the different operating points of the torque speed curve and summarizes them into just a few points to be considered in the optimization process. It then illustrates a case study, developing a general design process with the aid of various clustering techniques and comparing their performance. The case study is applied to a six-phase surface-mounted permanent magnet (SPM) synchronous machine used for an electric vehicle’s propulsion and integrated onboard battery charger (IOBC) system. It suggests clustering techniques as an efficient means to achieve an optimal motor design over the entire driving cycle while considering only a few operating points to reduce time consumption and computational burdens, while getting acceptable results.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "115775-115797", "volume": "11"}, "authors": [{"authorId": "2216855097", "name": "Ahmed T. Abdel-Wahed"}, {"authorId": "2176552246", "name": "Zia Ullah"}, {"authorId": "1402171481", "name": "A. Abdel-Khalik"}, {"authorId": "2238663774", "name": "Mostafa S. Hamad"}, {"authorId": "2109162244", "name": "Shehab Ahmed"}, {"authorId": "31019436", "name": "Noha A. Elmalhy"}], "citations": []}
