{"paperId": "49eaf1d206a430cd4445be1b031a4c75d930cb2b", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Real-Time Stream Processing in Social Networks with RAM3S", "abstract": "The avalanche of (both user- and device-generated) multimedia data published in online social networks poses serious challenges to researchers seeking to analyze such data for many different tasks, like recommendation, event recognition, and so on. For some such tasks, the classical “batch” approach of big data analysis is not suitable, due to constraints of real-time or near-real-time processing. This led to the rise of stream processing big data platforms, like Storm and Flink, that are able to process data with a very low latency. However, this complicates the task of data analysis since any implementation has to deal with the technicalities of such platforms, like distributed processing, synchronization, node faults, etc. In this paper, we show how the RAM 3 S framework could be profitably used to easily implement a variety of applications (such as clothing recommendations, job suggestions, and alert generation for dangerous events), being independent of the particular stream processing big data platforms used. Indeed, by using RAM 3 S, researchers can concentrate on the development of their data analysis application, completely ignoring the details of the underlying platform.", "venue": "Future Internet", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-29", "journal": {"name": "Future Internet", "pages": "249", "volume": "11"}, "authors": [{"authorId": "1716642", "name": "Ilaria Bartolini"}, {"authorId": "1742653", "name": "M. Patella"}], "citations": [{"paperId": "7473c96b5bf92902e497b00cd410ac98fa2f1628", "title": "A stream processing abstraction framework"}, {"paperId": "ea7ed5c0999d06f3cbd7ee7b094716587f87fc26", "title": "Big Data for Real-Time Processing on Streaming Data: State-of-the-art and Future Challenges"}, {"paperId": "fea67988e9298c804c24054dab2ea708266f184e", "title": "Resource scheduling and provisioning for processing of dynamic stream workflows under latency constraints"}, {"paperId": "fc8e777975e6744cab5f149cf4d46ff4ce6d2118", "title": "The Metamorphosis (of RAM3S)"}, {"paperId": "de1729699afe127946efef60bb4728bf7c3e9b31", "title": "Stochastic distributed data stream partitioning using task locality: design, implementation, and optimization"}, {"paperId": "0cdff7b88a2f3405bb02e030cd13d0f468e207bf", "title": "Rammed, or What RAM3S Taught Us"}, {"paperId": "db633d5a36df1155ed877926a371a925d112bbe4", "title": "A Distributed Stream Processing Middleware Framework for Real-Time Analysis of Heterogeneous Data on Big Data Platform: Case of Environmental Monitoring"}, {"paperId": "9f720497d5445a9d679d230f2e8c4517b2e6a980", "title": "From RAM3S to SPAF: Towards a Stream Processing Abstracting Framework"}, {"paperId": "c76b0217cb3734acb6b0c4202f445472a50d63e1", "title": "Challenges and Solutions for Processing Real-Time Big Data Stream: A Systematic Literature Review"}, {"paperId": "f93609b30d815a7bf99f7adfb6822fcd474f8531", "title": "A New Big Data Architecture for Real-Time Student Attention Detection and Analysis"}]}
