{"paperId": "49ebe2da3df1c558c83aaf0a88d2d105e23d2fbf", "publicationVenue": {"id": "27fc22f2-ace7-4f2e-a7ed-6287d36b522d", "name": "IEEE Engineering Management Review", "type": "journal", "alternate_names": ["IEEE Eng Manag Rev"], "issn": "0360-8581", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=46", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=46"]}, "title": "A Technology Roadmap to Uncontested Market Space Using Autonomous Vehicles in the Transportation Industry", "abstract": "This paper presents a conceptual technology roadmap for autonomous vehicles. The roadmap analysis results indicate that standardization and computerization of business processes continues from previous years. Deeply connecting organizations allow for fast economic development. Hyper-competition begins when development reaches a plateau. The escape from this situation is a breakthrough in knowledge, requiring operations to become knowledge intensive. There is continuing development of inexpensive machine-to-machine communication that facilitates the exchange of vital data. This data enables machines to make good business decisions and execute them in various spaces. We also forecast that standards will continue to be created and implemented, enabling new autonomic and organic computing processes to be tested and integrated with other systems. After these systems are released for widespread use, emergent patterns will be revealed where humans will utilize them to create value by connecting these patterns to other spaces. None of these technologies are possible without inexpensive and instantaneous machine-to-machine communication. Standard technologies from the beginning of the twenty-first century will serve as a low-level communication and decision making a layer for holonic systems and organic computing.", "venue": "IEEE Engineering Management Review", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-02-19", "journal": {"name": "IEEE Engineering Management Review", "pages": "67-76", "volume": "47"}, "authors": [{"authorId": "72387569", "name": "B. Romanski"}, {"authorId": "1730923", "name": "T. Daim"}], "citations": [{"paperId": "3a28af160ca90c1cee6387020568231afccc7b34", "title": "Technology roadmap for the development of a 3D cell culture workstation for a biomedical industry startup"}, {"paperId": "c3c78dcddbb006a7cbf62c86fee3b1d3126f5a65", "title": "Applying digital technologies in technology roadmapping to overcome individual biased assessments"}, {"paperId": "73cc50fe2f8c4b10e852daaee0433b5b6f0e8e46", "title": "Outlook on biofuels in future studies: A systematic literature review"}, {"paperId": "4e9276e08901ddd840f34bfbc66b520a0c6683c7", "title": "Investigating the Sensing Activities in Strategic Planning with Multi-Dimensional Aspects: Timo"}, {"paperId": "c88ff192713db8f50277d1876f67b846acfb0cee", "title": "Technology Development Roadmaps: A Bibliometric Analysis of Scientific Literature"}, {"paperId": "649d49f14af78ccdd83808f839ace7db6261fb31", "title": "Kaiser Permanente Internet of Things (IoT) Roadmap"}]}
