{"paperId": "49ef2f85d9d206d65ca91e4f8e0e5150f4dd330e", "publicationVenue": {"id": "4683b5ad-e083-4ec9-bdbb-918cf13ee178", "name": "International Journal of Advanced Technology and Engineering Exploration", "type": "journal", "alternate_names": ["Int J Adv Technol Eng Explor"], "issn": "2394-7454", "alternate_issns": ["2394-5443"], "url": "http://accentsjournals.org/journals1.php?journalsId=110"}, "title": "A systematic literature review on student performance predictions", "abstract": "Prediction of student performance in educational institutions is a major topic of debate among researchers in efforts to improve teaching and learning. Effective prediction techniques and features would help educators and teachers design appropriate teaching content to help learners study according to predicted outcomes. The purpose of this paper is to present a systematic literature review on predictions of students’ performance in higher education institutions and secondary schools using Machine Learning, Educational Data Mining, and Learning Analytics methodologies. The review used in this study was designed to: i) provide an overview of techniques and algorithms used to predict students' performance; and ii) identify the features that have the greatest impact on students' performance. This paper also outlined several future insights in terms of applying hybrid techniques to educational datasets in order to improve accuracy in predicting students’ performance.", "venue": "International Journal of Advanced Technology and Engineering Exploration", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-30", "journal": {"name": "International Journal of Advanced Technology and Engineering Exploration"}, "authors": [{"authorId": "101932262", "name": "H. Nawang"}, {"authorId": "47695985", "name": "M. Makhtar"}, {"authorId": "2142823262", "name": "Wan Mohd Amir Fazamin Wan Hamza"}], "citations": [{"paperId": "64f478899e51b80c00b5b94174abb572508dc2b2", "title": "Predicting Student Grade Point Average: Comparison of Machine Learning Regression Algorithms"}, {"paperId": "3a4e9c86da2344b365e04fb82e193001e90df6e0", "title": "Student course grade prediction using the random forest algorithm: Analysis of predictors' importance"}, {"paperId": "b8a666fbafb155e529ee8a02b5b53f2a781999b1", "title": "Deep Biased Matrix Factorization for Student Performance Prediction"}, {"paperId": "c0b5d4f3a33e4a33b51eb244d8d90bf8fa714cfd", "title": "A systematic review of the literature on machine learning application of determining the attributes influencing academic performance"}]}
