{"paperId": "4a081ee018e746e698f1911a86e39dfe84dff6aa", "publicationVenue": {"id": "d184a8bc-eeff-457c-891b-56cb8f3bd4e0", "name": "˜The œinternational Arab journal of information technology", "type": "journal", "alternate_names": ["The International Arab Journal of Information Technology", "̃the œinternational Arab j inf technol", "Int Arab J Inf Technol"], "issn": "1683-3198", "alternate_issns": ["2309-4524"], "url": "http://www.iajit.org/"}, "title": "Sorensen-dice similarity indexing based weighted iterative clustering for big data analytics", "abstract": "Big data is a collection of large volume of data and extract similar data points from large dataset. Clustering is an essential data mining technique for examining large volume of data. Several techniques have been developed for handling big dataset. However, with much time consumption and space complexity, accuracy is said to be compromised. In order to improve clustering accuracy with less complexity, Sørensen-Dice Indexing based Weighted Iterative X-means Clustering (SDI-WIXC) technique is introduced. SDI-WIXC technique is used for grouping the similar data points with higher clustering accuracy and minimal time. First, number of data points is collected from big dataset. Then, along with the weight value, the given dataset is partitioned into ‘X’ number of clusters. Next, based on the similarity measure, Weighted Iterated X-means Clustering (WIXC) is applied for clustering data points. Sørensen-Dice Indexing Process is used for measuring similarity between cluster weight value and data points. Upon similarity found between weight value of cluster and data point, data points are grouped into a specific cluster. Besides, the WIXC method also improves the cluster assignments through repeated subdivision using Bayesian probability criterion. This in turn helps to group all data points and hence, improving the clustering accuracy. Experimental evaluation is carried out with number of factors such as clustering accuracy, clustering time and space complexity with respect to the number of data points. The experimental results reported that the proposed SDI-WIXC technique obtains high clustering accuracy with minimum time as well as space complexity.", "venue": "˜The œinternational Arab journal of information technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Int. Arab J. Inf. Technol.", "pages": "11-22", "volume": "19"}, "authors": [{"authorId": "2148973829", "name": "Kalyana Saravanan Annathurai"}, {"authorId": "3152984", "name": "Tamilarasi Angamuthu"}], "citations": [{"paperId": "8b89c996d0f970c257b766db67a0cdc84adbe8eb", "title": "A Python Clustering Analysis Protocol of Genes Expression Data Sets"}]}
