{"paperId": "4a08ae095a2322a5fd3d4610fa1a67d125b61197", "publicationVenue": {"id": "021b37d3-cef1-4c12-a442-257f7900c23d", "name": "Design Automation Conference", "type": "conference", "alternate_names": ["Des Autom Conf", "DAC"], "url": "http://www.dac.com/"}, "title": "Dr. BFS: Data Centric Breadth-First Search on FPGAs", "abstract": "The flexible architectures of Field Programmable Gate Arrays (FPGAs) lend themselves to an array of data analytical applications, among which Breadth-First Search (BFS), due to its vital importance, draws particular attention. Recent attempts that off load BFS on FPGAs either simply imitate the existing CPU-or Graphics Processing Units (GPU)-based mechanisms or suffer from scalability issues. To this end, we introduce a novel data centric design which extensively extracts the potential of FPGAs for BFS with the following two techniques. First, we advocate to partition and compress the BFS algorithmic metadata in order to buffer them in fast on-chip memory and circumvent the expensive metadata access. Second, we propose a hierarchical coalescing method to improve the throughput of graph data access. Taken together, our evaluation demonstrates that the proposed design achieves, on average, $1.6\\times$ and $2.2\\times$ speedups over the state-of-the-art FPGA designs TorusBFS and Umuroglu, respectively, across a collection of graph datasets.", "venue": "Design Automation Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-06-02", "journal": {"name": "2019 56th ACM/IEEE Design Automation Conference (DAC)", "pages": "1-6"}, "authors": [{"authorId": "73770945", "name": "Eric Finnerty"}, {"authorId": "73772208", "name": "Zachary Sherer"}, {"authorId": "2118959610", "name": "Hang Liu"}, {"authorId": "46491823", "name": "Yan Luo"}], "citations": [{"paperId": "184d429e601a7029f1fe7c29f4f9fe54eed57ad5", "title": "Optimisation and Evaluation of Breadth First Search with oneAPI/SYCL on Intel FPGAs: from Describing Algorithms to Describing Architectures"}, {"paperId": "771b486e3babc5ccd2e11ed32c5764ee8cda7d0f", "title": "GraFlex: Flexible Graph Processing on FPGAs through Customized Scalable Interconnection Network"}, {"paperId": "86d736169850f1aca9ff8261327e8eb772e85ff8", "title": "ScalaBFS2: A High Performance BFS Accelerator on an HBM-enhanced FPGA Chip"}, {"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "862be95b98b11124a3420c395cc28729084d3d59", "title": "I/O-Efficient Butterfly Counting at Scale"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "887dde12447a0050ea30d5d5b02440ff8fcd7285", "title": "ScalaBFS: A Scalable BFS Accelerator on HBM-Enhanced FPGAs"}, {"paperId": "13d38e22daa7e1b0844e785c4e51dd1789cadc14", "title": "ThunderGP: HLS-based Graph Processing Framework on FPGAs"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "61946177ea5d44ad18ff09de7929556d7b34cd8b", "title": "SIMD-X: Programming and Processing of Graph Algorithms on GPUs"}]}
