{"paperId": "4a149248619ea7a53f4dc6507fd76eb273923d57", "publicationVenue": null, "title": "The Quill Distributed Analytics Library and Platform", "abstract": "This technical report introduces Quill (stands for a quadrillion tuples per day), a library and distributed platform for relational and temporal analytics over large datasets in the cloud. Quill exposes a new abstraction for parallel datasets and computation, called ShardedStreamable. This abstraction provides the ability to express efficient distributed physical query plans that are transferable, i.e., movable from offline to real-time and vice versa. ShardedStreamable decouples incremental query logic specification, a small but rich set of data movement operations, and keying; this allows Quill to express a broad space of plans with complex querying functionality, while leveraging existing temporal libraries such as Trill. Quill’s layered architecture provides a careful separation of responsibilities with independently useful components, while retaining high performance. We built Quill for the cloud, with a master-less design where a language-integrated client library directly communicates and coordinates with cloud workers using off-the-shelf distributed cloud components such as queues. Experiments on up to 400 cloud machines, and on datasets up to 1TB, find Quill to incur low overheads and outperform SparkSQL by up to orders-of-magnitude for temporal and 6× for relational queries, while supporting a rich space of transferable, programmable, and expressive distributed physical query plans.", "venue": "", "year": 2016, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2016-08-08", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2241445", "name": "Badrish Chandramouli"}, {"authorId": "34568734", "name": "R. Fernandez"}, {"authorId": "145858819", "name": "J. Goldstein"}, {"authorId": "1876123", "name": "A. Eldawy"}, {"authorId": "1949818", "name": "A. Quamar"}], "citations": [{"paperId": "583deb3922d2ed4bdb539ff15ac89d7f101cdb1c", "title": "Quill: Efficient, Transferable, and Rich Analytics at Scale"}, {"paperId": "6d48dc9eb90dfebbd5454d41adbedc66965157e5", "title": "Squall: Scalable Real-time Analytics"}, {"paperId": "38486c502873ff83ca384c42ec70c039f8f3679a", "title": "Efficient Online Processing for Advanced Analytics"}, {"paperId": "63b9569d1c46cf68a622b03ea2889ef675f671fb", "title": "Squall - Scalable Real-time Analytics using Efficient, Skew-resilient Join Operators"}]}
