{"paperId": "4a17457ad13a67e39a93663f00c8387b0327c19c", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "UniAD", "abstract": "Instead of constructing complex declarative queries, many users prefer to write their programs using procedural code embedded with simple queries. Since many users are not expert programmers or the programs are written in a rush, these programs usually exhibit poor performance in practice and it is a challenge to automatically and efficiently optimize these programs. In this article, we present UniAD, which stands for Unified execution for Ad hoc Data processing, a system designed to simplify the programming of data processing tasks and provide efficient execution for user programs. We provide the background of program semantics and propose a novel intermediate representation, called Unified Intermediate Representation (UniIR), which utilizes a simple and expressive mechanism HOQ to describe the operations performed in programs. By combining both procedural and declarative logics with the proposed intermediate representation, we can perform various optimizations across the boundary between procedural and declarative code. We propose a transformation-based optimizer to automatically optimize programs and implement the UniAD system. The extensive experimental results on various benchmarks demonstrate that our techniques can significantly improve the performance of a wide range of data processing programs.", "venue": "ACM Transactions on Database Systems", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-11-21", "journal": {"name": "ACM Transactions on Database Systems (TODS)", "pages": "1 - 42", "volume": "42"}, "authors": [{"authorId": "13381694", "name": "Xiaogang Shi"}, {"authorId": "144585959", "name": "B. Cui"}, {"authorId": "145820649", "name": "G. Dobbie"}, {"authorId": "1693070", "name": "B. Ooi"}], "citations": [{"paperId": "354237d07d08abaf7132e8db4f67fa6c59d04d21", "title": "Real-time prediction of logging parameters during the drilling process using an attention-based Seq2Seq model"}, {"paperId": "c57a16699228810f919d55ca02bfbdd42d97807a", "title": "Grid-Centric Traffic Scenario Perception for Autonomous Driving: A Comprehensive Review"}]}
