{"paperId": "4a2432210231c8282e1cea084a3cc37bcd14500d", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Leveraging vCPU-utilization rates to select cost-efficient VMs for parallel workloads", "abstract": "The increasing use of cloud computing for parallel workloads involves, among many problems, resources wastage. When the application does not fully utilize the provisioned resource, the end-of-the-month bill is unnecessarily increased. This is mainly caused by the user's inexperience and naïve behavior. Many studies have attempted to solve this problem by searching for the optimal VM flavor for specific applications with specific inputs. However, most of these solutions require knowledge about the application or require the application's execution on multiple VM flavors. In this work, we propose four new heuristics that recommend cost-effective VMs for parallel workloads based solely on the vCPU-utilization rate of the currently executing VM flavor. We also evaluate them on two scenarios and show that the core-heuristic is capable of recommending VM flavors that have minimal impact on performance and reduce the applications cost, on average, by 1.5x (3.0x) on high (low) vCPU-utilization rate scenarios.", "venue": "International Conference on Utility and Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-12-06", "journal": {"name": "Proceedings of the 14th IEEE/ACM International Conference on Utility and Cloud Computing"}, "authors": [{"authorId": "2132646690", "name": "William F. C. Tavares"}, {"authorId": "24212726", "name": "M. M. Assis"}, {"authorId": "1931645", "name": "E. Borin"}], "citations": []}
