{"paperId": "4a3e7eb231c351387b9e8adb3dc97dc956d94067", "publicationVenue": null, "title": "Mappemonde, 131 | 2021", "abstract": "Cartograms have long been used to highlight the uneven distribution of a phenomenon over a given area. On these maps, the size of spatial units is proportional to their weight (the number of inhabitants, amount of CO2 emitted, etc.). Over the past twenty or so years, the benefits of adding movement to this type of map–mainly to assess changes over time and space–have been discussed. Several methods have been suggested for constructing animated cartograms, and efficient algorithms are now available to distort spatial units. Nevertheless, rendering a second variable on an animated cartogram remains a challenge, generally giving rather poor results. In this article we experiment with a way of improving the effectiveness of such animated cartograms, by conjointly using spatial smoothing. We demonstrate the potential of combining these two mapping techniques in animated mode to visualize changes in socio-residential segregation over time, using the example of Bogotá (Colombia) from 1993 to 2005. Les cartogrammes sont utilisés depuis longtemps pour mettre en exergue l’inégale distribution d’un phénomène sur un espace donné. Sur ces cartes, les unités spatiales ont une taille qui est proportionnelle à un poids (nombre d’habitants, quantité de CO2 émise, etc.). Depuis une vingtaine d’années, l’intérêt d’ajouter du mouvement à ce type de construction cartographique est discuté, l’objectif étant le plus souvent de suivre les changements qui se produisent dans l’espace et le temps. Plusieurs méthodes ont été proposées pour construire des cartogrammes animés et des algorithmes performants existent aujourd’hui pour déformer les unités spatiales. Ceci étant, la restitution sur un cartogramme animé d’une deuxième variable pose encore problème et donne généralement des résultats assez peu satisfaisants. Cet article propose une solution expérimentale en vue d’améliorer l’efficacité de ces cartogrammes animés en utilisant conjointement un lissage spatial. Nous montrons le potentiel que représente la combinaison de ces deux techniques cartographiques en mode animé pour observer l’évolution de la ségrégation socio-résidentielle dans le temps, en prenant l’exemple de Bogotá (Colombie) entre 1993 et 2005. Los cartogramas se han utilizado durante mucho tiempo para resaltar las diferencias en la distribución de un fenómeno en un espacio determinado. En estos mapas, las unidades espaciales tienen un tamaño proporcional a una cantidad (número de habitantes, toneladas de CO2 emitido, etc.). Durante los últimos veinte años, se ha discutido el interés de añadir animación para observar, a lo largo del tiempo, los cambios que se dan en el espacio. Se han propuesto varios métodos para construir cartogramas animados y hoy en día existen poderosos algoritmos para deformar las unidades espaciales. Sin embargo, sigue siendo insatisfactoria la visualización de una segunda variable en un cartograma animado. Este trabajo propone una solución experimental para mejorar la eficacia de estos cartogramas animados, que consiste en combinarlos con el alisamiento espacial. Esta propuesta de visualización se aplica al estudio de la segregación socio-residencial en Bogotá (Colombia) entre 1993 y 2005. How visually effective are animated cartograms? Potential improvements based ... Mappemonde, 131 | 2021 23", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2167177111", "name": "Boris Mericskay"}], "citations": []}
