{"paperId": "4a466057378df91e8c0b33d1f4c579f7f076c7d1", "publicationVenue": null, "title": "Distributed Analytics in Smart Grids with Edge Computing and Computational Intelligence", "abstract": "Conventional methods like classification or clustering have limits when it comes to handling the complex task for dispersed data mining across heterogeneous sources and divergent data formats. This is especially true in scenarios where stochastic models or mathematical formulas may not be feasible. Data centralization is a prevalent trend that exacerbates problems including communication channel congestion and privacy difficulties related to sensitive data flows. In order to overcome these obstacles, this paper presents the Distributed Academic Engine (DAE), an adaptive edge-based scattered analytic engine designed for distributed networks. The DAE routinely breaks down and divides computations that need data from multiple sources among the nodes that are already in place, enabling the sharing of partial results without disclosing the original data. To get the full expression output, the master node combines these partial results. The expression is decomposed and processing jobs are distributed among nodes using three computational intelligence techniques: genetic algorithm, genetic algorithm using evolution control, the particle swarm optimization. This method's effectiveness is illustrated with a case study on smart grid KPI identification, which shows a noteworthy (over 91%) decrease in communication messages over conventional approaches. This demonstrates how well the suggested method works to reduce the difficulties related to distributed data mining.", "venue": "2023 International Conference on Power Energy, Environment & Intelligent Control (PEEIC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-19", "journal": {"name": "2023 International Conference on Power Energy, Environment & Intelligent Control (PEEIC)", "pages": "1289-1294"}, "authors": [{"authorId": "2267776456", "name": "Apoorva Joshi"}, {"authorId": "2281352791", "name": "Preethi D"}, {"authorId": "2291039173", "name": "Amandeep Gill"}], "citations": []}
