{"paperId": "4a46d40ca578a5d039f52b08b264bd237a3257a2", "publicationVenue": null, "title": "Intelligent detection of fetal hydrocephalus", "abstract": "ABSTRACT This paper describes an enhanced process able to attain righteous classification of morphological malformation in foetal head ultrasound images. These anomalies can be detected approximately 20–22 weeks. In effect, the experts rely on manual analysis by extracting typical biometric measures from head region to interpret pregnancy evolution. The contribution of this work presents a totally computerised method of cerebral defect-recognition based on conventional neural network (CNN) in order to supply quantitative appraisal of hydrocephalus (HD) or healthy (HL) topics. The obtained results have achieved an important classification (Accuracy = 97.20%, sensitivity = 97.95% and specificity = 98.23%) when applying the CNN. The proposed methodology enables us to assess the anomalous cases in premature period within a reduced processing time. Experimental results prove the success of the proposed rating system for a suitable diagnostic of foetal head hydrocephalus when compared to previous work.", "venue": "Comput. methods Biomech. Biomed. Eng. Imaging Vis.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "Computer Methods in Biomechanics and Biomedical Engineering: Imaging & Visualization", "pages": "641 - 648", "volume": "8"}, "authors": [{"authorId": "31548176", "name": "Hanene Sahli"}, {"authorId": "2971491", "name": "M. Sayadi"}, {"authorId": "12098535", "name": "R. Rachdi"}], "citations": [{"paperId": "1cd99c33ecb6e1ba8df425a1a3ca9c04ce16c63b", "title": "Hydrocephalus classification in brain computed tomography medical images using deep learning"}, {"paperId": "ab09ef85e95e7b405af9a9492fbdaf4428c70b96", "title": "Toward deep observation: A systematic survey on artificial intelligence techniques to monitor fetus via ultrasound images"}, {"paperId": "ea34294e4e9a643fb4f46212260d62806edb7752", "title": "Deep Learning Achieves Neuroradiologist-Level Performance in Detecting Hydrocephalus Requiring Treatment"}]}
