{"paperId": "4a4968cbf404b316f1b384436eb0602072c591c4", "publicationVenue": {"id": "f8c1288e-7248-48b1-9c43-c80bb91e8cad", "name": "Journal of Software Engineering Research and Development", "type": "journal", "alternate_names": ["J Softw Eng Res Dev"], "issn": "2195-1721", "url": "http://www.jserd.com/", "alternate_urls": ["https://jserd.springeropen.com/"]}, "title": "A Data-centric Model Transformation Approach using Model2GraphFrame Transformations", "abstract": "Data­-centric (Dc) approaches are being used for data processing in several application domains, such as distributed systems, natural language processing, and others. There are different data processing frameworks that ease the task of parallel and distributed data processing. However, there are few research approaches studying on how to execute model manipulation operations, as model transformations models on such frameworks. In addition, it is often necessary to provide extraction of XMI­-based formats into possibly distributed models. In this paper, we present a Model2GraphFrame operation to extract a model in a modeling technical space into the Apache Spark framework and its GraphFrame supported format. It generates GraphFrame from the input models, which can be used for partitioning and processing model operations. We used two model partitioning strategies: based on sub­graphs, and clustering. The approach allows to perform model analysis applying operations on the generated graphs, as well as Model Transformations (MT). The proof of concept results such as model2GraphFrame, GraphFrame partitioning, GraphFrame connectivity, and GraphFrame model transformations indicate that our Model Extraction can be used in various application domains, since it enables the specification of analytical expressions on graphs. Furthermore, its model graph elements are used in model transformations on a scalable platform.", "venue": "Journal of Software Engineering Research and Development", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-14", "journal": {"name": "J. Softw. Eng. Res. Dev.", "pages": "10:1-10:17", "volume": "9"}, "authors": [{"authorId": "1832159", "name": "Luiz Carlos Camargo"}, {"authorId": "1822135", "name": "Marcos Didonet Del Fabro"}], "citations": []}
