{"paperId": "4a567ba4765b48263fc3574970e9aa20597626d8", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "Machine Learning-Based Monitoring System With IoT Using Wearable Sensors and Pre-Convoluted Fast Recurrent Neural Networks (P-FRNN)", "abstract": "Health issues of individuals has to be observed and diagnosed carefully as well as at the early stages and treatment has to be given using suitable medicines. Many health disorders can be detected at the earliest and thus reduce its activities before affecting the individuals severely. Recently, technology has been incrementally developed and thus numerous wearable devices to monitor human health are readily existing in the market. Even the specialist, clinicians and experts in the medical field, face difficulties in detecting the health issues and disease with the observed symptoms. Information of the patients gathered from Electronic Health Records (EHR), Internet of Things (IoT) and wearable as well as mobile devices helps in providing advancements in the technologies used. This research work introduces a novel monitoring system where the patient uses a wearable sensor connected with the database present in the hospital via IoT. The data obtained is classified with the help of the pre-convoluted fast recurrent neural networks. This classification helps to detect the abnormal data towards the health of the individuals with improved accuracy and reduced time consumption. Before the results of the medical test arrives, this classification approach has the ability to detect the patients’ abnormality in health. The results after classification will be sent to doctor when it is detected to be abnormal or else the parametric analysis is performed. The simulation results are optimized in comparison with the results of any other neural network and wearable device. the rate of classification achieved by P-FRNN is comparable and execution time achieved is appreciably low. Likewise, for ‘Sea’ dataset, ‘DEVDAN’ is better than P-FRNN as accuracy obtained is higher only when numerous parameters are considered. Similarly, dataset with P-FRNN do not perform well for ‘Learn++’ and ‘Learn++.NSE’ models where the accuracy obtained is over 93% when few features are used and moreover the execution time is comparatively low.", "venue": "IEEE Sensors Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-11-15", "journal": {"name": "IEEE Sensors Journal", "pages": "25517-25524", "volume": "21"}, "authors": [{"authorId": "2058985780", "name": "Deepak Jain"}, {"authorId": "1410438211", "name": "K. Srinivas"}, {"authorId": "2140184182", "name": "S. V. N. Srinivasu"}, {"authorId": "145911873", "name": "R. Manikandan"}], "citations": [{"paperId": "463e1769a08dab23fd652a514eca8051f52b46f1", "title": "Patient Monitoring and Disease Analysis Based on IoT Wearable Sensors and Cloud Computing"}, {"paperId": "23e7df82cde4a3f9ee8929a33cef923edd650364", "title": "IoMT-based smart healthcare monitoring system using adaptive wavelet entropy deep feature fusion and improved RNN"}, {"paperId": "0b68fff0d6ea62d19a0e30dbfba13533a78841e3", "title": "Research on Microseismic Source Location Method Based on Waveform Characteristics Monitored by Nanomaterial Sensor under the Background of Metal Oxide Polluted Environment"}]}
