{"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions", "abstract": "An inflection point in the computing industry is occurring with the implementation of the Internet of Things and 5G communications, which has pushed centralized cloud computing toward edge computing resulting in a paradigm shift in computing. The purpose of edge computing is to provide computing, network control, and storage to the network edge to accommodate computationally intense and latency-critical applications at resource-limited endpoints. Edge computing allows edge devices to offload their overflowing computing tasks to edge servers. This procedure may completely exploit the edge server’s computational and storage capabilities and efficiently execute computing operations. However, transferring all the overflowing computing tasks to an edge server leads to long processing delays and surprisingly high energy consumption for numerous computing tasks. Aside from this, unused edge devices and powerful cloud centers may lead to resource waste. Thus, hiring a collaborative scheduling approach based on task properties, optimization targets, and system status with edge servers, cloud centers, and edge devices is critical for the successful operation of edge computing. This paper briefly summarizes the edge computing architecture for information and task processing. Meanwhile, the collaborative scheduling scenarios are examined. Resource scheduling techniques are then discussed and compared based on four collaboration modes. As part of our survey, we present a thorough overview of the various task offloading schemes proposed by researchers for edge computing. Additionally, according to the literature surveyed, we briefly looked at the fairness and load balancing indicators in scheduling. Finally, edge computing resource scheduling issues, challenges, and future directions have discussed.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "25329-25350", "volume": "11"}, "authors": [{"authorId": "1499295465", "name": "Mostafa Raeisi-Varzaneh"}, {"authorId": "41232224", "name": "Omar Dakkak"}, {"authorId": "9425989", "name": "Adib Habbal"}, {"authorId": "2152317052", "name": "B. Kim"}], "citations": [{"paperId": "01c191c184156a0f3a1374a5abb2d3fe9508272b", "title": "A cloud-edge cooperative scheduling model and its optimization method for regional multi-energy systems"}, {"paperId": "9b7a2cf5d44ab4fa758bfbf5c5c42808771c2ef1", "title": "Intelligent Resource Orchestration for 5G Edge Infrastructures"}, {"paperId": "ffea42f3def4acf6c8e5c7c153b109b744db13d9", "title": "Quantum Variational Algorithms for the Allocation of Resources in a Cloud/Edge Architecture"}, {"paperId": "bb53b2d5c1ce84215739352b37645cb2776f55ec", "title": "A review of IoT applications in healthcare"}, {"paperId": "c8e73fe1d884ff06153b91d7317b8001b8473576", "title": "Multi-Criteria Optimization of Application Offloading in the Edge-to-Cloud Continuum"}, {"paperId": "3a8e0394d9f1719630266d424c5f5c21b8de4dab", "title": "Next-generation predictive maintenance: leveraging blockchain and dynamic deep learning in a domain-independent system"}, {"paperId": "0ce891908c88656d81d769b605f7445de2b5e638", "title": "A Survey on IoT-Edge-Cloud Continuum Systems: Status, Challenges, Use Cases, and Open Issues"}, {"paperId": "296eef122c0451359786b75565b6f12dd00db3e1", "title": "Towards Energy-Efficient Intelligent Edge Computing"}, {"paperId": "3f2e071247121c76fc736d9e13572ee7c5de64a7", "title": "Secure Video loT Monitoring System Based on ESP32"}, {"paperId": "4352f1c530d7a53f82cc5443c84ba570ee5443b5", "title": "Hierarchical Matching Algorithm for Relay Selection in MEC-Aided Ultra-Dense UAV Networks"}, {"paperId": "05d866d5636954cd6a52c9e3cec5aefada6a0f3c", "title": "Task Allocation Methods and Optimization Techniques in Edge Computing: A Systematic Review of the Literature"}, {"paperId": "56e52e7c1b5cba4829074e8b86f773c027cf1e25", "title": "Intelligent Sampling: A Novel Approach to Optimize Workload Scheduling in Large-Scale Heterogeneous Computing Continuum"}, {"paperId": "cfadf1c55c56616156d06e2788523c25a78023ff", "title": "Decentralized Replica Management in Latency-Bound Edge Environments for Resource Usage Minimization"}, {"paperId": "5ad032f6d4ed9a8bcbeb4f54808ad284513d6eb1", "title": "Forwarding Strategies for Named Data Networking Based IoT: Requirements, Taxonomy, and Open Research Challenges"}, {"paperId": "765ea9c9357cb592852e090c78b78ed8ffc302c5", "title": "Reinforcement Learning Approach for Optimizing Cloud Resource Utilization With Load Balancing"}]}
