{"paperId": "4a87b1fc50535d0016522008c5fedb9b6685c00e", "publicationVenue": null, "title": "Agriculture Yield Estimation Using Machine Learning Algorithms", "abstract": "Storage, distribution, pricing, marketing, import/export, and other policy considerations all depend on accurate and timely crop output estimates. The directorates of economics and statistics issues official predictions advance estimates in the form of estimates and projections for key grains and commercial crops. However, these guesses in advance are not the actual projections. Using the K-Nearest Neighbors (KNN) method to estimate agricultural yields is a good choice since it is easy to understand, can handle non-linearity, and works well with small to medium datasets. Given these features, KNN is a good choice for agricultural stakeholders, including academics, decision-makers, and farmers who may not have a lot of experience with machine learning. With the use of the KNN method, agricultural yield estimate models may be trained to provide precise crop production predictions given pertinent input data. There is a lot of subjective judgment based on a variety of qualitative criteria involved in arriving at these estimations. As a result, it’s important to provide objective, statistically reliable projections of future crop areas and yields. Technological developments in computers and data storage have made an enormous amount of Information available. The difficulty has been in gleaning insight from this mountain of data, but recent advances in areas like data mining have opened a door from this data to more precise estimates of agricultural yield. Results show that the accuracy is 90%, and the error value is 10% using the KNN algorithm for the given agriculture datasets.", "venue": "2024 International Conference on Automation and Computation (AUTOCOM)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2024-03-14", "journal": {"name": "2024 International Conference on Automation and Computation (AUTOCOM)", "pages": "187-191"}, "authors": [{"authorId": "2260371798", "name": "Ramakrishnan Raman"}, {"authorId": "2294754708", "name": "Hanumaji Kantari"}, {"authorId": "2291039787", "name": "Atul A Gokhale"}, {"authorId": "2294757943", "name": "K. Elangovan"}, {"authorId": "2292320333", "name": "B. Meenakshi"}, {"authorId": "2291115530", "name": "S. Srinivasan"}], "citations": []}
