{"paperId": "4a98355e240705ff6ebbcb5213b61e02cbc9c4a8", "publicationVenue": null, "title": "A systematic review of Green AI", "abstract": "With the ever‐growing adoption of artificial intelligence (AI)‐based systems, the carbon footprint of AI is no longer negligible. AI researchers and practitioners are therefore urged to hold themselves accountable for the carbon emissions of the AI models they design and use. This led in recent years to the appearance of researches tackling AI environmental sustainability, a field referred to as Green AI. Despite the rapid growth of interest in the topic, a comprehensive overview of Green AI research is to date still missing. To address this gap, in this article, we present a systematic review of the Green AI literature. From the analysis of 98 primary studies, different patterns emerge. The topic experienced a considerable growth from 2020 onward. Most studies consider monitoring AI model footprint, tuning hyperparameters to improve model sustainability, or benchmarking models. A mix of position papers, observational studies, and solution papers are present. Most papers focus on the training phase, are algorithm‐agnostic or study neural networks, and use image data. Laboratory experiments are the most common research strategy. Reported Green AI energy savings go up to 115%, with savings over 50% being rather common. Industrial parties are involved in Green AI studies, albeit most target academic readers. Green AI tool provisioning is scarce. As a conclusion, the Green AI research field results to have reached a considerable level of maturity. Therefore, from this review emerges that the time is suitable to adopt other Green AI research strategies, and port the numerous promising academic results to industrial practice.", "venue": "WIREs Data. Mining. Knowl. Discov.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-26", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "13"}, "authors": [{"authorId": "30461290", "name": "R. Verdecchia"}, {"authorId": "1711484832", "name": "June Sallou"}, {"authorId": "101422506", "name": "Luís Cruz"}], "citations": [{"paperId": "83b28cc1bd7021f98fde73136e7efb535cc085de", "title": "Towards Sustainable SecureML: Quantifying Carbon Footprint of Adversarial Machine Learning"}, {"paperId": "efa635aea3b60be4d8a0483645b50c04f52f4a82", "title": "Exploring Green AI for Audio Deepfake Detection"}, {"paperId": "d01437cab5cd34156d108b1c5eb9ccea311139a5", "title": "Fractional order memcapacitive neuromorphic elements reproduce and predict neuronal function"}, {"paperId": "195018353c33411465c8ab24e7585cf93bffb39c", "title": "Green information technology and green information systems: science mapping of present and future trends"}, {"paperId": "dceb5bce4050ac60f1c7336fe85beb6bf4d2d1dc", "title": "General Purpose Artificial Intelligence Systems (GPAIS): Properties, definition, taxonomy, societal implications and responsible governance"}, {"paperId": "ce8685ec91af580b1af07f3d742a0ebe4beeb257", "title": "Artificial Intelligence and Sustainability—A Review"}, {"paperId": "576ea392fe4110a894e068c99d95d37cf126f2ff", "title": "Training Green AI Models Using Elite Samples"}, {"paperId": "59694ad1bd202f36433b8c63f54876692f5250ab", "title": "Identifying architectural design decisions for achieving green ML serving"}, {"paperId": "c9a17e73322b3307f034788323f39bfeaa134e87", "title": "Development and evaluation of a reference measurement model for assessing the resource and energy efficiency of software products and components—Green Software Measurement Model (GSMM)"}, {"paperId": "fefa4f8a8be193ad5011f1f5b1bc29446016a11e", "title": "Biospheric AI"}, {"paperId": "b358f6154834861faa5d803ba8dc69bd3b79a45a", "title": "Involution Fused ConvNet for Classifying Eye-Tracking Patterns of Children with Autism Spectrum Disorder"}, {"paperId": "9d5f91b8fc491eaee77017529c9bf3c96ee160ec", "title": "Toward Responsible AI Use: Considerations for Sustainability Impact Assessment"}, {"paperId": "65f7e2bcf5be2c965cc66fc445b139bdbf47747a", "title": "A Synthesis of Green Architectural Tactics for ML-Enabled Systems"}, {"paperId": "02310f2e0084a4c5a239630b6db56e08135150de", "title": "Is Active Learning Green? An Empirical Study"}, {"paperId": "aab2482bb79f6ba19b1a37ec079997ccc5ce60af", "title": "Leveraging AI for Natural Disaster Management : Takeaways From The Moroccan Earthquake"}, {"paperId": "7b3359c7f7cfae9682d023c4e1347e9540cb4bd9", "title": "Limiting the Carbon Footprint of an Enterprise: Calculation Methods and Solutions"}, {"paperId": "bba17d286a0e9f0796c40194d623f0dc18244cbb", "title": "FROST: Towards Energy-efficient AI-on-5G Platforms – A GPU Power Capping Evaluation"}, {"paperId": "58b4c3fced4b117a35543bf1a49942d7652b232f", "title": "Visualizing the Carbon Intensity of Machine Learning Inference for Image Analysis on TensorFlow Hub"}, {"paperId": "4bba7619886dd031e76d6cd442f080c28bb340b5", "title": "The growing energy footprint of artificial intelligence"}, {"paperId": "618c4f35e06f79e1c71657b9e6c00df97e6ece12", "title": "Green AI Quotient: Assessing Greenness of AI-based software and the way forward"}, {"paperId": "374ba512a4fde8688ade5e1aad3b4a59e435e864", "title": "Efficiency is Not Enough: A Critical Perspective of Environmentally Sustainable AI"}, {"paperId": "bea6832bee3b7a373703de70be91d4e5b5714a4c", "title": "Enhancing Energy-Awareness in Deep Learning through Fine-Grained Energy Measurement"}, {"paperId": "92481db3aebc7bcc7b27fcca9319c3ede2f2a907", "title": "General Purpose Artificial Intelligence Systems (GPAIS): Properties, Definition, Taxonomy, Open Challenges and Implications"}, {"paperId": "99ca7a920ff335e846cc5da44bbfab493f7842ac", "title": "Batching for Green AI - An Exploratory Study on Inference"}, {"paperId": "221ac934ea3afc41c1b7f651464c88711b1ae23a", "title": "The Two Faces of AI in Green Mobile Computing: A Literature Review"}, {"paperId": "a68dc9208aae7578e8ee384caa8ccbcf34e539e8", "title": "Mini-Giants: \"Small\" Language Models and Open Source Win-Win"}, {"paperId": "748614d1e78c5384bd97fb6ec83e1f514b2dd98f", "title": "Understanding indirect users' privacy concerns in mobile forensics - A mixed method conjoint approach"}, {"paperId": "8c4673209b566be5c8928b498eb651a31c5abe8e", "title": "Do DL models and training environments have an impact on energy consumption?"}, {"paperId": "b531ec9810a1c913df2d76c75b167b55211e8a85", "title": "An Exploratory Literature Study on Sharing and Energy Use of Language Models for Source Code"}, {"paperId": "e284b6788c6e3fbc5094a7ab31e30249c7cb713f", "title": "Circular Systems Engineering"}, {"paperId": "682bae429d9c27ba958131eb3b9394153bc5ee7d", "title": "Exploring the Carbon Footprint of Hugging Face's ML Models: A Repository Mining Study"}, {"paperId": "397079e697a7ebbe9a13bad646333e266ce458b3", "title": "Uncovering Energy-Efficient Practices in Deep Learning Training: Preliminary Steps Towards Green AI"}, {"paperId": "f423c4ec159d76457665e3f459222d21688d1bbc", "title": "Which design decisions in AI-enabled mobile applications contribute to greener AI?"}, {"paperId": "1a784e1e3dffc417868202101cfba13e686e78e4", "title": "Toward Green AI: A Methodological Survey of the Scientific Literature"}, {"paperId": "38a063945846606059a5d9db518f559e4b6e799e", "title": "E STIMATING THE ENVIRONMENTAL IMPACT OF G ENERATIVE -AI SERVICES USING AN LCA-BASED METHODOLOGY"}, {"paperId": "d827dcb38b75c7ef0673607504c2497d60bc80b5", "title": "New Restrictions on AI from Physics: The Most Reliable Way to Predict AGI future?"}, {"paperId": "4a7f71e7ba00d2ef0b8f4e084a17f435548fe0f5", "title": "Deep learning and ecology: what practices, what values for the neuroimaging scientific community?"}, {"paperId": "86b483e13eca79cc5e9809d46d529e306ac481a4", "title": "EcoMLS: A Self-Adaptation Approach for Architecting Green ML-Enabled Systems"}, {"paperId": "9288872fdf1f8a0fc9a3e928527b62a96683e708", "title": "Artiﬁcial Intelligence and Sustainability—A Review"}]}
