{"paperId": "4a9ae912bac5ece4b70b44e81f7b231e2d8be51e", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Big Data for Natural Disasters in an Urban Railroad Neighborhood: A Systematic Review", "abstract": "Landslides and floods are among the most common disasters in Brazil and are responsible for losses on social, environmental, and economic scales, even resulting in deaths. Floods can negatively affect the structure and operations of a railway network, causing travel delays, train service cancellations, and major fines for the railway. The objective of this article is to conduct a bibliographic review of what is available in publications on natural disasters, particularly landslides and floods, big data techniques, and railroads, at international and national levels. A bibliometric analysis was carried out according to the “PRISMA Flow Diagram” guidelines. The analysis in this study was conducted through searches of the following reference databases: Scopus, Web of Science, Scielo, and Google Scholar. After the keyword search was completed, the absence of available data and references relating to Brazil was verified. This justified the development of this and other related papers, and the efforts necessary to turn these data into useful information for the managers of cities and environmental institutions. The aim of this study is to fill the gap in the research, focusing on Brazil, related to big data, smart cities, and natural disasters (particularly, landslides and floods), and to propose other papers that can be developed in this subject area.", "venue": "Smart Cities", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": ["Review"], "publicationDate": "2020-04-01", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "122944384", "name": "Thaís P. Correia"}, {"authorId": "83024564", "name": "A. Corsi"}, {"authorId": "1749010", "name": "J. A. Quintanilha"}], "citations": [{"paperId": "716caa27ce2d6137490f5d48ef01c4dda253c381", "title": "Data-driven comparison of urban sustainability towards sustainable urban development under sustainable development goals (SDGs): a review based on bibliometric analysis"}, {"paperId": "f516fe12cb17bda0cbcbd6c148a36c0d883b3d42", "title": "The role of explainable Artificial Intelligence in high-stakes decision-making systems: a systematic review"}, {"paperId": "afc9d5289ccb1d241af7ed7785550ed3947a8df0", "title": "The effects of flooding on railway infrastructure: A literature review"}]}
