{"paperId": "4a9b328280249cf2d9d9570b05598559797e9a90", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Research on E-Commerce Data Standard System in the Era of Digital Economy From the Perspective of Organizational Psychology", "abstract": "With the rapid development of technology and the economy, the expansion of the network has had a huge impact on the rapid expansion of the industrial agglomeration e-commerce industry, as well as ensuring the shopping experience of consumers. The rapid expansion of industrial cluster e-commerce has avoided precisely the limitations of logistical bottlenecks. Current networks and modern information technologies can provide good support and maintain a huge growth potential. In addition, digital technologies such as multimedia are becoming increasingly important in industry cluster marketing, and the concept of industry cluster e-commerce models is gaining more and more attention from companies. However, virtual e-commerce systems under industrial clusters have not been well researched in the existing studies. In this paper, through extensive research, literature reading and website browsing statistics, the virtual e-commerce models of different industrial agglomerations are studied. Firstly, the concept of big data and the processing of big data are given. Secondly, the concept of industrial agglomeration and the relationship between industrial agglomeration and e-commerce are analyzed. The basic number of domestic Internet users in the last 10 years is also counted, proving that the expansion of the Internet has led to a substantial growth of Internet users in the country and that e-commerce plays a significant role in the future of business activities. Finally the study concludes that different e-commerce models have different performance and roles in industrial agglomeration e-commerce and cannot be generalized. Instead, it is not good and can only develop different industrial agglomeration e-commerce models according to different environments.", "venue": "Frontiers in Psychology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-04", "journal": {"name": "Frontiers in Psychology", "volume": "13"}, "authors": [{"authorId": "9303518", "name": "Hongqiang Yue"}], "citations": [{"paperId": "005f884f2df901b6855da3ca4708ce507b2ef27b", "title": "Trends in E-Commerce And Social Media Research in Asia: Five Years of Scientometric and Content Analysis"}, {"paperId": "63d9be945f6049a2a59b4a8369a5e7802bf32d8a", "title": "Big data in relation with business intelligence capabilities and e-commerce during COVID-19 pandemic in accountant’s perspective"}, {"paperId": "82e37d4037655c744252dc20fbc94a20d18283a4", "title": "Research on the Impact of E-commerce on Offline Retail Industry"}, {"paperId": "1ca28b0a51c6f76046b66774ac60b353026f7e23", "title": "Research on the Influence of Digital Economy on Technological Innovation: Evidence from Manufacturing Enterprises in China"}]}
