{"paperId": "4a9d1fe59e6f10d68ffe594b47719438fafc271c", "publicationVenue": null, "title": "Role Of Blockchain in Securing Patient Data for Health Care Application", "abstract": "The purpose of blockchain technology is to make it feasible to store and transfer digital data without the danger of it being changed in transit. Immutable ledgers or transaction records that cannot be edited, erased, or destroyed are created based on a blockchain. DLT is another term for blockchain (DLT). Hashing is a complicated method that cannot be changed or reversed. When it comes to data security, it's all about preserving your information from unauthorized access and corruption at every step of its existence. Encryption, hashing, tokenization, and key management mechanisms are all part of the data security process. The term “identity and access management” encompasses all of the techniques and technologies that an organization uses to identify, authenticate, and authorize someone to access services or systems inside that organization or those of its affiliates. Due to the immutability of a distributed ledger, no personal data should be kept on it. This is why employing a distributed ledger is necessary, when using blockchain for identity management for healthcare. Patient identity has been secured in such a system. In the simulation, the comparative analysis of performance has been made where conventional processing time is compared to proposed processing time, error rate, and immunity toward external attacks. It has been observed that the proposed work is consuming less time and yields less error rate. More the impact of the external attack is less in the case of the proposed work as compared to conventional.", "venue": "2022 10th International Conference on Reliability, Infocom Technologies and Optimization (Trends and Future Directions) (ICRITO)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-13", "journal": {"name": "2022 10th International Conference on Reliability, Infocom Technologies and Optimization (Trends and Future Directions) (ICRITO)", "pages": "1-7"}, "authors": [{"authorId": "2218327041", "name": "Komal"}, {"authorId": "2195051897", "name": "Rajkumar"}], "citations": [{"paperId": "f60e5735e7c9277ca21d44202c13849da9a9437a", "title": "A Novel Authentication Scheme Based on Verifiable Credentials Using Digital Identity in the Context of Web 3.0"}]}
