{"paperId": "4ab932bc75747c26829f0aa5358b29e777c91303", "publicationVenue": {"id": "814418b2-3447-4cd1-867a-72377fbaef5b", "name": "Risk Analysis", "type": "journal", "alternate_names": ["Risk Anal"], "issn": "0272-4332", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1539-6924", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15396924"]}, "title": "Framework for cyber risk loss distribution of hospital infrastructure: Bond percolation on mixed random graphs approach", "abstract": "Networks like those of healthcare infrastructure have been a primary target of cyberattacks for over a decade. From just a single cyberattack, a healthcare facility would expect to see millions of dollars in losses from legal fines, business interruption, and loss of revenue. As more medical devices become interconnected, more cyber vulnerabilities emerge, resulting in more potential exploitation that may disrupt patient care and give rise to catastrophic financial losses. In this paper, we propose a structural model of an aggregate loss distribution across multiple cyberattacks on a prototypical hospital network. Modeled as a mixed random graph, the hospital network consists of various patient‐monitoring devices and medical imaging equipment as random nodes to account for the variable occupancy of patient rooms and availability of imaging equipment that are connected by bidirectional edges to fixed hospital and radiological information systems. Our framework accounts for the documented cyber vulnerabilities of a hospital's trusted internal network of its major medical assets. To our knowledge, there exist no other models of an aggregate loss distribution for cyber risk in this setting. We contextualize the problem in the probabilistic graph‐theoretical framework using a percolation model and combinatorial techniques to compute the mean and variance of the loss distribution for a mixed random network with associated random costs that can be useful for healthcare administrators and cybersecurity professionals to improve cybersecurity management strategies. By characterizing this distribution, we allow for the further utility of pricing cyber risk.", "venue": "Risk Analysis", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-10", "journal": {"name": "Risk Analysis", "pages": "2450 - 2485", "volume": "43"}, "authors": [{"authorId": "148024570", "name": "Stefano Chiaradonna"}, {"authorId": "46877961", "name": "Petar Jevtic"}, {"authorId": "3365931", "name": "N. Lanchier"}], "citations": [{"paperId": "8c26b22b206246855db593834ebd5766649cd3f8", "title": "Evaluating cyber loss in star-ring and star-bus hybrid networks based on the bond percolation model"}, {"paperId": "d8dbc9fa6b30e6cec06758918e91740241d9a8fd", "title": "Measures of Resilience to Cyber Contagion - An Axiomatic Approach for Complex Systems"}, {"paperId": "ee9bde69640c2d86de0962827527c7bb6b08d63f", "title": "Building resilience in cybersecurity: An artificial lab approach"}, {"paperId": "9b33a0d0992f5d568528d0f05570e66d6b018a72", "title": "Building Resilience in Cybersecurity - An Artificial Lab Approach"}]}
