{"paperId": "4ac2ce048584533e289cce4e39eadd8db892472b", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "A Data Analysis Framework Based on Cyber–Physical Systems to Support Data-Driven Decision-Making for Construction Sustainability", "abstract": "The construction industry has seen significant advances with the rapid development of cyber–physical systems (CPS). However, the dynamic and complex nature of construction projects still presents various engineering problems throughout their lifecycle. Traditional data analysis methods for engineering problems are inefficient due to the difficulty of collecting, processing, and aggregating data from disparate CPS systems. The lack of practical data analysis methods for solving engineering problems severely affects the sustainability of construction projects. This article develops a CPS-based data analysis framework, the spatial, temporal, and dynamic dimensional data analysis framework, which integrates the data analysis process, decision-making methods, and CPS technologies. It aims to facilitate more efficient data-driven decision-making on engineering issues to improve the sustainability of construction projects. The proposed framework has been implemented in a case study of the Shanghai Planetarium project to demonstrate its applicability and effectiveness.", "venue": "IEEE Systems Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Systems Journal", "pages": "5239-5250", "volume": "17"}, "authors": [{"authorId": "2152973608", "name": "Wei Zheng"}, {"authorId": "143630500", "name": "Wen-der Yu"}, {"authorId": "48512333", "name": "Y. Le"}], "citations": []}
