{"paperId": "4adcef29517b27d5b28366a44b02b22e73781522", "publicationVenue": {"id": "a6d3ae60-1ea6-478f-bdce-4209eda4f00d", "name": "International Conference on Dependable Systems, Services and Technologies", "type": "conference", "alternate_names": ["DESSERT", "Int Conf Dependable Syst Serv Technol"]}, "title": "Cloud system ArcGIS online as a managerial decision-making tool in agricultural production", "abstract": "Agriculture has always contributed to the development and accelerated implementation of geoinformation technologies in the section of national economy and the economy of the country as a whole. Official release of the ESRI product — ArcGIS Online opens up new opportunities for “cloud” GIS infrastructure for agribusiness in the area of management decision-making. The publication of vector and raster materials in the form of data services is called to increase the efficiency of making managerial decisions, which in turn should provide a solution to a wide range of tasks for scientifically-based commodity agricultural production implementing.", "venue": "International Conference on Dependable Systems, Services and Technologies", "year": 2018, "fieldsOfStudy": ["Business"], "publicationTypes": ["Conference"], "publicationDate": "2018-05-01", "journal": {"name": "2018 IEEE 9th International Conference on Dependable Systems, Services and Technologies (DESSERT)", "pages": "534-538"}, "authors": [{"authorId": "1455693927", "name": "M. Mariushko"}, {"authorId": "2095234134", "name": "R. E. Pashchenko"}, {"authorId": "51072590", "name": "A. Nechausov"}], "citations": [{"paperId": "c0a6355bef8f7ea72036d92d3dc73d5366148b0d", "title": "Quantifying uncertainty in land cover mappings: An adaptive approach to sampling reference data using Bayesian inference"}, {"paperId": "0b734e0dd553784669dcea32bf47e809c16482ec", "title": "A spatial decision support system for municipal solid waste landfill sites (case study: The Mazandaran Province, Iran)"}, {"paperId": "91c043e7012b2ffff43e345585dbd1a5432b0e8c", "title": "Map Whiteboard Cloud Solution for Collaborative Editing of Geographic Information"}, {"paperId": "780c54e86f1b574228f4c9eca6ecb488be523ad7", "title": "Information system for managing the register of serialized items based on a cloud service for enterprise economic development"}]}
