{"paperId": "4ae98f4634e20bc9cc2b3a73fae5cb7d5b0ec2eb", "publicationVenue": {"id": "8acaada7-7c03-41b4-bcef-65926e7ee9fb", "name": "SoutheastCon", "type": "conference", "alternate_names": ["SoutheastCon"]}, "title": "Network security analysis using Big Data technology", "abstract": "With the evolution of networks, threats or attacks with the intention of disrupting service or stealing confidential data are increasing tremendously. Networks have to be monitored constantly and protected against attacks. In this paper, a new method to analyze network traffic using Big Data techniques is introduced. This approach detects anomalous activities being carried out and malicious data being transmitted over the networks through processing and loading traffic data into Hive database in Hadoop Distributed File System (HDFS) environment, and analyzing the data using Hive queries. The results of using this method to detect attacks on the sample dataset are also presented.", "venue": "SoutheastCon", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-03-01", "journal": {"name": "SoutheastCon 2016", "pages": "1-4"}, "authors": [{"authorId": "30723427", "name": "Yogeshwar Rao Bachupally"}, {"authorId": "143893172", "name": "Xiaohong Yuan"}, {"authorId": "123313777", "name": "K. Roy"}], "citations": [{"paperId": "64f917de00bde675f5470f633ee606d219994a29", "title": "Big Data Security: Detect and Prevent the Data from Attacks with Digital Forensic Tools"}, {"paperId": "b46f20c0f6120fed0571ad8358f60eca5743ebf0", "title": "Examining Penetration Tester Behavior in the Collegiate Penetration Testing Competition"}, {"paperId": "faaa97c2206376fe7f120d7226b4920d85f656d7", "title": "Big Data-Aware Intrusion Detection System in Communication Networks: a Deep Learning Approach"}, {"paperId": "d4e7e6c5f4923d7da8f6b85e55df956c164138c4", "title": "Detection of application layer DDoS attacks using big data technologies"}, {"paperId": "78db9056ab4142e97ec419fa18bf0b299363e544", "title": "Environment for Threat Intelligence Analysis and Generation using Open Sources"}, {"paperId": "c5f4a3c8b3f09642862660b03523a7ab89f062a2", "title": "E-Had: A distributed and collaborative detection framework for early detection of DDoS attacks"}, {"paperId": "ee786cb8276a6a93dd05c800df04c3033c54440c", "title": "Computer Network Security Processing Technology in Big Data Environment"}, {"paperId": "2df10c3b42e97c09310ae47441bb2ecf0951f569", "title": "Hadoop in Action: Building a Generic Log Analyzing System"}, {"paperId": "06a96870810fee120960f0482f6b1aa4022da45b", "title": "Hadoop‐based analytic framework for cyber forensics"}, {"paperId": "8e7cb4bc806b68edbc3ad4dd9a1bf4d5da75b183", "title": "Big data analytics for network anomaly detection from netflow data"}, {"paperId": "5cd95eb8854862216677719b88df24e313701ace", "title": "Development of a network intrusion detection system using Apache Hadoop and Spark"}, {"paperId": "eb270b0c120fe221b4fe4fbb9d5d983f33cb8091", "title": "A Comparative Study of Recent Advances in Big Data for Security and Privacy"}, {"paperId": "107e26d9af1fd57d50506346adcdb8b67a4032bc", "title": "Analyzing network traffic data using Hive queries"}, {"paperId": "fde68fc36e1a7f0e70e1fd12a58eee6b8afbb317", "title": "A GPU Unified Platform to Secure Big Data Transportation Using an Error-Prone Elliptic Curve Cryptography"}, {"paperId": "866b6b9b9de1fd9977cc80c7748a9cdada145b16", "title": "Fine-tuning Resource Allocation of Apache Spark Distributed Multinode Cluster for Faster Processing of Network-trace Data"}]}
