{"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires", "abstract": "Bushfires have been a key concern for countries such as Australia for a long time. These must be mitigated to eradicate the associated harmful effects on the climate and to have a sustainable and healthy environment for wildlife. The current study investigates the 2019–2020 bushfires in New South Wales (NSW) Australia. The bush fires are mapped using Geographical Information Systems (GIS) and remote sensing, the hotpots are monitored, and damage is assessed. Further, an Unmanned Aerial Vehicles (UAV)-based bushfire mitigation framework is presented where the bushfires can be mapped and monitored instantly using UAV swarms. For the GIS and remote sensing, datasets of the Australian Bureau of Meteorology and VIIRS fire data products are used, whereas the paths of UAVs are optimized using the Particle Swarm Optimization (PSO) algorithm. The mapping results of 2019–2020 NSW bushfires show that 50% of the national parks of NSW were impacted by the fires, resulting in damage to 2.5 million hectares of land. The fires are highly clustered towards the north and southeastern cities of NSW and its border region with Victoria. The hotspots are in the Deua, Kosciu Sako, Wollemi, and Yengo National Parks. The current study is the first step towards addressing a key issue of bushfire disasters, in the Australian context, that can be adopted by its Rural Fire Service (RFS), before the next fire season, to instantly map, assess, and subsequently mitigate the bushfire disasters. This will help move towards a smart and sustainable environment.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "1657644010", "name": "S. Qayyum"}], "citations": [{"paperId": "602a418122d2d30b900a115ce04ea5c26796cb5d", "title": "Incentives for self-evacuation: A panacea for bushfire fatalities in the Australian bushfire-prone areas"}, {"paperId": "232ee163d65526aa27a970aa0941cc0b4f28d211", "title": "Metaheuristic Algorithms in UAV Path-Planning Optimization: A Systematic Review (2018–2022)"}, {"paperId": "f0488565233d8791dfbeb58516cae0016d2e25ad", "title": "Bushfire Management Strategies: Current Practice, Technological Advancement and Challenges"}, {"paperId": "4f12c4fe4a0bb08c81f8b9dc5a2833a4d4b82bc7", "title": "Exploring unmanned aerial systems operations in wildfire management: data types, processing algorithms and navigation"}, {"paperId": "dc117ce0415a052323ae4fc99b2cc1f79d690e80", "title": "Multiple Unmanned Aerial Vehicle Autonomous Path Planning Algorithm Based on Whale-Inspired Deep Q-Network"}, {"paperId": "591a701849442218f2924029da3d1dc6f2e4c06b", "title": "Artificial neural networks for assessing forest fire susceptibility in Türkiye"}, {"paperId": "d52eb032a7af6b90aab0f644c8696a5152ad74a2", "title": "Late Holocene fire and precipitation history of the Kashmir Himalaya: Inferences from black carbon in lake sediments"}, {"paperId": "a510578d1de1abc11b80a43db798eeecc7c355b0", "title": "System-Level Performance Analysis of Cooperative Multiple Unmanned Aerial Vehicles for Wildfire Surveillance Using Agent-Based Modeling"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "6843a5ab329069b7a152c9ca0081bae9366f7c40", "title": "Detecting Natural Hazard-Related Disaster Impacts with Social Media Analytics: The Case of Australian States and Territories"}, {"paperId": "5098bf49e37932cd4df0ce07018e4151b42c2790", "title": "Inspecting Buildings Using Drones and Computer Vision: A Machine Learning Approach to Detect Cracks and Damages"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "f39e5bf6948806d5b3ef33e2802b382292316230", "title": "Assessing Nitrate Contamination Risks in Groundwater: A Machine Learning Approach"}]}
