{"paperId": "4afe00a53ed14d475d2df8b5da9c281d74b2ca53", "publicationVenue": null, "title": "Incorporating big data within retail organizations: A case study approach", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-05-01", "journal": {"name": "Journal of Retailing and Consumer Services", "pages": "102447", "volume": "60"}, "authors": [{"authorId": "81618114", "name": "Joseph M. Aversa"}, {"authorId": "144800416", "name": "T. Hernández"}, {"authorId": "32122603", "name": "S. Doherty"}], "citations": [{"paperId": "f3361472ebaa536a586cf23d83928e0400232e2f", "title": "When it rains, it pours? The impact of weather on customer returns in the brick-and-mortar retail store"}, {"paperId": "423c1e2f0d74033c1f9a09546b6297ce7da80f7b", "title": "Examining Challenges In The Adoption of Big Data In Health Care Institutions And Its Impact On Patients Satisfaction: An empirical study in Delhi, India"}, {"paperId": "0c3125451c3c965f889ca8f1a14e42581ca88be5", "title": "From transactions to transformations: exploring transformative food retailing"}, {"paperId": "f9c1eae8e55b42f1612be73736464bd10e10281b", "title": "Design and Development of Multipurpose Data Acquisition for Effective Transportation"}, {"paperId": "151ecb90077d23891feda35b530b59a585bf475a", "title": "The intermediating role of big data analytics capability between responsive and proactive market orientations and firm performance in the retail industry"}, {"paperId": "bf71e59f38a775a5d06100dbdeff247a9f3f4d12", "title": "Challenges in Adoption of Business Analytics by Small Retailers: An Empirical Study in the Indian Context"}, {"paperId": "91a6858aa5969fb55eb2a12f6b86556b0acc76d0", "title": "Drivers and impact of big data analytic adoption in the retail industry: A quantitative investigation applying structural equation modeling"}, {"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect"}, {"paperId": "df16be9b4aa251ab6ea6245cdd35c06bb0b15b9b", "title": "HIGH EFFICIENCY PUBLIC TRANSPORTATION SYSTEM: ROLE OF BIG DATA IN MAKING RECOMMENDATIONS"}, {"paperId": "c5ff5f81606cb3cf32f91f62fd6f350942398f12", "title": "Digitalization driven retail business model innovation: Evaluation of past and avenues for future research trends"}, {"paperId": "a46b6112792f0c297b7999b5ecaf782e99198534", "title": "Does Big Data Drive Innovation In E-Commerce: A Global Perspective?"}, {"paperId": "332936122bfea3674b6492ac51a42040f2e63ec3", "title": "IMPACT OF BIG DATA ANALYTICS ON DISTRIBUTED MANUFACTURING: DOES BIG DATA HELP?"}, {"paperId": "e7c681e795356077282f5fed24a3a9b144d1d1b0", "title": "poder de la geolocalización, una revisión de literatura sobre el uso de la geointeligencia en el sector comercio"}, {"paperId": "d0b78b55ce190ddc36452484c8c2514706b2c757", "title": "Development of teachers’ digital competencies on the basis of Innopolis University"}, {"paperId": "2aba816bbf94349393756d82459dac4ef14d8807", "title": "Combining sell-out data with shopper behaviour data for category performance measurement: The role of category conversion power"}, {"paperId": "cd4247e6e08f6c33c09005e7ba16b18468ac88c5", "title": "Industry 4.0 enablers in retailing: a literature review"}, {"paperId": "cd44bf8a46ae23fa57590f55a702af605088591d", "title": "Cross-national differences in big data analytics adoption in the retail industry"}, {"paperId": "42019de8c05040dde0b763a321b939be707711e4", "title": "Use of electronic educational resources for the development of digital competencies of commerce students"}, {"paperId": "2bd1ce268246f22f65705f8193cd1bb822d80d20", "title": "Problems of Big Data Adoption in the Healthcare Industries"}, {"paperId": "01496422edbec4de1e85222dc60787d5b9cfc21e", "title": "The geography of lifestyle center growth: The emergence of a retail cluster format in the United States"}, {"paperId": "8e1d9a5a43abbcbb7997dd4ed31c229ebb16b8b0", "title": "Challenges faced by the adoption of big data in the Dominican Republic construction industry: an empirical study"}, {"paperId": "5dbafe9ce8fbf8547dcdd119e89815e33ac5cb13", "title": "Retail store location screening: A machine learning-based approach"}, {"paperId": "903e61e27431cc86920345ce5d3ca252843138ed", "title": "Uso de deep learning para a construção de um modelo de recuperação da informação aplicado para o setor de mineração no Brasil"}, {"paperId": "8018270ddbd47ddbbe6ea2bf8559f0af5d0e771c", "title": "Clothing Sales Forecast Considering Weather Information: An Empirical Study in Brick-and-Mortar Stores by Machine-Learning"}, {"paperId": "f6a7414edb6e5d53369d5f865760d7b111a0dd73", "title": "Effect of bargaining on pricing and retailing under a green supply chain management"}, {"paperId": "8c596c9133bdb854aafb290b3b09e4675d470ef9", "title": "New products or remanufactured products: Which is consumer-friendly under a closed-loop multi-level supply chain?"}, {"paperId": "08c75f96c1afd89d4160b670de132c30cffc2412", "title": "Impact of blockchain-enabled analytics as a tool to revolutionize the banking industry"}, {"paperId": "887298f5471bc7bb07ab7516431883882ff62cab", "title": "How to Improve Organizational Performance Using Big Data in the Hotels"}, {"paperId": "24fe0e62841fcf3a80b120e696d076e4cca6d8c0", "title": "Impact of social media analytics on digital innovation"}, {"paperId": "788131b9cf42dfcd1b9b53d9b96a1dc832316a50", "title": "RESHAPING THE FUTURE OF RETAIL MARKETING THROUGH “BIG DATA”: A REVIEW FROM 2009 TO 2022"}, {"paperId": "56394be3714bc1563f122749af742d2c4af2e865", "title": "Retail Indicators Forecasting and Planning"}, {"paperId": "a4bcd46fb3e92b57c8363c5129c2fc5edb51f44c", "title": "The Development of E-commerce in the Context of the Digitalization of the Economy"}]}
