{"paperId": "4b02e5505dc7cafbbea71a7bf4cce54a071f2a05", "publicationVenue": {"id": "f3fc2b06-d105-40f5-a248-64cf28379e9c", "name": "IEEE International Symposium on Network Computing and Applications", "type": "conference", "alternate_names": ["NCA", "IEEE Int Symp Netw Comput Appl", "Network Computing and Applications", "Netw Comput Appl"], "url": "http://www.ieee-nca.org/"}, "title": "Never Alone: a Quality of Context-aware Monitoring System for Aging in Place Smart Home", "abstract": "Technology is always improving, which raises standards of living and makes life easier for people. A significant portion of these advancements are aimed at healthcare systems, with a particular emphasis in recent years on assisting elderly people in maintaining their independence in their homes. Data is collected continuously from various sensors and is used for contextual anomaly detection. As a result, the amount of sensor contextual data grows exponentially. These sensor data’s ability to be shared, reused, and interpreted was, however, constrained by the lack of syntactic or semantic integrity. On the other hand, understanding the Quality of Context (QoC) is acknowledged as a crucial component for the health monitoring system’s performance. The QoC has a significant impact on how contextual data behaves in health monitoring systems. As a result, health monitoring systems need to manage the QoC they rely on carefully and effectively. To address these problems, the main goal of this study is to develop a Context and Quality of Context (CQoC) ontology, which offers a framework for handling and utilizing contextual data, any QoC criteria, as well as context interpretation in a health monitoring system. Another purpose of this paper is the development of a Semantic QoC-aware Health Monitoring System (SQoCHMS) for the elderly that assures their safety and issues early alerts to help them deal with minor everyday problems related to such disorders.", "venue": "IEEE International Symposium on Network Computing and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-14", "journal": {"name": "2022 IEEE 21st International Symposium on Network Computing and Applications (NCA)", "pages": "209-215", "volume": "21"}, "authors": [{"authorId": "51918012", "name": "Hajer Nabli"}, {"authorId": "2202003919", "name": "Ines Regaig"}, {"authorId": "2482999", "name": "Raoudha Ben Djemaa"}, {"authorId": "3147672", "name": "Layth Sliman"}], "citations": []}
