{"paperId": "4b058226817ac0077e6da5b05eb6eb61032f1c70", "publicationVenue": {"id": "22466e99-8720-4629-9169-4469e385e4d8", "name": "IEEE International Conference on Emerging Technologies and Factory Automation", "type": "conference", "alternate_names": ["Emerg Technol Fact Autom", "IEEE Int Conf Emerg Technol Fact Autom", "ETFA", "Emerging Technologies and Factory Automation"], "url": "http://www.wikicfp.com/cfp/program?id=937"}, "title": "Cloud Native Computing for Industry 4.0: Challenges and Opportunities", "abstract": "Cloud-based architectures are advantageous in aspects such as scalability, reliability and resource utilization efficiency, to name just a few, thus being considered one of the pillars of Industry 4.0. However, in this domain, cloud computing platforms are subject to specific requirements, namely in what concerns real-time performance, determinism and fault-tolerance. This paper focuses on cloud native computing, which is an emerging and promising cloud-computing paradigm, specifically addressing its applicability to real-time systems. Firstly, it introduces the architecture of cloud native applications, discussing their principles, potential advantages and challenges. Then it addresses the opportunities and constraints of such technologies when applied to industrial real-time systems.", "venue": "IEEE International Conference on Emerging Technologies and Factory Automation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-07", "journal": {"name": "2021 26th IEEE International Conference on Emerging Technologies and Factory Automation (ETFA )", "pages": "01-04"}, "authors": [{"authorId": "2142903923", "name": "Guilherme Gil"}, {"authorId": "2472311", "name": "Daniel Corujo"}, {"authorId": "1718252", "name": "P. Pedreiras"}], "citations": [{"paperId": "64f76ace5135c20e70c85636d534d15f4d68ec57", "title": "Incorporating Cloud Native Architecture and DevOps Culture to Improve Company Agility"}, {"paperId": "2c8bccb96bc922eb57d824b573a417e31597fa39", "title": "Cloud-Native Computing: A Survey From the Perspective of Services"}, {"paperId": "6e4ced0331873ef4199e716fe52d944814490ce0", "title": "Real-Time FaaS: serverless computing for Industry 4.0"}]}
