{"paperId": "4b085b3878436f32b2c432491f5512be90f1a2eb", "publicationVenue": null, "title": "Raster Intervals: An Approximation Technique for Polygon Intersection Joins", "abstract": "Many data science applications, most notably Geographic Information Systems, require the computation of spatial joins between large object collections. The objective is to find pairs of objects that intersect, i.e., share at least one common point. The intersection test is very expensive especially for polygonal objects. Therefore, the objects are typically approximated by their minimum bounding rectangles (MBRs) and the join is performed in two steps. In the filter step, all pairs of objects whose MBRs intersect are identified as candidates; in the refinement step, each of the candidate pairs is verified for intersection. The refinement step has been shown notoriously expensive, especially for polygon-polygon joins, constituting the bottleneck of the entire process. We propose a novel approximation technique for polygons, which (i) rasterizes them using a fine grid, (ii) models groups of nearby cells that intersect a polygon as an interval, and (iii) encodes each interval by a bitstring that captures the overlap of each cell in it with the polygon. We also propose an efficient intermediate filter, which is applied on the object approximations before the refinement step, to avoid it for numerous object pairs. Via experimentation with real data, we show that the end-to-end spatial join cost can be reduced by up to one order of magnitude with the help of our filter and by at least three times compared to using alternative intermediate filters.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-30", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 18", "volume": "1"}, "authors": [{"authorId": "2093476346", "name": "T. Georgiadis"}, {"authorId": "1718168", "name": "N. Mamoulis"}], "citations": [{"paperId": "94cda0b8fe153f49953c295127f230fb2f0a9a62", "title": "A learning-based framework for spatial join processing: estimation, optimization and tuning"}, {"paperId": "3b5325634156f6128cb6b68cc93690d70165e111", "title": "GridMesa: A NoSQL-based big spatial data management system with an adaptive grid approximation model"}, {"paperId": "d1dd5b7b1132da752c7cf0b11a06f7bc1d8a5065", "title": "SwiftSpatial: Spatial Joins on Modern Hardware"}, {"paperId": "75e9eee522c8c43fba967e82cf7a8a9592095df6", "title": "APRIL: Approximating Polygons as Raster Interval Lists"}, {"paperId": "91f2d5b32ce07287cfff3cb615868c43c3199b54", "title": "Scalable Query Processing on Big Spatial Data"}]}
