{"paperId": "4b169a78b9fa9d335d139d233fd5d982508df416", "publicationVenue": {"id": "3bc59e53-8413-4f2a-b739-d2b155898833", "name": "International Conference on Contemporary Computing", "type": "conference", "alternate_names": ["Int Conf Contemp Comput", "IC3"], "url": "http://www.wikicfp.com/cfp/program?id=1263"}, "title": "GeoAI – Accelerating a Virtuous Cycle between AI and Geo", "abstract": "Geospatial artificial intelligence (GeoAI) is the amalgamation of artificial intelligence (AI) with spatial computing to develop a better understanding of the physical world around us at the levels of an individual, communities, cities, nations, and the planet us-ing geospatial data. The current applications of GeoAI vary from solving challenges in the fields of sustainable development, urban planning, supply chains, and navigation to defense, epidemiology, insurance, and the emerging on-demand economy. It is a highly interdisciplinary field that uses ideas from computing, geography, spatial data science, statistics, and engineering. The unique features of geospatial data like autocorrelation, geometric nature, and multiple modalities requires the AI algorithms to be developed in a fundamentally different way, which also expands the capabilities of AI in general. Considering the exponential increasing geospatial data and application, this confluence of AI and geospatial will become a virtuous cycle of growth for both AI and Geo.", "venue": "International Conference on Contemporary Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-08-05", "journal": {"name": "Proceedings of the 2021 Thirteenth International Conference on Contemporary Computing"}, "authors": [{"authorId": "50109795", "name": "Lokendra P. S. Chauhan"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "4f07d7bcde64de2f6f8d64911cf3cffc46cfbbab", "title": "Utilization of GeoAI Applications in the Health Sector: A Review"}, {"paperId": "f2e312cc755a5c5f651c0eb4cf7fd1de3468e3ee", "title": "A short review of the main concerns in A.I. development and application within the public sector supported by NLP and TM"}]}
