{"paperId": "4b1e5e3ee8f57758d89937f7766f44ce0af58a97", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Toward Hybrid Static-Dynamic Detection of Vulnerabilities in IoT Firmware", "abstract": "IoT devices are becoming increasingly ubiquitous because they have greatly simplified many aspects of our daily life and our work. However, most firmware in these embedded devices carry various security vulnerabilities, such as hard-cod-ed passwords, cryptographic keys, insecure configurations and backdoors. Recent large-scale attacks have demonstrated that the security vulnerabilities in IoT firmware have posed a severe threat to the Internet infrastructure. In this work, we design a hybrid platform to detect vulnerabilities in IoT firmware, which integrates both offline static detection and online dynamic detection. Our evaluation on real IoT devices shows that the proposed platform can effectively identify various security weaknesses and risks in firmware, such as dangerous processes, exploitable vulnerabilities, and other attack surfaces.", "venue": "IEEE Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "IEEE Network", "pages": "202-207", "volume": "35"}, "authors": [{"authorId": "1776387", "name": "Daojing He"}, {"authorId": "7143138", "name": "Hongjie Gu"}, {"authorId": "2118549829", "name": "Tinghui Li"}, {"authorId": "2111868172", "name": "Yongliang Du"}, {"authorId": "38983411", "name": "Xiaolei Wang"}, {"authorId": "1712616", "name": "Sencun Zhu"}, {"authorId": "2554658", "name": "Nadra Guizani"}], "citations": [{"paperId": "f06cc63a600f86ca41d1438dba46206d28e933a1", "title": "Internet-Scale Fingerprinting the Reusing and Rebranding IoT Devices in the Cyberspace"}, {"paperId": "ae8e99e9e09053314ef86aac9ea77d0d1898418e", "title": "Data Privacy, Conceptual Framework for IoT Based Devices in Healthcare: A Systematic Review"}, {"paperId": "91df3322a37e60180a57b42a28cdc5ffd9a2b2d5", "title": "A method for vulnerability detection by IoT network traffic analytics"}, {"paperId": "c99bdd9eb9a5875983649f42d190813f1da0e336", "title": "No More Companion Apps Hacking but One Dongle: Hub-Based Blackbox Fuzzing of IoT Firmware"}, {"paperId": "1e28632daafe5210610f7cdd0ca3ea3fe242d43f", "title": "Um Método para Detecção de Vulnerabilidades Através da Análise do Tráfego de Rede IoT"}, {"paperId": "548d6d40090840745536430d1456f970a5a7ffb5", "title": "RW-Fuzzer: A Fuzzing Method for Vulnerability Mining on Router Web Interface"}, {"paperId": "b1ab7faf7a16821d85afd9b4e101cb4a49dd6ee4", "title": "A Large-Scale Analysis of IoT Firmware Version Distribution in the Wild"}, {"paperId": "18c3a1fac3c4211ab32e85edec6790a758f3467f", "title": "ACCEPTED FROM OPEN CALL"}]}
