{"paperId": "4b231a7d822ab8be504c411d47068fa51612d789", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Fairness-aware Online Price Discrimination with Nonparametric Demand Models", "abstract": "Price discrimination, which refers to the strategy of setting different prices for different customer groups, has been widely used in online retailing. Although it helps boost the collected revenue for online retailers, it might create serious concerns about fairness, which even violates the regulation and laws. This paper studies the problem of dynamic discriminatory pricing under fairness constraints. In particular, we consider a finite selling horizon of length $T$ for a single product with two groups of customers. Each group of customers has its unknown demand function that needs to be learned. For each selling period, the seller determines the price for each group and observes their purchase behavior. While existing literature mainly focuses on maximizing revenue, ensuring fairness among different customers has not been fully explored in the dynamic pricing literature. This work adopts the fairness notion from Cohen et al. (2022). For price fairness, we propose an optimal dynamic pricing policy regarding regret, which enforces the strict price fairness constraint. In contrast to the standard $\\sqrt{T}$-type regret in online learning, we show that the optimal regret in our case is $\\tilde{O}(T^{4/5})$. We further extend our algorithm to a more general notion of fairness, which includes demand fairness as a special case. To handle this general class, we propose a soft fairness constraint and develop a dynamic pricing policy that achieves $\\tilde{O}(T^{4/5})$ regret. We also demonstrate that our algorithmic techniques can be adapted to more general scenarios such as fairness among multiple groups of customers.", "venue": "Social Science Research Network", "year": 2021, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-16", "journal": {"name": "ArXiv", "volume": "abs/2111.08221"}, "authors": [{"authorId": "2145306917", "name": "Xi Chen"}, {"authorId": "2144552769", "name": "Xuan Zhang"}, {"authorId": "2046913376", "name": "Yuanshuo Zhou"}], "citations": [{"paperId": "c226e1007436976abed4cadd4b2e5a4aae6813a7", "title": "Utility Fairness in Contextual Dynamic Pricing with Demand Learning"}, {"paperId": "7fa790356cd0cecad4bb1efa71b8f71812b43ef6", "title": "Contextual Dynamic Pricing with Strategic Buyers"}, {"paperId": "d6b2b76e1c040a46a34c81d4fffc987aca79fbcb", "title": "Doubly Fair Dynamic Pricing"}, {"paperId": "142faf010e8059452c0583965ef60f001c240d0d", "title": "EXPRESS: Network Revenue Management with Demand Learning and Fair Resource-Consumption Balancing"}, {"paperId": "2f4cc5ba99753900ecd999ea2b735d2e96e81c18", "title": "Algorithmic Challenges in Ensuring Fairness at the Time of Decision"}, {"paperId": "3e7576415babe926d50a0fb81d7f45cb06fb55a1", "title": "Fairness-aware Network Revenue Management with Demand Learning"}]}
