{"paperId": "4b3c6e8c18714e58a2742b9c804dd5799ed7d119", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "QCFE: An efficient Feature engineering for query cost estimation", "abstract": "Query cost estimation is a classical task for database management. Recently, researchers apply the AI-driven model to implement query cost estimation for achieving high accuracy. However, two defects of feature design lead to poor cost estimation accuracy-time efficiency. On the one hand, existing works only encode the query plan and data statistics while ignoring some other important variables, like storage structure, hardware, database knobs, etc. These variables also have significant impact on the query cost. On the other hand, due to the straightforward encoding design, existing works suffer heavy representation learning burden on ineffective dimensions of input. To meet the above two problems, we first propose an efficient feature engineering for query cost estimation, called QCFE. Specifically, we design a novel feature called feature snapshot to efficiently integrate the influences of the ignored variables. Further, we propose a difference-propagation feature reduction method for query cost estimation to filter the useless features. The experimental results demonstrate our QCFE could largely improve the time-accuracy efficiency on extensive benchmarks.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-02", "journal": {"name": "ArXiv", "volume": "abs/2310.00877"}, "authors": [{"authorId": "2109341618", "name": "Yu Yan"}, {"authorId": "2253816654", "name": "Hongzhi Wang"}, {"authorId": "2254040843", "name": "Junfang Huang"}, {"authorId": "2253399706", "name": "Dake Zhong"}, {"authorId": "2253823991", "name": "Man Yang"}, {"authorId": "2153280163", "name": "Kaixin Zhang"}, {"authorId": "2256865338", "name": "Tao Yu"}, {"authorId": "2253397530", "name": "Tianqing Wan"}], "citations": []}
