{"paperId": "4b47b9601579039c8291803a9be78b950adc7a4d", "publicationVenue": null, "title": "Collaborative approaches and adaptability in disaster risk situations", "abstract": "PurposeThe aim of the study was to examine the role of collaborative approaches (productive collaboration, collaborative innovation and collaborative risk management) in disaster risk situations. Thus, the study focused on the effect of productive collaboration and collaborative innovation on collaborative risk management, and the effect of collaborative risk management and collaborative innovation on adaptability.Design/methodology/approachData were collected from nongovernmental organizations (NGOs). The Covariance Based Structural Equation Modeling software was used to obtain results on the influence of productive collaboration and collaborative innovation on collaborative risk management, the influence of collaborative innovation on adaptability and the influence of collaborative risk management on adaptability.FindingsFindings indicated that both productive collaboration and collaborative innovation influence collaborative risk management, and both collaborative innovation and collaborative risk management influence adaptability.Research limitations/implicationsThe study mainly focused on the NGOs eliminating the government, beneficiaries and other actors that may be involved in disaster risk situations. The research has implications to decision makers in government, NGOs and other actors concerned with disaster risk management.Originality/valueCountries worldwide are focusing on collaborative innovation and productive collaboration in addition to collaborative risk management to respond to epidemics and natural disasters. Despite the relevance of the collaborative initiatives, empirical research explaining the relevance of the variables to adaptability of actors during epidemics or natural disasters is still lacking.", "venue": "Continuity &amp; Resilience Review", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-06-14", "journal": {"name": "Continuity &amp; Resilience Review"}, "authors": [{"authorId": "72933783", "name": "Sheila Namagembe"}], "citations": [{"paperId": "e3aedbbc884b27cfcaeac397e19094b6fe0b2ab8", "title": "Alliances and digital transformation are crucial for benefiting from dynamic supply chain capabilities during times of crisis: A multi-method study"}, {"paperId": "257dd27f7f9bef34252918fb3fda7d51d1d1394f", "title": "Evaluation of effectiveness of disaster risk transfer mechanisms in Sri Lanka"}, {"paperId": "4ee16335bd20062e2c34d6a783131ef2a4d958ad", "title": "Small and medium enterprise agro-processing firms supply chain performance: the role of owner-manager’s managerial competencies, information sharing and information quality"}, {"paperId": "87f98e53e734dbcd911c411e927a6f2ac2962fb9", "title": "The dynamics of cross-sector collaboration in disasters"}]}
