{"paperId": "4b575282429d1306a042a83c51741c74a90b99ea", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "Serverless Computing: State-of-the-Art, Challenges and Opportunities", "abstract": "Serverless computing is growing in popularity by virtue of its lightweight and simplicity of management. It achieves these merits by reducing the granularity of the computing unit to the function level. Specifically, serverless allows users to focus squarely on the function itself while leaving other cumbersome management and scheduling issues to the platform provider, who is responsible for striking a balance between high-performance scheduling and low resource cost. In this article, we conduct a comprehensive survey of serverless computing with a particular focus on its infrastructure characteristics. Whereby some existing challenges are identified, and the associated cutting-edge solutions are analyzed. With these results, we further investigate some typical open-source frameworks and study how they address the identified challenges. Given the great advantages of serverless computing, it is expected that its deployment would dominate future cloud platforms. As such, we also envision some promising research opportunities that need to be further explored in the future. We hope that our work in this article can inspire those researchers and practitioners who are engaged in related fields to appreciate serverless computing, thereby setting foot in this promising area and making great contributions to its development.", "venue": "IEEE Transactions on Services Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "1522-1539", "volume": "16"}, "authors": [{"authorId": "2110412190", "name": "Yongkang Li"}, {"authorId": "2149202574", "name": "Yanying Lin"}, {"authorId": "2155653850", "name": "Yang Wang"}, {"authorId": "2576616", "name": "Kejiang Ye"}, {"authorId": "144486540", "name": "Chengzhong Xu"}], "citations": [{"paperId": "b7462464d6929bffd35ff3d3ec2e933417951312", "title": "Cold Start Latency Mitigation Mechanisms in Serverless Computing: Taxonomy, Review, and Future Directions"}, {"paperId": "4a939ff65d0ca972819ae559c975d5f3ffeb46ef", "title": "Multi-Level ML Based Burst-Aware Autoscaling for SLO Assurance and Cost Efficiency"}, {"paperId": "9f71c0968322585d41aa1523f896eb6f62d2860e", "title": "QoS-aware offloading policies for serverless functions in the Cloud-to-Edge continuum"}, {"paperId": "da90d67c3f442ca4048858e79e39264bd222c765", "title": "Challenges and Solutions in Network Security for Serverless Computing"}, {"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "eabc7e31bca6c59236e1b5e2a4aec2cfbde2e58d", "title": "Prebaking runtime environments to improve the FaaS cold start latency"}, {"paperId": "c18836f89fdbb8f88bb58501964b2cd34ff9d1e8", "title": "Web Application-Based WebAssembly Container Platform for Extreme Edge Computing"}, {"paperId": "0ce891908c88656d81d769b605f7445de2b5e638", "title": "A Survey on IoT-Edge-Cloud Continuum Systems: Status, Challenges, Use Cases, and Open Issues"}, {"paperId": "aff5af689dbde1649269ef9563c114e13b2f8bd3", "title": "Serverless Computing To Predict Cold Start In Azure And Monitoring I/O Read And Write Using Machine Learning"}, {"paperId": "8049a85cb3db9a091c730798f454a0ccea55b752", "title": "Cold Start Latency in Serverless Computing: A Systematic Review, Taxonomy, and Future Directions"}, {"paperId": "f8422c4b1ce077d1d5d876b2058265aa1cd3dea4", "title": "Serverless Computing: Architectural Paradigms, Challenges, and Future Directions in Cloud Technology"}, {"paperId": "284478c2dca7226fdb62c8c980716c116ee5b244", "title": "Cross-Edge Orchestration of Serverless Functions with Probabilistic Caching"}, {"paperId": "4874ce1b54c1a618867735bd51cbddae0916cde7", "title": "Prospects on the adoption of a microservice-based architecture in 5G systems and beyond"}, {"paperId": "a8850db4d5c8a3c986b740a89681fa6fd7287886", "title": "FireFace: Leveraging Internal Function Features for Configuration of Functions on Serverless Edge Platforms"}, {"paperId": "85e102d461573cafa43753a84a55fcf51acfc991", "title": "FaaSDeliver: Cost-Efficient and QoS-Aware Function Delivery in Computing Continuum"}, {"paperId": "277fc060ecdc440e4def815716af2b954b727ff1", "title": "Resource Management in Serverless Computing - Review, Research Challenges, and Prospects"}, {"paperId": "335321464a4857e01681e2d1d8ef46882a251d15", "title": "EDGELESS Project: On the Road to Serverless Edge AI"}, {"paperId": "ab7d81297c82394bdeeee4618403bbbe6a19cd61", "title": "Cost-Sensitive Cold Start Latency Optimization Mechanism in Function-as-a-Service"}, {"paperId": "ce2ef71fce2226bd0c9b85982d4908f4b2c1f516", "title": "Automation of FaaS Serverless Frameworks OpenFaaS and OpenWhisk in Private Cloud"}, {"paperId": "386088bfb2bf96aff5fa372eb462e3cd1d79f185", "title": "Cloud Computing and its Emerging Trends on Big Data Analytics"}, {"paperId": "28317f0b7c644d3497f316dcacb9cb9f97160acf", "title": "SuperFlow: Performance Testing for Serverless Computing"}, {"paperId": "a87fd9c3e47500e152dd747d9ed7b01236e985cf", "title": "Design and Development of Smart Security Key for Knowledge based Authentication"}, {"paperId": "521a1e6ae144c2cdf94a261f68727ce82d0aa0b8", "title": "Revisiting the Performance of Serverless Computing: An Analysis of Variance"}, {"paperId": "fb6242b95e1fd070d3b4e1ebde9f1800bcff1213", "title": "Disease Prediction using Chest X-ray Images in Serverless Data pipeline Framework"}, {"paperId": "bb1f059f7906fcd0f178ad6a5860243f6741e127", "title": "A Survey and Implementation on Using A Runtime Overhead To Enable Serverless Deployment"}, {"paperId": "d8dcef784ba81f098a98b2f63358c637d3436e26", "title": "A heuristic-based package-aware function scheduling approach for creating a trade-off between cold start time and cost in FaaS computing environments"}, {"paperId": "ddc747c615cf88a965ef42ecd6fec8a7a82a241f", "title": "GraphGRU: A Graph Neural Network Model for Resource Prediction in Microservice Cluster"}, {"paperId": "d63baa74406645eb0e091f0cba1930c6823ea07e", "title": "Serverless Computing Platforms Performance and Scalability Implementation Analysis"}, {"paperId": "7909f97324e25ff1dc517835e4f0b3af280fb629", "title": "System-level Implications of Serverless: Workload Characterizing and Performance Understanding"}, {"paperId": "05beac85d2f46840a821a59b4e32af2174d39253", "title": "ESBench: Understanding Deep Learning Inference Overheads for Edge Serverless"}, {"paperId": "7228e4564d3a50bc26b16b34373c410ea0ac0d32", "title": "Cost Control and Efficiency Optimization in Maintainability Implementation of Wireless Sensor Networks based on Serverless Computing"}, {"paperId": "e5617de21e517ac5b6dcb1b041710dbd2c755ffc", "title": "Rise of the Planet of Serverless Computing: A Systematic Review"}, {"paperId": "557c67a636444957bd2758060a0acab0a245c59f", "title": "SMSE: A serverless platform for multimedia cloud systems"}, {"paperId": "0697791b674f77ec094d7f56786e078229dc3454", "title": "Efficiency in the serverless cloud paradigm: A survey on the reusing and approximation aspects"}, {"paperId": "da35c32055065264dc6fdf0d9cb12dcc81e64ae8", "title": "Intent-driven orchestration of serverless applications in the computing continuum"}, {"paperId": "28fb3031953ad38147ac38af5d75661cf70f5545", "title": "Load balancing for heterogeneous serverless edge computing: A performance-driven and empirical approach"}, {"paperId": "3aa0fe9d05af104ec56dd0edc09d716919f7275a", "title": "A Literature Review on Serverless Computing"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}]}
