{"paperId": "4b6fb4dd1977c145121ff9c2dc5ccfedf1b4887f", "publicationVenue": {"id": "cb6bf908-73f5-4b2c-bb93-0412207b00e7", "name": "Oceans", "type": "conference", "alternate_names": ["OCEANS Conference", "OCEANS", "Europe Oceans", "OCEAN Conf", "Eur Ocean"], "issn": "0029-8174", "alternate_issns": ["0197-7385", "2673-1924"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000515", "alternate_urls": ["https://www.mdpi.com/journal/oceans"]}, "title": "Towards data-driven identification and analysis of propeller ventilation", "abstract": "Propeller ventilation is one of the main reasons for the widespread mechanical failures of thrusters, with costly repairs and increased vessel down-time. Most of existing ventilation detection methods have been designed based on the dynamics/control modelling of water and the propeller, and they generally require information or accurate estimates of vessel specific parameters. The main challenges for such methods are 1) the dynamics models have become increasing complicated, especially in more demanding waters; 2) the vessel specific parameters are often not available in practice. In this paper, we propose that visual analytics, combining automated analysis algorithms with interactive data visualisation, aided by the knowledge of dynamics/control models, can address these challenges and help deepening our understanding of the complex behaviours of vessels and the ocean. We then propose ventilation detection methods which require no a priori information about the subject vessel or the propellers, which enables our further development of automatic parameter refinement and interactive visual detection/exploration of vessel behaviour as next steps. This work is an important part of our initial efforts towards our visual analytics framework for maritime operations.", "venue": "Oceans", "year": 2016, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2016-04-10", "journal": {"name": "OCEANS 2016 - Shanghai", "pages": "1-6"}, "authors": [{"authorId": "2144223245", "name": "Hao Wang"}, {"authorId": "30735990", "name": "Sindre Fossen"}, {"authorId": "2064565144", "name": "Fang Han"}, {"authorId": "2754221", "name": "I. Hameed"}, {"authorId": "47949127", "name": "Guoyuan Li"}], "citations": [{"paperId": "029c482c3c05a4e5f3db27ac4642e9f4d285485c", "title": "Improved Control of Propeller Ventilation Based on POA-XGBoost and Ship Dynamics/Control Model"}, {"paperId": "d964e4405ef5fe45c12a29d6a4dc0d759553a6d2", "title": "Improved control of propeller ventilation using an evidence reasoning rule based Adaboost.M1 approach"}, {"paperId": "af3b8f446b7db459f33e3cb77864dd8b3bc84c3c", "title": "A data-driven method for optimal control of ship motions for safe crew transfer to offshore wind turbines"}, {"paperId": "3bc9bb1f2218dcbd15c3b7cdfcb43077a3f30779", "title": "Big data analytics for manufacturing internet of things: opportunities, challenges and enabling technologies"}, {"paperId": "2f76c734c88c0821d9888341f5c370dc0efdba62", "title": "A Data-Driven Sensitivity Analysis Approach for Dynamically Positioned Vessels"}, {"paperId": "aa464bc3e0b355f1baea72abb14179de149feb55", "title": "A Case Study of Hierarchical Clustering for Maritime Industry"}, {"paperId": "2aea78fcf25fe494e5a9f9f75c3480a59769ef95", "title": "Data dimension reduction for visual analytics: A case study of oil-in-water detection"}, {"paperId": "7e41af90607cfdd06ba9b9d66d2d1763d4d87975", "title": "Organizing data from industrial internet of things for maritime operations"}, {"paperId": "f0cdba2bc61c45b321bae74a0e79fcc026d77864", "title": "Data integration and visualisation for demanding marine operations"}, {"paperId": "6a869fea7f1b11ed13b56e37b317fa994d24e168", "title": "Evaluating the data visualization for demanding marine operations"}]}
