{"paperId": "4b78827302fa7c7491508b40277853a034815acf", "publicationVenue": {"id": "00125def-988a-4a8b-939a-181f31b4414c", "name": "Journal of Information and Telecommunication", "type": "journal", "alternate_names": ["J Inf Telecommun"], "issn": "2475-1839", "url": "http://www.tandfonline.com/TJIT"}, "title": "Traceability and ownership claim of data on big data marketplace using blockchain technology", "abstract": "ABSTRACT In the era of big data, modern data marketplaces have received much attention as they allow not only large enterprises but also individuals to trade their data. This new paradigm makes the data prone to various threats, including piracy, illegal reselling, tampering, illegal redistribution, ownership claiming, forgery, theft, misappropriation, etc. Although digital watermarking is a promising technique to address the above-mentioned challenges, the existing solutions in the literature are deemed to be incompetent in big data scenarios due to the following factors: V's of big data, involvement of multiple owners, incremental watermarking, large cover-size and limited watermark-capacity, non-interference, etc. In this paper, we propose a novel big data watermarking technique that leverages the power of blockchain technology and provides a transparent immutable audit trail for data movement in big data monetizing scenarios. In this context, we address all the crucial challenges mentioned above. We present a prototype implementation of the system as a proof of concept using Solidity on Ethereum platform, and we perform experimental evaluation to demonstrate its feasibility and effectiveness in terms of execution gas costs. To the best of our knowledge, this is the first proposal which deals with watermarking issues in the context of big data.", "venue": "Journal of Information and Telecommunication", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-29", "journal": {"name": "Journal of Information and Telecommunication", "pages": "35 - 61", "volume": "5"}, "authors": [{"authorId": "47073185", "name": "Swagatika Sahoo"}, {"authorId": "35474289", "name": "Raju Halder"}], "citations": [{"paperId": "8d7b8949d3e92e139269608787d05f5808ebdbeb", "title": "Blockchain integration in big data: Review, vision, and opportunities"}, {"paperId": "4a8c9c4db3e6264e1cec2a9ea551069d62ea5eda", "title": "A Survey of Blockchain-Based Schemes for Data Sharing and Exchange"}, {"paperId": "4048cc05a8241de9422feb048530ca76b47da352", "title": "A Regionalization Study of Market-Based Allocation of Data Factors in China"}, {"paperId": "bdeb7399126d09602d45a774e3e780f3cd0e6c9d", "title": "NFT-Based Data Marketplace with Digital Watermarking"}, {"paperId": "d5ef2a507d5af3d1116f0c3c1b1b509b74495949", "title": "BTDA: Two-factor dynamic identity authentication scheme for data trading based on alliance chain"}, {"paperId": "bfc4d4d5fb71c1d970a2f89bfff4fed94c0ca327", "title": "Supply chain traceability using blockchain"}, {"paperId": "bcdfd6b685d061e4aa0a3f46d2f16c13e7a20a73", "title": "Decentralized Insurance Subrogation Using Blockchain"}, {"paperId": "c234da45f6b766b7ac0e9719a4349bc27f7672cd", "title": "The Application of Big Data Based Statistical Technology to Improve the User Experience of Products"}, {"paperId": "683322e6e1f8f5fc772bd678dddf13d2a857fe40", "title": "Application of Big Data Technology in Rail Transit Vehicle Manufacturing"}, {"paperId": "ce1d29b741f09254d2d253893e4b18f3714a7adc", "title": "Blockchain-Enabled Emergency Detection and Response in Mobile Healthcare System"}, {"paperId": "5b33e2b2f783496511a604fed386f7ce2b608a7b", "title": "TrailChain: Traceability of data ownership across blockchain-enabled multiple marketplaces"}, {"paperId": "8429ef285d941dc850c0d8715dae78154cb5756c", "title": "Research on Building Police Intelligent Patrol Command and Dispatch System under Big Data Technology"}, {"paperId": "5c4c1b59e5368675757e4dbe3016e811da8fd9e8", "title": "Data Market Design: A Systematic Literature Review"}, {"paperId": "a5538ee1b7dab5ead5907004d2dec20ad2d7fb97", "title": "A Novel Database Watermarking Technique Using Blockchain as Trusted Third Party"}, {"paperId": "525734f9c498130463021a7dfeb013a548491ec8", "title": "Vector Map Encryption Algorithm Based on Double Random Position Permutation Strategy"}]}
