{"paperId": "4b8103fb126589e650850e86970ffe0e678c3661", "publicationVenue": {"id": "b36a6509-bfd0-4dc4-8ac0-cb39f0408dbc", "name": "KnE Social Sciences", "type": "journal", "alternate_names": ["Kne Soc Sci"], "issn": "2518-668X", "url": "http://www.knepublishing.com/index.php/Kne-Social"}, "title": "Cluster Analysis for Grouping Districts in Sidoarjo Regency Based on Education Indicators", "abstract": "The purpose of education is to develop self-ability, knowledge, skills, and habits that are passed down from one generation to the next and from educators to students through a teaching process to shape a personality physically and spiritually. It also serves as a benchmark of success for a region. Education indicators can be used as a measuring tool to analyze the quality of education in an area. The current study aimed to determine the level of education in the districts of the Sidoarjo Regency, Indonesia. In this study, the sub-districts of the Sidoarjo Regency were grouped based on the education indicators using cluster analysis. Cluster analysis is a multivariate analysis that groups objects into different categories. Based on the results, two clusters were formed. Of the 18 districts in Sidoarjo Regency, the first cluster comprised of 14 districts (Prambon, Tulangan, Krembung, Tarik, Wonoayu, Gedangan, Porong, Buduran, Candi, Sukodono, Tanggulangin, Sedati, Jabon, Balongbendo), while the second included 4 (Sidoarjo, Waru, Taman, Krian). The results showed higher education indicators in the second cluster. Therefore, the researchers recommend using the results of this study as a reference for developing an equal distribution of education in the Sidoarjo Regency. \nKeywords: education indicators, cluster analysis, Sidoarjo districts", "venue": "KnE Social Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-20", "journal": {"name": "KnE Social Sciences"}, "authors": [{"authorId": "102315669", "name": "C. C. Astuti"}, {"authorId": "2088181323", "name": "Vanda Rezania"}], "citations": [{"paperId": "c65d1be34e7586841b8454b99ef6df51f29460b1", "title": "Comparison Analysis of Clustering Methods for Clustering of Indonesian’s Gender Empowerment Conditions in 2022"}]}
