{"paperId": "4b830ff6272f41cfe20426e4a32b58ebc55b9185", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Explainable Patterns for Distinction and Prediction of Moral Judgement on Reddit", "abstract": "The forum r/AmITheAsshole in Reddit hosts discussion on moral issues based on concrete narratives presented by users. Existing analysis of the forum focuses on its comments, and does not make the underlying data publicly available. In this paper we build a new dataset of comments and also investigate the classification of the posts in the forum. Further, we identify textual patterns associated with the provocation of moral judgement by posts, with the expression of moral stance in comments, and with the decisions of trained classifiers of posts and comments.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-26", "journal": {"name": "ArXiv", "volume": "abs/2201.11155"}, "authors": [{"authorId": "2151244291", "name": "Ion Stagkos Efstathiadis"}, {"authorId": "1411262410", "name": "Guilherme Paulino-Passos"}, {"authorId": "49973505", "name": "Francesca Toni"}], "citations": [{"paperId": "5c51513d331128ed957ee57c3fa87ac4d4ab0852", "title": "Interpretation modeling: Social grounding of sentences by reasoning over their implicit moral judgments"}, {"paperId": "6475cc4052e4778f6fb098ea9993018f545b6bf9", "title": "Measuring the Rise and Fall of a Subreddit using Text Analytics: The Life Course of r/Antiwork"}, {"paperId": "4d76ffc2c393a2ff902070b8e31436bf06160c46", "title": "Values, Ethics, Morals? On the Use of Moral Concepts in NLP Research"}, {"paperId": "350cec1b8f7c7134f9833a8835bd8f29eb619afc", "title": "Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community"}, {"paperId": "2bd3a8ff987fba0368291dc72fa7738ca0299782", "title": "Unifying Data Perspectivism and Personalization: An Application to Social Norms"}, {"paperId": "84acb81a44641455dfcaedbde619be3498cb6675", "title": "Understanding Interpersonal Conflict Types and their Impact on Perception Classification"}, {"paperId": "b8c8cf0f81cd9483b9f07e98386aa3bd1b518006", "title": "GrASP: A Library for Extracting and Exploring Human-Interpretable Textual Patterns"}]}
