{"paperId": "4b97b99832a325d96aeb169c392237506ad47786", "publicationVenue": null, "title": "Enabling and Emerging Sensing Technologies for Crowd Avoidance in Public Transportation: A Review", "abstract": "Avoidance of crowding situations in public transportation (PT) systems is crucial to foster sustainable mobility, by increasing the user’s comfort and satisfaction during normal operation, as well as to manage emergency situations, such as pandemic crises as recently experienced with COVID-19 limitations. This paper presents a comprehensive review of several crowd detection techniques based on Internet of Things (IoT) technologies, which can be adopted to avoid crowding in various segments of the PT system (buses/trams/trains, railway/subway stations, and bus stops). To discuss such techniques in a clear systematic perspective, we introduce a reference framework called SALUTARY (Safe and Reliable Public Transportation System), which in our vision employs modern information and communication technologies (ICT) in order to: (i) monitor and predict crowding events; (ii) adapt in real-time PT system operations, i.e., by modifying service frequency, timetables, routes, and so on; (iii) inform the users of crowding events by electronic displays installed in correspondence of the bus stops/stations and/or by mobile transport applications. It is envisioned that the new anti-crowding functionalities can be incrementally implemented as an addon to the intelligent transportation system (ITS) platform, which is already in use by major PT companies operating in urban areas. Moreover, it is argued that in this new framework, additional services can be delivered, such as, e.g., online ticketing, vehicle access control and reservation in severely crowded situations, and evolved crowd-aware route planning.", "venue": "", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-10-20", "journal": null, "authors": [{"authorId": "1701049", "name": "D. Darsena"}, {"authorId": "1704217", "name": "G. Gelli"}, {"authorId": "9212556", "name": "I. Iudice"}, {"authorId": "145308326", "name": "F. Verde"}], "citations": [{"paperId": "a1393dc40c28f86afe96dcc7531a442507685533", "title": "Enabling and Emerging Sensing Technologies for Crowd Management in Public Transportation Systems: A Review"}]}
