{"paperId": "4bb82722fac9b26d44c16d475f1da524b5df3059", "publicationVenue": {"id": "bfa6e440-6762-47f0-b1b9-2a43c02d9f62", "name": "ACM Cloud and Autonomic Computing Conference", "type": "conference", "alternate_names": ["ACM Cloud Auton Comput Conf", "Chinese Automation Congress", "Chin Autom Congr", "CAC"]}, "title": "Monitoring method for abnormal conditions of cement pre-decomposition based on PCA and MA-OCSVM algorithm", "abstract": "The stable operation of the rotary kiln system is affected by the operation state of cement pre-decomposition. So it is important to accurately monitor the operation state of cement pre-decomposition. In this paper, Principal Component Analysis (PCA) and the One Class Support Vector Machine algorithm optimized by Mayfly Algorithm (MA-OCSVM) are proposed to monitor cement clinker pre-decomposition conditions. Firstly, the PCA algorithm is used to reduce the feature dimension of historical production data. Then a monitoring model of cement pre-decomposition conditions based on OCSVM is established, and the key parameters are optimized by MA method. When new operating data appears, it can be monitored by bringing it into the trained OCSVM model. Finally, 400 sets of online running data are selected to verify the method in this paper. The results show that the monitoring method of cement pre-decomposition condition based on PCA and MA-OCSVM algorithm has high monitoring effect. It provides a feasible method for monitoring the operation state of cement clinker pre-decomposition.", "venue": "ACM Cloud and Autonomic Computing Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-25", "journal": {"name": "2022 China Automation Congress (CAC)", "pages": "5558-5563"}, "authors": [{"authorId": "2124489061", "name": "Zongxian Ma"}, {"authorId": "49377899", "name": "Huijun Dong"}, {"authorId": "2650730", "name": "Shizeng Lu"}, {"authorId": "2219966786", "name": "Hongliang Yu"}, {"authorId": "1838157", "name": "Fanjun Li"}], "citations": []}
