{"paperId": "4bbdd8755ed8ea333061e4826694e3fe92aa0eba", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Using Machine Learning Methods to Provision Virtual Sensors in Sensor-Cloud", "abstract": "The advent of sensor-cloud technology alleviates the limitations of traditional wireless sensor networks (WSNs) in terms of energy, storage, and computing, which has tremendous potential in various agricultural internet of things (IoT) applications. In the sensor-cloud environment, virtual sensor provisioning is an essential task. It chooses physical sensors to create virtual sensors in response to the users’ requests. Considering the capricious meteorological environment of the outdoors, this paper presents an measurements similarity-based virtual-sensor provisioning scheme by taking advantage of machine learning in data analysis. First, to distinguish the changing trends, we classified all the physical sensors into several categories using historical data. Then, the k-means clustering algorithm was exploited for each class to cluster the physical sensors with high similarity. Finally, one representative physical sensor from each cluster was selected to create the corresponding virtual sensors. The experimental results show the reformation of our scheme with respect to energy efficiency, network lifetime, and data accuracy compared with the benchmark schemes.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "2112128703", "name": "Mingzheng Zhang"}, {"authorId": "39060745", "name": "Liang-min Wang"}, {"authorId": "2207233", "name": "Shuming Xiong"}], "citations": [{"paperId": "b80ac28c4cc08395bfe9318ca17c722a9db8e321", "title": "Machine learning models applied to estimate the water temperature of rivers and reservoirs"}, {"paperId": "b93cc50223122adfe8cf49801e60fcb219dc1457", "title": "Virtual Sensors Method and Architecture for a Smart Home Environment with Random Forest"}, {"paperId": "edccb3b9d2c5a77ccad0f01c9f28fdf1af1c1382", "title": "Measuring material temperature in high-temperature microwave-based heating process: a virtual sensor approach"}, {"paperId": "edeebfe3ce4ceaa49f2df56cfb9cfcd216cb4d37", "title": "More than two decades of research on IoT in agriculture: a systematic literature review"}, {"paperId": "867f12c370c49e1eae89e6e725f8d95b0e27422b", "title": "Package Proposal for Data Pre-Processing for Machine Learning Applied to Precision Irrigation"}, {"paperId": "8d3ce7e2e774e5c51d6ee175ccacb7485f882823", "title": "Reinforcement Learning-based Virtual Sensors Provision in Internet of Vehicles (IoV)"}, {"paperId": "52cacb98e5957571c7836402f70d093f3d43643a", "title": "Data reconstruction applications for IoT air pollution sensor networks using graph signal processing"}, {"paperId": "18e279b715155814955d5cd5a1dbafc3c2bad248", "title": "Intelligent admission control manager for fog‐integrated cloud: A hybrid machine learning approach"}, {"paperId": "6f7d8deeaf4f296311656881e26b8d040fe0eda3", "title": "Using Smart Virtual-Sensor Nodes to Improve the Robustness of Indoor Localization Systems"}, {"paperId": "167b501bd99d8a769ec510a3e46d369c9ca00657", "title": "A brief review on integration between wireless sensor networks and Cloud"}, {"paperId": "0acd26af1ec3eb62787298772a61a042d3133fbb", "title": "Evaluation of cloud vendors from probabilistic linguistic information with unknown/partial weight values"}, {"paperId": "9fa3a0f33e3fb5512737f8dbea2a50d06a03829d", "title": "IoT adoption in agriculture: a systematic review"}, {"paperId": "ddd694a2154d701c198ca20eaff790ca14281d4c", "title": "Prediction of massive transfusions in neurosurgical operations using machine learning"}, {"paperId": "22b5839415e44fcb10481e68876949c6e8a82fa8", "title": "val-Indoor Localization Method of Mobile Educational Robot Based on Visual Sensor"}]}
