{"paperId": "4bd4cef1c0cc6a869e086f2984823ccbff27dc1d", "publicationVenue": {"id": "36345509-1ef5-40ea-8193-7b39cb132760", "name": "International Conference on Information Integration and Web-based Applications & Services", "type": "conference", "alternate_names": ["Int Conf Inf Integr Web-based Appl  Serv", "Information Integration and Web-based Applications & Services", "iiWAS", "Inf Integr Web-based Appl  Serv"]}, "title": "A new knowledge capitalization framework in big data context", "abstract": "In many companies data is used as a source for creating knowledge in their sphere of business. Therefore this paper presents a knowledge capitalization framework in big data context. Based on the technology derived from distributed systems, our research concerns the design and development of a knowledge engineering framework in big data context. It can be integrated in any knowledge management system. The proposed framework is based on four layers: we start by extracting hidden topics, using the LDA approach in batch processing to handle the complexity of multi knowledge domains and to keep the semantic relations between knowledge entities. Then we use clustering mechanisms to pick the best combination between topics from different sources. As a result, we get, in every distributed site, the related topics (knowledge), in order to facilitate the research and access, to get the useful knowledge in real time processing.", "venue": "International Conference on Information Integration and Web-based Applications & Services", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-12-04", "journal": {"name": "Proceedings of the 19th International Conference on Information Integration and Web-based Applications & Services"}, "authors": [{"authorId": "32178139", "name": "Badr Hirchoua"}, {"authorId": "1819670", "name": "B. Ouhbi"}, {"authorId": "2040835", "name": "B. Frikh"}], "citations": [{"paperId": "7f75b6bc1d990aebcc6ae87eb06746fb6d6b8038", "title": "Topic Modeling for Short Texts: A Novel Modeling Method"}, {"paperId": "17ad2595a9d54f36303251f186d867704b4f000a", "title": "A New Knowledge Capitalization Framework in the Big Data Context Through Shared Parameters Experiences"}]}
