{"paperId": "4bd927570edc775c0ed38496491549a7bab0b68e", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Waterwheel: Realtime Indexing and Temporal Range Query Processing over Massive Data Streams", "abstract": "Massive data streams from sensors in Internet of Things (IoT) and smart devices with Global Positioning System (GPS) are now flooding to database systems for further processing and analysis. The capability of real-time retrieval from both fresh and historical data turns out to be the key enabler to the real world applications in smart manufacturing and smart city utilizing these data streams. In this paper, we present a simple and effective distributed solution to achieve millions of tuple insertions per second and ad-hoc temporal range query processing in milliseconds. To this end, we propose a new data partitioning scheme that takes advantage of the workload characteristics and avoids expensive global data merging. Furthermore, to resolve the throughput bottleneck, we adopt a template-based index method to skip unnecessary index structure adjustments over the relatively stable distribution of incoming tuples. To parallelize data insertion and query processing, we propose an efficient dispatching mechanism and effective load balancing strategies to fully utilize computational resources in a workload-aware manner. On both synthetic and real workloads, our solution consistently outperforms state-of-the-art open-source systems by at least an order of magnitude.", "venue": "IEEE International Conference on Data Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-04-01", "journal": {"name": "2018 IEEE 34th International Conference on Data Engineering (ICDE)", "pages": "269-280"}, "authors": [{"authorId": "2152719157", "name": "Li Wang"}, {"authorId": "1856374", "name": "Ruichu Cai"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "1790604", "name": "Jiong He"}, {"authorId": "46951087", "name": "Zijie Lu"}, {"authorId": "145136558", "name": "M. Winslett"}, {"authorId": "2109512262", "name": "Zhenjie Zhang"}], "citations": [{"paperId": "802d3e14248c0ccb2e480529b27f2be275325d2f", "title": "Real Estate Query Algorithm Based on User Preference"}, {"paperId": "55066eaddcba2f0a01256c54c3a28128e7c53ebf", "title": "Dragoon: a hybrid and efficient big trajectory management system for offline and online analytics"}, {"paperId": "ce9abaf2fe9b478927d590d0d2f9e2a3f90d0c63", "title": "Efficient generation of spatiotemporal relationships from spatial data streams and static data"}, {"paperId": "c4d3bba752b4b15c05b3d71a9de2a73fe94ec8a2", "title": "Scheduling Resources to Multiple Pipelines of One Query in a Main Memory Database Cluster"}, {"paperId": "8ece8bee7ad1f910c8d2cf6a76c63e25235b20c5", "title": "EdgeDB: An Efficient Time-Series Database for Edge Computing"}, {"paperId": "e639762852d31f57697e1f96aef60cc3587a58b1", "title": "Elasticutor: Rapid Elasticity for Realtime Stateful Stream Processing"}]}
