{"paperId": "4beb82d89cb31428cdd2a5d7455493e70664c1f3", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Air-to-Air Collaborative Learning: A Multi-Task Orchestration in Federated Aerial Computing", "abstract": "Recent research on edge computing (EC) has proposed federated or collaborative learning technique, where machine learning models are shared among participating edge deployments, thereby benefiting from all available datasets without exchanging them. In addition, EC systems are currently exploiting attaching portable edge devices on drones for data processing close to the sources, to achieve high performance, fast response times and real-time insights. Existing researches lack the potential to federate edge resources and manage corresponding service entities running across multiple drones, thus resulting to sub-optimal performance. Therefore, we introduce Aerial Edge, a federated learning-based orchestration framework for a federated aerial EC system. We propose a federated multi-output linear regression model to estimate multi-task resource requirements and execution time, to select the closest drone deployment having congruent resource availability and flight time to execute ready tasks at any given time. For better utilization of resources, we propose a variant bin-packing optimization approach through gang-scheduling of multi-dependent containerized tasks that co-schedules and co-locates tasks tightly on nodes to fully utilize available resources. Extensive experiments on real-world data-trace from Alibaba cluster trace with information on task dependencies show the effectiveness, fast executions, and resource efficiency of our approach.", "venue": "IEEE International Conference on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 IEEE 14th International Conference on Cloud Computing (CLOUD)", "pages": "671-680"}, "authors": [{"authorId": "2949956", "name": "Uchechukwu Awada"}, {"authorId": "30392575", "name": "Jiankang Zhang"}, {"authorId": "2145397190", "name": "Sheng Chen"}, {"authorId": "3227092", "name": "Shuangzhi Li"}], "citations": [{"paperId": "69fe63781479a70ccd52d5f5680d2a51206aba33", "title": "Resource-aware multi-task offloading and dependency-aware scheduling for integrated edge-enabled IoV"}, {"paperId": "dbad5700ae29a7edda960dba32df92a144a74948", "title": "Edgedrones: Co-Scheduling of Drones for Multi-Location Aerial Computing Missions"}, {"paperId": "d66c147ee2f1f003f0e5b3fdba3c260e8a8b43d4", "title": "Computing in the Sky: A Survey on Intelligent Ubiquitous Computing for UAV-Assisted 6G Networks and Industry 4.0/5.0"}, {"paperId": "6bb44076e30f317d2cc996ce8720130b94bdb725", "title": "Federated Reinforcement Learning-Based UAV Swarm System for Aerial Remote Sensing"}]}
