{"paperId": "4bec31c8e848f5a3d27ab93eaeddb410afdb15ed", "publicationVenue": {"id": "79c5a18d-0295-432c-aaa5-961d73de6d88", "name": "IEEE Transactions on Neural Networks and Learning Systems", "alternate_names": ["IEEE Trans Neural Netw Learn Syst"], "issn": "2162-237X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5962385", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385"]}, "title": "Federated Noisy Client Learning", "abstract": "Federated learning (FL) collaboratively trains a shared global model depending on multiple local clients, while keeping the training data decentralized to preserve data privacy. However, standard FL methods ignore the noisy client issue, which may harm the overall performance of the shared model. We first investigate the critical issue caused by noisy clients in FL and quantify the negative impact of the noisy clients in terms of the representations learned by different layers. We have the following two key observations: 1) the noisy clients can severely impact the convergence and performance of the global model in FL and 2) the noisy clients can induce greater bias in the deeper layers than the former layers of the global model. Based on the above observations, we propose federated noisy client learning (Fed-NCL), a framework that conducts robust FL with noisy clients. Specifically, Fed-NCL first identifies the noisy clients through well estimating the data quality and model divergence. Then robust layerwise aggregation is proposed to adaptively aggregate the local models of each client to deal with the data heterogeneity caused by the noisy clients. We further perform label correction on the noisy clients to improve the generalization of the global model. Experimental results on various datasets demonstrate that our algorithm boosts the performances of different state-of-the-art systems with noisy clients. Our code is available at https://github.com/TKH666/Fed-NCL.", "venue": "IEEE Transactions on Neural Networks and Learning Systems", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-24", "journal": {"name": "IEEE transactions on neural networks and learning systems", "volume": "PP"}, "authors": [{"authorId": "2156059058", "name": "Li Li"}, {"authorId": "1929093", "name": "H. Fu"}, {"authorId": "2087238859", "name": "Bo Han"}, {"authorId": "2153076221", "name": "Chengzhong Xu"}, {"authorId": "2067609498", "name": "Ling Shao"}], "citations": [{"paperId": "f8c9408815e9c310d3c99ee38a5444bea453398f", "title": "A Federated Learning Approach With Imperfect Labels in LoRa-Based Transportation Systems"}, {"paperId": "bd3e71a29bf2a2301e8d4363f70895856ab68c45", "title": "On the Impact of Label Noise in Federated Learning"}, {"paperId": "7532297aa99cdbffdd47fd4e4fbb7694d9a78b79", "title": "SplitFed resilience to packet loss: Where to split, that is the question"}, {"paperId": "199ab277095acb306a12c089ef04c130ce5c874d", "title": "FedNoisy: Federated Noisy Label Learning Benchmark"}, {"paperId": "8cf00db156d6f85918b4e8a47973150c59578d0e", "title": "Quantifying the Impact of Label Noise on Federated Learning"}, {"paperId": "4f79183b01d627e138b329dd1ed9ac876718430e", "title": "Suppressing Noise from Built Environment Datasets to Reduce Communication Rounds for Convergence of Federated Learning"}, {"paperId": "1ace65d958cd27ae9ad857c49d8caa9aa5740526", "title": "Robust Federated Learning with Noisy and Heterogeneous Clients"}, {"paperId": "01f0917e5cba606991b9f6f56ac3e584424c4036", "title": "FedNoiL: A Simple Two-Level Sampling Method for Federated Learning with Noisy Labels"}, {"paperId": "5355cdc42d60270dec1dc24f288e366deabc1afb", "title": "FedDC: Federated Learning with Non-IID Data via Local Drift Decoupling and Correction"}, {"paperId": "a5037d43bcd56eb46eafa0fedf2aa5b88eaa8c13", "title": "Measuring Data Quality for Dataset Selection in Offline Reinforcement Learning"}, {"paperId": "96da627ea304eb03fdb6ec16f3a872d11ebff846", "title": "Decentralized Learning in Healthcare: A Review of Emerging Techniques"}]}
