{"paperId": "4bf266fe2809db66cfb896bdb060302346d214be", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Digital Transformation in Healthcare: Technology Acceptance and Its Applications", "abstract": "Technological innovation has become an integral aspect of our daily life, such as wearable and information technology, virtual reality and the Internet of Things which have contributed to transforming healthcare business and operations. Patients will now have a broader range and more mindful healthcare choices and experience a new era of healthcare with a patient-centric culture. Digital transformation determines personal and institutional health care. This paper aims to analyse the changes taking place in the field of healthcare due to digital transformation. For this purpose, a systematic bibliographic review is performed, utilising Scopus, Science Direct and PubMed databases from 2008 to 2021. Our methodology is based on the approach by Wester and Watson, which classify the related articles based on a concept-centric method and an ad hoc classification system which identify the categories used to describe areas of literature. The search was made during August 2022 and identified 5847 papers, of which 321 fulfilled the inclusion criteria for further process. Finally, by removing and adding additional studies, we ended with 287 articles grouped into five themes: information technology in health, the educational impact of e-health, the acceptance of e-health, telemedicine and security issues.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "2003252686", "name": "Angelos I. Stoumpos"}, {"authorId": "2626369", "name": "F. Kitsios"}, {"authorId": "2969505", "name": "M. Talias"}], "citations": [{"paperId": "455fccab84679dc6559e8c0d8c49ca7ee7e2a144", "title": "Digital transformation research trends in Ukraine and the world: meta & bibliometric analysis"}, {"paperId": "45677ee4550ca54e39a94e3eefc32aeedc9e1bec", "title": "The relationship between digital transformation and digital literacy - an explanatory model: Systematic literature review"}, {"paperId": "bd414a40a76cdd71aaf2491224c485da2338c14e", "title": "Service innovation in public health: A case study of an Indonesian local government"}, {"paperId": "20b6640714680c6cd731478d1787db31602ed297", "title": "Perspective of Health Care Professionals and Cancer Survivors on the Usage of Technology in Consultations"}, {"paperId": "c77203cf77088ece7128bc595c872a913da405df", "title": "Digital transformation in healthcare: have we gone off the rails?"}, {"paperId": "c5399b565e926b600ea40496bb42586e4c1668b8", "title": "Relational Coordination at the Primary–Secondary Care Interface: Insights from a Cross-Sectional Survey in the South Tyrolean Healthcare System"}, {"paperId": "1a8585d979d814e90e5bfa6a72235a0fd6864681", "title": "Robot-assisted surgery and artificial intelligence-based tumour diagnostics: social preferences with a representative cross-sectional survey"}, {"paperId": "16e4e50a59f5d06ff8b643c2390cd63bced48673", "title": "Maximizing Artificial Intelligence for Patient Satisfaction: Marketing Strategies in The Digital Health Era"}, {"paperId": "826367bb7406476e8b2df5533d21f052b6132800", "title": "Review of the characteristics of mobile robots for health care application"}, {"paperId": "f19c6db8ec89917c3f54ccb76384a2037baa9521", "title": "Key Issues as Wearable Digital Health Technologies Enter Clinical Care."}, {"paperId": "9abe42208e09ee1a615dac5e237b1674ea2f3b61", "title": "Transformative Frontiers: A Comprehensive Review of Emerging Technologies in Modern Healthcare"}, {"paperId": "4009df5d7740cfe7beec50050e355da672198231", "title": "Empirical Nutrition Models and Their Impact on Public Health"}, {"paperId": "7abd826d57281e9f036448f9325ce89572f31cb8", "title": "Digital health and health equity: How digital health can address healthcare disparities and improve access to quality care in Africa"}, {"paperId": "b9797fb4f919b0617565beb634306503d54ba2b3", "title": "Enhancing Readmission Prediction with Deep Learning: Extracting Biomedical Concepts from Clinical Texts"}, {"paperId": "cbb19308e1d327db0c0fb565b4c664d1b9fd5b9d", "title": "The AWARE Framework: A Technology-Driven Approach to Creating a Safer Care Environment."}, {"paperId": "77895289aa8d6814105b1de838763d0781800086", "title": "Financial indicators utilization among community pharmacists: A comprehensive study for pharmacy management"}, {"paperId": "9968181d6fa142b830f9b0a657b86c44e676d5de", "title": "Terminology of e-Oral Health: Consensus Report of the IADR’s e-Oral Health Network Terminology Task Force"}, {"paperId": "359eb3523f48abf4b2e30e8a2588737a170281a7", "title": "Digital Anti-Aging Healthcare: An Overview of the Applications of Digital Technologies in Diet Management"}, {"paperId": "240d6455094419980ee599435cc41961085b36c3", "title": "Risk Management and Patient Safety in the Artificial Intelligence Era: A Systematic Review"}, {"paperId": "daf0642c3cc63c4fe571e7d8a2c7fd20371e796d", "title": "Telehealth Intervention: A Proposal for a Telemedicine Manual to Ascertain the Civil Disability Status in Italy"}, {"paperId": "642701ad00e964c7886907c1ed8fcfa3ba85d955", "title": "Enhancing the detection of airway disease by applying deep learning and explainable artificial intelligence"}, {"paperId": "a118396f3a27cd84d26f86180b21f395e5e50551", "title": "Effect of digital based nursing intervention on knowledge of self-care behaviors and self-efficacy of adult clients with diabetes"}, {"paperId": "f5c77a36495f7f47787e15e71dcea2277f73baac", "title": "Building digital patient pathways for the management and treatment of multiple sclerosis"}, {"paperId": "401618fe46970e69003e46d67263e0fba0a886dc", "title": "Understanding telemedicine adoption: evidence, gaps, and future perspectives for sustainable healthcare"}, {"paperId": "d706d32e2af4409c0f5a71db0cae810ea65ee843", "title": "Empowering the digital health workforce in Latin America in the context of the COVID-19 pandemic: the Peruvian case."}, {"paperId": "830c739e5420c561a244d4bda5ea64dd78bb7ce3", "title": "Clinical Informatics Team Members’ Perspectives on Health Information Technology Safety After Experiential Learning and Safety Process Development: Qualitative Descriptive Study"}, {"paperId": "8f223c66b86c0971587d12fa5d1c3bf4ca69df7f", "title": "AI in the ED: Assessing the efficacy of GPT models vs. physicians in medical score calculation."}, {"paperId": "773fec52bf5bda5333e8f1a1c3eee83d5e5690e5", "title": "Evaluating the Inclusiveness of Artificial Intelligence Software in Enhancing Project Management Efficiency – A review and examples of quantitative measurement methods"}, {"paperId": "96edf197349c0000781171b235efb764b42374d0", "title": "Analysis of Publications on Health Information Management Using the Science Mapping Method: A Holistic Perspective"}, {"paperId": "fe6a41de837540843fb7df5c13b33b521a72419a", "title": "Exploring the Role of Basic Sciences in Integrating Clinical Practice: A Cross-Sectional Study of Medical Education Approaches"}, {"paperId": "8c2b92b3cd0da1a2abc359f1ef6d50608b067097", "title": "Evaluating ChatGPT performance in Arabic dialects: A comparative study showing defects in responding to Jordanian and Tunisian general health prompts"}, {"paperId": "c5b578a150b9d7a91b5e50f90ba0f9e7acb4c402", "title": "User-Centric Evaluation of EHR Software through NLP-driven Investigation: Implications for Product Development and User Experience"}, {"paperId": "5afb646f3dd24f231062816694cb6c7e7f6dc60a", "title": "Barriers and facilitators of health professionals in adopting digital health-related tools for medication appropriateness: A systematic review"}, {"paperId": "d4cc3382f6b5a77c60d52c6171eec4e8e9b23c70", "title": "Digital Maturity as a Strategy for Advancing Patient Experience in US Hospitals"}, {"paperId": "dfc4d480c2536b040fe894ee6282ca884c85f132", "title": "DIGITAL DECISION-MAKING TOOLS IN THE FIELD OF PUBLIC ADMINISTRATION OF HEALTHCARE"}, {"paperId": "6b2389f0ba214cb57a015de94e51328bef63b022", "title": "Responsible leadership actions and achievement of societal purpose: Perspectives from the Kenyan health NGO sector"}, {"paperId": "42d71b2d802e3b2bef5a76171dc32be6ab5051b8", "title": "Revolutionizing Healthcare: the Pivotal Role of Digital Marketing in the Modern Healthcare Industry"}, {"paperId": "87684f717804876ec5f29b4b5c3aafc90b5459eb", "title": "Assessment of Information Technology in Electronic Medical Records Using the Concept Health Technology Assessment at X Jepara Hospital"}, {"paperId": "4dced488d4ddd2586991d5c6eeb0a764264b95fc", "title": "Healthcare Markets in The U.S. And China: Comparative Analysis of Development Models, Issues, And Prospects"}, {"paperId": "9bb60150a25b4706ff6d7dd2587b388f80c03f22", "title": "Security and Privacy Challenges Hindering the Adoption of E-Healthcare Systems"}, {"paperId": "3e25be63faa9b626097a7f9eefcebd6b9fbda001", "title": "Perception and Usage of Telemedicine Among National Health Insurance Participants in Padang City"}, {"paperId": "45e6179d8e618394e7646adfd0f70ce95fe49b0a", "title": "Strategic Medical Affairs Outsourcing: Pragmatic Solution In A Fast-Changing And Resource-Constrained World"}, {"paperId": "0adef8b3da8826ec474ac8b963daa096374d48ec", "title": "Advancing global health equity: the transformative potential of community-based surveillance in developing countries"}, {"paperId": "53b2947201588b709d432f5cd78354f5e14b451d", "title": "Acceptability and concerns about innovative wearable health sensors in persons with and without chronic disease diagnosis"}, {"paperId": "4fc41285d6474bd5a40250e96d77459d04a01fa9", "title": "Beyond Hypoglossal Hype: Social Media Perspectives on the Inspire Upper Airway Stimulation System"}, {"paperId": "7792c5e40104db45594db8d671e3d7684c191a25", "title": "Advancements in Understanding and Classifying Chronic Orofacial Pain: Key Insights from Biopsychosocial Models and International Classifications (ICHD-3, ICD-11, ICOP)"}, {"paperId": "1bb7b3cb19d155d2cd834b91be20b2f97c303fb3", "title": "Transforming Healthcare: The Revolutionary Benefits of Cashless Healthcare Services"}, {"paperId": "8441c0ae94804ea3c1082a7dead7139ca979dc1f", "title": "Emerging Digital Technologies in Healthcare with a Spotlight on Cybersecurity: A Narrative Review"}, {"paperId": "6a4c5c0a57a62d6530a1b5bb25f06fc900639bb1", "title": "Evaluating the Inclusiveness of Artificial Intelligence Software in Enhancing Project Management Efficiency - A Review"}, {"paperId": "9d25ebcbc9d984a45ef588e45fc30b99eef99dd4", "title": "A pediatric telecardiology system that facilitates integration between hospital-based services and community-based primary care"}, {"paperId": "9724e333a1c89d5ecc3d817ebc911a0bf3b15aaa", "title": "Human-Robot Collaboration for Healthcare: A Narrative Review"}, {"paperId": "e0365e59fd4173494d8f96c7f7c8a71bf289adff", "title": "Analysis of the perception of health professionals regarding the incorporation of emerging technologies in their practice"}, {"paperId": "9fcad115ce3cce0ec116d98f4f2a7145139215a7", "title": "Telehealth and Digital Technology: Challenges and Opportunities in Cancer Care"}, {"paperId": "1c9e5addcdb9721d4db1ce9da4c733dee785e808", "title": "U-WIN to Win at Immunisation"}, {"paperId": "325bcc3160050c8f27fe7b9065e82b44d65d738c", "title": "Biobanking: A Cornerstone of Biodigital Convergence."}, {"paperId": "0a3cb718e3e6b1699753c6d731b7e98cf0d63a9b", "title": "Improving Patient Outcomes Through Effective Hospital Administration: A Comprehensive Review"}, {"paperId": "57bef5d2b4c27b3ef080bc8a6379ecf328381f3c", "title": "Investigating the Joint Amplitude and Phase Imaging of Stained Samples in Automatic Diagnosis"}, {"paperId": "8aca41912c031f16d29a594e06ccbdec22f86147", "title": "﻿Digital health in Bulgaria: Imagination or possible reality?"}, {"paperId": "e12cd9283ce93855237d90e3d0ce61b6dae215d8", "title": "Privacy-Preserving and Hardware Acceleration-Based Authentication Scheme for Data Collection in E-Health Applications"}, {"paperId": "4a536e29346969a60e9d4e161c7b917444d31e4f", "title": "The Evolution of Digital Health Care: From Stethoscopes to Smart Phones"}, {"paperId": "14beaf2a847078d4cc8d95edcc4ce6ab27cdb66a", "title": "An integrated deep learning and natural language processing approach for continuous remote monitoring in digital health"}, {"paperId": "e57b5760a6a969c8cded2c6c77a1961728fb40dc", "title": "Experience of Health Care Professionals Using Digital Tools in the Hospital: Qualitative Systematic Review"}, {"paperId": "54d30b8974d2e721c52716577f2b342932ef3413", "title": "Person-Centeredness in Digital Primary Healthcare Services—A Scoping Review"}, {"paperId": "39428e22fd395007f139029758874d86810719ee", "title": "Improving the Quality of Services in Medical Clinics: a Case Study Based on Digital Transformation"}, {"paperId": "c1903c7cab8fc0e505a3fd96b25d00730b58b416", "title": "Innovative Development of the Health Care Sector of the Future in the Conditions of Modern Challenges of the Covid-19 Coronavirus Infection in Ukraine"}, {"paperId": "dc9d96df53830caafe083cf2ee534d363183791c", "title": "Integrating Basic Sciences and Clinical Practice: A Cross-Sectional Study of UQUMED’s Medical Education Approach"}]}
