{"paperId": "4c133053ad6e36095c0468f463fe21c194a169bb", "publicationVenue": null, "title": "Application Of K-Means Algorithm In Grouping Productive Seed Distribution Data In BPDASHL Asahan Barumun", "abstract": "Preserving the environment is a human effort that must be done immediately so that survival can be maintained properly. One of the human efforts in preserving the environment is planting and maintaining trees in the surrounding environment. Balai Pengelolaan Daerah Aliran Sungai dan Hutan Lindung (BPDASHL) Asahan Barumun has a Permanent Nursery that produces 19 types of productive seeds, where productive seeds have an ecological impact for reforestation and an economic impact to improve people's welfare. BPDASHL Asahan Barumun provides and distributes productive seeds to people who want to participate in preserving the environment. Before distributing productive seeds, the nursery staff of BPDASHL Asahan Barumun conducted data collection which was added to the distribution data for productive seeds to find out to whom and how many seeds were distributed. In the data on the distribution of productive seeds of the Asahan Barumun BPDASHL, it can be seen that almost every day the distribution of productive seeds to the community is carried out, so the addition of data to the distribution data is getting more and more. Data mining is able to process large data into information in the form of patterns that have meaning for decision support. By using K-Means algorithm in classifying the 2019/2020 BPDASHL Asahan Barumun distribution data by type, so that the final results obtained are 3 clusters where there are 6 seeds that are most in demand, including suren, jengkol, mahogany, avocado, durian, coffee, 10 seeds that are quite in demand, including pine, calliandra, macadamia, petai, sugar palm, cempedak, frankincense, mango, africa, trembesi, and 3 seeds that are less desirable, including meranti, jackfruit, macadamia nut.", "venue": "Journal of Artificial Intelligence and Engineering Applications (JAIEA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-15", "journal": {"name": "Journal of Artificial Intelligence and Engineering Applications (JAIEA)"}, "authors": [{"authorId": "2222978493", "name": "Dina Patresia Samuana Manurung"}, {"authorId": "2072241773", "name": "Muhammad Ridwan Lubis"}, {"authorId": "2085739671", "name": "Ika Okta Kirana"}, {"authorId": "48742405", "name": "Dedy Hartama"}, {"authorId": "2100568012", "name": "D. Suhendro"}], "citations": []}
