{"paperId": "4c28cfb6553724aee399af4d881fba721babde76", "publicationVenue": null, "title": "AutoGMM: Automatic and Hierarchical Gaussian Mixture Modeling in Python", "abstract": "Background: Gaussian mixture modeling is a fundamental tool in clustering, as well as discriminant analysis and semiparametric density estimation. However, estimating the optimal model for any given number of components is an NP-hard problem, and estimating the number of components is in some respects an even harder problem. Findings: In R, a popular package called mclust addresses both of these problems. However, Python has lacked such a package. We therefore introduce AutoGMM, a Python algorithm for automatic Gaussian mixture modeling, and its hierarchical version, HGMM. AutoGMM builds upon scikit-learn's AgglomerativeClustering and GaussianMixture classes, with certain modifications to make the results more stable. Empirically, on several different applications, AutoGMM performs approximately as well as mclust, and sometimes better. Conclusions: AutoMM, a freely available Python package, enables efficient Gaussian mixture modeling by automatically selecting the initialization, number of clusters and covariance constraints.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": null, "publicationDate": "2019-09-06", "journal": null, "authors": [{"authorId": "150317407", "name": "Thomas L. Athey"}, {"authorId": "8944581", "name": "Tingshan Liu"}, {"authorId": "107899997", "name": "B. Pedigo"}, {"authorId": "1717958", "name": "J. Vogelstein"}], "citations": [{"paperId": "9923976e83771349c58063a69e82ef61c347cd6a", "title": "CR1 variants contribute to FSGS susceptibility across multiple populations"}, {"paperId": "e2f1c9123b94646605fd50aa29378a00dfcfcf52", "title": "Insights into the properties of GRBs with TeV emission"}, {"paperId": "68fa1e15ce1470bfb84a568fae22a703909fa11f", "title": "StepMix: A Python Package for Pseudo-Likelihood Estimation of Generalized Mixture Models with External Variables"}, {"paperId": "0910cb7d82c4b4f0212b06ea14e1fe5637970289", "title": "The connectome of an insect brain"}, {"paperId": "46cbe6edecb08297afaab137e104650702896085", "title": "Empirical Investigation of Fundamental Diagrams in Mixed Traffic"}, {"paperId": "1ae600e7a24da0e6914efaaa75ff12e9d6e21208", "title": "Superclass-Conditional Gaussian Mixture Model For Learning Fine-Grained Embeddings"}]}
