{"paperId": "4c30abfca8a1ca694246ec760eb16732c93dee4f", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Electricity Pattern Analysis by Clustering Domestic Load Profiles Using Discrete Wavelet Transform", "abstract": "Energy demand has grown explosively in recent years, leading to increased attention of energy efficiency (EE) research. Demand response (DR) programs were designed to help power management entities meet energy balance and change end-user electricity usage. Advanced real-time meters (RTM) collect a large amount of fine-granular electric consumption data, which contain valuable information. Understanding the energy consumption patterns for different end users can support demand side management (DSM). This study proposed clustering algorithms to segment consumers and obtain the representative load patterns based on diurnal load profiles. First, the proposed method uses discrete wavelet transform (DWT) to extract features from daily electricity consumption data. Second, the extracted features are reconstructed using a statistical method, combined with Pearson’s correlation coefficient and principal component analysis (PCA) for dimensionality reduction. Lastly, three clustering algorithms are employed to segment daily load curves and select the most appropriate algorithm. We experimented our method on the Manhattan dataset and the results indicated that clustering algorithms, combined with discrete wavelet transform, improve the clustering performance. Additionally, we discussed the clustering result and load pattern analysis of the dataset with respect to the electricity pattern.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-13", "journal": {"name": "Energies"}, "authors": [{"authorId": "2154511477", "name": "Senfeng Cen"}, {"authorId": "2828858", "name": "Jae-Hung Yoo"}, {"authorId": "11141098", "name": "C. Lim"}], "citations": [{"paperId": "88c8da9a4fa29ea1ac8875d7b2e3d03bbc90fb49", "title": "Individual household load forecasting using bi-directional LSTM network with time-based embedding"}, {"paperId": "3506c88128520beb20267870d581074e5c0f8d79", "title": "Reinforcement Learning-Based Prediction of Alarm Significance in Marginally Operating Electrical Grids"}, {"paperId": "1c5340af5372d91163eb26e639af7d2614faa394", "title": "Methods and attributes for customer-centric dynamic electricity tariff design: A review"}, {"paperId": "1b013a2f16ce7e3f3567f96817234484affcdac0", "title": "DBSCAN-based energy users clustering for performance enhancement of deep learning model"}, {"paperId": "40e0783ed21514d85d07f22e1c16bdd0a3e84e9b", "title": "Day Ahead Demand Response Model with Algorithm-Based Consumption Classification and Tariff Planning"}, {"paperId": "51e66f908b4bfac831ff408f89a9a39253699107", "title": "Daily Load Profiles Clustering of Regional Distribution Grid 6-10 kV"}, {"paperId": "9901fd05193a319964771212afd522a376e372ee", "title": "Cross Domain Correlation Maximization for Enhancing the Target Recognition of SSVEP-Based Brain–Computer Interfaces"}, {"paperId": "b95500963e1e604a00858efa1f90e5e3365fb8fb", "title": "ANN-Based Reliability Enhancement of SMPS Aluminum Electrolytic Capacitors in Cold Environments"}, {"paperId": "ee4afbc4aefd7dc1dbcbee83e1d49fddbc29e05d", "title": "Analysis of residential electricity consumption patterns utilizing smart-meter data: Dubai as a case study"}, {"paperId": "c11b92536ff44abac3783121d13f66c4104a63f0", "title": "A Systematic Review of Building Electricity Use Profile Models"}, {"paperId": "b36abfd4db289a57463a785b6ca83f5d9774443f", "title": "A Novel Telecom Customer Churn Analysis System Based on RFM Model and Feature Importance Ranking"}]}
