{"paperId": "4c3e306ca196f3e45842530d9f76bd7d75e17386", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Anomaly Detection System using ML Classification Algorithm for Network Security", "abstract": "People are now able to communicate with anyone located in any part of the world because to the assistance of networks, and the Internet’s position as a worldwide platform for the sharing of information is only projected to expand in the future. During the course of the last couple of decades, anomaly detection systems have consequently evolved into an essential component of the security of networks. It is impossible for firewalls and other basic security measures to identify aberrant behaviour in a timely manner. Despite the availability of a number of preventative measures, the frequency of hazardous environmental events continues to be a major cause for concern. As a direct consequence of this, the attacks put the security of the network in a significant amount of jeopardy. Signature-based intrusion detection systems make up the vast majority of commercially available IDSs (intrusion detection systems) in today’s world. These IDSs are able to detect only threats that have been previously detected. Anomaly detection systems are a subset of intrusion detection systems, which are capable of identifying both known and unknown threats. Flaws in the system can be found and remedied if one monitors for abnormalities, such as an unusually high number of false alerts. Because of their ability to improve the effectiveness of detection systems, Machine Learning (ML) techniques are frequently utilised in the outlier identification process. In this section, we analyse the differences and similarities between the initial implementations of anomaly detection systems and their present equivalents. Anomaly detection is another method we examine here for getting to the bottom of fundamental issues. A evaluation of the network’s anomaly detection system found that there has been an uptick in the number of recent intrusions. It will be more difficult to put a stop to these attacks because the attackers consistently experiment with new strategies. This paper’s primary focus is on analysing prior efforts to find network security “anomalies,\" and its secondary focus is on offering direction to researchers who are new to the field. Following the presentation of our findings, we will discuss the top software offered by NADS.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1416-1422"}, "authors": [{"authorId": "2190705089", "name": "Ajay Reddy Yeruva"}, {"authorId": "9415856", "name": "Prateek Chaturvedi"}, {"authorId": "90832376", "name": "A. Rao"}, {"authorId": "2543746", "name": "S. Dimri"}, {"authorId": "2212164209", "name": "Chandra Shekar"}, {"authorId": "2164209143", "name": "Biruk Yirga"}], "citations": [{"paperId": "91482c08d99cb466035a762e139215969339f2b3", "title": "Lung Cancer Diagnosis Using Artificial Neural Network with Different Optimizers"}, {"paperId": "971861a966ce7266e5caa90521f21378f0e1ed2e", "title": "Crop Yield Prediction Through Artificial Neural Networks"}, {"paperId": "7495b1c39d7edce48dc787482fc080590558f723", "title": "Geographical Visitor Locator"}, {"paperId": "f0a195df57e44ff6b941db282f355af95c1381d1", "title": "Stock Market Prediction using different Machine Learning Algorithms"}, {"paperId": "68fb8a5129ac88fca1d28d4c9fa6d1c82d3bc7d1", "title": "BiLSTM Classifier: A New Approach for Detecting Cyber-Attacks in MITRE ATTACK Framework"}, {"paperId": "6c56ba35c4a94d083c655c7c8f6b2b89a17a9387", "title": "Sports Event Data Acquisition Method Based on Wireless Sensor Technology and BP Neural Networks"}, {"paperId": "69d13b051a7b1898a99886279ae11db1d5c381ed", "title": "Data Sharing Enabled Through Internet of Things (IoT) in Wireless Communication Networks"}, {"paperId": "3c119ab8131d337d5a6f81f31c41db5edad742a8", "title": "Examining Effectiveness of Cloudlets in Mobile Computing"}, {"paperId": "27593883252b3d04cb42b38d31a842f27de02cdc", "title": "Deep Reinforcement Learning for Resource Allocation in Edge Computing for IoT"}, {"paperId": "0cb22e9fa6c7c7be157d7badd554adb8ee4d9fc1", "title": "Transforming Healthcare through AI: Unleashing the Power of Personalized Medicine"}, {"paperId": "a4eac6393455be79c11704108102eb221c36f426", "title": "The Future of Medicine: Harnessing the Power of AI for Revolutionizing Healthcare"}]}
