{"paperId": "4c565890c7bb0cd0b852dd62237fa8ae6a49242c", "publicationVenue": {"id": "801703f5-a310-442a-a58a-41bb05ae1f68", "name": "International Conference on Wirtschaftsinformatik", "type": "conference", "alternate_names": ["WI", "Int Conf Wirtsch", "Web Intell", "IEEE/WIC/ACM Int Conf Web Intell", "IEEE/WIC/ACM International Conference on Web Intelligence", "Web Intelligence"], "url": "https://aisel.aisnet.org/wi/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=3061"]}, "title": "Survey on data replication in cloud systems", "abstract": "In a distributed environment, replication is the most investigated phenomenon. Replication is a way of storing numerous copies of the same data at different locations. Whenever data is needed, it will be fetched from the nearest accessible copy, avoiding delays and improving system performance. To manage the replica placement strategy in the Cloud, three key challenges must be addressed. The challenges in determining the best time to make replicas were generated, the kind of files to replicate, as well as the best location to store the replicas. This survey conducts a review of 65 articles published on data replication in the cloud. The literature review examines a series of research publications and offers a detailed analysis. The analysis begins by presenting several replication strategies in the reviewing articles. Analysis of each contributor’s performance measures is conducted. Moreover, this survey offers a comprehensive examination of data auditing systems. This work also determines the analytical evaluation of replication handling in the cloud. Furthermore, the evaluation tools used in the papers are examined. Furthermore, the survey describes a lot of research issues & limitations that might help researchers support better future work on pattern mining for data replication in the cloud.", "venue": "International Conference on Wirtschaftsinformatik", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-10", "journal": {"name": "Web Intelligence"}, "authors": [{"authorId": "2199704460", "name": "Rambabu D"}, {"authorId": "2280571334", "name": "Govardhan A"}], "citations": []}
