{"paperId": "4c7c471a124ba8e16ca8d1aeae66dffa52167c11", "publicationVenue": null, "title": "Do Platform Migrations Compromise Content Moderation? Evidence from r/The_Donald and r/Incels", "abstract": "When toxic online communities on mainstream platforms face moderation measures, such as bans, they may migrate to other platforms with laxer policies or set up their own dedicated websites. Previous work suggests that within mainstream platforms, community-level moderation is effective in mitigating the harm caused by the moderated communities. It is, however, unclear whether these results also hold when considering the broader Web ecosystem. Do toxic communities continue to grow in terms of their user base and activity on the new platforms? Do their members become more toxic and ideologically radicalized? In this paper, we report the results of a large-scale observational study of how problematic online communities progress following community-level moderation measures. We analyze data from r/The_Donald and r/Incels, two communities that were banned from Reddit and subsequently migrated to their own standalone websites. Our results suggest that, in both cases, moderation measures significantly decreased posting activity on the new platform, reducing the number of posts, active users, and newcomers. In spite of that, users in one of the studied communities (r/The_Donald) showed increases in signals associated with toxicity and radicalization, which justifies concerns that the reduction in activity may come at the expense of a more toxic and radical community. Overall, our results paint a nuanced portrait of the consequences of community-level moderation and can inform their design and deployment.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-20", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 24", "volume": "5"}, "authors": [{"authorId": "35700028", "name": "Manoel Horta Ribeiro"}, {"authorId": "3362498", "name": "Shagun Jhaver"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "1728207", "name": "Emiliano De Cristofaro"}, {"authorId": "2350947", "name": "G. Stringhini"}, {"authorId": "145781376", "name": "Robert West"}], "citations": [{"paperId": "2b52a59e57fc6709fef4ad82f2300514f0c87bcf", "title": "The Effects of Group Sanctions on Participation and Toxicity: Quasi-experimental Evidence from the Fediverse"}, {"paperId": "d621103dc9dfbb6eae26e34066d9120a3cec831e", "title": "Misinformation Regulation in the Presence of Competition between Social Media Platforms (Extended Version)"}, {"paperId": "7725b46537e22b6fed3091ee4ce5e7b5f616bc7f", "title": "Perceptions of Moderators as a Large-Scale Measure of Online Community Governance"}, {"paperId": "b30e47b6459502227c74a9b41304e5ce10aed6fe", "title": "Intellectual dark web, alt-lite and alt-right: Are they really that different? a multi-perspective analysis of the textual content produced by contrarians"}, {"paperId": "123f4be54fd244ccfce7fe7318674ce7dd9b057a", "title": "\"I Got Flagged for Supposed Bullying, Even Though It Was in Response to Someone Harassing Me About My Disability.\": A Study of Blind TikTokers' Content Moderation Experiences"}, {"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}, {"paperId": "9bcc2b63c2a0bb2a3a8aab748910a496b82f474e", "title": "Alt‐health influencers and the threat of social media deplatforming"}, {"paperId": "43de11ef1ac04b3597a0a70011fd63ca3a05a972", "title": "Deplatforming Norm-Violating Influencers on Social Media Reduces Overall Online Attention Toward Them"}, {"paperId": "86b675fe27293e5c4b1d28b7da5eba348416caf8", "title": "Protection from Evil and Good: The Differential Effects of Page Protection on Wikipedia Article Quality"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "de82c0e640646086a462b2fca99a82625c60cc1d", "title": "Sadness, Anger, or Anxiety: Twitter Users' Emotional Responses to Toxicity in Public Conversations"}, {"paperId": "21c93fd80e0b2826e9e7d14578b8087695d6ecee", "title": "Content Moderation and the Formation of Online Communities: A Theoretical Framework"}, {"paperId": "baf52a9a8e1daaefa6b7d3eaf578bc476e68b80c", "title": "How toxic is antisemitism? Potentials and limitations of automated toxicity scoring for antisemitic online content"}, {"paperId": "156af32506e22466edad5da313158642d07b04e7", "title": "How Do Users Experience Moderation?: A Systematic Literature Review"}, {"paperId": "a012bae4cd4d13faff7ef018ae8601771ca80c07", "title": "UPB @ ACTI: Detecting Conspiracies using fine tuned Sentence Transformers"}, {"paperId": "79946ffb5da607f6eea3dc4950dd9a57288ebc61", "title": "Social Media and College-Related Social Support Exchange for First-Generation, Low-Income Students: The Role of Identity Disclosures"}, {"paperId": "938b52a1ab3e4ad6c380fadfb7ba3053c2428af0", "title": "ConvEx: A Visual Conversation Exploration System for Discord Moderators"}, {"paperId": "2a0dc4f4e99b466e8844d9774436129ffca8ee97", "title": "Bystanders of Online Moderation: Examining the Effects of Witnessing Post-Removal Explanations"}, {"paperId": "c971d17a9da8e24ded5d210ad2fa3b56fcd2b675", "title": "The efficacy of Facebook's vaccine misinformation policies and architecture during the COVID-19 pandemic."}, {"paperId": "77c6718cb0667ecdbab24a66d4ba9c74939caf2c", "title": "User's Reaction Patterns in Online Social Network Communities"}, {"paperId": "36ab86c43624acc0a15d982ccb63bcc27a3de39b", "title": "Social media, extremism, and radicalization"}, {"paperId": "5fed378c0ea7d058aaabb751e527f0148b952856", "title": "Polarized Speech on Online Platforms"}, {"paperId": "5690aa31aeb4f3d7f14313da1696de8e374fec0b", "title": "Bans vs. Warning Labels: Examining Support for Community-wide Moderation Interventions"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}, {"paperId": "462c4b98cc5ab580bd40de36ff4b610b50ce66a1", "title": "Echo Tunnels: Polarized News Sharing Online Runs Narrow but Deep"}, {"paperId": "c9e548d72f5ad72215025602be36f72042219baf", "title": "Unsafe Diffusion: On the Generation of Unsafe Images and Hateful Memes From Text-To-Image Models"}, {"paperId": "0b4637c42260a3b7e966dbb671f01b2789dc69fc", "title": "Towards Intersectional Moderation: An Alternative Model of Moderation Built on Care and Power"}, {"paperId": "0a0cb422ada9de7c2b62db36fce99e4f47d5afe8", "title": "The Intended Uses of Automated Fact-Checking Artefacts: Why, How and Who"}, {"paperId": "2ce3253fa3892b1820b672437359b29ff1ca0bb4", "title": "Users volatility on Reddit and Voat"}, {"paperId": "0c97d554dc4890c410bf92c36aeead9db32c8d4a", "title": "Towards Leveraging AI-based Moderation to Address Emergent Harassment in Social Virtual Reality"}, {"paperId": "e33009030e176c1dd0ce10ce1c66a7d78019524c", "title": "Transparency, Fairness, and Coping: How Players Experience Moderation in Multiplayer Online Games"}, {"paperId": "3dddc0f7d839d4a7dd0aa220a2772896ea2c7414", "title": "No Easy Way Out: The Effectiveness of Deplatforming an Extremist Forum to Suppress Hate and Harassment"}, {"paperId": "1238aa35bc7c79761a74d8f748a457ee17a70722", "title": "Auditing Elon Musk's Impact on Hate Speech and Bots"}, {"paperId": "0a56fc83bac9739ac31259e44f4a59271f3a6fee", "title": "No Love Among Haters: Negative Interactions Reduce Hate Community Engagement"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "818403265db4316bac23d5e9288f5f0c41003107", "title": "Truth Social Dataset"}, {"paperId": "6c6ab8fbbcf7944e61afe330fe63fbb6df8c1858", "title": "Altruistic and Profit-oriented: Making Sense of Roles in Web3 Community from Airdrop Perspective"}, {"paperId": "6f40a37360333fb6fac5a3e67d853ae932a34436", "title": "Examining the Production of Co-active Channels on YouTube and BitChute"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "a1cfc04ec39a11bedd5c1db01c39c1f742339157", "title": "Deplatforming did not decrease Parler users’ activity on fringe social media"}, {"paperId": "3d56ed8cc71be713ec13e6db307464394c74662d", "title": "“There’s so much responsibility on users right now:” Expert Advice for Staying Safer From Hate and Harassment"}, {"paperId": "ac71643ab49fbb3433a389439a86ac3765e25e32", "title": "Tracking Fringe and Coordinated Activity on Twitter Leading Up To the US Capitol Attack"}, {"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "6ce5e6fc425306bbd3d9ca659dbf7c78f42c6c33", "title": "How can we combat online misinformation? A systematic overview of current interventions and their efficacy"}, {"paperId": "f4586e3dbd70218af8ef421fa9d4ebbf9aa0bd04", "title": "Estimating Geographic Spillover Effects of COVID-19 Policies From Large-Scale Mobility Networks"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}, {"paperId": "deed656057e45f4a0d96ff840b56f001056a004e", "title": "Political Honeymoon Effect on Social Media: Characterizing Social Media Reaction to the Changes of Prime Minister in Japan"}, {"paperId": "0d08e3c84e6a32739bbff18b819c124fb8ce46d2", "title": "How Musk’s takeover might change Twitter: what researchers think"}, {"paperId": "7f5801f8036e71658a12d16203617b2ab25ef14f", "title": "Discovering Differences in the Representation of People using Contextualized Semantic Axes"}, {"paperId": "9f8c0fe82f3641e8c294f84c73ff9b025b711360", "title": "Automated Content Moderation Increases Adherence to Community Guidelines"}, {"paperId": "4a7bb730127b5148a9c0144359bd862e42968fc8", "title": "Nobody Wants to Work Anymore: An Analysis of r/antiwork and the Interplay between Social and Mainstream Media during the Great Resignation"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "016cb06f7de32e12653f475abae3c44c97923993", "title": "One of Many: Assessing User-level Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "3587d05fafec6053808351b8b72c670f58c9a8ec", "title": "Understanding Longitudinal Behaviors of Toxic Accounts on Reddit"}, {"paperId": "34ef6de15cb4d420962e0cfbb79a0613ef8c7cc0", "title": "Conspiracy theories in digital environments: Moving the research field forward"}, {"paperId": "6bb9247c2890658e6b81fa27c55641ee861a951c", "title": "Adherence to Misinformation on Social Media Through Socio-Cognitive and Group-Based Processes"}, {"paperId": "6e63212def0783609b76727282ac0545dc00a6c6", "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement, and Research to Practice"}, {"paperId": "269af7a41800db30d49fcdcaee75268f207f2a33", "title": "Understanding Effects of Moderation and Migration on Online Video Sharing Platforms"}, {"paperId": "4e2d9ca07cade654bba1469837d6edd508574cb8", "title": "A Tale of Two Subreddits: Measuring the Impacts of Quarantines on Political Engagement on Reddit"}, {"paperId": "693be8fc0fe567c67abc507fd0aebe3009ce2f29", "title": "The Reddit Politosphere: A Large-Scale Text and Network Resource of Online Political Discourse"}, {"paperId": "09c6109002f20b29131ee9544bb977e257b23994", "title": "Online interventions for reducing hate speech and cyberhate: A systematic review"}, {"paperId": "e3c023629e86aabb75469684f87732eb902a8f7f", "title": "Personalized Interventions for Online Moderation"}, {"paperId": "9d070671b49dabf988464779696aff75fe592878", "title": "On Xing Tian and the Perseverance of Anti-China Sentiment Online"}, {"paperId": "882a61e2e3845250907ccf6526bd288c0a17daa6", "title": "Donald Trump and the rationalization of transgressive behavior: The role of group prototypicality and identity advancement"}, {"paperId": "166276c6ab26a247da517810c1820c101bbe297e", "title": "From Receivers to Givers: Understanding Practice of Reciprocity in an Online Support Community"}, {"paperId": "6e3c3d94bdab82e077bcf131848000be8356ba36", "title": "Characterizing Reddit Participation of Users Who Engage in the QAnon Conspiracy Theories"}, {"paperId": "29f0a5241b932f305e8fb401d1769bdc1fbfcfad", "title": "Designing Word Filter Tools for Creator-led Comment Moderation"}, {"paperId": "fa7793e9c6ef4c83460c8269632a692405d9dc19", "title": "Make Reddit Great Again: Assessing Community Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "bda4ba8531648858b322d183c37d7e1d234e421e", "title": "\"I Can't Keep It Up.\" A Dataset from the Defunct Voat.co News Aggregator"}, {"paperId": "dda9d9b371a7961be74fcfd77923d87d008b99dd", "title": "No Community Can Do Everything: Why People Participate in Similar Online Communities"}, {"paperId": "6512be4bbea6dc3f70b69dd9cd43f03a1c5fba80", "title": "“I’ll be back”: Examining Restored Accounts On Twitter"}, {"paperId": "4f9dda2b7f7526108f5c9695e88a63836a085fa4", "title": "Understanding the Use of e-Prints on Reddit and 4chan’s Politically Incorrect Board"}, {"paperId": "abc12bed0853575949b7b9ef0a934dfe77300b5b", "title": "Soros, Child Sacrifices, and 5G: Understanding the Spread of Conspiracy Theories on Web Communities"}, {"paperId": "fd8357c94fa12e3dc6effac39e12bc747b7cab03", "title": "Reddit and the Fourth Estate: Exploring the magnitude and effects of media influence on community level moderation on Reddit"}, {"paperId": "e2ee0a300b570366b9d7d64e1ec86acf5c33fceb", "title": "Exploring content moderation in the decentralised web: the pleroma case"}, {"paperId": "57ed3397af003b4245ae9a127dfa7bf91fd66129", "title": "Evaluating the Effectiveness of Deplatforming as a Moderation Strategy on Twitter"}, {"paperId": "043624a7253a30e9f7cd629edd4d161142882f8f", "title": "Disproportionate Removals and Differing Content Moderation Experiences for Conservative, Transgender, and Black Social Media Users: Marginalization and Moderation Gray Areas"}, {"paperId": "4d37ffa4ec57fd30d8bc752537febd9e7efc433e", "title": "Towards Understanding the Use of Telegram by Political Groups in Brazil"}, {"paperId": "c7dc71e727b4760eeeb5a972fdbbc42cff2fea43", "title": "When the Echo Chamber Shatters: Examining the Use of Community-Specific Language Post-Subreddit Ban"}, {"paperId": "769fec9ee0a3402746692b8794d48c75b31987bb", "title": "Political Bias and Factualness in News Sharing Across more then 100, 000 Online Communities"}, {"paperId": "4c90a8b5cb328d7fd4bcfa83c8696bf2e5456b7d", "title": "Quarantined! Examining the Effects of a Community-Wide Moderation Intervention on Reddit"}, {"paperId": "5b9bc02aead2f26985cfbb3762dce554433db83d", "title": "\"How over is it?\" Understanding the Incel Community on YouTube"}, {"paperId": "6aeb161170f2cba8b17fa95d5eba5bc3aed607dc", "title": "Understanding the Incel Community on YouTube"}, {"paperId": "735164429ce03572bc50be5d772414caa3725f09", "title": "A Total Error Framework for Digital Traces of Human Behavior on Online Platforms"}, {"paperId": "3d90f7c793524263a10aa874d0d5fd95a93f27d0", "title": "The Economics of Social Media"}, {"paperId": "b66b84d25babeb463958792f2ce7b746bd49ce23", "title": "Digitally Mediated Misogyny and Critical Discourse Studies: Methodological and Ethical Implications"}, {"paperId": "c15c068f70e9b2c8f25fac2515b9e046d0ca1dd2", "title": "Echo Tunnels: Polarized News Sharing on Reddit Runs Narrow but Deep"}, {"paperId": "4d712576a83f1613a01ee0736ae8ac420e64bbbd", "title": "sCambiaMenti at ACTI: Ensemble model with majority voting for Automatic Conspiracy Detection (short paper)"}, {"paperId": "b8518a6aba111ae87d8b504c3d34cb3ac62ef181", "title": "Multilingual Racial Hate Speech Detection Using Transfer Learning"}, {"paperId": "0b3cd1782376fbd9305a7db583893b788ca63e8e", "title": "How can we combat online misinformation? A systematic overview of current interventions and their efficacy"}, {"paperId": "360c24b7424cf469f4648f8d0a262c130c6663c2", "title": "UPB at ACTI: Detecting Conspiracies using fine tuned Sentence Transformers (short paper)"}, {"paperId": "9ae39b1b2a029bd0134c4e115136a7acd91d0fd3", "title": "\"I can't keep it up anymore.\" The Voat.co dataset"}, {"paperId": "7d4a18c5cd6c739b4b445094cd658142da739782", "title": "“I Can’t Keep It Up Anymore.” A Dataset from the Defunct Voat.co News Aggregator"}, {"paperId": "eb5d1ce7127f995020a86fc8cb561c4e0f2096cc", "title": "A Model of Information Regulation in the Presence of Competition Between Social Media Platforms"}, {"paperId": null, "title": "Special Issue: Conspiracy Theories in Digital Environments"}, {"paperId": "ca5850fc6ef6abba0b3f7d79e309d169a457d2ad", "title": "\"We won't even challenge their lefty academic definition of racist: \" Understanding the Use of e-Prints on Reddit and 4chan"}, {"paperId": "41070bce09c6954150518cbbf38aab8d984acaba", "title": "ExtremeBB: Enabling Large-Scale Research into Extremism, the Manosphere and Their Correlation by Online Forum Data"}]}
