{"paperId": "4c7d0b507e4a6b2e711cb1d37b57e56a5c532d8a", "publicationVenue": {"id": "57ef36b3-e71f-44ca-ab80-f893afce2ede", "name": "International Conference on Cloud and Big Data Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Big Data Comput", "International Conference Cloud and Big Data Computing", "ICCBDC"]}, "title": "A scalable and secure model for surveillance cameras in resource constrained IoT systems", "abstract": "In wireless multimedia surveillance networks (WMSNs), the sensors generate continuous data streams which are saved on cloud servers for processing and future use. Large-scale security and monitoring decisions are based on the video data fed back to the cloud by the visual sensors. Internet of Things (IoT) networks are deployed in certain resource constrained scenarios where edge computing is not available for data analytics and security considering the IoT devices have also limited resources such as memory, power and processing capabilities. In this paper, the problems of limited resources and data security are addressed by the proposal of a secure model for video surveillance systems working in resource constrained IoT assisted scenarios. The suggested approach comprises of the following four main stages: i) save only those video frames in which any activity is detected, ii) encrypt the saved frames for secure transmission, iii) synchronize the encrypted frames between cloud and sensor node and iv) remove the transmitted frames from sensor and decrypt the stored data on cloud. The performance of the encryption process for resource constrained devices is analyzed on different types of sensor nodes during experimentation. The results prove that the proposed method automates and speeds up the process of live video data extraction and occupies less space on cloud when compared to the conventional approach for saving surveillance videos. Furthermore, adding encryption to video frames ensures integrity of video data during their journey from sensor to the cloud.", "venue": "International Conference on Cloud and Big Data Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-08-26", "journal": {"name": "Proceedings of the 2020 4th International Conference on Cloud and Big Data Computing"}, "authors": [{"authorId": "1963799587", "name": "Unsub Zia"}, {"authorId": "144493732", "name": "B. Scotney"}, {"authorId": "38085543", "name": "Mark P. McCartney"}, {"authorId": "2109802365", "name": "Jorge Martínez"}, {"authorId": "2092960361", "name": "Mamun AbuTair"}, {"authorId": "48814293", "name": "Ali Sajjad"}], "citations": []}
