{"paperId": "4c86c2306b39e017b86e701bd55fd9fdb1ef1abd", "publicationVenue": {"id": "69abe422-ea90-45e0-a2e2-3aa1f126bf22", "name": "National Conference on Communications", "type": "conference", "alternate_names": ["NCC", "National Conf Commun", "National Comput Conf", "National Computer Conference"]}, "title": "A Two-Way Optimization Framework for Clustering of Images using Weighted Tensor Nuclear Norm Approximation", "abstract": "Clustering of multidimensional data has found applications in different fields. Among the existing methods, spectral clustering techniques have gained great attention due to its superior performance and low computational complexity. The clustering accuracy in spectral clustering methods depends on the affinity matrix learned from the data. Traditional clustering techniques fail to capture the spatial aspects of the images since they vectorize the images. In the proposed approach, the images are stacked as lateral slices of a three-way tensor. Further, a two-way optimization problem is formulated to extract a sparse t-linear combination tensor. Weighted Tensor Nuclear Norm (WTNN) is introduced in the optimization problem for enhancing tensor sparsity, and thereby improving the clustering accuracy. The performance of the proposed method is evaluated on three popular datasets. The evaluation shows that the proposed method has superior performance over the state-of-the-art methods.", "venue": "National Conference on Communications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 National Conference on Communications (NCC)", "pages": "1-5"}, "authors": [{"authorId": "1626059632", "name": "A. Johnson"}, {"authorId": "2067906778", "name": "Jobin Francis"}, {"authorId": "8767801", "name": "Baburaj Madathil"}, {"authorId": "2288329277", "name": "S. N. George"}], "citations": [{"paperId": "641929a94fbd8a43d6bc1c8612f009143d14d4c7", "title": "A Semiblind Receiver for a Two-Way UAV-Aided PIC System Based on the PARAFAC Model"}, {"paperId": "221e5d7fa2d2fe8602c77cd69d3ed836453771f7", "title": "A Robust Tensor-Based Submodule Clustering for Imaging Data Using l12 Regularization and Simultaneous Noise Recovery via Sparse and Low Rank Decomposition Approach"}, {"paperId": "705492e5bc2e28179891b18269f73215cb658095", "title": "Noise robust image clustering based on reweighted low rank tensor approximation and \n \n \n \n $$l_{\\frac{1}{2}}$$\n \n \n l\n \n 1\n 2\n \n \n \n regularization"}]}
