{"paperId": "4c89121616773e615ae3bc09010a207957b83b40", "publicationVenue": {"id": "589ed020-784b-47ac-884d-9c6ae29fd509", "name": "International Conference Intelligent Computing and Control Systems", "type": "conference", "alternate_names": ["ICICCS", "Int Conf Intell Comput Control Syst"]}, "title": "A Study of Recommender Systems Using Markov Decision Process", "abstract": "as the number of items increase in every domain, users find it particularly difficult to decide which item is most suitable for them. Due to the availability of such large pool of data, it is crucial to automate the process. For carrying out this task, recommender systems are used. But conventional recommender systems adopt a static view of data. Hence, reinforcement learning is used to make a dynamic recommendation of items to the user. In the presented paper, research work done in recommender systems by using the Markov Decision Process, which is a reinforcement learning model, has been discussed.", "venue": "International Conference Intelligent Computing and Control Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 Second International Conference on Intelligent Computing and Control Systems (ICICCS)", "pages": "1279-1283"}, "authors": [{"authorId": "153561223", "name": "Garima Gupta"}, {"authorId": "3126857", "name": "R. Katarya"}], "citations": [{"paperId": "82b184cfdca41042687491d973a7c6f46d0d9dc1", "title": "An efficient framework for the similarity prediction with query recommendation in E‐learning system"}, {"paperId": "cae0980c9efd757e2cbf445fbb715e123d8936a0", "title": "Blockchain-based Recommender Systems: Applications, Challenges and Future Opportunities"}, {"paperId": "9336feefc2e506c413eaca64b19819c0e49348b9", "title": "Optimized Recommender Systems with Deep Reinforcement Learning"}, {"paperId": "acab084fe81989466b6331c2dada3b41874e821d", "title": "Rating Prediction in Recommender Systems Based on User Behavior Probability and Complex Network Modeling"}, {"paperId": "a98bb7ba554378beb8ad3563e44772d0af878965", "title": "Sparse Trust Data Mining"}]}
