{"paperId": "4c8cf620823f727b0c470165468b08f6d85f2185", "publicationVenue": null, "title": "Heart Disease Prediction and Classification using Machine Learning and Transfer Learning Model", "abstract": "Heart disease is a dangerous condition that can lead to a fatal condition due to cardiac arrest. Recent studies have revealed various facts for analyzing cardiac data by sensing, monitoring, and learning data in IoT to predict early diagnosis and treatment. Through machine learning based feature analysis, accurate disease detection has been implemented. However, the dominant methods do not accurately predict the result since the incorrect features contain non-related support values to select the features to perform training validation and produce prediction inaccuracy. To overcome this limitation, a Machine Learning and Transfer Learning Model (TLM) is proposed to perform heart disease prediction. Initially, pre-processing has been carried out to reduce dimension, and the scaling factor was also used to calculate the margin rate. To increasing the prediction accuracy Disease Prone Impact Rate (DPIR) intends to find the support values. To select the labeled features, Relative Feature Margin Selection (RFMS) is used to select and train the model by Multilayer perception neural network (MLPNN). This classifier selects the margin weights to predict the heart disease risk level based on the class. This predicts higher impact of cardiac deficiency rate by attaining the relevant features based deep feature data learning model, which produce higher precision rate to increase the prediction accuracy than other methods.", "venue": "2022 International Conference on Automation, Computing and Renewable Systems (ICACRS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-18", "journal": {"name": "2022 International Conference on Automation, Computing and Renewable Systems (ICACRS)", "pages": "595-601"}, "authors": [{"authorId": "47124089", "name": "R. Sivaprasad"}, {"authorId": "1473362190", "name": "M. Hema"}, {"authorId": "65963771", "name": "Bharati N Ganar"}, {"authorId": "2283076111", "name": "Sunil D M"}, {"authorId": "2059882465", "name": "Vaishali Mehta"}, {"authorId": "72864413", "name": "M. Fahlevi"}], "citations": [{"paperId": "ab1116b6642b60b7e1c1f31aa9fa391ea2213df5", "title": "Heart Disease Prediction with Hyperparameter Analysis"}, {"paperId": "2d87acb2d58fc65a98b65e5b81e82dfd7c9d9e56", "title": "The influence of infant massage on urination patterns in babies aged 3-6 months receiving exclusive breastfeeding: A study at Bunda Patimah Primary Clinic"}]}
