{"paperId": "4c972fccf05173b618caab94b4de79115aa94fb9", "publicationVenue": null, "title": "Quantifying Depressed Social Media During COVID-19: Information Retrieval With ML & NLP", "abstract": "The ongoing pandemic continues to disrupt the normal functioning of society in numerous ways, and symptoms of depression are on the rise [Ettman et al., 2020]. In this work, we explored how analysis of social media can reveal changes in the number of authors presenting depressive symptoms on social media using Twitter and Reddit. We ﬁrst assessed the level of depressive symptoms expressed in a large set of tweets. While there are some eﬀorts for identifying depressive symptoms in tweets, they are limited in scope and typically do not account for contemporary online discourse surrounding the experience of depression [Hasan et al., 2014, Pedersen, 2015]. To ensure that our assessment accounted for contemporary discourse, we extracted recent posts from /r/Depression , where symptoms and experience are a main topic of discussion. To further ensure that our assessment accounted for language that expresses depressive symptoms in a variety of contexts, rather than only when explicitly discussing the experience of depression, we also extracted all of the other Reddit posts of users who posted in /r/Depression . These user posts were extracted from all posts made by all authors in /r/Depression across all of Reddit for November and December 2019 (the most recent two months available in their entirety on Pushshift [Baumgart-ner et al., 2020]). We then trained a GloVe word embedding on the posts made by users across", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-04", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "152399695", "name": "Brent D. Davis"}, {"authorId": "2045024655", "name": "D. McKnight"}, {"authorId": "3144230", "name": "R. Chunara"}, {"authorId": "1690162", "name": "D. Lizotte"}, {"authorId": "2655967", "name": "Alona Fyshe"}], "citations": []}
