{"paperId": "4c98c88d2a2f27fa58d00aa64e7d1c63285e30fa", "publicationVenue": {"id": "6d321751-3a9f-40e1-96b3-b5e3904cce9f", "name": "European Journal of Gastroenterology and Hepathology", "type": "journal", "alternate_names": ["European Journal of Gastroenterology & Hepatology", "Eur J Gastroenterol  Hepatol", "Eur J Gastroenterol Hepathology"], "issn": "0954-691X", "url": "http://www.eurojgh.com/", "alternate_urls": ["https://journals.lww.com/eurojgh/Pages/default.aspx", "http://journals.lww.com/eurojgh/pages/default.aspx"]}, "title": "Effectiveness and safety of vedolizumab and infliximab in biologic-naive patients with Crohn’s disease: results from the EVOLVE study", "abstract": "Objectives This study compared the real-world effectiveness and safety of α4β7-integrin inhibitor vedolizumab and anti-tumor necrosis factor alpha (anti-TNFα) inhibitor infliximab in biologic-naive patients with Crohn’s disease (CD). Methods EVOLVE was a retrospective, multicenter, medical chart review of biologic-naive adults with inflammatory bowel disease receiving vedolizumab or anti-TNFα treatment as first-line biologics in Canada, Greece, and the USA. Twelve-month outcomes were analyzed in vedolizumab- or infliximab-treated patients with moderate-to-severe CD (and subgroups with complicated and noncomplicated CD) including cumulative rates of clinical response, clinical remission, and mucosal healing, and incidence rates of serious adverse events (SAEs) and serious infections (SIs). Inverse probability weighting (IPW) was used to account for baseline differences between treatment groups. Results Data were analyzed from 167 patients. In the IPW dataset (99 vedolizumab-treated and 63 infliximab-treated), adjusted 12-month clinical remission rates were 73.1% and 55.2%, respectively (P = 0.31). Overall, effectiveness rates were similar across treatment and complicated/noncomplicated disease subgroups. Adjusted 12-month incidence rates (first occurrence/1000 person-years) of SAEs for vedolizumab vs. infliximab: 43.6 vs. 200.9 [hazard ratio (HR) 0.36 (0.09–1.54)]; SIs: 10.8 vs. 96.0 [HR 0.08 (<0.01–2.64)]. AE incidence was significantly lower in vedolizumab- vs. infliximab-treated patients for complicated [131.6 vs. 732.2; HR 0.19 (0.05–0.65)] and noncomplicated [276.3 vs. 494.8; HR 0.59 (0.35–0.99)] disease subgroups. Conclusion These real-world data on first-line biologics show no differences in 12-month effectiveness outcomes for vedolizumab- vs. infliximab-treated biologic-naive patients with CD. Vedolizumab may have a more favorable safety profile vs. infliximab in patients with complicated and noncomplicated disease.", "venue": "European Journal of Gastroenterology and Hepathology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-27", "journal": {"name": "European Journal of Gastroenterology & Hepatology", "pages": "281 - 291", "volume": "36"}, "authors": [{"authorId": "77238305", "name": "G. Mantzaris"}, {"authorId": "2120715542", "name": "B. Bressler"}, {"authorId": "66774286", "name": "S. Adsul"}, {"authorId": "2277883466", "name": "Michelle Luo"}, {"authorId": "2277840567", "name": "Chris Colby"}, {"authorId": "2260125390", "name": "N. R. Brett"}, {"authorId": "152623502", "name": "S. Saha"}, {"authorId": "2260070956", "name": "P. Kamble"}, {"authorId": "2250520346", "name": "Song Wang"}, {"authorId": "2268466913", "name": "Andres J Yarur"}], "citations": []}
