{"paperId": "4c9e60ca3b9355582a73247c0a208fd2fbb2c3d6", "publicationVenue": null, "title": "Optimized Service System for Rail Travel Management Using Big Data Framework", "abstract": "Big data analytics can absolutely be a pace mover for decision-making in the current scenario. Big data includes approaches such as to gather, store, and process, break down and envision a lot of heterogeneous data. Train generates a tremendous amount of raw data every time they move. Delay management proves to be a field where data analytics can solve a variety of issues in the current rail industry. By more precise usage, big data analytics will provide accurate and best solutions for train delay prediction system across many countries. In existing system a data driven model is framed for train delay prediction which are based on train movement with this implementation it's possible to calculate the dwell time, successive checkpoints and locations by using incremental iteration algorithm. In proposed system, data driven model like weather data and the train movement data are integrated together to predict the train delays. The computation process of both data is compared by apache spark and visualize using Elastic search Kibana. The optimization efficiency can be compared by incremental iterative algorithm and bulk iterative algorithm to obtain optimal results.", "venue": "2019 Fifth International Conference on Science Technology Engineering and Mathematics (ICONSTEM)", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2019-03-01", "journal": {"name": "2019 Fifth International Conference on Science Technology Engineering and Mathematics (ICONSTEM)", "pages": "80-84", "volume": "1"}, "authors": [{"authorId": "1452353664", "name": "V. P."}, {"authorId": "1394342962", "name": "Vidhya A."}], "citations": [{"paperId": "961faeb5f79bd7b1fe4b94689319168688db69e2", "title": "Comparative Study of Syntactic Search Engine and Semantic Search Engine: A Survey"}]}
