{"paperId": "4c9f8390d1db1ad97cd92160f9c523c2a0233868", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "CAMEO: A Causal Transfer Learning Approach for Performance Optimization of Configurable Computer Systems", "abstract": "Modern computer systems are highly configurable, with hundreds of configuration options that interact, resulting in an enormous configuration space. As a result, optimizing performance goals (e.g., latency) in such systems is challenging due to frequent uncertainties in their environments (e.g., workload fluctuations). Lately, there has been a utilization of transfer learning to tackle this issue, leveraging information obtained from configuration measurements in less expensive source environments, as opposed to the costly or sometimes impossible interventions required in the target environment. Recent empirical research showed that statistical models can perform poorly when the deployment environment changes because the behavior of certain variables in the models can change dramatically from source to target. To address this issue, we propose Cameo---a method that identifies invariant causal predictors under environmental changes, allowing the optimization process to operate in a reduced search space, leading to faster optimization of system performance. We demonstrate significant performance improvements over state-of-the-art optimization methods in MLperf deep learning systems, a video analytics pipeline, and a database system.", "venue": "ACM Symposium on Cloud Computing", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-06-13", "journal": {"name": "Proceedings of the 2023 ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "94395755", "name": "Md Shahriar Iqbal"}, {"authorId": "30188141", "name": "Ziyuan Zhong"}, {"authorId": "30344386", "name": "Iftakhar Ahmad"}, {"authorId": "31631000", "name": "Baishakhi Ray"}, {"authorId": "31948108", "name": "Pooyan Jamshidi"}], "citations": [{"paperId": "5b2600816f4967e0ab7d62e7f1aba0d5abccbe34", "title": "CURE: Simulation-Augmented Auto-Tuning in Robotics"}]}
