{"paperId": "4cb50ea9a155da63b9cc4c47063e637639b76146", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Myeloid-Derived Suppressor–Cell Dynamics Control Outcomes in the Metastatic Niche", "abstract": "Myeloid-derived suppressor cells (MDSCs) play a prominent and rising role in the tumor microenvironment. An understanding of the tumor-MDSC interactions that influence disease progression is critical, and currently lacking. To address this, we developed a mathematical model of metastatic growth and progression in immune-rich tumor microenvironments. We model the tumor-immune dynamics with stochastic delay differential equations, and study the impact of delays in MDSC activation/recruitment on tumor growth outcomes. We find when the circulating level of MDSCs is low, the MDSC delay has a pronounced impact on the probability of new metastatic establishment: blocking MDSC recruitment can reduce the probability of metastasis by as much as 50%. We also quantify the extent to which decreasing the immuno-suppressive capability of the MDSCs impacts the probability that a new metastasis will persist or grow. In order to quantify patient-specific MDSC dynamics under different conditions we fit individual tumors treated with immune checkpoint inhibitors to the tumor-MDSC model via Bayesian parameter inference. We reveal that control of the inhibition rate of natural killer cells by MDSCs has a larger influence on tumor outcomes than controlling the tumor growth rate directly. Posterior classification of tumor outcomes demonstrates that incorporating knowledge of the MDSC responses improves predictive accuracy from 63% to 82%. Our results illustrate the importance of MDSC dynamics in the tumor microenvironment and predict interventions that may shift environments towards a less immune-suppressed state. We argue that there is a pressing need to more often consider MDSCs in analyses of tumor microenvironments.", "venue": "bioRxiv", "year": 2022, "fieldsOfStudy": ["Medicine", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-16", "journal": {"name": "Cancer Immunology Research", "pages": "614 - 628", "volume": "11"}, "authors": [{"authorId": "104188343", "name": "Jesse Kreger"}, {"authorId": "51509572", "name": "E. R. Roussos Torres"}, {"authorId": "39527025", "name": "Adam L. Maclean"}], "citations": [{"paperId": "ff292485620c0dcff90e6052e660f7659074072b", "title": "E3 ligase TRIM28 promotes anti-PD-1 resistance in non-small cell lung cancer by enhancing the recruitment of myeloid-derived suppressor cells"}, {"paperId": "ca9a136b9fc0cb63a5a634eca1ff90392ad79987", "title": "Multi-omics analysis reveals interferon-stimulated gene OAS1 as a prognostic and immunological biomarker in pan-cancer"}, {"paperId": "fbc4f21b329b190ede3b467cddd9073b387c5642", "title": "A closer look at parameter identifiability, model selection and handling of censored data with Bayesian Inference in mathematical models of tumour growth"}, {"paperId": "9e1071b1f5217a8ff9728b5ddff8ff62e727cec3", "title": "Deacetylase SIRT2 negatively regulates MDSC functions in allograft rejection."}, {"paperId": "5f7f5e6d952d5136169f1fa28fc5de111c077d27", "title": "Global stability and parameter analysis reinforce therapeutic targets of PD-L1-PD-1 and MDSCs for glioblastoma"}, {"paperId": "84461e8c0dbd82296c8bcf9043bacc6a33009d9f", "title": "Editorial: The role of epigenetic modification in MDSC differentiation and function"}, {"paperId": "d9cf22f606afbf8d28baa50eb6c56fa3b96bce46", "title": "Analyzing the Growth Dynamics of Bladder Cancer Using Ordinary Differential Equation Modeling"}]}
