{"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression", "abstract": "Lossless floating-point time series compression is crucial for a wide range of critical scenarios. Nevertheless, it is a big challenge to compress time series losslessly due to the complex underlying layouts of floating-point values. The state-of-the-art erasing-based compression algorithm Elf demonstrates a rather impressive performance. We give an in-depth exploration of the encoding strategies of Elf, and find that there is still much room for improvement. In this paper, we propose Elf*, which employs a set of optimizations for leading zeros, center bits and sharing condition. Specifically, we develop a dynamic programming algorithm with a set of pruning strategies to compute the adaptive approximation rules efficiently. We theoretically prove that the adaptive approximation rules are globally optimal. We further extend Elf* to Streaming Elf*, i.e., SElf*, which achieves almost the same compression ratio as Elf*, while enjoying even higher efficiency in streaming scenarios. We compare Elf* and SElf* with 8 competitors using 22 datasets. The results demonstrate that SElf* achieves 9.2% relative compression ratio improvement over the best streaming competitor while maintaining similar efficiency, and that Elf* ranks among the most competitive batch compressors. All source codes are publicly released.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-23", "journal": {"name": "ArXiv", "volume": "abs/2308.11915"}, "authors": [{"authorId": "1720842162", "name": "Ruiyuan Li"}, {"authorId": "2146247967", "name": "Zheng Li"}, {"authorId": "2214672596", "name": "Yi Wu"}, {"authorId": "2145765196", "name": "Chao Chen"}, {"authorId": "2111149494", "name": "Tong Liu"}, {"authorId": "47833418", "name": "Yu Zheng"}], "citations": []}
