{"paperId": "4ccbbf93a9237bed3e30dd27ecb5c3259db36dea", "publicationVenue": {"id": "e29f3ae1-4574-4fd4-9f5b-498495cb7952", "name": "USENIX Workshop on Hot Topics in Operating Systems", "type": "conference", "alternate_names": ["USENIX Workshop Hot Top Oper Syst", "Workshop on Hot Topics in Operating Systems", "HotOS", "Workshop Hot Top Oper Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1213"}, "title": "Executing Shell Scripts in the Wrong Order, Correctly", "abstract": "Shell scripts are critical infrastructure for developers, administrators, and scientists; and ought to enjoy the performance benefits of the full suite of advances in compiler optimizations. But between the shell's inherent challenges and neglect from the community, shell tooling and performance lags far behind the state of the art. We propose executing scripts out-of-order to better use modern computational resources. Optimizing any part of an arbitrary shell script is very challenging: the shell language's complex, late-bound semantics makes extensive use of opaque external commands with arbitrary side effects. We work with the grain of the shell's challenges, meeting dynamism with dynamism: we optimize at runtime, speculatively executing commands in an isolated and monitored environment to determine and contain their behavior. Our proposed approach can yield serious performance benefits (up to 3.9× for a bioinformatics script on a 16-core machine) for arbitrarily complex scripts without modifying their behavior. Contained out-of-order execution obviates the need for command specifications, operates on external commands, and yields a much more general framework for the shell. Script writers need not change a thing and observe no differences: they get improved performance with the interpretability of sequential output.", "venue": "USENIX Workshop on Hot Topics in Operating Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-06-22", "journal": {"name": "Proceedings of the 19th Workshop on Hot Topics in Operating Systems"}, "authors": [{"authorId": "2140249135", "name": "Georgios Liargkovas"}, {"authorId": "91973722", "name": "Konstantinos Kallas"}, {"authorId": "144295440", "name": "M. Greenberg"}, {"authorId": "2220400096", "name": "Nikos Vasilakis"}], "citations": []}
