{"paperId": "4cf4083fa28d1a892a179f9da0f1d978a4efdbd2", "publicationVenue": null, "title": "Enhancing the Healthcare Management System with National Identification: In the Bangladesh Perspective", "abstract": "Enhanced healthcare management system provides essential medical services to the people of Bangladesh. Due to its enormous potential, it has gained particular attention over the past few years. In the face of emergent medical situations, doctors have often found themselves grappling with a pressing challenge: gaining instant access to comprehensive patient data, a task complicated by patients’ potential inability to convey vital information under duress. This underscores the need for a centralized smart healthcare system which emerges as a solution for timely decision-making. This paper presents a comprehensive innovative system for efficient healthcare management which is based on National Identification. This system incorporates the use of a card chip that contains all consumer data and makes it accessible to healthcare providers and relevant authorities. It also ensures a streamlined administrative process and reduces the likelihood of flaws in patient care. The system’s interoperability capability is instrumental in creating a seamless flow of patient data across different healthcare facilities. This not only enhances continuity of care but also eliminates the need for redundant tests and procedures. Ultimately, it has led to more efficient healthcare delivery. The system has also provided a disease detection feature, which has been developed using Decision trees and Naïve Bayes Classifier algorithms to create a predictive model that can detect diseases early based on the symptoms. The overall system has had a significant impact on the healthcare system by improving the quality of healthcare.", "venue": "2023 26th International Conference on Computer and Information Technology (ICCIT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-13", "journal": {"name": "2023 26th International Conference on Computer and Information Technology (ICCIT)", "pages": "1-6"}, "authors": [{"authorId": "2287990337", "name": "Tarikuzzaman Tuhin"}, {"authorId": "2287973155", "name": "Ariful Islam"}, {"authorId": "2287983358", "name": "Farhan Shahriar Alvi"}, {"authorId": "2287989086", "name": "Most. Sumiya Yeasmin Labannya"}, {"authorId": "2287990347", "name": "Abu Hasib Muhammad Nanzil"}, {"authorId": "2215322607", "name": "Md. Motaharul Islam"}], "citations": []}
