{"paperId": "4d0a105776ca30a7a0242bce57d1a77b493568ae", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Survive the Schema Changes: Integration of Unmanaged Data Using Deep Learning", "abstract": "Data is the king in the age of AI. However data integration is often a laborious task that is hard to automate. Schema change is one significant obstacle to the automation of the end-to-end data integration process. Although there exist mechanisms such as query discovery and schema modification language to handle the problem, these approaches can only work with the assumption that the schema is maintained by a database. However, we observe diversified schema changes in heterogeneous data and open data, most of which has no schema defined. In this work, we propose to use deep learning to automatically deal with schema changes through a super cell representation and automatic injection of perturbations to the training data to make the model robust to schema changes. Our experimental results demonstrate that our proposed approach is effective for two real-world data integration scenarios: coronavirus data integration, and machine log integration.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-15", "journal": {"name": "ArXiv", "volume": "abs/2010.07586"}, "authors": [{"authorId": "2117423776", "name": "Zijie Wang"}, {"authorId": "1995831806", "name": "Lixi Zhou"}, {"authorId": "2469134", "name": "A. Das"}, {"authorId": "1995857803", "name": "Valay Dave"}, {"authorId": "3219107", "name": "Zhanpeng Jin"}, {"authorId": "144551417", "name": "Jia Zou"}], "citations": [{"paperId": "3120c2763edab339b937ddbe76991ebdfe0e01e6", "title": "Automatic Data Transformation Using Large Language Model - An Experimental Study on Building Energy Data"}, {"paperId": "850453fea7658dda27d4898229b45a25736f35ac", "title": "Managing Evolution of Heterogeneous Data Sources of a Data Warehouse"}]}
