{"paperId": "4d1a9ea0368aad53975e2fe34dc62528f9f5822e", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "FaaSFlow: enable efficient workflow execution for function-as-a-service", "abstract": "Serverless computing (Function-as-a-Service) provides fine-grain resource sharing by running functions (or Lambdas) in containers. Data-dependent functions are required to be invoked following a pre-defined logic, which is known as serverless workflows. However, our investigation shows that the traditional master-worker based workflow execution architecture performs poorly in serverless context. One significant overhead results from the master-side workflow schedule pattern, with which the functions are triggered in the master node and assigned to worker nodes for execution. Besides, the data movement between workers also reduces the throughput. To this end, we present a worker-side workflow schedule pattern for serverless workflow execution. Following the design, we implement FaaSFlow to enable efficient workflow execution in the serverless context. Besides, we propose an adaptive storage library FaaStore that enables fast data transfer between functions on the same node without through the database. Experiment results show that FaaSFlow effectively mitigates the workflow scheduling overhead by 74.6% on average and data transmission overhead by 95% at most. When the network bandwidth fluctuates, FaaSFlow-FaaStore reduces the throughput degradation by 23.0%, and is able to multiply the utilization of network bandwidth by 1.5X-4X.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-02-28", "journal": {"name": "Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems"}, "authors": [{"authorId": "2118275662", "name": "Zijun Li"}, {"authorId": "2175971206", "name": "Yushi Liu"}, {"authorId": "9221797", "name": "Linsong Guo"}, {"authorId": "1596812259", "name": "Quan Chen"}, {"authorId": "2149023479", "name": "Jiagan Cheng"}, {"authorId": "50010573", "name": "Wenli Zheng"}, {"authorId": "1697293", "name": "M. Guo"}], "citations": [{"paperId": "4daa4472143082c1c9ef6e55a9a4a139378046b8", "title": "Serverless? RISC more!"}, {"paperId": "2bc83301600ff07acebc27eaa710d1ad231581ed", "title": "Joint Optimization of Parallelism and Resource Configuration for Serverless Function Steps"}, {"paperId": "9bbfc65a215b974ab75ca47529d7c492f581767d", "title": "FaaSBatch: Boosting Serverless Efficiency With In-Container Parallelism and Resource Multiplexing"}, {"paperId": "2a85f343b47f3a54580d9845cc036703bccba67f", "title": "SPES: Towards Optimizing Performance-Resource Trade-Off for Serverless Functions"}, {"paperId": "413021d23a97a603abdca274949c35bf9da15b90", "title": "Jiagu: Optimizing Serverless Computing Resource Utilization with Harmonized Efficiency and Practicability"}, {"paperId": "59877dc00faf12035ebe02ebf71d2a6eeada04fa", "title": "Optimizing serverless computing: A comparative analysis of multi-output regression models for predictive function invocations"}, {"paperId": "b582117a278f54acf1e0623ff51bf9a8e21afbc9", "title": "Shabari: Delayed Decision-Making for Faster and Efficient Serverless Functions"}, {"paperId": "dd615ebe688ae4fd127e19bb248717f25157b90e", "title": "DAGit: A Platform For Enabling Serverless Applications"}, {"paperId": "6ceacbc115f5c3f7ce3aa3e46dc5f1fe316c6214", "title": "Microless: Cost-Efficient Hybrid Deployment of Microservices on IaaS VMs and Serverless"}, {"paperId": "e9f5b03846caa60002ea59207f770d952eb8cede", "title": "Rethinking Deployment for Serverless Functions: A Performance-first Perspective"}, {"paperId": "c79d37cd367ec1d5dde1ed10bfb399f2a948f851", "title": "Halfmoon: Log-Optimal Fault-Tolerant Stateful Serverless Computing"}, {"paperId": "8e8cf6cbd4a68bffe722dc54b7143983cb4a7d82", "title": "Expedited Data Transfers for Serverless Clouds"}, {"paperId": "797043248baba03d8553ca5bf15c0d3571daef96", "title": "Stateful Serverless Application Placement in MEC With Function and State Dependencies"}, {"paperId": "1f4078a51d9b313c07fbb8f9d6254f02798b6ad7", "title": "BeeFlow: Behavior Tree-based Serverless Workflow Modeling and Scheduling for Resource-Constrained Edge Clusters"}, {"paperId": "4495d5c449a9785bf59cca13a4705e99086eea54", "title": "FaaSCTDO: Collaborative Task-Data Orchestration for Serverless Workflows"}, {"paperId": "d0f789d8327c54b6b8c5c9fd566206b68d5ac42a", "title": "Storm-RTS: Stream Processing with Stable Performance for Multi-Cloud and Cloud-edge"}, {"paperId": "bc9896690be25bf7decc941bb9e73e9a7e773960", "title": "Behavior Tree-based Workflow Modeling and Scheduling for Serverless Edge Computing"}, {"paperId": "b2ed4f1e1fb4db0109efb782d7ac82470fd0f4f4", "title": "FaaSBatch: Enhancing the Efficiency of Serverless Computing by Batching and Expanding Functions"}, {"paperId": "cfaa41867cf453e1ff4fadda2a9f677a2e4422b8", "title": "DFlow: Efficient Dataflow-based Invocation Workflow Execution for Function-as-a-Service"}, {"paperId": "65ab3724346fdea45ff1c21a3074f0423f1ad65b", "title": "MXFaaS: Resource Sharing in Serverless Environments for Parallelism and Efficiency"}, {"paperId": "28317f0b7c644d3497f316dcacb9cb9f97160acf", "title": "SuperFlow: Performance Testing for Serverless Computing"}, {"paperId": "521a1e6ae144c2cdf94a261f68727ce82d0aa0b8", "title": "Revisiting the Performance of Serverless Computing: An Analysis of Variance"}, {"paperId": "eaa75704962e4d6f72a513598e78c7edd2d3e8cc", "title": "Serverless Edge Computing—Where We Are and What Lies Ahead"}, {"paperId": "1512ba64fc2794d5457e0be3f62d6e49b0cf1f8d", "title": "PrivFlow: Secure and Privacy Preserving Serverless Workflows on Cloud"}, {"paperId": "ec773548104296a3f924fd7f2f439fa79a359ceb", "title": "DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflow Orchestration"}, {"paperId": "11e09c5f1f8e6d0a3a413102bffc7e2120928d0d", "title": "SpecFaaS: Accelerating Serverless Applications with Speculative Function Execution"}, {"paperId": "af2c5ef7d92dac89f05e82ac425484d3b3d1ab64", "title": "OrcBench: A Representative Serverless Benchmark"}, {"paperId": "028d4c5f2c18938af4d45d0ca121680a9c9ccbcc", "title": "This paper is included in the Proceedings of the 21st USENIX Conference on File and Storage Technologies."}, {"paperId": "f6cf95456b67e99a55f3a628e6cb7a2ae36401d0", "title": "BriskChain: Decentralized Function Composition for High-performance Serverless Computing"}, {"paperId": "296ddafcf5b75202046ce1b19272c6d254897d3e", "title": "Resource-Centric Serverless Computing"}, {"paperId": null, "title": "Help Rather Than Recycle: Alleviating Cold Startup in Serverless Computing Through Inter-Function Container Sharing"}, {"paperId": "944cf362c4e421ce3775eb9689c2f4e8504d41d6", "title": "RunD: A Lightweight Secure Container Runtime for High-density Deployment and High-concurrency Startup in Serverless Computing"}, {"paperId": "c65ffadf5400131b11e77ea4c2a469e75c60c2fa", "title": "This paper is included in the Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation"}]}
