{"paperId": "4d1e8d007288823d2fdca8caae152330e8f56ed4", "publicationVenue": {"id": "d4e486b2-e2b5-46b9-9fba-4fa1c5765788", "name": "Siberian Journal of Life Sciences and Agriculture", "type": "journal", "alternate_names": ["Sib J Life Sci Agric"], "issn": "2658-6649", "url": "http://discover-journal.ru/en/"}, "title": "APPLICATION OF BIG DATA TECHNOLOGIES TO ASSESS THE NATURAL MOISTURE OF THE TERRITORY", "abstract": "Due to the sharp changes in climatic conditions in Western Siberia, the most pressing problem is food security associated with forecasting crop yields. There is a need to estimate the natural wetness of the area on the basis of agroclimatic indicators, among which the sum of active air temperatures and precipitation is currently the most widely used. \nBackground. However, for a comprehensive assessment of the wetness of the territory, it is necessary to take into account the climate energy resources associated with evaporation of different time resolutions (day, decades, months, vegetation period, year). The initial meteorological parameters are described in the form of poorly structured information of a large volume. Therefore, various technologies and algorithms of machine processing are used in the work. \nPurpose. The application of big data technologies to assess the natural moisture of the territory \nMaterials and methods.  With the help of the high-level Python programming language and engineering libraries, a comprehensive assessment of the territory was carried out using the example of Mirny of the Kochenevsky District of the Novosibirsk Region in the context of long-term average data and two years 2019 and 2020. That the use of machine processing technologies related to NoSQL data requests, creation of data set and big data slices allows to store and process meteorological parameters using cloud services of different time resolution. This makes it possible to significantly reduce the time for a comprehensive assessment of the territory according to agroclimatic parameters. As a result of the work, precipitation distribution, temperature, relative air humidity, evaporability, humidification coefficients (Ivanov-Vysotsky and Selyaninov hydrothermal coefficient) were obtained. \nResults. The paper proposes to use technologies of big data processing using Python, including pre-processing of poorly structured hydrometeorological data, execution of NoSQL queries, compilation of summary reports on agroclimatic parameters. Pre-processing consists of processing hourly meteorological data, filling gaps in the data, making slices in big data to process multi-temporal queries (day, month, growing season, year). By the example of Mirny farm in Kochenevsky district of Novosibirsk region (Russian Federation), big data processing was performed to calculate agroclimatic parameters to assess the natural moisture content of the area and  yield forecasting. \nConclusion. The practical significance of the work is as follows: \n- the application of big data processing technologies has significantly reduced the time for the labor-intensive process of assessing agrometeorological parameters; \n- obtained aggregated meteorological parameters of different temporal resolution (hours, days, decades, months) allowed us to identify a strong variability of agroclimatic conditions for the territory of Mirny farm Kochenevsky district, located in the forest-steppe zone of Western Siberia; \n- perform an integral assessment of agroclimatic conditions by calculating the integral indices of moisture, climate continentality, and agroclimatic potential.", "venue": "Siberian Journal of Life Sciences and Agriculture", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-30", "journal": {"name": "Siberian Journal of Life Sciences and Agriculture"}, "authors": [{"authorId": "48850135", "name": "A. I. Pavlova"}], "citations": []}
