{"paperId": "4d23b5d9225f86efb56b0241c3a00349a6f51136", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "Detecting and Mitigating Data-Dependent DRAM Failures by Exploiting Current Memory Content", "abstract": "DRAM cells in close proximity can fail depending on the data content in neighboring cells. These failures are called data-dependent failures. Detecting and mitigating these failures online, while the system is running in the field, enables various optimizations that improve reliability, latency, and energy efficiency of the system. For example, a system can improve performance and energy efficiency by using a lower refresh rate for most cells and mitigate the failing cells using higher refresh rates or error correcting codes. All these system optimizations depend on accurately detecting every possible data-dependent failure that could occur with any content in DRAM. Unfortunately, detecting all data-dependent failures requires the knowledge of DRAM internals specific to each DRAM chip. As internal DRAM architecture is not exposed to the system, detecting data-dependent failures at the system-level is a major challenge.In this paper, we decouple the detection and mitigation of data-dependent failures from physical DRAM organization such that it is possible to detect failures without knowledge of DRAM internals. To this end, we propose MEMCON, a memory content-based detection and mitigation mechanism for data-dependent failures in DRAM. MEMCON does not detect every possible data-dependent failure. Instead, it detects and mitigates failures that occur only with the current content in memory while the programs are running in the system. Such a mechanism needs to detect failures whenever there is a write access that changes the content of memory. As detection of failure with a runtime testing has a high overhead, MEMCON selectively initiates a test on a write, only when the time between two consecutive writes to that page (i.e., write interval) is long enough to provide significant benefit by lowering the refresh rate during that interval. MEMCON builds upon a simple, practical mechanism that predicts the long write intervals based on our observation that the write intervals in real workloads follow a Pareto distribution: the longer a page remains idle after a write, the longer it is expected to remain idle. Our evaluation shows that compared to a system that uses an aggressive refresh rate, MEMCON reduces refresh operations by 65-74%, leading to a 10%/17%/40% (min) to 12%/22%/50% (max) performance improvement for a single-core and 10%/23%/52% (min) to 17%/29%/65% (max) performance improvement for a 4-core system using 8/16/32 Gb DRAM chips.CCS CONCEPTS• Computer systems organization $\\rightarrow$ Processors and memory architectures; • Hardware $\\rightarrow$ Dynamic memory;", "venue": "Micro", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2017-10-14", "journal": {"name": "2017 50th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "27-40"}, "authors": [{"authorId": "2251223415", "name": "S. Khan"}, {"authorId": "37811136", "name": "C. Wilkerson"}, {"authorId": "2289189449", "name": "Zhe Wang"}, {"authorId": "1732082", "name": "Alaa R. Alameldeen"}, {"authorId": "48893570", "name": "Donghyuk Lee"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "6ba01138fcabdc9df56e8a69588a82fd91480a63", "title": "Spatial Variation-Aware Read Disturbance Defenses: Experimental Analysis of Real DRAM Chips and Implications on Future Solutions"}, {"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems"}, {"paperId": "ee68d4752c2763650a68d65564ae9eca1b6ba266", "title": "Understanding Read Disturbance in High Bandwidth Memory: An Experimental Analysis of Real HBM2 DRAM Chips"}, {"paperId": "b5ace93de904d7ccebbc328d5fce45c2f8e671bb", "title": "Retrospective: RAIDR: Retention-Aware Intelligent DRAM Refresh"}, {"paperId": "70f2f94f9a2759eb86b0ed1079da0dce468e3f7c", "title": "Retrospective: An Experimental Study of Data Retention Behavior in Modern DRAM Devices: Implications for Retention Time Profiling Mechanisms"}, {"paperId": "ceda5606b2189405adb20b12424e12388acb0a4e", "title": "RowPress: Amplifying Read Disturbance in Modern DRAM Chips"}, {"paperId": "2dfbef5f657e7e53916dc2ed1038abd1e32c43e9", "title": "An Experimental Analysis of RowHammer in HBM2 DRAM Chips"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "7c9b615fe6fc7409b837e2a5cfda1be13e36ef93", "title": "SpyHammer: Using RowHammer to Remotely Spy on Temperature"}, {"paperId": "82796a21a434fd121bee14181930f95e9bb17e36", "title": "Hybrid Refresh: Improving DRAM Performance by Handling Weak Rows Smartly"}, {"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips"}, {"paperId": "f15b80ab5173a9cc3d7dd2353678e617e89bd54e", "title": "Self-Managing DRAM: A Low-Cost Framework for Enabling Autonomous and Efficient in-DRAM Operations"}, {"paperId": "66905bb52c89d44594cf3e87ab23d5aba7ce45aa", "title": "MOESI-prime: preventing coherence-induced hammering in commodity workloads"}, {"paperId": "5f9ba66514be76868e2a2d1c540a858b38ef5000", "title": "Understanding RowHammer Under Reduced Wordline Voltage: An Experimental Study Using Real DRAM Devices"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "00c6c8b3ac452a6710af1fd33011f24da5eccce9", "title": "DR-STRaNGe: End-to-End System Design for DRAM-based True Random Number Generators"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "62bc74c87efc71004c8b0c7e29ecc40d51c68cfd", "title": "A Deeper Look into RowHammer’s Sensitivities: Experimental Analysis of Real DRAM Chips and Implications on Future Attacks and Defenses"}, {"paperId": "3e234d3c5aa3730c05986090b8c42121c90aa4e9", "title": "Uncovering In-DRAM RowHammer Protection Mechanisms:A New Methodology, Custom RowHammer Patterns, and Implications"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "df290e884abe1e7a046b3032291d71f039702cc4", "title": "DRAM Refresh with Master Wordline Granularity Control of Refresh Intervals: Position Paper"}, {"paperId": "f77a451dcd82fb6a35f079ac50bda2dfe3ef31a7", "title": "HARP: Practically and Effectively Identifying Uncorrectable Errors in Memory Chips That Use On-Die Error-Correcting Codes"}, {"paperId": "d441e66baa101273fc5323a1fb05f5141f5a8a51", "title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "304b971520976e3a060abfd23399108434a3308e", "title": "BlockHammer: Preventing RowHammer at Low Cost by Blacklisting Rapidly-Accessed DRAM Rows"}, {"paperId": "f58babc873f629090f213499f3dee18a2c507329", "title": "Intelligent Architectures for Intelligent Computing Systems"}, {"paperId": "db2c7eb1bad3ff523d303cf34a16cfa90fec680d", "title": "Reducing solid-state drive read latency by optimizing read-retry"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "9d86000fa94c0a507e098d323b7ee628123d6e68", "title": "Semiring optimizations: dynamic elision of expressions with identity and absorbing elements"}, {"paperId": "9e5140f40c2dc97eff173fefe9d73337f4a523fc", "title": "FIGARO: Improving System Performance via Fine-Grained In-DRAM Data Relocation and Caching"}, {"paperId": "6679cfabe152f418ea9d32efff4db874886fcfa8", "title": "Bit-Exact ECC Recovery (BEER): Determining DRAM On-Die ECC Functions by Exploiting DRAM Data Retention Characteristics"}, {"paperId": "04621c422475a040e7a661a79559c64531dacc25", "title": "Intelligent Architectures for Intelligent Machines"}, {"paperId": "9f4cada352edb6a2d75bb4be4adb06e5f08bfd10", "title": "Hardware-Accelerated Platforms and Infrastructures for Network Functions: A Survey of Enabling Technologies and Research Studies"}, {"paperId": "3382ae77438d629595e9ea28284d2dce02296aba", "title": "DStress: Automatic Synthesis of DRAM Reliability Stress Viruses using Genetic Algorithms"}, {"paperId": "27a36a87f4d4e468f0c68ac88cdb0e6e03fafcf1", "title": "Generating Representative Test Sequences from Real Workload for Minimizing DRAM Verification Overhead"}, {"paperId": "acdfe34aab867d1a0101c88dba299a56274388d8", "title": "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off"}, {"paperId": "ec6ca596b8a74e2a2c6a525fb9ccd3476c20eb3e", "title": "Revisiting RowHammer: An Experimental Analysis of Modern DRAM Devices and Mitigation Techniques"}, {"paperId": "41e70b64c645693fac4c640a25a77909a32e4b7f", "title": "Robust Machine Learning Systems: Challenges,Current Trends, Perspectives, and the Road Ahead"}, {"paperId": "64de7c5a2434e8293c86dcc223283280a584604c", "title": "Demystifying Complex Workload-DRAM Interactions"}, {"paperId": "2ca11e69ae23eb51cdbc35f9b6a2981b3f5fdc0c", "title": "Refresh Triggered Computation"}, {"paperId": "71c5c13414d177471c7e7e2aa66d0a22b48c3fdb", "title": "Quantifying Memory Underutilization in HPC Systems and Using it to Improve Performance via Architecture Support"}, {"paperId": "07a71a693076560816aa60363667e947ba1c1799", "title": "Innovations in the Memory System"}, {"paperId": "96bdc40b85b9e3dc112fafa6a74fa55422428ea2", "title": "Workload-Aware DRAM Error Prediction using Machine Learning"}, {"paperId": "047238356ae93372a97be3b4cbd36ae6fee71ae5", "title": "Demystifying Complex Workload-DRAM Interactions: An Experimental Study"}, {"paperId": "c1ff8c9052a98fb1f4822577150fde36b8f470a2", "title": "ReTagger: An Efficient Controller for DRAM Cache Architectures"}, {"paperId": "b0197170bd915f3d4060096e5ffd8eed5f14f61f", "title": "CROW: A Low-Cost Substrate for Improving DRAM Performance, Energy Efficiency, and Reliability"}, {"paperId": "de0c0e2df937e6a126f2322ea07d3e36080ed991", "title": "Understanding and Modeling On-Die Error Correction in Modern DRAM: An Experimental Study Using Real Devices"}, {"paperId": "91e028dd30c114f1a0af539cf6ac86c20eda9f73", "title": "In-DRAM Bulk Bitwise Execution Engine"}, {"paperId": "f835e54450463440d0f9e21b1c1874db086fc44c", "title": "RowHammer: A Retrospective"}, {"paperId": "4f17bd15a6f86730ac2207167ccf36ec9e6c2391", "title": "Processing Data Where It Makes Sense: Enabling In-Memory Computation"}, {"paperId": "3f6b5af948806d030b56c0594b385a5cdd1afabc", "title": "Content Aware Refresh: Exploiting the Asymmetry of DRAM Retention Errors to Reduce the Refresh Frequency of Less Vulnerable Data"}, {"paperId": "680daccbd4b662ea8ccba859bd42e4b9df97d27d", "title": "Understanding the Interactions of Workloads and DRAM Types: A Comprehensive Experimental Study"}, {"paperId": "e5dba82ad2ad3e78559ca07940ed67ee3a7f97ec", "title": "Reducing Writebacks Through In-Cache Displacement"}, {"paperId": "4746be9f3fa6d5816438b5a32a2d6db2966d6ee3", "title": "Large Scale Studies of Memory, Storage, and Network Failures in a Modern Data Center"}, {"paperId": "ba825479d564496e664a9d7ec31145f1670da6d5", "title": "Aggressive undervolting of FPGAs : power & reliability trade-offs"}, {"paperId": "c6a7f5b0ef8e0b1f8fe131ad6f146f1fbbab44f7", "title": "Static Prediction of Silent Stores"}, {"paperId": "b5d8306cb9f648b5567b934124010849ba752816", "title": "Reducing DRAM Latency via Charge-Level-Aware Look-Ahead Partial Restoration"}, {"paperId": "6fd3cf784f9608f57a4f9c26ad63d09f1e8419c5", "title": "Solar-DRAM: Reducing DRAM Access Latency by Exploiting the Variation in Local Bitlines"}, {"paperId": "5f64867ae6218e62fe86c2589ddf8c369e7b0b3f", "title": "Defeating Software Mitigations Against Rowhammer: A Surgical Precision Hammer"}, {"paperId": "0a3dd16af1e98459a854b309b33dda53b332e348", "title": "The Processing-in-Memory Paradigm: Mechanisms to Enable Adoption"}, {"paperId": "5535fec7822abc2edc8e4a45df5432426b45e138", "title": "D-RaNGe: Using Commodity DRAM Devices to Generate True Random Numbers with Low Latency and High Throughput"}, {"paperId": "67cd6da17d4f51951d4dbfb3429c82fc77df7c52", "title": "Architectural Techniques for Improving NAND Flash Memory Reliability"}, {"paperId": "0f6e64b74fb20adc53749ca2dfb02332aab3ff3f", "title": "PreLatPUF: Exploiting DRAM Latency Variations for Generating Robust Device Signatures"}, {"paperId": "65fec44db0d1b425fd46a8f01a35ea767dc36337", "title": "Improving 3D NAND Flash Memory Lifetime by Tolerating Early Retention Loss and Process Variation"}, {"paperId": "cc1eff4ad90308ced3d2a89e1d1150ce6bf83a4c", "title": "What Your DRAM Power Models Are Not Telling You"}, {"paperId": "3e75429cdb666eeb7da78c23cf23c515d1df6966", "title": "Nonblocking Memory Refresh"}, {"paperId": "b6388aea4fff822b953a3961d2f0cdfc675a44b8", "title": "VRL-DRAM: Improving DRAM Performance via Variable Refresh Latency"}, {"paperId": "dda7c10868d398a61d113a0671491422b57f9f93", "title": "Characterizing, Exploiting, and Mitigating Vulnerabilities in MLC NAND Flash Memory Programming"}, {"paperId": "6d3fd6c1f6b59c3f041a3bb416dfeb05f80a697e", "title": "Experimental Characterization, Optimization, and Recovery of Data Retention Errors in MLC NAND Flash Memory"}, {"paperId": "12b68cb06efdab086a80c638d21a2927e8d82f59", "title": "SoftMC: Practical DRAM Characterization Using an FPGA-Based Infrastructure"}, {"paperId": "d2177743e33252be186e1fe131389d28fd1dddf9", "title": "Voltron: Understanding and Exploiting the Voltage-Latency-Reliability Trade-Offs in Modern DRAM Chips to Improve Energy Efficiency"}, {"paperId": "305dea0339faabadcd591a31a6ad31e495f5f7d9", "title": "Flexible-Latency DRAM: Understanding and Exploiting Latency Variation in Modern DRAM Chips"}, {"paperId": "01fb05cb6bff252f829ead807251c6329a5f8d0b", "title": "RowClone: Accelerating Data Movement and Initialization Using DRAM"}, {"paperId": "77835f0049433f7f0d1c6c4fb9dbbeebf31b82d0", "title": "Adaptive-Latency DRAM: Reducing DRAM Latency by Exploiting Timing Margins"}, {"paperId": "0cc9f0cf9fb45e57cdfea47f84b20474df4b9c61", "title": "Tiered-Latency DRAM: Enabling Low-Latency Main Memory at Low Cost"}, {"paperId": "a0796edf402715d2f0aae5168c1554ab5ebc26f2", "title": "Reducing DRAM Refresh Overheads with Refresh-Access Parallelism"}, {"paperId": "0ede78b97478b2b4cdd577977541a6bc0134eb7f", "title": "Reactive NaN Repair for Applying Approximate Memory to Numerical Applications"}, {"paperId": "d79366509f04b9188837657d586fbf50b032dd22", "title": "Techniques for Shared Resource Management in Systems with Throughput Processors"}, {"paperId": "0c4fe1f1a8043e8f4175b21faca1b72bff8033e6", "title": "Enabling the Adoption of Processing-in-Memory: Challenges, Mechanisms, Future Research Directions"}, {"paperId": "342ebf89fb87bd271ae3abc4512129f8db4e258d", "title": "The DRAM Latency PUF: Quickly Evaluating Physical Unclonable Functions by Exploiting the Latency-Reliability Tradeoff in Modern Commodity DRAM Devices"}, {"paperId": "ade903df1e67fb59069b51a0a8fc227853a4a8dc", "title": "Errors in Flash-Memory-Based Solid-State Drives: Analysis, Mitigation, and Recovery"}, {"paperId": "ea4c3cda2f27cc9428789321363ba46304635b80", "title": "Error Characterization, Mitigation, and Recovery in Flash-Memory-Based Solid-State Drives"}, {"paperId": "0855d63e5f68930cafd99b8e01472f196829d929", "title": "Heterogeneous-Reliability Memory: Exploiting Application-Level Memory Error Tolerance"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "6b5aaa78041e0a1f1dd1a7e71c6e961ec783d430", "title": "mFIT: A Bump-in-the-Wire Tool for Plug-and-Play Analysis of Rowhammer Susceptibility Factors"}, {"paperId": "8e46cf6a16eb1419b808ba3dda39f764508c62fa", "title": "Reliability Issues in Flash-Memory-Based Solid-State Drives: Experimental Analysis, Mitigation, Recovery"}, {"paperId": "e661d85a60b1d4cb49c0d36770a80402fa95615f", "title": "ARMOR : Towards Restricted Approximation with A Worst-Case Guarantee"}]}
