{"paperId": "4d3435528658805f126ca2e25b893c1115caf6e9", "publicationVenue": null, "title": "Scaling blockchains without giving up decentralization and security: a solution to the blockchain scalability trilemma", "abstract": "Public blockchains should be able to scale with respect to the number of nodes and to the transactions workload. The blockchain scalability trilemma has been informally conjectured. This is related to scalability, security and decentralization, stating that any improvement in one of these aspects should negatively impact on at least one of the other two. In fact, despite the large research and experimental effort, all known approaches turn out to be tradeoffs. We theoretically describe a new blockchain architecture that scales to arbitrarily high workload provided that a corresponding proportional increment of nodes is provisioned. We show that, under reasonable assumptions, our approach does not require tradeoffs on security or decentralization. To the best of our knowledge, this is the first result that disprove the trilemma considering the scalability of all architectural elements of a blockchain and not only the consensus protocol. While our result is currently only theoretic, we believe that our approach may stimulate significant practical contributions.", "venue": "CryBlock@MOBICOM", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-05-13", "journal": {"name": "Proceedings of the 3rd Workshop on Cryptocurrencies and Blockchains for Distributed Systems"}, "authors": [{"authorId": "2080027595", "name": "G. D. Monte"}, {"authorId": "94580478", "name": "Diego Pennino"}, {"authorId": "1721655", "name": "M. Pizzonia"}], "citations": [{"paperId": "cb744211cfc25c476167ee545883151266d9c223", "title": "Large Language Models for Blockchain Security: A Systematic Literature Review"}, {"paperId": "1719198093628b633182bdd7e666f201fe4aaacc", "title": "Is Wireless Bad for Consensus in Blockchain?"}, {"paperId": "1e885c48abbbc031b5af046955ac6000e19a3828", "title": "Proof of Diligence: Cryptoeconomic Security for Rollups"}, {"paperId": "720675d935c99f22ac638dd9d4bb89fe1782edd5", "title": "The Direction of the Cryptocurrency: Current and Future Perspectives"}, {"paperId": "29842be4da786d643d7e41dc1ca8a407a8e7101d", "title": "An Off-Chain-Based Blockchain with Improved Decentralization"}, {"paperId": "6b4897740999c2b7cc3a31b9ccf7c83dbefedca7", "title": "An overview of Web3 Technology: Infrastructure, Applications, and Popularity"}, {"paperId": "3a565b215ca755021eecd1e6b89154f7e676a9f8", "title": "Survey on Integration of Consensus Mechanisms in IoT-based Blockchains"}, {"paperId": "185f45facfd2a4c0e04a0cc97450c042198a8f70", "title": "Optimized Blockchain Sharding Model Based on Node Trust and Allocation"}, {"paperId": "c35c29b96cdd899eaa1cc5f3603a43008d6af101", "title": "GBT-CHAIN: A System Framework for Solving the General Trilemma in Permissioned Blockchains"}, {"paperId": "471ce3627da0621ca7190439148184f09bdc673a", "title": "A survey of state-of-the-art sharding blockchains: Models, components, and attack surfaces"}, {"paperId": "f1c6428d36ce576296eb3e310e4547d53b63da76", "title": "Total Commit and Transaction Off-Chains (TCTOC): A Blockchain Scalability Solution"}, {"paperId": "1594e4ea59017639608a93380d1ca22837444506", "title": "Solving blockchain trilemma using off-chain storage protocol"}, {"paperId": "21ec26f89afb97e0fb3d295e102fa4cb2b239b14", "title": "Critical success factors of Blockchain technology adoption for sustainable and resilient operations in the banking industry during an uncertain business environment"}, {"paperId": "7f7701a525615a1052b7b1c2d38aeec8d6ba8674", "title": "An overview of Web3.0 Technology: Infrastructure, Applications, and Popularity"}, {"paperId": "a653dad33373907c0b9c19eed3a2e851655a5551", "title": "A CoviReader Architecture Based on IOTA Tangle for Outbreak Control in Smart Cities during COVID-19 Pandemic"}, {"paperId": "42b19084b6b12c02a9faac2c4cfc7e15a5461457", "title": "Blockchain Scalability and Security: Communications Among Fast-Changing Committees Made Simple"}, {"paperId": "4cd0e6a22ddf84c44e5d476a00534127db77adcf", "title": "Optimistic and Validity Rollups: Analysis and Comparison between Optimism and StarkNet"}, {"paperId": "e625d041f4609a6eef31b14118b2115da54da6bc", "title": "An Analytic Hierarchy Process for Selection of Blockchain-Based Platform for Product Lifecycle Management"}, {"paperId": "5fdecd879ceda6d02bba34abbb31dad2126aea20", "title": "From Traditional Product Lifecycle Management Systems to Blockchain-Based Platforms"}, {"paperId": "5c385359ae7aef54a544cbaa279106e7c6606f64", "title": "Blockchain and Cryptocurrency in Human Computer Interaction: A Systematic Literature Review and Research Agenda"}, {"paperId": "38ce64e31a54ecc17a3f9690cca2d685a5718861", "title": "Blockchain as IoT Economy Enabler: A Review of Architectural Aspects"}, {"paperId": "9f39ebbf844a39e4804a44bbba7f8b717e5720f9", "title": "Systematic Literature Review of Challenges in Blockchain Scalability"}, {"paperId": "0ff12716ab7bbe38e3af6e38bb2de14dff445a4c", "title": "Empowering citizens by a blockchain-Based Robinson list"}, {"paperId": "8dff863820394e7c15889a519e9ea8c5d493ae19", "title": "Layer 2 Blockchain Scaling: a Survey"}, {"paperId": "1d825e32b2cf93183057afbb4d56b8ba110b19c5", "title": "Descriptor based consensus for blockchain transactions"}, {"paperId": "88e0850303a70b9abfd018ab1c22d1d73b8e94ca", "title": "Resolving the Blockchain Paradox with Dynamic Immutable Smart Contract (DISC)"}, {"paperId": "1d4580b38680999eea275fb7c1aee2c22ca7e0e4", "title": "Hyperinflation, Optimal Currency Scopes, and a Cryptocurrency Alternative to Dollarization"}, {"paperId": "2d96807644cd53b058ffbdef5cee8d042709fc54", "title": "Efficient Certification of Endpoint Control on Blockchain"}, {"paperId": "bbbd70b8457dc54935cb8d55f96857b73c00e0ca", "title": "USBCaptchaIn: Preventing (Un)Conventional Attacks from Promiscuously Used USB Devices in Industrial Control Systems"}, {"paperId": "6c6e8feff4ef1c8f1d3022b07960a7f3bf899be0", "title": "Approaches to Overpower Proof-of-Work Blockchains Despite Minority"}, {"paperId": "e591f743244c5b3dc8b201e16801d2a7c3630218", "title": "Blockchain for Dynamic Spectrum Access and Network Slicing: A Review"}, {"paperId": "66e20b48f0c388ce269a94b821e9a62a787891fd", "title": "A Systematic Review on Blockchain Scalability"}, {"paperId": "9d4567b0fd655782289f1b32a40b6ef5acd9f2f2", "title": "An Off-The-Chain Execution Environment for Scalable Testing and Profiling of Smart Contracts"}, {"paperId": "193fa053f6afa3c7da39c8c90c49745d53088532", "title": "The Blockchain Paradox: Testing the DISC Hypothesis"}]}
