{"paperId": "4d3d1a4022b89454e672383a8e187d855d850303", "publicationVenue": {"id": "be767b53-ec92-42d8-9b36-cebc40671619", "name": "Journal of Micromechanics and Microengineering", "type": "journal", "alternate_names": ["J Micromechanics Microengineering"], "issn": "0960-1317", "url": "http://www.iop.org/EJ/journal/JMM", "alternate_urls": ["http://iopscience.org/jmm", "https://iopscience.iop.org/0960-1317"]}, "title": "A review of geometric and structural design for reliable flexible electronics", "abstract": "Recently, flexible electronics have attracted significant attention as they can be integrated on diverse platforms from curved to flexible surfaces. As flexible electronics are used on a curved surface of wearable or manufacturing devices for health and system monitoring, the working environment of such applications forces electronics to be exposed to diverse stimuli such as deformation, temperature, humidity, and gas, resulting in performance changes. Therefore, rather than research on improving the specific performance of electronics, research on maintaining a stable performance in various environmental stimuli has been receiving tremendous interest. Reflecting the latest research trends, this paper introduces efforts in structural designs heading for both improving and maintaining the performance of flexible electronics in diverse environmental stimuli. Firstly, we will sequentially explain the geometric and structural designs introduced for achieving (a) reliable electronics insensitive to undesired mechanical stimuli, (b) reliable electronics in harsh environments, and (c) flexible electrodes. Also, (d) diverse applications of reliable and flexible electronics are introduced. Finally, a perspective on reliable and flexible electronic devices has been presented for suggesting next-generation research.", "venue": "Journal of Micromechanics and Microengineering", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Review"], "publicationDate": "2021-05-17", "journal": {"name": "Journal of Micromechanics and Microengineering", "volume": "31"}, "authors": [{"authorId": "153790199", "name": "Jae‐Young Yoo"}, {"authorId": "2146221417", "name": "Jae-Soon Yang"}, {"authorId": "1384223911", "name": "Myung-Kun Chung"}, {"authorId": "2118021698", "name": "Sung-Ho Kim"}, {"authorId": "34377744", "name": "Jun‐Bo Yoon"}], "citations": [{"paperId": "4525f928690622422f0e26cad99d37286f3b4fe8", "title": "Highly stretchable, robust, sensitive and wearable strain sensors based on mesh-structured conductive hydrogels"}, {"paperId": "432d5debbc43cc6f8aa619d689ea882447e3a971", "title": "Prediction and Regulation of Delamination at Flexible Film/Finite-Thickness-Substrate Structure Interfaces"}, {"paperId": "ef9787e360fc02e6224122d61c9905bf6cac1a1d", "title": "Creating 3D Objects with Integrated Electronics via Multiphoton Fabrication In Vitro and In Vivo"}, {"paperId": "a6349df756f776662c2fca1c45736cc68db19569", "title": "A Flexible Thin-Film Pressure Sensor Based on Thermal Conduction Mechanism for Pressure, Orientation, and Mapping Signal Acquisition"}, {"paperId": "8646e1cc484851e8c3f4e1b872a2fc6b1a1dae24", "title": "Material Choice and Structure Design of Flexible Battery Electrode"}, {"paperId": "740b2bdb20b9c71326acda4cf8101c8d5db813d8", "title": "Screen-Printed Highly Mechanical and Conductive Flexible Electrodes Based on Chiral Structure with Negative Poisson's Ratio"}, {"paperId": "4ae5c09db7f7d67ef185ff1a4ed2af2413312d18", "title": "Computational Design of Flexible Organic Porous Nanotubes"}, {"paperId": "6120bee0d2eb8c7c1f5a922e55e4c2ed90e6854a", "title": "A Bi2Te3-Filled Nickel Foam Film with Exceptional Flexibility and Thermoelectric Performance"}, {"paperId": "e74390c65ec9134a0bf31fc1bd3565e7f099f412", "title": "Recent advances in the 3D printing of electrically conductive hydrogels for flexible electronics"}]}
