{"paperId": "4d3fb0382d679483570650e091c89a086a585c07", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis", "abstract": "Read mapping is a fundamental, yet computationally-expensive step in many genomics applications. It is used to identify potential matches and differences between fragments (called reads) of a sequenced genome and an already known genome (called a reference genome). To address the computational challenges in genome analysis, many prior works propose various approaches such as filters that select the reads that must undergo expensive computation, efficient heuristics, and hardware acceleration. While effective at reducing the computation overhead, all such approaches still require the costly movement of a large amount of data from storage to the rest of the system, which can significantly lower the end-to-end performance of read mapping in conventional and emerging genomics systems. We propose GenStore, the first in-storage processing system designed for genome sequence analysis that greatly reduces both data movement and computational overheads of genome sequence analysis by exploiting low-cost and accurate in-storage filters. GenStore leverages hardware/software co-design to address the challenges of in-storage processing, supporting reads with 1) different read lengths and error rates, and 2) different degrees of genetic variation. Through rigorous analysis of read mapping processes, we meticulously design low-cost hardware accelerators and data/computation flows inside a NAND flash-based SSD. Our evaluation using a wide range of real genomic datasets shows that GenStore, when implemented in three modern SSDs, significantly improves the read mapping performance of state-of-the-art software (hardware) baselines by 2.07-6.05$\\times$ (1.52-3.32$\\times$) for read sets with high similarity to the reference genome and 1.45-33.63$\\times$ (2.70-19.2$\\times$) for read sets with low similarity to the reference genome.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-21", "journal": {"name": "ArXiv", "volume": "abs/2202.10400"}, "authors": [{"authorId": "1403215560", "name": "Nika Mansouri-Ghiasi"}, {"authorId": "1992941239", "name": "Jisung Park"}, {"authorId": "33145535", "name": "Harun Mustafa"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "2048193264", "name": "Ataberk Olgun"}, {"authorId": "2155488326", "name": "Arvid Gollwitzer"}, {"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "3064097", "name": "Haiyu Mao"}, {"authorId": "2048158626", "name": "N. Alserr"}, {"authorId": "1999972", "name": "Rachata Ausavarungnirun"}, {"authorId": "1920997", "name": "Nandita Vijaykumar"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "87c1cd5f11182a91b46e7cfd0f7ff9da6c4967a6", "title": "PIM-GPT: A Hybrid Process-in-Memory Accelerator for Autoregressive Transformers"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "fad8f862216ddadb49e4bc03f36e1c5a4bc9404e", "title": "Genome-on-Diet: Taming Large-Scale Genomic Analyses via Sparsified Genomics"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "d2d3436259017029bbf084e01626a488b304fe53", "title": "GenStore: In-Storage Filtering of Genomic Data for High-Performance and Energy-Efficient Genome Analysis"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "db2c084e89d4740d84686d5859c2c9440b83cb1d", "title": "MATSA: An MRAM-Based Energy-Efficient Accelerator for Time Series Analysis"}, {"paperId": "e804e5bfe114715af9d77ed27a009b7a894a7ed0", "title": "Taming Large-Scale Genomic Analyses via Sparsified Genomics"}]}
