{"paperId": "4d468c7b4345fcd25d40ca67313a743e6e164444", "publicationVenue": {"id": "0c1420a4-aa9b-44f9-b264-ba3ac5c37050", "name": "International Conference for High Performance Computing, Networking, Storage and Analysis", "alternate_names": ["Int Conf High Perform Comput Netw Storage Anal"], "issn": "2167-4337", "alternate_issns": ["2167-4329"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000729"}, "title": "HGL: Accelerating Heterogeneous GNN Training with Holistic Representation and Optimization", "abstract": "Graph neural networks (GNNs) have shown to significantly improve graph analytics. Existing systems for GNN training are primarily designed for homogeneous graphs. In industry, however, most graphs are actually heterogeneous in nature (i.e., having multiple types of nodes and edges). Existing systems train a heterogeneous GNN (HetGNN) as a composition of homogeneous GNN (HomoGNN) and thus suffer from critical limitations such as lack of memory optimization and limited operator parallelism. To address these limitations, we propose HGL - a heterogeneity-aware system for GNN training. At the core of HGL is an intermediate representation, called HIR, which provides a holistic representation for GNNs and enables cross-relation optimization in HetGNN training. We devise tailored optimizations on HIR, including graph stitching, operator fusion and operator bundling. Compared with DGL and PyG, HGL achieves a speedup from 7 to 22 times for training HetGNNs.", "venue": "International Conference for High Performance Computing, Networking, Storage and Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-01", "journal": {"name": "SC22: International Conference for High Performance Computing, Networking, Storage and Analysis", "pages": "1-15"}, "authors": [{"authorId": "2209344431", "name": "Yuntao Gui"}, {"authorId": "47096554", "name": "Yidi Wu"}, {"authorId": "50841357", "name": "Han Yang"}, {"authorId": "35295263", "name": "Tatiana Jin"}, {"authorId": "2140550986", "name": "Boyang Li"}, {"authorId": "2165760706", "name": "Qihui Zhou"}, {"authorId": "1717691", "name": "James Cheng"}, {"authorId": "2087106044", "name": "Fan Yu"}], "citations": [{"paperId": "5d8d16b2518286351136e01da84bdb773726246c", "title": "GeoT: Tensor Centric Library for Graph Neural Network via Efficient Segment Reduction on GPU"}, {"paperId": "49063129a89fa9637105c646ee0e1ec36e91d18d", "title": "HiHGNN: Accelerating HGNNs through Parallelism and Data Reusability Exploitation"}, {"paperId": "3229291b9b7e9a7200b543089e05a4442cbe6a9b", "title": "Scalable and Efficient Full-Graph GNN Training for Large Graphs"}, {"paperId": "460fc9c30d825459b264e9fe247c2345925fdd06", "title": "PIGEON: Optimizing CUDA Code Generator for End-to-End Training and Inference of Relational Graph Neural Networks"}]}
