{"paperId": "4d4f997beacc512dadaddc8d2147cb80be5eee39", "publicationVenue": null, "title": "Analysis of energy consumption in a wireless sensor network using fuzzy memberships function", "abstract": "The use of sensors in every application as well as in today’s life has become a huge demand. Since that, the public sphere is starting to move to mobile applications that are easy to access. For example, child monitoring at school, health monitoring, tracking system, fire detection and so on. Thus, the Wireless Sensor Network (WSN) is the preferred choice to meet these needs. However, despite the enthusiasm of building various applications using sensors, the WSN itself is still hampered by limited battery usage. Due to some applications that require long battery life, various types of research have been conducted to address this problem. One of these is the involvement of artificial intelligent (AI) in extending the life of a battery on a sensor. Fuzzy Logic (FL) is one of the preferred AI that have been chosen by researchers to be implemented with WSN especially to protract the lifetime of WSN. In Fuzzy Logic, there are three membership functions that need to investigate the capability of it towards the WSN applications. The proposed approach is by combining different types of Fuzzy Logic membership functions which are Triangular with Gaussian, Gaussian with Trapezoidal and Trapezoidal with Triangular to get the best results for analysing the use of sensor batteries. The parameters involved for the cluster head selection are communication cost, centrality and residual energy as Fuzzy inputs. This approach will use an existing algorithm which is Multi-Tier Algorithm (MAP) and this is a part of the MAP enhancement towards the WSN lifetime. The results will compare, discuss and analyst the number of dead nodes and energy usage of the sensor node during data transmission. In conclusion, through this approach, it able to prolong the lifetime for the sensor network since the proposed technique can reduce the energy usage of the sensor nodes.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2020-06-09", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "769"}, "authors": [{"authorId": "2178000618", "name": "Wan Isni Sofiah Wan Din"}, {"authorId": "19788880", "name": "Mritha Ramalingam"}, {"authorId": "2143201762", "name": "Nuramera Abdullah"}], "citations": []}
