{"paperId": "4d50f4a680c5a415815e79d5c9fee03851431f6d", "publicationVenue": {"id": "0ed0ece3-f3ec-4835-aaab-1d840a580c55", "name": "Computer systems science and engineering", "type": "journal", "alternate_names": ["Comput Syst Sci  Eng", "Computer Systems: Science & Engineering", "Comput syst sci eng"], "issn": "0267-6192"}, "title": "Energy-Aware Scheduling for Tasks with Target-Time in Blockchain based Data Centres", "abstract": "Cloud computing infrastructures have intended to provide computing services to end-users through the internet in a pay-per-use model. The extensive deployment of the Cloud and continuous increment in the capacity and utilization of data centers (DC) leads to massive power consumption. This intensifying scale of DCs has made energy consumption a critical concern. This paper emphasizes the task scheduling algorithm by formulating the system model to minimize the makespan and energy consumption incurred in a data center. Also, an energyaware task scheduling in the Blockchain-based data center was proposed to offer an optimal solution that minimizes makespan and energy consumption. The established model was analyzed with a target-time responsive precedence scheduling algorithm. The observations were analyzed and compared with the traditional scheduling algorithms. The outcomes exhibited that the developed solution incurs better performance with a response to resource utilization and decreasing energy consumption. The investigation revealed that the applied strategy considerably enhanced the effectiveness of the designed schedule.", "venue": "Computer systems science and engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Comput. Syst. Sci. Eng.", "pages": "405-419", "volume": "40"}, "authors": [{"authorId": "51207745", "name": "I. Devi"}, {"authorId": "1719520", "name": "G. R Karpagam"}], "citations": [{"paperId": "f2b0d7f1bdcf98d8f50b4dabed337118edf04a65", "title": "Bio-Inspired Algorithm Based Undersampling Approach and Ensemble Learning for Twitter Spam Detection"}, {"paperId": "b61e3a8fdf2cb9d90b67e5407828de31091767d2", "title": "Large-Scale Data Intensive Heterogeneous Task Scheduling Method Based on Parallel GATS-TS Algorithm"}]}
