{"paperId": "4d69e48d11c5c5211684d1ec02dc192d2580f51f", "publicationVenue": {"id": "de91b0ef-303f-41dc-8b69-a5a170fe511e", "name": "Pollutants", "type": "journal", "issn": "2673-4672", "url": "https://www.mdpi.com/journal/pollutants"}, "title": "Natural Hazard Impact in Protected Areas for Resilience Management: The Case of Wildfires in the Basilicata Region", "abstract": "Wildfires represent a significant threat to protected areas around the world. This threat has become even more pronounced in recent years due to climate change. These fires can destroy, among other things, natural habitats, cause a loss of biodiversity, and affect air quality. In addition, they can have a significant economic impact on countries that depend on tourism and protected area activities. In this context, Geographic Information Systems (GIS) can provide an important solution for fire management in protected areas. In this case study, the Basilicata region (Southern Italy) was taken as an example where data on protected areas and fire events are freely accessible and constantly updated. By exploiting several interoperable GIS tools, it was possible to perform a complex geospatial analysis that provided important information for sustainable and resilient land use planning. In particular, areas with the highest frequency of fires within or close to protected areas emerged, which can therefore be attended to at different planning levels. In addition, in general, the work has made it possible to implement simple methodologies of relational analysis between fires and protected areas that can be easily employed in administrative settings so as to make the territory more resilient to the expected increase in fires due to climatic changes.", "venue": "Pollutants", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-28", "journal": {"name": "Pollutants"}, "authors": [{"authorId": "40394783", "name": "G. Cillis"}, {"authorId": "1922194", "name": "A. Lanorte"}, {"authorId": "150333964", "name": "V. Santarsiero"}, {"authorId": "2242834", "name": "G. Nolè"}], "citations": [{"paperId": "ac5883635be3ec49c5352c29ef9937cab27921eb", "title": "Caring for the forests of an inland area in the era of climate change: a case study of Basilicata, Southern Italy"}]}
