{"paperId": "4d6fbe1366407d0e58ffa4af5b529929dd611be8", "publicationVenue": null, "title": "CFS: A Distributed File System for Large Scale Container Platforms", "abstract": "We propose CFS, a distributed file system for large scale container platforms. CFS supports both sequential and random file accesses with optimized storage for both large files and small files, and adopts different replication protocols for different write scenarios to improve the replication performance. It employs a metadata subsystem to store and distribute the file metadata across different storage nodes based on the memory usage. This metadata placement strategy avoids the need of data rebalancing during capacity expansion. CFS also provides POSIX-compliant APIs with relaxed semantics and metadata atomicity to improve the system performance. We performed a comprehensive comparison with Ceph, a widely-used distributed file system on container platforms. Our experimental results show that, in testing 7 commonly used metadata operations, CFS gives around 3 times performance boost on average. In addition, CFS exhibits better random-read/write performance in highly concurrent environments with multiple clients and processes.", "venue": "SIGMOD Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-06-25", "journal": {"name": "Proceedings of the 2019 International Conference on Management of Data"}, "authors": [{"authorId": "2109496932", "name": "Haifeng Liu"}, {"authorId": "2113832553", "name": "Wei Ding"}, {"authorId": "2144033893", "name": "Yuan Chen"}, {"authorId": "47032874", "name": "Weilong Guo"}, {"authorId": "2108062779", "name": "Shuoran Liu"}, {"authorId": "2157466130", "name": "Tianpeng Li"}, {"authorId": "2112104758", "name": "Mofei Zhang"}, {"authorId": "2139359709", "name": "Jianxing Zhao"}, {"authorId": "2149671223", "name": "Hongyin Zhu"}, {"authorId": "2118933562", "name": "Zhengyi Zhu"}], "citations": [{"paperId": "b582117a278f54acf1e0623ff51bf9a8e21afbc9", "title": "Shabari: Delayed Decision-Making for Faster and Efficient Serverless Functions"}, {"paperId": "2158b11b6896ab6d334264b34072085277ea2b59", "title": "MUSE: A Programmable Metadata Load Estimation Interface for Ceph File System"}, {"paperId": "8aa4e459fa9076fe75019137ac2cfc28f4c4f000", "title": "An optimized learning-based directory placement policy with two-rounds selection in distributed file systems"}, {"paperId": "f1fc8569dc042852c092a2a451a7911d3eeea61a", "title": "Low-Latency and Scalable Full-path Indexing Metadata Service for Distributed File Systems"}, {"paperId": "cf5f4cdf1556a7c6f3147bb644743c0bf0432228", "title": "Semi-shadow file system: An anonymous files storage solution"}, {"paperId": "8d1c18b6cc866fc65dc9face198d79c07de4a902", "title": "Block-Level Image Service for the Cloud"}, {"paperId": "50afc14226af83b4fc4276601bb310cc8627665b", "title": "Objcache: An Elastic Filesystem over External Persistent Storage for Container Clusters"}, {"paperId": "90f2cbe95586a1dbb7a8caa710bad3fa321d7730", "title": "On-demand Container Loading in AWS Lambda"}, {"paperId": "6ba83036b89b099ec6e775940a8da76f7a6225d8", "title": "CFS: Scaling Metadata Service for Distributed File System via Pruned Scope of Critical Sections"}, {"paperId": "d9070102fa1d44cf2214f80fb88e05e7b0569c93", "title": "TEES: topology-aware execution environment service for fast and agile application deployment in HPC"}, {"paperId": "c423df1bd716ca5b6b6e302ae801e18fa7f5285b", "title": "FaaSNet: Scalable and Fast Provisioning of Custom Serverless Container Runtimes at Alibaba Cloud Function Compute"}, {"paperId": "774f9c8a81ab7297e250451b4511e9c0fe9e71b0", "title": "Research and improvement of cloud storage for massive small files"}, {"paperId": "0f9555314d1bda6efa147dfb97565b4383340e53", "title": "Piniverse: A Versatile AI-Powered Framework for Streamlining Digital Content Interaction and Empowering User Creativity"}, {"paperId": "c586e9e7481e8b67d50a3b72abf48a9f395f3d02", "title": "The State of the Art of Metadata Managements in Large-Scale Distributed File Systems Scalability, Performance and Availability"}, {"paperId": "2765caa1dc30e05ffbbf9e1ddb68bea94457e5b4", "title": "DADI: Block-Level Image Service for Agile and Elastic Application Deployment"}, {"paperId": "febbe50d95e27e99c46a0d431dffd371203e57a4", "title": "This paper is included in the Proceedings of the 2023 USENIX Annual Technical Conference."}]}
