{"paperId": "4d7fb25a7f9c37f7192ccf459c1782ddeca54041", "publicationVenue": null, "title": "Hold On and Swipe: A Touch-Movement Based Continuous Authentication Schema based on Machine Learning", "abstract": "In recent years, the amount of secure information being stored on mobile devices has grown exponentially. However, current security schemas for mobile devices such as physiological biometrics and passwords are not secure enough to protect this information. Behavioral biometrics have been heavily researched as a possible solution to this security deficiency for mobile devices. This study aims to contribute to this innovative research by evaluating the performance of a multi-modal behavioral biometric based user authentication scheme using touch dynamics and phone movement. This study uses a fusion of two popular publicly available datasets - the Hand Movement Orientation and Grasp (HMOG) dataset and the BioIdent dataset. This study evaluates our model's performance using three common machine learning algorithms; Random Forest, Support Vector Machine, and K-Nearest Neighbor reaching accuracy rates as high as 82%, with each algorithm performing respectively for all success metrics reported.", "venue": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-01-21", "journal": {"name": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "pages": "442-447"}, "authors": [{"authorId": "51288952", "name": "Rushit Dave"}, {"authorId": "1809915", "name": "Naeem Seliya"}, {"authorId": "2132910527", "name": "Laura Pryor"}, {"authorId": "117565513", "name": "Mounika Vanamala"}, {"authorId": "146583111", "name": "E. S. Boone"}, {"authorId": "2150912237", "name": "Jacob Mallet"}], "citations": [{"paperId": "54e0a5eba5fa59b83122229f6ea3d83faa594648", "title": "Your device may know you better than you know yourself - continuous authentication on novel dataset using machine learning"}, {"paperId": "da0525403be43059c298e37613036c3d76899cba", "title": "Software Repositories and Machine Learning Research in Cyber Security"}, {"paperId": "e2f5cb9b91fe6eacde5f0c588c5349b4cf4d7e62", "title": "Secure Arcade: A Gamified Defense Against Cyber Attacks"}, {"paperId": "330ac0be13b4b606e08ef12380f0a3bd90bcfe0b", "title": "Using Machine Learning To Identify Software Weaknesses From Software Requirement Specifications"}, {"paperId": "f431aa80c4d902860087ef76e4fbced1075b4dc4", "title": "Your Identity is Your Behavior - Continuous User Authentication based on Machine Learning and Touch Dynamics"}, {"paperId": "5dcdf512fba332065b2800eea772c5aa89bb73e4", "title": "Hybrid Deepfake Detection Utilizing MLP and LSTM"}, {"paperId": "b03479191a3f6e5223475487af6ff4e88113f2d8", "title": "Leveraging Deep Learning Approaches for Deepfake Detection: A Review"}, {"paperId": "f7662ad3dce1c3ef71d55af37fcd22f0e261e5e2", "title": "Machine Learning Based Approach to Recommend MITRE ATT&CK Framework for Software Requirements and Design Specifications"}, {"paperId": "7181e714ff865b51f961b6bb73ac9bb8cd35c42c", "title": "Deepfake Detection Analyzing Hybrid Dataset Utilizing CNN and SVM"}, {"paperId": "d2fe2cb20f42fd0f6fb55cc4ba04876f631af87f", "title": "An Examination on Implementation of Deep Fake in Images Through Deep Learning"}, {"paperId": "eba3b43c7e9ae06a5542f60d1e6abbc7e8a18db5", "title": "Keystroke and swipe biometrics fusion to enhance smartphones authentication"}, {"paperId": "b28c05377b68f1b291b8555507ea67fa5b33bcb4", "title": "Continuous User Authentication Using Machine Learning and Multi-finger Mobile Touch Dynamics with a Novel Dataset"}, {"paperId": "fd1e414ed6ec99e229be71391c827ad1449d88a3", "title": "Using Deep Learning to Detecting Deepfakes"}, {"paperId": "f033c9e2bfa81df46e4165d824edb9baf8d07cd7", "title": "Mitigating Presentation Attack using DCGAN and Deep CNN"}, {"paperId": "81e04590b372c21dd8a63a0c14c27eb8821fadb9", "title": "Evaluation of a User Authentication Schema Using Behavioral Biometrics and Machine Learning"}, {"paperId": "23e2ca11cad86b350e3168850b180d865b234b0b", "title": "A Close Look into Human Activity Recognition Models using Deep Learning"}, {"paperId": "6d07a53f872e8631eda3e911978931ddfa59929d", "title": "Exploration of Machine Learning Classification Models Used for Behavioral Biometrics Authentication"}, {"paperId": "788e7502e528d34269fee55cdc1456330b5c36b6", "title": "Study on the Implementation of Multimodal Continuous Authentication in Smartphones: A Systematic Review"}, {"paperId": "a68d3fb055b63cf98abc9ff0da91f61483dece94", "title": "Article Title: From Clicks to Security: Investigating Continuous Authentication via Mouse Dynamics"}]}
