{"paperId": "4d8463d86b57135c73edfbf37eab706f7d88f29a", "publicationVenue": {"id": "43832dae-bddd-4002-9b5f-a11440fe6909", "name": "International Conference on the Digital Society", "type": "conference", "alternate_names": ["International Conference on Data Science", "Int Conf Data Sci", "International Conference Data Science", "ICDS", "Int Conf Digit Soc"], "url": "http://www.wikicfp.com/cfp/program?id=1339"}, "title": "Grid Based approach (GBA): a new approach based on the grid-clustering algorithm to solve a CPP type problem for air surveillance using UAVs", "abstract": "Air surveillance over large area using UAVs (Unmanned Aerial Vehicles) -also called drones- requires good planning. This kind of problem is classified as a CPP (Coverage Path Planing) problem which aims at finding a mission plan for the UAVs to cover the zone of interest. This type of problem is difficult because it relates to contradictory or combinatorial optimization problems. Therefor we need to find a heuristic solution. This zone is too large for one drone in a mission to reach and scan, thus it must be partitioned to small parts. This partitioning task must maximize each little part while respecting the performance constraints of the UAV. In this article we discuss a new approach called GBA (Grid Based Approach) different from the PGA (Point Gathering Approach) that we proposed in an earlier work. The GBA approach models the mission environment in a grid of points, each point is defined by its longitude, altitude and the obligation to reach that point expressed by a priority value limited between 0 and 100. Then it uses the grid-clustering algorithm to divide the whole zone in such a way to maximize the sum of the priorities of each partition (referred as gain). Finally we will compare the GBA and PGA approaches. In terms of time consumption, the GPA gives better results than PGA.", "venue": "International Conference on the Digital Society", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-10-21", "journal": {"name": "2020 Fourth International Conference On Intelligent Computing in Data Sciences (ICDS)", "pages": "1-5"}, "authors": [{"authorId": "134865931", "name": "Wassim Khiati"}, {"authorId": "101710748", "name": "Younes Moumen"}, {"authorId": "2114625840", "name": "Ali El Habchi"}, {"authorId": "134123398", "name": "Ilham Zerrouk"}, {"authorId": "10383009", "name": "Jamal Berrich"}, {"authorId": "1784078", "name": "T. Bouchentouf"}], "citations": [{"paperId": "bc2a17ec2f21dbf2b8195caecbb9cb5b5add0463", "title": "DRL-UTPS: DRL-Based Trajectory Planning for Unmanned Aerial Vehicles for Data Collection in Dynamic IoT Network"}]}
