{"paperId": "4d8a8fd97601a82653176370f1ad7b2df7029205", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "A Space-Time Framework for Sentiment Scope Analysis in Social Media", "abstract": "The concept of scope was introduced in Social Network Analysis to assess the authoritativeness and convincing ability of a user toward other users on one or more social platforms. It has been studied in the past in some specific contexts, for example to assess the ability of a user to spread information on Twitter. In this paper, we propose a new investigation on scope, as we want to assess the scope of the sentiment of a user on a topic. We also propose a multi-dimensional definition of scope. In fact, besides the traditional spatial scope, we introduce the temporal one, which has never been addressed in the literature, and propose a model that allows the concept of scope to be extended to further dimensions in the future. Furthermore, we propose an approach and a related set of parameters for measuring the scope of the sentiment of a user on a topic in a social network. Finally, we illustrate the results of an experimental campaign we conducted to evaluate the proposed framework on a dataset derived from Reddit. The main novelties of this paper are: (i) a multi-dimensional view of scope; (ii) the introduction of the concept of sentiment scope; (iii) the definition of a general framework capable of analyzing the sentiment scope related to any subject on any social network.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-03", "journal": {"name": "Big Data Cogn. Comput.", "pages": "130", "volume": "6"}, "authors": [{"authorId": "50147365", "name": "Gianluca Bonifazi"}, {"authorId": "2162511", "name": "Francesco Cauteruccio"}, {"authorId": "1644042132", "name": "Enrico Corradini"}, {"authorId": "2164109404", "name": "Michele Marchetti"}, {"authorId": "2189836965", "name": "Luigi Sciarretta"}, {"authorId": "2187629498", "name": "Domenico Ursino"}, {"authorId": "66059197", "name": "L. Virgili"}], "citations": [{"paperId": "52cf08e7ae9e349d0c28fcc68765e6873ba8f7b8", "title": "A comprehensive loss analysis-based decision support method for e-democratic multi-agent cooperative decision-making"}, {"paperId": "05eb4c5f9e4d9bc5de26bfa55b5c9d8c23bcd5ca", "title": "Analyzing Public Sentiment Towards Islamic Finance Through Social Media: Using Sentiment Analysis on Twitter Data"}, {"paperId": "0e613354241568766bef3bf60dff7cad1ee6b529", "title": "Analyzing public sentiments on the Cullen Commission inquiry into money laundering: harnessing deep learning in the AI of Things Era"}, {"paperId": "80353ef93c11461730ec5f5c3f4c22f5af0c2b33", "title": "Sentiment Analysis of Arabic Course Reviews of a Saudi University Using Support Vector Machine"}, {"paperId": "297060173f6dcb405fb83fc13f185a9e20e44236", "title": "A Dynamic Monitoring Method of Public Opinion Risk of Overseas Direct Investment—Based on Multifractal Situation Optimization"}, {"paperId": "8332b08173c666eb75bee0ea9960c3a296a5ab27", "title": "A Social Recommendation Model Based on Basic Spatial Mapping and Bilateral Generative Adversarial Networks"}, {"paperId": "9fbdf7f6e595bc649076ed9014bf6d144c3309e7", "title": "A Study on Influential Features for Predicting Best Answers in Community Question-Answering Forums"}, {"paperId": "577ebf34eef79357df6d40792dad5e2f21331b96", "title": "Stylometric Fake News Detection Based on Natural Language Processing Using Named Entity Recognition: In-Domain and Cross-Domain Analysis"}, {"paperId": "386ad2bbe27f9fd1f22617820a2a1b36002cc474", "title": "Analyzing Sentiments Regarding ChatGPT Using Novel BERT: A Machine Learning Approach"}, {"paperId": "1aafba94a9078f0499b03a5bd50553e849449b7e", "title": "Multimodal Sentiment Analysis in Realistic Environments Based on Cross-Modal Hierarchical Fusion Network"}, {"paperId": "e5b03c0817b485fd432fc3121b3b3add624d3fe3", "title": "Adaptive Spatial–Temporal and Knowledge Fusing for Social Media Rumor Detection"}, {"paperId": "46952eddc5964b6decfcb914a4d4a9930d2a5b3f", "title": "Rumor Detection in Social Media Based on Multi-Hop Graphs and Differential Time Series"}, {"paperId": "19d296a71b4fb8df97dd7d51da8204608703d5a9", "title": "Sentiment Analysis on Online Videos by Time-Sync Comments"}, {"paperId": "06e39008d26cdfc709457cd59b9496d3ea7d5bff", "title": "Topic Discovery and Hotspot Analysis of Sentiment Analysis of Chinese Text Using Information-Theoretic Method"}, {"paperId": "0a2a2a9626dffdb51c6e4cf71eab43fdabe02e66", "title": "Physical Mechanism of One-Photon Absorption, Two-Photon Absorption, and Electron Circular Dichroism of 1,3,5 Triazine Derivatives Based on Molecular Planarity"}, {"paperId": "1c9da5a50d6a646864496ad4e08bf7ba0352c396", "title": "Exploring the Evolution of Sentiment in Spanish Pandemic Tweets: A Data Analysis Based on a Fine-Tuned BERT Architecture"}, {"paperId": "201971aebcd7797e0093e47f1d5d00e264ba5284", "title": "Opinion Formation on Social Networks - The Effects of Recurrent and Circular Influence"}, {"paperId": "70fae9b19c273838ecc3d8d71edbf3ab58803bfb", "title": "A Knowledge Representation System for the Indian Stock Market"}, {"paperId": "1fd67263900d36942b988f68b627e7889c97848d", "title": "Modeling, Evaluating, and Applying the eWoM Power of Reddit Posts"}]}
