{"paperId": "4d914f48e07db44649715cef74f2cb0a58d2265b", "publicationVenue": {"id": "09a9a95a-1083-47c8-b5c2-713bf81b0a2e", "name": "International Conference on Smart Media and Applications", "type": "conference", "alternate_names": ["Int Conf Shape Model Appl", "SMA", "International Conference on Shape Modeling and Applications", "Int Conf Smart Media Appl"]}, "title": "SLA-Aware Adaptive Mapping Scheme in Bigdata Distributed Storage Systems", "abstract": "As data are processed by diverse clients ranging from urgent time-critical to best-effort, supporting different QoS (Quality of Service) becomes a vital component in a distributed storage system. In this paper, we propose a novel SLA (Service Level Agreement)-aware adaptive mapping scheme that can differentiate between urgent and normal clients based on their I/O requirements. The scheme basically divides storage into two regions, normal and urgent, which makes it feasible to isolate urgent clients from normal ones. In addition, it changes the size of the isolated region in an adaptive manner so that it can provide better performance to normal clients. Besides, we devise two techniques, called logical cluster and normal inclusion, to prevent interference caused by adaptability. We implement our scheme using the CRUSH (Controlled Replication Under Scalable Hashing) mapping algorithm in Ceph, a well-known distributed storage system. Evaluation results demonstrate that our proposal can comply with SLA requirements while providing better performance than the fixed mapping scheme.", "venue": "International Conference on Smart Media and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-09-17", "journal": {"name": "The 9th International Conference on Smart Media and Applications"}, "authors": [{"authorId": "2087467797", "name": "Sopanhapich Chum"}, {"authorId": "1689391", "name": "Jongmoo Choi"}, {"authorId": "46276596", "name": "J. Li"}, {"authorId": "2908853", "name": "Heekwon Park"}], "citations": [{"paperId": "70aa44a5690f0fc068e8a4b14b53752708e17357", "title": "Supporting SLA via Adaptive Mapping and Heterogeneous Storage Devices in Ceph"}]}
