{"paperId": "4d9199b873b24ff2b1ad5552b0655858979e975c", "publicationVenue": {"id": "5a6bfc5a-e695-48df-a089-da329e985d87", "name": "Occupational Therapy International", "type": "journal", "alternate_names": ["Occup Ther Int"], "issn": "0966-7903", "url": "https://www.hindawi.com/journals/oti/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15570703", "https://www.hindawi.com/journals/oti/contents/", "http://www3.interscience.wiley.com/journal/112094317/home"]}, "title": "Research on Public Administration and Resource Allocation Based on Blockchain and Structured Occupational Therapy", "abstract": "In order to explore the public administration and resource allocation based on blockchain and structured occupational therapy, this paper takes the public affairs in the prevention and control of the Corona Virus Disease 2019 (COVID-19) epidemic as an example to conduct research. On the basis of summarizing and analyzing the previous published literatures, this study expounded the research status and significance of public administration and resource allocations; elaborated the development background, current status and future challenges of blockchain, and structured occupational therapy; introduced the methods and principles of data quality collaboration model and multiparty collaboration standard management; analyzed the case background of public administration and resource allocation in the prevention and control of the COVID-19 epidemic; discussed the public administration mechanism based on blockchain and structured occupational therapy; established a resource allocation method based on blockchain and structured occupational therapy; fathomed the role of the distributed ledger established by blockchain to increase the information symmetry of public administration activities; proposed a blockchain-established special machine trust for resource allocation; and finally, anatomized the data security sharing and access control mechanism based on blockchain and structured occupational therapy. The research results show that the public administration and resource allocation in this paper can effectively realize the data integration of the whole process and all departments and show the whole data and realize the traceability of the whole process. The blockchain revolutionizes the hierarchical leadership method of traditional resource allocation, shortens the distance between superiors and subordinates, makes information dissemination more fluent, and handles things more efficiently, making resource allocation ultimately form a flatter organization structure. In the original trust system of resource allocation, the blockchain and structured occupational therapy realizes the reconstruction of the trust system by preventing information tampering, using information encryption technology, and using information traceability technology. The results of this paper provide a reference for further research on the public administration and resource allocation based on blockchain and structured occupational therapy.", "venue": "Occupational Therapy International", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-11", "journal": {"name": "Occupational Therapy International", "volume": "2022"}, "authors": [{"authorId": "2152206725", "name": "Qi Zhu"}], "citations": [{"paperId": "44694c09043d2b3d45b94afcb4112cc92ab86154", "title": "The Role of Public Administration in Improving the Quality of Education Services in Primary Schools"}, {"paperId": "21ac60677235f31374e12d84a44fc322708af02b", "title": "Retracted: Research on Public Administration and Resource Allocation Based on Blockchain and Structured Occupational Therapy"}]}
