{"paperId": "4da404f1b5093b3b7cf182728063082691b78d77", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Real-Time Patient Indoor Health Monitoring and Location Tracking with Optical Camera Communications on the Internet of Medical Things", "abstract": "Optical Camera Communication (OCC) is an emerging technology that has attracted research interest in recent decades. Unlike previous communication technologies, OCC uses visible light as the medium to transmit data from receivers and cameras to receive the data. OCC has several advantages that can be capitalized in several implementations. However, the Internet of Things (IoT) has emerged as a technology with immense potential. Numerous research endeavors support the IoT’s prospective technology that can be implemented in various sectors, including the healthcare system. This study introduces a novel implementation of the Internet of Medical Things (IoMT) system, using OCC for real-time health monitoring and indoor location tracking. The innovative system uses standard closed-circuit television CCTV setups, integrating deep learning-based OCC to monitor multiple patients simultaneously, each represented by an LED matrix. The effectiveness of the system was demonstrated through two scenarios: the first involves dual transmitters and a single camera, highlighting real-time monitoring of vital health data; the second features a transmitter with dual cameras, focusing patient movement tracking across different camera fields of view. To accurately locate and track the position of LED arrays in the camera, the system used YOLO (You Only Look Once). Data are securely transmitted to an edge server and stored using the REST API, with a web interface providing real-time patient updates. This study highlights the potential of OCC in IoMT for advanced patient care and proposes future exploration in larger healthcare systems and other IoT domains.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-30", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2158297489", "name": "Herfandi Herfandi"}, {"authorId": "2147019501", "name": "Ones Sanjerico Sitanggang"}, {"authorId": "2280408984", "name": "Muhammad Rangga Aziz Nasution"}, {"authorId": "146917845", "name": "Huy Nguyen"}, {"authorId": "2237873207", "name": "Yeong Min Jang"}], "citations": []}
