{"paperId": "4dad00ebe7803b9fac6cbb0e542c4de4f5779c12", "publicationVenue": null, "title": "Adaptive Pronunciation Proofreading of Spoken English in a Wireless Sensor Network Environment", "abstract": "This paper presents an in-depth study and analysis of adaptive proofreading of spoken English pronunciation in a wireless sensor network environment. This paper addresses the above problem by combining two common methods for controlling the transmission rate of sensing nodes maximizing network utility algorithm and congestion control mechanism. Firstly, the transmission rate of one-hop nodes at a distance from the aggregation node is dynamically adjusted by the increasing exploration algorithm under the premise of unknown link transmission capacity, while the transmission rate of one-hop nodes is proportionally allocated to multihop nodes in multihop nodes by the congestion control mechanism based on the average reception success rate of the link. A design framework for a speech recognition system with complementary offline recognition and online recognition based on the C/S model is proposed, and a speech recognition system in swarm intelligence awareness is implemented based on the Sphinx engine. The client side implements the speech recognition of decoder in the offline state, and the server side provides the functions of recognition consistency detection, model adjustment training, monitoring, and recommendation in the online state as well as the interface for external access. The scene adaptation module effectively improves the speech recognition system’s speech recognition correct rate under different scenes, and the discourse topic recognition module verifies the recognition effectiveness of the speech recognition system under different discourse topics, which can meet the requirements of users’ personalized speech input.", "venue": "J. Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-22", "journal": {"name": "J. Sensors", "pages": "1-11", "volume": "2021"}, "authors": [{"authorId": "47569579", "name": "Shufang Yang"}, {"authorId": "2119137565", "name": "Junying Lv"}], "citations": []}
