{"paperId": "4db4dc7c18b5c86e06556f4cd0b028d452dd6b79", "publicationVenue": {"id": "7dca74ab-1f45-4640-8345-73db5a41d0fa", "name": "Discrete Dynamics in Nature and Society", "type": "journal", "alternate_names": ["Discret Dyn Nat Soc"], "issn": "1026-0226", "url": "https://www.hindawi.com/journals/ddns/", "alternate_urls": ["http://www.hindawi.com/journals/ddns/index.html", "https://www.hindawi.com/journals/ddns/2014/101965/"]}, "title": "Analysis and Identification of Students with Financial Difficulties: A Behavioural Feature Perspective", "abstract": "The identification of students with financial difficulties is one of the main problems in campus data research. Effective and timely identification not only provides convenience to campus administrators but also helps students who are really in financial hardship. The popular using of smart cards makes it possible to identify students with financial difficulties through big data. In this paper, we collect behavioural records from undergraduate students’ smart cards and propose five features by which to associate with students’ poverty level. Based on these features, we proposed the Apriori Balanced Algorithm (ABA) to mine the relationship of poverty level with students’ daily behaviour. Association rules show that students’ poverty level is most closely related to their academic performance, followed by consumption level, diligence level, and life regularity. Finally, we adopted the semisupervised K-means algorithm to more accurately find out students with financial difficulties. Tested by classical classification algorithms, our method has a higher identification rate, which is helpful for university administrators discover students in real financial hardship effectively.", "venue": "Discrete Dynamics in Nature and Society", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-06-28", "journal": {"name": "Discrete Dynamics in Nature and Society"}, "authors": [{"authorId": "2115772436", "name": "Yong Ma"}, {"authorId": "2153647871", "name": "Xingxu Zhang"}, {"authorId": "1770358", "name": "Xiaoqiang Di"}, {"authorId": "2136664023", "name": "T. Ren"}, {"authorId": "1791687", "name": "Huamin Yang"}, {"authorId": "2054379980", "name": "Binbin Cai"}], "citations": [{"paperId": "aa8b31c3cf5510c0ac02cd8c6ff1bd4132b5b274", "title": "Identifying Those Who Really Need Subsidies: A Data-Driven Approach"}, {"paperId": "274b7796982a928ea56b59a338dadad6b4be69b4", "title": "A Growing Model-Based OCSVM for Abnormal Student Activity Detection from Daily Campus Consumption"}, {"paperId": "9ad7ce719fd2063fc4945724e4af66e545ed718f", "title": "Co-occurrence patterns of issues and guidelines related to ethics and privacy of learning analytics in higher education—literature review"}, {"paperId": "37599386bd810cd305b3f6c5bd0223612e7ba2bc", "title": "Divorce Fact Detection Based on Internet User Behavior Using Hybrid Systems with Combination of Apriori Algorithm and K-Means Method"}]}
