{"paperId": "4dce79134d7c533ea49e2f0036e9efe912e8f247", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Cyber-Security of Industrial Internet of Things in Electric Power Systems", "abstract": "Electric Power Systems (EPSs) are among the most critical infrastructures of any society, since they significantly impact other infrastructures. Recently, there has been a trend toward implementing modern technologies, such as Industrial Internet of Things (IIoT), in EPSs to enhance their real-time monitoring, control, situational awareness, and intelligence. This movement, however, has exposed EPSs to various cyber intrusions that originate from the IIoT ecosystem. Statistics show that 38% of reported attacks have been against power and water infrastructure, and so far at least 91% of power utilities have experienced a cyber-attack. The cyber-security problem is even more severe for IIoT applications in EPSs due to the vulnerabilities and resource limitations of such applications. Thus, based on the above statistics, it is necessary to investigate the vulnerabilities of IIoT-based applications in EPSs, identify probable attacks and their consequences, and develop intrusion prevention and detection approaches to secure IIoT systems. On this basis, this paper first elaborates on the applications of IIoT-based systems in EPSs, and evaluates their security challenges. Afterwards, it comprehensively reviews various cyber-attacks against IIoT-assisted EPSs, with a particular focus on attack entry points and adversarial methods. Finally, efforts to prevent cyber-intrusions against IIoT systems in EPSs are explained, and different attack detection techniques are discussed.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "92390-92409", "volume": "10"}, "authors": [{"authorId": "51372654", "name": "Hamed Sarjan"}, {"authorId": "40176729", "name": "A. Ameli"}, {"authorId": "34732315", "name": "Mohsen Ghafouri"}], "citations": [{"paperId": "b0c5158fa7358d64b7f4d38ebae9d9fab595a05e", "title": "QPUF: Quantum Physical Unclonable Functions for Security-by-Design of Industrial Internet-of-Things"}, {"paperId": "35a57a44a26b55b846655ea51b9a7d1a6dcaaf96", "title": "HDA-IDS: A Hybrid DoS Attacks Intrusion Detection System for IoT by using semi-supervised CL-GAN"}, {"paperId": "2a9674f6be8f7acc1c0cd9dec6c7090ee944b931", "title": "A Lightweight Authentication Scheme in Electric Internet of Things"}, {"paperId": "667abba9a404e37d6ec86732f5c5015957f337b0", "title": "On Propagation of Cyber-Attacks in Wide-Area Measurement Systems"}, {"paperId": "b8bbb890bb9d83ab35f7c167ace4d9cb7b3463a0", "title": "Signature-based approach to detecting malicious outgoing traffic"}, {"paperId": "ea52ce2444ccd521b18884786fcef5079e7362f4", "title": "A Measurement Approach for Inline Intrusion Detection of Heartbleed-Like Attacks in IoT Frameworks"}]}
