{"paperId": "4de3484d929ae7c4ebe518498052ddd193269d71", "publicationVenue": {"id": "e3fe25c3-b745-4315-9717-751d9f923c7a", "name": "Academic Journal of Nawroz University", "type": "journal", "alternate_names": ["Acad J Nawroz Univ"], "issn": "2520-789X", "url": "https://journals.nawroz.edu.krd/index.php/ajnu"}, "title": "A Review on Big Data Analytics between Security and Privacy Issue", "abstract": "Because of technology, a large number of portable devices, and the great use of networks and the need for them in education, industry, and politics. This widespread has led to the emergence of a huge amount of data, and securing this data has become a very important matter. Big data refers to a very large number of data collected from different sources, this huge amount of data gives us deep insight and the benefit of this is to improve the decision-making process and thus lead to better customer service. Securing this huge amount of data (big data) is very difficult. Because of the large number of data and the continuous flow of this data that's come from different sources. Big data is a term that refers to a large, diverse, and complex amount of data. Big data analytics is a sophisticated and advanced technology used to analyze large, different, and diverse data in order to understand this type of data. However, there are many issues when using and analyzing big data, including the problem of security and privacy. This paper focuses on security and privacy problems and focuses on the biggest privacy issue Big data. The aim of this paper is to study the aspects of security and privacy and to make a comparison of the most important data security methods and the biggest privacy issues.", "venue": "Academic Journal of Nawroz University", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-02", "journal": {"name": "Academic Journal of Nawroz University"}, "authors": [{"authorId": "2124086658", "name": "Renas Rajab Asaad"}, {"authorId": "2182796507", "name": "Nisreen Luqman Abdulnabi"}], "citations": [{"paperId": "ca6e9d184c0d993c1029df2c1a575e16b6c4ef94", "title": "Review of Swarm Intelligence for Solving Symmetric Traveling Salesman Problem"}, {"paperId": "fa9d91d2444db68daef50d9255e47135b807889b", "title": "Image Processing with Python Libraries"}, {"paperId": "e483086abb28947bd21f08636cb84a5a8f82cf34", "title": "A Cyber Security Threats, Vulnerability, Challenges and Proposed Solution"}]}
