{"paperId": "4de86fb585d1fae63761acffb7aac8a3c2f35e9a", "publicationVenue": {"id": "c6ced65d-fcf7-4e5f-bedd-01360247ebbe", "name": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "type": "conference", "alternate_names": ["Pers Indoor Mob Radio Commun", "Personal, Indoor and Mobile Radio Communications", "IEEE Int Symp Pers Indoor Mob Radio Commun", "PIMRC"], "url": "http://www.ieee-pimrc.org/"}, "title": "Few-Shot Correlation Estimation for Cross-Camera Video Analytics: A Mean-Field Game Approach", "abstract": "Cross-camera video analytics is a major video analytic task that associates and analyzes information across multiple cameras. Existing studies exploit static temporal and spatial correlation among different cameras to reduce the searching space and thus accelerate searching. However, in practice, correlation among cameras changes over time, making the previous static approach inefficient. In this paper, we present the first work to support dynamic correlation estimation based on a few samples. Specifically, we formulate the correlation estimation problem as a mean-field game and interpret the cross-camera correlation as a novel mean-field term to approximate the target cameras' density field. Despite the significant complexity to solve the coupled partial differential equations in the game, we propose a G-prox primal-dual hybrid gradient algorithm to solve it efficiently. Our derived correlation models can guide searching with controllable granularity and solely rely on the knowledge of the initial correlation and destination correlation information. Extensive experiments on a real-world dataset demonstrate that, with the help of our dynamic correlation models, the overall workload can be reduced by 36% in general.", "venue": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-12", "journal": {"name": "2022 IEEE 33rd Annual International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC)", "pages": "1-6"}, "authors": [{"authorId": "2197778626", "name": "Kaiyang Chen"}, {"authorId": "2142420054", "name": "Yifei Zhu"}, {"authorId": "2047455022", "name": "Yuhan Kang"}, {"authorId": "2119248897", "name": "Zhu Han"}], "citations": []}
