{"paperId": "4dedd926043ff531038237558fecf2d1aac3d445", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Architecture for the Performance Management of Smart Healthcare Applications", "abstract": "The sixth-generation (6G) network intends to revolutionize the healthcare sector. It will offer smart healthcare (s-health) treatments and allow efficient patient remote monitoring, exposing the high potential of 6G communication technology in telesurgery, epidemic, and pandemic. Healthcare relies on 6G communication technology, diminishing barriers as time and space. S-health applications require strict network requirements, for instance, 99.999% of service reliability and 1 ms of end-to-end latency. However, it is a challenging task to manage network resources and applications towards such performance requirements. Hence, significant attention focuses on performance management as a way of searching for efficient approaches to adjust and tune network resources to application needs, assisting in achieving the required performance levels. In the literature, performance management employs techniques such as resource allocation, resource reservation, traffic shaping, and traffic scheduling. However, they are dedicated to specific problems such as resource allocation for a particular device, ignoring the heterogeneity of network devices, and communication technology. Thus, this article presents PRIMUS, a performance management architecture that aims to meet the requirements of low-latency and high-reliability in an adaptive way for s-health applications. As network slicing is central to realizing the potential of 5G–6G networks, PRIMUS manages traffic through network slicing technologies. Unlike existing proposals, it supports device and service heterogeneity based on the autonomous knowledge of s-health applications. Emulation results in Mininet-WiFi show the feasibility of meeting the s-health application requirements in virtualized environments.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-28", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "70225944", "name": "Andressa Vergütz"}, {"authorId": "2007578818", "name": "Nelson G. Prates"}, {"authorId": "146302974", "name": "Bruno Henrique Schwengber"}, {"authorId": "1755740", "name": "A. Santos"}, {"authorId": "2949501", "name": "M. N. Lima"}], "citations": [{"paperId": "84e1ba83ce850e70b8ae3732390d183f0b5f49c6", "title": "Towards fostering the role of 5G networks in the field of digital health"}, {"paperId": "65853a2c914f610a154f1cf990c62e1d35e456ef", "title": "Fuzzy Network Based 6G Framework for Healthcare Applications"}, {"paperId": "70a31ef6c72561b994a21e30993fd5d6707b182a", "title": "Leveraging 6G, extended reality, and IoT big data analytics for healthcare: A review"}, {"paperId": "d0e801f724bb7bce32417b6e4dc832012b06113d", "title": "Multi-Agent Credit Assignment and Bankruptcy Game for Improving Resource Allocation in Smart Cities"}, {"paperId": "78d23fff19bd70b83f61d604996559ca1f583aae", "title": "Role of Nanomaterials in the Fabrication of bioNEMS/MEMS for Biomedical Applications and towards Pioneering Food Waste Utilisation"}, {"paperId": "5091dff62c8a8bd8010bb5a476d3fb84f8c37043", "title": "E-government and logistical health services during Hajj season"}, {"paperId": "9d4438cfbf2723c73e0e71d228fe63442ae7c079", "title": "An SDN Based Testbed for Dynamic Network Slicing in Satellite-Terrestrial Networks"}, {"paperId": "7785de299e230924b359e8f43319feb71e1641a8", "title": "Implication of technology in health care: IoT and 5G"}, {"paperId": "6f18818d70f992db7e3bf9693094d595010487f6", "title": "6G Driven Fast Computational Networking Framework for Healthcare Applications"}]}
