{"paperId": "4deeaa2e43d6dfd526df58339412293fd7209d4c", "publicationVenue": {"id": "9641a8b5-1baa-4991-8cda-2c1336578145", "name": "International Journal of Education and Management Engineering", "type": "journal", "alternate_names": ["Int J Educ Manag Eng"], "issn": "2305-3623", "url": "https://www.mecs-press.org/ijeme/"}, "title": "Application of the Docking Protocol Optimization for Inhibitors of IGF-1R and IR and Understanding them through Artificial Intelligence and Bibliography", "abstract": ": The cancer cell prolonged and continues proliferation is a major cause of tumorigenesis. In general, Insulin like growth factor receptor (IGF-1R) and Insulin receptor (IR-A) protein are responsible for such cell proliferations. However, with respect to cancers, the specific over-expression of these receptors along with the elevated levels of their agonist, i.e. insulin-like growth factor 1 (IGF-1) and insulin-like growth factor 2 (IGF-2) have shown to be the integral part of cancer cell‟s proliferation. The understanding of the dual targeting of (IR) and (IGF-1R) through Artificial Intelligence in tumorigenesis is now considered to be a possible aspect to achieve the desired results. In this research we signify that according to data based on artificial intelligence, the tyrosine kinase domain of these two receptors can accommodates number of small molecules inhibitors to block the ongoing signaling cascade for cell proliferation. It is indeed found to be of paramount importance to develop such candidates as clinical solutions to block the activity of tyrosine kinase domain of IR and IGF-1R. Therefore, this study aims to use artificial intelligence for understanding the key molecular interactions responsible for activation and inhibition of the proliferation signal via tyrosine kinase domain. Further, we optimized docking protocol on crystal structures of such system from protein databank. Our study revealed that H-bond donor and hydrophobic pocket play a key role in the initiation of the signal cascade for cell proliferation. The simulations ran produced an acceptable solution based on the statistical measures of Mathew‟s correlation factor and delineated two H-bonds distances between 12-22. Our study also concluded that how a docking protocol can be optimized to accommodate the non-congeneric series small molecules. We successfully ran the simulation to conclude that LYS 1030, GLU 1077, MET 1079 and ASP 1083 amino acids positions play an important role in binding of small molecules to inhibit cancer cell proliferation. This research bridges the gap between in-silico and in-vitro experimentations and paves a way to reproduce the results experimentally.", "venue": "International Journal of Education and Management Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-08", "journal": {"name": "International Journal of Education and Management Engineering"}, "authors": [{"authorId": "2006429617", "name": "M. K. Pasha"}, {"authorId": "3634211", "name": "K. Munawar"}, {"authorId": "2119000545", "name": "Asma Talib Qureshi"}], "citations": []}
