{"paperId": "4deeb8ea9fd60858bde847775170168e1ede883e", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "keqing: knowledge-based question answering is a nature chain-of-thought mentor of LLM", "abstract": "Large language models (LLMs) have exhibited remarkable performance on various natural language processing (NLP) tasks, especially for question answering. However, in the face of problems beyond the scope of knowledge, these LLMs tend to talk nonsense with a straight face, where the potential solution could be incorporating an Information Retrieval (IR) module and generating response based on these retrieved knowledge. In this paper, we present a novel framework to assist LLMs, such as ChatGPT, to retrieve question-related structured information on the knowledge graph, and demonstrate that Knowledge-based question answering (Keqing) could be a nature Chain-of-Thought (CoT) mentor to guide the LLM to sequentially find the answer entities of a complex question through interpretable logical chains. Specifically, the workflow of Keqing will execute decomposing a complex question according to predefined templates, retrieving candidate entities on knowledge graph, reasoning answers of sub-questions, and finally generating response with reasoning paths, which greatly improves the reliability of LLM's response. The experimental results on KBQA datasets show that Keqing can achieve competitive performance and illustrate the logic of answering each question.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-31", "journal": {"name": "ArXiv", "volume": "abs/2401.00426"}, "authors": [{"authorId": "2136111348", "name": "Chaojie Wang"}, {"authorId": "2110598147", "name": "Yishi Xu"}, {"authorId": "2277351921", "name": "Zhong Peng"}, {"authorId": "2277394477", "name": "Chenxi Zhang"}, {"authorId": "2277429390", "name": "Bo Chen"}, {"authorId": "10737491", "name": "Xinrun Wang"}, {"authorId": "2257385968", "name": "Lei Feng"}, {"authorId": "2277251460", "name": "Bo An"}], "citations": [{"paperId": "ab15463babf98fffc6f683fe2026de0725b5e1a9", "title": "Retrieval-Augmented Generation for AI-Generated Content: A Survey"}, {"paperId": "27aa6506c45fafa4268207a4daf5a907b38c946e", "title": "Unmasking and Improving Data Credibility: A Study with Datasets for Training Harmless Language Models"}]}
