{"paperId": "4e16007f7ada8bcd043b1134175a3d9cb92935ee", "publicationVenue": null, "title": "Anomaly Detection In IoT Networks Using Hybrid Method Based On PCA-XGBoost", "abstract": "The Internet of Things is a growing network of limited and heterogeneous nodes and objects connected to the World Wide Web despite tits local connection. With the increasing use of IoT infrastructure in various fields, threats and attacks on these infrastructures are also growing. In this regard, security plays an important role in these networks. Therefore, in this paper, a method based on a combination of Principal Component Analysis (PCA) and XGBoost algorithms for anomaly detection in IoT was presented. For this purpose, after normalizing the data, the PCA algorithm was used to reduce the dimensions and then, the XGBoost algorithm was used to train and classify the proposed model. Finally, the proposed method was evaluated with Machine learning (ML) algorithms including Logistic regression (LR), K-Nearest Neighbors (KNN), Support Vector Machine (SVM), Decision Tree (DT) and was compared using the UNSW-NB15 dataset. The results confirmed performance improvement and superiority of the proposed method.", "venue": "2022 8th Iranian Conference on Signal Processing and Intelligent Systems (ICSPIS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-28", "journal": {"name": "2022 8th Iranian Conference on Signal Processing and Intelligent Systems (ICSPIS)", "pages": "1-5"}, "authors": [{"authorId": "2273763123", "name": "Ali Taghavirashidizadeh"}, {"authorId": "19224366", "name": "M. Zavvar"}, {"authorId": "1932596465", "name": "M. Moghadaspour"}, {"authorId": "2209212116", "name": "Mojtaba Jafari"}, {"authorId": "2209223627", "name": "Hamed Garoosi"}, {"authorId": "19224366", "name": "M. Zavvar"}], "citations": [{"paperId": "5f0fad845777d28a513e3c3b1f377431ea1065fb", "title": "Enhancing Cybersecurity Through Machine Learning-Based Classification of IoT Network Traffic"}]}
