{"paperId": "4e193b486d9f8f014591b8069258b13b2e380f98", "publicationVenue": {"id": "7bf8fd30-543b-48f6-bb8a-8c518006bdd2", "name": "IEEE Data Engineering Bulletin", "type": "journal", "alternate_names": ["IEEE Data Eng Bull"], "url": "https://tc.computer.org/tcde/tcde-bulletin-issues/"}, "title": "Toward Intelligent Query Engines", "abstract": "Data preparation is a crucial phase for data analysis applications. Data scientists spend most of their time on collecting and preparing data in order to efﬁciently and accurately extract valuable insights. Data preparation involves multiple steps of transformations until data is ready for analysis. Users often need to integrate heterogeneous data; to query data of various formats, one has to transform the data to a common format. To accurately execute queries over the transformed data, users have to remove any inconsistencies by applying cleaning operations. To efﬁciently execute queries, they need to tune access paths over the data. Data preparation, however is i) time-consuming since it involves expensive operations, and ii) lacks knowledge of the workload; a lot of preparation effort is wasted on data never meant to be used. To address the functionality and performance requirements of data analysis, we re-design data preparation in a way that is weaved into data analysis. We eliminate the transform-and-load cost using in-situ query processing approaches which adapt to any data format and facilitate querying diverse datasets. To address the scalability issues of cleaning and tuning tasks, we inject cleaning operations into query processing, and adapt access paths on-the-ﬂy. By integrating the aforementioned tasks into data analysis, we adapt data preparation to each workload and thereby minimize response times.", "venue": "IEEE Data Engineering Bulletin", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Data Eng. Bull.", "pages": "7-18", "volume": "42"}, "authors": [{"authorId": "40095095", "name": "Matthaios Olma"}, {"authorId": "3182666", "name": "Stella Giannakopoulou"}, {"authorId": "1943226", "name": "M. Karpathiotakis"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "379c31e589fb42294e910945b6326402f38eca86", "title": "Data Cleaning Techniques in Detecting Tendencies in Software Engineering"}]}
