{"paperId": "4e1d3ea4fec2db6da95519644f702f7cabaadb6c", "publicationVenue": {"id": "7a0ab88e-224a-475b-9ea6-e66a6b3448c8", "name": "Conference on Network and Service Management", "type": "conference", "alternate_names": ["Conf Netw Serv Manag", "CNSM"], "url": "http://www.cnsm-conf.org/"}, "title": "Performance Impact of Queue Sorting in Container-Based Application Scheduling", "abstract": "Containerization has revolutionized application deployments in current cloud platforms, enabling the flexible instantiation of loosely-coupled microservices and enhancing operational efficacy. However, optimizing the performance of container-based applications remains a challenge and a major topic in cloud research. This paper studies the impact of queue sorting in application scheduling, focused on complex inter-dependencies among microservices. Queue sorting determines the deployment order of containers in the infrastructure, typically based on container priorities and resource requests. Optimizing these algorithms directly influences scheduling efficiency and overall application performance. This paper compares several schedulers and sorting algorithms, leveraging extensive benchmark tests conducted on the widely-used Kubernetes (K8s) platform. The evaluation includes a novel sorting algorithm named Topological-Sort, designed to prioritize containers for application scheduling focused on microservice inter-dependencies. Results show the significant impact of queue sorting on application performance, with TopologicalSort algorithms outperforming default mechanisms, yielding an average increase of 20 % in throughput and reducing response time by at least 15 %. These results highlight the importance of considering microservice inter-dependencies for effective application deployment in modern container-based environments.", "venue": "Conference on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-30", "journal": {"name": "2023 19th International Conference on Network and Service Management (CNSM)", "pages": "1-9"}, "authors": [{"authorId": "2115681922", "name": "José Santos"}, {"authorId": "2221110373", "name": "Miel Verkerken"}, {"authorId": "1414010294", "name": "Laurens D’hooge"}, {"authorId": "145115855", "name": "T. Wauters"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1715957", "name": "F. Turck"}], "citations": []}
