{"paperId": "4e26b96ea5e34dc30b12b6673e6062870985d37f", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) a Geohydrologic Data Visualization Framework with an Extendable User Interface Design", "abstract": "—We present a novel geohydrologic data visualiza-tion framework and apply the interface automata theory in support of time-varying multivariate data visualization tasks. The framework tackles heterogeneous geohydrologic data that has unique and complex data structures. The interface au-tomata can generate a series of interactions and interfaces that are adapted to user selection and provide an intuitive method for visualizing and analyzing geohydrologic data. The interface automata can not only clearly guide user exploration, but also enhance user experience by eliminating automation surprises. In addition, our design can significantly reduce the entire system maintenance overhead, and enhance the system extendability for new datasets and data types. Our framework has been applied to a scientific geohydrologic visualization and analysis system, named INSIGHT, for the Nebraska Department of Natural Resources (NDNR). The new framework has brought many advantages that do not exist in the previous approaches, and is more efficient and extendable for visualizing geohydrologic data. I. INTRODUCTION Along with the technology boost, geoscience and its related fields have been generating a large amount of data at an unprecedented growth rate. Big geoscience datasets have been leveraged in various research areas, such as geography and urban planning, to benefit human society. Compared to the early stage of web 2.0, data storage and access paradigms have changed tremendously. The host of data has moved from personal computers to data centers that become more publicly accessible through the emerging cloud storage and computing services (for example, Amazon EC2, Google Earth Engine, and so on). Visualization becomes an increasingly attractive and feasible means for researchers to effectively and efficiently access and explore data to gain new understandings and discoveries. However, it is challenging to develop viable visualization solutions for geoscience science. First, the size of a dataset can range from several Gigabytes to Petabytes [1]. Without suitable system and data supports, it is difficult to visualize and analyze these datasets [2], [3]. For example, a typical geoscience dataset has a hierarchical structure, which makes it hard for indexing and workload balancing [4]. Second, geoscience datasets often present diverse data types, which", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "8899365", "name": "Yanfu Zhou"}, {"authorId": "2821889", "name": "Jieting Wu"}, {"authorId": "145567132", "name": "Lina Yu"}, {"authorId": "4590999", "name": "Hongfeng Yu"}, {"authorId": "7172207", "name": "Zhenghong Tang"}], "citations": [{"paperId": "eacc1f6b5b7dc9f127e0edd38f9e8a0bc5011bf6", "title": "Privacy-Preserving Frequent Pattern Mining from Big Uncertain Data"}]}
