{"paperId": "4e2cef74e22251b254c79eddc359c87fb0bc5b87", "publicationVenue": null, "title": "Using Deep Learning to Predict and Optimize Hadoop Data Analytic Service in a Cloud Platform", "abstract": "Hadoop is a popular computing framework to deliver timely and cost-effective data processing on a large cluster of commodity machines. It relieves the burden of the programmers dealing with distributed programming, and an ecosystem of Big Data solutions have developed around it. However, Hadoop job execution time can be greatly depending on the its runtime configurations and resource selections. Hence, optimizing Hadoop execution still requires a substantial amount of expertise and experiences. To address this challenge, this paper aims to develop a learning-based technique to predict Hadoop job time based on historical execution data, and built a system to optimize its performance in a shared resource cloud environment. While deep learning has shown successes in many application domains, little attention has been paid to apply such technique in job time prediction. In this work, we conducted extensive experimental studies to compare our deep learning prediction method with three other state-of-art regression-based prediction methods in a cloud platform built by OpenStack. The results showed that our prediction method out-performed traditional approaches in most test cases, and improved job performance and cost significantly.", "venue": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "909-916"}, "authors": [{"authorId": "2109538987", "name": "Chen-Chun Chen"}, {"authorId": "40954822", "name": "Yu-Tung Hasio"}, {"authorId": "1990535", "name": "Chan-Yi Lin"}, {"authorId": "8805708", "name": "Shihyu Lu"}, {"authorId": "29371814", "name": "Hsin-Tse Lu"}, {"authorId": "39253275", "name": "J. Chou"}], "citations": [{"paperId": "2fa703ff3b4f0a1eea169e67f43016155f07e220", "title": "Design and implementation of algorithm execution time predictor for remote sensing product workflow"}, {"paperId": "f1d0ab5be01f4507213a50f0ff5b81f53d0a2264", "title": "CAMIRA: a consolidation-aware migration avoidance job scheduling strategy for virtualized parallel computing clusters"}, {"paperId": "f42c55162c4c00aa1e8561792504c133c0054d5c", "title": "Performance benchmarking and auto-tuning for scientific applications on virtual cluster"}, {"paperId": "e4bbaf9139faf28c5a4197e5bc5320a18ab12a75", "title": "Resource and Job Execution Context-Aware Hadoop Configuration Tuning"}, {"paperId": "9f60c5f4c59a1afc6534cde0133bea78df960db4", "title": "Cross-Scenario Performance Modelling for Big Data Ecosystems"}, {"paperId": "496a0b27573f0de7663667bb24bcd4dfbe8469e6", "title": "Elastic Provisioning of Hadoop Clusters on OpenStack Private Cloud"}, {"paperId": "e82d446b3bfcbded4a212bf25db36bea9b62dad7", "title": "Artificial Intelligence in HCI: First International Conference, AI-HCI 2020, Held as Part of the 22nd HCI International Conference, HCII 2020, Copenhagen, Denmark, July 19–24, 2020, Proceedings"}]}
