{"paperId": "4e2de64e331de1dc77225c9debd38b4a01a054db", "publicationVenue": {"id": "486f570e-83a7-4e50-975c-c0362754bbd9", "name": "Journal of Computacion y Sistemas", "type": "journal", "alternate_names": ["Comput Sist", "J Comput Sist", "Computación Y Sistemas"], "issn": "1405-5546", "alternate_issns": ["2007-9737"], "url": "http://www.scielo.org.mx/scielo.php?lng=en&pid=1405-5546&script=sci_serial"}, "title": "A Systematic Literature Review on the Hybrid Approaches for Recommender Systems", "abstract": ". Recommender systems represent a high economic, social, and technological impact at international level due to the most relevant technological companies have been used them as their main services considering that user experience and companies sales have been improved. For this reason, these systems are a principal research area, and the companies optimize their algorithms with hybrid approaches that combine two or more recommendation strategies. A systematic literature review on the hybrid approaches for recommender systems is generated by this work, the objectives are to analyze research line progress and to identify opportunity areas for future investigations. Further, the recent trends about challenges, methodologies, datasets, application domains and evaluation metrics on hybrid approach are identified. An art state from 2016 to 2020 is developed with information systems guide than unlike others works that use less recent guide and software engineering guide. This research will benefit recommender systems community.", "venue": "Journal of Computacion y Sistemas", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-30", "journal": {"name": "Computación y Sistemas", "volume": "26"}, "authors": [{"authorId": "2183780511", "name": "Victor Giovanni Morales Murillo"}, {"authorId": "3469668", "name": "David Eduardo Pinto Avendaño"}, {"authorId": "2285920558", "name": "Franco Rojas López"}, {"authorId": "1398078444", "name": "J. González-Calleros"}], "citations": [{"paperId": "812b751cf158212dda3a48324690f243f4097893", "title": "Housing fuzzy recommender system: A systematic literature review"}, {"paperId": "0c580821073cee0094d86576ec16ba4cd2d7a523", "title": "Recommender System in Academic Choices of Higher Education: A Systematic Review"}, {"paperId": "c0f90a777154da4bc486bda53409196d5bc9565f", "title": "A Hybrid Recommender Model based on Information Retrieval for Mexican Tourism Text in Rest-Mex 2022"}]}
