{"paperId": "4e2d9ca07cade654bba1469837d6edd508574cb8", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "A Tale of Two Subreddits: Measuring the Impacts of Quarantines on Political Engagement on Reddit", "abstract": "Concerns over the spread of abusive content in social media have led online platforms to explore large scale community-level forms of moderation.\nAs an alternative to full bans, Reddit has implemented quarantines of subreddits, limiting access to controversial communities without explicit removal.\nPrevious evaluations of the effectiveness of quarantines have focused on their impact on toxicity in affected communities.\nIn this work, however, we focus on examining the impacts of quarantines of political subreddits on issues of political engagement in the broader Reddit community.\nWe present a case study of two ideologically distinct political subreddits, r/The_Donald and r/ChapoTrapHouse, and examine the impact of quarantines on activity, visibility, and political discussion.\nWe find that while quarantines had a homogenizing effect on participation in political subreddits, they had limited impact on the visibility of community-internal issues and political language, due to the entrenchment of subreddit norms.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-31", "journal": {"pages": "932-943"}, "authors": [{"authorId": "3443246", "name": "Qinlan Shen"}, {"authorId": "35959897", "name": "C. Rosé"}], "citations": [{"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}, {"paperId": "a6ff42900f660427bb7c96cd2afff7ccd1d8e1e7", "title": "The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media"}, {"paperId": "0b4637c42260a3b7e966dbb671f01b2789dc69fc", "title": "Towards Intersectional Moderation: An Alternative Model of Moderation Built on Care and Power"}, {"paperId": "4de1c8b2bc3c1991e4eaf260e746e8c9f221d798", "title": "Moral intuitions behind deepfake-related discussions in Reddit communities"}, {"paperId": "b2ed3dded487ab8b1d8f0ca078b834fedffbcc80", "title": "Understanding the (In)Effectiveness of Content Moderation: A Case Study of Facebook in the Context of the U.S. Capitol Riot"}, {"paperId": "01245e073bb5da0850af0013213418f7feed08e5", "title": "A puzzle of epistemic paternalism"}, {"paperId": "016cb06f7de32e12653f475abae3c44c97923993", "title": "One of Many: Assessing User-level Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "6e63212def0783609b76727282ac0545dc00a6c6", "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement, and Research to Practice"}]}
