{"paperId": "4e33504023dc360e43cedfb344799e6221c0fa3a", "publicationVenue": null, "title": "Trust in data engineering: reflection, framework, and evaluation methodology", "abstract": "Trustisandhasbeenessentialtohumaninteractions. Withtheriseoftechnology,wenowliveinasocio-technicalenvironment where people frequently interact with technology as well. It is therefore natural to expect that people will also develop trust in technology. Data engineering researchers have at least assumed this when claiming certain methods they devise (e.g, explanations using provenance), likely help to foster some notion of trust. But rarely is the notion of trust clarified or this claim validated. We propose a more systematic consideration of trust in data engineering technology, compared to the ad-hoc state of the art. Therefore, we first review the notion of trust established in other disciplines, based on which we derive a model for trust in data engineering technology. We then present guidelines on how to proceed to devise a trust strategy aiming at enriching data engineering technology such that it potentially fosters trust conforming to our model. We further discuss how to possibly evaluate a trust strategy. We apply our trust model on a use case, for which we devise, implement, and evaluate a trust strategy using our proposed guidelines and methods. The results of our evaluation indicate that statements like “transparency helps build trust” should be used cautiously. This highlights the need for contributions like those we present here, as only a more systematic approach to defining, integrating, and evaluating trust in data engineering can bring us a step closer to provably fostering trust in such technologies.", "venue": "DEco@VLDB", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"pages": "4-17"}, "authors": [{"authorId": "51250765", "name": "Sarah Oppold"}, {"authorId": "143677452", "name": "Melanie Herschel"}], "citations": []}
