{"paperId": "4e378a03ac6c7e8d393b77d24b05bb96cd1ea16a", "publicationVenue": null, "title": "Magnetic Resonance Enterography indices for ileal Crohn's disease assessment: 1 Comparison between classical and machine-learning-based indices", "abstract": ": 16 Rationale and Objectives: Magnetic Resonance Enterography (MRE) is a non-invasive examination to assess 17 Crohn’s Disease (CD) activity. Several MRE-based indices were developed for standardized evaluation. The 18 goal of this study was to compare non-linear machine-learning models to linear models in evaluating terminal 19 ileum (TI) inflammation severity from MRE data of pediatric CD patients. 20 Materials and Methods: We developed Random-Forest machine-learning (RF) and baseline multiple linear-21 regression (MLR) models to evaluate CD severity at the TI from MRE data with the Magnetic Resonance Index 22 of Activity (MaRIA), it's simplified version (sMaRIA), and the Pediatric Inflammatory Crohn's MRE Index (PICMI) 23 variables. We assessed the accuracy of the MRE-based TI CD severity evaluation with ileocolonoscopy-based 24 Simple Endoscopic Score for CD (SES-CD) as the reference standard using a stratified 2-fold validation 25 experimental setup, repeated 100 times. 26 Results: A total of 163 children who had all relevant MRE variables and available TI SES-CD score were included 27 in this study (51% in remission [TI SEC-CD<3], 25% moderate [3≤ TI SEC-CD≤6], 24% high [TI SEC-CD ≥7]). RF-28 PICMI achieved the best R-squared coefficient on validation set compared to other models (Median value over 29 200 folds: RF-MaRIA 0.35 vs. MLR-MaRIA 0.29, RF-sMaRIA 0.37 vs. MLR-sMaRIA 0.27, and RF-PICMI 0.39 vs. 30 MLR-PICMI 0.33, p<1e-5). Receiver operation characteristics (ROC) area under curve (AUC) for classification of 31 mucosal healing [TI SEC-CD<3] was broadly similar in all models.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2125707552", "name": "Itai Guez"}, {"authorId": "35674267", "name": "G. Focht"}, {"authorId": "108279951", "name": "M. Greer"}, {"authorId": "1417443412", "name": "R. Cytter-Kuint"}, {"authorId": "3886495", "name": "L. Pratt"}, {"authorId": "21357833", "name": "D. Castro"}, {"authorId": "77589534", "name": "D. Turner"}, {"authorId": "3668645", "name": "A. Griffiths"}, {"authorId": "145191527", "name": "M. Freiman"}], "citations": []}
