{"paperId": "4e40ece969a8df857e894026c74c9e7afde14ee2", "publicationVenue": {"id": "3bc28d6c-e3a5-46ca-b244-67603bd2da42", "name": "African Conference on Software Engineering", "type": "conference", "alternate_names": ["Australasian Conference on Computer Science Education", "Afr Conf Softw Eng", "ACSE", "Australas Conf Comput Sci Educ"]}, "title": "Parameter Settings Optimization in MapReduce Big Data processing using the MOPSO Algorithm", "abstract": "Big data is a commodity that is highly valued in the entire globe. It is not just regarded as data but in the world of experts, we can derive intelligence from it. Because of its characteristics which are Variety, Value, Volume, Velocity, and the growing need of how it can be handled, Organizations are facing difficulties in ensuring optimal as well as affordable processing and storage of large datasets. One of the already existing models used for rapid processing together with storage in big data is known as Hadoop MapReduce.  MapReduce is used for large-scale data processing in a parallel and distributed computing environment, while Hadoop is used for running applications and storing data in clusters of commodity hardware Furthermore, the Hadoop MapReduce framework needs to tune more than 190 configuration parameters which are mostly done manually. Due to complex interactions and large spaces between parameters, manual tuning is not effective. Even worse, these parameters must be tuned every time Hadoop MapReduce applications are run. The main goal of this research is to create an algorithm that will improve efficiency by automatically optimizing parameter settings when MapReduce jobs are running. The algorithm employs the Multi-Objective Particle Swarm Optimization (MOPSO) technique, which uses two objective functions to look for a Pareto optimal solution while optimizing the parameters. The results of the experiments have shown that the algorithm has remarkably improved MapReduce job performance in comparison to the use of default settings.", "venue": "African Conference on Software Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-25", "journal": {"name": "International Journal of Advances in Scientific Research and Engineering"}, "authors": [{"authorId": "1973276132", "name": "Lennah Etyang"}, {"authorId": "145180839", "name": "W. Mwangi"}, {"authorId": "3076697", "name": "L. Nderu"}], "citations": [{"paperId": "a898980e211a36bb2b328934b6977645894fe3bb", "title": "Handling Data and Model Drift for World Application using Big Data"}]}
