{"paperId": "4e506feb12b57a32134fe41b38b22d07b32ffa11", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "IPS: Unified Profile Management for Ubiquitous Online Recommendations", "abstract": "ByteDance offers several massively popular products such as TikTok, Jinri Toutiao and Douyin for creating, sharing and discovering a variety of content, in which recommendation plays an indispensable role for helping billions of users to interact with highly personalized content. The personalized experience in products largely comes from the ability of sophisticated machine learning models to make accurate predictions based on users’ interests and one key component in such systems is the user profile service.In this paper, we introduce Instance Profile Service (IPS), a large scale distributed system for managing unstructured profile data as well as serving various feature computations at ByteDance. Different products leverage IPS in many different ways and place various demands on the system, in terms of complex computation logic and latency requirements. One major challenge in the design of a large scale user profile system is how to strike the right balance among efficiency, scalability, reliability and versatility. With deliberated choices made on its design and implementation, we demonstrate IPS can provide a simple yet flexible solution to all these products while meeting the targeted high availability and performance goals. At ByteDance, IPS has successfully replaced many legacy profile systems and runs on thousands of machines. One of our largest production instances can process a hundred million feature queries and tens of millions writes per second.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "2571-2582"}, "authors": [{"authorId": "2056571469", "name": "Ruixin Shi"}, {"authorId": "2152801248", "name": "Yang Liu"}, {"authorId": "39786970", "name": "Jianjun Chen"}, {"authorId": "31940424", "name": "X. Zou"}, {"authorId": "2157243859", "name": "Yanbin Chen"}, {"authorId": "2114863002", "name": "Minghua Fan"}, {"authorId": "2114818820", "name": "Zhihao Cai"}, {"authorId": "2119056332", "name": "Guanghui Zhang"}, {"authorId": "2116104854", "name": "Zhiwen Li"}, {"authorId": "72322304", "name": "Y. Liang"}], "citations": []}
