{"paperId": "4e66f9f07425e871733ce5a7970a12ceb74c15da", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "Subtraction-Average-Based Optimizer: A New Swarm-Inspired Metaheuristic Algorithm for Solving Optimization Problems", "abstract": "This paper presents a new evolutionary-based approach called a Subtraction-Average-Based Optimizer (SABO) for solving optimization problems. The fundamental inspiration of the proposed SABO is to use the subtraction average of searcher agents to update the position of population members in the search space. The different steps of the SABO’s implementation are described and then mathematically modeled for optimization tasks. The performance of the proposed SABO approach is tested for the optimization of fifty-two standard benchmark functions, consisting of unimodal, high-dimensional multimodal, and fixed-dimensional multimodal types, and the CEC 2017 test suite. The optimization results show that the proposed SABO approach effectively solves the optimization problems by balancing the exploration and exploitation in the search process of the problem-solving space. The results of the SABO are compared with the performance of twelve well-known metaheuristic algorithms. The analysis of the simulation results shows that the proposed SABO approach provides superior results for most of the benchmark functions. Furthermore, it provides a much more competitive and outstanding performance than its competitor algorithms. Additionally, the proposed approach is implemented for four engineering design problems to evaluate the SABO in handling optimization tasks for real-world applications. The optimization results show that the proposed SABO approach can solve for real-world applications and provides more optimal designs than its competitor algorithms.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-06", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "2150730612", "name": "Pavel Trojovský"}, {"authorId": "2132379761", "name": "Mohammad Dehghani"}], "citations": [{"paperId": "e72de06cf8b3e517345923b0fc530b6626ac114b", "title": "Integrated thermal error modeling and compensation of machine tool feed system using subtraction-average-based optimizer-based CNN-GRU neural network"}, {"paperId": "2052eb61b95df492abf1ee82f0e38322c1682544", "title": "Augmented weighted K-means grey wolf optimizer: An enhanced metaheuristic algorithm for data clustering problems"}, {"paperId": "fbaa30d4a31a4ce5ceaf9e7c01f35cfcdd978dd2", "title": "Fault Diagnosis Method for Rolling Bearings Based on Grey Relation Degree"}, {"paperId": "4d122e5c1914a1f1f160ec6282458cb63ad4f873", "title": "Botox Optimization Algorithm: A New Human-Based Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "c9aead72afa30b0d0713e3cf18b015c8eb07c6ce", "title": "Fault Diagnosis of Gear Based on Multichannel Feature Fusion and DropKey-Vision Transformer"}, {"paperId": "2828439b11a134436e8e68eb64e84b80d88beac8", "title": "A Multi-strategy Enhanced Arithmetic Optimization Algorithm and Its Application in Path Planning of Mobile Robots"}, {"paperId": "da8a8d02fee65f42d0dcf0278303fdb2d562a07a", "title": "Early energy performance analysis of smart buildings by consolidated artificial neural network paradigms"}, {"paperId": "c04941c752e5a18e99dbf74ceaaf8e555ff4fcb3", "title": "Optimization of waterproofing and drainage measures for open-pit mines based on seasonal rainfall time series prediction"}, {"paperId": "d0b1176100337293e0a040884a80d578a425a627", "title": "A Contemporary Systematic Review on Meta-heuristic Optimization Algorithms with Their MATLAB and Python Code Reference"}, {"paperId": "9a90cbd6014c9908c90f9e327c7143b52ac22ff6", "title": "A Data-driven Performance Analysis and Prediction Method for Electric Vehicle Cabin Thermal Management System"}, {"paperId": "8df6ce34e2be4f167559834f195468a121e130a9", "title": "Kookaburra Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "3e9aa8721335331437fcdc54a262a7b90cd2a53f", "title": "Percentile-Based Adaptive Immune Plasma Algorithm and Its Application to Engineering Optimization"}, {"paperId": "ef3d1d72076c278b0748dd853ede516e21cd1d31", "title": "OOBO: A New Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "f9020777e9719dc6791f6846edbd14a366100d40", "title": "An Advanced Bio-Inspired Mantis Search Algorithm for Characterization of PV Panel and Global Optimization of Its Model Parameters"}, {"paperId": "1088f92aec8eb5ffba6bfacbb39382792b6f8ca5", "title": "A New Human-Based Metaheuristic Algorithm for Solving Optimization Problems Based on Technical and Vocational Education and Training"}, {"paperId": "c7c63a4a13eb9f4f363234420108a450652c41eb", "title": "Discrete sizing optimization method based on dividing rectangles algorithm and local response surface for steel frame structures"}, {"paperId": "d782a12d9c3e8ae14093ab8698437b2c14e807f0", "title": "Golf Optimization Algorithm: A New Game-Based Metaheuristic Algorithm and Its Application to Energy Commitment Problem Considering Resilience"}, {"paperId": "5d8596ebec52f258bfb8b15e4dc10f0fdfae02c6", "title": "PECSO: An Improved Chicken Swarm Optimization Algorithm with Performance-Enhanced Strategy and Its Application"}, {"paperId": "8318213fd27e6cf49ed3fe8815c3e01d77872d14", "title": "A Subtraction-Average-Based Optimizer for Solving Engineering Problems with Applications on TCSC Allocation in Power Systems"}, {"paperId": "6c81bf84abac9e375eb8d8e39b7a086b9507df9a", "title": "A hierarchical multi-leadership sine cosine algorithm to dissolving global optimization and data classification: The COVID-19 case study"}, {"paperId": "bbfb899a01480bfa7831a6f2316e1c7793de79a6", "title": "Design of Intelligent Neuro-Supervised Networks for Brain Electrical Activity Rhythms of Parkinson’s Disease Model"}, {"paperId": "e9facb35b67b20f6245940b28703d0451292e560", "title": "Chaotic American zebra search optimization algorithm for benchmark challenges"}, {"paperId": "564a8990cbe021375c36c3e6cf0dd1d7df912a00", "title": "Drawer Algorithm: A New Metaheuristic Approach for Solving Optimization Problems in Engineering"}, {"paperId": "40d78b784ac35589b14e5cbf61ea065cbe88b34c", "title": "Optimal Allocation of TCSC Devices in Transmission Power Systems by a Novel Adaptive Dwarf Mongoose Optimization"}, {"paperId": "71e875bcdc6600411f30a112c9adecce7777b94a", "title": "IOOA: A multi-strategy fusion improved Osprey Optimization Algorithm for global optimization"}]}
