{"paperId": "4e7126ed39b6f01f6be40b01fd412ab1c40296e6", "publicationVenue": null, "title": "Timon: A Timestamped Event Database for Efficient Telemetry Data Processing and Analytics", "abstract": "With the increasing demand for real-time system monitoring and tracking in various contexts, the amount of time-stamped event data grows at an astonishing rate. Analytics on time-stamped events must be real time and the aggregated results need to be accurate even when data arrives out of order. Unfortunately, frequent occurrences of out-of-order data will significantly slow down the processing, and cause a large delay in the query response. Timon is a timestamped event database that aims to support aggregations and handle late arrivals both correctly (i.e., upholding the exactly-once semantics) and efficiently. Our insight is that a broad range of applications can be implemented with data structures and corresponding operators that satisfy associative and commutative properties. Records arriving after the low watermark are appended to Timon directly, allowing aggregations to be performed lazily. To improve query efficiency, Timon maintains a TS-LSM-Tree, which keeps the most recent data in memory and contains a time-partitioning tree on disk for high-volume data accumulated over long time span. Besides, Timon supports materialized aggregation views and correlation analysis across multiple streams. Timon has been successfully deployed at Alibaba Cloud and is a critical building block for Alibaba cloud's continuous monitoring and anomaly analysis infrastructure.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-05-29", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "152283180", "name": "Wei Cao"}, {"authorId": "1726030041", "name": "Yusong Gao"}, {"authorId": "2146324505", "name": "Feifei Li"}, {"authorId": "50695586", "name": "Sheng Wang"}, {"authorId": "2068284793", "name": "Bingchen Lin"}, {"authorId": "2117101808", "name": "Ke Xu"}, {"authorId": "50482118", "name": "Xiaojie Feng"}, {"authorId": "2108898708", "name": "Yucong Wang"}, {"authorId": "3233149", "name": "Zhenjun Liu"}, {"authorId": "1726048998", "name": "Gejin Zhang"}], "citations": [{"paperId": "9d82f71d1d6da2f6b395cd742f4d9ff671bdc4cf", "title": "FineMon: An Innovative Adaptive Network Telemetry Scheme for Fine-Grained, Multi-Metric Data Monitoring with Dynamic Frequency Adjustment and Enhanced Data Recovery"}, {"paperId": "68fdc992cf1b9e1b33110380a3f93e32027abd47", "title": "Khronos: A Real-Time Indexing Framework for Time Series Databases on Large-Scale Performance Monitoring Systems"}, {"paperId": "bd5770a9eb5be9df02e6a805d9517a5fc675cfc7", "title": "Time Series Database Optimization Based on InfluxDB"}, {"paperId": "c4c193b3fca96a8b16f3dbe3247ad36389073537", "title": "Krypton: Real-time Serving and Analytical SQL Engine at ByteDance"}, {"paperId": "5643e86caf0449f7f06c3e024711592f8a20a1fc", "title": "Lindorm TSDB: A Cloud-native Time-series Database for Large-scale Monitoring Systems"}, {"paperId": "0c8bb7e5943ddb3fe80e4a0391243c1915837bf8", "title": "ForestTI: A Scalable Inverted-Index-Oriented Timeseries Management System with Flexible Memory Efficiency"}, {"paperId": "8cc4dd210bb4650ada879d23146d2f5222e27b99", "title": "BSCache: A Brisk Semantic Caching Scheme for Cloud-based Performance Monitoring Timeseries Systems"}, {"paperId": "72f5f099ebb65a776d12bcd257b787016053a7fb", "title": "TimeUnion: An Efficient Architecture with Unified Data Model for Timeseries Management Systems on Hybrid Cloud Storage"}, {"paperId": "e141c4e9ede377bf378f26dbb2c23627d970c389", "title": "Separation or Not: On Handing Out-of-Order Time-Series Data in Leveled LSM-Tree"}, {"paperId": "5e124ff0ec8a6fcc1395dffb40b4c42091269576", "title": "Workload-optimized sensor data store for industrial IoT gateways"}, {"paperId": "4a70a739e565f477b06c1b5dc4adf6e7e5300ce1", "title": "Heracles: An Efficient Storage Model And Data Flushing For Performance Monitoring Timeseries"}, {"paperId": "3b5a3fcfca9f87c8ac7d886a27f9e464078d4b65", "title": "Mach: A Pluggable Metrics Storage Engine for the Age of Observability"}]}
