{"paperId": "4e7e6aa57e9ea8f219965fdffb0bfb53bbbaa5e9", "publicationVenue": null, "title": "A NEW INITIATIVE FOR TILING, STITCHING AND PROCESSING GEOSPATIAL BIG DATA IN DISTRIBUTED COMPUTING ENVIRONMENTS", "abstract": "Abstract. Within recent years, several new approaches and solutions for Big Data processing have been developed. The Geospatial world is still facing the lack of well-established distributed processing solutions tailored to the amount and heterogeneity of geodata, especially when fast data processing is a must. The goal of such systems is to improve processing time by distributing data transparently across processing (and/or storage) nodes. These types of methodology are based on the concept of divide and conquer. Nevertheless, in the context of geospatial processing, most of the distributed computing frameworks have important limitations regarding both data distribution and data partitioning methods. Moreover, flexibility and expendability for handling various data types (often in binary formats) are also strongly required. This paper presents a concept for tiling, stitching and processing of big geospatial data. The system is based on the IQLib concept ( https://github.com/posseidon/IQLib/ ) developed in the frame of the IQmulus EU FP7 research and development project ( http://www.iqmulus.eu ). The data distribution framework has no limitations on programming language environment and can execute scripts (and workflows) written in different development frameworks (e.g. Python, R or C#). It is capable of processing raster, vector and point cloud data. The above-mentioned prototype is presented through a case study dealing with country-wide processing of raster imagery. Further investigations on algorithmic and implementation details are in focus for the near future.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-06-03", "journal": {"name": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "111-118", "volume": ""}, "authors": [{"authorId": "3009737", "name": "A. Olasz"}, {"authorId": "2351732", "name": "B. N. Thai"}, {"authorId": "2461399", "name": "D. Kristóf"}], "citations": [{"paperId": "1d21c82c7452d5860f233950f43a67418ca90775", "title": "Performance Comparison of Big Data Processing Utilizing SciDB and Apache Accumulo Databases"}, {"paperId": "3b43ab2830bb2e53e2a41e7b7aac4c732ed998fd", "title": "Large-scale unsupervised spatio-temporal semantic analysis of vast regions from satellite images sequences"}, {"paperId": "49be9a224eb0dc50bd206c833eb06be067df3cf3", "title": "A MapReduce-based distributed and scalable framework for stitching of satellite mosaic images"}, {"paperId": "963a8d189a4b1041aa67b3cc0925d21bfa39da79", "title": "Developing the Raster Big Data Benchmark: A Comparison of Raster Analysis on Big Data Platforms"}, {"paperId": "81283091fddc335343efe421818a16667b271ae0", "title": "Developing the Geospatial Big Data Benchmark: A Comparative Framework for Evaluating Raster Analysis on Big Data Platforms"}, {"paperId": "fd6e334a1238b5eae6ac647bdc0b1d96697eb1cf", "title": "FTF: a quick surveying approach for constructing high resolution digital surface model for road elements"}, {"paperId": "3a3106ba0e5dca4066f72692a818745e8608cc08", "title": "Web-Based Visualization of Big Geospatial Vector Data"}, {"paperId": "c01f8c993097eb8a03d09caf09bcd4741219ef65", "title": "Resource- and content-aware, scalable stitching framework for remote sensing images"}, {"paperId": "7931c6765588769819193ead1f3acba43d33e49b", "title": "Study on the Development of Geo-Spatial Big Data Service System based on 7V in Korea"}, {"paperId": "b4c0feb75fdfb126bb25f947b4159f2e49f9f093", "title": "IPUMS-Terra: integrated big heterogeneous spatiotemporal data analysis system"}, {"paperId": "542d47836e9281553bd6c3846ad0604b42322793", "title": "Development of a new framework for Distributed Processing of Geospatial Big Data"}, {"paperId": "414b457f2004164d9a57514b7134df8a3a41fc9f", "title": "PROCESSING BIG REMOTE SENSING DATA FOR FAST FLOOD DETECTION IN A DISTRIBUTED COMPUTING ENVIRONMENT"}, {"paperId": "4022a74fb64453285c8d7c8ebd2a0fb47108f91a", "title": "Retrospective analysis of long-term landscape evolution based on archive satellite imagery and historical maps"}, {"paperId": "ff4393c925c2fa607de6f1c48d0d01b74f4217cd", "title": "Terra Populus’ architecture for integrated big geospatial services"}, {"paperId": "7dccf967bcd0f085ee392296a5e40ba5895c9bfb", "title": "Hogyan lesz térbeli a Big Data"}]}
