{"paperId": "4e80d5f39a5eb4fb0ceaf6ab14aff80f469d3e76", "publicationVenue": null, "title": "Waist Tightening of CNNs: A Case study on Tiny YOLOv3 for Distributed IoT Implementations", "abstract": "Computer vision systems in sensor nodes of the Internet of Things (IoT) based on Deep Learning (DL) are demanding because the DL models are memory and computation hungry while the nodes often come with tight constraints on energy, latency, and memory. Consequently, work has been done to reduce the model size or distribute part of the work to other nodes. However, then the question arises how these approaches impact the energy consumption at the node and the inference time of the system. In this work, we perform a case study to explore the impact of partitioning a Convolutional Neural Network (CNN) such that one part is implemented on the IoT node, while the rest is implemented on an edge device. The goal is to explore how the choice of partition point, quantization method and communication technology affects the IoT system. We identify possible partitioning points between layers, where we transform the feature maps passed between layers by applying quantization and compression to reduce the data sent over the communication channel between the two partitions in Tiny YOLOv3. The results show that a reduction of transmitted data by 99.8% reduces the network accuracy by 3 percentage points. Furthermore, the evaluation of various IoT communication protocols shows that the quantization of data facilitates CNN network partitioning with significant reduction of overall latency and node energy consumption.", "venue": "CPS-IoT Week Workshops", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-05-09", "journal": {"name": "Proceedings of Cyber-Physical Systems and Internet of Things Week 2023"}, "authors": [{"authorId": "2216573000", "name": "Isaac Sanchez Leal"}, {"authorId": "2216568992", "name": "Eiraj Saqib"}, {"authorId": "1413952254", "name": "Irida Shallari"}, {"authorId": "1878553", "name": "A. Jantsch"}, {"authorId": "2104165530", "name": "Silvia Krug"}, {"authorId": "1397930788", "name": "M. O’nils"}], "citations": [{"paperId": "82d800c3f79eae90eb44f5919d2aad95d1b17b6d", "title": "Optimizing the IoT Performance: A Case Study on Pruning a Distributed CNN"}]}
