{"paperId": "4e8559a15b1f950a54990fb5f45b220c0f89c77f", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Network-Aware Optimization of Distributed Learning for Fog Computing", "abstract": "Fog computing promises to enable machine learning tasks to scale to large amounts of data by distributing processing across connected devices. Two key challenges to achieving this are (i) heterogeneity in devices’ compute resources and (ii) topology constraints on which devices can communicate. We are the first to address these challenges by developing a network-aware distributed learning optimization methodology where devices process data for a task locally and send their learnt parameters to a server for aggregation at certain time intervals. Unlike traditional federated learning frameworks, our method enables devices to offload their data processing tasks, with these decisions determined through a convex data transfer optimization problem that trades off costs associated with devices processing, offloading, and discarding data points. We analytically characterize the optimal data transfer solution for different fog network topologies, showing for example that the value of a device offloading is approximately linear in the range of computing costs in the network. Our subsequent experiments on both synthetic and real-world datasets we collect confirm that our algorithms are able to improve network resource utilization substantially without sacrificing the accuracy of the learned model.", "venue": "IEEE Conference on Computer Communications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "IEEE INFOCOM 2020 - IEEE Conference on Computer Communications", "pages": "2509-2518"}, "authors": [{"authorId": "47072314", "name": "Yuwei Tu"}, {"authorId": "151264628", "name": "Yichen Ruan"}, {"authorId": "35204200", "name": "Satyavrat Wagle"}, {"authorId": "145009961", "name": "Christopher G. Brinton"}, {"authorId": "1393650147", "name": "Carlee Joe-Wong"}], "citations": [{"paperId": "74bd049ccab069131f0ff16968a73765262b34d4", "title": "Accelerating Federated Learning With Cluster Construction and Hierarchical Aggregation"}, {"paperId": "1d90bc6241cff6d77c6ef8a2d1f85930cc8a93b1", "title": "Decentralized Aggregation for Energy-Efficient Federated Learning via D2D Communications"}, {"paperId": "d63835e0a834f6d5c7eee1ce878aff7dc60c826d", "title": "AceFL: Federated Learning Accelerating in 6G-Enabled Mobile Edge Computing Networks"}, {"paperId": "8a9576ef784c451046df9638308a26583cbeaaf7", "title": "Federated Learning for Data Streams"}, {"paperId": "569f46c7147f137107bb31b5bf8f4aace73a181e", "title": "SplitGP: Achieving Both Generalization and Personalization in Federated Learning"}, {"paperId": "8bc7a4bcfbe15b9994456ade3d17b43daea9ba2a", "title": "Energy-Constrained D2D Assisted Federated Learning in Edge Computing"}, {"paperId": "53945286351127feab2bdfcb5ca6312633764db8", "title": "Edge Intelligence: Federated Learning-Based Privacy Protection Framework for Smart Healthcare Systems"}, {"paperId": "e2c1c27b7965fbeca7bef73ee6c09d4ffbe7b32f", "title": "Decentralized Aggregation for Energy-Efficient Federated Learning via Overlapped Clustering and D2D Communications"}, {"paperId": "4ae520323024d21ab582cc94c54349dd3ae409fb", "title": "AI in 5G: The Case of Online Distributed Transfer Learning over Edge Networks"}, {"paperId": "8905fa557d43956d4f326d66d9239222052db2a6", "title": "Contextual Model Aggregation for Fast and Robust Federated Learning in Edge Computing"}, {"paperId": "16748bfd9e120dd8c6ebab1b591694ba04b3942c", "title": "Tackling System and Statistical Heterogeneity for Federated Learning with Adaptive Client Sampling"}, {"paperId": "09cc1383c4986f658bdf998f8b2a6fc464bebecd", "title": "An ensemble learning framework for distributed resource allocation in inteference channels: The two user case"}, {"paperId": "fa4f50e08de6435bb0bb986e2e1212d473a32c75", "title": "FedFog: Network-Aware Optimization of Federated Learning over Wireless Fog-Cloud Systems"}, {"paperId": "7aa03760057a55a52c0c56d5bd408edf3891ffa8", "title": "UAV-Assisted Online Machine Learning Over Multi-Tiered Networks: A Hierarchical Nested Personalized Federated Learning Approach"}, {"paperId": "6d89576c49916b94a324e555dbbd9e8fb576c350", "title": "Optimizing Resource-Efficiency for Federated Edge Intelligence in IoT Networks"}, {"paperId": "175d05fe518d39537aad005e8af04ca40d2c3cfa", "title": "BATS: A Spectral Biclustering Approach to Single Document Topic Modeling and Segmentation"}, {"paperId": "c48f4b1df4a9a216f9c0d7dcf618a0b080ea5ff7", "title": "Fast-Convergent Federated Learning"}, {"paperId": "343ce04f113ffb72d05e7142ffc288b132b0161b", "title": "Network-Aware Optimization of Distributed Learning for Fog Computing"}]}
