{"paperId": "4e994b8b4e100989346fcb28567783eb96aeef9a", "publicationVenue": null, "title": "Amalgamation of Cloud computing with big data", "abstract": "As technology advances, massive amounts of data in many different formats are produced everywhere. The industries that have fueled the growth of data, including retail, media, finance, healthcare, and education, have produced a tremendously large and complicated collection of data that is known as \"big data.\" On the other hand, a virtual service called cloud computing is utilised for processing, data storage, and data mining in order to maximise flexibility and cut costs. It is assisting society in addressing upcoming issues, including large data management, cyber security, and quality control. Additionally, cutting-edge technologies like distributed ledger technology, artificial intelligence, and many other capabilities are becoming accessible as services thanks to cloud computing. The two most important techniques in the field of information technology. These two IT efforts have the potential to transform every aspect of the company and have an impact on how we analyse data. It’s become popular in research to use the cloud environment for large data analysis. This work attempts to comprehend the Cloud Computing technology in Big Data so as to obtain efficient and quick results. Furthermore, the paper sheds light on the challenges faced in the domain and concludes with the future scope of these technologies.", "venue": "2022 Seventh International Conference on Parallel, Distributed and Grid Computing (PDGC)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-25", "journal": {"name": "2022 Seventh International Conference on Parallel, Distributed and Grid Computing (PDGC)", "pages": "67-70"}, "authors": [{"authorId": "2211985696", "name": "Vanshit Gupta"}, {"authorId": "2176887297", "name": "Vansh Verma"}, {"authorId": "4445321", "name": "Supreet Kaur"}, {"authorId": "2059087419", "name": "Inderpreet Kaur"}], "citations": []}
