{"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design", "abstract": "A growth in data volume, combined with increasing demand for real-time analysis (using the most recent data), has resulted in the emergence of database systems that concurrently support transactions and data analytics. These hybrid transactional and analytical processing (HTAP) database systems can support real-time data analysis without the high costs of synchronizing across separate single-purpose databases. Unfortunately, for many applications that perform a high rate of data updates, state-of-the-art HTAP systems incur significant losses in transactional (up to 74.6%) and/or analytical (up to 49.8%) throughput compared to performing only transactional or only analytical queries in isolation, due to (1) data movement be-tween the CPU and memory, (2) data update propagation from transactional to analytical workloads, and (3) the cost to main-tain a consistent view of data across the system. We propose Polynesia, a hardware-software co-designed system for in-memory HTAP databases that avoids the large throughput losses of traditional HTAP systems. Polynesia (1) di-vides the HTAP system into transactional and analytical pro-cessing islands, (2) implements new custom hardware that un-locks software optimizations to reduce the costs of update prop-agation and consistency, and (3) exploits processing-in-memory for the analytical islands to alleviate data movement overheads. Our evaluation shows that Polynesia outperforms three state-of-the-art HTAP systems, with average transactional/analytical throughput improvements of 1.7×/3.7×, and reduces energy consumption by 48% over the prior lowest-energy HTAP sys-tem.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "2997-3011"}, "authors": [{"authorId": "2675748", "name": "Amirali Boroumand"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "2173743", "name": "Geraldo F. Oliveira"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "ef0638c10bba5e53bf348cd3e64c2954dc903d57", "title": "Pathfinding Future PIM Architectures by Demystifying a Commercial PIM Technology"}, {"paperId": "ddfc19af8f21657d46487be8f4fc184c9f8d3da8", "title": "Benchmarking HTAP databases for performance isolation and real-time analytics"}, {"paperId": "b89356d62d3fb25c453a111cb24353dd85225c55", "title": "Design and Analysis of a Processing-in-DIMM Join Algorithm: A Case Study with UPMEM DIMMs"}, {"paperId": "a3dada3e9784680f034eb7e5f724bcdf9e2e15d6", "title": "NHtapDB: Native HTAP Databases"}, {"paperId": "d6d4ca3a7af898732aee6ed32a26eef6f3dc04e3", "title": "ALP: Alleviating CPU-Memory Data Movement Overheads in Memory-Centric Systems"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "3a2548a8286a15e0141dba6008f0eae2ac1ad724", "title": "Flash-Cosmos: In-Flash Bulk Bitwise Operations Using Inherent Computation Capability of NAND Flash Memory"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "8993082c9ae0fcd5f0545a850e5e4ef09a2d17d5", "title": "A191 THE NEURAL SIGNAL, CALCITONIN GENE-RELATED PEPTIDE (CGRG) ENHANCES A REGULATORY PHENOTYPE IN THE HUMAN IL-4-TREATED MACROPHAGE"}]}
