{"paperId": "4eb966f43278e594be9359bdaf5ed89dd9969e49", "publicationVenue": {"id": "bc2801b8-b059-4ee4-be9a-cd1943f45bf3", "name": "Information Systems", "type": "journal", "alternate_names": ["Inf Syst"], "issn": "0306-4379", "alternate_issns": ["2156-0749"], "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/236/description#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/03064379", "https://www.journals.elsevier.com/information-systems"]}, "title": "Efficient query evaluation techniques over large amount of distributed linked data", "abstract": "As RDF becomes more widely established and the amount of linked data is rapidly increasing, the efficient querying of large amount of data becomes a significant challenge. In this paper, we propose a family of algorithms for querying large amount of linked data in a distributed manner. These query evaluation algorithms are independent of the way the data is stored, as well as of the particular implementation of the query evaluation. We then use the MapReduce paradigm to present a distributed implementation of these algorithms and experimentally evaluate them, although the algorithms could be straightforwardly translated into other distributed processing frameworks. We also investigate and propose multiple query decomposition approaches of Basic Graph Patterns (subclass of SPARQL queries) that are used to improve the overall performance of the distributed query answering. A deep analysis of the effectiveness of these decomposition algorithms is also provided.", "venue": "Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-12", "journal": {"name": "Inf. Syst.", "pages": "102194", "volume": "115"}, "authors": [{"authorId": "2561853", "name": "Eleftherios Kalogeros"}, {"authorId": "1727035", "name": "M. Gergatsoulis"}, {"authorId": "1708147", "name": "M. Damigos"}, {"authorId": "1686692", "name": "C. Nomikos"}], "citations": [{"paperId": "ca03a742676735a7252e9545565e48fdf9e1fcff", "title": "Grouping Analysis of QCA for International Ecotourism Destinations in Cloud Computing Era of Geo-ecology"}, {"paperId": "0846b19821a9f8ba1c02c7c1d576d8db2c5a5c78", "title": "A Real-Time Approach for Smart Building Operations Prediction Using Rule-Based Complex Event Processing and SPARQL Query"}, {"paperId": "c349e7422fc8f24c6bca337ec66f09e5fc85d7db", "title": "Effective and Efficient Generation of Candidate Networks for Top-k Keyword Search in Relational Database"}]}
