{"paperId": "4ecf257175c2ea67604cae73219659e073b2fef2", "publicationVenue": null, "title": "BCadvisor: Enabling Green Blockchain Systems Through Resource-Oriented Benchmarking", "abstract": "As an emerging technique, blockchain becomes widely-adopted in numerous fields, including supply chain, cloud computing, smart healthcare, etc. Nonetheless, some drawbacks, especially the high resource cost, also expose with the deepening of blockchain applications. Moreover, we lack the standard tools for benchmarking blockchain’s resource efficiency. In this case, even researchers keep on proposing lightweight blockchains, we have no idea about their actual validity. Generally speaking, two daunting challenges are yet to be addressed, i.e., the compatible framework and the resource-oriented benchmarking metrics. Motivated by such facts, this paper presents a resource-oriented blockchain benchmarking tool, named BCadvisor. Specifically, we develop a modular architecture, with three collaborating models. Such framework not only realizes a pipeline for data parsing, metric storage, and result visualization but also can easily support any new blockchain. Furthermore, we design a novel process named Three-step Resource-oriented Benchmarking (TsRoB), which divides the blockchain into 4 layers and evaluates the resource efficiency of each layer. Finally, we conduct comprehensive benchmarking on four representative blockchains and discuss the results. Our experiments can serve as a guideline for researchers in pursuing green blockchain running.", "venue": "ICC 2022 - IEEE International Conference on Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-16", "journal": {"name": "ICC 2022 - IEEE International Conference on Communications", "pages": "4031-4036"}, "authors": [{"authorId": "2053225439", "name": "Kai Qian"}, {"authorId": "1604963638", "name": "Yinqiu Liu"}, {"authorId": "2115631535", "name": "Yamin Han"}, {"authorId": "144547968", "name": "Kun Wang"}], "citations": [{"paperId": "121b11ce09c7e2b74970a4ae0960eddbdf944331", "title": "HPCchain: A Consortium Blockchain System Based on CPU-FPGA Hybrid-PUF for Industrial Internet of Things"}, {"paperId": "44fbe3b224403a8b3446684c08f1237675eb45cb", "title": "Green blockchain – A move towards sustainability"}]}
