{"paperId": "4ecf95d7305b6c5fd55be01388211457edbaf910", "publicationVenue": {"id": "f9f6fa4f-558c-4f4b-b702-6e707e8b5d57", "name": "Frontiers in Communications and Networks", "alternate_names": ["Front Commun Netw"], "issn": "2673-530X", "url": "https://www.frontiersin.org/journals/communications-and-networks#"}, "title": "Smarter Grid in the 5G Era: A Framework Integrating Power Internet of Things With a Cyber Physical System", "abstract": "As the energy infrastructure of smart cities, smart grid upgrades traditional power grid systems with state-of-the-art information and communication technologies. In particular, as the full deployment of the Internet of Things in the power grid (a.k.a. power Internet of Things or PIoT), the newly introduced information flow together with inherent energy flow makes it more efficient for power generation, transmission, distribution, and consumption. To further exploit the precious energy and the latest 5G technologies, this article boosts to add a value flow in the smart grid, mainly including the value created by innovative services and market mechanisms and the value added by the information flow. Specifically, by integrating PIoT with cyber-physical systems, this article sketches a conceptual framework of the cyber-physical power system (CPPS). The CPPS carries out holistic perception and ubiquitous connection of distributed energy sources and electrical facilities and builds up a smarter power grid with global information interaction, intelligent decision-making, and real-time agile control. Finally, for illustration purposes, we conduct a case study regarding an intelligent home management system.", "venue": "Frontiers in Communications and Networks", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-06-24", "journal": {"volume": "2"}, "authors": [{"authorId": "2143861733", "name": "Yuanjie Liu"}, {"authorId": "2911200", "name": "Xiongping Yang"}, {"authorId": "3242469", "name": "Wenkun Wen"}, {"authorId": "1731290", "name": "Minghua Xia"}], "citations": [{"paperId": "fc581c4b8f76ab58b3c1a8b244f89f883f40c5cc", "title": "Design of an Intelligent Decision Model for Power Grid Fault Location and Isolation based on Topology Analysis"}, {"paperId": "4c6525081fd3292b639abd62628f989c7f84a79e", "title": "Virtual‐physical power flow method for cyber‐physical power system contingency and vulnerability assessment"}, {"paperId": "38983cd8f168c0410e5c646d10264f6ec61ab5c5", "title": "An Optimal Scheduling Technique for Smart Grid Communications over 5G Networks"}, {"paperId": "5964761705d34436da94cdeada1c89441ac72a8c", "title": "Control coordination in inverter‐based microgrids using AoI‐based 5G schedulers"}, {"paperId": "65fc4282242d5a5d3df702c256982cecc8e1c63a", "title": "Enabling Remote Elderly Care: Design and Implementation of a Smart Energy Data System with Activity Recognition"}, {"paperId": "a89386acad1d07de645053a79a0f4f4b25e1374f", "title": "A Survey of Internet of Things and Cyber-Physical Systems: Standards, Algorithms, Applications, Security, Challenges, and Future Directions"}, {"paperId": "76b5d8dbde926fc12189a9c8e62eaa6da2fe847c", "title": "Implementation of the Internet of Things Technology in the Smart Power Grid"}, {"paperId": "a904f96804cd76389df1e4c2f5a1529c8863a1e9", "title": "Design and Development of Smart Cities using Nano generators in 5G-IoT"}, {"paperId": "a9995857e7728f52346c98aacf38e12f3ec1c014", "title": "5G Software-defined Networks for Power Internet of things"}, {"paperId": "6a0448819f16f8c2c03bd08b26128b65c24eb10f", "title": "A Survey on IoT-Enabled Smart Grids: Emerging, Applications, Challenges, and Outlook"}, {"paperId": "a8c28c9532e842fea5c24b6e19a1dddf204719e0", "title": "Smart Grid based Wireless Communication in 5G Network for Monitoring and Control Systems in Renewable Energy Management"}, {"paperId": "4ef1977270219e89c004ef0ddbf26594e1d9ed69", "title": "A Hierarchical Federated Learning-Based Intrusion Detection System for 5G Smart Grids"}, {"paperId": "bf5a8c4b5642cae128b2ae70cc0d7e969999472a", "title": "A Review of Using IoT for Energy Efficient Buildings and Cities: A Built Environment Perspective"}, {"paperId": "bafb1f96e381179eef4962947a04f1d030bdedbf", "title": "Climate policy for a net-zero future: ten recommendations for Direct Air Capture"}, {"paperId": "1132434b672c0a358941eefec6fe9c3744b89b8b", "title": "Construction of Operation Portraits Based on a Cloud Model for Power Distribution Networks"}, {"paperId": "311699e6d75b7661a7c0b92c5406ffbac9a90549", "title": "A Cyber-Physical Approach for Residential Energy Management: Current State and Future Directions"}, {"paperId": "a9293552adb205aa408d91af2437f3e4875f463c", "title": "Impact of Demand Response on Optimal Sizing of Distributed Generation and Customer Tariff"}, {"paperId": "0fc21496062e5b58424c36698389cddfc6ecb5a7", "title": "Cooperative Control of Microgrids: A Review of Theoretical Frameworks, Applications and Recent Developments"}, {"paperId": "2a928e795dfe0cb21e87777dbaf8b4467eedac50", "title": "Novel Industry Architectures for Connectivity Solutions in the Smart Distribution Grids"}, {"paperId": "5f5fea52a8107f2c338ca696366ce8e291823cb5", "title": "A secondary strategy for unbalance consensus in an islanded voltage source converter-based microgrid using cooperative gain control"}, {"paperId": "7bbe730606d9638bbeabd0ba828a348612d50355", "title": "Predicting Trends and Research Patterns of Smart Cities: A Semi-Automatic Review Using Latent Dirichlet Allocation (LDA)"}]}
