{"paperId": "4ee2dc5fb60d870ad6576a29ea8309afaec3f711", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Accelerating Raw Data Analysis with the ACCORDA Software and Hardware Architecture", "abstract": "The data science revolution and growing popularity of data lakes make efficient processing of raw data increasingly important. To address this, we propose the ACCelerated Operators for Raw Data Analysis (ACCORDA) architecture. By extending the operator interface (subtype with encoding) and employing a uniform runtime worker model, ACCORDA integrates data transformation acceleration seamlessly, enabling a new class of encoding optimizations and robust high-performance raw data processing. Together, these key features preserve the software system architecture, empowering state-of-art heuristic optimizations to drive flexible data encoding for performance. ACCORDA derives performance from its software architecture, but depends critically on the acceleration of the Unstructured Data Processor (UDP) that is integrated into the memory-hierarchy, and accelerates data transformation tasks by 16x-21x (parsing, decompression) to as much as 160x (deserialization) compared to an x86 core.\n We evaluate ACCORDA using TPC-H queries on tabular data formats, exercising raw data properties such as parsing and data conversion. The ACCORDA system achieves 2.9x-13.2x speedups when compared to SparkSQL, reducing raw data processing overhead to a geomean of 1.2x (20%). In doing so, ACCORDA robustly matches or outperforms prior systems that depend on caching loaded data, while computing on raw, unloaded data. This performance benefit is robust across format complexity, query predicates, and selectivity (data statistics). ACCORDA's encoding-extended operator interface unlocks aggressive encoding-oriented optimizations that deliver 80% average performance increase over the 7 affected TPC-H queries.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1568-1582", "volume": "12"}, "authors": [{"authorId": "3239866", "name": "Yuanwei Fang"}, {"authorId": "2056651789", "name": "Chen Zou"}, {"authorId": "1695232", "name": "A. Chien"}], "citations": [{"paperId": "052a88ef09e1e365b98c7906daaa18853d50b6fa", "title": "CXL and the Return of Scale-Up Database Engines"}, {"paperId": "6ba7db9a078598a68914e36c135492db4aa3225f", "title": "ACCL+: an FPGA-Based Collective Engine for Distributed Applications"}, {"paperId": "c0a2500aa1517d8674a131b75359e7dce980a71c", "title": "Data Processing with FPGAs on Modern Architectures"}, {"paperId": "303ce365ef844f98adc023b74ad1c48f22a5bcce", "title": "Data Transformation Acceleration using Deterministic Finite-State Transducers"}, {"paperId": "272a2e609f6803e27166cfb80d4baf96f753e95d", "title": "ECI: a Customizable Cache Coherency Stack for Hybrid FPGA-CPU Architectures"}, {"paperId": "02049c8dba090cfd4efb2e067262a3b5607dc491", "title": "Raw Filtering of JSON Data on FPGAs"}, {"paperId": "0c305f7ba271256023ba1c8448a10d77ae368e83", "title": "Computational Storage to Increase the Analysis Capability of Tier-2 HEP Data Sites"}, {"paperId": "67a188f6b28d0b2e11afea673bd67000752d0926", "title": "Farview: Disaggregated Memory with Operator Off-loading for Database Engines"}, {"paperId": "63090bbed41c1125162839c80d0231d9ac984715", "title": "Good to the Last Bit: Data-Driven Encoding with CodecDB"}, {"paperId": "42c8759c84b15e8dc0844ab1d68b3d8ca29801f0", "title": "Making Search Engines Faster by Lowering the Cost of Querying Business Rules Through FPGAs"}, {"paperId": "6c73be8cb4b89699afc94d7f5e79b023ae7b6809", "title": "Modularis: Modular Relational Analytics over Heterogeneous Distributed Platforms"}, {"paperId": "5c573e77829a606008bcb2bd0737b93cef3a5a5b", "title": "Modularis: Modular Data Analytics for Hardware, Software, and Platform Heterogeneity"}, {"paperId": "1fa72c835e6b1a38a2549bbbf4f3e9a0f6c9a23d", "title": "The collection Virtual Machine: an abstraction for multi-frontend multi-backend data analysis"}, {"paperId": "239f3d7411a02d82d0fcdeb958746b935a33b4bf", "title": "Empowering Architects and Designers: A Classification of What Functions to Accelerate in Storage"}, {"paperId": "9466ce17eefdc3d4e21d36a6802171a3194695c9", "title": "Tackling Hardware/Software co-design from a database perspective"}, {"paperId": "98b4b9fea18c73933c7f43cd6941f116c2033154", "title": "Compilation-assisted performance acceleration for data analytics"}, {"paperId": "2124b05787565b1a44b9496b92a10b9999c1c6df", "title": "HPC Performance Improvements Through Innovative Architecture"}]}
