{"paperId": "4ee7f64ff8cd0974645959937a289d87fff45b4e", "publicationVenue": null, "title": "Spatial Distribution of Displaced Population Estimated Using Mobile Phone Data to Support Disaster Response Activities", "abstract": "Under normal circumstances, people’s homes and work locations are given by their addresses, and this information is used to create a disaster management plan in which there are instructions to individuals on how to evacuate. However, when a disaster strikes, some shelters are destroyed, or in some cases, distance from affected areas to the closest shelter is not reasonable, or people have no possibility to act rationally as a natural response to physical danger, and hence, the evacuation plan is not followed. In each of these situations, people tend to find alternative places to stay, and the evacuees in shelters do not represent the total number of the displaced population. Knowing the spatial distribution of total displaced people (including people in shelters and other places) is very important for the success of the response activities which, among other measures, aims to provide for the basic humanitarian needs of affected people. Traditional methods of people displacement estimation are based on population surveys in the shelters. However, conducting a survey is infeasible to perform at scale and provides low coverage, i.e., can only cover the numbers for the population that are at the shelters, and the information cannot be delivered in a timely fashion. Therefore, in this research, anonymized mobile Call Detail Records (CDRs) are proposed as a source of information to infer the spatial distribution of the displaced population by analyzing the variation of home cell-tower for each anonymized mobile phone subscriber before and after a disaster. The effectiveness of the proposed method is evaluated using remote-sensing-based building damage assessment data and Displacement Tracking Matrix (DTM) from an individual’s questionnaire survey conducted after a severe cyclone in Beira city, central Mozambique, in March 2019. The results show an encouraging correlation coefficient (over 70%) between the number of arrivals in each neighborhood estimated using CDRs and from DTM. In addition to this, CDRs derive spatial distribution of displaced populations with high coverage of people, i.e., including not only people in the shelter but everyone who used a mobile phone before and after the disaster. Moreover, results suggest that if CDRs data are available right after a disaster, population displacement can be estimated, and this information can be used for response activities and hence contribute to reducing waterborne diseases (e.g., diarrheal disease) and diseases associated with crowding (e.g., acute respiratory infections) in shelters and host communities.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-20", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "421", "volume": "10"}, "authors": [{"authorId": "51249576", "name": "S. Cumbane"}, {"authorId": "1728613", "name": "Gyözö Gidófalvi"}], "citations": [{"paperId": "0526c3c17f9a54ab61d17fcc202295dd6793c070", "title": "Using mobile phone data to map evacuation and displacement: a case study of the central Italy earthquake"}, {"paperId": "f0ae1f3616913d04e6ec96dbc45ea1acc4816704", "title": "Disparities in mobile phone ownership reflect inequities in access to healthcare"}, {"paperId": "b09bcfd3d424081fc6f5c3d7438c729107b6ce1c", "title": "Human mobility data and analysis for urban resilience: A systematic review"}]}
