{"paperId": "4ee87265c4d83723e70f811d5fd55330f38aec86", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Refiner GAN Algorithmically Enabled Deep-RL for Guaranteed Traffic Packets in Real-time URLLC B5G Communication Systems", "abstract": "Ultra-reliable and Low-latency Communications (URLLC) is expected to be one of the most critical characteristics in Beyond fifth-Generation (B5G) cellular networks with stringent low latency and high-reliability requirements. The Deep Reinforcement Learning (deep-RL) framework has been applied to predict the optimization of a Resource Block (RB) and minimize Power Allocation (PA) to guarantee a high End-to-End (E2E) reliability and low E2E latency under rate constraints. This paper proposes a novel Policy Gradient-based Actor-Critic Learning (PGACL) algorithm to optimize the policy gradient for optimal rate allocation to solve the RB, minimize power, and guarantee a solution for URLLC scheduling. The purpose of a PGACL algorithm is to provide a good policy with a closer convergence rate and a low computational cost depending on the reduced action space for every user. URLLC systems need to operate in highly reliable systems and account for extreme network conditions. Therefore, we proposed the refiner Generative Adversarial Networks (GANs) that apply enough extreme events for the deep-RL agent to generate synthetic data with high reliability similar to real data based on the regulated number of extreme events in the dataset. This refiner GAN method enables a deep-RL approach to generate large amounts of data practically used in real-time operation. Simulation results showed that the proposed deep-RL for refiner-GAN can omit the transient training time and develop deep-learning based on a controlled set of unlabeled real traffic at a relatively short time. Furthermore, the refiner GAN demonstrated 99.9999% reliability and E2E latency of less than 1.4ms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "32557756", "name": "A. Salh"}, {"authorId": "1874985", "name": "L. Audah"}, {"authorId": "1708549", "name": "K. S. Kim"}, {"authorId": "2988183", "name": "S. Alsamhi"}, {"authorId": "9287356", "name": "Mohammed A. Alhartomi"}, {"authorId": "123456218", "name": "Qazwan Abdullah  (غزوان عبد الله محمد طربوش)"}, {"authorId": "31175080", "name": "Faris. A. Almalki"}, {"authorId": "7399020", "name": "H. Algethami"}], "citations": [{"paperId": "fd22a7dbd21a2524eba762f3a28809870246cc81", "title": "Wireless 6G Connectivity for Massive Number of Devices and Critical Services"}, {"paperId": "718b20c958691fa86cde23cf157ed2d5600ea17f", "title": "Spectrum Efficiency Enhancement for Cell-Free Massive MIMO Through Large-Scale Fading"}, {"paperId": "4e2b991c310d1b6b47ce3fc1b33c29f3f097a8c4", "title": "Optimized Design with Artificial Intelligence Quantum Dot White Mini LED Backlight Module Development"}, {"paperId": "4ff6329c0118f204826b8dbfc885ddee1a71726e", "title": "Physical layer security of cognitive radio networks with adaptive transmit power and multi-antenna energy harvesting"}, {"paperId": "fb7216f743dceef4cc699ac45b81d9240fd6a492", "title": "New Reward-Clipping Mechanism in Deep -Learning Enabled Internet of Things in 6G to Improve Intelligent Transmission Scheduling"}, {"paperId": "8e8137981bffb0cccdd6bdd872fdd2f9c8fcc432", "title": "Developing an Intelligent Cellular Structure Design for a UAV Wireless Communication Topology"}, {"paperId": "44c0051de5246d5298103beb4704c0aad53f6886", "title": "A New Technique for Improving Energy Efficiency in 5G Mm-wave Hybrid Precoding Systems"}, {"paperId": "0b80609992f64c19d9e38a671c13665d826996d4", "title": "Estimation Large- Scale Fading Channels for Transmit Orthogonal Pilot Reuse Sequences in Massive MIMO System"}, {"paperId": "fa7eb0cf7d2024fcecb34575ee5a166020c6d644", "title": "Hierarchical Analysis Process for Belief Management in Internet of Drones"}, {"paperId": "d66c147ee2f1f003f0e5b3fdba3c260e8a8b43d4", "title": "Computing in the Sky: A Survey on Intelligent Ubiquitous Computing for UAV-Assisted 6G Networks and Industry 4.0/5.0"}, {"paperId": "dc0c803cc91895600f562432ad3941c73eb9efc0", "title": "Reinforcement Learning-Empowered Mobile Edge Computing for 6G Edge Intelligence"}, {"paperId": "68d206ae53d7db2e24d53d2b5a91571dccd47416", "title": "One-Bit Massive MIMO Precoding Using Unsupervised Deep Learning"}, {"paperId": "bf1c888efa4726f045492ccceff489b5209c38e8", "title": "D2D Cooperative Communication Network Resource Allocation Algorithm Based on Improved Monte Carlo Tree Search"}, {"paperId": "1fa86d9cdc465e9f179728bf54aa11ad547a1b5a", "title": "A Comprehensive Review on Artificial Intelligence/Machine Learning Algorithms for Empowering the Future IoT Toward 6G Era"}, {"paperId": "86dc169125d138b10a6cf0678668824288def5b2", "title": "A Hybrid Latency- and Power-Aware Approach for Beyond Fifth-Generation Internet-of-Things Edge Systems"}, {"paperId": "1e8a002f625572deb7c5b56c021e6262acc3d666", "title": "Intrusion Prevention Scheme Against Rank Attacks for Software-Defined Low Power IoT Networks"}, {"paperId": "166d6fc65564d6420b9542d929959513ead6ec43", "title": "Energy-Efficient QoE-Driven Radio Resource Management Method for 5G and Beyond Networks"}]}
