{"paperId": "4ef12a41d713dc9c1dc41fa0b325a953c3913dd5", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Transformer With Bidirectional GRU for Nonintrusive, Sensor-Based Activity Recognition in a Multiresident Environment", "abstract": "Several techniques for human activity recognition (HAR) in a smart indoor environment have been developed and improved along with the rapid advancement of sensor technologies. However, recognizing multiple people’s activities is still challenging due to the complexity of their activities, such as parallel and collaborative activities. To address these challenges, we propose a transformer with a bidirectional gated recurrent unit (GRU) deep learning (DL) method, called TRANS-BiGRU, to efficiently learn and recognize different types of activities performed by multiple residents. We compare the proposed model with the state-of-the-art models and various DL models, such as Ensemble2LSTM (Ens2-LSTM), bidirectional GRUs (Bi-GRU), and traditional machine learning (ML) models, such as support vector machine (SVM). Our experimental results based on the center for advanced studies in adaptive system and ARAS public data sets show that our model significantly outperforms the existing models for complex activity recognition of multiple residents.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "23716-23727", "volume": "9"}, "authors": [{"authorId": "2158194196", "name": "Dong Chen"}, {"authorId": "1801191", "name": "Sira Yongchareon"}, {"authorId": "47237254", "name": "E. Lai"}, {"authorId": "2155521472", "name": "Jian Yu"}, {"authorId": "120607997", "name": "Quan.Z Sheng"}, {"authorId": "2110450799", "name": "Yafeng Li"}], "citations": [{"paperId": "09cee72c6bf730a4a59abfa18a1b7083ec0fcddd", "title": "A Survey on Deep Learning and State-of-the-art Applications"}, {"paperId": "8e354c74ee9ba52097112195d1fe724558e06404", "title": "GRU–Transformer: A Novel Hybrid Model for Predicting Soil Moisture Content in Root Zones"}, {"paperId": "b90526a2347fab0d03b5ca43121226015724228e", "title": "Gated recurrent unit decision model for device argumentation in ambient assisted living"}, {"paperId": "506629fdd8fe9027250124b12a663c6a0a0e4393", "title": "Human Activity Recognition Based on Continuous-Wave Radar and Bidirectional Gate Recurrent Unit"}, {"paperId": "bf15c148bfdc1e5a9996b08a667a95267def335a", "title": "A Survey on Multi-Resident Activity Recognition in Smart Environments"}, {"paperId": "a2d3597cd561d501519c5d0046f9bc25bd753668", "title": "A Survey on Ambient Sensor-Based Abnormal Behaviour Detection for Elderly People in Healthcare"}, {"paperId": "54caac32d01c63c262736c06a218ab3712183a75", "title": "Temporal Transformer Networks With Self-Supervision for Action Recognition"}]}
