{"paperId": "4ef39643f5372a5fba76b3c07f8369dfcfa47347", "publicationVenue": {"id": "1c9b6047-50f4-48e7-8c4d-0ffb528c1d30", "name": "Dementia and Geriatric Cognitive Disorders", "type": "journal", "alternate_names": ["Dement Geriatr Cogn Disord"], "issn": "1420-8008", "url": "https://www.karger.com/Journal/Home/224226"}, "title": "Explainable Alzheimer’s Disease Detection Using Linguistic Features from Automatic Speech Recognition", "abstract": "Introduction: Alzheimer’s disease (AD) is the most prevalent type of dementia and can cause abnormal cognitive function and progressive loss of essential life skills. Early screening is thus necessary for the prevention and intervention of AD. Speech dysfunction is an early onset symptom of AD patients. Recent studies have demonstrated the promise of automated acoustic assessment using acoustic or linguistic features extracted from speech. However, most previous studies have relied on manual transcription of text to extract linguistic features, which weakens the efficiency of automated assessment. The present study thus investigates the effectiveness of automatic speech recognition (ASR) in building an end-to-end automated speech analysis model for AD detection. Methods: We implemented three publicly available ASR engines and compared the classification performance using the ADReSS-IS2020 dataset. Besides, the SHapley Additive exPlanations algorithm was then used to identify critical features that contributed most to model performance. Results: Three automatic transcription tools obtained mean word error rate texts of 32%, 43%, and 40%, respectively. These automated texts achieved similar or even better results than manual texts in model performance for detecting dementia, achieving classification accuracies of 89.58%, 83.33%, and 81.25%, respectively. Conclusion: Our best model, using ensemble learning, is comparable to the state-of-the-art manual transcription-based methods, suggesting the possibility of an end-to-end medical assistance system for AD detection with ASR engines. Moreover, the critical linguistic features might provide insight into further studies on the mechanism of AD.", "venue": "Dementia and Geriatric Cognitive Disorders", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-11", "journal": {"name": "Dementia and Geriatric Cognitive Disorders", "pages": "240 - 248", "volume": "52"}, "authors": [{"authorId": "2221938579", "name": "Lijuan Tang"}, {"authorId": "2148905998", "name": "Zhenglin Zhang"}, {"authorId": "2222438523", "name": "Feifan Feng"}, {"authorId": "2116836263", "name": "Lizhuang Yang"}, {"authorId": "2115211006", "name": "Hai Li"}], "citations": [{"paperId": "5d3015f4dedf88610ba9d92167a9d7f6656761c9", "title": "Contents"}]}
