{"paperId": "4f11288956dddac97cee2b0a9362cea26bb8dd48", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Revealing Complex Functional Topology Brain Network Correspondences Between Humans and Marmosets", "abstract": "Functional correspondences are known to exist within the brains of both human and non-human primates; however, our understanding of this phenomenon remains largely incomplete. The examination of the topological characteristics inherent in whole-brain functional connectivity bears immense promise in elucidating shared as well as distinctive patterns across different species. In this investigation, we applied topological graph analysis to brain networks and scrutinized the congruencies and disparities within the connectomes of human and marmoset monkey brains. The findings brought to light noteworthy similarities in functional connectivity patterns distributed across the entire brain, with a particular emphasis on the dorsal attention network, default mode network and visual network. Moreover, we discerned unique neural connections between humans and marmosets during both resting and task-oriented states. In essence, our study reveals a combination of shared and divergent functional brain connections underlying spontaneous and specific cognitive functions across these two species.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Biology", "Medicine"], "publicationTypes": null, "publicationDate": "2023-08-20", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2146262430", "name": "Qiang Li"}, {"authorId": "2132419391", "name": "V. Calhoun"}, {"authorId": "2602754", "name": "A. Iraji"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "dd558ef71778066d96dc9efc5d00025dc66cfda9", "title": "Exploring Nonlinear Dynamics In Brain Functionality Through Phase Portraits And Fuzzy Recurrence Plots"}, {"paperId": "ca7f1890eb32ee92e986049402a9146870ebbf53", "title": "COMPLEXITY MEASURES OF PSYCHOTIC BRAIN ACTIVITY IN THE FMRI SIGNAL"}]}
