{"paperId": "4f12c4fe4a0bb08c81f8b9dc5a2833a4d4b82bc7", "publicationVenue": {"id": "e9883e67-315e-4b98-a80a-5136298bf7a4", "name": "International Journal of Remote Sensing", "type": "journal", "alternate_names": ["Int J Remote Sens"], "issn": "0143-1161", "url": "https://www.tandfonline.com/toc/tres20/current"}, "title": "Exploring unmanned aerial systems operations in wildfire management: data types, processing algorithms and navigation", "abstract": "ABSTRACT Wildfire, also known as forest fire, is a common natural or man-made disaster that has caused devastation to both man-made structures and natural ecosystems throughout the world. Unmanned Aerial Systems (UAS)-based remote sensing (RS) provides valuable support for wildfire management efforts, enhancing both spatial and temporal resolution. The aim of this paper is to summarize the current applications of UAS operations for combating the wildfire worldwide. RS applications of UAS has been explored during the three stages of wildfire, including Pre-fire, Active-fire, and Post-fire, with a particular emphasis on the types of information collected and data processing methods. The pre-fire section assesses fire potentials, the active-fire stage focuses on fire surveillance and propagation, while the post-fire stage focuses on studies assessing wildfire impact using UAS. In addition, the review provides a comprehensive overview of UAS navigation techniques adapted to fire surveillance. The literature review was conducted using three bibliographic databases, including Science Direct, IEEE Explore, and Scopus, and 186 articles relevant to UAS applications in wildfires were manually gathered. This literature review encompasses 119 articles focused on RS, 40 articles related to navigation, and the remaining articles covering reviews, concept proposals, UAS designs, and solutions addressing technical limitations of UASs in the context of wildfire management. This review offers a comprehensive overview of recent UAS operations for future researchers aiming to utilize UAS technologies for efficient wildfire management. The findings highlight the need for further investigation into the onboard computational capacities of Artificial Intelligence (AI) algorithms, precise fuel load estimation, considering individual vegetation, and field experiments to evaluate and validate navigation algorithms.", "venue": "International Journal of Remote Sensing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-17", "journal": {"name": "International Journal of Remote Sensing", "pages": "5628 - 5685", "volume": "44"}, "authors": [{"authorId": "2244467172", "name": "Pirunthan Keerthinathan"}, {"authorId": "2156326085", "name": "Narmilan Amarasingam"}, {"authorId": "2244416255", "name": "Grant Hamilton"}, {"authorId": "144637786", "name": "Felipe Gonzalez"}], "citations": [{"paperId": "db1e8c73ed6cd5f5c2b7ac1906484a2f6d2fed73", "title": "Design and implementation for a UAV-based streaming media system"}, {"paperId": "bc7f1f26f8c2b7aa824975bc2df6054d34354e5f", "title": "Domestic experience of unmanned aerial vehicles for forest conditions monitoring"}, {"paperId": "afcb59f1e311550c4b5d6245e76c117b98162657", "title": "Using computer vision to detect and segment fire behavior 1 classifications in UAS-captured images"}]}
