{"paperId": "4f23232d1eb26f2d75b65d9efe22bbcd63eb20d4", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Blockchain and Federated-Learning empowered secure and trustworthy vehicular traffic", "abstract": "Emergence of the autonomous and connected vehicles and modern vehicular networks improved the quality of the traditional transportation system. However, because of the increased usage of software and the development of wireless interfaces, vehicular networks, autonomous vehicles, and the overall transportation infrastructure are vulnerable to cyberattacks. Intrusion detection mechanisms (IDM) can be easily tailored in response to the increasing attack surface. Deep learning algorithms have made tremendous progress in detecting such malicious attack traffic. On the other hand, Existing IDM requires network devices with high computational capabilities to continuously train and update complicated network models, which limits intrusion detection systems’ efficiency and defence potential due to restricted resources and late model updates. Therefore to address this issue, this paper proposes a cooperative intrusion detection mechanism that distributes the training model across dispersed edge devices (such as linked automobiles, autonomous vehicles and roadside units (RSU)). Furthermore, we used the distributed federated learning approach to limit the centralised server’s operating functionalities during the model training phase. Signficantly adopting the federated learning mechanism helps to improve the overall data privacy in the transportation system. Notably, we used blockchain technology to ensure the authenticity and security of the aggregated training model. This paper examines typical attacks and demonstrates that the suggested solution preserves cooperative privacy for vehicular traffic systems while lowering computing costs for training the deep learning model to develop the autonomous, intelligent, distributed intrusion detection mechanism.", "venue": "International Conference on Utility and Cloud Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE/ACM 15th International Conference on Utility and Cloud Computing (UCC)", "pages": "346-351"}, "authors": [{"authorId": "1785380889", "name": "Banhirup Sengupta"}, {"authorId": "46257562", "name": "Souvik Sengupta"}, {"authorId": "2211631922", "name": "Susham Nandi"}, {"authorId": "1820938061", "name": "Anthony Simonet-Boulogne"}], "citations": []}
