{"paperId": "4f26b1852ad2a526d7853d9a5b4b406bb5ba0770", "publicationVenue": {"id": "6625af65-e8dc-49f0-93fb-69824c0657c1", "name": "Machines", "issn": "2075-1702", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318010", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318010", "https://www.mdpi.com/2075-1702/5/4/24", "https://www.mdpi.com/journal/machines"]}, "title": "Development of an Intelligent Quality Management System for Micro Laser Welding: An Innovative Framework and Its Implementation Perspectives", "abstract": "Laser micro-welding manufacturers face substantial challenges in verifying weldment quality, as the industry and applications are requiring increasingly the miniaturization and compactness of products. The problem is compounded by new stringent demands for personalized products at competitive, low costs and the highest quality levels. High-pressure equipment manufacturers, in particular, rely on ISO 3834:2021 to assure and demonstrate best welding practices but also to manage risks associated with liability issues. ISO 3834:2021, like all conventional quality management systems, offers a one-dimensional, quasi-static overview of welding quality that may fail to deal with these new challenges and underlying complexities required to deal effectively with process variability. This paper presents a framework for welding companies to integrate horizontally their suppliers and customers with their processes and products, which are also integrated vertically in the context of Smart Manufacturing or Industry 4.0. It is focused on the development of a smart quality management system for intelligent digitization of all company manufacturing and business processes. Furthermore, an innovative data-based welding quality management framework is described for laser micro-welding applications and their implementation perspectives. The research is driven by an inductive methodology and based on a seamless integration of engineering-oriented heuristic and empirical approaches that is appropriate for intelligent and autonomous quality management, given the lack of research in this niche, but increasingly important topic area.", "venue": "Machines", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-26", "journal": {"name": "Machines"}, "authors": [{"authorId": "2135961076", "name": "José Luis Velázquez de la Hoz"}, {"authorId": "2114148375", "name": "K. Cheng"}], "citations": [{"paperId": "fe21142e0718a5604a5cb56554ff548d95e2b216", "title": "Investigation on the modeling and simulation of hydrodynamics in asymmetric conduction laser micro-welding of austenitic stainless steel and its process optimization"}, {"paperId": "650f9e2235cc07e49e20fa209848a407458143fd", "title": "Online Simulation at Machine Level: A Systematic Review"}, {"paperId": "bf77ca76cc65c2d97811df738901bd77b1ea8b1b", "title": "A roadmap for selection of metal welding process: a review and proposals"}, {"paperId": "bf9c184622e45e14b019b53891e0685888f0d3e6", "title": "Advanced Autonomous Machines and Design Developments"}, {"paperId": "612be9fa15c34c3d3a62478c365d4b69febd81a4", "title": "Construct Six Sigma DMAIC Improvement Model for Manufacturing Process Quality of Multi-Characteristic Products"}, {"paperId": "d0696648cb4b33bd0c686b72b149fba3a279f1b5", "title": "金属材料激光微焊接研究进展（特邀）"}]}
