{"paperId": "4f2e118dfa0035ada9675a69de849cc035c56c96", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Adaptive-Learning-Based Vehicle-to-Vehicle Opportunistic Resource-Sharing Framework", "abstract": "With an ever-increasing number of connected devices on roads, it becomes unsustainable to provide nearby specialized execution resources (compute and storage) for servicing innovative applications. Moreover, the vehicular environment being inherently ad hoc and opportunistic, not to mention highly mobile, makes it unsuitable to use traditional cloud computing due to delayed and interrupted services. Thus, there is a possibility to introduce potential collaboration among nearby connected vehicles. However, the underlying decision model for the selection of the most suitable vehicle for task offloading is challenging in such a dynamic environment. In this study, we propose a collaborative vehicular computing framework that adopts online learning for efficient task assignment between local and neighboring computing resources. The underlying workload adaptive task offloading intends to balance out the workload across neighboring vehicles. The framework is compared against three techniques including two adaptive learning techniques in terms of service delay, efficiency, task delivery rate, task failures, and learning regret. The results demonstrate the effectiveness of the proposed resource-sharing network, improving service quality and throughput for servicing innovative intelligent transportation applications.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "12497-12504", "volume": "9"}, "authors": [{"authorId": "2058020060", "name": "Arpita Chopra"}, {"authorId": "31321802", "name": "A. U. Rahman"}, {"authorId": "31144325", "name": "A. Malik"}, {"authorId": "3119035", "name": "Sri Devi Ravana"}], "citations": [{"paperId": "140280b1a0582f5708801cf049b086fe651dc4b9", "title": "Dual Hybrid CP-ABE: How to Provide Forward Security Without a Trusted Authority in Vehicular Opportunistic Computing"}, {"paperId": "bde1964c385d90e1bf3d8640ece2892852c273d0", "title": "A Learning-Based Approach for Vehicle-to-Vehicle Computation Offloading"}]}
