{"paperId": "4f4ae889818d26a47149a63c83515e5a7f92f661", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Survey of Repair Analysis Algorithms for Memories", "abstract": "Current rapid advancements in deep submicron technologies have enabled the implementation of very large memory devices and embedded memories. However, the memory growth increases the number of defects, reducing the yield and reliability of such devices. Faulty cells are commonly repaired by using redundant cells, which are embedded in memory arrays by adding spare rows and columns. The repair process requires an efficient redundancy analysis (RA) algorithm. Spare architectures for the repair of faulty memory include one-dimensional (1D) spare architectures, two-dimensional (2D) spare architectures, and configurable spare architectures. Of these types, 2D spare architectures, which prepare extra rows and columns for repair, are popular because of their better repairing efficiency than 1D spare architectures and easier implementation than configurable spare architectures. However, because the complexity of the RA is NP-complete, the RA algorithm should consider various factors in order to determine a repair solution. The performance depends on three factors: analysis time, repair rate, and area overhead. In this article, we survey RA algorithms for memory devices as well as built-in repair algorithms for improving these performance factors. Built-in redundancy analysis techniques for emergent three-dimensional integrated circuits are also discussed. Based on this analysis, we then discuss future research challenges for faulty-memory repair studies.", "venue": "ACM Computing Surveys", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2016-10-12", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 41", "volume": "49"}, "authors": [{"authorId": "1854292", "name": "Keewon Cho"}, {"authorId": "2485737", "name": "Wooheon Kang"}, {"authorId": "49275673", "name": "Hyungjun Cho"}, {"authorId": "2109447291", "name": "Changwook Lee"}, {"authorId": "2114326", "name": "Sungho Kang"}], "citations": [{"paperId": "4b4a1e9b6e97fd0e631f449731091f8232cd8e31", "title": "Memory built-in self-repair and correction for improving yield: a review"}, {"paperId": "cccf7e41660e45992cb2052ed64f06470086b908", "title": "Siloz: Leveraging DRAM Isolation Domains to Prevent Inter-VM Rowhammer"}, {"paperId": "959d40e1f4e717cb84b1cd11684f00baf645d3b3", "title": "A scalable solution to AlphaZero based Redundancy Analysis for semiconductor chips"}, {"paperId": "623dfc605dda4fe096b6f9f6859e0e4eac7e81c4", "title": "Facile synthesis of hierarchical ZnS@FeSe2 nanostructures as new energy-efficient cathode material for advanced asymmetric supercapacitors"}, {"paperId": "a3e63c177dc2dc9ddbd402f83919558be6ebeed1", "title": "Implementation of Self Repair Embedded SRAM Using Selectable Redundancy"}, {"paperId": "84114b83b602dba8c056ec222840861afd54eb9c", "title": "Optimal Method for Test and Repair Memories Using Redundancy Mechanism for SoC"}, {"paperId": "f9674dfea68a89614286c3cd05a8ce8315a2d3f0", "title": "Efficient Repair Analysis Algorithm Exploration for Memory With Redundancy and In-Memory ECC"}, {"paperId": "68f0098a5c954d80b684ec50af96cb04ef863a4e", "title": "Memory test and repair technique for SoC based devices"}, {"paperId": "1fc41696c387904dbc501388f762cf33a9b699fd", "title": "Optimized counting threshold Built-in redundancy analysis for memories"}, {"paperId": "196694a81846b39133a1bcee36b709fffeea46a5", "title": "RETRACTED ARTICLE: A saboteur and mutant based built-in self-test and counting threshold-based built-in self repairing mechanism for memories"}, {"paperId": "27a36a87f4d4e468f0c68ac88cdb0e6e03fafcf1", "title": "Generating Representative Test Sequences from Real Workload for Minimizing DRAM Verification Overhead"}, {"paperId": "338d0b02596a480a52b4d0eb277613deb76978bb", "title": "A Statistical Wafer Scale Error and Redundancy Analysis Simulator"}, {"paperId": "2673443e9bb1378c9f7c27366ea63b2608f5dcb1", "title": "SEARS: A Statistical Error and Redundancy Analysis Simulator"}, {"paperId": "907fc9237a9165034281b98283a89c8af4c82dce", "title": "An Efficient BIRA Utilizing Characteristics of Spare Pivot Faults"}, {"paperId": "9a8c627fbfb9a6cb9f5d3f90f9c9d024d31371a8", "title": "Recovering from Biased Distribution of Faulty Cells in Memory by Reorganizing Replacement Regions through Universal Hashing"}, {"paperId": "5c8876ce602babbe8771d88f7ae2b438b4abf2df", "title": "BIRA With Optimal Repair Rate Using Fault-Free Memory Region for Area Reduction"}, {"paperId": "a7ad7a69c5be10d40a25a876f4e1f1170d3a457e", "title": "On-Chip Error Detection Reusing Built-In Self-Repair for Silicon Debug"}, {"paperId": "c1600dea2f98840520b80dc4e5e3779532a360a6", "title": "VLSI-SoC: New Technology Enabler: 27th IFIP WG 10.5/IEEE International Conference on Very Large Scale Integration, VLSI-SoC 2019, Cusco, Peru, October 6–9, 2019, Revised and Extended Selected Papers"}]}
