{"paperId": "4f4ca209d99fd9ffe4f997900c1b5eb9c8303cec", "publicationVenue": null, "title": "Evaluation of water status of wheat genotypes to aid prediction of yield on sodic soils using UAV-thermal imaging and machine learning", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-09-15", "journal": {"name": "Agricultural and Forest Meteorology", "pages": "108477", "volume": "307"}, "authors": [{"authorId": "2152905238", "name": "Sumanta Das"}, {"authorId": "145877973", "name": "J. Christopher"}, {"authorId": "33889843", "name": "A. Apan"}, {"authorId": "100513467", "name": "M. Choudhury"}, {"authorId": "144684139", "name": "S. Chapman"}, {"authorId": "6598747", "name": "N. Menzies"}, {"authorId": "31843183", "name": "Y. Dang"}], "citations": [{"paperId": "e10e555f20d15fa1131d40411725c3b62f7951df", "title": "Optimization of multi-dimensional indices for kiwifruit orchard soil moisture content estimation using UAV and ground multi-sensors"}, {"paperId": "84f6604feb32da6d3b6998645195f2a02e80f343", "title": "Rapid evaluation of drought tolerance of winter wheat cultivars under water-deficit conditions using multi-criteria comprehensive evaluation based on UAV multispectral and thermal images and automatic noise removal"}, {"paperId": "af83b38b692ef6fba0c54f61207ee7df5bb1b4d1", "title": "UAV image acquisition and processing for high‐throughput phenotyping in agricultural research and breeding programs"}, {"paperId": "e2596d4d94cc428e9ef36860ea842f02305d8b3a", "title": "Improving estimation of maize leaf area index by combining of UAV-based multispectral and thermal infrared data: The potential of new texture index"}, {"paperId": "cba9a6282a60c8b7de6a9e6bb06d7cf0e5b6f7cb", "title": "Exogenous silicon application promotes growth and alleviates drought and salt stresses of rice plants"}, {"paperId": "672183e7bd3f9bf99b5f7808e4596cba65cf5ed9", "title": "Calibrating UAV thermal sensors using machine learning methods for improved accuracy in agricultural applications"}, {"paperId": "00233edfe560e68440abb54ec536340659c4e1d7", "title": "Estimation of tomato water status with photochemical reflectance index and machine learning: Assessment from proximal sensors and UAV imagery"}, {"paperId": "9b0ba0f46de6d8f44c6f84032fcc463026dd5a7b", "title": "Global Research Trends for Unmanned Aerial Vehicle Remote Sensing Application in Wheat Crop Monitoring"}, {"paperId": "245d307b8849ae9fb75048b344f561139601da7f", "title": "UAV-Based Multi-Temporal Thermal Imaging to Evaluate Wheat Drought Resistance in Different Deficit Irrigation Regimes"}, {"paperId": "4e5862f213d4215eae39fec4498a3e0b90d7eaa1", "title": "Convolutional Neural Networks in Computer Vision for Grain Crop Phenotyping: A Review"}, {"paperId": "ea966ef152770d659f96ec6ee23cd48055604a26", "title": "An Overview of End Effectors in Agricultural Robotic Harvesting Systems"}, {"paperId": "838c831ec006be98fe0e8eaba0beaa0c12a73690", "title": "A High-Throughput Phenotyping Pipeline for Rapid Evaluation of Morphological and Physiological Crop Traits Across Large Fields"}, {"paperId": "a2f1367c35fac06db7eeac66d51cbaa24ec14d91", "title": "Evaluation of drought tolerance of wheat genotypes in rain-fed sodic soil environments using high-resolution UAV remote sensing techniques"}, {"paperId": "11b661296d56d7ab8887c341764b13fdb834bdc3", "title": "Cascade Parallel Random Forest Algorithm for Predicting Rice Diseases in Big Data Analysis"}, {"paperId": "ec971e244fcf687f562e889919af03fcce7a585f", "title": "Comparative analysis of machine learning techniques for predicting production capability of crop yield"}, {"paperId": "8aca862823c9741113c83cee57a84482cb5a4ec5", "title": "Improving Biomass and Grain Yield Prediction of Wheat Genotypes on Sodic Soil Using Integrated High-Resolution Multispectral, Hyperspectral, 3D Point Cloud, and Machine Learning Techniques"}, {"paperId": "b91f204f6bf6bad495c329f4961e3fbfdd8096e2", "title": "Improving estimation of in-season crop water use and health of wheat genotypes on sodic soils using spatial interpolation techniques and multi-component metrics"}, {"paperId": "ba0b68ec364259b7795e36a1a84be58640333255", "title": "Advances in optical phenotyping of cereal crops."}, {"paperId": "18cfd273bb771a39a4293a387b2ec3b1490b6e46", "title": "UAV-thermal imaging: A technological breakthrough for monitoring and quantifying crop abiotic stress to help sustain productivity on sodic soils – A case review on wheat"}]}
