{"paperId": "4f50327b77322cb71321936ce80c6ae744c987d9", "publicationVenue": {"id": "a1b15bc8-157e-45a9-b4c8-8211f938775d", "name": "IEEE Communications Magazine", "type": "journal", "alternate_names": ["IEEE Commun Mag"], "issn": "0163-6804", "url": "http://www.comsoc.org/commag", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=35"]}, "title": "Interpreting AI for Networking: Where We Are and Where We Are Going", "abstract": "In recent years, artificial intelligence (AI) techniques have been increasingly adopted to tackle networking problems. Although AI algorithms can deliver high-quality solutions, most of them are inherently intricate and erratic for human cognition. This lack of interpretability tremendously hinders the commercial success of AI-based solutions in practice. To cope with this challenge, networking researchers are starting to explore explainable AI (XAI) techniques to make AI models interpretable, manageable, and trustworthy. In this article, we overview the application of AI in networking and discuss the necessity for interpretability. Next, we review the current research on interpreting AI-based networking solutions and systems. At last, we envision future challenges and directions. The ultimate goal of this article is to present a general guideline for AI and networking practitioners and motivate the continuous advancement of AI-based solutions in modern communication networks.", "venue": "IEEE Communications Magazine", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-01", "journal": {"name": "IEEE Communications Magazine", "pages": "25-31", "volume": "60"}, "authors": [{"authorId": "152602127", "name": "Tianzhu Zhang"}, {"authorId": "2157911", "name": "Han Qiu"}, {"authorId": "1703450", "name": "M. Mellia"}, {"authorId": "2864629", "name": "Yuanjie Li"}, {"authorId": "3178200", "name": "Hewu Li"}, {"authorId": "2117101808", "name": "Ke Xu"}], "citations": [{"paperId": "fd22a7dbd21a2524eba762f3a28809870246cc81", "title": "Wireless 6G Connectivity for Massive Number of Devices and Critical Services"}, {"paperId": "07af3d1569f025226abb8cf9090ac8ff14fb5cf0", "title": "Traffic prediction in SDN for explainable QoS using deep learning approach"}, {"paperId": "fc694b0720be2eb8f3b9a38ed6c31943d7dc9b83", "title": "FastTraffic: A lightweight method for encrypted traffic fast classification"}, {"paperId": "cb22529cca58e5ebde52ce4376e22569e8b98448", "title": "Improving Performance, Reliability, and Feasibility in Multimodal Multitask Traffic Classification with XAI"}, {"paperId": "5a8e366a22254e4e82cb445920ce4f5fd7347e13", "title": "Fine-Grained Traffic Prediction of Communication-and-Collaboration Apps Via Deep-Learning: A First Look at Explainability"}, {"paperId": "bf959f4ff5aac64beb85f97a1d88c9a771dea12b", "title": "Operationalizing AI in Future Networks: A Bird's Eye View from the System Perspective"}, {"paperId": "d0b6c5820ae12bb42a82f5f56de37a70c8b3b98a", "title": "XAIR: A Systematic Metareview of Explainable AI (XAI) Aligned to the Software Development Process"}, {"paperId": "35c0a376312d4e34367a5ccef0517975757e73ae", "title": "Cognitive Network Architecture Systems to Provide Intelligent Services: An Intelligent Self-Organization Approach With a Game-Based Incentive Mechanism"}, {"paperId": "43529a958686d0b0222b45d322ed4c322a166a19", "title": "Multiagent-Based Data Presentation Mechanism for Multifaceted Analysis in Network Management Tasks"}, {"paperId": "d9967a59a35bf52979a0b48dcee52894322e1d03", "title": "Advancing Education Through Extended Reality and Internet of Everything Enabled Metaverses: Applications, Challenges, and Open Issues"}, {"paperId": "d1f97c9e689a97e5693b2c69aaed5cd7e44eeb7c", "title": "Explainable Deep-Learning Approaches for Packet-Level Traffic Prediction of Collaboration and Communication Mobile Apps"}, {"paperId": "770f28b1d42fdc57d3c1b2062a6b64ea9e083ccf", "title": "A Feasible and Explainable Network Traffic Classifier Utilizing DistilBERT"}, {"paperId": "c38be2dcb5ee9334a383faca1c0f27328b2a9bc6", "title": "AI-powered Internet Traffic Classification: Past, Present, and Future"}]}
