{"paperId": "4f713beb800861cdef565c1c2b65ab16f9aa60fb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Hawkeye: Adaptive Straggler Identification on Heterogeneous Spark Cluster With Reinforcement Learning", "abstract": "It is a common sense that people harbors the belief that stragglers exert huge influence upon the performance conducted by the analysis systems of big data for the reason of poor performance made by some computing nodes, data skew and so on. Accordingly, stragglers have been billed as an indispensable bottleneck in Map-Reduce framework processing. However, existing studies on stragglers identification are targeting coarse-grained detection, schedule level optimization and off-line log based cause analysis. Accuracy identifying the stragglers in time for each job, however, is an extremely tough because (1) Auite a number of root causes for stragglers in data analytics frameworks;(2) The number of key parameters affecting stragglers identification; and (3) The different clusters configurations, and their impact on the stragglers detection, vary among different job types and sizes. Either existing solutions adopt a “tweak-and-pray” manual tuning approach, which is complex, time-consuming and error-prone, or only most of them fix theirs eyes upon coarse-grained straggler detection. In this paper, we systematically conduct the exploration on the fundamental problem of automatic, adaptive straggler identification on big data analytics platform. Under the inspiration of the recent triumphs over implementing Reinforcement Learning (RL) techniques for solving complex online optimal problems, we conducted investigation that Reinforcement learning are reasonably employed to adaptively opt the optimal parameters to identify stragglers free of the intervention of human beings. Specifically, we propose Hawkeye, a general adaptive speculative execution system which identifies stragglers by reinforcement are learning to launch speculative tasks on heterogeneous cluster at runtime. In accordance with the experimental conclusions, Hawkeye manages to cut down the job completion time over the distinct type applications. An instance is that it reveals as many as nearly 37% decrease average job completion time based on an improvement of 23% on the preciseness of the present resolutions to the heterogeneous cluster.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "57822-57832", "volume": "8"}, "authors": [{"authorId": "2086128", "name": "Haizhou Du"}, {"authorId": "2145443331", "name": "Shaohua Zhang"}], "citations": [{"paperId": "be006dbcf4f8a910e6c4849f32df60a13956de36", "title": "AutoDiagn: An Automated Real-Time Diagnosis Framework for Big Data Systems"}, {"paperId": "914b30e0e38fe1f25d1b2ed5792c56070408b681", "title": "Straggler identification approach in large data processing frameworks using ensembled gradient boosting in smart-cities cloud services"}, {"paperId": "5cb66b2b5a740bb584fc3517054f95158b831ae6", "title": "Collaborative Learning Based Straggler Prevention in Large-Scale Distributed Computing Framework"}, {"paperId": "1f6e33fe5bbd6d9e50a17d6d4df31345c764614e", "title": "Review on Reinforcement Learning, Research Evolution and Scope of Application"}, {"paperId": "12a39a684855f9e9342259951f21b535d9f2dc88", "title": "Identification of Straggler Node in Distributed Environment Using Soft Computing Algorithms"}, {"paperId": "de2156ab5efea2e27fb08fc285f64aaeb5012fae", "title": "Towards Causal Interpretation on Datacenter-scale Stragglers"}]}
