{"paperId": "4f9125300ec1bc4aaafa7e33766d6d05dbea1ec7", "publicationVenue": {"id": "03335338-b34c-473a-86a8-42ae9227ac0d", "name": "International Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications", "type": "conference", "alternate_names": ["Int Conf Intell Data Acquis Adv Comput Syst Technol Appl", "Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications", "IDAACS", "Intell Data Acquis Adv Comput Syst Technol Appl"], "url": "http://www.wikicfp.com/cfp/program?id=1518"}, "title": "Logics based application integration for interdisciplinary scientific investigations", "abstract": "The approach to the integration of applications based on mathematical logic and artificial intelligence for World Data Center (WDC) interdisciplinary scientific investigations has been developed in the article. Key elements of the approach are a multilevel system architecture, a formal logical system, implementation based on the interaction of intelligent agents. The formal logical system has been proposed. The inference method and solution tree recovery mechanism have been elaborated. The implementation of application integration for interdisciplinary scientific research has been based on a stack of modern protocols, enabling communication of business processes over the transport layer of the OSI model. Application integration is also based on coordinated models of business processes, for which an integrated set of business applications have been designed and realized.", "venue": "International Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-09-01", "journal": {"name": "2017 9th IEEE International Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications (IDAACS)", "pages": "1026-1031", "volume": "2"}, "authors": [{"authorId": "3205613", "name": "S. Telenyk"}, {"authorId": "2058303883", "name": "Grzegorz Nowakowski"}, {"authorId": "3018033", "name": "K. Yefremov"}, {"authorId": "29427785", "name": "V. Khmeliuk"}], "citations": [{"paperId": "28c770870352629f685398dda51765d5a32824e8", "title": "Quality and Security of Life: A Cross-Country Analysis"}, {"paperId": "275d2d7246655d5df272cc17568d4165cc156cfe", "title": "Modeling of Potential Flooding Zones with Geomatics Tools"}, {"paperId": "05850d2c129c2ccb7ad63f49a4e23727d9b3fb4a", "title": "Simple and Flexible Way to Integrate Heterogeneous Information Systems and Their Services into the World Data System"}, {"paperId": "d26a6d734c12e2bdecf8c4d6eb3958400743a9c6", "title": "Action Planning Logic in Intelligent IT Systems Using the Example of Bots"}, {"paperId": "e81faea3b05b439af98d5ad1d6ee6c1b62690ee2", "title": "The Approach to Applications Integration for World Data Center Interdisciplinary Scientific Investigations"}]}
