{"paperId": "4f96a341441f90f4f54a5d24b892e9248f35f2e4", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Comparison of Four Dietary Pattern Indices in Australian Baby Boomers: Findings from the Busselton Healthy Ageing Study", "abstract": "The assessment of dietary patterns comprehensively represents the totality of the diet, an important risk factor for many chronic diseases. This study aimed to characterise and compare four dietary pattern indices in middle-aged Australian adults. In 3458 participants (55% female) from the Busselton Healthy Ageing Study (Phase Two), a validated food frequency questionnaire was used to capture dietary data between 2016 and 2022. Four dietary patterns [Australian Dietary Guideline Index 2013 (DGI-2013); the Mediterranean Diet Index (MedDiet); the Literature-based Mediterranean Diet Index (Lit-MedDiet); and the EAT-Lancet Index], were calculated and compared by measuring total and sub-component scores, and concordance (𝜌c). Cross-sectional associations between the dietary indices and demographic, lifestyle, and medical conditions were modelled with linear regression and restricted cubic splines. Participants had the highest standardised scores for the DGI-2013 followed by the EAT-Lancet Index and the MedDiet, with the lowest standardised scores observed for the Lit-MedDiet. The DGI-2013 had the lowest agreement with the other scores (𝜌c ≤ 0.47). These findings indicate that the diets included in this Australian cohort align more closely with the Australian Dietary Guidelines than with the other international dietary patterns, likely due to the wide variation of individual food group weightings in the construction of these indices.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-28", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "2203506291", "name": "Sierra R. McDowell"}, {"authorId": "2056406558", "name": "K. Murray"}, {"authorId": "47852905", "name": "M. Hunter"}, {"authorId": "11055199", "name": "L. Blekkenhorst"}, {"authorId": "2045327", "name": "J. Lewis"}, {"authorId": "14198843", "name": "J. Hodgson"}, {"authorId": "3741236", "name": "N. Bondonno"}], "citations": []}
