{"paperId": "4f9623872fa7857ca616c3090c0a00d0a14332da", "publicationVenue": {"id": "f43adf25-1868-4d3c-9d24-fe599024c6ec", "name": "Kidney Diseases", "alternate_names": ["Kidney Dis"], "issn": "2296-9357", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-467546", "alternate_urls": ["http://www.karger.com/?issn=2296-9357", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-467546", "https://www.karger.com/KDD"]}, "title": "Leveraging Data Science for a Personalized Haemodialysis", "abstract": "Background: The 2019 Science for Dialysis Meeting at Bellvitge University Hospital was devoted to the challenges and opportunities posed by the use of data science to facilitate precision and personalized medicine in nephrology, and to describe new approaches and technologies. The meeting included separate sections for issues in data collection and data analysis. As part of data collection, we presented the institutional ARGOS e-health project, which provides a common model for the standardization of clinical practice. We also pay specific attention to the way in which randomized controlled trials offer data that may be critical to decision-making in the real world. The opportunities of open source software (OSS) for data science in clinical practice were also discussed. Summary: Precision medicine aims to provide the right treatment for the right patients at the right time and is deeply connected to data science. Dialysis patients are highly dependent on technology to live, and their treatment generates a huge volume of data that has to be analysed. Data science has emerged as a tool to provide an integrated approach to data collection, storage, cleaning, processing, analysis, and interpretation from potentially large volumes of information. This is meant to be a perspective article about data science based on the experience of the experts invited to the Science for Dialysis Meeting and provides an up-to-date perspective of the potential of data science in kidney disease and dialysis. Key messages: Healthcare is quickly becoming data-dependent, and data science is a discipline that holds the promise of contributing to the development of personalized medicine, although nephrology still lags behind in this process. The key idea is to ensure that data will guide medical decisions based on individual patient characteristics rather than on averages over a whole population usually based on randomized controlled trials that excluded kidney disease patients. Furthermore, there is increasing interest in obtaining data about the effectiveness of available treatments in current patient care based on pragmatic clinical trials. The use of data science in this context is becoming increasingly feasible in part thanks to the swift developments in OSS.", "venue": "Kidney Diseases", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-05-25", "journal": {"name": "Kidney Diseases", "pages": "385 - 394", "volume": "6"}, "authors": [{"authorId": "3943455", "name": "M. Hueso"}, {"authorId": "2026953172", "name": "Lluís de Haro"}, {"authorId": "5149114", "name": "J. Calabia"}, {"authorId": "1398366093", "name": "R. Dal-Ré"}, {"authorId": "4085227", "name": "C. Tebé"}, {"authorId": "144829520", "name": "K. Gibert"}, {"authorId": "50575754", "name": "J. Cruzado"}, {"authorId": "1723612", "name": "A. Vellido"}], "citations": [{"paperId": "a741a34c796c93973bbcecf78a71dfbc2ebcd94f", "title": "Improvement of Dialysis Dosing Using Big Data Analytics"}, {"paperId": "1b2cf439010379bbcbb647c30e228d8c49c76ced", "title": "Kidneys also speak Spanish: Initiatives towards standardisation of our nephrology nomenclature."}, {"paperId": "2ba0c038264aca3c308de1f3018fd6b2cc6db1c8", "title": "Integration of Artificial Intelligence And Multi-omics in Kidney Diseases"}, {"paperId": "85896f81f4746229a9fb301b2a8a241c1d734609", "title": "Kidneys also speak Spanish: Initiatives towards standardisation of our nephrology nomenclature."}, {"paperId": "f52225baac64b090910e9e0a18b389018bf0c7dc", "title": "Artificial Intelligence in Critical Care"}]}
