{"paperId": "4f966fa67c38c92ba9ad1ad524c6b970c926f602", "publicationVenue": null, "title": "Malware log files for Internet investigation using hadoop: A review", "abstract": "On the Internet, malware is one of the most serious threats to system security. Major complex issues and problems on some software systems are oftentimes made by malware. Malware can infect any computer software that causes connection to Internet infrastructure. There are many types of malware and some of the popular malware are Botnet, Trojans, Viruses, Spyware and Adware. Internet users with lesser knowledge of the malware threats are susceptible to this issue. To protect and prevent the computer and internet users from exposing themselves towards malware attacks, identifying the attacks through investigating malware log file is an essential step to curb this threat. The log file exposes crucial information in identifying the malware, such as algorithm and functional characteristic, the network interaction between the source and the destination, and type of malware. By nature, the log file size is humongous and requires the investigation process to be executed on faster and stable platforms such as the big data environment. In this study, the authors had adopted Hadoop, an open source software framework to process and extract the information from the malware log files. The information of data will be used for further prevention and protection from malware threats.", "venue": "2017 IEEE Conference on Big Data and Analytics (ICBDA)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE Conference on Big Data and Analytics (ICBDA)", "pages": "87-92"}, "authors": [{"authorId": "35281216", "name": "Mohd Sharudin Mat Deli"}, {"authorId": "3378892", "name": "Saiful Adli Ismail"}, {"authorId": "2516552", "name": "Nazri Kama"}, {"authorId": "3296701", "name": "O. Yusop"}, {"authorId": "144614918", "name": "Azri Azmi"}, {"authorId": "49132917", "name": "Yazriwati Yahya"}], "citations": [{"paperId": "c4a3c42c4d2e68218164d6405758832c5114bd21", "title": "Benefits and Security Challenges of Big Data Analytics"}]}
