{"paperId": "4f986eed330d18eaaf06e1a518d0934096b91f0a", "publicationVenue": null, "title": "A Model Frame Work To Segregate Clusters Through K-Means Method", "abstract": "The financial fraud has more imperative effect on today's world. Credit card information security, as well as techniques to detect and divide illegal credit card transactions, as well as hacking and phishing methods, are all quite popular nowadays. A variety of data mining approaches have been used to find/detect these frauds over the years. The focus of this paper is to create a systematic model, to find the detection and minimize the detection towards the credit card fraud by generating the clusters and analyze and comprise these normal clusters through segregation and using k-means techniques in more prominent way. The purpose of this research is to compare the performance of two of the most important fraud detection systems. The paper also employs k-means clustering algorithm into 5 folds of k folds into detection of fraud. Here, the cluster is divided into 80% split and to is been modeled to have an accuracy of 80%. The accuracy of 2 hybrid models has been compared on the split of 5 folds on the basis of 60 and 40 trained test model. The most extensive testing with much larger data set with round about 2 lakh of data is required to validate these results. The digitization of world has brought many issues along with it. Intense research is been conducted how to confront the financial fraud, credit card fraud, including the hackers and criminal anomaly detection. Data mining techniques has done an incredible work in this regard. The algorithms played a credible role of solving the issues.", "venue": "2022 Second International Conference on Computer Science, Engineering and Applications (ICCSEA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-08", "journal": {"name": "2022 Second International Conference on Computer Science, Engineering and Applications (ICCSEA)", "pages": "1-6"}, "authors": [{"authorId": "2190212984", "name": "Himani Shivraman"}, {"authorId": "40509423", "name": "Umang Garg"}, {"authorId": "2190214721", "name": "Amrita Panth"}, {"authorId": "2190214896", "name": "Ashok Kandpal"}, {"authorId": "2188649393", "name": "Ashish Gupta"}], "citations": []}
