{"paperId": "4f9aab436ad2990aa1ac98a00aa7babdcc946326", "publicationVenue": null, "title": "Age-Aware Query Evaluation for Big Data Analytics in Mobile Edge Clouds", "abstract": "The advancement of 5G technology and extensive usage of smart devices have led to a deluge of data. It is invaluable to analyze such big data by issuing queries to derive real-time business insights for better, smarter and fact-based decisions. Timely big data analytics are crucial in many service domains, thus the age of data (AoD) required by queries is emerging as a novel metric that measures the freshness of data and evaluates the quality of data analytics. Traditional big data analytics that are performed in remote clouds cannot satisfy the AoD requirements of queries, due to the congested core networks and long transmission latency between users and clouds. The technique of mobile edge computing (MEC) is expected to reduce the age and guarantee the timeliness of queries for big data analytics, by processing data at edge cloudlets close to users. In this paper, we investigate a problem of age-aware query evaluation for big data analytics in a mobile edge cloud network. We first formulate the problem with certain data processing latency as an Integer Linear Program (ILP). We then develop an online learning algorithm for the problem with uncertain data processing latency. We finally evaluate the performance of proposed algorithms against existing studies by simulations and testbed implementations. Evaluation results show that the proposed algorithms outperform existing works by achieving 20% lower AoD.", "venue": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "214-222"}, "authors": [{"authorId": "2806902", "name": "Qiufen Xia"}, {"authorId": "2053308586", "name": "Wenhao Ren"}, {"authorId": "1691066", "name": "Mingchu Li"}, {"authorId": "1767128", "name": "Jiankang Ren"}], "citations": [{"paperId": "b9397090fcbc87d023d65239e3c2e4a21dd36f8d", "title": "Enabling Streaming Analytics in Satellite Edge Computing via Timely Evaluation of Big Data Queries"}, {"paperId": "9b32a685b7b8497293e9eabd5d254222d91b1917", "title": "Schedule or Wait: Age-Minimization for IoT Big Data Processing in MEC via Online Learning"}, {"paperId": "d0648e9283feafb0c4a935bb3667f69054ed3a6a", "title": "Proactive and intelligent evaluation of big data queries in edge clouds with materialized views"}]}
