{"paperId": "4fb27c7f38fbc77e774bc9cb18d8caeec6806da0", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "The Role of Machine Learning and the Internet of Things in Smart Buildings for Energy Efficiency", "abstract": "Machine learning can be used to automate a wide range of tasks. Smart buildings, which use the Internet of Things (IoT) to connect building operations, enable activities, such as monitoring temperature, safety, and maintenance, for easier controlling via mobile devices and computers. Smart buildings are becoming core aspects in larger system integrations as the IoT is becoming increasingly widespread. The IoT plays an important role in smart buildings and provides facilities that improve human security by using effective technology-based life-saving strategies. This review highlights the role of IoT devices in smart buildings. The IoT devices platform and its components are highlighted in this review. Furthermore, this review provides security challenges regarding IoT and smart buildings. The main factors pertaining to smart buildings are described and the different methods of machine learning in combination with IoT technologies are also described to improve the effectiveness of smart buildings to make them energy efficient.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-08-05", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2182112670", "name": "Syed Faisal Abbas Shah"}, {"authorId": "123698879", "name": "Muh. Iqbal"}, {"authorId": "1722129", "name": "Zeeshan Aziz"}, {"authorId": "2916205", "name": "T. A. Rana"}, {"authorId": "145891358", "name": "A. Khalid"}, {"authorId": "145029114", "name": "Y. Cheah"}, {"authorId": "2065760740", "name": "Muhammad Arif"}], "citations": [{"paperId": "51f34f2b32bc6796d58c9153a046cc1bf4a004ba", "title": "Japanese public perceptions on smart bin potential to support PAYT systems"}, {"paperId": "e372cc30df7d37f213aedbbbc737d385f9134398", "title": "Spatiotemporal effect and influencing factors of the total factor energy efficiency: Evidence from the urban agglomerations in China"}, {"paperId": "25ecc8f7aa985a004dd6ce213e9359d083d3d985", "title": "Passive Infrared Sensor-Based Occupancy Monitoring in Smart Buildings: A Review of Methodologies and Machine Learning Approaches"}, {"paperId": "201bc76ab52c66beafde66ed1153d160ff01c83e", "title": "Generic IoT for Smart Buildings and Field-Level Automation - Challenges, Threats, Approaches, and Solutions"}, {"paperId": "110f3c0394692ee393f8eb69cca6e0239549dee5", "title": "Artificial intelligence in groundwater management: Innovations, challenges, and future prospects"}, {"paperId": "f8d6c43f8abe8811de912b1de5f098836fbdb303", "title": "Energy Management in Modern Buildings Based on Demand Prediction and Machine Learning—A Review"}, {"paperId": "0152d81e4245b931a8ac1fffcb0d186532274c7b", "title": "Analyzing the Performance of Machine Learning Algorithms for Real-Time Data Analysis Under Optimization"}, {"paperId": "f284dcc63c1230db3fc2f8674ddb9ba4923c09a0", "title": "Integration of Deep Learning into the IoT: A Survey of Techniques and Challenges for Real-World Applications"}, {"paperId": "4dfc151a18ccbbd05f784a319e6b2d526c15f1a3", "title": "Unlocking Sustainable Future: Machine Learning for Precise Energy Efficiency Prediction in Buildings"}, {"paperId": "50c8d5c90dec55c94b7ad5deab59777ff3c57246", "title": "Smart Building Management with IoT and AI: Energy-Efficient and Cost-Effective Solutions"}, {"paperId": "5ce821e5157d6d5523583e909f1920008afbfee1", "title": "Integration of Artificial Intelligence and Machine Learning for Internet of Things"}, {"paperId": "602e58bf24013d555da342ba8e449ee2de76fdf6", "title": "An Energy-Efficient Routing Protocol with Reinforcement Learning in Software-Defined Wireless Sensor Networks"}, {"paperId": "c278dc342fe65a3f7fecefea9697f6fd04ea223d", "title": "An intelligent optimization framework to predict the vulnerable range of tumor cells using Internet of things"}, {"paperId": "68766522b860eb493676de2078e8d9ce3d487e72", "title": "Reviewing and Integrating AEC Practices into Industry 6.0: Strategies for Smart and Sustainable Future-Built Environments"}, {"paperId": "3d92888ea812105843781dbb7e271e02142c2c85", "title": "Indoor radon monitoring for occupational health reinforcement in Portugal: compliance, prevention, and technological advancements"}, {"paperId": "e96f9df87fce4001c6ddc69ce774b84032d14d41", "title": "Life Cycle Sustainability Assessment of Healthcare Buildings: A Policy Framework"}, {"paperId": "56f2f4a678f869896e7873054c24093f80eb79a2", "title": "Optimal Neural Network PID Approach for Building Thermal Management"}, {"paperId": "8a16473a8cc31819cf1121db858b84de22fb169b", "title": "Smart Buildings in the Age of Internet Technology: Civil Engineering's Role in Shaping an Energy-Efficient Future"}, {"paperId": "19c85f3865577d1859808ab547ab239540e376c3", "title": "Implementing Machine Learning-based Autonomic Cyber Defense for IoT-enabled Healthcare Devices"}, {"paperId": "68280c0e7fb84ba342fea5cb4b827f2dbb4b650b", "title": "Machine-Learning Applications in Energy Efficiency: A Bibliometric Approach and Research Agenda"}, {"paperId": "e99ee0d88a5e59469207993d1ac6b097959a7224", "title": "Enhanced Building Prediction for Smart City Surveillance"}, {"paperId": "e81daf318e8bb243a5379397398c2eda229ce0fc", "title": "Analysis of Challenges and Solutions of IoT in Smart Grids Using AI and Machine Learning Techniques: A Review"}, {"paperId": "73c338543cd1d4b1fc7e720fab86749d63d2a85b", "title": "Solar Energy Optimisation Using IoT and Deep Learning- A Review"}, {"paperId": "c9cedfcbf78eff361cdf908dd5ce67514c389e47", "title": "The Role of ML, AI and 5G Technology in Smart Energy and Smart Building Management"}, {"paperId": "b1f2e4095588c6e1abe29c790f7eed23ffe2df33", "title": "Investigating the Energy-Efficient Structures Using Building Energy Performance Simulations: A Case Study"}]}
