{"paperId": "4fc231461f8608e8024e74744a7c5f64d7f46463", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Review on Image Enhancement and Restoration Techniques for Underwater Optical Imaging Applications", "abstract": "Underwater image processing always a challenging problem in oceanic engineering applications. Images captured in underwater are commonly suffers due to color distortion, detail blur, bluish or greenish tone, and low contrast to light scattering and absorption in the water medium. The image visibility is affected drastically during capturing caused by the degradation of light absorption and scattering effect. Hence, the effective Underwater Image Enhancement(UIE) and restoration techniques are primarily required for the underwater ecological study applications. Various UIE techniques are studied for different data sets, and applications. However, the selection of suitable method for particular applications among available techniques is still a challenging task. In this paper, an overview of recent UIE and restoration techniques and classification methods are elaborated with data sets and applications. The UIE techniques are grouped under various category such as spatial domain, transform domain, color constancy based method, retinex based approach. Similarly, the image restoration techniques are grouped under underwater optical imaging technique, polarization based approach, prior knowledge and convolutional neural networks. Finally, we review the research process of the underwater image enhancement and restoration with the essential background of the water images and recognize challenges.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "111715-111737", "volume": "11"}, "authors": [{"authorId": "2255580314", "name": "N. Deluxni"}, {"authorId": "147846773", "name": "P. Sudhakaran"}, {"authorId": "2260116297", "name": "Ieee Kitmo Member"}, {"authorId": "153890969", "name": "M. Ndiaye"}], "citations": []}
