{"paperId": "4fcf1ad2499a20569aba3b5e3083b5532731738e", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Prediction of Urinary Tract Infection in IoT-Fog Environment for Smart Toilets Using Modified Attention-Based ANN and Machine Learning Algorithms", "abstract": "UTI (Urinary Tract Infection) has become common with maximum error rates in diagnosis. With the current progress on DM (Data Mining) based algorithms, several research projects have tried such algorithms due to their ability in making optimal decisions and efficacy in resolving complex issues. However, conventional research has failed to attain accurate predictions due to improper feature selection. To resolve such existing pitfalls, this research intends to employ suitable ML (Machine Learning)-based algorithms for predicting UTI in IoT-Fog environments, which will be applicable to a smart toilet. Additionally, bio-inspired algorithms have gained significant attention in recent eras due to their capability in resolving complex optimization issues. Considering this, the current study proposes MFB-FA (Modified Flashing Behaviour-based Firefly Algorithm) for feature selection. This research initializes the FF (Firefly) population and interchanges the constant absorption coefficient value with the chaotic maps as the chaos possesses an innate ability to evade getting trapped in local optima with the improvement in determining global optimum. Further, GM (Gaussian Map) is taken into account for moving all the FFs to a global optimum in an individual iteration. Due to such nature, this algorithm possesses a better optimization ability than other swarm intelligence approaches. Finally, classification is undertaken by the proposed MANN-AM (Modified Artificial Neural Network with Attention Mechanism). The main intention for proposing this network involves its ability to focus on small and significant data. Moreover, ANNs possess the ability for learning and modelling complex and non-linear relationships, in which the present study considers it. The proposed method is compared internally by using Random Forest, Naive Bayes and K-Nearest Neighbour to show the efficacy of the proposed model. The overall performance of this study is assessed with regard to standard performance metrics for confirming its optimal performance in UTI prediction. The proposed model has attained optimal values such as accuracy as 0.99, recall as 0.99, sensitivity as 1, precision as 1, specificity as 0.99 and f1-score as 0.99.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2126186349", "name": "Abdullah Alqahtani"}, {"authorId": "17702586", "name": "Shtwai Alsubai"}, {"authorId": "9444986", "name": "Adel Binbusayyis"}, {"authorId": "2181396498", "name": "Mohemmed Sha"}, {"authorId": "3433379", "name": "Abdu H. Gumaei"}, {"authorId": "2145056928", "name": "Yu-Dong Zhang"}], "citations": [{"paperId": "ed98525c03b2b447996b30133b95ef10cd449a14", "title": "Accurate Prediction of Bacterial Infections using Deep Learning-Based Approaches: A Recent Study and Progress"}, {"paperId": "71033f0aa3ea213f5ba95276eb7abf2f12267009", "title": "MVMSGAT: Integrating Multiview, Multi-Scale Graph Convolutional Networks with Biological Prior Knowledge for Predicting Bladder Cancer Response to Neoadjuvant Therapy"}]}
