{"paperId": "4fd327005881eb38c6b0979809ac92905540a1de", "publicationVenue": {"id": "2e7913cf-49f3-4c19-9a51-68860c6d73f9", "name": "IEEE International Conference on e-Business Engineering", "type": "conference", "alternate_names": ["IEEE Int Conf bus Eng", "Int Conf bus Eng", "International Conference on e-Business Engineering", "ICEBE"], "url": "http://www.wikicfp.com/cfp/program?id=1344"}, "title": "Data Movement Optimizer for HTAP Architecture with Deep Reinforcement Learning", "abstract": "Due to rapid digitalization, requirements of mixed analytical and transactional query workloads have increased. Hybrid transaction/analytical processing (HTAP) is an architecture that supports both transaction processing and analytical processing. In HTAP architecture, data are moved from transactional systems to analytical systems using integration tools. Because of this, a long-time gap exists between the moment the transactions occurred and the moment these transactions can be analyzed. If an analytical system requires the latest transactional data, a federated query is generated before periodic data movement, which is an expensive operation as it causes temporary movement of data. It is difficult and time consuming for database administrators to design rules on the basis of which data movement operation can reduce the number of federated queries in the system. To solve this problem, we propose deep reinforcement learning based data movement optimizer that quickly learns the system's behavior and reduces the number of federated queries along with minimizing the write cost of data copy operations. We compared our optimizer with rule-based one, and found that our optimizer can reduce same number of federated queries and it is 288 % faster to design. With our new approach, optimizer can be designed in minuets and data administrator can save development and maintenance time.", "venue": "IEEE International Conference on e-Business Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-01", "journal": {"name": "2022 IEEE International Conference on e-Business Engineering (ICEBE)", "pages": "216-221"}, "authors": [{"authorId": "2149949047", "name": "Garima Natani"}, {"authorId": "47189801", "name": "S. Katsunuma"}, {"authorId": "20682088", "name": "Toshihiko Kashiyama"}], "citations": []}
