{"paperId": "4febd0e0fc7dec34e49f2f996a27ab10dfb9e877", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Energy Consumption Analysis of LPWAN Technologies and Lifetime Estimation for IoT Application", "abstract": "The spectrum of Internet of Things (IoT) applications is exponentially growing, driving the demand for better energy performance metrics. In conjunction, Low Power Wide Area Networks (LPWAN) have evolved as long-range connectivity enabler with low management cost. The integration of LPWAN communication assists in reliable IoT operation with extended lifetime. Notable LPWAN technologies that contend for many of the IoT applications are LoRaWAN, DASH7, Sigfox, and NB-IoT. Most of the end-devices such as sensors and actuators are battery powered, therefore investigating energy consumption becomes crucial. To estimate the consumed power, it is important to analyze the energy consumption in wireless communication. This paper describes an empirical evaluation of energy consumption for LPWAN wireless technologies. We measure the current consumption of LoRaWAN, DASH7, Sigfox, and NB-IoT and derive the respective battery lifetime. These measurements help to quantify the energy performance of different protocols. We observe that LoRaWAN and DASH7 are more energy efficient when compared to Sigfox and NB-IoT. Finally, a case study on energy consumption is done on precision agriculture in the greenhouse, showing that battery lifetime in real applications can drop significantly from the ideal case. These results can be used for increasing the effectiveness of the IoT application by selecting the right technology and battery capacity.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "152602933", "name": "Ritesh K. Singh"}, {"authorId": "1914574540", "name": "Priyesh Pappinisseri Puluckul"}, {"authorId": "2986616", "name": "Rafael Berkvens"}, {"authorId": "3257059", "name": "M. Weyn"}], "citations": [{"paperId": "b4815a74d2cc4bafbb1d8ba42209d33bd853d824", "title": "Extending the Framework for Developing Intelligent Virtual Environments (FIVE) with Artifacts for Modeling Internet of Things Devices and a New Decentralized Federated Learning Based on Consensus for Dynamic Networks"}, {"paperId": "966450ee158e0b6bc560cf17137a2e84bc7f9d22", "title": "Sum Throughput Maximization in Multi-BD Symbiotic Radio NOMA Network Assisted by Active-STAR-RIS"}, {"paperId": "f6b352d207c1ed4108772ae1b1f0445af68053ad", "title": "TEGBed: A thermal energy harvesting testbed for batteryless internet of things"}, {"paperId": "fe5eec47209103c585d8e877cbc40650440b3c55", "title": "Efficient Bloom Filter-Based Routing Protocol for Scalable Mobile Networks"}, {"paperId": "b2a97c2b938373076c57a984cb563a24842422e7", "title": "Comparison of LoRa Ra-01H Communication Using Rubber Duck Antenna and Spring Antenna with a Frequency Range of 803 – 930 MHz"}, {"paperId": "43cd12230a8179264b9be1451e6d0685d470b9fb", "title": "Multi-BD Symbiotic Radio-Aided 6G IoT Network: Energy Consumption Optimization With QoS Constraint Approach"}, {"paperId": "3ed1f7181973531ca82a27aaedc0f538e9872e18", "title": "Understanding the impact of packet size on the energy efficiency of LoRaWAN"}, {"paperId": "98534b4595f10b3933906f4008b6359dc015286d", "title": "Investigating Pathways to Minimize Sensor Power Usage for the Internet of Remote Things"}, {"paperId": "b34ffe8175836e99a1f6f425991f7b05372d8375", "title": "ALR-LoRaWAN: An Application-Level Retransmission Management Algorithm for LoRaWAN Networks"}, {"paperId": "d5064216eae94acd75edd39a4a0502dd6576b485", "title": "Closed‐form expression of long‐range modulated massive multiple‐input multiple‐output fractional Fourier transform‐orthogonal frequency division multiplexing system under two‐wave with diffuse power fading channel"}, {"paperId": "7097d66373bdacd32f6d31b593de99bf359f6cdc", "title": "Centralized Communication Scheduler for LoRa"}, {"paperId": "e8b9477cfae3a105fc14ecf3c053809476a27bd9", "title": "ENERGY EFFICIENCY RESEARCH OF LPWAN TECHNOLOGIES"}, {"paperId": "1a6b439e643eda91806bd008b0c82d3ea7f446c9", "title": "Energy Consumption Model for LoRaWAN via Field Experiments for Smart Agriculture"}, {"paperId": "6a3063c399a3cb5b5c3c71ddb6e6507d06afce32", "title": "Optimized Low-Powered Wide Area Network within Internet of Things"}, {"paperId": "4c8b22b575d2c50f6b274c9197e88e530a648f0e", "title": "LoRaWAN Meets ML: A Survey on Enhancing Performance with Machine Learning"}, {"paperId": "cb8f6065af7f52bd218efcbf2929db0cbdf00f4d", "title": "New Attacks on Cloud Container-Based IoT Systems in 5G-Advanced and Beyond"}, {"paperId": "953be7ad893c3aaec9e748fe53da239a0d6cc737", "title": "HINTS: A methodology for IoT network technology and configuration decision"}, {"paperId": "03342fecea2ab063019b675717bfebe060c8e2c1", "title": "A Survey on IoT Positioning Leveraging LPWAN, GNSS, and LEO-PNT"}, {"paperId": "3e138701976a3e52eb14ec5e001aacba3cbdf350", "title": "Learning-Based Rich Feedback HARQ for Energy-Efficient Short Packet Transmission"}, {"paperId": "513df95e423edfde87469322b6ef968df7e452a6", "title": "Multihop Uplink Communication Approach Based on Layer Clustering in LoRa Networks for Emerging IoT Applications"}, {"paperId": "da4d5e193eb45c7dd999a636a2f5b7d3fb01c2a6", "title": "Modelling and Analysis of a Sigfox-Based IoT Network Using uppaalsmc"}, {"paperId": "55ac4e452717a57dea1304727aff8caf2cc0f281", "title": "Characterisation of a new lightweight LoRaWAN GPS bio-logger and deployment on griffon vultures Gyps fulvus"}, {"paperId": "5b7c99e2b1a6b37c06051d6f39774f9006a762f8", "title": "Internet of Underground Things in Agriculture 4.0: Challenges, Applications and Perspectives"}, {"paperId": "3b55e3ccfdbe30b90a967c44a4bc70bb6e54ba0f", "title": "Stochastic Modeling and Analysis of the Energy Consumption of Wireless Sensor Networks"}, {"paperId": "d257e5bc5f02704a745cde4b5dd537599a87ca64", "title": "Energy Harvesting in the UNB-PLC Spectrum: Hidden Opportunities for IoT Devices"}, {"paperId": "2186ac0fdcd72894d42faacda07185145ad4bda9", "title": "Power Consumption Optimization for Flood Monitoring System using NB-IoT"}, {"paperId": "e15bd2e329269513b37c95dac2fa76bfd2a873bf", "title": "An adaptive data coding scheme for energy consumption reduction in SDN-based Internet of Things"}, {"paperId": "1276c0a8bab67e6b247a641aac1d6da756e1d909", "title": "A Real-Time Tunable ECG Noise-Aware System for IoT-Enabled Devices"}, {"paperId": "b147c2449d1bae18f88739067a9493370f55eaf6", "title": "Resource Management for Massive Internet of Things in IEEE 802.11ah WLAN: Potentials, Current Solutions, and Open Challenges"}, {"paperId": "8362064dffdc816064287badf5be36340d6a9cf7", "title": "Design of a solar-powered air pollution monitoring system under tropical climate environments"}, {"paperId": "dab1ee4f93520d5dfbd4302aeda94947415b5f22", "title": "Modeling the Carbon Footprint of Battery-Powered IoT Sensor Nodes for Environmental-Monitoring Applications"}, {"paperId": "cefea49a834b01b2c9292ca17936e422aad33bc3", "title": "Radiofrequency Energy Harvesting Systems for Internet of Things Applications: A Comprehensive Overview of Design Issues"}, {"paperId": "60d01bf0f833761b862147ded004e8adddea2396", "title": "Large-Area Saline-Alkali-Tolerant Rice Growth Environment Monitoring System Based on LoRa+UAV"}, {"paperId": "53e78539579ceefa0ba34913f9438a88c790a54e", "title": "IoT platform for failure management in water transmission systems"}, {"paperId": "70ea939f8b1d8a4ee5167b370b85c77d10a2cbb2", "title": "An IoT Measurement System Based on LoRaWAN for Additive Manufacturing"}, {"paperId": "7d649856508c41247906146cb92e90fb7304e3f1", "title": "Advanced Techniques for Monitoring and Management of Urban Water Infrastructures—An Overview"}, {"paperId": "46458132ac20bc51a81cb2aeec72af76e4da76dd", "title": "Viable smart sensors and their application in data driven agriculture"}, {"paperId": "20e825c0b0f28db154169f2a80686bf4d78a12bc", "title": "ADIperf: A Framework for Application-driven IoT Network Performance Evaluation"}, {"paperId": "62a864f04a7c718a5eef0b8dd5fa1131766a24e7", "title": "Analytical Model for the Energy Efficiency in Low Power IoT Deployments"}, {"paperId": "9d5cde4a9727957a2ecdc5096e6cc85d9b623055", "title": "Battery-Less Environment Sensor Using Thermoelectric Energy Harvesting from Soil-Ambient Air Temperature Differences"}, {"paperId": "e490226a4baa319ad2126a80df0361caf955d272", "title": "Performance Evaluation of LoRa and Sigfox LPWAN Technologies for IoT"}, {"paperId": "aeb8a4049eed49774d8b9d107a96f23d3362ab48", "title": "A Communication Framework for Image Transmission through LPWAN Technology"}, {"paperId": "8f571f05cb7b346209324fa8f86faf6e20ee4969", "title": "Range Limits of Energy Harvesting from a Base Station for Battery-Less Internet-of-Things Devices"}, {"paperId": "2b9343aa8759d8bcf849c41c07ce7d1c9de69e3d", "title": "Energy self-sufficient systems for monitoring sewer networks"}, {"paperId": "c84d7dd1984a6b9ae54f4068243349fb6405a999", "title": "IoT Coverage Enhancement Using Repetition in Energy Constrained Devices: An Analytic Approach"}, {"paperId": "fff2811d6a1226e7ff3978cddaf44ad4ab2c3914", "title": "Towards a smart water city: A comprehensive review of applications, data requirements, and communication technologies for integrated management"}, {"paperId": "d58843ad20059d26838a8eae412bf002a02beb44", "title": "An XGB-Based Reliable Transmission Method in the mMTC Scenarios"}, {"paperId": "e29a4ff8572e50eb4f8dd4f55c74e3c22a0ad20b", "title": "Experimental evaluation of power saving mode against powering down in an NB-IoT modem"}, {"paperId": "cf2ebf4a8cfe450e7dae857ad98a82f20cea6173", "title": "Low-Power Wireless IoT System for Indoor Environment Real-Time Monitoring and Alerting"}, {"paperId": "0c91215569c08acf1269ffb6d0684c75c8386e4c", "title": "Designing LoRaWAN Network For Unbiased Communication Between Nodes and Gateway"}, {"paperId": "172ca77d8eb82fc04d2b9eaa8610798903a7905d", "title": "MIRRA: A Modular and Cost-Effective Microclimate Monitoring System for Real-Time Remote Applications"}, {"paperId": "33b73737f11298d0c4136c24d17a142acf0ffe3c", "title": "A Comprehensive Review on Energy Harvesting Integration in IoT Systems from MAC Layer Perspective: Challenges and Opportunities"}, {"paperId": "416f8cd59f697a8a67f1dd27b16fdac6fc8d5394", "title": "Energy Efficiency in Short and Wide-Area IoT Technologies—A Survey"}, {"paperId": "8b50761971ecc377434639abfa5f485a98bfd49f", "title": "Study and design of a retrofitted smart water meter solution with energy harvesting integration"}, {"paperId": "7dd3a1694b320ef7f1f24d581d3e2c5e52125031", "title": "The Art of Designing Remote IoT Devices—Technologies and Strategies for a Long Battery Life"}, {"paperId": "dc4f77818f70c85b4cc7d28594bc855bb7fd2b5b", "title": "Assessing the Potential of LPWAN Communication Technologies for Near Real-Time Leak Detection in Water Distribution Systems"}, {"paperId": "b11268f1e2a2c41c366ecdb101d3ad3a5eed6842", "title": "Context-Aware Wireless Connectivity and Processing Unit Optimization for IoT Networks"}, {"paperId": "ca748ff5bf6d9a422d6a00d75efc2f0ea6714603", "title": "A Survey on Evaluating the Quality of Autonomic Internet of Things Applications"}, {"paperId": "9e8cdb95af95428570ffaf69c21829584579819d", "title": "A Sigfox Energy Consumption Model via Field Trial: Case of Smart Agriculture"}, {"paperId": "3aecbf5dc447add5a51beadca372834a6a277af2", "title": "AgriFusion: An Architecture for IoT and Emerging Technologies Based on a Precision Agriculture Survey"}, {"paperId": "7993a65b42744a8db0e46cb9740d2e3e4e2839ba", "title": "SMART ENERGY EFFICIENT TECHNIQUES FOR IoT ENABLED WIRELESS NODE"}]}
