{"paperId": "4ffcbdb5718bbf42dc6b7036a06ffaea31ba5c7b", "publicationVenue": null, "title": "AutoCache: Employing Machine Learning to Automate Caching in Distributed File Systems", "abstract": "The use of computational platforms such as Hadoop and Spark is growing rapidly as a successful paradigm for processing large-scale data residing in distributed file systems like HDFS. Increasing memory sizes have recently led to the introduction of caching and in-memory file systems. However, these systems lack any automated caching mechanisms for storing data in memory. This paper presents AutoCache, a caching framework that automates the decisions for when and which files to store in, or remove from, the cache for increasing system performance. The decisions are based on machine learning models that track and predict file access patterns from evolving data processing workloads. Our evaluation using real-world workload traces from a Facebook production cluster compares our approach with several other policies and showcases significant benefits in terms of both workload performance and cluster efficiency.", "venue": "2019 IEEE 35th International Conference on Data Engineering Workshops (ICDEW)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-08", "journal": {"name": "2019 IEEE 35th International Conference on Data Engineering Workshops (ICDEW)", "pages": "133-139"}, "authors": [{"authorId": "2013116", "name": "H. Herodotou"}], "citations": [{"paperId": "a3a70098809a964092e5b4ef52da2380f897e7cc", "title": "Hadoop-Oriented SVM-LRU (H-SVM-LRU): An Intelligent Cache Replacement Algorithm to Improve MapReduce Performance"}, {"paperId": "4f5ea832ca60128b940b0e38fa73f506503ae237", "title": "Cost-based Data Prefetching and Scheduling in Big Data Platforms over Tiered Storage Systems"}, {"paperId": "3b749cd1dd5e0e46bbd590b9ef088fdac0755fc1", "title": "P4LRU: Towards An LRU Cache Entirely in Programmable Data Plane"}, {"paperId": "1a1ac6b4c0112c03fc4738e94c971151e3450b10", "title": "Streaming Machine Learning for Supporting Data Prefetching in Modern Data Storage Systems"}, {"paperId": "5f66d85436283fba9d2049c24e30f1d28433ecfe", "title": "Smart Caching in a Data Lake for High Energy Physics Analysis"}, {"paperId": "ff09011c0a5f018d96ab5f51b08be3fedbede205", "title": "Accelerating ML/DL Applications With Hierarchical Caching on Deduplication Storage Clusters"}, {"paperId": "01cd1cf3119686cfe8dad1fc9934e4ce7b8a4825", "title": "Popularity-based full replica caching for erasure-coded distributed storage systems"}, {"paperId": "a6160c5ba175a11039a2d78504d5548bf07f39e1", "title": "Effective Big Data Caching through Reinforcement Learning"}, {"paperId": "80e69aa52f9a8610a1d9658726fa9f071c5f06ee", "title": "DCache: A Distributed Cache Mechanism for HDFS based on RDMA"}, {"paperId": "d783fc49ef221db21dc75a38598891d503d2e94f", "title": "Analysis of SQL Workloads on an Enterprise Datalake"}, {"paperId": "74d3de97231c0c78b90f4960533898c5465db953", "title": "An Intelligent Cache Management for Data Analysis at CMS"}, {"paperId": "8daf81a51094227b4fa4e8d18d3b558578c9fd8b", "title": "Automating Distributed Tiered Storage Management in Cluster Computing"}]}
