{"paperId": "4fff72902e7ad345358478b74a145fd65685ee9f", "publicationVenue": null, "title": "Persistent Data Sketching", "abstract": "A persistent data structure, also known as a multiversion data structure in the database literature, is a data structure that preserves all its previous versions as it is updated over time. Every update (inserting, deleting, or changing a data record) to the data structure creates a new version, while all the versions are kept in the data structure so that any previous version can still be queried. Persistent data structures aim at recording all versions accurately, which results in a space requirement that is at least linear to the number of updates. In many of today's big data applications, in particular for high-speed streaming data, the volume and velocity of the data are so high that we cannot afford to store everything. Therefore, streaming algorithms have received a lot of attention in the research community, which use only sublinear space by sacrificing slightly on accuracy. All streaming algorithms work by maintaining a small data structure in memory, which is usually called a em sketch, summary, or synopsis. The sketch is updated upon the arrival of every element in the stream, thus is ephemeral, meaning that it can only answer queries about the current status of the stream. In this paper, we aim at designing persistent sketches, thereby giving streaming algorithms the ability to answer queries about the stream at any prior time.", "venue": "SIGMOD Conference", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2015-05-27", "journal": {"name": "Proceedings of the 2015 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "12457830", "name": "Zhewei Wei"}, {"authorId": "2142400057", "name": "Ge Luo"}, {"authorId": "144744111", "name": "K. Yi"}, {"authorId": "144589756", "name": "Xiaoyong Du"}, {"authorId": "2259699", "name": "Ji-Rong Wen"}], "citations": [{"paperId": "606b284045e1ad2615839bb2d4fc175e4c97e00e", "title": "Anomalous vehicle recognition in smart cities using persistent bloom filter: Memory efficient and intelligent monitoring"}, {"paperId": "b548a60e76e3ab49d5c407dcc0ae3bc79325666f", "title": "MicroscopeSketch: Accurate Sliding Estimation Using Adaptive Zooming"}, {"paperId": "002197f66f0b5d79a849273ee319de5f0ce2b38c", "title": "Hyper-USS: Answering Subset Query Over Multi-Attribute Data Stream"}, {"paperId": "5b2118bd4bd1136c990cf29ef830dbdb26f6fb80", "title": "TreeSensing: Linearly Compressing Sketches with Flexibility"}, {"paperId": "cdb1f25800f32978204a68dcc5bd9adcda5d2c47", "title": "Double-Anonymous Sketch: Achieving Top-K-fairness for Finding Global Top-K Frequent Items"}, {"paperId": "73139a44b9a9f2deb675d16e11ff91e3f6f1a72b", "title": "Persistent graph stream summarization for real-time graph analytics"}, {"paperId": "5f1ebfe3f9f87f93cdab0241765d0a6c03a49a5b", "title": "SketchConf: A Framework for Automatic Sketch Configuration"}, {"paperId": "29df816fd2ba778e9c07d474b9cf476a4911d6c2", "title": "Enabling Efficient and General Subpopulation Analytics in Multidimensional Data Streams"}, {"paperId": "a47de62f21251cc9acf6c61aad3d7f976fd8395a", "title": "MinMax Sampling: A Near-optimal Global Summary for Aggregation in the Wide Area"}, {"paperId": "5ccfc444a34b44b30662734c9ce27ba83eecb751", "title": "The Stair Sketch: Bringing more Clarity to Memorize Recent Events"}, {"paperId": "b569bb1dd8d9755dc9cc5e11967c595abbd84641", "title": "Stingy Sketch: A Sketch Framework for Accurate and Fast Frequency Estimation"}, {"paperId": "816c0e21f77173a4aeace4734787f4e536f3eabb", "title": "Cluster-Reduce: Compressing Sketches for Distributed Data Streams"}, {"paperId": "e4cc46612265bd06be39e1e7719bc34c040fb01e", "title": "BurstSketch: Finding Bursts in Data Streams"}, {"paperId": "27ea8398ea5d360731573b4816f8fd4365c3f275", "title": "Out of Many We are One: Measuring Item Batch with Clock-Sketch"}, {"paperId": "33ac6c59778504fa240c73dd86186e660d7a5467", "title": "XY-Sketch: on Sketching Data Streams at Web Scale"}, {"paperId": "21c04d5cb3e486a19c95ba68f9e8787aa06ce695", "title": "A survey of sketches in traffic measurement: Design, Optimization, Application and Implementation"}, {"paperId": "9d967fc794f2e093d65151960d60c7a2eb1a336f", "title": "On-Off Sketch: A Fast and Accurate Sketch on Persistence"}, {"paperId": "08298577e56ad094cdbfa9d7ac4305db75ebb3c1", "title": "WavingSketch: An Unbiased and Generic Sketch for Finding Top-k Items in Data Streams"}, {"paperId": "d1e14c6778449c9e934e2ee96436974fc4d09ede", "title": "I Know What You Did Last Summer: Network Monitoring using Interval Queries"}, {"paperId": "61128e48db084440ab5dd0bdd5e1fddc652976c7", "title": "Rosetta: A Robust Space-Time Optimized Range Filter for Key-Value Stores"}, {"paperId": "99f928f516c7a74fce095c159dedf18c3ca36b21", "title": "Fast and Accurate Traffic Measurement With Hierarchical Filtering"}, {"paperId": "c6bfc75a32c29d0f193bed33ec040f65484f57f0", "title": "I Know What You Did Last Summer"}, {"paperId": "f397cfb1eea69a0d7c2894c6eb24659bb856c658", "title": "Flattened Exponential Histogram for Sliding Window Queries over Data Streams"}, {"paperId": "fc12d0953ab5c89403882a32b0715ee093c88097", "title": "HEE-Sketch: an Efficient Sketch for Sliding-Window Frequency Estimation over Skewed Data Streams"}, {"paperId": "9ad7a00f19076e9b003e52e52c6f8f3c10d10f97", "title": "Intuition"}, {"paperId": "fa04890db58c904f5dab783d3e7d0cc021a4ab28", "title": "When the levee breaks: a practical guide to sketching algorithms for processing the flood of genomic data"}, {"paperId": "864bd8a9769fbd4cdd67faf0c55184b1f1044071", "title": "A Hybrid Aggregate Index Method for Trajectory Data"}, {"paperId": "ac56ae746482b9e6ad3177f15f26d4f3904f9d42", "title": "Fast and accurate stream processing by filtering the cold"}, {"paperId": "53b5b70c68c57b930de73ce6f9756f46f81f1c35", "title": "Continuous decaying of telco big data with data postdiction"}, {"paperId": "b41900819d1b2ba476a9ab1f97747e36b3d06934", "title": "L'art d'extraire des éléments du top-k en temps réel sur des fenêtres glissantes réparties"}, {"paperId": "f894c30e479a9db6e3c5e5c1eb549bbdcddd0895", "title": "Bursty Event Detection Throughout Histories"}, {"paperId": "6b5f112c6d4dbcb1dfea1870b8a06bfad44c5d00", "title": "Top-k frequent items and item frequency tracking over sliding windows of any size"}, {"paperId": "35daeda91647d6a7ca9b6e716f2e1ba834d0c293", "title": "On the Fly Detection of the Top-K Items in the Distributed Sliding Window Model"}, {"paperId": "07b7c3f2294413cc90ff66af0430dc592dab6fb4", "title": "Decaying Telco Big Data with Data Postdiction"}, {"paperId": "4034043742ac0632f5909fa041eaefc1334aefb7", "title": "Finding Top-k Most Frequent Items in Distributed Streams in the Time-Sliding Window Model"}, {"paperId": "2198ee2b55fc99fca29007872ba98104673d2a60", "title": "Persistent Bloom Filter: Membership Testing for the Entire History"}, {"paperId": "e84327303a9920997e25c329ccf9c4fe140e2c8c", "title": "Cold Filter: A Meta-Framework for Faster and More Accurate Stream Processing"}, {"paperId": "708fb67d6a6b8653e8a351814994c01cac122cad", "title": "Identifying the Most Recent Heavy Hitters in Large-Scale Streams Using Block-wise Counting"}, {"paperId": "e03bd4b42704988fe0a5ff4a35df0f408c7cdcda", "title": "Compass: Spatio Temporal Sentiment Analysis of US Election What Twitter Says!"}, {"paperId": "f0bf63eda9bdaa7624bfe307021dd9e621dccec7", "title": "Top-k Frequent Items and Item Frequency Tracking over Sliding Windows of Any Sizes"}, {"paperId": "c223ca02910e52e9b279d06956e3379dcdbe307b", "title": "Approximate OLAP on Sustained Data Streams"}, {"paperId": "a8f5b10ef728a5eb7ff8c9e82bb4ce10eaae6c7b", "title": "Media, Meaning, and Context Loss in Ephemeral Communication Platforms: A Qualitative Investigation on Snapchat"}, {"paperId": "e618c2267170591e20e1a2af0746359554e4a11f", "title": "Unbiased Real-time Traffic Sketching"}, {"paperId": "b13b441ff88d5296ae15f97f3f549f15081d14f6", "title": "Multidimensional Analysis of Big Data"}]}
