{"paperId": "5018bb38991b05b4998a8f6149cc27104a4f29eb", "publicationVenue": {"id": "362af315-de6f-4a12-a166-32319241ba84", "name": "Journal of Web Engineering", "type": "journal", "alternate_names": ["J Web Eng"], "issn": "1540-9589", "alternate_issns": ["1544-5976"], "url": "http://www.rintonpress.com/journals/jwe/index.html"}, "title": "JITA4DS: Disaggregated execution of Data Science Pipelines between the Edge and the Data Centre", "abstract": "This paper targets the execution of data science (DS) pipelines supported by data processing, transmission and sharing across several resources executing greedy processes. Current data science pipelines environments provide various infrastructure services with computing resources such as general-purpose processors (GPP), Graphics Processing Units (GPUs), Field Programmable Gate Arrays (FPGAs) and Tensor Processing Unit (TPU) coupled with platform and software services to design, run and maintain DS pipelines. These one-fits-all solutions impose the complete externalization of data pipeline tasks. However, some tasks can be executed in the edge, and the backend can provide just in time resources to ensure ad-hoc and elastic execution environments.This paper introduces an innovative composable “Just in Time Architecture” for configuring DCs for Data Science Pipelines (JITA-4DS) and associated resource management techniques. JITA-4DS is a cross-layer management system that is aware of both the application characteristics and the underlying infrastructures to break the barriers between applications, middleware/operating system, and hardware layers. Vertical integration of these layers is needed for building a customizable Virtual Data Center (VDC) to meet the dynamically changing data science pipelines’ requirements such as performance, availability, and energy consumption. Accordingly, the paper shows an experimental simulation devoted to run data science workloads and determine the best strategies for scheduling the allocation of resources implemented by JITA-4DS.", "venue": "Journal of Web Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-05", "journal": {"name": "ArXiv", "volume": "abs/2108.02558"}, "authors": [{"authorId": "1393643717", "name": "Genoveva Vargas-Solar"}, {"authorId": "1799510", "name": "A. Akoglu"}, {"authorId": "1500422067", "name": "M. S. Hassan"}], "citations": [{"paperId": "be43314d47a584985b6dfe514b7c7c611169bfee", "title": "Contention-aware Performance Modeling for Heterogeneous Edge and Cloud Systems"}, {"paperId": "17bb3b90b73640ce3ab2edda0fb079c1b88fc26b", "title": "Strategies for creating knowledge graphs to depict a multi-perspective Queer communities representation"}]}
