{"paperId": "50188173d1b50df800ed7da788b98493753a7864", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation", "abstract": "The smart grid (SG) is a contemporary electrical network that enhances the network’s performance, reliability, stability, and energy efficiency. The integration of cloud and fog computing with SG can increase its efficiency. The combination of SG with cloud computing enhances resource allocation. To minimise the burden on the Cloud and optimise resource allocation, the concept of fog computing integration with cloud computing is presented. Fog has three essential functionalities: location awareness, low latency, and mobility. We offer a cloud and fog-based architecture for information management in this study. By allocating virtual machines using a load-balancing mechanism, fog computing makes the system more efficient (VMs). We proposed a novel approach based on binary particle swarm optimisation with inertia weight adjusted using simulated annealing. The technique is named BPSOSA. Inertia weight is an important factor in BPSOSA which adjusts the size of the search space for finding the optimal solution. The BPSOSA technique is compared against the round robin, odds algorithm, and ant colony optimisation. In terms of response time, BPSOSA outperforms round robin, odds algorithm, and ant colony optimisation by 53.99 ms, 82.08 ms, and 81.58 ms, respectively. In terms of processing time, BPSOSA outperforms round robin, odds algorithm, and ant colony optimisation by 52.94 ms, 81.20 ms, and 80.56 ms, respectively. Compared to BPSOSA, ant colony optimisation has slightly better cost efficiency, however, the difference is insignificant.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1992906806", "name": "Junaid Akram"}, {"authorId": "67191236", "name": "Arsalan Tahir"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "31006636", "name": "A. Akram"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "90bdbf83e6f67f21f8b6b11687f9071bb8888a22", "title": "An enhanced coati optimization algorithm for optimizing energy management in smart grids for home appliances"}, {"paperId": "eb22efbee80b1e5b2a6a3fba221332630d725e13", "title": "Edge Offloading in Smart Grid"}, {"paperId": "44431fb4dd48fcd96c9d6191b3f83465f54e5acf", "title": "Chained-Drones: Blockchain-based privacy-preserving framework for secure and intelligent service provisioning in Internet of Drone Things"}, {"paperId": "2ccd05eafb17bdeee550e5095054573619ab6fc9", "title": "Energy Aware Load Balancing Framework for Smart Grid Using Cloud and Fog Computing"}, {"paperId": "a3dbef68dd282c4581fad8cd5735394643d4f6c4", "title": "An Innovative Cloud-Fog-Based Smart Grid Scheme for Efficient Resource Utilization"}, {"paperId": "a3f390074d06b72d985919b6c0686b2064bde289", "title": "Task Scheduling Algorithms in Fog Computing: A Comparison and Analysis"}, {"paperId": "59a84b898a12414ab2dc342588218dcf0c3caaf7", "title": "BC-IoDT: blockchain-based framework for authentication in internet of drone things"}, {"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "title": "Crack Detection in Concrete Structures Using Deep Learning"}, {"paperId": "06e518acebf0cb37e5b4de7f05bf44ce328d46b8", "title": "Efficient Energy Distribution for Smart Household Applications"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "364721545f275cbb18ecf2539dab7808f10d3a8f", "title": "Resource Allocation Model for Cloud-Fog Based Smart Grid"}]}
