{"paperId": "5034445e870731bfe71c57afe500d6175cc33588", "publicationVenue": null, "title": "Responsive Geographical Information Systems for Spatio-Temporal Analysis of Mobile Networks in Barcelona", "abstract": "Objetivo: Este documento propone una metodologia para utilizar los datos de cobertura de la red de telefonia movil de la plataforma de Cobertura Movil (GenCat) para detectar patrones espaciales y temporales en multiples escalas y en diferentes niveles de granularidad geografica (clases administrativas y de Atlas Urbano). El documento describe un Sistema de informacion geografica sensible (\"Cobertura movil sensible (RMC)\") de una gran cantidad de datos de puntos de redes moviles que integran tecnicas de resumen y modelos visuales dinamicos. Metodologia: Para ese proposito, se describe e implementa un marco integrado de Analisis de Datos Exploratorios (EDA) y GIS Cloud Computing, utilizando herramientas de codigo abierto como Jupyter (Python), ArcGIS Online y el ESRI Web AppBuilder para ArcGIS. La metodologia fue probada con datos de Barcelona en agosto de 2015. Conclusiones: El marco RMC presenta capacidades para integrar informacion adicional del panorama de Big Data de Cataluna y, por lo tanto, mejorar el acceso a datos abiertos para el sector publico, empresas privadas, ciudadanos y cientificos. Los metodos desarrollados tienen potencial para la definicion y el analisis de la distribucion de indicadores de agregacion en ciudades, el monitoreo de la precision de las redes moviles en diferentes contextos administrativos y urbanos, y permiten a los ciudadanos dar sentido a dichos datos para mejorar su conocimiento cientifico, la vida diaria y Fomento de la toma de decisiones colectivas. Originalidad: El documento demuestra que RMC puede ser una herramienta muy util para la visualizacion receptiva y para mejorar los diferentes procesos de toma de decisiones en Barcelona. Sugerimos un enfoque de la ciencia de datos, donde el flujo de trabajo completo tiene lugar dentro de un paradigma de Big Data, para producir resultados reproducibles, utilizando las mejores practicas en investigacion cientifica.", "venue": "ACE: Architecture, City and Environment", "year": 2019, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2019-06-01", "journal": {"name": "ACE: Architecture, City and Environment"}, "authors": [{"authorId": "2286292139", "name": "Francisco Sacramento Gutierres"}, {"authorId": "2053981208", "name": "Antonio Torrente"}, {"authorId": "1403856610", "name": "M. Torrent-Moreno"}], "citations": [{"paperId": "fe0a20285087314a6fdf934cddf28a58b0fde728", "title": "Spatial-Temporal Analysis and Visualization of Rural Development Works Implemented Under World’s Largest Social Safety Programme in India—a Case Study"}]}
