{"paperId": "5045484d9947ecaedb116ad6c36b59e0f200b8da", "publicationVenue": {"id": "74147530-6994-48e2-bf9c-7006f268d34c", "name": "ACM International Conference on Computing Frontiers", "type": "conference", "alternate_names": ["Computing Frontiers", "CF", "Comput Front", "ACM Int Conf Comput Front"], "url": "http://www.computingfrontiers.org/"}, "title": "An FPGA framework for edge-centric graph processing", "abstract": "Many emerging real-world applications require fast processing of large-scale data represented in the form of graphs. In this paper, we design a Field-Programmable Gate Array (FPGA) framework to accelerate graph algorithms based on the edge-centric paradigm. Our design is flexible for accelerating general graph algorithms with various vertex attributes and update propagation functions, such as Sparse Matrix Vector Multiplication (SpMV), PageRank (PR), Single Source Shortest Path (SSSP), and Weakly Connected Component (WCC). The target platform consists of large external memory to store the graph data and FPGA to accelerate the processing. By taking an edge-centric graph algorithm and hardware resource constraints as inputs, our framework can determine the optimal design parameters and produce an optimized Register-Transfer Level (RTL) FPGA accelerator design. To improve data locality and increase parallelism, we partition the input graph into non-overlapping partitions. This enables our framework to efficiently buffer vertex data in the on-chip memory of FPGA and exploit both inter-partition and intra-partition parallelism. Further, we propose an optimized data layout to improve external memory performance and reduce data communication between FPGA and external memory. Based on our design methodology, we accelerate two fundamental graph algorithms for performance evaluation: Sparse Matrix Vector Multiplication (SpMV) and PageRank (PR). Experimental results show that our accelerators sustain a high throughput of up to 2250 Million Traversed Edges Per Second (MTEPS) and 2487 MTEPS for SpMV and PR, respectively. Compared with several highly-optimized multi-core designs, our FPGA framework achieves up to 20.5× speedup for SpMV, and 17.7× speedup for PR, respectively; compared with two state-of-the-art FPGA frameworks, our designs demonstrate up to 5.3× and 1.8× throughput improvement for SpMV and PR, respectively.", "venue": "ACM International Conference on Computing Frontiers", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-05-08", "journal": {"name": "Proceedings of the 15th ACM International Conference on Computing Frontiers"}, "authors": [{"authorId": "2110990110", "name": "Shijie Zhou"}, {"authorId": "2286832947", "name": "R. Kannan"}, {"authorId": "33352252", "name": "Hanqing Zeng"}, {"authorId": "1728271", "name": "V. Prasanna"}], "citations": [{"paperId": "bd7d6f3afb16ac4db48f806358886cf84712ea51", "title": "Advancements in spiking neural network communication and synchronization techniques for event-driven neuromorphic systems"}, {"paperId": "4b8af75c85c2603f8fdb647613896f2375d0c1c4", "title": "Flip: Data-centric Edge CGRA Accelerator"}, {"paperId": "07abad323320b1368935b429379d1f581b720c0f", "title": "A Time-Domain Wavefront Computing Accelerator With a 32 × 32 Reconfigurable PE Array"}, {"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "5a1266b91f9d37a99ef3977e0ebc28362a638b3b", "title": "An edge re-ordering based acceleration architecture for improving data locality in graph analytics applications"}, {"paperId": "beef8f38759e5d464192b0e23bd38a5fac85b5f0", "title": "FASI: FPGA-friendly Subgraph Isomorphism on Massive Graphs"}, {"paperId": "dfddc6943706ff367ae9c9536b70e6da3f2a318a", "title": "ACTS: A Near-Memory FPGA Graph Processing Framework"}, {"paperId": "75aa3317a7be7d66ab2562924565c9aeab27509d", "title": "Graph_CC: Accelerator of Connected Component Search in Graph Computing"}, {"paperId": "105352aa26973006ccd5417e0cf65f07256b46ec", "title": "Analysis of Graph Processing in Reconfigurable Devices for Edge Computing Applications"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "0de2f7c29a53ae19f5a6bc6b8a898fc770cb6e8f", "title": "ReGraph: Scaling Graph Processing on HBM-enabled FPGAs with Heterogeneous Pipelines"}, {"paperId": "4f9fa7efe513d73e620099556689c6f640b006d1", "title": "Svelto: High-Level Synthesis of Multi-Threaded Accelerators for Graph Analytics"}, {"paperId": "03b32509afc7170b54f7c9577bcde4b52455670d", "title": "JetStream: Graph Analytics on Streaming Data with Event-Driven Hardware Accelerator"}, {"paperId": "b77dbc03af5c54166cb2794aa421a7c20fad30d5", "title": "Neuromorphic Design Using Reward-based STDP Learning on Event-Based Reconfigurable Cluster Architecture"}, {"paperId": "5984a0b6957b0e9ed8b030c3784f3ec367fbfd8c", "title": "SISA: Set-Centric Instruction Set Architecture for Graph Mining on Processing-in-Memory Systems"}, {"paperId": "492dd72eefe96dbeac7d584bdd5a8defc84f519e", "title": "FAST: FPGA-based Subgraph Matching on Massive Graphs"}, {"paperId": "13d38e22daa7e1b0844e785c4e51dd1789cadc14", "title": "ThunderGP: HLS-based Graph Processing Framework on FPGAs"}, {"paperId": "7d435b6fa2c5814a72b82d83d029cc480085d253", "title": "GraphPulse: An Event-Driven Hardware Accelerator for Asynchronous Graph Processing"}, {"paperId": "2ef5cf1f45958f3a42719064ad92ff989377b653", "title": "A FPGA based intra-parallel architecture for PageRank graph processing"}, {"paperId": "66eafa5f42b1b5b8d9f13776b135141018bcb1b4", "title": "Things to Consider to Enable Dynamic Graphs in Processing-in-Memory"}, {"paperId": "8cb35bbf013802218d1c3554051ac5425d91868a", "title": "Exploring FPGA Optimizations in OpenCL for Breadth-First Search on Sparse Graph Datasets"}, {"paperId": "a3076cd3b4fd4795b46bc44816fe3adb9ec0abe1", "title": "Efficient Graph Query Processing over Geo-Distributed Datacenters"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "a483dabece831b875269db372d7a0f6a51f56e25", "title": "GraphABCD: Scaling Out Graph Analytics with Asynchronous Block Coordinate Descent"}, {"paperId": "8c879b8afef2184dc75f7ff9923fd78be8c0af30", "title": "Substream-Centric Maximum Matchings on FPGA"}, {"paperId": "db0b44855b14533a22dbbd09f24f62a08cedef80", "title": "Practice of Streaming Processing of Dynamic Graphs: Concepts, Models, and Systems"}, {"paperId": "1d7e36762ba7cda0231ff6f64d33f3c324f5d48b", "title": "Practice of Streaming and Dynamic Graphs: Concepts, Models, Systems, and Parallelism"}, {"paperId": "90d5c7b0189a40e39cfb0b784287620dd60120c4", "title": "GraVF-M"}, {"paperId": "efa7a4154f5987ab485184597f4eabcc572e7360", "title": "Efficient SpMV Operation for Large and Highly Sparse Matrices using Scalable Multi-way Merge Parallelization"}, {"paperId": "b333be37cc7e11ca5429a1ace443f244bd94d240", "title": "HitGraph: High-throughput Graph Processing Framework on FPGA"}, {"paperId": "1ed069f94344d4e3ba0743a39cf8b013d02857ca", "title": "On-The-Fly Parallel Data Shuffling for Graph Processing on OpenCL-Based FPGAs"}, {"paperId": "4a08ae095a2322a5fd3d4610fa1a67d125b61197", "title": "Dr. BFS: Data Centric Breadth-First Search on FPGAs"}, {"paperId": "0b9078c176ded3a7d46dd56f242a74ab3e92a241", "title": "Graph Processing on FPGAs: Taxonomy, Survey, Challenges"}, {"paperId": "804d4e014be4bc6b74c82f45225321a256d32583", "title": "Accelerating Sparse Matrix Kernels with Co-Optimized Architecture"}, {"paperId": "a4ae456c482371883e3e418a2e92a0ce30ef28d5", "title": "FPGA-Accelerated Compactions for LSM-based Key-Value Store"}, {"paperId": "765b7edab35185b9a85334f4c9262c063acf8822", "title": "Large-scale Graph Analysis: System, Algorithm and Optimization"}, {"paperId": "ed8b17f52661c9696e0003d78fceb6cb25b22e16", "title": "Conclusions"}, {"paperId": "9aa1f78cc81b90047ef8fccc7994cf9102467c9f", "title": "1 Graph Processing on FPGAs : Taxonomy , Survey , Challenges Towards Understanding of Modern Graph Processing , Storage , and Analytics"}]}
