{"paperId": "504d99e11b27cb6006169a1de2822de4504a1664", "publicationVenue": null, "title": "An Architecture to Support Interoperability in IoT Devices", "abstract": "The field of Internet of things has seen a rapid growth in the recent years and it is expected to keep growing as such in the coming years. In order to take advantage of this and to have their share of profit from the market the billion-dollar companies, as well as start-up manufacturers, are competing to make the best possible devices for various tasks as per demand in different IoT domains, hence a new kind of challenge arose i.e. interoperability. Since each manufacturer uses a different combination of technologies in its product, so there is no guarantee that every device in the market would be compatible with every other device, straight out of the box. Due to the heterogeneity of devices in hardware and software, the problem of interoperability has to be taken care of multiple layers of operation. A system is required which eliminates so-called, \"closed\" or \"vertical\" silos of information which are followed by each manufacturer only then we can obtain the true value of IoT residing in the data being created and transmitted when the devices interact with each other.", "venue": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "pages": "705-710"}, "authors": [{"authorId": "150323384", "name": "T. Pratik"}, {"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "50767915", "name": "G. K. Nayak"}, {"authorId": "88015491", "name": "Ankur Kumar"}], "citations": [{"paperId": "c7726afa9f71c6bc825a5ee7102467c4a008efab", "title": "In-depth analysis and open challenges of Mist Computing"}, {"paperId": "14d8ac62931ac1e6f3d145c56cae346bf6b1fd22", "title": "Cluster-Based Routing Protocol with Static Hub (CRPSH) for WSN-Assisted IoT Networks"}, {"paperId": "14f0d4d4c78d8456865d2dde1234aea7815ccdb8", "title": "Brokerage System for Integration of LrWPAN Technologies"}, {"paperId": "e309fd0f6b739eb068ff32bc363e31b5da6892b2", "title": "Distributed Intelligence in the Internet of Things: Challenges and Opportunities"}, {"paperId": "b548577d3a4c1886dbaf107030151e2978eae4c5", "title": "A Systematic Review on Software Architectures for IoT Systems and Future Direction to the Adoption of Microservices Architecture"}, {"paperId": "e0d1ecb96ccb409b1264aee32f65df42426f31a3", "title": "BCGeo: Blockchain-Assisted Geospatial Web Service for Smart Healthcare System"}, {"paperId": "a2a3d44eee147fa729b71e7a1c9939d80068007b", "title": "SAASPORT MODEL: EXPLORING PROTOCOL PORTABILITY, RESOURCE ELASTICITY AND MICROSERVICE ARCHITECTURE IN THE EFFICIENT EXECUTION OF IOT APPLICATIONS"}]}
