{"paperId": "50522020759cce970781af58869fbaf34c6ff868", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Using Local Knowledge and Remote Sensing in the Identification of Informal Settlements in Riyadh City, Saudi Arabia", "abstract": "Urban planning within Riyadh, the capital of Saudi Arabia, has been impacted by the presence of informal settlements. An understanding of the spatial distribution of these settlements is essential in developing urban policies. This study used remotely sensed imagery to evaluate and characterize informal settlements within the city, both with and without expert knowledge of the study area (defined as expert knowledge, EK). An informal settlement ontology for four study sites within Riyadh City was developed using an analytical hierarchy process (AHP). Local knowledge was translated into a ruleset to identify and map settlement areas using spatial, spectral, textural, and geometric techniques. These were combined with an object-based image analysis (OBIA) approach. The study demonstrated that combining expert knowledge and remotely sensed data can efficiently and accurately identify informal settlements. Two classified images were produced, one with EK, and one without EK, to investigate how a detailed understanding of local conditions could affect the final image classification. Overall accuracy when using EK was 94%, with a kappa coefficient of 89%, while without EK accuracy was 68% (kappa coefficient of 61%). The final OBIA classes included formal and informal settlements, road networks, vacant blocks, shaded areas, and vegetation. This study demonstrated that local expert knowledge and OBIA helpful in urban mapping. It also indicated the value of integrating a local ontological process during digital image classification. This work provided improved techniques for mapping informal settlements in Middle Eastern cities.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-06", "journal": {"name": "Remote. Sens.", "pages": "3895", "volume": "15"}, "authors": [{"authorId": "2120762976", "name": "Khlood Ghalib Alrasheedi"}, {"authorId": "48394157", "name": "A. Dewan"}, {"authorId": "1448663879", "name": "A. el-Mowafy"}], "citations": [{"paperId": "90ba9e76cbb13521e94881e1d422cc739f8a40fa", "title": "Assessing Human Settlement Sprawl in Mexico via Remote Sensing and Deep Learning"}, {"paperId": "6babde4623d7dae4be3dcf7c67f4c96ae5e44bdf", "title": "A Weighted Overlay Analysis for Assessing Urban Flood Risks in Arid Lands: A Case Study of Riyadh, Saudi Arabia"}, {"paperId": "c4777b9b29b22e58d1527c66a4950427d45db4be", "title": "Decision support based on performance data using the analytic hierarchy process without expert judgement"}, {"paperId": "9f0f8386b051c9b0c1391b3ed3b27ffb7b16e37c", "title": "Mapping Slums in Mumbai, India, Using Sentinel-2 Imagery: Evaluating Composite Slum Spectral Indices (CSSIs)"}]}
