{"paperId": "5061c2893d144542d122bf357e2d1558ee920d8a", "publicationVenue": {"id": "ede7e9cc-1657-47d5-bcf1-1ca3b056bf9d", "name": "Journal of Management Information Systems", "type": "journal", "alternate_names": ["J Manag Inf Syst"], "issn": "0742-1222", "url": "http://www.mesharpe.com/mall/results1.asp?ACR=MIS", "alternate_urls": ["http://www.metapress.com/openurl.asp?genre=journal&issn=0742-1222", "http://www.tandfonline.com/toc/mmis20/current", "http://www.tandfonline.com/loi/mmis", "http://www.jstor.org/journals/07421222.html", "https://www.jstor.org/journal/jmanainfosyst", "http://www.jmis-web.org/"]}, "title": "Quality Assessment of Peer-Produced Content in Knowledge Repositories using Development and Coordination Activities", "abstract": "Abstract We develop a method to assess the quality of peer-produced content in knowledge repositories using their development and coordination histories. We also develop a process to identify relevant features for quality assessment models and algorithms for processing datasets in large-scale knowledge repositories. Models using these features, on English language Wikipedia articles, outperform existing methods for quality assessment. We achieve an overall accuracy of 81 percent which is a 7 percent improvement over existing models. In addition, our features improve the precision and recall of each class up to 9 percent and 17 percent respectively. Finally, our models are robust to ten-fold cross validation and techniques used for classification. Overall, our research provides a comprehensive design science framework for both identifying and efficiently extracting features related to development and coordination activities and assessing quality using these features. We also provide details of potential implementation of a quality assessment system for knowledge repositories.", "venue": "Journal of Management Information Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-03", "journal": {"name": "Journal of Management Information Systems", "pages": "478 - 512", "volume": "36"}, "authors": [{"authorId": "2639373", "name": "Srikar Velichety"}, {"authorId": "144307032", "name": "S. Ram"}, {"authorId": "2139815", "name": "J. Bockstedt"}], "citations": [{"paperId": "463de291b85c473293e54514142678f16e74b3ea", "title": "Improving answer quality using image-text coherence on social Q&A sites"}, {"paperId": "d7b22ed7b4175b839ff62cf3170615c8edb055c5", "title": "Automatic Quality Assessment of Wikipedia Articles—A Systematic Literature Review"}, {"paperId": "321f7c502bd901ab5853510e50309a70261c1c67", "title": "Developing a contextual model of poverty prediction using data science and analytics - The case of Shelby County"}, {"paperId": "aceff6611e5645c8971c57035be5031db8e95d5e", "title": "Stigmergy in Open Collaboration: An Empirical Investigation Based on Wikipedia"}, {"paperId": "0d69a06abd3447dd0ae1f5f2710fcada710d984e", "title": "Cognition or interaction? Mediating factors influencing online group open collaboration"}, {"paperId": "4268c58a5dc2425da8ec8fd056896258c6102832", "title": "How Appreciation and Attention Affect Contributions to Electronic Networks of Practice"}, {"paperId": "a8242fa1f6deab01cf1216958691556f1474d2d9", "title": "Popularity Prediction for Consumers' Product Recommendation Articles"}, {"paperId": "573870b57dcf68296c1202de604acf5ff1a28580", "title": "Algorithmic enhancements to identify predictable components from users’ data and a framework to detect misinformation in social media"}, {"paperId": "93c488cf295781cf094db59f111f7f82531ed553", "title": "Nature and purpose of visual artifacts in design science research"}, {"paperId": "559edd1bce243679b2ce6392ef5fd640fac906df", "title": "MSEva: A Musculoskeletal Rehabilitation Evaluation System Based on EMG Signals"}, {"paperId": "a0b777b25cdf0fc992568ca52a5c7bebf1ee987f", "title": "Deep Transfer Learning & Beyond: Transformer Language Models in Information Systems Research"}, {"paperId": "374c3dc2aebf56edc9e0f39893967b6cbefc4b08", "title": "Predicting crowdfunding project success based on backers' language preferences"}, {"paperId": "e39debbe0719c6be23e30b17c196fcb87d0861e3", "title": "The Gender Bias Tug-of-War in a Co-creation Community: Core-Periphery Tension on Wikipedia"}, {"paperId": "c51cfb86cd08cf62e10fd0855db4ff47e74f060f", "title": "How can wikipedia be used to support the process of automatically building multilingual domain modules? a case study"}, {"paperId": "e0f52a1b335b335e8d9590cc938d6bd712308e0f", "title": "OKC-enabled online knowledge integration: role of group heterogeneity and group interaction process"}, {"paperId": "ab414fb4b583b72886051f695fb0801ae42a27d7", "title": "Effect of Crowd Voting on Participation in Crowdsourcing Contests"}, {"paperId": "dfed2a8146127ac186d458f75f77efab598e8f32", "title": "Temporal Effects of Repeated Recognition and Lack of Recognition on Online Community Contributions"}, {"paperId": "40a8996eef0a4a17579f1798764632ad0ad3996f", "title": "Deep Transfer Learning & Beyond : Transformer Language Models in Information Systems"}]}
