{"paperId": "50792ccc080aa7fb242fecdd0e64bd3555f7defe", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Fuzzy C-Means Clustering Interval Type-2 Cerebellar Model Articulation Neural Network for Medical Data Classification", "abstract": "This paper presents a fuzzy c-means clustering interval type-2 cerebellar model articulation neural network (FCM-IT2CMANN) method to help physicians improve diagnostic accuracy. The proposed method combines two classifiers, in which the IT2CMANN is the primary classifier and the fuzzy c-means algorithm is the pre-classifier. First, the data are divided into  $n_{c}$  groups using the pre-classifier, and then, the main classifier is applied to determine whether the sample is in a healthy or diseased state. Implementing the gradient descent method, the adaptive laws for updating the FCM-IT2CMANN parameters are derived. Furthermore, the system convergence is proven by the Lyapunov stability theory. Finally, the classification of breast cancer and liver disease datasets from the University of California at Irvine is conducted to illustrate the effectiveness of the proposed classifier.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-31", "journal": {"name": "IEEE Access", "pages": "20967-20973", "volume": "7"}, "authors": [{"authorId": "21215380", "name": "Tien-Loc Le"}], "citations": [{"paperId": "267e140ab499ead1210c0c9a216cc85840a9721f", "title": "Improving accuracy of medical data handling and processing using DCAF for IoT-based healthcare scenarios"}, {"paperId": "5afe58fdd922b6e776393feecf25e8a85c5f682b", "title": "Designing a Bankruptcy Prediction System using Function-Link Cerebellar Model Neural Network"}, {"paperId": "88ce920dda4217a574f79991fa8e0cb31d3d868d", "title": "Interval type-2 fuzzy neural networks with asymmetric MFs based on the twice optimization algorithm for nonlinear system identification"}, {"paperId": "086a81c51d35139927036c6e325f6d045a287e52", "title": "Design of Intelligent Controller Using Type-2 Fuzzy Cerebellar Model Articulation and 3D Membership Functions"}, {"paperId": "49f52c35a0403afa55ef824873ef5b0316bd11f0", "title": "Analysis of Structured Data in Biomedicine Using Soft Computing Techniques and Computational Analysis"}, {"paperId": "4eaa7d413f9abe9eaecbb8515d234daab66c6f56", "title": "Interval type-2 fuzzy brain emotional control design for the synchronization of 4D nonlinear hyperchaotic systems"}, {"paperId": "aa5e5ddd603e9f1454e3e0d333819fab9f9ee355", "title": "Role of machine learning in medical research: A survey"}, {"paperId": "bdab520ee91f86badea24b97cc4bae4b996ed62c", "title": "Improving the classification accuracy using hybrid techniques"}, {"paperId": "43e1a6d6d249507c1328aff4ab67abda393646b2", "title": "Self-Organizing Interval Type-2 Fuzzy Asymmetric CMAC Design to Synchronize Chaotic Satellite Systems Using a Modified Grey Wolf Optimizer"}, {"paperId": "386f318f16557a8b959b53dcdbd626b91594160b", "title": "Novel Nonlinear Hypothesis for the Delta Parallel Robot Modeling"}, {"paperId": "4650b799079f7ab88beb6f80deeccab7d957a480", "title": "Efficient classification of chronic kidney disease by using multi-kernel support vector machine and fruit fly optimization algorithm"}, {"paperId": "feac8f5cc39bb7e8927ac1cc010bf937f91a0b2d", "title": "Automatic Detection and Modeling of Underground Pipes Using a Portable 3D LiDAR System"}, {"paperId": "2f243294b011c06f39c4a375a71f1b2097db11ee", "title": "Predicting Drug Review Polarity Using the Combination Model of Multi-Sense Word Embedding and Fuzzy Latent Dirichlet Allocation (FLDA)"}, {"paperId": "12dc0006ed13847c607b6f21700a3bdf5265dff8", "title": "The Synchronization of Hyperchaotic Systems Using a Novel Interval Type-2 Fuzzy Neural Network Controller"}, {"paperId": "086dfd97308da92dfb7e2e5de9daf9581740a3ee", "title": "Unlabeled skin lesion classification by self-supervised topology clustering network"}, {"paperId": "d7f79f567127d906042c2fd20eaeb0e86f55e9b8", "title": "Multilayer Interval Type-2 Fuzzy Controller Design for Quadcopter Unmanned Aerial Vehicles Using Jaya Algorithm"}]}
