{"paperId": "507d53d2f3057d139b8e0da79bef0e8846e2a8fa", "publicationVenue": {"id": "777d7a41-df2c-4867-a5ec-63920572d28f", "name": "Biometrics", "type": "journal", "issn": "0006-341X", "url": "http://www3.interscience.wiley.com/journal/118538342/home", "alternate_urls": ["http://www.jstor.org/journals/0006341X.html", "https://www.jstor.org/journal/biometrics", "http://www.biometrics.tibs.org/"]}, "title": "Pattern‐based clustering of daily weigh‐in trajectories using dynamic time warping", "abstract": "“Smart”‐scales are a new tool for frequent monitoring of weight change as well as weigh‐in behavior. These scales give researchers the opportunity to discover patterns in the frequency that individuals weigh themselves over time, and how these patterns are associated with overall weight loss. Our motivating data come from an 18‐month behavioral weight loss study of 55 adults classified as overweight or obese who were instructed to weigh themselves daily. Adherence to daily weigh‐in routines produces a binary times series for each subject, indicating whether a participant weighed in on a given day. To characterize weigh‐in by time‐invariant patterns rather than overall adherence, we propose using hierarchical clustering with dynamic time warping (DTW). We perform an extensive simulation study to evaluate the performance of DTW compared to Euclidean and Jaccard distances to recover underlying patterns in adherence time series. In addition, we compare cluster performance using cluster validation indices (CVIs) under the single, average, complete, and Ward linkages and evaluate how internal and external CVIs compare for clustering binary time series. We apply conclusions from the simulation to cluster our real data and summarize observed weigh‐in patterns. Our analysis finds that the adherence trajectory pattern is significantly associated with weight loss.", "venue": "Biometrics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-11", "journal": {"name": "Biometrics", "pages": "2719 - 2731", "volume": "79"}, "authors": [{"authorId": "2089722572", "name": "S. Bothwell"}, {"authorId": "49444336", "name": "A. Kaĭzer"}, {"authorId": "2061403036", "name": "R. Peterson"}, {"authorId": "31900015", "name": "Danielle M. Ostendorf"}, {"authorId": "4959078", "name": "Victoria A Catenacci"}, {"authorId": "2065029731", "name": "Julia Wrobel"}], "citations": [{"paperId": "30d8507baf6bffd29fb6c10c9e30287dd2db0a29", "title": "Analysis of Active/Inactive Patterns in the NHANES Data using Generalized Multilevel Functional Principal Component Analysis"}]}
