{"paperId": "5085fda68407dce1b371d139190dc01820fb9984", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Delay-sensitive and Priority-aware Task Offloading for Edge Computing-assisted Healthcare Services", "abstract": "In this paper, we study the priority-aware task data offloading in edge computing-assisted healthcare service provisioning. The edge server aims to provide additional computing resources to the end-users for processing the delay-sensitive tasks. However, at the same time, it becomes a challenging issue when some of the tasks demand lower response time compared to the other tasks. We present a priority-aware task offloading and scheduling strategy that allocates the computing resources to the high-priority tasks. The hard-deadline tasks are processed first. Later, the remaining computing resources are used to tolerate longer average response time for the soft-deadline tasks. Moreover, we derive a lower bound of the average response time for all hard- and soft-deadline tasks. Through extensive simulations, we show that the proposed task scheduling manages to allocate the computing resources of both end-users and edge server to the hard-deadline tasks while scheduling the soft-deadline tasks with low priority.", "venue": "Global Communications Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "GLOBECOM 2020 - 2020 IEEE Global Communications Conference", "pages": "1-5"}, "authors": [{"authorId": "3114683", "name": "M. Mukherjee"}, {"authorId": "2109446797", "name": "Vikas Kumar"}, {"authorId": "2614399", "name": "D. Maity"}, {"authorId": "2946117", "name": "Rakesh Matam"}, {"authorId": "1773819", "name": "C. Mavromoustakis"}, {"authorId": "28719452", "name": "Qi Zhang"}, {"authorId": "1792431", "name": "G. Mastorakis"}], "citations": [{"paperId": "4ab13c9341cbf75ec2b4e150fd4d68adb2ea82ad", "title": "Priority-aware path planning and user scheduling for UAV-mounted MEC networks: A deep reinforcement learning approach"}, {"paperId": "c56ccf83bfff1ff388195f92d9d0090e08037fc1", "title": "Computation Offloading for Tasks With Bound Constraints in Multiaccess Edge Computing"}, {"paperId": "2415c14d9d6e83406871685f4698e80a4cd9e4a4", "title": "Online Bargaining Scheme Based Dynamic Resource Allocation for Soft-Deadline Tasks in Edge Computing"}, {"paperId": "a68a78814d4c8f1b48efbaf3c18d2c617436b862", "title": "Optimization Search Strategy for Task Offloading From Collaborative Edge Computing"}, {"paperId": "5f265df48c9fe3201551a71c9d57f140c49eaaa0", "title": "MR-DRO: A Fast and Efficient Task Offloading Algorithm in Heterogeneous Edge/Cloud Computing Environments"}, {"paperId": "22e1c199346233271033911c159b4691246931b7", "title": "Requirements for Energy-Harvesting-Driven Edge Devices Using Task-Offloading Approaches"}, {"paperId": "01883ec69805222b21e81fb9ae272fe2ba771848", "title": "Real-time running workouts monitoring using Cloud–Edge computing"}, {"paperId": "4a4a83c32e8c900f36e5a8a1dd1098d1bfe9576d", "title": "Cloud-Internet of Health Things (IOHT) Task Scheduling Using Hybrid Moth Flame Optimization with Deep Neural Network Algorithm for E Healthcare Systems"}, {"paperId": "ffe62b7a741baa8770e484ce20717da489daef6c", "title": "Online Auction Based Resource Allocation for Soft-Deadline Tasks in Edge Computing"}, {"paperId": "0fafbbe96b7cec975d5228f47df16b41ef7f74dd", "title": "Selfish Routing Game-Based Multi-Resource Allocation and Fair Scheduling of Indivisible Jobs in Edge Environments"}]}
