{"paperId": "508b40d99d5cdf1b81904200183734220152a845", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "An Adaptable Big Data Value Chain Framework for End-to-End Big Data Monetization", "abstract": "Today, almost all active organizations manage a large amount of data from their business operations with partners, customers, and even competitors. They rely on Data Value Chain (DVC) models to handle data processes and extract hidden values to obtain reliable insights. With the advent of Big Data, operations have become increasingly more data-driven, facing new challenges related to volume, variety, and velocity, and giving birth to another type of value chain called Big Data Value Chain (BDVC). Organizations have become increasingly interested in this kind of value chain to extract confined knowledge and monetize their data assets efficiently. However, few contributions to this field have addressed the BDVC in a synoptic way by considering Big Data monetization. This paper aims to provide an exhaustive and expanded BDVC framework. This end-to-end framework allows us to handle Big Data monetization to make organizations’ processes entirely data-driven, support decision-making, and facilitate value co-creation. For this, we present a comprehensive review of existing BDVC models relying on some definitions and theoretical foundations of data monetization. Next, we expose research carried out on data monetization strategies and business models. Then, we offer a global and generic BDVC framework that supports most of the required phases to achieve data valorization. Furthermore, we present both a reduced and full monetization model to support many co-creation contexts along the BDVC.", "venue": "Big Data and Cognitive Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-11-23", "journal": {"name": "Big Data Cogn. Comput.", "pages": "34", "volume": "4"}, "authors": [{"authorId": "1481047992", "name": "Abou Zakaria Faroukhi"}, {"authorId": "49339941", "name": "Imane El Alaoui"}, {"authorId": "2360190", "name": "Youssef Gahi"}, {"authorId": "40360441", "name": "A. Amine"}], "citations": [{"paperId": "d2090a0ef01fe9fcf834267a8361b1feafefcb77", "title": "A valorization framework to strategically manage data for creating competitive value"}, {"paperId": "1fc241f6f070e139b5b38a4439eeef7c78671d42", "title": "From data to data asset: conceptual evolution and strategic imperatives in the digital economy era"}, {"paperId": "046a4518d883d77c147ca47fe26a4a198562c01f", "title": "Spatial data trusts: an emerging governance framework for sharing spatial data"}, {"paperId": "037ea200fff605ddb1cfa8c1e7b9cce61a1d4c5c", "title": "KEPERLUAN PEMBINAAN MODEL PENGURUSAN DATA RAYA PEJABAT PENDIDIKAN DAERAH DI MALAYSIA"}, {"paperId": "1ad0320e97a297b09c1a059cc7d6300b4c548b35", "title": "A Literature Overview on Data-Driven Value and Accountability: Connecting the Private and Public Dimensions"}, {"paperId": "6063bd847e2606a5d835c4de58a484efce70e6d2", "title": "An Advanced Big Data Quality Framework Based on Weighted Metrics"}, {"paperId": "db7d8f024c15be74037b79f7aa4abb389ceb8d33", "title": "Data monetization: insights from a technology-enabled literature review and research agenda"}, {"paperId": "6b4d124bd0fcb55d5b2027ce680282f1322139c9", "title": "Value Creation and Capture with Big Data in Smart Phones Companies"}, {"paperId": "a324a5db21e91c3beafebebdd8868744b0cf0b0b", "title": "Potential of Big Data Analytics for Managing Value Creation"}, {"paperId": "84e49d646d8d32ab92a396cfa5ac1b5ae9f9a7ca", "title": "The Potential of Big Data Application in Mathematics Education in Malaysia"}, {"paperId": "e08b5b78664d12ea2aefedb36bb81e6564a474c4", "title": "Economics of Data Systematic Review for Planning Strategies in the InsurTech industry"}, {"paperId": "82716f0c45d6c2cac3eddee9663ab75b0ed1c2ab", "title": "Industry 4.0 Base Technologies and Business Models: A Bibliometric Analysis"}, {"paperId": "2802a7162b149636aff31183110a316b760c5d96", "title": "Blockchain-based Multifactor Authentication for Future 6G Cellular Networks: A Systematic Review"}, {"paperId": "23ef973dc26a27ffc7d8b5cef9d3f82529cb5041", "title": "Big data visualization using multimodal feedback in education"}, {"paperId": "886df8409427ecbea0c820248f2d691d515af5c0", "title": "Big Data Contribution in Desktop and Mobile Devices Comparison, Regarding Airlines' Digital Brand Name Effect"}, {"paperId": "56d72ab2593001b764a13731f752e2536b8a28f3", "title": "What about Data-Driven Business Models? Mapping the Literature and Scoping Future Avenues"}, {"paperId": "e48fe1d8a1310e867fee18d0b88ddd22a3cea0e5", "title": "Quality Anomaly Detection Using Predictive Techniques: An Extensive Big Data Quality Framework for Reliable Data Analysis"}, {"paperId": "73235dff4db9f41fe1547834fdf165df31838193", "title": "An End-to-End Big Data Deduplication Framework based on Online Continuous Learning"}, {"paperId": "58a9acfbd4c8a2319e4a73e45c5e752a1128ff1f", "title": "Customer Data-driven Business Models: A Case Study in the Retail Industry"}]}
