{"paperId": "5098bf49e37932cd4df0ce07018e4151b42c2790", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "Inspecting Buildings Using Drones and Computer Vision: A Machine Learning Approach to Detect Cracks and Damages", "abstract": "Manual inspection of infrastructure damages such as building cracks is difficult due to the objectivity and reliability of assessment and high demands of time and costs. This can be automated using unmanned aerial vehicles (UAVs) for aerial imagery of damages. Numerous computer vision-based approaches have been applied to address the limitations of crack detection but they have their limitations that can be overcome by using various hybrid approaches based on artificial intelligence (AI) and machine learning (ML) techniques. The convolutional neural networks (CNNs), an application of the deep learning (DL) method, display remarkable potential for automatically detecting image features such as damages and are less sensitive to image noise. A modified deep hierarchical CNN architecture has been used in this study for crack detection and damage assessment in civil infrastructures. The proposed architecture is based on 16 convolution layers and a cycle generative adversarial network (CycleGAN). For this study, the crack images were collected using UAVs and open-source images of mid to high rise buildings (five stories and above) constructed during 2000 in Sydney, Australia. Conventionally, a CNN network only utilizes the last layer of convolution. However, our proposed network is based on the utility of multiple layers. Another important component of the proposed CNN architecture is the application of guided filtering (GF) and conditional random fields (CRFs) to refine the predicted outputs to get reliable results. Benchmarking data (600 images) of Sydney-based buildings damages was used to test the proposed architecture. The proposed deep hierarchical CNN architecture produced superior performance when evaluated using five methods: GF method, Baseline (BN) method, Deep-Crack BN, Deep-Crack GF, and SegNet. Overall, the GF method outperformed all other methods as indicated by the global accuracy (0.990), class average accuracy (0.939), mean intersection of the union overall classes (IoU) (0.879), precision (0.838), recall (0.879), and F-score (0.8581) values. Overall, the proposed CNN architecture provides the advantages of reduced noise, highly integrated supervision of features, adequate learning, and aggregation of both multi-scale and multilevel features during the training procedure along with the refinement of the overall output predictions.", "venue": "Drones", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-24", "journal": {"name": "Drones"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "2141965392", "name": "A. Heravi"}, {"authorId": "98324213", "name": "Muhammad Jamaluddin Thaheem"}, {"authorId": "98736135", "name": "A. Maqsoom"}], "citations": [{"paperId": "9130aa67887965f974fa1b1991f0bad72c0a9e04", "title": "Easy Rocap: A Low-Cost and Easy-to-Use Motion Capture System for Drones"}, {"paperId": "9a69ebc2c522282a86cb0963e51a12b56a7edebf", "title": "Towards improving synthetic-to-real image correlation for instance recognition in structure monitoring"}, {"paperId": "83b33de376c0a54697de48bd206cd27b72dfb868", "title": "A Deep Learning Approach for Surface Crack Classification and Segmentation in Unmanned Aerial Vehicle Assisted Infrastructure Inspections"}, {"paperId": "54884229d203f3a1fa227d402f91fe5665a9d13e", "title": "Semi-supervised learning for concrete defect segmentation from images"}, {"paperId": "679e76f006124a0d99fb02e92e033d6d98cb82b4", "title": "A Roadmap for Applying Digital Technology to Improve the Efficiency of Construction Supervision in Building Projects: Focusing on Korean Cases"}, {"paperId": "4059f0080df9e70303c95b2d09c7ddd29d358ad4", "title": "Simulation-Based Object Detector for Real-Time Defect Recognition on Industrial Infrastructures"}, {"paperId": "ced4c6042c879fdbe5af5e2dbff25d6ec98fbf9e", "title": "Software Solution for UAS Route Planning and Flight Control Using Operative Meteorological Information"}, {"paperId": "012faef52e1b580740f0b7722cab0ea92fb04edd", "title": "Geographical Information System Enhancement Using Active Learning-Enhanced Semantic Segmentation"}, {"paperId": "bf109aa23d25ef5a7013d01f4bc6aa930ae2d85b", "title": "CLASSIFICATION OF DEFECTS IN WOODEN STRUCTURES USING PRE-TRAINED MODELS OF CONVOLUTIONAL NEURAL NETWORK"}, {"paperId": "f111c3fba302c443ce73dd6b958ae56dbe2ece7a", "title": "Review of Remote Sensing Approaches and Soft Computing for Infrastructure Monitoring"}, {"paperId": "111da24298d614e21d4748b45bfebd87050f0d70", "title": "Predicting characteristics of cracks in concrete structure using convolutional neural network and image processing"}, {"paperId": "263e591bb033b4dce211047b8cb770cdabf7cbec", "title": "Data requirements and availabilities for material passports: A digitally enabled framework for improving the circularity of existing buildings"}, {"paperId": "b8a1ef409e14f859a7e30e242c9af0bff713b0bf", "title": "A Perspective on AI-Based Image Analysis and Utilization Technologies in Building Engineering: Recent Developments and New Directions"}, {"paperId": "be76606b308135f595d156503011d27a143acdc2", "title": "Real Time Building Crack Visual Measurement System using Metaheuristics with Deep Learning Model"}, {"paperId": "728ec86d0f2640a905f7673df9b15f6e0d8ee3bd", "title": "Construction inspection & monitoring with quadruped robots in future human-robot teaming: A preliminary study"}, {"paperId": "c7abc95f1a8262be9a8363ee20fec2905ef42548", "title": "Constrained Adversarial Learning and its applicability to Automated Software Testing: a systematic review"}, {"paperId": "b8a76224ef642fdd4882fc5c4363c11460640304", "title": "On the use of synthetic images in deep learning for defect recognition in industrial infrastructures"}, {"paperId": "c33397dd05c194c08d43aded4f5724833e9b63ec", "title": "Robots in Inspection and Monitoring of Buildings and Infrastructure: A Systematic Review"}, {"paperId": "2c241c94883ff4a6f6123e04146ba2def867a9e7", "title": "An Intelligent Fault Diagnosis Approach for Multirotor UAVs Based on Deep Neural Network of Multi-Resolution Transform Features"}, {"paperId": "41eff44b835b5c80c0551d7689c94825acb68655", "title": "Impediments to Construction Site Digitalisation Using Unmanned Aerial Vehicles (UAVs)"}, {"paperId": "44f4e60a76391e7876b24b49bf781c91e49953e0", "title": "Assessment of Convolutional Neural Network Pre-Trained Models for Detection and Orientation of Cracks"}, {"paperId": "36a91a30943a0e335a15cd3384749ad444067d94", "title": "An Intelligent Quadcopter Unbalance Classification Method Based on Stochastic Gradient Descent Logistic Regression"}, {"paperId": "14093c389eccb4d6566d457688f02fae6d59fc02", "title": "On the benefits of automated tuning of hyper-parameters: an experiment related to temperature prediction on UAV computers"}, {"paperId": "b6a192ec39064b1f9cde5a779efd5c0a6849f5aa", "title": "Segmentation of trabecular bone microdamage in Xray microCT images using a two-step deep learning method."}, {"paperId": "45eba2ee33264e9d88d3c8cdb5435a764f971b3d", "title": "ARSD: An Adaptive Region Selection Object Detection Framework for UAV Images"}, {"paperId": "5e305075a5e3c98b56461cbb57461168f495c833", "title": "Unmanned Aircraft System Applications in Damage Detection and Service Life Prediction for Bridges: A Review"}, {"paperId": "fd9d227dbb7c84c3b676edf388bfecfc2d8509fd", "title": "A deep learning-based building defects detection tool for sustainability monitoring"}, {"paperId": "0bf1f6e106fcccfb113203bae3bbaf5b24dc6177", "title": "Orthofaçade-Based Assisted Inspection Method for Buildings"}, {"paperId": "59694d8b594ac2bb0f91dd4a0d681133f976939a", "title": "A Review on Machine Learning Styles in Computer Vision—Techniques and Future Directions"}]}
