{"paperId": "50ae3c7f1a57e2fd79bd27b748c42c8f2669ff6e", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Janus: A Hybrid Scalable Multi-Representation Cloud Datastore", "abstract": "Cloud-based data-intensive applications have to process high volumes of transactional and analytical requests on large-scale data. Businesses base their decisions on the results of analytical requests, creating a need for real-time analytical processing. We propose Janus, a hybrid scalable cloud datastore, which enables the efficient execution of diverse workloads by storing data in different representations. Janus manages big datasets in the context of datacenters, thus supporting scaling out by partitioning the data across multiple servers. This requires Janus to efficiently support distributed transactions. In order to support the different datacenter requirements, Janus also allows diverse partitioning strategies for the different representations. Janus proposes a novel data movement pipeline to continuously ensure up to date data between the different representations. Unlike existing multi-representation storage systems and Change Data Capture (CDC) pipelines, the data movement pipeline in Janus supports partitioning and handles both distributed transactions and diverse partitioning strategies. In this paper, we focus on supporting Online Transaction Processing (OLTP) and Online Analytical Processing (OLAP) workloads, and hence use row and column-oriented representations, which are the most efficient representations for these workloads. Our evaluations over Amazon AWS illustrate that Janus can provide real-time analytical results, in addition to processing high-throughput transactional workloads.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "689-702", "volume": "30"}, "authors": [{"authorId": "49994500", "name": "Vaibhav Arora"}, {"authorId": "1752765", "name": "Faisal Nawab"}, {"authorId": "143970078", "name": "D. Agrawal"}, {"authorId": "1709353", "name": "A. E. Abbadi"}], "citations": [{"paperId": "a9ba7e1ce9ae6266fc1befec0b0e4c79ca9323b6", "title": "Rethink Query Optimization in HTAP Databases"}, {"paperId": "a538f608e2dab90596e099b2e39a4bb8f5cb0600", "title": "Scalable and Robust Snapshot Isolation for High-Performance Storage Engines"}, {"paperId": "e9b0f9456717fb3985ce2c6b7dc15316d2e742e1", "title": "Tiresias: Enabling Predictive Autonomous Storage and Indexing"}, {"paperId": "984422da716d131e8b063e7e6397411fdee6918a", "title": "Proteus: Autonomous Adaptive Storage for Mixed Workloads"}, {"paperId": "46da45506281e47a5410761b910ce422cf08a5ac", "title": "Cloud-Native Transactions and Analytics in SingleStore"}, {"paperId": "826af61b7397d84cae45dcc8f9ab85b778af91f3", "title": "Near-Data Processing in Database Systems on Native Computational Storage under HTAP Workloads"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "d3ba27b361e3a6af22301c242d15f1542d330463", "title": "Data Warehouse Based on NoSQL: a literature mapping"}, {"paperId": "fd861a78c9db26dc4668a4fdfc73dfff58dadc8f", "title": "Polynesia: Enabling Effective Hybrid Transactional/Analytical Databases with Specialized Hardware/Software Co-Design"}, {"paperId": "5fd3fb819a557e61441ae931312246d541aa365c", "title": "Hybrid Transactional and Analytical Processing Databases: A Systematic Literature Review"}]}
