{"paperId": "50afc14226af83b4fc4276601bb310cc8627665b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Objcache: An Elastic Filesystem over External Persistent Storage for Container Clusters", "abstract": "Container virtualization enables emerging AI workloads such as model serving, highly parallelized training, machine learning pipelines, and so on, to be easily scaled on demand on the elastic cloud infrastructure. Particularly, AI workloads require persistent storage to store data such as training inputs, models, and checkpoints. An external storage system like cloud object storage is a common choice because of its elasticity and scalability. To mitigate access latency to external storage, caching at a local filesystem is an essential technique. However, building local caches on scaling clusters must cope with explosive disk usage, redundant networking, and unexpected failures. We propose objcache, an elastic filesystem over external storage. Objcache introduces an internal transaction protocol over Raft logging to enable atomic updates of distributed persistent states with consistent hashing. The proposed transaction protocol can also manage inode dirtiness by maintaining the consistency between the local cache and external storage. Objcache supports scaling down to zero by automatically evicting dirty files to external storage. Our evaluation reports that objcache speeded up model serving startup by 98.9% compared to direct copies via S3 interfaces. Scaling up with dirty files completed from 2 to 14 seconds with 1024 dirty files.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-04", "journal": {"name": "ArXiv", "volume": "abs/2309.01399"}, "authors": [{"authorId": "2237804716", "name": "Takeshi Yoshimura"}, {"authorId": "32518736", "name": "Tatsuhiro Chiba"}, {"authorId": "2091372", "name": "Sunyanan Choochotkaew"}, {"authorId": "6011944", "name": "Seetharami R. Seelam"}, {"authorId": "2237803008", "name": "Hui-fang Wen"}, {"authorId": "3205436", "name": "Jonas Pfefferle"}], "citations": []}
