{"paperId": "50b1fe279fe57dd5e8a69acc75f7df7ef543e705", "publicationVenue": {"id": "658465d7-3c50-4d5d-b3ad-34b6fc978004", "name": "SAGE Open", "type": "journal", "issn": "2158-2440", "url": "https://journals.sagepub.com/home/sgoa", "alternate_urls": ["http://sgo.sagepub.com/", "http://sgo.sagepub.com/content/4/3/2158244014545971"]}, "title": "Online Health Information Wants of Caregivers for Persons With Dementia in Social Media", "abstract": "This study aimed to examine the online information behavior of informal caregivers of persons with dementia (PWDs). We examined caregivers’ posts ( N = 401) in two subgroups on the social media platform Reddit. Content analysis and correlational analysis techniques were used to analyze the data. Over half of caregivers (57%) posted health information for the purposes of both sharing and seeking information, whereas the remaining caregivers posted information for the purpose of sharing only. The three most commonly exchanged types of health information were information about psychosocial issues, daily care for a patient at home, and characteristics of dementia. The more types of health information that a post contained, the greater number of peers who participated in discussions. These findings show that caregivers use social media as a tool for health information support—to seek health information from other caregivers rather than rely on health care professionals or support groups.", "venue": "SAGE Open", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "SAGE Open"}, "authors": [{"authorId": "2260500078", "name": "Alison Y. Tang"}, {"authorId": "2260410927", "name": "Jung Kwak"}, {"authorId": "2110506407", "name": "Lu Xiao"}, {"authorId": "2077526566", "name": "Bo Xie"}, {"authorId": "1840828142", "name": "Sucheta Lahiri"}, {"authorId": "2260559026", "name": "Olivia Aiden Flynn"}, {"authorId": "2057056495", "name": "Abinav Murugadass"}], "citations": []}
