{"paperId": "50c3a856d1abae08a872ce3524571f29cb80abdd", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Current Research Trends in IoT Security: A Systematic Mapping Study", "abstract": ",e smart mobile Internet-of-things (IoT) network lays the foundation of the fourth industrial revolution, the era of hyperconnectivity, hyperintelligence, and hyperconvergence. As this revolution gains momentum, the security of smart mobile IoT networks becomes an essential research topic.,is study aimed to provide comprehensive insights on IoTsecurity. To this end, we conducted a systematic mapping study of the literature to identify evolving trends in IoTsecurity and determine research subjects. We reviewed the literature from January 2009 to August 2020 to identify influential researchers and trends of keywords. We additionally performed structural topic modeling to identify current research topics and the most promising ones via topic trend estimation. We synthesized and interpreted the results of the systematic mapping study to devise future research directions. ,e results obtained from this study are useful to understand current trends in IoT security and provide insights into research and development of IoT security.", "venue": "Mobile Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Mob. Inf. Syst.", "pages": "8847099:1-8847099:25", "volume": "2021"}, "authors": [{"authorId": "49685573", "name": "J. Lee"}, {"authorId": "48174157", "name": "Jungwoo Lee"}], "citations": [{"paperId": "735cd706059caf865af0beb357604db28e78c948", "title": "Performance evaluation of Raspberry Pi 4 and STM32 Nucleo boards for security-related operations in IoT environments"}, {"paperId": "f6090da86801c139994539a7fda449082d4661f1", "title": "Lightweight Secure and Scalable Scheme for Data Transmission in the Internet of Things"}, {"paperId": "69f2fdb4a84c1925006b22195a9cc0a29bf852dc", "title": "A Comprehensive Review of Beamforming-Based Speech Enhancement Techniques, IoT, and Smart City Applications"}, {"paperId": "74721f23f71a1cb946ce72476e6927a19679ae96", "title": "AIBPSF-IoMT: Artificial Intelligence and Blockchain-Based Predictive Security Framework for IoMT Technologies"}, {"paperId": "f3dcf809176622ca2484871009d0c05f896bb71f", "title": "Efficient Data Encryption and Signature Generation Scheme for Resource-Constrained IoT Environments"}, {"paperId": "f81c975feea882b1a64a2f4ba27756d3ed1f9b1f", "title": "Advances in IoT Security: Vulnerabilities, Enabled Criminal Services, Attacks, and Countermeasures"}, {"paperId": "ec8cf072bc4e63a77c4e37ac03288c62319237db", "title": "A new lightweight decentralized mitigation solution against Version Number Attacks for IoT Networks"}, {"paperId": "15b247ac01f51ada951b0b7726162be741357d94", "title": "Analytical review of existing techniques IoT based Home Automation and securing its data over Edge Computing using Machine Learning"}, {"paperId": "0fc55eb9b9a10dc7fe8d7e2135508a01d95a84f7", "title": "Security Issues in IoT: A Review"}, {"paperId": "0661aab56fc3fca393e596bed0bd607ce4053042", "title": "The Internet of Things Network Penetration Testing Model Using Attack Graph Analysis"}, {"paperId": "7b4d6155bc28283eb33ede80e98a34aa821ec9f5", "title": "Insights into security and privacy towards fog computing evolution"}, {"paperId": "be8a7e7fa8373afe77f58544f67fa7efb538f3ed", "title": "Home Automation and RFID-Based Internet of Things Security: Challenges and Issues"}, {"paperId": "d42c578084023d2e5beecd16b11845fd8cbb14d8", "title": "Monitoring System of Key Technical Features of Male Tennis Players Based on Internet of Things Security Technology"}, {"paperId": "f4a1157c4ff5dc0d6c10e7119c4a6bc378e27d6f", "title": "Collective Intelligence: Decentralized Learning for Android Malware Detection in IoT with Blockchain"}, {"paperId": "a845fe6c462e208751e68eba0eda0c4ab386cc75", "title": "A Study on Metaverse Hype for Sustainable Growth"}, {"paperId": "aec006d721db643ca87421a4a200ebcbcf970f61", "title": "Development of integrated sensor network for agro-meteorological data collection in Tanzania"}]}
