{"paperId": "50ca5987c81e74b98184fa2f5a1a7c1daf4de430", "publicationVenue": {"id": "ffaa4409-29fb-4245-a496-c51b151f9f5f", "name": "Journal of Pediatric Gastroenterology and Nutrition - JPGN", "type": "journal", "alternate_names": ["Journal of Pediatric Gastroenterology and Nutrition", "J Pediatr Gastroenterol Nutr  JPGN", "J Pediatr Gastroenterol Nutr"], "issn": "0277-2116", "url": "https://journals.lww.com/jpgn", "alternate_urls": ["https://journals.lww.com/jpgn/pages/default.aspx", "http://journals.lww.com/jpgn/pages/default.aspx", "http://www.jpgn.org/", "http://www.jpgn.org/pt/re/jpgn/home.htm;jsessionid=EISzx6oBlDPqmlz5660AlmryqXx1iPp7m9WNwVxcV9aRGjunUXAU!276062241!-949856144!9001!-1"]}, "title": "Immunological Profiling of Paediatric Inflammatory Bowel Disease Using Unsupervised Machine Learning.", "abstract": "OBJECTIVES\nThe current classification of inflammatory bowel disease (IBD) is based on clinical phenotypes, which is blind to the molecular basis of the disease. The aim of this study was to stratify a treatment naïve paediatric IBD cohort through specific innate immunity pathway profiling and application of unsupervised machine learning (UML).\n\n\nMETHODS\nIn order to test the molecular integrity of biological pathways implicated in IBD, innate immune responses were assessed at diagnosis in 22 paediatric patients and 10 age-matched controls. Peripheral blood mononuclear cells (PBMCs) were selectively stimulated for assessing the functionality of upstream activation receptors including NOD2, toll-like receptor (TLR) 1-2 and TLR4, and the downstream cytokine responses (IL-10, IL-1β, IL-6 & TNF-α) using multiplex assays. Cytokine data generated were subjected to hierarchical clustering to assess for patient stratification.\n\n\nRESULTS\nCombined immune responses in patients across twelve effector responses were significantly reduced compared to controls (p = 0.003) and driven primarily by 'hypofunctional' TLR responses (p values 0.045, 0.010 & 0.018 for TLR4-mediated IL-10, IL-1β & TNF-α respectively; 0.018 & 0.015 for TLR1-2 -mediated IL-10 & IL-1β). Hierarchical clustering generated three distinct clusters of patients and a fourth group of 'unclustered' individuals. No relationship was observed between the observed immune clusters and the clinical disease phenotype.\n\n\nCONCLUSIONS\nAlthough a clinically useful outcome was not observed through hierarchical clustering, our study provides a rationale for using an UML approach to stratify patients. The study also highlights the predominance of hypo-inflammatory innate immune responses as a key mechanism in the pathogenesis of IBD.", "venue": "Journal of Pediatric Gastroenterology and Nutrition - JPGN", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-03", "journal": {"name": "Journal of Pediatric Gastroenterology & Nutrition"}, "authors": [{"authorId": "39022278", "name": "T. Coelho"}, {"authorId": "11052882", "name": "E. Mossotto"}, {"authorId": "5088512", "name": "Yifang Gao"}, {"authorId": "4624381", "name": "Rachel Haggarty"}, {"authorId": "32335912", "name": "J. Ashton"}, {"authorId": "5943410", "name": "A. Batra"}, {"authorId": "122322954", "name": "I. Stafford"}, {"authorId": "1985422", "name": "R. M. Beattie"}, {"authorId": "2110114398", "name": "Anthony P. Williams"}, {"authorId": "2048528", "name": "S. Ennis"}], "citations": [{"paperId": "03677f8ab0f68219b48176155355890afa0295d1", "title": "Intestinal Inflammation and Regeneration–Interdigitating Processes Controlled by Dietary Lipids in Inflammatory Bowel Disease"}, {"paperId": "2c8837e7b702aa8c532df1bf1e3af12295c61e38", "title": "Gene Identification in Inflammatory Bowel Disease via a Machine Learning Approach"}, {"paperId": "428b2612703cc7ca121ed7bb5c1cb1035258c0ba", "title": "Toll-Like Receptor 7 a Novel Non-Invasive Inflammatory Genetic Sensor for Ulcerative Colitis Remission Monitoring"}, {"paperId": "90edee4739f8d0d0689fa87cbdec342724e74a5f", "title": "NOD2 in Crohn’s Disease—Unfinished Business"}, {"paperId": "5d2bc635f161730c6b1639bd397b6f4cb834f578", "title": "Evidence of a genetically driven metabolomic signature in actively inflamed Crohn’s disease"}, {"paperId": "7e80321ffdbad16fd298859ec042ad938aef9f00", "title": "A Systematic Review of Artificial Intelligence and Machine Learning Applications to Inflammatory Bowel Disease, with Practical Guidelines for Interpretation"}, {"paperId": "2ba0c038264aca3c308de1f3018fd6b2cc6db1c8", "title": "Integration of Artificial Intelligence And Multi-omics in Kidney Diseases"}, {"paperId": "1f960fbc912a49b47e892081cc7df2b174997abf", "title": "Deleterious Genetic Variation Across the NOD Signaling Pathway Is Associated With Reduced NFKB Signaling Transcription and Upregulation of Alternative Inflammatory Transcripts in Pediatric Inflammatory Bowel Disease"}, {"paperId": "08f7d942fee118de257acba94e1233ec65f4175c", "title": "Future of machine learning in paediatrics"}, {"paperId": "43f9b92fe309f0524221a4145853ae780bf4e1a3", "title": "Ileal Transcriptomic Analysis in Paediatric Crohn’s Disease Reveals IL17- and NOD-signalling Expression Signatures in Treatment-naïve Patients and Identifies Epithelial Cells Driving Differentially Expressed Genes"}]}
