{"paperId": "50f16f7c8f1715d04af19e4bc48dcc3a0becfb07", "publicationVenue": null, "title": "IMPLEMENTATION OF NEW HYBRID EVOLUTIONARY ALGORITHM WITH FUZZY LOGIC CONTROL APPROACH FOR OPTIMIZATION PROBLEMS (p. 6–14)", "abstract": "The main purpose of using the hybrid evolutionary algo-rithm is to reach optimal values and achieve goals that traditional methods cannot reach and because there are different evolutionary computations, each of them has different advantages and capabilities. Therefore, researchers integrate more than one algorithm into a hybrid form to increase the ability of these algorithms to perform evolutionary computation when working alone. In this paper, we propose a new algorithm for hybrid genetic algorithm (GA) and particle swarm optimization (PSO) with fuzzy logic control (FLC) approach for function optimization. Fuzzy logic is applied to switch dynamically between evolutionary algorithms, in an attempt to improve the algorithm performance. The HEF hybrid evolutionary algorithms are compared to GA, PSO, GAPSO, and PSOGA. The comparison uses a variety of measurement functions. In addition to strongly convex functions, these functions can be uniformly distributed or not, and are valuable for evaluating our approach. Iterations of 500, 1000, and 1500 were used for each function. The HEF algorithm’s efficiency was tested on four functions. The new algorithm is often the best solution, HEF accounted for 75 % of all the tests. This method is superior to conventional methods in terms of efficiency.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2147080491", "name": "Maan Afathi"}, {"authorId": "2287308086", "name": "Amaal Ghazi"}, {"authorId": "2287307627", "name": "Hamad Rafash"}, {"authorId": "2286907719", "name": "Enas Mohammed"}, {"authorId": "2287312426", "name": "Hussein Saeed"}, {"authorId": "2287273497", "name": "Al­Sharify Mushtaq Talib"}], "citations": []}
