{"paperId": "50f807a33bf836a8d6e80dfa2ed6ff63a41ec463", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Implementation of Scalable High Throughput Data Platform for Logging Semiconductor Testing Results", "abstract": "Unlike graded data of common semiconductor test results storing in relational databases, log data in the standard test data format (STDF) contain millions of test data entries. In a semiconductor packaging and testing factory, a semiconductor wafer or integrated circuit tests generate thousands of STDF files each day; therefore, how to store these massive databases is a crucial topic. Different products correspond to different test items and STDF content; if a relational database is used to store all forms of data, the practical operation becomes challenging. This paper used a NoSQL document-oriented database collocated with a Docker container to build a system, named the scalable STDF data (SSD) framework, for storing semiconductor test data. According to semiconductor test operations, the SSD framework first converts STDF files into an open standard format for data transmission and subsequently transfers them to the database. The use of NoSQL databases allows for flexibility of specifications of STDF content, and a Docker container exhibits features such as rapid deployment and high scalability. The SSD framework meets the requirements of semiconductor testing for throughput, latency, and parallel experimental projects; possesses excellent execution efficiency; and provides flexible data storage services in a semiconductor testing environment where processing a large quantity of data is required. From our simulation results, the major performance of the proposed system depends on the hardware properties. The higher hardware distribution degree provides better performance. Docker container provides more connections and the scalability of storage, but higher software distribution contributes limited performance enhancement.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-22", "journal": {"name": "IEEE Access", "pages": "26497-26506", "volume": "7"}, "authors": [{"authorId": "9094885", "name": "Chen-Kun Tsung"}, {"authorId": "37019835", "name": "H. Hsieh"}, {"authorId": "144373463", "name": "Chao-Tung Yang"}], "citations": [{"paperId": "76af469f8cbd0708a74c72d7325e96506c9f3b12", "title": "Implementation and visualization of a netflow log data lake system for cyberattack detection using distributed deep learning"}, {"paperId": "49d41fbd76aa55a7864c44bb969c148fead446ac", "title": "Designing the rule classification with oversampling approach with high accuracy for imbalanced data in semiconductor production lines"}, {"paperId": "1acc19878fb9f6b9f2ce398833d68f7291e1d8bf", "title": "Impact of the Validity Analysis Model and Multirelational Data Clustering Based on the Trust Probability"}, {"paperId": "a34863907a67e6fe1d6e27c2f932aa8be8cbcb53", "title": "Cyberattack detection model using deep learning in a network log system with data visualization"}, {"paperId": "49528a1a2b66ca4b42093a54ad415aa11cac90a8", "title": "Visualizing Potential Transportation Demand From ETC Log Analysis Using ELK Stack"}, {"paperId": "efcbb2a118613ee96551f9ffb95994e3eedbf141", "title": "iSEC: An Optimized Deep Learning Model for Image Classification on Edge Computing"}, {"paperId": "7aea18886a271fcd4f73522d563c91239338885f", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
