{"paperId": "50fdb8024f6155e19462d445491b5ee3dcd92fa3", "publicationVenue": {"id": "3b3de2d6-b889-4a6a-a93a-df4147cbcb4b", "name": "Student Conference on Research and Development", "type": "conference", "alternate_names": ["SCOReD", "Stud Conf Res Dev"]}, "title": "Optimal Scheduling of Plug-in Electric Vehicles Using Binary Gravitational Search Algorithm with A Suitable Decision Function", "abstract": "Plug-in electric vehicles (PEVs) have been receiving a high demand among the public since they were introduced due to their benefits from incentives to reduce greenhouse gas emissions. With a number of PEVs on the road, they can be managed to provide ancillary services to power grid and deal with the intermittent resources of renewable energy. This requires an optimization technique to properly schedule the PEV operations that connect to power grid to give minimum power losses. Suitable substations for PEVs either to charge or discharge and appropriate number of their involvement are identified. Binary gravity search algorithm (BGSA) is one of the used optimization technique to solve the non-linear and non-convex scheduling problem. However, a suitable decision function needs to be investigated to give better performance. This work investigates three different decision functions, namely tangent, sigmoid and round functions. A modified 34-node distribution test system is used to showcase the performance in solving the PEVs scheduling problem. The results show that sigmoid function is more suitable for BGSA as compared to the conventional tangent function in solving the PEVs scheduling problem. Power loss reduction can be achieved up to almost 14% when compare to the base case. As a conclusion, a suitable decision function gives better performance in solving an optimization problem.", "venue": "Student Conference on Research and Development", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-08", "journal": {"name": "2022 IEEE 20th Student Conference on Research and Development (SCOReD)", "pages": "96-100"}, "authors": [{"authorId": "2145128044", "name": "Ahmad Asrul Ibrahim"}, {"authorId": "2196220741", "name": "Shazreen Syuhada A. Wahid"}, {"authorId": "30683172", "name": "N. A. Mohamed Kamari"}, {"authorId": "30970567", "name": "Mohd Hairi Mohd Zaman"}, {"authorId": "2051231", "name": "M. A. Zulkifley"}], "citations": []}
