{"paperId": "50fe7e4dc97a576427030a997068f7f03ce80399", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Shared Blocks-Based Ensemble Deep Learning for Shallow Landslide Susceptibility Mapping", "abstract": "Natural disaster impact assessment is of the utmost significance for post-disaster recovery, environmental protection, and hazard mitigation plans. With their recent usage in landslide susceptibility mapping, deep learning (DL) architectures have proven their efficiency in many scientific studies. However, some restrictions, including insufficient model variance and limited generalization capabilities, have been reported in the literature. To overcome these restrictions, ensembling DL models has often been preferred as a practical solution. In this study, an ensemble DL architecture, based on shared blocks, was proposed to improve the prediction capability of individual DL models. For this purpose, three DL models, namely Convolutional Neural Network (CNN), Recurrent Neural Network (RNN), and Long Short-Term Memory (LSTM), together with their ensemble form (CNN–RNN–LSTM) were utilized to model landslide susceptibility in Trabzon province, Turkey. The proposed DL architecture produced the highest modeling performance of 0.93, followed by CNN (0.92), RNN (0.91), and LSTM (0.86). Findings proved that the proposed model excelled the performance of the DL models by up to 7% in terms of overall accuracy, which was also confirmed by the Wilcoxon signed-rank test. The area under curve analysis also showed a significant improvement (~4%) in susceptibility map accuracy by the proposed strategy.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-25", "journal": {"name": "Remote. Sens.", "pages": "4776", "volume": "13"}, "authors": [{"authorId": "1846145", "name": "T. Kavzoglu"}, {"authorId": "2142914065", "name": "A. Teke"}, {"authorId": "107931160", "name": "Elif Ozlem Yilmaz"}], "citations": [{"paperId": "1601858bb60cb5b83dc0be73efca8dc06b19221c", "title": "A novel landslide susceptibility prediction framework based on contrastive loss"}, {"paperId": "0c0f798e32cf325e347b3627c83d6a9b4397023c", "title": "Urban waterlogging susceptibility assessment based on hybrid ensemble machine learning models: A case study in the metropolitan area in Beijing, China"}, {"paperId": "f3c2ab90611a718898daf2254ae9e548f267a360", "title": "Marine mucilage mapping with explained deep learning model using water-related spectral indices: a case study of Dardanelles Strait, Turkey"}, {"paperId": "3f7ca8ac640a9a4370e305e7f1ff776c2af3d808", "title": "Investigation of Landslide Susceptibility Decision Mechanisms in Different Ensemble-Based Machine Learning Models with Various Types of Factor Data"}, {"paperId": "2624a160957239aa8290b3510b82f72d67aafd95", "title": "A Novel Heterogeneous Ensemble Framework Based on Machine Learning Models for Shallow Landslide Susceptibility Mapping"}, {"paperId": "1541ae1acd253b60da499f5de11ae77cdc3a5d18", "title": "Comparative Analysis of Deep Learning and Machine Learning Models for Burned Area Estimation Using Sentinel-2 Image: A Case Study in Muğla-Bodrum, Turkey"}, {"paperId": "bb0063cd0a48c8bdc1e7c7ba8aa7df5f007904e3", "title": "Landslide susceptibility mapping using support vector machine for Meghalaya, India"}, {"paperId": "e90e7667b26f05c64b3186c05357884d39e1b8d1", "title": "Machine learning based landslide susceptibility mapping models and GB-SAR based landslide deformation monitoring systems: Growth and evolution"}, {"paperId": "5404a732323745aa72ac9cd1becce8df11176122", "title": "Landslide Modeling in a Tropical Mountain Basin Using Machine Learning Algorithms and Shapley Additive Explanations"}, {"paperId": "c1e8444c87f5a705f5cc30ef9d41ddfd3fa42cd2", "title": "Predicting and analyzing flood susceptibility using boosting-based ensemble machine learning algorithms with SHapley Additive exPlanations"}, {"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network"}, {"paperId": "fbba042db286b3d4c1ae4e2b8f13881b16b0b2bc", "title": "Performance Evaluation of Depthwise Separable CNN and Random Forest Algorithms for Landslide Susceptibility Prediction"}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "6ec5e9267a4a55529086394dfb21db79a0a370bc", "title": "Advanced hyperparameter optimization for improved spatial prediction of shallow landslides using extreme gradient boosting (XGBoost)"}, {"paperId": "84eaa4d05f75f22da2de9e033bfe2d06fbe18c99", "title": "Machine learning based wildfire susceptibility mapping using remotely sensed fire data and GIS: A case study of Adana and Mersin provinces, Turkey"}, {"paperId": "2c32961d902c6f8ed9814df2e593ccd861b281f5", "title": "Predictive Performances of Ensemble Machine Learning Algorithms in Landslide Susceptibility Mapping Using Random Forest, Extreme Gradient Boosting (XGBoost) and Natural Gradient Boosting (NGBoost)"}, {"paperId": "1fc53189344c11e4bd9e17e0b55feb2244db578f", "title": "A GIS-Based Landslide Susceptibility Mapping and Variable Importance Analysis Using Artificial Intelligent Training-Based Methods"}, {"paperId": "d447b0e9be5441c7c69125fd3f7aff53956a3fb9", "title": "Analysis of patch and sample size effects for 2D-3D CNN models using multiplatform dataset: hyperspectral image classification of ROSIS and Jilin-1 GP01 imagery"}, {"paperId": "fb9e01f0c25967a43d842e64e91b1d4a7a27c068", "title": "LAND COVER CLASSIFICATION PERFORMANCE OF MULTISPECTRAL RTK UAVs"}, {"paperId": "e0309c6a730b1481c24da9f963e9ccbeeb3ac98b", "title": "A Sustainable Approach to Geomatic Methods in Ravine Monitoring and Associated Natural Disaster Prevention"}, {"paperId": "b88ee11a402d4a3bc23468d83a9f52c1233ac354", "title": "SPATIALLY AWARE LANDSLIDE SUSCEPTIBILITY PREDICTION USING A GEOGRAPHICAL RANDOM FOREST APPROACH"}]}
