{"paperId": "5102e0a71e9d41fb5876ca5c6f396558c08a6f55", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Earthquake-Induced Landslide Susceptibility Assessment Using a Novel Model Based on Gradient Boosting Machine Learning and Class Balancing Methods", "abstract": "Predicting the susceptibility of a specific part of a landslide (SSPL) involves predicting the likelihood that the part of the landslide (e.g., the entire landslide, the source area, or the scarp) will form in a given area. When predicting SSPL, the landslide samples are far less than the non-landslide samples. This class imbalance makes it difficult to predict the SSPL. This paper proposes an advanced artificial intelligence (AI) model based on the dice-cross entropy (DCE) loss function and XGBoost (XGBDCE) or Light Gradient Boosting Machine (LGBDCE) to ameliorate the class imbalance in the SSPL prediction. We select the earthquake-induced landslides from the 2018 Hokkaido earthquake as a case study to evaluate our proposed method. First, six different datasets with 24 landslide influencing factors and 10,422 samples of a specific part of the landslides are established using remote sensing and geographic information system technologies. Then, based on each of the six datasets, four landslide susceptibility algorithms (XGB, LGB, random-forest (RF) and linear discriminant analysis (LDA)) and four class balancing methods (non-balance (NB), equal-quantity sampling (EQS), inverse landslide-frequency weighting (ILW), and DCE loss) are applied to predict the SSPL. The results show that the non-balanced method underestimates landslide susceptibility, and the ILW or EQS methods overestimate the landslide susceptibility, while the DCE loss method produces more balanced results. The prediction performance of the XGBDCE (average area under the receiver operating characteristic curve (0.970) surpasses that of RF (0.956), LGB (0.962), and LDA (0.921). Our proposed methods produce more unbiased and precise results than the existing models, and have a great potential to produce accurate general (e.g., predicting the entire landslide) and detailed (e.g., combining the prediction of the landslide source area with the landslide run-out modeling) landslide susceptibility assessments, which can be further applied to landslide hazard and risk assessments.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-24", "journal": {"name": "Remote. Sens.", "pages": "5945", "volume": "14"}, "authors": [{"authorId": "47180541", "name": "Shuhao Zhang"}, {"authorId": "2145195127", "name": "Yawei Wang"}, {"authorId": "2192290728", "name": "Guang Wu"}], "citations": [{"paperId": "a770dbdeb95652103a023fe8e201f464f86c4721", "title": "Analysis of landslide susceptibility prediction accuracy with an event-based inventory: The 6 February 2023 Turkiye earthquakes"}, {"paperId": "598e64ef409ddb47484b33ff5ac39b27af128cf6", "title": "Evaluating the Impact of Seismic Activity on the Slope Stability of the Western Coast of Lefkada Island Using Remote Sensing Techniques, Geographical Information Systems, and Field Data"}, {"paperId": "d91e6dd27dfbde55309fa6dec6e208566bf41225", "title": "Rapid Landslide Extraction from High-Resolution Remote Sensing Images Using SHAP-OPT-XGBoost"}, {"paperId": "bd56d4bda9d9b36f1a57fe024fae99a237e691cd", "title": "Performance comparison of landslide susceptibility mapping under multiple machine-learning based models considering InSAR deformation: a case study of the upper Jinsha River"}, {"paperId": "0b739ab4b04f4f526da7aff530654875ed10d5cd", "title": "Evaluating Landslide Susceptibility Using Sampling Methodology and Multiple Machine Learning Models"}, {"paperId": "aa6367105ab48208426bf775017773acd726230b", "title": "GIS-Based Landslide Susceptibility Modeling: A Comparison between Best-First Decision Tree and Its Two Ensembles (BagBFT and RFBFT)"}, {"paperId": "989527387bbde54cdddf29858db741221e356c82", "title": "Addressing Class Imbalance in Soil Movement Predictions"}]}
