{"paperId": "5116937ac375e1241775bdf2949eca54369c1a10", "publicationVenue": null, "title": "Issues and Future Trends in IoT Security using Blockchain: A Review", "abstract": "Internet of Things (IoT) is a future internet or amendment to existing internet with surrounding things as part of a network generally defines as networked smart things, where every physical \"thing\" or \"node\" is embedded with a digital element and working in a network. Each node in IoT monitor and senses the surrounding environment to collect the data and transfer it to the application layer to derive intelligence. The level of efficiency, automation, and comfort for human life will increase through existing IoT and future IoT opportunities. To effectively implement IoT with a rapid increase in IoT applications demands privacy, promising security, and authentication for all entire transactions in the network, and the system should be able to recover from any kind of attack. This study has presented a detailed review of IoT, layer base IoT architecture, and different threats for each layer of IoT along with all possible security and privacy risks for IoT along with existing solutions with the help of blockchain. The recent emerging technology, blockchain is a transparent, trusted, and decentralized P2P network with core properties of immutability, security, and integrity. The IoT can achieve better security with blockchain integration but need to address various challenges. This paper also presented various possible IoT and Blockchain integration for promising security and privacy.", "venue": "2023 International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-01-05", "journal": {"name": "2023 International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "pages": "976-984"}, "authors": [{"authorId": "2155294983", "name": "Sumita Kumar"}, {"authorId": "2260832", "name": "A. Vidhate"}], "citations": [{"paperId": "9e45f94e6d82e0cf02de4afc56d4540945fe8e8c", "title": "A Bitcoin-based Secure Outsourcing Scheme for Optimization Problem in Multimedia Internet of Things"}, {"paperId": "2c0247ebf988b92c3a9a666cb2813e2463662ec2", "title": "MQTT and blockchain sharding: An approach to user-controlled data access with improved security and efficiency"}, {"paperId": "81f66b743246c8b197fbcb0c810dea8e8c4b2f3f", "title": "Blockchain-Powered Solution to Safeguard IoT Devices Against Attacks"}, {"paperId": "16ecd3b4050fc075f5701fe5c2cc9d3c73789bd9", "title": "Blockchain-Based Authorization Mechanism for Educational Social Internet of Things"}]}
