{"paperId": "51235fd5d4f18685f75be4aaa028db516af606c1", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Bio-Inspired Method for Mathematical Optimization Inspired by Arachnida Salticidade", "abstract": "This paper proposes a new meta-heuristic called Jumping Spider Optimization Algorithm (JSOA), inspired by Arachnida Salticidae hunting habits. The proposed algorithm mimics the behavior of spiders in nature and mathematically models its hunting strategies: search, persecution, and jumping skills to get the prey. These strategies provide a fine balance between exploitation and exploration over the solution search space and solve global optimization problems. JSOA is tested with 20 well-known testbench mathematical problems taken from the literature. Further studies include the tuning of a Proportional-Integral-Derivative (PID) controller, the Selective harmonic elimination problem, and a few real-world single objective bound-constrained numerical optimization problems taken from CEC 2020. Additionally, the JSOA’s performance is tested against several well-known bio-inspired algorithms taken from the literature. The statistical results show that the proposed algorithm outperforms recent literature algorithms and is capable to solve challenging real-world problems with unknown search space.", "venue": "Mathematics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-29", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "1411510888", "name": "H. Peraza-Vázquez"}, {"authorId": "1484226135", "name": "A. Peña-Delgado"}, {"authorId": "10787308", "name": "Prakash Ranjan"}, {"authorId": "40182948", "name": "Chetan Barde"}, {"authorId": "38640065", "name": "A. Choubey"}, {"authorId": "1403776674", "name": "A. Morales‐Cepeda"}], "citations": [{"paperId": "fbf7aa2fca70809d02c658e412ce888f4fc4ad94", "title": "Optimized models and deep learning methods for drug response prediction in cancer treatments: a review"}, {"paperId": "2052eb61b95df492abf1ee82f0e38322c1682544", "title": "Augmented weighted K-means grey wolf optimizer: An enhanced metaheuristic algorithm for data clustering problems"}, {"paperId": "fba5916521a28c49e9ac7ca4ba462edf69630859", "title": "Optimization of a three-stage cascade refrigeration system operating with natural refrigerants to produce low temperatures by applying a bio-inspired method"}, {"paperId": "8f0b0fed1a2f4197d5c72274ad4111c82ccbd8e0", "title": "Optimisation of a Cascade Refrigeration System with Natural Refrigerants, Based on Nature-Inspired Algorithms"}, {"paperId": "cc45b326342b68d043a215e44d33521e80e085ac", "title": "A novel metaheuristic inspired by horned lizard defense tactics"}, {"paperId": "7b4eb15cce72ad4119890fb7a54b6b77c7c83893", "title": "A new denoising method based on decomposition mixing of hydro-acoustic signal"}, {"paperId": "d0b1176100337293e0a040884a80d578a425a627", "title": "A Contemporary Systematic Review on Meta-heuristic Optimization Algorithms with Their MATLAB and Python Code Reference"}, {"paperId": "96d0a8840465fcd03a7347e91d3ecb57b6fb759b", "title": "Improved dwarf mongoose optimization algorithm using novel nonlinear control and exploration strategies"}, {"paperId": "67190bdf75da045bf7a5ffc9c89c5af9b737a8e3", "title": "Optimum design of slot and magnet structure of permanent magnet synchronous generator with teaching‐learning‐studying‐based optimization"}, {"paperId": "9aabd3076f4077d23f9a308e3d5461c51d3d614c", "title": "Application of Opposition-Based Learning Jumping Spider Optimization Algorithm in Gas Turbine Coupled Cooling System"}, {"paperId": "0804ece5b3b569dae74c3590e1a7c59cf1a8d07b", "title": "Metaheuristic optimization algorithms: a comprehensive overview and classification of benchmark test functions"}, {"paperId": "fe97d2255d1249c0b57f6af783a02c849f0e7539", "title": "A road map of jumping spider behavior"}, {"paperId": "f66a0504b42c54caf111d563479eb1739d6b5847", "title": "A novel global FPPT strategy for PV system under partial shading condition"}, {"paperId": "85fba992c517ea57e446c250144d80294458e0fe", "title": "A nonlinear African vulture optimization algorithm combining Henon chaotic mapping theory and reverse learning competition strategy"}, {"paperId": "693eb5c5c285109a258d078cbca7c8876bf39b2c", "title": "Speaker Recognition Based on Dung Beetle Optimized CNN"}, {"paperId": "b93139d9fa03590f076439268655bfb0d256172e", "title": "A Theory of Intelligences: Concepts, Models, Implications"}, {"paperId": "b594c5dc9f0583f49356f33ef36f13bcce255b0b", "title": "Dujiangyan irrigation system optimization (DISO): A novel metaheuristic algorithm for dam safety monitoring"}, {"paperId": "eefc911508319c0a539a2a3cd570f5b22b07207c", "title": "Internet of Things Energy Consumption Optimization in Buildings: A Step toward Sustainability"}, {"paperId": "caa774f4b3860a423d5a0496f60220f04009d42f", "title": "Investigation of Recent Metaheuristics Based Selective Harmonic Elimination Problem for Different Levels of Multilevel Inverters"}, {"paperId": "16093029068018e9b48f006a37311241f2cee049", "title": "Design of Gas Turbine Cooling System Based on Improved Jumping Spider Optimization Algorithm"}, {"paperId": "7fba0c9cfcf0e7cf6677808f059811cf31b4f8f0", "title": "Metaheuristics based tuning of robust PID controllers for controlling voltage and current on photonics and optics"}, {"paperId": "10659e044ddad44f9f5d1c6fd016a5345e49985f", "title": "Electrical parameter computation of various photovoltaic models using an enhanced jumping spider optimization with chaotic drifts"}, {"paperId": "75e311d0d00899681e83dc68bdc17e8fa14ab432", "title": "An Improved Dingo Optimization Algorithm Applied to SHE-PWM Modulation Strategy"}, {"paperId": "40dac823e3805c60d5959b0d603f063124582922", "title": "A Novel Approach for Mitigating Power Quality Issues in a PV Integrated Microgrid System Using an Improved Jelly Fish Algorithm"}, {"paperId": "a00b9b6a46e2e0e692ad53c77ae61328b7ca92a9", "title": "RUL Prediction of Lithium-Ion Battery in Early-Cycle Stage Based on Similar Sample Fusion Under Lebesgue Sampling Framework"}, {"paperId": "024039e063308b4c7168cf5f615ceb6289c1fc57", "title": "Design of Evolutionary Algorithm Based Unequal Clustering for Energy Aware Wireless Sensor Networks"}, {"paperId": "16547790add30c5426019a291c95458c2d0ef100", "title": "Nature Inspired Approach Toward Elimination of Nonlinearities in SWIPT Enabled Energy Harvesting Networks"}]}
