{"paperId": "512f8813e39b7c008e5c78858da5a1ec90126dbc", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "Occupancy Prediction at Transit Stops Using ANN", "abstract": "Crowding in public transport is a known problem that negatively affects passengers' travel experience as well as degrades the performance of public transport. It may occur at the station entrance, at the stop, in-vehicle, and platforms. The present study focuses on stop-level occupancy prediction, which can be further used for crowding estimation. At first, boarding stops are inferred using timestamps of the electronic ticketing machine (ETM) data and validated using automated vehicle location (AVL) data. Further, alighting stops are inferred using a combination of explanatory variables, such as point of interest data, population density, green area, industrial area, and residential areas. The t-distributed Stochastic Neighbourhood Embedding algorithm is used to reduce the dimensionality for alighting inferences. The stop occupancy is then predicted using an artificial neural network (ANN) model. A case study of Delhi, India, is presented, and four months of ticketing data are used to demonstrate the performance of the proposed prediction model. A network-level analysis is performed to identify the critical stons.", "venue": "International Conference on Communication Systems and Networks", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-03", "journal": {"name": "2024 16th International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "825-832"}, "authors": [{"authorId": "2284345668", "name": "Jatin Bhandari"}, {"authorId": "2167013274", "name": "Rupam R. Fedujwar"}, {"authorId": "2284349967", "name": "Amit Agarwal"}], "citations": []}
