{"paperId": "513df95e423edfde87469322b6ef968df7e452a6", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Multihop Uplink Communication Approach Based on Layer Clustering in LoRa Networks for Emerging IoT Applications", "abstract": "LoRa technology is widely used in the Internet of things network applications. It enables low-volume data transmission via small wireless devices. The principle of LoRa networks (an LPWAN technology: Low Power Wide Area Network) is to transmit data by air from sensors with a short transmission range, about over ten kilometers. These sensors should not be powered by electricity, and batteries power them. Hospital visits are inevitable, but current advances in communication could reduce the burden on hospitals with remote (from home) treatments using these wireless sensors. Thus, using the LoRaWAN protocol could greatly facilitate patient diagnosis by transmitting data between doctors and patients in real time and with minimal energy consumption. The objective of this work is to set up a multihop IoT network containing a large number of sensors based on LoRa for uplink communication. This work evaluates the energy consumption and the packet delivery rate in the multihop IoT network. The simulation result shows that the proposed approach reduces power consumption by 50% and improves the packet delivery rate by 2% compared to the existing state of the art.", "venue": "Mobile Information Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-20", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "3335374", "name": "A. Bomgni"}, {"authorId": "1985881", "name": "H. M. Ali"}, {"authorId": "2065563657", "name": "Mohammed Shuaib"}, {"authorId": "2218158535", "name": "Yann Mtopi Chebu"}], "citations": [{"paperId": "e187cf6986df3d0d8064fb2e854301cb1a85f646", "title": "Real-Time Remote Patient Monitoring: A Review of Biosensors Integrated with Multi-Hop IoT Systems via Cloud Connectivity"}, {"paperId": "3b70d57dbd51da67b0fd4dd0fbcdd42ab1ade4bf", "title": "PEFTOSPRO: A Power-Efficient and Fault-Tolerant Scheme for Permutation Routing in Multi-hop Wireless Sensor Networks"}, {"paperId": "50783a530630ad4ac9189b0f60018d64aa343f0f", "title": "Monitoring DC Motor Based On LoRa and IOT"}, {"paperId": "c5938e24b16bb6ce8b965f51d73cdf96aae46eb0", "title": "Load Balancing Using Artificial Intelligence for Cloud-Enabled Internet of Everything in Healthcare Domain"}]}
