{"paperId": "515b12924f0978b634be87aaca3c3c97f87b0e19", "publicationVenue": null, "title": "BLMDP: A new bi-level Markov decision process approach to joint bidding andtask-scheduling in cloud spot market", "abstract": ": In the cloud computing market (CCM), computing services are traded between cloud providers and consumers in the form of the computing capacity of virtual machines (VMs). The Amazon spot market is one of the most well-known markets in which the surplus capacity of data centers is auctioned off in the form of VMs at relatively low prices. For each submitted task, the user can offer a price that is higher than the current price. However, uncertainty in the market environment confronts the user with challenges such as the variable price of VMs and the variable number of users. An appropriate strategy should both maximize the user’s utility and determine the best bid for him/her. In this paper, we aim to solve the problem of joint minimizing the cost of processing tasks and maximizing user satisfaction. Our proposed method, which we call bi-level Markov decision-making process (BLMDP), works on two levels. At the top level, it selects the most appropriate user bids and adjusts the spot price to minimize the cost of VMs on the cloud provider side. At a low level, it decides to admit tasks in such a way as to maximize the user side satisfaction. Performance evaluation based on real data collected from Amazon web services shows that BLMDP manages to minimize cloud provider’s costs and maximize user gain more effectively compared to heuristic methods", "venue": "Turkish J. Electr. Eng. Comput. Sci.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Turkish J. Electr. Eng. Comput. Sci.", "pages": "1419-1438", "volume": "30"}, "authors": [{"authorId": "2148304863", "name": "Mona Naghdehforoushha"}, {"authorId": "40637010", "name": "M. Fooladi"}, {"authorId": "3261506", "name": "Mohammad Hossein Rezvani"}, {"authorId": "2052806358", "name": "M. Sadeghi"}], "citations": [{"paperId": "6b67f604b8a53d3ea947e48b4825ec30b16eca67", "title": "Machine learning methods for service placement: a systematic review"}, {"paperId": "415a903cd04746acbe8f740f2d329f6a29cb5b20", "title": "Adaptive recursive system identification using optimally tuned Kalman filter by the metaheuristic algorithm"}, {"paperId": "d49d0c968c8b6a124d97041cc17ebc447d452af1", "title": "An efficient cloud resource exchange model based on the double auction and evolutionary game theory"}, {"paperId": "fb5e2eca7ec1537d438f652b1079aab04d6b4221", "title": "Reinforcement Learning Methods for Computation Offloading: A Systematic Review"}, {"paperId": "382f723a0736982571f9c8a7a03c878433d671b5", "title": "A robust model for spot virtual machine bidding in the cloud market using information gap decision theory (IGDT)"}, {"paperId": "6cdd88d006ba1fc82e07bca41d8ef3f2f4394fd7", "title": "Joint optimization of delay and energy in partial offloading using Dual-population replicator dynamics"}, {"paperId": "aecb4b4cefa65611f584ba8ad8aa07cd79a3bc71", "title": "Early Intrusion Detection System using honeypot for industrial control networks"}, {"paperId": "d61ef46cffedb0bf18bdffb156a761dbfe6f1275", "title": "A bartering double auction resource allocation model in cloud environments"}, {"paperId": "6154c5bd2032e50ffa476b130d07aa7f3c091ca7", "title": "Energy-aware and carbon-efficient VM placement optimization in cloud datacenters using evolutionary computing methods"}, {"paperId": "462fd5471daefc435d0a50431f48faaf533976f1", "title": "Collaborative Optimization Allocation of Grid-Forming and Grid-Following Reactive Power Resources Considering Auxiliary Equipment Services"}, {"paperId": "e0bfd4f8f9cf89f59e4b1561e37b776eec2128f3", "title": "Reinforcement Learning Methods for Computing Offloading: A Systematic Review"}]}
