{"paperId": "51748b9309a9834d8f22f018490283cb2afefa87", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Modelling and Prediction of Resource Utilization of Hadoop Clusters: A Machine Learning Approach", "abstract": "Hadoop is a distributed computing framework that has a large number of configurable parameters. These parameters have impact on system resources and execution time. Optimizing the performance of a Hadoop cluster by tuning such a large number of parameters is a tedious task. Most current big data modeling approaches does not include complex interaction between configuration parameters and the cluster environment changes such as different datasets or query. This makes it difficult to predict the performance or resource utilization of a cluster when we use real-world datasets because of their size and content. This paper presents the modeling of resource utilization of Hadoop cluster on the basis of Hadoop configuration parameters and dataset structure. Our approach builds a machine learning based-model using Hive-based Hadoop query and then predict the outcome for a particular parameter setting and query type. We used decision trees to build models for each of our performance metric measures. Decision rules were extracted from these tree-based models and evaluated for their ability to generalize to unseen data. Our experiments predicted that the percentage of columns selected, mappers and replica has a statistically significant impact over the utilization of different resources in Hadoop cluster.", "venue": "International Conference on Utility and Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-12-02", "journal": {"name": "Proceedings of the 12th IEEE/ACM International Conference on Utility and Cloud Computing"}, "authors": [{"authorId": "8970664", "name": "H. Tariq"}, {"authorId": "1403017303", "name": "Harith Al-Sahaf"}, {"authorId": "144921827", "name": "I. Welch"}], "citations": [{"paperId": "5bb9a93d8d1c5c0a59ff029f09efc1ab2538f32d", "title": "The Design Space of Emergent Scheduling for Distributed Execution Frameworks"}, {"paperId": "188d44b7ee3886edefcaf9f25f96ba62088f2c28", "title": "A Survey: Benchmarking and Performance Modelling of Data Intensive Applications"}, {"paperId": "3f7b78111d3a670deb07a2028a4f3d589287dca6", "title": "Modeling of Distributed Ledgers: Challenges and Future Perspectives"}, {"paperId": "c87afdea67e06f77190d8ea0265b4c61af5631cf", "title": "Blockchain Evaluation Approaches: State-of-the-Art and Future Perspective"}, {"paperId": "7cbb04e8af6b7c5507bc83f511ef46321aa32235", "title": "Big Data Technologies with Computational Model Computing Using Hadoop with Scheduling Challenges"}, {"paperId": "596df5b0aded6d8773d81f1eec67d4da93d33f2a", "title": "Fundamentals of Wireless Sensor Networks Using Machine Learning Approaches"}]}
