{"paperId": "51919fa9672ee0a40077e8a2e57d59f66f690efd", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Machine Learning Approaches to Predict Electricity Production from Renewable Energy Sources", "abstract": "Bearing in mind European Green Deal assumptions regarding a significant reduction of green house emissions, electricity generation from Renewable Energy Sources (RES) is more and more important nowadays. Besides this, accurate and reliable electricity generation forecasts from RES are needed for capacity planning, scheduling, managing inertia and frequency response during contingency events. The recent three years have proved that Machine Learning (ML) models are a promising solution for forecasting electricity generation from RES. In this review, the 8-step methodology was used to find and analyze 262 relevant research articles from the Scopus database. Statistic analysis based on eight criteria (ML method used, renewable energy source involved, affiliation location, hybrid model proposed, short term prediction, author name, number of citations, and journal title) was shown. The results indicate that (1) Extreme Learning Machine and ensemble methods were the most popular methods used for electricity generation forecasting from RES in the last three years (2020–2022), (2) most of the research was carried out for wind systems, (3) the hybrid models accounted for about a third of the analyzed works, (4) most of the articles concerned short-term models, (5) the most researchers came from China, (6) and the journal which published the most papers in the analyzed field was Energies. Moreover, strengths, weaknesses, opportunities, and threats for the analyzed ML forecasting models were identified and presented in this paper.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-02", "journal": {"name": "Energies"}, "authors": [{"authorId": "2134270", "name": "Adam Krechowicz"}, {"authorId": "101969210", "name": "Maria Krechowicz"}, {"authorId": "2053625", "name": "Katarzyna Poczeta"}], "citations": [{"paperId": "353b731a2702fddc3817d0e39b90e378f2c005a2", "title": "Experimental study on the performance of a heat recovery exchanger filled with gypsum and gravel"}, {"paperId": "5a5b2354ef6cb004fdc1473b8f1188a0c8fbe250", "title": "Recent applications of AI to environmental disciplines: A review."}, {"paperId": "70e42fe77dc0c461e659730ce0a1a41b42f4930b", "title": "Comparison and Enhancement of Machine Learning Algorithms for Wind Turbine Output Prediction with Insufficient Data"}, {"paperId": "1faa5f41a140437be031958976f8357f612ba8e2", "title": "Comparison of machine learning and statistical methods in the field of renewable energy power generation forecasting: a mini review"}, {"paperId": "757e299668fd5df3b32607f7bd592cd1e5804450", "title": "Forecasting Renewable Energy Generation with Machine Learning and Deep Learning: Current Advances and Future Prospects"}, {"paperId": "c2d4048b4b51e08853f2d252bfdd4c3b70d85a1a", "title": "Machine learning for prognostics and health management of industrial mechanical systems and equipment: A systematic literature review"}]}
