{"paperId": "51a3e715046f3a4528eb84ceb3a77c1a3d21d686", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Real-World Community-in-the-Loop Smart Video Surveillance - A Case Study at a Community College", "abstract": "Smart Video surveillance systems have become important recently for ensuring public safety and security, especially in smart cities. However, applying real-time artificial intelligence technologies combined with low-latency notification and alarming has made deploying these systems quite challenging. This paper presents a case study for designing and deploying smart video surveillance systems based on a real-world testbed at a community college. We primarily focus on a smart camera-based system that can identify suspicious/abnormal activities and alert the stakeholders and residents immediately. The paper highlights and addresses different algorithmic and system design challenges to guarantee real-time high-accuracy video analytics processing in the testbed. It also presents an example of cloud system infrastructure and a mobile application for real-time notification to keep students, faculty/staff, and responsible security personnel in the loop. At the same time, it covers the design decision to maintain communities' privacy and ethical requirements as well as hardware configuration and setups. We evaluate the system's performance using throughput and end-to-end latency. The experiment results show that, on average, our system's end-to-end latency to notify the end users in case of detecting suspicious objects is 5.3, 5.78, and 11.11 seconds when running 1, 4, and 8 cameras, respectively. On the other hand, in case of detecting anomalous behaviors, the system could notify the end users with 7.3, 7.63, and 20.78 seconds average latency. These results demonstrate that the system effectively detects and notifies abnormal behaviors and suspicious objects to the end users within a reasonable period. The system can run eight cameras simultaneously at a 32.41 Frame Per Second (FPS) rate.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-22", "journal": {"name": "ArXiv", "volume": "abs/2303.12934"}, "authors": [{"authorId": "2067825538", "name": "S. Yao"}, {"authorId": "77199419", "name": "B. R. Ardabili"}, {"authorId": "2152020939", "name": "Armin Danesh Pazho"}, {"authorId": "2152021044", "name": "Ghazal Alinezhad Noghre"}, {"authorId": "2059566339", "name": "Christopher Neff"}, {"authorId": "2163459201", "name": "Hamed Tabkhi"}], "citations": [{"paperId": "47602e03af93e307acceea2a71bf937bbad8bd31", "title": "Real-World Community-in-the-Loop Smart Video Surveillance System"}]}
