{"paperId": "51ac10661dac036e45dba3d6b737f55dd6b44a9c", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Slope stability prediction based on adaptive CE factor quantum behaved particle swarm optimization-least-square support vector machine", "abstract": "Since the prediction of slope stability is affected by the combination of geological and engineering factors with uncertainties such as randomness, vagueness and variability, the traditional qualitative and quantitative analysis cannot match the recent requirements to judge them accurately. In this study, we expect that the adaptive CE factor quantum behaved particle swarm optimization (ACE-QPSO) and least-square support vector machine (LSSVM) can improve the prediction accuracy of slope stability. To ensure the global search capability of the algorithm, we introduced three classical benchmark functions to test the performance of ACE-QPSO, quantum behaved particle swarm optimization (QPSO), and the adaptive dynamic inertia weight particle swarm optimization (IPSO). The results show that the ACE-QPSO algorithm has a better global search capability. In order to evaluate the stability of the slope, we followed the actual project and research literature and selected the unit weight, slope angle, height, internal cohesion, internal friction angle and pore water pressure as the main indicators. To determine whether the algorithm is scientifically and practically feasible for slope deformation prediction, the ACE-QPSO-, QPSO-, IPSO-LSSVM and single least-square support vector machine algorithms were trained and tested based on a real case of slope project with six index factors as the input layer of the LSSVM model and the safety factor as the output layer of the model. The results show that the ACE-QPSO-LSSVM algorithm has a better model fit (R 2=0.8030), minor prediction error (mean absolute error=0.0825, mean square error=0.0110) and faster convergence (second iteration), which support that the ACE-QPSO-LSSVM algorithm emthod is more feasible and efficient in predicting slope stability.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-08", "journal": {"volume": "11"}, "authors": [{"authorId": "2121268839", "name": "Jingsheng Yang"}], "citations": [{"paperId": "71443dbac2ce5c3ba42371c25dd5823e324d2064", "title": "Comparison of machine learning algorithms for slope stability prediction using an automated machine learning approach"}]}
