{"paperId": "51d1f96f920d4e7a6f1666de401c3a74a45cded9", "publicationVenue": {"id": "e1fe9a1d-d67b-4f64-a192-472091321f8e", "name": "Journal of Applied Remote Sensing", "type": "journal", "alternate_names": ["J Appl Remote Sens"], "issn": "1931-3195", "url": "https://www.spiedigitallibrary.org/journals/journal-of-applied-remote-sensing", "alternate_urls": ["http://remotesensing.spiedigitallibrary.org/journal.aspx"]}, "title": "Hyperspectral change detection based on modification of UNet neural networks", "abstract": "Abstract. The Earth’s surface changes continuously due to several natural and humanmade factors. Efficient change detection (CD) is useful in monitoring and managing different situations. The recent rise in launched hyperspectral platforms provides a diversity of spectrum in addition to the spatial resolution required to meet recent civil applications requirements. Traditional multispectral CD algorithms hardly cope with the complex nature of hyperspectral images and their high dimensionality. To overcome these limitations, a CD deep convolutional neural network (CNN) semantic segmentation-based workflow was proposed. The proposed workflow is composed of four main stages, namely preprocessing, training, testing, and evaluation. Initially, preprocessing is performed to overcome hyperspectral image noise and the high dimensionality problem. Random oversampling (ROS), deep learning, and bagging ensemble were incorporated to handle imbalanced dataset. Also, we evaluated the generality and performance of the original UNet model and four variants of UNet, namely residual UNet, residual recurrent UNet, attention UNet, and attention residual recurrent UNet. Three hyperspectral CD datasets were employed in performance assessment for binary and multiclass change cases; all datasets suffer from class imbalance and small region of interest size. Recurrent residual UNet presented the best performance in both accuracy and inference time. Overall, the obtained results imply that deep CNN segmentation models can be utilized to implement efficient CD for hyperspectral imageries.", "venue": "Journal of Applied Remote Sensing", "year": 2021, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2021-04-01", "journal": {"name": "Journal of Applied Remote Sensing", "pages": "028505 - 028505", "volume": "15"}, "authors": [{"authorId": "144179502", "name": "M. S. Moustafa"}, {"authorId": "145712229", "name": "S. A. Mohamed"}, {"authorId": "2191717101", "name": "Sayed Ahmed"}, {"authorId": "38900883", "name": "A. Nasr"}], "citations": [{"paperId": "ba53584957240ff3ec0feda050f0b185b3b782c0", "title": "Hypothesis testing of one sample mean vector in distributed frameworks"}, {"paperId": "2e6258dc1915220ebebbee9655929de5f3a006e2", "title": "A Deep Learning Based Platform for Remote Sensing Images Change Detection Integrating Crowdsourcing and Active Learning"}, {"paperId": "03840eb4bade9aa503ea7e574cb1f12feb933f28", "title": "Semantic Segmentation Using U-Net Architecture for Change Detection on Hyperspectral Imagery"}, {"paperId": "d6caab76f7ccaef163240d319c2e97f9e796acab", "title": "Combining recurrent and residual learning for deforestation monitoring using multitemporal SAR images"}, {"paperId": "b919e53288c98c440240090b50050898b1d84f88", "title": "Contrastive Self-Supervised Two-Domain Residual Attention Network with Random Augmentation Pool for Hyperspectral Change Detection"}, {"paperId": "c92fc5f369a12ddfc41cb7144f6a9a4add1f5ca5", "title": "Cross-Attention Guided Group Aggregation Network for Cropland Change Detection"}, {"paperId": "5368ff989baa724da59de4d171038577016e81c5", "title": "Evaluation of the potential of Near Infrared Hyperspectral Imaging for monitoring the invasive brown marmorated stink bug"}, {"paperId": "fb449015f0cac22587db656dbc4e707299a620b9", "title": "Vision Transformer is Required for Hyperspectral Semantic Segmentation"}, {"paperId": "9ce2038104f6920900452f79a2d355ed37274b1b", "title": "Deep learning as a novel method for endoscopic diagnosis of chronic atrophic gastritis: a prospective nested case–control study"}, {"paperId": "10c83b920c33d809bc72b8cbfa6fc29fa71b4d12", "title": "Layout Optimization of Urban Cultural Space Construction Based on Forward Three-Layer Neural Network Model"}, {"paperId": "a45d5828be284bb2152b668f451044305ffff8fa", "title": "Deep Learning-Based Change Detection in Remote Sensing Images: A Review"}, {"paperId": "f293d302f0f5728ad3d20dffcdad74adc33ae84d", "title": "Spatial weighted kernel spectral angle constraint method for hyperspectral change detection"}, {"paperId": "f2608c7dbce9b172ac231ab6cbc933bbf168b096", "title": "A New Structure for Binary and Multiple Hyperspectral Change Detection Based on Spectral Unmixing and Convolutional Neural Network"}, {"paperId": "eb3d16682f8c751b58cd8998e3e2ce0d78409210", "title": "A Novel Fuzzy Optimized CNN-RNN Method for Facial Expression Recognition"}, {"paperId": "09ab00e80f726b8bfd3c1d2c2b1835d582ee35e0", "title": "Pyramid self-attention mechanism-based change detection in hyperspectral imagery"}, {"paperId": "c95d535186031b25c492dd03422d34b10506f8c2", "title": "Spectrum-Induced Transformer-Based Feature Learning for Multiple Change Detection in Hyperspectral Images"}, {"paperId": "c110d27c3b7bf0a31ffd04adfe002f877d2c8e1d", "title": "Semi-Supervised HyperMatch-Driven Cross Temporal and Spatial Interaction Transformer for Hyperspectral Change Detection"}, {"paperId": "a7b3608e7659dd8fa1a12bda5150f0930536aa85", "title": "Multiscale Diff-Changed Feature Fusion Network for Hyperspectral Image Change Detection"}, {"paperId": "e19cd2b6a27d0cd956f4d9d8a2cff009479de5b5", "title": "A Comprehensive Survey of Imbalance Correction Techniques for Hyperspectral Data Classification"}, {"paperId": "7a3551283a86b537d5d5a900fab31e7319791d60", "title": "SSViT-HCD: A Spatial–Spectral Convolutional Vision Transformer for Hyperspectral Change Detection"}, {"paperId": "be06245e81a4aa6765b76b93e0c68dc34b3ef732", "title": "Dual-Attention Cross Fusion Context Network for Remote Sensing Change Detection"}, {"paperId": "f48b20f4dd969f396c94cca4c577e74363ec5036", "title": "SemiBuildingChange: A Semi-Supervised High-Resolution Remote Sensing Image Building Change Detection Method With a Pseudo Bitemporal Data Generator"}, {"paperId": "001f081d08daf92a0213aef9e010cd3222cff727", "title": "Hierarchical Attention Feature Fusion-Based Network for Land Cover Change Detection With Homogeneous and Heterogeneous Remote Sensing Images"}]}
