{"paperId": "51d2eafb8e2ac47eed66ff020e88eb0b966a9c69", "publicationVenue": {"id": "106ecc86-1801-4b36-a05c-d36db69a968c", "name": "OncoTarget", "type": "journal", "alternate_names": ["Oncotarget"], "issn": "1949-2553", "url": "http://www.impactjournals.com/oncotarget/index.php?journal=oncotarget"}, "title": "Target of obstructive sleep apnea syndrome merge lung cancer: based on big data platform", "abstract": "Based on our hospital database, the incidence of lung cancer diagnoses was similar in obstructive sleep apnea Syndrome (OSAS) and hospital general population; among individual with a diagnosis of lung cancer, the presence of OSAS was associated with an increased risk for mortality. In the gene expression and network-level information, we revealed significant alterations of molecules related to HIF1 and metabolic pathways in the hypoxic-conditioned lung cancer cells. We also observed that GBE1 and HK2 are downstream of HIF1 pathway important in hypoxia-conditioned lung cancer cell. Furthermore, we used publicly available datasets to validate that the late-stage lung adenocarcinoma patients showed higher expression HK2 and GBE1 than early-stage ones. In terms of prognostic features, a survival analysis revealed that the high GBE1 and HK2 expression group exhibited poorer survival in lung adenocarcinoma patients. By analyzing and integrating multiple datasets, we identify molecular convergence between hypoxia and lung cancer that reflects their clinical profiles and reveals molecular pathways involved in hypoxic-induced lung cancer progression. In conclusion, we show that OSAS severity appears to increase the risk of lung cancer mortality.", "venue": "OncoTarget", "year": 2017, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-02-16", "journal": {"name": "Oncotarget", "pages": "21567 - 21578", "volume": "8"}, "authors": [{"authorId": "150189443", "name": "Lifeng Li"}, {"authorId": "46279703", "name": "Jingli Lu"}, {"authorId": "6065234", "name": "W. Xue"}, {"authorId": "120692422", "name": "Liping Wang"}, {"authorId": "37942529", "name": "Yun-kai Zhai"}, {"authorId": "7763426", "name": "Zhirui Fan"}, {"authorId": "2216730916", "name": "Ge Wu"}, {"authorId": "47178132", "name": "Feifei Fan"}, {"authorId": "46276798", "name": "Jieyao Li"}, {"authorId": "50445778", "name": "Chaoqi Zhang"}, {"authorId": "39831777", "name": "Yi Zhang"}, {"authorId": "2110117480", "name": "Jie Zhao"}], "citations": [{"paperId": "d495239f7ce26c23dfa9907a5891c5e18121cf7f", "title": "A review of obstructive sleep apnea and lung cancer: epidemiology, pathogenesis, and therapeutic options"}, {"paperId": "f689acc2425b3f42bc4740dbfa8cf00ffec0d764", "title": "Obstructive sleep apnea and cancer: epidemiology, pathophysiology, and clinical aspects"}, {"paperId": "bf6fa48198de0a2424110c7bab98c97b130c0e0c", "title": "Identification of key genes in chronic intermittent hypoxia-induced lung cancer progression based on transcriptome sequencing"}, {"paperId": "76c7520fbb3692969c5dd9e301e15d537931b17d", "title": "Identification of a novel intermittent hypoxia-related prognostic lncRNA signature and the ceRNA of lncRNA GSEC/miR-873-3p/EGLN3 regulatory axis in lung adenocarcinoma"}, {"paperId": "268d81e3b1611ebf32f7cd347f9c39a1f9abc0c3", "title": "Genetics of enzymatic dysfunctions in metabolic disorders and cancer"}, {"paperId": "5519e9f4881be640e28cbe6d6f185ad8d89a14a2", "title": "Overnight changes in uric acid, xanthine oxidoreductase and oxidative stress levels and their relationships with sleep-disordered breathing in patients with coronary artery disease"}, {"paperId": "6f89302702cf37c27cf3b0e1e8b1a0351be9ca4d", "title": "Potential Pathophysiological Pathways in the Complex Relationships between OSA and Cancer"}, {"paperId": "d9733615639923a513de4ce2819e053b56af9593", "title": "Associations among sleep-disordered breathing, sleep quality, and lung cancer in Korean patients"}, {"paperId": "d6d81f8d44c124ee7ffd06d7f03e180933fc479e", "title": "Sleep pattern changes in patients with lung cancer"}, {"paperId": "c62573c009e442217b216617cd3d27b245b18f1b", "title": "Surgical approaches in obstructive sleep apnea syndrome: A review of techniques"}, {"paperId": "ded63ad50853095108f00f48886e58c581fabcca", "title": "The Component and Functional Pathways of Gut Microbiota are Altered in Populations with Poor Sleep Quality – A Preliminary Report"}, {"paperId": "2bab47664fb613b93d91ec2f59ea80e9ad8d3b40", "title": "Sleep-Disordered Breathing in Newly Diagnosed Patients of Lung Cancer"}, {"paperId": "f51fffa6b4a5c03f1d49d7cb180d48261666a29e", "title": "The Incidence of Cancer Is Increased in Hospitalized Adult Patients With Obstructive Sleep Apnea in China: A Retrospective Cohort Study"}, {"paperId": "f07d0fefee4b37d534f962563d0ea267a82e25ff", "title": "Construction and Clinical Application Effect of General Surgery Patient-Oriented Nursing Information Platform Using Cloud Computing"}, {"paperId": "c85a5ff0f7f1348aec9f7c6b1ca24e22db899e4f", "title": "Sleep apnoea and cancer risk: Where are we now?"}, {"paperId": "7221d23579e623e386d48fbf87d8374b2963ca3e", "title": "Giant Ovarian Cyst Presenting as an Intra-Abdominal Mass"}, {"paperId": "3b6ad951adb71c397610b5931d1a634577c7edc5", "title": "Obstructive Sleep Apnea in Patients with Head and Neck Cancer—More than Just a Comorbidity?"}, {"paperId": "88155160dd115aa697af6cebe472e4d4beb7d216", "title": "Key Common Genes in Obstructive Sleep Apnea and Lung Cancer are Associated with Prognosis of Lung Cancer Patients"}, {"paperId": "b831483cd3b85b1a3cacb1c7b02d4f391e3f9561", "title": "Obstructive sleep apnea and the risk of mortality in patients with lung cancer: a meta-analysis"}, {"paperId": "0b94b495650a9f56b9ec37352a023106dd6d57d4", "title": "Development and Validation of a Prognostic Nomogram in Lung Cancer With Obstructive Sleep Apnea Syndrome"}, {"paperId": "f5c9e0e47993630b62169c4ddf0a37d134b12c63", "title": "Intermittent hypoxia-induced downregulation of microRNA-320b promotes lung cancer tumorigenesis by increasing CDT1 via USP37"}, {"paperId": "c773b26a97121b0b28e2fe095178c902a37356dc", "title": "Sleep disorders and cancer: State of the art and future perspectives."}, {"paperId": "fe6bcd0bcf470ecdde9d4545864aa40a1831b94d", "title": "Sleep Apnoea Adverse Effects on Cancer: True, False, or Too Many Confounders?"}, {"paperId": "9031160b616f5cd9782dfa829e77e23ee8c22ee6", "title": "Gene‐gene interaction analysis incorporating network information via a structured Bayesian approach"}, {"paperId": "6ab8693a48bad3d24d7db1c66017b36d76445862", "title": "Role of the Cyclooxygenase Pathway in the Association of Obstructive Sleep Apnea and Cancer"}, {"paperId": "a92a7493b5c3fc5c36c57ffa23d0ca0d02c188a8", "title": "Obstructive sleep apnea and cancer: a complex relationship"}, {"paperId": "8981e81b42ae436fa03900eae319b7d05633c84f", "title": "Association between nocturnal hypoxemia and cancer incidence in patients investigated for obstructive sleep apnea. Data from a large multicenter French cohort."}, {"paperId": "682ac7a80f2f5d8bb8a2844db4b5025e99da0b36", "title": "Identification of a Hypoxia-Associated Signature for Lung Adenocarcinoma"}, {"paperId": "ae6ffc38185608106c9d5a27c56c072d6b1efeac", "title": "A Regulatory Axis of circ_0008193/miR-1180-3p/TRIM62 Suppresses Proliferation, Migration, Invasion, and Warburg Effect in Lung Adenocarcinoma Cells Under Hypoxia"}, {"paperId": "161f350690c4eb5bca6058979bbbfae0b94b77bc", "title": "Hypoxia-induced GBE1 expression promotes tumor progression through metabolic reprogramming in lung adenocarcinoma"}, {"paperId": "9880ca3ae2eafa32cdd124ca8ce7d7fcbd64c5a5", "title": "Severe Obstructive Sleep Apnea Associated With Higher Risk of Mortality in Stage III and IV Lung Cancer."}, {"paperId": "c51d9c6110e13472edb3b15b3e8d9edd21114558", "title": "Obstructive sleep apnea syndrome promotes the progression of aortic dissection via a ROS- HIF-1α-MMPs associated pathway"}, {"paperId": "8b019c48712437686808e62829280ac2035a9080", "title": "Relationship between Occurrence and Progression of Lung Cancer and Nocturnal Intermittent Hypoxia, Apnea and Daytime Sleepiness"}, {"paperId": "f69099e834b2419153a722488ae3d63dc35ca758", "title": "Lung adenocarcinoma-intrinsic GBE1 signaling inhibits anti-tumor immunity"}, {"paperId": "81ff88fe052b5a9ccab982a580af4ffa1e0cce64", "title": "Obstructive sleep apnea and comorbidities: a dangerous liaison"}, {"paperId": "206f4c2b29e1e81384200e2b3ce8d1f3af28d25a", "title": "Anti-tumor effect of endostatin in a sleep-apnea mouse model with tumor"}, {"paperId": "666ab9d5b9c44443383b280171d1ef37bfc76f57", "title": "Sleep Disordered Breathing Is Highly Prevalent in Patients with Lung Cancer: Results of the Sleep Apnea in Lung Cancer Study"}, {"paperId": "a580b3968f93c2bf2ede9b4b964a6b0f0fca322e", "title": "Intermittent Hypoxia Is Associated With High Hypoxia Inducible Factor-1α but Not High Vascular Endothelial Growth Factor Cell Expression in Tumors of Cutaneous Melanoma Patients"}, {"paperId": "928ae656dba7567a9b9d51288f558c81f5eb3574", "title": "Correlation between coronary artery disease and obstructive sleep apnea syndrome and analysis of risk factors"}, {"paperId": "c97fe2448db37ac3f3f25805bbd8fdf696eb627c", "title": "Intermittent hypoxia and cancer: Undesirable bed partners?"}, {"paperId": "fd3790922fb8f5eff614fee0b9a72a7b13090bba", "title": "Development and validation of a prognostic nomogram in lung cancer with obstructive sleep apnea syndrome"}]}
