{"paperId": "51de4333a52b9a080b1213242265860ee36eabe2", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Contributions of the 5G Network with Respect to Decent Work and Economic Growth (Sustainable Development Goal 8): A Systematic Review of the Literature", "abstract": "Decent work and economic growth are fundamental elements for the sustainable development of a society, with Sustainable Development Goal 8 (SDG8) being one of the key objectives of the United Nations’ 2030 Agenda. The 5G network has great potential to contribute significantly to the achievement of SDG8, offering faster and more reliable connectivity, which opens up new possibilities for innovation, operational efficiency, and job creation. The present study aimed to investigate the role of 5G technologies concerning decent work and economic growth (SDG8). As part of the method, 265 articles extracted from main databases such as Scopus, IEEExplore, and ScienceDirect were analyzed using the PRISMA methodology, resulting in 74 relevant articles after applying the inclusion and exclusion criteria. As a result, a greater contribution to the use of the 5G network was identified in sectors such as manufacturing, health, and transportation, generating greater economic growth and job creation. It was also found that the technological applications with the greatest contributions are “Internet of Things” and “Artificial intelligence”. Finally, it was concluded that the results of this review are useful for future research on technologies that support 5G networks, contributing to economic growth and equitable and sustainable decent work in a wide range of sectors and rural areas.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-09", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2174906414", "name": "Saul Beltozar-Clemente"}, {"authorId": "2139807582", "name": "Orlando Iparraguirre-Villanueva"}, {"authorId": "2266576630", "name": "Félix Pucuhuayla-Revatta"}, {"authorId": "2156869176", "name": "Fernando Sierra-Liñan"}, {"authorId": "1491177485", "name": "Joselyn Zapata-Paulini"}, {"authorId": "1491176516", "name": "M. Cabanillas-Carbonell"}], "citations": [{"paperId": "b346d6a94619635563e6e4ca894a78061dba9081", "title": "Decent work, financial inclusion, and economic growth: Analysis under the SDG 8"}, {"paperId": "59c1f3dfd28693177e7e599e9784586fba321b43", "title": "Ohio’s 5G and Broadband Workforce: Assessing the Current Landscape Using Skillshed Analysis"}]}
