{"paperId": "51e4fbedaee4eb0fb9e95b9342f65426200075d5", "publicationVenue": null, "title": "Demonstration of VerdictDB, the Platform-Independent AQP System", "abstract": "We demonstrate VerdictDB, the first platform-independent approximate query processing (AQP) system. Unlike existing AQP systems that are tightly-integrated into a specific database, VerdictDB operates at the driver-level, acting as a middleware between users and off-the-shelf database systems. In other words, VerdictDB requires no modifications to the database internals; it simply relies on rewriting incoming queries such that the standard execution of the rewritten queries under relational semantics yields approximate answers to the original queries. VerdictDB exploits a novel technique for error estimation called variational subsampling, which is amenable to efficient computation via SQL. In this demonstration, we showcase VerdictDB's performance benefits (up to two orders of magnitude) compared to the queries that are issued directly to existing query engines. We also illustrate that the approximate answers returned by VerdictDB are nearly identical to the exact answers. We use Apache Spark SQL and Amazon Redshift as two examples of modern distributed query platforms. We allow the audience to explore VerdictDB using a web-based interface (e.g., Hue or Apache Zeppelin) to issue queries and visualize their answers. VerdictDB is currently open-sourced and available under Apache License (V2).", "venue": "SIGMOD Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "Proceedings of the 2018 International Conference on Management of Data"}, "authors": [{"authorId": "2153233150", "name": "Wen He"}, {"authorId": "40155297", "name": "Yongjoo Park"}, {"authorId": "46244640", "name": "Idris Hanafi"}, {"authorId": "46196530", "name": "Jacob Yatvitskiy"}, {"authorId": "2198667", "name": "Barzan Mozafari"}], "citations": [{"paperId": "023fbffad88fd923d33c1e3ac33262b396123065", "title": "A Step Toward Deep Online Aggregation"}, {"paperId": "80f9050f657b5f541ded4ff5d778912a49cf8432", "title": "Airphant: Cloud-oriented Document Indexing"}, {"paperId": "87735c7ebbb1c682c3842877abe7148d3f848add", "title": "Approximating Aggregated SQL Queries with LSTM Networks"}, {"paperId": "b58ed8f7ea5208c454dcf992d1d34f00c10d68bf", "title": "BlinkML: Efficient Maximum Likelihood Estimation with Probabilistic Guarantees"}, {"paperId": "6bab2c1b2add92f9ce1472d5854b7283919001fd", "title": "VerdictDB: Universalizing Approximate Query Processing"}, {"paperId": "344df9dec68dbedeff3bb387291ebce6627a8837", "title": "The First ACAIA Workshop : Approximate Computing for Affordable and Interactive Analytics"}, {"paperId": "a6e853f465e6a1ae8eb95fc1329165cf0804a097", "title": "SnappyData"}]}
