{"paperId": "51e7c5941e55489260cf56540a0ab7af059a7e27", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "Personalized Federated Recommendation via Joint Representation Learning, User Clustering, and Model Adaptation", "abstract": "Federated recommendation applies federated learning techniques in recommendation systems to help protect user privacy by exchanging models instead of raw user data between user devices and the central server. Due to the heterogeneity in user's attributes and local data, attaining personalized models is critical to help improve the federated recommendation performance. In this paper, we propose a Graph Neural Network based Personalized Federated Recommendation (PerFedRec) framework via joint representation learning, user clustering, and model adaptation. Specifically, we construct a collaborative graph and incorporate attribute information to jointly learn the representation through a federated GNN. Based on these learned representations, we cluster users into different user groups and learn personalized models for each cluster. Then each user learns a personalized model by combining the global federated model, the cluster-level federated model, and the user's fine-tuned local model. To alleviate the heavy communication burden, we intelligently select a few representative users (instead of randomly picked users) from each cluster to participate in training. Experiments on real-world datasets show that our proposed method achieves superior performance over existing methods.", "venue": "International Conference on Information and Knowledge Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-08-19", "journal": {"name": "Proceedings of the 31st ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": "2182235729", "name": "Sichun Luo"}, {"authorId": "33300770", "name": "Yuanzhang Xiao"}, {"authorId": "38117987", "name": "Linqi Song"}], "citations": [{"paperId": "740cddd1999bec5845529f494a4014902d8c0b9b", "title": "Large Language Models Augmented Rating Prediction in Recommender System"}, {"paperId": "e57b498c47793962866d2774d769d2075725e705", "title": "TransFR: Transferable Federated Recommendation with Pre-trained Language Models"}, {"paperId": "17df9cf8c61578be5bfeb8059780331de0c5adb2", "title": "Towards Personalized Privacy: User-Governed Data Contribution for Federated Recommendation"}, {"paperId": "573bb43c3c99b953f3b0cf5aa96e2aec1efc3bbb", "title": "Integrating Large Language Models into Recommendation via Mutual Augmentation and Adaptive Aggregation"}, {"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}, {"paperId": "bbf159cfafbb37108bafdf9dcf4767643ae5d23d", "title": "RecRanker: Instruction Tuning Large Language Model as Ranker for Top-k Recommendation"}, {"paperId": "bb9dfe1a3790eee15a3e935ccda3946872f982f4", "title": "Model optimization techniques in personalized federated learning: A survey"}, {"paperId": "85c6c9a804e4782fe23cbf2bdc3f9a2b1bc459e8", "title": "Towards fair and personalized federated recommendation"}, {"paperId": "7ff2c76b84b82e2d70aed50d4dc22bca6f2b5017", "title": "Improving Long-Tail Item Recommendation with Graph Augmentation"}, {"paperId": "cfa6abd1af69cc6bce3a549a7886c47906dfdf4a", "title": "Federated Heterogeneous Graph Neural Network for Privacy-preserving Recommendation"}, {"paperId": "9ff306ca0fb4931dbca989bdd90486bc7fe8b599", "title": "Privacy-preserving graph convolution network for federated item recommendation"}, {"paperId": "1e137d84faa0b69530fdec690e4eaeec7831f8cb", "title": "GNN4FR: A Lossless GNN-based Federated Recommendation Framework"}, {"paperId": "4b1bc95030c8f35886aec4b27bdfc48ad1bb3b45", "title": "HeteFedRec: Federated Recommender Systems with Model Heterogeneity"}, {"paperId": "f7833d272af3614923e300bfedc51ace83587428", "title": "PerFedRec++: Enhancing Personalized Federated Recommendation with Self-Supervised Pre-Training"}, {"paperId": "54508c658be1701d099d2c93fded701761d7bd48", "title": "Federated Recommendation with Additive Personalization"}, {"paperId": "9911f321e39910431a67e29e5af955b0265dd54c", "title": "A Survey on Federated Recommendation Systems"}, {"paperId": "c57fb2cc7cbb8233d142748a015c4743fa5af14b", "title": "Towards Communication Efficient and Fair Federated Personalized Sequential Recommendation"}, {"paperId": "cb920b1e0370851d4fe0ad249678c3852c7575bf", "title": "Semi-global sequential recommendation via EM-like federated training"}]}
