{"paperId": "51e86374c5be76db407fe4d27836f62cc07bd255", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Advance Landslide Prediction and Warning Model Based on Stacking Fusion Algorithm", "abstract": "In landslide disaster warning, a variety of monitoring and warning methods are commonly adopted. However, most monitoring and warning methods cannot provide information in advance, and serious losses are often caused when landslides occur. To advance the warning time before a landslide, an innovative advance landslide prediction and warning model based on a stacking fusion algorithm using Baishuihe landslide data is proposed in this paper. The Baishuihe landslide area is characterized by unique soil and is in the Three Gorges region of China, with a subtropical monsoon climate. Based on Baishuihe historical data and real-time monitoring of the landslide state, four warning level thresholds and trigger conditions for each warning level are established. The model effectively integrates the results of multiple prediction and warning submodels to provide predictions and advance warnings through the fusion of two stacking learning layers. The possibility that a risk priority strategy can be used as a substitute for the stacking model is also discussed. Finally, an experimental simulation verifies that the proposed improved model can not only provide advance landslide warning but also effectively reduce the frequency of false warnings and mitigate the issues of traditional single models. The stacking model can effectively support disaster prevention and reduction and provide a scientific basis for land use management.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-24", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2155057240", "name": "Zian Lin"}, {"authorId": "143623220", "name": "Yuanfa Ji"}, {"authorId": "6678623", "name": "Xiyan Sun"}], "citations": []}
