{"paperId": "51fb4a5793b254f37d9ded9fc00f699514c3d09d", "publicationVenue": null, "title": "Analytics Everywhere for Streaming IoT Data", "abstract": "Exploring new insights from IoT data means not only providing higher-level intelligence in a timely way but also generating long-term predictions and decisions from historical IoT data. This paper aims to explore the synergy of various data rates, message passing, and processing algorithms to support streaming analytics at the edge, fog, and cloud computing environments. Towards this end, we present an IoT architecture that is capable of capturing, managing, processing, analyzing, and visualizing IoT data streams. For validation purposes, a smart parking scenario is used to evaluate our architecture.", "venue": "International Conference on Internet of Things: Systems, Management and Security", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 Sixth International Conference on Internet of Things: Systems, Management and Security (IOTSMS)", "pages": "18-25"}, "authors": [{"authorId": "145593236", "name": "Hung Cao"}, {"authorId": "145349714", "name": "M. Wachowicz"}], "citations": [{"paperId": "41beeac34f39a3fa4ae7d6549709436dde945829", "title": "ECAvg: An Edge-Cloud Collaborative Learning Approach using Averaged Weights"}, {"paperId": "75b77b6437da74066f22abf7b6dddaae58268cb4", "title": "Fostering new Vertical and Horizontal IoT Applications with Intelligence Everywhere"}, {"paperId": "5648a2c8a94db999d3cf578bce6ad9b19ed2295e", "title": "Performance Evaluation of a Network on Chip Based on Ghz Throughput and Low Power for Streaming Data Transmission on FPGA"}, {"paperId": "8aed46ccb2a449bb8a6cc6f4dce85c1bb13cefec", "title": "A Fog-Based Multi-Purpose Internet of Things Analytics Platform"}, {"paperId": "eb2b3eebac5ac3223c67222d3823449e3ca300f6", "title": "IoT Analytics Architectures: Challenges, Solution Proposals and Future Research Directions"}, {"paperId": "f7b9205dfb67a2cfef4bde35aa67cd4e36091214", "title": "A Holistic Overview of Anticipatory Learning for the Internet of Moving Things: Research Challenges and Opportunities"}, {"paperId": "72ce18c5206aa5e882e4a642b8225d892b068673", "title": "Learning from evolving data streams"}, {"paperId": "c829a3776de10a5f726af718e99e5090f2fb9098", "title": "Human-Computer Service Interface in Industrial Monitoring Services"}]}
