{"paperId": "51fd8a99213d1338aece597f43d13bbf981d2ab0", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Minimizing Resource Consumption Cost of DAG Applications With Reliability Requirement on Heterogeneous Processor Systems", "abstract": "Resource consumption cost minimization is important in embedded systems due to their limited resource and high computation load. Previous approaches apply either meta-heuristic algorithms such as genetic algorithm or simple heuristics to minimize the resource consumption cost, which, however, are computationally expensive and sometimes ineffective. In this article, we propose how to schedule a directed acyclic graph application with reliability requirement in a heterogeneous embedded system. The scheduling aim is to minimize system resource consumption cost. We start by finding a quasi-optimal solution that minimizes the resource consumption cost in ignorance of reliability. Then, we introduce an indicator that price the tradeoff between reliability and resource consumption cost, based on which we build a scheme that progressively tunes this schedule toward improving its reliability. We also explore an approach that updates this indicator in a lightweight way. Compared to several state-of-the-art approaches such as MRCRG, experimental results demonstrate that our approach constantly outperforms them, and its superiority becomes more significant with the enhancement of reliability requirement.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "7437-7447", "volume": "16"}, "authors": [{"authorId": "38295753", "name": "Biao Hu"}, {"authorId": "3197192", "name": "Zhengcai Cao"}], "citations": [{"paperId": "740bd9cf5ec3181dcb758c27f58db4ecf2718533", "title": "Workload-Aware Scheduling of Real-Time Jobs in Cloud Computing to Minimize Energy Consumption"}, {"paperId": "7f866e987a3b3ba3f69e07f5126dced35ef71ef9", "title": "A Reinforcement Learning-based DAG Tasks Scheduling in Edge-Cloud Collaboration Systems"}, {"paperId": "cdda41c7700688799eae3206c464cfd74eed0105", "title": "Graph-Represented Computation-Intensive Task Scheduling Over Air-Ground Integrated Vehicular Networks"}, {"paperId": "996e54148ad07daa439f02dd1c1f6ff2c8ee5e9a", "title": "Cost-Efficient Fault-Tolerant Workflow Scheduling for Deadline-Constrained Microservice-Based Applications in Clouds"}, {"paperId": "5958ef7d98f6c8a0d69ec395754f0223fb22aa5c", "title": "Online energy-efficient scheduling of DAG tasks on heterogeneous embedded platforms"}, {"paperId": "d1fc29f92f3313262fc192162dcef0b9287ee65a", "title": "Reliability Modeling and Assessment for a Cyber-Physical System With a Complex Boundary Behavior"}, {"paperId": "4768a91162ffcecbd947d5955f9e97deda2d77d5", "title": "A scheduling algorithm for heterogeneous computing systems by edge cover queue"}, {"paperId": "e2f7680d21f772412bccaa9600aaa4f97ceb3167", "title": "Deep reinforcement learning for fault-tolerant workflow scheduling in cloud environment"}, {"paperId": "7d16104314bc739b77eec8306050238968dd44d6", "title": "E-Tree Learning: A Novel Decentralized Model Learning Framework for Edge AI"}]}
