{"paperId": "5200e2342b1245babecb1184d0797d6a3e578d36", "publicationVenue": null, "title": "Analysis and Visualization of Data Assimilating Hive and COGNOS Insight 10.2.2", "abstract": "Data analysis is the most grueling tasks in the coinciding world. The size of data is increasing at a very high rate because of the procreation of peripatetic gadgets and sensors attached. To make that data readable is another challenging task. Effectual visualization provides users with better analysis capabilities and helps in deriving evidence about data. Many techniques and tools have been invented to deal with such problems but to make these tools amendable is the main mystification. It is the big data that originated as a technology which is proficient in assembling and transforming the colossal and divergent figures of data, providing organizations with meaningful insights for derivingimprovedresults. Big data is accustomed to delineate technologies and techniques which are used to store, manage, distribute and analyze huge data sheets. The existent of administrating this research is to make the data readable in a more suitable form with less comprehend. Mainly the research emphasizes on the fabrication of using COGNOS insight 10.2.2 for visualizing data and implementing the analyzed results derived from the hive. The assimilation between tools has also been reformed in this research.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-03-11", "journal": {"name": "International journal of engineering and technology", "pages": "318", "volume": "7"}, "authors": [{"authorId": "2077157068", "name": "Mandeep Virk"}, {"authorId": "21960336", "name": "Vaishali Chauhan"}, {"authorId": "73401737", "name": "Urvashi Mittal"}], "citations": [{"paperId": "18ff6ae109dca79d80609b6285c071a4ca4254ca", "title": "Metamorphosis of data (small to big) and the comparative study of techniques (HADOOP, HIVE and PIG) to handle big data"}]}
