{"paperId": "52055da99bb0fdad22f8c11b96ca69f0d3d7f9e1", "publicationVenue": {"id": "bdc2e585-4e48-4e36-8af1-6d859763d405", "name": "AAAI Conference on Artificial Intelligence", "type": "conference", "alternate_names": ["National Conference on Artificial Intelligence", "National Conf Artif Intell", "AAAI Conf Artif Intell", "AAAI"], "url": "http://www.aaai.org/"}, "title": "Reinforced Approximate Exploratory Data Analysis", "abstract": "Exploratory data analytics (EDA) is a sequential decision making process where analysts choose subsequent queries that might lead to some interesting insights based on the previous queries and corresponding results. Data processing systems often execute the queries on samples to produce results with low latency. Different downsampling strategy preserves different statistics of the data and have different magnitude of latency reductions. The optimum choice of sampling strategy often depends on the particular context of the analysis flow and the hidden intent of the analyst. In this paper, we are the first to consider the impact of sampling in interactive data exploration settings as they introduce approximation errors.\nWe propose a Deep Reinforcement Learning (DRL) based framework which can optimize the sample selection in order to keep the analysis and insight generation flow intact. Evaluations with real datasets show that our technique can preserve the original insight generation flow while improving the interaction latency, compared to baseline methods.", "venue": "AAAI Conference on Artificial Intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-12", "journal": {"pages": "7660-7669"}, "authors": [{"authorId": "2033256793", "name": "Shaddy Garg"}, {"authorId": "145789403", "name": "S. Mitra"}, {"authorId": "2163378642", "name": "Tong Yu"}, {"authorId": "2196512633", "name": "Yash Gadhia"}, {"authorId": "2196548321", "name": "A. Kashettiwar"}], "citations": [{"paperId": "402f50dab29c61709eabe99074bb4b8fe82ccad0", "title": "PairwiseHist: Fast, Accurate and Space-Efficient Approximate Query Processing with Data Compression"}, {"paperId": "f34701899a629b1e32160284a65fad2c61597938", "title": "Fast Natural Language Based Data Exploration with Samples"}, {"paperId": "646ec1add823eb18f74754462fa0a57573db2636", "title": "SEIDEN: Revisiting Query Processing in Video Database Systems"}]}
