{"paperId": "5207faad9518bc74ea1e4e9dde3ae3bc09770bd2", "publicationVenue": {"id": "a608b572-eb7b-4233-8884-8abf9b59a3fc", "name": "International Journal of Religion", "type": "journal", "alternate_names": ["Int J Relig"], "issn": "2633-352X"}, "title": "References to Intertextuality in Diwan (the Collection of Poetry) by\" Hassan Bin Batnnin\". Arriving thereby in the Center Poetically", "abstract": "References to intertextuality in the collection of poetry (Diwan) by \"Hassan ibn Batnnin\". Arriving thereby in the center poetically. This Diwan is one of the contemporary poetic publications that bears a title that refers to explicit intertextuality. In addition, when it was \"standing on the reality of textual interaction in its recovery or simulation from previous texts on it.\" (1) It is natural for us to find that the author has counted the references from which he draws his text, especially since he has titled the Diwan with a clear Quranic reference. The intended meaning of the references is the source through which the creator shapes the corresponding model, \"where the citation of the text is,\" that is, the methods people use to benefit from famous texts, or to refer to them. (2) Literary texts vary in their relative popularity and people's knowledge of them. This variation exists in different directions and fields. Based on this diversity, the references for the texts that creators promote, discuss, and engage with can be literary, religious or historical, and perhaps culture or language is the reference of the creative in that. And this is the \"factors that make the exploitation of a text dependent on knowing a previous text more than the texts it knows in the future, as understanding the text sometimes requires establishing a bridge between this text and other texts.\" And similarly, a loop from the sociability, and it can be said that the interactions that occur between texts arise through the extent of agreement of the text that is being created with other previous visions. Therefore, he will try to search, analyze, and present examples from the Arriving thereby in the center collectively, a desire to reach models that employ the association mentioned by the poet in his Divan, and to know the references and sources on which the poet relied in employing this mechanism. The importance of research: - The absence of any specialized study in this Diwan; because it is one of the latest works in contemporary poetry. - The content of the Diwan that the poet refers to through this title. - The explicit Quranic intertextuality in the title; it invites to read the Diwan and explore its contents. Problem of research and questions: The Diwan (Arriving thereby in the center poetically) has been printed with a somewhat mysterious title, and with this mystery, there is a direct reference to the Quranic text, which invites reading this work and examining the printing of its verses, its meanings, and its references. The research will attempt to discuss that by answering a set of questions: 1. Who is Hassan ibn Batnnin and what are the most important characteristics of his poetry? 2. What is meant by intertextuality and what are its main references? 3. What are the intertextual references employed by the poet in his Diwan? 4. How closely does the poet relate to the Quranic text and invoke it? 5. What are the reasons and consequences of the presence of intertextuality in the Diwan (Arriving thereby in the center poetically), and what are the implications of this intertextuality in it? Research objectives: 1. To identify the translation of the poet Hassan bin Batnnin, and to understand the most important features of his poetry. 2. Introduction to intertextual references and highlighting the most prominent ones. 3. Statement of the intertextual references employed by the poet in his collection for analysis. 4. The poet's alignment with the Quranic text and his invocation of it in his poetry. 5.  Studying the reasons and consequences of the presence of intertextuality in the Diwan \"Arriving thereby in the center poetically\" and its implications. Research Methodology: The nature of intertextuality requires that it enters into its study more than a method, whether it be structural, deconstructive, semiotic, or semantic, which enables me to read the collection in general and understand intertextuality in particular. Research plan: Introduction and covers: (Importance of the topic - Questions - Objectives - Method - Plan...) - Translation of the poet and understanding the characteristics of his poetry. - Introduction to the Diwan (Arriving thereby in the center poetically). - Definition of intertextuality, its concept and its signs. - References to intertextuality. The first topic: Religious reference. The second topic: Historical reference. The third topic: Cultural reference. Conclusion and Results. Indexes. ", "venue": "International Journal of Religion", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-26", "journal": {"name": "International Journal of Religion"}, "authors": [{"authorId": "2281165647", "name": "Rasha Abdul Rauf Al-Habishi"}, {"authorId": "2281166098", "name": "Wafa Alayan Elias Al-Shudayfat"}], "citations": []}
