{"paperId": "5217dcf45306c9781d2fe69f4f8543aabf06f258", "publicationVenue": null, "title": "Exploring Antecedents and Consequences of Toxicity in Online Discussions", "abstract": "Toxicity in online discussions has been an intriguing phenomenon and an important problem. In this paper, we seek to better understand toxicity dynamics in online discussions via a case study on Reddit that explores the antecedents and consequences of toxicity in text. We inspected two dimensions of toxicity: language toxicity, i.e. how toxic the text itself is; and toxicity elicitation, i.e. how much toxicity it elicits in its response. Through regression analyses on Reddit comments, we found that both author propensity and toxicity in discussion context were strong positive antecedents of language toxicity; meanwhile, language toxicity significantly increased the volume and user evaluation of the discussion in some sub-communities, while toxicity elicitation showed mixed effects. We then discuss how our results help understand and regulate toxicity in online discussions by interpreting the complicated triggers and outcomes of toxicity.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-14", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 23", "volume": "4"}, "authors": [{"authorId": "143733364", "name": "Yan Xia"}, {"authorId": "1742431", "name": "Haiyi Zhu"}, {"authorId": "1711569", "name": "T. Lu"}, {"authorId": "1896008570", "name": "Peng Zhang"}, {"authorId": "39341617", "name": "Ning Gu"}], "citations": [{"paperId": "3224acc960dc24b4bc9958616c5acea9153c994a", "title": "Linguistically Differentiating Acts and Recalls of Racial Microaggressions on Social Media"}, {"paperId": "2b20c6358bde280cd03993d5a01496ea9ad50f9d", "title": "Persistent interaction patterns across social media platforms and over time."}, {"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "80c5778a7f41c585db7a4beed2eb65089ab9b87d", "title": "PressProtect: Helping Journalists Navigate Social Media in the Face of Online Harassment"}, {"paperId": "0174d19130eea120b48d32b38ec9c40ff4cd4213", "title": "Toxic comments are associated with reduced activity of volunteer editors on Wikipedia"}, {"paperId": "573695c2c852a0d4fe11af0f632e25ab2f7498e3", "title": "\"Nip it in the Bud\": Moderation Strategies in Open Source Software Projects and the Role of Bots"}, {"paperId": "8688fcb4cf38ff01af9d6d19f9b3b571c0cd74a4", "title": "The Dark Threads That Weave the Web of Shame: A Network Science-Inspired Analysis of Body Shaming on Reddit"}, {"paperId": "782c4c281f1203080f0c9685ace264c1d6c5bd25", "title": "How Civil are Comments on TikTok's Educational Videos? Insights for Learning at Scale"}, {"paperId": "bbf9d648a2c284cf30651e65cb62b2686ff405a6", "title": "Twits, Toxic Tweets, and Tribal Tendencies: Trends in Politically Polarized Posts on Twitter"}, {"paperId": "40383838003f8eefb9348b99435617f707af21c2", "title": "A tale of struggles: an evaluation framework for transitioning from individually usable to community-useful online deliberation tools"}, {"paperId": "55f12284ee4e8996e35a9723fee279640c1d2a20", "title": "Understanding the Behaviors of Toxic Accounts on Reddit"}, {"paperId": "bade0c4a24e7d11c34fdab617913902f0e85afef", "title": "Toxic comments reduce the activity of volunteer editors on Wikipedia"}, {"paperId": "1e48e5f10b76af6a49e0c95884b53ae37aa9dd50", "title": "Slowing it Down: Towards Facilitating Interpersonal Mindfulness in Online Polarizing Conversations Over Social Media"}, {"paperId": "d402e3c6924e86ac3e73ddd5e3c680ced1276b9f", "title": "Sub-Standards and Mal-Practices: Misinformation's Role in Insular, Polarized, and Toxic Interactions"}, {"paperId": "4a978a3e5bc882c2b732b4f882393074d5ab03fd", "title": "Measuring Toxicity Toward Women in Game-Based Communities"}, {"paperId": "3587d05fafec6053808351b8b72c670f58c9a8ec", "title": "Understanding Longitudinal Behaviors of Toxic Accounts on Reddit"}, {"paperId": "3a57f3f173ee5f58ee9904f615a2fafda853b443", "title": "Predicting Performance Improvement of Human Activity Recognition Model by Additional Data Collection"}, {"paperId": "ccbfade59821ec6d1a0cb110e0191c9056aab028", "title": "Acceleration-based Activity Recognition of Repetitive Works with Lightweight Ordered-work Segmentation Network"}, {"paperId": "34e77438d66caffd563f2c2bb1054163022b986a", "title": "The Language of Extremism on Social Media: An Examination of Posts, Comments, and Themes on Reddit"}, {"paperId": "a6cf3a835a673417a086ecae405b34b15d59c7ca", "title": "You’ve never been welcome here: exploring the relationship between exclusivity and incivility in online forums"}, {"paperId": "dad7810836060b8e6364e070ac3d0054644d17e7", "title": "“Did You Miss My Comment or What?” Understanding Toxicity in Open Source Discussions"}, {"paperId": "e9c0c39f597f6094ef1242ecca1d8c26dc281daa", "title": "The Risks, Benefits, and Consequences of Prepublication Moderation: Evidence from 17 Wikipedia Language Editions"}, {"paperId": "7530dab1244b66b736bcae261140831682d69af1", "title": "Quantifying the Intensity of Toxicity for Discussions and Speakers"}, {"paperId": "612fc38991b3c5ba8fb67f65000719bcc31c4e50", "title": "The \"Shut the f**k up\" Phenomenon: Characterizing Incivility in Open Source Code Review Discussions"}, {"paperId": "2a8e9e2d1d3c2a4fe01bafe2f250312c6001ad93", "title": "Political Discussion is Abundant in Non-political Subreddits (and Less Toxic)"}, {"paperId": "c4f96769081f6db9189ee9d1f139451813236608", "title": "NLPGuard: A Framework for Mitigating the Use of Protected Attributes by NLP Classifiers"}]}
