{"paperId": "5221d28eeff926a9888354f28972ed389b5369e3", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Changes in Dietary Patterns and Clinical Health Outcomes in Different Countries during the SARS-CoV-2 Pandemic", "abstract": "Coronavirus disease 2019 (COVID-19), caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has led to an excess in community mortality across the globe. We review recent evidence on the clinical pathology of COVID-19, comorbidity factors, immune response to SARS-CoV-2 infection, and factors influencing infection outcomes. The latter specifically includes diet and lifestyle factors during pandemic restrictions. We also cover the possibility of SARS-CoV-2 transmission through food products and the food chain, as well as virus persistence on different surfaces and in different environmental conditions, which were major public concerns during the initial days of the pandemic, but have since waned in public attention. We discuss useful measures to avoid the risk of SARS-CoV-2 spread through food, and approaches that may reduce the risk of contamination with the highly contagious virus. While hygienic protocols are required in food supply sectors, cleaning, disinfection, avoidance of cross-contamination across food categories, and foodstuffs at different stages of the manufacturing process are still particularly relevant because the virus persists at length on inert materials such as food packaging. Moreover, personal hygiene (frequent washing and disinfection), wearing gloves, and proper use of masks, clothes, and footwear dedicated to maintaining hygiene, provide on-site protections for food sector employees as well as supply chain intermediates and consumers. Finally, we emphasize the importance of following a healthy diet and maintaining a lifestyle that promotes physical well-being and supports healthy immune system function, especially when government movement restrictions (“lockdowns”) are implemented.", "venue": "Nutrients", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "Nutrients", "volume": "13"}, "authors": [{"authorId": "47209406", "name": "Roxana Filip"}, {"authorId": "2124779576", "name": "Liliana Anchidin-Norocel"}, {"authorId": "1583308714", "name": "Roxana Gheorghita"}, {"authorId": "46979038", "name": "W. Savage"}, {"authorId": "1824955", "name": "M. Dimian"}], "citations": [{"paperId": "c55e6b061be803fffce869e761be35064a93156f", "title": "Body Mass Index Trends before and during the COVID-19 Pandemic in Primary School Students in Split-Dalmatia County, Croatia: A Retrospective Study"}, {"paperId": "0337d589c41be21e8f049d4525007a8404dbd597", "title": "New-Onset Diabetes Mellitus in COVID-19: A Scoping Review"}, {"paperId": "ebebd8e15f2c89d15f847f483753cc4d691ce437", "title": "Role of innate immunity in SARS-CoV-2 infection"}, {"paperId": "16e76a3e24c5768968ec67c67a2f373038fe356e", "title": "Habitual adherence to a traditional Mediterranean diet and risk of SARS-CoV-2 infection and Coronavirus disease 2019 (COVID-19): a longitudinal analysis"}, {"paperId": "893d89e4f2b98c81193a90b64465f5f793f57514", "title": "COVID-19 pandemic impact on ocular trauma in a tertiary hospital."}, {"paperId": "125e8786bf9054644ca2c2edd2c1a116996da84c", "title": "Depression and Anxiety Are Associated With Cardiovascular Health in Young Adults"}, {"paperId": "d30e6f6a4463daeba86a2a68151af1d4eac2507c", "title": "Effects of dietary intake behavior, food supply, nutrition, and health during the COVID-19 outbreak"}, {"paperId": "1c2a2ba901c5f091f24e7eeacd2a58b3fdc9dc15", "title": "Eating habits of children and adolescents during the COVID-19 era: A systematic review"}, {"paperId": "b487d97daf6432472e7be068b09eb1046102c25d", "title": "How did lockdown and social distancing policies change the eating habits of diabetic patients during the COVID-19 pandemic? A systematic review"}, {"paperId": "cfbcbb1529ea5783f554e6d4920304b0b2cb56f9", "title": "Eating Animal Products, a Common Cause of Human Diseases"}, {"paperId": "1dd01108e58087bab4fb4a9393209cd36aa83083", "title": "High Prevalence of Peroneal Neuropathy Among Children During the COVID-19 Pandemic"}, {"paperId": "6d3ff7e653c724a39db6d20081c04fb5ca8ca83f", "title": "Impact of COVID-19 Vaccination Status and Confidence on Dietary Practices among Chinese Residents"}, {"paperId": "827aa2dbd011dd37096c036a0e8a55795fd4649d", "title": "Parents’ and Childcare Workers’ Perspectives Toward SARS-CoV-2 Test and Surveillance Protocols in Pre-school Children Day Care Centers: A Qualitative Study Within the German Wü-KiTa-CoV Project"}, {"paperId": "dea4980bec40e3902411ed08b19fa6025b846431", "title": "Does Mediterranean Adequacy Index Correlate with Cardiovascular Events in Patients with Advanced Chronic Kidney Disease? An Exploratory Study"}, {"paperId": "a3e4dafc4555af1a37bfb7ec0dcdb731380cab46", "title": "The relationship between changing nutrition and hygiene habits and coronavirus fear levels during the COVID-19 pandemic process in university students receiving health education"}, {"paperId": "aae9bbc17e1687e3f93235045a3bbe847c1979f5", "title": "Impact of Lockdown due to COVID-19 on lifestyle and diet pattern of college students of Eastern India: A cross-sectional survey"}, {"paperId": "f85886338fa0e82f6c137e42194dd11c1cd44220", "title": "Food Habits and Lifestyle of Romanians in the Context of the COVID-19 Pandemic"}, {"paperId": "301fef820bca502d9e3a6c3b890edc274b43679c", "title": "Preventing the Adverse Effects of SARS-CoV-2 Infection and COVID-19 through Diet, Supplements, and Lifestyle"}]}
