{"paperId": "52377cde812e4069d540f8e382c7e95eb4117b4f", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "Vehicular Virtual Edge Computing using Heterogeneous V2V and V2C Communication", "abstract": "Recently, much progress has been achieved virtualizing edge computing and integrating end systems like modern vehicles as both edge servers as well as users.Previously, it was assumed that all participating vehicles share the same vehicle-to-vehicle (V2V) communication technology to exchange data. Uplinks and downlinks to the cloud or a back end data center are provided by gateway nodes that also have a vehicle-to-cloud (V2C) communication interface. We now go beyond this initial architecture and consider quite heterogeneous communication technologies deployed at each vehicle. In particular, we assume that each vehicle is equipped with either V2V or V2C communication, or both so that it can also act as a gateway between the different worlds. We call the resulting system hybrid micro clouds. In this paper, we present means for hybrid micro cloud formation such that every vehicle can exchange data with other vehicles as well as with the back end data center. In our performance evaluation, we looked at the position error of neighboring vehicles in the local knowledge bases compared to the ground truth as a metric.", "venue": "Conference on Computer Communications Workshops", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-02", "journal": {"name": "IEEE INFOCOM 2022 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1-2"}, "authors": [{"authorId": "8812644", "name": "Gurjashan Singh Pannu"}, {"authorId": "38076247", "name": "Seyhan Uçar"}, {"authorId": "1741334", "name": "Takamasa Higuchi"}, {"authorId": "1767587", "name": "O. Altintas"}, {"authorId": "1725013", "name": "F. Dressler"}], "citations": [{"paperId": "134dda8296c209571bf90953e9f47648181952a2", "title": "Mobility-aware Vehicular Cloud formation mechanism for Vehicular Edge Computing environments"}]}
