{"paperId": "523aacc0b0d7e18a413f0ed7c5846aebd013e022", "publicationVenue": null, "title": "A Multi-Stage Event Detection Model for Video Datasets Nature-Inspired and Optimized Feature-Based Learning Model", "abstract": "Estimating the state of the item being tracked is part of the Object Tracking process. Visual tracking is a subject in computer vision that has potential applications in a wide variety of emerging and established technical fields, such as robotics, video surveillance, human-computer interaction, autonomous cars, and sports analytics, to name a few. Therefore, visual trackers are used in mobile robots, in the monitoring of traffic, in the vision of robots, and in the forecasting of accidents. When trying to draw conclusions about the motion of an item based on a set of photographs that have been collected, one of the most challenging challenges is known as “tracking,” and it is one of the most important aspects of this endeavor. The size of an item, its position, and its articulation are the three tasks that provide the greatest challenge in computer vision owing to non-visibility changes. This is because there are certain instances in which the appearance of a visual object is not apparent. The object tracking algorithm is able to function well because of the utilization of a number of characteristics, including the Grayscale feature, Gradient feature, Texture feature, Colour feature, and Fusion of several features. This review article presents a comprehensive assessment in order to learn more about the most current studies in this field and to make suggestions for the conduct of future research. The vast majority of the papers that are being considered are concerned with the identification of events of various kinds, including those that take place in real-time, sports, traffic, natural catastrophes, and other topics. The two issues that have received the most research attention in the field of computer vision are object popularity and the ability to localize an object inside a movie. The popularity of an item is a topic that may be discussed alongside its representation, detection, and categorization. The popularity of object detection and its use in 3-D devices has been studied in a variety of issues, such as monitoring of the places in which it is stored in order to extract it. Given the prior function and length of the target item, the objective of visible tracking is to adjust an arbitrary object in any environment. The aim may be accomplished in one of two ways: either by monitoring a single item or by tracking many objects at the same time. The EFS-linear MSVM approach is proposed as a means of identifying many events within video sequences in this work. The primary objective of this research is to provide an appropriate approach for the selection of features and a classification strategy for the identification of multiple events in You Tube videos. The frames are improved by histogram equalization, and then GLTP, HOG, and Tamura features are employed to extract the feature vectors, which are often of a higher dimensional type. An effective method of feature selection known as EFS is recommended for use in the process of picking the most useful feature subsets from among the extracted feature vectors. After that, the MSVM is provided with the best feature sub-sets in order to do multi-class classification (20 action scenarios on each database). In the end, the Euclidean distance is used to obtain the events and activities that are relevant. Item tracking is utilized as a result to identify the object in a video and accurately interpret its motion as a sequence of trajectories.", "venue": "2022 International Conference on Computational Modelling, Simulation and Optimization (ICCMSO)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-01", "journal": {"name": "2022 International Conference on Computational Modelling, Simulation and Optimization (ICCMSO)", "pages": "67-72"}, "authors": [{"authorId": "39740932", "name": "Raman Chadha"}, {"authorId": "9193121", "name": "Sanjay Singla"}, {"authorId": "2243997469", "name": "Md. Abdul Wassay"}], "citations": []}
