{"paperId": "524beab5229705e14c325411b884133799d3923b", "publicationVenue": null, "title": "A Spatial Information System (SIS) for the Architectural and Cultural Heritage of Sardinia (Italy)", "abstract": "The paper presents a spatial information system (SIS) developed in the research project, “Tecniche murarie tradizionali: conoscenza per la conservazione ed il miglioramento prestazionale” (Traditional building techniques: from knowledge to conservation and performance improvement), with the aim of archiving and managing the data derived from the project. The research project has the purpose of studying the building techniques of the 13th–18th centuries in the Sardinia region (Italy) for their knowledge, conservation, and promotion. The research is founded on a multidisciplinary approach involving several specialists integrating their expertise and providing their input to the knowledge of the dimensional, technical constructive, mensiochronological, materials, physical-mechanical, and energy performance features. This multidisciplinary approach is used to define the peculiarities and behavior of the examined structures, including their performance levels, and then direct the interventions toward innovative, mindful, and ethically correct solutions. The management of the huge amount of data produced during the research required the building of a SIS composed of a geodatabase connected to a GIS and a WebGIS through a Web Map Service (WMS). The entire infrastructure is developed and implemented using open source software components, and will make the research data available to the scientific and professional communities, both for further development and for technical uses. As of today, we surveyed and archived more than 500 buildings belonging to the Sardinia region architectural heritage, and classified them into four main macro categories: defensive architectures, religious architectures, residential architectures, and industrial architectures.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-02-04", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "49", "volume": "7"}, "authors": [{"authorId": "8019761", "name": "G. Vacca"}, {"authorId": "84328533", "name": "D. Fiorino"}, {"authorId": "36030713", "name": "D. Pili"}], "citations": [{"paperId": "0a7a465a15177b512b511f80a0b227a528fb8762", "title": "Co-Planning Port–City 2030: The InterACT Approach as a Booster for Port–City Sustainable Development"}, {"paperId": "5c0234d211b1f712c17986989e0216a26f21d6e8", "title": "Geovisualization of Historical Geospatial Data: A Web Mapping Application for the 19th-Century Kaupert’s Maps of Attica"}, {"paperId": "57f98f4f16b586ddd7ae1eb2fe5da404ec9bc020", "title": "Digital Documentation and Conservation of Architectural Heritage Information: An Application in Modern Chinese Architecture"}, {"paperId": "e450e845e4cc1734593e388f250f7149bd7c2acd", "title": "A GIS-based decision support system for the management of the Moroccan habous property"}, {"paperId": "54be78047604c799d100187c9abd71108fabab48", "title": "Visualizing digital architectural data for heritage education"}, {"paperId": "655766a49c8e74f12b2649d589fb4a990f64fe49", "title": "The Importance of Multidisciplinary Analytical Strategies to Solve Identification and Characterization Challenges in Gemology: The Example of the “Green Stones”"}, {"paperId": "da9f4aea95f15fb07041876178439653b25c92c0", "title": "Integration of Laser Scanning Technologies and 360º Photography for the Digital Documentation and Management of Cultural Heritage Buildings"}, {"paperId": "3e32be4cfe1d1eb8354627c62c1d41a39ab51aa7", "title": "An Unconventional Field Mapping Application: A Complete Opensource Workflow Solution Applied to Lithological Mapping of the Coatings of Cultural Heritage"}, {"paperId": "7a463e49c9c5e6b398c5949c74e155a3e5ad4d88", "title": "When GIS Joins the Conservation Management Plan of a 20th-Century Architectural Heritage"}, {"paperId": "6179b1252bc303bf772c6101f9beba923af1ddb4", "title": "GEOPORTAL PROPOSAL FOR THE INVENTORY OF CULTURAL HERITAGE IN NABÓN (ECUADOR)"}, {"paperId": "aec1fc014f7349d49641bc58a89af84b4a592ac6", "title": "VIRTUAL TOURS AND INFORMATIONAL MODELS FOR IMPROVING TERRITORIAL ATTRACTIVENESS AND THE SMART MANAGEMENT OF ARCHITECTURAL HERITAGE: THE 3D-IMP-ACT PROJECT"}, {"paperId": "33d4e8538a17b475ad8012c3232cbc018e65f2ea", "title": "One Archaeology: A Manifesto for the Systematic and Effective Use of Mapped Data from Archaeological Fieldwork and Research"}, {"paperId": "c3449faa50f481f701406c7b2f708606a86287c8", "title": "Medieval municipal buildings: development of a digital atlas to support historical research"}, {"paperId": "7fbc3209385bb3201b10a8f01776b503c19ffcd7", "title": "Review of Methods for Documentation, Management, and Sustainability of Cultural Heritage. Case Study: Museum of King Jan III’s Palace at Wilanów"}, {"paperId": "b4b7707b72ae7ded61d4698a0a6f06c6a0f9e796", "title": "Archiving of the conservation data of immovable cultural assets dating to 1300-1600 in Urla center using GIS"}, {"paperId": "af97324918c03d9229e910eaf23552209dd077b1", "title": "Rapid Condition Surveys of Archaeological Excavations: Training Professionals in Two Minoan Sites on East Crete, Greece"}, {"paperId": "de73ba6f3e054a24e10b18db58b2ea6c788ea032", "title": "Geoinformation analytical system “Archaeological sites of Crimea”"}, {"paperId": "775a60fecd0e5423b4125b4a8ab34468f8f46d54", "title": "A Multi-Criteria Cataloging of the Immovable Items of Industrial Heritage of Andalusia"}, {"paperId": "80ba0950c1e05bf950880c36f74c59523a919df6", "title": "Application of Open-Source Software in Community Heritage Resources Management"}, {"paperId": "9a217299b94b10e5eb0de16377d2ac44a697e178", "title": "Cultural Landscape Assessment: The Rural Architectural Heritage (13th–17th Centuries) in Mediterranean Valleys of Marina Alta, Spain"}, {"paperId": "eaebbfb124a83c451107a98b2190e470ef75685a", "title": "INTEGRATING BIM AND GIS DATA TO SUPPORT THE MANAGEMENT OF LARGE BUILDING STOCKS"}, {"paperId": "1845f003bd517be097550052eb7774408449d649", "title": "Share Our Cultural Heritage (SOCH): Worldwide 3D Heritage Reconstruction and Visualization via Web and Mobile GIS"}, {"paperId": "6cd185f6facfdc680ac218281cf0e66a1ccd1430", "title": "THE USE OF THE UAV IMAGES FOR THE BUILDING 3D MODEL GENERATION"}, {"paperId": "797988aee76f62fb9fd7091eb856e2310f9f215a", "title": "Cultural Routes in Kynouria of Arcadia: Geospatial Database Design and Software Development for Web Mapping of the Spatio-Historical Information"}, {"paperId": "3b5bd700f54688ba29ff93e10ec90240f035e213", "title": "GIS-HBIM INTEGRATION FOR THE MANAGEMENT OF HISTORICAL BUILDINGS"}, {"paperId": "7c8f60fc9c093bef7a6a09d6e7c1ebf3823347db", "title": "Relational Database, GIS Layers, and Geodatabase for Cultural Heritage Management"}, {"paperId": "f209600642f2e2d101c001a92a7050ef7ba1849e", "title": "A WebGIS-Based Platform for Sewage Treatment Facilities in Villages and Small Towns Near the Lake Dian"}, {"paperId": "3f7b051fb936f8098b17c19e6e492b0ede23536b", "title": "DIGITAL TOOLS FOR THE KNOWLEDGE AND ENHANCEMENT OF WWII HERITAGE. THE CASE STUDY OF BOSA IN THE WEST COAST OF SARDINIA (ITALY)"}, {"paperId": "0839a16226d15b28d5f048805562b3590b8f321b", "title": "Development of a Virtual CH Path on WEB: Integration of a GIS, VR, and Other Multimedia Data"}, {"paperId": "86502dd8625b9900f8fd9ac858a72bc200436c39", "title": "Spatial Information System for Heritage of Islam Banten Culture"}, {"paperId": "c17c5b973d1c315f088392372e017959de1b79d6", "title": "METHOD OF CREATING WEB-GIS OF POLISH BURIALS AT KYIV BAIKOVE CEMETERY"}]}
