{"paperId": "52641bd709d77c202815ba0d094fe521023d9bd7", "publicationVenue": null, "title": "ShapeDBA: Generating Effective Time Series Prototypes using ShapeDTW Barycenter Averaging", "abstract": "Time series data can be found in almost every domain, ranging from the medical field to manufacturing and wireless communication. Generating realistic and useful exemplars and prototypes is a fundamental data analysis task. In this paper, we investigate a novel approach to generating realistic and useful exemplars and prototypes for time series data. Our approach uses a new form of time series average, the ShapeDTW Barycentric Average. We therefore turn our attention to accurately generating time series prototypes with a novel approach. The existing time series prototyping approaches rely on the Dynamic Time Warping (DTW) similarity measure such as DTW Barycentering Average (DBA) and SoftDBA. These last approaches suffer from a common problem of generating out-of-distribution artifacts in their prototypes. This is mostly caused by the DTW variant used and its incapability of detecting neighborhood similarities, instead it detects absolute similarities. Our proposed method, ShapeDBA, uses the ShapeDTW variant of DTW, that overcomes this issue. We chose time series clustering, a popular form of time series analysis to evaluate the outcome of ShapeDBA compared to the other prototyping approaches. Coupled with the k-means clustering algorithm, and evaluated on a total of 123 datasets from the UCR archive, our proposed averaging approach is able to achieve new state-of-the-art results in terms of Adjusted Rand Index.", "venue": "AALTD@ECML/PKDD", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-28", "journal": {"name": "ArXiv", "volume": "abs/2309.16353"}, "authors": [{"authorId": "2203083734", "name": "Ali Ismail-Fawaz"}, {"authorId": "19302914", "name": "Hassan Ismail Fawaz"}, {"authorId": "153827036", "name": "Franccois Petitjean"}, {"authorId": "2535629", "name": "M. Devanne"}, {"authorId": "2248083949", "name": "Jonathan Weber"}, {"authorId": "2507859", "name": "S. Berretti"}, {"authorId": "2247943920", "name": "Geoffrey I. Webb"}, {"authorId": "2318564", "name": "G. Forestier"}], "citations": [{"paperId": "4318b7c1e56fbd2572af1b38a62ddabf316f418c", "title": "Finding Foundation Models for Time Series Classification with a PreText Task"}]}
