{"paperId": "5275b008c018ede1804d5212e67371868473fcb4", "publicationVenue": {"id": "9c697407-48a8-4649-a918-9903388f06e8", "name": "Physica Scripta", "type": "journal", "alternate_names": ["Phys Scr"], "issn": "0031-8949", "url": "http://www.iop.org/EJ/journal/1402-4896", "alternate_urls": ["http://www.physica.org/", "http://iopscience.iop.org/1402-4896"]}, "title": "Four-dimensional Hindmarsh–Rose neuron model with hidden firing multistability based on two memristors", "abstract": "Since memristors can be used to describe electromagnetic induction effects, this paper proposes a novel 4D HindMarsh-Rose (HR) neuron model based on two flux-controlled memristors to show complex dynamics of neuronal electrical activity. It has no equilibrium point, revealing hidden dynamical behaviors. The complex dynamics of the system are illustrated by phase portraits, the time sequences, bifurcation diagrams, and Lyapunov exponents spectra. The presented 4D HR neuron model can produce coexisting multiple hidden firing patterns, for instance, periodic spiking, chaotic spiking, transient chaotic spiking, periodic bursting, chaotic bursting, transient chaotic bursting, stochastic bursting, and transient stochastic bursting. Besides, rich nonlinear dynamics, such as anti-monotonicity and initial offset boosting, are also found. Finally, Multisim circuit simulation is performed and the results are in accordance with numerical simulation.", "venue": "Physica Scripta", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2022-10-12", "journal": {"name": "Physica Scripta", "volume": "97"}, "authors": [{"authorId": "2140364574", "name": "Shaohui Yan"}, {"authorId": "2180539953", "name": "Yuyan Zhang"}, {"authorId": "2149471419", "name": "Yu Ren"}, {"authorId": "2131554479", "name": "Xi Sun"}, {"authorId": "2150250705", "name": "Ertong Wang"}, {"authorId": "2114791584", "name": "Zhenlong Song"}], "citations": [{"paperId": "57208316be64800a1195caad0afde8e7e21818e8", "title": "Design of a Novel Chaotic System Based on Hyperbolic Cosine Magnetic Memory Resistor"}, {"paperId": "d9adec49ae5909df07f158e7d6c0c5b8968be5c1", "title": "Chaotic bursting patterns induced by transient chaos in a smooth three-dimensional dynamic model"}, {"paperId": "1caf3c04348e2eca065f12e19b9b1082f92c099d", "title": "Design of a new four-dimensional chaotic system and its application to color image encryption"}, {"paperId": "aded5d877721a8866f0cbf03cacf699f76b0e33b", "title": "A new locally active memristor and its chaotic system with infinite nested coexisting attractors"}]}
