{"paperId": "52829da18e06f337c8ea9bfcafb99ac272456414", "publicationVenue": {"id": "2c8bc0de-2560-43f2-b4a9-de67ce6a3100", "name": "Logistics", "issn": "2305-6290", "alternate_issns": ["2768-4458"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1047852", "alternate_urls": ["https://www.mdpi.com/journal/logistics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1047852", "https://www.jstor.org/journal/logistics"]}, "title": "Food Supply Chain Transformation through Technology and Future Research Directions—A Systematic Review", "abstract": "Background: Digital and smart supply chains are reforming the food chain to help eliminate waste, improve food safety, and reduce the possibility of a global food catastrophe. The globe currently faces numerous food-related issues, ranging from a lack of biodiversity to excessive waste, and from ill health caused by excessive consumption to widespread food insecurity. It is time to look back at how technology has tackled food supply-chain challenges related to quality, safety, and sustainability over the last decade. Moreover, continuous transformations of the food supply chain into a more sustainable business model with utmost resilience is the need of the hour due to COVID-19 disruptions. Method: This study aimed to systematize literature (2010–2021) in the described context and propose a future research direction, with the assistance of a systematic review and bibliometric analysis on the research agenda proposed above. Results: The findings reveal that technological Industry 4.0 (IR 4.0) tools face specific barriers due to the scope and objective of the application. Conclusion: The Internet of Things has received more attention than any other IR 4.0 tool. More integration between the specialized tools is needed to address this issue. Furthermore, the authors have proposed a food supply chain-based operational framework on technological inclusion to facilitate the roadmap for food supply chain 4.0 for more resilience and food supply chain viability.", "venue": "Logistics", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-11-25", "journal": {"name": "Logistics"}, "authors": [{"authorId": "1383285382", "name": "Ahmed Zainul Abideen"}, {"authorId": "2440977", "name": "V. Sundram"}, {"authorId": "9518910", "name": "J. Pyeman"}, {"authorId": "9316349", "name": "Abdul Kadir Othman"}, {"authorId": "1919821", "name": "S. Sorooshian"}], "citations": [{"paperId": "4c76316538d52830b1b3bbb7ce6baff444fe7b7b", "title": "Leveraging supply chain collaboration with digital technologies for supply chain performance: an empirical investigation of Indian meat industries"}, {"paperId": "506d454edefe97984fc7a476a845b4fcd1a64480", "title": "Measuring the Broader Value Proposition of Digital Transformation in Supply Chains"}, {"paperId": "1c01decd3e85121e6213366ebb93e4396ce6fe0b", "title": "Optimization of the sustainable food supply chain with integrative data envelopment analysis approach"}, {"paperId": "333e408b829302d1ea2fae1d30f81d55c33d5509", "title": "Exploring the role of blockchain technology in modern high-value food supply chains: global trends and future research directions"}, {"paperId": "aec43914737177b0fd07d112144127c49e5098e4", "title": "Integrating farmers’ perception of sustainable agricultural technologies towards the development of sustainable tea production in China"}, {"paperId": "18ffba5a7a1bb3aee02397cda70c8ff14b183774", "title": "Consumers’ Marketing Channel Choice and the Impact on Logistics and Operations: A Systematic Literature Review of the Fresh Food and Grocery Sector"}, {"paperId": "b82e67c028725c63be2c06f4f188dd54ef45c708", "title": "Supply Chain Innovation Research: A Bibliometric Network Analysis and Literature Review"}, {"paperId": "4457cff1c174dc0d7c3f26b7a23abe01e42458c0", "title": "Fertilizer Logistics in Brazil: Application of a Mixed-Integer Programming Mathematical Model for Optimal Mixer Locations"}, {"paperId": "61e2267daec79ca6fa2ff0126277fbcf35714b0c", "title": "Integration of lean manufacturing and factory physics in an Industry 4.0 roadmap for augmenting operational performance"}, {"paperId": "4277c7002ebdf5f881cc5f69971d10c5dfe17973", "title": "Do We Perform Systematic Literature Review Right? A Scientific Mapping and Methodological Assessment"}, {"paperId": "8c2ce73ea33323bb47a375df0b09e0ef988c9ac5", "title": "Waste minimization in agri-food supply chain: perspective for sustainable development"}, {"paperId": "b06c392aab22519025cf9982d0f1ce5cd951da56", "title": "The Digitalization Paradigm: Impacts on Agri-Food Supply Chain Profitability and Sustainability"}, {"paperId": "b48a495a4297f0abd257302fe4dab695e3227156", "title": "Challenges and opportunities for agri-fresh food supply chain management in India"}, {"paperId": "87620ada3ba7a0b3ca7e46b15b990f3fda9c0525", "title": "Mathematical depiction of costing perspectives allied with the dynamics of processed food supply chain"}, {"paperId": "3177bcc30fb5d8f9fe821440b25eb630f5cbcc38", "title": "Towards the Smart Sustainable and Circular Food Supply Chains Through Digital Technologies"}, {"paperId": "5b4f794894779baf7e3e96f10cef2d4ad024069e", "title": "A review on post-COVID-19 impacts and opportunities of agri-food supply chain in Malaysia"}, {"paperId": "70730556809848e44d44eeee9b41e0a024ecd997", "title": "Collaborative Insights on Horizontal Logistics to Integrate Supply Chain Planning and Transportation Logistics Planning – A Systematic Review and Thematic Mapping"}, {"paperId": "3e6ba2d2048556194c82222a69ee376af7a54f77", "title": "Smallholder Farming during COVID-19: A Systematic Review Concerning Impacts, Adaptations, Barriers, Policy, and Planning for Future Pandemics"}, {"paperId": "ccf1fce60de1c84e34ed15a90364322303b0d8f2", "title": "Modelling and Forecasting Fresh Agro-Food Commodity Consumption Per Capita in Malaysia Using Machine Learning"}, {"paperId": "aa60eafc86a0467fbc95db3e8fcc37e9acf3c185", "title": "Improved Food Supply Chain Forecasting Management Using IoT and Machine Learning"}, {"paperId": "d71d228f876d84365cbf2d5443f5aed54ace96ee", "title": "Methane Biogas Production in Malaysia: Challenge and Future Plan"}, {"paperId": "d3eabb04c7e1ff90b9d7854ae031f636ca06fd27", "title": "Good Practices on Reducing Food Waste Throughout the Food Supply Chain"}, {"paperId": "10801d2501799427234b9a8124e6810444f65582", "title": "Big Data Applications in Food Supply Chain Management: A Conceptual Framework"}]}
