{"paperId": "528bdbe171ca7ed4d0ec722a3fb773610e250788", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "No data left behind: real-time insights from a complex data ecosystem", "abstract": "The typical enterprise data architecture consists of several actively updated data sources (e.g., NoSQL systems, data warehouses), and a central data lake such as HDFS, in which all the data is periodically loaded through ETL processes. To simplify query processing, state-of-the-art data analysis approaches solely operate on top of the local, historical data in the data lake, and ignore the fresh tail end of data that resides in the original remote sources. However, as many business operations depend on real-time analytics, this approach is no longer viable. The alternative is hand-crafting the analysis task to explicitly consider the characteristics of the various data sources and identify optimization opportunities, rendering the overall analysis non-declarative and convoluted. Based on our experiences operating in data lake environments, we design System-PV, a real-time analytics system that masks the complexity of dealing with multiple data sources while offering minimal response times. System-PV extends Spark with a sophisticated data virtualization module that supports multiple applications - from SQL queries to machine learning. The module features a location-aware compiler that considers source complexity, and a two-phase optimizer that produces and refines the query plans, not only for SQL queries but for all other types of analysis as well. The experiments show that System-PV is often faster than Spark by more than an order of magnitude. In addition, the experiments show that the approach of accessing both the historical and the remote fresh data is viable, as it performs comparably to solely operating on top of the local, historical data.", "venue": "ACM Symposium on Cloud Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-09-24", "journal": {"name": "Proceedings of the 2017 Symposium on Cloud Computing"}, "authors": [{"authorId": "1943226", "name": "M. Karpathiotakis"}, {"authorId": "2327080", "name": "Avrilia Floratou"}, {"authorId": "143972996", "name": "Fatma Özcan"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "d28df6acd26036102e74fbc4bc759ccf5c2c3eae", "title": "In-Situ Cross-Database Query Processing"}, {"paperId": "81a480b7bbe41fce3122dd3b76d432da4948b9da", "title": "Learning to optimize federated queries"}, {"paperId": "1a5c333296ff1555e0dafc9a576c51b4d213b6df", "title": "Abordagem para integração automática de dados estruturados e não estruturados em um contexto Big Data"}, {"paperId": "363d2f2b25dfc3dbe916b6fb23c78d47df95e306", "title": "Multi-engine Analytics with IReS"}, {"paperId": "c18ecaabd4609b1560ed75e57659f43bf45989e6", "title": "E-Scan: Consuming Contextual Data with Model Plugins"}, {"paperId": "2ae781dee1ade82598ea824d877d08df92185f54", "title": "Building Learned Federated Query Optimizers"}, {"paperId": "58ab851c75e6be7097db097f91a32b889856d805", "title": "Real-Time Business Intelligence and Analytics: International Workshops, BIRTE 2015, Kohala Coast, HI, USA, August 31, 2015, BIRTE 2016, New Delhi, India, September 5, 2016, BIRTE 2017, Munich, Germany, August 28, 2017, Revised Selected Papers"}, {"paperId": "9f291d59b903630ab33c992b43139d6c97d46b04", "title": "Just-in-time Analytics Over Heterogeneous Data and Hardware"}]}
