{"paperId": "5292a725e658175db69c0560ea0f392a2c1e5631", "publicationVenue": {"id": "9aa57e01-2dc2-4422-93b7-2b628326f78c", "name": "Information and Communication Technology Convergence", "type": "conference", "alternate_names": ["International Conference on Information and Communication Technology Convergence", "Inf Commun Technol Converg", "Int Conf Inf Commun Technol Converg", "ICTC"]}, "title": "An Efficient Topology Refining Scheme for Apache Flink", "abstract": "In the past decade, there has been a boom in the volume of data and in the popularity of cloud applications with industry and academia keenly interested in big data analytics, streaming application, and social networking applications. This led to the emergence of real-time distributed stream processing systems such as Flink, Storm, Dataflow, and Samza. These systems process complex queries on streaming data sets to be distributed across multiple worker nodes in a cluster. Few of them provide adequate supports to adapt the topologies of stream processing tasks to changing input workload. We present an intelligent and efficient topology adjustment scheme which allow Flink framework to refine its topology on the basis of incoming workload. It is designed to increase the overall performance by making the refining of topology robust according to incoming workload streams on the fly, while maintaining SLA constraints. Apache Flink distributed processing engine is used as testbed in the paper. Our preliminary results indicate that the proposed system outperforms the existing default framework.", "venue": "Information and Communication Technology Convergence", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 International Conference on Information and Communication Technology Convergence (ICTC)", "pages": "766-770"}, "authors": [{"authorId": "145917478", "name": "Muhammad Hanif"}, {"authorId": "92671954", "name": "Choonhwa Lee"}], "citations": [{"paperId": "5a1fc4a36715c215dd76a3e94d43041b751a5b7e", "title": "Predictive topology refinements in distributed stream processing system"}, {"paperId": "020ff615dd9874cfa81ba5d447586caae76c0022", "title": "Real-Time Search Method for Large-Scale Regional Targets Based on Parallel Google S2 Algorithm"}]}
