{"paperId": "5295b553369efd37d93429c452328813b8d52d2c", "publicationVenue": {"id": "647e2b25-1bff-4e4f-b507-e21dcb081788", "name": "IEEE International Requirements Engineering Conference", "type": "conference", "alternate_names": ["IEEE International Conference on Requirements Engineering", "RE", "IEEE Int Requir Eng Conf", "IEEE Int Conf Requir Eng"], "url": "http://requirements-engineering.org/"}, "title": "Quality Requirements Elicitation by Ideation of Product Quality Risks with Design Thinking", "abstract": "Systematic requirements elicitation leads to higher quality products and reduces product risks. In Quality Engineering and Management, product risk mitigation is a key objective. Especially for new products, risk identification is a creative action. In this paper, we present a quality domain-specific design thinking approach to product risk identification and subsequent quality requirements elicitation. The approach systematically guides product teams within four steps in identifying their product-specific quality requirements and associated risks using ideation methods. Implemented in the form of an open self-service kit for teams, it has been designed for scaling in large enterprises. We validate our approach in a large global automotive OEM environment including automotive mobile online services and products, financial services, as well as IT systems development. The key outcome of the work is a design thinking based requirements elicitation method for product quality risks, as well as an implementation in the form of a self-service kit.", "venue": "IEEE International Requirements Engineering Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE 28th International Requirements Engineering Conference (RE)", "pages": "238-249"}, "authors": [{"authorId": "2890503", "name": "Alexander Poth"}, {"authorId": "2310702", "name": "A. Riel"}], "citations": [{"paperId": "6deef7d5bb83360ea06fad118ac7da20b73103ba", "title": "Industrial Design Structure: a straightforward organizational integration of DFSS and QFD in a new industry and market reality"}, {"paperId": "d3d9cd5c6fb84da79e631677aa38ebd4df349039", "title": "A new approach for quality prediction and control of multistage production and manufacturing process based on Big Data analysis and Neural Networks"}, {"paperId": "35dd57e3a8a0f37da40a6e00b2217b8e59e8d351", "title": "PENERAPAN DESIGN THINKING PADA PERANCANGAN UI/UX MARKETPLACE SISTEM RANTAI PASOK “PANEN- PANEN”"}, {"paperId": "c66f1545b14f11c4f71b770b5ad91172fd9d9c2e", "title": "Are These Requirements Risky: A Proposal of an IoT-Based Requirements Risk Estimation Framework"}, {"paperId": "f831fdc8e6b593d83fccd6aeb281df2153ea196a", "title": "Game-based Sprint retrospectives: multiple action research"}, {"paperId": "f5214312db4c6697b3d53a5c77048c6410fbc31a", "title": "Quality Assurance for Machine Learning – an approach to function and system safeguarding"}, {"paperId": "9f6d436af68b6eb29a481383b1b0d2bd8a1d5054", "title": "The implementation of a digital service approach to fostering team autonomy, distant collaboration, and knowledge scaling in large enterprises"}, {"paperId": "b8f4d6d78bd0f3e768c1e1035fa391d6820008e2", "title": "Systematic Agile Development in Regulated Environments"}, {"paperId": "b730bd3a2a291432169f93656862f018c16eec08", "title": "Scaling agile on large enterprise level with self-service kits to support autonomous teams"}, {"paperId": "4fcde6dc047d8455b880742679d27b40e623102b", "title": "A Systematic Approach to Agile Development in Highly Regulated Environments"}, {"paperId": "ccee0f6ed2407c655ae7994db75292ad3632e6d9", "title": "Self-service kits to scale knowledge to autonomous teams - concept, application and limitations"}]}
