{"paperId": "52a6f4edb11977d8671e1128d9040917201ffd3f", "publicationVenue": {"id": "a2cd6b0b-b127-4ba0-a56e-25a372f54cf9", "name": "British Food Journal", "type": "journal", "alternate_names": ["Br Food J"], "issn": "0007-070X", "url": "https://www.emerald.com/insight/publication/issn/0007-070X", "alternate_urls": ["http://www.emeraldinsight.com/bfj.htm"]}, "title": "Wasted pumpkins: a real Halloween horror story", "abstract": "PurposeThis study aims to understand pumpkin waste awareness among people by converting unstructured quantitative data into insightful information to understand the public's awareness of pumpkin waste during Halloween.Design/methodology/approachTo fulfil the study's purpose, we extracted Halloween-related tweets by employing #halloween and #pumpkin hashtags and then investigated Halloween-related tweets via a topic modelling approach, specifically Latent Dirichlet Allocation. The tweets were collected from the UK between October 25th and November 7th, 2020. The analysis was completed with 11,744 tweets.FindingsThe topic modelling results revealed that people are aware of the pumpkin waste during Halloween. Furthermore, people tweet to reduce pumpkin waste by sharing recipes for using leftover pumpkins.Originality/valueThe study offers a novel approach to convert social media data into meaningful knowledge about public perception of food waste. This paper contributes to food waste literature by revealing people's awareness of pumpkin waste during Halloween using social media analytics. Norm activation model and communicative ecology theory are used for the theoretical underpinning of topic modelling.", "venue": "British Food Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-22", "journal": {"name": "British Food Journal"}, "authors": [{"authorId": "1491651496", "name": "Ebru Surucu-Balci"}, {"authorId": "7802755", "name": "Bercim Berberoglu"}], "citations": [{"paperId": "18006d3749f8d0406a51320f93a01ad0705505be", "title": "A review on biochemical constituents of pumpkin and their role as pharma foods; a key strategy to improve health in post COVID 19 period"}, {"paperId": "659d2694546a0561834e17eff75f084868c49d45", "title": "The role of collaboration in tackling food loss and waste: Salient stakeholder perspective"}]}
