{"paperId": "52b25555f944c240d1a33bb224c63dbc330aafff", "publicationVenue": {"id": "bf4a4b0f-eb61-4109-82ca-5fdd5c2d357f", "name": "International Conference on Teaching, Assessment, and Learning for Engineering", "type": "conference", "alternate_names": ["TALE", "IEEE International Conference on Teaching, Assessment, and Learning for Engineering", "IEEE Int Conf Teach Assess Learn Eng", "Int Conf Teach Assess Learn Eng"]}, "title": "Mobile Application Development to Mitigate the Risk of Earthquake", "abstract": "Indonesia is prone to natural disasters such as an earthquake. Many people are clueless regarding what to do when an earthquake occurs. An earthquake has caused a more devastating outcome due to it being able to lead to other hazards. The idea of developing a mobile application surfaced by reading and receiving inspiration from the previous research. Previous research has been implementing different kinds of ways to alert people regarding the upcoming earthquake. The development of a mobile application to provide a platform that will assist people with information on what to do in times of before, during, and after the earthquake. Therefore, people will have a source that they can turn to when seeking information about the steps to be done when an earthquake occurs. Besides, providing information apropos to earthquakes, the mobile application will send further alerts to the people that are in that specific area. Moreover, people will be able to be aware of the particular areas that they are in. The alerts sent will give information to the people so that they could evacuate to safety as soon as possible before the upcoming earthquake occurs.", "venue": "International Conference on Teaching, Assessment, and Learning for Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Engineering, Technology and Education (TALE)", "pages": "1-5"}, "authors": [{"authorId": "2003035224", "name": "Adeliana Yuwono"}, {"authorId": "119079065", "name": "A. Chrysler"}, {"authorId": "2003047557", "name": "T. Puteri"}, {"authorId": "2260771315", "name": "Harco Leslie"}, {"authorId": "2258737898", "name": "Hendric Spits"}, {"authorId": "2103805009", "name": "Muhammad Arba Adnandi"}, {"authorId": "2069090979", "name": "Ihsan Maulana"}], "citations": [{"paperId": "8a6ad4530c1763104bc31ec073d0b86a7634820e", "title": "Earthquake Early Warning (EEW) System: System Architecture, Data Modelling, and User Interface Design"}]}
