{"paperId": "52b4576515dcd53f40ab0637d93f7d4350b9adc0", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Quantitative Analysis and Performance Evaluation of Target-Oriented Replication Strategies in Cloud Computing", "abstract": "Data replications effectively replicate the same data to various multiple locations to accomplish the objective of zero loss of information in case of failures without any downtown. Dynamic data replication strategies (providing run time location of replicas) in clouds should optimize the key performance indicator parameters, like response time, reliability, availability, scalability, cost, availability, performance, etc. To fulfill these objectives, various state-of-the-art dynamic data replication strategies has been proposed, based on several criteria and reported in the literature along with advantages and disadvantages. This paper provides a quantitative analysis and performance evaluation of target-oriented replication strategies based on target objectives. In this paper, we will try to find out which target objective is most addressed, which are average addressed, and which are least addressed in target-oriented replication strategies. The paper also includes a detailed discussion about the challenges, issues, and future research directions. This comprehensive analysis and performance evaluation based-work will open a new door for researchers in the field of cloud computing and will be helpful for further development of cloud-based dynamic data replication strategies to develop a technique that will address all attributes (Target Objectives) effectively in one replication strategy.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-12", "journal": {"name": "Electronics"}, "authors": [{"authorId": "90141068", "name": "Quadri Waseem"}, {"authorId": "1395289198", "name": "Wan Isni Sofiah Wan Din"}, {"authorId": "145228809", "name": "Sultan S. Alshamrani"}, {"authorId": "27710019", "name": "Abdullah G. Alharbi"}, {"authorId": "40034244", "name": "A. Nazir"}], "citations": [{"paperId": "6df84601499e333b1eebd4e6d0b3df3365b5d8f7", "title": "Carbon footprint and service coverage tradeoffs in geo-diverse sites"}, {"paperId": "8aa4cae691d4d195372a3453e1d66035e3b61c00", "title": "Towards Improving Cloud Security and Performance by using Proposed Controlled Replication Model"}]}
