{"paperId": "52b8582a9f49a313617aec19e815e58252041956", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Big data applications on the Internet of Things: A systematic literature review", "abstract": "The Internet of Things (IoT) is a system of physical objects embedded with various sensors to receive information, software, chips, and other technologies that allow connecting and transferring data to other devices through the Internet without human intervention. As the number of smart devices increase, IoT has started to be applied in many more fields. Therefore, there is a lot of information that should be processed. To manage this amount of data, some researchers proposed the usage of big data techniques. Big data are a collection of structured and unstructured data incoming with a high speed and large amounts. This paper investigates big data applications in IoT to comprehend the different published approaches using the systematic literature review (SLR) technique. This paper systematically studies the latest research methods on big data in IoT approaches published between 2016 and August 2021. A methodical taxonomy is shown for big data in IoT‐related fields consistent with the content of existing articles chosen with the SLR process in this research like healthcare, smart city, algorithms, industry, and general aspects in those environments. The advantages and drawbacks of each paper are presented, with specific proposals for stating their pros and cons open issues and advising possible research challenges in big data implementation in the IoT. The evaluation factors of big data applications in IoT are distributed as follows: security (18%), throughput (17%), cost (17%), energy consumption (15%), reliability (15%), response time (9%), and availability (9%).", "venue": "International Journal of Communication Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-10", "journal": {"name": "International Journal of Communication Systems", "volume": "34"}, "authors": [{"authorId": "1712105491", "name": "Ulkar Ahmadova"}, {"authorId": "11509090", "name": "M. Mustafayev"}, {"authorId": "1452681371", "name": "Behnam Kiani Kalejahi"}, {"authorId": "2828421", "name": "Saeed Saeedvand"}, {"authorId": "2101287659", "name": "A. Rahmani"}], "citations": [{"paperId": "fd3ff755f980badfedd582293acfbf0555b73995", "title": "Digital transformation, intelligent device utilization, and carbon emission reduction"}, {"paperId": "ea76264b9157d1731456c1cb2cb351936973a448", "title": "Big data analytics deep learning techniques and applications: A survey"}, {"paperId": "1f0f3e0a614c4b7d5b0dbafa1534182ba9d4e838", "title": "Role of Big Data Analytics in the Internet of Things: A Comprehensive Survey"}, {"paperId": "6497495270b20c9eb15f4394863e807769be76f3", "title": "Dilemma and countermeasures of community sports center governance under the background of big data and Internet of Things"}, {"paperId": "cc16cccbcb837ef8c30ed4189db25690d70e4fef", "title": "A comprehensive and systematic literature review on the big data management techniques in the internet of things"}, {"paperId": "075c4fd606e430723cf65d59f2e2811f4b1ea7d2", "title": "Internet of Things data management: A systematic literature review, vision, and future trends"}, {"paperId": "61417c40bb933b77edcb6ab40eaa1b7e646c8f18", "title": "Geographical POI recommendation for Internet of Things: A federated learning approach using matrix factorization"}]}
