{"paperId": "52c17a191cd4d096e3574a96b738a9b4bd18900b", "publicationVenue": {"id": "18cb41bf-d23d-4c47-a30d-3f1ef6abfb1b", "name": "IoT", "issn": "2624-831X", "url": "https://www.mdpi.com/journal/IoT"}, "title": "An IoT- and Cloud-Based E-Waste Management System for Resource Reclamation with a Data-Driven Decision-Making Process", "abstract": "IoT-based smart e-waste management is an emerging field that combines technology and environmental sustainability. E-waste is a growing problem worldwide, as discarded electronics can have negative impacts on the environment and public health. In this paper, we have proposed a smart e-waste management system. This system uses IoT devices and sensors to monitor and manage the collection, sorting, and disposal of e-waste. The IoT devices in this system are typically embedded with sensors that can detect and monitor the amount of e-waste in a given area. These sensors can provide real-time data on e-waste, which can then be used to optimize collection and disposal processes. E-waste is like an asset to us in most cases; as it is recyclable, using it in an efficient manner would be a perk. By employing machine learning to distinguish e-waste, we can contribute to separating metallic and plastic components, the utilization of pyrolysis to transform plastic waste into bio-fuel, coupled with the generation of bio-char as a by-product, and the repurposing of metallic portions for the development of solar batteries. We can optimize its use and also minimize its environmental impact; it presents a promising avenue for sustainable waste management and resource recovery. Our proposed system also uses cloud-based platforms to help analyze patterns and trends in the data. The Autoregressive Integrated Moving Average, a statistical method used in the cloud, can provide insights into future garbage levels, which can be useful for optimizing waste collection schedules and improving the overall process.", "venue": "IoT", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-06", "journal": {"name": "IoT"}, "authors": [{"authorId": "1596653376", "name": "Mithila Farjana"}, {"authorId": "52640761", "name": "Abubakar Fahad"}, {"authorId": "2221954107", "name": "Syed Eftasum Alam"}, {"authorId": "3309048", "name": "Md. Motaharul Islam"}], "citations": [{"paperId": "eaf3152093cbdd00e4b004b70aa953ce3f1322fd", "title": "Optimizing E-waste management: Deep learning classifiers for effective planning"}, {"paperId": "6d588225b3e2e7f5b51b961c005b9962590d4f3c", "title": "Enhancing Smart City Waste Management through LBBOA based RIAN Classification"}, {"paperId": "a3b2bb998e9922bfe80047d7fde7c1e1dc4edb14", "title": "Embedded System for E-Waste Recognition Using Computer Vision"}, {"paperId": "d1e51f1832dca79ae2c8d16e4685244bdaf4a1b5", "title": "EWasteNet: A Two-Stream Data Efficient Image Transformer Approach for E-Waste Classification"}, {"paperId": "e759a5aab368e2aca67783f649256fb9cb001080", "title": "Smart e-waste management system utilizing Internet of Things and Deep Learning approaches"}, {"paperId": "f4e5773935ebe4804d80d122e233f00baa7dc57c", "title": "MULTIDISCIPLINARY TECHNOVATION Enhancing Smart City Waste Management through LBBOA based RIAN Classification"}]}
