{"paperId": "52d6fe05db0af9874e8302972d0920fdf625fc98", "publicationVenue": {"id": "ba1036bb-c3e0-4ae6-ba5c-d92dce9eb26c", "name": "PROBLEMS IN PROGRAMMING", "type": "journal", "alternate_names": ["PROBL PROGRAM"], "issn": "1727-4907", "url": "http://dspace.nbuv.gov.ua/handle/123456789/177"}, "title": "Specialized software for simulating dynamic virtual machine consolidation", "abstract": "For many cloud service providers, virtual machines remain the basic technology for computing virtualization. Virtual machines are used both to host application software and to implement container virtualization. Widespread use of virtual machines develops specialized software to determine the impact of model parameters on the quality of the consolidation process, which will prevent experimental research in production to evaluate new cloud data center resource management strategies. In recent years, there were many approaches in literature that offers various sets of software tools and frameworks for modeling data center processes, providing a platform and the necessary building blocks to optimize the process of consolidation of virtual machines. Models and software tools for modeling data center resource management processes are usually not exhaustive and solve a specific problem or management task. The specialized simulation software presented in the paper allows to investigate different control modes of virtual machines dynamic consolidation, provides a wide range of logging and debugging information using text and MS Excel files, such as performance indicators and workload diagrams, and allows to determine the optimal model parameters for various modes of data center operation, minimizing the number of active physical servers and reducing the number of SLA violations.", "venue": "PROBLEMS IN PROGRAMMING", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-01", "journal": {"name": "PROBLEMS IN PROGRAMMING"}, "authors": [{"authorId": "9035885", "name": "E. Zharikov"}, {"authorId": "2100651953", "name": "S. Telenyk"}], "citations": []}
