{"paperId": "52ec8dccb701f731a0fcfb904d9cdd3bd1d48a41", "publicationVenue": null, "title": "Developing a Smart Healthy City Using Twitter Big Data by Modified Deep Belief Network", "abstract": "Big data, which is fueled by IT, opens up fresh avenues for urban renewal. The integration and exchange of data, as well as the optimization of the rudimentary standards of smart cities, are greatly improved by the application of several scientific advances, including the (IoT) for data collecting analytics. The idea underlying the key study issue in the creation of keen cities, educational institutions, industrial establishments, and commercial enterprises during the last several years. The (IoT) and the services it enables are crucial to developing environmentally friendly metropolises. Several studies have evaluated and shown that AI is the most effective method for enhancing smart cities' fire detection effectiveness. In contrast, people in smart cities are increasingly turning to SNS to learn about the latest updates on the epidemic, discuss it with others, and report their own experiences with it. In this study, we offer a framework for the analysis of big data from social media platforms like Twitter in order to predict the spread of the COVID-19 virus in a Smart Sustainable Healthy City. After collecting over 10,000 Tweets over the course of two months, researchers found that 38% of users were between the ages of 18 and 29, and 26% were between the ages of 30 and 49. About 56% are male and 44% are female. The tweets are sorted using Natural Language Processing (NLP). For tweet categorization, we utilise a modified version of the Deep Belief Network (MDBN), with the tweaks made to the weights of the original network. Election Algorithm is responsible for carrying this out (EA). Based on the findings, a cluster of epidemic cases was anticipated seven days before the verified cases. The indication for this was 0.96. By analysing data from SNS platforms, we were able to foresee.", "venue": "2023 International Conference on Network, Multimedia and Information Technology (NMITCON)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-09-01", "journal": {"name": "2023 International Conference on Network, Multimedia and Information Technology (NMITCON)", "pages": "1-12"}, "authors": [{"authorId": "2259997224", "name": "Giridhar Kumar G"}, {"authorId": "2127177908", "name": "Suneetha V"}, {"authorId": "2260007793", "name": "Salini Suresh"}, {"authorId": "32636848", "name": "P. Pareek"}], "citations": []}
