{"paperId": "52f9346aa9a83c24cdd84edbde7e6fc571a9ae5a", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Hybrid Low-Power Wide-Area Mesh Network for IoT Applications", "abstract": "The recent advancement of the Internet of Things (IoT) enables the possibility of data collection from diverse environments using IoT devices. However, despite the rapid advancement of low-power communication technologies, the deployment of IoT networks still faces many challenges. In this article, we propose a hybrid, low-power, wide-area network (LPWAN) structure that can achieve wide-area communication coverage and low-power consumption on IoT devices by utilizing both sub-GHz long-range radio and 2.4-GHz short-range radio. Specifically, we constructed a low-power mesh network with LoRa, a physical-layer standard that can provide long-range (kilometers) point-to-point communication using custom time-division multiple access (TDMA). Furthermore, we extended the capabilities of the mesh network by enabling ANT, an ultralow-power, short-range communication protocol to satisfy data collection in dense device deployments. Third, we demonstrate the performance of the hybrid network with two real-world deployments at the Purdue University campus and at the university-owned farm. The results suggest that both networks have superior advantages in terms of cost, coverage, and power consumption vis-à-vis other IoT solutions, like LoRaWAN.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-22", "journal": {"name": "IEEE Internet of Things Journal", "pages": "901-915", "volume": "8"}, "authors": [{"authorId": "1557288165", "name": "Xiaofan Jiang"}, {"authorId": null, "name": "Heng zhang"}, {"authorId": "19231229", "name": "E. Yi"}, {"authorId": "33089303", "name": "N. Raghunathan"}, {"authorId": "1929814", "name": "C. Mousoulis"}, {"authorId": "2228303", "name": "S. Chaterji"}, {"authorId": "1946243", "name": "D. Peroulis"}, {"authorId": "3356837", "name": "A. Shakouri"}, {"authorId": "1679009", "name": "S. Bagchi"}], "citations": [{"paperId": "10cfd431fcfe3c8335e56b8ecdcbe58254de6148", "title": "Distance-Based Queuing for Scalable and Reliable Linear Wireless Sensor Networks in Smart Cities"}, {"paperId": "dbe670543c90330a2188a95193ae1889eecdcc6f", "title": "Multi-Hop and Mesh for LoRa Networks: Recent Advancements, Issues, and Recommended Applications"}, {"paperId": "adc437a800af904d2df3deea23da385161ed22d5", "title": "Optimizing RF Energy Harvesting for IoT Devices: Impedance Matching and Voltage Multiplier Solutions"}, {"paperId": "eefc9aa87c8bcf4910d09c4a3196dcaf931f9125", "title": "Intelligent Deep Learning and Softmax Routing for Energy-Efficient Wireless Sensor Networks in Public Space Design"}, {"paperId": "660775dd72f1f32d7305b8a8cf65539e0d4ca529", "title": "Topological Evaluation of Realistic Mobility Models for Spontaneous Wireless Networks Using Graph Theory Metrics"}, {"paperId": "349a0d7145e67e31fe9d3485b6686a336ced72a7", "title": "Design and implementation of hybrid low power wide area network architecture for IoT applications"}, {"paperId": "8b5314c1922f64c1a3101147084c3a50613cf3df", "title": "A Low-Cost Low-Power LoRa Mesh Network for Large-Scale Environmental Sensing"}, {"paperId": "f9af1795e3a947b9dcd6dc83f81a981d322b482b", "title": "A Distributed Testbed for Wireless Embedded Devices"}, {"paperId": "387bba1bb95f970525c24bc587311d9216a3f82a", "title": "A Connected Vehicle System with High-Availability and Low-Bandwidth Requirement for First Responders"}, {"paperId": "a444ec91b6c5198e23346f627053023c863cc79f", "title": "LoRaHop: Multihop Support for LoRaWAN Uplink and Downlink Messaging"}, {"paperId": "c22b8050868ff495f9b38e2fdc7e46c6d8c1f8b3", "title": "A Resilient LoRa-Based Solution to Support Pervasive Sensing"}, {"paperId": "996e00ea310405a85de2f60d731de5ee09ab67b6", "title": "Cooperative Multistation Secure Transmission in HF Skywave Massive MIMO Communications for Wide-Area IoT Applications"}, {"paperId": "61e45da6ac7e7a57a62615f9ff4bfe1fbcaf9926", "title": "EESMR: Energy Efficient BFT---SMR for the masses"}, {"paperId": "f67b9e4ceae91a5d38c2354c2d3fb36ea816bee2", "title": "The Application of Wireless Underground Sensor Networks to Monitor Seepage inside an Earth Dam"}, {"paperId": "bf48f2e0f0cf829733ed514c333c84718cf883ac", "title": "An Energy-Efficient LoRa Multi-Hop Protocol through Preamble Sampling"}, {"paperId": "47cfcc392cb51c20458fc540e6a435816c67ef01", "title": "An Open Dataset of Sensor Data from Soil Sensors and Weather Stations at Production Farms"}, {"paperId": "351cdadbb4e4ae9b983faa1d676b5b94984dc0c6", "title": "Deep Reinforcement Learning-Based Energy Efficiency Optimization for Flying LoRa Gateways"}, {"paperId": "5139392fddd4a5abbe98f9e9adee59f866300e5f", "title": "A Wide Area Network Design and Architecture using Cisco Packet Tracer"}, {"paperId": "2eb3f46791002f79731b264b1bca5e99afe60ebf", "title": "Secrecy Rate Optimization in Nonlinear Energy Harvesting Model-Based mmWave IoT Systems With SWIPT"}, {"paperId": "8e6478bd4bcd21eabf38262447b43cf8b9615c48", "title": "A Hierarchy-Based Energy-Efficient Routing Protocol for LoRa-Mesh Network"}, {"paperId": "cc413f5865c60e4be2fb61cbe5f0205334d0c0b3", "title": "Secure and Sustainable Framework for Cattle Recognition Using Wireless Multimedia Networks and Machine Learning Techniques"}, {"paperId": "428946962a56d501896ec484768577bc1d90fb73", "title": "An IoT-based intelligent irrigation system with data fusion and a self-powered wide-area network"}, {"paperId": "a44b6f6943a86b3b3ec0ff4adbca5bc636930d36", "title": "Smart-Hop: Low-Latency Multi-hop Networking for LoRa"}, {"paperId": "534a20bd80cacaf8a4edc467f26be2bebc0ef488", "title": "IoT-Enabled Smart Agriculture: Architecture, Applications, and Challenges"}, {"paperId": "2e23ced4d46e55c3326af6f1f861a85a4707f1c6", "title": "A Survey on Scalable LoRaWAN for Massive IoT: Recent Advances, Potentials, and Challenges"}, {"paperId": "fd9831a712a1b32aadfcb9eed65a3a23431f6549", "title": "A mesh network case study for digital audio signal processing in Smart Farm"}, {"paperId": "578575ea8a669fa10a3234596f5800b5a6ee3d95", "title": "Channel Occupancy Measurements in 868 MHz ISM Band in Residential Areas"}, {"paperId": "15826649a3a3d6017cc086ba41904e67f5ff2c14", "title": "A data-driven approach to increasing the lifetime of IoT sensor nodes"}, {"paperId": "d2efbd381bb0b493fa7aa0d0a33ecf9d734ef6cd", "title": "Construction of a Wireless Sensing Network System for Leisure Agriculture for Cloud-Based Agricultural Internet of Things"}, {"paperId": "a3f16b54cfabf56fdf7614d5e9eb19d0b8c882a4", "title": "ORPHEUS: Living Labs for End-to-End Data Infrastructures for Digital Agriculture"}, {"paperId": "e4ff2c85628ca146a33e6fb7c3f3295a8664068a", "title": "Study on a Novel Network Nod Monitoring System based on the Spherical Multi-robot"}, {"paperId": "ebffd7af636aea92d50ee79308a299135c7a1b41", "title": "Network-Coded Cooperative LoRa Network With D2D Communication"}, {"paperId": "57aeccf85de0ca17a255da28f7109d073f186671", "title": "An Overview of Machine Learning-Based Energy-Efficient Routing Algorithms in Wireless Sensor Networks"}, {"paperId": "e107500dbfff5023bb38eab0557eb794e6427f42", "title": "Monitoring Real Time Security Attacks for IoT Systems Using DevSecOps: A Systematic Literature Review"}, {"paperId": "296774554723f6891a70cfd63ab310d7d2cf44d2", "title": "Design and Evaluation of Routing Artifacts as a Part of the Physical Internet Framework"}, {"paperId": "0acd6d5dfdb0f89fdbaed0505e1830f73d926de8", "title": "JANUS: Benchmarking Commercial and Open-Source Cloud and Edge Platforms for Object and Anomaly Detection Workloads"}, {"paperId": "ed7e379ed4659f0fc31bfc06e5f8fa7dd858b31a", "title": "Context-Aware Collaborative Intelligence With Spatio-Temporal In-Sensor-Analytics for Efficient Communication in a Large-Area IoT Testbed"}, {"paperId": "3d64318b7094599da90eb1ca5c63942d5fd91650", "title": "Trajectory Optimization and Power Allocation for Cell-Free Satellite-UAV Internet of Things"}, {"paperId": "9fa3a0f33e3fb5512737f8dbea2a50d06a03829d", "title": "IoT adoption in agriculture: a systematic review"}, {"paperId": "73c11ecf85245ed120811c0bf5d28e92dd03cc00", "title": "Wireless Sensor Network as a Mesh: Vision and Challenges"}, {"paperId": "acbc2b93bc2b06a7169bc9ad318f12aaaece53ce", "title": "ACCEPTED FROM OPEN CALL"}]}
