{"paperId": "531d1c404a533eeadda228baca3e75caf90f5322", "publicationVenue": {"id": "8ecc7f6b-513e-420d-9531-255b48a99a8a", "name": "Micromachines", "type": "journal", "issn": "2072-666X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-165882", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-165882", "https://www.mdpi.com/journal/micromachines"]}, "title": "TinyML: Enabling of Inference Deep Learning Models on Ultra-Low-Power IoT Edge Devices for AI Applications", "abstract": "Recently, the Internet of Things (IoT) has gained a lot of attention, since IoT devices are placed in various fields. Many of these devices are based on machine learning (ML) models, which render them intelligent and able to make decisions. IoT devices typically have limited resources, which restricts the execution of complex ML models such as deep learning (DL) on them. In addition, connecting IoT devices to the cloud to transfer raw data and perform processing causes delayed system responses, exposes private data and increases communication costs. Therefore, to tackle these issues, there is a new technology called Tiny Machine Learning (TinyML), that has paved the way to meet the challenges of IoT devices. This technology allows processing of the data locally on the device without the need to send it to the cloud. In addition, TinyML permits the inference of ML models, concerning DL models on the device as a Microcontroller that has limited resources. The aim of this paper is to provide an overview of the revolution of TinyML and a review of tinyML studies, wherein the main contribution is to provide an analysis of the type of ML models used in tinyML studies; it also presents the details of datasets and the types and characteristics of the devices with an aim to clarify the state of the art and envision development requirements.", "venue": "Micromachines", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-29", "journal": {"name": "Micromachines", "volume": "13"}, "authors": [{"authorId": "2065587449", "name": "N. Alajlan"}, {"authorId": "4599807", "name": "Dina M. Ibrahim"}], "citations": [{"paperId": "7053126b8e652343d0aff9375ac7da595259b69b", "title": "A Portable Tool for Spectral Analysis of Plant Leaves That Incorporates a Multichannel Detector to Enable Faster Data Capture"}, {"paperId": "6669c77e243bf3cc0da42a3ed5a1c64f127b595a", "title": "Reducing the Power Consumption of Edge Devices Supporting Ambient Intelligence Applications"}, {"paperId": "4a40dfe70875b8b6028f2b40064e5bb39ac59b9f", "title": "FlipBit: Approximate Flash Memory for IoT Devices"}, {"paperId": "7783f39f96fcde123d8c9afb2a751f5f4d1baee5", "title": "Compiler-Based Memory Encryption for Machine Learning on Commodity Low-Power Devices"}, {"paperId": "843b6b1d57f3e0d0d6473d401480955594004b1b", "title": "Noninvasive Diabetes Detection through Human Breath Using TinyML-Powered E-Nose"}, {"paperId": "f641b9d771427ad995359d9747ec613bafa4afe9", "title": "Leveraging pervasive computing for ambient intelligence: A survey on recent advancements, applications and open challenges"}, {"paperId": "e4f58a91670f1df6ec023f53c11b8b26acbf60bb", "title": "TinyML Algorithms for Big Data Management in Large-Scale IoT Systems"}, {"paperId": "55650ca71b51587113f6386e5d9f4cc8c31e3b2e", "title": "TinyML Applications, Research Challenges, and Future Research Directions"}, {"paperId": "b164e32869472e6951b8e6258b4e504e44c053cb", "title": "Implementation of blockchain technology in integrated IoT networks for constructing scalable ITS systems in India"}, {"paperId": "4af975013dae54ec47b38699f31321f765017a5c", "title": "Evaluation of a Machine Learning Algorithm to Classify Ultrasonic Transducer Misalignment and Deployment Using TinyML"}, {"paperId": "7ad3f497be7a1923cbb309c439e8a94cf93ef290", "title": "Denial-of Service (DoS) Attack Detection Using Edge Machine Learning"}, {"paperId": "33dc8d233f813acf60cbc0711970bb7a94913e79", "title": "Design and Optimization of Low-Power VLSI Circuits for IoT Devices"}, {"paperId": "7abd4564168d90c9397064f76036b1a879b82c38", "title": "Object Detection at Edge Using TinyML Models"}, {"paperId": "bf0091fb1ed16c7e7db6c8e23b1675fa44e256a9", "title": "Efficient IoT Inference via Context-Awareness"}, {"paperId": "389ecabdfa5ea2b97f62af9562b8d66d61c18554", "title": "A multi-microcontroller-based hardware for deploying Tiny machine learning model"}, {"paperId": "b462c324cc757f8529b739a0314ac176632c175b", "title": "Heart Rate Measurement Using the Built-In Triaxial Accelerometer from a Commercial Digital Writing Device"}, {"paperId": "8e5c3d76a9d160e87765727f5c817aea151ed900", "title": "A Machine Learning-Oriented Survey on Tiny Machine Learning"}, {"paperId": "1cf76eab2f37c41745987de9231ad73e247068e1", "title": "IoT and Edge Computing Using Virtualized Low-Resource Integer Machine Learning with Support for CNN, ANN, and Decision Trees"}, {"paperId": "ef0f06948edb7083a9d25eba8e79c29bd0b5f23c", "title": "Synergy of Patent and Open-Source-Driven Sustainable Climate Governance under Green AI: A Case Study of TinyML"}, {"paperId": "eababb6e081a6d68f170043f2d2c8f9f74832876", "title": "Tiny Machine Learning Virtualization for IoT and Edge Computing using the REXA VM"}, {"paperId": "c82234efd7335214304f51454083f9b4b631db61", "title": "Implementation of Tiny Machine Learning (TinyML) as Pre-distorter for High Power Amplifier (HPA)Linearization of SDR-based MIMO-OFDM"}, {"paperId": "ffdef1e2f8e59fe5ff3c942acff5a9192045efc5", "title": "Design and Implementation of Multi-mode Sensor Signal Processor on FPGA Device"}, {"paperId": "122a5fc9e180e277b1c6568abd6f544c51ecbf9d", "title": "Machine learning-based computation offloading in edge and fog: a systematic review"}, {"paperId": "08cdbcf63f485cf3f8c06c2f8a1ecdf03811559d", "title": "Automated Speaker Independent Visual Speech Recognition: A Comprehensive Survey"}, {"paperId": "b8473ef48319525ace9e3faec2224ca567ee0938", "title": "Enhancement in IoT through Custom Instruction Set Architectures and TinyML: Review"}, {"paperId": "918dba70eaa9675d3070fd98f62d7200f20b5777", "title": "Optimization of Deep Neural Network Model for Embedded Applications: A Case Study of Retinal Vessels Segmentation"}, {"paperId": "615039661d697af3798de3430c6bba3d1726ffb8", "title": "DDD TinyML: A TinyML-Based Driver Drowsiness Detection Model Using Deep Learning"}, {"paperId": "948fbe937bb683a928583dd4f52801bea114bced", "title": "TinyNS: Platform-Aware Neurosymbolic Auto Tiny Machine Learning"}, {"paperId": "b28d7493fe13e1a1a4a9e46e402e822897feb3cf", "title": "TinyML: Tools, Applications, Challenges, and Future Research Directions"}, {"paperId": "d0915fbd674687bf0cabbce00d0407b9dd217ac0", "title": "Computerized Face Mask Detection System Using Deep CNN and Transfer Learning"}, {"paperId": "8a5f18d35ac0b984f88427b639f0a20da1dac146", "title": "Towards energy-aware tinyML on battery-less IoT devices"}, {"paperId": "e997cdd3457a25192e535faadd8f9ae3e48b19a1", "title": "Editorial for the Special Issue on Micro and Smart Devices and Systems"}, {"paperId": "3b09333989550d5d689b5d9967993ac3d03be856", "title": "TinyML for Ultra-Low Power AI and Large Scale IoT Deployments: A Systematic Review"}, {"paperId": "31a9599a24e6808472d3e58055e6577cc6b76bc3", "title": "How TinyML Can be Leveraged to Solve Environmental Problems: A Survey"}, {"paperId": "e0737922b961c6f6a1ba8e73f52bcd8c4689c712", "title": "Adaptive Subsampling for ROI-Based Visual Tracking: Algorithms and FPGA Implementation"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}, {"paperId": "17a87651582fdd552af142521a22c331683f5ac6", "title": "Unlocking Edge Intelligence Through Tiny Machine Learning (TinyML)"}]}
