{"paperId": "532d02b76bf2eb63f597ec0fc02bfa8015581c50", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "EdgeVCD: Intelligent Algorithm-Inspired Content Distribution in Vehicular Edge Computing Network", "abstract": "Vehicular edge computing (VEC), which integrates mobile-edge computing (MEC) into vehicular networks, can provide more capability for executing resource-hungry applications and lower latency for connected vehicles. Distributing the result content to connected vehicles is vital for them to take proper actions based on computing results. However, the increasing number of connected vehicles and the limited communication resources make the content distribution a challenge. Besides, the diversity of connected vehicles and contents makes it more challenging for content distribution. To address this issue, in this article, we propose EdgeVCD, an intelligent algorithm-inspired content distribution scheme. Specifically, we first propose a dual-importance (DI) evaluation approach to reflect the relationship between the Priority of Vehicles (PoV) and the Priority of Contents (PoC). To make use of the limited communication resources, we then formulate an optimization problem to maximize the system utility for content distribution. To solve the complex optimization problem effectively, we first divide the road into small segments. Then, we propose a fuzzy-logic-based method to select the most proper content replica vehicle (CRV) for aiding content distribution and redefine the number of content request vehicles in each segment. Thereafter, the optimization problem is transformed into a nonlinear integer programming problem. Inspired by the artificial immune system, we propose an immune clone-based algorithm to solve it, which has a fast convergence to an optimal solution. Extensive simulations validate the effectiveness of our proposed EdgeVCD in terms of system utility, average utility, and convergence.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-16", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5562-5579", "volume": "7"}, "authors": [{"authorId": "48962644", "name": "Quyuan Luo"}, {"authorId": "7431623", "name": "Changle Li"}, {"authorId": "9533837", "name": "T. Luan"}, {"authorId": "38737155", "name": "Weisong Shi"}], "citations": [{"paperId": "33b8c605132a5e010f4cd59fd4007e69ced37ad4", "title": "A resource competition-based truthful mechanism for IoV edge computing resource allocation with a lowest revenue limit"}, {"paperId": "485aa91f66ed9cb716a7c820bbffbacfcaa0d941", "title": "QoS-Aware Content Dissemination Based on Integrated Social and Physical Attributes Among Cellular and V2V Users"}, {"paperId": "38fd0f3e5836d050eb829958dec69ef0e1c7fb45", "title": "VeSoNet: Traffic-Aware Content Caching for Vehicular Social Networks Using Deep Reinforcement Learning"}, {"paperId": "67228e4188644479593d428208a8451b605d403e", "title": "ROS-Based Collaborative Driving Framework in Autonomous Vehicular Networks"}, {"paperId": "32709af36b25fe125d1f293731853247b598cec8", "title": "Targeted Dissemination of Incident Information With Combinatorial Traffic-Communication Optimization"}, {"paperId": "715493c5937b946d6f402418e8566243f1464d39", "title": "A Fault Diagnosis Method of Distribution Network based on Intelligent Algorithm"}, {"paperId": "4e50d6423f5bde49739029edd8686bfacc3985b3", "title": "Enhancing Soft AC Based Reliable Offloading for IoV with Edge Computing"}, {"paperId": "c09ec2e76138f73d32c0e82a6b4294934d2c9ba2", "title": "Multi-Task Allocation in Mobile Crowd Sensing With Mobility Prediction"}, {"paperId": "8235eda00c10273655a7c6a2f56b49416e64e9b3", "title": "Edge Computing Based Resource Supplementation for Software Defined Vehicular Networks"}, {"paperId": "0cc4b04f05a26c7545b1ea66101e6e89508abd16", "title": "A content distribution method of internet of vehicles based on edge cache and immune cloning strategy"}, {"paperId": "58ef822baa3b85016cc525d037bf85b6e77f2fcb", "title": "A new method of content distribution based on fuzzy logic and coalition graph games for VEC"}, {"paperId": "453495a6e9429adf722ccf5b09397f1e8a5f5c9b", "title": "Design and Implementation of Intelligent Medical Diagnosis Platform based on Intelligent Evaluation Algorithm"}, {"paperId": "8d9eccea0b5db9aae693f21464579213cb3f15a7", "title": "What is the Root Cause of Congestion in Urban Traffic Networks: Road Infrastructure or Signal Control?"}, {"paperId": "bfdb231ab90e05261685037802fe89117ba0b7f2", "title": "A cluster-based cooperative computation offloading scheme for C-V2X networks"}, {"paperId": "e930bf27b87692664b83af93549056564b4062fb", "title": "Evaluation Index of School Sports Resources Based on Artificial Intelligence and Edge Computing"}, {"paperId": "76bb522f60b6feb2d5c4d3cb5a5f96e2d1379ff2", "title": "VeSoNet: Traffic-Aware Content Caching for Vehicular Social Networks based on Path Planning and Deep Reinforcement Learning"}, {"paperId": "96fa0339fad6e196c21189dd287f323076d3ae74", "title": "Scaling and Placing Distributed Services on Vehicle Clusters in Urban Environments"}, {"paperId": "de49c74c6c7c744b837ffd350aed6f26fa587be0", "title": "Fuzzy inference system design for promoting an eco-friendly driving style in IoV domain"}, {"paperId": "79131641a44c6ec4e65c2385ff07f0aef586025c", "title": "Resource Scheduling in Edge Computing: A Survey"}, {"paperId": "a8a6ec64c154628d18c85dbc5a2cf4d68e58f930", "title": "Adaptive Content Precaching Scheme Based on the Predictive Speed of Vehicles in Content-Centric Vehicular Networks"}, {"paperId": "b10f52e1eb5824f4f2296465477de11b1c68443c", "title": "Store Edge Networked Data (SEND): A Data and Performance Driven Edge Storage Framework"}, {"paperId": "b1bb7e87a0431b2f8413b18e216d79fc2c858f31", "title": "Three-Side Dynamic Task Offloading for Smart Roads Enabled Vehicular Edge Computing"}]}
