{"paperId": "533c9508dee744b383cbd5edc33ec82800654775", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Camel: Smart, Adaptive Energy Optimization for Mobile Web Interactions", "abstract": "Web technology underpins many interactive mobile applications. However, energy-efficient mobile web interactions is an outstanding challenge. Given the increasing diversity and complexity of mobile hardware, any practical optimization scheme must work for a wide range of users, mobile platforms and web workloads. This paper presents CAMEL, a novel energy optimization system for mobile web interactions. CAMEL leverages machine learning techniques to develop a smart, adaptive scheme to judiciously trade performance for reduced power consumption. Unlike prior work, CAMEL directly models how a given web content affects the user expectation and uses this to guide energy optimization. It goes further by employing transfer learning and conformal predictions to tune a previously learned model in the end-user environment and improve it over time. We apply CAMEL to Chromium and evaluate it on four distinct mobile systems involving 1,000 testing webpages and 30 users. Compared to four state-of-the-art web-event optimizers, CAMEL delivers 22% more energy savings, but with 49% fewer violations on the quality of user experience, and exhibits orders of magnitudes less overhead when targeting a new computing environment.", "venue": "IEEE Conference on Computer Communications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-05-02", "journal": {"name": "IEEE INFOCOM 2020 - IEEE Conference on Computer Communications", "pages": "119-128"}, "authors": [{"authorId": "2111472979", "name": "Jie Ren"}, {"authorId": "2130222225", "name": "Lu Yuan"}, {"authorId": "2583077", "name": "Petteri Nurmi"}, {"authorId": "2108682954", "name": "Xiaoming Wang"}, {"authorId": "2113428212", "name": "Miao Ma"}, {"authorId": "1443786960", "name": "Ling Gao"}, {"authorId": "2238603", "name": "Zhanyong Tang"}, {"authorId": "1443786677", "name": "Jie Zheng"}, {"authorId": null, "name": "Zheng Wang"}], "citations": [{"paperId": "672da2bff20808998a5c4a3953612d2cdd60d891", "title": "JavaScript Performance Tuning as a Crowdsourced Service"}, {"paperId": "2433f0910462026a6f18e1bf464018731a861953", "title": "Energy-Saving Strategies for Mobile Web Apps and their Measurement: Results from a Decade of Research"}, {"paperId": "072da6d5dd5448d32ca6b92362aebef0f247a3a8", "title": "Adaptive Model Selection for Video Super Resolution"}, {"paperId": "708f06acbcea2623b13d826785bdf444c99f0c47", "title": "Realizing Emotional Interactions to Learn User Experience and Guide Energy Optimization for Mobile Architectures"}, {"paperId": "30d51a26086a6632d2ed0edd882054b46e8519a9", "title": "Automating reinforcement learning architecture design for code optimization"}, {"paperId": "d1e3f04fb2c6a84c35d1ee3be6cb5fbd2b029043", "title": "Dynamic GPU Energy Optimization for Machine Learning Training Workloads"}, {"paperId": "9fb122978029f1f5bb74e004ad1eeec62e9a2462", "title": "Adaptive Computation Offloading for Mobile Augmented Reality"}, {"paperId": "2decdf4fed5b215925fbe7a600457a0c4619b4ec", "title": "ESOD:Edge-based Task Scheduling for Object Detection"}, {"paperId": "d40c92fad76d418af81100cd2d6b9cb4b44d3efb", "title": "An application performance optimization model of mobile augmented reality based on hd restoration"}, {"paperId": "4cf8be8646c179e87e83966f553707f584936a0b", "title": "Parallel programming models for heterogeneous many-cores: a comprehensive survey"}, {"paperId": "725a7cc6f95e56c8339e0378de7835617ec2bbf0", "title": "Parallel Programming Models for Heterogeneous Many-Cores : A Survey"}]}
