{"paperId": "535010b5c8b70ca825fa914fb03af72fcec9a062", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Big Data Technology Applications and the Right to Health in China during the COVID-19 Pandemic", "abstract": "Individuals have the right to health according to the Constitution and other laws in China. Significant barriers have prevented the full realisation of the right to health in the COVID-19 era. Big data technology, which is a vital tool for COVID-19 containment, has been a central topic of discussion, as it has been used to protect the right to health through public health surveillance, contact tracing, real-time epidemic outbreak monitoring, trend forecasting, online consultations, and the allocation of medical and health resources in China. Big data technology has enabled precise and efficient epidemic prevention and control and has improved the efficiency and accuracy of the diagnosis and treatment of this new form of coronavirus pneumonia due to Chinese institutional factors. Although big data technology has successfully supported the containment of the virus and protected the right to health in the COVID-19 era, it also risks infringing on individual privacy rights. Chinese policymakers should understand the positive and negative impacts of big data technology and should prioritise the Personal Information Protection Law and other laws that are meant to protect and strengthen the right to privacy.", "venue": "International Journal of Environmental Research and Public Health", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "18"}, "authors": [{"authorId": "119227196", "name": "Taixia Shen"}, {"authorId": "2144449132", "name": "Chao Wang"}], "citations": [{"paperId": "e98ebfc4e99066835e44db5a6d0e1dd2969663fc", "title": "Opportunities in emerging technologies for Southern Africa: How the Global South should adopt to take advantage?"}, {"paperId": "bf5b707fc65e91adfc6044694d94dd3fbd830b68", "title": "Individual Privacy and Data Protection Rights. The Legal and Economic Consequences of the Violation During the Covid-19 Pandemic"}, {"paperId": "f8d84844d689847de78cc14f388d9462a7e112ab", "title": "Regulating China's health code system to prepare for future pandemics"}, {"paperId": "34945c9159d5bcef1f1a0f8504301798738f13d3", "title": "Generation Mechanism of \"Information Cocoons\" of Network Users: An Evolutionary Game Approach"}, {"paperId": "d760e9e587056cb06ffc04ed6c8aacd94ded1f42", "title": "Changes to Public Health Surveillance Methods Due to the COVID-19 Pandemic: Scoping Review"}, {"paperId": "4ce0076cfff66b17021f2ad692697c7b43b8bc3a", "title": "Personal Information Protection and Privacy Policy Compliance of Health Code Apps in China: Scale Development and Content Analysis."}, {"paperId": "b06d758478ba97c823e32e0fd621603f7c5af797", "title": "Close Contacts, Infected Cases, and the Trends of SARS-CoV-2 Omicron Epidemic in Shenzhen, China"}, {"paperId": "501e7d7ac7a25fcf560a1f59902a9ed4ac2e71aa", "title": "The Impact of China’s Legal System on Public Health and Quality of Life during the COVID-19 Pandemic: An Empirical Study"}, {"paperId": "455de8f6285797d013d0158e23ad94b8fdba617e", "title": "Oncological big data platforms for promoting digital competencies and professionalism in Chinese medical students: a cross-sectional study"}, {"paperId": "f10bf1fd65a75176d347a6f747dd7b6795f6267c", "title": "Public Health and Private Life Under COVID-19 Vaccination Policies in China: A Legal Analysis"}]}
