{"paperId": "5355ca85e8b88e863869072fa0149009451cc36e", "publicationVenue": {"id": "68f20e73-515e-4c73-9cd5-5684926b45f7", "name": "IEEE Journal on Selected Areas in Communications", "type": "journal", "alternate_names": ["IEEE J Sel Area Commun"], "issn": "0733-8716", "url": "http://www.comsoc.org/jsac/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=49", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=49"]}, "title": "Trade Reliability for Security: Leakage-Failure Probability Minimization for Machine-Type Communications in URLLC", "abstract": "How to provide information security while fulfilling ultra reliability and low-latency requirements is one of the major concerns for enabling the next generation of ultra-reliable and low-latency communications service (xURLLC), specially in machine-type communications. In this work, we investigate the reliability-security tradeoff by defining the leakage-failure probability, a metric that jointly characterizes both reliability and security performances for short-packet transmissions. We discover that the system performance can be enhanced, counter-intuitively, by allocating fewer resources for the transmission with finite blocklength (FBL) codes. In order to solve the corresponding optimization problem for the joint resource allocation, we propose an optimization framework, that leverages lower-bounded approximations for the decoding error probability in the FBL regime. We characterize the convexity of the reformulated problem and establish an efficient iterative searching method, the convergence of which is guaranteed. To show the extendability of the framework, we further discuss the blocklength allocation schemes with practical requirements of reliable-secure performance, as well as the transmissions with the statistical channel state information (CSI). Numerical results verify the accuracy of the proposed approach and demonstrate the reliability-security tradeoff under various setups.", "venue": "IEEE Journal on Selected Areas in Communications", "year": 2023, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-07", "journal": {"name": "IEEE Journal on Selected Areas in Communications", "pages": "2123-2137", "volume": "41"}, "authors": [{"authorId": "2150665327", "name": "Yao Zhu"}, {"authorId": "2670818", "name": "Xiaopeng Yuan"}, {"authorId": "3283008", "name": "Yulin Hu"}, {"authorId": "2307454", "name": "Rafael F. Schaefer"}, {"authorId": "1722205", "name": "A. Schmeink"}], "citations": [{"paperId": "51366614df4d31682c1b2e4af4dd43e854d5e3b6", "title": "Blocklength Allocation for Security-Enhanced MEC with Dependency-Aware Tasks"}, {"paperId": "9d98da10dcb65ffa1481bd5d3774a5b95700b58a", "title": "Non-Orthogonal Multiplexing in the FBL Regime Enhances Physical Layer Security with Deception"}, {"paperId": "9436f841d6680e96fc1407661dcc6d5589470c98", "title": "Statistical Tools and Methodologies for Ultrareliable Low-Latency Communication—A Tutorial"}]}
