{"paperId": "535abf5417e481fed7088dca2b7786e8e73a8181", "publicationVenue": {"id": "405a8682-2b02-472d-9d89-0115f4e329bc", "name": "Eastern-European Journal of Enterprise Technologies", "type": "journal", "alternate_names": ["Eastern-european J Enterp Technol"], "issn": "1729-3774", "url": "http://journals.uran.ua/eejet", "alternate_urls": ["http://journals.uran.ua/eejet/index"]}, "title": "Construction of a parametric model of competitive access in relational databases by using a random forest method", "abstract": "We have considered the task on modeling a request execution time in autonomous relational databases with competitive queries. The shortcomings of existing approaches have been specified, which ignore the cost of the share of successive operations in the cooperative access to data in a memory hierarchy. We have examined the issue of the application of relative cost for the implementation of components in the operations of a plan of the query, instead of calculating the predicted time of computation. A technique has been proposed for the formal construction of precedents for a training sample, as well as the approach to building a regression model. The developed modification of the machine learning method random forest is used for calculating the request execution time based on their texts and temporary marks of the start, duration of execution. The constructed parametrical model of competitive access to data is required for obtaining accurate estimates of request execution time when using parallel computations. Models with such characteristics are needed to solve the problems on automated management of a physical data scheme, for building self-identifiable DBMS. The key differences from existing approaches are the application of a request execution time as the target value, accounting the values of predicates and mutual influence of requests that are executed in parallel. To confirm the results obtained, a simulation model has been used based on the widely known test TPC-C. The used function of loss, taking into consideration the regression nature of the model, was the ratio of the sum of modules of difference between the actual and obtained time to the actual time. The check itself was carried out based on a reference sample, generated for the increasing length of training at postponed data. In the course of this study we have proved a possibility to apply the machine learning method random forest for processing statistical data on the execution of SQL queries. The result obtained is promising for such an approach and makes it possible to derive the parametric models of competitive request processing.", "venue": "Eastern-European Journal of Enterprise Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-06-11", "journal": {"name": "Eastern-European Journal of Enterprise Technologies"}, "authors": [{"authorId": "150967898", "name": "D. Gromey"}, {"authorId": "152801028", "name": "E. Lebedenko"}, {"authorId": "2140134273", "name": "Dmitry P. Nikolaev"}, {"authorId": "92518687", "name": "T. Rozhkova"}], "citations": []}
