{"paperId": "536c9ef748b3ec40022a33404b0912f2447e18bb", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Cloud-Edge Collaborative Method for Industrial Process Monitoring Based on Error-Triggered Dictionary Learning", "abstract": "The development of cloud manufacturing enables data-driven process monitoring methods to reflect the real industrial process states accurately and timely. However, traditional process monitoring methods cannot update learned models once they are deployed to edge devices, which leads to model mismatch when confronted time-varying data. In addition, limited resources on the edge prevent it from deploying complex models. Therefore, this article proposes a novel cloud-edge collaborative process monitoring method. First, historical data of industrial processes are collected to establish a dictionary learning model and train the dictionary and classifier in the cloud. Then, the model is simplified and deployed to the edge. The edge layer monitors the process states, including fault detection and working condition recognition, and determines whether a model mismatch has occurred based on an error-triggered strategy. Both numerical simulation and industrial roasting process results verify the superiority of the proposed method.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "8957-8966", "volume": "18"}, "authors": [{"authorId": "144847255", "name": "Keke Huang"}, {"authorId": "2041798926", "name": "Zui Tao"}, {"authorId": "2109118071", "name": "Chen Wang"}, {"authorId": "1992905873", "name": "Tianxu Guo"}, {"authorId": "39731543", "name": "Chunhua Yang"}, {"authorId": "145202887", "name": "W. Gui"}], "citations": [{"paperId": "753c4b553f06470dc5ea924a579031422f3e831a", "title": "A novel parallel feature extraction-based multibatch process quality prediction method with application to a hot rolling mill process"}, {"paperId": "3520845cd4900a7f4f9b82771166bd82f9282394", "title": "Low-Rank Sparse Generative Adversarial Unsupervised Domain Adaptation for Multitarget Traffic Scene Semantic Segmentation"}, {"paperId": "c9dacca5bff805401de387cd11d21dc013803e36", "title": "Facing spatiotemporal heterogeneity: A unified federated continual learning framework with self-challenge rehearsal for industrial monitoring tasks"}, {"paperId": "d5a10c649055f3ea08b3f060f5b7a346e5068969", "title": "Fault Diagnosis of Complex Industrial Systems Based on Multi-Granularity Dictionary Learning and Its Application"}, {"paperId": "c82d908a25c30e1eca7272b1765ba765a9af5362", "title": "Spatio-temporal information analytics based performance-driven industrial process monitoring framework with cloud–edge-device collaboration"}, {"paperId": "a841847f651255773d435c431fedfd58eae95e16", "title": "LSTM-MPC: A Deep Learning Based Predictive Control Method for Multimode Process Control"}, {"paperId": "8e70be4e57d54b3ba48300d40ddd442eca50e3df", "title": "Design Cloud-Edge Collaborated Batch Control Systems Based on Automatic Mapping IEC 61499 and ISA-88"}, {"paperId": "b24e3dce2f25be526df8be1d610f9dc2051b524b", "title": "A quick and intelligent screening method for large-scale retired batteries based on cloud-edge collaborative architecture"}, {"paperId": "c1a42d59898d86f57edcd17bf0f62a60fb6a0cbb", "title": "Data Mode Related Interpretable Transformer Network for Predictive Modeling and Key Sample Analysis in Industrial Processes"}, {"paperId": "f231bcb84c2d7955428bf410afb4e07ef25550c0", "title": "Intrusion Detection of Industrial Internet-of-Things Based on Reconstructed Graph Neural Networks"}, {"paperId": "60d1deab83aaa8121fab1ca87faeda270adf0c5b", "title": "Data-driven modeling and stability control for industrial zinc roaster and its edge controller implementation"}, {"paperId": "d823a70b5cfa7549bb624f8982f7f72961669ea4", "title": "Multi-Objective Adaptive Optimization Model Predictive Control: Decreasing Carbon Emissions from a Zinc Oxide Rotary Kiln"}, {"paperId": "312c8b879784286c6ad7b1f35371854b937047f2", "title": "A denoising semi-supervised deep learning model for remaining useful life prediction of turbofan engine degradation"}, {"paperId": "50974c59982a489f1d8d51c344d611b4f6262d9e", "title": "Deep Gaussian mixture adaptive network for robust soft sensor modeling with a closed-loop calibration mechanism"}, {"paperId": "3bb440a34dbf9e0d91aecfed0063d481fdae68c0", "title": "A Systematic Procurement Supply Chain Optimization Technique Based on Industrial Internet of Things and Application"}, {"paperId": "b4c370ef0519fb50da31a7f205980cadcc5198f4", "title": "Hydrogenerator early fault detection: Sparse Dictionary Learning jointly with the Variational Autoencoder"}, {"paperId": "c5afc2be9971e5976e7c1f8fe2d7635d32c62a6f", "title": "Cluster-based industrial KPIs forecasting considering the periodicity and holiday effect using LSTM network and MSVR"}, {"paperId": "6caa70866403099f4e5d2ddb69ba3bc0a7d483ae", "title": "An Energy-Saving Regulation Framework of Central Air Conditioning Based on Cloud–Edge–Device Architecture"}, {"paperId": "fbee8313a461d78791325dea910db351ce0462c0", "title": "Trustworthiness of Process Monitoring in IIoT Based on Self-Weighted Dictionary Learning"}, {"paperId": "7d10459faa88b301e1b70002c35f7f9c72cb4872", "title": "Guest Editorial: Special Section on Artificial Intelligence and Big Data Analytics for Cloud Manufacturing"}, {"paperId": "c966a706e963ebe5c164c721369caf7ca61fb089", "title": "LSTMED: An uneven dynamic process monitoring method based on LSTM and Autoencoder neural network"}, {"paperId": "0feb9ce6a2ce19128e1ba3772a27a3429ab1b350", "title": "Evolution of cooperation driven by diversity on a double-layer square lattice"}, {"paperId": "338d340d85eaafbbdb71786d6a0dfcfea07adacf", "title": "A transfer predictive control method based on inter-domain mapping learning with application to industrial roasting process."}, {"paperId": "f42692721ca94f2bcec8fe5a94ddcde5ec538699", "title": "A Survey on Collaborative DNN Inference for Edge Intelligence"}, {"paperId": "4733f7acfc8692d4116b9d65501e7d2e6261c9c4", "title": "A latent feature oriented dictionary learning method for closed-loop process monitoring."}, {"paperId": "a6704e6e688af77a41af74643a5dc6c246933668", "title": "False Data Injection Threats in Active Distribution Systems: A Comprehensive Survey"}, {"paperId": "9cc9851b4ac280c748131814c6be96f6762864a3", "title": "Variational autoencoder based on knowledge sharing and correlation weighting for process-quality concurrent fault detection"}, {"paperId": "a0f888c8f8f7a5e8a226ee36c4b30d45e055df47", "title": "MOTEF: A Testing Framework for Runtime Monitoring Infrastructures"}]}
