{"paperId": "537efae13f33ad932034b8ad1db72a83d3691473", "publicationVenue": null, "title": "Self-tuning of cloud systems", "abstract": "Over the past years, there has been an increase in the use of Cloud Computing for delivery of services. These services range from remote storage systems to Virtual Machines (VMs), available for purchase and for online provisioning of user specific jobs. In response to such an increasing demand, modern cloud providers have widely increased the heterogeneity of platforms they offer (e.g., in terms of computational, storage and network capacities). Therefore, users are left with a huge variety of machines and services to choose from. This is a complex and time consuming optimization problem with relevant economical implications, since there are multiple sets of machines, of different types and numbers — configuration — that may yield similar performances with identical costs, making it difficult to distinguish the best one. This motivated recent research aimed to automate the identification of the optimal cloud configuration to deploy user applications. Existing approaches employ a wide range of predictive techniques and share a common mechanism: an exploratory phase during which the target application is deployed and tested over a diverse set of configurations, which are typically established in a dynamic fashion, depending on the applications’ workload characteristics. State-of-the-art systems have been shown to be able to identify near-optimal configurations for the final application deployment (i.e., its steady state). Unfortunately, though, existing solutions aim solely at optimizing the efficiency of the final configuration. As such, they neglect the cost of the exploration phase, which can be quite expensive not only for short running jobs, but also for applications subject to frequent workload changes, which accordingly, require frequent reconfigurations. We argue that, in order to tackle this problem, the optimization process should explicitly take into account the cost dynamics of the whole exploration phase. This is a non-trivial problem as the exploration cost is not only determined by the set of configurations to be tested (that is unknown a priori), but also by the order in which they are explored. As a first step towards pursuing this goal, this report reviews the related work in this area, and presents the design of the proposed system.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2062797649", "name": "Maria Casimiro"}, {"authorId": "2111194645", "name": "João Nuno Silva"}, {"authorId": "2055734791", "name": "Doutor Paolo Romano"}, {"authorId": "2061786565", "name": "António Chaves Saraiva de Melo"}], "citations": []}
