{"paperId": "538f60081ed2901ed89a4bd8cb80d6aca9777256", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Clustering of a Health Dataset Using Diagnosis Co-Occurrences", "abstract": "Assessing the health profiles of populations is a crucial task to create a coherent healthcare offer. Emergency Departments (EDs) are at the core of the healthcare system and could benefit from this evaluation via an improved understanding of the healthcare needs of their population. This paper proposes a novel hierarchical agglomerative clustering algorithm based on multimorbidity analysis. The proposed approach constructs the clustering dendrogram by introducing new quality indicators based on the relative risk of co-occurrences of patient diagnoses. This algorithm enables the detection of multimorbidity patterns by merging similar patient profiles according to their common diagnoses. The multimorbidity approach has been applied to the data of the largest ED of the Aube Department (Eastern France) to cluster its patient visits. Among the 120,718 visits identified during a 24-month period, 16 clusters were identified, accounting for 94.8% of the visits, with the five most prevalent clusters representing 63.0% of them. The new quality indicators show a coherent and good clustering solution with a cluster membership of 1.81 based on a cluster compactness of 1.40 and a cluster separation of 0.77. Compared to the literature, the proposed approach is appropriate for the discovery of multimorbidity patterns and could help to develop better clustering algorithms for more diverse healthcare datasets.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-07", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2059707960", "name": "Adrien Wartelle"}, {"authorId": "1410428705", "name": "F. Mourad-Chehade"}, {"authorId": "1790592", "name": "F. Yalaoui"}, {"authorId": "51927232", "name": "J. Chrusciel"}, {"authorId": "1725412280", "name": "D. Laplanche"}, {"authorId": "2056914570", "name": "Stéphane Sanchez"}], "citations": [{"paperId": "155b6b31d66b4dc9670fc9da7c63e3bf3c6de5cd", "title": "Learning prevalent patterns of co-morbidities in multichronic patients using population-based healthcare data"}, {"paperId": "68397f28d7730fd7dc2475311933fd1489b2cb36", "title": "The need for data management standards in public health nursing: A narrative review and case study."}, {"paperId": "05119eb3e4aa5318e67629ef5846c71289f5162d", "title": "Clustering Diagnoses From 58 Million Patient Visits in Finland Between 2015 and 2018"}, {"paperId": "a2a4e0d3a798440dce7d360e40e91d0c654d22ea", "title": "Clustering Diagnoses from 58M Patient Visits in Finland 2015–2018 (Preprint)"}, {"paperId": "72095d8ea9c160823a5f5fbec0f092b70099521c", "title": "Exploring Patient Multimorbidity and Complexity Using Health Insurance Claims Data: A Cluster Analysis Approach"}, {"paperId": "b90938ad34c6d823f5200d17bc28d5c8dcdf8893", "title": "Effect of the COVID-19 pandemic lockdown on non-COVID-19 emergency department visits in Eastern France: Reduced risk or avoidance behavior?"}, {"paperId": "f5d24398106715b2532e58c35b59ae81b9f6e901", "title": "Multimorbidity clustering of the emergency department patient flow: Impact analysis of new unscheduled care clinics"}, {"paperId": "3378bc38373880aaceb2c052304b7472c94e61dc", "title": "Unsupervised Learning to Understand Patterns of Comorbidity in 633, 330 Patients Diagnosed with Osteoarthritis"}, {"paperId": "25f0891101b5b7f48f5fd465146b0fb0e44f7bfc", "title": "A Novel Method of Clustering Using a Stochastic Approach"}, {"paperId": "f00b628e0c7e64b4e9c5753df714fc4fa7aa3ecd", "title": "Detection of Patients with Diabetes Mellitus using Density-Based Spatial Clustering of Applications with Noize"}, {"paperId": "99a0d962d11e8a53c213f041beef1ba3d090f9d5", "title": "Expert Systems With Applications"}]}
