{"paperId": "53945286351127feab2bdfcb5ca6312633764db8", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "Edge Intelligence: Federated Learning-Based Privacy Protection Framework for Smart Healthcare Systems", "abstract": "Federated learning methods offer secured monitor services and privacy-preserving paradigms to end-users and organisations in the Internet of Things networks such as smart healthcare systems. Federated learning has been coined to safeguard sensitive data, and its global aggregation is often based on a centralised server. This design is vulnerable to malicious attacks and could be breached by privacy attacks such as inference and free-riding, leading to inefficient training models. Besides, uploaded analysing parameters by patients can reveal private information and the threat of direct manipulation by the central server. To address these issues, we present a three-fold Federated Edge Aggregator, the so-called Edge Intelligence, a federated learning-based privacy protection framework for safeguarding Smart Healthcare Systems at the edge against such privacy attacks. We employ an iteration-based Conventional Neural Network (CNN) model and artificial noise functions to balance privacy protection and model performance. A theoretical convergence bound of Edge Intelligence on the trained federated learning model's loss function is also introduced here. We evaluate and compare the proposed framework with the recently established methods using model performance and privacy budget on popular and recent datasets: MNIST, CIFAR10, STL10, and COVID19 chest x-ray. Finally, the proposed framework achieves 90% accuracy and a high privacy rate demonstrating better performance than the baseline technique.", "venue": "IEEE journal of biomedical and health informatics", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-20", "journal": {"name": "IEEE Journal of Biomedical and Health Informatics", "pages": "5805-5816", "volume": "26"}, "authors": [{"authorId": "1622325746", "name": "Mahmuda Akter"}, {"authorId": "3193106", "name": "Nour Moustafa"}, {"authorId": "1691332", "name": "T. Lynar"}, {"authorId": "1630421985", "name": "Imran Razzak"}], "citations": [{"paperId": "088d216b6783e2e5cffbc4f145ccdf95cd74a3a3", "title": "Enabling pandemic‐resilient healthcare: Narrowband Internet of Things and edge intelligence for real‐time monitoring"}, {"paperId": "92959ad9a653b52fd7aab10fab51d87a074db77a", "title": "Federated Learning in Real-Time Medical IoT: Optimizing Privacy and Accuracy for Chronic Disease Monitoring"}, {"paperId": "e76866636d6ee99ddf4ffee0b36add632bfa5dfe", "title": "Towards Reliable Federated Learning Using Blockchain-Based Reverse Auctions and Reputation Incentives"}, {"paperId": "9a50c56602706e33ccaa4502f2f4d562ed895daf", "title": "Edge-Assisted Framework for Malaria Parasite Detection on Cell Images Using Federated Learning"}, {"paperId": "1057a1559a3a1065bede7dc914a5d2e3cfdb64e4", "title": "Advancing Pandemic Preparedness in Healthcare 5.0: A Survey of Federated Learning Applications"}, {"paperId": "fc10b975239678f6e67de7b7bf83979c1c338b3a", "title": "Recent Methodological Advances in Federated Learning for Healthcare"}, {"paperId": "54cb70c32d2e6f5c9f04bfcee996d64fbdfa7d28", "title": "Dynamic Corrected Split Federated Learning With Homomorphic Encryption for U-Shaped Medical Image Networks"}, {"paperId": "8ae118b4072480e3045f4d22a0263b6cf545e974", "title": "Hierarchical Federated Learning With Social Context Clustering-Based Participant Selection for Internet of Medical Things Applications"}, {"paperId": "75860afa8d18be8d66f35bd8cd2564d1386fbde7", "title": "A Review of Privacy Enhancement Methods for Federated Learning in Healthcare Systems"}, {"paperId": "e727782c8c600441e924da1bf40962d7a6f812d2", "title": "Low-Latency Federated Learning via Dynamic Model Partitioning for Healthcare IoT"}, {"paperId": "b7299d9ae26cf2a597bc84945bb6b7e84cecf917", "title": "A modified modeling approach of virtual power plant via improved federated learning"}, {"paperId": "75878655d7f2dc25dae566bd759bd89454c125af", "title": "An IoMT-Based Incremental Learning Framework With a Novel Feature Selection Algorithm for Intelligent Diagnosis in Smart Healthcare"}, {"paperId": "d91eed53ef7aff1b8675b5552b2549919688b6b4", "title": "Advanced Cardiovascular Health in a Quantum AI-driven Healthcare Framework"}]}
