{"paperId": "53a6507c7b514042f7bdf06cc2c0b59a32a19cc7", "publicationVenue": {"id": "070a8b94-9234-4a39-bff0-23e0c6b74464", "name": "International Conference on Statistical and Scientific Database Management", "type": "conference", "alternate_names": ["Stat Sci Database Manag", "SSDBM", "Statistical and Scientific Database Management", "Int Conf Stat Sci Database Manag"], "url": "http://www.ssdbm.org/"}, "title": "A Unified Correlation-based Approach to Sampling Over Joins", "abstract": "Supporting sampling in the presence of joins is an important problem in data analysis, but is inherently challenging due to the need to avoid correlation between output tuples. Current solutions provide either correlated or non-correlated samples. Sampling might not always be feasible in the non-correlated sampling-based approaches -- the sample size or intermediate data size might be exceedingly large. On the other hand, a correlated sample may not be representative of the join. This paper presents a unified strategy towards join sampling, while considering sample correlation every step of the way. We provide two key contributions. First, in the case where a correlated sample is acceptable, we provide techniques, for all join types, to sample base relations so that their join is as random as possible. Second, in the case where a correlated sample is not acceptable, we provide enhancements to the state-of-the-art algorithms to reduce their execution time and intermediate data size.", "venue": "International Conference on Statistical and Scientific Database Management", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-06-27", "journal": {"name": "Proceedings of the 29th International Conference on Scientific and Statistical Database Management"}, "authors": [{"authorId": "2354853", "name": "N. Kamat"}, {"authorId": "145781033", "name": "Arnab Nandi"}], "citations": [{"paperId": "b739c7f754b3401015ec9f43f130848ce646ef69", "title": "Improved Correlated Sampling for Join Size Estimation"}, {"paperId": "e07f7b953ace121daed07224bcd38f3e9b226c72", "title": "Join on Samples: A Theoretical Guide for Practitioners"}, {"paperId": "e248079fd2706e432dc8c8774fd7f37b94ced7ca", "title": "ApproxJoin: Approximate Distributed Joins"}, {"paperId": "922f4b4f93b16d38df7db0f0c001cdd562d76819", "title": "ApproxJoin"}, {"paperId": "a8e3257d8ec0424d3fd82acdcecd5123f6fa5820", "title": "To Ship or Not to (Function) Ship (Extended version)"}, {"paperId": "1e54699ae9b064f857044e452c854a66eab75c6c", "title": "Approximate Distributed Joins in Apache Spark"}, {"paperId": "dda199bcb834114bcf1a7a58be5bb6e46a93888b", "title": "Interactive Data Exploration of Distributed Raw Files: A Systematic Mapping Study"}, {"paperId": "0c3ee3008385103d3a015ceb2463a521be33cc19", "title": "Sampling-based Techniques for Interactive Exploration of Large Datasets"}]}
