{"paperId": "53b914c8fdd3f00d1a201f6bdb7c38e393356f7a", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Fog Computing Capabilities for Big Data Provisioning: Visualization Scenario", "abstract": "With the development of Internet technologies, huge amounts of data are collected from various sources, and used ‘anytime, anywhere’ to enrich and change the life of the whole of society, attract ways to do business, and better perceive people’s lives. Those datasets, called ‘big data’, need to be processed, stored, or retrieved, and special tools were developed to analyze this big data. At the same time, the ever-increasing development of the Internet of Things (IoT) requires IoT devices to be mobile, with adequate data processing performance. The new fog computing paradigm makes computing resources more accessible, and provides a flexible environment that will be widely used in next-generation networks, vehicles, etc., demonstrating enhanced capabilities and optimizing resources. This paper is devoted to analyzing fog computing capabilities for big data provisioning, while considering this technology’s different architectural and functional aspects. The analysis includes exploring the protocols suitable for fog computing by implementing an experimental fog computing network and assessing its capabilities for providing big data, originating from both a real-time stream and batch data, with appropriate visualization of big data processing.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-01", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2085153370", "name": "Halim Khujamatov"}, {"authorId": "3013163", "name": "Khaleel Ahmad"}, {"authorId": "46745246", "name": "N. Usmanova"}, {"authorId": "1516255668", "name": "Jamshid Khoshimov"}, {"authorId": "3300753", "name": "Mai A. Alduailij"}, {"authorId": "52092148", "name": "Mona A. Alduailij"}], "citations": [{"paperId": "acd4d517b26cbb59ff766182a783e1274de09729", "title": "Research on the construction of a visualization platform for customer demand analysis based on big data technology"}, {"paperId": "b1e69f6495345691d1b1b21152e51a60ab7f872a", "title": "On the Use of the ITU-R P.1546 Model in Calculations of Mobile Coverage Areas"}, {"paperId": "2d2bee18fed2434a4b2af924b95cb224149f0552", "title": "Smart Cities: Concepts, Standarts, Frameworks, Models, Technologies"}, {"paperId": "37eb917201098959e770106ebc2779325e1e51a1", "title": "Mathematical Modeling of Liquid-Gas Phase Equilibrium on the Example of Soda Production"}, {"paperId": "2188c1f05d2320d456171c045973cc527219ac57", "title": "Events Sourcing and Command Query Responsibility Segregation Based Fast Data Architecture"}]}
