{"paperId": "53c00f9d867cdc3beaee73b74f05e5795d332fd0", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Performance Optimization in Heterogeneous WiFi and Cellular Mobile Edge Computing Systems", "abstract": "Mobile edge computing (MEC) is a promising paradigm for alleviating the computation burden of resource-constrained mobile devices. Nevertheless, the majority of existing efforts concentrate on offloading computations from mobile de-vices to an edge computing server through the cellular networks only. With the development of wireless connectivity technologies, WiFi networks over unlicensed spectrum provide a “green” (i.e., cost-efficient and economical) alternative for computation offloading. In this paper, we investigate the problem of computation offloading in a heterogeneous WiFi and cellular MEC system, where both the WiFi and the cellular networks are possible for offloading the arriving computation tasks at a mobile user (MU). The objective of an MU is to minimize the long-term cost, which can be described as a single-agent Markov decision process (MDP) by accounting for the inherent system dynamics in the MU mobility, sporadic computation task arrivals and wireless connectivity variations. To solve the optimal strategy for the formulated MDP with a high-dimensional state space but without the statistical knowledge of system dynamics, we resort to a model-free deep reinforcement learning algorithm. Numerical experiments verify that the proposed algorithm is able to significantly reduce the average computation offloading cost compared with other baselines.", "venue": "Global Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-01", "journal": {"name": "2021 IEEE Global Communications Conference (GLOBECOM)", "pages": "01-06"}, "authors": [{"authorId": "2152058564", "name": "L. Niu"}, {"authorId": "1855614", "name": "Yangjie Cao"}, {"authorId": "66870093", "name": "Celimuge Wu"}, {"authorId": "145350728", "name": "Rui Yin"}, {"authorId": "2135089146", "name": "Xianfu Chen"}], "citations": [{"paperId": "ee32712d9042437022fa3e76dc2b8e13dea789e4", "title": "Multiagent Meta-Reinforcement Learning for Optimized Task Scheduling in Heterogeneous Edge Computing Systems"}, {"paperId": "866d8c0ca9b92de4884611dcaf7bb54dbf7ca379", "title": "A Truthful Auction for Green Continuous Task Allocation and Pricing in Edge Computing"}, {"paperId": "a207cd597cfe338e547ce781806abd0b1e99dade", "title": "Blind Modulation Classification for OFDM in the Presence of Carrier Frequency Offsets"}]}
