{"paperId": "53e5854c7a9f67a2250a60c77edd731ab6da378e", "publicationVenue": null, "title": "An Exploration of Learning About Cardiovascular Disease Predictionusing Deep Learning", "abstract": "Artificial intelligence has advanced Technology in recent years in the form of software algorithms for use and applications in the health-monitoring system. The best choices for eliminating human error in disease diagnosis and assisting in disease prevention through early detection. Heart-related illnesses, often known as circulatory sicknesses are the foremost cause of death in universal during the past several decades and have become the most serious illness in both India and the rest of the globe. Therefore, a trustworthy, accurate, and practical system is required to identify these disorders early enough for effective therapy. Based on the required task, deep information has stood as a more correct and persuasive radio for a type of restorative questions in the way that ailment, guess, and encroachment. It is a representation instruction pattern amounting to coatings that non-linearly transform the file to disclose hierarchic companionships and structures. In this survey, we construe the benefits and troubles of administering deep Knowledge in cardiology that also relate to curing usually, while suggesting distinguishing guidance as best able for dispassionate use,for that reason Deep Knowledge modelling can be used as further research work.", "venue": "2022 4th International Conference on Advances in Computing, Communication Control and Networking (ICAC3N)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-16", "journal": {"name": "2022 4th International Conference on Advances in Computing, Communication Control and Networking (ICAC3N)", "pages": "823-829"}, "authors": [{"authorId": "2288310221", "name": "L.Dharani"}, {"authorId": "2287713414", "name": "Dr. G. Victo"}, {"authorId": "2287594359", "name": "Sudha George"}, {"authorId": "2288313947", "name": "Dr.S.Geetha"}], "citations": []}
