{"paperId": "53ebca8d109d498d65f3744e98becd28e9f3b4b1", "publicationVenue": {"id": "0d6f7fba-7092-46b3-8039-93458dba736b", "name": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Acoust Speech Signal Process", "IEEE Int Conf Acoust Speech Signal Process", "ICASSP", "International Conference on Acoustics, Speech, and Signal Processing"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000002"}, "title": "eCIL-MU: Embedding based Class Incremental Learning and Machine Unlearning", "abstract": "New categories may be introduced over time, or existing categories may need to be reclassified. Class incremental learning (CIL) is employed for the gradual acquisition of knowledge about new categories while preserving information about previously learned ones in such dynamic environments. It might also be necessary to also eliminate the influence of related categories on the model to adapt to reclassification. We thus introduce class-level machine unlearning (MU) within CIL. Typically, MU methods tend to be time-consuming and can potentially harm the model's performance. A continuous stream of unlearning requests could lead to catastrophic forgetting. To address these issues, we propose a non-destructive eCIL-MU framework based on embedding techniques to map data into vectors and then be stored in vector databases. Our approach exploits the overlap between CIL and MU tasks for acceleration. Experiments demonstrate the capability of achieving unlearning effectiveness and orders of magnitude (upto $\\sim 278\\times$) of acceleration.", "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-04", "journal": {"name": "ArXiv", "volume": "abs/2401.02457"}, "authors": [{"authorId": "2278219835", "name": "Zhiwei Zuo"}, {"authorId": "2242362590", "name": "Zhuo Tang"}, {"authorId": "2278252247", "name": "Bin Wang"}, {"authorId": "2278395518", "name": "Kenli Li"}, {"authorId": "145688317", "name": "Anwitaman Datta"}], "citations": []}
