{"paperId": "53ef1640bc20a21448d656cc4386a7a761ab518c", "publicationVenue": {"id": "1ec5a55c-414e-4f79-b7dc-48e1dba3618e", "name": "IEEE Region 10 Conference", "type": "conference", "alternate_names": ["TENCON", "Digit Process Appl", "Digital Processing Applications", "IEEE Reg 10 Conf"]}, "title": "Creducate: Blockchain-based Academic Record Management and Verification System Built in the Solana Network", "abstract": "Academic records are necessary requirements for employment and further studies. Despite being critical infor-mation that assesses one's eligibility in different disciplines, credentials are oftentimes difficult to acquire and inefficient to handle. Effectively, these manual and centralized processes make academic records vulnerable to fraudulent activities such as tampering and falsification. This project designed an academic record management and verification system using blockchain technology which offers enhanced security, immutability, trans-parency, and process improvement. Unlike previous works that used Bitcoin, Ethereum, or Hyperledger as their blockchain network, this project implemented its decentralized application (dApp) in the Solana network due to its faster processing speed, low-cost transaction fees, and expanding ecosystem. The dApp covers the generation, issuance, and verification of the most commonly requested credentials-the Transcript of Records (TORs) and diplomas. The intended users of this application are the universities, students, and third party entities that need to verify academic credentials for employment or other reasons. It was identified that the blockchain-based system provides a better means to (1) preserve the integrity of academic records, (2) transact between record handlers and requestors and (3) execute the processes of record generation and verification.", "venue": "IEEE Region 10 Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-01", "journal": {"name": "TENCON 2022 - 2022 IEEE Region 10 Conference (TENCON)", "pages": "1-6"}, "authors": [{"authorId": "2197594007", "name": "Diana Vanessa S. Castillo"}, {"authorId": "2197595570", "name": "Chelsee Nicole B. Co"}, {"authorId": "2197593599", "name": "Katrine Grace R. Maranan"}, {"authorId": "2197596135", "name": "Daren Jay Quinio"}, {"authorId": "10437389", "name": "J. Pedrasa"}], "citations": []}
