{"paperId": "54038f406ddf4e30256b9095cf88f36dcbae77b5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Cloud Big Data Mining and Analytics: Bringing Greenness and Acceleration in the Cloud", "abstract": "Big data is gaining overwhelming attention since the last decade. Almost all the fields of science and technology have experienced a considerable impact from it. The cloud computing paradigm has been targeted for big data processing and mining in a more efficient manner using the plethora of resources available from computing nodes to efficient storage. Cloud data mining introduces the concept of performing data mining and analytics of huge data in the cloud availing the cloud resources. But can we do better? Yes, of course! The main contribution of this chapter is the identification of four game-changing technologies for the acceleration of computing and analysis of data mining tasks in the cloud. Graphics Processing Units can be used to further accelerate the mining or analytic process, which is called GPU accelerated analytics. Further, Approximate Computing can also be introduced in big data analytics for bringing efficacy in the process by reducing time and energy and hence facilitating greenness in the entire computing process. Quantum Computing is a paradigm that is gaining pace in recent times which can also facilitate efficient and fast big data analytics in very little time. We have surveyed these three technologies and established their importance in big data mining with a holistic architecture by combining these three gamechangers with the perspective of big data. We have also talked about another future technology, i.e., Neural Processing Units or Neural accelerators for researchers to explore the possibilities. A brief explanation of big data and cloud data mining concepts are also presented here. Hrishav Bakul Barua Embedded Systems and Robotics Research Group (Cognitive Robotics), TCS Research, Kolkata e-mail: hrishav.barua@tcs.com,hbarua@acm.org Kartick Chandra Mondal Department of Information Technology, Jadavpur University, Saltlake, Kolkata 106 e-mail: kartick.mondal@jadavpuruniversity.in 1 ar X iv :2 10 4. 05 76 5v 1 [ cs .O H ] 1 2 A pr 2 02 1 2 Hrishav Bakul Barua and Kartick Chandra Mondal", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-12", "journal": {"name": "ArXiv", "volume": "abs/2104.05765"}, "authors": [{"authorId": "71545750", "name": "H. Barua"}, {"authorId": "34652002", "name": "K. Mondal"}], "citations": [{"paperId": "5a065a57b6b1750048a007fbdec3ce81ba7e9fac", "title": "Green Computing for Big Data and Machine Learning"}, {"paperId": "4692960b0423e297fe9404d0315a899dbcac7357", "title": "Data science and Machine learning in the Clouds: A Perspective for the Future"}]}
