{"paperId": "54101015ed95794ee3cb4dc0bd8df71ab4891910", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Incremental Profit per Conversion: a Response Transformation for Uplift Modeling in E-Commerce Promotions", "abstract": "Promotions play a crucial role in e-commerce platforms, and various cost structures are employed to drive user engagement. This paper focuses on promotions with response-dependent costs, where expenses are incurred only when a purchase is made. Such promotions include discounts and coupons. While existing uplift model approaches aim to address this challenge, these approaches often necessitate training multiple models, like meta-learners, or encounter complications when estimating profit due to zero-inflated values stemming from non-converted individuals with zero cost and profit. To address these challenges, we introduce Incremental Profit per Conversion (IPC), a novel uplift measure of promotional campaigns' efficiency in unit economics. Through a proposed response transformation, we demonstrate that IPC requires only converted data, its propensity, and a single model to be estimated. As a result, IPC resolves the issues mentioned above while mitigating the noise typically associated with the class imbalance in conversion datasets and biases arising from the many-to-one mapping between search and purchase data. Lastly, we validate the efficacy of our approach by presenting results obtained from a synthetic simulation of a discount coupon campaign.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-23", "journal": {"name": "ArXiv", "volume": "abs/2306.13759"}, "authors": [{"authorId": "1712429", "name": "Hugo Proença"}, {"authorId": "143798603", "name": "Felipe Moraes"}], "citations": [{"paperId": "6fdc38cad2499b0fc43f6ed0ef0a0952279d5e6c", "title": "Uplift Modeling: From Causal Inference to Personalization"}]}
