{"paperId": "54121a7eb9444bc7917ffc3ce2ea141bcb062928", "publicationVenue": {"id": "ee60367a-ff4b-4ed1-849e-d747fdbfae4b", "name": "Data Technologies and Applications", "alternate_names": ["Data Technol Appl"], "issn": "2514-9288", "url": "https://www.emerald.com/insight/publication/issn/2514-9288", "alternate_urls": ["http://www.emeraldinsight.com/loi/dta"]}, "title": "A scalable eigenspace-based fuzzy c-means for topic detection", "abstract": "PurposeThe aim of this research is to develop an eigenspace-based fuzzy c-means method for scalable topic detection.Design/methodology/approachThe eigenspace-based fuzzy c-means (EFCM) combines representation learning and clustering. The textual data are transformed into a lower-dimensional eigenspace using truncated singular value decomposition. Fuzzy c-means is performed on the eigenspace to identify the centroids of each cluster. The topics are provided by transforming back the centroids into the nonnegative subspace of the original space. In this paper, we extend the EFCM method for scalability by using the two approaches, i.e. single-pass and online. We call the developed topic detection methods as oEFCM and spEFCM.FindingsOur simulation shows that both oEFCM and spEFCM methods provide faster running times than EFCM for data sets that do not fit in memory. However, there is a decrease in the average coherence score. For both data sets that fit and do not fit into memory, the oEFCM method provides a tradeoff between running time and coherence score, which is better than spEFCM.Originality/valueThis research produces a scalable topic detection method. Besides this scalability capability, the developed method also provides a faster running time for the data set that fits in memory.", "venue": "Data Technologies and Applications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-23", "journal": {"name": "Data Technol. Appl.", "pages": "527-541", "volume": "55"}, "authors": [{"authorId": "3157203", "name": "H. Murfi"}], "citations": []}
