{"paperId": "542308ad5c1c0b5ad88e76e6c8d941a6d08ccd01", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Interpretable Medical Diagnostics with Structured Data Extraction by Large Language Models", "abstract": "Tabular data is often hidden in text, particularly in medical diagnostic reports. Traditional machine learning (ML) models designed to work with tabular data, cannot effectively process information in such form. On the other hand, large language models (LLMs) which excel at textual tasks, are probably not the best tool for modeling tabular data. Therefore, we propose a novel, simple, and effective methodology for extracting structured tabular data from textual medical reports, called TEMED-LLM. Drawing upon the reasoning capabilities of LLMs, TEMED-LLM goes beyond traditional extraction techniques, accurately inferring tabular features, even when their names are not explicitly mentioned in the text. This is achieved by combining domain-specific reasoning guidelines with a proposed data validation and reasoning correction feedback loop. By applying interpretable ML models such as decision trees and logistic regression over the extracted and validated data, we obtain end-to-end interpretable predictions. We demonstrate that our approach significantly outperforms state-of-the-art text classification models in medical diagnostics. Given its predictive performance, simplicity, and interpretability, TEMED-LLM underscores the potential of leveraging LLMs to improve the performance and trustworthiness of ML models in medical applications.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-08", "journal": {"name": "ArXiv", "volume": "abs/2306.05052"}, "authors": [{"authorId": "2165291618", "name": "Aleksa Bisercic"}, {"authorId": "145888108", "name": "Mladen Nikolic"}, {"authorId": "1729969", "name": "M. Schaar"}, {"authorId": "1726756", "name": "Boris Delibasic"}, {"authorId": "2075355152", "name": "P. Lio'"}, {"authorId": "39095636", "name": "A. Petrović"}], "citations": [{"paperId": "881a1dca5ebd88d1967f6aa88893c00df5444250", "title": "Large Language Multimodal Models for 5-Year Chronic Disease Cohort Prediction Using EHR Data"}, {"paperId": "d9403061e3a3392652d037138532fab111c845c1", "title": "Large language models in healthcare and medical domain: A review"}, {"paperId": "e814810e32183529ba7b99feb364ecfd187a67d2", "title": "Astronomical Knowledge Entity Extraction in Astrophysics Journal Articles via Large Language Models"}, {"paperId": "80a69f1dae4df704463e9878cbd902a3302f9dde", "title": "LLMs Understand Glass-Box Models, Discover Surprises, and Suggest Repairs"}, {"paperId": "e2cad0902c1d8f3a219a549a6f8b640241440e1f", "title": "Prompt-NER: Zero-shot Named Entity Recognition in Astronomy Literature via Large Language Models"}]}
