{"paperId": "54432573826a902b9f26fc598fc6ff198ac4e67b", "publicationVenue": {"id": "baa9820d-e273-4dc5-8754-8817abd0e3dd", "name": "Online World Conference on Soft Computing in Industrial Applications", "type": "conference", "alternate_names": ["Winter Simul Conf", "World Conf Soft Comput Ind Appl", "Winter Simulation Conference", "World Conference on Soft Computing in Industrial Applications", "WSC", "Online World Conf Soft Comput Ind Appl"], "url": "http://www.wikicfp.com/cfp/program?id=3156", "alternate_urls": ["http://www.acm.org/sigsim/"]}, "title": "A Testing Based Approach for Security Analysis of Smart Semiconductor Systems", "abstract": "Digital factories have been recognized as a paradigm with considerable promise for improving manufacturing performance. Digital Twins have emerged as a powerful tool to improve control performance for large-scale smart manufacturing systems. We argue that DT-based smart factories are vulnerable to attacks that use the DT to damage the system while remaining undetectable, specifically in high-cost processes, where DT technologies are more likely to be deployed. As an instructive example, we look into smart semiconductor processes with focus on photolithography. To this end, we formulate a static optimization problem to maximize the damage of a cyber-attack against a photolithography digital twin that minimizes detectability to the process controller. Results demonstrate that this problem formulation provides attack policies that successfully reduce the throughput of the system at trade off of increased detectability to a common process control technique. Results encourage more research in the domain, especially to face scalability and policy-like solutions.", "venue": "Online World Conference on Soft Computing in Industrial Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-10", "journal": {"name": "2023 Winter Simulation Conference (WSC)", "pages": "2286-2297"}, "authors": [{"authorId": "2281990110", "name": "Robert Dodge"}, {"authorId": "2248797781", "name": "Giulia Pedrielli"}, {"authorId": "46877961", "name": "Petar Jevtic"}], "citations": []}
