{"paperId": "544a7dfebb5ec911f24e8e7ee3fb3a3f0ce254f5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Adaptive ABAC Policy Learning: A Reinforcement Learning Approach", "abstract": "With rapid advances in computing systems, there is an increasing demand for more effective and efficient access control (AC) approaches. Recently, Attribute Based Access Control (ABAC) approaches have been shown to be promising in fulfilling the AC needs of such emerging complex computing environments. An ABAC model grants access to a requester based on attributes of entities in a system and an authorization policy; however, its generality and flexibility come with a higher cost. Further, increasing complexities of organizational systems and the need for federated accesses to their resources make the task of AC enforcement and management much more challenging. In this paper, we propose an adaptive ABAC policy learning approach to automate the authorization management task. We model ABAC policy learning as a reinforcement learning problem. In particular, we propose a contextual bandit system, in which an authorization engine adapts an ABAC model through a feedback control loop; it relies on interacting with users/administrators of the system to receive their feedback that assists the model in making authorization decisions. We propose four methods for initializing the learning model and a planning approach based on attribute value hierarchy to accelerate the learning process. We focus on developing an adaptive ABAC policy learning model for a home IoT environment as a running example. We evaluate our proposed approach over real and synthetic data. We consider both complete and sparse datasets in our evaluations. Our experimental results show that the proposed approach achieves performance that is comparable to ones based on supervised learning in many scenarios and even outperforms them in several situations.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-18", "journal": {"name": "ArXiv", "volume": "abs/2105.08587"}, "authors": [{"authorId": "1391171722", "name": "Leila Karimi"}, {"authorId": "3094373", "name": "Mai Abdelhakim"}, {"authorId": "2056083684", "name": "J. Joshi"}], "citations": [{"paperId": "28b3d8715feebb1e8a1cbaa1de88be952e97ee85", "title": "Attacks and Defences for ML-enhanced Access Control"}, {"paperId": "c1144febe1168a993621834ecb15f9f251c480da", "title": "Effective Machine Learning-based Access Control Administration through Unlearning"}, {"paperId": "22e4c82d5b32e87bd139dfa6813bbf33b5cbaa5f", "title": "Authorization Recycling in Attribute-Based Access Control"}, {"paperId": "10012533294ce4099dfbd9368bcd16ef21dd6030", "title": "A Dynamic Access Control Model Based on Attributes and Intro VAE"}, {"paperId": "b5b44fdfd1b22b8666c247f6f0676f3ed33f7fc9", "title": "Machine Learning in Access Control: A Taxonomy and Survey"}, {"paperId": "f6591fa6ba676c00f9e88f2fee822c6d4b68ed4d", "title": "PAMMELA: Policy Administration Methodology using Machine Learning"}, {"paperId": "c162bbb6d8f6ba7b92203402b66326f753859928", "title": "Attribute-Based Access Control Policy Generation Approach from Access Logs Based on the CatBoost"}, {"paperId": "6c6f2354b940ca3170f6c3bfa68fa63178641754", "title": "Adversarial Attacks in Machine Learning Based Access Control"}, {"paperId": "0f595da5f03301e1e6cb4dbb31aff3ee137e5bc7", "title": "Administration of Machine Learning Based Access Control"}]}
