{"paperId": "54508c658be1701d099d2c93fded701761d7bd48", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Federated Recommendation with Additive Personalization", "abstract": "Building recommendation systems via federated learning (FL) is a new emerging challenge for advancing next-generation Internet service and privacy protection. Existing approaches train shared item embedding by FL while keeping the user embedding private on client side. However, item embedding identical for all clients cannot capture users' individual differences on perceiving the same item and thus leads to poor personalization. Moreover, dense item embedding in FL results in expensive communication cost and latency. To address these challenges, we propose Federated Recommendation with Additive Personalization (FedRAP), which learns a global view of items via FL and a personalized view locally on each user. FedRAP enforces sparsity of the global view to save FL's communication cost and encourages difference between the two views through regularization. We propose an effective curriculum to learn the local and global views progressively with increasing regularization weights. To produce recommendations for an user, FedRAP adds the two views together to obtain a personalized item embedding. FedRAP achieves the best performance in FL setting on multiple benchmarks. It outperforms recent federated recommendation methods and several ablation study baselines.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-22", "journal": {"name": "ArXiv", "volume": "abs/2301.09109"}, "authors": [{"authorId": "2124848726", "name": "Zhiwei Li"}, {"authorId": "2062835", "name": "Guodong Long"}, {"authorId": "2144115714", "name": "Tianyi Zhou"}], "citations": [{"paperId": "a4d189fb6375245c0d72cc8ad8507708473430df", "title": "Prompt Federated Learning for Weather Forecasting: Toward Foundation Models on Meteorological Data"}]}
