{"paperId": "54508fd111116eaa11590a780d73c9ddf0ec1324", "publicationVenue": {"id": "6864fc0f-dd47-4798-a829-ac53dd78862f", "name": "International ACM SIGACCESS Conference on Computers and Accessibility", "type": "conference", "alternate_names": ["Conference on Computers and Accessibility", "Conf Comput Access", "Int ACM SIGACCESS Conf Comput Access", "ASSETS"], "url": "https://dl.acm.org/conference/assets"}, "title": "Understanding and Improving Information Extraction From Online Geospatial Data Visualizations for Screen-Reader Users", "abstract": "Prior work has studied the interaction experiences of screen-reader users with simple online data visualizations (e.g., bar charts, line graphs, scatter plots), highlighting the disenfranchisement of screen-reader users in accessing information from these visualizations. However, the interactions of screen-reader users with online geospatial data visualizations, commonly used by visualization creators to represent geospatial data (e.g., COVID-19 cases per US state), remain unexplored. In this work, we study the interactions of and information extraction by screen-reader users from online geospatial data visualizations. Specifically, we conducted a user study with 12 screen-reader users to understand the information they seek from online geospatial data visualizations and the questions they ask to extract that information. We utilized our findings to generate a taxonomy of information sought from our participants’ interactions. Additionally, we extended the functionalities of VoxLens—an open-source multi-modal solution that improves data visualization accessibility—to enable screen-reader users to extract information from online geospatial data visualizations.", "venue": "International ACM SIGACCESS Conference on Computers and Accessibility", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-10-22", "journal": {"name": "Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility"}, "authors": [{"authorId": "21548954", "name": "Ather Sharif"}, {"authorId": "2188645988", "name": "Andrew M. Zhang"}, {"authorId": "2188574759", "name": "Anna Shih"}, {"authorId": "1796045", "name": "J. Wobbrock"}, {"authorId": "2832085", "name": "Katharina Reinecke"}], "citations": [{"paperId": "cc22702149318535f7306b84a0d1889f767690e1", "title": "Azimuth: Designing Accessible Dashboards for Screen Reader Users"}, {"paperId": "a7ceec3349b6048bcc44d03cef9df6cf6ccd30fb", "title": "Developing and Deploying a Real-World Solution for Accessible Slide Reading and Authoring for Blind Users"}, {"paperId": "e624a9a294fed65ef0173cfdffdf7364ab696377", "title": "Understanding Strategies and Challenges of Conducting Daily Data Analysis (DDA) Among Blind and Low-vision People"}, {"paperId": "e1bde4fe7f4653a5a0a087bb1d78efa832f70969", "title": "Beyond Alternative Text and tables: Comparative Analysis of Visualization Tools and Accessibility Methods"}, {"paperId": "e8cd3cfc00a9cc74d5ef55c7fde49a7528ffe5f2", "title": "Description of dynamic images: a systematic mapping for the understanding and transparency of information that may be perceptible visually impaired citizens"}, {"paperId": "bc044f00f72063821d24ccb069b2114c04c07fcb", "title": "Understanding and Improving Drilled-Down Information Extraction from Online Data Visualizations for Screen-Reader Users"}, {"paperId": "6b563e7e58ba7486921445dca4d4366cc6fe28b8", "title": "Exploring Chart Question Answering for Blind and Low Vision Users"}, {"paperId": "7870899ba13ddb68f18dfd0144c8e37fc4ed1541", "title": "A11yBoard: Making Digital Artboards Accessible to Blind and Low-Vision Users"}, {"paperId": "0fb0e9c7347f39da017230da6c4860a46ab95997", "title": "How Do Low-Vision Individuals Experience Information Visualization?"}]}
