{"paperId": "5451cce65b8384ef1df11ba3dd11921255afa9fb", "publicationVenue": {"id": "bd8cce07-a594-468d-9b02-064e352e17e4", "name": "Coatings", "type": "journal", "alternate_names": ["Coat", "THE Coatings"], "issn": "2079-6412", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-212365", "alternate_urls": ["https://www.mdpi.com/journal/coatings", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-212365"]}, "title": "Materials, Structures, and Applications of iTENGs", "abstract": "Implantable triboelectric nanogenerators (iTENG) have emerged as a promising technology for self-powered biomedical devices. This review explores the key aspects of materials, structures, and representative applications of iTENGs. The materials section discusses the core triboelectric layer, electrode layer, and encapsulation layer, emphasizing the importance of biocompatibility and mechanical flexibility. The structural design section delves into three common modes: contact–separation mode, single-electrode mode, and free-standing mode, highlighting their working principles and advantages. The application section covers diverse areas such as cardiac devices, sterilization processes, and anticancer therapies, showcasing the potential of iTENGs to revolutionize healthcare. Moreover, it discusses the challenges and future directions for material development, structural design optimization, conformal matching, and practical implementation of iTENGs. This comprehensive review provides valuable insights into the materials, structures, and applications of iTENGs, serving as a resource for researchers and engineers in the field.", "venue": "Coatings", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-10", "journal": {"name": "Coatings"}, "authors": [{"authorId": "2160546276", "name": "Yuan Xi"}, {"authorId": "150347604", "name": "Yubo Fan"}, {"authorId": "121544553", "name": "Zhou Li"}, {"authorId": "46271477", "name": "Zhuo Liu"}], "citations": [{"paperId": "0049c4237202d6c3b6917734131a8417ec8bc74b", "title": "Recent Progress of Nature Materials Based Triboelectric Nanogenerators for Electronic Skins and Human–Machine Interaction"}]}
