{"paperId": "54688ea7ccf3ee83809002935e795eba7b992b86", "publicationVenue": null, "title": "River regulation and resilience: an approach for the Yangtze watershed", "abstract": "Many studies have focused on analyzing variation characteristics of the watershed resilience based on different indicators, while few efforts have been made to quantificationally evaluate contributions of climatic and anthropogenic factors to the varied resilience. In this study, we investigate changes in the seasonal runoff resilience of the entire Yangtze River basin during 1961–2014 by using a convex model and a resilience indicator (Pi). The MIKE 11HD model and the regression method were adopted to further differentiate effects of climate variations and human activities. Results show that climate variation (especially droughts and floods) and human activities exert negative and positive effects, respectively, and become primary reasons for falling and increasing trends in entire watershed resilience. These impacts grow with time under the gradually intensified climate variability and human activity.", "venue": "", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-02-02", "journal": {"name": "Water supply", "volume": ""}, "authors": [{"authorId": "2108153134", "name": "Congcong Liu"}, {"authorId": "88728833", "name": "Yuanfang Chai"}, {"authorId": "107774883", "name": "Boyuan Zhu"}, {"authorId": "7607688", "name": "Yunping Yang"}, {"authorId": "8342803", "name": "Jinyun Deng"}, {"authorId": "2109370575", "name": "Yong Hu"}], "citations": [{"paperId": "6653100ae85a438ebc34641e230b0b755c44711b", "title": "Streamflow-based watershed resilience assessment in a tropical savannah region of India"}, {"paperId": "20cdf13518fb46729b76b6fd7f5703dcbff438e8", "title": "Identifying groundwater resilience zones in an arid inland basin using GIS-based Dempster-Shafer theory"}, {"paperId": "4125e5a15bbf31f7c53e7cad9c6f400db80393c9", "title": "Flow resistance adjustments of channel and bars in the middle reaches of the Yangtze River in response to the operation of the Three Gorges Dam"}]}
