{"paperId": "546f3a2c905116d6f9f15ed9b6fbab84c36dd47d", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "A Comparison of End-to-End Decision Forest Inference Pipelines", "abstract": "Decision forest, including RandomForest, XGBoost, and LightGBM, dominates the machine learning tasks over tabular data. Recently, several frameworks were developed for decision forest inference, such as ONNX, TreeLite from Amazon, TensorFlow Decision Forest from Google, HummingBird from Microsoft, Nvidia FIL, and lleaves. While these frameworks are fully optimized for inference computations, they are all decoupled with databases and general data management frameworks, which leads to cross-system performance overheads. We first provided a DICT model to understand the performance gaps between decoupled and in-database inference. We further identified that for in-database inference, in addition to the popular UDF-centric representation that encapsulates the ML into one User Defined Function (UDF), there also exists a relation-centric representation that breaks down the decision forest inference into several fine-grained SQL operations. The relation-centric representation can achieve significantly better performance for large models. We optimized both implementations and conducted a comprehensive benchmark to compare these two implementations to the aforementioned decoupled inference pipelines and existing in-database inference pipelines such as Spark-SQL and PostgresML. The evaluation results validated the DICT model and demonstrated the superior performance of our in-database inference design compared to the baselines.", "venue": "ACM Symposium on Cloud Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-10-30", "journal": {"name": "Proceedings of the 2023 ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "2264536260", "name": "Hong Guan"}, {"authorId": "2256983271", "name": "Saif Masood"}, {"authorId": "87574963", "name": "Mahidhar Dwarampudi"}, {"authorId": "2204954017", "name": "Venkatesh Gunda"}, {"authorId": "2263978478", "name": "Hong Min"}, {"authorId": "2264225211", "name": "Lei Yu"}, {"authorId": "2263997384", "name": "Soham Nag"}, {"authorId": "2237786723", "name": "Jia Zou"}], "citations": []}
