{"paperId": "5471f0b024d00b939e6f7d9dcc00101201a13429", "publicationVenue": {"id": "f63e4bb3-0e34-4ab9-8bf1-45fa94f94fe1", "name": "International Conference on Recent Advances and Innovations in Engineering", "type": "conference", "alternate_names": ["ICRAIE", "Int Conf Recent Adv Innov Eng"]}, "title": "An Efficient Approach for Track Data Simplification in Geographic Information System", "abstract": "There is a phenomenal growth in geospatial data due to rapid advancement in remote sensing technologies. Geospatial data has become ubiquitous in many applications such as disaster management, town planning, environmental observations, military systems, etc. The demand for geospatial data and related technologies is increasing continuously due to easy access to high resolution geospatial data at an affordable cost. Furthermore, modern computing systems enables to store and process these high-resolution data within a tolerable time limit. Track datasets are geospatial data that represents the information about geospatial movements of objects or events sensed from moving sensors. A track is a spatio-temporal data measured in land, sea and air through a sensor such as RADAR, SONAR or LiDAR. A track data can be modelled as position, speed, time etc. of an object or event. During the capture and monitoring of track data, the volume of data generated is very large and depends on time and space resolution of the measuring sensor. Track data are very much useful in analyzing and planning of land, water and air path navigation.The track data is being recorded in a very high volume, thus processing and displaying it in real time becomes a challenging task. It is very much necessary to reduce the track dataset without affecting the track shape and size significantly. i.e the route is being simplified with few numbers of joining points or polygons, which makes the visualisation process easy and interactive. In this paper, we propose an efficient approach for implementation of Douglas-Peucker algorithm for Map simplification of track data. Douglas-Peucker algorithm is one of the classic and popular algorithms that is generally applied for line simplification. The current work modifies this existing algorithm and adapt it for simplifying the history of a track for efficient map rendering. This reduces the track size significantly while preserving its original shape and size.", "venue": "International Conference on Recent Advances and Innovations in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 7th International Conference on Recent Advances and Innovations in Engineering (ICRAIE)", "pages": "116-120", "volume": "7"}, "authors": [{"authorId": "49165631", "name": "R. Kumar"}, {"authorId": "103107743", "name": "Dilip Kumar Dalei"}, {"authorId": "2210516226", "name": "Rakesh Kp"}, {"authorId": "1486327088", "name": "R. A"}, {"authorId": "47184224", "name": "N. Panigrahi"}], "citations": []}
