{"paperId": "547c01067f177adf57ec00e959d9db56b49a15ad", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A Low-Latency Approach for RFF Identification in Open-Set Scenarios", "abstract": "Radio frequency fingerprint (RFF) identification represents a promising technique for lightweight device authentication. However, current research on RFF primarily focuses on the close-set recognition assumption. Moreover, the high computational complexity and excessive latency during the identification stage represent an intolerable burden for Internet of Things (IoT) devices. In this paper, we propose a deep-learning-based RFF identification framework in relation to open-set scenarios. Specifically, we leverage a simulated training scheme, in which we strategically designate certain devices as simulated unknowns. This allows us to fine-tune our extractor to better handle open-set recognition. Additionally, we construct an exemplar set that only contains representative RFF features to further reduce time consumption in the identification stage. The experiments are carried out on a hardware platform involving LoRa devices and using a USRP N210 software-defined radio receiver. The results show that the proposed framework can achieve 90.23% accuracy for rogue device detection and 93.85% accuracy for legitimate device classification. Furthermore, it is observed that using an exemplar set consisting of half the total data size can reduce the time overhead by 58% compared to using the entire dataset.", "venue": "Electronics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-17", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2208115868", "name": "Bo Zhang"}, {"authorId": "2266166539", "name": "Tao Zhang"}, {"authorId": "2183586634", "name": "Yuanyuan Ma"}, {"authorId": "51195717", "name": "Zesheng Xi"}, {"authorId": "2115068856", "name": "Chuan He"}, {"authorId": "2108852333", "name": "Yu-Na Wang"}, {"authorId": "2280382053", "name": "Zhuo Lv"}], "citations": []}
