{"paperId": "548606d39683c8ba4d40ab7629fb3f3d1c39f31c", "publicationVenue": null, "title": "CURRENT STATE AND DEVELOPMENT PROSPECTS OF HETEROGENEOUS STREAMING DATA PROCESSING METHODS", "abstract": "Heterogeneous streaming data processing is a rapidly expanding field of research and development in data processing and analytics. The proliferation of diverse data sources, including social media, sensor networks, and Internet of Things (IoT) devices, has resulted in an increasing heterogeneity of streaming data in terms of data types, formats, and velocities. This presents significant challenges in processing and analyzing real-time data for actionable insights. The diversity of data types, formats, and velocities in streaming data introduces complexities that require advanced techniques and algorithms for effective processing and analysis. Data streams can consist of various data types, such as text, images, videos, sensor readings, and social media posts, each with its unique characteristics and structures. Data streams can arrive in different formats, including structured, semi-structured, and unstructured data, which may require different processing approaches. Тhe velocities at which data streams are generated can vary, ranging from high-velocity data streams that demand real-time processing to low-velocity data streams that allow batch processing. Addressing the heterogeneity of streaming data requires robust techniques that can handle diverse data types, formats, and velocities to ensure accurate and meaningful real-time data analysis. This review analyses the current research and publications on heterogeneous streaming data processing. The challenges and opportunities in processing diverse data streams in real-time, is discussed. The latest research and publications in this area are reviewed, including advancements in stream processing frameworks, machine learning algorithms, edge computing, IoT, AI, and quantum computing. The paper determines the purpose of the research, which is to provide an overview of the current state and development prospects of heterogeneous streaming data processing; presents the leading research material, including key findings and insights from recent studies. The paper concludes with prospects for further research and innovation in this field, highlighting the need to address challenges such as data heterogeneity, data velocity, concept drift, privacy and security, explainability, and the potential of quantum computing for real-time data processing.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2203636618", "name": "M.V. Ilin"}, {"authorId": "143680851", "name": "L. Oleshchenko"}], "citations": []}
