{"paperId": "549ab15619c2d33b44260e5facbc76751d26d07e", "publicationVenue": {"id": "17502c4a-dfa2-49ca-8d67-aea4259aa718", "name": "International Journal of Knowledge Discovery in Bioinformatics", "type": "journal", "alternate_names": ["Int J Knowl Discov Bioinform"], "issn": "1947-9115", "url": "http://www.igi-global.com/IJKDB", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-knowledge-discovery-bioinformatics/1143"]}, "title": "Time-Aware Task Allocation for Cloud Computing Environment", "abstract": "Cloud computing provides access to various services such as servers, storage and applications to the customers' as and when required. The services on the cloud can be accessed with minimum efforts through any handheld devices that are connected to the Internet. In IaaS cloud, the services to the customers are provided in the form of two leases, AR and BE. Here, a running BE lease can be preempted upon arrival of an AR lease as BE has lower priority. However, frequent preemption of the BE lease causes an overhead to the system and leads to customer dissatisfaction. In this paper, we propose a fairness algorithm called TATA to provide fairness among the leases. We evaluate the proposed algorithm on various synthetic datasets and compare the results with an existing fairness algorithm. The results of simulation show that TATA produces better response time for both the leases than the existing algorithm.", "venue": "International Journal of Knowledge Discovery in Bioinformatics", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Int. J. Knowl. Discov. Bioinform.", "pages": "1-13", "volume": "7"}, "authors": [{"authorId": "22741144", "name": "Sushanta Meher"}, {"authorId": "27004821", "name": "S. K. Pande"}, {"authorId": "2703203", "name": "S. K. Panda"}], "citations": [{"paperId": "d4fee4868f453dd5670521acaf18e0e5ea17a5cc", "title": "Estimation of Fractal Dimension in Different Color Model"}]}
