{"paperId": "549e122e7612b3b06612bd8471ed9470287fd06f", "publicationVenue": {"id": "0f276dc7-7c36-4465-aab9-b358ee2dafa9", "name": "International Journal of Data Warehousing and Mining", "type": "journal", "alternate_names": ["Int J Data Warehous Min"], "issn": "1548-3924", "url": "http://www.idea-group.com/journals/details.asp?id=4291", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-data-warehousing-mining/1085"]}, "title": "A Novel Method for Classifying Function of Spatial Regions Based on Two Sets of Characteristics Indicated by Trajectories", "abstract": "Trajectory is a significant factor for classifying functions of spatial regions. Many spatial classification methods use trajectories to detect buildings and districts in urban settings. However, methods that only take into consideration the local spatiotemporal characteristics indicated by trajectories may generate inaccurate results. In this article, a novel method for classifying function of spatial regions based on two sets of characteristics indicated by trajectories is proposed, in which the local spatiotemporal characteristics as well as the global connection characteristics are obtained through two sets of calculations. The method was evaluated in two experiments: one that measured changes in the classification metric through a splits ratio factor, and one that compared the classification performance between the proposed method and methods based on a single set of characteristics. The results showed that the proposed method is more accurate than the two traditional methods, with a precision value of 0.93, a recall value of 0.77, and an F-Measure value of 0.84.", "venue": "International Journal of Data Warehousing and Mining", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Int. J. Data Warehous. Min.", "pages": "1-19", "volume": "16"}, "authors": [{"authorId": "2116009739", "name": "Haitao Zhang"}, {"authorId": "2024803451", "name": "Che Yu"}, {"authorId": "2122756037", "name": "Yan Jin"}], "citations": []}
