{"paperId": "54a13ffd32519c18d7f453b597a66c248bc046a7", "publicationVenue": {"id": "d8ec66ab-0083-4a4d-bf44-ce85d2daad69", "name": "Hawaii International Conference on System Sciences", "type": "conference", "alternate_names": ["HICSS", "Hawaii Int Conf Syst Sci"], "url": "http://www.hicss.hawaii.edu/"}, "title": "A Capability Approach for Designing Business Intelligence and Analytics Architectures", "abstract": "Business Intelligence and Analytics (BIA) is subject to an ongoing transformation, both on the technology and the business side. Given the lack of readyto-use blueprints for the plethora of novel solutions and the ever-increasing variety of available concepts and tools, there is a need for conceptual support for architecture design decisions. After conducting a series of interviews to explore the relevance and direction of an architectural decision support concept, we propose a capability schema that involves actions, expected outcomes, and environmental limitations to identify fitting architecture designs. The applicability of the approach was evaluated with two cases. The results show that the derived framework can support the systematic development of fundamental architecture requirements. The work contributes to research by illustrating how to capture the elusive capability concept and showing its relation to BIA architectures. For further generalization, we created an open online repository to collect BIA capabilities and architectural designs.", "venue": "Hawaii International Conference on System Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-07", "journal": {"pages": "1-10"}, "authors": [{"authorId": "1877212", "name": "Julian Ereth"}, {"authorId": "144331062", "name": "H. Baars"}], "citations": [{"paperId": "0daa86872eceb14f89b225afb9ceedd47d2a0f1c", "title": "Approaching towards sustainable supply chain under the spotlight of business intelligence"}, {"paperId": "2c23b3ab3bae33776dab001948f1dffd285b0c97", "title": "A Machine Learning Model Marketplace to Overcome Low Price Elasticity of Sales Forecasting"}]}
