{"paperId": "54b50783b84694a7407bc770adc5b99f73b44603", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Reliability-Aware Multi-Objective Memetic Algorithm for Workflow Scheduling Problem in Multi-Cloud System", "abstract": "With the development of cloud computing, multi-cloud systems have become common platforms for hosting and executing workflow applications in recent years. However, the complexity of workflow scheduling increases exponentially because of the diversified billing mechanisms, heterogeneous virtual machines, and reliability of multi-cloud systems. This article focuses on a multi-objective workflow scheduling problem in multi-cloud systems (MOWSP-MCS). The makespan, cost, and reliability are considered the optimization objectives from the perspective of users. Compared with the classical multi-objective workflow scheduling in the cloud environment, MOWSP-MCS allows users to apply the backup technique to improve reliability. To solve the MOWSP-MCS, this article proposes a reliability-aware multi-objective memetic algorithm (RA-MOMA) containing a diversification strategy and intensification strategy. In the diversification strategy, several problem-specific genetic operators are introduced to construct the diversified offspring individuals. In the intensification strategy, four problem-specific neighborhood operators are designed based on the critical path and resource utilization rate to improve the quality of the individuals in the archive set. A comprehensive numerical experiment is conducted to evaluate the effectiveness of RA-MOMA. The comparisons with several related algorithms demonstrate the superiority of RA-MOMA for solving the MOWSP-MCS.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1343-1361", "volume": "34"}, "authors": [{"authorId": "48330634", "name": "Shuo Qin"}, {"authorId": "144312796", "name": "D. Pi"}, {"authorId": "37592500", "name": "Zhongshi Shao"}, {"authorId": "2143570488", "name": "Yue Xu"}, {"authorId": "145906066", "name": "Yang Chen"}], "citations": [{"paperId": "745f2f0e6f55e98fed1ae52f4a6b7420afca3db9", "title": "A bi-objective workflow scheduling in virtualized fog-cloud computing using NSGA-II with semi-greedy initialization"}, {"paperId": "ebba2a1099782ae2b2eb45a25229255fed1bc795", "title": "Efficient Resource Utilization in IoT and Cloud Computing"}, {"paperId": "223116045a4807b941f95ce68b8161ac8f8d039d", "title": "Workflow Scheduling Scheme for Optimized Reliability and End-to-End Delay Control in Cloud Computing Using AI-Based Modeling"}, {"paperId": "a691cdff29688ca88c42a1abea209cb1bf5224f7", "title": "Makespan and Energy Aware Workflow Scheduling in JointCloud Systems"}, {"paperId": "cb05bb682ff1767b08903c34cacc75c6d3285fa9", "title": "An Archive-Guided Equilibrium Optimizer Based on Epsilon Dominance for Multi-Objective Optimization Problems"}, {"paperId": "bfd5f4bc11603321a46cf2bf25f752207c700940", "title": "Multi Objective Prioritized Workflow Scheduling Using Deep Reinforcement Based Learning in Cloud Computing"}]}
