{"paperId": "54bde7504a55de4e5c629edec726e65acd4b1a2f", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Practice and Key Technologies of Integration and Sharing of Water Resources and Data Resources Based on Cloud Computing", "abstract": "The study of how to construct the integration mode of water conservancy information resources for water conservancy applications is extremely practical. This paper discusses the history of cloud computing and data centers, as well as the development paths of related technologies, and proposes the use of cloud computing to integrate and share water conservation data resources. The current state of water conservation informatization, as well as its characteristics and future development trends, is investigated. The regional water conservancy integrated management system is analyzed in detail according to the process and ideas of software project design and development, and the overall architecture model based on cloud computing is determined by analyzing relevant regulations of water conservancy informatization infrastructure and the actual situation of water conservancy informatization construction in sample areas. And the system’s specific functions are designed and presented. This method has changed the traditional concept and mode of water conservation business management, and it can achieve service value-added and efficient and low-cost development and utilization of information resources, according to practice.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-18", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2146327337", "name": "Fang Li"}, {"authorId": "51111081", "name": "Luofeng Xie"}, {"authorId": "2128988238", "name": "Weidong Huang"}], "citations": []}
