{"paperId": "54bd554d324e37202637f90669be23bd57cbf05e", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Towards Optimal Parallelism-Aware Service Chaining and Embedding", "abstract": "Emerging 5G technologies can significantly reduce end-to-end service latency for applications requiring strict quality of service (QoS). With network function virtualization (NFV), to complete a client’s request from those applications, the client’s data can sequentially go through multiple service functions (SFs) for processing/analysis but introduce additional processing delay. To reduce the processing delay from the serially-running SFs, network function parallelism (NFP) that allows multiple SFs to run in parallel is introduced. In this work, we study how to apply NFP into the SF chaining and embedding process such that the latency, including processing and propagation delays, can be jointly minimized. We introduce a novel augmented graph to address the parallel relationship constraint among the required SFs. Considering parallel relationship constraints, we propose a novel problem called parallelism-aware service function chaining and embedding (PSFCE). For this problem, we propose a near-optimal maximum parallel block gain (MPBG) first optimization algorithm when computing resources at each physical node are enough to host the required SFs. When computing resources are limited, we propose a logarithm-approximate algorithm, called parallelism-aware SFs deployment (PSFD), to jointly optimize processing and propagation delays. We conduct extensive simulations on multiple network scenarios to evaluate the performances of our schemes. Accordingly, we find that (i) MPBG is near-optimal, (ii) the optimization of end-to-end service latency largely depends on the processing delay in small networks and is impacted more by the propagation delay in large networks, and (iii) PSFD outperforms the schemes directly extended from existing works regarding end-to-end latency.", "venue": "IEEE Transactions on Network and Service Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-09", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "2063-2077", "volume": "19"}, "authors": [{"authorId": "22233220", "name": "Danyang Zheng"}, {"authorId": "144757016", "name": "G. Shen"}, {"authorId": "4526268", "name": "Xiaojun Cao"}, {"authorId": "145059625", "name": "B. Mukherjee"}], "citations": [{"paperId": "9fb86d3ab9108cf625d5a9bb5de04d3a8bf0c240", "title": "Energy- and Reliability-Aware Provisioning of Parallelized Service Function Chains With Delay Guarantees"}, {"paperId": "85fdf21e912b3d55cc30dc72b918601a20df6f82", "title": "Energy efficient and delay aware deployment of parallelized service function chains in NFV-based networks"}, {"paperId": "788aa389d0ea44c3bc8ac81259f2745ee86b7652", "title": "Cost Optimization in Security-Aware Service Function Chain Deployment with Diverse Vendors"}, {"paperId": "9678a87a30a342efa221bd5e8ce8dddc97b4188d", "title": "User Allocation in NOMA-Based Edge Computing Environment"}, {"paperId": "c8d3c97f6767b1cccda573123c94c808186f148e", "title": "Service Function Chaining and Embedding With Heterogeneous Faults Tolerance in Edge Networks"}, {"paperId": "a2a3c4de2e8f676b4a092fa7603f00f29d884ce1", "title": "Network Function Virtualization in Elastic Optical Networks"}, {"paperId": "2dd3d1f90419e66642806865174e7db89bce8c45", "title": "Towards deploying SFC with parallelized VNFs under resource demand uncertainty in mobile edge computing"}, {"paperId": "8977aea0c15731ac1859f343eff94267e13cda3c", "title": "On the Game-Theoretic Analysis of Dynamic VNF Service Chaining in Edge-Cloud EONs"}, {"paperId": "5de0a351aa4e5743bd3a5eb53ef14dbfa69c87c0", "title": "Towards Service Function Chaining and Embedding for Multi-Security Guarantee Levels"}, {"paperId": "c5cdf036bc740087c62826af89cedb75caa279d2", "title": "Off-site protection against service function forwarder failures in NFV"}, {"paperId": "bc28adf8b148b94bc973a6db157e11031f5946b5", "title": "Resource consumption and security-aware multi-tenant service function chain deployment based on hypergraph matching"}, {"paperId": "b98d88a527260ec4e744b0f536cd75c553af8f40", "title": "Towards Deterministic Fault-Tolerant Service Function Slicing in Edge Networks"}, {"paperId": "03510cc9d38d079cf972b1aa90862c4b0a7c6f4e", "title": "FlexSFC: Flexible Resource Allocation and VNF Parallelism for Improved SFC Placement"}, {"paperId": "7e518e91e4787eb22ae775fe5f80a02ff3030dde", "title": "CloudSimSFC: Simulating Service Function chains in Multi-Domain Service Networks"}]}
