{"paperId": "54cb2ca4f41fe056bdd517d783f347832f211b34", "publicationVenue": {"id": "bf228014-e6ea-4397-96c9-3fd22beb2f75", "name": "British Journal of Educational Technology", "type": "journal", "alternate_names": ["Br J Educ Technol"], "issn": "0007-1013", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1467-8535", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/14678535"]}, "title": "Technology integration in higher education and student privacy beyond learning environments - A comparison of the UK and US perspective", "abstract": "Technology integration in higher education (HE) has brought immense innovation. While research is investigating the benefits of leveraging, through learning analytics, the data created by the greater presence of technology in HE, it is also analysing the privacy implications of vast universes of data now at the fingertips of HE administrators. This paper argues that student privacy challenges linked to technology integration occur not only within but also beyond learning environments, namely at the enterprise level. By analysing the UK and US legal frameworks surrounding how HE institutions respond to parents demanding disclosure of their adult children's personal data in the event of mental health crises, this paper offers an example of real and complex privacy issues, often overlooked by interdisciplinary inquiry, that exist in the ‘interstitial space’ between HE technology and privacy law. The purpose of conducting a comparative analysis was to demonstrate that countries with different privacy regimes are similarly ill‐equipped to address certain student privacy issues at the HE enterprise level, leaving HEIs exposed to potential litigation/regulatory risks. The contribution of this work is to invite greater interdisciplinary awareness of, and inquiry into, student privacy beyond learning environments.", "venue": "British Journal of Educational Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-18", "journal": {"name": "Br. J. Educ. Technol.", "pages": "1587-1603", "volume": "54"}, "authors": [{"authorId": "101658325", "name": "Iria Giuffrida"}, {"authorId": "49273025", "name": "A. Hall"}], "citations": []}
