{"paperId": "54ec8d6aea600a74d0fe3fc07a0712b8ff84edb2", "publicationVenue": null, "title": "Analyzing Surgical Treatment of Intestinal Obstruction in Children with Artificial Intelligence", "abstract": "Intestinal obstruction is a common surgical emergency in children. However, it is challenging to seek appropriate treatment for childhood ileus since many diagnostic measures suitable for adults are not applicable to children. The rapid development of machine learning has spurred much interest in its application to medical imaging problems but little in medical text mining. In this paper, a two-layer model based on text data such as routine blood count and urine tests is proposed to provide guidance on the diagnosis and assist in clinical decision-making. The samples of this study were 526 children with intestinal obstruction. Firstly, the samples were divided into two groups according to whether they had intestinal obstruction surgery, and then, the surgery group was divided into two groups according to whether the intestinal tube was necrotic. Specifically, we combined 63 physiological indexes of each child with their corresponding label and fed them into a deep learning neural network which contains multiple fully connected layers. Subsequently, the corresponding value was obtained by activation function. The 5-fold cross-validation was performed in the first layer and demonstrated a mean accuracy (Acc) of 80.04%, and the corresponding sensitivity (Se), specificity (Sp), and MCC were 67.48%, 87.46%, and 0.57, respectively. Additionally, the second layer can also reach an accuracy of 70.4%. This study shows that the proposed algorithm has direct meaning to processing of clinical text data of childhood ileus.", "venue": "Comput. Math. Methods Medicine", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-11", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2021"}, "authors": [{"authorId": "37292040", "name": "Wangren Qiu"}, {"authorId": "2146661766", "name": "Gang Chen"}, {"authorId": "2110491596", "name": "Jin Wu"}, {"authorId": "2122916251", "name": "Jun Lei"}, {"authorId": "2112281342", "name": "Lei Xu"}, {"authorId": "1709459", "name": "Shouhua Zhang"}], "citations": [{"paperId": "c17d03d8147a9306a249a95db8062fd0778f0f24", "title": "Performance Analysis of Different Classifiers for Tele-Diagnosis of Parkinson’s Disease"}]}
