{"paperId": "54efe3aadf8d793f0332c8c213a09fc7d2ff15c8", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Aligning Multidimensional Worldviews and Discovering Ideological Differences", "abstract": "The Internet is home to thousands of communities, each with their own unique worldview and associated ideological differences. With new communities constantly emerging and serving as ideological birthplaces, battlegrounds, and bunkers, it is critical to develop a framework for understanding worldviews and ideological distinction. Most existing work, however, takes a predetermined view based on political polarization: the “right vs. left” dichotomy of U.S. politics. In reality, both political polarization – and worldviews more broadly – transcend one-dimensional difference, and deserve a more complete analysis. Extending the ability of word embedding models to capture the semantic and cultural characteristics of their training corpora, we propose a novel method for discovering the multifaceted ideological and worldview characteristics of communities. Using over 1B comments collected from the largest communities on Reddit.com representing ~40% of Reddit activity, we demonstrate the efficacy of this approach to uncover complex ideological differences across multiple axes of polarization.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "4832-4845"}, "authors": [{"authorId": "2139750731", "name": "Jeremiah Milbauer"}, {"authorId": "2142533219", "name": "Adarsh Mathew"}, {"authorId": "144002439", "name": "James A. Evans"}], "citations": [{"paperId": "4e221efad0dccfaa5c16a0b77780286a1c3884af", "title": "Reading Between the Tweets: Deciphering Ideological Stances of Interconnected Mixed-Ideology Communities"}, {"paperId": "f6692b7480c72133f2582d355353c7056f657da4", "title": "Fixing Fieldnotes: Developing and Testing a Digital Tool for the Collection, Processing, and Analysis of Ethnographic Data"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}, {"paperId": "a1f55b190418226d43874b90acc78cc3d4212c63", "title": "Dialectograms: Machine Learning Differences between Discursive Communities"}, {"paperId": "416e92370e15e25ec23547ef32e6c1702c1ca1fc", "title": "CommunityLM: Probing Partisan Worldviews from Language Models"}, {"paperId": "f954ada7ce9080800a66c4193d2bd3bb025e9edd", "title": "Socio-semantic networks as mutualistic networks"}, {"paperId": "b0057f0b5b7e9b127b195190ef99437281df9ec0", "title": "AI-Augmented Surveys: Leveraging Large Language Models for Opinion Prediction in Nationally Representative Surveys"}]}
