{"paperId": "54f4f3e37abde022a5b2f09bedc23f97a80111e5", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "On the Employment of Machine Learning in the Blockchain Selection Process", "abstract": "Given the growing increase in the number of blockchain (BC) platforms, cryptocurrencies, and tokens, non-technical individuals face a complex question when selecting a BC that meets their requirements (e.g., performance or security). In addition, current approaches that aid such a selection process present drawbacks (e.g., require specific BC knowledge or are not automated and scalable), which hinders the decision process even further. Fortunately, techniques such as Machine Learning (ML) allow the creation of selection models without human interaction by identifying the BC features that match the requirements provided by the user in an automated and flexible manner. Thus, this work presents the design and implementation of an ML-based BC selection approach that employs five ML models to select the most suitable BC given user requirements (e.g., BC popularity, fast block inclusion, or Smart Contract - SC support). The approach follows an ML-specific data flow and defines a novel equation to quantify the popularity of a BC. Furthermore, it details the models’ accuracy and functionality in two distinct use cases, which shows their good accuracy (>85%). Finally, discussions on (a) the ML usefulness, (b) advantages over rule-based systems, and (c) the most relevant features for the BC selection are presented.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3835-3846", "volume": "19"}, "authors": [{"authorId": "145759867", "name": "E. Scheid"}, {"authorId": "2187543472", "name": "Ratanak Hy"}, {"authorId": "3404941", "name": "M. Franco"}, {"authorId": "3410403", "name": "Christian Killer"}, {"authorId": "9304846", "name": "B. Stiller"}], "citations": []}
