{"paperId": "55166e766e6f5528e3d2870d0e783fee19eafb88", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "HaaS: Cloud-Based Real-Time Data Analytics with Heterogeneity-Aware Scheduling", "abstract": "Real-time data analytics has become increasingly important in modern times as many organizations and companies are generating and analyzing high volume of data constantly. Despite of the impressive technical development, it remains a challenging job to analyze the stream data effectively and efficiently because traditional hardware and software lack specific designs and optimizations for those emerging requirements. In this paper, we discuss our experience on real-time data analytics, with our in-house processing framework HaaS. HaaS is designed to exploit existing data analytics tools and libraries as well as distributed computing technologies to embrace heterogeneous computation resources in the cloud. HaaS utilizes hierarchical clustering to partition physical topology of clusters weighted with task topology information into densely connected sub-graphs. HaaS is also equipped with a heterogeneity-aware scheduling algorithm to facilitate holistic optimization over multiple running tasks with various service level agreements. To the best of our knowledge, HaaS is the first ever streaming analytical framework providing users with flexible and optimized usage with CPUs, GPUs and FPGAs in the cloud. Users with stream processing tasks can easily enjoy remarkable advantages of CPUs, GPUs and FPGAs in throughput, power consumption and monetary cost over others. In our empirical evaluations with highly diversified workloads, HaaS saves over 18% on power consumption and 24% on monetary cost over existing system design architecture, while the overall throughput of HaaS remains no lower than 90% of the theoretical limit.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 IEEE 38th International Conference on Distributed Computing Systems (ICDCS)", "pages": "1017-1028"}, "authors": [{"authorId": "1790604", "name": "Jiong He"}, {"authorId": "2118360721", "name": "Yao Chen"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "2058154306", "name": "Xin Long"}, {"authorId": "145136558", "name": "M. Winslett"}, {"authorId": "49648189", "name": "Liang You"}, {"authorId": "2109512262", "name": "Zhenjie Zhang"}], "citations": [{"paperId": "63515650fa2f89ba35a0075d1e3f084124ce76c1", "title": "An adaptive load balancing strategy for stateful join operator in skewed data stream environments"}, {"paperId": "1fb367def62cd3fe9449f512fc9dba9d49021f7e", "title": "Stream processing technology based on FPGA network service"}, {"paperId": "b78c4f6e49ea469a85bd7d5e669868e58fdc568b", "title": "A multi-level collaborative framework for elastic stream computing systems"}, {"paperId": "2dc3554ac4405767c1911129a39ae75837fe87de", "title": "Exploiting Computation Reuse in Cloud-Based Deep Learning via Input Reordering"}, {"paperId": "079539d763b04fdf026c2344623bec92a217ad39", "title": "Resource Management and Scheduling in Distributed Stream Processing Systems"}, {"paperId": "fd3b482cc03be30ed11498dc046a8fa53a210b51", "title": "HaoCL: Harnessing Large-scale Heterogeneous Processors Made Easy"}, {"paperId": "c333a5d361042bb186a558efb9d098a5d7b84406", "title": "When FPGA-Accelerator Meets Stream Data Processing in the Edge"}, {"paperId": "5d38e9dbcb632af5a36e12e569610c761f135a2d", "title": "Reinforcement Learning Based Policies for Elastic Stream Processing on Heterogeneous Resources"}, {"paperId": "e670e331cf1a80c1a2bd7f954e754c6bf6ccde9b", "title": "Aladdin: Optimized Maximum Flow Management for Shared Production Clusters"}]}
