{"paperId": "551b302eaf01a370a789252e01a45dbd16d32bc0", "publicationVenue": null, "title": "Reform of college students' teaching management informatization under the background of big data and IoT", "abstract": "With the continuous layout of intelligent processing technology in the teaching field, it has become an important trend to apply big data and Internet of Things technology to the teaching management of college students. Big data technology can comprehensively analyze the teaching situation of students through massive data, and then provide the best solution, the current big data technology already has a strong technical foundation, which can provide assistance for students’ teaching. The Internet of Things technology can collect personal information of students through sensors and miniature portable devices, and provide the data to the background server for big data analysis. In order to analyze the current status of the informationization of teaching management for college students, this paper first surveys some colleges and institutions through questionnaire surveys, and conducts data analysis on the collected questionnaires, and puts forward a solution based on big data and the Internet of Things based on the data analysis results. Finally, the combination of big data and Internet of Things technology for student teaching data collection, effect evaluation scheme, intelligent arrangement of integrated courses, intelligent recommendation scheme for students’ teaching needs, and teaching management information visualization scheme are analyzed, and it is found that the combination of big data and Internet of Things related technologies It can effectively improve the efficiency of teaching management of college students.", "venue": "J. Comput. Methods Sci. Eng.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-29", "journal": {"name": "J. Comput. Methods Sci. Eng.", "pages": "2525-2534", "volume": "23"}, "authors": [{"authorId": "2116985078", "name": "Lei Wu"}], "citations": []}
