{"paperId": "551d9075635f5cc5790168744a8aa331707ce9fb", "publicationVenue": null, "title": "Brain Tumor Classification by Convolutional Neural Network", "abstract": "Image categorization challenges are typically solved by means of the employment of convolutional neural networks (CNN). The categorization of medical photos is currently receiving the attention of an ever-increasing number of people. Backpropagation is performed in the process of selecting features in an adaptive manner. Some of the CNN building parts that are utilized in this process are convolution, pooling, and fully connected layers. Backpropagation is performed to accomplish this. The design of a CNN model that is capable of identifying brain tumors in contrast-enhanced T1-weighted MRI images was the principal goal of this research. Within the structure that I've outlined, there are two steps that are vitally important. After the initial processing of the photos applying a number of image processing techniques, the images are subsequently categorized with the assistance of a CNN. Afterwards, the photos are stored. There are a total of 3064 distinct cases of glioma, meningioma, and pituitary tumors contained in the collection of images of brain tumors that were utilized in the experiment (glioma, meningioma, pituitary) (glioma, meningioma, pituitary) (glioma, meningioma, pituitary) (glioma, meningioma, pituitary). By implementing our CNN model, we were able to attain above-average testing accuracy, as well as recall and precision that were both above-average. The proposed method performed extremely well on the dataset, exceeding a substantial number of the other methods that are already accessible.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "784-790"}, "authors": [{"authorId": "1573795618", "name": "Dhiraj Kapila"}, {"authorId": "2288740709", "name": "Dr. R. Michaelraj"}, {"authorId": "2288566751", "name": "Kingston Professor"}, {"authorId": "2288736589", "name": "Head Research"}, {"authorId": "2286653042", "name": "Dr. Arun Pratap Srivastava"}, {"authorId": "2288736110", "name": "Dr. P. Prabavathi"}, {"authorId": "2196945393", "name": "Rajesh Deorari"}], "citations": [{"paperId": "3386afa5ad51105e47d8d6bc3742b8e5ddbdb485", "title": "An Early Diagnosis of Brain Tumor Using Fused Transfer Learning"}]}
