{"paperId": "551f5c3ef585f4e70b70611c45c611d9bb0610a7", "publicationVenue": {"id": "dc95b805-f39c-43dd-bf0f-500edd72da12", "name": "F1000Research", "type": "journal", "issn": "2046-1402", "url": "https://f1000research.com/"}, "title": "Edge computing for Vehicle to Everything: a short review", "abstract": "Vehicle to Everything (V2X) communications and services have sparked considerable interest as a potential component of future Intelligent Transportation Systems. V2X serves to organise communication and interaction between vehicle to vehicle (V2V), vehicle to infrastructure (V2I), vehicle to pedestrians (V2P), and vehicle to networks (V2N). However, having multiple communication channels can generate a vast amount of data for processing and distribution. In addition, V2X services may be subject to performance requirements relating to dynamic handover and low latency communication channels. Good throughput, lower delay, and reliable packet delivery are the core requirements for V2X services.  Edge Computing (EC) may be a feasible option to address the challenge of dynamic handover and low latency to allow V2X information to be transmitted across vehicles. Currently, existing comparative studies do not cover the applicability of EC for V2X. This review explores EC approaches to determine the relevance for V2X communication and services. EC allows devices to carry out part or all of the data processing at the point where data is collected. The emphasis of this review is on several methods identified in the literature for implementing effective EC. We describe each method individually and compare them according to their applicability. The findings of this work indicate that most methods can simulate the EC positioning under predefined scenarios. These include the use of Mobile Edge Computing, Cloudlet, and Fog Computing. However, since most studies are carried out using simulation tools, there is a potential limitation in that crucial data in the search for EC positioning may be overlooked and ignored for bandwidth reduction. The EC approaches considered in this work are limited to the literature on the successful implementation of V2X communication and services. The outcome of this work could considerably help other researchers better characterise EC applicability for V2X communications and services.", "venue": "F1000Research", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-01", "journal": {"name": "F1000Research"}, "authors": [{"authorId": "32783233", "name": "M. F. A. Abdullah"}, {"authorId": "26954926", "name": "S. Yogarayan"}, {"authorId": "52008881", "name": "Siti Fatimah Abdul Razak"}, {"authorId": "144701001", "name": "A. Azman"}, {"authorId": "51956500", "name": "A. H. Muhamad Amin"}, {"authorId": "2137441714", "name": "Mazrah Salleh"}], "citations": [{"paperId": "9cb0c53489d848d27f7cad2baad6a6e50de054d0", "title": "A novel vehicular task deployment method in hybrid MEC"}]}
