{"paperId": "5524ebe7fd95282ddca0caa76c6e2863d6804c1b", "publicationVenue": {"id": "1042faa2-59ed-4755-bc0d-be06dc2e3707", "name": "Electronic library", "type": "journal", "alternate_names": ["Electron Libr", "The Electronic Library", "Electron libr"], "issn": "0264-0473", "url": "https://www.emerald.com/insight/publication/issn/0264-0473", "alternate_urls": ["http://www.emeraldinsight.com/loi/el"]}, "title": "Differences between LIS and non-LIS undergraduates' conceptions of smart libraries: a drawing analysis approach", "abstract": "\nPurpose\nThis study aims to compare similarities and differences in library and information science (LIS) and non-LIS undergraduates’ conceptions and perceptions of smart libraries via drawing analysis.\n\n\nDesign/methodology/approach\nIn this study, a total of 156 undergraduate students described their perceptions of smart libraries as drawings and textual descriptions. A modified coding scheme with 8 categories and 51 subcategories was used to analyse the undergraduate students’ drawings.\n\n\nFindings\nMost of the undergraduate students’ conceptions of smart libraries still involve self-checkout and learning/reading, focusing on information appliances, technical services, activities and objects. The differences are that the LIS undergraduates’ drawings showed smart libraries with robots, interactive book borrowing with technology tools, intelligent services, location-aware services or mobile applications, whereas non-LIS undergraduates presented smart libraries as readers (learners), other activities and no smart technology services. LIS undergraduates focused on providing patron services with technologies. Non-LIS undergraduates were more likely to draw a complex space with immediate access to books or digital resources, quiet reading and the freedom to engage in library activities.\n\n\nOriginality/value\nThe results provide a baseline for future research on the topic and provide preliminary evidence of using the methods to discern LIS and non-LIS undergraduates’ conceptions of smart libraries.\n", "venue": "Electronic library", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-25", "journal": {"name": "Electron. Libr.", "pages": "801-823", "volume": "39"}, "authors": [{"authorId": "35656591", "name": "Y. Tu"}, {"authorId": "144217709", "name": "Gwo-jen Hwang"}, {"authorId": "2135933095", "name": "Shu-Yen Chen"}, {"authorId": "2883439", "name": "Chiu-Lin Lai"}, {"authorId": "2144670015", "name": "Chuan-Miao Chen"}], "citations": [{"paperId": "b21d440148ba56e3e7df1e24f43f66b1b1078160", "title": "Tendências de Serviços para Biblioteca e as competências do profissional Bibliotecário: um olhar para o futuro"}, {"paperId": "8a2ce9fa455e05cc08c35c855398e01a8a04a84e", "title": "Impact of artificial intelligence text generators (AITGs) on libraries"}]}
