{"paperId": "5526b42a85eecc65b32a2d0a60fd1fc8ddeee0ce", "publicationVenue": null, "title": "Deep Learning-based Cluster Analysis for Healthcare Data Classification", "abstract": "The use of cutting-edge technology in the medical field results in the production of massive volumes of data on a daily basis. Various categories of information are applied in the domain of healthcare, including clinic information, medical record data, and genetic information. In addition, real-time monitoring in the medical industry produces enormous volumes of data, and properly interpreting such enormous amounts of data is a significant problem. The evaluation of medical information becomes more required so that suitable drugs may be supplied and issues can be avoided by taking appropriate measures depending on the history of the patient. Automation makes data analysis more effective, but performance might deteriorate when there are problems with data integrity, diversity, or consistency. Automation makes data analysis more effective. In order to handle the management of massive amounts of data, many models that are powered by neural networks have been developed; still researchers are currently attempting to develop a superior model that is more accurate. Hence, fuzzy c denotes the process of clustering, whereas generative adversarial networks are used in this study to clusters and classify medical data, aiming to achieve the maximum degree of efficiency in classification. The experiment will use both the benchmark lung cancer sample and the arrhythmias sample. The proposed model achieves a maximum accuracy of 97.3% for dataset 1 and 98.2% for dataset 2, outperforming other methods such as support vector machine, decision tree, and random forest algorithms.", "venue": "2023 International Conference on Data Science, Agents & Artificial Intelligence (ICDSAAI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-21", "journal": {"name": "2023 International Conference on Data Science, Agents & Artificial Intelligence (ICDSAAI)", "pages": "1-6"}, "authors": [{"authorId": "2240906289", "name": "M. Gayathri"}, {"authorId": "2213523305", "name": "V. Kavitha"}], "citations": []}
