{"paperId": "55318c5489c0ce1ab0df3f89e9235ba0f9b1cd89", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "People Search within an Online Social Network: Large Scale Analysis of Facebook Graph Search Query Logs", "abstract": "Popular online social networks (OSN) generate hundreds of terabytes of new data per day and connect millions of users. To help users cope with the immense scale and influx of new information, OSNs provide a search functionality. However, most of the search engines in OSNs today only support keyword queries and provide basic faceted search capabilities overlooking serendipitous network exploration and search for relationships between OSN entities. This results in siloed information and a limited search space. In 2013 Facebook introduced its innovative Graph Search product with the goal to take the OSN search experience to the next level and facilitate exploration of the Facebook Graph beyond the first degree. In this paper we explore people search on Facebook by analyzing an anonymized social graph, anonymized user profiles, and large scale anonymized query logs generated by users of Facebook Graph Search. We uncover numerous insights about people search across several demographics. We find that named entity and structured queries complement each other across one's duration on Facebook, that females search for people proportionately more than males, and that users submit more queries as they gain more friends. We introduce the concept of a lift predicate and highlight how a graph distance varies with the search goal. Based on these insights, we present a set of design implications to guide the research and development of the OSN search in the future.", "venue": "International Conference on Information and Knowledge Management", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2014-11-03", "journal": {"name": "Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management"}, "authors": [{"authorId": "145521170", "name": "N. Spirin"}, {"authorId": "38807427", "name": "Junfeng He"}, {"authorId": "3218256", "name": "M. Develin"}, {"authorId": "1680270", "name": "Karrie Karahalios"}, {"authorId": "2073788679", "name": "Maxime Boucher"}], "citations": [{"paperId": "1b8e20a3945ffe01cacf7de011b780a612930003", "title": "Expert Finding Considering Dynamic Profiles and Trust in Social Networks"}, {"paperId": "b480d3bcbfcea750572dda7bca65e19e9bbc3752", "title": "Toward action comprehension for searching: Mining actionable intents in query entities"}, {"paperId": "171ffe860f3d6db34d5e85e1452c24c9ee383538", "title": "Computing source-to-target shortest paths for complex networks in RDBMS"}, {"paperId": "e09baaf4e8f3e91b3b64940094bfd59dbc15e0e1", "title": "A Comparative Study of Query-biased and Non-redundant Snippets for Structured Search on Mobile Devices"}, {"paperId": "f1ebfb047250ed0119bf64b0e7c70b50e9c81fb7", "title": "Optimizing search user interfaces and interactions within professional social networks"}, {"paperId": "3b2c56dcf59b45153f139becfe9acad7148cf169", "title": "User Exploration of Slider Facets in Interactive People Search System"}, {"paperId": "78a2e3ae77543cb16444eceb0c419918b0a75e02", "title": "Optimizing Search Interactions within Professional Social Networks"}, {"paperId": "ada47e5689ce9995c3c579108b436aa1179aaaca", "title": "Report on the First SIGIR Workshop on Graph Search and Beyond (GSB'15)"}, {"paperId": "fdc61379a7aacf465ba0cec743a4b3bb02418b98", "title": "I See You: Person-of-Interest Search in Social Networks"}, {"paperId": "e4a8aa2fd4a8b6ac3b9a8f9b975bcf2524bb1c8f", "title": "Graph Search and Beyond: SIGIR 2015 Workshop Summary"}, {"paperId": "021f0bb4112f0588ce16eaa2381679b161446751", "title": "Social Information Access"}, {"paperId": "918d4317840e79e932a2bf124ac19b2785c03700", "title": "Network-Based Social Search"}, {"paperId": "255b0cdf4c19a6c27d99c11efc660106779cc916", "title": "People Recommendation on Social Media"}, {"paperId": "329e7c520c3bb1fbe142d98ced4eab7fad8cdfca", "title": "IcicleQuery: A Web Search Interface for Fluid Semantic Query Construction"}, {"paperId": "3bc1b3528e350d7bf2bbfb6308823e7137aef392", "title": "Link and Graph Mining in the Big Data Era"}, {"paperId": "20be2b121dd0c76b167791138625f482ed1a32f1", "title": "GSB ’ 15 Graph Search and Beyond Workshop"}, {"paperId": "36557d107ffebac5c7add82fac2e7de090feee9e", "title": "Overview of Graph Search and Beyond"}]}
