{"paperId": "5532caace14f2077d94835447e041ada1dd54291", "publicationVenue": {"id": "ec322614-98be-46cf-ba3d-efc87d0175ae", "name": "International Conference on Conceptual Modeling", "type": "conference", "alternate_names": ["Int Conf Concept Model", "ER"], "url": "https://web.archive.org/web/*/http://www.er.byu.edu/"}, "title": "The journey of conceptual modeling: Paths from the past to present with trajectories for the future", "abstract": "The field of conceptual modeling has been in existence for over five decades. To understand how the field has evolved and should continue to evolve, it is useful to examine the contributions made over time and the topics that have emerged. In this research, we apply bibliometric analysis to a corpus of 4652 research papers spanning from 1976 to 2022. Co-citation and citation networks are produced that show the different schools of thought, the main topics of the domain, and the relationships among major and influential research papers over time. The co-citation analysis identifies four schools of thought. It elicits the separation between the historical cluster centered around Chen’s seminal paper and another cluster proposing grammars and guidelines for representing the real world using conceptual modeling and methods for evaluating these representations. A bibliographic coupling analysis on papers from 2017 to 2022 results in ten clusters that characterize the main themes, including domain-specific conceptual modeling and applications, ontologies and applications, genomics, and datastores and multi-model data. The main path analysis of the citation network identifies several main paths among major and most influential papers. This leads to insights on the lineage of key papers in conceptual modeling research. The primordial nature of the main paths identified encompasses two important aspects. The first revolves around the refinement of the entity-relationship model. The second identifies the contribution of ontologies for conceptual modeling.", "venue": "International Conference on Conceptual Modeling", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2285406", "name": "J. Akoka"}, {"authorId": "1398238537", "name": "I. Comyn-Wattiau"}, {"authorId": "143686367", "name": "N. Prat"}, {"authorId": "1764975", "name": "V. Storey"}], "citations": []}
