{"paperId": "5536924123fd9523fce85ff0e28cd231598e8f93", "publicationVenue": {"id": "b41a8ed2-0658-4761-b625-32bf9c5fbf69", "name": "East-West Design & Test Symposium", "type": "conference", "alternate_names": ["East-west Des Test Symp", "East-West Design and Test Symposium", "EWDTS", "East-west Des  Test Symp"]}, "title": "Paradigms for Building Control Systems on Railroad Transport: from the Systems of Electrical Interlocking of Points and Light Signals to Smart Grid Train Movements Controlling Systems", "abstract": "The state of train movements controlling systems on railroads of the world with the main emphasis on railroads of former Soviet Union is analyzed in the article. Major aspects of building control systems are pointed out. It is also stated that the technologies currently used on railroad transport are behind the times and in the 21st century total application of the former seems to be an anachronism. The authors of the article suggested unique concepts of building transport systems oriented towards the use of information technologies and modern optimized power systems. The example of building an intelligent train movements controlling system with alternative energy (<<green» energy) sources agreeable to the new concept of a smart grid train movements controlling system was presented in the article.", "venue": "East-West Design & Test Symposium", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE East-West Design & Test Symposium (EWDTS)", "pages": "1-8"}, "authors": [{"authorId": "50815522", "name": "D. Efanov"}, {"authorId": "51878885", "name": "G. Osadchy"}], "citations": [{"paperId": "b1ecd88bd68345761d396a74fa4fb4c89649abc3", "title": "Digital Modeling in Railway Infrastructure and Rolling Stock Objects at all Stages Life Cycle: Features"}, {"paperId": "ee9a28fe6c873323f2e5dfa6d98c97a93581e8e9", "title": "Improving the Monitoring Systems Algorithmic Support for Railway Automation Equipment’s Based on Dynamic Questionnaires"}, {"paperId": "cd0ab848b4c636faefa6f533dc32406b680895d0", "title": "Design and Implementation of a Control, Monitoring and Supervision System for Train Movement Based on Fixed Block Signaling System with AVR Microprocessor"}, {"paperId": "d7c2cb2f1c8a3d6673c6673161ed79d75a8b74e3", "title": "New Stage in Safety Traffic Control Technologies Development: Digital Railroad Crossing"}, {"paperId": "ea3de939b40b2e7c86a580c7f5fa66f9e4c68e2e", "title": "Technological Foundations of Traffic Controller Data Support Automation"}, {"paperId": "bc525ca4df61d592a163d112f1fdb43056897fc9", "title": "Intelligent Transport Systems as a Way to Improve the Quality of the Rail-Truck Multimodal Freight Transportation"}, {"paperId": "08a695d2202fdba4e8a249d127852c907dc530f0", "title": "Permanent Monitoring Systems of the Contact-Wire of Railroad Catenary: the Main Tasks of Implementation"}, {"paperId": "22fe7f5a151dad46aaef183207d9d17b604faafb", "title": "Green Technologies for Management on Railroad Transportation"}, {"paperId": "9abda72c6afce6bc7cbf975aaa2818b0784f0bde", "title": "ТЕХНОЛОГИЧЕСКИЕ ОСНОВЫ АВТОМАТИЗАЦИИ ИНФОРМАЦИОННОГО ОБЕСПЕЧЕНИЯ РЕШЕНИЙ ПОЕЗДНЫХ ДИСПЕТЧЕРОВ"}]}
