{"paperId": "554d47b163c73d16ed24b6750405abb560adfeca", "publicationVenue": null, "title": "Performance and Load Testing: Tools and Challenges", "abstract": "Performance testing can be done on various types of the software application like mobile application, web application, web service, cloud and grid application. When we are organizing performance testing some issues could have observed related to tools such as tool installation, the flexibility of the tool in the application, tool setup and response time generated by the tool, etc. In this paper, we are going to analyze the performance of the application by using two different tools named as Apache- Jmeter and another one is SoapUI. Different tools give different responses, so according to the application; we should choose the testing tool. Apache-Jmeter is a web application based performance testing tool which is useful to examine the server performance under the heavy load. Whereas SoapUI Load Testing tool verifies the Quality of Service of a specific application under the variable load.", "venue": "2018 International Conference on Recent Innovations in Electrical, Electronics & Communication Engineering (ICRIEECE)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 International Conference on Recent Innovations in Electrical, Electronics & Communication Engineering (ICRIEECE)", "pages": "2257-2261"}, "authors": [{"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "1516133386", "name": "Meenu Rani Dey"}, {"authorId": "150257598", "name": "Pranali Bhanse"}, {"authorId": "34688005", "name": "Rabindra Kumar Barik"}], "citations": [{"paperId": "43d73cbff5cc91452f086baaa5f0a92310746c67", "title": "Generation of JMeter scripts for performance testing of Moodle server"}, {"paperId": "759785be6da465bf63527bfefdd2eb469fe2a912", "title": "Machine learning aplicado al análisis del rendimiento de desarrollos de software"}, {"paperId": "7ccdbbf7d53d7ec7d83ab2569db34fbb2136c311", "title": "Selenium-Jupiter: A JUnit 5 extension for Selenium WebDriver"}, {"paperId": "c7fa49f78f0ff64eb04191c0bb203e81ee3fd5b4", "title": "AI-Driven Test Case Optimization for Performance Engineering"}]}
