{"paperId": "554db4ce656083401883540ab1d3affda274b89b", "publicationVenue": null, "title": "Impacts of local public expenditure on CO2 emissions in Chinese cities: A spatial cluster decomposition analysis", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Resources Conservation and Recycling", "pages": "105217", "volume": "164"}, "authors": [{"authorId": "113264237", "name": "Shulei Cheng"}, {"authorId": "50580097", "name": "Yongtao Chen"}, {"authorId": "47923278", "name": "Fanxin Meng"}, {"authorId": "1491613668", "name": "Jiandong Chen"}, {"authorId": "2109614381", "name": "Gengyuan Liu"}, {"authorId": "35747874", "name": "M. Song"}], "citations": [{"paperId": "fcf49a16188b506fa63324e6feeb7d96972d035d", "title": "Research on the impact mechanism of multiple environmental regulations on carbon emissions under the perspective of carbon peaking pressure: A case study of China's coastal regions"}, {"paperId": "2018f8344b9d1c7ea10e626d5af6c9d4063de28d", "title": "Spatio-temporal patterns and impact mechanisms of CO2 emissions from China's construction industry under urbanization"}, {"paperId": "f90f373679c4bfade23e83eefcc695fb8bde5483", "title": "Heterogeneity study on mechanisms influencing carbon emission intensity at the county level in the Yangtze River Delta urban Agglomeration: A perspective on main functional areas"}, {"paperId": "011ca55378bbc3da89ceb05e968b29e90efce692", "title": "Market potential and the industrial sectors inclusion sequence in China's national carbon emission trading: From the perspective of maximizing gains"}, {"paperId": "9c5c01c36a2b41890009d8b072040127d279f08f", "title": "Is Abrams curve a myth or reality? Evidence from two Baltic countries"}, {"paperId": "305cea7c90c6735b0b76ed42cba99370f89252af", "title": "The synergy between temporal and spatial effects of human activities on CO2 emissions in Chinese cities"}, {"paperId": "8e6cdef8e22dce77347dc9fc651b293f7d724568", "title": "The characteristics and drivers of China’s city-level urban-rural activity sectors’ carbon intensity gap during urban land expansion"}, {"paperId": "a15139f74b993652037407ba3e4254ef5750a2b6", "title": "Does financial inclusion achieve the dual dividends of narrowing carbon inequality within cities and between cities? Empirical evidence from China"}, {"paperId": "a7f4679d45ec04ea25af41cf9d311515336ff1f0", "title": "Does industrial convergence mitigate CO2 emissions in China? A quasi-natural experiment on “Triple Play” Reform"}, {"paperId": "6c73dcfc93538d30d26b365d738130d45e59d07e", "title": "The mechanisms and spatial-temporal effects of farmland spatial transition on agricultural carbon emission: based on 2018 counties in China"}, {"paperId": "da16969ef1993bb08783bd9c432cbf7e89cf326a", "title": "How does energy aid mitigate the recipient countries’ carbon emissions?"}, {"paperId": "b785fb2d80d2fea5a7bebe3c3635956b4c91959b", "title": "Multi-source data assessment and multi-factor analysis of urban carbon emissions: A case study of the Pearl River Basin, China"}, {"paperId": "6a10eaa7d4067cafe1f93120bcb38a7e3503b5ac", "title": "Spatial evolution and decomposition of energy-related CO_2 emissions in China’s mining industry: from the perspective of regional heterogeneity"}, {"paperId": "5497c6d81eff0553bd33c372420cbc6f12658a6e", "title": "Toward the carbon neutrality: Forest carbon sinks and its spatial spillover effect in China"}, {"paperId": "d74fc65d6d9570b95a528919cdf899556ecfaf47", "title": "Multi-scale near-long-range flow measurement and analysis of virtual water in China based on multi-regional input-output model and machine learning"}, {"paperId": "c6aa0af63f50ed5993e20a46be933349f090ed90", "title": "Public Expenditure, Green Finance, and Environmental Governance: Evidence From China"}, {"paperId": "f81ae9e53cd8f731d65097d86eea1f20e710f10f", "title": "Has the synergistic development of urban cluster improved carbon productivity? ––Empirical evidence from China"}, {"paperId": "0a7996fab3a2af90ff21c87079b273b0a4e5131e", "title": "The spatio‐temporal interactive effects between ecological urbanization and industrial ecologization in the Yangtze River Delta region"}, {"paperId": "1abf7a0023f9d63661db61a22ee9eac5273061e6", "title": "The influence of digital economy development on urban carbon emission intensity in the Yangtze River Economic Belt: Mediating mechanism and spatial effect"}, {"paperId": "765ee4d52f30cc06dc1f6733c05000837c3cdd42", "title": "Prediction of Dry-Low Emission Gas Turbine Operating Range from Emission Concentration Using Semi-Supervised Learning"}, {"paperId": "3c9cd5f6b2f3eb0b4744b2f15ca6d14dc9d246bd", "title": "Uncovering the spatially uneven synergistic effects of China's enterprise-level industrial water pollutants reduction"}, {"paperId": "9cc18051995a6c3a630bc7e4c3b2de321b2ca1f0", "title": "Spatio-temporal efficiency of fiscal environmental expenditure in reducing CO2 emissions in China's cities."}, {"paperId": "54e3a9ae6c4886b3377e894b9930757599a23ea6", "title": "Does Public Participation Reduce Regional Carbon Emission?"}, {"paperId": "081ed5920f8d3d6ce1499b40bc2b385c00440c2b", "title": "Can carbon trading policy and local public expenditures synergize to promote carbon emission reduction in the power industry?"}, {"paperId": "2b1cfadb809bdddd51a07495450f3ce1766165f5", "title": "A carbon-neutral scenario simulation of an urban land–energy–water coupling system: A case study of Shenzhen, China"}, {"paperId": "34e0a5fb99ba88ad6d327dd45ad0044a6ba26cf0", "title": "TÜRKİYE’DE İLLERİN KAMU HARCAMALARI VE KAMU GELİRLERİ AÇISINDAN KÜMELEME ANALİZİ YÖNTEMİ İLE SINIFLANDIRILMASI"}, {"paperId": "d4b4a7fb4e666e12c4c41a6b4b26f7601f9c9bee", "title": "The health benefit of physical exercise on COVID-19 pandemic: Evidence from mainland China"}, {"paperId": "e22a14ca276c12bc9a7e61821f03759c5cbdd5ea", "title": "Decomposition and decoupling analysis of carbon footprint pressure in China's cities"}, {"paperId": "96f64ca786f1b99f251dcf9e58b3b1a57b30bd20", "title": "Research on the evolution of incentive mechanisms for urban deep decarbonization under the vision of carbon neutrality: A perspective of multi-agent embedded participation"}, {"paperId": "428675bc936f7353a230c46cd3fade1e5b92cf01", "title": "Spatial–temporal pattern evolution and influencing factors of coupled coordination between carbon emission and economic development along the Pearl River Basin in China"}, {"paperId": "7da174888e5a4065679a1c6160944f1e974e85a9", "title": "Spatio-temporal analysis of decoupling and spatial clustering decomposition of CO2 emissions in 335 Chinese cities"}, {"paperId": "487b0768bb6b38d040a6bb7270e741b34301a0a2", "title": "The effect of industrialization, militarization, and government expenditure on carbon dioxide emissions in Ghana"}, {"paperId": "5fa9ae7d34165fddaaeee94bbda238cfb46af968", "title": "The determinants of solid waste generation in the OECD: Evidence from cross-elasticity changes in a common correlated effects framework"}, {"paperId": "e70ad233de60326fc598bf7242a2cc9e64b780c5", "title": "City-level carbon emissions accounting and differentiation integrated nighttime light and city attributes"}, {"paperId": "78e7ab8ade92d80d513a1bb16810dbbce2815e4d", "title": "The role of fiscal expenditure on science and technology in carbon reduction: Evidence from provincial data in China"}, {"paperId": "7c970b7336c534b1647e74b7ef7c4e18d20429e7", "title": "City-Level Determinants of Household CO2 Emissions per Person: An Empirical Study Based on a Large Survey in China"}, {"paperId": "bde1e55ea24a42a9da9b890e64843e790d8014e3", "title": "Spatial-temporal evolution and influencing factors of net carbon sink efficiency in Chinese cities under the background of carbon neutrality"}, {"paperId": "8560da25364ebc8d123ab92103e06626fef72e2a", "title": "How will Chinese cities reduce their carbon emissions? Evidence from spatial differences"}, {"paperId": "f7bc9d312189a46542b55e69ab98d74d705ff507", "title": "The analysis of spatial–temporal effects of relevant factors on carbon intensity in China"}, {"paperId": "951b2ec83bfaf2d90076c02acaf2b14aa86a72d6", "title": "Can the Natural Resources Capitalization Contribute to the Achievement of Carbon Neutrality? A Pilot Experiment Evidence From China"}, {"paperId": "e5c1cf008e1a41f5e58acfda82f0539147400aa8", "title": "Effects of China's pilot low-carbon city policy on carbon emission reduction: A quasi-natural experiment based on satellite data"}, {"paperId": "59429d025505ba73105d3653abcd6e0f545ba9f8", "title": "Are Sports Champions Also Anti-Epidemic Heroes? Quantitative Research on the Influence of Sports Champions’ Demonstration Effect on the COVID-19 Epidemic in China"}, {"paperId": "1b5e173861d786bf42b5a7a8bf9da1778f7140da", "title": "Incentives for Green and Low-Carbon Technological Innovation of Enterprises Under Environmental Regulation: From the Perspective of Evolutionary Game"}, {"paperId": "854a7c72fd0e030359c7b83076f2a00df9622f11", "title": "Mapping urban energy–water–land nexus within a multiscale economy: A case study of four megacities in China"}, {"paperId": "6da840fe983988c924dadd46b32417ea69680e99", "title": "The Role of Public Spending in CO2 Emissions Reduction in Polish Regions: An LMDI Decomposition Approach"}, {"paperId": "444435ba5a2e86360031c4d27e86f2d37ad3dda8", "title": "The Influencing Effects of Industrial Eco-Efficiency on Carbon Emissions in the Yangtze River Delta"}, {"paperId": "95f7114b45b9d0fc617cc5c85a55249b4504cfd4", "title": "Spatiotemporal Trends and Driving Factors of Urban Livability in the Yangtze River Delta Agglomeration"}, {"paperId": "743c22ed1e9e537aa659a6de79e37d4dd92cd9df", "title": "Impacts of Emission Reduction Technological Changes on China’s City-Level PM2.5 Concentration Based on Sustainable Development"}, {"paperId": "c82fdbd2a7be296d6e5203e54c1b33b17ed09895", "title": "Determinants of net primary productivity: Low-carbon development from the perspective of carbon sequestration"}, {"paperId": "ea95dad62b869952e3a3d174ed279a2e4034ab4f", "title": "Decoupling and decomposition analysis of CO2 emissions from government spending in China"}, {"paperId": "50a4c2e6375f6c30bfa6a21f1c51b98106651009", "title": "Energy security and sustainable design of urban systems based on ecological network analysis"}, {"paperId": "50ff9160ded6dabf051af82900dc52c363bf5443", "title": "Decomposition of carbon emission and its decoupling analysis and prediction with economic development: A case study of industrial sectors in Henan Province"}, {"paperId": "d94c64799479ca49473b75fbe534d938230fdc46", "title": "The Carbon Emission Reduction Effect of Technological Innovation on the Transportation Industry and Its Spatial Heterogeneity: Evidence from China"}, {"paperId": "e245ebaf9cfed946b7692a45a906e935415bd0c6", "title": "Can Market Segmentation Lead to Green Paradox? Evidence from China"}, {"paperId": "f2d3b7310f15fd7e92aa00eb57b5ad20ec39d5aa", "title": "Provinces with transitions in industrial structure and energy mix performed best in climate change mitigation in China"}, {"paperId": "353da83069b0b8b64346a51efa68fdd69fe4e206", "title": "How well has economic strategy changed CO2 emissions? Evidence from China's largest emission province."}, {"paperId": "38953e5ad28be70a5fe5fecabadfa056cfdb1525", "title": "The nonlinear impact of fiscal decentralization on carbon emissions: from the perspective of biased technological progress"}, {"paperId": "60d2249cae7490056534a595519d941a72f91a36", "title": "Analysis of subnational CO2 mitigation policy pressure in the residential sector in China"}, {"paperId": "bd7afb465bbe7fe6a1ecd305d05c6ef2eea4c7a5", "title": "Impacts of EmissionReductionTechnological Changes onChina’s City-Level PM2.5 Concentration Based on Sustainable Development"}, {"paperId": "f352bc24126cc216df62def93c186d1620c80451", "title": "The Inﬂuencing Effects of Industrial Eco-Efﬁciency on Carbon Emissions in the Yangtze River Delta"}]}
