{"paperId": "554fc1f696960596e2740e8b3a87e56cc2a874a6", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "Security analysis of fog computing environment for ensuring the security and privacy of information", "abstract": "In fog computing, the management, measurement, configuration, control, communication, and storage tasks are carried out collaboratively by one or more near‐user or end users. Fog computing is widely utilized in major application domains like centralized fog utilized in a shopping complex (UXFog), agriculture domain (FoAgro), health‐care domain (MediFog), vehicle parking system, and energy Lattices. The execution of fog computing at the system's edge provides the elevated quality of service (QoS), promotes area mindfulness, and minimal dormancy for the continuous and online streaming application areas. Fog networking is extremely concerned about wireless system security due to the prevalence of wireless communication in fog computing. Sniffer attacks, Jamming assaults, and several other intrusions are considered examples of security issues. While considering network storage issues, factors like interaction management, dynamic workload, and low dormancy are the most challenging aspects of designing the network model. Thus, privacy and security issues are crucial while designing the network model, accomplished through intrusion detection, access control and authentication methods. Therefore, the security analysis of fog computing based on authentication, access control and intrusion detection mechanisms are analyzed in this research to design a novel technique with enhanced security and privacy features for sharing and accessing information.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-21", "journal": {"name": "Transactions on Emerging Telecommunications Technologies", "volume": "34"}, "authors": [{"authorId": "9276819", "name": "K. K. Gola"}, {"authorId": "50010566", "name": "Shikha Arya"}, {"authorId": "35243485", "name": "Gulista Khan"}, {"authorId": "2080884180", "name": "Chetna Devkar"}, {"authorId": "2135779684", "name": "Nishant Chaurasia"}], "citations": [{"paperId": "5ade280c4d9cb28b07845fb43ee32079fcc30d84", "title": "Privacy and security issues in fog-to-fog communication: A survey"}]}
