{"paperId": "555474c1b232822cd1d046903d70c1e4124de8c9", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Applications of Big Data Analytics to Control COVID-19 Pandemic", "abstract": "The COVID-19 epidemic has caused a large number of human losses and havoc in the economic, social, societal, and health systems around the world. Controlling such epidemic requires understanding its characteristics and behavior, which can be identified by collecting and analyzing the related big data. Big data analytics tools play a vital role in building knowledge required in making decisions and precautionary measures. However, due to the vast amount of data available on COVID-19 from various sources, there is a need to review the roles of big data analysis in controlling the spread of COVID-19, presenting the main challenges and directions of COVID-19 data analysis, as well as providing a framework on the related existing applications and studies to facilitate future research on COVID-19 analysis. Therefore, in this paper, we conduct a literature review to highlight the contributions of several studies in the domain of COVID-19-based big data analysis. The study presents as a taxonomy several applications used to manage and control the pandemic. Moreover, this study discusses several challenges encountered when analyzing COVID-19 data. The findings of this paper suggest valuable future directions to be considered for further research and applications.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-03-24", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "122831629", "name": "Shikah J. Alsunaidi"}, {"authorId": "3432984", "name": "A. Almuhaideb"}, {"authorId": "2063207420", "name": "Nehad M. Ibrahim"}, {"authorId": "1712245911", "name": "F. Shaikh"}, {"authorId": "1994535790", "name": "Kawther S. Alqudaihi"}, {"authorId": "66065703", "name": "F. Alhaidari"}, {"authorId": "46504008", "name": "Irfan Ullah Khan"}, {"authorId": "3108404", "name": "N. Aslam"}, {"authorId": "2239912215", "name": "Mohammed S. Alshahrani"}], "citations": [{"paperId": "b1369153a8c3e2ee070f3b7805c1d12318f58dd5", "title": "A descriptive analytics of the COVID-19 pandemic in a middle-income country with forward-looking insights"}, {"paperId": "0a3e0af94b4ac7f5927c660e2c830097c68c7f3e", "title": "Climate Risks Resilience Development: A Bibliometric Analysis of Climate-Related Early Warning Systems in Southern Africa"}, {"paperId": "40a7209192e46e8f8749d11e45c500527bf60e7f", "title": "On the usage of Benford’s Law on coronavirus data statistics"}, {"paperId": "94a90ebca9cf72098bfa3669224e72ac05fd5f4f", "title": "CParts Platform Analisis Harga Komponen Komputer pada Marketplace"}, {"paperId": "f9b53e8253e008cf935eb082ce208c18a436e1cd", "title": "Students Engaging in Public Health Research: An Opportunity to Enhance Education"}, {"paperId": "95df600f7a4b45547ae30592f72604ac3f9df182", "title": "Predicting COVID-19 Hospital Stays with Kolmogorov-Gabor Polynomials: Charting the Future of Care"}, {"paperId": "6529ad5f1094a8d9b0ab38db163c7fdaad2a1d9c", "title": "Monkeypox Disease Detection with Pretrained Deep Learning Models"}, {"paperId": "fed82b1ddd183294de5f2d2c44a6534b5158d907", "title": "Scientometric analysis of ICT-assisted intelligent control systems response to COVID-19 pandemic"}, {"paperId": "98af1856d5c1b9b57d8450a5fb568dbd6d91e04f", "title": "Big Data: Balancing its Usefulness in Managing an Organization Performance and Ethical Consideration"}, {"paperId": "c36c370e4e0e78cda50c834736e5b8b355ad00ce", "title": "COVID-19 multiwaves as multiphase percolation: a general N-sigmoidal equation to model the spread"}, {"paperId": "53c8c31d5ae32d4d74fdad0d1573f1b72d3b6ba9", "title": "Privacy Issues in Big Data in Medicine"}, {"paperId": "a0c987bf539705cb43f04583e3f568e314a7d376", "title": "Human behavior in the time of COVID-19: Learning from big data"}, {"paperId": "a0a934af34cc63d713217b91ebe6be86b59b63c4", "title": "Constructing big data prevention and control model for public health emergencies in China: A grounded theory study"}, {"paperId": "a601b3852a3703929b14f6b65841fa129af72d1e", "title": "A critical assessment of SARS-CoV-2 in aqueous environment: Existence, detection, survival, wastewater-based surveillance, inactivation methods, and effective management of COVID-19"}, {"paperId": "f972fe4242d35a8a6d33a95260b91e17bb35c286", "title": "Exploring the Potential of Big Data Analytics in Urban Epidemiology Control: A Comprehensive Study Using CiteSpace"}, {"paperId": "2ddaaa5871e5fb6030c1823f1b1230864c51da64", "title": "What data counts in policymaking and programming evaluation - Relevant data sources for triangulation according to main epistemologies and philosophies within social science."}, {"paperId": "229bbca81e2f20ecfdbe6ec46461df4a3a10ca6e", "title": "On the Adoption of Modern Technologies to Fight the COVID-19 Pandemic: A Technical Synthesis of Latest Developments"}, {"paperId": "68fe169a9a44283510806006c8cf6e6c984c116a", "title": "Big Data, Sentiment Analysis, and Examples during the COVID-19 Pandemic"}, {"paperId": "af133cec689566543c78ebc15a0dd82f734d03c5", "title": "Explore Big Data Analytics Applications and Opportunities: A Review"}, {"paperId": "9741764a42588e0d46d27a89fccb584086fe06d0", "title": "Performance Evaluation of Machine Learning Models on Apache Spark: An Empirical Study"}, {"paperId": "18c69f36010181903887efe3806e17727dd8394c", "title": "Knowledge Transfer and Crowdsourcing in Cyber-Physical-Social Systems"}, {"paperId": "8f5f38f4bdad528ce358851ff73364da1b604300", "title": "AI-based big data analytics model for medical applications"}, {"paperId": "575b5aabdc0a224cd0e3dc139f68ed78aea9c6bf", "title": "Evaluation of Early Diagnosis of COVID-19 Algorithms"}, {"paperId": "90faa6f97796e77c29bc489df8324c42c559623b", "title": "A Novel COVID-19 Detection Technique Using Deep Learning Based Approaches"}, {"paperId": "9391b770e3a48adfbea3db34ef14e65ee9beee0f", "title": "A Research on the Sharing Platform of Wild Bird Data in Yunnan Province Based on Blockchain and Interstellar File System"}, {"paperId": "26691cb6eca4db6293be3ff83494eca8a9b51a9c", "title": "TBR-NER: Research on COVID-19 Text Information Extraction Based on Joint Learning of Topic Recognition and Named Entity Recognition"}, {"paperId": "e4f1538b7b7ebdaddfe27de66d862e711a1ca8d1", "title": "Special Issue on Big Data for eHealth Applications"}, {"paperId": "fd6c08b9292e3275a3fe8ea0f47900492358ddb4", "title": "Biophilic Design as an Important Bridge for Sustainable Interaction between Humans and the Environment: Based on Practice in Chinese Healthcare Space"}, {"paperId": "7e4b366fa674f86e130b3f1adcd61e0e6ad06ff7", "title": "IoT-Based Technological Framework for Inhibiting the Spread of COVID-19: A Pandemic Using Machine Learning and Fuzzy-Based Processes"}, {"paperId": "00664bcb5ec4f20a5bd7cb00711d48d29531dfe0", "title": "Management of Smart and Sustainable Cities in the Post-COVID-19 Era: Lessons and Implications"}, {"paperId": "a90d0865347acc78acd913cdf7454ae5a2861d43", "title": "Exploitation of Emerging Technologies and Advanced Networks for a Smart Healthcare System"}, {"paperId": "c2350e037bc458b9ce931c37b135647dc6f49e51", "title": "COVID-19 Pandemic Management: A Review of the Digitalisation Leap in Malaysia"}, {"paperId": "a52830549688c9a9703bd28414b50e4632842099", "title": "Determining the efficiency of data analysis systems in predicting COVID-19 infected cases"}, {"paperId": "0898059d0b13b9cff4dffa17c96575c685397bc6", "title": "An Effective Skin Cancer Classification Mechanism via Medical Vision Transformer"}, {"paperId": "9ed56b9e2e659aec1e3c56819400ec140a911ee7", "title": "Critical Analysis of COVID-19 Containment Policy in the United Kingdom"}, {"paperId": "f70f4723e1c2ebeb66768e51baf96874e509d83a", "title": "Health Professionals’ Experience Using an Azure Voice-Bot to Examine Cognitive Impairment (WAY2AGE)"}, {"paperId": "29694d3374cdbb7c4b3d2b1488defee24af116e3", "title": "Predictive Classifier for Cardiovascular Disease Based on Stacking Model Fusion"}, {"paperId": "eec265bb7ebdff2665a9e09920ff8988197c54f7", "title": "Machine learning model for predicting the length of stay in the intensive care unit for Covid-19 patients in the eastern province of Saudi Arabia"}, {"paperId": "6e605d89fbbd4bc598d86c611fbae2ef75881cbd", "title": "An Efficient and Effective Deep Learning-Based Model for Real-Time Face Mask Detection"}, {"paperId": "3628de6e9458303c5a9f6c0624b2b8fc678ae270", "title": "A framework for information technology-based management against COVID-19 in Iran"}, {"paperId": "c0e699a49ad400e802b6e7c26ad83a33abd2c72f", "title": "Big Data in the Era of Pandemic COVID-19 : Application of IoT based data analytics, Machine Learning and Artificial Intelligence"}, {"paperId": "693b0131a66381063c20fe852c179a36759f9835", "title": "Big Data Analysis of Covid-19 Spread Based on Distribution Map and Protocol Regulations with Business Intelligence"}, {"paperId": "414c189d9c1d942d08937ea1f0cbd41f31452f8a", "title": "An IoT-Based COVID-19 Prevention and Control System for Enclosed Spaces"}, {"paperId": "6b058de401e205c37003471b4f19f5247530a021", "title": "Performance Comparison of Apache Hadoop and Apache Spark for COVID-19 data sets"}, {"paperId": "46bfbbb64f5277724318353208f311a579a88330", "title": "Data-Driven Analytics Leveraging Artificial Intelligence in the Era of COVID-19: An Insightful Review of Recent Developments"}, {"paperId": "fb83d83e70455a4f2c401be2682a83df9586c20d", "title": "Big Data COVID-19 Systematic Literature Review: Pandemic Crisis"}, {"paperId": "e5b62a53ba456ec206a32fbcefc80ce5af5d3971", "title": "Digital Image Encryption Using Double Crossover Approach for SARS-CoV-2 Infected Lungs in a Blockchain Framework"}, {"paperId": "5a23e3eb08df6fb009dfc3f7e0cc56b9160db9f7", "title": "Smart City Medical Resource Allocation System Based on Big Data"}, {"paperId": "dd7f94545e5f67697364b79c6b2fe5841f53a3e8", "title": "A review of emerging innovations in COVID-19"}, {"paperId": "813106acd36ddb8ba26c0acb114f26ae906e2cf2", "title": "Big-Data Management: A Driver for Digital Transformation?"}, {"paperId": "3c15f33593e31a302df94b7d3428e6a9103c1c43", "title": "Emerging Techniques for Handling Pandemic Challenges"}, {"paperId": "9dbccc5b00c8ce2e06fc6b1cdf55370a0713dd86", "title": "COVID-19 Pandemic Waves: 4IR Technology Utilisation in Multi-Sector Economy"}, {"paperId": "7bae2ecfbe522b4d625aeeb559c9c260de25de31", "title": "Short-term impact of the Covid-19 pandemic on the global and Turkish economy"}, {"paperId": "449915415f8281b850bc0035cc401dac2a50e23b", "title": "Risk Assessment and Prediction of COVID-19 Based on Epidemiological Data From Spatiotemporal Geography"}, {"paperId": "e93e7048a9f7d384a51b34a9b5f6b7ad40c05aa6", "title": "Cough Sound Detection and Diagnosis Using Artificial Intelligence Techniques: Challenges and Opportunities"}, {"paperId": "199f56d9bb3f961dc9437293a2d0bef7d29fe053", "title": "Big Data Analysis and Management in Healthcare"}, {"paperId": "16dc87153cd18f69d4fe23266d6b50c9b4df74a2", "title": "Toward Sustainable Healthcare Facilities: An Initiative for Development of “Mostadam-HCF” Rating System in Saudi Arabia"}, {"paperId": "e14af848b53126b62bb44d441a5a57fa3863369a", "title": "The changing of government’s interaction due Covid-19 pandemic: A comparative study about technology use in Malaysia and Indonesia"}, {"paperId": "02c3dff491cd891d07be5d7241eaabbbff16855e", "title": "Innovation in Sustainability of Tourism After the COVID-19 Pandemic"}, {"paperId": "b9cbd9e2803d7e2c30949a630a427baa4769c152", "title": "Big Data Analytics Quality in Enhancing Healthcare Organizational Performance: A Conceptual Model Development"}, {"paperId": "00ad89a55358f84edc07674468b527064907f0a1", "title": "COVID-19 Analysis, Prediction, and Misconceptions: A Computational Machine Learning Model as a New Paradigm in Scientific Research"}, {"paperId": "ebcd5ef909eb9d7c942c08b2389785221a200752", "title": "Detection of Omicron Virus Based on Convolutional Neural Network"}, {"paperId": "1d1b202530ffb4275c7c9ca97f8c49627cbdfc07", "title": "Big Data and Data Analytics in Managing the COVID-19 Pandemic"}, {"paperId": "109b11d761ae2ba2ccfd466e864b02de2942b50c", "title": "A Review on “Role of Big Data Analytics in Health Care Sector and Pharmaceutical Industry”"}, {"paperId": "01f367509c58cd99f7d252875f508bff7d1af57d", "title": "The Meta COVID-19 Pandemic Period: A Data Science Driven Wise Future Planet?"}, {"paperId": "c77da8afd9cba29e520d6ea66293ffed98c99505", "title": "An Intelligent IoT Approach for Analyzing and Managing Crowds"}]}
