{"paperId": "5558a5f8a57be65427f9381859430c6517237c3b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Understanding and addressing the resistance towards autonomous vehicles (AVs)", "abstract": "Autonomous vehicles (AVs) are expected to bring major benefits to transport and society. To exploit this potential, their acceptance by society is a necessary condition. However, AV acceptance is currently at stake: AVs face resistance by bystanders and local communities. Resistance can prevent the implementation and use of AVs, threatening road safety and efficiency. The present study performed a qualitative and quantitative text analysis of comments submitted by locals in San Francisco (SF) to the California Public Utilities Commission (CPUC) on the fared deployment of AVs. The results of the analysis are synthesized, and a conceptual framework explaining and predicting resistance is proposed. The framework posits that the occurrence of resistance is a direct result of the perception of threats, which is determined by individual and system characteristics, direct and indirect consequences of system use, reactions of others, and external events. AVs as threat to safety was associated with their unpredictable, and illegal driving behavior, as well as producing conflict situations. The lack of explicit communication between AVs and other road users due to the absence of a human driver behind the steering wheel negatively contributed to perceived safety and trust, especially for vulnerable populations in crossing situations. Respondents reported a negative impact on road capacity, congestion, and traffic flow, with AVs blocking other road users, such as emergency vehicles. Inaccessible vehicle design contributed to the exclusion of vulnerable groups with disabilities. The scientific dialogue on acceptance of AVs needs to shift towards resistance as the 'other' essential element of acceptance to ensure that we live up to our promise of transitioning towards more sustainable mobility that is inclusive, equitable, fair, just, affordable, and available to all.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-19", "journal": {"name": "ArXiv", "volume": "abs/2309.10484"}, "authors": [{"authorId": "98019229", "name": "S. Nordhoff"}], "citations": []}
