{"paperId": "557a5147d88ad361b807d4c93decac6d57d2d5e9", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Law Informs Code: A Legal Informatics Approach to Aligning Artificial Intelligence with Humans", "abstract": "We are currently unable to specify human goals and societal values in a way that reliably directs AI behavior. Law-making and legal interpretation form a computational engine that converts opaque human values into legible directives.\"Law Informs Code\"is the research agenda embedding legal knowledge and reasoning in AI. Similar to how parties to a legal contract cannot foresee every potential contingency of their future relationship, and legislators cannot predict all the circumstances under which their proposed bills will be applied, we cannot ex ante specify rules that provably direct good AI behavior. Legal theory and practice have developed arrays of tools to address these specification problems. For instance, legal standards allow humans to develop shared understandings and adapt them to novel situations. In contrast to more prosaic uses of the law (e.g., as a deterrent of bad behavior through the threat of sanction), leveraged as an expression of how humans communicate their goals, and what society values, Law Informs Code. We describe how data generated by legal processes (methods of law-making, statutory interpretation, contract drafting, applications of legal standards, legal reasoning, etc.) can facilitate the robust specification of inherently vague human goals. This increases human-AI alignment and the local usefulness of AI. Toward society-AI alignment, we present a framework for understanding law as the applied philosophy of multi-agent alignment. Although law is partly a reflection of historically contingent political power - and thus not a perfect aggregation of citizen preferences - if properly parsed, its distillation offers the most legitimate computational comprehension of societal values available. If law eventually informs powerful AI, engaging in the deliberative political process to improve law takes on even more meaning.", "venue": "Social Science Research Network", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-14", "journal": {"name": "ArXiv", "volume": "abs/2209.13020"}, "authors": [{"authorId": "1996084", "name": "John J. Nay"}], "citations": [{"paperId": "9be88d2f3d18fa06d0c90fb47d8e15da32210326", "title": "Learning and Sustaining Shared Normative Systems via Bayesian Rule Induction in Markov Games"}, {"paperId": "b6b6dd7fe517d8e27244a35fca8c55711b7b195d", "title": "Administration 4.0: Administrative informatics as a customized and necessary educational platform for a modern IT-supported federal administration"}, {"paperId": "24185cef6cdbf428fd8cdda56a7ee578142f446f", "title": "Justifiable Artificial Intelligence: Engineering Large Language Models for Legal Applications"}, {"paperId": "6d3da24a9bcef989900d646aaea23b446ffd39e1", "title": "Understanding Users' Dissatisfaction with ChatGPT Responses: Types, Resolving Tactics, and the Effect of Knowledge Level"}, {"paperId": "b3059b44183d58e7c073e6ca8e355658de952807", "title": "The Impact of Large Language Modeling on Natural Language Processing in Legal Texts: A Comprehensive Survey"}, {"paperId": "10158879cdb64ce7d3f7bb5572c4617ea808602e", "title": "Receive, Reason, and React: Drive as You Say with Large Language Models in Autonomous Vehicles"}, {"paperId": "19933dd9e03058e686ef412262eef7696cce3e8f", "title": "LanguageMPC: Large Language Models as Decision Makers for Autonomous Driving"}, {"paperId": "d7d712e507c1c6273b05c773c825a668c5cf1504", "title": "MindAgent: Emergent Gaming Interaction"}, {"paperId": "73ec470ca2d47f17db957971cedbd13d3588c9e1", "title": "Legal Summarisation through LLMs: The PRODIGIT Project"}, {"paperId": "ff44070c4e2d3ba4a4b9a44fe3f0534d21add658", "title": "A Case for AI Safety via Law"}, {"paperId": "11bca2cafe89e14dc733504f97e2489de697ceab", "title": "Drive Like a Human: Rethinking Autonomous Driving with Large Language Models"}, {"paperId": "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d", "title": "A Survey of Large Language Models"}, {"paperId": "9fe9af7cf3d54b707a7be3c53ce94b77dcc3bae5", "title": "A Short Survey of Viewing Large Language Models in Legal Aspect"}, {"paperId": "4ce5e4e59ebff88bece9995958314c89015b120c", "title": "Large Language Models as Corporate Lobbyists"}, {"paperId": "24de1048791bac4972ecc16d1c3c1de23691407d", "title": "Large Language Models: A Comprehensive Survey of its Applications, Challenges, Limitations, and Future Prospects"}, {"paperId": "46035d8bb6b7a6d026b06a2888a2739c12e673b5", "title": "L ARGE L ANGUAGE M ODELS AS D ECISION M AKERS FOR A UTONOMOUS D RIVING"}]}
