{"paperId": "557ee73ff4e87ca0cb1b6c78af0730a2d94b710f", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Panorama: A Data System for Unbounded Vocabulary Querying over Video", "abstract": "Deep convolutional neural networks (CNNs) achieve state-of-the-art accuracy for many computer vision tasks. But using them for video monitoring applications incurs high computational cost and inference latency. Thus, recent works have studied how to improve system efficiency. But they largely focus on small \"closed world\" prediction vocabularies even though many applications in surveillance security, traffic analytics, etc. have an ever-growing set of target entities. We call this the \"unbounded vocabulary\" issue, and it is a key bottleneck for emerging video monitoring applications. We present the first data system for tacking this issue for video querying, Panorama. Our design philosophy is to build a unified and domain-agnostic system that lets application users generalize to unbounded vocabularies in an out-of-the-box manner without tedious manual re-training. To this end, we synthesize and innovate upon an array of techniques from the ML, vision, databases, and multimedia systems literature to devise a new system architecture. We also present techniques to ensure Panorama has high inference efficiency. Experiments with multiple real-world datasets show that Panorama can achieve between 2x to 20x higher efficiency than baseline approaches on in-vocabulary queries, while still yielding comparable accuracy and also generalizing well to unbounded vocabularies.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-09", "journal": {"name": "Proc. VLDB Endow.", "pages": "477-491", "volume": "13"}, "authors": [{"authorId": "2108545581", "name": "Yuhao Zhang"}, {"authorId": "2119303314", "name": "Arun Kumar"}], "citations": [{"paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a", "title": "Hydro: Adaptive Query Processing of ML Queries"}, {"paperId": "81b2834f3f884785e94a8c4c1b0bf66f858e0d97", "title": "The Image Calculator: 10x Faster Image-AI Inference by Replacing JPEG with Self-designing Storage Format"}, {"paperId": "08b362cb20662dd83e8527c6d8dab5f2e54ebe23", "title": "Accelerating Aggregation Queries on Unstructured Streams of Data"}, {"paperId": "646ec1add823eb18f74754462fa0a57573db2636", "title": "SEIDEN: Revisiting Query Processing in Video Database Systems"}, {"paperId": "abe7cb5a5b9941178ab127c0ac570f871f73d1d0", "title": "VOCALExplore: Pay-as-You-Go Video Data Exploration and Model Building"}, {"paperId": "b0e2dd233b2fa601fd769dd5a08ce07f0ae13e7c", "title": "Maze: A Cost-Efficient Video Deduplication System at Web-scale"}, {"paperId": "b681eb20aee1f5280cd3f0fb7edadb08c364fe04", "title": "Multi-View Scheduling of Onboard Live Video Analytics to Minimize Frame Processing Latency"}, {"paperId": "e3c7f1a9dd8c6cfd943d9f216d9282ccb80425f4", "title": "FiGO: Fine-Grained Query Optimization in Video Analytics"}, {"paperId": "a8ce8b6689c6e7ea61991c93da7c757e79eb31a9", "title": "CORE-SG: Efficient Computation of Multiple MSTs for Density-Based Methods"}, {"paperId": "25a32e5d0ba89ca6ab1ecf6a5e9cfc42f7323f06", "title": "Accelerating Video Analytics"}, {"paperId": "432f2bcc8576d3c55277d409f676bd147d7e7383", "title": "ANN Softmax: Acceleration of Extreme Classification Training"}, {"paperId": "0485e6075c93c2ef615066634aa6f4cd5ec17772", "title": "Accelerating Approximate Aggregation Queries with Expensive Predicates"}, {"paperId": "5694f1bf18378370864634845a5e693ab7c4dd82", "title": "Mixer: Efficiently Understanding and Retrieving Visual Content at Web-Scale"}, {"paperId": "1df9d4fdd2d2d5ef1fe5b8d62ae6c17040662c08", "title": "Top-K Deep Video Analytics: A Probabilistic Approach"}, {"paperId": "d8301d5fe61fb0479132c964f81c97a3be80067f", "title": "A Survey of Performance Optimization in Neural Network-Based Video Analytics Systems"}, {"paperId": "4423f8c87959116db52238f1fa7f15bbd48f94d6", "title": "VSS: A Storage System for Video Analytics"}, {"paperId": "9fd8e5cb7958c1b005096e95ba15d0d92cdfbbaa", "title": "THIA: Accelerating Video Analytics using Early Inference and Fine-Grained Query Planning"}, {"paperId": "289a3351da7b5e8ea4360f504d8f0ff5ed94d8d0", "title": "Incremental and Approximate Computations for Accelerating Deep CNN Inference"}, {"paperId": "86fb27c0ac4325c859e591b8e7946cfa36f4f165", "title": "TASTI: Semantic Indexes for Machine Learning-based Queries over Unstructured Data"}, {"paperId": "8a55a4143d46fc27af79253c892b4274e3a4da12", "title": "Task-agnostic Indexes for Deep Learning-based Queries over Unstructured Data"}, {"paperId": "58902013729fa3b8734cd7d27a36fe5ccd12fe48", "title": "TASM: A Tile-Based Storage Manager for Video Analytics"}, {"paperId": "a576cd7aacd5273fb0d5c30688b0cacb0b5ad96d", "title": "Reducing Response Time for Multimedia Event Processing using Domain Adaptation"}, {"paperId": "8af6285b012142659f9741c3dac27064ad8439eb", "title": "Optimizing Queries over Video via Lightweight Keypoint-based Object Detection"}, {"paperId": "bb0ccf03c31fcf3634a1c1e8f13e3c0229541435", "title": "Object Detection for Unseen Domains while Reducing Response Time using Knowledge Transfer in Multimedia Event Processing"}, {"paperId": "1989ba77e83ecfe14968f1b5bd035487c8e0ee10", "title": "Finding Interesting Frames in Deep Video Analytics: a Top-K Approach"}, {"paperId": "b7cbefd6c8acad3caa5b8b1836c23147ddf427cc", "title": "VOCAL: Video Organization and Interactive Compositional AnaLytics"}, {"paperId": "4c55a58372f12aed456f90991fa93df9c53e413e", "title": "Cerebro: A Layered Data Platform for Scalable Deep Learning"}, {"paperId": "aafaf5be74e7402238ab0673e098c947ccc2734d", "title": "Surveillance Video Querying With A Human-in-the-Loop"}, {"paperId": "cfe67cae58393210279b095ddbedf1b5099e9a56", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
