{"paperId": "55825385a1b60d56c5062d52ea0f71dfdad436a0", "publicationVenue": {"id": "e84bb5a1-8f79-42cc-8eb1-3a52f7c73d63", "name": "IEEE International Conference on Systems, Man and Cybernetics", "type": "conference", "alternate_names": ["Smoky Mountains Computational Sciences and Engineering Conference", "Smoky Mt Comput Sci Eng Conf", "IEEE Int Conf Syst Man Cybern", "SMC", "Syst Man Cybern", "Systems, Man and Cybernetics"]}, "title": "Fleet Management Approach for Manufacturers displayed at the Use Case of Battery Electric Vehicles", "abstract": "Currently, fleet management approaches only focus on the perspective of the fleet operating company and the operators, but not on the perspective of the manufacturer of the fleet members. The manufacturer aims at optimizing existing fleets and supporting the development process of future fleet generations. Furthermore, data-driven models have increasing importance in fleet applications. Thus, this paper proposes a concept for a holistic fleet management approach for manufacturers supporting the development process of future fleet generations and services. We build our concept on three layers, one for the manufacturer, the fleet operator, and the machines respectively. We also discuss interactions and information flow in between the layers. Thus, enabling manufacturers to integrate operational data of customers into the development process making the products and services more customer-oriented. Before launching data-driven fleet services extensive training data is required. However, when launching new fleets disadvantageously only little data is available. As solution, we discuss the transfer of machine learning models in between different fleets (inter-fleet transfer learning). This enables quickly launching reliable machine models for new fleets with a lack of data.", "venue": "IEEE International Conference on Systems, Man and Cybernetics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-17", "journal": {"name": "2021 IEEE International Conference on Systems, Man, and Cybernetics (SMC)", "pages": "3218-3225"}, "authors": [{"authorId": "2139428590", "name": "Friedrich von Bülow"}, {"authorId": "153476800", "name": "F. Heinrich"}, {"authorId": "2661383", "name": "Tobias Meisen"}], "citations": [{"paperId": "8d10a870bf410af7bca72380a9d73f14c679496d", "title": "Transparent and Interpretable State of Health Forecasting of Lithium-Ion Batteries with Deep Learning and Saliency Maps"}, {"paperId": "1d0cf83c593c43505ef37529fe35892a0c204ad7", "title": "State of Health Forecasting of Heterogeneous Lithium-ion Battery Types and Operation Enabled by Transfer Learning"}, {"paperId": "4b7fc3eee56b33180d3d4c9de7a83ce15f45d28b", "title": "Towards Deep Industrial Transfer Learning: Clustering for Transfer Case Selection"}, {"paperId": "78da11d8e5b8417cce1a1e3f01968fbfc292d4bd", "title": "State of health forecasting of Lithium-ion batteries applicable in real-world operational conditions"}, {"paperId": "262f162a4cf9ae0b7d78bc011d6589518a250f9b", "title": "A new perspective for manufacturers: Cloud-based utilization of operational fleet data"}]}
