{"paperId": "55871d50f657d4b8fed47a9316331e70adb21291", "publicationVenue": {"id": "799a0280-441b-4633-bba4-975ba837fb4f", "name": "Atmospheric Chemistry and Physics", "type": "journal", "alternate_names": ["Atmospheric Chem Phys"], "issn": "1680-7316", "url": "https://www.atmospheric-chemistry-and-physics.net/", "alternate_urls": ["https://www.cosis.net/members/journals/df/volumes.php?j_id=2", "https://www.atmospheric-chemistry-and-physics.net/home.html", "http://www.atmospheric-chemistry-and-physics.net/"]}, "title": "Measurement report: Spatiotemporal and policy-related variations of PM2.5 composition and sources during 2015–2019 at multiple sites in a Chinese megacity", "abstract": "Abstract. A thorough understanding of the relationship between urbanization\nand PM2.5 (fine particulate matter with aerodynamic diameter less than\n2.5 µm) variation is crucial for researchers and policymakers to\nstudy health effects and improve air quality. In this study, we selected a\nrapidly developing Chinese megacity, Chengdu, as the study area to\ninvestigate the spatiotemporal and policy-related variations of PM2.5\ncomposition and sources based on long-term observation at multiple sites. A\ntotal of 836 samples were collected from 19 sites in winter 2015–2019.\nAccording to the specific characteristics, 19 sampling sites were assigned\nto three layers. Layer 1 was the most urbanized area and referred to the core\nzone of Chengdu, layer 2 was located in the outer circle of layer 1, and\nlayer 3 belonged to the outermost zone with the lowest urbanization level.\nThe average PM2.5 concentrations for 5 years were in the order of\nlayer 2 (133 µg m−3) > layer 1 (126 µg m−3) > layer 3 (121 µg m−3). Spatial clustering of the chemical composition at the sampling sites was conducted for each\nyear. The PM2.5 composition of layer 3 in 2019 was found to be similar to that of the other layers 2 or 3 years ago, implying that\nurbanization levels had a strong effect on air quality. During the sampling\nperiod, a decreasing trend was observed for the annual average concentration of PM2.5, especially at sampling sites in layer 1, where the stricter control policies were implemented. The\nSO42-/NO3- mass ratio at most sites exceeded 1 in 2015\nbut dropped to less than 1 since 2016, reflecting decreasing coal combustion and increasing traffic impacts in Chengdu, and these values can be further supported by temporal variations of the SO42- and NO3-\nconcentrations. The positive matrix factorization (PMF) model was applied to quantify PM2.5 sources. A total of five sources were identified, with average contributions of 15.5 % (traffic emissions), 19.7 % (coal and biomass combustion), 8.8 % (industrial emissions), 39.7 % (secondary particles), and 16.2 % (resuspended dust). From 2015 to 2019, a dramatic decline was observed in the average percentage contributions of coal and biomass combustion, but the traffic emission source showed an increasing trend. For spatial variations, the high coefficient of variation (CV) values of coal and biomass combustion and industrial emissions indicated their higher spatial difference in Chengdu. High contributions of resuspended dust occurred at sites with intensive construction activities, such as subway and airport construction. Combining the PMF results, we developed the source-weighted potential source contribution function (SWPSCF) method for source localization. This new method highlighted the influences of spatial distribution for source contributions, and the effectiveness of the SWPSCF method was evaluated.\n", "venue": "Atmospheric Chemistry and Physics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-04", "journal": {"name": "Atmospheric Chemistry and Physics"}, "authors": [{"authorId": "11060821", "name": "Xinyao Feng"}, {"authorId": "66384413", "name": "Yingze Tian"}, {"authorId": "3086487", "name": "Qianqian Xue"}, {"authorId": "15377020", "name": "Dan-lin Song"}, {"authorId": "72627716", "name": "Feng-xia Huang"}, {"authorId": "48260228", "name": "Yinchang Feng"}], "citations": [{"paperId": "304607062212cc14d30765c6d27cca9d4f659075", "title": "Quantifying vehicle restriction related PM2.5 reduction using field observations in an isolated urban basin"}, {"paperId": "2657a889eb0d6838c7142648fa67b85dbdb486a9", "title": "Magnetic characteristics of atmospheric particulate matter and its indication of atmospheric pollution during winter in Lanzhou, NW China"}, {"paperId": "93d1ea40080945593098922164a6988c59339248", "title": "Fireworks celebrations and air pollution: evidence from Chinese Lunar New Year"}, {"paperId": "dfd376f53ab407e524c7b78629b1b567e6ff14f0", "title": "Comparative source apportionment of PM2.5 for 2014/2019 at a plateau city: Implications for air quality improvement in high-altitude areas"}, {"paperId": "5b4932ade6f3a223e8ca2b27f8a79a3efdff5205", "title": "Quantifying the seasonal variations in and regional transport of PM2.5 in the Yangtze River Delta region, China: characteristics, sources, and health risks"}, {"paperId": "a0b03e692fe47a72760d683097d2ea75389f2cf2", "title": "Impact of Clean Air Policy on Criteria Air Pollutants and Health Risks Across China During 2013–2021"}, {"paperId": "e48f7ae5e705a61c6ceadbef0e0e7950841f6ce9", "title": "Separating Daily 1 km PM2.5 Inorganic Chemical Composition in China since 2000 via Deep Learning Integrating Ground, Satellite, and Model Data"}, {"paperId": "42c0cecfa5aa1e702259261d02218af190a8e652", "title": "Variations of inhalation risks during different heavy pollution episodes based on 3-year measurement of toxic components in size-segregated particles."}, {"paperId": "11093377c71e47db335bc47e00fa2cc7bda8e9ff", "title": "Trends of source apportioned PM2.5 in Tianjin over 2013-2019: Impacts of clean air actions."}, {"paperId": "d40dce6f481090f491815a91b2f53b226654a080", "title": "PM2.5 source apportionment using organic marker-based chemical mass balance modeling: Influence of inorganic markers and sensitivity to source profiles"}, {"paperId": "275370409717021e1c1b7c722e7b56589d8ebf45", "title": "Comprehensive understanding on sources of high levels of fine particulate nitro-aromatic compounds at a coastal rural area in northern China."}, {"paperId": "d480ee7c52152f3648bf03bba5808ea4f840b7b4", "title": "Chemical characteristics and sources of PM2.5 in Hohhot, a semi-arid city in northern China: insight from the COVID-19 lockdown"}, {"paperId": "f8f4a161717f325adbfbce9e5b5088e0be5d1ead", "title": "Diesel vehicle emission accounts for the dominate NO source to atmospheric particulate nitrate in a coastal city: Insights from nitrate dual isotopes of PM2.5"}, {"paperId": "f19afb3893a92885b18493236ea89d89d325cf0d", "title": "Quantifying the seasonal variations and regional transport of PM 2.5 1 in the Yangtze River Delta region, China: Characteristics, sources, 2 and health risks"}, {"paperId": "0b41a13044296774ba807c9f7bbcedf05b0b62be", "title": "Chemical Characteristics and Source of PM 2.5 in Hohhot, a Semi-arid City in Northern China: Insight from the COVID-19 Lockdown"}]}
