{"paperId": "558fab3d6c877567382c12ec5b5f650fd19fa79e", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Intelligence at the Extreme Edge: A Survey on Reformable TinyML", "abstract": "Machine Learning (TinyML) is an upsurging research field that proposes to democratize the use of Machine Learning and Deep Learning on highly energy-efficient frugal Microcontroller Units (MCUs). Considering the general assumption that TinyML can only run inference, growing interest in the domain has led to work that makes them reformable, i.e., solutions that permit models to improve once deployed. This work presents a survey on reformable TinyML solutions with the proposal of a novel taxonomy. Here, the suitability of each hierarchical layer for reformability is discussed. Furthermore, we explore the workflow of TinyML and analyze the identified deployment schemes, available tools, and the scarcely available benchmarking tools. Finally, we discuss how reformable TinyML can impact a few selected industrial areas and discuss the challenges, and future directions, and its fusion with next-generation AI.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-02", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 30", "volume": "55"}, "authors": [{"authorId": "2044354712", "name": "Visal Rajapakse"}, {"authorId": "65739028", "name": "Ishan Karunanayake"}, {"authorId": "2069486128", "name": "Nadeem Ahmed"}], "citations": [{"paperId": "c0f4a265d4adc56defdc78cb1101a9de126c8b37", "title": "Investigating the Suitability of Time Series Classification Algorithms for Embedded Systems: A Case Study on Bicycle Pedaling Detection"}, {"paperId": "35763a8caa5a465fc477ba6a759d10b6128939e5", "title": "End-to-end deep learning pipeline for on-board extraterrestrial rock segmentation"}, {"paperId": "f1afde82a733022bf27fc0070a6acdbd0cc02112", "title": "On the adversarial robustness of full integer quantized TinyML models at the edge"}, {"paperId": "dbc69345104c012b01327e7607d54c0097976e35", "title": "Swift-CNN: Leveraging PCM Memory’s Fast Write Mode to Accelerate CNNs"}, {"paperId": "dcf62a211deefebca9b0fc72140f309ef169bd59", "title": "Integrating a Neural Network Library in Embedded Federated Learning"}, {"paperId": "9c713bf42d9cd4aa57b1a09b2e60e7405d8ed43d", "title": "To Personalize or Not To Personalize? Soft Personalization and the Ethics of ML for Health"}, {"paperId": "4429857adfc4d1038d4018d9f5033015a0883fbe", "title": "Energy-efficient OECT Sensor Data Analysis on Constrained Edge Devices"}, {"paperId": "8e5c3d76a9d160e87765727f5c817aea151ed900", "title": "A Machine Learning-Oriented Survey on Tiny Machine Learning"}, {"paperId": "ef0f06948edb7083a9d25eba8e79c29bd0b5f23c", "title": "Synergy of Patent and Open-Source-Driven Sustainable Climate Governance under Green AI: A Case Study of TinyML"}, {"paperId": "e781653580e0057eb4601492efe36d6f68a71ee0", "title": "Fundus Imaging-Based Healthcare: Present and Future"}, {"paperId": "1910618ddcf48b86360dc72fadf389583577feb3", "title": "TyBox: an automatic design and code-generation toolbox for TinyML incremental on-device learning"}, {"paperId": "c1bb8b3e72775150f333070a00a3ec528073df98", "title": "Embedded federated learning over a LoRa mesh network"}, {"paperId": "9f9cd3e64451871595f42751bd8b7c0dd9a89841", "title": "Uma Arquitetura de Rede Neural com Auxílio da Nuvem para Dispositivos Computacionalmente Limitados"}, {"paperId": "b28d7493fe13e1a1a4a9e46e402e822897feb3cf", "title": "TinyML: Tools, Applications, Challenges, and Future Research Directions"}, {"paperId": "bb97ec50be795510a085cf4b6f70ecdb6aa5be3c", "title": "Towards secure private and trustworthy human-centric embedded machine learning: An emotion-aware facial recognition case study"}, {"paperId": "4619040122cd854284ba5fa07a4d6410caf6dd03", "title": "A review of TinyML"}, {"paperId": "cf5a6e8fdbb5c6aaa2945882ea4fe70a09a3adfe", "title": "The Effects of Weight Quantization on Online Federated Learning for the IoT: A Case Study"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}, {"paperId": "0adf3bf3f8cc607221d2459d7671fc549cbc2075", "title": "A Comprehensive Survey on TinyML"}, {"paperId": "bbe51ef97ba03857101df616ee0947589011591a", "title": "Enhancing Memory Utilization For On-Device Training of TinyML Models Utilizing Enhanced Grey Wolf Optimization Pushing State-of-the-Art Limits - TinyWolf"}]}
