{"paperId": "559cd41d9b9aec6bbc0fd4c5e4847c2fcc3d0b81", "publicationVenue": null, "title": "PERFORMANCE OPTIMISATION FOR ENVIRONMENTAL RI PROJECTS: SYSTEM DESIGN WORK PACKAGE 7—DATA PROCESSING AND ANALYSIS", "abstract": "This is the ﬁrst deliverable for Task 7.2, “Performance optimisation for big data science” , which addresses the optimisation strand of the ENVRIplus Data for Science theme. It provides an initial design vision and roadmap for the next 22 months; a successor deliverable D7.4, “Performance optimisation services for environmental ESFRI projects: prototype” , will be produced in 2018, detailing the actual technologies that will result from the task. ‘Optimisation’ covers a broad spectrum of possibilities. The focus of the optimisation task however is principally on the use of micro-services to optimise distributed data access, delivery and processing on e-infrastructures used by research infrastructures and their respective communities, allowing them to perform the kind of investigations of data that push the boundaries of what was previously achievable with the resources available. This deliverable ( D7.3 ) provides four main contributions. Firstly, it describes a general design vision for development of optimisation services, in particular noting how this vision relates to the various concurrent activities of the Data for Science theme. Secondly, it details some of the preliminary work that has already been performed or is in development by contributors to the task in order to provide the ENVRIplus community with an early indication of the kind of practical investigations being performed within this topic area. Thirdly, a provisional roadmap for the task is provided, sketching the shape of the task and the likely interaction points with diﬀerent ENVRIplus activities up until the completion of the task in late 2018. Finally, a few recommendations are distilled from the work done so far, and presented in the summary section at the end of deliverable.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [], "citations": []}
