{"paperId": "559edd1bce243679b2ce6392ef5fd640fac906df", "publicationVenue": null, "title": "MSEva: A Musculoskeletal Rehabilitation Evaluation System Based on EMG Signals", "abstract": "In order to better assist the rehabilitation treatment of patients with musculoskeletal injury, standard rehabilitation actions are needed to guide the musculoskeletal rehabilitation process. With more and more urgent demands, the musculoskeletal rehabilitation evaluation systems have attracted a high degree of attention. Experts have proposed a series of systems based on laser, ultrasound, and image, which can give reasonable recognition and judgment. However, these systems either require specialized and expensive equipment or can be affected by ionizing radiation. How to construct a musculoskeletal rehabilitation evaluation system with low cost, good effect, and little injury is still a great challenge. In this article, we propose MSEva, a musculoskeletal rehabilitation evaluation system based on EMG signals. Specifically, the system uses EMG sensors to collect a large amount of data for five rehabilitation actions. Secondly, MSEva uses Wavelet Transform (WT) to extract the signal features and then puts the processed data into the Long Short-Term Memory (LSTM) network for model training. Finally, the system uses the LSTM model to evaluate the normality of the EMG response of rehabilitation actions. The results show that the average accuracy of MSEva reaches 94.37%, which has important evaluation value in guiding the rehabilitation of musculoskeletal patients.", "venue": "ACM Trans. Sens. Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-09", "journal": {"name": "ACM Transactions on Sensor Networks", "pages": "1 - 23", "volume": "19"}, "authors": [{"authorId": "2116917175", "name": "Yuan Dai"}, {"authorId": "2149267523", "name": "Jing Wu"}, {"authorId": "2158464838", "name": "Yuanzhao Fan"}, {"authorId": "2158605991", "name": "Jin Wang"}, {"authorId": "2118969784", "name": "Jianwei Niu"}, {"authorId": "2056184106", "name": "Fei Gu"}, {"authorId": "97688457", "name": "Shigen Shen"}], "citations": [{"paperId": "195554622d5523898f8701638bb8f66eb972bba1", "title": "Comparing the osteogenesis outcomes of different lumbar interbody fusions (A/O/X/T/PLIF) by evaluating their mechano-driven fusion processes."}, {"paperId": "77edfe9d17914deec9d734a869c1c68311edd737", "title": "An Optimized Stimulation Control System for Upper Limb Exoskeleton Robot-Assisted Rehabilitation Using a Fuzzy Logic-Based Pain Detection Approach"}, {"paperId": "39ed2d20b479f36da12a9171829f2363ddc71779", "title": "Optimized fuzzy K-nearest neighbor approach for accurate lung cancer prediction based on radial endobronchial ultrasonography"}, {"paperId": "153e8c60c138fc24029b6b028a2f6980fa65d8fc", "title": "Advancing gene feature selection: Comprehensive learning modified hunger games search for high-dimensional data"}, {"paperId": "8853f6a5467e6640294b4e87972fec53cd605dab", "title": "RehabFAB: design investigation and needs assessment of displacement-orientated fabric wearable sensors for rehabilitation"}, {"paperId": "04753e5f4bf94457e5a38c4ad8b7b4ed7b9fa80e", "title": "Intrinsically Stretchable, Self-Healing, and Large-Scale Epidermal Bioelectrode Arrays for Electrophysiology and Gesture Recognition."}, {"paperId": "41ba4ca939ef8a1461c71672aea533f599714aa4", "title": "Wrist Motion Classification Using Flexible sEMG Sensors in Different Feature Conditions Based on Machine Learning"}, {"paperId": "7970df81efa4120408ea72d4b428e699e14e5da0", "title": "Classification of Hand Movements Using Electromyographic Signals and Machine Learning Models"}, {"paperId": "9331fe5ae1d8c16a36037dd0f0378ccac7d5f230", "title": "Contrast Everything: A Hierarchical Contrastive Framework for Medical Time-Series"}, {"paperId": "b24baf12fa873cbff0a6572756c36dd2ed5116c8", "title": "An enhanced decision-making framework for predicting future trends of sharing economy"}, {"paperId": "26c8c2030c14e7fbc1c98060a2e06f0bae311e70", "title": "Face Image Segmentation Using Boosted Grey Wolf Optimizer"}, {"paperId": "a75b05df7d2ec9294cda2a87829199a5d36caca8", "title": "Examination of the Accuracy of Movement Tracking Systems for Monitoring Exercise for Musculoskeletal Rehabilitation"}, {"paperId": "f4c3703cc4321ea9af7c0613ed3c2c705ebe150e", "title": "Optimizing deep transfer networks with fruit fly optimization for accurate diagnosis of diabetic retinopathy"}, {"paperId": "f1f89759e4076d52726b0f21cd73025aee70b1e2", "title": "Internet of Medical Things and Healthcare 4.0: Trends, Requirements, Challenges, and Research Directions"}, {"paperId": "b92da0e21a647c2975e079bff4c12991c127b1a3", "title": "Anti-sine-cosine atom search optimization (ASCASO): a novel approach for parameter estimation of PV models"}, {"paperId": "1fe0f5ab05c2ca9a7a063950644770acf0a7f791", "title": "Multi-threshold image segmentation based on an improved differential evolution: Case study of thyroid papillary carcinoma"}, {"paperId": "f18955d30f0e7e5949884e78349fec9f6a139e1e", "title": "Prediction of fractional flow reserve with enhanced ant lion optimized support vector machine"}, {"paperId": "e379bf36e0cc95d27fc06b4e1bf4334a81199ca9", "title": "Comprehensive Learning Strategy Enhanced Chaotic Whale Optimization for High-dimensional Feature Selection"}, {"paperId": "21e431ad10f7d139803d4e986e8a6382261c5e0f", "title": "Dynamic mechanism-assisted artificial bee colony optimization for image segmentation of COVID-19 chest X-ray"}, {"paperId": "3c234b3870f63675d65d6a5b7b2c1c8eeb5c111c", "title": "OCRUN: An oppositional Runge Kutta optimizer with cuckoo search for global optimization and feature selection"}, {"paperId": "1f1bd1603b0994fbe300cdb297bd1a53dc9de8eb", "title": "Classification of lung cancer computed tomography images using a 3-dimensional deep convolutional neural network with multi-layer filter"}, {"paperId": "2c296aea4276fa7f42cf3e7a546fc5d8c8b8bf3a", "title": "Improved Colony Predation Algorithm Optimized Convolutional Neural Networks for Electrocardiogram Signal Classification"}, {"paperId": "6bb6f14caf0352e5d10b59e18e5f0d883bc4fc0d", "title": "Multi-threshold image segmentation using an enhanced fruit fly optimization for COVID-19 X-ray images"}, {"paperId": "fb8a7d8707918ef4c1420366f9b5e55a30c702dd", "title": "An enhanced grey wolf optimizer boosted machine learning prediction model for patient-flow prediction"}, {"paperId": "5be5f482f9c14d950a52ba2e336050689daafeaa", "title": "FRSR: Framework for real-time scene reconstruction in robot-assisted minimally invasive surgery"}, {"paperId": "4ce1be5a1d9568d93fd5c562541b15b1d8a49170", "title": "A grade-based search adaptive random slime mould optimizer for lupus nephritis image segmentation"}, {"paperId": "0b457b7b34c9eee8f432e5ed9c32ab302d651069", "title": "Pneumothorax prediction using a foraging and hunting based ant colony optimizer assisted support vector machine"}, {"paperId": "93d654821d44bbf6a678c7bfbcfbd06cb1dbde8c", "title": "An enhanced Runge Kutta boosted machine learning framework for medical diagnosis"}, {"paperId": "462bbd9ab40e1faf08118548ace5ec205f939800", "title": "An artificial bee bare-bone hunger games search for global optimization and high-dimensional feature selection"}, {"paperId": "6c0a5022206445b6b22e9ba0bab34ef5a06a2219", "title": "Electromyography Monitoring Systems in Rehabilitation: A Review of Clinical Applications, Wearable Devices and Signal Acquisition Methodologies"}, {"paperId": "7f1112c6574a0d3b74e69ffc21e8c817febafd8c", "title": "A Confusion Method for the Protection of User Topic Privacy in Chinese Keyword-based Book Retrieval"}, {"paperId": "8281c54e4350d25c6b1decd1fabb04485170825a", "title": "TC-Net: A Transformer Capsule Network for EEG-based emotion recognition"}, {"paperId": "0be51e5e4ecfedb54c886a7c12f0e30a3d32bd4a", "title": "Twist-Net: A multi-modality transfer learning network with the hybrid bilateral encoder for hypopharyngeal cancer segmentation"}, {"paperId": "ea7cd18c8fe2d5bb7b5e5c7e8e87978ee0967f09", "title": "HSNet: A hybrid semantic network for polyp segmentation"}, {"paperId": "3c04ef3835d17af0a93391c64f30bc6d5d7eac85", "title": "A novel minimum generalized cross entropy-based multilevel segmentation technique for the brain MRI/dermoscopic images"}, {"paperId": "cad1f3e2d8a76402d23b5c39a181de9ccca68100", "title": "Research on multi-modal autonomous diagnosis algorithm of COVID-19 based on whale optimized support vector machine and improved D-S evidence fusion"}, {"paperId": "1b895f8d7d6b83998ca6a4bb51521f135fb1889a", "title": "A Natural Language Processing (NLP) Evaluation on COVID-19 Rumour Dataset Using Deep Learning Techniques"}, {"paperId": "8a891294b4a255fb5e428d44c483463cdf54af8b", "title": "Private anomaly detection of student health conditions based on wearable sensors in mobile cloud computing"}, {"paperId": "d8239a910afd9a6400d03dba7c50414c5f2d68ca", "title": "Joint optic disc and cup segmentation using feature fusion and attention"}, {"paperId": "58727aa87baaaa45a2601c9a084a5aee649c6889", "title": "The prediction of cardiac abnormality and enhancement in minority class accuracy from imbalanced ECG signals using modified deep neural network models"}, {"paperId": "1690ad04d63e02a554e3a74e213887710c19e2af", "title": "SIL-Net: A Semi-Isotropic L-shaped network for dermoscopic image segmentation"}, {"paperId": "1298865070268e5431fb22c817d9ca86f685727e", "title": "A Cuproptosis Activation Scoring model predicts neoplasm-immunity interactions and personalized treatments in glioma"}, {"paperId": "8a9e7a8c7a395583c27b1f9ed013d7fdb3d467fb", "title": "Multi-label classification of fundus images with graph convolutional network and LightGBM"}, {"paperId": "8cf5c821e7722c06f314b5c9fb2c1c526fd4cbc6", "title": "A multi-step approach for tongue image classification in patients with diabetes"}, {"paperId": "be27d670656e517bf8512cdb44bb8c5dcd44c923", "title": "Diabetic retinopathy screening using deep learning for multi-class imbalanced datasets"}, {"paperId": "da8657b49a94eef9ee4954f6b1ede6e647c5474a", "title": "Prediction of recurrent spontaneous abortion using evolutionary machine learning with joint self-adaptive sime mould algorithm"}, {"paperId": "852545f5a73d9174f58ee0ea32a90f2ff34b85fe", "title": "A novel data-driven method for the analysis and reconstruction of cardiac cine MRI"}, {"paperId": "ff0777afd799210a2dd74897a3c8853d4c540f24", "title": "Simultaneously exploring multi-scale and asymmetric EEG features for emotion recognition"}, {"paperId": "7c1c4dc4c520f35d975c36d4c4c70df294cafb72", "title": "A Comprehensive Study of DCNN Algorithms-based Transfer Learning for Human Eye Cataract Detection"}]}
