{"paperId": "55a14a4d9c254ccb12f6f9a93dbda30a7e6ad159", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Multi-Keyword Certificateless Searchable Public Key Authenticated Encryption Scheme Based on Blockchain", "abstract": "As a quite attractive secure search mechanism in cloud environments, searchable encryption allows encrypted files to be searched by keyword and does not reveal any information about original data files. However, most existing searchable encryption schemes only support single keyword ciphertext retrieval, and they cannot resist against inside keyword guessing attacks. Besides, the previous schemes rarely focus on integrity verification and fair transactions without any third party. Focusing on these problems, we propose a multi-keyword certificateless searchable public key authenticated encryption scheme based on blockchain. We use certificateless cryptosystem to encrypt keywords, which avoids the problems of certificate management in traditional cryptosystem and key escrow in identity-based cryptosystem. Our scheme also supports multi-keyword search, which locates encrypted files precisely and returns the desired files. Moreover, we upload the real encrypted files to the cloud server, while the encrypted indexes are put in blockchain, which ensures the anti-tampering, integrity and traceability of the encrypted indexes. The anti-tampering of blockchain also ensures that users can receive accurate search results without any third party verification. Furthermore, we utilize smart contract to track monetary rewards, which enables fair transactions between data owners and users without any trusted third party. We prove that the proposed scheme is secure against inside keyword guessing attacks in the random oracle model. Finally, our performance evaluation shows that the proposed scheme has higher computational performance than other related schemes.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "158765-158777", "volume": "8"}, "authors": [{"authorId": "2115881293", "name": "Xiaodong Yang"}, {"authorId": "150109446", "name": "Guilan Chen"}, {"authorId": "150237492", "name": "Meiding Wang"}, {"authorId": "50858019", "name": "Ting Li"}, {"authorId": "1840065769", "name": "Caifen Wang"}], "citations": [{"paperId": "bf92c975a56978e803c7cf18164be9840f132c88", "title": "Survey on Secure Keyword Search over Outsourced Data: From Cloud to Blockchain-assisted Architecture"}, {"paperId": "cced4b3641c0cb2329d30a0a81105382330c1653", "title": "Cryptanalysis of Two Public Key Encryption Schemes with Multi-keyword Search"}, {"paperId": "149b7d48e05536254e9223be7cae1ed584eff39d", "title": "MSIAP: A Dynamic Searchable Encryption for Privacy-Protection on Smart Grid With Cloud-Edge-End"}, {"paperId": "097db270013517e1d5245a7af971b1ac4ab1dd79", "title": "Secure and Efficient Certificateless Searchable Authenticated Encryption Scheme Without Random Oracle for Industrial Internet of Things"}, {"paperId": "d1c80190c80c54c30a7950a5561db811058c3c45", "title": "A designated tester-based certificateless public key encryption with conjunctive keyword search for cloud-based MIoT in dynamic multi-user environment"}, {"paperId": "e5fa558020e3eb3e8953738f3963f708143b6562", "title": "Certificateless Searchable Encryption Scheme in Multi-User Environment"}, {"paperId": "d87a943fcfaf4f7eecb44ef0a1d482634110b93f", "title": "Healthcare data analysis by feature extraction and classification using deep learning with cloud based cyber security"}, {"paperId": "72af682aaf9b5e690d3ed8b7ccfe4668e54599d9", "title": "Blockchain-based verifiable and dynamic multi-keyword ranked searchable encryption scheme in cloud computing"}, {"paperId": "0488837dc066aba852347aae498883cdcc145b76", "title": "An enhanced heterogeneous public key searchable encryption scheme supporting multiple keywords"}, {"paperId": "9b657ded0a70f2c2f404986476ecd44f98ee2933", "title": "EMK-ABSE: Efficient Multikeyword Attribute-Based Searchable Encryption Scheme Through Cloud-Edge Coordination"}, {"paperId": "0c2cbcefeb8e41c0a8eb00f67a813f5a06eddc93", "title": "Application of Blockchain Based on Deep Learning Algorithm in Enterprise Internet of Things System"}, {"paperId": "c3d21baa99f2f5c0047c779a1cb7ac0a9af290e0", "title": "Blockchain-Enabled Searchable Encryption in Clouds: A Review"}, {"paperId": "8c0bd8290bb9be646a8a1801fa568af74aff9367", "title": "Towards Secure Searchable Electronic Health Records Using Consortium Blockchain"}, {"paperId": "1eac41c6d3d51eff6cf6b24ad1e731c388b63ad2", "title": "Blockchain-based Certificateless Identity Management Mechanism in Cloud-native Environments"}, {"paperId": "5d8f487c070854ffb12fd471b7f1f73103655633", "title": "A designated cloud server-based multi-user certificateless public key authenticated encryption with conjunctive keyword search against IKGA"}, {"paperId": "d1eca81648c1b78baf0e31de8fbceea30b0d4699", "title": "Blockchain-based Searchable Proxy Re-encryption Scheme for EHR Security Storage and Sharing"}, {"paperId": "8e4ef3af4d18a0896e3fe680e50e0b04b2d7f6ac", "title": "Blockchain-Enabled Public Key Encryption with Multi-Keyword Search in Cloud Computing"}, {"paperId": "6c36a31abc35703d2e2263bc101d0caeb92a06ec", "title": "Privacy leakage of certificateless public key authenticated searchable encryption via frequency analysis: Attacks and revises"}]}
