{"paperId": "55a364012166cd34d081e327de5d70839e634f1c", "publicationVenue": null, "title": "Unveiling the Dark Side of ChatGPT: Exploring Cyberattacks and Enhancing User Awareness", "abstract": "The Chat Generative Pre-training Transformer (GPT), also known as ChatGPT, is a powerful generative AI model that can simulate human-like dialogues across a variety of domains. However, this popularity has attracted the attention of malicious actors who exploit ChatGPT to launch cyberattacks. This paper examines the tactics that adversaries use to leverage ChatGPT in a variety of cyberattacks. Attackers pose as regular users and manipulate ChatGPT’s vulnerability to malicious interactions, particularly in the context of cyber assault. The paper presents illustrative examples of cyberattacks that are possible with ChatGPT and discusses the realm of ChatGPT-fueled cybersecurity threats. The paper also investigates the extent of user awareness of the relationship between ChatGPT and cyberattacks. A survey of 253 participants was conducted, and their responses were measured on a three-point Likert scale. The results provide a comprehensive understanding of how ChatGPT can be used to improve business processes and identify areas for improvement. Over 80% of the participants agreed that cyber criminals use ChatGPT for malicious purposes. This finding underscores the importance of improving the security of this novel model. Organizations must take steps to protect their computational infrastructure. This analysis also highlights opportunities for streamlining processes, improving service quality, and increasing efficiency. Finally, the paper provides recommendations for using ChatGPT in a secure manner, outlining ways to mitigate potential cyberattacks and strengthen defenses against adversaries.", "venue": "Inf.", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-02", "journal": {"name": "Inf.", "pages": "27", "volume": "15"}, "authors": [{"authorId": "52011733", "name": "Moatsum Alawida"}, {"authorId": "1697090", "name": "Bayan Abu Shawar"}, {"authorId": "46207123", "name": "Oludare Isaac Abiodun"}, {"authorId": "2179659049", "name": "Abid Mehmood"}, {"authorId": "52135167", "name": "Abiodun Esther Omolara"}, {"authorId": "71715783", "name": "A. K. Hwaitat"}], "citations": [{"paperId": "66f581ae106ac28faebd3d54a01edd53cf91da30", "title": "Generative AI Security: Challenges and Countermeasures"}, {"paperId": "9e0d15ae22980bdef3dbe010de82f9438fc309e7", "title": "CyberSafe: A Gamified Cyber Security Training Method"}, {"paperId": "383c598625110e0a4c60da4db10a838ef822fbcf", "title": "A Survey on Large Language Model (LLM) Security and Privacy: The Good, the Bad, and the Ugly"}]}
