{"paperId": "55b0777c235fa626b6ccba1cd994aa8e2557ce04", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "On-Body Sensor Positions Hierarchical Classification", "abstract": "Many motion sensor-based applications have been developed in recent years because they provide useful information about daily activities and current health status of users. However, most of these applications require knowledge of sensor positions. Therefore, this research focused on the problem of detecting sensor positions. We collected standing-still and walking sensor data at various body positions from ten subjects. The offset values were removed by subtracting the sensor data of standing-still phase from the walking data for each axis of each sensor unit. Our hierarchical classification technique is based on optimizing local classifiers. Many common features are computed, and informative features are selected for specific classifications. In this approach, local classifiers such as arm-side and hand-side discriminations yielded F1-scores of 0.99 and 1.00, correspondingly. Overall, the proposed method achieved an F1-score of 0.81 and 0.84 using accelerometers and gyroscopes, respectively. Furthermore, we also discuss contributive features and parameter tuning in this analysis.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-24", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "51498068", "name": "Vu Ngoc Thanh Sang"}, {"authorId": "1982218", "name": "S. Yano"}, {"authorId": "1952031", "name": "T. Kondo"}], "citations": [{"paperId": "0a5846cd4baa8d958d68f03dcc3f9a4c49562bb2", "title": "A global bibliometric and visualized analysis of gait analysis and artificial intelligence research from 1992 to 2022"}, {"paperId": "8c5d47cc0a0676865ec1fff350b574b9071c9e7d", "title": "Spatial and Temporal Gait Characteristics in Patients Admitted to a Neuro-Rehabilitation Department with Age-Related White Matter Changes: A Gait Analysis and Clinical Study"}, {"paperId": "a13750399e68b41d6f0a67af7645c9a0bd3058b0", "title": "Automatic Body Segment and Side Recognition of an Inertial Measurement Unit Sensor during Gait"}, {"paperId": "4450b4c32777f2f573e1b2f9628650a8ced35445", "title": "Storing and Computation of Real-Time Data on the Cloud Through Medical Sensors"}, {"paperId": "64cd08ff6708e7a6d435f2cdc8e4c4a02fc9008e", "title": "DMSTL: A Deep Multi-Scale Transfer Learning Framework for Unsupervised Cross-Position Human Activity Recognition"}, {"paperId": "4c5f0c98dc7a17cb0ab1719b0956a7b6bc66ccb9", "title": "Augmented Adversarial Learning for Human Activity Recognition with Partial Sensor Sets"}, {"paperId": "07a4073473df90600b39fde978b67b8d61757124", "title": "How tri-axial sensors influenced the location-based heterogeneous activities recognition rates: an exploratory analysis"}, {"paperId": "1dacf5e48c0a9cab772ddf3c372b1c57b4c3bf42", "title": "Inertial Sensor Reliability and Validity for Static and Dynamic Balance in Healthy Adults: A Systematic Review"}, {"paperId": "f6167eb0d394883344374fb21f1495efb793b51a", "title": "An Intelligent Clinical Decision Support System for Predicting Acute Graft-versus-host Disease (aGvHD) following Allogeneic Hematopoietic Stem Cell Transplantation"}, {"paperId": "f11df851075bf8e61705d458540fc76c8ac54c85", "title": "New Position Candidate Identification via Clustering toward an Extensible On-Body Smartphone Localization System"}, {"paperId": "eaf93270a62577ee0c08464aeee9ce72250a76fc", "title": "Inertial sensor fusion for gait recognition with symmetric positive definite Gaussian kernels analysis"}, {"paperId": "f0db468a8edd493482c1368a7e6e2e98baedf4d0", "title": "Validation of a low-cost inertial motion capture system for whole-body motion analysis."}, {"paperId": "d702094de056327655e82bdf8289637536dca67a", "title": "Gait analysis - Available platforms for outcome assessment."}, {"paperId": "db08b646d9fa5226f74d93e3680abf67c1d0f01a", "title": "Human Activities and Postures Recognition: From Inertial Measurements to Quaternion-Based Approaches"}, {"paperId": "1ffc95b9c42135aeba8a074e36cf1a301590ff77", "title": "A Human Activity Recognition Algorithm Based on Stacking Denoising Autoencoder and LightGBM"}]}
