{"paperId": "55bd7c06ff795ad1f8f62b1295190097c4693189", "publicationVenue": {"id": "2c40a2c7-e6ba-4c0e-9057-ab9084a9bdd3", "name": "Designs", "issn": "2411-9660", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1047905", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1047905", "https://www.mdpi.com/journal/designs"]}, "title": "Enhanced Heart Disease Prediction Based on Machine Learning and χ2 Statistical Optimal Feature Selection Model", "abstract": "Automatic heart disease prediction is a major global health concern. Effective cardiac treatment requires an accurate heart disease prognosis. Therefore, this paper proposes a new heart disease classification model based on the support vector machine (SVM) algorithm for improved heart disease detection. To increase prediction accuracy, the χ2 statistical optimum feature selection technique was used. The suggested model’s performance was then validated by comparing it to traditional models using several performance measures. The proposed model increased accuracy from 85.29% to 89.7%. Additionally, the componential load was reduced by half. This result indicates that our system outperformed other state-of-the-art methods in predicting heart disease.", "venue": "Designs", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-29", "journal": {"name": "Designs"}, "authors": [{"authorId": "2186574914", "name": "Raniya R. Sarra"}, {"authorId": "70051001", "name": "Ahmed M. Dinar"}, {"authorId": "7349492", "name": "M. Mohammed"}, {"authorId": "72547078", "name": "Karrar Hameed Abdulkareem"}], "citations": [{"paperId": "5afadd2848689ab6ae9b100875bfdeb70e61886d", "title": "Early prediction of chronic heart disease with recursive feature elimination and supervised learning techniques"}, {"paperId": "c53e5f253badbcc3fc87ba801b4535959b65c89d", "title": "Big data analytics in healthcare environment using chaotic red deer optimizer with deep learning for disease classification model"}, {"paperId": "89be7b3c32a9d295a91dcfb3fe0dcea5b900ec6b", "title": "AN An ica-ensemble learning approach for prediction of uwb nlos signals data classification"}, {"paperId": "f74b21621658d1d6333ebb73f4494d2d62a39ae0", "title": "Exploring Important Factors in Predicting Heart Disease Based on Ensemble- Extra Feature Selection Approach"}, {"paperId": "7ff9b786be7eff0e3ac2f07cf1aed28530deb1c3", "title": "A Pragmatic Approach of Heart and Liver Disease Prediction using Machine Learning Classifiers"}, {"paperId": "e5fe8856f806a81fa40e717d60af7cc222ae939a", "title": "A machine learning approach to cardiovascular disease prediction with advanced feature selection"}, {"paperId": "729444fc15a1b5aad346b945b35c791ead58b417", "title": "Data-Driven Insights: A Genetic Algorithm Feature Optimization Approach to Heart Disease Prediction"}, {"paperId": "7691034e4a394a7afce306f7a53cff9474ba7171", "title": "A Novel Heart Disease Prediction System using Deep Multi-Layer Perceptron and Optimal Feature Selection Mechanism"}, {"paperId": "c03635d3556cffdbbda0924dc1c1a323c01d4a11", "title": "Ensemble Heuristic-Metaheuristic Feature Fusion Learning for Heart Disease Diagnosis Using Tabular Data"}, {"paperId": "b9d7d3ef89191111e63c33ef32e5d7b3ee6f4cfc", "title": "Towards Accurate Heart Disease Diagnosis: An Overview of Machine Learning Approaches"}, {"paperId": "ebc11deb01c73b9d9a3d0addc382802aae030d2a", "title": "Evaluating the Performance of Automated Machine Learning (AutoML) Tools for Heart Disease Diagnosis and Prediction"}, {"paperId": "93a5a7c07720124702e729b51778b8d03220c98d", "title": "An efficient disease prediction framework based on optimized machine learning models for a smart healthcare application"}, {"paperId": "2009b4320ab017f7188f10c7ad3d22b16737e095", "title": "Improved UAV blade unbalance prediction based on machine learning and ReliefF supreme feature ranking method"}, {"paperId": "4e18154d622e550f0fa8719c567bdbf7042dff49", "title": "Cardiac Failure Forecasting Based on Clinical Data Using a Lightweight Machine Learning Metamodel"}, {"paperId": "6e9cbbee0236ba8f10af3a18d587d6ed24ebfa77", "title": "Performance Comparison Analysis of Predicting the Heart Diseases using Machine Learning Algorithms"}, {"paperId": "fb5a4f87b2eb6b82fbf3b3c281df416e1abb512a", "title": "Prediction of Heart Disease Based on Machine Learning Using Jellyfish Optimization Algorithm"}, {"paperId": "b1e7b09a290eafa2191f800f7c0634e4857c127b", "title": "Heart Disease Prediction using Jellyfish Search Optimization and Deep Residual Networks"}, {"paperId": "580e564b659f8ed6efe4994a574998ceb20d3fbc", "title": "Predictive Analysis from Patient Health Records Using Machine Learning"}, {"paperId": "e20494d48e2b3e8db47c5e974d494c176151fc42", "title": "Prediction of Heart Disease Using Naive Bayes and Particle Swarm Optimization (PSO) Method"}, {"paperId": "6f1cc5adc74be14b35500a09fe2d499d1b3efe56", "title": "A Comparative Performance Study of Support Vector Machine, KNN, and Ensemble Classifiers on through-wall human detection Dataset"}, {"paperId": "12d13fc8f61123de10597eac20c42d2c71df8865", "title": "Heart Failure Detection Using Instance Quantum Circuit Approach and Traditional Predictive Analysis"}, {"paperId": "c68fdf3f5097ac76c5e15ea5e046a532330a018d", "title": "Penguin search optimization algorithm with multi-agent reinforcement learning for disease prediction and recommendation model"}, {"paperId": "b7302b58a9701a73fa231012b7b40050035f91d9", "title": "Rise of Deep Learning Clinical Applications and Challenges in Omics Data: A Systematic Review"}, {"paperId": "2c241c94883ff4a6f6123e04146ba2def867a9e7", "title": "An Intelligent Fault Diagnosis Approach for Multirotor UAVs Based on Deep Neural Network of Multi-Resolution Transform Features"}, {"paperId": "d15fa2591843d5bcb376a5608f8dc5ab2f2736fa", "title": "Deep learning models for multilabel ECG abnormalities classification: A comparative study using TPE optimization"}, {"paperId": "294ae2822a5fb4996429f6ebc2dac949288afddf", "title": "Hybrid Model Feature Selection with the Bee Swarm Optimization Method and Q-Learning on the Diagnosis of Coronary Heart Disease"}, {"paperId": "bf45a817c94b87dad326ec82c1b59d85df9e872b", "title": "Heart Disease Prediction Using Machine Learning"}, {"paperId": "ef3de39249077be43f10289c06956f7fbf7aee13", "title": "A Robust Framework for Data Generative and Heart Disease Prediction Based on Efficient Deep Learning Models"}, {"paperId": "8bb1e9475e5c564f3644e9865801d9e40e4421d4", "title": "Applications of Machine Learning Techniques for Fault Diagnosis of UAVs"}, {"paperId": "f451d22af40ac7ab55fed2f2d3ff5fe3c0ae8e61", "title": "Rotating Machinery Fault Diagnosis based on Artificial Intelligence and Vibration Analysis"}]}
