{"paperId": "55beff391c98765022dc508604532886bb6b1ecf", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "Optimal oblivious reconfigurable networks", "abstract": "Oblivious routing has a long history in both the theory and practice of networking. In this work we initiate the formal study of oblivious routing in the context of reconfigurable networks, a new architecture that has recently come to the fore in datacenter networking. These networks allow a rapidly changing bounded-degree pattern of interconnections between nodes, but the network topology and the selection of routing paths must both be oblivious to the traffic demand matrix. Our focus is on the trade-off between maximizing throughput and minimizing latency in these networks. For every constant throughput rate, we characterize (up to a constant factor) the minimum latency achievable by an oblivious reconfigurable network design that satisfies the given throughput guarantee. The trade-off between these two objectives turns out to be surprisingly subtle: the curve depicting it has an unexpected scalloped shape reflecting the fact that load-balancing becomes more difficult when the average length of routing paths is not an integer because equalizing all the path lengths is not possible. The proof of our lower bound uses LP duality to verify that Valiant load balancing is the most efficient oblivious routing scheme when used in combination with an optimally-designed reconfigurable network topology. The proof of our upper bound uses an algebraic construction in which the network nodes are identified with vectors over a finite field, the network topology is described by either the elementary basis or a sequence of Vandermonde matrices, and routing paths are constructed by selecting columns of these matrices to yield the appropriate mixture of path lengths within the shortest possible time interval.", "venue": "Symposium on the Theory of Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-11-16", "journal": {"name": "Proceedings of the 54th Annual ACM SIGACT Symposium on Theory of Computing"}, "authors": [{"authorId": "2143229629", "name": "Daniel Amir"}, {"authorId": "2067871517", "name": "Tegan Wilson"}, {"authorId": "50740529", "name": "Vishal Shrivastav"}, {"authorId": "1712689", "name": "Hakim Weatherspoon"}, {"authorId": "2633757", "name": "Robert D. Kleinberg"}, {"authorId": "34292316", "name": "R. Agarwal"}], "citations": [{"paperId": "3fb24aa1074f099347496b5b88451dd1d3205995", "title": "Poster: Scalability and Congestion Control in Oblivious Reconfigurable Networks"}, {"paperId": "b410456cb0da7ef4d464a2e0a71467fd74c5a850", "title": "Breaking the VLB Barrier for Oblivious Reconfigurable Networks"}, {"paperId": "e0e3e3ae2279c6aeb65cd9ba1ef66bce25c02016", "title": "OpticNet: Self-Adjusting Networks for ToR-Matching-ToR Optical Switching Architectures"}, {"paperId": "14a5dd7583a7c2888047163ef34ae989d55e13e9", "title": "Demand-oblivious routing in complex networks under uncertainty"}, {"paperId": "2d648d7a9ef6ae129c8cf37dde984498871dedaa", "title": "Mars: Near-Optimal Throughput with Shallow Buffers in Reconfigurable Datacenter Networks"}, {"paperId": "406939de70c94d9daecc10ee0c11480592aa4268", "title": "Fast and Heavy Disjoint Weighted Matchings for Demand-Aware Datacenter Topologies"}, {"paperId": "46335c7ffada9814149d262210d97ac7c75d7412", "title": "On Efficient Oblivious Wavelength Assignments for Programmable Wide-Area Topologies"}, {"paperId": "c0f84e4e97e918886846f5b0b6434fc4b91bbf87", "title": "Extending Optimal Oblivious Reconfigurable Networks to all N"}, {"paperId": "c34b7382a31db4a38dea6ea5f4c2404f1bd120bb", "title": "Scalabilitiy and Congestion Control in Oblivious Reconfigurable Networks"}, {"paperId": "4b49f341a6b7c3802aa23a0c03e20c8bfd7c730b", "title": "Harmony: A Congestion-free Datacenter Architecture"}]}
