{"paperId": "55c2681e2ed3d8c09751eb6370a5492b7bcb85d5", "publicationVenue": null, "title": "Design and implementation of a CPS-based predictive maintenance and automated management platform", "abstract": "The concept of cyber-physical systems (CPSs) is a core technology indispensable to Industry 4.0. The development of an intelligent automatic operational management platform is presented in this study. The platform is used to collect on-site data, provide predictive maintenance, and monitor and control the mobile robots. For predictive maintenance, it is targeted at products from manufacturing big data to cloud computing, and predictive maintenance for all factories around the world. The efficiency of the management system is improved by the performance evaluation strategy. In the experiments, the authors implement and discuss the predictive maintenance platform with generated synthetic data and real-world data collected from a gearbox plant. The results show that the important variables possess large drops according to mean decrease Gini. A warning generation for battery simulation and manufacturing execution is also presented to demonstrate the proposed system design. The results show that the discharge curve drops sharply at the last stage, and the warning value can be set accordingly.", "venue": "IET Cyper-Phys. Syst.: Theory & Appl.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-11", "journal": {"name": "IET Cyper-Phys. Syst.: Theory & Appl.", "pages": "100-109", "volume": "5"}, "authors": [{"authorId": "8422309", "name": "H. Lin"}, {"authorId": "65783251", "name": "Fang-Ning Yang"}], "citations": [{"paperId": "03c9b7572fcdb9f21d69ede51bd2baa896680e8b", "title": "Cloud manufacturing architectures: State-of-art, research challenges and platforms description"}, {"paperId": "646f472b6e9cc964451ba56d86b60e5bb3a506ec", "title": "OCDMA: a MAC Protocol for Industrial Intra-machine TeraHertz Network"}, {"paperId": "948e259896a9b1b25ddb89fb26a598eefa9cab1a", "title": "Cyber-Physical System for Energy Management"}]}
