{"paperId": "55d31409d30029c55992710cdb3c2caffde0218d", "publicationVenue": {"id": "baa9820d-e273-4dc5-8754-8817abd0e3dd", "name": "Online World Conference on Soft Computing in Industrial Applications", "type": "conference", "alternate_names": ["Winter Simul Conf", "World Conf Soft Comput Ind Appl", "Winter Simulation Conference", "World Conference on Soft Computing in Industrial Applications", "WSC", "Online World Conf Soft Comput Ind Appl"], "url": "http://www.wikicfp.com/cfp/program?id=3156", "alternate_urls": ["http://www.acm.org/sigsim/"]}, "title": "Using Deep Learning for Simulation of Real time Video Streaming Applications", "abstract": "The traditional approaches for simulation of video analytics applications suffer from the lack of real-data generated by employed machine learning techniques. Machine learning methods need huge data that causes network congestion and high latency in cloud-based networks. This paper proposes a novel method for performance measurement and simulation of video analytics applications to evaluate the solutions addressing the cloud congestion problem. The proposed simulation is achieved by building a model prototype called Video Analytic Data Reduction Model (VADRM) that divides video analytic jobs into smaller tasks with fewer processing requirements to run on edge networking. Real data generated from VADRM prototype is characterized and tested by curve fitting to find the distribution models for generating the larger number of artificial data for resource management simulation. Distribution models based on real data of CNN-based VADRM prototype are used to build a queueing model and comprehensive simulation of real-time video analytics applications.", "venue": "Online World Conference on Soft Computing in Industrial Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-11", "journal": {"name": "2022 Winter Simulation Conference (WSC)", "pages": "665-676"}, "authors": [{"authorId": "1804852", "name": "A. Abhari"}, {"authorId": "25104795", "name": "Dipak Pudasaini"}], "citations": []}
