{"paperId": "55dae0eebb43e2e4e9f67a1180809bebb51ad7c3", "publicationVenue": {"id": "05f4640f-1261-4186-8153-0cb50b1169b3", "name": "Journal of Chemical Theory and Computation", "type": "journal", "alternate_names": ["J Chem Theory Comput"], "issn": "1549-9618", "url": "http://pubs.acs.org/jctc", "alternate_urls": ["https://pubs.acs.org/journal/jctcce", "http://pubs.acs.org/journals/jctcce/index.html", "http://pubs.acs.org/journal/jctcce"]}, "title": "Correlation-Based Feature Selection to Identify Functional Dynamics in Proteins.", "abstract": "To interpret molecular dynamics simulations of biomolecular systems, systematic dimensionality reduction methods are commonly employed. Among others, this includes principal component analysis (PCA) and time-lagged independent component analysis (TICA), which aim to maximize the variance and the time scale of the first components, respectively. A crucial first step of such an analysis is the identification of suitable and relevant input coordinates (the so-called features), such as backbone dihedral angles and interresidue distances. As typically only a small subset of those coordinates is involved in a specific biomolecular process, it is important to discard the remaining uncorrelated motions or weakly correlated noise coordinates. This is because they may exhibit large amplitudes or long time scales and therefore will be erroneously considered important by PCA and TICA, respectively. To discriminate collective motions underlying functional dynamics from uncorrelated motions, the correlation matrix of the input coordinates is block-diagonalized by a clustering method. This strategy avoids possible bias due to presumed functional observables and conformational states or variation principles that maximize variance or time scales. Considering several linear and nonlinear correlation measures and various clustering algorithms, it is shown that the combination of linear correlation and the Leiden community detection algorithm yields excellent results for all considered model systems. These include the functional motion of T4 lysozyme to demonstrate the successful identification of collective motion, as well as the folding of the villin headpiece to highlight the physical interpretation of the correlated motions in terms of a functional mechanism.", "venue": "Journal of Chemical Theory and Computation", "year": 2022, "fieldsOfStudy": ["Biology", "Physics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-06", "journal": {"name": "Journal of chemical theory and computation"}, "authors": [{"authorId": "2064559275", "name": "Georg Diez"}, {"authorId": "32618609", "name": "Daniel Nagel"}, {"authorId": "2925419", "name": "G. Stock"}], "citations": [{"paperId": "6e6b7ff27cfd2baf49181ef5f4f782328b38f8f0", "title": "Tutorial on how to build non-Markovian dynamic models from molecular dynamics simulations for studying protein conformational changes."}, {"paperId": "ac9dc1167721c998569775849a9259824bc21453", "title": "Learning protein-ligand unbinding pathways via single-parameter community detection"}, {"paperId": "4fb8f013ece5416b90fdf0b4ee9f17355384582d", "title": "Development and validation of a multimodal model in predicting severe acute pancreatitis based on radiomics and deep learning."}, {"paperId": "887424ceeaae54c3a1e860c1e72f81f42c087bae", "title": "Feature selection techniques for machine learning: a survey of more than two decades of research"}, {"paperId": "6db34306fd106dee45a5f252e9f2fc8ed11c80f7", "title": "Unsupervised deep learning for molecular dynamics simulations: a novel analysis of protein–ligand interactions in SARS-CoV-2 Mpro"}, {"paperId": "94f6645dfa934b70d96eb2baa41c8d71649a81ba", "title": "Information-based Preprocessing of PLC Data for Automatic Behavior Modeling"}, {"paperId": "e5f5b09e637ac38b9d9ecb563a6a7579c40da252", "title": "Correlation, response and entropy approaches to allosteric behaviors: a critical comparison on the ubiquitin case"}, {"paperId": "390c937c44ffb10a9552d275fe8bf6d869b8a1cd", "title": "Enhanced Sampling with Machine Learning: A Review"}, {"paperId": "58dcd876f80e1d2556250cd466506451da3fddf5", "title": "Toward a Benchmark for Markov State Models: The Folding of HP35."}, {"paperId": "6bb226130c7f661b2ce2fa8aa1f24e14d8450258", "title": "MDiGest: A Python package for describing allostery from molecular dynamics simulations"}, {"paperId": "a12338e596e022f7f083d38b71602d450c6dfdce", "title": "msmhelper: A Python package for Markov state modeling of protein dynamics"}, {"paperId": "7e9c3b8aedd543af6d23a9092acf85583ff2ce24", "title": "Selecting Features for Markov Modeling: A Case Study on HP35."}, {"paperId": "786d1f43fd5c1636db4d36ab9915de279c68f212", "title": "Path separation of dissipation-corrected targeted molecular dynamics simulations of protein-ligand unbinding."}, {"paperId": "f25ea8028aa18bc7ed0b7c8ee3399fbc482d1590", "title": "The Importance of Charge Transfer and Solvent Screening in the Interactions of Backbones and Functional Groups in Amino Acid Residues and Nucleotides"}, {"paperId": "d2c95665bd352db695baa3f35d65d9843ee7a27a", "title": "Nonequilibrium Modeling of the Elementary Step in PDZ3 Allosteric Communication."}, {"paperId": "369ce162662b21c331a5eeb963d6bf4b29767c4e", "title": "Cooperative protein allosteric transition mediated by a fluctuating transmission network"}]}
