{"paperId": "55dc194b52e64fdcd4368553ef3cec485fd6d49e", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Sentiment Analysis and Topic Modeling Regarding Online Classes on the Reddit Platform: Educators versus Learners", "abstract": "The world is witnessing an unpredictable COVID-19 pandemic that has impacted all levels of online education, shaping future trends. However, this shift was so sudden and drastic that unrevealed puzzles exist regarding the public’s authentic opinion towards online classes, even though three years have passed. Many experts and policymakers have conducted qualitative and quantitative research to explore effective pedagogies, the satisfaction of different stakeholders, and factors influential on learners’ performance. However, scant studies have examined personal opinions and concerns toward online classes hidden behind people’s anonymous posts on social media. This research investigates the sentiments, concerns, and their variance with time regarding online classes by learners and educators on Reddit, which is a dominant social network among them. Data were collected via the official API from identified relevant subreddits and keyword search results across Reddit. Sentiment analysis was applied to reveal their emotions and their changes. Topic modeling was conducted to discover the concerns hidden in the posts. The results revealed the concerns about online classes, such as severe cheating behaviors, and showed doubts about previous strategies to solve disadvantages in online classes. In addition, the results verified the habitual difference and motivations of social media usage between educators and learners.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-02-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2205362427", "name": "Shanghao Li"}, {"authorId": "2205343957", "name": "Zerong Xie"}, {"authorId": "2058851364", "name": "Dickson K. W. Chiu"}, {"authorId": "143870355", "name": "Kevin K. W. Ho"}], "citations": [{"paperId": "1ae8f51e7a28ca60a95de82eb0aeea36ee40bcde", "title": "Social media analytics for academic music library: a case study of CUHK center for Chinese Music Studies"}, {"paperId": "c72762c74817dafdaa29694a161f246a35f0f6ae", "title": "Digital Transformation in Remote Learning and Work—An Externality of the COVID-19 Pandemic"}, {"paperId": "f3eb08481574d1d20d171571c4a2b6908c718315", "title": "Online teaching emotion analysis based on GRU and nonlinear transformer algorithm"}, {"paperId": "d7fcdb4f68aba6d6d5545e3798cf6856b1dfee78", "title": "Editorial: Special selection on advances in learning technologies"}, {"paperId": "6475cc4052e4778f6fb098ea9993018f545b6bf9", "title": "Measuring the Rise and Fall of a Subreddit using Text Analytics: The Life Course of r/Antiwork"}, {"paperId": "751d964640b18147e41b2e75f1d8c90df4c186dc", "title": "Editorial: Advances in information and knowledge management"}, {"paperId": "32f40dab86796307d0a53557afe9a7a97fdcd842", "title": "Knowledge-sharing attitude and behavior of civil servants: motivations behind rewards"}, {"paperId": "85d07fca9f58b188887e978af5dc90fe5ad9c0f7", "title": "Editorial: Special selections on contemporary social media and social network research"}, {"paperId": "499319b013c094e2d38e06b55566e1b920eb33a0", "title": "Youth marketing development of special libraries in the digital era: viewpoint from the Taste Library with 7Ps marketing mix"}, {"paperId": "4c68f865fd9d100d22fbd1895905a191f09664b5", "title": "School library reading support for students with dyslexia: a qualitative study in the digital age"}, {"paperId": "6b9cb2eb7be959dc8594664633a6e6739a4033a7", "title": "Impact of COVID-19 on reading behaviors and preferences: investigating high school students and parents with the 5E instructional model"}, {"paperId": "b77dbc3b7abd81c90399967798625348aac4dac8", "title": "The impact of COVID-19 on reading behaviors among high school students through the adoption of mobile learning"}, {"paperId": "c67fba66cd8e073cb4bca7a7c1c8390cd5d264ae", "title": "Editorial: Special selection on contemporary bibliometric analytics"}, {"paperId": "0596a6dd2bdf24809a897e5e101c15f694861a0f", "title": "Banning of ChatGPT from Educational Spaces: A Reddit Perspective"}]}
