{"paperId": "55de2ad793b4ccf542536f38730cc4a13cefe005", "publicationVenue": null, "title": "TrillionG: A Trillion-scale Synthetic Graph Generator using a Recursive Vector Model", "abstract": "As many applications encounter exponential growth in graph sizes, a fast and scalable graph generator has become more important than ever before due to lack of large-scale realistic graphs for evaluating the performance of graph processing methods. Although there have been proposed a number of methods to generate synthetic graphs, they are not very efficient in terms of space and time complexities, and so, cannot generate even trillion-scale graphs using a moderate size cluster of commodity machines. Here, we propose an efficient and scalable disk-based graph generator, TrillionG that can generate massive graphs in a short time only using a small amount of memory. It can generate a graph of a trillion edges following the RMAT or Kronecker models within two hours only using 10 PCs. We first generalize existing graph generation models to the scope-based generation model, where RMAT and Kronecker correspond to two extremes. Then, we propose a new graph generation model called the recursive vector model, which compromises two extremes, and so, solves the space and time complexity problems existing in RMAT and Kronecker. We also extend the recursive vector model so as to generate a semantically richer graph database. Through extensive experiments, we have demonstrated that TrillionG outperforms the state-of-the-art graph generators by up to orders of magnitude.", "venue": "SIGMOD Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-09", "journal": {"name": "Proceedings of the 2017 ACM International Conference on Management of Data"}, "authors": [{"authorId": "2021341", "name": "Himchan Park"}, {"authorId": "2116504190", "name": "Min-Soo Kim"}], "citations": [{"paperId": "d178c42b4b4f1aec8a2e3a229ddcc64581fce1ba", "title": "SoK: The Faults in our Graph Benchmarks"}, {"paperId": "a4930d487446f8fe30bd5769426a282306ac165b", "title": "Play like a Vertex: A Stackelberg Game Approach for Streaming Graph Partitioning"}, {"paperId": "aae7a3652d1d16c0958ab3c5eea250ba9eafc86a", "title": "INFINEL: An efficient GPU-based processing method for unpredictable large output graph queries"}, {"paperId": "4754eb1e8cb338cb0983ad45af605d6c50f02c8f", "title": "On Overcoming HPC Challenges of Trillion-Scale Real-World Graph Datasets"}, {"paperId": "1eb189a81ff6646784dc726c42db689c15ee759a", "title": "Structural Reconstruction of Signed Social Networks"}, {"paperId": "550358765945b48dec285e3559cd8919c5c32fdc", "title": "PyGraft: Configurable Generation of Synthetic Schemas and Knowledge Graphs at Your Fingertips"}, {"paperId": "1008d7b2e04af5dedf343bac72bdbc5b63773295", "title": "MS-BioGraphs: Sequence Similarity Graph Datasets"}, {"paperId": "66a4fddcff2e219dd2c98e92ce897a384cda09d6", "title": "Partitioner Selection with EASE to Optimize Distributed Graph Processing"}, {"paperId": "58165234e3b2bb072305d3b37237fb182abdba8c", "title": "Building Graphs at Scale via Sequence of Edges: Model and Generation Algorithms"}, {"paperId": "32f730bad80d35b0f8e3b72e5840fd8d26609db4", "title": "A Framework for Large Scale Synthetic Graph Dataset Generation"}, {"paperId": "305348db7a5b27a8dfcaf756053c194b6c9a99f0", "title": "Space-Efficient Random Walks on Streaming Graphs"}, {"paperId": "826008c4ac2875a16ef61ff8dd680389fb0b7b30", "title": "Regular Path Query Evaluation Sharing a Reduced Transitive Closure Based on Graph Reduction"}, {"paperId": "26d05e13fc313b4b3033dbdb1743365e30ebcfc3", "title": "SOOP: Efficient Distributed Graph Computation Supporting Second-Order Random Walks"}, {"paperId": "c3a2e3d4f2cca5b1e83d53a7949f3afeb05492ed", "title": "GenCAT: Generating Attributed Graphs with Controlled Relationships between Classes, Attributes, and Topology"}, {"paperId": "fb7ea1a6ba6c8a11379ac830dd5966f50b1ea890", "title": "TransGPerf: Exploiting Transfer Learning for Modeling Distributed Graph Computation Performance"}, {"paperId": "b0160ffbfeeb2b8593e1f31fb149acde5d24b6b6", "title": "iTurboGraph: Scaling and Automating Incremental Graph Analytics"}, {"paperId": "c0ad3d147cc61626ce08af519f98c0c527ce394b", "title": "FastSNG: The Fastest Social Network Dataset Generator"}, {"paperId": "d6537b299b7a32f8cca588714025df4feabeb6d4", "title": "FastSGG: Efficient Social Graph Generation Using a Degree Distribution Generation Model"}, {"paperId": "ad847e6792897a57a2d23ccfa57cd808ce992f23", "title": "Trillion-scale Graph Processing Simulation based on Top-Down Graph Upscaling"}, {"paperId": "7c8008bf230993440283b9331df54b4ba841e9d9", "title": "LineageBA: A Fast, Exact and Scalable Graph Generation for the Barabási-Albert Model"}, {"paperId": "5a0e65c2d4ccf3568fa1631a5300613611ee4fcc", "title": "MEDICI: A simple to use synthetic social network data generator"}, {"paperId": "a800e01366848276ac4e482a846e24e971384256", "title": "Moving Recursion Out of the RDBMS for Transactional Graph Workloads"}, {"paperId": "1b3cf861993aa67b37f095e08b827a6af43b21d1", "title": "R3MAT: A Rapid and Robust Graph Generator"}, {"paperId": "2d7b06197f64571360618e9fc0b7d127e9b6bdfc", "title": "HOSA: Fast Distributed Triangle Enumerating On Tera-Edge Graphs"}, {"paperId": "7b50ce97fa153c8ea2b321e4bbcc6cf1e494398a", "title": "Smooth Kronecker: Solving the Combing Problem in Kronecker Graphs"}, {"paperId": "d68d5fd09304f89b02ca83f558e53220c9fbac8d", "title": "Benchmarking Graph Data Management and Processing Systems: A Survey"}, {"paperId": "1fb44063f04946df668159466dab49af8c3396b3", "title": "Random Graph Modeling"}, {"paperId": "c8ca5ad5a3ac3bb510a3cf2a7e9c9d8b85f32cc2", "title": "A Collaborative Framework for Similarity Enforcement in Synthetic Scaling of Relational Datasets"}, {"paperId": "0aa4a497726291741fda41ad4f7be07dfd816a22", "title": "EvoGraph: An Effective and Efficient Graph Upscaling Method for Preserving Graph Properties"}, {"paperId": "07b4b77687bed02c09453f8d3d6fd29456572006", "title": "Generating Evolving Property Graphs with Attribute-Aware Preferential Attachment"}, {"paperId": "d35a007a55883b9657441e630b5a2eb50573ff10", "title": "Graphtides: a framework for evaluating stream-based graph processing platforms"}, {"paperId": "56241bcabdcc8094ec7f6cc5a919fafd98e2c900", "title": "TurboGraph++: A Scalable and Fast Graph Analytics System"}, {"paperId": "0a93d6403f31bd137687af7472c2ef199cf1ce75", "title": "MomentSA: A Fast and Accurate Method for Stochastic Kronecker Graph Parameter Computing"}, {"paperId": "8a168e764f1fc2cf1a0b71714c4457fa750a9cab", "title": "Efficient Graph Computation for Node2Vec"}, {"paperId": "4fb02adfe6410086e415661a2a3364cb54379106", "title": "A tool framework for tweaking features in synthetic datasets"}, {"paperId": "c1082d802cc448d36946762d230979d23b7a36e5", "title": "MapReduce for Graphs Processing: New Big Data Algorithm for 2-Edge Connected Components and Future Ideas"}, {"paperId": "ad23fd811e6175201e1dff91390a4e176094d45a", "title": "A Large Scale Synthetic Graph Dataset Generation Framework"}, {"paperId": "0aef01833ee5ddb9e6301e219fc8e11606e0c030", "title": "A Schema-Driven Synthetic Knowledge Graph Generation Approach With Extended Graph Differential Dependencies (GDDxs)"}, {"paperId": "777f6d2d9b9c62dd9937b10f1cc5373300a51d7f", "title": "Random Generation of a Locally Consistent Spatio-Temporal Graph"}, {"paperId": "c8b76aff83518ae64f9b514dd0ab8f3e6942b213", "title": "Power-Law Distributed Graph Generation With MapReduce"}, {"paperId": "bc53f410eea566435adba7683e0579188591632e", "title": "BalanSiNG: Fast and Scalable Generation of Realistic Signed Networks"}]}
