{"paperId": "55e778d231634d0e4a6ac2830a45355dbe68e36b", "publicationVenue": {"id": "5daf2ed1-4d60-4098-865d-528545a79597", "name": "International Conference on Electronics, Control, Optimization and Computer Science", "type": "conference", "alternate_names": ["ICECOCS", "International Conference Electronics, Control, Optimization and Computer Science", "Int Conf Electron Control Optim Comput Sci", "ICECOCS’ (IEEE Record No. #)"]}, "title": "Sensitivity analysis of latency to data size in Spark environment", "abstract": "The explosion of quantity of data coming from the Internet of Things (IoT) and the generation of big data in social networks and E-commerce websites, becomes a difficult task for researchers because of the 5 V characterizing this type of data (volume, variety, variability, veracity and velocity). Many platforms have been proposed to deal with big data in the WSN domain. This article focuses on studying the performance of the Big data environment platform, namely Spark. We start by describing the Big Data ecosystem, then we will attack the components of the Spark platform, namely the Hadoop Distributed file system for storage, and MapReduce with YARN (Yet Another Resource Negotiator) for parallel processing, thus, we will describe the collection of libraries that uses resilient distributed data to overcome computational complexity. The last part of this article is devoted to an experiment which we will apply a MapReduce job which will calculate the number of replication of a word in files of different sizes with the Spark environment and we will analyze the results in speed of execution of complex calculations (in our case browsing a file of more than 6 million lines) by job MapReduce, we obtained results which favor the veracity of big data according to the size of data received by the cluster.", "venue": "International Conference on Electronics, Control, Optimization and Computer Science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-02", "journal": {"name": "2020 IEEE 2nd International Conference on Electronics, Control, Optimization and Computer Science (ICECOCS)", "pages": "1-5"}, "authors": [{"authorId": "2064068038", "name": "Abdelaziz E. L. Yazidi"}, {"authorId": "2767904", "name": "M. L. Hasnaoui"}, {"authorId": "153821636", "name": "Mohamed Saad Azizi"}], "citations": [{"paperId": "b1fd96823bb3350cac96bcca92a9ad946da3a104", "title": "Impact of Input Data on Intelligence Partitioning Decisions for IoT Smart Camera Nodes"}]}
