{"paperId": "55f154c0192e2e1e7aaa9af0f69ea001e595ab44", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Development of a Passenger Assistance System to Increase the Attractiveness of Local Public Transport", "abstract": "In this paper, we present a concept for an assistance system for public transport passengers currently being developed for Kassel, Germany, and its surrounding area. The assistance system aims at increasing the attractiveness of local public transport by reducing barriers to use, thus promoting sustainable travel behavior. Three main barriers were identified: crowded vehicles, missed connections, and inconveniences in the transportation of shopping bags and luggage. To tackle these issues, three assistance system services were conceptualized: the occupancy rate informing passengers about the occupancy level of vehicles, the transfer connection monitor and secure system giving passengers the option to communicate transfer connection requests, and the delivery service allowing the use of public transport while shopping without the need to transport purchased goods. The three services are presented in detail along with the user interfaces they will be integrated into. Moreover, for the further implementation of the assistance system, a user requirement analysis is outlined. We finally give an overview and outlook regarding the implementation and evaluation of the concept in laboratory studies and a one-year field study.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-03-31", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "39874840", "name": "Anja K. Faulhaber"}, {"authorId": "2086468826", "name": "Jens Hegenberg"}, {"authorId": "2161082925", "name": "Sophie Elise Kahnt"}, {"authorId": "123597549", "name": "F. Lambrecht"}, {"authorId": "2161085798", "name": "Daniel Leonhäuser"}, {"authorId": "2161089141", "name": "Stefan Saake"}, {"authorId": "83855369", "name": "F. Wehr"}, {"authorId": "152772926", "name": "Ludger Schmidt"}, {"authorId": "2059204142", "name": "C. Sommer"}], "citations": []}
