{"paperId": "5605b70e171f258f29acba4d16530f5d0a0bd63d", "publicationVenue": null, "title": "A biology-informed similarity metric for simulated patches of human cell membrane", "abstract": "Complex scientific inquiries rely increasingly upon large and autonomous multiscale simulation campaigns, which fundamentally require similarity metrics to quantify ‘sufficient’ changes among data and/or configurations. However, subject matter experts are often unable to articulate similarity precisely or in terms of well-formulated definitions, especially when new hypotheses are to be explored, making it challenging to design a meaningful metric. Furthermore, the key to practical usefulness of such metrics to enable autonomous simulations lies in in situ inference, which requires generalization to possibly substantial distributional shifts in unseen, future data. Here, we address these challenges in a cancer biology application and develop a meaningful similarity metric for ‘patches’—regions of simulated human cell membrane that express interactions between certain proteins of interest and relevant lipids. In the absence of well-defined conditions for similarity, we leverage several biology-informed notions about data and the underlying simulations to impose inductive biases on our metric learning framework, resulting in a suitable similarity metric that also generalizes well to significant distributional shifts encountered during the deployment. We combine these intuitions to organize the learned embedding space in a multiscale manner, which makes the metric robust to incomplete and even contradictory intuitions. Our approach delivers a metric that not only performs well on the conditions used for its development and other relevant criteria, but also learns key spatiotemporal relationships without ever being exposed to any such information during training.", "venue": "Machine Learning: Science and Technology", "year": 2022, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-28", "journal": {"name": "Machine Learning: Science and Technology", "volume": "3"}, "authors": [{"authorId": "144992420", "name": "H. Bhatia"}, {"authorId": "2064767378", "name": "J. Thiagarajan"}, {"authorId": "2860488", "name": "Rushil Anirudh"}, {"authorId": "2179610964", "name": "Jayram Ts"}, {"authorId": "47303274", "name": "T. Oppelstrup"}, {"authorId": "2289129", "name": "Helgi I. Ingólfsson"}, {"authorId": "2682100", "name": "F. Lightstone"}, {"authorId": "145466013", "name": "P. Bremer"}], "citations": [{"paperId": "5b1b355d3b6c484c23b8e8748f5f4307a1544114", "title": "Membrane lipids drive formation of KRAS4b-RAF1 RBDCRD nanoclusters on the membrane"}, {"paperId": "a07ca1acd8e779417d5ceff3a40f098b734db9b6", "title": "Machine Learning-Driven Multiscale Modeling: Bridging the Scales with a Next-Generation Simulation Infrastructure"}, {"paperId": "522df16f12bde5b06e6568b74a23efe4f29773e9", "title": "The confluence of machine learning and multiscale simulations."}]}
