{"paperId": "56050cdc516b8369aa3cdc97572396e465e4b791", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "On the Hardness of Massively Parallel Computation", "abstract": "We investigate whether there are inherent limits of parallelization in the (randomized) massively parallel computation (MPC) model by comparing it with the (sequential) RAM model. As our main result, we show the existence of hard functions that are essentially not parallelizable in the MPC model. Based on the widely-used random oracle methodology in cryptography with a cryptographic hash function h:{0,1}n → {0,1}n computable in time th, we show that there exists a function that can be computed in time O(T · th) and space S by a RAM algorithm, but any MPC algorithm with local memory size s < S/c for some c>1 requires at least ~Ω(T) rounds to compute the function, even in the average case, for a wide range of parameters n ≤ S ≤ T ≤ 2n1/4. Our result is almost optimal in the sense that by taking T to be much larger than th,e.g., T to be sub-exponential in th, to compute the function, the round complexity of any MPC algorithm with small local memory size is asymptotically the same (up to a polylogarithmic factor) as the time complexity of the RAM algorithm. Our result is obtained by adapting the so-called compression argument from the data structure lower bounds and cryptography literature to the context of massively parallel computation.", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2020, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-07-06", "journal": {"name": "Proceedings of the 32nd ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "40357578", "name": "Kai-Min Chung"}, {"authorId": "47702038", "name": "Kuan-Yi Ho"}, {"authorId": "1743608", "name": "Xiaorui Sun"}], "citations": [{"paperId": "a8b26718d629024b1823b36a3b4881b8c4a6dc26", "title": "Equivalence classes and conditional hardness in massively parallel computations"}]}
