{"paperId": "560c2c7ce74ff99db4b2e1b2ea2d20fb8257c5c1", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Blockchain’s Scope and Purpose in Carbon Markets: A Systematic Literature Review", "abstract": "Carbon markets, particularly emission trading schemes (ETS) and carbon offset projects, are significant mechanisms in climate change mitigation. However, there are still a number of unresolved issues regarding their attractiveness and efficient functioning. Blockchain, as the core of “3D’s concept” (including decentralization, decarbonization and digitalization), could be considered as a candidate solution for carbon markets’ improvement. A systematic literature review was conducted to identify the role of blockchain in ETS and carbon offset projects, its key features, implementation challenges and proposed applications, by analyzing and discussing the content of relevant studies, and grouping the results into domains. This study’s findings show that blockchain has great potential to be adopted in carbon markets. However, there is no data on blockchain use cases in energy efficiency, chemical processes and industrial manufacturing, waste disposal, and agriculture. Blockchain-based household and transportation carbon offset projects are linked to renewables through energy trading. Renewables and forestry are the most appropriate domains for blockchain adoption, considering various criteria of quality for carbon offset projects. Blockchain is currently immature in carbon markets because of its own drawbacks and challenges. This study also highlights research gaps and offers research directions to inspire researchers for conducting related investigations.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-23", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2219068540", "name": "Arsenii Vilkov"}, {"authorId": "47698104", "name": "G. Tian"}], "citations": [{"paperId": "3c2f83c8c84570e684e576c16a68c214dd7faaa1", "title": "Efficiency Evaluation of Forest Carbon Sinks: A Case Study of Russia"}, {"paperId": "7b7b3fe6eeb2fe799962947482a98e2e58f0aa1e", "title": "Microalgae-based technologies for carbon neutralization and pollutant remediation: A comprehensive and systematic review"}, {"paperId": "69cc78f599edb2c5bc5a3198ded8b55834531ad2", "title": "Potential of blockchain technology in wood supply chains"}, {"paperId": "18963074a6350427a1dce9385f454e6bf4777504", "title": "Smart Endoscopy Is Greener Endoscopy: Leveraging Artificial Intelligence and Blockchain Technologies to Drive Sustainability in Digestive Health Care"}, {"paperId": "9330114a0f494d0588b2d752e73625be6a6c6de8", "title": "Web 3.0 and Sustainability Challenges and Research Opportunities"}]}
