{"paperId": "56185aae0d55289a3e229c2dae44f8745a03ddab", "publicationVenue": null, "title": "Exploiting Anti-Monotonic Constraints in Mining Palindromic Motifs from Big Genomic Data", "abstract": "The advent of high-throughput technologies such as Illumina HiSeq X, mass spectrometry, and microarray heralds a new era of big biological datasets in computational biology. This digital revolution in bioinformatics has generated unprecedented volumes of omics data (e.g., transcriptomes, genomes, proteomes, metabolomes) with various degrees of veracities and values. These deluge of omics data are awash with a wealth of information in the form of frequently repeated contiguous patterns—namely, sequence motifs. Sequence motifs are short repeated contiguous subsequences located in the promoter region of a genome sequence. On some occasions, users are interested in mining only a particular type of sequence motifs (e.g., palindromic motifs). In genomics, palindromes are sequences from the nucleotide bases from deoxyribonucleic acid (DNA) or ribonucleic acid (RNA) strands that are symmetrical in the sense that they read exactly the same as their complementary sequences in the reverse direction. The use of classical constraints (e.g., anti-monotonic, succinct, and/or convertible constraints) allows users to specify their interest in the universal search space, and thus enhancing distinct and effective pruning of the search space— leading to a reduction in the computational time required for the mining process. Despite several attempts made by existing algorithms for mining palindromic motifs from DNA sequences, a major drawback stems from the high volumes of the DNA sequences leading to high complexities and turnaround time of the algorithms. To this end, we propose a parallel scalable sequential mining algorithm that exploits some features of anti-monotonic constraints—using the in-memory computing model of the Apache Spark framework deployed on a cluster of a homogeneous distributed-memory system—for mining palindromic motifs from high volumes of DNA sequences. To evaluate our algorithm, we obtained the human genome (Homo sapiens) assemblies GRCh37 patch 13 (hg19), which is of size 3.2 GB from the Ensembl data repository. It contains 104,763 protein-coding sequences and 24,513 non-coding sequences. Evaluation results show that our algorithm extracts accurate palindromic motifs using a short turnaround time.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "4864-4873"}, "authors": [{"authorId": "8766696", "name": "O. Sarumi"}, {"authorId": "1726081", "name": "C. Leung"}], "citations": [{"paperId": "aeec6624a06369ab612318956077b574c7ed8b7c", "title": "NeuralBeds: Neural embeddings for efficient DNA data compression and optimized similarity search"}, {"paperId": "6ecb7a2a23802868fe6158ef569507fc9379d3b7", "title": "A Privacy-Preserving Semi-Decentralized Personalized Recommendation System"}, {"paperId": "f6e0f9877a4727b28b0f87b6191795ae0cd05128", "title": "Preserving Privacy Integration and Mining for Big Temporal Co-occurrence Patterns"}, {"paperId": "d2b096acef8b783147a2b34c251d5cb24c8705e9", "title": "Health Informatics on Big COVID-19 Pandemic Data via N-Shot Learning"}, {"paperId": "9f92a67dea00771011c572662ac7531470bc942c", "title": "Privacy-Preserving Publishing and Visualization of Spatial-Temporal Information"}, {"paperId": "71b05f36fcd400ce91c885f40ecf8654c711b459", "title": "Open Data Lake to Support Machine Learning on Arctic Big Data"}, {"paperId": "9a2460b247dda0b0e160ab4664b073919864a66e", "title": "Predictive analytics for economic crisis triggered depression risk level identification among some adults in Nigeria"}, {"paperId": "38545e5ff642e6028550eb5e151de94eb2212427", "title": "Predictive Analytics to Support Health Informatics on COVID-19 Data"}, {"paperId": "aa8a61d9976db75776ebdfb2d2360ebeeb4da54c", "title": "Predictive Analytics of COVID-19 with Neural Networks"}, {"paperId": "896c0c5bea20586ac5fc0e6d369c9902c751b79b", "title": "Human health big data evaluation based on FPGA processor and big data decision algorithm"}, {"paperId": "68e3ba074d6c381142ceea3c39ca1c3294dc4738", "title": "Predictive Analytics on Genomic Data with High-Performance Computing"}, {"paperId": "819e54a97e01fcd7242076dfc3fca72c6993b5b6", "title": "Preserving Privacy of Temporal Big Data"}, {"paperId": "b1199e4d68e9fe503e5a5b97c29e2eac46de5e57", "title": "Machine Learning and OLAP on Big COVID-19 Data"}, {"paperId": "d5d07d27edd87031a17b750db3248893a43cd41f", "title": "Compression for Very Sparse Big Social Data"}, {"paperId": "2b44ef7b8df325ec524513c3bc124d5b6a2ec721", "title": "Prediction of Food Preparation Time for Smart City"}, {"paperId": "13d3c3ac588b7ef7457907c23d46e0ecfdf5c6b1", "title": "Temporal Data Analytics on COVID-19 Data with Ubiquitous Computing"}, {"paperId": "5fec0c4df897eb6bae41618fc4badca2e79e6316", "title": "Explainable Machine Learning and Mining of Influential Patterns from Sparse Web"}, {"paperId": "3b33394b696b8854625ab6519121cec14629cf7b", "title": "Memory Management Approaches in Apache Spark: A Review"}, {"paperId": "32dc9ca67a449c82b0516dbfef5c02466a58f117", "title": "Big data, analytics and artificial intelligence for sustainability"}, {"paperId": "ac8fbc56463ee791abb138e3692e5d572b55b856", "title": "An Innovative Fuzzy Logic-Based Machine Learning Algorithm for Supporting Predictive Analytics on Big Transportation Data"}, {"paperId": "d9b0cc11c4943f95a9acc4db2777507db959440a", "title": "Supporting Privacy-Preserving Big Data Analytics on Temporal Open Big Data"}, {"paperId": "59a17139ae33fc33bf8715b54b31951e0bfbd825", "title": "Adaptive Machine Learning Algorithm and Analytics of Big Genomic Data for Gene Prediction"}, {"paperId": "60095934eccb1699d504a7413d8005eebc507883", "title": "Potential of Deep Learning Algorithms in Mitigating the Spread of COVID-19"}, {"paperId": "34ed3d8287cfbe1023666da451ee0f49e76507f0", "title": "Cognitive Computing – ICCC 2020: 4th International Conference, Held as Part of the Services Conference Federation, SCF 2020, Honolulu, HI, USA, September 18-20, 2020, Proceedings"}, {"paperId": "e7f7e5f9a31c301b42431b776902e95a9b76d5e7", "title": "Big Data Computing and Mining in a Smart World"}, {"paperId": "25ee35d3093b1788f5c8ac49091b5d55f4a24072", "title": "Cognitive and Predictive Analytics on Big Open Data"}]}
