{"paperId": "561cb2df16d1c3e0899e411ab60fecf82a9c36f4", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Privacy, Surveillance, and Power in the Gig Economy", "abstract": "This paper addresses calls for more research on privacy in the gig economy across a range of work platforms. To understand privacy risks, behaviors, and consequences from the perspective of workers, we analyzed workers’ posts about privacy and surveillance from 12 Reddit forums representing four main types of work (crowdwork, freelancing, ridesharing, and delivery). We found that workers perceive both platform companies and customers as sources of unnecessary and opaque data collection and surveillance that can threaten their privacy, safety, and economic outcomes. Workers also engage in many risk mitigation strategies, including self-protective surveillance behaviors such as video recording themselves and customers, as a costly but necessary response to power imbalances created by surveillance. Based on our multi-platform analysis, we present a guiding set of questions that workers, designers, and researchers can use to assess the privacy implications of current and future gig work platforms.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-29", "journal": {"name": "Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "10763415", "name": "Shruti Sannon"}, {"authorId": "2153220180", "name": "Billie Sun"}, {"authorId": "3314625", "name": "D. Cosley"}], "citations": [{"paperId": "8065b63d8bf98c7def6279c501861fd899d62e8a", "title": "\"At the end of the day, I am accountable\": Gig Workers' Self-Tracking for Multi-Dimensional Accountability Management"}, {"paperId": "2c5a0c58a6242a9ea35bc431c92ee5dc8c076881", "title": "Designing Sousveillance Tools for Gig Workers"}, {"paperId": "2a704947249b32f27b94e089616ec93633937a88", "title": "The Impact of the Gig Economy on the Labor Market in Turkey: The Case of Isin Olsun"}, {"paperId": "1d3de44f28fe4231dc9748363bc6a88bf9af43fe", "title": "Uncovering Gig Worker-Centered Design Opportunities in Food Delivery Work"}, {"paperId": "5c2740247da19e70bc954c6424d1ab0ac74a54f7", "title": "Rethinking People Analytics With Inverse Transparency by Design"}, {"paperId": "7eeb08afc28dbfd8699780b7a05590167429882f", "title": "“Any bit of help, helps”: Understanding how older caregivers use carework platforms for caregiving support"}, {"paperId": "d85348d3732d10b6e77692ebea4a890a1332a9cf", "title": "Understanding Platform Mediated Work-Life: A Diary Study with Gig Economy Freelancers"}, {"paperId": "ee101f9887283a8c96afcf327ae3ec1b08b4b212", "title": "What You Show is What You Get! Gestures for Microtask Crowdsourcing"}, {"paperId": "b7b0b50534877859114f6ce1811c69b43df9b043", "title": "Co-Designing Alternatives for the Future of Gig Worker Well-Being: Navigating Multi-Stakeholder Incentives and Preferences"}, {"paperId": "cede07bdca407abed359a2576277da4e71c0eab6", "title": "Inequality and discrimination in the online labor market: A scoping review"}, {"paperId": "eadf74a3ebb291f433b05459c3161ac93850702f", "title": "New futures of work or continued marginalization? The rise of online freelance work and digital platforms"}, {"paperId": "7f834d8e5943eb28d97abd676f05daf49a48cdb7", "title": "Design Opportunities for Freelancing Platforms: Online Freelancers’ Views on a Worker-Centred Design Fiction"}, {"paperId": "6d3cc4d669c89ffffd03c8abe679b7ac9621e944", "title": "Covert Resistance against Algorithmic control on Online Labor Platforms - a Systematic literature Review"}]}
