{"paperId": "561dd6fc4bfd8cb37829947dd92ac694d321959a", "publicationVenue": null, "title": "Learning-based Online Query Evaluation for Big Data Analytics in Mobile Edge Clouds", "abstract": "The rise of big data brings extraordinary benefits and opportunities to businesses and governments. Enterprise users can analyze their consumers’ data and infer the business value obtained, such as purchasing goods correlations, customer preferences, and hidden patterns. Meanwhile, with the emerge of big data processing frameworks, such as Hadoop and Tensor-flow, more and more mobile users are embracing big data analytics by issuing queries to analyze their data. In this paper, we investigate the problem of Quality-of-Service (QoS) aware query evaluation for big data analytics in a mobile edge cloud to maximize the system throughput while minimizing the query evaluation time of each admitted query, by exploring the materialization of intermediate query results. We consider dynamic big-data query evaluations where user queries arrive one by one without the knowledge of future arrivals, and the system needs to respond to each query by accepting or rejecting the query immediately. We propose an online algorithm for query admissions within a finite time horizon, the proposed algorithm can intelligently determine whether some immediate results during a query evaluation need to be materialized for later use of other queries, by making use of the Reinforcement Learning (RL) method with predictions. We finally investigate the performance of the proposed algorithm by simulations, and results show that the performance of the proposed algorithm is promising, by achieving a higher system throughput while reducing the average evaluation cost per query by from 20% to 52% compared to the comparison benchmarks.", "venue": "ICC 2020 - 2020 IEEE International Conference on Communications (ICC)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-06-01", "journal": {"name": "ICC 2020 - 2020 IEEE International Conference on Communications (ICC)", "pages": "1-7"}, "authors": [{"authorId": "2806902", "name": "Qiufen Xia"}, {"authorId": "143622634", "name": "Luyao Bai"}, {"authorId": "2956815", "name": "Zichuan Xu"}, {"authorId": "145884252", "name": "W. Liang"}, {"authorId": "1751264", "name": "O. Rana"}, {"authorId": "1712374", "name": "Guowei Wu"}], "citations": [{"paperId": "a56bc99651d52402d09f25da7c81e81a5fcffb60", "title": "Enabling Age-Aware Big Data Analytics in Serverless Edge Clouds"}]}
