{"paperId": "5626adfc8102fe684c2d38ea73a32ba0b5e29e5f", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "SciDP: Support HPC and Big Data Applications via Integrated Scientific Data Processing", "abstract": "Modern High Performance Computing (HPC) applications, such as Earth science simulations, produce large amounts of data due to the surging of computing power, while big data applications have become more compute-intensive due to increasingly sophisticated analysis algorithms. The needs of both HPC and big data technologies for advanced HPC and big data applications create a demand for integrated system support. In this study, we introduce Scientific Data Processing (SciDP) to support both HPC and big data applications via integrated scientific data processing. SciDP can directly process scientific data stored on a Parallel File System (PFS), which is typically deployed in an HPC environment, in a big data programming environment running atop Hadoop Distributed File System (HDFS). SciDP seamlessly integrates PFS, HDFS, and the widely-used R data analysis system to support highly efficient processing of scientific data. It utilizes the merits of both PFS and HDFS for fast data transfer, overlaps computing with data accessing, and integrates R into the data transfer process. Experimental results show that SciDP accelerates analysis and visualization of a production NASA Center for Climate Simulation (NCCS) climate and weather application by 6x to 8x when compared to existing solutions.", "venue": "IEEE International Conference on Cluster Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "114-123"}, "authors": [{"authorId": "40444105", "name": "Kun Feng"}, {"authorId": "1746991", "name": "Xian-He Sun"}, {"authorId": "2115309158", "name": "Xi Yang"}, {"authorId": "145012878", "name": "Shujia Zhou"}], "citations": [{"paperId": "cfc973d2ad950c4b2d5fa6a40c3e1a01b222f5a2", "title": "Development of NCL equivalent serial and parallel python routines for meteorological data analysis"}, {"paperId": "19fb5fcfbd3f2bce5bb254c71518fffd30ea552f", "title": "Design and Implementation of the Tianhe-2 Data Storage and Management System"}, {"paperId": "2a9c8ab039693f4831b6f242aa207f131a7f11cd", "title": "NIOBE: An Intelligent I/O Bridging Engine for Complex and Distributed Workflows"}, {"paperId": "deb5226c33203beed337ffb112bf4d986405e5bf", "title": "High Performance Computing for Geospatial Applications"}, {"paperId": "ff360a256a19789da64fc4156c8192bdcf5c0073", "title": "Domain Application of High Performance Computing in Earth Science: An Example of Dust Storm Modeling and Visualization"}]}
