{"paperId": "562d7183ed49c6ed813926930d21ecf2813a07fb", "publicationVenue": {"id": "49bb481c-95dc-4e09-a921-95f6c7f78ab8", "name": "Conference of the Open Innovations Association", "type": "conference", "alternate_names": ["FRUCT", "Conf Open Innov Assoc"], "url": "http://fruct.org/"}, "title": "Comparison Platform Design for Neural Network Models Evaluation in Driver Monitoring Systems", "abstract": "Neural networks have become more and more popular in the last years. They are used for different classification tasks. There are a lot of different models that can be generated which will have similar functionality but different accuracy and execution time. Herewith model evaluation is one of the main parts of the model development process to find the best model that meets the requirements for a particular project or task. Neural network evaluation main methods represented by the hold-out approach that is aimed at dividing the data-set to training, validation, and testing as well as cross-validation. More further, special platforms that are provided by different companies (like Google, Microsoft, Neptune, etc.) aimed to facilitate the model evaluation for inferencing in different environments. In the paper, we proposed a new platform designed to evaluate the neural network models developed for object detection and human behavior monitoring. We evaluated the platform for the task of driver monitoring in the vehicle cabin. The proposed platform allows to identify several cases and show the accuracy for each of the cases in the considered area. We propose the classification of such cases that allows us to compare the different models accurately.", "venue": "Conference of the Open Innovations Association", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-01-27", "journal": {"name": "2021 28th Conference of Open Innovations Association (FRUCT)", "pages": "151-157"}, "authors": [{"authorId": "46732324", "name": "A. Kashevnik"}, {"authorId": "40689542", "name": "Ammar H. Ali"}], "citations": []}
