{"paperId": "56394be3714bc1563f122749af742d2c4af2e865", "publicationVenue": null, "title": "Retail Indicators Forecasting and Planning", "abstract": "We present a methodology to handle the problem of planning sales goals. The methodology supports the retail manager to carry out simulations to find the most plausible goals for the future. One of the novel aspects of this methodology is that the analysis is based not on current sales levels, as most previous works do, but on those in the future, making a more precise and accurate analysis of the situation. The work presents the solution for a scenario using three sales performance indicators: foot traffic, conversion rate and ticket mean value for sales, but it explains how it can be generalized to more indicators. The contribution of this work is in the first place a framework, which consists of a methodology for performing sales planning, then, an algorithm, which finds the best prediction model for a particular store, and finally, a tool, which helps sales planners to set realistic sales goals based on the predicted sales.  First we present the method to choose the best indicator prediction model for each retail store and then we present a tool which allows the retail manager estimate the improvements on the indicators in order to attain a desired sales goal level; the managers may then perform several simulations for various scenarios in a fast and efficient way. The developed tool implementing this methodology was validated by experts in the subject of administration of retail stores yielding good results.", "venue": "Journal of universal computer science (Online)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-28", "journal": {"name": "J. Univers. Comput. Sci.", "pages": "1385-1403", "volume": "29"}, "authors": [{"authorId": "3144490", "name": "N. Baloian"}, {"authorId": "3189103", "name": "Jonathan Frez"}, {"authorId": "2142481750", "name": "José A. Pino"}, {"authorId": "2054633269", "name": "Cristóbal Fuenzalida"}, {"authorId": "3451789", "name": "Sergio Peñafiel"}, {"authorId": "1581644256", "name": "Belisario Panay"}, {"authorId": "145305629", "name": "G. Zurita"}, {"authorId": "2268711118", "name": "Horacio Sanson"}], "citations": []}
