{"paperId": "564644ef370f228b26e23775cc432425e5fd4451", "publicationVenue": null, "title": "Train++: An Incremental ML Model Training Algorithm to Create Self-Learning IoT Devices", "abstract": "The majority of Internet of Things (IoT) devices are tiny embedded systems with a micro-controller unit (MCU) as its brain. The memory footprint (SRAM, Flash, and EEPROM) of such MCU-based devices is often very limited, restricting onboard Machine Learning (ML) model training for large trainsets with high feature dimensions. To cope with memory issues, the current edge analytics approaches train high-quality ML models on the cloud GPUs (uses large volume historical data), then deploy the deep optimized version of the resultant models on edge devices for inference. Such approaches are inefficient in concept drift situations where the data generated at the device level vary frequently, and trained models are clueless on how to behave if previously unseen data arrives. In this paper, we present Train++, an incremental training algorithm that trains ML models locally at the device level (e.g., on MCUs and small CPUs) using the full n-samples of high-dimensional data. Train++ transforms even the most resource-constrained MCU-based IoT edge devices into intelligent devices that can locally build their own knowledge base on-the-fly using the live data, thus creating smart self-learning and autonomous problem-solving devices. Train++ algorithm is extensively evaluated on 5 popular MCU-boards, using 7 datasets of varying sizes and feature dimensions. A few exciting findings when analyzing the evaluation results are: (i) The proposed method reduces the onboard binary classifier training time by ≈ 10 - 226 sec across various commodity MCUs; (ii) Train++ can infer on MCUs for the entire test set in real-time of 1 ms; (iii) The accuracy improved by 5.15 - 7.3% since the incremental characteristic of Train++ enabled the loading of full n-samples of the high-dimensional datasets even on MCUs with only a few hundred kBs of memory.", "venue": "2021 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/IOP/SCI)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "2021 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/IOP/SCI)", "pages": "97-106"}, "authors": [{"authorId": "1654168291", "name": "B. Sudharsan"}, {"authorId": "9220510", "name": "Piyush Yadav"}, {"authorId": "1707342", "name": "J. Breslin"}, {"authorId": "2111289834", "name": "M. Ali"}], "citations": [{"paperId": "d6947f2579b4072bde34c64b2b131b0516613a27", "title": "A Survey of Incremental Deep Learning for Defect Detection in Manufacturing"}, {"paperId": "389ecabdfa5ea2b97f62af9562b8d66d61c18554", "title": "A multi-microcontroller-based hardware for deploying Tiny machine learning model"}, {"paperId": "8e5c3d76a9d160e87765727f5c817aea151ed900", "title": "A Machine Learning-Oriented Survey on Tiny Machine Learning"}, {"paperId": "54c53cac1339c92c3a1e081ad4a13114b5e230eb", "title": "On-Sensor Online Learning and Classification Under 8 KB Memory"}, {"paperId": "1910618ddcf48b86360dc72fadf389583577feb3", "title": "TyBox: an automatic design and code-generation toolbox for TinyML incremental on-device learning"}, {"paperId": "983b60f726cd4c132f1982abb035e7ca4347fe26", "title": "Reduced Precision Floating-Point Optimization for Deep Neural Network On-Device Learning on MicroControllers"}, {"paperId": "40a9ba6ccfb27cabc7bcfc8e6439fd6a28f232a7", "title": "Performance Analysis of Machine Learning Algorithm on GD32 Microcontrollers"}, {"paperId": "000eb24933802466961f9b34fbe9cdbc2978a204", "title": "Self-* Capabilities of Cloud-Edge Nodes: A Research Review"}, {"paperId": "9600450c059b4b37a100b27887a5048e2de484b8", "title": "An Adaptable and Unsupervised TinyML Anomaly Detection System for Extreme Industrial Environments"}, {"paperId": "0a9a76e19c470e7bea3257fe3f9c47574944bfad", "title": "A knowledge-driven monarch butterfly optimization algorithm with self-learning mechanism"}, {"paperId": "0474de050c552c8aa0fadd0c8583a95de4991cb6", "title": "Incremental Online Learning Algorithms Comparison for Gesture and Visual Smart Sensors"}, {"paperId": "c2c6bb5c70488897afb0a96dfabe39a607605210", "title": "On-Device Training Under 256KB Memory"}, {"paperId": "0c8a4edb0035e3ef942645b3f9879b6d883343aa", "title": "Machine Learning for Microcontroller-Class Hardware: A Review"}, {"paperId": "019b48516a2015d987f26ffa8599d17781d2c86d", "title": "ElastiQuant: elastic quantization strategy for communication efficient distributed machine learning in IoT"}, {"paperId": "558fab3d6c877567382c12ec5b5f650fd19fa79e", "title": "Intelligence at the Extreme Edge: A Survey on Reformable TinyML"}, {"paperId": "4a7ba0713fb9fea4e1d3e10024d5b24c03cb585d", "title": "Imbal-OL: Online Machine Learning from Imbalanced Data Streams in Real-world IoT"}, {"paperId": "23a94e971c141e2b5fb339afc498bd838cac4279", "title": "ElastiCL: Elastic Quantization for Communication Efficient Collaborative Learning in IoT"}, {"paperId": "9a6990b8ee583a2b995d18c238bc541e41657a28", "title": "Globe2Train: A Framework for Distributed ML Model Training using IoT Devices Across the Globe"}, {"paperId": "e4aa7fd3ff4a2cf640893016ded87ca79cc99516", "title": "An SRAM Optimized Approach for Constant Memory Consumption and Ultra-fast Execution of ML Classifiers on TinyML Hardware"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}, {"paperId": "36f89c08172ca16baa508ac8b77642f68f453bbd", "title": "TinyML on-device neural network training."}]}
