{"paperId": "564ac19d6b749a4af19941213735538518eba115", "publicationVenue": {"id": "0d6aa4dc-612c-4eab-bf70-0920fd59bd3f", "name": "Cybernetics and Information Technologies", "type": "journal", "alternate_names": ["Cybern Inf Technol"], "issn": "1311-9702", "url": "http://www.cit.iit.bas.bg/", "alternate_urls": ["http://www.degruyter.com/view/j/cait", "http://www.degruyter.com/view/j/cait?format=INT&result=24&rskey=BGbzfE"]}, "title": "A Review on Privacy Requirements and Application Layer Security in Internet of Things (IoT)", "abstract": "Abstract Internet of Things (IoT) is the predominant emerging technology that targets on facilitating interconnection of internet-enabled resources. IoT applications concentrate on automating different tasks that facilitate physical objects to act autonomously without any human interventions. The emerging and current IoT applications are determined to be highly significant for improving the degree of efficiency, comfort and automation for its users. Any kind of security breach on the system will directly influences the life of the humans In this paper, a comprehensive review on Privacy requirements and application layer Security in Internet of Things (IoT) is presented for exploring the possible security issues in IoT that could be launched over the individual layers of IoT architecture. This review explores different challenges of classical security solutions that are related to authentication, key management and cryptographic solutions.It also presents the details of existing access control and device authentication schemes with their pros and cons.", "venue": "Cybernetics and Information Technologies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-09-01", "journal": {"name": "Cybernetics and Information Technologies", "pages": "50 - 72", "volume": "21"}, "authors": [{"authorId": "2121918353", "name": "K. S. Sudha"}, {"authorId": "2513131", "name": "N. Jeyanthi"}], "citations": [{"paperId": "d16981928912bbbf45e13c89c12418485451cb2e", "title": "A Review on State-of-Art Blockchain Schemes for Electronic Health Records Management"}, {"paperId": "34d78939af046dbae1d2d356b44a995d010b9f6c", "title": "A Survey on Lightweight Cryptographic Algorithms in IoT"}, {"paperId": "1a7bd139cb1b73b4e7d763a1dd345e296da00724", "title": "DoSRT: A Denial-of-Service Resistant Trust Model for VANET"}, {"paperId": "c03aa3899db192364993908fbd02ef93d98e0e05", "title": "Foreign Language Teaching Model (FLTM) evaluation system based on Internet of Things (IOT) information technology"}, {"paperId": "50b9eec85748b69e8120da7e710b8e25b9ad9c4d", "title": "Cultivation of Innovative Ability of College Physical Education Students Based on the Internet of Things Multimedia Environment"}, {"paperId": "ef5ea2f57188eb537b88c7f59aecfc13d4452897", "title": "Optimization Simulation of Balanced Distribution of Multimedia Network Modular Teaching Resources"}, {"paperId": "5834802ff003c3f30e36fff06a94601818017362", "title": "Literature Survey for Cybersecurity for Internet of Things (IoT)"}, {"paperId": "aa1db552af782953588f3cc5aa7ff2d678de78cf", "title": "Security in the Internet of Things Application Layer: Requirements, Threats, and Solutions"}]}
