{"paperId": "564b5b241d60e76ed5fd7fbff972840880bdd0a0", "publicationVenue": null, "title": "Graph-PHPA: Graph-based Proactive Horizontal Pod Autoscaling for Microservices using LSTM-GNN", "abstract": "Microservice-based architecture has become prevalent for cloud-native applications. With an increasing number of applications being deployed on cloud platforms every day leveraging this architecture, more research efforts are required to understand how different strategies can be applied to effectively manage various cloud resources at scale. A large body of research has deployed automatic resource allocation algorithms using reactive and proactive autoscaling policies. However, there is still a gap in the efficiency of current algorithms in capturing the important features of microservices from their architecture and deployment environment, for example, lack of consideration of graphical dependency. To address this challenge, we propose Graph-PHPA, a graph-based proactive horizontal pod autoscaling strategy for allocating cloud resources to microservices leveraging long short-term memory (LSTM) and graph neural network (GNN) based prediction methods. We evaluate the performance of Graph-PHPA using the Bookinfo microservices deployed in a dedicated testing environment with real-time workloads generated based on realistic datasets. We demonstrate the efficacy of Graph-PHPA by comparing it with the rule-based resource allocation scheme in Kubernetes as our baseline. Extensive experiments have been implemented and our results illustrate the superiority of our proposed approach in resource savings over the reactive rule-based baseline algorithm in different testing scenarios.", "venue": "2022 IEEE 11th International Conference on Cloud Networking (CloudNet)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-06", "journal": {"name": "2022 IEEE 11th International Conference on Cloud Networking (CloudNet)", "pages": "237-241"}, "authors": [{"authorId": "2184202657", "name": "H. X. Nguyen"}, {"authorId": "2184225210", "name": "Shaoshu Zhu"}, {"authorId": "2112314186", "name": "Mingming Liu"}], "citations": [{"paperId": "8654f032dc51d366784e32e01e1d7035ac87c5fc", "title": "An Auto-Scaling Approach for Microservices in Cloud Computing Environments"}, {"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications"}, {"paperId": "0493dc8bcc02f1f5b930e2f45904f8b4be210a07", "title": "Auto-scaling techniques in container-based cloud and edge/fog computing: Taxonomy and survey"}, {"paperId": "6ff1634ed1d54eba6d0e4c23775ea5ce091cade5", "title": "A Survey on Graph Neural Networks for Microservice-Based Cloud Applications"}]}
