{"paperId": "565b31bafa847bc8d2a1eb10c158dda7f45509c6", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "An Efficient Spark-Based Hybrid Frequent Itemset Mining Algorithm for Big Data", "abstract": "Frequent itemset mining (FIM) is a common approach for discovering hidden frequent patterns from transactional databases used in prediction, association rules, classification, etc. Apriori is an FIM elementary algorithm with iterative nature used to find the frequent itemsets. Apriori is used to scan the dataset multiple times to generate big frequent itemsets with different cardinalities. Apriori performance descends when data gets bigger due to the multiple dataset scan to extract the frequent itemsets. Eclat is a scalable version of the Apriori algorithm that utilizes a vertical layout. The vertical layout has many advantages; it helps to solve the problem of multiple datasets scanning and has information that helps to find each itemset support. In a vertical layout, itemset support can be achieved by intersecting transaction ids (tidset/tids) and pruning irrelevant itemsets. However, when tids become too big for memory, it affects algorithms efficiency. In this paper, we introduce SHFIM (spark-based hybrid frequent itemset mining), which is a three-phase algorithm that utilizes both horizontal and vertical layout diffset instead of tidset to keep track of the differences between transaction ids rather than the intersections. Moreover, some improvements are developed to decrease the number of candidate itemsets. SHFIM is implemented and tested over the Spark framework, which utilizes the RDD (resilient distributed datasets) concept and in-memory processing that tackles MapReduce framework problem. We compared the SHFIM performance with Spark-based Eclat and dEclat algorithms for the four benchmark datasets. Experimental results proved that SHFIM outperforms Eclat and dEclat Spark-based algorithms in both dense and sparse datasets in terms of execution time.", "venue": "International Conference on Data Technologies and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-14", "journal": {"name": "Data", "pages": "11", "volume": "7"}, "authors": [{"authorId": "2150111505", "name": "Mohamed Reda Al-Bana"}, {"authorId": "115786938", "name": "M. S. Farhan"}, {"authorId": "2766674", "name": "N. A. Othman"}], "citations": [{"paperId": "7e72894e3e553ca83592b80d34c299fabbfb7dc5", "title": "GMiner++: Boosting GPU-based frequent itemset mining by reducing redundant computations"}, {"paperId": "84afcdcc0d42ff7b6cbf5e53a320cf0fce5f6612", "title": "A Model for Enhancing Unstructured Big Data Warehouse Execution Time"}, {"paperId": "cbda158ff4b2c5bb6375c5c6f3a3a705faba3cba", "title": "Efficient approach of high average utility pattern mining with indexed list-based structure in dynamic environments"}, {"paperId": "e18ac9721c2768f3ec74faf6308ab5f2ce59eeb3", "title": "A Progressive Sampling and RadeMacher Average for an Effective Frequent Pattern Mining in Big Data Environment"}, {"paperId": "9583ef29b7fe8357a8c9c2accecba386fccedf15", "title": "Discovery of interesting frequent item sets in an uncertain database using ant colony optimization"}, {"paperId": "106a3d2cfb67fd734df1d1d519a70a6ec05fb138", "title": "A Machine Learning Approach for Improving Wafer Acceptance Testing Based on an Analysis of Station and Equipment Combinations"}, {"paperId": "c41e878670022b6797aaaa0d119b0797902d69da", "title": "MapReduce Framework Based Sequential Association Rule Mining with Deep Learning Enabled Classification in Retail Scenario"}, {"paperId": "97d257da3a91b46f28cbe7391ca6155ade95c1e2", "title": "Frequent Itemset Mining Algorithm Based on Linear Table"}, {"paperId": "dd7d6227a66fe71a79001dd43e878db554331795", "title": "Dynamics of E-Learning During the Pandemic at Higher Education Institutions in Papua"}, {"paperId": "7eb42ef2042d57f1fcdfb40f82b1fd96d601fbbc", "title": "Apriori Algorithm and Hybrid Apriori Algorithm in the Data Mining: A Comprehensive Review"}, {"paperId": "e1ee2e33a5fe30b0e789e379e2f5ce25d4c8eac5", "title": "Analysis of Spatio-temporal Behavior of Research Travelers Based on Spark Big Data Computing Model"}]}
