{"paperId": "566335e2186af11f6d5b08398788e73ec3419c84", "publicationVenue": {"id": "0cb0dcea-43f4-4a34-a1c3-ac211434f660", "name": "International Conference Computing Methodologies and Communication", "type": "conference", "alternate_names": ["ICCMC", "Int Conf Comput Methodol Commun"]}, "title": "Analytical Review and Study on Load Balancing in Edge Computing Platform", "abstract": "Edge computing is an important paradigm in enhancing the system performance and minimizing the over burden caused at the cloud by bringing down its service to the user edge. This further reduces the overhead in the communication causing enhancement in the entire process carried out at the edge. The article is a detailed survey of current state-of-the-art load balancing techniques at edge including optimization-based, traffic load-based, heterogeneous, multi-access, joint-load, heuristic, security, allocation, distributed load and the dynamic load-based techniques. Elaborative discussion and analysis are made by considering the utilized methodology, implementation tool, and evaluation metrics. Towards the end, current research gaps and future directions in this area of research has been identified.", "venue": "International Conference Computing Methodologies and Communication", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-03-01", "journal": {"name": "2020 Fourth International Conference on Computing Methodologies and Communication (ICCMC)", "pages": "180-187"}, "authors": [{"authorId": "113935695", "name": "H. Pydi"}, {"authorId": "39349470", "name": "G. N. Iyer"}], "citations": [{"paperId": "43495dadb55385924e7785593daeea3e38307426", "title": "Inference at the Edge for Complex Deep Learning Applications with Multiple Models and Accelerators"}, {"paperId": "002019b0142b04acbc7afa17391949d518183f20", "title": "FedSDM: Federated learning based smart decision making module for ECG data in IoT integrated Edge-Fog-Cloud computing environments"}, {"paperId": "128765f08cc361662a4c6115438a28e797b87b55", "title": "Load Balancing Algorithms in Fog Computing"}, {"paperId": "6f83e84b9569c207d1112e7879fdbea80155ec54", "title": "Resource Management with Load Balancing Strategies in Fog-IoT Computing Environment: Trends, Challenges and Future directions"}, {"paperId": "97698bba35b99a9f9721d3a2d8b2ef4106299359", "title": "Energy Cognizant Scheduling in Three-Layer Cloud Architecture: A Systematic Review"}, {"paperId": "efcf7ffa684816c7dc8cb44621862e683644be81", "title": "Blockchain Based Fog Computation Model For Military Vehicular Application"}, {"paperId": "3977538e7255400e4852baf5bba8b72eb1f730ac", "title": "EVBLB: Efficient Voronoi Tessellation-Based Load Balancing in Edge Computing Networks"}, {"paperId": "4b0552f3bc4a4abf538b56b88c6610030a35f947", "title": "Network slicing with load-balancing for task offloading in vehicular edge computing"}, {"paperId": "04db5a786dc27e1d80c41f55b32e76083da910ae", "title": "Load balancing mechanisms in fog computing: A systematic review"}, {"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions"}, {"paperId": "44d50898e329a4aff48b4e2cf775c85accfb4de5", "title": "Resource Provisioning Using Meta-Heuristic Methods for IoT Microservices With Mobility Management"}, {"paperId": "4d88d4a20b07bbdb9373881d3301d86015235090", "title": "Evaluating dynamic load balancing of ECM workload pattern employed in cloud environments managed by a Kubernetes / Docker eco-system"}]}
