{"paperId": "566979c45713beda02270fa7f7f492b4eb3e063f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Enhanced Authentication Protocol for RFID Systems", "abstract": "In this paper, we analyse the security of two mutual authentication protocols that have been recently proposed by Gao et al. (IEEE Access, 7:8376–8384, 2019), a hash-based protocol and a Rabin public key based protocol. Our security analysis clearly shows important security pitfalls in these schemes. More precisely, in each protocol, we introduce efficient approaches to desynchronize the tag and the reader/server. The proposed attacks are almost deterministic and the complexity of each attack is a session for the hash-based and three sessions for Rabin public key based protocol. In addition, in the case of the hash-based protocol, we extend the proposed desynchronization attack to a traceability attack in which the adversary can trace any given tag based on the proposed attack with probability of almost one. In the case of Rabin public key based protocol, we extend the proposed desynchronization attack to a tag impersonation attack with the success probability of one. Besides, we propose an enhanced version of the Rabin public key based protocol to provide a secure authentication between the tag and the reader. We evaluate the security of the proposed protocol formally using the Scyther tool and also in Real-or-Random model.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "126977-126987", "volume": "8"}, "authors": [{"authorId": "2138729058", "name": "M. Hosseinzadeh"}, {"authorId": "152433961", "name": "Omed Hassan Ahmed"}, {"authorId": "9256044", "name": "S. H. Ahmed"}, {"authorId": "145004399", "name": "Cuong Trinh"}, {"authorId": "1679733", "name": "N. Bagheri"}, {"authorId": "144971015", "name": "S. Kumari"}, {"authorId": "2526024", "name": "J. Lánský"}, {"authorId": "145807461", "name": "Bao Huynh"}], "citations": [{"paperId": "0c04ff0fff25c2b76e1296136106dabc72ea21b9", "title": "A 0.59 nW/kHz Clock Circuit with High-Precision Clock Calibration for Passive Internet of Things Chips"}, {"paperId": "088958ffca30c438a03834e0371e12d5545e3668", "title": "Secure and Privacy-Preserving Authentication Scheme Using Decentralized Identifier in Metaverse Environment"}, {"paperId": "1fbcdaf8d4086c9880386b30f467999121cda2c5", "title": "Fog-Based Single Sign-On Authentication Protocol for Electronic Healthcare Applications"}, {"paperId": "57ae6c47ec6d1e5318d9a50685e2d8394e2ad7b9", "title": "Secure Authentication in the Smart Grid"}, {"paperId": "8cfd3f2852cedd191bb5851942f0c5004695ead8", "title": "SF-LAP: Secure M2M Communication in IIoT with a Single-Factor Lightweight Authentication Protocol"}, {"paperId": "5e1542413d863d7aad942d95261f25c98b591d1c", "title": "An Authentication Protocol for Next Generation of Constrained IoT Systems"}, {"paperId": "a0787947dc65424ff31c375fb56a9c69495fb153", "title": "KL-RAP: An Efficient Key-Less RFID Authentication Protocol Based on ECDLP for Consumer Warehouse Management System"}, {"paperId": "0b29cbea4013984c9e0ea167b1a94561460561ee", "title": "ESRAS: An efficient and secure ultra-lightweight RFID authentication scheme for low-cost tags"}, {"paperId": "2844fb0fb5ab849327fbd797fca0f4f859f14b9f", "title": "An Enhanced RFID-Based Authentication Protocol using PUF for Vehicular Cloud Computing"}, {"paperId": "6df6452ca20687489092c7618fe176b0b50c522b", "title": "Ethical AI for Automated Bus Lane Enforcement"}, {"paperId": "aa834353b56fffd7c4d64f78b626033f58875f00", "title": "URASP: An ultralightweight RFID authentication scheme using permutation operation"}, {"paperId": "f3052195d65ad83a366bbd1fd990ec456beb214e", "title": "RSEAP2: An enhanced version of RSEAP, an RFID based authentication protocol for vehicular cloud computing"}, {"paperId": "74554b600f3968cccb7eb7e7542a5dc67651f7b0", "title": "Secured Authentication of RFID Devices Using Lightweight Block Ciphers on FPGA Platforms"}, {"paperId": "ffbf7f370fbb7861014b8ca9729236c166083792", "title": "Serial Transmission Based on Pulse Width: Application to Water Bodies Monitoring"}, {"paperId": "4dd9851033065ca4db230839f5724e1e9ff1a7a0", "title": "Feature Selection and Cross Validation for Physical-Layer RFID Counterfeit Tag Identification"}, {"paperId": "3713d342663ecab753619b1dcbd203e655e2165a", "title": "LAPCHS: A lightweight authentication protocol for cloud-based health-care systems"}, {"paperId": "86a9229d62c18168294ad9c71426106927cc441c", "title": "Novel ECC-Based RFID Mutual Authentication Protocol for Emerging IoT Applications"}, {"paperId": "7e2e1b9872123662d195b4a4953a3a1520bdb8ea", "title": "RESEAP: An ECC-Based Authentication and Key Agreement Scheme for IoT Applications"}, {"paperId": "36b05db058d18b3ff2c53905639670719ccd38b1", "title": "SecMAP: A Secure RFID Mutual Authentication Protocol for Healthcare Systems"}]}
