{"paperId": "568f3f36007c3f25bfdbe9bf1ac0727a050fcc72", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "River Basin Cyberinfrastructure in the Big Data Era: An Integrated Observational Data Control System in the Heihe River Basin", "abstract": "River basin cyberinfrastructure with the Internet of Things (IoT) as the core has brought watershed data science into the big data era, greatly improving data acquisition and sharing efficiency. However, challenges in analyzing, processing, and applying very large quantities of observational data remain. Given the observational needs in watershed research, we studied the construction of river basin cyberinfrastructure and developed an integrated observational data control system (IODCS). The IODCS is an important platform for processing large quantities of observational data, including automated collection, storage, analysis, processing, and release. This paper presents various aspects of the IODCS in detail, including the system’s overall design, function realization, big data analysis methods, and integrated models. We took the middle reaches of the Heihe River Basin (HRB) as the application research area to show the performance of the developed system. Since the system began operation, it has automatically received, analyzed, and stored more than 1.4 billion observational data records, with an average of more than 14 million observational data records processed per month and up to 21,011 active users. The demonstrated results show that the IODCS can effectively leverage the processing capability of massive observational data and provide a new perspective for facilitating ecological and hydrological scientific research on the HRB.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2148899761", "name": "Jianwen Guo"}, {"authorId": "50495519", "name": "Minghu Zhang"}, {"authorId": "2141699980", "name": "Qingsheng Shang"}, {"authorId": "2152943025", "name": "Feng Liu"}, {"authorId": "32079844", "name": "Adan Wu"}, {"authorId": "2153899774", "name": "Xin Li"}], "citations": [{"paperId": "7db29cf1c28b7d1906ec719b11c47d5fbfa8ea1e", "title": "Digital healthcare for dementia and cognitive impairment: A scoping review."}, {"paperId": "dd4c8789152c713383c6321cb708036749d6675d", "title": "Linking Critical Zone With Watershed Science: The Example of the Heihe River Basin"}, {"paperId": "1e90943b2a2d2d387aeffc6390f82b263cd35d47", "title": "Efficient Query Model of Blockchain System in The Context of Dig Data"}, {"paperId": "9c21641e2fee5dac5f8e49c185ee1a83a497dad1", "title": "Video Image Processing Method Based on Cloud Platform Massive Data and Virtual Reality"}, {"paperId": "4b14b84e17d5a8fb2002a39170ba1662ec13f834", "title": "DBSCAN Clustering Algorithm Based on Big Data Is Applied in Network Information Security Detection"}, {"paperId": "4033b822d175f0a22b353a81d569e2235b65c9f3", "title": "Big Data Analysis of Marketing User Intelligence Information Based on Deep Learning"}]}
