{"paperId": "5695f14582e4cef36d3fc41d4a52da4b2ffbcafa", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "SeGraM: a universal hardware accelerator for genomic sequence-to-graph and sequence-to-sequence mapping", "abstract": "A critical step of genome sequence analysis is the mapping of sequenced DNA fragments (i.e., reads) collected from an individual to a known linear reference genome sequence (i.e., sequence-to-sequence mapping). Recent works replace the linear reference sequence with a graph-based representation of the reference genome, which captures the genetic variations and diversity across many individuals in a population. Mapping reads to the graph-based reference genome (i.e., sequence-to-graph mapping) results in notable quality improvements in genome analysis. Unfortunately, while sequence-to-sequence mapping is well studied with many available tools and accelerators, sequence-to-graph mapping is a more difficult computational problem, with a much smaller number of practical software tools currently available. We analyze two state-of-the-art sequence-to-graph mapping tools and reveal four key issues. We find that there is a pressing need to have a specialized, high-performance, scalable, and low-cost algorithm/hardware co-design that alleviates bottlenecks in both the seeding and alignment steps of sequence-to-graph mapping. Since sequence-to-sequence mapping can be treated as a special case of sequence-to-graph mapping, we aim to design an accelerator that is efficient for both linear and graph-based read mapping. To this end, we propose SeGraM, a universal algorithm/hardware co-designed genomic mapping accelerator that can effectively and efficiently support both sequence-to-graph mapping and sequence-to-sequence mapping, for both short and long reads. To our knowledge, SeGraM is the first algorithm/hardware co-design for accelerating sequence-to-graph mapping. SeGraM consists of two main components: (1) MinSeed, the first minimizer-based seeding accelerator, which finds the candidate locations in a given genome graph; and (2) BitAlign, the first bitvector-based sequence-to-graph alignment accelerator, which performs alignment between a given read and the subgraph identified by MinSeed. We couple SeGraM with high-bandwidth memory to exploit low latency and highly-parallel memory access, which alleviates the memory bottleneck. We demonstrate that SeGraM provides significant improvements for multiple steps of the sequence-to-graph (i.e., S2G) and sequence-to-sequence (i.e., S2S) mapping pipelines. First, SeGraM outperforms state-of-the-art S2G mapping tools by 5.9×/3.9× and 106×/- 742× for long and short reads, respectively, while reducing power consumption by 4.1×/4.4× and 3.0×/3.2×. Second, BitAlign outperforms a state-of-the-art S2G alignment tool by 41×-539× and three S2S alignment accelerators by 1.2×-4.8×. We conclude that SeGraM is a high-performance and low-cost universal genomics mapping accelerator that efficiently supports both sequence-to-graph and sequence-to-sequence mapping pipelines.", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-05-12", "journal": {"name": "Proceedings of the 49th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "112984718", "name": "Konstantinos Kanellopoulos"}, {"authorId": "2160629076", "name": "Joel Lindegger"}, {"authorId": "118143162", "name": "Z. Bingöl"}, {"authorId": "120578447", "name": "G. Kalsi"}, {"authorId": "1388728139", "name": "Ziyi Zuo"}, {"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "2051171114", "name": "Meryem Banu Cavlak"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "1403215560", "name": "Nika Mansouri-Ghiasi"}, {"authorId": "2117029302", "name": "Gagandeep Singh"}, {"authorId": "1474355913", "name": "Juan G'omez-Luna"}, {"authorId": "2048158626", "name": "N. Alserr"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "1706165", "name": "S. Subramoney"}, {"authorId": "2178851", "name": "C. Alkan"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "438497a8fe2a387aeabf4c182a92a154aa480385", "title": "Data Motion Acceleration: Chaining Cross-Domain Multi Accelerators"}, {"paperId": "c71a15e4f867ff315193b64f4f448ec9491e8bcf", "title": "TALCO: Tiling Genome Sequence Alignment Using Convergence of Traceback Pointers"}, {"paperId": "2fdddcec6166d3a26064f78a52217ca7a7f4239f", "title": "A High-Performance Genomic Accelerator for Accurate Sequence-to-Graph Alignment Using Dynamic Programming Algorithm"}, {"paperId": "6630205a2903ef105b517b1098077766de9b3a89", "title": "Accelerating Seed Location Filtering in DNA Read Mapping Using a Commercial Compute-in-SRAM Architecture"}, {"paperId": "3c8e4b14e3b08c692c11c0ba58c55ec4ce59385d", "title": "GEM: Ultra-Efficient Near-Memory Reconfigurable Acceleration for Read Mapping by Dividing and Predictive Scattering"}, {"paperId": "b3b4758b61e179a0e10d6aa1c225f239c0676c1e", "title": "GMX: Instruction Set Extensions for Fast, Scalable, and Efficient Genome Sequence Alignment"}, {"paperId": "72eeab8ea86b4a3ebc6a029e0f3a932b59469679", "title": "SequenceLab: A Comprehensive Benchmark of Computational Methods for Comparing Genomic Sequences"}, {"paperId": "478247d1e7526ce6fa94dbc710d49a01a6327c7a", "title": "Exploiting the Potential of Flexible Processing Units"}, {"paperId": "cde17e4c091d90d8edf9175358ac2973586fd1a1", "title": "WFAsic: A High-Performance ASIC Accelerator for DNA Sequence Alignment on a RISC-V SoC"}, {"paperId": "fe3777cd7170b60a8c44a0fc1a30b9535c0266b6", "title": "MeG2: In-Memory Acceleration for Genome Graphs Analysis"}, {"paperId": "7dec8a25543921c1d00cd0a9003ce0d4038bea22", "title": "GenDP: A Framework of Dynamic Programming Acceleration for Genome Sequencing Analysis"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "f0206e82d279ad4d9ae4eaf17273b7e20edafd46", "title": "Porting and Optimizing BWA-MEM2 Using the Fujitsu A64FX Processor"}, {"paperId": "ff70b57466ca768b2c70bb8459eda4f3f78af4b6", "title": "In-Storage Domain-Specific Acceleration for Serverless Computing"}, {"paperId": "2e81b5a00dbb324e8f7d29f556a5a40f446f2c81", "title": "SPARTA: Spatial Acceleration for Efficient and Scalable Horizontal Diffusion Weather Stencil Computation"}, {"paperId": "c2f514ff25750897e4e86ea5ade2187f064fd5fd", "title": "ISMatch: A real-time hardware accelerator for inexact string matching of DNA sequences on FPGA"}, {"paperId": "68a4d283ce7d73fa811c9d2fddf1c9b77c2c140b", "title": "NvWa: Enhancing Sequence Alignment Accelerator Throughput via Hardware Scheduling"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "fad8f862216ddadb49e4bc03f36e1c5a4bc9404e", "title": "Genome-on-Diet: Taming Large-Scale Genomic Analyses via Sparsified Genomics"}, {"paperId": "33a976423a7e46650d09193a5dc9691ba1f1dbe1", "title": "RUBICON: a framework for designing efficient deep learning-based genomic basecallers"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "8c725a22bef2de556ef4a780de0e923cb957b82c", "title": "LEAPER: Fast and Accurate FPGA-based System Performance Prediction via Transfer Learning"}, {"paperId": "425a24794315ce83c53025d513059eaeffd44f2f", "title": "Scrooge: a fast and memory-frugal genomic sequence aligner for CPUs, GPUs, and ASICs"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "6445ef7945bbc2d231176e959b9cadce04acef23", "title": "ApHMM: Accelerating Profile Hidden Markov Models for Fast and Energy-Efficient Genome Analysis"}, {"paperId": "d2d3436259017029bbf084e01626a488b304fe53", "title": "GenStore: In-Storage Filtering of Genomic Data for High-Performance and Energy-Efficient Genome Analysis"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "46d657297da65cd6105ac837ad24ec7fd651f3b1", "title": "BLEND: a fast, memory-efficient and accurate mechanism to find fuzzy seed matches in genome analysis"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "e804e5bfe114715af9d77ed27a009b7a894a7ed0", "title": "Taming Large-Scale Genomic Analyses via Sparsified Genomics"}]}
