{"paperId": "56994baefe75364c2e573a5fb39402906a09cb4f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Mobility Support 5G Architecture with Real-Time Routing for Sustainable Smart Cities", "abstract": "The Internet of Things (IoT) is an emerging technology and provides connectivity among physical objects with the support of 5G communication. In recent decades, there have been a lot of applications based on IoT technology for the sustainability of smart cities, such as farming, e-healthcare, education, smart homes, weather monitoring, etc. These applications communicate in a collaborative manner between embedded IoT devices and systematize daily routine tasks. In the literature, many solutions facilitate remote users to gather the observed data by accessing the stored information on the cloud network and lead to smart systems. However, most of the solutions raise significant research challenges regarding information sharing in mobile IoT networks and must be able to stabilize the performance of smart operations in terms of security and intelligence. Many solutions are based on 5G communication to support high user mobility and increase the connectivity among a huge number of IoT devices. However, such approaches lack user and data privacy against anonymous threats and incur resource costs. In this paper, we present a mobility support 5G architecture with real-time routing for sustainable smart cities that aims to decrease the loss of data against network disconnectivity and increase the reliability for 5G-based public healthcare networks. The proposed architecture firstly establishes a mutual relationship among the nodes and mobile sink with shared secret information and lightweight processing. Secondly, multi-secured levels are proposed to protect the interaction with smart transmission systems by increasing the trust threshold over the insecure channels. The conducted experiments are analyzed, and it is concluded that their performance significantly increases the information sustainability for mobile networks in terms of security and routing.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2064048917", "name": "Amjad Rehman"}, {"authorId": "2689599", "name": "K. Haseeb"}, {"authorId": "48592042", "name": "T. Saba"}, {"authorId": "144484046", "name": "Jaime Lloret"}, {"authorId": "2144094800", "name": "Zara Ahmed"}], "citations": [{"paperId": "22cafcd8393623c4e509fb67180385c36295d2b7", "title": "Information Security Applications in Smart Cities: A Bibliometric Analysis of Emerging Research"}, {"paperId": "02a948e6897e5646704b7ee114f1fc7b43622cfa", "title": "Engineering Challenges of Stationary Wireless Smart Ocean Observation Systems"}, {"paperId": "26e265750b363d2a1900bc2dfc3137ecee8754b2", "title": "Smart Cities—A Structured Literature Review"}, {"paperId": "e66c8ba0751088bca4d0576cde9bc014c3f86b03", "title": "Sustainable Data-Driven Secured Optimization Using Dynamic Programming for Green Internet of Things"}, {"paperId": "f16c61e8e048fb751adb6f1ac7f87d0ea1b74480", "title": "Sustainability Model for the Internet of Health Things (IoHT) Using Reinforcement Learning with Mobile Edge Secured Services"}, {"paperId": "3e7475206e2924040be3edf81f49fd1e2df8b20b", "title": "Traffic-Aware Secured Cooperative Framework for IoT-Based Smart Monitoring in Precision Agriculture"}, {"paperId": "9164716c90215a5b6a4cb4eff84337979035c882", "title": "Efficient and trusted autonomous vehicle routing protocol for 6G networks with computational intelligence."}, {"paperId": "495a3d496c22ba2030c7f0e2e63aa6739e2dc436", "title": "An adaptive and secure routes migration model for the sustainable cloud of things"}, {"paperId": "41e0737402fff56e1dd8ce9a946e1aac32e93081", "title": "Threat Analysis and Distributed Denial of Service (DDoS) Attack Recognition in the Internet of Things (IoT)"}, {"paperId": "01547c3f2cf646cdd5a0235f52e74a143dea92fc", "title": "The New Era of Business Digitization through the Implementation of 5G Technology in Romania"}, {"paperId": "ac28eecfeb38d5cc02906dd4b55ad11bf379c387", "title": "An Optimization Model with Network Edges for Multimedia Sensors Using Artificial Intelligence of Things"}, {"paperId": "ce7b3c4345f8d47fbadb71b6811491c267c0e06a", "title": "Reliable Bidirectional Data Transfer Approach for the Internet of Secured Medical Things Using ZigBee Wireless Network"}, {"paperId": "dd2cc82ad2876554aa9349e9b6509d11b7e4ed57", "title": "Energy-Efficient IoT e-Health Using Artificial Intelligence Model with Homomorphic Secret Sharing"}]}
