{"paperId": "569cafb72135a96fc6c75f05c9422274c4a7264a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Deep Learning-Assisted Security and Privacy Provisioning in the Internet of Medical Things Systems: A Survey on Recent Advances", "abstract": "Internet of Medical Things (IoMT) are a kind of Internet of Things (IoT) systems which are used in the healthcare domain. Nowadays, there are an abundance of wearable smart devices, either commercial or clinical, which can be used to collect vital signs and transmit the collected data to remote servers for further analysis. Remote patient monitoring, smart diagnostics, and autonomous control of chronic diseases are examples of different healthcare services that can be provided by these systems at a lower cost and higher efficiency compared to traditional healthcare settings. However, as data related to patients’ health status and treatment history, transmitted in these systems, are highly confidential and private, security and privacy concerns in their widespread adoption may arise. Deap Learning (DL) algorithms, with their ability in extracting knowledge from big data generated in these systems, can be leveraged to design smart security mechanisms. In this survey study, the recent literature on the DL-assisted security and privacy provisioning frameworks in IoMT systems are categorized and summarized with respect to their main contributions. Finally, some possible future directions are introduced to assist interested researchers to continue research in this domain.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "40610-40621", "volume": "12"}, "authors": [{"authorId": "2088965093", "name": "Rambod Pakrooh"}, {"authorId": "152759401", "name": "Abdollah Jabbari"}, {"authorId": "2211788216", "name": "Carol Fung"}], "citations": []}
