{"paperId": "56acdd89373c4b9a0cb61991a0b130b0daf2d1de", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Overview of Fog Data Analytics for IoT Applications", "abstract": "With the rapid growth in the data and processing over the cloud, it has become easier to access those data. On the other hand, it poses many technical and security challenges to the users of those provisions. Fog computing makes these technical issues manageable to some extent. Fog computing is one of the promising solutions for handling the big data produced by the IoT, which are often security-critical and time-sensitive. Massive IoT data analytics by a fog computing structure is emerging and requires extensive research for more proficient knowledge and smart decisions. Though an advancement in big data analytics is taking place, it does not consider fog data analytics. However, there are many challenges, including heterogeneity, security, accessibility, resource sharing, network communication overhead, the real-time data processing of complex data, etc. This paper explores various research challenges and their solution using the next-generation fog data analytics and IoT networks. We also performed an experimental analysis based on fog computing and cloud architecture. The result shows that fog computing outperforms the cloud in terms of network utilization and latency. Finally, the paper is concluded with future trends.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-24", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "39896776", "name": "Jitendra Bhatia"}, {"authorId": "2198571745", "name": "Kiran Italiya"}, {"authorId": "134251502", "name": "Kuldeepsinh Y. Jadeja"}, {"authorId": "74781745", "name": "Malaram Kumhar"}, {"authorId": "49857223", "name": "Uttam Chauhan"}, {"authorId": "49252696", "name": "S. Tanwar"}, {"authorId": "3167520", "name": "Madhuri D. Bhavsar"}, {"authorId": "2151298698", "name": "Ravi Sharma"}, {"authorId": "93448687", "name": "D. Manea"}, {"authorId": "2198570416", "name": "Marina Verdes"}, {"authorId": "101679891", "name": "M. Răboacă"}], "citations": [{"paperId": "53e35627850801a9766e1990901516999f25262a", "title": "Volunteer Computing for fog scalability: A systematic literature review"}, {"paperId": "9e1f7032982481fc3ee5762a05bfc60026cfaa40", "title": "Autonomous Threat Response at the Edge Processing Level in the Industrial Internet of Things"}, {"paperId": "885abdcea37352fbd181bd914fa6122db785231d", "title": "Federated transfer learning for intrusion detection system in industrial iot 4.0"}, {"paperId": "30aa8a49a3565a54ffd8a7d7c793a8cc7f767ce8", "title": "Survey on identification and prediction of security threats using various deep learning models on software testing"}, {"paperId": "d574af780c495d472b6d95386c0395c0460f4803", "title": "A truthful double auction framework for security-driven and deadline-aware task offloading in fog-cloud environment"}, {"paperId": "f690a03e0b21b3696a4debedac548a7a89c38026", "title": "IoMT-Enabled Smart Healthcare: State-of-the-Art, Security and Future Directions"}, {"paperId": "053ce3694a6ba7d27d6112a0efbac037234b4ed4", "title": "An Enhanced Software Architecture to Improve the MQTT Communications Encrypted Model"}, {"paperId": "27992f3b8dda04d692ea966734c2c94f26c69d69", "title": "PPAM-mIoMT: a privacy-preserving authentication with device verification for securing healthcare systems in 5G networks"}, {"paperId": "2f14d7eae99e004abf71eac87d5f7ad97b17654d", "title": "Decision model of intrusion response based on markov game in fog computing environment"}, {"paperId": "e6e1d137304a0795b5f6c632b8f4216dca0976db", "title": "A Comparative Study on Cloud and Edgeb Computing: A Survey on Current Research Activities and Applications"}, {"paperId": "dc3c45aecc81066687434b3b4258e18bc25abde4", "title": "Evolution of Hybrid Intelligence and Its Application in Evidence-Based Medicine: A Review"}, {"paperId": "ba9334985447b433160024a2f0857431aceb036a", "title": "Intelligent Fog Computing Surveillance System for Crime and Vulnerability Identification and Tracing"}, {"paperId": "3fe973271ab0c4c1bac2a017c4fc43fc5ddac4ec", "title": "Fog-DeepStream: A new approach combining LSTM and Concept Drift for data stream analytics on Fog computing"}, {"paperId": "387e326d21ab1295fddd0b5ae533c91b92cf7c0a", "title": "A service collaboration method based on mobile edge computing in internet of things"}, {"paperId": "9f8b93182de2ffb6fcdefbb1eaa6bb9e254c01f8", "title": "Analyzing Frameworks for IoT Data Storage, Representation and Analysis: A Statistical Perspective"}, {"paperId": "aa5191cf10db7b2cf293c336321cfce2410ae68b", "title": "Enhancing Decision-Making with Data Science in the Internet of Things Environments"}, {"paperId": "e298fa77ed00c4181030ebc3902a13e557422c50", "title": "An Extensive Blockchain Based Applications Survey: Tools, Frameworks, Opportunities, Challenges and Solutions"}]}
