{"paperId": "56b04b587b38ec39bcd6f8a175d7b87f25512ce9", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Real-time Workload Pattern Analysis for Large-scale Cloud Databases", "abstract": "Hosting database services on cloud systems has become a common practice. This has led to the increasing volume of database workloads, which provides the opportunity for pattern analysis. Discovering workload patterns from a business logic perspective is conducive to better understanding the trends and characteristics of the database system. However, existing workload pattern discovery systems are not suitable for large-scale cloud databases which are commonly employed by the industry. This is because the workload patterns of large-scale cloud databases are generally far more complicated than those of ordinary databases.\n In this paper, we propose Alibaba Workload Miner (AWM), a real-time system for discovering workload patterns in complicated large-scale workloads. AW M encodes and discovers the SQL query patterns logged from user requests and optimizes the querying processing based on the discovered patterns. First, Data Collection & Preprocessing Module collects streaming query logs and encodes them into high-dimensional feature embeddings with rich semantic contexts and execution features. Next, Online Workload Mining Module separates encoded query by business groups and discovers the workload patterns for each group. Meanwhile, Offline Training Module collects labels and trains the classification model using the labels. Finally, Pattern-based Optimizing Module optimizes query processing in cloud databases by exploiting discovered patterns. Extensive experimental results on one synthetic dataset and two real-life datasets (extracted from Alibaba Cloud databases) show that AW M enhances the accuracy of pattern discovery by 66% and reduce the latency of online inference by 22%, compared with the state-of-the-arts.", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-05", "journal": {"name": "ArXiv", "volume": "abs/2307.02626"}, "authors": [{"authorId": "120465298", "name": "Jiaqi Wang"}, {"authorId": "2118909433", "name": "Tianyi Li"}, {"authorId": "2116559067", "name": "Anni Wang"}, {"authorId": "2109052548", "name": "Xiaoze Liu"}, {"authorId": "2115384591", "name": "Lu Chen"}, {"authorId": "2155101138", "name": "Jie Chen"}, {"authorId": "2221235292", "name": "Jianye Liu"}, {"authorId": "2165999063", "name": "Junyang Wu"}, {"authorId": "2115374972", "name": "Feifei Li"}, {"authorId": "1409828392", "name": "Yunjun Gao"}], "citations": [{"paperId": "e3142ff658b29bb6120d0dc6588d86aa1d326273", "title": "TFB: Towards Comprehensive and Fair Benchmarking of Time Series Forecasting Methods"}]}
