{"paperId": "56c32cac768cf95ab3b5cb77a6356d40966aa33f", "publicationVenue": null, "title": "Cutpoint Temperature Surrogate Modeling for Distillation Yields and Properties", "abstract": "For high-performance operations in crude oil refinery processing, it is important to properly determine yields and properties of output streams from distillation units. To address such complex repr...", "venue": "", "year": 2020, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2020-09-18", "journal": {"name": "Industrial & Engineering Chemistry Research", "pages": "18616-18628", "volume": "59"}, "authors": [{"authorId": "93069831", "name": "Robert E. Franzoi"}, {"authorId": "1954965", "name": "B. Menezes"}, {"authorId": "47623376", "name": "J. D. Kelly"}, {"authorId": "32617799", "name": "J. A. Gut"}, {"authorId": "1739689", "name": "I. Grossmann"}], "citations": [{"paperId": "af806c6471e9d680dd751672543c3aa3dcb671c6", "title": "Production planning optimization framework for integrated refinery, ethylene and aromatics industrial chains considering environmental performance"}, {"paperId": "32d4aa0ea91c9e79f3d07b6da0885092863f2e11", "title": "Blend Scheduling Solutions in Petroleum Refineries towards Automated Decision-Making in Industrial-like Blend-Shops"}, {"paperId": "f95c8dd272142a4a56262307263e37b8cb422691", "title": "Optimisation of Vacuum Distillation Units in Oil Refineries Using Surrogate Models"}, {"paperId": "c7fe82065c38b57821bf8d3b30a41b3a5be96a33", "title": "Data-driven models of crude distillation units for production planning and for operations monitoring"}, {"paperId": "688f115ec0b34e0684f927e5122e438e32b0a5f6", "title": "Do the True Boiling-Point Distillation Yields of Crude Oil Blends Obey the Additive Blending Rule?"}, {"paperId": "867f2bc23a66a8e205ad1f26c4f36bccf2aaa061", "title": "Roadmap to digital supply chain resilience under investment constraints"}, {"paperId": "5ccf5b5cce03be0fb7da7cfdef1a0aec996bbae9", "title": "Cyber-Physical LPG Debutanizer Distillation Columns: Machine-Learning-Based Soft Sensors for Product Quality Monitoring"}, {"paperId": "4d0fae1a799229be274badb4b8e69bcdc967a4ee", "title": "Cyber-Physical LPG Debutanizer Distillation Columns: Machine Learning-Based Soft Sensors for Product Quality Monitoring"}, {"paperId": "0171f4a967bd6009c31c667e234bae07d5ca228c", "title": "Optimising of vacuum distillation units using surrogate models"}, {"paperId": "8c57b89fc4a7f0fa4b2daa09da40e350cef88421", "title": "Surrogate Modeling Approach for Nonlinear Blending Processes"}, {"paperId": "adf702c08e05b9864a809070a08f51d026a9e77f", "title": "Refinery production planning optimization under crude oil quality uncertainty"}, {"paperId": "1f875ea034c0c07b42948225efc171ff7651caa1", "title": "An adaptive sampling surrogate model building framework for the optimization of reaction systems"}, {"paperId": "f1f94d035b31fef6e76139db7d2a27877a30037b", "title": "Computational Experience with Piecewise-Linear Relaxations for Petroleum Refinery Planning"}, {"paperId": "7ae35ece3d8187335ff948f3b0557e00beb251d1", "title": "Maximizing Sustainable aviation fuel usage through optimization of distillation cut points and blending"}, {"paperId": "f2eff58751e4403a3844dc8ed098a5ac8b6882e8", "title": "Estimation of cutpoint temperature under uncertain feed composition and process conditions using artificial intelligence methods"}]}
