{"paperId": "56e55cbb33e763981ffffa5616caf188e7527a25", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "An effective architecture of digital twin system to support human decision making and AI‐driven autonomy", "abstract": "With the development of IoT technologies, digital twin has become an increasingly popular concept that is considered the next generation of digitalization for decision making support (human‐oriented) and even fully autonomous. However, although there are a few research projects that have proposed available digital twin architectures, they are either missing critical components or difficult to be converted into a practical application. In this article, everything we proposed had been implemented in our production environment and is facilitating our manufacturing and mining processes. It is initiated by a data analytic maturity model which formulates the evaluation route of data analytics. Then, a novel six‐layer digital twin model is established that aims to set the standards. In this model, we defined that all the automated calculation jobs should be driven by digital twin metadata such as the hyperparameters of machine learning. The metadata will be updated by metadata updating feedback flow which most current digital twin projects are missing.", "venue": "Concurrency and Computation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-27", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "40388712", "name": "Fahed Mostafa"}, {"authorId": "8304993", "name": "Longquan Tao"}, {"authorId": "12254777", "name": "Wenjin Yu"}], "citations": [{"paperId": "42ebfc95c429984de4bc09160879ab82890209df", "title": "Integration of Cyber-Physical Systems, Digital Twins and 3D Printing in Advanced Manufacturing: A Synergistic Approach"}, {"paperId": "1372f01a042060f56ee081e72f51dad76d50d062", "title": "A review of digital twin technology for electromechanical products: Evolution focus throughout key lifecycle phases"}, {"paperId": "747a777eb0f6861c95f7fa180ae6a32305b8f1e7", "title": "Evolution of Digital Twin solutions in the manufacturing industry"}, {"paperId": "e972d2f0e72229c635efa5b0d426165a5df480ce", "title": "DEMDE: Decision Making Design based on Bayesian Network for Personalized Monitoring System"}, {"paperId": "8f9186cb1c56b50c18311cc2b9aabab18d5777e0", "title": "Maintenance Performance in the Age of Industry 4.0: A Bibliometric Performance Analysis and a Systematic Literature Review"}, {"paperId": "470d95e3dbdd489b71d587cb54392e35176a3723", "title": "A systematic review of digital twin about physical entities, virtual models, twin data, and applications"}, {"paperId": "807963a759622f1623c9b124527aaa9f34e69a3d", "title": "Potentials of game engines for wind power digital twin development: an investigation of the Unreal Engine"}, {"paperId": "8a8c7b9ce0ba228f42baf19f2cead5c472df7dc3", "title": "Digital twins: An analysis framework and open issues"}, {"paperId": "e881d61c3cfd9dfb3e7e6025f4ad18822d742939", "title": "Extended Reality in Marketing - A Multiple Case Study on Internet of Things Platforms"}, {"paperId": "10fbce998c1eaabe7d2a14752cc76993c787dbb2", "title": "LiDiTE: A Full-Fledged and Featherweight Digital Twin Framework"}, {"paperId": "c2f33d8334ae48e13b8f30b09ba29b02a0463c86", "title": "A Novel Embedding Model Based on a Transition System for Building Industry-Collaborative Digital Twin"}, {"paperId": "f67036b2a8a14878eb8d1312565963c48ec87532", "title": "RETRACTED ARTICLE: Deep Reinforcement Learning-Based Smart Manufacturing Plants with a Novel Digital Twin Training Model"}, {"paperId": "d89af9d977839ce13728b2d9c697aed3830cd747", "title": "Human oriented solutions for intelligent analysis, multimedia and communication systems"}, {"paperId": "500f9c77ec9131fb9305f60986f349d429c98890", "title": "A Framework for Monitoring Stability of Tailings Dams in Realtime Using Digital Twin Simulation and Machine Learning"}, {"paperId": "3a6e1df171667c9e6b883b959baaef81b3e541e8", "title": "Production logistics digital twins: Research profiling, application, challenges and opportunities"}, {"paperId": "3090d6f901a340c70e69420b57181b8af922a7ee", "title": "Architecting Digital Twins"}]}
