{"paperId": "56f58390fc506126bf3a9a4b40a278f8f11b646d", "publicationVenue": {"id": "a658f37d-f6a7-4848-ad22-b2488e5ba84e", "name": "Engineering Construction and Architectural Management", "type": "journal", "alternate_names": ["Eng Constr Archit Manag", "Engineering, Construction and Architectural Management"], "issn": "0969-9988", "url": "http://www.blackwell-synergy.com/member/institutions/issuelist.asp?journal=eca", "alternate_urls": ["https://www.emerald.com/insight/publication/issn/0969-9988"]}, "title": "IoT-based digital twin best practices for reducing operational carbon in building retrofitting: a mixed-method approach", "abstract": "Purpose The Internet of Things-based digital twin (IoT-DT) technologies offer a transformative approach to building retrofitting for reducing operational carbon (ROC) emissions. However, a notable gap exists between the potential and adoption of the two emerging technologies, further exacerbated by the nascent state of research in this domain. This research aims to establish the best practices that innovatively strengthen the identified enablers to decisively tackle challenges, ensuring the efficient implementation of IoT-DT for ROC emissions in buildings.Design/methodology/approach This study adopted a mixed-method approach. Questionnaire data from 220 multidiscipline professionals were analysed via structural equation modelling analysis, while interview data obtained from 18 stakeholders were analysed using thematic content analysis. The findings were triangulated for cohesive interpretation.Findings After the analysis of questionnaire data, a structural model was established, depicting the critical challenges (inadequate data security, limited technical expertise and scalability issues) and key enablers (robust data security measures, skill development and government incentives) of implementing IoT-DT for ROC. Sequentially, analysis of in-depth interview data revealed the IoT-based DT best practices (safeguarding data, upskilling and incentivization). Upon triangulating the questionnaire and interview findings, this study explicitly highlights the potential of the established best practices to strategically strengthen enablers, thereby mitigating challenges and ensuring the successful implementation of IoT-based DT for ROC emissions in buildings.Originality/value This study provides practical guidance for stakeholders to effectively implement IoT-DT in ROC in buildings and contributes significantly to climate change mitigation.", "venue": "Engineering Construction and Architectural Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-11", "journal": {"name": "Engineering, Construction and Architectural Management"}, "authors": [{"authorId": "101567346", "name": "C. C. Ohueri"}, {"authorId": "98677237", "name": "Md. Asrul Nasid Masrom"}, {"authorId": "34098084", "name": "Hadina Habil"}, {"authorId": "152379463", "name": "M. Ambashe"}], "citations": []}
