{"paperId": "56f55108224b878da30146464b2d4cd53c46dd2f", "publicationVenue": {"id": "e1ce0fed-d655-40bd-b678-9adc73f2e582", "name": "International Symposium on High Performance Computing Systems and Applications", "type": "conference", "alternate_names": ["International Conference on High Performance Computing and Simulation", "Int Conf High Perform Comput  Simul", "Int Symp High Perform Comput Syst Appl", "High Performance Computing Systems and Applications", "High Perform Comput Syst Appl", "Int Conf High Perform Comput Simul", "HPCS", "International Conference on High Performance Computing & Simulation"]}, "title": "Ranking Mutual Information Dependencies in a Summary-based Approximate Analytics Framework", "abstract": "We continue our research on utilizing histogram¬based data summaries in approximate derivation of mutual information scores in large relational data sets. Our methodology of creating, storing and using summaries has been designed for the purpose of developing an approximate database engine that is currently deployed commercially in the area of cyber- security data analytics. However, a similar idea of approximate data processing operations can be considered also in other fields, including machine learning whereby heuristic calculations are a component of many methods. In this paper, we focus on investigation of one possible source of inaccuracy of our previ¬ously proposed approach to approximating mutual information - that is, neglecting a kind of column domain drift during distributed summary-based computations. We illustrate it using an artificially created benchmark data set and we discuss how to cope this particular challenge in the future.", "venue": "International Symposium on High Performance Computing Systems and Applications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 International Conference on High Performance Computing & Simulation (HPCS)", "pages": "852-859"}, "authors": [{"authorId": "145514740", "name": "D. Ślęzak"}, {"authorId": "144420834", "name": "J. Borkowski"}, {"authorId": "1409256143", "name": "Agnieszka Chadzynska-Krasowska"}], "citations": [{"paperId": "8f7c84483736ecb3029e802d8b4171d01e2e2001", "title": "Toward automatic assessment of a risk of women’s health disorders based on ontology decision models and menstrual cycle analysis"}, {"paperId": "f3ccac478eb74c67405438fee2ed666703d87863", "title": "Generating Fuzzy Linguistic Summaries for Menstrual Cycles"}]}
