{"paperId": "5703990b61764be619a485bfcbe0a05d8da5457a", "publicationVenue": {"id": "1042faa2-59ed-4755-bc0d-be06dc2e3707", "name": "Electronic library", "type": "journal", "alternate_names": ["Electron Libr", "The Electronic Library", "Electron libr"], "issn": "0264-0473", "url": "https://www.emerald.com/insight/publication/issn/0264-0473", "alternate_urls": ["http://www.emeraldinsight.com/loi/el"]}, "title": "Transformation of educational roles of library-supported mobile learning: a literature review from 2009 to 2018", "abstract": "\nPurpose\nThis study aims to explore the transformation of the roles of libraries, application trends and potential research issues of library-supported mobile learning.\n\n\nDesign/methodology/approach\nThe publications in the Scopus database from 2009 to 2018 are reviewed and analyzed from various aspects, such as the roles of libraries in mobile learning, types of libraries, research foci and sensing or location-based technologies.\n\n\nFindings\nThe role of libraries as learning material providers is examined the most in library-supported mobile learning studies, followed by the role as inquiry context providers and as knowledge-sharing platforms. In terms of the role as learning material providers, academic libraries were investigated the most and radio frequency identification (RFID) was mainly adopted. In terms of the role as inquiry context providers, special libraries were explored the most; adopted sensing technologies were more diverse (e.g. QR code, augmented reality, RFID and Global Positioning System). Only special libraries played a role as knowledge-sharing platforms, adopting augmented reality. Most research on library-supported mobile learning mainly focused on investigating the affective domain during mobile learning.\n\n\nPractical implications\nFive potential applications of educational roles in library-supported mobile learning are suggested based on the findings of the present study.\n\n\nOriginality/value\nThe current study provides insights relevant to the educational roles of library-supported mobile learning. The findings and suggestions can serve as references for researchers and school teachers conducting library-supported mobile learning.\n", "venue": "Electronic library", "year": 2020, "fieldsOfStudy": ["Computer Science", "Sociology"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-08-14", "journal": {"name": "Electron. Libr.", "pages": "695-710", "volume": "38"}, "authors": [{"authorId": "35656591", "name": "Y. Tu"}, {"authorId": "144217709", "name": "Gwo-jen Hwang"}], "citations": [{"paperId": "a34b3185f71706240ad839e8e568cccbdc6847f0", "title": "A systematic literature review on the use of mobile phones to access library services and resources: challenges and benefits"}, {"paperId": "7f4b00944a322c02a9422f1fd54ffae134c5ab07", "title": "They’re back! QR codes for marketing the academic library after pandemic lockdowns"}, {"paperId": "7686555f47565ef6757cecd3c1db6f9a849e49c7", "title": "Did library learners benefit from m-learning strategies? Research-based evidence from a co-citation network analysis of the literature"}, {"paperId": "41f181ee37eef0f2c22c9987f78531fdc1ee329f", "title": "Analysing scientific publications in the field of mobile information systems using bibliometric analysis"}, {"paperId": "9e4c10ee12be503cf73f34df1d583d684c601e0b", "title": "Roles, applications, and trends of concept map-supported learning: a systematic review and bibliometric analysis of publications from 1992 to 2020 in selected educational technology journals"}, {"paperId": "5524ebe7fd95282ddca0caa76c6e2863d6804c1b", "title": "Differences between LIS and non-LIS undergraduates' conceptions of smart libraries: a drawing analysis approach"}, {"paperId": "92ae8fa6455c953cb3869179c016dd7b298a1892", "title": "Research Trends from a Decade (2011–2020) for Information Literacy in Higher Education: Content and Bibliometric Mapping Analysis"}, {"paperId": "f1e714e59410b4b7a3b72da21988b08a62097b7b", "title": "Research advancement and foci of mobile technology-supported music education: a systematic review and social network analysis on 2008-2019 academic publications"}, {"paperId": "7bd21059ecfd279a0a2237810b503bb52addf7e0", "title": "Comparing technology acceptance of AR-based and 3D map-based mobile library applications: a multigroup SEM analysis"}, {"paperId": "5d95b6d2c9ca5e050f2736c932e1df82ad2382df", "title": "Research on the drivers of undergraduates' intention to use university digital libraries: affinity theory as an additional construct of information system success model"}, {"paperId": "29bb2e304c56aa98c471697882023f603daa6e49", "title": "Roles and Research Trends of Artificial Intelligence in Mathematics Education: A Bibliometric Mapping Analysis and Systematic Review"}]}
