{"paperId": "571bf8f03ab4661dbb9097cf1dfcc15d48b1ebdd", "publicationVenue": {"id": "682d4e62-6b9a-4d78-a606-4faee66c1ebd", "name": "International Bhurban Conference on Applied Sciences and Technology", "type": "conference", "alternate_names": ["IBCAST", "Int Bhurban Conf Appl Sci Technol"]}, "title": "Towards Investigating the Role of Proprotein Convertase Subtilisin/Kexin Family (PCSK/7/9) in Cancer by Using Bioinformatics Motif Detection Technique", "abstract": "The significant role of Proprotein convertase subtilisin/Kexin family 7 and 9 (PCSK/7/9) is, to activate other proteins. In common practice, many proteins are inactive when they firstly synthesize. Several reasons are investigating in this regard in which when the process of activations is started then block its activity due to a long chain of amino acids. The PCSK remove these chains and activate the protein. For this duty, the PCSK is familiar in the domain of medical industry and bioinformatics where several medicines are prepared for the cure of different diseases like cancer, viral infection, inflammation and hypercholesterolemia. Many proprotein convertases like PACE4 and furin are involved in the pathological process of these diseases. By using the motif detection technique, the role of PCSK/7/9 is identified in that region where the activation of another protein start. Multiple tools and practices exist in the literature to identify the motifs in varied meadows like neural networks, metabolic ways, DNA/RNA sequences, antigen protein, and Protein-Protein Interactions (PPI). This paper provides Motif detection, for PCSK/7/9 and its role in the activation of the protein in cancer. Our purposed approach identifies those motifs which cause different diseases like cancer which provides improved results with less computational time as compared to other methods.", "venue": "International Bhurban Conference on Applied Sciences and Technology", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-01-12", "journal": {"name": "2021 International Bhurban Conference on Applied Sciences and Technologies (IBCAST)", "pages": "445-450"}, "authors": [{"authorId": "11701497", "name": "U. Draz"}, {"authorId": "26806702", "name": "S. Yasin"}, {"authorId": "2047163906", "name": "Shafiq Hussain"}, {"authorId": "1644134465", "name": "Z. Faheem"}, {"authorId": "2054784242", "name": "S. Gul"}, {"authorId": "81150779", "name": "Zanab Safdar"}, {"authorId": "2110012410", "name": "M. Ahmad"}, {"authorId": "2131186325", "name": "Amjad Ali"}], "citations": []}
