{"paperId": "573870b57dcf68296c1202de604acf5ff1a28580", "publicationVenue": {"id": "367a3469-cccd-4e4e-baa8-7d1ff91051a4", "name": "The Journal of Business Analysis", "type": "journal", "alternate_names": ["J Bus Anal", "Journal of Business Analytics"], "issn": "0911-0747", "alternate_issns": ["2573-234X", "2573-2358"], "url": "http://www.tandfonline.com/loi/tjba20", "alternate_urls": ["https://www.tandfonline.com/toc/tjba20/current"]}, "title": "Algorithmic enhancements to identify predictable components from users’ data and a framework to detect misinformation in social media", "abstract": "ABSTRACT The flow of distorted information on social media platforms cannot always be handled. As a result, digital misinformation has become a significant social, political, and technological risk factor. Extant research on detecting misinformation in social networks has focused on using metadata or characteristics of influential actors (users) and their group dynamics in isolation, but less on the act (information content) itself and on developing an integrated approach. We unify them to produce a data science framework to detect valid instances of misinformation from social media such as Twitter. Here we develop novel and efficient algorithmic improvements to extract predictable components from users’ data. The model results demonstrate a significant increase in performance beyond typical incremental improvements. This research proposes a novel term weighting scheme, clique-based features, and a metadata-based feature. These contributions to the data science literature can be helpful for future studies in the social media context.", "venue": "The Journal of Business Analysis", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-18", "journal": {"name": "Journal of Business Analytics", "pages": "112 - 126", "volume": "6"}, "authors": [{"authorId": "46847970", "name": "G. Dixit"}, {"authorId": "153907250", "name": "A. Kushwaha"}], "citations": []}
