{"paperId": "573a9d76f0f929613a01942c75278da305ea6715", "publicationVenue": {"id": "31b2ea45-decb-4c4d-8e3e-683974781c91", "name": "Frontiers in Aging Neuroscience", "type": "journal", "alternate_names": ["Front Aging Neurosci"], "issn": "1663-4365", "url": "http://www.frontiersin.org/aging_neuroscience", "alternate_urls": ["https://www.frontiersin.org/journals/aging-neuroscience", "http://www.frontiersin.org/agingneuroscience/", "http://journal.frontiersin.org/journal/aging-neuroscience"]}, "title": "Diagnostic Performance of Generative Adversarial Network-Based Deep Learning Methods for Alzheimer’s Disease: A Systematic Review and Meta-Analysis", "abstract": "Alzheimer’s disease (AD) is the most common form of dementia. Currently, only symptomatic management is available, and early diagnosis and intervention are crucial for AD treatment. As a recent deep learning strategy, generative adversarial networks (GANs) are expected to benefit AD diagnosis, but their performance remains to be verified. This study provided a systematic review on the application of the GAN-based deep learning method in the diagnosis of AD and conducted a meta-analysis to evaluate its diagnostic performance. A search of the following electronic databases was performed by two researchers independently in August 2021: MEDLINE (PubMed), Cochrane Library, EMBASE, and Web of Science. The Quality Assessment of Diagnostic Accuracy Studies-2 (QUADAS-2) tool was applied to assess the quality of the included studies. The accuracy of the model applied in the diagnosis of AD was determined by calculating odds ratios (ORs) with 95% confidence intervals (CIs). A bivariate random-effects model was used to calculate the pooled sensitivity and specificity with their 95% CIs. Fourteen studies were included, 11 of which were included in the meta-analysis. The overall quality of the included studies was high according to the QUADAS-2 assessment. For the AD vs. cognitively normal (CN) classification, the GAN-based deep learning method exhibited better performance than the non-GAN method, with significantly higher accuracy (OR 1.425, 95% CI: 1.150–1.766, P = 0.001), pooled sensitivity (0.88 vs. 0.83), pooled specificity (0.93 vs. 0.89), and area under the curve (AUC) of the summary receiver operating characteristic curve (SROC) (0.96 vs. 0.93). For the progressing MCI (pMCI) vs. stable MCI (sMCI) classification, the GAN method exhibited no significant increase in the accuracy (OR 1.149, 95% CI: 0.878–1.505, P = 0.310) or the pooled sensitivity (0.66 vs. 0.66). The pooled specificity and AUC of the SROC in the GAN group were slightly higher than those in the non-GAN group (0.81 vs. 0.78 and 0.81 vs. 0.80, respectively). The present results suggested that the GAN-based deep learning method performed well in the task of AD vs. CN classification. However, the diagnostic performance of GAN in the task of pMCI vs. sMCI classification needs to be improved. Systematic Review Registration: [PROSPERO], Identifier: [CRD42021275294].", "venue": "Frontiers in Aging Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-04-21", "journal": {"name": "Frontiers in Aging Neuroscience", "volume": "14"}, "authors": [{"authorId": "2120918931", "name": "Changxing Qu"}, {"authorId": "2163062779", "name": "Yinxi Zou"}, {"authorId": "2163013522", "name": "Yingqiao Ma"}, {"authorId": "18141711", "name": "Qin Chen"}, {"authorId": "2141243442", "name": "Jiawei Luo"}, {"authorId": "3843972", "name": "Huiyong Fan"}, {"authorId": "2417776", "name": "Z. Jia"}, {"authorId": "143838620", "name": "Q. Gong"}, {"authorId": "3646769", "name": "Taolin Chen"}], "citations": [{"paperId": "854f96eda5da7e8d73c224de0c1f676b0f850b78", "title": "Neural Computation-Based Methods for the Early Diagnosis and Prognosis of Alzheimer's Disease Not Using Neuroimaging Biomarkers: A Systematic Review."}, {"paperId": "12027b7c970e7ea47f641269fe04a040ebfb6e27", "title": "Alzheimer’s Disease Detection Using Deep Learning on Neuroimaging: A Systematic Review"}, {"paperId": "c08a6ec2183e0b7f09b733b636073e76ab3bcdc9", "title": "A Hybrid Deep Learning Framework to Predict Alzheimer’s Disease Progression Using Generative Adversarial Networks and Deep Convolutional Neural Networks"}, {"paperId": "5f3f511241f1c1d870af912df3e26507bebc7e13", "title": "Predictive models based on machine learning for bone metastasis in patients with diagnosed colorectal cancer"}]}
