{"paperId": "574c6e260729cf55b28c570fa45cabcbeb40e20c", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Graph Neural Networks for Intelligent Modelling in Network Management and Orchestration: A Survey on Communications", "abstract": "The advancing applications based on machine learning and deep learning in communication networks have been exponentially increasing in the system architectures of enabled software-defined networking, network functions virtualization, and other wired/wireless networks. With data exposure capabilities of graph-structured network topologies and underlying data plane information, the state-of-the-art deep learning approach, graph neural networks (GNN), has been applied to understand multi-scale deep correlations, offer generalization capability, improve the accuracy metrics of prediction modelling, and empower state representation for deep reinforcement learning (DRL) agents in future intelligent network management and orchestration. This paper contributes a taxonomy of recent studies using GNN-based approaches to optimize the control policies, including offloading strategies, routing optimization, virtual network function orchestration, and resource allocation. The algorithm designs of converged DRL and GNN are reviewed throughout the selected studies by presenting the state generalization, GNN-assisted action selection, and reward valuation cooperating with GNN outputs. We also survey the GNN-empowered application deployment in the autonomous control of optical networks, Internet of Healthcare Things, Internet of Vehicles, Industrial Internet of Things, and other smart city applications. Finally, we provide a potential discussion on research challenges and future directions.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-19", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2004408174", "name": "Prohim Tam"}, {"authorId": "2060441000", "name": "Inseok Song"}, {"authorId": "2110946585", "name": "S. Kang"}, {"authorId": "2188539286", "name": "Seyha Ros"}, {"authorId": "2109885845", "name": "Seokhoon Kim"}], "citations": [{"paperId": "8e2a4e239945366bf583ee1c9ebed01498075a79", "title": "Performance Evaluation of Graph Neural Network-Based RouteNet Model with Attention Mechanism"}, {"paperId": "cde9fd0ff54ad70560bf6f626dd9d3d97c3c9d84", "title": "A Survey of Intelligent End-to-End Networking Solutions: Integrating Graph Neural Networks and Deep Reinforcement Learning Approaches"}, {"paperId": "b69c8702730cc120608d4b4ee951e057868a041d", "title": "Toward Greener Smart Cities: A Critical Review of Classic and Machine-Learning-Based Algorithms for Smart Bin Collection"}, {"paperId": "be1a34fde7509fffd7728595eb3d79bb833b76aa", "title": "QoS-Driven Slicing Management for Vehicular Communications"}, {"paperId": "38eeb4465a6260ae5f00d7316361a90d7077f9e7", "title": "Large-Scale Service Function Chaining Management and Orchestration in Smart City"}, {"paperId": "c322b3a3f5814eab6930199beddcc8dff581f3a5", "title": "Radio optical network security analysis with routing in quantum computing for 5G wireless communication using blockchain machine learning model"}, {"paperId": "8e384239971706088fded3324090f4048f417990", "title": "Distributed Machine Learning and Native AI Enablers for End-to-End Resources Management in 6G"}, {"paperId": "1783f42c009210a34583ab65ddc183cf272d1b66", "title": "Traffic Management in IoT Backbone Networks Using GNN and MAB with SDN Orchestration"}, {"paperId": "e0edec56a40719878ecff83c847a083b57641047", "title": "Efficient Non-Sampling Graph Neural Networks"}, {"paperId": "9bbbe05390b1b24bf4fc159b06d5f233bc98ced7", "title": "DRL-Based Backbone SDN Control Methods in UAV-Assisted Networks for Computational Resource Efficiency"}, {"paperId": "1268bf8bbba86570d7ed9ad882d780dedbb1710c", "title": "Graph Neural Network for spatiotemporal data: methods and applications"}, {"paperId": "55219b70adaa3813f87971f4c6dfe829a7157f5e", "title": "Dynamic Resource Allocation for Network Slicing with Multi-Tenants in 5G Two-Tier Networks"}, {"paperId": "096ead4028718b5f00d65552b40f9ca5a33be14c", "title": "From Graph Theory to Graph Neural Networks (GNNs): The Opportunities of GNNs in Power Electronics"}]}
