{"paperId": "5760c2a4411d4bc8c984924812693320a41db5ee", "publicationVenue": {"id": "3413b6f7-e718-4940-a26a-e208f732ada0", "name": "Recent Advances in Natural Language Processing", "type": "conference", "alternate_names": ["RANLP", "Recent Adv Nat Lang Process"]}, "title": "Cultural Topic Modelling over Novel Wikipedia Corpora for South-Slavic Languages", "abstract": "There is a shortage of high-quality corpora for South-Slavic languages. Such corpora are useful to computer scientists and researchers in social sciences and humanities alike, focusing on numerous linguistic, content analysis, and natural language processing applications. This paper presents a workflow for mining Wikipedia content and processing it into linguistically-processed corpora, applied on the Bosnian, Bulgarian, Croatian, Macedonian, Serbian, Serbo-Croatian and Slovenian Wikipedia. We make the resulting seven corpora publicly available. We showcase these corpora by comparing the content of the underlying Wikipedias, our assumption being that the content of the Wikipedias reflects broadly the interests in various topics in these Balkan nations. We perform the content comparison by using topic modelling algorithms and various distribution comparisons. The results show that all Wikipedias are topically rather similar, with all of them covering art, culture, and literature, whereas they contain differences in geography, politics, history and science.", "venue": "Recent Advances in Natural Language Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "910-917"}, "authors": [{"authorId": "2140281222", "name": "Filip Markoski"}, {"authorId": "1413426587", "name": "Elena Markoska"}, {"authorId": "3358706", "name": "Nikola Ljubesic"}, {"authorId": "2128240364", "name": "Eftim Zdravevski"}, {"authorId": "32897253", "name": "Ljupcho Kocarev"}], "citations": [{"paperId": "3761612bfd5064f55dc1bf6157f73f9142225167", "title": "Frame Detection in German Political Discourses: How Far Can We Go Without Large-Scale Manual Corpus Annotation?"}, {"paperId": "1de3571594f509cbecd742c84442449bc8ba1525", "title": "Named Entity Recognition and Knowledge Extraction from Pharmaceutical Texts using Transfer Learning"}]}
