{"paperId": "5765172e7d45f8fe2d069718c430d533d10c5134", "publicationVenue": {"id": "4de03073-5016-45d7-ae66-14cb598cad99", "name": "European Dependable Computing Conference", "type": "conference", "alternate_names": ["EDCC", "Eur Dependable Comput Conf"], "url": "http://www.wikicfp.com/cfp/program?id=831"}, "title": "Predicting Uncorrectable Memory Errors for Proactive Replacement: An Empirical Study on Large-Scale Field Data", "abstract": "Uncorrectable memory errors are the leading causes of server failures in datacenters. Predicting uncorrectable errors (UEs) using the historical correctable error (CE) information helps for proactive replacement of memory hardware before the catastrophic events happen. In this paper, we perform an empirical study of UE prediction on the large-scale field data from more than 30,000 contemporary servers in Tencent datacenters over an 8-month period. We demonstrate that the traditional approach based on CE rate works poorly with a low precision. We then leverage the detail micro-level CE information to design several new predictors. The comparative study shows that the new predictor based on column fault identification boosts the baseline precision for a factor of more than 300% and at the same time also improve the baseline recall substantially.", "venue": "European Dependable Computing Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-01", "journal": {"name": "2020 16th European Dependable Computing Conference (EDCC)", "pages": "41-46"}, "authors": [{"authorId": "46993273", "name": "Xiaoming Du"}, {"authorId": "153228116", "name": "Cong Li"}, {"authorId": "2003803883", "name": "Shen Zhou"}, {"authorId": "2054892313", "name": "Mao Ye"}, {"authorId": "2152913283", "name": "Jing Li"}], "citations": [{"paperId": "b3858e03623303b23e3c81c71664932ca2fa896a", "title": "Structural Coding: A Low-Cost Scheme to Protect CNNs from Large-Granularity Memory Faults"}, {"paperId": "f5b7c9b10f63e3d63e2cea51315325a1421ed7aa", "title": "ML-driven risk estimation for memory failure in a data center environment with convolutional neural networks, self-supervised data labeling and distribution-based model drift determination"}, {"paperId": "53787a15a18df3784ce3d096584d3d219790e37a", "title": "Exploring Error Bits for Memory Failure Prediction: An In-Depth Correlative Study"}, {"paperId": "0b0893c965adbbefd119b08380a7d4038fd1cbe9", "title": "HiMFP: Hierarchical Intelligent Memory Failure Prediction for Cloud Service Reliability"}, {"paperId": "b1f7466baf4bdef90ef710e4c75ae3deab9a1876", "title": "An Optical Transceiver Reliability Study based on SFP Monitoring and OS-level Metric Data"}, {"paperId": "d6e7b64846653fcbfc6419f99418f4263576cd79", "title": "From Correctable Memory Errors to Uncorrectable Memory Errors: What Error Bits Tell"}, {"paperId": "742b3204f3eb80a3766abdea4acc04ffcbe83840", "title": "An In-Depth Correlative Study Between DRAM Errors and Server Failures in Production Data Centers"}, {"paperId": "79aa5f37b37555f0365437e27efffc5fc9e41e4c", "title": "Predicting Uncorrectable Memory Errors from the Correctable Error History: No Free Predictors in the Field"}, {"paperId": "aa0a3c4e9a7419eaf2bc47611763693b2808dbeb", "title": "DPCLS: Improving Partial Cache Line Sparing with Dynamics for Memory Error Prevention"}, {"paperId": "599a278734e2c3523aced12fecdf34d22d001e3a", "title": "STIM: Predicting Memory Uncorrectable Errors with Spatio-Temporal Transformer"}]}
