{"paperId": "5770e9f3527eb1b39ab63c589bbd7a10557363fa", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "A novel deep learning based intrusion detection system for the IoT-Cloud platform with blockchain and data encryption mechanisms", "abstract": "The Internet of Things (IoT) integrated Cloud (IoT-Cloud) has gotten much attention in the past decade. This technology’s rapid growth makes it even more critical. As a result, it has become critical to protect data from attackers to maintain its integrity, confidentiality, protection, privacy, and the procedures required to handle it. Existing methods for detecting network anomalies are typically based on traditional machine learning (ML) models such as linear regression (LR), support vector machine (SVM), and so on. Although these methods can produce some outstanding results, they have low accuracy and rely heavily on manual traffic feature design, which has become obsolete in the age of big data. To overcome such drawbacks in intrusion detection (ID), this paper proposes a new deep learning (DL) model namely Morlet Wavelet Kernel Function included Long Short-Term Memory (MWKF-LSTM), to recognize the intrusions in the IoT-Cloud environment. Initially, to maintain a user’s privacy in the network, the SHA-512 hashing mechanism incorporated a blockchain authentication (SHABA) model is developed that checks the authenticity of every device/user in the network for data uploading in the cloud. After successful authentication, the data is transmitted to the cloud through various gateways. Then the intrusion detection system (IDS) using MWKF-LSTM is implemented to identify the type of intrusions present in the received IoT data. The MWKF-LSTM classifier comes up with the Differential Evaluation based Dragonfly Algorithm (DEDFA) optimal feature selection (FS) model for increasing the performance of the classification. After ID, the non-attacked data is encrypted and stored in the cloud securely utilizing Enhanced Elliptical Curve Cryptography (E2CC) mechanism. Finally, in the data retrieval phase, the user’s authentication is again checked to ensure user privacy and prevent the encrypted data in the cloud from intruders. Simulations and statistical analysis are performed, and the outcomes prove the superior performance of the presented approach over existing models.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-10", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "11707-11724", "volume": "45"}, "authors": [{"authorId": "8580478", "name": "Krishna Kumar Ponniah"}, {"authorId": "7905287", "name": "Bharathi Retnaswamy"}], "citations": []}
