{"paperId": "5776f479de21cfea62017e88b75095c8142148f8", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Deployment and Dimensioning of Fog Computing-Based Internet of Vehicle Infrastructure for Autonomous Driving", "abstract": "Internet of Vehicle (IoV) is an important paradigm to realize the intelligent transportation system. However, with the increasing number of vehicular applications, how to satisfy the ubiquitous requirements of communication and computation is challenging. Fog computing provides the real-time transportation services to local users timely through close-proximity data processing, rather than routing data to a remote central data center in the cloud. More importantly, the fog computing will facilitate the autonomous driving (AD) revolutionarily. This paper investigates the problem of optimal deployment and dimensioning (ODD) of fog computing-based IoV infrastructure for AD. For the ODD problem, we present two diverse architecture modes, i.e., the coupling mode (CRF) and the decoupling mode (DRF), and formulate the ODD problem into two integer linear programming formulations with the objective of minimizing the deployment cost. A heuristic algorithm is also proposed to achieve the suboptimal deployment solution for large-scale fog computing-based IoV. Numerical results show that the DRF is more cost-effective and flexible than the CRF for deployment in practice.", "venue": "IEEE Internet of Things Journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "149-160", "volume": "6"}, "authors": [{"authorId": "1684548", "name": "Cunqian Yu"}, {"authorId": "37821826", "name": "B. Lin"}, {"authorId": "65828613", "name": "P. Guo"}, {"authorId": "2155469861", "name": "Wei Zhang"}, {"authorId": "2117888568", "name": "Sen Li"}, {"authorId": "2350303", "name": "Rongxi He"}], "citations": [{"paperId": "fd7a0e0fca4ae74addec4963a9abeef8e59dbb08", "title": "Five-layer IoT and Fog Computing Framework Towards Digital Twinning of Battery Management Systems for e-Transportation"}, {"paperId": "889d2889cc2b46f6b77a16c1c2a20366f3206fd8", "title": "Position-Based Emergency Message Dissemination Schemes in the Internet of Vehicles: A Review"}, {"paperId": "b0c6a798956feb5212f8660d66f524a83e0ed891", "title": "Fog-ROCL: A Fog based RSU Optimum Configuration and Localization in VANETs"}, {"paperId": "80a6f1dd063d650c061ea5ea9564aee15e48af70", "title": "$\\mathcal {R}$-Tracing: Consortium Blockchain-Based Vehicle Reputation Management for Resistance to Malicious Attacks and Selfish Behaviors"}, {"paperId": "d50dd873e2f5d9f569446d25e4d1b637605583d0", "title": "An Efficient Post-Quantum Multi-Signature Scheme for the Internet of Vehicles"}, {"paperId": "fa79b704f36096b4127d4955e3c62fdb6823bbd3", "title": "A Vehicular Task Offloading Method With Eliminating Redundant Tasks in 5G HetNets"}, {"paperId": "5634cb0bf41bc2caed248fad04c11944a629c59b", "title": "A comprehensive survey on using fog computing in vehicular networks"}, {"paperId": "082a75882ed548ddf550f9c9a794d1d19aa0ef95", "title": "CNN-assisted Road Sign Inspection on the Computing Continuum"}, {"paperId": "ffd2a8dd8d3c962d26ffe14eb5a19bafb50ca62a", "title": "FedDOVe: A Federated Deep Q-learning-based Offloading for Vehicular fog computing"}, {"paperId": "dc05d9b1e038c01a6e9919be158cd4a192ce4566", "title": "Robust and Fault-Tolerant Fog Design and Dimensioning for Reliable Operation"}, {"paperId": "550a2ef1243f47b5b6f1b77660e597bf54e7b5e3", "title": "Energy-and-delay-aware scheduling and load balancing in vehicular fog networks"}, {"paperId": "f248686283acf98baefa2e4dfd70b14ab2d9da94", "title": "Traffic Routing-Based Computation Offloading in Cybertwin-Driven Internet of Vehicles for V2X Applications"}, {"paperId": "be603397cea179272ea0f2ef2db506aa7e5a3d47", "title": "Utilization of Fog Computing in Task Scheduling and Offloading: Modern Growth and Future Challenges"}, {"paperId": "4724f357a5ce76b5dfcda95dfd0ebe116e9d0fb7", "title": "A Comprehensive Survey on the Applications of Blockchain for Securing Vehicular Networks"}, {"paperId": "45d48ed25ee399141ca0af63158c45751f004938", "title": "Intelligent transportation systems (ITS): A systematic review using a Natural Language Processing (NLP) approach"}, {"paperId": "6919a8460b79dd57fc7de689f7a4b01b0f5c5efc", "title": "Video Service-Oriented Vehicular Collaboration: A Multi-Agent Proximal Policy Optimization Approach"}, {"paperId": "2fc5a8e129cb23acf782b5618d39fc62efcb3c01", "title": "Blockchain-Based Authentication in Internet of Vehicles: A Survey"}, {"paperId": "d25e586bb58a9153feeb96b3e192a1ae8ada297a", "title": "An Intelligent Multimode Clustering Mechanism Using Driving Pattern Recognition in Cognitive Internet of Vehicles"}, {"paperId": "71dc4a92d7ec003dbcc7b114d31cd39d87f1a7a4", "title": "Task Offloading with Task Classification and Offloading Nodes Selection for MEC-Enabled IoV"}, {"paperId": "6f46aa5b6f07fcb80dda8711f232d62b6fadfe16", "title": "Enhanced Adaptive Cruise Control Strategy for Improving Driving Safety in Connected Vehicle Environment"}, {"paperId": "4b5626046a13b51cb21fcea98acbccb0259391bd", "title": "MQTT Pub-Sub Service for Connected Vehicles"}, {"paperId": "1d418d8517cfe36704fadc90853a917087976869", "title": "DND: Driver Node Detection for Control Message Diffusion in Smart Transportations"}, {"paperId": "e01cc9ee68b3ef53d0243d752397ec01440bec34", "title": "A Hybrid-Equivalent Surface-Edge Current Model for Simulation of V2X Communication Antennas With Arbitrarily Shaped Contour"}, {"paperId": "d9077c29c1e4adf0b7e25aaedcf8e53c228aa8cd", "title": "Distributed Information Exchange With Low Latency for Decision Making in Vehicular Fog Computing"}, {"paperId": "5a779256ea503a3223147fb934174640c0cc13ae", "title": "Fog Node Optimum Placement and Configuration Technique for VANETs"}, {"paperId": "6d327aeab0e5fea6c6407d9d37c3d925746dcf1e", "title": "Research on task-offloading decision mechanism in mobile edge computing-based Internet of Vehicle"}, {"paperId": "d654b9ad5cad234240af9b187579d06ef5b60863", "title": "Design, Resource Management, and Evaluation of Fog Computing Systems: A Survey"}, {"paperId": "7272ce524ddff09bd796443815d73f718094b8d3", "title": "A Two-Tier Collection and Processing Scheme for Fog-Based Mobile Crowdsensing in the Internet of Vehicles"}, {"paperId": "5080cd42cd516b47b89604e114c6e4bb32dd01c2", "title": "Fog-Based Distributed Networked Control for Connected Autonomous Vehicles"}, {"paperId": "10a755d6e56112cc86509ae2137f833338df2cf2", "title": "The Relocation of Lost Unmanned Combat Vehicle in One Group Based on Fog Computing Method"}, {"paperId": "77905991a4e53de671c289f12cdfc3e3f6e16ea9", "title": "A Hierarchical Vehicular-Based Architecture for Vehicular Networks: A Case Study on Computation Offloading"}, {"paperId": "147e529503c5a129d35f25034d3b08e1ab66798f", "title": "Computation and Sensor Offloading for Cloud-Based Infrastructure-Assisted Autonomous Vehicles"}, {"paperId": "9edb30bcd6b83e64eb1b3e2b1a4a26c4ac381734", "title": "An active safety control method of collision avoidance for intelligent connected vehicle based on driving risk perception"}, {"paperId": "2f18356ec6ffca0e9ad4636e6be28ce112fc52d2", "title": "Elevated LiDAR Placement under Energy and Throughput Capacity Constraints"}, {"paperId": "0d7fc3b8b083ebb6bf6f75f8cf3efdaaba72767f", "title": "Scalable Design and Dimensioning of Fog-Computing Infrastructure to Support Latency-Sensitive IoT Applications"}, {"paperId": "49a8f22ca645b1908d8890ec8e8ab51521f6faf9", "title": "The L3Pilot Data Management Toolchain for a Level 3 Vehicle Automation Pilot"}, {"paperId": "4d4a320b59a80fe1b21bcf0645cc8801b60a4b86", "title": "Simulating FogDirector Application Management"}, {"paperId": "9eac357b323b58ec20a85ae08d54bfe251e7e471", "title": "Reliable Computation Offloading for Edge-Computing-Enabled Software-Defined IoV"}, {"paperId": "b7f480d24ead950329bdca54b5793f89a462de8e", "title": "An Infrastructure-Assisted Workload Scheduling for Computational Resources Exploitation in the Fog-Enabled Vehicular Network"}, {"paperId": "344b3e19ee1695bc8f8aea83b6e5b2c062016df1", "title": "Fog-Computing-Based Approximate Spatial Keyword Queries With Numeric Attributes in IoV"}, {"paperId": "c2816f919f91e72a1ca1d65bda46b7c2c6a0b90f", "title": "Edge Computing for Intelligent Transportation System: A Review"}, {"paperId": "faf048710999081f29c77ded0a5eb9c38e54f6c1", "title": "An efficient certificateless aggregate signature scheme for the Internet of Vehicles"}, {"paperId": "1660c8137099b2f8090880a84670f106fc3c5ba9", "title": "A Millimeter Wave-Based Sensor Data Broadcasting Scheme for Vehicular Communications"}, {"paperId": "2a6459d12bc80b49bb1b802be38a29df0364b67a", "title": "Mobile Edge Intelligence and Computing for the Internet of Vehicles"}, {"paperId": "99213bd2d4348fbe3c9114342d8902d2edbb7f7e", "title": "Fast Simulation of Vehicular Antennas for V2X Communication Using the Sparse Equivalent Source Model"}, {"paperId": "00b439529cbb3f51f6ac2469ef526299341ccf37", "title": "Edge-MapReduce-Based Intelligent Information-Centric IoV: Cognitive Route Planning"}, {"paperId": "2b6820ee7c9c72860660fe9200286c265639f5c8", "title": "Allocation of Computation-Intensive Graph Jobs Over Vehicular Clouds in IoV"}, {"paperId": "369b16810cf54a77cc25793942b99537da1e0c1a", "title": "EC-BAAS: Elliptic curve-based batch anonymous authentication scheme for Internet of Vehicles"}, {"paperId": "6cec61a9718269b2df9e4f33969b6bde04550b6e", "title": "International Journal of Science and Business"}, {"paperId": "aa33bd26db5fc52a9039b4a43accbc2126798f80", "title": "Dimensioning and Layout Planning of 5G-Based Vehicular Edge Computing Networks Towards Intelligent Transportation"}, {"paperId": "26b835229cfd8816121bf9dc4f04e80f320bbc4e", "title": "Auction Based Secure Computation Offloading in Vehicular Networks"}]}
