{"paperId": "577ac26cb25859343decca77c138efa9134231b0", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Method with Adaptive Graphs to Constrain Multi-View Subspace Clustering of Geospatial Big Data from Multiple Sources", "abstract": "Clustering of multi-source geospatial big data provides opportunities to comprehensively describe urban structures. Most existing studies focus only on the clustering of a single type of geospatial big data, which leads to biased results. Although multi-view subspace clustering methods are advantageous for fusing multi-source geospatial big data, exploiting a robust shared subspace in high-dimensional, non-uniform, and noisy geospatial big data remains a challenge. Therefore, we developed a method with adaptive graphs to constrain multi-view subspace clustering of multi-source geospatial big data (agc2msc). First, for each type of data, high-dimensional and noisy original features were projected into a low-dimensional latent representation using autoencoder networks. Then, adaptive graph constraints were used to fuse the latent representations of multi-source data into a shared subspace representation, which preserved the neighboring relationships of data points. Finally, the shared subspace representation was used to obtain the clustering results by employing a spectral clustering algorithm. Experiments on four benchmark datasets showed that agc2msc outperformed nine state-of-the-art methods. agc2msc was applied to infer urban land use types in Beijing using the taxi GPS trajectory, bus smart card transaction, and points of interest datasets. The clustering results may provide useful calibration and reference for urban planning.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-03", "journal": {"name": "Remote. Sens.", "pages": "4394", "volume": "14"}, "authors": [{"authorId": "3228724", "name": "Qiliang Liu"}, {"authorId": "2106529886", "name": "Weihua Huan"}, {"authorId": "46397265", "name": "M. Deng"}], "citations": [{"paperId": "018faff8501796c68b9677106909b876360f7809", "title": "Literature Review on the Smart City Resources Analysis with Big Data Methodologies"}, {"paperId": "280fd9d5f4a66e743fa71ba66c94fece937b0e56", "title": "Sensing Travel Source-Sink Spatiotemporal Ranges Using Dockless Bicycle Trajectory via Density-Based Adaptive Clustering"}]}
