{"paperId": "5787eb70a1b67a7d3af815fdfe2bbb63ca12e225", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "Generalized Sub-Query Fusion for Eliminating Redundant I/O from Big-Data Queries", "abstract": "SQL is the de-facto language for big-data analytics. Despite the cost of distributed SQL execution being dominated by disk and network I/O, we find that state-of-the-art optimizers produce plans that are not I/O optimal. For a significant fraction of queries (25% of popular benchmarks like TPCDS), a large amount of data is shuffled redundantly between different pairs of stages. The fundamental reason for this limitation is that optimizers do not have the right set of primitives to perform reasoning at the map-reduce level that can potentially identify and eliminate the redundant I/O. This paper proposes resin, an optimizer extension that adds first-class support for map-reduce reasoning. Resin uses a novel technique called Generalized Sub-Query Fusion that identifies sub-queries computing on overlapping data, and fuses them into the same map-reduce stages. The analysis is general; it does not require that the sub-queries be syntactically the same, nor are they required to produce the same output. Sub-query fusion allows resin to sometimes also eliminate expensive binary operations like Joins and Unions altogether for further gains. We have integrated resin into sparkSQL and evaluated it on TPCDS, a standard analytics benchmark suite. Our results demonstrate that the proposed optimizations apply to 40% of the queries and speed up a large fraction of them by 1.1-6x, reducing the overall execution time of the benchmark suite by 12%.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-23", "journal": {"pages": "209-224"}, "authors": [{"authorId": "47157377", "name": "Parth Sarthi"}, {"authorId": "30141706", "name": "K. Rajan"}, {"authorId": "1941367", "name": "A. Lal"}, {"authorId": "2063982599", "name": "Abhishek Modi"}, {"authorId": "2066976671", "name": "Prakhar Jain"}, {"authorId": "49353938", "name": "Mo Liu"}, {"authorId": "1395157337", "name": "Ashit Gosalia"}, {"authorId": "2254908", "name": "S. Kalikar"}], "citations": [{"paperId": "99867ddb1918178b18546b496d3601054a163d51", "title": "A Multi-tenant Key-value SSD with Secondary Index for Search Query Processing and Analysis"}, {"paperId": "4d468c7b4345fcd25d40ca67313a743e6e164444", "title": "HGL: Accelerating Heterogeneous GNN Training with Holistic Representation and Optimization"}, {"paperId": "ada94a2ab3fc264ceeaffc0a9937af07bfd54937", "title": "Computation Reuse via Fusion in Amazon Athena"}]}
