{"paperId": "57980255798f84b38c616a126d61f7e38892816e", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "uPredict: A User-Level Profiler-Based Predictive Framework for Single VM Applications in Multi-Tenant Clouds", "abstract": "Most existing studies on performance prediction for virtual machines (VMs) in multi-tenant clouds are at system level and generally require access to performance counters in Hypervisors. In this work, we propose uPredict, a user-level profiler-based performance predictive framework for single-VM applications in multi-tenant clouds. Here, three micro-benchmarks are specially devised to assess the contention of CPUs, memory and disks in a VM, respectively. Based on measured performance of an application and micro-benchmarks, the application and VM-specific predictive models can be derived by exploiting various regression and neural network based techniques. These models can then be used to predict the application's performance using the in-situ profiled resource contention with the micro-benchmarks. We evaluated uPredict extensively with representative benchmarks from PARSEC, NAS Parallel Benchmarks and CloudSuite, on both a private cloud and two public clouds. The results show that the average prediction errors are between 9.8% to 17% for various predictive models on the private cloud with high resource contention, while the errors are within 4% on public clouds. A smart load-balancing scheme powered by uPredict is presented and can effectively reduce the execution and turnaround times of the considered application by 19% and 10%, respectively.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-13", "journal": {"name": "ArXiv", "volume": "abs/1908.04491"}, "authors": [{"authorId": "153889781", "name": "Hamidreza Moradi"}, {"authorId": "39253519", "name": "Wei Wang"}, {"authorId": "144391871", "name": "Amanda Fernandez"}, {"authorId": "1721468", "name": "Dakai Zhu"}], "citations": [{"paperId": "d1c452686238e8bccd8261bb3e2f4f3db5d11703", "title": "Online Performance Modeling and Prediction for Single-VM Applications in Multi-Tenant Clouds"}, {"paperId": "87c6d2a92a1b732bf4ac087d6ae7aa9c3f3ca5c2", "title": "Prediction of resource contention in cloud using second order Markov model"}, {"paperId": "1d17cee4991bd248b6fa6c11ba9c3632c73e9b47", "title": "Identifying Incident Causal Factors to Improve Aviation Transportation Safety: Proposing a Deep Learning Approach"}, {"paperId": "c47a9040fdf33ea4da9c7ffb95ab84cf6b9efbfc", "title": "DiHi: Distributed and Hierarchical Performance Modeling of Multi-VM Cloud Running Applications"}, {"paperId": "1bcf5d85aa2d11f2f844feb9cda6c100c92dac30", "title": "Cross-Domain Workloads Performance Prediction via Runtime Metrics Transferring"}, {"paperId": "47244189ac32ac724e9dcfba7d50cf36accf8c85", "title": "uPredict: A User-Level Profiler-Based Predictive Framework in Multi-Tenant Clouds"}, {"paperId": "9f81ac1fcb61009c239af3ef1a86764e596f88a3", "title": "Identifying Incident Casual Factors to Improve Aviation Transportation Safety: Proposing a Deep Learning Approach"}, {"paperId": "5ec117cad863af52e8c0d29e57817d7934a5499d", "title": "Proactive Virtual Machine Scheduling to Optimize the Energy Consumption of Computational Cloud"}, {"paperId": "2983f7cd9acec96bf91ad37e84a4e5a87f3775b3", "title": "Digital Commons @ Trinity Digital Commons @ Trinity"}]}
