{"paperId": "579b236b34e4d50bfa6c47fa96bc48d4a9603e70", "publicationVenue": {"id": "fcad2179-afdc-4360-ad8b-8b714f64dab3", "name": "AIMS Mathematics", "alternate_names": ["AIM Math"], "issn": "2473-6988", "url": "https://www.aimspress.com/journal/Math", "alternate_urls": ["https://www.aimspress.com/journal/Math/archive.html"]}, "title": "Enhanced evolutionary approach for solving fractional difference recurrent neural network systems: A comprehensive review and state of the art in view of time-scale analysis", "abstract": "The present research deals with a novel three-dimensional fractional difference neural network model within undamped oscillations. Both the frequency and the amplitude of movements in equilibrium are subsequently estimated mathematically for such structures. According to the stability assessment, the thresholds of the fractional order were determined where bifurcations happen, and an assortment of fluctuations bifurcate within an insignificant equilibrium state. For such discrete fractional-order connections, the parameterized spectrum of undamped resonances is also predicted, and the periodicity and strength of variations are calculated computationally and numerically. Several qualitative techniques, including the Lyapunov exponent, phase depictions, bifurcation illustrations, the $ 0-1 $ analysis and the approximate entropy technique, have been presented with the rigorous analysis. These outcomes indicate that the suggested discrete fractional neural network model has crucial as well as complicated dynamic features that have been affected by the model's variability, both in commensurate and incommensurate cases. Furthermore, the approximation entropy verification and $ \\mathbb{C}_{0} $ procedure are used to assess variability and confirm the emergence of chaos. Ultimately, irregular controllers for preserving and synchronizing the suggested framework are highlighted.", "venue": "AIMS Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "AIMS Mathematics"}, "authors": [{"authorId": "104307801", "name": "Hanan S. Gafel"}, {"authorId": "46857491", "name": "S. Rashid"}], "citations": []}
