{"paperId": "57caeb410d54785c0cb4443f2e7572953ebe4bdd", "publicationVenue": {"id": "eac972b5-2d1a-4c5a-98a2-c1e373f09163", "name": "International Conference on the Theory of Information Retrieval", "type": "conference", "alternate_names": ["Int Conf Theory Inf Retr", "ICTIR"], "url": "http://www.wikicfp.com/cfp/program?id=1494"}, "title": "A Signaling Game Approach to Databases Querying and Interaction", "abstract": "As most database users cannot precisely express their information needs, it is challenging for database querying and exploration interfaces to understand them. We propose a novel formal framework for representing and understanding information needs in database querying and exploration. Our framework considers querying as a collaboration between the user and the database system to establish a mutual language for representing information needs. We formalize this collaboration as a signaling game, where each mutual language is an equilibrium for the game. A query interface is more effective if it establishes a less ambiguous mutual language faster. We discuss some equilibria, strategies, and the convergence rates in this game. In particular, we propose a reinforcement learning mechanism and analyze it within our framework. We prove that this adaptation mechanism for the query interface improves the effectiveness of answering queries stochastically speaking, and converges almost surely.", "venue": "International Conference on the Theory of Information Retrieval", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2015-09-27", "journal": {"name": "Proceedings of the 2015 International Conference on The Theory of Information Retrieval"}, "authors": [{"authorId": "3192362", "name": "Arash Termehchy"}, {"authorId": "1774385", "name": "B. Touri"}], "citations": [{"paperId": "6027391da4b023d0e2e9046b5238f10610294433", "title": "A Game-theoretic Approach to Data Interaction"}, {"paperId": "11d0a9fce3210b81b714f347dbef7e2419a20832", "title": "The Data Interaction Game"}, {"paperId": "751c687384b6e8b0fd8679161dcfe0f5dad4f889", "title": "The Data Exploration Game"}, {"paperId": "cee19c4f419e7a0bb0b7d0ec450a08b6185bdcd5", "title": "A Game-theoretic Approach to Data Interaction: A Progress Report"}, {"paperId": "dda199bcb834114bcf1a7a58be5bb6e46a93888b", "title": "Interactive Data Exploration of Distributed Raw Files: A Systematic Mapping Study"}, {"paperId": "e0275726db5badb308842d43582b4519d76946ae", "title": "Dynamic Search Models and Applications"}]}
