{"paperId": "57cb09afec65031ab95a3db17f02c38118a2ac36", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "GADY: Unsupervised Anomaly Detection on Dynamic Graphs", "abstract": "Anomaly detection on dynamic graphs refers to detecting entities whose behaviors obviously deviate from the norms observed within graphs and their temporal information. This field has drawn increasing attention due to its application in finance, network security, social networks, and more. However, existing methods face two challenges: dynamic structure constructing challenge - difficulties in capturing graph structure with complex time information and negative sampling challenge - unable to construct excellent negative samples for unsupervised learning. To address these challenges, we propose Unsupervised Generative Anomaly Detection on Dynamic Graphs (GADY). To tackle the first challenge, we propose a continuous dynamic graph model to capture the fine-grained information, which breaks the limit of existing discrete methods. Specifically, we employ a message-passing framework combined with positional features to get edge embeddings, which are decoded to identify anomalies. For the second challenge, we pioneer the use of Generative Adversarial Networks to generate negative interactions. Moreover, we design a loss function to alter the training goal of the generator while ensuring the diversity and quality of generated samples. Extensive experiments demonstrate that our proposed GADY significantly outperforms the previous state-of-the-art method on three real-world datasets. Supplementary experiments further validate the effectiveness of our model design and the necessity of each module.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-25", "journal": {"name": "ArXiv", "volume": "abs/2310.16376"}, "authors": [{"authorId": "2258717872", "name": "Shiqi Lou"}, {"authorId": "2261664149", "name": "Qingyue Zhang"}, {"authorId": "2169372154", "name": "Shujie Yang"}, {"authorId": "2261492343", "name": "Yuyang Tian"}, {"authorId": "2093186816", "name": "Zhaoxuan Tan"}, {"authorId": "2260397981", "name": "Minnan Luo"}], "citations": []}
