{"paperId": "57d1a5e8b93c319fbd6fcefcb6c1007fd61126c3", "publicationVenue": null, "title": "Evaluation of OBDII data contribution in Tiny Machine Learning based Driving Behaviour Monitoring", "abstract": "Real-time monitoring of driving behaviors is extremely important for insurance companies, car rental companies, or as part of smart city solutions to prevent accidents and regulate traffic. For such applications, it is important to be able to perform split-second calculations that provide specific information on driver behavior. To this purpose, the use of artificial intelligence is of crucial importance, since it specifically allows the classification of a driver's style in fractions of a second while he is driving. In this work, two models of CNN (Convolutional Neural Networks) were trained through a Tiny Machine Learning approach using two different datasets. The first one is obtained using only a 3D accelerometer and a gyroscope, while the second also includes data from On-Board Diagnostic (OBD) port in which data are extracted directly from the Engine Control Unit (ECM). The two systems were compared by carrying out an efficiency analysis which led to important results in terms of optimization. Although the first model already demonstrates good efficiency in classifying the various driving styles, the model using the OBD introduces significant advantages in terms of both accuracy and the computational time required for classification.", "venue": "2022 7th International Conference on Smart and Sustainable Technologies (SpliTech)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-05", "journal": {"name": "2022 7th International Conference on Smart and Sustainable Technologies (SpliTech)", "pages": "1-6"}, "authors": [{"authorId": "34547690", "name": "M. Merenda"}, {"authorId": "2135781657", "name": "Vincenzo Mazzullo"}, {"authorId": "1393715482", "name": "M. Princi"}, {"authorId": "2052557207", "name": "Antonio Martino"}, {"authorId": "32846283", "name": "R. Carotenuto"}, {"authorId": "31174303", "name": "D. Iero"}], "citations": [{"paperId": "ab9914198d501b3a8c830c732d0fc5a37c5fd8c4", "title": "A Method for Correcting Signal Aberrations in Ultrasonic Indoor Positioning"}]}
