{"paperId": "57d4526c096640528faf7a55a2ad553448ee90a3", "publicationVenue": {"id": "d7907408-25bc-4816-a81d-4e0f2f6482c8", "name": "IEEE Working Conference on Mining Software Repositories", "type": "conference", "alternate_names": ["IEEE Work Conf Min Softw Repos", "Min Softw Repos", "Mining Software Repositories", "MSR"], "url": "https://dl.acm.org/conference/icse/proceedings"}, "title": "Does Code Review Promote Conformance? A Study of OpenStack Patches", "abstract": "Code Review plays a crucial role in software quality, by allowing reviewers to discuss and critique any new patches before they can be successfully integrated into the project code. Yet, it is unsure the extent to which coding pattern changes (i.e., repetitive code) from when a patch is first submitted and when the decision is made (i.e., during the review process). In this study, we revisit coding patterns in code reviews, aiming to analyze whether or not the coding pattern changes during the review process. Comparing prior submitted patches, we measure differences in coding pattern between pre-review (i.e., patch before the review) and post-review (i.e., patch after a review) from 27,736 reviewed OpenStack patches. Results show that patches after review, tend to conform to similar coding patterns of accepted patches, compared to when they were first submitted. We also find that accepted patches do have similar coding patterns to prior accepted patches. Our study reveals insights into the review process, supporting the potential for automated tool support for newcomers and lays the groundwork for work into understanding conformance and how it makes for an efficient code review process.", "venue": "IEEE Working Conference on Mining Software Repositories", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2021-03-15", "journal": {"name": "2021 IEEE/ACM 18th International Conference on Mining Software Repositories (MSR)", "pages": "444-448"}, "authors": [{"authorId": "2048026102", "name": "P. Sri-iesaranusorn"}, {"authorId": "1680034", "name": "R. Kula"}, {"authorId": "145682543", "name": "T. Ishio"}], "citations": [{"paperId": "7490c181091f88a368ba711e38a2e54bcba78c5b", "title": "Modern Code Reviews—Survey of Literature and Practice"}, {"paperId": "d1988265d634962b4682dc2b1ff8200cbf0eb9eb", "title": "Pitfalls and guidelines for using time-based Git data"}]}
