{"paperId": "57ef75b67505cefcc9adadbd36bb8e745c4206ee", "publicationVenue": {"id": "18cb41bf-d23d-4c47-a30d-3f1ef6abfb1b", "name": "IoT", "issn": "2624-831X", "url": "https://www.mdpi.com/journal/IoT"}, "title": "A Review on Scaling Mobile Sensing Platforms for Human Activity Recognition: Challenges and Recommendations for Future Research", "abstract": "Mobile sensing has been gaining ground due to the increasing capabilities of mobile and personal devices that are carried around by citizens, giving access to a large variety of data and services based on the way humans interact. Mobile sensing brings several advantages in terms of the richness of available data, particularly for human activity recognition. Nevertheless, the infrastructure required to support large-scale mobile sensing requires an interoperable design, which is still hard to achieve today. This review paper contributes to raising awareness of challenges faced today by mobile sensing platforms that perform learning and behavior inference with respect to human routines: how current solutions perform activity recognition, which classification models they consider, and which types of behavior inferences can be seamlessly provided. The paper provides a set of guidelines that contribute to a better functional design of mobile sensing infrastructures, keeping scalability as well as interoperability in mind.", "venue": "IoT", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-11-29", "journal": {"name": "IoT"}, "authors": [{"authorId": "49963753", "name": "Liliana Carvalho"}, {"authorId": "32789289", "name": "Rute C. Sofia"}], "citations": [{"paperId": "46494d9582a7e84e3235c212dbeda7999df85a57", "title": "Deep Learning for Human Activity Recognition on 3D Human Skeleton: Survey and Comparative Study"}, {"paperId": "8fc8aebe5d7c59c619f460222e998dda1ddd931f", "title": "A Review of Multidata Human Activity Recognition"}, {"paperId": "756832ca7f7c79bb681ed68a9c1c34273e016918", "title": "Toward a sustained recovery of the lodging sector: a management path to lessen the Corona Variants upshots"}, {"paperId": "a9559aacb0ab2591c635ceea604a756dc9f7145c", "title": "An Analysis of ML-Based Outlier Detection from Mobile Phone Trajectories"}, {"paperId": "f565b666f90e95640afe9426763699e43a4cc01a", "title": "Gamified Mobile Sensing Storytelling Application for Enhancing Remote Cultural Experience and Engagement"}, {"paperId": "ccd561625ae82694965d6cbc724086d5f0e00db9", "title": "Human activity recognition in artificial intelligence framework: a narrative review"}, {"paperId": "2e09332f7d0fdf972f7d7124587e3a59dc44b5df", "title": "A Mini-Survey and Feasibility Study of Deep-Learning-Based Human Activity Recognition from Slight Feature Signals Obtained Using Privacy-Aware Environmental Sensors"}]}
