{"paperId": "58028a88d76d627683da41630802cad6c905ef2a", "publicationVenue": null, "title": "Blockchain Technology Based Secure Data Sharing in Cloud Computing", "abstract": "Cloud computing has become an essential technology for delivering infrastructure and data service needs with lower cost, low effort and high scalability, hence it is increasingly implemented in all aspects of the IT industry. Despite the quick adoption of cloud computing, the problem of information security is still not fully resolved. Information security issues are still hampering the evolution of cloud computing to some extent and need to be addressed. Blockchain is one of the decentralized processes in a worldview that works with parallel and distributed ledger technology, the application process, and service-oriented design. However, the primary security issue is key leakage and third parties easily hack the secured information. To address this issues, in this novel presents Blockchain based Proof of staking with Elliptic Curve Encryption (BPECE) algorithm is used to secure data transmission in the cloud. This proposed method efficiently checks each node verification using Policy based Key Authentication (PBKA) algorithm. The proposed technique generates public key for each document. Thus the proposed method gives better security performance than previous methods.", "venue": "2022 International Conference on Knowledge Engineering and Communication Systems (ICKES)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-28", "journal": {"name": "2022 International Conference on Knowledge Engineering and Communication Systems (ICKES)", "pages": "1-5"}, "authors": [{"authorId": "2094122797", "name": "Saurabh Lahoti"}, {"authorId": "2180801498", "name": "Dhiraj Singh"}], "citations": [{"paperId": "1f34d3361f6030a909ac8336ede61713b4078c26", "title": "Utilizing Blockchain Technology in Various Applications to Secure Data Flows. A Comprehensive Analysis"}]}
