{"paperId": "5802c24882078faa2a79f423bb511bdc4be83c05", "publicationVenue": {"id": "e5a2b19d-fb81-4009-8dc2-9aeb2643d906", "name": "Knowledge Engineering and Data Science", "alternate_names": ["Knowl Eng Data Sci"], "issn": "2597-4602", "url": "http://journal2.um.ac.id/index.php/keds/index"}, "title": "Parallelization of Partitioning Around Medoids (PAM) in K-Medoids Clustering on GPU", "abstract": "K-medoids clustering is categorized as partitional clustering. K-medoids offers better result when dealing with outliers and arbitrary distance metric also in the situation when the mean or median does not exist within data. However, k-medoids suffers a high computational complexity. Partitioning Around Medoids (PAM) has been developed to improve k-medoids clustering, consists of build and swap steps and uses the entire dataset to find the best potential medoids. Thus, PAM produces better medoids than other algorithms. This research proposes the parallelization of PAM in k-medoids clustering on GPU to reduce computational time at the swap step of PAM. The parallelization scheme utilizes shared memory, reduction algorithm, and optimization of the thread block configuration to maximize the occupancy. Based on the experiment result, the proposed parallelized PAM k-medoids is faster than CPU and Matlab implementation and efficient for large dataset.", "venue": "Knowledge Engineering and Data Science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-17", "journal": {"name": "Knowl. Eng. Data Sci.", "pages": "40-49", "volume": "3"}, "authors": [{"authorId": "9643927", "name": "A. Prahara"}, {"authorId": "9730852", "name": "Dewi Pramudi Ismi"}, {"authorId": "145304492", "name": "Ahmad Azhari"}], "citations": [{"paperId": "9dd4161be39e736fd26be6f0b706e8dd11f3d6d9", "title": "Parallel Clustering Algorithm for the k-medoids Problem in High-dimensional Space for Large-scale Datasets"}, {"paperId": "d420a019079cbf79e42d78001975abe407a9b4e2", "title": "Analysis of Seismic Data Using Partition-Based Clustering Techniques"}, {"paperId": "00769ea7aa5824ead4c72d0b3144912d0d6f573b", "title": "How heterogeneous is the dengue transmission profile in Brazil? A study in six Brazilian states"}, {"paperId": "3c3f639dacfd9d4d06cae006f6eba3b919f808ec", "title": "Optimizing the Division of Study Class Groups Using the Partitioning Around Medoids (PAM) Method"}, {"paperId": "1847e440117a87df3086db8914448b12baac199d", "title": "GPU-FAST-PROCLUS: A Fast GPU-parallelized Approach to Projected Clustering"}, {"paperId": "9526766ee23effdcbc12240d27657c7a05ae5d3c", "title": "A Comparative Review of Incremental Clustering Methods for Large Dataset"}]}
