{"paperId": "580ce7f72d2257e97558bb610a28070d81bf4999", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Graph-Native Query Optimization Framework", "abstract": "Graph queries that combine pattern matching with relational operations, referred as PatRelQuery, are widely used in many real-world applications. It allows users to identify arbitrary patterns in a graph and further perform in-depth relational analysis on the results. To effectively support PatRelQuery, two key challenges need to be addressed: (1) how to optimize PatRelQuery in a unified framework, and (2) how to handle the arbitrary type constraints in patterns in PatRelQuery. In this paper, we present a graph-native query optimization framework named GOpt, to tackle these issues. GOpt is built on top of a unified intermediate representation (IR) that is capable of capturing both graph and relational operations, thereby streamlining the optimization of PatRelQuery. To handle the arbitrary type constraints, GOpt employs an automatic type inference approach to identify implicit type constraints. Additionally, GOpt introduces a graph-native optimizer, which encompasses an extensive collection of optimization rules along with cost-based techniques tailored for arbitrary patterns, to optimize PatRelQuery. Through comprehensive experiments, we demonstrate that GOpt can achieve significant query performance improvements, in both crafted benchmarks and real-world applications.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-31", "journal": {"name": "ArXiv", "volume": "abs/2401.17786"}, "authors": [{"authorId": "3418946", "name": "Bingqing Lyu"}, {"authorId": "2109664952", "name": "Xiaoli Zhou"}, {"authorId": "2275238045", "name": "Longbin Lai"}, {"authorId": "2282090916", "name": "Yufan Yang"}, {"authorId": "2281947799", "name": "Yunkai Lou"}, {"authorId": "2275047599", "name": "Wenyuan Yu"}, {"authorId": "2239750410", "name": "Jingren Zhou"}], "citations": []}
