{"paperId": "581067fe07998e8dc1255e96814a3258157e88d5", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "FAMU: Fault-Tolerant Mutual Assisted Virtual Emotion Barrier System Using Intelligent Smart UAVs", "abstract": "Recently, a concept of virtual emotion barrier by wireless signal gained a lot of interests because it supports human emotion recognition within given IoT environment. If detection of human emotion can be made with possibly high detection accuracy by virtual emotion barrier, it can be utilized to an extensive scope of emotion-based applications and communication software services. But, some IoT devices failures in the barrier may cause emotion-based system performance degradation critically. Also, thanks to recent advent of technology, intelligent smart UAVs with rapid speed are considered as promising devices when existing infrastructures are recovered. In this study, fault-tolerant mutual assisted virtual emotion barrier system is introduced with intelligent autonomous UAVs in convergent smart cities. Moreover, we present a formal definition of the problem whose goal is maximizing entire total accuracy of emotion detection where the failed locations are recovered by UAVs’ movement from initial locations without any potential conflicts among UAVs. A greedy UAV movement scheme that constructs resilient virtual emotion barriers is proposed by handling those failed parts in the barriers continuously. Moreover, the proposed schemes are executed by comprehensive simulations with useful scenarios and we evaluate the earned outcome.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "10845-10852", "volume": "70"}, "authors": [{"authorId": "1997150", "name": "Hyunbum Kim"}, {"authorId": "1397992020", "name": "J. Ben-othman"}], "citations": [{"paperId": "586777518f1fea996ada4749ab2457defe19edc9", "title": "Intelligent Cellular Offloading With VLC-Enabled Unmanned Aerial Vehicles"}, {"paperId": "651f67dbdc1361e7ca3a08efc32cc441bec1d2a5", "title": "Convex Hull Obstacle-Aware Pedestrian Tracking and Target Detection in Theme Park Applications"}, {"paperId": "91000aa853d39b9156b5659c77a2992ad2517c2a", "title": "Intelligent Reflecting Surface Backscatter Enabled Multi-Tier Computing for 6G Internet of Things"}, {"paperId": "9a916c247350fb2be11fcea8409dfab26d81a1a0", "title": "Eco-Friendly Low Resource Security Surveillance Framework Toward Green AI Digital Twin"}, {"paperId": "23de444d37ef82ba0eb574ecd70c1862ede5fa56", "title": "Trustworthy clash-free surveillance using virtual emotion detection in 6G-assisted graded districts"}]}
