{"paperId": "5816ff58cd5056a9753d159ac106bb5cc9e84d3b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Network-Level Safety Metrics for Overall Traffic Safety Assessment: A Case Study", "abstract": "Driving safety analysis has recently experienced unprecedented improvements thanks to technological advances in precise positioning sensors, artificial intelligence (AI)-based safety features, autonomous driving systems, connected vehicles, high-throughput computing, and edge computing servers. Particularly, deep learning (DL) methods empowered volume video processing to extract safety-related features from massive videos captured by roadside units (RSU). Safety metrics are commonly used measures to investigate crashes and near-conflict events. However, these metrics provide limited insight into the overall network-level traffic management. On the other hand, some safety assessment efforts are devoted to processing crash reports and identifying spatial and temporal patterns of crashes that correlate with road geometry, traffic volume, and weather conditions. This approach relies merely on crash reports and ignores the rich information of traffic videos that can help identify the role of safety violations in crashes. To bridge these two perspectives, we define a new set of network-level safety metrics (NSM) to assess the overall safety profile of traffic flow by processing imagery taken by RSU cameras. Our analysis suggests that NSMs show significant statistical associations with crash rates. This approach is different than simply generalizing the results of individual crash analyses, since all vehicles contribute to calculating NSMs, not only the ones involved in crash incidents. This perspective considers the traffic flow as a complex dynamic system where actions of some nodes can propagate through the network and influence the crash risk for other nodes. The analysis is carried out using six video cameras in the state of Arizona along with a 5-year crash report obtained from the Arizona Department of Transportation (ADOT). The results confirm that NSMs modulate the baseline crash probability. Therefore, online monitoring of NSMs can be used by traffic management teams and AI-based traffic monitoring systems for risk analysis and traffic control.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-27", "journal": {"name": "IEEE Access", "pages": "17755-17778", "volume": "11"}, "authors": [{"authorId": "2024833342", "name": "Xiwen Chen"}, {"authorId": "2359832", "name": "Hongya Wang"}, {"authorId": "144705386", "name": "Abolfazl Razi"}, {"authorId": "11167587", "name": "Brendan J. Russo"}, {"authorId": "30347387", "name": "Jason L. Pacheco"}, {"authorId": "2148332472", "name": "J. Roberts"}, {"authorId": "2147073919", "name": "Jeffery Wishart"}, {"authorId": "40378087", "name": "L. Head"}], "citations": [{"paperId": "f636022c2552305f6ecfa3b366b36ffaab85adfa", "title": "FedMIL: Federated-Multiple Instance Learning for Video Analysis with Optimized DPP Scheduling"}, {"paperId": "5e02d0cfd9842f53dccd926167a5148078f4c30b", "title": "Diversity Maximized Scheduling in RoadSide Units for Traffic Monitoring Applications"}, {"paperId": "2fedc05dc7430436c819611082fe027a367a8b0e", "title": "Assessing safe autonomous vehicle behavior via large scale traffic simulation"}, {"paperId": "cb9bae7ae81e3054cd3aa66e8afa871ed274292a", "title": "Learning on Bandwidth Constrained Multi-Source Data with MIMO-inspired DPP MAP Inference"}, {"paperId": "58821990ff3cf3c8b85867469a3bb54e768f16e5", "title": "Fast Key Points Detection and Matching for Tree-Structured Images"}, {"paperId": "a8b6fbdf2e7f0d081b994093a99bd90430429460", "title": "Deep Learning Serves Traffic Safety Analysis: A Forward-looking Review"}]}
