{"paperId": "581aa612a2bca00e51229722a26d19b4a293c13f", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "HorsePower: Accelerating Database Queries for Advanced Data Analytics", "abstract": "The rising popularity of data science in recent times has resulted in the diversification of data processing systems. The current ecosystem of data processing software consists of conventional database implementations, traditional numerical computational systems, and more recent efforts that build a hybrid of these two systems. As many organizations are building complex applications that integrate all the three types of data processing systems, there is a need to look at a holistic optimization strategy that can work with any of the three, or their combinations. In this paper, we propose an advanced analytical system HorsePower, based on HorseIR, an array-based intermediate representation (IR). The system is designed for the translation of conventional database queries, statistical languages, as well as the mix of these two into a common IR, allowing to combine query optimization and compiler optimization techniques at an intermediate level of abstraction. Our experiments compare HorsePower with the column-based database sys-tem MonetDB and the array programming language MAT-LAB, and show that we can achieve significant speedups for standard SQL queries, for analytical functions written in MATLAB and for advanced data analytics combining queries and UDFs. The results show a promising new direction for integrating advanced data analytics into database systems by using a holistic compilation approach and exploiting a wide range of compiler optimization techniques.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "361-366"}, "authors": [{"authorId": "47666454", "name": "Hanfeng Chen"}, {"authorId": "1409087010", "name": "Joseph Vinish D'silva"}, {"authorId": "1699786", "name": "L. Hendren"}, {"authorId": "2257203589", "name": "Bettina Kemme"}], "citations": [{"paperId": "49d9666d6e3dd5a5a49a9db500c2683c23132b91", "title": "Efficient Execution of User-Defined Functions in SQL Queries"}, {"paperId": "3f975d7daa17a25f88aee309cb9781ecdaa958ce", "title": "rNdN: Fast Query Compilation for NVIDIA GPUs"}, {"paperId": "3fb4813a08ecbbf4ceb31f722713f4bc8366e709", "title": "User-Defined Functions in Modern Data Engines"}, {"paperId": "5cc566f05712aaa9ef10c38ee4e04fab0967e09b", "title": "YeSQL: \"You extend SQL\" with Rich and Highly Performant User-Defined Functions in Relational Databases"}]}
