{"paperId": "582196401b38696b18e12bf124c646fa2efacd15", "publicationVenue": {"id": "fe526af8-da0b-4a52-925c-e0e345537a7e", "name": "International Conference on Wireless Communications and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Wirel Commun Signal Process", "WCSP"], "url": "http://www.ic-wcsp.org/"}, "title": "Crowdsourcing based large-scale network anomaly detection", "abstract": "In recent years, emerging smartphones have proliferated fast growth of Over The Top (OTT) services and rapid expansion of mobile networks. However, the underlying network structure is trouble-prone due to massive integrated Internet Service Providers (ISP). Traditional approaches to maintain the network performance cannot satisfy requirements under such a large-scale network. As a result, a low cost and highly efficient anomaly detection mechanism is still unavailable.In this paper we propose a data mining framework to extract network anomalies from crowdsourced network measuring dataset. We first explore the crowdsourced dataset by feature engineering and instance clustering. On the basis of the preprocessed dataset, we propose weighted-apriori rule mining to find out the association between high RTTs and other features thus localizing the network anomaly. We conduct extensive experiments based on a large-scale crowdsourced network dataset with five million samples. The dataset involves round trip time (RTT) information from 6226 kinds of applications and more than 5000 users. Experiments show that our approaches can effectively detect anomalous network conditions.", "venue": "International Conference on Wireless Communications and Signal Processing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 10th International Conference on Wireless Communications and Signal Processing (WCSP)", "pages": "1-6"}, "authors": [{"authorId": "50025121", "name": "Yang Li"}, {"authorId": "16038169", "name": "Wenguang Huang"}, {"authorId": "2394645", "name": "Xiaohua Tian"}], "citations": [{"paperId": "f40c5e6385cfd8a17a6077b0eb81f6f9a9b9dc28", "title": "Assisting Crowdsourced Data Collection by using Data Mining Algorithms"}]}
