{"paperId": "58304e56bc28d3632300b373e3e6075a7d89052d", "publicationVenue": {"id": "c5877061-6357-42c3-90d8-1849509e2226", "name": "Green Technologies Conference", "type": "conference", "alternate_names": ["GreenTech", "Green Technol Conf"]}, "title": "Energy Efficient Workflow Scheduling of Cloud Services Using Chaotic Particle Swarm Optimization", "abstract": "Cloud computing is undoubtedly one of the most prominent and fastest growing distributed computing paradigm It enables virtualized software, platforms, computation and storage to be promptly provisioned, scaled and released instantaneously. Supported applications involve fields such as high-energy physics, astronomy, bioinformatics, structural biology, seismology, which are complex areas with tasks that need to be organized and processed as scientific workflows. In order to routinely allocate and deal with the execution of dependent tasks on connected resources, workflow scheduling should consider various criteria, such as minimizing cost and maximizing resource use while still meeting the user-specified overall deadlines.This paper aims to implement workflow scheduling using combined chaotic Particle Swarm optimization (PSO) heuristic to optimize the scheduling efficiency by (a) specifying a model for task-resource allocation to reduce the overall energy consumption using the Dynamic Voltage Scaling (DVS) technique; and (b) developing a heuristic that uses combined chaotic PSO to solve task resource allocation based on the proposed model. Our approach is simulated and validated using a complex workflow application.", "venue": "Green Technologies Conference", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE Green Technologies Conference(GreenTech)", "pages": "74-79"}, "authors": [{"authorId": "32091975", "name": "Khaled Sellami"}, {"authorId": "2318131", "name": "P. Tiako"}, {"authorId": "27042867", "name": "L. Sellami"}, {"authorId": "31016147", "name": "R. Kassa"}], "citations": [{"paperId": "8f7176cf0bddee444607e3668a31cb8821646b6a", "title": "Relation of Energy Consumption in Green Cloud Computing with Big Data"}, {"paperId": "5d898bb33a7e110a82c358bf1f596e4520cabb56", "title": "Analysis of Energy Efficient Workflow Allocation in Cloud Computing"}, {"paperId": "b626d65e901026edc2ce009ebbebfae590bb7e71", "title": "Energy-Aware Workflow Scheduling in a Fog-Cloud Computing Environment Using Non-Dominated Sorting Genetic Algorithm"}]}
