{"paperId": "583f02be772b176dd341e1e03e9fe0054c269f7f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "TextBlockV2: Towards Precise-Detection-Free Scene Text Spotting with Pre-trained Language Model", "abstract": "Existing scene text spotters are designed to locate and transcribe texts from images. However, it is challenging for a spotter to achieve precise detection and recognition of scene texts simultaneously. Inspired by the glimpse-focus spotting pipeline of human beings and impressive performances of Pre-trained Language Models (PLMs) on visual tasks, we ask: 1)\"Can machines spot texts without precise detection just like human beings?\", and if yes, 2)\"Is text block another alternative for scene text spotting other than word or character?\"To this end, our proposed scene text spotter leverages advanced PLMs to enhance performance without fine-grained detection. Specifically, we first use a simple detector for block-level text detection to obtain rough positional information. Then, we finetune a PLM using a large-scale OCR dataset to achieve accurate recognition. Benefiting from the comprehensive language knowledge gained during the pre-training phase, the PLM-based recognition module effectively handles complex scenarios, including multi-line, reversed, occluded, and incomplete-detection texts. Taking advantage of the fine-tuned language model on scene recognition benchmarks and the paradigm of text block detection, extensive experiments demonstrate the superior performance of our scene text spotter across multiple public benchmarks. Additionally, we attempt to spot texts directly from an entire scene image to demonstrate the potential of PLMs, even Large Language Models (LLMs).", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-15", "journal": {"name": "ArXiv", "volume": "abs/2403.10047"}, "authors": [{"authorId": "2279218515", "name": "Jiahao Lyu"}, {"authorId": "2111524263", "name": "Jin Wei"}, {"authorId": "1519001806", "name": "Gangyan Zeng"}, {"authorId": "2291981551", "name": "Zeng Li"}, {"authorId": "2279215583", "name": "Enze Xie"}, {"authorId": "2291973420", "name": "Wei Wang"}, {"authorId": "49454803", "name": "Yu ZHOU"}], "citations": []}
