{"paperId": "5852cd7cc94cc77a22ed920a3468666650276df5", "publicationVenue": null, "title": "Network Intrusion Detection with Threat Agent Profiling", "abstract": "With the increase in usage of computer systems and computer networks, the problem of intrusion detection in network security has become an important issue. In this paper, we discuss approaches that simplify network administrator’s work. We applied clustering methods for security incident profiling. We consider -means, PAM, and CLARA clustering algorithms. For this purpose, we used data collected in Warden system from various security tools. We do not aim to differentiate between normal and abnormal network traffic, but we focus on grouping similar threat agents based on attributes of security events. We suggest a case of a fine classification and a case of a coarse classification and discuss advantages of both cases.", "venue": "Secur. Commun. Networks", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-25", "journal": {"name": "Secur. Commun. Networks", "pages": "3614093:1-3614093:17", "volume": "2018"}, "authors": [{"authorId": "40910494", "name": "Tomáš Bajtoš"}, {"authorId": "48527881", "name": "A. Gajdos"}, {"authorId": "2099134445", "name": "Lenka Kleinova"}, {"authorId": "48471063", "name": "K. Lučivjanská"}, {"authorId": "33766378", "name": "Pavol Sokol"}], "citations": [{"paperId": "fa9feb45df523ab8c40a9cf0a3d01d6f26deefb0", "title": "Cybersecurity of multi-cloud healthcare systems: A hierarchical deep learning approach"}, {"paperId": "97aeac6d1f64ae20ad869be88b4fbb7be8ae4c59", "title": "Device-Type Profiling for Network Access Control Systems using Clustering-Based Multivariate Gaussian Outlier Score"}, {"paperId": "1ed4bbf4ca9a371cbc40a0c6130258d3a7447baa", "title": "GRU-based deep learning approach for network intrusion alert prediction"}, {"paperId": "d4115b652b295b93ea408cadc675d4eaa5f0df58", "title": "A survey on intrusion detection system: feature selection, model, performance measures, application perspective, challenges, and future research directions"}, {"paperId": "16bb832350076bb0ba772b3d8a245d6615d77424", "title": "Cloud-Based Zero Trust Access Control Policy: An Approach to Support Work-From-Home Driven by COVID-19 Pandemic"}, {"paperId": "70451f0f4694d017afe50165d8f7dc0a4c42a050", "title": "Comprehensive Survey of Security Issues & Framework in Data-Centric Cloud Applications"}, {"paperId": "2bc79fcb34a1b8f0a2a4dee7fdc495880b83d1ce", "title": "Dataset of intrusion detection alerts from a sharing platform"}, {"paperId": "2f27c3835c5109b2c4e821965482dc279b119a96", "title": "Layered Approach – A Simplified Mechanism For Securing Power Grid Systems"}, {"paperId": "8457a10ece45a894368f42a0398baaaa3bb27e7b", "title": "Hierarchical Deep Learning for Cybersecurity of Critical Service Systems"}, {"paperId": "a81b1dea514c9e8dd00ee470f050a402a9d0143f", "title": "Real-time processing of cybersecurity system data for attacker profiling"}, {"paperId": "cf629b5dc0dfc0aec8020dd47c1ea9f785d0dd4e", "title": "Anomaly Detection for Water Supply Data using Machine Learning Technique"}, {"paperId": "5d2eee9696d6085b331395d2ead798f6194fde64", "title": "Investigating the advanced persistent threat (APT) network traffics using a statistical analysis approach"}, {"paperId": "6ac8805a695866bce1fc214a15d950ddf0c78f1f", "title": "Application of Knowledge Methods in Information Security"}, {"paperId": "f9fc3354176de2e124af6fe41322eaacfabca657", "title": "Technical Strategies Database Managers use to Protect Systems from Security Breaches"}, {"paperId": "1e98b72991555a408fadf96f1154365d5cd35477", "title": "Hierarchical Clustering for Detecting Anomalous Traffic Conditions in Power Substations"}, {"paperId": "af770325274ecdda894537f2e8ba27859c7ed2db", "title": "Management And Security Of Multi-Cloud Applications"}, {"paperId": "da10666fb3ed077deca848e2a00338695298d1ec", "title": "Hierarchical Clustering for Anomalous Traffic Conditions Detection in Power Substations"}, {"paperId": "2e98be591fb272c4a06b192f28198a40751f336c", "title": "Behavioural Approach to Network Anomaly Detection for Resource-Constrained System – Presentation of the Novel Solution – Preliminary Study"}, {"paperId": "e689df628777cbe336a66926c421f066ede7215f", "title": "Towards Detecting and Classifying Network Intrusion Traffic Using Deep Learning Frameworks"}]}
