{"paperId": "5852bb1b06c484075dc2b876fc149367c310f632", "publicationVenue": null, "title": "Detection of Bell Pepper Crop Diseases Using Convolution Neural Network", "abstract": "The bell has a lot of pepper. Farming in India is about much more than just providing for one's family. The fact that India is a substantial exporter of food, grains, and other horticulture commodities gives the country's agribusiness sector a lot of importance. At least seventy percent of India's rural population is dependent on agriculture for their means of subsistence. Indian ranchers suffer significant financial losses on a yearly basis as a direct result of the loss of 42 percent of their harvests. Damage caused by pests accounts for 15.7% of total crop loss. Therefore, the early diagnosis of plant diseases is absolutely necessary in order to prevent damage to the plant as a whole. Historically, the health of plants has been determined by examining the changes in the leaf appearance; however, this method is inefficient because the plant is already sick at that stage. It is advised that current approaches, such as picture handling and PC vision calculations, be utilised in order to detect diseases in their earliest stages. This is the case provided that all other aspects stay same. It is vital to conduct disease analysis that is both accurate and thorough in order to ensure that the insecticides and bug sprays used do not impair the quality of the soil and to prevent endangering crop health by applying an excessive amount of these chemicals. It is essential to correctly diagnose plant illness in a timely way in order to avoid unfavorable effects connected to a reduction in crop quality or quantity. In order to classify and divide images for the purpose of locating early signs of illness, the Laplacian channel and the U nsharp covering method were used for image processing. Canny edge finding was also employed in this endeavour. In order to accomplish this goal, a clustering model called “convolution brain organization,” which is based on “deep learning arrangements,” is being utilised.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "805-810"}, "authors": [{"authorId": "2119072727", "name": "Sarthak Parakh"}, {"authorId": "15314497", "name": "M. Ashraf"}, {"authorId": "3321761", "name": "Nandita Tripathi"}, {"authorId": "37394540", "name": "Kumud Pant"}, {"authorId": "2198499324", "name": "Md. Sakil Ansari"}, {"authorId": "34934285", "name": "P. Negi"}], "citations": [{"paperId": "a739dcb11b6f485dc47b32c13decfc3bd1773f6d", "title": "GSAtt-CMNetV3: Pepper Leaf Disease Classification Using Osprey Optimization"}]}
