{"paperId": "58683a69809cf1eec4e2a379b7f01b71a8809dff", "publicationVenue": {"id": "68f20e73-515e-4c73-9cd5-5684926b45f7", "name": "IEEE Journal on Selected Areas in Communications", "type": "journal", "alternate_names": ["IEEE J Sel Area Commun"], "issn": "0733-8716", "url": "http://www.comsoc.org/jsac/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=49", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=49"]}, "title": "Cost-Efficient and Skew-Aware Data Scheduling for Incremental Learning in 5G Networks", "abstract": "To facilitate the emerging applications in 5G networks, mobile network operators will provide many network functions in terms of control and prediction. Recently, they have recognized the power of machine learning (ML) and started to explore its potential to facilitate those network functions. Nevertheless, the current ML models for network functions are often derived in an offline manner, which is inefficient due to the excessive overhead for transmitting a huge volume of dataset to remote ML training clouds and failing to provide the incremental learning capability for the continuous model updating. As an alternative solution, we propose Cocktail, an incremental learning framework within a reference 5G network architecture. To achieve cost efficiency while increasing trained model accuracy, an efficient online data scheduling policy is essential. To this end, we formulate an online data scheduling problem to optimize the framework cost while alleviating the data skew issue caused by the capacity heterogeneity of training workers from the long-term perspective. We exploit the stochastic gradient descent to devise an online asymptotically optimal algorithm, including two optimal policies based on novel graph constructions for skew-aware data collection and data training. Small-scale testbed and large-scale simulations validate the superior performance of our proposed framework.", "venue": "IEEE Journal on Selected Areas in Communications", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-02", "journal": {"name": "IEEE Journal on Selected Areas in Communications", "pages": "578-595", "volume": "40"}, "authors": [{"authorId": "3157810", "name": "Lingjun Pu"}, {"authorId": "1606045822", "name": "Xinjing Yuan"}, {"authorId": "2052177054", "name": "Xiaohan Xu"}, {"authorId": "2144230079", "name": "Xu Chen"}, {"authorId": "33481412", "name": "Pan Zhou"}, {"authorId": "7169649", "name": "Jingdong Xu"}], "citations": [{"paperId": "1eaed0d4d5c08294fde0902fbfe2ad1b486524ae", "title": "Boost Decentralized Federated Learning in Vehicular Networks by Diversifying Data Sources"}]}
