{"paperId": "586add731f3f26d8346b744e1d19ff40827e2362", "publicationVenue": {"id": "a9892786-8a2a-4097-bad2-3f27efa353fd", "name": "Workshop on Autonomic Communication", "type": "conference", "alternate_names": ["Workshop on Web as Corpus", "World Automation Congress", "Workshop Web Corpus", "World Autom Congr", "WAC", "Workshop Auton Commun"]}, "title": "Construction of Intelligent Evaluation System for Video Content Based on Big Data in the Context of 5G1", "abstract": "With the development of 5G technology, content is no longer closed and one-dimensional. Openness, sharing and co-construction, and multilateral cooperation have become common phenomena in content production, transmission, distribution, and trading. The survival rules of the traditional content industry have emerged. However, the original evaluation mechanism cannot adapt to the needs of the current open and massive content industry. Therefore, the author tried to propose a content evaluation model based on big data.In this study, the author first sorted out the changes in the content industry, proposed that the current mature big data industry provides a technical basis for the implementation of content evaluation models, and further proposed the basic principles that the content evaluation model should meet, and build on this basis A content evaluation model composed of three-dimensional data is adopted. Through flexible processing of three-dimensional data, different requirements for evaluation in various links of the content industry can be realized.", "venue": "Workshop on Autonomic Communication", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-11", "journal": {"name": "2022 World Automation Congress (WAC)", "pages": "237-241"}, "authors": [{"authorId": "2152162688", "name": "Dianyi Wu"}, {"authorId": "2146529369", "name": "Siwei Long"}, {"authorId": "2150920990", "name": "Yan Zhou"}, {"authorId": "2124930178", "name": "Sucheng Chen"}], "citations": []}
