{"paperId": "586db2d5facc7ba46c1102263866459b5d6690c4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Towards an Arrow-native Storage System", "abstract": "With the ever-increasing dataset sizes, several file formats like Parquet, ORC, and Avro have been developed to store data efficiently and to save network and interconnect bandwidth at the price of additional CPU utilization. However, with the advent of networks supporting 25-100 Gb/s and storage devices delivering 1, 000, 000 reqs/sec the CPU has become the bottleneck, trying to keep up feeding data in and out of these fast devices. The result is that data access libraries executed on single clients are often CPU-bound and cannot utilize the scale-out benefits of distributed storage systems. One attractive solution to this problem is to offload data-reducing processing and filtering tasks to the storage layer. However, modifying legacy storage systems to support compute offloading is often tedious and requires extensive understanding of the internals. Previous approaches re-implemented functionality of data processing frameworks and access library for a particular storage system, a duplication of effort that might have to be repeated for different storage systems. In this paper, we introduce a new design paradigm that allows extending programmable object storage systems to embed existing, widely used data processing frameworks and access libraries into the storage layer with minimal modifications. In this approach data processing frameworks and access libraries can evolve independently from storage systems while leveraging the scale-out and availability properties of distributed storage systems. We present one example implementation of our design paradigm using Ceph, Apache Arrow, and Parquet. We provide a brief performance evaluation of our implementation and discuss key results.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-20", "journal": {"name": "ArXiv", "volume": "abs/2105.09894"}, "authors": [{"authorId": "2047518962", "name": "Jayjeet Chakraborty"}, {"authorId": "145263954", "name": "I. Jimenez"}, {"authorId": "1388606537", "name": "Sebastiaan Alvarez Rodriguez"}, {"authorId": "2860260", "name": "Alexandru Uta"}, {"authorId": "40559862", "name": "J. LeFevre"}, {"authorId": "3198700", "name": "C. Maltzahn"}], "citations": [{"paperId": "e59242747d3dd197676ccca258906fa2db72d331", "title": "Conquery: an open source application to analyze high content healthcare data"}]}
