{"paperId": "5873b2e5b6fc93a24c5ea4016802e7c5fbeebecd", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Infrared Image Superpixel Segmentation Based on Seed Strategy of Contour Encoding", "abstract": "Superpixel segmentation has become a crucial pre-processing tool to reduce computation in many computer vision applications. In this paper, a superpixel extraction algorithm based on a seed strategy of contour encoding (SSCE) for infrared images is presented, which can generate superpixels with high boundary adherence and compactness. Specifically, SSCE can solve the problem of superpixels being unable to self-adapt to the image content. First, a contour encoding map is obtained by ray scanning the binary edge map, which ensures that each connected domain belongs to the same homogeneous region. Second, according to the seed sampling strategy, each seed point can be extracted from the contour encoding map. The initial seed set, which is adaptively scattered based on the local structure, is capable of improving the capability of boundary adherence, especially for small regions. Finally, the initial superpixels limited by the image contour are generated by clustering and refined by merging similar adjacent superpixels in the region adjacency graph (RAG) to reduce redundant superpixels. Experimental results on a self-built infrared dataset and the public datasets BSD500 and 3Dircadb demonstrate the generalization ability in grayscale and medical images, and the superiority of the proposed method over several state-of-the-art methods in terms of accuracy and compactness.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2116121117", "name": "Weihua Li"}, {"authorId": "2055953966", "name": "Zhuang Miao"}, {"authorId": "2149658237", "name": "Jing Mu"}, {"authorId": "2906259", "name": "Fanming Li"}], "citations": [{"paperId": "cef3f55780b95a4e7d38cce2cf973943c27c00cc", "title": "Ionic Liquids as Corrosion Inhibitors for Carbon Steel Protection in Hydrochloric Acid Solution: A First Review"}]}
