{"paperId": "587405035803de40a3479b81c8cd29cc485e346a", "publicationVenue": {"id": "a62882dc-8ba9-4736-b1de-ba5e2c79193f", "name": "Journal of Ambient Intelligence and Smart Environments", "type": "journal", "alternate_names": ["J Ambient Intell Smart Environ"], "issn": "1876-1364", "url": "http://content.iospress.com/journals/journal-of-ambient-intelligence-and-smart-environments", "alternate_urls": ["http://www.iospress.nl/journal-of-ambient-intelligence-and-smart-environment/", "http://www.iospress.nl/loadtop/load.php?isbn=18761364"]}, "title": "Indexing of real time geospatial data by IoT enabled devices: Opportunities, challenges and design considerations", "abstract": ". We are moving towards ‘smart’ world in which industries, such as healthcare, smart cities, transportation, and agri-culture have started using IoT (Internet of Things). These applications involve huge number of sensors and devices that generate high volume of real time data. To perform useful analytics on this data, location and spatial awareness characteristics of devices need to be considered. Wide range of location-based services and sensors in GIS have to manage moving objects that change their position with respect to time. These applications generate voluminous amount of real time geospatial data that demands an effective query processing mechanism to minimize the response time of a query. Indexing is one of the traditional ways to minimize the response time of a query by pruning the search space. In this paper, we performed a detailed survey of the literature regarding the indexing of real time geospatial data generated by IoT enabled devices. Some major challenges relevant to indexing of moving objects are highlighted. Various important index design considerations are also discussed. The goal is to help researchers in understanding the principles, methods, and challenges in the indexing of real time geospatial data. This will also aid in identifying the future research opportunities.", "venue": "Journal of Ambient Intelligence and Smart Environments", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-07-21", "journal": {"name": "J. Ambient Intell. Smart Environ.", "pages": "281-312", "volume": "12"}, "authors": [{"authorId": "68973256", "name": "Natalia Chaudhry"}, {"authorId": "2910122", "name": "M. Yousaf"}, {"authorId": "40367634", "name": "M. Khan"}], "citations": [{"paperId": "a33844af3ab5f75aae0c85a2c50dfd9a4b3a07fd", "title": "Efficient Method for Continuous IoT Data Stream Indexing in the Fog-Cloud Computing Level"}, {"paperId": "f41eba755ce3043a83878d823b0bf43238cc5c81", "title": "A hash-based index for processing frequent updates and continuous location-based range queries"}, {"paperId": "261cc9a66483215ae440659d3c7cd7ab174d8d15", "title": "Um Sistema para Consultar Eventos de Trânsito Históricos do Waze"}, {"paperId": "ec5a2a59b98660d1bc9faacd465ad3558a5a043a", "title": "Smart parking management system with dynamic pricing"}, {"paperId": "2153b357c889842b22196f809ae4000ca7fe7b82", "title": "MIDET: A Method for Indexing Traffic Events"}, {"paperId": "65eb5bddd29945c8430023f70d518ef1e802f1c4", "title": "STEP: A Concomitant Protocol for Real Time Applications"}, {"paperId": "65241996a3a867298c703096fe25c164db25efca", "title": "Concurrency control for real‐time and mobile transactions: Historical view, challenges, and evolution of practices"}, {"paperId": "b86bb3e8d86aed266d6b5b7b102afa83212673ac", "title": "Indexing in WoT to Locate Indoor Things"}, {"paperId": "ce82d2501cea1b49b74ae402a52ad0c9f75b7167", "title": "SAW: A real-time surveillance system at an agricultural warehouse using IoT"}]}
