{"paperId": "588a314595d4fa5b6ac9eeb9e0d1bfaf06c30e70", "publicationVenue": null, "title": "Human Activity Recognition models using Limited Consumer Device Sensors and Machine Learning", "abstract": "Human activity recognition has grown in popularity with its increase of applications within daily lifestyles and medical environments. The goal of having efficient and reliable human activity recognition brings benefits such as accessible use and better allocation of resources; especially in the medical industry. Activity recognition and classification can be obtained using many sophisticated data recording setups, but there is also a need in observing how performance varies among models that are strictly limited to using sensor data from easily accessible devices: smartphones and smartwatches. This paper presents the findings of different models that are limited to train using such sensors. The models are trained using either the k-Nearest Neighbor, Support Vector Machine, or Random Forest classifier algorithms. Performance and evaluations are done by comparing various model performances using different combinations of mobile sensors and how they affect recognitive performances of models. Results show promise for models trained strictly using limited sensor data collected from only smartphones and smartwatches coupled with traditional machine learning concepts and algorithms.", "venue": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-01-21", "journal": {"name": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "pages": "456-461"}, "authors": [{"authorId": "51288952", "name": "Rushit Dave"}, {"authorId": "1809915", "name": "Naeem Seliya"}, {"authorId": "117565513", "name": "Mounika Vanamala"}, {"authorId": "47029081", "name": "Weihown Tee"}], "citations": [{"paperId": "54e0a5eba5fa59b83122229f6ea3d83faa594648", "title": "Your device may know you better than you know yourself - continuous authentication on novel dataset using machine learning"}, {"paperId": "e2f5cb9b91fe6eacde5f0c588c5349b4cf4d7e62", "title": "Secure Arcade: A Gamified Defense Against Cyber Attacks"}, {"paperId": "10cbd4727312b96d58cb614bdb9bd81b0b4f2e4c", "title": "Recent Advancements In The Field Of Deepfake Detection"}, {"paperId": "330ac0be13b4b606e08ef12380f0a3bd90bcfe0b", "title": "Using Machine Learning To Identify Software Weaknesses From Software Requirement Specifications"}, {"paperId": "a0102fd109c4dcdc627846168c30d551d8ffc35e", "title": "Less is more: Efficient behavioral context recognition using Dissimilarity-Based Query Strategy"}, {"paperId": "f431aa80c4d902860087ef76e4fbced1075b4dc4", "title": "Your Identity is Your Behavior - Continuous User Authentication based on Machine Learning and Touch Dynamics"}, {"paperId": "5dcdf512fba332065b2800eea772c5aa89bb73e4", "title": "Hybrid Deepfake Detection Utilizing MLP and LSTM"}, {"paperId": "b03479191a3f6e5223475487af6ff4e88113f2d8", "title": "Leveraging Deep Learning Approaches for Deepfake Detection: A Review"}, {"paperId": "f7662ad3dce1c3ef71d55af37fcd22f0e261e5e2", "title": "Machine Learning Based Approach to Recommend MITRE ATT&CK Framework for Software Requirements and Design Specifications"}, {"paperId": "5ffa176b8eb7d288fe12cfc17e87cd775beafec9", "title": "Tracking individuals’ health using mobile applications and Machine Learning"}, {"paperId": "f033c9e2bfa81df46e4165d824edb9baf8d07cd7", "title": "Mitigating Presentation Attack using DCGAN and Deep CNN"}, {"paperId": "81e04590b372c21dd8a63a0c14c27eb8821fadb9", "title": "Evaluation of a User Authentication Schema Using Behavioral Biometrics and Machine Learning"}, {"paperId": "a68d3fb055b63cf98abc9ff0da91f61483dece94", "title": "Article Title: From Clicks to Security: Investigating Continuous Authentication via Mouse Dynamics"}]}
