{"paperId": "588d292a9301cddb5b61453c91488ad3f03c8abc", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "A Reinforcement Learning Approach for Virtual Network Function Chaining and Sharing in Softwarized Networks", "abstract": "Cognizant of the ease with which softwarized functions can be dynamically scaled according to real time resource requirements, and the fact that multiple services can have common VNFs in their chaining, this paper tackles the problem of cost effective deployment of online services from the perspective of sharing their VNF instances. First, we formally formulate the deployment problem under VNFs sharing. Secondly, given the NP-hard nature of the above problem, we propose a reinforcement learning (RL) algorithm capable of making intelligent placement decisions while considering multiple conflicting costs. Costs of transmission, VNF instantiation or energy consumption, among others. Thanks to the intelligence of the RL algorithm, simulation results show that the performance of the proposed algorithm is within a 14% margin and similar to an optimal solution in terms of request provisioning cost and acceptance ratio, respectively. Moreover, the algorithm results in more than a 20% and a 70% improvement in terms of request deployment cost and time compared to a state-of-the-art algorithm, and up to more than a 40% improvement in terms of cost compared to an algorithm that greedily minimizes the transmission or VNF activation costs.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3352-3370", "volume": "19"}, "authors": [{"authorId": "3273192", "name": "Godfrey Kibalya"}, {"authorId": "1403820763", "name": "J. Serrat-Fernández"}, {"authorId": "1690995", "name": "J. Gorricho"}, {"authorId": "40075749", "name": "Peiying Zhang"}], "citations": [{"paperId": "3592db92ecdf9aa8c583a04d97e64f5db6128544", "title": "Energy-Aware Positioning Service Provisioning for Cloud-Edge-Vehicle Collaborative Network Based on DRL and Service Function Chain"}, {"paperId": "175e78faea8f151c210518981134de3bcbbdd2f3", "title": "A Heuristic Spatio-Temporal Scheduling for Virtual Network Allocation Considering Renewable Energy"}, {"paperId": "cbc11e643a1abea9e1921bbce87f024ba8614708", "title": "Deployment of Future Services in a Multi-access Edge Computing Environment Using Intelligence at the Edge"}, {"paperId": "d3d2c3671732300d2ea18583fd029250125defa0", "title": "Dapper: Deploying Service Function Chains in the Programmable Data Plane Via Deep Reinforcement Learning"}, {"paperId": "5f36d62dcdce35d5d8ac89902757063632f64589", "title": "A comprehensive survey on software‐defined networking for smart communities"}]}
