{"paperId": "5891cc71317c679595eb5ff54e7c38412b42f926", "publicationVenue": {"id": "51227d50-1d22-48c8-ac32-5466d5c3d16b", "name": "SMART", "type": "conference", "alternate_names": ["Jurnal SMART (Studi Masyarakat, Religi, dan Tradisi)", "Int Conf Syst Model  Adv Res Trends", "J SMART (studi Masy Religi dan Tradisi", "International Conference System Modeling & Advancement Research Trends"], "issn": "2460-6294", "alternate_issns": ["2528-553X"], "url": "https://blasemarang.kemenag.go.id/journal/index.php/smart/index"}, "title": "IP and IoT-Based Waterside Surveillance for Early Floods Alarming System", "abstract": "Throughout this work, an apparatus that uses machine learning, image manufacturing, or Connectivity to track riverbed water levels is given. By using the processing of images, wherein boundary detection technology is used to analyze both pictures acquired using a television camera, such an approach is designed to determine the level of a shoreline and the level of the stream. The stream's water grade plus the shoreline rating are compared to calculate the flood intensity rating. The storm's intensity was then uploaded to an Internet of Things system. Once the water's intensity exceeded a specific critical level, a notice was delivered to the public via the popular social networking site Telegram. Within the aforementioned architecture gadget, a Banana Pi 3 B variant is employed as both a controlling device and a camera using the Banana Pi 5MP cameras package. Ubidots is an Internet of Things system that is employed, and it allows for user notification. Our work's major contributions focus on integrating image processing using Internet of things clouds to create an advanced flood tracking device in response to warming temperatures by identifying the flooding extent and warning individuals about the flooding harshness condition. According to experimental findings, combining machine vision using machine learning for image analysis using the Internet of Things Cloud infrastructure is a realistic strategy. In order to determine the liquid level versus bank straight, the paper compares the creepy-edge detection approach and reaching the point technique. To determine whether this device might function in the real world, it was additionally tested in both lab (indoor) as well as outdoor environments.", "venue": "SMART", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-22", "journal": {"name": "2023 12th International Conference on System Modeling & Advancement in Research Trends (SMART)", "pages": "315-320"}, "authors": [{"authorId": "2284891001", "name": "Somesh M. Bachani"}, {"authorId": "2220362102", "name": "Prashant Johri"}, {"authorId": "2284886860", "name": "Aakanksha Uppal"}, {"authorId": "2284887592", "name": "Meenakshi Kaul"}, {"authorId": "2080066672", "name": "Nitin Gaur"}, {"authorId": "2284951967", "name": "Sujeet Kumar"}], "citations": []}
