{"paperId": "589dd40bfa34891fa397e3016f462308ac38ccaa", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "Tackling Cold Start of Serverless Applications by Efficient and Adaptive Container Runtime Reusing", "abstract": "During the past few years, serverless computing has changed the paradigm of application development and deployment in the cloud and edge due to its unique advantages, including easy administration, automatic scaling, built-in fault tolerance, etc. Nevertheless, serverless computing is also facing challenges such as long latency due to the cold start. In this paper, we present an in-depth performance analysis of cold start in the serverless framework and propose HotC, a container-based runtime management framework that leverages the lightweight containers to mitigate the cold start and improve the network performance of serverless applications. HotC maintains a live container runtime pool, analyzes the user input or configuration file, and provides available runtime for immediate reuse. To precisely predict the request and efficiently manage the hot containers, we design an adaptive live container control algorithm combining the exponential smoothing model and Markov chain method. Our evaluation results show that HotC introduces negligible overhead and can efficiently improve the performance of various applications with different network traffic patterns in both cloud servers and edge devices.", "venue": "IEEE International Conference on Cluster Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "433-443"}, "authors": [{"authorId": "3446210", "name": "Kun Suo"}, {"authorId": "1856267", "name": "Junggab Son"}, {"authorId": "1778706", "name": "Dazhao Cheng"}, {"authorId": "2154941769", "name": "Wei Chen"}, {"authorId": "143890566", "name": "S. Baidya"}], "citations": [{"paperId": "c64ff19a6abd8c8350972faf02464a4d561ac498", "title": "FaaSCom: Mitigate Cold Start Problem in FaaS via Function Community"}, {"paperId": "1ecdf0add6e2d139c1afc970d427d7b34a8e6cf3", "title": "Online Function Caching in Serverless Edge Computing"}, {"paperId": "8049a85cb3db9a091c730798f454a0ccea55b752", "title": "Cold Start Latency in Serverless Computing: A Systematic Review, Taxonomy, and Future Directions"}, {"paperId": "6841c0ba4196b4ea05ea8579cb615ef1035f03fa", "title": "A Deep Reinforcement Learning based Algorithm for Time and Cost Optimized Scaling of Serverless Applications"}, {"paperId": "81ad562ec959c011091d01575af61f6aac9a3e61", "title": "Towards a DISSECT-CF extension for simulating function-as-a-service"}, {"paperId": "5a3bf0eaa5a3ec0b010ea357257894c471aa8079", "title": "A Novel Function Fusion Approach for Serverless Cold Start"}, {"paperId": "d45518ce5741587c4c37ccbc5e74b3fcfd6f80f1", "title": "LCS : Alleviating Total Cold Start Latency in Serverless Applications with LRU Warm Container Approach"}, {"paperId": "b99668ae35c4b6796b827657a318fe4b84a757ff", "title": "Mitigating Cold-Start Delay using Warm-Start Containers in Serverless Platform"}, {"paperId": "c09b2ab033906291bddb6c962c3d4edaceb02b53", "title": "Cold-start aware cloud-native service function chain caching in resource-constrained edge: A reinforcement learning approach"}, {"paperId": "e5617de21e517ac5b6dcb1b041710dbd2c755ffc", "title": "Rise of the Planet of Serverless Computing: A Systematic Review"}, {"paperId": "3aa0fe9d05af104ec56dd0edc09d716919f7275a", "title": "A Literature Review on Serverless Computing"}, {"paperId": "06e516f1f6656cea9085a24f7fa1168a076fdcc6", "title": "Process-as-a-Service: FaaSt Stateful Computing with Optimized Data Planes"}, {"paperId": "31289ab1bd4f940de68510e70e6513879c67ceaf", "title": "A Framework for Migration of Microservices based Applications to Serverless Platform with Eﬃcient Cold Start Latency"}]}
