{"paperId": "589ec9dca1727b24572badbaf017e57be26774c5", "publicationVenue": null, "title": "Data replication in large-scale data management systems. (Réplication de données dans les systèmes de gestion de données à grande échelle)", "abstract": "Ces dernieres annees, la popularite croissante des applications, e.g. les experiences scientifiques, Internet des objets et les reseaux sociaux, a conduit a la generation de gros volumes de donnees. La gestion de telles donnees qui de plus, sont heterogenes et distribuees a grande echelle, constitue un defi important. Dans les systemes traditionnels tels que les systemes distribues et paralleles, les systemes pair-a-pair et les systemes de grille, repondre a des objectifs tels que l'obtention de performances acceptables tout en garantissant une bonne disponibilite de donnees constituent des objectifs majeurs pour l'utilisateur, en particulier lorsque ces donnees sont reparties a travers le monde. Dans ce contexte, la replication de donnees, une technique tres connue, permet notamment: (i) d'augmenter la disponibilite de donnees, (ii) de reduire les couts d'acces aux donnees et (iii) d'assurer une meilleure tolerance aux pannes. Neanmoins, repliquer les donnees sur tous les nœuds est une solution non realiste vu qu'elle genere une consommation importante de la bande passante en plus de l'espace limite de stockage. Definir des strategies de replication constitue la solution a apporter a ces problematiques. Les strategies de replication de donnees qui ont ete proposees pour les systemes traditionnels cites precedemment ont pour objectif l'amelioration des performances pour l'utilisateur. Elles sont difficiles a adapter dans les systemes de cloud. En effet, le fournisseur de cloud a pour but de generer un profit en plus de repondre aux exigences des locataires. Satisfaire les attentes de ces locataire en matiere de performances sans sacrifier le profit du fournisseur d'un cote et la gestion elastiques des ressources avec une tarification suivant le modele 'pay-as-you-go' d'un autre cote, constituent des principes fondamentaux dans les systemes cloud. Dans cette these, nous proposons une strategie de replication de donnees pour satisfaire les exigences du locataire, e.g. les performances, tout en garantissant le profit economique du fournisseur. En se basant sur un modele de cout, nous estimons le temps de reponse necessaire pour l'execution d'une requete distribuee. La replication de donnees n'est envisagee que si le temps de reponse estime depasse un seuil fixe auparavant dans le contrat etabli entre le fournisseur et le client. Ensuite, cette replication doit etre profitable du point de vue economique pour le fournisseur. Dans ce contexte, nous proposons un modele economique prenant en compte aussi bien les depenses et les revenus du fournisseur lors de l'execution de cette requete. Nous proposons une heuristique pour le placement des repliques afin de reduire les temps d'acces a ces nouvelles repliques. De plus, un ajustement du nombre de repliques est adopte afin de permettre une gestion elastique des ressources. Nous validons la strategie proposee par une evaluation basee sur une simulation. Nous comparons les performances de notre strategie a celles d'une autre strategie de replication proposee dans les clouds. L'analyse des resultats obtenus a montre que les deux strategies comparees repondent a l'objectif de performances pour le locataire. Neanmoins, une replique de donnees n'est cree, avec notre strategie, que si cette replication est profitable pour le fournisseur.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science", "Political Science"], "publicationTypes": null, "publicationDate": "2017-06-27", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2269049895", "name": "Uras Tos"}], "citations": [{"paperId": "19fab943626220028615fdd11dcb027d41bdaee8", "title": "Exploiting Cloud Computing and Web Services to Achieve Data Consistency, Availability, and Partition Tolerance in the Large-Scale Pervasive Systems"}, {"paperId": "12a20be575694bcd29aef810ac2793739a70915c", "title": "Achieving query performance in the cloud via a cost-effective data replication strategy"}, {"paperId": "e150570b14d2175ef3c28e852e93666a5b8d35ed", "title": "EFFICIENT AND SECURE DATA UTILIZATION IN MOBILE EDGE COMPUTING BY DATA REPLICATION"}, {"paperId": "a127b02dea94c4b302858b3c6879e91dd210688c", "title": "Comparing energy-aware vs. cost-aware data replication strategy"}, {"paperId": "dc6108202138ca81019e323a75bbac2031822d05", "title": "Data replication strategy with satisfaction of availability, performance and tenant budget requirements"}]}
