{"paperId": "58a60496b784fa5220d5a062d9d3dac6d9379719", "publicationVenue": {"id": "106718ef-ff90-4d0f-ae76-9f924e742637", "name": "Journal of Sensors", "type": "journal", "alternate_names": ["J Sens"], "issn": "1687-725X", "url": "https://www.hindawi.com/journals/js/"}, "title": "IETIF: Intelligent Energy-Aware Task Scheduling Technique in IoT/Fog Networks", "abstract": "Nowadays, with the advent of various communication technologies such as the internet of things (IoT), a large volume of data is produced that needs to be processed in real-time. Fog computing is an appropriate solution to address the requirements of different types of IoT applications. In most cases, IoT applications consist of a set of dependent tasks that can be separately processed in a heterogeneous fog environment. Scheduling these tasks in a fog environment is an NP-hard problem that needs a vast amount of time and computation resources to solve, making it infeasible for real-time applications. In addition, reducing response time and energy consumption in fog computing is an essential issue that should be taken into account in task scheduling algorithms. To address these challenges, we aim to propose a multiobjective task scheduling model to jointly improve energy efficiency and response time. To solve the model, we also propose an intelligent solution named IETIF which combines and leverages the benefits of simulated annealing and NSGA-III algorithms. Simulation results show that IETIF outperforms the state-of-the-art methods in terms of energy consumption, response time, and speedup.", "venue": "Journal of Sensors", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-10", "journal": {"name": "Journal of Sensors"}, "authors": [{"authorId": "2118740678", "name": "Amin Nazari"}, {"authorId": "1576332146", "name": "Sakineh Sohrabi"}, {"authorId": "143984462", "name": "Reza Mohammadi"}, {"authorId": "144750820", "name": "M. Nassiri"}, {"authorId": "48335113", "name": "M. Mansoorizadeh"}], "citations": [{"paperId": "a5b50081b4750f937d99c16d3c9e8980f7e510c0", "title": "An intelligent real-time workloads allocation in IoT-fog networks"}]}
