{"paperId": "58b52b09ec38d53c280ff3e4c1f0efbf35e87d3f", "publicationVenue": {"id": "3021eef2-d365-42c6-b670-57770e8dac73", "name": "International Symposium on Intelligent Control", "type": "conference", "alternate_names": ["Int Symp Indep Comput", "International Symposium on Integrated Circuits", "International Semantic Intelligence Conference", "Int Symp Intell Control", "ISIC", "Int Semantic Intell Conf", "International Symposium on Independent Computing", "Int Symp Integr Circuit"]}, "title": "Semantic Hybrid Multi-Model Multi-Platform (SHM3P) Databases", "abstract": "Today’s companies have to handle a zoo of data of different models. Multi-model databases promise to simplify data administration for the parallel usage of different data models. Compared to the other data models, semantic data models introduce an additional abstraction layer for reasoning purposes, such that semantic data models provide superior capabilities. Hence semantic multi-model databases use the semantic data model as main glue between the different data models. Furthermore, applications as well as databases are today running on different platforms like mobile devices, web, desktops, servers, clouds and post-clouds (e.g., fog and edge computing). Hybrid multi-model multi-platform (HM3P) databases and its semantic counterpart (SHM3P databases) integrate the different platforms in order to offer their advantages and benefits for data distribution, query processing and transaction handling to their users. In this paper we introduce and discuss the novel concept of SHM3P databases and its open challenges.", "venue": "International Symposium on Intelligent Control", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "16-26"}, "authors": [{"authorId": "145267753", "name": "Sven Groppe"}], "citations": [{"paperId": "43796a5e908cd435850f57e8ba5835d68bc55967", "title": "Quantum Machine Learning: Foundation, New Techniques, and Opportunities for Database Research"}, {"paperId": "bb23f14a49a6f3c33da4ce53d3ea2509818e629d", "title": "Third International Workshop on Big Data in Emergent Distributed Environments (BiDEDE)"}, {"paperId": "b7acc39fe2f1b65f0591acb411a713e4ce92da30", "title": "Optimizing Transaction Schedules on Universal Quantum Computers via Code Generation for Grover’s Search Algorithm"}, {"paperId": "fa0418802b5db2d991b698832f7ad9b417a6ca19", "title": "Sound of Databases: Sonification of a Semantic Web Database Engine"}, {"paperId": "253e76fb911ba7a188079ef5ea288ac5aa5c24ef", "title": "PEMBUATAN WEB SERVICE DENGAN GOOGLE SPREADSHEETS SEBAGAI SOLUSI INTEGRASI APLIKASI MULTIPLATFORM"}, {"paperId": "56b58b56ef47202dda56906ae72acd209fcceb8a", "title": "Encoding and Provisioning Data in different Data Models for Quantum Computing"}, {"paperId": "320e4f8649a27132e2962ad399d16275435fe5da", "title": "Generating SPARQL-Constraints for Consistency Checking in Industry 4.0 Scenarios"}, {"paperId": "e9188004d58b56c6622ad190e95278f21fa38879", "title": "Generating Sound from the Processing in Semantic Web Databases"}]}
