{"paperId": "58b934b49dbd099029832caf8b4520bdf93d43f0", "publicationVenue": {"id": "915442b0-ebd3-4d6f-88d4-4939a6d3a7bc", "name": "Journal of Information and Data Management", "type": "journal", "alternate_names": ["J inf data manag", "J Inf Data Manag", "Journal of information and data management", "JIDM"], "issn": "2178-7107", "alternate_issns": ["2166-6261"], "url": "http://seer.lcc.ufmg.br/index.php/jidm", "alternate_urls": ["https://seer.lcc.ufmg.br/index.php/jidm/index"]}, "title": "Beyond Click-and-View: a Comparative Study of Data Management Approaches for Interactive Visualization", "abstract": "Visual analytics solutions have been growing in popularity in recent years, not only for showing final results but also for assisting in interactive analysis and decision-making. Analysis of a large amount of data requires flexible exploration and visualizations. However, queries that span geographical regions over time slices are expensive to compute, which turns it challenging to accomplish interactive speeds for huge data sets. Such systems require efficient data availability, so that response time does not interfere with the user’s ability to observe and analyze. Simultaneously, researches in the database domain have proposed solutions that can be used to support visualization systems. This article presents a comparative study of data management approaches to support interactive visualizations. The chosen data management solutions are (i) Apache Drill (a Polystore system), (ii) Apache Spark (a big data framework), (iii) Elasticsearch (a search engine), (iv) MonetDB (a column-oriented DBMS), and (v) PostgreSQL (a relational DBMS). To evaluate the performance of each solution, we selected a list of spatiotemporal queries among multiple queries submitted by users in a visual analytics system for rainfall data analysis named TEMPO. The results of this study show that Apache Spark and MonetDB present the best performance for the selected queries.", "venue": "Journal of Information and Data Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "J. Inf. Data Manag.", "volume": "13"}, "authors": [{"authorId": "2187457327", "name": "Lorenna Christ'na Nascimento"}, {"authorId": "2187456391", "name": "Rodolfo P. Chagas"}, {"authorId": "2184099008", "name": "Marcos Lage"}, {"authorId": "33663874", "name": "Daniel de Oliveira"}], "citations": []}
