{"paperId": "58d691ea6bd205367e8639a026a94d1090a289f9", "publicationVenue": null, "title": "Cloud computing for deep learning analytics:A survey of current trends and challenges", "abstract": ": Deep learning, a sub-field of machine learning is inspired by the principle of information processing in the human brain. Its applications are autonomous driving, robotics control, machine translation etc. It needs multiple training examples of the task, specialized GPU hardware, capital investment and its libraries evolve quickly, so frequent updates are needed. Cloud computing is a type of computing in which computing resources are provided on demand. Cloud is an apt choice for a platform for deep learning analytics as it provides servers, storage and networking resources. It provides scalability, processing, storage and analytics resources. Deep learning algorithms like CNN are computationally intensive for a commercial computer for large larger datasets. Cloud computing allows prevailing the processing, memory constraints of average computers, allowing computations on larger datasets. This paper discusses how cloud computing allows us to overcome the constraints of deep learning analytics on average systems and the various platforms offered by various providers. Google, NVIDIA, IBM provide us platforms for deep learning. IBM’s Rescale, Nervana Cloud , Google deep learning cloud provide full-stack hosted platform for deep learning.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "69981434", "name": "Anam Saiyeda"}, {"authorId": "2144911801", "name": "M. Mir"}], "citations": [{"paperId": "e714313aa2f073f87b5d6531a1e086771909be90", "title": "Deep-Learning-Based Action and Trajectory Analysis for Museum Security Videos"}, {"paperId": "83645b973aa7f08cc615e5f4f7131a3b1a79085f", "title": "RPU-PVB: robust object detection based on a unified metric perspective with bilinear interpolation"}, {"paperId": "1c6a21f0735a290b71e984947a72a70203f6d3e5", "title": "Deep neural networks in the cloud: Review, applications, challenges and research directions"}, {"paperId": "e9d9632d41330c6ac7fc206dbcac175126531e17", "title": "Design and implementation of quickly building artificial intelligence training environment on high-performance server"}, {"paperId": "6b5855cbf89d5686fe4ee8377567a378a2e9f067", "title": "Design and testing of silicon photonic 4F system for convolutional neural networks"}, {"paperId": "7d147d346ff84211f1b3c9f42e25e75efe382a05", "title": "A review of AI teaching and learning from 2000 to 2020"}, {"paperId": "c22c39fa3d7cf1e1cff55a6e1fc38fb478bd0b47", "title": "Integrated Photonic Tensor Processing Unit for a Matrix Multiply: A Review"}, {"paperId": "dce3d6f1a27252d38955d001abfad8ca62ff9320", "title": "COVLIAS 2.0-cXAI: Cloud-Based Explainable Deep Learning System for COVID-19 Lesion Localization in Computed Tomography Scans"}, {"paperId": "2358912c6d2d9d4db3c79dd79dc059cdc33194fe", "title": "Data science in organizations: Conceptualizing its breakthroughs and blind spots"}, {"paperId": "1bf62272d36bdf881830fda593a58b50b5bf3621", "title": "Support Vector Machine and YOLO for a Mobile Food Grading System"}, {"paperId": "54839a8af130571d1d9ca53317d4403d4cc65544", "title": "Speculative Container Scheduling for Deep Learning Applications in a Kubernetes Cluster"}, {"paperId": "af5595274bf88aac0b51a02384058ef91636817d", "title": "Research on Speaker Verification Based on Cloud Computing Platform"}, {"paperId": "eae27d3ee4fde43789fcf764421b3f046549645e", "title": "Proximity‐based cloud resource provisioning for deep learning applications in smart healthcare"}, {"paperId": "1dc04257c416acf99649f172e461ba7ea9859a6b", "title": "Deep understanding of 3-D multimedia information retrieval on social media: implications and challenges"}, {"paperId": "6506d4dc68ca9f55a26ee3b9e9f9ca2ac7e8061b", "title": "Investigating the Use of Deep Learning and Implicit Feedback in K12 Educational Recommender Systems"}]}
