{"paperId": "58df9d78d387cf3c2720793159b127c1d9e722be", "publicationVenue": null, "title": "Kafka: the Database Inverted, but Not Garbled or Compromised", "abstract": "The Kafka streaming platform has at its heart a distributed commit log. This resembles the change log that exists in every relational database system. It has been suggested that Kafka be viewed not just as a messaging system, but as the core of a database. The database is in effect “turned inside out” as the normally hidden change log becomes the first class entity of the system, while what is normally considered primary, i.e. the table, view, indexes etc. are just derived from this log. This is appealing as a vision, but raises challenges when applied within an actual enterprise system. The challenges arise from the conflicting interests and requirements of analytics and transactional systems. Running everything on a single system leads to tradeoffs; our intentions here is to identify some of the practical problems with using Kafka as a single data store within an enterprise and to describe our initial approach to resolving them. In particular we present preliminary approaches to ensure consistency and coherence of data from multiple database tables when distributed over Kafka and how to address compliance by encrypting/decrypting data at the Kafka producers and consumers.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "3874-3880"}, "authors": [{"authorId": "145095606", "name": "S. Rooney"}, {"authorId": "2828437", "name": "Peter Urbanetz"}, {"authorId": "1767410", "name": "Chris Giblin"}, {"authorId": "152962744", "name": "D. Bauer"}, {"authorId": "1412379657", "name": "Florian Froese"}, {"authorId": "1403619761", "name": "L. Garcés-Erice"}, {"authorId": "34693274", "name": "Sasa Tomic"}], "citations": [{"paperId": "fbcdc7e495f04b3d1f8e884c5a60d7b21c6b1d16", "title": "High-Performance Real-Time Data Processing: Managing Data Using Debezium, Postgres, Kafka, and Redis"}, {"paperId": "83e954b87747a1f5ee83b97ff948e8facab0b30a", "title": "Pathfinder: Building the Enterprise Data Map"}, {"paperId": "759ee1a0a480a692bf219734a09d13b0131670b2", "title": "Modeling and Verifying Producer-Consumer Communication in Kafka Using CSP"}, {"paperId": "39134108b1753b2fc5403a4876a11d8fa6104232", "title": "Building and Operating a Large-Scale Enterprise Data Analytics Platform"}, {"paperId": "eb45d21f2559271024771cdc1fbb457609a776f7", "title": "A Survey on Networked Data Streaming With Apache Kafka"}, {"paperId": "21efd5dac6cdb9b82da37ee31d00f2777150ca4f", "title": "Data Stream Summary in Big Data Context: Challenges and Opportunities"}]}
