{"paperId": "58e504db323790d3499e9510934c324767cca38c", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Available techniques in hadoop small file issue", "abstract": "Hadoop is an optimal solution for big data processing and storing since being released in the late of 2006, hadoop data processing stands on master-slaves manner [1] that’s splits the large file job into several small files in order to process them separately, this technique was adopted instead of pushing one large file into a costly super machine to insights some useful information. Hadoop runs very good with large file of big data, but when it comes to big data in small files it could facing some problems in performance, processing slow down, data access delay, high latency and up to a completely cluster shutting down [2]. In this paper we will high light on one of hadoop’s limitations, that’s affects the data processing performance, one of these limits called “big data in small files” accrued when a massive number of small files pushed into a hadoop cluster which will rides the cluster to shut down totally. This paper also high light on some native and proposed solutions for big data in small files, how do they work to reduce the negative effects on hadoop cluster, and add extra performance on storing and accessing mechanism.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-04-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "145301387", "name": "M. Masadeh"}, {"authorId": "37890319", "name": "M. S. Azmi"}, {"authorId": "2109858578", "name": "Sharifah Sakinah Syed Ahmad"}], "citations": [{"paperId": "d8103ed09071b179e5485b435c04f7e7b2316269", "title": "Tiny datablock in saving Hadoop distributed file system wasted memory"}, {"paperId": "0c11fa22a2f5f97c07ef66441e25c96007245a21", "title": "An Information Fusion Technology for Statistical Analysis of Computer Professional Certificates"}, {"paperId": "fbc394dba195d10171daddda0127b2e539b54d7b", "title": "Application Analysis of Hadoop in Big Data Processing"}, {"paperId": "3d95235093ba4fe8ef67aa2cca6e8b4709e54dff", "title": "Small files' problem in Hadoop: A systematic literature review"}]}
