{"paperId": "58f2a36276932939ba573425fd66a1011ac973eb", "publicationVenue": {"id": "f52af9ba-fc6b-4fc9-80b5-04d39692faec", "name": "Revista de la Sociedad Geológica de España", "alternate_names": ["Rev Soc Geológica Esp"], "issn": "0214-2708", "url": "http://www.revistasge.es/"}, "title": "Mapping hydrothermal alterations and lineaments associated with epithermal and massive sulphides deposits of Tifraouine (northwest Algerian coast): Use of Landsat 8 OLI data and remote sensing", "abstract": "Within the context of studying mineralizations related to the Miocene volcanic rocks from the northern part of Algeria, Landsat 8 OLI data and remote sensing techniques are carried out to characterize and map hydrothermal alteration outcrops in the Miocene volcanic rocks of Tifraouine on the northwestern Algerian coast, where several indications of mineralization are known. Short-wave infrared (SWIR) bands allowed for the identification of clay alterations, while the visible and near-infrared bands help in the detection of iron alterations. Red-green-blue color combination images of 6/7, 4/2 and 5/6 ratios were produced. Principal component analysis (PCA) was computed to characterise altered zones and extract lineaments. Matched filtering technique (MF) allows direct detection after applying minimum noise fraction (MNF) transformation and pixel purity index to the spectra in order to obtain a distribution map of the target mineral species in studied area.  The remote sensing results combined with the structural geological data determine a relationship between mineralization and structural features and show that hydrothermal alterations are clearly controlled by tectonic. They are highly concentrated in the calderas zone and extend towards the Bouzedjar area which allowed checking the map performed according to the field studies. This will contribute to preliminary studies related to mineral exploration and enhance the mining potential of Tifraouine. The acquisition of supplementary data would allow us to extend this study in coming works.", "venue": "Revista de la Sociedad Geológica de España", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-19", "journal": {"name": "Revista de la Sociedad Geológica de España"}, "authors": [{"authorId": "2221819464", "name": "Bouchera Labdaoui"}, {"authorId": "35708317", "name": "Hanafi Benali"}, {"authorId": "2221819475", "name": "Amina Boughacha"}, {"authorId": "2208541077", "name": "Khadidja Moussaoui"}], "citations": []}
