{"paperId": "58fd70557100210c9c3cc658cbf1267cb1607766", "publicationVenue": {"id": "90b142da-9c11-4f10-a910-546c1e0795db", "name": "Science and Technology for the Built Environment", "type": "journal", "alternate_names": ["Sci Technol Built Environ"], "issn": "2374-4731", "url": "http://www.tandfonline.com/loi/uhvc21"}, "title": "Classification of sequencing logic faults in multiple zone air handling units: A review and case study", "abstract": "This paper classifies common sequencing logic faults in multiple zone variable air volume (VAV) air handling unit (AHU) systems by conducting a critical review of the literature. Six broad categories of sequencing logic faults are identified affecting the state of operation, mode of operation, and supply air temperature and duct static pressure setpoint reset programs. A case study with building automation system (BAS) trend data from two VAV AHU systems is conducted to provide examples of these sequencing logic faults. Four of the six fault types are found present in at least one of the two AHUs. The most significant fault discovered was an incorrect reference to a nonexistent VAV terminal damper address forcing an unnecessarily high duct static pressure setpoint and wasting fan electricity. The BAS programs are reviewed in consultation with the operations staff, and the coding mistakes leading to the detected anomalous behavior are identified.", "venue": "Science and Technology for the Built Environment", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-03-27", "journal": {"name": "Science and Technology for the Built Environment", "pages": "577 - 594", "volume": "28"}, "authors": [{"authorId": "3149011", "name": "Burak Gunay"}, {"authorId": "102243196", "name": "Narges Torabi"}, {"authorId": "97718589", "name": "Scott Shillinglaw"}], "citations": [{"paperId": "632afdfee350711a96d1d9fb5839c0a37ccf6b2f", "title": "Deployment of real-time building automation system-integrated inverse-model-based fault detection and diagnostics algorithms"}, {"paperId": "a48afbbac7dd6006f1fb3ea2409c424482f536b4", "title": "Estimating energy savings from HVAC controls fault correction through inverse greybox model-based virtual metering"}, {"paperId": "ebfff500bb71c369c266364778ff4478765c2f73", "title": "Fault-tolerant sequences of operation for VAV AHU systems through building performance simulation"}, {"paperId": "679a58d10d23d85ccebe5ead5af2884611f412ef", "title": "Predictive Maintenance 4.0 for Chilled Water System at Commercial Buildings: A Systematic Literature Review"}, {"paperId": "6c4d8b62139c83ff81dc84d619692b538a2efb4f", "title": "A holistic sequential fault detection and diagnostics framework for multiple zone variable air volume air handling unit systems"}]}
