{"paperId": "59022f7156a9cc71146facec96c872563a1e8fed", "publicationVenue": {"id": "e0174555-0649-4c3e-b2d8-519443892039", "name": "International Conference on Artificial Intelligence and Soft Computing", "type": "conference", "alternate_names": ["Int Conf Artif Intell Soft Comput", "ICAISC"], "url": "http://www.wikicfp.com/cfp/program?id=1277"}, "title": "A Survey on IEEE 802.15.7 MAC Protocols for Visible Light Communication", "abstract": "Networks that use visible light communication (VLC) are suitable for meeting 5G and 6G criteria. The VLC is a new wireless high-speed communication technology. To meet the bandwidth requirements of bandwidth-hungry devices, VLC makes use of the illumination infrastructure. VLC is an excellence alternative to communication 6G technologies because of its immunology to electromagnetic interference, high data rate, high reuse factor and capacity to operate in an unlicensed band. Although the standard of IEEE 802.15.7 would provide detailed physical and medium access control layer standards, the emerging VLC technology confronts MAC issues. However, MAC-specific solutions in wireless networks need not resolve VLC network issues. Full-duplex capability, deafness, channel use, hidden nodes, and connectivity should all be considered in VLC MAC approaches.", "venue": "International Conference on Artificial Intelligence and Soft Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-01-23", "journal": {"name": "2023 1st International Conference on Advanced Innovations in Smart Cities (ICAISC)", "pages": "1-6"}, "authors": [{"authorId": "2156467678", "name": "Abdulwadood Alawadhi"}, {"authorId": "102330835", "name": "Abdullah Almogahed"}, {"authorId": "145686174", "name": "M. Omar"}], "citations": [{"paperId": "1b1886858c7901dda7171f911601bdf79bc31659", "title": "Towards Multi-channel GTS Allocation in Visible Light Communication"}, {"paperId": "d4a1dc6746c8ba568bc37824b11095bf841144b1", "title": "Deep Learning Techniques in Mobile Edge Computing for Internet of Medical Things"}]}
