{"paperId": "5904771d7ffe082fc9c32c7e58583aa6122c0c5d", "publicationVenue": {"id": "31a8e656-4f9b-4810-8247-2637bb691d5c", "name": "Management of environmental quality", "type": "journal", "alternate_names": ["Management of Environmental Quality: An International Journal", "Manag environ qual", "Manag Environ Qual Int J"], "issn": "1477-7835", "url": "https://www.emerald.com/insight/publication/issn/1477-7835"}, "title": "Macroeconomic and financial determinants of green growth: an empirical investigation on BRICS-T countries", "abstract": "PurposeThe purposes of this study are to contribute to the limited green growth (GG) literature in emerging markets, to analyze GG from a financial economy perspective and to determine the contribution of financial development and innovation to GG in Brazil, Russian Federation, India, China and South Africa and Türkiye (BRICS-T). BRICS-T countries significantly impact the world population, international politics, energy resources and economy. In addition, BRICS-T countries are one of the leading countries in the world with their sustainability efforts. Investigating the GG model in these countries may contribute to structuring emerging economies around the principles of GG and advancing global green transformation efforts.Design/methodology/approachThe authors applied panel data analysis from 2001 to 2019. GG is economic growth free from environmental depletion in the model. National income, personnel expenditure and foreign direct investments are macroeconomic variables. These variables measure economic development and promote economic and social progress, which is essential for GG. Capital accumulation and innovation are essential tools in GG transformation. Therefore, financial development and patent applications represent the moderating variables. The authors estimate the fixed effect model with Parks-Kmenta robust.FindingsEmpirical results show that national income growth and foreign direct investments positively affect GG. Personnel expenditure negatively affects GG. On the contrary, financial development and patent growth have little moderating role.Originality/valueThis study contributes to the literature on creating a GG model in emerging countries. The study is original in its model and sample.", "venue": "Management of environmental quality", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "Management of Environmental Quality: An International Journal"}, "authors": [{"authorId": "113114454", "name": "S. Arzova"}, {"authorId": "1657363228", "name": "B. Sahin"}], "citations": []}
