{"paperId": "59065bd64173cad07e09308a91b530aab41b52cc", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "An In-Depth Survey Demystifying the Internet of Things (IoT) in the Construction Industry: Unfolding New Dimensions", "abstract": "In this digital era, many industries have widely adopted the Internet of Things (IoT), yet its implementation in the construction industry is relatively limited. Integration of Construction 4.0 drivers, such as business information modeling (BIM), procurement, construction safety, and structural health monitoring (SHM), with IoT devices, provides an effective framework for applications to enhance construction and operational efficiencies. IoT and Construction 4.0 driver integration research, however, is still in its infancy. It is necessary to understand the present state of IoT adoption in the Construction 4.0 context. This paper presented a comprehensive review to identify the IoT adoption status in the Construction 4.0 areas. Furthermore, this work highlighted the potential roadblocks to IoT’s seamless adoption that are unique to the areas of Construction 4.0 in developing countries. Altogether, 257 research articles were reviewed to present the current state of IoT adoption in developed and developing countries, as well as the topmost barriers encountered in integrating IoT with the key Construction 4.0 drivers. This study aimed to provide a reference for construction managers to observe challenges, professionals to explore the hybridization possibilities of IoT in the context of Construction 4.0, and laymen to understand the high-level scientific research that underpins IoT in the construction industry.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "145829754", "name": "K. Khurshid"}, {"authorId": "146048215", "name": "A. Danish"}, {"authorId": "147590477", "name": "M. U. Salim"}, {"authorId": "2171059101", "name": "Muhammed Bayram"}, {"authorId": "6485903", "name": "T. Ozbakkaloglu"}, {"authorId": "118227251", "name": "M. A. Mosaberpanah"}], "citations": [{"paperId": "f0903bd50be12ca8446b3644406533667bc9683d", "title": "A survey-based approach of framework development for improving the application of internet of things in the construction industry of Malaysia"}, {"paperId": "ac25ecc0e504d1b3d35dc85238bbe349c5dab542", "title": "Mixed reality-based active Hazard prevention system for heavy machinery operators"}, {"paperId": "d231810f637af6389fe32c07ee60945752b874ab", "title": "An assessment of barriers to digital transformation in circular Construction: An application of stakeholder theory"}, {"paperId": "66eb43565d6f9bacefd6e084dcbe4a12e2e8e973", "title": "WHAT HINDERS INTERNET OF THINGS (IOT) ADOPTION IN THE CHINESE CONSTRUCTION INDUSTRY: A MIXED-METHOD"}, {"paperId": "99f1e73ebe673a8e33a96a25fdb3376bf9048c58", "title": "Tech-Business Analytics in Tertiary Industry Sector"}, {"paperId": "e5e4f916b41bb92318ce89f6ffb708437c2bebe8", "title": "DCSP: A Delay and cost-aware service placement and load distribution algorithm for IoT-based fog networks"}, {"paperId": "4561e0c2d7163af7484c4b7bdc0d62771df929ba", "title": "Tech-Business Analytics in Secondary Industry Sector"}, {"paperId": "aab0f86a19110862faff11725c036be9d56eb087", "title": "Identifying Emerging Technologies and Skills Required for Construction 4.0"}, {"paperId": "b346f40fd15668159676a053220aca9f5b09a49f", "title": "Skeletal Space Structure Systems: Select Areas of Opportunity to Achieve Sustainability in Construction"}, {"paperId": "1e9d3a4f03dc997b362ed9e1aea9b2195bf6a732", "title": "Construction 4.0 in a narrow and broad sense: A systematic and comprehensive literature review"}, {"paperId": "cd0a5f84fe920820c8b1a8b4e20527422cca250b", "title": "Prediction of Hospital Readmission using Federated Learning"}, {"paperId": "3c48844f1810d22c208f8fc29d1cb2eed9ce6b96", "title": "Lean and Iot Integration to Improve Flow in Construction Prefabrication: a Proposed Framework"}, {"paperId": "8bf6b239ab149fab30813c60610ae401b65658b8", "title": "CURRENT APPLICATIONS AND CHALLENGES OF THE INTERNET OF THINGS"}, {"paperId": "a18bb757bfe07f75430de5e0d258575e73c266af", "title": "Exploring Leaders’ Perceptions of the Business Case for Digitalisation in the Construction Industry"}, {"paperId": "bbd1e5cb9c3d090f5b762596aa9746f321bf9f37", "title": "A Systematic Review of the Digital Transformation of the Building Construction Industry"}, {"paperId": "b2518a3fbfc57041f717b1bba6732afcf986e646", "title": "Artificial Intelligence (AI) and Internet of Things (IoT) - based sensors for monitoring and controlling in architecture, engineering, and construction: applications, challenges, and opportunities"}, {"paperId": "c336706112882e1ee54935a4156e2bacc233ae57", "title": "Leading-edge wearable technologies in enhancing personalized safety on construction sites: a review"}]}
