{"paperId": "590bffb7523c4854a7f606301861632396f50723", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "Non-Terrestrial Networks with UAVs: A Projection on Flying Ad-Hoc Networks", "abstract": "Non-terrestrial networks (NTNs) have recently attracted elevated levels of interest in large-scale and ever-growing wireless communication networks through the utilization of flying objects, e.g., satellites and unmanned aerial vehicles/drones (UAVs). Interestingly, the applications of UAV-assisted networks are rapidly becoming an integral part of future communication services. This paper first overviews the key components of NTN while highlighting the significance of emerging UAV networks where for example, a group of UAVs can be used as nodes to exchange data packets and form a flying ad hoc network (FANET). In addition, both existing and emerging applications of the FANET are explored. Next, it provides key recent findings and the state-of-the-art of FANETs while examining various routing protocols based on cross-layer modeling. Moreover, a modeling perspective of FANETs is provided considering delay-tolerant networks (DTN) because of the intermittent nature of connectivity in low-density FANETs, where each node (or UAV) can perform store-carry-and-forward (SCF) operations. Indeed, we provide a case study of a UAV network as a DTN, referred to as DTN-assisted FANET. Furthermore, applications of machine learning (ML) in FANET are discussed. This paper ultimately foresees future research paths and problems for allowing FANET in forthcoming wireless communication networks.", "venue": "Drones", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-31", "journal": {"name": "Drones"}, "authors": [{"authorId": "40399241", "name": "Mahyar Nemati"}, {"authorId": "1712236977", "name": "Bassel Al Homssi"}, {"authorId": "2070220862", "name": "S. Krishnan"}, {"authorId": "48490823", "name": "Jihong Park"}, {"authorId": "1704577", "name": "S. Loke"}, {"authorId": "2118887887", "name": "Jinho Choi"}], "citations": [{"paperId": "ab4249e9f758ede75ee22ccf28d3717c418072e6", "title": "Emerging Technologies for 6G Non-Terrestrial-Networks: From Academia to Industrial Applications"}, {"paperId": "7498b3bf68a1c091c718d82682dd82645281c34d", "title": "Study of Multimedia Traffic and Loss in High-Altitude Platform-Assisted VANET"}, {"paperId": "4c23135166f8743002c0464b1c6eb0fb22c8a8f8", "title": "Coverage Strategy for Small-Cell UAV-Based Networks in IoT Environment"}, {"paperId": "16e799f27cf0cc0f5b86bc60914283d2e974d1ea", "title": "A Survey on AI-Empowered Security Solutions for 6G"}, {"paperId": "3d09cbcbb9da68b76cd5a45df30fa1e174f04aa6", "title": "Energy-Efficient UAV-Assisted IoT Data Collection via TSP-Based Solution Space Reduction"}, {"paperId": "ee87c08ec2f8b33794de1d48a8cfc842078c0260", "title": "Low-Power IoT for Monitoring Unconnected Remote Areas"}, {"paperId": "e01dc59ce7cae9e8554a7cd17704cc289dd471d3", "title": "UAV-Based Volumetric Measurements toward Radio Environment Map Construction and Analysis"}, {"paperId": "0f9d40d03e4f18c0f3fc10d76b2419eff91cb2a9", "title": "A Self-Organized Automated System to Control Unmanned Aerial Vehicles for Object Detection"}]}
