{"paperId": "591b3b8c385509748c441110ac7ea9db9bfd1334", "publicationVenue": {"id": "0caa0325-8382-447c-b35f-7e23dfb6e4f9", "name": "Australian Journal of Civil Engineering", "type": "journal", "alternate_names": ["Aust j civ eng", "Aust J Civ Eng", "Australian journal of civil engineering"], "issn": "1448-8353", "alternate_issns": ["1440-7027"], "url": "http://www.tandfonline.com/loi/tmec20#.VbruUrXsRF4"}, "title": "Evaluation of uniformity on zinc-coated (galvanised) steel pipes applied to natural gas installations in civil construction", "abstract": "ABSTRACT Some natural gas distributors for residential and commercial buildings in Brazil use galvanised steel tubes and fittings manufactured by the hot-dip zinc process that is supported by the specifications contained in the Brazilian Standards. Zinc coating is one of the most widely used methods to provide protection against corrosion. It is therefore essential that national and international tube manufacturers and installation and maintenance companies in civil construction also meet the defined national and international standards, especially when the tubes and fittings are used for natural gas in residential buildings. Descriptions, characterisations, and comparisons are made by the Copper Sulphate Solution test of the zinc coating (g/m2), and defects can occur in the zinc layer using metallographic analysis. Considering that the Copper Sulphate Solution test not only evaluates the uniformity but also assesses the porosity of the coating on galvanised steel elements, some pipes available in the Brazilian market do not comply with the standards. At least 70% of the test specimens were rejected by the Brazilian standards.", "venue": "Australian Journal of Civil Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-17", "journal": {"name": "Australian Journal of Civil Engineering", "pages": "444 - 453", "volume": "20"}, "authors": [{"authorId": "30932322", "name": "F. Mainier"}, {"authorId": "2142288928", "name": "Rodolfo Gomes Shamá Dos Santos"}, {"authorId": "94282889", "name": "R. J. Mainier"}], "citations": [{"paperId": "edc86df5437f6adc896b6b5bd88c543c59b70526", "title": "Chemical deposition and corrosion perspectives on the development of pipe union steel in automobile industry"}]}
