{"paperId": "591f129a2b9736dbd0294e150a9d13d7fc3b533d", "publicationVenue": null, "title": "Deep Neural Network Model for Identification of Predictive Variables and Evaluation of Student's Academic Performance", "abstract": "An important concern for students at all levels, from universities to colleges to junior high and high school, is predicting academic achievement and individual performance. Class tests, homework, lab exams, general tests, and final exams all have an impact on a student's academic success or failure. Students' progress can be assessed by looking at their grades in core subjects and electives. The majority of research, on the other hand, says that a student's achievement is best measured by graduation. Researchers set out to develop mathematical models that may be utilized to forecast student academic performance evaluations based on internal and external type predictive indicators. Multiple predictive variables are taken into account for the assessment of student performance while modelling an efficient template for student performance assessment. The proposed model uses Deep Neural Network (DNN) in the process of considering the predictive variables and evaluating student performance using the variables. The proposed model is compared with the traditional models and the results represent that the proposed model accuracy levels are high contrasted to existing models.", "venue": "Rev. d'Intelligence Artif.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-31", "journal": {"name": "Rev. d'Intelligence Artif.", "pages": "409-415", "volume": "35"}, "authors": [{"authorId": "72805083", "name": "K. Neha"}, {"authorId": "2090021880", "name": "Jahangeer Sidiq"}, {"authorId": "145761184", "name": "Majid Zaman"}], "citations": [{"paperId": "588ff0e950454f5dd463d0aeefbb27de95a905a2", "title": "Analysis of educational data enabled by deep learning to increase student success"}, {"paperId": "50c6a7e8c4279b9639f8ba002c9fca150d220632", "title": "A Systematic Study on Student Performance Prediction from the Perspective of Machine Learning and Data Mining Approaches"}, {"paperId": "499cbc77762af0f3cfcd02fe2d367ad2840b8b05", "title": "Recent advances in Predictive Learning Analytics: A decade systematic review (2012–2022)"}]}
