{"paperId": "5929a2b0b6a256a08917a39bc2ae298cd4759c67", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Fine-Grained Multi-Query Stream Processing on Integrated Architectures", "abstract": "Exploring the sharing opportunities among multiple stream queries is crucial for high-performance stream processing. Modern stream processing necessitates accelerating multiple queries by utilizing heterogeneous coprocessors, such as GPUs, and this has shown to be an effective method. Emerging CPU-GPU integrated architectures 6integrate CPU and GPU on the same chip and eliminate PCI-e bandwidth bottleneck. Such a novel architecture provides new opportunities for improving multi-query performance in stream processing but has not been fully explored by existing systems. We introduce a stream processing engine, called FineStream, for efficient multi-query window-based stream processing on CPU-GPU integrated architectures. FineStream's key contribution is a novel fine-grained workload scheduling mechanism between CPU and GPU to take advantage of both architectures. Particularly, FineStream is able to efficiently handle multiple queries in both static and dynamic streams. Our experimental results show that 1) on integrated architectures, FineStream achieves an average 52 percent throughput improvement and 36 percent lower latency over the state-of-the-art stream processing engine; 2) compared to the coarse-grained strategy of applying different devices for multiple queries, FineStream achieves 32 percent throughput improvement; 3) compared to the stream processing engine on the discrete architecture, FineStream on the integrated architecture achieves 10.4× price-throughput ratio, 1.8× energy efficiency, and can enjoy lower latency benefits.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2303-2320", "volume": "32"}, "authors": [{"authorId": "1884418505", "name": "Feng Zhang"}, {"authorId": "2111338876", "name": "Chenyang Zhang"}, {"authorId": "2155557933", "name": "Lin Yang"}, {"authorId": "2107944044", "name": "Shuhao Zhang"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "2153424524", "name": "Wei Lu"}, {"authorId": "144589756", "name": "Xiaoyong Du"}], "citations": [{"paperId": "97c842066203f838de9bdb8358ced9cdc81d4aa3", "title": "General-purpose data stream processing on heterogeneous architectures with WindFlow"}, {"paperId": "b86c75e2a1edabe452bd73b3afc29cec7f43e0d7", "title": "Accelerating network analytics with an on-NIC streaming engine"}, {"paperId": "13648e055c16b76822a8e9b53b6ee88ba94ab81e", "title": "SmartNIC-Accelerated Stream Processing Analytics"}, {"paperId": "63515650fa2f89ba35a0075d1e3f084124ce76c1", "title": "An adaptive load balancing strategy for stateful join operator in skewed data stream environments"}, {"paperId": "3f88b30c63cb50478fa45c25629f60314f69b89c", "title": "Enabling Efficient Random Access to Hierarchically Compressed Text Data on Diverse GPU Platforms"}, {"paperId": "e62ec1ac230b0c59d67c7ba157e8161c2639de4e", "title": "Heterogeneous programming using OpenMP and CUDA/HIP for hybrid CPU-GPU scientific applications"}, {"paperId": "e25a4ece79160c9817a38e80f77d729ca7487d48", "title": "GeaFlow: A Graph Extended and Accelerated Dataflow System"}, {"paperId": "4c0e91e6e8349f462d529d950a41c489427a22e2", "title": "CompressStreamDB: Fine-Grained Adaptive Stream Processing without Decompression"}, {"paperId": "5c03e7f2146a80d9917c9761e8337b810a467e99", "title": "Optimizing Random Access to Hierarchically-Compressed Data on GPU"}, {"paperId": "3f6274082da696e91d2155dada93f36f4d38b25f", "title": "Exploring Data Analytics Without Decompression on Embedded GPU Systems"}, {"paperId": "e43272b6d0cf8c6bb5931c226dc5dd47cf88b0df", "title": "The Metaverse Data Deluge: What Can We Do About It?"}, {"paperId": "4514c62e2da99046fe90f51b5808dec650c3c95f", "title": "STRETCH: Virtual Shared-Nothing Parallelism for Scalable and Elastic Stream Processing"}, {"paperId": "19dc742f583a37aa91c28c473db9dc4e32041758", "title": "LMStream: When Distributed Micro-Batch Stream Processing Systems Meet GPU"}, {"paperId": "1d1d7d6bba6074db3820ed7a8692eddb43055097", "title": "Performance Analysis of Distributed GPU-Accelerated Task-Based Workflows"}, {"paperId": "7c6ed0ff29cb7298082527c4cba6f9869097a05b", "title": "Exploring Query Processing on CPU-GPU Integrated Edge Device"}, {"paperId": "9602241f2e0fcc43e1d99e17c4bb4404eca8780b", "title": "Sense The Physical, Walkthrough The Virtual, Manage The Metaverse: A Data-centric Perspective"}]}
