{"paperId": "592d311938b6d8081d66802106a040eb37264dac", "publicationVenue": {"id": "855d4173-dc30-48dc-96c2-42a5b6372940", "name": "IEEE Transactions on Emerging Topics in Computing", "type": "journal", "alternate_names": ["IEEE Trans Emerg Top Comput"], "issn": "2168-6750", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245516", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516"]}, "title": "Emulating the Effects of Radiation-Induced Soft-Errors for the Reliability Assessment of Neural Networks", "abstract": "Convolutional Neural Networks (CNNs) are currently one of the most widely used predictive models in machine learning. Recent studies have demonstrated that hardware faults induced by radiation fields, including cosmic rays, may significantly impact the CNN inference leading to wrong predictions. Therefore, ensuring the reliability of CNNs is crucial, especially for safety-critical systems. In the literature, several works propose reliability assessments of CNNs mainly based on statistically injected faults. This work presents a software emulator capable of injecting real faults retrieved from radiation tests. Specifically, from the device characterisation of a DRAM memory, we extracted event rates and fault models. The software emulator can reproduce their incidence and access their effect on CNN applications with a reliability assessment precision close to the physical one. Radiation-based physical injections and emulator-based injections are performed on three CNNs (LeNet-5) exploiting different data representations. Their outcomes are compared, and the software results evidence that the emulator is able to reproduce the faulty behaviours observed during the radiation tests for the targeted CNNs. This approach leads to a more concise use of radiation experiments since the extracted fault models can be reused to explore different scenarios (e.g., impact on a different application).", "venue": "IEEE Transactions on Emerging Topics in Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Transactions on Emerging Topics in Computing", "pages": "1867-1882", "volume": "10"}, "authors": [{"authorId": "1379947696", "name": "Lucas Matana Luza"}, {"authorId": "67191344", "name": "Annachiara Ruospo"}, {"authorId": "52267401", "name": "D. Söderström"}, {"authorId": "10359239", "name": "C. Cazzaniga"}, {"authorId": "31697961", "name": "M. Kastriotou"}, {"authorId": "121921445", "name": "Ernesto Sánchez"}, {"authorId": "145966646", "name": "A. Bosio"}, {"authorId": "1746253", "name": "L. Dilillo"}], "citations": [{"paperId": "7782b0d3381a2c8ce466cf17a8ece8358d767fda", "title": "Concurrent Linguistic Error Detection (CLED) for Large Language Models"}, {"paperId": "24396debe0dab49830f4028d07f49ae3cf8ad154", "title": "A Novel Approach to Extract Embedded Memory Design Parameter Through Irradiation Test"}, {"paperId": "edec2dde49f92173627a516d47bb91777d2819a2", "title": "Resilience Assessment of Large Language Models under Transient Hardware Faults"}, {"paperId": "0407bd24790ca131921c0ed851243a8d77bec6cb", "title": "On the resilience of representative and novel data formats in CNNs"}, {"paperId": "306dbeb0feb7f0cc2c4eb525b18d0b43dd0f8875", "title": "Investigating the effect of approximate multipliers on the resilience of a systolic array DNN accelerator"}, {"paperId": "5276c1d4e6d6088df3dda5a16dd4b1fb8604a2e0", "title": "Investigation of edge computing hardware architectures processing tiny machine learning under neutron-induced radiation effects"}, {"paperId": "f29c76c6e298765881e9105111a11a0d9a7d7e01", "title": "Resilience of Deep Learning applications: a systematic survey of analysis and hardening techniques"}, {"paperId": "75a720f3ba11b12ff2a5954fa1415732d71dacde", "title": "Bottlenecks in Secure Adoption of Deep Neural Networks in Safety-Critical Applications"}, {"paperId": "6bc1f3e5ec5575c8ec14c6427b978bfa056c5033", "title": "A Systematic Literature Review on Hardware Reliability Assessment Methods for Deep Neural Networks"}, {"paperId": "a3b2e7ef9bb1c0268ae25fc5cbb5fb0ba3cefbd9", "title": "Testability and Dependability of AI Hardware: Survey, Trends, Challenges, and Perspectives"}, {"paperId": "977b33b3d1189f430f62afd5c6c2a7601c1b5eb3", "title": "Tolerance of Siamese Networks (SNs) to Memory Errors: Analysis and Design"}, {"paperId": "d88a8e89fe05055bfa7cfa773ef886ccb00c9ce4", "title": "A Fast Reliability Analysis of Image Segmentation Neural Networks Exploiting Statistical Fault Injections"}, {"paperId": "2570d756601f81c017e8e2ad7aaba889810b8035", "title": "A Survey on Deep Learning Resilience Assessment Methodologies"}, {"paperId": "108819e72ca74f7168c23c83851205e18d93d743", "title": "LLTFI: Framework Agnostic Fault Injection for Machine Learning Applications (Tools and Artifact Track)"}, {"paperId": "0e56c7adff8e5c946376ffb2fc9a80e139844a3e", "title": "Open-Set Recognition: an Inexpensive Strategy to Increase DNN Reliability"}, {"paperId": "b3cae2ee2f662a1dd1b522a182ce86b622918c6c", "title": "Exploiting Approximate Computing for Efficient and Reliable Convolutional Neural Networks"}, {"paperId": "dc3b5aa5eb1b068a7ef9e1644d7c75c71ef9719e", "title": "Dependability of Alternative Computing Paradigms for Machine Learning: hype or hope?"}, {"paperId": "66b2da73353745dbda14dcd5b277a33d07b9ceb0", "title": "Machine learning application to space particle discrimination from multiple-cell upsets in a memory device"}]}
