{"paperId": "593728eb51c466334b0c8bc0d9d96a6444682bc8", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Improved Metaheuristic-Driven Energy-Aware Cluster-Based Routing Scheme for IoT-Assisted Wireless Sensor Networks", "abstract": "The Internet of Things (IoT) is a network of numerous devices that are consistent with one another via the internet. Wireless sensor networks (WSN) play an integral part in the IoT, which helps to produce seamless data that highly influence the network’s lifetime. Despite the significant applications of the IoT, several challenging issues such as security, energy, load balancing, and storage exist. Energy efficiency is considered to be a vital part of the design of IoT-assisted WSN; this is accomplished by clustering and multi-hop routing techniques. In view of this, we introduce an improved metaheuristic-driven energy-aware cluster-based routing (IMD-EACBR) scheme for IoT-assisted WSN. The proposed IMD-EACBR model intends to achieve maximum energy utilization and lifetime in the network. In order to attain this, the IMD-EACBR model primarily designs an improved Archimedes optimization algorithm-based clustering (IAOAC) technique for cluster head (CH) election and cluster organization. In addition, the IAOAC algorithm computes a suitability purpose that connects multiple structures specifically for energy efficiency, detachment, node degree, and inter-cluster distance. Moreover, teaching–learning-based optimization (TLBO) algorithm-based multi-hop routing (TLBO-MHR) technique is applied for optimum selection of routes to destinations. Furthermore, the TLBO-MHR method originates a suitability purpose using energy and distance metrics. The performance of the IMD-EACBR model has been examined in several aspects. Simulation outcomes demonstrated enhancements of the IMD-EACBR model over recent state-of-the-art approaches. IMD-EACBR is a model that has been proposed for the transmission of emergency data, and the TLBO-MHR technique is one that is based on the requirements for hop count and distance. In the end, the proposed network is subjected to rigorous testing using NS-3.26’s full simulation capabilities. The results of the simulation reveal improvements in performance in terms of the proportion of dead nodes, the lifetime of the network, the amount of energy consumed, the packet delivery ratio (PDR), and the latency.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-24", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "51017707", "name": "Kuruva Lakshmanna"}, {"authorId": "2132721043", "name": "Neelakandan Subramani"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}, {"authorId": "2098827898", "name": "S. Alghamdi"}, {"authorId": "2173946049", "name": "Osamah Ibrahim Khalafand"}, {"authorId": "2861165", "name": "A. K. Nanda"}], "citations": [{"paperId": "770d87adfd876039a97381cddd8c49848d4aed70", "title": "A new optimal strategy for energy minimization in wireless sensor networks"}, {"paperId": "7343e1e6a51933d32d497be943e4e7f4ce4a0cca", "title": "A source location privacy protocol‐based energy‐efficient and link‐reliable multi‐scale bifurcated deep Capsnet routing in social Internet of Things"}, {"paperId": "b213e3453efc8cf5364df8a795049fef1805626f", "title": "GTFR: A Game Theory-Based Fuzzy Routing Protocol for WSNs"}, {"paperId": "0b3d45ff0225eaa3474fbe59b5f22b3fb911acaa", "title": "HOEEACR: Hybrid Optimized Energy-Efficient Adaptive Clustered Routing for WSN"}, {"paperId": "113f97fcd80c6f16589f56863591e91bcc6454b6", "title": "Performance enhancement of efficient clustering and routing protocol for wireless sensor networks using improved elephant herd optimization algorithm"}, {"paperId": "c3d6ed11deb779c551ff66b73291b755f8e83f5c", "title": "Intelligent Energy-Aware Routing Protocol in Mobile IoT Networks Based on SDN"}, {"paperId": "d3a2583f5ed2aabe7628db6399a241420a890d02", "title": "From Efficiency to Sustainability: Exploring the Potential of 6G for a Greener Future"}, {"paperId": "e58268de38c186d7b401c92be5c772d0eda68146", "title": "Black Hole Algorithm-Based Clustering Approach for Energy-Efficient Wireless Sensor Networks"}, {"paperId": "8949ca7d6cb70100a85aa37e0f05c48c5d7af35c", "title": "A Cluster Based Routing Using Energy Efficiency-Based Multi-Objective Optimization in Wireless Sensor Networks"}, {"paperId": "0a620182868a1d0c862a41e628521e41b7678ec6", "title": "Wireless Sensor Networks Consistent and Honest Routing Scheme"}, {"paperId": "3a45d445a6b540cb75bcb5562a3dadcb2328a844", "title": "Spectrum Aware Unequal Clustering with Route Selection Protocol for Energy Efficient Cognitive Radio Wireless Sensor Networks"}, {"paperId": "a1d2a0ec4e79151c2d524356733ee864061a7c7a", "title": "ECAR: Energy efficient cluster based adaptive routing for large scale WSN"}, {"paperId": "6e7269676f63e8361314780e1037e9b72c562a30", "title": "An intelligent routing algorithm for energy prediction of 6G-powered wireless sensor networks"}, {"paperId": "70ca59ef51327ff3f29a9544a2e90c433861438a", "title": "An ENERGY EFFICIENT SECURE routing Scheme using LEACH protocol IN WSNS for IOT networks"}, {"paperId": "b0408fd769a89d5cb57449c7f02b5306d40ad5a2", "title": "Duty-Cycle Optimization Method for Improving Battery-Powered DC Sensor Node Lifetime in Wireless Sensor Networks"}, {"paperId": "f87e9e0652ad4b9448f256fe894a3dc12399d18d", "title": "Digital transformation in healthcare using eagle perching optimizer with deep learning model"}, {"paperId": "c56b90c995647bb69fb6ecccb10511c36342b873", "title": "A sustainable energy strategy powered wireless sensor network system for monitoring child safety"}, {"paperId": "cd227a55c51aadbf88541cac669da91ced2f00e0", "title": "Intelligent Recommendation System Based on the Infusion Algorithms with Deep Learning, Attention Network and Clustering"}, {"paperId": "9dea16474fbbc6518ea35407e6d72de4d9a94a88", "title": "Design of Metaheuristic Optimization with Deep-Learning-Assisted Solar-Operated On-Board Smart Charging Station for Mass Transport Passenger Vehicle"}, {"paperId": "d406ddf51594fa35cfb1f9a56921b606bcbfbdf7", "title": "Trust-based clustering and best route selection strategy for energy efficient wireless sensor networks"}, {"paperId": "69bf4c47b591bb31b6470bbabba2ec5bd7069869", "title": "An optimization method in wireless sensor network routing and IoT with water strider algorithm and ant colony optimization algorithm"}, {"paperId": "7f5f8209bcd97e9a832d0ecbcecaaa6fb15f44d9", "title": "Improved African Buffalo Optimization-Based Energy Efficient Clustering Wireless Sensor Networks using Metaheuristic Routing Technique"}, {"paperId": "7138a3c7a6c4f8c70641c7ab297d6a4468f3553e", "title": "Maximizing Resource Efficiency in Wireless Networks through Virtualization and Opportunistic Channel Allocation"}, {"paperId": "1c16fc926b5b5a920cc1b5f2950771f88dd1a860", "title": "The Management of IoT-Based Organizational and Industrial Digitalization Using Machine Learning Methods"}, {"paperId": "91382e55e68beb535b55edc8d7e9e9a796b467a4", "title": "Artificial neural networks-based improved Levenberg–Marquardt neural network for energy efficiency and anomaly detection in WSN"}, {"paperId": "09d1281b8ba9d6045587419b36e1ffc570dc8db5", "title": "Design of a Telepresence Robot to Avoid Obstacles in IoT-Enabled Sustainable Healthcare Systems"}, {"paperId": "f2fdcf500a54075eece1ab9571e8ded68b65ebe3", "title": "Deep convolutional neural network with Kalman filter based objected tracking and detection in underwater communications"}, {"paperId": "a7011b9acacb6a5fcda1734bdcdd43a2e4abb1ef", "title": "A Research Survey on Security Enhancement in WSN-based IoT Applications"}, {"paperId": "36c42e35591cfea674b5c96cb2422f463382d243", "title": "Improving Energy Efficiency using Colliding Bodies Optimization based Routing Protocol for Wireless Sensor Networks"}, {"paperId": "07c314fc9add7b2cfec32065fb1914de9d5237d3", "title": "Lens-oppositional duck pack algorithm based smart home energy management system for demand response in smart grids"}, {"paperId": "e62627722bca97829cc5e101dd2dc8239478d616", "title": "Multi-objective-derived energy efficient routing in wireless sensor network using adaptive black hole-tuna swarm optimization strategy"}, {"paperId": "d15ae6c86a12a97d9c06bcea4f09b0a4d23bfc01", "title": "CapDC: A new capuchin search based algorithm for efficient data collection in Wireless Sensor Networks"}, {"paperId": "2bd36f7840df4ebc18576a24655fb4427ac6e74e", "title": "Double Q‐learning‐based adaptive trajectory selection for energy‐efficient data collection in wireless sensor networks"}, {"paperId": "1895aa21f966f97d481cf235d57513392e06e12c", "title": "Telepresence Robot with DRL Assisted Delay Compensation in IoT-Enabled Sustainable Healthcare Environment"}, {"paperId": "6b466470c5762f2db7aa998ec2fb2b4e75fddb4c", "title": "Outdoor Air Quality Monitoring with Enhanced Lifetime-enhancing Cooperative Data Gathering and Relaying Algorithm (E-LCDGRA) Based Sensor Network"}, {"paperId": "5af862f66a02412ae57de212f24b3fed0c276ed1", "title": "Hybrid Optimization-Based Multi-Path Routing for Dynamic Cluster-Based MANET"}, {"paperId": "8750846b300b394ed1201ef792d81bf7169df8b4", "title": "Application of a Multiple Regression Model for the Simultaneous Measurement of Refractive Index and Temperature Based on an Interferometric Optical System"}, {"paperId": "f33e4138c4ee6dd391d289e1849a98a456185f50", "title": "Mobility aware load balancing using Kho–Kho optimization algorithm for hybrid Li-Fi and Wi-Fi network"}, {"paperId": "6fd325ee2cd51dd7d5d1ff1a06496ff322df9462", "title": "Hybrid Algorithm based Optimal Routing Protocol for Wireless Sensor Networks"}, {"paperId": "bf861fb8bbd5409a5478ff0b42be4dec55ba511e", "title": "Handcrafted Deep-Feature-Based Brain Tumor Detection and Classification Using MRI Images"}, {"paperId": "19cee4ff6f8f7f11c65642001d92a9f2818de23b", "title": "Modified Aquila Optimization based Route Planning Model for Unmanned Aerial Vehicles Networks"}, {"paperId": "a16a30094e5eed9a8713fc653ef46ad2c60cdd90", "title": "A hybrid approach for energy‐efficient routing in IoT using duty cycling and improved ant colony"}, {"paperId": "43519bb116c08016e17e44e98bcf9795fdb454a3", "title": "Optimal Energy Efficiency Techniques and Security Enhancement in Wireless Sensor Network Using Machine Learning"}, {"paperId": "c4618767ef9d0d7e4baa89249daad969f83d1b39", "title": "A provably secure key transfer protocol for the fog-enabled Social Internet of Vehicles based on a confidential computing environment"}, {"paperId": "846cc73b78c2505cadebb5f050cff4f435fdc655", "title": "Heuristic Resource Reservation Policies for Public Clouds in the IoT Era"}, {"paperId": "d8d2b959e2b85feb98ab073e7a6e8d5cd9bb6e21", "title": "Enhanced Artificial Gorilla Troops Optimizer Based Clustering Protocol for UAV-Assisted Intelligent Vehicular Network"}, {"paperId": "31c6b0d70ecfdcc55597647e2e05374b383390b9", "title": "Artificial humming bird with data science enabled stability prediction model for smart grids"}, {"paperId": "cad0b6422b80ced8d9067e967aaa629fda43a1f3", "title": "Bug2 algorithm-based data fusion using mobile element for IoT-enabled wireless sensor networks"}, {"paperId": "829e3bb743d6332426ccafff43b128061163ab5a", "title": "Wavelet Mutation with Aquila Optimization-Based Routing Protocol for Energy-Aware Wireless Communication"}, {"paperId": "9b5a611db3f34899ec000689007371177a3f53b3", "title": "Artificial Neural Network with extreme learning machine-based Wastewater Treatment systems"}, {"paperId": "c0d29b7472fa098026b66301525e9f44bd31c218", "title": "Artificial Intelligence Based Customer Churn Prediction Model for Business Markets"}, {"paperId": "1609f3a8c1498b2eecf9279928458f65a92daa6c", "title": "Analysis of Professional Psychological Adaptability of Students Majoring in Hotel Management and Digital Operation for Higher Vocational Education under Deep Learning"}, {"paperId": "9e3be505dea1797300f4f6d8979c3db59798758d", "title": "Artificial Ecosystem-Based Optimization with an Improved Deep Learning Model for IoT-Assisted Sustainable Waste Management"}, {"paperId": "92fe784345554b5ec20fe847bb4972a592ebc005", "title": "Cyber-Attack Detection in Autonomous Vehicle Networks by Energy Aware Optimal Data Transmission with Game Fuzzy Q-Learning based Heuristic Routing Protocol"}, {"paperId": "310d67abdb384905e10e9d4fd039016b68d7ee49", "title": "Improving energy consumption prediction for residential buildings using Modified Wild Horse Optimization with Deep Learning model."}, {"paperId": "f10bb282b3bc28a8c16f8607b36294d137682619", "title": "IOT-Based Medical Informatics Farming System with Predictive Data Analytics Using Supervised Machine Learning Algorithms"}, {"paperId": "9a8b2c994c3bfa4385bdd2ffdc009865d25106c8", "title": "Regional Economic Differences and Coordinated Development Based on Panel Data Model"}, {"paperId": "9f14b5c7ae9bc945bb326799a5f1082c45b8a520", "title": "Multiple Industrial Induction Motors Fault Diagnosis Model within Powerline System Based on Wireless Sensor Network"}, {"paperId": "dcc115c65b376d6c75964bf2970878ab6c0a347d", "title": "Optimal data transmission and pathfinding for WSN and decentralized IoT systems using I-GWO and Ex-GWO algorithms"}, {"paperId": "8377bebad657398903e6104bf5dbb238e97ac1ff", "title": "Islanding Power Quality Detection using Lighting Search Optimization with Deep Learning Model on Distributed Generation Systems"}, {"paperId": "1f4c1defd160ebde13480f17bfe89ee9af711b5c", "title": "Deep Learning Distributed Architecture Design Implementation for Computer Vision"}, {"paperId": "d4456cca18b04895e126ef67f30560a6fddff588", "title": "DBN with a Developed Version of Thermal Exchange Optimization (TEO) Model for Skin Cancer Detection and Classification"}, {"paperId": "10cebd3e383fa592317044f931f3904115e4d3dc", "title": "A binary Bird Swarm Optimization technique for cloud computing task scheduling and load balancing"}, {"paperId": "535f2f42c0675d2c699888886521007fca4a5af2", "title": "A Combined Approach Based on Antlion Optimizer with Particle Swarm Optimization for Enhanced Localization Performance in Wireless Sensor Networks"}, {"paperId": "33e9176c3e7ad3a685adc3c1c802181ee6f89831", "title": "Artificial Intelligence-Based Intrusion Detection and Prevention in Edge-Assisted SDWSN With Modified Honeycomb Structure"}, {"paperId": "b50497e3c34b1e4817c213c09634891aa6731096", "title": "Wireless Sensor Network (WSN) Model Targeting Energy Efficient Wireless Sensor Networks Node Coverage"}, {"paperId": "cac127cdb841ec5879db2b766513a3da7e0ee2ee", "title": "A fuzzy logic and DEEC protocol-based clustering routing method for wireless sensor networks"}, {"paperId": "df5faed24ce8a4be0f249cdb8067c18569dbd7fc", "title": "Clustering Based on Gray Wolf Optimization Algorithm for Internet of Things over Wireless Nodes"}, {"paperId": "adebe39c8691f7cad3ee59d5ebb6da92a2ac670d", "title": "Multi-Tier Sentiment Analysis of Social Media Text Using Supervised Machine Learning"}, {"paperId": "8352ddce5d13f5e47dd83ec30e5471af555299ea", "title": "Fault Coverage-Based Test Case Prioritization and Selection Using African Buffalo Optimization"}, {"paperId": "2607c46a907ab7c3d87b5117650b98e6049bf8f5", "title": "Secure-Energy Efficient Bio-Inspired Clustering and Deep Learning-Based Routing Using Blockchain for Edge Assisted WSN Environment"}, {"paperId": "2f4c36fbc13085a7048dc7f96dfea5f7a0fc376a", "title": "Trust Aware Multi-Objective Metaheuristic Optimization Based Secure Route Planning Technique for Cluster Based IIoT Environment"}, {"paperId": "5a9a0fe4c485da060582cd16865637d380f7a5ee", "title": "New approach for optimizing the consumed energy of the TDEEC protocol based on the firefly algorithm in HWSN"}, {"paperId": "0e7f6a070d5a9d734578f8a355e339f227fcc437", "title": "Intelligent and trusted metaheuristic optimization model for reliable agricultural network"}, {"paperId": "0cf3af20141b2c19c783c674382ad3c83f2d91ce", "title": "Artiﬁcial Ecosystem-Based Optimization with an Improved Deep Learning Model for IoT-Assisted Sustainable Waste Management"}]}
