{"paperId": "595303a4cde399f5e58947a8a5e05b5eb7640147", "publicationVenue": {"id": "4144b5fb-0a80-4663-8ebf-80ca0c47231a", "name": "Vision", "type": "conference", "alternate_names": ["International Conference on Computer Vision", "Int Conf Comput Vis", "VISION"], "issn": "0917-1142", "alternate_issns": ["2411-5150", "2086-4213"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1000285", "alternate_urls": ["https://www.mdpi.com/journal/vision", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1000285"]}, "title": "A Novel Method for Detection and Progress Assessment of Visual Distortion Caused by Macular Disorder: A Central Serous Chorioretinopathy (CSR) Case Study", "abstract": "This paper presents a new mathematical model along with a measurement platform for accurate detection and monitoring of various visual distortions (VD) caused by macular disorders such as central serous chorioretinopathy (CSR) and age-related macular degeneration (AMD). This platform projects a series of graphical patterns on the patient’s retina and calculates the severity of VDs accordingly. The accuracy of this technique relies on the accurate detection of distorted lines by the patient. We also propose a simple mathematical model to evaluate the VD created by CSR. The model is used as a control for the test results achieved from the proposed platform. The proposed platform consists of the required hardware and software for the generation and projection of patterns along with the collection and processing of patients against their standard optical coherence tomography (OCT) images. Based on these results, the OCT images agree with the VD test results, and the proposed platform can be used as an alternative home monitoring method for various macular disorders.", "venue": "Vision", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "Vision", "volume": "3"}, "authors": [{"authorId": "2756860", "name": "N. Mohaghegh"}, {"authorId": "1703827", "name": "S. Magierowski"}, {"authorId": "13020253", "name": "E. Ghafar-Zadeh"}], "citations": [{"paperId": "d4630c2bb7346627aebee737a7affd0d163a737e", "title": "A Visual Distortion Sensing Model for Early Detection of Macular Disorders"}]}
