{"paperId": "59776421a26312f2e84490e3aa6aecd345311019", "publicationVenue": {"id": "6c3e705d-29b5-462c-9a3a-6c7877b74a18", "name": "JMIR Formative Research", "alternate_names": ["JMIR Form Res"], "issn": "2561-326X", "url": "https://formative.jmir.org/"}, "title": "Estimation of Bedtimes of Reddit Users: Integrated Analysis of Time Stamps and Surveys", "abstract": "Background Individuals with later bedtimes have an increased risk of difficulties with mood and substances. To investigate the causes and consequences of late bedtimes and other sleep patterns, researchers are exploring social media as a data source. Pioneering studies inferred sleep patterns directly from social media data. While innovative, these efforts are variously unscalable, context dependent, confined to specific sleep parameters, or rest on untested assumptions, and none of the reviewed studies apply to the popular Reddit platform or release software to the research community. Objective This study builds on this prior work. We estimate the bedtimes of Reddit users from the times tamps of their posts, test inference validity against survey data, and release our model as an R package (The R Foundation). Methods We included 159 sufficiently active Reddit users with known time zones and known, nonanomalous bedtimes, together with the time stamps of their 2.1 million posts. The model’s form was chosen by visualizing the aggregate distribution of the timing of users’ posts relative to their reported bedtimes. The chosen model represents a user’s frequency of Reddit posting by time of day, with a flat portion before bedtime and a quadratic depletion that begins near the user’s bedtime, with parameters fitted to the data. This model estimates the bedtimes of individual Reddit users from the time stamps of their posts. Model performance is assessed through k-fold cross-validation. We then apply the model to estimate the bedtimes of 51,372 sufficiently active, nonbot Reddit users with known time zones from the time stamps of their 140 million posts. Results The Pearson correlation between expected and observed Reddit posting frequencies in our model was 0.997 on aggregate data. On average, posting starts declining 45 minutes before bedtime, reaches a nadir 4.75 hours after bedtime that is 87% lower than the daytime rate, and returns to baseline 10.25 hours after bedtime. The Pearson correlation between inferred and reported bedtimes for individual users was 0.61 (P<.001). In 90 of 159 cases (56.6%), our estimate was within 1 hour of the reported bedtime; 128 cases (80.5%) were within 2 hours. There was equivalent accuracy in hold-out sets versus training sets of k-fold cross-validation, arguing against overfitting. The model was more accurate than a random forest approach. Conclusions We uncovered a simple, reproducible relationship between Reddit users’ reported bedtimes and the time of day when high daytime posting rates transition to low nighttime posting rates. We captured this relationship in a model that estimates users’ bedtimes from the time stamps of their posts. Limitations include applicability only to users who post frequently, the requirement for time zone data, and limits on generalizability. Nonetheless, it is a step forward for inferring the sleep parameters of social media users passively at scale. Our model and precomputed estimated bedtimes of 50,000 Reddit users are freely available.", "venue": "JMIR Formative Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-17", "journal": {"name": "JMIR Formative Research", "volume": "7"}, "authors": [{"authorId": "41219567", "name": "W. Meyerson"}, {"authorId": "50022682", "name": "S. Fineberg"}, {"authorId": "2110792481", "name": "Yeongeun Song"}, {"authorId": "2155013379", "name": "Adam Faber"}, {"authorId": "5559150", "name": "Garrett I. Ash"}, {"authorId": "2080175931", "name": "Fernanda C. Andrade"}, {"authorId": "4185333", "name": "P. Corlett"}, {"authorId": "2201323142", "name": "Mark B. Gerstein"}, {"authorId": "7305241", "name": "R. Hoyle"}], "citations": [{"paperId": "e89492cf436cb83de4fedbaa70e767137691a6ec", "title": "The association between evening social media use and delayed sleep may be causal: Suggestive evidence from 120 million Reddit timestamps."}]}
