{"paperId": "597e53b1156c7cd52af64fca7888de2641e7894a", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Sneaking Through Security: Mutating Live Network Traffic to Evade Learning-Based NIDS", "abstract": "Machine learning based network intrusion system (NIDS) is known to be vulnerable to evasions. Attackers conceal intrusion activities to make them undetected. Researching evasion techniques contributes to evaluating and increasing the robustness of NIDS. Previous evasion approaches modify feature values or packets of an offline network trace as a whole. However, in real scenarios, attackers are constrained to manipulate only outbound packets on the fly. To bridge this assumption gap, we present the first evasion solution for live network traffic against learning based NIDSs. The solution consists of three components: a devised Kalman filter based algorithm to predicate the feature values of live flows, a set of formally constructed atomic packet mutation operators, and a proposed Strength Enhanced Deep Q-learning (SE-DQN) to determine effective mutation operators on outbound packets according to the predicted features. A defense scheme based on adaptive decision threshold adjustment is also provided. Experimental evaluation is presented on various NIDS classifiers and cyber attacks. Results show that SE-DQN achieves an evasion rate of at least 64.2% on most classifiers and even more than 90% on certain ones, and it is three times faster than DQN on learning mutation policy. The defense scheme shows an improvement of at least 76.4% on recall measurement.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "2295-2308", "volume": "19"}, "authors": [{"authorId": "2371008", "name": "Shuaishuai Tan"}, {"authorId": "1971759", "name": "Xiaoxiong Zhong"}, {"authorId": "151484195", "name": "Zhiyi Tian"}, {"authorId": "3104197", "name": "Qingkuan Dong"}], "citations": [{"paperId": "526965fd8fc09a2a78da466fe7bca19c3a2941e2", "title": "Hitting Moving Targets: Intelligent Prevention of IoT Intrusions on the Fly"}, {"paperId": "e569ba3199e0c4bc62b2ef5128a02d3bf8580888", "title": "On the Robustness of ML-Based Network Intrusion Detection Systems: An Adversarial and Distribution Shift Perspective"}]}
