{"paperId": "5981cd38d7990e472e4882e2a44d6cb5e933d388", "publicationVenue": {"id": "44a8affe-ff49-4c97-915b-0e4378776101", "name": "International Journal of Emerging Technologies in Learning (iJET)", "type": "journal", "alternate_names": ["Int J Emerg Technol Learn (ijet", "International Journal of Emerging Technologies in Learning", "Int J Emerg Technol Learn", "International Journal of Emerging Technologies in Learning (ijet)"], "issn": "1863-0383", "url": "http://www.i-jet.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-jet/about", "https://www.online-journals.org/index.php/i-jet"]}, "title": "Learning Management Systems in Academic and Corporate Distance Education", "abstract": "Present-day development of information technologies is making deeper and deeper incursions into all spheres of human activity, both social and economic. It is only natural that they greatly influence the educational industry, changing the approaches, methods and forms of education. Currently e-learning and distance technologies are being actively introduced into both academic and corporate education, as complementary to traditional forms. The efforts of teachers are aimed at finding effective models of blended learning. All this determines the relevance of the present study. \nThe abstracted article is aimed at developing frameworks of a distance learning model based on the use of modern learning management systems. \nTo obtain thorough and reliable results the authors make use of two research approaches: acmeological and competence-based. They review the features, the scope and use of the existing LMS platforms and work out tools for the development of e-learning system. In addition, they assess the compliance of e-learning tools with the preferences of X, Y and Z generation users. \nThe outcome of the research is the development of a universal competency that can be applied to the study of modern methods and approaches with reference to both academic teaching and learning, and to corporate training. It is quite apparent that pros and cons of the learning management system and its possibilities should be carefully studied and thoughtfully used. The effective e-learning requires constant monitoring of equipment, proper work of host servers and considering user-friendliness of the platforms. This is related to the fact that public educational organizations, including schools, colleges and universities, especially in low developed countries, prefer traditional teaching methods and are slowly moving to innovative models. \nThe research findings can be viewed as a step forward in creating user-friendly and flexible e-learning platforms, suitable for separate users, institutions and businesses. They can be applied for further assessment of existing learning models, especially for the younger generation, and for research and development of new strategies and methods of using learning management systems and platforms.", "venue": "International Journal of Emerging Technologies in Learning (iJET)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-04", "journal": {"name": "Int. J. Emerg. Technol. Learn.", "volume": "16"}, "authors": [{"authorId": "77415898", "name": "V. Shurygin"}, {"authorId": "113957743", "name": "N. Saenko"}, {"authorId": "40911156", "name": "A. Zekiy"}, {"authorId": "2128263419", "name": "E. Klochko"}, {"authorId": "72345344", "name": "M. Kulapov"}], "citations": [{"paperId": "17dba2281f941bb376c5145385fe998e388b379a", "title": "Adaptation and usability of learning management system to the new normal dental education"}, {"paperId": "8d4fa6716a7cb80429c68da6093c288f21f70e71", "title": "Simulation of optical imaging detection based on virtual reality assisted technology in intelligent assistance system for martial arts actions"}, {"paperId": "12d69b79f538fa3be15d05a770370ceb7e2257fe", "title": "Design of Information Learning Platform Management System in Network Security"}, {"paperId": "82640ed456c7513e0935222b67e933b08385d0ea", "title": "Industrial management system in Russia: historical and comparative analysis"}, {"paperId": "3dea01ff33f52510c02df78a14f6ccab65dad404", "title": "Innovators: Advantages and Disadvantages of the Future Profession from the Perspective of Students"}, {"paperId": "9341b7e476993855f43f1d9587ac085f7de2376f", "title": "Digitalization of Russian Higher Education: Difficulties of the Transition Period"}, {"paperId": "eba235f99bc1670e8d466de6db3d618ad141bbb8", "title": "Extended E-Learning Model to Support Home Schooling with Collaboration Between Teacher, Parents and Student"}, {"paperId": "3be08a0e89f9a936258ddc675cb3ea231ae93fb5", "title": "Factors Affecting the Success of E-Learning-Based Training using Learning Management System Platforms: Adaptations of Updated DeLone and McLean Models"}, {"paperId": "6bec45a18d5c3f23d0d8f23fae5e43b3b7fed002", "title": "Implement a laboratory workshop in physics and electrotechnical disciplines in the face of COVID-19 pandemic"}, {"paperId": "cd5b711b00d7786a1577db56b9a4b3a2d8d8f0b2", "title": "Education in Universities in the Context of Distance Education"}, {"paperId": "c5ce628bd7b6dc1f7fde97c1a2547e6e345eb029", "title": "Institutionalizing Technologies in South African Universities towards the Fourth Industrial Revolution"}, {"paperId": "fc68d6b0b4da4dccd211be6aac34c8f702ae7cca", "title": "SWOT Analysis Method Application in Assessing the Effectiveness of Moodle Platform"}, {"paperId": "4347a6eb027fb3aa9b043fee26c8bfd8be9d1e8c", "title": "Modification of the Role of a Teacher Under the Conditions of Distance Learning"}, {"paperId": "59e0d97b8ca083264d3c8661962f8f23034176df", "title": "Distance Learning of Foreign Languages for Students of Economic Specialties"}, {"paperId": "4c5a7831b057a0eee5524e53fe03a022b8bac4ea", "title": "Personal Information Technology Infrastructure Quality (PITIQ) Influence on Information and System Quality in LMS Success Models"}, {"paperId": "edfc7f00c4a86142c56cb7dee49d10e409836551", "title": "INVESTIGATION OF THE EFFICIENCY OF DISTANCE LEARNING IN THE CONDITIONS OF THE PANDEMIC"}, {"paperId": "e9520fdc63ab602e60f7d450b39eb1f26bdfa248", "title": "The Possibilities of Information Technology in Higher Education: Training of Future Physicians"}]}
