{"paperId": "5983375489cb62ed47757be8335057ac16e411d8", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Joint Computation Offloading and Scheduling Optimization of IoT Applications in Fog Networks", "abstract": "In recent times, fog computing becomes an emerging technology that can exhilarate the cloud services towards the network edge for increasing the speeds up of various Internet-of-Things (IoT) applications. In this context, integrating priority-aware scheduling and data offloading allow the service providers to efficiently handle a large number of real-time IoT applications and enhance the capability of the fog networks. But the energy consumption has become skyrocketing, and it gravely affects the performance of the fog networks. To address this issue, in this paper, we introduce an Energy-Efficient Task Offloading (EETO) policy combined with a hierarchical fog network for handling energy-performance trade-off by jointly scheduling and offloading the real-time IoT applications. To achieve this objective, we formulate a heuristic technique for assigning a priority on each incoming task and formulate a stochastic-aware data offloading issue with an efficient virtual queue stability approach, namely the Lyapunov optimization technique. The proposed technique utilizes the current state information for minimizing the queue waiting time and overall energy consumption while meeting drift-plus-penalty. Furthermore, a constraint restricted progressive online task offloading policy is incurred to mitigate the backlog tasks of the queues. Extensive simulation with various Quality-of-Service (QoS) parameters signifies that the proposed EETO mechanism performs better and saves about 23.79% of the energy usage as compared to the existing ones.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "3266-3278", "volume": "7"}, "authors": [{"authorId": "78788188", "name": "A. Hazra"}, {"authorId": "2644477", "name": "Mainak Adhikari"}, {"authorId": "3332736", "name": "Tarachand Amgoth"}, {"authorId": "1698593", "name": "S. Srirama"}], "citations": [{"paperId": "8fc108a2ac8e6d2af716dbe7ac046ec2487ca0a2", "title": "A Multi-AUV Collaborative Ocean Data Collection Method Based on LG-DQN and Data Value"}, {"paperId": "3d2aa8bbf27f02dd3bc7800c1fb4d039c0737b07", "title": "Meeting the Requirements of Internet of Things: The Promise of Edge Computing"}, {"paperId": "b192f1a310a793879df1b161988d0773d2113d93", "title": "Fog Enabled Distributed Training Architecture for Federated Learning"}, {"paperId": "90ae5533c93245f93c65732082da02b2969ad290", "title": "Optimizing Internet of Things Fog Computing: Through Lyapunov-Based Long Short-Term Memory Particle Swarm Optimization Algorithm for Energy Consumption Optimization"}, {"paperId": "596a6283ea0c839fb9467dd792ce31fe366ffca1", "title": "An Intelligent Workflow Scheduling Scheme for Complex Network Robustness in Fuzzy Edge-Cloud Environments"}, {"paperId": "de04f43ccbf26b288adc22d50c5a11a3cef92196", "title": "VMAP: Matching-based Efficient Offloading in IoT-Fog Environments with Variable Resources"}, {"paperId": "34d944113b8313e43e6c3c816870cbe2acc8a439", "title": "Task Offloading Strategy for Mobile Edge Computing in Industrial Internet of Things"}, {"paperId": "fe50689565cf879a020e41065e40e2b663e2afa5", "title": "Evaluating NiFi and MQTT based serverless data pipelines in fog computing environments"}, {"paperId": "d2b769fffd59c10640054fe99652b05d02a1ae1b", "title": "Federated Analytics Informed Distributed Industrial IoT Learning With Non-IID Data"}, {"paperId": "3f05d78938c014b75c163151853368a81abc26c4", "title": "AOR: Adaptive opportunistic routing based on reinforcement learning for planetary surface exploration"}, {"paperId": "fecca003e9606b3a930b6a1b8a1f80f75e5aa188", "title": "A Decomposition-Based Approach for Multitask Scheduling With Execution Uncertainty in Industrial Internet of Things"}, {"paperId": "7e3edd3f3ff2f523bdb98dcd06229726f4c7bcec", "title": "Fog computing for next-generation Internet of Things: Fundamental, state-of-the-art and research challenges"}, {"paperId": "0db24f9f04d15d804cba3105ab6419a5ef605b0b", "title": "Energy Efficient Multi-Objective Task Allocation in Software-Defined Wireless Sensor Network"}, {"paperId": "ff1b249cbfd74569cf3a6f0dd5e00cd8cf088c4f", "title": "Mobility Aware-Task Scheduling and Virtual Fog for Offloading in IoT-Fog-Cloud Environment"}, {"paperId": "fca28e8bbdb265938e140f23c12779d8b277844f", "title": "Cooperative Transmission Scheduling and Computation Offloading With Collaboration of Fog and Cloud for Industrial IoT Applications"}, {"paperId": "79285874f6076dc100205e726c9ca9378936bf62", "title": "Collaborative AI-Enabled Intelligent Partial Service Provisioning in Green Industrial Fog Networks"}, {"paperId": "b04ffaf2fbfb5db88bdfcf2a9bbb1b73c831c8e2", "title": "Edge-Centric Secure Service Provisioning in IoT-Enabled Maritime Transportation Systems"}, {"paperId": "a06e22ad6737139e1cd0c9862e874416d54f48c1", "title": "Energy Aware Adaptive Scheduling of Workflows"}, {"paperId": "af5fdd1dd5a703b8936d32b813d9fb4400a8e29e", "title": "Software architecture for pervasive critical health monitoring system using fog computing"}, {"paperId": "f7cb845b0b790b153a021b6d61b7c07723c75732", "title": "Towards Energy-aware Scheduling of Scientific Workflows"}, {"paperId": "559f2a7940fb7cd0020e750e9b01fb36bcd6e8f4", "title": "Intelligent metaheuristics with optimal machine learning approach for malware detection on IoT‐enabled maritime transportation systems"}, {"paperId": "5ef60b02c289b62678810812242e05c76f6c6666", "title": "Deep Reinforcement Learning for Intelligent Service Provisioning in Software-Defined Industrial Fog Networks"}, {"paperId": "3e30478ff4399248254639a017a9f087582e2dc3", "title": "Hierarchical fuzzy‐based Quality of Experience (QoE)‐aware application placement in fog nodes"}, {"paperId": "c8fef140573655565fe9bf33e95023c3125ffa42", "title": "Intelligent Service Deployment Policy for Next-Generation Industrial Edge Networks"}, {"paperId": "61006e42df21ff779e5f32925ebdfbf374458651", "title": "Adaptive Partial Offloading and Resource Harmonization in Wireless Edge Computing-Assisted IoE Networks"}, {"paperId": "5c09501238fbb356a6ce6327b621d381b6d9a1bb", "title": "Intelligent Multi-AUG Ocean Data Collection Scheme in Maritime Wireless Communication Network"}, {"paperId": "cb8010c5590777bd886d12a681779ba455e44eb5", "title": "Task offloading in fog computing: A survey of algorithms and optimization techniques"}, {"paperId": "e907bb276ff5ed664486352ed89a063d682aa871", "title": "Content-centric data and computation offloading in AI-supported fog networks for next generation IoT"}, {"paperId": "a548c7f1ef30378f4433050b44cf8de7a5a411ff", "title": "Dynamic Service Deployment Strategy using Reinforcement Learning in Edge Networks"}, {"paperId": "4516c671cc232049d1e557d531c7b75f5c63ea91", "title": "Node cooperation for workload offloading in a fog computing network via multi-objective optimization"}, {"paperId": "efffb94df58f130ac7294d5105cfdac9293500d2", "title": "Resource Scheduling and Energy Consumption Optimization Based on Lyapunov Optimization in Fog Computing"}, {"paperId": "6556d14ce5dd1e21d1cdf6bb606f04b83f68c4b3", "title": "Deep learning-based energy-efficient computational offloading strategy in heterogeneous fog computing networks"}, {"paperId": "8d92dfed05d0be0fd3635be22d72801fc3cbe4d8", "title": "Hybrid metaheuristic technique for optimal container resource allocation in cloud"}, {"paperId": "db9c014b8a53c3d6416cfc16a7537566425279ad", "title": "Sustainable task offloading decision using genetic algorithm in sensor mobile edge computing"}, {"paperId": "73ca2b0a3db01d2a301d1691928f20abb1aaa2cb", "title": "Optimal Resource Allocation of Mobile Edge Computing Using Grasshopper Optimization Algorithm"}, {"paperId": "bb52dc2407e2a1914127f577d58965a9dc466795", "title": "SDN-DVFS: an enhanced QoS-aware load-balancing method in software defined networks"}, {"paperId": "5e100f0c3b426a101fed984dad2d683e9aaf789a", "title": "A Comprehensive Survey on Interoperability for IIoT: Taxonomy, Standards, and Future Directions"}, {"paperId": "352b4c51c7e8fdd6c8cbf3ef268fb779ecf30654", "title": "An efficient population-based multi-objective task scheduling approach in fog computing systems"}, {"paperId": "0bae0651fe084a2387d73fd0f9c6a8140e197151", "title": "A comprehensive survey on nature‐inspired algorithms and their applications in edge computing: Challenges and future directions"}, {"paperId": "5b942624907531a4173469a06bf7e3a02b24e8ed", "title": "Characterization of task response time in a fog-enabled IoT network using queueing models with general service times"}, {"paperId": "48a4226c2e7fdbb2f7cfdd7c1ac4af9b3fbb78e5", "title": "Software architecture for IoT-based health-care systems with cloud/fog service model"}, {"paperId": "c68abc7b4e06310684e4a29b719386ebe3f8182e", "title": "Delay-aware application offloading in fog environment using multi-class Brownian model"}, {"paperId": "3aee7bea58f2c5ac8862fa89f5864849eb8ef94b", "title": "Cybertwin-Driven Resource Provisioning for IoE Applications at 6G-Enabled Edge Networks"}, {"paperId": "d9a3ce01884eb016434ee5c3538dfcc5469cd453", "title": "Trust-based load-offloading protocol to reduce service delays in fog-computing-empowered IoT"}, {"paperId": "ffe1c2e9d7549121fbc016e8ca597e7ce2b60685", "title": "Resource provisioning for containerized applications"}, {"paperId": "77b31a7faa000091f015c65a3a8718dbfb8ec30c", "title": "Stackelberg Game for Service Deployment of IoT-Enabled Applications in 6G-Aware Fog Networks"}, {"paperId": "6a93c6d0d7ec6e3ea6764e32ab775de0419ec285", "title": "An Energy-Aware Task Offloading and Load Balancing for Latency-Sensitive IoT Applications in the Fog-Cloud Continuum"}]}
