{"paperId": "5984417faa5310b24db1e446eecacd4d94b0eb0f", "publicationVenue": {"id": "27b93d96-c4b9-4a23-a3a0-061ad54deebc", "name": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "type": "conference", "alternate_names": ["HPDC", "IEEE Int Symp High-performance Parallel Distrib Comput"], "url": "http://www.hpdc.org/"}, "title": "Profiling distributed systems in lightweight virtualized environments with logs and resource metrics", "abstract": "Understanding and troubleshooting distributed systems in the cloud is considered a very difficult problem because the execution of a single user request is distributed to multiple machines. Further, the multi-tenancy nature of cloud environments further introduces interference that causes performance issues. Most existing troubleshooting tools either focus on log analysis or intrusive tracing methods, leaving resource usage monitoring unexplored. We propose and implement LRTrace, a non-intrusive tracing and feedback control tool for distributed applications in lightweight virtualized environments. LRTrace profiles both log messages and actual resource consumptions of an application at runtime in a fine-grained manner, which is made possible by lightweight container-based virtualization. By correlating these two kinds of information, LRTrace provides users the ability to build the relationship between changes in resource consumption and application events. Furthermore, LRTrace allows users to define and implement their own feedback control plug-ins to manage the cluster in a semi-automatic manner. In system evaluation, we run Spark and MapReduce applications in a multi-tenant cluster and show that LRTrace can diagnose performance issues caused by either interference or bugs, or both. It also helps users to understand the workflows of data-parallel applications.", "venue": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-06-11", "journal": {"name": "Proceedings of the 27th International Symposium on High-Performance Parallel and Distributed Computing"}, "authors": [{"authorId": "40377061", "name": "Aidi Pi"}, {"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "30435998", "name": "Mike Ji"}], "citations": [{"paperId": "34f721457b92155a5f5ccaf5201c1a9f0f6f99be", "title": "An Assessment of ChatGPT on Log Data"}, {"paperId": "b3363328cc9289b905863e003934ae87cf0e23ad", "title": "SwissLog: Robust Anomaly Detection and Localization for Interleaved Unstructured Logs"}, {"paperId": "9ac81b28d293c66b869fe1df441be9efed9d8ab0", "title": "Always-On Recording Framework for Serverless Computations: Opportunities and Challenges"}, {"paperId": "2ac4bbcc41e4f7e1873d2f1d9eac4809868117d8", "title": "QoS-Aware Co-Scheduling for Distributed Long-Running Applications on Shared Clusters"}, {"paperId": "918c43d3062b0a661bf3668d695d0d1400b8c666", "title": "The sense of logging in the Linux kernel"}, {"paperId": "00568778f9d36071efe9ace6672151d1aef48f78", "title": "Optimizing Cloud Function Configuration via Local Simulations"}, {"paperId": "998cd4d8e9e9cf21adc983a042feaaab53389df8", "title": "Horus: Non-Intrusive Causal Analysis of Distributed Systems Logs"}, {"paperId": "b3c1e91f3f73ff1d63504fb8d522558baa7334d4", "title": "Log-based software monitoring: a systematic mapping study"}, {"paperId": "95aff3843524a65bdf70db9034d244f4e60fa62e", "title": "GradeML: Towards Holistic Performance Analysis for Machine Learning Workflows"}, {"paperId": "0dabd9986bb1a89a93419c95e42bbdc0d92617d9", "title": "TOPOSCH: Latency-Aware Scheduling Based on Critical Path Analysis on Shared YARN Clusters"}, {"paperId": "cf5aa4d99a82b08fd6a8693d2c09e52adf313e46", "title": "Contemporary Software Monitoring: A Systematic Literature Review"}, {"paperId": "94c25a510e325bc3d9c54bded9deeb9242e423a0", "title": "Troubleshooting distributed data analytics systems"}, {"paperId": "d8ff47706f6807c28907d64e2ed66eb554a041f5", "title": "Elastic Executor Provisioning for Iterative Workloads on Apache Spark"}, {"paperId": "127836fa57a52e649ebdef37a50fe0e36782d6e4", "title": "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems"}, {"paperId": "609902d394da0e57fe4def7b4911d2819df1266b", "title": "It Can Understand the Logs, Literally"}]}
