{"paperId": "5986f57057d347172bd6067c80fa1ae7d08ca38e", "publicationVenue": null, "title": "Design of Machine Learning-Based Malware Detection Methodologies in the Internet of Things Environment", "abstract": "As the Internet of Things (IoT) devices become more common, so do ways to protect against cyber-attacks. Malware prevention is hard to do because there are so many ways to get infected and IoT devices don’t have a lot of processing power for security software. To stop the spread of malware, it is important to be able to find it on devices. Because there are more and more devices and types of malicious software, machine learning needed to find Internet of Things devices that have been hacked. IoT gateway devices should use machine learning to analyze the behavior of IoT devices to make up for the fact that they do not have as much processing power. The goal of this research is to come up with an architecture for finding malware traffic that uses summarized statistical packet data instead of whole packet information. This idea just uses the traffic and destination addresses for each IoT device. This makes it easier to analyze a large number of devices by reducing the amount of data storage space and processing power needed. We used Isolation Forestand K-means clustering, which are both types of machine learning, to find malware traffic on the given architecture. When all of the statistical information was add up, the results were correct. After collecting statistical data from 26 different Internet of Things devices (divided into 9 categories), we found that the amount of data needed for analysis could be cut by more than 90% while still being correct.", "venue": "2023 International Conference for Advancement in Technology (ICONAT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-24", "journal": {"name": "2023 International Conference for Advancement in Technology (ICONAT)", "pages": "1-6"}, "authors": [{"authorId": "70244867", "name": "P. Baviskar"}, {"authorId": "145719263", "name": "Guddi Singh"}, {"authorId": "6118413", "name": "V. Patil"}], "citations": [{"paperId": "b73b4e029ff0ed01c1bbd4257565e094f4b10b57", "title": "An Efficient Machine Learning Approach for Detecting Malwares in IoT Environment"}]}
