{"paperId": "59a26f39b11924d969d03a5d4f847048d280b87b", "publicationVenue": {"id": "1155be70-4b15-4519-9cce-91d19643ef27", "name": "Journal of Artificial Intelligence Practice", "type": "journal", "alternate_names": ["J Artif Intell Pract"], "issn": "2371-8315", "url": "http://www.clausiuspress.com/journal/JAIP.html"}, "title": "Design of an AI Health Risk Assessment System for Dietary Hygiene of Key Groups Based on IoT Wearable Devices", "abstract": ": Population Spatio-temporal big data mining and analysis techniques have been applied to risk assessment of disease transmission, which can describe disease transmission pathways and high-risk areas in fine detail. Based on spatial statistical analysis and artificial intelligence technology, this study seeks to break through the previous risk warning model of a single data source from medical institutions in the era of small data and designs an AI health risk assessment system for the dietary hygiene of key populations. The system is designed to collect multi-source Spatio-temporal big data consisting of urban population positioning, a sanitary inspection of restaurant premises, foodborne disease cases in medical institutions, and environmental monitoring. Spatial location attributes are assigned to the monitoring data, and food and multi-source data are fused across borders. Through the Internet of Things (IoT) technology, the system is designed with an IoT system consisting of sensors for automatic monitoring and wearable devices for real-time warning. Based on the spatial and artificial intelligence models, the system designs personalized and real-time early warning information for critical populations to prevent dietary health risks and provide scientific basis and support for public health departments to prevent foodborne diseases.", "venue": "Journal of Artificial Intelligence Practice", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Journal of Artificial Intelligence Practice"}, "authors": [{"authorId": "2153215079", "name": "Boyuan Wang"}, {"authorId": "2152783783", "name": "Hai Lin"}, {"authorId": "1557338299", "name": "Shenglin Xia"}], "citations": []}
