{"paperId": "59c7bfea81af39a598ca78712af40a996693efa4", "publicationVenue": null, "title": "Cloud Computing based E-commerce Management Ontransaction Security Concepts", "abstract": "\n The way e-commerce companies do commerce is transformed by cloud computing. Although the usage of cloud technology in e-commerce has grown suddenly, the advantages of cloud services platforms have not yet been exploited, especially for e-commerce applications. For decision-makers, it is vital that the optimized cloud-based computing solution like software as a service (SaaS), platform as a service (PaaS), or infrastructure as a service(IaaS) model is adopted as a multi-criteria decision-making (MCDM) issue and is thus dependent on a trustworthy and secured online shop. A new Cloud computing-based E-Commerce Management (CCECM) approach is provided to tackle the MCDM issue, a multiple-criteria group approach based on an ordering preference strategy by an idealized solution,and relying on the structure for a list of requirements. A small-to-medium firm uses the suggested system to ease the assessment and decision-making of the aspects connected with cloud e-commerce with security.The results show that small and moderate-sized e-commerce companies have higher secured and efficient communication. SaaS is asuitable alternative for difficulty, dependability, safety and protection, organizational preparedness, and corporate size. At the same time, adaptability and scaling can be enhanced in the choosing of PaaS or IaaS.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-20", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "96976546", "name": "Jinling Chi"}, {"authorId": "2128331317", "name": "Xuefeng Sui"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "90943712", "name": "BalaAnand Muthu"}], "citations": [{"paperId": "74515a83fc350527b900b3a5d5eee57fb1f73bf4", "title": "Consumer Preference Measurement of Folk Culture Based on Confidence Rule Base Model"}]}
