{"paperId": "59cd27f1de997747a5fd95aadbb72fe8370815fb", "publicationVenue": null, "title": "Adoption of artificial intelligence in smart cities: A comprehensive review", "abstract": null, "venue": "Int. J. Inf. Manag. Data Insights", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-01", "journal": {"name": "Int. J. Inf. Manag. Data Insights", "pages": "100076", "volume": "2"}, "authors": [{"authorId": "2032252209", "name": "H. M. K. K. M. B. Herath"}, {"authorId": "49902691", "name": "Mamta Mittal"}], "citations": [{"paperId": "3a7c593d25f7034984afd599e439626f495c5bae", "title": "Energy efficient reliable data transmission for optimizing IoT data transmission in smart city"}, {"paperId": "f01923425287897069872c15fbe6636e2312bde9", "title": "Assessing the intention to adopt computational intelligence in interactive marketing"}, {"paperId": "6e59de21063d16c758a1c546a60cc4a8b028f22e", "title": "Critical review on water quality analysis using IoT and machine learning models"}, {"paperId": "c69aab82c392642c688a0d2da3851047ac04fe23", "title": "Utilizing a machine learning algorithm to choose a significant traffic identification system"}, {"paperId": "c41a9565acb0dea2579167f0060384470a0a28c4", "title": "Analysis of Undergraduate Students’ Metacognitive Ability in Mathematical Problem-solving using Cloud Classroom Blended Learning"}, {"paperId": "ba2c6caf117350c82f154b832417ca5fbe469931", "title": "Navigating the metaverse: A technical review of emerging virtual worlds"}, {"paperId": "aa0357b542acee388c13b76a339ab42936a67025", "title": "The Impacts of Open Data and eXplainable AI on Real Estate Price Predictions in Smart Cities"}, {"paperId": "472ef557ac493f11abe595a15dfd2d9daed34733", "title": "Enhancing Public Transit System Through AI and IoT"}, {"paperId": "d3c48bd179d35d87c8443983b5a004d0b4603d9c", "title": "AI for crisis decisions"}, {"paperId": "4831f799768cc54132564b9a55549902b882725a", "title": "The effects of artificial intelligence applications in educational settings: Challenges and strategies"}, {"paperId": "6389f4911043c2d60c0d7d90cefaa14ebd659a4e", "title": "Smart Cities and Urban Energy Planning: An Advanced Review of Promises and Challenges"}, {"paperId": "7210b77135e30a0c00f64ea10fc61da6c1db68e0", "title": "Documenting Urban Morphology: From 2D Representations to Metaverse"}, {"paperId": "450c87dc9458bfccbc35f2b41be101fb4a7f632f", "title": "A Machine Learning-Based AI Framework to Optimize the Recruitment Screening Process"}, {"paperId": "ace509ce2a17e55e6eddaec4f9b3c23952988873", "title": "Enhancing disaster management in smart cities through MCDM-AHP analysis amid 21st century challenges"}, {"paperId": "1313241ee25368d9f11d3a3d03cf9a023e919d13", "title": "Electricity Generation Potential Forecast of Beijing Municipal Solid Waste Separation Rate Based on GRA-BiLSTM Model"}, {"paperId": "0b61ccefe3954a28e01ff356d72efd26c0111c38", "title": "Standardized validation of vehicle routing algorithms"}, {"paperId": "27c6f193c0e3a2a25f6505b28953aca3304624ef", "title": "Specialized Urban Planning Chatbot: A Participatory Approach for Evaluating Efficiency"}, {"paperId": "aa4ba744d683d48ae5b908bd5a52af0abc69aca7", "title": "Automating Big Data Analysis Using Artificial Intelligence"}, {"paperId": "eda96c8e7176fb9cfb7cc23099b905f9e0b53983", "title": "AI Chatbot for Tourist Recommendations: A Case Study in Vietnam"}, {"paperId": "205e18af73aa619ba20846f625b1394329f325a6", "title": "Exploring the futuristic landscape of artificial intelligence for alpha generation: A comprehensive study"}, {"paperId": "19bf9b084f72f50b8ab0215c9e9828a5f71d2523", "title": "Urban Facility Management Improving Livability through Smart Public Spaces in Smart Sustainable Cities"}, {"paperId": "2dac952a40b97a5e69b7246d16944d8e8c4cdb54", "title": "Evaluation model of South China Sea tourism venture capital based on improved GA neural network under the background of health tourism industry development"}, {"paperId": "1c1c1ad473dfd1a556df09b5494dcc1b1c6503b1", "title": "EC-education, gender disparity, and digital entrepreneurship intention: The moderating role of attitude components; a competitive advantage of the Ha'il region"}, {"paperId": "2b5403bb68a66bacd81d2dfacd7cd00acce3f3a7", "title": "Predicting air quality in smart city using novel transfer learning based framework"}, {"paperId": "8ee691242b4c33e397a306706dfe9ad28cb8b0fb", "title": "Lighting and thermal factors on human comfort, work performance, and sick building syndrome in the underground building environment"}, {"paperId": "cccb870e129d28e17476e328f337ecd27a306954", "title": "The road towards environmental sustainability: Investigating the role of information and communication technologies and green technology innovations"}, {"paperId": "b67f5c82b3e424d8902ad5315dc0522a398f0112", "title": "Revolutionizing Healthcare: How Machine Learning is Transforming Patient Diagnoses - a Comprehensive Review of AI's Impact on Medical Diagnosis"}, {"paperId": "cec824d30b2aff12196f220dcf0b96be90073769", "title": "Vehicle and Plate Detection for Intelligent Transport Systems: Performance Evaluation of Models YOLOv5 and YOLOv8"}, {"paperId": "baf532b3f06b61688607f2edf5d833734823b310", "title": "Unravelling the Impact of Generative Artificial Intelligence (GAI) in Industrial Applications: A Review of Scientific and Grey Literature"}, {"paperId": "d09737b601642b957a7ac96143b4554d3d3ee400", "title": "In Defence of Good Old-Fashioned Artificial Intelligence Approaches in Intelligent Transportation Systems"}, {"paperId": "ed52b5b7f39c9cc58dbba0d5f7c4ca2506242100", "title": "An integrated approach of IoT and WSN using wavelet transform and machine learning for the solid waste image classification in smart cities"}, {"paperId": "6d9e20d4c5025c58c464237d2d6cde22495a8b45", "title": "A framework to overcome challenges to the adoption of artificial intelligence in Indian Government Organizations"}, {"paperId": "986ee54849ba6e3297bcb560e4ec57e0979c002c", "title": "Securing the digital world: Protecting smart infrastructures and digital industries with artificial intelligence (AI)-enabled malware and intrusion detection"}, {"paperId": "29b6909d460280dfb7b11f4c90d10ee052c119d4", "title": "Exploring IoT in Smart Cities: Practices, Challenges and Way Forward"}, {"paperId": "f389a7a1a2aa15d1c44b3f6178b4e805d8dfecd3", "title": "Prospects of Cybersecurity in Smart Cities"}, {"paperId": "fb4067c64589d2fb2f171e3e4551b66415a3769e", "title": "Identification of leek diseases based on deep learning algorithms"}, {"paperId": "06411c10df9e1070ffa237775684c1087f1f64ca", "title": "An automated approach for fibroblast cell confluency characterisation and sample handling using AIoT for bio-research and bio-manufacturing"}, {"paperId": "dbaf1260802c187137ea20795ddfa185211c52f4", "title": "The Use of Artificial Intelligence in the Assessment of User Routes in Shared Mobility Systems in Smart Cities"}, {"paperId": "e68aa4d2b704df9f67a374c3f6f0558999f31f25", "title": "Deflection-aware smart piezoelectric buildings come as Central elements of the future smart cities empowered by artificial intelligence algorithm"}, {"paperId": "156fe318ffb48d675c31dde30750d5df2119510c", "title": "Knowledge Sharing Key Issue for Digital Technology and Artificial Intelligence Adoption"}, {"paperId": "73737e2e50f383621b46bd8a24e90b0e0eff9409", "title": "Dynamic method to optimize memory space requirement in real-time video surveillance using convolution neural network"}, {"paperId": "08d1f927ba4e2945db8419048e290b26193ff114", "title": "A contemplative overview of smart communities: a hybrid analytical approach"}, {"paperId": "6deea96cbd8737ccdb8acf8e39725b0d9723bbc9", "title": "Responsible Urban Innovation Working with Local Authorities a Framework for Artificial Intelligence (AI)"}, {"paperId": "b9e9f449da63fbb783ce39db15bf1626a9bb4a44", "title": "Artificial intelligence for waste management in smart cities: a review"}, {"paperId": "467801281b037b78bc778154ec759828963012fe", "title": "Marine polysaccharide-based hydrogels for critical materials selective removal and recovery: A review"}, {"paperId": "a11bb38d4c5445f07b0a6443fd61f6d1a8f29755", "title": "An IoT-Based Wearable Labor Progress Monitoring System for Remote Evaluation of Admission Time to Hospital"}, {"paperId": "e11f610e03cab6f0fc8b288f312df7076e819cad", "title": "Factors influencing students' adoption and use of mobile learning management systems (m-LMSs): A quantitative study of Saudi Arabia"}, {"paperId": "46eface60155f0938c0a5b83a6c10710014bbd37", "title": "Knowledge based topic retrieval for recommendations and tourism promotions"}, {"paperId": "c5bb0a23825c4934da1451d71f7664efbf740497", "title": "How can we develop road space allocation solutions for smart cities using emerging information technologies? A review using text mining"}, {"paperId": "6514a006757e46158f6f7ee56f07f67b677589e8", "title": "The adoption of the e-portfolio management system in the Technical and Vocational Training Corporation (TVTC) in Saudi Arabia"}, {"paperId": "71684f72659fde39c16c9030383f03b9e7a72737", "title": "An artificial intelligence framework on software bug triaging, technological evolution, and future challenges: A review"}, {"paperId": "3c53dc34b86cb95bad01245a3511a167b24ff8cf", "title": "How can we manage biases in artificial intelligence systems – A systematic literature review"}, {"paperId": "59ce424b17b6be4e62118ceaa4bb9f5a1ac90013", "title": "Recent Advancements and Challenges of AIoT Application in Smart Agriculture: A Review"}, {"paperId": "102b3d34b1b5c1d183b53793c23d9281f3b12b85", "title": "ARTIFICIAL INTELLIGENCE AS A TOOL OF PUBLIC MANAGEMENT OF SOCIO-ECONOMIC DEVELOPMENT: ECONOMIC SYSTEMS, SMART INFRASTRUCTURE, DIGITAL SYSTEMS OF BUSINESS ANALYTICS AND TRANSFERS"}, {"paperId": "8d5c0f96aebde06e4bc2f4d8a02689c558f0943a", "title": "Preventing long-term risks to human rights in smart cities: A critical review of responsibilities for private AI developers"}, {"paperId": "68cce0d3f6df7268fc6e226609ba3c9806e06d87", "title": "Barriers to artificial intelligence adoption in smart cities: A systematic literature review and research agenda"}, {"paperId": "31b8602590c897ac4177c2faef8e9ce0031ff9bf", "title": "Algorithmic Urban Planning for Smart and Sustainable Development: Systematic Review of the Literature"}, {"paperId": "51367f957f752cb5eabdb542aa839ce124c3212d", "title": "Impact of swiping direction on the interaction performance of elderly-oriented smart home interface: EEG and eye-tracking evidence"}, {"paperId": "7fe2f2da0dbaff20fb49c6f0edb067d833f3a307", "title": "Smart city and remote services: The case of South Korea's national pilot smart cities"}, {"paperId": "fb5f1ad6d6915e2d121c7d274685fef354274487", "title": "Dynamic strategy to use optimum memory space in real-time video surveillance"}, {"paperId": "5ff05095d60435dd0c28572efd614f59c6075fbb", "title": "A systematic literature review of artificial intelligence in the healthcare sector: Benefits, challenges, methodologies, and functionalities"}, {"paperId": "f2c021829d44c91b57b20fab6b6480c0f37d7e36", "title": "An integrated framework based deep learning for cancer classification using microarray datasets"}, {"paperId": "96b8ce088e844836d74f3a10aca2e051fd84b78c", "title": "Why do students adopt and use Learning Management Systems?: Insights from Saudi Arabia"}, {"paperId": "3fbf6dbbcf6005b72f7e653fbb24747bf10a8d86", "title": "Deep learning for manufacturing sustainability: Models, applications in Industry 4.0 and implications"}, {"paperId": "88615576b3a2291bea322c40b288f653002c87bb", "title": "Blockchain technology for cybersecurity: A text mining literature analysis"}, {"paperId": "286d7dc635db5b15dc9dac542670aa0cc3b3cc73", "title": "AI based suitability measurement and prediction between job description and job seeker profiles"}, {"paperId": "bcb290ba494cec2cb33dfc4677231f710e8e39c4", "title": "Technology & behavioral changes mediation for personnel safety intentions: Crisis in theoretical framework."}, {"paperId": "7cbf3454818fc5c74aefe4c255431336450d2145", "title": "Three-way multi-attribute decision-making with multiple decision makers in heterogeneous incomplete decision systems"}, {"paperId": "dd8956dbab76d4354e5524b76584f2ee76f4c5a7", "title": "New Paradigm of Sustainable Urban Mobility: Electric and Autonomous Vehicles—A Review and Bibliometric Analysis"}, {"paperId": "3c5873281f5d3d869b4b9d7fc15588ce8b7e779d", "title": "Securing the Internet of Things in Artificial Intelligence Era: A Comprehensive Survey"}, {"paperId": "ac80b30c99f4ee5444d981bf2b97d0154e8c1a68", "title": "Understanding relation between EA and smart cities using text-based analysis"}, {"paperId": "dd70b48997c9aeaf4abf0f08215fa2faf50496cc", "title": "Using artificial intelligence as business opportunities on the market: An overview"}, {"paperId": "9ca4fb558026d446e4eb5d3c99fc8f22e005629a", "title": "Balancing Technological Advances with User Needs: User-centered Principles for AI-Driven Smart City Healthcare Monitoring"}, {"paperId": "151110a63db716de733da65dbc3bbba49b8e1d68", "title": "Role of ChatGPT and Similar Generative Artificial Intelligence (AI) in Construction Industry"}, {"paperId": "29aeb974eb91ed5fd7a5bf86dc5c4c3091664c11", "title": "Management Dynamics Management Dynamics"}, {"paperId": "d98fb6effacc89d69e0809130f1c0e1a718bec00", "title": "MACHINE LEARNING PIPELINE APPROACH TO SECURE IOT-BASED SMART CITIES"}, {"paperId": "0e2db7b2fd8106e187ccb3b0fa1811085ca7e864", "title": "Navigating IT And AI Challenges With Big Data: Exploring Risk Alert Tools And Managerial Apprehensions"}, {"paperId": "57370450a4ff7fa7834892979aa39244011bad5f", "title": "Uncertain Supply"}, {"paperId": "63cd3ac35d9ecaf885c3cc68ab2026ecfc190cef", "title": "Modus Operandi, Factors, Implications and Governance of Ransomware Attacks on Transportation Systems"}, {"paperId": "5d35c20d00e34d152bb3273fe137cce5df754f4f", "title": "International Journal of Information Management Data Insights"}]}
