{"paperId": "59cd4fe67c441e7e398a5ec27c82dcadce4d97d0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Novel Optimized Case-Based Reasoning Approach With K-Means Clustering and Genetic Algorithm for Predicting Multi-Class Workload Characterization in Autonomic Database and Data Warehouse System", "abstract": "Data management systems are essential elements for any organization which is dealing with large volume of data now a days. Due to increase in data volume, and its complexities, it has become more challenging job for workload management system to maintain its performance. So, there is a need of such a system that can autonomically deal with such complexities with less or without human involvement. Performance of these systems can be improved by making the systems well-aware about the workload entering into the system. The workload of a prevalent typical database and data warehouse system can be characterized into three types that is Online Transaction Processing (OLTP), Decision Support Systems (DSS) and Mixed type of workload. Currently, autonomic characterization of workload into a binary class such as OLTP and DSS is being carried out as reported in the literature, however, characterizing the workload into three types that refers to a multi-class classification problem is relatively a more challenging task. In this study, we propose a novel optimized Case-based Reasoning (CBR) approach based on clustering for autonomically characterizing the workload into multi-class types before entering into the system. We implement four phases of CBR along with case-base generation and map it to the elements of autonomic MAPE-K model. In Retrieve phase, k-means clustering is used for enhancing retrieval efficiency and workload types predictions are made in Reuse phase. Genetic Algorithm is used in Revise and Adapt phase of CBR. Few autonomic self_* characteristics are incorporated to make it autonomic. We performed various experiments and results show that the proposed model outperforms in prediction as compared to existing approaches. We performed post-hoc test for the validation of results in comparison with other machine learning classifiers using the Friedman test that show that the proposed model stands out as the best classifier.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-04", "journal": {"name": "IEEE Access", "pages": "105713-105727", "volume": "8"}, "authors": [{"authorId": "2076357639", "name": "Nusrat Shaheen"}, {"authorId": "2846981", "name": "B. Raza"}, {"authorId": "2005415", "name": "A. R. Shahid"}, {"authorId": "122686898", "name": "H. Alquhayz"}], "citations": [{"paperId": "560b1efd1e55535a9ba8a088a1f7e343b7335aa8", "title": "Research on the standard operation of processing process based on the cluster analysis"}, {"paperId": "b51771e9cf29e311cf728404a84c9f4a9b6d9468", "title": "Cognitive tasks and combined statistical methods to evaluate, model, and predict mental workload"}, {"paperId": "995372e89ee40f9e3f3787d9998cd34fceec3664", "title": "An Improved Spatial Case-Based Reasoning Considering Multiple Spatial Drivers of Geographic Events and its Application in Landslide Susceptibility Mapping"}, {"paperId": "9594ca785ea0ac9b41ae7e0e7a7f5e67bcc7a220", "title": "Optimal loading method of multi type railway flatcars based on improved genetic algorithm"}, {"paperId": "bf2ece93b44fdb4bcce948bca4257dfa2ecb5089", "title": "Predicting Influential Blogger’s by a Novel, Hybrid and Optimized Case Based Reasoning Approach With Balanced Random Forest Using Imbalanced Data"}, {"paperId": "c549ed48694a8f63b9d8ed999cde1ea8d7015ddf", "title": "Case-based reasoning adaptation based on fuzzy gravitational search algorithm for disaster emergency plan"}, {"paperId": "b014a012f1c8193837db5817b8ee8045fa67ea73", "title": "Evaluation of Teacher Allocation in Regional Compulsory Education Industry Based on K-means clustering and GIS Spatial analysis: A Case Study of teacher-student ratio"}, {"paperId": "b4126a406b291cfdcdd8b4d18291f3faa1e6ca1d", "title": "Autonomic Workload Performance Modeling for Large-Scale Databases and Data Warehouses Through Deep Belief Network With Data Augmentation Using Conditional Generative Adversarial Networks"}]}
