{"paperId": "59d3318d638e0a72782261899156322017d86e7d", "publicationVenue": {"id": "6a8c0041-d0b7-4e32-b52c-33adef005c7e", "name": "Frontiers in Artificial Intelligence", "alternate_names": ["Front Artif Intell"], "issn": "2624-8212", "url": "https://www.frontiersin.org/journals/artificial-intelligence#"}, "title": "Adaptive Initialization Method for K-Means Algorithm", "abstract": "The K-means algorithm is a widely used clustering algorithm that offers simplicity and efficiency. However, the traditional K-means algorithm uses a random method to determine the initial cluster centers, which make clustering results prone to local optima and then result in worse clustering performance. In this research, we propose an adaptive initialization method for the K-means algorithm (AIMK) which can adapt to the various characteristics in different datasets and obtain better clustering performance with stable results. For larger or higher-dimensional datasets, we even leverage random sampling in AIMK (name as AIMK-RS) to reduce the time complexity. 22 real-world datasets were applied for performance comparisons. The experimental results show AIMK and AIMK-RS outperform the current initialization methods and several well-known clustering algorithms. Specifically, AIMK-RS can significantly reduce the time complexity to O (n). Moreover, we exploit AIMK to initialize K-medoids and spectral clustering, and better performance is also explored. The above results demonstrate superior performance and good scalability by AIMK or AIMK-RS. In the future, we would like to apply AIMK to more partition-based clustering algorithms to solve real-life practical problems.", "venue": "Frontiers in Artificial Intelligence", "year": 2019, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-27", "journal": {"name": "Frontiers in Artificial Intelligence", "volume": "4"}, "authors": [{"authorId": "2119894176", "name": "Jie Yang"}, {"authorId": "5517037", "name": "Yu-kai Wang"}, {"authorId": "2005695656", "name": "Xin Yao"}, {"authorId": "2146113861", "name": "Chin-Teng Lin"}], "citations": [{"paperId": "33161ebb66fe12c10d4f5b3e13c537d6c0dd48cf", "title": "SEC: More Accurate Clustering Algorithm via Structural Entropy"}, {"paperId": "98102a9a5a2ef417661788ef4e8ab566e2075f31", "title": "Cooperative Coverage Path Planning for Multi-Mobile Robots Based on Improved K-Means Clustering and Deep Reinforcement Learning"}, {"paperId": "25d5f6fcea1a61b5e2b44de8b615981907de8066", "title": "A New Initialization Method for K-means Clustering"}, {"paperId": "fdcef92662f511522af509a18d40c04db4d5a811", "title": "Exploring the spatiotemporal relationship between influenza and air pollution in Fuzhou using spatiotemporal weighted regression model"}, {"paperId": "511b9d481d2f105eeaf0bf916192759deea24b56", "title": "Multi-View Adjacency-Constrained Hierarchical Clustering"}, {"paperId": "a8804b1755f6b6d2dbd7d09be0db2c11f459608d", "title": "FC-Kmeans: Fixed-Centered K-means Algorithm"}, {"paperId": "3cbf6cb56312e2905fac9182c4e82b860a5c887d", "title": "Definition of the molecular bases of cold and hot properties of traditional Chinese medicine through machine learning"}, {"paperId": "b3f88b91fffa72a7b9164d84aa0e192ce949c79b", "title": "Performance of Parallel K-Means Algorithms in Java"}, {"paperId": "fd734f242ba08237402ec96b32af3832749228b8", "title": "A Cluster Center Initialization Method using Hyperspace-based Multi-level Thresholding (HMLT): Application to Color Ancient Document Image Denoising"}]}
