{"paperId": "59ec5b8054a2571c2fa758938594a094efb1b528", "publicationVenue": null, "title": "Machine Learning and Soil Humidity Sensing: Signal Strength Approach", "abstract": "The Internet-of-Things vision of ubiquitous and pervasive computing gives rise to future smart irrigation systems comprising the physical and digital worlds. A smart irrigation ecosystem combined with Machine Learning can provide solutions that successfully solve the soil humidity sensing task in order to ensure optimal water usage. Existing solutions are based on data received from the power hungry/expensive sensors that are transmitting the sensed data over the wireless channel. Over time, the systems become difficult to maintain, especially in remote areas due to the battery replacement issues with a large number of devices. Therefore, a novel solution must provide an alternative, cost- and energy-effective device that has unique advantage over the existing solutions. This work explores the concept of a novel, low-power, LoRa-based, cost-effective system that achieves humidity sensing using Deep Learning techniques that can be employed to sense soil humidity with high accuracy simply by measuring the signal strength of the given underground beacon device.", "venue": "ACM Trans. Internet Techn.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-16", "journal": {"name": "ACM Transactions on Internet Technology (TOIT)", "pages": "1 - 21", "volume": "22"}, "authors": [{"authorId": "82874126", "name": "Lea Dujić Rodić"}, {"authorId": "2008210813", "name": "Tomislav Zupanovic"}, {"authorId": "49597732", "name": "T. Perković"}, {"authorId": "2234961", "name": "P. Šolić"}, {"authorId": "152171655", "name": "J. Rodrigues"}], "citations": [{"paperId": "ab0edba1337e28137b0feb8311226c64372da0cc", "title": "Enhancing Agricultural Automation through Weather Invariant Soil Parameter Prediction Using Machine Learning"}, {"paperId": "8277c104662ef32c31f80ffdff3eb5aa01383d53", "title": "Harnessing the Radio Frequency Power Level of Cellular Terminals for Weather Parameter Sensing"}, {"paperId": "bd01a88728d1881b6b59b83856effee56da3935b", "title": "A Low Cost Smart Irrigation Planning Based on Machine Learning and Internet of Things"}, {"paperId": "949e4e58373a4f237c29079b1b973c9ae28e1aa2", "title": "Soil Volumetric Water Content Measurement Based on LoRa RSSI and UAV"}, {"paperId": "ffe6cf1f4350e88bad1a2dcbdc9f74a021f5f058", "title": "Internet-of-Things-Based Multiple-Sensor Monitoring System for Soil Information Diagnosis Using a Smartphone"}, {"paperId": "c6f963076c1327d25fc0316a571fe74efa69630a", "title": "Self-sensing antenna for soil moisture"}, {"paperId": "88aae0ba36b1dee1acfdc76aa8138225a7c87110", "title": "IoT and health monitoring wearable devices as enabling technologies for sustainable enhancement of life quality in smart environments"}, {"paperId": "867f12c370c49e1eae89e6e725f8d95b0e27422b", "title": "Package Proposal for Data Pre-Processing for Machine Learning Applied to Precision Irrigation"}, {"paperId": "099d966add51f16ebc873538655f0249d1060efd", "title": "Study of applications of Internet of Things and Machine Learning for Smart Agriculture"}, {"paperId": "df28f3ca9bfc0e573b28ab29979fa147f0a9ee85", "title": "Self-Sensing Antenna for Soil Moisture: Beacon Approach"}, {"paperId": "389d6ec4b8e2947eb9e10063b9f0dc4e3863f19d", "title": "Optimized pollard route deviation and route selection using Bayesian machine learning techniques in wireless sensor networks"}, {"paperId": "197ce0474baaab624ffccdfb3f8ab9d3918eeaaf", "title": "Wearables for ML applications in health monitoring: a review of technologies and approaches"}, {"paperId": "40b1170ce1f32e12f482d315202d160d0616c439", "title": "A Wireless Underground Sensor Network Field Pilot for Agriculture and Ecology: Soil Moisture Mapping Using Signal Attenuation"}, {"paperId": "779a06ac196098a957c74b97d1a9500a183c78b1", "title": "A Systematic Review of Current Trends in Artificial Intelligence for Smart Farming to Enhance Crop Yield"}, {"paperId": "0ec07e7fbb93ddbc092d6340e07505efa31ee541", "title": "Sensing Occupancy through Software: Smart Parking Proof of Concept"}, {"paperId": "73993eec449118d78945c5da10d91ddb42e3c1f0", "title": "IoT Wallet: Machine Learning-based Sensor Portfolio Application"}, {"paperId": "d95347bb1744f405def92e1c41c0be5f62ee0414", "title": "Satellite data spectral analysis under critical hydrogeological-amelioratory conditions of Golodnostepsky irrigation lands"}]}
