{"paperId": "59f09a5b85ee248311cddb074c1c69ef8a6f075e", "publicationVenue": {"id": "914d4734-285a-4cd8-bba1-eec0db26a512", "name": "International Conference on Supercomputing", "type": "conference", "alternate_names": ["International Conference Computer, Communication and Computational Sciences", "ICS", "INFORMS Comput Soc", "Int Conf Supercomput", "INFORMS Computing Society", "Int Conf Comput Commun Comput Sci"], "url": "http://portal.acm.org/proceedings/ics/"}, "title": "PAC: Preference-Aware Co-location Scheduling on Heterogeneous NUMA Architectures To Improve Resource Utilization", "abstract": "Latency-critical applications directly interact with end users and often experience the diurnal load pattern. In production, best-effort applications are often co-located with them to utilize the idle cores at the low load. Meanwhile, modern computers are evolving towards heterogeneous NUMA architecture, where the cores have different computation abilities, memory access latencies and network communication delays. Prior co-location scheduling work did not consider the NUMA architecture, and failed to maximize the throughput of best-effort applications while ensuring the required QoS of latency-critical applications. Our investigation shows that NUMA effect has complex impacts on the latency of latency-critical applications and the throughput of best-effort applications. We therefore propose PAC, a preference-aware co-location scheduling scheme that considers the NUMA effect for heterogeneous NUMA architectures. PAC has a performance monitor and a core scheduler. Specifically, the performance monitor identifies the \"dangerous\" latency-critical applications that require upgrading core allocations. We propose two low-overhead scheduling strategies for the scheduler. The strategies identify the bottlenecks of applications and adjust core allocations accordingly. Experimental result shows that PAC improves the throughput of best-effort applications by 3.87× while ensuring the required QoS of latency-critical applications.", "venue": "International Conference on Supercomputing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-06-21", "journal": {"name": "Proceedings of the 37th International Conference on Supercomputing"}, "authors": [{"authorId": "9310748", "name": "Pu Pang"}, {"authorId": "2220320917", "name": "Yaoxuan Li"}, {"authorId": "40107085", "name": "Bo Liu"}, {"authorId": "1596812259", "name": "Quan Chen"}, {"authorId": "2220329251", "name": "Zhou Yu"}, {"authorId": "2220329282", "name": "Zhibin Yu"}, {"authorId": "2288376751", "name": "Deze Zeng"}, {"authorId": "1831521", "name": "Jingwen Leng"}, {"authorId": "11446977", "name": "Jieru Zhao"}, {"authorId": "2151671216", "name": "Minyi Guo"}], "citations": [{"paperId": "4075de71e396dabde0c311d1ced9c93217cb60de", "title": "PMR: Priority Memory Reclaim to Improve the Performance of Latency-Critical Services"}, {"paperId": "a9cb331c97cc2da203c8308e040ec61716958d3e", "title": "An Improved Scheduling with Advantage Actor-Critic for Storm Workloads"}]}
