{"paperId": "5a065a57b6b1750048a007fbdec3ce81ba7e9fac", "publicationVenue": null, "title": "Green Computing for Big Data and Machine Learning", "abstract": "The current decade has beheld a tremendous spike in data volume, velocity, variety and many other such aspects which we call as Big Data and which gave birth to a new kind of science commonly known as ”Data Science”. With the ”Data Apocalypse” in progress, it is evident that the conventional methods to handle these data would not suffice. We need distributed and parallel architectures like Cloud services (IaaS, PaaS, SaaS, STaaS, etc.). But is that enough to satisfy our needs? Here, we propose a tutorial in a very different direction when we are talking about Data Science, that is, bringing greenness in Big Data and Machine Learning (ML). We divide the tutorial into two parts primarily assuming that we are using cloud backbone for analytic and prediction tasks. The first part speaks about the techniques and tools to bring energy efficiency/greenness in the algorithmic and code level for Big Data and ML using Approximate Computing. The second part talks about the green techniques and power models at the infrastructural level for the cloud.", "venue": "COMAD/CODS", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2022-01-08", "journal": {"name": "Proceedings of the 5th Joint International Conference on Data Science & Management of Data (9th ACM IKDD CODS and 27th COMAD)"}, "authors": [{"authorId": "71545750", "name": "H. Barua"}, {"authorId": "34652002", "name": "K. Mondal"}, {"authorId": "2480236", "name": "Sunirmal Khatua"}], "citations": [{"paperId": "b46464e995d15e8e38b46a5f8dad7852cc9605ba", "title": "Green Computing for Energy Transition: A Survey"}, {"paperId": "325326ea4844464e3a1d0f5e3f98656ffaa26e3e", "title": "HYB-PARSIMONY: A hybrid approach combining Particle Swarm Optimization and Genetic Algorithms to find parsimonious models in high-dimensional datasets"}, {"paperId": "263ef5f264f6845a26c6e52f0a9696b8885fdb1d", "title": "How to Leverage High Altitude Platforms in Green Computing?"}]}
