{"paperId": "5a4e95148153102120de48ba689bb53068974dc3", "publicationVenue": null, "title": "SLA based healthcare big data analysis and computing in cloud network", "abstract": null, "venue": "J. Parallel Distributed Comput.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-01", "journal": {"name": "J. Parallel Distributed Comput.", "pages": "121-135", "volume": "119"}, "authors": [{"authorId": "3326779", "name": "P. Sahoo"}, {"authorId": "66332071", "name": "S. Mohapatra"}, {"authorId": "2938884", "name": "Shih-Lin Wu"}], "citations": [{"paperId": "b6e348285cf1670d326323fa1de870ec64271eed", "title": "Intelligent deep learning-based disease monitoring system in 5G network using multi-disease big data."}, {"paperId": "2e87da98e95bce76fcf2f2cbc7d15f8136ca4f4c", "title": "An SDN-enabled Fog Computing Framework for WBAN Applications in the Healthcare Sector"}, {"paperId": "dbded522dcfcda9b47ff7f83d4cb2e36b6a2ffeb", "title": "Healthcare predictive analytics using machine learning and deep learning techniques: a survey"}, {"paperId": "b3f99dbea7b6d91e8630b415e9657f03533865c2", "title": "Active iterative learning control based on big data"}, {"paperId": "59009c887031b9dc113258ba55d2ad45096359a7", "title": "Secure transfer of robust healthcare data using blockchain-based privacy"}, {"paperId": "809be5d73ac7696242f2d6ec4394f54f680c5ff7", "title": "Cloud-based big data framework towards strengthening disaster risk reduction: systematic mapping"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "af5fdd1dd5a703b8936d32b813d9fb4400a8e29e", "title": "Software architecture for pervasive critical health monitoring system using fog computing"}, {"paperId": "d3cdc703636c8713438688a6451fbf3aa9c2bbfd", "title": "A priority queue-based telemonitoring system for automatic diagnosis of heart diseases in integrated fog computing environments"}, {"paperId": "0947c3fb56ba68d199b51c1e86f0d62afa517bce", "title": "Complementary in Time and Space: Optimization on Cost and Performance with Multiple Resources Usage by Server Consolidation in Cloud Data Center"}, {"paperId": "13559985be8e0fd81cfab9230ebb1c4b9a3225fc", "title": "An ML-Enabled Internet of Things Framework for Early Detection of Heart Disease"}, {"paperId": "cfd360cde92883c280097e573ab8bb641ad16273", "title": "Deep enriched salp swarm optimization based bidirectional -long short term memory model for healthcare monitoring system in big data"}, {"paperId": "55e11dba7d52c4d55bbbe9514838f8f2a4e9bd16", "title": "Job scheduling for big data analytical applications in clouds: A taxonomy study"}, {"paperId": "10c854848c4e514115591bfc198916052ee5ef08", "title": "Fog Managed Data Model for IoT based Healthcare Systems"}, {"paperId": "ca1fa1cb43249c1ff0b9b12e0b6b20642865d408", "title": "Optimal deep learning approaches and healthcare big data analytics for mobile networks toward 5G"}, {"paperId": "48a4226c2e7fdbb2f7cfdd7c1ac4af9b3fbb78e5", "title": "Software architecture for IoT-based health-care systems with cloud/fog service model"}, {"paperId": "3a02dd3f352a0607feacba7382591d53e61f5372", "title": "A Novel Method for Routing Packet between Patient and Doctor using Sensor and Cloud"}, {"paperId": "5b0b7a27ad6e46ba624f9adec1cf90866b389adb", "title": "An Ontological Approach for Early Detection of Suspected COVID-19 among COPD Patients"}, {"paperId": "d7a65a82c34833768451ca669ed83fb06688464c", "title": "A systematic review of emerging information technologies for sustainable data-centric health-care"}, {"paperId": "34fcf5b74c168c82df0062c554102363031438aa", "title": "An intelligent healthcare monitoring framework using wearable sensors and social networking data"}, {"paperId": "c7f7c0a61219202fb99e30b26be210fe2382c7ed", "title": "An Innovative Application of Big Data in Healthcare: Driving Factors, Operation Mechanism and Development Model"}, {"paperId": "cef29b8f14dd08ed642e8c4b97c6a79e3c1297af", "title": "Heart disease identification from patients' social posts, machine learning solution on Spark"}, {"paperId": "2280050190d75db29c2f05a6a1d94fae8c95c53c", "title": "Adaptive Mechanism Model for the Prevention of SLA Violation in the Context of COPD Patient Monitoring"}, {"paperId": "873a17dbe1d6174d16b9963c3eafe5de1f461cb1", "title": "Design an Adaptive Mechanism Model for Supporting the Prevention of SLAs Violation in a Context of COPD Patient Monitoring"}, {"paperId": "add1df78fee91ebc6e4514c202b796eb15592450", "title": "SLA Management for Big Data Analytical Applications in Clouds"}, {"paperId": "8ca77b80c21c909d014c07ef9bfcaf11b1a80832", "title": "A Comprehensive Analysis of Healthcare Big Data Management, Analytics and Scientific Programming"}, {"paperId": "74bec51a66499fcfbced16ff3fce696acf98c9e1", "title": "Healthcare big data processing mechanisms: The role of cloud computing"}, {"paperId": "f7ca07c4cbc9c9affb620dd9762b582d3b203121", "title": "HealthFog: An Ensemble Deep Learning based Smart Healthcare System for Automatic Diagnosis of Heart Diseases in Integrated IoT and Fog Computing Environments"}, {"paperId": "3f08ec6513c71a7674f292b56b9005ce00745e9a", "title": "Edge-of-things computing framework for cost-effective provisioning of healthcare data"}, {"paperId": "e464af8a537df6c40298a22cdcf14a2d9c889b64", "title": "Application of Cloud and IoT Technologies in Battling the COVID-19 Pandemic"}, {"paperId": "57416ef36969924035a9ebd1123c8216d010b61e", "title": "FETCH: A deep Learning-based Fog Computing and IoT Integrated Environment for Healthcare Monitoring and Diagnosis"}, {"paperId": "f1791b160ee8a58238a739ac47038bcd950bf595", "title": "Hybrid Cloud/Fog Environment for Healthcare: An Exploratory Study, Opportunities, Challenges, and Future Prospects"}, {"paperId": "20a2fee8f4f6bbc2f4f52c1745766e32541fdf05", "title": "Parallel Machine Learning Algorithm Using Fine-Grained-Mode Spark on a Mesos Big Data Cloud Computing Software Framework for Mobile Robotic Intelligent Fault Recognition"}, {"paperId": "3f600981032394329917dcfed71d479b2e4ae620", "title": "Management of Service Level Agreements for Big Data Analytics Applications in Cloud: A Layer-based Study"}, {"paperId": "daa2ac651b6f30afead064f23bc3d87898b62bdf", "title": "Big Data Features, Applications, and Analytics in Cardiology—A Systematic Literature Review"}]}
