{"paperId": "5a510d810379ff123d88173486bdce2a0dd7e566", "publicationVenue": {"id": "946e893f-4e7f-47c5-8544-15aa5a2cc679", "name": "Journal of Healthcare Engineering", "type": "journal", "alternate_names": ["J Healthc Eng"], "issn": "2040-2295", "url": "https://www.hindawi.com/journals/jhe/", "alternate_urls": ["http://www.multi-science.co.uk/jhe.htm"]}, "title": "Application Effect Analysis of Operating Room Detailed Nursing Based on Medical Big Data in Patients Undergoing Gastrointestinal Tumor Surgery", "abstract": "With the continuous development of internet information computing, the continuous improvement of medical and health systems, and the continuous increase of medical big data, traditional operating room care also needs to be further optimized. Medical big data is a forum data set for medical industry healthcare, electronic medical record information, clinical case record information, medical financial data, remote patient monitoring data, clinical decision support data, medical insurance data set, online consulting platform, and so on. Gastrointestinal tumors are currently one of the largest malignant tumors. Compared with ordinary patients, the presence of fear, depression, irritability, and other unhealthy emotions in patients with gastrointestinal tumors will reduce the therapeutic effect. Without careful care, the use of chemotherapy and other treatments makes patients vulnerable to various side effects. This article aims to study the use of medical big data intelligent algorithms to perform detailed care for patients during gastrointestinal tumor surgery and analyze the effects of care. This paper proposes an improved DNN algorithm; the DNN algorithm is to use several weight coefficient matrices and bias vectors to perform a series of linear operations and activation operations with the input value vector, starting from the input layer, backward calculation layer by layer, until the operation reaches the output layer, and the output result is obtained. This algorithm is used to study the theory, use mathematical formulas for method calculation and model design, and use the model to carry out detailed nursing experiments in the relevant operating room. The results of the experiment show that patients who have performed detailed care have a 27.2% improvement in treatment and rehabilitation effects than those who have not, and the level of detailed care has an obvious positive relationship with the rate of condition conversion. In the end, the hospital's detailed care quality evaluation index, which is QEI, increases by 1 point, which can increase the rate of condition conversion by 0.4.", "venue": "Journal of Healthcare Engineering", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-12", "journal": {"name": "Journal of Healthcare Engineering", "volume": "2022"}, "authors": [{"authorId": "2114022705", "name": "Yan-mei Meng"}, {"authorId": "2158698786", "name": "Aixue Sun"}, {"authorId": "119998793", "name": "Ge-Di Ji"}, {"authorId": "2158776821", "name": "Caiye Wei"}, {"authorId": "123787293", "name": "Junhong Jia"}], "citations": [{"paperId": "04ff5acad55880f4066ac8b7605178d21e53712c", "title": "Retracted: Application Effect Analysis of Operating Room Detailed Nursing Based on Medical Big Data in Patients Undergoing Gastrointestinal Tumor Surgery"}]}
