{"paperId": "5a53d2af37544cd0484ddcaf44dda74a25668ce4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Distributed Vehicular Computing at the Dawn of 5G: a Survey", "abstract": "Recent advances in information technology have revolutionized the automotive industry, paving the way for next-generation smart and connected vehicles. Connected vehicles can collaborate to deliver novel services and applications. These services and applications require 1) massive volumes of data that perceive ambient environments, 2) ultra-reliable and low-latency communication networks, 3) real-time data processing which provides decision support under application-specific constraints. Addressing such constraints introduces significant challenges with current communication and computation technologies. Coincidentally, the fifth generation of cellular networks (5G) was developed to respond to communication challenges by providing an infrastructure for low-latency, high-reliability, and high bandwidth communication. At the core of this infrastructure, edge computing allows data offloading and computation at the edge of the network, ensuring low-latency and context-awareness, and pushing the utilization efficiency of 5G to its limit. In this paper, we aim at providing a comprehensive overview of the state of research on vehicular computing in the emerging age of 5G. After reviewing the main vehicular applications requirements and challenges, we follow a bottom-up approach, starting with the promising technologies for vehicular communications, all the way up to Artificial Intelligence (AI) solutions. We explore the various architectures for vehicular computing, including centralized Cloud Computing, Vehicular Cloud Computing, and Vehicular Edge computing, and investigate the potential data analytics technologies and their integration on top of the vehicular computing architectures. We finally discuss several future research directions and applications for vehicular computation systems.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-01-20", "journal": {"name": "ArXiv", "volume": "abs/2001.07077"}, "authors": [{"authorId": "51492568", "name": "A. Alhilal"}, {"authorId": "1984250", "name": "Tristan Braud"}, {"authorId": "2106066733", "name": "Pan Hui"}], "citations": [{"paperId": "390fe6a9ee4dc94c624790551b979e5543a85c1b", "title": "Adaptive Multi-Sensor Integrated Navigation System Aided by Continuous Error Map from RSU for Autonomous Vehicles in Urban Areas"}, {"paperId": "deb99752404e3e31f2800899dc4bd59e20d247e2", "title": "Tactile IoT and 5G & beyond schemes as key enabling technologies for the future metaverse"}, {"paperId": "f9a16392a6fc7e85909c68918f0de7072830bd66", "title": "Vehicle as a Service (VaaS): Leverage Vehicles to Build Service Networks and Capabilities for Smart Cities"}, {"paperId": "bdf5731046537a6fc9c53d03c2fd206d0e58e06a", "title": "Data Management Platform For Smart Orchestration of Decentralized and Heterogeneous Vehicular Edge Networks"}, {"paperId": "f888fc9d7a7f586b0f6e048fd7c317a4e9c661ac", "title": "Secure and scalable Blockchain-enabled traffic data management using a trust model"}, {"paperId": "394208ad800dce8e1d71825f59112c2ff702369d", "title": "Cooperative Task-Oriented Group Formation for Vehicular Networks"}, {"paperId": "5e52caff0d97686ab5a0f7c53c2026ada8bcea61", "title": "5G and IoT Based Reporting and Accident Detection (RAD) System to Deliver First Aid Box Using Unmanned Aerial Vehicle"}, {"paperId": "0d2445a15c5c04ada543e0d61cc6bde01b595491", "title": "Towards Real-time Learning for Edge-Cloud Continuum with Vehicular Computing"}, {"paperId": "7ec5f9f8761c390e557c0ac0f5fee27daee02128", "title": "Machine Learning Technologies in Internet of Vehicles"}, {"paperId": "879be83bc1c9167c6f19d4ec37a9b16acf5a04f3", "title": "DRLE: Decentralized Reinforcement Learning at the Edge for Traffic Light Control in the IoV"}, {"paperId": "46f30a324e5574d4dabafd28fed2443993349616", "title": "A Review of Research on Intersection Control Based on Connected Vehicles and Data-Driven Intelligent Approaches"}, {"paperId": "28412695b45e404769e3e539f6aeb37f412a0744", "title": "Power Efficient and Ultra Dense Open-RAN Vehicular Networks With Non-Linear Processing"}, {"paperId": "6b148a8a1639e6d96ae573fa044d57c375cfcd60", "title": "Federated Learning Enabled SDN for Routing Emergency Safety Messages (ESMs) in IoV Under 5G Environment"}, {"paperId": "5f8e882d714fe85c792f28dc526d0042916ba611", "title": "Object Recognition for Organizing the Movement of Self-Driving Car"}]}
