{"paperId": "5a5dcb9819f362fd5c4c41858add2f17021d7cf0", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "Statically inferring performance properties of software configurations", "abstract": "Modern software systems often have a huge number of configurations whose performance properties are poorly documented. Unfortunately, obtaining a good understanding of these performance properties is a prerequisite for performance tuning. This paper explores a new approach to discovering performance properties of system configurations: static program analysis. We present a taxonomy of how a configuration might affect performance through program dependencies. Guided by this taxonomy, we design LearnConf, a static analysis tool that identifies which configurations affect what type of performance and how. Our evaluation, which considers hundreds of configurations in four widely used distributed systems, demonstrates that LearnConf can accurately and efficiently identify many configurations' performance properties, and help performance tuning.", "venue": "European Conference on Computer Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-04-15", "journal": {"name": "Proceedings of the Fifteenth European Conference on Computer Systems"}, "authors": [{"authorId": "2109747523", "name": "Chi Li"}, {"authorId": "2116932013", "name": "Shu Wang"}, {"authorId": "144704832", "name": "H. Hoffmann"}, {"authorId": "144134982", "name": "Shan Lu"}], "citations": [{"paperId": "f79b6c3fe52dac665946a145e83592dd8383d36e", "title": "ECFuzz: Effective Configuration Fuzzing for Large-Scale Systems"}, {"paperId": "fe29b05dbbf9c9e94bf2f6aff0a06612efffb929", "title": "IoPV: On Inconsistent Option Performance Variations"}, {"paperId": "965bce407968d739fd21c66ceb60f72a7ab55a64", "title": "DiagConfig: Configuration Diagnosis of Performance Violations in Configurable Software Systems"}, {"paperId": "4330510baa4b35300cc89cd448b30d36fa47a5bf", "title": "Introducing Interactions in Multi-Objective Optimization of Software Architectures"}, {"paperId": "7ab73c5dee3bd89f2fa73e7ae96e8bbd66539895", "title": "HotGPT: How to Make Software Documentation More Useful with a Large Language Model?"}, {"paperId": "d2e438d9b1f39d850bcd9bbe10f7fc8155cb8f5b", "title": "CRSExtractor: Automated configuration option read sites extraction towards IoT cloud infrastructure"}, {"paperId": "2d36dba4761044fa72ef91cae4d2cc084044e79c", "title": "When Database Meets New Storage Devices: Understanding and Exposing Performance Mismatches via Configurations"}, {"paperId": "64c1d628d2b62a3b160785de35fa18c651b0eb63", "title": "AgileCtrl: a self-adaptive framework for configuration tuning"}, {"paperId": "2d5850b4dd0cc5f8d5b358ac5195260b19b1b981", "title": "Data-Efficient Performance Modeling for Configurable Big Data Frameworks by Reducing Information Overlap Between Training Examples"}, {"paperId": "323e8e7a8879c3e4c386c82d16016dd7dd7196a8", "title": "Multi-Intention-Aware Configuration Selection for Performance Tuning"}, {"paperId": "8645c50ae3e6c2fd3affb657f5090ff68ab3ee1b", "title": "On Debugging the Performance of Configurable Software Systems: Developer Needs and Tailored Tool Support"}, {"paperId": "70bc965c6bbc1d430000f6fb51b9730427469748", "title": "Unicorn: reasoning about configurable system performance through the lens of causality"}, {"paperId": "c3aeceb9c9107225f25eae14a411e3a6405f25ee", "title": "Static detection of silent misconfigurations with deep interaction analysis"}, {"paperId": "388b0063ff218e7f071145c8124306ed6b9ca46d", "title": "Wayfinder: towards automatically deriving optimal OS configurations"}, {"paperId": "f45ec7b57f4cbc9ee76be778ec6170ea0b587de1", "title": "Generalizable and interpretable learning for configuration extrapolation"}, {"paperId": "329245eace253321df4e167483d3a2c7bc66325d", "title": "An Evolutionary Study of Configuration Design and Implementation in Cloud Systems"}, {"paperId": "56714807aa5cf811f869ad447957c40ff9131c3b", "title": "White-Box Analysis over Machine Learning: Modeling Performance of Configurable Systems"}, {"paperId": "3832c79a7fca13a768a17c4d3766f4e0699e2e57", "title": "ApproxDet: content and contention-aware approximate object detection for mobiles"}, {"paperId": "1ca4adaaf91488fec0488827db0929e1c5441204", "title": "Finding the right cloud configuration for analytics clusters"}, {"paperId": "d5b3f8dbef61ead7d86a89e5b0d638e34c33d509", "title": "CADET: A Systematic Method For Debugging Misconfigurations using Counterfactual Reasoning"}, {"paperId": "0a53445313d0323c2008c2a8972153a8a1200c80", "title": "Automated Reasoning and Detection of Specious Configuration in Large Systems with Symbolic Execution"}, {"paperId": "3eaf02337da6a4d0c0d9c9a4ea82294cb7e5cc7b", "title": "CADET: Debugging and Fixing Misconfigurations using Counterfactual Reasoning"}]}
