{"paperId": "5a5e948e1366c2528412b66daac6c44f6a53659c", "publicationVenue": {"id": "2c7f7ade-217c-4c28-8075-8dc443762ff4", "name": "International Research Journal on Advanced Science Hub", "type": "journal", "alternate_names": ["Int Res J Adv Sci Hub"], "issn": "2582-4376", "url": "http://www.rspsciencehub.com/irjash/"}, "title": "RF Technologies for Connecting Various Constrained Devices in IoT System", "abstract": "In IoT systems various sensors, actuators and smart objects are used for different purposes, some smart objects require high bandwidth, some may need very low bandwidth. Some objects need to communicate over a long range, some objects need to consume very low power, so that its battery life should be long. To cater to these IoT system’s requirements there is a lot of research on communication technologies by IEEE, resulting in the development of various Radio Frequency (RF) standards for the different types of smart objects and sensors. IEEE 802.15.4 standards are mostly used for the constrained devices with low power consumption and low data rate, at the same time 4G/5G are being used in sensors like cameras with edge nodes at high data rate to process high volume of images and videos with various image processing algorithms. In this paper we are classifying the different RF technologies and its features best suited for the speciﬁc sensor in an IoT system as well as classiﬁcation of RF modules (like Zigbee, 6LoWPAN, and LoRa) for connecting different types of constrained devices for different IoT projects. At the same time 4G/5G sim-based Wi-Fi modules will be used for integrating cameras like sensors which run on AC/DC power, to process high volume of data using various image processing algorithms at the edge node which further transfer the processed information to the cloud for further analysis and future use. Main objective of this paper is to classify and analyse the best suited RF standards for various constrained devices on low data rate, as well as for power full smart objects at high data rate in IoT systems.", "venue": "International Research Journal on Advanced Science Hub", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-28", "journal": {"name": "International Research Journal on Advanced Science Hub"}, "authors": [{"authorId": "2222288638", "name": "Aurangjeb Khan"}, {"authorId": "2076221862", "name": "J. K"}], "citations": []}
