{"paperId": "5a68533b7224b56567ad390192312daeb64e6ccb", "publicationVenue": null, "title": "HALA: Hive advanced lexical analyzer", "abstract": "Big Data Analytics has become an integral part of technology in the past decade. It has been the driving force behind some of the major advancements made, including machine learning, artificial intelligence, human behavior prediction and even genomic studies. Furthermore, the popularity of Hadoop and its ability to provide a highly scalable and available distributed computing on commodity machines has attracted various efforts into optimizing the framework itself. This research focuses on bridging the gap between the user experience seen in a relational database management system and the Hadoop framework. It is added as an external component to Apache Hive's architecture and introduces a novel tool, Hive Advanced Lexical Analyzer, or HALA, for 3 added functionalities: (1) Lexical Analysis, (2) Syntactic Analysis and (3) Multi-query processing. This paper also presents the results of a thorough analysis of the applicability for each of these components. 5 queries from the TPC-H series were selected and used as the base query model for multiple variations for information extraction. In addition to extracting query information, the authors have also performed detailed analysis on the syntax verifying component as well. Multiple runs of different query variations have returned a non-existent false positives and false negatives. Additionally, the modularity of this tool allows the usage of either or all of the components to realize the desired outcome.", "venue": "2017 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computed, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-08-01", "journal": {"name": "2017 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computed, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "pages": "1-8"}, "authors": [{"authorId": "3414698", "name": "Thivviyan Amirthalingam"}, {"authorId": "9193109", "name": "H. Rais"}], "citations": [{"paperId": "9e641944a17fdf3893e90f1b652b585098364311", "title": "Automated Table Partitioner (ATAP) in Apache Hive"}]}
