{"paperId": "5a6b10872fb5fb178b4b3643e608d52a11f072dd", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Visually Analysing the Fairness of Clustered Federated Learning with Non-IID Data", "abstract": "As a popular distributed privacy-preserving machine learning approach, federated learning (FL) trains a global model across numerous clients without directly sharing their private training data. A fundamental challenge of FL is non-independently and identically distributed (non-IID) data, which can be addressed by clustered FL (CFL) that explores inherent partitions among clients to capture heterogeneous local data distributions. Existing CFL methods, however, tend to optimise the mean accuracy across all clients, overlooking the important issue of fairness, that is, uniformity of clients' performance. Besides, prior FL- related visual analytics (VA) frameworks are developed based on the standard FL scenario of single global model and are hence inapplicable to the CFL case of multiple global (cluster) models. To fill the research gap, this study proposes a novel VA framework named cCFLvis to illustrate and analyse variation of fairness during the CFL learning process. A new metric, change of absolute deviation from the mean (ΔAD), is introduced to quantify such variation. Client embeddings are generated by contrastive learning-based dimensionality reduction techniques to facilitate 2-d visualisation of client disparity. Visual cues can be drawn to help understand fairness variation and to offer clues for improving learning outcomes. cCFL vis is a general framework applicable to various CFL methods. Its effectiveness is showcased in a simple demonstration and two case studies, each conducted with a distinct representative CFL method and a different federated non-IID dataset.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-18", "journal": {"name": "2023 International Joint Conference on Neural Networks (IJCNN)", "pages": "01-10"}, "authors": [{"authorId": "2143702320", "name": "Li Huang"}, {"authorId": "2089537450", "name": "Weiwei Cui"}, {"authorId": "2187448064", "name": "Bin Zhu"}, {"authorId": "46702036", "name": "Haidong Zhang"}], "citations": []}
