{"paperId": "5a7291b7b14efc3688f7c3938e17ddd1fa8a4bcc", "publicationVenue": {"id": "8d051ed1-e691-49d8-8a57-d7b4a76c4352", "name": "IEEE Conference on Network Softwarization", "type": "conference", "alternate_names": ["IEEE Conf Netw Softwarization", "NetSoft"]}, "title": "Transfer Learning-Based QoE Estimation For Different Cloud Gaming Contexts", "abstract": "Cloud Gaming renders game data in the cloud and forwards it to players over the network. While this reduces hardware costs for players, it introduces challenges in network management and delivering a good gaming experience. In this context, network providers are encouraged to implement QoE-aware management systems to guarantee a desired Quality of Experience (QoE), in which Machine Learning (ML) models achieve the state-of-the-art on QoE estimation/monitoring. However, it is hard to create ML models that generalize to different contexts, especially since QoE perception is subjective and varies among games and players. This paper employs transfer learning and fine-tuning to adjust a source model to different target domains. First, we performed a subjective QoE assessment with real users playing on a realistic testbed. Based on this, we derived four datasets, one being the source dataset (to create the source model) and three distinct target datasets. Experiments show that transfer learning can decrease the average MSE error by at least 41.6% compared to the source model performance on the target datasets while decreasing the demand for labeled data by at least 81.1%. Furthermore, the improvement is greater when compared to models trained from scratch for each target dataset.", "venue": "IEEE Conference on Network Softwarization", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-19", "journal": {"name": "2023 IEEE 9th International Conference on Network Softwarization (NetSoft)", "pages": "71-79"}, "authors": [{"authorId": "2075426145", "name": "Marcos Carvalho"}, {"authorId": "2206281026", "name": "Daniel Soares"}, {"authorId": "145834364", "name": "D. Macedo"}], "citations": []}
