{"paperId": "5a760269531c8674d9d77da0d6efe4a07d01219a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Open Data Fabric: A Decentralized Data Exchange and Transformation Protocol With Complete Reproducibility and Provenance", "abstract": "Data is the most powerful decision-making tool at our disposal. However, despite the exponentially growing volumes of data generated in the world, putting it to effective use still presents many challenges. Relevant data seems to be never there when it is needed - it remains siloed, hard to find, hard to access, outdated, and of bad quality. As a result, governments, institutions, and businesses remain largely impaired in their ability to make data-driven decisions. At the same time, data science is undergoing a reproducibility crisis. The results of the vast majority of studies cannot be replicated by other researchers, and provenance often cannot be established, even for data used in medical studies that affect lives of millions. We are losing our ability to collaborate at a time when significant improvements to data are badly needed. We believe that the fundamental reason lies in the modern data management processes being entirely at odds with the basic principles of collaboration and trust. Our field needs a fundamental shift of approach in how data is viewed, how it is shared and transformed. We must transition away from treating data as static, from exchanging it as anemic binary blobs, and instead focus on making multi-party data management more sustainable: such as reproducibility, verifiability, provenance, autonomy, and low latency. In this paper, we present the Open Data Fabric, a new decentralized data exchange and transformation protocol designed from the ground up to simplify data management and enable collaboration around data on a similar scale as currently seen in open-source software.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-11", "journal": {"name": "ArXiv", "volume": "abs/2111.06364"}, "authors": [{"authorId": "2140018398", "name": "Sergii Mikhtoniuk"}, {"authorId": "80264274", "name": "Ö. Yalçın"}], "citations": [{"paperId": "f41685a2d1979388b2e0f910c9c1cfb236673f5b", "title": "Proof of Real-Time Transfer: A Consensus Protocol for Decentralized Data Exchange"}, {"paperId": "e986acc5b129236e8b4fb530a667fba0f46e0871", "title": "Adoption of knowledge-graph best development practices for scalable and optimized manufacturing processes"}, {"paperId": "c86b1f544f1242f7c1ce5006e267f1f91eecff18", "title": "Towards Data Gravity and Compliance Aware Distributed Deep Learning on Hybrid Clouds"}, {"paperId": "febe825562911b18892ce12da289cfe369fc782d", "title": "M-Data-Fabric: A Data Fabric System Based on Metadata"}, {"paperId": "dc07b58fe6cf5722f19363318f96d457640cc5df", "title": "Formalizing Stream Reasoning for a Decentralized Semantic Web"}]}
