{"paperId": "5a8b1aa11ee5bfea5ce42e8a1daa220b42d58957", "publicationVenue": {"id": "872d6776-f121-4a16-8647-06b0685e472e", "name": "Information Discovery and Delivery", "alternate_names": ["Inf Discov Deliv"], "issn": "2398-6247", "url": "http://www.emeraldinsight.com/loi/idd"}, "title": "The composition of data economy: a bibliometric approach and TCCM framework of conceptual, intellectual and social structure", "abstract": "\nPurpose\nThe data economy mainly relies on the surveillance capitalism business model, enabling companies to monetize their data. The surveillance allows for transforming private human experiences into behavioral data that can be harnessed in the marketing sphere. This study aims to focus on investigating the domain of data economy with the methodological lens of quantitative bibliometric analysis of published literature.\n\n\nDesign/methodology/approach\nThe bibliometric analysis seeks to unravel trends and timelines for the emergence of the data economy, its conceptualization, scientific progression and thematic synergy that could predict the future of the field. A total of 591 data between 2008 and June 2021 were used in the analysis with the Biblioshiny app on the web interfaced and VOSviewer version 1.6.16 to analyze data from Web of Science and Scopus.\n\n\nFindings\nThis study combined findable, accessible, interoperable and reusable (FAIR) data and data economy and contributed to the literature on big data, information discovery and delivery by shedding light on the conceptual, intellectual and social structure of data economy and demonstrating data relevance as a key strategic asset for companies and academia now and in the future.\n\n\nResearch limitations/implications\nFindings from this study provide a steppingstone for researchers who may engage in further empirical and longitudinal studies by employing, for example, a quantitative and systematic review approach. In addition, future research could expand the scope of this study beyond FAIR data and data economy to examine aspects such as theories and show a plausible explanation of several phenomena in the emerging field.\n\n\nPractical implications\nThe researchers can use the results of this study as a steppingstone for further empirical and longitudinal studies.\n\n\nOriginality/value\nThis study confirmed the relevance of data to society and revealed some gaps to be undertaken for the future.\n", "venue": "Information Discovery and Delivery", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-31", "journal": {"name": "Information Discovery and Delivery"}, "authors": [{"authorId": "30809265", "name": "S. Olaleye"}, {"authorId": "52563419", "name": "E. Mogaji"}, {"authorId": "73134320", "name": "F. J. Agbo"}, {"authorId": "8303460", "name": "D. Ukpabi"}, {"authorId": "2189285112", "name": "Akwasi Gyamerah"}], "citations": [{"paperId": "4d45098f43caea92fe1c436122ff1484a13b3a1e", "title": "Exploring Biomass Linkages in the Food and Energy Market—A Systematic Review"}, {"paperId": "de2b81d64e89cdc28b86bbb8d408339b9a85c078", "title": "Decrypting Disruptive Technologies: Review and Research Agenda of Explainable AI as a Game Changer"}, {"paperId": "d047bf407320e5e92abcedabe3fd92d288500d62", "title": "Framework of green finance to attain sustainable development goals: an empirical evidence from the TCCM approach"}, {"paperId": "7aa23e9f9aacf9258bade43d9fec803ff96a479e", "title": "The scientific outcome in the domain of grey literature: bibliometric mapping and visualisation using the R-bibliometrix package and the VOSviewer"}]}
