{"paperId": "5a91feca465b9157f84f040a8620a6fd35851e30", "publicationVenue": {"id": "00f5caf8-cd53-4155-a55d-f6f640310e6d", "name": "International Conference on Information Management and Engineering", "type": "conference", "alternate_names": ["Int Conf Inf Manag Eng", "IEEE Int Conf Inf Manag Eng", "IEEE International Conference on Information Management and Engineering", "ICIME"], "url": "http://icime.org/"}, "title": "Characterizing Mobility and Service Pattern of Mobile Users Based on Wireless Data Analysis", "abstract": "Massive amount of data and information are produced by the wide-spread usage of mobile devices like smartphones. Data analysis of large amounts of wireless network data is crucial in understanding user behaviors and service usage patterns. Understanding and forecasting mobile user behaviors is not only valuable for service providers to control and manage mobile network, but also improve the user experience. In this paper, we first introduce the cellular network architecture and describe the features of wireless data collected from mobile network. Then we present a complete analysis process on the wireless data. After preprocessing, we perform an analysis on data traffic from different aspects to understand user behavior patterns. We also discuss several significant ways of utilizing the results of analysis in this study to solve some current problems.", "venue": "International Conference on Information Management and Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 International Joint Conference on Information, Media and Engineering (ICIME)", "pages": "11-15"}, "authors": [{"authorId": "1642658057", "name": "Yunzhi Li"}, {"authorId": "143689946", "name": "Ming Yan"}, {"authorId": "50290215", "name": "Tianqi Li"}], "citations": [{"paperId": "389e47f2523cb9eff54c6b316f6506d1c632c2bf", "title": "Simulated website login to improve network data crawling efficiency"}, {"paperId": "508cc576f4c188f4a2b7a862e223e4042c990761", "title": "Performance Comparison of Moving Target Recognition between Faster R-CNN and SSD"}, {"paperId": "72c19681bf6536dd2715e17cd48a236ff81cceae", "title": "Infrared Image Super-Resolution Enhancement Based on Convolutional Neural Network"}, {"paperId": "ebc9ffae576007e727239e67f3886b500511f223", "title": "A Meta-Learning-Based Solution to Address the Sparsity Problem of Recommender Systems"}, {"paperId": "bce7ebc89aa3efd058d24fcab20fea2adbfb28e6", "title": "Stage Actor Positioning Method Based on RealSense Point Cloud"}, {"paperId": "1b7b8b9e5d9ec1d5873bbf3efd3f397ba1b15312", "title": "Vehicle Object Detection Based on RGB-Camera and Radar Sensor Fusion"}]}
