{"paperId": "5aa034c62c09e32f18babd5bdb198f2dbe34a34b", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Sieve: A Learned Data-Skipping Index for Data Analytics", "abstract": "Modern data analytics services are coupled with external data storage services, making I/O from remote cloud storage one of the dominant costs for query processing. Techniques such as columnar block-based data organization and compression have become standard practices for these services to save storage and processing cost. However, the problem of effectively skipping irrelevant blocks at low overhead is still open. Existing data-skipping efforts maintain lightweight summaries (e.g., min/max, histograms) for each block to filter irrelevant data. However, such techniques ignore patterns in real-world data, enabling ineffective use of the storage budget and may cause serious false positives.\n This paper presents Sieve, a learning-enhanced index designed to efficiently filter out irrelevant blocks by capturing data patterns. Specifically, Sieve utilizes piece-wise linear functions to capture block distribution trends over the key space. Based on the captured trends, Sieve trades off storage consumption and false positives by grouping neighboring keys with similar block distributions into a single region. We have evaluated Sieve using Presto, and experiments on real-world datasets demonstrate that Sieve achieves up to 80% reduction in blocks accessed and 42% reduction in query times compared to its counterparts.", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "3214-3226", "volume": "16"}, "authors": [{"authorId": "2197265422", "name": "Yulai Tong"}, {"authorId": "2108477605", "name": "Jiazhen Liu"}, {"authorId": "2113253793", "name": "Hua Wang"}, {"authorId": "143904274", "name": "Ke Zhou"}, {"authorId": "2164311572", "name": "Rongfeng He"}, {"authorId": "2220402563", "name": "Qin Zhang"}, {"authorId": "2234027239", "name": "Cheng Wang"}], "citations": [{"paperId": "ac0270e7af0b2b013156c888050be082c673c3cf", "title": "A Survey of Learned Indexes for the Multi-dimensional Space"}]}
