{"paperId": "5aa4dd14a6136fea01809d0f0ec3857b7ce88fec", "publicationVenue": null, "title": "Bank Big Data Architecture Based on Massive Parallel Processing Database", "abstract": "Banking systems generates lots of data (TB) daily and records PB historical transaction data, which requires a cost-effective and high performance data processing system for data management. This paper introduces the existing data processing architecture, and proposes a hybrid database solution based upon Massive Parallel Processing (MPP), transactional databases, Hadoop and Storm platforms, which has been applied in Fujian Rural Credit Union. Based on the high-performance features of MPP, a data loading method of Extraction-Load-Transform (ETL) is established. The performance of the hybrid prototype against the traditional Oracle one is validated through five common data processing models (insert only, truncate and insert, etc.) with practical data. The experiment results clearly show that the hybrid database prototype is more cost-effective and provides better performance.", "venue": "2018 15th International Symposium on Pervasive Systems, Algorithms and Networks (I-SPAN)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-01", "journal": {"name": "2018 15th International Symposium on Pervasive Systems, Algorithms and Networks (I-SPAN)", "pages": "93-99"}, "authors": [{"authorId": "3059152", "name": "Shenglan Ma"}, {"authorId": "153775294", "name": "Hong Xiao"}, {"authorId": "80158133", "name": "Botong Xu"}, {"authorId": "2070823838", "name": "Ran Tao"}, {"authorId": "47060025", "name": "Fangkai Xie"}, {"authorId": "122165993", "name": "Daicai Zeng"}, {"authorId": "2483700", "name": "Tongsen Wang"}], "citations": [{"paperId": "84afcdcc0d42ff7b6cbf5e53a320cf0fce5f6612", "title": "A Model for Enhancing Unstructured Big Data Warehouse Execution Time"}, {"paperId": "a8ce216569f139eb78736d23b39cbf54897bc8b5", "title": "Credibility Modelling of E-commerce Networks Based on Block-chain and Massive Data Mining"}]}
