{"paperId": "5aacb999b1c40e12901c6bbeb01d18c276670000", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Survey of Enabling and Emerging Technologies for Social Distancing—Part II: Emerging Technologies and Open Issues", "abstract": "This two-part paper aims to provide a comprehensive survey on how emerging technologies, e.g., wireless and networking, artificial intelligence (AI) can enable, encourage, and even enforce social distancing practice. In Part I, an extensive background of social distancing is provided, and enabling wireless technologies are thoroughly surveyed. In this Part II, emerging technologies such as machine learning, computer vision, thermal, ultrasound, etc., are introduced. These technologies open many new solutions and directions to deal with problems in social distancing, e.g., symptom prediction, detection and monitoring quarantined people, and contact tracing. Finally, we discuss open issues and challenges (e.g., privacy-preserving, scheduling, and incentive mechanisms) in implementing social distancing in practice. As an example, instead of reacting with ad-hoc responses to COVID-19-like pandemics in the future, smart infrastructures (e.g., next-generation wireless systems like 6G, smart home/building, smart city, intelligent transportation systems) should incorporate a pandemic mode in their standard architectures/designs.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-08-20", "journal": {"name": "Ieee Access", "pages": "154209 - 154236", "volume": "8"}, "authors": [{"authorId": "150061884", "name": "Cong T. Nguyen"}, {"authorId": "9732252", "name": "Y. Saputra"}, {"authorId": "82156181", "name": "Nguyen Van Huynh"}, {"authorId": "144078615", "name": "Ngoc-Tan Nguyen"}, {"authorId": "107578540", "name": "Tran Viet Khoa"}, {"authorId": "69901839", "name": "Bui Minh Tuan"}, {"authorId": "30479205", "name": "Diep N. Nguyen"}, {"authorId": "2233724", "name": "D. Hoang"}, {"authorId": "2135653377", "name": "T. Vu"}, {"authorId": "1725132", "name": "E. Dutkiewicz"}, {"authorId": "1760292", "name": "S. Chatzinotas"}, {"authorId": "102896981", "name": "B. Ottersten"}], "citations": [{"paperId": "17d11df7e88be44b7b4a71d4048e4d52fd7f5ba0", "title": "How Artificial Intelligence Helped the Humanity During the COVID-19 Pandemic: A Review"}, {"paperId": "e741dabf3f5dfbcb1b27db6a54470d97db04b34f", "title": "Social Distance Approximation on Public Transport Using Stereo Depth Camera and Passenger Pose Estimation"}, {"paperId": "fda7e30938c6f1659930ac475fef55387b78946e", "title": "Cybersecurity in health sector: a systematic review of the literature"}, {"paperId": "fbb288edda4a005dfcaacb2f91ca96ccdb81e358", "title": "Sazgar IoT: A Device-Centric IoT Framework and Approximation Technique for Efficient and Scalable IoT Data Processing"}, {"paperId": "d8611a98b78dfc52e6507ef7edfc9e2aaee05950", "title": "Curbing Pandemic Through Evolutionary Algorithm-Based Priority Aware Mobility Scheduling"}, {"paperId": "9858d16f11c0183737ff098c6dc97ce2374c330a", "title": "Design and Implementation of a Real-Time Crowd Monitoring System Based on Public Wi-Fi Infrastructure: A Case Study on the Sri Chiang Mai Smart City"}, {"paperId": "a274a12ab42b0d87437091abb717b1d12419042a", "title": "Multi-camera BEV video-surveillance system for efficient monitoring of social distancing"}, {"paperId": "1955d58559a70873fde2b0055cc780fa3a759080", "title": "Integration of IoT in building energy infrastructure: A critical review on challenges and solutions"}, {"paperId": "ee4910b2b91f2394ec87c0774921ba9a96d1453d", "title": "Integration of TinyML-based proximity and couch sensing in wearable devices for monitoring infectious disease's social distance compliance"}, {"paperId": "2b10c402a0bac676d2af48c2a0accf54a9a3f566", "title": "A Novel Social Distancing Approach for Limiting the Number of Vehicles in Smart Buildings Using LiFi Hybrid-Network"}, {"paperId": "4f54947448bea1bc90604c1d77e1cf9dafcbb951", "title": "Fighting Pandemics With Augmented Reality and Smart Sensing-Based Social Distancing"}, {"paperId": "f8b23ce892cffded60251d7c7e5757969ee59583", "title": "COVID-19 Impacts in the New Technological Era: Cross-Border Privacy Issues With Emphasis on AI"}, {"paperId": "0bce0f5ddd28a149b6a1b9da34aed4271c8579b3", "title": "Passive and Privacy-Preserving Human Localization: A Social Distancing Approach Using Commercial Millimeter-Wave Access Points"}, {"paperId": "0d19eae6886b9b8b016a5a32d8cbf33acfd9a2d2", "title": "Automated Physical Distance Estimation and Crowd Monitoring Through Surveillance Video"}, {"paperId": "eddfbcff5b06f00b4fdaccd6b949ec9777f0865c", "title": "UAV-to-UAV Communication Scheme for Enabling Emergency Services During Network Failure"}, {"paperId": "fecf4c847862b178523be3b9d938250d92b82221", "title": "Automatic social distance estimation for photographic studies: Performance evaluation, test benchmark, and algorithm"}, {"paperId": "ba8c5b8aaf5eb425f9ccb9332ec5ba42af261464", "title": "The role of data platforms in COVID-19 crisis: a smart city perspective"}, {"paperId": "83ea1d129d7febb748ec90ad1c04e098d4802046", "title": "Exploring factors affecting customer trust in social distancing technology and impact on hotel booking intentions"}, {"paperId": "1eaf3a1f9843478a2fedfbb90e057ac9c1c7b10e", "title": "Passive and Privacy-preserving Human Localization via mmWave Access Points for Social Distancing"}, {"paperId": "c7e3e602dc0dda9e8af203380bab20bebd3ee6c9", "title": "AECT: Accurate Energy Efficient Contact Tracing Using Smart Phones for Infectious Disease Detection"}, {"paperId": "a08e0c4fe406f878616022ce57e82ab8299c74b4", "title": "6G Mobile Communication Technology: Requirements, Targets, Applications, Challenges, Advantages, and Opportunities"}, {"paperId": "d892a474ac5daf42463eecb58f24b076df3cfd37", "title": "Social Distance Monitoring to Enhance the Safety from COVID-19 Infection"}, {"paperId": "ecdac4a3ca5c0a8844a845c5647d97ee517db0a3", "title": "Deep neural network-based physical distancing monitoring system with tensorRT optimization"}, {"paperId": "503d77be940acceb9802236157889bc9308e24be", "title": "A survey of COVID-19 in public transportation: Transmission risk, mitigation and prevention"}, {"paperId": "5fc812db405272f25a50617244d4b6e7cd8d8b2a", "title": "Digital Transformation during COVID-19 and Its Impact on Transportation and Mobility"}, {"paperId": "fdd55296da274877fcf52c27defde8506ce345ca", "title": "Privacy-Preserving Techniques in Social Distancing Applications: A Comprehensive Survey"}, {"paperId": "ffb7e1378ee698a6a081e96ddc3f2b94ec19e704", "title": "ViDMASK dataset for face mask detection with social distance measurement"}, {"paperId": "0b8917871b07e7764b90e6be798be1aeac355de2", "title": "Monitoring Social Distancing With Single Image Depth Estimation"}, {"paperId": "9b07ef4b7b6f4533f111c25991e1ed1881053f3b", "title": "Documents in the Air"}, {"paperId": "eb42a70c161bb79b6b792c7bb6e0b6e328f68eb3", "title": "On the High Fluctuations of Received Signal Strength Measurements With BLE Signals for Contact Tracing and Proximity Detection"}, {"paperId": "65db41ae75de37bd27db4904dfb39a3c9a9996fc", "title": "Wireless Technologies for Social Distancing in the Time of COVID-19: Literature Review, Open Issues, and Limitations"}, {"paperId": "12bfdf5366f67477c44f1585b2d52d14031b2068", "title": "Social distance monitoring system using deep learning and entry control system for commercial application"}, {"paperId": "75704827b07ba3a12886ff768ca84260529bb071", "title": "Smart Health"}, {"paperId": "9bfc91f8753b3c41a6805f41b0ab44adcaa8e1ba", "title": "The landscape of facial processing applications in the context of the European AI Act and the development of trustworthy systems"}, {"paperId": "788390258d53e4ac313c75c1d39b79d06321f630", "title": "Non-Pharmaceutical Interventions against COVID-19 Pandemic: Review of Contact Tracing and Social Distancing Technologies, Protocols, Apps, Security and Open Research Directions"}, {"paperId": "a1393dc40c28f86afe96dcc7531a442507685533", "title": "Enabling and Emerging Sensing Technologies for Crowd Management in Public Transportation Systems: A Review"}, {"paperId": "0b111e387bcd43e99d97d4a4b4400696a0d3b11a", "title": "Edge Computing to Solve Security Issues for Infectious Disease Intelligence Prevention"}, {"paperId": "5f04fe4b97954a39e5e97cd59b2a1c74cb5767d8", "title": "A Novel Privacy-Preserving Scheme in IoT-Based Social Distancing Technologies"}, {"paperId": "c60f2be34656d7c314b7af5b7466a4fd9271f5c6", "title": "Privacy-preserving People Identification and Tracking without Use of Facial Recognition"}, {"paperId": "4b97b99832a325d96aeb169c392237506ad47786", "title": "Enabling and Emerging Sensing Technologies for Crowd Avoidance in Public Transportation: A Review"}, {"paperId": "ea9eb25f5cf55d832dc2510c09fe474cf03b5f5d", "title": "Monitoring Social Distancing in Smart Spaces using Infrastructure-Based Sensors"}, {"paperId": "b1b6bd7f30dcfba5ba08885b7b5067be018d835d", "title": "Modelling and Experimental Assessment of Inter-Personal Distancing Based on Shared GNSS Observables"}, {"paperId": "293814f9857951c0652d88e80df7641454a2bef0", "title": "Automatic Social Distance Estimation From Images: Performance Evaluation, Test Benchmark, and Algorithm"}, {"paperId": "d2352f543ae5568e7f8640e5bfd11a1f0a4e8aa0", "title": "COVID-19 digital contact tracing applications and techniques: A review post initial deployments"}, {"paperId": "8be77ae5573c689d85162b27632e6432339589be", "title": "Effectiveness modelling of digital contact-tracing solutions for tackling the COVID-19 pandemic"}, {"paperId": "4814237990c2916ff783b6b77ea0b09ee701a4dd", "title": "Impact of COVID-19 on IoT Adoption in Healthcare, Smart Homes, Smart Buildings, Smart Cities, Transportation and Industrial IoT"}, {"paperId": "dc93d916d5d38bfd2fae69457adebb4897dca6e8", "title": "How detection ranges and usage stops impact digital contact tracing effectiveness for COVID-19"}, {"paperId": "0bf24b0bce0150bb143b0b9ed9e9fdd076e4c611", "title": "Use of Artificial Intelligence on spatio-temporal data to generate insights during COVID-19 pandemic: A Review"}, {"paperId": "8953c817a10a923b5a125f223b4f81210a7ce2a8", "title": "Vehicular networks for combating a worldwide pandemic: Preventing the spread of COVID-19"}, {"paperId": "ef355bdaef24bab57fa614b6ec56def8d67ab7cf", "title": "Smart Social Distancing Solution Using Bluetooth® Low Energy"}, {"paperId": "62deec63eee5ed14b89567ee50cc80faeccf985b", "title": "Technical Perspectives of Contact-Tracing Applications on Wearables for COVID-19 Control"}, {"paperId": "ffa3235384d90e1343862b1b1b8840c4fa2f8085", "title": "Sensing Technologies for Crowd Management, Adaptation, and Information Dissemination in Public Transportation Systems: A Review"}, {"paperId": "c7d2f4c5005255ebf862fe7535ded48794f36957", "title": "Safe and Reliable Public Transportation Systems (SALUTARY) in the COVID-19 pandemic"}, {"paperId": "eb664ef2a40f3471487dff9457e2424999c08767", "title": "State of the Art in Adoption of Contact Tracing Apps and Recommendations Regarding Privacy Protection and Public Health: Systematic Review"}, {"paperId": "cb4bd0d4a4f6ae50d0701bb0c4b41bccd6f3c2d2", "title": "Sociological modeling of smart city with the implementation of UN sustainable development goals"}, {"paperId": "97be58e18528a967550edc51822223306a64273f", "title": "Social distancing compliance: A video observational analysis"}, {"paperId": "5523f8432dd84054bfdef150a1486c904589d5d0", "title": "A Comprehensive Survey of Enabling and Emerging Technologies for Social Distancing—Part I: Fundamentals and Enabling Technologies"}, {"paperId": "f9a34db9786602333295be82e47a32eedcfdf837", "title": "Incentives for Individual Compliance with Pandemic Response Measures"}, {"paperId": "5aabc51ebb55c21c20f91169f42856e4ea4484c9", "title": "A Survey on Acoustic Positioning Systems for Location-Based Services"}, {"paperId": "a9c239bb8cb692fb5089c85e9e51e95038903910", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "63c47c0adfe9c38e7d1fe78630a0a3e1c1346cde", "title": "Privacy Preservation of User Identity in Contact Tracing for COVID-19-Like Pandemics Using Edge Computing"}, {"paperId": "52bbc1524d3b0d943f02e07614ef44bde74b2c9f", "title": "Impact of COVID-19 on Adoption of IoT in Different Sectors"}, {"paperId": "f855fef0e8d55dc234e79077ff5862d5e2dea94e", "title": "VLSI Based Architecture in ECG Monitoring for Adaptive Power Management In Wireless Bio Signal Acquisition Network"}, {"paperId": "aa1215fae45ffc06909aff64a9763fb7d0056d78", "title": "VLSI based Implementation of Channel oriented ICA Processor for Biomedical systems"}, {"paperId": "febe9fd29f8a0d3e71f35088a469c35885141e8d", "title": "Smart Health"}, {"paperId": "adc8ccbe4e17f5c9594f79edbcca353dc38fbf85", "title": "Towards a new era of IoT applications to overcome Pandemic situations: Intelligent systems and recovery strategies to overcome Covid-19"}, {"paperId": "2ad824bee7f745d98418a41141ff4378c24b2948", "title": "Determinants to Improve Management Studies Students’ E - Learning Quality A Study on Indonesian Public Sector Universities"}]}
