{"paperId": "5ab133346b3311bbb3d85f38a22b7faa65165bac", "publicationVenue": {"id": "7474c4a0-75d9-4105-9809-8e7d5201c5e1", "name": "International Conference on Language Resources and Evaluation", "type": "conference", "alternate_names": ["LREC", "Int Conf Lang Resour Evaluation"], "url": "http://www.lrec-conf.org/"}, "title": "ELF22: A Context-based Counter Trolling Dataset to Combat Internet Trolls", "abstract": "Online trolls increase social costs and cause psychological damage to individuals. With the proliferation of automated accounts making use of bots for trolling, it is difficult for targeted individual users to handle the situation both quantitatively and qualitatively. To address this issue, we focus on automating the method to counter trolls, as counter responses to combat trolls encourage community users to maintain ongoing discussion without compromising freedom of expression. For this purpose, we propose a novel dataset for automatic counter response generation. In particular, we constructed a pair-wise dataset that includes troll comments and counter responses with labeled response strategies, which enables models fine-tuned on our dataset to generate responses by varying counter responses according to the specified strategy. We conducted three tasks to assess the effectiveness of our dataset and evaluated the results through both automatic and human evaluation. In human evaluation, we demonstrate that the model fine-tuned with our dataset shows a significantly improved performance in strategy-controlled sentence generation.", "venue": "International Conference on Language Resources and Evaluation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-30", "journal": {"pages": "3530-3541"}, "authors": [{"authorId": "2150564118", "name": "Huije Lee"}, {"authorId": "2180879074", "name": "Young Ju Na"}, {"authorId": "1488736131", "name": "Hoyun Song"}, {"authorId": "2180054773", "name": "Jisu Shin"}, {"authorId": "2152282232", "name": "Jong C. Park"}], "citations": [{"paperId": "f750183da91c89a8fcd643290ed3f01045e85365", "title": "NLP for Counterspeech against Hate: A Survey and How-To Guide"}, {"paperId": "9aeae8e712343f2717ea6e55ee4414b220a712e1", "title": "Behind the Counter: Exploring the Motivations and Barriers of Online Counterspeech Writing"}, {"paperId": "2fca068a24b1b766c9c02c6aa004ca60d81023cc", "title": "Understanding Counterspeech for Online Harm Mitigation"}, {"paperId": "9978ef565d8611c3a61274e6af049c21ec4e698e", "title": "Generation of Korean Offensive Language by Leveraging Large Language Models via Prompt Design"}]}
