{"paperId": "5ad032f6d4ed9a8bcbeb4f54808ad284513d6eb1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Forwarding Strategies for Named Data Networking Based IoT: Requirements, Taxonomy, and Open Research Challenges", "abstract": "The Internet of Things (IoT) aims to efficiently connect various entities, including humans, machines, smart devices, physical environments, and others, so they can communicate and exchange data in real time. However, due to the massive amount of data transferred, the presence of devices with limited resources, heterogeneity, and mobility support would make it difficult to create a robust network with respect to performance in an IoT context. In order to efficiently disseminate the enormous volume of automated data, Named Data Networking (NDN), a viable networking design for the future Internet, has been proposed. NDN has shown great potential for IoT because it has built-in support for naming, caching, mobility, and security. Forwarding strategies play an important role in the successful deployment of NDN-based IoT. In this article, we introduce NDN-based IoT forwarding emphasizing on IoT characteristics and requirements. We classify NDN-based IoT forwarding strategies and then discuss in detail certain exemplary schemes. Additionally, we compare several aspects of current forwarding methods that are now in use, including the types of forwarding strategy, particular issues, type of solution, assessment metrics, and simulation platform. We wrap up our contribution by outlining the major open research issues that can guide future investigations in this area. We anticipate that this survey will help the community of NDN-based IoT researchers’ understanding of forwarding strategies in IoT environments.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "78363-78383", "volume": "11"}, "authors": [{"authorId": "2992383", "name": "N. A. Askar"}, {"authorId": "9425989", "name": "Adib Habbal"}, {"authorId": "90776824", "name": "Feras Zen Alden"}, {"authorId": "2115493929", "name": "Xian Wei"}, {"authorId": "31301757", "name": "Hashem Alaidaros"}, {"authorId": "1500426633", "name": "Jielong Guo"}, {"authorId": "2118683394", "name": "Hui Yu"}], "citations": [{"paperId": "05bb2815b907e5429ef4810c72362ede01281f0b", "title": "DCF: Dynamic Content Fetching in NDN based UWSN"}, {"paperId": "cea049281f4b59133916e54e3868d7c231f707b7", "title": "The Hyperthermia Calculating in Head Blood by the Specific Absorption Rate (SAR) Influence in Novel Vision"}, {"paperId": "6d32f85d93e8e882424edacfe1a80fa46d792892", "title": "FDF: Fragment based Data Forwarding in NDN based UWSN"}, {"paperId": "58bfc7769e076efbe74661d24ccef0deee9ff692", "title": "Recent developments, application cases, and lingering issues on the path to a 6G IoT"}, {"paperId": "18f3affc62662c1255f951d09f747657f42a029e", "title": "Artificial Intelligence Trust, Risk and Security Management (AI TRiSM): Frameworks, applications, challenges and future research directions"}, {"paperId": "3f295ed8d79d6268744ada2a062854ce5535f524", "title": "Performance Measurement Through Caching in Named Data Networking Based Internet of Things"}]}
