{"paperId": "5ad4c5544b2abb445456a9ed9a2f1bffb624b18d", "publicationVenue": {"id": "f276563a-4ccc-47fc-b959-9658e1434dfd", "name": "International Conference Inventive Communication and Computational Technologies", "type": "conference", "alternate_names": ["Int Conf Inven Commun Comput Technol", "International Conference Intelligent Computing and Communication Technologies", "ICICCT", "Int Conf Intell Comput Commun Technol"]}, "title": "A Novel Approach for Insight Finding Mechanism on ClickStream Data Using Hadoop", "abstract": "In today's world, there is huge importance for analyzing large data sets in a short span of time. Hadoop is one of such framework that is used to store and process huge unstructured or semi structured data in a distributed manner. The main theme of this paper is to analyze clickstream data that has been gathered from online retail e-commerce website using Hadoop framework. In this process, we are going to use many tools like Pig, Hive, Sqoop which works based on map-reduce algorithm in order to process big data in efficient way. The Insight finding mechanism used to tell us day wise sales report, hourly sales report and top sold item reports based on the clickstream dataset. In the end, the output visualization plots will give the detailed insights based on the clickstream data that we have processed.", "venue": "International Conference Inventive Communication and Computational Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-04-20", "journal": {"name": "2018 Second International Conference on Inventive Communication and Computational Technologies (ICICCT)", "pages": "446-449"}, "authors": [{"authorId": "2285805646", "name": "P. Mohan Anand"}, {"authorId": "2286051304", "name": "G. Sai Vamsi"}, {"authorId": "2285764467", "name": "P. Ravi Kumar"}], "citations": [{"paperId": "bf28ec525bbb77ce014f5d4b669f7f0f5628a4f1", "title": "Multimodal big data affective analytics: A comprehensive survey using text, audio, visual and physiological signals"}, {"paperId": "b32068aff61bc5fb51ce52e3b8b7b6715dd2a45f", "title": "Data Gathering Architecture for Clickstream Data Mining on Online Shop"}, {"paperId": "d9b18229a5dababf59eff139b1aa168006554bd9", "title": "The Use of Data Visualization in E-Commerce: A Review"}, {"paperId": "bfb571b60e6c04f4681a1cc3697f6ef044b4785f", "title": "An Intelligent Approach for Data Analysis and Decision Making in Big Data: A Case Study on E-commerce Industry"}]}
