{"paperId": "5ade280c4d9cb28b07845fb43ee32079fcc30d84", "publicationVenue": {"id": "fdeb5c51-251b-4f10-aaec-bf0b5adc6beb", "name": "World Journal of Advanced Research and Reviews", "type": "journal", "alternate_names": ["World J Adv Res Rev"], "issn": "2581-9615", "url": "http://wjarr.com/"}, "title": "Privacy and security issues in fog-to-fog communication: A survey", "abstract": "The rapid growth of Fog Computing has brought a paradigm shift in data processing and communication, presenting various benefits such as reduced latency, efficient data processing, enhanced scalability and the ability to operate effectively in resource-constrained environments. However, the technology introduced complex privacy and security issues. This paper conducted a thorough exploration of privacy and security issues associated with fog-to-fog (F2F) communication within the broader framework of fog computing. It initiated by providing a background of fog computing, it’s architecture and the core characteristics of fog computing. This survey aimed to discuss the state-of-the-art of privacy and security concerns in fog-to-fog communication. The survey also proposed the areas of future research to equip researchers, practitioners, policy makers and the decision makers with solid knowledge, offering guidance in navigating the complex landscape of privacy and security issues in fog-to-fog (F2F) communication. The survey also aimed to discuss the existing privacy and security research gaps in fog-to-fog (F2F) communication. The findings of this review underscore privacy and security issues in F2F communication, providing valuable insights into recommended countermeasures to strengthen the overall security framework.", "venue": "World Journal of Advanced Research and Reviews", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-30", "journal": {"name": "World Journal of Advanced Research and Reviews"}, "authors": [{"authorId": "2276629600", "name": "Timothy Murkomen"}], "citations": []}
