{"paperId": "5ae6a0ab6dcf161cf74e88b09b886e30b88356f4", "publicationVenue": {"id": "86c6857e-8abb-442e-bb95-3a00ae6fe4a6", "name": "Wireless on Demand Network Systems and Service", "type": "conference", "alternate_names": ["WONS", "Wirel Demand Netw Syst Serv"], "url": "http://www.wikicfp.com/cfp/program?id=3130"}, "title": "Cliffhanger: An Experimental Evaluation of Stateful Serverless at the Edge", "abstract": "The serverless computing paradigm has transformed cloud service deployment by enabling automatic scaling of resources in response to varying demand. Building on this, stateful serverless computing introduces critical capabilities for data management, fault tolerance, and consistency, which are particularly relevant in the context of distributed deployments, notably in edge computing environments. In this work, we explore the feasibility of stateful serverless computing in resource-limited edge environments through an empirical study utilizing a multi-view object tracking application. Our results show that while these systems perform well in cloud environments, their effectiveness is severely affected at the edge due to state, application, and resource management solutions optimized for cloud environments. Existing solutions are most detrimental to applications with intermittent workloads, as typical combinations of concurrency handling and resource reservation can lead to minutes of unstable system behavior due to cold starts. Our results highlight the need for a tailored approach in stateful serverless systems for edge computing scenarios.", "venue": "Wireless on Demand Network Systems and Service", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-29", "journal": {"name": "2024 19th Wireless On-Demand Network Systems and Services Conference (WONS)", "pages": "41-48"}, "authors": [{"authorId": "2221056397", "name": "Adam Hasselberg"}, {"authorId": "102400559", "name": "Thomas Ohlson Timoudas"}, {"authorId": "2290081983", "name": "Paris Carbone"}, {"authorId": "2290093070", "name": "György Dán"}], "citations": []}
