{"paperId": "5aec44d69e3cd8a94c0e59a4bcfef6f9460c92f2", "publicationVenue": null, "title": "Malicious URL Detection Based on Improved Multilayer Recurrent Convolutional Neural Network Model", "abstract": "The traditional malicious uniform resource locator (URL) detection method excessively relies on the matching rules formulated by the network security personnel, which is hard to fully express the text information of the URL. Thus, an improved multilayer recurrent convolutional neural network model based on the YOLO algorithm is proposed to detect malicious URL in this paper. First, single characters are mapped to dense vectors using word embedding, and the dense vectors are participated in the training process of the whole model according to the structural characteristics of the URL in the method. Then, the CSPDarknet neural network model based on the improved YOLO algorithm is proposed to extract features of the URL. Finally, the extracted features are used to evaluate malicious URL by the bidirectional LSTM recurrent neural network algorithm. In order to verify the validity of the algorithm, a total of 200,000 URLs are collected, including 100,000 normal URLs labeled “good” and 100,000 malicious URLs labeled “bad”. The experimental results show that the method detects malicious URLs more quickly and effectively and has high accuracy, high recall rate, and high accuracy compared with Text-RCNN, BRNN, and other models.", "venue": "Secur. Commun. Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-26", "journal": {"name": "Secur. Commun. Networks", "pages": "9994127:1-9994127:13", "volume": "2021"}, "authors": [{"authorId": "2000516429", "name": "Zuguo Chen"}, {"authorId": "2152800125", "name": "Yang Liu"}, {"authorId": "2145763842", "name": "Chaoyang Chen"}, {"authorId": "2149493596", "name": "Ming Lu"}, {"authorId": "2118855372", "name": "Xuzhuo Zhang"}], "citations": [{"paperId": "fe0e173ece6edf3e82106188fccedaad0b2eaa59", "title": "An Abnormal External Link Detection Algorithm Based on Multi-Modal Fusion"}, {"paperId": "556772cfa83ff985f233b4ad7c02bdced235b8db", "title": "Ocean carbon emission prediction and management measures based on artificial intelligence remote sensing estimation in the context of carbon neutrality."}, {"paperId": "2a5b49da033c08858852a0ed6d5d3dc52ffc9424", "title": "Accuracy of Machine Learning for Classifying Malicious URL"}, {"paperId": "bd83cadef8aeaf26046e8e3ab9387c2223c2f00d", "title": "Accurate identification of cashmere and wool fibers based on enhanced ShuffleNetV2 and transfer learning"}, {"paperId": "eebe05715bbdb167add5f3df1d7518590c076960", "title": "Classification of Malicious URLs Using Naive Bayes and Genetic Algorithm"}, {"paperId": "1c09268b3cae8ed05356ee0e1344ba40656be250", "title": "Multi-field relation mining for malicious HTTP traffic detection based on attention and cross network"}, {"paperId": "377fd63aa67e9ac1cab465ec6e7f1e2d3260c5ad", "title": "Developing and Evaluating an Artificial Intelligence Model for Malicious URL Detection"}, {"paperId": "5e3cf2015fae1156c974b9df3e9c91f09da76ce6", "title": "Incremental Update based Closed-Loop Malicious URL Detection System"}, {"paperId": "21dbb081162dda173ed95e30d6cc1e4b4c1270e2", "title": "Classification of Malicious URLs by CNN Model Based on Genetic Algorithm"}, {"paperId": "0ce51ad682ead66309aead2b7a2c9aa2e274d672", "title": "Malicious URL Detection Using Decision Tree-based Lexical Features Selection and Multilayer Perceptron Model"}, {"paperId": "7c8625bcefc070fcf884fad71f058e5e0a7b155a", "title": "Crafting Text Adversarial Examples to Attack the Deep-Learning-based Malicious URL Detection"}, {"paperId": "c4306068803c4cd1c9369006d3777a4413786e72", "title": "A Study on the Detection Method for Malicious URLs Based on a Number of Search Results Matching the Internet Search Engines Combining the Machine Learning"}, {"paperId": "666a0fe9613215e32fc4bec1ac73025b21360dbe", "title": "Machine learning methods of sleuthing malevolent web channels"}]}
