{"paperId": "5aee8865fb79fda96df7ba37f2597af727e1a9a5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Bargaining-based Approach for Feature Trading in Vertical Federated Learning", "abstract": "Vertical Federated Learning (VFL) has emerged as a popular machine learning paradigm, enabling model training across the data and the task parties with different features about the same user set while preserving data privacy. In production environment, VFL usually involves one task party and one data party. Fair and economically efficient feature trading is crucial to the commercialization of VFL, where the task party is considered as the data consumer who buys the data party's features. However, current VFL feature trading practices often price the data party's data as a whole and assume transactions occur prior to the performing VFL. Neglecting the performance gains resulting from traded features may lead to underpayment and overpayment issues. In this study, we propose a bargaining-based feature trading approach in VFL to encourage economically efficient transactions. Our model incorporates performance gain-based pricing, taking into account the revenue-based optimization objectives of both parties. We analyze the proposed bargaining model under perfect and imperfect performance information settings, proving the existence of an equilibrium that optimizes the parties' objectives. Moreover, we develop performance gain estimation-based bargaining strategies for imperfect performance information scenarios and discuss potential security issues and solutions. Experiments on three real-world datasets demonstrate the effectiveness of the proposed bargaining model.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-23", "journal": {"name": "ArXiv", "volume": "abs/2402.15247"}, "authors": [{"authorId": "2238910821", "name": "Yue Cui"}, {"authorId": "41075660", "name": "Liuyi Yao"}, {"authorId": "2286259159", "name": "Zitao Li"}, {"authorId": "2237607166", "name": "Yaliang Li"}, {"authorId": "2266389996", "name": "Bolin Ding"}, {"authorId": "2282601133", "name": "Xiaofang Zhou"}], "citations": []}
