{"paperId": "5aeedc7f4de399a8ac06fb8e9279f69b93e9f90d", "publicationVenue": {"id": "82abb852-2f68-4b85-b9b2-8887e2a9cdac", "name": "IEEE Transactions on Human-Machine Systems", "type": "journal", "alternate_names": ["IEEE Trans Human-machine Syst"], "issn": "2168-2291", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6221037", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221037"]}, "title": "Choice, Uncertainty, and Decision Superiority: Is Less AI-Enabled Decision Support More?", "abstract": "Providing decision makers with more information is often expected to result in more informed and superior decisions. This is especially true when leveraging artificial intelligence (AI) to explore and find complex patterns in vast amounts of data. Although AI can enable an “information advantage,” truly intelligent systems should buffer scarce human cognitive resources from information overload and be well adapted to the environment in which they are deployed. Paradoxically, some practitioners have conflated AI's information processing superiority with a contradictory decision-support goal: to provide human decision makers with more, higher quality, or more novel courses of action, regardless of context, than they could generate without AI. In this article, I review the evidence examining the costs and benefits of providing decision makers with more or less choice and identify the factors that moderate the relationship between the amount of choice and decision effectiveness. Although providing more information and choice increases confidence and certainty in one's decision, it can make decision making more difficult, decrease satisfaction, and result in poorer decision outcomes. The research indicates that such negative effects are influenced by the level of entropy and variety provided and can be reduced with increased familiarity but are further compounded when decisions are increasingly effortful, difficult, or complex. The review concludes with guidance on how designers might leverage knowledge of choice overload and associated moderator effects to create more adaptive and effective decision support systems.", "venue": "IEEE Transactions on Human-Machine Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-01", "journal": {"name": "IEEE Transactions on Human-Machine Systems", "pages": "781-791", "volume": "53"}, "authors": [{"authorId": "121220292", "name": "P.Layzell Ward"}], "citations": [{"paperId": "f303f7f4c952e4af673a6cc3197e8275bdb2b31f", "title": "Mesterséges intelligencia a precíziós állattartók vezetői döntéseiben : Bíznak-e a gazdák az adatokban?"}]}
