{"paperId": "5aeedad494b6fab24cfe477708e93d4b1ef67fb8", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "Comparing COVID-19 vaccine passports attitudes across countries by analysing Reddit comments", "abstract": "Topic mining and sentiment polarity analysis together can adequately represent the topics and attitudes of users. The goal of this article is to use Reddit’s location-based subreddits to look at country-level differences in attitudes towards COVID-19 vaccine passports. We used sentiment analysis and latent topic modelling on textual data obtained from 18 Reddit communities concentrating on COVID-19 vaccine passports from 1 January 2021 to 28 February 2022 to study COVID-19 vaccine passports–related discussion on Reddit. To discover changes in sentiment and latent topics, 11,168 comments were aggregated and examined by month. The number of comments on postings from country-specific subreddits was positively proportional to the number of new COVID-19 cases reported each day. The more subjective expressions and positive/negative interpretations occurred after July 2021. Communities indicated more positive sentiment than negative sentiment towards vaccine passports–related topics, according to polarity analysis. Topic modelling found that community members were concerned about a variety of concerns related to their socioeconomic status. Throughout the topic modelling, keywords suggesting people’s privacy concerns and acceptance of various COVID-19 control methods were found. The use of public opinion and topic modelling to analyse vaccine passports could help with important global health informatics concerns associated with their socioeconomic status.", "venue": "Journal of information science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-02-03", "journal": {"name": "Journal of Information Science"}, "authors": [{"authorId": "2128718849", "name": "M. M. E. Yurtsever"}, {"authorId": "2076938929", "name": "M. Shiraz"}, {"authorId": "49124735", "name": "Ekin Ekinci"}, {"authorId": "2145599", "name": "S. Eken"}], "citations": [{"paperId": "cc9eec238b9f427f77d15ba77854a4b760d8dddc", "title": "Ethic wars: student and educator attitudes in the context of ChatGPT"}, {"paperId": "cec3a8570e7fdb35f64b49ea05e1708d002a47c9", "title": "CBMAFM: CNN-BiLSTM Multi-Attention Fusion Mechanism for sentiment classification"}, {"paperId": "f3e830e632ff61fb67f26c305503e2f8d9f248fb", "title": "Customer Complaints-Based Water Quality Analysis"}, {"paperId": "03310600617d23b26e1a4dd39095df1a054c5a7f", "title": "Constructing a spatiotemporal situational awareness framework to sense the dynamic evolution of online public opinion on social media"}, {"paperId": "d73b8d6e57e39c345aa85f1d83e39b31c7c19aa2", "title": "Recent trends in vaccine coverage and confidence: A cause for concern"}, {"paperId": "7663f1a36f1818910fa95014a81edc7494a79b1e", "title": "The Conversation around COVID-19 on Twitter—Sentiment Analysis and Topic Modelling to Analyse Tweets Published in English during the First Wave of the Pandemic"}, {"paperId": "e2555bc7dd53fe43b32fbfcf1cebf65d03dc5f05", "title": "Analysis of Public Sentiment regarding COVID-19 Vaccines on the Social Media Platform Reddit"}, {"paperId": "a08eb46b814f040a8f830d24b57f0539058157c7", "title": "Gold Returns Prediction: Assessment based on Major Events"}]}
