{"paperId": "5afc52f13d5ef84a7a1ccfe32d9b699614fea77f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enhancing Operational Resilience of Critical Infrastructure Processes Through Chaos Engineering", "abstract": "Modern cyber-physical systems (CPS) are interdependent, mechanical and IT components that support operations in most of society’s critical infrastructures. Time and again history has proven that CPS are vulnerable to numerous types of threats, ranging from safety accidents to cybersecurity malicious attacks. Current research focuses on analyzing the various input vectors in CPS, whether mechanical or IT, to detect and patch flaws and vulnerabilities to mitigate potential impact in operation. Still, there is little work that can inherently analyze the software-based implementation of modern CPS with complex behavior and failure modes. The only vaguely relevant approach involves an operations-based experimentation methodology from NetFlix named chaos engineering (CE) that tests use cases on complex Content Delivery Networks (CDN) to build confidence in their capability to withstand turbulent conditions in production. Conditions can range from hardware failures to DoS attacks, to a malformed injection appearing in a runtime configuration parameter. Yet this approach was only tested on software based CDN, and not on CPS with industrial actuators and mechanical parts that control physical processes. In this paper, we introduce a novel framework that combines CE with digital twin (DT) technology to enhance the detection of operational vulnerabilities and increase the resilience of CPS. To achieve this objective, we integrated CE experimentation into the simulation phase of DT models using material flow networks. This allows us to assess system resilience during the operational stage without disrupting critical operations and identify vulnerable flows and processes within the modeled system. To evaluate the effectiveness of our approach, we conduct experiments on a DT that models a real-world Liquefied Petroleum Gas purification process from an existing oil refinery in the Mediterranean area. The results of these experiments demonstrate the method’s effectiveness in capturing the heightened susceptibility of the Gas purification process to adverse events.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "106172-106189", "volume": "11"}, "authors": [{"authorId": "1423668518", "name": "Panagiotis Dedousis"}, {"authorId": "2230737", "name": "G. Stergiopoulos"}, {"authorId": "2243847", "name": "G. Arampatzis"}, {"authorId": "1715188", "name": "D. Gritzalis"}], "citations": [{"paperId": "4403d6f720b8699193458df8b11e70c367c2d09c", "title": "Threats, Attacks, and Cryptography Frameworks of Cybersecurity in Critical Infrastructures"}]}
