{"paperId": "5b0b7a27ad6e46ba624f9adec1cf90866b389adb", "publicationVenue": {"id": "54cdc508-6fba-4c63-8523-bbcb668fc2ca", "name": "Applied System Innovation", "alternate_names": ["Appl Syst Innov"], "issn": "2571-5577", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1109441", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1109441", "https://www.mdpi.com/journal/asi"]}, "title": "An Ontological Approach for Early Detection of Suspected COVID-19 among COPD Patients", "abstract": "Recent studies on chronic obstructive pulmonary disease (COPD) patients in the context of the coronavirus 19 (COVID-19) pandemic have reported two important problems, i.e., high mortality and vulnerability among COPD patients vs. non-COPD patients. The high number of deaths are caused by exacerbations, COVID-19, and other comorbidities. Therefore, the purpose of this article is to reduce the risk factors of COPD in the COVID-19 context. In this article, we propose approaches based on adaptation mechanisms for detecting COVID-19 symptoms, to better provide appropriate care to COPD patients. To achieve this goal, an ontological model called SuspectedCOPDcoviDOlogy has been created, which consists of five ontologies for detecting suspect cases. These ontologies use vital sign parameters, symptom parameters, service management, and alerts. SuspectedCOPDcoviDOlogy enhances the COPDology proposed by a previous research project in the COPD domain. To validate the solution, an experimental study comparing the results of an existing test for the detection of COVID-19 with the results of the proposed detection system is conducted. Finally, with these results, we conclude that a rigorous combination of detection rules based on the vital sign and symptom parameters can greatly improve the dynamic detection rate of COPD patients suspected of having COVID-19, and therefore enable rapid medical assistance.", "venue": "Applied System Innovation", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-03-09", "journal": {"name": "Applied System Innovation"}, "authors": [{"authorId": "51313530", "name": "Konan-Marcelin Kouamé"}, {"authorId": "3138293", "name": "H. Mcheick"}], "citations": [{"paperId": "a7702a09b9c4849b06a134290b18dfbef45ff1f4", "title": "CODCA – COVID-19 ONTOLOGY FOR DATA COLLECTION AND ANALYSIS IN E-HEALTH"}, {"paperId": "68df3f83a1af7e2d0c59883800a9236249d172c0", "title": "OntoRepliCov: an Ontology-Based Approach for Modeling the SARS-CoV-2 Replication Process"}, {"paperId": "0b0a6a09d812d630464cf00045635a5eaafed3d4", "title": "The COVID-19 epidemiology and monitoring ontology"}, {"paperId": "037b095adcc6beaad39a94ebb1a2ec1b5cf35646", "title": "A survey on ontology techniques deployed in the biomedical domain"}]}
