{"paperId": "5b0bb68bec04d9cc93dd834cef21842d8c8f00bb", "publicationVenue": null, "title": "Modeling the enablers of humanitarian supply chain management: a hybrid group decision-making approach", "abstract": "PurposeThis paper intends to explore and appraise the humanitarian supply chain management enablers (HSCMEs) for efficient and effective humanitarian operations. This research aims to analyze the interaction of enablers for humanitarian supply chain management (HSCM) using a proposed hybrid framework consists of fuzzy Delphi (FD), interpretive structural modeling (ISM)–matriced impacts croises multiplication appliquee a un classement (MICMAC) and revised Simos approach.Design/methodology/approachThis research is deliberate to identify 28 HSCMEs through a literature review and experts' opinions; out of which 20 HSCMEs are selected using FD. ISM is applied to know contextual relationship among the selected HSCMEs for developing a hierarchical model. The MICMAC analysis classifies the HSCMEs based on driving power and dependence power to validate the developed hierarchical ISM structure. The revised Simos technique is used to prioritize the HSCMEs to access its relative significance in humanitarian operations.FindingsThe finding of the analysis suggests that government policy and leadership support obtained the highest priority, having high driving power and low dependence power is significantly strategic and emerged as the leading driver for the HSCM implementation.Research limitations/implicationsISM model presents an insight into interrelationship among HSCMEs, but this cannot quantify the impact of each HSCMEs.Practical implicationsDisaster relief aid agencies and stakeholders may focus on the enablers having high driving power and higher weight in designing and executing an effective and efficient humanitarian supply chain and to improve their activities and strategies of HSCM.Social implicationsThis research helps humanitarian logisticians and humanitarian organizations to make better decisions to improve their operational performance in pre and postdisaster phases.Originality/valueThis paper explores the application of proposed hybrid framework to analyze the HSCMEs that can be considered as the original contribution.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-08-27", "journal": {"name": "Benchmarking: An International Journal", "volume": ""}, "authors": [{"authorId": "2114357544", "name": "S. Agarwal"}, {"authorId": "144142747", "name": "R. Kant"}, {"authorId": "50876940", "name": "R. Shankar"}], "citations": [{"paperId": "aa5ea2ba8b64a6a4c7567ab342cb8105d75ffc75", "title": "META ANALYSIS THE EMISION OF GREEN PORT CITY : A LITERATURE REVIEW"}, {"paperId": "0e551e255674316c70a7de3a20c40738a2adc319", "title": "Sustailient supplier selection using neutrosophic best–worst approach: a case study of additively manufactured trinkets"}, {"paperId": "4261970e1dc1ae0eaace846110b898cf12f286e2", "title": "Multi-criteria decision-making methods: application in humanitarian operations"}, {"paperId": "a4bfcec8f0e35b7a4d62e75eafd89622c9c133f5", "title": "Implementing smart waste management system for a sustainable circular economy in the textile industry"}, {"paperId": "208792a538a03bcb0a19e20bfc13229fd494b69c", "title": "Modeling organizational resilience in maritime business: an ISM and MICMAC approach"}, {"paperId": "634050a1099ac8ee5e81f03dc788c0140899d9e9", "title": "Analysis of critical success factors for successful integration of lean six sigma and Industry 4.0 for organizational excellence"}, {"paperId": "32e052c9ec891dc757026bcd5ba12158b1dbdc54", "title": "A decision support tool for oil spill response strategy selection: application of LBWA and Z MABAC methods"}, {"paperId": "b08dd4b767a898af03ddd6f711f8d54cc37a51f4", "title": "Evaluation of sustainable energy planning scenarios with a new approach based on FCM, WASPAS and impact effort matrix"}, {"paperId": "8e541b1f395e0dd818f11293be87366fbda1546b", "title": "Key Challenges to Sustainable Humanitarian Supply Chains: Lessons from the COVID-19 Pandemic"}]}
