{"paperId": "5b12441a02d9b2489813d4b5d766e373401691ed", "publicationVenue": {"id": "1fd287bd-e38c-4048-8acb-26f77e9c20fa", "name": "Communications in statistics. Simulation and computation", "type": "journal", "alternate_names": ["Commun Stat  Simul Comput", "Commun stat Simul comput", "Communications in Statistics - Simulation and Computation"], "issn": "0361-0918", "url": "http://www.informaworld.com/openurl?genre=journal&issn=0361-0918", "alternate_urls": ["http://www.tandfonline.com/loi/lssp20", "https://www.tandfonline.com/toc/lssp20/current"]}, "title": "Normality and significance testing in simple linear regression model for large sample sizes: a simulation study", "abstract": "Abstract Data analysis techniques that rely on standard statistical tools and algorithms often encounter problems when dealing with data sets that have large sample sizes. In this study, two statistical tests done in conducting simple linear regression analysis were revisited. In particular, the study simulated the effects of large sample sizes and amount of contamination in the data due to non-sampling errors on the false positive rate of the Kolmogorov-Smirnov (K-S) test in testing for normality of error terms. The study also characterized the effects of varying sample size and amount of contamination in the data on the false negative rate of the t-test in testing the significance of a regression coefficient. Lastly, an optimality index was developed to determine the sample sizes and the values of the percent noise at which both the false positive rate of the K-S test and the false negative rate of the t-test are minimized.", "venue": "Communications in statistics. Simulation and computation", "year": 2021, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-02", "journal": {"name": "Communications in Statistics - Simulation and Computation", "pages": "2781 - 2797", "volume": "52"}, "authors": [{"authorId": "104272276", "name": "Xavier Javines Bilon"}], "citations": [{"paperId": "a90b37cdb27964c912b8d98092ff438bf59078de", "title": "Characterizing Dependency Update Practice of NPM, PyPI and Cargo Packages"}, {"paperId": "be71ed2aa6ff02a388be76025404bf06eb63832e", "title": "Assumption-checking rather than (just) testing: The importance of visualization and effect size in statistical diagnostics"}, {"paperId": "bdce14bf7ea794140272bcf84b4cf7d55dad4c17", "title": "Mathematical modeling of farmer household income in Singosari Village, Tanggamus District"}]}
