{"paperId": "5b20be8f97bac3d0b698440900430613532238ab", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Green Supplier Evaluation and Selections: A State-of-the-Art Literature Review of Models, Methods, and Applications", "abstract": "The role of green supplier evaluation and selection (GSES) in supply chain management is increasingly appreciated due to the intensification of competition, raising public consciousness, and environmental issues. To improve GSES, a large number of approaches have been proposed in the past decades. However, few attempts have been made to systematically review and classify the literature in this field. The objective of this study is to afford a comprehensive review of the studies which aim to develop models and methods in helping enterprises to assess and select the right green suppliers. To achieve this goal, a total of 193 journal articles extracted from the Scopus database over the period of 2009 to 2020 were chosen and reviewed. These publications were classified into ten categories based on their adopted GSES models and analyzed concerning the evaluation criteria, criteria weighting methods, and performance evaluation methods. Moreover, a bibliometric analysis was conducted according to the frequency of supplier selection methods, citation number, publication year, journal, country, and application area. This study supports practitioners, managers, and researchers in effectively recognizing and applying the GSES models to enhance organizational competitiveness and provides an insight into its state of the art.", "venue": "Mathematical Problems in Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-07-15", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2143382030", "name": "Li-Jun Zhang"}, {"authorId": "2006521966", "name": "Ran Liu"}, {"authorId": "34138916", "name": "Hu-chen Liu"}, {"authorId": "39310493", "name": "Hua Shi"}], "citations": [{"paperId": "e902afbd347a7a1f9b9028b982f147f9669a27d4", "title": "Analyzing the Nexus Between Environmental\nRegulations, Green Supply Chain Management,\nand Corporate Social Responsibility\nin the Agri-Food Business"}, {"paperId": "48592fa5b996180508bcb08d63a31017211237d8", "title": "An integrated GBWM-PROMETHEE-CLOUD & MCGP model for green supplier selection and order allocation (GSSOA) in an oil refinery"}, {"paperId": "a5af7670742a127294e08a22a842142d90f03354", "title": "Decision-making models for formulating and evaluating supplier development programs: A state-of-the-art review and research paths"}, {"paperId": "7b7903500c8c553bf46c436ccaeb643a10e4339a", "title": "Umbrella Review in Green Supply Chain Management(GSCM): Developing Models for adoption and sustaining GSCM"}, {"paperId": "95370ef11b34b59f7c0e8b7c30b26c0c275a9ef1", "title": "Modified TODIM method based on cumulative prospect theory with Type-2 neutrosophic number for green supplier selection"}, {"paperId": "34639f508bbd83cffc24d090ac0eb32d889de346", "title": "The Study Program Selection System: Integrated Analytical Hierarchy Process (AHP) and Technique For Others Preference by Similarity to Ideal Solution (TOPSIS) Approach"}, {"paperId": "12f31ec5a66a82e8425b75026a34eb1891cc92ca", "title": "An Integrated Multi-Criteria Decision-Making and Multivariate Analysis Towards Sustainable Procurement with Application in Automotive Industry"}, {"paperId": "23e8bed2273da01ba1c7e944d9bf668156fa1cd3", "title": "Comprehensive quantity discount model for dynamic green supplier selection and order allocation"}, {"paperId": "9ff4c9b229a51387e9e53dc396526563c472eb0e", "title": "Multicriteria sorting method based on global and local search for supplier segmentation"}, {"paperId": "efb3d6f0821b44d0f773ab35a4708b5f9b93ce6e", "title": "Analisis pengukuran kinerja green SCM menggunakan metode green SCOR berbasis ANP serta OMAX (studi kasus: industri makanan)"}, {"paperId": "843a6b82be6299d9649bcf4e8bf67983ad627a7e", "title": "Multi-Criteria Decision-Making Methods in Green Logistics"}, {"paperId": "edd71b19b4d4ef3e42276ed8342f055c56e675f4", "title": "Integration of fuzzy AHP and fuzzy TOPSIS for green supplier selection of mindi wood raw materials"}, {"paperId": "cb9e27bc07d70458c5dc03f4262452764876cbb8", "title": "Sustainable Technology Supplier Selection in the Banking Sector"}, {"paperId": "03f7f7ef1072e176e28feca71c5ea91f94103e8c", "title": "Fermatean Fuzzy Schweizer–Sklar Operators and BWM-Entropy-Based Combined Compromise Solution Approach: An Application to Green Supplier Selection"}, {"paperId": "9889f4ddb1d7f946121e2aab90658504ebb8ec2b", "title": "Decision-Making Models for solving Green Supplier Evaluation and Selection problems"}, {"paperId": "6378d325840e7c1329bb0a9ca69e245f2f3aa2ef", "title": "Selecting the Optimal Green Supplier and Order Allocation under Linear Discount"}, {"paperId": "391b7e1d639749130e25f11c1edb1f5aa397c024", "title": "An integrated decision-making approach for global supplier selection and order allocation to create an environment-friendly supply chain"}, {"paperId": "0ab75e9bed20fc3bfd8b9098ba4d8f00d93dadc2", "title": "Cumulative Sustainability Performance Index of Contractors and Consultants: Toward a Prequalification System"}, {"paperId": "ff7ceb40dd7c21980fdcefe288e85ab2c51832f7", "title": "A comprehensive framework and literature review of supplier selection under different purchasing strategies"}, {"paperId": "4fa3d047ce521a5fb9828d012a5cee7275c2d3ea", "title": "Strategic sourcing model for green supply chain management: an insight into automobile manufacturing units in India"}, {"paperId": "3e04e3f8d8f0ec061d04afbb4fe9f9b20076716d", "title": "Ranking based on optimal points and win-loss-draw multi-criteria decision-making with application to supplier evaluation problem"}, {"paperId": "7bf0d4b6d35e6663d7089bb0a00b0a919a259077", "title": "Sustainable supplier selection for SMEs based on an extended PROMETHEE Ⅱ approach"}, {"paperId": "ddbd766944b9069620494d48c873cc376876e503", "title": "EVALUATION OF LOGISTIC FLOWS IN GREEN SUPPLY CHAINS BASED ON THE COMBINED DEMATEL-ANP METHOD"}, {"paperId": "9eecba0d6864b91c5b8a6dfecb620ca31bb25319", "title": "Green Supply Chain Management in Greece: Practices and Attitudes in Environmental Assessment and Selection of Suppliers"}, {"paperId": "91b9daa7c6ee8c0c0f21d8d7af43227447b32595", "title": "A Two Phase Integrated Fuzzy Decision-Making Framework for Green Supplier Selection in the Coffee Bean Supply Chain"}, {"paperId": "483f3c470bc52738baa1c7d0fe38484e247aad26", "title": "Fuzzy Neural Network-Based Evaluation Algorithm for Ice and Snow Tourism Competitiveness"}, {"paperId": "210ca600b8f28d1ed84764386863d67c93276d0e", "title": "Visualizing Sustainable Supply Chain Management: A Systematic Scientometric Review"}, {"paperId": "b6bc5bad7f84c2cf26e1d7fd831e38dfcc2fe5f7", "title": "Hospital Location Selection: A Systematic Literature Review on Methodologies and Applications"}, {"paperId": "f9af37c5fb0389b79b9494cd3bc4163ae7318b0f", "title": "A New Decision-Making Approach Based on Fermatean Fuzzy Sets and WASPAS for Green Construction Supplier Evaluation"}, {"paperId": "bf818e2b7b7ea8439cd9b0c11c5f68fdf4c8ee88", "title": "GSSOA Using Double Hierarchy Hesitant Linguistic Sets and Decision Field Theory"}, {"paperId": "4201c21ae826b5bf21f53990e092ba9587a855c5", "title": "GSSOA Using Linguistic Z-Numbers and AQM"}, {"paperId": "9f2abef8db0ff94bec2994e4c84fb06b0193b642", "title": "GSES with Interval-Valued Intuitionistic Uncertain Linguistic AQM"}, {"paperId": "a0466bc9a0f181b5e2314cb5beb48b4a13927e76", "title": "GSES with Large Group Uncertain Linguistic MULTIMOORA Method"}, {"paperId": "28ff14ec736d20f11e12b7558e1337005c7e3408", "title": "GSES Using Interval 2-Tuple Linguistic VIKOR Method"}, {"paperId": "dd0389c3e684f64fc2c454fea308572ce95b263d", "title": "GSES with Heterogeneous Information and MABAC Method"}, {"paperId": "764337d3a5597fdf4d3518c1e776481d2c2b17ee", "title": "Green Supply Chain Management"}, {"paperId": "7e65df73b2ef29e23ef385fadc9b3be83e26efd5", "title": "Decision Models for Supplier Selection in Industry 4.0 Era: A Systematic Literature Review"}]}
