{"paperId": "5b373584bae1578497cd5f8fee48adb1f7683dd4", "publicationVenue": {"id": "78203021-0ba2-4f4f-a38d-23038f5d9c9a", "name": "ACM SIGMM Conference on Multimedia Systems", "type": "conference", "alternate_names": ["ACM SIGMM Conf Multimedia Syst", "MMSys"], "url": "https://dl.acm.org/doi/proceedings/10.1145/3339825"}, "title": "Towards cloud-edge collaborative online video analytics with fine-grained serverless pipelines", "abstract": "The ever-growing deployment scale of surveillance cameras and the users' increasing appetite for real-time queries have urged online video analytics. Synergizing the virtually unlimited cloud resources with agile edge processing would deliver an ideal online video analytics system; yet, given the complex interaction and dependency within and across video query pipelines, it is easier said than done. This paper starts with a measurement study to acquire a deep understanding of video query pipelines on real-world camera streams. We identify the potentials and practical challenges towards cloud-edge collaborative video analytics. We then argue that the newly emerged serverless computing paradigm is the key to achieve fine-grained resource partitioning with minimum dependency. We accordingly propose CEVAS, a Cloud-Edge collaborative Video Analytics system empowered by fine-grained Serverless pipelines. It builds flexible serverless-based infrastructures to facilitate fine-grained and adaptive partitioning of cloud-edge workloads for multiple concurrent query pipelines. With the optimized design of individual modules and their integration, CEVAS achieves real-time responses to highly dynamic input workloads. We have developed a prototype of CEVAS over Amazon Web Services (AWS) and conducted extensive experiments with real-world video streams and queries. The results show that by judiciously coordinating the fine-grained serverless resources in the cloud and at the edge, CEVAS reduces 86.9% cloud expenditure and 74.4% data transfer overhead of a pure cloud scheme and improves the analysis throughput of a pure edge scheme by up to 20.6%. Thanks to the fine-grained video content-aware forecasting, CEVAS is also more adaptive than the state-of-the-art cloud-edge collaborative scheme.", "venue": "ACM SIGMM Conference on Multimedia Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-07-15", "journal": {"name": "Proceedings of the 12th ACM Multimedia Systems Conference"}, "authors": [{"authorId": "2112175756", "name": "Miao Zhang"}, {"authorId": "144935272", "name": "Fangxin Wang"}, {"authorId": "46758486", "name": "Yifei Zhu"}, {"authorId": "1681457", "name": "Jiangchuan Liu"}, {"authorId": "2116791129", "name": "Zhi Wang"}], "citations": [{"paperId": "4e67da5c45fedebabbe2674446f9d44366360019", "title": "SplitStream: Distributed and workload-adaptive video analytics at the edge"}, {"paperId": "67c7700c25165ed826d4565b34e0312f38960083", "title": "QoS-aware Resource Optimization for Hierarchical Cross-Edge Video Analytics"}, {"paperId": "fe50689565cf879a020e41065e40e2b663e2afa5", "title": "Evaluating NiFi and MQTT based serverless data pipelines in fog computing environments"}, {"paperId": "eb0b54877ec937ae93e5dfb21f1c0d9dc170c81e", "title": "Utility-Aware Load Shedding for Real-time Video Analytics at the Edge"}, {"paperId": "9c196709ee1e628edee548afaa43822a365dff0b", "title": "Edge-Assisted Adaptive Configuration for Serverless-Based Video Analytics"}, {"paperId": "b6af2e3b142fbef48e0a84c77068232bcd595856", "title": "Darly: Deep Reinforcement Learning for QoS-aware scheduling under resource heterogeneity Optimizing serverless video analytics"}, {"paperId": "48028d71d0d808650ce437da8ea1faaf394ff87f", "title": "EAVS: Edge-assisted Adaptive Video Streaming with Fine-grained Serverless Pipelines"}, {"paperId": "287f54c5d71fecbea10f8e5a418c715425e4a1ff", "title": "Cross-Camera Inference on the Constrained Edge"}, {"paperId": "d83867a180716dfd995f0f7536cbc162f4ce9427", "title": "A Survey on Deep Neural Network Partition over Cloud, Edge and End Devices"}, {"paperId": "fb5868902796adc7f0a80aab6f08d31dd455ea99", "title": "Content-Aware Dynamic Resource Allocation Framework for Video Analytic Applications at Edge"}, {"paperId": "64ba47bd973f23df799adb95b44dacc99f16c506", "title": "Blockchain-based Collaborative Edge Intelligence for Trustworthy and Real-Time Video Surveillance"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "0fb6ea33656838fac812fe60569b1cce4636685a", "title": "Collaborative Video Analytics on Distributed Edges with Multiagent Deep Reinforcement Learning"}, {"paperId": "c4a582c2eed15773f1a5476b4458bf9902903a03", "title": "Dynamic DNN model selection and inference off loading for video analytics with edge-cloud collaboration"}, {"paperId": "aa8ee338ab9fa149c77afe39cf4ec4c7671e9d13", "title": "Serverless Empowered Video Analytics for Ubiquitous Networked Cameras"}, {"paperId": "7b07d2c0284f9c584900b37c8c2fb386a6a83d6b", "title": "SmartEye: An Open Source Framework for Real-Time Video Analytics with Edge-Cloud Collaboration"}, {"paperId": "e1eaf9c857e55a0d5bf3f19fea1969136d4853a7", "title": "IoT Serverless Computing at the Edge: A Systematic Mapping Review"}, {"paperId": "4cbae59d2d127fc3b80d962a85b0fd429b9f6a77", "title": "Edge Intelligence for Industrial IoT: Opportunities and Limitations"}, {"paperId": "6322985bb03f3fcc2982ec8d2eba4c93e38865f0", "title": "Distributed Artificial Intelligence Empowered by End-Edge-Cloud Computing: A Survey"}, {"paperId": "6fe337a78c779f3bebdcb2404bd0d8565e1ba5fa", "title": "Taming Serverless Cold Start of Cloud Model Inference with Edge Computing"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "7511e01b90fc243627c953751950c4a20d8dbd21", "title": "On Performance Tuning of Serverless IoT Applications"}]}
