{"paperId": "5b4d33cefe6cd953737c1edd740233c984e0e2bc", "publicationVenue": {"id": "58668f21-815a-4b30-af06-ced21bfb2fa6", "name": "Earth and Space Science", "type": "journal", "alternate_names": ["Earth Space Sci"], "issn": "2333-5084", "url": "http://agupubs.onlinelibrary.wiley.com/agu/journal/10.1002/(ISSN)2333-5084/", "alternate_urls": ["https://agupubs.onlinelibrary.wiley.com/journal/23335084"]}, "title": "A Big Data‐Driven Nonlinear Least Squares Four‐Dimensional Variational Data Assimilation Method: Theoretical Formulation and Conceptual Evaluation", "abstract": "A new nonlinear least squares four‐dimensional variational data assimilation method (NLS‐4DVar) is proposed incorporating the use of “big data.” This distinctive four‐dimensional ensemble‐variational data assimilation method (4DEnVar) is made up of two ensembles, a preprepared historical big data ensemble and a small “online” ensemble. The historical ensemble portrays both the ensemble‐constructed background error covariance and tangent models more accurately, as compared with the standard NLS‐4DVar method, with no heavy increase in computational cost in terms of real‐time operations. The online ensemble maintains the flow dependence of the ensemble‐estimated background error covariance. The ensemble analysis scheme proposed by merging the local ensemble transform Kalman filter scheme with a sophisticated sampling approach is able to adjust the ensemble spreads suitably and maintain them steadily. The updating scheme also largely guarantees the partial flow dependence of the historical ensemble. Experimental results using the shallow‐water equations demonstrate that the new big data method provides substantial performance improvement over the standard NLS‐4DVar method.", "venue": "Earth and Space Science", "year": 2019, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2019-08-01", "journal": {"name": "Earth and Space Science", "pages": "1430 - 1439", "volume": "6"}, "authors": [{"authorId": "38683723", "name": "X. Tian"}, {"authorId": "2014301719", "name": "Hongqin Zhang"}], "citations": [{"paperId": "5ae2942c374c4e02190738bbb796c4fb17b7e92f", "title": "Recent Advances in China on the Predictability of Weather and Climate"}, {"paperId": "dd32296f1d024dc448c6b5905cd2e44211ca1790", "title": "An operational improvement of A-4DEnVar and its application to the estimation of the spatially varying bottom friction coefficients of the M2 constituent in the Bohai and Yellow seas"}, {"paperId": "7cf35d0436f4a10f4006b4d49f184adeabb67b0f", "title": "Handling errors in four-dimensional variational data assimilation by balancing the degrees of freedom and the model constraints: A new approach"}, {"paperId": "97d5259173e94bb14daf7802b8a50da1d345d602", "title": "A Mini‐Batch Stochastic Optimization‐Based Adaptive Localization Scheme and Its Implementation in NLS‐i4DVar"}, {"paperId": "bec4a047ea4528b88a1e9a8673ab2b75e9a27e53", "title": "Improvement of PM2.5 forecast over China by the joint adjustment of initial conditions and emissions with the NLS-4DVar method"}, {"paperId": "8378381a542ac6e322b7e216b6f11471d794378d", "title": "i4DVar: An Integral Correcting Four‐Dimensional Variational Data Assimilation Method"}, {"paperId": "383a6b7b581840ff44e180e3ad550c647f7fc3fd", "title": "Evaluating the Forecast Impact of Assimilating ATOVS Radiance With the Regional System of Multigrid NLS‐4DVar Data Assimilation for Numerical Weather Prediction (SNAP)"}, {"paperId": "73e6ee0d04138e80828a7920bbc8ee304a286f1d", "title": "An Adjoint‐Free Alternating Direction Method for Four‐Dimensional Variational Data Assimilation With Multiple Parameter Tikhonov Regularization"}, {"paperId": "4ff5515c1bb9b9fcaa12358ecdcca83c1c434600", "title": "System of Multigrid Nonlinear Least-squares Four-dimensional Variational Data Assimilation for Numerical Weather Prediction (SNAP): System Formulation and Preliminary Evaluation"}, {"paperId": "7052379f9310837c70228057fe1eaf1fdcf7cb74", "title": "Implementation of a Modified Adaptive Covariance Inflation Scheme for the Big Data‐Driven NLS‐4DVar Algorithm"}]}
