{"paperId": "5b4fc4bd39b3094e9a692a5862c06e42cc7b2cf7", "publicationVenue": null, "title": "On modeling of responses generated by travel 2.0 implementation: fuzzy rule-based systems", "abstract": "Web 2.0 applications enable travelers to evaluate several services and assessment attributes. Constructed websites in several languages trigger a new way of data collections resulting in data streams leading to the accumulation of vast amounts of data, called big data. The need for analysis is in high demand. This study aims to construct a model to investigate which single attribute or interrelated ones having an impact on the performances of hotels.,The total number of 1,137 observations collected from the website HolidayCheck.de are used from the hotels in the Bavaria region in 2016. Bavaria is a region where both domestic and foreign travelers mostly prefer to visit. Fuzzy rule-based systems, which is a combination of fuzzy set theory (FST) and fuzzy logic, are used. Although the FST is used to convert linguistically expressed perceptions by travelers into mathematically usable data, fuzzy logic is used to construct a model between service attributes and price-performance (PP) to attain the set of single and interrelated attributes on the assessment of PP.,No single attribute plays a key role in PP assessment. However, two or more interrelated combinations have different impacts on PP. For example, when “Food—Drink” and “Room” moves together from average to good level, PP reaches the highest level of assessment.,Accessibility to too much data is difficult.,A model can be continuously run so that any changes can be observed during the incoming of data.,As the consumer reviews and ratings are the crucial source of information for other travelers, hoteliers must monitor and respond them on time in order to deal with the complaints.,Travelers’ perceptions or evaluations are treated with a FST that measures the impression of human beings. New modeling enables researchers to observe not only any single attribute but also interrelated ones on the PP.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-03-16", "journal": {"name": "International Journal of Contemporary Hospitality Management", "pages": "1503-1522", "volume": "32"}, "authors": [{"authorId": "47647989", "name": "M. A. Başaran"}, {"authorId": "2051567995", "name": "Seden Doğan"}, {"authorId": "152910945", "name": "Kemal Kantarcı"}], "citations": [{"paperId": "0c215970466e10f8279f74d997319e7ba407ccda", "title": "Rise of fsQCA in tourism and hospitality research: a systematic literature review"}, {"paperId": "332ac1ffb9f83a37d6b21965ba3192882a5390f9", "title": "A look back and a leap forward: a review and synthesis of big data and artificial intelligence literature in hospitality and tourism"}, {"paperId": "612b8bc2a9c795a1c435a1669733a170443f874e", "title": "Evaluating hotel websites through the use of fuzzy AHP and fuzzy TOPSIS"}, {"paperId": "a25a3aefd7feb70f3fae485246f53406a90aa2b0", "title": "Guest editorial"}, {"paperId": "c046340efd9a0b4d2fbe1aaa59ecb7a7110f33f8", "title": "Design and Implementation of Hotel Network Management Information System in the Era of Big Data"}]}
