{"paperId": "5b578705ad14fec8eaf2dc37a825994eb690f2c7", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "A web content mining application for detecting relevant pages using Jaccard similarity", "abstract": "The tremendous growth in the availability of enormous text data from a variety of sources creates a slew of concerns and obstacles to discovering meaningful information. This advancement of technology in the digital realm has resulted in the dispersion of texts over millions of web sites. Unstructured texts are densely packed with textual information. The discovery of valuable and intriguing relationships in unstructured texts demands more computer processing. So, text mining has developed into an attractive area of study for obtaining organized and useful data. One of the purposes of this research is to discuss text pre-processing of automobile marketing domains in order to create a structured database. Regular expressions were used to extract data from unstructured vehicle advertisements, resulting in a well-organized database. We manually develop unique rule-based ways of extracting structured data from unstructured web pages. As a result of the information retrieved from these advertisements, a systematic search for certain noteworthy qualities is performed. There are numerous approaches for query recommendation, and it is vital to understand which one should be employed. Additionally, this research attempts to determine the optimal value similarity for query suggestions based on user-supplied parameters by comparing MySQL pattern matching and Jaccard similarity.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "48241908", "name": "A. A. Jalal"}, {"authorId": "2070365413", "name": "Abdulrahman Ahmed Jasim"}, {"authorId": "73209231", "name": "A. Mahawish"}], "citations": [{"paperId": "8e02d13ef468751c2730a2e7c109c2bd070235f8", "title": "Automated Rule-Based Data Cleaning Using NLP"}, {"paperId": "41c17d11ad5c95c1f4ee047c61aa3c3cde506197", "title": "A Catalogue of Machine Learning Algorithms for Healthcare Risk Predictions"}]}
