{"paperId": "5b5cc9cf815eb7e6de2a27c5adda06dd68097988", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "Take it to the limit: peak prediction-driven resource overcommitment in datacenters", "abstract": "To increase utilization, datacenter schedulers often overcommit resources where the sum of resources allocated to the tasks on a machine exceeds its physical capacity. Setting the right level of overcommitment is a challenging problem: low overcommitment leads to wasted resources, while high overcommitment leads to task performance degradation. In this paper, we take a first principles approach to designing and evaluating overcommit policies by asking a basic question: assuming complete knowledge of each task's future resource usage, what is the safest overcommit policy that yields the highest utilization? We call this policy the peak oracle. We then devise practical overcommit policies that mimic this peak oracle by predicting future machine resource usage. We simulate our overcommit policies using the recently-released Google cluster trace, and show that they result in higher utilization and less overcommit errors than policies based on per-task allocations. We also deploy these policies to machines inside Google's datacenters serving its internal production workload. We show that our overcommit policies increase these machines' usable CPU capacity by 10-16% compared to no overcommitment.", "venue": "European Conference on Computer Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-04-21", "journal": {"name": "Proceedings of the Sixteenth European Conference on Computer Systems"}, "authors": [{"authorId": "2872746", "name": "Noman Bashir"}, {"authorId": "2105758030", "name": "Nan Deng"}, {"authorId": "1780581", "name": "K. Rządca"}, {"authorId": "145633019", "name": "David E. Irwin"}, {"authorId": "2080044440", "name": "Sree Kodak"}, {"authorId": "2738611", "name": "Rohit Jnagal"}], "citations": [{"paperId": "dd37714491c3b778f1cbe83dda2c88ca4b9b0104", "title": "vPALs: Towards Verified Performance-aware Learning System For Resource Management"}, {"paperId": "2931cdd9081088cccfee98d7d5f8ff705d339d94", "title": "HCoop: A Cooperative and Hybrid Resource Scheduling for Heterogeneous Jobs in Clouds"}, {"paperId": "9102700bb8c2d060b6750f3049b45325dae9bd94", "title": "Hotspot resolution in cloud computing: A Γ-robust knapsack approach for virtual machine migration"}, {"paperId": "13a1155bae846e72ba6e2c7d6c2e8b167a762372", "title": "Is Machine Learning Necessary for Cloud Resource Usage Forecasting?"}, {"paperId": "10b591db5c6ccb770da45cc81d5ba6baa81189ce", "title": "Not All Resources are Visible: Exploiting Fragmented Shadow Resources in Shared-State Scheduler Architecture"}, {"paperId": "532c679b727fe7113d5d3e08428a3865ff3a524c", "title": "Golgi: Performance-Aware, Resource-Efficient Function Scheduling for Serverless Computing"}, {"paperId": "71ea127e53bcfb85de6bc47708d325297680b04c", "title": "Heap Size Adjustment with CPU Control"}, {"paperId": "b61d746d33c902e1f9208336d17df9c96c5b6410", "title": "CloudFactory: An Open Toolkit to Generate Production-like Workloads for Cloud Infrastructures"}, {"paperId": "1c9b3c42efe010e890469584653595f301c1546e", "title": "WattScope: Non-intrusive Application-level Power Disaggregation in Datacenters"}, {"paperId": "38b6aee621a20b5b99f4140ac0d217db4333dd95", "title": "A Poisson-Based Approximation Algorithm for Stochastic Bin Packing of Bernoulli Items"}, {"paperId": "4f6d130948d275d97e4f23a7c3967b0cbfc1061d", "title": "An efficient container bin-packing method for large scale cloud-native clusters"}, {"paperId": "7579d1e6761e3f350deba60b36d268cd2ab174e6", "title": "FastAiAlloc: A real-time multi-resources allocation framework proposal based on predictive model and multiple optimization strategies"}, {"paperId": "8c38d84c1875d0552ff76a4ea5e0460624bbd26f", "title": "On the Limitations of Carbon-Aware Temporal and Spatial Workload Shifting in the Cloud"}, {"paperId": "351ada7dda6f8f6c4e2045b89fb3503467e1f1e9", "title": "Toward Pattern-based Model Selection for Cloud Resource Forecasting"}, {"paperId": "14cad8da091eb57f4efa0bf859c7c80c0534d07b", "title": "Understanding and Optimizing Workloads for Unified Resource Management in Large Cloud Platforms"}, {"paperId": "fbe0340bc6d9dd43f6970a1b3a009e0c19d720ad", "title": "CarbonScaler: Leveraging Cloud Workload Elasticity for Optimizing Carbon-Efficiency"}, {"paperId": "86aa9a40d8c01eb1b556b8bd7ae917f37889bb47", "title": "Detection of Service Provider Hardware Over-commitment in Container Orchestration Environments"}, {"paperId": "aa02859e433c4ab01fba1405b0a90e19dea9bf7e", "title": "Owl: performance-aware scheduling for resource-efficient function-as-a-service cloud"}, {"paperId": "ad7c00029954aca73e4d243c616b99100a12994b", "title": "Workload consolidation in alibaba clusters: the good, the bad, and the ugly"}, {"paperId": "c0bbe09ca40c790da8411da8871b9f18cb97ca5f", "title": "Near-Optimal Stochastic Bin-Packing in Large Service Systems with Time-Varying Item Sizes"}, {"paperId": "1ce857e078dada249cc420fa756fc307f49a2323", "title": "Call Scheduling to Reduce Response Time of a FaaS System"}, {"paperId": "8a9baa19478fe4804aa97f5363fa6b074e416b6a", "title": "Solving the Batch Stochastic Bin Packing Problem in Cloud: A Chance-constrained Optimization Approach"}, {"paperId": "940d956a6858eabaaf346962f383cdc2746b89fc", "title": "A Learning-based Approach Towards Automated Tuning of SSD Configurations"}, {"paperId": "772fe0184a69bc837cde74daab42748c2f3c280e", "title": "S CROOGE VM : B OOSTING C LOUD R ESOURCE U TILIZATION WITH G REEDY O VERSUBSCRIPTION"}, {"paperId": "4d8db397d38e913adc100c062634c782ee0d5ec2", "title": "RETROSPECTIVE: Ensemble-level Power Management for Dense Blade Servers"}, {"paperId": "4524cd7cb7d086c16eedc8c99dd97ede09312767", "title": "Maximizing Utilization under Time-Varying Resource Requirements"}]}
