{"paperId": "5b6069aacf586b51364218ca76dd7b764088eb17", "publicationVenue": null, "title": "An Efficient Graph-Based Spatio-Temporal Indexing Method for Task-Oriented Multi-Modal Scene Data Organization", "abstract": "Task-oriented scene data in big data and cloud environments of a smart city that must be time-critically processed are dynamic and associated with increasing complexities and heterogeneities. Existing hybrid tree-based external indexing methods are input/output (I/O)-intensive, query schema-fixed, and difficult when representing the complex relationships of real-time multi-modal scene data; specifically, queries are limited to a certain spatio-temporal range or a small number of selected attributes. This paper proposes a new spatio-temporal indexing method for task-oriented multi-modal scene data organization. First, a hybrid spatio-temporal index architecture is proposed based on the analysis of the characteristics of scene data and the driving forces behind the scene tasks. Second, a graph-based spatio-temporal relation indexing approach, named the spatio-temporal relation graph (STR-graph), is constructed for this architecture. The global graph-based index, internal and external operation mechanisms, and optimization strategy of the STR-graph index are introduced in detail. Finally, index efficiency comparison experiments are conducted, and the results show that the STR-graph performs excellently in index generation and can efficiently address the diverse requirements of different visualization tasks for data scheduling; specifically, the STR-graph is more efficient when addressing complex and uncertain spatio-temporal relation queries.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-08", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "371", "volume": "7"}, "authors": [{"authorId": "2056749859", "name": "Bin Feng"}, {"authorId": "2152204027", "name": "Qing Zhu"}, {"authorId": "2112220479", "name": "Mingwei Liu"}, {"authorId": "2117014548", "name": "Yun Li"}, {"authorId": "2108072823", "name": "Junxiao Zhang"}, {"authorId": "2119031394", "name": "Xiao Fu"}, {"authorId": "2150920727", "name": "Yan Zhou"}, {"authorId": "1678385", "name": "Maosu Li"}, {"authorId": "21032254", "name": "Huagui He"}, {"authorId": "2116897373", "name": "Weijun Yang"}], "citations": [{"paperId": "eba0ffeffa6821eeaaafaf9359e0c00454d5be96", "title": "A fast two-level grid index algorithm for common edge extraction in vector data compression"}, {"paperId": "ca095026ed158be6727205069ff394a3e75ce6fc", "title": "Integrated data-model-knowledge representation for natural resource entities"}, {"paperId": "7b33e3b17fe36b5c90f33f0d59539d5beb184379", "title": "A Multiresolution Vector Data Compression Algorithm Based on Space Division"}, {"paperId": "cb8e48b648d5086f8ede10285e54b63c6efe550e", "title": "Optimized Spatiotemporal Data Scheduling Based on Maximum Flow for Multilevel Visualization Tasks"}, {"paperId": "21a2cce5038424042a66df6091bd717a7c3832a3", "title": "DAPR-tree: a distributed spatial data indexing scheme with data access patterns to support Digital Earth initiatives"}, {"paperId": "0a53857069ba0b6808df1405441914acc05d291c", "title": "An Graph-Based Adaptive Method for Fast Detection of Transformed Data Leakage in IOT Via WSN"}, {"paperId": "44ad5b332ba3214cd5b51dbe8f9d95a38c9b7dbf", "title": "Techniques for Big Data Analytics: a Systematic Survey"}]}
