{"paperId": "5b61348e696a872a453e5c64901514350f07d14a", "publicationVenue": {"id": "c48a4ead-5245-4573-85f4-a81b45bb39fd", "name": "IEEE Military Communications Conference", "type": "conference", "alternate_names": ["MILCOM", "Mil Commun Conf", "IEEE Mil Commun Conf", "Military Communications Conference"], "url": "http://www.milcom.org/"}, "title": "Integrating Cybersecurity Into a Big Data Ecosystem", "abstract": "This paper provides an overview of the security service controls that are applied in a big data processing (BDP) system to defend against cyber security attacks. We validate this approach by modeling attacks and effectiveness of security service controls in a sequence of states and transitions. This Finite State Machine (FSM) approach uses the probable effectiveness of security service controls, as defined in the National Institute of Standards and Technology (NIST) Risk Management Framework (RMF). The attacks used in the model are defined in the ATT&CK™ framework. Five different BDP security architecture configurations are considered, spanning from a low-cost default BDP configuration to a more expensive, industry supported layered security architecture. The analysis demonstrates the importance of a multi-layer approach to implementing security in BDP systems. With increasing interest in using BDP systems to analyze sensitive data sets, it is important to understand and justify BDP security architecture configurations with their significant costs. The output of the model demonstrates that over the run time, larger investment in security service controls results in significantly more uptime. There is a significant increase in uptime with a linear increase in security service control investment. We believe that these results support our recommended BDP security architecture. That is, a layered architecture with security service controls integrated into the user interface, boundary, central management of security policies, and applications that incorporate privacy preserving programs. These results enable making BDP systems operational for sensitive data accessed in a multi-tenant environment.", "venue": "IEEE Military Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2021-11-29", "journal": {"name": "MILCOM 2021 - 2021 IEEE Military Communications Conference (MILCOM)", "pages": "69-76"}, "authors": [{"authorId": "31283503", "name": "Anne M. Tall"}, {"authorId": "1705877", "name": "C. Zou"}, {"authorId": "2152811776", "name": "Jun Wang"}], "citations": []}
