{"paperId": "5b6580085e1fe3c315b6eedb542cb7f183ff31ea", "publicationVenue": null, "title": "A Set of Integral Grid-Coding Algebraic Operations Based on GeoSOT-3D", "abstract": "As the amount of collected spatial information (2D/3D) increases, the real-time processing of these massive data is among the urgent issues that need to be dealt with. Discretizing the physical earth into a digital gridded earth and assigning an integral computable code to each grid has become an effective way to accelerate real-time processing. Researchers have proposed optimization algorithms for spatial calculations in specific scenarios. However, a complete set of algorithms for real-time processing using grid coding is still lacking. To address this issue, a carefully designed, integral grid-coding algebraic operation framework for GeoSOT-3D (a multilayer latitude and longitude grid model) is proposed. By converting traditional floating-point calculations based on latitude and longitude into binary operations, the complexity of the algorithm is greatly reduced. We then present the detailed algorithms that were designed, including basic operations, vector operations, code conversion operations, spatial operations, metric operations, topological relation operations, and set operations. To verify the feasibility and efficiency of the above algorithms, we developed an experimental platform using C++ language (including major algorithms, and more algorithms may be expanded in the future). Then, we generated random data and conducted experiments. The experimental results show that the computing framework is feasible and can significantly improve the efficiency of spatial processing. The algebraic operation framework is expected to support large geospatial data retrieval and analysis, and experience a revival, on top of parallel and distributed computing, in an era of large geospatial data.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "489", "volume": "10"}, "authors": [{"authorId": "96261220", "name": "Kaihua Hou"}, {"authorId": "3069386", "name": "Chengqi Cheng"}, {"authorId": "2152687518", "name": "Bo Chen"}, {"authorId": "2115812836", "name": "Chi Zhang"}, {"authorId": "2148919610", "name": "Liesong He"}, {"authorId": "2113610586", "name": "Li Meng"}, {"authorId": "2133436222", "name": "Shuang Li"}], "citations": [{"paperId": "c5bcb6a63a49bc5ea116d6d7f6ee977aadae591f", "title": "AugGKG: a grid-augmented geographic knowledge graph representation and spatio-temporal query model"}, {"paperId": "8834cb92c9cd376f07b1b4bfcd1d7c3eb4b2a4c4", "title": "The Innovation of GIS Service Mode Based on “Grid Integration” and “Elastic Cloud”"}, {"paperId": "6946c2d6eb60e39dab3570b0739ee7b8a34b0fea", "title": "A Multi-Level Grid Database for Protecting and Sharing Historical Geographic Urban Data: A Case Study of Shanghai"}, {"paperId": "ad0cac8e29dd629c38d6c4002add67cdb2f44abd", "title": "Concurrent multi-task pre-processing method for LEO mega-constellation based on dynamic spatio-temporal grids"}, {"paperId": "cfe1c9413606a3fee5fc3fb474563deeabf4c591", "title": "A Method for Managing ADS-B Data Based on a 4D Airspace-Temporal Grid (GeoSOT-AS)"}, {"paperId": "753127a324f1ddf6dcdf0ecd6db14f9d0efd19d2", "title": "Clustering Method of Large-Scale Battlefield Airspace Based on Multi A * in Airspace Grid System"}, {"paperId": "19a88180926db7467bf46b2ae366056565228e89", "title": "Grid-optimized UAV indoor path planning algorithms in a complex environment"}, {"paperId": "acfd0b5c404984b9bc3aa2d5669caff44f1710e7", "title": "A Review of the Research on Discrete Global Grid Systems in Digital Earth"}, {"paperId": "92306d09bf73525744ef30bd93465657bf79f499", "title": "Spatial Grid-Based Position Calculation Method for Satellite-Ground Communication Links"}, {"paperId": "cc5b3041e967c6d12ea0c7e59d7812e07c833ca9", "title": "Robot Path Planning Method Based on Indoor Spacetime Grid Model"}]}
