{"paperId": "5b6593982e5d50c9fa57a72d9bbb760baaaedb9a", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Develop a dynamic DBSCAN algorithm for solving initial parameter selection problem of the DBSCAN algorithm", "abstract": "The amount of data has been increasing exponentially in every sector such as banking securities, healthcare, education, manufacturing, consumer-trade, transportation, and energy. Most of these data are noise, different in shapes, and outliers. In such cases, it is challenging to find the desired data clusters using conventional clustering algorithms. DBSCAN is a popular clustering algorithm which is widely used for noisy, arbitrary shape, and outlier data. However, its performance highly depends on the proper selection of cluster radius (Eps) and the minimum number of points (MinPts) that are required for forming clusters for the given dataset. In the case of real-world clustering problems, it is a difficult task to select the exact value of Eps and (MinPts) to perform the clustering on unknown datasets. To address these, this paper proposes a dynamic DBSCAN algorithm that calculates the suitable value for (Eps) and (MinPts) dynamically by which the clustering quality of the given problem will be increased. This paper evaluates the performance of the dynamic DBSCAN algorithm over seven challenging datasets. The experimental results confirm the effectiveness of the dynamic DBSCAN algorithm over the well-known clustering algorithms.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2110865218", "name": "Md. Zakir Hossain"}, {"authorId": "2110072764", "name": "Md. Jakirul Islam"}, {"authorId": "3079201", "name": "Md. Waliur Rahman Miah"}, {"authorId": "2128880227", "name": "Jahid Hasan Rony"}, {"authorId": "2066294777", "name": "Momotaz Begum"}], "citations": [{"paperId": "df96ac8adba0dfef87bd1dc09cf89b52a1135363", "title": "3D Road Boundary Extraction Based on Machine Learning Strategy Using LiDAR and Image-Derived MMS Point Clouds"}, {"paperId": "e34fb91f618745c73bab21671894aeae81a95e5d", "title": "IAES International Journal of Artificial Intelligence (IJ-AI)"}]}
