{"paperId": "5b6e8289a04596b8a6af8ca57f4a68902bf35159", "publicationVenue": {"id": "9bc219ae-a4dc-4241-8e1a-0552f9ee9ef7", "name": "International Symposium on Circuits and Systems", "type": "conference", "alternate_names": ["ISCAS", "Int Symp Circuit Syst"]}, "title": "Multi-scale 3D-CNN for Alzheimer's Disease Classification", "abstract": "The diffusion tensor imaging (DTI) based Alzheimer's disease (AD) classification consists of the region of interest-based methods, voxel-based methods, and fiber tracer map-based methods. However, most of the studies utilize partial information of the DTI data. It is difficult to discover most discriminative biomarkers. To address this problem, this paper proposes a novel AD classification method based on 3D convolutional neural networks (3D-CNN) with multi-scale information fusion in order to uncover the differential features of AD. First, the significant voxels of anisotropy score and mean dispersion rate for each individual are extracted using Tract-Based Spatial Statistics (TBSS) method from the skeleton. Second, the texture and intensity features are extracted by utilizing radiomics method. Third, an improved 3D convolutional neural network is proposed to extract depth features from the fractional anisotropy (FA) and mean diffusivity (MD) images. Finally, the multi-scale features are linearly fused and select with LASSO algorithm. The support vector machine is utilized for five-fold cross-validation. The experimental results on the ADNI dataset with 185 DTI images containing AD and normal controls (NC) subjects show that the proposed method achieves better classification performance compared with existing methods for the AD assist diagnosis task.", "venue": "International Symposium on Circuits and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-21", "journal": {"name": "2023 IEEE International Symposium on Circuits and Systems (ISCAS)", "pages": "1-5"}, "authors": [{"authorId": "2224462891", "name": "Hang Yan"}, {"authorId": "2186470696", "name": "Kunlun Fang"}, {"authorId": "2106595750", "name": "H. Shang"}, {"authorId": "2224131629", "name": "Hongjia Liu"}, {"authorId": "51299154", "name": "Jiande Sun"}, {"authorId": "48738146", "name": "Jianping Qiao"}], "citations": []}
