{"paperId": "5b6f5d6faa7409ed74850228ccfc09f443dd3603", "publicationVenue": {"id": "3f3e37a9-ccb2-4ff4-8905-554776f62075", "name": "Imaging Science Journal", "type": "journal", "alternate_names": ["The Imaging Science Journal", "Imaging Sci J"], "issn": "1368-2199", "url": "http://www.tandfonline.com/toc/yims20/current", "alternate_urls": ["http://www.maney.co.uk/index.php/journals/ims/"]}, "title": "Hybrid deep learning algorithm for brain tumour detection", "abstract": "ABSTRACT Image processing fields, such as separating data from healthcare images, can benefit greatly from using deep learning algorithms. This can be extremely beneficial. For the treatment of someone with a brain tumour, discovering the tumour as soon as possible is critical. The patient's life expectancy would increase if the tumour was discovered sooner rather than later. Medical images typically lack contrast because of noise or because there aren't enough diffusive boundaries in the image. This is because of noise. In order to better understand tumours in medical image segmentation, MRI was used to diagnose the tumour, but it also played a beneficial role in clinical image analysis. Why did an MRI need to be done? This paper will examine how bad a brain tumour is using the hybrid deep learning algorithm, which is what this paper is about. Algorithms help us get the correct answer. Based on the direction of the images taken by MR, there will be a lot of information about how to divide up the pictures. In this way, three separate networks are trained to improve their segmentation results.", "venue": "Imaging Science Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-18", "journal": {"name": "The Imaging Science Journal", "pages": "345 - 357", "volume": "70"}, "authors": [{"authorId": "2065505959", "name": "Jyoti Srivastava"}, {"authorId": "2053450039", "name": "J. Prakash"}, {"authorId": "2149057804", "name": "Ashish Srivastava"}], "citations": []}
