{"paperId": "5b8038a61598bad9198e25f7e84cf6bccad152bd", "publicationVenue": null, "title": "Reliability Analysis of Intelligent Electric Energy Meter under Fusion Model Illness Analysis Algorithm", "abstract": "This work is aimed at solving the morbidity problem of the smart meter fusion model and improve the measurement accuracy and reliability of the smart meter. Starting with the topology of the smart meter, the reason for the serious morbidity of the smart meter model is discussed. First, the basic process of power system state estimation of smart meters is introduced, and the concept of error analysis of smart meters is clarified. Then, the causes and mechanisms of the ill-conditioned problems of the smart meter model are analyzed, and methods to reduce the morbidity of the smart meter calculation model are analyzed. Finally, a data optimization algorithm based on a greedy strategy and an improved Tikhonov regularization method is proposed. The model data is processed and optimized to reduce the morbidity of the smart meter measurement model. The results show that the analysis algorithm for reducing the morbidity error of the smart meter proposed in this study can effectively interfere with the morbidity of the smart meter calculation model. The processing effect shows that it can reduce the measurement error of the smart meter to about 5%, which is an order of magnitude lower than the error before processing, and the processing effect of the least square method is improved by more than 70%. From the perspective of processing speed, when the user number is between 50 and 100, the running time of the algorithm ranges between 1.5 and 3.5 s, which can be fully adapted to the actual situation and has strong practicability. In short, this study is helpful in improving the accuracy and reliability of smart meter calculations and provides a certain reference for related research.", "venue": "J. Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-13", "journal": {"name": "J. Sensors", "pages": "1-10", "volume": "2021"}, "authors": [{"authorId": "26891235", "name": "W. Xie"}, {"authorId": "1471743485", "name": "Leping Zhang"}, {"authorId": "2107926730", "name": "Bensong Zhang"}, {"authorId": "2155468671", "name": "Wei Zhang"}, {"authorId": "2152210956", "name": "Pingping Wang"}, {"authorId": "2090410987", "name": "Shuya Qiao"}], "citations": [{"paperId": "fc719bc079b5447b00e96cafa51ad8352ff51e04", "title": "Reliability Assessment Method for Smart Energy Meters in High Dry Heat Environments"}]}
