{"paperId": "5b8188d8167fe01408828df4aa969c48454cfe63", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Hybrid Self-Supervised Learning Framework for Vertical Federated Learning", "abstract": "Vertical federated learning (VFL), a variant of Federated Learning (FL), has recently drawn increasing attention as the VFL matches the enterprises' demands of leveraging more valuable features to achieve better model performance. However, conventional VFL methods may run into data deficiency as they exploit only aligned and labeled samples (belonging to different parties), leaving often the majority of unaligned and unlabeled samples unused. The data deficiency hampers the effort of the federation. In this work, we propose a Federated Hybrid Self-Supervised Learning framework, named FedHSSL, that utilizes cross-party views (i.e., dispersed features) of samples aligned among parties and local views (i.e., augmentation) of unaligned samples within each party to improve the representation learning capability of the VFL joint model. FedHSSL further exploits invariant features across parties to boost the performance of the joint model through partial model aggregation. FedHSSL, as a framework, can work with various representative SSL methods. We empirically demonstrate that FedHSSL methods outperform baselines by large margins. We provide an in-depth analysis of FedHSSL regarding label leakage, which is rarely investigated in existing self-supervised VFL works. The experimental results show that, with proper protection, FedHSSL achieves the best privacy-utility trade-off against the state-of-the-art label inference attack compared with baselines. Code is available at \\url{https://github.com/jorghyq2016/FedHSSL}.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-18", "journal": {"name": "ArXiv", "volume": "abs/2208.08934"}, "authors": [{"authorId": "2145050945", "name": "Yuanqin He"}, {"authorId": "1505828520", "name": "Yan Kang"}, {"authorId": "2119195051", "name": "Jiahuan Luo"}, {"authorId": "2087083369", "name": "Lixin Fan"}, {"authorId": "2166949653", "name": "Qiang Yang"}], "citations": [{"paperId": "8a34f65df7a75af0aee6ee64395ded2b8eba8e22", "title": "Metadata and Image Features Co-Aware Semi-Supervised Vertical Federated Learning With Attention Mechanism"}, {"paperId": "3915c7433cbd1df21e16a320b52da6feaa6a1b80", "title": "Federated Learning for Computer Vision"}, {"paperId": "60a68540b62b46afabb592fa8e2d575897d73fdf", "title": "VertiBench: Advancing Feature Distribution Diversity in Vertical Federated Learning Benchmarks"}, {"paperId": "81a2185501641ac0e9d1a42623ace287e2e09860", "title": "FedAds: A Benchmark for Privacy-Preserving CVR Estimation with Vertical Federated Learning"}, {"paperId": "b720dc316737256f71b2e2de35bb8836e79cf2e7", "title": "TANGOS: Regularizing Tabular Neural Networks through Gradient Orthogonalization and Specialization"}, {"paperId": "aaea45f651ee017cefefd58966e5f6350c136bd9", "title": "FedPass: Privacy-Preserving Vertical Federated Deep Learning with Adaptive Obfuscation"}, {"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "e467ad57b7872a48b5210af756f5260dad8a5ab4", "title": "A Survey on Heterogeneous Federated Learning"}]}
