{"paperId": "5b8f5a218ceecf164886135741a7416553dce7e2", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Morphling: Fast, Near-Optimal Auto-Configuration for Cloud-Native Model Serving", "abstract": "Machine learning models are widely deployed in production cloud to provide online inference services. Efficiently deploying inference services requires careful tuning of hardware and runtime configurations (e.g., GPU type, GPU memory, batch size), which can significantly improve the model serving performance and reduce cost. However, existing autoconfiguration approaches for general workloads, such as Bayesian optimization and white-box prediction, are inefficient in navigating the high-dimensional configuration space of model serving, incurring high sampling cost. In this paper, we present Morphling, a fast, near-optimal auto-configuration framework for cloud-native model serving. Morphling employs model-agnostic meta-learning to navigate the large configuration space. It trains a metamodel offline to capture the general performance trend under varying configurations. Morphling quickly adapts the metamodel to a new inference service by sampling a small number of configurations and uses it to find the optimal one. We have implemented Morphling as an auto-configuration service in Kubernetes, and evaluate its performance with popular CV and NLP models, as well as the production inference services in Alibaba. Compared with existing approaches, Morphling reduces the median search cost by 3x-22x, quickly converging to the optimal configuration by sampling only 30 candidates in a large search space consisting of 720 options.", "venue": "ACM Symposium on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-11-01", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "2153517307", "name": "Luping Wang"}, {"authorId": "2146415615", "name": "Lingyun Yang"}, {"authorId": "101206716", "name": "Yinghao Yu"}, {"authorId": "47825073", "name": "Wen Wang"}, {"authorId": null, "name": "Bo Li"}, {"authorId": "2143570103", "name": "Xianchao Sun"}, {"authorId": "2153098113", "name": "Jian He"}, {"authorId": "2117808384", "name": "Liping Zhang"}], "citations": [{"paperId": "a21359673263d1de11f593fe396651554433c030", "title": "Deep Configuration Performance Learning: A Systematic Survey and Taxonomy"}, {"paperId": "fcab3fe1adc7bb67eb080956e7c92cad421aa3b0", "title": "Integrating Bayesian Optimization and Machine Learning for the Optimal Configuration of Cloud Systems"}, {"paperId": "06fe0fe4f74551e734290cbfa1ee0a250a460013", "title": "On Serving Image Classification Models"}, {"paperId": "b61fafdeaee3694693b982fa79e2042cce7f09c5", "title": "IPA: Inference Pipeline Adaptation to Achieve High Accuracy and Cost-Efficiency"}, {"paperId": "f10cc66ecc90a9d6dd2d8704e0faa941fbb6348d", "title": "Symphony: Optimized DNN Model Serving using Deferred Batch Scheduling"}, {"paperId": "dda9e433ac572636b57d05c1a1bf529fb4df2973", "title": "FaST-GShare: Enabling Efficient Spatio-Temporal GPU Sharing in Serverless Computing for Deep Learning Inference"}, {"paperId": "99013a040ce39e838bdaafd7ec9fd3fdd1765819", "title": "BIRP: Batch-aware Inference Workload Redistribution and Parallel Scheme for Edge Collaboration"}, {"paperId": "8173a162ba8f79e80af354458aa8a4eadc570528", "title": "Chrion: Optimizing Recurrent Neural Network Inference by Collaboratively Utilizing CPUs and GPUs"}, {"paperId": "a023de0ae831e7b8bad5c60f8332c7bb35d39795", "title": "xCloudServing: Automated ML Serving Across Clouds"}, {"paperId": "dc50eeab0e4d04a968f596555f71e943b9f11fec", "title": "IRIS: Interference and Resource Aware Predictive Orchestration for ML Inference Serving"}, {"paperId": "9202e149fd448821838c083c10048d3014bee089", "title": "Opportunities of Renewable Energy Powered DNN Inference"}, {"paperId": "4c9f8390d1db1ad97cd92160f9c523c2a0233868", "title": "CAMEO: A Causal Transfer Learning Approach for Performance Optimization of Configurable Computer Systems"}, {"paperId": "19fa9e33a2a2b5e46c97c3f21771a3885b897771", "title": "Reconciling High Accuracy, Cost-Efficiency, and Low Latency of Inference Serving Systems"}, {"paperId": "e2db3df1716ef26b58cd1f8d9e803045c6b8eef8", "title": "Cougar: A General Framework for Jobs Optimization In Cloud"}, {"paperId": "abfc1905234674ffa10a3c92bb8765172c458b40", "title": "Serving unseen deep learning models with near-optimal configurations: a fast adaptive search approach"}, {"paperId": "d54ebb7b83e81013dc75e12b31fd9e29e587cf4c", "title": "iGniter: Interference-Aware GPU Resource Provisioning for Predictable DNN Inference in the Cloud"}, {"paperId": "a2694d1f56f53bf92dccb4f678a445639373385e", "title": "Kairos: Building Cost-Efficient Machine Learning Inference Systems with Heterogeneous Cloud Resources"}, {"paperId": "e1f4a9c4ef104844cb1d1509eff472dba1204391", "title": "MALIBOO: When Machine Learning meets Bayesian Optimization"}, {"paperId": "745093391442971373d2af7549b00651a4636808", "title": "Deep Learning Workload Scheduling in GPU Datacenters: Taxonomy, Challenges and Vision"}, {"paperId": "0ed175d0e4eaa7c488b7ce9f0317416682d18d3a", "title": "Tuning of Elasticsearch Configuration: Parameter Optimization Through Simultaneous Perturbation Stochastic Approximation"}, {"paperId": "db4db925d41dbf4cdd4284337a7b0160db32f1f7", "title": "Scanflow-K8s: Agent-based Framework for Autonomic Management and Supervision of ML Workflows in Kubernetes Clusters"}, {"paperId": "c1cb768265cd05841f1b2ed705ae891114de285c", "title": "Differentiate Quality of Experience Scheduling for Deep Learning Inferences With Docker Containers in the Cloud"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "77fc7be5a0cdc0141462a9cc00451e73329a13d7", "title": "Building Heterogeneous Cloud System for Machine Learning Inference"}, {"paperId": "de036947d8cfc1b6164d55b2470fd8020f086c4c", "title": "Serving Heterogeneous Machine Learning Models on Multi-GPU Servers with Spatio-Temporal Sharing"}]}
