{"paperId": "5b91a3c0ed7a272b0afb555d4f9b631bcd917cf6", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Different Scales of Medical Data Classification Based on Machine Learning Techniques: A Comparative Study", "abstract": "In recent years, medical data have vastly increased due to the continuous generation of digital data. The different forms of medical data, such as reports, textual, numerical, monitoring, and laboratory data generate the so-called medical big data. This paper aims to find the best algorithm which predicts new medical data with high accuracy, since good prediction accuracy is essential in medical fields. To achieve the study’s goal, the best accuracy algorithm and least processing time algorithm are defined through an experiment and comparison of seven different algorithms, including Naïve bayes, linear model, regression, decision tree, random forest, gradient boosted tree, and J48. The conducted experiments have allowed the prediction of new medical big data that reach the algorithm with the best accuracy and processing time. Here, we find that the best accuracy classification algorithm is the random forest with accuracy values of 97.58%, 83.59%, and 90% for heart disease, M-health, and diabetes datasets, respectively. The Naïve bayes has the lowest processing time with values of 0.078, 7.683, and 22.374 s for heart disease, M-health, and diabetes datasets, respectively. In addition, the best result of the experiment is obtained by the combination of the CFS feature selection algorithm with the Random Forest classification algorithm. The results of applying RF with the combination of CFS on the heart disease dataset are as follows: Accuracy of 90%, precision of 83.3%, sensitivity of 100, and consuming time of 3 s. Moreover, the results of applying this combination on the M-health dataset are as follows: Accuracy of 83.59%, precision of 74.3%, sensitivity of 93.1, and consuming time of 13.481 s. Furthermore, the results on the diabetes dataset are as follows: Accuracy of 97.58%, precision of 86.39%, sensitivity of 97.14, and consuming time of 56.508 s.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-17", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2150407298", "name": "Heba Aly Elzeheiry"}, {"authorId": "24320133", "name": "S. Barakat"}, {"authorId": "22649965", "name": "A. Rezk"}], "citations": [{"paperId": "d282638d5f17487d13051bf7f5626cea65f66bdc", "title": "Predictive modeling for breast cancer based on machine learning algorithms and features selection methods"}, {"paperId": "eb2fd2ac3afe4cd9db7f603b6cf4fa78658e2728", "title": "Forecasting Survival Rates in Metastatic Colorectal Cancer Patients Undergoing Bevacizumab-Based Chemotherapy: A Machine Learning Approach"}, {"paperId": "f74b21621658d1d6333ebb73f4494d2d62a39ae0", "title": "Exploring Important Factors in Predicting Heart Disease Based on Ensemble- Extra Feature Selection Approach"}, {"paperId": "068bc34f7e2d6d31a87483ba5113dd138956f70a", "title": "Predictive Analytic Healthcare Sector Using Classification Machine Learning Algorithm"}, {"paperId": "8655b30164293b6fd57af95ff91f89b17f14041e", "title": "Combinatorial Optimization Design of Search Tree Model Based on Hash Storage"}]}
