{"paperId": "5bc5f8da2c2ea167c3841cb570077a17a2ba4c7b", "publicationVenue": {"id": "fcb86ed6-f18e-4059-9779-7acc73d8b8ab", "name": "The Physics of Fluids", "type": "journal", "alternate_names": ["Physics of Fluids", "Phys Fluid"], "issn": "0031-9171", "alternate_issns": ["1070-6631"], "url": "https://aip.scitation.org/journal/phf", "alternate_urls": ["http://pof.aip.org/"]}, "title": "Prediction of pressure fields on cavitation hydrofoil based on improved compressed sensing technology", "abstract": "In the face of mounting economic constraints, researchers are increasingly turning to data-driven methods for reconstructing unknown global fields from limited data. While traditional compressed sensing (CS) technology addresses this challenge, the least absolute shrinkage and selection operator algorithm within CS encounters difficulties in precisely solving basis coefficients. This challenge is exacerbated by the frequently unknown observation matrix, often necessitating optimization methods for resolution. This study introduces the CS-FNN (CS-Fully Connected Neural Network) method, leveraging neural network technology to refine CS-obtained basis coefficients. This approach proves particularly advantageous in scenarios involving custom observation points. Focused on hydrofoil pressure fields, our comparative analysis with CS-PSO (CS-Particle Swarm Optimization) covers the reconstruction accuracy, the performance in varied unsteady situations, and robustness concerning the number of truncated proper orthogonal decomposition modes, measuring point distribution, and real noise environments. Results demonstrate the superiority of CS-FNN over CS-PSO in predicting global hydrofoil pressure fields, with higher reconstruction accuracy, a more flexible arrangement of measuring points, and a balance between robustness and accuracy that meets the requirements of practical engineering. This innovative method introduces a new and effective approach for recovering high-dimensional data, presenting significant potential for practical engineering applications.", "venue": "The Physics of Fluids", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Physics of Fluids"}, "authors": [{"authorId": "9723733", "name": "Yangyang Sha"}, {"authorId": "2258292199", "name": "Yuhang Xu"}, {"authorId": "2202889263", "name": "Yingjie Wei"}, {"authorId": "2142658915", "name": "Cong Wang"}], "citations": []}
