{"paperId": "5bc7394012d1d14720f0e62fbe6b009e6442fee2", "publicationVenue": null, "title": "Skin Disease Diagnosis Using VGG19 Algorithm and Treatment Recommendation System", "abstract": "Skin infections are highly common today. A small circular or haphazardly shaped spot on the patient’s skin might be detected because of skin illness. When this condition develops into skin cancer, it can sometimes be quite hazardous. By querying an open-source dataset for skin diseases, this project searches for signs of probable skin abrasion or infection using neural networks or machine learning algorithms. Based on the model’s accuracy, it delivers the closest match to the patient’s condition. Including the finest treatments available that can aid in treating the detected disease with a tailored dataset, we will use CNN transfer learning, either VGG19 or different Resnet approaches, for our project. 23 classes, but we are seeking to meet at least 12+ classes. Accuracy of 90% above on train and 85% above on validation. The Project identifies for potential skin abrasion or an infection using Neural Network or Machine Learning Algorithms, based on the accuracy of the model it provides closest match to possible condition of the patient by querying open-source skin disease dataset. Also providing the best possible remedies which can help in curing the identified disease. A person’s quality of life may be significantly impacted by skin conditions. They can cause physical pain, emotional distress, and social isolation. They can also lead to financial burden, as many skin diseases require expensive treatment. In severe cases, skin diseases can be life-threatening. The skin diseases application is a great resource for anyone with a skin condition. It provides information on different skin diseases, as well as treatment options and tips for managing your condition.", "venue": "2023 IEEE 8th International Conference for Convergence in Technology (I2CT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-07", "journal": {"name": "2023 IEEE 8th International Conference for Convergence in Technology (I2CT)", "pages": "1-8"}, "authors": [{"authorId": "2287339665", "name": "Geetha Rani"}, {"authorId": "2045065639", "name": "Mayank Shandilya"}, {"authorId": "2287734883", "name": "Mohammed Afeef Hussain"}, {"authorId": "2287630295", "name": "Preethi Susan"}, {"authorId": "2287696414", "name": "Varughese"}, {"authorId": "2287684177", "name": "Mohammed Azeezulla"}], "citations": [{"paperId": "7083b06d79f5d62dffcb40d6eaa113872d3048e5", "title": "A collaborative filtering method by fusion of facial information features"}]}
