{"paperId": "5bca74c46e61b057cd9d17f73d2bcd0faf110391", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "Multi-resource fair allocation for consolidated flash-based caching systems", "abstract": "Using a flash-based layer to serve the caching and buffering needs of multiple workloads has become a common practice. In such settings, resource demands will inevitably exceed available capacity sometimes. \"Fair\" resource allocation may offer a systematic way of partitioning resources across competing workloads during such periods of scarcity. Existing works only offer fair allocation strategies for a single resource (capacity or bandwidth) within a flash device in isolation. However, since there exist multiple critical resources that need to be partitioned within a flash device and they are correlated to each other, fair allocation of a single resource may result in a waste of other resource(s) or performance degradation of workload(s). To this end, we make a case for multi-resource fair allocation solutions for flash-based caches that consolidate multiple workloads. Furthermore, we argue that device lifetime, which depends on the behavior of running workloads, should also be considered as a first-class resource on par with capacity and bandwidth. Specifically, we build upon existing ideas related to dominant resource fairness (DRF) to devise flash-specific multi-resource fair algorithms: (i) nDRF, that jointly allocates capacity and bandwidth taking their non-linear relationship into account; (ii) ℓDRF, that explicitly considers lifetime as well in its allocation; and (iii) several variants of these. Our experimental evaluation offers important findings: (i) both nDRF and ℓDRF result in superior performance fairness compared to the state-of-the-art techniques that partition capacity in isolation; (ii) ℓDRF additionally offers improved device \"wear\" behavior; and (iii) our algorithms combined with reasonable demand prediction work very well in online settings with workload dynamism and uncertainty.", "venue": "International Middleware Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the 23rd ACM/IFIP International Middleware Conference"}, "authors": [{"authorId": "2505238", "name": "Wonil Choi"}, {"authorId": "1684443", "name": "B. Urgaonkar"}, {"authorId": "145879376", "name": "M. Kandemir"}, {"authorId": "1809899", "name": "G. Kesidis"}], "citations": [{"paperId": "99867ddb1918178b18546b496d3601054a163d51", "title": "A Multi-tenant Key-value SSD with Secondary Index for Search Query Processing and Analysis"}, {"paperId": "d3f09426f440f4971b2acc9181e51e04319532c8", "title": "Sketching the Path to Efficiency: Lightweight Learned Cache Replacement"}]}
