{"paperId": "5bd3ed0713b1cfebd0a82988c8009b92543fc1ac", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Discovering and Interpreting Conceptual Biases in Online Communities", "abstract": "Language carries implicit human biases, functioning both as a reflection and a perpetuation of stereotypes that people carry with them. Recently, ML-based NLP methods such as word embeddings have been shown to learn such language biases with striking accuracy. This capability of word embeddings has been successfully exploited as a tool to quantify and study human biases. However, previous studies only consider a predefined set of conceptual biases to attest (e.g., whether gender is more or less associated with particular jobs), or just discover biased words without helping to understand their meaning at the conceptual level. As such, these approaches are either unable to find conceptual biases that have not been defined in advance, or the biases they find are difficult to interpret and study. This makes existing approaches unsuitable to discover and interpret biases in online communities, as such communities may carry different biases than those in mainstream culture. This paper proposes a general, data-driven approach to automatically discover and help interpret conceptual biases encoded in word embeddings. We apply this approach to study the conceptual biases present in the language used in online communities and experimentally show the validity and stability of our method.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-27", "journal": {"name": "ArXiv", "volume": "abs/2010.14448"}, "authors": [{"authorId": "75157891", "name": "Xavier Ferrer Aran"}, {"authorId": "51999443", "name": "T. Nuenen"}, {"authorId": "1799571", "name": "N. Criado"}, {"authorId": "144622087", "name": "J. Such"}], "citations": [{"paperId": "43b184a9912ecb6de0454892c68c82200f77f234", "title": "Discovering and Categorising Language Biases in Reddit"}]}
