{"paperId": "5bdbadc741ce13762b7c914c1514124404c46211", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "An Augmented Artificial Intelligence Approach for Chronic Diseases Prediction", "abstract": "Chronic diseases are increasing in prevalence and mortality worldwide. Early diagnosis has therefore become an important research area to enhance patient survival rates. Several research studies have reported classification approaches for specific disease prediction. In this paper, we propose a novel augmented artificial intelligence approach using an artificial neural network (ANN) with particle swarm optimization (PSO) to predict five prevalent chronic diseases including breast cancer, diabetes, heart attack, hepatitis, and kidney disease. Seven classification algorithms are compared to evaluate the proposed model's prediction performance. The ANN prediction model constructed with a PSO based feature extraction approach outperforms other state-of-the-art classification approaches when evaluated with accuracy. Our proposed approach gave the highest accuracy of 99.67%, with the PSO. However, the classification model's performance is found to depend on the attributes of data used for classification. Our results are compared with various chronic disease datasets and shown to outperform other benchmark approaches. In addition, our optimized ANN processing is shown to require less time compared to random forest (RF), deep learning and support vector machine (SVM) based methods. Our study could play a role for early diagnosis of chronic diseases in hospitals, including through development of online diagnosis systems.", "venue": "Frontiers in Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-31", "journal": {"name": "Frontiers in Public Health", "volume": "10"}, "authors": [{"authorId": "2158396126", "name": "Junaid Rashid"}, {"authorId": "2125961975", "name": "Saba Batool"}, {"authorId": "2125035110", "name": "Jungeun Kim"}, {"authorId": "2124855216", "name": "Muhammad Wasif Nisar"}, {"authorId": "2151459513", "name": "Amir Hussain"}, {"authorId": null, "name": "Sapna Juneja"}, {"authorId": "40621542", "name": "Riti Kushwaha"}], "citations": [{"paperId": "f9e6bd24614494d4f3eff38a12f05497c1def744", "title": "From Algorithms to Outcomes: Reviewing AI's Role in Non-Muscle-Invasive Bladder Cancer Recurrence Prediction"}, {"paperId": "a9071b3382e3a3a92bee26ac76caf0b993737431", "title": "Artificial Intelligence for Clinical Prediction: Exploring Key Domains and Essential Functions"}, {"paperId": "ae76553fceb16381a28fec00389a5c18b8171dd1", "title": "Critical review of self-diagnosis of mental health conditions using artificial intelligence."}, {"paperId": "b7186fcae9eebecbdc786c9699173bb371aed1fd", "title": "An ensemble learning-based machine learning with voting mechanism for chronic disease prediction"}, {"paperId": "378ec73d051644a69e7f971cdc641de7786bd7be", "title": "Can adverse childhood experiences predict chronic health conditions? Development of trauma-informed, explainable machine learning models"}, {"paperId": "fa953a23c8307c7bfe8550be43f03cda0085bf96", "title": "Hybrid Approach for Heart Disease Detection using Classification Algorithms"}, {"paperId": "26fe7348e5c51d980e0444a1694de32a95e3b0a6", "title": "Application of Diagnostic Test Methods To The Classification Of Time Series With Discrete Values"}, {"paperId": "1ce1c7cd2e823019bbf658a6f1f0d947cbe5b22e", "title": "Ensemble model for predicting chronic non-communicable diseases using Latin square extraction and fuzzy-artificial neural networks from 2013 to 2019"}, {"paperId": "4c4fa026f158acc1bdc99815f2dc85e608a4a9c3", "title": "Employment status, presence of chronic disease and daily screen time are determinants of healthy diet literacy"}, {"paperId": "73dadf58ee66fcd01c44e5f20b624270acc35d6e", "title": "A risk assessment and prediction framework for diabetes mellitus using machine learning algorithms"}, {"paperId": "b8d2f12c015f1251fca1fe7ad319b66016483313", "title": "Predictive Power of Machine Learning in Chronic Disease: A Comprehensive Review and Meta-Analysis"}, {"paperId": "9ba0872335503235e44259e985a918e8ec2883cf", "title": "A Prediction Framework for Lifestyle-Related Disease Prediction Using Healthcare Data"}, {"paperId": "d2690edd07d82207efbf44089be12fae4ee221c9", "title": "AI-Based Diagnostic Test Prediction- An Effective Way to Handle the New Normal Era in Healthcare"}, {"paperId": "18dd4a2b22e0de2358c9412738b4a7be42566e91", "title": "A Review on the Use of Machine Learning Techniques in Monkeypox Disease Prediction"}, {"paperId": "3b8fe4b91e9ef693017301163762e637276eee37", "title": "A Depression Recognition Method Based on the Alteration of Video Temporal Angle Features"}, {"paperId": "63450fbdc7e79895e4b92b88b1304e9718c61fcc", "title": "A Comprehensive Analysis of Artificial Intelligence Techniques for the Prediction and Prognosis of Lifestyle Diseases"}, {"paperId": "2d4b3c5c52ad74b1b9a90a6988e0c6955b4b1269", "title": "Trends in Passive IoT Biomarker Monitoring and Machine Learning for Cardiovascular Disease Management in the U.S. Elderly Population"}, {"paperId": "fa9b2b486db653613cfc0a9618bfeb1782f9fefd", "title": "Character Recognition Technique Implementation for Complicated Deteriorated Scene"}, {"paperId": "dca2daea5f29daaa1983bd71b0acf526a66e116b", "title": "Environment Quality Assessment Web Application"}, {"paperId": "8cdd92ae8ba1e2ad277a3d1e08581d84dd3642de", "title": "Explicability of Artificial Intelligence in Healthcare 5.0"}, {"paperId": "c037ed4522210aa37fda97292cb8e1a86a0f3338", "title": "An Artificial Intelligence-Based Stacked Ensemble Approach for Prediction of Protein Subcellular Localization in Confocal Microscopy Images"}, {"paperId": "1f68a5a33cb6d5abf971d1f54759dc251a557b50", "title": "Chronic Disease Prediction using Data Mining and Machine Learning Algorithm"}, {"paperId": "4384f872497154b3377876ae23199292824ed66c", "title": "A robust deep learning approach for tomato plant leaf disease localization and classification"}, {"paperId": "55a014234c1b8d08d44a3f2195867f026445387a", "title": "Transfer learning-based modified inception model for the diagnosis of Alzheimer's disease"}, {"paperId": "9869dfdd1f07e153eb4d37e4fd6123796b00db0d", "title": "Gene signature of m6A RNA regulators in diagnosis, prognosis, treatment, and immune microenvironment for cervical cancer"}, {"paperId": "959bb3ff2c10e6dc31dcb3cd975d90650a29a030", "title": "Segmentation and Classification of Encephalon Tumor by Applying Improved Fast and Robust FCM Algorithm with PSO-Based ELM Technique"}, {"paperId": "8049a6f0a91222d00aef099153905062e95bebd4", "title": "A Fog-Cluster Based Load-Balancing Technique"}, {"paperId": "142bc790b59c1d5cf7a7597b2223b945ae1dc65b", "title": "CNN Based Multiclass Brain Tumor Detection Using Medical Imaging"}, {"paperId": "c44cd44c7535d67c6c9695977431e8c9593b9246", "title": "Optimized CNN-Based Recognition of District Names of Punjab State in Gurmukhi Script"}, {"paperId": "c3cfd43241e1f7d1a94ae50a8763ade2ed6843bb", "title": "Towards Autonomous Healthcare: Integrating Artificial Intelligence (AI) for Personalized Medicine and Disease Prediction"}]}
