{"paperId": "5bdef3206eeda1dbf11f72fe9dfde759fbe5928b", "publicationVenue": null, "title": "Multi-UAVs cooperative task assignment and path planning scheme", "abstract": "The task assignment and path planning problems of multiple unmanned aerial vehicles (multi-UAVs) cooperative assistance roadside units (RSUs) for data collection are optimization problems with the goal of minimizing time and energy consumption. This paper proposes a hierarchical optimization scheme for multi-UAVs collaborative assistance RSUs data collection. This solution solves the problems that the number of UAVs needs to be set in advance, the convergence speed is slow when the number of tasks increases, and it is easy to fall into a local optimal solution, and the convergence accuracy is poor. First, the solution uses the K-means algorithm to allocate tasks and group RSUs to find the right number of UAVs to perform the task. Then, this paper proposes a hybrid optimization algorithm based on bionic learning for path planning. Finally, we set up a reasonable evaluation mechanism and conducted simulation experiments. The algorithm in this paper is compared with genetic algorithm, gray wolf algorithm and whale algorithm, the results show that the total cost of the task obtained by the proposed algorithm is the lowest, the algorithm stability is better, and the convergence accuracy is the highest.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2021-04-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1856"}, "authors": [{"authorId": "2114712437", "name": "Xiaoyu Du"}, {"authorId": "2106569731", "name": "Qicheng Guo"}, {"authorId": "2155494876", "name": "Hui Li"}, {"authorId": "2124819890", "name": "Yanyu Zhang"}], "citations": [{"paperId": "c36f8aaab14ac2a67ce4f994da65475b8e510e52", "title": "Seismic Performance of Prefabricated Reinforced Concrete Structure Beam Joints Based on the Internet of Things"}, {"paperId": "c9fd241ae6b459689ac701a62b112fdedb64672d", "title": "A Novel Multi-Robot Task Assignment Scheme Based on a Multi-Angle K-Means Clustering Algorithm and a Two-Stage Load-Balancing Strategy"}, {"paperId": "948c6e99672932e9a6b7141132759c51b0f258f1", "title": "UAV route planning based on improved whale optimization algorithm and dynamic artificial potential field method"}, {"paperId": "6b99b3bbe347a2a26cacbf96cdce51f7521ea066", "title": "Research on a new improved UAV anti-jamming and optimization model"}, {"paperId": "7aca00d9a97c6b9f471d2386da2ff1d1f206825a", "title": "Task assignment algorithms for unmanned aerial vehicle networks: A comprehensive survey"}]}
