{"paperId": "5be45c53fbee486daed779c4d8a632f398f1883b", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Turbine: Facebook’s Service Management Platform for Stream Processing", "abstract": "The demand for stream processing at Facebook has grown as services increasingly rely on real-time signals to speed up decisions and actions. Emerging real-time applications require strict Service Level Objectives (SLOs) with low downtime and processing lag—even in the presence of failures and load variability. Addressing this challenge at Facebook scale led to the development of Turbine, a management platform designed to bridge the gap between the capabilities of the existing general-purpose cluster management frameworks and Facebook’s stream processing requirements. Specifically, Turbine features a fast and scalable task scheduler; an efficient predictive auto scaler; and an application update mechanism that provides fault-tolerance, atomicity, consistency, isolation and durability.Turbine has been in production for over three years, and one of the core technologies that enabled a booming growth of stream processing at Facebook. It is currently deployed on clusters spanning tens of thousands of machines, managing several thousands of streaming pipelines processing terabytes of data per second in real time. Our production experience has validated Turbine’s effectiveness: its task scheduler evenly balances workload fluctuation across clusters; its auto scaler effectively and predictively handles unplanned load spikes; and the application update mechanism consistently and efficiently completes high scale updates within minutes. This paper describes the Turbine architecture, discusses the design choices behind it, and shares several case studies demonstrating Turbine capabilities in production.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1591-1602"}, "authors": [{"authorId": "1720863595", "name": "Yuan Mei"}, {"authorId": "40227618", "name": "Luwei Cheng"}, {"authorId": "2644598", "name": "V. Talwar"}, {"authorId": "3267297", "name": "Michael Y. Levin"}, {"authorId": "1404554880", "name": "Gabriela Jacques-Silva"}, {"authorId": "1490935318", "name": "N. Simha"}, {"authorId": "1720841211", "name": "Anirban Banerjee"}, {"authorId": "2111295077", "name": "Brian Smith"}, {"authorId": "1720859344", "name": "Tim Williamson"}, {"authorId": "2067850282", "name": "Serhat Yilmaz"}, {"authorId": "1723503503", "name": "Weitao Chen"}, {"authorId": "1720743567", "name": "Guoqiang Jerry Chen"}], "citations": [{"paperId": "5fcfdd3f3ab766ce53d5f51212c7db0f0ef3a4df", "title": "Practical Storage-Compute Elasticity for Stream Data Processing"}, {"paperId": "13a1155bae846e72ba6e2c7d6c2e8b167a762372", "title": "Is Machine Learning Necessary for Cloud Resource Usage Forecasting?"}, {"paperId": "d52ba3b8b67bb05a9fdb1def113a8d7a75546b10", "title": "ContTune: Continuous Tuning by Conservative Bayesian Optimization for Distributed Stream Data Processing Systems"}, {"paperId": "a972dcab2e971dcef243552b0194df9f06ff4329", "title": "Container Scheduling in Co-Located Environments Using QoE Awareness"}, {"paperId": "47e0737ac0adc6e2dccd8b02f906bdf25c227f4e", "title": "QAAS: quick accurate auto-scaling for streaming processing"}, {"paperId": "b4a7c65ae255ffd2acc44c38fa1f3b6d85b12bc9", "title": "StreamOps: Cloud-Native Runtime Management for Streaming Services in ByteDance"}, {"paperId": "d0f789d8327c54b6b8c5c9fd566206b68d5ac42a", "title": "Storm-RTS: Stream Processing with Stable Performance for Multi-Cloud and Cloud-edge"}, {"paperId": "f4b1c42e55a84ed565fce6cfb6712d334dcb38ed", "title": "Presto: A Decade of SQL Analytics at Meta"}, {"paperId": "6e6044684ba7a26eb913177953e71de312374eb7", "title": "Hierarchical Auto-scaling Policies for Data Stream Processing on Heterogeneous Resources"}, {"paperId": "cf885e2cdee198db0b3ec1071fb80b4fcf5cbd30", "title": "A dynamic balanced quadtree for real-time streaming data"}, {"paperId": "e01555982b4eb59c7a81f1359bf14d6a258d3627", "title": "Micro-batch and data frequency for stream processing on multi-cores"}, {"paperId": "87d727e3bde6f821e6fecc8f973d9474f9fd5694", "title": "Cost-Efficient and Latency-Aware Event Consuming in Workload-Skewed Distributed Event Queues"}, {"paperId": "cbabc9267d0d0bb9ca81006624b2cf3bcc2496fa", "title": "Meta's Next-generation Realtime Monitoring and Analytics Platform"}, {"paperId": "6da60666a242a52b07d4ce7c005dd459d5aef458", "title": "The non-expert tax: quantifying the cost of auto-scaling in cloud-based data stream analytics"}, {"paperId": "51c818da1ffef3e703ab1f5143c9b9ddfd820412", "title": "RobustScaler: QoS-Aware Autoscaling for Complex Workloads"}, {"paperId": "915cff5c3f1f1b10a71a91afd2acfc61faeac3d4", "title": "A new benchmark harness for systematic and robust evaluation of streaming state stores"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "93a8ebf88d1c346c3276d604994e794aa7ab25d1", "title": "Shard Manager: A Generic Shard Management Framework for Geo-distributed Applications"}, {"paperId": "93399eb3eefca171db3d055e7d4b650a96e6592a", "title": "Klink: Progress-Aware Scheduling for Streaming Data Systems"}, {"paperId": "8688bf167289c5ad416925e104739b89e0f7d1f3", "title": "Consistency and Completeness: Rethinking Distributed Stream Processing in Apache Kafka"}, {"paperId": "efab307ded8a26b27380388c2a1b1d75ebed322c", "title": "QoE-Aware Container Scheduler for Co-located Cloud Environments"}, {"paperId": "817e46631d0199d02b77ccb92e312407ab8f85ae", "title": "Protean: VM Allocation Service at Scale"}, {"paperId": "21da1ee785c91c832f68a9f18e4d7eda41c1cbd6", "title": "A Survey on the Evolution of Stream Processing Systems"}, {"paperId": "7786a9111f38f4255c1aaf1c1a69a3fae037c55f", "title": "A Cloud Native Platform for Stateful Streaming"}, {"paperId": "fde5bc70cbee7b7cffca2448c81aa6238a424971", "title": "Leveraging Watermarks to Improve Performance of Streaming Systems"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}, {"paperId": "953540c50b72db246d42c4e582028fd9531b0a58", "title": "RobustPeriod: Robust Time-Frequency Mining for Multiple Periodicity Detection"}, {"paperId": "9d9d8a58129d7146bc01a4afbeec49207f7cdd02", "title": "Lifting the veil on Meta's microservice architecture: Analyses of topology and request workflows"}, {"paperId": "6392f57e771f32015f575283edb20383ed59b9fa", "title": "Advanced Communication Model with the Voice Control and the Increased Security Level (short paper)"}, {"paperId": "6ffde59d4ea63081578dd9c92abd719158435bbd", "title": "Tolerating Slowdowns in Replicated State Machines using Copilots: Pseudocode and Proof of Correctness"}, {"paperId": "6dfaf71f67938c2f6ff9fbd49ad6257bc7115d90", "title": "Auto-sizing for Stream Processing Applications at LinkedIn"}, {"paperId": "27bf97df0e5bdb37d2b6eedc662915c1a39fc9b3", "title": "Tolerating Slowdowns in Replicated State Machines using Copilots"}, {"paperId": "efc14ebc195d14d626a7a672191ce616e6df9a59", "title": "Twine: A Unified Cluster Management System for Shared Infrastructure"}, {"paperId": "1d034e37460b1fa8ff4e901d794f514892bbb56f", "title": "This paper is included in the Proceedings of the 14th USENIX Symposium on Operating Systems Design and Implementation"}]}
