{"paperId": "5bef956f3216680f8fd0550671caa6de982fc395", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Fault Detection Algorithm Based on Dynamic Global–Local Preserving Projection", "abstract": "Industrial system operations usually have dynamic characteristics. If these characteristics are ignored, the performance of fault detection degrades. Herein, the fault-detection algorithm of dynamic global–local preserving projection (DGLPP) is employed to solve the problem mentioned. First, time-delay data are added to the sample to form an augmentation matrix and characterize the system dynamics. Second, the dimensionality of the augmented matrix is reduced using global–local preserving projection. The dimensionality-reduction method can preserve the data’s global and local structures. Then, a DGLPP model is built using the dimensionality-reduced data. Moreover, Hotelling’s T2 and squared prediction error (SPE) statistics are used for fault detection. Finally, this method is used to detect the fault in the Tennessee Eastman (TE) process. The experimental results show that the DGLPP method has an enhanced fault detection rate. Moreover, the fault-detection effects of the DGLPP method are better than those of the principal component analysis (PCA), local preserving projection (LPP), and global–local preserving projection (GLPP) methods.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-12", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2269030894", "name": "Wenbiao Wang"}, {"authorId": "2269123248", "name": "Qianqian Zhang"}, {"authorId": "2274339759", "name": "Kai Zheng"}], "citations": []}
