{"paperId": "5c01f2383aec43dd489c5e34a562376792ca3fb5", "publicationVenue": null, "title": "Blended learning in high school chemistry to enhance students’ metacognitive skills and attitudes towards chemistry: A need analysis", "abstract": "Digital technology in the 21st century is considered as a powerful tool to support innovation in learning systems. Blended learning is a model that adopts digital technology in the learning process, and if supported by technology-based teaching materials, it will be very efficient and effective. This study aims to investigate the needs of blended learning in high school chemistry to enhance students’ metacognitive skills and attitudes towards chemistry. Particularly, the purposes of this study are described as follows: (1) to investigate students’ attitudes towards chemistry on High School; (2) to analyse students’ digital knowledge and experience; (3) to analyse the needs of students and teachers on High School Chemistry for the blended learning module with Thermochemistry-based Learning Management System (LMS); (4) to analyse the quality of instruments by Rasch Model. Ninety eleventh grade students and nine teachers from three high schools in Surakarta, Indonesia participated in this study. The research instrument was prepared based on the research indicators. Data collection technique used a survey and an interview. The data were analyzed through qualitative and quantitative methods. The qualitative analysis focused on the teacher’s questionnaire and interview, while quantitative analysis was the students’ questionnaire using the Rasch model. The study obtained the following conclusions: (1) Indonesian high school students’ attitudes towards chemistry were still relatively low (2) High school knowledge and experience of digital technology in learning was high, (3) The need for LMS-based blended learning module to improve students’ attitude towards chemistry and metacognition skills was very high; (4) By variable map, the research instrument test met the Rasch model requirements so that it was feasible to use.Digital technology in the 21st century is considered as a powerful tool to support innovation in learning systems. Blended learning is a model that adopts digital technology in the learning process, and if supported by technology-based teaching materials, it will be very efficient and effective. This study aims to investigate the needs of blended learning in high school chemistry to enhance students’ metacognitive skills and attitudes towards chemistry. Particularly, the purposes of this study are described as follows: (1) to investigate students’ attitudes towards chemistry on High School; (2) to analyse students’ digital knowledge and experience; (3) to analyse the needs of students and teachers on High School Chemistry for the blended learning module with Thermochemistry-based Learning Management System (LMS); (4) to analyse the quality of instruments by Rasch Model. Ninety eleventh grade students and nine teachers from three high schools in Surakarta, Indonesia participated in this study. The research...", "venue": "THE 2ND INTERNATIONAL CONFERENCE ON SCIENCE, MATHEMATICS, ENVIRONMENT, AND EDUCATION", "year": 2019, "fieldsOfStudy": ["Psychology"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-12-18", "journal": {"name": "THE 2ND INTERNATIONAL CONFERENCE ON SCIENCE, MATHEMATICS, ENVIRONMENT, AND EDUCATION"}, "authors": [{"authorId": "1581585287", "name": "Kartyka Nababan"}, {"authorId": "73024631", "name": "B. Hastuti"}, {"authorId": "71277635", "name": "N. Y. Indriyanti"}], "citations": [{"paperId": "5c57f6923a99d7de80891f8c29da825719e63202", "title": "Analisis Kesulitan Belajar Kimia Siswa SMA Pasca Pendemi Menggunakan RACSH MODEL"}, {"paperId": "5e25ccf928a5d3100305ba4bb8c649e26afeb61b", "title": "Tiktok As an Alternative Learning Media for the Z Generation: Phenomenology Research"}, {"paperId": "ae892de7b2737353e52a23fe8316ef079f85ea42", "title": "Development of E-Module Based on Geospatial Technology to Improve TPACK Competencies of Geography Pre-Service Teacher: A Needs Analysis Review"}, {"paperId": "69fe5abeb3b497038aeb8ac9896f46e837818ed6", "title": "Types of Resources for Blended Learning Approach to Study High School Chemistry"}, {"paperId": "492998c9d26ea0f10d72f19ef06b216b02062009", "title": "High School Students’ Experience Using Learning Management System on Chemistry In Age of Pandemic"}]}
