{"paperId": "5c06306d0ffd2634a7cf7c0ddd0e0cbfcedec2ee", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Knowledge Management for Injection Molding Defects by a Knowledge Graph", "abstract": "Injection molding is a technique with a high knowledge content. However, most of the injection molding knowledge is stored in books, and it is difficult for personnel to clarify the influence of the different factors. This study applies the concept of a knowledge graph by using three types of nodes and edges to express the complex injection molding knowledge in the related literature, and also combines SBERT and search engine building to retrieve the graph. The search engine can follow different search logics, according to the types of nodes, then find the knowledge related to the node, classify it according to the search path, and visualize the search results to the user. Users can clarify the relationship between various process factors and product qualities in a different way. We also use multiple tests to show the actual search results and verify the performance of the search engine. The results show that the search engine can quickly and correctly find the relevant knowledge in the graph, and maintain its performance when the graph is expanded. At the same time, users can clarify the impact of various process factors on the product quality, according to the search results.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2192181019", "name": "Zhe-Wei Zhou"}, {"authorId": "144257460", "name": "Yung Ting"}, {"authorId": "39760041", "name": "W. Jong"}, {"authorId": "2065899020", "name": "Ming-Chien Chiu"}], "citations": [{"paperId": "363712423042f142bd546fa5cccb4c919e449361", "title": "PREDICTING TECHNOLOGY CONVERGENCE BETWEEN KNOWLEDGE MANAGEMENT AND ARTIFICIAL INTELLIGENCE FIELDS"}, {"paperId": "fb2a7eefb59d1d9033abe8559d74a6eeb6437d21", "title": "Retrieval of Injection Molding Industrial Knowledge Graph Based on Transformer and BERT"}, {"paperId": "368cd9f7a0741bdf17dde48a02aa301a3e5a7fcd", "title": "Development and Application of Knowledge Graphs for the Injection Molding Process"}]}
