{"paperId": "5c0bdf94f6651358fe3109c7a927d638cdd5f032", "publicationVenue": {"id": "cf0acd84-4d12-4c6e-ab59-1a4b01718988", "name": "International Journal of Online and Biomedical Engineering (iJOE)", "type": "journal", "alternate_names": ["Int J Online Biomed Eng (ijoe"], "issn": "2626-8493", "url": "http://i-joe.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-joe/"]}, "title": "Sensitive Data Exposure: Data Forwarding and Storage on Cloud Environment", "abstract": "Sensitive data has become an essential part of life today. With the increase in sensitive data, the importance of maintaining its confidentiality and integrity has increased. One of the solutions became to store this data in the cloud. But the risk of revealing this data still exists. This is because the rate of attack, leakage and loss of this data has become a serious matter. The importance of sensitive data in our current era is considered our oil, as it is very important in several uses in statistical analyzes and other important matters that help the authorities to know the type of people and their interests, and when publishing this information it is important to know what information should be available and What information should not appear or be used on the sites. In this paper, discuss this issue, which is one of the most important security issues that is sensitive data exposure. We touched on this research and the techniques used to reduce these risks to the data stored in the cloud. Mention the types of sensitive data and the types of attacks that may affect these data, and mention the points of weakness, and then the methods of protecting this data.", "venue": "International Journal of Online and Biomedical Engineering (iJOE)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-14", "journal": {"name": "International Journal of Online and Biomedical Engineering (iJOE)"}, "authors": [{"authorId": "2072101099", "name": "Shahad Alotaibi"}, {"authorId": "2142039702", "name": "Khadijah Alharbi"}, {"authorId": "2142149627", "name": "Balsam Abaalkhail"}, {"authorId": "2145568088", "name": "Dina M. Ibrahim"}], "citations": [{"paperId": "7c7b00a24448ef9f2a31283be72c485190b45d22", "title": "Two-Steps Insider Threat Detection Protocol (2S-ITDP) Based on Computer Usage Pattern Analysis"}]}
