{"paperId": "5c1c15a925e67402b389b17b066d06ad6ce03250", "publicationVenue": {"id": "7e4cc0e1-ec64-41b0-9eda-9a7ded2e8984", "name": "Jurnal Penelitian Pendidikan IPA", "type": "journal", "alternate_names": ["J Penelit Pendidik IPA"], "issn": "2527-7537", "alternate_issns": ["2460-2582", "2407-795X"], "url": "https://journal.unesa.ac.id/index.php/jppipa"}, "title": "Library Existence and Digital Science Literacy as An Effort to Increase Community's Reading Interest (In A Gender Perspective)", "abstract": "Digital libraries and scientific literacy as a source of knowledge to preserve human civilization and libraries as public institutions that acts as service providers and information providers. The development of science and technology in the current era has ushered in the process of obtaining scientific information very easily which accompanies humans freely without being selective in obtaining information only through smartphones, computers, the web and other social media. This study was carried out in a library and the samples were visitors and people around the library who used male and female classifications. The data that has been collected will be analyzed using two forms of analysis, namely quantitative and qualitative. The findings of this study are that there are differences in tendencies in choosing reading sources or sources of scientific information between men and women. Women are more dominant in using digital scientific literacy via smartphones and via the internet, while men prefer to visit the library to read and search for scientific literacy. The existence of libraries in the digital era still contributes to increasing people's reading interest even though people's reading interest is still in the low category.", "venue": "Jurnal Penelitian Pendidikan IPA", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-20", "journal": {"name": "Jurnal Penelitian Pendidikan IPA"}, "authors": [{"authorId": "2087785815", "name": "J. Penelitian"}, {"authorId": "2224551818", "name": "Pendidikan Ipa"}, {"authorId": "2278436073", "name": "Syamsuni Haji"}, {"authorId": "2278455347", "name": "Ruddah"}, {"authorId": "2278356409", "name": "Fathul Muin Zainuddin"}, {"authorId": "2278354832", "name": "Bahar Hafid"}, {"authorId": "2278456496", "name": "HR Syamsuni"}], "citations": []}
