{"paperId": "5c1d7d4a766b76db649eac589fdff87eb7dabbe0", "publicationVenue": {"id": "7cc3baec-aad9-4726-872c-48bbd0deb798", "name": "Frontiers in Nutrition", "type": "journal", "alternate_names": ["Front Nutr"], "issn": "2296-861X", "url": "https://www.frontiersin.org/journals/nutrition", "alternate_urls": ["http://journal.frontiersin.org/journal/nutrition", "http://www.frontiersin.org/nutrition"]}, "title": "Nutraceuticals for the Treatment of IBD: Current Progress and Future Directions", "abstract": "Inflammatory bowel disease (IBD) is a chronic relapsing-remitting inflammatory disease of the gastrointestinal tract. Patients are usually diagnosed in adolescence and early adulthood and need lifelong treatment. In recent years, it has been found that diet plays an important role in the pathogenesis of IBD. Diet can change intestinal barrier function, affect the structure and function of intestinal flora, and promote immune disorder, thus promoting inflammation. Many patients believe that diet plays a role in the onset and treatment of the disease and changes their diet spontaneously. This review provides some insights into how nutraceuticals regulate intestinal immune homeostasis and improve intestinal barrier function. We reviewed the research results of dietary fiber, polyphenols, bioactive peptides, and other nutraceuticals in the prevention and treatment of IBD and sought better alternative or supplementary treatment methods for IBD patients.", "venue": "Frontiers in Nutrition", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-06-06", "journal": {"name": "Frontiers in Nutrition", "volume": "9"}, "authors": [{"authorId": "2168684544", "name": "Quan-Yao Ban"}, {"authorId": "86972449", "name": "Mei-bing Liu"}, {"authorId": "2066767597", "name": "Ning Ding"}, {"authorId": "47558464", "name": "Ying Chen"}, {"authorId": "2168343897", "name": "Qiong Lin"}, {"authorId": "33161897", "name": "Juanmin Zha"}, {"authorId": "6949078", "name": "Weiqi He"}], "citations": [{"paperId": "2139cff828bf9c28631f2e5198066535c7dabfc6", "title": "A reverse translational approach reveals the protective roles of Mangifera indica in inflammatory bowel disease"}, {"paperId": "bcef45633b919f22ca3979d9e28940fb5114f05e", "title": "Protective effect of cellulose and soluble dietary fiber from Saccharina japonica by-products on regulating inflammatory responses, gut microbiota, and SCFAs production in colitis mice."}, {"paperId": "de3b0cd0eed8a8a324df718114e6e1a15bca77bd", "title": "Dietary polyphenols regulate appetite mechanism via gut-brain axis and gut homeostasis"}, {"paperId": "ec0a653d8ff99550233f029de702b2dfdac50a0e", "title": "Navigating the Gut-Cardiac Axis: Understanding Cardiovascular Complications in Inflammatory Bowel Disease"}, {"paperId": "cb11f35605399280a00abfa91f97530bfc35082a", "title": "Nutraceuticals and biotics in pediatric gastrointestinal disorders."}, {"paperId": "606336990ae8837e266f598cceee63fa4409146b", "title": "Defects in microvillus crosslinking sensitize to colitis and inflammatory bowel disease"}, {"paperId": "72fa92447b5d144f28c847927f1180d86e06d0a8", "title": "Protective effect of carbon dots derived from scrambled Coptidis Rhizoma against ulcerative colitis in mice"}, {"paperId": "40c60b523dc5c45b0420a1dc8082aaa0ffb000c7", "title": "Polydopamine Modified Ceria Nanorods Alleviate Inflammation in Colitis by Scavenging ROS and Regulating Macrophage M2 Polarization"}, {"paperId": "a813be4a805a2790f3c525bf0b282ea101272de1", "title": "Dealcoholized muscadine wine was partially effective in preventing and treating dextran sulfate sodium-induced colitis and restoring gut dysbiosis in mice."}, {"paperId": "0909bcbe0869a70b347f6023fc53271f4efcf3cf", "title": "Microalgae—Sustainable Source for Alternative Proteins and Functional Ingredients Promoting Gut and Liver Health"}, {"paperId": "bb6dcceb4d375e07b597dc1e603c016843ef12e8", "title": "Vagus Nerve Stimulation: A Personalized Therapeutic Approach for Crohn’s and Other Inflammatory Bowel Diseases"}]}
