{"paperId": "5c20d1852aa21d87679985c4e28cd6f0e3a48e47", "publicationVenue": {"id": "7f87a640-6dcc-4e08-8ae5-2bc658a320bd", "name": "Frontiers in Education", "type": "journal", "alternate_names": ["Front Educ"], "issn": "2504-284X", "url": "https://epub.uni-regensburg.de/37427/", "alternate_urls": ["https://www.frontiersin.org/journals/education", "http://journal.frontiersin.org/journal/education"]}, "title": "Multiple Texts as a Limiting Factor in Online Learning: Quantifying (Dis-)similarities of Knowledge Networks", "abstract": "We test the hypothesis that the extent to which one obtains information on a given topic through Wikipedia depends on the language in which it is consulted. Controlling the size factor, we investigate this hypothesis for a number of 25 subject areas. Since Wikipedia is a central part of the web-based information landscape, this indicates a language-related, linguistic bias. The article therefore deals with the question of whether Wikipedia exhibits this kind of linguistic relativity or not. From the perspective of educational science, the article develops a computational model of the information landscape from which multiple texts are drawn as typical input of web-based reading. For this purpose, it develops a hybrid model of intra- and intertextual similarity of different parts of the information landscape and tests this model on the example of 35 languages and corresponding Wikipedias. In the way it measures the similarities of hypertexts, the article goes beyond existing approaches by examining their structural and semantic aspects intra- and intertextually. In this way it builds a bridge between reading research, educational science, Wikipedia research and computational linguistics.", "venue": "Frontiers in Education", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-05", "journal": {"volume": "5"}, "authors": [{"authorId": "1733174", "name": "Alexander Mehler"}, {"authorId": "3406764", "name": "Wahed Hemati"}, {"authorId": "2377261", "name": "Pascal Welke"}, {"authorId": "1854425538", "name": "Maxim Konca"}, {"authorId": "3406748", "name": "Tolga Uslu"}], "citations": [{"paperId": "9b2f95c03cde7a810e247dc18c158e1347944b8d", "title": "The detection and effect of social events on Wikipedia data-set for studying human preferences"}, {"paperId": "d1029afcc9c0f9f1f28741f149927d756360d953", "title": "Computational Linguistic Assessment of Textbooks and Online Texts by Means of Threshold Concepts in Economics"}, {"paperId": "0cbaff4691440ea7ba676235683acf7b3d6652bf", "title": "Computational linguistic assessment of textbook and online learning media by means of threshold concepts in business education"}]}
