{"paperId": "5c332937fb84bf01d3f9b4f4c4ad83e3e861b1cd", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "Analyzing the educational goals, problems and techniques used in educational big data research from 2010 to 2018", "abstract": "ABSTRACT The purpose of this study is to review journal papers on educational big data research published from 2010 to 2018. A total of 143 papers were selected. The papers were characterized based on three dimensions: (a) educational goals; (b) educational problems addressed; and (c) big data analytical techniques used. A qualitative content analysis approach was conducted to develop a coding scheme for analyzing the selected papers. The results identified four types of educational goals, with a clear predominance of quality assurance. The identification of the most mentioned educational problems resulted in four main concerns: the lack of detecting student behavior modeling and waste of resources; inappropriate curricula and teaching strategies; oversights of quality assurance; and privacy and ethical issues. Concerning the most mentioned big data analytical techniques, the coding scheme revealed that the majority of the papers focused on the educational data mining technique followed by the learning analytics technique. The visual analytics technique was mentioned in a few papers. The results also indicated that the educational data mining technique is the most suitable technique to use for quality assurance and to provide potential solutions for the lack of detecting student behavior modeling and the waste of resources in institutions.", "venue": "Interactive Learning Environments", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-01-30", "journal": {"name": "Interactive Learning Environments", "pages": "1539 - 1555", "volume": "30"}, "authors": [{"authorId": "2313233", "name": "Benazir Quadir"}, {"authorId": "39797743", "name": "N. Chen"}, {"authorId": "32604750", "name": "P. Isaías"}], "citations": [{"paperId": "5e94c29dcdcebf75045a8ed4548070026741c5f6", "title": "Utilizing random forest algorithm for early detection of academic underperformance in open learning environments"}, {"paperId": "eed5c04f6d7cee9f6967be153760811e88373377", "title": "AI and BDA impact on Stakeholders' Responses to Education Technology Adoption"}, {"paperId": "e6e6373dd58d1a02350dd6e01150c80eff092db8", "title": "Unveiling the Potential of Big Data Analytics for Transforming Higher Education in Bangladesh; Needs, Prospects, and Challenges"}, {"paperId": "67fafa7f1c0c3e52a7f6bc63e97194cbfbeeaa3e", "title": "Education 5.0: Requirements, Enabling Technologies, and Future Directions"}, {"paperId": "bca16ae8ce7d2f1eedba07ed5f36f4a712b89a64", "title": "The Impact of The Virtual-Based Disaster Learning Model on Elementary Students' Understanding of COVID-19 Disaster-Learning"}, {"paperId": "fa17433a4e5b483d95afd2d5b1c8ca0b5bf5cded", "title": "Development of Fine Motor and Visual Motor Skills in Preparing Early Childhood Writing"}, {"paperId": "020ec3e7b237e0f5cb67534fbb494ea6a4290ea0", "title": "Improvement of learning outcomes in traditional learning model by introducing online activities and big data analytics"}, {"paperId": "d875bc1f4c8859ebc7be48d2faf40a7fb857b5ac", "title": "Revealing AI-Based Ed-Tech Tools Using Big Data"}, {"paperId": "362555d9e7d2f5b8f16e9d7973863a4964bd763c", "title": "K-Means Clustering Algorithm Based on Memristive Chaotic System and Sparrow Search Algorithm"}, {"paperId": "0e2ce882aa7072f726a8c5125c7c21f1d913edef", "title": "SPIRITUAL INTELLIGENCE IS DIRECTLY PROPORTIONAL TO THE IMPROVEMENT OF SOCIAL ATTITUDES OF ELEMENTARY SCHOOL STUDENTS"}, {"paperId": "6bcbaf45c1776f0bd88d99d5b6877a7f535bc8ce", "title": "Design of a DFS to Manage Big Data in Distance Education Environments"}, {"paperId": "965df956500824e8d0ba34d73fbaa97b78336b47", "title": "Academic and Administrative Role of Artificial Intelligence in Education"}, {"paperId": "6da392808c5e79ec0bb28fe4e1ee02d6ce51bfca", "title": "INTEGRATION OF ISLAMIC EDUCATION VALUES TOWARDS THE “YATIMAN” TRADITION IN THE MONTH OF SURO IN PEKALONGAN"}, {"paperId": "9198d6ab8ad1c6f1527a7d4adf06809848bf23c7", "title": "Challenges and Future Directions of Big Data and Artificial Intelligence in Education"}, {"paperId": "92eebfe098bfa72540dc95d94f6b67380991a450", "title": "Innovative Technologies: Applications in the Present and Considerations for the Future"}, {"paperId": "fad9310c447ea8d47a93115c5f4703305fed5e34", "title": "Analysis on the Possibilities of AI in Education"}, {"paperId": "fa3c48f959169461364957590bf084e2f816f03e", "title": "Assessing the Readiness of Higher Education Institution in Malaysia to Accept Generation Alpha using Predictive Analytics"}, {"paperId": "9d409a68b4c0bbbd00af0a81e8b9c67968e66879", "title": "Predictive Machine Learning Approach for Complex Problem Solving Process Data Mining"}, {"paperId": "0f4bdc9fc2f4b9510fc7044b1d379f90a4c31c5e", "title": "A Comprehensive Framework for Big Data Analytics in Education"}, {"paperId": "8a90ab1c8336d99048e16d5ce3e0148da7cf1371", "title": "Human-centered artificial intelligence in education: Seeing the invisible through the visible"}]}
