{"paperId": "5c33d34ac998e186a9892fa42c2184b4e429751e", "publicationVenue": {"id": "e95c8d18-09be-464f-a3cf-5b2637f0eff6", "name": "Algorithms", "type": "journal", "issn": "1999-4893", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-150910", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-150910", "http://www.mdpi.com/journal/algorithms", "http://www.mdpi.com/journal/algorithms/"]}, "title": "A Two-Phase Approach for Semi-Supervised Feature Selection", "abstract": "This paper proposes a novel approach for selecting a subset of features in semi-supervised datasets where only some of the patterns are labeled. The whole process is completed in two phases. In the first phase, i.e., Phase-I, the whole dataset is divided into two parts: The first part, which contains labeled patterns, and the second part, which contains unlabeled patterns. In the first part, a small number of features are identified using well-known maximum relevance (from first part) and minimum redundancy (whole dataset) based feature selection approaches using the correlation coefficient. The subset of features from the identified set of features, which produces a high classification accuracy using any supervised classifier from labeled patterns, is selected for later processing. In the second phase, i.e., Phase-II, the patterns belonging to the first and second part are clustered separately into the available number of classes of the dataset. In the clusters of the first part, take the majority of patterns belonging to a cluster as the class for that cluster, which is given already. Form the pairs of cluster centroids made in the first and second part. The centroid of the second part nearest to a centroid of the first part will be paired. As the class of the first centroid is known, the same class can be assigned to the centroid of the cluster of the second part, which is unknown. The actual class of the patterns if known for the second part of the dataset can be used to test the classification accuracy of patterns in the second part. The proposed two-phase approach performs well in terms of classification accuracy and number of features selected on the given benchmarked datasets.", "venue": "Algorithms", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-31", "journal": {"name": "Algorithms", "pages": "215", "volume": "13"}, "authors": [{"authorId": "4581326", "name": "A. Saxena"}, {"authorId": "1989110726", "name": "Shreya Pare"}, {"authorId": "6142137", "name": "M. Meena"}, {"authorId": "121948183", "name": "D. Gupta"}, {"authorId": "1799745", "name": "Akshansh Gupta"}, {"authorId": "1630421985", "name": "Imran Razzak"}, {"authorId": "2146113539", "name": "Chin-Teng Lin"}, {"authorId": "145499331", "name": "M. Prasad"}], "citations": []}
