{"paperId": "5c3eac270e1fae18e3453912fa51e9bf1d66fd4c", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "Alleviating Low-Battery Anxiety of Mobile Users via Low-Power Video Streaming", "abstract": "The pervasive low-battery anxiety (LBA) among modern mobile users has caused negative impacts on users’ emotion and health, and such anxiety may directly lead to loss of customers in power-hungry applications, e.g., video streaming. Despite its importance, LBA has not been thoroughly investigated due to the difficulty in quantitatively measuring LBA. To fill the gap, we present a quantitative model to measure the LBA among mobile users and design a tailored mechanism to alleviate it via display energy saving in video streaming. In specific, we first conduct a large-scale user survey among 2000+ mobile users and strategically extract an empirical LBA model that captures the variation of user’s anxiety degree along with the battery power draining. Then, by exploiting the emerging edge computing paradigm, we propose LPVS, a novel solution for low-power video streaming service at the network edge. It aims to minimize the LBA of mobile users, by integrating the extracted LBA model with the energy-saving image/video content transforming techniques. The emulation results using real-world video watching traces demonstrate that, LPVS can effectively alleviate mobile users’ LBA and prolong the low-battery users’ video watching time (i.e., customer retention) by 39%.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE 40th International Conference on Distributed Computing Systems (ICDCS)", "pages": "998-1008"}, "authors": [{"authorId": "1968264", "name": "Guoming Tang"}, {"authorId": "46174781", "name": "Kui Wu"}, {"authorId": "144233921", "name": "Deke Guo"}, {"authorId": "2154460109", "name": "Yi Wang"}, {"authorId": "2113269391", "name": "Huan Wang"}], "citations": [{"paperId": "d1e1ccfcaf1b5f8b33529649c412cb021f56e404", "title": "MixMax: Leveraging Heterogeneous Batteries to Alleviate Low Battery Experience for Mobile Users"}, {"paperId": "b6c082fff014e9d8f960b3783934c3634ced6c42", "title": "UPOA: A User Preference Based Latency and Energy Aware Intelligent Offloading Approach for Cloud-Edge Systems"}, {"paperId": "31946997a98f73aa27f9ea75c7f92a04c88c854a", "title": "Investigating Low-Battery Anxiety of Mobile Users"}, {"paperId": "df7e2fd830e4cfff6f0a9382bb84c5057c158861", "title": "Modeling and Alleviating Low-Battery Anxiety for Mobile Users in Video Streaming Services"}, {"paperId": "6072c658671d8e2a91c5bab01f9e890e243bdd44", "title": "Internet of Things, Ad Hoc and Sensor Networks Technical Committee Newsletter"}]}
