{"paperId": "5c52bec242ac371c1c223f184e689871d2fab935", "publicationVenue": null, "title": "Mr4Soil: A MapReduce-Based Framework Integrated with GIS for Soil Erosion Modelling", "abstract": "A soil erosion model is used to evaluate the conditions of soil erosion and guide agricultural production. Recently, high spatial resolution data have been collected in new ways, such as three-dimensional laser scanning, providing the foundation for refined soil erosion modelling. However, serial computing cannot fully meet the computational requirements of massive data sets. Therefore, it is necessary to perform soil erosion modelling under a parallel computing framework. This paper focuses on a parallel computing framework for soil erosion modelling based on the Hadoop platform. The framework includes three layers: the methodology, algorithm, and application layers. In the methodology layer, two types of parallel strategies for data splitting are defined as row-oriented and sub-basin-oriented methods. The algorithms for six parallel calculation operators for local, focal and zonal computing tasks are designed in detail. These operators can be called to calculate the model factors and perform model calculations. We defined the key-value data structure of GeoCSV format for vector, row-based and cell-based rasters as the inputs for the algorithms. A geoprocessing toolbox is developed and integrated with the geographic information system (GIS) platform in the application layer. The performance of the framework is examined by taking the Gushanchuan basin as an example. The results show that the framework can perform calculations involving large data sets with high computational efficiency and GIS integration. This approach is easy to extend and use and provides essential support for applying high-precision data to refine soil erosion modelling.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-27", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "103", "volume": "8"}, "authors": [{"authorId": "1708590", "name": "Zhigang Han"}, {"authorId": "46874221", "name": "Fen Qin"}, {"authorId": "1891081", "name": "Caihui Cui"}, {"authorId": "2108162393", "name": "Yannan Liu"}, {"authorId": "2151979395", "name": "Lingling Wang"}, {"authorId": "2872373", "name": "Pinde Fu"}], "citations": [{"paperId": "d3c5f873a4522383091f8d0dbffed10f9e0a07eb", "title": "A novel design and application of spatial data management platform for natural resources"}, {"paperId": "3081902dadf9ded4e48f9093a2ee71d33e5a10bf", "title": "Remote sensing technique and ICONA based-GIS mapping for assessing the risk of soil erosion: A case of the Rudbar Basin, Iran"}, {"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues"}]}
