{"paperId": "5c573e77829a606008bcb2bd0737b93cef3a5a5b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Modularis: Modular Data Analytics for Hardware, Software, and Platform Heterogeneity", "abstract": "Today's data analytics displays an overwhelming diversity along many dimensions: data types, platforms, hardware acceleration, etc. As a result, system design often has to choose between depth and breadth: high efficiency for a narrow set of use cases or generality at a lower performance. In this paper, we pave the way to get the best of both worlds: We present Modularis-an execution layer for data analytics based on fine-grained, composable building blocks that are as generic and simple as possible. These building blocks are similar to traditional database operators, but at a finer granularity, so we call them sub-operators. Sub-operators can be freely and easily combined. As we demonstrate with concrete examples in the context of RDMA-based databases, Modularis' sub-operators can be combined to perform the same task as a complex, monolithic operator. Sub-operators, however, can be reused, can be offloaded to different layers or accelerators, and can be customized to specialized hardware. In the use cases we have tested so far, sub-operators reduce the amount of code significantly-or example, for a distributed, RDMA-based join by a factor of four-while having minimal performance overhead. Modularis is an order of magnitude faster on SQL-style analytics compared to a commonly used framework for generic data processing (Presto) and on par with a commercial cluster database (MemSQL).", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-07", "journal": {"name": "ArXiv", "volume": "abs/2004.03488"}, "authors": [{"authorId": "41174671", "name": "D. Koutsoukos"}, {"authorId": "2068635149", "name": "Ingo Müller"}, {"authorId": "3454947", "name": "Renato Marroquín"}, {"authorId": "144641551", "name": "G. Alonso"}], "citations": [{"paperId": "c9e6c348af17abce7472c552107efc2ca24c5704", "title": "Database Technology for the Masses: Sub-Operators as First-Class Entities"}, {"paperId": "1fa72c835e6b1a38a2549bbbf4f3e9a0f6c9a23d", "title": "The collection Virtual Machine: an abstraction for multi-frontend multi-backend data analysis"}]}
