{"paperId": "5c5893d9e66be6a11d95a8a9305f7eff654895f9", "publicationVenue": {"id": "ccf4a25a-ab6d-4b32-8a6b-fab8cec15859", "name": "Digital Government Research", "type": "conference", "alternate_names": ["DG.O", "Digit Gov Res"]}, "title": "Big data on cloud for government agencies: benefits, challenges, and solutions", "abstract": "Big Data and Cloud computing are the most important technologies that give the opportunity for government agencies to gain a competitive advantage and improve their organizations. On one hand, Big Data implementation requires investing a significant amount of money in hardware, software, and workforce. On the other hand, Cloud Computing offers an unlimited, scalable and on-demand pool of resources which provide the ability to adopt Big Data technology without wasting on the financial resources of the organization and make the implementation of Big Data faster and easier. The aim of this study is to conduct a systematic literature review in order to collect data to identify the benefits and challenges of Big Data on Cloud for government agencies and to make a clear understanding of how combining Big Data and Cloud Computing help to overcome some of these challenges. The last objective of this study is to identify the solutions for related challenges of Big Data. Four research questions were designed to determine the information that is related to the objectives of this study. Data is collected using literature review method and the results are deduced from there.", "venue": "Digital Government Research", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2018-05-30", "journal": {"name": "Proceedings of the 19th Annual International Conference on Digital Government Research: Governance in the Data Age"}, "authors": [{"authorId": "146169592", "name": "Alaa Hussain Rashed"}, {"authorId": "31974414", "name": "Z. Karakaya"}, {"authorId": "47974211", "name": "A. Yazici"}], "citations": [{"paperId": "c050daea41d7f98b50b3d8c4f59a3c0a9c364739", "title": "Mobile and Cloud Computing Security"}]}
