{"paperId": "5c5d970d6cea7259b7656d43ce51d4431625f3f7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Fed-urlBERT: Client-side Lightweight Federated Transformers for URL Threat Analysis", "abstract": "In evolving cyber landscapes, the detection of malicious URLs calls for cooperation and knowledge sharing across domains. However, collaboration is often hindered by concerns over privacy and business sensitivities. Federated learning addresses these issues by enabling multi-clients collaboration without direct data exchange. Unfortunately, if highly expressive Transformer models are used, clients may face intolerable computational burdens, and the exchange of weights could quickly deplete network bandwidth. In this paper, we propose Fed-urlBERT, a federated URL pre-trained model designed to address both privacy concerns and the need for cross-domain collaboration in cybersecurity. Fed-urlBERT leverages split learning to divide the pre-training model into client and server part, so that the client part takes up less extensive computation resources and bandwidth. Our appraoch achieves performance comparable to centralized model under both independently and identically distributed (IID) and two non-IID data scenarios. Significantly, our federated model shows about an 7% decrease in the FPR compared to the centralized model. Additionally, we implement an adaptive local aggregation strategy that mitigates heterogeneity among clients, demonstrating promising performance improvements. Overall, our study validates the applicability of the proposed Transformer federated learning for URL threat analysis, establishing a foundation for real-world collaborative cybersecurity efforts. The source code is accessible at https://github.com/Davidup1/FedURLBERT.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-06", "journal": {"name": "ArXiv", "volume": "abs/2312.03636"}, "authors": [{"authorId": "2271347311", "name": "Yujie Li"}, {"authorId": "2267503063", "name": "Yanbin Wang"}, {"authorId": "2267825746", "name": "Haitao Xu"}, {"authorId": "2269448298", "name": "Zhenhao Guo"}, {"authorId": "2269595788", "name": "Fan Zhang"}, {"authorId": "2267581162", "name": "Ruitong Liu"}, {"authorId": "2152618395", "name": "Wenrui Ma"}], "citations": []}
