{"paperId": "5c694e65f4a440a80848c7011106a6b4a16c5039", "publicationVenue": {"id": "b328bb7b-9f50-4192-9616-e2eb72ef41b6", "name": "Conference on Privacy, Security and Trust", "type": "conference", "alternate_names": ["Conf Priv Secur Trust", "PST"]}, "title": "UCreDiSSiT: User Credibility Measurement incorporating Domain interest, Semantics in Social interactions, and Temporal factor", "abstract": "Online social media platforms provide a range of benefits, such as conversation and information sharing, as well as marketing and advertising for businesses. However, these platforms are soft targets for bad actors to disseminate misinformation or rumors. Untrustworthy content on social media poses a great threat to truth since any user can produce unverified online content to gain popularity. It has been realized that fake information and accounts create a great deal of confusion. To determine user credibility and promote reliable information, we propose UCreDiSSiT method, which incorporates a user's domain of interest, social relations, and temporal features. The suggested approach draws inspiration from earlier works but differs in weighing factors, formalizing factors, and addressing extreme circumstances in large-scale deployment. The experiments are conducted on real-time users' data on Twitter. Our results demonstrate the effectiveness of the proposed method.", "venue": "Conference on Privacy, Security and Trust", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-21", "journal": {"name": "2023 20th Annual International Conference on Privacy, Security and Trust (PST)", "pages": "1-11"}, "authors": [{"authorId": "36784923", "name": "Rashid Hussain Khokhar"}, {"authorId": "38268697", "name": "Sajjad Dadkhah"}, {"authorId": "2267900920", "name": "Tianhao Zhao"}, {"authorId": "2137329337", "name": "Xichen Zhang"}, {"authorId": "2264219601", "name": "Ali A. Ghorbani"}], "citations": []}
