{"paperId": "5c70fe0c3a98e970284f524f283a8d71f3baab99", "publicationVenue": {"id": "25248f80-fe99-48e5-9b8e-9baef3b8e23b", "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "type": "journal", "alternate_names": ["IEEE Trans Pattern Anal Mach Intell"], "issn": "0162-8828", "url": "http://www.computer.org/tpami/", "alternate_urls": ["http://www.computer.org/portal/web/tpami", "http://ieeexplore.ieee.org/servlet/opac?punumber=34"]}, "title": "Multi-View Discrete Clustering: A Concise Model", "abstract": "In most existing graph-based multi-view clustering methods, the eigen-decomposition of the graph Laplacian matrix followed by a post-processing step is a standard configuration to obtain the target discrete cluster indicator matrix. However, we can naturally realize that the results obtained by the two-stage process will deviate from that obtained by directly solving the primal clustering problem. In addition, it is essential to properly integrate the information from different views for the enhancement of the performance of multi-view clustering. To this end, we propose a concise model referred to as Multi-view Discrete Clustering (MDC), aiming at directly solving the primal problem of multi-view graph clustering. We automatically weigh the view-specific similarity matrix, and the discrete indicator matrix is directly obtained by performing clustering on the aggregated similarity matrix without any post-processing to best serve graph clustering. More importantly, our model does not introduce an additive, nor does it has any hyper-parameters to be tuned. An efficient optimization algorithm is designed to solve the resultant objective problem. Extensive experimental results on both synthetic and real benchmark datasets verify the superiority of the proposed model.", "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-27", "journal": {"name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "pages": "15154-15170", "volume": "45"}, "authors": [{"authorId": "1643745687", "name": "Qianyao Qiang"}, {"authorId": "2119454336", "name": "Bin Zhang"}, {"authorId": "39586294", "name": "Fei Wang"}, {"authorId": "144962210", "name": "F. Nie"}], "citations": []}
