{"paperId": "5c8033eae5d0391e3f96f5c606eecaf5a554c2ce", "publicationVenue": {"id": "5bd34b7c-17b3-4080-96c2-50bd51fcab3a", "name": "Quantitative Science Studies", "type": "journal", "alternate_names": ["Quant Sci Stud"], "issn": "2641-3337", "url": "https://www.mitpressjournals.org/loi/qss", "alternate_urls": ["https://www.mitpressjournals.org/qss"]}, "title": "Disappearing repositories - taking an infrastructure perspective on the long-term availability of research data", "abstract": "\n Currently, there is limited research investigating the phenomenon of research data repositories being shut down, and the impact this has on the long-term availability of data. This paper takes an infrastructure perspective on the preservation of research data by using a registry to identify 191 research data repositories that have been closed and presenting information on the shutdown process.\n The results show that 6.2 % of research data repositories indexed in the registry were shut down. The risks resulting in repository shutdown are varied. The median age of a repository when shutting down is 12 years. Strategies to prevent data loss at the infrastructure level are pursued to varying extent. 44 % of the repositories in the sample migrated data to another repository, and 12 % maintain limited access to their data collection. However, both strategies are not permanent solutions.\n Finally, the general lack of information on repository shutdown events as well as the effect on the findability of data and the permanence of the scholarly record are discussed.\n \n \n https://www.webofscience.com/api/gateway/wos/peer-review/10.1162/qss_a_00277\n", "venue": "Quantitative Science Studies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-10", "journal": {"name": "ArXiv", "volume": "abs/2310.06712"}, "authors": [{"authorId": "2082296239", "name": "Dorothea Strecker"}, {"authorId": "2052763057", "name": "H. Pampel"}, {"authorId": "2122252522", "name": "Rouven Schabinger"}, {"authorId": "2122249152", "name": "Nina Leonie Weisweiler"}], "citations": [{"paperId": "4bd0740b8e77ac371658064b22ab7ce8b983701d", "title": "Help biocurators to maximize the reach of your data"}]}
