{"paperId": "5c9f129869aed6d73134d65bed0a35cc7a068603", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "Research on the big data analysis of MOOCs in a flipped classroom based on attention mechanism in deep learning model", "abstract": "Engineering education can be improved through the implementation of a flipped classroom, an instructional approach that allows students to learn theory online and practice it offline. However, the flipped classroom approach does not directly solve the challenge of the high dropout rate in online distance education, such as massive open online courses (MOOCs). Actually, distance education lacks the convenience of face‐to‐face communication and supervision. This study considers a deep learning model based on an attention mechanism in addition to some other common traditional machine learning models in an engineering MOOC with a flipped classroom design. The aim is to predict students' future performance and assist teachers in discovering the important learning stages that affect the prediction, thus improving teaching and learning performance. Our model performs better than other commonly used models. It is found that the middle and final learning stages, where specific knowledge is taught, are important, offering a new approach to analyzing and promoting distance engineering education.", "venue": "Computer Applications in Engineering Education", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-21", "journal": {"name": "Computer Applications in Engineering Education", "pages": "1867 - 1882", "volume": "31"}, "authors": [{"authorId": "2244595420", "name": "Chengxin Li"}, {"authorId": "2244333614", "name": "Kaiyue Zhao"}, {"authorId": "2244360371", "name": "Mingduo Yan"}, {"authorId": "143781709", "name": "Xiuguo Zou"}, {"authorId": "2244412940", "name": "Maohua Xiao"}, {"authorId": "2114897752", "name": "Yan Qian"}], "citations": [{"paperId": "0bc5b7da173fd8657a9a29436097fb619d7eb807", "title": "Enhancing Dropout Prediction in Distributed Educational Data Using Learning Pattern Awareness: A Federated Learning Approach"}]}
