{"paperId": "5cb748b0cd8331444555f8951964d07bbb62d479", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Key Factors Influencing Purchase or Rent Decisions in Smart Real Estate Investments: A System Dynamics Approach Using Online Forum Thread Data", "abstract": "The real estate sector is receiving mix responses throughout the world, with some countries like USA receiving lesser and European and Asia Pacific markets receiving more transactions in recent years. Among the concerning factors, post-purchase regrets by the real estate owners or renters are on the rise, which have never been assessed to date through scholarly research. These regrets can further increase in the time of lockdowns and bans on inspections due to Corona Virus Disease 2019 (COVID-19) and social distancing rules enforced by various countries such as Australia. The current study aims at investigating the key post-purchase regret factors of real estate and property owners and renters over the last decade using published literature and online threads. Based on pertinent literature, 118 systematically identified and text-mined articles, and four online threads with 135 responses, the current study develops system dynamics models to assess and predict the increase in consumers’ regrets over the last decade. Further, a user-generated thread with 23 responses involving seven real estate managers and five agents with more than 20 years of experience, 10 buyers with at least three successful rentals or purchases, and a photographer with more than 10 years of experience, is initiated on five online discussion platforms whereby the respondents are involved in a detailed discussion to highlight the regret reasons specific to real estate purchases based on online information. General architecture for text mining (GATE) software has been utilised to mine the text from both types of threads: Published and user generated. Overall, the articles and threads published over the last decade are studied under two periods: P1 (2010–2014) and P2 (2015–2019) to highlight the post-purchase or rent-related regret reasons. The results show that regret levels of the real estate consumers based on published post-purchase data are at an alarmingly high level of 88%, which compared to 2015, has increased by 18%. Among the major cited reasons, complicated buy–sell process, lack or accuracy of information, housing costs, house size, mortgages, agents, inspections, and emotional decision making are key reasons of regret. Overall, a total of 10% and 8% increases have occurred in the regrets related to the buy–sell process and lack of inspections, respectively. On the other hand, regrets related to agents and housing costs have decreased drastically by 40% mainly due to the good return on investments in the growing markets. However, based on the current trend of over reliance on online information and more powers to the agents controlling online information coupled with lack of physical inspections, the situation can change anytime. Similarly, lack of information, housing size, and mortgage-related regrets have also decreased by 7%, 5%, and 2%, respectively, since 2019. The results are expected to encourage policy level changes for addressing the regrets and uplifting the real estate industry and moving towards a smart and sustainable real estate sector. These results and pertinent discussions may help the real estate decision makers to uplift the current state, move towards a smart real estate, and avoid futuristic regrets, especially in the COVID-hit environment where most of the industries are struggling to survive. Careful attention is required to the top regret factors identified in the study by the real estate managers, investors, and agents to pave the way for a more managed real estate and property sector whereby the consumers are more satisfied with the value they receive for their money. This win–win situation will enhance the property business and remove the stigmas of intentional and deliberate withholding of information by managers and agents from the property and real estate sectors that can help boost the business through more purchases and satisfaction of its customers.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-05-27", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "90426770", "name": "S. Sepasgozar"}], "citations": [{"paperId": "ef27e334a95fcd7db875e4f96c2e1e2c015465a6", "title": "The Influence of Virtual Events on Metaverse Commercial Real Estate Values: A Review"}, {"paperId": "ad7587cb668ac10605d4c0f072cde79a57ce8e76", "title": "Assessing the speculative dynamics and determinants of residential apartment rentals in Mogadishu, Somalia: A hybrid modeling approach"}, {"paperId": "45eba28311f535daaee3fe1e64bf091eeb0435d2", "title": "TO ASSESS THE LEVEL OF SATISFACTION OF BUYERS IN THE REAL ESTATE SECTOR"}, {"paperId": "31a648944dfb87e091dc345222dda4ce06b3a944", "title": "Exploring needs, choices, and preferences of homebuyers in Islamabad, Pakistan"}, {"paperId": "b293b9374944194903a4a014c318e1e8b49fbde8", "title": "Block by block: a bibliometric analysis of blockchain in real estate"}, {"paperId": "87a90b8b454555e65c7951522c4babd17aac0e61", "title": "The present and future of the digital transformation of real estate: A systematic review of smart real estate"}, {"paperId": "7db63a82ac9b420d4e2fa8983c0afabebb31eba2", "title": "Influential Factors in the Design and Development of a Sustainable Web3/Metaverse and Its Applications"}, {"paperId": "ef19ddbdc814d5d9f43dc74a08cd869d65b248fb", "title": "BIM and real estate valuation: challenges, potentials and lessons for future directions"}, {"paperId": "f47203c453d59f5f256ae7ed42490ae8a9a168ab", "title": "The Disaster-Resilient Smart City in Malaysia: The Use of Technology in Flood Management"}, {"paperId": "88796497dd038dce7944259bdae56ca8add81ef7", "title": "The impact of the COVID-19 pandemic on the residential real estate market on the example of Szczecin, Poland"}, {"paperId": "01464eb0bc0e6dbb8437c838dc167a86a2da0591", "title": "Dynamics and Driving Mechanism of Real Estate in China’s Small Cities: A Case Study of Gansu Province"}, {"paperId": "365b45331c09672c6070816b50a21fb901012d28", "title": "Circular Economy in the Construction Industry: A Step towards Sustainable Development"}, {"paperId": "d9edcbcd5be7a9282baae73c10ef3fde2036220b", "title": "Integrating Adaptation to Climate Change into Sustainable Development Policy and Planning"}, {"paperId": "d678f6e538edbd6870a9eaed224869e5529d9293", "title": "Key Adoption Factors for Collaborative Technologies and Barriers to Information Management in Construction Supply Chains: A System Dynamics Approach"}, {"paperId": "a070452297404e43755c51c6ddcea99940b09786", "title": "The Impact of Covid-19 on the Use of Modern Technologies By Real Estate Brokers"}, {"paperId": "c4efddb70ed3b148258cf252c9a35004c32bb799", "title": "Managing the additional cost of passive buildings from the supply chain perspective: A case of Nanjing, China"}, {"paperId": "5f7772b3b8199a30183aaa73bc5ee811bcdd4ce8", "title": "A Real Estate Early Warning System Based on an Improved PSO-LSSVR Model—A Beijing Case Study"}, {"paperId": "9e2c9ffc7bc1ac56aa197cc3daf5c7a3749a48d2", "title": "Moderating and mediating effect of perceived experience on merchant's behavioral intention to use mobile payments services"}, {"paperId": "348b0dd59c93822743dc1d11e26e556e23e6a915", "title": "To Buy or Not to Buy Foreign Currency: The Interplay between Fear of Missing Out, Unplanned Buying Behavior and Post-Purchase Regret"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "98d2a3ad95444036c7a2fe45df5db141650243cb", "title": "A Pricing Model for Urban Rental Housing Based on Convolutional Neural Networks and Spatial Density: A Case Study of Wuhan, China"}, {"paperId": "8550fbc72c6b46622fd732c58d24972f4ea40c81", "title": "Exploring a Pricing Model for Urban Rental Houses from a Geographical Perspective"}, {"paperId": "5aa4521aa7fd300ddaa6302a8219739c959bf95e", "title": "Consumers’ Choice between Real Estate Investment and Consumption: A Case Study in Taiwan"}, {"paperId": "67e50a02eafa7ef71d11399ecbcfa579899f5294", "title": "Modelling users' perception of the online real estate platforms in a digitally disruptive environment: An integrated KANO-SISQual approach"}, {"paperId": "df8a89a576ac9eaeaa059025293f029ab4834b45", "title": "A study on automated property management in commercial real estate: a case of India"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}, {"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires"}, {"paperId": "c5a7552d525641b5698ed643e5493880dea13bfe", "title": "Managing smart cities through six sigma DMADICV method: A review-based conceptual framework"}, {"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment"}, {"paperId": "3eebb0f5f5ffe88903e250d72e67418e8f8a35b2", "title": "The Coupling Coordination Evaluation of Sustainable Development between Urbanization, Housing Prices, and Affordable Housing in China"}, {"paperId": "a04ef2ce8f27abb416cdcc65408ee59409deb1f9", "title": "BIMp-Chart—A Global Decision Support System for Measuring BIM Implementation Level in Construction Organizations"}, {"paperId": "17f1b2cbbaffd0f3511d1752a048cd88dd65dc71", "title": "UAV Assisted Spatiotemporal Analysis and Management of Bushfires: A Case Study of the 2020 Victorian Bushfires"}, {"paperId": "2a85f91973a1f561d390f6eba37a7397ef35c1b7", "title": "Testing for overall and cluster convergence of housing rents using robust methodology: evidence from Polish provincial capitals"}, {"paperId": "03d12d332eb793d032bca60c5dc702281d41115f", "title": "Risk management in sustainable smart cities governance: A TOE framework"}, {"paperId": "e53c9b5f4b2e107769a1113b65fb74bb90be3678", "title": "It’s all about perceptions: A DEMATEL approach to exploring user perceptions of real estate online platforms"}, {"paperId": "cb9108d72ffd489339fb09ac4efda664ada98176", "title": "Barriers to the digitalisation and innovation of Australian Smart Real Estate: A managerial perspective on the technology non-adoption"}, {"paperId": "f0df59dcb11e297927e4ac0899559254e10880ae", "title": "Advertising through UAVs: Optimized path system for delivering smart real‐estate advertisement materials"}, {"paperId": "b045bed810823b2667c8325e015fb1bb6b1a459f", "title": "A conceptual framework for blockchain smart contract adoption to manage real estate deals in smart cities"}, {"paperId": "49d0eb38ece0145877e1fb56c1ed1b7433cf67c7", "title": "Assessment of the New Construction Market in Saint-Petersburg: Current Condition and Development Trends"}, {"paperId": "bbb021426c859e88dc317ab4f9544cd5d0d64785", "title": "Competitiveness in the construction industry: A contractor’s perspective on barriers to improving the construction industry performance"}, {"paperId": "014641643d49a977203c8cdacc688f9018117c50", "title": "Housing market bubbles and urban resilience: Applying systems theory"}, {"paperId": "276a1b5129df2d5f6fbdd77782d4cd2ec49e3d50", "title": "Smart Digital Marketing Capabilities for Sustainable Property Development: A Case of Malaysia"}, {"paperId": "09b17532657eeda785b0da1dbc5fded6ab31f859", "title": "Addressing disasters in smart cities through UAVs path planning and 5G communications: A systematic review"}, {"paperId": "426883021e07247240abbc8bb437db4f912231ba", "title": "Thirdhand Exposure to Methamphetamine Syndrome: Symptoms Resulting From Environmental Exposure to Methamphetamine Contamination Arising From"}, {"paperId": "482f8a78ed97e160e68ef72c088a376b714616ce", "title": "MODELLING RESDENTIAL PROPERTY VALUES IN BIDA USING GEOGRAPHIC INFORMATION SYSTEM"}]}
