{"paperId": "5cb9bed765a2b0315a3506742b2e359d2857d3e6", "publicationVenue": {"id": "86fe65f8-9db0-4e39-a4bf-d09388d43078", "name": "Journal of Trends in Computer Science and Smart Technology", "type": "journal", "alternate_names": ["J Trends Comput Sci Smart Technol"], "issn": "2582-4104", "url": "https://www.irojournals.com/tcsst/index.html"}, "title": "Sensor Assisted Incident Alarm System for Smart City Applications", "abstract": "The advancement and development of proficient technologies that exploit sensors and things connected with the internet respectively along with the progress of the associated protocols has greatly encouraged the growth of applications that are basically dependent on the sensors for observing the happenings. Multitudes of such applications have been designed to have an improved discernment of the environment and sort out the exigent circumstances. The prevailing internet of things developed for identifying the exigent situations have restrictions when a wide space of smart cities are taken into consideration, as it has to employ many monitoring variables or even over burden the regular sensor that are engaged in monitoring. So the proposed method in the paper aims in developing a three-layered exigent incident alarm system utilizing the sensors considering the various data’s gathered from the sensors and the geo-positioning system as input. The system modelled identifies and indicate the exigent situations using an alarm based on the incidents recognized and as well as the prior knowledge of the affected areas hazard’s. By this the modularized and flexible awareness of the emergency events are delivered as per the details obtained from the smart city scenario. The evaluation of the proposed model proved its potentiality in assisting the progress in the creating awareness on the exigent situations using the internet of things.", "venue": "Journal of Trends in Computer Science and Smart Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-20", "journal": {"name": "Journal of Trends in Computer Science and Smart Technology"}, "authors": [{"authorId": "143603277", "name": "S. Shakya"}], "citations": [{"paperId": "d03367c1c6976adf07f022add025ba6e1ae0dd14", "title": "Advances in real time smart monitoring of environmental parameters using IoT and sensors"}, {"paperId": "f7700803728e769dfa651ab0fb03dc4330cb2022", "title": "Internet of Things based Smart Fencing System"}, {"paperId": "9e250e304722fee97e1bc4352c7f392cb3f4e1d3", "title": "Improved RSSI Based 3D Localization for Indoor Wireless Sensor Network"}, {"paperId": "0b9fcd700b1d59a848e3b2cd0adf249217f3bf39", "title": "Analyzing Sensor-based Technologies for Obstacle Avoidance Robot"}, {"paperId": "80664fe53c757adc5897d48b75429b1d8af25488", "title": "An Automated Smart Embedded System on Fire Detection and Prevention for Ensuring Safety"}, {"paperId": "fb4be3db1ba997de3d024a31b795b063f752edc0", "title": "Integrating Machine to Machine Communication (M2M) and MQTT Protocol Techniques for Conversion of Water Motor Pump into a Smart System"}, {"paperId": "e5bf5f018bd76fe8eafdd95d44adf51e5a03a4b5", "title": "Robot Path Planning using Modified Genetic Algorithm in EC2"}, {"paperId": "1ca29cf23392b2d33ed44722e2c42c3be92dd38a", "title": "Nakagami-m Fading Detection with Eigen Value Spectrum Algorithms"}, {"paperId": "3fba5ea04e173ffbf306203d6c7c93c382298dd8", "title": "IOT Based Agriculture Monitoring and Controlling System"}, {"paperId": "8dff6205cb16e6812a7792866214d0f7a5c70dcd", "title": "IoT based Safety System for Women"}, {"paperId": "b44239465ce702efcd64fd29282886272d52ea83", "title": "Arduino Based Vehicle Accident Alert System Using GPS, GSM and MEMS Accelerometer"}, {"paperId": "0c68e6aafa292ae4d130bc20af8d50ae47980033", "title": "Hand Gesture Controlled Contactless Elevator"}, {"paperId": "712fa65eda677dc6d180df769d3f73676c5de181", "title": "An IoT-Based Automated Smart Helmet"}, {"paperId": "5a83656dd5a0080dab227eb2adc3ab19f726e2fa", "title": "Embedded Kit with Object Identification for Visually Impaired People"}]}
