{"paperId": "5cc566f05712aaa9ef10c38ee4e04fab0967e09b", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "YeSQL: \"You extend SQL\" with Rich and Highly Performant User-Defined Functions in Relational Databases", "abstract": "The diversity and complexity of modern data management applications have led to the extension of the relational paradigm with syntactic and semantic support for User-Defined Functions (UDFs). Although well-established in traditional DBMS settings, UDFs have become central in many application contexts as well, such as data science, data analytics, and edge computing. Still, a critical limitation of UDFs is the impedance mismatch between their evaluation and relational processing. In this paper, we present YeSQL, an SQL extension with rich UDF support along with a pluggable architecture to easily integrate it with either server-based or embedded database engines. YeSQL currently supports Python UDFs fully integrated with relational queries as scalar, aggregator, or table functions. Key novel characteristics of YeSQL include easy implementation of complex algorithms and several performance enhancements, including tracing JIT compilation of Python UDFs, parallelism and fusion of UDFs, stateful UDFs, and seamless integration with a database engine. Our experimental analysis showcases the usability and expressiveness of YeSQL and demonstrates that our techniques of minimizing context switching between the relational engine and the Python VM are very effective and achieve significant speedups up to 68x in common, practical use cases compared to earlier approaches and alternative implementation choices.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2270-2283", "volume": "15"}, "authors": [{"authorId": "2182935856", "name": "Yannis E. Foufoulas"}, {"authorId": "1695573", "name": "A. Simitsis"}, {"authorId": "2183384800", "name": "Eleftherios Stamatogiannakis"}, {"authorId": "1684197", "name": "Y. Ioannidis"}], "citations": [{"paperId": "49d9666d6e3dd5a5a49a9db500c2683c23132b91", "title": "Efficient Execution of User-Defined Functions in SQL Queries"}, {"paperId": "0985e38dc2ac36eb26c5c0c195b5d5725a5583dc", "title": "Declarative Sub-Operators for Universal Data Processing"}, {"paperId": "62ab0c752b63393c9462ef2b749cd7545d2b1a49", "title": "Predicate Pushdown for Data Science Pipelines"}, {"paperId": "3fb4813a08ecbbf4ceb31f722713f4bc8366e709", "title": "User-Defined Functions in Modern Data Engines"}, {"paperId": "4abb1e671ce5e34d890222f764ad865e6b8a459e", "title": "YeSQL: Rich User-Defined Functions without the Overhead"}, {"paperId": "017ed88c7a7f4d72319bcf5821b591b694fd23f7", "title": "The History, Present, and Future of ETL Technology (invited)"}, {"paperId": "089edfd1861192c4a86b6982dec8b41261c4ef79", "title": "User-Defined Functions in Relational Databases: Challenges and Promising Solutions based on YeSQL"}]}
