{"paperId": "5ce46ddaac2dca26a9cf5e40d9211e8b2177e173", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Wide-Area Spark Streaming: Automated Routing and Batch Sizing", "abstract": "Modern stream processing frameworks, such as Spark Streaming, are designed to support a wide variety of stream processing applications, such as real-time data analytics in social networks. As the volume of data to be processed increases rapidly, there is a pressing need for processing them across multiple geo-distributed datacenters. However, these frameworks are not designed to take limited and varying inter-datacenter bandwidth into account, leading to longer query latencies. In this paper, we present the design and implementation of an extended Spark Streaming framework to automatically and optimally schedule tasks, select data flow routes and determine micro-batch sizes across geo-distributed datacenters in wide-area networks. To make these decisions, we propose a sparsity-regularized ADMM algorithm to efficiently solve a nonconvex optimization problem, based on readily measurable operating traces. Toward incremental real-world deployment, we take a non-intrusive approach to support flexible routing of micro-batches by adding a new DStream transformation we have developed to the existing Spark Streaming framework. As a result, our implementation can enforce scheduling decisions by modifying application workflows only. We have deployed our implementation on Amazon EC2 with emulated bandwidth constraints, and our experimental results on various types of queries have demonstrated the effectiveness of our proposed framework, as compared to the existing Spark Streaming scheduler and other data-locality-based heuristics.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1434-1448", "volume": "30"}, "authors": [{"authorId": "2108651293", "name": "Wenxin Li"}, {"authorId": "1714907", "name": "Di Niu"}, {"authorId": "2108098194", "name": "Yinan Liu"}, {"authorId": "8603167", "name": "Shuhao Liu"}, {"authorId": "91269142", "name": "Baochun Li"}], "citations": [{"paperId": "dc13954d35376f499301dd8545a6599ed513756a", "title": "Network-aware worker placement for wide-area streaming analytics"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}, {"paperId": "6fcc7739b8edb0a16b8d2eb0ee4889334ca634fa", "title": "An improved approach for mining association rules in parallel using Spark Streaming"}, {"paperId": "73064cf70c9c7eb2b2d25393fe4cf228251db1ec", "title": "Combined time bound optimization of control, communication, and data processing for FSO‐based 6G UAV aerial networks"}, {"paperId": "e07e3b09761077244eca1662c7d7b66df08631d7", "title": "Efficient Coflow Transmission for Distributed Stream Processing"}, {"paperId": "213a83e61e1347ffa58da9383a4bf92f4a77a6c8", "title": "Real-time intelligent big data processing: technology, platform, and applications"}, {"paperId": "d842ce9be071c8358ad7e56552b7d425ae317b30", "title": "Wide-Area Spark Streaming: Automated Routing and Batch Sizing"}]}
