{"paperId": "5cffe0c3c3430444d8859a323ba003fc83d91010", "publicationVenue": {"id": "abcfade0-4cdd-4b9f-bac3-fa13022b0a51", "name": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "type": "conference", "alternate_names": ["Ant Algorithm", "Ant Algorithms", "Int Workshop Ant Colony Optim Swarm Intell", "IEEE Int Conf Adv Netw Telecommun Syst", "Algorithmic Number Theory Symp", "Ant Colony Optimization and Swarm Intelligence", "Int Conf Adv Netw Telecommuncations Syst", "ANTS", "Ant Colony Optim Swarm Intell", "Algorithmic Number Theory Symposium", "International Conference on Advanced Networks and Telecommuncations Systems", "IEEE International Conference on Advanced Networks and Telecommunications Systems"], "url": "http://www.wikicfp.com/cfp/program?id=184", "alternate_urls": ["http://iridia.ulb.ac.be/~ants/", "http://www.wikicfp.com/cfp/program?id=182"]}, "title": "AI/ML Model Training in O-RAN: Assessing Datasets for Hoarding and Choosing Strategies", "abstract": "The advent of Open Radio Access Network (O-RAN) is transforming the traditional cellular networks into flexible, interoperable, and innovative through open standard interfaces (i.e., O1, A1, E2) and RAN Intelligent Controllers (RICs) — Near-real time and Non-real time (Near- and Non-RT RIC). These RICs leverage AI/ML models for intelligent decisions, interacting with RAN components — centralized units (CUs), distributed units (DUs), and radio units (RUs). Choosing the appropriate data for AI/ML model training in O-RAN is critical, as training based on the nature of the data, whether homogeneous or heterogeneous, can significantly improve model accuracy and efficient resource utilization. This paper introduces an approach that determines the dataset homogeneity by employing the Kolmogorov-Smirnov test (KS Test) and also considers evaluating both real-time and synthetic datasets.", "venue": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE International Conference on Advanced Networks and Telecommunications Systems (ANTS)", "pages": "1-3"}, "authors": [{"authorId": "2090272211", "name": "Venkateswarlu Gudepu"}, {"authorId": "2284347250", "name": "Bhargav Chirumamilla"}, {"authorId": "2283541", "name": "Venkatarami Reddy Chintapalli"}, {"authorId": "1681270", "name": "P. Castoldi"}, {"authorId": "1790498", "name": "L. Valcarenghi"}, {"authorId": "2284343189", "name": "K. Kondepu"}], "citations": []}
