{"paperId": "5d02e8c798cdb9d79da2a4e5be0658e82e74258b", "publicationVenue": {"id": "99fb912c-384c-4d69-92e4-8be397aa3df2", "name": "International journal of mathematical, engineering and management sciences", "type": "journal", "alternate_names": ["Int j math eng manag sci"], "issn": "2455-7749", "url": "http://ijmems.in/"}, "title": "Determinants of Assurance Management System for Critical Asset: A Literature Review", "abstract": "Several studies found that critical asset failure results in delays and downtimes in operation for most industries. One of the studies revealed that 272 of the 773 occurrences involved a critical asset breakdown. Thus, this study aimed to discuss the relevant factors of implementing the Assurance Management System for the industry's selected critical asset. Literature reviews play a significant role in this research through a content analysis review process from different review articles, google scholar, journals, and other social sciences. The result revealed that increasing the organization's knowledge of the processes and asset criticality in the assurance management system offers a high degree of openness to the activities carried out to ensure continued asset reliability and integrity. Relatively, it shows a clear long-term progress pattern of improved equipment reliability, leading to a significant increase in consumer trust due to introducing a system of reliability assurance management. Indeed, the study recommended that implementing an assurance management system is an integral part of the critical asset as it offers trust that the asset will perform as anticipated. Finally, it is an aid in understanding the asset and its relationship between expected and actual performance and efficiency in using a structured approach of the Assurance Management System for Critical Asset, the AMSCAF Framework. Therefore, industry stakeholders should consider the recommendations and best practices to ensure critical asset management systems need to generate value that maintains a competitive advantage in today's highly complicated and challenging market competition through the Assurance Management System.", "venue": "International journal of mathematical, engineering and management sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-01", "journal": {"name": "International Journal of Mathematical, Engineering and Management Sciences"}, "authors": [{"authorId": "2088506210", "name": "Joseph A. Tubil"}, {"authorId": "36014565", "name": "Alexander S. Acosta"}, {"authorId": "84416252", "name": "I. Acosta"}, {"authorId": "97704298", "name": "E. P. Malagapo"}], "citations": []}
