{"paperId": "5d05b1bdd14c1f1f332559787a20e43c9f68fe09", "publicationVenue": {"id": "37555ef6-5b69-4ae8-a9b3-f2052c7552a5", "name": "Advances in Multimedia", "alternate_names": ["Adv Multimedia"], "issn": "1687-5680", "url": "https://www.hindawi.com/journals/am/"}, "title": "Analysis of User Personalized Retrieval of Multimedia Digital Archives Dependent on BP Neural Network Algorithm", "abstract": "This paper briefly introduces the characteristics of content-based multimedia retrieval under the information background, analyzes the implementation process of these technologies in the multimedia archives retrieval system including video and image information of digital archives, and points out that the content-based multimedia retrieval technology is bound to be organically combined with the traditional text retrieval methods. The information retrieval technologies in the past can only comply with the specific requirements of customers. Due to their characteristics of universality, they can hardly meet the demands of different environments, various purposes, and different times at the same time yet. Researchers have put forward personalized retrieval of multimedia files based on the BP neural network computing. In this way, the interest model of customers can be analyzed based on the characteristics of the different classification areas of users. Subsequently, the corresponding calculations are carried out, and the model is updated accordingly. Through the experiments, it is verified that the probability model put forward in this paper is the optimal solution to express the interest of customers and its changes.", "venue": "Advances in Multimedia", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-16", "journal": {"name": "Advances in Multimedia"}, "authors": [{"authorId": "6492166", "name": "Zhongke Wang"}], "citations": [{"paperId": "33d178f5e7d38c1a1f2f03400c85cc23547148e7", "title": "Retracted: Analysis of User Personalized Retrieval of Multimedia Digital Archives Dependent on BP Neural Network Algorithm"}, {"paperId": "d88cf1fee466ea23e320f30924f33c9ab85f5f67", "title": "Application of BP Neural Network Algorithm in Solving Mathematical Modeling Optimization Problems"}, {"paperId": "881ccf1708be5814d53da9f0d556fa13c7e07d8b", "title": "Research on Financial Early Warning Based on Combination Forecasting Model"}]}
