{"paperId": "5d0c4b53d487fbe0d3c15847feb7b53f7579acec", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "The era of Big Spatial Data", "abstract": "In this tutorial, we present the recent work in the database community for handling Big Spatial Data. This topic became very hot due to the recent explosion in the amount of spatial data generated by smartphones, satellites and medical devices, among others. This tutorial goes beyond the use of existing systems as-is (e.g., Hadoop, Spark or Impala), and digs deep into the core components of big systems (e.g., indexing and query processing) to describe how they are designed to handle big spatial data. During this 90-minute tutorial, we review the state-of-the-art work in the area of Big Spatial Data while classifying the existing research efforts according to the implementation approach, underlying architecture, and system components. In addition, we provide case studies of full-fledged systems and applications that handle Big Spatial Data which allows the audience to better comprehend the whole tutorial.", "venue": "IEEE International Conference on Data Engineering", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2015-04-13", "journal": {"name": "2016 IEEE 32nd International Conference on Data Engineering (ICDE)", "pages": "1424-1427"}, "authors": [{"authorId": "1876123", "name": "A. Eldawy"}, {"authorId": "1756679", "name": "M. Mokbel"}], "citations": [{"paperId": "1e245e7158b9139ca9a07a5817a4569d98ded770", "title": "iSoLIM\n : a similarity-based spatial prediction software for the big data era"}, {"paperId": "84294c7bbde52b026fc08dae023998af97b52218", "title": "Efficient distributed algorithms for distance join queries in spark-based spatial analytics systems"}, {"paperId": "2b1143fbed61617fcc27633dd9452a627edb5c99", "title": "From Kepler to Newton: Explainable AI for Science Discovery"}, {"paperId": "89a08f5dac39cfdf144c745a29453b92554ce0cc", "title": "Cost estimation of spatial join in spatialhadoop"}, {"paperId": "828fecbc60b37b7921fffb95b5a7521d83e0ec04", "title": "A Comprehensive Overview of BIG DATA Technologies: A Survey"}, {"paperId": "9f08bc890534189eaefa6b41ccd8b1b2f34213e7", "title": "Generalized communication cost efficient multi-way spatial join: revisiting the curse of the last reducer"}, {"paperId": "9a92b863a785c8bf8527862332300e70f949db70", "title": "Efficient astronomical query processing using spark"}, {"paperId": "da27323e1456ee41dbc198a14af3d37d45c29946", "title": "Approximate Query Processing: What is New and Where to Go?"}, {"paperId": "b4c0feb75fdfb126bb25f947b4159f2e49f9f093", "title": "IPUMS-Terra: integrated big heterogeneous spatiotemporal data analysis system"}, {"paperId": "4e7e6aa57e9ea8f219965fdffb0bfb53bbbaa5e9", "title": "A NEW INITIATIVE FOR TILING, STITCHING AND PROCESSING GEOSPATIAL BIG DATA IN DISTRIBUTED COMPUTING ENVIRONMENTS"}, {"paperId": "611493e98c115fcc4d8b1383087e1c66607b9b68", "title": "A hybrid approach combining real-time and archived data for mobility analysis"}, {"paperId": "997d420a0fe51fc417dbb9facd2fb6f83b6ab4b5", "title": "From Kepler to Newton: Explainable AI-based Paradigm for Science Discovery"}, {"paperId": "1ea9c8b3ac646a3588c5189d8a824736b6ee6f3e", "title": "From Kepler to Newton: the Role of Explainable AI in Science Discovery"}]}
