{"paperId": "5d14985d9f50e3b5418d9c57ae3b77e933cd77b4", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Privacy Protection of Task in Crowdsourcing: Policy-Hiding and Attribute Updating Attribute-Based Access Control Based on Blockchain", "abstract": "Crowdsourcing is a new way to solve complex problems by using human intelligence. However, the tasks and user information privacy concerned in crowdsourcing have not been adequately addressed. It is necessary to design a privacy protection mechanism for tasks that need to be restricted to specific user groups. Ciphertext-policy attribute-based encryption (CP-ABE) is an efficient and feasible cryptographic tool, particularly for crowdsourcing systems. The encryptor can choose the access policy independently, which limits the scope of decryption users. At present, most CP-ABE schemes adopt a centralized management platform, which poses problems such as high trust-building costs, DDoS attacks, and single point of failure. In this paper, we propose a new access control scheme based on CP-ABE and blockchain, which has the properties of policy hiding and attribute updating. To protect the privacy of worker’s attributes, we adopt a test algorithm based on a fully homomorphic cryptosystem to confidentially judge whether the worker’s attribute lists match the hidden attributes policy in ciphertext or not before the decryption. Experiment results and comprehensive comparisons show that our mechanism is more flexible, private, and scalable than existing schemes.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-24", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2116714695", "name": "Kunwei Yang"}, {"authorId": "143787139", "name": "Bo Yang"}, {"authorId": "2057433", "name": "Yanwei Zhou"}, {"authorId": "2156631870", "name": "Tao Wang"}, {"authorId": "2545916", "name": "Linming Gong"}], "citations": [{"paperId": "b4563b6274a5c01e40e37a4af9c74599ac802bd6", "title": "A blockchain based access control scheme with hidden policy and attribute"}]}
