{"paperId": "5d175f2479960733307f7f92c6fd9e108098753c", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Efficiently Transforming Tables for Joinability", "abstract": "Data from different sources rarely conform to a single formatting even if they describe the same set of entities, and this raises concerns when data from multiple sources must be joined or cross-referenced. Such a formatting mismatch is unavoidable when data is gathered from various public and third-party sources. Commercial database systems are not able to perform the join when there exist differences in data representation or formatting, and manual reformatting is both time consuming and error-prone. We study the problem of efficiently joining textual data under the condition that the join columns are not formatted the same and cannot be equi-joined, but they become joinable under some transformations. The problem is challenging simply because the number of possible transformations explodes with both the length of the input and the number of rows, even if each transformation is formed using very few basic units. We show that an efficient algorithm can be developed based on the common characteristics of the joined columns and over a rich set of basic operations that can be composed to form transformations. Compared to a state-of-the-art approach, our algorithm covers every transformation that is covered in the state-of-the-art approach but is a few orders of magnitude faster, as evaluated on various real and synthetic data.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-18", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "1649-1661"}, "authors": [{"authorId": "22239946", "name": "Arash Dargahi Nobari"}, {"authorId": "2144238", "name": "Davood Rafiei"}], "citations": [{"paperId": "e5f36c50df96be4a80b959fa1a5e417c57c5830c", "title": "Efficiently Estimating Mutual Information Between Attributes Across Tables"}, {"paperId": "6c0508cf047cbd135ef99c39a649ba4ae8f925f2", "title": "Auto-Tables: Synthesizing Multi-Step Transformations to Relationalize Tables without Using Examples"}, {"paperId": "6472b4607eb4cadd7029b789fe584c2bd8c901e7", "title": "Auto-BI: Automatically Build BI-Models Leveraging Local Join Prediction and Global Schema Graph"}, {"paperId": "bc1ec85529e3ac971c84ead159dbc1201418fa51", "title": "BareTQL: An Interactive System for Searching and Extraction of Open Data Tables"}]}
