{"paperId": "5d1e6d6e85212aefd2815c66e72aa76b5b8509a9", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "ML-Enabled Systems Model Deployment and Monitoring: Status Quo and Problems", "abstract": "[Context] Systems incorporating Machine Learning (ML) models, often called ML-enabled systems, have become commonplace. However, empirical evidence on how ML-enabled systems are engineered in practice is still limited, especially for activities surrounding ML model dissemination. [Goal] We investigate contemporary industrial practices and problems related to ML model dissemination, focusing on the model deployment and the monitoring of ML life cycle phases. [Method] We conducted an international survey to gather practitioner insights on how ML-enabled systems are engineered. We gathered a total of 188 complete responses from 25 countries. We analyze the status quo and problems reported for the model deployment and monitoring phases. We analyzed contemporary practices using bootstrapping with confidence intervals and conducted qualitative analyses on the reported problems applying open and axial coding procedures. [Results] Practitioners perceive the model deployment and monitoring phases as relevant and difficult. With respect to model deployment, models are typically deployed as separate services, with limited adoption of MLOps principles. Reported problems include difficulties in designing the architecture of the infrastructure for production deployment and legacy application integration. Concerning model monitoring, many models in production are not monitored. The main monitored aspects are inputs, outputs, and decisions. Reported problems involve the absence of monitoring practices, the need to create custom monitoring tools, and the selection of suitable metrics. [Conclusion] Our results help provide a better understanding of the adopted practices and problems in practice and support guiding ML deployment and monitoring research in a problem-driven manner.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-08", "journal": {"name": "ArXiv", "volume": "abs/2402.05333"}, "authors": [{"authorId": "2283308713", "name": "Eduardo Zimelewicz"}, {"authorId": "2243005818", "name": "Marcos Kalinowski"}, {"authorId": "2243005010", "name": "Daniel Méndez"}, {"authorId": "52208075", "name": "G. Giray"}, {"authorId": "2257030415", "name": "Antonio Pedro Santos Alves"}, {"authorId": "145759426", "name": "N. Lavesson"}, {"authorId": "2257000547", "name": "Kelly Azevedo"}, {"authorId": "51472310", "name": "Hugo Villamizar"}, {"authorId": "2435184", "name": "Tatiana Escovedo"}, {"authorId": "2242532889", "name": "Hélio Lopes"}, {"authorId": "2257002259", "name": "Stefan Biffl"}, {"authorId": "2162469467", "name": "Juergen Musil"}, {"authorId": "1955934", "name": "M. Felderer"}, {"authorId": "2257005065", "name": "Stefan Wagner"}, {"authorId": "1894096", "name": "M. T. Baldassarre"}, {"authorId": "1680289", "name": "T. Gorschek"}], "citations": []}
