{"paperId": "5d2c3111326dc3cb3dfae573a6b3db6e26e618fc", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Semi-supervised Approach for Activity Recognition from Indoor Trajectory Data", "abstract": "—The increasingly wide usage of location aware sensors has made it possible to collect large volume of trajectory data in diverse application domains. Machine learning allows to study the activities or behaviours of moving objects (e.g., people, vehicles, robot) using such trajectory data with rich spatiotemporal information to facilitate informed strategic and operational decision making. In this study, we consider the task of classifying the activities of moving objects from their noisy indoor trajectory data in a collaborative manufacturing environment. Activity recognition can help manufacturing companies to develop appropriate management policies, and optimise safety, productivity, and efficiency. We present a semi-supervised machine learning approach that first applies an information theoretic criterion to partition a long trajectory into a set of segments such that the object exhibits homogeneous behaviour within each segment. The segments are then labelled automatically based on a constrained hierarchical clustering method. Finally, a deep learning classification model based on convolutional neural networks is trained on trajectory segments and the generated pseudo labels. The proposed approach has been evaluated on a dataset containing indoor trajectories of multiple workers collected from a tricycle assembly workshop. The proposed approach is shown to achieve high classification accuracy (F-score varies between 0.81 to 0.95 for different trajectories) using only a small proportion of labelled trajectory segments.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-09", "journal": {"name": "ArXiv", "volume": "abs/2301.03134"}, "authors": [{"authorId": "10396056", "name": "Mashud Rana"}, {"authorId": "37034441", "name": "Ashfaqur Rahman"}, {"authorId": "3165423", "name": "Daniel V. Smith"}], "citations": [{"paperId": "4beb549e37aa2ea5edec341149a314124a8559ff", "title": "Time-Series-Based Feature Selection and Clustering for Equine Activity Recognition Using Accelerometers"}]}
