{"paperId": "5d3561a8a897cb5adf198621f86db0ac51c3732b", "publicationVenue": {"id": "441b5e73-e71f-482b-a562-951d1573a852", "name": "International Journal of Academic Research in Business and Social Sciences", "type": "journal", "alternate_names": ["Int J Acad Res Bus Soc Sci", "The International Journal of Academic Research in Business and Social Sciences"], "issn": "2222-6990", "url": "http://hrmars.com/index.php/journals/journaldetail/IJARBSS", "alternate_urls": ["http://hrmars.com/index.php/pages/detail/IJARBSS", "http://www.hrmars.com/index.php?CAT=1&page=abt%20ijarbss"]}, "title": "Understanding Crowdfunding via Social Media: A Review of the Relevancy of Previous Studies", "abstract": "Crowdfunding has emerged as an alternative financing method, enabling individuals and organizations to raise funds through small contributions from a large number of people. Social media platforms such as Facebook, Twitter, and Instagram have played a pivotal role in the success of crowdfunding initiatives. Utilizing social media, creators can reach a wider audience, share their campaigns, and connect with potential supporters who share similar interests. As a result, crowdfunding via social media has gained significant popularity in recent years. This study aims to examine the relevance and rigour of current research on crowdfunding via social media through a comprehensive review of past studies. By addressing the existing literature gaps, we seek to contribute to a better understanding of this phenomenon. Specifically, we will expand on prior research and identify key areas that require further exploration. The findings of this study will provide valuable insights for researchers, enabling them to generate more meaningful and comprehensive studies that contribute to the growth of crowdfunding via social media. By exploring these aspects, this study aims to advance knowledge and address the existing gaps in the literature.", "venue": "International Journal of Academic Research in Business and Social Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-09", "journal": {"name": "International Journal of Academic Research in Business and Social Sciences"}, "authors": [{"authorId": "2280496441", "name": "Ahmad Amru Mohamad Zaid"}, {"authorId": "9283186", "name": "Ab Razak Che Hussin"}], "citations": []}
