{"paperId": "5d4a5347d40c226842e29f965ab9a7141187a9d9", "publicationVenue": {"id": "8acaada7-7c03-41b4-bcef-65926e7ee9fb", "name": "SoutheastCon", "type": "conference", "alternate_names": ["SoutheastCon"]}, "title": "Pedagogical Innovative Research Endeavor: Visualization of Streamed Big Data through Augmented Reality", "abstract": "The speed of technical and scientific innovation is accelerating much faster than humans can learn. Thus, there is a need for innovative pedagogical research to decrease this gap. Toward that goal, the approach of pedagogical component experiment was to design, develop, and measure the effectiveness of an augmented reality (AR) application for the visualization of streamed network traffic data to create an innovative pedagogical research environment and opportunities for learners. Specifically, this experiment was developed for the Microsoft HoloLens, with several AR models of data visualization. The effectiveness of this application was measured. Preliminary results showed that using augmented reality to visualize network data enhances comprehension of the data, though, results using statistical analysis were inconclusive, and further research is needed to determine whether using AR to visualize streaming data is more efficient than other methods of visualization. However, in spite of the outcome of this research experiment, a pedagogical environment was positively created for learners that most likely increased their involvement in research and learning.", "venue": "SoutheastCon", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-04-01", "journal": {"name": "2019 SoutheastCon", "pages": "1-6"}, "authors": [{"authorId": "145644883", "name": "S. North"}, {"authorId": "2056242194", "name": "Monisha Verma"}, {"authorId": "1557579377", "name": "Sean Saffan"}, {"authorId": "113098137", "name": "Víctor Orellana"}, {"authorId": "1557579380", "name": "Matthew Alyward"}, {"authorId": "2054030189", "name": "Ronald Brooks"}], "citations": [{"paperId": "0ebd551d450a5570b05bf01e8f1a1efa07f2a88d", "title": "Investigation of Cognitive Preference in Augmented Reality Node-Link Diagrams"}, {"paperId": "f8f3bdd1b58b8daa13795e332c246d4097003796", "title": "Data avatars: A theory-guided design and assessment for multidimensional data visualization"}, {"paperId": "e5ed1ecbfb082010f052ae84078a12f3785d8e81", "title": "REALISATION OF REGULATORY REQUIREMENTS FOR EFL TEACHERS ICT-COMPETENCY FORMATION"}]}
