{"paperId": "5d566a6c1741a7ac688ce9034972efebd44f7b3c", "publicationVenue": null, "title": "Type Identification and Feature Selection of Chinese Poor Families Based on Density and Feature Aggregation", "abstract": "The problem of poverty is widespread throughout the world. From the dataset of families to identify poor family types and screen main features. It is of great research significance to take targeted measures in poverty alleviation. In this paper, a clustering method based on density and hierarchy is designed to solve the problem of density inhomogeneity and discontinuous data clustering of poor families. The algorithm divides the dense data into several initial clusters and merges iteratively according to the core-point distance between clusters. Then, we propose a feature selection algorithm based on feature distribution location for the important feature selection problem of multidimensional poverty data. This algorithm locates the locations of various features gathered in the data space according to the Gaussian mixture components, and selects the features with relatively discrete locations as the main features of each category of data. Experiments show that proposed methods can recognize clusters of different densities in the data space and select important features of each category. And the analysis of dataset of Chinese Poor Families provides a basis for further designing targeted measures in poverty alleviation.", "venue": "2021 IEEE 6th International Conference on Cloud Computing and Big Data Analytics (ICCCBDA)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-04-24", "journal": {"name": "2021 IEEE 6th International Conference on Cloud Computing and Big Data Analytics (ICCCBDA)", "pages": "535-540"}, "authors": [{"authorId": "2283816837", "name": "Hui Liu"}, {"authorId": "2029646998", "name": "Jinchong Zhu"}, {"authorId": "2152798937", "name": "Yang Liu"}, {"authorId": "2110044875", "name": "Ran Zhang"}, {"authorId": "2148905359", "name": "Zheng Zhang"}], "citations": []}
