{"paperId": "5d59bb3e7dc8fe0f7aa08e933308f5a52e48ee01", "publicationVenue": {"id": "036e4843-9039-4bf3-a12d-2ee5b12cdee8", "name": "International Conference on Trust, Privacy and Security in Intelligent Systems and Applications", "type": "conference", "alternate_names": ["TPS-ISA", "Int Conf Trust Priv Secur Intell Syst Appl"]}, "title": "Privacy and Security Issues for Human Digital Twins", "abstract": "Digital Twin (DT) technology has recently attracted researchers’ and industries’ interest, becoming popular in many domains thanks to its capability to improve systems performance. This technology comprises a virtual model representing a physical entity. The physical and the virtual twins are connected to allow data sharing, aiming to provide real-time monitoring and decision processes. Human Digital Twins (HDTs) are a particular type of DTs in which the virtual twin models a human being. HDTs are applied, for instance, in healthcare to constantly monitor a patient, allowing medical staff to determine the best treatment on the DT. Although the benefits of DT and HDT are manifold, they suffer from cybersecurity risks that have only recently started to be considered. Moreover, the massive usage of HDTs poses serious privacy issues since HDTs leverage personal information that might be sensitive. In this paper, we aim to illustrate the threats affecting DTs. Then, we focus on specific threats affecting HDTs with a vision towards future research directions.", "venue": "International Conference on Trust, Privacy and Security in Intelligent Systems and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 4th International Conference on Trust, Privacy and Security in Intelligent Systems, and Applications (TPS-ISA)", "pages": "1-9"}, "authors": [{"authorId": "2181819273", "name": "Giorgia Sirigu"}, {"authorId": "1678413", "name": "B. Carminati"}, {"authorId": "88162783", "name": "E. Ferrari"}], "citations": [{"paperId": "1ce081e82da3cd9485ce88df7e1446c2bfdb043a", "title": "Enabling Spatial Digital Twins: Technologies, Challenges, and Future Research Directions"}, {"paperId": "334f7825967278d3b357c46497f6c1708021571c", "title": "Networking Architecture and Key Supporting Technologies for Human Digital Twin in Personalized Healthcare: A Comprehensive Survey"}, {"paperId": "50bf48ecee8e55bf3b0106f36022cc2a77c785c0", "title": "Detecting latent topics and trends of digital twins in healthcare: A structural topic model-based systematic review"}]}
