{"paperId": "5d64241782ccd4cc007a112e3e467082c79930ff", "publicationVenue": {"id": "026f4249-5e18-4b4c-b47a-aa1927ad7498", "name": "Asian Journal of Research in Computer Science", "type": "journal", "alternate_names": ["Asian J Res Comput Sci"], "issn": "2581-8260", "url": "http://www.sciencedomain.org/"}, "title": "A Comprehensive Survey for Hadoop Distributed File System", "abstract": "In the last few days, data and the internet have become increasingly growing, occurring in big data. For these problems, there are many software frameworks used to increase the performance of the distributed system. This software is used for available ample data storage. One of the most beneficial software frameworks used to utilize data in distributed systems is Hadoop. This software creates machine clustering and formatting the work between them. Hadoop consists of two major components: Hadoop Distributed File System (HDFS) and Map Reduce (MR). By Hadoop, we can process, count, and distribute each word in a large file and know the number of affecting for each of them. The HDFS is designed to effectively store and transmit colossal data sets to high-bandwidth user applications. The differences between this and other file systems provided are relevant. HDFS is intended for low-cost hardware and is exceptionally tolerant to defects. Thousands of computers in a vast cluster both have directly associated storage functions and user programmers. The resource scales with demand while being cost-effective in all sizes by distributing storage and calculation through numerous servers. Depending on the above characteristics of the HDFS, many researchers worked in this field trying to enhance the performance and efficiency of the addressed file system to be one of the most active cloud systems. This paper offers an adequate study to review the essential investigations as a trend beneficial for researchers wishing to operate in such a system. The basic ideas and features of the investigated experiments were taken into account to have a robust comparison, which simplifies the selection for future researchers in this subject. \nAccording to many authors, this paper will explain what Hadoop is and its architectures, how it works, and its performance analysis in a distributed systems. In addition, assessing each Writing and compare with each other.", "venue": "Asian Journal of Research in Computer Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-08-23", "journal": {"name": "Asian Journal of Research in Computer Science"}, "authors": [{"authorId": "2121820693", "name": "Karwan Jameel Merceedi"}, {"authorId": "2128096470", "name": "Nareen Abdulla Sabry"}], "citations": [{"paperId": "8a53be6a4d2e85d15649a68e97cdde2f90da6102", "title": "Image Processing Algorithm Design of Agricultural Internet of Things Platform Based on Big Data Analysis"}, {"paperId": "05653baa96346d16a754525d0f4376d3c91fe878", "title": "Design of Multi-priority Message Sending Method Based on Bandwidth State Control"}, {"paperId": "f20f445e849c98300abe71e4e40789a66a8e24eb", "title": "Quantification and analysis of performance fluctuation in distributed file system"}, {"paperId": "2c52a44ce506a9aeaba42ddb946a9a15f5fa67f8", "title": "Construction of a rural tourism information service management system for multi-source heterogeneous data processing"}, {"paperId": "03edbeff6626d714bebe97d759228dc70953c1f2", "title": "Survey of Distributed Computing Frameworks for Supporting Big Data Analysis"}, {"paperId": "97287a4e569690d2736763bd5ae22530918b6b4a", "title": "Building an Effective Classifier for Phishing Web Pages Detection: A Quantum-Inspired Biomimetic Paradigm Suitable for Big Data Analytics of Cyber Attacks"}, {"paperId": "0c9ec2db25ffb0058064d763855c26c80860f6c4", "title": "High-performance fuzzy optimized deep convolutional neural network model for big data classification based on the social internet of things"}, {"paperId": "b82c5184a70d86739a6edafbe9a8c7f3c5f6173b", "title": "Research of the methods of creating content aggregation systems"}]}
