{"paperId": "5d670df2dcd37f635a9dafe3a0d8092a0a5dd632", "publicationVenue": null, "title": "Examining the Core Dilemmas Hindering Big Data-related Transformations in Public-Sector Organisations", "abstract": "Abstract This study examines public organisations planning big data-driven transformations in their service provision. Without radical structural change or managerial system changes, leaders face dilemmas: simply bolting on big data makes little difference. This study is based on a qualitative empirical case study using data collected from the cities of Helsinki and Tampere in Finland. The three core dilemma pairs detected and connected to the big data-related organisational changes are: (1) repetitive continuity vs. visionary change, (2) risk-taking vs. security-seeking and (3) technology-based development vs. human-based development. This study suggests that organisational readiness involves not only capabilities; instead, readiness involves absorbing knowledge, making decisions, handling ambiguities, managing dilemmas. Thus, big data-related transformations in public organisations require embracing the world of dilemmas, since selected and cancelled experiments may each have valuable outcomes. The capability to act on intentions is a prerequisite for readiness; however, a preparedness to detect and address dilemmas is central to big data-related transformations. Thus, the ability to make dilemma decisions is a more complicated characteristic of readiness. In conclusion, our data analysis suggests that traditional public organisational and chance management approaches produce unsolved dilemmas in big data-related organisational changes.", "venue": "", "year": 2019, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2019-12-01", "journal": {"name": "NISPAcee Journal of Public Administration and Policy", "pages": "131 - 156", "volume": "12"}, "authors": [{"authorId": "114838346", "name": "Päivikki Kuoppakangas"}, {"authorId": "143635664", "name": "T. Kinder"}, {"authorId": "2568252", "name": "J. Stenvall"}, {"authorId": "34841341", "name": "I. Laitinen"}, {"authorId": "114441465", "name": "Olli-Pekka Ruuskanen"}, {"authorId": "2102294741", "name": "Pasi-Heikki Rannisto"}], "citations": [{"paperId": "b3cc1f61ad6d06ffa5b53f69926e4c6395e74538", "title": "A brazilian study on data-driven public service readiness"}, {"paperId": "8c72dbc0368b5131104c892eeecbd16b6a20a566", "title": "METHODICAL ASPECTS OF THE PLANNING PROCESSES IN THE PUBLIC SECTOR"}, {"paperId": "6baa5b8ee53d861fb2e53474138af4f817c9a498", "title": "Public Values and Services"}, {"paperId": "7ad619a1141e40804390f2857823299b89551a5b", "title": "Public value and public services in the post-virus economy"}, {"paperId": "d53d29a620383c28095f25c14dc4934a0b85665b", "title": "Digitalization, accounting and accountability: A literature review and reflections on future research in public services"}, {"paperId": "45aebcbf1df7ad6dd3c241a22c6c75d2b7f24f80", "title": "COVID-19 triggering homecare professionals’ change of attitudes towards e-Welfare"}, {"paperId": "9687342a3b41b79ea040a5c1f3da01f35f4cfc45", "title": "Digital Transformation and Organizational Operational Decision Making: A Systematic Review"}]}
