{"paperId": "5d72bd4f2bb102111fcbca4b9877e90416fd5278", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Big Sequence Management: Scaling up and Out", "abstract": "Data series are a prevalent data type that has attracted lots of interest in recent years. Specifically, there has been an explosive interest towards the analysis of large volumes of data series in many different domains. This is both in businesses (e.g., in mobile applications) and in sciences (e.g., in biology). In this tutorial, we focus on applications that produce massive collections of data series, and we provide the necessary background on data series storage, retrieval and analytics. We look at systems historically used to handle and mine data in the form of data series, as well as at the state of the art data series management systems that were recently proposed. Moreover, we discuss the need for fast similarity search for supporting data mining applications, and describe efficient similarity search techniques, indexes and query processing algorithms. Finally, we look at the gap of modern data series management systems in regards to support for efficient complex analytics, and we argue in favor of the integration of summarizations and indexes in modern data series management systems. We conclude with the challenges and open research problems in this domain.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": null, "journal": {"pages": "714-717"}, "authors": [{"authorId": "51935231", "name": "Karima Echihabi"}, {"authorId": "2614982", "name": "Konstantinos Zoumpatianos"}, {"authorId": "1725167", "name": "Themis Palpanas"}], "citations": [{"paperId": "b89d4f8a99f1695dc5b819d01752bb536137dd4e", "title": "FreSh: A Lock-Free Data Series Index"}, {"paperId": "c8065725bb05ede0280f54c6a0dd67c1c92da41e", "title": "Choose Wisely: An Extensive Evaluation of Model Selection for Anomaly Detection in Time Series"}, {"paperId": "256c9978e76871f9cc42d695c9d0ea0acfb90166", "title": "Elpis: Graph-Based Similarity Search for Scalable Data Science"}, {"paperId": "163c06d8d21331edc5aaf68dd9b25f37a58ca980", "title": "Odyssey: A Journey in the Land of Distributed Data Series Similarity Search"}, {"paperId": "30fcde1d6db07b8ce76b0e98ef9d86adba134a59", "title": "ProS: data series progressive k-NN similarity search and classification with probabilistic quality guarantees"}, {"paperId": "1add007a5e7938524605f15fef60c073e259dea4", "title": "Scalable Analytics on Large Sequence Collections"}, {"paperId": "4389b25c1a26fe22d76ce3cf5c8c8e24b5a714a9", "title": "Hercules Against Data Series Similarity Search"}, {"paperId": "49b45a191d4e4301d851fd2c894831abaad28135", "title": "Deep Learning Embeddings for Data Series Similarity Search"}, {"paperId": "e909a45946965274140ae60d5303cd06944fe582", "title": "Electricity Demand Activation Extraction: From Known to Unknown Signatures, Using Similarity Search"}, {"paperId": "8c2881bc91ed242c16da82702145aa1be1172779", "title": "Fast data series indexing for in-memory data"}]}
