{"paperId": "5d753f9126aae0505f106e86be2208c4917b1b25", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Geographic Variations in Dietary Patterns and Their Associations with Overweight/Obesity and Hypertension in China: Findings from China Nutrition and Health Surveillance (2015–2017)", "abstract": "Regional dietetic cultures were indicated in China, but how dietary patterns geographically varied across China is unknown. Few studies systematically investigated the association of dietary patterns with overweight/obesity and hypertension and the potential mechanism with a national sample. This study included 34,040 adults aged 45 years and older from China Nutrition and Health Surveillance (2015–2017), who had complete outcome data, reliable intakes of calorie and cooking oils, unchanged diet habits, and without diagnosed cancer or cardiovascular disease. Outcomes were overweight/obesity and hypertension. By using the Gaussian finite mixture models, four dietary patterns were identified—common rice-based dietary pattern (CRB), prudent diversified dietary pattern (PD), northern wheat-based dietary pattern (NWB), and southern rice-based dietary pattern (SRB). Geographic variations in dietary patterns were depicted by age–sex standardized proportions of each pattern across 31 provinces in China. We assessed the association of these dietary patterns with outcomes and calculated the proportion mediated (PM) by overweight/obesity in the association of the dietary patterns with hypertension. Evident geographic disparities in dietary patterns across 31 provinces were observed. With CRB as reference group and covariates adjusted, the NWB had higher odds of being overweight/obese (odds ratio (OR) = 1.44, 95% confidence interval (CI): 1.36–1.52, p < 0.001) and hypertension (OR = 1.07, 95%CI: 1.01–1.14, p < 0.001, PM = 43.2%), while the SRB and the PD had lower odds of being overweight/obese (ORs = 0.84 and 0.92, 95%CIs: 0.79–0.89 and 0.85–0.99, p < 0.001 for both) and hypertension (ORs = 0.93 and 0.87, 95%CIs: 0.87–0.98 and 0.80–0.94, p = 0.038 for SRB and p < 0.001 for PD, PMs = 27.8% and 9.9%). The highest risk of overweight/obesity in the NWB presented in relatively higher carbohydrate intake (about 60% of energy) and relatively low fat intake (about 20% of energy). The different trends in the association of protein intake with overweight/obesity among dietary patterns were related to differences in animal food sources. In conclusion, the geographic distribution disparities of dietary patterns illustrate the existence of external environment factors and underscore the need for geographic-targeted dietary actions. Optimization of the overall dietary pattern is the key to the management of overweight/obesity and hypertension in China, with the emphasis on reducing low-quality carbohydrate intake, particularly for people with the typical northern diet, and selection of animal foods, particularly for people with the typical southern diet.", "venue": "Nutrients", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-23", "journal": {"name": "Nutrients", "volume": "14"}, "authors": [{"authorId": "2186267728", "name": "Rongping Zhao"}, {"authorId": "2693150", "name": "Liyun Zhao"}, {"authorId": "2149397977", "name": "Xiang Gao"}, {"authorId": "2158031360", "name": "Fan Yang"}, {"authorId": "2144145594", "name": "Yuxiang Yang"}, {"authorId": "8523047", "name": "H. Fang"}, {"authorId": "34926728", "name": "L. Ju"}, {"authorId": "2158753224", "name": "Xiaoli Xu"}, {"authorId": "50830224", "name": "Q. Guo"}, {"authorId": "2116573589", "name": "Shujuan Li"}, {"authorId": "2110251442", "name": "Xue Cheng"}, {"authorId": "2047361525", "name": "Shuya Cai"}, {"authorId": "2955815", "name": "Dongmei Yu"}, {"authorId": "4293906", "name": "G. Ding"}], "citations": [{"paperId": "7d61b2c768e99924a94cc63f45ba19e6414b2f92", "title": "Pro-Inflammatory Diet as a Risk Factor for Stomach Cancer: Findings from a Multicenter Study in Central and Western China"}, {"paperId": "a600d6d10ace3fe5a14815aee69c20ed0ccaa249", "title": "Perceived Determinants of Health-Related Behaviors Among Patients with Coronary Heart Disease After Percutaneous Coronary Intervention: A Longitudinal Qualitative Study"}, {"paperId": "0295944d24e274ce7eac421ee5149f37a9f15975", "title": "Prevalence, associated factors, and gene polymorphisms of obesity in Tibetan adults in Qinghai, China"}, {"paperId": "f89360f79b9175768679b3ae249723d8b069422a", "title": "Association of plant-based dietary patterns with depression and anxiety symptoms in Chinese older adults: A nationwide study."}, {"paperId": "dc006705d0213d0b2d2c5ae75e48e1deee67c835", "title": "Multiple Trajectories of Cereal Consumption and Their Associations with Type 2 Diabetes in Chinese Adults — China, 1997–2018"}, {"paperId": "9d607584451073d28115790d56984870ac5eb9d0", "title": "Higher Adherence to the AMED, DASH, and CHFP Dietary Patterns Is Associated with Better Cognition among Chinese Middle-Aged and Elderly Adults"}, {"paperId": "3556403c370e1f2691d6f0339b4ad5c3e5758370", "title": "Spatial analysis of overweight prevalence in China: exploring the association with air pollution"}, {"paperId": "339ce94609b845cd223b211afeb854e1bb44d97a", "title": "Association of Plant-Based Diet Indices and Abdominal Obesity with Mental Disorders among Older Chinese Adults"}, {"paperId": "d484ac6d7b33bb4eced99b4c292c0bf78feba237", "title": "Rapid increasing burden of diabetes and cardiovascular disease caused by high body mass index in 1.25 million Chinese adults, 2005-2018."}, {"paperId": "56201040bf4cba81e07b9600382fb634f1b95075", "title": "Dietary Fat Intake among Chinese Adults and Their Relationships with Blood Lipids: Findings from China Nutrition and Health Surveillance and Comparison with the PURE Study"}]}
