{"paperId": "5d88d7887a7a30e43740d7a9c7e46aa7267d1eef", "publicationVenue": {"id": "c0f92ff4-75b7-4b7f-9e30-18bb90c87073", "name": "Sustainable Development", "type": "journal", "alternate_names": ["Sustain Dev"], "issn": "0968-0802", "alternate_issns": ["2160-7559"], "url": "http://www.wiley.com/Corporate/Website/Objects/Products/0,9049,566289,00.html", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991719", "https://www.hanspub.org/journal/sd/"]}, "title": "Exploring the nexus between the barriers and drivers for sustainable smart cities in developing countries: The case of Nigeria", "abstract": "Amidst the rapid urbanisation and increasing calls for sustainable development, this study examines the key drivers and barriers influencing sustainable smart city initiatives in Nigeria. By employing a quantitative approach, the research amalgamates insights from diverse professionals, integrating descriptive statistics, exploratory factor analysis, and Spearman rank correlation analysis to illuminate the intricate landscape of sustainable smart city development within the Nigerian context. The findings underscore the interconnected nature of various factors, underscoring the imperative of an all‐encompassing approach that synergistically incorporates infrastructure integration, environmental sustainability, efficient governance, social inclusivity, and economic innovation. Furthermore, identifying specific barriers, including challenges related to integrated urban transformation, socioeconomic equity, and governance and infrastructure, highlights the critical need for precise interventions to surmount these obstacles. The implications and recommendations derived from this study emphasise the pivotal role of collaborative endeavours among diverse stakeholders, accentuating the significance of inclusive decision‐making processes, sustainable environmental practices, and equitable economic expansion. The insights gleaned from this research serve as an invaluable resource for policymakers and urban planners, providing a robust groundwork for informed policy formulation and strategic planning to guide sustainable smart city development in Nigeria and other developing nations.", "venue": "Sustainable Development", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-11", "journal": {"name": "Sustainable Development"}, "authors": [{"authorId": "84289712", "name": "A. Bello"}, {"authorId": "2219527108", "name": "Taofeek Tunde Okanlawon"}, {"authorId": "102170021", "name": "I. Y. Wuni"}, {"authorId": "2044556426", "name": "Suhaib Arogundade"}, {"authorId": "96878377", "name": "L. Oyewobi"}], "citations": [{"paperId": "4770e235a8f102a33954e9c554c748d8f6116e72", "title": "The influence of smart city policy on urban green energy efficiency -- A quasi-natural experiment based on 196 cities"}]}
