{"paperId": "5d929577dbceb7e1e30ce725e39223bbdd284d4d", "publicationVenue": {"id": "6c1a00cb-4b59-44d6-a887-bfd7c5b3768f", "name": "International Conference on Industrial Technology", "type": "conference", "alternate_names": ["ICIT", "Int Conf Ind Technol", "IEEE Int Conf Integr Technol", "IEEE International Conference on Integration Technology"]}, "title": "A Survey on Computation Offloading for Vehicular Edge Computing", "abstract": "Vehicular Edge Computing (VEC) is a promising new paradigm that has received a lot of attention recently. Computation Offloading (CO) can migrate computing tasks to the network edge of VEC, which is critical for mobile applications that are sensitive to computation power. However, the dynamicity and randomness of Internet of Vehicles (IoV) lead to new features and challenges in vehicular computation offloading. Therefore, we focus on the CO in VEC. This paper depicts a broad methodical literature analysis of CO scheme and CO methods in VEC domains and divides the current works of CO into various categories. The methodical analysis of this research will help researchers to find the important characteristics of CO and select the most appropriate algorithm for computing tasks. Challenges and research directions have also been suggested in this paper.", "venue": "International Conference on Industrial Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2019-12-20", "journal": {"name": "Proceedings of the 2019 7th International Conference on Information Technology: IoT and Smart City"}, "authors": [{"authorId": "2113986759", "name": "Shuang Yuan"}, {"authorId": "9102331", "name": "Yanfang Fan"}, {"authorId": "2111025989", "name": "Ying Cai"}], "citations": [{"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain."}, {"paperId": "b9535bffaa438340e72a334a1abb4a4979d5ebec", "title": "PPO2: Location Privacy-Oriented Task Offloading to Edge Computing Using Reinforcement Learning for Intelligent Autonomous Transport Systems"}, {"paperId": "d7f59f78262471bed4fe4b7601aab527dc4bc2d8", "title": "A Survey on Task Partitioning and Scheduling for Vehicular Edge Computing"}, {"paperId": "f8afda0f5010c4d205797727c8a09c65c145d7d8", "title": "Vehicular Edge-Computing Framework for Making Use of Parking and Charging Electric Vehicles"}, {"paperId": "32c375bbc14bd06963b9a35f745e82297dcc90b7", "title": "Computation offloading and content caching and delivery in Vehicular Edge Network: A survey"}, {"paperId": "94104b69a27054a0d0b123c10441330eca915372", "title": "A survey on computation resource allocation in IoT enabled vehicular edge computing"}, {"paperId": "579a32c52664a8e370ddf82e0850e0561f4c1665", "title": "A review of edge computing: Features and resource virtualization"}, {"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks"}, {"paperId": "7de82ad5a4e1434de57250952de79f096bc3acae", "title": "Intelligent Computation Offloading and Pricing Strategies in UAV-Enabled MEC Network for Utility Maximization: A Survey"}]}
