{"paperId": "5da63e8a8bb2439bc799c5b349bff58fc3ed2bbd", "publicationVenue": null, "title": "Comparison of data-driven landslide susceptibility assessment using weight of evidence, information value, frequency ratio and certainly factor methods", "abstract": "Landslide susceptibility assessment is essential for development activities and disaster management in the mountainous regions to identify the landslide-prone areas. The present study aimed to evaluate and compare the efficacy of data driven quantitative models of landslide susceptibility assessment using geospatial tools in Jhelum valley of the Himalayas. This area suffers from extreme rainfall events due to the local climate and has experienced significant and widespread landslide events in recent years. Four probabilistic data-driven models are employed for this purpose, which includes the weight of evidence (WOE), information value method (IVM), frequency ratio (FR), and certainty factor (CF). These assessed models are based on integrating landslide contributing factors and a ground truthing-based landslide inventory of 437 landslides. The landslide susceptibility maps were presented by categorizing the study area into very low to very high susceptibility zone by Jenks natural breaks method. The performance of models was evaluated by a sensitivity analysis using Receiver Operator Curve (ROC) method. The ROCvalidated results of success rate curves for WOE, IVM, FR and CF were 80 %, 78 %, 77 %, and 76 % respectively. The prediction rate curve of WOE, IVM, FR, and CF was 78 %, 77 %, 75 %, and 78 % respectively. The results showed the reasonable efficiency of applied models for landslide susceptibility assessment in the study area and applicable to regions with similar geomorphological conditions. Conclusively, the comparison of applied models revealed the promising results of used approaches. ARTICLE INFO", "venue": "", "year": 2021, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2021-06-06", "journal": {"name": "Acta Geodynamica et Geomaterialia", "pages": "301-317", "volume": ""}, "authors": [{"authorId": "49712987", "name": "Salman Farooq"}], "citations": [{"paperId": "1cbd08364fc7a3d1026ff5e79a3af781f971e8aa", "title": "Efficacy of Landslide Susceptibility Maps Prepared Using Different Bivariate Methods: Case Study from Mussoorie Township, Garhwal Himalaya"}, {"paperId": "0c233662765deb5c2de0e73c5cb949c0677f3c68", "title": "Spatiotemporal landslide susceptibility mapping using machine learning models: A case study from district Hattian Bala, NW Himalaya, Pakistan"}]}
