{"paperId": "5db2b2e7618b01a342107764226c1ccb2fc97b69", "publicationVenue": {"id": "bea6dbb8-4367-4c35-8e28-e749f3ad107c", "name": "International Conference on Database Theory", "type": "conference", "alternate_names": ["Int Conf Database Theory", "ICDT"], "url": "http://alpha.luc.ac.be/~lucp1080/icdt/"}, "title": "23rd International Conference on Database Theory, ICDT 2020, March 30-April 2, 2020, Copenhagen, Denmark", "abstract": "Probabilistic databases are commonly known in the form of the tuple-independent model, where the validity of every tuple is an independent random event. Conceptually, the notion is more general, as a probabilistic database refers to any probability distribution over ordinary databases. A central computational problem is that of marginal inference for database queries: what is the probability that a given tuple is a query answer? In this talk, I will discuss recent developments in several research directions that, collectively, position probabilistic databases as the common and natural foundation of various challenges at the core of data analytics. Examples include reasoning about uncertain preferences from conventional distributions such as the Mallows model, data cleaning and repairing in probabilistic paradigms such as the HoloClean system, and the explanation of query answers through concepts from cooperative game theory such as the Shapley value and the Banzhaf Power Index. While these challenges manifest different facets of probabilistic databases, I will show how they interrelate and, moreover, how they relate to the basic theory of inference over tuple-independent databases. 2012 ACM Subject Classification Theory of computation → Incomplete, inconsistent, and uncertain databases; Mathematics of computing → Probabilistic representations; Information systems → Data model extensions", "venue": "International Conference on Database Theory", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"volume": "155"}, "authors": [{"authorId": "144350265", "name": "C. Lutz"}, {"authorId": "1804478", "name": "J. C. Jung"}], "citations": [{"paperId": "4ed0161867a97ea7fb6f00ea0668c68312f3ce31", "title": "Optimal (Euclidean) Metric Compression"}]}
