{"paperId": "5dcdb4af96d7129b0c3b7077cca9a2ce4c28c937", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "The Impact of Higher-Order Interactions on the Synchronization of Hindmarsh–Rose Neuron Maps under Different Coupling Functions", "abstract": "In network analysis, links depict the connections between each pair of network nodes. However, such pairwise connections fail to consider the interactions among more agents, which may be indirectly connected. Such non-pairwise or higher-order connections can be signified by involving simplicial complexes. The higher-order connections become even more noteworthy when it comes to neuronal network synchronization, an emerging phenomenon responsible for the many biological processes in real-world phenomena. However, involving higher-order interactions may considerably increase the computational costs. To confound this issue, map-based models are more suitable since they are faster, simpler, more flexible, and computationally more optimal. Therefore, this paper addresses the impact of pairwise and non-pairwise neuronal interactions on the synchronization state of 10 coupled memristive Hindmarsh–Rose neuron maps. To this aim, electrical, inner linking, and chemical synaptic functions are considered as two- and three-body interactions in three homogeneous and two heterogeneous cases. The results show that through chemical pairwise and non-pairwise synapses, the neurons achieve synchrony with the weakest coupling strengths.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-22", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "1642325072", "name": "Mahtab Mehrabbeik"}, {"authorId": "2061583862", "name": "Atefeh Ahmadi"}, {"authorId": "9390477", "name": "F. Bakouie"}, {"authorId": "32791079", "name": "A. Jafari"}, {"authorId": "144643832", "name": "S. Jafari"}, {"authorId": "49028974", "name": "D. Ghosh"}], "citations": [{"paperId": "fd43ae8dfa1ad6ce4ff49cffb0db2ecd85686ec3", "title": "Dynamical analysis of a network of bistable energy harvesters with higher-order interactions"}, {"paperId": "b2abb995db86b8666118de5e3ba30da7db517662", "title": "Effects of high-order interactions on synchronization of a fractional-order neural system"}, {"paperId": "01787ad4ecacdcc6aebc7b4caf6a1759435fd588", "title": "Synchronization in simplicial complexes of memristive Rulkov neurons"}, {"paperId": "451ecd1981df62f87d8bf16de7a956477c12751f", "title": "The influence of synaptic pathways on the synchronization patterns of regularly structured mChialvo map network."}, {"paperId": "2353e6c452edce8c93ea578af8233a59024f2439", "title": "Theoretical Analysis of the Brain and Artificial Intelligence"}]}
