{"paperId": "5dd2273903222b400e7b8d9a48473a01a465bb52", "publicationVenue": null, "title": "Recent Advances in Edge Computing for 6G", "abstract": "Edge computing is a new technology that enables 6G development by bringing cloud capabilities closer to end users to overcome traditional cloud flaws such as high latency and a lack of security. Few studies identify recent advances, challenges, and opportunities in 6G edge computing. As a result, this paper presents a review to identify recent advances in edge computing in 6G. It also discusses the challenges and opportunities of such new trends in the computing landscape. The paper identifies challenges (security and privacy, offloading and task division, bandwidth, service management, advanced communication, general-purpose computing on edge nodes, quantum computing and edge computing, and IoT heterogeneous platforms) as well as opportunities (academic-industry collaborations, algorithms and libraries that are lightweight and virtualization and micro-operating systems). Finally, some conclusions have been drawn after identifying current research directions.", "venue": "2022 International Conference on Intelligent Technology, System and Service for Internet of Everything (ITSS-IoE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-03", "journal": {"name": "2022 International Conference on Intelligent Technology, System and Service for Internet of Everything (ITSS-IoE)", "pages": "1-6"}, "authors": [{"authorId": "2156467678", "name": "Abdulwadood Alawadhi"}, {"authorId": "102330835", "name": "Abdullah Almogahed"}], "citations": [{"paperId": "d4a1dc6746c8ba568bc37824b11095bf841144b1", "title": "Deep Learning Techniques in Mobile Edge Computing for Internet of Medical Things"}, {"paperId": "8b4672d7cee1838329a6ba79e796f1ea866b0e3b", "title": "Towards Edge Computing for 6G Internet of Everything: Challenges and Opportunities"}, {"paperId": "59022f7156a9cc71146facec96c872563a1e8fed", "title": "A Survey on IEEE 802.15.7 MAC Protocols for Visible Light Communication"}]}
