{"paperId": "5ddd998bc3d0ce0018176ec7e802b00fa40b84de", "publicationVenue": {"id": "1ecade67-d628-4a45-810d-3c607c052ec8", "name": "International Journal of Climate Change Strategies and Management", "type": "journal", "alternate_names": ["Int J Clim Chang Strateg Manag"], "issn": "1756-8692", "url": "https://www.emerald.com/insight/publication/issn/1756-8692", "alternate_urls": ["http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=ijccsm"]}, "title": "Disaster and risk management in outdoor recreation and tourism in the context of climate change", "abstract": "\nPurpose\nThe increasing frequency and intensity of the extreme weather events could cause devastating consequences in tourism. Climate change–related extreme weather events and their relation to tourism is an emerging field for education and research. The purpose of this study is to categorize the impact of climate change on tourist destinations with regard to extreme weather-related risks in outdoor recreation and tourism. Managerial implications for policymakers and stakeholders are discussed.\n\n\nDesign/methodology/approach\nTo outline the risks from climate change associated with tourism, this study uses the Prisma analysis for identification, screening, checking for eligibility and finding relevant literature for further categorization.\n\n\nFindings\nBased on a thoroughly examination of relevant literature, risks and threats posed by climate change could be categorized into following four areas: reduced experiential value in outdoor winter recreation; reduced value in beach scenery and comfort; land degradation and reduced biodiversity; and reduced value in personal safety and comfort in tourism. It also focuses on the significance of using big data applications in catastrophic disaster management and risk reduction. Recommendations with technology and data analytics to continuously improve the disaster management process in tourism education are provided based on findings of this study.\n\n\nOriginality/value\nPrimary contributions of this study include the following: providing a summarized overview of the risks associated with climate change in terms of tourist experiential value for educational implications; and revealing the role of data analytics in disaster management in the context of tourism and climate change for tourism education.\n", "venue": "International Journal of Climate Change Strategies and Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-29", "journal": {"name": "International Journal of Climate Change Strategies and Management"}, "authors": [{"authorId": "17100152", "name": "J. L. Hsu"}, {"authorId": "2112564066", "name": "Pankaja Sharma"}], "citations": [{"paperId": "b54a3edcc7ffe707f9e1697032a17c77145afe09", "title": "Tourist Comfort And Safety Study Case Study: Ogan Komering Ilir District"}]}
