{"paperId": "5ddfc39247c916a1b64132e94b69a37909be4be0", "publicationVenue": {"id": "b9083d6f-6a0b-458f-b91b-ac82b9afdf3c", "name": "ACM SIGOPS Operating Systems Review", "type": "journal", "alternate_names": ["ACM SIGOPS Oper Syst Rev", "Operating Systems Review", "Oper Syst Rev"], "issn": "0163-5980", "url": "http://portal.acm.org/sigops/newsletter"}, "title": "A Deeper Dive into Pattern-Aware Subgraph Exploration with PEREGRINE", "abstract": "Graph mining workloads aim to extract structural properties of a graph by exploring its subgraph structures. PEREGRINE is a general-purpose graph mining system that provides a generic runtime to efficiently explore subgraph structures of interest and perform various graph mining analyses. It takes a 'pattern-aware' approach by incorporating a pattern-based programming model along with efficient pattern matching strategies. The programming model enables easier expression of complex graph mining use cases and enables PEREGRINE to extract the semantics of patterns. By analyzing the patterns, PEREGRINE generates efficient exploration plans which it uses to guide its subgraph exploration. In this paper, we present an in-depth view of the patternanalysis techniques powering the matching engine of PEREGRINE. Beyond the theoretical foundations from prior research, we expose opportunities based on how the exploration plans are evaluated, and develop key techniques for computation reuse, enumeration depth reduction, and branch elimination. Our experiments show the importance of patternawareness for scalable and performant graph mining where the presented new techniques speed up the performance by up to two orders of magnitude on top of the benefits achieved from the prior theoretical foundations that generate the initial exploration plans.", "venue": "ACM SIGOPS Operating Systems Review", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-02", "journal": {"name": "ACM SIGOPS Operating Systems Review", "pages": "1 - 10", "volume": "55"}, "authors": [{"authorId": "83274914", "name": "Kasra Jamshidi"}, {"authorId": "34986234", "name": "Keval Vora"}], "citations": [{"paperId": "31d03b23b3ab36e8f79642777e704ed88366777d", "title": "Graph Pattern Mining Paradigms: Consolidation and Renewed Bearing"}, {"paperId": "4a321b971c77355cb70e763bfea05e430b6b29b7", "title": "Everest: GPU-Accelerated System For Mining Temporal Motifs"}, {"paperId": "53c4182dfd692fbf7e35a3f753842db5153b759d", "title": "Accelerating Graph Mining Systems with Subgraph Morphing"}, {"paperId": "afa3dd52f1ac721d41e658be28ad8e45b1792023", "title": "Mint: An Accelerator For Mining Temporal Motifs"}, {"paperId": "dc71694f9c25744c856c90fe66b40bab09910cc3", "title": "Anti-vertex for neighborhood constraints in subgraph queries"}, {"paperId": "adbb5d0a264772b32c8aaed9a1bf178afd7a3ec5", "title": "NDMiner: accelerating graph pattern mining using near data processing"}]}
