{"paperId": "5de4a9ef5b2b0297de8072d999f1043e67eb7f11", "publicationVenue": null, "title": "Design and behavior science in government-to-citizens cognitive-communication: a study towards an inclusive framework", "abstract": "\nPurpose\nThe purpose of this paper is to describe the application of design and behavior science collectively in refining the government to citizens’ (G2C) cognitive-communication by using artificial intelligence (AI) artifacts. It investigates the citizens’ behavior intention to use AI cognitive-communication channels in e-government services.\n\n\nDesign/methodology/approach\nThis study reveals the potential of unification in design and behavior science paradigms when integrated into AI artifacts in measuring the constructive outcome of proposed architecture that embraces the perceived risk and trust in citizens’ usage behavior intentions. To evaluate the practical relevance of design science paradigm, action research was incorporated by developing an app as an exemplified scenario.\n\n\nFindings\nThe weaknesses of traditional G2C channel communication obliterated by AI virtual agents. This study proposes a five-layer architecture model created with citizens-centered design highlighting the improved relevance for G2C cognitive-communication. The behavior model supports citizens’ usage behavior intentions through trust as a positive attribute and negative attribute as a perceived risk.\n\n\nResearch limitations/implications\nThis study contributes to the knowledge of design science paradigm particularly to AI-based cognitive G2C communication. The architecture serves for deploying virtual agents to automate the public officials for decision-making processes. The authors have constructed a cognitive-communication model and have examined the relationships among the extents of cognitive-communication model. This channel has the potential to significantly transform G2C cognitive and intelligent communication.\n\n\nPractical implications\nThis cognitive-communication channel has the potential to significantly transform the communication between government and citizens. Such a model can be an interest of developers, researchers and government policymakers in a holistic approach drawn from theory and methods of both design and behavior science to create a successful communication scenario.\n\n\nSocial implications\nAdvances in technology are not without social implications. The study results can dramatically improve the efficiencies of government workplaces and can augment the human working. It will help to reduce the government services discriminations among the citizens and contribute to society through social inclusion.\n\n\nOriginality/value\nThis study addresses the duality in information system research by first defining the theoretical framework for G2C cognitive-communication architecture and then developing a research model drawn upon a citizens’ service usage behavioral theory. It will also contribute to providing important perceptions of AI practices in the public sector.\n", "venue": "", "year": 2021, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2021-02-15", "journal": {"name": "Transforming Government: People, Process and Policy", "volume": ""}, "authors": [{"authorId": "1392167630", "name": "Sohail Raza Chohan"}, {"authorId": "2091560997", "name": "Guangwei Hu"}, {"authorId": "153675723", "name": "A. U. Khan"}, {"authorId": "81681007", "name": "A. Pasha"}, {"authorId": "2142075975", "name": "Muhammad Atif Sheikh"}], "citations": [{"paperId": "b79582a30670d9665ef53dd49d423de5482dfa3f", "title": "Public administration managers' and employees' perceptions of adaptability to change under “the future of work” paradigm"}, {"paperId": "f838fbeca0a0e5c072ce141c8fda98430eba4e6e", "title": "Trends and challenges of e-government chatbots: Advances in exploring open government data and citizen participation content"}, {"paperId": "d45e1cbdb1eb5d50d7e587b957314d2ca780b695", "title": "Artificial intelligence in local government services: Public perceptions from Australia and Hong Kong"}, {"paperId": "17fd536ea9081d68a61fb29624ae4d7ae576bddf", "title": "Measuring perception towards AI-based chatbots in Insurance Sector"}, {"paperId": "cffa9a603a25435f567081d736e85e649e474e14", "title": "A Conversational Agent for Argument-driven E-participation"}, {"paperId": "f52cff54c37b55d167903609f8d599ffac3c7c65", "title": "Factors fostering the success of IoT services in academic libraries: a study built to enhance the library performance"}, {"paperId": "8fb871b0db4899a1cc7a9bd6215a6db2b61c30da", "title": "Harnessing the Potential of Artificial Intelligence to Foster Citizens' Satisfaction: An empirical study on India"}]}
