{"paperId": "5df74a8eee4c1e98e562083fb92f2072ed3132fd", "publicationVenue": null, "title": "Expert Systems With Applications", "abstract": "The first case of novel Coronavirus (COVID-19) was reported in December 2019 in Wuhan City, China and led to an international outbreak. This virus causes serious respiratory illness and affects several other organs of the body differently for different patient. Worldwide, several waves of this infection have been reported, and researchers/doctors are working hard to develop novel solutions for the COVID diagnosis. Imaging and vision-based techniques are widely explored for the prediction of COVID-19; however, COVID infection percentage estimation is under explored. In this work, we propose a novel framework for the estimation of COVID-19 infection percentage based on deep learning techniques. The proposed network utilizes the features from vision transformers and CNN (Convolutional Neural Networks), specifically EfficientNet-B7. The features of both are fused together for preparing an information-rich feature vector that contributes to a more precise estimation of infection percentage. We evaluate our model on the Per-COVID-19 dataset (Bougourzi et al., 2021b) which comprises labeled CT data of COVID-19 patients. For the evaluation of the model on this dataset, we employ the most widely-used slice-level metrics, i.e., Pearson correlation coefficient (PC), Mean absolute error (MAE), and Root mean square error (RMSE). The network outperforms the other state-of-the-art methods and achieves 0 . 9886 ± 0 . 009 , 1 . 23 ± 0 . 378 , and 3 . 12 ± 1 . 56 , PC, MAE, and RMSE, respectively, using a 5-fold cross-validation technique. In addition, the overall average difference in the actual and predicted infection percentage is observed to be < 2% . In conclusion, the detailed experimental results reveal the robustness and efficiency of the proposed network.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "87712604", "name": "Joohi Chauhan"}, {"authorId": "2175479697", "name": "Jatin Bedi"}], "citations": [{"paperId": "9c71dda80bd4bc204a336fce0dd35b0529ccae08", "title": "A feature extraction and time warping based neural expansion architecture for cloud resource usage forecasting"}, {"paperId": "413ca29fe3b4d04d40bb2f97274c92408304df19", "title": "A TransSE-ResNet Deep Learning Model with Multi-Head Attention Mechanism for Covid-19 Chest CT Image Classification"}]}
