{"paperId": "5dfb90a551710b3c586b353d7bf8346069b28da6", "publicationVenue": {"id": "7e6222b3-5405-42a2-a1ad-538d7078d6d9", "name": "Network", "type": "journal", "alternate_names": ["Network: Computation In Neural Systems", "Netw Comput Neural Syst"], "issn": "0085-3909", "alternate_issns": ["0954-898X", "2673-8732", "0093-3341"], "url": "https://www.mdpi.com/journal/network", "alternate_urls": ["http://www.informahealthcare.com/net"]}, "title": "Golden eagle based improved Att-BiLSTM model for big data classification with hybrid feature extraction and feature selection techniques.", "abstract": "The remarkable development in technology has led to the increase of massive big data. Machine learning processes provide a way for investigators to examine and particularly classify big data. Besides, several machine learning models rely on powerful feature extraction and feature selection techniques for their success. In this paper, a big data classification approach is developed using an optimized deep learning classifier integrated with hybrid feature extraction and feature selection approaches. The proposed technique uses local linear embedding-based kernel principal component analysis and perturbation theory, respectively, to extract more representative data and select the appropriate features from the big data environment. In addition, the feature selection task is fine-tuned by using perturbation theory through heuristic search based on their output accuracy. This feature selection heuristic search method is analysed with five recent heuristic optimization algorithms for deciding the final feature subset. Finally, the data are categorized through an attention-based bidirectional long short-term memory classifier that is optimized with a golden eagle-inspired algorithm. The performance of the proposed model is experimentally verified on publicly accessible datasets. From the experimental outcomes, it is demonstrated that the proposed framework is capable of classifying large datasets with more than 90% accuracy.", "venue": "Network", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-28", "journal": {"name": "Network", "pages": "\n          1-36\n        "}, "authors": [{"authorId": "2084319318", "name": "Gnanendra Kotikam"}, {"authorId": "6811652", "name": "Lokesh Selvaraj"}], "citations": []}
