{"paperId": "5e0f01e96972da87d9277124640194a69c45d738", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "Leveraging Dependency in Scheduling and Preemption for High Throughput in Data-Parallel Clusters", "abstract": "Task scheduling and preemption are two important functions in data-parallel clusters. Though directed acyclic graph task dependencies are common in data-parallel clusters, previous task scheduling and preemption methods do not fully utilize such task dependency to increase throughput since they simply schedule precedent tasks prior to their dependent tasks or neglect the dependency. We notice that in both scheduling and preemption, choosing a task with more dependent tasks to run allows more tasks to be runnable next, which facilitates to select a task that can more increase throughput. Accordingly, in this paper, we propose a Dependency-aware Scheduling and Preemption system (DSP) to achieve high throughput. First, we build an integer linear programming model to minimize the makespan (i.e., the time when all jobs finish execution) with the consideration of task dependency and deadline, and derive the target server and start time for each task, which can minimize the makespan. Second, we utilize task dependency to determine tasks' priorities for preemption. Finally, we propose a method to reduce the number of unnecessary preemptions that cause more overhead than the throughput gain. Extensive experimental results based on a real cluster and Amazon EC2 cloud service show that DSP achieves much higher throughput compared to existing strategies.", "venue": "IEEE International Conference on Cluster Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "359-369"}, "authors": [{"authorId": "46700058", "name": "Jinwei Liu"}, {"authorId": "37217705", "name": "Haiying Shen"}, {"authorId": "34085283", "name": "Ankur Sarker"}, {"authorId": "2291828", "name": "Wingyan Chung"}], "citations": [{"paperId": "90ffdf502015ffd34179d645b8b644b05a8852ac", "title": "Sailfish: A Dependency-Aware and Resource Efficient Scheduling for Low Latency in Clouds"}, {"paperId": "2fcc79b406cb3bbc3d1695573e28bdaebba8d6ec", "title": "A survey on correlation and its structural analysis method for failure factors in cloud service"}, {"paperId": "9c1b979b8ba820a712e3198f5cede008a89acbbd", "title": "On the Potential of Execution Traces for Batch Processing Workload Optimization in Public Clouds"}, {"paperId": "5ae45e37ee42481fd2da44e45e4348ad1a301733", "title": "A workflow based approach for task scheduling in cloud environment"}, {"paperId": "c3475ee837a22ddd21a5cb6f4cbf21b1bb66259b", "title": "SwiftS: A Dependency-Aware and Resource Efficient Scheduling for High Throughput in Clouds"}, {"paperId": "9a764c225150b4e2c0685f2f42874c2f6edefff0", "title": "TraceSplitter: a new paradigm for downscaling traces"}, {"paperId": "78696e87f57f8a03a8f33fbfbe53a12d0b522df7", "title": "Graph Deep Factors for Forecasting"}]}
