{"paperId": "5e109c425f12d04393a20f367b8e04e2ded4a341", "publicationVenue": {"id": "54c34256-7049-4afc-ad8d-f2b68cca0a45", "name": "SouthEast European Design Automation, Computer Engineering, Computer Networks and Social Media Conference", "type": "conference", "alternate_names": ["SEEDA-CECNSM", "Southeast Eur Des Autom Comput Eng Comput Netw Soc Media Conf"]}, "title": "Recent Advances On Ontology Similarity Metrics: A Survey", "abstract": "With the advent of Semantic Web and the recent advances in the field of knowledge discovery more effort is placed not only on constructing or automatically discovering ontologies but also on determining similarities between ontologies. The latter is usually achieved by a higher order metric taking as input two ontologies in an enhanced graph form and yielding a scalar as a result. This input format allows a considerable degree of flexibility, as the inherently distributed nature of graphs allows the construction of elaborate schemes. Since it is impossible to capture all the essential parameters of an ontology in a single number and given that ontological requirements vary across different domains, it follows that a plethora of such metrics exist. This survey examines the most representative categories of ways for evaluating the similarity between ontology pairs with emphasis placed on the domain of digital culture.", "venue": "SouthEast European Design Automation, Computer Engineering, Computer Networks and Social Media Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-09-01", "journal": {"name": "2020 5th South-East Europe Design Automation, Computer Engineering, Computer Networks and Social Media Conference (SEEDA-CECNSM)", "pages": "1-7"}, "authors": [{"authorId": "2724842", "name": "G. Drakopoulos"}, {"authorId": "32213005", "name": "Yorghos Voutos"}, {"authorId": "1684455", "name": "Phivos Mylonas"}], "citations": [{"paperId": "620444dbf3bdfd0199c1f585c3064fdb3e0e89ec", "title": "Semantic alignment of ontologies meaningful categories with the generalization of descriptive structures"}, {"paperId": "c99ac1e32bbff98eeacff43b21f920c79067663c", "title": "Pattern Recognition and Event Detection on IoT Data-streams"}, {"paperId": "252adee453645a5ff531a317006c818d489aed7e", "title": "Application of a methodological approach to compare ontologies"}, {"paperId": "3ff32f46fbb789507671a9c1716a7695dd33ae1f", "title": "Annotation-Assisted Clustering of Player Profiles in Cultural Games: A Case for Tensor Analytics in Julia"}]}
