{"paperId": "5e10e03df6d96faa00c6693874f3544ef5ea5f77", "publicationVenue": {"id": "3d58f8bf-fe41-4b9c-84c4-5c4299f3041e", "name": "IEEE Latin America Transactions", "type": "journal", "alternate_names": ["IEEE Lat Am Trans"], "issn": "1548-0992", "url": "https://www.ewh.ieee.org/reg/9/etrans/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9907", "http://ieeexplore.ieee.org/servlet/opac?punumber=9907"]}, "title": "Assessment of Noise Impact on Hybrid Adaptive Computational Intelligence Multisensor Data Fusion Applied to Real-Time UAV Autonomous Navigation", "abstract": "Recent work have successfully employed a low-cost Multisensor Data Fusion application based on Hybrid Adaptive Computational Intelligence (HACI) — the cascaded use of Fuzzy-based Computational Intelligence algorithms. The methodology has been shown able to improve considerably the accuracy of current positioning estimation systems for real-time Unmanned Aerial Vehicle (UAV) autonomous navigation — which are not robust — reducing the error in more than 45.19%. However, HACI methodology was found to have a sensitivity to noise in some parts of the estimated trajectories and, therefore, loss of performance. The problem is that none of these recent work assesses the impact of noise present on input signals and the potential benefits of their treatment prior to fusion itself. This is the main contribution of this work. Noise treatment is performed in two approaches: noise removal and noise filtering. It has been shown that for the studied dataset, the noise has a negative impact and that the chosen techniques are capable of adequately handling the noise so as to improve the original GPS precision by almost 57%.", "venue": "IEEE Latin America Transactions", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-02-01", "journal": {"name": "IEEE Latin America Transactions", "pages": "295-302", "volume": "18"}, "authors": [{"authorId": "51927760", "name": "Ângelo de Carvalho Paulino"}, {"authorId": "145712401", "name": "L. Guimarães"}, {"authorId": "2786646", "name": "E. H. Shiguemori"}], "citations": [{"paperId": "767563d0f81d59d8e4a9d9b2de39d788586376e2", "title": "Safety assessment method for power operation environment based on multi-source data fusion"}, {"paperId": "0a8a08a4dc290ac8c274dae6e95c35435b8e7494", "title": "Application of Virtual Reality Based on Multisensor Data Fusion in Theater Space and Installation Art"}, {"paperId": "c67b9416bc4684fb26235ed10413f0c87af4c625", "title": "Data Mining-Based Tracking Method for Multisource Target Data of Heterogeneous Networks"}, {"paperId": "41c80a7d72769c79263a62b7540328a703852295", "title": "Implementation of MapReduce parallel computing framework based on multi-data fusion sensors and GPU cluster"}, {"paperId": "f4790bf11faec0ad3ad039f4c952bd3faab39365", "title": "Guest Editorial Special Issue on Embedded Systems"}]}
