{"paperId": "5e17efeccd3c7657d5779a2cf28e0219d5f1e759", "publicationVenue": {"id": "37c80589-6689-4f17-a250-d6ce14e71f25", "name": "IEEE International Conference on Wireless and Mobile Computing, Networking and Communications", "type": "conference", "alternate_names": ["WiMob", "IEEE International Conference on Wireless and Mobile Computing, Networking, and Communications", "Wirel Mob Comput Netw Commun", "Wireless and Mobile Computing, Networking and Communications", "IEEE Int Conf Wirel Mob Comput Netw Commun"], "issn": "2160-4886", "url": "http://www.wikicfp.com/cfp/program?id=3077", "alternate_urls": ["http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1001404"]}, "title": "Puzzle-based auction mechanism for spectrum sharing in cognitive radio networks", "abstract": "In this work we investigate an auction mechanism for sharing available wireless bandwidth among competing cognitive radios. The bandwidth under consideration may be either in an unlicensed spectrum or in an unused licensed band. Spectrum sharing is achieved via a mechanism in which a cognitive radio acting as the auctioneer advertises spectrum availability to bidding cognitive radios and defines a puzzle to solve as a method to access it. The cognitive radios act as bidders by computing the solution to the problem (i.e., the “puzzle”). The winner is the bidder who submits the first correct bid and thus gains access to the spectrum for the next time interval. We consider two different variances of our scheme based on parallelizable and non-parallelizable problems and demonstrate that the latter provides a fair auction in contrast to the former. We propose a verification database to counter malicious “greedy” players. Our algorithm provides a centralized, easy-to-implement, and computationally fast multiple-access scheme that is verifiable by all participating cognitive radios.", "venue": "IEEE International Conference on Wireless and Mobile Computing, Networking and Communications", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-10-01", "journal": {"name": "2016 IEEE 12th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob)", "pages": "1-6"}, "authors": [{"authorId": "2563579", "name": "K. Kotobi"}, {"authorId": "3558119", "name": "P. Mainwaring"}, {"authorId": "2882348", "name": "S. Bilén"}], "citations": [{"paperId": "cc778ef9866f7fd68894d02463802710210451c2", "title": "Smart contract-based secure cooperative spectrum sensing algorithm"}, {"paperId": "f9f32f833acb8a3b8be73c716110f3404eb4156c", "title": "Bandcoin: Using Smart Contracts to Automate Mobile Network Bandwidth Roaming Agreements"}, {"paperId": "3ebeb95faf56e5097c4fc893658dc226c878ce96", "title": "Sensing-Mining-Access Tradeoff in Blockchain-Enabled Dynamic Spectrum Access"}, {"paperId": "eaee97343b17ce7692b13bc9cbe02a99687a90aa", "title": "Blockchain-Enabled Dynamic Spectrum Access: Cooperative Spectrum Sensing, Access and Mining"}, {"paperId": "22374af155dffe0c00d0faccfc506f15f6716b11", "title": "Blockchain for Dynamic Spectrum Management"}, {"paperId": "1041640fdfcd0c3aebdf36881c9585206b5a0faa", "title": "Secure Blockchains for Dynamic Spectrum Access: A Decentralized Database in Moving Cognitive Radio Networks Enhances Security and User Access"}, {"paperId": "613d5120ab1923e4c05c31af66839359cca4fdc9", "title": "Spectrum sharing via hybrid cognitive players evaluated by an M/D/1 queuing model"}, {"paperId": "951e1fd3cab55ed17930732d27adbb4d79478dd6", "title": "Blockchain-enabled spectrum access in cognitive radio networks"}, {"paperId": "073a9eb9e0dd69907610c6078e5333e5745dba7c", "title": "Reputation-Aware Relay Selection With Opportunistic Spectrum Access: A Blockchain Approach"}, {"paperId": "67684d1a4fe652edee8b1763b97e1c23b11a7107", "title": "FORK-JOIN QUEUE MODELING AND OPTIMAL SCHEDULING IN PARALLEL PROGRAMMING FRAMEWORKS"}, {"paperId": "604ad4b553e030989506be12319c2d951f8bb9eb", "title": "SRML: Space Radio Machine Learning"}, {"paperId": "610d9a45667e650f95cfeed46a6a56ede3c81b7c", "title": "On Distributed Estimation for Resource Constrained Wireless Sensor Networks"}]}
