{"paperId": "5e34085f67aaa599cad88acbe09132f43db48a15", "publicationVenue": null, "title": "A Learning Based Human Interaction Modeling Using Mobile Sensing", "abstract": "Online social networks are emerging as a convenient platform where users build social relations with other individuals having similar interests, family/work background, etc. However, existing human interaction modeling is based on social graphs which are not more precise for friend suggestions in real-life. In this paper, we leverage the basic feats of deep learning for developing human interaction system, named MyCompanion, based on the user's lifestyle/activity information collected using the mobile crowd sensing. We collect a user's local knowledge, such as local information, ambient, and activity type, activity location and activity time. Then, the collected information is further aggregated and transferred to the deep learning enabled cloud server for user's daily schedule/activities analysis. We propose a schedule matching algorithm which finds the similarity among individuals' activities w.r.t. their activity type, activity time and activity location to recommend the most suitable friend(s) to the users. We develop a real-time testbed to perform a spatio-temporal analysis of the collected data from the users' smartphones. We also perform several experiments for evaluating the system performance. Our proof-of-concept prototype shows the usability of the proposed system.", "venue": "2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "pages": "1049-1058"}, "authors": [{"authorId": "6674523", "name": "Tarun Kulshrestha"}, {"authorId": "144109422", "name": "Divya Saxena"}, {"authorId": "1780647", "name": "R. Niyogi"}], "citations": []}
