{"paperId": "5e39c0032d6ae6a63cd29171979021fb7714fc45", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "A Decentralised Persistent Identification Layer for DCAT Datasets", "abstract": "The Data Catalogue Vocabulary (DCAT) standard is a popular RDF vocabulary for publishing metadata about data catalogs and a valuable foundation for creating Knowledge Graphs. It has widespread application in the (Linked) Open Data and scientific communities. However, DCAT does not specify a robust mechanism to create and maintain persistent identifiers for the datasets. It relies on Internationalized Resource Identifiers (IRIs), that are not necessarily unique, resolvable and persistent. This impedes findability, citation abilities, and traceability of derived and aggregated data artifacts. As a remedy, we propose a decentralized identifier registry where persistent identifiers are managed by a set of collaborative distributed nodes. Every node gives full access to all identifiers, since an unambiguous state is shared across all nodes. This facilitates a common view on the identifiers without the need for a (virtually) centralized directory. To support this architecture, we propose a data model and network methodology based on a distributed ledger and the W3C recommendation for Decentralized Identifiers (DID). We implemented our approach as a working prototype on a five-peer test network based on Hyperledger Fabric.", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-04-30", "journal": {"name": "Companion Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "38736614", "name": "Fabian Kirstein"}, {"authorId": "122609514", "name": "A. Altenbernd"}, {"authorId": "3446997", "name": "Sonja Schimmler"}, {"authorId": "1733076", "name": "M. Hauswirth"}], "citations": [{"paperId": "7f208ee29f413fa7f5e0ee90af6f5b23991cac9c", "title": "Framework to Automatically Determine the Quality of Open Data Catalogs"}]}
