{"paperId": "5e3a44f8f0b4267d79377d1f948500f65fe76726", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Challenges, Applications and Design Aspects of Federated Learning: A Survey", "abstract": "Federated learning (FL) is a new technology that has been a hot research topic. It enables the training of an algorithm across multiple decentralized edge devices or servers holding local data samples without exchanging them. There are many application domains in which considerable properly labeled and complete data are not available in a centralized location (e.g., doctors’ diagnoses from medical image analysis). There are also growing concerns over data and user privacy, as artificial intelligence is becoming ubiquitous in new application domains. As such, much research has recently been conducted in several areas within the nascent field of FL. Various surveys on different subtopics exist in the current literature, focusing on specific challenges, design aspects, and application domains. In this paper, we review existing contemporary works in related areas to understand the challenges and topics emphasized by each type of FL survey. Furthermore, we categorize FL research in terms of challenges, design factors, and applications, conducting a holistic review of each and outlining promising research directions.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "124682-124700", "volume": "9"}, "authors": [{"authorId": "2127931218", "name": "K. Rahman"}, {"authorId": "2147216571", "name": "Faisal Ahmed"}, {"authorId": "117257680", "name": "Nazma Akhter"}, {"authorId": "144134763", "name": "M Zahid Hasan"}, {"authorId": "1379511298", "name": "Ruhul Amin"}, {"authorId": "2126915625", "name": "Kazi Ehsan Aziz"}, {"authorId": "122890378", "name": "A. Islam"}, {"authorId": "1806836", "name": "Md. Saddam Hossain Mukta"}, {"authorId": "2146978883", "name": "A. N. Islam"}], "citations": [{"paperId": "77e98a88835c06449cb7b48815e2fa849605f407", "title": "Federated learning for 5G and beyond, a blessing and a curse- an experimental study on intrusion detection systems"}, {"paperId": "b0f8dcd079f3e885ca6318f49048d748d985690d", "title": "Communication Efficiency and Non-Independent and Identically Distributed Data Challenge in Federated Learning: A Systematic Mapping Study"}, {"paperId": "3d7dade66cffceaabd4624065becdfa25876f137", "title": "Security of Federated Learning in 6G Era: A Review on Conceptual Techniques and Software Platforms used for Research and Analysis"}, {"paperId": "3ba7810f54a0d658a3b53252066d064faaa0fd86", "title": "Differential privacy preserved federated learning for prognostic modeling in COVID-19 patients using large multi-institutional chest CT dataset."}, {"paperId": "66961439942151659b89e9e130fd333575f52b7d", "title": "Federated Learning based Flow Aware AQM for 5G Networks and Beyond"}, {"paperId": "95d39a1bcc5026cfca04d9499a5024863b934e1b", "title": "Unified fair federated learning for digital healthcare"}, {"paperId": "4edb9d8097d6236b5fb9488190c852ff65302a18", "title": "A Review of Federated Learning in Agriculture"}, {"paperId": "0ce891908c88656d81d769b605f7445de2b5e638", "title": "A Survey on IoT-Edge-Cloud Continuum Systems: Status, Challenges, Use Cases, and Open Issues"}, {"paperId": "08df3dd93c3e9d82fcdc58fe5d70d7a67342efff", "title": "An End-Process Blockchain-Based Secure Aggregation Mechanism Using Federated Machine Learning"}, {"paperId": "857e154215e7e70c798cb80f576f9e43fdb1f39f", "title": "Federated learning inspired privacy sensitive emotion recognition based on multi-modal physiological sensors"}, {"paperId": "318f6a6cd221514b5026b5e7a5a64ddb0abdcf74", "title": "Split Federated Learning for 6G Enabled-Networks: Requirements, Challenges, and Future Directions"}, {"paperId": "ee0a002aafc366a65e93bc4a5b3f5a840a6c7e94", "title": "Differential privacy preserved federated transfer learning for multi-institutional 68Ga-PET image artefact detection and disentanglement"}, {"paperId": "225ebfcc85eccd523d02eb96a2fb1a58d86d9820", "title": "Federated learning vulnerabilities, threats and defenses: A systematic review and future directions"}, {"paperId": "7e555856fc97b669379b0989a8c50097e4f607ed", "title": "A Survey for Federated Learning Evaluations: Goals and Measures"}, {"paperId": "dcc8ca9230274c46f7b0e0ee8d2b269b93c762c7", "title": "Multi-institutional PET/CT image segmentation using federated deep transformer learning"}, {"paperId": "b545c5922114bbca666e25b8b6b26ba510f7997b", "title": "Federated Learning for Medical Image Analysis: A Survey"}, {"paperId": "6be779081ff232764314ab76ce5a30d2696e9045", "title": "Federated Learning for Beginners: Types, Simulation Environments, and Open Challenges"}, {"paperId": "86e11c64f8730fd0d019cab82470384b81e879be", "title": "A systematic review of privacy techniques in recommendation systems"}, {"paperId": "9e002ff246b1817740c8de53730a29d35cd4986a", "title": "Reviewing Federated Learning Aggregation Algorithms; Strategies, Contributions, Limitations and Future Perspectives"}, {"paperId": "7ab8a3276e0cff8f49a587ce6830ce3de760bada", "title": "Natural Language–Based Conceptual Modelling Frameworks: State of the Art and Future Opportunities"}, {"paperId": "d8dcf5eb6dd4b242dfedb4535bc66fcb682bc194", "title": "Tactile internet of federated things: Toward fine-grained design of FL-based architecture to meet TIoT demands"}, {"paperId": "24e4542357ba53364b8e718747184284e6b40d10", "title": "HFedDI: A novel privacy preserving horizontal federated learning based scheme for IoT device identification"}, {"paperId": "d408229aa0aeeacf8ac4d76476f9f2115c5c2ce5", "title": "Applications of Federated Learning in Manufacturing: Identifying the Challenges and Exploring the Future Directions with Industry 4.0 and 5.0 Visions"}, {"paperId": "46ee81606e9c9cbcc73f3534df6d72df0a0ae542", "title": "Reviewing Federated Machine Learning and Its Use in Diseases Prediction"}, {"paperId": "ddac52628e45db777ecc866c45a6236149de44d0", "title": "Federated learning for smart cities: A comprehensive survey"}, {"paperId": "cd7b8555ae9befce3e194563d41f8184a197b893", "title": "Towards Privacy Preserving and Efficiency in Fog Selection for Federated Learning"}, {"paperId": "0f8dea3cbd1ac39df7849b33bf9cc381f731524e", "title": "Federated Learning for Condition Monitoring of Industrial Processes: A Review on Fault Diagnosis Methods, Challenges, and Prospects"}, {"paperId": "e7bd63df07502602b27a1c8d312c145663b65dba", "title": "Enabling Awareness of Quality of Training and Costs in Federated Machine Learning Marketplaces"}, {"paperId": "22e7ad7513c2d84462ed6f52d830eae43f49727d", "title": "Client Selection in Federated Learning: Principles, Challenges, and Opportunities"}, {"paperId": "d4aa4b299dd58db5948a5eb9ead56c5771c29458", "title": "Optimized Multi-Service Tasks Offloading for Federated Learning in Edge Virtualization"}, {"paperId": "5d058b35c1b75e80845b8c8f88d5457c1d65c8eb", "title": "Federated Learning and Meta Learning: Approaches, Applications, and Directions"}, {"paperId": "42e80df13f963d3d84bb9a235bb45e00ef87e60d", "title": "Federated and Meta learning over Non-Wireless and Wireless Networks: A Tutorial"}, {"paperId": "0abe83f67c2602a40365f29ec55558d7fb2d964f", "title": "On Sample Complexity of Learning Shared Representations: The Asymptotic Regime"}, {"paperId": "4dc6c5a9615a71aa6274595ddcce999ee58002b4", "title": "Federated learning-based AI approaches in smart healthcare: concepts, taxonomies, challenges and open issues"}, {"paperId": "314f0255536714e43908a64b510cc3adecfb521e", "title": "A Review of Federated Learning in Energy Systems"}, {"paperId": "60029ccf556cd3894578f931d633fe7cde58e7a7", "title": "A Novel Approach on Machine Learning based Data Warehousing for Intelligent Healthcare Services"}, {"paperId": "dac53713a4f7478525cc4b8279458abc53a262e9", "title": "FLaMAS: Federated Learning Based on a SPADE MAS"}, {"paperId": "8d20e3f4f11e757d99259e3bd1b2dfc4366d15f1", "title": "Federated Learning from Small Datasets"}, {"paperId": "658204db9dbbbcb9e6cb737e0bcd33c89506c536", "title": "A survey of federated learning approach for the Sustainable Development aspect: eLearning"}, {"paperId": "c1244cbc14c563f1d36ee71ec10b4ca8196bffe4", "title": "A Survey on Machine Learning Techniques for Massive MIMO Configurations: Application Areas, Performance Limitations and Future Challenges"}, {"paperId": "bb6921be77e4ba92d1e8daba0af610a948f1f4ad", "title": "Blockchain for medical collaboration: A federated learning-based approach for multi-class respiratory disease classification"}, {"paperId": "cb0e45aad77eb231332fd05096556b055033636a", "title": "Winning through Collaboration by Applying Federated Learning in Manufacturing Industry"}, {"paperId": "deaffe6e9f664bf74885ce873b19b0c84dc132f9", "title": "A Systematic Review on Federated Learning in Medical Image Analysis"}, {"paperId": "b77acb37c475922e283d999e4ed2ce3c73fd568f", "title": "Adversarial examples for poisoning attacks against federated learning"}, {"paperId": "170a0dd567b69bea63993ee8472f063f6b126826", "title": "PolyFLAG_SVM: a Polymorphic Federated Learning Aggregation of Gradients Support Vector Machines Framework"}, {"paperId": "aea782583a9867272a0b2ddb1628b48e6458c94e", "title": "Federated Multi-Task Learning: An Overview and Quantitative Evaluation"}, {"paperId": "cd68faed58a9158dd8c63cf852d52edd34ae322e", "title": "Collabo: A Collaborative Machine Learning Model and Its Application to the Security of Heterogeneous Medical Data in an IoT Network"}, {"paperId": "23ce6d4343039bec9cd1aa62a893e428d95e6b70", "title": "Federated Learning Design and FunctionalModels: Survey"}]}
