{"paperId": "5e4338e7f2c6c0f6ec4bbacae36c26b6116fdc2a", "publicationVenue": {"id": "c866e00a-4c78-46a1-8e73-f59e7706af43", "name": "ACM-SIGPLAN International Conference on Principles and Practice of Declarative Programming", "type": "conference", "alternate_names": ["Princ Pract Declar Program", "ACM-SIGPLAN Int Conf Princ Pract Declar Program", "PPDP", "Principles and Practice of Declarative Programming"], "url": "https://dl.acm.org/conference/ppdp/proceedings"}, "title": "Towards Elastic Incrementalization for Datalog", "abstract": "Various incremental evaluation strategies for Datalog have been developed that reuse computations for small input changes. These methods assume that incrementalization is always a better strategy than recomputation. However, in real-world applications such as static program analysis, recomputation can be cheaper than incrementalization for large updates. This work introduces an elastic incremental approach with two strategies that can be selected based on the impact of the input change. The first strategy is a Bootstrap strategy that recomputes the entire result for high-impact changes. The second is an Update strategy that performs an incremental update for low-impact changes. Our approach allows for a lightweight Bootstrap strategy suitable for high-impact changes, with the trade-off that Update may require more work for small changes. We demonstrate our approach using real-world applications and compare our elastic incremental approach to existing methods.", "venue": "ACM-SIGPLAN International Conference on Principles and Practice of Declarative Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-09-06", "journal": {"name": "Proceedings of the 23rd International Symposium on Principles and Practice of Declarative Programming"}, "authors": [{"authorId": "48805779", "name": "David Zhao"}, {"authorId": "2672375", "name": "Pavle Subotić"}, {"authorId": "2780408", "name": "Mukund Raghothaman"}, {"authorId": "144650318", "name": "Bernhard Scholz"}], "citations": [{"paperId": "95637d34079d3c4ca5bd35c57e0dc1c46ce8c493", "title": "Flan: An Expressive and Efficient Datalog Compiler for Program Analysis"}, {"paperId": "e6340d7ee329cdb920718705833a7e9753a4b280", "title": "Program Repair Guided by Datalog-Defined Static Analysis"}, {"paperId": "86e4f56e9115590b484da77fdb9b8c5a6c5918ec", "title": "DCLINK: Bridging Data Constraint Changes and Implementations in FinTech Systems"}, {"paperId": "a60410d2cb280b116c4f016105e63e8ac870efbc", "title": "Incrementalizing Production CodeQL Analyses"}, {"paperId": "51c9bbd911344f228d8fadaead507b13923d8eee", "title": "Incremental Processing of Structured Data in Datalog"}]}
