{"paperId": "5e59cf6c746e28407c2ced3ccd2912005b7e5e82", "publicationVenue": {"id": "16af62c2-a30d-476c-87c8-9f5e501179f5", "name": "Journal of Medical Imaging", "type": "journal", "alternate_names": ["J med imaging", "J Med Imaging", "Journal of medical imaging"], "issn": "2329-4302", "url": "https://www.spiedigitallibrary.org/journals/journal-of-medical-imaging", "alternate_urls": ["http://medicalimaging.spiedigitallibrary.org/journal.aspx"]}, "title": "Impact of JPEG 2000 compression on deep convolutional neural networks for metastatic cancer detection in histopathological images", "abstract": "Abstract. The availability of massive amounts of data in histopathological whole-slide images (WSIs) has enabled the application of deep learning models and especially convolutional neural networks (CNNs), which have shown a high potential for improvement in cancer diagnosis. However, storage and transmission of large amounts of data such as gigapixel histopathological WSIs are challenging. Exploiting lossy compression algorithms for medical images is controversial but, as long as the clinical diagnosis is not affected, is acceptable. We study the impact of JPEG 2000 compression on our proposed CNN-based algorithm, which has produced performance comparable to that of pathologists and which was ranked second place in the CAMELYON17 challenge. Detecting tumor metastases in hematoxylin and eosin-stained tissue sections of breast lymph nodes is evaluated and compared with the pathologists’ diagnoses in three different experimental setups. Our experiments show that the CNN model is robust against compression ratios up to 24:1 when it is trained on uncompressed high-quality images. We demonstrate that a model trained on lower quality images—i.e., lossy compressed images—depicts a classification performance that is significantly improved for the corresponding compression ratio. Moreover, it is also observed that the model performs equally well on all higher-quality images. These properties will help to design cloud-based computer-aided diagnosis (CAD) systems, e.g., telemedicine that employ deep CNN models that are more robust to image quality variations due to compression required to address data storage and transmission constraints. However, the results presented are specific to the CAD system and application described, and further work is needed to examine whether they generalize to other systems and applications.", "venue": "Journal of Medical Imaging", "year": 2019, "fieldsOfStudy": ["Engineering", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "Journal of Medical Imaging", "pages": "027501 - 027501", "volume": "6"}, "authors": [{"authorId": "114434263", "name": "Farhad Ghazvinian Zanjani"}, {"authorId": "1784334", "name": "S. Zinger"}, {"authorId": "3419453", "name": "B. Piepers"}, {"authorId": "2105445", "name": "Saeed Mahmoudpour"}, {"authorId": "1808586", "name": "P. Schelkens"}, {"authorId": "122835730", "name": "P. D. De with"}], "citations": [{"paperId": "e3e813e154da3dea7ea8e0d47542164ffc87a8b4", "title": "Robustness evaluation of deep neural networks for endoscopic image analysis: Insights and strategies."}, {"paperId": "88377cc9ee849081fcb5500c30c891f7f271185f", "title": "Streamlined Hybrid Annotation Framework using Scalable Codestream for Bandwidth-Restricted UAV Object Detection"}, {"paperId": "1ef7be939fd52fb5cd2b0c087a2b0500815136b4", "title": "Algorithm-assisted diagnosis of Hirschsprung’s disease – evaluation of robustness and comparative image analysis on data from various labs and slide scanners"}, {"paperId": "67dc71cc9b8b4b562ebc0c2cabc204320ae66042", "title": "Publicly available datasets of breast histopathology H&E whole-slide images: A scoping review."}, {"paperId": "56b34dae663096428a9eb48c90962bc14e85ef47", "title": "Tissue contamination challenges the credibility of machine learning models in real world digital pathology"}, {"paperId": "6ec3cac930f49cc09deb788f6592f9ba23f63974", "title": "Artificial Intelligence in Melanoma Dermatopathology: A Review of Literature."}, {"paperId": "758f5e7b595a2d37250c33372ed853b5cff22084", "title": "Comparative Analysis of Image Encoders and Compression Effects on Machine Task Performance"}, {"paperId": "70f898450734ea2f1cd85b45dc2b7ef0e6fafdfa", "title": "Novel Integer Shmaliy Transform and New Multiparametric Piecewise Linear Chaotic Map for Joint Lossless Compression and Encryption of Medical Images in IoMTs"}, {"paperId": "3932cc4ff0a91147ff484e22e6156dc7c5c6755d", "title": "Deep‐learning based classification of a tumor marker for prognosis on Hodgkin's disease"}, {"paperId": "2fd2e861aab61ce2565942889502e0b9d003ca2a", "title": "Pathological changes or technical artefacts? The problem of the heterogenous databases in COVID-19 CXR image analysis"}, {"paperId": "d27d48de2d5ee5ef7aa26cd5a6dad6839a2fcf6b", "title": "Tissue contamination challenges the credibility of machine learning models in real world digital pathology"}, {"paperId": "2a18b9d19f3380cf48136bd4f592a749c620d673", "title": "Digital pathology whole slide image compression with vector quantized variational autoencoders"}, {"paperId": "0295494644d0160d0bcf4da65e4d8aef579979de", "title": "Impact of Video Compression on the Performance of Object Detection Systems for Surveillance Applications"}, {"paperId": "74009c57ded629bf5cae2021805fbdd0f693f331", "title": "Data Models for Dataset Drift Controls in Machine Learning With Optical Images"}, {"paperId": "838733b65054ab160d9a8e23e60bcfe6050bf48d", "title": "Computer-Aided Cancer Diagnosis via Machine Learning and Deep Learning: A comparative review"}, {"paperId": "221bbee1bfd58518185e846ec16f21da019ad36a", "title": "How to learn with intentional mistakes: NoisyEnsembles to overcome poor tissue quality for deep learning in computational pathology"}, {"paperId": "a69d2ccb0c7f0d7597753320d59abd1b1d5f833c", "title": "Does lossy image compression affect racial bias within face recognition?"}, {"paperId": "be3c27d728aaaccede184809296f826331dea9cf", "title": "Expert training: Enhancing AI resilience to image coding artifacts"}, {"paperId": "ef1c6a7955ec2894ef9b405401db3409e71bbfeb", "title": "Impact of Image Compression on the Performance of Steel Surface Defect Classification with a CNN"}, {"paperId": "8871868be9ecfc71b21cd6b6b06cf66c3bc38608", "title": "Breast cancer intelligent analysis of histopathological data: A systematic review"}, {"paperId": "632963123bc45d17ad96b9e3de224f4723f48117", "title": "Quality control stress test for deep learning-based diagnostic model in digital pathology"}, {"paperId": "608e85380c095f84ff3868515554ed1f7c1032df", "title": "Impact of image compression on deep learning-based mammogram classification"}, {"paperId": "00fef39a765c85111db8bf1b244ea11e5921cd02", "title": "Improved 3D U-Net robustness against JPEG 2000 compression for male pelvic organ segmentation in radiotherapy"}, {"paperId": "277160105484ac2986955176cfccb20d98189677", "title": "Impact of Pixel Scaling on Classification Accuracy of Dermatological Skin Disease Detection"}, {"paperId": "4bd3d2931532b69244d8eb36a521976025a4a70f", "title": "Recognition of Cutaneous Melanoma on Digitized Histopathological Slides via Artificial Intelligence Algorithm"}, {"paperId": "9051bbcb6e3692c0f3652f10a1d76ed2598a0069", "title": "On the Impact of Lossy Image and Video Compression on the Performance of Deep Convolutional Neural Network Architectures"}, {"paperId": "a4f51d652d70bf2fb0e19985114841c23d9213d4", "title": "Efficient I/O for Neural Network Training with Compressed Data"}, {"paperId": "84ef1603307d6a48333cc03a6dc75071017ca3e2", "title": "Quantitative Assessment of the Effects of Compression on Deep Learning in Digital Pathology Image Analysis"}, {"paperId": "a09751a7570c4074c35f25557ad9c179756a2b4a", "title": "Personalized risk prediction of symptomatic intracerebral hemorrhage after stroke thrombolysis using a machine-learning model"}, {"paperId": "58229c28af74d3a0de745aaad0b8d693c197b7c8", "title": "Publicly available datasets of breast histopathology H&E whole-slide images: A systematic review"}, {"paperId": "77446408f377a1998c5352b510825365a081eba6", "title": "Data Models for Dataset Drift Controls in Machine Learning With Images"}, {"paperId": "7396296f6a87a6705130b88d3e3e24efe33d4802", "title": "Whole Slide Image Quality in Digital Pathology: Review and Perspectives"}, {"paperId": "41c2cc047c0486a737d6d92a68ef6c76ef5f501b", "title": "Using Learned Image Compression for Training Accurate and Robust Convolutional Neural Networks"}]}
