{"paperId": "5e5d687360658b50d04bf2538a1e1be4783fd33e", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Understanding the Effect of Deplatforming on Social Networks", "abstract": "Aiming to enhance the safety of their users, social media platforms enforce terms of service by performing active moderation, including removing content or suspending users. Nevertheless, we do not have a clear understanding of how effective it is, ultimately, to suspend users who engage in toxic behavior, as that might actually draw users to alternative platforms where moderation is laxer. Moreover, this deplatforming efforts might end up nudging abusive users towards more extreme ideologies and potential radicalization risks. In this paper, we set to understand what happens when users get suspended on a social platform and move to an alternative one. We focus on accounts active on Gab that were suspended from Twitter and Reddit. We develop a method to identify accounts belonging to the same person on these platforms, and observe whether there was a measurable difference in the activity and toxicity of these accounts after suspension. We find that users who get banned on Twitter/Reddit exhibit an increased level of activity and toxicity on Gab, although the audience they potentially reach decreases. Overall, we argue that moderation efforts should go beyond ensuring the safety of users on a single platform, taking into account the potential adverse effects of banning users on major platforms.", "venue": "Web Science Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-06-21", "journal": {"name": "Proceedings of the 13th ACM Web Science Conference 2021"}, "authors": [{"authorId": "2115268816", "name": "Shiza Ali"}, {"authorId": "2113416988", "name": "Mohammad Hammas Saeed"}, {"authorId": "2114545393", "name": "Esraa Aldreabi"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "2064581974", "name": "Emiliano De Cristofaro"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "2350947", "name": "G. Stringhini"}], "citations": [{"paperId": "2b52a59e57fc6709fef4ad82f2300514f0c87bcf", "title": "The Effects of Group Sanctions on Participation and Toxicity: Quasi-experimental Evidence from the Fediverse"}, {"paperId": "b30e47b6459502227c74a9b41304e5ce10aed6fe", "title": "Intellectual dark web, alt-lite and alt-right: Are they really that different? a multi-perspective analysis of the textual content produced by contrarians"}, {"paperId": "4c8d91483b54f66e8e036619b2490f569860ddfd", "title": "Key to Kindness: Reducing Toxicity In Online Discourse Through Proactive Content Moderation in a Mobile Keyboard"}, {"paperId": "43de11ef1ac04b3597a0a70011fd63ca3a05a972", "title": "Deplatforming Norm-Violating Influencers on Social Media Reduces Overall Online Attention Toward Them"}, {"paperId": "377c18211858e855a200a154b93fb5899ae6fcde", "title": "Content Moderation on Social Media in the EU: Insights From the DSA Transparency Database"}, {"paperId": "e7da5a734b084491d2060e9d7fbe2b336aa4ad7a", "title": "Technological Solutions to Online Toxicity: Potential and Pitfalls"}, {"paperId": "03ffb14ee587cf63dbec3d7bf57bf5a05679b721", "title": "When a Language Question Is at Stake. A Revisited Approach to Label Sensitive Content"}, {"paperId": "de82c0e640646086a462b2fca99a82625c60cc1d", "title": "Sadness, Anger, or Anxiety: Twitter Users' Emotional Responses to Toxicity in Public Conversations"}, {"paperId": "21c93fd80e0b2826e9e7d14578b8087695d6ecee", "title": "Content Moderation and the Formation of Online Communities: A Theoretical Framework"}, {"paperId": "f1269db14771485d06e64940a05c5d95e4eb36ce", "title": "Impact of Stricter Content Moderation on Parler's Users' Discourse"}, {"paperId": "938b52a1ab3e4ad6c380fadfb7ba3053c2428af0", "title": "ConvEx: A Visual Conversation Exploration System for Discord Moderators"}, {"paperId": "dc8d6bd3df8093a349d9efddc08e6988bc2a3e89", "title": "“I Just Didn’t Notice It:” Experiences with Misinformation Warnings on Social Media amongst Users Who Are Low Vision or Blind"}, {"paperId": "c971d17a9da8e24ded5d210ad2fa3b56fcd2b675", "title": "The efficacy of Facebook's vaccine misinformation policies and architecture during the COVID-19 pandemic."}, {"paperId": "3e9ffe04b67e7a49deee26de23775570bbc4256c", "title": "A First Look at User-Controlled Moderation on Web3 Social Media: The Case of Memo.cash"}, {"paperId": "182edb9aad4a7168689aef96be2eb245bf621d77", "title": "Ausgerechnet Algorithmen"}, {"paperId": "977b7214856aa54ab03ab31fa321f4bd646e63c5", "title": "TUBERAIDER: Attributing Coordinated Hate Attacks on YouTube Videos to their Source Communities"}, {"paperId": "8688fcb4cf38ff01af9d6d19f9b3b571c0cd74a4", "title": "The Dark Threads That Weave the Web of Shame: A Network Science-Inspired Analysis of Body Shaming on Reddit"}, {"paperId": "8aa227d4e391344d71eddbed5c2090d91d45ec72", "title": "Does Deplatforming Work?"}, {"paperId": "dfd9143250337d5c8eb1aa3127006b606070b06a", "title": "Identifying Themes of Right-Wing Extremism in Hindutva Discourse on Twitter"}, {"paperId": "baf2806051b2add7bdb2db970d223acc9239baec", "title": "Drivers of social influence in the Twitter migration to Mastodon"}, {"paperId": "3dddc0f7d839d4a7dd0aa220a2772896ea2c7414", "title": "No Easy Way Out: The Effectiveness of Deplatforming an Extremist Forum to Suppress Hate and Harassment"}, {"paperId": "53283f3ccf0db648c246fbe016f9cffd120a714d", "title": "The Interconnected Nature of Online Harm and Moderation: Investigating the Cross-Platform Spread of Harmful Content between YouTube and Twitter"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "6f40a37360333fb6fac5a3e67d853ae932a34436", "title": "Examining the Production of Co-active Channels on YouTube and BitChute"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "81f72b257470b659cffe5e08117d4c37169525b9", "title": "On the rise of fear speech in online social media"}, {"paperId": "a1cfc04ec39a11bedd5c1db01c39c1f742339157", "title": "Deplatforming did not decrease Parler users’ activity on fringe social media"}, {"paperId": "3d56ed8cc71be713ec13e6db307464394c74662d", "title": "“There’s so much responsibility on users right now:” Expert Advice for Staying Safer From Hate and Harassment"}, {"paperId": "71c87991816027cfd84e4b1a3786c710dcedee28", "title": "Fight Fire with Fire: Hacktivists' Take on Social Media Misinformation"}, {"paperId": "47a1930329ce5a9b148ea4d97b1f29f77c9841a4", "title": "New Threats to Society from Free-Speech Social Media Platforms"}, {"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "7613072f78d9f1a8d333036b1c45967f4868f0cb", "title": "Do social media undermine social cohesion? A critical review"}, {"paperId": "6ce5e6fc425306bbd3d9ca659dbf7c78f42c6c33", "title": "How can we combat online misinformation? A systematic overview of current interventions and their efficacy"}, {"paperId": "f4586e3dbd70218af8ef421fa9d4ebbf9aa0bd04", "title": "Estimating Geographic Spillover Effects of COVID-19 Policies From Large-Scale Mobility Networks"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}, {"paperId": "ac3d5fca66f3ca4a11562825ea14700bd3f6c892", "title": "Panoptik Sonrası Dünyada Küresel Hegemonyanın Sosyal Medya Üzerinden Değerlendirilmesi: Donald Trump Vakasının Betimsel Analizi"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "0fab8c7556bb1c3478e6eb000313f35fc0af7617", "title": "Identifying and Characterizing Behavioral Classes of Radicalization within the QAnon Conspiracy on Twitter"}, {"paperId": "960b140c034fad4151a51ba45bc2ec18dbbae06c", "title": "How does Twitter account moderation work? Dynamics of account creation and suspension on Twitter during major geopolitical events"}, {"paperId": "33f263658568ebf2cd986d46bd48e7c34bbf2a0e", "title": "One Year of COVID-19 Vaccine Misinformation on Twitter: Longitudinal Study"}, {"paperId": "fe5315179776edeb8f74aff223e77fe7e4269339", "title": "Politicization and Radicalization of Discourses in the Alt-Tech Ecosystem: A Case Study on Gab Social"}, {"paperId": "6e63212def0783609b76727282ac0545dc00a6c6", "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement, and Research to Practice"}, {"paperId": "269af7a41800db30d49fcdcaee75268f207f2a33", "title": "Understanding Effects of Moderation and Migration on Online Video Sharing Platforms"}, {"paperId": "9f0db7b4ef4b92e982d1b278633fc09d3814582c", "title": "Finding Qs: Profiling QAnon Supporters on Parler"}, {"paperId": "2c05d09446ae4755e58ba36ab8fba73eeb2cf28b", "title": "Conspiracy Brokers: Understanding the Monetization of YouTube Conspiracy Theories"}, {"paperId": "390246fc7c1b3ef2441fa9af5e7b7ec6f2c9e12e", "title": "Permissionlessness"}, {"paperId": "7db34479b8ca59bec403eb3042b1783d199d2c2d", "title": "Characterizing YouTube and BitChute Content and Mobilizers During U.S. Election Fraud Discussions on Twitter"}, {"paperId": "6e3c3d94bdab82e077bcf131848000be8356ba36", "title": "Characterizing Reddit Participation of Users Who Engage in the QAnon Conspiracy Theories"}, {"paperId": "563d9985190d13530e516aa5ca38e0bb786ed2d1", "title": "Characterizing, Detecting, and Predicting Online Ban Evasion"}, {"paperId": "89682d59c048e365a85995cd7814dfdce939def4", "title": "Towards Re-Decentralized Future of the Web: Privacy, Security and Technology Development"}, {"paperId": "abc12bed0853575949b7b9ef0a934dfe77300b5b", "title": "Soros, Child Sacrifices, and 5G: Understanding the Spread of Conspiracy Theories on Web Communities"}, {"paperId": "fd8357c94fa12e3dc6effac39e12bc747b7cab03", "title": "Reddit and the Fourth Estate: Exploring the magnitude and effects of media influence on community level moderation on Reddit"}, {"paperId": "57ed3397af003b4245ae9a127dfa7bf91fd66129", "title": "Evaluating the Effectiveness of Deplatforming as a Moderation Strategy on Twitter"}, {"paperId": "4818745b74521cc18e8bbfe55ce237ba8cab88dc", "title": "An Early Look at the Gettr Social Network"}, {"paperId": "4fe799f455b80791e58f3240d63b80028f8bad26", "title": "Deplatforming the Far-right: An Analysis of YouTube and BitChute"}, {"paperId": "e13560574a0912e35fc969ec9f4ff86b9f35a65a", "title": "Fringe News Networks: Dynamics of US News Viewership following the 2020 Presidential Election"}, {"paperId": "9eeac84d278a183f9f04d823d1386a3b355953c6", "title": "Individual-Level Moderating and Differential Effects of Deplatforming"}, {"paperId": "e6f08d161a2b8d367de11d9882a55cd998c5456c", "title": "Cross­Platform Reactions to the Post­January 6 Deplatforming"}, {"paperId": "7649bf74ce96faadd5dbaba989c3f83024bdfd04", "title": "Tactics, Threats & Targets: Modeling Disinformation and its Mitigation"}, {"paperId": "5c2db48fd56b9c096909c4f202f285f617a166e0", "title": "Migrating Counterpublics: German Far-Right Online Groups on Russian Social Media"}, {"paperId": "bc936fef1c0eeaf18ae901d4c91ecffa3618739c", "title": "YouTube “Adpocalypse”: The YouTubers’ Journey from Ad-Based to Patron-Based Revenues"}, {"paperId": "df5631e0564b39ce073e7f00e825a8eee7eedbce", "title": "The Economics of Content Moderation: Theory and Experimental Evidence from Hate Speech on Twitter"}, {"paperId": "3cb8f57a889653d929ed50a22e7d93efbc9037c1", "title": "A Longitudinal Study of the Gettr Social Network"}, {"paperId": "b3b20b357ab24c752a2b5449279a301831e7debc", "title": "Combating Online Hate Speech: The Impact of Legislation on Twitter"}, {"paperId": "d50e8a1bb8b03823150403804f1133befcd95525", "title": "Differences in the Toxic Language of Cross-Platform Communities"}]}
