{"paperId": "5e64bb32e4830cc2ad868b5d6e3b06f9959af1f3", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "Machine Learning for Credit Risk Prediction: A Systematic Literature Review", "abstract": "In this systematic review of the literature on using Machine Learning (ML) for credit risk prediction, we raise the need for financial institutions to use Artificial Intelligence (AI) and ML to assess credit risk, analyzing large volumes of information. We posed research questions about algorithms, metrics, results, datasets, variables, and related limitations in predicting credit risk. In addition, we searched renowned databases responding to them and identified 52 relevant studies within the credit industry of microfinance. Challenges and approaches in credit risk prediction using ML models were identified; we had difficulties with the implemented models such as the black box model, the need for explanatory artificial intelligence, the importance of selecting relevant features, addressing multicollinearity, and the problem of the imbalance in the input data. By answering the inquiries, we identified that the Boosted Category is the most researched family of ML models; the most commonly used metrics for evaluation are Area Under Curve (AUC), Accuracy (ACC), Recall, precision measure F1 (F1), and Precision. Research mainly uses public datasets to compare models, and private ones to generate new knowledge when applied to the real world. The most significant limitation identified is the representativeness of reality, and the variables primarily used in the microcredit industry are data related to the Demographic, Operation, and Payment behavior. This study aims to guide developers of credit risk management tools and software towards the existing ability of ML methods, metrics, and techniques used to forecast it, thereby minimizing possible losses due to default and guiding risk appetite.", "venue": "International Conference on Data Technologies and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-07", "journal": {"name": "Data", "pages": "169", "volume": "8"}, "authors": [{"authorId": "2265813253", "name": "Jomark Pablo Noriega"}, {"authorId": "2265816680", "name": "Luis Antonio Rivera"}, {"authorId": "2265813658", "name": "José Alfredo Herrera"}], "citations": [{"paperId": "6537de304066503e397bb8ebf6e86422de94a14b", "title": "Enhancing Supervised Model Performance in Credit Risk Classification Using Sampling Strategies and Feature Ranking"}]}
