{"paperId": "5e7e71000c3dcc69937d9c1026127032c60f7e81", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "Orchid: An Online Learning Based Resource Partitioning Framework for Job Colocation With Multiple Objectives", "abstract": "Colocating multiple throughput-oriented jobs on the same server is a commonly used approach for improving system throughput in modern datacenters. The shared resources of the server are usually partitioned among the colocated jobs in order to prevent performance interference caused by resource contention. However, how to properly partition the shared resources among the colocated jobs is nontrival, because it usually has to trade off between two conflict objectives, as datacenter manager wants to maximize server throughput while job owners hope to experience a fair slowdown. Moreover, a desirable resource partitioning strategy should also be efficient, autonomous and adaptive. So far, this problem is not well-addressed in the literature due to several critical challenges. In this paper, we propose an online learning based framework, named Orchid, to address the multi-objective resource partitioning problem. Orchid leverages contextual multi-armed bandit (CMAB) to model the resource partitioning problem and uses a light-weight online learning algorithm to learn the optimal partitioning configuration according to some easy-to-collect runtime system status. Orchid has two distinguished properties compared to the existing solutions: first, it has the ability to trade off between the two objectives flexibly according to the aspiration of decision maker; second, it has the awareness about runtime system status, which can help to improve the efficiency of finding the optimal partitioning configuration and the adaptivity to dynamic environment changes. Moreover, Orchid does not require any prior knowledge of jobs, and incurs a very small computational overhead. Our evaluations show that Orchid achieves all the desired properties of a good resource partitioning strategy, which outperforms the state-of-the-art baselines with significant margins. Orchid is publicly available at https://github.com/OpenSourceOrchid/Orchid.", "venue": "IEEE transactions on computers", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "3443-3457", "volume": "72"}, "authors": [{"authorId": "2993340", "name": "Ruobing Chen"}, {"authorId": "47650055", "name": "Wang Peng"}, {"authorId": "2672579", "name": "Yusen Li"}, {"authorId": "120281171", "name": "Xiaoguang Liu"}, {"authorId": "50248801", "name": "Gang Wang"}], "citations": []}
