{"paperId": "5e9da8fd88c1f014b13ba2765c61000bcc23b13a", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Smart City Public Safety Intelligent Early Warning and Detection", "abstract": "This study conducts in-depth research and analysis on the intelligent monitoring and early warning of public safety machines in the construction of smart cities, taking risk management theory as the theoretical basis and combining it with the actual situation, i.e., constructing a public safety risk management framework under the background of proposing urban refinement management, a typical case for in-depth analysis, and understanding how the community carries out public safety risk prevention and control through research and interviews and other research methods, mainly including the overall design and the design of application modules for the robot. Based on studying the existing research and combining the advantages of each research method, this study proposes a method suitable for the analysis of this study, which can improve efficiency and accuracy. The robot application module design part, around the system’s main emergency command object, i.e., the robot, details its design in four aspects: data communication, situation display, auxiliary decision-making, and command and dispatch. The technical environment for system development is given, the development framework based on BS structure and the development and implementation of data interface modules are detailed, and the development and implementation of the robot application module are explained in detail. Finally, the system functions and performance, and further optimization directions are given based on the analysis of the test results.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-13", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "2114802423", "name": "Yutian Sha"}, {"authorId": "2135175270", "name": "Mohan Li"}, {"authorId": "14869676", "name": "Huikun Xu"}, {"authorId": "2117864014", "name": "Shaohan Zhang"}, {"authorId": "14091732", "name": "Tianxing Feng"}], "citations": [{"paperId": "89f5dd0103f38d0e808c06c0bf34bdf8a23bb3b1", "title": "Analysis of factors of willingness to adopt intelligent construction technology in highway construction enterprises"}, {"paperId": "3d8090add11821d51c124e35cd907ac76307b79d", "title": "Opportunities, Applications, and Challenges of Edge-AI Enabled Video Analytics in Smart Cities: A Systematic Review"}, {"paperId": "5a06bd3831fbded6d8cf974405ad3e7227bff6d6", "title": "Researches on urban safety early warning system and emergency response mechanism under snowstorm weather"}]}
