{"paperId": "5eb722d141e4b110b2cf52af25f6755952ec47d7", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Discrete Dynamic Modeling Analysis of Data Mining Algorithm under the Background of Big Data in the Strategic Goal of Sustainable Development of College Physical Training", "abstract": "With the popularization of intelligent devices and the rapid development of information technology, many valuable data become easier to obtain. After obtaining massive data, the problem of how to make more efficient and scientific use of these data is in front of us. Data mining is a deeper processing of data. It is aimed at mining the internal associations hidden in complex data and making the data give full play to its maximum value. At present, college physical training is also in urgent need of more scientific and modern upgrading and reform. Data mining is introduced into college physical training so that physical training data is no longer just a simple collection, query, and storage. This paper uses and introduces the basic content of Apriori algorithm. The actual college sports training data are collected for preprocessing, and the discrete dynamic model is established by using Apriori algorithm. Using this model, the actual data are deeply analyzed. Using the strong correlation subintegration results, the physical training of college students is optimized and reformed. The scores of college students’ physical quality are improved, and the goal of sustainable development of college physical training is achieved. Based on the data of 126 students in four classes of a major in 2020, this paper mines the frequent subsets with strong correlation in the data and finds out the relationship between the correlation and trust between subsets. In the 70-day experiment, the scores of college students’ comprehensive physical quality have been significantly improved, which proves that the discrete dynamic model established by Apriori algorithm data mining has a significant role in college physical training. The questionnaire survey results show that 83% of the college students are very satisfied with the discrete dynamic model-assisted physical training, and 16% of the college students are basically satisfied with the system. Apriori algorithm has significant advantages in dealing with big data. Single Apriori algorithm also has some defects. The efficiency of data mining, data security, and the accuracy of model analysis results need to be tested in practice.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-13", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2128129379", "name": "Yunong Li"}, {"authorId": "2176632757", "name": "Shaohua Liu"}], "citations": [{"paperId": "34ed2efe94040c2fc9ac04a6797258f137f2ca87", "title": "The Construction of a Prediction Model for the Teaching Effect of Two Courses Education in Colleges and Universities Based on Machine Learning Algorithms"}]}
