{"paperId": "5ecdd7c88e0f5ce75570d298e45816be95025d7d", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Power-Efficient Secured Hardware Design of AES Algorithm on High Performance FPGA", "abstract": "With the expansion and growth of industries, the two major issues exist that affect both civilization and the environment. Technology development has made it more difficult to communicate and transmit data over secure channels. The use of Green Communication (GC) technology and energy-efficient parts can lessen the lack of electricity and energy. The usage of various technologies under one framework is the main topic of this study. In this article, a hardware implementation of the Advanced Encryption Standard (AES) algorithm is shown. Field Programmable Gate Array (FPGA) devices are taken into consideration for hardware implementations. The power calculation of the AES algorithm is computed for several clock speeds of the Spartan-7 FPGA, and the results are examined using VIVADO tool.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1634-1637"}, "authors": [{"authorId": "2110856959", "name": "K. Kumar"}, {"authorId": "2225939650", "name": "Vijay Singh"}, {"authorId": "2149933687", "name": "Gaurav Mishra"}, {"authorId": "2059156393", "name": "B. Babu"}, {"authorId": "2149285024", "name": "Nandita Tripathi"}, {"authorId": "2219813084", "name": "Pramod Kumar"}], "citations": [{"paperId": "0314628f7f0031ffa559048508f7e35377a78323", "title": "AES Algorithm with Dynamic Shift Rows and Bit Permuted Mix Column"}, {"paperId": "55ee98078337cb5ccab66b15d7512085c6192bc3", "title": "Maintaining Secure Level on Symmetric Encryption under Quantum Attack"}]}
