{"paperId": "5ee6600ee56705da773d9be2610c36098dafc223", "publicationVenue": {"id": "d516149f-0724-4635-9580-91f6e8fc1772", "name": "Young Consumers", "type": "journal", "alternate_names": ["Young Consum Insight Idea Responsible Mark", "Young Consumers: Insight and Ideas for Responsible Marketers", "Young Consum"], "issn": "1747-3616", "url": "https://www.emeraldinsight.com/journal/yc"}, "title": "Young consumer engagement at the bottom of pyramid: applying S-O-R framework in e-commerce context", "abstract": "\nPurpose\nThis study aims to identify the key drivers of consumer engagement in e-commerce among young consumers at bottom-of-pyramid (BoP) markets and their impact on continued usage intention.\n\n\nDesign/methodology/approach\nA cross-sectional research design was used to understand low-income customers’ engagement in e-commerce, specifically online shopping. The data for this study were collected from BoP customers in the Indian market. A conceptual model was proposed, and hypotheses were developed using the stimulus–organism–response (S-O-R) framework. For analysis, structural equation modeling was performed using AMOS 20.0 software to test the structural model.\n\n\nFindings\nThe results of the study highlight that perceived importance, technology and infrastructure and social influence are key drivers of e-commerce at BoP customers. Key drivers have shown a significant positive impact on customer engagement which leads to continue usage intention of e-commerce. Furthermore, customer engagement has shown a strong relationship with continue usage intention of e-commerce.\n\n\nPractical implications\nThis study indicates that young consumers’ engagement is important for e-commerce service providers to gain a market share. BoP markets offer immense opportunities to create, develop and sustain e-commerce firms for a long time, especially in India. Managers should recognize the potential of BoP markets, which can generate a huge demand for products and services on e-commerce platforms.\n\n\nOriginality/value\nThis study contributes both theoretically and empirically. Theoretically, this adds to the existing knowledge of customer engagement, especially in e-commerce and BoP market segment. Empirically, it tested the conceptual research model of low-income customer engagement in the e-commerce marketplace using the S-O-R framework. The study recommended practical implications for e-retailers/e-commerce service providers engaging BoP customers in a digitally connected and intensively competitive era.\n", "venue": "Young Consumers", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-22", "journal": {"name": "Young Consumers"}, "authors": [{"authorId": "35664880", "name": "Aayushee Gupta"}, {"authorId": "2155570866", "name": "Ajay Kumar"}, {"authorId": "2232508209", "name": "Esubalew Melese"}], "citations": [{"paperId": "a5803e2fe80d46b10ef7627ee42c879318401214", "title": "The role of online retail website experience on brand happiness and willingness to share personal information: an SOR perspective"}, {"paperId": "460fd3745edeebe51165e344a5d03d7ca6a2b294", "title": "A study of the mechanism of the types of emotions in retailers' review request text on consumers' reviewing intention"}]}
