{"paperId": "5ee89136a095a0dca4b20443af20db797fb8c8ca", "publicationVenue": null, "title": "Nonintrusive Measurement on Temporal and Spatial Features of Microservice Inferences", "abstract": "The high flexibility of microservice architecture provides notable divergence among the internal software stack within the same application. Microservice-based applications are commonly deployed in data centers by users yet they have no clue of what is exactly provided by the service provider. In this case, there could exist those providers could be able to replace the internal software without noticing, making a contract-level fault and offloading risks to users. To better profile the microservice, we propose a framework that provides nonintrusive measurements on microservice inference, or MEME, to detect fraudulent behaviors of cloud service providers on microservice-based applications. We design MEME using performance portrait and fast Fourier transform (FFT). We model the microservice-based application with a set of cohorts and use FFT to obtain the signal formed by the main frequency components of average response time. Our model represents the performance portrait of the microservice-based application. The performance portrait is similar to a fingerprint that carries internal software information. In our experiments, we take a two-tier microservice-based application containing databases as an example. Empirical results show that MEME can provide a distinguishable profile of the performance portrait of data services in a temporal and spatial manner, which allows us to identify the software type.", "venue": "2022 IEEE Smartworld, Ubiquitous Intelligence & Computing, Scalable Computing & Communications, Digital Twin, Privacy Computing, Metaverse, Autonomous & Trusted Vehicles (SmartWorld/UIC/ScalCom/DigitalTwin/PriComp/Meta)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE Smartworld, Ubiquitous Intelligence & Computing, Scalable Computing & Communications, Digital Twin, Privacy Computing, Metaverse, Autonomous & Trusted Vehicles (SmartWorld/UIC/ScalCom/DigitalTwin/PriComp/Meta)", "pages": "16-24"}, "authors": [{"authorId": "2182420093", "name": "Xiaoling Li"}, {"authorId": "2222512801", "name": "Tao Zeng"}, {"authorId": "2223594670", "name": "Biyong Liu"}, {"authorId": "2178732871", "name": "Haichuan Hu"}, {"authorId": "47047681", "name": "Zichen Xu"}, {"authorId": "2110407396", "name": "Shuang Tan"}, {"authorId": "2116489462", "name": "Yusong Tan"}, {"authorId": "40151687", "name": "Chenren Xu"}], "citations": []}
