{"paperId": "5eedf042af5762cf3fe11d65a7173dbfe7c3b7b9", "publicationVenue": {"id": "2fbd7759-ac03-4545-acea-ba44727987e6", "name": "Telecom", "type": "journal", "issn": "2673-4001", "url": "https://www.mdpi.com/journal/telecom", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1664481"]}, "title": "A Survey from Real-Time to Near Real-Time Applications in Fog Computing Environments", "abstract": "In this article, we present a comprehensive survey on time-sensitive applications implemented in fog computing environments. The goal is to research what applications are being implemented in fog computing architectures and how the temporal requirements of these applications are being addressed. We also carried out a comprehensive analysis of the articles surveyed and separate them into categories, according to a pattern found in them. Our research is important for the area of real-time systems since the concept of systems that respond in real time has presented various understandings and concepts. This variability of concept has been due to the growing requirements for fast data communication and processing. Therefore, we present different concepts of real-time and near real-time systems found in the literature and currently accepted by the academic-scientific community. Finally, we conduct an analytical discussion of the characteristics and proposal of articles.", "venue": "Telecom", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-03", "journal": {"name": "Telecom"}, "authors": [{"authorId": "2168659966", "name": "Eliza Gomes"}, {"authorId": "145748016", "name": "F. Costa"}, {"authorId": "32453492", "name": "Carlos Roberto de Rolt"}, {"authorId": "1798671", "name": "P. Plentz"}, {"authorId": "144749724", "name": "M. Dantas"}], "citations": [{"paperId": "0a8d63955a932ffb186e55bf9e8c5afe216c9b8a", "title": "Emergency Logistics Resource Scheduling Algorithm in Cloud Computing Environment"}, {"paperId": "90ae5533c93245f93c65732082da02b2969ad290", "title": "Optimizing Internet of Things Fog Computing: Through Lyapunov-Based Long Short-Term Memory Particle Swarm Optimization Algorithm for Energy Consumption Optimization"}, {"paperId": "c6d834ea9e64fdf199af333d15282ca3a207ffdf", "title": "End-to-End Service Availability in Heterogeneous Multi-Tier Cloud-Fog-Edge Networks"}, {"paperId": "65e82ca0af137e83bdc4e5823fb5647e2ab78cbc", "title": "Navigating the IoT landscape: Unraveling forensics, security issues, applications, research challenges, and future"}, {"paperId": "fbf50ca41a1c4dc9160f32c5869e3808131d022f", "title": "Internet of Things: A Comprehensive Overview on Protocols, Architectures, Technologies, Simulation Tools, and Future Directions"}, {"paperId": "853437b9d0e7c17c1d5b17608c54b00920752831", "title": "A review on offloading in fog-based Internet of Things: Architecture, machine learning approaches, and open issues"}, {"paperId": "42c81ede1e4c5851cb2d92bc8a6b4599f812cf25", "title": "Nutrient Film Technique-Based Hydroponic Monitoring and Controlling System Using ANFIS"}, {"paperId": "b83165752e52f3c451365fdee41fb92bd61c74fe", "title": "A review on Fog Computing: Issues, Characteristics, Challenges, and Potential Applications"}, {"paperId": "24c177cdb8c707ee652ab205ad2b2c7daf5dcf05", "title": "Using Machine Learning on V2X Communications Data for VRU Collision Prediction"}, {"paperId": "e31d9b74640e431562b5175803c28fb9ffadb902", "title": "An ensemble learning approach to condition assessment of dissipative CLT connections based on piezoceramic sensor data"}, {"paperId": "0c7dfed0102df6a3f86b758f9fb9c6c7ae73d64e", "title": "FOCUSeR: A Fog Online Context-Aware Up-to-Date Sensor Ranking Method"}, {"paperId": "4a22b6a37814762bc5b547491465306863e33b05", "title": "An Edge-Fog Architecture for Distributed 3D Reconstruction and Remote Monitoring of a Power Plant Site in the Context of 5G"}, {"paperId": "fad279675e7e09f070f8b9179787ca7fac2db036", "title": "Cost and Latency Optimized Edge Computing Platform"}, {"paperId": "237f834c75b54f0944f7f653b3b97ce91833d3c6", "title": "A Novel Offloading Mechanism Leveraging Fuzzy Logic and Deep Reinforcement Learning to Improve IoT Application Performance in a Three-Layer Architecture Within the Fog-Cloud Environment"}]}
