{"paperId": "5ef0e813fa4e6dce8a96f4b07027c53f3dd3812c", "publicationVenue": null, "title": "ITS: Improved Tabu Search Algorithm for Path Planning in UAV-Assisted Edge Computing Systems", "abstract": "Mobile Edge Computing (MEC) plays a crucial role in providing diverse computation and storage services to intelligent equipment. In recent years, the utilization of Unmanned Aerial Vehicles (UAVs) equipped with edge servers has emerged as a promising approach to enable ubiquitous edge computing services. This paradigm offers various benefits, such as reduced latency and flexible service provisioning. In the context of UAV-assisted edge computing, optimizing the location and trajectory of UAVs is vital, since the communication distance has significant impact on the communication rates between edge servers and devices. To address this optimization problem, this paper establishes a UAV-assisted edge computing system and focuses on investigating the path planning issue to expedite the offloading of computational tasks. In order to achieve this objective, we propose an improved tabu search algorithm that can efficiently optimize the number of UAVs, path planning. And to ensure reliable communication, we introduce reliability guarantees. Furthermore, we consider the energy limitations of UAVs to ensure practical feasibility. Through extensive simulations, we demonstrate that the proposed algorithm outperforms alternative approaches in terms of the specified objectives.", "venue": "2023 IEEE International Conference on Web Services (ICWS)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE International Conference on Web Services (ICWS)", "pages": "340-349"}, "authors": [{"authorId": "2120430652", "name": "Hongyue Wu"}, {"authorId": "2243381876", "name": "Mengchen Wu"}, {"authorId": "2242900063", "name": "Wen Peng"}, {"authorId": "2110750613", "name": "Shizhan Chen"}, {"authorId": "2113907598", "name": "Zhiyong Feng"}], "citations": [{"paperId": "b407fd8305dde06db04a5be1d9e7ea91bb60ccaf", "title": "Multiobjective trajectory optimization algorithms for solving multi-UAV-assisted mobile edge computing problem"}]}
