{"paperId": "5ef987be028ae62d7ddfe275001dc45b196cbc74", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "SubtStream: Online subtractive stream clustering algorithm", "abstract": "Real‐time stream data processing has gained high importance with the rapid rise of big data trends in different areas such as social media, finance, business, science, and bioinformatics. Stream data can be characterized as fast, unstable, and big data sets. Due to these properties of stream data, it cannot be processed effectively with traditional algorithms. Just like stream data processing, clustering is also a difficult task. However, researchers have attempted to classify stream data by modifying traditional algorithms or designing new ones. So, in previous studies, incremental methods were used for clustering the stream data. This paper highlights the need to develop an efficient real‐time clustering algorithm for data streams in the presence of concept high drift and an adaptive algorithm for different dimensions. The proposed clustering algorithm, SubtStream, combines decremental (subtractive property) and incremental (additivity property) strategies to overcome the high drift. It also introduces a new dimension‐based approach to adopt the dimension change. We use three radius parameters, Predefined User Parameter, Proactive Adaptive Parameter, and Reactive Adaptive Parameter, to achieve adaptability. The proposed method, SubtStream, showed better performance on synthetic and real data sets.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-27", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "19247872", "name": "Musa Milli"}, {"authorId": "2159554", "name": "Hasan Bulut"}], "citations": [{"paperId": "6a437f6f8b2ac165b0e7506ffb1e066e755a5c0a", "title": "MCMSTStream: applying minimum spanning tree to KD-tree-based micro-clusters to define arbitrary-shaped clusters in streaming data"}, {"paperId": "c6515027597b023ac17099c6cb4fa85cdfaacc25", "title": "Gaussian Adapted Markov Model with Overhauled Fluctuation Analysis-Based Big Data Streaming Model in Cloud."}, {"paperId": "8202684e9b0d0b1087d6f5866e0f2e7523f5b770", "title": "Generalized predictive control using improved recurrent fuzzy neural network for a boiler-turbine unit"}, {"paperId": "fcdc762740f4a496ac63abe30d6357001da1cf07", "title": "Evolving data stream clustering based on constant false clustering probability"}]}
