{"paperId": "5f1cc2df59fbab055ce1ea64d667e0934e6baad3", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "Big Data for Health", "abstract": "This paper provides an overview of recent developments in big data in the context of biomedical and health informatics. It outlines the key characteristics of big data and how medical and health informatics, translational bioinformatics, sensor informatics, and imaging informatics will benefit from an integrated approach of piecing together different aspects of personalized information from a diverse range of data sources, both structured and unstructured, covering genomics, proteomics, metabolomics, as well as imaging, clinical diagnosis, and long-term continuous physiological sensing of an individual. It is expected that recent advances in big data will expand our knowledge for testing new hypotheses about disease management from diagnosis to prevention to personalized treatment. The rise of big data, however, also raises challenges in terms of privacy, security, data ownership, data stewardship, and governance. This paper discusses some of the existing activities and future opportunities related to big data for health, outlining some of the key underlying issues that need to be tackled.", "venue": "IEEE journal of biomedical and health informatics", "year": 2015, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2015-07-10", "journal": {"name": "IEEE Journal of Biomedical and Health Informatics", "pages": "1193-1208", "volume": "19"}, "authors": [{"authorId": "1443783456", "name": "Javier Andreu-Perez"}, {"authorId": "29369369", "name": "Carmen C. Y. Poon"}, {"authorId": "2062850", "name": "R. Merrifield"}, {"authorId": "49558522", "name": "Stephen T. C. Wong"}, {"authorId": "144574968", "name": "Guang-Zhong Yang"}], "citations": [{"paperId": "07334ce845f9df7c41b30554e33ca4bfe0afbf6b", "title": "Analyzing entropy features in time-series data for pattern recognition in neurological conditions."}, {"paperId": "f28a28954eb28376b08f22e51182d7b39512562a", "title": "Transforming Big Data into AI-ready data for nutrition and obesity research."}, {"paperId": "15b814da56c19056da2157ce324cf025a99bc767", "title": "How big data analytics can create competitive advantage in high-stake decision forecasting? The mediating role of organizational innovation"}, {"paperId": "daa303fc8f3b5e0cab0364a951dae81567135705", "title": "Predicting Neuroblastoma Patient Risk Groups, Outcomes, and Treatment Response Using Machine Learning Methods: A Review"}, {"paperId": "fec04cb36cbfeaf682c7ad727e712b563abf11a7", "title": "Microfluidic-Based Non-Invasive Wearable Biosensors for Real-Time Monitoring of Sweat Biomarkers"}, {"paperId": "aaa83617ca99d0664399a2b4269923f9122cc8e1", "title": "A Comprehensive review of 'Internet of Healthcare Things': Networking aspects, technologies, services, applications, challenges, and security concerns"}, {"paperId": "d93f825728cd7fd0d3e4fc61bff6cfd0e68793f4", "title": "A Systematic Review of Literature on Sustaining Decision-Making in Healthcare Organizations Amid Imperfect Information in the Big Data Era"}, {"paperId": "f174cb8cb2eef236a02863732b502e6beed331c3", "title": "Healthcare analytics—A literature review and proposed research agenda"}, {"paperId": "52022ab0be83afece454f0f28fea0c33e0b0ded5", "title": "Building Flexible, Scalable, and Machine Learning-Ready Multimodal Oncology Datasets"}, {"paperId": "f27bd6ecb24de159efb0e4128daf118f01790159", "title": "Advancing the Management of Long COVID by Integrating into Health Informatics Domain: Current and Future Perspectives"}, {"paperId": "3beefa5aa534475cd11ba513388d82d573520158", "title": "Staying connected: Alzheimer's hashtags and opportunities for engagement and overcoming stigma."}, {"paperId": "6b3a82160dc69b89e72329ada4229f40b11e4e0c", "title": "Multimorbidity patterns in COVID-19 patients and their relationship with infection severity: MRisk-COVID study"}, {"paperId": "80f00d3d971b3ed8d1e310808e5f44ef40da6a07", "title": "Neonatologie in tijden van big data, machine learning en artificiële intelligentie: potentiële toepassingen gebruikmakend van continu gemonitorde vitale parameters. Een systematische review."}, {"paperId": "24f1751e342a19b50ad893b637e8c1c9a551726f", "title": "MULTIMODAL MEDICAL IMAGE FUSION TOWARDS FUTURE RESEARCH: A REVIEW"}, {"paperId": "008235438755382309ceac2efcaa6391dfbefc7b", "title": "A New Fuzzy-Based Classification Method for Use in Smart/Precision Medicine"}, {"paperId": "338c281000c24f2fcab114c26cc96eee7d6c1312", "title": "Fair Patient Model: Mitigating Bias in the Patient Representation Learned from the Electronic Health Records"}, {"paperId": "c1be284523e520637b0cdd0803876016e88ea030", "title": "Real-Time Continuous Monitoring of Oral Soft Tissue Pressure with a Wireless Mouthguard Device for Assessing Tongue Thrusting Habits"}, {"paperId": "e12e40484c96aa1062c58bc32119fddab79a3878", "title": "The convergence epidemic volatility index (cEVI) as an alternative early warning tool for identifying waves in an epidemic"}, {"paperId": "6914061068960be0b3ea686496d2427a01405a56", "title": "The influence of websites user engagement on the development of digital competitive advantage and digital brand name in logistics startups"}, {"paperId": "47deef189beeabdecf23d731e10d18c0e564fb1e", "title": "Precision Public Health Approach in Outbreak Management: Protocol for a Scoping Review (Preprint)"}, {"paperId": "106ffdedfc32bfedded90c9620b327623b53e9e2", "title": "The ethical and legal landscape of brain data governance"}, {"paperId": "cf6e352405baae6a9a259cfa5709018053ed6b94", "title": "An artificial neural network classification method employing longitudinally monitored immune biomarkers to predict the clinical outcome of critically ill COVID-19 patients"}, {"paperId": "c6aaf6f7dc70ff49436faa20eaeba28a727655d1", "title": "Neural network system for analyzing statistical factors of patients for predicting the survival of dental implants"}, {"paperId": "53eef75ccfb12d7186adef5edaf0e31eb98e14d9", "title": "Signal Quality Index for the fetal heart rates: Development and improvements for fetal monitoring"}, {"paperId": "dd80a3c41529e366bdeb730e9624514eacd3fe6d", "title": "Ciencia de datos en salud: desafíos y oportunidades en América Latina"}, {"paperId": "01866c640b19f543533b9a026c0b352d96e7cc8d", "title": "A single framework of precision surveillance of diabetes disease prognosis for better care with collaboration"}, {"paperId": "7aa0971526594d646f3c92e7eb3accf95dbb0dd5", "title": "Challenges of Big Data and Cyber Security in Health Center"}, {"paperId": "22f66094fc6264b4c679f121d721c9d25a87bfac", "title": "Characterization of technologies in digital health applied in vision care"}, {"paperId": "863e151bfed1b4cd673da79d01f2374fd48c8270", "title": "A Review of the Role and Challenges of Big Data in Healthcare Informatics and Analytics"}, {"paperId": "50af9d94be1a52c74aba0750fc248e346b1a5f68", "title": "Alzheimer's disease-associated inflammatory pathways might contribute to osteoporosis through the interaction between PROK2 and CSF3"}, {"paperId": "455de8f6285797d013d0158e23ad94b8fdba617e", "title": "Oncological big data platforms for promoting digital competencies and professionalism in Chinese medical students: a cross-sectional study"}, {"paperId": "4811e1d3dc0287646c13621cb72b592ea0f487b0", "title": "Toxicological and Exposure Database Inventory: A review."}, {"paperId": "2528af1ca0929e1eb3ecf24e1ac2aa3d0b79d927", "title": "Investigation and Countermeasures Research of Hospital Information Construction of Tertiary Class-A Public Hospitals in China: Questionnaire Study"}, {"paperId": "936f8f5be62501b5d3156aa15dbc8a61e9f272d4", "title": "The successful use of -omic technologies to achieve the 'One Health' concept in meat producing animals."}, {"paperId": "bbf3f767c1c42a89c43919e28d49af76ceac19d4", "title": "A Standardized Multimodal Neurological Monitoring Protocol-Guided Cerebral Protection Therapy for Venoarterial Extracorporeal Membrane Oxygenation Supported Patients"}, {"paperId": "c42061a39a9ed851fa3381a6b3d9a04f1a2c8852", "title": "Innovations in integrating machine learning and agent-based modeling of biomedical systems"}, {"paperId": "d3ffb0ddc0077e7df79c084f301d7b981c1e7147", "title": "Big Data in Health and the Importance of Data Visualization Tools"}, {"paperId": "eb4744c5bc49d5ddb19573397fb8cdc9f866faf2", "title": "CATNet: Cross-event Attention-based Time-aware Network for Medical Event Prediction"}, {"paperId": "06131efc46cf94518fd2d592454c69cab6e994c6", "title": "Big Data Reality Check (BDRC) for public health: to what extent the environmental health and health services research did meet the ‘V’ criteria for big data? A study protocol"}, {"paperId": "04ae0f51fb39aab5a8dc51a988ac0dae7425d5ac", "title": "A review on multimodal medical image fusion: Compendious analysis of medical modalities, multimodal databases, fusion techniques and quality metrics"}, {"paperId": "2a11bc607d81d29ac825d728fa52980fb6dd02d8", "title": "Emerging Strategies to Big Data Analytics in Healthcare"}, {"paperId": "2d1158f8734119954d316e85970d22ee891802dd", "title": "Registries, Databases and Repositories for Developing Artificial Intelligence in Cancer Care."}, {"paperId": "ee8a03d3b8399be77296c9068a97ae3dff6732ab", "title": "An active human role is essential in big data-led decisions and data-intensive science"}, {"paperId": "de339833f623457973a869b8a96b5bd72914d407", "title": "Research on Big Data Computing Model based on Spark and Big Data Application"}, {"paperId": "e8fb105a6b2f712b79d24fe9135cadb8b09ff15a", "title": "mHealth technology to assess, monitor and treat daily functioning difficulties in people with severe mental illness: A systematic review."}, {"paperId": "70690ea7b4700c35e3d6510ec3f87daed3837d57", "title": "Organizational Learning for Intelligence Amplification Adoption: Lessons from a Clinical Decision Support System Adoption Project"}, {"paperId": "329e0d8cda2ef1e732e35040e7bc13b05059b42e", "title": "An Intelligent Control Model of Credit Line Computing in Intelligence Health-Care Systems"}, {"paperId": "be623b617862ae730664e5c791472efebbc24710", "title": "Impact of Weather and Pollution on COPD-Related Hospitalizations, Readmissions, and Emergency Visits by Integrating Claims and Environmental Data to Build Human-Centered Decision Tools"}, {"paperId": "62d9a15d3fb28748bee6b6bd107b2de46e546159", "title": "Hyperparameter search based convolution neural network with Bi-LSTM model for intrusion detection system in multimedia big data environment"}, {"paperId": "f45476c773d053cbfbbe36d503c2bbff2e9b114e", "title": "Evaluation of Electronic Health Record-Based Suicide Risk Prediction Models on Contemporary Data"}, {"paperId": "1e477e85699d7d7c5584d2f1b792335747277e3b", "title": "Sufro una grave enfermedad rara. Reto a cantar y hacer coreografías en TikTok"}, {"paperId": "03f85e25596942dfe32e5063138c60fa74871d8c", "title": "Developing an ML pipeline for asthma and COPD: The case of a Dutch primary care service"}, {"paperId": "e6b401b8b56bc50618690066a4c74344dacfd5c0", "title": "Preventing dataset shift from breaking machine-learning biomarkers"}, {"paperId": "ea092939c9cb7f72334f7be5fcd7a0ff714f1cf0", "title": "Study on structured method of Chinese MRI report of nasopharyngeal carcinoma"}, {"paperId": "3f10002318c2c381640b5d3653fcb67baa829c4b", "title": "Day-1 Competencies for Veterinarians Specific to Health Informatics"}, {"paperId": "7cae442c814e79c454a72cd5272e4549250ecbed", "title": "Application of big-data for epidemiological studies of refractive error"}, {"paperId": "c1dbb1cdc5b05db670427f6daf70d1947bc34721", "title": "Governing Personalized Health: A Scoping Review"}, {"paperId": "1fdec5d93d63cc28370badf1c0ef32a2ba73d7c8", "title": "AI, IoT and Robotics in the Medical and Healthcare Field"}, {"paperId": "41f68ed57b5984889bc8aed47cea68922888635a", "title": "MAHREMİYET KAPSAMINDA KİŞİSEL SAĞLIK VERİLERİNİN KORUNMASI VE DEPOLANMASI"}, {"paperId": "40964af9ef082105078deaa5d31ce78efc9a792f", "title": "Convergence of Precision Medicine and Public Health Into Precision Public Health: Toward a Big Data Perspective"}, {"paperId": "3fd2c0f33ff2a7152b4a2c991297f56c6622b3f0", "title": "Automating pandemic mitigation"}, {"paperId": "3108810ea2e7dd1b8d05218d241b9abc77a60545", "title": "COVID-19 salgınıyla ilişkili semptomların Türkiye’den gerçekleştirilen internet arama motoru sorgularının incelenmesi"}, {"paperId": "da31fd18fd77ac94f8cb2945132e67431cf82711", "title": "Pattern recognition in lymphoid malignancies using CytoGPS and Mercator"}, {"paperId": "68ca594a195c3f2a68eddff7751d08e76993c8b8", "title": "Big Data Application in Health Care: A Study"}, {"paperId": "774167f914d05c228f8ed6c6f25e94de6c45a28a", "title": "Computational learning of features for automated colonic polyp classification"}, {"paperId": "25e1a2a6ca77929b094be6a65c6513729bc6cf23", "title": "Tourism Economic Development Model Based on Big Data"}, {"paperId": "94668fa5e0d8b95c4b58ab6338ded07fb6739ab9", "title": "Implementation of management information system at health agencies"}, {"paperId": "2a092ec794e272575f0cb2bdc497e5fd402a7776", "title": "Enhancing the Human Health Status Prediction: The ATHLOS Project"}, {"paperId": "18b48bda607c9a84349ff3f8887cd40c5ae5ca0b", "title": "Healthcare data management conceptual framework for service delivery"}, {"paperId": "a01cb47e8564d9581c92d7a0b44cd941ba642700", "title": "Automatic Assistance Method for Disease Diagnosis Based on a Deep Learning Fusion Model and Chinese Electronic Medical Record"}, {"paperId": "b5a7e6e1b9d093afb598335255e92df79d5d335a", "title": "Text Mining and Quantitative Research of Medical Service Policy: Sichuan Province as an Example"}, {"paperId": "e81dee967a3fc20f21ab74c406ce4f0c837d7343", "title": "A Review of Hidden Markov Models and Recurrent Neural Networks for Event Detection and Localization in Biomedical Signals"}, {"paperId": "23fa2f7afda81456c28971de86c96c636f5ee03e", "title": "A prediction and interpretation framework of acute kidney injury in critical care"}, {"paperId": "9db58077af6507ab106a5e2eba652269c4b751bc", "title": "Big data in biology: The hope and present-day challenges in it"}, {"paperId": "f4ea8f2a5c9ff3a6d770e86d8132c9201cefbfe4", "title": "A lossless compression and encryption mechanism for remote monitoring of ECG data using Huffman coding and CBC-AES"}, {"paperId": "60778585451e8385c7267644c0b1c82bb8bca37b", "title": "Changing the Nature of Quantitative Biology Education: Data Science as a Driver"}, {"paperId": "5a99d4fd1540a0e0289000c693180956ce341a80", "title": "Using digital health technology to evaluate the impact of chocolate on blood pressure: Results from the COCOA-BP study"}, {"paperId": "915022c72966b71c631e5b82d3dd8af5265fbbee", "title": "FDA public workshop: Orthopaedic sensing, measuring, and advanced reporting technology (SMART) devices"}, {"paperId": "0eb80cd94a56f683a091301282410bcc7d877028", "title": "The Role of Big Data in Personalized Medicine"}, {"paperId": "aa22fce8ada7a41f2ee8f95122d7b872ad662bf3", "title": "Liver cancer prediction in a viral hepatitis cohort: A deep learning approach"}, {"paperId": "b58075e48253944dfc9dad6ef28e3cdae4bcbd42", "title": "Healthcare 4.0: A Voyage of Fog Computing with IOT, Cloud Computing, Big Data, and Machine Learning"}, {"paperId": "ed93d7bf0014d4933c42dda4bb08e155193763de", "title": "Robust unsupervised dimensionality reduction based on feature clustering for single-cell imaging data"}, {"paperId": "7258104f9deaa88ba6f49e984f2a8f374d53956b", "title": "The status of proteomics as we enter the 2020s: Towards personalised/precision medicine."}, {"paperId": "10ecfc1935f04c34f6627283feef1c219732461a", "title": "Protocol Improvement for RNA Extraction From Compromised Frozen Specimens Generated in Austere Conditions: A Path Forward to Transcriptomics-Pathology Systems Integration"}, {"paperId": "4ac59ef6e61e01a85e54c0c812f90d258c39d546", "title": "LabHub: A New Generation Architecture Proposal for Intelligent Healthcare Medical Laboratories"}, {"paperId": "61c77faab08888d78823f7d54e0e2f45403aca4a", "title": "Development Perspective of Bioelectrocatalysis-Based Biosensors"}, {"paperId": "c5145b79cc936f8df7d657f2c673a00ef476dfcf", "title": "Good Life Ecosystems - Ethics and Responsibility in the Silver Market"}, {"paperId": "c90c02bb2ce6e9156737ab3405395edbb5ac137c", "title": "Intelligent algorithms for cold chain logistics distribution optimization based on big data cloud computing analysis"}, {"paperId": "f8e08b03b21f7b7fd8d06b4488630ebaaa18da01", "title": "The Academic Viewpoint on Patient Data Ownership in the Context of Big Data: Scoping Review"}, {"paperId": "2f223a6773f0f7ca69294c86e58511fcd14b295c", "title": "Improved Preterm Prediction Based on Optimized Synthetic Sampling of EHG Signal"}, {"paperId": "7b1201037d82fae85139ce2ce3c31f6ebab420f2", "title": "Wearable Respiration Monitoring: Interpretable Inference With Context and Sensor Biomarkers"}, {"paperId": "e7c7527a752faadc86867f79b42994488eada505", "title": "Robotics and Artificial Intelligence"}, {"paperId": "e1452f736735837cf0b694f09472bd255375d638", "title": "Artificial intelligence in gastric cancer: a systematic review"}, {"paperId": "d805b1011492c046de84e67db326151ed3de3eea", "title": "Robust Characterization of the Uterine Myoelectrical Activity in Different Obstetric Scenarios"}, {"paperId": "a858655e5273a23e713ae82f1aa09d7c7b7ee43f", "title": "Modelling the map reduce based optimal gradient boosted tree classification algorithm for diabetes mellitus diagnosis system"}, {"paperId": "1e42b1622c3352e1b18fa24b96c1badfaf140902", "title": "Working Through Ethics Review of Big Data Research Projects: An Investigation into the Experiences of Swiss and American Researchers"}, {"paperId": "ee35c47c48219e1db1909f59ab849fa0670abe6e", "title": "Biobanks in the era of big data: objectives, challenges, perspectives, and innovations for predictive, preventive, and personalised medicine"}, {"paperId": "eee2f099571886fb9e640aa478426eef3720a180", "title": "Lessons from Hippocrates: Time to Change the Cancer Paradigm"}, {"paperId": "ef2afdce9b71657522d743178ab39fb03a394647", "title": "Big data analytics in medical engineering and healthcare: methods, advances and challenges"}, {"paperId": "8f4b52d5ed4792f23afce06963b4f4a410b654cf", "title": "Desensitization and Cleaning Technology of CT Image of Parotid Tumor based on DICOM"}, {"paperId": "5cfe1620abef5a83a4d3fc2dd98753ffd887bf8d", "title": "Challenges of Adopting Human-Centered Intelligent Systems: An Organizational Learning Approach"}, {"paperId": "f44bc7cb0cac1cc353fb0d8f6b9d7022f8500894", "title": "Non-invasive identification of swallows via deep learning in high resolution cervical auscultation recordings"}, {"paperId": "70199486e833b3ef2744e8def340b31263419373", "title": "MNSSp3: Medical big data privacy protection platform based on Internet of things"}, {"paperId": "3b0b2cfa3ad726254d4ba28084a873b273038a48", "title": "Designing P4 healthcare interventions for managing cognitive decline and dementia: where are we at?"}, {"paperId": "0f8032c91daf3041d5084723462eea8edfa558cf", "title": "Interactive Algorithms in Complex Image Processing Systems Based on Big Data"}, {"paperId": "e7a088e16c008ac788e65ad336ee2852874df622", "title": "Design and evaluation of an intelligent physical examination system in improving the satisfaction of patients with chronic disease"}, {"paperId": "378d0c693d967adbdf86b85005aba611d5a7aae2", "title": "Privacy preservation in e-health cloud: taxonomy, privacy requirements, feasibility analysis, and opportunities"}, {"paperId": "9173ca522139df61b1a94e0c98d0d07152599c64", "title": "Aptamer based tools for environmental and therapeutic monitoring: A review of developments, applications, future perspectives"}, {"paperId": "8f83c0ba7023a0694c161395cec4fe90d30340b1", "title": "EHRtemporalVariability: delineating temporal data-set shifts in electronic health records"}, {"paperId": "dce69a4818be328f4fe787bad6e73c73d7cf9bb1", "title": "Big Data in Modern Chemical Analysis"}, {"paperId": "d15141521a1846be3aea43139ba844059e8e866e", "title": "Humanizing Big Data: Recognizing the Human Aspect of Big Data"}, {"paperId": "d54e382b5dd37a2bd04edc9deaa4b096380d4284", "title": "Deep learning approaches for sleep disorder prediction in an asthma cohort"}, {"paperId": "62db45580c4114d2a23d2424b0050810aeb59395", "title": "‘Without data, you’re just another person with an opinion’"}, {"paperId": "3cc6797cbffbbe48b06883a1387bf0c195448487", "title": "An Overview of Neural Network Architectures for Healthcare"}, {"paperId": "3ea4d03e8708afd4c3f3f9438f700950b5b5f4fd", "title": "User online behavior based on big data distributed clustering algorithm"}, {"paperId": "8faae3f75b36773a609644fb9df008b438ba5b69", "title": "What is your definition of Big Data? Researchers’ understanding of the phenomenon of the decade"}, {"paperId": "7bd5714dd89e50fc7b8ffcdffe06f72b60dc874c", "title": "The Four Dimensions of Social Network Analysis: An Overview of Research Methods, Applications, and Software Tools"}, {"paperId": "84f96cce054369e53bde15524414d148b56902e8", "title": "Sehaa: A Big Data Analytics Tool for Healthcare Symptoms and Diseases Detection Using Twitter, Apache Spark, and Machine Learning"}, {"paperId": "e45b86e0b7d4f5c62d2e39a28756ef4971c504ad", "title": "State‐of‐the‐Art Machine Learning Techniques Aiming to Improve Patient Outcomes Pertaining to the Cardiovascular System"}, {"paperId": "a42a6969ba2eaccc9ab86d94e2ac8f7658d08e0c", "title": "Precision Medicine: Implications for value chains and business models in life sciences"}, {"paperId": "5cf1f0dc1f8faa998e82cefbb1b4399ff8b1c722", "title": "Skin in the diagnostics game: Wearable biosensor nano- and microsystems for medical diagnostics"}, {"paperId": "4d7efb423f24918ebb38dab408985a828fde148a", "title": "Big data analytics in health sector: Theoretical framework, techniques and prospects"}, {"paperId": "07825f5089aabe5f6ab1cf09ee5d590a2357db31", "title": "Cluster-Based Systematic Data Aggregation Model (CSDAM) for Real-Time Data Processing in Large-Scale WSN"}, {"paperId": "e0b95c56dc4f1dd35ebe2c45d99ffc72cc0fcf58", "title": "Fog computing in health management processing systems"}, {"paperId": "5d41cd69b206c0c0080acee446f4abb705105f8e", "title": "Big Data Analytics in Health: an overview and bibliometric study of research activity."}, {"paperId": "583bc7618be7dad0d54f7e90e19573963325712d", "title": "Detection and Characterization of E-Health Research: A Bibliometrics (2001–2016)"}, {"paperId": "d9cff018e62b3cc58203b577d812236641dcc776", "title": "SPDF: Set Probabilistic Distance Features for Prediction of Population Health Outcomes via Social Media"}, {"paperId": "aefc02aa5dd70dabe7486386035b11feaca0888b", "title": "Feature selection methods and genomic big data: a systematic review"}, {"paperId": "602180226be0da2431478009d3c5dfbc2da10064", "title": "Extracting Knowledge from Big Data for Sustainability: A Comparison of Machine Learning Techniques"}, {"paperId": "5522217af4f555c5e043760253f29561f2d6cf02", "title": "Multivariate Data Analysis Methodology to Solve Data Challenges Related to Scale-up Model Validation and Missing Data on a Micro-Bioreactor System."}, {"paperId": "63ba4902d81e4f77b48247bfb82319d5be364e7e", "title": "The Noninvasive Blood Pressure Measurement Based on Facial Images Processing"}, {"paperId": "234e0a1c6a77e3d56fe9b09016d417edc971dbe2", "title": "Coding and classifying GP data: the POLAR project"}, {"paperId": "354946278b32424175303c894746fc0e5d3f8f12", "title": "A cognitive technology based healthcare monitoring system and medical data transmission"}, {"paperId": "b3fd9de3e5addd7e59e123367b257da9bac8316c", "title": "Panacea of challenges in real-world application of big data analytics in healthcare sector"}, {"paperId": "39dd4eea8d517ab72ea84a328261c6383f2deb8f", "title": "Big Data in Healthcare: Challenges and Promise"}, {"paperId": "921c1d72403664aa465fc205340be5aea6260539", "title": "A Data Driven Multi-Layer Framework of Pervasive Information Computing System for eHealthcare"}, {"paperId": "53b4caf73fa795eb76758d134d5aaeefced2a39e", "title": "A systematic review on the status and progress of homomorphic encryption technologies"}, {"paperId": "e3fb4b886d4d54d2b9cb234a353a78c549617905", "title": "A Framework for the Development of a Dynamic Adaptive Intelligent User Interface to Enhance the User Experience"}, {"paperId": "a4ed52b16f6c70d69808d1b3a07a4e5938ef0b12", "title": "Radiogenomics for Precision Medicine With a Big Data Analytics Perspective"}, {"paperId": "3bb8de81ad22be07369e44cca8a8fea289f970b1", "title": "The applications of big data in molecular diagnostics"}, {"paperId": "72317800a0e44897ebc05c4d467f3131626273b3", "title": "iHealthcare: Predictive Model Analysis Concerning Big Data Applications for Interactive Healthcare Systems †"}, {"paperId": "133d5cddd7ab53f17e97acf0112ddc23b0eb86a9", "title": "Change of Data-Driven Drug Design Trends Through Patent Analysis"}, {"paperId": "0c66566cc5e3ebf4d4052bdf0f73bfa11d19346d", "title": "Increasing protected data accessibility for age-related cataract research using a semi-automated honest broker"}, {"paperId": "a4ae272b802e4e5c2d4636296a5398d2a4ad359e", "title": "Archetype-Based Modeling and Search of Social Media"}, {"paperId": "2940f32d71125fee53f14678c55f086fb8ad7764", "title": "Big Data for the Sustainability of Healthcare Project Financing"}, {"paperId": "2169a1dbda0e4c25050941048c915382be3bb1de", "title": "A review of the literature on big data analytics in healthcare"}, {"paperId": "8521ba10b4edaa576db4e2dd751f4a7eecb20f4a", "title": "A systematic analysis of genomics-based modeling approaches for prediction of drug response to cytotoxic chemotherapies"}, {"paperId": "60d988f36e7c7a4a052a42a4de259d5e0eb07ac6", "title": "Towards an Effective and Efficient Management of Genome Data: An Information Systems Engineering Perspective"}, {"paperId": "9ee7d7aaf0956b3faa21a3bd6984cc16da578bc5", "title": "A scoping review of ‘big data’, ‘informatics’, and ‘bioinformatics’ in the animal health and veterinary medical literature"}, {"paperId": "b59f1a86a01612ff02d7498baaa05df76596f6ec", "title": "A genomic data mining pipeline for 15 species of the genus Olea."}, {"paperId": "0c8284a6597d6bb19ffacb04173be4f8cafa6411", "title": "Artificial intelligence (AI) and cancer prevention: the potential application of AI in cancer control programming needs to be explored in population laboratories such as COMPASS"}, {"paperId": "d6b85e063bba47fc35cd3c7afe34e843d9074b3d", "title": "Evaluation of the Possible Use of PPG Waveform Features Measured at Low Sampling Rate"}, {"paperId": "bada258b353969af0451bfa097c65c87bd150993", "title": "Use of machine learning techniques in the development and refinement of a predictive model for early diagnosis of ankylosing spondylitis"}, {"paperId": "ba11e075ac577ef4fe9aa75b5231fa8b5c04c76b", "title": "Mind the gap: observation windows to define periods of event ascertainment as a quality control method for longitudinal electronic health record data."}, {"paperId": "83688b4f4f50537fc91a49eb67c06cb5dc4c90d7", "title": "Big Data and Dahl’s Challenge of Democratic Governance"}, {"paperId": "27fe80ecabb2c1315b220c348ec663cc1bd3a197", "title": "Gramian matrix data collection-based random forest classification for predictive analytics with big data"}, {"paperId": "ed7346ce35458e513c38ac8f54d6c41d4c329188", "title": "Trip-Based Measures of Naturalistic Driving: Considerations and Connections With Cognitive Status in Older Adult Drivers"}, {"paperId": "695773ff2cf9998a8108beb0513bf9bf5d64093b", "title": "Why Neurotechnologies? About the Purposes, Opportunities and Limitations of Neurotechnologies in Clinical Applications"}, {"paperId": "fe65747380b57e59df3b581ce78cde8d6378513f", "title": "A Deep Neural Network-Based Method for Early Detection of Osteoarthritis Using Statistical Data"}, {"paperId": "3dac96ef99cad97427e5623924ec3766d5ef84c1", "title": "Pillars for Big Data and Military Health Care: State of the Art"}, {"paperId": "0c72330a8fef501dcd646a1d6aaef82a09dd0307", "title": "Medical Decision Support Using Increasingly Large Multimodal Data Sets"}, {"paperId": "b3c6ad612ff9635d2742cfb013973f1b6dc55fb6", "title": "Coronary Heart Disease Predictive Decision Scheme Using Big Data and RNN"}, {"paperId": "cf84f807495b1416295a347bcd151d7c67d579a2", "title": "Artificial neural network based prediction of malaria abundances using big data: A knowledge capturing approach"}, {"paperId": "cb9fb4f7d9fbb3a73da7c79972bc8d53a8c337ab", "title": "Noisy multi-label semi-supervised dimensionality reduction"}, {"paperId": "0ba9a19166f8a53d18033a0f39d5be001c5c6e85", "title": "Overexpression of BUB1B, CCNA2, CDC20, and CDK1 in tumor tissues predicts poor survival in pancreatic ductal adenocarcinoma"}, {"paperId": "e9864cd185adef9c413249e1b633b4751eabc538", "title": "T1 and extracellular volume fraction mapping in cardiac magnetic resonance: estimation of accuracy and precision of a novel algorithm"}, {"paperId": "6e72664acd40c7c9ded78ced9a9c0d715be5a44f", "title": "Usage of the Term Big Data in Biomedical Publications: A Text Mining Approach"}, {"paperId": "38d778dde9b68b67fdc169af525c9e358798df1c", "title": "Research trends in equine movement analysis, future opportunities and potential barriers in the digital age: A scoping review from 1978 to 2018."}, {"paperId": "a1d804e59884de06c7847f510acc1c4c27d59123", "title": "Natural Language Processing, Sentiment Analysis and Clinical Analytics"}, {"paperId": "6477b39b872588332ff854bbf26d8de227266d33", "title": "Layer-based visualization and biomedical information exploration of multi-channel large histological data"}, {"paperId": "e29905483efe922d39f08990c97186ef033543ef", "title": "Big Data Analytics in Healthcare Systems"}, {"paperId": "d5428dbb09ad657958da26c1df84f78553c16ebf", "title": "ETL Framework for Real-Time Business Intelligence over Medical Imaging Repositories"}, {"paperId": "86827b905c5768489e05c607ff50fe47931bc53d", "title": "A review of big data applications of physiological signal data"}, {"paperId": "9ab5073c0cbd8c6cd3cd2a4759ff0766bd9fd8be", "title": "Recent Deep Learning Techniques, Challenges and Its Applications for Medical Healthcare System: A Review"}, {"paperId": "a450c5c5b41fea77caca7d7c461c3c7efc427625", "title": "Hybrid mist-cloud systems for large scale geospatial big data analytics and processing: opportunities and challenges"}, {"paperId": "2c436d29268b00cc5de994d413a8839718fd8e3d", "title": "Bayesian classification of falls risk."}, {"paperId": "bf60032a04326b7be470800c9e2ef5f7f5554f2a", "title": "The Christmas e‐list (an ode to big data)"}, {"paperId": "d509600169c0c44ac89eead572b5656df4dc8171", "title": "Design and implementing Big Data system for cardiovascular data"}, {"paperId": "396f9bad1d9ff38e4f6d1e3c7e80e4a90b5b178d", "title": "Big Data Research in Chronic Kidney Disease"}, {"paperId": "4e69e504e03d02129c58120d80afaaf4cbc39762", "title": "Identifying probable post-traumatic stress disorder: applying supervised machine learning to data from a UK military cohort"}, {"paperId": "2632883001a43e869d747dfde9c50e00caca2862", "title": "WearableDL: Wearable Internet-of-Things and Deep Learning for Big Data Analytics - Concept, Literature, and Future"}, {"paperId": "2575058ea77619fea27b4501bb0a9f2beab5ac84", "title": "Kinematics of Big Biomedical Data to characterize temporal variability and seasonality of data repositories: Functional Data Analysis of data temporal evolution over non-parametric statistical manifolds"}, {"paperId": "df4bc9c3f572d9f6ea90e78d7e8d659ddceb4012", "title": "Electrochemical biosensor made with tyrosinase immobilized in a matrix of nanodiamonds and potato starch for detecting phenolic compounds."}, {"paperId": "33358a83c8372fd370bbd1b256bafce10ec7d666", "title": "Health informatics curriculum development for teaching and learning"}, {"paperId": "1ad93dea36274e2e86f5ef919a90944cee19ac64", "title": "Considerations for ethics review of big data health research: A scoping review"}, {"paperId": "15b90a2a679a6695cbb826dd94f2f1f96e2e0be5", "title": "Health Management for Sustainable Development"}, {"paperId": "701793df918915b6a70e2cabf6ef31b8d1e90f46", "title": "An Intelligent Multi-Objective Framework of Pervasive Information Computing"}, {"paperId": "55a8330813b441353e81ac0756a4a8019eff6e43", "title": "An infrastructure for precision medicine through analysis of big data"}, {"paperId": "153836c18890f862d8e7f51f405493829e39668b", "title": "Tackling Health Inequalities Using Urban HEART in the Sustainable Development Goals Era"}, {"paperId": "e7acd42d748cac92e60cc0a04695c1b79fb5b065", "title": "Upregulation of BUB1B, CCNB1, CDC7, CDC20, and MCM3 in Tumor Tissues Predicted Worse Overall Survival and Disease-Free Survival in Hepatocellular Carcinoma Patients"}, {"paperId": "be71df34f3364b91a83c0cf726441d05e5e4d328", "title": "Motion mapping in humans as a biomarker for psychiatric disorders"}, {"paperId": "e95b4f9b90c9c411bb103d385b6874df46663bc0", "title": "Digital Diabetes Data and Artificial Intelligence: A Time for Humility Not Hubris"}, {"paperId": "718fb5124aeb6e4b3e136f80724fb6292380e695", "title": "Data to diagnosis in global health: a 3P approach"}, {"paperId": "5a4e95148153102120de48ba689bb53068974dc3", "title": "SLA based healthcare big data analysis and computing in cloud network"}, {"paperId": "86661629a11be62d8c4bdc4c0abdb4e6aaa50a3a", "title": "Revealing Physicians Referrals from Health Insurance Claims Data"}, {"paperId": "fc9d30293860a41108d13200a4196c13b58368a5", "title": "A Novel Template - Based Data Structurization Scheme for Normalizing and Analyzing Medical Data"}, {"paperId": "a461fe778f9f9e91804f22ddbd2505f607a891f1", "title": "Context-Based Security and Privacy for Healthcare IoT"}, {"paperId": "aeb0fb9a692f59c3c13658a5d09fd0b9561c91e7", "title": "A Critical Analysis of the V-Model of Big Data"}, {"paperId": "da89b48da8b619c32e825b372050052b2eedf64a", "title": "Predicting Neonatal Condition at Birth through Ensemble Learning Methods in Pregnancy Care"}, {"paperId": "0129b3599740c82b429c8bb51122bb3d82159151", "title": "A novel fused convolutional neural network for biomedical image classification"}, {"paperId": "70c2412dbb74f065c7a40b2a56a10089b18b87ae", "title": "Signal Processing in the Era of Biomedical Big Data"}, {"paperId": "40d2f55ddcd7ecc6c2f30de45cd44e80c4602aec", "title": "Challenges for omics technologies in the implementation of personalized medicine"}, {"paperId": "c63d940015b09c15b8c619a00d0023bf27d7b4ac", "title": "A Trust Model for Ubiquitous Healthcare Environment on the Basis of Adaptable Fuzzy-Probabilistic Inference System"}, {"paperId": "d5a9daa40311b85a96b471416be8b0c5d15a0f76", "title": "Internet of Health Things: Toward intelligent vital signs monitoring in hospital wards"}, {"paperId": "3133cc762582d2b95faf291bbe48afd2488018b7", "title": "Insights into Antidepressant Prescribing Using Open Health Data"}, {"paperId": "cd45d97f0dd6d724284e868713a960aa37b153b6", "title": "Hierarchical co-evolutionary clustering tree-based rough feature game equilibrium selection and its application in neonatal cerebral cortex MRI"}, {"paperId": "6bcce38181e83f2dc65a90029a17f065e4beb714", "title": "The effectiveness of public health advertisements to promote health: a randomized-controlled trial on 794,000 participants"}, {"paperId": "cd12f7bcb043cc6476555e3750ff0448d320bae4", "title": "A pilot and comparative study between pathological and serological levels of immunoglobulin and complement among three kinds of primary glomerulonephritis"}, {"paperId": "c8489ff90cd5c1dae5d266811fd5f217ce04f566", "title": "Quantitative imaging of inflammatory disease: are we missing a trick?"}, {"paperId": "c2aa4b77864f70a2c096d472254dba0393d07df3", "title": "Impact of assistive technologies in supporting people with dementia."}, {"paperId": "5a228a30e68d1b6cb2e7ee153f6a72050be5cca8", "title": "Health geography and the big data revolution"}, {"paperId": "d5c49d94086442c7da0edb8a99df27574791fccb", "title": "A Comprehensive Study on The Usage of Big Data Analytics for Wireless and Wired Networks"}, {"paperId": "8ada84f72776956d52c7ae659adff568efcbe6c9", "title": "The Era of the Large Databases: Outcomes After Gastroesophageal Surgery According to NSQIP, NIS, and NCDB Databases. Systematic Literature Review"}, {"paperId": "111e7daa3c579208ba80c23ac33ab7e7b5b1f099", "title": "Big Data Analytics in Medicine and Healthcare"}, {"paperId": "122475b488c8ba10cf4a62c66f926b85c813d958", "title": "A novel biomedical image indexing and retrieval system via deep preference learning"}, {"paperId": "2e16c93958d4eaa133b81d2505a90081adf99638", "title": "What have we learned in minimally invasive colorectal surgery from NSQIP and NIS large databases? A systematic review"}, {"paperId": "b607e3631665367c48eae6afee829eac363949c5", "title": "Big Data Framework for Health Informatics : A Solution for Influenza Surveillance in Saudi Arabia"}, {"paperId": "4373c80dc1b0f402e3dd51848110206efe877b93", "title": "The Future of Data‐Driven Wound Care"}, {"paperId": "08405c158fab8e36305b98e773f39d773caf87f3", "title": "Understanding the complexities of traumatic brain injury: A big data approach to a big disease"}, {"paperId": "96bb0d2b4761065b854a8f2ae69d486d43712efc", "title": "Development of A Textile Capacitive Proximity Sensor and Gait Monitoring System for Smart Healthcare"}, {"paperId": "4441e227e411677e8e198febc3fec98acb439d99", "title": "Who's left out of Big Data?: How Big Data collection, analysis, and use neglect populations most in need of medical and public health research and interventions"}, {"paperId": "1884c5820cbafc3d419890cc0fb430abaa8cd1eb", "title": "Scalable Machine Learning for Predicting At-Risk Profiles Upon Hospital Admission"}, {"paperId": "904f09f9bb98c9e8620985a1a570eaf974e3dbbd", "title": "A Text Structuring Method for Chinese Medical Text Based on Temporal Information"}, {"paperId": "4e782caa179ba92d3f53a2841d2aa27f72b2113b", "title": "Survey: Big Data Application in Biomedical Research"}, {"paperId": "ab4b1a9638646e15b5e46eec75da7df39f55b192", "title": "Computational intelligence approaches for classification of medical data: State-of-the-art, future challenges and research directions"}, {"paperId": "4a4409e18ba73506b434066664fb43983dbf7fd6", "title": "Big data analytics for wireless and wired network design: A survey"}, {"paperId": "d4ad72b16b3608f1fbfe607b7063ffa5e72f9593", "title": "FogLearn: Leveraging Fog-based Machine Learning for Smart System Big Data Analytics"}, {"paperId": "2207987198b8ec7439ca967ecc1871b3685b7d97", "title": "Towards the Integration of Prescription Analytics into Health Policy and General Practice"}, {"paperId": "242c86c8084c7ba7c941a29fa78ada78b7658b4b", "title": "Implications of big data analytics in developing healthcare frameworks - A review"}, {"paperId": "412a6cb3326bbc281dca8910751d2fec881a9890", "title": "iSkin specialist — A big data based expert system for dermatology"}, {"paperId": "96fbba7a205377dafd1830f68293886a6f4ec843", "title": "Centroid Update Approach to K-Means Clustering"}, {"paperId": "125732feb2758b30654b3575a84abed0aed3d89d", "title": "Future cancer research priorities in the USA: a Lancet Oncology Commission."}, {"paperId": "7280ca80575723051779539c9f00c179bb03c637", "title": "An Interactive Healthcare System of Big Data Application with Predictive Model Analysis"}, {"paperId": "479f6c06f455afb21788282b27497cf81cb96b31", "title": "Predicting At-Risk Patient Profiles from Big Prescription Data"}, {"paperId": "d45399d800929371cc84aa84a6a480e0b5d16239", "title": "SSEL-ADE: A semi-supervised ensemble learning framework for extracting adverse drug events from social media"}, {"paperId": "941ca1b431a7b91a6dd3decb9aed9d0b62b2f849", "title": "Findings from the 2017 Yearbook Section on Health Information Management"}, {"paperId": "d7cf324d5f133757e9a496594c66559ad93792c0", "title": "Big data system for health care records"}, {"paperId": "044f75db843189c31dd7851f0bcf06154fec8753", "title": "Analyzing healthcare big data for patient satisfaction"}, {"paperId": "a02312ea60c3abdd8795498704660f101000718c", "title": "Opportunities brought by big data in providing silver digital patients with ICT-based services that support independent living and lifelong learning"}, {"paperId": "1496e303a9095720d6f5550eee26c0e7257c2d60", "title": "Data driven multi-agent m-health system to characterize the daily activities of elderly people"}, {"paperId": "92e33136d9cf76d02acdc2792e476937fe66b694", "title": "Estimation of the prevalence of adverse drug reactions from social media"}, {"paperId": "0ad33165386ff7a535c247caf1d469c6ca5e05c8", "title": "Perspectives on Big Data applications of health information"}, {"paperId": "7b0b282ed6c7ca9f6709a0ab566b72ddbe689fef", "title": "Big data in oncologic imaging"}, {"paperId": "9785a7f76b7d301dab33c8bb8844b3baad08b0ae", "title": "Optimizing drug development in oncology by clinical trial simulation: Why and how?"}, {"paperId": "12f5e25ea67750553161480ed3bbbae429be3bd3", "title": "Smart healthcare: Cloud-enabled body sensor networks"}, {"paperId": "492f8032c5feb3b19489875791cf21abfbc73222", "title": "Leveraging deep preference learning for indexing and retrieval of biomedical images"}, {"paperId": "9154c1f0099082b9e8ce0d11365907ab44d823ef", "title": "Predictive Modeling for Dengue Patient’s Length of Stay (LoS) Using Big Data Analytics (BDA)"}, {"paperId": "f446b44c37b168044c7acdad7195dfe4a84498dd", "title": "Data Science Vis-à-Vis efficient healthcare and medical systems: A techno-managerial perspective"}, {"paperId": "69097673bd39554bbbd880ef588763b073fe79c7", "title": "A novel end-to-end classifier using domain transferred deep convolutional neural networks for biomedical images"}, {"paperId": "ac6395bf5948999792e942b6655e67f86eb10a6d", "title": "Post-stroke discharge disposition prediction using deep learning"}, {"paperId": "2df19526958c895fac71519a31c71446468c09bf", "title": "An optimal healthcare self-diagnosis system using cloud framework"}, {"paperId": "940ee9f500b2c1929387cd616b598c8323595e32", "title": "Computational medicine: A cybernetic eye for rare disease"}, {"paperId": "beb7348536ac3fcc77a770ec22e58ba97113dda1", "title": "–Omic and Electronic Health Record Big Data Analytics for Precision Medicine"}, {"paperId": "c84c5d325fbd5e2f9aa37f1cdfed59885d6585c3", "title": "Invited Commentary on Stewart and Davis “ ‘Big data’ in mental health research—current status and emerging possibilities”"}, {"paperId": "d3b7015c4340ca072d6443a35c3875655cbb7adc", "title": "Quantum Computing in Big Data Analytics: A Survey"}, {"paperId": "0ba0e454b1bd8f48b2f070d60293c37d150a7aeb", "title": "Healthcare Big Data Voice Pathology Assessment Framework"}, {"paperId": "097d6bbb830e878ebd3d2aab7bb64d20b49132f7", "title": "The promise of big data technologies and challenges for image and video analytics in healthcare"}, {"paperId": "6469e22d3450139f641c64c222d2dbbb4fecccd5", "title": "Big Data Analytics for Medication Management in Diabetes Mellitus"}, {"paperId": "daee1a120072bb3ad0d1481311aec40d823c9b52", "title": "m‐Health Computing: m‐Health 2.0, Social Networks, Health Apps, Cloud, and Big Health Data"}, {"paperId": "79671fdfb08c8928b6c5f759e93284bb3ca43d8d", "title": "Classification Based on Compressive Multivariate Time Series"}, {"paperId": "72ebf791e6269abb7e8266d5a2d6bddbab0f0e14", "title": "Big Data in Health: a Literature Review from the Year 2005"}, {"paperId": "0a21768cee8393fb79b7be5ef983310809a840d8", "title": "Acoustic analysis of big ocean data to monitor fish sounds"}, {"paperId": "986f62830774788b51ac86cdf356895a45f72212", "title": "Analytics, challenges and applications in big data environment: a survey"}, {"paperId": "b256e112a5eddef20bf3940b759a617f36f762ef", "title": "An ensemble method for extracting adverse drug events from social media"}, {"paperId": "fb81157608c597db21e9376eb37661b6f66664a1", "title": "Prototype Design of a Healthcare-Analytics Pre-adoption Readiness Assessment (HAPRA) Instrument"}, {"paperId": "2c8c2d8e9a4804f453f95bc7b4e5a7373dcd15a5", "title": "Fast algorithm for scaling analysis with higher-order detrending moving average method."}, {"paperId": "3fb28d9420630f7a0af0cd418e14a29d560165fc", "title": "Wearable devices and their applications in surgical robot control and p-medicine"}, {"paperId": "33b3c9215879a70a4f818b888b27085e297e83eb", "title": "Utilizing an integrated infrastructure for outcomes research: a systematic review."}, {"paperId": "b0150dd118ebedbc3ece68726e065f9afaaf3b18", "title": "Big data analytics and big data science: a survey"}, {"paperId": "69bfc3d5912628a5e8ec7f544632a5724f6e2dad", "title": "Design of smart campus management system based on internet of things technology"}, {"paperId": "21c33efa1c240d673742fa480d40678bd5d03608", "title": "Big Data Analytics for healthcare: theory and applications"}, {"paperId": "792c79a44c322c8cc9988394cf4c79dc414e4587", "title": "Indexing-Based Peculiarity Extrication from Biomedical Images Using Deep Learning"}, {"paperId": "71ce1ce23488031e454e409014f5ee5e28e85894", "title": "Big Data for Healthcare: Opportunities and Challenges"}, {"paperId": "12b98983f8bb11fb1b97b048d570b00b8ee80648", "title": "State of the Art in Artificial Intelligence and Machine Learning Techniques for Improving Patient Outcomes Pertaining to the Cardiovascular and Respiratory Systems"}, {"paperId": "53cfa037f835eea39b2714b25a6f1f8f2389100b", "title": "Tracking algorithm of video echo signal based on big data processing"}, {"paperId": "a3f538a95ea27d8f8c2f46ed50c393b8dc91ef94", "title": "Emerging Role of Intelligent Techniques for Effective Detection and Prediction of Mental Disorders"}, {"paperId": "b4499a1bafe34f1fa584849868fb947162d1c504", "title": "Legal Dilemma and Outlet of Privacy Protection in the Era of Big Data"}, {"paperId": "3558d3149956aa6a327a0647c470f4afc164f365", "title": "Machine learning in translational bioinformatics"}, {"paperId": "18f00149cf2a460f99dfd73c949360d348523712", "title": "Adaptive Business Intelligence platform and its contribution as a support in the evolution of Hospital 4.0"}, {"paperId": "b87d9c647136190de6216adf434a60066a20e54e", "title": "Wearable Sensors and Deep Learning for the Management of Acute Pancreatitis in Precision Medicine"}, {"paperId": "6b2471b476a156851c97253053eb610828c9ff04", "title": "Recent Machine Learning Approaches for Single-Cell RNA-seq Data Analysis"}, {"paperId": "f19cc8038f2687bfc1255d2334896a83f85c0931", "title": "Big Data-Based System"}, {"paperId": "4bb4df334dc451e2a0ec3363520014a8bd1b7c52", "title": "Fog Computing Architecture for Scalable Processing of Geospatial Big Data"}, {"paperId": "f62fa1afd7a7d139e1668ce2183ad9d0243c1ebc", "title": "Big Data"}, {"paperId": "638832023df730e9ddcb03ef4c732113c6065387", "title": "Personalized disease treatment plan suggestion system based on big data and knowledge base"}, {"paperId": "9f58712921cb730feebcc91f9844d1b3bbfda4a2", "title": "Omics and the molecular exercise physiology."}, {"paperId": "c50c75c7392cfde7537aaa2df3483fc94ed907ae", "title": "Trends Prediction of Big Data: A Case Study based on Fusion Data"}, {"paperId": "10193e7bd2acfcfbb3d5f05e4c904296c8d5f221", "title": "Genomics in Big Data Bioinformatics"}, {"paperId": "1010f1b4b6b6ed471061a13d6c8bc3884fdf239a", "title": "Deep learning techniques for optimizing medical big data"}, {"paperId": "ccbfe5c0b33ee258a1f027480e23fdf1aaa46691", "title": "Emerging trends in IoT and big data analytics for biomedical and health care technologies"}, {"paperId": "1acc12bb78a8470ec5834f5fafbbabffc2da8d83", "title": "Analyzing Small Businesses' Adoption of Big Data Security Analytics"}, {"paperId": "22c992604240da56efddbf0fa85a3a06e9ef8037", "title": "Intelligent, Secure Big Health Data Management Using Deep Learning and Blockchain Technology: An Overview"}, {"paperId": "db5e521b6f3a6ee1042cdb22054175918c59052b", "title": "Title Cardiovascular Big Data Analytics"}, {"paperId": "37e3f5ce59c7de4e86b4f85c4aa23b961d5811e3", "title": "Goldstein and Stephens Revisited and Extended to a Telehealth Model of Hearing Aid Optimization"}, {"paperId": "63a6036808175b4f041634f6b182b257c625e56d", "title": "Enhancement of IoT-Based Smart Hospital System Survey Paper: Research Article"}, {"paperId": "7b5262dc7a46ac26230f69395c31849a7f27016d", "title": "Advances in multi-sensor fusion for body sensor networks: Algorithms, architectures, and applications"}, {"paperId": "c646c879e3c63a4b43f2234c19d7949c9c79631c", "title": "Big Data, Artificial Intelligence, and Machine Learning in Neurotrauma"}, {"paperId": "4f178cc3f8bbe67512c15c14d4d07c1a1e92d8c0", "title": "An Extended Views Based Big Data Model Toward Facilitating Electronic Health Record Analytics"}, {"paperId": "4e23f6772c5c1cf7ec3f18b07dba55a6472543e5", "title": "A Feature Fusion-Based Discriminant Learning Model for Diagnosis of Neuromuscular Disorders Using Single-Channel Needle Electromyogram Signals"}, {"paperId": "3fc00a37c05b5a5102e3825840d8a9184fb659d5", "title": "Computer methods for performance optimization in medical imaging networks"}, {"paperId": "c6fde495f9c56088e7d58e0bba4375705aef7196", "title": "technologies in the problems of mathematical analysis of cardiological information"}, {"paperId": "92ed8a8598af2c16ed65b28ce04b96f020d4763f", "title": "Three-Dimensional Visual Patient Based on Electronic Medical Diagnostic Records"}, {"paperId": "184f98d8d46be185488dc8d9abebf0e34cbefe32", "title": "Prediction of Heart Attacks Using Public Repository Data"}, {"paperId": "04cd343794cc5d7c3ceb5bd5fc2cb9c2b9e7a98c", "title": "Dynamic Data Aggregation Approach for Sensor-Based Big Data"}, {"paperId": "197f21d253421f81020aea49f8661d54aa1f7240", "title": "Mist Data: Leveraging Mist Computing for Secure and Scalable Architecture for Smart and Connected Health"}, {"paperId": "0696a94893afa6d0c5398185a8d12df991e62273", "title": "Magnetic Resonance Imaging Juvenile Idiopathic Arthritis Inflammation 2 Letter to the Editor: The role of conventional qualitative magnetic resonance imaging (MRI) is well- established in the management of spondyloarthritis for assessment of inflammation and structural damage. The identification of "}, {"paperId": "ab97bd3e7a2901e1a00dcee34aece3da05e34190", "title": "An Internet of Things based physiological signal monitoring and receiving system for virtual enhanced health care network."}, {"paperId": "d4931c42881bd826d470ced0a61e9bec6befe2ff", "title": "Big Data and Analytics: Application to Healthcare Industry"}, {"paperId": "4dd4fb8c739ebf3156f92b71d6ccaeee5584946b", "title": "Big Data in Drug Discovery."}, {"paperId": "e6ce0f5dca5338daed45b56ebe2938aebe685a2f", "title": "Risks, Security, and Privacy for HIV/AIDS Data: Big Data Perspective"}, {"paperId": "8a0d2b7422e5bbe275eb458ceaa4e95db1b1fbb9", "title": "Big Data and Data Science Applications for Independent and Healthy Living"}, {"paperId": "ec9d9b185384e98ba7bd28008f4c3e081465a9e5", "title": "An optimal big data workflow for biomedical image analysis"}, {"paperId": "790b85dd43f5caf71e0244e9fc92959677052424", "title": "Optimization of EHR Data Flow Toward Healthcare Analytics"}, {"paperId": "acbbd57fd69bb2d48fa8498e2ad8aa67ed84291d", "title": "Fog Assisted Cloud Computing in Era of Big Data and Internet-of-Things: Systems, Architectures, and Applications"}, {"paperId": "d18267a24a8fcb7447b42ef886f65ffb15b0511e", "title": "Advanced bioanalytics for precision medicine"}, {"paperId": "fd00f4e4c2ebdbb091a8f0a53b041bd207501da0", "title": "care HCI Security and forensics Education User authentication Deception detection Smart tutoring Teaching assistant Posture recognition Gesture detection"}, {"paperId": "2f67ab6d70caef4f756bfe305c20138032b5eb35", "title": "A Review on Big Data Security and Privacy in Healthcare Applications"}, {"paperId": "b545ce671829521fe6807d22da147cde7e035d57", "title": "Analyzing Healthcare Big Data With Prediction for Future Health Condition"}, {"paperId": "2fc00f2a8f430a5e99b4b3d5bc7ff08ad67f36c9", "title": "Disease Surveillance Big Data Platform for Large Scale Event Processing"}, {"paperId": "1a9b64cdb49c348550b1ea1731b6e8a138a6c596", "title": "Bio and Micro-Electronics eLearning by Online Collaborative Support"}, {"paperId": "cfc1b5276a006d30964d6baa2fdf11509f152f25", "title": "Bibliography"}]}
