{"paperId": "5f32a61e091e3d08c2dee94b0c5c7ca5a18e38d1", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Comprehensive Evaluation Method of Ethnic Costume Color Based on K-Means Clustering Method", "abstract": "Color is the external manifestation of ethnic minority culture, and the costume of each ethnic group has its objective color matching rules. In the color design of minority costumes, there is often a lack of scientific evaluation methods. Aiming at this problem, this article proposed a comprehensive evaluation method, based on the K-Means clustering method, for evaluating color matching schemes of minority costumes. We used the K-Means clustering method to analyze the objective laws of minority costume colors, and based on the objective laws found, we extracted the objective evaluation indicators. With the AHP (analytic hierarchy process) method, the judgment matrix was established to obtain the relative weights of each cultural image and objective evaluation indicator. Based on the trapezoidal fuzzy number, the user’s evaluation value of the cultural image index was clarified. The GRA-TOPSIS evaluation method was introduced to rank the color matching schemes of minority costumes. Taking the evaluation of the color matching scheme of Yi costumes as an example, this article confirmed that the proposed comprehensive evaluation method can effectively screen out the color matching schemes with the characteristics of minority costumes and can rank the color schemes to be evaluated according to their relative similarity degree to the color characteristics of minority costumes. The method integrated subjective and objective evaluations, overcame the problem of contradictory results of subjective and objective evaluations, and achieved a certain degree of symmetry between the objectivity of the color laws of minority costumes and the subjectivity of the cultural image of minority costumes. In addition, we also found the possibility of using K-Means clustering to extract the main color features of minority costumes to improve the design of color schemes.", "venue": "Symmetry", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-30", "journal": {"name": "Symmetry", "pages": "1822", "volume": "13"}, "authors": [{"authorId": "2157799204", "name": "Lingyun Zhao"}, {"authorId": "47197240", "name": "Zhenya Wang"}, {"authorId": "1908408309", "name": "Yaxue Zuo"}, {"authorId": "13242373", "name": "Danyang Hu"}], "citations": [{"paperId": "75a17ae59e4fbc3bc8a623120493611ac6a7525a", "title": "Impressions of Guangzhou city in Qing dynasty export paintings in the context of trade economy: a color analysis of paintings based on k-means clustering algorithm"}, {"paperId": "db09c3b647d4c5a080abfd835ce31cae38d9efa7", "title": "Constructing a Mathematical Model of Product Color Design Based on Data Mining: Case Study of a Thermos Cup"}, {"paperId": "8741504e9dc1aee41e2985d51be151f94892d591", "title": "Unveiling Patterns and Colors in Architectural Paintings: An Analysis by K-Means++ Clustering and Color Ratio Analysis"}, {"paperId": "362555d9e7d2f5b8f16e9d7973863a4964bd763c", "title": "K-Means Clustering Algorithm Based on Memristive Chaotic System and Sparrow Search Algorithm"}, {"paperId": "36cbf37930a0f0ddc61124eca9d40c6806e534ea", "title": "A New Meta-Heuristics Data Clustering Algorithm Based on Tabu Search and Adaptive Search Memory"}]}
