{"paperId": "5f35699fee82f6e8f3d1bbcc238c934804f7be3d", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Deep reinforcement learning‐based resource allocation in multi‐access edge computing", "abstract": "Network architects and engineers face challenges in meeting the increasing complexity and low‐latency requirements of various services. To tackle these challenges, multi‐access edge computing (MEC) has emerged as a solution, bringing computation and storage resources closer to the network's edge. This proximity enables low‐latency data access, reduces network congestion, and improves quality of service. Effective resource allocation is crucial for leveraging MEC capabilities and overcoming limitations. However, traditional approaches lack intelligence and adaptability. This study explores the use of deep reinforcement learning (DRL) as a technique to enhance resource allocation in MEC. DRL has gained significant attention due to its ability to adapt to changing network conditions and handle complex and dynamic environments more effectively than traditional methods. The study presents the results of applying DRL for efficient and dynamic resource allocation in MEC Computing, optimizing allocation decisions based on real‐time environment and user demands. By providing an overview of the current research on resource allocation in MEC using DRL, including components, algorithms, and the performance metrics of various DRL‐based schemes, this review article demonstrates the superiority of DRL‐based resource allocation schemes over traditional methods in diverse MEC conditions. The findings highlight the potential of DRL‐based approaches in addressing challenges associated with resource allocation in MEC.", "venue": "Concurrency and Computation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-22", "journal": {"name": "Concurrency and Computation: Practice and Experience"}, "authors": [{"authorId": "2238864131", "name": "Mohsen Khani"}, {"authorId": "145236791", "name": "Mohammad Mohsen Sadr"}, {"authorId": "2238867166", "name": "Shahram Jamali"}], "citations": []}
