{"paperId": "5f3be55fe2428f6c887525adc786a4962f9b8aac", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "LATTICE: A Framework for Optimizing IoT System Configurations at the Edge", "abstract": "The Internet of Things is expected to contribute to a \"smarter world\" by connecting the physical to the virtual, i.e., enabling advanced knowledge engineering over the big data gathered about the physical world. However, such a promise comes along with high resource consumption, spanning the network, storage and computational resources, not to mention possible security and privacy threats. As a result, it tends to be admitted that the IoT smartness will not be accommodated at scale by a centralized cloud-based approach. Instead, the deployment of IoT systems needs to leverage a highly distributed system architecture, which optimizes the distribution of the computation -from the edge to the cloud-according to the unique business requirements in terms of financial cost, latency, availability, etc. Toward that goal, this paper introduces the LATTICE framework, which aims at taming the complexity of configuring edge-based IoT systems. LATTICE builds upon ontologies that have proven useful to characterize the constituents of IoT systems in the required domain-specific way. However, LATTICE also revisits the exploitation of ontologies -i.e., the formal description of the real world, spanning the physical and cyber entities-across the development life-cycle of the IoT systems. As a first evidence, this paper introduces an automated approach to the optimization of IoT system configurations at the edge, provided the ontological description of the target IoT system.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-07", "journal": {"name": "2019 IEEE 39th International Conference on Distributed Computing Systems (ICDCS)", "pages": "1797-1805"}, "authors": [{"authorId": "1688880", "name": "V. Issarny"}, {"authorId": "2939721", "name": "Benjamin Billet"}, {"authorId": "1690525", "name": "Georgios Bouloukakis"}, {"authorId": "144456394", "name": "D. Florescu"}, {"authorId": "145561085", "name": "Cristian Toma"}], "citations": [{"paperId": "bb9b3f957bb0800dfb140e8ff263f850c26eba89", "title": "DBAC: Directory-Based Access Control for Geographically Distributed IoT Systems"}, {"paperId": "d4f60b0b2a023d02aad91aa77ff321c0888dad9e", "title": "Design and Implementation of a Hydroponic Strawberry Monitoring and Harvesting Timing Information Supporting System Based on Nano AI-Cloud and IoT-Edge"}, {"paperId": "ab9a7dc0e236f585242cb4f62ca7ffe5671cdd30", "title": "2019 IEEE 39th International Conference on Distributed Computing Systems (ICDCS)"}]}
