{"paperId": "5f4634aa233231551b832729ac753fdfd0dd8f11", "publicationVenue": {"id": "a1bc5e0b-242c-43d7-9102-e363f279bb41", "name": "Production Engineering Archives", "alternate_names": ["Prod Eng Arch"], "issn": "2353-5156", "url": "http://www.qpij.pl/about-production-engineering-archives", "alternate_urls": ["http://www.qpij.pl/production-engineering-archives"]}, "title": "Agri-Food 4.0 and Innovations: Revamping the Supply Chain Operations", "abstract": "Abstract The agri-food sector contributes significantly to economic and social advancements globally despite numerous challenges such as food safety and security, demand and supply gaps, product quality, traceability, etc. Digital technologies offer effective and sustainable ways to these challenges through reduced human interference and improved data-accuracy. Innovations led by digital transformations in the agri-food supply chains (AFSCs) are the main aim of ‘Agri-Food 4.0’. This brings significant transformations in the agri-food sector by reducing food wastage, real-time product monitoring, reducing scalability issues, etc. This paper presents a systematic review of the innovations in the agri-food for digital technologies such as internet-of-things, artificial intelligence, big data, RFID, robotics, block-chain technology, etc. The employment of these technologies from the ‘farm to fork’ along AFSC emphasizes a review of 159 articles solicited from different sources. This paper also highlights digitization in developing smart, sensible, and sustainable agri-food supply chain systems.", "venue": "Production Engineering Archives", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-06-01", "journal": {"name": "Production Engineering Archives", "pages": "75 - 89", "volume": "27"}, "authors": [{"authorId": "2111666467", "name": "Vasavi Dadi"}, {"authorId": "2111666552", "name": "Suryadevara Ram Nikhil"}, {"authorId": "152505495", "name": "R. Mor"}, {"authorId": "2257157378", "name": "Tripti Agarwal"}, {"authorId": "2257150681", "name": "Sapna Arora"}], "citations": [{"paperId": "f1d408f6c5f08229bd14f877c6470a94a28fdce8", "title": "Role of industry 4.0 in augmenting endurability of agri-food supply chains amidst pandemic: organisation flexibility as a moderator"}, {"paperId": "d129c190c522ac4d83318cb0bff20887c5e4d7ab", "title": "A comprehensive survey on IoT and AI based applications in different pre-harvest, during-harvest and post-harvest activities of smart agriculture"}, {"paperId": "5c00f23f33f39a1bb3797c02e4a3a368ab8bd808", "title": "Harvesting a sustainable future: An overview of smart agriculture's role in social, economic, and environmental sustainability"}, {"paperId": "8090ac2ec4288ccca2c3d07a94cbc82ec0d1cb5f", "title": "Performance of cold chain logistics service providers in the fast-moving consumer goods industry in Nigeria: a systematic review"}, {"paperId": "ea7c98c30e491a4ae0c237479d7e54351c796321", "title": "Optimizing Supply Chain in a Foundry Through Computer Simulation Using Flexsim – A Case Study"}, {"paperId": "a3c18747417218dcb8a51229a2167592303bedd0", "title": "Virtual Reality-Based Digital Twins: A Case Study on Pharmaceutical Cannabis"}, {"paperId": "851ffba8830c745e8ab1db6d9c60fa855eca93d1", "title": "A critical analysis of the integration of blockchain and artificial intelligence for supply chain"}, {"paperId": "72a39d0a395d454390e54b0a8be1b5cfa6cf6ceb", "title": "Digital innovations in the post-pandemic era towards safer and sustainable food operations: A mini-review"}, {"paperId": "2e2be9813746734119d8ec00e316f0d3e785046e", "title": "Agriculture Supply Chain Optimization in East Java"}]}
