{"paperId": "5f479370fc56c580fe67bbac7fba2a6b20a5a5b6", "publicationVenue": null, "title": "Performance Assessment of Context-aware Online Learning for Task Offloading in Vehicular Edge Computing Systems", "abstract": "Vehicular Edge Computing (VEC) systems have recently become an essential computing infrastructure to support a plethora of applications entailed by smart and connected vehicles. These systems integrate the computing resources of edge and cloud servers and utilize them to execute computational tasks offloaded from various vehicular applications. However, the highly fluctuating status of VEC resources besides the varying characteristics and requirements of different application types introduce extra challenges to task offloading. Hence, this paper presents, implements and evaluates various task offloading algorithms based on the Multi-Armed Bandit (MAB) theory for VEC systems with predefined application types. These algorithms seek to make use of available contextual information to better steer task offloading. These information include application type, application characteristics, network status and server utilization. The proposed algorithms are based on having either a single MAB learner with application-dependent reward assignment, multiple application-dependent MAB learners or dedicated contextual bandits implemented as an array of incremental learning models. They have been implemented and extensively evaluated using the EdgeCloudSim simulation tool. Their performance has been assessed based on task failure rate, service time and Quality of Experience (QoE) and compared to that of recently reported algorithms. Simulation results demonstrate that the proposed contextual bandit-based algorithm outperforms its counterparts in terms of failure rate and QoE while having comparable service time values. It has achieved up to 73.4% and 21.7% average improvements in failure rate and QoE, respectively, among all application types. In addition, it efficiently utilizes the available contextual information to make appropriate offloading decisions for tasks originating from different application types achieving more balanced utilization of the available VEC resources. Ultimately, employing incremental learning to implement the proposed contextual bandit algorithm has shown a profound potential to cope with dynamic changes of the simulated VEC systems. Keywords—Vehicular edge computing; task offloading; multiarmed bandits; contextual bandits", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "12"}, "authors": [{"authorId": "1403807850", "name": "Mutaz A. B. Al-Tarawneh"}, {"authorId": "2247588122", "name": "Saif E."}], "citations": [{"paperId": "7d2ef60004a784a53c854b84aaab8b6f8ff133a3", "title": "Optimizing Task and CPU Predictions in Vehicular Edge Computing Orchestrators"}, {"paperId": "0c53cfbd0c32bdba7e38684deb084bda074bcbad", "title": "Dependent Application Offloading in Edge Computing"}, {"paperId": "f988d535b44a9444983cd1cf070f539c8891af5c", "title": "Deep Reinforcement Learning Edge Workload Orchestrator for Vehicular Edge Computing"}, {"paperId": "51112393e412c5d9bdba82f3b9feb85d54035498", "title": "Evaluation of Multi-armed Bandit-based Online Machine Learning Model Selection for Service Time Prediction in Vehicular Edge Computing"}, {"paperId": "77f733dbfc4e5d990157086dc782192f68b61f13", "title": "ROMA: Resource Orchestration for Microservices-based 5G Applications"}, {"paperId": "e506d89e8dd53116272e8e3833d08bb6747598c7", "title": "Evaluation of Online Machine Learning Algorithms for Electricity Theft Detection in Smart Grids"}]}
