{"paperId": "5f6657b3b129d0680a3c554b41e032f9ce846d43", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Understanding the Diverging User Trajectories in Highly-related Online Communities during the COVID-19 Pandemic", "abstract": "As the COVID-19 pandemic is disrupting life worldwide, related online communities are popping up. In particular, two “new” communities, /r/China flu and /r/Coronavirus, emerged on Reddit and have been dedicated to COVID- related discussions from the very beginning of this pandemic. With /r/Coronavirus promoted as the official community on Reddit, it remains an open question how users choose between these two highly-related communities.\n\nIn this paper, we characterize user trajectories in these two communities from the beginning of COVID-19 to the end of September 2020. We show that new users of /r/China flu and /r/Coronavirus were similar from January to March. After that, their differences steadily increase, both in language distance and membership prediction, as the pandemic continues to unfold. Furthermore, users who started at /r/China flu from January to March were more likely to leave, while those who started in later months tend to remain highly “loyal”. To understand this difference, we develop a movement analysis framework to understand membership changes in these two communities and identify a significant proportion of /r/China flu members (around 50%) that moved to /r/Coronavirus in February. This movement turns out to be highly predictable based on other subreddits that users were previously active in. Our work demonstrates how two highly-related communities emerge and develop their own identity in a crisis, and highlights the important role of existing communities in understanding such an emergence.", "venue": "International Conference on Web and Social Media", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-22", "journal": {"pages": "888-899"}, "authors": [{"authorId": "49050667", "name": "Jason Zhang"}, {"authorId": "145832870", "name": "Brian Keegan"}, {"authorId": "1569105854", "name": "Q. Lv"}, {"authorId": "2111727675", "name": "Chenhao Tan"}], "citations": [{"paperId": "d56fed75c01c6bfb3f37a59f95f174c2b93c5cda", "title": "Jump off the Bandwagon? Characterizing Bandwagon Fans' Future Loyalty in Online NBA Fan Communities"}, {"paperId": "f2b4a91e22666da5b79fd2d89ab913ea0a2cd5b0", "title": "Sentiment analysis of the COVID-19 vaccine perception"}, {"paperId": "a1693b1cc49494befbb9d67a9d48f7e3efa33106", "title": "Governance Capture in a Self-Governing Community: A Qualitative Comparison of the Serbo-Croatian Wikipedias"}, {"paperId": "ad72da254216948df9052039d063fb58805c9d9b", "title": "Photographs, Visual Memes, and Viral Videos: Visual Phatic News Sharing on WhatsApp during the COVID-19 Pandemic in Spain, Italy, and The Netherlands"}, {"paperId": "78a71b0734297627ed7b97a3b3a4dbc54bc55983", "title": "Measuring COVID-19 Related Media Consumption on Twitter"}, {"paperId": "ab1ec966f640e98f3b3bbc569ca413aa3f626866", "title": "Facts do not speak for themselves: Community norms, dialog, and evidentiary practices in discussions of COVID-19 on Reddit"}, {"paperId": "cd14f9b49c9893678d63b59ce83a59448df68e76", "title": "Exploring Temporal and Multilingual Dynamics of Post-Disaster Social Media Discourse: A Case of Fukushima Daiichi Nuclear Accident"}, {"paperId": "452edcee44036eee178e4450680c16e4da36f412", "title": "Wisdom of Two Crowds: Misinformation Moderation on Reddit and How to Improve this Process---A Case Study of COVID-19"}, {"paperId": "b5fc8a98522979679289f84e2a9c9e042955b83f", "title": "COVID ONLY ON THURSDAYS: DEALING WITH AN INFODEMIC IN LANGUAGE- AND REGION-BASED ONLINE COMMUNITIES"}, {"paperId": "9c33e59681788fd6b17fbc97d4d09b3a77de79b3", "title": "Politics, not Vulnerability: Republicans Discriminated against Chinese-born Americans throughout the COVID-19 Pandemic"}, {"paperId": "285aa290710918c19bf3fd5b6de310e7eacbecb9", "title": "Exporting Geography Into A Virtual Landscape: A Global Pandemic Locally Discussed"}, {"paperId": "dda9d9b371a7961be74fcfd77923d87d008b99dd", "title": "No Community Can Do Everything: Why People Participate in Similar Online Communities"}, {"paperId": "af25263a64689e1994993caf69c75ab3e510f96e", "title": "The Evolution of Discourse in Online Communities Devoted to a Pandemic"}, {"paperId": "d2e615d0b47a0cd938080c1981f986dc50e273e2", "title": "The COVID‐19 pandemic and the search for structure: Social media and conspiracy theories"}, {"paperId": "b99b6bfc999ca8b12e9dc56ac41a18b207609d2c", "title": "A repeated-measures study on emotional responses after a year in the pandemic"}, {"paperId": "2a8e9e2d1d3c2a4fe01bafe2f250312c6001ad93", "title": "Political Discussion is Abundant in Non-political Subreddits (and Less Toxic)"}, {"paperId": "94cbd99a7c354aa17d5c1857a946a652a04090fd", "title": "Network Shocks and Social Support Among Spanish, Dutch, and Italian WhatsApp Users During the First Wave of the COVID-19 Crisis: An Exploratory Analysis of Digital Social Resilience"}, {"paperId": "1388ef42a8fe862aa2a1638fe186f03a3e4522a6", "title": "Worry, coping and resignation - A repeated-measures study on emotional responses after a year in the pandemic"}]}
