{"paperId": "5f6e20eef611ea5257db246a8cac11cce344e241", "publicationVenue": {"id": "026f4249-5e18-4b4c-b47a-aa1927ad7498", "name": "Asian Journal of Research in Computer Science", "type": "journal", "alternate_names": ["Asian J Res Comput Sci"], "issn": "2581-8260", "url": "http://www.sciencedomain.org/"}, "title": "The Security Challenges of Big Data Analytics: A Systematic Literature Review", "abstract": "The huge amount of data generated from heterogeneous sources such as social networking sites, healthcare applications, sensor networks and many other sources are drastically increasing from time to time swiftly.  Big Data is described as extremely large datasets that have grown beyond the capability to manage and analyze them with traditional database processing tools.  Big data analytics is the use of advanced analytical techniques against a very large heterogeneous datasets that include structured, semi-structured and unstructured data from different sources. The larger the quantity of data by itself is not advantageous unless analyzed to produce valuable information. This deluge amount of data creates an operational risk in which, the risks arise from storage devices, security of tools or the technologies used to analyze the data. In this paper, we perform a systematic literature review to give comprehensive review of security challenges and risks related to big data analytics. Security mechanisms such as cryptographic and non-cryptographic techniques are used to secure big data during analytics. The security of big data at rest and in transit gets enough investigation while a few researches had done at securing data at processing stage. Even though a number of possible techniques were proposed for big data security, it still suffers performance issues. This article is trying to explor security issues that used for preserving the Confidentiality, Integrity and Availability (CIA triad), non-repudiation as well as Access control in the context of big data analytics. Finally, we identify open future research directions for security of big data analytics. This paper also can serve as a good reference source for the development of modern security-preserving techniques to address various challenges of big data analytics security and privacy-issues.", "venue": "Asian Journal of Research in Computer Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-14", "journal": {"name": "Asian Journal of Research in Computer Science"}, "authors": [{"authorId": "101997225", "name": "Tewodros Tilahun"}, {"authorId": "82888574", "name": "Solomon Tsegaye"}], "citations": []}
