{"paperId": "5f7888cda51b85c128edccaa8ead3bd7216e492b", "publicationVenue": {"id": "4efb9ad7-9740-4922-b9c8-c29376ca2223", "name": "Polymers", "type": "journal", "issn": "2073-4360", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169222", "alternate_urls": ["https://www.mdpi.com/journal/polymers", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169222"]}, "title": "Variations in Microstructural and Physicochemical Properties of Soy Wax/Soybean Oil-Derived Oleogels Using Soy Lecithin", "abstract": "Emerging natural-based polymers and materials progress and new technology innovations open the way for unique food products with high nutritional value development. In this regard, oleogel may be essential in replacing fatty acids from food products. In this study, we researched the effects of varied soy lecithin (SYL) concentrations on the various physicochemical characteristics of soy wax (SW)/refined soybean oil (RSO) oleogels. These oleogels had a soft texture. The microscopic analysis of the oleogels suggested that the thickness, length, and density of the wax crystals (needle-shaped) varied as the SYL content was changed. Colorimetric analysis indicated that the oleogels were slightly yellowish. FTIR spectrometry helped analyze the functional groups of the raw materials and the oleogels. All the functional groups present in the raw materials could be accounted for within the oleogels. The only exception is the hydrogen-bonding peak in SW, which was not seen in the FTIR spectrum of the oleogels. It was found that at a critical SYL content, the oleogel showed a stable and repeatable wax network structure. This can be described by the presence of the uniformly distributed fat crystal network in the sample. The DSC analysis revealed that the oleogel samples were thermo-reversible, with their melting and crystallization temperatures ~43 °C and ~22 °C, respectively. In gist, it can be concluded that the incorporation of SYL can impact the color, wax crystal network characteristics, thermal characteristics, and mechanical characteristics of the oleogels in a composition-dependent manner.", "venue": "Polymers", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-20", "journal": {"name": "Polymers", "volume": "14"}, "authors": [{"authorId": "2185762653", "name": "Biswajit Sena"}, {"authorId": "151375258", "name": "S. Dhal"}, {"authorId": "2121535462", "name": "Deblu Sahu"}, {"authorId": "14810153", "name": "P. Sarkar"}, {"authorId": "46302088", "name": "B. Mohanty"}, {"authorId": "8031871", "name": "M. Jarzębski"}, {"authorId": "117526884", "name": "M. Wieruszewski"}, {"authorId": "2065840983", "name": "H. Behera"}, {"authorId": "47473161", "name": "K. Pal"}], "citations": [{"paperId": "5cce49a915ea99d82a14429524550b691cc904fd", "title": "Lecithin’s Roles in Oleogelation"}, {"paperId": "37e61fd73161ca818bc0e3e06f3c3dedec63f2b2", "title": "Effect of ultrasonication on the properties of carnauba wax-based soybean oleogel"}, {"paperId": "8915d78807e1b068db847f404ae51035dface10a", "title": "Investigation of the effect of hydrocarbons and monoesters in the gelators' composition on the properties of edible oleogel"}, {"paperId": "5a353901be55cc02af027d0244e5d51b545c23ef", "title": "Preparation of Citral Oleogel and Antimicrobial Properties"}, {"paperId": "f02c884c88f47f839af8739149a3acc6a033fa48", "title": "Effect of Cholesterol on Oral Delivery of Curcumin Using Oleogels Containing Wheat Germ Oil and Rose Floral Wax"}, {"paperId": "14ae4860518cc83b6090b90873c294f9cd747a23", "title": "The potential of rapeseed (canola) oil nutritional benefits wide spreading via oleogelation"}, {"paperId": "8fe8dc9810485a6aea4860356a2950b378ab50e0", "title": "Waxy Oleogels for Partial Substitution of Solid Fat in Margarines"}, {"paperId": "cf423b6011a577d4f8e92099884b14fb20c81eed", "title": "Comparative Analysis and Determination of the Fatty Acid Composition of Kazakhstan’s Commercial Vegetable Oils by GC-FID"}, {"paperId": "9ca5c986f24562632f399f8c65f6ae998e8ba6b0", "title": "﻿Potential risk resulting from the influence of static magnetic field upon living organisms. Numerically simulated effects of the static magnetic field upon fatty acids and their glycerides"}, {"paperId": "14304a255b8f466b9e534a291b0c7f9deb6a9ea8", "title": "Structuring of Cold Pressed Oils: Evaluation of the Physicochemical Characteristics and Microstructure of White Beeswax Oleogels"}, {"paperId": "afa635a2663b8bcd4478b5c7b0af4379080d58de", "title": "Oleogels—Innovative Technological Solution for the Nutritional Improvement of Meat Products"}, {"paperId": "452b982a511bc35e6bb828006cc17253a8baa0ad", "title": "The Feasibility of Shellac Wax Emulsion Oleogels as Low-Fat Spreads Analyzed by Means of Multidimensional Statistical Analysis"}]}
