{"paperId": "5f7dac49ee62034012fd77e787a4c749320f9fc7", "publicationVenue": {"id": "49bb481c-95dc-4e09-a921-95f6c7f78ab8", "name": "Conference of the Open Innovations Association", "type": "conference", "alternate_names": ["FRUCT", "Conf Open Innov Assoc"], "url": "http://fruct.org/"}, "title": "Model for Implementing a IoMT Architecture with ISO/IEC 27001 Security Controls for Remote Patient Monitoring", "abstract": "Due to the recent pandemic, the healthcare sector has been forced to incorporate new technologies into its systems, such as IoT and Fog Computing. However, being new technologies, they are prone to security breaches. From this context, it is identified that medical systems do not have a sufficient level of security, due to the use of new technologies such as IoT and the lack of controls to protect these new technologies. Therefore, a model for implementing an Internet of Medical Things (IoMT) Architecture with ISO/IEC 27001 security controls for remote patient monitoring is proposed. This model has 4 stages: Stage 1 selects an information security standard for the healthcare sector. Stage 2 selects the information security controls of the selected standard. Stage 3 selects and evaluates an IoMT architecture applicable to the healthcare sector. And Stage 4 designs the information security controls for each layer of the IoMT architecture. The IoMT architecture and information security controls are simulated and experimented with physicians (the productivity of the system) and with information security expert (the quality of the implemented controls). The results of the first experiment show that “effectiveness”, “productivity”, and “satisfaction” regarding the use of the IoMT architecture have an average rating of 4.05 (high level). The results of the second experiment show that “Information Security”, “Awareness” and “Security Incident Management” regarding the quality of the security controls implemented have an average rating of 3.65 (high level).", "venue": "Conference of the Open Innovations Association", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-09", "journal": {"name": "2022 32nd Conference of Open Innovations Association (FRUCT)", "pages": "38-48"}, "authors": [{"authorId": "2192868559", "name": "Brandon Alegría"}, {"authorId": "2147199482", "name": "Lenis Wong"}, {"authorId": "2192867206", "name": "Diego Bedriñiana"}], "citations": []}
