{"paperId": "5f7f5e6d952d5136169f1fa28fc5de111c077d27", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Global stability and parameter analysis reinforce therapeutic targets of PD-L1-PD-1 and MDSCs for glioblastoma", "abstract": "Glioblastoma (GBM) is an aggressive primary brain cancer that currently has minimally effective treatments. Like other cancers, immunosuppression by the PD-L1-PD-1 immune checkpoint complex is a prominent axis by which glioma cells evade the immune system. Myeloid-derived suppressor cells (MDSCs), which are recruited to the glioma microenviroment, also contribute to the immunosuppressed GBM microenvironment by suppressing T cell functions. In this paper, we propose a GBM-specific tumor-immune ordinary differential equations model of glioma cells, T cells, and MDSCs to provide theoretical insights into the interactions between these cells. Equilibrium and stability analysis indicates that there are unique tumorous and tumor-free equilibria which are locally stable under certain conditions. Further, the tumor-free equilibrium is globally stable when T cell activation and the tumor kill rate by T cells overcome tumor growth, T cell inhibition by PD-L1-PD-1 and MDSCs, and the T cell death rate. Bifurcation analysis suggests that a treatment plan that includes surgical resection and therapeutics targeting immune suppression caused by the PD-L1-PD1 complex and MDSCs results in the system tending to the tumor-free equilibrium. Using a set of preclinical experimental data, we implement the approximate Bayesian computation (ABC) rejection method to construct probability density distributions that estimate model parameters. These distributions inform an appropriate search curve for global sensitivity analysis using the extended fourier amplitude sensitivity test. Sensitivity results combined with the ABC method suggest that parameter interaction is occurring between the drivers of tumor burden, which are the tumor growth rate and carrying capacity as well as the tumor kill rate by T cells, and the two modeled forms of immunosuppression, PD-L1-PD-1 immune checkpoint and MDSC suppression of T cells. Thus, treatment with an immune checkpoint inhibitor in combination with a therapeutic targeting the inhibitory mechanisms of MDSCs should be explored.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Biology", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-16", "journal": {"name": "Journal of Mathematical Biology", "volume": "88"}, "authors": [{"authorId": "2217530538", "name": "Hannah G. Anderson"}, {"authorId": "2037439386", "name": "Gregory P. Takacs"}, {"authorId": "2075343127", "name": "Duane C. Harris"}, {"authorId": "2075288011", "name": "Y. Kuang"}, {"authorId": "2274944799", "name": "Jeffrey K. Harrison"}, {"authorId": "2645402", "name": "Tracy L. Stepien"}], "citations": []}
