{"paperId": "5f84ff93ce5bb1fb5855d7eccfbe3da57d6b0233", "publicationVenue": {"id": "e02accb9-dacc-43fd-995e-92fe9a825cc4", "name": "Design, Automation and Test in Europe", "type": "conference", "alternate_names": ["Design, Automation, and Test in Europe", "DATE", "Des Autom Test Eur"], "issn": "1530-1591", "alternate_issns": ["1558-1101"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000198/all-proceedings", "alternate_urls": ["http://www.date-conference.com/"]}, "title": "Light Flash Write for Efficient Firmware Update on Energy-harvesting IoT Devices", "abstract": "Firmware update is an essential service on Internet-of-Things (IoT) devices to fix vulnerabilities and add new functionalities. Firmware update is energy-consuming since it involves intensive flash erase/write operations. Nowadays, IoT devices are increasingly powered by energy harvesting. As the energy output of the harvesters on IoT devices is typically tiny and unstable, a firmware update will likely experience power failures during its progress and fail to complete. This paper presents an approach to increase the success rate of firmware update on energy-harvesting IoT devices. The main idea is to first conduct a lightweight flash write with reduced erase/write time (and thus less energy consumed) to quickly save the new firmware image to flash memory before a power failure occurs. To ensure a long data retention time, a reinforcement step follows to re-write the new firmware image on the flash with default erase/write configuration when the system is not busy and has free energy. Experiments conducted with different energy scenarios show that our approach can significantly increase the success rate and the efficiency of firmware update on energy-harvesting IoT devices.", "venue": "Design, Automation and Test in Europe", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-01", "journal": {"name": "2023 Design, Automation & Test in Europe Conference & Exhibition (DATE)", "pages": "1-6"}, "authors": [{"authorId": "50152732", "name": "Songran Liu"}, {"authorId": "2245111", "name": "Mingsong Lv"}, {"authorId": "2155468025", "name": "Wei Zhang"}, {"authorId": "49835649", "name": "Xu Jiang"}, {"authorId": "1997909", "name": "Chuancai Gu"}, {"authorId": "2122901429", "name": "Tao Yang"}, {"authorId": "2069966251", "name": "Wang Yi"}, {"authorId": "2120206555", "name": "Nan Guan"}], "citations": []}
