{"paperId": "5f8a03c0546b2ae1c7da48111f6da3f39c76bc85", "publicationVenue": {"id": "59eaa32d-b026-4d64-beaa-c422bc2629ed", "name": "Small", "type": "journal", "issn": "1613-6810", "url": "http://www.small-journal.com/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/16136829", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1613-6829"]}, "title": "Photomechaelectric Nanogenerators with Different Photoisomers and Dipole Units for Harvesting UV Light Energy.", "abstract": "To date, transforming environmental energy into electricity through a non-mechanical way is challenging. Herein, a series of photomechaelectric (PME) polyurethanes containing azobenzene-based photoisomer units and ionic liquid-based dipole units are synthesized, and corresponding PME nanogenerators (PME-NGs) to harvest electricity are fabricated. The dependence of the output performance of PME-NGs on the structure of the polyurethane is evaluated. The results show that the UV light energy can directly transduce into alternating-current (AC) electricity by PME-NGs via a non-mechanical way. The optimal open-circuit voltage and short-circuit current of PME-NGs under UV illumination reach 17.4 V and 696 µA, respectively. After rectification, the AC electricity can be further transformed into direct-current (DC) electricity and stored in a capacitor to serve as a power system to actuate typical microelectronics. The output performance of PME-NGs is closely related to the hard segment content of the PME polyurethane and the radius of counter anions in the dipole units. Kelvin probe force microscopy is used to confirm the existence of the PME effect and the detailed mechanism about the generation of AC electricity in PME-NGs is proposed, referring to the back and forth drift of induced electrons on the two electrodes in contact with the PME polyurethanes.", "venue": "Small", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-31", "journal": {"name": "Small", "pages": "\n          e2307786\n        "}, "authors": [{"authorId": "2173542297", "name": "Jiefei Sui"}, {"authorId": "2272751228", "name": "Pengpeng Liu"}, {"authorId": "2272981877", "name": "Yifan Jia"}, {"authorId": "2277519117", "name": "Ruiling Guo"}, {"authorId": "80456007", "name": "Lixia Bao"}, {"authorId": "2181803932", "name": "Jin Zhao"}, {"authorId": "2278003886", "name": "Lulu Dong"}, {"authorId": "2277463635", "name": "Yufei Wang"}, {"authorId": "2277603302", "name": "Weichao Lin"}, {"authorId": "2277568994", "name": "Yijing Liu"}, {"authorId": "2273067397", "name": "Jiliang Wang"}], "citations": []}
