{"paperId": "5f9ba66514be76868e2a2d1c540a858b38ef5000", "publicationVenue": {"id": "7f03ba38-4bb4-41a3-a6d7-914c28f84272", "name": "Dependable Systems and Networks", "type": "conference", "alternate_names": ["DSN", "Dependable Syst Netw"], "url": "http://www.dsn.org/"}, "title": "Understanding RowHammer Under Reduced Wordline Voltage: An Experimental Study Using Real DRAM Devices", "abstract": "RowHammer is a circuit-level DRAM vulnerability, where repeatedly activating and precharging a DRAM row, and thus alternating the voltage of a row’s wordline between low and high voltage levels, can cause bit flips in physically nearby rows. Recent DRAM chips are more vulnerable to RowHammer: with technology node scaling, the minimum number of activate-precharge cycles to induce a RowHammer bit flip reduces and the RowHammer bit error rate increases. Therefore, it is critical to develop effective and scalable approaches to protect modern DRAM systems against RowHammer. To enable such solutions, it is essential to develop a deeper understanding of the RowHammer vulnerability of modern DRAM chips. However, even though the voltage toggling on a wordline is a key determinant of RowHammer vulnerability, no prior work experimentally demonstrates the effect of wordline voltage (VPP) on the RowHammer vulnerability. Our work closes this gap in understanding.This is the first work to experimentally demonstrate on 272 real DRAM chips that lowering VPP reduces a DRAM chip’s RowHammer vulnerability. We show that lowering VPP 1) increases the number of activate-precharge cycles needed to induce a RowHammer bit flip by up to 85.8 % with an average of 7.4 % across all tested chips and 2) decreases the RowHammer bit error rate by up to 66.9 % with an average of 15.2 % across all tested chips. At the same time, reducing VPP marginally worsens a DRAM cell’s access latency, charge restoration, and data retention time within the guardbands of system-level nominal timing parameters for 208 out of 272 tested chips. We conclude that reducing VPP is a promising strategy for reducing a DRAM chip’s RowHammer vulnerability without requiring modifications to DRAM chips.", "venue": "Dependable Systems and Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-01", "journal": {"name": "2022 52nd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN)", "pages": "475-487"}, "authors": [{"authorId": "11827442", "name": "A. G. Yağlıkçı"}, {"authorId": "1720701024", "name": "Haocong Luo"}, {"authorId": "2171639988", "name": "Geraldo F. de Oliviera"}, {"authorId": "2048193264", "name": "Ataberk Olgun"}, {"authorId": "2097715520", "name": "Minesh Patel"}, {"authorId": "1992941239", "name": "Jisung Park"}, {"authorId": "40016363", "name": "Hasan Hassan"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "3126431", "name": "Lois Orosa"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "c2a1dbf0ceefdf850ca1fdf093219bcd42a10404", "title": "CoMeT: Count-Min-Sketch-based Row Tracking to Mitigate RowHammer at Low Cost"}, {"paperId": "6ba01138fcabdc9df56e8a69588a82fd91480a63", "title": "Spatial Variation-Aware Read Disturbance Defenses: Experimental Analysis of Real DRAM Chips and Implications on Future Solutions"}, {"paperId": "8c5ef03e9118253ec019965bf142d1be7998a453", "title": "Functionally-Complete Boolean Logic in Real DRAM Chips: Experimental Characterization and Analysis"}, {"paperId": "c8c865abf67950ab6a8c7ea042861fb05ae97d27", "title": "Securing Graph Neural Networks in MLaaS: A Comprehensive Realization of Query-based Integrity Verification"}, {"paperId": "6ad3813726321b97271fae9b8a8799d02e69cac2", "title": "RAMPART: RowHammer Mitigation and Repair for Server Memory Systems"}, {"paperId": "ee68d4752c2763650a68d65564ae9eca1b6ba266", "title": "Understanding Read Disturbance in High Bandwidth Memory: An Experimental Analysis of Real HBM2 DRAM Chips"}, {"paperId": "cccf7e41660e45992cb2052ed64f06470086b908", "title": "Siloz: Leveraging DRAM Isolation Domains to Prevent Inter-VM Rowhammer"}, {"paperId": "7524cc310dba98bea6acaaa7be6802f20815b74a", "title": "ABACuS: All-Bank Activation Counters for Scalable and Low Overhead RowHammer Mitigation"}, {"paperId": "d7f1aebbea8d50eb9934f57d7ecdbe2c8cfdec10", "title": "Evaluating and Enhancing Robustness of Deep Recommendation Systems Against Hardware Errors"}, {"paperId": "b5ace93de904d7ccebbc328d5fce45c2f8e671bb", "title": "Retrospective: RAIDR: Retention-Aware Intelligent DRAM Refresh"}, {"paperId": "70f2f94f9a2759eb86b0ed1079da0dce468e3f7c", "title": "Retrospective: An Experimental Study of Data Retention Behavior in Modern DRAM Devices: Implications for Retention Time Profiling Mechanisms"}, {"paperId": "6ecd45137b421b3729c5b28ebb1bd17e71f98b27", "title": "Retrospective: Flipping Bits in Memory Without Accessing Them: An Experimental Study of DRAM Disturbance Errors"}, {"paperId": "ceda5606b2189405adb20b12424e12388acb0a4e", "title": "RowPress: Amplifying Read Disturbance in Modern DRAM Chips"}, {"paperId": "2dfbef5f657e7e53916dc2ed1038abd1e32c43e9", "title": "An Experimental Analysis of RowHammer in HBM2 DRAM Chips"}, {"paperId": "f62928fd4272e0586637eb29cacb17d1f3596c7f", "title": "Double-sided Row Hammer Effect in Sub-20 nm DRAM: Physical Mechanism, Key Features and Mitigation"}, {"paperId": "4bdbdcbab8216acd846987f8b3e0e2a98cbbe5ff", "title": "Fundamentally Understanding and Solving RowHammer"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "cd6d2890b95a8dd9537559358d4bead53870a429", "title": "HammerScope: Observing DRAM Power Consumption Using Rowhammer"}, {"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips"}, {"paperId": "f15b80ab5173a9cc3d7dd2353678e617e89bd54e", "title": "Self-Managing DRAM: A Low-Cost Framework for Enabling Autonomous and Efficient in-DRAM Operations"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "6eff535aaa0b344bbabd9f8b9928b3c14802e875", "title": "High-Performance and Power-Saving Mechanism for Page Activations Based on Full Independent DRAM Sub-Arrays in Multi-Core Systems"}, {"paperId": "fb2fa185fe4fc5d65a791a9d0ec339650e17fd70", "title": "Overhang Saddle Fin Sidewall Structure for Highly Reliable DRAM Operation"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}, {"paperId": "df76b1a38aabaa20592643186b178daa65052606", "title": "SledgeHammer: Amplifying Rowhammer via Bank-level Parallelism"}, {"paperId": "6bf4dec8630fff3dd2510f38c2b6817e026bcf0e", "title": "Understanding and Leveraging the Spatial Variation in Read Disturbance Vulnerability of Real DRAM Chips"}]}
