{"paperId": "5fa185e6a3db49efa1bc950fa9ad9bc0e438e1d3", "publicationVenue": {"id": "d17c802c-e89b-4bcd-81b1-22f8921283fe", "name": "International Conference on Signals and Electronic Systems", "type": "conference", "alternate_names": ["ICSES", "Int Conf Signal Electron Syst"]}, "title": "Enhancing Malicious QR Code Link Detection with Swarm-Intelligent Squirrel-Search Optimized ANN", "abstract": "Recently, hackers have made plans to replicate harmful links by tricking people in a variety of ways. By acquiring access to sensitive information they use online, they attempt to remotely manipulate the victims' machines or obtain their data. QR codes are two-dimensional barcodes that can encode different types of data and are viewable by digital devices like smart phones. However, there is no recognized procedure for creating QR codes; therefore they could be vulnerable to a number of dubious assaults. The goal of this study is to use the Swarm-Intelligent Squirrel-Search Optimized Artificial Neural Network (SISSO-ANN) to identify harmful URLs concealed behind 2D QR codes. On the basis of barcode forgery, a cyber attack that may be carried out online has been proposed. Through a number of sites, a dataset of harmful and helpful Uniform Resource Locators (URLs) was produced, and their lexical properties were gathered. The experimental finding demonstrates that SISSO-ANN works better than other current techniques and achieves detection precision value of 93.80%,and accuracy of 93.50% which is much greater than the present secure QR code scanners. Additionally, the application with the least privilege authorization, SISSO-ANN, is the most privacy-friendly.", "venue": "International Conference on Signals and Electronic Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-14", "journal": {"name": "2023 International Conference on Innovative Computing, Intelligent Communication and Smart Electrical Systems (ICSES)", "pages": "1-8"}, "authors": [{"authorId": "2292312874", "name": "Sibi Marappan"}, {"authorId": "2292312869", "name": "Harshini Marappan"}], "citations": []}
