{"paperId": "5fa273f7db53ef98d3789b26a8f2dcf3b71fe005", "publicationVenue": null, "title": "Empirical study on BlenderBot 2.0’s Errors Analysis in terms of Model, Data and User-Centric Approach", "abstract": "BlenderBot 2.0 is a dialogue model that represents open-domain chatbots by reﬂecting real-time information and remembering user information for an extended period using an internet search module and multi-session. Nonethe-less, the model still has room for improvement. To this end, we examined BlenderBot 2.0’s limitations and errors from three perspectives: model, data, and user. From the data point of view, we highlight the unclear guidelines provided to workers during the crowdsourcing process, as well as a lack of a process for re-ﬁning hate speech in the collected data and verifying the accuracy of internet-based information. From a user’s perspective, we identify nine types of problems of BlenderBot 2.0, and their causes are thoroughly investigated. Furthermore, for each point of view, practical improvement methods are proposed, and we discuss several potential future research directions.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1800111", "name": "Jungseob Lee"}, {"authorId": "2135165000", "name": "Midan Shim"}, {"authorId": "2087630963", "name": "Suhyune Son"}, {"authorId": "2155859414", "name": "Yujin Kim"}, {"authorId": "2140329951", "name": "Chanjun Park"}, {"authorId": "31312182", "name": "Heuiseok Lim"}], "citations": [{"paperId": "fa07e26cb328188264fb7bba4e39320d5aed28d0", "title": "Those Aren't Your Memories, They're Somebody Else's: Seeding Misinformation in Chat Bot Memories"}, {"paperId": "577682d6df0da548dfb58d93dfd623b973bdf34a", "title": "CDConv: A Benchmark for Contradiction Detection in Chinese Conversations"}, {"paperId": "f8292d4ddf7a6dfe240eeaa9685f5d18eed9a3f6", "title": "Language Models that Seek for Knowledge: Modular Search & Generation for Dialogue and Prompt Completion"}, {"paperId": "9754dc7a0444341db11d6fc46d21edbe233360b9", "title": "Evaluating How Users Game and Display Conversation with Human-Like Agents"}]}
