{"paperId": "5fa58a200483c0dec36249a38251ca47930d4318", "publicationVenue": {"id": "84a6a8b4-8e85-48bd-b65e-a83d83f95908", "name": "Frontiers in Pharmacology", "type": "journal", "alternate_names": ["Front Pharmacol"], "issn": "1663-9812", "url": "https://www.frontiersin.org/journals/pharmacology", "alternate_urls": ["http://www.frontiersin.org/pharmacology", "http://journal.frontiersin.org/journal/pharmacology"]}, "title": "Identification of WT161 as a Potent Agent for the Treatment of Colitis by Targeting the Nucleotide-Binding Domain-Like Receptor Family Pyrin Domain Containing 3 Inflammasome", "abstract": "Inflammatory bowel diseases (IBD), including Crohn’s disease and ulcerative colitis (UC), are chronic and recurrent intestinal inflammatory disorders. Numerous studies have revealed that the nucleotide-binding domain-like receptor family pyrin domain containing 3 (NLRP3) inflammasome plays a pivotal role in the pathogenesis of IBD, and inhibition of the NLRP3 inflammasome alleviates colitis in experimental animals. Our previous study showed that C646, an inhibitor of histone acetyltransferase p300, has a protective role in dextran sulfate sodium (DSS)-induced colitis by targeting the NLRP3 inflammasome, making us further study the inhibitors of histone deacetylases (HDACs) in the treatment of colitis. In this study, we have shown that WT161, an inhibitor of HDAC6, exerts a protective role in a colitis model, blocks NLRP3 inflammasome activation, disrupts ASC speck formation, and decreases the expression of NLRP3. This study uncovers a new inhibitor of the NLRP3 inflammasome and suggests its potential application in the treatment of active IBD.", "venue": "Frontiers in Pharmacology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-07", "journal": {"name": "Frontiers in Pharmacology", "volume": "13"}, "authors": [{"authorId": "2118901821", "name": "Xiuyan Long"}, {"authorId": "2139780518", "name": "Xiaoyu Yu"}, {"authorId": "1596202796", "name": "P. Gong"}, {"authorId": "2118777674", "name": "Xiaoyan Wang"}, {"authorId": "2111196287", "name": "Li Tian"}], "citations": [{"paperId": "01dfff6e4b8558bd19702097a725e70beb9b9d91", "title": "Identification of neutrophil extracellular traps and crosstalk genes linking inflammatory bowel disease and osteoporosis by integrated bioinformatics analysis and machine learning"}, {"paperId": "d67dc2ff0fe060d983fa54c80c9760ce4ee14162", "title": "Microcystin-LR Induces and Aggravates Colitis through NLRP3 Inflammasome-Mediated Pyroptosis in Mice"}, {"paperId": "dfdae3a2f511db1d7cd89d33c931fb48f3bc3413", "title": "NLRP3 inflammasome in digestive diseases: From mechanism to therapy"}]}
