{"paperId": "5fac02421ef9cd3ff21b18c89270a4cdbeb5cbec", "publicationVenue": {"id": "3edbd5e0-8799-420a-9ca8-b35c646c354f", "name": "IEEE Transactions on Instrumentation and Measurement", "type": "journal", "alternate_names": ["IEEE Trans Instrum Meas"], "issn": "0018-9456", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=19", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=19"]}, "title": "Terahertz 2-D Imaging Framework for Detection Based on Dual Clustering Methods", "abstract": "The widespread use of high-performance materials in various fields poses a challenge for detection methods of internal structures and defects. Terahertz (THz) imaging is a highly promising method for nondestructive testing (NDT) of specific materials. However, conventional THz 2-D imaging methods usually lose a large amount of information and make the detecting results less reliable. Thousands of THz waveform data also make the accurate manual analysis very inefficient. Based on the clustering analysis methods, in this article, a THz 2-D imaging framework is proposed, in which the pulses and scanning points are clustered successively to obtain 2-D images with good quality. Pulses are extracted from the scanning data. The features of pulses are represented by two feature parameters, which will be used as the data set in the first clustering steps. The coding step makes the vectors of scanning points represent the pulses they contain. By the proposed framework, the pixel value can be well representative of the entire waveform features instead of a single parameter of the waveform. The proposed framework was tested with the actual samples. Experimental results verified that it can clearly image various physical structures of samples and make accurate distinctions of different areas. The impact of the parameters was also discussed. As an unsupervised learning-based framework, the proposed framework is fast, generalized, and does not require any prior data with labels, which can make industrial applications of NDT more automatic.", "venue": "IEEE Transactions on Instrumentation and Measurement", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Instrumentation and Measurement", "pages": "1-12", "volume": "72"}, "authors": [{"authorId": "2155180692", "name": "Shushan Wang"}, {"authorId": "2887817", "name": "H. Mei"}, {"authorId": "48211884", "name": "J. Liu"}, {"authorId": "50536387", "name": "Dabing Chen"}, {"authorId": "2141353271", "name": "Liming Wang"}], "citations": []}
