{"paperId": "5fbef05959e520f561501944abd834a471e94345", "publicationVenue": {"id": "0cb0dcea-43f4-4a34-a1c3-ac211434f660", "name": "International Conference Computing Methodologies and Communication", "type": "conference", "alternate_names": ["ICCMC", "Int Conf Comput Methodol Commun"]}, "title": "Blockchain Technology in Data Management", "abstract": "The introduction of cryptocurrency based decentralized applications and data storage has been illustrating the importance of blockchain technology to the industries. Blockchain technology as a platform allows creating a distributed and replicated ledger of transactions. Blockchain provides a guarantee of tamper resistance for the data generated from various processes to compile massive datasets. Since the data is huge in size and grows exponentially with time, the data management should be efficient to store or process it. We survey the different standards of data processing works in several research directions for bringing the blockchain execution closer to the various domains of databases and its operations. Furthermore, the proposed research work also discusses about the performance, challenges, and future research directions.", "venue": "International Conference Computing Methodologies and Communication", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-03-01", "journal": {"name": "2020 Fourth International Conference on Computing Methodologies and Communication (ICCMC)", "pages": "199-206"}, "authors": [{"authorId": "1654167141", "name": "N.Arunkumar"}, {"authorId": "1654167464", "name": "P.Sivaprakasam"}], "citations": [{"paperId": "f7c55cc748a7d6e4443faf5b52dd7eb88021b8f4", "title": "Integration of Blockchain in Computer Networking: Overview, Applications, and Future Perspectives for Software-defined Networking (SDN), Network Security, and Protocols"}, {"paperId": "c3c1b7bec5d3d23cc2e64acf2d2a5dda82f82565", "title": "Cryptocurrency with Blockchain Technology — A Literature Review"}, {"paperId": "68220757ca3ca0637c1ba977839af43dc6938a23", "title": "Node authentication using the voting scheme for clustered network"}, {"paperId": "4c867c2b00ca3474f608fdd626dece6f72bd4be4", "title": "The Internet of Things Security and Privacy: Current Schemes, Challenges and Future Prospects"}]}
