{"paperId": "5fbfff904f36096bc772c743bfd19a9160a464cf", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Novel Intelligent Approach for Dynamic Data Replication in Cloud Environment", "abstract": "In recent years, cloud computing research, specifically data replication techniques and their applications, has been growing. If the replicas number is raised and put in multiple positions, it will be expensive to maintain the data usability, performance and stability of the application systems. In this paper, two bio- inspired algorithms were proposed to improve both selection and placement of data replicas in the cloud environment. The suggested algorithms for dynamic data replication are multi-objective particle swarm optimization (MO-PSO) and ant colony optimization (MO-ACO). The first suggested algorithm, i.e., MO-PSO, is employed to obtain the best selected data replica depend on the most frequent one. However, the second suggested algorithm, i.e., MO-ACO, is employed to obtain the best data replica placement depend on the shortest distance, and the replicas availability. A simulation of the suggested strategy was carried out using CloudSim. Each data center (DC) includes hosts with set of virtual machines (VMs). The data replication order is determined at random from a thousand cloudlets. All replication files are randomly distributed in the proposed architecture. The performance of suggested techniques was evaluated against several approaches including: Adaptive Replica Dynamic Strategy (ARDS), Enhance Fast Spread (EFS), Genetic Algorithm (GA), Replica Selection and Placement (RSP), Popular File Replication First (PFRF), and Dynamic Cost-aware Re-replication and Re-balancing Strategy (DCR2S). The simulation results prove that MOPSO gives improved data replication compared against other algorithms. Additionally, MOACO realizes higher data availability, lower cost, and less bandwidth consumption compared with other algorithms.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "40240-40254", "volume": "9"}, "authors": [{"authorId": "2061664587", "name": "A. Awad"}, {"authorId": "37379088", "name": "Rashed K. Salem"}, {"authorId": "2064476686", "name": "H. Abdelkader"}, {"authorId": "25630341", "name": "M. A. Salam"}], "citations": [{"paperId": "7e6a2b83a9f6a27e1fa8b793ac867955c4526e86", "title": "Enhancing Cloud Resource Allocation Efficiency with Harris Hawk Optimization Algorithm(HHOA)"}, {"paperId": "4c565890c7bb0cd0b852dd62237fa8ae6a49242c", "title": "Survey on data replication in cloud systems"}, {"paperId": "c28cb52a0be1ff70c002c33d6c1a6e95be45ce81", "title": "Cost Optimization for Cloud Storage from User Perspectives: Recent Advances, Taxonomy, and Survey"}, {"paperId": "3521fe18b00623888aafdcab2503b3508e4e45cb", "title": "AOEHO: A New Hybrid Data Replication Method in Fog Computing for IoT Application"}, {"paperId": "22762ec5ccf5cc73ad9025d635eff3a06e450524", "title": "A novel hybrid arithmetic optimization algorithm and salp swarm algorithm for data placement in cloud computing"}, {"paperId": "9f33af02bf99e564b481e185c1ce730625044b06", "title": "Optimization assisted frequent pattern mining for data replication in cloud: Combining sealion and grey wolf algorithm"}, {"paperId": "8aa4cae691d4d195372a3453e1d66035e3b61c00", "title": "Towards Improving Cloud Security and Performance by using Proposed Controlled Replication Model"}, {"paperId": "f762bea2bac5269bba31fe557643b0888364b3a5", "title": "A Multi-Objective Optimization for Supply Chain Management using Artificial Intelligence (AI)"}]}
