{"paperId": "5fc58ad1d486ae0b6cde3d4649a0ca230de0d9f0", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Sustainable Supply Chain Management and Multi-Criteria Decision-Making Methods: A Systematic Review", "abstract": "Multi-criteria decision-making (MCDM) methods are smart tools to deal with numerous criteria in decision-making. These methods have been widely applied in the area of sustainable supply chain management (SSCM) because of their computational capabilities. This paper conducts a systematic literature review on MCDM methods applied in different areas of SSCM. From the literature search, a total of 106 published journal articles have been selected and analyzed. Both individual and integrated MCDM methods applied in SSCM are reviewed and summarized. In addition, contributions, methodological focuses, and findings of the reviewed articles are discussed. It is observed that MCDM methods are widely used for analyzing barriers, challenges, drivers, enablers, criteria, performances, and practices of SSCM. In recent years, studies have focused on integrating more than one MCDM method to highlight methodological contributions in SSCM; however, in the literature, limited research papers integrate multiple MCDM methods in the area of SSCM. Most of the published articles integrate only two MCDM methods, and integration with other methods, such as optimization and simulation techniques, is missing in the literature. This review paper contributes to the literature by analyzing existing research, identifying research gaps, and proposing new future research opportunities in the area of sustainable supply chain management applying MCDM methods.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-06-24", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "153368332", "name": "Ananna Paul"}, {"authorId": "34287537", "name": "N. Shukla"}, {"authorId": "37962338", "name": "S. Paul"}, {"authorId": "40238364", "name": "A. Trianni"}], "citations": [{"paperId": "1f61dfa2018d417b3e882ab923e59bd65abaa847", "title": "The Contribution of Sustainable Packaging to the Circular Food Supply Chain"}, {"paperId": "1c01decd3e85121e6213366ebb93e4396ce6fe0b", "title": "Optimization of the sustainable food supply chain with integrative data envelopment analysis approach"}, {"paperId": "18864dd1f85c9d5e2860eec26b7ed88431f85f7a", "title": "Overcoming Barriers to Sustainable Supply Chain Management in Small and Medium-Sized Enterprises: A Multi-Criteria Decision-Making Approach"}, {"paperId": "551d61a9cadbbed836a7097cb1b751962b1540cf", "title": "Evaluating the Efficiencies of Logistics Centers with Fuzzy Logic: The Case of Turkey"}, {"paperId": "c2754d2089fd7361ed7762f3859168aeadbb7099", "title": "Opportunities and challenges of empowering SMEs for sustainable Healthcare delivery"}, {"paperId": "6fa31a0acab618d57b56d0ddb539d7ee9aa8efd2", "title": "Systematic Review of Fuzzy Scales for Multiple Criteria Decision-Making Issues during COVID-19"}, {"paperId": "6830b2db898514f54ed48ab13ea5aee043264f5a", "title": "A Fuzzy Multi-Criteria Model with Pareto Analysis for Prioritizing Sustainable Supply Chain Barriers in the Textile Industry: Evidence from an Emerging Economy"}, {"paperId": "10bf9cca27385ccebfed5504c69ca9df8db2a6d7", "title": "Application of fuzzy methods in green and sustainable supply chains: critical insights from a systematic review and bibliometric analysis"}, {"paperId": "2f8f990f0f23c2c20464b019501845cfdd78d775", "title": "Assessing Supplier Suitability for Leagile Supply Chains: A Multi-Criteria Decision-Making Approach to Enhance Leanness and Agility"}, {"paperId": "fa2d415f2ebbd571461ba7bb1c63bb48a0b1eeb9", "title": "Research developments in sustainable supply chain management considering optimization and industry 4.0 techniques: a systematic review"}, {"paperId": "9be5d9a07625f130349c1f6e192fffb7075c3a4d", "title": "Sustainable Supplier Selection and Order Allocation Using an Integrated ROG-Based Type-2 Fuzzy Decision-Making Approach"}, {"paperId": "2d2513bb0c1706e90abeaca21b5a3fa39443b8ff", "title": "Uncertain interval TOPSIS and potentially regrettable decisions within ICT evaluation environments"}, {"paperId": "50a6048ac34fe23110320ebfcbfda74fb99ecf6d", "title": "A systematic literature review of modern slavery through benchmarking global supply chain"}, {"paperId": "599ab8c799a9978465fc6589b7aaa5f2d47cc366", "title": "Neutrosophic Model to Examine the Challenges Faced by Manufacturing Businesses in Adopting Green Supply Chain Practices and to Provide Potential Solutions"}, {"paperId": "e0b5f6c8ed5a2ff2849d0afd1d751b6cc7b83ea4", "title": "Identifying Waste Supply Chain Coordination Barriers with Fuzzy MCDM"}, {"paperId": "47c6ef157eee6456b12bd9dd5d8d5c5075afeb33", "title": "A new integrated approach based on base-criterion and utility additive methods and its application to supplier selection problem"}, {"paperId": "951f72c2e3fa1bafaccda471675b7b29ff2c5b4e", "title": "Ecological ethics and the smart circular economy"}, {"paperId": "3767e404b398e17d3b15b56254e9fc00066526d5", "title": "A Fuzzy Extension of Simplified Best-Worst Method (F-SBWM) and Its Applications to Decision-Making Problems"}, {"paperId": "41abcdd025ba475a98701ef4905c8ddc4ab65219", "title": "Modification of the DIBR and MABAC Methods by Applying Rough Numbers and Its Application in Making Decisions"}, {"paperId": "cddde6faf625cc5aa938106fa60f10f408902a37", "title": "Sustainable Supply Chain Management: A Comprehensive Systematic Review of Industrial Practices"}, {"paperId": "d0c0cb2c3b2f8294ef4705047a8b0f3cf33688ad", "title": "Optimal Design of Wood/Rice Husk-Waste-Filled PLA Biocomposites Using Integrated CRITIC–MABAC-Based Decision-Making Algorithm"}, {"paperId": "8f1494571446cce33195c23deca176cd843951c7", "title": "Implementation of Sustainable Supply Chain Management considering Barriers and Hybrid Multiple-Criteria Decision Analysis in the Healthcare Industry"}, {"paperId": "a70af4537c60a4071ecd82f7f429cc38c17a1a07", "title": "Optimal Design of Ceramic Based Hip Implant Composites Using Hybrid AHP-MOORA Approach"}, {"paperId": "035cf0d11e32c3ec1fdf5cdd3e58248e2e006e42", "title": "Airline catering supply chain performance during pandemic disruption: a Bayesian network modelling approach"}, {"paperId": "271d68780edb822cadd2fbfe9ec7c5819bd5f846", "title": "Paradox of strategic partnerships for sustainable value chains: Perspectives of not‐for‐profit actors"}, {"paperId": "9eb21c48cb52d30ff4226e433376b9f63cb7ebf1", "title": "Multi-Criteria Approach to Firm Performance Evaluation: An Application on the Banking Sector"}, {"paperId": "c82895d37b9efb46cbecc987e1eb049f6253a398", "title": "Drivers, barriers and practices of net zero economy: An exploratory knowledge based supply chain multi-stakeholder perspective framework"}, {"paperId": "e0d8c778ce7012e534ff615182b9a25c602a27c6", "title": "Multi-Objective Optimal Design of a Hydrogen Supply Chain Powered with Agro-Industrial Wastes from the Sugarcane Industry: A Mexican Case Study"}, {"paperId": "7e4900eb680a9978d74d0671a18473077dbebf04", "title": "Sustainable High-Tech Brick Production with Energy-Oriented Consumption: An Integrated Possibilistic Approach Based on Criteria Interdependencies"}, {"paperId": "0562438491307bc3622112b29672fda803047f2e", "title": "Using ANP and QFD methodologies to analyze eco-efficiency requirements in an electronic supply chain"}, {"paperId": "f26bc44349c8afae7891623a08eae8efbfa8801e", "title": "Multiple Criteria Decision-Making as an Operational Conceptualization of Energy Sustainability"}, {"paperId": "970f32e6528653a4e1fd3fb6259c290529b4e14a", "title": "A Novel Hybrid MCDM Model for the Evaluation of Sustainable Last Mile Solutions"}, {"paperId": "8841c26035b66af05842301b373ab0cf997da8d7", "title": "Evaluating Inclusive Campus Environment Design Criteria Using CFPR and FANP Methodologies"}, {"paperId": "c4e1ab805aec6273cbf11aa028e5e7fb160daa6c", "title": "Research on the Sustainable Operation of Low-Carbon Tourism Supply Chain under Sudden Crisis Prediction"}, {"paperId": "7b12d5a899fcaf955477d3031181f0790299a310", "title": "Wastewater Treatment and Multi-Criteria Decision-Making Methods: A Review"}]}
