{"paperId": "5fc979663a5253253735a576866603d1ce9f6cb7", "publicationVenue": {"id": "44aabbb9-28ab-46d0-845f-3dd44a78fb59", "name": "Frontiers of Information Technology & Electronic Engineering", "alternate_names": ["Front Inf Technol  Electron Eng"], "issn": "2095-9184", "url": "http://erf.sbb.spk-berlin.de/han/caj/eng.oversea.cnki.net/kns55/oldnavi/n_item.aspx?BaseID=JZUS&Flg=local&NaviID=48&NaviLink="}, "title": "A convolutional neural network based approach to sea clutter suppression for small boat detection", "abstract": "Current methods for radar target detection usually work on the basis of high signal-to-clutter ratios. In this paper we propose a novel convolutional neural network based dual-activated clutter suppression algorithm, to solve the problem caused by low signal-to-clutter ratios in actual situations on the sea surface. Dual activation has two steps. First, we multiply the activated weights of the last dense layer with the activated feature maps from the upsample layer. Through this, we can obtain the class activation maps (CAMs), which correspond to the positive region of the sea clutter. Second, we obtain the suppression coefficients by mapping the CAM inversely to the sea clutter spectrum. Then, we obtain the activated range-Doppler maps by multiplying the coefficients with the raw range-Doppler maps. In addition, we propose a sampling-based data augmentation method and an effective multiclass coding method to improve the prediction accuracy. Measurement on real datasets verified the effectiveness of the proposed method.", "venue": "Frontiers of Information Technology & Electronic Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "Frontiers of Information Technology & Electronic Engineering", "pages": "1504 - 1520", "volume": "21"}, "authors": [{"authorId": "2108352689", "name": "Guan-qing Li"}, {"authorId": "33857726", "name": "Zhi-yong Song"}, {"authorId": "145142015", "name": "Q. Fu"}], "citations": [{"paperId": "07fc716c5b11804f980e00757a92ae3e2c5e8c06", "title": "Scalable and effective artificial intelligence for multivariate radar environment"}, {"paperId": "39529763d8c087bce1f3738e1f491b7a7d2d19bc", "title": "THFE: A Triple-hierarchy Feature Enhancement method for tiny boat detection"}, {"paperId": "41fcd8d547f01cfb6bd843d6df167bcd47cfe276", "title": "Sea Clutter Suppression and Target Detection Algorithm of Marine Radar Image Sequence Based on Spatio-Temporal Domain Joint Filtering"}, {"paperId": "4e93640801947e7e80ab0f084e081627b322f140", "title": "Target Detection in Sea Clutter with Transformer Neural Network"}, {"paperId": "043fc809a0a70c258efa4b62c97fa3d70e3ef9bb", "title": "Range-Doppler Spectrograms-Based Clutter Suppression of HF Passive Bistatic Radar by D-CycleGAN"}, {"paperId": "7986ec7495ace7d7efe632a9f84680199d938a56", "title": "An Overview of Machine Learning Methods for Multiple Target Tracking"}, {"paperId": "db69ff41ffcdc3e6f613a5e3b16e05eb9d5b1dcd", "title": "A Method for Detecting Small Slow Targets on Sea Surface Based on FC-MCNN"}, {"paperId": "fd3c99ac435406fd6c66b2472e6ca42a7d7f8e66", "title": "A PointNet-Based CFAR Detection Method for Radar Target Detection in Sea Clutter"}]}
