{"paperId": "5fcfdd3f3ab766ce53d5f51212c7db0f0ef3a4df", "publicationVenue": null, "title": "Practical Storage-Compute Elasticity for Stream Data Processing", "abstract": "Stream processing pipelines need to handle workload fluctuations (e.g., daily patterns, popularity spikes) by scaling up/down the resources contributed to running jobs. While there have been efforts proposing auto-scaling mechanisms for stream processing engines, prior work has overlooked the role of the storage system in ingesting and serving stream data. The absence of effective scaling for data streams is problematic given that the number of parallel partitions of a data stream limits both streaming data ingestion throughput and read parallelism for downstream streaming jobs. In this paper, we propose to augment the auto-scaling notion of stream processing engines with information about the source data stream. The key novelty of our approach lies in exploiting elastic data streams to ingest data, which is a unique feature of Pravega: a storage system for data streams part of the Dell's Streaming Data Platform. Pravega streams can dynamically change their parallelism based on the ingestion workload, and such information can in turn be exploited for auto-scaling the streaming job downstream. To this end, we have developed an Apache Flink connector for Pravega, as well as an auto-scaling orchestrator that feeds on data stream metrics. Our experiments show how a stream processing pipeline auto-scales by coordinating data stream and processing parallelism under workload fluctuations, with low operations cost.", "venue": "Middleware Industry", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-12-11", "journal": {"name": "Proceedings of the 24th International Middleware Conference: Industrial Track"}, "authors": [{"authorId": "1405605118", "name": "Raúl Gracia-Tinedo"}, {"authorId": "2267098096", "name": "Flavio Junqueira"}, {"authorId": "2267198009", "name": "Brian Zhou"}, {"authorId": "2267223064", "name": "Yimin Xiong"}, {"authorId": "2267207355", "name": "Luis Liu"}], "citations": []}
