{"paperId": "5fd25754986fa22f7846e9e96956ee4dac518742", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "An Unsupervised Clustering Method for Processing Roadside LiDAR Data With Improved Computational Efficiency", "abstract": "In transportation, LiDAR has been primarily used in autonomous vehicles to assist self-driving until recently when people realized it could also be installed at the roadside to support connected vehicles and infrastructure systems. Unlike onboard LiDAR sensors used in autonomous vehicles, roadside applications must perform complete background filtering and clustering as well as tracking real-time traffic movements within the detection zone. This paper presents an unsupervised clustering method for roadside or infrastructure-based LiDAR applications. It first converts 3D LiDAR data points into 2D so that only target points (after background filtering) will be saved in the channel-azimuth 2D structure; then, a method combining the region growing algorithm and counted component labeling is used to perform clustering. Lastly, a merging process is conducted to enhance the connected component labeling method for better outcomes. Experimental studies demonstrate that the proposed method could reach 0.011s per frame (10 Hz sensor rotation frequency) in clustering while maintaining high accuracy.", "venue": "IEEE Sensors Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-01", "journal": {"name": "IEEE Sensors Journal", "pages": "10684-10691", "volume": "22"}, "authors": [{"authorId": "2107986155", "name": "Yibin Zhang"}, {"authorId": "1658782432", "name": "Nischal Bhattarai"}, {"authorId": "100673376", "name": "Junxuan Zhao"}, {"authorId": "144352763", "name": "Hongchao Liu"}, {"authorId": "2108835318", "name": "Hao Xu"}], "citations": [{"paperId": "c85a0a9b3a1d095b844142c7fc3d0820acf6fb16", "title": "Real-Time Point Cloud Clustering Algorithm Based on Roadside LiDAR"}, {"paperId": "b5816361805091999970a2a84e42d68b542c0cd6", "title": "Traversability Estimation for Off-Road Autonomous Driving Under Ego-Motion Uncertainty"}, {"paperId": "c3cd454874d36bed655cbe4b26d2d854a9f8d65b", "title": "A Cloud-based Real-Time Traffic Monitoring System with Lidar-based Vehicle Detection"}, {"paperId": "b12c9f8ec3911c245504a11cb9cf9673a1e5be75", "title": "Crash frequency prediction based on extreme value theory using roadside lidar-based vehicle trajectory data."}, {"paperId": "b2ef91a515e682368ba90269a7483017667d2a54", "title": "Vehicle detection and tracking using low-channel roadside LiDAR"}, {"paperId": "1a0b57988bcbd960f4647e36020fc86217162cff", "title": "Object Detection Based on Roadside LiDAR for Cooperative Driving Automation: A Review"}, {"paperId": "bc6a152ae20483f3ee708ad2397bbe4c715a7852", "title": "Heterogeneous Traffic Flow Detection Using CAV-Based Sensor With I-GAIN"}]}
