{"paperId": "5fe64941cbf5ca4f354ffa26e5ac7df53e9eb947", "publicationVenue": {"id": "56eec692-1b1a-40d9-8a45-cea2842a044d", "name": "International Conference on Social, Cultural, and Behavioral Modeling", "type": "conference", "alternate_names": ["SBP-BRiMS", "Int Conf Soc Cult Behav Model"]}, "title": "Anger Breeds Controversy: Analyzing Controversy and Emotions on Reddit", "abstract": "Emotions play an important role in interpersonal interactions and social conflict, yet their function in the development of controversy and disagreement in online conversations has not been explored. To address this gap, we study controversy on Reddit, a popular network of online discussion forums. We collect discussions from a wide variety of topical forums and use emotion detection to recognize a range of emotions from text, including anger, fear, joy, admiration, etc. Our study has three main findings. First, controversial comments express more anger and less admiration, joy and optimism than non-controversial comments. Second, controversial comments affect emotions of downstream comments in a discussion, usually resulting in long-term increase in anger and a decrease in positive emotions, although the magnitude and direction of emotional change depends on the forum. Finally, we show that emotions help better predict which comments will become controversial. Understanding emotional dynamics of online discussions can help communities to better manage conversations.", "venue": "International Conference on Social, Cultural, and Behavioral Modeling", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "ArXiv", "volume": "abs/2212.00339"}, "authors": [{"authorId": "2193490331", "name": "Kai Chen"}, {"authorId": "2116308648", "name": "Zihao He"}, {"authorId": "2051654659", "name": "Rong-Ching Chang"}, {"authorId": "143823227", "name": "Jonathan May"}, {"authorId": "2073018730", "name": "Kristina Lerman"}], "citations": [{"paperId": "390d86d30a06a653a75e10fa1809bdae62dd6680", "title": "Large-scale digital signatures of emotional response to the COVID-19 vaccination campaign"}, {"paperId": "eb62a25c44533509a5b7f8d5e61f94d0a92fe516", "title": "DELPHI: Data for Evaluating LLMs' Performance in Handling Controversial Issues"}]}
