{"paperId": "5fea9bffc138ac8c1be6df3e50df65582a902955", "publicationVenue": null, "title": "Vocational High School Technical Skills Facing the Industrial Era 4.0", "abstract": "—Industry 4.0, marked by cyber-physical collaboration and the manufacturing industry. The underlying technological conditions of I4.0 require automation, digitization and interconnection. The use of technology can increase the competitiveness of the industry, application of technology also requires a new set of knowledge and skills. In operating machining engineering technology in the Industry 4.0 era, it’s requires a workforce who can combine classic machines and Information Technology (IT). Vocational High Schools whose purpose is to provide manpower, need to pay attention to the technical competencies required for the presence of this technology, so that there is a match between the competencies needed by the industry and the competencies taught in schools. To describe what technical competences students need to have in Mechanical Engineering Vocational High School, a literature review was conducted, using the Pagani , Kovaleski , and Resende protocols. 27 articles published in international journals were selected for further study. The results of this study provide insight and input to vocational education managers, regarding various information on technological advances in the Industry 4.0 era and what technical competencies are needed. So that it can be input for curriculum developers in determining what competencies need to be present in the Mechanical Engineering Vocational School curriculum", "venue": "Proceedings of the 4th International Conference on Innovation in Engineering and Vocational Education (ICIEVE 2021)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": null, "journal": {"name": "Proceedings of the 4th International Conference on Innovation in Engineering and Vocational Education (ICIEVE 2021)"}, "authors": [{"authorId": "2161830493", "name": "Ridwan Yanuardi"}, {"authorId": "52499199", "name": "I. Widiaty"}, {"authorId": "2090798496", "name": "M. Komaro"}], "citations": []}
