{"paperId": "5febc0e60877ef7f377f3c85c21f1b4baa65d18d", "publicationVenue": {"id": "3fb97c96-17ca-4705-b14c-7399edbedb87", "name": "Ergonomics", "type": "journal", "issn": "0014-0139", "url": "http://www.tandfonline.com/loi/terg20", "alternate_urls": ["http://www.tandfonline.com/toc/terg20/current"]}, "title": "Comparison of univariate and multivariate anthropometric accommodation of the northwest Mexico population", "abstract": "ABSTRCT Ergonomic workstation design is crucial to prevent work-related musculoskeletal disorders. Many researchers have proposed multivariate analysis for human accommodation. However, no multivariate anthropometric analysis exists for the Mexican population. This study compares common multivariate human accommodation approaches (e.g. principal component and archetypal analyses) and clustering techniques (e.g. k-means and Ward’s algorithm) with the classical percentile-based univariate accommodation approach, using the Chi-squared goodness-of-fit test and the McNemar’s test. The theoretical accommodation percentage obtained by multivariate approaches was higher than those obtained by the percentile univariate approach considering the central 98% data. k-means and archetypal analysis obtained similar and the highest accommodation values, followed by Ward’s algorithm and principal component analysis. The study findings can be deployed to assess the design of workstations in Mexico, such as electronic components assembly and crew designs, and the effects of different anthropometric measurements in human accommodation. Practitioner summary: Products and workplaces design are commonly based on the classical univariate approach, using the extreme percentiles. In this study, multivariate approaches were tested on dimensions for sitting workstations, and results showed a bigger accommodation level in comparison to the univariate 1%–99% approaches. Abbreviations: RHM: representative human model; DHM: digital human model; PCA: principal component analysis; AA: archetypal analysis (AA); PCs: principal components; FA: factor analysis; RSS: residual sum of squares; SSE: sum of squared estimated errors; WA: Ward’s algorithm; DBI: Davies–Bouldin index; CHI: Calinski–Harabaz index; SI: silhouette index; SH: sitting height; EHS: eye height, sitting; AHS: acromial height, sitting; PH: popliteal height; KHS: knee height, sitting; BPL: buttock–popliteal length; BKL: buttock–knee length; FGR: functional grip reach; AD: anthropometric dimension; E: expected; A: achieved", "venue": "Ergonomics", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-08", "journal": {"name": "Ergonomics", "pages": "1018 - 1034", "volume": "64"}, "authors": [{"authorId": "2052069052", "name": "Graciela Rodríguez Vega"}, {"authorId": "2052067890", "name": "Ulises Zaldívar Colado"}, {"authorId": "2052069002", "name": "Xiomara Penélope Zaldívar Colado"}, {"authorId": "2052070792", "name": "Dora Aydee Rodríguez Vega"}, {"authorId": "2052067902", "name": "Enrique Javier de la Vega Bustillos"}], "citations": [{"paperId": "d0de231da75fba0e2bd659557528d7d26fd4b92d", "title": "Synthesis and validation algorithm followed by a weighting procedure to create a detailed anthropometric dataset for the German working-age population."}, {"paperId": "109686cc4ba6b8d8af4a5903b96ec76f79853381", "title": "Archetypal Curves in the Shape and Size Space: Discovering the Salient Features of Curved Big Data by Representative Extremes"}, {"paperId": "a348170d9179f361cdea4b743f7f458aa04c4bf5", "title": "Ergonomics Applied to the Development and Evaluation of Insoles for Protective Footwear"}, {"paperId": "3ddf4e6a04ff734a5861de1288769f9a229b1fbd", "title": "Anthropometric dataset for the German working-age population using 3D body scans from a regional epidemiological health study and a weighting algorithm"}, {"paperId": "f363d7988963a02ebd1d0103d2c02c3c0b855800", "title": "Anthropometric accommodation percentage comparison for univariate and multivariate representative Mexican hand models."}, {"paperId": "dcb82ae18917f7ab93407ec0dd69ead7c03f529a", "title": "Percentage of U.S. General Population Accommodated by Commercial Airline Seats"}]}
