{"paperId": "5ff9cd8fcb959ca6b458c11e780d61c3f2bf7691", "publicationVenue": {"id": "479d5605-51be-4346-b1d6-4334084504df", "name": "Findings", "type": "journal", "issn": "2652-8800", "url": "https://findingspress.org/"}, "title": "PLACES: Prompting Language Models for Social Conversation Synthesis", "abstract": "Collecting high quality conversational data can be very expensive for most applications and infeasible for others due to privacy, ethical, or similar concerns. A promising direction to tackle this problem is to generate synthetic dialogues by prompting large language models. In this work, we use a small set of expert-written conversations as in-context examples to synthesize a social conversation dataset using prompting. We perform several thorough evaluations of our synthetic conversations compared to human-collected conversations. This includes various dimensions of conversation quality with human evaluation directly on the synthesized conversations, and interactive human evaluation of chatbots fine-tuned on the synthetically generated dataset. We additionally demonstrate that this prompting approach is generalizable to multi-party conversations, providing potential to create new synthetic data for multi-party tasks. Our synthetic multi-party conversations were rated more favorably across all measured dimensions compared to conversation excerpts sampled from a human-collected multi-party dataset.", "venue": "Findings", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-07", "journal": {"pages": "814-838"}, "authors": [{"authorId": "66615738", "name": "Maximillian Chen"}, {"authorId": "1710287", "name": "A. Papangelis"}, {"authorId": "46387857", "name": "Chenyang Tao"}, {"authorId": "2127354716", "name": "Seokhwan Kim"}, {"authorId": "146177177", "name": "Andrew Rosenbaum"}, {"authorId": "2152797401", "name": "Yang Liu"}, {"authorId": "2167255986", "name": "Zhou Yu"}, {"authorId": "1395813836", "name": "Dilek Z. Hakkani-Tür"}], "citations": [{"paperId": "48f1a6d9ff8661be2a256422cd3f0e86fc466b5a", "title": "PSYDIAL: Personality-based Synthetic Dialogue Generation using Large Language Models"}, {"paperId": "bfc2aee63d20fb19c9a851da9e97fec40c454124", "title": "Is this the real life? Is this just fantasy? The Misleading Success of Simulating Social Interactions With LLMs"}, {"paperId": "6b9699058152912efedd9a6d724ec08e0c4c9319", "title": "Pearl: A Review-driven Persona-Knowledge Grounded Conversational Recommendation Dataset"}, {"paperId": "387229badf09494d9397585da880c5c5de14812f", "title": "Book2Dial: Generating Teacher-Student Interactions from Textbooks for Cost-Effective Development of Educational Chatbots"}, {"paperId": "efb0a2009e4edb1938c6313d75f8458e603f8ff5", "title": "Evaluating human resources management literacy: A performance analysis of ChatGPT and bard"}, {"paperId": "ea8b03b1ad74a5dd2d5584e4bdf4e077b004eee6", "title": "RENOVI: A Benchmark Towards Remediating Norm Violations in Socio-Cultural Conversations"}, {"paperId": "77a2c74359eed2723102cc5831c429a72118f5f3", "title": "SynthDST: Synthetic Data is All You Need for Few-Shot Dialog State Tracking"}, {"paperId": "8627a427cb538fa5827cd288cd7c928f209b7c3a", "title": "Contextualization Distillation from Large Language Model for Knowledge Graph Completion"}, {"paperId": "d58721cc0d12ac43df9419c5ae25e1ddef87f0f5", "title": "Adapting Foundation Models for Operator Data Analytics"}, {"paperId": "5949326aa81a0709cefc2a16b3abe446ea44772e", "title": "AI to Train AI: Using ChatGPT to Improve the Accuracy of a Therapeutic Dialogue System"}, {"paperId": "4e0f5af6ee4a4d8f59b170263c5f157bef3e5d34", "title": "Large Language Models are Few-Shot Training Example Generators: A Case Study in Fallacy Recognition"}, {"paperId": "56e7bda25b83228f91962d3465fd587cfe8908e1", "title": "How Far Can We Extract Diverse Perspectives from Large Language Models? Criteria-Based Diversity Prompting!"}, {"paperId": "fe8d4ef6a0826bc79fe681c198d927c33b0f6821", "title": "Multi-User MultiWOZ: Task-Oriented Dialogues among Multiple Users"}, {"paperId": "3c0c14882318fd7ad3fd51cdc5fc515a7f78effd", "title": "LLMaAA: Making Large Language Models as Active Annotators"}, {"paperId": "088a5fa00ed6c14351209da5f53e770b51fd2909", "title": "FANToM: A Benchmark for Stress-testing Machine Theory of Mind in Interactions"}, {"paperId": "de9c8eb8c2f42befcdb1e30f394d6f8525f5dfac", "title": "NormDial: A Comparable Bilingual Synthetic Dialog Dataset for Modeling Social Norm Adherence and Violation"}, {"paperId": "8a7dcc4699b803b5eb10a6db797406b3106c424b", "title": "Social Commonsense-Guided Search Query Generation for Open-Domain Knowledge-Powered Conversations"}, {"paperId": "6bde8138560851914a9a9426c2a1ec3f11c6509f", "title": "Curriculum-Driven Edubot: A Framework for Developing Language Learning Chatbots Through Synthesizing Conversational Data"}, {"paperId": "970f19ae6d038c003c6ac4ec543f2ccb84d691bb", "title": "Data Augmentation for Conversational AI"}, {"paperId": "cc8def3fc0389c012dc497a150412351f6fb9829", "title": "Adapting Foundation Models for Information Synthesis of Wireless Communication Specifications"}, {"paperId": "b34862afacf36e7011d40c67bb67c5ee9cf7da22", "title": "DialogStudio: Towards Richest and Most Diverse Unified Dataset Collection for Conversational AI"}, {"paperId": "f5dfba34121f0f2cfc3074d70194d7ac6e3bb4fe", "title": "Synthetic Alone: Exploring the Dark Side of Synthetic Data for Grammatical Error Correction"}, {"paperId": "99da5ada1b6244f2caafad55e8f61fe8e6dc1e49", "title": "Lexical Speaker Error Correction: Leveraging Language Models for Speaker Diarization Error Correction"}, {"paperId": "6847b9658f287f430098199cd81bf26308da13f9", "title": "Domain Specialization as the Key to Make Large Language Models Disruptive: A Comprehensive Survey"}, {"paperId": "9573e2025440219a1d3393664b3c80bda51ac8f4", "title": "Prompt-Based Monte-Carlo Tree Search for Goal-Oriented Dialogue Policy Planning"}, {"paperId": "13c85adfa950651ffcd91ef3018fa30801b74472", "title": "Prompting and Evaluating Large Language Models for Proactive Dialogues: Clarification, Target-guided, and Non-collaboration"}, {"paperId": "6cd26d124ffeb6ce301ef351aada27fa0852f81b", "title": "MathDial: A Dialogue Tutoring Dataset with Rich Pedagogical Properties Grounded in Math Reasoning Problems"}, {"paperId": "ed2221b2260169acf5fe962cf757e46082f85bbf", "title": "Controllable Mixed-Initiative Dialogue Generation through Prompting"}, {"paperId": "7ce39cdf7739532040d869e1f749e8e010e7b427", "title": "SocialDial: A Benchmark for Socially-Aware Dialogue Systems"}, {"paperId": "b8bea82e7a8028fbe79942c4331546701976dd36", "title": "Pre-Finetuning for Few-Shot Emotional Speech Recognition"}, {"paperId": "f78fe02f681a0a9a6867b007bd39e3884de64a91", "title": "SODA: Million-scale Dialogue Distillation with Social Commonsense Contextualization"}, {"paperId": "3c476acabd21dae0ae154cb77c6cdb96c6b6496b", "title": "CharmBana: Progressive Responses with Real-Time Internet Search for Knowledge-Powered Conversations"}, {"paperId": "b3e61c9fbb83de34182d9940e248bd4760a6698e", "title": "Dynamic Task-Oriented Dialogue: A Comparative Study of Llama-2 and Bert in Slot Value Generation"}, {"paperId": "a77fd5fd19e066b0fdb84d290305a3a9fae497e3", "title": "A Survey of Challenges and Methods in the Computational Modeling of Multi-Party Dialog"}, {"paperId": "c477438beee6dc81b01f74c3684fde5450cd5c1d", "title": "Controlled Data Augmentation for Training Task-Oriented Dialog Systems with Low Resource Data"}, {"paperId": "611609d35716f831f3cac0179fc17b2c5a50ee61", "title": "Large Language Models as SocioTechnical Systems"}]}
