{"paperId": "5ffc9a17d54ee490f0c02d37e9b910046f04f7b6", "publicationVenue": null, "title": "Security threats and countermeasures in military 5G systems", "abstract": "The fifth generation of mobile telecommunications (5G) is considered a very interesting solution for military applications. However characteristics of this technology (open interfaces, cloud-based nature) create additional security threats and generate very broad threat landscape for the 5G deployments. In the article we describe main security threats related to the Radio Access Network (RAN), taking into account the open version of its implementation – O-RAN. We emphasise also possible adversarial attacks which can have significant impact when machine learning algorithms are used e.g. in the RAN Intelligent Controller. Another important thereat vector which is valid for every 5G deployment is supply chain attack. The article summarizes the basic good security practices in ensuring security in military 5G private networks and the initial thoughts on how to counteract the attack vectors presented above.", "venue": "2022 24th International Microwave and Radar Conference (MIKON)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-12", "journal": {"name": "2022 24th International Microwave and Radar Conference (MIKON)", "pages": "1-6"}, "authors": [{"authorId": "2244400", "name": "J. Sliwa"}, {"authorId": "9286771", "name": "M. Suchanski"}], "citations": [{"paperId": "e1bb92641cc4eedacb270601cc825b18cbdd1b58", "title": "Misconfiguration in O-RAN: Analysis of the impact of AI/ML"}, {"paperId": "137e9b124bd72604b58baab7268b156b7fdefe29", "title": "Closed-Loop Security Management for Developing O-RAN Infrastructure and B5G RIC Applications"}, {"paperId": "1ce5b255c7304d708b48bdd2172e0cf632b2a7cd", "title": "Modeling 5G Threat Scenarios for Critical Infrastructure Protection"}, {"paperId": "60779d4859d1a30db7b2c6c18bcb45e774589866", "title": "Naval Use Cases of 5G Technology"}]}
