{"paperId": "6002b64dbcd10730e7151f8e225b63a0708be2a7", "publicationVenue": {"id": "34c3383e-c929-4d4d-b6fa-e1dbf53ba06b", "name": "Hacettepe Üniversitesi Edebiyat Fakültesi Dergisi", "alternate_names": ["Hacet Üniversitesi Edeb Fakültesi Derg", "Hacet Üniversitesi edeb fakültesi derg", "Hacettepe Üniversitesi edebiyat fakültesi dergisi"], "issn": "1301-5737", "alternate_issns": ["2630-5976"], "url": "https://dergipark.org.tr/en/pub/huefd", "alternate_urls": ["https://dergipark.org.tr/tr/pub/huefd"]}, "title": "Big Data, Digitization and New Surveillance Practices: New Decision-Making Culture and Panoptic Classification", "abstract": "Big data brings along a new decision-making culture through data mining aided decision-making mechanisms. One of the biggest sources of this mechanism is meta-data and that creates a suitable condition for mass-monitoring surveillance. The belief in these systems creates a discussion about usage of big data as a social classification tool, big data hubris, and big data divide. The aim of this study is to discuss the possible destructive results of big data especially as a social classification tool and new surveillance practices. In that point, this study focuses on the idea that big data paves the way to the new surveillance or dragnet surveillance practices and the possibility of social classification, and these might construct a world of increasing disadvantage. Through this panoptic sort, it comes with the problem of a serious power imbalance, simplification and decontextualization. It might result in the danger of loss of privacy and erosion of long-term privacy norms, a routine classification, manipulation of the future behaviors, antidemocratic control system, panoptic missort, data-antisubordination, abuse of civil rights and security problems.", "venue": "Hacettepe Üniversitesi Edebiyat Fakültesi Dergisi", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-03", "journal": {"name": "Hacettepe Üniversitesi Edebiyat Fakültesi Dergisi"}, "authors": [{"authorId": "2188955112", "name": "Elif ÖZUZ DAĞDELEN"}, {"authorId": "2104852558", "name": "Tuğça Poyraz"}], "citations": []}
