{"paperId": "602180226be0da2431478009d3c5dfbc2da10064", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Extracting Knowledge from Big Data for Sustainability: A Comparison of Machine Learning Techniques", "abstract": "At present, due to the unavailability of natural resources, society should take the maximum advantage of data, information, and knowledge to achieve sustainability goals. In today’s world condition, the existence of humans is not possible without the essential proliferation of plants. In the photosynthesis procedure, plants use solar energy to convert into chemical energy. This process is responsible for all life on earth, and the main controlling factor for proper plant growth is soil since it holds water, air, and all essential nutrients of plant nourishment. Though, due to overexposure, soil gets despoiled, so fertilizer is an essential component to hold the soil quality. In that regard, soil analysis is a suitable method to determine soil quality. Soil analysis examines the soil in laboratories and generates reports of unorganized and insignificant data. In this study, different big data analysis machine learning methods are used to extracting knowledge from data to find out fertilizer recommendation classes on behalf of present soil nutrition composition. For this experiment, soil analysis reports are collected from the Tata soil and water testing center. In this paper, Mahoot library is used for analysis of stochastic gradient descent (SGD), artificial neural network (ANN) performance on Hadoop environment. For better performance evaluation, we also used single machine experiments for random forest (RF), K-nearest neighbors K-NN, regression tree (RT), support vector machine (SVM) using polynomial function, SVM using radial basis function (RBF) methods. Detailed experimental analysis was carried out using overall accuracy, AUC–ROC (receiver operating characteristics (ROC), and area under the ROC curve (AUC)) curve, mean absolute prediction error (MAE), root mean square error (RMSE), and coefficient of determination (R2) validation measurements on soil reports dataset. The results provide a comparison of solution classes and conclude that the SGD outperforms other approaches. Finally, the proposed results support to select the solution or recommend a class which suggests suitable fertilizer to crops for maximum production.", "venue": "Sustainability", "year": 2019, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2019-11-25", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "30814809", "name": "Raghu Garg"}, {"authorId": "2324586", "name": "H. Aggarwal"}, {"authorId": "2005325", "name": "Piera Centobelli"}, {"authorId": "10665249", "name": "R. Cerchione"}], "citations": [{"paperId": "3c53069e6038dc882036510405ad24a74bbeaf33", "title": "Sustainable Food Development Based on Ensemble Machine Learning Assisted Crop and Fertilizer Recommendation System"}, {"paperId": "47bdaae7fd55a69e761c17c640b2806210fc9d2c", "title": "Predictive insights: leveraging Twitter sentiments and machine learning for environmental, social and governance controversy prediction"}, {"paperId": "acd700b9677de84f9a9d8fedb5fdb67e93422a52", "title": "Analysis of Environmental Protection and Economic Sustainability by Integrating Machine Learning Algorithms"}, {"paperId": "7dfb654c5edc5d9bd320d568df2267292e7bb970", "title": "Applications of Machine Learning Algorithms in Nitrogen Fertilizer Management of Triticale"}, {"paperId": "c696f05c27694641a889ee754947c3a747897b78", "title": "Research and Applications of RBF Big Data Processing Technology Based on Artificial Intelligence Algorithms"}, {"paperId": "a0600f696a3683e18b13102bf8b974eeb04b67cc", "title": "Enhanced reptile search optimization with convolutional autoencoder for soil nutrient classification model"}, {"paperId": "f73fcfdc5eba73f6868420435764267254d74c71", "title": "How Knowledge Transfer Impact Happens at the Farm Level: Insights from Advisers and Farmers in the Irish Agricultural Sector"}, {"paperId": "58a891c903bf5a5d6a5f53b5aaab5d398e1516a8", "title": "Stem Taper Estimation Using Artificial Neural Networks for Nothofagus Trees in Natural Forest"}, {"paperId": "c14c8a792a558541459cdcbfc3e55afe213821e5", "title": "Implementation of relevant fourth industrial revolution innovations across the supply chain of fruits and vegetables: A short update on Traceability 4.0."}, {"paperId": "1ded45d42e60cc59f159e030bfe523b9944ba8b4", "title": "Predicting Frost Depth of Soils in South Korea Using Machine Learning Techniques"}, {"paperId": "ceb8595efec76867c1a715d4456998293580481b", "title": "An efficient IDS in cloud environment using feature selection based on DM algorithm"}, {"paperId": "83ef023a6651ab60fe115223dbbb6cc83f75dc67", "title": "The derived demand for advertising expenses and implications on sustainability: a comparative study using deep learning and traditional machine learning methods"}, {"paperId": "294f49c5a024958f75eb3054c2ffa41995909012", "title": "Big data for sustainable agri‐food supply chains: a review and future research perspectives"}, {"paperId": "7743d83ce05d1600783571e6bb851b66762c37da", "title": "Pattern Recognition in Multivariate Time Series: Towards an Automated Event Detection Method for Smart Manufacturing Systems"}, {"paperId": "db877caad950f20612715a7d8cafc6895eb2dfe5", "title": "SPACEBORNE GNSS-R RETRIEVING ON GLOBAL SOIL MOISTURE APPROACHED BY SUPPORT VECTOR MACHINE LEARNING"}, {"paperId": "43828afac58479601b4e923c7adec29ff661073f", "title": "A specifically designed machine learning algorithm for GNSS position time series prediction and its applications in outlier and anomaly detection and earthquake prediction"}, {"paperId": "cba5f5fd5d5217857b6fa7df2fae73eb94095d3b", "title": "Examining Hybrid and Single SVM Models with Different Kernels to Predict Rock Brittleness"}, {"paperId": "f8a6b4f30728cb9d92f589644988396f54e7cc12", "title": "Failure Prediction Model Using Iterative Feature Selection for Industrial Internet of Things"}, {"paperId": "e175d93435e980d080c27f7b49855b88f96647cd", "title": "Reach on Waste Classification and Identification by Transfer Learning and Lightweight Neural Network"}, {"paperId": "de8a3ef8cd2cc54d292364d6010c955a0a1b07cc", "title": "Comparing Machine Learning Approaches for Predicting Spatially Explicit Life Cycle Global Warming and Eutrophication Impacts from Corn Production"}, {"paperId": "f58cd85a40317ccfc65b08ae94fbacca3d49128c", "title": "Developments in Financial Technologies for Achieving the Sustainable Development Goals (SDGs): FinTech and SDGs"}]}
