{"paperId": "6026336daf6f0277d2300aa82131927b25574622", "publicationVenue": null, "title": "International Journal of Electrical and Computer Engineering (IJECE)", "abstract": "Received Jul 27, 2021 Revised May 17, 2022 Accepted Jun 12, 2022 The human voice speech essentially includes paralinguistic information used in many real-time applications. Detecting the children’s gender is considered a challenging task compared to the adult’s gender. In this study, a system for human-robot interaction (HRI) is proposed to detect the gender in children’s speech utterances without depending on the text. The robot's perception includes three phases: Feature’s extraction phase where four formants are measured at each glottal pulse and then a median is calculated across these measurements. After that, three types of features are measured which are formant average (AF), formant dispersion (DF), and formant position (PF). Feature’s standardization phase where the measured feature dimensions are standardized using the z-score method. The semantic understanding phase is where the children’s gender is detected accurately using the logistic regression classifier. At the same time, the action of the robot is specified via a speech response using the text to speech (TTS) technique. Experiments are conducted on the Carnegie Mellon University (CMU) Kids dataset to measure the suggested system’s performance. In the suggested system, the overall accuracy is 98%. The results show a relatively clear improvement in terms of accuracy of up to 13% compared to related works that utilized the CMU Kids dataset.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2159078888", "name": "H. E. Ftouh"}, {"authorId": "2003264475", "name": "E. Moustapha"}, {"authorId": "116072358", "name": "Amar Touhami Naima"}, {"authorId": "2125333087", "name": "Zakriti Alia"}], "citations": []}
