{"paperId": "6027391da4b023d0e2e9046b5238f10610294433", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "A Game-theoretic Approach to Data Interaction", "abstract": "As most users do not precisely know the structure and/or the content of databases, their queries do not exactly reflect their information needs. The database management system (DBMS) may interact with users and use their feedback on the returned results to learn the information needs behind their queries. Current query interfaces assume that users do not learn and modify the way they express their information needs in the form of queries during their interaction with the DBMS. Using a real-world interaction workload, we show that users learn and modify how to express their information needs during their interactions with the DBMS and their learning is accurately modeled by a well-known reinforcement learning mechanism. As current data interaction systems assume that users do not modify their strategies, they cannot discover the information needs behind users’ queries effectively. We model the interaction between the user and the DBMS as a game with identical interest between two rational agents whose goal is to establish a common language for representing information needs in the form of queries. We propose a reinforcement learning method that learns and answers the information needs behind queries and adapts to the changes in users’ strategies and proves that it improves the effectiveness of answering queries, stochastically speaking. We propose two efficient implementations of this method over large relational databases. Our extensive empirical studies over real-world query workloads indicate that our algorithms are efficient and effective.", "venue": "ACM Transactions on Database Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-08", "journal": {"name": "ACM Transactions on Database Systems (TODS)", "pages": "1 - 44", "volume": "45"}, "authors": [{"authorId": "3286927", "name": "Ben McCamish"}, {"authorId": "2087760", "name": "Vahid Ghadakchi"}, {"authorId": "3192362", "name": "Arash Termehchy"}, {"authorId": "1774385", "name": "B. Touri"}, {"authorId": "1404952185", "name": "E. Cotilla-Sánchez"}, {"authorId": "2109047773", "name": "Liang Huang"}, {"authorId": "2059199", "name": "Soravit Changpinyo"}], "citations": []}
