{"paperId": "60304c0b22e82b7d280631557ee0c3e0f4cf03c7", "publicationVenue": {"id": "d9720b90-d60b-48bc-9df8-87a30b9a60dd", "name": "Neural Information Processing Systems", "type": "conference", "alternate_names": ["Neural Inf Process Syst", "NeurIPS", "NIPS"], "url": "http://neurips.cc/"}, "title": "What a MESS: Multi-Domain Evaluation of Zero-Shot Semantic Segmentation", "abstract": "While semantic segmentation has seen tremendous improvements in the past, there are still significant labeling efforts necessary and the problem of limited generalization to classes that have not been present during training. To address this problem, zero-shot semantic segmentation makes use of large self-supervised vision-language models, allowing zero-shot transfer to unseen classes. In this work, we build a benchmark for Multi-domain Evaluation of Semantic Segmentation (MESS), which allows a holistic analysis of performance across a wide range of domain-specific datasets such as medicine, engineering, earth monitoring, biology, and agriculture. To do this, we reviewed 120 datasets, developed a taxonomy, and classified the datasets according to the developed taxonomy. We select a representative subset consisting of 22 datasets and propose it as the MESS benchmark. We evaluate eight recently published models on the proposed MESS benchmark and analyze characteristics for the performance of zero-shot transfer models. The toolkit is available at https://github.com/blumenstiel/MESS.", "venue": "Neural Information Processing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-27", "journal": {"name": "ArXiv", "volume": "abs/2306.15521"}, "authors": [{"authorId": "2174862531", "name": "Benedikt Blumenstiel"}, {"authorId": "71437824", "name": "Johannes Jakubik"}, {"authorId": "2220626846", "name": "Hilde Kuhne"}, {"authorId": "2097707635", "name": "Michael Vossing"}], "citations": [{"paperId": "44fff8f47b578c2ee38bc25ec585f909aaddc088", "title": "Stable Segment Anything Model"}, {"paperId": "804fc51343267224a0c654bbf8bec67a96062fad", "title": "CAT-Seg: Cost Aggregation for Open-Vocabulary Semantic Segmentation"}]}
