{"paperId": "603079ee89aafb0b0466c4089ef1edf678e47871", "publicationVenue": {"id": "cf81dfa4-e4a6-4e46-a4ef-ea7820cf1fe7", "name": "Artificial Intelligence and Interactive Digital Entertainment Conference", "type": "conference", "alternate_names": ["AIIDE", "Artif Intell Interact Digit Entertain Conf"], "url": "http://www.aiide.org/"}, "title": "Language Model-Based Player Goal Recognition in Open World Digital Games", "abstract": "Devising models that reliably recognize player goals is a key challenge in creating player-adaptive games. Player goal recognition is the task of automatically recognizing the intent of a player from a sequence of observed player actions in a game environment. In open-world digital games, players often undertake suboptimal and varied sequences of actions to achieve goals, and the high degree of freedom afforded to players makes it challenging to identify sequential patterns that lead toward specific goals. To address these issues, we present a player goal recognition framework that utilizes a fine-tuned T5 language model, which incorporates our novel attention mechanism called Temporal Contrary Attention (TCA). The T5 language model enables the framework to exploit correlations between observations through non-sequential self-attention within input sequences, while TCA enables the framework to learn to eliminate goal hypotheses by considering counterevidence within a temporal window. We evaluate our approach using game trace data collected from 144 players' interactions with an open-world educational game. Specifically, we investigate the predictive capacity of our approach to recognize player goals as well as player plans represented as abstract actions. Results show that our approach outperforms non-linguistic machine learning approaches as well as T5 without TCA. We discuss the implications of these findings for the design and development of player goal recognition models to create player-adaptive games.", "venue": "Artificial Intelligence and Interactive Digital Entertainment Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-06", "journal": {"pages": "75-85"}, "authors": [{"authorId": "93398093", "name": "Y. Kim"}, {"authorId": "97898202", "name": "A. Goslen"}, {"authorId": "2256208513", "name": "Jonathan Rowe"}, {"authorId": "2179452295", "name": "Bradford W. Mott"}, {"authorId": "2243287125", "name": "James C. Lester"}], "citations": []}
