{"paperId": "6044fcc4575f476271cfc2224c5c3bb88ef964fa", "publicationVenue": {"id": "229ff272-1128-48a4-94eb-2ea4041eadff", "name": "International Conference on Cloud Computing and Services Science", "type": "conference", "alternate_names": ["CLOSER", "Int Conf Cloud Comput Serv Sci"], "url": "http://closer.scitevents.org/"}, "title": "GoAT: A Sensor Ranking Approach for IoT Environments", "abstract": ": The data collected and transmitted by the sensors, in the Internet of Things environment, must be stored and processed in order to enable Smart Cities and Industry 4.0. However, due to the growth of number of devices, it becomes necessary to implement techniques to select most suitable sensors for each task. This approach is important to make possible to execute applications, where low latency requirements are present. Thus, several works were dedicated to the study on how to search, index, and rank sensors to overcome these challenges. A method, called GoAT, is presented in this paper to rank sensors based on the theory of active perception. The solution was evaluated using four real datasets. Our results successfully demonstrate that the proposal solution can provide an interesting level of reliability of the utilization of sensor data. Furthermore, GoAT requires a low computational resource, and at the same time, reduces latency in the sensor selection process.", "venue": "International Conference on Cloud Computing and Services Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "169-177"}, "authors": [{"authorId": "145748016", "name": "F. Costa"}, {"authorId": "38922416", "name": "S. Nassar"}, {"authorId": "144749724", "name": "M. Dantas"}], "citations": [{"paperId": "dd41f909de46afadcae411feac35e83e8ce1b355", "title": "A Novel Context-Aware Computing Framework with the Internet of Things and Prediction of Sensor Rank Using Random Neural XG-Boost Algorithm"}, {"paperId": "7dcbb3bab7c33f67e1229c2d86a03f4fcd0c3ea6", "title": "A Sensor Ranking Approach for Edge–Fog–Cloud Environments"}, {"paperId": "42c81ede1e4c5851cb2d92bc8a6b4599f812cf25", "title": "Nutrient Film Technique-Based Hydroponic Monitoring and Controlling System Using ANFIS"}, {"paperId": "0f6bae38ef55d7a6e801b729687becadad7dfa05", "title": "UniPreCIS : A data pre-processing solution for collocated services on shared IoT"}]}
