{"paperId": "6046b1ad6859c608d87080f07845777b3859982d", "publicationVenue": {"id": "486a8a53-464e-4738-8f52-4560d20b262e", "name": "International Scientific-Practical Conference Problems of Infocommunications Science and Technology", "type": "conference", "alternate_names": ["PIC S&T", "Int Sci Conf Probl Infocommunications Sci Technol"]}, "title": "Structuring Problem Cases Based on Constraints in the Drilling Control Infocommunications Routines", "abstract": "Analysis of the research subject domain, as well as means to support technological decision-making, shows that geological and technological uncertainties affect the ability of the drilling process operator to achieve technical and economic goals when drilling oil and gas wells. In particular, this study develops an integrated intelligent hierarchical decision-making strategy for drilling, which allows optimizing the task of operational efficiency of drilling in real time, by forecasting and avoiding emergencies. The advantage of the proposed approach is that it allows the use of large amounts of actual data obtained from sensors or data mining systems at the level of direct regulation and their aggregate analysis based on constraints control. Technological operations of the drilling process should be considered as processes that can be designed for some hierarchy. Defining the hierarchical organization of the process allows a way to build a solution that can lead to results that are higher than the set of optimal solutions built for individual unstructured elements of the process. Therefore, an important solution to these problems is to create intelligent decision support systems in the drilling process, which include multi-layered and scalable strategies based on constraints. The use of such strategies allows to optimize the overall efficiency of drilling and development of wells with a given productivity. The structure of the problem will be to achieve common integrated goals, which is not the arithmetic sum of selected problems for which there are solutions.", "venue": "International Scientific-Practical Conference Problems of Infocommunications Science and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-10-06", "journal": {"name": "2020 IEEE International Conference on Problems of Infocommunications. Science and Technology (PIC S&T)", "pages": "152-156"}, "authors": [{"authorId": "9245904", "name": "V. Sheketa"}, {"authorId": "31118041", "name": "Volodymyr Pikh"}, {"authorId": "144075160", "name": "Roman Vovk"}, {"authorId": "49781888", "name": "M. Pasyeka"}, {"authorId": "9376082", "name": "Y. Romanyshyn"}, {"authorId": "2100948890", "name": "Olga Khrabatyn"}], "citations": []}
