{"paperId": "604b3e4517709d035e0c2cff8295a5fb297a12c7", "publicationVenue": null, "title": "'Walking Into a Fire Hoping You Don't Catch': Strategies and Designs to Facilitate Cross-Partisan Online Discussions", "abstract": "While cross-partisan conversations are central to a vibrant deliberative democracy, these conversations are hard to have, especially amidst unprecedented levels of partisan animosity we observe today. We report on a qualitative study of 17 US residents who engage with outpartisans on Reddit to understand what they look for in these interactions, and the strategies they adopt. We find that users have multiple, sometimes contradictory expectations of these conversations, ranging from deliberative discussions to entertainment and banter. In aiming to foster 'good' cross-partisan discussions, users make strategic choices on which subreddits to participate in, who to engage with and how to talk to outpartisans, often establishing common ground, complimenting, and remaining dispassionate in their interactions. Further, contrary to offline settings where knowing more about outpartisan interlocutors help manage disagreements, on Reddit, users look to actively learn as little as possible about them for fear that such information may bias their interactions. However, through design probes, we find that users are actually open to knowing certain kinds of information about their interlocutors, such as non-political subreddits that they both participate in, and to having that information made visible to their interlocutors. However, making other information visible, such as the other subreddits that they participate in or their past comments, though potentially humanizing, raises concerns around privacy and misuse of that information for personal attacks especially among women and minority groups. Finally, we identify important challenges and opportunities in designing to improve online cross-partisan interactions in today's hyper-polarized environment.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-15", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 30", "volume": "5"}, "authors": [{"authorId": "2116525", "name": "Ashwin Rajadesingan"}, {"authorId": "2123319520", "name": "Carolyn Duran"}, {"authorId": "144741762", "name": "P. Resnick"}, {"authorId": "1759771", "name": "Ceren Budak"}], "citations": [{"paperId": "150cbc974b91fd3410b62335bf2b7dcff72ee4fd", "title": "GuesSync!: An Online Casual Game To Reduce Affective Polarization"}, {"paperId": "f07722db554355ec65baa9c0ea7c923e08d1e236", "title": "SIG on Designing for Constructive Conflict"}]}
