{"paperId": "605194de8f63422cd4de6cf3ab392f82fb72a523", "publicationVenue": {"id": "31315a89-a10c-4d38-8313-aa818879edb4", "name": "Computer Physics Communications", "type": "journal", "alternate_names": ["Comput Phys Commun"], "issn": "0010-4655", "url": "http://www.elsevier.com/locate/cpc", "alternate_urls": ["http://www.sciencedirect.com/science/journal/00104655"]}, "title": "Prototyping a ROOT-based distributed analysis workflow for HL-LHC: the CMS use case", "abstract": "The challenges expected for the next era of the Large Hadron Collider (LHC), both in terms of storage and computing resources, provide LHC experiments with a strong motivation for evaluating ways of rethinking their computing models at many levels. Great efforts have been put into optimizing the computing resource utilization for the data analysis, which leads both to lower hardware requirements and faster turnaround for physics analyses. In this scenario, the Compact Muon Solenoid (CMS) collaboration is involved in several activities aimed at benchmarking different solutions for running High Energy Physics (HEP) analysis workflows. A promising solution is evolving software towards more user-friendly approaches featuring a declarative programming model and interactive workflows. The computing infrastructure should keep up with this trend by offering on the one side modern interfaces, and on the other side hiding the complexity of the underlying environment, while efficiently leveraging the already deployed grid infrastructure and scaling toward opportunistic resources like public cloud or HPC centers. This article presents the first example of using the ROOT RDataFrame technology to exploit such next-generation approaches for a production-grade CMS physics analysis. A new analysis facility is created to offer users a modern interactive web interface based on JupyterLab that can leverage HTCondor-based grid resources on different geographical sites. The physics analysis is converted from a legacy iterative approach to the modern declarative approach offered by RDataFrame and distributed over multiple computing nodes. The new scenario offers not only an overall improved programming experience, but also an order of magnitude speedup increase with respect to the previous approach.", "venue": "Computer Physics Communications", "year": 2023, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-24", "journal": {"name": "ArXiv", "volume": "abs/2307.12579"}, "authors": [{"authorId": "2193863465", "name": "Tommaso Tedeschi"}, {"authorId": "1637242626", "name": "V. Padulano"}, {"authorId": "145416525", "name": "D. Spiga"}, {"authorId": "26914973", "name": "D. Ciangottini"}, {"authorId": "32538298", "name": "M. Tracolli"}, {"authorId": "69536532", "name": "E. T. Saavedra"}, {"authorId": "51040037", "name": "E. Guiraud"}, {"authorId": "97956566", "name": "M. Biasotto"}], "citations": []}
