{"paperId": "6051833218a27c15009a8c14c646aa50f1915868", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Structural Predictability Optimization Against Inference Attacks in Data Publishing", "abstract": "Graphs have been proved to be a useful mathematical representation for a broad variety of real-world complex systems, and the structure prediction on graphs refers to estimating the potential relationship between the objects from the observed structures, being fundamental in many data analysis applications, such as network alignment, network reconstruction, and link prediction. Accordingly, in data publishing, it is necessary to regulate the structural predictability of graphs against inference attack to protect the sensitive information of the data generators. In contrast to the existing works about graph structure perturbation for node ranking, information diffusion, and so on, the structural predictability optimization problem, i.e., reducing the accuracy of sensitive relationships inference in graphs, has not been extensively studied. This paper presents an active learning algorithm that selects the most representative links to be perturbed, thus regulating the structural predictability of graphs, that is, removing as few as possible links to undermine the regularity level of graphs, which forms the foundation of inference attack methods. Specifically, with the assumption that the substructure with higher regularity level contains more regular equivalence components and has more equivalent paths supplied for the random walk processes, random walk-based link importance measuring algorithm is proposed to identify the representative links. The structural regularity metric, measuring the structural predictability of graphs, is also introduced to guide the link perturbation for structural predictability optimization. The extensive experiments on artificial and real-world data sets demonstrate the effectiveness of the proposed structural predictability optimization method. Specifically, the method can learn the role of links accurately in term of graph organization, and the performance of structure inference on graphs can be deteriorated effectively by representative link-based perturbation.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "92119-92136", "volume": "7"}, "authors": [{"authorId": "47353913", "name": "Tao Wu"}, {"authorId": "151013277", "name": "Guannan Ming"}, {"authorId": "2620144", "name": "Xingping Xian"}, {"authorId": "2158628744", "name": "Wei Wang"}, {"authorId": "39613309", "name": "Shaojie Qiao"}, {"authorId": "1687201", "name": "Guangxia Xu"}], "citations": [{"paperId": "01ddfc5c259c92190e0c0ce2b7d1084d00df696c", "title": "Enhancing robustness of link prediction for noisy complex networks"}, {"paperId": "b62f64e5d54a59e5aac1efe04aff4773486039c3", "title": "The Influence of Network Structural Preference on Link Prediction"}, {"paperId": "55b919cf95a5a4d4a4a76c0189b296255de7a7b9", "title": "Hybrid Weed-Particle Swarm Optimization Algorithm and CMixture for Data Publishing"}, {"paperId": "927d4c586ddf22e489ac69f14213ca8db7169b8b", "title": "Anonymization Techniques for Privacy Preserving Data Publishing: A Comprehensive Survey"}, {"paperId": "c5b90651364948b98f94c6066cdae3e1147ecd7c", "title": "Towards link inference attack against network structure perturbation"}]}
