{"paperId": "606092ba86c699cee43b2f218c5a771b9a229ebd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "G-Tran: Making Distributed Graph Transactions Fast", "abstract": "Graph transaction processing raises many unique challenges such as random data access due to the irregularity of graph structures, low throughput and high abort rate due to the relatively large read/write sets in graph transactions. To address these challenges, we present G-Tran -- an RDMA-enabled distributed in-memory graph database with serializable and snapshot isolation support. First, we propose a graph-native data store to achieve good data locality and fast data access for transactional updates and queries. Second, G-Tran adopts a fully decentralized architecture that leverages RDMA to process distributed transactions with the MPP model, which can achieve high performance by utilizing all computing resources. In addition, we propose a new MV-OCC implementation with two optimizations to address the issue of large read/write sets in graph transactions. Extensive experiments show that G-Tran achieves competitive performance compared with other popular graph databases on benchmark workloads.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-10", "journal": {"name": "ArXiv", "volume": "abs/2105.04449"}, "authors": [{"authorId": "2108844303", "name": "Hongzhi Chen"}, {"authorId": "2145413970", "name": "Changji Li"}, {"authorId": "2113919465", "name": "Chen Zheng"}, {"authorId": "2150609388", "name": "Chenghuan Huang"}, {"authorId": "2115219530", "name": "Juncheng Fang"}, {"authorId": "1717691", "name": "James Cheng"}, {"authorId": "2151811827", "name": "Jian Zhang"}], "citations": [{"paperId": "bf67bc1d752a916c6e44513659e2b571a3e3a47a", "title": "AeonG: An Efficient Built-in Temporal Support in Graph Databases"}, {"paperId": "05de020b2cbd76c4846a2307e654ed6ae72bc46a", "title": "Tuning the Tail Latency of Distributed Queries Using Replication"}, {"paperId": "b6300a2bbc391d654a359a1c612805602d089892", "title": "An Efficient Built-in Temporal Support in MVCC-based Graph Databases"}]}
