{"paperId": "60622a6b31341ce9ef67788bbd3ee4ca4ba9a9bd", "publicationVenue": {"id": "c395d217-d288-41c4-a32c-c0f5bf9c8d25", "name": "Radio Electronics, Computer Science, Control", "type": "journal", "alternate_names": ["Radio Electron Comput Sci Control"], "issn": "2313-688X"}, "title": "DETERMINATION OF INHERITANCE RELATIONS AND RESTRUCTURING OF SOFTWARE CLASS MODELS IN THE PROCESS OF DEVELOPING INFORMATION SYSTEMS", "abstract": "Context. The implementation of different use-cases may be performed by different development teams at different times. This results in a poorly structured code. The problem is exacerbated when developing medium and large projects in a short time. \nObjective. Since inheritance is one of the effective ways to structure and improve the quality of code, the aim of the study is to determine possible inheritance relationships for a variety of class models. \nMethod. It is proposed to select from the entire set of classes representing the class model at a certain design stage, subsets for which a common parent class (in a particular case, an abstract class) is possible. To solve the problem, signs of the generality of classes have been formulated. The mathematical model of the conceptual class has been improved by including information about the responsibilities of the class, its methods and attributes. The connection of each class with the script items for which it is used has been established. A system of data types for class model elements is proposed. Description of class method signatures has been extended. A method for restructuring the class model, which involves 3 stages, has been developed. At the first stage, the proximity coefficients of classes are determined. At the second, subsets of possible child classes are created. At the third stage, an automated transformation of the class structure is performed, considering the identified inheritance relationships. \nResults. A software product for conducting experiments to identify possible inheritance relationships depending on the number of classes and the degree of their similarity has been developed. The results of the conducted tests showed the effectiveness of the decisions made. \nConclusions. The method uses an algorithm for forming subsets of classes that can have one parent and an algorithm for automatically creating and converting classes to build a two-level class hierarchy. An experiment showed a threefold reduction in errors in detecting inheritance and a multiple reduction in time in comparison with the existing technology.", "venue": "Radio Electronics, Computer Science, Control", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-10", "journal": {"name": "Radio Electronics, Computer Science, Control"}, "authors": [{"authorId": "47982701", "name": "O. Kungurtsev"}, {"authorId": "2197614108", "name": "A. I. Vytnova"}], "citations": []}
