{"paperId": "606f45e97df99cc1d622926167d6052bc2956911", "publicationVenue": {"id": "52ee8f70-41d7-4479-a480-646299aafc28", "name": "Frontiers in Ecology and Evolution", "type": "journal", "alternate_names": ["Front Ecol Evol"], "issn": "2296-701X", "url": "http://www.frontiersin.org/Behavioral_and_Evolutionary_Ecology", "alternate_urls": ["http://www.frontiersin.org/ecology_and_evolution", "http://www.frontiersin.org/Ecology_and_Evolution/archive", "https://www.frontiersin.org/journals/ecology-and-evolution"]}, "title": "Adaptive slope reliability analysis method based on sliced inverse regression dimensionality reduction", "abstract": "The response surface model has been widely used in slope reliability analysis owing to its efficiency. However, this method still has certain limitations, especially the curse of high dimensionality when considering the spatial variability of geotechnical parameters. The slice inverse regression dimensionality reduction method is efficient to obtaining the dimensionality-reduction variables from the original soil parameters space, before constructing the response surface. However, the dimensionality reduction process may cause accuracy deficiency due to the loss of variable information. An adaptive slope reliability analysis method is proposed to quantify and correct information loss and errors. Additionally, the slope failure probability based on the response surface in the dimensionality reduction space is modified to an unbiased one based on the finite model in the original space. In this study, two soil slopes considering spatial variability are taken as examples. The results illustrate that this method can effectively reduce the loss of accuracy in the dimensionality reduction process, while obtaining unbiased finite-element-based failure probability effectually. The method addresses the limitation whereby the accuracy of the dimensionality reduction process depends on the sample size and the number of dimensionality-reduction variables. Simultaneously, the proposed method significantly improves the computational efficiency of the sliced inverse regression method and realizes a reasonable dimensionality reduction effect, thereby improving the application of the response surface in practical slope reliability high-dimensional issues.", "venue": "Frontiers in Ecology and Evolution", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-22", "journal": {"name": "Frontiers in Ecology and Evolution"}, "authors": [{"authorId": "2244256115", "name": "Zheng Zhou"}, {"authorId": "2244316131", "name": "Haibin Xiong"}, {"authorId": "2244620308", "name": "Wen-Xia Wu"}, {"authorId": "2244251650", "name": "Yi-Jian Yang"}, {"authorId": "2244614364", "name": "Xuhai Yang"}], "citations": []}
