{"paperId": "606f6b79b803aba78286e272b829d77918894339", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "E-PODS: A Fast Heuristic for Data/Service Delivery in Vehicular Edge Computing", "abstract": "With the rise in state-of-the-art communication modes for vehicles such as vehicle to vehicle (V2V), vehicle to infrastructure (V2I) and vehicle to cloud (V2C), modern vehicles are increasingly being connected to cloud and fog/edge nodes. These vehicle connectivity modes have enabled the realization of Vehicular Edge Computing (VEC) paradigm, whereby vehicles can leverage fog/edge node resources for storage/computation. In a VEC system, vehicles receive very important and large quantity of data from edge nodes, which is termed as data delivery. In addition, edge nodes can execute some services and send the results back to the vehicle, which is called service delivery. Fast and efficient edge resource allocation for data/service delivery is important in order to serve as many vehicles as possible in the VEC system. However, edge resource allocation is complex with large number of edges and vehicles, while also considering vehicle flow parameters. In this work, we propose Edge-Pairwise Optimal Data/Service Delivery (E-PODS), which is a fast and efficient heuristic for data/service delivery. Through experiments with synthetic and real vehicular traces, we demonstrate that E-PODS is considerably faster than the optimal approach, while making resource allocations that are close to optimal in terms of total edge bandwidth cost and number of serviced vehicles.", "venue": "IEEE Vehicular Technology Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 93rd Vehicular Technology Conference (VTC2021-Spring)", "pages": "1-6"}, "authors": [{"authorId": "2109983165", "name": "Akshaj Gupta"}, {"authorId": "2112914334", "name": "Joseph John Cherukara"}, {"authorId": "38493287", "name": "Deepak Gangadharan"}, {"authorId": "1771227", "name": "Baekgyu Kim"}, {"authorId": "1681081", "name": "O. Sokolsky"}, {"authorId": "144637634", "name": "Insup Lee"}], "citations": [{"paperId": "21681ad1be96eb69ad9ecbf266b0cb13564b358a", "title": "Enhancing vehicular edge computing system through cooperative computation offloading"}]}
