{"paperId": "607866aa2572df5b14488484704ff4ec10b0a8eb", "publicationVenue": {"id": "094f3ff3-fb67-4573-9f00-0852f0409d13", "name": "International Conference on Smart Cloud", "type": "conference", "alternate_names": ["SmartCloud", "Int Conf Smart Cloud"]}, "title": "A Performance-Improved and Storage-Efficient Secondary Index for Big Data Processing", "abstract": "There are billions of devices in smart grid nowadays. For every data source, it produces thousands of data records every day. Classical relational databases are malfunctioned when dealing with these large-scale data sets. Powerful big data platform is needed to process the information in private clouds of smart grid. HBase is a promising platform to solve these problems. However, finding an effective indexing scheme is still hard because most existing schemes which retrieve data by columns are time-consuming. In this paper, we present a refined secondary index scheme on HBase. It can not only accelerate query process but also save storage space. Experimental results show that when referring to join operation, our proposed indexing scheme provides a minimum 5.584x speedup to a maximum 571.360x speedup compared with a query scheme without any index and it provides a minimum 1.026x speedup to a maximum 4.761x speedup compared with a classical secondary index. Our proposed secondary index scheme is feasible and effective on both query performance and storage efficiency.", "venue": "International Conference on Smart Cloud", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE International Conference on Smart Cloud (SmartCloud)", "pages": "161-167"}, "authors": [{"authorId": "2112253553", "name": "Han Wu"}, {"authorId": "2116511169", "name": "Yongxin Zhu"}, {"authorId": "2146409955", "name": "Chang Wang"}, {"authorId": "151051516", "name": "Junjie Hou"}, {"authorId": "2145680138", "name": "Mengjun Li"}, {"authorId": "8791332", "name": "Qixuan Xue"}, {"authorId": "30497213", "name": "Kedun Mao"}], "citations": [{"paperId": "05d7630f93f8f7322a7f565e0aa45e87ec91ba14", "title": "A Novel Architecture to Integrate Multi-Source Data into Distributed Environment using Big Data Infrastructure"}, {"paperId": "dae818c2cc2d2c7861b8997b1ac144010cf7d793", "title": "Big Data Storage Tools Using NoSQL Databases and Their Applications in Various Domains: A Systematic Review"}, {"paperId": "b1182572670f21fcbf4d3eab8d6d245d9a0b95d3", "title": "AN ENHANCED DYNAMIC ALGORITHM FOR ASSOCIATION RULES MINING"}]}
