{"paperId": "6080abc37c89429748cd5984f1d76f234f83eccf", "publicationVenue": {"id": "d5e0c47e-1f80-41d8-a565-44d86b990db3", "name": "Frontiers in Veterinary Science", "type": "journal", "alternate_names": ["Front Vet Sci"], "issn": "2297-1769", "url": "https://www.frontiersin.org/journals/veterinary-science", "alternate_urls": ["http://journal.frontiersin.org/journal/veterinary-science", "http://www.frontiersin.org/Veterinary_Science"]}, "title": "Translating Big Data into Smart Data for Veterinary Epidemiology", "abstract": "The increasing availability and complexity of data has led to new opportunities and challenges in veterinary epidemiology around how to translate abundant, diverse, and rapidly growing “big” data into meaningful insights for animal health. Big data analytics are used to understand health risks and minimize the impact of adverse animal health issues through identifying high-risk populations, combining data or processes acting at multiple scales through epidemiological modeling approaches, and harnessing high velocity data to monitor animal health trends and detect emerging health threats. The advent of big data requires the incorporation of new skills into veterinary epidemiology training, including, for example, machine learning and coding, to prepare a new generation of scientists and practitioners to engage with big data. Establishing pipelines to analyze big data in near real-time is the next step for progressing from simply having “big data” to create “smart data,” with the objective of improving understanding of health risks, effectiveness of management and policy decisions, and ultimately preventing or at least minimizing the impact of adverse animal health issues.", "venue": "Frontiers in Veterinary Science", "year": 2017, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-07-17", "journal": {"name": "Frontiers in Veterinary Science", "volume": "4"}, "authors": [{"authorId": "3811092", "name": "K. VanderWaal"}, {"authorId": "40301684", "name": "R. Morrison"}, {"authorId": "145340881", "name": "C. Neuhauser"}, {"authorId": "46959924", "name": "C. Vilalta"}, {"authorId": "10241421", "name": "Andrés Perez"}], "citations": [{"paperId": "6ad53bf169eb9e6a24bda3657daa32e400243105", "title": "Livestock and environmental characterization of Colombian municipalities: study of vesicular stomatitis"}, {"paperId": "ea020599f9fec8fdab3862cb7a65a573ed247fca", "title": "Quantification of the effect of in-utero events on lifetime resilience in dairy cows."}, {"paperId": "675f384378dd2c474786f909ce13da017ae1d42f", "title": "Investigating the uses of machine learning algorithms to inform risk factor analyses: The example of avian infectious bronchitis virus (IBV) in broiler chickens."}, {"paperId": "fd23817a46f95a9b1e95f98b1efc03010b3a7980", "title": "Smart modelling of dairy milk production with machine learning"}, {"paperId": "d1a4fe102c208cbcdd87bb45f5b2d0b7fa87e5f3", "title": "When Everything Becomes Bigger: Big Data for Big Poultry Production"}, {"paperId": "2e1e71f50e2222cfde617c69f063ecbbbb10fd5f", "title": "Simulating contact networks for livestock disease epidemiology: a systematic review"}, {"paperId": "c2c28694252bea2df772eb516e9ec7624b878c12", "title": "Connecting livestock disease dynamics to human learning and biosecurity decisions"}, {"paperId": "2bcf5a5c261f6682ac5a3c1313d398b744e873f9", "title": "Reshaping surveillance for infectious diseases: less chasing of pathogens and more monitoring of drivers."}, {"paperId": "26e8540ada0ee7500b173c82adc59c76e6e0b900", "title": "ASAS-NANP symposium: mathematical modeling in animal nutrition-Making sense of big data and machine learning: how open-source code can advance training of animal scientists."}, {"paperId": "3758aba695dde1e1d54e6a5f0276d40601b45391", "title": "Syndromic Surveillance: Developing an early warning system for rabies"}, {"paperId": "5784bce31c460d8142374653c452ad1f4a1e0e71", "title": "WildHealthNet: Supporting the development of sustainable wildlife health surveillance networks in Southeast Asia."}, {"paperId": "cff1c1ee99577a51ac4e0ffc56e33f9bdd909e61", "title": "Australian veterinarians' perspectives on the contribution of the veterinary workforce to the Australian animal health surveillance system"}, {"paperId": "241797d72c3720cf818d20c3215661926296a9d8", "title": "ASAS-NANP Symposium: Mathematical Modeling in Animal Nutrition: The progression of data analytics and artificial intelligence in support of sustainable development in animal science"}, {"paperId": "2e28f244c28e1e3ac17c2b1ff336312965d6b5b0", "title": "The Contribution of Data-Driven Technologies in Achieving the Sustainable Development Goals"}, {"paperId": "f614b49ec2e00b145eb078af608144b224ce4644", "title": "A 30 year topic analysis of Veterinary Medicine literature"}, {"paperId": "e9d92527396a82d6333e1aed6668dfcf3ead8ddf", "title": "Resultados de competições e informações genealógicas de equinos da raça crioula: uma abordagem baseada em descoberta do conhecimento"}, {"paperId": "e319d8a7a837b89adf130c536b8be736fcd026f1", "title": "Digital technologies and implications for Veterinary Services."}, {"paperId": "459d4eb251e364ded7c0863d1838f81e90ec0d9e", "title": "Forecasting viral disease outbreaks at the farm-level for commercial sow farms in the U.S."}, {"paperId": "4c44468f090e80a6361944a0cba57dd50bae7ef3", "title": "Exploratory analysis of methods for automated classification of clinical diagnoses in Veterinary Medicine"}, {"paperId": "bbed7757541a605d448ad8cea76f6c82c7351869", "title": "Man’s best friend in life and death: scientific perspectives and challenges of dog brain banking"}, {"paperId": "146f62093ba15c1d75cba24175e8eb475e669ec2", "title": "Dogs as pets and pests: Global patterns of canine abundance, activity, and health."}, {"paperId": "0d3aa1bc4e795fb4effc4a7bc0e70de639d1d216", "title": "Data-Driven Surveillance: Effective Collection, Integration, and Interpretation of Data to Support Decision Making"}, {"paperId": "76c30eb076acb61ebde680f29cf7a12d1fed7720", "title": "Research perspectives on animal health in the era of artificial intelligence"}, {"paperId": "cb0630bbe0f22662abae83a44cf26ef70814c4e7", "title": "Digital Livestock Farming"}, {"paperId": "de6ed7cc3ac287571f0a7beeeba08727d189881e", "title": "One Digital Health: A Unified Framework for Future Health Ecosystems"}, {"paperId": "38a810fd657b3faa9da1ad6ff4d406e425d4516a", "title": "Use of Network Analysis and Spread Models to Target Control Actions for Bovine Tuberculosis in a State from Brazil"}, {"paperId": "3cc9e0edc9e8e1a5f50f2169883657af6ac6afc8", "title": "Predicting WNV Circulation in Italy Using Earth Observation Data and Extreme Gradient Boosting Model"}, {"paperId": "7a76676cd1c810ac9ab58f911f941ba835743d33", "title": "Intelligence artificielle et santé animale"}, {"paperId": "ea859f9558505413b6e2040f85064934c7f0ee21", "title": "Analysis of puerperal metritis treatment records in a grazing dairy farm in Argentina."}, {"paperId": "2b199d640d97714d81cfd8129d58a8b87a957d30", "title": "The role of sensors, big data and machine learning in modern animal farming"}, {"paperId": "17ff9df7da3ce94e48a851b872b87a582e9e0357", "title": "Digitalization of Animal Farming"}, {"paperId": "02a5194f3d4bf07bb2f5d1afcccf5cb7dea4b724", "title": "Modelling and simulation of COVID-19 propagation in a large population with specific reference to India"}, {"paperId": "1504b0862b1be92503c58c7212b838781f8a29d6", "title": "Prediction of seasonal patterns of porcine reproductive and respiratory syndrome virus RNA detection in the U.S. swine industry"}, {"paperId": "b314fd23781304c7cd43875b41b39eb8f089e953", "title": "Automated prediction of mastitis infection patterns in dairy herds using machine learning"}, {"paperId": "bb2d1a8026c4eedd7fb47c64b12eaf9f7cf3e648", "title": "Near Real-Time Monitoring of Clinical Events Detected in Swine Herds in Northeastern Spain"}, {"paperId": "58c768c7e83030e7b1de5ab7187b87c1335e70db", "title": "An animal health example of managing and analyzing a large volume of data on a PC: Modeling body weight and age of over 13 million cats for explanatory and predictive purposes."}, {"paperId": "96b37c1180d58ec71efc0b03c8c2c20b1621ef01", "title": "Unweaving tangled mortality and antibiotic consumption data to detect disease outbreaks – Peaks, growths, and foresight in swine production"}, {"paperId": "b6aa1968db168c9f91490bb8fb3f85e4120f5137", "title": "A Transdisciplinary Approach Supporting the Implementation of a Big Data Project in Livestock Production: An Example From the Swiss Pig Production Industry"}, {"paperId": "9ee7d7aaf0956b3faa21a3bd6984cc16da578bc5", "title": "A scoping review of ‘big data’, ‘informatics’, and ‘bioinformatics’ in the animal health and veterinary medical literature"}, {"paperId": "28d4cf43021c1b8ac7f482b8fbb903b19a71cc9a", "title": "Drivers for the development of an Animal Health Surveillance Ontology (AHSO)."}, {"paperId": "c75ad80388a9b711d5f59fd73635319c157a7c6a", "title": "Leveraging Available Resources and Stakeholder Involvement for Improved Productivity of African Livestock in the Era of Genomic Breeding"}, {"paperId": "0b99bedfa3d27ce02d860b2bb7dff9ab748b0fef", "title": "The Politics of Digital Agricultural Technologies: A Preliminary Review"}, {"paperId": "47654cf27ea49e075f800ff503bbeecb4168e224", "title": "Identifying outbreaks of Porcine Epidemic Diarrhea virus through animal movements and spatial neighborhoods"}, {"paperId": "6c4d02f9e284824c8acafda058ac2228582426c5", "title": "Global trends in infectious diseases of swine"}, {"paperId": "26a77755f833e08039b6acd49e6ed81357af05d4", "title": "Veterinary Informatics: State-of-the-Art and the Role of Librarians"}, {"paperId": "ad95fdaa51e6ed3db4fd94e1093c9e997ea6ba9f", "title": "A Smartphone-Based Application Improves the Accuracy, Completeness, and Timeliness of Cattle Disease Reporting and Surveillance in Ethiopia"}, {"paperId": "fbef9f6bcf1190b3cfe4c0f907024efdd47479bb", "title": "Evaluation of “Eddie Mobile Application’’ as a Tool of Diagnosis and Surviellance of Trypanosomosis and Babesiosis of Cattle at Nekemte, Bako and Shambu Veterinary Clinics, Western Oromia, Ethiopia"}, {"paperId": "66bc1e91606e0faa5ca55542aaa16d7eaa4f9a32", "title": "Unweaving tangled mortality and antibiotic consumption data to detect disease outbreaks #_#x2013; Peaks, growths, and foresight in swine production"}, {"paperId": "3733f2d7df3402f75ee32ef84e18419dd1796101", "title": "Identification of risk factors for production diseases in commercial pig farms through secondary data analyses"}, {"paperId": "be8bf5722fe774f77a91e4cf6ff06ae94309d73e", "title": "a smartphone-Based application improves the accuracy, completeness, and Timeliness of cattle Disease reporting and surveillance in ethiopia"}, {"paperId": "c81575e059a826f39b47367fceaac67a8f55fb07", "title": "Agriculture Big Data ( AgBD ) Challenges and Opportunities From Farm To Table : A Midwest Big Data Hub Community † Whitepaper"}, {"paperId": null, "title": "Dórea, Fernanda C. and Vial, Flavie and Hammar, Karl and Lindberg, Ann and Lambrix, Patrick and Blomqvist, Eva and Revie, Crawford W. (2019) Drivers for the development of an Animal Health Surveillance Ontology"}]}
