{"paperId": "609902d394da0e57fe4def7b4911d2819df1266b", "publicationVenue": {"id": "7ddefda0-174f-499a-9dce-855879dd01b7", "name": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "type": "conference", "alternate_names": ["IPDPSW", "IEEE Int Symp Parallel  Distrib Process Work Phd Forum"]}, "title": "It Can Understand the Logs, Literally", "abstract": "Workflow reconstruction through logs is crucial for troubleshooting targeted distributed systems. It is also challenging to extract enough information from logs and keep a concise view, which makes manual log analysis hard to practice. However, currently popular tools rely on identifier-based log parsing, leaving a large amount of workflow information unexploited. In this paper, we propose a log extraction approach NLog, which utilizes a natural language processing based approach to obtain the key information from log messages and identify the same object in logs generated by different statements without any domain knowledge. We propose to use keyed message, a new log storage structure to store the parsed logs. We implement NLog and apply it to distributed data analytics frameworks Spark and MapReduce. Evaluation results show that NLog can accurately identify the objects in log messages even without explicit identifiers. By using keyed messages, users can have a concise as well as flexible view of the workflows.", "venue": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "2019 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)", "pages": "446-451"}, "authors": [{"authorId": "40377061", "name": "Aidi Pi"}, {"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "2062892220", "name": "W. Zeller"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}], "citations": [{"paperId": "c6e58a911c5395d42d6da674cd4e478748fc48a1", "title": "Logging Practices in Software Engineering: A Systematic Mapping Study"}, {"paperId": "3f4fd58d5478b3ffbe47e37c9796d7ac7318329c", "title": "Visual Business Analytics: Using the Example of a Call Center"}, {"paperId": "94c25a510e325bc3d9c54bded9deeb9242e423a0", "title": "Troubleshooting distributed data analytics systems"}, {"paperId": "127836fa57a52e649ebdef37a50fe0e36782d6e4", "title": "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems"}]}
