{"paperId": "609c17ff16700d59cfe9a2c53af0a9821b443d71", "publicationVenue": {"id": "2b17ce45-3b55-4be1-a978-fddecf5311de", "name": "Automation, Control, and Information Technology", "type": "conference", "alternate_names": ["International Conference on Applied Computing and Information Technology", "International Conference \"Advanced Computer Information Technologies\"", "ACIT", "Int Conf \"advanced Comput Inf Technol", "Int Conf Appl Comput Inf Technol", "Arab Conference on Information Technology", "Autom Control Inf Technol", "Arab Conf Inf Technol"]}, "title": "Internet of Vehicles (IoV): A Survey of Challenges and Solutions", "abstract": "The technological revolution of the Internet of Things (IoT) increased the number of objects (e.g., vehicles) connected to the Internet, making our lives easier, safer, and smarter. Putting IoT objects on the wheel has created a new technology called the Internet of Vehicle (IoV). The massive progress in communication and computing concepts brought the IoV to real implementation. The IoV is the advanced version of Vehicular Ad hoc Network (VANET), mainly designed to provide safe driving. Although the number of vehicles connected to the IoV keeps growing, there are various challenges and opportunities of the IoV technology that are still not clear. In this paper, several research papers related to the IoV were examined to identify and categorize the existing challenges of implementing and employing IoV in urban cities. Furthermore, this work outlines the IoV technical limitations that must be addressed. Moreover, various existing and future solutions that tackle the identified challenges were briefly discussed.", "venue": "Automation, Control, and Information Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-11-28", "journal": {"name": "2020 21st International Arab Conference on Information Technology (ACIT)", "pages": "1-10"}, "authors": [{"authorId": "1825783138", "name": "Jawaher Abdulwahab Fadhil"}, {"authorId": "9076102", "name": "Q. Sarhan"}], "citations": [{"paperId": "d717c7dcd995b19fb310e43abbf2b22330a080b8", "title": "Ensemble Learning-based Algorithms for Traffic Flow Prediction in Smart Traffic Systems"}, {"paperId": "45b29264a390fd4d5c40ac9be607a5ad10b52fc2", "title": "A Cyber Physical Security for Electrical Vehicles using Deep learning"}, {"paperId": "bdffac44a6dd36172445b30786c29bbbf3a4038a", "title": "Security and Trust Management in the Internet of Vehicles (IoV): Challenges and Machine Learning Solutions"}, {"paperId": "9ddc1408b32d4b57a3f5dbde2818be7c7aa486eb", "title": "BC-MTD: Blockchain-driven Moving Target Defense for Secure Vehicle Access"}, {"paperId": "4ba64e149ddaee027e951ac4dc2a906acf36ac00", "title": "IoT-Based Smart Energy Management in Hybrid Electric Vehicle Using Driving Pattern"}, {"paperId": "789f5d39f2c0afe452f7afb5630a002b152464e5", "title": "A Review on Secure Authentication Protocols in IOV: Algorithms, Protocols, and Comparisons"}, {"paperId": "166599409408e5ed19145112755eb7824d000ffb", "title": "MEC in IoV: A Review of Resource Issues and Solution Methods *"}, {"paperId": "83a0159fa971fa591a394880e949aae96ffd3ca4", "title": "Optimal Coverage Path Planning in a Wireless Sensor Network for Intelligent Transportation System"}, {"paperId": "f1c328941e48c81ca092d8ab90f1dc9c851fa874", "title": "Green Internet of Vehicles (GIoV): Applications, Awareness, Technologies and Challenges"}, {"paperId": "5d466bc1aa453683122c155887bad8f7cd829654", "title": "Reasoning About Expected Job Completion Time in Dynamic Vehicular Clouds"}, {"paperId": "c08efea40ae3a1868c14b05a471eb98f91b71f0f", "title": "Mobility-aware fog computing in dynamic networks with mobile nodes: A survey"}, {"paperId": "8d09eed59f4a580b70439269201417706eaab43c", "title": "Anonymity Assurance Using Efficient Pseudonym Consumption in Internet of Vehicles"}, {"paperId": "22f1fc5f90c407c74a72fbaf055aaf5400b8ce41", "title": "Emergency Vehicle Identification for Internet of Vehicles Based on Federated Learning and Homomorphic Encryption"}, {"paperId": "024ca4501c0b7f6d911bbc810eec63e2866e6589", "title": "An energy-efficient resource allocation strategy in massive MIMO-enabled vehicular edge computing networks"}, {"paperId": "3983aa51382268a33210582e8a52365dc45bb01a", "title": "Emergency Message Dissemination through MQTT over the Internet of Vehicles - A layered Approach"}, {"paperId": "043ca6ecf2f967909b3956507d67b7f9296dec9a", "title": "Connectivity Effectiveness of Autonomous and Connected Vehicles"}, {"paperId": "e1aa4527bd313f96624e322993fd99fb13848cc5", "title": "Roadside Unit-based Unknown Object Detection in Adverse Weather Conditions for Smart Internet of Vehicles"}, {"paperId": "ce563da0c2277a7af9965d2c446c0262d8d804de", "title": "Data‐centric approaches in the Internet of Vehicles: A systematic review on techniques, open issues, and future directions"}, {"paperId": "d7b476901381c2a5af98115573283069cf1e67eb", "title": "An Intelligent Approach for Cloud-Fog-Edge Computing SDN-VANETs Based on Fuzzy Logic: Effect of Different Parameters on Coordination and Management of Resources"}, {"paperId": "27c6beef8f0ab9fbfd2d444a3249ec30ec0dff48", "title": "DDoS Attacks Detection in IoV using ML-based Models with an Enhanced Feature Selection Technique"}, {"paperId": "af9f4d4629302c6579352b3530d3b2711aaf14b7", "title": "IAES International Journal of Artificial Intelligence (IJ-AI)"}]}
