{"paperId": "60a2c5e02a77ff1d9e86d078e984476955acfc6a", "publicationVenue": {"id": "2d136b11-c2b5-484b-b008-7f4a852fd61e", "name": "International Conference on Artificial Intelligence and Statistics", "type": "conference", "alternate_names": ["AISTATS", "Int Conf Artif Intell Stat"]}, "title": "Sketch-and-Lift: Scalable Subsampled Semidefinite Program for K-means Clustering", "abstract": "Semidefinite programming (SDP) is a powerful tool for tackling a wide range of computationally hard problems such as clustering. Despite the high accuracy, semidefinite programs are often too slow in practice with poor scalability on large (or even moderate) datasets. In this paper, we introduce a linear time complexity algorithm for approximating an SDP relaxed $K$-means clustering. The proposed sketch-and-lift (SL) approach solves an SDP on a subsampled dataset and then propagates the solution to all data points by a nearest-centroid rounding procedure. It is shown that the SL approach enjoys a similar exact recovery threshold as the $K$-means SDP on the full dataset, which is known to be information-theoretically tight under the Gaussian mixture model. The SL method can be made adaptive with enhanced theoretic properties when the cluster sizes are unbalanced. Our simulation experiments demonstrate that the statistical accuracy of the proposed method outperforms state-of-the-art fast clustering algorithms without sacrificing too much computational efficiency, and is comparable to the original $K$-means SDP with substantially reduced runtime.", "venue": "International Conference on Artificial Intelligence and Statistics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-20", "journal": {"pages": "9214-9246"}, "authors": [{"authorId": "2152482295", "name": "Yubo Zhuang"}, {"authorId": "2144202017", "name": "Xiaohui Chen"}, {"authorId": "2116588224", "name": "Yun Yang"}], "citations": [{"paperId": "ca1fb62057ee1b9815411baf36792001ec033d47", "title": "Sketch-and-solve approaches to k-means clustering by semidefinite programming"}, {"paperId": "ede6322c2c0e7c89db1c673f673334ae283b1c85", "title": "Likelihood adjusted semidefinite programs for clustering heterogeneous data"}, {"paperId": "04fedd0154d379edc2fede468fbe2ea4f9886c3b", "title": "Wasserstein K-means for clustering probability distributions"}]}
