{"paperId": "60b81358de33df2d6566ebe1bad6cc539783adb8", "publicationVenue": {"id": "6147a926-34f2-41dc-999d-916d542ad69d", "name": "Chaos Theory and Applications", "type": "journal", "alternate_names": ["Chaos Theory Appl"], "issn": "2687-4539"}, "title": "CNN-Based Approach for Overlapping Erythrocyte Counting and Cell Type Classification in Peripheral Blood Images", "abstract": "Automatic analysis of cell numbers and types from blood smear images is essential for diagnosing and treating many diseases. Peripheral smear has been used for many years and is a gold standard method. However, the overlap in cells during the peripheral smear process may cause incorrectly predicted results in counting blood cells and classifying cell types. This problem can occur both in automated systems and in manual inspections by experts. Convolutional neural networks provide reliable results for segmentation and classification problems in the medical field. However, creating ground truth labels in the data during the segmentation process is a time-consuming and error-prone process. This study proposes a new CNN-based strategy to eliminate the overlap-induced counting problem in peripheral smear blood samples and to determine the blood cell type with high accuracy. In the proposed method, images of the entire slide were divided into sub-images, block by block, using adaptive image processing techniques to identify the overlapping cells and cell types. CNN was used to classify the number of cells separated from the original images into sub-images by blocks. The proposed method both counts overlapping red blood cells and distinguishes RBC-WBC with an accuracy rate of 99.73%. The results show that the proposed method can be adapted to areas where high-resolution images are found and reliable results.", "venue": "Chaos Theory and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-28", "journal": {"name": "Chaos Theory and Applications"}, "authors": [{"authorId": "2066971190", "name": "Muhammed Ali Pala"}, {"authorId": "2069565919", "name": "Murat Erhan Çimen"}, {"authorId": "144367702", "name": "M. Yıldız"}, {"authorId": "2474282", "name": "Gökçen Çetinel"}, {"authorId": "116003883", "name": "Emir Avcioglu"}, {"authorId": "2174218943", "name": "Yusuf Alaca"}], "citations": [{"paperId": "6de4bb498342feb95c343e48c3919b3341899ddc", "title": "Self Adaptive Methods for Learning Rate Parameter of Q-Learning Algorithm"}, {"paperId": "988df9050bd5d15a0cddfd759cf6c977e6d056a2", "title": "Digital assessment of peripheral blood and bone marrow aspirate smears"}, {"paperId": "ee423df1605cd76e08fc3b68b8a89851eb27fdc4", "title": "Ghost-ResNeXt: An Effective Deep Learning Based on Mature and Immature WBC Classification"}]}
