{"paperId": "60ba359fccf0cbe952931fb8cb132035f0313198", "publicationVenue": null, "title": "Selection Pushdown in Column Stores using Bit Manipulation Instructions", "abstract": "Modern analytical database systems predominantly rely on column-oriented storage, which offers superior compression efficiency due to the nature of the columnar layout. This compression, however, creates challenges in decoding speed during query processing. Previous research has explored predicate pushdown on encoded values to avoid decoding, but these techniques are restricted to specific encoding schemes and predicates, limiting their practical use. In this paper, we propose a generic predicate pushdown approach that supports arbitrary predicates by leveraging selection pushdown to reduce decoding costs. At the core of our approach is a fast select operator capable of directly extracting selected encoded values without decoding, by using Bit Manipulation Instructions, an instruction set extension to the X86 architecture. We empirically evaluate the proposed techniques in the context of Apache Parquet using both micro-benchmarks and the TPC-H benchmark, and show that our techniques improve the query performance of Parquet by up to one order of magnitude with representative scan queries. Further experimentation using Apache Spark demonstrates speed improvements of up to 5.5X even for end-to-end queries involving complex joins.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-13", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 26", "volume": "1"}, "authors": [{"authorId": "2144424734", "name": "Yinan Li"}, {"authorId": "2152962952", "name": "Jianan Lu"}, {"authorId": "2241445", "name": "Badrish Chandramouli"}], "citations": [{"paperId": "6092ae0919e1e5a8b302bd2ea27a9bad5f4c7857", "title": "SFVInt: Simple, Fast and Generic Variable-Length Integer Decoding using Bit Manipulation Instructions"}, {"paperId": "70d71af0705a484928fd9b8189ca331b57c8d188", "title": "Enhancing Data Lakes with GraphAr: Efficient Graph Data Management with a Specialized Storage Scheme"}, {"paperId": "29b7849eca377f115e67b80e8fa2840f26e0e842", "title": "An Empirical Evaluation of Columnar Storage Formats"}]}
