{"paperId": "60c00529b1ddfaf8af8ca900eb87f06d1d3ca995", "publicationVenue": null, "title": "Resource-Aware Federated Hybrid Proﬁling for Edge Node Selection in Federated Patient Similarity Network", "abstract": ": The widespread adoption of edge computing for resource-constrained devices presents challenges in computational straggler issues, primarily due to the heterogeneity of edge node resources. This research addresses these issues by introducing a novel resource-aware federated hybrid proﬁling approach. This approach involves classifying edge node resources with relevant performance metrics and leveraging their capabilities to optimize performance and improve Quality of Service (QoS), particularly in real-time eHealth applications. Such paradigms include Federated Patient Similarity Network (FPSN) models that distribute processing at each edge node and fuse the built PSN matrices in the cloud, presenting a unique challenge in terms of optimizing training and inference times, while ensuring efﬁcient and timely updates at the edge nodes. To address this concern, we propose a resource-aware federated hybrid proﬁling approach that measures the available static and dynamic resources of the edge nodes. By selecting nodes with the appropriate resources, we aim to optimize the FPSN to ensure the highest possible Quality of Service (QoS) for its users. We conducted experiments using edge performance metrics, i.e., accuracy, training convergence, memory and disk usage, execution time, and network statistics. These experiments uniquely demonstrate our work’s contribution to optimizing resource allocation and enhancing the performance of eHealth applications in real-time contexts using edge computing.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "9627285", "name": "Alramzana Nujum Navaz"}, {"authorId": "3408406", "name": "Hadeel T. El Kassabi"}, {"authorId": "2394689", "name": "M. Serhani"}, {"authorId": "2559225", "name": "E. Barka"}], "citations": []}
