{"paperId": "60c1278fa4ded96ae14773966fd8c2cd3447244d", "publicationVenue": null, "title": "Enabling Model-Driven Live Analytics For Cyber-Physical Systems: The Case of Smart Grids", "abstract": "Advances in software, embedded computing, sensors, and networking technologies will lead to a new generation of smart cyber-physical systems that will far exceed the capabilities of today’s embedded systems. They will be entrusted with increasingly complex tasks like controlling electric grids or autonomously driving cars. These systems have the potential to lay the foundations for tomorrow’s critical infrastructures, to form the basis of emerging and future smart services, and to improve the quality of our everyday lives in many areas. In order to solve their tasks, they have to continuously monitor and collect data from physical processes, analyse this data, and make decisions based on it. Making smart decisions requires a deep understanding of the environment, internal state, and the impacts of actions. Such deep understanding relies on efficient data models to organise the sensed data and on advanced analytics. Considering that cyber-physical systems are controlling physical processes, decisions need to be taken very fast. This makes it necessary to analyse data in live, as opposed to conventional batch analytics. However, the complex nature combined with the massive amount of data generated by such systems impose fundamental challenges. While data in the context of cyber-physical systems has some similar characteristics as big data, it holds a particular complexity. This complexity results from the complicated physical phenomena described by this data, which makes it difficult to extract a model able to explain such data and its various multi-layered relationships. Existing solutions fail to provide sustainable mechanisms to analyse such data in live. This dissertation presents a novel approach, named model-driven live analytics. The main contribution of this thesis is a multi-dimensional graph data model that brings raw data, domain knowledge, and machine learning together in a single model, which can drive live analytic processes. This model is continuously updated with the sensed data and can be leveraged by live analytic processes to support decision-making of cyber-physical systems. The presented approach has been developed in collaboration with an industrial partner and, in form of a prototype, applied to the domain of smart grids. The addressed challenges are derived from this collaboration as a response to shortcomings in the current state of the art. More specifically, this dissertation provides solutions for the following challenges: First, data handled by cyber-physical systems is usually dynamic—data in motion as opposed to traditional data at rest—and changes frequently and at different paces. Analysing such data is challenging since data models usually can only represent a snapshot of a system at one specific point in time. A common approach consists in a discretisation, which regularly samples and stores such snapshots at specific timestamps to keep track of the history. Continuously changing data is then represented as a finite sequence of such snapshots. Such data representations would be very inefficient to analyse, since it would require to mine the snapshots, extract a relevant dataset, and finally analyse it. For this problem, this thesis presents a temporal graph data model and storage system, which consider time as a first-class property. A time-relative navigation concept enables to analyse frequently changing data very efficiently.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-11-08", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "50068055", "name": "Thomas Hartmann"}], "citations": [{"paperId": "7fb9f0cbee932784e0a9f838549ab37a374a1ba0", "title": "A Data-Driven Scalable Method for Profiling and Dynamic Analysis of Shared Mobility Solutions"}, {"paperId": "4b120dfd43649a8f24742678cd6f313792ac6a04", "title": "Runtime modeling and analysis of IoT systems"}, {"paperId": "8a3a1f0fb37769e058549fd3a6a03f068bae459f", "title": "Towards a modelling Framework with Temporal and uncertain Data for adaptive Systems. (Vers un framework de modélisation avec des données temporelles et incertaines pour les systèmes adaptatifs)"}, {"paperId": "a75bddfca4ad23b84468c46c245745352b17c5e3", "title": "Enabling temporal-aware contexts for adaptative distributed systems"}, {"paperId": "5f776ad8bd4979dc81bfa57f0327b54d23311c68", "title": "GreyCat: Efficient What-If Analytics for Data in Motion at Scale"}, {"paperId": "5fdc8c4d8a5bef3320e185c59bbb80e8e15805c8", "title": "A new modelling framework over temporal graphs for collaborative mobility recommendation systems"}, {"paperId": "52c99d275a12e563ba4e193c39b4fb97ba46526d", "title": "Raising Time Awareness in Model-Driven Engineering: Vision Paper"}, {"paperId": "406246cb8a96bad5c4330f60d622a318bf68a4e8", "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)"}]}
