{"paperId": "60cb139adb50c2f15bca4d724a52dd8c170fb331", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Microblog topic detection using evolutionary clustering and social network information", "abstract": "The messages in microblogs, like Twitter, present a wealth of information around the hot topics and public opinions. Topic detection and tracking enables a better understanding of the incoming information from social networks. Many of the studies performed in this field consider a set of predefined number of topics (clusters) which remain constant during the detection process. Such approaches are not efficient when data is dynamic and cumulative. In addition, nonparametric evolutionary topic models do not have an accurate performance on short texts due to the data deficiency. In this article, we propose an evolutionary clustering model based on the Bayesian nonparametric Dirichlet process mixture model, which automatically determines the number of clusters. To improve the algorithm performance when dealing with short social media texts, temporal information of tweets and other social network parameters are used in a weighted combination to augment the text similarity in detecting topics. Model evaluation is performed on the data gathered from the Twitter during a 2.5‐month period. Results reveal that the social network information can promote the topic detection performance. The proposed model outperforms previous study in terms of topic coherence and clustering performance, leading to a better clustering on short texts.", "venue": "Concurrency and Computation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-28", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "35"}, "authors": [{"authorId": "145567474", "name": "H. Mashayekhi"}, {"authorId": "2222042209", "name": "Elham Sadat Alavi"}, {"authorId": "2080505533", "name": "Behzad Rezaie"}], "citations": []}
