{"paperId": "60da5d40cd582ba5b33be31312c66326de78165d", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "Towards Fast and Energy-Efficient Offloading for Vehicular Edge Computing", "abstract": "Vehicular edge computing (VEC) has emerged in the Internet of Vehicles (IoV) as a new paradigm that offloads computation tasks to Road Side Units (RSU) aiming to reduce the processing delay as well as the resource consumption of vehicles. Ideal computation offloading policies for VEC are expected to achieve both low latency and low energy consumption. Although existing works have made great contributions, they rarely consider the coordination of multiple RSUs and the individual Quality of Service (QoS) requirements of different applications resulting in suboptimal offloading policies. In this paper, we present FEVEC, a Fast and Energy-efficient VEC framework with the objective of making the optimal offloading strategy that minimizes both delay and energy consumption. FEVEC coordinates multiple RSUs and considers the application-specific QoS requirement. We formalize the computation offloading problem as a multi-objective optimization problem by jointly optimizing offloading decision and resource allocation, which is a mixed-integer nonlinear programming (MINLP) problem and NP-hard. We propose MOV, a Multi-Objective computing offloading method for VEC, where an improved Non-dominated Sorting Genetic Algorithm-II (NSGA-II) is adopted to obtain the Pareto-optimal solutions with low complexity. Furthermore, the optimal offloading strategy is selected for QoS maximization. Extensive evaluation results based on realistic and simulated vehicle trajectories verify that our proposed algorithm has a better performance compared with the state-of-the-art VEC mechanism.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-01-01", "journal": {"name": "2022 IEEE 28th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "649-656"}, "authors": [{"authorId": "2193666705", "name": "Meijia Su"}, {"authorId": "2615440", "name": "Chenhong Cao"}, {"authorId": "2193705712", "name": "Miaoling Dai"}, {"authorId": "2118506461", "name": "Jiangtao Li"}, {"authorId": "2154875364", "name": "Yufeng Li"}], "citations": [{"paperId": "50e49dbbeb4efa6e4170b82a56b14b93707f08c4", "title": "A multi-objectives framework for secure blockchain in fog–cloud network of vehicle-to-infrastructure applications"}, {"paperId": "942fb0df711f4b1a2f6f6b89c4e19653bd96512b", "title": "Task Classification for Optimal Offloading and Resource Allocation in Vehicular Edge Computing"}, {"paperId": "a7c4692ce76f8f38d97392c837f8f35443040cfe", "title": "QoS-Aware Joint Task Scheduling and Resource Allocation in Vehicular Edge Computing"}]}
