{"paperId": "60e5de99b774fbda6822122dcd87dabb6fe0e216", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "ADAL-NN: Anomaly Detection and Localization Using Deep Relational Learning in Distributed Systems", "abstract": "Modern distributed systems that operate concurrently generate interleaved logs. Identifiers (ID) are always associated with active instances or entities in order to track them in logs. Consequently, log messages with similar IDs can be categorized to aid in the localization and detection of anomalies. Current methods for achieving this are insufficient for overcoming the following obstacles: (1) Log processing is performed in a separate component apart from log mining. (2) In modern software systems, log format evolution is ongoing. It is hard to detect latent technical issues using simple monitoring techniques in a non-intrusive manner. Within the scope of this paper, we present a reliable and consistent method for the detection and localization of anomalies in interleaved unstructured logs in order to address the aforementioned drawbacks. This research examines Log Sequential Anomalies (LSA) for potential performance issues. In this study, IDs are used to group log messages, and ID relation graphs are constructed between distributed components. In addition to that, we offer a data-driven online log parser that does not require any parameters. By utilizing a novel log parser, the bundled log messages undergo a transformation process involving both semantic and temporal embedding. In order to identify instance–granularity anomalies, this study makes use of a heuristic searching technique and an attention-based Bi-LSTM model. The effectiveness, efficiency, and robustness of the paper are supported by the research that was performed on real-world datasets as well as on synthetic datasets. The neural network improves the F1 score by five percent, which is greater than other cutting-edge models.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-19", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2044347692", "name": "Kashan Ahmed"}, {"authorId": "2580281", "name": "A. Altaf"}, {"authorId": "3186993", "name": "Nor Shahida Mohd Jamail"}, {"authorId": "1491127485", "name": "Faiza Iqbal"}, {"authorId": "2692781", "name": "R. Latif"}], "citations": [{"paperId": "09d3d87d062f0b85f4a72acd928dc539b4e16c22", "title": "Logical–Mathematical Foundations of a Graph Query Framework for Relational Learning"}, {"paperId": "a0ca0cf51ba5b12cb507e752f993a8fcca690451", "title": "Detecting Pragmatic Ambiguity in Requirement Specification Using Novel Concept Maximum Matching Approach Based on Graph Network"}, {"paperId": "e642242f039104e77a903e629bad64931e36ec11", "title": "A Resource Aware Memory Requirement Calculation Model for Memory Constrained Context-Aware Systems"}]}
