{"paperId": "60e698fd62c3de20e0446e460677eafc5e718540", "publicationVenue": null, "title": "How information and communication technology affects decision-making on innovation diffusion: An agent-based modelling approach", "abstract": "We introduce a computational agent‐based model of innovation diffusion that allows us to analyse the influence of information and communication technology (ICT) development on decision‐making. Model dynamics are based on local emulation between pairs of individuals that generate an evolving social network on which an innovation is virally spread (by word of mouth). Results suggest that ICT development affects the data usefulness for decision‐making by changing the topology of the social network (the means whereby the innovation is propagated). Paradoxically, a higher level of ICT development (providing a larger volume of data) narrows the differences between better and worse launch strategies, thus reducing data‐driven decision‐making usefulness, which then shows diminishing returns on the ICT level.", "venue": "Intell. Syst. Account. Finance Manag.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-26", "journal": {"name": "Intell. Syst. Account. Finance Manag.", "pages": "124-133", "volume": "25"}, "authors": [{"authorId": "1407533555", "name": "Carlos M. Fernández-Márquez"}, {"authorId": "50208027", "name": "Francisco J. Vázquez"}], "citations": [{"paperId": "cac78783067fc6966caa2eddd20b3c2bb777d745", "title": "Modeling Drivers and Barriers of Artificial Intelligence Adoption: Insights from a Strategic Management Perspective"}, {"paperId": "8223c116b101deb4b788eed3429ee911c2472daf", "title": "An Agent-based Decision Support for a Vaccination Campaign"}, {"paperId": "123751a22c7e1026c6a93b1f4bed703f1bdf93ad", "title": "The more cooperation, the better? Optimizing enterprise cooperative strategy in collaborative innovation networks"}, {"paperId": "9addea577f54cb339a890b618f36062c9870cf60", "title": "Application of interpretable machine learning models for the intelligent decision"}, {"paperId": "0627a4b2bacefc335bf1c16e521597d5037158ea", "title": "Alleviating Financing Constraints of SMEs through Supply Chain"}, {"paperId": "83ea995fb055ace1676d62fd0e19eb04bc64b312", "title": "The construction and simulation of internet financial product diffusion model based on complex network and consumer decision-making mechanism"}, {"paperId": "8b97f04964f7451be766f30f4e58751144847889", "title": "How ICT usage affect frugal innovation in Mexican small firms. The mediating role of entrepreneurial orientation"}, {"paperId": "dede5d6d58b96040f89d1f76aa2248843b88ec30", "title": "The adoption of ICT as an enabler of frugal innovation to achieve customer satisfaction. The mediating effect of frugal innovation"}, {"paperId": "edd7d0242ce66d43cd00cf6e1196c914e4611e20", "title": "Modeling the factors determining a virtual team’s decision-making"}]}
