{"paperId": "60eaa169999bc304c33a63438ff342a45379a5e1", "publicationVenue": {"id": "bb323e66-2219-4333-924e-ca9aea497247", "name": "International Conference on Bioinformatics Research and Applications", "type": "conference", "alternate_names": ["ICBRA", "Int Conf Bioinform Res Appl"], "url": "https://dl.acm.org/conference/icbra"}, "title": "Data and task orchestration defined by spatio-temporal variables for healthcare data science services", "abstract": "Data science services have become a solution for healthcare organizations to take advantage of the large volumes of data (e.g., data lakes and data warehouses) produced during the interaction of healthcare staff with patients and government agencies. However, the data orchestration for these services is not trivial when dealing with multiple data sources where decision-making processes should combine them to create a single solid information piece (big picture) for making inferences or predictions. In this paper, we present a data and task orchestration method for supporting healthcare data science services. This method considers stages such as data fusion/integration for enabling the crossing of information, computing splits for producing, on-the-fly and on-demand, data subsets by using spatio-temporal variables, converting splited data into information, consolidation of information into segments to create a big picture of data and, in the last stage, makes available data segments for consumption on decision-making processes by using spatio-temporal queries. A case study based on the fusion of healthcare data sources about psychiatric, drug consumption, and macro-economics was conducted by using a prototype of the data orchestration proposed in this paper. The evaluation revealed the flexibility of this data orchestration approach to convert multiple data sources into useful information for healthcare decision-making processes.", "venue": "International Conference on Bioinformatics Research and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-09-18", "journal": {"name": "Proceedings of the 9th International Conference on Bioinformatics Research and Applications"}, "authors": [{"authorId": "2203052756", "name": "Jose Carlos Morin Garcia"}, {"authorId": "2202945317", "name": "Juan Armando Barron Lugo"}, {"authorId": "2086201000", "name": "Jose Luis Gonzalez Compean"}, {"authorId": "2085550132", "name": "Ivan Lopez Arevalo"}, {"authorId": "144923986", "name": "J. Carretero"}, {"authorId": "2202945258", "name": "Martha Cordero Oropeza"}], "citations": []}
