{"paperId": "60fc5e7ce1919d5261f0222f2a2c6ffc746a2619", "publicationVenue": {"id": "f9af8000-42f8-410d-a622-e8811e41660a", "name": "Conference on Uncertainty in Artificial Intelligence", "type": "conference", "alternate_names": ["Uncertainty in Artificial Intelligence", "UAI", "Conf Uncertain Artif Intell", "Uncertain Artif Intell"], "url": "http://www.auai.org/"}, "title": "Inference for mark-censored temporal point processes", "abstract": "Marked temporal point processes (MTPPs) are a general class of stochastic models for modeling the evolution of events of different types (“marks”) in continuous time. These models have broad applications in areas such as medical data monitoring, ﬁnancial prediction, user modeling, and communication networks. Of signiﬁcant practical interest in such problems is the issue of missing or censored data over time. In this paper, we focus on the speciﬁc problem of inference for a trained MTPP model when events of certain types are not observed over a period of time during prediction. We introduce the concept of mark-censored sub-processes and use this framework to develop a novel marginalization technique for inference in the presence of censored marks. The approach is model-agnostic and applicable to any MTPP model with a well-deﬁned intensity function. We illustrate the ﬂexibility and utility of the method in the context of both parametric and neural MTPP models, with results across a range of datasets including data from simulated Hawkes processes, self-correcting processes, and multiple real-world event datasets.", "venue": "Conference on Uncertainty in Artificial Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "226-236"}, "authors": [{"authorId": "2074330244", "name": "Alex Boyd"}, {"authorId": "2218731260", "name": "Yu-Hsin Chang"}, {"authorId": "1783468", "name": "S. Mandt"}, {"authorId": "1630595717", "name": "P. Smyth"}], "citations": []}
