{"paperId": "6106c4c13d6d935e22a30b0c2f00882007966648", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "An Exploratory Study of Vulnerabilities in Big Data Systems", "abstract": "The use of big data systems has become prevalent across sensitive domains, including health, defense and finance, among others. These big data systems are often complex and with complexity often comes vulnerabilities. Most big data systems also have Application Programming Interfaces (API) where these vulnerabilities can be present. This results in introducing security risks into the projects using these big data tools. To address this issue, this paper presents and uses a research process that can be used to assess the state of big data security in open source projects. The study examines tool versioning in various open source projects to uncover the vulnerabilities present and then assess the significant factors of these vulnerabilities. Furthermore, we provide insights into the vulnerabilities of different big data system APIs and how each of the vulnerabilities can manifest in a project using the specific tool. This study serves as a guideline for big data system developers to develop highly secure data-intensive systems. CCS CONCEPTS • Security and privacy → Database and storage security; Software and application security;", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "1360-1367"}, "authors": [{"authorId": "2280674947", "name": "Nikolas Tyllis"}, {"authorId": "2280688777", "name": "Faheem Ullah"}, {"authorId": "2280680552", "name": "Muhammad Uzair"}], "citations": []}
