{"paperId": "6120fb3d2f5380a40f4dbf8619b05f12a842147d", "publicationVenue": {"id": "2baad992-2268-4c38-9120-e453622f2eeb", "name": "Journal of Medical Internet Research", "type": "journal", "alternate_names": ["J Med Internet Res"], "issn": "1438-8871", "url": "http://www.symposion.com/jmir/index.htm", "alternate_urls": ["http://www.jmir.org/", "https://www.jmir.org/"]}, "title": "Characterizing the Discussion of Antibiotics in the Twittersphere: What is the Bigger Picture?", "abstract": "Background User content posted through Twitter has been used for biosurveillance, to characterize public perception of health-related topics, and as a means of distributing information to the general public. Most of the existing work surrounding Twitter and health care has shown Twitter to be an effective medium for these problems but more could be done to provide finer and more efficient access to all pertinent data. Given the diversity of user-generated content, small samples or summary presentations of the data arguably omit a large part of the virtual discussion taking place in the Twittersphere. Still, managing, processing, and querying large amounts of Twitter data is not a trivial task. This work describes tools and techniques capable of handling larger sets of Twitter data and demonstrates their use with the issue of antibiotics. Objective This work has two principle objectives: (1) to provide an open-source means to efficiently explore all collected tweets and query health-related topics on Twitter, specifically, questions such as what users are saying and how messages are spread, and (2) to characterize the larger discourse taking place on Twitter with respect to antibiotics. Methods Open-source software suites Hadoop, Flume, and Hive were used to collect and query a large number of Twitter posts. To classify tweets by topic, a deep network classifier was trained using a limited number of manually classified tweets. The particular machine learning approach used also allowed the use of a large number of unclassified tweets to increase performance. Results Query-based analysis of the collected tweets revealed that a large number of users contributed to the online discussion and that a frequent topic mentioned was resistance. A number of prominent events related to antibiotics led to a number of spikes in activity but these were short in duration. The category-based classifier developed was able to correctly classify 70% of manually labeled tweets (using a 10-fold cross validation procedure and 9 classes). The classifier also performed well when evaluated on a per category basis. Conclusions Using existing tools such as Hive, Flume, Hadoop, and machine learning techniques, it is possible to construct tools and workflows to collect and query large amounts of Twitter data to characterize the larger discussion taking place on Twitter with respect to a particular health-related topic. Furthermore, using newer machine learning techniques and a limited number of manually labeled tweets, an entire body of collected tweets can be classified to indicate what topics are driving the virtual, online discussion. The resulting classifier can also be used to efficiently explore collected tweets by category and search for messages of interest or exemplary content.", "venue": "Journal of Medical Internet Research", "year": 2015, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-06-01", "journal": {"name": "Journal of Medical Internet Research", "volume": "17"}, "authors": [{"authorId": "2065929658", "name": "Rachel Lynn Kendra"}, {"authorId": "47395898", "name": "Suman Karki"}, {"authorId": "2065299179", "name": "Jesse Eickholt"}, {"authorId": "1698815", "name": "L. Gandy"}], "citations": [{"paperId": "082aebf3daccb8f29d67955e7b8d68933e13afd2", "title": "Machine Learning Implementations in Childhood Stunting Research: A Systematic Literature Review"}, {"paperId": "f9e6613ec06c2d0980df359f33e86f8e0463248e", "title": "E-Cigarette–Related Health Beliefs Expressed on Twitter Within the U.S."}, {"paperId": "ff7c0350271ca862a71548c62c292e0259b13fca", "title": "Attitudes towards vaccination and knowledge about antibiotics: Analysis of Wellcome Monitor survey data."}, {"paperId": "5ae81edc4c33afaf71c798e6888823e1194216fd", "title": "Mandatory Vaccination Against COVID-19: Twitter Poll Analysis on Public Health Opinion"}, {"paperId": "dab2add1d7af6b50a7acc97a4c9721156fd6175c", "title": "Mandatory vaccination against COVID-19 would be supported by less than fifty per cent: A Twitter poll analysis on public health opinion. (Preprint)"}, {"paperId": "573344e50f686b31f7e14d7e89d04899de26082f", "title": "Emotional effect of the Covid-19 pandemic on oral surgery procedures: a social media analysis"}, {"paperId": "726913882f54b4ed1ae5704039cebe02962e8f17", "title": "Antibiotics and toothache: a social media review."}, {"paperId": "40665432ba97616ad2adcb3f1ea9dc84ad896685", "title": "People’s Willingness to Vaccinate Against COVID-19 Despite Their Safety Concerns: Twitter Poll Analysis"}, {"paperId": "604a95d7eab0601ee0906c411202ca3ef72409a8", "title": "Sosyal medyada otomatik halk sağlığı takibi: Güncel bir derleme"}, {"paperId": "3cc6797cbffbbe48b06883a1387bf0c195448487", "title": "An Overview of Neural Network Architectures for Healthcare"}, {"paperId": "0e46ed7b9e58bcc5e4b860da71955fdb73c99e7c", "title": "Infodemiology and Infoveillance: Scoping Review"}, {"paperId": "5246bfa176a0fe9cbf3cc4659b630856eeb6f75b", "title": "Qualitative and quantitative evaluation of the use of Twitter as a tool of antimicrobial stewardship"}, {"paperId": "a7fa13addecd82b559dfb07d108b0c339dff4412", "title": "Using Convolutional Networks and Satellite Imagery to Predict Disease Density in a Developing Country"}, {"paperId": "30bee315d9e11bf4bbcc06914cc472033bc522f0", "title": "Exploring Big Data Analytic Approaches to Cancer Blog Text Analysis"}, {"paperId": "b00cbc2020278a2f644e3a4ea4aa9193ca1b161d", "title": "Web data mining for public health purposes"}, {"paperId": "6f6590873643833609a5b8b3036cfe5bd1e494ae", "title": "A Deep Learning Method to Analyze and Classify Happy Moments: A Comparative Analytic Study (Preprint)"}, {"paperId": "50fac773102b741c7566b8615f7c4f41d4994a8c", "title": "Differences in Emotional and Pain-Related Language in Tweets About Dentists and Medical Doctors: Text Analysis of Twitter Content"}, {"paperId": "53c4187550ff46f721bde91e59340cc87e021171", "title": "Dynamics of Health Agency Response and Public Engagement in Public Health Emergency: A Case Study of CDC Tweeting Patterns During the 2016 Zika Epidemic"}, {"paperId": "589243cda384a044859d68a3ed538f337d3cffd9", "title": "Online health information and public knowledge, attitudes, and behaviours regarding antibiotics in the UK: Multiple regression analysis of Wellcome Monitor and Eurobarometer Data"}, {"paperId": "5e1095ad634385127846887e10be2a781cff27b9", "title": "Public Perception Analysis of Tweets During the 2015 Measles Outbreak: Comparative Study Using Convolutional Neural Network Models"}, {"paperId": "2ae0d94f97f0e579a0e30068b92d203444a45c13", "title": "Predicting Antimicrobial Drug Consumption using Web Search Data"}, {"paperId": "03c8401350cef034950c1e905fefad0711e44961", "title": "Internet and social media use for antibiotic-related information seeking: Findings from a survey among adult population in Italy"}, {"paperId": "7b5266177c907df96f1f47f4986956dd213000de", "title": "Enhancing Seasonal Influenza Surveillance: Topic Analysis of Widely Used Medicinal Drugs Using Twitter Data"}, {"paperId": "cea0ae72a36247e5f467f9916650859708ef247f", "title": "The Adverse Drug Reactions from Patient Reports in Social Media Project: Five Major Challenges to Overcome to Operationalize Analysis and Efficiently Support Pharmacovigilance Process"}, {"paperId": "20de699c041ffc9e242cfdb03d4938ec5f849785", "title": "Capturing the Patient’s Perspective: a Review of Advances in Natural Language Processing of Health-Related Text"}, {"paperId": "fda153a4ccb25f370007874bb7139a8fa1d87422", "title": "Public Response to Obamacare on Twitter"}, {"paperId": "4d079ed59edeea2c81e5758c2a73e7c8d2e67926", "title": "Can Gaming Increase Antibiotic Awareness in Children? A Mixed-Methods Approach"}, {"paperId": "d99b86ab1190886b8f8549b3d77848687664346d", "title": "Development of an Educational Game to Set Up Surgical Instruments on the Mayo Stand or Back Table: Applied Research in Production Technology"}, {"paperId": "40debca7282900a91e551a68c43205054f4038f6", "title": "Analysis of the Formality of Text and its Impact on Pharmacovigilance Systems"}, {"paperId": "7f44414cae798796dfc33033b181c143e62c4866", "title": "The Measles Vaccination Narrative in Twitter: A Quantitative Analysis"}, {"paperId": "c4bcfb781a6ac8c6316115474558bfde1d345ca5", "title": "Agenda Setting for Health Promotion: Exploring an Adapted Model for the Social Media Era"}, {"paperId": "a95994aa5fbc9c6756ac492642ae31584f948692", "title": "Using Twitter Data to Gain Insights into E-cigarette Marketing and Locations of Use: An Infoveillance Study"}, {"paperId": "170d295e762cf23c6380d2c97cf8de10da7c3c74", "title": "Towards Detecting Fake Medical Content on the Web with Machine Learning"}, {"paperId": "0802dcc1ed7de2ea25f8d1901792da9395adbaa7", "title": "Deep Learning in IoT"}, {"paperId": "0cc04cb34d4f3a755daf2198626dc769ca90e38f", "title": "JMIR Serious Games A multidisciplinary journal on gaming and gamification for health education/promotion, teaching and social change"}, {"paperId": "1e706d79d07f4680504142f2eede721b348ab33d", "title": "The Role of Deep Learning in Improving Healthcare"}, {"paperId": "f1a13d4ca7eb8fd8ffbf748da5eeaf9c07c17f64", "title": "Dynamics of Health Agency Response and Public Engagement in Public Health Emergency : A Case Study of Centers for Disease Control and Prevention Tweeting Patterns During the 2016 Zika Epidemic"}, {"paperId": "f67faa8fc74c6bf960c5649b353027a64424b40f", "title": "(2018). Online health information and public knowledge, attitudes, and behaviours regarding antibiotics in the UK: Multiple regression analysis of Wellcome Monitor and Eurobarometer Data. PLoS ONE 13 (10),"}, {"paperId": "9d3e0fce253a4ae4a4456b2f24c03329a2b74621", "title": "Deep Learning for Health Informatics"}, {"paperId": "2d76ff49749adc58355cf03e7932e430125af0f0", "title": "Description Key Points Input Layer Hidden Layer 1 Hidden Layer"}]}
