{"paperId": "6125c216bc2b90e64041acc2a8855ee705998e72", "publicationVenue": {"id": "f2f171a1-dc77-4975-8b50-b85cc4db774d", "name": "Journal of Privacy and Confidentiality", "type": "journal", "alternate_names": ["J Priv Confidentiality"], "issn": "2575-8527", "url": "http://repository.cmu.edu/jpc/", "alternate_urls": ["https://journalprivacyconfidentiality.org/"]}, "title": "Overlook: Differentially Private Exploratory Visualization for Big Data", "abstract": "Data exploration systems that provide differential privacy must manage a privacy budget that measures the amount of privacy lost across multiple queries. One effective strategy to manage the privacy budget is to compute a one-time private synopsis of the data, to which users can make an unlimited number of queries. However, existing systems using synopses are built for offline use cases, where a set of queries is known ahead of time and the system carefully optimizes a synopsis for it. The synopses that these systems build are costly to compute and may also be costly to store. \nWe introduce Overlook, a system that enables private data exploration at interactive latencies for both data analysts and data curators. The key idea in Overlook is virtual synopsis that can be evaluated \\emph{incrementally}, without extra space storage or expensive precomputation. Overlook simply executes queries using an existing engine, such as a SQL DBMS, and adds noise to their results. Because Overlook's synopses do not require costly precomputation or storage, data curators can also use Overlook to explore the impact of privacy parameters interactively. Overlook offers a rich visual query interface based on the open source Hillview system. Overlook achieves accuracy comparable to existing synopsis-based systems, while offering better performance and removing the need for extra storage.", "venue": "Journal of Privacy and Confidentiality", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-22", "journal": {"name": "ArXiv", "volume": "abs/2006.12018"}, "authors": [{"authorId": "15810130", "name": "Pratiksha Thaker"}, {"authorId": "1707533", "name": "M. Budiu"}, {"authorId": "1718214", "name": "Parikshit Gopalan"}, {"authorId": "1753945", "name": "Udi Wieder"}, {"authorId": "143834867", "name": "M. Zaharia"}], "citations": [{"paperId": "ae57523e45d8e791c3f3c494a5a92bbce25ada60", "title": "Big Data implementation in the tourism industry with the integration of Singular Value Decomposition (SVD)"}, {"paperId": "4eb39289a739ae8a22cddf0bc6cdda9191860cc8", "title": "Centering Policy and Practice: Research Gaps Around Usable Differential Privacy"}, {"paperId": "bfacc498bb1450795a582e5b63798314bf0dc228", "title": "Making Differential Privacy Easier to Use for Data Controllers and Data Analysts using a Privacy Risk Indicator and an Escrow-Based Platform"}, {"paperId": "7885f3fe71b725860177f5c59eb750cc3228dad6", "title": "Investigating the Visual Utility of Differentially Private Scatterplots."}, {"paperId": "4f77cfb29a583418e80f719e9c3df6d9316813f2", "title": "What Are the Chances? Explaining the Epsilon Parameter in Differential Privacy"}, {"paperId": "631b13caf431c7c8fa1e16d69f9620c275e87416", "title": "Don’t Look at the Data! How Differential Privacy Reconfigures the Practices of Data Science"}, {"paperId": "d84231361e412720b06557cc5e9c5e18dcda47d5", "title": "Lessons Learned: Surveying the Practicality of Differential Privacy in the Industry"}, {"paperId": "122565f1d27dd982150336a9b0268f065615232d", "title": "DPVisCreator: Incorporating Pattern Constraints to Privacy-preserving Visualizations via Differential Privacy"}, {"paperId": "ed5b2c4aab09d6536b6d8d1d97d9f9d708efe4c2", "title": "Visualizing Privacy-Utility Trade-Offs in Differentially Private Data Releases"}, {"paperId": "e060961e5481d39dbec04b6c337fa1fe2c3a8278", "title": "A Visual Tool for Interactively Privacy Analysis and Preservation on Order-Dynamic Tabular Data"}, {"paperId": "82538550eb2f80ab046522456831ffe661e985b5", "title": "This paper is included in the Proceedings of the Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022)"}]}
