{"paperId": "61337f33a4ed84a0683a22acda599b52f06efd46", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Exploiting Reused-Based Sharing Work Opportunities in Big Data Multiquery Optimization with Flink", "abstract": "Multiquery optimization is fundamental to retrieve data from different sources in a specific time frame to fulfill the credibility of the big data applications. To avoid high-cost inputs or outputs operations over large-scale data, exploiting sharing opportunities including (join, aggregation, and sort) is helpful to improve the performance of the multiple queries. Furthermore, considering the in-memory big data platforms such as Flink is essential to enhance the performance of the multiple queries. We have extended our previous proposed system, Multi-Query Optimization using Tuple Size and Histogram (MOTH), to exploit sharing work among multiquery, including join, aggregation, and sort. The comprehensive system, called the Join-Aggregation-Sort (JAS)-MOTH system, is used to minimize the data in-network movement time, that is, shuffle time needed to transfer intermediate data. The proposed system is introduced by developing two additional modules to investigate the sharing work; query explorer and JAS-MOTH optimizer, including the sort exploiter module. The JAS-MOTH system can exploit the shared explicit and implicit sorts among multiple sorts and aggregation queries. The proposed system refines the pipelined multiway join execution for multiple join queries by considering coarse-grained sharing data, join ordering, joining pipelining, and shared implicit sorts. Furthermore, it introduces an end-to-end multiway join optimizer over Flink. An elaborated experimental comparison of the naive and state-of-art techniques among a broader class of queries (i.e., join, aggregation, and sort) is presented. Given the consideration of the findings based on Flink, the proposed system has improved the query execution time regarding the naive and state-of-art techniques by 47% and 30%, respectively. For intermediate data size, the JAS-MOTH system has reduced the intermediate data size reduction concerning the naive and state-of-art techniques by 50% and 31% on average, respectively, over Hadoop-like infrastructures.", "venue": "Big Data", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-06", "journal": {"name": "Big data"}, "authors": [{"authorId": "3298018", "name": "Radhya Sahal"}, {"authorId": "39023607", "name": "M. Khafagy"}, {"authorId": "2096096", "name": "F. Omara"}], "citations": [{"paperId": "771d0a51cec04ce3897226fd93239dc7c63d517d", "title": "Distributed Search Engine Query Optimization Using Artificial Neural Network"}]}
