{"paperId": "61388a55c594071b1804a4fee74bf82d5fe5695a", "publicationVenue": {"id": "6c47371b-894e-43b7-b353-05633a51f570", "name": "Informatyka Automatyka Pomiary w Gospodarce i Ochronie Środowiska", "alternate_names": ["Inform Autom Pomiary w Gospod Ochr Śr"], "issn": "2083-0157", "url": "http://e-iapgos.pl/"}, "title": "OPTYMALIZACJA DRZEWA DECYZYJNEGO OPARTA NA ALGORYTMIE GENETYCZNYM DO WYKRYWANIA DEMENCJI POPRZEZ ANALIZĘ MRI", "abstract": "Dementia is a devastating neurological disorder that affects millions of people globally, causing progressive decline in cognitive function and daily living activities. Early and precise detection of dementia is critical for optimal dementia therapy and management however, the diagnosis of dementia is often challenging due to the complexity of the disease and the wide range of symptoms that patients may exhibit. Machine learning approaches are becoming progressively more prevalent in the realm of image processing, particularly for disease prediction. These algorithms can learn to recognize distinctive characteristics and patterns that are suggestive of specific diseases by analyzing images from multiple medical imaging modalities. This paper aims to develop and optimize a decision tree algorithm for dementia detection using the OASIS dataset, which comprises a large collection of MRI images and associated clinical data. This approach involves using a genetic algorithm to optimize the decision tree model for maximum accuracy and effectiveness. The ultimate goal of the paper is to develop an effective, non-invasive diagnostic tool for early and accurate detection of dementia. The GA-based decision tree, as proposed, exhibits strong performance compared to alternative models, boasting an impressive accuracy rate of 96.67% according to experimental results.", "venue": "Informatyka Automatyka Pomiary w Gospodarce i Ochronie Środowiska", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-31", "journal": {"name": "Informatyka, Automatyka, Pomiary w Gospodarce i Ochronie Środowiska"}, "authors": [{"authorId": "2294375839", "name": "Govada Anuradha"}, {"authorId": "2294375471", "name": "Harini Davu"}, {"authorId": "2294374903", "name": "Muthyalanaidu Karri"}], "citations": []}
