{"paperId": "613d7ced4243b6df2c4da16a1e4faef1fb4ba12a", "publicationVenue": {"id": "d5738699-cfcc-42e4-aa9f-d8f074cf1573", "name": "Revista Facultad de Ingeniería", "alternate_names": ["Rev Fac Ing", "Revista de la Facultad de Ingeniería"], "issn": "0121-1129", "alternate_issns": ["0798-4065", "0120-6230"], "url": "https://revistas.uptc.edu.co/revistas/index.php/ingenieria", "alternate_urls": ["http://www.scielo.org.ve/scielo.php?lng=en&pid=0798-4065&script=sci_serial", "http://redin.udea.edu.co/", "http://www.scielo.org.co/scielo.php?lng=en&pid=0120-6230&script=sci_serial", "http://www.scielo.org.co/scielo.php?lng=en&pid=0121-1129&script=sci_serial"]}, "title": "NoSQL Database Modeling and Management: A Systematic Literature Review", "abstract": "The NoSQL databases that emerged this century were created to solve the limitations of relational database systems due to the different types of data that have appeared for information processing. In this paper, we present the results of a secondary study carried out to find and synthesize the research made up to now on modeling processes, characteristics of the used types of data, and management tools for NoSQL Databases. Currently, four types are recognized and classified according to the data model they use: key-value, document-oriented, column-based, and graph-based. With this study, it was possible to identify that the most frequently type of NoSQL database model is that of documents because it offers greater flexibility and versatility compared to the other three models. Although it offers more complex search methods, in terms of data, column and document schemas are the ones that usually describe their characteristics. It was also possible to observe a trend in the use of the column-oriented model and the document-oriented model in the management tools, and, although they all comply with the basic functionalities, the differences lie in the way in which the information is stored and the way they can be accessed.", "venue": "Revista Facultad de Ingeniería", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-30", "journal": {"name": "Revista Facultad de Ingeniería"}, "authors": [{"authorId": "2268606974", "name": "Raul Aguilar Vera"}, {"authorId": "2268609304", "name": "Andrés Naal Jácome"}, {"authorId": "2268609388", "name": "Julio Díaz Mendoza"}, {"authorId": "2268611405", "name": "Omar Gómez Gómez"}], "citations": []}
