{"paperId": "61585741c987ffc236cd754ca8c5fc4559967dd2", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "SciPipe: A workflow library for agile development of complex and dynamic bioinformatics pipelines", "abstract": "Background The complex nature of biological data has driven the development of specialized software tools. Scientific workflow management systems simplify the assembly of such tools into pipelines, assist with job automation and aid reproducibility of analyses. Many contemporary workflow tools are specialized and not designed for highly complex workflows, such as with nested loops, dynamic scheduling and parametriza-tion, which is common in e.g. machine learning. Findings SciPipe is a workflow programming library implemented in the programming language Go, for managing complex and dynamic pipelines in bioinformatics, cheminformatics and other fields. SciPipe helps in particular with workflow constructs common in machine learning, such as extensive branching, parameter sweeps and dynamic scheduling and parametrization of downstream tasks. SciPipe builds on Flow-based programming principles to support agile development of workflows based on a library of self-contained, reusable components. It supports running subsets of workflows for improved iterative development, and provides a data-centric audit logging feature that saves a full audit trace for every output file of a workflow, which can be converted to other formats such as HTML, TeX and PDF on-demand. The utility of SciPipe is demonstrated with a machine learning pipeline, a genomics, and a transcriptomics pipeline. Conclusions SciPipe provides a solution for agile development of complex and dynamic pipelines, espe-cially in machine leaning, through a flexible programming API suitable for scientists used to programming or scripting.", "venue": "bioRxiv", "year": 2018, "fieldsOfStudy": ["Medicine", "Biology", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-01", "journal": {"name": "GigaScience", "volume": "8"}, "authors": [{"authorId": "3124236", "name": "Samuel Lampa"}, {"authorId": "5966309", "name": "Martin Dahlö"}, {"authorId": "3336882", "name": "Jonathan Alvarsson"}, {"authorId": "1776762", "name": "O. Spjuth"}], "citations": [{"paperId": "c4b551ed25d52185d8df8b39d38e7955358e779a", "title": "ProvDeploy: Provenance-oriented Containerization of High Performance Computing Scientific Workflows"}, {"paperId": "e59c8d042ecbfcc8c22eef77949155338f339e53", "title": "Assessing the Effectiveness of Textual Recommendations in KoopaML"}, {"paperId": "4e00f6722f91d58b0b876a8a23883031df618371", "title": "Causal fault localisation in dataflow systems"}, {"paperId": "5e0234c2405b84d754eb99f58b9b8f625de4feda", "title": "WATTS: Workflow and template toolkit for simulation"}, {"paperId": "1d0360398d374e0b9b0e4a4b69738e8452e70050", "title": "Evaluation of tools for describing, reproducing and reusing scientific workflows"}, {"paperId": "64c07170aa613cd16a1ae0a8dd17cf9aa277f3ff", "title": "KubeAdaptor: A Docking Framework for Workflow Containerization on Kubernetes"}, {"paperId": "c22d32338ca1217e5014dff252d48e9e2c76d405", "title": "Building Domain-Specific Machine Learning Workflows: A Conceptual Framework for the State-of-the-Practice"}, {"paperId": "1de12757d27da8ca56ca02a587a18190e86b0507", "title": "CircuitFlow: A Domain Specific Language for Dataflow Programming (with appendices)"}, {"paperId": "214461da85621554a50ae32abc7c07e9e990d398", "title": "SCOPE2: A Platform for Sars-COv-2 Primer covErage Evaluation"}, {"paperId": "4c526226333a235cc87a32d64a9df355aa08d8ef", "title": "Refcat: The Internet Archive Scholar Citation Graph"}, {"paperId": "de6b83379a6195ace2cd3c58b4ba0fa1c2ba7e83", "title": "Reproducible, scalable, and shareable analysis pipelines with bioinformatics workflow managers"}, {"paperId": "38faba47428a649fa75808802086733552fb1b69", "title": "Compi: a framework for portable and reproducible pipelines"}, {"paperId": "87c4578a0b502674e95d98b73eb97e6b647d7a9b", "title": "The machine learning life cycle and the cloud: implications for drug discovery"}, {"paperId": "098ed0b505d3c106428dc29975f5addc96040b45", "title": "Design considerations for workflow management systems use in production genomics research and the clinic"}, {"paperId": "bff639f7b02be17dca93ee0d8515144fbd79944e", "title": "Sustainable data analysis with Snakemake"}, {"paperId": "e154ff9f7275a5493cefbe9f0f1a74109740e94d", "title": "Unifying package managers, workflow engines, and containers: Computational reproducibility with BioNix"}, {"paperId": "4163bdd019beaec6481042813eb4193681e5bf6b", "title": "Enabling Seamless Execution of Computational and Data Science Workflows on HPC and Cloud with the Popper Container-native Automation Engine"}, {"paperId": "2d36f40976d71960e1b200c89f2da9bcbbb7416e", "title": "Temporal Automaton RVTI-Grammar for the Diagrammatic Design Workflow Models Analysis"}, {"paperId": "a091fd3cac2416cdb24d66f75b9edbc1ecf59172", "title": "Compi Hub: A Public Repository for Sharing and Discovering Compi Pipelines"}, {"paperId": "7d5357943fed69481a8a77c8b94753dbb2ca04f2", "title": "MasterOfPores: A Workflow for the Analysis of Oxford Nanopore Direct RNA Sequencing Datasets"}, {"paperId": "6a5aafcd65a8a5786f1d3a710ae760778ca0ae93", "title": "pyrpipe: a Python package for RNA-Seq workflows"}, {"paperId": "edd312321eb696db50e5ce27e4c7c3bdb5e0657f", "title": "Parallel and scalable workflow for the analysis of Oxford Nanopore direct RNA sequencing datasets"}, {"paperId": "4df430c9db7cf685575fedf96c255f3059d9bba9", "title": "Predicting Off-Target Binding Profiles With Confidence Using Conformal Prediction"}, {"paperId": "3f77f35001ea920de49d9e4750482cc510ca5a7f", "title": "A Serverless Tool for Platform Agnostic Computational Experiment Management"}, {"paperId": "ba5c86c24d1927beeae469f5eecf98abb06ea95f", "title": "Approaches for containerized scientific workflows in cloud environments with applications in life science"}, {"paperId": "9afa7e9f1b614a4a547c15d8b696bf704b3e90cf", "title": "CWL-PLAS: Task Workflows Assisted by Data Science Cloud Platforms"}, {"paperId": "cad1057a722868f24cb5e2a39a09d6fd012aed33", "title": "Criteria for the Evaluation of Workflow Management Systems for Scientific Data Analysis"}, {"paperId": "7ca39747d33bf21d6c2a9a514c9e083b1f2a7f53", "title": "Research Proposal A GUI Bioinformatic Workflow Management tool with a basis in OpenWDL"}, {"paperId": "41cd497548074cd4765302aed32121b32e08df45", "title": "A Literature Review of Bioinformatic Workflow Management Tools and Languages"}, {"paperId": "dcec16342622c11bff47adf0660d96c3e21c34c7", "title": "Constructing a Modular Ancient DNA Pipeline using WDL"}, {"paperId": "c69beb22e3400f26f4183bbd367e1da68089dc3a", "title": "Sustainable data analysis with Snakemake [version 1; peer review: 1 approved, 1 approved with reservations]"}, {"paperId": "2ecd0f2aede5ddecf41009eb0f2b26ccaa81f6ee", "title": "sf CircuitFlow: A Domain Specific Language for Dataflow Programming"}, {"paperId": "26768e89b2d10ecf6ade13d31c84800da4550624", "title": "Analytical Model of Design Workflows Organization in the Automated Design of Complex Technical Products"}, {"paperId": "1d5e18f61074cfbb0c52892f9aed773b16156e3b", "title": "Enabling Scalable Data Analysis on Cloud Resources with Applications in Life Science"}]}
