{"paperId": "615c4cfc731adf27ed6299991335d7d1f062f7ed", "publicationVenue": {"id": "aa2288b7-f151-4e26-93a7-512c123c6754", "name": "Global Knowledge Memory and Communication", "alternate_names": ["Glob Knowl Mem Commun"], "issn": "2514-9342", "url": "http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=gkmc"}, "title": "Relationship between big data analytics and organisational performance of the Technical University of Kenya and Strathmore University in Kenya", "abstract": "\nPurpose\nBig data analytics is a set of procedures and technologies that entails new forms of integration to uncover large unknown values from large data sets that are various, complex and of an immense scale. The use of big data analytics is generally considered to improve organisational performance. However, this depends on capabilities of different organisations to provide the resources required for big data analytics. This study aims to investigate the influence of big data analytics on organisational performance of Technical University of Kenya (TUK) and Strathmore University (SU).\n\n\nDesign/methodology/approach\nThis study was conducted as a mixed method research to enable a deep understanding of the concept. Primary data was collected through structured questionnaires and interviews with clientele and information communication technology staff from the TUK and SU, both in Nairobi, Kenya. Secondary data was collected through interviews and questionnaires. Data was analysed and presented using descriptive statistics.\n\n\nFindings\nThe findings revealed that most of the variables of organisational performance such as innovativeness, creativeness, effectiveness, productiveness and efficiency are affected positively by conducting big data analytics in both institutions. The results demonstrate that the TUK showed a negative relationship between big data analytics and competiveness and profitability while SU showed a positive relationship between the two variables. In terms of regression analysis, the findings revealed that SU showed a good relationship between independent and dependant variables while the TUK had a weak influence.\n\n\nOriginality/value\nThis study is original in terms of its subject matter, scope and application.\n", "venue": "Global Knowledge Memory and Communication", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-05-06", "journal": {"name": "Global Knowledge, Memory and Communication"}, "authors": [{"authorId": "2558739", "name": "L. Kibe"}, {"authorId": "2213606", "name": "T. Kwanya"}, {"authorId": "101058146", "name": "Ashah Owano"}], "citations": [{"paperId": "37302cf66147ac7ca1001376fc47e7663f56083e", "title": "Record Management Practices and the Performance of Produce Dealers in Lira City"}, {"paperId": "fcde1937436ca21bca40bd29d01fcefd69f7de98", "title": "The Impact of Quality of Big Data Marketing Analytics (BDMA) on the Market and Financial Performance"}, {"paperId": "678b7b1dce9cc100a7be75817bfe8fb089e5a94a", "title": "Publishing trends on research data management in Sub-Saharan Africa: A bibliometrics analysis"}, {"paperId": "f29e8e6a61b2dfaf8c9fecc24fd513f773e7f125", "title": "Business Intelligence and Business Value in Organisations: A Systematic Literature Review"}, {"paperId": "45218f226bdaa705d89cdd08513b70079a843298", "title": "Research data management literacy amongst lecturers at Strathmore University, Kenya"}, {"paperId": "7fc1dca189857da8972eded726f67849b0a430a7", "title": "The Impact of Business Intelligence on the Relationship Between Big Data Analytics and Financial Performance: An Empirical Study in Egypt*"}]}
