{"paperId": "6167b4dbf677b78c229524431cd5064b45395db0", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "JanusAQP: Efficient Partition Tree Maintenance for Dynamic Approximate Query Processing", "abstract": "Approximate query processing over dynamic databases, i.e., under insertions/deletions, has applications ranging from high-frequency trading to internet-of-things analytics. We present JanusAQP, a new dynamic AQP system, which supports SUM, COUNT, AVG, MIN, and MAX queries under insertions and deletions to the dataset. JanusAQP extends static partition tree synopses, which are hierarchical aggregations of datasets, into the dynamic setting. This paper contributes new methods for: (1) efficient initialization of the data synopsis in the presence of incoming data, (2) maintenance of the data synopsis under insertions/deletions, and (3) re-optimization of the partitioning to reduce the approximation error. JanusAQP reduces the error of a state-of-the-art baseline by more than 60% using only 10% storage cost. JanusAQP can process more than 100K updates per second in a single node setting and keep the query latency at a millisecond level.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-20", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "572-584"}, "authors": [{"authorId": "2132479347", "name": "Xi Liang"}, {"authorId": "2740393", "name": "Stavros Sintos"}, {"authorId": "40428703", "name": "S. Krishnan"}], "citations": [{"paperId": "ef52c20a325806ffa1dda8c691a8ca802660b346", "title": "Range Entropy Queries and Partitioning"}]}
