{"paperId": "617c85db5e0f119e003ad243bb31a1aab0668f8b", "publicationVenue": null, "title": "OPriv: Optimizing Privacy Protection for Network Traffic", "abstract": "Statistical traffic analysis has absolutely exposed the privacy of supposedly secure network traffic, proving that encryption is not effective anymore. In this work, we present an optimal countermeasure to prevent an adversary from inferring users’ online activities, using traffic analysis. First, we formulate analytically a constrained optimization problem to maximize network traffic obfuscation while minimizing overhead costs. Then, we provide OPriv, a practical and efficient algorithm to solve dynamically the non-linear programming (NLP) problem, using Cplex optimization. Our heuristic algorithm selects target applications to mutate to and the corresponding packet length, and subsequently decreases the security risks of statistical traffic analysis attacks. Furthermore, we develop an analytical model to measure the obfuscation system’s resilience to traffic analysis attacks. We suggest information theoretic metrics for quantitative privacy measurement, using entropy. The full privacy protection of OPriv is assessed through our new metrics, and then through extensive simulations on real-world data traces. We show that our algorithm achieves strong privacy protection in terms of traffic flow information without impacting the network performance. We are able to reduce the accuracy of a classifier from 91.1% to 1.42% with only 0.17% padding overhead.", "venue": "J. Sens. Actuator Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-24", "journal": {"name": "J. Sens. Actuator Networks", "pages": "38", "volume": "10"}, "authors": [{"authorId": "46215648", "name": "Louma Chaddad"}, {"authorId": "144113997", "name": "A. Chehab"}, {"authorId": "1700205", "name": "A. Kayssi"}], "citations": [{"paperId": "e07d59d8664736a4a289cb06376b24220fffbb66", "title": "Machine Learning in IoT Networking and Communications"}]}
