{"paperId": "617dcea8e88f2e5020a21d52e455e9cd3645cc21", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "A Systematic Review of the Literature on the Use of Artificial Intelligence in Forecasting the Demand for Products and Services in Various Sectors", "abstract": "—This systematic review, carried out under the PRISMA methodology, aims to identify the recently proposed artificial intelligence models for demand forecasting, distinguishing the problems they try to overcome, recognizing the artificial intelligence methods used, detailing the performance metrics used, recognizing the performance achieved by these models and identifying what is new in them. Studies in the manufacturing, retail trade, tourism and electric energy sectors were considered in order to facilitate the transfer of knowledge from different sectors. 33 articles were analyzed, with the main results being that the proposed models are generally ensembles of various artificial intelligence methods; that the complexity of data and its scarcity are the main problems addressed; that combinations of simple machine learning, “bagging”, “boosting” and deep neural networks, are the most used methods; that the performance of the proposed models surpasses the classic statistical methods and other reference models; and that, finally, the proposed novelties cover aspects such as the type of data used, the pattern extraction techniques used, the assembly forms of the applied models and the use of algorithms for automating the adjustment of the models. Finally, a forecast model is proposed that includes the most innovative aspects found in this research.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2294369741", "name": "José Rolando Neira Villar"}, {"authorId": "72173233", "name": "Miguel Angel Cano Lengua"}], "citations": []}
