{"paperId": "617fd8fa3eb94d7dce10f0480e0877bcc8cf130e", "publicationVenue": {"id": "3f2626a8-9d78-42ca-9e0d-4b853b59cdcc", "name": "IEEE International Conference on Robotics and Automation", "type": "conference", "alternate_names": ["International Conference on Robotics and Automation", "Int Conf Robot Autom", "ICRA", "IEEE Int Conf Robot Autom"], "issn": "2152-4092", "alternate_issns": ["2379-9544"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000639", "alternate_urls": ["http://www.ncsu.edu/IEEE-RAS/"]}, "title": "Serverless Multi-Query Motion Planning for Fog Robotics", "abstract": "Robots in semi-structured environments such as homes and warehouses sporadically require computation of high-dimensional motion plans. Cloud and fog-based parallelization of motion planning can speed up planning. This can be further made efficient by the use of \"serverless\" on-demand computing as opposed to always-on high end computers. This paper explores parallelizing the computation of a sampling-based multi-query motion planner based on asymptotically-optimal Probabilistic Road Maps (PRM*) using the simultaneous execution of 100s of cloud-based serverless functions. We propose an algorithm to overcome the communication and bandwidth limitations of serverless computing and use different work-sharing techniques to further optimize the cost and run time. Additionally, we provide proofs of probabilistic completeness and asymptotic optimality. In experiments on synthetic benchmarks and on a physical Fetch robot performing a sequence of decluttering motions, we observe up to a 50x speedup relative to a 4 core edge computer with only a marginally higher cost.", "venue": "IEEE International Conference on Robotics and Automation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-05-30", "journal": {"name": "2021 IEEE International Conference on Robotics and Automation (ICRA)", "pages": "7457-7463"}, "authors": [{"authorId": "1750885157", "name": "Raghav V. Anand"}, {"authorId": "3027097", "name": "Jeffrey Ichnowski"}, {"authorId": "144329773", "name": "Chenggang Wu"}, {"authorId": "1695576", "name": "J. Hellerstein"}, {"authorId": "2119114305", "name": "Joseph Gonzalez"}, {"authorId": "144344283", "name": "Ken Goldberg"}], "citations": [{"paperId": "d87a88548010dd157b20a11e388d5b4f19320cff", "title": "FogROS2-SGC: A ROS2 Cloud Robotics Platform for Secure Global Connectivity"}, {"paperId": "bfe570f6b215a1ec4a9e1f236837031fe39a4bdc", "title": "FogROS2: An Adaptive Platform for Cloud and Fog Robotics Using ROS 2"}, {"paperId": "73208c1fbb1606228b4ab0d2ec91bde33154e1ce", "title": "FogROS: An Adaptive Framework for Automating Fog Robotics Deployment"}, {"paperId": "a48943cc121c4ecb3129918aa65d26cafec4ba03", "title": "Edge-SLAM: Edge-Assisted Visual Simultaneous Localization and Mapping"}, {"paperId": "d0d954ab7d8d1f7ce3a0d8fbfdb6f928f0fa816b", "title": "FogROS 2: An Adaptive and Extensible Platform for Cloud and Fog Robotics Using ROS 2"}, {"paperId": "7e7f2c92ff6fd24af652fcba78c7f8087326e4e9", "title": "FogROS: An Adaptive Framework for Automating Fog Robotics Deployment and Co-scheduling Feature Updates and Queries for Feature Stores"}]}
