{"paperId": "617fd38360c5105ee9e8794c1237912cfd84161b", "publicationVenue": {"id": "f4feaf1a-55ae-44e8-a601-dd4b8d6993ab", "name": "International Conference on Quantum Computing and Engineering", "type": "conference", "alternate_names": ["QCE", "Int Conf Quantum Comput Eng"]}, "title": "Parallelizing Quantum-Classical Workloads: Profiling the Impact of Splitting Techniques", "abstract": "Quantum computers are the next evolution of computing hardware. Quantum devices are being exposed through the same familiar cloud platforms used for classical computers, and enabling seamless execution of hybrid applications that combine quantum and classical components. Quantum devices vary in features, e.g., number of qubits, quantum volume, CLOPS, noise profile, queuing delays and resource cost. So, it may be useful to split hybrid workloads with either large quantum circuits or a large number of quantum circuits, into smaller units. In this paper, we profile two workload splitting techniques on IBM's Quantum Cloud: (1) Circuit parallelization, to split one large circuit into multiple smaller ones, and (2) Data parallelization to split a large number of circuits that run on one device to smaller batches of circuits that run on concurrently on multiple devices. These can improve the utilization of heterogeneous quantum hardware, but involve trade-offs. We evaluate these techniques on two key algorithmic classes: Variational Quantum Eigensolver (VQE) and Quantum Support Vector Machine (QSVM), and measure the impact on quality of the result, circuit execution times, quantum resource usage, and processing overheads, relative to a baseline without such parallelization. The results are obtained on real hardware and complemented by simulations. We see that (1) VQE with circuit cutting is ~ 39% better in ground state estimation than the uncut version, and (2) QSVM that combines data parallelization with a reduced feature set yields upto 3 ×improvement in quantum workload execution time and reduces quantum resource use by 3 ×, while providing comparable accuracy. Error mitigation can improve the accuracy by ≈ 7% and reduce resource footprint by ≈4% compared to the best case among the considered scenarios.", "venue": "International Conference on Quantum Computing and Engineering", "year": 2023, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-11", "journal": {"name": "2023 IEEE International Conference on Quantum Computing and Engineering (QCE)", "pages": "990-1000", "volume": "01"}, "authors": [{"authorId": "2216904140", "name": "Tuhin Khare"}, {"authorId": "9201844", "name": "Ritajit Majumdar"}, {"authorId": "2216876837", "name": "Rajiv Sangle"}, {"authorId": "2189424153", "name": "Anupama Ray"}, {"authorId": "2317621", "name": "P. V. Seshadri"}, {"authorId": "1761220", "name": "Yogesh L. Simmhan"}], "citations": [{"paperId": "310bfb235860e7dd3e232bfd8e4ed83dd0871587", "title": "Overhead-constrained circuit knitting for variational quantum dynamics"}, {"paperId": "e8ae1498ba54035761adf7c4ca943ea4291f1143", "title": "Distributed Scheduling of Quantum Circuits with Noise and Time Optimization"}]}
