{"paperId": "6188d36808c84067c573c2a4d891ebc71503b8eb", "publicationVenue": {"id": "6f6f3e5a-298c-412d-92ec-ee1c626efc8a", "name": "Gastroenterology Nursing", "type": "journal", "alternate_names": ["Gastroenterol Nurs"], "issn": "1042-895X", "url": "http://www.gastroenterologynursing.com/pt/re/gastronurse/home.htm;jsessionid=D86ibDoet1Q42ghW6yVIVhPOV61pLXYv245CJJTUl1Ay9My6EJo6!958525354!-949856144!9001!-1", "alternate_urls": ["https://journals.lww.com/gastroenterologynursing/pages/default.aspx", "https://journals.lww.com/gastroenterologynursing"]}, "title": "Knowledge of Diagnostic and Therapeutic Aspects of IBD Among Nurses Working in Digestive Endoscopy", "abstract": "Supplemental Digital Content is Available in the Text. The importance of inflammatory bowel disease (IBD) dedicated nurses in endoscopy services is poorly explored. Non-IBD healthcare professionals who work in endoscopy units may underestimate the discomfort and the secondary psychological distress that endoscopic procedures cause in IBD patients. We performed a nationwide survey to evaluate the level of knowledge of nurses working in endoscopy facilities throughout Italy related to IBD patients' needs undergoing endoscopic procedures. A non-validate 45 items questionnaire divided into six sections was assembled by a group of experts and supervised by nurses and IBD-physicians as part of the board of IGIBD, ANOTE-ANIGEA and AGGEI. The questionnaire was sent to 397 nurses of which 335 (84.4%) responded to the questionnaire. The median level of knowledge registered was 29 ± 12, corresponding to a medium level of knowledge based on the scores described in the method section. One hundred eighty-three nurses (54.6%) reported a high score, 113 (33.7%) a medium score, and 39 (11.6%) a low score. The majority of nurses worked in high volume endoscopy centers, where the 48% were educated in IBD management. A Low level of knowledge was recorded regarding disease severity definition, bowel preparation strategies in severe colitis and evaluation of perianal fistula. This nationwide survey clearly shows that there is a need for endoscopic nurses to acquire specific knowledge in the IBD field. Dedicated pathways for IBD management in endoscopy, continuous educational programs for nurses and further studies to improve nurse education are needed.", "venue": "Gastroenterology Nursing", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-05-01", "journal": {"name": "Gastroenterology Nursing", "pages": "E59 - E66", "volume": "44"}, "authors": [{"authorId": "1387933478", "name": "D. Napolitano"}, {"authorId": "6930665", "name": "F. Scaldaferri"}, {"authorId": "8935273", "name": "G. Fiorino"}, {"authorId": "40190058", "name": "R. Spagnuolo"}, {"authorId": "40631281", "name": "A. Leonetti"}, {"authorId": "3668288", "name": "L. Lopetuso"}, {"authorId": "4135884", "name": "A. Cocchieri"}], "citations": []}
