{"paperId": "61a65103ee27555199506fb65397a49a655ae26e", "publicationVenue": {"id": "355dc012-4f87-416a-87cd-a2d2ba7d1fb9", "name": "Internet Technology Letters", "alternate_names": ["Internet Technol Lett"], "issn": "2476-1508", "url": "https://onlinelibrary.wiley.com/journal/24761508"}, "title": "Edge computing based ice‐snow data analysis with NDN paradigm support", "abstract": "In the era of big data, different data types have emerged as the introduction of new applications. Under this context, the data analysis becomes more and more significant, especially in the field of uncertain trajectory prediction. On the occasion of the 2022 Beijing Winter Olympic Games, this paper pays attention to the ice‐snow data analysis so as to provide the support for the uncertain trajectory prediction. In terms of the enormous and redundant ice‐snow data, the edge computing framework is exploited to offload such data into the edge computing server for computing. Meanwhile, in order to satisfy the fast and efficient computing, the ice‐snow data is classified into different application types according to the named feature. For such purpose, this paper uses the inherent name space of Named Data Networking to differentiate different application types. Furthermore, regarding edge computing, this paper adopts Particle Swarm Optimization to perform the tasks offloading. For the proposed ice‐snow data analysis scheme, this paper carries out the real experiment environment deployment, and the results show that it can be used to provide the reference for the 2022 Beijing Winter Olympic Games.", "venue": "Internet Technology Letters", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-20", "journal": {"name": "Internet Technology Letters", "volume": "4"}, "authors": [{"authorId": "145779142", "name": "Peng Liu"}], "citations": [{"paperId": "4cbad8b8e417c9af3c2008a70e07e721694144b0", "title": "Caching‐enabled networks and its applications into the emerging networking paradigms and technologies"}, {"paperId": "e08611fec542c620deeeed2c06c1aee6be5b4b46", "title": "The Emerging of Named Data Networking: Architecture, Application, and Technology"}]}
