{"paperId": "61b0a491502ff27fe18722c068853fdf86685e2f", "publicationVenue": null, "title": "Qualitative hesitant fuzzy group decision making: An additively consistent probability and consensus‐based perspective", "abstract": "Hesitant fuzzy linguistic preference relations (HFLPRs) can efficiently denote the hesitant qualitative judgments of decision makers. Consistency and consensus are two critical topics in group decision making (GDM) with preference relations. This paper uses the additively consistent concept for linguistic fuzzy preference relations (LFPRs) to give an additive consistency definition for HFLPRs. To judge the additive consistency of HFLPRs, 0‐1 mixed programming models (0‐1‐MPMs) are constructed. Meanwhile, additive‐consistency‐based 0‐1‐MPMs to ascertain missing values in incomplete HFLPRs are established. Following the consistent probability of LFPRs, an algorithm to calculate the linguistic priority weighting vector is presented. In consideration of the consensus of GDM, a consistency‐probability‐distance‐measure‐based consensus index is defined, and an interactive improving consensus method is provided. Finally, a method for GDM with HFLPRs is offered that can address incomplete and inconsistent cases. Meanwhile, numerical examples are offered, and comparative analysis is made.", "venue": "Expert Syst. J. Knowl. Eng.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-25", "journal": {"name": "Expert Systems", "volume": "37"}, "authors": [{"authorId": "2109541615", "name": "Jie Tang"}, {"authorId": "3335363", "name": "F. Meng"}, {"authorId": "1741576", "name": "Zeshui Xu"}, {"authorId": "39947527", "name": "Ruiping Yuan"}], "citations": [{"paperId": "55f527784c54a9f22ecf8bc619a70daab7bb95bf", "title": "Hesitant fuzzy linguistic iterative method for consistency and consensus-driven group decision making"}, {"paperId": "fac9e23293adbcb07d777365b2d8dafaa2cb2d14", "title": "Multi-criteria Group Decision-Making Approach for Express Packaging Recycling Under Interval-Valued Fuzzy Information: Combining Objective and Subjective Compatibilities"}, {"paperId": "b8c33d3f4a6de6b68ed528a32ec1ac29ca226f91", "title": "A cloud‐based and web‐based group decision support system in multilingual environment with hesitant fuzzy linguistic preference relations"}, {"paperId": "805b1be6285ae667860bee24d071d2117718dd57", "title": "Improved multi‐criteria group decision‐making method considering hesitant fuzzy preference relations with self‐confidence behaviours for environmental pollution emergency response process evaluation"}, {"paperId": "1579fb76bb8ad2b2dcb7b90730f44dde93e67f88", "title": "A hybrid decision‐making framework under complex spherical fuzzy prioritized weighted aggregation operators"}, {"paperId": "29b7f77110c172e2f8c65622665ce19c9605d86f", "title": "Group decision making based on acceptable consistency analysis of interval linguistic hesitant fuzzy preference relations"}]}
