{"paperId": "61c92c62ef88d566b9924cde0eca5c28b6909ab5", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "A Robust Distributed Clustering of Large Data Sets on a Grid of Commodity Machines", "abstract": "Distributed clustering algorithms have proven to be effective in dramatically reducing execution time. However, distributed environments are characterized by a high rate of failure. Nodes can easily become unreachable. Furthermore, it is not guaranteed that messages are delivered to their destination. As a result, fault tolerance mechanisms are of paramount importance to achieve resiliency and guarantee continuous progress. In this paper, a fault-tolerant distributed k-means algorithm is proposed on a grid of commodity machines. Machines in such an environment are connected in a peer-to-peer fashion and managed by a gossip protocol with the actor model used as the concurrency model. The fact that no synchronization is needed makes it a good fit for parallel processing. Using the passive replication technique for the leader node and the active replication technique for the workers, the system exhibited robustness against failures. The results showed that the distributed k-means algorithm with no fault-tolerant mechanisms achieved up to a 34% improvement over the Hadoop-based k-means algorithm, while the robust one achieved up to a 12% improvement. The experiments also showed that the overhead, using such techniques, was negligible. Moreover, the results indicated that losing up to 10% of the messages had no real impact on the overall performance.", "venue": "International Conference on Data Technologies and Applications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-07", "journal": {"name": "Data", "pages": "73", "volume": "6"}, "authors": [{"authorId": "46282794", "name": "Salah Taamneh"}, {"authorId": "1405359802", "name": "Mo’taz Al-Hami"}, {"authorId": "1403424628", "name": "Hani Bani-Salameh"}, {"authorId": "1942589", "name": "A. Abdallah"}], "citations": [{"paperId": "30880054fc691c0dea58077f569db727627519cf", "title": "DDCM: a decentralized density clustering and its results gathering approach"}]}
