{"paperId": "61d86abf57eed7feece5a557df5dd5609d6eb225", "publicationVenue": {"id": "0b8373ea-5505-4c96-99ff-b8da87a2ce3e", "name": "Materials", "type": "journal", "issn": "1996-1944", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-164286", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-164286", "https://www.mdpi.com/journal/materials", "http://www.mdpi.com/journal/materials"]}, "title": "A Versatile Punch Stroke Correction Model for Trial V-Bending of Sheet Metals Based on Data-Driven Method", "abstract": "During air bending of sheet metals, the correction of punch stroke for springback control is always implemented through repeated trial bending until achieving the forming accuracy of bending parts. In this study, a modelling method for correction of punch stroke is presented for guiding trial bending based on a data-driven technique. Firstly, the big data for the model are mainly generated from a large number of finite element simulations, considering many variables, e.g., material parameters, dimensions of V-dies and blanks, and processing parameters. Based on the big data, two punch stroke correction models are developed via neural network and dimensional analysis, respectively. The analytic comparison shows that the neural network model is more suitable for guiding trial bending of sheet metals than the dimensional analysis model, which has mechanical significance. The actual trial bending tests prove that the neural-network-based punch stroke correction model presents great versatility and accuracy in the guidance of trial bending, leading to a reduction in the number of trial bends and an improvement in the production efficiency of air bending.", "venue": "Materials", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-24", "journal": {"name": "Materials", "volume": "14"}, "authors": [{"authorId": "153020865", "name": "Y. Yu"}, {"authorId": "95405577", "name": "Z. Guan"}, {"authorId": "118472796", "name": "M. Ren"}, {"authorId": "2108456453", "name": "Jiawang Song"}, {"authorId": "117436233", "name": "Pinkui Ma"}, {"authorId": "2113237360", "name": "Hongjie Jia"}], "citations": [{"paperId": "8b52ab75a41f3447993855b7a684e592a63e9bd7", "title": "Error Prediction of Springback in Bending Process Based on GA-BPNN for Accurate Forming Angle"}]}
