{"paperId": "61e46d0132ed08115a8d9ed4d7ece4262a1fd76b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Fuzzy Logic Based Binary Computation Offloading Scheme in V2X Communication Networks", "abstract": "With the recent development of intelligent transportation systems, vehicles are getting more and more powerful and involving huge number of real-time applications including computation-intensive and delay-sensitive applications in vehicle-to-vehicle communication networks, which are challenging to be processed by an individual vehicle, especially for a legacy one. These resource-consuming computation tasks can be offloaded to another vehicle with idle computing resources for processing. However, it is difficult to select an optimal resource vehicle for each computational task in a dynamic vehicular network where the wireless communication links are lossy and the network topology is time-varying due to the high mobility of vehicles. In this work, we investigate the resource vehicle selection problem, which determines one of vehicles as the most suitable resource vehicle for the current computational task. To this end, a novel fuzzy logic based binary offloading scheme is proposed in vehicle-to-everything (V2X) communication networks. The proposed scheme evaluates the vehicles within the proximity by jointly considering the computational power, mobility, and link quality between neighboring vehicles based on fuzzy logic to ensure a high task completion rate for binary offloading applications. In order to validate the performance of the proposed offloading scheme, we conducted extensively computer simulations with the real traffic network in Xi’an city in China. As the results show, the offloading scheme expeditiously makes optimal decision in various environments, and outperforms other baseline proposals in terms of average task completion time and task completion rate. The average task completion time is reduced by 37.5%, whereas the best reduction of other baselines is 21.1% in our simulations.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "45507-45518", "volume": "12"}, "authors": [{"authorId": "1931743800", "name": "Rui Men"}, {"authorId": "2244625566", "name": "Xiumei Fan"}, {"authorId": "5167707", "name": "Axida Shan"}, {"authorId": "2292789962", "name": "Gang Yuan"}], "citations": []}
