{"paperId": "61e8304f09c2a515a12ce39a5472937271ad5346", "publicationVenue": {"id": "4a2f4040-3e67-488c-a90e-753cb46469ea", "name": "International Journal of Preventive Medicine", "type": "journal", "alternate_names": ["Int J Prev Med"], "issn": "2008-7802", "url": "http://www.ijpvmjournal.net/"}, "title": "Internet of Things (IoT) Adoption Model for Early Identification and Monitoring of COVID-19 Cases: A Systematic Review", "abstract": "Background: The 2019 coronavirus disease (COVID-19) is a mysterious and highly infectious disease that was declared a pandemic by the World Health Organization. The virus poses a great threat to global health and the economy. Currently, in the absence of effective treatment or vaccine, leveraging advanced digital technologies is of great importance. In this respect, the Internet of Things (IoT) is useful for smart monitoring and tracing of COVID-19. Therefore, in this study, we have reviewed the literature available on the IoT-enabled solutions to tackle the current COVID-19 outbreak. Methods: This systematic literature review was conducted using an electronic search of articles in the PubMed, Google Scholar, ProQuest, Scopus, Science Direct, and Web of Science databases to formulate a complete view of the IoT-enabled solutions to monitoring and tracing of COVID-19 according to the FITT (Fit between Individual, Task, and Technology) model. Results: In the literature review, 28 articles were identified as eligible for analysis. This review provides an overview of technological adoption of IoT in COVID-19 to identify significant users, either primary or secondary, required technologies including technical platform, exchange, processing, storage and added-value technologies, and system tasks or applications at “on-body,” “in-clinic/hospital,” and even “in-community” levels. Conclusions: The use of IoT along with advanced intelligence and computing technologies for ubiquitous monitoring and tracking of patients in quarantine has made it a critical aspect in fighting the spread of the current COVID-19 and even future pandemics.", "venue": "International Journal of Preventive Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-08-08", "journal": {"name": "International Journal of Preventive Medicine", "volume": "13"}, "authors": [{"authorId": "40376935", "name": "M. Shanbehzadeh"}, {"authorId": "2007140884", "name": "Raoof Nopour"}, {"authorId": "1410623731", "name": "H. Kazemi-Arpanahi"}], "citations": [{"paperId": "2737e5c3e8d228ec1445c348190860a64b887398", "title": "Investigating the role of machine learning techniques in internet of things during the COVID-19 pandemic: A systematic review"}]}
