{"paperId": "61ff5f2459ff2ce9004c02e9fd875145cf052110", "publicationVenue": {"id": "66257d67-2035-4ff6-b62a-4099db02fcde", "name": "Alberto Mendelzon Workshop on Foundations of Data Management", "type": "conference", "alternate_names": ["AMW", "Alberto Mendelzon Workshop Found Data Manag"]}, "title": "Declarative BigData Algorithms via Aggregates and Relational Database Dependencies", "abstract": "The ability of using aggregates in recursive Datalog queries is making possible a simple declarative expression for important algorithms and it is conducive to their parallel implementations with scalability and performance that often surpass those of their formulations in GraphX and Scala. These recent advances were made possible by the notion of Pre-Mappability (PreM) that, along with a highly optimized seminaive-based operational semantics, guarantees their formal non-monotonic semantics for the programs expressing these declarative algorithms. However, proving that these programs have the PreM property can be too difficult for everyday programmers. Therefore in this paper, we introduce basic templates that facilitate and automate this formal task. These templates are based on simple extensions of Functional and Multivalued Dependencies (FDs and MVDs) whereby properties such as the mixed transitivity of MVDs and FDs are used to prove the validity of these powerful declarative algorithms.", "venue": "Alberto Mendelzon Workshop on Foundations of Data Management", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1712630", "name": "C. Zaniolo"}, {"authorId": "34842481", "name": "Mohan Yang"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "2499545", "name": "Ariyam Das"}, {"authorId": "2535713", "name": "Alexander Shkapsky"}, {"authorId": "3269316", "name": "Tyson Condie"}], "citations": [{"paperId": "8ca890e039a096b5cb7a8af9cb68a0bb114a9766", "title": "Optimizing Recursive Queries with Progam Synthesis"}, {"paperId": "893ed788c9ca7b160fba2f3001141a0b70a0b479", "title": "Formal semantics and high performance in declarative machine learning using Datalog"}, {"paperId": "59c4149d05557f049c92d1bd774f6724e08dd96f", "title": "Convergence of Datalog over (Pre-) Semirings"}, {"paperId": "5741548afb3e3e0b74194c0963187e41f42e753d", "title": "Proceedings 35th International Conference on Logic Programming (Technical Communications)"}, {"paperId": "1a14d0607ca2ac758636538d47581f1a911616fb", "title": "BigData Applications from Graph Analytics to Machine Learning by Aggregates in Recursion"}, {"paperId": "2001e952a7453c417e52d6959c2f008fa9555a23", "title": "A Case for Stale Synchronous Distributed Model for Declarative Recursive Computation"}, {"paperId": "1deb7db62369303d65d1970cab6409d0a3078bcd", "title": "RaSQL: Greater Power and Performance for Big Data Analytics with Recursive-aggregate-SQL on Spark"}, {"paperId": "0d091e62d501539c35d00562caae4bb993722c6c", "title": "Scaling-Up In-Memory Datalog Processing: Observations and Techniques"}, {"paperId": "d3fd48883dce626ad0b9ebe17bf158f77144b4fa", "title": "Scaling-up reasoning and advanced analytics on BigData"}, {"paperId": "e3ed4fe8d798d098293cfa9756012f9214b3a615", "title": "A datalog-based computational model for coordination-free, data-parallel systems"}, {"paperId": "5ba1e2d13cc12e8ebc27255bcef292347d639e47", "title": "Developing Big-Data Application as Queries: an Aggregate-Based approach"}]}
