{"paperId": "6209265fa910d722d7efd9339ef6b4d1741a02fa", "publicationVenue": {"id": "2cbf9479-e1fa-4c75-81f6-7103e18156ca", "name": "Chinese Control and Decision Conference", "type": "conference", "alternate_names": ["CCDC", "Chin Control Decis Conf"]}, "title": "Research on Production Big Data Acquisition and Transmission System in Intelligent Jobshop", "abstract": "The production data acquisition and transmission mechanism in intelligent jobshops is a special topic. The data are complex in origin, diverse in types, and distributed with manufacturing resources. In order to efficiently utilize these massive, heterogeneous and multi-source production data, a production big data acquisition and transmission system is proposed. In the data acquisition, to realize a unified and standardized description of the functions for heterogeneous manufacturing resources, the operation process and functional characteristics of jobshop manufacturing resources are studied, and a resource attribute description model is designed. Further, a unified data acquisition system with abstract and hierarchical data interfaces are designed. Meanwhile, in the aspect of data transmission, a Kafka-based manufacturing data transmission system is designed and developed out, which can provide higher throughput and lower delay than traditional ones. Furthermore, the monitoring layer analyzes the data and provides a visual display of real-time status data by the visualization interfaces. Finally, the architecture has been tested in a simulation digital jobshop, The simulation results show that the proposed data acquisition and transmission can improve the scalability of the system, increase data throughput and reduce transmission delay.", "venue": "Chinese Control and Decision Conference", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-05-22", "journal": {"name": "2021 33rd Chinese Control and Decision Conference (CCDC)", "pages": "293-298"}, "authors": [{"authorId": "2218198234", "name": "Genyin Liu"}, {"authorId": "2115637780", "name": "Yanhong Wang"}, {"authorId": "2215095841", "name": "Chenghao Liu"}, {"authorId": "2115439769", "name": "Yue Cui"}], "citations": []}
