{"paperId": "6209dbbfb6c15ccab8bc2d0ff3bf175e999e1a7a", "publicationVenue": {"id": "114771e9-f9a7-4e0c-9277-b6173dad6975", "name": "Jurnal Ilmiah Teknik Elektro Komputer dan Informatika", "type": "journal", "alternate_names": ["J Ilm Tek Elektro Kompʹût dan Inform"], "issn": "2338-3070", "alternate_issns": ["2338-3062"], "url": "http://digilib.uad.ac.id/"}, "title": "Systematic Literature Review: Current Products, Topic, and Implementation of Graph Database", "abstract": "Planning, developing, and updating software cannot be separated from the role of the database. From various types of databases, graph databases are considered to have various advantages over their predecessor, relational databases. Graph databases then become the latest trend in the software and data science industry, apart from the development of graph theory itself. The proliferation of research on GDB in the last decade raises questions about what topics are associated with GDB, what industries use GDB in its data processing, what the GDB models are, and what types of GDB have been used most frequently by users in the last few years. This article aims to answer these questions through a Literature Review, which is carried out by determining objectives, determining the limits of review coverage, determining inclusion and exclusion criteria for data retrieval, data extraction, and quality assessment. Based on a review of 60 studies, several research topics related to GDB are Semantic Web, Big Data, and Parallel computing. A total of 19 (30%) studies used Neo4j as their database. Apart from Social Networks, the industries that implement GDB the most are the Transportation sector, Scientific Article Networks, and general sectors such as Enterprise Data, Biological data, and History data. This Literature Review concludes that research on the topic of the Graph Database is still developing in the future. This is shown by the breadth of application and the variety of new derivatives of GDB products offered by researchers to address existing problems.", "venue": "Jurnal Ilmiah Teknik Elektro Komputer dan Informatika", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-15", "journal": {"name": "Jurnal Ilmiah Teknik Elektro Komputer dan Informatika"}, "authors": [{"authorId": "32066543", "name": "Adhy Rizaldy"}, {"authorId": "2100432903", "name": "S. Fahriah"}, {"authorId": "2071684558", "name": "Nahrun Hartono"}], "citations": [{"paperId": "49527b279f18e7db5b407e0a26cbceacbc4950ad", "title": "Future Potential of E-Nose Technology: A Review"}]}
