{"paperId": "620eb0edff40df086980744f85d9f1549ef624be", "publicationVenue": {"id": "e02530e7-d355-4769-a1c4-785277f87aef", "name": "International Journal of Bioinformatics Research and Applications", "type": "journal", "alternate_names": ["Int J Bioinform Res Appl"], "issn": "1744-5485", "url": "https://www.inderscience.com/browse/index.php?journalcode=ijbra"}, "title": "Emerging trend of big data analytics in bioinformatics: a literature review", "abstract": "Advancement of unparalleled data in bioinformatics over the years is a major concern for storage and management. Such massive data must be handled efficiently to disseminate knowledge. Computational advancements in information technology present feasible analytical solutions to process such data. In this context, the paper is an attempt to highlight the influence of big data in bioinformatics. Some of the concepts emphasised are definition of big data; architectural platforms supporting data analytics; followed by the application of above-mentioned analytical techniques towards complex problems in bioinformatics. The challenges and future prospects of big data analytics in bioinformatics are briefly discussed. This paper provides a comprehensive summary of several data analytical techniques available for bioinformatics researchers and computer scientists.", "venue": "International Journal of Bioinformatics Research and Applications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-01-11", "journal": {"name": "Int. J. Bioinform. Res. Appl.", "pages": "144-205", "volume": "14"}, "authors": [{"authorId": "27996430", "name": "K. Nagaraj"}, {"authorId": "1982302", "name": "G. Sharvani"}, {"authorId": "2587478", "name": "Amulyashree Sridhar"}], "citations": [{"paperId": "7b3d27f7c0fe22d654f299fe2148077f9dbd7f9c", "title": "OPERA-gSAM: Big Data Processing Framework for UMI Sequencing at High Scalability and Efficiency"}, {"paperId": "a62496d22b8eae05c62320a1bc2dbfc44753ed34", "title": "Data Analytics in Healthcare: A Tertiary Study"}, {"paperId": "771031b74d4a6a3ca8bdc8fc6e6ac75bdcf8ee0a", "title": "Leveraging big data bioinformatics approaches to extract knowledge from Staphylococcus aureus public omics data"}, {"paperId": "025757b2b7a92e581ceb987165573937441da729", "title": "Preliminary performance study of a brief review on machine learning techniques for analogy based software effort estimation"}, {"paperId": "4fa2475f739d097fa6aac2a2ee9edce81cb4e6b7", "title": "Julia for biologists"}, {"paperId": "c2abf41cd52b86eb43cc0a4a8fa9e1fa36905d07", "title": "Early Detection of Gastroesophageal Reflux Disease Using Logistic Regression and Support Vector Machine"}, {"paperId": "571bf8f03ab4661dbb9097cf1dfcc15d48b1ebdd", "title": "Towards Investigating the Role of Proprotein Convertase Subtilisin/Kexin Family (PCSK/7/9) in Cancer by Using Bioinformatics Motif Detection Technique"}, {"paperId": "f28ae56ef534e32cb45c508bdbaf27119568ffde", "title": "Sosyal Ağlarda Büyük Veri: Teknoloji Markaları Üzerine Bir Araştırma"}, {"paperId": "292a6d3ea851ca86fd2e903b939226fbee3b3dcb", "title": "Big Data Trends in Bioinformatics"}, {"paperId": "6fe78c7a9f9dd1c7ac1913997bf4da76583a8a03", "title": "Cross-Corpus Training with CNN to Classify Imbalanced Biomedical Relation Data"}, {"paperId": "a3123e35fe5da4f35422f2167bbb4de6620cf0c3", "title": "Trends and Application of Data Science in Bioinformatics"}, {"paperId": "6c4ee1093f0c3da1f9a170db5605e32f7849c42d", "title": "A review of a hybrid IoT-NG-PON system for translational bioinformatics in healthcare"}, {"paperId": "59a17139ae33fc33bf8715b54b31951e0bfbd825", "title": "Adaptive Machine Learning Algorithm and Analytics of Big Genomic Data for Gene Prediction"}, {"paperId": "9b38cca280292beeea0e82c760eb11f3632f0231", "title": "Big Data Analytics and Deep Learning in Bioinformatics With Hadoop"}, {"paperId": "ec1a8270cadc713f519bfe0ea3dadb50bcf9f234", "title": "Motif Detection in Cellular Tumor p53 Antigen Protein Sequences by using Bioinformatics Big Data Analytical Techniques"}]}
