{"paperId": "621fcd4b88a2a360afb2c33c9bf302afcfabae61", "publicationVenue": {"id": "79711db1-9329-4846-aa75-e5152729b7db", "name": "Global Conference on Artificial Intelligence and Internet of Things", "type": "conference", "alternate_names": ["GCAIoT", "Glob Conf Artif Intell Internet Thing"]}, "title": "Secure Smart Cities Framework Using IoT and AI", "abstract": "We present a framework to secure Internet-of- Things (IoT) enabled Smart Cities using Black Networks and Artificial Intelligence (AI) to protect against a broad range of current and future cyber attacks. Smart city cyber systems carry critical data beginning with the simple sensor data captured by IoT devices up to and including providing the essential services and commands dependent upon that data. The broad reliance upon IoT in smart cities significantly increases the attack surface of the already large, complex, and heterogeneous smart city system by making each and every IoT device and its communications a potential entry point into the system. Our proposed framework utilizes Black Network protocols and key management to secure the most vulnerable, and typically unsecured, IoT communications. The framework utilizes a hierarchical, distributed architecture with pooled resources to prevent single points of failure and to sandbox attack impacts. This hierarchy allows AI enabled management tools to be placed both near the IoT edge using localized data and in the Big Data collections. Our analysis reveals that the proposed framework provides an adaptive health and security management framework that accounts for the dynamic, continuous, and ever-changing life in a smart city.", "venue": "Global Conference on Artificial Intelligence and Internet of Things", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-12", "journal": {"name": "2020 IEEE Global Conference on Artificial Intelligence and Internet of Things (GCAIoT)", "pages": "1-6"}, "authors": [{"authorId": "3317581", "name": "Shaibal Chakrabarty"}, {"authorId": "3340122", "name": "D. Engels"}], "citations": [{"paperId": "e66dd72510969e7cc00e9bc06df4dff148976b3b", "title": "Security and Privacy of Internet of Things: A Review of Challenges and Solutions"}, {"paperId": "957470622aba3ba879ad6b4937243b64513b3536", "title": "Internet of Medical Things Privacy and Security: Challenges, Solutions, and Future Trends from a New Perspective"}, {"paperId": "b022da79bbe7300b9c0726bfe3619c9e1845cc63", "title": "Trust Management With Fault-Tolerant Supervised Routing for Smart Cities Using Internet of Things"}, {"paperId": "1b39db3cdcb2e2c2d38c00d685f43c106d9e6a31", "title": "INTERNET OF THINGS E INTELIGÊNCIA ARTIFICIAL NOS MEIOS PRODUTIVOS"}, {"paperId": "dc893dbb9b04a9454442588d965f88ff71fcbd66", "title": "High-performance computing and computational intelligence applications with a multi-chaos perspective"}, {"paperId": "59cd27f1de997747a5fd95aadbb72fe8370815fb", "title": "Adoption of artificial intelligence in smart cities: A comprehensive review"}, {"paperId": "b680ad562d3582e00f3695c31d6d9a6efeee1d17", "title": "Artificial intelligence Internet of Things: A new paradigm of distributed sensor networks"}, {"paperId": "c5b1aca24688d228ba2e95f6fb786698f9f15f66", "title": "Speech Recognition for Light Control on Raspberry Pi Using Python Programming"}, {"paperId": "437661490c1e5ec2b72bbe9549d26a114f6459cb", "title": "Smart City Mobile IoT Management with DLTs"}, {"paperId": "0852d3293159aaa325e1dcd4462cb06122743777", "title": "Consumer Frameworks for Smart Environments"}, {"paperId": "d98fb6effacc89d69e0809130f1c0e1a718bec00", "title": "MACHINE LEARNING PIPELINE APPROACH TO SECURE IOT-BASED SMART CITIES"}]}
