{"paperId": "62325cafe56c4f2391e80d0e4646a50148242a76", "publicationVenue": {"id": "acdf09ed-68cc-4c8a-b2ab-3c6c4873cc9e", "name": "Therapeutic Advances in Gastroenterology", "type": "journal", "alternate_names": ["Ther Adv Gastroenterol"], "issn": "1756-283X", "url": "https://journals.sagepub.com/home/tag", "alternate_urls": ["http://tag.sagepub.com/"]}, "title": "Vedolizumab has longer persistence than infliximab as a first-line biological agent but not as a second-line biological agent in moderate-to-severe ulcerative colitis: real-world registry data from the Persistence Australian National IBD Cohort (PANIC) study", "abstract": "Background: The choice between infliximab (IFX) and vedolizumab (VED) as a first-line biological agent in moderate-to-severe ulcerative colitis (UC) can be difficult. Second-line vedolizumab (VED) efficacy may decline following prior infliximab (IFX) treatment failure in UC patients. However, it is not known whether second-line IFX efficacy declines after failure of first-line VED. Aims: We aimed to compare first-line and second-line persistence of IFX and VED, in particular whether second-line IFX persistence declines after failure of first-line VED. Methods: Persistence of IFX and VED was analysed from the Australian Pharmaceutical Benefits Scheme registry data as either first- or second-line treatment in UC. Propensity score matching (1:1) was conducted in the comparison of first-line treatments. Cox proportional hazard regression analysis was used to identify significant predictors and expressed as a hazard ratio (HR and 95% CI). Results: There were 420 subjects with moderate-to-severe UC who received either first-line IFX (n = 251) or VED (n = 169), with 774 patient-years of follow-up. First-line VED had significantly longer persistence than first-line IFX (>50.2 versus 22.2 months, p = 0.001). Fifty-three subjects failed first-line IFX and swapped to second-line VED (IFX→VED group). Twenty-two subjects failed first-line VED group and swapped to second-line IFX (VED→IFX group). First-line VED persistence was significantly longer than second-line VED (>50.2 versus 32.0 months, p = 0.03), but first-line IFX persistence was not statistically significantly different to second-line IFX (27.6 months versus  > 38.6 months, p = 0.30). Immunomodulator co-therapy was significantly associated with a lower risk of nonpersistence of first-line VED (HR: 0.55, 95% CI: 0.33–0.89, p = 0.02) and IFX (HR: 0.63,95%CI: 0.33–0.92, p = 0.02). Conclusion: VED had a significantly longer persistence than IFX as first-line biological agent but does not disadvantage second-line IFX use in moderate-to-severe UC. VED after IFX is associated with significantly poorer persistence. VED, therefore, should be considered as the first-line biological agent of choice in UC.", "venue": "Therapeutic Advances in Gastroenterology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Therapeutic Advances in Gastroenterology", "volume": "15"}, "authors": [{"authorId": "73198062", "name": "A. Pudipeddi"}, {"authorId": "40170210", "name": "Y. Ko"}, {"authorId": "3842147", "name": "S. Paramsothy"}, {"authorId": "152406781", "name": "R. Leong"}], "citations": [{"paperId": "036075d3363e18d26f3a83841e895ef4129478db", "title": "Editorial: Is vedolizumab the preferred biologic therapy for biologic‐naïve patients with ulcerative colitis?"}, {"paperId": "6de66ce54fc887a980c97c36093a47ef80fa3b27", "title": "Real-World Effectiveness of Vedolizumab vs Anti-TNF in Biologic-naïve Crohn's Disease Patients: A 2-year Propensity-score-adjusted Analysis from the VEDOIBD-Study."}, {"paperId": "3df3db5876c3efbc850557d00ad92dccac336d78", "title": "Prioritization in inflammatory bowel disease therapy"}, {"paperId": "a5e483222fab89c4414093530482de3e8925719b", "title": "Vedolizumab Is Associated with Longer Drug Sustainability Compared to Infliximab in Moderate-to-Severe Ulcerative Colitis: Long-Term Real-World Cohort Data"}, {"paperId": "daa1f2654cbd57c5a80c34776fc1b689eccb2f7e", "title": "Real‐world effectiveness of vedolizumab compared to anti‐TNF agents in biologic‐naïve patients with ulcerative colitis: A two‐year propensity‐score‐adjusted analysis from the prospective, observational VEDOIBD‐study"}, {"paperId": "ad605ccb4769daa83f80a3a455ae3b7a02c61325", "title": "Case report of new‐onset ulcerative colitis after MVC‐COVI1901 vaccine injection for SARS‐CoV‐2"}, {"paperId": "70718251536edf84f547d1bd6f6b004a5f11d606", "title": "Drug utilization of biologic therapy in Crohn’s disease and ulcerative colitis: a population-based Danish cohort study 2015–2020"}, {"paperId": "f03f5a2e21a3a024f85b643c3e89b6475503042a", "title": "The role of Th17 cells in inflammatory bowel disease and the research progress"}, {"paperId": "6ac8316ee7d3dc12345019df88781410001e91de", "title": "Vedolizumab subcutaneous formulation maintenance therapy for patients with IBD: a systematic review and meta-analysis"}]}
