{"paperId": "6236d5f6be4782c6aff0c1ac5ae2b8084082d501", "publicationVenue": {"id": "29b9c461-963e-4d11-b2ab-92c182243942", "name": "IEEE Symposium on Security and Privacy", "type": "conference", "alternate_names": ["S&P", "IEEE Symp Secur Priv"], "url": "http://www.ieee-security.org/"}, "title": "“It’s up to the Consumer to be Smart”: Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit", "abstract": "Smart home technologies offer many benefits to users. Yet, they also carry complex security and privacy implications that users often struggle to assess and account for during adoption. To better understand users’ considerations and attitudes regarding smart home security and privacy, in particular how users develop them progressively, we conducted a qualitative content analysis of 4,957 Reddit comments in 180 security- and privacy-related discussion threads from /r/homeautomation, a major Reddit smart home forum. Our analysis reveals that users’ security and privacy attitudes, manifested in the levels of concern and degree to which they incorporate protective strategies, are shaped by multi-dimensional considerations. Users’ attitudes evolve according to changing contextual factors, such as adoption phases, and how they become aware of these factors. Further, we describe how online discourse about security and privacy risks and protections contributes to individual and collective attitude development. Based on our findings, we provide recommendations to improve smart home designs, support users’ attitude development, facilitate information exchange, and guide future research regarding smart home security and privacy.", "venue": "IEEE Symposium on Security and Privacy", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE Symposium on Security and Privacy (SP)", "pages": "2850-2866"}, "authors": [{"authorId": "49297766", "name": "Jingjie Li"}, {"authorId": "2089558888", "name": "Kaiwen Sun"}, {"authorId": "2224099195", "name": "Brittany Skye Huff"}, {"authorId": "2224099198", "name": "Anna Marie Bierley"}, {"authorId": "2157302397", "name": "Younghyun Kim"}, {"authorId": "34949741", "name": "F. Schaub"}, {"authorId": "1910642", "name": "Kassem Fawaz"}], "citations": [{"paperId": "b928b6f1d17283a10bc2102a7ecb5a9eba1fa832", "title": "Understanding Parents' Perceptions and Practices Toward Children's Security and Privacy in Virtual Reality"}, {"paperId": "872ecfe5415fa43b76f69d1761961b0477ada0b8", "title": "{A New Hope}: Contextual Privacy Policies for Mobile Applications and An Approach Toward Automated Generation"}, {"paperId": "09b1266e01a4341b68391df535fecdf1a3b88c3d", "title": "Smart home cybersecurity awareness and behavioral incentives"}, {"paperId": "7cc904081967e4f8184e6475c0a9f2a140d963e9", "title": "Understanding Developers Privacy Concerns Through Reddit Thread Analysis"}, {"paperId": "52e9248daa5a63fcc5c5b0e477aad44d1a0cd4fe", "title": "How Interactions Influence Users' Security Perception of Virtual Reality Authentication?"}]}
