{"paperId": "6245afbae986331e5c576608176f718545578d61", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Horizontally Distributed Inference of Deep Neural Networks for AI-Enabled IoT", "abstract": "Motivated by the pervasiveness of artificial intelligence (AI) and the Internet of Things (IoT) in the current “smart everything” scenario, this article provides a comprehensive overview of the most recent research at the intersection of both domains, focusing on the design and development of specific mechanisms for enabling a collaborative inference across edge devices towards the in situ execution of highly complex state-of-the-art deep neural networks (DNNs), despite the resource-constrained nature of such infrastructures. In particular, the review discusses the most salient approaches conceived along those lines, elaborating on the specificities of the partitioning schemes and the parallelism paradigms explored, providing an organized and schematic discussion of the underlying workflows and associated communication patterns, as well as the architectural aspects of the DNNs that have driven the design of such techniques, while also highlighting both the primary challenges encountered at the design and operational levels and the specific adjustments or enhancements explored in response to them.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "1712207554", "name": "Ivan Rodriguez-Conde"}, {"authorId": "2057451886", "name": "C. Campos"}, {"authorId": "6798652", "name": "F. F. Riverola"}], "citations": [{"paperId": "5d0bd71dfdc99d4412f2a2f057793232fbc14dd7", "title": "Multi-Agent Systems for Collaborative Inference Based on Deep Policy Q-Inference Network"}, {"paperId": "66900c09f1a7b1e0d4c033bdf34137f93a44b7f1", "title": "Validation of Instruments for the Improvement of Interprofessional Education through Educational Management: An Internet of Things (IoT)-Based Machine Learning Approach"}, {"paperId": "b0ea82bc59d8a01b944cc9f1929371992534574b", "title": "Modeling Impact of Transportation Infrastructure-Based Accessibility on the Development of Mixed Land Use Using Deep Neural Networks: Evidence from Jiang’an District, City of Wuhan, China"}, {"paperId": "66b3cc26763625f00ab11db16928f6744a27cbb2", "title": "Monitoring and Sensing of Real-Time Data with Deep Learning Through Micro- and Macro-analysis in Hardware Support Packages"}]}
