{"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "publicationVenue": {"id": "6c6fcaa9-fd25-488b-8050-995227ac671c", "name": "Symposium on Operating Systems Principles", "type": "conference", "alternate_names": ["Symp Oper Syst Princ", "SOSP"], "url": "http://sosp.org/"}, "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications", "abstract": "Researchers and practitioners care deeply about the performance and correctness of microservice applications. To investigate problematic application behavior and prototype potential improvements, researchers and practitioners experiment with different designs, implementations, and deployment configurations. We argue that a key requirement for microservice experimentation is the ability to rapidly reconfigure applications and to iteratively Configure, Build, and Deploy (CBD) new variants of an application that alter or improve its design. We focus on three core experimentation use-cases: (1) updating the design to use different components, libraries, and mechanisms; (2) identifying and reproducing problematic behaviors caused by different designs; and (3) prototyping and evaluating potential solutions to such behaviors. We present Blueprint, a microservice development toolchain that enables rapid CBD. With a few lines of code, users can easily reconfigure an application's design; Blueprint then generates a fully-functioning variant of the application under the new design. Blueprint is open-source and extensible; it supports a wide variety of reconfigurable design dimensions. We have ported all major microservice benchmarks to it. Our evaluation demonstrates how Blueprint simplifies experimentation use-cases with orders-of-magnitude less code change.", "venue": "Symposium on Operating Systems Principles", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-10-23", "journal": {"name": "Proceedings of the 29th Symposium on Operating Systems Principles"}, "authors": [{"authorId": "80141407", "name": "Vaastav Anand"}, {"authorId": "2167580032", "name": "Deepak Garg"}, {"authorId": "2248807792", "name": "Antoine Kaufmann"}, {"authorId": "2248817173", "name": "Jonathan Mace"}], "citations": []}
