{"paperId": "62646786fd62acf6da51937ad937119dabb3d907", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "BlockPres: A Novel Blockchain-Based Incentive Mechanism to Mitigate Inequalities for Prescription Management System", "abstract": "The study presents a blockchain-based incentive mechanism intended to encourage those in underserved communities to engage with healthcare services. The smart healthcare system, which is the result of the amalgamation of advanced technologies, has emerged recently and is increasingly seen as essential to meet the needs of modern society. An important part of the healthcare system is the prescription management system, but studies show that prescription affordability and accessibility play a part in creating unequal access for underserved communities. This is a form of unequal access that results in those living in underserved communities to become disengaged from accessing healthcare services. In New Zealand, the prescription management system plays a crucial role and this study seeks to address the issue by presenting the BlockPres framework, which uses a novel incentive mechanism to encourage patients to participate and engage with services in order to be rewarded. The blockchain attribute of immutability in BlockPres enhances equality and participation by providing sophisticated authorisation and authentication capabilities for healthcare providers and patients. BlockPres empowers the patient by assigning ownership or control of some patient information to the patient. A simulation is carried out using the Ethereum blockchain and the evaluation of successful transaction completion and superficial performance assessment demonstrates that the blockchain would be sufficient to cope with the needs of a prescription management system. Furthermore, for the simulation, a BlockPres Smart Contract is developed using solidity and implemented in Remix. The Ropsten network is used as the simulation environment and the initial results show that the proposed incentive mechanism mitigates unequal access.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2052557", "name": "A. Litchfield"}, {"authorId": "2108514998", "name": "Arshad Khan"}], "citations": [{"paperId": "2d0e240f223fdd2a1bfbd91729f779e240571028", "title": "Blockchain and trusted reputation assessment-based incentive mechanism for healthcare services"}, {"paperId": "75b9b958d5520c6a2b7692562161e6e78fcd90df", "title": "Incentive techniques for the Internet of Things: A survey"}, {"paperId": "a03903ed78ddfd5cde5a10a57deb64ca50eaedc0", "title": "Medical Devices Management System Based on Blockchain Technology"}]}
