{"paperId": "626688799fc99e8f14961bb2aed099ea45328752", "publicationVenue": null, "title": "A Transformer Based Classified Traffic Prediction Scheme for Energy Digital Twin Network", "abstract": "With the development of new energy technologies and business models, the operation and monitoring methods of the Energy Internet (EI) have changed. The Energy Digital Twin Network (ED TN), which integrates EI and Digital Twin (DT), has become an important innovation tool for the energy industry. DTs provide the possibility to transfer physical entities to virtual environments, as well as the ability to predict future states through DTs. Both service data and synchronous data exist in EDTN, for this reason, the periodic fluctuation of service data affects synchronous data transmission, resulting in degraded synchronization performance of EDTN. For better analysis and management, this paper proposes a transformer based classified traffic prediction (TBCTP) scheme for EDTN. Firstly, we design the data transmission architecture of EDTN based on Software Defined Network (SDN) and use the global vision and centralized control characteristics of the SDN controller to realize the intelligent control of ED TN traffic. Then, we classify short-period traffic with different characteristics so that traffic of the same class has similar characteristics. After that, we design a long-period traffic prediction model based on transformer architecture and train corresponding prediction models for different types of traffic to improve the prediction accuracy of the model. The experimental results show that TBCTP outperforms other baseline models in predicting accuracy.", "venue": "2023 IEEE International Conference on Energy Internet (ICEI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-20", "journal": {"name": "2023 IEEE International Conference on Energy Internet (ICEI)", "pages": "218-223"}, "authors": [{"authorId": "2212899542", "name": "Zongxuan Sha"}, {"authorId": "2057789", "name": "Chuanglu Sun"}, {"authorId": "2290359618", "name": "Sha Wei"}, {"authorId": "2261189229", "name": "Ru Huo"}, {"authorId": "2290134003", "name": "He Ren"}], "citations": []}
