{"paperId": "627744598849f6376dee9ad205e0a022e0045944", "publicationVenue": {"id": "ea38228f-6ed3-4222-a3ce-d963d8cc9516", "name": "Web Search and Data Mining", "type": "conference", "alternate_names": ["Web Search Data Min", "WSDM"], "url": "http://www.wikicfp.com/cfp/program?id=3158"}, "title": "Personalization in Practice: Methods and Applications", "abstract": "Personalization is one of the key applications in machine learning with widespread usage across e-commerce, entertainment, production, healthcare and many other industries. While various machine learning techniques present novel state-of-the-art advances and super-human performance year-over-year, personalization and recommender-systems applications are often late-adopters of novel solutions due to problem hardness and implementation complexity. This tutorial presents recent advances across the personalization industry and demonstrates their practical applications in real case-studies of world-leading online platforms. Key trends such as deep learning, causality and active exploration with bandits are depicted with real examples and demonstrated alongside their business considerations and implementation challenges.Rising topics like explainability, fairness, natural interfaces and content generation are covered, touching on aspects of both technology and user experience. Our tutorial relies on recent advances in the field and on work conducted at Booking.com, where we implement personalization models on one of the world's leading online travel platform.", "venue": "Web Search and Data Mining", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2021-03-08", "journal": {"name": "Proceedings of the 14th ACM International Conference on Web Search and Data Mining"}, "authors": [{"authorId": "48832237", "name": "Dmitri Goldenberg"}, {"authorId": "2051973253", "name": "Kostia Kofman"}, {"authorId": "2051972227", "name": "Javier Albert"}, {"authorId": "1395809928", "name": "Sarai Mizrachi"}, {"authorId": "2068707304", "name": "Adam Horowitz"}, {"authorId": "2638019", "name": "Irene Teinemaa"}], "citations": [{"paperId": "88be6f9d1f93cdea9356a179ecd49dd8043ff697", "title": "Personalized strategies for academic success in learning anatomy: Exploring metacognitive and technological adaptation in medical students."}, {"paperId": "d551a9741042049ada43b88fd87aac8258995b3e", "title": "Employing Large Language Models for Dialogue-Based Personalized Needs Extraction in Smart Services"}, {"paperId": "ad0ba661602663c7b9bba1f03ef45c5fe37b6ffb", "title": "A Brief Survey of Machine Learning and Deep Learning Techniques for E-Commerce Research"}, {"paperId": "f1e44f5fda6e26728d48527b9236021c02a49a10", "title": "The role of generative artificial intelligence (GAI) in customer personalisation (CP) development in SMEs: a theoretical framework and research propositions"}, {"paperId": "5d0e5799dbad7730ac34cc5da4d3e1f9ccad3f82", "title": "Workshop on Recommenders in Tourism (RecTour) 2023"}, {"paperId": "c01f212efddf815dbb3457e7ab3ad03322f0fc27", "title": "Wybrane metody wskaźnikowe w ocenie aplikacji Booking.com"}, {"paperId": "6fdc38cad2499b0fc43f6ed0ef0a0952279d5e6c", "title": "Uplift Modeling: From Causal Inference to Personalization"}, {"paperId": "e9f88b928ef8aa2c161e53cd88b18eb5cd4939ea", "title": "AI-Driven Recommendations: A Systematic Review of the State of the Art in E-Commerce"}, {"paperId": "b0ba46318d944d519a05f0ff93793e6cf8f39ff1", "title": "Progressive search personalization and privacy protection using federated learning"}, {"paperId": "392299247b5243edd0f3261690b74664fdaf97a4", "title": "Simulated Contextual Bandits for Personalization Tasks from Recommendation Datasets"}, {"paperId": "073a932d5acd4ae9f1d21507f0642c1568b691dc", "title": "Personalizing Benefits Allocation Without Spending Money: Utilizing Uplift Modeling in a Budget Constrained Setup"}, {"paperId": "7907070e0a1657272a6fbf511fd13fd3f4dbe543", "title": "Extending Open Bandit Pipeline to Simulate Industry Challenges"}, {"paperId": "5352dcd8025cce3ebe6fab928bd79572afb02dd3", "title": "A R oad - map for M ining Business Process M odels via A rtificial I ntelligence T echnique"}, {"paperId": "6a1f0ba5eacfc31494b8861bbabb08cd51f5416a", "title": "Evaluating possible classifications of websites by design type in electronic commerce"}, {"paperId": "812afdedb5cd98ff3613060ff9dcc17375287905", "title": "Assessment of site classifications according to layout type in web development"}, {"paperId": "6be66fe8908e77bc217db4ec74ea1aac80d08917", "title": "Recommender Systems for Personalized User Experience: Lessons learned at Booking.com"}, {"paperId": "69b2fa0adb990e433d361ca78a112a35a0caffca", "title": "E-Commerce Promotions Personalization via Online Multiple-Choice Knapsack with Uplift Modeling"}, {"paperId": "67ab1512b7703c06e3663f32cf0659a03520f0bc", "title": "With One Voice: Composing a Travel Voice Assistant from Repurposed Models"}, {"paperId": "06d71e213907957158f0fac1c973b13f233c431c", "title": "Putting the Role of Personalization into Context"}, {"paperId": "c367413150b9eb61e59b8b23408a5da772614661", "title": "Booking.com Multi-Destination Trips Dataset"}, {"paperId": "42c89eba6fa5ca7c409b5679b6b2f35bb61abe74", "title": "Learning to Persist: Exploring the Tradeoff Between Model Optimization and Experience Consistency"}, {"paperId": "6e7f09c4512b6a86f89a35d028bfc9f824c92085", "title": "Rumi: An Intelligent Agent Enhancing Learning Management Systems Using Machine Learning Techniques"}, {"paperId": "df383913e8c31bca330a8e5661ff80e9bb19b5e7", "title": "Democratizing Travel Personalization via Central Recommendation Platform"}, {"paperId": "7bb9d23350dbf3cce456475df7b84731716f3202", "title": "Optimization Levers for Promotions Personalization Under Limited Budget"}, {"paperId": "f3a2da629c1d5352bf5ca004b94ebdaf023d2029", "title": ": Challenges in Travel Destination Recommendation"}, {"paperId": "de874b24cf34ae2cd92ca8b6cfb0c4bd69032584", "title": "Booking.com WSDM WebTour 2021 Challenge"}]}
