{"paperId": "627fca78cef5bf5a30d37c792c36d77e1c4a1532", "publicationVenue": null, "title": "From Limitations to “Superpowers”: A Design Approach to Better Focus on the Possibilities of Virtual Reality to Augment Human Capabilities", "abstract": "Serious applications in virtual reality (VR) often imitate real environments, tasks, and interaction techniques. VR however, allows to transcend reality and augment the physical, cognitive, and perceptual capabilities of users through, for example, telekinesis. In this sense, VR offers “superpowers”, which are not always considered as central and unique elements of interaction design. In a workshop with interaction designers, we emphasized the notion of “superpowers” to think less about VR limitations to imitate reality, but more about its possibilities to augment human capabilities. Consequently, we developed a design method that explicitly introduced the concept of superpowers (e.g., X-Ray-Vision, super-memory, telekinesis) and a VR application to support exploring each superpower. We evaluated this approach with designers. They responded positively. The notion of superpowers combined with the possibility to easily experience them changed and widened their perspective: away from limitations and reality, towards possibilities and the unique experience of being in VR.", "venue": "Conference on Designing Interactive Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-28", "journal": {"name": "Proceedings of the 2021 ACM Designing Interactive Systems Conference"}, "authors": [{"authorId": "144790817", "name": "Shadan Sadeghian"}, {"authorId": "1679757", "name": "Marc Hassenzahl"}], "citations": [{"paperId": "47a5fe78cbbab35558b085d8d9e8abee183776dc", "title": "To Mimic Reality or to Go Beyond? “Superpowers” in Virtual Reality, the Experience of Augmentation and Its Consequences"}, {"paperId": "39a5d368fbda1f164fd6c385fcff48c5a5404e36", "title": "Beyond Being Real: A Sensorimotor Control Perspective on Interactions in Virtual Reality"}, {"paperId": "4b795488f86663fb093de6269f47f9978371ae69", "title": "User Experience Is All There Is"}]}
