{"paperId": "62884f2a353fc14a60e58f3d7cdfea5abd3807d3", "publicationVenue": {"id": "c0047299-4a6a-4b3f-a6f6-e89a0ab88470", "name": "GigaScience", "type": "journal", "issn": "2047-217X", "url": "https://academic.oup.com/gigascience"}, "title": "Sharing interoperable workflow provenance: A review of best practices and their practical application in CWLProv", "abstract": "Abstract Background The automation of data analysis in the form of scientific workflows has become a widely adopted practice in many fields of research. Computationally driven data-intensive experiments using workflows enable automation, scaling, adaptation, and provenance support. However, there are still several challenges associated with the effective sharing, publication, and reproducibility of such workflows due to the incomplete capture of provenance and lack of interoperability between different technical (software) platforms. Results Based on best-practice recommendations identified from the literature on workflow design, sharing, and publishing, we define a hierarchical provenance framework to achieve uniformity in provenance and support comprehensive and fully re-executable workflows equipped with domain-specific information. To realize this framework, we present CWLProv, a standard-based format to represent any workflow-based computational analysis to produce workflow output artefacts that satisfy the various levels of provenance. We use open source community-driven standards, interoperable workflow definitions in Common Workflow Language (CWL), structured provenance representation using the W3C PROV model, and resource aggregation and sharing as workflow-centric research objects generated along with the final outputs of a given workflow enactment. We demonstrate the utility of this approach through a practical implementation of CWLProv and evaluation using real-life genomic workflows developed by independent groups. Conclusions The underlying principles of the standards utilized by CWLProv enable semantically rich and executable research objects that capture computational workflows with retrospective provenance such that any platform supporting CWL will be able to understand the analysis, reuse the methods for partial reruns, or reproduce the analysis to validate the published findings.", "venue": "GigaScience", "year": 2019, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-11-01", "journal": {"name": "GigaScience", "volume": "8"}, "authors": [{"authorId": "21807894", "name": "Farah Zaib Khan"}, {"authorId": "1399487720", "name": "S. Soiland-Reyes"}, {"authorId": "1715097", "name": "R. Sinnott"}, {"authorId": "2407989", "name": "A. Lonie"}, {"authorId": "46555127", "name": "C. Goble"}, {"authorId": "144361904", "name": "M. Crusoe"}], "citations": [{"paperId": "559038f96b87b11504514d837674c341a5e0d915", "title": "Implementation of FAIR Practices in Computational Metabolomics Workflows—A Case Study"}, {"paperId": "2619ca91f4ab4ba0400ace624913504fa4f0da5e", "title": "Recording provenance of workflow runs with RO-Crate"}, {"paperId": "0bec7a0dc81576876a88f4d97ae287e1c24ade05", "title": "Perceptual and technical barriers in sharing and formatting metadata accompanying omics studies"}, {"paperId": "1f5c0e6741b1e888e3be78f26d63232106fb093e", "title": "“Be sustainable”: EOSC‐Life recommendations for implementation of FAIR principles in life science data handling"}, {"paperId": "c624ba5a6ce8782b0ff4930cf31ed8dc08183d16", "title": "NFDI4Microbiota – national research data infrastructure for microbiota research"}, {"paperId": "1eaa1c14cd18503f02d9d475f8db38ec1046651a", "title": "Containers for computational reproducibility"}, {"paperId": "7e531758fd33e764f6d80c0267eccdbf2532e40f", "title": "Automatic Reproduction of Workflows in the Snakemake Workflow Catalog and nf-core Registries"}, {"paperId": "2938a388327ca5a7b960f5259953514597be4bcd", "title": "Data journeys: Explaining AI workflows through abstraction"}, {"paperId": "f66ecec4bc5237e36e5ab4d07d079986490215b4", "title": "Facilitating bioinformatics reproducibility with QIIME 2 Provenance Replay"}, {"paperId": "6a507330f9521c1a3413ba2f4884cbb55082b392", "title": "Toward a common standard for data and specimen provenance in life sciences"}, {"paperId": "794ba58adbce4d1630bbf3e3001347c2643f9a65", "title": "Workflows Community Summit 2022: A Roadmap Revolution"}, {"paperId": "55e7a313ee40219d89c556fbd008f171dc7818c4", "title": "Provenance-enhanced Root Cause Analysis for Jupyter Notebooks"}, {"paperId": "1d0360398d374e0b9b0e4a4b69738e8452e70050", "title": "Evaluation of tools for describing, reproducing and reusing scientific workflows"}, {"paperId": "f70281aae23c8afe6dc96d679bfbfb8393c96956", "title": "A workflow reproducibility scale for automatic validation of biological interpretation results"}, {"paperId": "a704d8ef7423a7b73acadea898ad9653b6a56352", "title": "Automatic, Efficient and Scalable Provenance Registration for FAIR HPC Workflows"}, {"paperId": "0b11c38a6d938916c840e8e5576f206770fd0588", "title": "Enhancing RDM in Galaxy by integrating RO-Crate"}, {"paperId": "a6e118c0a9035e4c08e52a0b3325a3ef15bb7341", "title": "Lightweight Distributed Provenance Model for Complex Real–world Environments"}, {"paperId": "5bffa375d9920bfddd8eda07fceeb81e715f39d9", "title": "Sapporo: A workflow execution service that encourages the reuse of workflows in various languages in bioinformatics"}, {"paperId": "c4a2a2993f4e66a8266c7d621419b11935ef1b6c", "title": "A taxonomy of tools and approaches for distributed genomic analyses"}, {"paperId": "e25d0d0e368364306b45684421b8971fdda82520", "title": "Pre‐exascale HPC approaches for molecular dynamics simulations. Covid‐19 research: A use case"}, {"paperId": "a79ae6860d5aee0f65f366efcf4dff4f951ec827", "title": "BioProv - A provenance library for bioinformatics workflows"}, {"paperId": "bdb4916b235c03a8b935f87dd073837dcdf0f272", "title": "The Challenge of Reproducible ML: An Empirical Study on The Impact of Bugs"}, {"paperId": "a79103847f14839ac9183694fe070f6cc2125de2", "title": "Packaging research artefacts with RO-Crate"}, {"paperId": "b2f43a856d670dbb75b5d094175d64894bf2d97f", "title": "Evaluation of serverless computing for scalable execution of a joint variant calling workflow"}, {"paperId": "6bd0b7dd146b3e8453872975fa5aaaa9b7b54cdb", "title": "Approaches and Criteria for Provenance in Biomedical Data Sets and Workflows: Protocol for a Scoping Review"}, {"paperId": "f791dce07eb1dd9251f9bffb801d6e075091c98d", "title": "Methods included"}, {"paperId": "098ed0b505d3c106428dc29975f5addc96040b45", "title": "Design considerations for workflow management systems use in production genomics research and the clinic"}, {"paperId": "6866d5d6b9430a01a16211dbc3bd5f2135622b2c", "title": "Recommendations for the FAIRification of genomic track metadata"}, {"paperId": "bb50e8c44e783ec626351ca7471e1ede6ea37600", "title": "Can reproducibility be improved in clinical natural language processing? A study of 7 clinical NLP suites"}, {"paperId": "cb7655a0e1dcf642e930dd54ca10c0d16c8db610", "title": "Polyflow: a Polystore-compliant Mechanism to Provide Interoperability to Heterogeneous Provenance Graphs"}, {"paperId": "90b40381ce5935cf193e1bbc4bbca6b6d831b63f", "title": "Workflow Generation with wfGenes"}, {"paperId": "be736bd65e021d6601273c6919e0d6cead2c37e2", "title": "Towards FAIR protocols and workflows: the OpenPREDICT use case"}, {"paperId": "b336492cc1a8de095a57fe0684f142816f32d045", "title": "A Black-Box Fork-Join Latency Prediction Model for Data-Intensive Applications"}, {"paperId": "6801e90789bbce60ee650574dbd3fdd2a8cabe00", "title": "Landscape Analysis for the Specimen Data Refinery"}, {"paperId": "215688d9213dd96983c8a8947b2946942a79aa23", "title": "FAIRSCAPE: a Framework for FAIR and Reproducible Biomedical Analytics"}, {"paperId": "1f1297064e405bbcd7552f9d3faf401b2747b814", "title": "The role of metadata in reproducible computational research"}, {"paperId": "b8691ae58baa4019e8fac7b59e5c129b3cc4aa84", "title": "Towards FAIR principles for research software"}, {"paperId": "955cbbefb297757c306856b6d882ac1483f684e6", "title": "Fostering Scientific Meta-analyses with Knowledge Graphs: A Case-Study"}, {"paperId": "7371d751f98e04e5b629a893896f60b09706bd87", "title": "PANDAcap: a framework for streamlining collection of full-system traces"}, {"paperId": "8b523417b7916b22fc1f582158682355da92c7e2", "title": "FAIR Computational Workflows"}, {"paperId": "37974019723ac45a0cd69eb299135c4bf18e57fa", "title": "Towards FAIR protocols and workflows: The OpenPREDICT case study"}, {"paperId": "633155ae06b2367cc42d5beb21d2be85330b6200", "title": "MGnify: the microbiome analysis resource in 2020"}, {"paperId": "1e70cb66a0760bd017e524c585e847b96a2d6b81", "title": "Linking Abstract Plans of Scientific Experiments to their Corresponding Execution Traces (short paper)"}, {"paperId": "6f701547b8be2ad836ef27d1c21f4198565054a3", "title": "Tximeta: Reference sequence checksums for provenance identification in RNA-seq"}, {"paperId": "b79c177e42d9bd36b2d0d24ab0f45c71dd399808", "title": "Semantic Modelling of Plans and Execution Traces for Enhancing Transparency of IoT Systems"}, {"paperId": "ab846a89048e2380ab45159831f577c5c90a4c7b", "title": "A lightweight approach to research object data packaging"}, {"paperId": "c9d24ac34cb9d3cc015f926a2a77b4571162311c", "title": "The Workflow Trace Archive: Open-Access Data From Public and Private Computing Infrastructures"}, {"paperId": "13a90a77cd15471640df8c9f73567d204a3d98d2", "title": "Methods Included"}, {"paperId": "d756c3a48c9e6bf9409ea3543b1fb0e75fbc00a8", "title": "Methods Included"}, {"paperId": "ecd3e247f21cf0a13f1568eebd2e8430ef327fd2", "title": "Methods Included"}, {"paperId": "941bf87653ad6bcaf13ef388f206f19fefdc95cc", "title": "Methods Included"}, {"paperId": "7df9ed1768637a2aed8ab550ddf581025c0de60f", "title": "software framework with standards and international initiatives"}, {"paperId": "9097c45090d33df72f5683f46cf9ec719a8e19f4", "title": "Provenance Data Models and Assertions: A Demonstrative Approach"}, {"paperId": "0b136463cd1ea48dfb24b1d570362eea7b782f4f", "title": "UNIVERSIDADE FEDERAL DE JUIZ DE FORA INSTITUTO DE CIÊNCIAS EXATAS PROGRAMA DE PÓS-GRADUAÇÃO EM CIÊNCIA DA COMPUTAÇÃO"}, {"paperId": "1c1dd5aa1161a3429ff454f2b6d7008475382cb6", "title": "A Delayed Instantiation Approach to Template-Driven Provenance for Electronic Health Record Phenotyping"}]}
