{"paperId": "628b56504f57a2f63d3ef666548649b6fd91f46a", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Human Resources Mining for Examination of R&D Progress and Requirements", "abstract": "The amount of job advertisement data is rapidly growing, and this rich dataset is expected to have implications for the employment market, sector trajectories, and the education sector. Most significantly, human resources (HR) data has never previously been examined with the lens of tech mining for science and technology analyses. This article is the first to examine job advertisement data considering research and development (R&D) progress and requirements, and hereafter, we refer to this as HR mining. The aim of this article is to use HR mining with the purpose of R&D and human capital intelligence using the job advertisement data of Turkey for the 2015–2017 period. The method of this study follows classification as part of the preprocessing step to determine R&D, engineering, and high-tech industry-related job advertisements. Afterward, we use clustering methods to identify areas where key human capital is required, and investments are made by R&D-oriented companies. The results show that it is possible to identify sector-oriented skill requirements and that the significance of the R&D skills varies. For the case of Turkey, we can clearly show the national human capital and R&D by identifying nine key clusters that indicate R&D progress and directions.", "venue": "IEEE transactions on engineering management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-02", "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "1372-1387", "volume": "68"}, "authors": [{"authorId": "39907408", "name": "Sercan Ozcan"}, {"authorId": "2825983", "name": "C. O. Sakar"}, {"authorId": "2050665775", "name": "Metin Suloglu"}], "citations": [{"paperId": "6fe950d881def64731d7ec7c9376c0f88af05766", "title": "Fostering Synergy: Exploring the Intersection of Operations and Human Resources Management through an RF-SVM Approach"}, {"paperId": "3e40453dc7cacf1c7c232265dccaa37645779170", "title": "The Theory of Technological Response and Progress in Chaos"}, {"paperId": "fadeeffac351f83283afa23ea8f5919b741fc1d3", "title": "Mobile Edge Computing Application in Enterprise Human Resource Management Platform Based on Task Scheduling Algorithm"}, {"paperId": "280269cf6cba3eac9278a957ed2df91a3e454127", "title": "Allocation Method of Enterprise High-Quality Human Resources Based on Intelligent Big Data"}, {"paperId": "f11976bc2fbe0797a621e9c3ee873f9d70967c3d", "title": "Analysis of the Correlation between Emerging Industry Development and University Students’ Entrepreneurship Based on Big Data"}, {"paperId": "061615c0861d446578253957054b2bffadad339b", "title": "A Study of Data-Driven Enterprise Human Resource Management Model"}, {"paperId": "4c3dd21a1ad19fa544af3792e01de26bcdbda23f", "title": "Role of green data center in human resources development model"}]}
