{"paperId": "628d57603552f5b847591474c0c03b7c36932dae", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "IoTsafe, Decoupling Security From Applications for a Safer IoT", "abstract": "The use of robust security solutions is a must for the Internet of Things (IoT) devices and their applications: regulators in different countries are creating frameworks for certifying those devices with an acceptable security level. However, even for already certified devices, security protocols have to be updated when a breach is found or a certain version becomes obsolete. Many approaches for securing IoT applications are nowadays based on the integration of a security layer [e.g., using transport layer security, (TLS)], but this may result in difficulties when upgrading the security algorithms, as the whole application has to be updated. This fact may shorten the life of IoT devices. As a way to overcome these difficulties, this paper presents IoTsafe, a novel approach relying on secure socket shell (SSH), a feasible alternative to secure communications in IoT applications based on hypertext transfer protocol (HTTP and HTTP/2). In order to illustrate its advantages, a comparison between the traditional approach (HTTP with TLS) and our scheme (HTTP with SSH) is performed over low-power wireless personal area networks (6loWPAN) through 802.15.4 interfaces. The results show that the proposed approach not only provides a more robust and easy-to-update solution, but it also brings an improvement to the overall performance in terms of goodput and energy consumption. Core server stress tests are also presented, and the server performance is also analyzed in terms of RAM consumption and escalation strategies.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-22", "journal": {"name": "IEEE Access", "pages": "29942-29962", "volume": "7"}, "authors": [{"authorId": "1410347510", "name": "Jorge David de Hoz Diego"}, {"authorId": "120859004", "name": "J. Saldaña"}, {"authorId": "1398692335", "name": "J. Fernández-Navajas"}, {"authorId": "1405491296", "name": "José Ruiz-Mas"}], "citations": [{"paperId": "16383e327d7710324e330f004a86c22708b27104", "title": "A Framework for the Automation of Platform Validation for Use Cases of Wi-Fi"}, {"paperId": "564ac19d6b749a4af19941213735538518eba115", "title": "A Review on Privacy Requirements and Application Layer Security in Internet of Things (IoT)"}, {"paperId": "c504e822875c2b362a1693e6d2ba0dce7094e90a", "title": "Hybrid Internet of Things (IoT) data transmission security corresponding to device verification"}, {"paperId": "e94f5e387e8113bf661d48cde839bacfbae0013c", "title": "Decoupling Security From Applications in CoAP-Based IoT Devices"}, {"paperId": "62e8e14669d7673da972b7e599d7f66e9da86df3", "title": "The role of MAS interoperability for IoT applications: A survey on recent advances in manufacturing systems"}, {"paperId": "0ad7a8ad0d2d59ff15f0b7df85ddd479d7a0779f", "title": "BULGARIAN ACADEMY OF SCIENCES"}, {"paperId": "6b0b9fdebd144700173a1dc3f05da8819288ea1f", "title": "Scalable Asymmetric Security Mechanism for Internet of Things"}, {"paperId": "bd3aaabb2788f3467229244c0c87604585cd4cb1", "title": "Security for Data in IOT Using a New APS Elliptic Curve Light Weight Cryptography Algorithm"}]}
