{"paperId": "6295581761d8494799d7453ab41747019456f634", "publicationVenue": {"id": "f06399b1-5bc3-4c13-a8b2-5b213868843b", "name": "Investigaciones Geográficas", "type": "journal", "alternate_names": ["Investig Geográficas", "Investig Geográficas Bol Inst Geogr", "Investig Geogr", "Investigaciones Geográficas, Boletín del Instituto de Geografía", "Investigaciones Geograficas"], "issn": "0718-9575", "alternate_issns": ["0213-4691", "0188-4611"], "url": "http://www.investigacionesgeograficas.uchile.cl/", "alternate_urls": ["http://www.revistas.unam.mx/index.php/rig/issue/archive(1998-)", "http://www.investigacionesgeograficas.unam.mx/index.php/rig/index", "https://www.redalyc.org/revista.oa?id=176", "http://www.scielo.org.mx/scielo.php?lng=es&nrm=iso&pid=0188-4611&rep=&script=sci_serial", "http://www.scielo.org.mx/scielo.php?lng=en&pid=0188-4611&script=sci_serial", "https://www.redalyc.org/revista.oa?id=569", "https://dialnet.unirioja.es/servlet/revista?codigo=738", "http://www.journals.unam.mx/index.php/rig", "https://revistes.ua.es/ingeo", "https://www.sciencedirect.com/journal/investigaciones-geograficas-boletin-del-instituto-de-geografia", "https://www.investigacionesgeograficas.com/", "http://www.cervantesvirtual.com/obra/investigaciones-geograficas-0/", "http://www.investigacionesgeograficas.unam.mx/index.php/rig"]}, "title": "Mapeo del índice de estabilidad y de saturación del suelo en la cuenca del río Huehuetán, Chiapas, mediante el modelo SINMAP", "abstract": "Los deslizamientos están entre los eventos naturales más comunes que causan destrucción masiva a nivel mundial. Por ello, el estudio de sus causas, comportamiento y formas de mitigación es importante para reducir su impacto negativo. Estos se presentan con mayor frecuencia en ambientes tropicales debido a la cantidad e intensidad de la lluvia que, en combinación con el relieve escarpado, ocasionan daños a la infraestructura urbana, pecuaria, agrícola e industrial, así como, cambios en el medio ambiente e incluso la pérdida de vidas humanas. \nSe han desarrollado diversos estudios para explicar el origen y efecto de los procesos morfodinámicos asociados a los deslizamientos, pero por su complejidad, aún existe incertidumbre sobre la predicción de su incidencia. Aunque los deslizamientos son resultado de diversas interacciones, donde la morfología del relieve y la evolución de las laderas desempeñan un papel primordial, sucede que un solo factor como la precipitación, sismos, etc., es considerado el estímulo externo que los detona. \nLa cuenca del río Huehuetán, localizada en la Costa de Chiapas, es altamente susceptible a deslizamientos causados por la frecuencia de lluvias intensas. Por ello, el objetivo de este trabajo fue identificar áreas suceptibles a deslizamientos debido a la saturación del suelo, generada por la precipitación, mediante la obtención del índice de estabilidad (SI) y del índice de saturación del suelo (SSI) a traves del modelo SINMAP (Stability INdex MAPping), para emplearse como un elemento de apoyo en la planificación de asentamientos urbanos, así como, para la prevención o corrección de los deslizamientos a traves de medidas estructurales y no estructurales. \nLa cuenca del río Huehuetán se localiza en el sureste del estado de Chiapas y comprende una superficie de 319.27 km2. Esta cuenca forma parte de la Sierra Madre de Chiapas; presenta un relieve accidentado principalmente en la parte alta, sus elevaciones van de 19 a 2 690 msnm y el 83.15% de la superficie total presenta pendientes mayores al 10%. El suelo predominante es Litosol (36.63%), seguido de Andosol (28.71%); mientras que geológicamente está dominado por rocas ígneas (más del 85%) y sedimentarias. La delimitación de la cuenca fue realizada con el modelo SWAT (Soil and Water Assessment Tool) con base en el Modelo Digital de Elevaciones (MDE) de 10 m de resolución espacial y la red de drenaje obtenida del Instituto Nacional de Estadística y Geografía. \nEl inventario de deslizamientos se llevó a cabo para el periodo del año 2005 al 2021, inicialmente mediante recorridos de campo en dicha cuenca, apoyados con equipo GPS para la ubicación espacial de los polígonos de los deslizamientos; se utilizaron las imágenes de los satélites Landsat 7 y Sentinel 2A, como herramientas de apoyo para la ubicación y detección de deslizamientos mayores a 100 m2, los de menor área fueron registrados con base en los recorridos de campo y ubicados en Google Earth®. \nEl modelo SINMAP se ejecutó a partir del MDE, las propiedades mecánicas e hidrogeológicas de los suelos y el inventario de deslizamientos. Con ello, se obtuvo la clasificación de la estabilidad del terreno con base en la estimación de la distribución espacial del SI y del SSI en la cuenca del río Huehuetán. Determinando el 24.36% (77.76 km2) de la cuenca como área inestable y 75.64% (241.51 km2) como área estable, concentrándose los mayores valores de inestabilidad de laderas en la parte alta; debido a sus condiciones de relieve, tipo de suelo y estado de la cobertura vegetal. El desempeño del modelo SINMAP se evaluó comparando la distribución espacial del SI con el inventario de deslizamientos obtenido para la cuenca mediante el método de la curva ROC; mostrando una precisión de 85.60% que lo clasifica como excelente. \nEl modelo SINMAP permitió determinar el SI y el SSI de manera fácil y acertada, mismos que pueden emplearse para planeaciones urbanas y reducir los daños graves a raíz de los deslizamientos. Lo resultados obtenidos sugieren que el uso del modelo SINMAP como herramienta para el mapeo de áreas susceptibles a deslizamientos es una opción factible y que permitirá a los tomadores de decisiones realizar una planificación del crecimiento urbano mediante la identificación y zonificación de áreas vulnerables y aplicar medidas tanto estructurales y no estructurales para su control.", "venue": "Investigaciones Geográficas", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-11", "journal": {"name": "Investigaciones Geográficas"}, "authors": [{"authorId": "2087939443", "name": "A. López-Pérez"}, {"authorId": "2188417574", "name": "Gerardo Colín-García"}, {"authorId": "2188417359", "name": "Tania Eulalia Martínez-Cruz"}, {"authorId": "2188417352", "name": "Javier Manuel-Andrés"}], "citations": [{"paperId": "7ec076bf2f6ea5cb1e7cbd196fb8a8e9f66735ca", "title": "A comparative assessment and geospatial simulation of three hydrological models in urban basins"}]}
