{"paperId": "6297afbf5214fb50bfdb8c05a05219be2d912e4a", "publicationVenue": null, "title": "The Application of Downhole Vibration Factor in Drilling Tool Reliability Big Data Analytics—A Review", "abstract": "In the challenging downhole environment, drilling tools are normally subject to high temperature, severe vibration, and other harsh operation conditions. The drilling activities generate massive field data, namely field reliability big data (FRBD), which includes downhole operation, environment, failure, degradation, and dynamic data. Field reliability big data has large size, high variety, and extreme complexity. FRBD presents abundant opportunities and great challenges for drilling tool reliability analytics. Consequently, as one of the key factors to affect drilling tool reliability, the downhole vibration factor plays an essential role in the reliability analytics based on FRBD. This paper reviews the important parameters of downhole drilling operations, examines the mode, physical and reliability impact of downhole vibration, and presents the features of reliability big data analytics. Specifically, this paper explores the application of vibration factor in reliability big data analytics covering tool lifetime/failure prediction, prognostics/diagnostics, condition monitoring (CM), and maintenance planning and optimization. Furthermore, the authors highlight the future research about how to better apply the downhole vibration factor in reliability big data analytics to further improve tool reliability and optimize maintenance planning.", "venue": "ASCE-ASME J Risk and Uncert in Engrg Sys Part B Mech Engrg", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-08-14", "journal": {"name": "ASCE-ASME J Risk and Uncert in Engrg Sys Part B Mech Engrg"}, "authors": [{"authorId": "38699545", "name": "Yali Ren"}, {"authorId": "143997290", "name": "Ning Wang"}, {"authorId": "35115738", "name": "Jinwei Jiang"}, {"authorId": "2386060", "name": "Junxiao Zhu"}, {"authorId": "1815327", "name": "G. Song"}, {"authorId": "49794873", "name": "Xuemin Chen"}], "citations": [{"paperId": "202fafa7c465a890928ab78b5a57b33f38d8e3d4", "title": "Data optimization for the knowledge bases in the oil and gas Monitoring-While-Drilling (MWD) Systems"}, {"paperId": "e051ddd1c6aea502c0f0f34b5a1d8b169dc82c27", "title": "Research status and prospect of wear and aging on hydraulic rubber sealing materials"}, {"paperId": "079e271f3da9eeecc17cd4c9194380776ccebac1", "title": "The Particle Breakage Effect on Abrasive Wear Process of Rubber/Steel Seal Pairs under High/Low Pressure"}, {"paperId": "e1460d8582da6790f1f722f705c6c8123c9e9070", "title": "Development of Monitoring and Forecasting Technology Energy Efficiency of Well Drilling Using Mechanical Specific Energy"}, {"paperId": "0573e8c2023935a4b49eb24a36d61e73e38253f1", "title": "Full waveform vibration and shock measurement tool for measurement-while-drilling"}, {"paperId": "fc3b5e996af57b8e490916305cd0b14a3cf62225", "title": "Deployment of Downhole Mechanics Measurement System and Drilling Dynamics Modelling to Enhance Overall Drilling Performance Under Complete Mud Losses Environment"}, {"paperId": "a5134bb6c967e606d0ca5b54226cc9bb9733d47f", "title": "Transitions of Wear Characteristics for Rubber/Steel Seal Pairs During the Abrasive Wear Process"}, {"paperId": "a34fad237684fc16a28d5f5787d15b4146c8e99b", "title": "An overview of torque meters and new devices development for condition monitoring of mining machines"}, {"paperId": "017a7cfedcb4e3b4aca5877697b7479c6553569a", "title": "Effect of Well Orientation on Oil Recovery from Waterflooding in Shallow Green Reservoirs: A Case Study from Central Africa"}, {"paperId": "480c0253119dc91905ff4a7f2b8f8af01822fa23", "title": "A Self-Powered Rotating Speed Sensor for Downhole Motor Based on Triboelectric Nanogenerator"}, {"paperId": "cc54b908de58a459766c95023ec75515feb97901", "title": "Drill Bit Deformations in Rotary Drilling Systems under Large-Amplitude Stick-Slip Vibrations"}, {"paperId": "4e48c33c518892adc10d474cdfce4d5ab236a4e3", "title": "AI-Driven Maintenance Support for Downhole Tools and Electronics Operated in Dynamic Drilling Environments"}, {"paperId": "471a9aaab4dd55f4e8392e4c9ca4183869ed3f52", "title": "Intelligent Fault Detection Scheme for Drilling Process"}, {"paperId": "387be07524a995d087f1094eea43bea8e79eeeea", "title": "Predictive big data analytics for drilling downhole problems: A review"}, {"paperId": "d83d0190c97ad4681d05141bde5bb452598699f7", "title": "The Particle Breakage E ﬀ ect on Abrasive Wear Process of Rubber/Steel Seal Pairs under High/Low Pressure"}]}
