{"paperId": "629c6306483f2c70ecceab50f3b45cb3efd1988d", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Healthcare Data Quality Assessment for Cybersecurity Intelligence", "abstract": "Considering the efficiency and security of healthcare data processing, indiscriminate data collection, annotation, and transmission are unwise. In this article, we propose the normalized double entropy (NDE) method to assess image data quality in the form of metatask. In specific, the probability entropy and distance entropy are both adopted and normalized to evaluate the data quality. The experimental results show the stable ability of the NDE to distinguish good and bad data in terms of information contribution. Furthermore, the model's diagnostic performances driven by selected good and bad data are compared, and a clear gap exists between them under the premise of the same amount of data. Screening 70% of the dataset can achieve almost the same accuracy as that based on all data. This article focuses on healthcare data quality and data redundancy and provides a practical evaluation tool to facilitate the identification and collection of valuable data, which is beneficial to improve efficiency and protect cybersecurity in healthcare systems.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "841-848", "volume": "19"}, "authors": [{"authorId": "2154900466", "name": "Yang Li"}, {"authorId": "3021550", "name": "Jiachen Yang"}, {"authorId": "2157409233", "name": "Zhuo Zhang"}, {"authorId": "7797839", "name": "Jiabao Wen"}, {"authorId": "152934160", "name": "P. Kumar"}], "citations": [{"paperId": "4daed329eacb6d8828aee2dafcbfbe7126bb4673", "title": "Accurate Recognition of Jujube Tree Trunks Based on Contrast Limited Adaptive Histogram Equalization Image Enhancement and Improved YOLOv8"}, {"paperId": "a83caabeaeefc306bf085e430d23750a6b9b9abb", "title": "Data-Driven Deepfake Forensics Model Based on Large-Scale Frequency and Noise Features"}, {"paperId": "dbd5345c6b270518023c7d1c4f36d8d4999f70ed", "title": "WILDetect: An intelligent platform to perform airborne wildlife census automatically in the marine ecosystem using an ensemble of learning techniques and computer vision"}, {"paperId": "92a63c2b4aa60106d1ed6dfc0c1f1890daafac0a", "title": "A two-stage data quality improvement strategy for deep neural networks in fault severity estimation"}, {"paperId": "5d3161eff0c17c5ab4526d36555e7bb8d0871682", "title": "AUV Path Planning Considering Ocean Current Disturbance Based on Cloud Desktop Technology"}, {"paperId": "14bdffbf60e8b3d4afb0dbb1f40f2290e93cab1c", "title": "An Optimized Pipeline for the Processing of Healthcare Data towards the Creation of Holistic Health Records"}, {"paperId": "fda7e30938c6f1659930ac475fef55387b78946e", "title": "Cybersecurity in health sector: a systematic review of the literature"}, {"paperId": "89ed11fcd826ac8215ccc59fd393267866dca3cf", "title": "Sustainable Irrigation of Pipeline Fluid Flow Rate Regulation Based on Traveling Wave Magnetic Field"}, {"paperId": "a9594e4ba82c4006879717051cbb98ff3cd935d5", "title": "Explainable human‐in‐the‐loop healthcare image information quality assessment and selection"}, {"paperId": "33fb87e4230d05ff46942f984faa2e50421e536f", "title": "Efficient data-centric pest images identification method based on Mahalanobis entropy for intelligent agriculture"}, {"paperId": "067ac867935d180e3652a11c02bfb727b75ba138", "title": "High-information data-centric weed images data identification system based on triple filter for smart agriculture"}, {"paperId": "b3636aea1817f8a371d4d566c497b8699ff2df5d", "title": "Object detection and localization algorithm in agricultural scenes based on YOLOv5"}, {"paperId": "3656908219859eb72095d93ddd247c3ea0f8f89b", "title": "Data-driven few-shot crop pest detection based on object pyramid for smart agriculture"}, {"paperId": "6f21691383614ef9e4f50fe474a2804723bf48d4", "title": "Towards insighting cybersecurity for healthcare domains: A comprehensive review of recent practices and trends"}, {"paperId": "73ce58abadd9f9388db435eec6209fde3df4b23f", "title": "Efficient data-driven behavior identification based on vision transformers for human activity understanding"}, {"paperId": "35af77760d6c6a1418118ec20c70f59d291716e4", "title": "Data-efficient crop pest recognition based on KNN distance entropy"}, {"paperId": "ff59814fc6055cdf4a8ce909fbde39c4bd87004a", "title": "Guest Editorial: Cybersecurity Intelligence in the Healthcare System"}, {"paperId": "6063bd847e2606a5d835c4de58a484efce70e6d2", "title": "An Advanced Big Data Quality Framework Based on Weighted Metrics"}, {"paperId": "a0ecd292413a2ff73a09bf2ed4e5bbd9b36aacd4", "title": "No-Reference Quality Assessment of Stereoscopic Video Based on Temporal Adaptive Model for Improved Visual Communication"}, {"paperId": "ee9fd8bb1afa087d4c576980722795195c0f666b", "title": "Data quality assessment and analysis for pest identification in smart agriculture"}, {"paperId": "8f3992fed0f64561ded475f541921bd1f58b5d1d", "title": "A DBULSTM-Adaboost Model for Sea Surface Temperature Prediction"}, {"paperId": "45a36b2b95335d438931782436d20e5ecddbd720", "title": "How cybersecurity influences fraud prevention: An empirical study on Jordanian commercial banks"}, {"paperId": "daa819e19b7950cc9d7d41e0d33cec8bc3df480b", "title": "CFNet: An Eigenvalue Preserved Approach to Multiscale Building Segmentation in High-Resolution Remote Sensing Images"}, {"paperId": "c5060f80dd82f10239c75544d1fe75c0134e837c", "title": "Expert Systems With Applications"}, {"paperId": "3c6a753355517ba3169248b24505f942396fac86", "title": "Semisupervised Few-Shot Remote Sensing Image Classification Based on KNN Distance Entropy"}, {"paperId": "a9c239bb8cb692fb5089c85e9e51e95038903910", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
