{"paperId": "629da7c83d9dcaa1f615bb44e57dbfe1d4d08041", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Offloading Using Traditional Optimization and Machine Learning in Federated Cloud–Edge–Fog Systems: A Survey", "abstract": "The huge amount of data generated by the Internet of Things (IoT) devices needs the computational power and storage capacity provided by cloud, edge, and fog computing paradigms. Each of these computing paradigms has its own pros and cons. Cloud computing provides enhanced data storage and computing power but causes high communication latency. Edge and fog computing provide similar services with lower latency but limited capacity, capability, and coverage. A single computing paradigm cannot fulfill all the requirements of IoT devices and a federation between them is needed to extend their capacity, capability, and services. This federation is beneficial to both subscribers and providers and also reveals research issues in traffic offloading between clouds, edges, and fogs. Optimization has traditionally been used to solve the problem of traffic offloading. However, in such a complex federated system, traditional optimization cannot keep up with the strict latency requirements of decision-making, ranging from milliseconds to sub-seconds. Machine learning approaches, especially reinforcement learning, are consequently becoming popular because they could quickly solve offloading problems in dynamic environments with some unknown information. This study provides a novel federal classification between cloud, edge, and fog and presents a comprehensive research roadmap on offloading for different federated scenarios. We survey the relevant literature on the various optimization approaches used to solve this offloading problem and compare their salient features. We then provide a comprehensive survey on offloading in federated systems with machine learning approaches and the lessons learned as a result of these surveys. Finally, we outline several directions for future research and challenges that have to be faced in order to achieve such a federation.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "1199-1226", "volume": "25"}, "authors": [{"authorId": "2379433", "name": "Binayak Kar"}, {"authorId": "9698973", "name": "Widhi Yahya"}, {"authorId": "1682210", "name": "Ying-Dar Lin"}, {"authorId": "2112249036", "name": "Asad Ali"}], "citations": [{"paperId": "9f71c0968322585d41aa1523f896eb6f62d2860e", "title": "QoS-aware offloading policies for serverless functions in the Cloud-to-Edge continuum"}, {"paperId": "dc9a06669230aaf19ea5ac37dc64236bf9116857", "title": "SMT-as-a-Service for Fog-Supported Cyber-Physical Systems"}, {"paperId": "535ce31e6f5d2e4a32142075375798090dd6ff65", "title": "Joint optimization of multi-dimensional resource allocation and task offloading for QoE enhancement in Cloud-Edge-End collaboration"}, {"paperId": "c8e73fe1d884ff06153b91d7317b8001b8473576", "title": "Multi-Criteria Optimization of Application Offloading in the Edge-to-Cloud Continuum"}, {"paperId": "3d5a036fea4b55ad8a53631db2f2db7d6c6aa6ba", "title": "Ellipsoidal Trajectory Optimization for Minimizing Latency and Data Transmission Energy in UAV-Assisted MEC Using Deep Reinforcement Learning"}, {"paperId": "19eb6e5b743e29628edd91dbad186f16f8ea515e", "title": "DDPG: Cloud Data Centre Hybrid Optimisation for Virtual Machine Migration and Job Scheduling"}, {"paperId": "bc94d32343acaa681c30c1016c6eca52757720af", "title": "Federated Learning: A Cutting-Edge Survey of the Latest Advancements and Applications"}, {"paperId": "210f07ce1e16717c8ffdf3f48c86194afbb6c3b5", "title": "Cost optimization of cloud-edge-fog federated systems with bidirectional offloading: one-hop versus two-hop"}, {"paperId": "d92e447a76cf69367fc38939135c26fbd3a700b4", "title": "A Review of Deep Reinforcement Learning in Serverless Computing: Function Scheduling and Resource Auto-Scaling"}, {"paperId": "05e3ad22e92e84031e953b924c9cc76257e2e7c4", "title": "Deep Reinforcement Learning-based Task Offloading in MEC for energy and resource-constrained devices"}, {"paperId": "f3d798031cdcc6910c37a964eb44749364caaf21", "title": "A coordinates-based hierarchical computing framework towards spatial data processing"}, {"paperId": "086ea0fc068d7811cd646e315708e8d46f21a0cb", "title": "Evolutionary Swarming Particles To Speedup Neural Network Parametric Weights Updates"}, {"paperId": "8ee2afb199f2f144e6bc71df9fba830cd2a336a7", "title": "An Efficient Hybrid Scheduling Framework for Optimal Workload Execution in Federated Clouds to Maintain Performance SLAs"}, {"paperId": "a89386acad1d07de645053a79a0f4f4b25e1374f", "title": "A Survey of Internet of Things and Cyber-Physical Systems: Standards, Algorithms, Applications, Security, Challenges, and Future Directions"}, {"paperId": "79d8dff82a79aa5465722e8d0d07b440754904b6", "title": "Optimal Network Selection using Optimization Algorithm"}, {"paperId": "2035d8ca38e0ee6ce5b10ca28f1ef9067f236bb8", "title": "Availability-aware multi-component V2X application placement"}, {"paperId": "0781079e5cddd3f54db9cf1d61b43f78a150f0ba", "title": "Formal Models for the Energy-Aware Cloud-Edge Computing Continuum: Analysis and Challenges"}, {"paperId": "87684c423073e2dfca7157ab70b5f34f3da82ca5", "title": "Adaptive Federated Pruning in Hierarchical Wireless Networks"}, {"paperId": "1bf18508fd36a76a726250c7f7630656f8ca0b62", "title": "Cost optimization of omnidirectional offloading in two-tier cloud-edge federated systems"}, {"paperId": "8d40cfd62164bde55ab87ea86642e23b97f666ce", "title": "Toward Cooperative Federated Learning Over Heterogeneous Edge/Fog Networks"}, {"paperId": "927a136fddb57ad78aceea942926b1a6749ba525", "title": "Efficient intrusion detection toward IoT networks using cloud-edge collaboration"}, {"paperId": "7a5fc395321777b1a87805e7b6e808cac98a1cf4", "title": "Attribute-Based Management of Secure Kubernetes Cloud Bursting"}, {"paperId": "1c31fb880b5ca17d37e5ec6df15ca384ca36a68e", "title": "DeepMist: Toward Deep Learning Assisted Mist Computing Framework for Managing Healthcare Big Data"}, {"paperId": "401ae6380cf7bf6a739f0de0767b4bfc571ecced", "title": "Deep Reinforcement Learning-Based Computation Offloading in UAV Swarm-Enabled Edge Computing for Surveillance Applications"}, {"paperId": "436be91d77ee1ea0bd734c977c1623023b710b47", "title": "An Improved Genetic Algorithm with Chromosome Replacement and Rescheduling for Task Offloading"}]}
