{"paperId": "62a70cf345716ef72cd9caeb38f8cd038ed48271", "publicationVenue": {"id": "5a90b886-b837-4593-99ff-6b846464d5f8", "name": "International Conference on Advances in Databases, Knowledge, and Data Applications", "type": "conference", "alternate_names": ["Int Conf Adv Database Knowl Data Appl", "Databases, Knowledge, and Data Applications", "DBKDA", "Database Knowl Data Appl"]}, "title": "A Novel Approach to User Involved Big Data Provenance Visualization", "abstract": "We are living in the “big data” age. In many ways, big data is equivalent to complexity or mess. Extracting relevant information from any complex environment is a challenging but necessary task required in every scientific field. An assortment of graphs, figures, and charts have been developed to visualize n-dimensional data since the early ages of science. In the recent past, the number of dimensions in a visualization were limited by computational factors. Visualizing n-dimension is difficult but achievable by using data projection and reduction methods. Unfortunately, these methods often introduce ambiguities and inaccuracies, which can subtly corrupt results. Data provenance chronicles the core life cycle of a data set, which includes data source and creation processes, accounts for many of the processing techniques that a data set is subject to, like debugging, auditing and quality control. Additionally, data protection mechanisms such as data access control and authenticity valuation methods are also tracked by provenance. In this paper, we introduce an effective method to visualize and analyze semantic provenance data by adhering to the Human Computer Interaction principles. Our proposed data provenance visualization system involves the user in the visualization process. By capturing and analyzing a user’s attentiveness and perception level, we develop a provenance visualization system with specific visualization types and methodologies. Keywords-big data; provenance; visualization; open provenance model (OPM); human machine interface(HMI).", "venue": "International Conference on Advances in Databases, Knowledge, and Data Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-05-21", "journal": {"name": "", "pages": "10-15", "volume": ""}, "authors": [{"authorId": "116229991", "name": "Ilkay Melek Yazici"}, {"authorId": "145970294", "name": "M. Aktaş"}, {"authorId": "1739667", "name": "Mehmet Gokturk"}], "citations": [{"paperId": "780c0629ede0e173f3d885e76ac81f446b75c7da", "title": "Big social data provenance framework for Zero-Information Loss Key-Value Pair (KVP) Database"}]}
