{"paperId": "62ac932c66b0518e81edcd05e794da8d8e1e0832", "publicationVenue": {"id": "cb47cdd0-0786-4132-8967-6beb4dd3480a", "name": "Journal of Education and Social Studies", "type": "journal", "alternate_names": ["J Educ Soc Stud"], "issn": "2789-8067", "url": "https://www.scienceimpactpub.com/journals/index.php/jess"}, "title": "Unearthing the Synergy of Entrepreneurial Skills, Smallholder Farming, and High-Value Agriculture: A Case Study from Punjab, Pakistan", "abstract": "Entrepreneurship is a key to the improvement in the quality of individuals, households, and communities viz a viz sustained economic growth of the country. Smallholder farmers’ entrepreneurship is the response to new opportunities to gain economic gains rather than subsistence agriculture. For example, to grow High-Value Agricultural (HVA) crops rather than conventional crops. The present study aims to assess the entrepreneurial characteristics of smallholders in the Punjab Province of Pakistan. For this purpose, cross-sectional data of 450 farmers were collected through a well-designed questionnaire. Data were analyzed by using simple statistics and inferential statistics. The probit model results show a positive significant impact of education, prior experience, risk aversion, knowledge and skills about crops, and self-actualization on the opportunity exploitation by the entrepreneurial HVA farmers. The finding of the factor analysis shows three important groups labeled as marketing, policy, and institutional support in the cultivation of HVA crops. Moreover, the outcomes of the multiple regression analysis reveal that emphasizing technological opportunities provides a novel viewpoint for entrepreneurial HVA farmers. Even in the absence of modern technological innovations, these farmers can still identify and capitalize on technological opportunities. Therefore, to foster entrepreneurship in HVA farming, it is suggested that the accessibility of improved seed varieties of HVA crops and access to market intelligence should be made more favorable for entrepreneurs.", "venue": "Journal of Education and Social Studies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-29", "journal": {"name": "Journal of Education and Social Studies"}, "authors": [{"authorId": "95160736", "name": "M. Naseer"}, {"authorId": "2277044858", "name": "Shoaib Akhtar"}, {"authorId": "2277075964", "name": "Sajid Karim"}, {"authorId": "2277058802", "name": "Muhammad Ali Imran"}, {"authorId": "2277073311", "name": "Muhammad Shoaib Naseer"}, {"authorId": "2090841700", "name": "Zarqa Khalid"}, {"authorId": "2238853952", "name": "Iqbal Javed"}], "citations": []}
