{"paperId": "62bf74289b5a5682bfbfec00328363298abbc74a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Defect Detection of Subway Tunnels Using Advanced U-Net Network", "abstract": "In this paper, we present a novel defect detection model based on an improved U-Net architecture. As a semantic segmentation task, the defect detection task has the problems of background–foreground imbalance, multi-scale targets, and feature similarity between the background and defects in the real-world data. Conventionally, general convolutional neural network (CNN)-based networks mainly focus on natural image tasks, which are insensitive to the problems in our task. The proposed method has a network design for multi-scale segmentation based on the U-Net architecture including an atrous spatial pyramid pooling (ASPP) module and an inception module, and can detect various types of defects compared to conventional simple CNN-based methods. Through the experiments using a real-world subway tunnel image dataset, the proposed method showed a better performance than that of general semantic segmentation including state-of-the-art methods. Additionally, we showed that our method can achieve excellent detection balance among multi-scale defects.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2116560691", "name": "An Wang"}, {"authorId": "3470264", "name": "Ren Togo"}, {"authorId": "144392699", "name": "Takahiro Ogawa"}, {"authorId": "144029207", "name": "M. Haseyama"}], "citations": [{"paperId": "17f982d2b27b84a555e099feec3b6b75df231f11", "title": "Toward enhancing concrete crack segmentation accuracy under complex scenarios: a novel modified U-Net network"}, {"paperId": "ce84a95a710c54265a571029d2693442719771e9", "title": "Deep Learning for Automated Visual Inspection in Manufacturing and Maintenance: A Survey of Open- Access Papers"}, {"paperId": "20625730afca03ea00cf4c4fc7e778d410d494b3", "title": "MFF-YOLO: An Accurate Model for Detecting Tunnel Defects Based on Multi-Scale Feature Fusion"}, {"paperId": "903ef64eb70e8f3634166005a5011e9e4578bbc0", "title": "Efficient segmentation of water leakage in shield tunnel lining with convolutional neural network"}, {"paperId": "e9d84c966eb88789ab3177f7dcb4794faabd9a5c", "title": "HoloForkNet: Digital Hologram Reconstruction via Multibranch Neural Network"}, {"paperId": "7d9ebfe079973b418dcf87355427fef6e44114ef", "title": "LUVS-Net: A Lightweight U-Net Vessel Segmentor for Retinal Vasculature Detection in Fundus Images"}, {"paperId": "503bd384761779213d14f82b3f2ff98bedeeca99", "title": "Subway Water Leakage Detection Based on Improved deeplabV3+"}, {"paperId": "886961b589a7ea7c3110a77631fe4a88f1ae3f77", "title": "An Intelligent Solution for Automatic Garment Measurement Using Image Recognition Technologies"}]}
