{"paperId": "62c833b1548e44bc4c7c59c84c353625556ba060", "publicationVenue": null, "title": "Hate Speech Detection Using Natural Language Processing: Applications and Challenges", "abstract": "The internet has become a common platform for everyone to share their ideas and opinions. The user has freedom to post whatever he/she likes in social networking and blogging sites. However, sometimes the content when directed towards certain group of individuals with an intention to incite hate or discrimination, causes a turmoil in the society. Such content is known as hate speech. Hate speech can be a serious problem to peace and harmony in the society. There are instances where hate speech have led to social unrest and extremism. Thus, hate speech in the internet needs to be monitored. In this paper, we discuss the relevant works done in the field of hate speech detection. Different types of hate speech like racism, sexism, religious hate speech, etc. and the various methods proposed to tackle them are discussed. Further, we identify the challenges and propose the solutions to challenges in hate speech detection in the public internet sphere.", "venue": "2021 5th International Conference on Trends in Electronics and Informatics (ICOEI)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-06-03", "journal": {"name": "2021 5th International Conference on Trends in Electronics and Informatics (ICOEI)", "pages": "1302-1308"}, "authors": [{"authorId": "14456434", "name": "A. Parihar"}, {"authorId": "1978790638", "name": "Surendrabikram Thapa"}, {"authorId": "1992816786", "name": "Sushruti Mishra"}], "citations": [{"paperId": "a6f0813f041b979de102f3765e46b35bd039ca66", "title": "A Proposal of Naturalistic Software Development Method"}, {"paperId": "f83c94c671dae6ffdc21826d0f80a64154757130", "title": "Z-AGI Labs at ClimateActivism 2024: Stance and Hate Event Detection on Social Media"}, {"paperId": "bc6b616d571b09756de76c1711f6435790aa5678", "title": "Bryndza at ClimateActivism 2024: Stance, Target and Hate Event Detection via Retrieval-Augmented GPT-4 and LLaMA"}, {"paperId": "f0c92b6eb81470557246e52f50a6a10970bdb498", "title": "MasonPerplexity at ClimateActivism 2024: Integrating Advanced Ensemble Techniques and Data Augmentation for Climate Activism Stance and Hate Event Identification"}, {"paperId": "e7da5a734b084491d2060e9d7fbe2b336aa4ad7a", "title": "Technological Solutions to Online Toxicity: Potential and Pitfalls"}, {"paperId": "a48ec3c0d50221917c2a8576ff2fbf1c08d8042b", "title": "Lexical Squad@Multimodal Hate Speech Event Detection 2023: Multimodal Hate Speech Detection using Fused Ensemble Approach"}, {"paperId": "d2910d29c4017f4770937141e9570d9f7b344241", "title": "GUI: An Interface for Hate Speech Detection using NLP Technique"}, {"paperId": "841ddbc1cd7e0a699a9f5b45d243e54e82d639c5", "title": "ARC-NLP at Multimodal Hate Speech Event Detection 2023: Multimodal Methods Boosted by Ensemble Learning, Syntactical and Entity Features"}, {"paperId": "479a70813e47cb18ccad4726954c6b25e193eaee", "title": "Uncovering Political Hate Speech During Indian Election Campaign: A New Low-Resource Dataset and Baselines"}, {"paperId": "c4c35baa1eb4b65a86f83bf1733430a4f51e4b4c", "title": "CrisisHateMM: Multimodal Analysis of Directed and Undirected Hate Speech in Text-Embedded Images from Russia-Ukraine Conflict"}, {"paperId": "375fc5e4bfcaf08cbe96d7ca4321a39f4785add3", "title": "AAST-NLP at Multimodal Hate Speech Event Detection 2024 : A Multimodal Approach for Classification of Text-Embedded Images Based on CLIP and BERT-Based Models."}, {"paperId": "e4d5b74c6efd33feab22e8a3b96cda9a63b7041a", "title": "Extended Multimodal Hate Speech Event Detection During Russia-Ukraine Crisis - Shared Task at CASE 2024"}, {"paperId": "885d29a471fd32df9356710be352db62c9c2eafe", "title": "HAMiSoN-Generative at ClimateActivism 2024: Stance Detection using generative large language models"}, {"paperId": "e5533686c78658cd5f2b642d845abf94f903841d", "title": "HAMiSoN-MTL at ClimateActivism 2024: Detection of Hate Speech, Targets, and Stance using Multi-task Learning"}, {"paperId": "80ac11914236cc6ace7519cf9eb8db96eee68d26", "title": "AAST-NLP at ClimateActivism 2024: Ensemble-Based Climate Activism Stance and Hate Speech Detection : Leveraging Pretrained Language Models"}, {"paperId": "e0a1a57908ba27d7611dc14cfcffc4545ef84ccf", "title": "HAMiSoN-Ensemble at ClimateActivism 2024: Ensemble of RoBERTa, Llama 2, and Multi-task for Stance Detection"}, {"paperId": "3eadbac1e75527c44e9792a11a7194e2080979b1", "title": "NLPDame at ClimateActivism 2024: Mistral Sequence Classification with PEFT for Hate Speech, Targets and Stance Event Detection"}, {"paperId": "1ad12869bb6107ade5977fcd8e564a3f69aa6b70", "title": "JRC at ClimateActivism 2024: Lexicon-based Detection of Hate Speech"}, {"paperId": "293148f4632b9789ca8a5c61abe6adf77a5809db", "title": "ARC-NLP at ClimateActivism 2024: Stance and Hate Speech Detection by Generative and Encoder Models Optimized with Tweet-Specific Elements"}, {"paperId": "ce023fa5f8b6a5d847663819e603086a21566845", "title": "CSECU-DSG@Multimodal Hate Speech Event Detection 2023: Transformer-based Multimodal Hierarchical Fusion Model For Multimodal Hate Speech Detection"}, {"paperId": "9f10b639dc9073f6c30a3b356c98aa15ad5796c8", "title": "Ometeotl@Multimodal Hate Speech Event Detection 2023: Hate Speech and Text-Image Correlation Detection in Real Life Memes Using Pre-Trained BERT Models over Text"}, {"paperId": "efb8ae9e6d4c414130721e8ab7b20680f321d976", "title": "SSN-NLP-ACE@Multimodal Hate Speech Event Detection 2023: Detection of Hate Speech and Targets using Logistic Regression and SVM"}, {"paperId": "bf765774710c7a5b0041d79bd58ce101eb89e9e2", "title": "Multimodal Hate Speech Event Detection - Shared Task 4, CASE 2023"}, {"paperId": "b8960a7a5582755505181bd8b7a1d6d40f4db006", "title": "IIC_Team@Multimodal Hate Speech Event Detection 2023: Detection of Hate Speech and Targets using Xlm-Roberta-base"}, {"paperId": "52f924d2889a1343adb1faeea3ff8475978f5992", "title": "A Multi-Modal Dataset for Hate Speech Detection on Social Media: Case-study of Russia-Ukraine Conflict"}]}
