{"paperId": "62ca96e8aef4fb4dcb03118fee32a547380eafc0", "publicationVenue": null, "title": "A Spatial Join Algorithm Based on a Non-uniform Grid Technique over GPGPU", "abstract": "Grid-based techniques are well-suited for spatial join algorithms over General Purpose Graphic Processing Unit (GPGPU) architectures because of their non-hierarchical structure. However, these techniques are well-established years before the existence of GPU computing. As a result, they do not fully take advantage of many-core architectures. Last year, we had introduced a spatial join GPU system based on discarding even those cross-layer pairs of polygons whose Minimum Bounding Rectangles (MBRs) intersect but their rectangular intersection does not contain edges from both layers. These MBR intersections are called Common MBRs. In this extended abstract, we briefly introduce CMF-Grid: a non-uniform GPU-based grid technique over such Common MBRs, that can be used in polygonal spatial join operations such as overlay, edge-intersection etc. to significantly reduce their computationally-extensive refinement phase workload. Based on our experimental results on real datasets, CMF-Grid can cut down the refinement phase workload by more than 30, 000 times that of all-to-all algorithms and it improves upon its predecessor, CMF filter, by 700 times. Our upgraded spatial join system with ST_intersect predicate is able to process more than 600, 000 polygons with more than 2 billions edges on a single GPU in less than a second end-to-end processing time that is 225% time improvement compared to GCMF, the state of the art GPU-based system. The system also achieves up to 200-fold end-to-end speedup versus the best optimized sequential routines of GEOS C++ library as well as PostgreSQL spatial database with PostGIS.", "venue": "SIGSPATIAL/GIS", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-11-07", "journal": {"name": "Proceedings of the 25th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "2475139", "name": "D. Aghajarian"}, {"authorId": "1710248", "name": "S. Prasad"}], "citations": [{"paperId": "3b5325634156f6128cb6b68cc93690d70165e111", "title": "GridMesa: A NoSQL-based big spatial data management system with an adaptive grid approximation model"}, {"paperId": "75e9eee522c8c43fba967e82cf7a8a9592095df6", "title": "APRIL: Approximating Polygons as Raster Interval Lists"}, {"paperId": "4b085b3878436f32b2c432491f5512be90f1a2eb", "title": "Raster Intervals: An Approximation Technique for Polygon Intersection Joins"}, {"paperId": "c798142783ec8996332be78bfee850a92d02a2bd", "title": "SPADE: GPU-Powered Spatial Database Engine for Commodity Hardware"}, {"paperId": "c0b0b8e574f20712765ea6be0030e2189814dd78", "title": "GPU-Powered Spatial Database Engine for Commodity Hardware: Extended Version"}, {"paperId": "124b7b7134ee5feab97b2187390c04eaf06d51b2", "title": "Efficient Filters for Geometric Intersection Computations using GPU"}, {"paperId": "7ce5a7f78ef53787736c56447a222b325cfc140f", "title": "Tile‐based polygon overlay of vector data in a virtual globe"}, {"paperId": "4125f7e770d6cbb2dcba159f6156f599456f9fef", "title": "Parallel Grid-Based Colocation Mining Algorithms on GPUs for Big Spatial Event Data"}, {"paperId": "ba2700c839af72ae9e2e730e703ba2eee1f8b5fd", "title": "Hierarchical Filter and Refinement System Over Large Polygonal Datasets on CPU-GPU"}, {"paperId": "fee3181a72d9286d4fe906e88597c7671c0af7f5", "title": "Large-scale 3D geospatial processing made possible"}, {"paperId": "381864fb66bb10b9a02eb75ea0675f176f8263bd", "title": "Parallel co-location mining with MapReduce and NoSQL systems"}, {"paperId": "47807ac3b8da14c2ab7d46f48a72d00af5f4f3d2", "title": "OpenACC Based GPU Parallelization of Plane Sweep Algorithm for Geometric Intersection"}, {"paperId": "18b3c70779dd62387a9957ca328eda5114a6dd97", "title": "Hierarchical Filter and Refinement System Over Large Polygonal Hierarchical Filter and Refinement System Over Large Polygonal Datasets on CPU-GPU Datasets on CPU-GPU"}, {"paperId": "48ee0ff5de5832fd604edcec7426797eb90d3e1f", "title": "Adaptive Main-Memory Indexing for High-Performance Point-Polygon Joins"}, {"paperId": "5718f301636879f7b622bee0ce1e75824c750871", "title": "Advancing Analytical Database Systems"}, {"paperId": "fc0fa9049fad36aec384658c1007b6a265060074", "title": "A Heterogeneous High Performance Computing Framework For Ill-Structured Spatial Join Processing"}, {"paperId": "9d9eb5ca23f77dae01f4ea68f9bdc44c18b2021f", "title": "Exploring Parallel Efficiency and Synergy for Max-P Region Problem Using Python"}]}
