{"paperId": "62d3046edbda4d6ff174abb8690995f1cd3856c2", "publicationVenue": null, "title": "Stable Iterative Variable Selection", "abstract": "Abstract Motivation The emergence of datasets with tens of thousands of features, such as high-throughput omics biomedical data, highlights the importance of reducing the feature space into a distilled subset that can truly capture the signal for research and industry by aiding in finding more effective biomarkers for the question in hand. A good feature set also facilitates building robust predictive models with improved interpretability and convergence of the applied method due to the smaller feature space. Results Here, we present a robust feature selection method named Stable Iterative Variable Selection (SIVS) and assess its performance over both omics and clinical data types. As a performance assessment metric, we compared the number and goodness of the selected feature using SIVS to those selected by Least Absolute Shrinkage and Selection Operator regression. The results suggested that the feature space selected by SIVS was, on average, 41% smaller, without having a negative effect on the model performance. A similar result was observed for comparison with Boruta and caret RFE. Availability and implementation The method is implemented as an R package under GNU General Public License v3.0 and is accessible via Comprehensive R Archive Network (CRAN) via https://cran.r-project.org/package=sivs. Supplementary information Supplementary data are available at Bioinformatics online.", "venue": "Bioinform.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-16", "journal": {"name": "Bioinformatics", "pages": "4810 - 4817", "volume": "37"}, "authors": [{"authorId": "144706204", "name": "Mehrad Mahmoudian"}, {"authorId": "47545810", "name": "M. Venäläinen"}, {"authorId": "48604396", "name": "R. Klén"}, {"authorId": "7787359", "name": "L. Elo"}], "citations": [{"paperId": "f0781c67a9eb778e985acf5a49eecce2b873de55", "title": "Resting-state EEG dynamic functional connectivity distinguishes non-psychotic major depression, psychotic major depression and schizophrenia."}, {"paperId": "3211c1554ae3113d46400b89275fec5f6dd6a10a", "title": "Multiple machine-learning tools identifying prognostic biomarkers for acute Myeloid Leukemia"}, {"paperId": "2c99c7ccb582a27637f8e5861ef54dd847bd650b", "title": "Single-cell sequencing and transcriptome analyses in the construction of a liquid–liquid phase separation-associated gene model for rheumatoid arthritis"}, {"paperId": "ccfb2b09f68e7a2f54f6278623f4233b67d0ff2c", "title": "Development and validation of COEWS (COVID-19 Early Warning Score) for hospitalized COVID-19 with laboratory features: A multicontinental retrospective study"}, {"paperId": "e03556b35b3ff952e72ed6f8c9f87b2dfd1396d6", "title": "Classifying Mountain Vegetation Types Using Object-Oriented Machine Learning Methods Based on Different Feature Combinations"}, {"paperId": "21ecfa9b4d8789ae4a896a66b5be1226fcd043f8", "title": "Development of prediction model for alanine transaminase elevations during the first 6 months of conventional synthetic DMARD treatment"}, {"paperId": "071c881a7dea19f495957bf3f3e8ddee126f03b6", "title": "Robust classification and biomarker discovery of inherited metabolic diseases using GC-MS urinary metabolomics analysis combined with chemometrics"}, {"paperId": "0b45ce635650c52dac9874d1e7dcb049b28f575c", "title": "Development of a novel pyroptosis-related LncRNA signature with multiple significance in acute myeloid leukemia"}, {"paperId": "2b3bde1d0dbe05be7affdae0b9d1076129daa20c", "title": "Machine learning-based dynamic prediction of lateral lymph node metastasis in patients with papillary thyroid cancer"}, {"paperId": "1414b8f7f4970e13f43d3fb19c982a9533349ac5", "title": "Development and validation of prediction models for hypertension risks: A cross-sectional study based on 4,287,407 participants"}, {"paperId": "5509ac218d5cc81683051020cb333682ccf0a0f8", "title": "Vascular Dysfunction Is Central to Alzheimer’s Disease Pathogenesis in APOE e4 Carriers"}, {"paperId": "2a131da5d2f81446d42fc38228bca58f3a86c130", "title": "Development and evaluation of a machine learning-based in-hospital COVID-19 disease outcome predictor (CODOP): A multicontinental retrospective study"}, {"paperId": "ac8bdab985971906a80c09d58d7d3c7a4e8b69b3", "title": "Statistical and machine learning methods to study human CD4+ T cell proteome profiles."}, {"paperId": "0ea3e89d1b1fec26685cf371b20574be9efc4fc9", "title": "Derivation, Comprehensive Analysis, and Assay Validation of a Pyroptosis-Related lncRNA Prognostic Signature in Patients With Ovarian Cancer"}, {"paperId": "da6f49d0186c7b96d9b083d78c2cdd802aab7378", "title": "A review and recommendations on variable selection methods in regression models for binary data"}, {"paperId": "c1e92997abb9de1b12f301957772cd9903b1dd20", "title": "Improved risk prediction of chemotherapy‐induced neutropenia—model development and validation with real‐world data"}, {"paperId": "2f5ff14c11a8641666a27737f458125bfca02214", "title": "Development and evaluation of a machine learning-based in-hospital COvid-19 Disease Outcome Predictor (CODOP): a multicontinental retrospective study"}, {"paperId": "ef242fb3e5d9823e9d5d7b460fb69f7bf778a66c", "title": "conside-Identification of biomarkers associated with immune-propionate metabolism in nonal-coholic fatty liver disease"}]}
