{"paperId": "62d86c86114655be8820a26bdfd18f8a57ec071a", "publicationVenue": {"id": "dde2f643-6f46-48ec-82a6-6f398b3b0d0b", "name": "IEEE Communications Letters", "type": "journal", "alternate_names": ["IEEE Commun Lett"], "issn": "1089-7798", "url": "http://www.comsoc.org/CL", "alternate_urls": ["http://www.comsoc.org/pubs/jrnal/commlet.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=4234"]}, "title": "Mobility-Aware Computation Offloading in MEC-Based Vehicular Wireless Networks", "abstract": "We study the mobility-aware computation offloading design for mobile edge computing (MEC) based vehicular wireless networks which considers random mobility of the vehicle and its potential handover during the offloading process. The computation offloading decision is made by comparing the average total costs due to the local and remote computation task executions at the vehicle and the MEC servers, respectively. Toward this end, we propose an analytical model to determine the average total cost due to remote task execution. We evaluate the performance of the proposed design by comparing its achievable cost with that due to an average mobility-based approximation. Simulation results show a cost reduction of up to 17% compared to the baseline.", "venue": "IEEE Communications Letters", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-01", "journal": {"name": "IEEE Communications Letters", "pages": "466-469", "volume": "24"}, "authors": [{"authorId": "1500416677", "name": "Vu Huy Hoang"}, {"authorId": "2227233", "name": "T. Ho"}, {"authorId": "1695268", "name": "L. Le"}], "citations": [{"paperId": "2deced266a6d9e42a0bc1933a8d33a4444bfcc64", "title": "Mobility-aware and energy-efficient offloading for mobile edge computing in cellular networks"}, {"paperId": "0a30481695a069ed664bda52d8a33f979d9a1854", "title": "Meta Reinforcement Learning for Multi-Task Offloading in Vehicular Edge Computing"}, {"paperId": "2dfea5d93cdf623ab6769f7c2f498506b2545ef6", "title": "A communication link lifetime prediction-supported V2V partial computation offloading scheme for autonomous driving"}, {"paperId": "9f9fe1d9bb98906b1a16b78848c00307f0a20c01", "title": "MCVCO: Multi-MEC Cooperative Vehicular Computation Offloading"}, {"paperId": "0a9290e39ea93801cfe80a7ed89d315df5dff1ba", "title": "Task Migration and Resource Allocation Scheme in IoV With Roadside Unit"}, {"paperId": "e3cb1854071e55b14d26ea4ce6d8d49ef81298bf", "title": "Location-Aware and Delay-Minimizing Task Offloading in Vehicular Edge Computing Networks"}, {"paperId": "4cc3e1791d7d97692f0acf5592348bae1ab9f76e", "title": "Secure intelligent reflecting surface assisted mobile edge computing system with wireless power transfer"}, {"paperId": "1c0f04dd5949ac7429853167f131a44e62a60a96", "title": "Mobility Aware Computation Offloading in Fog Devices using Virtual Machine Migration"}, {"paperId": "15517d5be1572b9c802636bf587929aeb1977f8e", "title": "Blockchain-Based Cooperative Computation Offloading and Secure Handover in Vehicular Edge Computing Networks"}, {"paperId": "30003141ca44e233dc3039a62dfee2ffda094e39", "title": "Cross-layer cooperative offloading in vehicular edge computing networks"}, {"paperId": "969325abdbeb9c2d7e1d78bd32dea387c27aa609", "title": "Multi-Access Edge Computing (MEC) Based on MIMO: A Survey"}, {"paperId": "c795828f5390d4208bc70b8a110082a7fc3884fd", "title": "Mobility-Aware Multi-Hop Task Offloading for Autonomous Driving in Vehicular Edge Computing and Networks"}, {"paperId": "0841c5def4388920827a77527a4dbfbb00057341", "title": "Mobility-Aware Computation Offloading and Blockchain-based Handover in Vehicular Edge Computing Networks"}, {"paperId": "769b9aa26383f24850ffa735d35f5c88060ee443", "title": "Reliability‐based offloading strategy for deadline‐constrained taskflows in vehicular edge computing environments"}, {"paperId": "a80fae3ae47534e19da32aae7c50dd91c339a9d6", "title": "Modeling the Offloading Scheme With Unreliable VM-Related Service for MEC Networks"}, {"paperId": "933384174faeef6b6f24bdb4d3e349238ad19d03", "title": "An edge abstraction layer enabling federated and hierarchical orchestration of CCAM services in 5G and beyond networks"}, {"paperId": "4dea3b773a82b00bc758701f0e3da62ce7b5a85b", "title": "Computation Offloading in Mobile Cloud Computing and Mobile Edge Computing: Survey, Taxonomy, and Open Issues"}, {"paperId": "ee624c18b3b11027e827d12ea1fe24f1c3bef759", "title": "On the Edge of the Deployment: A Survey on Multi-access Edge Computing"}, {"paperId": "bfdb231ab90e05261685037802fe89117ba0b7f2", "title": "A cluster-based cooperative computation offloading scheme for C-V2X networks"}, {"paperId": "d1a9a7e5058a4386229a6517c048269b0238e14d", "title": "Mobility-Aware Offloading Decision for Multi-Access Edge Computing in 5G Networks"}, {"paperId": "6d0fe53cc9bd1df6302085a234dc6e9a21392b14", "title": "Joint Offloading Decision and Resource Allocation for Vehicular Fog-Edge Computing Networks: A Contract-Stackelberg Approach"}, {"paperId": "5033b887c34d577c7899711c06d71d579a892479", "title": "V2V-Based Task Offloading and Resource Allocation in Vehicular Edge Computing Networks"}, {"paperId": "1aad85e102985dcc24da4926d24be0a8ebaaac2c", "title": "Multiagent Deep Reinforcement Learning for Vehicular Computation Offloading in IoT"}, {"paperId": "9931bf536e6092abe0bbca00f5d936aeb0adceb5", "title": "Mobility-aware computational offloading in mobile edge networks: a survey"}, {"paperId": "5e6ed964d84a4a0d013b68717b30bf1258d7cc3a", "title": "Research and Application on Key Technologies of 5G and C-V2X Intelligent Converged Network Based on MEC"}, {"paperId": "12b454e72e35a9e558be666d055e0d02bb8a47a8", "title": "Reducing Offloading Latency for Digital Twin Edge Networks in 6G"}, {"paperId": "d99df358fc068777a25860da0247982e89db594f", "title": "Computation offloading through mobile vehicles in IoT-edge-cloud network"}, {"paperId": "5f794cc3fa3a0db33d808e812bb037ae8396706d", "title": "Network Service and Resource Orchestration: A Feature and Performance Analysis within the MEC-Enhanced Vehicular Network Context"}, {"paperId": "61e46d0132ed08115a8d9ed4d7ece4262a1fd76b", "title": "Fuzzy Logic Based Binary Computation Offloading Scheme in V2X Communication Networks"}, {"paperId": "ee7d1f10d6b55115b020fedfeb2228e0ee02a86d", "title": "Task Offloading and Serving Handover of Vehicular Edge Computing Networks Based on Trajectory Prediction"}, {"paperId": "268aece62d0208a487defd8ee6f3a663700785d2", "title": "Computation Offloading for Vehicular Environments: A Survey"}]}
