{"paperId": "62e721c657aca3d335eb260b912949400c7edc08", "publicationVenue": null, "title": "Recommender Systems Challenges and Solutions Survey", "abstract": "Today’s Recommender system is a relatively new area of research in machine learning. The recommender system’s main idea is to build relationship between the products, users and make the decision to select the most appropriate product to a specific user. There are four main ways that recommender systems produce a list of recommendations for a user – content-based, Collaborative, Demographic and hybrid filtering. In content-based filtering the model uses specifications of an item in order to recommend additional items with similar properties. Collaborative filtering uses past behavior of the user like items that a user previously viewed or purchased, In summation to any ratings the user gave those items rate and similar conclusions made by other user’s items list. To predicts items that the user may find interesting. Demographic filtering is view user profile data like age category, gender, education and living area to find similarities with other profiles to get a new recommender list. Hybrid filtering combines all three filtering techniques. This paper introduces survey about recommendation systems, techniques, challenges the face recommender systems and list some research papers solve these challenges.", "venue": "2019 International Conference on Innovative Trends in Computer Engineering (ITCE)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-02-01", "journal": {"name": "2019 International Conference on Innovative Trends in Computer Engineering (ITCE)", "pages": "149-155"}, "authors": [{"authorId": "24161226", "name": "M. Mohamed"}, {"authorId": "39023607", "name": "M. Khafagy"}, {"authorId": "144489765", "name": "Mohamed H. Ibrahim"}], "citations": [{"paperId": "8240ebe078ad654006e4f2ee5d86fadd6b71d7b9", "title": "Principle of Educational Management in Hybrid Learning"}, {"paperId": "ce91f48ec7134735eb1eacae524bee68970b4436", "title": "A Comprehensive Survey on Recommender Systems Techniques and Challenges in Big Data Analytics with IoT Applications"}, {"paperId": "3221b1f23efb8033b5ce2daa6cdfd1e9698fc402", "title": "LFG: A Generative Network for Real-Time Recommendation"}, {"paperId": "f4c24b39f46b97383878228f697e5117f0ef5891", "title": "Improving the Scalability of Collaborative Filtering Recommendation with Clustering Techniques"}, {"paperId": "8873df4a8e688a427cda495068d7c15f70be9afc", "title": "A Movie Recommender System Based on User Profile and Artificial Bee Colony Optimization"}, {"paperId": "e6e5b10725aaa74827f106ddb5d27f7a34ee17c6", "title": "Optimizing Book Recommendations through Machine Learning: A Collaborative Filtering and Popularity-Based Framework"}, {"paperId": "5a7c2436257b837a1b0dc2ed4b2416e45dbb490f", "title": "Unveiling Optimal SDG Pathways: An Innovative Approach Leveraging Graph Pruning and Intent Graph for Effective Recommendations"}, {"paperId": "4fe8854481756873b240bce563650346d1c7dc94", "title": "Video Recommendation Using Social Network Analysis and User Viewing Patterns"}, {"paperId": "302fee7b7cafb23a40b6deaa56d0793b722135a7", "title": "Solution to Scalability and Sparsity Problems in Collaborative Filtering using K-Means Clustering and Weight Point Rank (WP-Rank"}, {"paperId": "f743c9248b4c0a04f390b5ffe519bf81936336f8", "title": "Personalizing Product Recommendations using Collaborative Filtering in Online Retail: A Machine Learning Approach"}, {"paperId": "d3291dc0542b9f49c41069a8549ba3f2b1b23cec", "title": "Exploiting deep transformer models in textual review based recommender systems"}, {"paperId": "b0108aca5b4f9cba47f2a6a223b883998b5f410c", "title": "Design and Implementation of Proactive Multi-Type Context-Aware Recommender System for Patients Suffering Diabetes"}, {"paperId": "e443d6d44a24c7cd678f63582f5418aeb2f87198", "title": "Dynamic and Private Recommendation System"}, {"paperId": "6931b110829ae0556fd5ea318bfcb8898e522eb2", "title": "Dietary Behavior Based Food Recommender System Using Deep Learning and Clustering Techniques"}, {"paperId": "4ce44526dfca878c76bdadd5c0a2ac4d6a192323", "title": "Could Small Language Models Serve as Recommenders? Towards Data-centric Cold-start Recommendations"}, {"paperId": "9a4e09f576ad1a22a8c7343013503d4a654faa95", "title": "Sentiment-enhanced Neural Collaborative Filtering Models Using Explicit User Preferences"}, {"paperId": "75d1f0ec768f576c533f4f13862a27041a101f95", "title": "Recommender Systems in Cybersecurity"}, {"paperId": "6c41ff04c4463968de0f3f8dd4a7aba33e469378", "title": "Combining Resource-Aware Recommendation and Caching in the Era of MEC for Improving the Experience of Video Streaming Users"}, {"paperId": "32ddc5c4918b33d0ab7f5003c93eaba29e0702fa", "title": "A systematic review of value-aware recommender systems"}, {"paperId": "9f9ad0f045c354efb6cead63e1071f3ed281294e", "title": "Co-Clustering based Hybrid Collaborative Filtering Model"}, {"paperId": "d4d30522062d8f1967cda3a820bc268e34af767b", "title": "A Survey on Recommendation Systems using Collaborative Filtering Techniques"}, {"paperId": "dbf597df791bb50de0d604ce5e859b7ba143ec7f", "title": "Survey on Collaborative and Content-based Recommendation Systems"}, {"paperId": "25c7c4dc3707629d33a70147a522d13261b1efb2", "title": "Contextual Data Modeling for Recommender System in Building and Construction Materials Business"}, {"paperId": "416e82571be0fa325dbe7c6583c799cb823132ec", "title": "Machine Learning-Based Personalized Recommendation System for E-Learners"}, {"paperId": "0150b988f2b64612d046090f3cff286ed7686900", "title": "Recommender Systems in E-commerce"}, {"paperId": "786d29576a753d810be7d1fe5e83e835ae61b94f", "title": "Hybrid Music Recommendation System Utilizing Item Popularity and Content-Based Filtering Innovations in music"}, {"paperId": "d3cd3d2dcc430d580c94996533c7258029600cfa", "title": "Multi-Modality Recommender Systems: A Review"}, {"paperId": "6351a3bc8e501513eba96b48687d9a883b5e0274", "title": "Building Movie Recommender Systems Utilizing Poster's Visual Features: A Survey Study"}, {"paperId": "b218f0dc5ce4e455215076051132fd7db46671c3", "title": "Towards more trustworthy predictions: A hybrid evidential movie recommender system"}, {"paperId": "eddebe90b444bbfefafa1e2d0a6e04e5756b534a", "title": "Content and Other Resources Recommendations for Individuals with Intellectual Disability: A Review"}, {"paperId": "3943d4df4cc1f4a27d99918ad1a006b6926846e2", "title": "Lattices defined by multigranular rough sets"}, {"paperId": "827a3a2f6c3400112ef845acd689f15bdeb70d16", "title": "Student Career Recommendation System Using Content-Based Filtering Method"}, {"paperId": "2ef4817becdd9e8f00738abd8964d016eb53ed28", "title": "Application of k-means clustering algorithm to improve effectiveness of the results recommended by journal recommender system"}, {"paperId": "7fbbc32c37f9914ea391ac87b8bb866ae9a5b9ff", "title": "Topic modeling and Sentiment Analysis-based Recommender system: A literature review"}, {"paperId": "26fe95914a04e26fc884e8f42956ae5fee3aee06", "title": "Preference-Tree-Based Real-Time Recommendation System"}, {"paperId": "9bc04d038439f6f502504aaaaea2514b5d4ea0c8", "title": "An integrated model for evaluation of big data challenges and analytical methods in recommender systems"}, {"paperId": "366b96ed05e8efd36393d85968bd65635e503baa", "title": "To Enhance the Quality of HCRS using Fuzzy-Genetic Approach"}, {"paperId": "9c5c30ffd580f159e10ef886b1c96ec096295027", "title": "Intelligent Recommendation-Based User Plane Handover With Enhanced TCP Throughput in Ultra-Dense Cellular Networks"}, {"paperId": "962f011bff27a3b07455055da12732d647b467f1", "title": "Online hotel rating prediction through a dynamic weighted ordered probit model"}, {"paperId": "798bccc9c9f3227afa62d67287fbac2587c6ccc3", "title": "Similarity modifiers for enhancing the recommender system performance"}, {"paperId": "5bd3d8ab8357f5f39be4b098fea1e13db1e8deed", "title": "APPLICATION DEVELOPMENT FOR MUSIC RECOMMENDATION SYSTEM USING DEEP DETERMINISTIC POLICY GRADIENT"}, {"paperId": "0e71e89a5def41179707adbb2f2d856be863ccee", "title": "Intelligent Recommendations of Startup Projects in Smart Cities and Smart Health Using Social Media Mining"}, {"paperId": "b314119c384549ddc8b64cc381df4259ec41a928", "title": "Authoring and playing interactive fiction with conventional web technologies"}, {"paperId": "08256091c3ad39509b25e1cbc05f88125ca98aec", "title": "A Systematic Review of Recommender Systems and Their Applications in Cybersecurity"}, {"paperId": "037a44dd63c2c44970d538ad36466499d7005b7b", "title": "Book Recommendation System"}, {"paperId": "fffb4bf3521624995842b318dfc5058b46b80ca8", "title": "DATA SCIENCE AND DEEP LEARNING APPLICATIONS IN THE E-COMMERCE INDUSTRY: A SURVEY"}, {"paperId": "4a25c53a1e79dfff07ac4466b485bea310966feb", "title": "A fog based recommendation system for promoting the performance of E-Learning environments"}, {"paperId": "fd94e2695fe6b15ad3db963c8f1754e645be3064", "title": "Content-based recommender system architecture for similar e-commerce products"}, {"paperId": "457ba1932bcbc3412923f11892f965b0d6450ed4", "title": "Real-Time Attacks Detection Model And Platform Using Big Data And Machine Learning"}, {"paperId": "d4d96b3552b2e2559e23727c28e3d779388a0766", "title": "S2RSCS: An Efficient Scientific Submission Recommendation System for Computer Science"}, {"paperId": "0de732b7ac5a879ddc659e5d07ed6e0d301b070e", "title": "Movie Recommendation Systems: A Brief Overview"}, {"paperId": "578cecc3050c399e855d21ddd51e145a3e097de7", "title": "Seminar and Training Programs Recommender System for Faculty Members of Higher Education Institution"}, {"paperId": "5fa444442fbebe1d612b61c5cf3108dc3cc2bdfc", "title": "Recommendation Systems in the Big Data Era"}, {"paperId": "cdea232a973ea81f92393a6f32da96c2bcd1b974", "title": "A Brief Model Overview of Personalized Recommendation to Citizens in the Health‐Care Industry"}, {"paperId": "76b05011ca26eb83bfaf6218f086c9d888e5a2df", "title": "Boosting Recommender Systems with Advanced Embedding Models"}, {"paperId": "93cbb753357a1765b2753ab1f232d23344a34135", "title": "The University Recommendation System for Higher Education"}, {"paperId": "af8d33bb9feb8a9a0a18040ee380824e4cdb8ae8", "title": "Smurf Detector: a Detection technique of criminal entities involved in Money Laundering"}, {"paperId": "58cecb04b1224cd0822c2fe71465b34b7b2c163f", "title": "Two Recommendation System Algorithms Used SVD And Association Rule On Implicit And Explicit Data Sets"}, {"paperId": "e258283adb2b206d1de6207d612e7444d8a3d246", "title": "Challenges and Solutions in Recommender Systems"}, {"paperId": "b770880e2ed981c3904cf0aa399240835e693e40", "title": "GCZRec: Generative Collaborative Zero-Shot Framework for Cold Start News Recommendation"}, {"paperId": "c14cd6327742048549468bcc3050dd964fe811e2", "title": "A Cognitive Diagnosis Approach for Recommending Items Based on Polytomous Responses and Latent Attributes"}, {"paperId": "92d2aca10f1aa68ca580e51ca732e517daeec102", "title": "An Empathy-Based Sandbox Approach to Bridge Attitudes, Goals, Knowledge, and Behaviors in the Privacy Paradox"}, {"paperId": "62e7805d459f57d80ba0a38cdd96af259f6c2143", "title": "Job Recommendation System Using Hybrid Filtering"}, {"paperId": "53c4127bcf8648d3a11df799b5fdd2f16725bb71", "title": "Emotion-Aware Music Recommendation Systems Mitigating the Consequences of Emotional Data Sparsity Papadopoulos"}, {"paperId": "c4e0f1e7f6ce1aad9c9e04892db19d924f65aef0", "title": "Sentiment Analysis and Machine Learning Algorithm Implementation on Health Care System"}, {"paperId": "66076ba323e556af72553922ab844cd99b886544", "title": "ROLE OF MACHINE LEARNING IN THE TOURISM SECTOR"}, {"paperId": "ca1b66606ed66bce41d88926a456d5d4717c1670", "title": "Chapter Eleven - Music recommender system using restricted Boltzmann machine with implicit feedback"}, {"paperId": "710693159f876e968d1d70527f26365047ea8858", "title": "Food Recommendation in a Worksite Canteen"}, {"paperId": "03a341dbb99194770728c55187c877f21387e4ee", "title": "Investigating Adjustable Social Autonomy in Human Robot Interaction"}, {"paperId": "efd3716a0c62e7940559c4b98801dafa907259f5", "title": "Robot's self-trust as precondition for being a good collaborator"}, {"paperId": "095082bf0f96e9e3d352b66fe95daefd9bfde94a", "title": "MUSIC RECOMMENDATION SYSTEM USED EMOTIONS TO TRACK AND CHANGE NEGATIVE USERS’ MOOD"}, {"paperId": "4538e37903afda6f9ab7ed249a21820ab0e2fb2d", "title": "RECOMMANDER SYSTEM FOR PRODUCT PROMOTION THROUGH PCA, DWT AND PCA"}, {"paperId": "6f59af09d7fc997ccff9ff2352b88b28659de127", "title": "Chatbot for intelligent Internet content search support"}, {"paperId": "3dcba87e5cbfd932af1f8db2926eea1f8c282c2d", "title": "Temporal-based Optimization to Solve Data Sparsity in Collaborative Filtering"}, {"paperId": "6dfb1fdcd44f266f47260eb5d636a4e0fd999cad", "title": "Privacy and Identity Management. Data for Better Living: AI and Privacy: 14th IFIP WG 9.2, 9.6/11.7, 11.6/SIG 9.2.2 International Summer School, Windisch, Switzerland, August 19–23, 2019, Revised Selected Papers"}, {"paperId": "ecbeca5daf4c596c1db1dae320696e5d84478d0d", "title": "Machine Learning Model for Personalizing Online Arabic Journalism"}, {"paperId": "d698d11012101b50d4dd6bd75569b0443bc97047", "title": "Possible System Architecture for Travel Recommender"}, {"paperId": "2bb29010c726444d2097697355a59956f51bf353", "title": "Multi-Objective Evolutionary Programming for Developing Recommender Systems based on Collaborative Filtering"}, {"paperId": "475300d85ef9ef8fbb9db319fbce42734e532dd2", "title": "Job Recommendation based on Job Profile Clustering and Job Seeker Behavior"}, {"paperId": "dda50d63543d509f37da827f54fe52c38d1ea08b", "title": "Case Study: Spark GPU-Enabled Framework to Control \nCOVID-19 Spread Using Cell-Phone Spatio-Temporal Data"}, {"paperId": "aec667018d546bb68ef2a623ca0acc999da5ede6", "title": "Recommended for You: \"You Don't Need No Thought Control\". An Analysis of News Personalisation in Light of Article 22 GDPR"}, {"paperId": "fc901adce4f2a9b7519fdd8ca4592bbd5da4c418", "title": "Sparsity and Cold Start Recommendation System Challenges Solved by Hybrid Feedback"}, {"paperId": "cad70ccb8be95fee5596d8294ceac7ffdcc6ed53", "title": "Development of a recommender system based on life and health sciences literature"}, {"paperId": "5b219e34b74faf7b08b8f3e6f88c4e4779fc1b12", "title": "BIG SCHOLARLY DATA TECHNIQUES, ISSUES, AND CHALLENGES SURVEY"}, {"paperId": "e3a245c7907ef23262eacc5c6a35a198b8952536", "title": "A HYBRID RECOMMENDER FRAMEWORK FOR SELECTING A COURSE REFERENCE BOOKS"}, {"paperId": "532efa821c51b1ff22333df74ce38587afbebbd0", "title": "DEEP LEARNING-ASSISTED EXPLICIT AND IMPLICIT CONTEXT-BASED PERSONALIZED RECOMMENDER SYSTEM"}, {"paperId": "93cfac14e5242cfa4d5cb42efd53d36afbdb24e1", "title": "HYBRID PERSONALIZED RECOMMENDATION MODEL FOCUS ON IMPROVED COLLABORATIVE FILTERING"}]}
