{"paperId": "62e9362ab52edaa1e64fed23e7da72794393b3b8", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "Multi-Agent Reinforcement Learning-Based Trading Decision-Making in Platooning-Assisted Vehicular Networks", "abstract": "—Utilizing the stable underlying and cloud-native functions of vehicle platoons allows for flexible resource provisioning in environments with limited infrastructure, particularly for dynamic and compute-intensive applications. To maximize this potential, we propose the creation of a trading market to encourage interactions between service supporters (vehicle pla-toons) and requesters (task vehicles). Current trading decisions based on game and negotiations can lead to unpredicted handover costs and increased communication overhead in dynamic environments. Moreover, existing research tends to overlook a mutually beneficial trading philosophy by focusing on either the service supporters’ profitability or the user experience of resource-restrained requesters. Addressing these issues, we introduce a multi-objective optimization problem to model environmental dynamics and uncertainty, aiming to maximize both platoons’ and task vehicles’ long-term utilities while maintaining a satisfactory service access ratio. To tackle the problem within acceptable time frames, we develop a global-local training architecture, incorporating a hybrid action space and prioritized sampling into a multi-agent reinforcement learning algorithm that utilizes a twin delayed deep deterministic gradient (GL-HPMATD3). This approach facilitates consensus in the trading market on key issues, including service request selection, resource allocation, and", "venue": "IEEE/ACM Transactions on Networking", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE/ACM Transactions on Networking"}, "authors": [{"authorId": "2061135203", "name": "Tingting Xiao"}, {"authorId": "4562384", "name": "Chen Chen"}, {"authorId": "1714082", "name": "M. Dong"}, {"authorId": "144705313", "name": "K. Ota"}, {"authorId": "2150801882", "name": "Lei Liu"}, {"authorId": "1691109", "name": "S. Dustdar"}], "citations": []}
