{"paperId": "62f559604c2869bd97d4bdc6c64645e8518c207c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "On the Opportunities and Challenges of Offline Reinforcement Learning for Recommender Systems", "abstract": "Reinforcement learning serves as a potent tool for modeling dynamic user interests within recommender systems, garnering increasing research attention of late. However, a significant drawback persists: its poor data efficiency, stemming from its interactive nature. The training of reinforcement learning-based recommender systems demands expensive online interactions to amass adequate trajectories, essential for agents to learn user preferences. This inefficiency renders reinforcement learning-based recommender systems a formidable undertaking, necessitating the exploration of potential solutions. Recent strides in offline reinforcement learning present a new perspective. Offline reinforcement learning empowers agents to glean insights from offline datasets and deploy learned policies in online settings. Given that recommender systems possess extensive offline datasets, the framework of offline reinforcement learning aligns seamlessly. Despite being a burgeoning field, works centered on recommender systems utilizing offline reinforcement learning remain limited. This survey aims to introduce and delve into offline reinforcement learning within recommender systems, offering an inclusive review of existing literature in this domain. Furthermore, we strive to underscore prevalent challenges, opportunities, and future pathways, poised to propel research in this evolving field.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-22", "journal": {"name": "ArXiv", "volume": "abs/2308.11336"}, "authors": [{"authorId": "48283085", "name": "Xiaocong Chen"}, {"authorId": "2128046810", "name": "Siyu Wang"}, {"authorId": "35660011", "name": "Julian McAuley"}, {"authorId": "1705282", "name": "D. Jannach"}, {"authorId": "2106357243", "name": "Lina Yao"}], "citations": [{"paperId": "5fff6867d734eee8eb6dacb9fab5873864390f5d", "title": "Retentive Decision Transformer with Adaptive Masking for Reinforcement Learning based Recommendation Systems"}]}
