{"paperId": "6332e52beb566bb2d3af213811842f900e6a67a1", "publicationVenue": null, "title": "Person’s multiple intelligence classification based on tweet post using SentiStrength and processed on the Apache Spark framework", "abstract": "A person’s self-development is influenced by his ability in solving problems and adapting to his environment. This ability is commonly known as intelligence. Every person has a different dominant intelligence. Honed intelligence can result in managed self-development and self-mastery. A person can discover his talent and expertise to be more advanced in his field. However, discovering one’s dominant intelligence requires several variables to assess his behaviours. This research makes use of a person’s activities on the social media Twitter. Twitter is a platform on which its users share thoughts. Posted tweets are used as objects to determine the corresponding user’s dominant intelligence. The user’s tweet will go through a sentiment analysis and intelligence type classification by applying the SentiStrength method to the Apache Spark framework. This research was conducted on 20 Twitter user accounts with the types of intelligence consisting of musical-rhythmic, visual-spatial, verbal-linguistic, logical-mathematical, bodily-kinesthetics, interpersonal, intrapersonal, naturalistic, and spiritual intelligence. The 72% average accuracy is obtained by calculating the correlation between manual testing and the system using the Spearman’s rank correlation coefficient (α = 0.05 and the Spearman’s value of 0.700).", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "Journal of Physics: Conference Series", "volume": "1882"}, "authors": [{"authorId": "9274633", "name": "B. Siregar"}, {"authorId": "2106615205", "name": "M. N. Misyuari"}, {"authorId": "9093832", "name": "E. Nababan"}, {"authorId": "122709619", "name": "Fahmi"}], "citations": [{"paperId": "b46b480e6ee882411907c0d11c3303117b64af67", "title": "Learning Model Gawi Sabumi Based on Local Wisdom to Improve Student’s High Order Thinking Skills and Multiple Intelligence on Elementary School"}, {"paperId": "43072262ac33a61215eafd6d41122402e38c9ef1", "title": "http://ijere.iaescore.com The effects of multiple intelligences theory on learning success: A meta-analysis in social"}, {"paperId": "708e26b382c29f1220e345906c59fa9bb8c87acd", "title": "Effectiveness of Innovation Blended Learning Model to Improve Students’ High Order Thinking Skills and Ecological Awareness"}]}
