{"paperId": "633798d826e6ae4afe000d66b1638f7f2185334a", "publicationVenue": {"id": "dc95b805-f39c-43dd-bf0f-500edd72da12", "name": "F1000Research", "type": "journal", "issn": "2046-1402", "url": "https://f1000research.com/"}, "title": "Towards achieving lightweight intrusion detection systems in Internet of Things, the role of incremental machine learning: A systematic literature review", "abstract": "While the benefits of IoT cannot be overstated, its computational constraints make it challenging to deploy security methodologies that have been deployed in traditional computing systems. The benefits and computational constraints have made IoT systems attractive to cyber-attacks. One way to mitigate these attacks is to detect them. In this study, a Systematic Literature Review (SLR) has been conducted to analyze the role of incremental machine learning in achieving lightweight intrusion detection for IoT systems. The study analyzed existing incremental machine learning approaches used in designing intrusion detection systems for IoT ecosystems, emphasizing the incremental methods used in detecting intrusions, the datasets used to evaluate these methods, and how the method achieves lightweight status. The SLR outlined the contributions of each study, focusing on their strengths and gaps, the datasets used, and the incremental machine learning model used. This study revealed that incremental learning approaches in detecting intrusion in IoT systems are in their infant stage. Over 12 years, from 2010 to 2022, a total of twenty-one (21) studies were carried out in IDSs using incremental machine learning, with eight (8) studies carried out in IoT systems. In addition to reviewing the literature, we offer suggestions for improving existing solutions and achieving lightweight IDS for IoT systems. We also discussed some problems with making lightweight IDS for IoT systems and areas where more research could be done in the future.", "venue": "F1000Research", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-24", "journal": {"name": "F1000Research", "pages": "1377", "volume": "11"}, "authors": [{"authorId": "1380212067", "name": "P. Agbedanu"}, {"authorId": "3054260", "name": "R. Musabe"}, {"authorId": "71931241", "name": "James Rwigema"}, {"authorId": "9128341", "name": "I. Gatare"}, {"authorId": "79476586", "name": "T. Maginga"}, {"authorId": "90316903", "name": "D. Amenyedzi"}], "citations": []}
