{"paperId": "63390a4cd10c6275d45fdd43e502b80092fd5b4e", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "The usefulness of sparse k-means in metabolomics data: An example from breast cancer data", "abstract": "In processing metabolomics data, multidimensional quantitative data from thousands of metabolites are often sparse, that is, only a small fraction of metabolites are relevant to the phenotype of interest. Clustering is therefore used to discover subtypes from omics data. Sparse processing, which selects important metabolites from the total omics data, is an effective clustering technique. This study investigated the effectiveness of sparse k-means for metabolomics data. Specifically, sparse k-means was used to cluster blood lipid metabolite data of breast cancer patients in two studies: (1) before and after menopause, and (2) pre- and postoperative chemotherapy. In both cases, sparse k-means showed comparable discrimination accuracy with fewer metabolites than k-means. Furthermore, when the L1 norm values were varied, no significant changes were observed. The mean silhouette coefficients of sparse k-means and k-means were (1) 0.38 ± 0.14 (S.D.) and 0.17 ± 0.01, (2) 0.38 ± 0.07 and 0.17 ± 0.01, indicating that feature selection using sparse k-means can improve clustering results. In addition, metabolite selection using sparse k-means was consistent regardless of the test data or the constrained value of the L1 norm, indicating robustness.", "venue": "bioRxiv", "year": 2022, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2022-02-08", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2154019711", "name": "Misa Goudo"}, {"authorId": "145134173", "name": "M. Sugimoto"}, {"authorId": "3234272", "name": "S. Hiwa"}, {"authorId": "2071035743", "name": "Tomoyuki Hiroyasu"}], "citations": [{"paperId": "e9b2a0b18c9c9b79581b8706346e04c8aceb9106", "title": "Salivary metabolomics in the family environment: A large-scale study investigating oral metabolomes in children and their parental caregivers"}]}
