{"paperId": "6349bcb9dcd16717984458c34195cf7e74452827", "publicationVenue": {"id": "855d4173-dc30-48dc-96c2-42a5b6372940", "name": "IEEE Transactions on Emerging Topics in Computing", "type": "journal", "alternate_names": ["IEEE Trans Emerg Top Comput"], "issn": "2168-6750", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245516", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516"]}, "title": "A Novel TDMA-Based Fault Tolerance Technique for the TSVs in 3D-ICs Using Honeycomb Topology", "abstract": "Through-silicon-vias (TSVs) are prone to defects during the manufacturing process, which pose yield challenges for three dimensional integrated circuits (3D-ICs). The area per TSV is too great to be ignored, and in order to not use any redundant TSVs, a chain-type time division multiplexing access (TDMA)-based fault tolerance technique is proposed. However, a double-TSV structure is used per group, resulting in a significant TSV hardware overhead under a given large-scaled circuit design. Furthermore, it is impossible for the chain-TDMA scheme to plan the rerouting path for the right-hand-most TSV per group, resulting in a decrease in the repair rate per TSV group as well as in the whole TSV yield. In the proposed technique, we bundle six TSVs per group in a honeycomb pattern and the TSVs on the edges are connected to each other, enhancing the repair rate per group as well as the whole TSV yield. Subsequently, an architecture based on the proposed technique is designed, evaluated, and validated on logic-on-logic 3D IWLS’05 benchmark circuits using 45 nm TSMC technology. The proposed technique is found to reduce the area overhead by 87.95–90.42 percent, compared to the chain-TDMA scheme, which results in a yield of 96.90–99.09 percent.", "venue": "IEEE Transactions on Emerging Topics in Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "IEEE Transactions on Emerging Topics in Computing", "pages": "724-734", "volume": "9"}, "authors": [{"authorId": "8711550", "name": "Tianming Ni"}, {"authorId": "2116372678", "name": "Zhao Yang"}, {"authorId": "2116192537", "name": "Hao Chang"}, {"authorId": "2144533195", "name": "Xiaoqiang Zhang"}, {"authorId": "2152515034", "name": "Lin Lu"}, {"authorId": "2749981", "name": "Aibin Yan"}, {"authorId": "3213935", "name": "Zhengfeng Huang"}, {"authorId": "144029149", "name": "X. Wen"}], "citations": [{"paperId": "3c6f33b01f0e0c1ddeeb4dd2927de5383d78dd23", "title": "Cluster-aware allocation of spare TSVs for enhanced reliability in 3D ICs"}, {"paperId": "485f2a79451175f8da303d7be880e56b975ca8db", "title": "A high-performance fully adaptive routing based on software defined network-on-chip"}, {"paperId": "a83dbd8b056c7dfc5a5a0e8148e6f79ee04dc471", "title": "TRUST: Through-Silicon via Repair Using Switch Matrix Topology"}, {"paperId": "f1e58895752f79805843e5ac77bbee1df6d85c4d", "title": "A Miniaturized Wideband SIR Interdigital Bandpass Filter With High Performance Based on TSV Technology for W-Band Application"}, {"paperId": "483e82ec447d2b80876c76a2ddf30d4b3730582c", "title": "Broadcast-TDMA: A Cost-Effective Fault-Tolerance Method for TSV Lifetime Reliability Enhancement"}, {"paperId": "02862c5151ea0f6ee51b7b306b490b99c61bf8b8", "title": "Route Planning and Tracking Control of an Intelligent Automatic Unmanned Transportation System Based on Dynamic Nonlinear Model Predictive Control"}, {"paperId": "2af8f525754983fcc35a0f950d928838266223d3", "title": "TSV-based asymmetric tandem SIW Bandpass Filter for THz Applications"}, {"paperId": "b436fcd3312c71e4591820fa2ffe05092ae7de52", "title": "Numerical simulation using optical ring fiber and its effect on improving communication at different wavelengths"}, {"paperId": "c96419859ff19c8a77178efb7f0d844f4bdf4f8c", "title": "Design of modified model of intelligent assembly digital twins based on optical fiber sensor network"}, {"paperId": "f5ed78195a5ee29f2d66a68047145976c29ef8e6", "title": "IAMnet: Presentation of Parallelization Approach for Repetitive Mining on Network Topologies with an Improved Apriori Method"}, {"paperId": "22ed96c16d69e4a358cb5ea14d8687915e90027d", "title": "Quantitative Analysis of Urban Spatial Morphology Based on GIS Regionalization and Spatial Syntax"}, {"paperId": "67e125e9e98105c09e0e81990e542fef80c27048", "title": "Improving the sensitivity of new passive optical fiber ring sensor based on meta-dielectric materials"}, {"paperId": "ac87a855d80456d7306824e1782eb3e82ca68e3e", "title": "Quantitative of Badminton Practice Based on Wireless Sensor Network"}, {"paperId": "39d18fbc4e760de57c4c4355df3078869181597b", "title": "Sensing enhancement of nanostructure surface plasmon resonance in optical fiber ring resonator"}, {"paperId": "8ec74032c825caabddb48854133782a70a06ab9d", "title": "Classes of new analytical soliton solutions to some nonlinear evolution equations"}, {"paperId": "544578c4715123ec64b260f4348b729bd7889409", "title": "Design of 3D Modeling Face Image Library in Multimedia Film and Television"}, {"paperId": "4bf5a7ae219c4ef977df116c330b10e2879d501f", "title": "Role of Human Body Posture Recognition Method Based on Wireless Network Kinect in Line Dance Aerobics and Gymnastics Training"}, {"paperId": "8aa93bfd97d891fa0325b89d4a7182e4e4000545", "title": "Big data, big challenges: risk management of financial market in the digital economy"}, {"paperId": "af7408f51d83a29e92ac434b75ac74a205f05398", "title": "TSV-based hairpin bandpass filter for 6G mobile communication applications"}, {"paperId": "f2bf836e9eecf1b1430d459b6a595c375c49f86d", "title": "Semantic clustering analysis for web service discovery and recognition in Internet of Things"}, {"paperId": "c16b5eed7f3ec4e491eccf0a26944d6d7bf050eb", "title": "An improved integrated navigation method with enhanced robustness based on factor graph"}, {"paperId": "d5348b5f92c904e3e1ebca2ad952f54ca82eb615", "title": "Dual-modular-redundancy and dual-level error-interception based triple-node-upset tolerant latch designs for safety-critical applications"}, {"paperId": "61679fb5c1651b5552734bb37f496f458efdf07c", "title": "Variation-Aware Delay Fault Testing for Carbon-Nanotube FET Circuits"}, {"paperId": "932aa266dffaa028976fe0e8c436c6d8bed84b15", "title": "5 nm-scale surface evenness movement measurement method based on the electron spin in diamond"}, {"paperId": "5c469e66c6ceeea1ce765a75399991568787ecc1", "title": "Nanoscale detection of faint machinery vibration using the NV center in diamond"}, {"paperId": "05998851cab87612e10bb13e955ccdc808b66ed4", "title": "A Thermal-Aware On-Line Fault Tolerance Method for TSV Lifetime Reliability in 3D-NoC Systems"}, {"paperId": "d0b35dcef98d622122f94c5256ba50c1bf45e81a", "title": "Optimized frequency modulation for improving the sensitivity of magnetometer using electron spin ensembles in single-crystal diamond"}, {"paperId": "efe1dec9fc217bb0012947acc02a446a2c9ca36c", "title": "A proportion-integral-derivative closed-loop frequency-locking method for improving the accuracy and sensitivity of a magnetometer"}, {"paperId": "47ad173fed6b39f857e30ba2025ad0cc9ce223b5", "title": "Architecture of Cobweb-Based Redundant TSV for Clustered Faults"}, {"paperId": "db6f1a5eb04a183b3f89158da7f3629823e2ec55", "title": "A Weighted Chimp Optimization Algorithm"}]}
