{"paperId": "634c55d9f61689dc3aaa5d5341da29f68f6c6bcb", "publicationVenue": {"id": "05528bac-d212-46a6-9c84-314d4bd77368", "name": "International Journal of Intelligent Systems", "type": "journal", "alternate_names": ["Int J Intell Syst"], "issn": "0884-8173", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/36062", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1098111X"]}, "title": "Meta‐learning and the new challenges of machine learning", "abstract": "In the last years, organizations and companies in general have found the true potential value of collecting and using data for supporting decision‐making. As a consequence, data are being collected at an unprecedented rate. This poses several challenges, including, for example, regarding the storage and processing of these data. Machine Learning (ML) is also not an exception, in the sense that algorithms must now deal with novel challenges, such as learn from streaming data or deal with concept drift. ML engineers also have a harder task when it comes to selecting the most appropriate model, given the wealth of algorithms and possible configurations that exist nowadays. At the same time, training time is a stronger restriction as the computational complexity of the training model increases. In this paper we propose a framework for dealing with these challenges, based on meta‐learning. Specifically, we tackle two well‐defined problems: automatic algorithm selection and continuous algorithm updates that do not require the retraining of the whole algorithm to adapt to new data. Results show that the proposed framework can contribute to ameliorate the identified issues.", "venue": "International Journal of Intelligent Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-30", "journal": {"name": "International Journal of Intelligent Systems", "pages": "6240 - 6272", "volume": "36"}, "authors": [{"authorId": "119868315", "name": "J. Monteiro"}, {"authorId": "2066472377", "name": "Diogo Ramos"}, {"authorId": "145505518", "name": "Davide Carneiro"}, {"authorId": "2057754342", "name": "Francisco Duarte"}, {"authorId": "2068339394", "name": "João M. Fernandes"}, {"authorId": "145302989", "name": "P. Novais"}], "citations": [{"paperId": "d565711ba1eaa853a801a09f1d829681a457e70f", "title": "Soybean yield prediction using machine learning algorithms under a cover crop management system"}, {"paperId": "ef523f75675a1859c5d6c15f0ee4dedb8874ef4d", "title": "Advancing Construction 3D Printing with Predictive Interlayer Bonding Strength: A Stacking Model Paradigm"}, {"paperId": "c2c067d23a03d7e95687bfb599f40ba3b3866d71", "title": "3D meta-classification: A meta-learning approach for selecting 3D point-cloud classification algorithm"}, {"paperId": "f1f2ec5f4ce24c22f6ff1425e3513e9238d6ddda", "title": "Algorithm selection using edge ML and case-based reasoning"}, {"paperId": "753cde3d51517e77e0167634b966706f6710ef90", "title": "A Case Study on AI Engineering Practices: Developing an Autonomous Stock Trading System"}, {"paperId": "81b8c879195cb5789f8e142dff1ba51cf75b1889", "title": "Editorial on Meta-learning peculiarities and approaches for facing safety issues and enhancing risk management process"}, {"paperId": "7cc6e0959c10fda028bb2d1600543c127d397e0e", "title": "A comprehensive review on ensemble deep learning: Opportunities and challenges"}, {"paperId": "cc3c97ddbc6284aea4d06d78fce2b5c392c5a1d6", "title": "Meta-Learning in Supervised Machine Learning"}, {"paperId": "8fcbf4ada2ce37530288b57282b1eed5ac4e2111", "title": "An effective and practical gradient inversion attack"}, {"paperId": "e26fded9856f421b71bb7e407a85dfeeae3e3543", "title": "Optimal parameter estimation of three solar cell models using modified spotted hyena optimization"}, {"paperId": "dd7638391d6a7556d3823fd4e9b6fc2fbdc5e50e", "title": "CRFL: A novel federated learning scheme of client reputation assessment via local model inversion"}, {"paperId": "9c02b3715b4e69350385bac79c680561448a330c", "title": "Label specificity attack: Change your label as I want"}, {"paperId": "121f5f1d106b66a3cf2290641dd5a92fce1eee5f", "title": "Single image reflection removal using meta-learning"}, {"paperId": "dc10dffdb0b4c1f6f17c418e93779081863be483", "title": "Automated Machine Learning Driven Stacked Ensemble Modeling for Forest Aboveground Biomass Prediction Using Multitemporal Sentinel-2 Data"}, {"paperId": "afab5ca59e9717aeae7f51a46647a3bff6a33f99", "title": "Density-based clustering and probabilistic classification for integrated transmission-distribution network security state prediction"}, {"paperId": "4721a2205c60a0aec61bdee0b857a7f627267991", "title": "Developing an Autonomous Trading System: A Case Study on AI Engineering Practices"}]}
