{"paperId": "6353b81737e5856c5cae574228e0470855023bca", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "Intrusion Detection System for IoT Environment using Ensemble Approaches", "abstract": "To ensure that important assets are available and secure within a protected network architecture, Intrusion Detection Systems (IDS) are commonly used. However, current IDS algorithms often struggle to perform effectively. To address this, machine learning has been employed to enhance IDS efficiency. The main challenge with IDS classification is the large amount of irrelevant and redundant data in high-dimensional datasets, making it impossible for a single classifier to identify all types of attacks effectively. Thus, a novel ensemble IDS approach was proposed in this study. The approach involved using Random Forest (RF) for dimensionality reduction to select the optimal subset of the initial dataset. An ensemble learning method was then used for intrusion detection and identification. The proposed RF method outperformed other state-of-the-art approaches in several parameters with an accuracy of 99%, as demonstrated by experimental results on the IoTID20 dataset. The approach was evaluated using several performance criteria, including Accuracy, Precision, Recall, and F1-score.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-15", "journal": {"name": "2023 10th International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "935-938"}, "authors": [{"authorId": "2089565211", "name": "Aamir S Ahanger"}, {"authorId": "2111182040", "name": "S. M. Khan"}, {"authorId": "46217037", "name": "F. Masoodi"}], "citations": [{"paperId": "76d4df66c672b4d255e6fe64919879b25b55c559", "title": "Towards unbalanced multiclass intrusion detection with hybrid sampling methods and ensemble classification"}, {"paperId": "d5519b3e1c4314720781d780cb992afb0adc3006", "title": "Using Bidirectional Federated Transfer Learning for Intrusion Detection in Heterogeneous Industrial Internet of Things"}]}
