{"paperId": "6356c5263f4950f5cb5cacbc58747c57488b0d52", "publicationVenue": null, "title": "KRAKEN: a privacy-preserving data market for authentic data", "abstract": "Data marketplaces are online platforms that provide a way for individuals to monetize their (personal) data. In traditional data marketplaces, the data is uploaded to the marketplace platform in plain-text. Since the broker has access to all data, such marketplaces are risk to the users' privacy. We present a privacy-preserving marketplace that allows data owners to keep control over their data. We use secure multi-party computation to enable data consumers to evaluate expressive functions on a set of data. In our marketplace, the broker has neither access to the data nor the results of a function evaluation. Furthermore, our design ensures data-origin authenticity and enables data owners to define data-usage policies that are enforced by the computation nodes. In addition to the architecture of this private marketplace, we discuss a reference implementation. We also provide an evaluation of our approach, demonstrating its practicability.", "venue": "DE@CoNEXT", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-12-06", "journal": {"name": "Proceedings of the 1st International Workshop on Data Economy"}, "authors": [{"authorId": "2057030013", "name": "Karl Koch"}, {"authorId": "1703487", "name": "S. Krenn"}, {"authorId": "2069342", "name": "Tilen Marc"}, {"authorId": "35658818", "name": "Stefan More"}, {"authorId": "8206995", "name": "Sebastian Ramacher"}], "citations": [{"paperId": "2af3a98b47b7399cfe8919845c4c368844e79bc3", "title": "The unresolved need for dependable guarantees on security, sovereignty, and trust in data ecosystems"}, {"paperId": "a7a50e9864c30de966e24f39e37c6f5c22174e9e", "title": "Starlit: Privacy-Preserving Federated Learning to Enhance Financial Fraud Detection"}, {"paperId": "5057f000789ec9035332bef75a3204ddbf0b7944", "title": "A Decentralized Information Marketplace Preserving Input and Output Privacy"}, {"paperId": "6a52117f81f41181375d046f68df3a83842394f9", "title": "A Capability Description Language Design for Data Products"}, {"paperId": "40e4cb0fc1ebdecc6971498689bdb1b6b1f44217", "title": "An Introduction to Secret Sharing: A Systematic Overview and Guide for Protocol Selection"}]}
