{"paperId": "6366b6edce0fd2e7cf7ecc558b7b3df622815324", "publicationVenue": {"id": "6806a4fd-e465-4e63-aa7f-b8151ddee3a4", "name": "Inflammatory Bowel Diseases", "type": "journal", "alternate_names": ["Inflamm Bowel Dis"], "issn": "1078-0998", "url": "http://onlinelibrary.wiley.com/journal/10.1002/(issn)1536-4844"}, "title": "Comparative Effectiveness of Ustekinumab and Anti-TNF Agent as First-Line Biological Therapy in Luminal Crohn's Disease: A Retrospective Study From 2 Referral Centers.", "abstract": "BACKGROUND\nReal-life data on the efficacy of ustekinumab as first-line therapy for the treatment of luminal Crohn's disease (CD) compared with anti-tumor necrosis factor (anti-TNF) agents are lacking. We compared the clinical response rates at 3 months in 2 cohorts of biologic-naïve patients treated by ustekinumab and anti-TNF agents.\n\n\nMETHODS\nBiologic-naïve patients starting either ustekinumab or an anti-TNF agent for luminal CD between 2016 and 2019 in 2 tertiary centers were retrospectively included. The primary endpoint was clinical response at 3 months, defined as a Harvey-Bradshaw Index <4 or a 3-point drop in the score without steroids, need for CD-related surgery, or treatment discontinuation owing to failure or intolerance. Patients treated with ustekinumab were matched to patients receiving anti-TNF agents by a propensity score algorithm.\n\n\nRESULTS\nWe included 156 patients starting anti-TNF agents (95 adalimumab and 61 infliximab) and 50 ustekinumab. After matching, clinical response rates at 3 months were 64% and 86% in the ustekinumab and anti-TNF groups, respectively (P = .01). At 12 months, in multivariate analysis adjusted for disease duration, location, concomitant immunosuppressant and steroids, and symptoms, clinical remission was independently associated with the biological therapy received (odds ratio, 2.6 for anti-TNF agent vs ustekinumab; P = .02). With a median follow-up duration of 40 (interquartile range, 23-52) months, no difference was observed in terms of time to drug withdrawal (P = .29) or safety.\n\n\nCONCLUSIONS\nThis retrospective real-world data suggest that an anti-TNF agent as a first-line biological therapy is associated with higher rates of response at 3 months than ustekinumab in patients with CD.", "venue": "Inflammatory Bowel Diseases", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-02", "journal": {"name": "Inflammatory bowel diseases"}, "authors": [{"authorId": "39905914", "name": "P. Rivière"}, {"authorId": "123932271", "name": "C. Kanters"}, {"authorId": "51304039", "name": "G. Pellet"}, {"authorId": "2064136567", "name": "Alexander Ni"}, {"authorId": "1586812936", "name": "M. Hupé"}, {"authorId": "2150834649", "name": "N. Aboulhamid"}, {"authorId": "11513653", "name": "F. Poullenot"}, {"authorId": "2390664", "name": "A. Bitton"}, {"authorId": "5157485", "name": "F. Zerbib"}, {"authorId": "2133268090", "name": "P. Lakatos"}, {"authorId": "152387502", "name": "W. Afif"}, {"authorId": "7178123", "name": "D. Laharie"}, {"authorId": "6612892", "name": "T. Bessissow"}], "citations": [{"paperId": "e594ad6a48286d56f15ff6317ce20828cd3f051e", "title": "Ustekinumab in the Treatment of Inflammatory Bowel Diseases: Evolving Paradigms"}, {"paperId": "f983ff8a740b6aa07943e1e85894b088e11c1575", "title": "Clinical use of biologics for Crohn's disease in adults: lessons learned from real-world studies."}]}
