{"paperId": "638180af48c9d33b36bdc18d4dfd4bb4785d5dd6", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Learning cell-specific networks from dynamics and geometry of single cells", "abstract": "Cell dynamics and biological function are governed by intricate networks of molecular interactions. Inferring these interactions from data is a notoriously difficult inverse problem. The majority of existing network inference methods work at the population level to construct population-averaged representations of gene interaction networks, and thus do not naturally allow us to infer differences in gene regulation activity across heterogeneous cell populations. We introduce locaTE, an information theoretic approach that leverages single cell dynamical information together with geometry of the cell state manifold to infer cell-specific, causal gene interaction networks in a manner that is agnostic to the topology of the underlying biological trajectory. We find that factor analysis can give detailed insights into the inferred cell-specific GRNs. Through a detailed simulation study and application to three experimental datasets spanning mouse primitive endoderm formation, pancreatic development, and haematopoiesis, we demonstrate superior performance and additional insights compared to standard static GRN inference methods. We find that locaTE provides a powerful, efficient and scalable network inference method that allows us to distil cell-specific networks from single cell data. Graphical abstract Cell-specific network inference from estimated dynamics and geometry. LocaTE takes as input a transition matrix P that encodes inferred cellular dynamics as a Markov chain on the cell state manifold. By considering the coupling Xτ, X−τ, locaTE produces an estimate of transfer entropy for each cell i and each pair of genes j, k. Downstream factor analyses can extract coherent patterns of interactions in an unsupervised fashion.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2023-11-13", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2267014924", "name": "Stephen Y Zhang"}, {"authorId": "2238218691", "name": "M. P. Stumpf"}], "citations": []}
