{"paperId": "6384921f1bd1059c6b4c37ac3c4e4f19e45d40c1", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Development of meta-prompts for Large Language Models to screen titles and abstracts for diagnostic test accuracy reviews", "abstract": "Systematic reviews (SRs) are a critical component of evidence-based medicine, but the process of screening titles and abstracts is time-consuming. This study aimed to develop and externally validate a method using large language models to classify abstracts for diagnostic test accuracy (DTA) systematic reviews, thereby reducing the human workload. We used a previously collected dataset for developing DTA abstract classifiers and applied prompt engineering. We developed an optimized meta-prompt for Generative Pre-trained Transformer (GPT)-3.5-turbo and GPT-4 to classify abstracts. In the external validation dataset 1, the prompt with GPT-3.5 turbo showed a sensitivity of 0.988, and a specificity of 0.298. GPT-4 showed a sensitivity of 0.982, and a specificity of 0.677. In the external validation dataset 2, GPT-3.5 turbo showed a sensitivity of 0.919, and a specificity of 0.434. GPT-4 showed a sensitivity of 0.806, and a specificity of 0.740. If we included eligible studies from among the references of the identified studies, GPT-3.5 turbo had no critical misses, while GPT-4 had some misses. Our study indicates that GPT-3.5 turbo can be effectively used to classify abstracts for DTA systematic reviews. Further studies using other dataset are warranted to confirm our results. Additionally, we encourage the use of our framework and publicly available dataset for further exploration of more effective classifiers using other LLMs and prompts (https://github.com/youkiti/ARE/).", "venue": "medRxiv", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2023-11-01", "journal": null, "authors": [{"authorId": "2262967319", "name": "Y. Kataoka"}, {"authorId": "2263269240", "name": "R. So"}, {"authorId": "2263269111", "name": "M. Banno"}, {"authorId": "2263276596", "name": "J. Kumasawa"}, {"authorId": "2263261571", "name": "H. Someko"}, {"authorId": "2263276574", "name": "S. Taito"}, {"authorId": "2262988267", "name": "T. Terasawa"}, {"authorId": "2262928450", "name": "Y. Tsujimoto"}, {"authorId": "2262989505", "name": "Y. Tsutsumi"}, {"authorId": "2262919634", "name": "Y. Wada"}, {"authorId": "2263179014", "name": "T. A. Furukawa"}], "citations": []}
