{"paperId": "639600747db6db751f8db7c32edede25169aae87", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Cooperative Coevolution for Non-Separable Large-Scale Black-Box Optimization: Convergence Analyses and Distributed Accelerations", "abstract": "Given the ubiquity of non-separable optimization problems in real worlds, in this paper we analyze and extend the large-scale version of the well-known cooperative coevolution (CC), a divide-and-conquer black-box optimization framework, on non-separable functions. First, we reveal empirical reasons of when decomposition-based methods are preferred or not in practice on some non-separable large-scale problems, which have not been clearly pointed out in many previous CC papers. Then, we formalize CC to a continuous-game model via simplification, but without losing its essential property. Different from previous evolutionary game theory for CC, our new model provides a much simpler but useful viewpoint to analyze its convergence, since only the pure Nash equilibrium concept is needed and more general fitness landscapes can be explicitly considered. Based on convergence analyses, we propose a hierarchical decomposition strategy for better generalization, as for any decomposition, there is a risk of getting trapped into a suboptimal Nash equilibrium. Finally, we use powerful distributed computing to accelerate it under the recent multi-level learning framework, which combines the fine-tuning ability from decomposition with the invariance property of CMA-ES. Experiments on a set of high-dimensional test functions validate both its search performance and scalability (w.r.t. CPU cores) on a clustering computing platform with 400 CPU cores.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-11", "journal": {"name": "ArXiv", "volume": "abs/2304.05020"}, "authors": [{"authorId": "2829886", "name": "Qiqi Duan"}, {"authorId": "2064322889", "name": "Chang Shao"}, {"authorId": "2176938199", "name": "Guochen Zhou"}, {"authorId": "102320235", "name": "Hao Yang"}, {"authorId": "2110560213", "name": "Qi Zhao"}, {"authorId": "2051687296", "name": "Yuhui Shi"}], "citations": [{"paperId": "745ecc578bfbb9cc16bafc5ba3049644439883da", "title": "Distributed Evolution Strategies with Multi-Level Learning for Large-Scale Black-Box Optimization"}]}
