{"paperId": "639c43061f66baa5f7101917e45ec3083fffbd0c", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Towards Detecting Pneumonia Progression in COVID-19 Patients by Monitoring Sleep Disturbance Using Data Streams of Non-Invasive Sensor Networks", "abstract": "Pneumonia caused by COVID-19 is a severe health risk that sometimes leads to fatal outcomes. Due to constraints in medical care systems, technological solutions should be applied to diagnose, monitor, and alert about the disease’s progress for patients receiving care at home. Some sleep disturbances, such as obstructive sleep apnea syndrome, can increase the risk for COVID-19 patients. This paper proposes an approach to evaluating patients’ sleep quality with the aim of detecting sleep disturbances caused by pneumonia and other COVID-19-related pathologies. We describe a non-invasive sensor network that is used for sleep monitoring and evaluate the feasibility of an approach for training a machine learning model to detect possible COVID-19-related sleep disturbances. We also discuss a cloud-based approach for the implementation of the proposed system for processing the data streams. Based on the preliminary results, we conclude that sleep disturbances are detectable with affordable and non-invasive sensors.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "9425010", "name": "Ace Dimitrievski"}, {"authorId": "2269444", "name": "Eftim Zdravevski"}, {"authorId": "1769456", "name": "Petre Lameski"}, {"authorId": "1391499182", "name": "M. Villasana"}, {"authorId": "2059024940", "name": "Ivan Miguel Pires"}, {"authorId": "2112807", "name": "N. Garcia"}, {"authorId": "1404190954", "name": "Francisco Flórez-Revuelta"}, {"authorId": "3272045", "name": "V. Trajkovik"}], "citations": [{"paperId": "d237e45328aa228c55bc8bd6b33be563c06d52a3", "title": "Noninvasive monitoring technologies to identify discomfort and distressing symptoms in persons with limited communication at the end of life: a scoping review"}, {"paperId": "1516068401e3547a82ee4b98c59a661df4ad3bf4", "title": "Caring jacket: health monitoring jacket integrated with the internet of things for COVID-19 patients"}, {"paperId": "31b5e8446e9859e4b44beb973063ae98a1dfbd1d", "title": "Sleep Quality in the Survivors of COVID-19"}, {"paperId": "ef1a7ffa4c7089a387ec849903d57e06c8c5bf8c", "title": "Rural Healthcare IoT Architecture Based on Low-Energy LoRa"}, {"paperId": "7c6a8ae00c12be2586fb9a6837a453ad96102252", "title": "Facilitating privacy-preserving activity recognition in age-friendly environments through low-power devices"}, {"paperId": "78fe680fab6d7b67df200a8eb6bffd8d137f2bfa", "title": "Artificial Intelligence and Internet of Things (AI-IoT) Technologies in Response to COVID-19 Pandemic: A Systematic Review"}]}
