{"paperId": "63a0bc32632415b95b782ff9002f2ce8ec2cd2f7", "publicationVenue": {"id": "8eb00c73-e022-4bd6-b48b-1d3b2ccf107d", "name": "Quantum Science and Technology", "alternate_names": ["Quantum Sci Technol"], "issn": "2364-9062", "alternate_issns": ["2058-9565"], "url": "https://iopscience.iop.org/2058-9565", "alternate_urls": ["http://iopscience.iop.org/journal/2058-9565"]}, "title": "Signatures of a sampling quantum advantage in driven quantum many-body systems", "abstract": "A crucial milestone in the field of quantum simulation and computation is to demonstrate that a quantum device can perform a computation task that is classically intractable. A key question is to identify setups that can achieve such goal within current technologies. In this work, we provide formal evidence that sampling bit-strings from a periodic evolution of a unitary drawn from the circular orthogonal ensemble (COE) cannot be efficiently simulated with classical computers. As the statistical properties of COE coincide with a large class of driven analog quantum systems thanks to the Floquet eigenstate thermalization hypothesis, our results indicate the possibility that those driven systems could constitute practical candidates for a sampling quantum advantage. To further support this, we give numerical examples of driven disordered Ising chains and 1D driven Bose–Hubbard model.", "venue": "Quantum Science and Technology", "year": 2020, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2020-02-27", "journal": {"name": "Quantum Science and Technology", "volume": "8"}, "authors": [{"authorId": "13210350", "name": "J. Tangpanitanon"}, {"authorId": "148151137", "name": "Supanut Thanasilp"}, {"authorId": "40493737", "name": "M. Lemonde"}, {"authorId": "102757036", "name": "Ninnat Dangniam"}, {"authorId": "2863772", "name": "D. Angelakis"}], "citations": [{"paperId": "5fcc0ee330262e430217ded4d698551ff1f73837", "title": "Nearly optimal quasienergy estimation and eigenstate preparation of time-periodic Hamiltonians by Sambe space formalism"}, {"paperId": "a0350da17ff87e4fe4f97ea6a9f53650e673cf58", "title": "Characteristic features of the strongly-correlated regime: Lessons from a 3-fermion one-dimensional harmonic trap"}, {"paperId": "a77f3ced14baa8366d34d66004b08925c789c31b", "title": "High performance Boson Sampling simulation via data-flow engines}"}, {"paperId": "358bec705310f1aa276be3179f91f5d6cb24d3cf", "title": "Efficiently Extracting Multi-Point Correlations of a Floquet Thermalized System"}, {"paperId": "6e78ee22d285243084d3fe3bb774d7f557098b6e", "title": "Complexity phase transitions in instantaneous quantum polynomial-time circuits"}]}
