{"paperId": "63a90a7ecc4ff1d740b6ff8e62ee897fc3d13ade", "publicationVenue": {"id": "97a677bb-0fa7-4c1d-a54e-24db1fb98dd5", "name": "International Conference on Computational Intelligence and Communication Networks", "type": "conference", "alternate_names": ["CICN", "Int Conf Comput Intell Commun Netw"]}, "title": "Exploration on Heterogeneous Network Security Monitoring Algorithm Based on Big data Intelligent Information Technology", "abstract": "Heterogeneous wireless networks (HWNs) have security risks and challenges, and traditional network security monitoring methods are difficult to meet the security needs. This paper analyzes and researches the security monitoring algorithm of HWNs based on big data intelligent information technology, analyzes the security monitoring algorithm of HWNs based on big data intelligent information technology, which is able to dig out potential security threats from the massive network data and carry out real-time monitoring and early warning through the use of big data correlation algorithm and network security management algorithm. The experimental tests on HWNs show that big data intelligent information technology can reduce the risk of HWN environment. the accuracy and precision of HWNs events are improved, the accuracy rate is increased by about 1.2% and the precision rate is increased by about 1.1%. The feasibility and effectiveness of the HWNs safety monitoring algorithm based on big data intelligent information technology is verified, which lays the foundation for more research in this field", "venue": "International Conference on Computational Intelligence and Communication Networks", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-22", "journal": {"name": "2023 IEEE 15th International Conference on Computational Intelligence and Communication Networks (CICN)", "pages": "154-158"}, "authors": [{"authorId": "2282077632", "name": "Xiaomeng Duan"}, {"authorId": "2282100333", "name": "Yun Zhou"}, {"authorId": "2204841436", "name": "Jiabin Guan"}], "citations": []}
