{"paperId": "63ba2ea9a8066be409edf2079636dfd809be3b41", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Predicting Fraud in Financial Payment Services through Optimized Hyper-Parameter-Tuned XGBoost Model", "abstract": "Online transactions, medical services, financial transactions, and banking all have their share of fraudulent activity. The annual revenue generated by fraud exceeds $1 trillion. Even while fraud is dangerous for organizations, it may be uncovered with the help of intelligent solutions such as rules engines and machine learning. In this research, we introduce a unique hybrid technique for identifying financial payment fraud by combining nature-inspired-based Hyperparameter tuning with several supervised classifier models, as implemented in a modified version of the XGBoost Algorithm. At the outset, we split out a sample of the full financial payment dataset to use as a test set. We use 70% of the data for training and 30% for testing. Records that are known to be illegitimate or fraudulent are predicted, while those that raise suspicion are further investigated using a number of machine learning algorithms. The models are trained and validated using the 10-fold cross-validation technique. Several tests using a dataset of actual financial transactions are used to demonstrate the effectiveness of the proposed approach.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-09", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "38298800", "name": "Surjeet Dalal"}, {"authorId": "84156264", "name": "Bijeta Seth"}, {"authorId": "37270470", "name": "M. Radulescu"}, {"authorId": "118717971", "name": "C. Secară"}, {"authorId": "119266815", "name": "Claudia Tolea"}], "citations": [{"paperId": "631c574817613b0119a0183d05d96a5440d408a7", "title": "A Generalized Linear Model and Machine Learning Approach for Predicting the Frequency and Severity of Cargo Insurance in Thailand’s Border Trade Context"}, {"paperId": "b468e8b4fa985893c30cc66f29e629e419631771", "title": "A Novel Ensemble Model for Load Forecasting: Integrating Random Forest, XGBoost, and Seasonal Naive Methods"}, {"paperId": "3d86ce897cd7f70f92b5b7a5599b34c494cd9814", "title": "Hyperparameters Optimization in XGBoost Model for Rainfall Estimation: A Case Study in Pontianak City"}, {"paperId": "c2646cf54847769ef6c91eefb4cc657b49ff3b56", "title": "Combination of XGBoost - Grid Search with SVM for Diabetes Diagnostics"}, {"paperId": "dec45b081c23772b4e3fd71e99297022542c82d2", "title": "Hybrid deep learning model for IT-OT integration in Industry 4.0"}, {"paperId": "27a3dc61789f3fd20acbef1e29368fe59c9a9310", "title": "The Imbalanced Classification of Fraudulent Bank Transactions Using Machine Learning"}, {"paperId": "003ee3155d1c4c4413b05f5bc2af1128f9941c65", "title": "Cybersecurity enhancement to detect credit card frauds in health care using new machine learning strategies"}, {"paperId": "7efb1fed2ca43d3d4c8489f57d4223e6118becdd", "title": "Prediction of power network planning demand coefficient using eXtreme Gradient Boosting algorithm"}, {"paperId": "bd85d0c2de1ba2a6e49c2a2be7212ab2ec43f531", "title": "General-purpose Unsupervised Cyber Anomaly Detection via Non-negative Tensor Factorization"}, {"paperId": "1a8efd5aa2ff02f59502cafac59f193faa259ccd", "title": "Algorithmic Implementation for Insurance Fraud Detection"}]}
