{"paperId": "63c9a423aff95bae8955f267a4eb466e5be40be9", "publicationVenue": {"id": "449b5e8b-cda2-4a8e-b27b-9b7917ded9eb", "name": "Journal of Computer Science", "type": "journal", "alternate_names": ["Journal of Computational Science", "J Comput Sci"], "issn": "1549-3636", "alternate_issns": ["1877-7503", "2362-0110"], "url": "https://thescipub.com/journals/jcs/", "alternate_urls": ["http://ansinet.org/sciencepub/c4p.php?j_id=jcs", "https://www.journals.elsevier.com/journal-of-computational-science", "http://journals.sjp.ac.lk/index.php/jcs", "http://www.sciencedirect.com/science/journal/18777503"]}, "title": "S-CPM: Semantic-Similarity Cluster based Privacy Preservation Model with Cell Generalization Principle", "abstract": "Corresponding Author: Satish B Basapur Department of Information Science and Engineering, Dr. Ambedkar Institute of Technology, Bengaluru560056, India Email: satish.basapur@gmail.com Abstract: Timely data analysis on a wide variety and a large volume of data unveil valuable information or new insights. The analysis results could be used to innovate new avenues in health care service, business and e-service, etc. However, releasing, storing and reusing sensitive data to third parties results in breaching the data privacy of the individual. To combat privacy breach invasion, privacy-preserving techniques such as suppression, generalization and encryption-based privacy models have been proposed in the literature. The widely used privacy preservation model k-anonymity model prevents record-linkage invasions but fails to satisfy monotonicity property. It has more data distortion and fails to defend semantic-similarity, closeness, nearest-neighborhood data privacy breaches. Moreover, existing approaches are not scalable for the large-scale data set. The paper proposes a semantic similarity two-phase cluster based privacy preservation model. The proposed model considers both numerical and categorical attribute values for data anonymization. Two-phase clustering contains two phases. In the first phase, the t-centroid clustering algorithm is designed and used to partition a set of transaction records of data set D into a set of t-centroids based on the Euclidean distance between transaction records. In the second phase, the neighborhood-aware hierarchical clustering algorithm is designed. It is used to split a set of transaction records within clusters based on neighborhood aware attribute values. Two-phase clustering operations are carried out in parallel and scalable for Big Data sets. The proposed privacy model relies on cell generalization to combat records linkage and semantic-similarity, closeness, nearest-neighborhood privacy breach invasion. All experiments are carried out on two different datasets: Income-Census (KDD) and Bank Credit Card dataset. The experimental results demonstrate that the proposed privacy model can combat privacy breach invasion with cell generalization principles. The proposed privacy model is scalable and time efficient for large-scale data sets.", "venue": "Journal of Computer Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-01", "journal": {"name": "Journal of Computer Science"}, "authors": [{"authorId": "3268084", "name": "S. B. Basapur"}, {"authorId": "100824690", "name": "B. Shylaja"}, {"authorId": "2073568591", "name": "Venkatesh"}], "citations": []}
