{"paperId": "63dea65e4e1418cdee4d448c04660a9db657a793", "publicationVenue": null, "title": "A systematic overview of data federation systems", "abstract": "Data federation addresses the problem of uniformly accessing multiple, possibly heterogeneous data sources, by mapping them into a unified schema, such as an RDF(S)/OWL ontology or a relational schema, and by supporting the execution of queries, like SPARQL or SQL queries, over that unified schema. Data explosion in volume and variety has made data federation increasingly popular in many application domains. Hence, many data federation systems have been developed in industry and academia, and it has become challenging for users to select suitable systems to achieve their objectives. In order to systematically analyze and compare these systems, we propose an evaluation framework comprising four dimensions: (i) federation capabilities, i.e., query language, data source, and federation techniques; (ii) data security, i.e., authentication, authorization, auditing, encryption, and data masking; (iii) interface, i.e., graphical interface, command line interface, and application programming interface; and (iv) development, i.e., main development language, deployment, commercial support, open source, and release. Using this framework, we thoroughly studied 51 data federation systems from the Semantic Web and Database communities. This paper shares the results of our investigation and aims to provide reference material and insights for users, developers and researchers selecting or further developing data federation systems.", "venue": "Semantic Web", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-06", "journal": {"name": "Semantic Web", "pages": "107-165", "volume": "15"}, "authors": [{"authorId": "39188049", "name": "Zhenzhen Gu"}, {"authorId": "2650912", "name": "F. Corcoglioniti"}, {"authorId": "1796236", "name": "D. Lanti"}, {"authorId": "1806182", "name": "A. Mosca"}, {"authorId": "47490276", "name": "Guohui Xiao"}, {"authorId": "2185174421", "name": "Jingliu Xiong"}, {"authorId": "2072276517", "name": "D. Calvanese"}], "citations": [{"paperId": "7ec3a318fabf487305869cb23389538d0f76de13", "title": "Semantic Data Management in Data Lakes"}, {"paperId": "138291f571ddfc3bf41c88d4895513d8a66aff29", "title": "Ontology-based Data Federation"}, {"paperId": "f5353209e85701e350b3a76d22a317f199971d3c", "title": "On the Use of Virtual Knowledge Graphs to Improve Environmental Sensor Data Accessibility"}, {"paperId": "8ce8cd5f6a2bbfa97a58e66b3d93ac7d0aeccd00", "title": "Ontology-Based Data Federation - A Framework Proposal"}, {"paperId": "c155f96ece6c59cfb5e966280df0e55bf7e85981", "title": "InteGraal: a Tool for Data-Integration and Reasoning on Heterogeneous and Federated Sources"}]}
