{"paperId": "63e3ce5105f32b23f2fb524382da31099d734f67", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "Energy‐efficient multiperiod planning of optical core network to support 5G networks", "abstract": "With the rapid growth of traffic and power consumption in information and communication technology industry for decades, improving energy efficiency has become a challenging issue in recent years. Especially, the pervasive access to Internet via mobile devices will cause wireless traffic volume increment by 1000+ times in near future, which is expected to be carried by the fifth generation ultradense cellular network. Following this trend, the core network where optical fibers are deployed to deliver aggregated traffic needs upgrading to accommodate the increasing traffic volume. To match with the traffic growth rate, we should conduct efficient network planning over multiple time periods. Moreover, considering the heterogeneity in the bandwidth requirements among various network services, flexible mixed line rate scheme is adopted in network provisioning. In this paper, we study the long‐term multiperiod planning of optical core network by considering the traffic growth with the objective of high energy‐efficiency. Three planning strategies, say All‐period, Incremental, and End‐of‐Life, respectively, are studied and formulated as mixed integer linear programming models with the objective to minimize power consumption of optical core network. Given the estimation on the reduction of power consumed by various network devices, we can deploy network devices flexibly in each period through the optimization models. Performance of the proposed models is also evaluated and compared via case studies.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2017, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-09-01", "journal": {"name": "Transactions on Emerging Telecommunications Technologies", "volume": "28"}, "authors": [{"authorId": "48218788", "name": "Bingbing Li"}, {"authorId": "40572483", "name": "Limei Peng"}, {"authorId": "3015307", "name": "Yixue Hao"}, {"authorId": "3468591", "name": "Yiming Miao"}, {"authorId": "1745717", "name": "Mohammad Mehedi Hassan"}], "citations": [{"paperId": "6238cc10407e473c427e7cdfe2ee775a691497c7", "title": "A metaheuristic approach for source traffic grooming in elastic optical networks"}]}
