{"paperId": "63e5b3ea98e7e7aeaf1290e0f96a086906311225", "publicationVenue": {"id": "4e46790b-e240-4236-9b8d-a70ed74f900a", "name": "IEEE Transactions on Mobile Computing", "type": "journal", "alternate_names": ["IEEE Trans Mob Comput"], "issn": "1536-1233", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7755", "alternate_urls": ["http://www.computer.org/portal/web/tmc"]}, "title": "CrossVision: Real-Time On-Camera Video Analysis via Common RoI Load Balancing", "abstract": "Smart cameras with on-device deep learning inference capabilities are enabling distributed video analytics at the data source without sending raw video data over the often unreliable and congested wireless network. However, how to unleash the full potential of the computing power of the camera network requires careful coordination among the distributed cameras, catering to the uneven workload distribution and the heterogeneous computing capabilities. This paper presents CrossVision, a distributed framework for real-time video analytics, that retains all video data on cameras while achieving low inference delay and high inference accuracy. The key idea behind CrossVision is that there is a significant information redundancy in the video content captured by cameras with overlapped Field-of-Views (FoVs), which can be exploited to reduce inference workload as well as improve inference accuracy between correlated cameras. CrossVision consists of three main components to realize its function: a Region-of-Interest (RoI) Matcher that discovers video content correlation based on a segmented FoV transformation scheme; a Workload Balancer that implements a randomized workload balancing strategy based on a bulk-queuing analysis, taking into account the cameras’ predicted future workload arrivals; an Accuracy Guard that ensures that the inference accuracy is not sacrificed as redundant information is discarded. We evaluate CrossVision in a hardware-augmented simulator and on real-world cross-camera datasets, and the results show that CrossVision is able to significantly reduce inference delay while improving the inference accuracy compared to a variety of baseline approaches.", "venue": "IEEE Transactions on Mobile Computing", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-05-01", "journal": {"name": "IEEE Transactions on Mobile Computing", "pages": "5027-5039", "volume": "23"}, "authors": [{"authorId": "2051634255", "name": "Letian Zhang"}, {"authorId": "40455678", "name": "Jie Xu"}, {"authorId": "2140095415", "name": "Zhuo Lu"}, {"authorId": "29042285", "name": "Linqi Song"}], "citations": []}
