{"paperId": "63e83be6d775fad74e9380c10ef17a036a097a96", "publicationVenue": {"id": "273f831c-c096-4ed6-b65d-c7c4e93a13f7", "name": "Jurnal Cakrawala Pendas", "alternate_names": ["J Cakrawala Pendas"], "issn": "2442-7470", "url": "https://jurnal.unma.ac.id/index.php/CP"}, "title": "ANALYSIS OF DIFFICULTIES AND METACOGNITION ABILITIES OF PRE-SERVICE PRIMARY SCHOOL TEACHERS IN REVIEWING RESEARCH ARTICLES", "abstract": "Pre-service teacher do not understand how to do a good article review, including difficulty finding important elements in an article, difficulty creating relevant questions, or difficulty evaluating research methodology. This actually supports students' cognitive abilities. This study aimed to analyze students' difficulties and metacognitive abilities in reviewing scientific articles. The research method used is descriptive-qualitative, and the data collection techniques used are interviews and assignments. Carried out on 40 PGSD UMG class B students in the Educational Foundations course. Data analysis techniques using a theory-driven thematic approach The results obtained from metacognitive abilities are 1) developing planning, namely analysis of research objectives in articles, analysis of research methodology, analysis of research results, analysis of conclusions, analysis of bibliography; 2) Monitoring implementation, namely setting schedules and time limits, providing solutions to review difficulties, evaluating the student article review process; 3) evaluate the actions obtained for advantages (critical analysis skills, literacy abilities, insight into research and development) and shortcomings (misunderstanding of the concept of understanding the article, not noting the weaknesses of the article, feedback that is not detailed enough). Students are expected to construct knowledge through learning and provide insight into research and development in education.\nMahasiswa  calon guru tidak memahami bagaimana melakukan review artikel yang baik termasuk kesulitan menemukan elemen penting dalam sebuah artikel, kesulitan membuat pertanyaan yang relevan, atau kesulitan mengevaluasi metodologi penelitian. Hal tersebut sebenarnya mendukung kemampuan kognisi mahasiswa. Tujuan penelitian ini untuk menganalisis kesulitan dan kemampuan metakognisi mahasiswa dalam melakukan review artikel ilmiah. Metode penelitian yang digunakan adalah deskriptif kualitatif dengan teknik pengumpulan data yang digunakan adalah wawancara dan penugasan. Dilakukan pada 40 mahasiswa PGSD UMG kelas B di mata kuliah Landasan Pendidikan. Teknik analisis data dengan menggunakan pendekatan tematik theory driven. Hasil yang didapatkan kemampuan metakognisi 1) mengembangkan perencanaan yaitu analisis tujuan penelitian dalam artikel, analisis metodologi penelitian, analisis hasil penelitian, analisis kesimpulan, analisis daftar pustaka; 2) Memonitor pelaksanaan yaitu pengaturan jadwal dan batas waktu, pemberian solusi pada kesulitan review, evaluasi proses review artikel mahasiswa; 3) mengevaluasi tindakan diperoleh kelebihan (keterampilan analisis kritis, kemampuan literasi, wawasan penelitian dan pengembangan) dan kekurangan (kesalahan konsep memahami artikel, tidak mencatat kelemahan artikel, umpan balik yang tidak cukup rinci). Mahasiswa diharapkan mengkonstruk pengetahuan melalui pembelajaran dan memberikan wawasan penelitian dan pengembangan dalam dunia pendidikan.", "venue": "Jurnal Cakrawala Pendas", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-31", "journal": {"name": "Jurnal Cakrawala Pendas"}, "authors": [{"authorId": "2130398280", "name": "Arya Setya Nugroho"}], "citations": []}
