{"paperId": "63eb5a80bf64f8877125a17db8ff489f1813c9fc", "publicationVenue": null, "title": "Data Dissemination for Industry 4.0 Applications in Internet of Vehicles Based on Short-term Traffic Prediction", "abstract": "As a key use case of Industry 4.0 and the Smart City, the Internet of Vehicles (IoV) provides an efficient way for city managers to regulate the traffic flow, improve the commuting performance, reduce the transportation facility cost, alleviate the traffic jam, and so on. In fact, the significant development of Internet of Vehicles has boosted the emergence of a variety of Industry 4.0 applications, e.g., smart logistics, intelligent transforation, and autonomous driving. The prerequisite of deploying these applications is the design of efficient data dissemination schemes by which the interactive information could be effectively exchanged. However, in Internet of Vehicles, an efficient data scheme should adapt to the high node movement and frequent network changing. To achieve the objective, the ability to predict short-term traffic is crucial for making optimal policy in advance. In this article, we propose a novel data dissemination scheme by exploring short-term traffic prediction for Industry 4.0 applications enabled in Internet of Vehicles. First, we present a three-tier network architecture with the aim to simply network management and reduce communication overheads. To capture dynamic network changing, a deep learning network is employed by the controller in this architecture to predict short-term traffic with the availability of enormous traffic data. Based on the traffic prediction, each road segment can be assigned a weight through the built two-dimensional delay model, enabling the controller to make routing decisions in advance. With the global weight information, the controller leverages the ant colony optimization algorithm to find the optimal routing path with minimum delay. Extensive simulations are carried out to demonstrate the accuracy of the traffic prediction model and the superiority of the proposed data dissemination scheme for Industry 4.0 applications.", "venue": "ACM Trans. Internet Techn.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-25", "journal": {"name": "ACM Transactions on Internet Technology (TOIT)", "pages": "1 - 18", "volume": "22"}, "authors": [{"authorId": "4562384", "name": "Chen Chen"}, {"authorId": "2149098823", "name": "Lei Liu"}, {"authorId": "31197849", "name": "Shaohua Wan"}, {"authorId": "2134933298", "name": "Xiaozhe Hui"}, {"authorId": "39718931", "name": "Qingqi Pei"}], "citations": [{"paperId": "6461e8f6c53f90fb506e71148c5a21d84cf6ef0a", "title": "An Influence Maximization-Based Hybrid Advertising Dissemination for Internet of Vehicles"}, {"paperId": "1f2cf8d0d88734a6ad329897b269140b66d32e60", "title": "A Smart Sensing Technologies-Based Intelligent Healthcare System for Diabetes Patients"}, {"paperId": "ce8d99541418de79080311f3c909d55c69619ccd", "title": "RTRV: An RSU-assisted trust-based routing protocol for VANETs"}, {"paperId": "cd39711028fb1780ad641bfb41ef87ebbd96f2e3", "title": "LAE-GAN: a novel cloud-based Low-light Attention Enhancement Generative Adversarial Network for unpaired text images"}, {"paperId": "e563ac903e7bc7b5f5aa65ec8acf32613e125c47", "title": "Time Series Prediction in Industry 4.0: A Comprehensive Review and Prospects for Future Advancements"}, {"paperId": "a0c703c255ca554508487b902bb4233f71f8738b", "title": "Edge Computing Driven Low-Light Image Dynamic Enhancement for Object Detection"}, {"paperId": "ca8477f8a922ee42f985d344d0157e2b8d09c529", "title": "Computation Efficiency Maximization in Multi-UAV-Enabled Mobile Edge Computing Systems Based on 3D Deployment Optimization"}, {"paperId": "ef3bec1e422ef64cea9b20eb9cf4676f6262468a", "title": "An adaptive traffic flow prediction model based on spatiotemporal graph neural network"}, {"paperId": "4edb2e1715361c859317ea8626d7fd9d9899b58d", "title": "Traffic Safety Oriented Multi-Intersection Flow Prediction Based on Transformer and CNN"}, {"paperId": "2ee30f619c115318e4649c88fe61703e5be20795", "title": "Aerial Edge Computing on Orbit: A Task Offloading and Allocation Scheme"}, {"paperId": "ccdd0a7391f37dd731b266d1b6456cf7b8d97d01", "title": "Vehicle destination prediction with spatial clustering and machine learning"}, {"paperId": "cc982540fe75856d6cc02ff0e19ae974a2b5c47c", "title": "Vision-Based Semantic Segmentation in Scene Understanding for Autonomous Driving: Recent Achievements, Challenges, and Outlooks"}, {"paperId": "d2e7b39cbd04515b4e202f87fd40c35109afbb5a", "title": "PPEFL: An Edge Federated Learning Architecture with Privacy-Preserving Mechanism"}, {"paperId": "978274279b1fd7db8ed1d3db5a97b2a3cd9a7021", "title": "Formal  Model and Analysis for the Random Event in the Intelligent Car with Stochastic Petri Nets and Z"}, {"paperId": "d5494d693477037bf2bd068774e876cb127e757d", "title": "Game-Theoretical Data Offloading for NOMA-Enabled Urban Internet of Things"}, {"paperId": "9058ffc4694eaf4db743429d35ac361be8384a43", "title": "A Homomorphic Signcryption-Based Privacy Preserving Federated Learning Framework for IoTs"}, {"paperId": "7962e3f7e3b8978e8d3acb17ac916078639e15ba", "title": "A Fusion Localization Algorithm with Adaptive Kalman Gain for Port Container Seamless Positioning"}, {"paperId": "4435573c37d1c19b8409f50add53687e713ff9b6", "title": "VeNet: Hybrid Stacked Autoencoder Learning for Cooperative Edge Intelligence in IoV"}, {"paperId": "87a4749296ab3a0c5c31fc1e1913b9028b11118e", "title": "Efficiency and Fairness Oriented Dynamic Task Offloading in Internet of Vehicles"}, {"paperId": "5f3d1b6219b3c309a2bf80cab9411abfade246e3", "title": "Reputation-based service provisioning for vehicular fog computing"}, {"paperId": "15adf96b4e38a7fc713fbc4884d0847b1d9e50df", "title": "MEC-Based Dynamic Controller Placement in SD-IoV: A Deep Reinforcement Learning Approach"}, {"paperId": "0719082b6cad16c8d434d78ddbd3f2e0769ce78c", "title": "Toward Collaborative Intelligence in IoV Systems: Recent Advances and Open Issues"}, {"paperId": "a8e8b1baef4addb9af1ec10b529b3084f0817bb1", "title": "Joint Intent Detection Model for Task-oriented Human-Computer Dialogue System using Asynchronous Training"}, {"paperId": "a95406467c56c549f3cc5089a9584bfee5bc4099", "title": "Light Gradient Boosting Machine-Based Link Quality Prediction for Wireless Sensor Networks"}, {"paperId": "a1968f59e34c5e7decf47893b265a36c13b67812", "title": "Data fusion for ITS: A systematic literature review"}, {"paperId": "4e16300be4651ded3a42b5eb5c89e4491432e1d7", "title": "FedDQ: A communication-efficient federated learning approach for Internet of Vehicles"}, {"paperId": "bdc9bffc7026afbbd8618e51ee853d02f40ec5b8", "title": "Water Gauge Image Augmentation based on Generative Adversarial Network"}, {"paperId": "10122afc4b05db50cf136895a2981bc0dd2a2347", "title": "An integrated mediapipe-optimized GRU model for Indian sign language recognition"}, {"paperId": "ab791d5003f7cbf84376762b478f042c1d9f9e2e", "title": "Applications of ML/DL in the management of smart cities and societies based on new trends in information technologies: A systematic literature review"}, {"paperId": "e5b9b4704ce649023bc0e14cc6aa8ca6b8af724f", "title": "Frequency Feature Pyramid Network With Global-Local Consistency Loss for Crowd-and-Vehicle Counting in Congested Scenes"}, {"paperId": "4d31af3a4b1bce5a2dab342b2a5976fcf59f7ca4", "title": "Layered methods for updating AIoT-compatible TCAMS in B5G-enabled WSNs"}, {"paperId": "a33420cd0b4f6ce5c9f5c37d38aaf2da5c083907", "title": "User-optimized data transmission scheduling based on edge community service in opportunistic social network"}, {"paperId": "16f55137af274e1d23f22d95082394daca037e25", "title": "Deep Reinforcement Learning for Load Balancing of Edge Servers in IoV"}, {"paperId": "570ce177d6307dc4d9f8930e1d8466046975c74c", "title": "Monocular 3D object detection with Pseudo-LiDAR confidence sampling and hierarchical geometric feature extraction in 6G network"}, {"paperId": "e1d1e10e0e10a0ff763d3c30fa40dcc5cfc4451b", "title": "Orbital collaborative learning in 6G space-air-ground integrated networks"}, {"paperId": "3552c15ebc7aff9bec2d5ce41a1cf821884b2886", "title": "CE-text: A context-Aware and embedded text detector in natural scene images"}, {"paperId": "26e3c94910689bd83b6eab150a274dd8fc67d67a", "title": "Adaptive multiple imputations of missing values using the class center"}, {"paperId": "93d30e22ce7a9c9cc74dbe6dcc2d00b89657a393", "title": "Data-Driven Approach for the Short-Term Business Climate Forecasting Based on Power Consumption"}, {"paperId": "4de4fcd2e4a99eb37674d2a24e562e075ac61d40", "title": "Intelligent Roller Bearing Fault Diagnosis in Industrial Internet of Things"}, {"paperId": "07db9036b75a8860da12605767c4460339e971fb", "title": "A World-Self Model Towards Understanding Intelligence"}, {"paperId": "daab2db2e4cbb2ac75a4747e2703fa93ad0d3496", "title": "An edge intelligence empowered flooding process prediction using Internet of things in smart city"}, {"paperId": "fe3a529b7ba1d87ba4dbf4e52c17de9000ff6282", "title": "Multi-Controller Deployment in SDN-Enabled 6G Space-Air-Ground Integrated Network"}, {"paperId": "4905315ab99ea19871a65e52be8c8c51624748aa", "title": "A hybrid-attention semantic segmentation network for remote sensing interpretation in land-use surveillance"}, {"paperId": "e8b78ba43a3162f8adf9dceb9296eec138dfa8f4", "title": "Research on water meter reading recognition based on deep learning"}, {"paperId": "d7855659542831bd76417dbbc2b1e91882ef9f56", "title": "Multiple Observation HMM-Based CAN Bus Intrusion Detection System for In-Vehicle Network"}, {"paperId": "289df14c606bcb2b7ed6d5ef2c792c9513d22377", "title": "A Novel Lane-Change Decision-Making With Long-Time Trajectory Prediction for Autonomous Vehicle"}, {"paperId": "67fb57da121364ab08aae22c00e2e8bbd5ba2ba0", "title": "Multi-satellite Online scheduling Method Based on Proximal Policy"}, {"paperId": "03600709435754a8aa08bd6f0cf2872c032fad49", "title": "A GRU-Based Lightweight System for CAN Intrusion Detection in Real Time"}, {"paperId": "763979d55dbbf20bc4f6384a236961579948f7f9", "title": "Multi-Source Multi-Destination Hybrid Infrastructure-Aided Traffic Aware Routing in V2V/I Networks"}, {"paperId": "676d557640af69d847bac54f2bfd02dc2419d510", "title": "SDSCNN: A Hybrid Model Integrating Static and Dynamic Spatial Correlation Neural Network for Traffic Prediction"}]}
