{"paperId": "6400823a13f760f0b3b8ccf946ce332c6e3b6c33", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Landslide Susceptibility Mapping in a Mountainous Area Using Machine Learning Algorithms", "abstract": "Landslides are a dangerous natural hazard that can critically harm road infrastructure in mountainous places, resulting in significant damage and fatalities. The primary purpose of this study was to assess the efficacy of three machine learning algorithms (MLAs) for landslide susceptibility mapping including random forest (RF), decision tree (DT), and support vector machine (SVM). We selected a case study region that is frequently affected by landslides, the important Kamyaran–Sarvabad road in the Kurdistan province of Iran. Altogether, 14 landslide evaluation factors were input into the MLAs including slope, aspect, elevation, river density, distance to river, distance to fault, fault density, distance to road, road density, land use, slope curvature, lithology, stream power index (SPI), and topographic wetness index (TWI). We identified 64 locations of landslides by field survey of which 70% were randomly employed for building and training the three MLAs while the remaining locations were used for validation. The area under the receiver operating characteristics (AUC) reached a value of 0.94 for the decision tree compared to 0.82 for the random forest, and 0.75 for support vector machines model. Thus, the decision tree model was most accurate in identifying the areas at risk for future landslides. The obtained results may inform geoscientists and those in decision-making roles for landslide management.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-14", "journal": {"name": "Remote. Sens.", "pages": "3112", "volume": "15"}, "authors": [{"authorId": "48673769", "name": "H. Shahabi"}, {"authorId": "2072037537", "name": "R. Ahmadi"}, {"authorId": "32783798", "name": "M. Alizadeh"}, {"authorId": "48650673", "name": "M. Hashim"}, {"authorId": "2172167975", "name": "Nadhir Al-Ansari"}, {"authorId": "23155839", "name": "A. Shirzadi"}, {"authorId": "49154539", "name": "Isabelle D. Wolf"}, {"authorId": "102194478", "name": "E. Ariffin"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "f697c3369149280ba6a68c63da54a0ed951fd3cf", "title": "Seismic Landslide Susceptibility Assessment Using Newmark Displacement Based on a Dual-Channel Convolutional Neural Network"}, {"paperId": "0bcba4d57ba04b626d9839e673a1c104b84b36b8", "title": "Modelling landslide susceptibility prediction: A review and construction of semi-supervised imbalanced theory"}, {"paperId": "12460727aa2fd70b2876437bb5e832156863e31a", "title": "Landslide Hazard Assessment Combined with InSAR Deformation: A Case Study in the Zagunao River Basin, Sichuan Province, Southwestern China"}, {"paperId": "702160d4b24fcd354e21ea4b0a6f6aaa1e9fdcf8", "title": "Automated Machine Learning-Based Landslide Susceptibility Mapping for the Three Gorges Reservoir Area, China"}]}
