{"paperId": "641b46fc44d6c7db82640ad6f15da260589513ef", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "State-of-the-Art of Artificial Intelligence and Big Data Analytics Reviews in Five Different Domains: A Bibliometric Summary", "abstract": "Academicians and practitioners have recently begun to accord Artificial Intelligence (AI) and Big Data Analytics (BDA) significant consideration when exploring emerging research trends in different fields. The technique of bibliometric review has been extensively applied to the AI and BDA literature to map out existing scholarships. We summarise 711 bibliometric articles on AI & its sub-sets and BDA published in multiple fields to identify academic disciplines with significant research contributions. We pulled bibliometric review papers from the Scopus Q1 and Q2 journal database published between 2012 and 2022. The Scopus database returned 711 documents published in journals of different disciplines from 59 countries, averaging 17.9 citations per year. Multiple software and Database Analysers were used to investigate the data and illustrate the most active scientific bibliometric indicators such as authors and co-authors, citations, co-citations, countries, institutions, journal sources, and subject areas. The USA was the most influential nation (101 documents; 5405 citations), while China was the most productive nation (204 documents; 2371 citations). The most productive institution was Symbiosis International University, India (32 documents; 4.5%). The results reveal a substantial increase in bibliometric reviews in five clusters of disciplines: (a) Business & Management, (b) Engineering and Construction, (c) Healthcare, (d) Sustainable Operations & I4.0, and (e) Tourism and Hospitality Studies, the majority of which investigate the applications and use cases of AI and BDA to address real-world problems in the field. The keyword co-occurrence in the past bibliometric analyses indicates that BDA, AI, Machine Learning, Deep Learning, NLP, Fuzzy Logic, and Expert Systems will remain conspicuous research areas in these five diverse clusters of domain areas. Therefore, this paper summarises the bibliometric reviews on AI and BDA in the fields of Business, Engineering, Healthcare, Sustainable Operations, and Hospitality Tourism and serves as a starting point for novice and experienced researchers interested in these topics.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2087525021", "name": "P. V. Thayyib"}, {"authorId": "2269979129", "name": "Rajesh Mamilla"}, {"authorId": "2151704253", "name": "Mohsin Khan"}, {"authorId": "2209553605", "name": "Humaira Fatima"}, {"authorId": "2209418049", "name": "Mohd Asim"}, {"authorId": "39337504", "name": "I. Anwar"}, {"authorId": "2209738946", "name": "M. K. Shamsudheen"}, {"authorId": "2209880634", "name": "Mohd Asif Khan"}], "citations": [{"paperId": "aaf4a85a62251c356bc332b963b7c758fc9f0f6d", "title": "Unlocking synergies between waste management and climate change mitigation to accelerate decarbonization through circular-economy digitalization in Indonesia"}, {"paperId": "7586e1d33f86221925c802558b64531cd09da3e6", "title": "A comprehensive bibliometric and content analysis of artificial intelligence in language learning: tracing between the years 2017 and 2023"}, {"paperId": "ed9c968740f3c6852bded330633000f76e4c159d", "title": "Defining the Balearic Islands’ Tourism Data Space: An Approach to Functional and Data Requirements"}, {"paperId": "74685276a5cd92a5d88f4de7d300f356f12ed269", "title": "Potential of Advanced Technologies for Environmental Management Systems"}, {"paperId": "e1ac81eb061b2f229f3cb855bfb94787acf43078", "title": "Developing Intelligent AI-Driven Systems for Automated Data Science"}, {"paperId": "860294da5f585c521dd47d1de1b2bd731a4d8a12", "title": "AI-Driven Biomedical and Health Informatics: Harnessing Artificial Intelligence for Improved Healthcare Solutions"}, {"paperId": "2fd5d9cbb9ad8f4ab18a40fb698cc8a26d9dd40d", "title": "Strategic Integration of Artificial Intelligence for Sustainable Businesses: Implications for Data Management and Human User Engagement in the Digital Era"}, {"paperId": "085dfe0baada941fcb187b124cb7ded2cc9705ce", "title": "A Real-Time Nut-Type Classifier Application Using Transfer Learning"}, {"paperId": "89c5a23d08cfbd8f89a3c97c0e76f7661c1e405a", "title": "Forecasting Indian Goods and Services Tax revenue using TBATS, ETS, Neural Networks, and hybrid time series models"}, {"paperId": "10540c1246364d437d68c20d8f012465d0a5a966", "title": "Internet of Things Performance Evaluation from Three Decades in Education"}, {"paperId": "e98d4d7d99663b3357bdf0e2d4760aa5341d62d4", "title": "A Literature Review and Emerging Trends on Key Topics of Risks and Challenges Facing Tourism Real Estate Investments"}, {"paperId": "436cf000ab13a574d8fb8619583253d674ae80ff", "title": "Augmenting hotel performance in Malaysia through big data analytics capability and artificial intelligence capability"}, {"paperId": "dc2cda890ac22516c46220536a1c4cbfb9f85290", "title": "Determining Factors Related to Artificial Intelligence (AI) Adoption Among Malaysia's Small and Medium-Sized Businesses"}, {"paperId": "ec43ccee416b56bd215544b537bb87aef41b38c4", "title": "Mapping the Literature on Artificial Intelligence in Academic Libraries: A Bibliometrics Approach"}, {"paperId": "393de0c16dc7c848ca8c476b51ad18b876f10be6", "title": "Artificial Intelligence in the Tourism Industry: An Overview of Reviews"}, {"paperId": "60bc21aff20f7d0ec03e8803a147b59bedac4faa", "title": "Physical Activity Levels and Predictors during COVID-19 Lockdown among Lebanese Adults: The Impacts of Sociodemographic Factors, Type of Physical Activity and Work Location"}, {"paperId": "7c8a533175c24ceff2cdb82dfd340065cc93a1ce", "title": "Re-Thinking Data Strategy and Integration for Artificial Intelligence: Concepts, Opportunities, and Challenges"}, {"paperId": "67bcdaadae21c43586c24fb3f4e54a0cf876e279", "title": "Anomaly Detection for Hydraulic Power Units - A Case Study"}, {"paperId": "f3ddb88a0bd24c17b28209b5faae9e5a9f8a213d", "title": "Digital Datasheet model: enhancing value of AI digital platforms"}, {"paperId": "e24ec4f8fa88a0a9e7026e2710bb36cfc7d8b996", "title": "Machine Learning Enhanced Framework for Big Data Modeling with Application in Industry 4.0"}]}
