{"paperId": "641e13c006cf15aaebe6f544e31c78c0ba5059e1", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Zonation of Landslide Susceptibility in Ruijin, Jiangxi, China", "abstract": "Landslides are one of the major geohazards threatening human society. The objective of this study was to conduct a landslide hazard susceptibility assessment for Ruijin, Jiangxi, China, and to provide technical support to the local government for implementing disaster reduction and prevention measures. Machine learning approaches, e.g., random forests (RFs) and support vector machines (SVMs) were employed and multiple geo-environmental factors such as land cover, NDVI, landform, rainfall, lithology, and proximity to faults, roads, and rivers, etc., were utilized to achieve our purposes. For categorical factors, three processing approaches were proposed: simple numerical labeling (SNL), weight assignment (WA)-based and frequency ratio (FR)-based. Then 19 geo-environmental factors were respectively converted into raster to constitute three 19-band datasets, i.e., DS1, DS2, and DS3 from three different processes. Then, 155 observed landslides that occurred in the past decades were vectorized, among which 70% were randomly selected to compose a training set (TS1) and the remaining 30% to form a validation set (VS1). A number of non-landslide (no-risk) samples distributed in the whole study area were identified in low slope (<1–3°) zones such as urban areas and croplands, and also added to the TS1 and VS1 in the same ratio. For comparison, we used the FR approach to identify the no-risk samples in both flat and non-flat areas, and merged them into the field-observed landslides to constitute another pair of training and validation sets (TS2 and VS2) using the same ratio of 7:3. The RF algorithm was applied to model the probability of the landslide occurrence using DS1, DS2, and DS3 as predictive variables and TS1 and TS2 for training to obtain the SNL-based, WA-based, and FR-based RF models, respectively. Verified against VS1 and VS2, the three models have similar overall accuracy (OA) and Kappa coefficient (KC), which are 89.61%, 91.47%, and 94.54%, and 0.7926, 0.8299, and 0.8908, respectively. All of them are much better than the three models obtained by SVM algorithm with OA of 81.79%, 82.86%, and 83%, and KC of 0.6337, 0.655, and 0.660. New case verification with the recent 26 landslide events of 2017–2020 revealed that the landslide susceptibility map from WA-based RF modeling was able to properly identify the high and very high susceptibility zones where 23 new landslides had occurred, and performed better than the SNL-based and FR-based RF modeling, though the latter has a slightly higher OA and KC. Hence, we concluded that all three RF models achieve reasonable risk prediction, but WA-based and FR-based RF modeling deserves a recommendation for application elsewhere. The results of this study may serve as reference for the local authorities in prevention and early warning of landslide hazards.", "venue": "International Journal of Environmental Research and Public Health", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-31", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "18"}, "authors": [{"authorId": "2143908124", "name": "Xiaoting Zhou"}, {"authorId": "2000246087", "name": "Weicheng Wu"}, {"authorId": "49290499", "name": "Ziyu Lin"}, {"authorId": "32664098", "name": "Guiliang Zhang"}, {"authorId": "8707195", "name": "Renxiang Chen"}, {"authorId": "2115414739", "name": "Yong Song"}, {"authorId": "1484801357", "name": "Zhilin Wang"}, {"authorId": "47534858", "name": "Tao Lang"}, {"authorId": "117911527", "name": "Yaozu Qin"}, {"authorId": "2004513603", "name": "Penghui Ou"}, {"authorId": "2004518895", "name": "Wenchao Huangfu"}, {"authorId": "2145954190", "name": "Yangchengsi Zhang"}, {"authorId": "2004274596", "name": "Lifeng Xie"}, {"authorId": "1742407090", "name": "Xiaolan Huang"}, {"authorId": "48524384", "name": "Xiaohong Fu"}, {"authorId": "2155868796", "name": "Jie Li"}, {"authorId": "2218916596", "name": "Jingheng Jiang"}, {"authorId": "39767557", "name": "M. Zhang"}, {"authorId": "2000164154", "name": "Yixuan Liu"}, {"authorId": "2004217711", "name": "Shanling Peng"}, {"authorId": "108478196", "name": "C. Shao"}, {"authorId": "2144125346", "name": "Yonghui Bai"}, {"authorId": "2108166904", "name": "Xiao-feng Zhang"}, {"authorId": "1390612103", "name": "Xiangtong Liu"}, {"authorId": "2019426140", "name": "Wenheng Liu"}], "citations": [{"paperId": "34288e555509353f679a7208befd2311bb616b10", "title": "Influence of buffer distance on environmental geological hazard susceptibility assessment."}, {"paperId": "3c774fa5ffc74e8ffa76b3bdc897d0c95411254a", "title": "Susceptibility assessment of environmental geological disasters in Liulin County based on RF: from the perspective of positive and negative sample proportion"}, {"paperId": "bcd50ce6a6232f94078d36812ab83eab1bb4e658", "title": "Analysis of Optimal Buffer Distance for Linear Hazard Factors in Landslide Susceptibility Prediction"}, {"paperId": "9986d9280ce3b5dee0b100ccf584412daa3f5ef9", "title": "Impact of geological background on city development"}, {"paperId": "4fe4f6571b78eb1d6d303a197f5881a1212f41c2", "title": "The influence of the selection of non-geological disasters sample spatial range on the evaluation of environmental geological disasters susceptibility: a case study of Liulin County"}, {"paperId": "397e71a7f1cce14c1b629339c4055ebbcf430cb2", "title": "Landslide susceptibility mapping by integrating analytical hierarchy process, frequency ratio, and fuzzy gamma operator models, case study: North of Lorestan Province, Iran"}, {"paperId": "a2b794b9ed8fb26995bd5d8b9b0161668d743f65", "title": "Geoinformation-based landslide susceptibility mapping in subtropical area"}, {"paperId": "71cacd0746071cb0ae5eff13b563c206b93fe7b8", "title": "A multi-criteria landslide susceptibility mapping using deep multi-layer perceptron network: A case study of Srinagar-Rudraprayag region (India)"}, {"paperId": "2ef1a83230dd6a4f47245842de4b0b13f79cf6fe", "title": "Multiclassification Method of Landslide Risk Assessment in Consideration of Disaster Levels: A Case Study of Xianyang City, Shaanxi Province"}, {"paperId": "a2c829429d57c702498540dce7a0a88f3af9fc17", "title": "High-Resolution Mining-Induced Geo-Hazard Mapping Using Random Forest: A Case Study of Liaojiaping Orefield, Central China"}, {"paperId": "c33d509898c39dbd7cc5858e142cb75398f085e3", "title": "Factors Affecting Landslide Susceptibility Mapping: Assessing the Influence of Different Machine Learning Approaches, Sampling Strategies and Data Splitting"}, {"paperId": "1e82aacfd14a2cc0f456b37bb7032a0af8a03008", "title": "Landslide Geo-Hazard Risk Mapping Using Logistic Regression Modeling in Guixi, Jiangxi, China"}]}
