{"paperId": "642311c2f3837e0f3558994425ccec21a66b5661", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Auto-tuning Distributed Stream Processing Systems using Reinforcement Learning", "abstract": "Fine tuning distributed systems is considered to be a craftsmanship, relying on intuition and experience. This becomes even more challenging when the systems need to react in near real time, as streaming engines have to do to maintain pre-agreed service quality metrics. In this article, we present an automated approach that builds on a combination of supervised and reinforcement learning methods to recommend the most appropriate lever configurations based on previous load. With this, streaming engines can be automatically tuned without requiring a human to determine the right way and proper time to deploy them. This opens the door to new configurations that are not being applied today since the complexity of managing these systems has surpassed the abilities of human experts. We show how reinforcement learning systems can find substantially better configurations in less time than their human counterparts and adapt to changing workloads.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-14", "journal": {"name": "ArXiv", "volume": "abs/1809.05495"}, "authors": [{"authorId": "144834588", "name": "Luis M. Vaquero"}, {"authorId": "1722958", "name": "F. Cuadrado"}], "citations": [{"paperId": "4eb61ac220459437c909b2a6e93c45684bc93ebd", "title": "Mfrlmo: Model-Free Reinforcement Learning for Multi-Objective Optimization of Apache Spark"}, {"paperId": "59a8e2a3450b17daf1f4916f6035f36b39b5bdf6", "title": "Co-Tuning of Cloud Infrastructure and Distributed Data Processing Platforms"}, {"paperId": "315863a111d1632dc3669bc5929fb50adcb7b073", "title": "DMSConfig: Automated Configuration Tuning for Distributed IoT Message Systems Using Deep Reinforcement Learning"}, {"paperId": "936089f9bce3736a9deba8594ba6082c1e1f1ae3", "title": "Optimal Rate Control for Latency-constrained High Throughput Big Data Applications"}, {"paperId": "dbb16387d57cfdb8998853db1711ab50d8e0c0d7", "title": "Resource Configuration Tuning for Stream Data Processing Systems via Bayesian Optimization"}, {"paperId": "5ed281bcb30c45bc8f506e247703940d0432217c", "title": "Automatic Performance Tuning for Distributed Data Stream Processing Systems"}, {"paperId": "05f8d6edfd20856d680d5bd8aaae6314d9647d08", "title": "Dynamic Auto Reconfiguration of Operator Placement in Wireless Distributed Stream Processing Systems"}, {"paperId": "81097de861a8e294af7b01bdb67237153db8d3f6", "title": "ACS: Auto-Tuning the Configurations of Structured Streaming Programs by Using SVM"}, {"paperId": "30ff03592faa4d07ac0c629f05bcf55d46a28064", "title": "A survey on ‘Apache Storm performance optimization using tuning of parameters’"}, {"paperId": "915ab7b6ca3633230403d47dbb31cf74888cc5c9", "title": "A Survey on Automatic Parameter Tuning for Big Data Processing Systems"}, {"paperId": "c2d52a8f53d5d7b2b9bde387ba36ccf9b6b671fa", "title": "ParaOpt: Automated Application Parameterization and Optimization for the Cloud"}, {"paperId": "e7824bd3b8cb0dd26fa9b7dc9e05d0d297bddaa4", "title": "Effectively Testing System Configurations of Critical IoT Analytics Pipelines"}, {"paperId": "820f1f8646ca12234939b3dbde0ff3ebb332c217", "title": "Optimizing a Gamified Design Through Reinforcement Learning - a Case Study in Stack Overflow"}, {"paperId": "b2cae01afd4ed5a14770136c3b4b861734dd8053", "title": "Doctoral Symposium: Dynamic Scaling of Distributed Data-flows under Uncertainty"}, {"paperId": "50b174e44b593445736c22e0e20c9584194b087f", "title": "GARBAGE COLLECTION PERFORMANCE TUNING USING REINFORCEMENT LEARNING"}]}
