{"paperId": "64363475b940a2304cb3438bdd0ae92e0f6d2c43", "publicationVenue": null, "title": "Understanding packet loss for sound monitoring in a smart stadium IoT testbed", "abstract": "The Smart Stadium for Smarter Living project provides an end-to-end testbed for IoT innovation through a collaboration between Croke Park Stadium in Dublin, Ireland and Dublin City University, Intel and Microsoft. This enables practical evaluations of IoT solutions in a controlled environment that is small enough to conduct trials but large enough to prove and challenge the technologies. An evaluation of sound monitoring capabilities during the 2016 sporting finals was used to test the capture, transfer, storage and analysis of decibel level sound monitoring. The purpose of the evaluation was to use existing sound level microphones to measure crowd response to pre-determined events for display on big screens at half-time and to test the end-to-end performance of the testbed. While this is not the specific original purpose of the sound level microphones, it provided a useful test case and produced engaging content for the project. Analysis of the data streams showed significant packet loss during the events and further investigations were conducted to understand where and how this loss occurred. This paper describes the smart stadium testbed configuration using Intel gateways linking with the Azure cloud platform and analyses the performance of the system during the sound monitoring evaluation.", "venue": "FAILSAFE@SenSys", "year": 2017, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2017-11-05", "journal": {"name": "Proceedings of the First ACM International Workshop on the Engineering of Reliable, Robust, and Secure Embedded Wireless Sensing Systems"}, "authors": [{"authorId": "145777800", "name": "S. Little"}, {"authorId": "143972917", "name": "Dian Zhang"}, {"authorId": "1414808684", "name": "Camille Ballas"}, {"authorId": "98536322", "name": "N. O’Connor"}, {"authorId": "46724144", "name": "D. Prendergast"}, {"authorId": "144627109", "name": "K. Nolan"}, {"authorId": "2055451561", "name": "B. Quinn"}, {"authorId": "2056594093", "name": "Niall Moran"}, {"authorId": "2057355322", "name": "Mike Myers"}, {"authorId": "2054790215", "name": "Clare Dillon"}, {"authorId": "1420360732", "name": "Tomás Meehan"}], "citations": [{"paperId": "c8f65e21e27edd22e7efb0d8d5d98d655fbbf1ac", "title": "Deep-learning approach to attack handling of IoT devices using IoT-enabled network services"}, {"paperId": "983fda006487fccb780994b1f7156ce2b353809b", "title": "Using a Deep-Learning Approach for Smart IoT Network Packet Analysis"}, {"paperId": "c00c3d2e971297118d64fe00a137a1f6053be122", "title": "Failures from the Environment, a Report on the First FAILSAFE workshop"}, {"paperId": "2bd48542de3f83c438621da217771b901a7831ce", "title": "Performance of video processing at the edge for crowd-monitoring applications"}]}
