{"paperId": "64370410730bff3b998a3f248e5c0e5e224295cb", "publicationVenue": {"id": "88cc76ce-f486-46c4-bfa1-a31809d402d7", "name": "International Conference on Big Data and Smart Computing", "type": "conference", "alternate_names": ["BIGCOMP", "BigComp", "Int Conf Big Data Smart Comput"]}, "title": "Performance Evaluation of Spatial Data Management Systems Using GeoSpark", "abstract": "In this paper, we evaluate the performance of spatial data management systems in distributed computing environments. Given that GeoSpark outperforms other spatial systems in many scenarios as reported in several studies, we choose spatial data management systems using GeoSpark for this evaluation. Even though GeoSpark supports various storage engines as its underlying data store, the effects of the storage engines for spatial data processing have not been well studied. To address this limitation, we evaluate the performance of GeoSpark using two underlying data stores: 1) HDFS and 2) MongoDB. We first design and build distributed experimental environments based on Amazon EC2 and EMR using up to 10 nodes. Through the extensive experiments on three synthetic and real data sets, we show that the overall performance of both HDFS-and MongoDB-based GeoSpark improves as we increase the number of nodes. We also show that HDFS-based GeoSpark generally outperforms MongoDB-based GeoSpark, especially for large-scale data sets. In addition, we demonstrate that the proper use of caching on HDFS-based GeoSpark can improve the overall query processing performance by up to three orders of magnitude.", "venue": "International Conference on Big Data and Smart Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 IEEE International Conference on Big Data and Smart Computing (BigComp)", "pages": "197-200"}, "authors": [{"authorId": "1645134633", "name": "Hansub Shin"}, {"authorId": "1899648", "name": "Kisung Lee"}, {"authorId": "2215894", "name": "Hyuk-Yoon Kwon"}], "citations": [{"paperId": "e8cea0dba8be4a870ab6c13acf0c758176970aa2", "title": "A comparative experimental study of distributed storage engines for big spatial data processing using GeoSpark"}]}
