{"paperId": "643a3e1a70622a6ba34fda20e499c8569cb7e492", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Reddit language indicates changes associated with diet, physical activity, substance use, and smoking during COVID-19", "abstract": "COVID-19 has adversely impacted the health behaviors of billions of people across the globe, modifying their former trends in health and lifestyle. In this paper, we compare the psychosocial language markers associated with diet, physical activity, substance use, and smoking before and after the onset of COVID-19 pandemic. We leverage the popular social media platform Reddit to analyze 1 million posts between January 6, 2019, to January 5, 2021, from 22 different communities (i.e., subreddits) that belong to four broader groups—diet, physical activity, substance use, and smoking. We identified that before the COVID-19 pandemic, posts involved sharing information about vacation, international travel, work, family, consumption of illicit substances, vaping, and alcohol, whereas during the pandemic, posts contained emotional content associated with quarantine, withdrawal symptoms, anxiety, attempts to quit smoking, cravings, weight loss, and physical fitness. Prevalent topic analysis showed that the pandemic was associated with discussions about nutrition, physical fitness, and outdoor activities such as backpacking and biking, suggesting users’ focus shifted toward their physical health during the pandemic. Starting from the week of March 23, 2020, when several stay-at-home policies were enacted, users wrote more about coping with stress and anxiety, alcohol misuse and abuse, and harm-reduction strategies like switching from hard liquor to beer/wine after people were socially isolated. In addition, posts related to use of substances such as benzodiazepines (valium, xanax, clonazepam), nootropics (kratom, phenibut), and opioids peaked around March 23, 2020, followed by a decline. Of note, unlike the general decline observed, the volume of posts related to alternatives to heroin (e.g., fentanyl) increased during the COVID-19 pandemic. Posts about quitting smoking gained momentum after late March 2020, and there was a sharp decline in posts about craving to smoke. This study highlights the significance of studying social media discussions on platforms like Reddit which are a rich ecological source of human experiences and provide insights to inform targeted messaging and mitigation strategies, and further complement ongoing traditional primary data collection methods.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-03", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "2204261521", "name": "Karan Wanchoo"}, {"authorId": "145297741", "name": "M. Abrams"}, {"authorId": "5824067", "name": "R. Merchant"}, {"authorId": "143857273", "name": "Pallavi V. Kulkarni"}, {"authorId": "2008166098", "name": "Sharath Chandra Guntuku"}], "citations": [{"paperId": "69af22a437909810543bd5ab03bb531a1d457f40", "title": "Social interactions in short squeeze scenarios"}, {"paperId": "c368b491939d741268e9b6fbc2dcab7daf181408", "title": "Detecting Symptoms of Depression on Reddit"}, {"paperId": "6d06820418b89a5ad299e9f50b0d4a1104a5b13c", "title": "Transformer-based Topic Modeling to Measure the Severity of Eating Disorder Symptoms"}]}
