{"paperId": "6445ef7945bbc2d231176e959b9cadce04acef23", "publicationVenue": {"id": "1a5858d9-edfe-4a1b-ae39-60020748678f", "name": "ACM Transactions on Architecture and Code Optimization (TACO)", "type": "journal", "alternate_names": ["ACM Transactions on Architecture and Code Optimization", "ACM Trans Archit Code Optim", "ACM Trans Archit Code Optim (TACO"], "issn": "1544-3566", "url": "http://www.acm.org/taco", "alternate_urls": ["http://portal.acm.org/taco/", "https://taco.acm.org/"]}, "title": "ApHMM: Accelerating Profile Hidden Markov Models for Fast and Energy-Efficient Genome Analysis", "abstract": "Profile hidden Markov models (pHMMs) are widely employed in various bioinformatics applications to identify similarities between biological sequences, such as DNA or protein sequences. In pHMMs, sequences are represented as graph structures, where states and edges capture modifications (i.e., insertions, deletions, and substitutions) by assigning probabilities to them. These probabilities are subsequently used to compute the similarity score between a sequence and a pHMM graph. The Baum-Welch algorithm, a prevalent and highly accurate method, utilizes these probabilities to optimize and compute similarity scores. Accurate computation of these probabilities is essential for the correct identification of sequence similarities. However, the Baum-Welch algorithm is computationally intensive, and existing solutions offer either software-only or hardware-only approaches with fixed pHMM designs. When we analyze state-of-the-art works, we identify an urgent need for a flexible, high-performance, and energy-efficient hardware-software co-design to address the major inefficiencies in the Baum-Welch algorithm for pHMMs. We introduce ApHMM, the first flexible acceleration framework designed to significantly reduce both computational and energy overheads associated with the Baum-Welch algorithm for pHMMs. ApHMM employs hardware-software co-design to tackle the major inefficiencies in the Baum-Welch algorithm by 1) designing flexible hardware to accommodate various pHMM designs, 2) exploiting predictable data dependency patterns through on-chip memory with memoization techniques, 3) rapidly filtering out unnecessary computations using a hardware-based filter, and 4) minimizing redundant computations. ApHMM achieves substantial speedups of 15.55 × - 260.03 ×, 1.83 × - 5.34 ×, and 27.97 × when compared to CPU, GPU, and FPGA implementations of the Baum-Welch algorithm, respectively. ApHMM outperforms state-of-the-art CPU implementations in three key bioinformatics applications: 1) error correction, 2) protein family search, and 3) multiple sequence alignment, by 1.29 × - 59.94 ×, 1.03 × - 1.75 ×, and 1.03 × - 1.95 ×, respectively, while improving their energy efficiency by 64.24 × - 115.46 ×, 1.75 ×, 1.96 ×.", "venue": "ACM Transactions on Architecture and Code Optimization (TACO)", "year": 2022, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-20", "journal": {"name": "ACM Transactions on Architecture and Code Optimization"}, "authors": [{"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "2013892639", "name": "Kamlesh R. Pillai"}, {"authorId": "120578447", "name": "G. Kalsi"}, {"authorId": "146308326", "name": "Bharathwaj Suresh"}, {"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "51017214", "name": "Taha Shahroodi"}, {"authorId": "2051171114", "name": "Meryem Banu Cavlak"}, {"authorId": "2160629076", "name": "Joel Lindegger"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "1388812849", "name": "Juan Gómez-Luna"}, {"authorId": "1706165", "name": "S. Subramoney"}, {"authorId": "2065984781", "name": "O. Mutlu"}], "citations": [{"paperId": "38ec4e01e32edd3ee504cd267dbad41fa6e67d11", "title": "SieveMem: A Computation-in-Memory Architecture for Fast and Accurate Pre-Alignment"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "73eb6ee8d34e0eb5330557ce2e0b61a957d4f957", "title": "MixFlow: Assessing Mixnets Anonymity with Contrastive Architectures and Semantic Network Information"}]}
