{"paperId": "644fc48c60cfcada66c583f78369ca143170a832", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Automated Landslide-Risk Prediction Using Web GIS and Machine Learning Models", "abstract": "Spatial susceptible landslide prediction is the one of the most challenging research areas which essentially concerns the safety of inhabitants. The novel geographic information web (GIW) application is proposed for dynamically predicting landslide risk in Chiang Rai, Thailand. The automated GIW system is coordinated between machine learning technologies, web technologies, and application programming interfaces (APIs). The new bidirectional long short-term memory (Bi-LSTM) algorithm is presented to forecast landslides. The proposed algorithm consists of 3 major steps, the first of which is the construction of a landslide dataset by using Quantum GIS (QGIS). The second step is to generate the landslide-risk model based on machine learning approaches. Finally, the automated landslide-risk visualization illustrates the likelihood of landslide via Google Maps on the website. Four static factors are considered for landslide-risk prediction, namely, land cover, soil properties, elevation and slope, and a single dynamic factor i.e., precipitation. Data are collected to construct a geospatial landslide database which comprises three historical landslide locations—Phu Chifa at Thoeng District, Ban Pha Duea at Mae Salong Nai, and Mai Salong Nok in Mae Fa Luang District, Chiang Rai, Thailand. Data collection is achieved using QGIS software to interpolate contour, elevation, slope degree and land cover from the Google satellite images, aerial and site survey photographs while the physiographic and rock type are on-site surveyed by experts. The state-of-the-art machine learning models have been trained i.e., linear regression (LR), artificial neural network (ANN), LSTM, and Bi-LSTM. Ablation studies have been conducted to determine the optimal parameters setting for each model. An enhancement method based on two-stage classifications has been presented to improve the landslide prediction of LSTM and Bi-LSTM models. The landslide-risk prediction performances of these models are subsequently evaluated using real-time dataset and it is shown that Bi-LSTM with Random Forest (Bi-LSTM-RF) yields the best prediction performance. Bi-LSTM-RF model has improved the landslide-risk predicting performance over LR, ANNs, LSTM, and Bi-LSTM in terms of the area under the receiver characteristic operator (AUC) scores by 0.42, 0.27, 0.46, and 0.47, respectively. Finally, an automated web GIS has been developed and it consists of software components including the trained models, rainfall API, Google API, and geodatabase. All components have been interfaced together via JavaScript and Node.js tool.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2596234", "name": "N. Tengtrairat"}, {"authorId": "144987686", "name": "W. L. Woo"}, {"authorId": "11908399", "name": "P. Parathai"}, {"authorId": "1845907", "name": "Chuchoke Aryupong"}, {"authorId": "1989332", "name": "P. Jitsangiam"}, {"authorId": "116245501", "name": "D. Rinchumphu"}], "citations": [{"paperId": "78d513778aa17d7c781f5a2908d389a14b4fb7b0", "title": "Machine-Learning-Based Forest Classification and Regression (FCR) for Spatial Prediction of Liver Fluke Opisthorchis viverrini (OV) Infection in Small Sub-Watersheds"}, {"paperId": "bd11c30b674813c499270d49718e177635a6588c", "title": "A Review of Data Sources and Techniques used for Landslide Visualization"}, {"paperId": "0354cf9b1899c811cbc9d8a63b0c9b09c528b0e6", "title": "AI-enabled strategies for climate change adaptation: protecting communities, infrastructure, and businesses from the impacts of climate change"}, {"paperId": "a502986d58bf24bbcced863abffd5ccb0b89c275", "title": "AUTOMATION OF DAILY LANDSLIDE POTENTIAL INFORMATION BASED ON REMOTE SENSING SATELLITE IMAGERY USING OPEN-SOURCE SOFTWARE TECHNOLOGY"}, {"paperId": "75005b7fb5a58863d13455de3ac178dbe5dfe950", "title": "Machine learning-based construction site dynamic risk models"}, {"paperId": "2504b9f061ae25db0970296d9a204a65df4dd374", "title": "A comprehensive and up-to-date web-based interactive 3D emergency response and visualization system using Cesium Digital Earth: taking landslide disaster as an example"}, {"paperId": "e90e7667b26f05c64b3186c05357884d39e1b8d1", "title": "Machine learning based landslide susceptibility mapping models and GB-SAR based landslide deformation monitoring systems: Growth and evolution"}, {"paperId": "937139e568f5d7806193ad0ee5c79b028a484e07", "title": "Landslide identification using machine learning techniques: Review, motivation, and future prospects"}, {"paperId": "736f4b780ba7ee4df0dbb5f326f2d539212ec5a5", "title": "ML models and neural networks for analyzing 3D data spatial planning tasks: Example of Khasansky urban district of the Russian Federation"}, {"paperId": "e1e8d139c92e4ba17242668130622fc39cc95a7f", "title": "Impact of Extreme Class-Imbalance on Landslide-Risk Prediction and Mitigation Using Two-Stage Deep Neural Network"}, {"paperId": "81c5251849994f248ad7a6fce83848f9e170da0e", "title": "Landslide Displacement Prediction Based on Transfer Learning and Bi-GRU"}, {"paperId": "8939708fd4426c87ae5a7e246262bd00290135b0", "title": "Non-Intrusive Fish Weight Estimation in Turbid Water Using Deep Learning and Regression Models"}, {"paperId": "af83d8af09db95cf197208dd2620c1898ed30984", "title": "Landslide Susceptibility Mapping Using Machine Learning Algorithm Validated by Persistent Scatterer In-SAR Technique"}, {"paperId": "d5a0146bb335ee0f646703297232074de97d2d22", "title": "Impact of Rainfall-Induced Landslide Susceptibility Risk on Mountain Roadside in Northern Thailand"}, {"paperId": "45709b33161953d071a143f89be9f1fb6e0e36e1", "title": "Geospatial Modelling of Landslide Susceptibility in Cross River State of Nigeria"}, {"paperId": "55880f369cbf42d7bb2b6987c9139eb137856d69", "title": "A Unified Deep Learning Framework of Multi-scale Detectors for Geo-spatial Object Detection in High-Resolution Satellite Images"}, {"paperId": "3dc98a5921bab6ca8a8c84a67a798bad086076e6", "title": "Flood Prediction and Analysis on the Relevance of Features using Explainable Artificial Intelligence"}, {"paperId": "2317f02ba8cd042e857004701f04587e301e5d4c", "title": "Machine learning and artificial intelligence models development in rainfall-induced landslide prediction"}]}
