{"paperId": "64527929a912a4fe66a30184ef2040926537d2a4", "publicationVenue": {"id": "cb87b91e-7788-4e4f-bed1-6ca64f4102de", "name": "ACM Transactions on Reconfigurable Technology and Systems", "type": "journal", "alternate_names": ["ACM Trans Reconfigurable Technol Syst"], "issn": "1936-7406", "url": "https://trets.cse.sc.edu/index.html", "alternate_urls": ["http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1151&linked=1&part=transaction", "http://portal.acm.org/trets/"]}, "title": "ExHiPR: Extended High-level Partial Reconfiguration for Fast Incremental FPGA Compilation", "abstract": "Partial Reconfiguration (PR) is a key technique in the application design on modern FPGAs. However, current PR tools heavily rely on the developer to manually conduct PR module definition, floorplanning, and flow control at a low level. The existing PR tools do not consider High-Level-Synthesis languages either, which are of great interest to software developers. We propose HiPR, an open-source framework, to bridge the gap between HLS and PR. HiPR allows the developer to define partially reconfigurable C/C++ functions, instead of Verilog modules, to accelerate the FPGA incremental compilation and automate the flow from C/C++ to bitstreams. We use a lightweight Simulated Annealing floorplanner and show that it can produce high-quality PR floorplans an order of magnitude faster than analytic methods. By mapping Rosetta HLS benchmarks, we demonstrate that the incremental compilation can be accelerated by 3–10 × compared with state-of-the-art Xilinx Vitis flow without performance loss, at the cost of 15-67% one-time overlay set-up time.", "venue": "ACM Transactions on Reconfigurable Technology and Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-14", "journal": {"name": "ACM Transactions on Reconfigurable Technology and Systems"}, "authors": [{"authorId": "2122426689", "name": "Yuanlong Xiao"}, {"authorId": "80086627", "name": "Dongjoon Park"}, {"authorId": "2239211570", "name": "Zeyu Jason Niu"}, {"authorId": "2239205993", "name": "Aditya Hota"}, {"authorId": "2239205073", "name": "André DeHon"}], "citations": []}
