{"paperId": "645a9f45a31aff8193cacdfbf195c178bc51186a", "publicationVenue": null, "title": "On Making Feasible Smartphone-Based Human Activity Recognition", "abstract": "In the last few years, we witnessed a massive evolution in smartphones at, practically, all levels. As a result, their processing power has increased and is making possible the execution of more complex applications. This dissertation aims to contribute to the feasibility of implementing a machine-learning-based Human Activity Recognition (HAR) systems in a smartphone. HAR systems can be of high importance for daily life, from recommendations, monitoring, context-aware applications, to emergency situations. We focus our analysis of smartphone-based HAR systems, in several factors that may interfere with the system performance (performance of the classifier, classification time and energy consumption). This dissertation presents the impact of the number of features used via feature selection techniques (Cfs and ReliefF), a comparison of performance between kNN, Naive Bayes, Hoeffding tree and an ensemble using the three classifiers. We also present the impact of using simple rules or a binary Hoeffding tree to avoid the use of the more complex classifiers in some circumstances, and the impact of using a top layer with the intention to correct some predicted activities based on transitions between activities. The proposed approaches proved to be a success, allowing to keep an acceptable accuracy and reduce the computational cost of the system. It was possible to achieve better accuracies with a lower number of features, the rule-based classifier lowered significantly the energy consumed and the filter improved the accuracy in almost every experiment.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-07-12", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1410977143", "name": "Francisco Miguel de Lamares Martins Barbosa"}], "citations": []}
