{"paperId": "6478adc66ec783d5cc1917e4c09e6bd4bf206a13", "publicationVenue": null, "title": "What to do in, and what to expect from, urban green spaces – Indicator-based approach to assess cultural ecosystem services", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Geography"], "publicationTypes": ["Review"], "publicationDate": "2021-01-19", "journal": {"name": "Urban Forestry & Urban Greening", "pages": "126986", "volume": "59"}, "authors": [{"authorId": "65857967", "name": "K. Krellenberg"}, {"authorId": "48401513", "name": "M. Artmann"}, {"authorId": "150959033", "name": "Celina H. Stanley"}, {"authorId": "144775651", "name": "R. Hecht"}], "citations": [{"paperId": "8ca28e0766b3dbd6f181f17c85d87a05d6cca354", "title": "Recreational use of the urban riverscape: What brings people to the river?"}, {"paperId": "818797c6fe9d06284d426f3d100b9bda9d3f2ed0", "title": "Mapping cultural ecosystem services of the urban riverscapes: the case of the Vistula River in Warsaw, Poland"}, {"paperId": "e9b05be8a7cb393072c9ef83c6afb94201316694", "title": "Can Campus Green Spaces Be Restorative? A Case Study from Tanzania"}, {"paperId": "2975081aaa74a3a5816a1bf57628e1333c612998", "title": "Explaining demographic-destination preferences for cultural ecosystem services: A set-theoretic configurational analysis"}, {"paperId": "67b1e987ad074f4b5d412fee672d9cc8c4e4d669", "title": "Impact of urbanization induced land use and land cover change on ecological space quality- mapping and assessment in Delhi (India)"}, {"paperId": "e643bfe908b95b2cf84405dffd961de63a425be1", "title": "A reliability study of the Park Life public participatory geographic information system survey"}, {"paperId": "c9038c1ee7d2f56c6ff55a645cc5c40e7a6a2e14", "title": "Addressing fraudulent responses in online surveys: Insights from a web‐based participatory mapping study"}, {"paperId": "2c82d265a2e812ad6499e0d81d292fcd39234e49", "title": "Constructing a multi-functional small urban green space network for green space equity in urban built-up areas: A case study of Harbin, China"}, {"paperId": "c18faa416f2a6ed6ee526604e0ba95c2b3721650", "title": "Designing fit-for-purpose indicators to connect nature and people’s well-being in New Zealand"}, {"paperId": "698a9f52bf19e93406cbba8c98db16d8203a8908", "title": "More than greening: Using a novel index to assess restorative nature and vulnerability relationships"}, {"paperId": "5ee9f90931743fa859a05562316bfd03a89d2dd5", "title": "Station biophilia – assessing the perception of greenery on railway platforms using a digital twin"}, {"paperId": "79ad5d60c43808d5c8a8675caee5ed669d676283", "title": "Urban green spaces in land-use policy – types of data, sources of data and staff – the case of Poland"}, {"paperId": "dc904b8d9b6cf3578d013402e0efe66d1503b876", "title": "Shortcuts in Urban Green Spaces – An Analysis of Incidental Nature Experiences Associated with Active Mobility Trips"}, {"paperId": "b9848991d7be8e9ed6bb389a4054163fafd633e5", "title": "Distributional environmental justice of residential walking space: The lens of urban ecosystem services supply and demand."}, {"paperId": "2f63f323f13f365ffc102a3cbc2828bc75c76413", "title": "Public perceptions of cultural ecosystem services provided by beach nourishment and eelgrass restoration in southern Sweden"}, {"paperId": "93e4b3f2cbf3ad174b36646a9d87ee518dbad1d3", "title": "Methodology for Urban Vegetation Segmentation Based on Cartesian Hue and Saturation Characteristics Using UAV Images"}, {"paperId": "1ab66388d93e2a2f890522f29b6d3d0c32193fda", "title": "Using social media photos and computer vision to assess cultural ecosystem services and landscape features in urban parks"}, {"paperId": "3d924c4c66a388ff524acd33b322de2395b80d70", "title": "Negative Associations between Quality of Urban Green Spaces and Health Expenditures in Downtown Shanghai"}, {"paperId": "8cb93aec39c8ef0349eb07b2d5bf0566f4bc6cb6", "title": "Mapping demand and supply of functional niches of urban green space"}, {"paperId": "fab329e647be29d8eb128fe0f37a362f25b0d293", "title": "CONCEPT OF PLANNING ORGANIZATION OF URBAN SPACES FOR SKATEBOARDING"}, {"paperId": "60c4f8bfe978e64202daef0aa50f5fe2adbc9f78", "title": "Approach to user group-specific assessment of urban green spaces for a more equitable supply exemplified by the elderly population"}, {"paperId": "ac388b02a70bb8761a98779dfc3ba907e3333b45", "title": "The importance of seeking a win-win solution in shaping the vegetation of military heritage landscapes: The role of legibility, naturalness and user preference"}, {"paperId": "156867e28e108ecb01b1da9756133d8efec4828d", "title": "Towards a “City in Nature”: Evaluating the Cultural Ecosystem Services Approach Using Online Public Participation GIS to Support Urban Green Space Management"}, {"paperId": "1d1a7651773056a0573e89f31b2fdd618075b919", "title": "The availability of green spaces for different socio-economic groups in cities: a case study of Budapest, Hungary"}, {"paperId": "486efe66e868087ca5b92def8ff67acb03300f5b", "title": "Towards a ‘City in Nature’: Evaluating the Cultural Ecosystem Services Approach to Support Urban Green Space Management"}, {"paperId": "b78064e33c1e3c3d489d42bdf923c1b019d47a22", "title": "Optimization of Ecosystem Services of Shanghai Urban–Suburban Street Trees Based on Low-Carbon Targets"}, {"paperId": "6bb211c4b4878849a5eab8c6cd9d4dae8b0bda0c", "title": "Do social media data indicate visits to tourist attractions? A case study of Shanghai, China"}, {"paperId": "c9d156120316bd08decb9b7d5a174510aaf414f4", "title": "A WEB APP TO GENERATE AND DISSEMINATE NEW KNOWLEDGE ON URBAN GREEN SPACE QUALITIES AND THEIR ACCESSIBILITY"}, {"paperId": "1b9c6fc711461443543c396eb88c6c6b7dbebc4e", "title": "Improving ecosystem services supply provides insights for sustainable landscape planning: A case study in Beijing, China."}, {"paperId": "e74ea8daa06adef1129bcc744171e13ddea9c10a", "title": "Sensitivity analysis in multi-criteria evaluation of the suitability of urban green spaces for recreational activities"}, {"paperId": "d81ec0b1dcc4d1a6ee71e7495e9a06540288216e", "title": "A multi-criteria analytical method to assess ecosystem services at urban site level, exemplified by two German city districts"}, {"paperId": "ed03c23cac5f262b83e0d122609736673f347795", "title": "Mapping Public Urban Green Spaces Based on OpenStreetMap and Sentinel-2 Imagery Using Belief Functions"}, {"paperId": "c4b69b7d0e3f9c812876c01c18d1fb190529e3bd", "title": "Assessing the ecological balance between supply and demand of blue-green infrastructure."}, {"paperId": "277d41fa1e46d004cdfe9cd0d20472edfbe19493", "title": "Enhancing recreational activities through planting design in neighborhood parks"}]}
