{"paperId": "647e6c82e16c796887b398ac29bfa773aead8f82", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Service Migration Strategy Based on Multi-Attribute MDP in Mobile Edge Computing", "abstract": "In order to solve the problem of service interruption caused by user movement and the limited service range of edge nodes, a service migration algorithm based on the multi-attribute Markov decision process was proposed for mobile edge computing. By performing service migration, the distance between the user and the service is always kept to a small range. In addition, in order to prevent the service quality from being affected by the frequent migration of users, the return function of the model was defined by comprehensively considering the service quality, the resource demand of the service, the migration cost, and the movement income of users in each node, and on the premise of taking into account the migration cost and resource conditions, which did not only make up the deficiency of the service migration scheme based solely on distance. The number of migrations is also reduced, and a single migration target server is no longer used. The candidate server set was constructed based on the user’s motion trajectory, and the Q-Learning algorithm was used to solve the problem. Simulation results show that the proposed algorithm can reduce the number of migrations and ensure the balance between the number of migrations and the cost of migrations.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-07", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1454014168", "name": "Pengxin Tian"}, {"authorId": "2065238702", "name": "Guannan Si"}, {"authorId": "2194476681", "name": "Zhaoliang An"}, {"authorId": "2195345002", "name": "Jianxin Li"}, {"authorId": "152903583", "name": "Fengyu Zhou"}], "citations": [{"paperId": "507100ed35fb66586182786b5f587f2fd25ec9ed", "title": "A migration strategy based on cluster collaboration predictions for mobile edge computing-enabled smart rail system"}]}
