{"paperId": "648144ab2d392a9715af29ad68e395e124b188ee", "publicationVenue": null, "title": "Towards Stochastically Optimizing Data Computing Flows", "abstract": "With rapid growth in the amount of unstructured data produced by memory-intensive applications, large scale data analytics has recently attracted increasing interest. Processing, managing and analyzing this huge amount of data poses several challenges in cloud and data center computing domain. Especially, conventional frameworks for distributed data analytics are based on the assumption of homogeneity and non-stochastic distribution of different data-processing nodes. The paper argues the fundamental limiting factors for scaling big data computation. It is shown that as the number of series and parallel computing servers increase, the tail (mean and variance) of the job execution time increase. We will first propose a model to predict the response time of highly distributed processing tasks and then propose a new practical computational algorithm to optimize the response time.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-07-14", "journal": {"name": "arXiv: Distributed, Parallel, and Cluster Computing", "volume": ""}, "authors": [{"authorId": "35779995", "name": "F. Farhat"}, {"authorId": "2487483", "name": "D. Z. Tootaghaj"}, {"authorId": "2372241", "name": "M. Arjomand"}], "citations": [{"paperId": "4774eee5c0fbd63dd62d72777a8b06afdf03d205", "title": "CAPTAIN: Comprehensive Composition Assistance for Photo Taking"}, {"paperId": "e1c640b2debcbdabccbb8f52c567cb98187119a9", "title": "CAGE: A Contention-Aware Game-Theoretic Model for Heterogeneous Resource Assignment"}, {"paperId": "6d91cba638f4aa5ef4480339804c87292a4f4b12", "title": "CARMA: Contention-aware Auction-based Resource Management in Architecture"}, {"paperId": "56f00b694f9c36efff691e4bcea33cb3cab89700", "title": "Optimal Placement of Cores, Caches and Memory Controllers in On-Chip Network"}, {"paperId": "67684d1a4fe652edee8b1763b97e1c23b11a7107", "title": "FORK-JOIN QUEUE MODELING AND OPTIMAL SCHEDULING IN PARALLEL PROGRAMMING FRAMEWORKS"}]}
