{"paperId": "648e51dd2d1a57cde859905c882ddf265b445fb5", "publicationVenue": {"id": "142347a8-a3f6-4ce4-bc56-09bc8fc9461d", "name": "Frontiers in Medicine", "type": "journal", "alternate_names": ["Frontiers of Medicine", "Front Med", "Fronteras en Medicina"], "issn": "2296-858X", "alternate_issns": ["2095-0217", "2618-2459"], "url": "https://www.frontiersin.org/journals/medicine", "alternate_urls": ["https://link.springer.com/journal/volumesAndIssues/11684", "http://link.springer.com/journal/11684", "http://www.frontiersin.org/Medicine", "http://journal.frontiersin.org/journal/medicine", "http://www.fronteras.com.ar/"]}, "title": "An Introduction to Machine Learning Approaches for Biomedical Research", "abstract": "Machine learning (ML) approaches are a collection of algorithms that attempt to extract patterns from data and to associate such patterns with discrete classes of samples in the data—e.g., given a series of features describing persons, a ML model predicts whether a person is diseased or healthy, or given features of animals, it predicts weather an animal is treated or control, or whether molecules have the potential to interact or not, etc. ML approaches can also find such patterns in an agnostic manner, i.e., without having information about the classes. Respectively, those methods are referred to as supervised and unsupervised ML. A third type of ML is reinforcement learning, which attempts to find a sequence of actions that contribute to achieving a specific goal. All of these methods are becoming increasingly popular in biomedical research in quite diverse areas including drug design, stratification of patients, medical images analysis, molecular interactions, prediction of therapy outcomes and many more. We describe several supervised and unsupervised ML techniques, and illustrate a series of prototypical examples using state-of-the-art computational approaches. Given the complexity of reinforcement learning, it is not discussed in detail here, instead, interested readers are referred to excellent reviews on that topic. We focus on concepts rather than procedures, as our goal is to attract the attention of researchers in biomedicine toward the plethora of powerful ML methods and their potential to leverage basic and applied research programs.", "venue": "Frontiers in Medicine", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-16", "journal": {"name": "Frontiers in Medicine", "volume": "8"}, "authors": [{"authorId": "46564512", "name": "J. Jovel"}, {"authorId": "143686063", "name": "R. Greiner"}], "citations": [{"paperId": "c32e72663efea84ada426f6892217f4c8dd63c7a", "title": "A review on machine learning approaches in cardiac tissue engineering"}, {"paperId": "754dd6400e2afd605887c02ea251d8069d84eafc", "title": "Identification of distinct immune signatures in inclusion body myositis by peripheral blood immunophenotyping using machine learning models"}, {"paperId": "41790e042c3f30758f5158673b8411d6f329c585", "title": "Improving management of febrile neutropenia in oncology patients: the role of artificial intelligence and machine learning."}, {"paperId": "177ae2051a8c33e8852a5e0cc8d9150293e859fa", "title": "Advances in hydrogen storage materials: harnessing innovative technology, from machine learning to computational chemistry, for energy storage solutions"}, {"paperId": "83ade8903e85663385687bfba05518c290871c2b", "title": "Artificial intelligence-based quantification of COVID-19 pneumonia burden using chest CT"}, {"paperId": "a383c0d317ac894f93e93591d422d712cb87fa31", "title": "Ensemble Methods to Optimize Automated Text Classification in Avatar Therapy"}, {"paperId": "27b967cda9eaeba7eabfb98a147f0066656598b1", "title": "Transforming the cardiometabolic disease landscape: Multimodal AI-powered approaches in prevention and management."}, {"paperId": "d2342dd65879f5cb75839b46ac61df8e1b8b7603", "title": "The SMARTHEP European Training Network"}, {"paperId": "03f3be9e38023e16d24eb4c46b526a96af469a50", "title": "Exploring the matrix: knowledge, perceptions and prospects of artificial intelligence and machine learning in Nigerian healthcare"}, {"paperId": "f3df810e73cc26bee3539586c656a260a9c661d2", "title": "LizardNet: A mobile hybrid deep learning tool for classification of 3D representations of Amazonian lizards"}, {"paperId": "0d7642f7dd8fbf308e21b2371b68e82b84f260ce", "title": "Nonsteroidal anti-inflammatory drug solubility optimization through green chemistry solvent: Artificial intelligence technique"}, {"paperId": "630ed6cdb365b8f4af581e0cb61139637004e463", "title": "Comorbidity Diseases Diagnosis Using Machine Learning Methods and Chi-Square Feature Selection Technique"}, {"paperId": "cda4d9c2cc074d6cd39f3acb9f652484ba6cd977", "title": "Machine learning algorithms in sepsis."}, {"paperId": "8ea0b3ba16f5ee72bac51995d74c5d1cdea68777", "title": "Machine Learning and Radiomics: Changing the Horizon of Crohn's Disease Assessment."}, {"paperId": "5cad078f3ba6e87b64dc9b1f774573a5c90c4ca2", "title": "Machine Learning for Predicting Postoperative Atrial Fibrillation After Cardiac Surgery: A Scoping Review of Current Literature."}, {"paperId": "badb828b5d9c6ebbd9237b5e6c1324d6897ef6eb", "title": "Measuring the unmet needs of American military Veterans and their caregivers: Survey protocol of the HERO CARE survey"}, {"paperId": "3cfb49fa6cb1888ba1cc4bf11eaae5f9e83207bf", "title": "Role of artificial intelligence and machine learning in the diagnosis of cerebrovascular disease"}, {"paperId": "de2ddf7516a651d2aac4f4454a2ee2a85686f8c4", "title": "Computational intelligence modeling of hyoscine drug solubility and solvent density in supercritical processing: gradient boosting, extra trees, and random forest models"}, {"paperId": "a5e2bb4c983e0bd30cff53ab7b1d971104f52698", "title": "A comprehensive review on tungsten oxide nanostructures‐based electrochromic supercapacitors and machine learning models for design and process parameter optimization"}, {"paperId": "78a3e6fa48ca09e50f67cf37406c0f0eaaf91578", "title": "Machine Learning and AI in Cancer Prognosis, Prediction, and Treatment Selection: A Critical Approach"}, {"paperId": "5a80be18d7793fb3da5422051f17c38a32c46659", "title": "Prediction of disease comorbidity using explainable artificial intelligence and machine learning techniques: A systematic review"}, {"paperId": "27e8022a3f823c3e05f9f9ff16fcc3a1f43c2247", "title": "Error Consistency for Machine Learning Evaluation and Validation with Application to Biomedical Diagnostics"}, {"paperId": "b79065d08d5faca522d6f8311a647786a481a4c7", "title": "Artificial intelligence guidance of advanced heart failure therapies: A systematic scoping review"}, {"paperId": "50f24b82ea75cb203d9feb1bb47c4c7d47db592c", "title": "Fatty acid-binding protein-4 (FABP4) and matrix metalloproteinase-9 (MMP9) as predictive values for nonalcoholic steatohepatitis (NASH)"}, {"paperId": "dcffcdf4f5307ec1cf73867454527128c89e0ba1", "title": "Environmental phenol exposure associates with urine metabolome alteration in young Northeast Indian females."}, {"paperId": "a13b0eb1a7a062022f96166a7273c0425541885c", "title": "Predicting the risk of nodular thyroid disease in coal miners based on different machine learning models"}, {"paperId": "1ba07035f83792154e77ed35d842e04de8a1eeeb", "title": "Use of Machine Learning in Stroke Rehabilitation: A Narrative Review"}]}
