{"paperId": "64a2d286c7259b0eb0b8228d02636b14a44ba077", "publicationVenue": {"id": "4b287a90-4cd2-44ad-8edb-c670c48a64b3", "name": "Geological Journal", "type": "journal", "alternate_names": ["Geol J"], "issn": "0072-1050", "alternate_issns": ["1025-6814"], "url": "http://eu.wiley.com/WileyCDA/WileyTitle/productCd-GJ.html", "alternate_urls": ["http://geojournal.igs-nas.org.ua/", "https://onlinelibrary.wiley.com/journal/10991034", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1034", "http://www3.interscience.wiley.com/cgi-bin/jhome/1903"]}, "title": "Evaluating the impact of climate change and geo‐environmental factors on flood hazards in India: An integrated framework", "abstract": "Among several devastating natural hazards, flooding is a common and serious threat to society causing huge loss of lives, properties, and infrastructure throughout the world. The intensity and frequency of this extreme weather event are expected to increase due to significant changes in the present‐day climate and land use and land cover (LULC) pattern. India has a very systematic and organized structural program and policies but lacks proper implementations, and adverse effect of climate change and the extreme event goes on in society. This paper is an analysis of floods in India and hazards due to climate change and LULC change patterns. Three models, namely “Eco‐biogeography‐based optimization (EBO), Random forest (RF), and Support vector machine (SVM)” were used to obtain the final output to prepare a “Flood susceptibility map”. The result was validated through the “Receiver operating characteristics (ROC)” with “Area under curve (AUC)” values. The future rainfall scenario has been estimated by considering the “General circulation models” through different “shared socioeconomic pathways (SSPs)”. The values of AUC are 0.915 (EBO), 0.887 (RF), and 0.869 (SVM), respectively. After consideration of different SSPs, the result shows that there is an increasing tendency of flood hazards in the projected period. Among all the employed modelling approaches, the EBO model has notable potential in delineating the possible flood‐prone regions for effective flood planning and management. Decision‐makers can benefit from country‐specific information and regional planner to implement sustainable and long‐term measures to overcome this type of hazardous situation.", "venue": "Geological Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-16", "journal": {"name": "Geological Journal", "pages": "3515 - 3543", "volume": "58"}, "authors": [{"authorId": "117960838", "name": "Indrajit Chowdhuri"}, {"authorId": "48027109", "name": "S. Pal"}, {"authorId": "40425723", "name": "Paramita Roy"}, {"authorId": "108328184", "name": "Rabin Chakrabortty"}, {"authorId": "35665409", "name": "A. Saha"}, {"authorId": "103406746", "name": "Manisa Shit"}], "citations": [{"paperId": "fde52ac066fbdefceaee0f06be08d788cd55f81a", "title": "Flood risk mapping under changing climate in Lower Tapi river basin, India"}, {"paperId": "e500efddbefdf2e69e13ca8e2e87430d47ee54b1", "title": "Flood susceptibility assessment of the Agartala Urban Watershed, India, using Machine Learning Algorithm"}, {"paperId": "05c70db91b371a17dfa8b20ca7f562d2f295aa94", "title": "Nexus of geoenvironment, resource management and regional sustainable development: Introduction"}]}
