{"paperId": "64a7db68998cfd57f79e479f14758cb895a05268", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "An Integrated Methodological Analysis for the Highest Best Use of Big Data-Based Real Estate Development", "abstract": "This study investigates the integration of methods for real estate development planning and feasibility studies in the changing business environments of emerging big-data. It examines high-rise mixed-use development projects for the highest best use by combining fuzzy theory; thus, it identifies a big data-based innovative decision-making method for systemizing the various factors expected to influence real estate development. In this context, the study creates new evaluation fields and factors by integrating both conventional and big-data based high-rise mixed-use projects. The weight of each value was calibrated by relative significance and fuzzy measure using the Analytic Hierarchy Process (AHP) method. A measuring technique that applies analysis methodology to the evaluation areas was developed for more objective and clearer evaluation, and its application in the field was proposed. Evaluators can systematically assess the concerned evaluation areas during development project planning by examining the process. The findings also provided implications for the evaluation system’s operation by reflecting the variability of specific conditions of the varying projects in real estate and urban and land use planning.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-05", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2116670606", "name": "Jaehwan Kim"}, {"authorId": "123352837", "name": "Ducksu Seo"}, {"authorId": "121484864", "name": "You Seok Chung"}], "citations": [{"paperId": "56814ee7bf68a52a0fa6f315c12d14c805e318c5", "title": "Fiscal inequality and social (in)justice: evidence from the real estate market in Turin"}, {"paperId": "a3893db29e79ac82fd11abc9817ec1df0f47a709", "title": "Sustainable Real Estate: Management, Assessment and Innovations"}]}
