{"paperId": "64aff7c70a99602b4e0be79eec35bdc86a36f4d0", "publicationVenue": {"id": "a25d5cf7-75bd-4479-8c50-5683f7d1d509", "name": "Latin American Computing Conference / Conferencia Latinoamericana En Informatica", "type": "conference", "alternate_names": ["CLEI", "Lat Am Comput Conf  Conf Latinoam Inform", "Conf Latinoam Inform", "Conferencia Latinoamericana En Informatica"]}, "title": "Data Modeling with Ontological Formalism for Semantic Interoperability between Health Information Systems, applied to Primary Health Care in Paraguay", "abstract": "In terms of public health policies, having all the information from the different Health Information Systems enriches the decision-making criteria, but the fact that each system has its own structure and protocols makes integrating all this information a challenge. Therefore, it is essential to have interoperability standards that enable such communication, but although several standards are available for this purpose, in order to make better use of such information, such as making inferences or integrated queries that depend on the semantics of a specific context, such as the public policies of a country, it is necessary to use modeling techniques according to the context. In this sense, this paper presents a solution for semantic interoperability between Health Information Systems, through the use of ontologies. For this purpose, we start from the definition of a Minimum Data Set for Primary Health Care in Paraguay, this Minimum Data Set is used as the basis for the development of an ontology, which for the scope of this work, and as a demonstration, the vaccination area was taken as a scenario. For the ontology validation process, the necessary syntactic interoperability was also implemented to integrate some testing systems and enable the execution of ontological queries.", "venue": "Latin American Computing Conference / Conferencia Latinoamericana En Informatica", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-17", "journal": {"name": "2022 XVLIII Latin American Computer Conference (CLEI)", "pages": "1-10"}, "authors": [{"authorId": "2192857000", "name": "Viviana Osorio"}, {"authorId": "2192863464", "name": "Sonia Laviosa"}, {"authorId": "1419526006", "name": "G. Giménez-Lugo"}, {"authorId": "2113934345", "name": "Cynthia Villalba"}], "citations": []}
