{"paperId": "64b20b68f2a2fbb93bf70bc3acee43369e898a3f", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Apache ShardingSphere: A Holistic and Pluggable Platform for Data Sharding", "abstract": "Traditional relational databases are nowadays over-whelmed by the increasing data volume and concurrent access. NoSQL databases can manage large-scale data, but most of them do not support complete transactions and standard SQL languages. NewSQL is proposed for both high scalability and transactional properties with SQL languages support. One type of NewSQL builds distributed systems from scratch, which is too radical for some critical applications. The other type of NewSQL, i.e., data sharding among relational databases, is a better option for these scenarios. This paper presents Apache ShardingSphere, the first top-level open-source platform for data sharding in Apache, which enables developers to use sharded databases like one database. Specifically Apache, ShardingSphere integrates six databases and designs and implements a complete SQL engine to route requests correctly and intelligently. Additionally it encapsulates three types of distributed transactions and provides two adaptors for different scenarios. Moreover it proposes a novel AutoTable strategy and a query language i.e DistSQL allowing database maintainers to easily configure the sharded databases. Further-more it provides many other pluggable features to better shard data. Extensive experiments are conducted using two famous benchmarking tools proving that Apache ShardingSphere is more efficient than eight state-of-the-art systems in our settings. All experimental source codes are publicly released. More than 170 companies are currently using Apache ShardingSphere.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "2468-2480"}, "authors": [{"authorId": "1720842162", "name": "Ruiyuan Li"}, {"authorId": "2146645299", "name": "Liang Zhang"}, {"authorId": "2110202199", "name": "Juan Pan"}, {"authorId": "2145468871", "name": "Junwen Liu"}, {"authorId": "2155303977", "name": "Peng Wang"}, {"authorId": "2180232448", "name": "Nianjun Sun"}, {"authorId": "2180429541", "name": "Shanmin Wang"}, {"authorId": "2145765196", "name": "Chao Chen"}, {"authorId": "2056183698", "name": "Fuqiang Gu"}, {"authorId": "2582204", "name": "Songtao Guo"}], "citations": [{"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "a4ad08c9c800e418f368f1811673992500395b0b", "title": "ScalarDB: Universal Transaction Manager for Polystores"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}]}
