{"paperId": "64ba47bd973f23df799adb95b44dacc99f16c506", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Blockchain-based Collaborative Edge Intelligence for Trustworthy and Real-Time Video Surveillance", "abstract": "Trustworthy and real-time video surveillance aims to analyze the live camera streams in a privacy-preserving manner for the decision-making of various advanced services, such as pedestrian reidentification and traffic monitoring. In recent years, edge computing has been identified as a promising technology for trustworthy and real-time video surveillance because it keeps confidential video data locally and reduces the latency caused by massive data transmission. Generally, a single edge device can hardly afford the computation-intensive video analytics tasks. Most existing solutions incorporate cloud servers to handle the overloaded tasks. However, such an edge-cloud collaboration approach still suffers from unpredictable latency and privacy concerns because the remote cloud is centralized and distant from the cameras. In this work, we designed a blockchain-based collaborative edge intelligence (BCEI) approach for trustworthy and real-time video surveillance. In BCEI, geo-distributed edge devices form a peer-to-peer network to maintain a permissioned blockchain and share data and computation resources to perform computation-intensive video analytics tasks. The video analytics results are written on the blockchain in an immutable manner to guarantee trustworthiness. To reduce task execution time, we formulate and solve a joint stream mapping and task scheduling problem to schedule video streams and machine learning models among edge devices. A pedestrian reidentification prototype is implemented and deployed based on BCEI with the extensive performance evaluation, indicating the superiority of BCEI in latency reduction and system throughput improvement by leveraging collaboration among edge devices.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "1623-1633", "volume": "19"}, "authors": [{"authorId": "2129402047", "name": "Mingjin Zhang"}, {"authorId": "144115026", "name": "Jiannong Cao"}, {"authorId": "49780283", "name": "Yuvraj Sahni"}, {"authorId": "2164859130", "name": "Qianyi Chen"}, {"authorId": "143966963", "name": "Shan Jiang"}, {"authorId": "2108712780", "name": "Lei Yang"}], "citations": [{"paperId": "719829f90f9e645d799bb739f795b69fa3f0a6d4", "title": "Resource-efficient Parallel Split Learning in Heterogeneous Edge Computing"}, {"paperId": "aecc33f5d6f221b531394157e9967fc60fab64c8", "title": "Blockchain-Based Distributed Multiagent Reinforcement Learning for Collaborative Multiobject Tracking Framework"}, {"paperId": "c6efb2d08a34a1d40e4caf4578044422e6e55b4c", "title": "Revolutionizing Surveillance: A Brief Survey of Edge AI Terminals in Road Infrastructure"}, {"paperId": "df04c41baa151e38bc49a2dde2e6eab1c8fd638d", "title": "Blockchain-Empowered Distributed Multicamera Multitarget Tracking in Edge Computing"}, {"paperId": "c3f572cc3ba9593baf040d8819e58b8a9e69b2b9", "title": "Approximate data mapping in refresh-free DRAM for energy-efficient computing in modern mobile systems"}, {"paperId": "c5515dcd9f7d60e8047d466440c456189d39b024", "title": "Enhancement of edge-based surveillance videos based on bilateral filtering"}, {"paperId": "8fcf58b13d94df419fdb9db328f4bc1aa21c98ba", "title": "Exploring the Potential Benefits of Machine Learning for Optimizing Real-Time Data Analysis"}, {"paperId": "f357721462682b704f3fa5e1081652a39ce3ab2f", "title": "Blockchain-Based Onsite Activity Management for Smart Construction Process Quality Traceability"}, {"paperId": "89468c69592503368db12b4745c6ab3ac6841d71", "title": "Integrating AI into CCTV Systems: A Comprehensive Evaluation of Smart Video Surveillance in Community Space"}, {"paperId": "c5eefe47d8d1b3dd8671009ff0e89b998666b33a", "title": "Decentralized Lattice-Based Device-to-Device Authentication for the Edge-Enabled IoT"}, {"paperId": "3bc9c60b1a4f10db2d9bf6e109d202a768b9883b", "title": "GLSFF: Global-local specific feature fusion for cross-modality pedestrian re-identification"}, {"paperId": "ce774afcc943293423c9b2675d023ebc566e08f8", "title": "Intelligent wireless sensing driven metaverse: A survey"}, {"paperId": "25e4daeb17b48475d7699d5ed7fcd4ca81a358a9", "title": "A Survey of Video Surveillance Systems in Smart City"}, {"paperId": "8d9d2346cb7c3bf843356954531573830378d6f7", "title": "Fast and Atomic Cross-blockchain Asset Exchange for Metaverse Interoperability"}, {"paperId": "95198b4e7f4928fcd6c7d408008654b8abf8f305", "title": "FACSC: Fine-Grained Access Control Based on Smart Contract for Terminals in Software-Defined Network"}, {"paperId": "e09953cba16df231794597accfd8824206a11695", "title": "A Blockchain Based Framework for Opening Up Big Data in Collaborative Edges with Less Resource Consumption"}, {"paperId": "0a29ce35069a5d8e71d04fada2abe6d353f995d7", "title": "Blockchain-Based Secure Firmware Update Using an UAV"}, {"paperId": "2182e5c208da3d1c321f5575d97edd7f376534ee", "title": "<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e930\" altimg=\"si53.svg\"><mml:msup><mml:mrow><mml:mi>f</mml:mi></mml:mrow><mml:mrow><mml:mn>2</mml:mn></mml:mrow></mml:msup></mml:math>-ToF: A Feature-alignment and frequency-division time-of-flight data denoise network"}, {"paperId": "fa4fbe9918ff27a957aa4726e3242cb63ca57a53", "title": "Geometry-guided multilevel RGBD fusion for surface normal estimation"}, {"paperId": "fb5f1ad6d6915e2d121c7d274685fef354274487", "title": "Dynamic strategy to use optimum memory space in real-time video surveillance"}, {"paperId": "e286c2638c754e148d68eb2b177cd4207c013d69", "title": "ENTS: An Edge-native Task Scheduling System for Collaborative Edge Computing"}, {"paperId": "9695d08874c03d64c50d79fa8ac594a6f2c6c219", "title": "Edge Computing Resource Management for Cross-Camera Video Analytics: Workload and Model Adaptation"}, {"paperId": "e5fc0e010b781309faecf7ae068f26c6b7388cdd", "title": "On workflow scheduling for latency-sensitive edge computing applications"}, {"paperId": "99890c141c25a5c80c78ee4edcf3a8885d5d1c78", "title": "Multi-Source Domain Fusion Cross-Domain Pedestrian Recognition Based on High-Quality Intermediate Domains"}, {"paperId": "07f8e8485f5bec8aecfbc8c2f090994bb71f0e59", "title": "Fully Distributed Robust Adaptive Formation Control for Linear Multi-agent System with Uncertainties and Communication Delays⋆"}]}
