{"paperId": "64bf2c6617eaf3f26207b20a053a7cd06e1aa9ad", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Gray-box Soft Sensors in Process Industry: Current Practice, and Future Prospects in Era of Big Data", "abstract": "Virtual sensors, or soft sensors, have greatly contributed to the evolution of the sensing systems in industry. The soft sensors are process models having three fundamental categories, namely white-box (WB), black-box (BB) and gray-box (GB) models. WB models are based on process knowledge while the BB models are developed using data collected from the process. The GB models integrate the WB and BB models for addressing the concerns, i.e., accuracy and intuitiveness, of industrial operators. In this work, various design aspects of the GB models are discussed followed by their application in the process industry. In addition, the changes in the data-driven part of the GB models in the context of enormous amount of process data collected in Industry 4.0 are elaborated.", "venue": "Processes", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-20", "journal": {"name": "Processes"}, "authors": [{"authorId": "2074278091", "name": "I. Ahmad"}, {"authorId": "51885240", "name": "Ahsan Ayub"}, {"authorId": "145211674", "name": "M. Kano"}, {"authorId": "38334322", "name": "Izzat Iqbal Cheema"}], "citations": [{"paperId": "a8461c130346541f330e4bfc23618424b576256c", "title": "A Fault-Tolerant Soft Sensor Algorithm Based on Long Short-Term Memory Network for Uneven Batch Process"}, {"paperId": "5169006824a54fc3daf976f7a0ad514b699dcd78", "title": "A hybrid soft sensor for key product yield of FCC unit based on deep learning framework driven by data and process mechanism"}, {"paperId": "f58ab1992012356815b4615d95b326f9dc8243e4", "title": "Variable time delay estimation in continuous industrial processes"}, {"paperId": "78e49c1ddfcf18b9ed4bfa2b73b967e901109f8e", "title": "Machine learning for industrial sensing and control: A survey and practical perspective"}, {"paperId": "5b5f7ad73510e3f0d84cfea09bc65c1a9df56c8e", "title": "Artificial intelligence based prediction of optimum operating conditions of a plate and fin heat exchanger under uncertainty: A gray-box approach"}, {"paperId": "11cf804c34b806fc5fa6a9dd56120e22e382334d", "title": "Application of artificial neural network for prediction of 10 crude oil properties"}, {"paperId": "20916d373131f2d58b1f7a3bd54aab0b51a3ffef", "title": "The role of artificial intelligence-driven soft sensors in advanced sustainable process industries: A critical review"}, {"paperId": "8559cfc53d6922156baa5cbd42cd49531cdf18ae", "title": "Modelling of Virtual Sensors for Manufacturing Process using Gradient Boosting Technique"}, {"paperId": "5058f4361c6573dcd3c4acf3a8ff42b68b10d7f8", "title": "Data-driven enabling technologies in soft sensors of modern internal combustion engines: Perspectives"}, {"paperId": "19db9cccd2ca92007bcb669122530c034686e7a7", "title": "An Intelligent System for Estimation of Exergy Efficiency of Integrated Naphtha and Isomerization Process under Uncertainty"}, {"paperId": "e17c668c7db0841ee10a146b167f87c4b823869c", "title": "Soft Sensor Model Based on Kernel Slow Feature Analysis and Dynamic inner Principal Component Analysis"}, {"paperId": "5835cc47d812b1937b51ad31d5cc9196e86e8f14", "title": "Grey-Box Modelling and Virtual Sensors Enabling Continuous Commissioning of Hydronic Floor Heating"}, {"paperId": "87520aaab7bc7582a747cd23eea66dea3e41fd19", "title": "Sustainable circularity and intelligent data-driven operations and control of the wastewater treatment plant"}, {"paperId": "91efe861ab654ebb3107e0d732cea9f05b8157bf", "title": "Two-Stage Approach to Parameter Estimation of Differential Equations Using Neural ODEs"}, {"paperId": "0ec84602ec70a85942296eb3dc887ae065f19bb7", "title": "Big Data and Energy Security: Impacts on Private Companies, National Economies and Societies"}, {"paperId": "02e23e2122055d9d3ab520be99a6c27188198f1d", "title": "Soft sensor approach based on magnetic Barkhausen noise by means of the forming process punch-hole-rolling"}, {"paperId": "b6912fa1cd56807953899fb70dde64021eb4dde2", "title": "A hybrid model combining mechanism with semi-supervised learning and its application for temperature prediction in roller hearth kiln"}, {"paperId": "04a0e55986adf2c35cb6374b8664eaf0630f7fdc", "title": "Observability Analysis and Observer Design for a Nonlinear Three-Tank System: Theory and Experiments"}, {"paperId": "56c32cac768cf95ab3b5cb77a6356d40966aa33f", "title": "Cutpoint Temperature Surrogate Modeling for Distillation Yields and Properties"}, {"paperId": "b4ac00b51ac335cf164c78b4b5d3571927244f0f", "title": "Real-Time Decision-Support System for High-Mix Low-Volume Production Scheduling in Industry 4.0"}, {"paperId": "9fa4e1f6d01b7fa0ce5f0f5ce3f4cca19b21f336", "title": "Hybrid-Learning Type-2 Takagi–Sugeno–Kang Fuzzy Systems for Temperature Estimation in Hot-Rolling"}, {"paperId": "1df1f75544e48769a5aeb5eb415579245c0231a7", "title": "A Hierarchical Soft-Sensor Using Spatiotemporal Information Transformation and ARMA With Application in Wastewater Treatment"}, {"paperId": "cfae1a97b9b57a351b6021b8e1270cfe69292e98", "title": "Advanced Soft-Sensor Systems for Process Monitoring, Control, Optimisation, and Fault Diagnosis"}, {"paperId": "270438169ce591e3704bd16efcec2dafeecb294e", "title": "Significance of Sensors for Industry 4.0: Roles, Capabilities, and Applications"}, {"paperId": "9f2ca638767052bd1eee0d16efecb792c29ce98d", "title": "Cutpoint Temperature Modeling using a Coefficient Setup MIQP Technique for Distillation Yields and Properties"}, {"paperId": "7f8445c80e86089e2e490ce52ad0c47c07ac05db", "title": "A Dynamic Grey-Box Model and its Application in the Sintering Process of Ternary Cathode Material"}]}
