{"paperId": "64c96ba05348d970db71da795392b00194a17437", "publicationVenue": null, "title": "Healthcare Data Security Using IoT Sensors Based on Random Hashing Mechanism", "abstract": "Providing security to the healthcare data stored in an IoT-cloud environment is one of the most challenging and demanding tasks in recent days. Because the IoT-cloud framework is constructed with an enormous number of sensors that are used to generate a massive amount of data, however, it is more susceptible to vulnerabilities and attacks, which degrades the security level of the network by performing malicious activities. Hence, Artificial Intelligence (AI) technology is the most suitable option for healthcare applications because it provides the best solution for improving the security and reliability of data. Due to this fact, various AI-based security mechanisms are implemented in the conventional works for the IoT-cloud framework. However, it faces significant problems of increased complexity in algorithm design, inefficient data handling, not being suitable for processing the unstructured data, increased cost of IoT sensors, and more time consumption. Therefore, this paper proposed an AI-based intelligent feature learning mechanism named Probabilistic Super Learning- (PSL-) Random Hashing (RH) for improving the security of healthcare data stored in IoT-cloud. Also, this paper is aimed at reducing the cost of IoT sensors by implementing the proposed learning model. Here, the training model has been maintained for detecting the attacks at the initial stage, where the properties of the reported attack are updated for learning the characteristics of attacks. In addition to that, the random key is generated based on the hash value of the data matrix, which is incorporated with the standard Elliptic Curve Cryptography (ECC) technique for data security. Then, the enhanced ECC-RH mechanism performs the data encryption and decryption processes with the generated random hash key. During performance evaluation, the results of both existing and proposed techniques are validated and compared using different performance indicators.", "venue": "J. Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-02", "journal": {"name": "J. Sensors", "pages": "1-17", "volume": "2022"}, "authors": [{"authorId": "70593472", "name": "A. Khadidos"}, {"authorId": "152603694", "name": "S. Selvarajan"}, {"authorId": "1913161", "name": "A. Khadidos"}, {"authorId": "144063791", "name": "K. Sangeetha"}, {"authorId": "2357570", "name": "K. Alyoubi"}], "citations": [{"paperId": "d0f9a5d5f51e8ba1faa4332417be7406b4f3920b", "title": "Timely detection of DDoS attacks in IoT with dimensionality reduction"}, {"paperId": "19b4c5428066b34236d5e23050abe182e30ff29f", "title": "SCSO-MHEF: Sand Cat Swarm Optimization based MHEF for Nonlinear LTI-IoT Sensor Data Enhancement"}, {"paperId": "3c50c87839b4111988c12556b703ebc1b35133f3", "title": "Federated learning optimization: A computational blockchain process with offloading analysis to enhance security"}, {"paperId": "aeb309aba0e77932431f40d6c38395e7982975da", "title": "A full privacy-preserving distributed batch-based certificate-less aggregate signature authentication scheme for healthcare wearable wireless medical sensor networks (HWMSNs)"}, {"paperId": "907e03db3471d6d22815d786fba2b71b91c946bf", "title": "An Interoperability Framework for Enhanced Security of Handheld Devices Using IoT-Based Secure Energy Efficient Firefly Optimization Algorithm"}, {"paperId": "3b01b72a013caeafd19e92610fc0a6d12f10e841", "title": "Employing Convolutional Neural Network for IoT Healthcare Attack Detection in Intensive Care Unit"}, {"paperId": "230ea5bd1c7bffc64c10c152d681bf2c36b47e20", "title": "TasLA: An innovative Tasmanian and Lichtenberg optimized attention deep convolution based data fusion model for IoMT smart healthcare"}, {"paperId": "306ca8df676da280b4ea7af86e549a794c822fdb", "title": "AI and Blockchain-based Secure Message Exchange Framework for Medical Internet of Things"}, {"paperId": "411f8cec3b50d9a23750d9649bb8240cc5f2e041", "title": "Cyber Security in Internet of Things using Optimization algorithms: A Systematic Mapping of Literature"}, {"paperId": "fddb85593ba3250bb65e3b444af62e2fbc60a938", "title": "A Cluster-Based Energy-Efficient Secure Optimal Path-Routing Protocol for Wireless Body-Area Sensor Networks"}, {"paperId": "0b2e4715c70c5f79eeaffad6a9774cb0392babd0", "title": "A Critical Cybersecurity Analysis and Future Research Directions for the Internet of Things: A Comprehensive Review"}, {"paperId": "69b37e215695510fabc008259704685d3ebbb081", "title": "Distinctive Measurement Scheme for Security and Privacy in Internet of Things Applications Using Machine Learning Algorithms"}, {"paperId": "ec03a8691bddc8612111d21de9eaf57129968d77", "title": "An Optimization-Linked Intelligent Security Algorithm for Smart Healthcare Organizations"}, {"paperId": "5a78d53e7f77e21f4df9831d6f3175bc1d9bb55d", "title": "An Improved Lightweight User Authentication Scheme for the Internet of Medical Things"}, {"paperId": "ebee8139764e4431426015b0da0c3038a31e948b", "title": "A Comprehensive Review on Smart Health Care: Applications, Paradigms, and Challenges with Case Studies"}, {"paperId": "f5a4c47f2bcbfb5161779b09f88c8ab4d3277e0c", "title": "Interaction of Secure Cloud Network and Crowd Computing for Smart City Data Obfuscation"}, {"paperId": "9e61d743a2547f627f4d9083fd2c5c45c4798e47", "title": "Prevention of Cyber Security with the Internet of Things Using Particle Swarm Optimization"}, {"paperId": "5b930dec33c7102b44aa5e31070f569087d712b5", "title": "IoT Enabled Health Care System"}]}
