{"paperId": "64d26687691ee05e8e58a41cfa59f1802eae360e", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Analyzing Roadblocks of Industry 4.0 Adoption Using Graph Theory and Matrix Approach", "abstract": "The manufacturing era is going through an evolutionary phase from Industry 3.0 to Industry 4.0 (I4.0). In 2011, Germany initiated I4.0 during the Hanover fair in collaboration with industrialists, academicians, and researchers. The benefits of implementing I4.0 are attracting the curiosity of practitioners. In current academic literature, there is little discussion related to analyzing potential roadblocks of I4.0 implementation using mathematical modeling. This article has identified roadblocks through an extensive literature review, and validation has been carried out by gathering experts’ opinions. As per the findings, the identified roadblocks have been categorized into five sections: management roadblocks, operational roadblocks, human resource roadblocks, procedural, and behavioral roadblocks. A case study of the automobile industry has been discussed. The data were collected from experts in the area of I4.0. A graph theory and matrix approach was applied to evaluate the relative intensity of the roadblocks, comprehensive I4.0 Index and its range for each category of roadblock. Implications for industrialists, practitioners, and academicians are provided.", "venue": "IEEE transactions on engineering management", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "1-10", "volume": "PP"}, "authors": [{"authorId": "41078471", "name": "Naveen Virmani"}, {"authorId": "78727387", "name": "U. Salve"}, {"authorId": "2005706696", "name": "Anil Kumar"}, {"authorId": "37028587", "name": "S. Luthra"}], "citations": [{"paperId": "cdf88b7f225bd90f0cbcc9e0e040e285780c6ef5", "title": "Global perspectives on operational excellence: unveiling critical failure factors and sustainable pathways"}, {"paperId": "c4e7f03257897f9d03f85dde183d575d0fab4ee1", "title": "Roadmap for integrating blockchain with Internet of Things (IoT) for sustainable and secured operations in logistics and supply chains: Decision making framework with case illustration"}, {"paperId": "7191ac9fc9124d6e2d34b57837441ab3eafbabdc", "title": "Framework for the Strategic Adoption of Industry 4.0: A Focus on Intelligent Systems"}, {"paperId": "837316f4ce1dc0784e36b16345ea84412eefa916", "title": "Exploring paths underlying Industry 4.0 implementation in manufacturing SMEs: a fuzzy-set qualitative comparative analysis"}, {"paperId": "7ecdb28679b8ca1ce67f4678bedcf0cec6f6f388", "title": "Adoption of industry 4.0 evidence in emerging economy: Behavioral reasoning theory perspective"}, {"paperId": "022900b8bdb2e75c88d989cf5613252d319d0490", "title": "Industry 4.0 Implementation Projects: The Cleaner Production Strategy—A Literature Review"}, {"paperId": "634050a1099ac8ee5e81f03dc788c0140899d9e9", "title": "Analysis of critical success factors for successful integration of lean six sigma and Industry 4.0 for organizational excellence"}, {"paperId": "15b5c134e9d4cbef0cbce06d9ce90c540733cb05", "title": "Valuation of inter-boundary inefficiencies accounting IoT based monitoring system in processed food supply chain"}, {"paperId": "5c12dabdf8b73a25ec652843e4751fc90ca12c88", "title": "Prioritising the determinants of Industry-4.0 for implementation in MSME in the post-pandemic period – a quality function deployment analysis"}, {"paperId": "49385ae5b999aaf2822426d537f74e681c08c2b0", "title": "A strategic decision-making framework for sustainable reverse operations"}, {"paperId": "7cdab49964e4d01fca55c212e1ee8d9f48da3a1f", "title": "Modeling traceability in food supply chain"}, {"paperId": "1a530ee343d7a93db9a3252278659869f65860ed", "title": "A toolset for complex decision-making in analyze phase of Lean Six Sigma project: a case validation"}, {"paperId": "517b190d9dab846d502a498376c87f5d075ecff4", "title": "Investigating the role of stakeholder engagement for more resilient vaccine supply chains during COVID-19"}, {"paperId": "d4c297024bfaeaacdb14f49aacd8fe458bd80114", "title": "Circular economy-driven two-stage supply chain management for nullifying waste"}, {"paperId": "864ed5178d2665de43fabe5e5e51422dc01c5505", "title": "Implementing Industry 4.0 through Cleaner Production and Social Stakeholders: Holistic and Sustainable Model"}, {"paperId": "1e114e1d8ef513c3829431ef3417be94a0d4dabf", "title": "Developing human resource for the digitization of logistics operations: readiness index framework"}, {"paperId": "413e6dab937fbfd920b1da80ead4544f05644816", "title": "An analysis of Industry 4.0 implementation-variables by using SAP-LAP and e-IRP approach"}, {"paperId": "144b29c7f4146cc09269e040db556f5f6dd4c3db", "title": "The Role of Industry 4.0 Technologies in Mitigating Supply Chain Disruption: Empirical Evidence From the Australian Food Processing Industry"}, {"paperId": "2bb9e47748cee075cefc4b003c329954526c3b18", "title": "Evaluating Roadblocks to Implementing a Green Freight Transportation System: An Interval Valued Intuitionistic Fuzzy Digraph Matrix Approach"}, {"paperId": "fdfabee9b3a15d7c0cf874e5be9ee2423fd8b37e", "title": "The Selection of Industry 4.0 Technologies Through Bayesian Networks: An Operational Perspective"}, {"paperId": "8d5ce4dc244e81ca662b52a76585affd1a9a2ca9", "title": "System Dynamics Based Analysis of Oil and Gas Supply Chain Disruptions During COVID-19"}, {"paperId": "79a546dd34687010ad8b3e9b9dcf1315d46017f0", "title": "Closing the Gap: The Role of Distributed Manufacturing Systems for Overcoming the Barriers to Manufacturing Sustainability"}]}
