{"paperId": "64d6d0395e4807bc08fbfbd80bcd241ed24921a4", "publicationVenue": {"id": "5fe65a85-30de-437d-b80d-39cf865df9c6", "name": "Measurement and control (London. 1968)", "type": "journal", "alternate_names": ["Meas  Control", "Meas control (london 1968", "Measurement & Control"], "issn": "0020-2940", "url": "https://journals.sagepub.com/home/mac"}, "title": "Load balance oriented data processing mechanism for bounded and unbounded data in smart cities", "abstract": "The co-existence of bounded data and unbounded data gives a great challenge for the traditional single and inflexible data processing in smart cities. The wide promotion of the internet of things (IoT) makes the data amount rapidly increase. This leads to the further raise of the requirement for data processing in smart cities, especially the demand for low latency and abundant data in real-time video services. To solve this problem, a load balance oriented data processing mechanism for bounded and unbounded data in smart cities is proposed. A smart city framework is introduced to explicit the role of data processing in smart cities. A load-balanced data processing mechanism is proposed. Based on the mathematical model for data processing in smart cities, the load-balanced data processing is abstracted into an optimization problem. Aiming to obtain the minimum load balance ratio (LBR), an LBR algorithm is presented. Through simulation and experiment, the superiority and feasibility of our work are validated via numerical simulation and prototype implementation, respectively.", "venue": "Measurement and control (London. 1968)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-15", "journal": {"name": "Measurement and Control", "pages": "1057 - 1066", "volume": "55"}, "authors": [{"authorId": "48382198", "name": "Qing-long Dai"}, {"authorId": "2113337514", "name": "Jin Qian"}, {"authorId": "2144506646", "name": "Jianwu Li"}, {"authorId": "1390572170", "name": "Jun Zhao"}, {"authorId": "2110754962", "name": "Xiaoxiao Liu"}], "citations": []}
