{"paperId": "64d9ade532c42d16be160c2acb836d531f2750c5", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Privacy Concerns in Social Commerce: The Impact of Gender", "abstract": "Today, social commerce is one of the most rapidly growing subsectors of e-commerce, creating new opportunities for brands of all types and sizes. However, despite its popularity and potential, social commerce faces significant challenges, including issues of privacy, trust and ethics. This paper sets out to identify key aspects of privacy which influence ongoing user engagement with social commerce, so that social media, and other social commerce, platforms can more effectively address the issue. In particular, the paper seeks to determine the extent to which these aspects of privacy are a function of gender and, therefore, to increase our understanding of the role of gender in determining a user’s likelihood of sustainable engagement with s-commerce. To explore these issues, the study deploys a mixed methodology (semi-structured interviews and questionnaires) to examine the views of a broad demographic of s-commerce users in Saudi Arabia. The results allowed us to identify three distinct aspects of online privacy that significantly influence the likelihood of engaging in s-commerce and also demonstrated that the relative importance of these aspects is a function of gender. The study enhances current understanding of the role of gender in intention to use s-commerce and provides a framework for further research. The findings of the study will be of interest to all parties involved in the design and provision of s-commerce services, including social media platforms.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-23", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "114814219", "name": "I. Mutambik"}, {"authorId": "2108489084", "name": "John Lee"}, {"authorId": "83503809", "name": "A. Almuqrin"}, {"authorId": "2007046958", "name": "J. Zhang"}, {"authorId": "17829479", "name": "Mohammed S. Baihan"}, {"authorId": "2225485", "name": "Abdulrhman Alkhanifer"}], "citations": [{"paperId": "94a55d356f0a1f6c0b6eabf8b1ba72b2983d4bb9", "title": "Ethical Challenges Associated with Security Vulnerabilities and Data Privacy in Social Networking"}, {"paperId": "6c1e0c7b333322951a194b09ab079664350c09dc", "title": "The Effects of Trust, Perceived Risk, Innovativeness, and Deal Proneness on Consumers’ Purchasing Behavior in the Livestreaming Social Commerce Context"}, {"paperId": "d0e2d08836c7f2f2737e2c9ac3983bf26948f603", "title": "Enforcing Information System Security: Policies and Procedures for Employee Compliance"}]}
