{"paperId": "64da8fb60327be66ef6b347d2ab6b76ea0a3844a", "publicationVenue": {"id": "a320fa1c-fe85-4d55-8e1e-10b44181cb8c", "name": "Journal of Artificial Intelligence and Soft Computing Research", "type": "journal", "alternate_names": ["J Artif Intell Soft Comput Res"], "issn": "2083-2567", "url": "http://www.degruyter.com/view/j/jaiscr", "alternate_urls": ["http://jaiscr.eu/"]}, "title": "Classifiers Accuracy Improvement Based on Missing Data Imputation", "abstract": "Abstract In this paper we investigate further and extend our previous work on radar signal identification and classification based on a data set which comprises continuous, discrete and categorical data that represent radar pulse train characteristics such as signal frequencies, pulse repetition, type of modulation, intervals, scan period, scanning type, etc. As the most of the real world datasets, it also contains high percentage of missing values and to deal with this problem we investigate three imputation techniques: Multiple Imputation (MI); K-Nearest Neighbour Imputation (KNNI); and Bagged Tree Imputation (BTI). We apply these methods to data samples with up to 60% missingness, this way doubling the number of instances with complete values in the resulting dataset. The imputation models performance is assessed with Wilcoxon’s test for statistical significance and Cohen’s effect size metrics. To solve the classification task, we employ three intelligent approaches: Neural Networks (NN); Support Vector Machines (SVM); and Random Forests (RF). Subsequently, we critically analyse which imputation method influences most the classifiers’ performance, using a multiclass classification accuracy metric, based on the area under the ROC curves. We consider two superclasses (‘military’ and ‘civil’), each containing several ‘subclasses’, and introduce and propose two new metrics: inner class accuracy (IA); and outer class accuracy (OA), in addition to the overall classification accuracy (OCA) metric. We conclude that they can be used as complementary to the OCA when choosing the best classifier for the problem at hand.", "venue": "Journal of Artificial Intelligence and Soft Computing Research", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Journal of Artificial Intelligence and Soft Computing Research", "pages": "31 - 48", "volume": "8"}, "authors": [{"authorId": "3122285", "name": "I. Jordanov"}, {"authorId": "35073682", "name": "Nedyalko Petrov"}, {"authorId": "3400166", "name": "Alessio Petrozziello"}], "citations": [{"paperId": "aa8f2bbe364cc0499ac75ada881fb51555a1b53e", "title": "Ship Engine Model Selection by Applying Machine Learning Classification Techniques Using Imputation and Dimensionality Reduction"}, {"paperId": "5110f77042e4e7f8e795da7603df9f3af22edc93", "title": "Implementasi Metode Imputasi Mean dan Single Center Imputation Chained Equation (SICE) Terhadap Hasil Prediksi Linear Regression pada Data Numerik"}, {"paperId": "d3bd9e56d8478cb8c83f9af1d157556a81f8ff6d", "title": "Enhancing Heart Disease Prediction Accuracy through Machine Learning Techniques and Optimization"}, {"paperId": "edc51d72d86bbd3e936d05ed1d15434ec1ab70e4", "title": "Effect of Missing Data Types and Imputation Methods on Supervised Classifiers: An Evaluation Study"}, {"paperId": "94bbabc7bcf9138b6e8468c9be522398be7ac7f6", "title": "Time series intrusion warning with GAN for missing data in CPS"}, {"paperId": "f3133a534f7ec2efdf6eb7c1af70f4985eb051fb", "title": "Tensor Factorization and Attention-Based CNN-LSTM Deep-Learning Architecture for Improved Classification of Missing Physiological Sensors Data"}, {"paperId": "9142baa185d8836ba92fad6353c00004996c94c7", "title": "A review of the current publication trends on missing data imputation over three decades: direction and future research"}, {"paperId": "1b95713b2b28d2730b2c589f25bf2b6ae0eb7c3b", "title": "Estimation of missing values in astronomical survey data: An improved local approach using cluster directed neighbor selection"}, {"paperId": "d35a30c16ff0acddf435e072108d114b78502053", "title": "Systematic Review on Missing Data Imputation Techniques with Machine Learning Algorithms for Healthcare"}, {"paperId": "118b4a3a044dcda48476c1e9f0498898ca63c472", "title": "Tumour genotypes account for survival differences in right‐ and left‐sided colon cancers"}, {"paperId": "fc435b46ec2d3f5f99d18c89282ed6ca845fe5bb", "title": "A climate-driven model for predicting the level of Vibrio parahaemolyticus in oysters harvested from Taiwanese farms using elastic net regularized regression"}, {"paperId": "e6945a40b53fcc47998d4afd7008e759da7063e4", "title": "Hybrid diabetes disease prediction framework based on data imputation and outlier detection techniques"}, {"paperId": "8267c0d3179d7e55c606daaa7b827c40a6669520", "title": "Peningkatan Konerja Metode SVM Menggunakan Metode KNN Imputasi dan K-Means-Smote untuk Klasifikasi Kelulusan Mahasiswa Universitas Bumigora"}, {"paperId": "5e10664e7f4fd0604bdf07f3b5ec0858729499ce", "title": "The Effect of Preprocessing Techniques, Applied to Numeric Features, on Classification Algorithms' Performance"}, {"paperId": "2a092ec794e272575f0cb2bdc497e5fd402a7776", "title": "Enhancing the Human Health Status Prediction: The ATHLOS Project"}, {"paperId": "bb43bbc3b3b62d0af93815ace4547a8bbfd1f03d", "title": "Towards improving machine learning algorithms accuracy by benefiting from similarities between cases"}, {"paperId": "ca5d032b29f7fbbadeb88a6366f79268586618aa", "title": "Autoencoder-based multi-task learning for imputation and classification of incomplete data"}, {"paperId": "51c26036e6a0d002850b3a5bcca792bcfbc6ec05", "title": "Incomplete data classification with view-based decision tree"}, {"paperId": "faf64022d1fd48aa7b57d17208ca543e97cc22f5", "title": "On Learning and Convergence of RBF Networks in Regression Estimation and Classification"}, {"paperId": "f74055e7a6558601d5413f93b1a7801951d1de17", "title": "Resource-Aware Data Stream Mining Using the Restricted Boltzmann Machine"}, {"paperId": "cea09169637c75a707bf6d80a1c9749e974d93e5", "title": "Sequential Data Mining of Network Traffic in URL Logs"}, {"paperId": "a7f041ac1f6047004f719eb1124e30cdfa123347", "title": "Modifications of the Givens Training Algorithm for Artificial Neural Networks"}, {"paperId": "5ea0f3b5d007767271a2d77f12f5a2e775049ee8", "title": "Classifying Image Sequences with the Markov Chain Structure and Matrix Normal Distributions"}, {"paperId": "92797429a080246e9a561745a028a665ed5b806f", "title": "Missing Features Reconstruction and Its Impact on Classification Accuracy"}, {"paperId": "419c958e529a42ec9ccdd3d200986824ecd2320b", "title": "Model selection to improve multiple imputation for handling high rate missingness in a water quality dataset"}, {"paperId": "eb1414b8911737f7c20856aa2e78da0ad0773362", "title": "Feature Based Multivariate Data Imputation"}, {"paperId": "cb99980b1343935f3d17baf7c73d1f4077f24231", "title": "Random Forests for Profiling Computer Network Users"}, {"paperId": "a1b3c860bcd62021e11bf33343af12388addb6e6", "title": "Overcoming the challenges of data integration in ecosystem studies with machine learning workflows: an example from the Santos project"}, {"paperId": "6881e76429b505e193ff2656f387d3bbce5b7b8e", "title": "Classifying Image Series with a Reoccurring Concept Drift Using a Markov Chain Predictor as a Feedback"}, {"paperId": "ce57c7263b102bd32c00277b2f13a7faa3267590", "title": "Identifying Finest Machine Learning Algorithm for Climate Data Imputation in the State of Minas Gerais, Brazil"}, {"paperId": "203870b1eb6dc582592398cd82e2667e7a686bc2", "title": "Open Archive TOULOUSE Archive Ouverte (OATAO)"}]}
