{"paperId": "64eb23d74a590e2095cd5797c258f0d6ae6b4a98", "publicationVenue": null, "title": "How to select a suitable machine learning algorithm: A feature-based, scope-oriented selection framework", "abstract": "The increasing availability of data gatherable from various sources and in several contexts, is forcing practitioners to find affordable ways to manage and exploit datasets. Within this context, machine learning (ML) - which can be described as a set of algorithms to analyse and process data to extract relevant features for clusterization, classification or prediction - emerged as one of the most investigated area providing powerful tools. Indeed, in literature it is possible to find a considerable number of articles dealing with ML algorithms and describing their real-world applications. This considerable number of works, depicting a wide variety of algorithms and widespread applications, creates an extensive knowledge on the topic. At the same time, it may also generate disorientation in the selection of the right approach. Thus, the need of synthesis and guidelines to drive the selection of the most suitable algorithm for a specific scope arises. To provide a response to such a necessity, the authors propose a ML algorithm selection tool. As a starting point, authors analysed several ML algorithms investigating their scope, their characteristics, and their typical fields of application, including also real examples. According to this exploration, authors identified two decision layers: the first one concerns the nature of the learning activity (supervised, unsupervised, etc.) while the second one is related to the characteristics of the ML algorithms (type of response, data size and type they can manage, etc.). Starting from a pool of algorithms, the first layer enables the users to narrow this pool depending on their scope. Then, the second layer guides the final selection, fitting the users’ constraints, the previously mentioned algorithms features, and the data characteristics.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "pages": "87-93", "volume": "2018"}, "authors": [{"authorId": "2056998026", "name": "Roberto Sala"}, {"authorId": "151143096", "name": "M. Zambetti"}, {"authorId": "2479720", "name": "F. Pirola"}, {"authorId": "48078053", "name": "R. Pinto"}], "citations": [{"paperId": "8c81b9933a2855d75393d0169b1c5ba97a14f531", "title": "Data-Driven Decision Making in Maintenance Service Delivery Process: A Case Study"}, {"paperId": "b3a30530b68e0a413b21fd1412bd97b48597feea", "title": "PARAMETRIC COST MODELLING OF COMPONENTS FOR TURBOMACHINES: PRELIMINARY STUDY"}, {"paperId": "9390f48427f7ac752ecb48a6f6233cace363c124", "title": "Data-based decision-making in maintenance service delivery: the D3M framework"}, {"paperId": "252cae71ddc76f3e31f15365cbd857a6cca2088c", "title": "JMTM-08-2020-0301_proof 122..141"}, {"paperId": "b929c8db642d54a6320a3a773b557e8576430d43", "title": "Advances in Production Management Systems. Towards Smart and Digital Manufacturing: IFIP WG 5.7 International Conference, APMS 2020, Novi Sad, Serbia, August 30 – September 3, 2020, Proceedings, Part II"}, {"paperId": "14b2809c4deff31020e7c277b83beaf34ad0675b", "title": "Data-Driven Maintenance Delivery Framework: Test in an Italian Company"}]}
