{"paperId": "64ed8dd1e69ed2d91f50c907e0531f4beff17df5", "publicationVenue": null, "title": "TacTok: semantics-aware proof synthesis", "abstract": "Formally verifying software correctness is a highly manual process. However, because verification proof scripts often share structure, it is possible to learn from existing proof scripts to fully automate some formal verification. The goal of this paper is to improve proof script synthesis and enable fully automating more verification. Interactive theorem provers, such as the Coq proof assistant, allow programmers to write partial proof scripts, observe the semantics of the proof state thus far, and then attempt more progress. Knowing the proof state semantics is a significant aid. Recent research has shown that the proof state can help predict the next step. In this paper, we present TacTok, the first technique that attempts to fully automate proof script synthesis by modeling proof scripts using both the partial proof script written thus far and the semantics of the proof state. Thus, TacTok more completely models the information the programmer has access to when writing proof scripts manually. We evaluate TacTok on a benchmark of 26 software projects in Coq, consisting of over 10 thousand theorems. We compare our approach to five tools. Two prior techniques, CoqHammer, the state-of-the-art proof synthesis technique, and ASTactic, a proof script synthesis technique that models proof state. And three new proof script synthesis technique we create ourselves, SeqOnly, which models only the partial proof script and the initial theorem being proven, and WeightedRandom and WeightedGreedy, which use metaheuristic search biased by frequencies of proof tactics in existing, successful proof scripts. We find that TacTok outperforms WeightedRandom and WeightedGreedy, and is complementary to CoqHammer and ASTactic: for 24 out of the 26 projects, TacTok can synthesize proof scripts for some theorems the prior tools cannot. Together with TacTok, 11.5% more theorems can be proven automatically than by CoqHammer alone, and 20.0% than by ASTactic alone. Compared to a combination of CoqHammer and ASTactic, TacTok can prove an additional 3.6% more theorems, proving 115 theorems no tool could previously prove. Overall, our experiments provide evidence that partial proof script and proof state semantics, together, provide useful information for proof script modeling, and that metaheuristic search is a promising direction for proof script synthesis. TacTok is open-source and we make public all our data and a replication package of our experiments.", "venue": "Proc. ACM Program. Lang.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-13", "journal": {"name": "Proceedings of the ACM on Programming Languages", "pages": "1 - 31", "volume": "4"}, "authors": [{"authorId": "2932798", "name": "Yuriy Brun"}], "citations": [{"paperId": "f1c42a9b6f759960dda0afb9ecd134da58b3ad96", "title": "Solving Proof Block Problems Using Large Language Models"}, {"paperId": "edd3e9d9347a3866e1a5a913733f1d9477ec7a2c", "title": "Learning Guided Automated Reasoning: A Brief Survey"}, {"paperId": "8ffa3d59636dfd9e0917015a6a60ab76e90199d8", "title": "Towards AI-Assisted Synthesis of Verified Dafny Methods"}, {"paperId": "af451aa3ba4138d789d5276b874d2167aa525bbd", "title": "Graph2Tac: Learning Hierarchical Representations of Math Concepts in Theorem proving"}, {"paperId": "4dd6102d63fb21631a0514d5a693531d48eebaaa", "title": "The Tactician's Web of Large-Scale Formal Knowledge"}, {"paperId": "e26ae4db16142a64daf67768f8064321d6f13945", "title": "Leveraging Large Language Models to Boost Dafny's Developers Productivity"}, {"paperId": "cf7f00e636080617fb2f57debb6292c82c03d031", "title": "Getting More out of Large Language Models for Proofs"}, {"paperId": "1c42b6c3dd048f4141ac0841589b711c14748491", "title": "PRoofster: Automated Formal Verification"}, {"paperId": "f0f60b1a381db0a54b9877d5bb410ea98b2bc540", "title": "Seldonian Toolkit: Building Software with Safe and Fair Machine Learning"}, {"paperId": "9f8ac6ee3760ab202e492c733362e5bfc6763934", "title": "Baldur: Whole-Proof Generation and Repair with Large Language Models"}, {"paperId": "6bfba99c95e5be68a175e888a347650d9e9c9c0f", "title": "CoProver: A Recommender System for Proof Construction"}, {"paperId": "dbf9f58779eb554c7be22113bf78e9df78853519", "title": "The promise and perils of using machine learning when engineering software (keynote paper)"}, {"paperId": "cfa086d20ee4bc540d6ca1d2f5321019be6e067d", "title": "Data-driven lemma synthesis for interactive proofs"}, {"paperId": "b191899397087f9a49fa61fa8a2b2a009edb6223", "title": "Diversity-Driven Automated Formal Verification"}, {"paperId": "455dcc6d88fac843c0717f60af2a065feaa7f248", "title": "Passport: Improving Automated Formal Verification Using Identifiers"}, {"paperId": "fe568ac264e047dd930a2b12ab11d47219c61e4b", "title": "Graph Contrastive Pre-training for Effective Theorem Reasoning"}, {"paperId": "22ea3cd56bfbad81e7a7f8d024e710d06f2a2e5d", "title": "Blindspots in Python and Java APIs Result in Vulnerable Code"}, {"paperId": "848160df4e4eeabf0b0f296925fc17ecbd7b65db", "title": "TacticZero: Learning to Prove Theorems from Scratch with Deep Reinforcement Learning"}, {"paperId": "ac6cc408ebd7b1e842edc9597a24d7d738927404", "title": "Better Automatic Program Repair by Using Bug Reports and Tests Together"}, {"paperId": "53f54e04c7e90742ce558a13f2975e6500148e6a", "title": "Proof repair across type equivalences"}, {"paperId": "ceed82aea14a42a001c6bb5f0d7a24393d661225", "title": "Automated Program Repair, What Is It Good For? Not Absolutely Nothing!"}]}
