{"paperId": "64f14a636ae9a6716c93dc7c789d9e554d5bc1ef", "publicationVenue": {"id": "7ec19773-02ec-4b44-bd9d-338e6da82040", "name": "eScience", "type": "journal", "alternate_names": ["IEEE International Conference on eScience", "IEEE Int Conf escience"], "issn": "2667-1417", "url": "https://www.keaipublishing.com/en/journals/escience/"}, "title": "Reference Exascale Architecture", "abstract": "While political commitments for building exascale systems have been made, turning these systems into platforms for a wide range of exascale applications faces several technical, organisational and skills-related challenges. The key technical challenges are related to the availability of data. While the first exascale machines are likely to be built within a single site, the input data is in many cases impossible to store within a single site. Alongside handling of extreme-large amount of data, the exascale system has to process data from different sources, support accelerated computing, handle high volume of requests per day, minimize the size of data flows, and be extensible in terms of continuously increasing data as well as increase in parallel requests being sent. These technical challenges are addressed by the general reference exascale architecture. It is divided into three main blocks: virtualization layer, distributed virtual file system, and manager of computing resources. Its main property is modularity which is achieved by containerization at two levels: 1) application containers - containerization of scientific workflows, 2) micro-infrastructure - containerization of extreme-large data service-oriented infrastructure. The paper also presents an instantiation of the reference architecture - the architecture of the PROCESS project (PROviding Computing solutions for ExaScale ChallengeS) and discuss its relation to the reference exascale architecture. The PROCESS architecture has been used as an exascale platform within various exascale pilot applications. This work will present the requirements and the derived architecture as well as the 5 use cases pilots that it made possible.", "venue": "eScience", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 15th International Conference on eScience (eScience)", "pages": "479-487"}, "authors": [{"authorId": "2105227365", "name": "Martin Bobák"}, {"authorId": "1585243539", "name": "Balázs Somosköi"}, {"authorId": "35228947", "name": "Mara Graziani"}, {"authorId": "1835954", "name": "M. Heikkurinen"}, {"authorId": "1416420415", "name": "Maximilian Höb"}, {"authorId": "2150555654", "name": "Jan Schmidt"}, {"authorId": "1744707", "name": "L. Hluchý"}, {"authorId": "40375628", "name": "A. Belloum"}, {"authorId": "2051508", "name": "Reginald Cushing"}, {"authorId": "1739740", "name": "Jan Meizner"}, {"authorId": "1734870", "name": "Piotr Nowakowski"}, {"authorId": "143824490", "name": "V. Tran"}, {"authorId": "1865626", "name": "O. Habala"}, {"authorId": "144103378", "name": "J. Maassen"}], "citations": [{"paperId": "4ec37a8877f34ba1993edbddcafd14060b26a752", "title": "Processing Radio Astronomical Data Using the PROCESS Software Ecosystem"}, {"paperId": "b6cf1e881ce4c6405094750194c7087d8b2fc64e", "title": "Reference Exascale Architecture (Extended Version)"}]}
