{"paperId": "6503ae3920061b37f59c312b9d1e3771e34cb205", "publicationVenue": {"id": "c545d136-74ba-4905-8ed9-b9ec76a5e444", "name": "Sistemi Evoluti per Basi di Dati", "type": "conference", "alternate_names": ["SEBD", "Sist Evol Basi Dati"], "url": "http://www.sebd.org/"}, "title": "Capturing Political Polarization of Reddit Submissions in the Trump Era", "abstract": "The American political situation of the last years, combined with the incredible growth of Social Networks, led to the diffusion of political polarization’s phenomenon online. Our work presents a model that attempts to measure the political polarization of Reddit submissions during the first half of Donald Trump’s presidency. To do so, we design a text classification task: political polarization of submissions is assessed by quantifying those who align themselves with pro-Trump ideologies and vice versa. We build our ground truth by picking submissions from subreddits known to be strongly polarized. Then, for model selection, we use a Neural Network with word embeddings and Long Short Time Memory layer and, finally, we analyze how model performances change trying different hyper-parameters and types of embeddings.", "venue": "Sistemi Evoluti per Basi di Dati", "year": 2020, "fieldsOfStudy": ["Computer Science", "Political Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "80-87"}, "authors": [{"authorId": "1869835702", "name": "Virginia Morini"}, {"authorId": "28956425", "name": "Laura Pollacci"}, {"authorId": "37340414", "name": "Giulio Rossetti"}], "citations": [{"paperId": "c7b8be4ad6639fa5353d829cdfb0b9fe4854c2a9", "title": "Trends and Topics: Characterizing Echo Chambers' Topological Stability and In-group Attitudes"}, {"paperId": "272de2ce32a7c10b745a4da54e56e1257a237ea6", "title": "A scoping review on the use of natural language processing in research on political polarization: trends and research prospects"}, {"paperId": "f14bd79572850763b33f485d6a09ef84a9638678", "title": "Change my Mind: Data Driven Estimate of Open-Mindedness from Political Discussions"}, {"paperId": "d274812705171203f1e8d0a767bec330d212a8f2", "title": "Toward a Standard Approach for Echo Chamber Detection: Reddit Case Study"}]}
