{"paperId": "6510ef26ad1da6c9c8863a8dc0428d122bb17c81", "publicationVenue": {"id": "914d4734-285a-4cd8-bba1-eec0db26a512", "name": "International Conference on Supercomputing", "type": "conference", "alternate_names": ["International Conference Computer, Communication and Computational Sciences", "ICS", "INFORMS Comput Soc", "Int Conf Supercomput", "INFORMS Computing Society", "Int Conf Comput Commun Comput Sci"], "url": "http://portal.acm.org/proceedings/ics/"}, "title": "Parallelizing pruned landmark labeling: dealing with dependencies in graph algorithms", "abstract": "To help compute shortest path distances over large graphs efficiently, 2-hop labeling has emerged as a major tool, with Pruned Landmark Labeling (PPL) as a popular algorithm. This paper demonstrates the first scalable parallel implementation of the PPL algorithm that produces the same results as the sequential algorithm. Based on theoretical analysis, we show how computations on each vertex can be performed in parallel while maintaining correctness, resulting in the Vertex-Centrix PLL (VC-PLL) algorithm. We also show a formulation of this algorithm based on linear algebra and argue why the use of a library based on linear algebra operations will not produce an efficient implementation. Next, we introduce a batched VC-PLL (BVC-PLL) algorithm to reduce the computational inefficiency in VC-PLL. We have carried out a parallel implementation of this method for modern clusters, combining shared memory and distributed memory parallelism, that can efficiently execute on graphs with more than a billion edges. We also demonstrate how BVC-PLL algorithm can be extended to handle directed graphs and weighted graphs and how the version for weighted graphs can benefit from SIMD parallelization.", "venue": "International Conference on Supercomputing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-06-29", "journal": {"name": "Proceedings of the 34th ACM International Conference on Supercomputing"}, "authors": [{"authorId": "1740308", "name": "R. Jin"}, {"authorId": "2113952229", "name": "Zhen Peng"}, {"authorId": "12237726", "name": "W. Wu"}, {"authorId": "1757152", "name": "F. Dragan"}, {"authorId": "145340303", "name": "G. Agrawal"}, {"authorId": "153108488", "name": "Bin Ren"}], "citations": [{"paperId": "37c4f7cd791c75e46ea00e8cb0436a62f0d2b136", "title": "A Universal Scheme for Partitioned Dynamic Shortest Path Index"}, {"paperId": "b739ec5306307f3575547f83c5ab2cf7c65c4a17", "title": "Hyper-distance Oracles in Hypergraphs"}, {"paperId": "1f1cfad0bf63153e66b2b7fbd455c92a03e9ec04", "title": "An Overview of Reachability Indexes on Graphs"}, {"paperId": "0e8c25dcb23607c099903584290c2a569342505b", "title": "An MPI-Parallel Algorithm for Static and Dynamic Top-k Harmonic Centrality"}, {"paperId": "c5d9239ed9a1853c2f22f5b19931a45597afe5ab", "title": "SimGQ+: Simultaneously evaluating iterative point-to-all and point-to-point graph queries"}, {"paperId": "abf02639e8d4964ac3f18d0bd5a16c6fabe7244e", "title": "SimGQ: Simultaneously Evaluating Iterative Graph Queries"}]}
