{"paperId": "6515bf60bae45c0b9c3f2b9cee1707f5b50a7d92", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Perspective on Time towards Wireless 6G", "abstract": "With the advent of 5G technology, the notion of latency got a prominent role in wireless connectivity, serving as a proxy term for addressing the requirements for real-time communication. As wireless systems evolve towards 6G, the ambition to immerse the digital into the physical reality will increase. Besides making the real-time requirements more stringent, this immersion will bring the notions of time, simultaneity, presence, and causality to a new level of complexity. A growing body of research points out that latency is insufficient to parameterize all real-time requirements. Notably, one such requirement that received a significant attention is information freshness, defined through the Age of Information (AoI) and its derivatives. The objective of this article is to investigate the general notion of timing in wireless communication systems and networks and its relation to effective information generation, processing, transmission, and reconstruction at the senders and receivers. We establish a general statistical framework of timing requirements in wireless communication systems, which subsumes both latency and AoI. The framework is made by associating a timing component with the two basic statistical operations, decision and estimation. We first use the framework to present a representative sample of the existing works that deal with timing in wireless communication. Next, it is shown how the framework can be used with different communication models of increasing complexity, starting from the basic Shannon one-way communication model and arriving to communication models for consensus, distributed learning, and inference. Overall, this paper fills an important gap in the literature by providing a systematic treatment of various timing measures in wireless communication and sets the basis for design and optimization for the next-generation real-time systems.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-08", "journal": {"name": "ArXiv", "volume": "abs/2106.04314"}, "authors": [{"authorId": "1697795", "name": "P. Popovski"}, {"authorId": "48629851", "name": "Federico Chiariotti"}, {"authorId": "1697582", "name": "Kaibin Huang"}, {"authorId": "1404339916", "name": "A. Kalør"}, {"authorId": "1746269", "name": "M. Kountouris"}, {"authorId": "2102846509", "name": "N. Pappas"}, {"authorId": "1722538", "name": "B. Soret"}], "citations": [{"paperId": "fcc765dd8e798de33e3e2ba1809577bd9a079b78", "title": "Application of the Internet of Things and 6G Cellular Communication to Optimize Accounting and International Marketing"}, {"paperId": "2677d97764051f005b55ad931cd15381038f3b3b", "title": "A Survey on Over-the-Air Computation"}, {"paperId": "80440b45d1fd966e79f1794f42805b9f82ea0774", "title": "Semantic Metrics for Non Real-Time Applications"}, {"paperId": "c4fd2609eab9af6c43dfc95d50f52debe30979e8", "title": "Analysis of an Age-Dependent Stochastic Hybrid System"}, {"paperId": "643148df288d61b4d6e5136744988a58562ae55f", "title": "Internet of Things (IoT) Connectivity in 6G: An Interplay of Time, Space, Intelligence, and Value"}, {"paperId": "2ae30e4acd8fa460944153b5bda9733e4f38cf99", "title": "Age-Aware Stochastic Hybrid Systems: Stability, Solutions, and Applications"}, {"paperId": "3f5b322c142735299a80c913bdf8d3c17df6dcc6", "title": "5G Low-latency Communication in Virtual Reality services: Performance Requirements and Promising Solutions"}, {"paperId": "55476893ab00a8f5846695673aa11a40e4372408", "title": "Cellular, Wide-Area, and Non-Terrestrial IoT: A Survey on 5G Advances and the Road Toward 6G"}]}
