{"paperId": "6521d516eed0456352c97f9845c172c5adf1cc34", "publicationVenue": {"id": "e110cc75-cd00-4b7f-968c-fd70b464a553", "name": "Frontiers in Plant Science", "type": "journal", "alternate_names": ["Front Plant Sci"], "issn": "1664-462X", "url": "http://www.frontiersin.org/about/journalseries", "alternate_urls": ["http://www.frontiersin.org/plant_science", "https://www.frontiersin.org/journals/plant-science", "http://journal.frontiersin.org/journal/plant-science"]}, "title": "Field phenotyping for African crops: overview and perspectives", "abstract": "Improvements in crop productivity are required to meet the dietary demands of the rapidly-increasing African population. The development of key staple crop cultivars that are high-yielding and resilient to biotic and abiotic stresses is essential. To contribute to this objective, high-throughput plant phenotyping approaches are important enablers for the African plant science community to measure complex quantitative phenotypes and to establish the genetic basis of agriculturally relevant traits. These advances will facilitate the screening of germplasm for optimum performance and adaptation to low-input agriculture and resource-constrained environments. Increasing the capacity to investigate plant function and structure through non-invasive technologies is an effective strategy to aid plant breeding and additionally may contribute to precision agriculture. However, despite the significant global advances in basic knowledge and sensor technology for plant phenotyping, Africa still lags behind in the development and implementation of these systems due to several practical, financial, geographical and political barriers. Currently, field phenotyping is mostly carried out by manual methods that are prone to error, costly, labor-intensive and may come with adverse economic implications. Therefore, improvements in advanced field phenotyping capabilities and appropriate implementation are key factors for success in modern breeding and agricultural monitoring. In this review, we provide an overview of the current state of field phenotyping and the challenges limiting its implementation in some African countries. We suggest that the lack of appropriate field phenotyping infrastructures is impeding the development of improved crop cultivars and will have a detrimental impact on the agricultural sector and on food security. We highlight the prospects for integrating emerging and advanced low-cost phenotyping technologies into breeding protocols and characterizing crop responses to environmental challenges in field experimentation. Finally, we explore strategies for overcoming the barriers and maximizing the full potential of emerging field phenotyping technologies in African agriculture. This review paper will open new windows and provide new perspectives for breeders and the entire plant science community in Africa.", "venue": "Frontiers in Plant Science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-10-04", "journal": {"name": "Frontiers in Plant Science", "volume": "14"}, "authors": [{"authorId": "2084589176", "name": "Daniel Cudjoe"}, {"authorId": "6506934", "name": "N. Virlet"}, {"authorId": "2254428034", "name": "March Castle"}, {"authorId": "32882326", "name": "A. Riche"}, {"authorId": "2254427734", "name": "Manal Mhada"}, {"authorId": "10035513", "name": "T. Waine"}, {"authorId": "1875389", "name": "F. Mohareb"}, {"authorId": "6908039", "name": "M. Hawkesford"}], "citations": [{"paperId": "af83b38b692ef6fba0c54f61207ee7df5bb1b4d1", "title": "UAV image acquisition and processing for high‐throughput phenotyping in agricultural research and breeding programs"}]}
