{"paperId": "654926c78c6f20e72e86457267c920126041a359", "publicationVenue": {"id": "8f5e0848-3fd6-4129-ab41-393d4529fd7c", "name": "KSII Transactions on Internet and Information Systems", "type": "journal", "alternate_names": ["Ksii Trans Internet Inf Syst", "Ksii Transactions on Internet and Information Systems", "KSII Trans Internet Inf Syst"], "issn": "1976-7277", "url": "http://www.ksii.or.kr/", "alternate_urls": ["http://www.itiis.org/"]}, "title": "A Fault Tolerant Data Management Scheme for Healthcare Internet of Things in Fog Computing", "abstract": "Fog computing aims to provide the solution of bandwidth, network latency and energy consumption problems of cloud computing Likewise, management of data generated by healthcare IoT devices is one of the significant applications of fog computing Huge amount of data is being generated by healthcare IoT devices and such types of data is required to be managed efficiently, with low latency, without failure, and with minimum energy consumption and low cost Failures of task or node can cause more latency, maximum energy consumption and high cost Thus, a failure free, cost efficient, and energy aware management and scheduling scheme for data generated by healthcare IoT devices not only improves the performance of the system but also saves the precious lives of patients because of due to minimum latency and provision of fault tolerance Therefore, to address all such challenges with regard to data management and fault tolerance, we have presented a Fault Tolerant Data management (FTDM) scheme for healthcare IoT in fog computing In FTDM, the data generated by healthcare IoT devices is efficiently organized and managed through well-defined components and steps A two way fault-tolerant mechanism i e , task-based fault-tolerance and node-based fault-tolerance, is provided in FTDM through which failure of tasks and nodes are managed The paper considers energy consumption, execution cost, network usage, latency, and execution time as performance evaluation parameters The simulation results show significantly improvements which are performed using iFogSim Further, the simulation results show that the proposed FTDM strategy reduces energy consumption 3 97%, execution cost 5 09%, network usage 25 88%, latency 44 15% and execution time 48 89% as compared with existing Greedy Knapsack Scheduling (GKS) strategy Moreover, it is worthwhile to mention that sometimes the patients are required to be treated remotely due to non-availability of facilities or due to some infectious diseases such as COVID-19 Thus, in such circumstances, the proposed strategy is significantly efficient © 2021 Korean Society for Internet Information All rights reserved", "venue": "KSII Transactions on Internet and Information Systems", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-31", "journal": {"name": "KSII Trans. Internet Inf. Syst.", "pages": "35-57", "volume": "15"}, "authors": [{"authorId": "2122651258", "name": "W. Saeed"}, {"authorId": "2020286823", "name": "Z. Ahmad"}, {"authorId": "3196099", "name": "A. I. Jehangiri"}, {"authorId": "145498019", "name": "N. Mohamed"}, {"authorId": "2056221581", "name": "A. Umar"}, {"authorId": "1381452309", "name": "J. Ahmad"}], "citations": [{"paperId": "c7b7dc406c6b1eb5735af9c4984b3ed9ca492d1b", "title": "A High-Reliability Edge-Side Mobile Terminal Shared Computing Architecture Based on Task Triple-Stage Full-Cycle Monitoring"}, {"paperId": "23bda784d71ad2bf3c8ea479ce596f571bb14c00", "title": "Optimization of Maritime Communication Workflow Execution with a Task-Oriented Scheduling Framework in Cloud Computing"}, {"paperId": "3c38ea14512e22601df06e12c5e8034758261b4d", "title": "REVeno: RTT Estimation Based Multipath TCP in 5G Multi-RAT Networks"}, {"paperId": "2f0dd405a7c0839462a669e14af10e84fa5992aa", "title": "Fog computing network security based on resources management"}, {"paperId": "70a31ef6c72561b994a21e30993fd5d6707b182a", "title": "Leveraging 6G, extended reality, and IoT big data analytics for healthcare: A review"}, {"paperId": "771955966d3d7a5f80baee4cf2b4971b112c97c9", "title": "Dependable Mobile Federated Learning Classifications Focused for Mobile Intelligent Source Distribution System in Big Data Analytics using Artificial Internet of Things"}, {"paperId": "c021c33efa825e7ae626659e7e23b5822c42e69d", "title": "Improving Healthcare Facility Safety with Electronic Monitoring by a Machine Learning Framework Based on the Internet of Things"}, {"paperId": "a72f0bec5c832ac317211a868e80c5f921f1cc3b", "title": "A systematic review on resource provisioning in fog computing"}, {"paperId": "a40bae334b687635e10b2a6e932726ae6c6ef001", "title": "Proactive Network Fault Management for Reliable Subscribed Network Slicing in Software-Defined Mobile Data IoT Services"}, {"paperId": "df23dfd4fdbd503597a08379cbf1b9c56e0a8643", "title": "Intelligent Offloading Decision and Resource Allocations Schemes Based on RNN/DQN for Reliability Assurance in Software-Defined Massive Machine-Type Communications"}, {"paperId": "0455cb1490cf030a15f1154e89b347247e39c6e2", "title": "Systematic Review Analysis on Smart Building: Challenges and Opportunities"}, {"paperId": "1664ed825ad578b68f2a1adc50a5fe99f4906c1b", "title": "A Time-Series Process Event Log Preprocessing Approach for Data-Intensive and Predictive Operationalization of Smart Factories"}, {"paperId": "395792074974ed89af97dafd6327e31616c8893e", "title": "The COVID-19 impact on air condition usage: a shift towards residential energy saving"}, {"paperId": "38c439a6883df88627341ea323024f256edaca33", "title": "Trustworthy and Efficient Routing Algorithm for IoT-FinTech Applications Using Nonlinear Lévy Brownian Generalized Normal Distribution Optimization"}, {"paperId": "d1c3acf729b2270563ccfcb60d9d069d082efa95", "title": "QoS-Ledger: Smart Contracts and Metaheuristic for Secure Quality-of-Service and Cost-Efficient Scheduling of Medical-Data Processing"}, {"paperId": "5fe774255c7d5806d2cbe56933ff3f1f45427fd0", "title": "Fault-Tolerant and Data-Intensive Resource Scheduling and Management for Scientific Applications in Cloud Computing"}, {"paperId": "6ffd89e6c240133cb4a3d1cd0ef492422a5ad834", "title": "Multi-Agent Deep Q-Networks for Efficient Edge Federated Learning Communications in Software-Defined IoT"}, {"paperId": "ede9e0f8032b447e314ff887ffefd36ad96327e2", "title": "SIMAD: Secure Intelligent Method for IoT-Fog Environments Attacks Detection"}, {"paperId": "7712f3398a99504e45ad50f2c82ec727d9832ddc", "title": "Scientific Workflows Management and Scheduling in Cloud Computing: Taxonomy, Prospects, and Challenges"}, {"paperId": "884a52ead45e77445db03446004aee2887b780f2", "title": "Reliable Federated Learning Systems Based on Intelligent Resource Sharing Scheme for Big Data Internet of Things"}]}
