{"paperId": "654a9cd827e01e49674a19d5191a163025493e86", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Dynamic Edge-centric Resource Provisioning for Online and Offline Services Co-location", "abstract": "Due to the penetration of edge computing, a wide variety of workloads are sunk down to the network edge to alleviate huge pressure of the cloud. With the presence of high input workload dynamics and intensive edge resource contention, it is highly non-trivial for an edge proxy to optimize the scheduling of heterogeneous services with diverse QoS requirements. In general, online services should be quickly completed in a quite stable running environment to meet their tight latency constraint, while offline services can be processed in a loose manner for their elastic soft deadlines. To well coordinate such services at the resource-limited edge cluster, in this paper, we study an edge-centric resource provisioning optimization for dynamic online and offline services co-location, where the proxy seeks to maximize timely online service performances while maintaining satisfactory long-term offline service performances. However, intricate hybrid couplings for provisioning decisions arise due to heterogeneous constraints of the co-located services and their different time-scale performances. We hence first propose a reactive provisioning approach without requiring a prior knowledge of future system dynamics, which leverages a Lagrange relaxation for devising constraint-aware stochastic subgradient algorithm to deal with the challenge of hybrid couplings. To further boost the performance by integrating the powerful machine learning techniques, we also advocate a predictive provisioning approach, where the future request arrivals can be estimated accurately. With rigorous theoretical analysis and extensive trace-driven evaluations, we show the superior performance of our proposed algorithms for online and offline services co-location at the edge.", "venue": "IEEE Conference on Computer Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-17", "journal": {"name": "IEEE INFOCOM 2023 - IEEE Conference on Computer Communications", "pages": "1-10"}, "authors": [{"authorId": "2247542154", "name": "Ouyang Tao"}, {"authorId": "2175367749", "name": "Kongyange Zhao"}, {"authorId": "2155148589", "name": "Xiaoxi Zhang"}, {"authorId": "145447664", "name": "Zhi Zhou"}, {"authorId": "1712187180", "name": "Xu Chen"}], "citations": [{"paperId": "c6a758bf4fb9cf4cf9ed94aa841208afcba89bd1", "title": "Adaptive Overlap Padding and Resolution Selection for Frame Split-based Edge Video Analytics"}]}
