{"paperId": "655a45678f2522d406c7606549bb3cf09683f385", "publicationVenue": {"id": "af90489e-312f-4514-bea2-bcb399cb8ece", "name": "Interspeech", "type": "conference", "alternate_names": ["Conf Int Speech Commun Assoc", "INTERSPEECH", "Conference of the International Speech Communication Association"], "issn": "2308-457X", "url": "https://www.isca-speech.org/iscaweb/index.php/conferences/interspeech", "alternate_urls": ["http://www.isca-speech.org/"]}, "title": "Reducing Offensive Replies in Open Domain Dialogue Systems", "abstract": "In recent years, a series of open-domain dialogue systems using large-scale language models have been proposed. These dialogue systems are attracting business attention because these do signiﬁcantly natural and diverse dialogues with humans. However, it has been noted that these dialogue systems reﬂect gender, race, and other biases inherent in the data and may generate offensive replies or replies that agree with offensive utterances. This study examined a dialogue system that outputs appropriate replies to offensive utterances. Speciﬁcally, our system incorporates multiple dialogue models, each of which is specialized to suppress offensive replies in a speciﬁc category, then selects the most non-offensive reply from the outputs of the models. We evaluated the utility of our system when suppressing offensive replies of DialoGPT. We conﬁrmed ours reduces the offensive replies to less than 1%, whereas one of the state-of-the-art suppressing methods reduces to 9.8%.", "venue": "Interspeech", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-18", "journal": {"pages": "1076-1080"}, "authors": [{"authorId": "145007352", "name": "Naokazu Uchida"}, {"authorId": "2320220", "name": "Takeshi Homma"}, {"authorId": "2144702", "name": "Makoto Iwayama"}, {"authorId": "2106369", "name": "Yasuhiro Sogawa"}], "citations": [{"paperId": "839629148d8c1a4d8b7fe0e37c89a543b6e985d7", "title": "Can LLMs Recognize Toxicity? Structured Toxicity Investigation Framework and Semantic-Based Metric"}]}
