{"paperId": "655f2893bdb688c2cb24ae1fcefe1aaee5fc89db", "publicationVenue": {"id": "aa3bc360-f7a4-4ded-831c-da30eebcdd91", "name": "Brazilian Symposium on Systematic and Automated Software Testing", "type": "conference", "alternate_names": ["SAST", "Braz Symp Syst Autom Softw Test"]}, "title": "On the use of test smells for prediction of flaky tests", "abstract": "Regression testing is an important phase to deliver software with quality. However, flaky tests hamper the evaluation of test results and can increase costs. This is because a flaky test may pass or fail non-deterministically and to identify properly the flakiness of a test requires rerunning the test suite multiple times. To cope with this challenge, approaches have been proposed based on prediction models and machine learning. Existing approaches based on the use of the test case vocabulary may be context-sensitive and prone to overfitting, presenting low performance when executed in a cross-project scenario. To overcome these limitations, we investigate the use of test smells as predictors of flaky tests. We conducted an empirical study to understand if test smells have good performance as a classifier to predict the flakiness in the cross-project context, and analysed the information gain of each test smell. We also compared the test smell-based approach with the vocabulary-based one. As a result, we obtained a classifier that had a reasonable performance (Random Forest, 0.83%) to predict the flakiness in the testing phase. This classifier presented better performance than vocabulary-based model for cross-project prediction. The Assertion Roulette and Sleepy Test test smell types are the ones associated with the best information gain values.", "venue": "Brazilian Symposium on Systematic and Automated Software Testing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-08-26", "journal": {"name": "Proceedings of the 6th Brazilian Symposium on Systematic and Automated Software Testing"}, "authors": [{"authorId": "2946954", "name": "Bruno Henrique Pachulski Camara"}, {"authorId": "38171365", "name": "Marco Aurélio Graciotto Silva"}, {"authorId": "9126430", "name": "A. T. Endo"}, {"authorId": "145983572", "name": "S. Vergilio"}], "citations": [{"paperId": "f8b2587839839bb04ef7bea1c0de685dbe4ed2fc", "title": "A comprehensive catalog of refactoring strategies to handle test smells in Java-based systems"}, {"paperId": "b255db1529fe6cedb8b3e5847e50641de2eec19c", "title": "Test Code Flakiness in Mobile Apps: The Developer's Perspective"}, {"paperId": "550d96df9a61a43146b32602492c19ca7be15d48", "title": "Vocabulary of Flaky Tests in Javascript"}, {"paperId": "33758a8ebb94bb8819376d2cf604d3072b65fc67", "title": "Test flakiness' causes, detection, impact and responses: A multivocal review"}, {"paperId": "72b07e6004eee667eb3ce7ce1607664b92b2a2e0", "title": "FlakyCat: Predicting Flaky Tests Categories using Few-Shot Learning"}, {"paperId": "576644ddbe438a3afe736b52da9d8850cd6effbb", "title": "Empirically evaluating flaky test detection techniques combining test case rerunning and machine learning models"}, {"paperId": "192ac00421ea922fcf7e65406157c20bef352f6a", "title": "Do the Test Smells Assertion Roulette and Eager Test Impact Students’ Troubleshooting and Debugging Capabilities?"}, {"paperId": "f5d0bf2d59260d6164f93dbf2980f5aba0b23cb8", "title": "The Importance of Discerning Flaky from Fault-triggering Test Failures: A Case Study on the Chromium CI"}, {"paperId": "bf2526fc177d072687b6aea37ea4ab197b0d40db", "title": "Test Flakiness' Causes, Detection, Impact and Responses: A Multivocal Review"}, {"paperId": "cd01cb39aa26b81e965a8e7fa05df11e4015e3ae", "title": "Static test flakiness prediction: How Far Can We Go?"}, {"paperId": "98d653bd0e943b9a978e5322d00bd9138fc724d2", "title": "Predicting Flaky Tests Categories using Few-Shot Learning"}, {"paperId": "e49e0c1c3bb920c28428598035da08d55e36366f", "title": "SleepReplacer: a novel tool-based approach for replacing thread sleeps in selenium WebDriver test code"}, {"paperId": "5256f2da6ccb01c73576f8aa3e95c8a11b715274", "title": "What Made This Test Flake? Pinpointing Classes Responsible for Test Flakiness"}, {"paperId": "7006c481e07cf0c71d93d82f8cfbafc5ffac8913", "title": "Flakify: A Black-Box, Language Model-Based Predictor for Flaky Tests"}]}
