{"paperId": "657764d95876300ec282a5ed96774981084a3cd8", "publicationVenue": null, "title": "LIMA: Fine-grained Lineage Tracing and Reuse in Machine Learning Systems", "abstract": "Machine learning (ML) and data science workflows are inherently exploratory. Data scientists pose hypotheses, integrate the necessary data, and run ML pipelines of data cleaning, feature engineering, model selection and hyper-parameter tuning. The repetitive nature of these workflows, and their hierarchical composition from building blocks exhibits high computational redundancy. Existing work addresses this redundancy with coarse-grained lineage tracing and reuse for ML pipelines. This approach allows using existing ML systems, but views entire algorithms as black boxes, and thus, fails to eliminate fine-grained redundancy and to handle internal non-determinism. In this paper, we introduce LIMA, a practical framework for efficient, fine-grained lineage tracing and reuse inside ML systems. Lineage tracing of individual operations creates new challenges and opportunities. We address the large size of lineage traces with multi-level lineage tracing and reuse, as well as lineage deduplication for loops and functions; exploit full and partial reuse opportunities across the program hierarchy; and integrate this framework with task parallelism and operator fusion. The resulting framework performs fine-grained lineage tracing with low overhead, provides versioning and reproducibility, and is able to eliminate fine-grained redundancy. Our experiments on a variety of ML pipelines show performance improvements up to 12.4x.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "39454224", "name": "Arnab Phani"}, {"authorId": "2053062532", "name": "Benjamin Rath"}, {"authorId": "40237241", "name": "Matthias Boehm"}], "citations": [{"paperId": "5cbbe911564117fc4ac7c53866c189fe60166cad", "title": "SAGA: A Scalable Framework for Optimizing Data Cleaning Pipelines for Machine Learning Applications"}, {"paperId": "2aa4f898e28e4cdea16f6c7baa403a7db5d91eb5", "title": "ElasticNotebook: Enabling Live Migration for Computational Notebooks (Technical Report)"}, {"paperId": "3a29a9e6168cf1620fe76b3702e473de6f6fec67", "title": "Saturn: An Optimized Data System for Multi-Large-Model Deep Learning Workloads"}, {"paperId": "0bec90c5864ef3688b23e1922f074a8588a64740", "title": "Integrated Reproducibility with Self-describing Machine Learning Models"}, {"paperId": "67976cbac9f85ca0b82b8e22ac5ae0eeb2bb1148", "title": "Orca: Scalable Temporal Graph Neural Network Training with Theoretical Guarantees"}, {"paperId": "35383850bc203178b43e6e0b43b57197488db506", "title": "Transactional Python for Durable Machine Learning: Vision, Challenges, and Feasibility"}, {"paperId": "a24c8ad1a21bb735a327051d2b193d90669dff7d", "title": "MaskSearch: Querying Image Masks at Scale"}, {"paperId": "a12e64c8bd53136147862b570981581758e4937e", "title": "Management of Machine Learning Lifecycle Artifacts"}, {"paperId": "d9cf56bf6a33e3cf225e9e46192ab42a08fae0d6", "title": "Federated Data Preparation, Learning, and Debugging in Apache SystemDS"}, {"paperId": "6b881dd1026adcbc8deffe85c1280ad54f1d3b71", "title": "UPLIFT: Parallelization Strategies for Feature Transformations in Machine Learning Workloads"}, {"paperId": "9aa70521b1c58f3542cddf50165d74016c64c660", "title": "Enabling useful provenance in scripting languages with a human-in-the-loop"}, {"paperId": "9ffa0d2a4042bdc8e991999c8c1df1348eb60ca5", "title": "Redundancy Elimination in Distributed Matrix Computation"}, {"paperId": "e65a8c5151bb30a034248e03f12f5b4cc6115d25", "title": "Nautilus: An Optimized System for Deep Transfer Learning over Evolving Training Datasets"}, {"paperId": "2690e49c0113f1ffb884c95521ba6344067f0023", "title": "Tribuo: Machine Learning with Provenance in Java"}, {"paperId": "d59a2b2f7c9edd802abb92e6012831399d1f3a40", "title": "ExDRa: Exploratory Data Science on Federated Raw Data"}, {"paperId": "3c3f8344e58ff7a8ea9c924e428bda5b8c775df6", "title": "DAPHNE: An Open and Extensible System Infrastructure for Integrated Data Analysis Pipelines"}, {"paperId": "5aa4b98b9e0fea253b3ead8a6ccd8fb499243242", "title": "Reproducibility Report for ACM SIGMOD 2021 Paper: “LIMA: Fine-grained Lineage Tracing and Reuse in Machine Learning Systems”"}, {"paperId": "4d29952cf006852f4b147757b69bcf7902cec55d", "title": "Intelligent Storage System of Machine Learning Model Based on Task Similarity"}]}
