{"paperId": "6586d59186830d62ff7bbad4e2691ec58e8b6b09", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "Integration of the Internet of Things and Cloud: Security Challenges and Solutions - A Review", "abstract": "The integration of IoT and cloud poses increased security challenges. Implementing security mechanisms in IoT systems is challenging due to the availability of limited resources, large number of devices, heterogeneity of devices, generation of bulk data, etc. Likewise, cloud resources are also vulnerable to security issues due to virtualization, insider threats, data loss, data breaches, insecure APIs, etc. Security is of major concern with the integration of IoT and cloud. The primary objective of this review is to highlight the security issues associated with an IoT system and cloud system and with the integration of the two, as well as to highlight solutions in each case. The secondary objective is to describe popular IoT-cloud platforms and also to highlight how such platforms facilitate secure integration. Ultimately a highlight on a shared responsibility model of implementing security is emphasized as both IoT users and cloud service providers have to cooperatively share the responsibility to deploy secure cloud-based IoT applications.", "venue": "International Journal of Cloud Applications and Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-10", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "1-30", "volume": "13"}, "authors": [{"authorId": "1930214", "name": "Chellammal Surianarayanan"}, {"authorId": "2939136", "name": "P. Chelliah"}], "citations": [{"paperId": "35bda29a5309f7d26aa0adf848b75cf1ca7f1590", "title": "Deep Learning Based Cyber Attack Detection in 6G Wireless Networks"}, {"paperId": "29178dff4a489d1b661d235ea89678e76d2f3334", "title": "Adaptive Defense Mechanisms Against Phishing Threats in 6G Wireless Environments"}]}
