{"paperId": "659313d4cfb5f01a1b70f31507ff7e55adaa0b9e", "publicationVenue": {"id": "cf2fbd9c-a076-4ccf-90f2-f26e7992b81d", "name": "International Workshop on Big Data and Information Security", "type": "conference", "alternate_names": ["IWBIS", "Int Workshop Big Data Inf Secur"]}, "title": "Performance Comparison of Bitcoin Prediction in Big Data Environment", "abstract": "In today’s world, everything is transforming to digital forms. These yield large amount of data. A good analysis of these data can lead to new knowledge about the present situation as well as the future insight. While many advantages could be obtained from these large data, the issue on how to run the Machine Learning on a large dataset as effective and efficient as possible remains an open problem. In this paper, data processing simulation using machine learning algorithm ofLinear Regression is conducted to learn from Bitcoin trading dataset. The simulation is carried out in Apache Spark cluster architecture and GPU. The running time and error of the algorithm implementation in both architectures are compared with each other. The simulation results show similar error performance between Apache Spark cluster and GPU. Yet, Apache Spark can run the simulation faster than GPU.", "venue": "International Workshop on Big Data and Information Security", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-12", "journal": {"name": "2018 International Workshop on Big Data and Information Security (IWBIS)", "pages": "99-106"}, "authors": [{"authorId": "3412248", "name": "S. C. Purbarani"}, {"authorId": "1775350", "name": "W. Jatmiko"}], "citations": [{"paperId": "9b3911c9de60bc0191a8d095bfe2ad02eb7079b5", "title": "Twitter Attribute Classification With Q-Learning on Bitcoin Price Prediction"}, {"paperId": "65c73e8dac3adebdd90ca1765252f60a4982fbb2", "title": "Bitcoin Candlestick Prediction with Deep Neural Networks Based on Real Time Data"}]}
