{"paperId": "659e0251563e5dc83dbc6f02a65389cf3042e013", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Time- and Computation-Efficient Data Localization at Vehicular Networks’ Edge", "abstract": "As Vehicular Networks rely increasingly on sensed data to enhance functionality and safety, efficient and distributed data analysis is needed to effectively leverage new technologies in real-world applications. Considering the tens of GBs per hour sensed by modern connected vehicles, traditional analysis, based on global data accumulation, can rapidly exhaust the capacity of the underlying network, becoming increasingly costly, slow, or even infeasible. Employing the edge processing paradigm, which aims at alleviating this drawback by leveraging vehicles’ computational power, we are the first to study how to localize, efficiently and distributively, relevant data in a vehicular fleet for analysis applications. This is achieved by appropriate methods to spread requests across the fleet, while efficiently balancing the time needed to identify relevant vehicles, and the computational overhead induced on the Vehicular Network. We evaluate our techniques using two large sets of real-world data in a realistic environment where vehicles join or leave the fleet during the distributed data localization process. As we show, our algorithms are both efficient and configurable, outperforming the baseline algorithms by up to a 40× speedup while reducing computational overhead by up to 3×, while providing good estimates for the fraction of vehicles with relevant data and fairly spreading the workload over the fleet. All code as well as detailed instructions are available at https://github:com/dcs-chalmers/dataloc_vn.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "3058334", "name": "Romaric Duvignau"}, {"authorId": "133705396", "name": "Bastian Havers"}, {"authorId": "1912583", "name": "Vincenzo Gulisano"}, {"authorId": "1752071", "name": "M. Papatriantafilou"}], "citations": [{"paperId": "18756f3899ef233c8e3b537fd78901c4361ddeb9", "title": "Proposing a framework for evaluating learning strategies in vehicular CPSs"}, {"paperId": "548076f9abbd6b9a53933c23de989bfc4fca8566", "title": "An accurate target tracking method in wireless sensor networks"}]}
