{"paperId": "65ce077cfb89b6d589c2f2909fbb6e45f611475e", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "Accordia: Adaptive Cloud Configuration Optimization for Recurring Data-Intensive Applications", "abstract": "Recognizing the diversity of big data analytic jobs, cloud providers offer a wide range of virtual machine (VM) instances or even clusters to cater for different use cases. The choice of cloud configurations can have a significant impact on the response time and running cost of data-intensive, production batch-jobs, which need to be re-run regularly using cloud-scale resources. However, identifying the best cloud configuration with a low search cost is quite challenging due to i) the large and high-dimensional configuration-parameters space, ii) the time-varying price of some instance types (e.g. spot-price ones), iii) job execution-time variation even given the same configuration, and iv) gradual drifts / unexpected changes of the characteristics of a recurring job. To tackle these challenges, we have designed and implemented Accordia, a system that enables Adaptive Cloud Configuration Optimization for Recurring Data-Intensive Applications. By leveraging recent algorithmic advances in Gaussian Process UCB (Upper Confidence Bound) techniques, the design of Accordia can handle time-varying instance pricing while providing a performance guarantee of sub-linearly increasing regret when comparing with the static, offline optimal solution. Using extensive trace-driven simulations and empirical measurements of our Kubernetes-based implementation, we demonstrate that Accordia can dynamically learn a near-cost-optimal cloud configuration (i.e. within 10% of the optimum) after fewer than 20 runs from over 7000 candidate choices within a 5-dimension search space, which translates to a 2X-speedup and 17.9% cost-savings, when comparing to CherryPick.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-11-20", "journal": {"name": "2020 IEEE 40th International Conference on Distributed Computing Systems (ICDCS)", "pages": "831-841"}, "authors": [{"authorId": "2152797825", "name": "Yang Liu"}, {"authorId": "2264817", "name": "Huanle Xu"}, {"authorId": "2610991", "name": "W. Lau"}], "citations": [{"paperId": "46f9827e81e0d46d68f4a7d16cc62091ed1b2406", "title": "Lifting the Fog of Uncertainties: Dynamic Resource Orchestration for the Containerized Cloud"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "bca68a52f24941269bed015a37b25df1d0954de0", "title": "PERT-GNN: Latency Prediction for Microservice-based Cloud-Native Applications via Graph Neural Networks"}, {"paperId": "8810733c7302be5b21db947d37a21e1a63dbdd9e", "title": "Cloud Configuration Optimization for Recurring Batch-Processing Applications"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "dbbb7b523865ecb00700b4e1fc6f84741c63bb5c", "title": "Online Resource Optimization for Elastic Stream Processing with Regret Guarantee"}, {"paperId": "5b635e1fb8752ce90cc795da4759d4233f18bf61", "title": "Diminishing Returns and Deep Learning for Adaptive CPU Resource Allocation of Containers"}]}
