{"paperId": "65ea8d900224d60b89f4053c0bc1462ed70f7734", "publicationVenue": {"id": "88c529ef-41c7-49b5-96c8-ddfbda90d64a", "name": "Frontiers in Chemical Engineering", "alternate_names": ["Front Chem Eng"], "issn": "2673-2718", "url": "https://www.frontiersin.org/journals/chemical-engineering#"}, "title": "AVUBDI: A Versatile Usable Big Data Infrastructure and Its Monitoring Approaches for Process Industry", "abstract": "The amount of sensors in process industry is continuously increasing as they are getting faster, better and cheaper. Due to the rising amount of available data, the processing of generated data has to be automatized in a computationally efficient manner. Such a solution should also be easily implementable and reproducible independently of the details of the application domain. This paper provides a suitable and versatile usable infrastructure that deals with Big Data in the process industry on various platforms using efficient, fast and modern technologies for data gathering, processing, storing and visualization. Contrary to prior work, we provide an easy-to-use, easily reproducible, adaptable and configurable Big Data management solution with a detailed implementation description that does not require expert or domain-specific knowledge. In addition to the infrastructure implementation, we focus on monitoring both infrastructure inputs and outputs, including incoming data of processes and model predictions and performances, thus allowing for early interventions and actions if problems occur.", "venue": "Frontiers in Chemical Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-06-16", "journal": {"volume": "3"}, "authors": [{"authorId": "1943463511", "name": "Sabrina Luftensteiner"}, {"authorId": "2065985135", "name": "Michael Mayr"}, {"authorId": "1708174", "name": "Georgios C. Chasparis"}, {"authorId": "6732978", "name": "Mario Pichler"}], "citations": [{"paperId": "9b85d3b3307ac97e0ba48f622e80b4b12a0bb84d", "title": "Abstracting Process Mining Event Logs From Process-State Data To Monitor Control-Flow Of Industrial Manufacturing Processes"}]}
