{"paperId": "65eca63de01a9e43fec47ea70f67f312acf61eb0", "publicationVenue": null, "title": "Auto-WLM: Machine Learning Enhanced Workload Management in Amazon Redshift", "abstract": "There has been a lot of excitement around using machine learning to improve the performance and usability of database systems. However, few of these techniques have actually been used in the critical path of customer-facing database services. In this paper, we describe Auto-WLM, a machine learning based automatic workload manager currently used in production in Amazon Redshift. Auto-WLM is an example of how machine learning can improve the performance of large data-warehouses in practice and at scale. Auto-WLM intelligently schedules workloads to maximize throughput and horizontally scales clusters in response to workload spikes. While traditional heuristic-based workload management requires a lot of manual tuning (e.g. of the concurrency level, memory allocated to queries etc.) for each specific workload, Auto-WLM does this tuning automatically and as a result is able to quickly adapt and react to workload changes and demand spikes. At its core, Auto-WLM uses locally-trained query performance models to predict the query execution time and memory needs for each query, and uses this to make intelligent scheduling decisions. Currently, Auto-WLM makes millions of decisions every day, and constantly optimizes the performance for each individual Amazon Redshift cluster. In this paper, we will describe the advantages and challenges of implementing and deploying Auto-WLM, as well as outline areas of research that may be of interest to those in the \"ML for systems'' community with an eye for practicality.", "venue": "SIGMOD Conference Companion", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-06-04", "journal": {"name": "Companion of the 2023 International Conference on Management of Data"}, "authors": [{"authorId": "2059933994", "name": "Gaurav Saxena"}, {"authorId": "2218996965", "name": "Mohammad Rahman"}, {"authorId": "2617298", "name": "Naresh Chainani"}, {"authorId": "49044428", "name": "Chunbin Lin"}, {"authorId": "2310537", "name": "George C. Caragea"}, {"authorId": "144164925", "name": "Fahim Chowdhury"}, {"authorId": "40412858", "name": "Ryan Marcus"}, {"authorId": "1746961", "name": "Tim Kraska"}, {"authorId": "2754078", "name": "Ippokratis Pandis"}, {"authorId": "145541831", "name": "Balakrishnan Narayanaswamy"}], "citations": [{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation"}, {"paperId": "49a5aadfceac5d5ed9e224bc777f4f616de1daae", "title": "Modeling Shifting Workloads for Learned Database Systems"}, {"paperId": "20aa90187af7dd6508fa32ab438ea243fee0f5fa", "title": "PACE: Poisoning Attacks on Learned Cardinality Estimation"}, {"paperId": "551ff631d62b524cae31f44fb9af2ad812db5cfb", "title": "Stage: Query Execution Time Prediction in Amazon Redshift"}, {"paperId": "d13b3c9d4a7bd05133578e566657658dc531e29f", "title": "Adding Domain Knowledge to Query-Driven Learned Databases"}]}
