{"paperId": "65ede20611cb29fa04ad9a40efe505cd273064ba", "publicationVenue": {"id": "2ca1e2ac-8c3b-4251-94ed-24846d391d3b", "name": "Computational and Mathematical Methods in Medicine", "type": "journal", "alternate_names": ["Comput Math Method Med"], "issn": "1748-670X", "url": "https://www.hindawi.com/journals/cmmm/"}, "title": "Diagnosis of Brain Tumor Using Light Weight Deep Learning Model with Fine-Tuning Approach", "abstract": "Brain cancer is a rare and deadly disease with a slim chance of survival. One of the most important tasks for neurologists and radiologists is to detect brain tumors early. Recent claims have been made that computer-aided diagnosis-based systems can diagnose brain tumors by employing magnetic resonance imaging (MRI) as a supporting technology. We propose transfer learning approaches for a deep learning model to detect malignant tumors, such as glioblastoma, using MRI scans in this study. This paper presents a deep learning-based approach for brain tumor identification and classification using the state-of-the-art object detection framework YOLO (You Only Look Once). The YOLOv5 is a novel object detection deep learning technique that requires limited computational architecture than its competing models. The study used the Brats 2021 dataset from the RSNA-MICCAI brain tumor radio genomic classification. The dataset has images annotated from RSNA-MICCAI brain tumor radio genomic competition dataset using the make sense an AI online tool for labeling dataset. The preprocessed data is then divided into testing and training for the model. The YOLOv5 model provides a precision of 88 percent. Finally, our model is tested across the whole dataset, and it is concluded that it is able to detect brain tumors successfully.", "venue": "Computational and Mathematical Methods in Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2022"}, "authors": [{"authorId": "2022263512", "name": "Tejas Shelatkar"}, {"authorId": "81128854", "name": "D. Urvashi"}, {"authorId": "1724022", "name": "Mohammad Shorfuzzaman"}, {"authorId": "46774424", "name": "A. Alsufyani"}, {"authorId": "51017707", "name": "Kuruva Lakshmanna"}], "citations": [{"paperId": "389e4bbe23b03f163491566ba569e30ad1e53164", "title": "Brain tumor classification and detection via hybrid alexnet-gru based on deep learning"}, {"paperId": "6f3e7fe3aff10a0768e556b5af22ba41f71e7d5b", "title": "Enhancing Pedestrian Tracking in Autonomous Vehicles by Using Advanced Deep Learning Techniques"}, {"paperId": "3f597b13442e5c8b7badc773efdabf772d66cb86", "title": "A hybrid deep CNN model for brain tumor image multi-classification"}, {"paperId": "00066d148504ee9bbfe8f787a55cbad0d0920c26", "title": "Detection of Brain Tumor Using YOLOv5 Algorithm"}, {"paperId": "d0933677e31f6e1d0bf00f5ae0deb5dca6dde591", "title": "An attention 3DUNET and visual geometry group-19 based deep neural network for brain tumor segmentation and classification from MRI."}, {"paperId": "6ceafdde4afbb9627f58b2e7a8473d46c5815a51", "title": "Optimizing Hyperparameters of YOLO to Improve Performance of Brain Tumor Detection in MRI Images"}, {"paperId": "2da1f95a5cd935c4f81d6c9e5f4da97c7751f9c9", "title": "Enhancing Global Model Accuracy: Federated Learning for Imbalanced Medical Image Datasets"}, {"paperId": "9865f2dc17d904c8e9ec2d663b904d63851bdf43", "title": "A Novel Framework for Classification of MRI Images to Diagnose Brain Tumors using DenseNet 201"}, {"paperId": "807c5107b23cddc88a8e16466ef417749b33a6ae", "title": "Automated Brain Tumor Detection Using Soft Computing-Based Segmentation Technique"}, {"paperId": "223cf64b376f87c838a9974c661005b93ea338b9", "title": "CT Image Detection of Pulmonary Tuberculosis Based on the Improved Strategy YOLOv5"}, {"paperId": "b0540d72bb18b1f48b1d4ee00c381b251a13dd6b", "title": "Performance analysis of state-of-the-art CNN architectures for brain tumour detection"}, {"paperId": "73f0c807d641282a60177e5237c2b9896431fc10", "title": "An Augmented Modulated Deep Learning Based Intelligent Predictive Model for Brain Tumor Detection Using GAN Ensemble"}, {"paperId": "5f5bd9da728714129a23325cfb0286c3bbf9bc47", "title": "In-Domain Transfer Learning Strategy for Tumor Detection on Brain MRI"}, {"paperId": "ae61a8029f83b4a29f7d2eaff535e3cd0eee20e8", "title": "Brain Tumor Class Detection in Flair/T2 Modality MRI Slices Using Elephant-Herd Algorithm Optimized Features"}, {"paperId": "c8e215cf85b68b8722e46e428521ae80240d4f82", "title": "A schizophrenia study based on multi-frequency dynamic functional connectivity analysis of fMRI"}, {"paperId": "57b621b75126697f8694bde4f7248e2b0927cec7", "title": "Forest Health Consumption Satisfaction Evaluation with IPA and Factor Analysis"}, {"paperId": "7b050d2d2a510454c733d605c84dc38bee169b83", "title": "Association between the Systolic Blood Pressure Trajectory and Risk of Stroke in a Health-Management Population in Jiaozuo, China"}, {"paperId": "1e262ae366558981da226b84da3b602b600ea8e4", "title": "Brain Cancer Segmentation Using YOLOv5 Deep Neural Network"}, {"paperId": "8874334eff9a2b60774f94d924c0b8e21e7a11bc", "title": "Collaborative Caching in Edge Computing via Federated Learning and Deep Reinforcement Learning"}, {"paperId": "51d6e48c2a140b6ad0d37e97a4e4cb9563cc8023", "title": "Effects of Data Augmentation with the BNNSMOTE Algorithm in Seizure Detection Using 1D-MobileNet"}, {"paperId": "291e4f271a32a7074ef2658d3190861dfbd8a897", "title": "Racial differences in prevalence and anatomical distribution of tarsal coalition"}, {"paperId": "95b4e85d203b6e19269b420de3fdb6da5af9953f", "title": "Association between Cardio-Ankle Vascular Index and Masked Uncontrolled Hypertension in Hypertensive Patients: A Cross-Sectional Study"}, {"paperId": "1f89da628e7e156e9230bb2d653e1fda602fb370", "title": "Predicting graft failure in pediatric liver transplantation based on early biomarkers using machine learning models"}, {"paperId": "72e354246f734faf1538c99801c4307b925ecd01", "title": "Performance Analysis of Artificial Intelligence Models Trained with Open-Source Dataset in Clinical Environment"}, {"paperId": "6c0d54fedb73f49256420c695580b554b80abdf7", "title": "Skin lesion classification of dermoscopic images using machine learning and convolutional neural network"}, {"paperId": "0ffb12df9764a5951ced58314fb3381cb3eae2c3", "title": "The Reform of University Education Teaching Based on Cloud Computing and Big Data Background"}, {"paperId": "562fa0fc542863477a8d86985bf4ac02654fb4f8", "title": "Automated Brain Tumor Segmentation and Classification in MRI Using YOLO-Based Deep Learning"}, {"paperId": "8cb70a6f75d0c46fa80cbc67abd5fff78f732658", "title": "LCDEiT: A Linear Complexity Data-Efficient Image Transformer for MRI Brain Tumor Classification"}, {"paperId": "e105d3f8c90e6a0611ffa85fc42ae13fa590fb54", "title": "Brain Tumor Detection using Integrated Learning Process Detection (ILPD)"}, {"paperId": "2da40deb686d691bf5a8b7e3d0dac21fc1cac645", "title": "Brain Tumor Image Prediction from MR Images Using CNN Based Deep Learning Networks"}]}
