{"paperId": "65f6318d25c03787864ee934358bea1d50b0de1c", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A High-Level Representation of the Navigation Behavior of Website Visitors", "abstract": "Knowing how visitors navigate a website can lead to different applications. For example, providing a personalized navigation experience or identifying website failures. In this paper, we present a method for representing the navigation behavior of an entire class of website visitors in a moderately small graph, aiming to ease the task of web analysis, especially in marketing areas. Current solutions are mainly oriented to a detailed page-by-page analysis. Thus, obtaining a high-level abstraction of an entire class of visitors may involve the analysis of large amounts of data and become an overwhelming task. Our approach extracts the navigation behavior that is common among a certain class of visitors to create a graph that summarizes class navigation behavior and enables a contrast of classes. The method works by representing website sessions as the sequence of visited pages. Sub-sequences of visited pages of common occurrence are identified as “rules”. Then, we replace those rules with a symbol that is given a representative name and use it to obtain a shrinked representation of a session. Finally, this shrinked representation is used to create a graph of the navigation behavior of a visitor class (group of visitors relevant to the desired analysis). Our results show that a few rules are enough to capture a visitor class. Since each class is associated with a conversion, a marketing expert can easily find out what makes classes different.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-02", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2174690708", "name": "Alicia Huidobro"}, {"authorId": "2098878394", "name": "R. Monroy"}, {"authorId": "2080169092", "name": "Bárbara Cervantes"}], "citations": [{"paperId": "443cf3c7fd6adb71d4b71375c1fe1829caf4c097", "title": "Customer purchase prediction in electronic markets from clickstream data using the Oracle meta-classifier"}, {"paperId": "056eb4a7f461e8549519c87bd75fd0d91ed1fee7", "title": "Users’ Navigation Strategy and Information Search with Health Insurance Decision Aids Using Social Network Analysis"}]}
