{"paperId": "6622c1b2b143183c4c359ae96ba0444679e5cdc8", "publicationVenue": {"id": "dab2ac9c-ee8c-4f5d-bbc2-60d438654b8c", "name": "Geographic Information Science & Technology Body of Knowledge", "alternate_names": ["Geogr Inf Sci  Technol Body Knowl"], "issn": "2577-2848", "url": "https://gistbok.ucgis.org/"}, "title": "An Introduction to Spatial Data Mining", "abstract": ": The goal of spatial data mining is to discover potentially useful, interesting, and non-trivial patterns from spatial data-sets (e.g., GPS trajectory of smartphones). Spatial data mining is societally important having applications in public health, public safety, climate science, etc. For example, in epidemiology, spatial data mining helps to ﬁnd areas with a high concentration of disease incidents to manage disease outbreaks. Computational methods are needed to discover spatial patterns since the volume and velocity of spatial data exceed the ability of human experts to analyze it. Spatial data has unique characteristics like spatial autocorrelation and spatial heterogeneity which violate the i.i.d (Independent and Identically Distributed) assumption of traditional statistic and data mining methods. Therefore, using traditional methods may miss patterns or may yield spurious patterns, which are costly in societal applications. Further, there are additional challenges such as MAUP (Modiﬁable Areal Unit Problem) as illustrated by a recent court case debating gerrymandering in elections. In this article, we discuss tools and computational methods of spatial data mining, focusing on the primary spatial pattern families: hotspot detection, colocation detection, spatial prediction, and spatial outlier detection. Hotspot detection methods use domain information to accurately model more active and high-density areas. Colocation detection methods ﬁnd objects whose instances are in proximity to each other in a location. Spatial prediction approaches explicitly model the neighborhood relationship of locations to predict target variables from input features. Finally, spatial outlier detection methods ﬁnd data that diﬀer from their neighbors. Lastly, we describe future research and trends in spatial data mining.", "venue": "Geographic Information Science & Technology Body of Knowledge", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-01", "journal": {"name": "Geographic Information Science & Technology Body of Knowledge"}, "authors": [{"authorId": "26366240", "name": "Jamal Golmohammadi"}, {"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "152697699", "name": "Jayant Gupta"}, {"authorId": "1752816781", "name": "Majid Farhadloo"}, {"authorId": "89843190", "name": "Y. Li"}, {"authorId": "15996861", "name": "Jiannan Cai"}, {"authorId": "1468605044", "name": "Samantha Detor"}, {"authorId": "1468634359", "name": "Abigail Roh"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "af1a16c213d7637dcace4b843710cfd2b0896cea", "title": "Spatial Computing Opportunities in Biomedical Decision Support: The Atlas-EHR Vision"}, {"paperId": "8b99b9acad34b3218a6fed8d4cbc1a2a2dad80dc", "title": "Spatially adaptive machine learning models for predicting water quality in Hong Kong"}, {"paperId": "54abbb4083c374520222467cd411c76ec31c0a4d", "title": "Application of Spatial Data Mining to national mines inventories for exploration and land planning of high place-value mineral resources. The case of aggregates in Spain"}, {"paperId": "b4dbecb672bfce1bbe674030000c20d8cf12ac5e", "title": "Discovering Spatio-Temporal Co-Occurrence Patterns of Crimes with Uncertain Occurrence Time"}, {"paperId": "2979be600f9bac29f4b24ebaf3b6004aadaf69b5", "title": "SAMCNet: Towards a Spatially Explainable AI Approach for Classifying MxIF Oncology Data"}, {"paperId": "45a43614b632c6392d4bbc9d6a1f6a81fca42ae4", "title": "SAMCNet for Spatial-configuration-based Classification: A Summary of Results"}, {"paperId": "d23a0c9865d40660ea59397ce43cd9ea52842d29", "title": "Trade Secrets to Promoting Diversity of Patent Practitioners"}, {"paperId": "8ddcbb5084b73097b2d605fdc23a0d38dba4a942", "title": "Knowledge Discovery Web Service for Spatial Data Infrastructures"}, {"paperId": "c9682380cb6ec34f1aafec902bd61a62def2b113", "title": "Weighted Machine Learning for Spatial-Temporal Data"}, {"paperId": "090018c86ff7e14edd240a66d1c2dfbcd50724b1", "title": "Minería de datos espacial en la agricultura en Latinoamérica - Una aproximación conceptual"}, {"paperId": "58b0df021f79fa32d916a1de047db9601eac0dc1", "title": "Data-Driven Decision Making in Precision Agriculture: The Rise of Big Data in Agricultural Systems"}, {"paperId": "2a96a72e25f1a97023059e2ef23487bec8e13b22", "title": "MC-DGCNN: A Novel DNN Architecture for Multi-Category Point Set Classification"}]}
