{"paperId": "663360ba2abf32f081322f571a5718c82ec64e41", "publicationVenue": {"id": "44aabbb9-28ab-46d0-845f-3dd44a78fb59", "name": "Frontiers of Information Technology & Electronic Engineering", "alternate_names": ["Front Inf Technol  Electron Eng"], "issn": "2095-9184", "url": "http://erf.sbb.spk-berlin.de/han/caj/eng.oversea.cnki.net/kns55/oldnavi/n_item.aspx?BaseID=JZUS&Flg=local&NaviID=48&NaviLink="}, "title": "Big data storage technologies: a survey", "abstract": "There is a great thrust in industry toward the development of more feasible and viable tools for storing fast-growing volume, velocity, and diversity of data, termed ‘big data’. The structural shift of the storage mechanism from traditional data management systems to NoSQL technology is due to the intention of fulfilling big data storage requirements. However, the available big data storage technologies are inefficient to provide consistent, scalable, and available solutions for continuously growing heterogeneous data. Storage is the preliminary process of big data analytics for real-world applications such as scientific experiments, healthcare, social networks, and e-business. So far, Amazon, Google, and Apache are some of the industry standards in providing big data storage solutions, yet the literature does not report an in-depth survey of storage technologies available for big data, investigating the performance and magnitude gains of these technologies. The primary objective of this paper is to conduct a comprehensive investigation of state-of-the-art storage technologies available for big data. A well-defined taxonomy of big data storage technologies is presented to assist data analysts and researchers in understanding and selecting a storage mechanism that better fits their needs. To evaluate the performance of different storage architectures, we compare and analyze the existing approaches using Brewer’s CAP theorem. The significance and applications of storage technologies and support to other categories are discussed. Several future research challenges are highlighted with the intention to expedite the deployment of a reliable and scalable storage system.", "venue": "Frontiers of Information Technology & Electronic Engineering", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-10-31", "journal": {"name": "Frontiers of Information Technology & Electronic Engineering", "pages": "1040-1070", "volume": "18"}, "authors": [{"authorId": "1775884", "name": "A. Siddiqa"}, {"authorId": "152348715", "name": "Ahmad Karim"}, {"authorId": "143930319", "name": "A. Gani"}], "citations": [{"paperId": "4d8c099872dfef12ff9623f8e64883773ebb9d25", "title": "Building a government-owned open data platform for connected and autonomous vehicles"}, {"paperId": "e9876b1474f0d79529a2fa592bcce39ee789c1ca", "title": "Big data clustering based on spark chaotic improved particle swarm optimization"}, {"paperId": "f641b9d771427ad995359d9747ec613bafa4afe9", "title": "Leveraging pervasive computing for ambient intelligence: A survey on recent advancements, applications and open challenges"}, {"paperId": "204615e874c9c1358fe6461eb9eb4d2e36e5c595", "title": "Optimizing Multi-Media Database Performance: A Comprehensive Review of Fragmentation Methods and Dynamic Access Patterns"}, {"paperId": "fb1a6a1ff905d520c68353e5e85722283c4bc377", "title": "Data storage query and traceability method of electronic certificate based on cloud computing and blockchain"}, {"paperId": "a041017d2a994cb881c003f44bf9125a017daee8", "title": "Unveiling the Nexus and Promoting Integration of Diverse Factors: Prospects of Big Data-Driven Artificial Intelligence Technology in Achieving Carbon Neutrality in Chongming District"}, {"paperId": "230e4d3449027dc762ebdb608f4877df75854a0f", "title": "Prognostics and Health Management of Rotating Machinery of Industrial Robot with Deep Learning Applications—A Review"}, {"paperId": "e5bc271cf674afaaf7c4cb72bc73eda65b018c08", "title": "Multi-level Encryption for Agricultural Data Protection"}, {"paperId": "0882343e62349b7e8e2f0c574f61c7ea90e3be96", "title": "The determinants of reliable smart grid from experts’ perspective"}, {"paperId": "a208e4a4d0c17dce8eb4b777c81ba0bc56cdd483", "title": "An ontology-based approach to designing a NoSQL database for semi-structured and unstructured health data"}, {"paperId": "56aed4866f0c8e7e0980136ab9c9bd884d210cb7", "title": "Big Data Management and Analytics"}, {"paperId": "6edc76b7a4283af2cba71a753dc6014eca435220", "title": "An Improved Marker Code Scheme Based on Nucleotide Bases for DNA Data Storage"}, {"paperId": "63d0c6c121611f073b2d1adcd0e285bd0d59060e", "title": "Future Database Technologies for Big Data Analytics"}, {"paperId": "38eab914e8aeb23fc7dde4d9f6695480ed1f33b1", "title": "Design of bifunctional phase-change device for storage memories and reconfigurable metasurfaces"}, {"paperId": "84ff86177cfadc68f05ec280a946fba61b6bd4b8", "title": "Data-driven integrated care pathways: Standardization of delivering patient-centered care"}, {"paperId": "895d6ccadeff647ee0bc86b79f01548cd586d5e1", "title": "Data Architectures’ Evolution and Protection"}, {"paperId": "aedd805e7ce7ec115d0adf420af9303c210b39d8", "title": "Big-Data Platform for Performance Monitoring of Telecom-Service-Provider Networks"}, {"paperId": "c24d3360d28d62bf1450cc6c34f9a6e1d110b815", "title": "Smart grid reliability evaluation and assessment"}, {"paperId": "b94cee9efc933cf0f6b0884107b5bb45924ab1e2", "title": "A Novel Framework for Fast Feature Selection Based on Multi-Stage Correlation Measures"}, {"paperId": "3dd155e24cc3d6f71e687edde2104d9c097bc0aa", "title": "The need, opportunities, and challenges for creating a standardized framework for marine restoration monitoring and reporting"}, {"paperId": "b6593b5ad6b0e00232ee88cf2bc578645c1299a0", "title": "Block Storage Optimization and Parallel Data Processing and Analysis of Product Big Data Based on the Hadoop Platform"}, {"paperId": "16298f9b7e4b510f0094720c4c65516922910313", "title": "Past, Present and Future of Computational Storage: A Survey"}, {"paperId": "3d95235093ba4fe8ef67aa2cca6e8b4709e54dff", "title": "Small files' problem in Hadoop: A systematic literature review"}, {"paperId": "d93354c057956924addd5a957ba9ee4a1dde7360", "title": "Oblivious Sketching for Logistic Regression"}, {"paperId": "1b0fa40ee3c37d634a49eeec02f91f5b0e91b773", "title": "DaLiF: a data lifecycle framework for data-driven governments"}, {"paperId": "23d0b4892b17cc4bb309e8450e1d73924d500c7e", "title": "Research on the Architecture and Key Technologies of the Ubiquitous Customer Service Operating System for State Grid"}, {"paperId": "17475b1d1d948bae80f71c8a92ac3af27d423e3f", "title": "Big Data Storage and Decentralization: A Review"}, {"paperId": "d1aaf2ec7635751d875ff61eb229f530258f7e84", "title": "An Enhanced Framework To Secure Big Data Based on Hybrid Machine Learning Technique:ANN-PSO"}, {"paperId": "986a190252c66f23b03aab2c310858a59aad73f1", "title": "Assessment of the Awareness of Nigerian Professionals in the Built Environment on the Big Data analytics (BDA) Applications in the Construction Industry."}, {"paperId": "2d741d4f258a0f2675b8635424d7f07f4e0059bc", "title": "Semantic-based Big Data integration framework using scalable distributed ontology matching strategy"}, {"paperId": "3549b1b1bcedc3d12791b3cab4fce6d7ac9fc255", "title": "SDPSO: Spark Distributed PSO-based approach for feature selection and cancer disease prognosis"}, {"paperId": "e5bd6e2fb8cc9c068a5282da5ffdc565e1398121", "title": "Supply Chain Management and Logistics Big Data Challenges in Bulgaria"}, {"paperId": "d0cabfd6eeb37b93416f51c6273d7e8dd8abe481", "title": "Building Reliable Massive Capacity SSDs through a Flash Aware RAID-Like Protection"}, {"paperId": "05919efb8c3700119c51632a999af78ac8872d1e", "title": "Research on reliability data mining technology of electronic components"}, {"paperId": "9906e795be407342b934611966e9dfe383740039", "title": "Big Data Storage and Analysis for Smart Farming"}, {"paperId": "fe031cdf09d500195e4565630f4e93e76e761343", "title": "A position paper on GDPR compliance in sharded blockchains: rehash of old ideas or new interesting challenges?"}, {"paperId": "de58b87a794ded1ac349b9af4eeef2f83db01c38", "title": "A review of drought monitoring with big data: Issues, methods, challenges and research directions"}, {"paperId": "8353935956aded5e6ba52f43200ac28d9cd65222", "title": "A Comparative Study of Indexing Techniques Effect in Big Data System Storage Optimization"}, {"paperId": "be76e07b9999bca63193e4259ffccf32409f0bbf", "title": "Automatic Assessment of Student Homework and Personalized Recommendation"}, {"paperId": "0d7c728e7c0e8803257865f1f8d540826631d80f", "title": "Development of Web-based Research and Community Service Database at Universitas Negeri Surabaya"}, {"paperId": "25327ceb90d50fe94340bf8413b5b1a91425a052", "title": "Performance Analysis of Financial Institution Operations in a NoSQL Columnar Database"}, {"paperId": "2fd1989b45ed0befb15ce0feeafbf1774d1f11df", "title": "Case Studies in Applied Bayesian Data Science"}, {"paperId": "0c60c3e9eb89cac453c71608e8ed2be3eff9cf2d", "title": "A New Way to Store Simple Text Files"}, {"paperId": "bc216a693f1c6a6a80ef78288740c428f612aa3f", "title": "Design and Implementation of Virtual Private Storage Framework Using Internet of Things Local Networks"}, {"paperId": "7f5b64ef7ca2c43eca45b886ef7d7e74143feef5", "title": "A Survey on Privacy Properties for Data Publishing of Relational Data"}, {"paperId": "aee13487d34e9ab1ffe0dc354436729d3db8e9e8", "title": "K-Means Multi-Verse Optimizer (KMVO) Algorithm to Construct DNA Storage Codes"}, {"paperId": "b3646895d8845e1466ae6f535c27222d4e0624f1", "title": "Requirements for Big Data Adoption for Railway Asset Management"}, {"paperId": "1a6a71d38512f60db520646487fa2046f7867203", "title": "BiGeo: A Foundational PaaS Framework for Efficient Storage, Visualization, Management, Analysis, Service, and Migration of Geospatial Big Data - A Case Study of Sichuan Province, China"}, {"paperId": "9cef6d292ff4e1181fafa3fb3059bca79ef48ed6", "title": "A non-group parallel frequent pattern mining algorithm based on conditional patterns"}, {"paperId": "4078f08179d458a98e41d20552952368d73de157", "title": "Building an Industrial IoT Infrastructure with open Source Software for Smart Energy"}, {"paperId": "e69f9f2935e7a482c7549266693cf9e368af0e7a", "title": "Semi-Structured Data Model for Big Data (SS-DMBD)"}, {"paperId": "f0bbe2ea068e2220dea31f2e24cf60a6ca0bebf4", "title": "A STUDY ON BIG DATA FRAMEWORKS AND MACHINE LEARNING TOOL KITS"}, {"paperId": "89dc818537050339b63fae470621cf5f6ef132f5", "title": "The Impact of Merged Data in Big Data Platform: A Case Study"}, {"paperId": "1c910f15074dc40b637e7a7a5043e3c846d0ded7", "title": "NoSQL verilənlər bazalarında təhlükəsizlik problemləri haqqında"}, {"paperId": "1a5c333296ff1555e0dafc9a576c51b4d213b6df", "title": "Abordagem para integração automática de dados estruturados e não estruturados em um contexto Big Data"}, {"paperId": "f599360ad45e5957f027d55156b07fd41f1286f6", "title": "PREDICAT: A Semantic Service-Oriented Platform for Data Interoperability and Linking in Earth Observation and Disaster Prediction"}, {"paperId": "0c86e8e4d2bde55db4d9a4b9ce25c0dfd9e96142", "title": "Modeling SmallClient indexing framework for big data analytics"}, {"paperId": "0f244db01be2131f08e442dcab0ea7a38d07d41d", "title": "Evaluating Big Data Technologies for Statistical Homicide Dataset"}, {"paperId": "8f8d865ab081c28382f828d6536897b1cffbf0a5", "title": "Evaluation Criteria for Selecting NoSQL Databases in a Single Box Environment"}, {"paperId": "160fec318237da0bc55989df4242f4f103503366", "title": "On Designing a Generic Framework for Big Data-as-a-Service"}, {"paperId": "2993fa7d756aac0175eaf1c2aed5576ee776f543", "title": "Review of social media analytics process and Big Data pipeline"}, {"paperId": "a4fb870edbb387d907308ca97a927e29785eb4d4", "title": "Supporting open science in big data frameworks and data science education"}, {"paperId": "66691df4fbdb3271003462362172cd868b9adeeb", "title": "Big data management in participatory sensing: Issues, trends and future directions"}, {"paperId": "ae27c78d63e56c2b7610bd94fd704fa1b5dcdd29", "title": "Big Data technologies: A survey"}, {"paperId": "5e0e0194b861a9d558ed8724c1f844a369ff4893", "title": "SmallClient for big data: an indexing framework towards fast data retrieval"}, {"paperId": "87ec74d847b6c1170aa12855f916759a7dd2e98f", "title": "A Survey of Privacy Risks and Mitigation Strategies in the Artificial Intelligence Life Cycle"}, {"paperId": "2386ae98357a7d4c52291da6d0c411abf25395ff", "title": "IMPROVING THE EFFICIENCY OF DISTRIBUTED DATA WAREHOUSES"}, {"paperId": "21e989b399b18aeaa93ae066e11f872a93169ef6", "title": "Towards Query Performance"}, {"paperId": "f067ba9e62feece8965e872067fc765b6752ae60", "title": "The Economics of Big Data"}, {"paperId": "35c72db3d823ffa0069aa68c343ff554995c4cd9", "title": "Evaluation and Assessment of Smart Grid Reliability Using Fuzzy Multi-criteria Decision-Making"}, {"paperId": "741a31dd9c873b2b777763a78932254e1747e3a9", "title": "Using Big Data Analytics to Optimize Practical Large Databases Using Big Data Analytics to Optimize Practical Large Databases"}, {"paperId": "28e13789b41f98cdfb6bac36237dacf8e59cb4b8", "title": "Research on a Distributed Processing Model Based on Kafka for Large-Scale Seismic Waveform Data"}, {"paperId": "170954bdc3815c295095a94077f591d90dff48d5", "title": "An Efficient Approach for Storage of Big Data Streams in Distributed Stream Processing Systems"}, {"paperId": "f4fd943f2a07081e89df2b41028590b1d5afeea1", "title": "Big Data Processing Tools Navigation Diagram"}, {"paperId": "48f4ed1f9dc52db699885e404872a3df55660efc", "title": "On practicalities of identifying and implementing a suitable software architecture for a typical deep learning data science project"}, {"paperId": "c375506ff687be53e6f88cd2f334406da0ba909a", "title": "Process Analysis for Communicating Systems Engineering Workgroups"}, {"paperId": "f221fd526978be89348a6c58bbe99bc9bc75b874", "title": "Security and Quality in Cyber-Physical Systems Engineering: With Forewords by Robert M. Lee and Tom Gilb"}, {"paperId": "ff6ca74479a7b34a088f45da75ce7a2fa2bbbebe", "title": "Product/ion-Aware Analysis of Collaborative Systems Engineering Processes"}, {"paperId": "e75fbd63b2ad7def5fd04e28a418682cb53d51c1", "title": "The re-skilling requirements of database administrators in a big data environment"}, {"paperId": "e1848d3ea9a04d4314e09b76ac6f5c6505b91110", "title": "On the analysis of big data indexing execution strategies"}]}
