{"paperId": "6633f3085ef4dcde0e86e72fdc6eee96ad6fe164", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Multiple Instance Learning With Random Forest for Event Logs Analysis and Predictive Maintenance in Ship Electric Propulsion System", "abstract": "In this article, a novel weakly supervised machine learning approach is proposed for intelligent predictive maintenance (IPdM). It employs balanced random forest and multiple instance learning based on event logs from ships’ electric propulsion systems. The objectives are predicting failure likelihood, time to failure, and explainable predictions to ensure timely crew intervention. The IPdM approach uncovers, then learns, and classifies sequences of events that represent early causes or symptoms to forecast imminent failures. In particular, this article contributes effective solutions to irregular, imbalanced, and unlabeled data issues where conventional methods become obsolete. First, the events occur at irregular intervals; they include alarms, warnings, and operational information collected across multiple units and control systems. Second, the datasets exhibit extreme imbalance due to few failures and multiple failure modes; this entails biased predictions. Third, the training datasets are weakly labeled; only the failure timestamp is known without any expert input on prior causes or early symptoms. Temporal random indexing is proposed to transform textual log messages into a numerical lower dimensional space where timeseries analyses are applicable. Balanced random-forest models are developed for unbiased classification and regression. The overall approach learns recursively the ungiven data labels while training the base learners. The IPdM approach is validated through millions of events of multithousand types collected from two years of seagoing vessels. It successfully forecasts actual propulsion failures and performs better when compared with contemporary methods.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "7718-7728", "volume": "18"}, "authors": [{"authorId": "2092779183", "name": "Azzeddine Bakdi"}, {"authorId": "2185627515", "name": "Nicolay Bjørlo Kristensen"}, {"authorId": "1880572", "name": "M. Stakkeland"}], "citations": [{"paperId": "1182bc70d9a5f49a0540e6007fb1ba01507845a8", "title": "Explainable Predictive Maintenance: A Survey of Current Methods, Challenges and Opportunities"}, {"paperId": "aa35eb4f14d1763bc3e718de37c9d94cc8ede38e", "title": "Failure Log Analytics for Reducing Electrical Machine Downtime using Deep Learning"}, {"paperId": "1f1c14345ed7abf9ef165bb010e3332055611749", "title": "Navigating the Sea of Data: A Comprehensive Review on Data Analysis in Maritime IoT Applications"}, {"paperId": "088d1b688b4c045ef3046bb9af742da4549c5899", "title": "A deep multi-instance neural network for dyeing-free inspection of yarn dyeing uniformity"}, {"paperId": "664aa048f92175efb63aa3648d157bb066cbc4ff", "title": "Detecting abnormal behavior of automatic test equipment using autoencoder with event log data"}, {"paperId": "273964ca84b7e2eee66ebade67da99de661cba66", "title": "Integrated machine learning and probabilistic degradation approach for vessel electric motor prognostics"}, {"paperId": "2a7b804528e2fe2def3b1eddedb225bb0c25efc3", "title": "A Multipurpose and Power Quality Improved Electric Vessels Charging Station for the Seaports"}, {"paperId": "9c7652fc34d881bcecb49a90204a198eb879dc8e", "title": "Comparison of Different Machine Learning Algorithms for Predictive Maintenance"}, {"paperId": "53b1d38fada37048fae7ec20f90ca9b16af83dc8", "title": "How to Implement Automotive Fault Diagnosis Using Artificial Intelligence Scheme"}, {"paperId": "a1a0fb9b433b1105b261a4fd0ac5a4cc4e90535c", "title": "Federated Learning-Aided Prognostics in the Shipping 4.0: Principles, Workflow, and Use Cases"}]}
