{"paperId": "6637cc63393f401237a948809d76b9d0074c5a56", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "HIV virologic response, patterns of drug resistance mutations and correlates among adolescents and young adults: A cross-sectional study in Tanzania", "abstract": "Background The emergence of HIV drug resistance mutations (DRMs) is of significant threat to achieving viral suppression (VS) in the quest to achieve global elimination targets. We hereby report virologic outcomes and patterns of acquired DRMs and its associated factors among adolescents and young adults (AYA) from a broader HIV drug resistance surveillance conducted in Tanzania. Methods Data of AYA was extracted from a cross-sectional study conducted in 36 selected facilities using a two-stage cluster sampling design. Dried blood spot (DBS) samples were collected and samples with a viral load (VL) ≥1000 copies/mL underwent genotyping for the HIV-1 pol gene. Stanford HIV database algorithm predicted acquired DRMs, Fisher’s exact test and multivariable logistic regression assessed factors associated with DRMs and VS, respectively. Findings We analyzed data of 578 AYA on antiretroviral therapy (ART) for 9–15 and ≥ 36 months; among them, 91.5% and 88.2% had VS (VL<1000copies/mL) at early and late time points, respectively. Genotyping of 64 participants (11.2%) who had VL ≥1000 copies/ml detected 71.9% of any DRM. Clinically relevant DRMs were K103N, M184V, M41L, T215Y/F, L210W/L, K70R, D67N, L89V/T, G118R, E138K, T66A, T97A and unexpectedly absent K65R. Participants on a protease inhibitor (PI) based regimen were twice as likely to not achieve VS compared to those on integrase strand transfer inhibitors (INSTI). The initial VL done 6 months after ART initiation of ≥1000copies/mL was the primary factor associated with detecting DRMs (p = .019). Conclusions VS amongst AYA is lower than the third UNAIDs target. Additionally, a high prevalence of ADR and high levels of circulating clinically relevant DRMs may compromise the long-term VS in AYA. Furthermore, the first VL result of ≥1000copies/ml after ART initiation is a significant risk factor for developing DRMs. Thus, strict VL monitoring for early identification of treatment failure and genotypic testing during any ART switch is recommended to improve treatment outcomes for AYA.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-23", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "5158779", "name": "J. Rugemalila"}, {"authorId": "1522003712", "name": "Doreen Kamori"}, {"authorId": "2044961337", "name": "Peter P. Kunambi"}, {"authorId": "48221174", "name": "M. Mizinduko"}, {"authorId": "67328329", "name": "Amon Sabasaba"}, {"authorId": "7374721", "name": "Salim S Masoud"}, {"authorId": "2008309311", "name": "Frank Msafiri"}, {"authorId": "4973003", "name": "S. Mugusi"}, {"authorId": "6634503", "name": "R. Mutagonda"}, {"authorId": "5824872", "name": "L. Mlunde"}, {"authorId": "2175243211", "name": "D. Amani"}, {"authorId": "88377939", "name": "E. Mboya"}, {"authorId": "4157888", "name": "Macdonald Mahiti"}, {"authorId": "6626010", "name": "G. Ruhago"}, {"authorId": "120797573", "name": "Jeremiah Mushi"}, {"authorId": "6828347", "name": "V. Sambu"}, {"authorId": "5948846", "name": "G. Mgomella"}, {"authorId": "10756462", "name": "B. Jullu"}, {"authorId": "6532566", "name": "W. Maokola"}, {"authorId": "5185060", "name": "P. Njau"}, {"authorId": "32112476", "name": "B. Mutayoba"}, {"authorId": "150108708", "name": "Godfrey Barabona"}, {"authorId": "2391629", "name": "T. Ueno"}, {"authorId": "4349372", "name": "A. Pembe"}, {"authorId": "3574654", "name": "T. Nagu"}, {"authorId": "152237384", "name": "B. Sunguya"}, {"authorId": "145605031", "name": "S. Aboud"}], "citations": [{"paperId": "165364b300732adf9e5d53ad9690fb08214711d1", "title": "Prevalence and predictors of persistent low-level HIV viraemia: a retrospective cohort study among people receiving dolutegravir-based antiretroviral therapy in Southern Nigeria"}, {"paperId": "3b54254e9db9fcbf0c2837c88a8ea44fa2c6fe25", "title": "Dolutegravir resistance in three pregnant and breastfeeding women in South Africa"}, {"paperId": "46318ce0a7261de76857d33ab78102e20d43cb5e", "title": "High viral suppression and detection of dolutegravir-resistance associated mutations in treatment-experienced Tanzanian adults living with HIV-1 in Dar es Salaam"}, {"paperId": "2aea5a0967d3b184096b973722383cb99159a41c", "title": "Factors Associated With Viral Suppression and Drug Resistance in Children and Adolescents Living With HIV in Care and Treatment Programs in Southern Tanzania"}]}
