{"paperId": "664c93958d30e7071b795e184e84e2522bcae592", "publicationVenue": null, "title": "A Data Streaming Approach to Link Mining in Criminal Networks", "abstract": "The ability to discover patterns of interest in criminal networks can support and ease the investigation tasks by security and law enforcement agencies. By considering criminal networks as a special case of social networks, we can properly reuse most of the state-of-the-art techniques to discover patterns of interests, i.e., hidden and potential links. Nevertheless, in time-sensible scenarios, like the one involving criminal actions, the ability to discover patterns in a (near) real-time manner can be of primary importance.In this paper, we investigate the identification of patterns for link detection and prediction on an evolving criminal network. To extract valuable information as soon as data is generated, we exploit a stream processing approach. To this end, we also propose three new similarity social network metrics, specifically tailored for criminal link detection and prediction. Then, we develop a flexible data stream processing application relying on the Apache Flink framework; this solution allows us to deploy and evaluate the newly proposed metrics as well as the ones existing in literature. The experimental results show that the new metrics we propose can reach up to 83% accuracy in detection and 82% accuracy in prediction, resulting competitive with the state of the art metrics.", "venue": "2017 5th International Conference on Future Internet of Things and Cloud Workshops (FiCloudW)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 5th International Conference on Future Internet of Things and Cloud Workshops (FiCloudW)", "pages": "138-143"}, "authors": [{"authorId": "3415428", "name": "G. Marciani"}, {"authorId": "35268514", "name": "M. Porretta"}, {"authorId": "35126270", "name": "Matteo Nardelli"}, {"authorId": "1688493", "name": "G. Italiano"}], "citations": [{"paperId": "134f85204a10c6cc7118be5cc54d1682d4e79e67", "title": "The views about Big Data among professionals of police forces: A scoping review of empirical studies"}, {"paperId": "759a2945f341d72116bbcf7ca1e838f3a1cdcfb3", "title": "CopAS: A Big Data Forensic Analytics System"}, {"paperId": "5e66644ac21f88c3959ea355ec15fed164f48e30", "title": "Multi-layer data integration technique for combining heterogeneous crime data"}, {"paperId": "97a6bb25aa2479897d8958a84f37d38701dd82b1", "title": "Big Data applied to criminal investigations: expectations of professionals of police cooperation in the European Union"}, {"paperId": "2f6d6472357d249a52bc9d320b9855037514ecf5", "title": "A review of research in illicit supply-chain networks and new directions to thwart them"}, {"paperId": "354528ff70e4a9d52c160fd3214a6f6037fcc32d", "title": "Robust link prediction in criminal networks: A case study of the Sicilian Mafia"}, {"paperId": "bc8c4baab1ed2f8d6a7f4f21e34e993af17d917c", "title": "Central Actor Identification of Crime Group using Semantic Social Network Analysis"}, {"paperId": "33625ccd233ac0a16d55054fe8894c2f4c5b5efd", "title": "Improving Tor Hidden Service Crawler Performance"}]}
