{"paperId": "665ec3698dd0b44d720c1579d96980e3a8ae4bf9", "publicationVenue": null, "title": "Application of Blockchain for Internet of Things: A Bibliometric Analysis", "abstract": "As a disruptive emerging technology, the Internet of things (IoT) has rapidly developed, but its privacy risks and security vulnerabilities are still key challenges. The decentralized and distributed architecture of blockchain has the potential to satisfy IoT privacy and security requirements. This gives birth to the new domain of blockchain for IoT (BIoT). BIoT will cause significant transformations across several industries, paving the way for new business models. Based on the Science Citation Index Expanded (SCIE) and Social Sciences Citation Index (SSCI) databases in Web of Science (WoS) Core Collection, this study aims to explore the research trends and cooperation in the field of BIoT using the bibliometric method. The results indicate that the publications in this field have increased significantly from 2016 to 2020, with China and the USA being the most productive and influential countries. Keyword co-occurrence analysis shows that the most important research topics are as follows: security issues, core technologies, application dimensions, and transaction processes. Text mining analysis indicates that future research directions for BloT will focus more on both computing paradigms and key applications. This study will provide researchers with a greater understanding on the state of the art of BIoT and will serve as a reference for researchers engaging in this field to identify their own future research directions.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-29", "journal": {"name": "Mathematical Problems in Engineering", "pages": "1-16", "volume": "2021"}, "authors": [{"authorId": "2070873860", "name": "Ruijun Duan"}, {"authorId": "2110764447", "name": "Li Guo"}], "citations": [{"paperId": "e4ded2b6258dc2996f9f32384986d3a664b17fd7", "title": "The development of blockchain technology in manufacturing: A bibliometric analysis"}, {"paperId": "259d34a3fda4af633c722a7fab9937cc0b2497aa", "title": "Application of Blockchain Based on Fabric Consensus Network Model in Secure Encryption of Educational Information"}, {"paperId": "3c50c87839b4111988c12556b703ebc1b35133f3", "title": "Federated learning optimization: A computational blockchain process with offloading analysis to enhance security"}, {"paperId": "f35ee468dfb1695fd99e77d3e1a1e234a7d42af9", "title": "Efficiency of metaverse on the improvement of the green procurement policy of semiconductor supply chain – based on behaviour perspective"}, {"paperId": "4cee0a34027822dd841c385db4cdede40f26a311", "title": "Integration of Internet of Things and Blockchain Technologies in Healthcare"}, {"paperId": "46a8335ef25f4c2e6a06bbfbd2c3b2423175803c", "title": "Digital twin simulation for integration of blockchain and internet of things for optimal smart management of PV-based connected microgrids"}, {"paperId": "b7f87d834852a6deafc4e820bae474f550e6081c", "title": "Bibliometric Analysis and Scientific Mapping of IoT"}, {"paperId": "56ec90901e7ee07519e7b8d65fd6e7cfdd05b744", "title": "Investigating the Role of Block Chain to Secure Identity in IoT for Industrial Automation"}, {"paperId": "d3f9c7c686963d9a3457d27c62baa7c55e219646", "title": "Blockchain-based Payment Systems: A Bibliometric & Network Analysis"}, {"paperId": "121943887885224affb713d3ee87cb641a8f1556", "title": "Blockchain Technology Evolution Trends Bibliometrics Analysis on Scopus Database Using VOSviewer"}, {"paperId": "7424150f831700afba2e27b39da77a9aa0e0e572", "title": "Systematic Analysis of Risk Associated with Supply Chain Operations Using Blockchain Technology"}, {"paperId": "23348c499f7213968f68aacd75f074e020edb775", "title": "Effect of Blockchain Technology Investment on the Stock Market Reaction, Firm Value, and Financial Performance"}, {"paperId": "96ad789606a4d0e73aaa41b1b245573637b441ed", "title": "Internet of Things (IoT): From awareness to continued use"}]}
