{"paperId": "6669c9dcc436cd1b32fc53c7741e81c16ebc409f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Sustainable Partnership: Operational Condition Analysis for Brand Value Co-Creation", "abstract": "Enterprises are the origin of social innovation. Enterprises implement sustainable relations through “people-oriented” social value creation, particularly other economic developments in the post-2020 COVID-19 pandemic no longer show linear development but more diversity. On the one hand, enterprises must face the fast social transformation towards AI and superintelligence. On the other hand, enterprises must cope with green sustainable development, emphasizing corporate social responsibility in innovative research and development. An increasing number of enterprises respond to the service-oriented and green sustainability-based consumer market today by expanding and collaborating between the upstream and downstream relations in supply chains. Therefore, enterprises must construct a healthy and sustainable dynamic value chain through value co-creation. The study analyzes the types of the dynamic brand value chain and the operational conditions that provide enterprises with the direction in searching for and establishing a sustainable partnership. We employ literature review, case analysis, and in-depth interviews to determine the types and causes of the dynamic brand value chain, followed by integrating sustainable design to verify the sustainability in the dynamic brand value chain model. The study findings show that growth in quadrants of culture for the tandem brand value chain acts as the primary motivation to strengthen a sustainable relationship. Subsequently, the development in pursuit of brand value creation will intensify the sustainable relationships and activities of the brand, causing sustainable partnerships to be more intense. The primary motivation for the branch brand value chain lies in the growth in quadrants of culture; the more extensive the development system, the more diverse the participating niche brand, and the brand value innovation of pursuit climbs higher.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-06-08", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2049149863", "name": "T. Hsiung"}, {"authorId": "2153512594", "name": "Yu Cheng"}, {"authorId": "2004161186", "name": "Zilu Han"}], "citations": [{"paperId": "98cacfc2001be0c8a3b7f5dba8f60b658a5d2633", "title": "THE ROLE OF VALUE CO-CREATION IN THE APPLICATION OF SERVICE-DOMINANT LOGIC THEORY IN ODOO INNOVATION MARKETING PROGRAMS"}, {"paperId": "0324be148a222db7106465c9347b6fafc4a43ccc", "title": "Creating Sustainable Development of the Destination with Tea Public Version Packaging Design by Obtaining Relational Space Concept"}]}
