{"paperId": "668a63b4bcb8b62d973c80e3e7229e5c284a90ba", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Application of Transformer Models to Landslide Susceptibility Mapping", "abstract": "Landslide susceptibility mapping (LSM) is of great significance for the identification and prevention of geological hazards. LSM is based on convolutional neural networks (CNNs); CNNs use fixed convolutional kernels, focus more on local information and do not retain spatial information. This is a property of the CNN itself, resulting in low accuracy of LSM. Based on the above problems, we use Vision Transformer (ViT) and its derivative model Swin Transformer (Swin) to conduct LSM for the selected study area. Machine learning and a CNN model are used for comparison. Fourier transform amplitude, feature similarity and other indicators were used to compare and analyze the difference in the results. The results show that the Swin model has the best accuracy, F1-score and AUC. The results of LSM are combined with landslide points, faults and other data analysis; the ViT model results are the most consistent with the actual situation, showing the strongest generalization ability. In this paper, we believe that the advantages of ViT and its derived models in global feature extraction ensure that ViT is more accurate than CNN and machine learning in predicting landslide probability in the study area.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2192254357", "name": "Shuai Bao"}, {"authorId": "2189925545", "name": "Jiping Liu"}, {"authorId": "2144690968", "name": "Liang Wang"}, {"authorId": "2202249189", "name": "Xizhi Zhao"}], "citations": [{"paperId": "4795c0f2aa9a142b38ded93c66a280162b6c763b", "title": "Geological Hazard Identification and Susceptibility Assessment Based on MT-InSAR"}, {"paperId": "76bb9c774dd4a3557e8ccdff01d529fe204f6a86", "title": "APO-AN feature selection based Glorot Init Optimal TransCNN landslide detection from multi source satellite imagery"}, {"paperId": "9a9b18a84b64de9209ff0002d6588f1649d3bc70", "title": "Compact Convolutional Transformer for Landslide Susceptibility Mapping"}]}
