{"paperId": "668e4f6f38c75ccfad74ec14af04c87946ccd413", "publicationVenue": null, "title": "An efficient and flexible inference system for serving heterogeneous ensembles of deep neural networks", "abstract": "Ensembles of Deep Neural Networks (DNNs) has achieved qualitative predictions but they are computing and memory intensive. Therefore, the demand is growing to make them answer a heavy workload of requests with available computational resources. Unlike recent initiatives on inference servers and inference frameworks, which focus on the prediction of single DNNs, we propose a new software layer to serve with flexibility and efficiency ensembles of DNNs.Our inference system is designed with several technical innovations. First, we propose a novel procedure to found a good allocation matrix between devices (CPUs or GPUs) and DNN instances. It runs successively a worst-fit to allocate DNNs into the memory devices and a greedy algorithm to optimize allocation settings and speed up the ensemble. Second, we design the inference system based on multiple processes to run asynchronously: batching, prediction, and the combination rule with an efficient internal communication scheme to avoid overhead.Experiments show the flexibility and efficiency under extreme scenarios: It successes to serve an ensemble of 12 heavy DNNs into 4 GPUs and at the opposite, one single DNN multi-threaded into 16 GPUs. It also outperforms the simple baseline consisting of optimizing the batch size of DNNs by a speedup up to 2.7X on the image classification task.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "5225-5232"}, "authors": [{"authorId": "2143314995", "name": "Pierrick Pochelu"}, {"authorId": "1781018", "name": "S. Petiton"}, {"authorId": "29382483", "name": "B. Conche"}], "citations": [{"paperId": "4d0b8b9ef45e05ac22cb7164490e631bfe61d1cb", "title": "Deep Learning Inference Frameworks Benchmark"}]}
