{"paperId": "66948752ed8b131e04639783ab0d18d52b921459", "publicationVenue": {"id": "5e07a437-469d-4072-9d25-ea2d144e1601", "name": "Conference on Innovation in Clouds, Internet and Networks", "type": "conference", "alternate_names": ["ICIN", "Conf Innov Cloud Internet Netw"]}, "title": "Prediction and Dynamic Adjustment of Resources for Latency-Sensitive Virtual Network Functions", "abstract": "In this paper, we propose a scheme to employ predictive multiple regression models for dynamic resource adjustment of latency-sensitive virtual network functions (VNFs). The objective is to optimize resource allocation with agile control so that both latency and resource utilization meet the target performance requirements, despite the fluctuations in the workload. As a use case of latency-sensitive VNF, we select the Internet-of-things directory service (IoT-DS). IoT-DS is capable of storing up to a billion IoT devices records and provide fast database lookup with few milliseconds of latency. Our experimental results with an operational VNF serving as the IoT-DS show that dynamic adjustment of CPU by the proposed scheme reduces CPU resource requirements by 21.9% and avoids lookup latency requirement violations by 58.2 % compared to a threshold rule-based conventional algorithm. Besides, our scheme can provide agile vertical CPU scaling within a one-second window, which is five times faster than a related machine learning-based prior work.", "venue": "Conference on Innovation in Clouds, Internet and Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 23rd Conference on Innovation in Clouds, Internet and Networks and Workshops (ICIN)", "pages": "235-242"}, "authors": [{"authorId": "2273269", "name": "A. H. A. Muktadir"}, {"authorId": "1734625", "name": "Ved P. Kafle"}], "citations": [{"paperId": "cf5f7a9f85e516daa7997dfcec1f2135b7a9bc5c", "title": "Adaptive Retraining of AI/ML Model for Beyond 5G Networks: A Predictive Approach"}, {"paperId": "d78996d6f35802b9c2f2544700977b91a3d39cea", "title": "Intelligent and Agile Control of Edge Resources for Latency-Sensitive IoT Services"}]}
