{"paperId": "669601a3737689dbeb3abd7a454421926b44f82d", "publicationVenue": {"id": "fff3549c-df24-4aef-accb-a33ae442a828", "name": "Journal of Marine Science and Engineering", "type": "journal", "alternate_names": ["J Mar Sci Eng"], "issn": "2077-1312", "url": "https://www.mdpi.com/journal/jmse"}, "title": "Fuzzy Controller Design Approach for a Ship’s Dynamic Path Based on AIS Data with the Takagi–Sugeno Fuzzy Observer Model", "abstract": "A fuzzy controller design approach is developed in this research for the control problem of a ship’s dynamic path based on automatic identification system (AIS) data. Over the past few decades, the equipment of AISs has been widely applied and mandated on ships. Based on the advantages of AIS data, various valuable applications have been proposed to improve safety problems. However, most of the applications depend on the precise control of the ship’s dynamic behavior. Because of this reason, a fuzzy controller design approach is proposed based on the Takagi–Sugeno fuzzy observer model in this research. Firstly, the ship’s dynamic behavior based on the discrete-time AIS data is estimated and represented by the mathematical model of the fuzzy observer. Based on the fuzzy observer model, a fuzzy controller design approach subject to variance constraint is developed to solve the problem of stochastic disturbance in estimation and control. In accordance with the different application aspects, this approach can not only be applied to improve the estimation performance of the fuzzy observer, but it can also be provided as a controller design scheme for the ship’s dynamic path using AISs data. Finally, simulation results of a group of real AIS data from Kaohsiung Port and the assumed Keelung Port AIS data are applied to verify the effectiveness of the designed fuzzy controller.", "venue": "Journal of Marine Science and Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-05", "journal": {"name": "Journal of Marine Science and Engineering"}, "authors": [{"authorId": "121585724", "name": "Chin-Lin Pen"}, {"authorId": "1807742", "name": "Wen‐Jer Chang"}, {"authorId": "35282980", "name": "Yann-Horng Lin"}], "citations": []}
