{"paperId": "66b6025bb99ff09e48d9cb276dedfed0a4f76bc9", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Smart Crop Growth Monitoring Based on System Adaptivity and Edge AI", "abstract": "This work proposes a smart crop growth monitoring system that contains an adaptive cryptography engine to ensure the security of sensor data and an edge artificial intelligence (AI) based estimator to classify the pest and disease severity (PDS) of target crops. Based on the smart system management mechanism, cryptographic functions can be adapted to varying and real-time requirements, while the actuators can be controlled to interact with the physical world to ensure the healthy growth of crops. Experiments show when all the four cryptographic hardware modules, including RTEA32, RTEA64, XTEA32 and XTEA64, are supported, using the adaptive cryptography engine, 72.4% of slice LUTs and 68.4% of slice registers in terms of the Xilinx Zynq-7000 XC7Z020 chip can be saved. Through the smart system management mechanism, a power consumption of 0.009 watts can be reduced. Furthermore, using the binarized neural network (BNN) hardware module of the PDS estimator, the recognition accuracy of target crops i.e. dragon fruits can achieve 76.57%. Compared to the microprocessor-based design and the GPU accelerated one, the same BNN architecture on the FPGA can accelerate the frames per second by a factor of 4,919.29 and a factor of 1.08, respectively.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "64114-64125", "volume": "10"}, "authors": [{"authorId": "34451398", "name": "Chun-Hsian Huang"}, {"authorId": "2152689350", "name": "Bo-Wei Chen"}, {"authorId": "2116847454", "name": "Yi-Jie Lin"}, {"authorId": "2158166804", "name": "Jia-Xuan Zheng"}], "citations": [{"paperId": "8a42590a38979190d17fd4c2f99c2d06115b2480", "title": "Plant Disease Detection: Electronic System Design Empowered with Artificial Intelligence"}, {"paperId": "3887fdb83920b85a45dd5b1cb3f2c4ae0e388e51", "title": "Design and Implementation of an Artificial Intelligence of Things-Based Autonomous Mobile Robot System for Pitaya Harvesting"}, {"paperId": "92d473c2f3e0c07c7b439a2bec3cff84a19b27dd", "title": "FPGA Technologies for Smart and Sustainable Agriculture: A Comprehensive Overview"}, {"paperId": "589358913a3d4d2c06e557cdc6ec83fea595038b", "title": "A Novel Clustering Algorithm for Monitoring Paddy Growth Through Satellite Image Processing."}, {"paperId": "abef601279473c51b851c9d17065b7b405a89588", "title": "Optimized Crop Cultivation Based on Weather Monitoring System"}]}
