{"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey", "abstract": "Landslide is a devastating natural disaster, causing loss of life and property. It is likely to occur more frequently due to increasing urbanization, deforestation, and climate change. Landslide susceptibility mapping is vital to safeguard life and property. This article surveys machine learning (ML) models used for landslide susceptibility mapping to understand the current trend by analyzing published articles based on the ML models, landslide causative factors (LCFs), study location, datasets, evaluation methods, and model performance. Existing literature considered in this comprehensive survey is systematically selected using the ROSES protocol. The trend indicates a growing interest in the field. The choice of LCFs depends on data availability and case study location; China is the most studied location, and area under the receiver operating characteristic curve (AUC) is considered the best evaluation metric. Many ML models have achieved an AUC value > 0.90, indicating high reliability of the susceptibility map generated. This paper also discusses the recently developed hybrid, ensemble, and deep learning (DL) models in landslide susceptibility mapping. Generally, hybrid, ensemble, and DL models outperform conventional ML models. Based on the survey, a few recommendations and future works which may help the new researchers in the field are also presented.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-24", "journal": {"name": "Remote. Sens.", "pages": "3029", "volume": "14"}, "authors": [{"authorId": "2173974239", "name": "Moziihrii Ado"}, {"authorId": "51894482", "name": "Khwairakpam Amitab"}, {"authorId": "48996717", "name": "Arnab Kumar Maji"}, {"authorId": "92431973", "name": "E. Jasińska"}, {"authorId": "27725805", "name": "R. Goňo"}, {"authorId": "49770052", "name": "Zbigniew Leonowicz"}, {"authorId": "151118651", "name": "M. Jasinski"}], "citations": [{"paperId": "bdb1c9eb54a8a6c0143c5971fec3af5ef2255613", "title": "Enhancing co-seismic landslide susceptibility, building exposure, and risk analysis through machine learning"}, {"paperId": "f5ccc2028f2e5fe62b76a88e0e8c88e6db3d431f", "title": "Comparison of tree-based ensemble learning algorithms for landslide susceptibility mapping in Murgul (Artvin), Turkey"}, {"paperId": "05b72758f64a7105faf718df1f63ce346ced4411", "title": "Application of machine learning in the assessment of landslide susceptibility: A case study of mountainous eastern Mediterranean region, Syria"}, {"paperId": "5e83474cb6b3c52319d80f348cc56e828443cac9", "title": "Advancements in mapping landslide susceptibility in bafoussam and its surroundings area using multi-criteria decision analysis, statistical methods, and machine learning models"}, {"paperId": "f1aad4f8ac6a085e16d9ff4e3e77b778714f0b83", "title": "Landslide Susceptibility Mapping Using GIS and Bivariate Statistical Models in Chemoga Watershed, Ethiopia"}, {"paperId": "6c43c6b0e688164e950f90239974fe0f66cc8286", "title": "Landslide susceptibility assessment of South Korea using stacking ensemble machine learning"}, {"paperId": "00c241f7dcadf3ba07c322c7058fac38b5e413d1", "title": "Comparison of different open‐source Digital Elevation Models for landslide susceptibility mapping"}, {"paperId": "28f46c35a3352605212edcf62b19ec08843a39b5", "title": "Fast hybrid methods for modeling landslide susceptibility in Ardal County"}, {"paperId": "7b4df59af2dd2f35947395812d6dd48225778743", "title": "Pixel-based classification method for earthquake-induced landslide mapping using remotely sensed imagery, geospatial data and temporal change information"}, {"paperId": "ac11e4ae57974ac53af326536205dba97fd0b235", "title": "Utilizing Hybrid Machine Learning and Soft Computing Techniques for Landslide Susceptibility Mapping in a Drainage Basin"}, {"paperId": "26caa8b077c363113503e66d9711805f5b7b4759", "title": "A comparative evaluation of landslide susceptibility mapping using machine learning-based methods in Bogor area of Indonesia"}, {"paperId": "c6f13abfbd07fe5fd4140907c592bd617d8a2036", "title": "Research on the influence of different sampling resolution and spatial resolution in sampling strategy on landslide susceptibility mapping results"}, {"paperId": "2a1fae25b530f740f2010ba388424f5201f787d7", "title": "Assessing landscape ecological vulnerability to riverbank erosion in the Middle Brahmaputra floodplains of Assam, India using machine learning algorithms"}, {"paperId": "0dd081a6c65ee481765440958a8a127898f7c87c", "title": "Comparative Study of Deep Neural Networks for Landslide Susceptibility Assessment: A Case Study of Pyeongchang-gun, South Korea"}, {"paperId": "ce0005eb6331e0fb94be94675fba4b8b146a4cd5", "title": "GIS-based landslide susceptibility zoning using a coupled model: a case study in Badong County, China"}, {"paperId": "7bc7510f0b65a48351a44ea48f9495455ad0a3a3", "title": "Cost estimation for the monitoring instrumentation of landslide early warning systems"}, {"paperId": "56792386390f50dd862f14943a6c435f5b91dd0e", "title": "Insights into landslide susceptibility in different karst erosion landforms based on interpretable machine learning"}, {"paperId": "77456016e1f76139ad7d5e6d38ac59ed07099cc7", "title": "Evaluating the influence of road construction on landslide susceptibility in Saudi Arabia’s mountainous terrain: a Bayesian-optimised deep learning approach with attention mechanism and sensitivity analysis"}, {"paperId": "217ac8787c2c98f67a80531d0cd4378e5417b9f7", "title": "GIS-based landslide susceptibility mapping using logistic regression, random forest and decision and regression tree models in Chattogram District, Bangladesh"}, {"paperId": "da3e1ae385ba34df76363bd38e88adc2ba4bf39c", "title": "Landslide Susceptibility Assessment in Western External Rif Chain using Machine Learning Methods"}, {"paperId": "62be63c211ce57aebd515f3444edc0e895ee4b3f", "title": "A quick method of early landslide identification based on dynamic susceptibility analysis using M-SVM method: a case study"}, {"paperId": "916ea009676633f20f177035174f062d56e25a6a", "title": "Exploring class imbalance with under-sampling, over-sampling, and hybrid sampling based on Mahalanobis distance for landslide susceptibility assessment: a case study of the 2018 Iburi earthquake induced landslides in Hokkaido, Japan"}, {"paperId": "a5328c5cfbe30bf56a1f4bb39794d6f3dc4b6b33", "title": "Landslide Hazard Assessment in the Heterogeneous Geomorphological and Environmental Context of the Rif Region, Morocco – A Machine Learning Approach"}, {"paperId": "99683b47fe1511a9dd0332f27be5cb02df0bbb53", "title": "Integrated deep learning with explainable artificial intelligence for enhanced landslide management"}, {"paperId": "ac5b089edde42e176c43a14274078e4490225b8c", "title": "Study on landslide susceptibility mapping with different factor screening methods and random forest models"}, {"paperId": "01a2ef2bdf131dd8edc0820755c324d8fe73277b", "title": "Landslide susceptibility prediction using machine learning and remote sensing: Case study in Thua Thien Hue province, Vietnam"}, {"paperId": "39f63afa187cbb388cd7155c71335466d862898a", "title": "Machine learning for high-resolution landslide susceptibility mapping: case study in Inje County, South Korea"}, {"paperId": "d043666d29d6430a63d3f20385b18ace7549cdea", "title": "Unraveling the evolution of landslide susceptibility: a systematic review of 30-years of strategic themes and trends"}, {"paperId": "e64bc4e81aad8cc2bcae0ecd6eebc2470331ee54", "title": "Exploring a form of pixel-based information value model for flood probability assessment and geo-visualization over an East African basin: a case of Nyabarongo in Rwanda"}, {"paperId": "298a3fde7f36b58e6c83b62e09a812e98e44ccb7", "title": "Integration of rotation forest and multiboost ensemble methods with forest by penalizing attributes for spatial prediction of landslide susceptible areas"}, {"paperId": "1ee343fe2430bb3d99ea6063ca9c5a8a08e875e0", "title": "Landslide susceptibility modeling and mapping at Dien Bien province, Vietnam using Bagging based MLP neural network"}, {"paperId": "08c9bc1bdbbafbf3c412dc0b6dbc6ddf8a85f55c", "title": "Rule-based fuzzy inference system for landslide susceptibility mapping along national highway 7 in Garhwal Himalayas, India"}, {"paperId": "e239b077de88789d96433cb2d882171bd6c3a038", "title": "Landslide Hazard Assessment in Highway Areas of Guangxi Using Remote Sensing Data and a Pre-Trained XGBoost Model"}, {"paperId": "bd56d4bda9d9b36f1a57fe024fae99a237e691cd", "title": "Performance comparison of landslide susceptibility mapping under multiple machine-learning based models considering InSAR deformation: a case study of the upper Jinsha River"}, {"paperId": "f4b43daac6c6a882938cfc3aa628068dfa50d557", "title": "Spatial Prediction of Landslides Using Hybrid Multi-Criteria Decision-Making Methods: A Case Study of the Saqqez-Marivan Mountain Road in Iran"}, {"paperId": "e3554f04ec80ae200051aef857592d925a4d86a2", "title": "Investigating causative factors and selecting optimal machine learning algorithms for landslide susceptibility assessment in Lom Kao area, northern Thailand"}, {"paperId": "2608d9c3906fa384f2b3d4405680bc46764438f4", "title": "BIM-GIS Integrated Utilization in Urban Disaster Management: The Contributions, Challenges, and Future Directions"}, {"paperId": "b868e2bd78400fb38dd67a98cf606446c136c98b", "title": "Uncertainty analysis method of slope safety factor based on quantile-based ensemble learning"}, {"paperId": "0fd292ca8148f20325f7e482b04f34c4d0b233d9", "title": "Geoinformatics-based frequency ratio, analytic hierarchy process and hybrid models for landslide susceptibility zonation in Kurdistan Region, Northern Iraq"}, {"paperId": "cf23f8cfa6b4ceea2bcc821e9d7de326e73cbf48", "title": "A comprehensive review of machine learning‐based methods in landslide susceptibility mapping"}, {"paperId": "e07c61b10aeae32e4ba400d65ef338f9a4bc98e2", "title": "Handling data imbalance in machine learning based landslide susceptibility mapping: a case study of Mandakini River Basin, North-Western Himalayas"}, {"paperId": "2f7c45eba3bec847abae33600027df58a2418b57", "title": "Landslide Susceptibility Evaluation Based on Potential Disaster Identification and Ensemble Learning"}, {"paperId": "675835c6eb7dcff8f985a84142fb0c8f38747680", "title": "Refined landslide susceptibility mapping in township area using ensemble machine learning method under dataset replenishment strategy"}, {"paperId": "3891ccb29277ed7483edf1c9956d3b632028d00b", "title": "A New Approach Based on Balancing Composite Motion Optimization and Deep Neural Networks for Spatial Prediction of Landslides at Tropical Cyclone Areas"}, {"paperId": "210d3750b77b5eb5f51ee20e7f20aa46c4181bce", "title": "Cost estimation for the monitoring instrumentalization of Landslide Early Warning Systems"}]}
