{"paperId": "66c9f4c60c3bea1cb9379cfa1e3fefcbeaae70b5", "publicationVenue": {"id": "fd4675fe-4136-446c-aefd-3658aae698ac", "name": "Journal of Cheminformatics", "type": "journal", "alternate_names": ["J Cheminformatics"], "issn": "1758-2946", "url": "https://jcheminf.biomedcentral.com/", "alternate_urls": ["http://jcheminf.springeropen.com/", "http://www.jcheminf.com/"]}, "title": "Towards reproducible computational drug discovery", "abstract": null, "venue": "Journal of Cheminformatics", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-01-28", "journal": {"name": "Journal of Cheminformatics", "volume": "12"}, "authors": [{"authorId": "13700864", "name": "N. Schaduangrat"}, {"authorId": "3124236", "name": "Samuel Lampa"}, {"authorId": "49346080", "name": "Saw Simeon"}, {"authorId": "38527985", "name": "M. Gleeson"}, {"authorId": "1776762", "name": "O. Spjuth"}, {"authorId": "2795988", "name": "C. Nantasenamat"}], "citations": [{"paperId": "a9d650e092654388022ea42810d66c678ccb8ed8", "title": "OnSIDES (ON-label SIDE effectS resource) Database : Extracting Adverse Drug Events from Drug Labels using Natural Language Processing Models"}, {"paperId": "8ed67519ea10f6e0020dee90376b087e0615dfbb", "title": "Deciphering the mechanisms and interactions of the endocrine disruptor bisphenol A and its analogs with the androgen receptor"}, {"paperId": "774e1bf20dbcf2cce5a736ac99cf3f5b665d3e78", "title": "Physics-Informed Generative Model for Drug-like Molecule Conformers."}, {"paperId": "6e853e664ecb7e52d06d0fbf997828c80a9d8595", "title": "Artificial intelligence in the treatment of cancer: Changing patterns, constraints, and prospects"}, {"paperId": "a9f9312dc62d97be8c3f62049e2ad0e1fad463df", "title": "Federated Learning for Predicting Compound Mechanism of Action Based on Image-data from Cell Painting"}, {"paperId": "38441a49332855ff31eb58a9ca9e8ff1f81c348f", "title": "The Potential Use of Peptides in the Fight against Chagas Disease and Leishmaniasis"}, {"paperId": "3ea97d035d71793d40fdd89814c17c2dd3ec733b", "title": "Machine learning hypothesis-generation for patient stratification and target discovery in rare disease: our experience with Open Science in ALS"}, {"paperId": "e729c3310e046d0f0526cbdd2beca791f322d512", "title": "Screening of phytochemicals from Clerodendrum inerme (L.) Gaertn as potential anti-breast cancer compounds targeting EGFR: an in-silico approach."}, {"paperId": "384ba3912469c22e8d63edea62184e0676a57a1d", "title": "Computer-Aided Drug Design and Drug Discovery: A Prospective Analysis"}, {"paperId": "1fe5cc59baf03357777020060543c6d2bdf0dc21", "title": "Targeting Sirtuin 1 for therapeutic potential: Drug repurposing approach integrating docking and molecular dynamics simulations"}, {"paperId": "e695ef73e017aea24c2052d3eee50285769e0cef", "title": "NMR and Docking Calculations Reveal Novel Atomistic Selectivity of a Synthetic High-Affinity Free Fatty Acid vs. Free Fatty Acids in Sudlow’s Drug Binding Sites in Human Serum Albumin"}, {"paperId": "b4508fd3a288b3ae3f7bbd0f97c8db00d40509aa", "title": "Measuring the Impact of Data Sharing: From Author-Level Metrics to Quantification of Economic and Non-tangible Benefits"}, {"paperId": "70a109b30dc4eb5924132d8010a8052978360bd4", "title": "Virtual Screening and ADMET Prediction to Uncover the Potency of Flavonoids from Genus Erythrina as Antibacterial Agent through Inhibition of Bacterial ATPase DNA Gyrase B"}, {"paperId": "fdb70a7a347d58c41c23ea50a963418ccd5be699", "title": "Computational drug discovery on human immunodeficiency virus with a customized long short‐term memory variational autoencoder deep‐learning architecture"}, {"paperId": "fda524f3c8a733c747aa17d00127c339659accf7", "title": "From intuition to AI: evolution of small molecule representations in drug discovery"}, {"paperId": "6e260ec7d38f38c1f3c3182a0b887012bbe9f75e", "title": "In Silico and In Vitro Analyses to Repurpose Quercetin as a Human Pancreatic α-Amylase Inhibitor"}, {"paperId": "52b8ef3fc7080a7740cc3b27b115d78bba98cbab", "title": "Machine Learning Approaches to Investigate the Structure–Activity Relationship of Angiotensin-Converting Enzyme Inhibitors"}, {"paperId": "a2d490d33cd837d024324157aabab5370ba0dda2", "title": "Current in silico methods for multi-target drug discovery in early anticancer research: the rise of the perturbation-theory machine learning approach."}, {"paperId": "694d768163ce0322a23d460b4b53db95e25751a9", "title": "High-throughput sequencing in plant disease management: a comprehensive review of benefits, challenges, and future perspectives"}, {"paperId": "619af57231e4987cfa80d012ba34b6a9fcf8ecfa", "title": "Anxiolytic-like Effects by trans-Ferulic Acid Possibly Occur through GABAergic Interaction Pathways"}, {"paperId": "3a1472aaaeaf846158eb9da3ac9659c009453b8b", "title": "Integrated virtual screening and MD simulation approaches toward discovering potential inhibitors for targeting BRPF1 bromodomain in hepatocellular carcinoma."}, {"paperId": "85f4e92e877ee9eebc276ca09c2336af3dbe89ec", "title": "Navigating bioactivity space in anti-tubercular drug discovery through the deployment of advanced machine learning models and cheminformatics tools: a molecular modeling based retrospective study"}, {"paperId": "36241153911249a3ec4cf901a61d7a13d93eafc3", "title": "In Silico ADME/Tox Comes of Age: Twenty Years Later."}, {"paperId": "ef0884c2330b03859f86d84ce54108b87e4fbcd8", "title": "Advancing Algorithmic Drug Product Development: Recommendations for Machine Learning Approaches in Drug Formulation."}, {"paperId": "49fdb40c1b1cc797b7aa40443d36d8f523efee27", "title": "Bambu and its applications in the discovery of active molecules against melanoma."}, {"paperId": "4fa6c1cbe5da80f8a6f4a0c18a34552de859a88e", "title": "Sustainable materials acceleration platform reveals stable and efficient wide-bandgap metal halide perovskite alloys"}, {"paperId": "1155df7701abf2d67f4fecde02fb38046b4cd47f", "title": "Phytochemical analysis and antifungal potential of two Launaea mucronata (Forssk.) Muschl and Launaea nudicaulis (L.) Hook.fil. wildly growing in Anbar province, Iraq."}, {"paperId": "550afbb35e5595dbdd0dfad4754c3c7aa1ccd7ae", "title": "6D-QSAR for predicting biological activity of human aldose reductase inhibitors using quasar receptor surface modeling"}, {"paperId": "c750d268ade7815f949a06e6230e2dcc6551dffa", "title": "2D QSAR STUDY OF FUSED 5,6-BICYCLIC HETEROCYCLES AS ANTI ALZHEIMER’S AGENTS USING TOPOLOGICAL PARAMETERS"}, {"paperId": "84bdc97c6e5652c40601cb6a13c9df96142f2362", "title": "Evaluating point-prediction uncertainties in neural networks for protein-ligand binding prediction"}, {"paperId": "04c83898323c1d31e31dbe71af8d90b351818c9e", "title": "Architector for high-throughput cross-periodic table 3D complex building"}, {"paperId": "a7b76fcb897e647923e758b9a433a162d5c802f1", "title": "Guidance for good practice in the application of machine learning in development of toxicological quantitative structure-activity relationships (QSARs)"}, {"paperId": "ba543b479a54000badad707fe01544a7f87f534d", "title": "Updates on drug designing approach through computational strategies: a review"}, {"paperId": "2cdfa5061432ea1c11d0781918c54c2483c4ed52", "title": "In silico study to recognize novel angiotensin-converting-enzyme-I inhibitors by 2D-QSAR and constraint-based molecular simulations."}, {"paperId": "55e5ffb7a9094cf3e104ee6589a8139ce5a7477a", "title": "Antimalarial potential, LC-MS secondary metabolite profiling and computational studies of Zingiber officinale."}, {"paperId": "7f0bef272b6793f970e37235e90991a37e6bb6da", "title": "Targeting the Pseudomonas aeruginosa quorum sensing system to inhibit virulence factors and eradicate biofilm formation using AHL-analogue phytochemicals."}, {"paperId": "35e8915e1a932732f289dfd277777b3b45d070e5", "title": "Carbazole derivatives as promising competitive and allosteric inhibitors of human serotonin transporter: computational pharmacology."}, {"paperId": "33c064ee6d6a87e00f90e8d6ca1f4931ef1b5ed5", "title": "Cheminformatic Analysis and Machine Learning Modeling to Investigate Androgen Receptor Antagonists to Combat Prostate Cancer"}, {"paperId": "1ba98608b9db1f7002d234b40ff4970f387bbd53", "title": "Docking and Molecular Dynamics Simulation Revealed the Potential Inhibitory Activity of Amygdalin in Triple-Negative Breast Cancer Therapeutics Targeting the BRCT Domain of BARD1 Receptor"}, {"paperId": "6d370856980680f57efe6ab59ce294e0a5d4b183", "title": "Exploring the Chemical Space of CYP17A1 Inhibitors Using Cheminformatics and Machine Learning"}, {"paperId": "95bbf67608273b3056509dff0c6bf46e18b88c7e", "title": "Current trends in natural products for the treatment and management of dementia: Computational to clinical studies"}, {"paperId": "7a26e16aadb82cc1b54cf8f250ba8075f58fe1dd", "title": "Interoperability of heterogeneous health information systems: a systematic literature review"}, {"paperId": "7f7b0cfd33cdd4270274c43807b96ec79c432aba", "title": "Advancement in Machine Learning: A Strategic Lookout from Cancer Identification to Treatment"}, {"paperId": "1c2cf32717df9f8f4958d33cbaff115f8d88ad84", "title": "Multi-ligand molecular docking, simulation, free energy calculations and wavelet analysis of the synergistic effects between natural compounds baicalein and cubebin for the inhibition of the main protease of SARS-CoV-2"}, {"paperId": "3e9c320029908ba87aafc85ab66e30796b32d2af", "title": "Traditional Machine and Deep Learning for Predicting Toxicity Endpoints"}, {"paperId": "d08839907c774c2440e0e97e166992b5c1e46505", "title": "Metabolomics and Network Pharmacology in the Exploration of the Multi-Targeted Therapeutic Approach of Traditional Medicinal Plants"}, {"paperId": "d87fba89dd8bf8244b0cba6e3bec181d0f7ab1a5", "title": "Design of amino acid- and carbohydrate-based anticancer drugs to inhibit polymerase η"}, {"paperId": "080c520cf2e522d3507bbd95b424a3e723c41e24", "title": "Identification of compelling inhibitors of human norovirus 3CL protease to combat gastroenteritis: A structure-based virtual screening and molecular dynamics study"}, {"paperId": "5ac3178a01f3551258a60a604aef60f19b72dd39", "title": "Prediction Models for Fraction of Absorption and Membrane Permeability using Mordred Descriptors"}, {"paperId": "86afba1357d32ffd65d7885f26d60b166982c0b8", "title": "Benchmark of 3D conformer generation and molecular property calculation for medium-sized molecules"}, {"paperId": "2d80a741d93e236556d09322df1efe4b3b18ad7b", "title": "New Drug Design Avenues Targeting Alzheimer’s Disease by Pharmacoinformatics-Aided Tools"}, {"paperId": "ed56d9fd439ecdb338625c0d7ce31c422e00cc28", "title": "Benefits of hybrid QM/MM over traditional classical mechanics in pharmaceutical systems."}, {"paperId": "3773e87bfe01cbe627001501ebf35b8d3e657a97", "title": "Multi-Condition QSAR Model for the Virtual Design of Chemicals with Dual Pan-Antiviral and Anti-Cytokine Storm Profiles"}, {"paperId": "eca37bf33e7266efddbc71f2febee32c40feea91", "title": "Efficient core-excited state orbital perspective on calculating x-ray absorption transitions in determinant framework"}, {"paperId": "76b5000d8b156317f90f24c260a339d60adfecce", "title": "Memory augmented recurrent neural networks for de-novo drug design"}, {"paperId": "aaefeee33622aae5588c46e7cd38dcd678b10f5a", "title": "Insight into potent TLR2 inhibitors for the treatment of disease caused by Mycoplasma pneumoniae based on machine learning approaches"}, {"paperId": "875c87c81a31eb00297e44e148af1035ce34e8d1", "title": "Microfluidics-Based Point-of-Care Testing (POCT) Devices in Dealing with Waves of COVID-19 Pandemic: The Emerging Solution"}, {"paperId": "c63ef5a5278919567d472c1cd5d5df1559cbc967", "title": "Development of New Inhibitors of HDAC1-3 Enzymes Aided by In Silico Design Strategies"}, {"paperId": "64f6f11ac97d834dfa093e157d181d3c9d91c564", "title": "A meta-epidemiological assessment of transparency indicators of infectious disease models"}, {"paperId": "4200a84e5a050185c5a587c9fa3e8c0ce15466e8", "title": "Blockage of the Monoamine Oxidase by a Natural Compound to Overcome Parkinson’s Disease via Computational Biology"}, {"paperId": "3915f26433de03a8548956c818fe83d98b445450", "title": "Big data and artificial intelligence (AI) methodologies for computer-aided drug design (CADD)"}, {"paperId": "bfe36c7cc8001c2f6b364ebcfbd77b062bedbf6a", "title": "In silico screening and in vitro validation of phytocompounds as multidrug efflux pump inhibitor against E. coli"}, {"paperId": "0c7bd1da8eccdcf72ba8aa6ec4c98f0607907255", "title": "Translational Informatics for Natural Products as Antidepressant Agents"}, {"paperId": "7e20f62db8ea79b0e720ae1acc91eaad1252fcea", "title": "CleaRIXS: A fast and accurate first-principles method for simulation and analysis of resonant inelastic x-ray scattering"}, {"paperId": "95e87b2b07d5d4ca36f050438f0aad36cbf7bfaa", "title": "Self-Supervised Machine Learning Approach for Identifying Biochemical Influences on Protein-Ligand Binding Affinity"}, {"paperId": "f16bc29616311afeaf1b675c143c86b141389b1d", "title": "An Introduction to Chemometrics and Cheminformatics"}, {"paperId": "900273ef7c510566d670191cc4eebe4c41b6f023", "title": "Novel Molecules derived from 3-O-(6-galloylglucoside) inhibit Main Protease of SARS-CoV 2 In Silico"}, {"paperId": "a139683368c92e9508074451a173e3f1e85942c3", "title": "ABCpred: a webserver for the discovery of acetyl- and butyryl-cholinesterase inhibitors"}, {"paperId": "f50b4fb267cf8e82386ef29506e93cca353965f5", "title": "GenUI: interactive and extensible open source software platform for de novo molecular generation and cheminformatics"}, {"paperId": "c49760e656b4e9c7acfb31a90c73e07a0c48c764", "title": "Theoretical Studies on the Molecular Properties, Toxicity, and Biological Efficacy of 21 New Chemical Entities"}, {"paperId": "b41f453ddb5c237628797367d454e4baa4dba5bf", "title": "Molecular insights on ABL kinase activation using tree-based machine learning models and molecular docking"}, {"paperId": "f091ef2ef08e11ccd803e0aef6307fcb47b7c77d", "title": "Artificial Intelligence in Drug Discovery: Applications and Techniques"}, {"paperId": "87c4578a0b502674e95d98b73eb97e6b647d7a9b", "title": "The machine learning life cycle and the cloud: implications for drug discovery"}, {"paperId": "82dac3b6170d2012014b4104b7da4d8d2ec758fd", "title": "Clinical applications of artificial intelligence and machine learning in cancer diagnosis: looking into the future"}, {"paperId": "1bccd4c92fd623d77ea386373dbb95a1ba1509fa", "title": "Probabilistic Random Forest improves bioactivity predictions close to the classification threshold by taking into account experimental uncertainty"}, {"paperId": "7c98865df01d9d349872390e6ce805c77c7a0a28", "title": "Tackling the reproducibility problem to empower translation of preclinical academic drug discovery: is there an answer?"}, {"paperId": "e6ecc3556fb1c664344be922f565634a62887271", "title": "A workflow language for research e-infrastructures"}, {"paperId": "ddb9ba8651e39d3c2e7a990c4b27049c20aff228", "title": "Machine learning, artificial intelligence, and data science breaking into drug design and neglected diseases"}, {"paperId": "55d19daa010945bc66daade772c5a8f5341161e3", "title": "Chagas Disease: Perspectives on the Past and Present and Challenges in Drug Discovery"}, {"paperId": "87bfa66d04837ed144ff024ba4dba2d8ca3eeede", "title": "iUmami-SCM: A Novel Sequence-Based Predictor for Prediction and Analysis of Umami Peptides Using a Scoring Card Method with Propensity Scores of Dipeptides"}, {"paperId": "bd18f0ff071d7b7849a315e673a02e09d90e0f38", "title": "NMR as a “Gold Standard” Method in Drug Design and Discovery"}, {"paperId": "8d5e9ac1bb31deb3bd1771bfbe82a2090c4b9e29", "title": "Data-Driven Molecular Dynamics: A Multifaceted Challenge"}, {"paperId": "59316c0b15922cea356f0473a4ba973a934eddbe", "title": "Reproducibility in systems biology modelling"}, {"paperId": "890d42d1cae3b34283a186cfc71d4884697cb37e", "title": "Data Science Workflows for the Cloud/Edge Computing Continuum"}, {"paperId": "ec9bdc8b98d946b143faec9533e1f9d15f4f66b6", "title": "Learning Molecular Representations for Medicinal Chemistry."}, {"paperId": "5e404412f4f7ffe758e229e920956b32e23064c3", "title": "iTTCA-Hybrid: Improved and robust identification of tumor T cell antigens by utilizing hybrid feature representation."}, {"paperId": "ad28a45f32fe5eeb0342ee0e7a92a323bee4f487", "title": "iBitter-SCM: Identification and characterization of bitter peptides using a scoring card method with propensity scores of dipeptides."}, {"paperId": "da79b4f05054fae79751a45dc8478cde43662f9e", "title": "Chagas Disease: Drug Development and Parasite Targets"}, {"paperId": "dc174c6374b98d3e5c9dcb4b785611e93af1aada", "title": "Workflows for Bringing Data Science on the Cloud/Edge Computing Continuum"}, {"paperId": "ad7c73ec1e717b0e0c2b2bde99c2e513417d4888", "title": "“Predictive in silico toxicology.” An update on modern approaches and a critical analysis of its strong and weak points"}, {"paperId": "14af7a93ecb93ba62f21a3720892450c523a9f3c", "title": "Integrating Blockchain for Data Sharing and Collaboration Support in Scientific Ecosystem Platform"}]}
