{"paperId": "66d6b08cbf221c66a0d0f48dba69df0b6bc434eb", "publicationVenue": {"id": "1fa695f2-33b8-48e5-b650-df9bcc0397f0", "name": "Workshop on Irregular Applications: Architectures and Algorithms", "type": "conference", "alternate_names": ["Irregul Appl Archit Algorithm", "Irregular Applications: Architectures and Algorithms", "IA3", "Workshop Irregul Appl Archit Algorithm"]}, "title": "iPregel: Strategies to Deal with an Extreme Form of Irregularity in Vertex-Centric Graph Processing", "abstract": "Over the last decade, the vertex-centric programming model has attracted significant attention in the world of graph processing, resulting in the emergence of a number of vertex-centric frameworks. Its simple programming interface, where computation is expressed from a vertex point of view, offers both ease of programming to the user and inherent parallelism for the underlying framework to leverage. However, vertex-centric programs represent an extreme form of irregularity, both inter and intra core. This is because they exhibit a variety of challenges from a workload that may greatly vary across supersteps, through fine-grain synchronisations, to memory accesses that are unpredictable both in terms of quantity and location. In this paper, we explore three optimisations which address these irregular challenges; a hybrid combiner carefully coupling lock-free and lock-based combinations, the partial externalisation of vertex structures to improve locality and the shift to an edge-centric representation of the workload. We also assess the suitability of more traditional optimisations such as dynamic load-balancing and software prefetching. The optimisations were integrated into the iPregel vertex-centric framework, enabling the evaluation of each optimisation in the context of graph processing across three general purpose benchmarks common in the vertex-centric community, each run on four publicly available graphs covering all orders of magnitude from a million to a billion edges. The result of this work is a set of techniques which we believe not only provide a significant performance improvement in vertex-centric graph processing, but are also applicable more generally to irregular applications.", "venue": "Workshop on Irregular Applications: Architectures and Algorithms", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-01", "journal": {"name": "2019 IEEE/ACM 9th Workshop on Irregular Applications: Architectures and Algorithms (IA3)", "pages": "45-50"}, "authors": [{"authorId": "51153010", "name": "L. Capelli"}, {"authorId": "1977840060", "name": "Nick Brown"}, {"authorId": "145745546", "name": "J. M. Bull"}], "citations": [{"paperId": "86cc091e5bf5d19ff5ecacd0f5b28ff1a02e6b4b", "title": "NVRAM as an Enabler to New Horizons in Graph Processing"}, {"paperId": "81bdf67171882e7b51564172a1e3659d4293dc56", "title": "DMGA: A Distributed Shortest Path Algorithm for Multistage Graph"}]}
