{"paperId": "66d6d46368d02215cf192a1c3d5d6b23808c91c4", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "HH-NIDS: Heterogeneous Hardware-Based Network Intrusion Detection Framework for IoT Security", "abstract": "This study proposes a heterogeneous hardware-based framework for network intrusion detection using lightweight artificial neural network models. With the increase in the volume of exchanged data, IoT networks’ security has become a crucial issue. Anomaly-based intrusion detection systems (IDS) using machine learning have recently gained increased popularity due to their generation’s ability to detect unseen attacks. However, the deployment of anomaly-based AI-assisted IDS for IoT devices is computationally expensive. A high-performance and ultra-low power consumption anomaly-based IDS framework is proposed and evaluated in this paper. The framework has achieved the highest accuracy of 98.57% and 99.66% on the UNSW-NB15 and IoT-23 datasets, respectively. The inference engine on the MAX78000EVKIT AI-microcontroller is 11.3 times faster than the Intel Core i7-9750H 2.6 GHz and 21.3 times faster than NVIDIA GeForce GTX 1650 graphics cards, when the power drawn was 18mW. In addition, the pipelined design on the PYNQ-Z2 SoC FPGA board with the Xilinx Zynq xc7z020-1clg400c device is optimised to run at the on-chip frequency (100 MHz), which shows a speedup of 53.5 times compared to the MAX78000EVKIT.", "venue": "Future Internet", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-26", "journal": {"name": "Future Internet", "pages": "9", "volume": "15"}, "authors": [{"authorId": "1409278704", "name": "Duc-Minh Ngo"}, {"authorId": "2177461968", "name": "Dominic Lightbody"}, {"authorId": "153027989", "name": "A. Temko"}, {"authorId": "1405355552", "name": "C. Pham-Quoc"}, {"authorId": "2027096", "name": "N. Tran"}, {"authorId": "2064795637", "name": "Colin C. Murphy"}, {"authorId": "1717632", "name": "E. Popovici"}], "citations": [{"paperId": "39f1d7fa9ce7e2b0cd715e717646525bd4a6ff30", "title": "Attacks on IoT: Side-Channel Power Acquisition Framework for Intrusion Detection"}, {"paperId": "df5ac8bf5c14b549b9e691f979624ffb278deebd", "title": "A flexible and efficient FPGA-based random forest architecture for IoT applications"}, {"paperId": "09078310fcc41b592038f336bc3e91cae1e0fa4a", "title": "Challenges and Solutions for Network Security in the Information Age"}, {"paperId": "a7fe3366478e8bb6a8fcb28e259a530335c56dff", "title": "Detecting Outliers in Non-IID Data: A Systematic Literature Review"}]}
