{"paperId": "66d97a04f041df350b7e134b3f9ec067487231eb", "publicationVenue": {"id": "9facf420-91d3-4689-ae1c-be5eabc44a61", "name": "Journal of Digital Forensics, Security and Law", "type": "journal", "alternate_names": ["The Journal of Digital Forensics, Security and Law", "J Digit Forensics Secur Law"], "issn": "1558-7215", "url": "https://www.jdfsl.org/"}, "title": "Internet of Things Software and Hardware Architectures and Their Impacts on Forensic Investigations: Current Approaches and Challenges", "abstract": "The never-before-seen proliferation of interconnected low-power computing devices, patently dubbed the Internet of Things (IoT), is revolutionizing how people, organizations, and malicious actors interact with one another and the Internet. Many of these devices collect data in diﬀerent forms, be it audio, location data, or user commands. In civil or criminal nature investigations, the data collected can act as evidence for the prosecution or the defense. This data can also be used as a component of cybersecurity eﬀorts. When data is extracted from these devices, investigators are expected to do so using proven methods. Still, unfortunately, given the heterogeneity in the types of devices that need to be examined, few widely agreed-upon standards exist. In this paper, we look at some of the architectures, current frameworks, and methods available to perform forensic analysis of IoT devices to provide a roadmap for investigators and researchers to form the basis of an investigation.", "venue": "Journal of Digital Forensics, Security and Law", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-30", "journal": {"name": "J. Digit. Forensics Secur. Law", "volume": "16"}, "authors": [{"authorId": "2294204024", "name": "Abel Alex Boozer"}, {"authorId": "2080126299", "name": "Aruni John"}, {"authorId": "1716217995", "name": "Tathagata Mukherjee"}], "citations": [{"paperId": "5aa776763c6bf8d4877e1d9df243d47e56647ea7", "title": "Systematic Literature Review of EM-SCA Attacks on Encryption"}, {"paperId": "124a0af8ce260e789ba662ced97996cc0bb237aa", "title": "Cryptographic Techniques for Data Privacy in Digital Forensics"}]}
