{"paperId": "66d911c246194ec94a0828dd065500c3eaf4b54a", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "Exploring restaurant and customer needs, barriers, interests, and food choices induced by the COVID-19 pandemic in Tarragona Province (Catalonia, Spain): A cross-sectional study", "abstract": "Background COVID-19 has harmed restaurants, but customer preferences remain unknown. This study aims to determine the needs, barriers, interests, and food choice changes in restaurants and customers before and during the COVID-19 pandemic in Tarragona Province (Spain). Methods An observational cross-sectional study conducted in spring 2021 collected Mediterranean offerings, food safety, and hygiene information about the pandemic through online surveys and focus group interviews with restaurateurs and customers about the changes in their needs and new barriers. Results Fifty-one restaurateurs (44 survey, 7 focus group) and 138 customers (132 survey, 6 focus group) were included. In relation to the economic, emotional, and uncertainty restaurateurs’ barriers detected, they implemented measures to tackle it: buy less and more often, reduce restaurant staff and reduce the restaurants offer, among others. Some customers reported changes in their restaurant orders, specifically increasing their takeaway orders. The Mediterranean diet offer (AMed criteria) remained without noticeable changes in any of the criteria. After lockdown, compared to before lockdown, restaurateurs increased their takeaway offerings by 34.1% (p < 0.001) and their use of digital menus by 27.3% (p < 0.001) because of customer demand. The use of local products in the menus remained high. The cleaning and disinfection tasks increased by 21.1% (p = 0.022), and the use of hydroalcoholic solutions increased by 13.7% (p = 0.031). Conclusion In restaurants, the first COVID-19 lockdown increased takeaway orders, sanitation, and digital communication. This study provides valuable information for adapting gastronomic offerings during challenging situations.", "venue": "Frontiers in Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-11", "journal": {"name": "Frontiers in Public Health", "volume": "11"}, "authors": [{"authorId": "1564739210", "name": "M. Besora-Moreno"}, {"authorId": "2214050225", "name": "Judit Queral"}, {"authorId": "2214064251", "name": "Silvia Torres"}, {"authorId": "3843359", "name": "E. Llauradó"}, {"authorId": "5044253", "name": "Lucia Tarro"}, {"authorId": "143621159", "name": "R. Solà"}], "citations": []}
