{"paperId": "66ed67d6bb88cc12a1b90fd9fbdcf4de14b51d7d", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "SAHA: A String Adaptive Hash Table for Analytical Databases", "abstract": "Hash tables are the fundamental data structure for analytical database workloads, such as aggregation, joining, set filtering and records deduplication. The performance aspects of hash tables differ drastically with respect to what kind of data are being processed or how many inserts, lookups and deletes are constructed. In this paper, we address some common use cases of hash tables: aggregating and joining over arbitrary string data. We designed a new hash table, SAHA, which is tightly integrated with modern analytical databases and optimized for string data with the following advantages: (1) it inlines short strings and saves hash values for long strings only; (2) it uses special memory loading techniques to do quick dispatching and hashing computations; and (3) it utilizes vectorized processing to batch hashing operations. Our evaluation results reveal that SAHA outperforms state-of-the-art hash tables by one to five times in analytical workloads, including Google’s SwissTable and Facebook’s F14Table. It has been merged into the ClickHouse database and shows promising results in production.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-11", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "7726536", "name": "Tianqi Zheng"}, {"authorId": "2019868832", "name": "Zhibin Zhang"}, {"authorId": "1717004", "name": "Xueqi Cheng"}], "citations": [{"paperId": "11cfc84d251f0b13bec23a160d1ef8e1ea481b99", "title": "A massively parallel spatially resolved stochastic cluster dynamics method for simulations of irradiated materials"}, {"paperId": "11fa69602e876870a5281157a1415368c8033dd2", "title": "Big Data Analytic Toolkit: A general-purpose, modular, and heterogeneous acceleration toolkit for data analytical engines"}, {"paperId": "9e1765acc58fe8e169ec30f078dea193aefe7d64", "title": "Query Execution Performance Analysis of Column-Oriented Database in Dashboard"}, {"paperId": "03d823b51be9bc301236bdb07ca950f8bd5d5e89", "title": "Design of telecom operators IDC resale analysis system based on Spark"}, {"paperId": "ae728adf50ea299e480a6f7c28925baebb0f995d", "title": "Entropy-Learned Hashing: Constant Time Hashing with Controllable Uniformity"}, {"paperId": "05c788d71b69b530c8f9c86d5d75def5320c26e9", "title": "Multiprocessing Implementation for Building a DNA q-gram Index Hash Table"}, {"paperId": "c3627014957788e029a73a276dfba820e4a0864f", "title": "Entropy-Learned Hashing 10x Faster Hashing with Controllable Uniformity"}]}
