{"paperId": "66fc0a1787257c03aeedb17ef0d3ed56dcc0a4ff", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Machine Learning for Smart Environments in B5G Networks: Connectivity and QoS", "abstract": "The number of Internet of Things (IoT) devices to be connected via the Internet is overgrowing. The heterogeneity and complexity of the IoT in terms of dynamism and uncertainty complicate this landscape dramatically and introduce vulnerabilities. Intelligent management of IoT is required to maintain connectivity, improve Quality of Service (QoS), and reduce energy consumption in real time within dynamic environments. Machine Learning (ML) plays a pivotal role in QoS enhancement, connectivity, and provisioning of smart applications. Therefore, this survey focuses on the use of ML for enhancing IoT applications. We also provide an in-depth overview of the variety of IoT applications that can be enhanced using ML, such as smart cities, smart homes, and smart healthcare. For each application, we introduce the advantages of using ML. Finally, we shed light on ML challenges for future IoT research, and we review the current literature based on existing works.", "venue": "Computational Intelligence and Neuroscience", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-09-18", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2021"}, "authors": [{"authorId": "2988183", "name": "S. Alsamhi"}, {"authorId": "31175080", "name": "Faris. A. Almalki"}, {"authorId": "1406481588", "name": "H. Al-Dois"}, {"authorId": "2640628", "name": "S. Othman"}, {"authorId": "1756568", "name": "J. Hassan"}, {"authorId": "2119430859", "name": "Ammar Hawbani"}, {"authorId": "2130010033", "name": "Radyah Sahal"}, {"authorId": "145417744", "name": "Brian A. Lee"}, {"authorId": "40951855", "name": "Hager Saleh"}], "citations": [{"paperId": "7cdaf4928a0c4379dbe79e31b623ae73a1b3405a", "title": "An explainable nature-inspired cyber attack detection system in software-defined IoT applications"}, {"paperId": "fe9ead2706ff243bce55c582bdf5d11b50b722e8", "title": "Improve Quality of Service for the Internet of Things using Blockchain & Machine Learning Algorithms."}, {"paperId": "a9618c0dae0c623d5ff2f966632fbb78a73e102a", "title": "Autoencoders Based Optimized Deep Learning Model for the Detection of Cyber Attack in IoT Environment"}, {"paperId": "2ace2a02a94341c0ef546f3bab28206bd29879c6", "title": "Opportunities and challenges of artificial intelligence and distributed systems to improve the quality of healthcare service."}, {"paperId": "065b2fa1800e55d14e15fa1c549a01406677a7a1", "title": "DREaD: Decision Tree-Aided Random Early Detection - An Intelligent Active Queue Management Technique"}, {"paperId": "efa4d296e8b3fabe00714d24fbcb5eadb9961a43", "title": "Evolution toward intelligent communications: Impact of deep learning applications on the future of 6G technology"}, {"paperId": "700a6dde3435c89ec4b0f4987f10ddf27bfc1e6e", "title": "Implementation and Recognition of Waste Management System with Mobility Solution in Smart Cities using Internet of Things"}, {"paperId": "0e2a2a445f8bcdab759246fce0f6843331960ac1", "title": "FRHO: Fuzzy rule-based hybrid optimization for optimal cluster head selection and enhancing quality of service in wireless sensor network"}, {"paperId": "bed880a75be7de6ff38fd17004d1d5071f6d489c", "title": "Specialized path-based technique to test Internet of Things system functionality under limited network connectivity"}, {"paperId": "8e8137981bffb0cccdd6bdd872fdd2f9c8fcc432", "title": "Developing an Intelligent Cellular Structure Design for a UAV Wireless Communication Topology"}, {"paperId": "5299c33585441aa0672f3786deee47bcb91ce9b5", "title": "5G network slicing with unmanned aerial vehicles: Taxonomy, survey, and future directions"}, {"paperId": "98f88a4d88b5908afa86db52206350aa30c124e6", "title": "Jaccard Index Cat Gradient Boosting Classification for Secured Big Data Communication"}, {"paperId": "d8abf58e01ab9d038d5b8973515fc59f5732d206", "title": "Fault Diagnosis of Subway Mechanical Equipment Based on 5G Intelligent Sensor Network Signal Processing"}, {"paperId": "d66c147ee2f1f003f0e5b3fdba3c260e8a8b43d4", "title": "Computing in the Sky: A Survey on Intelligent Ubiquitous Computing for UAV-Assisted 6G Networks and Industry 4.0/5.0"}, {"paperId": "5bb5b870ae45e88c289e16ae9dba92b296d95eca", "title": "UAV Computing-Assisted Search and Rescue Mission Framework for Disaster and Harsh Environment Mitigation"}, {"paperId": "dd28b77d5e5f522566d5cc434f94fc35795899f0", "title": "Human Activity Recognition Based on Embedded Sensor Data Fusion for the Internet of Healthcare Things"}, {"paperId": "6753a13215c6b0fafb815e5cafe8543379b4255b", "title": "COVID-19 Risk Prediction for Diabetic Patients Using Fuzzy Inference System and Machine Learning Approaches"}, {"paperId": "7bc6779a1632ba9c634c09a00fa222ecfa93b5dc", "title": "Zero-Padding and Spatial Augmentation-Based Gas Sensor Node Optimization Approach in Resource-Constrained 6G-IoT Paradigm"}, {"paperId": "3c85aab3a77c2ead0053ddf083996b7e7316d1f8", "title": "Internet of Drones Simulator: Design, Implementation, and Performance Evaluation"}, {"paperId": "1a280936d7a172a4036b26c81855c92d15f25c92", "title": "Dynamic Task Allocation of Multiple UAVs Based on Improved A-QCDPSO"}, {"paperId": "b5c257d463c4217ab6156c72236430d022abfeac", "title": "Crop Pest Recognition in Real Agricultural Environment Using Convolutional Neural Networks by a Parallel Attention Mechanism"}, {"paperId": "82f2399a589ad4ada0d633d466f21f0b2a2995b9", "title": "Survey on Unmanned Aerial Vehicle for Mars Exploration: Deployment Use Case"}, {"paperId": "82c68f86b3ddf8455d680cb7f8552e27e6d08410", "title": "Predicting Joint Effects on CubeSats to Enhance Internet of Things in GCC Region Using Artificial Neural Network"}, {"paperId": "d5659006f124dd212a1e723cb2f70497af4e00ad", "title": "Multi-Modal Deep Learning for Weeds Detection in Wheat Field Based on RGB-D Images"}, {"paperId": "4c3e1344ec3738ed7296e579744030ce833876fc", "title": "Multi-Drone Edge Intelligence and SAR Smart Wearable Devices for Emergency Communication"}, {"paperId": "9fde690e9ca3c801903635c3de52e62098fc1c09", "title": "Machine Learning-Assisted Adaptive Modulation for Optimized Drone-User Communication in B5G"}, {"paperId": "f873366808f57b3966f7efa2bfc9450fae47d809", "title": "IoT-Equipped and AI-Enabled Next Generation Smart Agriculture: A Critical Review, Current Challenges and Future Trends"}, {"paperId": "adaf0a33a31b5ea506dc77c424fa77c9c2eb925c", "title": "When Smart Cities Get Smarter via Machine Learning: An In-depth Literature Review"}]}
