{"paperId": "6706fdd4be6d72a5c3c2a210e473b5d452f657e3", "publicationVenue": {"id": "93be7524-e38d-4d5a-b7f1-bb2b08b85275", "name": "Data Science Journal", "type": "journal", "alternate_names": ["Data Sci J"], "issn": "1683-1470", "url": "http://www.jds-online.com/", "alternate_urls": ["https://datascience.codata.org/", "http://www.codata.org/dsj/", "http://www.datasciencejournal.org/"]}, "title": "FAIRness Literacy: The Achilles' Heel of Applying FAIR Principles", "abstract": "The SHARC Interest Group of the Research Data Alliance was established to improve research crediting and rewarding mechanisms for scientists who wish to organise their data (and material resources) for community sharing. This requires that data are findable and accessible on the Web, and comply with shared standards making them interoperable and reusable in alignment with the FAIR principles. It takes considerable time, energy, expertise and motivation. It is imperative to facilitate the processes to encourage scientists to share their data. To that aim, supporting FAIR principles compliance processes and increasing the human understanding of FAIRness criteria – i.e., promoting FAIRness literacy – and not only the machine-readability of the criteria, are critical steps in the data sharing process. Appropriate human-understandable criteria must be the first identified in the FAIRness assessment processes and roadmap. This paper reports on the lessons learned from the RDA SHARC Interest Group on identifying the processes required to prepare FAIR implementation in various communities not specifically data skilled, and on the procedures and training that must be deployed and adapted to each practice and level of understanding. These are essential milestones in developing adapted support and credit back mechanisms not yet in place.", "venue": "Data Science Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-11", "journal": {"name": "Data Sci. J.", "pages": "32", "volume": "19"}, "authors": [{"authorId": "1992731582", "name": "R. David"}, {"authorId": "6650558", "name": "L. Mabile"}, {"authorId": "40511052", "name": "A. Specht"}, {"authorId": "6118130", "name": "Sarah Stryeck"}, {"authorId": "48065141", "name": "M. Thomsen"}, {"authorId": "1753770068", "name": "Mohamed Yahia"}, {"authorId": "1800186", "name": "C. Jonquet"}, {"authorId": "3032855", "name": "Laurent Dollé"}, {"authorId": "2055108570", "name": "D. Jacob"}, {"authorId": "2468111", "name": "D. Bailo"}, {"authorId": "143887223", "name": "Elena Bravo"}, {"authorId": "3109629", "name": "S. Gachet"}, {"authorId": "108344405", "name": "Hannah C. Gunderman"}, {"authorId": "1419467026", "name": "Jean-Eudes Hollebecq"}, {"authorId": "1800800", "name": "V. Ioannidis"}, {"authorId": "8674482", "name": "Y. L. Bras"}, {"authorId": "2506236", "name": "Emilie Lerigoleur"}, {"authorId": "1398054322", "name": "A. Cambon-Thomsen"}], "citations": [{"paperId": "1f5c0e6741b1e888e3be78f26d63232106fb093e", "title": "“Be sustainable”: EOSC‐Life recommendations for implementation of FAIR principles in life science data handling"}, {"paperId": "0662eeb0d7cfc9c056c0b25dffd1a7e871e049ca", "title": "Umbrella Data Management Plans to Integrate FAIR Data: Lessons From the ISIDORe and BY-COVID Consortia for Pandemic Preparedness"}, {"paperId": "4b5d9ab9f90e85908f48c7808d3990d5873dbbfe", "title": "Data sharing and re-use in the traumatic stress field: An international survey of trauma researchers"}, {"paperId": "d5b29e9a22c6a06866796c5df46c88ed2c5d6a60", "title": "A dataset for assessing phytolith data for implementation of the FAIR data principles"}, {"paperId": "5f44e1576780c163d02a174a5345ed0f3a89f012", "title": "Perceived benefits of open data are improving but scientists still lack resources, skills, and rewards"}, {"paperId": "3d23fdd63c35c04a1726436e5c9e34c7d7534670", "title": "Measuring the Concept of PID Literacy: User Perceptions and Understanding of PIDs in Support of Open Scholarly Infrastructure"}, {"paperId": "8c29bc4f5e5d6d66a68a417defc4d56fa7a4508d", "title": "Community-driven governance of FAIRness assessment: an open issue, an open discussion"}, {"paperId": "0dab8a0492c3f46a7038f9f5ca307e56b199d6f6", "title": "An iterative and interdisciplinary categorisation process towards FAIRer digital resources for sensitive life-sciences data"}, {"paperId": "426e92c2d10168333f73f1e1dd42ebcba1fa5b13", "title": "Digital data and practice change: the impact of innovative web portals on user knowledge building and decision-making processes"}, {"paperId": "ccddb347f44294797ef6df95bc0aad516b2b0838", "title": "FAIR Equivalency, Regulatory Framework and Adoption Potential of FAIR Guidelines in Health in Kenya"}, {"paperId": "4e2af2c597fca7595093b900c3b825b63896016c", "title": "Curating, Enriching and FAIRifying Datasets from the Brazilian COVID-19 Vaccination"}, {"paperId": "0d824c4c3af6364c6ee7e3f73f5904d0c462442c", "title": "Mitigation Strategies to Improve Reproducibility of Poverty Estimations From Remote Sensing Images Using Deep Learning"}, {"paperId": "fffb297a5398aa5c8a0cd627924cc05c722728f3", "title": "Towards an Interoperable Ecosystem of Research Cohort and Real-world Data Catalogues Enabling Multi-center Studies"}, {"paperId": "b2e430b8a5820651d9719d145b6aa46f4c7cdd53", "title": "The width and depth of literacies for tackling the COVID-19 infodemic"}, {"paperId": "ba084403b30deef5891d52041ac1a5678d56fbd7", "title": "International Principles for the Publication and Dissemination of Scientific Data"}, {"paperId": "8002776c3354dd09c9defd46be756261767d1b0a", "title": "Pilot Study on the Intercalibration of a Categorisation System for FAIRer Digital Objects Related to Sensitive Data in the Life Sciences"}, {"paperId": "58c9e90376f69dbbee004e44a5e05b671c66101c", "title": "Data Management Policies and Practices of Digital Archaeological Repositories"}, {"paperId": "ec55e3196b226a8fa6a04925ec8a90dc962180fa", "title": "Mental health and well‐being of Aboriginal and Torres Strait Islander peoples in Australia during COVID‐19"}, {"paperId": "38819cd0b8559a6557df28892a691ad5ef027ff2", "title": "DBgen: A Python Library for Defining Scalable, Maintainable, Accessible, Reconfigurable, Transparent (SMART) Data Pipelines"}, {"paperId": "559827e8394cd2b99e5e06eee6c637e595616a70", "title": "Kakila database: Towards a FAIR community approved database of cetacean presence in the waters of the Guadeloupe Archipelago, based on citizen science"}, {"paperId": "59d0cd25d93fede720ebe6260724f73870ea8adf", "title": "Human Dimensions: Traditional Ecological Knowledge—Finding a Home in the Ecological Society of America"}, {"paperId": "25341a0b5213b6c67f678fb4a6b1d209f354ed26", "title": "Data dictionary cookbook for research data and software interoperability at global scale"}, {"paperId": "a190305f0662df618fa59dd50acad46c626ccddb", "title": "RDA Sensitive Data Interest Group: Goals and Roadmap"}, {"paperId": "d04a6fab30148df51611a07d3898114d86b9ed9f", "title": "More Than Just DOIs, How to Pragmatically Make 50 Years of Diverse Data Centre Holdings and Services Citable, The Perspective and Aspirations of the British Oceanographic Data Centre"}, {"paperId": "54d6d61768167efe734b18cdbf78320a124621b2", "title": "39 Hints to Facilitate the Use of Semantics for Data on Agriculture and Nutrition"}, {"paperId": "435f254b37eb7425d5b3cceb0bbd257e2c9de727", "title": "Das Repositorium Chemotion: Infrastruktur für nachhaltige Wissenschaft in der Chemie**"}, {"paperId": "2eeb67dd2afec62a399d1dbf59d4ca5be10b326a", "title": "Making experimental data tables in the life sciences more FAIR: a pragmatic approach"}, {"paperId": "820ffda59609bcbee911cd5502b909a04a7a49f9", "title": "Open Science als Beitrag zur Qualität in der Bildungsforschung"}, {"paperId": "fac5b81138ad891d25d929876f0255522c49d4c8", "title": "From FAIR Leading Practices to FAIR Implementation and Back: An Inclusive Approach to FAIR at Leiden University Libraries"}, {"paperId": "a6b1656d4d29bb233730b25c4af040fe5065ef41", "title": "Data management plan scorecard"}, {"paperId": "510d750e93c2781e63e5cc506608b6c436d015c6", "title": "Research Data Management in Universities: A Comparative Study from the Perspectives of Librarians and Management"}, {"paperId": "058983ee5d787b0de89a06384d4093325d606824", "title": "Research data management in Turkey: A survey to build an effective national data repository"}, {"paperId": "c0f796a9a079a26f4efdd2206603c2144cd94233", "title": "The Repository Chemotion: Infrastructure for Sustainable Research in Chemistry**"}, {"paperId": "3ca6c0e6f575ebf27be0c8687190dcbffeb83966", "title": "Engaging Researchers with Data Management"}, {"paperId": "6a723719e7cf61f754f194eb7f8464e28af2eecc", "title": "O'FAIRe makes you an offer: metadata-based automatic FAIRness assessment for ontologies and semantic resources"}, {"paperId": "34f423be73af18bdaf8c611eae7eb3a3008a11f3", "title": "FAIR or FAIRer? An Integrated Quantitative FAIRness Assessment Grid for Semantic Resources and Ontologies"}, {"paperId": "2ff7341aa36ecfa37e98d5c5881985eed4c5819b", "title": "OMERO.mde in a use case for microscopy metadata harmonization: Facilitating FAIR principles in practical application with metadata annotation tools"}, {"paperId": "fa95f6f87d46e31944ba06d1c26b633555d844c5", "title": "Une méthodologie et un outil d'évaluation du niveau de \"FAIRness\" pour les ressources sémantiques : le cas d'AgroPortal"}, {"paperId": "2be5c22000a8ffd9b4bb371f4822ce6354ad751a", "title": "On a Fine Day in Shorncliffe the Sea Came Boiling Upwards Across the Bathers"}]}
