{"paperId": "670b4f3aebb1156f608880e26f710d3dc04fee51", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Specialist or Generalist? Instruction Tuning for Specific NLP Tasks", "abstract": "The potential of large language models (LLMs) to simultaneously perform a wide range of natural language processing (NLP) tasks has been the subject of extensive research. Although instruction tuning has proven to be a data-efficient method for transforming LLMs into such generalist models, their performance still lags behind specialist models trained exclusively for specific tasks. In this paper, we investigate whether incorporating broad-coverage generalist instruction tuning can contribute to building a specialist model. We hypothesize that its efficacy depends on task specificity and skill requirements. Our experiments assess four target tasks with distinct coverage levels, revealing that integrating generalist instruction tuning consistently enhances model performance when the task coverage is broad. The effect is particularly pronounced when the amount of task-specific training data is limited. Further investigation into three target tasks focusing on different capabilities demonstrates that generalist instruction tuning improves understanding and reasoning abilities. However, for tasks requiring factual knowledge, generalist data containing hallucinatory information may negatively affect the model's performance. Overall, our work provides a systematic guide for developing specialist models with general instruction tuning. Our code and other related resources can be found at https://github.com/DavidFanzz/Generalist_or_Specialist.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-23", "journal": {"name": "ArXiv", "volume": "abs/2310.15326"}, "authors": [{"authorId": "2261925600", "name": "Chufan Shi"}, {"authorId": "2261455036", "name": "Yixuan Su"}, {"authorId": "2280986528", "name": "Cheng Yang"}, {"authorId": "3001727", "name": "Yujiu Yang"}, {"authorId": "2258703719", "name": "Deng Cai"}], "citations": [{"paperId": "c00c3fd40e4ab89faa14c0d2d34e0ea5de8e3608", "title": "Exploring the Mystery of Influential Data for Mathematical Reasoning"}, {"paperId": "76b65c248677314865a110424542c220886dbb67", "title": "InsCL: A Data-efficient Continual Learning Paradigm for Fine-tuning Large Language Models with Instructions"}, {"paperId": "6edf144fb397afde80d9acf9472dfaffd22c8072", "title": "Unveiling the Generalization Power of Fine-Tuned Large Language Models"}, {"paperId": "ff7a1352b713e9b7a144b08acc1f7dcad1ed9c89", "title": "Automated API Docs Generator using Generative AI"}, {"paperId": "1c24a0eab7d4eb0b780732b7f3be87085ce12aef", "title": "An Energy-based Model for Word-level AutoCompletion in Computer-aided Translation"}, {"paperId": "6fd2752be2673688eb3efe2a0c1f6b97f3559185", "title": "Hint-enhanced In-Context Learning wakes Large Language Models up for knowledge-intensive tasks"}, {"paperId": "23e5395b4c6249c2873666bff73e203821c14719", "title": "Instruction Tuning with Human Curriculum"}]}
