{"paperId": "671061237b92bd490f7857654d96baf0bf7ab807", "publicationVenue": null, "title": "PGMJoins: Random Join Sampling with Graphical Models", "abstract": "Modern databases face formidable challenges when called to join (several) massive tables. Joins (especially when entailing many-to-many joins) are very time- and resource-consuming, join results can be too big to keep in memory, and performing analytics/learning tasks over them costs dearly in terms of time, resources, and money (in the cloud). Moreover, although random sampling is a promising idea to mitigate the above problems, the current state of the art leaves lots of room for improvements. With this paper we contribute a principled solution, coined PGMJoins. PGMJoins adapts Probabilistic Graphical Models to deriving provably random samples of the join result for (n-way) key joins, many-to-many joins, and cyclic and acyclic joins. PGMJoins contributes optimizations both for deriving the structure of the graph and for PGM inference. It also contributes a novel Sum-Product Message Passing Algorithm (SP-MPA) to make a uniform sample of the joint distribution (join result) efficiently and a novel way to deal with cyclic joins. Despite the use of PGMs, the learned joint distribution is not approximated, and the uniform samples are drawn from the true distribution. Our experimentation using queries and datasets from TPC-H, JOB, TPC-DS, and Twitter shows PGMJoins to outperform the state of the art (by 2X-28X).", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2034659", "name": "A. Shanghooshabad"}, {"authorId": "151499040", "name": "M. Kurmanji"}, {"authorId": "2087919519", "name": "Qingzhi Ma"}, {"authorId": "2451992", "name": "Michael Shekelyan"}, {"authorId": "3081947", "name": "Mehrdad Almasi"}, {"authorId": "1732298", "name": "P. Triantafillou"}], "citations": [{"paperId": "8bf719cc5c903c4dd49613387552a1ccd1385482", "title": "Multi-Agent Join"}, {"paperId": "cb05ef87cf3c8616626e3648f6a4146199acf57f", "title": "Machine Unlearning in Learned Databases: An Experimental Analysis"}, {"paperId": "b06e2791108cd160b9d0a244e086c9dff1ad97ce", "title": "Plexus: Optimizing Join Approximation for Geo-Distributed Data Analytics"}, {"paperId": "4e9ef60fdd0c08b017e34bcefb683c90c65eacb8", "title": "Approximate Queries over Concurrent Updates"}, {"paperId": "751ddace56889adfda1153a0fda7781619e32d70", "title": "JoinBoost: Grow Trees Over Normalized Data Using Only SQL"}, {"paperId": "da8a189d2beb20185b099480a8cea4ea30513376", "title": "On Join Sampling and the Hardness of Combinatorial Output-Sensitive Join Algorithms"}, {"paperId": "bea3b9e3020fb9cf37d94e21736304e2fb61f3ae", "title": "Aggregation Consistency Errors in Semantic Layers and How to Avoid Them"}, {"paperId": "8dcd6fb14077a738592bb3a19ba54e5b1f04f47c", "title": "Compiling Discrete Probabilistic Programs for Vectorized Exact Inference"}, {"paperId": "e12a970a0069ae11b99616694cfb715a01c29f6e", "title": "Detect, Distill and Update: Learned DB Systems Facing Out of Distribution Data"}, {"paperId": "50bca53ff65a92e0776ed7f04ff692f87afaed85", "title": "Graphical Join: A New Physical Join Algorithm for RDBMSs"}, {"paperId": "6c47bfbab4d5ac95bcf3158e16e9471f92b7fb05", "title": "Model Joins: Enabling Analytics Over Joins of Absent Big Tables"}, {"paperId": "a6f9d5ca6b5eb637d93e69af9d924f6491e94267", "title": "Learned Cardinality Estimation: An In-depth Study"}, {"paperId": "c6002247dee39ff91db2b646d8f2dd375cbb0a43", "title": "Towards WAN-aware join sampling over geo-distributed data"}, {"paperId": "b53e1cf4c0837ee6f7dc3864e47be2d1c95d6a34", "title": "Weighted Random Sampling over Joins"}, {"paperId": "c24132d2eb4f4599b4abd363fe55d284d86bd65d", "title": "Streaming Weighted Sampling over Join Queries"}, {"paperId": "b9a05c3b417113bf76e7e6498bd94bd2f2d72408", "title": "Dual-Agent Progressive Join"}]}
