{"paperId": "67134a23fff318d9a592bbd383bdaabc74a6ecd6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "XATU: A Fine-grained Instruction-based Benchmark for Explainable Text Updates", "abstract": "Text editing is a crucial task of modifying text to better align with user intents. However, existing text editing benchmark datasets contain only coarse-grained instructions and lack explainability, thus resulting in outputs that deviate from the intended changes outlined in the gold reference. To comprehensively investigate the text editing capabilities of large language models (LLMs), this paper introduces XATU, the first benchmark specifically designed for fine-grained instruction-based explainable text editing. XATU considers finer-grained text editing tasks of varying difficulty (simplification, grammar check, fact-check, etc.), incorporating lexical, syntactic, semantic, and knowledge-intensive edit aspects. To enhance interpretability, we combine LLM-based annotation and human annotation, resulting in a benchmark that includes fine-grained instructions and gold-standard edit explanations. By evaluating existing LLMs against our benchmark, we demonstrate the effectiveness of instruction tuning and the impact of underlying architecture across various editing tasks. Furthermore, extensive experimentation reveals the significant role of explanations in fine-tuning language models for text editing tasks. The benchmark will be open-sourced to support reproduction and facilitate future research at~\\url{https://github.com/megagonlabs/xatu}.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-20", "journal": {"name": "ArXiv", "volume": "abs/2309.11063"}, "authors": [{"authorId": "2243323625", "name": "Haopeng Zhang"}, {"authorId": "7782351", "name": "Hayate Iso"}, {"authorId": "2121386026", "name": "Sairam Gurajada"}, {"authorId": "29995869", "name": "Nikita Bhutani"}], "citations": [{"paperId": "87d24f44d4e881e51e8b1c8f3f0f7ba53fc53aef", "title": "KIWI: A Dataset of Knowledge-Intensive Writing Instructions for Answering Research Questions"}, {"paperId": "0c004aae99072461bb42ee0584dadded6bec7def", "title": "AmbigNLG: Addressing Task Ambiguity in Instruction for NLG"}, {"paperId": "3b46d33781a1eae084d9b1823e9d6502092d5598", "title": "Retrieval Helps or Hurts? A Deeper Dive into the Efficacy of Retrieval Augmentation to Language Models"}, {"paperId": "de17a66e6fb2bd2725c71ae1640f4a0c8faaea73", "title": "SummIt: Iterative Text Summarization via ChatGPT"}]}
