{"paperId": "671eaf84faa6313069fb740fd1f0ba005cafa98c", "publicationVenue": {"id": "661ae2a4-ae88-4ce1-a7a3-73bb04510f92", "name": "International Conference on Smart Communications and Networking", "type": "conference", "alternate_names": ["SmartNets", "Int Conf Smart Commun Netw"]}, "title": "Inferencing Big Data with Artificial Intelligence & Machine Learning Models in Metaverse", "abstract": "This quantitaive study provides different methods of visualization for processing Big Data sets in augmented and virtual reality. The goal is to provide the detailed implementation of the statistical methods and modeling techniques i.e. using machine learning algorithms and artificial intelligence. The Statistical analysis is performed on the Big Data sets in Metaverse, that points towards real time inferencing infrastructure and techniques. Also, This paper elaborates the importance of pervasive and Ubiquitous Computing Architecture and Applications that enable High-end computing on Big Data sets. In this paper, we evaluate the need for a combination of cognitive mechanism and high-end infrastructure to address the performance, latency, and security issues when working on Big Data sets in environments like virtual or Augmented reality. Despite the modernization and advancement in technology there are increasing number of breaches in cloud and hybrid infrastructures, this justifies the need to meet the requirements of strengthening security, safeguard mechanisms and privacy. This paper discusses methods beyond basic visualizations through a deep dive exploration on improvising the applications of existing analytical methods, and use of advanced exploratory tools and visualization techniques on the next generation platforms.", "venue": "International Conference on Smart Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-29", "journal": {"name": "2022 International Conference on Smart Applications, Communications and Networking (SmartNets)", "pages": "01-06"}, "authors": [{"authorId": "1875180", "name": "Gautam Siwach"}, {"authorId": "2199261200", "name": "Adinarayana Haridas"}, {"authorId": "2199266005", "name": "Don Bunch"}], "citations": [{"paperId": "e3669272c1b45c78853e27b184b67ad2466113d0", "title": "Teaching chemistry in the metaverse: the effectiveness of using virtual and augmented reality for visualization"}, {"paperId": "6f7080729feae87d20c2520f2db362dd8b8dc2d8", "title": "Navigating the Metaverse of Big Data: A Bibliometric Journey"}, {"paperId": "764918f843f36e7d8d1d2691db6d4d38c2822a98", "title": "Recommendation Systems for the Metaverse"}]}
