{"paperId": "6721dc20caee8a62bb76ac19d78633987865f351", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "netANOVA: novel graph clustering technique with significance assessment via hierarchical ANOVA", "abstract": "Many problems in life sciences can be brought back to a comparison of graphs. Even though a multitude of such techniques exist, often, these assume prior knowledge about the partitioning or the number of clusters and fail to provide statistical significance of observed between-network heterogeneity. Addressing these issues, we developed an unsupervised workflow to identify groups of graphs from reliable network-based statistics. In particular, we first compute the similarity between networks via appropriate distance measures between graphs and use them in an unsupervised hierarchical algorithm to identify classes of similar networks. Then, to determine the optimal number of clusters, we recursively test for distances between two groups of networks. The test itself finds its inspiration in distance-wise ANOVA algorithms. Finally, we assess significance via the permutation of between-object distance matrices. Notably, the approach, which we will call netANOVA, is flexible since users can choose multiple options to adapt to specific contexts and network types. We demonstrate the benefits and pitfalls of our approach via extensive simulations and an application to two real-life datasets. NetANOVA achieved high performance in many simulation scenarios while controlling type I error. On non-synthetic data, comparison against state-of-the-art methods showed that netANOVA is often among the top performers. There are many application fields, including precision medicine, for which identifying disease subtypes via individual-level biological networks improves prevention programs, diagnosis, and disease monitoring.", "venue": "bioRxiv", "year": 2022, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Briefings in Bioinformatics", "volume": "24"}, "authors": [{"authorId": "1725443592", "name": "Diane Duroux"}, {"authorId": "3349112", "name": "K. Steen"}], "citations": [{"paperId": "2a19b7064d5a46e28358d98a9937f6b406fd1f94", "title": "Graph-based multi-modality integration for prediction of cancer subtype and severity"}, {"paperId": "0f42cd1be6a091b998515c9b1b3717b5d0a54725", "title": "Edge and modular significance assessment in individual-specific networks"}, {"paperId": "be08b8d09e35fa96939b45d84f8e1181533c7830", "title": "netMUG: a novel network-guided multi-view clustering workflow for dissecting genetic and facial heterogeneity"}]}
