{"paperId": "67239d6e9c2c5f8a6d19cb35154e5aa7eaa00f51", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models on Graphs: A Comprehensive Survey", "abstract": "Large language models (LLMs), such as GPT4 and LLaMA, are creating significant advancements in natural language processing, due to their strong text encoding/decoding ability and newly found emergent capability (e.g., reasoning). While LLMs are mainly designed to process pure texts, there are many real-world scenarios where text data is associated with rich structure information in the form of graphs (e.g., academic networks, and e-commerce networks) or scenarios where graph data is paired with rich textual information (e.g., molecules with descriptions). Besides, although LLMs have shown their pure text-based reasoning ability, it is underexplored whether such ability can be generalized to graphs (i.e., graph-based reasoning). In this paper, we provide a systematic review of scenarios and techniques related to large language models on graphs. We first summarize potential scenarios of adopting LLMs on graphs into three categories, namely pure graphs, text-attributed graphs, and text-paired graphs. We then discuss detailed techniques for utilizing LLMs on graphs, including LLM as Predictor, LLM as Encoder, and LLM as Aligner, and compare the advantages and disadvantages of different schools of models. Furthermore, we discuss the real-world applications of such methods and summarize open-source codes and benchmark datasets. Finally, we conclude with potential future research directions in this fast-growing field. The related source can be found at https://github.com/PeterGriffinJin/Awesome-Language-Model-on-Graphs.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-05", "journal": {"name": "ArXiv", "volume": "abs/2312.02783"}, "authors": [{"authorId": "2057050247", "name": "Bowen Jin"}, {"authorId": "2146562364", "name": "Gang Liu"}, {"authorId": "2118642562", "name": "Chi Han"}, {"authorId": "2237095609", "name": "Meng Jiang"}, {"authorId": "2271097936", "name": "Heng Ji"}, {"authorId": "2259869648", "name": "Jiawei Han"}], "citations": [{"paperId": "35bd9b15c8b2834ea381b8be879638bb1955db23", "title": "A Survey on Self-Supervised Pre-Training of Graph Foundation Models: A Knowledge-Based Perspective"}, {"paperId": "75f9069520ae1449bb8d725f256c8e4d08dc1fb5", "title": "RAM-EHR: Retrieval Augmentation Meets Clinical Predictions on Electronic Health Records"}, {"paperId": "167a046cb3223ad6e48e124799a0c459d66c3dba", "title": "Framing VRRSability Relationships among Vulnerability, Risk, Resilience, and Sustainability for Improving Geo-Information Evaluations within Geodesign Decision Support"}, {"paperId": "efa27ad1f502c66afb0cad0fe4ec5339f192de67", "title": "Microstructures and Accuracy of Graph Recall by Large Language Models"}, {"paperId": "e785b33b3367015db69657f37f98402f27a198df", "title": "Towards Versatile Graph Learning Approach: from the Perspective of Large Language Models"}, {"paperId": "d299a6b26e9ee23d0337a1d1a896fc1c847f5a46", "title": "InstructGraph: Boosting Large Language Models via Graph-centric Instruction Tuning and Preference Alignment"}, {"paperId": "a41d4a3b005c8ec4f821e6ee96672d930ca9596c", "title": "G-Retriever: Retrieval-Augmented Generation for Textual Graph Understanding and Question Answering"}, {"paperId": "73d8b0794b863f16ba63c4e2291a7c914824c0ec", "title": "Graph Descriptive Order Improves Reasoning with Large Language Model"}, {"paperId": "de02ba19fb957ae30de7f09904ae3d983c3b50e7", "title": "GLaM: Fine-Tuning Large Language Models for Domain Knowledge Graph Alignment via Neighborhood Partitioning and Generative Subgraph Encoding"}, {"paperId": "8cface791b3f369c9da3109c57040295b4c4e7eb", "title": "Generative artificial intelligence in drug discovery: basic framework, recent advances, challenges, and opportunities"}, {"paperId": "52f3338b8969517629097e745f66cb9eac5f99c5", "title": "Advancing Graph Representation Learning with Large Language Models: A Comprehensive Survey of Techniques"}, {"paperId": "286031d281da2bbecd4621c45db0aa94b228e62f", "title": "Graph Foundation Models"}, {"paperId": "614639931a1598e8a0eca39b595a792ff42a0059", "title": "What Does the Bot Say? Opportunities and Risks of Large Language Models in Social Media Bot Detection"}, {"paperId": "629f44f5fb78ec390ef66633dc627f1d04f3eb85", "title": "Knowledge Graph Prompting for Multi-Document Question Answering"}]}
