{"paperId": "672768107f86319411a48a276f4cddd90cbde948", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "An Overview of Data Integration in Neuroscience With Focus on Alzheimer's Disease", "abstract": "This article represents the first attempt to provide an overview of how to face data integration as the result of a dialogue between neuroscientists and computer scientists. Indeed, data integration is fundamental for studying complex multifactorial diseases, such as the neurodegenerative diseases. This work aims at warning the readers of common pitfalls and critical issues in both medical and data science fields. In this context, we define a road map for data scientists when they first approach the issue of data integration in the biomedical domain, highlighting the challenges that inevitably emerge when dealing with heterogeneous, large-scale and noisy data and proposing possible solutions. Here, we discuss data collection and statistical analysis usually seen as parallel and independent processes, as cross-disciplinary activities. Finally, we provide an exemplary application of data integration to address Alzheimer's Disease (AD), which is the most common multifactorial form of dementia worldwide. We critically discuss the largest and most widely used datasets in AD, and demonstrate how the emergence of machine learning and deep learning methods has had a significant impact on disease's knowledge particularly in the perspective of an early AD diagnosis.", "venue": "IEEE journal of biomedical and health informatics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-20", "journal": {"name": "IEEE Journal of Biomedical and Health Informatics", "pages": "1824-1835", "volume": "28"}, "authors": [{"authorId": "51447181", "name": "Rosanna Turrisi"}, {"authorId": "2306463", "name": "M. Squillario"}, {"authorId": "21617855", "name": "G. Abate"}, {"authorId": "3443908", "name": "D. Uberti"}, {"authorId": "2592461", "name": "A. Barla"}], "citations": [{"paperId": "2baf573d41b37d1689282413c063acdd0bb97efc", "title": "Predictive models in Alzheimer's disease: an evaluation based on data mining techniques"}, {"paperId": "b5b7467619a3209dfa05225b65ea7b108e019fe5", "title": "Machine Learning Methods for Gene Selection in Uveal Melanoma"}, {"paperId": "5b4399d08d850cb6ffbbdbd9e2f3cc5d126e2640", "title": "AI-Based Model for Detection and Classification of Alzheimer Disease"}]}
