{"paperId": "672da2bff20808998a5c4a3953612d2cdd60d891", "publicationVenue": {"id": "4e46790b-e240-4236-9b8d-a70ed74f900a", "name": "IEEE Transactions on Mobile Computing", "type": "journal", "alternate_names": ["IEEE Trans Mob Comput"], "issn": "1536-1233", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7755", "alternate_urls": ["http://www.computer.org/portal/web/tmc"]}, "title": "JavaScript Performance Tuning as a Crowdsourced Service", "abstract": "JavaScript (JS) is one of the most used programming languages for mobile applications. As JS is increasingly used in computation-intensive and latency-sensitive components, JS application performance can significantly impact user experience. While compilers play a crucial role in optimizing JS performance on mobile systems, their optimizations must be simple due to the computation and battery usage limitations of the underlying hardware platforms. We present JSTuner, a machine-learning system to leverage compiler-based autotuning techniques to optimize JS performance by finding a good compiler optimization sequence. JSTuner is designed to reduce the cost of autotuning by using prior knowledge of JS programs collected through a crowdsourcing framework to bootstrap the search process. It allows the user to seamlessly utilize the computation resources of a cloud server to perform the heavy-lifting autotuning process for repeatedly running JS components. This enables aggressive search-based optimizations that are too expensive to run on the user's device. We evaluate JSTuner by applying it to 60 JS benchmarks across three distinct mobile devices and comparing it against four search-based techniques. Experimental results show that JSTuner consistently outperforms prior techniques and improves JS performance by 1.62x on average (up to 3.33x) over the default compiler setting used by the Chrome V8 JS engine.", "venue": "IEEE Transactions on Mobile Computing", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-05-01", "journal": {"name": "IEEE Transactions on Mobile Computing", "pages": "6116-6132", "volume": "23"}, "authors": [{"authorId": "143702207", "name": "J. Ren"}, {"authorId": "1443786960", "name": "Ling Gao"}, {"authorId": "40072305", "name": "Zheng Wang"}], "citations": []}
