{"paperId": "673932ad4758ff107504743ecdeef0a876afafc9", "publicationVenue": null, "title": "Channel Reuse for Backhaul in UAV Mobile Networks with User QoS Guarantee", "abstract": "In mobile networks, unmanned aerial vehicles (UAVs) acting as flying base stations (FlyBSs) can effectively improve performance. Nevertheless, such potential improvement requires an efficient positioning of the FlyBS. In this paper, we study the problem of sum downlink capacity maximization in FlyBS-assisted networks with mobile users and with a consideration of wireless backhaul with channel reuse while a minimum required capacity to every user is guaranteed. The problem is formulated under constraints on the FlyBS's flying speed, propulsion power consumption, and transmission power for both of flying and ground base stations. None of the existing solutions maximizing the sum capacity can be applied due to the combination of these practical constraints. This paper pioneers in an inclusion of all these constraints together with backhaul to derive the optimal 3D positions of the FlyBS and to optimize the transmission power allocation for the channels at both backhaul and access links as the users move over time. The proposed solution is geometrical based, and it shows via simulations a significant increase in the sum capacity (up by 19%-47%) compared with baseline schemes where one or more of the aspects of backhaul communication, transmission power allocation, and FlyBS's positioning are not taken into account.", "venue": "ICC 2023 - IEEE International Conference on Communications", "year": 2023, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-01-19", "journal": {"name": "ICC 2023 - IEEE International Conference on Communications", "pages": "5425-5431"}, "authors": [{"authorId": "51047625", "name": "Mohammadsaleh Nikooroo"}, {"authorId": "3324541", "name": "Zdenek Becvar"}, {"authorId": "9823812", "name": "Omid Esrafilian"}, {"authorId": "1710234", "name": "D. Gesbert"}], "citations": []}
