{"paperId": "673f7655d4a87ac123584f8c0843e2fb4a23ab53", "publicationVenue": {"id": "58f55ec2-1f5a-4e79-af2a-0046ee1dcd2a", "name": "Journal of functional programming", "type": "journal", "alternate_names": ["J funct program", "Journal of Functional Programming", "J Funct Program"], "issn": "0956-7968", "url": "https://www.cambridge.org/core/journals/journal-of-functional-programming", "alternate_urls": ["http://journals.cambridge.org/jid_JFP"]}, "title": "Fregel: a functional domain-specific language for vertex-centric large-scale graph processing", "abstract": "Abstract The vertex-centric programming model is now widely used for processing large graphs. User-defined vertex programs are executed in parallel over every vertex of a graph, but the imperative and explicit message-passing style of existing systems makes defining a vertex program unintuitive and difficult. This article presents Fregel, a purely functional domain-specific language for processing large graphs and describes its model, design, and implementation. Fregel is a subset of Haskell, so Haskell tools can be used to test and debug Fregel programs. The vertex-centric computation is abstracted using compositional programming that uses second-order functions on graphs provided by Fregel. A Fregel program can be compiled into imperative programs for use in the Giraph and Pregel+ vertex-centric frameworks. Fregel’s functional nature without side effects enables various transformations and optimizations during the compilation process. Thus, the programmer is freed from the burden of program optimization, which is manually done for existing imperative systems. Experimental results for typical examples demonstrated that the compiled code can be executed with reasonable and promising performance.", "venue": "Journal of functional programming", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-20", "journal": {"name": "Journal of Functional Programming", "volume": "32"}, "authors": [{"authorId": "1745636", "name": "H. Iwasaki"}, {"authorId": "1743418", "name": "Kento Emoto"}, {"authorId": "2613051", "name": "Akimasa Morihata"}, {"authorId": "2171152", "name": "Kiminori Matsuzaki"}, {"authorId": "34667855", "name": "Zhenjiang Hu"}], "citations": [{"paperId": "a17aadf1f3af6a3790c2ad091db814440a77940c", "title": "Multi-Stage Vertex-Centric Programming for Agent-Based Simulations"}, {"paperId": "efd48080af59bf9bf785a86410c916fec9345f79", "title": "Extensions to the Predicate Programming Language for Efficient Graph Processing"}]}
