{"paperId": "67437a99fbba9d8a5857b444fa103ac2ae99d927", "publicationVenue": {"id": "25ae4109-9fc4-4bcf-9726-d3f3cbd40754", "name": "Journal of Engineering Research", "type": "journal", "alternate_names": ["The Journal of Engineering Research", "J Eng Res", "Journal of engineering researches", "J eng res"], "issn": "2356-9441", "alternate_issns": ["2687-3192", "2735-4873", "1726-6009", "2764-1317"], "url": "https://journals.squ.edu.om/index.php/tjer/index"}, "title": "Microstrip filters Based on Open Stubs and SIR for High Frequency and Ultra-Wideband Applications", "abstract": "This paper includes two new microstrip filter configurations for high frequency and Ultra-Wide Band applications. The first proposed filter is a composition of four parallel open-circuited stubs connected by optimized fractal-structured microstrip line. The filter response is a combination of three passing regions, namely low pass from 0.1 GHz to 3 GHz, band-pass from 4.5 GHz to 9 GHz and high pass from 10.5 GHz to 13 GHz, separated by two rejection regions from 3 GHz to 4.5 GHz and 9 GHz to 10.5 GHz. Deep and sharp rejection regions reaching up to -44.6 dB with 40 % fractional bandwidth (FBW) are observed with a good electrical performance. Furthermore, with a comparative table, the advantages of this proposed BSF in terms of FBW, compactness and insertion loss are compared with recently reported related studies. Secondly a dual-band band pass filter implementing a Stepped-Impedance resonator (SIR) and a modified H-shaped structure is presented. This filter is designed to operate in a low pass region up to 3.58 GHz and a band pass region from 15.38 to 21.65 GHz, with a wide stopband region between 4.46 and 14.07 GHz. The simulated and measured results are in good agreement. Compared to its peers, the compact size and low price allow for a wide application of these filter configurations, while passing frequencies allow operation in the unlicensed frequency spectrum, which is popular for high-speed communication. Keywords: Microstrip Filter, Band Pass, Band Stop, Open Stubs, SIR.", "venue": "Journal of Engineering Research", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2021-10-20", "journal": {"name": "Journal of Engineering Research"}, "authors": [{"authorId": "9216117", "name": "S. Imeci"}, {"authorId": "2259445168", "name": "Herzegovina"}, {"authorId": "97939150", "name": "Bilal Tütüncü"}, {"authorId": "2238959624", "name": "Faruk Bešlija"}, {"authorId": "2142094855", "name": "Lamija Herceg"}], "citations": [{"paperId": "e113ab1e5bb09e2ed11fce5bc4be79f7abc278f2", "title": "Analytical design of band-pass waveguide filter in C-band using inductive iris"}, {"paperId": "e6c1326476d7acf7f312f80118860dc4977aaec4", "title": "A 3-dB 90 degrees microstrip hybrid directional coupler at 2.27 GHz"}, {"paperId": "ec1ec986983c895af2cac2936875f8e34ffe1777", "title": "Two-Resonator Microstrip Filters with Increased Single-Sided Frequency Selectivity"}]}
