{"paperId": "674544816e1d8260c6c1968c0a015bed7b0dbae4", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Metrics Space and Norm: Taxonomy to Distance Metrics", "abstract": "A lot of machine learning algorithms, including clustering methods such as K-nearest neighbor (KNN), highly depend on the distance metrics to understand the data pattern well and to make the right decision based on the data. In recent years, studies show that distance metrics can significantly improve the performance of the machine learning or deep learning model in clustering, classification, data recovery tasks, etc. In this article, we provide a survey on widely used distance metrics and the challenges associated with this field. The most current studies conducted in this area are commonly influenced by Siamese and triplet networks utilized to make associations between samples while employing mutual weights in deep metric learning (DML). They are successful because of their ability to recognize the relationships among samples that show a similarity. Furthermore, the sampling strategy, suitable distance metric, and network structure are complex and difficult factors for researchers to improve network model performance. So, this article is significant because it is the most recent detailed survey in which these components are comprehensively examined and valued as a whole, evidenced by assessing the numerical findings of the techniques.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-06", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "89735469", "name": "B. Subramanian"}, {"authorId": "2151122385", "name": "Anand Paul"}, {"authorId": "2154565791", "name": "Jeonghong Kim"}, {"authorId": "121778297", "name": "K. Chee"}], "citations": [{"paperId": "82e0604599f720a4eba804ab6b1193ee3c47d770", "title": "Cluster Analysis on Football Teams Performance Data"}]}
