{"paperId": "6747339ad1bc630edc715c372e009df369bd7f7d", "publicationVenue": {"id": "44a8affe-ff49-4c97-915b-0e4378776101", "name": "International Journal of Emerging Technologies in Learning (iJET)", "type": "journal", "alternate_names": ["Int J Emerg Technol Learn (ijet", "International Journal of Emerging Technologies in Learning", "Int J Emerg Technol Learn", "International Journal of Emerging Technologies in Learning (ijet)"], "issn": "1863-0383", "url": "http://www.i-jet.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-jet/about", "https://www.online-journals.org/index.php/i-jet"]}, "title": "Understanding the Behavioural Patterns of University Teachers Toward Using a Learning Management System", "abstract": "Recent research has been very attentive to the examination of learners’ behavioural patterns of using learning management systems (LMS), but these studies seldom address the diversity in the LMS usage behaviours of teachers. This study aimed to discover the behavioural patterns of university instructors regarding the use of an LMS by using sequential and clustering analysis techniques. The usage behaviours of 268 teachers at a public university in China were extracted from the Blackboard platform over the course of one-semester. These behaviours were classified according to five different LMS behavioural types: (1) course and content; (2) assignment; (3) communication and collaboration; (4) assessment; and (5) administration. The results indicated that the most frequent teachers’ LMS usage behaviour was course and content followed by assessment and administration. The results of the sequential analysis indicated that most of the instructors are used to adopting communication and collaboration and assignment when they finish using course and content. In addition, three distinct usage behavioural pattern subgroups were named as teachers preferred assessment, teachers of regular use, and teachers of less use. Implications of these findings are discussed in the light of the university teachers’ behavioural patterns toward using the LMS.", "venue": "International Journal of Emerging Technologies in Learning (iJET)", "year": 2021, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-28", "journal": {"name": "Int. J. Emerg. Technol. Learn.", "volume": "16"}, "authors": [{"authorId": "2355658", "name": "C. Su"}, {"authorId": "144037389", "name": "Yu-Hang Li"}, {"authorId": "2004926649", "name": "Cheng-Huan Chen"}], "citations": [{"paperId": "f01ffbfffd2024ca7392d253ccb25712d0127613", "title": "Exploring and comparing pedagogical beliefs of university instructors in relation to their behavioural patterns regarding learning management system use"}, {"paperId": "ae394738218647fbedde1008043ddf3b76b762cf", "title": "Impact of School-University Partnerships and Professional Learning Communities"}, {"paperId": "3176da186c4d16be95cd39a9723ff38ec4939ad2", "title": "The Effect of Academic Supervision and School Climate on Teacher Performance in Islamic Junior High School"}, {"paperId": "21fb2d395ee539367312989ee521225222ff1277", "title": "Influence of Special Learning Technology on the Effectiveness of Pedagogical Ethics Formation in Future Teachers"}, {"paperId": "bf9c9b8102dbcf6fa6f16075b059f5225fec3de1", "title": "The Evaluation of User Experience on Learning Management Systems Using UEQ"}, {"paperId": "7e2dcce77194b67c86e0141e34a5554ada198486", "title": "A Proposed Architecture of an Intelligent System for Assessing the Student's UML Class Diagram"}, {"paperId": "805acd51d891521399571c5fc2a966b5d037316a", "title": "Use of Technological Equipment for E-learning in Peruvian University Students in Times of Covid-19"}]}
