{"paperId": "675342f256f30dee8d1a6116122ccd07d243be41", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "R-Store: A scalable distributed system for supporting real-time analytics", "abstract": "It is widely recognized that OLTP and OLAP queries have different data access patterns, processing needs and requirements. Hence, the OLTP queries and OLAP queries are typically handled by two different systems, and the data are periodically extracted from the OLTP system, transformed and loaded into the OLAP system for data analysis. With the awareness of the ability of big data in providing enterprises useful insights from vast amounts of data, effective and timely decisions derived from real-time analytics are important. It is therefore desirable to provide real-time OLAP querying support, where OLAP queries read the latest data while OLTP queries create the new versions. In this paper, we propose R-Store, a scalable distributed system for supporting real-time OLAP by extending the MapReduce framework. We extend an open source distributed key/value system, HBase, as the underlying storage system that stores data cube and real-time data. When real-time data are updated, they are streamed to a streaming MapReduce, namely Hstreaming, for updating the cube on incremental basis. Based on the metadata stored in the storage system, either the data cube or OLTP database or both are used by the MapReduce jobs for OLAP queries. We propose techniques to efficiently scan the real-time data in the storage system, and design an adaptive algorithm to process the real-time query based on our proposed cost model. The main objectives are to ensure the freshness of answers and low processing latency. The experiments conducted on the TPC-H data set demonstrate the effectiveness and efficiency of our approach.", "venue": "IEEE International Conference on Data Engineering", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-05-19", "journal": {"name": "2014 IEEE 30th International Conference on Data Engineering", "pages": "40-51"}, "authors": [{"authorId": "2146311457", "name": "Feng Li"}, {"authorId": "1705151", "name": "M. Tamer Özsu"}, {"authorId": "46965289", "name": "Gang Chen"}, {"authorId": "1693070", "name": "B. Ooi"}], "citations": [{"paperId": "c4c193b3fca96a8b16f3dbe3247ad36389073537", "title": "Krypton: Real-time Serving and Analytical SQL Engine at ByteDance"}, {"paperId": "637652ade145a9535ba1ea977cb672489c10f179", "title": "An extra spatial hierarchical schema in key-value store"}, {"paperId": "bf6118d39df4602d14859bfdcac6a72e8b708fd2", "title": "An Innovative Lambda-Architecture-Based Data Warehouse Maintenance Framework for Effective and Efficient Near-Real-Time OLAP over Big Data"}, {"paperId": "b432623209f5b97f3a0ee9da7f77f9c7765c2ad3", "title": "A Distributed Self-adaption Cube Building Model Based on Query Log"}, {"paperId": "8f90e23487834a43762c921ec4f4935027db9686", "title": "Empirical Analysis on Comparing the Performance of Alpha Miner Algorithm in SQL Query Language and NoSQL Column-Oriented Databases Using Apache Phoenix"}, {"paperId": "6e2b9be53d3ad246c89829c1c98f3be5c5e73427", "title": "Research progress in the complexity theory and algorithms of big-data computation"}, {"paperId": "2c3602c5509297c54b059058b29e623fa578f983", "title": "Study on big data analytics research domains"}, {"paperId": "72c6a8b24b91e3c1fbbc08190db0d1c97d9f4c19", "title": "Virtual lightweight snapshots for consistent analytics in NoSQL stores"}, {"paperId": "f752a54f6953349a6c0fe248f90722ea82434a6a", "title": "Bloom filter for elasticity in DBaaS"}, {"paperId": "b3091158d2c8db2d966895b32b9f3430c0bb348c", "title": "HaCube: Extending MapReduce for Efficient OLAP Cube Materialization and View Maintenance"}, {"paperId": "a92bb7ea2b3b6b25f7d1b3db6313de0f547e44fa", "title": "Loop Query of Big Data with Low Transmission Cost"}, {"paperId": "a315bded03b88e939cce0d9e488eb08e17cb273d", "title": "HBelt: Integrating an Incremental ETL Pipeline with a Big Data Store for Real-Time Analytics"}, {"paperId": "5e2b7a719a2222a48166cf3a3fff2834655f5a30", "title": "The Evolvement of Big Data Systems: From the Perspective of an Information Security Application"}, {"paperId": "b5eb0239ecece5ca5adb420f9f9237805cb597fb", "title": "A scalable machine learning online service for big data real-time analysis"}, {"paperId": "dda986751968714074431c1c5f8abd09da31aad0", "title": "Retrofitting High Availability Mechanism to Tame Hybrid Transaction/Analytical Processing"}, {"paperId": "d93ebdbf6c1f37a4fe66e8708f7285e77ba1b3c8", "title": "Big Data and Query Optimization Techniques"}, {"paperId": "d46a9c2863329ecd8802ef47bd5dba4aba18de3d", "title": "Wrapper Approach for Range-Aggregate Queries in Big Data Applications"}, {"paperId": "811fb4ece6ae564c8bb5dc8fb4eabca5921e3009", "title": "Survey on Software Project Risks and Big Data Analytics"}, {"paperId": "30f25c8406eb7f48b14f4c7b82cba37fb1f13f59", "title": "Licensed under Creative Commons Attribution Cc by Efficient Query Handling on Big Data in Network Using Pattern Matching Algorithm: a Review"}]}
