{"paperId": "6758b451f3a77c89d801288a27d61fdaa717c537", "publicationVenue": null, "title": "A Hybrid Recommendation Technique for Big Data Systems", "abstract": "Recommender systems are engines that recommend new items to users by analyzing their preferences. The web contains a large amount of information in the form of ratings, reviews, feedback on items and other unstructured data. These details are extracted to get meaningful information of users. Collaborative filtering and content-based filtering are two common approaches being used to make recommendations. The paper aims to introduce a hybrid recommendation technique for Big Data Systems. The approach combines collaborative and content-based filtering techniques to recommend items that a user would most likely prefer. It additionally uses items ranking and classification technique for recommending the items. Moreover, social media opinion mining is added as a top-up to derive user sentiments from user’s posts and become knowledgeable about users’ tastes hidden within social media. A prototype has been implemented and evaluated based on the recommendation techniques.", "venue": "2018 International Conference on Intelligent and Innovative Computing Applications (ICONIC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-12-01", "journal": {"name": "2018 International Conference on Intelligent and Innovative Computing Applications (ICONIC)", "pages": "1-7"}, "authors": [{"authorId": "67104137", "name": "Chitra Nundlall"}, {"authorId": "66493460", "name": "Gopal Sohun"}, {"authorId": "2281390", "name": "S. Nagowah"}], "citations": [{"paperId": "d4d30522062d8f1967cda3a820bc268e34af767b", "title": "A Survey on Recommendation Systems using Collaborative Filtering Techniques"}, {"paperId": "038b509addb54df88d0bb4df39b1bbe9e0664f2a", "title": "SemRec – An efficient ensemble recommender with sentiment based clustering for social media text corpus"}, {"paperId": "3f0386fe909703fb5adfe31f31e1b0a421037631", "title": "A DASH Diet Recommendation System for Hypertensive Patients Using Machine Learning"}, {"paperId": "7a1ca7b5c5186a67cf6c84456c01ee141ba52be8", "title": "Intelligent Recommender System for Big Data Applications Based on the Random Neural Network"}, {"paperId": "d7d780242c7dad5708ea271fe8b84e175993e9a1", "title": "A Sentiment-Based Recommender System Framework for Social Media Big Data Using Open-Source Tech Stack"}]}
