{"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems", "abstract": "In modern computing environments, users may have multiple systems accessible to them such as local clusters, private clouds, or public clouds. This abundance of choices makes it difficult for users to select the system and configuration for running an application that best meet their performance and cost objectives. To assist such users, we propose a prediction tool that predicts the full performance-cost trade-off space of an application across multiple systems. Our tool runs and profiles a submitted application on a small number of configurations from some of the systems, and uses that information to predict the application's performance on all configurations in all systems. The prediction models are trained offline with data collected from running a large number of applications on a wide variety of configurations. Notable aspects of our tool include: providing different scopes of prediction with varying online profiling requirements, automating the selection of the small number of configurations and systems used for online profiling, performing online profiling using partial runs thereby make predictions for applications without running them to completion, employing a classifier to distinguish applications that scale well from those that scale poorly, and predicting the sensitivity of applications to interference from other users. We evaluate our tool using 69 data analytics and scientific computing benchmarks executing on three different single-node CPU systems with 8–9 configurations each and show that it can achieve low prediction error with modest profiling overhead.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-04", "journal": {"name": "2023 IEEE/ACM 23rd International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "216-228"}, "authors": [{"authorId": "2161432189", "name": "Amir Nassereldine"}, {"authorId": "2096162793", "name": "Safaa Diab"}, {"authorId": "2169236", "name": "M. Baydoun"}, {"authorId": "2213476544", "name": "Kenneth Leach"}, {"authorId": "71814945", "name": "M. Alt"}, {"authorId": "1712405", "name": "D. Milojicic"}, {"authorId": "3077499", "name": "I. E. Hajj"}], "citations": [{"paperId": "491e135e43b64e73131a132d6262e99c673637c1", "title": "Fine-Grained Heterogeneous Execution Framework with Energy Aware Scheduling"}, {"paperId": "33e8b36adfb841ec449dcee53aa396e49428abc9", "title": "Integrating HPC, AI, and Workflows for Scientific Data Analysis"}]}
