{"paperId": "676595d606529cb05f96fb76f8909ee2c2bf3852", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Drivers Fatigue Level Prediction Using Facial, and Head Behavior Information", "abstract": "With driver fatigue continues to cause serious and deadly car and motorcycles accidents, the need for automatically recognizing driver fatigue and alerting the drivers is apparent. Although various approaches that explore physiological and physical factors to classify driver fatigue have been developed, the overall accuracy, recognition speed, distraction in the driving process and the cost of these systems still need to be improved. In this paper, we present a low-cost driver fatigue level prediction framework (DFLP) for detecting driver fatigue in its earliest stages. DFLP predicts drive fatigue based on eyes, mouth, and head behavior cues using a non-physical contact sensor input (infrared radiation) (IR) camera. DFLP classifies the level of drowsiness and attributes the level of altering accordingly. To validate the proposed fatigue prediction framework, we conducted the experiment using real datasets under night and day illumination conditions. The results of the experiment show that the proposed approach can predict the level of driver’s fatigue with 93.3% overall accuracy. The solution proposed in this paper, not only reduces the number of drivers fatigue-related accidents but also addressed an area of sufficient interest for transportation, psychology and public health experts and readers as well as automakers to develop an in-vehicle fatigue prediction system.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "121686-121697", "volume": "9"}, "authors": [{"authorId": "1410452201", "name": "H. A. Kassem"}, {"authorId": "143697562", "name": "M. Chowdhury"}, {"authorId": "1703056", "name": "J. Abawajy"}], "citations": [{"paperId": "8fd5a4c2097beeb193e0b9655f7acbc220e48b71", "title": "Scaling effectivity in manifold methodologies to detect driver’s fatigueness and drowsiness state"}, {"paperId": "a0c111d84ecc404f6a0df2c8d74ea0b5706b8fe5", "title": "Remote Photoplethysmography and Motion Tracking Convolutional Neural Network with Bidirectional Long Short-Term Memory: Non-Invasive Fatigue Detection Method Based on Multi-Modal Fusion"}, {"paperId": "5074ed5a74bec5b86f05b10f1598a27d273f01fc", "title": "JHPFA-Net: Joint Head Pose and Facial Action Network for Driver Yawning Detection Across Arbitrary Poses in Videos"}, {"paperId": "3452b07356069ea2d13fa08e014045b4d68b8920", "title": "Structural analysis of driver fatigue behavior: A systematic review"}, {"paperId": "c578cda34f947e045e61e878562cf7e688b25c74", "title": "Automobilist Fatigue Detection Using Machine Learning Algorithms"}, {"paperId": "2de291e0b523f33ad8c3c63edf335b746f016963", "title": "A Multi-Convolutional Stream for Hybrid network for Driver Action Recognition at Nighttime"}]}
