{"paperId": "6780aaccdc0ea47b668364137a78b3b238de1812", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A Hybrid Edge-Cloud System for Networking Service Components Optimization Using the Internet of Things", "abstract": "The need for data is growing steadily due to big data technologies and the Internet’s quick expansion, and the volume of data being generated is creating a significant need for data analysis. The Internet of Things (IoT) model has appeared as a crucial element for edge platforms. An IoT system has serious performance issues due to the enormous volume of data that many connected devices produce. Potential methods to increase resource consumption and responsive services’ adaptability in an IoT system include edge-cloud computation and networking function virtualization (NFV) techniques. In the edge environment, there is a service combination of many IoT applications. The significant transmission latency impacts the functionality of the entire network in the IoT communication procedure because of the data communication among various service components. As a result, this research proposes a new optimization technique for IoT service element installation in edge-cloud-hybrid systems, namely the IoT-based Service Components Optimization Model (IoT-SCOM), with the decrease of transmission latency as the optimization aim. Additionally, this research creates the IoT-SCOM model and optimizes it to choose the best deployment option with the least assured delay. The experimental findings demonstrate that the IoT-SCOM approach has greater accuracy and effectiveness for the difficulty of data-intensive service element installation in the edge-cloud environment compared to the existing methods and the stochastic optimization technique.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-28", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1410011411", "name": "Souvik Pal"}, {"authorId": "3218095", "name": "Noor Zaman Jhanjhi"}, {"authorId": "46228759", "name": "A. S. Abdulbaqi"}, {"authorId": "1644754430", "name": "D. Akila"}, {"authorId": "69558731", "name": "Abdulaleem Ali Almazroi"}, {"authorId": "2232512390", "name": "Faisal S. Alsubaei"}], "citations": [{"paperId": "ca44992bb8ca112ae3c0932dc6db644addd1cd5e", "title": "Design method of laboratory equipment monitoring system based on industrial internet of things"}, {"paperId": "2c5e4a5c09b72ca1403cf64cb3bba09f1c4b0854", "title": "Integrating the Internet of Things (IoT) in SPA Medicine: Innovations and Challenges in Digital Wellness"}, {"paperId": "afdb89384c26fb54fcb1dea81f6f5c650b669527", "title": "ML-assisted Security for Anomaly Detection in Industrial IoT (IIoT) Applications"}, {"paperId": "74bab0bfe8ce1590fcbc7a9bb9b1162084c86045", "title": "Enhancing Performance and Security in the Metaverse: Latency Reduction Using Trust and Reputation Management"}, {"paperId": "5055f47471fcc16f2cdb54a71d61ed87e9559441", "title": "An Intelligent Task Scheduling Model for Hybrid Internet of Things and Cloud Environment for Big Data Applications"}, {"paperId": "f5b333a7ba67b5efd6f4223a1a95e41d3dcd3416", "title": "Comparison of exposure to various research methodologies, willingness, and involvement of undergraduate students in research projects between Indian and International Students- a KAP survey"}, {"paperId": "5115f8b41a4897e69bae0457994eb413e38204c2", "title": "Active SLAM: A Review on Last Decade"}, {"paperId": "6cef121caddd88bfd658626d56508ad38dd6482c", "title": "Energy consumption in cloud IoT data centre - A survey"}]}
