{"paperId": "678b7b1dce9cc100a7be75817bfe8fb089e5a94a", "publicationVenue": {"id": "c23fbef8-807d-4a64-8ed8-f7d6f8032240", "name": "IASSIST Quarterly", "alternate_names": ["IASSIST Q"], "issn": "0739-1137", "url": "http://datalib.library.ualberta.ca/iassist/publications/iq/"}, "title": "Publishing trends on research data management in Sub-Saharan Africa: A bibliometrics analysis", "abstract": "Research data management is an umbrella term used to describe activities related to the creation, organisation, structuring, naming, backing up, storage, conservation, and sharing of research data as well as all actions that guarantee security of research data. As is often the case, researchers from Sub-Saharan Africa are lagging behind their counterparts in developed countries in embracing the best practices of research data management. One of the factors to which this slow pace of adoption of research data management could be attributed, is inadequate research on the subject. The purpose of this paper is to analyse the quantity, quality, visibility and authorship of publications on research data management in Sub-Saharan Africa. Bibliometrics approaches were used to analyse publications on research data management from, and on, Sub-Saharan Africa which are currently indexed in Google Scholar. The index was chosen because it is free and is reputed to have liberal selection criteria which do not favour, or discriminate, any discipline or geographic regions. Data was retrieved from Google Scholar using Harzing’s “Publish or Perish” software and analysed using VOSviewer. The findings of the study revealed that the quantity, quality, visibility and authorship collaboration of scholarly publications on research data management in Sub-Saharan Africa is low. The findings may be used by libraries and research institutions in Sub-Saharan Africa to develop and promote best practices in research data management as a means of enhancing their research output and impact.", "venue": "IASSIST Quarterly", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-26", "journal": {"name": "IASSIST Quarterly"}, "authors": [{"authorId": "2213606", "name": "T. Kwanya"}], "citations": [{"paperId": "d23746b12a89cfdc84352d85250f88547b196de8", "title": "Global research trends in research data management: A bibliometrics approach"}, {"paperId": "b5b522ca97d617c778755103c6317c69603e6d86", "title": "Research data management competencies of researchers in selected public universities in South Africa"}, {"paperId": "a8735fb3200f8bf9ec205b8783a6366da77cd6b1", "title": "Unveiling the global reach of African anthrax research: A bibliometric journey"}]}
