{"paperId": "6792622b6ddeeea8378689e37963a88f7e742e57", "publicationVenue": {"id": "981ffbc3-11c9-402c-b755-80161f444955", "name": "Biodiversity Data Journal", "type": "journal", "alternate_names": ["Biodivers Data J"], "issn": "1314-2828", "url": "http://biodiversitydatajournal.com/", "alternate_urls": ["https://bdj.pensoft.net/"]}, "title": "A picture is worth a thousand words: using digital tools to visualise marine invertebrate diversity data along the coasts of Mozambique and São Tomé & Príncipe", "abstract": "Abstract The amount of biological data available in online repositories is increasing at an exponential rate. However, data on marine invertebrate biodiversity resources from Mozambique and São Tomé and Príncipe are still sparse and scattered. Online repositories are useful instruments for biodiversity research, as they provide a fast access to data from different sources. The use of interactive platforms comprising web mapping are becoming more important, not only for the scientific community, but also for conservation managers, decision-makers and the general public as they allow data presentation in simple and understandable visual schemes. The main goal of this study was to create an interactive online digital map (hosted and available at MARINBIODIV Atlas), through the collection of data from various sources, to visualise marine invertebrate occurrences and distribution across different habitats, namely mangroves, seagrasses, corals and other coastal areas, in Mozambique and São Tomé and Príncipe. The acquired biodiversity data were managed and structured to be displayed as spatial data and to be disseminated using the geographic information system ArcGIS, where data can be accessed, filtered and mapped. The ArcGIS web mapping design tools were used to produce interactive maps to visualise marine invertebrate diversity information along the coasts of Mozambique and São Tomé and Príncipe, through different habitats, offering the foundation for analysing species incidence and allocation information. Understanding the spatial occurrences and distribution of marine invertebrates in both countries can provide a valuable baseline, regarding information and trends on their coastal marine biodiversity.", "venue": "Biodiversity Data Journal", "year": 2021, "fieldsOfStudy": ["Medicine", "Geography"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-25", "journal": {"name": "Biodiversity Data Journal", "volume": "9"}, "authors": [{"authorId": "151026596", "name": "Henrique Niza"}, {"authorId": "40220759", "name": "M. São Bento"}, {"authorId": "2075423840", "name": "Luis Lopes"}, {"authorId": "87161457", "name": "A. Cartaxana"}, {"authorId": "2054951277", "name": "A. Correia"}], "citations": [{"paperId": "7012a0feb0f33eb6196f089d52b641563a6e9dc2", "title": "Marine macroinvertebrate ecosystem services under changing conditions of seagrasses and mangroves."}, {"paperId": "6919cc3a9bc466426743c5b940898e162c7e5a6a", "title": "BioNoMo: the Biodiversity Network of Mozambique"}, {"paperId": "1bf9ea0b878f70dcd4b70fd1990a12e2b9d48c30", "title": "Mind the Gaps: Taxonomic, Geographic and Temporal Data of Marine Invertebrate Databases from Mozambique and São Tomé and Príncipe"}]}
