{"paperId": "679a58d10d23d85ccebe5ead5af2884611f412ef", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Predictive Maintenance 4.0 for Chilled Water System at Commercial Buildings: A Systematic Literature Review", "abstract": "Predictive maintenance plays an important role in managing commercial buildings. This article provides a systematic review of the literature on predictive maintenance applications of chilled water systems that are in line with Industry 4.0/Quality 4.0. The review is based on answering two research questions about understanding the mechanism of identifying the system’s faults during its operation and exploring the methods that were used to predict these faults. The research gaps are explained in this article and are related to three parts, which are faults description and handling, data collection and frequency, and the coverage of the proposed maintenance programs. This article suggests performing a mixed method study to try to fill in the aforementioned gaps.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-08-13", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2045003250", "name": "Malek Almobarek"}, {"authorId": "2073577", "name": "K. Mendibil"}, {"authorId": "72100910", "name": "Abdalla Alrashdan"}], "citations": [{"paperId": "17fa42ca7904f86656eb78ad228dff7c1bbf0166", "title": "Optimizing energy efficiency in data center cooling towers through predictive maintenance and project management"}, {"paperId": "343ad1efde5308ec21114a2df11b9f022ceebf65", "title": "Practical Applications of Model Predictive Control and Other Advanced Control Methods in the Built Environment: An Overview of the Special Issue"}, {"paperId": "a07714f610233b46c8b014dc0dd3c2448e5f54c6", "title": "A Critical Perspective on Current Research Trends in Building Operation: Pressing Challenges and Promising Opportunities"}, {"paperId": "55b5575837e2d7d5d43d5adfafc7c204d7f4bd83", "title": "Enhanced Dual Convolutional Neural Network Model Using Explainable Artificial Intelligence of Fault Prioritization for Industrial 4.0"}, {"paperId": "0a75b32fcb3b44a8b3eb74a51e6fac42ce9df100", "title": "Most Occurred Faults in Chilled Water System: An Empirical Predictive Maintenance 4.0 Study"}, {"paperId": "5f2e3a676a1e19be6483a0bcb3480487aa08b8f9", "title": "Predictive Maintenance Strategies for Electrical Equipment: A Literature Review"}, {"paperId": "5b42ff2228f894a495fb0030c165b933423f63c3", "title": "Fault Types and Frequencies in Predictive Maintenance 4.0 for Chilled Water System at Commercial Buildings: An Industry Survey"}, {"paperId": "76b9ca8ecc7f25087de2ae129296de84ce9856d0", "title": "Information system for monitoring of a ship power plant and prediction of technical condition"}]}
