{"paperId": "67c3536bc803dd7b00f0506986f6553ac2668d2a", "publicationVenue": null, "title": "A Comparison of Predictive Models for Rice Imports in Iraq: Artificial Neural Networks vs. Traditional Techniques", "abstract": "Ensuring an adequate food supply for humans remains a significant challenge for society. Accurately forecasting rice yield is crucial for effective planning and decision-making by organizations. Artificial Neural Networks (ANN) have emerged as a modern and sophisticated methodology, drawing attention from researchers and scientists across various fields and disciplines, including engineering, medicine, statistics, information systems, and more. This study aimed to evaluate and validate modern forecasting methods based on artificial intelligence in comparison to traditional time series methods. The results demonstrate that ANN is the optimal approach for forecasting Milled Rice Imports, offering reliable predictions for stakeholders. Furthermore, ANN serves as a dependable model for predicting time series and can support decision-making related to rice yield forecasts. The study underscores the potential of artificial neural networks in time series analysis and calls for further research in this area. This research could offer valuable insights into the role of ANN in accurately predicting rice yield and may inform future planning and decision-making related to the food supply. The most noTABLE discovery of this paper is that artificial neural networks are the most effective approach for time series prediction, offering precise and reliable forecasts across diverse applications.", "venue": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-07-19", "journal": {"name": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "pages": "1-5"}, "authors": [{"authorId": "1642251674", "name": "Marwan Abdul Hameed Ashour"}, {"authorId": "153332475", "name": "R. A. Abbas"}], "citations": [{"paperId": "2ffad3b10969d6969b17f0e9daeeb138fc797fa0", "title": "EVALUASI METODE JARINGAN SYARAF TIRUAN DALAM MEMPREDIKSI PRODUKTIVITAS PADI: REVIEW DAN PROSPEK"}]}
