{"paperId": "67d472be05dac7d54f94321034c09b0e16d8a381", "publicationVenue": null, "title": "Contributions to large-scale data processing systems", "abstract": "Cette these couvre le sujet des systemes de traitement de donnees agrande echelle, et plus precisement trois approches complementaires :la conception d'un systeme pour predir des defaillances de serveursgrâce a l'analyse de leurs donnees de supervision; l'acheminement dedonnees dans un systeme a temps reel en etudiant les correlationsentre les champs des messages pour favoriser la localite; etfinalement un environnement de developpement innovateur pour concevoirdes transformations de donees en utilisant des graphes orientes deblocs.A travers le projet Smart Support Center, nous concevons unearchitecture qui passe a l'echelle, afin de stocker des seriestemporelles rapportees par des moteurs de supervision, qui verifienten permanence la sante des systemes informatiques. Nous utilisons cesdonnees pour effectuer des predictions, et detecter de potentielsproblemes avant qu'ils ne ne produisent.Nous nous plongeons ensuite dans les algorithmes d'acheminement pourles sytemes de traitement de donnees en temps reel, et developpons unecouche pour acheminer les messages plus efficacement, en evitant lesrebonds entre machines. Dans ce but, nous identifions en temps reelles correlations qui apparaissent entre les champs de ces messages,tels les mots-clics et leur localisation geographique, par exempledans le cas de micromessages. Nous utilisons ces correlations pourcreer des tables d'acheminement qui favorisent la colocation desacteurs traitant ces messages.Pour finir, nous presentons λ-blocks, un environnement dedeveloppement pour effectuer des tâches de transformations de donneessans ecrire de code source, mais en creant des graphes de blocs decode. L'environnement est rapide, et est distribue avec des pilesincluses: libraries de blocs, modules d'extension, et interfaces deprogrammation pour l'etendre. Il est egalement capable de manipulerdes graphes d'execution, pour optimisation, analyse, verification, outout autre but.", "venue": "", "year": 2018, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2018-02-05", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2850502", "name": "Matthieu Caneill"}], "citations": []}
