{"paperId": "67d7e1b1be397318d2d60c015c5199bb9fde4c1c", "publicationVenue": null, "title": "A hybrid multi-source data fusion for word, sentence, aspect, and document-level sentiment analysis on real-time databases", "abstract": "Sentiment analysis (SA)at the sentence, aspect, and document levels determines the sentiment of particular aspect phrases in a given sentence. Due to their capacity to extract sentiment information from text in aspect-level sentiment classification, neural networks (NNs) have achieved significant success. Generally speaking, sufficiently sizable training corpora are necessary for NNs to be effective. The performance of NN-based systems is reduced by the small size of the aspect-level corpora currently available. In this research, we suggest a gated bilateral recurrent neural network (G-Bi-RNN) as a foundation for multi-source data fusion, their system offers sentiment information that several sources. We develop a uniform architecture specifically to include information from sentimental lexicons, including aspect- and sentence-level corpora. To further provide aspect-specific phrase representations for SA, we use G-Bi-RNN, a deep bilateral Transformer-based pre-trained language model. We assess our methods using SemEval 2014 datasets for laptops and restaurants. According to experimental findings, our method consistently outperforms cutting-edge techniques on all datasets. We use a number of well-known aspect-level SA datasets to assess the efficacy of our model. Experiments show that when compared to baseline models, the suggested model can produce state-of-the-art results.", "venue": "Journal of Intelligent &amp; Fuzzy Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-30", "journal": {"name": "Journal of Intelligent &amp; Fuzzy Systems"}, "authors": [{"authorId": "2143013854", "name": "Monika Agrawal"}, {"authorId": "51446994", "name": "Nageswara Rao Moparthi"}], "citations": []}
