{"paperId": "67e81b1337aaab511fd368802b981cf58fe5245b", "publicationVenue": {"id": "98dfa984-d80f-4d6e-aab8-2a392e65c813", "name": "International Conference on Advances in Electronics Computers and Communications", "type": "conference", "alternate_names": ["ICAECC", "Int Conf Adv Electron Comput Commun"]}, "title": "Machine Learning at Resource Constraint Edge Device Using Bonsai Algorithm", "abstract": "In the worldwide billions of devices connected each other to interact with the surrounding environment to collect the data based on the context. Using machine learning algorithm intelligence can be incorporated in these Internet of Things (IoT) devices to get valuable insights from these data for accurate predictions. Machine learning model is deployed onto the devices for making the decisions locally. This enables fast, accurate prediction within few milliseconds by evading data transmission to the cloud and makes perfectly applicable for real time applications. In this paper, the experiment is conducted with publicly available dataset with Bonsai algorithm. This algorithm is implemented in Linux environment with core is processor in python 2.7 and achieved 92% accuracy with model size of 6.25KB, which can be easily deployed on resource constraint IoT devices.", "venue": "International Conference on Advances in Electronics Computers and Communications", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-12-11", "journal": {"name": "2020 Third International Conference on Advances in Electronics, Computers and Communications (ICAECC)", "pages": "1-6"}, "authors": [{"authorId": "2100057591", "name": "Soumyalatha Naveen"}, {"authorId": "3169998", "name": "Manjunath R. Kounte"}], "citations": [{"paperId": "5c53cebf6deeae1aec7d0bfa887d19ee534a2e09", "title": "Compact optimized deep learning model for edge: a review"}, {"paperId": "5b200ebf89bed4dee5d61fecac0d75db206b6b38", "title": "Comparative Analysis of Datamining Algorithms for Heartbeat Level Prediction"}, {"paperId": "aa1a96dbdd2d1c683b6ae029d68e08df33a13fb9", "title": "Cotton Leaf Disease Detection Using Artificial Intelligence with Autonomous Alerting System"}, {"paperId": "794d1e7513d00629579cc29ab6a2dff3fd182006", "title": "Crop Yield Prediction of Cotton Using Optimization Technique"}, {"paperId": "47a0e86c65812cb93099f33999ef5bfc232823fd", "title": "Accuracy Rate Maximization in Edge Federated Learning With Delay and Energy Constraints"}, {"paperId": "3bf63b62c70c9e72679f75e7424ba4c1356578bf", "title": "Memory optimization at Edge for Distributed Convolution Neural Network"}]}
