{"paperId": "67efa65bfe79ae6580c196560049f6eeaad78735", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Taster: Self-Tuning, Elastic and Online Approximate Query Processing", "abstract": "Current Approximate Query Processing (AQP) engines are far from silver-bullet solutions, as they adopt several static design decisions that target specific workloads and deployment scenarios. Offline AQP engines target deployments with large storage budget, and offer substantial performance improvement for predictable workloads, but fail when new query types appear, i.e., due to shifting user interests. To the other extreme, online AQP engines assume that query workloads are unpredictable, and therefore build all samples at query time, without reusing samples (or parts of them) across queries. Clearly, both extremes miss out on different opportunities for optimizing performance and cost. In this paper, we present Taster, a self-tuning, elastic, online AQP engine that synergistically combines the benefits of online and offline AQP. Taster performs online approximation by injecting synopses (samples and sketches) into the query plan, while at the same time it strategically materializes and reuses synopses across queries, and continuously adapts them to changes in the workload and to the available storage resources. Our experimental evaluation shows that Taster adapts to shifting workload and to varying storage budgets, and always matches or significantly outperforms the state-of-the-art performing AQP approaches (online or offline).", "venue": "IEEE International Conference on Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-01", "journal": {"name": "2019 IEEE 35th International Conference on Data Engineering (ICDE)", "pages": "482-493"}, "authors": [{"authorId": "40095095", "name": "Matthaios Olma"}, {"authorId": "3251613", "name": "Odysseas Papapetrou"}, {"authorId": "32113594", "name": "Raja Appuswamy"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "3dd82e0ab1e141e0e57f2807a5123458f6b1388e", "title": "ShadowAQP: Efficient Approximate Group-by and Join Query via Attribute-oriented Sample Size Allocation and Data Generation"}, {"paperId": "0b9584de2f1a5e4f2ea65cee5867a1cbf22ce129", "title": "LAQy: Efficient and Reusable Query Approximations via Lazy Sampling"}, {"paperId": "90084257c7d461beba330edc7770b0c44f893e68", "title": "Workload Prediction for Adaptive Approximate Query Processing"}, {"paperId": "2945b18928a36ac1a42f1b8bc1ecdd67056d1a1e", "title": "Sampling-Based AQP in Modern Analytical Engines"}, {"paperId": "e0338d7424ab0d884ef0374c6bfc335d858d2334", "title": "One Size Does Not Fit All: A Bandit-Based Sampler Combination Framework with Theoretical Guarantees"}, {"paperId": "6167b4dbf677b78c229524431cd5064b45395db0", "title": "JanusAQP: Efficient Partition Tree Maintenance for Dynamic Approximate Query Processing"}, {"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams"}, {"paperId": "c7b15ef0019af2df5f11bb5d906657f65727a4af", "title": "ML-AQP: Query-Driven Approximate Query Processing based on Machine Learning"}, {"paperId": "37d01b16996e48c9ed91d9113d84d17385bab374", "title": "SUM-optimal histograms for approximate query processing"}, {"paperId": "ff6da1881b3ec500aa753d3afc447626bc74d896", "title": "LAQP: Learning-based Approximate Query Processing"}, {"paperId": "2fb558748a7f64e8a7d6795b38648cae2bf95ddd", "title": "Accelerating Complex Analytics using Speculation"}, {"paperId": "4e193b486d9f8f014591b8069258b13b2e380f98", "title": "Toward Intelligent Query Engines"}]}
