{"paperId": "67f03207091e9707dcda98559e3760734b6d88c1", "publicationVenue": {"id": "17d7865f-0af7-472c-b174-60948bf06d11", "name": "Frontiers in Blockchain", "alternate_names": ["Front Blockchain"], "issn": "2624-7852", "url": "https://www.frontiersin.org/journals/blockchain#"}, "title": "Blockchain feasibility assessment: A quantitative approach", "abstract": "This article outlines the research and development of a blockchain assessment framework which enables the assessment of the technical suitability, high-level design, adoption approach, economic feasibility, and business value potential of a blockchain solution with a particular organization for a specific process. The framework is a comprehensive, high-level, and generic assessment approach that enables better decision-making regarding blockchain exploration. Blockchain is a novel technology with the potential to disrupt several industries through its possession of many desirable functional characteristics, including, but not limited to, immutability, transparency, decentralization, and secure. Cryptocurrencies and these desirable characteristics have created hype around blockchain, consequently leading to blockchain projects with minimal understanding of what the technology is capable of and beneficial for, resulting in excessively high failure rates. Attempts have been made by researchers to reduce these high failure rates by creating a better understanding of blockchain, as well as creating assessment approaches. However, these approaches tend to apply to specific narrow use cases, or the approach is not comprehensive and only considers one aspect of blockchain assessment. This emphasizes the need for a comprehensive and generic blockchain assessment approach to aid with better decision-making regarding blockchain within organizations. This article aims at addressing this need by creating a blockchain assessment framework to aids with deciding whether it is worthwhile investing more time, effort, and money into blockchain exploration. The context of the study is set in the introduction, this is then followed by a brief explanation of the blockchain technology. Thereafter, the blockchain assessment framework is presented, followed by a brief explanation of the demonstration and validation of the framework using a case study and expert analysis. The framework is most valuable during the initial stages of blockchain exploration and creates momentum for further blockchain exploration in an organization. The study concludes with the limitations and future research recommendations.", "venue": "Frontiers in Blockchain", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-26", "journal": {"volume": "6"}, "authors": [{"authorId": "2194015992", "name": "S. Spencer-Hicken"}, {"authorId": "2059019018", "name": "C. Schutte"}, {"authorId": "97705443", "name": "P. Vlok"}], "citations": []}
