{"paperId": "67f107cab0bb5e1073ddd3fac6237054148b1141", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "TAPP: Defining standard provenance information for clinical research data and workflows - Obstacles and opportunities", "abstract": "Data provenance has raised much attention across disciplines lately, as it has been shown that enrichment of data with provenance information leads to better credibility, renders data more FAIR fostering data reuse. Also, the biomedical domain has recognised the potential of provenance capture. However, several obstacles prevent efficient, automated, and machine-interpretable enrichment of biomedical data with provenance information, such as data heterogeneity, complexity, and sensitivity. Here, we explain how in Germany clinical data are transferred from hospital information systems into a data integration centre to enable secondary use of patient data and how it can be reused as research data. Considering the complex data infrastructures in hospitals, we indicate obstacles and opportunities when collecting provenance information along heterogeneous data processing pipelines. To express provenance data, we indicate the usage of the Fast Healthcare Interoperability Resource (FHIR) provenance resource for healthcare data. In addition, we consider already existing approaches from other research fields and standard communities. As a solution towards high-quality standardised clinical research data, we propose to develop a ’MInimal Requirements for Automated Provenance Information Enrichment’ (MIRAPIE) guideline. As a community project, MIRAPIE should generalise provenance information concepts to allow its world-wide applicability, possibly beyond the health care sector.", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-04-30", "journal": {"name": "Companion Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "2135020741", "name": "Kerstin Gierend"}, {"authorId": "2123087434", "name": "J. Wodke"}, {"authorId": "2215626319", "name": "Sascha Genehr"}, {"authorId": "2023920", "name": "Robert Gött"}, {"authorId": "2028869", "name": "Ron Henkel"}, {"authorId": "2056602911", "name": "Frank Krüger"}, {"authorId": "108706093", "name": "Markus Mandalka"}, {"authorId": "2215626353", "name": "Lea Michaelis"}, {"authorId": "2215619176", "name": "Alexander Scheuerlein"}, {"authorId": "3433070", "name": "Max Schröder"}, {"authorId": "25501628", "name": "A. Zeleke"}, {"authorId": "2460428", "name": "Dagmar Waltemath"}], "citations": [{"paperId": "4e4843265ae1df208e6804373d2d4e340cb83521", "title": "Eleven strategies for making reproducible research and open science training the norm at research institutions"}, {"paperId": "aa263df29420f4a04e8657c96ef3de6b71fc92ad", "title": "Traceable Research Data Sharing in a German Medical Data Integration Center With FAIR (Findability, Accessibility, Interoperability, and Reusability)-Geared Provenance Implementation: Proof-of-Concept Study"}, {"paperId": "9247929d752c1e241d1edfbc17118b39f2be80fa", "title": "The Status of Data Management Practices Across German Medical Data Integration Centers: Mixed Methods Study"}]}
