{"paperId": "67fa7c8b23f9b2a66a8488ab74f2c14c458bbed2", "publicationVenue": {"id": "b9083d6f-6a0b-458f-b91b-ac82b9afdf3c", "name": "ACM SIGOPS Operating Systems Review", "type": "journal", "alternate_names": ["ACM SIGOPS Oper Syst Rev", "Operating Systems Review", "Oper Syst Rev"], "issn": "0163-5980", "url": "http://portal.acm.org/sigops/newsletter"}, "title": "Positional Paper", "abstract": "Application telemetry refers to measurements taken from software systems to assess their performance, availability, correctness, efficiency, and other aspects useful to operators, as well as to troubleshoot them when they behave abnormally. Many modern observability platforms support dimensional models of telemetry signals where the measurements are accompanied by additional dimensions used to identify either the resources described by the telemetry or the business-specific attributes of the activities (e.g., a customer identifier). However, most of these platforms lack any semantic understanding of the data, by not capturing any metadata about telemetry, from simple aspects such as units of measure or data types (treating all dimensions as strings) to more complex concepts such as purpose policies. This limits the ability of the platforms to provide a rich user experience, especially when dealing with different telemetry assets, for example, linking an anomaly in a time series with the corresponding subset of logs or traces, which requires semantic understanding of the dimensions in the respective data sets.", "venue": "ACM SIGOPS Operating Systems Review", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-14", "journal": {"name": "ACM SIGOPS Operating Systems Review", "pages": "8 - 17", "volume": "56"}, "authors": [{"authorId": "40606376", "name": "Yuri Shkuro"}, {"authorId": "70027711", "name": "B. Renard"}, {"authorId": "47264639", "name": "Ashutosh Kumar Singh"}], "citations": [{"paperId": "1aa80a13379960a66ef910e70d3f18031087a285", "title": "Marine Data Observability using KPIS: An MDSE Approach"}]}
