{"paperId": "6805d300d08de89e169affba4863045ea6b0455c", "publicationVenue": {"id": "4a0a181c-3807-4883-8ac2-b0ddf5f46497", "name": "International Conference on Communication and Electronics Systems", "type": "conference", "alternate_names": ["Int Conf Commun Electron Syst", "ICCES", "Int Conf Comput Eng Syst", "International Conference on Computer Engineering and Systems"]}, "title": "A Survey of Blockchain Applications in IoT Systems", "abstract": "This paper presents an extensive study of the different ways the Internet of Things (IoT) applications exploit the recently developed blockchain technology. Even though the blockchain technology was originally presented as a security mechanism, its numerous benefits such as decentralization, immutability, persistence, anonymity and auditability can be used by IoT systems in different ways. More specifically, we classify the ways IoT systems exploit blockchain into three categories: resource management, decentralized information sharing, and IoT security. The comprehensive study of the applications of the blockchain technology in the different IoT domains presented in this paper sheds the light on the future research directions in the integration of the two technologies.", "venue": "International Conference on Communication and Electronics Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-12-01", "journal": {"name": "2019 14th International Conference on Computer Engineering and Systems (ICCES)", "pages": "83-87"}, "authors": [{"authorId": "31276611", "name": "Diaa A. Noby"}, {"authorId": "143799905", "name": "Ahmed K. F. Khattab"}], "citations": [{"paperId": "8814b38aa6bc71f3bb69e92592705c88576c91cf", "title": "Blockchain-Enabled Lightweight Fine-Grained Searchable Knowledge Sharing for Intelligent IoT"}, {"paperId": "a53c60b4f3d0c18666ff42a22f469d070e22338e", "title": "CD-PBFT: Incentive-based Efficient Blockchain Consensus Mechanism for Web 3.0"}, {"paperId": "31f42be573c81bf17f4db1bf33a314c1dd60dfd0", "title": "Blockchain-Based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}, {"paperId": "33bdcc0e3e7dccb8102ecef7032e123f940c6ac1", "title": "Blockchain Based Approach for tackling Deepfake videos"}, {"paperId": "4be907dbde12c286f5ae85d16cfaf7afb7a9bdf4", "title": "A Systematic Literature Review of Lightweight Blockchain for IoT"}, {"paperId": "b24d7a0afb252fdf8451de53504c03e6f42c627d", "title": "Blockchain-based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}]}
