{"paperId": "680ae7482a8a1d563c2beb960d52a6d56b401a5d", "publicationVenue": null, "title": "Inventory Management Model for The Packaging Process of Perishable Foods for Export in Latin America", "abstract": "This article offers a solution model to reduce stock breaks in companies dedicated to the export of fruit, with 32% of incidents. Exporting companies often have difficulties during the packaging process because there is a shortage of inputs for the process. Much research points to the importance of good inventory planning and management; however, it is not mentioned when the company already has stock breaks and how to generate solutions. For this reason, a model was developed to improve inventory management by implementing the DDMRP system, integrated standard work and process standardization. The study will take place in an agro-industrial export company located in Huaral and will seek to reduce stock breakage generated in the inputs required for the packaging process. For the validation of the model, simulations will be carried out to determine the amounts of materials required for packaging, such as 4 and 10 kg boxes and ethylene bags. This obtaining the percentage of how much will be the reduction of stock breaks, implementing the aforementioned tools. The expected result of this research will be a reduction in breakage rates by implementation cycles of approximately 7.8%, thus demonstrating that with the implementation emergency purchases and shrinkage were reduced, optimizing purchase orders and the process of company packaging.", "venue": "ICIBE", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-09-22", "journal": {"name": "Proceedings of the 2023 9th International Conference on Industrial and Business Engineering"}, "authors": [{"authorId": "2276613391", "name": "Celine Kelma Carranza"}, {"authorId": "2276614667", "name": "Alvaro Lizardo Eyzaguirre"}, {"authorId": "1397128195", "name": "F. Maradiegue"}], "citations": []}
