{"paperId": "68147f16a750daa8cf8e1d4f00a4cb5e0cd04ba6", "publicationVenue": null, "title": "Multiple Tiered Treatments Optimization with Causal Inference on Response Distribution", "abstract": "For many business applications, event driven promotion programs are commonly used means for achieving business targets and performances such as customer experience and revenue etc. Traditional recommendation methods mainly focus on predicting the click-through-rate and can not handle this scenario well since most of driven promotion are multi-tiered programs. Moreover, promotion programs will incur costs, so we need to predict not only the effect of recommending programs to users, but also the cost of programs. So it is essentially an NP-hard optimization problem with a budget constraint. Recently, there are some studies that conducts causal inferences for analyzing the effects of various designed programs on users. However, causal inference models mostly address the expected effects of treatments instead of studying the probabilistic distribution of the heterogeneous effects on users, thus unable to help on accurate estimation of the program costs driven by events. In this paper, we argue that the expected treatment effects can be learned with the response distribution, and proposed a multi-task learning model for composite causal inference on both treatment effects and response distribution, which allows decision makers to make trade-off decisions on the return and cost of programs in an end-to-end manner and to optimize their policy and strategy.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "962-971"}, "authors": [{"authorId": "2203052603", "name": "Tao Huang"}, {"authorId": "2141309938", "name": "Qingyang Li"}, {"authorId": "144559512", "name": "Zhiwei Qin"}], "citations": []}
