{"paperId": "6815744a53cd890ccdc6d5489955b67281a407cb", "publicationVenue": null, "title": "Classification of satellite images using Rp fuzzy c means for unsupervised classification algorithm", "abstract": "The computational capacities increase, the decrease of equipment costs, the growing need for information, among other reasons; It makes possible the increasingly common access to satellite data. In this context. The investigation of techniques related to remote sensing becomes very important because it provide important information about the Earth’s surface. Currently, segmentation is an essential step in applications that make use of satellite images. However, the main problem is: \"the data in a multispectral image shows a low statistical separation and a long quantity of data\". In this article we propose to improve the balancing of elements for the clusters. We use a new term to estimate the influence that each element must have for the each cluster. This new term can be understood as a repulsion factor and aims to increase the differences between groups. This modification is inspired by new term that was integrated into the NFCC algorithm (New Fuzzy Centroid Cluster).For the tests, we use the internal validity of the cluster to compare the algorithms. Using the index we measure the characteristics of the segmentation and corroborate them with the final visual results. Therefore, we conclude that the addition of this new term allows balancing the elements for each group. As a result we conclude that the new term organizes the elements better because it avoids a fast convergence of the algorithm. Finally, the results show that this new factor generates clusters with lower entropy and greater similarity between the elements.", "venue": "2019 IEEE Colombian Conference on Applications in Computational Intelligence (ColCACI)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE Colombian Conference on Applications in Computational Intelligence (ColCACI)", "pages": "1-5"}, "authors": [{"authorId": "2071114663", "name": "Luis Mantilla"}], "citations": [{"paperId": "0a4aea5aea9f9008bccb23efe97889ab081de106", "title": "Data Classification Using Combination of Five Machine Learning Techniques"}]}
