{"paperId": "681832d89dae845ef06ebabfa2d539375f6f51bd", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Demand-Aware Erasure Coding for Distributed Storage Systems", "abstract": "Distributed storage systems provide cloud storage services by storing data on commodity storage servers. Conventionally, data are protected against failures of such commodity servers by replication. Erasure coding consumes less storage overhead than replication to tolerate the same number of failures and thus has been replacing replication in many distributed storage systems. However, with erasure coding, the overhead of reconstructing data from failures also increases significantly. Under the ever-changing workload where data accesses can be highly skewed, it is challenging to deploy erasure coding with appropriate values of parameters to achieve a well trade-off between storage overhead and reconstruction overhead. In this paper, we propose Zebra, a framework that encodes data by their demand into multiple tiers that deploy erasure codes with different values of parameters. Zebra automatically determines the number of such tiers and dynamically assigns erasure codes with optimal values of parameters into corresponding tiers. With Zebra, a flexible trade-off between storage overhead and reconstruction overhead is achieved with multiple tiers. When demand changes, Zebra adjusts itself with a marginal amount of network transfer. We demonstrate that Zebra can work with two representative families of erasure codes in distributed storage systems, Reed-Solomon codes and local reconstruction codes.", "venue": "IEEE Transactions on Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-14", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "532-545", "volume": "9"}, "authors": [{"authorId": "46276037", "name": "Jun Yu Li"}, {"authorId": "91269142", "name": "Baochun Li"}], "citations": [{"paperId": "be37a418c8c08083e1cd5c30de0816d82338bf84", "title": "Advanced Elastic Reed–Solomon Codes for Erasure-Coded Key–Value Stores"}, {"paperId": "fe69446e711fda1ad35378d276c99f91a7fa7797", "title": "RAPIDS: Reconciling Availability, Accuracy, and Performance in Managing Geo-Distributed Scientific Data"}, {"paperId": "8a49682692786b4d6f2c26cccb5d31eb7a321c5b", "title": "CPU: Cross-Rack-Aware Pipelining Update for Erasure-Coded Storage"}, {"paperId": "582ca060a72a4d8bb41f5586f17f22651ff32a89", "title": "Optimal Repair-Scaling Trade-off in Locally Repairable Codes: Analysis and Evaluation"}, {"paperId": "f383a7712c309754c7fe19295de8ffb683bbc31e", "title": "ER-Store: A Hybrid Storage Mechanism with Erasure Coding and Replication in Distributed Database Systems"}, {"paperId": "f06b3aa491185c2d3b1a20833b1820541eafc724", "title": "The Influence of Entrepreneurs’ Psychological Capital on Their Deviant Innovation Behavior"}, {"paperId": "247329cf403d483b8dafbf03b68739a922c8f2f6", "title": "Archipelago: A Medical Distributed Storage System for Interconnected Health"}, {"paperId": "cfeb90accdf98fbaa517e5a01e3035119f1799fa", "title": "Optimized Proactive Recovery in Erasure-Coded Cloud Storage Systems"}]}
