{"paperId": "682884b4e88e4138943d6579d8eac4df064e8ff7", "publicationVenue": {"id": "142347a8-a3f6-4ce4-bc56-09bc8fc9461d", "name": "Frontiers in Medicine", "type": "journal", "alternate_names": ["Frontiers of Medicine", "Front Med", "Fronteras en Medicina"], "issn": "2296-858X", "alternate_issns": ["2095-0217", "2618-2459"], "url": "https://www.frontiersin.org/journals/medicine", "alternate_urls": ["https://link.springer.com/journal/volumesAndIssues/11684", "http://link.springer.com/journal/11684", "http://www.frontiersin.org/Medicine", "http://journal.frontiersin.org/journal/medicine", "http://www.fronteras.com.ar/"]}, "title": "A Review of Artificial Intelligence and Robotics in Transformed Health Ecosystems", "abstract": "Health care is shifting toward become proactive according to the concept of P5 medicine–a predictive, personalized, preventive, participatory and precision discipline. This patient-centered care heavily leverages the latest technologies of artificial intelligence (AI) and robotics that support diagnosis, decision making and treatment. In this paper, we present the role of AI and robotic systems in this evolution, including example use cases. We categorize systems along multiple dimensions such as the type of system, the degree of autonomy, the care setting where the systems are applied, and the application area. These technologies have already achieved notable results in the prediction of sepsis or cardiovascular risk, the monitoring of vital parameters in intensive care units, or in the form of home care robots. Still, while much research is conducted around AI and robotics in health care, adoption in real world care settings is still limited. To remove adoption barriers, we need to address issues such as safety, security, privacy and ethical principles; detect and eliminate bias that could result in harmful or unfair clinical decisions; and build trust in and societal acceptance of AI.", "venue": "Frontiers in Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-06", "journal": {"name": "Frontiers in Medicine", "volume": "9"}, "authors": [{"authorId": "2251210", "name": "K. Denecke"}, {"authorId": "2080727132", "name": "C. Baudoin"}], "citations": [{"paperId": "98c0f75caa42ea75860b9a2e416ffcb540d3379d", "title": "Resistance to artificial intelligence in health care: Literature review, conceptual framework, and research agenda"}, {"paperId": "6eb98178e951b80f559131a401eb50513a8fadd9", "title": "Revolutionizing drug discovery: The impact of artificial intelligence on advancements in pharmacology and the pharmaceutical industry"}, {"paperId": "05bba1530b951c85fa2263c4c26374a4518eb25c", "title": "Artificial Intelligence in Medicine"}, {"paperId": "5490cde1501c4940056f96075aec876bc4dd456a", "title": "Advanced Power Converters and Learning in Diverse Robotic Innovation: A Review"}, {"paperId": "98476b613bc88040f62f56994f7445431b97db3e", "title": "Robotics in Medical Domain: The Future of Surgery, Healthcare and Imaging"}, {"paperId": "fefc735fd87d21ce3f2555bdbdd72af1aa729d9d", "title": "Innovative Robotic Technologies and Artificial Intelligence in Pharmacy and Medicine: Paving the Way for the Future of Health Care - A Review"}, {"paperId": "86b9df4f276d19a63d87bf67a6c450e71af8befe", "title": "Designing and Managing Advanced, Intelligent and Ethical Health and Social Care Ecosystems"}, {"paperId": "faffc96e99b608f3213bae141084b195655259ff", "title": "Design and development Virtual Doctor Robot for contactless monitoring of patients during COVID-19"}, {"paperId": "ffe72742350147b1c7e09b06945bbf707272ccc6", "title": "Parametrical T-Gate for Joint Processing of Quantum and Classic Optoelectronic Signals"}, {"paperId": "ceeaac4ec83dbb30d5aa69e56bbc061850d570d2", "title": "Artificial Intelligence Aided Ethics in Frontier Research"}, {"paperId": "8a44c6b4bb43f68c2e85519f9734e1cc16c7c4cb", "title": "Artificial Intelligence (AI) Based Interactive Smart Robot for Elderly People Health Monitoring System"}, {"paperId": "ef6eca30462092f294c2589b470ffc791a155699", "title": "Current Trends in Incubator Control for Premature Infants with Artificial Intelligence Based on Fuzzy Logic Control: Systematic Literature Review"}, {"paperId": "01bceabf2f5c5df23871407ab568a407f5d63086", "title": "Artificial Intelligence with Robotics- A Bibliometric Study"}, {"paperId": "bde1b6a8b2fbb29e8ef6c12d5c17b74fc1220c1d", "title": "One Digital Health Intervention for Monitoring Human and Animal Welfare in Smart Cities: Viewpoint and Use Case"}, {"paperId": "c3cfd43241e1f7d1a94ae50a8763ade2ed6843bb", "title": "Towards Autonomous Healthcare: Integrating Artificial Intelligence (AI) for Personalized Medicine and Disease Prediction"}]}
