{"paperId": "6829d6f882b2cd9d3d91d012c397ff795b96883d", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Convolutional neural network and its pretrained models for image classification and object detection: A survey", "abstract": "At present, in the age of computers and automation of services, deep learning (DL) technology, mainly the subset of machine learning (ML) and artificial intelligence (AI), is expressively used in innumerable domains of computer vision such as data analysis, image recognition, classification, natural language processing, and many more. It has become the foremost choice of researchers as of its effectiveness in producing decent results. This paper presents detailed and analytical literature starting from the very elementary level to the recent trends of this trending technology while focusing on the most used DL model, that is, convolutional neural network and its pretrained models for image classification and object detection. It also reviews diverse existing current literature based on this. Further, a brief introduction of AI, ML, and DL has also been presented, making the foundation for the readers. As pretrained models continuously give an upper edge to DL over ML and other technologies, 23 most popular pretrained models with their architectural diagrams have also been presented. This paper aims to summarize and analyze all the concepts used to formulate DL and its models. Also, we have emphasized more on the GoogleNet models and the entire Inception modules in detail. Finally, the fascinating applications and discussion on integral components of DL have been presented. This paper will definitely draw the attention of the students and researchers working in the area of DL and its models.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-13", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2059690899", "name": "Biswajit Jena"}, {"authorId": "50767915", "name": "G. K. Nayak"}, {"authorId": "46708580", "name": "Sanjay Saxena"}], "citations": [{"paperId": "9665d39084cd93f511210cab6ccf045c7ec7aede", "title": "A new intelligent approach of surface roughness measurement in sustainable machining of AM-316L stainless steel with deep learning models"}, {"paperId": "701e85f90d6156d5ab1a5504e5c85525c60dfab5", "title": "MGFEEN: a multi-granularity feature encoding ensemble network for remote sensing image classification"}, {"paperId": "a77f25c4fdf26ce5744abab4afb342732d9e7c7a", "title": "WU-Net++: A novel enhanced Weighted U-Net++ model for brain tumor detection and segmentation from multi-parametric magnetic resonance scans"}, {"paperId": "1305ea6f6cc8f629072a98e337ddc2b8ed1ec59d", "title": "Deep Learning Based Modulation Classification for Underwater Optical Wireless Communication System"}, {"paperId": "109457cdad4c5c3d67620545480391657b798315", "title": "A Deep Learning Based Fault Diagnosis Method Combining Domain Knowledge and Transfer Learning"}, {"paperId": "2fd081f47834495c6b6fdce8acc9d6595105ab1b", "title": "Enhancing Interstitial Lung Disease Diagnosis Through Deep Learning Frameworks"}, {"paperId": "fcd8d0f648658b99049dc90cf86693fd9a708e6a", "title": "Automated deep learning system for power line inspection image analysis and processing: Architecture and design issues"}, {"paperId": "fc38e4a90fc0a2589466b913c0259ec001ca2723", "title": "Slope Failure and Landslide Detection in Huangdao District of Qingdao City Based on an Improved Faster R-CNN Model"}, {"paperId": "25c568619510356062c7d13b255d621ae0811495", "title": "SAFEPA: An Expandable Multi-Pose Facial Expressions Pain Assessment Method"}, {"paperId": "2fb0744dc0fcb8347842cc61c8fc751c3556090b", "title": "Prediction of O-6-methylguanine-DNA methyltransferase and overall survival of the patients suffering from glioblastoma using MRI-based hybrid radiomics signatures in machine and deep learning framework"}, {"paperId": "a4d6049aaf96c98f1cab55b85e905bba5d258339", "title": "Fused deep learning paradigm for the prediction of o6-methylguanine-DNA methyltransferase genotype in glioblastoma patients: A neuro-oncological investigation"}, {"paperId": "07868ac0732ef36821692d00a4572341f63ed066", "title": "Comparison of Support Vector Machines and Deep Learning for Plant Classification in Smart Agriculture Applications"}, {"paperId": "11410dcb9e0656e36b9ed713c6c6c1944885ec43", "title": "Using Knowledge Transfer for Neural Network Architecture Optimization with Improved Training Efficiency"}, {"paperId": "cf5cf43fc265d342559bb0151138ee033fd353de", "title": "An Exhaustive Analytical Study of U-Net Architecture on Two Diverse Biomedical Imaging Datasets of Electron Microscopy Drosophila ssTEM and Brain MRI BraTS-2021 for Segmentation"}, {"paperId": "a18601a9b3bbb6c786163735c53790200d01aa1b", "title": "Brain Tumor Characterization Using Radiogenomics in Artificial Intelligence Framework"}]}
