{"paperId": "682e10ad9c4092c962e2cb77726f33c9e3cc7132", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "Integrating Lightweight Compression Capabilities into Apache Arrow", "abstract": "With the ongoing shift to a data-driven world in almost all application domains, the management and in particular the analytics of large amounts of data gain in importance. For that reason, a variety of new big data systems has been developed in recent years. Aside from that, a revision of the data organization and formats has been initiated as a foundation for these big data systems. In this context, Apache Arrow is a novel cross-language development platform for in-memory data with a standardized language-independent columnar memory format. The data is organized for efficient analytic operations on modern hardware, whereby Apache Arrow only supports dictionary encoding as a specific compression approach. However, there exists a large corpus of lightweight compression algorithms for columnar data which helps to reduce the necessary memory space as well as to increase the processing performance. Thus, we present a flexible and language-independent approach integrating lightweight compression algorithms into the Apache Arrow framework in this paper. With our so-called ArrowComp approach, we preserve the unique properties of Apache Arrow, but enhance the platform with a large variety of lightweight compression capabilities.", "venue": "International Conference on Data Technologies and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "55-66"}, "authors": [{"authorId": "27226616", "name": "Juliana Hildebrandt"}, {"authorId": "1694689", "name": "Dirk Habich"}, {"authorId": "7337091", "name": "Wolfgang Lehner"}], "citations": []}
