{"paperId": "6832036db3553c983d981eb42bb70d117f958228", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Progressive Evaluation of Queries over Untagged Data", "abstract": "Modern information systems often collect raw data in the form of text, images, video, and sensor readings. Such data needs to be further interpreted/enriched prior to being analyzed. Enrichment is often a result of automated machine learning and or signal processing techniques that associate appropriate but uncertain tags with the data. Traditionally, with the notable exception of a few systems, enrichment is considered to be a separate pre-processing step performed independently prior to data analysis. Such an approach is becoming increasingly infeasible since modern data capture technologies enable creation of very large data collections for which it is computationally difficult/impossible and ultimately not beneficial to derive all tags as a preprocessing step. Hence, approaches that perform tagging at query/analysis time on the data of interest need to be considered. This paper explores the problem of joint tagging and query processing. In particular, the paper considers a scenario where tagging can be performed using several techniques that differ in cost and accuracy and develops a progressive approach to answering Select-Project-Join (SPJ) queries (with a restricted version of the join predicates) that enriches the right data to the right degree so as to maximize the quality of the query results. The experimental results show that the proposed approach performs significantly better compared to baseline approaches.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-30", "journal": {"name": "ArXiv", "volume": "abs/1805.12033"}, "authors": [{"authorId": "2028613607", "name": "Dhrubajyoti Ghosh"}, {"authorId": "3304997", "name": "Roberto Yus"}, {"authorId": "3193105", "name": "Yasser Altowim"}, {"authorId": "144156242", "name": "S. Mehrotra"}], "citations": [{"paperId": "ccebd0a61e9bcdeb672f8c1b4e933482092b2de3", "title": "Supporting Complex Query Time Enrichment For Analytics"}]}
