{"paperId": "68393c6630a5586afc0b473e911248bd0032da33", "publicationVenue": null, "title": "Big Data in Sports: A Bibliometric and Topic Study", "abstract": "Abstract Background: The development of the sports industry was impacted by the era of Big Data due to the rapid growth of information technology. Unfortunately, that has become an increasingly challenging Issue. Objectives: The purpose of the research was to analyze the scientific production of Big Data in sports and sports-related activities in two databases, Web of Science and Scopus. Methods/Approach: Bibliometric analysis and topic mining were done on 51 articles selected after four exclusion criteria (written in English, journal articles, the final stage of publication, and a detailed review of all full texts). The software tool used was Statistica Data Miner. Results: We found that the first articles appeared in Scopus in 2013 and WoS in 2014. USA and China are countries which produced the most articles. The most common research areas in WoS and Scopus are Public environmental and occupational health, Medicine, Environmental science ecology, and Engineering. Conclusions: We conducted that further research and literature review will be required as this is a broad and new topic.", "venue": "Business Systems Research Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-01", "journal": {"name": "Business Systems Research Journal", "pages": "19 - 34", "volume": "13"}, "authors": [{"authorId": "2136565072", "name": "A. Šuštaršič"}, {"authorId": "80691650", "name": "M. Videmšek"}, {"authorId": "10416051", "name": "D. Karpljuk"}, {"authorId": "51007592", "name": "I. Miloloza"}, {"authorId": "37155613", "name": "M. Meško"}], "citations": [{"paperId": "5cf8704543fcfa056222571259805ef5f1df8636", "title": "Cricket performance predictions: a comparative analysis of machine learning models for predicting cricket player’s performance in the One Day International (ODI) world cup 2023"}, {"paperId": "4e0b0eb659650d21cff97f1a3729263978538c54", "title": "The value and implementation path of smart media technology application in the cultural heritage of ethnic traditional sports"}, {"paperId": "9554b5ccc336b54893b531d8954f4dad909e3a21", "title": "Enhanced Sports Predictions: A Comprehensive Analysis of the Role and Performance of Predictive Analytics in the Sports Sector"}, {"paperId": "a64ffa41e0bebcd3771dce1100b93d4c0b7ad242", "title": "Assessing the Appraisal of Research Quality in Social Sciences and Humanities: A Case Study of the University of Montenegro"}, {"paperId": "6e79e2529761c5376d8cccc43ab9dfaea097d83f", "title": "Reproducibility and Scientific Integrity of Big Data Research in Urban Public Health and Digital Epidemiology: A Call to Action"}, {"paperId": "87a9fcdbfdce61d9c7d9b5dbcf405a60faec124a", "title": "Management of the Sports Industry for Ensuring the Public Health: Prospect of Implementing the Innovations"}]}
