{"paperId": "683b727153f7e8e974f0fd63d4bc81d39a844422", "publicationVenue": {"id": "74f72915-6d78-48b3-85dc-5f79881ab60b", "name": "International Conference on Data Science in Cyberspace", "type": "conference", "alternate_names": ["DSC", "Int Conf Data Sci Sp", "IEEE Conference Dependable and Secure Computing", "IEEE Conference on Dependable and Secure Computing", "IEEE Conf Dependable Secur Comput", "IEEE International Conference on Data Science in Cyberspace", "IEEE Int Conf Data Sci Sp"]}, "title": "RDDShare: Reusing Results of Spark RDD", "abstract": "In recent years, Spark has become a hotspot for big data processing. For a single user, Spark provides the cache method to share the results between the jobs in a single application. When accessed concurrently by multi users, there may exist same computation among the submitted applications, however, Spark does not provide a method to share computing results between applications. In traditional databases, one way to optimize the performance of queries is to cache part or all of the results of a query to share with other requests. Based on this, we propose RDDShare system based on Spark SQL to manage the cache and reuse the results. Finally, the results of simulate experiments show that RDDShare system can significant optimize the query performance of Spark SQL.", "venue": "International Conference on Data Science in Cyberspace", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2016-06-01", "journal": {"name": "2016 IEEE First International Conference on Data Science in Cyberspace (DSC)", "pages": "370-375"}, "authors": [{"authorId": "101811168", "name": "Huang Chao-qiang"}, {"authorId": "2102381483", "name": "Yang Shu-qiang"}, {"authorId": "73315565", "name": "Tang Jian-chao"}, {"authorId": "2150921386", "name": "Yan Zhou"}], "citations": [{"paperId": "c2711ccefe083cad9e4e2a6962f8307e196f8eb4", "title": "A gray-box modeling methodology for runtime prediction of Apache Spark jobs"}, {"paperId": "e6e94223fe90c06374f78f5ac48c53c40650d473", "title": "Improvement of Kafka Streaming Using Partition and Multi-Threading in Big Data Environment"}, {"paperId": "0ce4f0d426557bb8b6350a801bdcecb196877363", "title": "Cost-Based Sharing and Recycling of (Intermediate) Results in Dataflow Programs"}]}
