{"paperId": "683fae893ec06aa61f552190fa96efffe635e414", "publicationVenue": {"id": "4d91dc0b-e9c8-42a5-a30c-e91180c0b45e", "name": "Computational Communication Research", "type": "journal", "alternate_names": ["Comput Commun Res"], "issn": "2665-9085", "url": "https://www.aup.nl/en/journal/computational-communication-research", "alternate_urls": ["https://computationalcommunication.org/ccr"]}, "title": "A tool for tracking the propagation of words on Reddit", "abstract": "The data-driven study of cultural information diffusion in online (social) media is currently an active area of research. The availability of data from the web thereby generates new opportunities to examine how words propagate through online media and communities, as well as how these diffusion patterns are intertwined with the materiality and culture of social media platforms. In support of such efforts, this paper introduces an online tool for tracking the consecutive occurrences of words across subreddits on Reddit between 2005 and 2017. By processing the full Pushshift.io Reddit comment archive for this period (Baumgartner et al., 2020), we are able to track the first occurrences of 76 million words, allowing us to visualize which subreddits subsequently adopt any of those words over time. We illustrate this approach by addressing the spread of terms referring to famous internet controversies, and the percolation of alt-right terminology. By making our instrument and the processed data publically available, we aim to facilitate a range of exploratory analyses in computational social science, the digital humanities, and related fields.", "venue": "Computational Communication Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-01", "journal": {"name": "Computational Communication Research"}, "authors": [{"authorId": "71261017", "name": "Tom Willaert"}, {"authorId": "150266649", "name": "Paul Van Eecke"}, {"authorId": "2210307334", "name": "Jeroen Van Soest"}, {"authorId": "2972424", "name": "Katrien Beuls"}], "citations": [{"paperId": "ec0de3c4a95dbc46bc6b98d6d38cf1b9a3ec4036", "title": "On the Vernacular Language Games of an Antagonistic Online Subculture"}, {"paperId": "98ee75ff0629d964650dc85f7a0e4289126b7542", "title": "An Opinion Facilitator for Online News Media"}, {"paperId": "c71b45823fcbe3ba32f75e7063d39a35eebd4ce8", "title": "Detecting Traces of Narrative Evolution on Telegram: Inductive Methods from Corpus-Based Discourse Analysis"}]}
