{"paperId": "6843a5ab329069b7a152c9ca0081bae9366f7c40", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Detecting Natural Hazard-Related Disaster Impacts with Social Media Analytics: The Case of Australian States and Territories", "abstract": "Natural hazard-related disasters are disruptive events with significant impact on people, communities, buildings, infrastructure, animals, agriculture, and environmental assets. The exponentially increasing anthropogenic activities on the planet have aggregated the climate change and consequently increased the frequency and severity of these natural hazard-related disasters, and consequential damages in cities. The digital technological advancements, such as monitoring systems based on fusion of sensors and machine learning, in early detection, warning and disaster response systems are being implemented as part of the disaster management practice in many countries and presented useful results. Along with these promising technologies, crowdsourced social media disaster big data analytics has also started to be utilized. This study aims to form an understanding of how social media analytics can be utilized to assist government authorities in estimating the damages linked to natural hazard-related disaster impacts on urban centers in the age of climate change. To this end, this study analyzes crowdsourced disaster big data from Twitter users in the testbed case study of Australian states and territories. The methodological approach of this study employs the social media analytics method and conducts sentiment and content analyses of location-based Twitter messages (n = 131,673) from Australia. The study informs authorities on an innovative way to analyze the geographic distribution, occurrence frequency of various disasters and their damages based on the geo-tweets analysis.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-12", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "3266895", "name": "Tan Yigitcanlar"}, {"authorId": "2044511078", "name": "Massimo Regona"}, {"authorId": "89336731", "name": "N. Kankanamge"}, {"authorId": "39799687", "name": "Rashid Mehmood"}, {"authorId": "2149830913", "name": "Justin D’Costa"}, {"authorId": "2149832968", "name": "Samuel Lindsay"}, {"authorId": "2150569109", "name": "Scott Nelson"}, {"authorId": "2149831178", "name": "Adiam Brhane"}], "citations": [{"paperId": "60101f3f1c6cf45e69f8c9336f811ea34be281b2", "title": "Study on spatiotemporal dynamic characteristics of precipitation and causes of waterlogging based on a data-driven framework."}, {"paperId": "3e9b9685ee8d9081d9fd38b6e2c4958ad384da31", "title": "Classification and detection of natural disasters using machine learning and deep learning techniques: A review"}, {"paperId": "bdf1727dec95413393bc7ceddb90c1fb3f863bca", "title": "A Web and Mobile Application to Identify the Availability of Drinking Water Information During a Water Crisis"}, {"paperId": "b1503de5449637ece1b91392ccf9693a0559bd3e", "title": "Mining and analysis of public sentiment during disaster events: The extreme rainstorm disaster in megacities of China in 2021"}, {"paperId": "9a61382eaae0bd941da6f6f8bdb40b102a76ccc4", "title": "Religious and racial tension breakout: an online pre-crisis detection strategy via sentiment analysis for riot crime prevention"}, {"paperId": "1c6730765588ab52b9eb2f58fb0cc56092df9159", "title": "Disaster Detection and Alert Generation for Smart City Scenario using Deep Learning Technique"}, {"paperId": "a174c41205b32adc5e6c7166f1b38ab8cd2b1efb", "title": "LidSonic V2.0: A LiDAR and Deep-Learning-Based Green Assistive Edge Device to Enhance Mobility for the Visually Impaired"}, {"paperId": "b667efb281e31c03a0818093c2c3150b0511c441", "title": "Assessment of urban air quality from Twitter communication using self-attention network and a multilayer classification model"}, {"paperId": "6528603f874ff8ee0fc1dca670c924e9c154eec7", "title": "Data Analysis in Social Networks for Agribusiness - A Systematic Mapping Study"}, {"paperId": "ae9c195ba7f48b86a6e4485e93cfcbea4e26db0b", "title": "How do Australians use social media during natural hazards? A survey"}, {"paperId": "e12be74aa890e091d691d963bf9877845f3249c5", "title": "Discovering Urban Governance Parameters for Online Learning in Saudi Arabia During COVID-19 Using Topic Modeling of Twitter Data"}, {"paperId": "e2a5d8824f12b14a4599e9c0d2864fbd98e0f4a7", "title": "Deep Journalism and DeepJournal V1.0: A Data-Driven Deep Learning Approach to Discover Parameters for Transportation"}, {"paperId": "157600e0348b99bbc4187b95fd0c438a2189a841", "title": "Imtidad: A Reference Architecture and a Case Study on Developing Distributed AI Services for Skin Disease Diagnosis over Cloud, Fog and Edge"}, {"paperId": "f765e88bc0e1892666f05b1bc3ca104b040b2619", "title": "Data Analysis in Social Networks for Agribusiness: A Systematic Review"}]}
