{"paperId": "684ad3b5b788b7aa056c29236385725db65edb10", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Practical Skills of Business English Correspondence Writing Based on Data Mining Algorithm", "abstract": "English correspondence writing has become a necessary skill for every scientific researcher and high-tech talents. An English correspondence writing auxiliary writing system can help nonnative English speakers make up for the lack of professional expression. The key factor of business English correspondence writing system is the construction of knowledge base. To improve the business English correspondence writing knowledge base, we need to mine frequent patterns of sentences in each category. The purpose of this topic is to improve and supplement the knowledge base for the business English correspondence writing system and propose frequent pattern mining for sentences in each category, so as to improve the writing knowledge base for the business English correspondence writing system. Firstly, we crawl a large number of business English letters and telegrams from the Internet, extract the relevant summary information, then store it, and preliminarily construct a corpus based on sentences. Then, we do some research on the structure of business English correspondence abstracts, mark the sentences in the corpus and count the relevant information, and have a certain understanding of their writing methods. Finally, we mine frequent patterns for sentences in each category, so as to improve the knowledge base of summary writing for the business English correspondence writing system. In the experiment, we use the classical FP growth algorithm as the mining method. The experiment shows that the frequent patterns between 3 and 6 words have been mined to a certain extent. By gradually improving the mining strategy, the quality of mining results has been improved and the writing effect of business English correspondence of scientific researchers has been improved.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-04", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "50439205", "name": "Danqing Liu"}, {"authorId": "34098084", "name": "Hadina Habil"}], "citations": []}
