{"paperId": "6853463da9e0fc57f16b27b5a50aca39156dee70", "publicationVenue": null, "title": "Proposed HCDNA for Enhancing the Security of Marine Environment IoT Systems", "abstract": "Recently, the shipping industry and marine operations have been intensively reliable on the internet of things (IoT).IoT devices are used for the automation of shipping operations cargo tracking and security monitoring of the ships. In this paper, we focus on maintaining efficient security levels for marine communications. We propose new cryptographic methods based on the hyperchaotic sequence and the DNA sequence for image encryption. The proposed algorithm is applied to a smart buoy to enhance the security of the transmitted image through IoT systems in shipping industry monitoring. In addition, we evaluate and analyze the performance of three existing encryption algorithms for IoT (Blowfish, Advanced Encryption Standard (AES), and International Data Encryption Algorithm (IDEA)). Furthermore, a comparison was conducted between the three existing algorithms and the proposed one in terms of encryption time, correlation coefficient, and entropy before and after encryption. The simulation experiments show that the proposed cryptographic method outperforms the three existing algorithms in terms of quality, security, and robustness against noise as well as overall performance.", "venue": "2022 10th International Japan-Africa Conference on Electronics, Communications, and Computations (JAC-ECC)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-19", "journal": {"name": "2022 10th International Japan-Africa Conference on Electronics, Communications, and Computations (JAC-ECC)", "pages": "169-174"}, "authors": [{"authorId": "2209227257", "name": "Tokka Elsayed Ahmed"}, {"authorId": "1596820914", "name": "Walid A. Raslan"}, {"authorId": "2209216473", "name": "Atif Ghouniem"}, {"authorId": "1404610614", "name": "H. Abdel-Atty"}], "citations": []}
