{"paperId": "685f98fc752a6c021b9beff55b1ddec96cddb3e7", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Big Trajectory Data Mining: A Survey of Methods, Applications, and Services", "abstract": "The increasingly wide usage of smart infrastructure and location-aware terminals has helped increase the availability of trajectory data with rich spatiotemporal information. The development of data mining and analysis methods has allowed researchers to use these trajectory datasets to identify urban reality (e.g., citizens’ collective behavior) in order to solve urban problems in transportation, environment, public security, etc. However, existing studies in this field have been relatively isolated, and an integrated and comprehensive review is lacking the problems that have been tackled, methods that have been tested, and services that have been generated from existing research. In this paper, we first discuss the relationships among the prevailing trajectory mining methods and then, classify the applications of trajectory data into three major groups: social dynamics, traffic dynamics, and operational dynamics. Finally, we briefly discuss the services that can be developed from studies in this field. Practical implications are also delivered for participants in trajectory data mining. With a focus on relevance and association, our review is aimed at inspiring researchers to identify gaps among tested methods and guiding data analysts and planners to select the most suitable methods for specific problems.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "2145385207", "name": "Di Wang"}, {"authorId": "2395494", "name": "Tomio Miwa"}, {"authorId": "50735318", "name": "T. Morikawa"}], "citations": [{"paperId": "1bd0ae81774ce3af2b6659162df159c5cc51822e", "title": "Exploring the nonlinear relationships between human travel and road traffic congestions using taxi trajectory data"}, {"paperId": "7fc522485c2e244cf91df60d3f01900ce2a8eb08", "title": "Towards Regret Free Slot Allocation in Billboard Advertisement"}, {"paperId": "90122cb087c2afaebb7f652489696a3ebaea5009", "title": "Calibration of pedestrian ingress model based on CCTV surveillance data using machine learning methods"}, {"paperId": "b37b323681582fd4911a1c31c5b25aea4b7c711c", "title": "QuadGridSIM: A quadrilateral grid-based method for high-performance and robust trajectory similarity analysis"}, {"paperId": "84decb1c3a34a5c3ea4f0d9ca6343fe3d57beab2", "title": "A Big Data Approach to Augmenting the Huff Model with Road Network and Mobility Data for Store Footfall Prediction"}, {"paperId": "29c5379d4e967d313216719da402c97c1c7b1036", "title": "A Novel Semantic Representation of Airport Surface Trajectory for Taxiing Pattern Recognition"}, {"paperId": "db3139346b21bf8b12af66f2d29a913964bc928f", "title": "Modeling of Traffic Information and Services for the Traffic Control Center in Autonomous Vehicle-Mixed Traffic Situations"}, {"paperId": "11cc61660a4f4d5fd4b690f4fb949fb7e04e0cfe", "title": "Truck speed prediction with a simple two-stage neural network using GPS data and Monte Carlo (MC) dropout"}, {"paperId": "4c24a86c9f03e6b16329c3314e0cb1aaa2bd72bd", "title": "Using a Cost-Distance Time-Geographic Approach to Identify Red Deer Habitat Use in Banff National Park, Alberta, Canada"}, {"paperId": "0b3f7e35bca7bccbebdb544b0f90c88e611fca9d", "title": "A Privacy-Preserving Trajectory Mining Model"}, {"paperId": "323e2a5bc8ea811aa5b5c7f8852e1bc8c4b4f72c", "title": "Learning Representative Trajectories of Dynamical Systems via Domain-Adaptive Imitation"}, {"paperId": "870a1ac39f00d19e26ff7232b76a14a90b38fe8a", "title": "BIG TRAJECTORY DATA: A DISTRIBUTED COMPUTING PERSPECTIVE"}, {"paperId": "aa252283ce5d7f9297371bb18f6ac0067d0ca184", "title": "Movement Analytics: Current Status, Application to Manufacturing, and Future Prospects from an AI Perspective"}, {"paperId": "8aff17171e0d5a7ff2e11c176256a2fe29d88732", "title": "Application of the data mining algorithm in the clinical guide medical records"}, {"paperId": "df83667b5e9e42797312a6404724e3c7e7769a0c", "title": "Exploring the tidal effect of urban business district with large-scale human mobility data"}, {"paperId": "cee24bfaed9299885b2c565cf203cf8cf8bdcabe", "title": "SS-OCoClus: A contiguous order-aware method for semantic trajectory co-clustering"}, {"paperId": "f595fa5a83b25de44f78bff84358fe5157345ef9", "title": "gsstSIM: A high‐performance and synchronized similarity analysis method of spatiotemporal trajectory based on grid model representation"}, {"paperId": "6c868748398c7af64e0f8d2b0009f374797b298c", "title": "Statistics and Analysis of Targeted Poverty Alleviation Information Integrated with Big Data Mining Algorithm"}, {"paperId": "833d50b7404fa3c4c5289e49f76a3b2b181f6e85", "title": "Geographically and temporally weighted co-location quotient: an analysis of spatiotemporal crime patterns in greater Manchester"}, {"paperId": "4fff26072014763b41405d174a07d2427ea5be44", "title": "Releasing Differentially Private Trajectories with Optimized Data Utility"}, {"paperId": "b88a9dfc6bcf11afd3c1905fb67044bc4b3e2e82", "title": "GPS data Mining at Signalized Intersections for Congestion Charging"}, {"paperId": "a686241e4b577625920b94aa292041a1959063b0", "title": "Mining frequency-based sequential trajectory co-clusters"}, {"paperId": "80f8fc19573cbbb104c79dc5cc829ff5cdc5b841", "title": "An assessment on the performance of the shape functions in clustering based on representative trajectories of dense areas"}, {"paperId": "4650f7b2b794f9aced8f30b8a2d2cad2cc9f1813", "title": "Data Harmonization for Heterogeneous Datasets: A Systematic Literature Review"}, {"paperId": "9505195260896e6373fb1275adfb53b35c533c3e", "title": "A Deep Learning Streaming Methodology for Trajectory Classification"}, {"paperId": "89f86a915245043e1ecd7a3c462945fdde171e7b", "title": "A Survey on Deep Learning for Human Mobility"}, {"paperId": "317110f964b6af6c9527d20ce0b7c1dd1335b68d", "title": "Deep Learning for Human Mobility: a Survey on Data and Models"}, {"paperId": "3dd4bb2569083f9217af8a81ce37f14e8f0a94a0", "title": "Sequence‐based centrality measures in maritime transportation networks"}, {"paperId": "1a217cf4f5c75ae62e984ff027c54bf476b57701", "title": "TO DETERMINE STABILITY OF THE ROAD TRAIN WITH O 1-CATEGORY TRAILER Summary"}, {"paperId": "6f5bf230183d65b726fae66af53f7d189b1761de", "title": "Dynamic Allocation Method of Incentive Pool for Financial Management Teaching Innovation Team Based on Data Mining"}, {"paperId": "63c760be244332c9a83b0a61a83d1a987e2a707c", "title": "On the Detection of Moving Objects in Laser Scan Data: the Highest Point of Interest (HPOI) Method"}]}
