{"paperId": "6871900a3007724f2f7b099956d3da47bb9142a2", "publicationVenue": {"id": "85dbec6d-4818-46e7-83ce-2854cef2c43f", "name": "World journal of plastic surgery", "type": "journal", "alternate_names": ["WORLD J PLAST SURG", "World j plast surg", "WORLD JOURNAL OF PLASTIC SURGERY"], "issn": "2228-7914", "alternate_issns": ["2252-0724", "1026-2598"], "url": "http://www.wjps.ir/browse.php?amp;slc_sid=1&slc_lang=en"}, "title": "Grand Adventure of Augmented Reality in Landscape of Surgery", "abstract": "Computer as an integral part of continual advancements in medicine has experienced tremendous development to minimize the risks and improving the precision of the surgery. Our review included multi-disciplinary publications in English from 2014 to 2017 using Springer, Oxford library, Elsevier, PubMed, Google Scholar, and Springer search engines using terms of “augmented reality (AR), “plastic surgery,” and “surgery “ and “Augmented Reality Ethics and challenges”. It was shown that AR has been successfully effective in different branches of surgery, but with concerns and challenges like acceptance, privacy, different physical, security and behavioral threats. To come over them partially, a methodological approach for cyber threat landscape proactive exploration has been suggested.", "venue": "World journal of plastic surgery", "year": 2019, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "World Journal of Plastic Surgery", "pages": "135 - 145", "volume": "8"}, "authors": [{"authorId": "150104067", "name": "Fatemeh Salehahmadi"}, {"authorId": "51129441", "name": "F. Hajialiasgari"}], "citations": [{"paperId": "0269afdf12b87fa79278e3081ee7fed22626c656", "title": "Intraoperative application of mixed and augmented reality for digital surgery: a systematic review of ethical issues"}, {"paperId": "b028fb2e97e52338747b68ed2a8c6bf6f236d93b", "title": "Augmented Reality Integration in Skull Base Neurosurgery: A Systematic Review"}, {"paperId": "f1cfbf6ace75a8b805d13b75c03db06fd4b9f80d", "title": "Skin Deformation Analysis for Pre-Operative Planning of DIEAP Flap Reconstruction Surgery"}, {"paperId": "ed6e5b39eaa4165300aad333013a3ee600ee8c59", "title": "SUCCEEDING GENERATION OF AUGMENTED REALITY TECHNOLOGY IN MEDICAL EDUCATION"}, {"paperId": "c4da732482b5c61656ce361950157e0567cc0142", "title": "AUGMENTED REALITY APPLICATION FOR PULMONARY AUSCULTATION LEARNING AID"}, {"paperId": "76384f9c5f54bae7cc8b9c89d2292621d308c8e0", "title": "Exposure to an Extended Reality and Artificial Intelligence-Based Manifestations: A Primer on the Future of Hip and Knee Arthroplasty."}, {"paperId": "296266ec49380b4d6d1a99dd5a806201805daa96", "title": "A commentary on ‘augmented reality self-training system for suturing in open surgery: a randomized controlled trial’ [Int J Surg 102 (2022) 106650]"}, {"paperId": "b484847fe2ff66c4affd8e8f8c84f2960dc5848c", "title": "Implementation of Augmented Reality in Medical Education"}, {"paperId": "575e7e801f9c0fdd2d0404b1de139795d32db14c", "title": "Current and Future Photography Techniques in Aesthetic Surgery"}, {"paperId": "5bb17f78c966f0a4c00a4066af20f103b2fa5a9b", "title": "How is the Digital Surgical Environment Evolving? The Role of Augmented Reality in Surgery and Surgical Training"}, {"paperId": "03d7d474f690d00991f561d1bd866709754de690", "title": "Augmented reality in medical education: students’ experiences and learning outcomes"}, {"paperId": "8e05f4afa3710c837806c4b8116fee641f73795f", "title": "Visualizing Data Using Augmented Head Up Displays in Surgery"}, {"paperId": "269b49a9c30c2f574fe6784073331819f325a047", "title": "Industry 4.0 Disruption and Its Neologisms in Major Industrial Sectors: A State of the Art"}, {"paperId": "ff43456ffe38ccc9b18a1c1c340742e98ce91965", "title": "Plastic Surgery Lockdown Learning during Coronavirus Disease 2019: Are Adaptations in Education Here to Stay?"}, {"paperId": "b7e615713d23e53d3c98de0d64502c1226808c61", "title": "The Hype and Disruptive Technologies of Industry 4.0 in Major Industrial Sectors: A State of the Art"}, {"paperId": "e9554acb7b71fdd1aacea1479864e4d0221ff8bd", "title": "Fusion of augmented reality imaging with the endoscopic view for endonasal skull base surgery; a novel application for surgical navigation based on intraoperative cone beam computed tomography and optical tracking"}, {"paperId": "478dc44a340d17bd3de2b8fcf3137329da023898", "title": "Wearable Augmented Reality Application for Shoulder Rehabilitation"}]}
