{"paperId": "68a31515c2386b2ee1a08b50c1868adff04d32ba", "publicationVenue": null, "title": "BIM-based Live Sensor Data Visualization using Virtual Reality for Monitoring Indoor Conditions", "abstract": "This paper proposes a method for an automated live sensor data visualization of building indoor environment conditions using a VR system. The proposed method is based on the integration of environmental sensors, BIM, and VR technology. Such integration provides an opportunity to utilize an immersive and live sensing technology for improving data visualization. In our case study, the environmental data, such as indoor air temperature, humidity, and light level are captured by sensors connected to Arduino microcontrollers. The data output of sensors obtained from Arduino units are stored onto the BIM model and transferred to the developed VR system. The developed system simultaneously visualizes numerical values of sensors’ reading together with the virtual model of the building in a VR headset. The result of the case study showed that the developed system is capable of visualizing various indoor environmental information of the building with the VR technology. It can provide users with useful information to help monitoring indoor thermal comfort conditions of the building in real-time, while performing the walkthrough in the virtual environment.", "venue": "Proceedings of the 24th Conference on Computer Aided Architectural Design Research in Asia (CAADRIA) [Volume 2]", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "Proceedings of the 24th Conference on Computer Aided Architectural Design Research in Asia (CAADRIA) [Volume 2]"}, "authors": [{"authorId": "102106806", "name": "Worawan Natephra"}, {"authorId": "1857161", "name": "A. Motamedi"}], "citations": [{"paperId": "c1bfccb97fa8cbf57a3bf39c12630f83816168c2", "title": "VRFlex: Towards the Design of a Virtual Reality Hyflex Class Model"}, {"paperId": "902152355da93f291f6eccf205a187a2ee99d374", "title": "A framework to implement augmented reality based on BIM to improve operation and maintenance of mechanical facilities of commercial complexes"}, {"paperId": "3498cf5c01438f0da60dd4a763f87f6d1479b4ce", "title": "As-is facility management approach using LiDAR-based building information modelling: a case study in Egypt"}, {"paperId": "e57390d7ec62ae7015007532a5e3430e06e28432", "title": "Improving Understanding of Biocide Availability in Facades through Immersive Analytics"}, {"paperId": "9d433f02c7bdfacc121f721cd18774c505937b4d", "title": "Designing Interfaces to Display Sensor Data: A Case Study in the Human-Building Interaction Field Targeting a University Community"}, {"paperId": "b107c8f4233145dfe392bb15332564bc61ba2418", "title": "A methodology to integrate maintenance management systems and BIM to improve building management"}, {"paperId": "d6d32d2e9ee6a0717dc4e5cbd515ebd5682d5200", "title": "Machine Learning Framework for the Sustainable Maintenance of Building Facilities"}, {"paperId": "69c8da37177872ec944726e15f62522dd7c5a120", "title": "BIM- and IoT-based virtual reality tool for real-time thermal comfort assessment in building enclosures"}, {"paperId": "c6095462d825c276242e8f6fba4aec5c8968a046", "title": "IoT Open-Source Architecture for the Maintenance of Building Facilities"}, {"paperId": "83d97435d63cd17eb21c89cbecdaa09590495f4d", "title": "Development of an IoT and BIM-based automated alert system for thermal comfort monitoring in buildings"}, {"paperId": "170e266c1eb1f63f78c1bb941543d0634a58a95c", "title": "Industry Views on BIM for Site Safety in Hong Kong"}, {"paperId": "c829a3776de10a5f726af718e99e5090f2fb9098", "title": "Human-Computer Service Interface in Industrial Monitoring Services"}]}
