{"paperId": "68a4652081b300c0db84919d3db2f80528ea3ffc", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "A library for services transparent replication", "abstract": "State Machine Replication is a well-known approach to develop fault-tolerant application. Although it seems conceptually simple, building replicated state machines is not a trivial task. The developer has to be acquainted with aspects of the inner working of the specific agreement protocol to correctly develop and deploy the replicated service (and auxiliary processes - e.g. Paxos roles), instead of focusing on the specific service. In this work we propose a replication library that facilitates the development and deployment of fault-tolerant services, and provides replication transparency to service builders. This library allows to deploy a base SMR on top of which new services can be registered at runtime. A service builder focuses on service implementation and registers the service with the base SMR to enjoy the benefits of replication. Besides separating the complexity of providing a replicated infrastructure from service implementation, multiple services share the same consensus and replication infrastructure, allowing cost amortization. According to our evaluation, this approach leads to higher overall throughput compared to the separate deployment of different SMRs over the same resources.", "venue": "ACM Symposium on Applied Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-04-08", "journal": {"name": "Proceedings of the 34th ACM/SIGAPP Symposium on Applied Computing"}, "authors": [{"authorId": "115862301", "name": "P. M. Pereira"}, {"authorId": "3039851", "name": "F. Dotti"}, {"authorId": "2952148", "name": "C. Meinhardt"}, {"authorId": "2546148", "name": "O. Mendizabal"}], "citations": [{"paperId": "754b727de9d3023f37fe6c0cd3a127ca52382c46", "title": "Proposta de uma biblioteca para replicação transparente em Sistemas Distribuı́dos utilizando JGroups"}, {"paperId": "eed7b794bc27705aa920d86bd418016b925ebc6e", "title": "Scalable and Decoupled Logging for State Machine Replication"}]}
