{"paperId": "68a59b8dbaea71175ffacde28608d6aefa74b577", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Road Accidents Detection, Data Collection and Data Analysis Using V2X Communication and Edge/Cloud Computing", "abstract": "With the improvement in transportation infrastructure and in-vehicle technology in addition to a meteoric increase in the total number of commercial and non-commercial vehicles on the road, traffic accidents may occur, which usually cause a high death toll. More than half of these deaths occur due to a delayed response by medical care providers and rescue authorities. The chances of survival of an accident victim could increase drastically if immediate medical assistance is provided at an accident location. This work proposes a low-cost accident detection and notification system, which utilizes a multi-tier IoT-based vehicular environment; principally, it uses V2X Communication and Edge/Cloud computing. In this work, vehicles are equipped with an On-Board Unit (OBU) in addition to mechanical sensors (accelerometer, gyroscope) for reliable accident detection along with a Global Positioning System (GPS) module for identification of accident location. In addition to this, a camera module is implanted on the vehicle to capture the moment when an accident takes place. In order to facilitate inter-vehicle communication (IVC), OBU in each vehicle incorporates a wireless networking interface. Once an accident occurs, a vehicle detects it and generates an alert message. It then sends the message along with the accident location to an intermediate device, placed at the edge of the vehicular network, and therefore called an edge device. Upon receiving the notification, this edge device finds the nearest hospital and makes a request for an ambulance to be dispatched immediately. It also performs some preprocessing of data and effectively acts as a bridge between the sensors installed inside the vehicle and the distant server deployed in the cloud. A significant issue that the traffic authorities are currently facing is the real-time visualization of data obtained through such environments. Wireless interfaces are usually capable of forwarding real-time sensor data; however, this feature is not yet commercially available in the OBU of the vehicle; therefore, practical implementation is carried out using the Internet of things (IoT) in order to create a network among the vehicles, the edge node, and the central server. By performing analysis on the adequate acquired data of road accidents, the constructive plans of action can be devised that may limit the death toll. In order to assist the relevant authorities in performing wholesome analysis of refined and reliable data, a dynamic front-end visualization is proposed, which is hosted in the cloud. The generated charts and graphs help the personnel at relevant organizations to make appropriate decisions based on the conclusive analysis of processed and stored data.", "venue": "Electronics", "year": 2019, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2019-08-14", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2875303", "name": "K. Khaliq"}, {"authorId": "48609932", "name": "Omer Chughtai"}, {"authorId": "81798637", "name": "A. Shahwani"}, {"authorId": "1802278", "name": "A. Qayyum"}, {"authorId": "145310067", "name": "J. Pannek"}], "citations": [{"paperId": "9a732fda44344851cb445c926cbcecdc4bb4ff12", "title": "Prioritization and scheduling in the vehicle-to-infrastructure (V2I) scheme for vanets using enhanced congestion control source based ant colony optimization"}, {"paperId": "0fd213c9bae85253928a5b798d6cec93f186b61b", "title": "Forecasting the Number of Road Accidents in Poland by Road Type"}, {"paperId": "263f218bfc777d06bf6ee82c661cf40ffd2cf708", "title": "Optimization of Traffic Accident Quantity Estimation Method Synergy of Factors Affecting Traffic Accident Quantity with Raw Values"}, {"paperId": "adc5376cb0496068c7d77b47094d0150c221b1fb", "title": "Performance Evaluation of Tilt-based Vehicle Accident Report System Using Triple Modular Redundancy"}, {"paperId": "fa3bf180f919da3b852b25aa887560ffa387e6ff", "title": "An Estimate of the Number of Accidents on Polish Highways Based on the Kind of Road"}, {"paperId": "69632a82c55821983ee1d4ed4ac69144e8f1a90a", "title": "An Intelligent IoT based Advanced Accident Detection and Sensor Fusion Categorization System"}, {"paperId": "150b457a4f87ea80a4eca0f2ff670f5f24b4c94a", "title": "Strengthening Automotive Cybersecurity: A Comparative Analysis of ISO/SAE 21434-Compliant Automatic Collision Notification (ACN) Systems"}, {"paperId": "26d494ddb9fc6aa215e93104c200e745164f7c3d", "title": "Towards C-V2X Enabled Collaborative Autonomous Driving"}, {"paperId": "8c26af864b10f29dd3cf2660e7a0a1efc348be4a", "title": "Kufast: A tool for multi-tenancy in autonomous driving testbeds"}, {"paperId": "837627166d9e2633873ab142ef81e8d1fc73408f", "title": "Intelligent accident detection system by emergency response and disaster management using vehicular fog computing"}, {"paperId": "4aa3860c291cd613d569f6d7d10d08bb6992ca74", "title": "Autonomous Wireless Sensor System for Emergency Monitoring Roads with Low Communication Coverage"}, {"paperId": "2c9c450b05a58ecdabc46df922e35001b5b4446a", "title": "A portfolio selection of internet of things (IoTs) applications for the sustainable urban transportation: A novel hybrid multi criteria decision making approach"}, {"paperId": "f42e98d363db9405996b542b5b4f17729846ce60", "title": "Accident Prevention-Based Analysis Using IoT-Interfaced LabVIEW Model"}, {"paperId": "9e0bc09d4d6b951b81955ed06151141ff26944c3", "title": "SMART CONTRACT IMPLEMENTATION USING BLOCKCHAIN IOV FOR VEHICLE ACCIDENT INVESTIGATION"}, {"paperId": "915198ca2e1b0e4477d97ac6dd061bd6491b5e7c", "title": "Service Provisioning in Edge-Cloud Continuum: Emerging Applications for Mobile Devices"}, {"paperId": "cc92402609b17d02255d265a0db90ef659e7c96f", "title": "AI-Based Accident Severity Detection Scheme for V2X Communication Beyond 5G Networks"}, {"paperId": "938eba6e694857a2ee3b80f048ee016b3924e8f2", "title": "A study of Autonomous Vehicle Behavior Decision System based on Fusion Model"}, {"paperId": "167e7f855a692090600dc36aaf8fa882473890df", "title": "Challenges, Issues, and Recommendations for Blockchain- and Cloud-Based Automotive Insurance Systems"}, {"paperId": "7907166d6fb41e71763d0f37b0688b4fb76102b7", "title": "Forecasting the number of road accidents in Poland by day of the week and the impact of pandemics and pandemic-induced changes"}, {"paperId": "918bd636e54ec53bf8db4d0dfb0a9e3933b99b8d", "title": "Forecasting the Number of Road Accidents in Polish Provinces Using Trend Models"}, {"paperId": "35c30036672917243c37f08bb5e75cc11728c604", "title": "Forecasting the number of road accidents in Poland using weather-dependent trend models"}, {"paperId": "b98094c595be1cfbe4134bdf3cf04817274d11aa", "title": "A Rapid Accident Processing Method Based on Monitoring and Cloud Technology"}, {"paperId": "90bc69a828ee8d7bd3df33b2d43c685bd1d123b1", "title": "New Way of News Dissemination Based on Big Data Analysis and Visualization Technology"}, {"paperId": "180a699608e8df7c1b4f9c2eba86a26faad99b4a", "title": "A Survey on the combined use of IoT and Edge AI to improve Driver Monitoring systems"}, {"paperId": "376436c963ad5935bbdc8a360c3df9e22fcb79d0", "title": "Smart contract based digital evidence management framework over blockchain for vehicle accident investigation in IoV era"}, {"paperId": "9d0b4bbeaa61150c633070554bed46586ddc6097", "title": "Impact of the COVID-19 pandemic on road traffic accident forecasting in Poland and Slovakia"}, {"paperId": "4305df403e125d5a1dee74cc067f10f491e18d46", "title": "SDN based V2X Networks for Disaster Management: A Systematic Literature Review"}, {"paperId": "7a491983f551808131fe0a29743b07b5606651f7", "title": "Spectral Classification Based on Deep Learning Algorithms"}, {"paperId": "7335837fc8a32e212ad677c705bd546335656087", "title": "Road traffic accidents: An overview of data sources, analysis techniques and contributing factors"}, {"paperId": "c88e79eea285bd8e9fb72fb86ced02e7771412fb", "title": "Space Air Ground Integrated Network: Coverage for Accident Monitoring"}, {"paperId": "d75ed29dba574f8893e4e0b7f725236fa5923efc", "title": "A Review: Standard Requirements for Internet of Vehicles (IoV) Safety Applications"}, {"paperId": "4612f69ce31886442fbd01e890b6bffe1cf298b0", "title": "Designing and Implementing a Reproducible Log System Using Basic Safety Message in a V2V Environment"}, {"paperId": "2359eaf2d3a1f310b8a6de95db06743065d47561", "title": "A Novel Cross-Layer V2V Architecture for Direction-Aware Cooperative Collision Avoidance"}, {"paperId": "07c985d9d6b33a9ea98e70ada377d5a21b850fed", "title": "Cloud-Based Driver Monitoring System Using a Smartphone"}, {"paperId": "f7f6ee43f077db58a79171cf1e0aaf4e4375b2a7", "title": "An Intersection Signal Control Mechanism Assisted by Vehicular Ad Hoc Networks"}, {"paperId": "7f6d042967ca4add121b2e644823510e8785f256", "title": "Bike Crash Detection using Internet of Things"}, {"paperId": "0253d5c4baa156f845b3f6e30c37b465cb9a5b28", "title": "Understand Users' Privacy Perception and Decision of V2X Communication in Connected Autonomous Vehicles"}, {"paperId": "4f5f7d7805610d5d5512f8ca824101e35e25f0bb", "title": "FedRD: Privacy-preserving adaptive Federated learning framework for intelligent hazardous Road Damage detection and warning"}]}
