{"paperId": "68afe9756c280dbfb8ce600ffc99c3cb74080d04", "publicationVenue": null, "title": "RASTER DATA PARTITIONING FOR SUPPORTING DISTRIBUTED GIS PROCESSING", "abstract": "Abstract. In the geospatial sector big data concept also has already impact. Several studies facing originally computer science techniques applied in GIS processing of huge amount of geospatial data. In other research studies geospatial data is considered as it were always been big data (Lee and Kang, 2015). Nevertheless, we can prove data acquisition methods have been improved substantially not only the amount, but the resolution of raw data in spectral, spatial and temporal aspects as well. A significant portion of big data is geospatial data, and the size of such data is growing rapidly at least by 20% every year (Dasgupta, 2013). The produced increasing volume of raw data, in different format, representation and purpose the wealth of information derived from this data sets represents only valuable results. However, the computing capability and processing speed rather tackle with limitations, even if semi-automatic or automatic procedures are aimed on complex geospatial data (Krist´of et al., 2014). In late times, distributed computing has reached many interdisciplinary areas of computer science inclusive of remote sensing and geographic information processing approaches. Cloud computing even more requires appropriate processing algorithms to be distributed and handle geospatial big data. Map-Reduce programming model and distributed file systems have proven their capabilities to process non GIS big data. But sometimes it’s inconvenient or inefficient to rewrite existing algorithms to Map-Reduce programming model, also GIS data can not be partitioned as text-based data by line or by bytes. Hence, we would like to find an alternative solution for data partitioning, data distribution and execution of existing algorithms without rewriting or with only minor modifications. This paper focuses on technical overview of currently available distributed computing environments, as well as GIS data (raster data) partitioning, distribution and distributed processing of GIS algorithms. A proof of concept implementation have been made for raster data partitioning, distribution and processing. The first results on performance have been compared against commercial software ERDAS IMAGINE 2011 and 2014. Partitioning methods heavily depend on application areas, therefore we may consider data partitioning as a preprocessing step before applying processing services on data. As a proof of concept we have implemented a simple tile-based partitioning method splitting an image into smaller grids (NxM tiles) and comparing the processing time to existing methods by NDVI calculation. The concept is demonstrated using own development open source processing framework.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2015-08-20", "journal": {"name": "ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "543-551", "volume": ""}, "authors": [{"authorId": "2351732", "name": "B. N. Thai"}, {"authorId": "3009737", "name": "A. Olasz"}], "citations": [{"paperId": "74850712a9651aa29754ce9fcca612a4998d9093", "title": "Computing over encrypted spatial data generated by IoT"}, {"paperId": "542d47836e9281553bd6c3846ad0604b42322793", "title": "Development of a new framework for Distributed Processing of Geospatial Big Data"}, {"paperId": "d7a5990da57fd0295a4a3e232d03e4fe35e522cf", "title": "Big Geospatial Data processing in the IQmulus Cloud"}, {"paperId": "0c3ce2587c3f56a5ca713792f3a1f9ecafa73f4a", "title": "Distributed Viewshed Analysis An Evaluation of Distribution Frameworks for Geospatial Information Systems"}]}
