{"paperId": "68b214c851c16a52b7cae56e7e079b62acc16ad2", "publicationVenue": null, "title": "A big data on private cloud agile provisioning framework based on OpenStack", "abstract": "On the bases of the OpenStack private cloud delivery big data platform, numerous entities yearn for attaining agile and standardized big data delivery platform, reclaiming the resources, managing the total cost of ownership (TCO) and adapting to multiple big data open source or commercial off-the-shelf (COTS) solutions. Nevertheless, as regards the big data platform running on cloud computing, the big data platform is disintegrated from the cloud computing system by virtual machines since neither being based on OpenStack private cloud nor on big data platform can achieve end-to-end resource delivery, together with ensuring that it is quite convenient for the long-term operations. Accordingly, establishing an across framework between private cloud and big data platform is quite essential. The big data on cloud agile provision framework could realize fast resource delivery based on predefined orchestration template of private cloud, operating system, big data platform, monitor, inspection system, etc. Through the deployment of this framework, it is capable of attaining the delivery of agile, low cost, standardized and high adaptability the big data on cloud, as well as the high-quality operation of the big data on cloud with the help of integration configuration management database (CMDB) with the automatic inspection system.", "venue": "2018 IEEE 3rd International Conference on Cloud Computing and Big Data Analysis (ICCCBDA)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-04-01", "journal": {"name": "2018 IEEE 3rd International Conference on Cloud Computing and Big Data Analysis (ICCCBDA)", "pages": "253-260"}, "authors": [{"authorId": "2149494404", "name": "Ming Lu"}, {"authorId": "48667429", "name": "Xu Zhou"}], "citations": [{"paperId": "55f24914c02c45bbf9568e499dd9e9f69a8aa1c0", "title": "An Orchestration Framework for a Global Multi-Cloud"}]}
