{"paperId": "68c32d4b90122c87c65360753dd76e4bb733fa34", "publicationVenue": null, "title": "Integrity in Halal Food Supply Chain Towards the Society 5.0", "abstract": "Recent integrity issues related to halal product is alarming. While the literature has introduced Industry 4.0 technologies, the reality in the food industry especially halal related product shows disparity in the contribution of scholars to real-world issue. The disparity between both literature and industry is due to information integration. The issue related to information integration can be solved through Society 5.0 where human and technology are connected through information management, monitoring, and control. Nevertheless, studies related to Society 5.0 are limited and isolated to social and technology area since the concept is still new in the literature. However, the advantages of integrating Industry 4.0 and Society 5.0 are able in ensuring integrity in food supply chain especially related to halal. Thus, the objective of this paper is to propose a model based on Society 5.0 to provide solution to food integrity in the supply chain. This study has undertaken extensive literature review related to Society 5.0 and integrity practices. The outcome of the paper proposed a model that links Society 5.0 and Industry 4.0 technologies to help organisation manage halal food in the supply chain with integrity as its measurements. The model proposed in this study is useful for any organisation to adopt halal supply chain and understand how to implement Industry 4.0 as well as managing information through Society 5.0.", "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-03-20", "journal": {"name": "", "pages": "103-114", "volume": "4"}, "authors": [{"authorId": "143958306", "name": "Yudi Fernando"}, {"authorId": "2122185179", "name": "Raidah Saedan"}, {"authorId": "97576457", "name": "M. S. Shaharudin"}, {"authorId": "2084595350", "name": "A. Mohamed"}], "citations": [{"paperId": "5b22cb6d3ea751ab1fdd69445a65d22976bc2e61", "title": "CHEF-PRENEUR AND RESTAURANT PERFORMANCE: THE ROLE OF MEDIATION IN COMPETITIVE ADVANTAGE"}, {"paperId": "7e6a3ed49524fb960bec5856168c896569af966c", "title": "Information Quality and Electronic Service Quality in Driving Customer Satisfaction and Experience at Online Legal Woods"}, {"paperId": "96c9be28f8a5d83b46ae6ec75c96a8b9f7824ca2", "title": "Impact of Power and Expertise on Perceived Celebrity Credibility on Digital Brand Awareness"}, {"paperId": "15588192e00847bce4f72b2988e1844dcab1e39b", "title": "Adoption of blockchain technology to improve Halal supply chain performance and competitiveness"}, {"paperId": "c5895b2d855c89cf36adc8a1752b70bcc5fa6b2b", "title": "Supply chain integration and halal frozen meat product returns"}]}
