{"paperId": "68ca0a07527ba23a840c6ed93ab29a5464bd6c79", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Siberian Tiger Optimization: A New Bio-Inspired Metaheuristic Algorithm for Solving Engineering Optimization Problems", "abstract": "In this article, a new metaheuristic algorithm called Siberian Tiger Optimization (STO) is designed to deal with optimization applications. The fundamental inspiration of STO is the imitation of the natural behavior of the Siberian tiger during hunting and fighting. First, the whole design of STO and its mathematical model’s two phases are explained. Then, the efficiency of the proposed STO approach in optimization tasks is evaluated on sets of various standard benchmark functions from the CEC 2017 test suite. In addition, the CEC 2011 test suite and four engineering design problems are employed to analyze the ability of STO to handle real-world applications. Finally, the quality of the optimization results obtained from the proposed STO approach is compared with the performance of twelve well-known metaheuristic algorithms. The simulation results show that STO, with its high power in exploration and exploitation and creating a balance between them, has provided better results than competitor algorithms and has superior performance in handling optimization applications.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "132396-132431", "volume": "10"}, "authors": [{"authorId": "2150730612", "name": "Pavel Trojovský"}, {"authorId": "2132379761", "name": "Mohammad Dehghani"}, {"authorId": "95814369", "name": "P. Hanus"}], "citations": [{"paperId": "aadcb45c92834128ebf464678d8337757886f881", "title": "Half mirror algorithm: a metaheuristic that hybridizes swarm intelligence and evolution-based system"}, {"paperId": "8050cd662361941c6a7a6e8550a37c45e8e5f678", "title": "Swarm flip-crossover algorithm: a new swarm-based metaheuristic enriched with a crossover strategy"}, {"paperId": "2a9f39ff5ba61a33d076931ef3082f8a06f86d5f", "title": "MOIMPA: multi-objective improved marine predators algorithm for solving multi-objective optimization problems"}, {"paperId": "6c81bf84abac9e375eb8d8e39b7a086b9507df9a", "title": "A hierarchical multi-leadership sine cosine algorithm to dissolving global optimization and data classification: The COVID-19 case study"}, {"paperId": "e60f13e7c3ee6b1e40cbd094dc820c0a3444a40d", "title": "Kepler optimization algorithm: A new metaheuristic algorithm inspired by Kepler's laws of planetary motion"}]}
