{"paperId": "68d2b971a0d99f7913a1aa0484c0172548a6581c", "publicationVenue": null, "title": "Measurement report: Spatiotemporal and policy-related variations of PM2.5 compositions and sources during 2015–2019 at multisite of a Chinese megacity", "abstract": "Abstract. A thorough understanding of the relationship between urbanization and PM2.5 (fine particulate matter with aerodynamic diameter less than 2.5 µm) variation is crucial for researchers and policymakers to study health effects and improve air quality. In this study, we selected a fast-developing Chinese megacity as the studied area to investigate the spatiotemporal and policy-related variations of PM2.5 compositions and sources based on a long-term observation at multisite. A total of 836 samples were collected at 19 sites in wintertime of 2015–2019. According to the specific characteristics, 19 sampling sites were assigned into three layers. Layer 1 was the most urbanized area referred to the core zone of Chengdu, layer 2 was located in the outside circle of layer 1, and layer 3 belonged to the outer-most zone with the lowest urbanization level. The averaged PM2.5 concentrations for five years were in the order of layer 2 (133 µg m−3) > layer 1 (126 µg m−3) > layer 3 (121µg m−3). And for each year, the spatial clustering of chemical compositions at sampling sites was generally consistent with the classification of layers. PM2.5 compositions for layer 3 in 2019 were found to be similar to that for other layers two or three years ago, implying that the urbanization levels had a strong effect on air quality. During the sampled period, a decreasing trend was observed for the annual averaged PM2.5 concentrations, especially at sampling sites in layer 1, which was caused by the more strict control policies implemented in layer 1. The SO42−/NO3− mass ratio at most sites exceeded 1 in 2015 but dropped less than 1 since 2016, reflecting decreasing coal combustion and increasing traffic impacts in Chengdu. The positive matrix factorization (PMF) model was applied to quantify PM2.5 sources. A total of five sources were identified with the average contributions of 15.5 % (traffic emission), 19.7 % (coal and biomass combustion), 8.8 % (industrial emission), 39.7 % (secondary particles) and 16.2 % (resuspended dust), respectively. From 2015 to 2019, dramatical decline was observed in the average percentage contributions of coal and biomass combustion, but traffic emission source showed an increasing trend. For spatial variations, coal and biomass combustion and industrial emission showed the stronger distribution patterns. High contributions of resuspended dust were occurred at sites with intensive construction activities such as subway and airport constructions. Combining the PMF results, we developed the source weighted potential source contribution function (SWPSCF) method for source localization, this new method highlighted the influences of spatial distribution for source contributions, and the effectiveness of the SWPSCF method was well-evaluated.", "venue": "", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-06-09", "journal": {"name": "Atmospheric Chemistry and Physics", "pages": "1-19", "volume": ""}, "authors": [{"authorId": "11060821", "name": "Xinyao Feng"}, {"authorId": "66384413", "name": "Yingze Tian"}, {"authorId": "3086487", "name": "Qianqian Xue"}, {"authorId": "15377020", "name": "Dan-lin Song"}, {"authorId": "72627716", "name": "Feng-xia Huang"}, {"authorId": "48260228", "name": "Yinchang Feng"}], "citations": []}
