{"paperId": "690c7cb3b1adf2116aef73b26476ba79a24d1c53", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Deep-Reinforcement-Learning-Based Computation Offloading and Power Allocation Within Dynamic Platoon Network", "abstract": "With the development of Internet of Vehicles (IoV) technology and the application of artificial intelligence-based algorithms, platoon driving based on connected autonomous vehicles (CAVs) has become one of the effective solutions to reduce environmental pollution and improve traffic safety. However, the connectivity, autonomy, and passenger comfort in platooning vehicles cannot be realized without the support of advanced communication technologies and auxiliary computing. In this work, we research the problem of computation offloading and resource allocation within a platoon network. Considering the comprehensive effects of vehicle mobility, co-channel interference, and multivehicle cooperation, we propose a system optimization model for joint computation offloading and power allocation (COPA). Our objective is to minimize the weighted sum of the system average energy consumption and task data processing delay. In the dynamic platoon network, we design a multiagent deep deterministic policy gradient (DDPG)-based joint COPA scheme, which can learn the temporal correlation of environment states and make more accurate power allocation actions. Moreover, we conduct extensive computer simulations to demonstrate the robustness and effectiveness of the DDPG-based COPA scheme. Numerical results demonstrate that the proposed scheme has a better performance compared with other benchmark schemes.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "10500-10512", "volume": "11"}, "authors": [{"authorId": "2262092322", "name": "Lei Wang"}, {"authorId": "2180623388", "name": "Hongbin Liang"}, {"authorId": "2255028728", "name": "Dongmei Zhao"}], "citations": [{"paperId": "f59e3f62000deeb5957cb10d28eef566d35c851b", "title": "Multi-User Computation Offloading and Resource Allocation Algorithm in a Vehicular Edge Network"}]}
