{"paperId": "691bf1d8f7ee062f370ce2ced217255ff08ff5c3", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "On the Relation Between Opinion Change and Information Consumption on Reddit", "abstract": "While much attention has been devoted to the causes of opinion change, little is known about its consequences. Our study moves a first step in this direction by looking at Reddit, and in particular to the subreddit r/ChangeMyView, a community dedicated to debating one’s own opinions on a wide array of topics. We analyze changes in online information consumption behavior that arise after a self-reported opinion change, by looking at the participation to a set of sociopolitical communities. We find that people who self-report an opinion change are significantly more likely to change their future participation in a specific subset of those communities. Specifically, there is a significant association (Pearson r = 0.46) between using propaganda-like language in a community and the increase in chances of leaving it. Comparable results (Pearson r = 0.39) hold for the opposite direction, i.e., joining these same communities. In addition, the textual content of the post associated with opinion change is indicative of which communities will be joined or left: a predictive model based only on the text of this post can pinpoint these communities with an average precision@5 of 0.20. Our results establish a link between opinion change and information consumption, and highlight how online propagandistic communities act as a first gateway to internalize a shift in one’s sociopolitical opinion.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-25", "journal": {"name": "ArXiv", "volume": "abs/2207.12196"}, "authors": [{"authorId": "2171081238", "name": "Flavio Petruzzellis"}, {"authorId": "47286020", "name": "Corrado Monti"}, {"authorId": "35168570", "name": "G. D. F. Morales"}, {"authorId": "1705764", "name": "F. Bonchi"}], "citations": [{"paperId": "f02b7ccd9ff9a8883fedcc5ab80087778a36bc10", "title": "Deliberate Exposure to Opposing Views and its Association with Behavior and Rewards on Political Communities"}, {"paperId": "b128b72cc33e538e021f6e99ba327184ff2e6944", "title": "Measuring Behavior Change with Observational Studies: a Review"}]}
