{"paperId": "692ba4ad6320859c8344bad10e639a5842a4559e", "publicationVenue": {"id": "5982f661-c948-4213-b75e-859e27758399", "name": "International Conference on Sciences of Electronics, Technologies of Information and Telecommunications", "type": "conference", "alternate_names": ["SETIT", "Int Conf Sci Electron Technol Inf Telecommun"]}, "title": "Implementation and Performance Analysis of Lightweight Block Ciphers for IoT applications using the Contiki Operating system", "abstract": "Recent years have witnessed impressive advances in technology which led to the rapid growth of the Internet of Things (IoT) and Wireless Sensor Networks (WSNs) using numerous low-powered devices with a huge number of actuators and sensors. These devices gather and exchange data over the internet and generate enormous amounts of data needed to be secured. Although traditional cryptography provides an efficient means of addressing device and communication confidentiality, integrity, and authenticity issues, it may not be appropriate for very resource-constrained systems, particularly for end-nodes such as a simply connected sensor. Thus, there is an ascent need to use lightweight cryptography (LWC) providing the needed level of security with less complexity, area and energy overhead. In this paper, four lightweight cryptographic algorithms called PRESENT, LED, Piccolo, and SPARX were implemented over a Contiki-based IoT operating system, dedicated for IoT platforms, and assessed regarding RAM and ROM usage, power and energy consumption, and CPU cycles number. The Cooja network simulator is used in this study to determine the best lightweight algorithms to use in IoT applications utilizing wireless sensor networks technology.", "venue": "International Conference on Sciences of Electronics, Technologies of Information and Telecommunications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-05-28", "journal": {"name": "2022 IEEE 9th International Conference on Sciences of Electronics, Technologies of Information and Telecommunications (SETIT)", "pages": "50-54"}, "authors": [{"authorId": "2164259305", "name": "Amal Hkiri"}, {"authorId": "35036250", "name": "Mouna Karmani"}, {"authorId": "2820936", "name": "Mohsen Machhout"}], "citations": [{"paperId": "1b462db1cd9fdafae1aa15487df687b1608b62a2", "title": "The Study of Artificial Neural Networks and Deep Learning for Weather Prediction"}]}
