{"paperId": "693aadb6c397ce176624ea73dfe8d619907acf14", "publicationVenue": null, "title": "An Intermediate Representation for Composable Typed Streaming Dataflow Designs", "abstract": "Tydi is an open specification for streaming dataflow designs in digital circuits, allowing designers to express how composite and variable-length data structures are transferred over streams using clear, data-centric types. These data types are extensively used in a many application domains, such as big data and SQL applications. This way, Tydi provides a higher-level method for defining interfaces between components as opposed to existing bit and byte-based interface specifications. In this paper, we introduce an open-source intermediate representation (IR) which allows for the declaration of Tydi's types. The IR enables creating and connecting components with Tydi Streams as interfaces, called Streamlets. It also lets backends for synthesis and simulation retain high-level information, such as documentation. Types and Streamlets can be easily reused between multiple projects, and Tydi's streams and type hierarchy can be used to define interface contracts, which aid collaboration when designing a larger system. The IR codifies the rules and properties established in the Tydi specification and serves to complement computation-oriented hardware design tools with a data-centric view on interfaces. To support different backends and targets, the IR is focused on expressing interfaces, and complements behavior described by hardware description languages and other IRs. Additionally, a testing syntax for the verification of inputs and outputs against abstract streams of data, and for substituting interdependent components, is presented which allows for the specification of behavior. To demonstrate this IR, we have created a grammar, parser, and query system, and paired these with a backend targeting VHDL.", "venue": "VLDB Workshops", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-25", "journal": {"name": "ArXiv", "volume": "abs/2308.13436"}, "authors": [{"authorId": "2196533662", "name": "Matthijs A. Reukers"}, {"authorId": "2195490447", "name": "Yongding Tian"}, {"authorId": "2233480783", "name": "Zaid Al-Ars"}, {"authorId": "11983170", "name": "P. Hofstee"}, {"authorId": "69473390", "name": "M. Brobbel"}, {"authorId": "8751826", "name": "J. Peltenburg"}, {"authorId": "2463330", "name": "J. V. Straten"}], "citations": [{"paperId": "007911af6d7eccc41488c8833fdb922f3731df9d", "title": "Tydi-Chisel: Collaborative and Interface-Driven Data-Streaming Accelerators"}, {"paperId": "708faf3d53b3487e72ba9e79f41cafc77eaeb19d", "title": "A Toolchain for Streaming Dataflow Accelerator Designs for Big Data Analytics: Defining an IR for Composable Typed Streaming Dataflow Designs"}]}
