{"paperId": "693be8fc0fe567c67abc507fd0aebe3009ce2f29", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "The Reddit Politosphere: A Large-Scale Text and Network Resource of Online Political Discourse", "abstract": "We introduce the Reddit Politosphere, a large-scale resource of online political discourse covering more than 600 political discussion groups over a period of 12 years. It is to the best of our knowledge the largest and ideologically most comprehensive dataset of its type now available. One key feature of the Reddit Politosphere is that it consists of both text and network data, allowing for methodologically-diverse analyses. We describe in detail how we create the Reddit Politosphere, present descriptive statistics, and sketch potential directions for future research based on the resource.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-31", "journal": {"pages": "1259-1267"}, "authors": [{"authorId": "1667898858", "name": "Valentin Hofmann"}, {"authorId": "144418438", "name": "Hinrich Schütze"}, {"authorId": "1970864", "name": "J. Pierrehumbert"}], "citations": [{"paperId": "6aec25ad4d8d3d58620f0be0b52667b6dc7a3f60", "title": "The rise and fall of WallStreetBets: social roles and opinion leaders across the GameStop saga"}, {"paperId": "e3504a079881fe0179f44eb3519e1246b60359dc", "title": "Exploring wireless connectivity and network performance: A dataset of 4G LTE user equipment measurements"}, {"paperId": "c7ad19da81e24c387f0377fef6d19b0fce2cf470", "title": "Self-Guard: Empower the LLM to Safeguard Itself"}, {"paperId": "fee52d917aed89a390a76216e8e27120d74fe5f2", "title": "A Novel 2-Step Very Large-Scale Short Text Clustering Algorithm"}, {"paperId": "9caef8b62da29337aa283f9fb8870ac76779b446", "title": "The social media discourse of engaged partisans is toxic even when politics are irrelevant"}, {"paperId": "604149ebaa727cb0840e0117a59f6fc13ca66690", "title": "Not Wacky vs. Definitely Wacky: A Study of Scalar Adverbs in Pretrained Language Models"}, {"paperId": "2faed6139986c213de2f2dbdfd1f897457edb50f", "title": "Unsupervised Detection of Contextualized Embedding Bias with Application to Ideology"}, {"paperId": "722dbe4511134f5433a51519d9c28bd15791454d", "title": "Modeling Ideological Salience and Framing in Polarized Online Groups with Graph Neural Networks and Structured Sparsity"}, {"paperId": "365d31d93f1795f7ec4b1168797d328ab221d70e", "title": "Exploring Wireless Connectivity and Network Performance: A Dataset of 4G LTE User Equipment Measurements"}]}
