{"paperId": "693de46d8ce2ae33a97ab1cb2db556de565c3805", "publicationVenue": {"id": "60275282-b076-42f7-99dc-8757c2064681", "name": "Informatics", "type": "journal", "alternate_names": ["Informatics (basel", "Informatics (Basel)"], "issn": "2227-9709", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-390272", "alternate_urls": ["https://www.mdpi.com/journal/informatics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-390272"]}, "title": "Benchmarking Deep Learning Methods for Behaviour-Based Network Intrusion Detection", "abstract": "Network security encloses a wide set of technologies dealing with intrusions detection. Despite the massive adoption of signature-based network intrusion detection systems (IDSs), they fail in detecting zero-day attacks and previously unseen vulnerabilities exploits. Behaviour-based network IDSs have been seen as a way to overcome signature-based IDS flaws, namely through the implementation of machine-learning-based methods, to tolerate new forms of normal network behaviour, and to identify yet unknown malicious activities. A wide set of machine learning methods has been applied to implement behaviour-based IDSs with promising results on detecting new forms of intrusions and attacks. Innovative machine learning techniques have emerged, namely deep-learning-based techniques, to process unstructured data, speed up the classification process, and improve the overall performance obtained by behaviour-based network intrusion detection systems. The use of realistic datasets of normal and malicious networking activities is crucial to benchmark machine learning models, as they should represent real-world networking scenarios and be based on realistic computers network activity. This paper aims to evaluate CSE-CIC-IDS2018 dataset and benchmark a set of deep-learning-based methods, namely convolutional neural networks (CNN) and long short-term memory (LSTM). Autoencoder and principal component analysis (PCA) methods were also applied to evaluate features reduction in the original dataset and its implications in the overall detection performance. The results revealed the appropriateness of using the CSE-CIC-IDS2018 dataset to benchmark supervised deep learning models. It was also possible to evaluate the robustness of using CNN and LSTM methods to detect unseen normal activity and variations of previously trained attacks. The results reveal that feature reduction methods decreased the processing time without loss of accuracy in the overall detection performance.", "venue": "Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-20", "journal": {"name": "Informatics", "pages": "29", "volume": "9"}, "authors": [{"authorId": "2103992921", "name": "M. Antunes"}, {"authorId": "2159657957", "name": "Luís Oliveira"}, {"authorId": "2159596856", "name": "Afonso Seguro"}, {"authorId": "49192249", "name": "J. Veríssimo"}, {"authorId": "2159606975", "name": "Ruben Salgado"}, {"authorId": "2159596844", "name": "Tiago Murteira"}], "citations": [{"paperId": "a7b46d97c7b238d1f71acd71619ec5823ce25e4c", "title": "Expectations Versus Reality: Evaluating Intrusion Detection Systems in Practice"}, {"paperId": "9010d976b7dc1a8ca03ac169733266169a7133c0", "title": "A Hybrid Extreme Gradient Boosting and Long Short-Term Memory Algorithm for Cyber Threats Detection"}, {"paperId": "586e86f44cbcaf7b9fb876a0d1e4427f0b6b8138", "title": "An Optimized Hybrid Deep Intrusion Detection Model (HD-IDM) for Enhancing Network Security"}, {"paperId": "d8b0ad3d8904e4e69bca1c7abb87dcc0e4dc2d51", "title": "Features of the Practical Implementation of the Method for Managing Observations of the State of Monitored Objects in Intrusion Detection Systems"}, {"paperId": "620848777e1e61a296a8906a1dd3d17f7ea919c6", "title": "IDCSNet: Intrusion Detection and Classification System using Unified Gradient-Boosted Decision Tree Classifier"}, {"paperId": "fc94022f93ecfbcb8d0270e80d0d407b2e7fdfaf", "title": "Protecting Private Information for Two Classes of Aggregated Database Queries"}, {"paperId": "219b6c363332a47ffddc8f301c43fbc3bd5944b1", "title": "Attack vs Benign Network Intrusion Traffic Classification"}, {"paperId": "633ea58bc89f7360bbeb10467425501009656a47", "title": "Bulletin of Electrical Engineering and Informatics"}]}
