{"paperId": "693e79ec2098bb55e0cac7db9ae4159d32aded3c", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Strategies for the Storage of Large LiDAR Datasets - A Performance Comparison", "abstract": "The widespread use of LiDAR technologies has led to an ever-increasing volume of captured data that pose a continuous challenge for its storage and organization, so that it can be efficiently processed and analyzed. Although the use of system files in formats such as LAS/LAZ is the most common solution for LiDAR data storage, databases are gaining in popularity due to their evident advantages: centralized and uniform access to a collection of datasets; better support for concurrent retrieval; distributed storage in database engines that allows sharding; and support for metadata or spatial queries by adequately indexing or organizing the data. The present work evaluates the performance of four popular NoSQL and relational database management systems with large LiDAR datasets: Cassandra, MongoDB, MySQL and PostgreSQL. To perform a realistic assessment, we integrate these database engines in a repository implementation with an elaborate data model that enables metadata and spatial queries and progressive/partial data retrieval. Our experimentation concludes that, as expected, NoSQL databases show a modest but significant performance difference in favor of NoSQL databases, and that Cassandra provides the best overall database solution for LiDAR data.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-31", "journal": {"name": "Remote. Sens.", "pages": "2623", "volume": "14"}, "authors": [{"authorId": "2157583449", "name": "Juan A. Béjar-Martos"}, {"authorId": "1769981", "name": "Antonio J. Rueda Ruiz"}, {"authorId": "3161046", "name": "C. Ogáyar"}, {"authorId": "2210028", "name": "R. Segura"}, {"authorId": "2079790766", "name": "Alfonso López Ruiz"}], "citations": [{"paperId": "791611366ca24863181e9c445bc5a816b7a71584", "title": "Architecture and Potential of Connected and Autonomous Vehicles"}]}
