{"paperId": "693f7cd7a925bbdae041b1af68c2ef26dbb789b9", "publicationVenue": {"id": "902c5c93-f5c4-4087-918a-e454e8250d10", "name": "ACM Transactions on Social Computing", "alternate_names": ["ACM Trans Soc Comput"], "issn": "2469-7818", "url": "https://dl.acm.org/citation.cfm?id=J1546"}, "title": "Helping Each Other Quit Online: Understanding User Engagement and Real-life Outcomes of the r/StopSmoking Digital Smoking Cessation Community", "abstract": "Despite decades of prevention, tobacco addiction is still a widespread health concern responsible for around 8 million deaths per year. Existing digital smoking cessation solutions such as social media are becoming increasingly popular and represent a novel approach to find community support. However, little is known about how they affect smoking behavior. This research aims to understand what motivates people to join online communities and how their participation affects their attitudes and behaviors. To do so, this article conducts an in-depth analysis of the popular Reddit r/StopSmoking thread through three complementary studies. Using the transtheoretical model and the uses and gratification theory, Study 1 aims at understanding the link among motivation factors, engagement, and outcomes through a user survey. Study 2 aims at understanding the engagement by analyzing the content of 10 years of user interaction data. Study 3 attempts to gain further knowledge of interactions by examining the reaction of the community to a crisis situation such as that of the recent COVID-19 pandemic. Findings convey the fact that participation in such communities has a favorable impact on the change process toward quitting. Results show that providing social support to others is the biggest contributing factor for participating in the community. User interactions analysis confirmed that survey responses were accurate reflections of actual user activity. Regarding the impact of the COVID-19 crisis, results suggest that it increased levels of stress and depression in the community while decreasing active engagement, indicating that there may be opportunities for improvement in dealing with tough situations.", "venue": "ACM Transactions on Social Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-14", "journal": {"name": "ACM Transactions on Social Computing", "pages": "1 - 30", "volume": "6"}, "authors": [{"authorId": "2169139956", "name": "Alessio De Santo"}, {"authorId": "2169166536", "name": "Arielle Moro"}, {"authorId": "2709969", "name": "Bruno Kocher"}, {"authorId": "144708408", "name": "A. Holzer"}], "citations": [{"paperId": "79ab2888317adc82b566626aa20ec762f73943c2", "title": "Treatment-seeking young people enrolled in a United States vaping cessation intervention trial report high frequency of use and nicotine dependence"}, {"paperId": "30714063c0ea2a173a5181247285e4a45a5b762e", "title": "Escape Addict: A digital escape room for the prevention of addictions and risky behaviors in schools"}]}
