{"paperId": "6942dbcf4e70de56cf187cad2b2f1396605f019b", "publicationVenue": {"id": "74147530-6994-48e2-bf9c-7006f268d34c", "name": "ACM International Conference on Computing Frontiers", "type": "conference", "alternate_names": ["Computing Frontiers", "CF", "Comput Front", "ACM Int Conf Comput Front"], "url": "http://www.computingfrontiers.org/"}, "title": "When wearable technology meets computing in future networks: a road ahead", "abstract": "Rapid technology advancement, economic growth, and industrialization have paved the way for developing a new niche of small body-worn personal devices, gathered together under a wearable-technology title. The triggers stimulated by end-users interest have introduced the first generation of mass-consumer wearables in just the past decade. Evidently, the trailblazing ones were not designed with strict energy-consumption restrictions in mind. Thus, wearable-computing-related research remained fragmented. Advanced and sophisticated batteries and communication technologies could be already procurable on devices. Additional solutions for efficient utilization of processing power are still a white spot on the wearable technology roadmap. A-WEAR EU project aims to enhance the understanding of how the superimposition of those technologies would improve wearable devices' energy efficiency, with the research area being far from saturation. We foresee enormous room for research as the Edge computing paradigm is emerging towards hand-held devices.", "venue": "ACM International Conference on Computing Frontiers", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-05-11", "journal": {"name": "Proceedings of the 18th ACM International Conference on Computing Frontiers"}, "authors": [{"authorId": "2105429", "name": "A. Ometov"}, {"authorId": "68974088", "name": "Olga Chukhno"}, {"authorId": "68973105", "name": "Nadezhda Chukhno"}, {"authorId": "144575277", "name": "J. Nurmi"}, {"authorId": "1697970", "name": "E. Lohan"}], "citations": [{"paperId": "1d4a75f4b691fed46419094ce5c3c4cce504b654", "title": "Comprehensive IoT-Based Monitoring System for Improving Worker's Health and Safety at the High-Risk Working Environment"}, {"paperId": "91337ea95874e1bef8cbe92ad355d6cf0f99f174", "title": "Task Offloading for Smart Glasses in Healthcare: Enhancing Detection of Elevated Body Temperature"}, {"paperId": "c7c331d812da94b7ff834e55d4f3bbbdd1a980c1", "title": "A meta-analysis of a comprehensive m-health technology acceptance"}, {"paperId": "801f84cd86916138e470c740481eb60fc8c0bb82", "title": "Getting Connected to M-Health Technologies through a Meta-Analysis"}, {"paperId": "e192de52678da2a4a614fe2cf7c63ece51724d4c", "title": "Managing Perceived Loneliness and Social-Isolation Levels for Older Adults: A Survey with Focus on Wearables-Based Solutions"}, {"paperId": "3df16dc2e37ee44cff402cd223bbeda7f0fbd9df", "title": "A Survey of Security in Cloud, Edge, and Fog Computing"}, {"paperId": "6ab6ea2bad44b73ffb86d6d5074bc17697f16883", "title": "Wearables for Industrial Work Safety: A Survey"}, {"paperId": "495020ae0fd086e85853d47ff4ea05a55a57558e", "title": "Micraspis: A Computer-Aided Proposal Toward Programming and Architecting Smart IoT Wearables"}]}
