{"paperId": "694b1322379da3a0b0952c1a9968e343616f6930", "publicationVenue": null, "title": "Identifying Critical Issues in Smart City Big Data Project Implementation", "abstract": "Many cities across the globe are adopting smart city initiatives, as smart city holds the promise of better quality of life and equity for city's residents, more efficient use of city's infrastructure, and more effective city planning. Big data analytics is the backbone of smart city and the drive engine to achieve smart city's promises. However, statistics indicate that more than 50% of big data projects fail; they either never finish or do not offer the expected value. Resulting in severe consequences as such projects tends to be expensive and require allocating the organization's best resources while doing the project. This is even more crucial in the case of smart city, as cities usually have limited budget and resources. This paper conducted literature review and perspectives analysis to identify challenges, which can cause big data projects to fail, with focus on smart city related big data projects. The goal is to offer a list of challenges, that a project manager can consider as an initial list of risks for the upcoming project, and evaluate the city's readiness against each of them.", "venue": "Proceedings of the 1st ACM/EIGSCC Symposium on Smart Cities and Communities", "year": 2018, "fieldsOfStudy": ["Business"], "publicationTypes": ["Book", "Review"], "publicationDate": "2018-06-20", "journal": {"name": "Proceedings of the 1st ACM/EIGSCC Symposium on Smart Cities and Communities"}, "authors": [{"authorId": "36969361", "name": "H. Barham"}, {"authorId": "1730923", "name": "T. Daim"}], "citations": [{"paperId": "8c115f7bb34bb209828a290ea67d38931c0a78ee", "title": "Big data readiness in the public sector: an assessment model and insights from Indonesian local governments"}, {"paperId": "89a3fdb578e630bbfadd0452d4bc3597171c4254", "title": "Data Science Failure: A Literature Review"}, {"paperId": "64b3b509c1bc1a7d5536eeb34c701384f5c6cf0e", "title": "A Lifecycle-Based Smart Sustainable City Strategic Framework for Realizing Smart and Sustainability Initiatives in Riyadh City"}, {"paperId": "e9ee4abd6a143ba051c62b1551fc075dd4a3cc74", "title": "A Patent Analysis on Big Data Projects"}, {"paperId": "ce352a78bff4dad67f40df5baac21c8fee8ba6dc", "title": "The Challenges of Data Analytics Implementations: A Preliminary Literature Review"}, {"paperId": "7028b9ba54092ea4044f8561958711c27b9d96ae", "title": "The use of readiness assessment for big data projects"}, {"paperId": "080972928a80852b9befd4d06e8f08fe67bf20d8", "title": "A Meta-analysis of Big Data Security: How the Government Formulates a Model of Public Information and Security Assurance into Big Data"}]}
