{"paperId": "694dfc4fee3fe0a5723cf81d22f816e574e3466c", "publicationVenue": null, "title": "Impact of novel information technology on IT alignment and sustainable supply chain performance: evidence from Chinese manufacturing industry", "abstract": "\nPurpose\nThis paper aims to explore how the novel information technology (NIT) [1] affects three dimensions of sustainable supply chain performance (economic performance, environmental performance and social performance) and how two dimensions of IT alignment (IT infrastructure alignment and IT human resources alignment) mediate the relationship between them.\n\n\nDesign/methodology/approach\nNIT is defined, the dimension of IT alignment is expanded, the theoretical hypotheses are proposed and are tested using survey data from 394 manufacturing enterprises using NIT in China.\n\n\nFindings\nThe results indicate that NIT plays a positive role in improving sustainable supply chain performance, and IT alignment mediates the impact of NIT on sustainable supply chain performance.\n\n\nOriginality/value\nThis study highlights the impact of NIT on sustainable supply chain performance and demonstrates IT alignment as a mediator between them, it also provides a deeper understanding of how different dimensions of IT alignment affect sustainable supply chain performance\n", "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-06-11", "journal": {"name": "Journal of Business & Industrial Marketing", "volume": ""}, "authors": [{"authorId": "2108769298", "name": "Shushan Zhang"}, {"authorId": "2110833402", "name": "Lei Sun"}, {"authorId": "2024776004", "name": "Qi Sun"}, {"authorId": "49377935", "name": "Haiying Dong"}], "citations": [{"paperId": "a31fdebd4b085c85dc5d8e795e19004f238dd4f9", "title": "Effects of Internet of Things, supply chain collaboration and ethical sensitivity on sustainable performance: moderating effect of supply chain dynamism"}, {"paperId": "ba22ccb0761150fc87cba56900d5ab571d1b68e3", "title": "The Nexus of Corporate Affinity for Technology and Firm Sustainable Performance in the Era of Digitalization: A Mediated Model"}, {"paperId": "5a61034b884e50cfb9b0a179b40acd7c5a2a20d4", "title": "Recent trends in supply chain management of business-to-business firms: a review and future research directions"}, {"paperId": "0d09515e5039c4f7be9a9a1304bad4d1ec5c84b2", "title": "Antecedents and consequences of supply chain agility: a competence-capability-performance paradigm"}, {"paperId": "35f33c02d49f9ad28a32bbf80803365c58b293b1", "title": "Enhancing supply chain competences through supply chain digital embeddedness: an institutional view"}]}
