{"paperId": "695bdc6e24608364491b9418a220c65a7cd17413", "publicationVenue": {"id": "9ec28b59-afd2-4d10-9a97-44d984123c30", "name": "IEEE International Conference on Information Reuse and Integration", "type": "conference", "alternate_names": ["Information Reuse and Integration", "IRI", "IEEE Int Conf Inf Reuse Integr", "Inf Reuse Integr"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1001046/all-proceedings"}, "title": "Semantic Data Querying over NoSQL Databases with Apache Spark", "abstract": "The rapid growth of semantic data in the form of RDF triples demands a scalable distributed storage and efficient query processing engine for its management and reuse. To overcome the limitation of native RDF stores and traditional relational database management systems and scale adequately with the exponential increase in the size of RDF datasets, Big Data processing infrastructure like Hadoop with MapReduce have been used. NoSQL databases such as HBase and Cassandra for storing large-scale RDF data and in-memory data processing to execute SPARQL query as SQL query using Apache Spark is proposed in this paper. This paper presents techniques for distributed RDF data storage and querying schemes for HBase and Cassandra clusters. We also present a compiler that translates SPARQL queries into their Spark SQL equivalent for execution. An empirical comparison of HBase and Cassandra systems using datasets and queries from Berlin SPARQL Benchmark (BSBM) and SPARQL Performance Benchmark (SP2Bench) on Microsoft Azure cloud is presented.", "venue": "IEEE International Conference on Information Reuse and Integration", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 IEEE International Conference on Information Reuse and Integration (IRI)", "pages": "364-371"}, "authors": [{"authorId": "2042697689", "name": "Mahmudul Hassan"}, {"authorId": "1720381", "name": "S. Bansal"}], "citations": [{"paperId": "047a6d40cbf64f534aec1ae15360971a68443406", "title": "A scalable and real-time system for disease prediction using big data processing"}, {"paperId": "d4dfc4a6b66ed6a8aab3fd2eccfa670c1fc9a34f", "title": "Database management system performance comparisons: A systematic literature review"}, {"paperId": "4eb966f43278e594be9359bdaf5ed89dd9969e49", "title": "Efficient query evaluation techniques over large amount of distributed linked data"}, {"paperId": "dab0d18550f9f222ed675756bb6e783118de4a3d", "title": "FP-ExtVP: Accelerating Distributed SPARQL queries by Exploiting Load-adaptive Partitioning"}, {"paperId": "23613604ad4f46fb51b4202999c8e296f6397904", "title": "A new Internet of Things architecture for real-time prediction of various diseases using machine learning on big data environment"}, {"paperId": "908bb8aa2e5123e06fcca7e5d9fdf545127b3abc", "title": "Database management system performance comparisons: A systematic survey"}, {"paperId": "270a31c11d9a84370cc66126630e05810a63cf35", "title": "A Semantic NoSQL Application Program Interface for Big Data"}, {"paperId": "bfed9a68a1cceff23bab994af41da53fb68a7afd", "title": "Knowledge Discovery from RDF Data stored in NoSQL databases"}]}
