{"paperId": "696e0eb5c61ac700fb60e8987716433f3bbca43c", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "APRG:A Fair Information Granule Model Based on Adaptive Probability Replacement Resampling", "abstract": "Information granule is a classic mathematical paradigm in the field of data mining. Existing research focuses on improving granule quality to optimize models. However, in these studies, they do not consider that the fairness of the granular model will affect the performance of the granule, especially in some severe social issues (Law, Finance, Education, and more), often due to the participation of sensitive features, the application results of the granule (such as classification) cause population bias. Thus, we construct an adaptive probability replacement resampling model (APR) in Pre-Processors to reduce the bias of sensitive features on granular results. Then, in In-Processors, we add fairness optimizations (FO) to improve the fairness of information granules. Finally, we propose a fair information granule model based on adaptive probability replacement resampling called APRG(APR+FO). We select three loan datasets to verify the feasibility of the granular model according to the current sensitive lending issues in the financial field. The experimental results show that compared with the existing granular models, our proposed method dramatically improves the fairness of the constructed granular models, especially the APRG model, which has an average increase of 46.6% on Demographic Parity (DP) and 77.9% on Equalized Odds (EO). Compared with other existing granular models, the granule quality of APRG is increased by 38.88% on average; in terms of classification accuracy, the average decrease is only 2.03%.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE 29th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "1413-1420"}, "authors": [{"authorId": "2274691583", "name": "Jianghe Cai"}, {"authorId": "2171195413", "name": "Yuhui Deng"}, {"authorId": "2261817229", "name": "Jiande Huang"}, {"authorId": "2293923715", "name": "Ke Wang"}], "citations": []}
