{"paperId": "6978a8c63dafdd6dbdbe19d18add7eaea81a23d2", "publicationVenue": {"id": "5857d727-45eb-4f03-9c71-889349e363a7", "name": "Geomatics, Natural Hazards & Risk", "type": "journal", "alternate_names": ["Geomatics, Natural Hazards and Risk", "Geomatics Nat Hazard  Risk", "Geomatics Nat Hazard Risk"], "issn": "1947-5705", "url": "http://www.informaworld.com/smpp/title~content=t913444127~db=all", "alternate_urls": ["https://www.tandfonline.com/toc/tgnh20/current", "http://www.tandfonline.com/TGNH"]}, "title": "Spatial prediction of the geological hazard vulnerability of mountain road network using machine learning algorithms", "abstract": "Abstract The current assessment index of the geological hazard vulnerability assessment for mountain road network is relatively simple, and the assessment methods used are subjective, complex, and inefficient. This study proposes a prediction model for geological hazard vulnerability assessment of mountain road network incorporating machine learning algorithms. First, based on the quantification of the characteristics of the mountain road network and the local rescue forces, an objective and reasonable index-based system of vulnerability assessment of the mountain road network was constructed by combining the population, economic, and material factors. Second, the FAHP and AHP-TOPSIS were applied for the development of the vulnerability assessment models to carry out the preliminary vulnerability assessment for different road types. Third, the results of the preliminary vulnerability assessment were used as the sample set to build a road vulnerability prediction model using SVM, RF, and BPNN algorithms. Finally, the five-fold cross-validation and statistical parameter accuracy analysis were conducted to determine the most reasonable model with the highest prediction accuracy for geological hazard vulnerability mapping of the mountain road network. The results indicated that the vulnerability prediction model based on the FAHP sample set using the RF algorithm demonstrated the highest accuracy and robustness.", "venue": "Geomatics, Natural Hazards & Risk", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-25", "journal": {"name": "Geomatics, Natural Hazards and Risk", "volume": "14"}, "authors": [{"authorId": "2206155824", "name": "Si-yi Huang"}, {"authorId": "2057104155", "name": "Hongqiang Dou"}, {"authorId": "2105982321", "name": "W. Jian"}, {"authorId": "2202920656", "name": "Chaoxu Guo"}, {"authorId": "2116605862", "name": "Yongxin Sun"}], "citations": [{"paperId": "4b00f36836d5e837b63cdaba7c957384b63d5484", "title": "A novel model for multi-risk ranking of buildings at city level based on open data: the test site of Rome, Italy"}, {"paperId": "2aa648692073fa2ad68155c8324c85b592cd24c3", "title": "Study on Road Network Vulnerability Considering the Risk of Landslide Geological Disasters in China's Tibet"}, {"paperId": "a74cdc0e7d26305b8f69ffaed88b90396f23f15f", "title": "Geological Hazard Susceptibility Analysis Based on RF, SVM, and NB Models, Using the Puge Section of the Zemu River Valley as an Example"}, {"paperId": "972bd0e7f8bfc2dda6c6eeb445d64cf014e42ea1", "title": "Ormancılıkta makine öğrenmesi kullanımı"}]}
