{"paperId": "699f489ac62e3b22fe1d047d83ff4754838e1ec4", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "Binary Star: Coordinated Reliability in Heterogeneous Memory Systems for High Performance and Scalability", "abstract": "As memory capacity scales, traditional cache and memory hierarchy designs are facing increasingly difficult challenges in ensuring high reliability with low storage and performance cost. Recent developments in 3D die-stacked DRAM caches and nonvolatile memories (NVRAMs) introduce promising opportunities in tackling the reliability, performance, and capacity challenges, due to the diverse reliability characteristics of the technologies. However, simply replacing DRAM with NVRAM does not solve the reliability issues of the memory system, as conventional memory system designs maintain separate reliability schemes across caches and main memory. Our goal in this paper is to enable a reliable and high-performance memory hierarchy design, as memory capacity scales. To this end, we propose Binary Star, which coordinates the reliability schemes and consistent cache writeback between 3D-stacked DRAM last-level cache and NVRAM main memory to maintain the reliability of the cache and the memory hierarchy. Binary Star significantly reduces the performance and storage overhead of consistent cache writeback by coordinating it with NVRAM wear leveling. As a result, Binary Star is much more reliable and offers better performance than state-of-the-art memory systems with error correction. On a set of memory-intensive workloads, we show that Binary Star reduces memory failures in time (FIT) by 92.9% compared to state-of-the-art error correction schemes, while retaining 99% of the performance of a conventional DRAM design that provides no error correction.", "venue": "Micro", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-10-12", "journal": {"name": "Proceedings of the 52nd Annual IEEE/ACM International Symposium on Microarchitecture"}, "authors": [{"authorId": "2111311521", "name": "Xiao Liu"}, {"authorId": "145488221", "name": "D. Roberts"}, {"authorId": "1999972", "name": "Rachata Ausavarungnirun"}, {"authorId": "145929920", "name": "O. Mutlu"}, {"authorId": "2109858015", "name": "Jishen Zhao"}], "citations": [{"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems"}, {"paperId": "b173f464ef74f8bfa424e51e4ae43ec000eb67ad", "title": "Unity ECC: Unified Memory Protection Against Bit and Chip Errors"}, {"paperId": "bd3d145d79a45bcf99d92bdbc475ed6a629f318a", "title": "A Survey of Memory-Centric Energy Efficient Computer Architecture"}, {"paperId": "28a073df01e0374f8ef3e9b5203331849aade72d", "title": "Microarchitectural Attacks in Heterogeneous Systems: A Survey"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "69e079f6a7067c8a9ee225b0b94dcd47664e94b4", "title": "History table-based linear analysis method for DRAM-PCM hybrid memory system"}, {"paperId": "3cd41d4590fab26813f38851651119f2037ae397", "title": "Reliability-aware Garbage Collection for Hybrid HBM-DRAM Memories"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "acdfe34aab867d1a0101c88dba299a56274388d8", "title": "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off"}]}
