{"paperId": "69a237c72a822e13a455024e5cb2a33ee4cb1251", "publicationVenue": null, "title": "Versatile AHU fault detection – Design, field validation and practical application", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-02-02", "journal": {"name": "Energy and Buildings", "pages": "110781", "volume": "237"}, "authors": [{"authorId": "117836694", "name": "O. Nehasil"}, {"authorId": "10367680", "name": "L. Dobiášová"}, {"authorId": "100469439", "name": "V. Mazanec"}, {"authorId": "35110631", "name": "J. Široký"}], "citations": [{"paperId": "9be0178ead8070e61954785d12745968b97782c8", "title": "Barriers and drivers for implementation of automatic fault detection and diagnosis in buildings and HVAC systems: An outlook from industry experts"}, {"paperId": "27c31afc4b702c8f17bd50cb61a480986c045aad", "title": "Machine Learning-Enabled Data-Driven Fault Detection for Predictive Maintenance in HVAC Systems"}, {"paperId": "c278d265935be653ea3e3f7865a52cbbd6ceaaf0", "title": "Gaussian Process for the Machine Learning-based Smart Fire Detection System"}, {"paperId": "6ae28dd52ec91ac0bb2a1f1d842c457a82864d47", "title": "Improving Building Occupant Comfort through a Digital Twin Approach: A Bayesian Network Model and Predictive Maintenance Method"}, {"paperId": "10dab5cc10f229f0caffdad49439be0cdfd2a972", "title": "Digital Twin framework for automated fault source detection and prediction for comfort performance evaluation of existing non-residential Norwegian buildings"}, {"paperId": "a9171b943fcae895c8124f66f0d21d671e2414f7", "title": "Implementation of the IDAIC Framework on an Air Handling Unit to Transition to Proactive Maintenance"}, {"paperId": "35aa144f11fcff61511c5e38f016d68494e2247f", "title": "A Review of Data-Driven Approaches and Techniques for Fault Detection and Diagnosis in HVAC Systems"}, {"paperId": "abdca96f6cf554edf0024800c6869d9a0ea5751c", "title": "A review of the Digital Twin technology for fault detection in buildings"}, {"paperId": "e2b0d675a867f832daf8e2890daa6ca53fd932fd", "title": "Algorithm for Validation of the Radar Digital Twin Based on the Results of Diagnostic Control Data Processing"}, {"paperId": "156dbf8c7518bca93be42c6f63b63fc6e317e6cf", "title": "Experimental studies of air-handling units’ faulty operation for the development of data-driven fault detection and diagnosis tools: A systematic review"}, {"paperId": "869eabda357332ab7012c5bbb09e699cd391a67e", "title": "Faulty Operation of Coils’ and Humidifier Valves in a Typical Air-Handling Unit: Experimental Impact Assessment of Indoor Comfort and Patterns of Operating Parameters under Mediterranean Climatic Conditions"}, {"paperId": "b9ac5c033773eef3fabaa3d125bbfdb3e9f990f5", "title": "Experimental assessment of ground-truth faults in a typical single-duct dual-fan air-handling unit under Mediterranean climatic conditions: impact scenarios of sensors’ offset and fans’ failure"}, {"paperId": "a9d67f892f68e8fbdb9123624f41058b825a2c90", "title": "A Digital Twin predictive maintenance framework of air handling units based on automatic fault detection and diagnostics"}, {"paperId": "9f9ca60c98a5d61730a07baae58b0ae8154075b0", "title": "Diagnosis for multiple faults of chiller using ELM-KNN model enhanced by multi-label learning and specific feature combinations"}, {"paperId": "1143a3cb00a686796d1c97c1104b326c6c0abdd2", "title": "Fault Detection Algorithm for Multiple-Simultaneous Refrigerant Charge and Secondary Fluid Flow Rate Faults in Heat Pumps"}]}
