{"paperId": "69a55518d276ccf7121d2f3c3edb193b666f5327", "publicationVenue": {"id": "9bb66e11-4952-4228-997b-bdf48fdc94d5", "name": "Cancer Informatics", "type": "journal", "issn": "1176-9351", "url": "http://la-press.com/journal.php?journal_id=10", "alternate_urls": ["http://la-press.com/journal.php?journal_id=10&pa=about_this_journal", "https://journals.sagepub.com/home/cixa", "http://insights.sagepub.com/journal.php?journal_id=10&tab=volume", "http://insights.sagepub.com/journal-cancer-informatics-j10", "https://journals.sagepub.com/home/cix"]}, "title": "Visual Analytics of Genomic and Cancer Data: A Systematic Review", "abstract": "Visual analytics and visualisation can leverage the human perceptual system to interpret and uncover hidden patterns in big data. The advent of next-generation sequencing technologies has allowed the rapid production of massive amounts of genomic data and created a corresponding need for new tools and methods for visualising and interpreting these data. Visualising genomic data requires not only simply plotting of data but should also offer a decision or a choice about what the message should be conveyed in the particular plot; which methodologies should be used to represent the results must provide an easy, clear, and accurate way to the clinicians, experts, or researchers to interact with the data. Genomic data visual analytics is rapidly evolving in parallel with advances in high-throughput technologies such as artificial intelligence (AI) and virtual reality (VR). Personalised medicine requires new genomic visualisation tools, which can efficiently extract knowledge from the genomic data and speed up expert decisions about the best treatment of individual patient’s needs. However, meaningful visual analytics of such large genomic data remains a serious challenge. This article provides a comprehensive systematic review and discussion on the tools, methods, and trends for visual analytics of cancer-related genomic data. We reviewed methods for genomic data visualisation including traditional approaches such as scatter plots, heatmaps, coordinates, and networks, as well as emerging technologies using AI and VR. We also demonstrate the development of genomic data visualisation tools over time and analyse the evolution of visualising genomic data.", "venue": "Cancer Informatics", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Cancer Informatics", "volume": "18"}, "authors": [{"authorId": "66496997", "name": "Zhonglin Qu"}, {"authorId": "67014931", "name": "Chng Wei Lau"}, {"authorId": "2831855", "name": "Quang Vinh Nguyen"}, {"authorId": "2118765004", "name": "Yi Zhou"}, {"authorId": "2835942", "name": "D. Catchpoole"}], "citations": [{"paperId": "6526e020f2db00242818e69fce441a69b3fc0b11", "title": "Understanding cancer patient cohorts in virtual reality environment for better clinical decisions: a usability study"}, {"paperId": "49e10aae86ea14d25007be8caf07919a52d13d89", "title": "A Game-Theoretical Approach to Clinical Decision Making with Immersive Visualisation"}, {"paperId": "86c672d9990b058a6852da18d561b2dbca8a39e0", "title": "Visualizing genomic data: The mixing perspective"}, {"paperId": "cd4f6e7d26658c5f02a7f3a19eb3f0acd57e8bd0", "title": "ICEVis: Interactive Clustering Exploration for tumor sub-region analysis in multiparametric cancer imaging"}, {"paperId": "241f9765e5e9e209c572e7440925ce8dec60e1dc", "title": "Virtual reality for the observation of oncology models (VROOM): immersive analytics for oncology patient cohorts"}, {"paperId": "43ecb22205ba8f0e147b99e955d1dc9d7403876a", "title": "MonaGO: a novel gene ontology enrichment analysis visualisation system"}, {"paperId": "5b9b302322799d43d35786b22acf4d9e0e762969", "title": "Review of Innovative Immersive Technologies for Healthcare Applications"}, {"paperId": "a8a49517f6eff81ad143f8271fe0a50259f50932", "title": "Explaining artificial intelligence with visual analytics in healthcare"}, {"paperId": "4a6cf8cd962b0ebe7d5983e83ce2bfd8d9fc2748", "title": "Exploring the Genomic Landscape of Cancer Patient Cohorts with GenVisR"}, {"paperId": "9db880820da67ea71e20971f847b87db87719ed4", "title": "STENCIL: A web templating engine for visualizing and sharing life science datasets"}, {"paperId": "1a6c1c473cfc305ce1c0ef177a3d221a40fa7cdd", "title": "Analysis of sputum microbial diversity in patients with different histological types of lung cancer"}, {"paperId": "d7a65a82c34833768451ca669ed83fb06688464c", "title": "A systematic review of emerging information technologies for sustainable data-centric health-care"}, {"paperId": "28de820e0863e1de4dfa33e52d9e226db0256935", "title": "Multi-point dimensionality reduction to improve projection layout reliability"}, {"paperId": "6b8b155fff6411111ac3cc41c8195e8edb3da836", "title": "MonaGO: a novel Gene Ontology enrichment analysis visualisation system"}, {"paperId": "416717c31defbc8fe8fed4541b3e2d84a9569f4d", "title": "ВІЗУАЛЬНА АНАЛІТИКА — ЕФЕКТИВНА ТЕХНОЛОГІЯ ОБРОБЛЕННЯ BIG DATA В МЕДИЦИНІ"}, {"paperId": "569f06e2b6c72553373b118bf186da6b0de0b70c", "title": "Tasks, Techniques, and Tools for Genomic Data Visualization"}, {"paperId": "79386a2325de97fd2afd925032976fe8be971561", "title": "Toward disease diagnosis visual support bridging classic and precision medicine"}, {"paperId": "430fe7caa2b165dd57aad9933057f82533b8edb5", "title": "Intelligent and Immersive Visual Analytics of Health Data"}, {"paperId": "6b2471b476a156851c97253053eb610828c9ff04", "title": "Recent Machine Learning Approaches for Single-Cell RNA-seq Data Analysis"}, {"paperId": "4041d4fd68e8262f6774f325ebb06776c011695b", "title": "Pathologist at work"}]}
