{"paperId": "69ad3fb58b3d422b50583f7791554d4fe7720b88", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Zero-Shot Cost Models for Out-of-the-box Learned Cost Prediction", "abstract": "In this paper, we introduce zero-shot cost models, which enable learned cost estimation that generalizes to unseen databases. In contrast to state-of-the-art workload-driven approaches, which require to execute a large set of training queries on every new database, zero-shot cost models thus allow to instantiate a learned cost model out-of-the-box without expensive training data collection. To enable such zero-shot cost models, we suggest a new learning paradigm based on pre-trained cost models. As core contributions to support the transfer of such a pre-trained cost model to unseen databases, we introduce a new model architecture and representation technique for encoding query workloads as input to those models. As we will show in our evaluation, zero-shot cost estimation can provide more accurate cost estimates than state-of-the-art models for a wide range of (real-world) databases without requiring any query executions on unseen databases. Furthermore, we show that zero-shot cost models can be used in a few-shot mode that further improves their quality by retraining them just with a small number of additional training queries on the unseen database.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-03", "journal": {"name": "Proc. VLDB Endow.", "pages": "2361-2374", "volume": "15"}, "authors": [{"authorId": "81786870", "name": "Benjamin Hilprecht"}, {"authorId": "2691974", "name": "Carsten Binnig"}], "citations": [{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation"}, {"paperId": "7f9c5100c7ce53280e109ce1b331a60cddd8328b", "title": "COSTREAM: Learned Cost Models for Operator Placement in Edge-Cloud Environments"}, {"paperId": "551ff631d62b524cae31f44fb9af2ad812db5cfb", "title": "Stage: Query Execution Time Prediction in Amazon Redshift"}, {"paperId": "8e0175e00163e80aea89daf12474cbe68643fb99", "title": "Rethinking Learned Cost Models: Why Start from Scratch?"}, {"paperId": "b76e903b9f1a9c7c51962a79eda10885efda1d35", "title": "Sample-Efficient Cardinality Estimation Using Geometric Deep Learning"}, {"paperId": "4b3c6e8c18714e58a2742b9c804dd5799ed7d119", "title": "QCFE: An efficient Feature engineering for query cost estimation"}, {"paperId": "c485924b4dac6bf46a45732dbe5569c058cb8546", "title": "TpuGraphs: A Performance Prediction Dataset on Large Tensor Computational Graphs"}, {"paperId": "9243a213d4d0b296e653acc56c3432a0eeb3c805", "title": "Optimizing the cloud? Don't train models. Build oracles!"}, {"paperId": "4f2be887e991efa85f7b874e7ab871080a745c39", "title": "CAESURA: Language Models as Multi-Modal Query Planners"}, {"paperId": "86504845c4f0544bfca5a9fbc89f3ae2a3685adb", "title": "Check Out the Big Brain on BRAD: Simplifying Cloud Data Processing with Learned Automated Data Meshes"}, {"paperId": "6637b092a20b26a0376ca31a32742f6a0acf93af", "title": "Zero-Shot Cost Models for Parallel Stream Processing"}, {"paperId": "65eca63de01a9e43fec47ea70f67f312acf61eb0", "title": "Auto-WLM: Machine Learning Enhanced Workload Management in Amazon Redshift"}, {"paperId": "b4ac6825a237beb0febd2abb9047da31f5e7cdf7", "title": "BitE : Accelerating Learned Query Optimization in a Mixed-Workload Environment"}, {"paperId": "f497094c7763eb86275ea4798859d9795f1398dc", "title": "Learned Query Superoptimization"}, {"paperId": "77566e8ceea14a8ba87c56bb038a4436e430c5ba", "title": "Less is More: Towards Lightweight Cost Estimator for Database Systems"}, {"paperId": "ffbcb2112645d3c82eb0027de0c2c6caac991810", "title": "ML-Powered Index Tuning: An Overview of Recent Progress and Open Challenges"}, {"paperId": "314dbbfc85dd380c8bb5059e5af974c4bfe44d8f", "title": "Zero-shot cost models for distributed stream processing"}, {"paperId": "397b1647d0f13ad4934b815ef39d8aa3a35b8091", "title": "PANDA: performance prediction for parallel and dynamic stream processing"}, {"paperId": "3697561ebf4543d49d3cf27f47e05acd229deab7", "title": "QPSeeker: An Efficient Neural Planner combining both data and queries through Variational Inference"}, {"paperId": "113257034270314a644d95532d5608c77e2de5d5", "title": "Toulouse: Learning Join Order Optimization Policies for Rule-based Data Engines"}, {"paperId": "3053cd1588bb64497860c204d5c09ce6a3cc2797", "title": "Learn What Really Matters: A Learning-to-Rank Approach for ML-based Query Optimization"}, {"paperId": "b9be91244d02909d11fc8bd1b867ffba86d24e63", "title": "Workload-Driven Data Placement for Tierless In-Memory Database Systems"}, {"paperId": "4d6c31599cefddf90133b1907aa7d42ed8de04ff", "title": "Learned Query Superoptimization (Extended Abstract)"}, {"paperId": "2c3a1a39db3c2c509a36044a501c53e81161b77a", "title": "Go Meta of Learned Cost Models: On the Power of Abstraction"}]}
