{"paperId": "69ae2d6128094a3a97e503badeaff4989519828e", "publicationVenue": {"id": "9d83259d-8d79-4e98-a9e5-6237469bc057", "name": "IEEE International Conference on Networking, Architecture and Storages", "type": "conference", "alternate_names": ["Netw Archit Storage", "IEEE Int Conf Netw Archit Storage", "NAS", "Networking, Architecture and Storages"]}, "title": "An Adaptive SSD Cache Architecture Simultaneously Using Multiple Caches", "abstract": "Due to a notably higher cost per bit of storage capacity, NAND flash memory solid state drives (SSDs) are not expected to completely replace hard disk drives (HDDs) in the near future. Using SSDs as a cache for HDDs, however, proved very effective in increasing the performance of storage systems. The performance increase depends strongly on both the SSD cache design and the workload applied to the storage system. However, distinct parts of the data may exhibit significantly different access patterns that potentially change rapidly and unpredictably over time. This particularly applies to complex dynamic systems, such as virtualized environments. Existing SSD cache architectures are not able to exploit such differences in access patterns, as they only use a single cache design, even when adapting certain cache parameters.In this paper, we propose a novel generic architecture for adaptive block-level SSD caches that simultaneously employs multiple SSD caches with complementary designs. The goal is to use for each kind of access pattern the SSD cache design that fits the pattern best. Results of our experimental evaluation show that the proposed SSD cache architecture adapts to different workloads well. For a broad range of workloads, it provides an overall throughput that is comparable to the respective best single cache design, whereas it is able to outperform these cache designs for superimposed mixed workloads and workloads with changing characteristics.", "venue": "IEEE International Conference on Networking, Architecture and Storages", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE International Conference on Networking, Architecture and Storage (NAS)", "pages": "1-10"}, "authors": [{"authorId": "3010650", "name": "Nikolaus Jeremic"}, {"authorId": "1680898", "name": "Helge Parzyjegla"}, {"authorId": "1702129", "name": "Gero Mühl"}], "citations": []}
