{"paperId": "69b2fa0adb990e433d361ca78a112a35a0caffca", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "E-Commerce Promotions Personalization via Online Multiple-Choice Knapsack with Uplift Modeling", "abstract": "Promotions and discounts are essential components of modern e-commerce platforms, where they are often used to incentivize customers towards purchase completion. Promotions also affect revenue and may incur a monetary loss that is often limited by a dedicated promotional budget. We propose an Online Constrained Multiple-Choice Promotions Personalization framework, driven by causal incremental estimations achieved by uplift modeling. Our work formalizes the problem as an Online Multiple-Choice Knapsack Problem and extends the existent literature by addressing cases with negative weights and values as a result from causal estimations. Our real-time adaptive method guarantees budget constraints compliance achieving above 99.7% of the potential optimal impact on various datasets. It was deployed in a large-scale experimental study at Booking.com - one of the leading online travel platforms in the world. The application resulted in 162% improvement in sales while complying a zero-budget constraint, enabling long-term self-sponsored promotional campaigns.", "venue": "International Conference on Information and Knowledge Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-08-11", "journal": {"name": "Proceedings of the 31st ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": "2051972227", "name": "Javier Albert"}, {"authorId": "48832237", "name": "Dmitri Goldenberg"}], "citations": [{"paperId": "0dfaaaa791f52b0ed9b99a42b36b1090b818b54c", "title": "Maximizing the Success Probability of Policy Allocations in Online Systems"}, {"paperId": "50f91623dbe2f69707188ce92bf5cb09e33ec384", "title": "Optimal instant discounts of multiple ride options at a ride-hailing aggregator"}, {"paperId": "6fdc38cad2499b0fc43f6ed0ef0a0952279d5e6c", "title": "Uplift Modeling: From Causal Inference to Personalization"}, {"paperId": "581b072570a1b993bb84842b7a2ab2acbd11a770", "title": "A Personalized Automated Bidding Framework for Fairness-aware Online Advertising"}, {"paperId": "772a2afc683b74b8aafa4dce49d902019c5208fb", "title": "A Multi-stage Framework for Online Bonus Allocation Based on Constrained User Intent Detection"}, {"paperId": "54101015ed95794ee3cb4dc0bd8df71ab4891910", "title": "Incremental Profit per Conversion: a Response Transformation for Uplift Modeling in E-Commerce Promotions"}, {"paperId": "47b96d757ed9601b273894902d3ee64a10037be1", "title": "Qini Curves for Multi-Armed Treatment Rules"}, {"paperId": "9dfe11fafe81ced965c0c0c3c3f8ade6fd88d1f9", "title": "Explicit Feature Interaction-aware Uplift Network for Online Marketing"}, {"paperId": "9a4cf2645a3f5b853c8be12f9f15b72cde9d4b13", "title": "An End-to-End Framework for Marketing Effectiveness Optimization under Budget Constraint"}, {"paperId": "073a932d5acd4ae9f1d21507f0642c1568b691dc", "title": "Personalizing Benefits Allocation Without Spending Money: Utilizing Uplift Modeling in a Budget Constrained Setup"}, {"paperId": "80164acc2fa5432e21ea2dcf7d1545da483ab04e", "title": "Personalized Promotion Decision Making Based on Direct and Enduring Effect Predictions"}, {"paperId": "7bb9d23350dbf3cce456475df7b84731716f3202", "title": "Optimization Levers for Promotions Personalization Under Limited Budget"}]}
