{"paperId": "69c44cbd6a1f1d3300a478bbcc68680cb961203d", "publicationVenue": {"id": "9c458056-3a41-495e-9950-29b463d5dfac", "name": "International Conference on Awareness Science and Technology", "type": "conference", "alternate_names": ["ICAST", "International Student Conference Advanced Science and Technology", "IEEE Int Conf Adapt Sci  Technol", "IEEE International Conference on Adaptive Science & Technology", "iCAST", "International Conference on Advances of Science and Technology", "Int Stud Conf Adv Sci Technol", "Int Conf Aware Sci Technol", "Int Conf Adv Sci Technol"], "url": "https://link.springer.com/conference/icast1"}, "title": "D-Alarm: An Efficient Driver Drowsiness Detection and Alarming System", "abstract": "In the coming years, the demand for IoT devices connecting our homes, cities, and industries will grow significantly. We now inhabit a world where interconnected smart devices can be controlled through single commands, fostering an era of automation, particularly in smart homes. IoT is at the forefront of this transformation, with many of these devices relying on machine learning models to decode data and make accurate predictions. However, as the number of connected devices escalates, network congestion becomes a challenge. To address this, incorporating machine learning intelligence into edge devices is essential. Edge computing, which involves processing data closer to its source, reduces latency and enables faster analysis. Consequently, IoT data can be gathered and processed at the edge, reducing the reliance on cloud-based solutions. Yet, deploying machine learning models on small IoT microcontroller units presents memory and computation constraints. This paper introduces a deep learning model for driver engagement recognition in real-time video streams, alongside optimization techniques for deployment on edge devices like Nvidia Jetson. The goal is to facilitate the execution of machine learning models on compact, low-power integrated circuits, addressing this critical bottleneck.", "venue": "International Conference on Awareness Science and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-08", "journal": {"name": "2023 6th International Conference on Advances in Science and Technology (ICAST)", "pages": "203-208"}, "authors": [{"authorId": "2289988468", "name": "Biju Borah"}, {"authorId": "2290132474", "name": "Shyamapada Mukherjee"}], "citations": []}
