{"paperId": "69cfc061da693b427302efd468664791191f8338", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "A Comparative Study of Unsupervised Anomaly Detection Algorithms used in a Small and Medium-Sized Enterprise", "abstract": "—Anomaly detection finds application in several industries and domains. The anomaly detection market is growing driven by the increasing development and dynamic adoption of emerging technologies. Depending on the type of supervision, there are three main types of anomaly detection techniques: unsupervised, semi-supervised, and supervised. Given the wide variety of available anomaly detection algorithms, how can one choose which approach is most appropriate for a particular application? The purpose of this evaluation is to compare the performance of five unsupervised anomaly detection algorithms applied to a specific dataset from a small and medium-sized software enterprise, presented in this paper. To reduce the cost and complexity of a system developed to solve the problem of anomaly detection, a solution is to use machine learning (ML) algorithms that are available in one of the open-source libraries, such as the scikit-learn library or the PyOD library. These algorithms can be easily and quickly integrated into a low-cost software application developed to meet the needs of a small and medium-sized enterprise (SME). In our experiments, we considered some unsupervised algorithms available in PyOD library. The obtained results are presented, alongside with the limitations of the research.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2186787402", "name": "Irina Petrariu"}, {"authorId": "2186787070", "name": "Adrian Moscaliuc"}, {"authorId": "144393558", "name": "C. Turcu"}, {"authorId": "2790509", "name": "O. Gherman"}], "citations": []}
