{"paperId": "69d2966d19dbe58a241eb5fe88c8d306625e58e9", "publicationVenue": {"id": "58a7d34a-77f4-4456-a052-d3ca0734b961", "name": "Expert Opinion on Investigational Drugs", "type": "journal", "alternate_names": ["Expert Opin Investig Drug"], "issn": "1354-3784", "url": "http://www.ashley-pub.com/loi/eid", "alternate_urls": ["http://informahealthcare.com/journal/eid", "http://www.tandfonline.com/openurl?genre=journal&stitle=ieid20", "http://puck.ashley-pub.com/vl=7681552/cl=12/nw=1/rpsv/journal/journal5_home.htm", "http://informahealthcare.com/loi/eid", "https://www.tandfonline.com/toc/ieid20/current"]}, "title": "Promising phase II biologics for future Crohn’s disease therapy", "abstract": "ABSTRACT Introduction Although the physician’s therapeutic arsenal of Crohn’s Disease (CD) is rapidly expanded over the next 25 years, a significant proportion of patients remain non-responders, or develop a loss of response or intolerance to current therapies, indicating a need for new therapeutic strategies in CD. Areas covered This review examines the efficacy and safety data from phase II clinical trials on biologics, performed in patients with moderate-to-severe CD. A PubMed database literature review was conducted for relevant articles published from 2017 to 2022. Ongoing clinical phase II trials were retrieved from ClinicalTrials.gov database or abstracts from major congresses. Future perspectives for the treatment of CD patients with these new molecules were also discussed. Expert opinion Among the most promising biologics are interleukin (IL)-23p19 inhibitors (guselkumab, mirikizumab, and brazikumab), IL-6 inhibitors, and anti-adhesion molecules (ontamalimab). Furthermore, multiple biologics with different mechanisms of action are in clinical development for moderate-to-severe CD including molecules with anti-fibrotic mechanism of action (anti-TL1A, anti-IL-36 receptor). In addition to efficacy, some of them provide reassuring safety profiles. Phase III trials need to confirm these results, especially on their long-term safety issues.", "venue": "Expert Opinion on Investigational Drugs", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-05-30", "journal": {"name": "Expert Opinion on Investigational Drugs", "pages": "495 - 507", "volume": "32"}, "authors": [{"authorId": "50247656", "name": "P. Wils"}, {"authorId": "2379943", "name": "S. Danese"}, {"authorId": "1387474555", "name": "L. Peyrin-Biroulet"}], "citations": [{"paperId": "e009b4b2512c411ab77a6b42950b532459097212", "title": "Fibrosis in IBD: from pathogenesis to therapeutic targets."}]}
