{"paperId": "69d47d9b33fb254e95b7caf6333735161883cf66", "publicationVenue": {"id": "eb593b96-7960-443d-a161-ed5df7e41e4e", "name": "Applied Physics Letters", "type": "journal", "alternate_names": ["Appl Phys Lett"], "issn": "0003-6951", "url": "http://apl.aip.org/", "alternate_urls": ["https://aip.scitation.org/journal/apl", "http://ieeexplore.ieee.org/servlet/opac?punumber=4816218"]}, "title": "Reservoir computing based on electric-double-layer coupled InGaZnO artificial synapse", "abstract": "Physical reservoir computing (PRC) is thought to be a potential low training-cost temporal processing platform, which has been explored by the nonlinear and volatile dynamics of materials. An electric-double-layer (EDL) formed at the interface between a semiconductor and an electrolyte provided a great potential for building high energy-efficiency PRC. In this Letter, EDL coupled indium-gallium-zinc-oxide (IGZO) artificial synapses are used to implement reservoir computing (RC). Rich reservoir states can be obtained based the ionic relaxation-based time multiplexing mask process. Such an IGZO-based RC device exhibits nonlinearity, fade memory properties, and a low average power of ∼9.3 nW, well matching the requirement of a high energy-efficiency RC system. Recognition of handwritten digit and spoken-digit signals is simulated with an energy consumption per reservoir state of ∼1.9 nJ, and maximum accuracy of 90.86% and 100% can be achieved, respectively. Our results show a great potential of exploiting such EDL coupling for realizing a physical reservoir that would underlie a next-generation machine learning platform with a lightweight hardware structure.", "venue": "Applied Physics Letters", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-23", "journal": {"name": "Applied Physics Letters"}, "authors": [{"authorId": "2152917627", "name": "Yang Yang"}, {"authorId": "2189758876", "name": "Hangyuan Cui"}, {"authorId": "2132776618", "name": "Shuo Ke"}, {"authorId": "104896912", "name": "Mengjiao Pei"}, {"authorId": "2189742254", "name": "Kailu Shi"}, {"authorId": "1796829", "name": "C. Wan"}, {"authorId": "144217450", "name": "Qing Wan"}], "citations": [{"paperId": "c900a2ff89e00d0aebd1e8e94b0e0311f80ba9af", "title": "Oxide Ionic Neuro-Transistors for Bio-inspired Computing"}, {"paperId": "785f1090e96d1f23abf6b053c6ab072bb7e1e5ba", "title": "Physical reservoirs based on MoS2-HZO integrated ferroelectric field-effect transistors for reservoir computing systems."}, {"paperId": "a4c9d66947a728988a67b8c2a2d083c31743d24f", "title": "Task-Adaptive Neuromorphic Computing Using Reconfigurable Organic Neuristors with Tunable Plasticity and Logic-in-Memory Operations."}, {"paperId": "d2f50b2fa2682480496ccf4a54674c16370f92b1", "title": "Mixed-Frequency Signal Processing Implemented by a Multi-Terminal Electrolyte-Gated Transistor-Based Physical Reservoir"}, {"paperId": "c576c9fe450e51dfe6d666e66faa1ead9423c221", "title": "Improved dynamic characteristics of oxide electrolyte-gated transistor for time-delayed reservoir computing"}, {"paperId": "74a5567a9ba027fcbd90803de1bf1e8c995aadf9", "title": "Oxide‐Based Electrolyte‐Gated Transistors with Stable and Tunable Relaxation Responses for Deep Time‐Delayed Reservoir Computing"}, {"paperId": "e483fb174eb6e4b7180bb6d934f234117321d450", "title": "Emerging memristors and applications in reservoir computing"}, {"paperId": "ad5f2fa34c397e358f5b8b9412d3a007d7f50b19", "title": "In-sensor reservoir computing based on optoelectronic synaptic devices"}, {"paperId": "24982f057fed3fb1bbf36e4507b73a84bfb1fa84", "title": "CMOS-compatible neuromorphic devices for neuromorphic perception and computing: a review"}, {"paperId": "caf110d33e9c1d42b74a6d9d9836f63808c0cb60", "title": "In2O3 Nanofiber Neuromorphic Transistors for Reservoir Computing"}, {"paperId": "d60eed7ed689abea69646d5c2e7e91917d41b7d8", "title": "Deep reservoir computing based on self-rectifying memristor synapse for time series prediction"}]}
