{"paperId": "69d4a3562251337c73fb395212d8686c03c96432", "publicationVenue": null, "title": "Benchmarking AyraDB Next-Generation Database on Davinci-1 Super-Computer", "abstract": "This paper presents the results of a 1-year project aimed at testing the performance and scalability of AyraDB, a next-generation database, on Davinci-1 super-computer. AyraDB is unique as it is fully peer-to-peer , with no central node to coordinate other storage nodes and no need for caching data in-memory , with consequent linear scalability. All competing solutions, including the most popular databases such as MongoDB and Redis, are not fully peer-to-peer, have central coordination nodes and/or cache data in memory with a bottleneck to scalability. These unique features make AyraDB particularly suitable to store and retrieve satellite data, which are notoriously challenging due to their size and layered structure, and position it as an enabler of new use cases in the space economy. In this paper, we present the results of a large-scale test aimed at verifying and measuring AyraDB’s performance on Davinci-1’s HPC infrastructure. An HPC infrastructure is in fact designed for data-and processing-intensive applications and can support scalability without infrastructural bottlenecks limiting software performance. Tests have been performed with a total of 500 runs on a number of 8-core servers growing from 1 to 20 and a data size growing from 10 Gbyte to 500 Gbyte. Results show how AyraDB reaches 1 million requests/s with 13 servers, with linear scalability and consistent read/write performance, beating the state of the art by 5X factor.", "venue": "itaDATA", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "132-143"}, "authors": [{"authorId": "1726076", "name": "C. Cavazzoni"}, {"authorId": "1734801", "name": "C. Francalanci"}, {"authorId": "3129018", "name": "P. Giacomazzi"}, {"authorId": "2256245252", "name": "Nicolò Magini"}, {"authorId": "2075737718", "name": "R. Morelli"}, {"authorId": "2160116737", "name": "Paolo Ravanelli"}], "citations": []}
