{"paperId": "69d622c789942c26c748fd985a0f83f999b0c7d5", "publicationVenue": {"id": "1042faa2-59ed-4755-bc0d-be06dc2e3707", "name": "Electronic library", "type": "journal", "alternate_names": ["Electron Libr", "The Electronic Library", "Electron libr"], "issn": "0264-0473", "url": "https://www.emerald.com/insight/publication/issn/0264-0473", "alternate_urls": ["http://www.emeraldinsight.com/loi/el"]}, "title": "Analysing reader behaviours in self-service library stations using a bibliomining approach", "abstract": "\nPurpose\nThe present study aims, by adopting bibliomining, to analyse the borrowing and collection records in self-service libraries at mass rapid transit stations in northern Taiwan to discover reader borrowing preferences and patterns.\n\n\nDesign/methodology/approach\nThe current study used data mining to analyse two years of book-borrowing information from self-service library stations; it made use of an association rule mining model and the bibliomining process to identify readers’ preferred books and to explore reader borrowing behaviours. In addition, the librarians’ perceptions of the proposed approach were also investigated.\n\n\nFindings\nThe findings indicated that readers often borrowed books in the bibliographical classifications of Home economics; Medical sciences; Psychology; Commerce: administration and management; and Education in the self-service library stations. Based on the bibliomining results, 23 reader borrowing patterns as well as potential books favoured by readers were uncovered. In addition, the challenges of bibliomining and data mining applied to library operations are reported.\n\n\nOriginality/value\nAmong the studies on the application of self-service technologies in libraries, most examined the integration of the self-service system and investigated users’ opinions. The present study used borrowing records and collection records in self-service library stations to conduct bibliomining and to explore reader borrowing preferences and behaviours as references for collection development and book recommendation services.\n", "venue": "Electronic library", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-09", "journal": {"name": "Electron. Libr.", "pages": "1-16", "volume": "39"}, "authors": [{"authorId": "35656591", "name": "Y. Tu"}, {"authorId": "7434987", "name": "Shao-Chen Chang"}, {"authorId": "144217709", "name": "Gwo-jen Hwang"}], "citations": [{"paperId": "a2c4bcb2277cb99ac8cd21b1a47f0f841dbafd82", "title": "Empirical study of college students’ extracurricular reading preference by functional data analysis of the library book borrowing behavior"}, {"paperId": "fc39c9313349f6ceebac08fbdbb40f1cec4f3601", "title": "Big data-driven investigation into the maturity of library research data services (RDS)"}]}
