{"paperId": "69e2dee41ae26836e754d51a5ac778a38f5268ec", "publicationVenue": null, "title": "An Adaptive Construction Method of Hierarchical Spatio-Temporal Index for Vector Data under Peer-to-Peer Networks", "abstract": "Spatio-temporal indexing is a key technique in spatio-temporal data storage and management. Indexing methods based on spatial filling curves are popular in research on the spatio-temporal indexing of vector data in the Not Relational (NoSQL) database. However, the existing methods mostly focus on spatial indexing, which makes it difficult to balance the efficiencies of time and space queries. In addition, for non-point elements (line and polygon elements), it remains difficult to determine the optimal index level. To address these issues, this paper proposes an adaptive construction method of hierarchical spatio-temporal index for vector data. Firstly, a joint spatio-temporal information coding based on the combination of the partition and sort key strategies is presented. Secondly, the multilevel expression structure of spatio-temporal elements consisting of point and non-point elements in the joint coding is given. Finally, an adaptive multi-level index tree is proposed to realize the spatio-temporal index (Multi-level Sphere 3, MLS3) based on the spatio-temporal characteristics of geographical entities. Comparison with the XZ3 index algorithm proposed by GeoMesa proved that the MLS3 indexing method not only reasonably expresses the spatio-temporal features of non-point elements and determines their optimal index level, but also avoids storage hotspots while achieving spatio-temporal retrieval with high efficiency.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-12", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "512", "volume": "8"}, "authors": [{"authorId": "2128670244", "name": "Chengming Li"}, {"authorId": "50062126", "name": "Zheng Wu"}, {"authorId": "10418459", "name": "Pengda Wu"}, {"authorId": "47122564", "name": "Zhanjie Zhao"}], "citations": [{"paperId": "0337cee822357d8f32ae93394a1af7c3bfa4ee40", "title": "MSTGI: a multi-scale spatio-temporal grid index model for remote-sensing big data retrieval"}, {"paperId": "cce653099a55a87986e5565cc55daeff731e7464", "title": "Tinba: Incremental partitioning for efficient trajectory analytics"}, {"paperId": "20fc079a6116c2e72cfffc5ae8c8a1b520633e06", "title": "W-Hilbert: A W-shaped Hilbert curve and coding method for multiscale geospatial data index"}, {"paperId": "eba0ffeffa6821eeaaafaf9359e0c00454d5be96", "title": "A fast two-level grid index algorithm for common edge extraction in vector data compression"}, {"paperId": "bbfc8f02a9315c11f277fa6d184528cf81e7a6a8", "title": "Adaptive Spatio-Temporal Query Strategies in Blockchain"}, {"paperId": "7b33e3b17fe36b5c90f33f0d59539d5beb184379", "title": "A Multiresolution Vector Data Compression Algorithm Based on Space Division"}, {"paperId": "93bd830b9c6e0fe1233d40f1a82d525c11033ed1", "title": "ST-Trie: A Novel Indexing Scheme for Efficiently Querying Heterogeneous, Spatiotemporal IoT Data"}, {"paperId": "d886da2548a08e4861656f688f181dd983fa4fca", "title": "Global multi-scale grid integer coding and spatial indexing: A novel approach for big earth observation data"}]}
