{"paperId": "69e5bd4a63a5a5db0a720d2df64845c49750f718", "publicationVenue": {"id": "7f22f2c3-81fc-4aa8-8501-b1d58b193fa5", "name": "Information Technology Convergence and Services", "type": "conference", "alternate_names": ["Innov Theor Comput Sci", "ITCS ", "Inf Technol Converg Serv", "Information Technology and Computer Science", "Inf Technol Comput Sci", "Conf Innov Theor Comput Sci", "Conference on Innovations in Theoretical Computer Science", "Innovations in Theoretical Computer Science", "ITCS"], "url": "http://itcs-conf.org/"}, "title": "Adaptive Massively Parallel Constant-round Tree Contraction", "abstract": "Miller and Reif's FOCS'85 classic and fundamental tree contraction algorithm is a broadly applicable technique for the parallel solution of a large number of tree problems. Additionally it is also used as an algorithmic design technique for a large number of parallel graph algorithms. In all previously explored models of computation, however, tree contractions have only been achieved in $\\Omega(\\log n)$ rounds of parallel run time. In this work, we not only introduce a generalized tree contraction method but also show it can be computed highly efficiently in $O(1/\\epsilon^3)$ rounds in the Adaptive Massively Parallel Computing (AMPC) setting, where each machine has $O(n^\\epsilon)$ local memory for some $0<\\epsilon<1$. AMPC is a practical extension of Massively Parallel Computing (MPC) which utilizes distributed hash tables. In general, MPC is an abstract model for MapReduce, Hadoop, Spark, and Flume which are currently widely used across industry and has been studied extensively in the theory community in recent years. Last but not least, we show that our results extend to multiple problems on trees, including but not limited to maximum and maximal matching, maximum and maximal independent set, tree isomorphism testing, and more.", "venue": "Information Technology Convergence and Services", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-02", "journal": {"name": "ArXiv", "volume": "abs/2111.01904"}, "authors": [{"authorId": "1704161", "name": "M. Hajiaghayi"}, {"authorId": "147508395", "name": "Marina Knittel"}, {"authorId": "48985250", "name": "Hamed Saleh"}, {"authorId": "39262594", "name": "Hsin-Hao Su"}], "citations": [{"paperId": "9de8996b58e202d9cac1e0c1c276138ac5c140f1", "title": "Adaptive Massively Parallel Coloring in Sparse Graphs"}, {"paperId": "a3bf6669d19fa023117d026a7ce4b6f71b2484f0", "title": "Massively Parallel Tree Embeddings for High Dimensional Spaces"}, {"paperId": "1184fca17606e02554bd3ce2f8c330d829ecfa50", "title": "Adaptive Massively Parallel Connectivity in Optimal Space"}]}
