{"paperId": "69ef5235dbc515a4251a51a02d5eade14a81c6f7", "publicationVenue": {"id": "a8da62bb-605c-4638-8118-4041c9d6fdbc", "name": "Turkish Journal of Computer and Mathematics Education", "type": "journal", "alternate_names": ["Turk J Comput Math Educ"], "issn": "1309-4653", "url": "http://www.dergipark.gov.tr/turkbilmat"}, "title": "Integrated Security and Privacy Framework for Big Data in Hadoop MapReduce Framework", "abstract": "Public cloud infrastructure is widely used by enterprises to store and process big data. Cloud and its distributed computing phenomena not only provides scalable, available and affordable solution for storage and compute services but also raises security concerns. Many security solutions that came into existence encrypt data and allow accessing plaintext for data analytics in the confines of secure hardware. However, the fact remains that the large volumes of data is processed in distributed environment involving hundreds of commodity machines. There exist numerous communications between machines in MapReduce computing model. In the process, compromised MapReduce machines or functions are vulnerable to query based inference attacks on big data that lead to leakage of sensitive information. The main focus of this paper is to overcome the problem aforementioned. Towards this end, a methodology is proposed with an underlying algorithm for defeating query based inference attacks on big data in Hadoop. The proposed algorithm is known as Multi-Model Defence Against Query Based Inference Attacks (MMD-QBIA). A realistic attack model is considered for validating the effectiveness of the proposed methodology. Then an integrated framework for security and privacy to big data is evaluated. Cloudera Distribution Hadoop (CDH) is the environment used for empirical study. The experimental results revealed that the proposed solution prevents different kinds of query based inference attacks on big data besides security to big data in Hadoop MapReduce framework. \n ", "venue": "Turkish Journal of Computer and Mathematics Education", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-10", "journal": {"name": "Turkish Journal of Computer and Mathematics Education (TURCOMAT)"}, "authors": [{"authorId": "2278889623", "name": "Sirisha N, Et. al."}], "citations": [{"paperId": "a84e1574434d853db05ac953f8c89c7c3ed58c65", "title": "New Hybrid Intrusion Detection and Prevention System to Ensure Security and Privacy in Big Data"}, {"paperId": "38282e1baafa129106f787890b266020bf4bb545", "title": "Dual Layered Authentication Security for Sensitive Healthcare Data by Hadoop MapReduce"}, {"paperId": "3c905dd4d9d1c8156721c293403d536ca693b931", "title": "Survey of Computation Integrity Methods For Big Data"}]}
