{"paperId": "69fc7b1214f53c087a37bedac8178d6be626bbdf", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Tile-Based Framework with a Spatial-Aware Feature for Easy Access and Efficient Analysis of Marine Remote Sensing Data", "abstract": "Marine remote sensing (MRS) data provide an important tool for advancing global change research. However, the existing product service practices are insufficient for meeting the needs of a full-experience online application. This paper introduces a framework named SatANA, which is unified by a data tiling method with a spatial-aware feature, for integrated and intelligent improvements in visualization, storage and computing. The SatANA framework is supported by a hybrid database storage ideal for the cloud storage of massive MRS data. The raw data are displayed and roamed on a virtual globe through the Internet as tiles, enhancing their spatial awareness, that can be intelligently used for visualization result tuning, data storage preloading and distributed computing optimized indexing. To verify its feasibility and effectiveness, we applied this framework to a platform called SatCO2, which is devoted to providing convenient access to and the efficient utilization of MRS data.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-15", "journal": {"name": "Remote. Sens.", "pages": "1932", "volume": "12"}, "authors": [{"authorId": "78380108", "name": "Weiwen Ye"}, {"authorId": "2158118770", "name": "Feng Zhang"}, {"authorId": "2664798", "name": "Xianqiang He"}, {"authorId": "144615187", "name": "Yan Bai"}, {"authorId": "50268261", "name": "Ren-yi Liu"}, {"authorId": "3223068", "name": "Zhenhong Du"}], "citations": [{"paperId": "4206dc595c55c2d2241199717dec598916ead7b8", "title": "Cloud-Based Parallel Tiling Algorithm for Large Scale Remote Sensing Datasets"}, {"paperId": "15b1c1ece996fa677d24012cf24c04c3323c8802", "title": "A Modular Remote Sensing Big Data Framework"}]}
