{"paperId": "69fe8bdd6deaa0c3ba7a1a9c1f3543eb37e0f813", "publicationVenue": null, "title": "Why are events important and how to compute them in geospatial research?", "abstract": ": Geospatial research has long centered around objects. While attention to events is growing rapidly, events remain objectiﬁed in spatial databases. This paper aims to high-light the importance of events in scientiﬁc inquiries and overview general event-based approaches to data modeling and computing. As machine learning algorithms and big data become popular in geospatial research, many studies appear to be the products of convenience with readily adaptable data and codes rather than curiosity. By asking why events are important and how to compute events in geospatial research, the author intends to provoke thinking into the rationale and conceptual basis of event-based modeling and to emphasize the epistemological role of events in geospatial information science. Events are essential to understanding the world and communicating the understanding, events provide points of entry for knowledge inquiries and the inquiry processes, and events mediate objects and scaffold causality. We compute events to improve understanding, but event computing and computability depend on event representation. The paper brieﬂy reviews event-based data models in spatial databases and methods to compute events for site understanding and prediction, for spatial impact assessment, and for discovering events’ dynamic structures. Concluding remarks summarize key arguments and comment on opportunities to extend event computability.", "venue": "J. Spatial Inf. Sci.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-21", "journal": {"name": "J. Spatial Inf. Sci.", "pages": "47-61", "volume": "21"}, "authors": [{"authorId": "36502347", "name": "M. Yuan"}], "citations": [{"paperId": "e0a3c138da882735b261b53c4ba6e088c31563cf", "title": "Location Analytics of Routine Occurrences (LARO) to Identify Locations with Regularly Occurring Events with a Case Study on Traffic Accidents"}, {"paperId": "5c42d42be0164de797a0ce914d3703a68549bb16", "title": "A dynamic visualization based on conceptual graphs to capture the knowledge for disaster education on floods"}, {"paperId": "ffd606e90218637906ab3089e63d6f680a2111ce", "title": "A Process-Oriented Exploration of the Evolutionary Structures of Ocean Dynamics with Time Series of a Remote Sensing Dataset"}, {"paperId": "c70ca4bc574b3e516e1eebb2500bea16ed583c2b", "title": "JOSIS' 10th anniversary special feature: part two"}, {"paperId": "7bc040f4555eebe7a8806287ae7c540a0e28b550", "title": "Pyramidal Framework: Guidance for the Next Generation of GIS Spatial-Temporal Models"}]}
