{"paperId": "6a132499ca1dc0d23cfe7d5db841b819df63b51b", "publicationVenue": {"id": "b4ddf99b-89f6-42b4-8bbc-9bde693530cf", "name": "International Journal of Information Management", "type": "journal", "alternate_names": ["Int J Inf Manag"], "issn": "0268-4012", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/30434/description#description", "alternate_urls": ["https://www.journals.elsevier.com/international-journal-of-information-management", "http://www.sciencedirect.com/science/journal/02684012"]}, "title": "Artificial Intelligence (AI): Multidisciplinary perspectives on emerging challenges, opportunities, and agenda for research, practice and policy", "abstract": null, "venue": "International Journal of Information Management", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2019-08-27", "journal": {"name": "International Journal of Information Management"}, "authors": [{"authorId": "1724490", "name": "Yogesh Kumar Dwivedi"}, {"authorId": "2066599148", "name": "Laurie Hughes"}, {"authorId": "3446873", "name": "Elvira Ismagilova"}, {"authorId": "91018104", "name": "G. Aarts"}, {"authorId": "2235927", "name": "Crispin R. Coombs"}, {"authorId": "2285182", "name": "Tom Crick"}, {"authorId": "144521858", "name": "Y. Duan"}, {"authorId": "1410968693", "name": "R. Dwivedi"}, {"authorId": "143698898", "name": "J. Edwards"}, {"authorId": "121714298", "name": "Aled Eirug"}, {"authorId": "26898704", "name": "Vassilis Galanos"}, {"authorId": "2937059", "name": "P. Ilavarasan"}, {"authorId": "50817520", "name": "M. Janssen"}, {"authorId": "2168272578", "name": "Paul Jones"}, {"authorId": "2733956", "name": "A. Kar"}, {"authorId": "41074539", "name": "Hatice Kizgin"}, {"authorId": "1418648774", "name": "Bianca Kronemann"}, {"authorId": "1696747", "name": "Banita Lal"}, {"authorId": "3094343", "name": "B. Lucini"}, {"authorId": "2575165", "name": "R. Medaglia"}, {"authorId": "1404797274", "name": "K. L. Meunier-FitzHugh"}, {"authorId": "1415234363", "name": "L. Meunier-FitzHugh"}, {"authorId": "47033159", "name": "S. Misra"}, {"authorId": "52563419", "name": "E. Mogaji"}, {"authorId": "2038468629", "name": "S. Sharma"}, {"authorId": "153278840", "name": "Jang B. Singh"}, {"authorId": "35098701", "name": "Vishnupriya Raghavan"}, {"authorId": "2775338", "name": "R. Raman"}, {"authorId": "1688149", "name": "Nripendra P. Rana"}, {"authorId": "2032434", "name": "Spyridon Samothrakis"}, {"authorId": "66781543", "name": "Jak Spencer"}, {"authorId": "2191954", "name": "K. Tamilmani"}, {"authorId": "102927759", "name": "Annie Tubadji"}, {"authorId": "144340154", "name": "P. Walton"}, {"authorId": "2116399602", "name": "Michael D. Williams"}], "citations": [{"paperId": "ffbcc1535ef62189e23779fb40d393813a399245", "title": "Shift of ambidexterity modes: An empirical investigation of the impact of artificial intelligence in customer service"}, {"paperId": "9182330a48a3e4536cd6d633745f7bbbd1e0cdc4", "title": "Is this AI sexist? The effects of a biased AI’s anthropomorphic appearance and explainability on users’ bias perceptions and trust"}, {"paperId": "0e6941b5f8be2c94209a672c564f690ebc31e8b4", "title": "The governance of artificial intelligence in Canada: Findings and opportunities from a review of 84 AI governance initiatives"}, {"paperId": "880f4deb926e28f06e63aa9309a658a49d97bbdc", "title": "Optimizing IC engine efficiency: A comprehensive review on biodiesel, nanofluid, and the role of artificial intelligence and machine learning"}, {"paperId": "d9f7c1f266807bfb7bf62ac950fcc9a8e137092e", "title": "Convergence analysis of artificial intelligence research capacity: Are the less developed catching up with the developed ones?"}, {"paperId": "d139a68248d18fed0cb8a31fbc838e94099d418d", "title": "Examining the Influence of Artificial Intelligence Implementation in HRM Practices Using T-O-E Model"}, {"paperId": "f3da8d9161d5db4f787990fbf8162b69b8bf6efe", "title": "Understanding User Attitudes Towards AI-Enabled Technologies: An Integrated Model of Self-Efficacy, TAM, and AI Ethics"}, {"paperId": "d47e044b31d740ca9e622994bd0ebec0e2cb3f64", "title": "GOVERNMENT ARTIFICIAL INTELLIGENCE READINESS AND BRAIN DRAIN: INFLUENCING FACTORS AND SPATIAL EFFECTS IN THE EUROPEAN UNION MEMBER STATES"}, {"paperId": "10794705182e7d51913cbfd0b97522dc9a309eaf", "title": "Using Artificial Intelligence (AI) to Implement Diversity, Equity and Inclusion (DEI) into Marketing Materials: The ‘CONSIDER’ Framework"}, {"paperId": "fb853361c4dd9f6185ab2d6910799660b3306a2e", "title": "Predictive Analytics of Varieties of Potatoes"}, {"paperId": "8c207860def5a9b112622d03203c0408cd152973", "title": "Does applying financial engineering methods have an impact on improving production efficiency?   Does applying financial engineering methods have an impact on improving production efficiency?"}, {"paperId": "7a509e98624d6ae4efba7cb6a019c4e73b22725a", "title": "Digital learning, big data analytics and mechanisms for stabilizing and improving supply chain performance"}, {"paperId": "084b50af124f8052b21ac6ef8636d5a2e9dd8342", "title": "Machine-Learning Algorithms in the Service Life Prediction of Facility Management: Approach in Southern Chile"}, {"paperId": "7f40cab244c3b650ce8136f49e255f6e819ecd97", "title": "How does big data affect organizational financial performance in turbulent markets? The role of customer-linking and selling capabilities"}, {"paperId": "be584c407002646eb68d4afbadb5daadbc827d01", "title": "Developing big data enabled Marketing 4.0 framework"}, {"paperId": "9d75c3a76eb1f0a96b9bf3cbde62b2d553c3ce30", "title": "Artificial intelligence adoption in a professional service industry: A multiple case study"}, {"paperId": "45d099850f7c0fa057681a83d2e49794c11ab93b", "title": "Scientific Mapping of Chatbot Literature: A Bibliometric Analysis"}, {"paperId": "03b8d79367253c6fdd97dd4895e24c15ffdbb177", "title": "Decision support tools of sustainability assessment for urban stormwater management – A review of their roles in governance and management"}, {"paperId": "d095c8477525ce07f8c7a08cc36f02916a2320a6", "title": "Adoption and impacts of generative artificial intelligence: Theoretical underpinnings and research agenda"}, {"paperId": "2dca06581782662c95b2ee34614f83d5a85b437f", "title": "The influence of work overload on cybersecurity behavior: A moderated mediation model of psychological contract breach, burnout, and self-efficacy in AI learning such as ChatGPT"}, {"paperId": "6a1f8f8247574b831f3f2ea97f8ca146415ed255", "title": "Navigating and reviewing ethical dilemmas in AI development: Strategies for transparency, fairness, and accountability"}, {"paperId": "12be685687426658e9021f7068a12859c2751bb7", "title": "Challenges and strategies for wide-scale artificial intelligence (AI) deployment in healthcare practices: A perspective for healthcare organizations."}, {"paperId": "a779f5dd28c8aaab0e1bdceeb6700f17d655c0a4", "title": "The Role of AI in Hospitals and Clinics: Transforming Healthcare in the 21st Century"}, {"paperId": "194251f752071450eca2b78e0a950e36fd2270c7", "title": "A Comprehensive Evaluation of AI-Assisted Diagnostic Tools in ENT Medicine: Insights and Perspectives from Healthcare Professionals"}, {"paperId": "e6229a0f848f9d56741daf4bab39c6a6ad35900f", "title": "Insights into the application of AI-augmented research methods for informing accounting practice: the development – through AI - of accountability-related prescriptions pertaining to seasonal work"}, {"paperId": "7c1cf6274f6fbbfd25ef735110dee7cda8fc79cd", "title": "The power of AI: enhancing customer loyalty through satisfaction and efficiency"}, {"paperId": "bc30d137d455175baceea8ed5469c4cb880e5add", "title": "Exploring the Symbiotic Relationship between Digital Transformation, Infrastructure, Service Delivery, and Governance for Smart Sustainable Cities"}, {"paperId": "866263ff9cb7dd812f6b9dbea433b439145c7630", "title": "Engineering AI for provable retention of objectives over time"}, {"paperId": "80a864a7bc0e42a2b453c185bfa88beadd14d152", "title": "Artificial intelligence applications implication for ESG performance: can digital transformation of enterprises promote sustainable development?"}, {"paperId": "b4a245984d8ffed2f51b42b12cf8010baf4ac100", "title": "Leveraging artificial intelligence in firm-generated online customer communities: a framework and future research agenda"}, {"paperId": "5d50adbf45e0e4f66c462513f27030553d35814b", "title": "Trends in publication impact of evidence-based healthcare terminology (2013-2022)."}, {"paperId": "4c79db61d9cef02271fb7274426df40c29d61048", "title": "Use of Learning Media to Increase Student Motivation in Junior High School"}, {"paperId": "984e6ebef306ca9200fc0b236fdb8ac85c8ca7e4", "title": "Artificial Intelligence in Biology"}, {"paperId": "4ac7ce860fe429dd4d8e525a5c62571bfab91cf1", "title": "HOW TO STRENGTHENING OR WEAKENING THE PROCEDURES OF CORPORATE GOVERNANCE: AN ARTIFICIAL INTELLIGENCE PERSPECTIVE"}, {"paperId": "37eb0c2177acf85c74ace80a9365d610523bc64b", "title": "Introduction to the Issue on Artificial Intelligence in the Public Sector: Risks and Benefits of AI for Governments"}, {"paperId": "d60ceeb8aac71a13266e99921d3696d84f26c601", "title": "A Global Survey of Introductory Programming Courses"}, {"paperId": "19fd944cf4db276d437b2dbac044139ca2cb7199", "title": "Artificial intelligence is the magic wand making customer-centric a reality! An investigation into the relationship between consumer purchase intention and consumer engagement through affective attachment"}, {"paperId": "dd15882befb1235fc87cf3f224ac102f53c20cc3", "title": "Assessing the influence of artificial intelligence on agri-food supply chain performance: the mediating effect of distribution network efficiency"}, {"paperId": "845164d5a4819746f6022424b58d020bbf442e74", "title": "Predicting psycho-somatic disorders in online activity using multi-layer perceptron"}, {"paperId": "45245785a03eed0e26f2a150adbe0db013e3f194", "title": "Zooming in and out the landscape: Artificial intelligence and system dynamics in business and management"}, {"paperId": "552bbc2c5014c5229ed751e474ff7f49d27ee0ba", "title": "Generative artificial intelligence in innovation management: A preview of future research developments"}, {"paperId": "7d8650657f8c7b7d1878863382b55d41109881ca", "title": "How Service Robots Facilitate User Self-Disclosure: The Roles of Personality, Animacy, and Automated Social Presence"}, {"paperId": "ad7ab96f4d4314f9fc23b55c83e9847461851e93", "title": "Decoding the Relationship of Artificial Intelligence, Advertising, and Generative Models"}, {"paperId": "18ac2646bf6bc705e79bb782fcbd6934bd4a26fe", "title": "Leveraging cognitive digital twins in industry 5.0 for achieving sustainable development goal 9: An exploration of inclusive and sustainable industrialization strategies"}, {"paperId": "b15ba49517633071637e6961900572d23da460ae", "title": "When do employees learn from artificial intelligence? The moderating effects of perceived enjoyment and task-related complexity"}, {"paperId": "0b5e253fdf5055b599236ea28050be5893fc786b", "title": "Unlocking the impact of brand engagement in the metaverse on Real-World purchase intentions: Analyzing Pre-Adoption behavior in a futuristic technology platform"}, {"paperId": "7d3f08a3a9ec8a81533f4acc7ff3cd5cdd160955", "title": "Generative AI – The Revolutionizing Virtual Agents in Health Care"}, {"paperId": "10fd37dc1372a6434e730c982acdcc177801707d", "title": "The Impact of Artificial Intelligence Banking and Personal Interaction Quality towards Customer Retention with Customer Satisfaction as an Intervening Variable"}, {"paperId": "0ffd096a8b5d60a563ccf4cf100c24fe63ff56fd", "title": "Pandemic-Resilient Investment: Sustainable Knowledge Infrastructure for Medical AI"}, {"paperId": "2f2c7f73d2f57370b42d82eae23fdbc9dc96c1f3", "title": "Conformalized Selective Regression"}, {"paperId": "191a40059f43cda3cbe54654572a0612c2409148", "title": "Human Resource Management Through Artificial Intelligence Model in the Healthcare"}, {"paperId": "137c607b4a47c5c2ab95d81b0f396e3fc7b9da9d", "title": "The Role of Artificial Intelligence in Supply Chain Agility: A Perspective of Humanitarian Supply Chain"}, {"paperId": "f2fb5fd4215904dce654ee3f6b8011c1f3ccdc1b", "title": "Continuum Robots and Magnetic Soft Robots: From Models to Interdisciplinary Challenges for Medical Applications"}, {"paperId": "933b81ecaf746721213330b38bf9c05f1ef72842", "title": "Artificial Intelligence Adoption by SMEs to Achieve Sustainable Business Performance: Application of Technology–Organization–Environment Framework"}, {"paperId": "7e66319d5941d98b62481219a037a796372c7554", "title": "LEGAL FRAMEWORK FOR PROTECTING BANKING TRANSACTIONS IN THE METAVERSE AGAINST DEEPFAKE TECHNOLOGY"}, {"paperId": "5afc19a6c82f02fec80f182ad175bbfe1f2dba6a", "title": "Science 4.0 as a Model of Scientific Activity in an Innovative Environment of Industry 4.0"}, {"paperId": "6f04f66c824c43741057f1e4ceabb2ccd22b71fc", "title": "How Cognitive Biases Influence Problematic Research Methods Practices"}, {"paperId": "bc351e9bf74e2b6ad6e2459e04d8fff43d17dd16", "title": "The influence of AI text generators on critical thinking skills in UK business schools"}, {"paperId": "aa1b6eb2563523b72d01d2570f71a81930a83320", "title": "Artificial intelligence (AI) cybersecurity dimensions: a comprehensive framework for understanding adversarial and offensive AI"}, {"paperId": "dfee39bd85ce7da1bb38c5c9a8e76bdff3d4abfe", "title": "Analyzing Ghana's Pharmacy Act, 1994 (Act 489) Regarding Quality Control and Negligence Liability Measures for Artificial Intelligence Pharmacy Systems"}, {"paperId": "62c8c1fb00dfc08087830f767b55c96ad977bee7", "title": "Artificial Intelligence in Hospitality and Tourism: Insights From Industry Practices, Research Literature, and Expert Opinions"}, {"paperId": "6a9c796d561995221474615eedb04cee93795446", "title": "Artificial intelligence and the transformation of higher education institutions"}, {"paperId": "20f298e6a51a369a4442174edc5023bdeea8a2bf", "title": "Understanding users' voice assistant exploration intention: unraveling the differential mechanisms of the multiple dimensions of perceived intelligence"}, {"paperId": "a3a28c8c19d8482641941722020959de8204b68e", "title": "A Fault Detection System for Wiring Harness Manufacturing Using Artificial Intelligence"}, {"paperId": "3848a81f7bb0dfae91925b9e0eb8b6547d39726a", "title": "Artificial Intelligence Ethics Best Practices Model for Financial Decision-Making in Chinese Financial Institutions"}, {"paperId": "b03c540658bdaf495e8999074a3be537538b4d47", "title": "Impact of Artificial Intelligence on Manufacturing Industry Global Value Chain Position"}, {"paperId": "837fdb95e6267e3589155f55362420f22291aea6", "title": "Coupling Artificial Intelligence Capability and Strategic Agility for Enhanced Product and Service Creativity"}, {"paperId": "a8701928a9af002db6d80688a2cd6b0e09e6053a", "title": "The ethics of ChatGPT - Exploring the ethical issues of an emerging technology"}, {"paperId": "c0861ad33d2f7d341c2796d38f3de8a1348927fa", "title": "Perceived creepiness in response to smart home assistants: A multi-method study"}, {"paperId": "00ba37e057f2a2694fe78fe4c648c88dfbb64492", "title": "A framework for cyber-risk insurance against ransomware: A mixed-method approach"}, {"paperId": "4831f799768cc54132564b9a55549902b882725a", "title": "The effects of artificial intelligence applications in educational settings: Challenges and strategies"}, {"paperId": "91752ee39de4112d07c6b08e224357c5625ab3db", "title": "Artificial intelligence capabilities, dynamic capabilities and organizational creativity: contributing factors to the United Arab Emirates Government’s organizational performance"}, {"paperId": "e1bdeadfe4483178d90fce089640314cc346aacc", "title": "“Real impact”: Challenges and opportunities in bridging the gap between research and practice – Making a difference in industry, policy, and society"}, {"paperId": "961140544c6024f52a9ee42bc20c69737e5b4345", "title": "Using Artificial Intelligence to Label Free-Text Operative and Ultrasound Reports for Grading Pediatric Appendicitis"}, {"paperId": "dc4cde8dc4340904f9c9c368e6a50d0784eb5170", "title": "Understanding Chatbot Adoption in Local Governments: A Review and Framework"}, {"paperId": "9943742281e823d68c8aa4b769353f111005b071", "title": "Exploring behavior patterns in human and machine interactions"}, {"paperId": "df50e8e876919821db7a28e7330fa30f3db79bd6", "title": "The impending disruption of creative industries by generative AI: Opportunities, challenges, and research agenda"}, {"paperId": "d6e7ae833fcda793f8d280599ec606bd6bc032a3", "title": "Artificial intelligence in future nursing care: Exploring perspectives of nursing professionals - A descriptive qualitative study"}, {"paperId": "10922fae4358c15652965bf619b774456acd3c71", "title": "The impact of a blockchain-based food traceability system on the online purchase intention of organic agricultural products"}, {"paperId": "a3f2439da8e02bb1682a63a68c0667b13a801c63", "title": "The impact of artificial intelligence adoption for business-to-business marketing on shareholder reaction: A social actor perspective"}, {"paperId": "9de8ff688c908f8244aef33d38e3ee6a5198ffb1", "title": "How organizations can innovate with generative AI"}, {"paperId": "bda7f4d9f9529165bfc75e99c801813c7b1ca053", "title": "Artificial Intelligence for Impact Assessment of Administrative Burdens"}, {"paperId": "70fe329aae75da4f9bf87b38c6a6badc0d2e2824", "title": "AI energized hydrogel design, optimization and application in biomedicine"}, {"paperId": "c297d50d5e4dd95f8fd0073f510d7fea08a2401d", "title": "A comprehensive review on artificial intelligence in water treatment for optimization. Clean water now and the future."}, {"paperId": "477c2a98906679a71e846dd174f9e39eff905549", "title": "Work-life balance and its impact in modern organizations: An HR review"}, {"paperId": "24932b2885fd78b602a028d34f457d1d827693f8", "title": "Reviewing the role of AI in environmental monitoring and conservation: A data-driven revolution for our planet"}, {"paperId": "eeb9dfc08d44e587279327defe6bdd0081cd5c86", "title": "AI and machine learning in climate change research: A review of predictive models and environmental impact"}, {"paperId": "a783cc56ab03e26be8a35cf88daccaa6802fc949", "title": "Who are the publics engaging in AI?"}, {"paperId": "4950dfb9df1aae95b827b17fed1db409990e24f9", "title": "Tapping into AI Advancement: Strategies for Boosting Productivity and Performance"}, {"paperId": "de697d76c69e0feca1b419fc17bcaa552b382097", "title": "In the Era of Emerging Technologies: Discovering the Impact of Artificial Intelligence Capabilities on Timely Decision-Making and Business Performance"}, {"paperId": "9aadf73a45e74e4b7839d42ff68db35b28bab60f", "title": "Understanding Gen Z's Netflix usage in Indonesia: an Extended TAM perspective on willingness to subscribe"}, {"paperId": "ca1e34530314209f3ae193f4c6c7e767f38bc890", "title": "“ChatGPT says no”: agency, trust, and blame in Twitter discourses after the launch of ChatGPT"}, {"paperId": "e0792176b61ff1057729264b5e84313fbe536e97", "title": "Digital technologies in the AEC sector: a comparative study of digital competence among industry practitioners"}, {"paperId": "3ae1b016991f8b05928b1ce14cc43002a5715594", "title": "The Role of Artificial Intelligence in Developing Digital Transformation Skills Language Communication, and Scientific Trends among Students of the College of Education at Al Ain University"}, {"paperId": "3a57cff2670b967945f628baf9b23cb025f371e8", "title": "An Ambitious Artificial Intelligence Policy in a Decentralised Governance System: Evidence From Indonesia"}, {"paperId": "b78de7fff69e8456ed07b8598c6d3478bf021afe", "title": "Development trend and Challenge Analysis of Manufacturing Industry Under the Background of Artificial Intelligence"}, {"paperId": "788e244540a69019766113104be0f966f31e1bbf", "title": "AI-Enhanced Teaching Materials for Education: A Shift Towards Digitalization"}, {"paperId": "71d54cc950ad298dafbe5e034d13214e352fc60a", "title": "Is it the end of the technology acceptance model in the era of generative artificial intelligence?"}, {"paperId": "9ac1344c5aa35a21ca816731fc819d6f5c4cb8f7", "title": "Looking towards an automated future: U.S. attitudes towards future artificial intelligence instantiations and their effect"}, {"paperId": "450c87dc9458bfccbc35f2b41be101fb4a7f632f", "title": "A Machine Learning-Based AI Framework to Optimize the Recruitment Screening Process"}, {"paperId": "a8ecebcf9689eb81e16cd8c2b0da6a67bee029ac", "title": "Integrating role of green buildings in achieving carbon neutrality in an era of climate emergency"}, {"paperId": "4cbb1415fcea2b0a62c7630822400b0608858422", "title": "Navigating the perils of artificial intelligence: a focused review on ChatGPT and responsible research and innovation"}, {"paperId": "21bb1f4bc95eef12f7e94e2cd3bb97cd3128dbc3", "title": "Prediction of Traffic Incident Locations with a Geohash-Based Model Using Machine Learning Algorithms"}, {"paperId": "886f6e33b8c970e4f18769ecc4b048c3e88809c4", "title": "Revisiting the role of HR in the age of AI: bringing humans and machines closer together in the workplace"}, {"paperId": "6e109ad0773994e9fc82ee00e3e2ec3fe96d0936", "title": "Artificial intelligence in psychology: a commentary on AI’s emerging role and the ensuing conversation"}, {"paperId": "0a6484e3c3f137b384828ea9cfe2f8b9cee69b42", "title": "Artificial intelligence in supply chain management: enablers and constraints in pre-development, deployment, and post-development stages"}, {"paperId": "68747ce7fd01388942d8542fce434770340325d1", "title": "Innovative Supply Chain Management Strategies in Pakistan’s Textile Industry Amidst Global Economic Shifts"}, {"paperId": "7823b29446064c306963e979de26159709478410", "title": "Between artificial intelligence and customer experience: a literature review on the intersection"}, {"paperId": "77b4368897ca58937e23b7828d9df486ae7b51d4", "title": "ChatGPT in Education, Healthcare, and Cybersecurity: Opportunities and Challenges"}, {"paperId": "659c402d726b8b6e2998655440a315607e8facbd", "title": "The Impact of Artificial Intelligence (AI) on the Accounting System of Saudi Companies"}, {"paperId": "e96bb9b1a63b10d12a5e39f4cf4fea24b0f00332", "title": "A longitudinal study on artificial intelligence adoption: understanding the drivers of ChatGPT usage behavior change in higher education"}, {"paperId": "fda41b189f07d6e0b6997faa4a9b3e68ed814179", "title": "The complementary contributions of academia and industry to AI research"}, {"paperId": "97cb095d048d10a779004422cf84b31afef37c90", "title": "Examining the use of ChatGPT in public universities in Hong Kong: a case study of restricted access areas"}, {"paperId": "63a4bca356711e1fcc56a1e6ef3fcff7752cc54b", "title": "Generative conversational AI agent for managerial practices: The role of IQ dimensions, novelty seeking and ethical concerns"}, {"paperId": "0b1fb4b3305f9df1fc7878f610ae58f720a9b64f", "title": "Service staff makes me nervous: Exploring the impact of insecure attachment on AI service preference"}, {"paperId": "54750cd6b8bc80b09f4bafb50ce2cb2d98e69348", "title": "Digital technology and manufacturing industrial change: Evidence from the Chinese manufacturing industry"}, {"paperId": "c24f1e37d1f0eef83081c327f8f4c17354e1245b", "title": "Green knowledge management: A key driver of green technology innovation and sustainable performance in the construction organizations"}, {"paperId": "214d511b6d6b6b8eea8a10f944da54701099b587", "title": "Enhancing third-party logistics providers partnerships: An approach through the D.L.A.R.C.S supply chain paradigm"}, {"paperId": "9004bf561099c3b1a52c8313943dab02ca73f73f", "title": "IUPHAR THEMED ISSUE: New Strategies for Medications to Treat Substance Use Disorders."}, {"paperId": "3b42f4ccbf6c8974b4d0b8c715a227400f856017", "title": "A data-driven decision-making readiness assessment model: The case of a Swedish food manufacturer"}, {"paperId": "b53beb51ca39b778378bad2b20ac9c95f7a05564", "title": "Artificial intelligence innovation of tourism businesses: From satisfied tourists to continued service usage intention"}, {"paperId": "d3fcd326c5bf4da93b3d839fe3d109cd1c397957", "title": "Mapping the conceptual structure of innovation in artificial intelligence research: A bibliometric analysis and systematic literature review"}, {"paperId": "069db7aa142a3f82d4e8426c8bfb9def2a017f33", "title": "How does artificial intelligence affect the environmental performance of organizations? The role of green innovation and green culture"}, {"paperId": "e599b65b78670a55a971be86c4a31fa8df3c2acb", "title": "AI Literacy and Zambian Librarians: A Study of Perceptions and Applications"}, {"paperId": "0c9658f5a7ec41bd61ee11038f556ce8a8e2657f", "title": "Synergistic advantages of deep learning and reinforcement learning in economic forecasting"}, {"paperId": "0a927ef8ae0190632dcd2d1b9eb80c67cc73cf4a", "title": "La inteligencia artificial en los procesos de administración pública"}, {"paperId": "5ed2f72619058ec9f34a51878c0d4a8c54d6e9e8", "title": "Smart cities for people with disabilities: a systematic literature review and future research directions"}, {"paperId": "5ecd45e7b7d207b2c839965b8204c820923f3665", "title": "Recent advancements in laboratory automation technology and their impact on scientific research and laboratory procedures"}, {"paperId": "c6a0dadbf89a3ea5eda104a5f74826b846b8d6d2", "title": "Digital Marketing at the Mercy of Artificial Intelligence"}, {"paperId": "3d02abee11a1b27d32d101ada5a8ff3c229469b4", "title": "The Next ‘Deep’ Thing in X to Z Marketing: An Artificial Intelligence-Driven Approach"}, {"paperId": "bda7ef8b2a0c41fd2798edfb1dd96d21b8cba837", "title": "Impact of Artificial Intelligence on Online Buying Behaviour in E-Commerce"}, {"paperId": "66c7e646ac3d911ed034632c18c19d708f4f2710", "title": "Implementation Curriculum Independent Study Use Learning Management System (LMS)"}, {"paperId": "31fa119759ba3ddf171b826b01096cbbcff17ffd", "title": "Understanding the Causes and Solutions of AI Induced Misinformation Impacting the Decision Making Behavior of Students"}, {"paperId": "00665207f4073c39af5625e923c0150a0c0b2a71", "title": "Revitalizing The Higher Education Curriculum Through An Artificial Intelligence Approach: An Overview"}, {"paperId": "16b7e6eb5d196aa37201884a7fd884d96f050a6e", "title": "Educational Management Innovation by Utilizing Artificial Intelligence in Higher Education"}, {"paperId": "a7913c51e08efbc1c4c2985cdc8238b326be46f8", "title": "Analyzing ChatGPT adoption drivers with the TOEK framework"}, {"paperId": "3edea0c2561f5cd8939d1b40cdf1115703e96388", "title": "The “new currency of the future”: a review of literature on the skills needs of the workforce in times of accelerated digitalisation"}, {"paperId": "f27644593b1e7a8957b01aade399cac3670f75dd", "title": "Innovative AI Regional Economic Development Driven by Information System Innovation: Opportunities and Challenges - A Boosting Factor from Digitalization, Business Intelligence Analytics"}, {"paperId": "96d185d3b74b0af3fb56adad9ad6f0a32e2b8b2b", "title": "Does ChatGPT Play a Double-Edged Sword Role in the Field of Higher Education? An In-Depth Exploration of the Factors Affecting Student Performance"}, {"paperId": "af2a5cfe903f8013e34bbe760c2270abd26dda14", "title": "Student Sentiment Analysis: Implementation of Artificial Intelligence in Improving Teaching Quality"}, {"paperId": "473fd0c92cacea1eeafa1220361d71f25bfcd29f", "title": "Artificial Intelligence in Digital Marketing: Insights from a Comprehensive Review"}, {"paperId": "ef1435d23f167938d8d9819ff0cf9f05109a8c15", "title": "Acceptance of AI in Service Scenarios: The Impact of Chatbot Anthropomorphism on Customers’ Willingness to Use Continuously"}, {"paperId": "a2111bd0a75f5af7e08573c9a876129b74967d73", "title": "The role of artificial intelligence for management decision: a structured literature review"}, {"paperId": "106f74446cc253be3c012b4b34f42381c4615bc6", "title": "Bias in Using AI for Recruiting: Legal Considerations"}, {"paperId": "e7d0ece8db5c55a5e169ff774d7e1112fff7224c", "title": "AutoML as Facilitator of AI Adoption in SMEs: An Analysis of AutoML Use Cases"}, {"paperId": "0b244a6129b2dc5852b179e47225a1c8f50c841f", "title": "The role of Project managers in navigating digitalization in a supply chain for resilience"}, {"paperId": "b25b018ce06326ecfb9879f98d3319473afd9e4d", "title": "A Critique of Human-Autonomous Team Dynamics: Contrasting Qualitative and Quantitative Perspectives"}, {"paperId": "4208b78f5be7607e5f284e1eac751ad611681ee1", "title": "Intelligent selection of healthcare supply chain mode – an applied research based on artificial intelligence"}, {"paperId": "0c6350d132a1d126fbe8e243c97e32fd13df64cf", "title": "Mapping research in marketing: trends, influential papers and agenda for future research"}, {"paperId": "4973b3f6289b55548a9d65b30ae490fc4eae4811", "title": "Economics of ChatGPT: A Labor Market View on the Occupational Impact of Artificial Intelligence"}, {"paperId": "76c0930edff3d28590c89523c8d96501cf12909f", "title": "Stand-alone or run together: artificial intelligence as an enabler for other technologies"}, {"paperId": "9b3ad21e503f3983ff98bc020618120cd977322e", "title": "Revisiting tools in numeracy learning: the role of authentic digital tools"}, {"paperId": "0aa377a71b89ca1a13c4bb225583085c97102bbe", "title": "AI and business management: Tracking future research agenda through bibliometric network analysis"}, {"paperId": "c41571d8d49ebee755e6f3f5f509eb83bb1d6cbc", "title": "Exploring the factors, affordances and constraints outlining the implementation of Artificial Intelligence in public sector organizations"}, {"paperId": "46d800ed0795620fea6c652a5fd798979c32daa5", "title": "Machine learning advice in managerial decision-making: The overlooked role of decision makers' advice utilization"}, {"paperId": "f3130d7a4d7d4cdefa10deb96813e7212dbd34bc", "title": "Artificial intelligence-driven rechargeable batteries in multiple fields of development and application towards energy storage"}, {"paperId": "a2bccd4ca2d3a84a1f1151b4a6e4fa6e23b7e42a", "title": "Exploring pre-service teachers' intention to use virtual reality: A mixed method approach"}, {"paperId": "46e17a6b833e9be2913434fc77c5c080012bb2d2", "title": "ChatGPT and computational-based research: benefits, drawbacks, and machine learning applications"}, {"paperId": "8a22bd6c2c05c5607ef350beb977acd3b9c02ed6", "title": "The Road to corporate sustainability: The importance of artificial intelligence"}, {"paperId": "f2f04a962105691e13b531fa3613554a2c2b7a2e", "title": "Enhancing innovativeness and performance of the manufacturing supply chain through datafication: the role of resilience"}, {"paperId": "334107a62a55202c931f63e20010752cd974dd1c", "title": "The role of artificial intelligence-enabled dynamic capability on environmental performance: The mediation effect of a data-driven culture in France and the USA"}, {"paperId": "12dd5cf81a724ccecda51a0df82c8afdf4e2de7d", "title": "Tooth morphology, internal fit, occlusion, and proximal contacts of dental crowns designed by deep learning-based dental software: A comparative study."}, {"paperId": "dc94560d60e9851ae297d521b553f56e83f7e4f3", "title": "A Dynamic Resilience Evaluation Method for Cross-Domain Swarms in Confrontation"}, {"paperId": "a20afbcf5fe7a60d69442cab3fc1b46ffe97f9a3", "title": "Artificial Intelligence in Human Resource Management: Transforming Business Practices"}, {"paperId": "47f8c70d111e4ebbb9c4629e5b0f2604309249ba", "title": "Ai in e-learning: the affordance perspective"}, {"paperId": "ca54807f782eff3f525e63a7af28092548231cc5", "title": "Transitioning Towards a Paperless Library: Advantages and Implications"}, {"paperId": "cafb2a200fd7629e13ea97cefc658878a77271de", "title": "The Effectiveness of Using Plotagon Story Media to Improve Listening Skills for Non-Arabic Speakers"}, {"paperId": "a68f2f50b7df52c6f39cd63117a8180cd6ebefed", "title": "Education Policy in Turkey During the Reign of Recep Tayyib Erdogan"}, {"paperId": "bfee70d1837aa3f2f760e6f7fe6056d1fc11d29b", "title": "The AI Transformation Risk Model: Solutions where Benefits Outweigh Risks"}, {"paperId": "35a6d7a63492f7a63ed9df7fb31382e4888a3402", "title": "Educational Technology Based on Artificial Intelligence in Supporting Distance Learning in Arabic Language Learning in Higher Education"}, {"paperId": "4a5595bcbcd415c755aedcfca29bec1838494c39", "title": "Supervising or assisting? The influence of virtual anchor driven by AI–human collaboration on customer engagement in live streaming e-commerce"}, {"paperId": "8cc15b5955af2eada1c8ca75931a09ddfaf05aa8", "title": "Development of the Edpuzzle Platform as an Audio Visual Learning Media for Arabic Language Learning at Madrasah Aliyah"}, {"paperId": "518167a7d7f1c36d3cc752e653f1b8da9576325e", "title": "Unlocking the Potential of Machine Learning in Indian Small and Medium Enterprises (SMES) and an Examination of Outcomes in the Knowledge Management Process"}, {"paperId": "a8e681ed516d79b40b95888795c1d87825cb4f67", "title": "AI Dialog: Utilization, Challenges, and Ethics in the Age of Artificial Intelligence"}, {"paperId": "50f8b14f6a30bc4ccfc97802783ad594f7a6faa0", "title": "SHAMS 2.0: Sustainable Humanoid Assisting Modular System for Medical Field"}, {"paperId": "91c6470b1a5832bd765d1274fb06b8288281d133", "title": "Deepfake detection using deep learning methods: A systematic and comprehensive review"}, {"paperId": "7169492859e1e9fccbda3270a26d8c6aff4adf6a", "title": "Social Media as a Political Platform in Africa: A Bibliometric Analysis"}, {"paperId": "cb3f3e202b43cd76998227685e027e594d147d38", "title": "Artificial Intelligence in Concrete Mix Design: Advances, Applications and Challenges"}, {"paperId": "6c03997ede4abd549739a3ce1ae4ceeb04811ea6", "title": "Why Do Older Adults Feel Negatively about Artificial Intelligence Products? An Empirical Study Based on the Perspectives of Mismatches"}, {"paperId": "df05a53ca109cf207e0ad50e8533abbf159ea9d4", "title": "Improving Social Bot Detection Through Aid and Training."}, {"paperId": "b7afaf793922a9bcba3a77eb1f1718121c1b2345", "title": "Critical analysis of the impact of artificial intelligence integration with cutting-edge technologies for production systems"}, {"paperId": "ff43b16c5df77b1a82bd47d004592090de420e3a", "title": "The influence of beliefs and anxiety in using artificial intelligence towards readiness to change with high performance work systems as a moderating variable"}, {"paperId": "23b2476e005da5261674ecd013eeb2bb88829c6d", "title": "Advancing Educational Content Classification via Reinforcement Learning-Integrated Bloom’s Taxonomy"}, {"paperId": "18432ab82b4b9b221bf8024226b9b5c0fcaaf2c4", "title": "Machine learning In the financial industry: A bibliometric approach to evidencing applications"}, {"paperId": "68acd63bfa911c55624ef3f94a6e6c40764f4675", "title": "Unveiling Ethical Implications: AI Robot Accountability in Islamic Context"}, {"paperId": "aba9532651487272d315f362b880dc50ad45e24a", "title": "How can we use neural network with entity embedding for product valuations? A case study for the car industry"}, {"paperId": "f0f461155b583b8fa22893c1e213c5bb43e6a7fe", "title": "A sociotechnical perspective for responsible AI maturity models: Findings from a mixed-method literature review"}, {"paperId": "e92e2e826aa273616423b9038ca73bbbe4a15bf9", "title": "An enriched decision-making satisfaction model for student information management systems"}, {"paperId": "40c66825eb118790af44d21de7804eba4587690b", "title": "Digital capability requirements and improvement strategies: Organizational socialization of AI teammates"}, {"paperId": "5bef4a10f7c9e46927e8a8e682149ede18cac7d5", "title": "How does AI drive branding? Towards an integrated theoretical framework for AI-driven branding"}, {"paperId": "59bc18d45e0c873e309c9bb172e22c07baa8a90d", "title": "Artificial intelligence (AI) futures: India-UK collaborations emerging from the 4th Royal Society Yusuf Hamied workshop"}, {"paperId": "d35ba05ca3ea57ef884a3b4f4add8990059d9283", "title": "Investigating the impact of artificial intelligence on human resource functions in the health sector of China: A mediated moderation model"}, {"paperId": "46942e52c3c5ebcf784b139190abf5758c5fce22", "title": "Artificial intelligence - partner relationships management for climate management in B2B firms to achieve sustainable competitiveness"}, {"paperId": "c8adf45d8009e05cfa46885cfa6d2c32d178ba59", "title": "The digital imperative: Institutional pressures to digitalise"}, {"paperId": "e1d7b6909b9abdce155e710bdc1e57e3e8e2b01c", "title": "The dark side of artificial intelligence for industrial marketing management: Threats and risks of AI adoption"}, {"paperId": "902f799e6425e7dc52b44f2109cf2a7f91fe4938", "title": "Artificial Intelligence in the Paradigm Shift of Pharmaceutical Sciences: A Review"}, {"paperId": "210f6e7130fb7243550766346fdc8f0295bc434c", "title": "The Contribution of Artificial Intelligence to Stimulating the Innovation of Educational Services and University Programs in Public Administration"}, {"paperId": "7d96c9cc2297ea2cd3762641dc9364a503e915c8", "title": "The Re-examination of the Dangers and Implications of Artificial Intelligence for the Future of Scholarship and Learning"}, {"paperId": "51791a95c6ba077072018ce8c0d294102953cc6a", "title": "Transforming Organizational Development with AI: Navigating Change and Innovation for Success"}, {"paperId": "e354cfa3770edb9d5a6732cfa8054894ed0d3682", "title": "ChatGPT in Academic Writing: A Threat to Human Creativity and Academic Integrity? An Exploratory Study"}, {"paperId": "64960d5c84796096ee61373107b03c4be3f23695", "title": "Exploring the impact of language models, such as ChatGPT, on student learning and assessment"}, {"paperId": "c493c91fe7a426ca5b95fc0f3d7ce9c5b5f8e1a9", "title": "Transfer of Reinforcement Learning-Based Controllers from Model- to Hardware-in-the-Loop"}, {"paperId": "b4ea5e163d7c2b6a5a6ea48e9f4f4d156e17c36f", "title": "Impact of Distributed Ledger Technology (DLT) and Fintech Investment on Central Bank Policy and Monetary Policy Effectiveness"}, {"paperId": "2fd5d9cbb9ad8f4ab18a40fb698cc8a26d9dd40d", "title": "Strategic Integration of Artificial Intelligence for Sustainable Businesses: Implications for Data Management and Human User Engagement in the Digital Era"}, {"paperId": "1ebeb7e79c9525f8b078e304dd386c8a5ac43871", "title": "Exploring students' perceptions toward the use of augmented reality for digital library services"}, {"paperId": "8bf10fc5cd6d9e0004082538b0bf099006e5d940", "title": "FACTORS INFLUENCING THE QUALITY OF ACCOUNTING INFORMATION SYSTEMS IN MALAYSIA"}, {"paperId": "017ff10de408246f5db65d63626c912b09716eaa", "title": "Who guards the guards with AI-driven robots? The ethicalness and cognitive neutralization of police violence following AI-robot advice"}, {"paperId": "9c611f584a73a7d50b70f68438b85f96b9c0aa3c", "title": "Artificial intelligence-based supply chain resilience for improving firm performance in emerging markets"}, {"paperId": "0e5b7f1a499dfa7f74960362bdf6a1ff720c2170", "title": "Quantitative Evaluation of the Impact of Artificial Intelligence on the Automation of Processes"}, {"paperId": "41556f93e6d55c3eff9e5f49f92e8e13981bf369", "title": "Human-Centric AI to Mitigate AI Biases: The Advent of Augmented Intelligence"}, {"paperId": "000c29a4ee53e6de45a4e97f5a88ed913bc51234", "title": "Adoption of industry 4.0 in different sectors: a structural review using natural language processing"}, {"paperId": "acd719e2f293512dfb88c87874305e71f1f5a403", "title": "A SYSTEMATIC REVIEW ON THE USE OF ARTIFICIAL INTELLIGENCE IN E-COMMERCE"}, {"paperId": "6a703c99b5403556c124f6a0d878110cf14b4439", "title": "The Potential of Generative Artificial Intelligence Across Disciplines: Perspectives and Future Directions"}, {"paperId": "584d20024935b21db8f13d90b4d8c335f1959b43", "title": "The perspectives of decision support in hotel industry: systematic review and bibliometric analysis"}, {"paperId": "e263d047db1727cadaa74fc0ce336c5ae1c46eda", "title": "What is There to Fear? Understanding Multi-Dimensional Fear of AI from a Technological Affordance Perspective"}, {"paperId": "d9fe3101f06d689614734f0318ddc3c407f66663", "title": "Artificial intelligence enabled participatory planning: a review"}, {"paperId": "d36550db36d387f0639d8fe097945d01ddad65d4", "title": "The role played by responsible artificial intelligence (RAI) in improving supply chain performance in the MSME sector: an empirical inquiry"}, {"paperId": "3817e106c10e076b08d03e38cfeed71f092910f8", "title": "Reinforcing data bias in crisis information management: The case of the Yemen humanitarian response"}, {"paperId": "6fd013127222d070d0d3b3b31686b811360559c6", "title": "Advancing algorithmic bias management capabilities in AI-driven marketing analytics research"}, {"paperId": "4a4cf62bec2ebfa8b2d8dbeffca084b2f7d64125", "title": "Evaluating the User Experience of Augmented Reality in the Mobile Commerce Environment"}, {"paperId": "2f84626744632a9af947252837877d9083f865f1", "title": "Generative artificial intelligence in marketing: Applications, opportunities, challenges, and research agenda"}, {"paperId": "9c457f5f3a0d5f4ed5b87e989a090cad26dd42e1", "title": "Integration of AI in CRM: Challenges and guidelines"}, {"paperId": "02b21bdd4f907b225c0ab602ee9dbffa06b3c77c", "title": "Evaluation of the efficiency, trueness, and clinical application of novel artificial intelligence design for dental crown prostheses."}, {"paperId": "f838fbeca0a0e5c072ce141c8fda98430eba4e6e", "title": "Trends and challenges of e-government chatbots: Advances in exploring open government data and citizen participation content"}, {"paperId": "5f4516e522917ff794753b1eadbd67e496baeb71", "title": "Artificial Intelligence in Advertising: Advancements, Challenges, and Ethical Considerations in Targeting, Personalization, Content Creation, and Ad Optimization"}, {"paperId": "9590252a3d37de4d56f367f5573cb5a5bd0b17fd", "title": "Improving Learning Achievement by Applying the Pakem Learning Model"}, {"paperId": "a087cbf4c761f2c0e536b4f9ac3518bda05d3195", "title": "ChatGPT-4 for Hospitality: Implications"}, {"paperId": "c019acb706f36541cbbf511b822487a2b56054d0", "title": "Sufficiency and necessity of big data capabilities for decision performance in the public sector"}, {"paperId": "239baf9cd0939a2d3608b6a05a87286dd7eaa9cb", "title": "Artificial intelligence and new business models in agriculture: the “ZERO” case study"}, {"paperId": "2bdfd1fdf0b0c5dd9cf8414dc900cefac3d7d598", "title": "Artificial intelligence in logistics and supply chain management: A primer and roadmap for research"}, {"paperId": "9bb5c5fd4482f31a5886e682df7f6c3235183df7", "title": "A conceptual framework of barriers to data science implementation: a practitioners' guideline"}, {"paperId": "928c6e11806f38a71acea26e754327621d925662", "title": "The Safavid EmpireThe Degradation of Political Islam"}, {"paperId": "891daa70687da93ca6187eb746f78b06d1482f0b", "title": "Privacy in hospitality: managing biometric and biographic data with immersive technology"}, {"paperId": "a3ad0ff48a9eef5f3c723da9a5bc193460bfa70f", "title": "Managing Healthcare Product Demand Effectively in The Post-Covid-19 Environment: Navigating Demand Variability and Forecasting Complexities"}, {"paperId": "ee4747dee1bbe3924b99a3852281026cda5837a5", "title": "Banking in the metaverse: a new frontier for financial institutions"}, {"paperId": "93d251ea9292f4c1a4cb89ad5941f567d627d677", "title": "Generic Simulation Framework for Evaluation Process: Applied to AI-powered Visual Perception System in Autonomous Driving"}, {"paperId": "b7e75ba21fafaffe849a053f8b68c725c8f3110c", "title": "Strategies for Small Enterprises to Retain the Opportunities Created by COVID-19 for e-Marketing"}, {"paperId": "6b54d84eeb9bf90306ac16bfd7d4a788bd7713e0", "title": "OIE4PA: open information extraction for the public administration"}, {"paperId": "b7845de8750bc1e92e37266d11ba27e93995eca5", "title": "Redefining Qualitative Analysis in the AI Era: Utilizing ChatGPT for Efficient Thematic Analysis"}, {"paperId": "3232d3822ce9fee9ab3a7dfd56f5920955b3aaa1", "title": "HDSNE a new unsupervised multiple image database fusion learning algorithm with flexible and crispy production of one database: a proof case study of lung infection diagnose In chest X-ray images"}, {"paperId": "890d36274c91e60940563172e4a58a07c85a354b", "title": "Innovation in ophthalmology and dentistry services: benefits and challenges of using AI"}, {"paperId": "2884cd8ba95d218f1a0ca897b9712de762be37f8", "title": "AI-enabled organoids: Construction, analysis, and application"}, {"paperId": "436cf000ab13a574d8fb8619583253d674ae80ff", "title": "Augmenting hotel performance in Malaysia through big data analytics capability and artificial intelligence capability"}, {"paperId": "5a5e03c3c8bf5052a99f4631e874b1e608e59319", "title": "Artificial intelligence in developing countries: The impact of generative artificial intelligence (AI) technologies for development"}, {"paperId": "b744de97dcad21ad8302394ad92788134d7b2f64", "title": "Chromatics in Urban Landscapes: Integrating Interactive Genetic Algorithms for Sustainable Color Design in Marine Cities"}, {"paperId": "a9895d5ff48c3d3299289b0c0358fb13e4ebedd0", "title": "The Impact of Technology Change in Work, Employment and HRM"}, {"paperId": "b2e582b5b6cc3ffd3c969446c991eac15200bfaa", "title": "Proposing a Framework for Investigating Acceptance of AI-Based Tools by Lawyers"}, {"paperId": "61b1d9ffaffad5343f6ededbd023edc92f2674b5", "title": "Implementation of Artificial Intelligence for Financial Process Innovation of Commercial Banks"}, {"paperId": "5da44acb7ee0f3c33029dbb0ca4109424ef6a1e8", "title": "Examining the Transformative Role of Artificial Intelligence in Language Skill Enhancement: A Case Study of BS English Students in Okara, Pakistan"}, {"paperId": "52aac629b6eafc3260d30aa61da66f8ee82be4ab", "title": "Impact of AI Affordance on AI Adoption: The Mediating Role of Self-Monitoring and Uniqueness"}, {"paperId": "3348e2fa59e51be0db3ad644059b987af22adfe3", "title": "Predicting breakthrough innovation engagement via hybrid intelligence: a moderated mediation model of self-extinction and social intelligence"}, {"paperId": "ab512d8465e30da3ab03fcd5d1fc70acf2be2c50", "title": "YOLO-OR: a lightweight cross-stage object detection model for dish recycling robot"}, {"paperId": "f27d20e25f5d91740cc3c0d4d524aaea2aa590fb", "title": "Knowledge evolutionary process of Artificial intelligence in E-commerce: Main path analysis and science mapping analysis"}, {"paperId": "e0f246cc53b7b363091d40138e220a29a2c0771b", "title": "Using Artificial Intelligence To Label Free-Text Operative And Ultrasound Reports For Grading Pediatric Appendicitis"}, {"paperId": "dc590179c1cc99764fdcf2d0ba7f0381a3b1ca59", "title": "How is government embedded in innovation process for breakthroughs? A meta-synthesis of qualitative case studies"}, {"paperId": "f1db4af25c3082f0bc6c5bec71cad790814b770b", "title": "Explainable artificial intelligence in finance: A bibliometric review"}, {"paperId": "6d9e20d4c5025c58c464237d2d6cde22495a8b45", "title": "A framework to overcome challenges to the adoption of artificial intelligence in Indian Government Organizations"}, {"paperId": "bd1f6c614bd251d993fbe7ad9ff8c9ac8ee42ad2", "title": "Antecedents and consequences of travelers' trust towards personalized travel recommendations offered by ChatGPT"}, {"paperId": "17a6ea273931f46e655c9d137e042ffd661ed91d", "title": "Double-sided messages improve the acceptance of chatbots"}, {"paperId": "4b711b400851e0684e8823b3ab94065620f5e41b", "title": "Drones in Venice: Exploring business model applications for disruptive mobility and stakeholders’ value proposition"}, {"paperId": "3c4436e6953c061a0ee33b97cbe31eee8f93f017", "title": "Knowledge mapping of an artificial intelligence application scenario: A bibliometrics analysis of the basic research of data-driven autonomous vehicles"}, {"paperId": "8cf5910ccb5d40b1af68798e414a8f16c62ec954", "title": "Artificial Intelligence and the Future of Work in the Indonesian Public Sector"}, {"paperId": "b24768acd78701a4adbf785c3ede8d7bde16db21", "title": "AI Adoption in the Chinese Food and Beverage Industry: An Exploratory Study"}, {"paperId": "33033c02ec47b544ec2aeed34bdeda1eaebd87d6", "title": "Policy initiatives for Artificial Intelligence-enabled government: An analysis of national strategies in Europe"}, {"paperId": "3bfb34ebc52ad5b86d1279826f85d0afd4094e35", "title": "Machine learning and human‐machine trust in healthcare: A systematic survey"}, {"paperId": "9efd1da110160ed1153d896445f45f505f08f881", "title": "Junior Lecturers' Perspectives of Emerging Technologies as a Viable Teaching and Learning Tool in Higher Learning Institutes"}, {"paperId": "b5830a692adca62e3281e0ae4ab2c22146134e69", "title": "Implementation of AI Chatbot Application for Social Anxiety Problem"}, {"paperId": "8dbea697e3bace3b87d0681e2aae3f7b9b8fe9e0", "title": "Cheap, Quick, and Rigorous: Artificial Intelligence and the Systematic Literature Review"}, {"paperId": "1f4891c44016654747796d34493df05f4cfcfcbd", "title": "Logistics 4.0 for supply chain performance: perspectives from a retailing case study"}, {"paperId": "994b24bbb670f5083c3a4fd1a0df02f8ff46ffe8", "title": "Estimation of Water Quality Parameters through a Combination of Deep Learning and Remote Sensing Techniques in a Lake in Southern Chile"}, {"paperId": "518005a55d295f9d2802eb50a1cb0b7699acaa26", "title": "Artificial intelligence consumer behavior: A hybrid review and research agenda"}, {"paperId": "f8e4f4e2feb4b3450dc3b266bac5cdb7a6663498", "title": "The Significance of Artificial Intelligence in Contemporary Cinema"}, {"paperId": "c7e842588f0f19c2bf27c45ae82a3dee1ea0f4e9", "title": "The Impact of Using Artificial Intelligence on Public Services in Indonesia"}, {"paperId": "93e6908fbc7857864655f716d73fb65bd3eb5615", "title": "Unveiling the Collaborative Patterns of Artificial Intelligence Applications in Human Resource Management: A Social Network Analysis Approach"}, {"paperId": "8cc03ea35464e27bc66eaedd61bf971fbfa3af9d", "title": "Artificial Intelligence and Pay Information Disclosure: Changing How Pay is Communicated"}, {"paperId": "3f7186bbabe3a7fc48d8be853e1c837565cff18e", "title": "Unleashing the value of artificial intelligence in the agri-food sector: where are we?"}, {"paperId": "6637ca2e6cc9152f834add59c29abd0449dc74fe", "title": "The Role of Asynchronous in Improving Student Achievement"}, {"paperId": "80469168f594ded43fd739c2f4eb4033d0e252ba", "title": "A review of intelligent interactive learning methods"}, {"paperId": "a663f3f1ddb4b3f6d54ea8f9d67797750fb9bcf3", "title": "Corpus-based Critical Discourse Analysis on AI Policy: A Comparison Between North America and Developing Countries in East Asia"}, {"paperId": "19ef98a77442cc3f6cc741878915d2b486043f06", "title": "Development of Educandy Platform as an Educational Game to Improve Arabic Language Learning Achievement"}, {"paperId": "2439b0a646b4b0a0c71f1616256ff4983c3ea188", "title": "Continued Intention of mHealth Care Applications among the Elderly: An Enabler and Inhibitor Perspective"}, {"paperId": "4b8cad1d4b0cc1f4a7ffb28c9aa43bbcbf828db2", "title": "Desafios para a computação na implementação e implantação de solução baseada em IA em governo: uma análise da literatura"}, {"paperId": "3fafc49a58861ffadccee8caa24bf647548ef04f", "title": "Exploring users' adoption intentions of intelligent virtual assistants in financial services: An anthropomorphic perspectives and socio-psychological perspectives"}, {"paperId": "06e611c63904f087465f76a7203567cc805536a2", "title": "Supply chain research overview from the early eighties to Covid era - Big data approach based on Latent Dirichlet Allocation"}, {"paperId": "32c2ed4a0fda1e2147cbb4a924e125439cdfa62f", "title": "Sustainable software engineering: Reflections on advances in research and practice"}, {"paperId": "c309aae7785cd8fdf5df4eec0135b8de8b07ac7c", "title": "Adversarial Attack and Defense in Breast Cancer Deep Learning Systems"}, {"paperId": "9a43df94f99d27487a49f6f34d4ed5b2f4124b26", "title": "The dynamics of AI capability and its influence on public value creation of AI within public administration"}, {"paperId": "b2026a52cb073cc14cf7027c8b0fc70c03da0738", "title": "A neural network based on the inclusion-exclusion integral and its application to data analysis"}, {"paperId": "d53d081a4d5b6ce05ceaae1ba3484df5d2b458bc", "title": "Interplays Between Artificial Intelligence and Sustainability in Business / Management. A Bibliometric Analysis"}, {"paperId": "69d1c43a5864605c3f35f6d01ded25f19b5b6bf0", "title": "The Future of AI Is in the States: The Case of Autonomous Vehicle Policies"}, {"paperId": "9a506c7e860f81f7917d2631a1490fdb39d56755", "title": "The shortcomings of artificial intelligence: A comprehensive study"}, {"paperId": "1f1899907a1121e9c224a0cd01676e8ac7c03ff2", "title": "A Review of ARIMA vs. Machine Learning Approaches for Time Series Forecasting in Data Driven Networks"}, {"paperId": "eb83daf13d15dc6bf62d70909c4c1bb50e44c1ea", "title": "Banking Industry's Transformation with Aid of AI Technology"}, {"paperId": "0f6156abf275eae472ca3ffd0d7cc7f25bf4844f", "title": "Artificial intelligence in interactive marketing: a conceptual framework and research agenda"}, {"paperId": "ef66c0afbb72b7d51618e145bb8f32cc1ac9049f", "title": "A Technology Quality Improvement Approach Based on the Scopus Engineering and Computer Science Information Registered in the USA Since 2018 to 2022"}, {"paperId": "ff71bcc699b1fd7707d7fd4a0993be7586f8b6d0", "title": "Applications and Societal Implications of Artificial Intelligence in Manufacturing: A Systematic Review"}, {"paperId": "8f439e6b4d9af04c8fe52dd9e046301f8d20c90e", "title": "Implementation of Hybrid Learning Models in Islamic Universities in Asian Countries"}, {"paperId": "6efa2bef5446450e755aa78ca10c7386e04ce674", "title": "Proposing a Model for Sustainable Development of Creative Industries Based on Digital Transformation"}, {"paperId": "ba12da758aa61eb15d4e0c4a46ee5902ef66d894", "title": "Mechanisms and Constraints Underpinning Ethically Aligned Artificial Intelligence Systems: An Exploration of Key Performance Areas"}, {"paperId": "e939ae841f45fa91d964760a7550865938c8a796", "title": "Consumer engagement with AI‐powered voice assistants: A behavioral reasoning perspective"}, {"paperId": "80c08b615880fa0e1a3c7acd03e0602c4f94f864", "title": "Gaining user confidence in banking industry's quest for digital transformation: a product-service system management perspective"}, {"paperId": "937aa75b6aa71d31f1f85e63401a989907f17b8a", "title": "Artificial intelligence governance: Ethical considerations and implications for social responsibility"}, {"paperId": "de239e5884cd7e01706e61342cf0824ee322ccfb", "title": "An Enterprise View for Artificial Intelligence Capability and Governance: A System Dynamics Approach"}, {"paperId": "0354cf9b1899c811cbc9d8a63b0c9b09c528b0e6", "title": "AI-enabled strategies for climate change adaptation: protecting communities, infrastructure, and businesses from the impacts of climate change"}, {"paperId": "679bc2680ffe8298a3117c773a5ee7719a311216", "title": "Effective use of artificial intelligence in healthcare supply chain resilience using fuzzy decision-making model"}, {"paperId": "c97cfb65f13012426415862aa9c6ff1d96c281b5", "title": "The Forecasting of a Leading Country’s Government Expenditure Using a Recurrent Neural Network with a Gated Recurrent Unit"}, {"paperId": "ceba45c83bb02c4bf58a3083c7fd5d43b5ac180e", "title": "The challenges of AI implementation in the public sector. An in-depth case studies analysis"}, {"paperId": "58eeb3990ca1636c6e9bed5a3cdf2c6fc8c362e4", "title": "Human, Do You Think This Painting is the Work of a Real Artist?"}, {"paperId": "a88bf309b140ae8c0558cbac8aea9ebf37df6908", "title": "Brain Tumor Identification Based on AlexNet and VGG"}, {"paperId": "3992aa7859dc711bbd19da162be98e29d0d1347f", "title": "Artificial intelligence adoption among human resource professionals: Does market turbulence play a role?"}, {"paperId": "ec1c43ca684732d06716a36271a4cb3066797153", "title": "Generative artificial intelligence"}, {"paperId": "734d896474019cccf433212cf5cb83dffb56b482", "title": "Social human collective decision-making and its applications with brain network models"}, {"paperId": "5b136baf39217660109a3d3f9dee608db32cedef", "title": "The dark side of FinTech in financial services: a qualitative enquiry into FinTech developers’ perspective"}, {"paperId": "269e69dcea1d6c314989f93de515422d80ed44af", "title": "Integration of Financial Innovations and FinTech"}, {"paperId": "4858fa952d9e313ba58febafcf9c82b1bcf2ddb3", "title": "Revolutionizing education with AI: Exploring the transformative potential of ChatGPT"}, {"paperId": "2dccefd853f901293197ee905cdcb7c34e93eb95", "title": "Evolution of artificial intelligence research in Technological Forecasting and Social Change: Research topics, trends, and future directions"}, {"paperId": "2ec880ef49750704d625d32af8357fe05d1f86d6", "title": "Mapping the deepfake landscape for innovation: A multidisciplinary systematic review and future research agenda"}, {"paperId": "d4f73cfa4531446487a0039a7aa5a9fea8c68704", "title": "AI – powered Business Services in the Hyperautomation Era"}, {"paperId": "37896e083281a43b74e23d3c64d83a82a5b2422e", "title": "Customer Relationship Management, Operational Digitization, Production Optimization and Value Creation through Artificial Intelligence in e-Marketing"}, {"paperId": "997b4e1889608f2f3661155d262cba390c820b26", "title": "Artificial intelligence in fine arts: A systematic review of empirical research"}, {"paperId": "512c4852817d9ca22ec4be3a8e0a2311e327387e", "title": "Guest editorial digital platforms and transformational entrepreneurship"}, {"paperId": "697fd032c807bd3ecd230673e9049613f59c330f", "title": "Artificial intelligence and skills in the workplace: An integrative research agenda"}, {"paperId": "b8837c66815049bbeb58da09e4018cc805e8f009", "title": "Artificial intelligence’s impact on hospitality and tourism marketing: exploring key themes and addressing challenges"}, {"paperId": "3e72b204d5d8dab92eb2e175ea8c7c8d97076532", "title": "Analysis of Siyasah Dusturiyah on the Obligations of Police Services on Comunnity Reports Number 14 of 2011 Concerning the Police Professional Code of Ethics (Case Study of Tanjung Balai Police Station)"}, {"paperId": "0b101f31f380add5ec6b9ec08bb1a32ded017d9b", "title": "Artificial Intelligence in Ecology: A Commentary on a Chatbot's Perspective"}, {"paperId": "3e9fe5237e8551c3b6bf37aace6a1bc5a305df62", "title": "College Students’ Employability, Cognition, and Demands for ChatGPT in the AI Era Among Chinese Nursing Students: Web-Based Survey"}, {"paperId": "b15f9e18a262ebcbbcb81c72a0d3ca77d1f1353a", "title": "Homo digitalis: narrative for a new political economy of digital transformation and transition"}, {"paperId": "b0126ba4dbbbcc01ad835cb382230d56f10c20e6", "title": "Aprendizado profundo para assistência histopatológica: um estudo de classificação de micrometástases em câncer de mama"}, {"paperId": "d40e966500e67e9633783bc5249a2796403fbfdb", "title": "Correlation between artificial intelligence in education and teacher self-efficacy beliefs: a review"}, {"paperId": "213acdd5403a05d1df85cea270a55d213a8bdc69", "title": "ROLE OF ORGANIZATIONAL CREATIVITY BETWEEN ARTIFICIAL INTELLIGENCE CAPABILITY AND ORGANIZATIONAL PERFORMANCE"}, {"paperId": "42a7cddb0277953a9ab72dbabf43d04101308f65", "title": "Analysis of international competitive situation of key core technology in strategic emerging industries: New generation of information technology industry as an example"}, {"paperId": "702be897f05f04edd54cb779e71e5803fabe589c", "title": "The Impact of Intelligent Systems on Management Accounting"}, {"paperId": "b8f20b0b8a37e7b2e19d416fba80d147b75c887f", "title": "Artificial intelligence-based solutions for climate change: a review"}, {"paperId": "f80eb41f0f093b6ad3a2fe8a403b9f9e7df0c048", "title": "Tomeito or Tomahto: Exploring consumer's accent and their engagement with artificially intelligent interactive voice assistants"}, {"paperId": "dffb7bb98e490ae1f21fac01be8c7510e42d172f", "title": "Development of Semantic Differential Scales for Artificial Intelligence Agents"}, {"paperId": "428eb86b50da98cc487c8cf26755df33263af852", "title": "Examining the context‐specific reasons and adoption of artificial intelligence‐based voice assistants: A behavioural reasoning theory approach"}, {"paperId": "88c05ed65a9efe4b8b9ec7d73318ee439aa8eb93", "title": "Rise of Artificial Intelligence in Business and Industry"}, {"paperId": "101d41569db948b28b71729941ecf871663d1618", "title": "Metaverse in marketing and logistics: the state of the art and the path forward"}, {"paperId": "e23b2533df56e8f8e46f0fc1f2b90a9047e0af5f", "title": "Exploring the Darkverse: A Multi-Perspective Analysis of the Negative Societal Impacts of the Metaverse"}, {"paperId": "3d4f6d71ec5533aff8776177015599ffd68d4645", "title": "AI and the creative realm: A short review of current and future applications"}, {"paperId": "59ab535f0f6d516bd7497e20e8b4f8581e66e917", "title": "Outcome-based contracts - Linking technology, ownership and reputations"}, {"paperId": "f9b31be4b378e91413911e4f345bc04b339db008", "title": "Interpretable machine learning-based approach for customer segmentation for new product development from online product reviews"}, {"paperId": "76bedc730b26e49e806f00c619ea84631cd53a92", "title": "Worker and workplace Artificial Intelligence (AI) coexistence: Emerging themes and research agenda"}, {"paperId": "7af86b0f9cb69818b612750aa2b2e0301222f454", "title": "Does AI-infused operations capability enhance or impede the relationship between information technology capability and firm performance?"}, {"paperId": "e004319a0d79a9f116a851701b493b876ab7fa26", "title": "Applying Machine Learning to Healthcare Operations Management: CNN-Based Model for Malaria Diagnosis"}, {"paperId": "268fae35c9e936f0bedf16810a1ea0ea0d0f7015", "title": "AI4Gov: Trusted AI for Transparent Public Governance Fostering Democratic Values"}, {"paperId": "1573cf75b523b68714d9d95f715d835dcc2f7291", "title": "Accountants robots in shared service centers: effects of the culture for innovation, work engagement and performance measurement system"}, {"paperId": "3026ff4b56039752e93623da1ef8d7d3d2c441f8", "title": "Multi-objective optimization of gas diffusion layer structure parameters for proton exchange membrane fuel cell"}, {"paperId": "e613acfd09fdedd89fe7fc2bb3b75b89bd911d3f", "title": "RE-centric Recommendations for the Development of Trustworthy(er) Autonomous Systems"}, {"paperId": "e5a17b3bb700428309dbfc9b223c78e436918566", "title": "The Future of Artificial Intelligence in Special Education Technology"}, {"paperId": "edeecf536097fa432dbcd6096239fd390d76404b", "title": "Aladdin’s Genie or Pandora’s Box for Early Childhood Education? Experts Chat on the Roles, Challenges, and Developments of ChatGPT"}, {"paperId": "130ab91497c19742c0aec91dc4d764139737d45f", "title": "Disentangling Human-AI Hybrids"}, {"paperId": "53b2e578e4fab212f164853b3a1267c2c0f39958", "title": "Exploring the Efficacy of ChatGPT in Analyzing Student Teamwork Feedback with an Existing Taxonomy"}, {"paperId": "8bc6ae74693397b9522b8889bd807991a38170b3", "title": "Artificial Intelligence and Intellectual Property Protection in Indonesia and Japan"}, {"paperId": "ac0723f3f23c9bdaf344fac92918ba1923ce8461", "title": "Hubungan E-Wom, Consumer Ethnocentrism, Brand Equity dan Purchase Intention pada Sepatu Merek Indonesia"}, {"paperId": "ce47a89b3e94e27b876749920941632260381a31", "title": "Examining the research taxonomy of artificial intelligence, deep learning & machine learning in the financial sphere—a bibliometric analysis"}, {"paperId": "d83f72664f8d58f868af4eb8c3644cfcfacffd57", "title": "Revolutionizing Groundwater Management with Hybrid AI Models: A Practical Review"}, {"paperId": "bbd203fe205c93554baa03689b03bd82fa896836", "title": "The new wave of AI-powered luxury brands online shopping experience: The role of digital multisensory cues and customers’ engagement"}, {"paperId": "9ef6b9a36ba7a1c094e5eebe8a01b927d1c854f8", "title": "The role of augmented reality in redefining e-tailing: A review and research agenda"}, {"paperId": "5cf5d1c4feaf09cb11a1d07b7c127c6cbd0d6f79", "title": "Data, AI and governance in MaaS – Leading to sustainable mobility?"}, {"paperId": "c3dc285fbfc89c57d305d9b4c286f105cdf7f14a", "title": "Exploring chatbot trust: Antecedents and behavioural outcomes"}, {"paperId": "d45e1cbdb1eb5d50d7e587b957314d2ca780b695", "title": "Artificial intelligence in local government services: Public perceptions from Australia and Hong Kong"}, {"paperId": "2e73d164884d0183f0138d9c2f83d5a1f96f78de", "title": "Increasing clinical medical service satisfaction: An investigation into the impacts of Physicians' use of clinical decision-making support AI on patients' service satisfaction"}, {"paperId": "c119a870802c48a6136bc205669da8c5a70112b0", "title": "Informatics on a social view and need of ethical interventions for wellbeing via interference of artificial intelligence"}, {"paperId": "64bb97277140067aa4cedc996d0d5c2e34e4319b", "title": "AI Safety Subproblems for Software Engineering Researchers"}, {"paperId": "37621c8090a84c050d6e7963ffdc2413a57c8e76", "title": "Recent Progresses in Machine Learning Assisted Raman Spectroscopy"}, {"paperId": "b9c1275553669bac2b03338f5599b2536e6a8333", "title": "Use of Artificial Intelligence in Terms of Open Innovation Process and Management"}, {"paperId": "45ae12c71ea4908ce9733f0714655d1d2e76fb54", "title": "The Ethics of Artificial Intelligence: Examining the Ethical Considerations Surrounding the Development and Use of AI"}, {"paperId": "f75f924f53082736b5ecd85b7198f7d79e42e4ae", "title": "Unlocking the Power of ChatGPT: A Framework for Applying Generative AI in Education"}, {"paperId": "e2f04c45223ab68cfd0ec7a2f11a27347e3565e0", "title": "Quantifying the Benefit of Artificial Intelligence for Scientific Research"}, {"paperId": "eb4c5a1e9c0037f58f6bef1a74c5ec3fd698c77e", "title": "Bridging the civilian-military divide in responsible AI principles and practices"}, {"paperId": "a45fcad1973cd4076561fbdb547448b17b6291ab", "title": "Data Analytics for HR Students: Using RapidMiner to Develop Systems Thinking Skills Web Appendix"}, {"paperId": "7e9d03a918b8ae84eaf91cec8c4f812bdb1b2926", "title": "Should Artificial Intelligent Agents be Your Co-author? Arguments in Favour, Informed by ChatGPT"}, {"paperId": "c2a66aecd6fe33190f77bad8e1bd3a8c841a20a2", "title": "Chatbots and ChatGPT: A Bibliometric Analysis and Systematic Review of Publications in Web of Science and Scopus Databases"}, {"paperId": "16d83e930a4dab2d49f5d276838ddce79df3f787", "title": "Should ChatGPT be Biased? Challenges and Risks of Bias in Large Language Models"}, {"paperId": "8a9bf7df4fe06c52926532f128588ebd6bdbb36f", "title": "The critical determinants impacting artificial intelligence adoption at the organizational level"}, {"paperId": "4a7d0575c75c8b915e3313d22e4d833cf8d0c990", "title": "AI and emerging technology adoption: a research agenda for operations management"}, {"paperId": "41246b1805d4c35ac6c575c2e4146225ebfec0e1", "title": "Artificial intelligence (AI)-enabled CRM capability in healthcare: The impact on service innovation"}, {"paperId": "3c53dc34b86cb95bad01245a3511a167b24ff8cf", "title": "How can we manage biases in artificial intelligence systems – A systematic literature review"}, {"paperId": "8662ed36c3bc549ac330756d6f02d454730c5526", "title": "How can artificial intelligence and data science algorithms predict life expectancy - An empirical investigation spanning 193 countries"}, {"paperId": "826c51f4585e0b4c30cf8b26348f67646afbea34", "title": "Smart Warehouse: A bibliometric analysis and future research direction"}, {"paperId": "a9a17ae396385b4912f3c6aff0252d6720c87859", "title": "Unravelling the techno-functional building blocks of metaverse ecosystems - A review and research agenda"}, {"paperId": "2755c328c51de76238ad1fb6579daec1fe3b80f0", "title": "Democratizing artificial intelligence: How no-code AI can leverage machine learning operations"}, {"paperId": "6e22a91d9d7cf85e6dacf9536acddb828d73d522", "title": "Artificial intelligence and relocation of production activities: An empirical cross-national study"}, {"paperId": "bfc3483b830e4f3a4202226c79f9b0e3b54d25fc", "title": "Dependency of the learning technique on the problem nature"}, {"paperId": "33335c7a5149f8572dfc7693b885da27ace7ae70", "title": "Unlocking the power of AI to accelerate scientific progress and global collaboration"}, {"paperId": "7196b9544575d86c72a41b5343f447b9fc34dbe4", "title": "Outcome Based Education (OBE) Based Vocational Education Model in the Era of Artificial Intelligence (AI)"}, {"paperId": "4adb5c77a4e9d9d1e88ae8da7db90f6c9001f85f", "title": "Digitalization of civic education: risks and challenge"}, {"paperId": "8c9c9a67788ba0d1cc170a7490e1937fccb61966", "title": "Exploring QCD matter in extreme conditions with Machine Learning"}, {"paperId": "76133e4889c9226c7871f028819471763385d2e5", "title": "ChatGPT\n and consumers: Benefits, Pitfalls and Future Research Agenda"}, {"paperId": "db7f5edf548b2feea3f9f1719833aaef166c2705", "title": "Automation and AI-Enabled Customer Journey: A Bibliometric Analysis"}, {"paperId": "fb934ca057a0f72ec27fca212459f822bfceafad", "title": "Embedding Contextual Information through Reward Shaping in Multi-Agent Learning: A Case Study from Google Football"}, {"paperId": "1b1220f7f62ce1862bb5530a8c24568970814412", "title": "Chatbots in Education and Research: A Critical Examination of Ethical Implications and Solutions"}, {"paperId": "f0b9b8c0dc024e721f90aad8192305879704bbb1", "title": "Artificial Intelligence Chatbot Advisory System"}, {"paperId": "823e6dedd4e851fb52d51e15cc0d53f5c9ab9788", "title": "Critical analysis of integration of\n ICT\n and data analytics into the accounting curriculum: A multidimensional perspective"}, {"paperId": "291b4c6138f0009ee436446b147addc27f844fa7", "title": "The Effect of Human Resource Information Systems (HRIS) and Artificial Intelligence on Defense Industry Performance"}, {"paperId": "ee87c9edec213dc3a75a60f34aa15b8008adf136", "title": "Examining User Engagement and Experience in Agritech"}, {"paperId": "c583c7aabacb19e9ac14024d812dc4be819b1044", "title": "How to Bell the Cat? A Theoretical Review of Generative Artificial Intelligence towards Digital Disruption in All Walks of Life"}, {"paperId": "e9f7e90949e1418646e81d722017f6418da21519", "title": "Assessing the Impact of Racism on Neurodiversity based on Natural Language Processing and Artificial Intelligence"}, {"paperId": "2e47ae9c8e75e54c77a123d50f7a1c3bdc3d1e2a", "title": "Organisationale Ambidextrie als Erfolgsfaktor für KI-basierte Innovationen in der Produktion: Das Audi Production Lab"}, {"paperId": "7a76ce99794ad6794b47e35083a7c53f2284cdbe", "title": "Electronic Commerce Between Theory and Application According to Jordanian Law"}, {"paperId": "1b1fa022b4e5da06166f9f5baf8371ea4849c301", "title": "Simple and Efficient Confidence Score for Grading Whole Slide Images"}, {"paperId": "eb08a989abed31a519cac42f6e60c5889474d1ae", "title": "Artificial Intelligence and Public Values: Value Impacts and Governance in the Public Sector"}, {"paperId": "56dd00392fc3747faea40a588fff136bdbc4ba2e", "title": "Artificial Intelligence and Groups: Effects of Attitudes and Discretion on Collaboration"}, {"paperId": "289add077653b4d82c48c26d4664ad3c40e04314", "title": "Systematic Review on Humanizing Machine Intelligence and Artificial Intelligence"}, {"paperId": "5108e297c923a7296d99bfc88e882bc77acc28ae", "title": "A Bibliometric Review of the Evolution of Blockchain Technologies"}, {"paperId": "6c3b9662aeadbc677db36227e418e6749ff3c620", "title": "The impact of artificial intelligence capabilities on servitization: The moderating role of absorptive capacity-A dynamic capabilities perspective"}, {"paperId": "f22457f081670e5ed1e8cc94a126a3304c41bbc0", "title": "The perks and perils of artificial intelligence use in lateral exchange markets"}, {"paperId": "be0837b111e44d917ef47fc26a70a02c037734a4", "title": "Tracking the Research on Ten Emerging Digital Technologies in the AECO Industry"}, {"paperId": "2261a70966da441f832e20d42b6291f7a2e002d9", "title": "The Integration of Artificial Intelligence Into Patient Care: A Case of Atrial Fibrillation Caught by a Smartwatch"}, {"paperId": "68cce0d3f6df7268fc6e226609ba3c9806e06d87", "title": "Barriers to artificial intelligence adoption in smart cities: A systematic literature review and research agenda"}, {"paperId": "4f80056e33ae58e60eaf8f975cc01d3f9b6e01f3", "title": "Whether AI adoption challenges matter for public managers? The case of Polish cities"}, {"paperId": "d066e77d4e19e371f4e5c6880c924618039b417a", "title": "The Role of Defects and Interface Degradation on Ferroelectric HZO Capacitors Aging"}, {"paperId": "d6daa61777e3bf0b4557239b7bc9eeb8dc9a53bf", "title": "The future of platforms, big data and new forms of capital accumulation"}, {"paperId": "933f5488cf0f354c9beb0e0d8f81ee090c14cdc8", "title": "Effect of Artificial Intelligent on Empathy Quotient (EmQ) and Responsiveness of Customer Care Executive- A Study from Customer's Lenses"}, {"paperId": "641b46fc44d6c7db82640ad6f15da260589513ef", "title": "State-of-the-Art of Artificial Intelligence and Big Data Analytics Reviews in Five Different Domains: A Bibliometric Summary"}, {"paperId": "7093be7f9f54e1de55ef0a1d9c459da8cc28b074", "title": "The impact of multiagent systems on autonomous production and supply chain networks: use cases, barriers and contributions to logistics network resilience"}, {"paperId": "5cebc5fd9e130e33378f255adde80496b1041212", "title": "When the Automated fire Backfires: The Adoption of Algorithm-based HR Decision-making Could Induce Consumer’s Unfavorable Ethicality Inferences of the Company"}, {"paperId": "d7a84369d5ec6c7096a495a81008966b3bd76c21", "title": "Travelling the Metaverse: Potential Benefits and Main Challenges for Tourism Sectors and Research Applications"}, {"paperId": "cdf445d5d3ee377d9c8797cc04a1d70e1e694093", "title": "The European map of artificial intelligence development policies: a comparative analysis"}, {"paperId": "69f8ba5e791906ed2f18d1fbd897d62225259921", "title": "Can artificial intelligence’s limitations drive innovative work behaviour?"}, {"paperId": "98609145d54ad258187385d12dd624bddcbd9880", "title": "A step-by-step researcher's guide to the use of an AI-based transformer in epidemiology: an exploratory analysis of ChatGPT using the STROBE checklist for observational studies"}, {"paperId": "44d896d0d8aa189a68efdd86043a8d4a444119d8", "title": "Shaping the Metaverse into Reality: A Holistic Multidisciplinary Understanding of Opportunities, Challenges, and Avenues for Future Investigation"}, {"paperId": "31b759d36d56cfb08072dcf37d52ff666f5aa0ba", "title": "The role of institutional and self in the formation of trust in artificial intelligence technologies"}, {"paperId": "4b146fe948e44b9506666aa595eb3583c285067b", "title": "Investigating the Influence of Artificial Intelligence on Business Value in the Digital Era of Strategy: A Literature Review"}, {"paperId": "3200e16772cd05c63f08027adf842b24a4f1f64d", "title": "Out of Context: Investigating the Bias and Fairness Concerns of “Artificial Intelligence as a Service”"}, {"paperId": "92a8c67bca6f0ab7922d9c68a7bcff79c331c6a2", "title": "Unfolding the popularity of video conferencing apps - A privacy calculus perspective"}, {"paperId": "f4da28ce81bb0a65d0ffdd5db15075d71928a273", "title": "Technology readiness and the organizational journey towards AI adoption: An empirical study"}, {"paperId": "978b4d97f490463d4958d41851d07bab7b87e9ef", "title": "A twin data-driven approach for user-experience based design innovation"}, {"paperId": "6232d1c3d50e95f9caffcf483aa6a64025b7c9f2", "title": "The contributions of AI in the development of ideological and political perspectives in education"}, {"paperId": "924cda33fc778265730f0e773f8feb03f301d13b", "title": "Cooperate to play: How in-game cooperation knowledge impacts online gamer loyalty"}, {"paperId": "e0d978a70d4cf6f448a6bbedb5edce126cfd4210", "title": "Internet of Thing (IoT) review of review: Bibliometric overview since its foundation"}, {"paperId": "19d64c2ea2ac1bc9a6dda84a788ba5316e189f81", "title": "The public perceptions of algorithmic decision-making systems: Results from a large-scale survey"}, {"paperId": "3403f0c084ed434373625db688f9b1a69c238f0c", "title": "Generation Z use of artificial intelligence products and its impact on environmental sustainability: A cross-cultural comparison"}, {"paperId": "cf0dfa5044e6d67344f21468eb1ac425eb51f7f5", "title": "Introduction of an Integrated System for Measuring the BSC and DEA-Based Performance of Social Systems Using Uncontrollable Factors: A Case Study of Shahriar Municipalities"}, {"paperId": "932b3e28bd08762ed1b4c4c4aa8f5fcbc1b94f0b", "title": "Snakes and Ladders: Unpacking the Personalisation-Privacy Paradox in the Context of AI-Enabled Personalisation in the Physical Retail Environment"}, {"paperId": "2e8aeb7725546ad99a70e3580290371709f28ac9", "title": "Bias and Unfairness in Machine Learning Models: A Systematic Review on Datasets, Tools, Fairness Metrics, and Identification and Mitigation Methods"}, {"paperId": "750f6bd1852badfc12e692badef3a2e53695de92", "title": "Exploring the Major Trends and Emerging Themes of Artificial Intelligence in the Scientific Leading Journals amidst the COVID-19 Era"}, {"paperId": "2d215224245b1129e2a2fc97920e49f1bc56b623", "title": "Towards Artificial Intelligence Augmenting Facilitation: AI Affordances in Macro-Task Crowdsourcing"}, {"paperId": "b1ee08984f1b41500982f46ad224d858d92eb1e9", "title": "Customer experiences in the era of artificial intelligence (AI) in context to FinTech: a fuzzy AHP approach"}, {"paperId": "be26a9f3ff770430ddf249a7f06f09e5b4f103d8", "title": "Artificial intelligence in service industries: customers’ assessment of service production and resilient service operations"}, {"paperId": "baf13bfd29cb559cce3645bb72dde26b4117287f", "title": "The emerging significance of nanomedicine-based approaches to fighting COVID-19 variants of concern: A perspective on the nanotechnology’s role in COVID-19 diagnosis and treatment"}, {"paperId": "a5d40be94730e03cc4f6f8aa3bd8e7fba9903697", "title": "Digital Explosion and Entrepreneurship Education: Impact on Promoting Entrepreneurial Intention for Business Students"}, {"paperId": "7385eaf066ba20d7529b883a55156b455147b26f", "title": "Six Human-Centered Artificial Intelligence Grand Challenges"}, {"paperId": "2f12a8380a945774c17b84737c7b3c7c3ad8fb35", "title": "Deepfakes: Deceptions, mitigations, and opportunities"}, {"paperId": "8207b77911c43cb83fd36a22ea54a79ccf88f77f", "title": "In consilium apparatus: Artificial intelligence, stakeholder reciprocity, and firm performance"}, {"paperId": "dec74ed726bc9c8d4f666fd0eab077a43fd62b8e", "title": "Examining how AI capabilities can foster organizational performance in public organizations"}, {"paperId": "5ff05095d60435dd0c28572efd614f59c6075fbb", "title": "A systematic literature review of artificial intelligence in the healthcare sector: Benefits, challenges, methodologies, and functionalities"}, {"paperId": "f9f9586f8abd01e3b22d52b4e86be409895f1970", "title": "The Relationship between Nursing Students’ Smart Devices Addiction and Their Perception of Artificial Intelligence"}, {"paperId": "df62a27e575646e13e10e2f3b5fd337c892c16ef", "title": "Digitalization of Supply Chain Management with Industry 4.0 Enabling Technologies: A Sustainable Perspective"}, {"paperId": "f22be4cdfd1e23b14301d246396d06f8b7e452c4", "title": "Impact of fake news on firm performance during COVID-19: an assessment of moderated serial mediation using PLS-SEM"}, {"paperId": "e52eb98accd9f68f857473e149a919ea252ceb31", "title": "Cooperatives and the Use of Artificial Intelligence: A Critical View"}, {"paperId": "f11bb1c5c634e218df664c868044be27e158c0b2", "title": "Artificial Intelligence (AI) and Information Systems: Perspectives to Responsible AI"}, {"paperId": "e8ea0f0bc38bd1642e27e505b6b8ad4571681d61", "title": "Fake news on Facebook and their impact on supply chain disruption during COVID-19"}, {"paperId": "61b1c46a9c5d8e3a8f82b5b9d029dc71b9429c69", "title": "Metaverse marketing: How the metaverse will shape the future of consumer research and practice"}, {"paperId": "efb213bf11f52401ef94e8e37488ae34d2437f9f", "title": "Investigating the determinants of performance of artificial intelligence adoption in hospitality industry during COVID-19"}, {"paperId": "d4d69852e708e83f723385ea63a43f645d5ee7b8", "title": "Influence of AI in human lives"}, {"paperId": "46cba51ed0a1a327d1e48319ef371f7ee96e8329", "title": "Big data applications with theoretical models and social media in financial management"}, {"paperId": "f2008f8942ab9cb70374972e8004d2facf68ca60", "title": "Technological changes in the era of digitalization: What do collective agreements tell us?"}, {"paperId": "56a77440da2389106699a502899969551edbb7cc", "title": "LOJİSTİK VE TEDARİK ZİNCİRİNDE YAPAY ZEKÂ ÇALIŞMALARI: BİBLİYOMETRİK BİR ANALİZ"}, {"paperId": "380cf2125b78bcc6e142012a318b96c6093a039b", "title": "Cyber security and tourism: Bibliometric analysis"}, {"paperId": "6fb5ca0ff6821a92b080d0654d245d2407484701", "title": "The Roles of Personality Traits, AI Anxiety, and Demographic Factors in Attitudes toward Artificial Intelligence"}, {"paperId": "21dee90bd60a08f4af0d08cfdda0ee5638c9762b", "title": "The impact of artificial intelligence on total factor productivity: empirical evidence from China’s manufacturing enterprises"}, {"paperId": "a6f3a22f46283dcb371d2443c1f614f85f0856ab", "title": "Assessment of Deep Neural Network and Gradient Boosting Machines for Credit Risk Prediction Accuracy"}, {"paperId": "8a4a153402ac4a17faa5a71f704e9b1847717bdb", "title": "Vaccine supply chain management: An intelligent system utilizing blockchain, IoT and machine learning"}, {"paperId": "d434bb5245acb80d88e8bd3c3c93d2b177210014", "title": "Gamification of cooperation: A framework, literature review and future research agenda"}, {"paperId": "65a4973ec543b65847b9e7957b293b27c35c3bb5", "title": "Digital transformation of organization using AI-CRM: From microfoundational perspective with leadership support"}, {"paperId": "bbc042a127187d21a3722158b5b2cc0d51539eaa", "title": "Editorial introduction to the special issue: Social customer journey – behavioural and social implications of a digitally disruptive environment"}, {"paperId": "f3a5243471a22394e83d943f73c979668afee9e6", "title": "The adoption of industry 4.0 practices by the logistics industry: A systematic review of the gulf region"}, {"paperId": "c2e15d6bdc486b6b80a4fadeb40eafbdb6556e20", "title": "Applying XAI to an AI-based system for candidate management to mitigate bias and discrimination in hiring"}, {"paperId": "6b9e9af68504c38aa548ed4f48ed6eb442ec9af3", "title": "Exploring the influence of artificial intelligence technology on consumer repurchase intention: The mediation and moderation approach"}, {"paperId": "ec4fd338a930dd071d5b0b7c6da8b132158b891a", "title": "Facilitators and Barriers of Artificial Intelligence Applications in Rehabilitation: A Mixed-Method Approach"}, {"paperId": "7f59b1ba207a0d2e36d6d6ee896f10d41143f897", "title": "The self‐regulatory consequences of dependence on intelligent machines at work: Evidence from field and experimental studies"}, {"paperId": "ed943898d516382d93dbef0e0d5fe8fd8fc86222", "title": "The Nexus of Industry 4.0 and Circular Procurement: A Systematic Literature Review and Research Agenda"}, {"paperId": "b67eb6cf4fe0b4bb1521c4554e3a4dd7468e61a1", "title": "Is trust in artificial intelligence systems related to user personality? Review of empirical evidence and future research directions"}, {"paperId": "b203f29bee52c5830864531962dc698ceaa46e4a", "title": "Harmony in intelligent hybrid teams: the influence of the intellectual ability of artificial intelligence on human members' reactions"}, {"paperId": "421d98f9dc4e40413224595324be0acc2da12452", "title": "Bibliometric Analysis of the Application of Artificial Intelligence Techniques to the Management of Innovation Projects"}, {"paperId": "64c2bd8f4e01e47200544a1582debb10fa51ee09", "title": "AI-readiness and production resilience: empirical evidence from German manufacturing in times of the Covid-19 pandemic"}, {"paperId": "a49210f385aaafb627a12bb55d681cb61c4b5f6d", "title": "Artificial Intelligence and Robotics Led Technological Tremors: A Seismic Shift towards Digitizing the Legal Ecosystem"}, {"paperId": "e6e3f73b604dc6cf2cd56b47afae9eaffed7c839", "title": "When Human Meets Technology: Unlocking Hybrid Intelligence Role in Breakthrough Innovation Engagement via Self-Extension and Social Intelligence"}, {"paperId": "8ea34547b52410e7f89bad3a63cfb88e238e81e9", "title": "A Modeling Approach for Measuring the Performance of a Human-AI Collaborative Process"}, {"paperId": "6094988c9ebe2621e6cccc7bc6f52248117e19d0", "title": "Frontiers in Artificial Intelligence and Applications"}, {"paperId": "117257ea50ce2658286531845fa3819d0c164962", "title": "A Systematic Literature Review of User Trust in AI-Enabled Systems: An HCI Perspective"}, {"paperId": "509e18b6448d4e2624c78cf9ce1e4bac03958839", "title": "Training and Preparing Tomorrow’s Workforce for the Fourth Industrial Revolution"}, {"paperId": "bf32e8530218abc46a26b39091dfc70e04265ed0", "title": "A quick review of ethics, design thinking, gender, and AI development"}, {"paperId": "4b01a4ac9a783a25c1ba98519f507209f28c61e6", "title": "Managing healthcare supply chain through artificial intelligence (AI): A study of critical success factors"}, {"paperId": "d58489ff252595cb40db30fd56796124c4432c4f", "title": "A deep learning approach for estimation of price determinants"}, {"paperId": "260f4e25307bbfc6a8d17f5ff753a2c06c5825ae", "title": "Improving the cross-cultural functioning of deep artificial neural networks through machine enculturation"}, {"paperId": "a2b361cdf6b7362452120a217dfb62c0ed52f04d", "title": "Applications of artificial intelligence in B2B marketing: Challenges and future directions"}, {"paperId": "2b8d514dcc93cfb0d89e57464e374eb9af24d2cc", "title": "Identification of Barriers in Handling Container Movement at the Port using AHP–Fuzzy AHP Approach"}, {"paperId": "9d67d207de034f827b9801b6dce5e7f8fa0bff0f", "title": "The role of enterprise architecture-driven dynamic capabilities and operational digital ambidexterity in driving business value under the COVID-19 shock"}, {"paperId": "197775e1cccb0bb2b6cf8bc842bc95c0228ef7ae", "title": "Enhancing the resilience of low-income housing using emerging digital technologies"}, {"paperId": "077bd21161effcf188c2762eba43b2fb4b5e1257", "title": "Adaptive Legal Frameworks and Economic Dynamics in Emerging Tech-nologies: Navigating the Intersection for Responsible Innovation"}, {"paperId": "611d42070527801c5fe8a9302dd885aa8d6c8896", "title": "Navigating the Nexus: Legal and Economic Implications of Emerging Tech-nologies"}, {"paperId": "6da12022efa60afed4d4f933705713cc06b4b451", "title": "A Framework Based on Blockchain, Artificial Intelligence, and Big Data Analytics to Leverage Supply Chain Resilience considering the COVID-19"}, {"paperId": "1a2f15292e9d4546e6a1ba719fa1db67d696d692", "title": "Multidisciplinary collaboration on exoskeleton development adopting user-centered design: a systematic integrative review."}, {"paperId": "60bc8ee2065474c37e2a48c6641ca1044ff79836", "title": "Identification of economic management best practices to improve national financial development for developing countries"}, {"paperId": "f5e0e9c1c77ef96fc77d3e7c8e6dd7b9cb492153", "title": "The adoption of artificial intelligence powered workforce management for effective revenue growth of micro, small, and medium scale enterprises (MSMEs)"}, {"paperId": "658dc13f202674799fc2ca02047988a9cd433752", "title": "Diversity in people's reluctance to use medical artificial intelligence: Identifying subgroups through latent profile analysis"}, {"paperId": "0b6d6af68db71081af79e6a4054baba396678110", "title": "The adoption of Artificial Intelligence in the public sector in Europe: drivers, features, and impacts"}, {"paperId": "4199ce99d55f700663363cad74e1fbc1712ac446", "title": "Perceived challenges and opportunities of machine learning applications in governmental organisations: an interview-based exploration in the Netherlands"}, {"paperId": "7472422e0beb11868be1c80fab4ada5b12143991", "title": "Product development, fashion buying and merchandising"}, {"paperId": "ec5215e376ac9d5606a95c93a1066b3c390702d2", "title": "AI adoption and diffusion in public administration: A systematic literature review and future research agenda"}, {"paperId": "cc0ec033f9ee11dd60765df842b876f1d9807aef", "title": "Government Digital Transformation: Understanding the Role of Government Social Media"}, {"paperId": "f5e4e7941f2be6a34500d8a14a4506739ea22993", "title": "Investigating the moderating role of AI-enabled services on flow and awe experience"}, {"paperId": "05d9616ea38994145cfc25dde15472fe6e5ac24b", "title": "Drawing goals nearer: Using the goal-gradient perspective to increase online game usage"}, {"paperId": "9ca0f60e96ee58338efdf7a64fe8205116a050d8", "title": "The effect of required warmth on consumer acceptance of artificial intelligence in service: The moderating role of AI-human collaboration"}, {"paperId": "87f6002bd8e4907b37ea4180f7b09a168575dff7", "title": "Early bird catches the worm! Meta-analysis of autonomous vehicles adoption - Moderating role of automation level, ownership and culture"}, {"paperId": "dc8107cc95e7cb650dbb21824089a8aa7c3528b8", "title": "How does artificial intelligence create business agility? Evidence from chatbots"}, {"paperId": "817c3c7cad60d821fb578d6eeddf7d32ae58e24e", "title": "Metaverse beyond the hype: Multidisciplinary perspectives on emerging challenges, opportunities, and agenda for research, practice and policy"}, {"paperId": "6b4cb4832d556398145255e4bd559219f524cbe0", "title": "Artificial intelligence in tourism and hospitality: Bibliometric analysis and research agenda"}, {"paperId": "04719c367f34da8aba62e898ac50810a09af077e", "title": "Artificial Intelligence and Innovation to Reduce the Impact of Extreme Weather Events on Sustainable Production"}, {"paperId": "462a1d9069d58438401ef8d98a919eb51b0c2609", "title": "Modeling Conceptual Framework for Implementing Barriers of AI in Public Healthcare for Improving Operational Excellence: Experiences from Developing Countries"}, {"paperId": "60986815ca97a246c6e92e909cc8af85e58474cf", "title": "Improved bald eagle search algorithm with dimension learning-based hunting for autonomous vehicle including vision dynamics"}, {"paperId": "3c7a6815a10593e9fd39aa7d221958f902b24e3b", "title": "The influence of artificial intelligence adoption on circular economy practices in manufacturing industries"}, {"paperId": "96deff80ad70573b8d4ee6c5d75733302c6ef099", "title": "Realizing the potential of artificial intelligence in healthcare: Learning from intervention, innovation, implementation and improvement sciences"}, {"paperId": "cb6352fd271cf094c8778282ce9aa085e124d5db", "title": "How does the tourism and hospitality industry use artificial intelligence? A review of empirical studies and future research agenda"}, {"paperId": "ef142dcf15a77d2946a5102eb114c6abc1e5be30", "title": "Marketing inclusive banking services to financially vulnerable consumers: a service design approach"}, {"paperId": "b2e0e0aba8c076dbd98b8b47b2138c5ea18e174b", "title": "Artificial intelligence for decision-making and the future of work"}, {"paperId": "0e1fee6f36c29d1907492bdb6727cd50e020369d", "title": "Barriers Related to AI Implementation in Supply Chain Management"}, {"paperId": "2f54c2a401d06d8097adf0a469f635d0a3244c8b", "title": "Operationalizing Artificial Intelligence-Enabled Customer Analytics Capability in Retailing"}, {"paperId": "89fd9025b6b65dc895e0b2dec173c4b450205c66", "title": "AI anthropomorphism and its effect on users' self-congruence and self–AI integration: A theoretical framework and research agenda"}, {"paperId": "aa8c1d6e2239185eec3c3283c0343686826d8630", "title": "Blockchain and AI technology convergence: Applications in transportation systems"}, {"paperId": "c1e43ecd0eb5cbad0a38e52d699d489386a6a9ee", "title": "Differentiating artificial intelligence activity clusters in Australia"}, {"paperId": "1ff4757e8274aa31418cfdfa8fd824f148b7122d", "title": "Artificial intelligence (AI) applications for marketing: A literature-based study"}, {"paperId": "fe46279bd92de6f4044d7433e7cbee45119ac136", "title": "Artificial intelligence in innovation research: A systematic review, conceptual framework, and future research directions"}, {"paperId": "6d0bb039f4d0286809a3f21cfdc35f17ac05d9ab", "title": "Should the chatbot \"save itself\" or \"be helped by others\"? The influence of service recovery types on consumer perceptions of recovery satisfaction"}, {"paperId": "4a51adb2e33504845c68c41490e77c884723cc3f", "title": "The dark side of mobile money: Perspectives from an emerging economy"}, {"paperId": "ab56e8238f6fe926330d7568efac3ce55dd71be2", "title": "The Use of Artificial Intelligence for Smart Decision-Making in Smart Cities: A Moderated Mediated Model of Technology Anxiety and Internal Threats of IoT"}, {"paperId": "1ca5b200961c8cd0df8692f324c89e88f030cd0e", "title": "Severity analysis and risk profiling of port logistics barriers in the Industry 4.0 era"}, {"paperId": "c73c18ec0c2fb5e62f5d6d1f470e36ddaf39a1e0", "title": "Formal and relational governance of artificial intelligence outsourcing"}, {"paperId": "2551de2ba53b08cb0c042d9fa59356650540509b", "title": "AI-driven banking services: the next frontier for a personalised experience in the emerging market"}, {"paperId": "7003223e6dd6f561d653c9e82380d75023d87370", "title": "Toward a Modern Last-Mile Delivery: Consequences and Obstacles of Intelligent Technology"}, {"paperId": "228b4bdfde84eb496d5bd6df7500b6f6a6634083", "title": "Cooperative and uncooperative institution designs: Surprises and problems in open-source game theory"}, {"paperId": "9ca54f7cc3f8a9ac24e40c33c5d1dc1323b1bb14", "title": "Advancing the cybersecurity of the healthcare system with self-optimising and self-adaptative artificial intelligence (part 2)"}, {"paperId": "8c5186bd9c2fb8bbf291ad0a48db6cbab8d76197", "title": "Analyzing employees’ perceptions of using artificial intelligence and gamification in HRM practices on employee’s job insecurity"}, {"paperId": "4cb153e1194250097cad9410eb5050e08133b003", "title": "AgriFood supply chain traceability: data sharing in a farm-to-fork case"}, {"paperId": "24f02793ed6e31665b9c152edb71a2b442df9f1a", "title": "Trust or mistrust in algorithmic grading? An embedded agency perspective"}, {"paperId": "06bf56869e3bf59ae0bb3cd0f32ffa7dd07fe918", "title": "Beyond effective use: Integrating wise reasoning in machine learning development"}, {"paperId": "b543822e4b289e5ed2ff695ba21bfa64ceb98adf", "title": "The appropriation of conversational AI in the workplace: A taxonomy of AI chatbot users"}, {"paperId": "2f629c79344b2cbcae3635dd06880ea943d837a4", "title": "Algorithm awareness: Why user awareness is critical for personal privacy in the adoption of algorithmic platforms?"}, {"paperId": "536c1cfceb7720667e06fdb16e9161a5830394ef", "title": "Competitor identification: A review of use cases, data sources, and algorithms"}, {"paperId": "53859f827fb20dcb8ae6869620d73be400e4c306", "title": "Impact of artificial intelligence-driven big data analytics culture on agility and resilience in humanitarian supply chain: A practice-based view"}, {"paperId": "fefa5665e9eefdb2f599a30f14156064abc21a35", "title": "The Deinstitutionalization of Business Support Functions through Artificial Intelligence"}, {"paperId": "2be56ff0ca757e1e6693da081f880d124595a9ab", "title": "Statistical Hypothesis Testing Based on Machine Learning: Large Deviations Analysis"}, {"paperId": "e2e1ddbc4ba93f02d8dfd343a561cf8238adc82e", "title": "Roadmap Towards Responsible AI in Crisis Resilience Management"}, {"paperId": "e17dba5391f906e80c257b708e4218782a505564", "title": "HOW ARTIFICIAL INTELLIGENCE HAS CHANGED E-LEARNING EDUCATION IN THE META ERA"}, {"paperId": "11b0733a0de1a9c6281148f74c9d1f869fd754be", "title": "Perception of the Impact of Artificial Intelligence in the Decision-Making Processes of Public Healthcare Professionals"}, {"paperId": "fb6a0c76cb2b611bad735e79fb89bb77490383e3", "title": "A Review of Research on Artificial Intelligence Life Cycle Based on Bibliometrics"}, {"paperId": "e34a5b8cc4702583b7ac4fa75ff085765a8b241e", "title": "Legal status of artificial intelligence-based health insurance services"}, {"paperId": "3a18c701b0664ac05a56372185c1725ae6b4cc09", "title": "Policy capacity and rise of data‐based policy innovation labs"}, {"paperId": "56923f065ef22cee91287df04a996978e1d83e20", "title": "Artificial Intelligence and Firm Performance: Does Machine Intelligence Shield Firms from Risks?"}, {"paperId": "f3f93733a80fe02c6ba933e6e03774add3a651a5", "title": "An Improved VGG Model for Skin Cancer Detection"}, {"paperId": "5d559a2ff4b19dfb337ec9e09dac4f80510d0fc5", "title": "Ciencia de datos en la evaluación del impacto de las políticas públicas: Una revisión de la literatura"}, {"paperId": "4962a7543b87093845b6f82e470f75ce99fc2b28", "title": "An evaluation of the critical success factors impacting artificial intelligence implementation"}, {"paperId": "92d693cefd9415a211c6edaaf14136439315f25b", "title": "Orchestrating artificial intelligence for urban sustainability"}, {"paperId": "231c9af2c48f928025e57c06ce5d618c74d1501b", "title": "Exploring customer adoption of autonomous shopping systems"}, {"paperId": "9b5e1ba69283a7261008e53d6ee7939a0441700c", "title": "Exploring benefits and ethical challenges in the rise of mHealth (mobile healthcare) technology for the common good: An analysis of mobile applications for health specialists"}, {"paperId": "c9a7fa7e202039418507fe198bf2cf13cb857105", "title": "Examine the Mediating Role of the Information Technology Capabilities on the Relationship Between Artificial Intelligence and Competitive Advantage During the COVID-19 Pandemic"}, {"paperId": "866af4963caf9b1cfd1fcb61b8ad5e8595d990be", "title": "Measuring the Left Ventricular Ejection Fraction using Geometric Features"}, {"paperId": "aae3ef0bf2e990d563f9b4f2a16875a29aa85ea4", "title": "Organizational Capabilities for AI Implementation—Coping with Inscrutability and Data Dependency in AI"}, {"paperId": "b487e90dce77700226b053fb89e88649fab64782", "title": "Maximizing team synergy in AI-related interdisciplinary groups: an interdisciplinary-by-design iterative methodology"}, {"paperId": "d430fc728df3c818c6f7f2e71de9443f44a693db", "title": "From the “rush to ethics” to the “race for governance” in Artificial Intelligence"}, {"paperId": "8f43cb2edd6240d76e9ec4c8a4383b0ca56a1137", "title": "Decision support using AI: the data exploitation at telecoms in practice"}, {"paperId": "040be37c6ed98e955dca947e9cc9de511b2aa724", "title": "Artificial intelligence based decision-making in accounting and auditing: ethical challenges and normative thinking"}, {"paperId": "4844275ccb699c6a86841d6fd82b3a341d8daac3", "title": "Adoption of AI-Enabled Tools in Social Development Organizations in India: An Extension of UTAUT Model"}, {"paperId": "375260b66e9eacf10f23b1eabd596a51e83e64ed", "title": "Peace engineering and compassionate operations: a framework for leveraging social good"}, {"paperId": "09898ed2faa4c34863cd40d8e10c1d575709615e", "title": "Quantitative Analysis of Implementation Challenges of IoT-Based Digital Supply Chain (Supply Chain 0/4)"}, {"paperId": "f784d2e40423b5379955d7606e142286c0f9a0f1", "title": "Fairness and Explanation in AI-Informed Decision Making"}, {"paperId": "05f88d79769ccd723eb795082151a7d70cc971ef", "title": "A Systems View of Enterprise Data Governance for Artificial Intelligence Applications in Government"}, {"paperId": "1f71073210b7ee3337f535a1e2479e80cf69311e", "title": "Mind the Gap: Towards an Understanding of Government Decision-Making based on Artificial Intelligence"}, {"paperId": "210df79ed658d65dbe653d30092bcec4ddb19aac", "title": "Conceptual challenges of researching Artificial Intelligence in public administrations"}, {"paperId": "85e708f341ac0a8c32ea0e611e78c9d550de75e5", "title": "The impacts of artificial intelligence on managerial skills"}, {"paperId": "45c1959ec1bbc826845108052df40c7ef2952e8f", "title": "The influence of digital entrepreneurship and entrepreneurial orientation on intention of family businesses to adopt artificial intelligence: examining the mediating role of business innovativeness"}, {"paperId": "1b9c49409ec6b187c6ae632c0540dbbc1c44257f", "title": "The role of artificial intelligence in effective business operations during COVID-19"}, {"paperId": "9dd66bbcd8d3315849caf22f412fe0bad2549b88", "title": "Digitalization and academic research: knowing of and using digital services and software to develop scientific papers"}, {"paperId": "2c3d4154a8cb79edbd3515f41e238f7eccd5d39a", "title": "Chatbots in Marketing: An In-Deep Case Study Capturing Future Perspectives of AI in Advertising"}, {"paperId": "1ddff552009f2f0e22910eb11c71f8d5671e9ab1", "title": "Stop ordering machine learning algorithms by their explainability! A user-centered investigation of performance and explainability"}, {"paperId": "485e4cdcc13d81e8a646e9f5a3c085c3e1085251", "title": "Integrating human knowledge into artificial intelligence for complex and ill-structured problems: Informed artificial intelligence"}, {"paperId": "ae9c9bd2334c235de3d1ea799f240ccebee8718d", "title": "Resource-Based Perspective on ICT Use and Firm Performance: A Meta-analysis Investigating the Moderating Role of Cross-Country ICT Development Status"}, {"paperId": "d857cf9c84dc10d813283d654fa956f568ebb2ef", "title": "Algorithmic Decision Making and Model Explainability Preferences in the Insurance Industry: A Delphi Study"}, {"paperId": "d0039cc8bbc7e364579a70f24ec2eeac8301ddc1", "title": "How Do Users Feel When They Use Artificial Intelligence for Decision Making? A Framework for Assessing Users’ Perception"}, {"paperId": "68c52949d8f8cb80e015f25a1fca0e47b4d729e6", "title": "Increasing millennial legal compliance and awareness through virtual applications"}, {"paperId": "c4a32379e1b7824c5ffa6cfe05a12aca0e31a725", "title": "Implementing Artificial Intelligence in Traditional B2B Marketing Practices: An Activity Theory Perspective"}, {"paperId": "1518e905975e5706fbae7f836a0e0285369a4c22", "title": "Artificial intelligence-driven risk management for enhancing supply chain agility: A deep-learning-based dual-stage PLS-SEM-ANN analysis"}, {"paperId": "ac40bf81c0f57feb4e220813c9409264b67ccd2d", "title": "Artificial intelligence as a facilitator of the energy transition"}, {"paperId": "ede53cd87532acbc8b947e2f311d0510ccef7f04", "title": "Automated machine learning: AI-driven decision making in business analytics"}, {"paperId": "f302b3027c6ccb7e9e79da09ddbd52da936d011c", "title": "Deep Learning vs. Gradient Boosting: Benchmarking state-of-the-art machine learning algorithms for credit scoring"}, {"paperId": "8ddb5db06a2015dfa8d5a95696ad811c973750ba", "title": "Impact of E-commerce adoption on business performance of SMEs in Sri Lanka; moderating role of artificial intelligence"}, {"paperId": "25892f3c0095e54db1b9c09d1d6f6b2c75341b87", "title": "Drivers of privacy concerns when interacting with a chatbot in a customer service encounter"}, {"paperId": "9e32aeda96e4a74d37f5b19899dab36573448c10", "title": "“A Large Playground”: Examining the Current State and Implications of Conversational Agent Adoption in Organizations"}, {"paperId": "924ff5793d3d1eee3be5c113a14ed6b8df62b8c3", "title": "From “Human-to-Human” to “Human-to-Non-human” – Influence Factors of Artificial Intelligence-Enabled Consumer Value Co-creation Behavior"}, {"paperId": "3c4b95ef38255509ba80e54fdcd2493766f4d274", "title": "Developing a service quality scale for artificial intelligence service agents"}, {"paperId": "526b90257d87275cf57b75e28ff77b0ba3af4256", "title": "AI-employee collaboration and business performance: Integrating knowledge-based view, socio-technical systems and organisational socialisation framework"}, {"paperId": "ed37c3f2e0f178eb64e943809a0121971f03cf42", "title": "Algorithmic bias in machine learning-based marketing models"}, {"paperId": "b48971b18289a26f84718cd7e5adcf1224f147e1", "title": "Analysis of the adoption of emergent technologies for risk management in the era of digital manufacturing"}, {"paperId": "bc3afb697542d329c2e8e9b068b8b6309f44c3a6", "title": "Achieving the promise of AI and ML in delivering economic and relational customer value in B2B"}, {"paperId": "0933414b1405166c37841aa77ae8def993c57709", "title": "AI-based innovation in B2B marketing: An interdisciplinary framework incorporating academic and practitioner perspectives"}, {"paperId": "894c47015b5e1190c7a0785727f9cf697da0956b", "title": "Interpreting national artificial intelligence plans: A screening approach for aspirations and reality"}, {"paperId": "73738b5dfe0cd00d8d94bdb772c829019b59439c", "title": "Research on Business Data Management System of Cultural and Creative Product Design and Development based on Artificial Intelligence Algorithm"}, {"paperId": "efd361e4cc627c5bdfeb5d0b43423b4b44a870bb", "title": "The future is yesterday: Use of AI-driven facial recognition to enhance value in the travel and tourism industry"}, {"paperId": "a6d462c4b5e5ce4d7088c432488b188d15f9202b", "title": "AI-Enabled Opportunities and Transformation Challenges for SMEs in the Post-pandemic Era: A Review and Research Agenda"}, {"paperId": "a43c3dc31fb14a9015352c70987e3b4449186525", "title": "An Agile New Research Framework for Hybrid Human-AI Teaming: Trust, Transparency, and Transferability"}, {"paperId": "bf38d5886bf20432d43316a1ddbe7338666769a1", "title": "Successive generation introduction time for high technological products: an analysis based on different multi-attribute utility functions"}, {"paperId": "855005ed08b08e4d1c8521a8670c45870b5699f5", "title": "Adaptive cognitive fit: Artificial intelligence augmented management of information facets and representations"}, {"paperId": "599754c9dd93499e953c481c6b1511c76f78b91d", "title": "Editorial: Online User Behavior and User-Generated Content"}, {"paperId": "79def24455bf7c39903f46ef32ac82eaa8f32166", "title": "AI as an organizational agent to nurture: effectively introducing chatbots in public entities"}, {"paperId": "bd732e9cf7aa538454cb4bb0bdb34ebd71b3d3ec", "title": "Hybrid Machine Learning Model for Electricity Consumption Prediction Using Random Forest and Artificial Neural Networks"}, {"paperId": "faff8451d4fa86ea547b7071ff610b2e9723fb82", "title": "Perceived Benefits of Automation and Artificial Intelligence in the AEC Sector: An Interpretive Structural Modeling Approach"}, {"paperId": "9cdd9ad6635559cd42f217f27c9fe89b9da0831e", "title": "An Assessment of the Barriers Impacting Responsible Artificial Intelligence"}, {"paperId": "105228373103e540f21c0fc5ad5344555b0874c4", "title": "Trends and Trajectories in the Software Industry: implications for the future of work"}, {"paperId": "46be23c815508cd598333c9fad8582044d8a3ea4", "title": "A Review of Numerical Research on the Pressure Swing Adsorption Process"}, {"paperId": "3c3d9a342e02c6f2561315bd5c5062ffd3ac1f05", "title": "Artificial Intelligence Feedback Loops in Mobile Platform Business Models"}, {"paperId": "0eada8006dc828b85f9ae931920eaee63d09123c", "title": "Affective Attitudes Toward Robots at Work: A Population-Wide Four-Wave Survey Study"}, {"paperId": "3744cd804e3ab5f9cb326e4b57a1e4d0fb13cde3", "title": "A scholarly network of AI research with an information science focus: Global North and Global South perspectives"}, {"paperId": "ae2a365cd4a2cb203af5c2b22b3ee213ddc5a453", "title": "Adopting AI in the Context of Knowledge Work: Empirical Insights from German Organizations"}, {"paperId": "19e4817f7ee1d9fd28fe7ba5b096cabf20b269a9", "title": "Artificial Intelligence-Assisted Optimization and Multiphase Analysis of Polygon PEM Fuel Cells"}, {"paperId": "276fa9491ff3e2236fa9e7da68a3f583e56a7f49", "title": "A Comprehensive Survey on Role of Artificial Intelligence in Solar Energy Processes"}, {"paperId": "e0a7fc82f21fce1d0880e071ee5ef8a091520e08", "title": "B2C E-Commerce Customer Churn Prediction Based on K-Means and SVM"}, {"paperId": "c1e5f9166b18fcd076d9e36a2a52828a4e99985c", "title": "A study on AI and ICT for Sustainable Manufacturing"}, {"paperId": "8a8e2c23fd7179d981cbefbbc4844494e7255c53", "title": "GPT-3 and InstructGPT: technological dystopianism, utopianism, and “Contextual” perspectives in AI ethics and industry"}, {"paperId": "27c91a4cbc9f3bbdf8cd162165e778e13342f8d1", "title": "Climate change and COP26: Are digital technologies and information management part of the problem or the solution? An editorial reflection and call to action"}, {"paperId": "3c758df0224de4a6215accb94eac604bea8b3ffd", "title": "Video Sequence Analysis for On-Table Tennis Player Ranking and Analysis"}, {"paperId": "fd6240109ad3c7874ccb102491c637e5d0252e48", "title": "Fate of AI for Smart City Services in India: A Qualitative Study"}, {"paperId": "672bd70d4169949c972267e856b86534afe17b0d", "title": "Future of artificial intelligence and its influence on supply chain risk management - A systematic review"}, {"paperId": "9eaeae94ce6d6161a364731e1b1d15fb6ea05944", "title": "Using robots at work during the COVID‐19 crisis evokes passion decay: Evidence from field and experimental studies"}, {"paperId": "2ac8fd395ee98da9ec79a83c28e3e60c97ab828a", "title": "Using blockchain to signal quality in the food supply chain: The impact on consumer purchase intentions and the moderating effect of brand familiarity"}, {"paperId": "1a762ab9539fe605c3b97f8bec4f1a40b5f64683", "title": "An automatic learning rate decay strategy for stochastic gradient descent optimization methods in neural networks"}, {"paperId": "2858c60318bde731ac4dc1ceddbe69eaf3906e18", "title": "An AI ethics ‘David and Goliath’: value conflicts between large tech companies and their employees"}, {"paperId": "cff644d63ea6e911e6195712a9ab3a18429c5b00", "title": "HISTOPATHOLOGY IMAGE CLASSIFICATION USING HYBRID PARALLEL STRUCTURED DEEP-CNN MODELS"}, {"paperId": "cc035e59c49b422f2e800cdabb864d1f181b598d", "title": "Устойчивость искусственного интеллекта: взгляд урбаниста сквозь призму концепции умного и устойчивого города*"}, {"paperId": "b36143511169bef0a41fcef26af89c5c4bd65205", "title": "Artificial Intelligence (AI) as a computerized decision aid for selection of candidates in higher education"}, {"paperId": "86d0a3db5d4d8bb576d308c70cc0c9277fcdc0a1", "title": "Trends, risks and potential cooperations in the AI development market: expectations of the Hungarian investors and developers in an international context"}, {"paperId": "67845f72c6f4c1ca37ea521f3ce47d93f1a1197d", "title": "The Impact of Artificial Intelligence on Sustainable Development in Electronic Markets"}, {"paperId": "c01043f55be3a9d6402795add02bb1d6bd9eff4a", "title": "A multi-stakeholder perspective of relationship marketing in higher education institutions"}, {"paperId": "98b16c2077f19d525d593b3c99438dec8debe2c6", "title": "The influence of artificial intelligence technology judicial decision reasoning on contract performance in manufacturing supply chain: A simulation analysis using Evolutionary Game approach"}, {"paperId": "cd484fe9350b7491f1fa60b42fcb6603dbaf3c94", "title": "Untangling the critical success factors for blockchain adoption in supply chain: a social network analysis"}, {"paperId": "0a336640976dce0ec4cc283417f5d33a6a7a4824", "title": "Personalized Recommendation Algorithm for University Civics Courses with Multiple User Interests"}, {"paperId": "7768bb6aaf1da6e1801fe0a489b14ab1f5236050", "title": "Barriers to BIM-Based Life Cycle Sustainability Assessment for Buildings: An Interpretive Structural Modelling Approach"}, {"paperId": "7f0883c147e68c6a603be7ac5ccac305bd89a01d", "title": "The Global Politics of Artificial Intelligence"}, {"paperId": "facca3eff019a509ac88b0ce4b8cb60341f22d78", "title": "Artificial intelligence – challenges and opportunities for international HRM: a review and research agenda"}, {"paperId": "dddf90f2a5b1f2abb800228095b076b7ec577a7e", "title": "Sociology between big data and research frontiers, a challenge for educational policies and skills"}, {"paperId": "87b193c1b30e46bba8b669912073e8c790fbc069", "title": "Supply chain insights from social media users’ responses to panic buying during COVID-19: the herd mentality"}, {"paperId": "0326ad2e042d1aeeec2b17e03eb5303ef43cb610", "title": "“Alexa, let’s talk about my productivity”: The impact of digital assistants on work productivity"}, {"paperId": "d0b26546949bfa5e10fad1af7b37615a53e99874", "title": "Governance of artificial intelligence: A risk and guideline-based integrative framework"}, {"paperId": "d725b6d0001e854c77c7d57386450b11ac23bd9e", "title": "Artificial intelligence in E-Commerce: a bibliometric study and literature review"}, {"paperId": "b7e7277b80ed1049667c18d9cc33151d1fa9a01b", "title": "Technological frames, CIOs, and Artificial Intelligence in public administration: A socio-cognitive exploratory study in Spanish local governments"}, {"paperId": "b96e6687b57efa6ebd375c0ebc4765b0aadc4e35", "title": "Healthcare system: Moving forward with artificial intelligence"}, {"paperId": "17a484931623634d943c2e261b3ba370b854adbe", "title": "Bias and unfairness in machine learning models: a systematic literature review"}, {"paperId": "2db0876940068279e829854a498337ddff796432", "title": "AI bias: exploring discriminatory algorithmic decision-making models and the application of possible machine-centric solutions adapted from the pharmaceutical industry"}, {"paperId": "6ce958deb1c8706d4915bacc1fb4a7228d2fa7bc", "title": "Responsible innovation ecosystems: Ethical implications of the application of the ecosystem concept to artificial intelligence"}, {"paperId": "2e2e31d4161b003332c87f75bc52463215d63d8b", "title": "Editorial: How to develop a quality research article and avoid a journal desk rejection"}, {"paperId": "65ada5eec961b70a495640ada0efb58a1e70d667", "title": "Ethical framework for Artificial Intelligence and Digital technologies"}, {"paperId": "a073a76b955a70bee71178cef4248218171a4f0b", "title": "How does media richness foster online gamer loyalty?"}, {"paperId": "20616b3fcd4551ad25caf1ce97a0948e849718da", "title": "Employees' perceptions of chatbots in B2B marketing: Affordances vs. disaffordances"}, {"paperId": "9b2efc2812245f6f6253382455f0f0f489644f78", "title": "What drives technology-enhanced storytelling immersion? The role of digital humans"}, {"paperId": "442bce62f03141bf183b011eda8df276c1c39ee2", "title": "Wishful thinking? Addressing the long-term implications of COVID-19 for transport in Nigeria"}, {"paperId": "4bd26de9c80cc691506072e16d607557eae95091", "title": "Digital twin-driven intelligence disaster prevention and mitigation for infrastructure: advances, challenges, and opportunities"}, {"paperId": "14e00d807609df55e29fc546c3dcee546a0619ba", "title": "Luxury Hospitality and the Adoption of Voice Assistants: The Role of Openness to Change and Status Consumption"}, {"paperId": "fc84045ae880e4794a83f4db4ae2720380fb4ec3", "title": "Deep Learning Meets Deep Democracy: Deliberative Governance and Responsible Innovation in Artificial Intelligence"}, {"paperId": "870bcb867666c1725d913db447463d7cfe8b6826", "title": "The Association Between the Success of Information Systems and Crises Management (A Theoretical View and Proposed Framework)"}, {"paperId": "d486f67c7a9744307d358c6bec37c45506dc4671", "title": "Evolving uncertainty in healthcare service interactions during COVID-19: Artificial Intelligence - a threat or support to value cocreation?"}, {"paperId": "5a1f34f57771e311e8e1a2bd953263b8183a3487", "title": "Design principles for conversational agents to support Emergency Management Agencies"}, {"paperId": "9dc75e02d7b6edfe12751cd02b80db9dfcd36512", "title": "Artificial Intelligence in the Water–Energy–Food Model: A Holistic Approach towards Sustainable Development Goals"}, {"paperId": "ccce8afb43154cf5ad8fc3dfcd0f1bf3e4b3a7f1", "title": "The Expectations of Project Managers from Artificial Intelligence: A Delphi Study"}, {"paperId": "7b5058faebf07ef6a0b4d1bf44c9f4d319249a26", "title": "Gregory Scopino: Algo Bots and the Law"}, {"paperId": "6ae343cee0f295fc42f02e586a0c2a917475f8b2", "title": "Data intelligence and analytics: A bibliometric analysis of human–Artificial intelligence in public sector decision-making effectiveness"}, {"paperId": "5bcf9f62857753afd39148e1c2bab3ea7b3bd0d5", "title": "Power negotiation on the tango dancefloor: The adoption of AI in B2B marketing"}, {"paperId": "8f72f1253e5c3eb21a8a0641b6c34e194a7543ac", "title": "Impact of artificial intelligence-enabled job characteristics and perceived substitution crisis on innovative work behavior of employees from high-tech firms"}, {"paperId": "6efaf08b938d2da79acd2599c06537e3d037c161", "title": "Adopting big data analytics (BDA) in business-to-business (B2B) organizations – Development of a model of needs"}, {"paperId": "c525b818bda1fdc90edcbaa92df30d8236b10fc9", "title": "Mapping technological innovation dynamics in artificial intelligence domains: Evidence from a global patent analysis"}, {"paperId": "93845991fd3c39ac08aba555fe175f5a662456bf", "title": "Managers' understanding of artificial intelligence in relation to marketing financial services: insights from a cross-country study"}, {"paperId": "c1d7fb919302525577793dc2f18280c08741a3e0", "title": "Mapping the Wave of Industry Digitalization by Co-Word Analysis: An Exploration of Four Disruptive Industries"}, {"paperId": "1ed13e2932a01bffc1b1e18bd5beb8e4e38b0ee0", "title": "Power dynamics in organisations and the role of information systems"}, {"paperId": "64856e6b6af2dc5c26a88e0d708153848f098d02", "title": "A Systematic Literature Review of Machine Learning Tools for Supporting Supply Chain Management in the Manufacturing Environment"}, {"paperId": "98d9eac7536642ecd26e3ed522122508b0f542b8", "title": "Conceptual Framework—Artificial Intelligence and Better Entrepreneurial Decision-Making: The Influence of Customer Preference, Industry Benchmark, and Employee Involvement in an Emerging Market"}, {"paperId": "c013212b29db974362a595962162c07e9b7f4c6b", "title": "The European Approach to Building AI Policy and Governance: A Haven for Bureaucrats or Innovators?"}, {"paperId": "e55c6c2aa8ab0210b9ea1cde549d01f1cc6b2c89", "title": "Understanding salesperson intention to use AI feedback and its influence on business-to-business sales outcomes"}, {"paperId": "dd56d26b7efd78651f9abf530741da8de7ca1a69", "title": "Artificial intelligence in safety-critical systems: a systematic review"}, {"paperId": "01f26d300b97f9cfaf09b6b4f7782de12b193942", "title": "Building an Implementation Model of IoT and Big Data and Its Improvement"}, {"paperId": "ae331cff0abb87df833ddf5a2bc82c3e0ef3d56c", "title": "Dealing with impact of COVID-19 on transportation in a developing country: Insights and policy recommendations"}, {"paperId": "3a29177ba46fc0198fd20e1e1f727e067afd0dbb", "title": "From E-budgeting to smart budgeting: Exploring the potential of artificial intelligence in government decision-making for resource allocation"}, {"paperId": "363e72aab77a9914f1aca06a8263b8e397340c91", "title": "Emerging-market consumers' interactions with banking chatbots"}, {"paperId": "5cdee049f10f5b26eb2db312b8e2a29f37e02b9e", "title": "Independent evaluation of 12 artificial intelligence solutions for the detection of tuberculosis"}, {"paperId": "b146dc352fba42cb84dd89b8fb6bd616b8d0fd24", "title": "Artificial intelligence and HRM: identifying future research Agenda using systematic literature review and bibliometric analysis"}, {"paperId": "6a7f785efb1a96386286113c93f15cc2bb2ce8f8", "title": "The economics–engineering nexus: response to the commentaries"}, {"paperId": "5267f776002c4c409d7102694b4b1594b28951af", "title": "Use of 4.0 (I4.0) technology in HRM: a pathway toward SHRM 4.0 and HR performance"}, {"paperId": "439f2d20bcbb57b8de6193bd0751d40cac29042d", "title": "Facilitators and Barriers of Artificial Intelligence Adoption in Business – Insights from Opinions Using Big Data Analytics"}, {"paperId": "c9d762074122364b251125b30f2dec15d83e9cca", "title": "The Giant Leap for Smart Cities: Scaling Up Smart City Artificial Intelligence of Things (AIoT) Initiatives"}, {"paperId": "fbbdc047289e23bc140b20adaf77626302645c04", "title": "Exploring Explainable AI in the Financial Sector: Perspectives of Banks and Supervisory Authorities"}, {"paperId": "733b5620c01b132a600bec730c3732369b0930c8", "title": "Artificial intelligence in research and development for sustainability: the centrality of explicability and research data management"}, {"paperId": "5435360d6182cf19e561fde88310f44b9af8b5f9", "title": "Continual usage intention of platform-based governance services: A study from an emerging economy"}, {"paperId": "01e8e7a987ee33e77a7d7f10042eb88bdff50f99", "title": "Empirical Investigation of Participation on Crowdsourcing Platforms: A Gamified Approach"}, {"paperId": "c888e9bb4e91efc69348a138790c6d114922788c", "title": "Addressing Algorithmic Bias in AI-Driven Customer Management"}, {"paperId": "962a09ee320f25e8db172d92abfad3cfe0edf9c0", "title": "Preserving the legacy – Why do professional soccer clubs (not) adopt innovative process technologies? A grounded theory study"}, {"paperId": "8cc10be7abe2ad49c593d5ea236375c6da5669b9", "title": "Understanding the barriers of port logistics for effective operation in the Industry 4.0 era: Data-driven decision making"}, {"paperId": "2af56cec3f2754e4f73d71c4f45f91d064a415d1", "title": "Clustered Problems and Machine Learning Methodologies: A New Approach"}, {"paperId": "bc045ee82f9426408eaa0ea11e4469f36dea29ec", "title": "Uplift modeling and its implications for B2B customer churn prediction: A segmentation-based modeling approach"}, {"paperId": "68a2f73dc372389f686961a1a2ed15d6fde50c02", "title": "Supply chain digitalization: An integrated MCDM approach for inter-organizational information systems selection in an electronic supply chain"}, {"paperId": "db57adde1f2530a261e50abebdcee44ccbba46bc", "title": "Examining the effects of enterprise social media on operational and social performance during environmental disruption"}, {"paperId": "b98f4c4cb3d3c6c8ae564f71a1e4864f7b823f47", "title": "Role of smart tourism technology in heritage tourism development"}, {"paperId": "5ec907e7fbc8a9b7f9a4475bfcd14d1bae6edf25", "title": "Artificial Intelligence Methodologies for Data Management"}, {"paperId": "222fe9e1e3e0b083991cafa4b2e0bbdcbcee2fca", "title": "The Socio-Economic Efficiency of Digital Government Transformation"}, {"paperId": "4091c28a7f946f21425d4e9a6d35a608b29a6491", "title": "Enablers and Inhibitors of AI-Powered Voice Assistants: A Dual-Factor Approach by Integrating the Status Quo Bias and Technology Acceptance Model"}, {"paperId": "5b02a8112c21f7aa62ddd6947803dcc4f981e799", "title": "Guest editorialEmerging technologies in emergency situations"}, {"paperId": "a03445d0f08212ebe2c112a774c423a0378c1048", "title": "Factoring ethics in management algorithms for municipal information-analytical systems"}, {"paperId": "9c0cb7f702a2dab5ef6ea7a3d2d387634233972b", "title": "Is It Possible for Young Students to Learn the AI-STEAM Application with Experiential Learning?"}, {"paperId": "1e64f99ec1a700719f9f694c634887eede282241", "title": "The spread of Artificial Intelligence in the public sector: a worldwide overview"}, {"paperId": "c4417419f7a9cbcae64cb11828ac0204834325a3", "title": "The rise of artificial intelligence – understanding the AI identity threat at the workplace"}, {"paperId": "9af5ab490ed42998dc006fdc86121a013eb9e6b2", "title": "In the hearts and minds of employees: A model of pre-adoptive appraisal toward artificial intelligence in organizations"}, {"paperId": "8c05a2d8aa772b8db4605036925b39cfe2804483", "title": "The acceptance of chatbots in an enterprise context - A survey study"}, {"paperId": "f3be2c9ee5b4a17b635857530340cd2b3ed20ecc", "title": "Emotional reactions to robot colleagues in a role-playing experiment"}, {"paperId": "1a0623b77803f37c997beeaac5d77fd60936e833", "title": "Consumer engagement via interactive artificial intelligence and mixed reality"}, {"paperId": "b1c40bf87ee23898f61f2be2555a7b502352130b", "title": "For it is in giving that we receive: Investigating gamers' gifting behaviour in online games"}, {"paperId": "44c3e70587a116bdfd213dbf167a925ff17c4304", "title": "Managerial overreliance on AI-augmented decision-making processes: How the use of AI-based advisory systems shapes choice behavior in R&D investment decisions"}, {"paperId": "b621d53017d9fa6d1681ae09f655240feea7c66a", "title": "Value co-creation in industrial AI: The interactive role of B2B supplier, customer and technology provider"}, {"paperId": "022218cab1b3bc0009a5112aa57ff2abe595d8b8", "title": "Artificial intelligence as an enabler of B2B marketing: A dynamic capabilities micro-foundations approach"}, {"paperId": "e149d5a58a05b7cf95a47fd13fe9967602af35ff", "title": "Applied Artificial Intelligence and user satisfaction: Smartwatch usage for healthcare in Bangladesh during COVID-19"}, {"paperId": "8c87d9590c8faa1a8ccbdb6052cfa0a621a32e8e", "title": "SMEs and artificial intelligence (AI): Antecedents and consequences of AI-based B2B practices"}, {"paperId": "c69d1bf4ba776d8b1ea913b4cbbb793b9e692a56", "title": "What impacts customer experience for B2B enterprises on using AI-enabled chatbots? Insights from Big data analytics"}, {"paperId": "3b7d3abd22be1f5a184b863ba618a30a8c20bda6", "title": "Setting B2B digital marketing in artificial intelligence-based CRMs: A review and directions for future research"}, {"paperId": "31e7099ba50ce27d2f0a0cf6a9b864b4ec6a5cc3", "title": "Theorizing artificial intelligence acceptance and digital entrepreneurship model"}, {"paperId": "800c45b3b45927f467cb15ae7b850ac5a2eaf5bd", "title": "Relationships between the \"Big Five\" personality types and consumer attitudes in Indian students toward augmented reality advertising"}, {"paperId": "8631dbf9354656f4fcf1efe4373e7dd9ccfa5a70", "title": "Implementing challenges of artificial intelligence: Evidence from public manufacturing sector of an emerging economy"}, {"paperId": "39b8ea63572c01d9d7fbec6b88cee892f28dc26a", "title": "Too Bureaucratic to Flexibly Learn About AI? The Human-Centered Development of a MOOC on Artificial Intelligence in and for Public Administration"}, {"paperId": "77dd1eb0e460bbb58d8782fd7e98c5e7be484bcb", "title": "A Text Analytics Framework for Performance Assessment and Weakness Detection From Online Reviews"}, {"paperId": "3f3de48cf2fc17041295c6036a23222cbefc17cd", "title": "Understanding AI adoption in manufacturing and production firms using an integrated TAM-TOE model"}, {"paperId": "ea8e180643bd70f49a83e73b3077020652a0faaa", "title": "Study on artificial intelligence: The state of the art and future prospects"}, {"paperId": "016fe865bb998debba5f1d1a98b1243dbf1b92b7", "title": "Fifteen shadows of socio-cultural AI: A systematic review and future perspectives"}, {"paperId": "077983b9a702b8a684491ead39807935dfe9e5a9", "title": "From external provision to technological outsourcing: lessons for public sector automation from the outsourcing literature"}, {"paperId": "04f89ad2478b71e32f58186542555a9983ab7a10", "title": "Analysis Of The Variables Of Intention Of The Adoption And Acceptance Of Artificial Intelligence And Big Data Tools Among Leaders Of Organizations In Morocco: Attempt Of A Theoretical Study"}, {"paperId": "e2a01f5318b1313778726c2417b44816515ce64f", "title": "Applications of artificial intelligence and machine learning within supply chains:systematic review and future research directions"}, {"paperId": "7cc34ce9b88341067f1895202ee3cb471ae5a4cf", "title": "The dark sides of AI personal assistant: effects of service failure on user continuance intention"}, {"paperId": "286a3bf8579deadd9b892bb800614b7c35d5d9a6", "title": "Artificial Intelligence and Business Value: a Literature Review"}, {"paperId": "03a504443da77db1086afc2ace73f23f247d7c42", "title": "AI-enabled digital identity – inputs for stakeholders and policymakers"}, {"paperId": "c7b17c64c406751f5437f807dfd71ba4e99111f3", "title": "Role of artificial intelligence and robotics to foster the touchless travel during a pandemic: a review and research agenda"}, {"paperId": "50b03c76c31c015b28d85594788fc939f68eeada", "title": "Engaging with Artificial Intelligence (AI) with a Bottom-Up Approach for the Purpose of Sustainability: Victorian Farmers Market Association, Melbourne Australia"}, {"paperId": "df4381c96c8bae892579f701e67c9d7ef317f82e", "title": "Artificial Intelligence in the Public Sector - a Research Agenda"}, {"paperId": "a6530550d758ba8b82dd356045c0af22b88b3f60", "title": "Prerequisites for the adoption of AI technologies in manufacturing – Evidence from a worldwide sample of manufacturing companies"}, {"paperId": "99f7885e8f64fba6e9f688dd8a96117f014e22be", "title": "Assessing Organizational Users’ Intentions and Behavior to AI Integrated CRM Systems: a Meta-UTAUT Approach"}, {"paperId": "fbc1c979493f5d97e787efdf9c5a93b32035109b", "title": "Artificial intelligence in business-to-business marketing: a bibliometric analysis of current research status, development and future directions"}, {"paperId": "a45d5bd5b326f21148a6471ae24916b09fbb7d6e", "title": "Supply chain resilience in mindful humanitarian aid organizations: the role of big data analytics"}, {"paperId": "5acbc5b1a1447d61ca5fece1b2ca653796306397", "title": "Emerging technologies in emergency situations (Guest editorial)"}, {"paperId": "403bd4c39f3209cf7a71e93bd53f784c63aa2770", "title": "Green Artificial Intelligence: Towards an Efficient, Sustainable and Equitable Technology for Smart Cities and Futures"}, {"paperId": "3e93d20085f8f2c3f90e9c8a91f1d5889b5fae61", "title": "Psychological determinants of users' adoption and word-of-mouth recommendations of smart voice assistants"}, {"paperId": "d96907bd620d3c04be6b978b6c39a048429857bb", "title": "Artificial intelligence-based public healthcare systems: G2G knowledge-based exchange to enhance the decision-making process"}, {"paperId": "2019c1d67a4e1587236e14448fe0ff11e02b51dc", "title": "Understanding managers’ attitudes and behavioral intentions towards using artificial intelligence for organizational decision-making"}, {"paperId": "f230594e531607685e99e0653f824cb6c8e189d8", "title": "The influence of financial features and country characteristics on B2B ICOs' website traffic"}, {"paperId": "94622051f923b9a15beb0e114d80ef56f8adb7d4", "title": "Assimilation of business intelligence: The effect of external pressures and top leaders commitment during pandemic crisis"}, {"paperId": "da36da0f9fb3ff6aa3ffe553af72d55bdd3aa4cb", "title": "AI applications of data sharing in agriculture 4.0: A framework for role-based data access control"}, {"paperId": "739ca20a2620a441a3a17004e41f6cebe6314fca", "title": "Organizing workers and machine learning tools for a less oppressive workplace"}, {"paperId": "abd959e3fb771ce1a7c0eeaaddd35c0504925ba2", "title": "Is this company a lead customer? Estimating stages of B2B buying journey"}, {"paperId": "40b8804d8a7ef98eb48c4b43063bd606f0a77720", "title": "The effect of AI-based CRM on organization performance and competitive advantage: An empirical analysis in the B2B context"}, {"paperId": "ea91741be094e01e7d749fecdd062da48a875c20", "title": "How to Build an AI Climate-Driven Service Analytics Capability for Innovation and Performance in Industrial Markets?"}, {"paperId": "2aaaaab4a2297ed4970c373212b5007c810f0079", "title": "Interpretable data science for decision making"}, {"paperId": "7700c502ef3e72bc6a5f19eb5512324670d3927c", "title": "Analysis of Medical Tourism and the Effect of Using Digital Tools to Profile Travelers in Mexico"}, {"paperId": "82e4cfd74d8d390bbb63625d724ffc6eb752bed4", "title": "Artificial intelligence for supply chain resilience: learning from Covid-19"}, {"paperId": "8c91337a119f83bac187910469d11b7fddd56eaa", "title": "Examining the needs to adopt big data analytics in B2B organizations: development of propositions and model of needs"}, {"paperId": "1143137b0176dce5aa6709efa3c9cb104cd0ae6c", "title": "Artificial Intelligence in Government: Taking Stock and Moving Forward"}, {"paperId": "c2c5c99f28b5e854746479b06b4d5a0ae52adcf0", "title": "Implementation Frameworks for Artificial Intelligence Translation Into Health Care Practice: Scoping Review"}, {"paperId": "3c018188a9c9b95207f688cde511109290d7437e", "title": "Machine Learning Applied to Banking Supervision a Literature Review"}, {"paperId": "d9f4ac9ac016a0413c4255abf3cfe9834d4f5ef2", "title": "Implementation frameworks for AI translation into healthcare practice: A Scoping Review (Preprint)"}, {"paperId": "3c6291310db4a0fab887af059ebc995fbe68947b", "title": "Human-AI collaboration in route planning: An empirical efficiency-based analysis in retail logistics"}, {"paperId": "9d59c20065733ad9b3a416ba124aee0394dfb8e5", "title": "Understanding the influential and mediating role of cultural enablers of AI integration to supply chain"}, {"paperId": "e83c08632a3346402fb39524095af60f5bad2aaa", "title": "Managing the tension between opposing effects of explainability of artificial intelligence: A contingency theory"}, {"paperId": "45733384ae1c4270078fb5a88dfe6dc33228dc8e", "title": "Financial services experience and consumption in Nigeria"}, {"paperId": "41a906a1c502de7b895509dc24ca695a8f62aa91", "title": "Exploring the role of artificial intelligence in managing agricultural supply chain risk to counter the impacts of the COVID-19 pandemic"}, {"paperId": "5c12890f993ab0574d90afa2ab018b4472e0db1c", "title": "An attention-based view of AI assimilation in public sector organizations: The case of Saudi Arabia"}, {"paperId": "0a3251fcfb33c7e309ace5ac8315e392515da645", "title": "AI-enabled recruiting in the war for talent"}, {"paperId": "542a60a2f3b252096f6132021a3dc182bd4537b1", "title": "Examining the determinants of successful adoption of data analytics in human resource management – A framework for implications"}, {"paperId": "c81ba0ca7553f1e1c80437ebd8b34dd6ee55adf7", "title": "Using Artificial Intelligence for High-Volume Identification of Silicosis and Tuberculosis: A Bio-Ethics Approach"}, {"paperId": "875f884847f5e9f44506b2f8378ef96703c5cb7f", "title": "Information Management Challenges in Autonomous Vehicles: A Systematic Literature Review"}, {"paperId": "f769a997311f29c1e74951d71ac9c3c77c465253", "title": "The Value of Data-Driven and Human-Centered Approaches in Legal Technology Startups"}, {"paperId": "53a80ebb24e058ff3df2e35511af1ddcaaa4a40e", "title": "A structured literature review on the interplay between emerging technologies and COVID-19 – insights and directions to operations fields"}, {"paperId": "fd2a868e52a0ad694a29b463dc3b72c4dc82803b", "title": "Design and Application of Detection Damage Hardware to Your Computer with Certainty Factor"}, {"paperId": "e4b8ddcaf9d82d1743baf73707b603b600409a65", "title": "Usage of Artificial Intelligence and Remote Sensing as Efficient Devices to Increase Agricultural System Yields"}, {"paperId": "d6046d544c05907a8b2e5bf57d99e6ed0dbeb6cb", "title": "Are artificial intelligence and machine learning suitable to tackle the COVID-19 impacts? An agriculture supply chain perspective"}, {"paperId": "d4334854671f88aea299b3096b82c461c50d35ed", "title": "AI and Its Implications for Organisations"}, {"paperId": "9254fb25db671054b70c95a79bb57130bb0aee7e", "title": "Digital Government and the United Nations’ Sustainable Development Goals: Towards an analytical framework"}, {"paperId": "432797f689029e81fdcd1e24b30226d8772e4bad", "title": "An Artificial Intelligence Definition and Classification Framework for Public Sector Applications"}, {"paperId": "1e293f3f8d59a1d25123c929ffe0b824eb82d336", "title": "Smart financial policy adjustment system based on multiple game theory and artificial intelligence"}, {"paperId": "b0cca9d5a966560fa87c1d3e5e120d36a9693efc", "title": "Enabling AI capabilities in government agencies: A study of determinants for European municipalities"}, {"paperId": "20b015da1719efbba7c2c20958591eb277b7973a", "title": "Exploring the role of personality, trust, and privacy in customer experience performance during voice shopping: Evidence from SEM and fuzzy set qualitative comparative analysis"}, {"paperId": "489bb885cb1bda72069c642563caad9f7b842bc5", "title": "The Critical Factors Affecting the Deployment and Scaling of Healthcare AI: Viewpoint from an Experienced Medical Center"}, {"paperId": "01f45cd0a0132b45bdc3bc8b0367bbd45ac5062a", "title": "What is it about humanity that we can't give away to intelligent machines? A European perspective"}, {"paperId": "abf49c96f33b9d99c9f455374717391d1dab0908", "title": "How can artificial intelligence enhance car manufacturing? A Delphi study-based identification and assessment of general use cases"}, {"paperId": "75d4e805b6d8da6ef15985205b11217cb7bf2e0a", "title": "Smart Fishery: A Systematic Review and Research Agenda for Sustainable Fisheries in the Age of AI"}, {"paperId": "16085f5aff3c1b9ae06886dadbdba9f2119b93a2", "title": "The Potential of AI in Health Higher Education to Increase the Students’ Learning Outcomes"}, {"paperId": "ae1b7a6d82383a97a9f9a6dd8505b78992c6ed61", "title": "Facilitating artificial intelligence powered supply chain analytics through alliance management during the pandemic crises in the B2B context"}, {"paperId": "0834ac006c4b1f09768715cacfa19b9a3dd35ac1", "title": "The Policy and Regulatory Engagement with Corruption: Insights from Complexity Theory"}, {"paperId": "ddc201acb9aa7ecff91f484352d90eea29805c36", "title": "Responsible Artificial Intelligence as a Secret Ingredient for Digital Health: Bibliometric Analysis, Insights, and Research Directions"}, {"paperId": "7db269ad0b893f01aa26f7f795940dd21a81898f", "title": "Symbiosis with artificial intelligence via the prism of law, robots, and society"}, {"paperId": "5c70a3c199a38d9da05d6f3616171fe404bc28fa", "title": "Combating COVID-19: Study of robotic solutions for COVID-19"}, {"paperId": "e99f0b88d742214373cdc58c3824fb3467a0fc73", "title": "How machine learning is impacting research in atrial fibrillation: implications for risk prediction and future management"}, {"paperId": "c9721cf59e99ca758042b83d255d2d7b1b9a6f40", "title": "What explains governments interest in artificial intelligence? A signaling theory approach"}, {"paperId": "2226c894be117d285aefbc268cd4fb9b139308f0", "title": "Locating artificial intelligence: a research agenda"}, {"paperId": "0db4b0b714546bb6f472a831c9a718f2dd413a00", "title": "Application of Artificial Neural Network for Internal Combustion Engines: A State of the Art Review"}, {"paperId": "a06a10f9f5d82dc805f09999b935e4bbf609da8e", "title": "New dilemmas, old problems: advances in data analysis and its geoethical implications in groundwater management"}, {"paperId": "243ce74604150c6d84627f1b5d4af173751e4da7", "title": "Swarm intelligence goal-oriented approach to data-driven innovation in customer churn management"}, {"paperId": "4715fbe80f937776fcc84bcb052e770451dda46d", "title": "Do\n FinTech\n and financial incumbents have different experiences and perspectives on the adoption of artificial intelligence?"}, {"paperId": "3ba81e8aca0eb7f361de294a83e18ea0c7c016d0", "title": "Artificial intelligence techniques in finance and financial markets: A survey of the literature"}, {"paperId": "8eaeda4885475764277a056c37e034be2e46ccd2", "title": "Responsible Artificial Intelligence (AI) for Value Formation and Market Performance in Healthcare: the Mediating Role of Patient’s Cognitive Engagement"}, {"paperId": "ec6d37efe580e4a13ddb620a0fcb0f079cecae08", "title": "Inteligencia artificial (IA) aplicada a la gestión pública"}, {"paperId": "210ba8362132473165fb3fb91be1f7cd716064b9", "title": "The role of brand in overcoming consumer resistance to autonomous vehicles"}, {"paperId": "b2feeefe2ddf2255cc02900352deb01a8dcb3fc2", "title": "The International Impact of COVID-19 and “Emergency Remote Teaching” on Computer Science Education Practitioners"}, {"paperId": "10606b9ec6453c453d805be249a9efb0e380ed5a", "title": "Industry experiences of artificial intelligence (AI): benefits and challenges in operations and supply chain management"}, {"paperId": "bb41bef0d06957efd25f5bf0ef74ab9e4c0daaa1", "title": "Conversational commerce: entering the next stage of AI-powered digital assistants"}, {"paperId": "9ea8330aa37487980b15977f239e8abb0bc9b6f1", "title": "Implementation barriers of smart technology in Indian sustainable warehouse by using a Delphi-ISM-ANP approach"}, {"paperId": "6353939e1d73f0f2f99337f381b6a71582ba707e", "title": "Recasting Service Quality for AI-Based Service"}, {"paperId": "0a00163cc9538adab15138f6a50fff0f04d8b6c9", "title": "Information and communication technologies (ICT)-enabled severe moral communities and how the (Covid19) pandemic might bring new ones"}, {"paperId": "a88f62ec6fe965fd888b46b1c54c411dbd385774", "title": "Augmented reality is eating the real-world! The substitution of physical products by holograms"}, {"paperId": "df56d36a9a67be188c539dfcb3149e36954acbfb", "title": "Artificial intelligence in E-commerce fulfillment: A case study of resource orchestration at Alibaba's Smart Warehouse"}, {"paperId": "891b13be32be4783e8c80df9de0f3aac5023ef65", "title": "Let's play: Me and my AI‐powered avatar as one team"}, {"paperId": "01795e6fa4d6bdf8a7e4bb39ef2f490c56f38039", "title": "i-Pulse: A NLP based novel approach for employee engagement in logistics organization"}, {"paperId": "52f5e26c33db6eb0b89482d9dfd5e6b91d0881d7", "title": "Guest Editorial: A special section on digital marketing"}, {"paperId": "8d9f4b3f299b8f93e2b73dfd25f6d7420471c83f", "title": "Artificial intelligence capability: Conceptualization, measurement calibration, and empirical study on its impact on organizational creativity and firm performance"}, {"paperId": "d2fb2a3171a74ca3118e7c556f08b2e1e72cd9aa", "title": "Editors' reflections and introduction to the special section on 'Artificial Intelligence and Business Value'"}, {"paperId": "25b5a8eaa34abfeb737a63bc27388ca66e1a4a71", "title": "Artificial intelligence in operations management and supply chain management: an exploratory case study"}, {"paperId": "79a82d386320ea056d74fc04d73d1fe32ccd1521", "title": "Artificial intelligent for speech reproduction of information and knowledge of ancient books"}, {"paperId": "eded2af930f157ac72d3c8579ca7d1f18da0bd11", "title": "Implications of the use of artificial intelligence in public governance: A systematic literature review and a research agenda"}, {"paperId": "b59eee404e607a05f8eaafcb54f669adfbc3e1ae", "title": "Artificial Canaries: Early Warning Signs for Anticipatory and Democratic Governance of AI"}, {"paperId": "038796934e730881607f351d4883b32d7bfa9a11", "title": "Marketing bank services to financially vulnerable customers: evidence from an emerging economy"}, {"paperId": "246d804bfedc24e91f1ace6cf165eb392800b3c0", "title": "Automation-driven innovation management? Toward Innovation-Automation-Strategy cycle"}, {"paperId": "f07616fd213825c98b2b18b394b29b58c7002551", "title": "A Systematic Review on Social Sustainability of Artificial Intelligence in Product Design"}, {"paperId": "958dd3c288d7bec65260299cc556a2bc74bea5f4", "title": "Delivering Artificial Intelligence for Electronic Traffic Law Enforcement in Yogyakarta Region: Current Effort and Future Challenges"}, {"paperId": "f86037fcd4d24d53f22f02320e51cf41d52061df", "title": "Prediction of ground vibration intensity in mine blasting using the novel hybrid MARS–PSO–MLP model"}, {"paperId": "749424f0901223c66d831ba1fcd18025874c387b", "title": "The Ouroboros Model, Proposal for Self-Organizing General Cognition Substantiated"}, {"paperId": "dcfe4ec8b9f9f0028692cfa77b102113ac7f6a38", "title": "Artificial intelligence and food security: swarm intelligence of AgriTech drones for smart AgriFood operations"}, {"paperId": "046e4985e08ac3b69844a51b75d75476c8f181f8", "title": "Role of cognitive absorption in building user trust and experience"}, {"paperId": "6d6e49f1019f1c6c4180f2da498ada514e60f767", "title": "Responsible Urban Innovation with Local Government Artificial Intelligence (AI): A Conceptual Framework and Research Agenda"}, {"paperId": "c9fd022420f55c191b5abdb260c555e99a5ef148", "title": "Artificial Intelligence Autonomous Unmanned Aerial Vehicle (UAV) System for Remote Sensing in Security Surveillance"}, {"paperId": "780e8d65f59b09687b65afb82b17d7540364f408", "title": "Recruit, Retain and Report: UK Universities’ Strategic Communication with Stakeholders on Twitter"}, {"paperId": "273eae1943a9443b0d2f2a8193d31b1fb67da045", "title": "Adoption of AI-empowered industrial robots in auto component manufacturing companies"}, {"paperId": "9aa8f81318365db6783d55e515cf00177abd519b", "title": "Artificial Intelligence in Africa: Challenges and Opportunities"}, {"paperId": "9fe19a533cc25c149113bbb808f21bd193527235", "title": "Enhancing Transportation Service Experience in Developing Countries: A Post Pandemic Perspective"}, {"paperId": "2fc88e6158aa50d213bbc0b8dcd2266dea562808", "title": "Decision augmentation and automation with artificial intelligence: Threat or opportunity for managers?"}, {"paperId": "ce399b2c188ffb3e8c110f2870d2be37e40fee85", "title": "Social Media Adoption, Usage And Impact In Business-To-Business (B2B) Context: A State-Of-The-Art Literature Review"}, {"paperId": "04dfdf49d2e3cfce31b3544b8fe45c1d9533a82b", "title": "Disaster City Digital Twin: A vision for integrating artificial and human intelligence for disaster management"}, {"paperId": "0da16fcc25a4072e181978284964b10515347368", "title": "A novel architecture to identify locations for Real Estate Investment"}, {"paperId": "c802dc4b1455f79bc82d3796fb3280e8caa23f8f", "title": "Big Data Analytics in Building the Competitive Intelligence of Organizations"}, {"paperId": "3548b6ac3f044cc226681ab98df0253fddda7367", "title": "Can AI artifacts influence human cognition? The effects of artificial autonomy in intelligent personal assistants"}, {"paperId": "603318f1c8035e3639430a8566daab43d29d69b5", "title": "Bridging marketing theory and big data analytics: The taxonomy of marketing attribution"}, {"paperId": "6f5188afb5c156b957583bbc78867f0a8ad09abe", "title": "Artificial intelligence (AI) applied to public management"}, {"paperId": "f4b29d2042405811306f5c1c15b57622f765444e", "title": "The role and challenges of education for responsible AI"}, {"paperId": "8a15af3df4788033e2f820db3fa0048d9ab652b2", "title": "Limits of artificial intelligence in controlling and the ways forward: a call for future accounting research"}, {"paperId": "9d15d588980cf7e3bd1135675d25e5a7893055a2", "title": "The Medical Authority of AI: A Study of AI-enabled Consumer-Facing Health Technology"}, {"paperId": "1f11e05c5484ff5a066eab37c6268ad7aceaac8d", "title": "A Review of Trust in Artificial Intelligence: Challenges, Vulnerabilities and Future Directions"}, {"paperId": "12249190c36f018d9982997bba275587e1965446", "title": "AI-Enabled Sensing and Decision-Making for IoT Systems"}, {"paperId": "ecbdfbd637b8c2db2d6b0811557e6144bac642b9", "title": "An integrated artificial intelligence framework for knowledge creation and B2B marketing rational decision making for improving firm performance"}, {"paperId": "6ee9d427f49dc078603329613bede63bd0bafb08", "title": "Implementation of Various Artificial Intelligence Approach for Prediction and Recommendation of Personality Disorder Patient"}, {"paperId": "1750f359ff102c6f78fb024f0d3bccb11ebefd69", "title": "Exploratory research on digitalization transformation practices within supply chain management context in developing countries specifically Egypt in the MENA region"}, {"paperId": "9fde0e6920193cb46a5919644d1a7c963b65e4a8", "title": "The Moral and Legal Status of Artificial Intelligence (Present Dilemmas and Future Challenges)"}, {"paperId": "7906c8e185fa40e68d926ae2ad91154987a4f446", "title": "Entrepreneurial Performance and Export Marketing Capabilities on Pistachio Export Performance with the Moderating Role of Inefficient Competition"}, {"paperId": "30242cdd09fe39a4d8ddb2510084b29bc3bd3c08", "title": "Artificial Intelligence Reshaping Human Resource Management : A Review"}, {"paperId": "966ec0bfc7eeaff1d5c2af7446f50128ccbad1c6", "title": "Understanding the Determinants in the Different Government AI Adoption Stages: Evidence of Local Government Chatbots in China"}, {"paperId": "fa8ffdfa980b2620372e10d9120cc66a06ff2bf9", "title": "Artificial intelligence in radiology: relevance of collaborative work between radiologists and engineers for building a multidisciplinary team."}, {"paperId": "81ebd9487924d84f57a848a74815f12ef4af84c5", "title": "Overcoming the Challenges of Collaboratively Adopting Artificial Intelligence in the Public Sector"}, {"paperId": "3cff2ee480604702588697600257562becbded6e", "title": "Exploratory Insights on Artificial Intelligence for Government in Europe"}, {"paperId": "ae67ab13243fea00c5cbe57ec13d3dfeac54dc48", "title": "Critical Thinking an Antidote to Artificial Intelligence Threat: An Innovation in Teacher Education Practices"}, {"paperId": "92255cb027e191d26680a16e7dc34f90ab5f5d82", "title": "Robotics at workplace: An integrated Twitter analytics - SEM based approach for behavioral intention to accept"}, {"paperId": "53ce8af2baf2d870dd81af89e0735dde508c95d7", "title": "The Limitations of Decision-Making"}, {"paperId": "2c9689292e5297d8b70385a2df01a81fec3e6511", "title": "Features of Human-Centred Algorithm Design"}, {"paperId": "362a199537a341183b0c75d3beda5f03a0d1059b", "title": "Can we detect trends in natural disaster management with artificial intelligence? A review of modeling practices"}, {"paperId": "416893cf0fb5118181536b9124302507fdbd0607", "title": "Are we preparing for a good AI society? A bibliometric review and research agenda"}, {"paperId": "821c71351d7af3bebc310c02035d6beeff9f717c", "title": "A CBR-based decision-making model for supporting the intelligent energy-efficient design of the exterior envelope of public and commercial buildings"}, {"paperId": "47d27bf80263d965dbee97f8f1d15ccc7845e44c", "title": "Patients’ Perceptions Toward Human–Artificial Intelligence Interaction in Health Care: Experimental Study"}, {"paperId": "d40332e7dd91108a9a370007b7e642644e5b681c", "title": "Psychological Determinants of Consumer’s Usage, Satisfaction, and Word-of-Mouth Recommendations Toward Smart Voice Assistants"}, {"paperId": "168db1add3e74f3c6f33a890c3ad8f394346d5e5", "title": "HARDenseNet: A 1D DenseNet Inspired Convolutional Neural Network for Human Activity Recognition with Inertial Sensors"}, {"paperId": "bbf85d8b0961ea28e363e2843565a1c9c20ca9ff", "title": "AI development and application of AI-based solutions in the area of information and data management in Poland"}, {"paperId": "d738d5d9554d38d54645f1d3d4168694ff2c6762", "title": "Role of institutional pressures and resources in the adoption of big data analytics powered artificial intelligence, sustainable manufacturing practices and circular economy capabilities"}, {"paperId": "8df615f3870e0bae5d5ec42c4ccd8731b56577ef", "title": "Shopping intention at AI-powered automated retail stores (AIPARS)"}, {"paperId": "1f564b75c84f86eabd8bb7d05b4727886a4a5498", "title": "Propagating AI Knowledge Across University Disciplines- The Design of A Multidisciplinary AI Study Module"}, {"paperId": "19ceb16a221adcbcf9e46b153ba6430213cf4f8d", "title": "The Dark Side of Artificial Intelligence in Retail Innovation"}, {"paperId": "f82ec26ea330fbe6d320174db4acce821cdb9b29", "title": "Digital Transformation in Financial Services Provision: A Nigerian Perspective to the Adoption of Chatbot"}, {"paperId": "21b413bbc7fac83c8c75a94125a0c8642e154d3b", "title": "The Sustainability of Artificial Intelligence: An Urbanistic Viewpoint from the Lens of Smart and Sustainable Cities"}, {"paperId": "d94c30e4b0b7e13739631722f5785ce6144f0be2", "title": "Dilemmas of Artificial Intelligence Development – Sociological Considerations Around Industry 4.0 and Sustainability"}, {"paperId": "a8e461de484d3e32983c3e9139827fc89759d456", "title": "Privacy concerns and disclosure of biometric and behavioral data for travel"}, {"paperId": "9606551fe89347475edbf83e290ce4b034008d36", "title": "Towards adoption of Green IS: A literature review using classification methodology"}, {"paperId": "3a64e4d7c29e29954b8b023b36fb943558ed0169", "title": "Theory building with big data-driven research - Moving away from the \"What\" towards the \"Why\""}, {"paperId": "57cc632754fabaecec1b4188ef8db32b795bb5ec", "title": "Assessing the public policy-cycle framework in the age of artificial intelligence: From agenda-setting to policy evaluation"}, {"paperId": "10ae9107cf51adb5d5cc9284f3cf0f88c33a9d95", "title": "The learner-interface interaction´s future, a vision from EdTech"}, {"paperId": "11e78793276f65d4cb9b652bfd0350376d0ca096", "title": "Managing Artificial Intelligence Deployment in the Public Sector"}, {"paperId": "9a35bc7423caf027b6e2f4cba95768ca2978a8f0", "title": "Blockchain Technology for Sustainable Supply Chain Management: A Systematic Literature Review and a Classification Framework"}, {"paperId": "90bd756e22609e563056c12d06128d072cb99929", "title": "INTELIGÊNCIA ARTIFICIAL NO APOIO À TOMADA DE DECISÕES NO DIREITO TRIBUTÁRIO"}, {"paperId": "f9c2528a560e51feb7d979e842ceea5e9e74ac06", "title": "The strategic use of artificial intelligence in the digital era: Systematic literature review and future research directions"}, {"paperId": "5f51fb65f784a3b31697dcf62bb69e8cb916448f", "title": "Assessing the Japanese Turn in AI and Robot Ethics: Extracting Meaningful Principles Between Exoticism and Empiricism in the Case of AIBO"}, {"paperId": "007a55caac4c46e49fa6f8b09a944b8610f78a81", "title": "Customer experiences in the age of artificial intelligence"}, {"paperId": "83471f0636706087bec6d86ed81254c745b9ced2", "title": "Artificial intelligence tools and perspectives of university librarians: An overview"}, {"paperId": "f62510bd12d064a124b6969d829d58dca42860f7", "title": "Influence of artificial intelligence on technological innovation: Evidence from the panel data of china's manufacturing sectors"}, {"paperId": "cff25b4fd21c670c9e30dbf165a2023d627a20eb", "title": "Social media and sensemaking patterns in new product development: demystifying the customer sentiment"}, {"paperId": "01ae66c3641563cd07da67a6db522dcacdb6c5d0", "title": "Business Intelligence Capabilities and Firm Performance: A Study in China"}, {"paperId": "6021774f8fc59d289a8afb82a5047da315f4776c", "title": "The Impact of COVID-19 and “Emergency Remote Teaching” on the UK Computer Science Education Community"}, {"paperId": "b941e0d4ba87bcd2612b7063e9952db6a0c86520", "title": "Using Data Sciences in Digital Marketing: Framework, methods, and performance metrics"}, {"paperId": "e1108652f4351999e48ebc48a964bb3d1b0daa06", "title": "Deep Learning in Industrial Internet of Things: Potentials, Challenges, and Emerging Applications."}, {"paperId": "b241da5a4dada67bc36b19c24b8cb73d03f97172", "title": "Adoption of artificial intelligence (AI) for talent acquisition in IT/ITeS organizations"}, {"paperId": "4eede886a586fbc6194982dca4bde2804ae3134b", "title": "Critical success factors for integrating artificial intelligence and robotics"}, {"paperId": "c26c5fedb5ea8acf5778d2d26f23cb365b75b7b5", "title": "Internet of Things and Big Data as enablers for business digitalization strategies"}, {"paperId": "5f2db4535d2aca297a33ab1e999c212b36ed3bd6", "title": "Sentiment aggregation of targeted features by capturing their dependencies: Making sense from customer reviews"}, {"paperId": "3e333e592e245065ff0691b56a876cac88e3d1bc", "title": "Big data analytics and artificial intelligence pathway to operational performance under the effects of entrepreneurial orientation and environmental dynamism: A study of manufacturing organisations"}, {"paperId": "1d677a167b92b81eb5671b5461c37be4e22e9610", "title": "Artificial intelligence for sustainability: Challenges, opportunities, and a research agenda"}, {"paperId": "331ae4f7474fb117287bd553e8c9380584d64bf7", "title": "Impact of COVID-19 pandemic on information management research and practice: Transforming education, work and life"}, {"paperId": "23f62644c05b7f7c755bdd26ea8b57697a92f621", "title": "Cognitive Dissonance in Technology Adoption: A Study of Smart Home Users"}, {"paperId": "3157ccb0c9812a6ee22a6c5c4cebfae3be42b148", "title": "Use of AI-based tools for healthcare purposes: a survey study from consumers’ perspectives"}, {"paperId": "30c9cf2e752cc5988c3ace3336a29fab6b3bec96", "title": "Security, Privacy and Risks Within Smart Cities: Literature Review and Development of a Smart City Interaction Framework"}, {"paperId": "9a01a586e31937c71b063b0b021ecf461d354910", "title": "Current Challenges of Modern-Day Domestic Abuse"}, {"paperId": "4ed232310768ebc57e73bf7482dd8e22aa6e14b5", "title": "Will COVID-19 be the tipping point for the Intelligent Automation of work? A review of the debate and implications for research"}, {"paperId": "b7cdf59aaf1e92c00ec2719caf6a6d9a41a2cf33", "title": "Setting the future of digital and social media marketing research: Perspectives and research propositions"}, {"paperId": "e4a50325b5d4487e3246faa47191e18d10d28a4f", "title": "An approach for selecting and using a method of inter-coder reliability in information management research"}, {"paperId": "d8c7fb1f39565a4d0309c7ad44583699bd2bd4b1", "title": "From fighting COVID-19 pandemic to tackling sustainable development goals: An opportunity for responsible information systems research"}, {"paperId": "8b29433f05b4cd379250d19ef1d123f022df7790", "title": "Impacts of epidemic outbreaks on supply chains: mapping a research agenda amid the COVID-19 pandemic through a structured literature review"}, {"paperId": "31b8cfb3ff49dc33cd5560d39a91db12ec455312", "title": "Understanding artificial intelligence adoption in operations management: insights from the review of academic literature and social media discussions"}, {"paperId": "720c924e5c06caaf410fe131d82ce4d6f0dd236d", "title": "A data-driven approach to adaptive synchronization of demand and supply in omni-channel retail supply chains"}, {"paperId": "1eac5eae8b4fa378f4fc22bea6fa3a2d5bf70421", "title": "Towards Smarter Public Budgeting? Understanding the Potential of Artificial Intelligence Techniques to Support Decision Making in Government"}, {"paperId": "44382329a113976dab75f96e65d7b737e7c12f1c", "title": "Artificial Intelligence and Organizational Memory in Government: The Experience of Record Duplication in the Child Welfare Sector in Canada"}, {"paperId": "03a987020381951f20e847c53d9bf7fe253a1ab7", "title": "Impact of COVID-19 on transportation in Lagos, Nigeria"}, {"paperId": "e17c47f516efe29db812db95c93353068cdff528", "title": "On the training of a neural network for online path planning with offline path planning algorithms"}, {"paperId": "1d4f8750a788de74cdb14fe28a632525dcf71d3b", "title": "Is it just too good to be true? Unearthing the benefits of disruptive technology"}, {"paperId": "1c09fd80456a68cac0cb49823992d2fb24d04e03", "title": "Blockchain in the operations and supply chain management: Benefits, challenges and future research opportunities"}, {"paperId": "fefef67c8005605cadb43835e312182742ad7b91", "title": "Beyond user experience: What constitutes algorithmic experiences?"}, {"paperId": "6ec4bb504b40987b1d9443b751e458f1fb451812", "title": "An artificial intelligence approach to support knowledge management on the selection of creativity and innovation techniques"}, {"paperId": "6a688031988dd8e0dba83ebc52345c4ca9c54793", "title": "Multi-agent optimization of the intermodal terminal main parameters by using AnyLogic simulation platform: Case study on the Ningbo-Zhoushan Port"}, {"paperId": "c5e729fe94761a94bf3e8eb3c169414c048025dc", "title": "The implications of artificial intelligence on the digital marketing of financial services to vulnerable customers"}, {"paperId": "cb97417f09ce6b33e9238aaf72e82a26bf82a1c4", "title": "Systematic Literature Review to Investigate the Application of Open Source Intelligence (OSINT) with Artificial Intelligence"}, {"paperId": "03f9a26fe56f068914b24405bd69b5ad65a5d561", "title": "Programmatic creative: AI can think but it cannot feel"}, {"paperId": "b5e3f1356fb1b406b484d6a985f0d3af859a4cb4", "title": "Role of technological dimensions of green supply chain management practices on firm performance"}, {"paperId": "ab21519f5366909d450c44524ef74f4de8204eb4", "title": "The Search for Smartness in Working, Living and Organising: Beyond the ‘Technomagic’"}, {"paperId": "e46443268b40f6f56fe135a82b75ce2cc3c144b2", "title": "Deep strategic mediatization: Organizational leaders' knowledge and usage of social bots in an era of disinformation"}, {"paperId": "2ef0c28fd5d4d4f51fcc5d14324f2e34e12e187b", "title": "The impact of social media on consumer acculturation: Current challenges, opportunities, and an agenda for research and practice"}, {"paperId": "f50999c2404ff48f3b067a588e5437d5720aa0a5", "title": "Financial Vulnerability During a Pandemic: Insights for Coronavirus Disease (COVID-19)"}, {"paperId": "1489c9b34af3fddc3bb2995a9e3aaf88104504fc", "title": "Consumers’ Financial Vulnerability When Accessing Financial Services"}, {"paperId": "3b3c244ef269eda6542f7048b9c607b6ef442334", "title": "Technologies for Financial Inclusion in Nigeria"}, {"paperId": "2ab36304735c7d6503be247dc236175cdd1e0507", "title": "Socially Embodied AI: A Framework for Recognizing the Dynamic Sociality of Artificial Agents Within and Beyond Healthcare (Preprint)"}, {"paperId": "bcd6c8b8cea4e5bc8589558efbc03f2a6d5e99ed", "title": "Examining consumer behaviour in the UK Energy sector through the sentimental and thematic analysis of tweets"}, {"paperId": "c97f7d8cc3f8473779c9d65173cc1d4baa79344a", "title": "Role of artificial intelligence in operations environment: a review and bibliometric analysis"}, {"paperId": "4a638bbe20e8af4becb91db93dae9bf78ea849ed", "title": "Evidence-based explanation to promote fairness in AI systems"}, {"paperId": "22327fd91e1292541421dcb84bcd430805bf93c4", "title": "Do ML Experts Discuss Explainability for AI Systems?"}, {"paperId": "74d0773f66a6bd7ba7917ec8e6a904b28d85d59a", "title": "Human Missions Analysis for Intelligent Missions Improvement"}, {"paperId": "834cb35b38dd580032f35c2ba6b859c2f366db57", "title": "AI is multidisciplinary"}, {"paperId": "f86e3263900118e2414ef6de858b821184a86714", "title": "AI safety: state of the field through quantitative lens"}, {"paperId": "262150efd36b0299d4564a15b09603c7bfa70b64", "title": "Machine learning based system for managing energy efficiency of public sector as an approach towards smart cities"}, {"paperId": "422202cd5cdade71731a1b37aaa520283b459af1", "title": "Information Evolution and Organisations"}, {"paperId": "2eb7a950e497ed9b09268be298e6c090ec828fed", "title": "Autonomous vehicles in the smart city era: An empirical study of adoption factors important for millennials"}, {"paperId": "abcd7ec452219954b7f54e6e21936cfd82f6d222", "title": "Assessment of Investment Attractiveness in European Countries by Artificial Neural Networks: What Competences are Needed to Make a Decision on Collective Well-Being?"}, {"paperId": "b2c2a38dae95152506fa67721ef6f07bb0360d54", "title": "Achieving superior organizational performance via big data predictive analytics: A dynamic capability view"}, {"paperId": "c03b21517ecb0e740e45c9043533368972bd5bcf", "title": "Replication data for: Why Are There Still So Many Jobs? The History and Future of Workplace Automation"}, {"paperId": "c2b00aae028c884fa4e90e58e8f66e3305098198", "title": "Fuzzy Similarity Used by Micro-Enterprises in Marketing Communication for Sustainable Development"}, {"paperId": "0efb52409766d0b96c6eee7b99ada66a1df35a8e", "title": "The Institute of Coding: A University-Industry Collaboration to Address the UK’s Digital Skills Crisis"}, {"paperId": "a7acabdb0986ee48e8c4a6ebcf15e42107707e22", "title": "Linear Regression"}, {"paperId": "9d75cc322a4e06d0a3a868cb91b04219a289c12c", "title": "Machine Learning: An Applied Econometric Approach"}, {"paperId": "995a1b0186a74af82cdfa5335a6184cbdd93b2f7", "title": "Why Do SMEs Adopt Artificial Intelligence-Based Chatbots?"}, {"paperId": "d5428a7f875e2cdce670d3dc4b427a98351dff60", "title": "Managing artificial intelligence applications in healthcare: Promoting information processing among stakeholders"}, {"paperId": "09b099739d54bd47114612bc4b9cbf9d64dd9126", "title": "8–10% of algorithmic recommendations are ‘bad’, but… an exploratory risk-utility meta-analysis and its regulatory implications"}, {"paperId": "9225bad888f44dd09a835e8cb10e4870b6c28ae2", "title": "The role of AI integration and governance standards: Enhancing financial reporting quality in Islamic banking"}, {"paperId": "176b52f7d0f3f25c63d19c5f51660f38ec205b43", "title": "On the Integration of Artificial Intelligence and Blockchain Technology: A Perspective About Security"}, {"paperId": "4e7ebbbc190c46e7b0563a1622376554346681cc", "title": "Augmented Reality and AI in Smart Manufacturing: An Empirical Investigation"}, {"paperId": "16aee4224038a3665e98a77e60626c02aa80f398", "title": "AI-Powered Super-Workers: An Experiment in Workforce Productivity and Satisfaction"}, {"paperId": "bf381d7b931c457cdcc2f2a9311ab8e3278477f6", "title": "Algorithmic Product Positioning and Pricing: Can Artificial Intelligence Do Strategy?"}, {"paperId": "86e399c22632680882027aa3b8e0ca7d204f746d", "title": "An Improved Ensemble Method for Predicting Hyperchloremia in Adults With Diabetic Ketoacidosis"}, {"paperId": "2c7ea21193ceccb709698323a6c1108f25e4ac73", "title": "Teaching Tip Using No-Code AI to Teach Machine Learning in Higher Education"}, {"paperId": "eb44c09e9ca3e27f4a1119f25570a6575b7510f1", "title": "Analyzing the improvement of estate governance and management in Jordan using blockchain"}, {"paperId": "d34c15d2176fc6aa3315b982cc02ef4eb869ec3e", "title": "Metaverse healthcare supply chain: Conceptual framework and barrier identification"}, {"paperId": "a2f7d81b1ddb78a8dc9a53cd5f4881ab384572d8", "title": "Smart Legal: Proposing Artificial Intelligence Application to Provide Free Legal Aid in Indonesia"}, {"paperId": "8f321c1d90b447be6d74547b2cdcfeda3a67206d", "title": "The key role of innovation and organizational resilience in improving business performance: A mixed-methods approach"}, {"paperId": "1a5c409d07cccb0928de9988673482116b414048", "title": "Artificial intelligence implementation in manufacturing SMEs: A resource orchestration approach"}, {"paperId": "2238d84357416cce963f285e37aec9b53b727969", "title": "Embracing artificial intelligence (AI) with job crafting: Exploring trickle-down effect and employees’ outcomes"}, {"paperId": "bca8c306ab411e28e503560c87f240a3e7b612f7", "title": "Hi, May AI help you? An analysis of the barriers impeding the implementation and use of artificial intelligence-enabled virtual assistants in retail"}, {"paperId": "1c724b32b3cb57c905b7d24a316b787512f274c3", "title": "Is algorithm aversion WEIRD? A cross-country comparison of individual-differences and algorithm aversion"}, {"paperId": "d77dc01c46ebcf8174fa1062d90a18bf93f1b3cf", "title": "A review of supply chain 4IR management strategy for appraising the manufacturing industry's potentials and shortfalls in the 21st century"}, {"paperId": "7c32ae5eb777b13ded32d4e7c77ec20203147e0e", "title": "The Impact of Artificial Intelligence on Workers' Skills: Upskilling and Reskilling in Organisations"}, {"paperId": "0cb025a9e4d34703cb4c0adbe40d6fd7fbfde655", "title": "Evaluating collaborative rationality-based decisions: a literature review"}, {"paperId": "c8cb8ab859649364fb00e6ccbe3f19d535a3f804", "title": "A Privacy-Preserved and User Self-Governance Blockchain-Based Framework to Combat COVID-19 Depression in Social Media"}, {"paperId": "29dc50d4f4a5c48df7541fb5a85694b09c63e718", "title": "Machine autonomy for rehabilitation of elderly people: A trade-off between machine intelligence and consumer trust"}, {"paperId": "068530c6b3949e49fb0a572adc57ccb1a4ff7849", "title": "Paving the way for technological innovation through adoption of artificial intelligence in conservative industries"}, {"paperId": "2f7354ee032c30a678de04582e20683de2387d37", "title": "Using Skills Profiling to Enable Badges and Micro-Credentials to be Incorporated into Higher Education Courses"}, {"paperId": "87ec74d847b6c1170aa12855f916759a7dd2e98f", "title": "A Survey of Privacy Risks and Mitigation Strategies in the Artificial Intelligence Life Cycle"}, {"paperId": "e8a77b1a07dd96ab497df7fa5b3642fbcb8da867", "title": "The Effect of Level of AI Transparency on Human-AI Teaming Performance Including Trust in Machine Learning Interface by GeeBeum Park"}, {"paperId": "90972713559cb52bcc07cde506f4937a646d40ba", "title": "Application of explainable artificial intelligence in medical health: A systematic review of interpretability methods"}, {"paperId": "587a5e2ec1b13d63f8d2fd597ec0f00e2ab74096", "title": "Enhancing value in customer journey by considering the (ad)option of artificial intelligence tools"}, {"paperId": "d657e7226bd8e2818f0f604971597a06bc7cb4ae", "title": "Artificial Intelligence in Business Management"}, {"paperId": "a72d1c67ce84c0c400166b185ed698b2f5780e3e", "title": "Transmission Network Planning in Super Smart Grids: A Survey"}, {"paperId": "0463ee4ac028c704a01e8e8dd4cb662ce5642f0c", "title": "Structural equation modelling for IoT and big data implementation in business performance"}, {"paperId": "7066eb92c9386cfe42bef0f549bf113daa4ab58a", "title": "Who creates jobs with broad skillsets? The crucial role of firms"}, {"paperId": "e70855c2ee330316c5c4953387f1bd813af6bf3b", "title": "STUDENTS COGNITIVE DISCREPANCIES IN ARTIFICIAL INTELLIGENCES UTILI-ZATION: A CASE OF HIGHER LEARNING INSTITUTIONS"}, {"paperId": "f263595c440b9d898cfffe5c59411a6f497ff999", "title": "A STUDY ABOUT APPLICATIONS AND CHALLENGES OF INTERNET OF THINGS ARTIFICIAL INTELLIGENCE AND DIGITAL TWIN"}, {"paperId": "35c73441290e2c6f1f1757e29c8c554f501aae30", "title": "Integrating AI in Education: Opportunities, Challenges and Responsible Use of ChatGPT"}, {"paperId": "f63de82dee7e0ae6adf0e38f17d886c45bda6bd2", "title": "Classification of Hazelnuts with CNN based Deep Learning System"}, {"paperId": "0a29674fad731b7faee2412a18f1aaaaf651ab99", "title": "Artificial Intelligent Applications in Enabled Banking Services: The Next Frontier of Customer Engagement in the Era of ChatGPT"}, {"paperId": "042d187c4ea88f6b81487f010541e719613c4c1c", "title": "Integrating Building Information Modelling (BIM) and Artificial Intelligence (AI) for Smart Construction Schedule, Cost, Quality, and Safety Management: Challenges and Opportunities"}, {"paperId": "040265af9a4acb76a71c3ecab133ffd4c9c289f7", "title": "Artificial Intelligence (AI) Application in Government Department Hybrid Work Environment: A Holistic Study and Policy Implications (IMRAD)"}, {"paperId": "793395ce8ed4e5d208e0ae58eb03950bce188bb8", "title": "A Comparison of Re-Sampling Techniques for Detection of Multi-Step Attacks on Deep Learning Models"}, {"paperId": "46c84facf5f9e15f6fe9c7f4d0eac9389c9a891d", "title": "Blockchain and Artificial Intelligence (AI) integration for revolutionizing security and transparency in finance"}, {"paperId": "494653f70e1db5ed48fa65e5da3a80bc03609628", "title": "Information system design and development of Museum promotion"}, {"paperId": "b7dd67a530d565d79e3175da1c205fed06c64721", "title": "Can Artificial Intelligence be Used to Target Market Manipulation?"}, {"paperId": "74b4c3384bdcb8b9b2b3be54ac7eefaf694ae906", "title": "Developing a Teaching Unit Based on (STSE) and Its Effects on the Development of Decision-Making Skills and Ethical Thinking among Female College Students in Israel"}, {"paperId": "61e7729becf6e5e8c37b2148dae623145bb2e3fd", "title": "Feasibility Study on Assessing Emotional Health: Applications of Artificial Intelligence"}, {"paperId": "a5c44c5ea04291bb48534f3c8bdd114afe786597", "title": "The importance of relationship marketing in the process of electronic commerce"}, {"paperId": "9d06786d5e21df02e234e39d080b261654a6c084", "title": "Artificial Intelligence (AI) in CRM – possibility of effective integration, opportunities and threats"}, {"paperId": "0e2eb39e0d76bdf0dbf608da08515f624cba897f", "title": "Use-Case-based Innovation for Artificial Intelligence - an Ontological Approach"}, {"paperId": "279ee783cd112da4e8e7dff8f50b6ea22ab1d7bd", "title": "The impact of AI on the Business Model and Operating Model of AI companies"}, {"paperId": "139e67ccabfc1eca484aaf1ade67d5c004c3abd9", "title": "The impact of AI in the UK healthcare industry: A socio-technical system theory perspective"}]}
