{"paperId": "6a1b3942b007609ea4be86345d744ac262b1525d", "publicationVenue": null, "title": "Role-Based Administration of Role-Based Smart Home IoT", "abstract": "Using role-based access control (RBAC) to manage RBAC is among RBAC's attractive benefits, contributing to its long-standing dominance in practice. Administrative models facilitate management of (mostly configuration) changes in the underlying operational models. Overall system security is crucially dependent on both the administrative and operational models. In this paper, we develop an RBAC administrative model to manage authorization assignments in the EGRBAC (enhanced generalized role-based access control) operational model for smart home IoT. We design the administrative model based on pairwise disjoint Administrative Units, each of which contains a uniquely assigned administrative role and a set of administrative tasks. Administrative tasks determine the administrative permissions available to manage the operational model assignments. We begin with a model containing a single administrative unit and then extend it to include additional units. Multiple administrative units enable decentralized administration which could be adapted to provide scalability in inherently distributed and large-scale environments beyond smart home, such as smart buildings or smart campuses. We provide formalism of our proposed model and illustrate it by specifying operational and administrative use cases. Although, the model is proposed based on a specific smart home operational model, our approach could be applied to environments with similar dynamics.", "venue": "SAT-CPS@CODASPY", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-04-28", "journal": {"name": "Proceedings of the 2021 ACM Workshop on Secure and Trustworthy Cyber-Physical Systems"}, "authors": [{"authorId": "150233013", "name": "Mehrnoosh Shakarami"}, {"authorId": "145692602", "name": "R. Sandhu"}], "citations": [{"paperId": "f80ae80127bd76d9d64c0c479130040bbe94e5ae", "title": "Security Analysis of Access Control Policies for Smart Homes"}, {"paperId": "b213d89e97c33775ea4e17fb1aed33e21b118724", "title": "Access Control for IoT: A Survey of Existing Research, Dynamic Policies and Future Directions"}, {"paperId": "468cbdd8e074dc3c9bbb04fc192cbd7ecbaee470", "title": "Blockchain-Based Administration of Access in Smart Home IoT"}, {"paperId": "3e4de096db8283604b5901a47cc4d0bb05e0f62e", "title": "Securing Smart Home IoT Systems with Attribute-Based Access Control"}, {"paperId": "fb9047f3b6e29ee539d9650cad6e0f890e889528", "title": "Attribute-Based Access Control for AWS Internet of Things and Secure Industries of the Future"}]}
