{"paperId": "6a2c66c657f7dd0931b8f95b0211a074a355acf6", "publicationVenue": {"id": "591ab6ce-a675-43be-a913-78a4b6795816", "name": "The European Research Journal", "type": "journal", "alternate_names": ["Eur Res J"], "issn": "2149-3189", "url": "http://www.eurj.org/"}, "title": "Integration of digitalization into occupational health and safety and its applicability: a literature review", "abstract": "The primary aim of this study is to review the transformation of occupational health and safety (OHS) practices in the digital age, particularly in light of the onset of Industry 4.0. The study seeks to understand the emergence of OHS 4.0 methodologies and their implications for enhancing performance, reducing risks, and addressing workplace challenges. The overarching objective is to explore the innovations in the OHS domain influenced by digitalization and ascertain the benefits and challenges of integrating digital methodologies into OHS practices. A comprehensive literature review was conducted, scanning multiple sources to gather insights on the innovations brought about by digitalization in the OHS domain. The study further analyzed contemporary research and application areas of new technologies in occupational health and safety. Findings from the study confirm that the integration of digital technologies into the OHS domain can lead to a significant reduction in workplace accidents. However, as workplaces embrace digital processes, new types of risks emerge for employees. In adapting to digitalization, there are recognized challenges in areas like privacy, security, clarity, and responsibility. Digitalization has redefined the landscape of OHS, ushering in an era of OHS 4.0. While the digital methodologies offer significant advantages in reducing workplace accidents and enhancing performance, they also present new risks and challenges. As the workplace undergoes rapid changes due to technological advancements, there's a pressing need to develop OHS approaches that align with the demands of the modern age, ensuring that health and safety remain paramount amidst uncertainties in applicability.", "venue": "The European Research Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-08", "journal": {"name": "The European Research Journal"}, "authors": [{"authorId": "2005053967", "name": "Cengiz Akyildiz"}], "citations": [{"paperId": "61fcd0439fb03b433c1faf988d4496ecf5796d76", "title": "Occupational Health and Safety Digitalization in Thailand: A Framework and Case Study."}]}
