{"paperId": "6a34ab21c0ddfb60219969963d17566845db7a9d", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "Detection of e-Commerce Anomalies using LSTM-recurrent Neural Networks", "abstract": "As the e-commerce sales grow in global retail sector year by year, detecting anomalies that occur in the most important key performance indicators (KPI) in real-time has become a critical requirement for e-commerce companies. Such anomalies that may arise from software updates, server failures, or incorrect price entries cause substantial revenue loss in the meantime until they are detected with their root-causes. In this paper, we present a comparative analysis of various anomaly detection methods in detecting e-commerce anomalies. For this purpose, we first present the univariate analysis of six commonly used anomaly detection methods on two important KPIs of an e-commerce website. The highest F1 Scores and recall values on the test sets of both KPIs are obtained using Long-Short Term Memory (LSTM) network, showing that LSTM fits better to the dynamics of e-commerce KPIs than time-series based prediction methods. Then, in addition to the univariate analysis of the methods, we feed the campaign information into LSTM network considering that campaigns have significant effects on the values of KPIs in e-commerce domain and this information can be helpful to prevent false positives that may occur in the campaign periods. The results also show that constructing a multivariate LSTM by feeding the campaign information as an additional input improves the adaptability of the model to sudden changes occurring in campaign periods.", "venue": "International Conference on Data Technologies and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-02", "journal": {"pages": "217-224"}, "authors": [{"authorId": "1395908680", "name": "Merih Bozbura"}, {"authorId": "66473706", "name": "H. C. Tunç"}, {"authorId": "1391989724", "name": "Miray Kusak"}, {"authorId": "2825983", "name": "C. O. Sakar"}], "citations": [{"paperId": "ec5bd721acec7b077c27d6b4ca2d57bf77a25820", "title": "Sales Anomaly Detection Using Automatic Time Series Decomposition"}, {"paperId": "a5b31aee55536de0d946f99364cd5e1fb24fd3bc", "title": "A simple method for unsupervised anomaly detection: An application to Web time series data"}, {"paperId": "58d3582ca97e0bf2f9727431f38e1969bdf5eec5", "title": "Sensitive Keyword Detection on Textual Product Data: An Approximate Dictionary Matching and Context-score Approach"}]}
