{"paperId": "6a369d3a77e1504324d5ab51b9aa95af148720e0", "publicationVenue": {"id": "405a8682-2b02-472d-9d89-0115f4e329bc", "name": "Eastern-European Journal of Enterprise Technologies", "type": "journal", "alternate_names": ["Eastern-european J Enterp Technol"], "issn": "1729-3774", "url": "http://journals.uran.ua/eejet", "alternate_urls": ["http://journals.uran.ua/eejet/index"]}, "title": "Performance evaluation of the cloud computing application for IoT-based public transport systems", "abstract": "The object of research is cloud computing as an element of the server infrastructure for intelligent public transport systems. Given the increasing complexity and requirements for modern transportation, the application of the Internet of Things concept has a high potential to improve efficiency and passenger comfort. Since the load generated in IoT systems is dynamic and difficult to predict, the use of traditional infrastructure with dedicated servers is suboptimal. This study considers the use of cloud computing as the main server infrastructure for the above systems. The paper investigates the main cloud platforms that can be used to develop such systems and evaluates their advantages and disadvantages. The authors developed the overall architecture of the system and evaluated the performance and scalability of individual components of the server infrastructure. To test the system, a software emulator was developed that simulates the controller module installed in vehicles. Using the developed emulator, stress tests were conducted to analyze and confirm the ability to scale and process input data by the proposed architecture. The test scenarios were developed and conducted on the basis of the existing public transportation system in Kyiv, Ukraine. The experimental results showed that the proposed IoT architecture is able to scale efficiently according to the load generated by the connected devices. It has been found that when the number of incoming messages increases from 40 to 6000, the average message processing time remains unchanged, and the error rate does not increase, which is an indicator of stable system operation. The obtained results can be used in the development of modern public transport systems, as well as for the modernization of existing ones", "venue": "Eastern-European Journal of Enterprise Technologies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Eastern-European Journal of Enterprise Technologies"}, "authors": [{"authorId": "2203690703", "name": "Ihor Zakutynskyi"}, {"authorId": "2203687599", "name": "Leonid Sibruk"}, {"authorId": "2211703480", "name": "Ihor Rabodzei"}], "citations": [{"paperId": "18e671d7712b41a0f609f3c48c7cf9df18367134", "title": "Effect of the Formation of Hydrophilic and Hydrophobic–Hydrophilic Associates on the Behavior of Copolymers of N-Vinylpyrrolidone with Methyl Acrylate in Aqueous Solutions"}, {"paperId": "fe2827bea5dcf727d561d72669804d457224846e", "title": "Improving a procedure of load balancing in distributed IoT systems"}, {"paperId": "85635c41eebbdb310387410a4632ef45ce51ddb1", "title": "cardiovascu-I o T SYSTEM DEVELOPMENT FOR HEART RHYTHM MONITORING AND CARDIOVASCULAR RISK ESTIMATION"}]}
