{"paperId": "6a3f283b6970a69a5cadf8999b4415d1126573a1", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Spatial Pattern Analysis of the Ecosystem Services in the Guangdong-Hong Kong-Macao Greater Bay Area Using Sentinel-1 and Sentinel-2 Imagery Based on Deep Learning Method", "abstract": "Assessment of ecosystem services supply, demand, and budgets can help to achieve sustainable urban development. The Guangdong-Hong Kong-Macao Greater Bay Area, as one of the most developed megacities in China, sets up a goal of high-quality development while fostering ecosystem services. Therefore, assessing the ecosystem services in this study area is very important to guide further development. However, the spatial pattern of ecosystem services, especially at local scales, is not well understood. Using the available 2017 land cover product, Sentinel-1 SAR and Sentinel-2 optical images, a deep learning land cover mapping framework integrating deep change vector analysis and the ResUnet model was proposed. Based on the produced 10 m land cover map for the year 2020, recent spatial patterns of the ecosystem services at different scales (i.e., the GBA, 11 cities, urban–rural gradient, and pixel) were analyzed. The results showed that: (1) Forest was the primary land cover in Guangzhou, Huizhou, Shenzhen, Zhuhai, Jiangmen, Zhaoqing, and Hong Kong, and an impervious surface was the main land cover in the other four cities. (2) Although ecosystem services in the GBA were sufficient to meet their demand, there was undersupply for all the three general services in Macao and for the provision services in Zhongshan, Dongguan, Shenzhen, and Foshan. (3) Along the urban–rural gradient in the GBA, supply and demand capacity showed an increasing and decreasing trend, respectively. As for the city-level analysis, Huizhou and Zhuhai showed a fluctuation pattern while Jiangmen, Zhaoqing, and Hong Kong presented a decreasing pattern along the gradient. (4) Inclusion of neighborhood landscape led to increased demand scores in a small proportion of impervious areas and oversupply for a very large percent of bare land.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2021-06-23", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2035583266", "name": "Dawei Wen"}, {"authorId": "48837137", "name": "Song Ma"}, {"authorId": "1387851670", "name": "A. Zhang"}, {"authorId": "2060597", "name": "X. Ke"}], "citations": [{"paperId": "2727a056397908bb3c7d28d7be1faeef74017b5e", "title": "MMDL-Net: Multi-Band Multi-Label Remote Sensing Image Classification Model"}, {"paperId": "0eff527aee44728da3ba49688e8082cf035c6ee6", "title": "Assessment of Water Ecosystem Integrity (WEI) in a Transitional Brazilian Cerrado–Atlantic Forest Interface"}, {"paperId": "d34536d9e8c96711e9069b3f5e289394d3da77c1", "title": "A deep learning classification approach using high spatial satellite images for detection of built-up areas in rural zones: Case study of Souss-Massa region - Morocco"}, {"paperId": "2abecb582b4905751dec41c5db0c076aa4d787f8", "title": "Spatiotemporal analysis of landscape pattern and structure in the Greater Bay Area, China"}]}
