{"paperId": "6a4719871c5d51ad2cd140561652500df06409bd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Algorithm Evolution Using Large Language Model", "abstract": "Optimization can be found in many real-life applications. Designing an effective algorithm for a specific optimization problem typically requires a tedious amount of effort from human experts with domain knowledge and algorithm design skills. In this paper, we propose a novel approach called Algorithm Evolution using Large Language Model (AEL). It utilizes a large language model (LLM) to automatically generate optimization algorithms via an evolutionary framework. AEL does algorithm-level evolution without model training. Human effort and requirements for domain knowledge can be significantly reduced. We take constructive methods for the salesman traveling problem as a test example, we show that the constructive algorithm obtained by AEL outperforms simple hand-crafted and LLM-generated heuristics. Compared with other domain deep learning model-based algorithms, these methods exhibit excellent scalability across different problem sizes. AEL is also very different from previous attempts that utilize LLMs as search operators in algorithms.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-26", "journal": {"name": "ArXiv", "volume": "abs/2311.15249"}, "authors": [{"authorId": "2256759231", "name": "Fei Liu"}, {"authorId": "153919866", "name": "Xialiang Tong"}, {"authorId": "2260338665", "name": "Mingxuan Yuan"}, {"authorId": "2248220773", "name": "Qingfu Zhang"}], "citations": [{"paperId": "505e68432c0cb1e5676964a5f021e71e61d6dccd", "title": "Leveraging Large Language Model to Generate a Novel Metaheuristic Algorithm with CRISPE Framework"}, {"paperId": "03bd8f820e41b9fe7515c9dfaf3b315f1b8da7ee", "title": "From Words to Routes: Applying Large Language Models to Vehicle Routing"}, {"paperId": "b671934871fb9a2db3ba729647f298d46958804d", "title": "Large Language Model-Based Evolutionary Optimizer: Reasoning with elitism"}, {"paperId": "af9f5838b3c234f984d0f689b39fc93dbe7f7fe4", "title": "Discovering More Effective Tensor Network Structure Search Algorithms via Large Language Models (LLMs)"}, {"paperId": "be7a88babf78512b545f585517704cb597388cbc", "title": "ReEvo: Large Language Models as Hyper-Heuristics with Reflective Evolution"}, {"paperId": "7d7567340337b89c995c3525d89a6c713d1481e6", "title": "L-AutoDA: Leveraging Large Language Models for Automated Decision-based Adversarial Attacks"}, {"paperId": "478f71f1cd9bad0435560544a9dce7ca49d97766", "title": "Evolutionary Computation in the Era of Large Language Model: Survey and Roadmap"}, {"paperId": "6d91f344e9c80df5c69311abfc63b74b42c735c3", "title": "An Example of Evolutionary Computation + Large Language Model Beating Human: Design of Efficient Guided Local Search"}]}
