{"paperId": "6a4ee8469c67580db3423fee001fdcab862d2820", "publicationVenue": {"id": "c763f370-eee9-4b18-a73d-80d35017fbd8", "name": "International Journal on Advanced Science, Engineering and Information Technology", "type": "journal", "alternate_names": ["Int J Adv Sci Eng Inf Technol"], "issn": "2088-5334", "url": "http://ijaseit.insightsociety.org/"}, "title": "Modern Monitoring Instrument to Support Fishing Vessel Operation and Maintenance: A Review", "abstract": "— Determining the maintenance strategy for fishing vessels propulsion engines can use engine operational monitoring data. This data is used to prepare the implementation time, spare parts, labor, and costs. Unfortunately, many fishing vessels do not have this data. Currently, electronic devices are available for monitoring machine operations. This device is cheap, easy to use, takes responsibility for various physical quantity parameters, displays it on LCD, stores it digitally, and transmits data wirelessly. This paper aims to review the application of engine operational monitoring tools to apply to fishing vessel propulsion engines. The material used is scientific articles consisting of journals and proceedings indexed by online databases. Several keywords are used to obtain scientific articles that are suitable for the study. The method used is a literature review that is systematically reviewed by applying inclusion and exclusion. The results obtained in this article are the parameters for monitoring propulsion engines, namely temperature, pressure, rotational speed, and hours the engine runs. The monitoring device requires sensors to detect physical parameters, a microcontroller to process data, an LCD to display monitoring results, and memory to store data to obtain this data. The device supports wireless communication via Bluetooth or WiFi radio signal. Fishing vessels are operating in offshore areas that are not covered by internet networks as IoT communication transmissions. Further research on how to transmit operational engine data from offshore to onshore without an internet signal so that data can be accessed using the internet network.", "venue": "International Journal on Advanced Science, Engineering and Information Technology", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-12", "journal": {"name": "International Journal on Advanced Science, Engineering and Information Technology"}, "authors": [{"authorId": "2267465885", "name": "M. Zaki"}, {"authorId": "2267467833", "name": "Latif Abrori"}, {"authorId": "116121240", "name": "S. Sidhi"}, {"authorId": "2070314584", "name": "D. Prasetyo"}], "citations": [{"paperId": "816d6ea20c790173dc24e17f26ec364067fa1450", "title": "The ANALISIS HUMAN ERROR PADA PENGOPERASIAN MESIN PENGGERAK KAPAL PENANGKAP IKAN DI BITUNG SULAWESI UTARA"}]}
