{"paperId": "6a55a2bf2abfba479be982af3f5007f4d1fc17d4", "publicationVenue": {"id": "7e79de3e-93d0-413c-9f0d-e0288f94b4d5", "name": "Expert systems", "type": "journal", "alternate_names": ["Expert Syst", "Expert Systems", "Expert syst"], "issn": "0266-4720", "url": "https://onlinelibrary.wiley.com/journal/14680394"}, "title": "A multi‐parametric machine learning approach using authentication trees for the healthcare industry", "abstract": "The Internet of Health Things (IoHT) has grown in importance for developing medical applications with the support of wireless communication systems. IoHT is integrated with many sensors to capture the patients' records and transmits them to hospital centres for analysis and reporting. Controlling and managing health records has been addressed in several ways, however, it is noted that two key research problems for vital communication systems are reliability and reducing data loss. To enhance the sustainability of health applications and effectively use the network infrastructure when transferring sensitive data, this research provides a machine learning approach. Moreover, data collected from the IoHTs are protected and can be securely received for physical process in hospitals using authentication trees. Firstly, the undirected graphs are explored based on the multi‐parametric machine learning approach to minimize the computation overheads and traffic congestion. Secondly, it evaluates the nodes' level behaviour over the heterogeneous traffic load with efficient identification of redundant links. Finally, in‐depth analysis and simulation results have shown that the proposed protocol is more effective than existing approaches for data accuracy and security analysis.", "venue": "Expert systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-05", "journal": {"name": "Expert Systems", "volume": "41"}, "authors": [{"authorId": "2709245", "name": "I. Abunadi"}, {"authorId": "2064048917", "name": "Amjad Rehman"}, {"authorId": "2689599", "name": "K. Haseeb"}, {"authorId": "73544347", "name": "Teg Alam"}, {"authorId": "31444174", "name": "Gwanggil Jeon"}], "citations": [{"paperId": "e18c621fe294220b0a3d3f57f7d02c7353bb3440", "title": "Recent trends and advances in machine learning challenges and applications for industry 4.0"}, {"paperId": "3089e54219d94c405f01544b5ace7b05126b232b", "title": "Multimedia IoT-surveillance optimization model using mobile-edge authentic computing."}, {"paperId": "39bd802582fac86000b331a426403a6f36ddbadf", "title": "Modeling and optimizing IoT-driven autonomous vehicle transportation systems using intelligent multimedia sensors"}, {"paperId": "d4bfec5c9f9af8119ba5011005a335a4b5fc7dc8", "title": "Secure and Smart Teleradiology Framework Integrated with Technology-Based Fault Detection (CVT-FD)"}]}
