{"paperId": "6a5aa380d5f990a20c6548d158c0e94d4f01d378", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Decision-Making and Computational Modeling of Big Data for Sustaining Influential Usage", "abstract": "Big Data is data whose shape and volume are rising with the passage of time and innovations in technology. This increase will give birth to more uncertain and complex situations, which will then be difficult to properly analyze and manage. Various devices are interconnected with each other, which communicate different types of information. This information is used for different purposes. A huge volume of data is produced, and the storage becomes larger. Computational modeling is the tool that helps analyze, process, and manage the data to extract useful information. The modern industry's challenge is to incorporate knowledge into Big Data applications to deal with distinguishing difficulties in computational models. The techniques and models are delivered with guides to help analysts quickly fit models to information insights. The decision support system is a strong system that plays a significant role in shaping Big Data for sustaining efficiency and performance. Decision-making through computational modeling is also a powerful mechanism for supporting efficient tools for managing Big Data for influential use. Keeping in view the issues of modern-day industry, the proposed study has been considered to present decision-making and computational modeling of Big Data for sustaining influential usage. The existing state-of-the-art literature is presented in an organized way to analyze the currently available research.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-16", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "2054389773", "name": "Qi Chang"}, {"authorId": "3195938", "name": "S. Nazir"}, {"authorId": "2159479462", "name": "Xia Li"}], "citations": [{"paperId": "d2b569d7b40800d54bbf86de383bad4d4db3adcf", "title": "Data Recovery Technology Based on Subspace Clustering"}, {"paperId": "a0ba0fabf5db901122477734c7d2ce972d219a5d", "title": "Analysis Model Design of the Intermediary Role of Psychological Expectation in Customer Value Proposition Driven Business Model Innovation against the Background of Big Data"}]}
