{"paperId": "6a671b63c1e0b887383e2ada2cee9ba109870901", "publicationVenue": {"id": "ed5f019d-fcfe-4bb9-8342-9a729784715d", "name": "Journal of Open Innovation: Technology, Market and Complexity", "type": "journal", "alternate_names": ["J Open Innov Technol Mark Complex"], "issn": "2199-8531", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1111697", "alternate_urls": ["https://jopeninnovation.springeropen.com/", "http://www.springer.com/business+&+management/technology+management/journal/40852", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1111697", "https://www.mdpi.com/journal/JOItmC", "http://www.jopeninnovation.com/"]}, "title": "Systemic Acquired Critique of Credit Card Deception Exposure through Machine Learning", "abstract": "A wide range of recent studies are focusing on current issues of financial fraud, especially concerning cybercrimes. The reason behind this is even with improved security, a great amount of money loss occurs every year due to credit card fraud. In recent days, ATM fraud has decreased, while credit card fraud has increased. This study examines articles from five foremost databases. The literature review is designed using extraction by database, keywords, year, articles, authors, and performance measures based on data used in previous research, future research directions and purpose of the article. This study identifies the crucial gaps which ultimately allow research opportunities in this fraud detection process by utilizing knowledge from the machine learning domain. Our findings prove that this research area has become most dominant in the last ten years. We accessed both supervised and unsupervised machine learning techniques to detect cybercrime and management techniques which provide evidence for the effectiveness of machine learning techniques to control cybercrime in the credit card industry. Results indicated that there is room for further research to obtain better results than existing ones on the basis of both quantitative and qualitative research analysis.", "venue": "Journal of Open Innovation: Technology, Market and Complexity", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-21", "journal": {"name": "Journal of Open Innovation: Technology, Market, and Complexity"}, "authors": [{"authorId": "2104981225", "name": "R. Dantas"}, {"authorId": "2187471160", "name": "Raheela Firdaus"}, {"authorId": "120833447", "name": "Farrokh Jaleel"}, {"authorId": "2171035355", "name": "Pedro Neves Mata"}, {"authorId": "1576903027", "name": "M. N. Mata"}, {"authorId": "2188823737", "name": "Gang Li"}], "citations": [{"paperId": "d6acfc15fe2e0329282a02198de15a812f394013", "title": "Enhancing Security for Online Transactions through Supervised Machine Learning and Block Chain Technology in Credit Card Fraud Detection"}, {"paperId": "5e24384410d6b62289db88a43a8156a1ce1f9f79", "title": "An Innovative Examination of Tensor Blending Network for Multi-Model Sentimental optimization Using Opinion Mining"}]}
