{"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams", "abstract": "Large amounts of georeferenced data streams arrive daily to stream processing systems. This is attributable to the overabundance of affordable IoT devices. In addition, interested practitioners desire to exploit Internet of Things (IoT) data streams for strategic decision-making purposes. However, mobility data are highly skewed and their arrival rates fluctuate. This nature poses an extra challenge on data stream processing systems, which are required in order to achieve pre-specified latency and accuracy goals. In this paper, we propose ApproxSSPS, which is a system for approximate processing of geo-referenced mobility data, at scale with quality of service guarantees. We focus on stateful aggregations (e.g., means, counts) and top-N queries. ApproxSSPS features a controller that interactively learns the latency statistics and calculates proper sampling rates to meet latency or/and accuracy targets. An overarching trait of ApproxSSPS is its ability to strike a plausible balance between latency and accuracy targets. We evaluate ApproxSSPS on Apache Spark Structured Streaming with real mobility data. We also compared ApproxSSPS against a state-of-the-art online adaptive processing system. Our extensive experiments prove that ApproxSSPS can fulfill latency and accuracy targets with varying sets of parameter configurations and load intensities (i.e., transient peaks in data loads versus slow arriving streams). Moreover, our results show that ApproxSSPS outperforms the baseline counterpart by significant magnitudes. In short, ApproxSSPS is a novel spatial data stream processing system that can deliver real accurate results in a timely manner, by dynamically specifying the limits on data samples.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1833407969", "name": "Isam Mashhour Al Jawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": [{"paperId": "7424e30c0d6f508c30691d5864a5da9a8c667cd6", "title": "Cost-Effective Approximate Aggregation Queries on Geospatial Big Data"}, {"paperId": "4dc40e5bf500b8bc891d5876ff76ddde78ec9328", "title": "Efficient Generation of Approximate Region-based Geo-maps from Big Geotagged Data"}, {"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "5a7ed26e8b54b1e3492c17ecaa1d9451d02b05ae", "title": "Efficient Integration of Heterogeneous Mobility-Pollution Big Data for Joint Analytics at Scale with QoS Guarantees"}, {"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "title": "Efficient Geospatial Analytics on Time Series Big Data"}, {"paperId": "bb65087238adf9cbb0eb024b0cfcf88293f546f3", "title": "Efficiently Integrating Mobility and Environment Data for Climate Change Analytics"}]}
