{"paperId": "6a7026b40a661b1f93429a8394da8f514e48c7b2", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "On the Cost of Acking in Data Stream Processing Systems", "abstract": "The widespread use of social networks and applications such as IoT networks generates a continuous stream of data that companies and researchers want to process, ideally in real-time. Data stream processing systems (DSP) enable such continuous data analysis by implementing the set of operations to be performed on the stream as directed acyclic graph (DAG) of tasks. While these DSP systems embed mechanisms to ensure fault tolerance and message reliability, only few studies focus on the impact of these mechanisms on the performance of applications at runtime. In this paper, we demonstrate the impact of the message reliability mechanism on the performance of the application. We use an experimental approach, using the Storm middleware, to study an acknowledgment-based framework. We compare the two standard schedulers available in Storm with applications of various degrees of parallelism, over single and multi cluster scenarios. We show that the acking layer may create an unforeseen bottleneck due to the acking tasks placement; a problem which, to the best of our knowledge, has been overlooked in the scientific and technical literature. We propose two strategies for improving the acking tasks placement and demonstrate their benefit in terms of throughput and latency.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "2019 19th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID)", "pages": "331-340"}, "authors": [{"authorId": "1419472573", "name": "Alessio Pagliari"}, {"authorId": "2547669", "name": "F. Huet"}, {"authorId": "1403731471", "name": "G. Urvoy-Keller"}], "citations": [{"paperId": "d9b18c8a69eba21e189cead667ede211ff1aa54f", "title": "Flink Task Scheduling Based on LBGA"}, {"paperId": "49d3c8a0e882b155c271c976dd6884be3502ba44", "title": "Flink-ER: An Elastic Resource-Scheduling Strategy for Processing Fluctuating Mobile Stream Data on Flink"}]}
