{"paperId": "6a723719e7cf61f754f194eb7f8464e28af2eecc", "publicationVenue": null, "title": "O'FAIRe makes you an offer: metadata-based automatic FAIRness assessment for ontologies and semantic resources", "abstract": "FAIRness assessment evaluates the degree to which a digital object is Findable, Accessible, Interoperable, and Reusable. Here, our object of interest are semantic resources (from thesauri, terminologies, vocabularies to ontologies). Indeed, we have not yet seen a clear methodology implemented and tooled to automatically assess the level of FAIRness of semantic resources. The main objective of this work is to provide such methodology and tooling to guide semantic stakeholders for: (i) making their semantic resources FAIR through better use of standardized metadata; (ii) selecting relevant FAIR semantic resources for use. We propose a metadata-based automatic FAIRness assessment methodology for ontologies and semantic resources called Ontology FAIRness Evaluator (O’FAIRe). It is based on the projection of the 15 foundational FAIR principles for ontologies, and it is aligned and nourished with relevant state-of-the-art initiatives for FAIRness assessment. We propose 61 questions among 80% are based on the resource metadata descriptions and we review the standard metadata properties (taken from the MOD 1.4 ontology metadata model) that could be used to implement these metadata descriptions and improve the level of FAIRness of any semantic resource. We also demonstrate the importance of relying on ontology libraries or repositories to harmonize and harness unified metadata and thus allow FAIRness assessment. Moreover, we have implemented O’FAIRe in the AgroPortal semantic resource repository and produced a preliminary FAIRness analysis over 149 semantic resources in the agri-food/environment domain.", "venue": "Int. J. Metadata Semant. Ontologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Int. J. Metadata Semant. Ontologies", "pages": "16-46", "volume": "16"}, "authors": [{"authorId": "2718307", "name": "Emna Amdouni"}, {"authorId": "2161889179", "name": "Syphax Bouazzouni"}, {"authorId": "1800186", "name": "C. Jonquet"}], "citations": [{"paperId": "fcce54e29f20749b224b4759b58d873ca2c766b1", "title": "C3PO: a crop planning and production process ontology and knowledge graph"}, {"paperId": "16b9bbfbb0ca1933cfb85f74f8952433fa7a720c", "title": "A maturity model for catalogues of semantic artefacts"}, {"paperId": "9da3ef714b2947e51e27094881011813ca549862", "title": "Semantic Modeling, Development and Evaluation for the Resistance Spot Welding Industry"}, {"paperId": "6b43c45020ab19860d40b2376c44f6d4d9a8ff03", "title": "IndustryPortal: a Common Repository for FAIR Ontologies in Industry 4.0"}, {"paperId": "d4861f92167bb59004c9525ffb5610a96e295018", "title": "Joint Proceedings of the Onto4FAIR 2023 Workshops"}, {"paperId": "b380376c4196d1d82dce9888cb77edd1c305be65", "title": "Ontology Repositories and Semantic Artefact Catalogues with the OntoPortal Technology"}]}
