{"paperId": "6a76c0b090772dd9c8cca7c715e892effe60ef7c", "publicationVenue": {"id": "16d61314-3601-4a95-a38b-63e46a52c347", "name": "Interdisciplinary Journal of Virtual Learning in Medical Sciences", "type": "journal", "alternate_names": ["Interdiscip J Virtual Learn Med Sci"], "issn": "2476-7263", "url": "http://ijvlms.ir/online/"}, "title": "Learning Analytics: A Systematic Literature Review", "abstract": "Context Learning analytics is considered as the third wave in educational technology and it is a new and promising field of study. This study was conducted to clarify benefits and challenges of learning analytics in education. Methods Cooper’s systematic literature review was used as the research method. This method has five steps as follows: a) formulation of the problem, b) collection of data, c) evaluation of the appropriateness of the data, d) analysis and interpretation of relevant data, and e) organization and presentation of the results. Based on the study selection process, 36 articles were finally selected to be analyzed. Results The results showed that ethics and privacy were one of the most important challenges of learning analytics in education along with the lack of attention to theoretical foundations and scope and quality of data. The results also showed that learning analytics could bring remarkable benefits for education, such as increased engagement of students, improvement of learning outcomes, identification of students at risk, providing real - time feedback, and personalization of learning. Conclusions Based on the results, it can be concluded that learning analytics offer new insights in education, however, there are ethical, educational, and technical issues in the use of learning analytics in education.", "venue": "Interdisciplinary Journal of Virtual Learning in Medical Sciences", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-06-01", "journal": {"name": "Interdisciplinary Journal of Virtual Learning in Medical Sciences"}, "authors": [{"authorId": "118733794", "name": "S. K. Banihashem"}, {"authorId": "144529042", "name": "K. Aliabadi"}, {"authorId": "3302935", "name": "S. P. Ardakani"}, {"authorId": "150010146", "name": "Ali Delaver"}, {"authorId": "88551131", "name": "M. N. Ahmadabadi"}], "citations": [{"paperId": "850ee12ded42ff87c2dfeb026b91d0d4ccf97b3f", "title": "Artificial intelligence in education research during 2013–2023: A review based on bibliometric analysis"}, {"paperId": "8302efe8a4ff90e3008c4f9aefd9ee461cae7b28", "title": "Uso de la Inteligencia Artificial en Estudiantes Universitarios"}, {"paperId": "ad368b22b241499b395b0e2ea8429ea55c58a544", "title": "Curriculum Development Management: Challenges and Opportunities in the Era of Global Education"}, {"paperId": "74a187d9e9c592e16e9b691a47cb94da64b206c0", "title": "Learning Analytics in the Era of Large Language Models"}, {"paperId": "f9d421cfa6dfa3d54961bc4fb2d346f776a1d5e8", "title": "Learning analytics driven improvements in learning design in higher education: A systematic literature review"}, {"paperId": "1c0d77d52cdb72dc15a3987dc0c6a1c995d51513", "title": "EXPLORING PRE-SERVICE TEACHERS’ BELIEFS ABOUT THE ROLE OF ARTIFICIAL INTELLIGENCE IN HIGHER EDUCATION IN GHANA"}, {"paperId": "dcc7a0374754f939a33c9e8cf4a261d60a3600af", "title": "Teacher decision making tool: Development of a prototype to facilitate teacher decision making in the classroom"}, {"paperId": "d654334b93f2326474af09036b933731d7e9ded9", "title": "Rethinking MMLA: Design Considerations for Multimodal Learning Analytics Systems"}, {"paperId": "de9e9209901f99ffffdb02d0eca328674c730c93", "title": "Intelligent techniques in e-learning: a literature review"}, {"paperId": "d2e5077770e80d0b5c9ba44398967c312677a95e", "title": "Systematic Analysis of Theses Made Using Learning Analytics in Türkiye"}, {"paperId": "3a1de66f36daa153f789f4a3aab9794eecd56e63", "title": "Delving into instructor-led feedback interventions informed by learning analytics in massive open online courses"}, {"paperId": "6a597facf7270f4ea10f978f3c0dd57f407d1b41", "title": "Teaching the basics of computer graphics in virtual reality"}, {"paperId": "c0ea0de8f6e5c021e3473be5ff13fb97a274c0de", "title": "Federated Learning for Data Analytics in Education"}, {"paperId": "51ed48c3faf3e65a71032ed6b0be443b25167b4c", "title": "Learning Analytics and MOOLs: there is much more than equipment usage logs"}, {"paperId": "1d57bf6ce6c3e1812d4cdfe8b6e56f59b8282ef9", "title": "Personalisation methods in e‐learning‐A literature review"}, {"paperId": "74d24a141942b3ff6709eeb13a2924a4a7ec189d", "title": "A Framework for Analyzing Interactions in a Video-based Collaborative Learning Environment"}, {"paperId": "c72ec55196f0ba83a88e7b4e289eba58d1a6e61b", "title": "Learning analytics: state of the art"}, {"paperId": "757a3f0c5cdf1ea40452e76e72dd3ce6142b16ec", "title": "Accuracy comparison between statistical and computational classifiers applied for predicting student performance in online higher education"}, {"paperId": "e43a4f2809ce28f2c22a42d023e40724b469d11e", "title": "Learning analytics for enhancing the usability of serious games in formal education: A systematic literature review and research agenda"}, {"paperId": "85b93c31af6072384dee5119d5b3be9c93c468c5", "title": "A decade of learning analytics: Structural topic modeling based bibliometric analysis"}, {"paperId": "708dcb655cde8a9d38ddca2a501fd0c13a3cce87", "title": "Understanding Utility and Privacy of Demographic Data in Education Technology by Causal Analysis and Adversarial-Censoring"}, {"paperId": "b4639aef09fd07d8b0cc1be3dac096311cf2b005", "title": "Testing and exploring the predictors of faculty motivation to use learning analytics to enhance teaching effectiveness"}, {"paperId": "8f3be20e13158ea7455e7c39a32d561f5e142063", "title": "Factors Affecting the Deployment of Learning Analytics in Developing Countries: Case of Egypt"}, {"paperId": "2063e9bcf0d4cce2ec87ebf5f99c1590b0f5a57c", "title": "Learner-facing learning analytic – Feedback and motivation: A critique"}, {"paperId": "a7aaafc7a8b1fa0a2b4f0f63aa934ec060b20932", "title": "Adaptive Learning Supported by Learning Analytics for Student Teachers’ Personalized Training during in-School Practices"}, {"paperId": "18b2000280118a6465f7be84e35e9c3eade82e69", "title": "Predicting students at risk of academic failure using ensemble model during pandemic in a distance learning system"}, {"paperId": "0e352fd55b60c44c3c3daf1e4c61399c45afaaa7", "title": "The effectiveness of the GoKoan e-learning platform in improving university students’ academic performance"}, {"paperId": "8adc93b42037b515aa5ee1149506f167cda1c17d", "title": "Rendimiento académico y patrones de uso del campus virtual: Un estudio de caso controlado"}, {"paperId": "1435285872ad1bf4f4977d519f7cd2471b64f367", "title": "Pedagogical Design: Bridging Learning Theory and Learning Analytics"}, {"paperId": "bb914257b048d85ea046228d9d35044958b10ea6", "title": "Backpack Process Model (BPPM): A Process Mining Approach for Curricular Analytics"}, {"paperId": "e24c774498d073d6f2f27cb29cd707bb269a0bf1", "title": "The impacts of constructivist learning design and learning analytics on students’ engagement and self-regulation"}, {"paperId": "f190a90ae412fc07c5e98ac72d26d6dd6a0308f7", "title": "Teachers’ Views Regarding Learning Analytics Usage Based on the Technology Acceptance Model"}, {"paperId": "db75478d0dc88a06e0b71fa127e3b75ab8fe0575", "title": "A low-cost tabletop game to collect learning analytics during computational thinking using unplugged or tangible activities"}, {"paperId": "d3919902e819cc5299c57a53c81241eb3c3530ab", "title": "Understanding Learning Analytics Indicators for Predicting Study Success"}, {"paperId": "dcb0c376ff29eec256c7977e8208f0cdaf4263d6", "title": "Multi-layer Adaptive Fuzzy Inference System for Predicting Student Performance in Online Higher Education"}, {"paperId": "1ea026ac942b9a5a281186e6ae038988f0f7eb0d", "title": "A new local causal learning algorithm applied in learning analytics"}, {"paperId": "96e5a737bc35d212d3ee6b3ff03be4f07f12540e", "title": "Reflections on Different Learning Analytics Indicators for Supporting Study Success"}, {"paperId": "6ff1bfd272a713cc98cd7f0d1bdf0895be60789d", "title": "Analítica de los usos digitales y rendimiento académico. Un\n estudio de caso con estudiantes universitarios"}, {"paperId": "d63460e43257865d686fef02481e436db04d7829", "title": "The evolving field of learning analytics research in higher education"}, {"paperId": "d7795c6039f5e873518519210fa317b88ca13a69", "title": "Critical Lens in Learning Analytics Research: A Systematic Literature Review"}, {"paperId": "31c87d7b72773e07d09673a5a3f6bec315fb76e4", "title": "Data science syllabi measuring its content"}, {"paperId": "0c2c2bf09634e757723daa1d9b9ef3af9713ef6e", "title": "Analítica del aprendizaje y las neurociencias educativas: nuevos retos en la integración tecnológica"}, {"paperId": "f4a948c83900b2b1cccd130ce8f6cfd941d19e2e", "title": "DEVELOPING A PRODUCTIVE KNOWLEDGE-BUILDING DISCOURSE THROUGH JUDGMENTS OF PROMISING IDEAS AND EPISTEMIC REFLECTION"}, {"paperId": "1fb0a776ea4c07ffb0cef275480972c37bad5c42", "title": "DEPLOYMENT OF A GENERIC METHOD IN THE DESIGN OF DIGITAL LEARNING ENVIRONMENTS USING A COLLABORATIVE AUTHORING TOOL"}, {"paperId": "7b9d4c18e3e4e1a52adb793df99f15815f541bab", "title": "Developing a Dashboard to Support the Analysis of Multimodal Educational Data"}, {"paperId": "1ae99189d8c260c323f80a5b06c0f1dd8068564d", "title": "Tackling the Challenges with Data Access in Learning Analytics Research: A Case Study of Virtual Labs"}, {"paperId": "b8124c0cc914cfe4966a5debad77dafe97cae8ef", "title": "Learning Analytics to Support Teaching Skills: A Systematic Literature Review"}, {"paperId": "a892055021e3c0d8a3ad5204c87d704d653afece", "title": "Categorizing learning analytics models according to their goals and identifying their relevant components: A review of the learning analytics literature from 2011 to 2019"}, {"paperId": "1d057125d2e33424d42543e7db4cf97c2d2e7a50", "title": "The Use of Predictive Analytics to Shift the Culture of Academic Advising Toward a Focus on Student Success"}, {"paperId": "02b22005334deaef01a9b95855d3a2fef17e00a2", "title": "Aplicación de una red neuronal probabilística para predecir el desempeño académico de estudiantes de educación superior en línea"}]}
