{"paperId": "6a8057da38c5c96c1027c1e008cf351903d1bb59", "publicationVenue": null, "title": "Live Data Visualization of IoT Sensors Using Augmented Reality (AR) and BIM", "abstract": "– Recently, the integration of Building Information Modeling (BIM) technology and Virtual and Augmented Reality (VR/AR) technologies during the operation and maintenance phase has been increasingly adopted. There has also been a surge of interest in the exploitation of Internet of Things (IoT) for constructed facilities, in the form of wireless networks connecting physical objects (e.g., sensing devices, facility assets, equipment, etc.). Recent IoT systems offer data management and visualization solutions. However, to improve issues such as safety and indoor comfort conditions for facilities, most of the existing IoT deployment do not benefit from the enriched digital representations of BIM and its graphical visualization capabilities. Although the integration of sensor data with BIM models has been investigated in academia, storing such real-time data in a standard and structured manner remains to be further investigated. This research aims to visualize live environmental data collected by IoT agents in the AR environment built upon existing BIM models. In our case study, the environmental data, such as indoor air temperature, light intensity, and humidity are captured by sensors connected to Arduino microcontrollers. Sensor reading are then stored in the BIM model and visualized in both the BIM platform and the AR application in a real-time manner.", "venue": "Proceedings of the 36th International Symposium on Automation and Robotics in Construction (ISARC)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-05-24", "journal": {"name": "Proceedings of the 36th International Symposium on Automation and Robotics in Construction (ISARC)"}, "authors": [{"authorId": "102106806", "name": "Worawan Natephra"}, {"authorId": "1857161", "name": "A. Motamedi"}], "citations": [{"paperId": "b975dcecb9fec1cdf88d3a71bcb6210ecbf974b7", "title": "Augmented Reality-Based Real-Time Visualization for Structural Modal Identification"}, {"paperId": "8fd438f1b89ed046c1d32203186a4191feae6a9a", "title": "Mixed reality and the Internet of Things: Bridging the virtual with the real"}, {"paperId": "7e658bd6f6fa308240a92cc9ae76d1e0fce52a26", "title": "Design and Implementation of Industrial Auxiliary System Based on Hololens"}, {"paperId": "e3cc918804d7d51c37c5bc91148569cfb9511c77", "title": "Digital twins in lean construction: a neutrosophic AHP – BOCR analysis approach"}, {"paperId": "34742774718a5d273701d2b7c14f1349128876b6", "title": "Key functions in BIM-based AR platforms"}, {"paperId": "082905f045ef4684acb2aea0ab48712e401f8d04", "title": "Ambient Intelligence for Next-Generation AR"}, {"paperId": "fd662e8d5dac00c6d3b90d1c5251c909c853a255", "title": "Building Information Modeling (BIM) and Robotic Manufacturing Technological Interoperability in Construction – A Cyclic Systematic Literature Review"}, {"paperId": "ba613154a6e8bc55f9eb7f137df04615fc1f14fd", "title": "HomeView: Automatically Building Smart Home Digital Twins With Augmented Reality Headsets"}, {"paperId": "d8d74fead4af75b32b336583fe03f67aae1beb7b", "title": "Building Information Modelling (BIM) Capabilities in the Design and Planning of Rural Settlements in China: A Systematic Review"}, {"paperId": "c3b5178b8003e2a0648d359cc4c0187408fa2776", "title": "BUILDING DIGITAL TWINS FOR SMART CITIES: A CASE STUDY IN GREECE"}, {"paperId": "edd63f4f095e2408d688f30cb32772fcec214718", "title": "MyComfort: An integration of BIM-IoT-Machine Learning for optimizing indoor thermal comfort based on User Experience"}, {"paperId": "9dee17d7befb413467601cd15746acde69916c80", "title": "Potentials and Challenges in Combining the Internet of Things and Augmented Reality: a Systematic Literature Review"}, {"paperId": "99b7d3704187ec7123b65705ab7d53fe177d5df3", "title": "Integrating internet of things and mixed reality to teach performance-based architectural design: a case study of shading devices"}, {"paperId": "a3231cdbc86ddf706c093f9ab80d671f89d9504c", "title": "Interactions in Augmented and Mixed Reality: An Overview"}, {"paperId": "db8d2466fe5116d14b440d45cca0511dbbc55e8a", "title": "Dynamic Predicted Mean Vote: An IoT-BIM integrated approach for indoor thermal comfort optimization"}, {"paperId": "af08fc77b706a63419a5f682e3f5e3ecc0237085", "title": "Application of Low-Cost Sensors for Building Monitoring: A Systematic Literature Review"}, {"paperId": "7514e749fc10633bbb4ece5a6a21271eb9a9c7a2", "title": "USE OF AUGMENTED REALITY FOR EFFICIENT BUILDING MAINTENANCE IN SRI LANKA"}, {"paperId": "69c8da37177872ec944726e15f62522dd7c5a120", "title": "BIM- and IoT-based virtual reality tool for real-time thermal comfort assessment in building enclosures"}, {"paperId": "09866d3f1f4f1ecbfccfdeaff344428140473560", "title": "A low-cost multi-user augmented reality application for data visualization"}, {"paperId": "a159c5d3cf4ad0ff970e1593f4c67323e622dd4d", "title": "Thermal comfort practices for precast concrete building construction projects: towards BIM and IOT integration"}, {"paperId": "cf2a54ca2e35912fa1ed5166da02b3f50fafb880", "title": "BIM and IoT Sensors Integration: A Framework for Consumption and Indoor Conditions Data Monitoring of Existing Buildings"}, {"paperId": "7be142c6a092ade71d6f9cb560a2abb5afe0b553", "title": "From BIM to digital twins: a systematic review of the evolution of intelligent building representations in the AEC-FM industry"}, {"paperId": "397f15735a4f267574245beba7f3501e671e780c", "title": "3D IoT System for Environmental and Energy Consumption Monitoring System"}, {"paperId": "17615911fd90a0f7edf9d729eec8282124d34c78", "title": "An Ontology-Based Mediation Framework for Integrating Federated Sources of BIM and IoT Data"}, {"paperId": "bbd1e5cb9c3d090f5b762596aa9746f321bf9f37", "title": "A Systematic Review of the Digital Transformation of the Building Construction Industry"}, {"paperId": "98d7e9c6b4b6f3b813daedd9a1d32cff6a3ea20a", "title": "Visualizing code reviews bottlenecks, from 2D to virtual reality"}, {"paperId": "a51953534eaf4f5e7c725232805f2a5965f7fe4d", "title": "Immersive Mixed Reality experience empowered by the Internet of Things and Geospatial Technologies"}, {"paperId": "33b3f0a74de4feef70374cc3b04cf99a5f6b23ce", "title": "Fault-detection through integrating real-time sensor data into BIM"}]}
