{"paperId": "6a893973e09c42f8fa8cfaff89217bb03c9190a0", "publicationVenue": {"id": "7eadf6d0-2d35-410f-ad53-2635d1f830d7", "name": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "type": "conference", "alternate_names": ["IAEAC", "IEEE Adv Inf Technol Electron Autom Control Conf"]}, "title": "Cocktail: A hybrid system combining Hadoop and Storm", "abstract": "Hadoop and Storm are playing a significant role in Cloud Computing and either of them has its own applicable area. Cocktail is a new hybrid system that combines Hadoop and Storm into one single system, leveraging the functions of two computing frameworks. The design and implementation of Cocktail includes a SQL-like query language making the implementation of details transparent for users, an intelligent framework selector based on cost model to choose appropriate framework automatically, and an efficient resource scheduling and task execution framework. Cocktail has a wide range of application scenarios from batch processing to stream computing, using Storm to process real-time data and Hadoop to process large-scale data. We compare the performance, throughput and scalability of Cocktail with SummingBird to demonstrate the practicability and capability. According to benchmark, for small-scale data, the performance of Cocktail is close to Summingbird based on Storm and 20%~40% faster than Summingbird based on Hadoop. And for large-scale data, Cocktail's throughput is 40% higher than Summingbird's throughout based on Storm.", "venue": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2015-12-01", "journal": {"name": "2015 IEEE Advanced Information Technology, Electronic and Automation Control Conference (IAEAC)", "pages": "20-25"}, "authors": [{"authorId": "40560637", "name": "Yong Zhao"}, {"authorId": "2153391686", "name": "Ying Zhang"}, {"authorId": "49483329", "name": "Yiting Yao"}, {"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "145779142", "name": "Peng Liu"}], "citations": []}
