{"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "publicationVenue": null, "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics", "abstract": "Choosing a good resource configuration for big data analytics applications can be challenging, especially in cloud environments. Automated approaches are desirable as poor decisions can reduce performance and raise costs. The majority of existing automated approaches either build performance models from previous workload executions or conduct iterative resource configuration profiling until a near-optimal solution has been found. In doing so, they only obtain an implicit understanding of the underlying infrastructure, which is difficult to transfer to alternative infrastructures and, thus, profiling and modeling insights are not sustained beyond very specific situations.We present Perona, a novel approach to robust infrastructure fingerprinting for usage in the context of big data analytics. Perona employs common sets and configurations of bench- marking tools for target resources, so that resulting bench- mark metrics are directly comparable and ranking is enabled. Insignificant benchmark metrics a red iscarded by learning a low-dimensional representation of the input metric vector, and previous benchmark executions are taken into consideration for context-awareness as well, allowing to detect resource degradation. We evaluate our approach both on data gathered from our own experiments as well as within related works for resource configuration optimization, demonstrating that Perona captures the characteristics from benchmark runs in a compact manner and produces representations that can be used directly.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-15", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "209-216"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2069538665", "name": "Soeren Becker"}, {"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "4c27e561d7c0a78fc4f7593235c021d08ab6e1e0", "title": "Towards Advanced Monitoring for Scientific Workflows"}]}
