{"paperId": "6aa7a16965067fd5a94683d3b9d1e17afc4f6223", "publicationVenue": null, "title": "Mining the Relationship between Teacher Behavior, Eye-Gaze and Gesture in Classroom Teaching: A Multi-Dimension Analysis Approach", "abstract": "Despite the continuous emphasis on the relationship between teacher behavior, eye-gaze and gesture in classroom teaching, it still lacks supportive data to validate the fine-grained relationship. In this study, the 27 instructors’ teaching presence at different levels (ABC-level) was analyzed to summarize the rules of teacher behavior, eye-gaze and gesture in classroom teaching, and explore the internal transformation mechanism and interaction mechanism generated by teacher behavior, eye-gaze and gesture. We firstly developed category of teacher behavior, eye-gaze and gesture in classroom teaching by combining visual and auditory features. Then, lag sequential analysis (LSA) and association analysis (Apriori) were used to explore the internal transformation mechanism and mine the interaction mechanism generated of teacher behavior, eye-gaze and gesture. The findings indicate that there are some differences in different level groups and frequency distributions of subclasses of teacher behavior, eye-gaze and gesture. A-level group has the highest behavioral sequences of teacher behavior, eye-gaze and gesture, while B-level group has the lowest behavioral sequences of teacher behavior, eye-gaze and gesture. Moreover, both teacher verbal behavior and nonverbal behavior were accompanied with the characteristics of nonverbal behavior such as teacher eye-gaze and gesture. This study can give the instructors some implications on teaching practices.", "venue": "2023 International Conference on Intelligent Education and Intelligent Research (IEIR)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-05", "journal": {"name": "2023 International Conference on Intelligent Education and Intelligent Research (IEIR)", "pages": "1-6"}, "authors": [{"authorId": "2111304680", "name": "Gang Zhao"}, {"authorId": "2067736061", "name": "J. Chu"}, {"authorId": "48506860", "name": "Wenjuan Zhu"}, {"authorId": "2279750257", "name": "Jing Wang"}, {"authorId": "2279739227", "name": "Qing Xia"}], "citations": []}
