{"paperId": "6ab84d3043a479da247d8e671a914a870ad0bc1b", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Probability Density Forecasting of Wind Power Based on Transformer Network with Expectile Regression and Kernel Density Estimation", "abstract": "A comprehensive and accurate wind power forecast assists in reducing the operational risk of wind power generation, improves the safety and stability of the power system, and maintains the balance of wind power generation. Herein, a hybrid wind power probabilistic density forecasting approach based on a transformer network combined with expectile regression and kernel density estimation (Transformer-ER-KDE) is methodically established. The wind power prediction results of various levels are exploited as the input of kernel density estimation, and the optimal bandwidth is achieved by employing leave-one-out cross-validation to arrive at the complete probability density prediction curve. In order to more methodically assess the predicted wind power results, two sets of evaluation criteria are constructed, including evaluation metrics for point estimation and interval prediction. The wind power generation dataset from the official website of the Belgian grid company Elia is employed to validate the proposed approach. The experimental results reveal that the proposed Transformer-ER-KDE method outperforms mainstream recurrent neural network models in terms of point estimation error. Further, the suggested approach is capable of more accurately capturing the uncertainty in the forecasting of wind power through the construction of accurate prediction intervals and probability density curves.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-01", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2210431610", "name": "Haoyi Xiao"}, {"authorId": "2202044225", "name": "Xiaoxia He"}, {"authorId": "2109498685", "name": "Chunli Li"}], "citations": [{"paperId": "6c640f1008a3ccb2bcfe9bb5ccec0cd9e1997863", "title": "Wind power forecasting based on manifold learning and a double-layer SWLSTM model"}, {"paperId": "fe869bf4fab667d518084b9acb0cf967eab2325d", "title": "Spatial difference analysis and dynamic evolution prediction of urban industrial integrated water use efficiency in China"}, {"paperId": "aa5cc1738cbd2a432229d1e05f23f7cd09e5a89b", "title": "Wind power interval and point prediction model using neural network based multi-objective optimization"}, {"paperId": "1dc5b11d74c42f72f2edd18bda96429125a8cf2d", "title": "Electromagnetic Vibration Characteristics of Inter-Turn Short Circuits in High Frequency Transformer"}]}
