{"paperId": "6ab8a18b212f56247bf8b8bb3c505f8618cbcef5", "publicationVenue": {"id": "42681028-633b-4868-8470-b6f21685ef49", "name": "Revista d'innovació docent universitària", "alternate_names": ["Rev d'innovació docent univ"], "issn": "2013-2298", "url": "https://www.raco.cat/index.php/RIDU", "alternate_urls": ["https://revistes.ub.edu/index.php/RIDU", "https://dialnet.unirioja.es/servlet/revista?codigo=23188"]}, "title": "Percepción de utilidad de las herramientas de Moodle y uso del campus virtual por estudiantes del Grado en Podología", "abstract": "Este trabajo analiza la utilidad percibida por los estudiantes y el uso que realizaron del campus virtual (CV) de la asignatura Ortopodología I del Grado en Podología en el curso académico 2019-20. La percepción de utilidad se estudió a través de una encuesta y para analizar el uso se exportaron y depuraron los registros generados en Moodle. Se analizó la relación entre el uso del CV y el rendimiento académico, el sexo y la edad. Participaron 106 estudiantes que generaron un total de 53.397 registros. El 33,96% de la clase cumplimentó la encuesta. El número medio de acciones registradas fue de 503,75±226,26. Las acciones con mayores registros fueron los accesos al sistema (38,67%), a los recursos (19,54%) y los cuestionarios (10,11%). Al 97,2% de los encuestados les gustó el planteamiento de la asignatura en el CV y el 58% valoró como buenos los contenidos. Las herramientas y elementos de aprendizaje mejor valorados fueron los documentos del profesor, los vídeos y el correo electrónico. Por el contrario, las tareas grupales fueron las peor valoradas. En conclusión, se ha observado un alto uso del CV y los contenidos y herramientas disponibles han sido consideradas muy útiles por los estudiantes.", "venue": "Revista d'innovació docent universitària", "year": 2021, "fieldsOfStudy": ["Art"], "publicationTypes": null, "publicationDate": "2021-01-30", "journal": {"name": "Revista d'Innovació Docent Universitària"}, "authors": [{"authorId": "2089952880", "name": "Yolanda Fuentes-Peñaranda"}, {"authorId": "1435598844", "name": "A. Álvarez-Méndez"}, {"authorId": "1435501500", "name": "M. T. Angulo-Carrère"}, {"authorId": "2089684210", "name": "M. P. Álvarez-Vázquez"}], "citations": []}
