{"paperId": "6ab929b01d302bcebf288fef37362550ec6f363f", "publicationVenue": {"id": "23f8fe4c-6537-4027-a334-6a5863115984", "name": "Cybersecurity and Cyberforensics Conference", "type": "conference", "alternate_names": ["Chin Control Conf", "Computational Complexity Conference", "CCC", "Comput Complex Conf", "Cybersecur Cyberforensics Conf", "Conference on Computational Complexity", "Computing Colombian Conference", "Conf Comput Complex", "Comput Colomb Conf", "Chinese Control Conference"], "url": "http://computationalcomplexity.org/"}, "title": "Cloud Based Temperature and Humidity Alert System to Prevent Food Poisoning", "abstract": "Internet of things (IoT) is an emerging technology that has transformed the automation systems to next level. A repetitive observation of a natural phenomenon manually has been successfully replaced by the IoT systems. A compact IoT system with electronic equipment's is synced together to provide a service which is more accurate than the human ability. Avoiding major calamities in industries or even a minor issue of observing the temperature of a \"chicken pie\" in a petrol station can result in cumulative loss to the business. This research has focused on how we can avoid such business losses. This research has focused on monitoring the variations of temperature of any object environment and providing required actions with an accurate decision. We have implemented a prototype of temperature and humidity monitoring and alert system using cloud-based architecture to prevent food poisoning. Hazardous food needs to be kept at certain temperatures and humidity settings to prevent food-poisoning bacteria, which may be present in the food, from multiplying to dangerous levels. Our temperature and humidity alert system has been tested in the food chambers of a 7Eleven shop that requires monitoring continuously to prevent the growth of bacteria if any. Our proposed cloud-based temperature and humidity alert system is very cheap and easy for deployment and it is accessible from the Internet and can send email notifications. We have conducted experiments to evaluate the system performance and the result shows that the prototype has been quite successful in monitoring the temperature and humidity of the food environments.", "venue": "Cybersecurity and Cyberforensics Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-05-01", "journal": {"name": "2019 Cybersecurity and Cyberforensics Conference (CCC)", "pages": "1-5"}, "authors": [{"authorId": "2150685019", "name": "Hiten Patel"}, {"authorId": "1380234442", "name": "Sajan Sheth"}, {"authorId": "38384486", "name": "S. M. Farhad"}], "citations": [{"paperId": "5a197117856461762943cc2d2d9305679eaa4901", "title": "Characterization of Heterostructure Capacitive Humidity Sensor Using Indirect Capacitance to Voltage Converter Circuit"}, {"paperId": "34e018c9214481e1a85b19a68cfea6abeba01e3f", "title": "Traceability system using IoT and forecasting model for food supply chain"}, {"paperId": "7b207487f9f7f3c571ffedce8d348e0d1bcebc5a", "title": "ZnO ALD-Coated Microsphere-Based Sensors for Temperature Measurements"}, {"paperId": "d03bca74579259533fd75bb0cbcbc56e34430887", "title": "Efficient App Based Smart Door Lock System Using Bluetooth"}, {"paperId": "b2007555dc87a367a988c5c9ae266c599062e283", "title": "Reliable and Convenient Smart Light Control System Using Mobile App"}, {"paperId": "5670ce06f2437c966b526e1dcccb8483c74621e8", "title": "Realizing an Efficient IoMT-Assisted Patient Diet Recommendation System Through Machine Learning Model"}, {"paperId": "0810736df7b15cc867a52f3a7ac9e5cc9f3e473c", "title": "Smart Fire-Alarm System for Home"}, {"paperId": "bd1ffb44ef305040fdeed2d08070adab88421d14", "title": "Review on Efficient Food Waste Management System Using Internet of Things"}]}
