{"paperId": "6abdbbc12c92c361673ba4d2eb4df1b1f1f21de8", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "Noninvasive MapReduce Performance Tuning Using Multiple Tuning Methods on Hadoop", "abstract": "There are more than 190 configuration parameters affecting the performance of MapReduce jobs on Hadoop. It is time-consuming and tedious for general users who have no deep knowledge of Hadoop configuring to tune the parameters of a MapReduce job for optimal performance. Therefore, a self-tuning system to improve MapReduce performance in an automated and efficient manner in a complicated Hadoop environment is needed. This article explores multiple tuning methods to improve tuning efficiency for MapReduce performance on Hadoop. The proposed Catla system employs succinct templates and proper schemes of MapReduce algorithms, which can be incorporated in facilitating the tuning and optimization of MapReduce performance. A comprehensive evaluation of the Catla system, with the support of multiple tuning approaches, is discussed in this article. Direct search-based and derivative-free optimization-based tuning techniques for improved efficiency and usability are evaluated using a series of tuning experiments. The experimental results reveal that our work can identify optimal Hadoop parameters for deployed MapReduce jobs in a noninvasive, flexible, automated, and comprehensive manner.", "venue": "IEEE Systems Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "IEEE Systems Journal", "pages": "2906-2917", "volume": "15"}, "authors": [{"authorId": "50536257", "name": "Donghua Chen"}, {"authorId": "36444740", "name": "Runtong Zhang"}, {"authorId": "1809706", "name": "R. Qiu"}], "citations": [{"paperId": "644c85e47f2bf6f9281f360c6c1b62e6a1a43613", "title": "An Optimal Method for Testing Jobs' Execution in MapReduce Based Systems"}, {"paperId": "da7e42c3c6940941b0e3a55f200c385c75e8b9a7", "title": "MapReduce-Based Dynamic Partition Join with Shannon Entropy for Data Skewness"}, {"paperId": "a976b06dc13def22bab2ece83e467ebed5113816", "title": "Simulation Research on Fast Matching of Big Data Based on Spark"}]}
