{"paperId": "6ac1749272c9d2db025a6e26b3166555382db5bc", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Recent Advances in Data Engineering for Networking", "abstract": "This tutorial paper examines recent advances in data engineering, focusing on aspects of network management and orchestration. We provide a comprehensive analysis of standardization efforts as well as platform development activities related to data engineering driven network design. We then focus on the integration aspects of the data engineering ecosystem and telecommunication networks. The results of our tutorial investigation show that despite various efforts towards standardization and network management and orchestration platforms, there is still a significant gap in applying recent developments in the evolving data engineering world to the telecommunication domain. New advanced functionalities in data engineering as well as clear separations between the building blocks of data engineering pipelines within the proposed standardized architectures have been overlooked or not explored in detail by the standardization or platform development bodies in the telecommunication domain. Therefore, at the end of the paper, we discuss these gaps and research challenges in the context of future development processes for data engineering-driven network design and applications of data engineering concepts in telecommunication networks. We also propose several recommendations for early adoption of these technologies and frameworks in telecommunication infrastructures and platforms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2989469", "name": "E. Zeydan"}, {"authorId": "1399280641", "name": "J. Mangues-Bafalluy"}], "citations": [{"paperId": "ca1ff47be9562694fdb2d1556592ba7314dc1890", "title": "Joint Edge Server Selection and Data Set Management for Federated-Learning-Enabled Mobile Traffic Prediction"}, {"paperId": "28ff7f04a069335412e67c6dd19636d1d49ea809", "title": "Sentiment Identification on Tweets to Forecast Cryptocurrency’s Volatility"}, {"paperId": "97be5a1373e89f29609e792e9dec1ac493a86cef", "title": "Toward a Novel RESTFUL Big Data-Based Urban Traffic Incident Data Web Service for Connected Vehicles"}, {"paperId": "a2e74006f4a291c856fe08bd02504c7c4510127a", "title": "A Novel Approach for Scalable and Sustainable 6G Networks"}]}
