{"paperId": "6aca4077892849600584454449151b9b00bdac11", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Language on Reddit Reveals Differential Mental Health Markers for Individuals posting in Immigration Communities", "abstract": "The experience of immigrating to a foreign land is associated with exposure to new cultures, changes in social networks, and challenges to prevalent systems of meaning. A body of literature has shown that the immigration experience, while pursued with hope of a better quality of life, is associated with adverse effects on immigrants’ mental health and well-being due to sociopolitical and economic factors. In this paper, we study first-hand accounts of struggles with mental health by individuals who participate in immigration communities (aka subreddits) on Reddit, a popular social media platform. First, we compare and contrast the sentiment and content of posts made by individuals in mental health subreddits who also post in immigration subreddits with those of matched group that does not. Second, we adopt the case-crossover approach to evaluate the changes in their mental health language before and after the first post in immigration subreddits. We find that mental health concerns among the individuals posting in immigration subreddits are about race, politics, violence, employment, and affordability whereas among the matched group, mental health posts are about anger and self-harm, family and relationships, swearing, and introspection. We also find that the language of mental health before and after the first post in immigration subreddits evolves from seeking support and therapy to a more concrete and specific discussion around mental health and a positive outlook towards future goals.", "venue": "Web Science Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-04-30", "journal": {"name": "Proceedings of the 15th ACM Web Science Conference 2023"}, "authors": [{"authorId": "17801190", "name": "Juhi Mittal"}, {"authorId": "3093667", "name": "Abha Belorkar"}, {"authorId": "1975159", "name": "V. Jakhetiya"}, {"authorId": "2215523082", "name": "Venu Pokuri"}, {"authorId": "2731733", "name": "Sharath Chandra Guntuku"}], "citations": [{"paperId": "7798dc4f3fd72807d90219df0b95407a174be29a", "title": "Studying Differential Mental Health Expressions in India"}, {"paperId": "3af4a80aa08f7bd34c0a0635a121946493df332a", "title": "Who can help me? Reconstructing users' psychological journeys in depression-related social media interactions"}, {"paperId": "0c52d7997909a981fe0f17207a15952e43b6db4f", "title": "Age-Specific Linguistic Features of Depression via Social Media"}]}
