{"paperId": "6adf085a118f2a1291667b308d5c42564e2362e6", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Jarvis: Large-scale Server Monitoring with Adaptive Near-data Processing", "abstract": "Rapid detection and mitigation of issues that impact performance and reliability are paramount for large-scale online services. For real-time detection of such issues, datacenter operators use a stream processor and analyze streams of monitoring data collected from servers (referred to as data source nodes) and their hosted services. The timely processing of incoming streams requires the network to transfer massive amounts of data, and significant compute resources to process it. These factors often create bottlenecks for stream analytics. To help overcome these bottlenecks, current monitoring systems employ near-data processing by either computing an optimal query partition based on a cost model or using model-agnostic heuristics. Optimal partitioning is computationally expensive, while model-agnostic heuristics are iterative and search over a large solution space. We combine these approaches by using model-agnostic heuristics to improve the partitioning solution from a model-based heuristic. Moreover, current systems use operator-level partitioning: if a data source does not have sufficient resources to execute an operator on all records, the operator is executed only on the stream processor. Instead, we perform data-level partitioning—i.e., we allow an operator to be executed both on a stream processor and data sources. We implement our algorithm in a system called Jarvis, which enables quick adaptation to dynamic resource conditions. Our evaluation on a diverse set of monitoring workloads suggests that Jarvis converges to a stable query partition within seconds of a change in node resource conditions. Compared to current partitioning strategies, Jarvis handles up to 75% more data sources while improving throughput in resource-constrained scenarios by 1.2-4.4×.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-02-12", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "1408-1422"}, "authors": [{"authorId": "51265219", "name": "Atul Sandur"}, {"authorId": "2115224084", "name": "Chanho Park"}, {"authorId": "2785592", "name": "Stavros Volos"}, {"authorId": "1725306", "name": "G. Agha"}, {"authorId": "2421588", "name": "Myeongjae Jeon"}], "citations": [{"paperId": "89775082b227f85c5ba37d95515301efaa344497", "title": "Demystifying the Cost of Serverless Computing: Towards a Win-Win Deal"}, {"paperId": "f215148420a5be22282e9d136af693df52677adb", "title": "When Giant Language Brains Just Aren't Enough! Domain Pizzazz with Knowledge Sparkle Dust"}, {"paperId": "989812379b9cdc65b1f4c31b25a573221c7f45df", "title": "Performance, Energy and Parallelism: Using Near Data Processing in Utility and Cloud Computing"}, {"paperId": "0ab920cf42a2310365fee35dd0c453ce8e40cd58", "title": "PHP Implementation of a Comprehensive Evaluation Platform for Innovative Talent Training Quality based on Internet Data Clustering and Integration"}, {"paperId": "8fa23bd9a58965f0bca3bf40888afcf75be8486f", "title": "Streaming Analytics with Adaptive Near-data Processing"}, {"paperId": "5e8aa2fdfdc6839c629441a5f2a8ceb3399a04ee", "title": "Sponge: Fast Reactive Scaling for Stream Processing with Serverless Frameworks"}, {"paperId": "2fdcbb513c64f0e78bc3c4749f7d159bafd988f3", "title": "W HEN G IANT L ANGUAGE B RAINS"}]}
