{"paperId": "6ae4e31909f7186712bc4a48ccb2258ab6e3d5b1", "publicationVenue": null, "title": "Smart Contract Applications within Blockchain Technology: A Systematic Mapping Study", "abstract": "Blockchain has become another new information revolution after the Internet, and to a certain extent, like the Internet, will change the existing production relations and business logic. With the advent of blockchain, smart contracts have become one of the most sought-after technologies. Its high customizability becomes the key to implement blockchain technology in multiple fields ranging from financial services, life sciences and healthcare to energy resources and voting. However, due to the infancy, challenges are put forward as smart contracts widespread deployment. This study aims to contribute a comprehensive overview on smart contract within blockchain technology. Based on systematic mapping study, we offer a broad perspective of current academic research and application areas of smart contracts. First, by using bibliometric mining on 158 smart contract-related papers, we identified publication profiles, research hot trends and research topic clustering. Then, we provide a summary of the areas where smart contracts are used and analyze the pain points, they address. Finally, we identify the bottlenecks that need to be broken and propose research outlook for the future development of this topic. This paper is aimed at providing helpful guidance and reference for future research efforts.", "venue": "2022 7th International Conference on Cyber Security and Information Engineering (ICCSIE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-09-01", "journal": {"name": "2022 7th International Conference on Cyber Security and Information Engineering (ICCSIE)", "pages": "33-39"}, "authors": [{"authorId": "2202133549", "name": "Xiang Cheng"}, {"authorId": "2202080285", "name": "Jiansuer Julaiti"}], "citations": [{"paperId": "09fb2915f04c9b3d01880e7e80be98e280deb44d", "title": "Analysis and design of transparent smart contract based on blockchain technology for supply chain in “Gasol flour” industry"}]}
