{"paperId": "6ae717148e6d7e9024dd440a585e57875f6f26a3", "publicationVenue": {"id": "ba1e9488-a629-4abe-a0c2-ec2c79c91616", "name": "IEEE International Conference on Tools with Artificial Intelligence", "type": "conference", "alternate_names": ["Int Conf Tool Artif Intell", "ICTAI", "IEEE Int Conf Tool Artif Intell", "International Conference on Tools with Artificial Intelligence"], "url": "http://www.wikicfp.com/cfp/program?id=1488"}, "title": "Zero-shot Bilingual App Reviews Mining with Large Language Models", "abstract": "App reviews from app stores are crucial for improving software requirements. A large number of valuable reviews are continually being posted, describing software problems and expected features. Effectively utilizing user reviews necessitates the extraction of relevant information, as well as their subsequent summarization. Due to the substantial volume of user reviews, manual analysis is arduous. Various approaches based on natural language processing (NLP) have been proposed for automatic user review mining. However, the majority of them requires a manually crafted dataset to train their models, which limits their usage in real-world scenarios. In this work, we propose Mini-BAR, a tool that integrates large language models (LLMs) to perform zero-shot mining of user reviews in both English and French. Specifically, Mini-BAR is designed to (i) classify the user reviews, (ii) cluster similar reviews together, (iii) generate an abstractive summary for each cluster and (iv) rank the user review clusters. To evaluate the performance of Mini-BAR, we created a dataset containing 6,000 English and 6,000 French annotated user reviews and conducted extensive experiments. Preliminary results demonstrate the effectiveness and efficiency of Mini-BAR in requirement engineering by analyzing bilingual app reviews.", "venue": "IEEE International Conference on Tools with Artificial Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-11-06", "journal": {"name": "2023 IEEE 35th International Conference on Tools with Artificial Intelligence (ICTAI)", "pages": "898-904"}, "authors": [{"authorId": "2141318649", "name": "Jia-Min Wei"}, {"authorId": "1926878", "name": "A. Courbis"}, {"authorId": "2138701", "name": "Thomas Lambolais"}, {"authorId": "2252574261", "name": "Binbin Xu"}, {"authorId": "2174027760", "name": "P. Bernard"}, {"authorId": "2219924594", "name": "Gérard Dray"}], "citations": []}
