{"paperId": "6aeb161170f2cba8b17fa95d5eba5bc3aed607dc", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Understanding the Incel Community on YouTube", "abstract": "YouTube is by far the largest host of user-generated video content worldwide. Alas, the platform also hosts inappropriate, toxic, and/or hateful content. One community that has come into the spotlight for sharing and publishing hateful content are the so-called Involuntary Celibates (Incels), a loosely defined movement ostensibly focusing on men's issues, who have often been linked to misogynistic views. \nIn this paper, we set out to analyze the Incel community on YouTube by focusing on the evolution of this community over the last decade and understanding whether YouTube's recommendation algorithm steers users towards Incel-related videos. We collect videos shared on Incel-related communities within Reddit, and perform a data-driven characterization of the content posted on YouTube. Among other things, we find that the Incel community on YouTube is getting traction and that during the last decade the number of Incel-related videos and comments rose substantially. Also, we quantify the probability that a user will encounter an Incel-related video by virtue of YouTube's recommendation algorithm. Within five hops when starting from a non-Incel-related video, this probability is 1 in 5, which is alarmingly high as such content is likely to share toxic and misogynistic views.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science", "Sociology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-22", "journal": {"name": "ArXiv", "volume": "abs/2001.08293"}, "authors": [{"authorId": "19307323", "name": "Kostantinos Papadamou"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "1728207", "name": "Emiliano De Cristofaro"}, {"authorId": "2350947", "name": "G. Stringhini"}, {"authorId": "2698864", "name": "Michael Sirivianos"}], "citations": [{"paperId": "16b8329a79620e9d6a28c00b7370343c115777b1", "title": "Learning from the Ex-Believers: Individuals' Journeys In and Out of Conspiracy Theories Online"}, {"paperId": "26c154ac98b220fc1e4530c3f12fe46c80b585f3", "title": "Mainstreaming the Blackpill: Understanding the Incel Community on TikTok"}, {"paperId": "977b7214856aa54ab03ab31fa321f4bd646e63c5", "title": "TUBERAIDER: Attributing Coordinated Hate Attacks on YouTube Videos to their Source Communities"}, {"paperId": "974a976def113733955eedd9e7e605976f3f81b9", "title": "Beyond Black and White: the Intersection of Ideologies in Online Extremist Communities"}, {"paperId": "365848c76c826d23ad0787e5410191f87325cb0a", "title": "Analyzing the Interaction Between Posting Behaviors on Incels.is and Violent Events Perpetrated by Members of the Community"}, {"paperId": "0f62aa1cbd29286df751939d5c5bb30f726bfbfc", "title": "Modeling rabbit-holes on YouTube"}, {"paperId": "a3f541efd530fa5d86d620be82b26e6d53cd184a", "title": "Gateway Entities in Problematic Trajectories"}, {"paperId": "a6bc6cb40b37ea376b8659517bc7afb4f6128119", "title": "A Literature Review of Video-Sharing Platform Research in HCI"}, {"paperId": "f8e424187bb5dbc31d245404b1680509c1279bdb", "title": "CAN TOXIC MASCULINITIES BE DE-RADICALISED?: MAPPING THE DYNAMICS AND SPREAD OF INCEL IDEOLOGY ONLINE"}, {"paperId": "8a82bb5c5a769d2d524d08ecd37220e1ef6713be", "title": "How Auditing Methodologies Can Impact Our Understanding of YouTube's Recommendation Systems"}, {"paperId": "78f783405c74f7ae0ec1ca2cc901d29c19e0e37c", "title": "Radical bubbles on YouTube? Revisiting algorithmic extremism with personalised recommendations"}, {"paperId": "9b6a769a8562674bd4d126d0e810f97172f147c0", "title": "Paying Attention to the Algorithm Behind the Curtain: Bringing Transparency to YouTube's Demonetization Algorithms"}, {"paperId": "eab5d26e695e74d0bf94879ecc3874e5a4af23b8", "title": "The Symbolic Boundary Work of Incels: Subcultural Negotiation of Meaning and Identity Online"}, {"paperId": "4acb4e447ef9f2165ba6a9d9078b6222b6f47b4e", "title": "Hijacking Epistemic Agency: How Emerging Technologies Threaten our Wellbeing as Knowers"}, {"paperId": "b1327aa6afafd030b0e9fb90ea8de247c60d51dd", "title": "Involuntary Celibates and Forensic Psychiatry"}, {"paperId": "19ae652514e52936e99c225e6b676c497355a47f", "title": "Analytics for early detection of insider threat"}, {"paperId": "099206d1660d37b171a6fff4613024247f428154", "title": "Hybride maskuliniteter og hatideologi på nett:"}, {"paperId": "728d06e06fb1c1117ba01341e6b17ddead8ac368", "title": "Race and the language of incels"}, {"paperId": "2c05d09446ae4755e58ba36ab8fba73eeb2cf28b", "title": "Conspiracy Brokers: Understanding the Monetization of YouTube Conspiracy Theories"}, {"paperId": "3d8cd09cc1f778b14d6e7e23096cfdc57688c304", "title": "YouTube, The Great Radicalizer? Auditing and Mitigating Ideological Biases in YouTube Recommendations"}, {"paperId": "f966109a407ec1165c4cfe8b73e12f4ef999de04", "title": "Characterizing Alternative Monetization Strategies on YouTube"}, {"paperId": "48d5e9bfcef04e40a3e6b50524cfde72d9e097ce", "title": "Involuntary Celibacy (Incel) Phenomenon, the Latest Generation of Terrorism?"}, {"paperId": "3802687eb6a9225f6eb5922795ae3e85c9a56ccf", "title": "Incels on Reddit: A study in social norms and decentralised moderation"}, {"paperId": "f7c4832abc25b93cdd0cf6b19ff8017c64db7bfc", "title": "Toxic language in online incel communities"}, {"paperId": "831ead8f6b5fa120f25db757f0fd3067ba2372d8", "title": "\"Goodbye, My Friendcels\": An Analysis of Incel Suicide Posts"}, {"paperId": "9a51eb2a3c2a9e2479c705575637c0c87a2a7bfd", "title": "The incel lexicon: Deciphering the emergent cryptolect of a global misogynistic community"}, {"paperId": "e69ba7eb997d7e1c3376ed41d2bcabc6f1f51747", "title": "Toward Stopping Incel Rebellion: Detecting Incels in Social Media Using Sentiment Analysis"}, {"paperId": "571e16c2a7d08b878573ebf8018cb72d1bec1b8e", "title": "Semantic Knowledge Discovery and Discussion Mining of Incel Online Community: Topic modeling"}, {"paperId": "710e4f01fe1488d6ac36755b4040b7179660e1e4", "title": "Are Anti-Feminist Communities Gateways to the Far Right? Evidence from Reddit and YouTube"}, {"paperId": "a5ff44959b14d38fd82a97cda353ecf886304d9f", "title": "\"It Is Just a Flu\": Assessing the Effect of Watch History on YouTube's Pseudoscientific Video Recommendations"}, {"paperId": "a0e2c8129fa439a5ee36736b10fec6f59003fb4f", "title": "Pseudoscientific Content on YouTube: Assessing the Effects of Watch History on the Recommendation Algorithm"}, {"paperId": "e49e13752a3086a722e572b07c4f322cd350d83a", "title": "Understanding YouTube Communities via Subscription-based Channel Embeddings"}, {"paperId": "1380e43c7298b0f5df83c45473afe31baae44e60", "title": "On the Identification and Forecasting of Hate Speech in Inceldom"}, {"paperId": "6b6ef33297c77328110e7b760c109091ae6a53bf", "title": "“Goodbye, My Friencels”: An Analysis of Incel Suicide Posts"}, {"paperId": "41070bce09c6954150518cbbf38aab8d984acaba", "title": "ExtremeBB: Enabling Large-Scale Research into Extremism, the Manosphere and Their Correlation by Online Forum Data"}, {"paperId": "30206c1ff8c4beecc4718ca72ae058356ccfa05d", "title": "WHAT ARE INCELS? AND SHOULD WE CONSIDER THEIR IDEOLOGY AN EXTREMIST ONE RELATED TO THE FAR-RIGHT?"}, {"paperId": "0b7369a45af941844a72500f12202aa479575c76", "title": "UVM ScholarWorks UVM ScholarWorks Exploring Incel Language and Subreddit Activity on Reddit Exploring Incel Language and Subreddit Activity on Reddit"}, {"paperId": "dc608e2a3d0168ab8d7df3c96abe3d7459a8b193", "title": "Investigating Online Toxicity in Users Interactions with the Mainstream Media Channels on YouTube"}]}
