{"paperId": "6aeb2ebcd80c150a7497550dc59dbeb5e2197c1b", "publicationVenue": null, "title": "Accelerating Business Growth with Big Data and Artificial Intelligence", "abstract": "Artificial Intelligence (AI) is considered to be the fourth industrial revolution. Artificial Intelligence with the help of big data has transformed all industries around the world Artificial intelligence refers to the simulation of human or animal intelligence in computational systems so that they are programmed to think like Intelligent beings and mimic the actions of intelligent entities. Computational systems which have programmed intelligence can solve different real-world problems far more accurately and efficiently than computational systems that are deterministic and hardcoded. Since many problems in business and business analytics cannot be solved by deterministic systems, AI plays a major role in tackling problems in the business world Machine learning and deep learning which are subsets of the field of AI is widely used to solve and optimize many problems in business such as marketing, credit card fraud detection, algorithmic trading, customer service, portfolio management, product recommendation according to the needs of customers, insurance underwriting. AI and big data have revolutionized the business world and this paper discusses some AI and big data technologies that are currently being used to accelerate business growth.", "venue": "2020 Fourth International Conference on I-SMAC (IoT in Social, Mobile, Analytics and Cloud) (I-SMAC)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-10-07", "journal": {"name": "2020 Fourth International Conference on I-SMAC (IoT in Social, Mobile, Analytics and Cloud) (I-SMAC)", "pages": "441-448"}, "authors": [{"authorId": "2022628258", "name": "Awishkar Ghimire"}, {"authorId": "1978790638", "name": "Surendrabikram Thapa"}, {"authorId": "40303403", "name": "A. Jha"}, {"authorId": "1992911761", "name": "Surabhi Adhikari"}, {"authorId": "2119321429", "name": "Ankit Kumar"}], "citations": [{"paperId": "6063da1dba652730ce02eac86a3addfb88736576", "title": "AI-Tutoring in Software Engineering Education"}, {"paperId": "74c1f1fa867a71c4038ccb395585f49eae51d7fb", "title": "Research on the Application of Artificial Intelligence and Big Data Technology in Financial Fraud Detection"}, {"paperId": "4d37aedbe821166c90826678a62d47f77b6c86b6", "title": "Stock Market Prediction Using Deep Reinforcement Learning"}, {"paperId": "a8a9a168c53f5b2fc4d1ba5f490f2b2780a97c8b", "title": "Guest editorial: Artificial intelligence as an enabler for entrepreneurs: an integrative perspective and future research directions"}, {"paperId": "ed6486c8d9d65926fb68a9367aca5f02baad2daa", "title": "Fraud Analytics: A Decade of Research - Organizing Challenges and Solutions in the Field"}, {"paperId": "805fa14448e84c0a89072592a187eca89bbf8e54", "title": "Orfeon: An AIOps framework for the goal-driven operationalization of distributed analytical pipelines"}, {"paperId": "6a522d2127a332d5647786a6ea91e407064a2e23", "title": "Behavior imitation of individual board game players"}, {"paperId": "1ff4757e8274aa31418cfdfa8fd824f148b7122d", "title": "Artificial intelligence (AI) applications for marketing: A literature-based study"}, {"paperId": "e6d111e221b41cd5e5de99305bf95fdb9c67811f", "title": "Fake News Detection Using Machine Learning Algorithms"}, {"paperId": "1620e4457996ea5d2b7913b157d619acaf7e4243", "title": "A Framework on Online Reviews Ranking Based on Set Theory for Mining Using Automated Pipeline"}, {"paperId": "f3eff5977a4d28f8f1340063b707982544346205", "title": "Neural network training with limited precision and asymmetric exponent"}, {"paperId": "631af9df0a04b84e2d7827b285db47de691db770", "title": "CBFF: A cloud-blockchain fusion framework ensuring data accountability for multi-cloud environments"}, {"paperId": "62c833b1548e44bc4c7c59c84c353625556ba060", "title": "Hate Speech Detection Using Natural Language Processing: Applications and Challenges"}, {"paperId": "590bf636234b9ea35d6a40109bc0917c99909950", "title": "Machine Learning and IoT based solutions for detection of arrhythmia using ECG signals"}, {"paperId": "33737890df66fe72eea8dd76ba4e1a02686b6c5f", "title": "Distributed model for customer churn prediction using convolutional neural network"}, {"paperId": "c19ce2433ff2246ed8b9e87632680db1059e7001", "title": "Fake Currency Detection with Machine Learning Algorithm and Image Processing"}, {"paperId": "fbe18584345c6ae99559125c250d6eae4b85b8cb", "title": "Sentiments Detection for Amazon Product Review"}, {"paperId": "1ee7019528922a98ef650a6d397709d93454fe35", "title": "A Review of AI for Urban Planning: Towards Building Sustainable Smart Cities"}, {"paperId": "9ed0d170fd559046a68ac8ab4916422ec198fade", "title": "Crack Detection of Structures using Deep Learning Framework"}, {"paperId": "f86ff52da3a20d85dde462d31e8bd2863102fa2f", "title": "Dog Breed Classifier for Facial Recognition using Convolutional Neural Networks"}, {"paperId": "9f934e02a670e48aca99415c24442893c46b54c9", "title": "Cognitive Internet of Things (IoT) and computational intelligence for mental well-being"}, {"paperId": "2400d4966d9f83ed4051c4a678b0f67e58c0b2c5", "title": "Field Programmable Gate Array (FPGA) Based IoT for Smart City Applications"}, {"paperId": "7744067e455caf7f89e68c4a3b00ff09d76c1a02", "title": "Indoor safety monitoring system using IoT in workplace environment for protection against Covid-19"}]}
