{"paperId": "6aede2ac2edb5bc94aa4222f4ab80c532f735024", "publicationVenue": {"id": "ba34e8e3-3ff1-4891-933c-49f34b458836", "name": "Scientia Iranica. International Journal of Science and Technology", "type": "journal", "alternate_names": ["Sci Iran Int J Sci Technol", "Sci Iran", "Scientia Iranica"], "issn": "1026-3098", "alternate_issns": ["2345-3605"], "url": "http://www.sciencedirect.com/science/journal/10263098?sdc=1", "alternate_urls": ["http://scientiairanica.sharif.edu/"]}, "title": "A novel selective clustering framework for appropriate labeling of the clusters based on K-means algorithm", "abstract": "Clustering is one of the main methods of data mining. K-means algorithm is one of the most common clustering algorithms due to its efficiency and ease of use. One of the challenges of clustering is to identify the appropriate label for each cluster. The selection of a label is done in such a way as to provide a proper description of the cluster records. In some cases, choosing the appropriate label is not easy due to the results and structure of each cluster. The aim of this study is to present an algorithm based on the K-means clustering in order to facilitate the allocation of labels to each cluster. Moreover, in many data mining issues, the data set contains a large number of fields and therefore, the identification of the fields and the extraction of subsets from the required fields is an important issue. With the help of the proposed algorithm, the important and influential variables of the data set would be identified and the subset of the required fields would be selected.", "venue": "Scientia Iranica. International Journal of Science and Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-02-17", "journal": {"name": "Scientia Iranica"}, "authors": [{"authorId": "89615937", "name": "F. Moslehi"}, {"authorId": "34900201", "name": "A. Haeri"}, {"authorId": "98182659", "name": "M. Gholamian"}], "citations": [{"paperId": "8b0a2393e5b0a0bf6c01797afb8c35d4ee88a470", "title": "Identification of Location for Police Headquarters to Deal with Crime Against Women in India Using Clustering Based on K-Means Algorithm"}, {"paperId": "a5781357ff7f89353da3e30aa8061a5828e5c79f", "title": "Generating balanced and strong clusters based on balance-constrained clustering approach (strong balance-constrained clustering) for improving ensemble classifier performance"}, {"paperId": "9c1dbcf400463818f8ac6b5929ce145b7d110c58", "title": "Understanding the influence of building characteristics on enhancing energy efficiency in residential buildings: A data mining based study"}, {"paperId": "58928b29a509e87ae8c62be12a480c497c075733", "title": "A hybrid reciprocal model of PCA and K-means with an innovative approach of considering sub-datasets for the improvement of K-means initialization and step-by-step labeling to create clusters with high interpretability"}, {"paperId": "1bd56a3fb5802ccf1a7bbae07fd23b4157fa962f", "title": "Combining the Active Learning Algorithm Based on the Silhouette Coefficient with PCKmeans Algorithm"}, {"paperId": "c656198a967575962a4af795adc8f5cf78b02038", "title": "Analysis of the Impact of Residential Property and Equipment on Building Energy Efficiency and Consumption—A Data Mining Approach"}, {"paperId": "3c686af41819af53519d5c6869ebcaa7bb17e5bf", "title": "A heuristic method for choosing 'virtual best' DMUs to enhance discrimination power of augmented DEA model"}, {"paperId": "b24e163980469ec71778e06603c502315aadca4b", "title": "A novel hybrid GA–PSO framework for mining quantitative association rules"}, {"paperId": "16e8899b0a83ab09f0e06eac9ed7690c6613c2a3", "title": "A novel hybrid wrapper–filter approach based on genetic algorithm, particle swarm optimization for feature subset selection"}]}
