{"paperId": "6af226bd8caf280fd787b886469d06daac7f5b87", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Development of a machine-learning model to assess terminal ileum Endoscopic healing in pediatric Crohn's disease from Magnetic Resonance Enterography data", "abstract": "Background and Aims: Endoscopic healing (EH), is a major treatment goal for Crohn's disease(CD). However, terminal ileum (TI) intubation failure is common, especially in children. We evaluated the added-value of machine-learning models in imputing a TI Simple Endoscopic Score for CD (SES-CD) from Magnetic Resonance Enterography (MRE) data of pediatric CD patients. Methods: This is a sub-study of the prospective ImageKids study. We developed machine-learning and baseline linear-regression models to predict TI SES-CD score from the Magnetic Resonance Index of Activity (MaRIA) and the Pediatric Inflammatory Crohn's MRE Index (PICMI) variables. We assessed TI SES-CD predictions' accuracy for intubated patients with a stratified 2-fold validation experimental setup, repeated 50 times. We determined clinical impact by imputing TI SES-CD in patients with ileal intubation failure during ileocolonscopy. Results: A total of 223 children were included (mean age 14.1+-2.5 years), of whom 132 had all relevant variables (107 with TI intubation and 25 with TI intubation failure). The combination of a machine-learning model with the PICMI variables achieved the lowest SES-CD prediction error compared to a baseline MaRIA-based linear regression model for the intubated patients (N=107, 11.7 (10.5-12.5) vs. 12.1 (11.4-12.9), p<0.05). The PICMI-based models suggested a higher rate of patients with TI disease among the non-intubated patients compared to a baseline MaRIA-based linear regression model (N=25, up to 25/25 (100%) vs. 23/25 (92%)). Conclusions: Machine-learning models with clinically-relevant variables as input are more accurate than linear-regression models in predicting TI SES-CD and EH when using the same MRE-based variables.", "venue": "medRxiv", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-09-06", "journal": null, "authors": [{"authorId": "2125707552", "name": "Itai Guez"}, {"authorId": "35674267", "name": "G. Focht"}, {"authorId": "108279951", "name": "M. Greer"}, {"authorId": "1417443412", "name": "R. Cytter-Kuint"}, {"authorId": "3886495", "name": "L. Pratt"}, {"authorId": "21357833", "name": "D. Castro"}, {"authorId": "2276761717", "name": "Dan Turner"}, {"authorId": "2271915143", "name": "A. Griffiths"}, {"authorId": "2276759568", "name": "Moti Freiman"}], "citations": []}
