{"paperId": "6b058de401e205c37003471b4f19f5247530a021", "publicationVenue": null, "title": "Performance Comparison of Apache Hadoop and Apache Spark for COVID-19 data sets", "abstract": "Nowadays the world is fighting against a global pandemic Covid-19 that has resulted in more than 5 million deaths and badly impacted world economy. The global spread of COVID-19 has triggered innovative research in the field of distributed computing using Big Data management tools. Big data analytics tools are used to better understand virus spread, to detect and track Covid-19 symptoms, to estimate risk factors, symptoms, diagnostics and other vital information and to control its spread. This paper presents a review of big data solutions that has been adopted to solve research issues in healthcare by performing distributed computing on massive datasets. In the proposed work, Apache Hadoop with MapReduce framework and Spark is used to perform analytics on Covid-19 datasets in parallel and distributive manner. Both frameworks have configuration parameters which can be modified to facilitate job performance and efficiency. This paper compares the performance of two major Bigdata platforms Hadoop and Spark. The execution time and throughput of both frameworks are analyzed with different input data size. The results shows that both platforms can be used to effectively to process huge amount of data in parallel and distributed computing and the performance depends on size of input data and configuration parameters. The results show that Spark has significantly faster computation time than Hadoop for smaller data sets.", "venue": "2022 4th International Conference on Smart Systems and Inventive Technology (ICSSIT)", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-01-20", "journal": {"name": "2022 4th International Conference on Smart Systems and Inventive Technology (ICSSIT)", "pages": "1659-1665"}, "authors": [{"authorId": "145105266", "name": "Mithumary George"}, {"authorId": "3479910", "name": "P. Rasmi"}], "citations": [{"paperId": "94aef5cd0d069f94e0a957f91afaf63d4be4328c", "title": "A hybrid architecture for secure Big-Data integration and sharing in Smart Manufacturing"}, {"paperId": "be2750c87af23b86937a2269c6df2e2420edc506", "title": "Large-scale Information Management using Hadoop Platform"}, {"paperId": "bb16155ce0ae10930d4464257e5698a00a279470", "title": "A Cybersecurity Model for a Roblox-based Metaverse Architecture Framework"}, {"paperId": "acab5fcba45a840f9ea5f5b2e7b45c8a2c22b508", "title": "Evaluation of Distributed Data Processing Frameworks in Hybrid Clouds"}]}
