{"paperId": "6b07780cae7c11d0c60ab0a5793026d76ee5af74", "publicationVenue": {"id": "a46fba42-6eed-4748-ac2f-49cdeff17f9b", "name": "Ingénierie des Systèmes d'Information", "type": "journal", "alternate_names": ["Ingénierie Systèmes d'information", "Ingénierie Systèmes D'information", "Ingénierie Des Systèmes D'information"], "issn": "1633-1311", "url": "http://isi.revuesonline.com/"}, "title": "Predictive Maintenance of Electromechanical Systems Using Deep Learning Algorithms: Review", "abstract": "Predictive Maintenance (PM) is a major part of smart manufacturing in the fourth industrial revolution. The classical fault diagnosis approach for complex systems such as an electromechanical system is not effective. Taking the advantage of the successful implementations of PM together with Deep Learning (DL) methods replaces the conventional diagnosis methods with modern diagnosis methods. This study intends to aid experts, engineers, and technicians in different electromechanical systems in comprehending how the PM used DL methods to find the multi-fault diagnosis. In this direction, this paper presents a comprehensive review of recent works of DL techniques that are applied to PM for electromechanical systems by classifying the research according to equipment, fault, parameters, and method. To perform the review, 30 papers that are published in proceedings and journals are reviewed within a time window between the years 2016 to 2022. In the context of the electromechanical system, it is observed that motors are the most equipment selected for PM. Moreover, stator winding faults are found to be less selected than bearing for diagnosis of the unhealthy status of the motor. In terms of DL methods, the study reveals that AE, LSTM, and CNN are mostly used. In addition, poorly mixed models of DL methods are also noticed. Finally, finding the optimal design variable of the DL architecture was not widely explored.", "venue": "Ingénierie des Systèmes d'Information", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-31", "journal": {"name": "Ingénierie des systèmes d information"}, "authors": [{"authorId": "2201238993", "name": "A. M. Abood"}, {"authorId": "2128400594", "name": "A. R. Nasser"}, {"authorId": "1411638390", "name": "H. Al-Khazraji"}], "citations": [{"paperId": "0262c801deb0a2b1419be45f8e047531021e49a5", "title": "Improved Fault Classification for Predictive Maintenance in Industrial IoT Based on AutoML: A Case Study of Ball-Bearing Faults"}]}
