{"paperId": "6b09064b2a739a3872e153c114b762d01cc71e8b", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Genetic Clustered Federated Learning for COVID-19 Detection", "abstract": "Coronavirus (COVID-19) has caused a global disaster with adverse effects on global health and the economy. Early detection of COVID-19 symptoms will help to reduce the severity of the disease. As a result, establishing a method for the initial recognition of COVID-19 is much needed. Artificial Intelligence (AI) plays a vital role in detection of COVID-19 cases. In the process of COVID-19 detection, AI requires access to patient personal records which are sensitive. The data shared can pose a threat to the privacy of patients. This necessitates a technique that can accurately detect the COVID-19 patients in a privacy preserving manner. Federated Learning (FL) is a promising solution, which can detect the COVID-19 disease at early stages without compromising the sensitive information of the patients. In this paper, we propose a novel hybrid algorithm named genetic clustered FL (Genetic CFL), that groups edge devices based on the hypertuned parameters and modifies the parameters cluster wise genetically. The experimental results proved that the proposed Genetic CFL approach performed better than conventional AI approaches.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-08-29", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2233908185", "name": "Kandati Dasaradharami Reddy"}, {"authorId": "11041265", "name": "T. Gadekallu"}], "citations": [{"paperId": "be96dce8a1f8059a95b9552cca3fb38a518d5448", "title": "Cov-Fed: Federated learning-based framework for COVID-19 diagnosis using chest X-ray scans"}, {"paperId": "d3c618d331d65f0d951754cdbbb45e8379f5253a", "title": "Federated learning with deep convolutional neural networks for the detection of multiple chest diseases using chest x-rays"}, {"paperId": "d2c5611647b98bca0b144bd356b44d670e02ae6c", "title": "Preserving Privacy and Security of Electronic Health Records using Blockchain-based Federated Learning (BFL) Framework"}, {"paperId": "fc10b975239678f6e67de7b7bf83979c1c338b3a", "title": "Recent Methodological Advances in Federated Learning for Healthcare"}, {"paperId": "5f243f2dad823bb835c08d4b3ff6553c28c90a54", "title": "Medical Images Based Covid-19 Detection Survey"}, {"paperId": "a7078507b84aff393ce309abca9faf6fee34729d", "title": "Federated Learning for the Metaverse: A Short Survey"}, {"paperId": "57f7a04ac3e5bf6dc1ca75434835937364bb091c", "title": "Genetic algorithm based multi-resolution approach for de-speckling OCT image"}, {"paperId": "a7f5ef82ef253e4fb3ef0010e29d06c3bf611ca1", "title": "Security and privacy in federated learning: A survey"}, {"paperId": "f303b68681af17490a5d12547b98dc41427394dc", "title": "Computation and Communication Efficient Adaptive Federated Optimization of Federated Learning for Internet of Things"}, {"paperId": "6115503189e91a1d2b7427b87e403ae82e9e99c1", "title": "FedISM: Enhancing Data Imbalance via Shared Model in Federated Learning"}, {"paperId": "bb972cbac558d729584bf4fa3c5cc8eced9a72af", "title": "Blockchain-Based Trusted Federated Learning with Pre-Trained Models for COVID-19 Detection"}, {"paperId": "270641b686f05a537bafb1d9fd35451837325f13", "title": "A review on soft computing approaches for predicting maintainability of software: State‐of‐the‐art, technical challenges, and future directions"}, {"paperId": "0c71362efe4db9ba8ee86df5b75891ab61fcf84a", "title": "Federated Learning Approach for Early Detection of Chest Lesion Caused by COVID-19 Infection Using Particle Swarm Optimization"}, {"paperId": "8a39f3ee1b3f4882446c813ee653d4ba7353bd2f", "title": "DMFL_Net: A Federated Learning-Based Framework for the Classification of COVID-19 from Multiple Chest Diseases Using X-rays"}, {"paperId": "62bcefc753e7023155086ca17041cad47c96bbc4", "title": "SecMDGM: Federated Learning Security Mechanism Based on Multi−Dimensional Auctions"}, {"paperId": "f3482afaed0fb156da81741620a698c9cb6418bf", "title": "Data mining in predicting liver patients using classification model"}, {"paperId": "1ba0d283f20ae5e195f68f8a6f0186445a520990", "title": "A multiple criteria decision analysis based approach to remove uncertainty in SMP models"}, {"paperId": "66628bf02b2f9dead183182c07faefc04f4dc570", "title": "A Systematic Literature Review of Soft Computing Techniques for Software Maintainability Prediction: State-of-the-Art, Challenges and Future Directions"}]}
