{"paperId": "6b27661bf30a7c29d7f54ab0de95249749689531", "publicationVenue": null, "title": "Hadoop-Based University Ideological and Political Big Data Platform Design and Behavior Pattern Mining", "abstract": "The combination of higher education and big data technology is not only the focus of the application of big data technology, but also an emerging field of self-development in the field of higher education. This article is dedicated to building a big data processing platform through Hadoop big data storage architecture, Hive, flume data collection technology, and Sqoop data synchronization technology to achieve efficient processing of big data sets. The traditional data mining algorithm is implemented using Map Reduce programming, and the implementation of the data mining algorithm of the Hadoop platform is studied, mainly to analyze its execution efficiency and scalability. We select the data clustering task in data mining as a representative, and write its Map Reduce version to test and verify its effect on the Hadoop platform. Through comparative experiments of different cluster sizes and different data sizes, it is concluded that the use of Hadoop distributed systems for data mining tasks has a good acceleration ratio and efficiency, and the extended performance analysis of computing power also shows that it has great potential.", "venue": "2020 International Conference on Advance in Ambient Computing and Intelligence (ICAACI)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-09-01", "journal": {"name": "2020 International Conference on Advance in Ambient Computing and Intelligence (ICAACI)", "pages": "47-51"}, "authors": [{"authorId": "2051535234", "name": "Yinwei Li"}, {"authorId": "2051531127", "name": "Dujuan Zhang"}], "citations": [{"paperId": "09db1a8ac2bbf488e86926179f1d09635a0d6842", "title": "Design of ChaApache framework for securing Hadoop application in big data"}, {"paperId": "f20583abdc1ff0a3f4696afba164940da614715c", "title": "AN EFFICIENT APPROACH FOR BIGDATA SECURITY BASED ON HADOOP SYSTEM USING CRYPTOGRAPHIC TECHNIQUES"}, {"paperId": "6caee3f40cfe436093272bcccfc700abae72c291", "title": "Privacy-Preserving High-Order Possibilistic C-Means Algorithm For Big Data Clustering Performance"}]}
