{"paperId": "6b2ce6aa9a5e24ab101b640cac9102ea820b5350", "publicationVenue": {"id": "a0b9dfee-fbf4-4bea-835f-20d6db1ce53a", "name": "ACM Transactions on Management Information Systems", "alternate_names": ["ACM Trans Manag Inf Syst"], "issn": "2158-656X", "url": "http://dl.acm.org/citation.cfm?CFID=72370079&CFTOKEN=39904203&id=J1320", "alternate_urls": ["http://portal.acm.org/tmis", "http://portal.acm.org/citation.cfm?id=J1320&picked=prox", "https://tmis.acm.org/", "http://tmis.acm.org/index.html"]}, "title": "A New Approach for Mining Correlated Frequent Subgraphs", "abstract": "Nowadays graphical datasets are having a vast amount of applications. As a result, graph mining—mining graph datasets to extract frequent subgraphs—has proven to be crucial in numerous aspects. It is important to perform correlation analysis among the subparts (i.e., elements) of the frequent subgraphs generated using graph mining to observe interesting information. However, the majority of existing works focuses on complexities in dealing with graphical structures, and not much work aims to perform correlation analysis. For instance, a previous work realized in this regard, operated with a very naive raw approach to fulfill the objective, but dealt only on a small subset of the problem. Hence, in this article, a new measure is proposed to aid in the analysis for large subgraphs, mined from various types of graph transactions in the dataset. These subgraphs are immense in terms of their structural composition, and thus parallel the entire set of graphs in real-world. A complete framework for discovering the relations among parts of a frequent subgraph is proposed using our new method. Evaluation results show the usefulness and accuracy of the newly defined measure on real-life graphical datasets.", "venue": "ACM Transactions on Management Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-28", "journal": {"name": "ACM Transactions on Management Information System (TMIS)", "pages": "1 - 28", "volume": "13"}, "authors": [{"authorId": "2159579174", "name": "Mohammad Ehsan Shahmi Chowdhury"}, {"authorId": "2168828", "name": "Chowdhury Farhan Ahmed"}, {"authorId": "1726081", "name": "C. Leung"}], "citations": [{"paperId": "070e6ffec106e0622575e5baa4e2bf2531f54d41", "title": "A Transportation Analytic Solution for Predicting Flight Cancellations"}, {"paperId": "55b230e7f85ae0e24e0012bdbb20df581b4848ff", "title": "A Data Science Solution for Analyzing Long COVID Cases"}, {"paperId": "d2492ffc4b2ed5d16b88cf49ea34b8f14febc927", "title": "A Data Discovery and Visualization Tool for Visual Analytics of Time Series in Digital Agriculture"}, {"paperId": "2a9f164025588017cfef3c22e2cbe50a2405b932", "title": "Visual Knowledge Discovery from Public Transit Performance Data"}, {"paperId": "eb21df21d3a4a9d000883ca5e6ebf6fd606af01f", "title": "Mining Sequential Patterns with Timelines from Digital Health Data"}, {"paperId": "e8b4a0d4f5212bf51f6bc72b47aa6fb2b5d4b36a", "title": "A Big Data Science Solution for Transportation Analytics with Meteorological Data"}, {"paperId": "4e1cf5f24a84b0c09b36638dc5c1ead9fc752466", "title": "Social Network Analysis of Popular YouTube Videos via Vertical Quantitative Mining"}, {"paperId": "97a433ee35c70caebea9951e0b8bd9bfaf877881", "title": "Web Mining from Interpretable Compressed Representation of Sparse Web"}, {"paperId": "e1e0c06d55a4e24b27df0a36feae0ab836fd2f7c", "title": "Prediction of Hospital Status of COVID-19 Patients from E-Health Records"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "b78baf42cab8011d464250b357cb93636c13bc80", "title": "Effectively and Efficiently Supporting Predictive Big Data Analytics over Open Big Data in the Transportation Sector: A Bayesian Network Framework"}, {"paperId": "110b15fc83b2cf83bd005c240efa5b5935cbb993", "title": "Q-Eclat: Vertical Mining of Interesting Quantitative Patterns"}, {"paperId": "78fc7a6d3c76473c977b60169e79f10350f5dd08", "title": "A Regression-Based Data Science Solution for Transportation Analytics"}, {"paperId": "98ed3ff2c1bc0d20f65159ecbf619d4a707d5475", "title": "Analysis of Multi-Dimensional Road Accident Data for Disaster Management in Smart Cities"}, {"paperId": "2ca01bba6f4a4007e1b5f6f24d22ce20e30fd8ce", "title": "Transportation Analytics with Fuzzy Logic and Regression"}, {"paperId": "a62c654950ddd8aa117046e61c6080519b50b850", "title": "A Fuzzy-Logic Based Multi-Dimensional Analysis of Traffic Incident Data"}, {"paperId": "72021864c9edff64e60c457b97a2ec18473eff7f", "title": "A Rough Set System for Mining from Streaming Data"}, {"paperId": "c06c005e48ee45bfe3cf7729b9af3c0096a2c4b1", "title": "Visualization and Visual Knowledge Discovery from Big Uncertain Data"}, {"paperId": "bea913e773956b5b9c8520628692a3502b852319", "title": "Data. Information and Knowledge Visualization for Frequent Patterns"}, {"paperId": "cc24cf900e6c50c9b4a0e25af5347e0542da6cdd", "title": "UGMINE: utility-based graph mining"}, {"paperId": "802f6e7a94442efbe65d12e65b531335f6cf649a", "title": "Introduction to the Special Issue on Pattern-Driven Mining, Analytics, and Prediction for Decision Making, Part 1"}]}
