{"paperId": "6b466470c5762f2db7aa998ec2fb2b4e75fddb4c", "publicationVenue": {"id": "f0bbeb15-a4ce-44ef-93f5-4c28a0d7eace", "name": "Journal of Computer Science Research", "type": "journal", "alternate_names": ["Journal of computer science & research", "J comput sci  res", "J Comput Sci Res"], "issn": "2630-5151", "alternate_issns": ["2227-328X"], "url": "https://ojs.bilpublishing.com/index.php/jcsr", "alternate_urls": ["http://www.jcscr.com/"]}, "title": "Outdoor Air Quality Monitoring with Enhanced Lifetime-enhancing Cooperative Data Gathering and Relaying Algorithm (E-LCDGRA) Based Sensor Network", "abstract": "The air continues to be an extremely substantial part of survival on earth. Air pollution poses a critical risk to humans and the environment. Using sensor-based structures, we can get air pollutant data in real-time. However, the sensors rely upon limited-battery sources that are immaterial to be alternated repeatedly amid extensive broadcast costs associated with real-time applications like air quality monitoring. Consequently, air quality sensor-based monitoring structures are lifetime-constrained and prone to the untimely loss of connectivity. Effective energy administration measures must therefore be implemented to handle the outlay of power dissipation. In this study, the authors propose outdoor air quality monitoring using a sensor network with an enhanced lifetime-enhancing cooperative data gathering and relaying algorithm (E-LCDGRA). LCDGRA is a cluster-based cooperative event-driven routing scheme with dedicated relay allocation mechanisms that tackle the problems of event-driven clustered WSNs with immobile gateways. The adapted variant, named E-LCDGRA, enhances the LCDGRA algorithm by incorporating a non-beaconaided CSMA layer-2 un-slotted protocol with a back-off mechanism. The performance of the proposed E-LCDGRA is examined with other classical gathering schemes, including IEESEP and CERP, in terms of average lifetime, energy consumption, and delay", "venue": "Journal of Computer Science Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-13", "journal": {"name": "Journal of Computer Science Research"}, "authors": [{"authorId": "1511524673", "name": "G. P. Agbulu"}, {"authorId": "37243447", "name": "G. J. R. Kumar"}], "citations": []}
