{"paperId": "6b54ea9322a17908309026816c484c2633f0e119", "publicationVenue": {"id": "91b19bbf-b6f0-46c2-bbec-6bcfb5463d4d", "name": "Molecules", "type": "journal", "issn": "1420-3049", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-165877", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-165877", "https://www.mdpi.com/journal/molecules", "https://link.springer.com/journal/40895", "http://www.mdpi.com/journal/molecules/"]}, "title": "Effects of Lycium barbarum L. Polysaccharides on Vascular Retinopathy: An Insight Review", "abstract": "Vascular retinopathy is a pathological change in the retina caused by ocular or systemic vascular diseases that can lead to blurred vision and the risk of blindness. Lycium barbarum polysaccharides (LBPs) are extracted from the fruit of traditional Chinese medicine, L. barbarum. They have strong biological activities, including immune regulation, antioxidation, and neuroprotection, and have been shown to improve vision in numerous studies. At present, there is no systematic literature review of LBPs on vascular retinal prevention and treatment. We review the structural characterization and extraction methods of LBPs, focus on the mechanism and pharmacokinetics of LBPs in improving vascular retinopathy, and discuss the future clinical application and lack of work. LBPs are involved in the regulation of VEGF, Rho/ROCK, PI3K/Akt/mTOR, Nrf2/HO-1, AGEs/RAGE signaling pathways, which can alleviate the occurrence and development of vascular retinal diseases in an inflammatory response, oxidative stress, apoptosis, autophagy, and neuroprotection. LBPs are mainly absorbed by the small intestine and stomach and excreted through urine and feces. Their low bioavailability in vivo has led to the development of novel dosage forms, including multicompartment delivery systems and scaffolds. Data from the literature confirm the medicinal potential of LBPs as a new direction for the prevention and complementary treatment of vascular retinopathy.", "venue": "Molecules", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-08-31", "journal": {"name": "Molecules", "volume": "27"}, "authors": [{"authorId": "83106908", "name": "Chunho Yang"}, {"authorId": "50475660", "name": "Qi Zhao"}, {"authorId": "2166822881", "name": "Shiling Li"}, {"authorId": "2131390938", "name": "Lili Pu"}, {"authorId": "2148641191", "name": "Liqiong Yu"}, {"authorId": "2136359605", "name": "Yaqin Liu"}, {"authorId": "10666287", "name": "Xianrong Lai"}], "citations": [{"paperId": "963be484d0ea7032fc0552e330e0ae3242ecb27f", "title": "In vitro fermentation characteristics and interaction of neutral and acidic polysaccharides from Lycii fructus on human gut microbiota"}, {"paperId": "6e2970ecff2bd3bcd8320ef8e8b960de18bf6008", "title": "Visual fatigue a comprehensive review of mechanisms of occurrence, animal model design and nutritional intervention strategies."}, {"paperId": "c5c3af7bd347a407c40f1541f6c4308e7400ec1d", "title": "Structural characteristics and structure-activity relationship of four polysaccharides from Lycii fructus."}, {"paperId": "3fea7f4d13bff1c8330acb6c917efee7a7193a5e", "title": "Three Major Causes of Metabolic Retinal Degenerations and Three Ways to Avoid Them"}, {"paperId": "b4e9269c622e3c2ba478316d4cdfe19c0a0e9fcc", "title": "Lycium barbarum Ameliorates Neural Damage Induced by Experimental Ischemic Stroke and Radiation Exposure."}, {"paperId": "a9da19aa039b0b0e50e780065be2e0ecdf5f2309", "title": "Distinct Role of Lycium barbarum L. Polysaccharides in Oxidative Stress-Related Ocular Diseases"}, {"paperId": "5793f95ad9e5ce00446b780775fe88f6c8e83440", "title": "Chemical and Biological Properties of Three Poorly Studied Species of Lycium Genus—Short Review"}, {"paperId": "50059d2714fe538a2f68db1460dcd572d3b3ec6b", "title": "A review focusing on the benefits of plant-derived polysaccharides for osteoarthritis."}, {"paperId": "ad00b3eb6220aa3c1ada33b1cc60ef530e3cca6b", "title": "Exploring a novel traditional Chinese medicine prescription containing Chrysanthemi Flos for retinal diseases: an integrated strategy of data mining and network pharmacology"}]}
