{"paperId": "6b675c15c8216ea5bfa6585cd135fd163c402c63", "publicationVenue": null, "title": "Data Stream Classification by Dynamic Incremental Semi-Supervised Fuzzy Clustering", "abstract": "A data stream classification method called DISSFCM (Dynamic Incremental Semi-Supervised FCM) is presented, which is based on an incremental semi-supervised fuzzy clustering algorithm. The method assumes that partially labeled data belonging to different classes are continuously available during time in form of chunks. Each chunk is processed by semi-supervised fuzzy clustering leading to a cluster-based classification model. The proposed DISSFCM is capable of dynamically adapting the number of clusters to data streams, by splitting low-quality clusters so as to improve classification quality. Experimental results on both synthetic and real-world data show the effectiveness of the proposed method in data stream classification.", "venue": "Int. J. Artif. Intell. Tools", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "Int. J. Artif. Intell. Tools", "pages": "1960009:1-1960009:26", "volume": "28"}, "authors": [{"authorId": "31133151", "name": "Gabriella Casalino"}, {"authorId": "39755829", "name": "Giovanna Castellano"}, {"authorId": "1711830", "name": "Corrado Mencar"}], "citations": [{"paperId": "f25fd36224771ce5af404eae49f4e785f7bdf681", "title": "Neighborhood information based semi-supervised fuzzy C-means employing feature-weight and cluster-weight learning"}, {"paperId": "42fb73305c766e52fd0a27e7902071e7fd778e71", "title": "Two Efficient Training Strategies for DyDaSL: A Dynamic Data Stream Learner Framework with Semi-Supervised Learning"}, {"paperId": "b4310b0b2673f4f012f1cce6dce1570056b753c4", "title": "Analysis of Smart Grid Optimal Scheduling considering the Demand Response of Different EV Owners"}, {"paperId": "b5f675c58c6bb1eea0e6eed7e9fcb7bba443e3ee", "title": "Deep Fuzzy Clustering with Political Optimization Enabled Centroid Update Model for Incremental Data Clustering in Mapreduce Framework"}, {"paperId": "d42a8c00552b02d3fabdf70ec88a4e822ed7d82c", "title": "A Semisupervised Concept Drift Adaptation via Prototype-Based Manifold Regularization Approach with Knowledge Transfer"}, {"paperId": "67d85ce90a4df2954ad6651698c79360eeda4c0b", "title": "Fuzzy Linguistic Summaries for Explaining Online Semi-Supervised Learning"}, {"paperId": "238a5b277afc4f743a39ec7aeefa8cc2e216fd9d", "title": "Application of secure semi-supervised fuzzy clustering in object detection from remote sensing images"}, {"paperId": "2cad5aa9aeb8ea7cc69e37fb2ee44f5fc199621b", "title": "A New Approach for Semi-supervised Fuzzy Clustering with Multiple Fuzzifiers"}, {"paperId": "832f8703ca29af939ad3e83e6697e0eb125fc8f7", "title": "Evolving fuzzy neural classifier that integrates uncertainty from human-expert feedback"}, {"paperId": "44448769d2c9adbaea0b26b6208c32760b05eb60", "title": "Confidence path regularization for handling label uncertainty in semi-supervised learning: use case in bipolar disorder monitoring"}, {"paperId": "652dd2e2851d6fcd46b0ebfd694307a8ae1a9155", "title": "AN IMPROVEMENT OF TRUSTED SAFE SEMI-SUPERVISED FUZZY CLUSTERING METHOD WITH MULTIPLE FUZZIFIERS"}, {"paperId": "860cbfc291214e7ddb204a50dd2167a57fc625a2", "title": "Review of ensemble classification over data streams based on supervised and semi-supervised"}, {"paperId": "468edfb14c540fbe71c7cdf07216a9bb20801047", "title": "A Novel Semi-Supervised Fuzzy C-Means Clustering Algorithm Using Multiple Fuzzification Coefficients"}, {"paperId": "404e39b1825972767692bb9b0a858302e41e7d9c", "title": "Incremental Cluster Validity Index-Guided Online Learning for Performance and Robustness to Presentation Order"}, {"paperId": "1e607ebdfad89f8bfa3f1bb6d939d27c6575a625", "title": "Deep semi‐supervised classification based in deep clustering and cross‐entropy"}, {"paperId": "5fae4f13425c23c6fe5eb8916b83ee59b02004fd", "title": "Distributed ledger technology based robust access control and real-time synchronization for consumer electronics"}, {"paperId": "2b69a6235fe1c3f3115a0da6d487e91a80598336", "title": "Comfort Cognitive IoT for Efficient Monitoring and Predictive in Building Management Systems"}, {"paperId": "a0e48fca1cd4e5c8a0867e68dc297d011c20d18f", "title": "Detecção de Anomalias em Logs para Manutenção Preditiva baseada em Sistema Fuzzy Evolutivo Fracamente Supervisionado"}, {"paperId": "f1a4de6e89c225ed36e553b741566fc11deb89f5", "title": "A Dynamic Programming Approach for the Decentralized Control of Discrete Optimizers with Quadratic Utilities and Shared Constraint"}, {"paperId": "66fe82b008c67e91bd047ddbecb1147c7d94f675", "title": "Hyper-Heuristic Framework for Sequential Semi-Supervised Classification Based on Core Clustering"}, {"paperId": "8ff1ef9c80e491f7796d0b4b13cce20227f3077d", "title": "A Synchronized Multi-Unit Wireless Platform for Long-Term Activity Monitoring"}, {"paperId": "6d2aa0b1bda5a8a55a6ad0e8492b1790cc8fc6fe", "title": "Crowd Counting from Unmanned Aerial Vehicles with Fully-Convolutional Neural Networks"}, {"paperId": "f85d73c95e660ab9fc21001f8edd3d46509fe9d2", "title": "An Experimental Validation of the Naïve Approach to Angle of Arrival Estimation for Green WSNs"}, {"paperId": "4d329abbf1e4d38bf4a145b29f2ad35cd672e200", "title": "Educational Stream Data Analysis: A Case Study"}, {"paperId": "71f1c9568c01ae07c0357f3c17ec150421f73357", "title": "The Importance of Data Synchronization in Multiboard Acquisition Systems"}, {"paperId": "d5829afb1d5bb8b78991bd0b438f5989a6df1c46", "title": "Incremental Semi-Supervised Fuzzy C-Means for Bipolar Disorder Episode Prediction"}, {"paperId": "27d08768de1e8af3d7a8b01780a1ff0649a74015", "title": "Real-Time Anomaly Detection in Data Centers for Log-based Predictive Maintenance using an Evolving Fuzzy-Rule-Based Approach"}, {"paperId": "19cdc4c40d78a81a3e78020a87031e381511aa76", "title": "IoT Based Architecture for Model Predictive Control of HVAC Systems in Smart Buildings"}, {"paperId": "a5075a63c6f5a7ca15a621c8be157bbb069c4dab", "title": "A Novel Density Peak Fuzzy Clustering Algorithm for Moving Vehicles Using Traffic Radar"}, {"paperId": "b16d8a3ec1cc9aa22971a9e403384f7c1646675a", "title": "Fuzzy Hoeffding Decision Tree for Data Stream Classification"}, {"paperId": "6e105713813d7993db179fd0c61e960788bd1f88", "title": "Reverse Clustering—The Essence and The Interpretations"}, {"paperId": "ea72f7b3bc6515e009fe2afc3fc579699500cccb", "title": "Dynamic Incremental Semi-supervised Fuzzy Clustering for Bipolar Disorder Episode Prediction"}]}
