{"paperId": "6b6c388fa557fa70e6fd7feac0239dfa57c6caac", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Landslide Risk Evaluation in Shenzhen Based on Stacking Ensemble Learning and InSAR", "abstract": "Construction activities of accelerated urbanization in Shenzhen have increased the landslide risk area, which has intensified the potential threat to human and natural environment. However, the risk of landslides in Shenzhen is poorly evaluated. In this article, a landslide risk evaluation (LRE) model is constructed using landslide susceptibility map (LSM) and landslide vulnerability. In the experiment, a stacking ensemble learning (SEL) model is constructed based on convolutional neural network (CNN), multilayer perceptron, gated recurrent unit (GRU), and support vector machine regression to generate LSM by using topography, geology, human engineering activities, time-series precipitation, and time-series normalized difference vegetation index. Road network, building distribution density and annual average precipitation data are used to evaluate landslide vulnerability based on entropy weight method. In this article, multiple statistical indicators are used to evaluate the performance of the LSM model, and Interferometric Synthetic Aperture Radar (InSAR) deformation data are utilized to verify the LRE results in Shenzhen. The results show that the SEL method has more refined results for LSM, with a best overall evaluation accuracy, especially in the receiver operating characteristic curve, where the accuracy is improved by nearly 8%. In LRE of Shenzhen, very high, high, moderate, low, and very low risk areas account for 0.283%, 0.451%, 0.859%, 36.890%, and 61.517%, respectively. In most of very high-risk area, InSAR deformation results show a clear concentrated deformation trend with a large deformation rate. Research results can provide technical and data support for landslide disaster prevention in Shenzhen.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "1-18", "volume": "16"}, "authors": [{"authorId": "2210541287", "name": "Binghai Gao"}, {"authorId": "2145970171", "name": "Yi He"}, {"authorId": "2047606446", "name": "Xueye Chen"}, {"authorId": "2222473931", "name": "Xiaoyun Zheng"}, {"authorId": "2108025184", "name": "Lifeng Zhang"}, {"authorId": "2223304839", "name": "Qing Zhang"}, {"authorId": "2223000587", "name": "Jiangang Lu"}], "citations": [{"paperId": "0118264ead011fbbf1cdaeb128bba0374e8e617c", "title": "A Spatial Downscaling Framework for SMAP Soil Moisture Based on Stacking Strategy"}, {"paperId": "667d12dad1061a147045ed43f67211fa0692f214", "title": "Improving the capability of water vapor retrieval from Landsat 8 using ensemble machine learning"}, {"paperId": "bc73bf7d1e08ebd600943dcee54688306b3d8cb2", "title": "Thaw Slump Susceptibility Mapping Based on Sample Optimization and Ensemble Learning Techniques in Qinghai-Tibet Railway Corridor"}, {"paperId": "2d30377e0676cc05ccfd89b8c23a779e4e182dc1", "title": "A Multi-Input Channel U-Net Landslide Detection Method Fusing SAR Multisource Remote Sensing Data"}, {"paperId": "d34c8e3dbfcf2e04cce7e96807bc94363663f75c", "title": "The Displacement Analysis and Prediction of a Creeping Ancient Landslide at Suoertou, Zhouqu County, China"}, {"paperId": "a9937a84225fc54a03c32f9faadd1b672f41d2fd", "title": "Spatio-Temporal Characteristics and Driving Mechanism of Alpine Peatland InSAR Surface Deformation—A Case Study of Maduo County, China"}, {"paperId": "21a116ddae1c25190f28b4688acc7bf0cfe4de08", "title": "A Deep Neural Network Framework for Landslide Susceptibility Mapping by Considering Time-Series Rainfall"}]}
