{"paperId": "6b6f7a2bc391b72d02e9962bec5582705440f776", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Financial Market Correlation Analysis and Stock Selection Application Based on TCN-Deep Clustering", "abstract": "It is meaningful to analyze the market correlations for stock selection in the field of financial investment. Since it is difficult for existing deep clustering methods to mine the complex and nonlinear features contained in financial time series, in order to deeply mine the features of financial time series and achieve clustering, a new end-to-end deep clustering method for financial time series is proposed. It contains two modules: an autoencoder feature extraction network based on TCN (temporal convolutional neural) networks and a temporal clustering optimization algorithm with a KL (Kullback–Leibler) divergence. The features of financial time series are represented by the causal convolution and the dilated convolution of TCN networks. Then, the pre-training results based on the KL divergence are fine-tuned to make the clustering results discriminative. The experimental results show that the proposed method outperforms existing deep clustering and general clustering algorithms in the CSI 300 and S&P 500 index markets. In addition, the clustering results combined with an inference strategy can be used to select stocks that perform well or poorly, thus guiding actual stock market trades.", "venue": "Future Internet", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-14", "journal": {"name": "Future Internet", "pages": "331", "volume": "14"}, "authors": [{"authorId": "50880705", "name": "Yuefeng Cen"}, {"authorId": "2190986791", "name": "Mingxing Luo"}, {"authorId": "2187638384", "name": "Gang Cen"}, {"authorId": "2109529597", "name": "Cheng Zhao"}, {"authorId": "2187691537", "name": "Zhigang Cheng"}], "citations": []}
