{"paperId": "6b75aca93e9b4af2642ea020601b93e59b15ef99", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "Service Function Placement Optimization For Cloud Service With End-to-End Delay Constraints", "abstract": "\n Network function virtualization (NFV) has been proposed to enable flexible management and deployment of the network service in cloud. In NFV architecture, a network service needs to invoke several service functions (SFs) in a particular order following the service chain function. The placement of SFs has significant impact on the performance of network services. However, stochastic nature of the network service arrivals and departures as well as meeting the end-to-end Quality of Service(QoS) makes the SFs placement problem even more challenging. In this paper, we firstly provide a system architecture for the SFs placement of cloud service with end-to-end QoS deadline. We then formulate the end-to-end service placement as a Markov decision process (MDP) which aims to minimize the placement cost and the end-to-end delay. In our MDP, the end-to-end delay of active services in the network is considered to be the state of the system, and the placement (nonplacement or placement) of SF is considered as the action. Also, we discuss the rationality of our analytical model by analyzing the Markov stochastic property of the end-to-end service placement. To obtain the optimal placement policy, we then propose an algorithm (Algorithm 1) for dynamic SFs placement based on our model and use successive approximations, i.e. $\\epsilon $-iteration algorithm (Algorithm 2) to obtain action distribution. Finally, we evaluate the proposed MDP by comparing our optimal method with DDQP, DRL-QOR, MinPath and MinDelay for QoS optimization, including acceptance probability, average delay, resource utilization, load-balancing and reliability.", "venue": "Computer/law journal", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-03", "journal": {"name": "The Computer Journal"}, "authors": [{"authorId": "2211229401", "name": "Guofeng Yan"}, {"authorId": "2291037852", "name": "Zhengwen Su"}, {"authorId": "2632621", "name": "Hengliang Tan"}, {"authorId": "2111147041", "name": "Jiao Du"}], "citations": []}
