{"paperId": "6b8b39aaf8297756fc755064437db212e6a7d467", "publicationVenue": {"id": "855d4173-dc30-48dc-96c2-42a5b6372940", "name": "IEEE Transactions on Emerging Topics in Computing", "type": "journal", "alternate_names": ["IEEE Trans Emerg Top Comput"], "issn": "2168-6750", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245516", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516"]}, "title": "Evaluating Reliability of SSD-Based I/O Caches in Enterprise Storage Systems", "abstract": "I/O caching techniques are widely employed in enterprise storage systems in order to enhance performance of I/O intensive applications in large-scale data centers. Due to higher performance compared to Hard Disk Drives (HDDs) and lower price and non-volatility compared to Dynamic Random-Access Memories (DRAM), Flash-based Solid-State Drives (SSDs) are used as a main media in the caching layer of storage systems. Although SSDs are known as non-volatile devices but recent studies have reported large number of data failures due to power outage in SSDs. To overcome the reliability implications of SSD-based I/O caching schemes, RAID-1 (mirrored) configuration is commonly used to avoid data loss due to uncommitted write operations. Such configuration, however, may still experience data loss in the cache layer due to correlated failures in SSDs. To our knowledge, none of previous studies have investigated the reliability of SSD-based I/O caching schemes in enterprise storage systems. In this paper, we present a comprehensive analysis investigating the reliability of SSD-based I/O caching architectures used in enterprise storage systems under power failure and high-operating temperature. We explore variety of SSDs from top vendors and investigate the cache reliability in mirrored configuration. To this end, we first develop a physical fault injection and failure detection platform and then investigate the impact of workload dependent parameters on the reliability of I/O cache in the presence of two common failure types in data centers, power outage and high temperature faults. We implement an I/O cache scheme using an open-source I/O cache module in Linux operating system. The experimental results obtained by conducting more than twenty thousand of physical fault injections on the implemented I/O cache with different write policies reveal that the failure rate of the I/O cache is significantly affected by workload dependent parameters. Our results show that unlike workload requests access pattern, the other workload dependent parameters such as request size, Working Set Size (WSS), and sequence of the accesses have considerable impact on the I/O cache failure rate. We observe a significant growth in the failure rate in the workloads by decreasing the size of the requests (by more than 14X). Furthermore, we observe that in addition to writes, the read accesses to the I/O cache are subjected to failure in presence of sudden power outage (the failure mainly occurs during promoting data to the cache). In addition, we observe that I/O cache experiences no data failure upon high temperature faults.", "venue": "IEEE Transactions on Emerging Topics in Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-04", "journal": {"name": "IEEE Transactions on Emerging Topics in Computing", "pages": "1914-1929", "volume": "9"}, "authors": [{"authorId": "40914288", "name": "Saba Ahmadian"}, {"authorId": "40977291", "name": "Farhad Taheri"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "fd4f13d0ed7daee4fbfbc96c3af1117bae5d8881", "title": "Efficient and robust data integrity verification scheme for high-performance storage devices"}, {"paperId": "87a83f5d349459f4dbe149b5549273a4e155f9af", "title": "Concurrent and Robust End-to-End Data Integrity Verification Scheme for Flash-Based Storage Devices"}]}
