{"paperId": "6b8f75393b932d0f51ee0c0213f05b2fef3861af", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "BioHD: an efficient genome sequence search platform using HyperDimensional memorization", "abstract": "In this paper, we propose BioHD, a novel genomic sequence searching platform based on Hyper-Dimensional Computing (HDC) for hardware-friendly computation. BioHD transforms inherent sequential processes of genome matching to highly-parallelizable computation tasks. We exploit HDC memorization to encode and represent the genome sequences using high-dimensional vectors. Then, it combines the genome sequences to generate an HDC reference library. During the sequence searching, BioHD performs exact or approximate similarity check of an encoded query with the HDC reference library. Our framework simplifies the required sequence matching operations while introducing a statistical model to control the alignment quality. To get actual advantage from BioHD inherent robustness and parallelism, we design a processing in-memory (PIM) architecture with massive parallelism and compatible with the existing crossbar memory. Our PIM architecture supports all essential BioHD operations natively in memory with minimal modification on the array. We evaluate BioHD accuracy and efficiency on a wide range of genomics data, including COVID-19 databases. Our results indicate that PIM provides 102.8× and 116.1× (9.3× and 13.2×) speedup and energy efficiency compared to the state-of-the-art pattern matching algorithm running on GeForce RTX 3060 Ti GPU (state-of-the-art PIM accelerator).", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-18", "journal": {"name": "Proceedings of the 49th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "2082353756", "name": "Zhuowen Zou"}, {"authorId": "2316352", "name": "Hanning Chen"}, {"authorId": "2138656476", "name": "Prathyush Poduval"}, {"authorId": "2140071418", "name": "Yeseong Kim"}, {"authorId": "3374270", "name": "Mahdi Imani"}, {"authorId": "3409842", "name": "Elaheh Sadredini"}, {"authorId": "3038395", "name": "Rosario Cammarota"}, {"authorId": "144576599", "name": "M. Imani"}], "citations": [{"paperId": "1ffbecb6f7ac033db23fa5bb1bdf4a9b40326973", "title": "In-Memory Acceleration of Hyperdimensional Genome Matching on Unreliable Emerging Technologies"}, {"paperId": "a3fd19474cea08ff4533239e98d540e7ad9a6c87", "title": "Self-Attention Based Semantic Decomposition in Vector Symbolic Architectures"}, {"paperId": "f8efcf6aa53ab3f16cf52ecb3c1c9a7e992edd6f", "title": "HDReason: Algorithm-Hardware Codesign for Hyperdimensional Knowledge Graph Reasoning"}, {"paperId": "c71a15e4f867ff315193b64f4f448ec9491e8bcf", "title": "TALCO: Tiling Genome Sequence Alignment Using Convergence of Traceback Pointers"}, {"paperId": "db0b8f7a27889c1f270e8e17671d9700dfad33a0", "title": "Hyperdimensional computing: a fast, robust and interpretable paradigm for biological data"}, {"paperId": "bb6b3ff29a324a5a6b8b3b35787b243d34db6cdc", "title": "HEAL: Brain-inspired Hyperdimensional Efficient Active Learning"}, {"paperId": "a2260cf9472537ef608b22836117a20b4a30b814", "title": "Fully Learnable Hyperdimensional Computing Framework With Ultratiny Accelerator for Edge-Side Applications"}, {"paperId": "50cbd2035deeffc6312e54043be1c028b609c51c", "title": "HyperFeel: An Efficient Federated Learning Framework Using Hyperdimensional Computing"}, {"paperId": "7880e882777f6aca21182146cab4d559af232f48", "title": "Robust Clustering using Hyperdimensional Computing"}, {"paperId": "45233b682b3b1434f8255dc4a6ce39efa0a05a96", "title": "Towards Efficient Hyperdimensional Computing Using Photonics"}, {"paperId": "e82e950aca92ed94f5ff5901c557cae2453396ad", "title": "MetaStore: High-Performance Metagenomic Analysis via In-Storage Computing"}, {"paperId": "6f6cdc435f211cd01014d7da92a11b107f0d4297", "title": "The Hyperdimensional Transform for Distributional Modelling, Regression and Classification"}, {"paperId": "1c25d9c4870a6f3ed6726c34fbeb4a1fbbbd19f4", "title": "HyperNode: An Efficient Node Classification Framework Using HyperDimensional Computing"}, {"paperId": "312e36a3e3359a9766e18aec5b3f7411b226095b", "title": "Brain-Inspired Trustworthy Hyperdimensional Computing with Efficient Uncertainty Quantification"}, {"paperId": "d61da8af12f5a35a28a626a620a4659b4a3f71de", "title": "Reliable Hyperdimensional Reasoning on Unreliable Emerging Technologies"}, {"paperId": "b3b4758b61e179a0e10d6aa1c225f239c0676c1e", "title": "GMX: Instruction Set Extensions for Fast, Scalable, and Efficient Genome Sequence Alignment"}, {"paperId": "cfcf7ab0cc7e2fe8c571178810a8c67627f179a5", "title": "CASA: An Energy-Efficient and High-Speed CAM-based SMEM Seeding Accelerator for Genome Alignment"}, {"paperId": "61fd95464c9d5c4f0d984bf48e91b508f1a99e82", "title": "Sparsity Controllable Hyperdimensional Computing for Genome Sequence Matching Acceleration"}, {"paperId": "a6d4dcb3cf087c3dcfb3edf3665cd287b59fae80", "title": "Memory-Based Computing for Energy-Efficient AI: Grand Challenges"}, {"paperId": "409f4b482b6356069f134d288ca2c0ab35c7773b", "title": "SEE-MCAM: Scalable Multi-Bit FeFET Content Addressable Memories for Energy Efficient Associative Search"}, {"paperId": "b09657afeeb873d0a84f4750ef6b3f8ffc308aca", "title": "HyperGRAF: Hyperdimensional Graph-Based Reasoning Acceleration on FPGA"}, {"paperId": "56084a77619bf2136616d091418ac8609995c891", "title": "Hardware-Optimized Hyperdimensional Computing for Real-Time Learning"}, {"paperId": "393e455bb1d1850e0d3de6af368d56f5cb67e43e", "title": "Learning from Hypervectors: A Survey on Hypervector Encoding"}, {"paperId": "a8d7a79a470a330678d9f903d6fd34311ef5282e", "title": "HyperAttack: An Efficient Attack Framework for HyperDimensional Computing"}, {"paperId": "c66ef2f0b55909b7fba792b150d77f10c95f4c4f", "title": "Hierarchical, Distributed and Brain-Inspired Learning for Internet of Things Systems"}, {"paperId": "66e34d29c14fdca454cd9406b483aafe8fb8d618", "title": "Accelerating open modification spectral library searching on tensor core in high-dimensional space"}, {"paperId": "e3a58b37e41e3e1057678a5403a1d2e8cd924701", "title": "Reinforcement Learning Data-Acquiring for Causal Inference of Regulatory Networks"}, {"paperId": "2b90793538e6e54e4170a1e3a109532ec7d230db", "title": "HDGIM: Hyperdimensional Genome Sequence Matching on Unreliable highly scaled FeFET"}, {"paperId": "6e44845a1774ce24a8732977c9d5f11df172985b", "title": "Comprehensive Analysis of Hyperdimensional Computing Against Gradient Based Attacks"}, {"paperId": "8249fa14e0c30c7c0111eb0aa02120e9815c9952", "title": "Recent Progress and Development of Hyperdimensional Computing (HDC) for Edge Intelligence"}, {"paperId": "f303d0df3ae57aa86366757dd2b12daef62c573d", "title": "Neurally-Inspired Hyperdimensional Classification for Efficient and Robust Biosignal Processing"}, {"paperId": "86a4896aae904abb08b0f06bb19384770bcc6aaa", "title": "Full Stack Parallel Online Hyperdimensional Regression on FPGA"}, {"paperId": "d91f10032d0a6b3e19e386beb55c9dc1d41eb3ef", "title": "HDPG: hyperdimensional policy-based reinforcement learning for continuous control"}, {"paperId": "dea60300d6e62b08df58fe78d52c49e34b57d33c", "title": "Neural computation for robust and holographic face detection"}]}
