{"paperId": "6b9529a35ab5adb5dff07d2b48bbf9f5206b8b15", "publicationVenue": {"id": "ca2cf7d7-0fd9-4338-b72f-48b0a5d6412c", "name": "Conference of the Centre for Advanced Studies on Collaborative Research", "type": "conference", "alternate_names": ["Conf Cent Adv Stud Collab Res", "CASCON"], "url": "http://cas.ibm.com/"}, "title": "From relations to multi-dimensional maps: a SQL-to-HBase transformation methodology", "abstract": "In this paper, we describe a methodology for migrating applications relying on relational databases to HBase backends. Our methodology includes (a) a SQL-to-HBASE data-schema migration step, and (b) a transformation of the application SQL queries to equivalent sequences of HBase API calls. Our data-schema migration method relies on a set of HBase-organization guidelines to drive a four-step data-schema transformation process. Some of these guidelines are query-agnostic: we defined them based on related literature regarding the desired properties of the HBase organization. Other guidelines are query-aware: we formulated them to incorporate data-access paths, extracted from query logs, in order to improve the quality of the transformation and the eventual access efficiency of the HBase repository. Our transformation method maintains a mapping between source and target schema that is used to create sequences of HBase API calls, equivalent to SQL queries in the relational database. We illustrate and validate our method with a case study and a comprehensive performance evaluation.", "venue": "Conference of the Centre for Advanced Studies on Collaborative Research", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-10-31", "journal": {"pages": "156-165"}, "authors": [{"authorId": "144519352", "name": "Diego Serrano"}, {"authorId": "1719731", "name": "Eleni Stroulia"}], "citations": [{"paperId": "659d8b24e53e8adfbcb1f16b26ada2cb8afa2c85", "title": "A Schema-First Formalism for Labeled Property Graph Databases: Enabling Structured Data Loading and Analytics"}, {"paperId": "3896e71e3d2c5c28af34c62b56e985cef443132e", "title": "Design methods for the new database era: a systematic literature review"}, {"paperId": "f8620fff3514c21b519e25d7d2a4cb3433e57510", "title": "ADAPTABASE - ADAPTIVE MACHINE LEARNING BASED DATABASE CROSSTECHNOLOGY SELECTION"}, {"paperId": "c9ff75f0bfabf9110ce50572940b69351c44e53e", "title": "Efficient Detection of Soft Concatenation Mapping"}, {"paperId": "b929f1589fc84e56bab6ca8021976ee83c71397a", "title": "A semi-automated framework for migrating web applications from SQL to document oriented NoSQL database"}]}
