{"paperId": "6b9e84a03d0ad38beba2c4ad42746d9a83028f93", "publicationVenue": null, "title": "Desarrollo y despliegue de un workflow para el análisis genómico de Campylobacter Jejuni", "abstract": "The rise of NGS techniques is generating a need for large amount of data to be analysed. This is encouraging new research groups to approach to the field of bioinformatics when they were previously unrelated to it. Groups that used to commission the analysis of their data to other research groups are beginning to develop their own workflows in order to analyse their data by themselves. In this context, Tecnofood, a University of Burgos research group with a long research history on sources of contamination in the food chain, has decided to develop a workflow to analyse the genome of the bacterium Campylobacter jejuni. This work studies its creation process, oriented to establish a first tool accessible to the group with which they will have the opportunity to make analyses of the strains of this bacterium and of other ones in the future. The interface of the framework used in its deployment, Galaxy, makes the workflow able to easily undergo modifications in the future. This will allow non-programmers to make workflow variations without the need for a new whole development. The system has been deployed on a Docker container trying to avoid unnecessary configuration and installation processes of a new environment to the user. The workflow is made of 6 main tools that solve aspects of quality filtering (Trimmomatic and Prinseq), assembly (SPAdes), labelling (Prokka), analysis of antibacterial resistance (ABRicate) and pangenomic analysis (Roary). Finally, this workflow has been tested using forty-six strains of Campylobacter jejuni, previously sequenced with an Illumina HiSeq and collected in a slaughterhouse in northern Spain.", "venue": "", "year": 2019, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2019-02-01", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "46712449", "name": "B. Aparicio"}, {"authorId": "144636643", "name": "J. Antonio"}], "citations": []}
