{"paperId": "6bcbaf45c1776f0bd88d99d5b6877a7f535bc8ce", "publicationVenue": null, "title": "Design of a DFS to Manage Big Data in Distance Education Environments", "abstract": "Information technologies have invaded every aspect of our lives. Distance education was also affected by this phase and became an accepted model of education. The evolution of education into a digital platform has also brought unexpected problems, such as the increase in internet usage, the need for new software and devices that can connect to the Internet. Perhaps the most important of these problems is the management of the large amounts of data generated when all training activities are conducted remotely. Over the past decade, studies have provided important information about the quality of training and the benefits of distance learning. However, Big Data in distance education has been studied only to a limited extent, and to date no clear single solution has been found. In this study, a Distributed File Systems (DFS) is proposed and implemented to manage big data in distance education. The implemented ecosystem mainly contains the elements Dynamic Link Library (DLL), Windows Service Routines and distributed data nodes. DLL codes are required to connect Learning Management System (LMS) with the developed system. 67.72% of the files in the distance education system have small file size (<=16 MB) and 53.10% of the files are smaller than 1 MB. Therefore, a dedicated Big Data management platform was needed to manage and archive small file sizes. The proposed system was designed with a dynamic block structure to address this shortcoming. A serverless architecture has been chosen and implemented to make the platform more robust. Moreover, the developed platform also has compression and encryption features. According to system statistics, each written file was read 8.47 times, and for video archive files, this value was 20.95. In this way, a framework was developed in the Write Once Read Many architecture. A comprehensive performance analysis study was conducted using the operating system, NoSQL, RDBMS and Hadoop. Thus, for file sizes 1 MB and 50 MB, the developed system achieves a response time of 0.95 ms and 22.35 ms, respectively, while Hadoop, a popular DFS, has 4.01 ms and 47.88 ms, respectively.", "venue": "Journal of universal computer science (Online)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-28", "journal": {"name": "J. Univers. Comput. Sci.", "pages": "202-224", "volume": "28"}, "authors": [{"authorId": "29017832", "name": "Mahmut Ünver"}, {"authorId": "51102125", "name": "A. Ergüzen"}, {"authorId": "51091466", "name": "Erdal Erdal"}], "citations": [{"paperId": "363eaed91df69fe431d81d6a92fdde5d65f422d3", "title": "Evolution and current state of research into E-learning"}, {"paperId": "037ea200fff605ddb1cfa8c1e7b9cce61a1d4c5c", "title": "KEPERLUAN PEMBINAAN MODEL PENGURUSAN DATA RAYA PEJABAT PENDIDIKAN DAERAH DI MALAYSIA"}]}
