{"paperId": "6bf59c30ef8a08cdcd87ef1ae3dd3f36bb8f8792", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Comprehensive Study of Anomaly Detection Schemes in IoT Networks Using Machine Learning Algorithms", "abstract": "The Internet of Things (IoT) consists of a massive number of smart devices capable of data collection, storage, processing, and communication. The adoption of the IoT has brought about tremendous innovation opportunities in industries, homes, the environment, and businesses. However, the inherent vulnerabilities of the IoT have sparked concerns for wide adoption and applications. Unlike traditional information technology (I.T.) systems, the IoT environment is challenging to secure due to resource constraints, heterogeneity, and distributed nature of the smart devices. This makes it impossible to apply host-based prevention mechanisms such as anti-malware and anti-virus. These challenges and the nature of IoT applications call for a monitoring system such as anomaly detection both at device and network levels beyond the organisational boundary. This suggests an anomaly detection system is strongly positioned to secure IoT devices better than any other security mechanism. In this paper, we aim to provide an in-depth review of existing works in developing anomaly detection solutions using machine learning for protecting an IoT system. We also indicate that blockchain-based anomaly detection systems can collaboratively learn effective machine learning models to detect anomalies.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "26565727", "name": "A. Diro"}, {"authorId": "9219862", "name": "N. Chilamkurti"}, {"authorId": "2147319121", "name": "Van-Doan Nguyen"}, {"authorId": "2145540588", "name": "Will Heyne"}], "citations": [{"paperId": "d4d1ef7d9e2327ba0a8f84e62314c5f015afcff9", "title": "Collaborative Cybersecurity Using Blockchain: A Survey"}, {"paperId": "b15615850bd65c9c4c0363ea122232e4a6770c2d", "title": "Machine Learning and Deep Learning Techniques for Internet of Things Network Anomaly Detection—Current Research Trends"}, {"paperId": "5173742c050adda18db6cd906c6521a71941682c", "title": "An Unsupervised Machine Learning Algorithm for Attack and Anomaly Detection in IoT Sensors"}, {"paperId": "f313c0c84df7b478a30ec9c440edaddbb1e8859e", "title": "Machine Learning and Blockchain: A Bibliometric Study on Security and Privacy"}, {"paperId": "24424030aed886d7b6affcc41f618424a541c92b", "title": "Anomaly Detection for Space Information Networks: A Survey of Challenges, Techniques, and Future Directions"}, {"paperId": "482be8da43cc1945829471f19bb86af4aaecfe2b", "title": "Anomaly detection using deep convolutional generative adversarial networks in the internet of things."}, {"paperId": "64eb533b120fc6f998eb0b32f9e9e53b3cfb6ac5", "title": "Anomaly Detection for IOT Systems Using Active Learning"}, {"paperId": "179e6dd0f7b277929e5503388082e979a91d371e", "title": "Addressing the Faults Landscape in the Internet of Things: Toward Datacentric and System Resilience"}, {"paperId": "c192e39d26d2b7b6f4b5048476230a5082a2a69a", "title": "Artificial Intelligence for Anomaly Detection in IoMTs"}, {"paperId": "03c1de7c0c8d4aed9fa09c9cc4954dc1fb7d6716", "title": "Dimensionality reduction for detection of anomalies in the IoT traffic data"}, {"paperId": "8ea05bbb6983a722781dc897d186a3f95d9f240d", "title": "Exploring the Confluence of IoT and Metaverse: Future Opportunities and Challenges"}, {"paperId": "0cb3c55224079a045ff66c0a625fd297b94fa987", "title": "Extensive Analysis of IoT Assisted Fake Currency Detection using Novel Learning Scheme"}, {"paperId": "ff1b03ed48d43742f14bec4ae5964aed22f983a8", "title": "Improved bacterial foraging optimization with deep learning based anomaly detection in smart cities"}, {"paperId": "095158967e14ccd5c6aa6fe034d31df1da31dd30", "title": "Comparative Study on Semi-Supervised Learning Applied for Anomaly Detection in Hydraulic Condition Monitoring System"}, {"paperId": "274839ca1df854c19e5c4a547717a0801c531208", "title": "Improving Reliability for Detecting Anomalies in the MQTT Network by Applying Correlation Analysis for Feature Selection Using Machine Learning Techniques"}, {"paperId": "8465f5e9ce41f9dc170cb34919c67be0c51d8cbf", "title": "Blockchain and Machine Learning Security for the Internet of Things: A Bibliometric Analysis"}, {"paperId": "e9f466b8fb0fa58ff2960b1f54b2f9eb6446c6c0", "title": "Anomaly-based cyberattacks detection for smart homes: A systematic literature review"}, {"paperId": "a8dd2e1e47b998bcf9dbffbc99c9c856c72d60b1", "title": "TinyAD: Memory-Efficient Anomaly Detection for Time-Series Data in Industrial IoT"}, {"paperId": "ccb97efd7dcb7a800f7fcedba43498f32fc7e450", "title": "CADeSH: Collaborative Anomaly Detection for Smart Homes"}, {"paperId": "65df3c90a774fb9bfb52904764e6a4cf816db47f", "title": "Wireless Sensing and Networking for the Internet of Things"}, {"paperId": "f433d510a2134a03043c67fb802cad233e38e3c9", "title": "Anomaly Detection and Repairing for Improving Air Quality Monitoring"}, {"paperId": "2d86ea32eac8da6fbb3f3d24936515e39e477bdb", "title": "Hierarchical Image Transformation and Multi-Level Features for Anomaly Defect Detection"}, {"paperId": "0b07edf0188cfd577f7535f2747f5f53116a9aa6", "title": "LSTM-Autoencoder for Vibration Anomaly Detection in Vertical Carousel Storage and Retrieval System (VCSRS)"}, {"paperId": "8050096dc43bc53133b8571afb19d97d5b7a561e", "title": "Sparse random neural networks for online anomaly detection on sensor nodes"}, {"paperId": "dd846315a8f59f0b444b87ff97a43ecdf3c42924", "title": "Analysis of time series data for anomaly detection"}, {"paperId": "961fcc9b37f8496fff4a5cc48487642690f79c23", "title": "FLDID: Federated Learning Enabled Deep Intrusion Detection in Smart Manufacturing Industries"}, {"paperId": "9deeec40cf96dea4f6928f128ca0c1643120d0d5", "title": "Machine Learning-Enabled Internet of Things (IoT): Data, Applications, and Industry Perspective"}, {"paperId": "ff4831857071965395f01dc4eab46a50275fe7f9", "title": "A Comparative Study and a New Industrial Platform for Decentralized Anomaly Detection Using Machine Learning Algorithms"}, {"paperId": "694e9b86ee7f34d2a40f73bb388788cd89db4e6e", "title": "Detection of Distributed Denial of Service (DDoS) Attacks in IOT Based Monitoring System of Banking Sector Using Machine Learning Models"}, {"paperId": "ebc32a1ded7edc1a006140c2b53a00f6ced1ca88", "title": "Edge-Computing and Machine-Learning-Based Framework for Software Sensor Development"}, {"paperId": "c538f391d26e074ecb0bc27cc18acfe27e744da3", "title": "Realtime Feature Engineering for Anomaly Detection in IoT Based MQTT Networks"}, {"paperId": "dfd132b774fa8217639b165ec653890a1bc405ad", "title": "Anomaly Detection in Hobbing Tool Images: Using An Unsupervised Deep Learning Approach in Manufacturing Industry"}, {"paperId": "988188a422f591467399a90fb4dcf119837e98ba", "title": "Machine Learning-Based Anomaly Detection for Multivariate Time Series With Correlation Dependency"}, {"paperId": "764d8fb51d61f81b385e370b99f65cf82dda9833", "title": "A Secure Hybrid Deep Learning Technique for Anomaly Detection in IIoT Edge Computing"}]}
