{"paperId": "6bf808c3cd762b850f73b6aa735f9c3821cad7cc", "publicationVenue": {"id": "6bf48d72-eba2-4918-b9a0-153280062513", "name": "International Computer Science Conference", "type": "conference", "alternate_names": ["IEEE International Conference on Semantic Computing", "IEEE International conference semantic computing", "International Conference Spatial Cognition", "Resource Track - ICSC", "Int Conf Semantic Comput", "ICSC", "Int Comput Sci Conf", "IEEE Int Conf Semantic Comput", "Int Conf Spat Cogn", "IEEE Int conf semantic comput", "International Conference on Semantic Computing"], "url": "http://icsc.eecs.uci.edu/"}, "title": "Data Partitioning Scheme for Efficient Distributed RDF Querying Using Apache Spark", "abstract": "The rapid growth of semantic data in the form of Resource Description Framework (RDF) triples demands an efficient, scalable, and distributed storage and parallel processing strategies along with high availability and fault tolerance for its management and reuse. There are three open issues with distributed RDF data management systems that are not well addressed altogether in existing work. First is the querying efficiency, second, solutions are optimized for certain types of query patterns and don't necessarily work well for all types of query patterns, and the third is concerned with reducing pre-processing and data loading times. To address these issues, we propose a relational partitioning scheme called Subset Property Table (SPT) for RDF data that further partitions the existing Property Table approach into subsets of tables to minimize query input and join operation. We combine SPT with another existing model Vertical Partitioning (VP) for storing RDF datasets and demonstrate that our proposed combined (SPT + VP) approach outperforms state-of-the-art systems based on in-memory processing engine in a distributed environment.", "venue": "International Computer Science Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-03-11", "journal": {"name": "2019 IEEE 13th International Conference on Semantic Computing (ICSC)", "pages": "24-31"}, "authors": [{"authorId": "2042697689", "name": "Mahmudul Hassan"}, {"authorId": "1720381", "name": "S. Bansal"}], "citations": [{"paperId": "65ca81d79a6f6b6fca5d592e82cbc9f70f889110", "title": "Tabel Partisi Pada STARS: Konsep Dan Evaluasi (Studi Kasus STARS UKSW)"}, {"paperId": "68cee58a53d152cb19d8a9c4ae54a691e6c9c213", "title": "S3QLRDF: distributed SPARQL query processing using Apache Spark—a comparative performance study"}, {"paperId": "f8f990d434e8a190357033a8c9d87b8d6a20d630", "title": "A Parallel Processing Architecture to Optimize Runtime in Aggregated SPARQL Queries"}, {"paperId": "037891f3cec1f81bfb2fec10e9b294bb25845384", "title": "A survey of RDF stores & SPARQL engines for querying knowledge graphs"}, {"paperId": "dab0d18550f9f222ed675756bb6e783118de4a3d", "title": "FP-ExtVP: Accelerating Distributed SPARQL queries by Exploiting Load-adaptive Partitioning"}, {"paperId": "82925c67521374f372dc1f2c0411e2905468259d", "title": "Implementation and performance analysis of dynamic partitioning of graphs in Apache Spark"}, {"paperId": "a378674107132963014ec2ae86c390d2c7d70105", "title": "Implementation and Performance Comparison of Partitioning Techniques in Apache Spark"}, {"paperId": "378c2332df0c06c4a8aac723b62e3266fea3c48b", "title": "DIAERESIS: RDF Data Partitioning and Query Processing on SPARK"}, {"paperId": "e8c7c66f0f0fd0ddb8bc0e59b43fd43ebf26f460", "title": "Exploiting Wide Property Tables Empowered by Inverse Properties for Efficient Distributed SPARQL Query Evaluation"}]}
