{"paperId": "6bfd88b8d69ad74bd8e110d4400f2d3ac6730794", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Load Balancing in Cloud Environment: A State-of-the-Art Review", "abstract": "IT services and resources on-demand through Internetwork are offered by Cloud Computing (CC), including the pay-for-you-go aspect. A lot is offered by the CC paradigm, such as Infrastructure related services, computing services, storage, and environments for deployment are also provided. The objective of this study is to survey one of the significant challenges in cloud computing, which is a multi-variant, multi-constraint issue termed Load unbalancing, resulting in the demising of the scalability, efficiency, and performance of the system. Equilibrium in the server workload distribution is still strived for by cloud service providers. The unbalancing issue is resolved by load balancing solutions in two ways: overloading and underloading. An extensive structural literature analysis of Load balancing and its constituent domains with the inclusion of various parameters, such as scalability, make-span, and throughput, are depicted in this research paper to enhance the QoS. A detailed and organized taxonomy of all the Load balancing algorithms based on nature system state, techniques, functionality, and types is also presented. The major focus of the survey is around the Static, dynamic, hybrid, and nature-inspired Load-Balancing algorithms.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "134517-134530", "volume": "11"}, "authors": [{"authorId": "2268592514", "name": "Yogesh Lohumi"}, {"authorId": "50098979", "name": "Durgaprasad Gangodkar"}, {"authorId": "2268573387", "name": "Prakash Srivastava"}, {"authorId": "2151704266", "name": "Mohammad Zubair Khan"}, {"authorId": "145710775", "name": "Abdulrahman Alahmadi"}, {"authorId": "2534279", "name": "A. Alahmadi"}], "citations": [{"paperId": "ed4521215af9e5d7de2cd8db1b9ab1db2f94116a", "title": "A Comparative Study of Various Load Balancing Algorithm in Cloud Computing Environment"}]}
