{"paperId": "6c007113c4ed81e756af89ea8cedafa57bf808c0", "publicationVenue": null, "title": "Development of a tool for anomaly detection and power load forecasting: the case of Politecnico di Torino", "abstract": "Il settore degli edifici e uno dei piu energivori a livello mondiale. In quest'ottica, l'incremento dell'efficienza dei sistemi energetici degli edifici e di primaria importanza. Una delle soluzioni piu promettenti in materia e rappresentata dall'integrazione di sistemi di gestione dell'energia all'interno degli edifici, capaci di ridurre i consumi e gli sprechi, mantenendo ottime condizioni ambientali per gli occupanti. Questi sistemi necessitano di strumenti in grado di prevedere i consumi energetici futuri nel breve periodo su intervalli variabili, al fine di migliorare la loro gestione delle risorse e dei carichi. I cosiddetti modelli inversi \"data-driven\", sono tra i piu promettenti per adempiere a questo compito e, insieme alle tecniche di \"data mining\", possono essere efficacemente utilizzati per analizzare gli edifici sia a scopi diagnostici che per sviluppare tecnologie in grado di controllarne direttamente i sistemi energetici. In questo lavoro viene svolta un'analisi di letteratura circa i principali modelli inversi di tipo \"data-driven\" e le relative applicazioni in campo di previsione dei fabbisogni energetici, controllo degli impianti, rilevazione di anomalie, gestione della domanda e valutazione comparativa. Infine, a partire dai dati riguardanti la sottostazione elettrica C del Politecnico, forniti dal Living Lab, viene sviluppato uno strumento in grado di rilevare le anomalie di consumo e di classificarle in quattro diverse categorie appartenenti a una libreria di dati anomali, identificati grazie ad analisi di \"data mining\" effettuate sui dati storici. Questo strumento e, inoltre, in grado di fornire previsioni orarie del consumo di energia elettrica su un orizzonte di ventiquattro ore, quantificandone le quote adibite a ciascun uso finale, in modo da facilitare il monitoraggio dei consumi e da permettere un'analisi preventiva della forma del profilo e del relativo orario e picco di potenza.", "venue": "", "year": 2018, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2018-10-18", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "103938223", "name": "Edoardo Chiabrera"}], "citations": [{"paperId": "8dec3de1c990a8f436433249703bfcd0b2da98b0", "title": "Detection and diagnosis of anomalous energy consumption patterns in buildings through a data analytics based approach"}]}
