{"paperId": "6c06fa9485032913a2f644adcb6e160229fd3f6a", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "NETS: Extremely Fast Outlier Detection from a Data Stream via Set-Based Processing", "abstract": "This paper addresses the problem of efficiently detecting outliers from a data stream as old data points expire from and new data points enter the window incrementally. The proposed method is based on a newly discovered characteristic of a data stream that the change in the locations of data points in the data space is typically very insignificant. This observation has led to the finding that the existing distance-based outlier detection algorithms perform excessive unnecessary computations that are repetitive and/or canceling out the effects. Thus, in this paper, we propose a novel set-based approach to detecting outliers, whereby data points at similar locations are grouped and the detection of outliers or inliers is handled at the group level. Specifically, a new algorithm NETS is proposed to achieve a remarkable performance improvement by realizing set-based early identification of outliers or inliers and taking advantage of the \"net effect\" between expired and new data points. Additionally, NETS is capable of achieving the same efficiency even for a high-dimensional data stream through two-level dimensional filtering. Comprehensive experiments using six real-world data streams show 5 to 25 times faster processing time than state-of-the-art algorithms with comparable memory consumption. We assert that NETS opens a new possibility to real-time data stream outlier detection.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1303-1315", "volume": "12"}, "authors": [{"authorId": "3396235", "name": "Susik Yoon"}, {"authorId": "2143422249", "name": "Jae-Gil Lee"}, {"authorId": "145056611", "name": "B. Lee"}], "citations": [{"paperId": "5ff01f7f01c72c20f9f930633e2289bc23ed99f7", "title": "An Outlier Detection Algorithm Based on Probability Density Clustering"}, {"paperId": "f9f7b0f4feaf9b6a59ae9c983000d33fc48c6870", "title": "Missing Value Imputation for Multi-attribute Sensor Data Streams via Message Propagation"}, {"paperId": "7310814d3f9f746085ad24c87a54722b1896b549", "title": "An Experimental Evaluation of Anomaly Detection in Time Series"}, {"paperId": "f599e27a43e019f4b0afecf7a97bbd05ed302938", "title": "Cleaning Big Data Streams: A Systematic Literature Review"}, {"paperId": "873beda4580fa606cd4a611cd7508dbee04937f2", "title": "Review of Anomaly Detection Algorithms for Data Streams"}, {"paperId": "eaa3f756eecf3ec3dae19c6aaf9d19e132f639a4", "title": "SCStory: Self-supervised and Continual Online Story Discovery"}, {"paperId": "9a94e59850b9dc967be0f09f5951dc904eee2aa4", "title": "Anomaly detection for high‐dimensional dynamic data stream using stacked habituation autoencoder and union kernel density estimator"}, {"paperId": "3f94f3761299209cc27dd1c2ea3616bb200663f4", "title": "A novel abnormal data detection method based on dynamic adaptive local outlier factor for the vibration signals of rotating parts"}, {"paperId": "93a7e45abbc0e4c522bc49953435fb16efa5cea9", "title": "Unsupervised Story Discovery from Continuous News Streams via Scalable Thematic Embedding"}, {"paperId": "2a6998d155dbd25ef6f6e70df3f4cf47da48af9d", "title": "BPF: a novel cluster boundary points detection method for static and streaming data"}, {"paperId": "f8ffe5aab2e7a9b7f2bd557f8e668a2fab9b23c1", "title": "Context-aware Outlier Detection for Sensor Data Stream Processing"}, {"paperId": "43971299f110516dea7715da2fcb4eec33f5284c", "title": "PDSum: Prototype-driven Continuous Summarization of Evolving Multi-document Sets Stream"}, {"paperId": "23449903f01f2381e02defbcd195d1bfbf1cfcd6", "title": "Outlier and Trend Detection Using Approximate Median and Median Absolute Deviation"}, {"paperId": "7a53f07ed623fd6568cb7b3ee5df8a5932ce7813", "title": "A context-aware unsupervised predictive maintenance solution for fleet management"}, {"paperId": "03b097f6a5d72a8df1ed1567c1e2ce0ae4660970", "title": "A meta-level analysis of online anomaly detectors"}, {"paperId": "8027f95573e6c2cc1c977c60e87717f33f824eab", "title": "Adaptivity in continuous massively parallel distance-based outlier detection"}, {"paperId": "c32bc506b38c3a1eca4d2aeeb0a3a9a95df347c5", "title": "Adaptive Model Pooling for Online Deep Anomaly Detection from a Complex Evolving Data Stream"}, {"paperId": "3b053b6aae6c229cead204c03b75290ac746b1f3", "title": "Fast, exact, and parallel-friendly outlier detection algorithms with proximity graph in metric spaces"}, {"paperId": "757917dba2169ad0d3c5f5fe3ede6cb5d2655548", "title": "A GPU Algorithm for Detecting Contextual Outliers in Multiple Concurrent Data Streams"}, {"paperId": "91e6a96d2e359176b720f8532259d87db10f6996", "title": "Unsupervised Time Series Outlier Detection with Diversity-Driven Convolutional Ensembles"}, {"paperId": "9d4b2da6e25326ceb89d372cf4e35fe8e0e82765", "title": "TOD: GPU-accelerated Outlier Detection via Tensor Operations"}, {"paperId": "ebcccfde75e54bcb412f8399ec9f01b6cb403ef3", "title": "Multiple Dynamic Outlier-Detection from a Data Stream by Exploiting Duality of Data and Queries"}, {"paperId": "97fad2553993e94495d81c2cade075df14134a6c", "title": "Fast and Exact Outlier Detection in Metric Spaces: A Proximity Graph-based Approach"}, {"paperId": "57051ca49e8d4c16bb5b0bb50154497911f391c0", "title": "Benchmarking performance of different noise detection techniques on data stream clustering"}, {"paperId": "a805088020c347c3f6116407e3bb9a8858b2a3c1", "title": "Distributed Spatial-Keyword kNN Monitoring for Location-aware Pub/Sub"}, {"paperId": "0a1663c4ba7d5cf5141372328160672eb203b035", "title": "Using Multivariate Outliers from Smartphone Sensor Data to Detect Physical Barriers While Walking in Urban Areas"}, {"paperId": "c876ea4f33e7c4363d91afe319ff72d1d4ec8fad", "title": "Fast and Scalable Outlier Detection with Sorted Hypercubes"}, {"paperId": "2c9ea4b2ad34a747d7a6ebe00dfaae11fc5edc7e", "title": "Real-Time Distance-Based Outlier Detection in Data Streams"}, {"paperId": "a9e9e44f302e54bd595088ba2dbc9607098a9422", "title": "PROUD: PaRallel OUtlier Detection for Streams"}, {"paperId": "6378817c28d21b5061fb631be8083b53cb572d5c", "title": "Fast Distance-based Outlier Detection in Data Streams based on Micro-clusters"}, {"paperId": "279408b34d9c719dfd364ec293f3cdb2b991ca54", "title": "Continuous Outlier Mining of Streaming Data in Flink"}, {"paperId": "e880d8a17ab90d2d7bd59101d646abcb8306137c", "title": "Learning Spatial Graph Structure for Multivariate KPI Anomaly Detection in Large-Scale Cyber-Physical Systems"}, {"paperId": "292b924651d9bdbce19cabf6ebe5a6b2b39b0e13", "title": "Context-Aware Deep Time-Series Decomposition for Anomaly Detection in Businesses"}, {"paperId": "1ba981c201cb6c9a62a5188786de8d28e5f40af3", "title": "Explainable Distance-based Outlier Detection in Data Streams"}, {"paperId": "fa1cb824eec112f219414ddaffdbf2647c79ca4a", "title": "VOA*: Fast Angle-Based Outlier Detection over High-Dimensional Data Streams"}, {"paperId": "8f0bd307d64f34dbef5672f653812566c15f3c63", "title": "KNN-Based Approximate Outlier Detection Algorithm Over IoT Streaming Data"}, {"paperId": "ed4d79070b40923c7db91de331be87406d88e563", "title": "Revisiting Streaming Anomaly Detection: Benchmark and Evaluation"}]}
