{"paperId": "6c19a4f92cd2e813e76ac7f89ae3d316432f9b9f", "publicationVenue": {"id": "eb4a4fda-0888-4ead-8fc4-e42b15ee7001", "name": "Ciencia Latina Revista Científica Multidisciplinar", "type": "journal", "alternate_names": ["Cienc Lat Rev Científica Multidiscip"], "issn": "2707-2207", "url": "http://ciencialatina.org/"}, "title": "Distribución de alimentos de los comités de vaso de leche: programa social desarrollado por la municipalidad provincial de San Martín", "abstract": "La investigación se planteó con el fin de diseñar una propuesta de modelo estratégico que contribuya a la distribución de alimentos de los comités de vaso de leche de la municipalidad provincial de San Martín, 2021. La investigación fue de tipo básico, con un diseño descriptivo propositivo. Existen procesos de toma de decisiones estratégicas que, de acuerdo a la teoría del procesamiento de información organizacional, la visión de la empresa permite argumentar la racionalidad procedimental y politización como un efecto negativo en la internacionalización de las pymes. Se evidenció la importancia que tiene la inteligencia estratégica de los líderes empresariales para el desarrollo y crecimiento de su organización a su cargo. Se demostró que la globalización de la producción de los alimentos influye en la estructura de la distribución de las cadenas de suministros de alimentos. en modelización de un sistema de distribución de la cadena de suministro de cereales alimentarios sostenible, mencionaron que la demanda de los alimentos, la degradación ambiental, las perdidas postcosecha y la escasez de recursos alientan a los tomadores de decisiones de los países en desarrollo a integrar los aspectos económicos y ambientales en el diseño de la red de distribución de los alimentos. El problema más importante de la competitividad de las universidades rusas es la falta de flexibilidad estratégica, que afecta a todo el sistema de educación universitaria para Rusia. Concluyendo que el modelo estratégico es una herramienta poderosa en la gestión de programas sociales que permite el cumplimiento de los objetivos estratégicos de cualquier tipo de organización de una manera eficiente; además que la distribución de los alimentos, cumple una función principal en la generación de desarrollo para la sociedad y el modelo estratégico cumple un papel importante en la determinación de la distribución de alimentos.", "venue": "Ciencia Latina Revista Científica Multidisciplinar", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-08-01", "journal": {"name": "Ciencia Latina Revista Científica Multidisciplinar"}, "authors": [{"authorId": "88211300", "name": "L. García"}, {"authorId": "104129333", "name": "Keller Sánchez Dávila"}], "citations": []}
