{"paperId": "6c20ea5dfcc6192a64920e7ea5f6d3c0e889945c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "SBPG: Secure Better Portable Graphics for Trustworthy Media Communications in the IoT", "abstract": "Smart Healthcare is envisioned as the combination of traditional healthcare augmented by smart bio-sensors, wearable devices, and a plethora of on-body sensors that communicate with smart hospitals, smart emergency response systems, and ambulances, through advanced information and communication technologies. The vision of smart healthcare as part of a smart city relies on the framework of the Internet of Things (IoT) as the underlying core technology that enables the design and operation of a city, whereby smart technology, energy grids, transportation, buildings, communication, and information technology, are all interconnected. This paper addresses some of the challenges faced in the IoT infrastructure, specifically secure communication and user authentication in the context of automated analysis of biomedical images and communication of the analysis results and related metadata in a smart healthcare framework. A hardware architecture for a secure digital camera integrated with the secure better portable graphics (SBPG) compression algorithm, suitable for applications in the IoT, is proposed in this paper. The focus of this paper is on patient data protection and authentication. The proposed SBPG architecture offers two layers of protection, concurrent encryption and watermarking, which address all issues related to security, privacy, and digital rights management. The experimental results demonstrate that the new compression technique BPG outperforms JPEG in terms of compression quality and compressed file size while providing increased image quality. High performance requirements of BPG have been met by employing two techniques: 1) insertion of an encrypted signature in the center portion of the image and 2) frequency-domain watermarking using blockwise DCT of size  $8\\times 8$  pixels. These approaches optimize the proposed architecture by decreasing computational complexity while maintaining strong protection, with concomitant increase of the speed of the watermarking and compression processes. A Simulink® prototype for the proposed architecture has been built and tested. To the best of our knowledge, the hardware architecture for BPG compression with built-in image authentication capability for integration with a secure digital camera is the first one ever proposed.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-01-18", "journal": {"name": "IEEE Access", "pages": "5939-5953", "volume": "6"}, "authors": [{"authorId": "1710189", "name": "S. Mohanty"}, {"authorId": "1921834", "name": "E. Kougianos"}, {"authorId": "2227325", "name": "P. Guturu"}], "citations": [{"paperId": "3b8eeb98d84a3c43a669a50b32d33bd8b8793dc7", "title": "Secure Healthcare Model Using Multi-Step Deep Q Learning Network in Internet of Things"}, {"paperId": "22cafcd8393623c4e509fb67180385c36295d2b7", "title": "Information Security Applications in Smart Cities: A Bibliometric Analysis of Emerging Research"}, {"paperId": "423ffcd25107645d7cc096de9c330d1d2e617eb0", "title": "Learning-driven lossy image compression: A comprehensive survey"}, {"paperId": "4102b6f0243d83372dda70802caf36224a30b5df", "title": "Visual Communication Design Using Machine Vision and Digital Media Communication Technology"}, {"paperId": "513693ad8e5a254293d5ffdccc38028fae4edde1", "title": "Learning-Driven Lossy Image Compression; A Comprehensive Survey"}, {"paperId": "fdd8b7de368cbf540b2653f9f3d6db3aa520cc70", "title": "The role of the Internet of Things in Healthcare in supporting clinicians and patients: A narrative review"}, {"paperId": "2f6d6fbc24ce816d9fd325f8af288b3c7791b9f6", "title": "VLSI Implementation of a Cost-Efficient Loeffler DCT Algorithm with Recursive CORDIC for DCT-Based Encoder"}, {"paperId": "e11b318e3533a54580427e5bd620ae3db7899afc", "title": "Eternal-Thing 2.0: Analog-Trojan Resilient Ripple-Less Solar Energy Harvesting System for Sustainable IoT in Smart Cities and Smart Villages"}, {"paperId": "f7265ac58f781cd09383d56fc663e78cdabbedc7", "title": "Optimizing Image Compression With Deep Super-Resolution Techniques"}, {"paperId": "6eefbb79f98e902e9d2efa057bfea174843bf3dc", "title": "Analysis of healthcare big data"}, {"paperId": "9090516f0e9831abbc355d5300095c4f300834d2", "title": "Advance hybrid medical watermarking algorithm using speeded up robust features and discrete cosine transform"}, {"paperId": "9a6e992f4d05c6435588f3959d5874b20f4c1bfc", "title": "Huffman quantization approach for optimized EEG signal compression with transformation technique"}, {"paperId": "f877f1df136a7646edc592028f2cec9309441e65", "title": "Architectural Framework for Intelligent and Secure Aadhar Data Management Synchronized with both Offline and Online Transaction Systems"}, {"paperId": "8793815fffb7292614cab7878c8deb873d4a215b", "title": "Digital transformation in the area of health: systematic review of 45 years of evolution"}, {"paperId": "4240e44204c3ac7f6ba9659a060b08662f0acce5", "title": "A hybridized methodology of different wavelet transformations targeting medical images in IoT infrastructure"}, {"paperId": "b05e49e098ad6c626ee21f7e5470783233b3740b", "title": "Embedded Dynamic Modification for Efficient Watermarking Using Different Medical Inputs in IoT"}, {"paperId": "21dcd384b3a8d3da21209601617f71fac06e3124", "title": "A Comparative Study in the Application of IoT in Health Care: Data Security in Telemedicine"}, {"paperId": "c341d5555085c540d20955c0c973d456a8f73cde", "title": "Audio Transmission of Medical Reports for Visa Processing: A Solution for the Spread of Communicable Diseases by the Immigrant Population"}, {"paperId": "1d575c36945d497ae61a15beb07e73fa1ec31437", "title": "Efficient Two-Layer Image Protection with Wavelet Transform Compression"}, {"paperId": "860aa73aa8fccd8a3bafb94a529c2c14bb9fc2af", "title": "Existing Trends of Digital Watermarking and its Significant Impact on Multimedia Streaming: A Survey"}, {"paperId": "ae3c4c072fa57e9b8acffdab1eb0badb01845850", "title": "Security, Privacy and Trust in the IoT Environment"}]}
